[{"viet": "Cuốn sách đòi hỏi có sự tập trung cao độ.", "eng": "A book that requires great concentration."}, {"viet": "Một đứa trẻ được dạy dỗ đàng hoàng về lễ phép.", "eng": "A child who is well-schooled in good manners."}, {"viet": "Một cuộc tranh giành chức cao nhất trong công đoàn.", "eng": "A contest for the top job in the union."}, {"viet": "Sự phẫn uất ăn sâu trong lòng về cách mình bị đối xử.", "eng": "A deep-seated resentment over the way one has been treated."}, {"viet": "Một cái áo đầm được đính trang kim bạc lấm tấm.", "eng": "A dress strangled with tiny silver sequins."}, {"viet": "Một bộ phim tạo ra một bầu không khí đe dọa.", "eng": "A film that creates an atmosphere of menace."}, {"viet": "Một nguyên tắc thông thường có thể có một vài ngoại lệ.", "eng": "A general principle to which there may be several exceptions."}, {"viet": "Một người đàn ông bé nhỏ khốn khổ sống trong một căn phòng nhỏ tồi tàn tại một khu ổ chuột của thành phố.", "eng": "A grotty little man living in a grotty little room in a grotty part of town."}, {"viet": "Một loài bướm đêm cho đến bây giờ vẫn chưa ai biết.", "eng": "A hitherto unknown species of moth."}, {"viet": "Một phản ứng máy móc khi đề cập đến vấn đề mãi dâm.", "eng": "A knee-jerk reaction to the mention of prostitution."}, {"viet": "Một lớp tuyết mỏng phủ trên mặt đất.", "eng": "A light covering of snow on the ground."}, {"viet": "Một bà quan tòa vốn nổi tiếng vì sự khoan dung của bà ấy đối với những ai phạm tội lần đầu.", "eng": "A magistrate known for her lenience with first-time offenders."}, {"viet": "Một bản sao thu nhỏ mẹ của nàng.", "eng": "A miniature edition of her mother."}, {"viet": "Một nhà máy mới sẽ được đặt tại địa điểm này.", "eng": "A new factory is to be located on this site."}, {"viet": "Một cặp kính có gọng vàng.", "eng": "A pair of spectacles with gold rims."}, {"viet": "Một nhạc sĩ dương cầm có danh tiếng quốc tế.", "eng": "A pianist with an international reputation."}, {"viet": "Một chức vụ do quốc vương bổ nhiệm.", "eng": "A post in the sovereign's gift."}, {"viet": "Một dự án xây dựng tầm thường.", "eng": "A quick-and-dirty construction project."}, {"viet": "Một nhận thức đầy ý nghĩa về mối giao dịch giữa tác giả và độc giả.", "eng": "A rich sense of transaction between writer and reader."}, {"viet": "Một chỗ ngồi không bị cản tầm nhìn lên sân khấu.", "eng": "A seat with an unimpeded view of the stage."}, {"viet": "Một cuốn sách giáo khoa đơn giản và dễ hiểu giúp giải tỏa được phần nào sự kỳ bí quanh máy vi tính.", "eng": "A simple, straightforward textbook that help to dispel some of the mystique surrounding computers."}, {"viet": "Một ít tỏi trong món rau trộn.", "eng": "A soupcon of garlic in the salad."}, {"viet": "Một cô thợ làm tóc cho phụ nữ hiểu biết về lối sống của dân Liverpool.", "eng": "A streetwise young hairdresser in Liverpool."}, {"viet": "Một cuộc tọa đàm trên truyền hình là một phương tiện tuyệt vời để tự quảng cáo bản thân.", "eng": "A television talk show is an excellent vehicle for self-promotion."}, {"viet": "Một chương trình truyền hình nhấn mạnh tới các vấn đề phức tạp của những người thất nghiệp.", "eng": "A TV programme highlighting the problems of the unemployed."}, {"viet": "Một con cá voi bị đưa lên bờ vì thủy triều cao.", "eng": "A whale stranded by the high tide."}, {"viet": "Những tràng chửi rủa từ những cửa sổ mở trút xuống đám học sinh ồn ào.", "eng": "Abuse rained down on the noisy students from the open windows."}, {"viet": "Những trách nhiệm phụ thường kèm theo công việc ấy.", "eng": "Additional responsibilities that are incidental to the job."}, {"viet": "Sau khi uống một ly whisky nữa, tôi bắt đầu thấy chóng mặt.", "eng": "After another glass of whisky I began to feel dizzy."}, {"viet": "Sau khi nàng chết, chàng chẳng biết sống để làm gì.", "eng": "After she died he had nothing to live for."}, {"viet": "Đưa người nào đó vào Đảng chính trị.", "eng": "Aggregate somebody to a political party."}, {"viet": "Tất cả áo sơ mi của tôi đang được giặt.", "eng": "All my shirts have gone to the wash."}, {"viet": "Tất cả các sản phẩm đều phải qua 53 khâu kiểm tra.", "eng": "All the products go through 53 inspections."}, {"viet": "Ví dụ các tinh thể phèn chua có thể làm ra bằng cách sau đây: Đầu tiên hòa tan phèn chua dạng bột trong nước sôi.", "eng": "Alum crystals, for instance, can be made in this way: First dissolve powdered alum in boiling water."}, {"viet": "Một giải pháp sâu rộng chống nạn đói nghèo, thất nghiệp, hút sách.", "eng": "An all-out attack on poverty, unemployment, smoking."}, {"viet": "Một hình bóng khổng lồ mờ mờ lù lù hiện ra qua làn sương mù.", "eng": "An enormous shape looming through the mist."}, {"viet": "Một tên chỉ điểm đã tố giác anh ta với cảnh sát.", "eng": "An informer denounced him to the police."}, {"viet": "Một con bò thông thường mỗi ngày chỉ cho một vài lít Anh.", "eng": "An ordinary dairy cow gives only a few quarts of milk a day."}, {"viet": "Và cách đây rất lâu, họ khám phá ra rằng họ có thể tạo hình đất sét ướt thành những cái bát và những cái lọ có hình thù và kích thước khác nhau.", "eng": "And very long ago they found that it was possible to from wet clay into useful bowls and jars of various shapes and sizes."}, {"viet": "Bất cứ thằng khờ nào cũng có thể nói cho anh biết chuyện đó.", "eng": "Any fool could tell you that."}, {"viet": "Xu hướng thời trang ở đất nước bạn có giống xu hướng thời trang ở Nhật không?", "eng": "Are the fashion trends in your country similar to Japanese trends?"}, {"viet": "Anh có được bảo hiểm đầy đủ về hoả hoạn và trộm cắp hay không?", "eng": "Are you fully covered against fire and theft?"}, {"viet": "Họ không thấy xấu hổ khi đọc những thứ rác rưởi đó nơi công cộng sao?", "eng": "Aren't they ashamed of reading such trash in public?"}, {"viet": "Cứ theo như tôi thấy được thì vấn đề đó đã hai năm rõ mười rồi còn gì nữa.", "eng": "As far as I can see the whole matter is open-and-shut."}, {"viet": "Ngoài việc là biểu tượng thành công của chúng ta, nó còn có nghĩa là sự tin tưởng của chúng ta vào tương lai, không chỉ của công ty chúng ta mà còn là tương lai của thành phố này nói chung.", "eng": "As well as being a symbol of our success, it also signifies our confidence in the future, not only of our company but also of this city in general."}, {"viet": "Cuối cùng rồi người ta cũng đi đến một thỏa hiệp.", "eng": "At long last a compromise was agreed on."}, {"viet": "Áo có một đội giỏi, và chắc là sẽ thắng.", "eng": "Austria has a good side, and should win."}, {"viet": "Coi chừng con ngựa đó-nó hay đá lắm!", "eng": "Be careful of that horse-it often kicks!"}, {"viet": "Bị sỉ nhục và làm mất danh dự.", "eng": "Be subjected to indignity and humiliation."}, {"viet": "Đến muộn là một tội không tha thứ được ở đây.", "eng": "Being late is an unforgivable sin round here."}, {"viet": "Blenkinsop hở? Không, cái tên đó chẳng gợi cho tôi ý niệm một chút gì.", "eng": "Blenkinsop? No, the name doesn't convey anything to me."}, {"viet": "Mang cho tôi một bình cà phê nữa.", "eng": "Bring me another pot of coffee."}, {"viet": "Nhưng trước khi đi, tôi muốn cám ơn cô về mọi thứ cô đã làm cho chúng tôi.", "eng": "But before I leave, I'd like to thank you for everything you've done for us."}, {"viet": "Nhưng nghiêm túc mà nói thì nữ diễn viên thủ vai chính dường như hơi cứng nhắc.", "eng": "But seriously, the leading lady seems a little stiff."}, {"viet": "Theo thỏa thuận ngầm, phó thủ lĩnh bao giờ cũng là một phụ nữ.", "eng": "By convention the deputy leader is always a woman."}, {"viet": "Gọi ban phục vụ yêu cầu mang cà phê tới.", "eng": "Call room service and ask for some coffee."}, {"viet": "Tôi có thể mặc thử một cái khác được không?", "eng": "Can I try on another one?"}, {"viet": "Cậu có thể cho một ví dụ nữa không?", "eng": "Can you give me another example?"}, {"viet": "Cô vui lòng chỉ cho tôi điều chỉnh nút không khí được không?", "eng": "Can you tell me how to adjust the air-ventilation?"}, {"viet": "Những ca đậu mùa đang trở nên hiếm đi.", "eng": "Cases of smallpox are becoming rare."}, {"viet": "Trẻ con học nhân và chia.", "eng": "Children learning to do multiplication and division."}, {"viet": "Nắm chặt lan can bằng cả hai tay.", "eng": "Clench the railings with both hands."}, {"viet": "Đến sở làm còn say làm tiêu tan hy vọng thăng cấp của cô ấy.", "eng": "Coming to work drunk put paid to her hopes of promotion."}, {"viet": "Quốc hội chấp thuận những giải pháp mới.", "eng": "Congress has adopted the new measures."}, {"viet": "Anh có thể tóm gọn bài báo đó xuống còn 400 từ không?", "eng": "Could you boiled that article down to 400 words?"}, {"viet": "Anh vui lòng nói cho tôi biết nhà sách Tân Hoa ở đường nào?", "eng": "Could you tell me which way Xin Hua bookstore is?"}, {"viet": "Những vận động viên xe đạp đang khéo léo điều khiển xe trên đường tập.", "eng": "Cyclists were manoeuvring on the practice track."}, {"viet": "Mùi đồ ăn thơm phức thoang thoảng bay lên từ nhà bếp.", "eng": "Delicious smells wafted up from the kitchen."}, {"viet": "Quyết chí báo thù cho người em đã chết của hắn.", "eng": "Determined to revenge his dead brother."}, {"viet": "Anh đã chơi bóng chày trong các đội nhỏ thuộc liên đoàn khi còn trẻ phải không?", "eng": "Did you play little league baseball when you were young?"}, {"viet": "Cố nhìn thấy một hình dạng trong sương mù.", "eng": "Distinguish a shape in the mist."}, {"viet": "Những kế hoạch này có ăn khớp với sự sắp đặt của anh hay không?", "eng": "Do these plans fit in with your arrangements?"}, {"viet": "Bạn có theo dõi thị trường chứng khoán NASDAQ không?", "eng": "Do you follow the NASDAQ, stock market?"}, {"viet": "Ở nước bạn có ngày của công nhân viên chức không?", "eng": "Do you have White Day in your country?"}, {"viet": "Bạn có phiền nếu tôi hỏi bạn bao nhiêu tuổi không?", "eng": "Do you mind if I ask how old you are?"}, {"viet": "Bạn có nghị rằng các máy bán bia làm cho những người dưới độ tuổi qui định có thể uống bia không?", "eng": "Do you think that beer vending machines enable underage people to drink?"}, {"viet": "Những bộ phim tài liệu cho thấy cuộc sống của người dân lao động.", "eng": "Documentary films showing the lives of working people."}, {"viet": "Đừng có luôn luôn bắt chước những gì người khác làm; hãy sử dụng ý kiến riêng của mình.", "eng": "Don't always copy what others do; use your own ideas."}, {"viet": "Đừng quên mua một ít bơ.", "eng": "Don't forget to buy some butter."}, {"viet": "Đừng đề cập đến chính trị, không thì chúng ta sẽ ở đây mãi mãi.", "eng": "Don't mention politics or we'll be here till kingdom come."}, {"viet": "Đừng có vất cái hộp các tông ấy đi-nó có thể có lúc dùng được đấy.", "eng": "Don't throw that cardboard box away-it may come in handy."}, {"viet": "Những biện pháp mạnh sẽ phải được áp dụng để lập lại trật tự.", "eng": "Drastic measures will have to be taken to restore order."}, {"viet": "Từng bộ phận được kiểm tra cẩn thận trước khi lắp ráp.", "eng": "Each component is carefully checked before assembly."}, {"viet": "Các tên lửa của địch đã hạ hai máy bay chiến đấu của ta.", "eng": "Enemy missiles took out two of our fighters."}, {"viet": "Ngay cả cái rẻ nhất cũng được định giá là 5 bảng Anh.", "eng": "Even the cheapest was priced at £ 5."}, {"viet": "Mối liên hệ tốt đẹp giữa hai bộ của chúng ta.", "eng": "Excellent liaison between our two departments."}, {"viet": "Sự phơi mình dưới ánh nắng gắt có thể có hại.", "eng": "Exposure of the body to strong sunlight can be harmful."}, {"viet": "Sự khiếp sợ và lo âu giày vò tâm hồn của mình.", "eng": "Fear and anxiety gnawing at one's heart."}, {"viet": "Tìm cách thoát khỏi khó khăn của ai.", "eng": "Find a way out of one's difficulty."}, {"viet": "Dùng búa gò bằng một mảnh kim loại.", "eng": "Flatten out a piece of metal by hammering it."}, {"viet": "Đối với hầu hết chúng ta, thở là một hoạt động vô thức.", "eng": "For most of us breathing is automatic."}, {"viet": "Fred nói chẳng bao lâu nữa nó sẽ ra đi.", "eng": "Fred said he'd soon be leaving."}, {"viet": "Sa thải công nhân theo kiểu quá quen thuộc.", "eng": "Gave the employee the old heave-ho."}, {"viet": "Gừng, hạt nhục đậu khấu, quế, tiêu và đinh hương là những đồ gia vị.", "eng": "Ginger, nutmeg, cinnamon, pepper and cloves are common spices."}, {"viet": "Lượm lặt một số mẫu thông tin nghe lỏm được qua những cuộc nói chuyện khác nhau.", "eng": "Glean a few bits of information from overhearing various conversations."}, {"viet": "Rất ăn ý với thầy giáo.", "eng": "Got along great with the teacher."}, {"viet": "Đọc vở Hamlet là yêu cầu bắt buộc của khóa học đó.", "eng": "Hamlet is required reading for the course."}, {"viet": "Họ đã được người ta trả nợ chưa?", "eng": "Have they been paid the money due to them?"}, {"viet": "Bạn có bao giờ ăn thử món đậu nành lên men gọi là \"natto\" chưa?", "eng": "Have you ever tried fermented soybeans called \"natto\"?"}, {"viet": "Anh đã nói chuyện với ông nội Jack chưa?", "eng": "Have you talked with grandpa Jack?"}, {"viet": "Nó là một thằng cha khá dễ chịu, nhưng dường như không có chí tiến thủ lắm.", "eng": "He's a nice enough lad, but he doesn't seem to have much gumption."}, {"viet": "Anh ta đã dùng thuốc quá liều Cô ta đã cho bà già thuốc giảm đau quá liều.", "eng": "He's been overdosing himself She overdosed the old woman with pain-killers."}, {"viet": "Nó rất thích nghe tiếng nói của chính nó.", "eng": "He's in love with the sound of his own voice."}, {"viet": "Nó sốt ruột quá khiến cho việc phải xếp hàng chờ đợi là cả một sự khổ sở đối với nó!", "eng": "He's so impatient that waiting in a queue is sheer purgatory for him!"}, {"viet": "Nó hành động mà không nghĩ tới bản thân.", "eng": "He acted without thought for himself."}, {"viet": "Anh ta chào tạm biệt người yêu của mình.", "eng": "He bade farewell to his sweet heart."}, {"viet": "Ông ấy đã tạo lập được một doanh nghiệp thành đạt nhưng phải hao tâm tốn sức.", "eng": "He built up a successful business if it was all done at the expense of his death."}, {"viet": "Anh ta đã bỏ việc tuần rồi.", "eng": "He chucked in his job last week."}, {"viet": "Nó vò tròn tờ giấy lại.", "eng": "He crumpled the paper into a ball."}, {"viet": "Không lâu sau đó ông ta qua đời.", "eng": "He died not long after that."}, {"viet": "Ông ra lệnh cho những người tuỳ tùng phải tuân theo ông.", "eng": "He enjoined obedience on his followers."}, {"viet": "Ông ta cảm thấy rằng cuộc đời của mình chẳng còn đáng sống nữa.", "eng": "He felt that his life was no longer worth living."}, {"viet": "Anh ta hướng dẫn rõ ràng cho tôi biết cách đến đó.", "eng": "He gave me explicit directions on how to get there."}, {"viet": "Ông ta trồng hoa và cả rau nữa.", "eng": "He grows flowers as well as vegetables."}, {"viet": "Anh ta đã không từng trải việc đời gian khổ khi lớn lên.", "eng": "He hadn't grown up in the school of hard knocks."}, {"viet": "Anh ta làm việc suốt ngày.", "eng": "He has been working all day."}, {"viet": "Ông ta có 20 người dưới trướng của mình.", "eng": "He has twenty men under his command."}, {"viet": "Anh ta là một người có khả năng làm nhiều việc nhưng chẳng tinh thông nghề nào.", "eng": "He is a Jack-of-all-trades."}, {"viet": "Ông ta là một trong những nhà thông thái hàng đầu ở trường đại học.", "eng": "He is one of the leading brains in the university."}, {"viet": "Hắn ta giật cái túi xách khỏi tay tôi và chạy mất.", "eng": "He just grabbed the bag from my hand and ran off."}, {"viet": "Hắn thích phô trương sự hiểu biết của hắn.", "eng": "He likes to air his knowledge."}, {"viet": "Hắn thích được xuất hiện ở tất cả những buổi lễ quan trọng.", "eng": "He loves to be seen in all the right places."}, {"viet": "Hắn nói lầu bầu là hắn muốn ngủ.", "eng": "He murmured that he wanted to sleep."}, {"viet": "Anh ấy thành công được là nhờ may mắn nhiều hơn khả năng.", "eng": "He owes his success more to luck than to ability."}, {"viet": "Anh ấy áp sát chiếc khăn tay lên mũi của mình.", "eng": "He pressed a handkerchief to his nose."}, {"viet": "Hắn chụp mạnh cái mũ lên đầu.", "eng": "He rammed his hat on his head."}, {"viet": "Hắn làm cho tôi nhớ đến em hắn.", "eng": "He reminds me of his brother."}, {"viet": "Hắn là một gã rất dễ thương.", "eng": "He's a helluva nice guy."}, {"viet": "Hắn chết rồi, chắc chắn như thế.", "eng": "He's dead, as sure as eggs is eggs."}, {"viet": "Hắn không phải là người quân tử, hắn là một kẻ tiểu nhân.", "eng": "He's no gentleman, he's a cad."}, {"viet": "Tuy đã luống tuổi ông ấy vẫn còn năng động lắm.", "eng": "He's very active for an elderly man."}, {"viet": "Ông ta nói rằng chẳng có cuộc khủng hoảng năng lượng nào hết, rằng đó là một sự lừa gạt, để duy trì những lợi nhuận thái quá cho các công ty xăng dầu.", "eng": "He says that there isn't any energy crisis at all, that it's a hype, to maintain outrageous profits for the oil companies."}, {"viet": "Lẽ ra nó phải chủ động trả-nó cũng có rất nhiều tiền.", "eng": "He should have offered to pay-he has plenty of money, after all."}, {"viet": "Anh ta nói tiếng Ả-rập và tiếng Anh thông thạo như nhau.", "eng": "He speaks Arabic and English with equal ease."}, {"viet": "Anh ta sợ chết cứng trước cảnh kinh khủng đó.", "eng": "He stiffened at the horrific sight."}, {"viet": "Anh ta bơi vào bờ và leo lên.", "eng": "He swam to the bank and pulled himself up on to it."}, {"viet": "Ông ta nói riêng với tôi rằng ông ta đang suy nghĩ tới việc từ chức vào năm tới.", "eng": "He told me confidentially that he's thinking of resigning next year."}, {"viet": "Hắn luôn luôn lừa người khác.", "eng": "He tricks people all the time."}, {"viet": "Anh ta vốn nhút nhát một cách khổ sở, nhưng bây giờ anh ta đã bắt đầu hoạt bát hơn.", "eng": "He used to be painfully shy, but now he's started to blossom."}, {"viet": "Ông ta là một vị khách thường xuyên của cô ta.", "eng": "He was a regular visitor of hers."}, {"viet": "Anh ta sinh ra ở Pháp nhưng cha mẹ là người Anh.", "eng": "He was born in France but his parents are British."}, {"viet": "Anh ấy ăn mặc như phụ nữ.", "eng": "He was dressed as a woman."}, {"viet": "Anh ấy đã bị đuổi việc bởi những kẻ thù ghen ghét.", "eng": "He was hounded out of his job by jealous rivals."}, {"viet": "Ông ta đã có thời là niềm hy vọng lớn lao của Công đảng.", "eng": "He was once the great white hope of the Labour Party."}, {"viet": "Nó nín lặng một lát rồi mới trả lời.", "eng": "He was silent for a moment, then began his answer."}, {"viet": "Anh ta bị những lời nhạo báng của cô ấy làm bẽ mặt.", "eng": "He was totally flattened by her sarcasm."}, {"viet": "Nó tiếp tục nói dài dòng chán ngắt về thú riêng ưa thích của nó.", "eng": "He went on at tedious length about his favourite hobby."}, {"viet": "Nó sẽ không cần chúng nữa.", "eng": "He won't need them any more."}, {"viet": "Những chứng cứ theo lời đồn thường không được xem xét ở toà.", "eng": "Hearsay evidence is not ordinarily admissible in court."}, {"viet": "Việc bà ta đến đây không giúp được gì nhiều để giải quyết tình hình.", "eng": "Her arrival did little to resolve the situation."}, {"viet": "Các đồng nghiệp của cô ta đã cố ý không thông báo cho cô ta.", "eng": "Her colleagues had deliberately kept her uninformed."}, {"viet": "Đôi mắt cô đỏ hoe vì khóc.", "eng": "Her eyes were red with weeping."}, {"viet": "Đôi giày cứng của cô ta bước trên các bậc thang kêu lộp cộp.", "eng": "Her hard shoes thunk on the stairs."}, {"viet": "Bộ phim mới nhất của cô ta được giới phê bình khen ngợi nhiều.", "eng": "Her latest film has brought eulogies from the critics."}, {"viet": "Cuốn hồi ký mới in của bà ấy bị các nhà phê bình báo chỉ trích gay gắt.", "eng": "Her newly published memory had been assailed by the newspaper critics."}, {"viet": "Việc cô ta vươn lên đến đỉnh cao là một trong những chuyện thành công đặc sắc nhất của ngành điện ảnh.", "eng": "Her rapid rise to the top has been one of the film industry's most remarkable success stories."}, {"viet": "Phạm vi sở thích của cô ta rất hạn chế.", "eng": "Her sphere of interests is very limited."}, {"viet": "Công việc của cô ta đã góp phần lớn lao vào việc giúp chúng ta hiểu rõ vấn đề khó khăn này.", "eng": "Her work has contributed enormously to our understanding of this difficult problem."}, {"viet": "Huyết áp cao không được dùng thuốc này.", "eng": "High blood pressure is a contraindication for this drug."}, {"viet": "Nó đi học buổi đực buổi cái.", "eng": "His attendance at school is bad."}, {"viet": "Tham vọng chính của anh ta là trở thành nhà thơ.", "eng": "His chief ambition is to become a poet."}, {"viet": "Bác sĩ của anh ta khuyên anh ta không uống rượu.", "eng": "His doctor advised him to steer clear of alcohol."}, {"viet": "Bố nó làm cho nó chiếc mô hình máy bay.", "eng": "His father built him a model aeroplane."}, {"viet": "Với phương pháp điều trị mới, sức khoẻ của ông ấy tiến triển đáng kể.", "eng": "His health has improved appreciably with the new treatment."}, {"viet": "Những lý thuyết mới nhất của ông ta đã bị các chuyên gia làm cho tan ra mây khói.", "eng": "His latest theories have been shot down in flames by the experts."}, {"viet": "Sự cẩu thả của hắn đã được bỏ qua không bị khiển trách.", "eng": "His negligence passed without reprimand."}, {"viet": "Tính điều chính trị của ông ta được thâu tóm trong báo cáo này.", "eng": "His political creed was epitomized in this report."}, {"viet": "Kế hoạch của anh ấy không hợp lý về mặt kinh tế.", "eng": "His scheme is not economically sound."}, {"viet": "Nỗi đau khổ của anh ấy thì đừng nghĩ đến còn hơn.", "eng": "His sufferings don't bear thinking about."}, {"viet": "Vợ anh ta cứ nói mãi cho đến khi anh ta phải mua cho chị ấy một chiếc ô tô mới.", "eng": "His wife kept on at him until he bought her a new car."}, {"viet": "Những vị khách quan trọng của Hollywood tụ tập tại một bữa tiệc riêng.", "eng": "Hollywood's a list gathered at a private party."}, {"viet": "Một tách cà phê nữa nhé?", "eng": "How about another cup of coffee?"}, {"viet": "Sao cậu có thể ngốc đến mức đi tin vào hắn?", "eng": "How could you be so stupid as to believe him?"}, {"viet": "Làm thế nào anh biết đó không phải là một vụ cháy?", "eng": "How do you know it's not a real fire?"}, {"viet": "Việc giao hàng mất bao lâu?", "eng": "How long does the delivery take?"}, {"viet": "Bạn có thể bơi bao nhiêu kilomet?", "eng": "How many kilometers can you swim?"}, {"viet": "Một bộ tiền kim loại giá bao nhiêu?", "eng": "How much does a set of coins cost?"}, {"viet": "Cách họ sinh hoạt trên tàu.", "eng": "How they live on the ship."}, {"viet": "Hydrô và ôxy hóa hợp tạo thành nước.", "eng": "Hydrogen and oxygen combine to form water."}, {"viet": "Tôi muốn nói chuyện với bà Jean Strong ở phòng 736.", "eng": "I'd like to speak to Mrs. Jean Strong of Room No. 736, please."}, {"viet": "Tôi sẽ hoàn thành công việc này dù phải mất bao lâu.", "eng": "I'll finish the job no matter how long it takes."}, {"viet": "Tôi sẽ trả anh gấp đôi nếu anh hoàn thành công việc nhanh.", "eng": "I'll pay you double if you finish the work quickly."}, {"viet": "Chắc tao không thể đãi mày một chầu rượu được vì tao chỉ còn có 50 xu cuối cùng.", "eng": "I'm afraid I can't buy you a drink: I'm down to my last 50p."}, {"viet": "Tôi vô cùng khâm phục lòng dũng cảm của bạn.", "eng": "I'm filled with admiration for your bravery."}, {"viet": "Tôi sẽ phóng đi Pari nghỉ cuối tuần.", "eng": "I'm hopping over to Paris for the weekend."}, {"viet": "Tôi không biết chắc là chúng tôi có còn bánh nướng nhân táo hay không.", "eng": "I'm not sure whether we have apple pie."}, {"viet": "Tôi tiếc là đã không đến dự bữa tiệc của anh tối hôm qua được.", "eng": "I'm sorry I couldn't make your party last night."}, {"viet": "Tôi mệt rồi, vì thế tôi sẽ đi ngủ đây.", "eng": "I'm tired, so I'm going to hit the sack."}, {"viet": "Tôi được mời dự một lễ cưới của người châu Á'Những dịp như thế thì người ta làm những gì?", "eng": "I've been invited to an Asian wedding What happens on such occasions?"}, {"viet": "Tôi chúa ghét những đàn ông có râu.", "eng": "I've got a thing about men with beards."}, {"viet": "Tôi chưa từng đến đó bao giờ, nhưng theo ý kiến chung, đó là một nơi thú vị.", "eng": "I've never been there but it is, by all accounts, a lovely place."}, {"viet": "I, we, she và they đều là đại từ chủ ngữ.", "eng": "I, we, she and they are all nominative pronouns."}, {"viet": "Tôi luôn luôn dẫn chó đi tản bộ vào buổi tối trước khi đi ngủ.", "eng": "I always take the dog for walking last thing before going to bed."}, {"viet": "Tôi cảm thấy muốn nghỉ làm ngày hôm nay.", "eng": "I am tempted to take the day off."}, {"viet": "Tôi xin anh kiên tâm chú ý mấy phút thôi.", "eng": "I beg your indulgence for just a few minutes."}, {"viet": "Tôi tới đây với ý định sẽ ở lại, nhưng nay tôi quyết định sẽ ra đi.", "eng": "I came with every intention of staying, but now I've decided to leave."}, {"viet": "Nếu không đổi tờ 5 pao ra thì tôi không trả được 50 penni còn nợ anh.", "eng": "I can't pay the 50p I owe you without breaking into a 5 pound note."}, {"viet": "Tôi có thể bảo đảm điều đó là đúng-chính tôi đã thấy điều đó.", "eng": "I can guarantee it's true-I saw it myself."}, {"viet": "Tôi không thể hoàn tất việc này trước thứ Sáu.", "eng": "I can't finish this job by Friday."}, {"viet": "Tôi đến một bác sĩ khám về những cơn đau của tôi.", "eng": "I consulted a doctor about my pains."}, {"viet": "Tốt nhất là tôi nên đi về.", "eng": "I'd best be moseying along."}, {"viet": "Tôi đã làm hết sức mình để hoàn thành kịp thời.", "eng": "I did my damnedest to finish on time."}, {"viet": "Tôi không biết chính xác vì sao cô ấy mất việc.", "eng": "I do not know precisely why she lost her job."}, {"viet": "Tôi không biết cô ấy không biết cách diễn hay chỉ vì cô ấy là ngôi sao điện ảnh, dường như cô ấy chưa cố gắng hết sức mình.", "eng": "I don't know whether she doesn't know how to play or whether it's just because she's a movie star, it seems she doesn't exert herself enough."}, {"viet": "Tôi cho rằng giá không chứa thêm được sách nữa.", "eng": "I don't think the shelf will take any more books."}, {"viet": "Tôi không tin một lời nào trong câu chuyện của hắn.", "eng": "I don't believe a word of his story."}, {"viet": "Tôi đã mơ thấy mình biết bay.", "eng": "I dreamt that I could fly."}, {"viet": "Tôi cảm thấy như một con người mới.", "eng": "I feel like a new man."}, {"viet": "Tôi thấy không có mâu thuẫn gì giữa các quan niệm phát biểu công khai với hành động cá nhân của anh ta.", "eng": "I find no contradiction between his publicly expressed opinions and his private actions."}, {"viet": "Tôi vui mừng chấp nhận lời mời của họ tới khai mạc lễ hội.", "eng": "I gladly accepted their invitation to open the fête."}, {"viet": "Tôi có một lương tâm tội lỗi là đã không nói sự thật với cô ấy.", "eng": "I had a guilty conscience about not telling her the truth."}, {"viet": "Tôi phải về hưu vì lý do sức khoẻ.", "eng": "I had to retire on medical grounds of ill health."}, {"viet": "Tôi thu xếp câu chuyện làm cả hai bên hài lòng.", "eng": "I have arranged the matter to the satisfaction of both parties."}, {"viet": "Tôi không có gì nói thêm vào lời nhận định trước của tôi.", "eng": "I have nothing to add to my earlier statement."}, {"viet": "Tôi không phải gánh nhiều trách nhiệm như trước nữa.", "eng": "I haven't as much responsibility as before."}, {"viet": "Tôi nghe nói cậu đi chơi với con gái của Jack-cậu lại quan hệ tình dục với một cô gái tơ rồi!", "eng": "I hear you're going out with Jack's daughter-there you go, cradle-snatch gain!"}, {"viet": "Tôi hi vọng thời tiết khá lên trước Chủ Nhật.", "eng": "I hope the weather clears up before Sunday."}, {"viet": "Tôi chỉ mê món bánh nướng phết bơ!", "eng": "I just dote on hot buttered scones!"}, {"viet": "Tôi biết tôi sẽ làm gì trong ba tuần lễ tới nhưng chưa nghĩ sau đó sẽ làm gì nữa.", "eng": "I know what I shall be doing for the next three weeks but I haven't thought beyond that."}, {"viet": "Tôi thích xả hơi thoải mái khi tôi đang nghỉ phép.", "eng": "I like to take things easy when I'm on holiday."}, {"viet": "Tôi sẽ tìm cho ông một bạn nhảy.", "eng": "I'll find you a partner."}, {"viet": "Bác sẽ đưa cháu đến bệnh viện.", "eng": "I'll take you to the hospital."}, {"viet": "Tôi phát chán rồi: chúng ta hãy đi xem phim đi.", "eng": "I'm bored: let's go to the cinema."}, {"viet": "Tôi đang tìm ông Martin Kemp.", "eng": "I'm looking for Mr. Martin Kemp."}, {"viet": "Tôi xin lỗi ở đây chúng tôi không có.", "eng": "I'm sorry we don't have one here."}, {"viet": "Một ngày nọ con đã gặp một cậu bé Pháp và đã không thốt được tiếng “ bon jour ” khỏi miệng.", "eng": "I met a French kid the other day, and I couldn't even get bon jour out of my mouth."}, {"viet": "Tôi phải bắt đầu công việc chuẩn bị khăn gói của mình.", "eng": "I must set about my packing."}, {"viet": "Trong đời tôi, tôi chưa bao giờ thấy nhiều người hút thuốc lá như vậy.", "eng": "I never saw so many cigarette smokers in my life."}, {"viet": "Tôi đã nhận thấy thái độ của ông ta đã thay đổi.", "eng": "I perceived that his behaviour had changed."}, {"viet": "Tôi đọc sách, xem tivi và đi xem phim.", "eng": "I read, watch TV and go to the movies."}, {"viet": "Tôi lấy làm tiếc phải nói rằng anh đã được thông báo sai về việc đó.", "eng": "I regret to say you have been misinformed about that."}, {"viet": "Tôi thấy những người nhảy múa cầm chúng.", "eng": "I saw the dancers holding them."}, {"viet": "Tôi sẽ đi dạo một vòng quanh boong tàu trước khi đi ngủ.", "eng": "I shall take a turn round the deck before I go to sleep."}, {"viet": "Cháu đã làm đổ nước nóng lên chân và bị phỏng.", "eng": "I spilled hot water on my leg and burned it."}, {"viet": "Tôi thỉnh thoảng cũng tập tành tí chút, nhưng không đều.", "eng": "I take the odd bit of exercise, but nothing regular."}, {"viet": "Tôi nghĩ hôm nay trời ấm hơn một chút.", "eng": "I think it's a shade warmer today."}, {"viet": "Tôi nghĩ cậu Peter rất mê cô gái hàng xóm.", "eng": "I think young Peter has taken quite a fancy to that girl next door."}, {"viet": "Tôi hiểu sự im lặng của cô ta như là sự đồng ý.", "eng": "I translated her silence as assent."}, {"viet": "Buổi sáng tôi thường đi xe buýt đi làm.", "eng": "I usually bus to work in the morning."}, {"viet": "Con muốn làm thợ mộc như chú Ned ấy.", "eng": "I want to be a carpenter, like Uncle Ned."}, {"viet": "Tôi muốn nói với cô ta nhưng những lời lẽ ấy không thể thốt ra được.", "eng": "I wanted to tell her, but the words stuck in my throat."}, {"viet": "Tôi may mắn có được một người thầy giỏi.", "eng": "I was fortunate to have having a good teacher."}, {"viet": "Tôi được chỉ dẫn đến phòng hướng dẫn.", "eng": "I was referred to the enquiry office."}, {"viet": "Tôi đã ngỗ nghịch với cha tôi nhiều lắm.", "eng": "I was very disobedient toward my father."}, {"viet": "Tôi sẽ không tha thứ bất cứ ai can thiệp vào công việc của tôi.", "eng": "I will not brook anyone interfering with my affairs."}, {"viet": "Tôi thắng cược 10 bảng Anh trong cuộc đua chó săn.", "eng": "I won £ 10 on the dogs."}, {"viet": "Giá có cái giường thì tốt, nhưng không thể có cái gì hơn, nên tôi đành ngủ trên ghế sofa.", "eng": "I would have preferred a bed, but beggars can't be choosers so I slept on the sofa."}, {"viet": "Tôi chẳng khi nào hạ mình để đi lường gạt.", "eng": "I would never stoop to cheating."}, {"viet": "Nếu một trường đại học lớn không thể đảm nhận một chương trình như vậy thì chắc hẳn là một học viện nhỏ hơn không thể làm nổi.", "eng": "If a major university cannot afford such a programme, then, afortiori, neither can a lesser institution."}, {"viet": "Nếu tôi được phép thiếu khiêm tốn trong giây lát thì xin nói để anh biết về cuốn sách mới nhất tôi vừa viết xong.", "eng": "If I may be immodest for a moment, let me tell you about the latest book that I've written."}, {"viet": "Nếu cửa không mở hãy cho nó một cái đá.", "eng": "If the door won't open, give it a kick."}, {"viet": "Nếu chúng ta gắn bó với nhau, chúng ta sẽ có được một cơ hội tốt hơn.", "eng": "If we stick together we've got a better chance."}, {"viet": "Nếu cậu cắt bánh mì chúng ta sẽ làm món bánh mì nướng.", "eng": "If you cut the bread we'll make some toast."}, {"viet": "Nếu anh để những dụng cụ bằng kim loại của anh ở ngoài mưa chúng sẽ bị gỉ.", "eng": "If you leave your metal tools outside in the rain, they will rust."}, {"viet": "Nếu anh muốn đi xe buýt thì đối với tôi cũng tiện thôi.", "eng": "If you want to go by bus, that suits me fine."}, {"viet": "Trong một bài phát biểu đầy khích động, Tổng thống đã chỉ trích tới tấp công đoàn.", "eng": "In a rousing speech the President hit out against the trade union."}, {"viet": "Quả thực, các nhà khoa học tin tưởng rằng tổ tiên hoang dại của chó là chó sói.", "eng": "In fact, scientists believed that the wild ancestors of dogs were wolves."}, {"viet": "Trong thiên nhiên, tất cả các động vật đều sống hoang dã và tự do.", "eng": "In nature, all animals are wild and free."}, {"viet": "Ngày xưa, tất cả đồ gốm đều được nặn bằng tay.", "eng": "In the earliest days of pottery all of it was shaped by hand."}, {"viet": "Ở trại lính này, lính không ăn chung với sĩ quan.", "eng": "In this camp soldiers do not mess with officer."}, {"viet": "Công nghệ thông tin thường được viết tắt là IT.", "eng": "Information technology is usually abbreviated to IT."}, {"viet": "Anh có thể sửa chỗ rỉ nước đó không?", "eng": "Is it possible for you to fix the leak?"}, {"viet": "Có bãi đỗ xe nào ở gần nhà hát không?", "eng": "Is there any parking near the theatre?"}, {"viet": "Căn phòng này chẳng dễ thương à?", "eng": "Isn't this a lovely room?"}, {"viet": "Nó ở phía đối diện với bưu điện.", "eng": "It's across the street from the post office."}, {"viet": "Có gió thổi đằng sau thì đi xe đạp nhẹ nhàng hơn.", "eng": "It's easier to cycle with the wind behind you."}, {"viet": "Hai ứng viên bằng nhau chằn chặn, một trong hai có thể thắng.", "eng": "It's level pegging between two candidates either of them could win."}, {"viet": "Đó không phải là điều mà tôi đã dự định Tôi nghe nói họ định cưới nhau.", "eng": "It's not what I intended I hear they intend to marry."}, {"viet": "Đó là thức ăn nhảy múa, nói chuyện.", "eng": "It's the food, the dancing, the talking."}, {"viet": "Tất cả phụ thuộc vào việc cô ấy có thích ông chủ hay không.", "eng": "It all depends on whether she likes the boss or not."}, {"viet": "Từ lâu tôi chưa viết thư cho cô ấy.", "eng": "It has been a long time since I wrote to her."}, {"viet": "Tiếp tục học khoa học là vô ích, tôi sẽ không bao giờ hiểu được nó.", "eng": "It is hopeless to go on learning science I shall never understand it."}, {"viet": "Công việc của cảnh sát là bảo vệ cộng đồng.", "eng": "It is the business of the police to protect the community."}, {"viet": "Ngoài kia chắc trời lạnh lắm.", "eng": "It must be cold out there."}, {"viet": "Nó ở đại lộ 15, đường Park.", "eng": "It's on the 15th Avenue, Park Street."}, {"viet": "Dường như điều đó làm anh vui.", "eng": "It seems to make you happy."}, {"viet": "Thật là nhẹ người khi biết được rằng cuối cùng mọi việc đã được công khai.", "eng": "It was a great relief to know that it was all in the open at last."}, {"viet": "Khó mà tả được cơn ác mộng cô ấy đã trải qua.", "eng": "It was hard to describe the nightmare she has lived through."}, {"viet": "Đó là lần đầu tiên họ gặp nhau.", "eng": "It was the first time they had ever met."}, {"viet": "Nếu cho rằng ông ta luôn luôn sai thì sẽ là xấc xược.", "eng": "It would be impertinent to suggest that he was always wrong."}, {"viet": "Jed, người tự cho mình và một loại ngôi sao nhạc rock, chơi ghi ta tưởng tượng mỗi khi anh ta vui hoặc buồn.", "eng": "Jed, who sees himself as some son of rock star, plays air guitar when he's happy or sad."}, {"viet": "Cứ xét theo kinh nghiệm trước đây thì nó sẽ đến muộn.", "eng": "Judging from previous experience, he will be late."}, {"viet": "Thưa quý bà quý ông! Ngay trước mắt quý vị tôi sẽ cắt người đàn ông này làm đôi, nhà ảo thuật nói.", "eng": "Ladies and gentlemen! Before your very eyes I will cut this man in half said the magician."}, {"viet": "Chúng ta hãy đi dạo quanh công trường và xem tất cả các hoạt động.", "eng": "Let's walk around the site and look at all the activities."}, {"viet": "Giống như viên đá màu xanh da trời anh ấy đeo phải không?", "eng": "Like the blue stone he is wearing?"}, {"viet": "Nhiều người dân phải di dời vì nước lụt dâng cao.", "eng": "Many of the inhabitants were displaced by the rising flood waters."}, {"viet": "Martin, anh có muốn uống gì không?", "eng": "Martin, would you like something to drink?"}, {"viet": "Tôi có thể phép chuyển sang chỗ đó không?", "eng": "May I move to that seat?"}, {"viet": "Cô Collin, thứ bảy tới cô có rảnh không?", "eng": "Miss Collin, will you be free next Saturday?"}, {"viet": "Mẹ ơi, mẹ biết Hội Quốc Tế theo dõi Thể trọng được thành lập khi nào không?", "eng": "Mother, when was Weight Watchers International founded, do you know?"}, {"viet": "Bà bác tôi lúc về già thường hay quên.", "eng": "My aunt has become rather forgetful in her old age."}, {"viet": "Cha tôi là cả một kho chứa các sự kiện thú vị.", "eng": "My father is a repository of interesting facts."}, {"viet": "Trí nhớ của tôi dạo này không được chắc chắn lắm.", "eng": "My memory's not very reliable these days."}, {"viet": "Con trai tôi đi học lúc 5 giờ.", "eng": "My son comes home from school at five."}, {"viet": "Suốt đời tôi chưa bao giờ nghe một chuyện phi lý như vậy!", "eng": "Never in all my life have I heard such nonsense!"}, {"viet": "Chưa, tôi nghĩ tôi chưa có được hân hạnh đó.", "eng": "No, I don't believe i've had the pleasure."}, {"viet": "Không ai sánh ngang ông ta về hiểu biết cây cối.", "eng": "No one could match him in knowledge of plants."}, {"viet": "Nào, để xem mẫu tự nào đứng sau U?", "eng": "Now let's see, what letter comes after U?"}, {"viet": "Tất nhiên là chúng tôi vui chơi, nhưng mọi người đều rất yêu nước.", "eng": "Of course we have fun, but people are quite patriotic."}, {"viet": "Được rồi, nếu ông cần bất cứ sự giúp đỡ nào, vui lòng quay số 9.", "eng": "OK, if you need any help, dial 9, please."}, {"viet": "Lại một lần nữa đi đến tan vỡ, thưa các bạn, lại một lần nữa.", "eng": "Once more unto the breach, dear friends, once more."}, {"viet": "Một trong một vài nước mà người ta lái xe về bên trái.", "eng": "One of the few countries where people drive on the left."}, {"viet": "Con cái chúng tôi đã trưởng thành và chúng đã có con cái riêng cả rồi.", "eng": "Our children have grown up and have children of their own."}, {"viet": "Tài khoản đầu tư của chúng ta đem lại một lãi suất cao.", "eng": "Our investment accounts return a high rate of interest."}, {"viet": "Xe tăng của ta chọc thủng phòng tuyến địch.", "eng": "Our tanks have breached the enemy defences."}, {"viet": "Bố mẹ phải cương quyết đối với con cái của mình.", "eng": "Parents must be firm with their children."}, {"viet": "Người ta liên tưởng thành phố Viên với những tiệm cà phê và các điệu vanxơ.", "eng": "People connect Vienna with waltzes and coffee-houses."}, {"viet": "Chơi thể thao được xem là một phần rất quan trọng trong cuộc sống của con người.", "eng": "Playing the sport is considered an essential part of a person's life."}, {"viet": "Quyền lực thuộc về nhân dân là khẩu hiệu của họ.", "eng": "Power to the people is their slogan."}, {"viet": "Này, tôi sẽ nói ông biết cái gì cần thiết.", "eng": "Say, I'll tell you what."}, {"viet": "Tôi sẽ chuyển cho họ những lời thăm hỏi của bạn nhé?", "eng": "Shall I give them your regards?"}, {"viet": "Cô ấy ít nói và không chia sẻ suy nghĩ của mình.", "eng": "She's a quiet girl and doesn't share her thoughts."}, {"viet": "Cô ta hoàn toàn không nơi nương tựa-còn tôi ít nhất cũng có thể nhờ cậy cha mẹ.", "eng": "She's completely homeless-at least I have my parents to fall back on."}, {"viet": "Cô ta mệt lả đi vì tất cả công việc đó.", "eng": "She's knocking herself out with all that work."}, {"viet": "Cô ta vẫn còn hơi đau sau tai nạn đó.", "eng": "She's still a bit sore after the accident."}, {"viet": "Bà ấy đã khuyên con trai mình đừng chọn sân khấu làm nghề nghiệp.", "eng": "She advised her son not to choose the stage as a career."}, {"viet": "Cô ta bị thâm tím trán khi ngã.", "eng": "She bruised her forehead when she fell."}, {"viet": "Bà ta than phiền với tôi về sự thô lỗ của anh ta.", "eng": "She complained to me about his rudeness."}, {"viet": "Cô ấy miêu tả vụ tai nạn bằng một giọng run lên vì cảm xúc.", "eng": "She described the accident in a voice shaking with emotion."}, {"viet": "Cô ấy đã lựa bàn chân bị thương của mình vào chiếc giày.", "eng": "She eased her injured foot into her shoe."}, {"viet": "Sau khi cưới cô ấy thấy hoàn toàn hạnh phúc.", "eng": "She found complete bliss after marriage."}, {"viet": "Cô ấy tin rằng tôi là người đáng trách.", "eng": "She got into the head that I was to blame."}, {"viet": "Cô ta đã giải thích thái độ của mình với những người ủng hộ đang hoang mang.", "eng": "She had to explain her behaviour to her perplexed supporters."}, {"viet": "Cô ta không được đào tạo âm nhạc chính quy.", "eng": "She has no formal musical qualifications."}, {"viet": "Cô ta cứ nhất định mở đài oang oang.", "eng": "She insists on having the radio on at full blast."}, {"viet": "Cô ta có dấu hiệu tự thu mình lại và chán nản.", "eng": "She is showing signs of withdrawal and depression."}, {"viet": "Cô ta rời đi sớm mượn cớ đau đầu.", "eng": "She left early with the plea of headache."}, {"viet": "Bà ấy thích luôn luôn có người hầu đi bên cạnh.", "eng": "She loves to have servants dance attendance on her."}, {"viet": "Cô ta không bao giờ biểu lộ sự thương cảm nào khi tôi bị thương.", "eng": "She never expressed any sympathy when I was injured."}, {"viet": "Cô ấy cân nhắc mấy phút trước khi trả lời.", "eng": "She pondered for Some minutes before giving an answer."}, {"viet": "Cô ta từ chối hầu hạ cho cả gia đình.", "eng": "She refused to skivvy for the whole family."}, {"viet": "Cô ta khởi sự viết một cuốn tiểu thuyết mới.", "eng": "She's begun on a new novel."}, {"viet": "Cô ta là con người có đủ khả năng nhất để đối phó.", "eng": "She's the person best able to cope."}, {"viet": "Cô ấy hình như hoàn toàn thờ ơ ( đối với công việc của mình ).", "eng": "She seems completely disinterested ( in her work )."}, {"viet": "Bà ta nện búa lên cái hộp.", "eng": "She smashed the hammer down onto the box."}, {"viet": "Cô ấy lấy keo dán cái quai vào cái tách.", "eng": "She stuck the handle onto the cup with glue."}, {"viet": "Bà ấy nói với người bán hàng bà ấy thích đồ gốm có tráng men hơn.", "eng": "She told the salesman the she preferred pottery with a glaze."}, {"viet": "Cô ấy dùng ô tô của cô ấy chủ yếu là để đi làm.", "eng": "She uses her car mostly of driving to work."}, {"viet": "Cô ta được phép nghỉ việc để đưa tang cha.", "eng": "She was allowed compassionate leave from work to attend her father's funeral."}, {"viet": "Nàng bị cuốn hút vào cơn lốc của các biến cố cách mạng.", "eng": "She was drawn into a maelstrom of revolutionary events."}, {"viet": "Cô ta trễ và cũng vì thế tôi bị hoãn lại.", "eng": "She was late and I similarly was delayed."}, {"viet": "Bà ấy muốn được bầu lại nhiệm kì thứ ba.", "eng": "She was seeking reelection for the third term of office."}, {"viet": "Cô ta vẫn thản nhiên với cuộc sống quanh mình.", "eng": "She was untouched by the life around her."}, {"viet": "Vừa nhắm mắt là cô ấy ngủ liền.", "eng": "She went to sleep as soon as she closed her eyes."}, {"viet": "Cô ta làm việc với tư cách trợ lý riêng cho tổng giám đốc.", "eng": "She works as PA to the managing director."}, {"viet": "Phải chăng người lính nên coi danh dự cao hơn mạng sống?", "eng": "Should a soldier value honour above life?"}, {"viet": "Các hình thức đơn sơ của sự sống, như các sinh vật đơn bào.", "eng": "Simple forms of life, like one-cell organisms."}, {"viet": "Trượt băng không phải là môn tôi thích.", "eng": "Skiing isn't really my cup of tea."}, {"viet": "Hút thuốc là một trong những nguyên nhân chủ yếu của ung thư phổi.", "eng": "Smoking is one of the chief causes of lung cancer."}, {"viet": "Vậy hôm qua chắc là bạn đã có một ngày bận rộn và thú vị.", "eng": "So you must have had a busy and enjoyable day yesterday."}, {"viet": "Nhiều dòng họ đã làm nghề nông trong vùng này cả trăm năm.", "eng": "Some families have farmed in this area for hundreds of years."}, {"viet": "Một số người có nhiều khả năng hưởng hạnh phúc hơn những người khác.", "eng": "Some people have a greater capacity for happiness than others."}, {"viet": "Có kẻ đã ngó ngoáy vào cái ổ khoá.", "eng": "Someone has been tampering with the lock."}, {"viet": "Nghe giống như điều mà tôi muốn làm vậy.", "eng": "Sounds like what I want to do."}, {"viet": "Tổ chức một cuộc phản đối cung cách xử lý vụ tranh chấp của ban giám đốc.", "eng": "Stage a protest against management's handling of the dispute."}, {"viet": "Giá cả chứng khoán sụt xuống vào buổi sáng nhưng lại đột ngột tăng vọt vào buổi chiều.", "eng": "Stock prices fell in the morning but rallied in a dramatic afternoon turn-around."}, {"viet": "Những con chó hoang thường bị giết nếu không có ai nhận chúng.", "eng": "Stray dogs are usually put to sleep if no one claims them."}, {"viet": "Một hành vi như vậy là thách thức quy ước xã hội.", "eng": "Such behaviour flies in the face of convention."}, {"viet": "Đã thêm sự giải thích riêng của mình khi kể lại câu chuyện đó.", "eng": "Superimposed her own interpretation when she retold the story."}, {"viet": "Mang một cái tủ lạnh cũ hỏng ra bãi rác.", "eng": "Take a broken old refrigerator to the tip."}, {"viet": "Những cuộc đàm phán với viên chức tương nhiệm với bà ấy trong Nhà Trắng.", "eng": "Talks with her opposite number in the White House."}, {"viet": "Nói với những người quan tâm bảo vệ môi trường là chúng ta cần phải bảo tồn di sản của tự nhiên thì chẳng khác gì là bày cho thầy tu đọc kinh!", "eng": "Telling conservationists that we need to preserve the natural heritage really is preaching to the converted!"}, {"viet": "Nhờ bản hợp đồng này mà công ty đã tìm được một chỗ đứng ở thị trường Châu Âu.", "eng": "Thanks to this contract the firm gained a toe-hold in the European market."}, {"viet": "Không thể là Mary được-Cô ta đang nằm viện mà.", "eng": "That can't be Mary-she's in hospital."}, {"viet": "Đó chẳng khác gì bảo tôi là kẻ dối trá.", "eng": "That is as much as saying I am liar."}, {"viet": "Cơn giận dữ đó là một thí dụ cho tính nóng nảy của bà ta.", "eng": "That outburst was illustrative of her bad temper."}, {"viet": "Cái mũ đó là hợp thức tại một lễ cưới chính thức.", "eng": "That sort of hat is derigueur at a formal wedding."}, {"viet": "Những nhà hàng hải Tây Ban Nha và Bồ Đào Nha ở thế kỷ thứ 16.", "eng": "The 16th-century Spanish and Portuguese navigators."}, {"viet": "Độ vang của phòng này tuyệt vời.", "eng": "The acoustics of this hall are excellent."}, {"viet": "Hãng hàng không đặt mua 25 chiếc máy bay mới.", "eng": "The airline has ordered 25 new aircraft."}, {"viet": "Sự thù địch của anh ta đối với kẻ thù cũ của mình vẫn còn rất mạnh.", "eng": "The antagonism he felt towards his old enemy was still very strong."}, {"viet": "Quân đội được gọi tới để lập lại luật pháp và trật tự.", "eng": "The army was called in to restore law and order."}, {"viet": "Khán giả nhấp nha nhấp nhổm trên ghế của mình.", "eng": "The audience shifted uneasily in their seats."}, {"viet": "Đứa trẻ sinh ra nặng bảy pound.", "eng": "The baby weighed seven pounds at birth."}, {"viet": "Sự phá sản của nhiều hãng nhỏ là dấu hiệu mở đầu cho sự suy thoái của nền kinh tế chung.", "eng": "The bankruptcy of several small firms was the prelude to general economic collapse."}, {"viet": "Những khăn trải giường bị rũ tung lên như thể đã có ai ngủ ở trên giường.", "eng": "The bedclothes were tumbled as though the bed had been slept in."}, {"viet": "Việc sinh đôi đã thúc bách họ tìm một căn hộ lớn hơn.", "eng": "The birth of twins put pressure on them to find a bigger flat."}, {"viet": "Quả bom phát nổ và đưa tất cả bọn chúng sang thế giới bên kia.", "eng": "The bomb exploded and blew them to all to kingdom come."}, {"viet": "Ông chủ nhảy chồm chồm muốn phát điên về chuyện đó-và'điên'là từ có ý nghĩa nhất.", "eng": "The boss is hopping mad about it-and'mad'is the operative word."}, {"viet": "Những cành cây chạm mặt nước.", "eng": "The branches of the tree touched the water."}, {"viet": "Số đông nhân dân ủng hộ điều đó.", "eng": "The bulk of the population voted for it."}, {"viet": "Sự can đảm bình tĩnh của phi công đã bảo toàn được tính mạng của hành khách.", "eng": "The calm courage of the pilot preserved the lives of the passengers."}, {"viet": "Chiếc xe phía trước đang nháy đèn, nó sắp rẽ sang phải.", "eng": "The car in front is winking-it's going to turn right."}, {"viet": "Chiếc xe ba gác lăn lốc cốc trên con đường rải sỏi.", "eng": "The cart clattered over the cobble."}, {"viet": "Tiếng xích kêu lách cách khi cầu kéo mở ra.", "eng": "The chains clanked as the drawbridge opened."}, {"viet": "Các phụ tá chính của tổng thống.", "eng": "The chief aides-de-camp to the president."}, {"viet": "Đứa trẻ đã được đặt dưới sự giám hộ của tòa án.", "eng": "The child was made a ward of court."}, {"viet": "Những đứa bé ở đây rất tốt với nhau.", "eng": "The children here are quite friendly with one another."}, {"viet": "Những món quà đã làm cho bọn trẻ sướng rơn lên.", "eng": "The children were thrilled to bits by their presents."}, {"viet": "Lớp học được báo là sẽ không có cuộc đi chơi trừ phi các học sinh gắng sức.", "eng": "The class were told that there would be no outing unless they pulled their socks up."}, {"viet": "Vùng bờ biển đầy những người biệt xứ.", "eng": "The coast is crawling with expatriates."}, {"viet": "Báo cáo của hội đồng miêu tả chính sách này là một sự thất bại hoàn toàn đã làm cho chính phủ trở thành ngớ ngẩn.", "eng": "The committee's report, which describes this policy as a total failure has left the government with egg on its face."}, {"viet": "Công ty đang gặp những khó khăn nghiêm trọng về tài chính.", "eng": "The company is in serious financial difficulties."}, {"viet": "Sự mâu thuẫn giữa Thiên Chúa Giáo và Nhà nước.", "eng": "The conflict between the Church and the State."}, {"viet": "Cái nút chai bắn ra nổ đánh bốp.", "eng": "The cork came out of the bottle with a loud pop."}, {"viet": "Đất nước tràn lan những lời đồn về chiến tranh.", "eng": "The country was rife with rumours of war."}, {"viet": "Tên tội phạm đã bị lần theo dấu đến Glasgow.", "eng": "The criminal was traced to Glasgow."}, {"viet": "Tác động tích tụ của nhiều căn bệnh.", "eng": "The cumulative effect of several illnesses."}, {"viet": "Sự điều hành hàng ngày một đất nước.", "eng": "The day-to-day running of a country."}, {"viet": "Sự mịn màng của làn da cô ta.", "eng": "The delicate texture of her skin."}, {"viet": "Cơ hoành hút không khí vào phổi.", "eng": "The diaphragm draws air into the lungs."}, {"viet": "Cuộc tranh chấp đã được đưa ra trước Liên Hiệp Quốc.", "eng": "The dispute was referred to the United Nations."}, {"viet": "Bác sĩ đã cảnh cáo anh không được làm việc quá nhiều.", "eng": "The doctor warned him against working too hard."}, {"viet": "Con chó đó đen như than, do đó mới có tên là Shadow.", "eng": "The dog was coal black, whence the name Shadow."}, {"viet": "Tài xế dừng xe tại chỗ đèn hiệu giao thông.", "eng": "The driver pulled up at the traffic lights."}, {"viet": "Nền kinh tế đang ở trong tình trạng lạm phát xoắn trôn ốc.", "eng": "The economy is caught in an inflationary spiral."}, {"viet": "Kẻ thù đã dâng tiền bạc, chức tước và đất đai cho vị tướng với mưu đồ cám dỗ ông bỏ bê nhiệm vụ.", "eng": "The enemy offered money, rank and lands to the general in an attempt to seduce him from his duty."}, {"viet": "Gia sản thuộc quyền thừa kế của người con trưởng.", "eng": "The estate is the birthright of the eldest son."}, {"viet": "Sự kết thúc hợp đồng thuê nhà, lĩnh canh, hiệp định, hợp đồng, v. v..", "eng": "The expiration of the lease, tenancy, agreement, contract, etc."}, {"viet": "Gia đình đó đã sở hữu nông trại này trong nhiều năm nay.", "eng": "The family have occupied the farm for many years."}, {"viet": "Cơn sốt đã kéo dài năm ngày không lúc nào ngưng.", "eng": "The fever lasted five days without intermission."}, {"viet": "Chương cuối của một cuốn sách.", "eng": "The final chapter of a book."}, {"viet": "Công ty đã ghi nhận công việc nổi bật của Tom bằng cách tặng anh ta thêm một khoản tiền thưởng.", "eng": "The firm recognized Tom's outstanding work by giving him an extra bonus."}, {"viet": "Những ánh đèn lập lòe có nghĩa là đường bị nghẽn rồi.", "eng": "The flashing lights mean that the road is blocked."}, {"viet": "Cách xếp đặt các cánh buồm trước và sau cho chiếc thuyền buồm.", "eng": "The fore-and-aft rig of a schooner."}, {"viet": "Toàn bộ chi phí cho đám cưới tôi phải gánh vác.", "eng": "The full cost of the wedding fell on me."}, {"viet": "Cổng này hẹp quá ô tô không đi qua được.", "eng": "The gate is too narrow for cars to go through."}, {"viet": "Sự hào nhoáng và hấp dẫn của Hollywood.", "eng": "The gloss and glitter of Hollywood."}, {"viet": "Cuộc khủng hoảng chính phủ sẽ là một đề tài hay để viết bài cho báo.", "eng": "The Government crisis will make good copy."}, {"viet": "Chính phủ lo lắng về trị giá thấp của bảng Anh.", "eng": "The Government is worried about the weakness of the pound."}, {"viet": "Tính chất ảm đạm, sóng gió, phức tạp của cuộc sống và những tình huống bấp bênh của cuộc đời mà chúng ta thực sự đang sống.", "eng": "The gray, grainy, complex nature of existence and the ragged edge of our lives as we actually live them."}, {"viet": "Người khách trọ nhờ nhân viên khách sạn chụp ảnh giúp ông ấy.", "eng": "The guest asks the clerk to take photos for him."}, {"viet": "Ông hiệu phó giúp ông hiệu trưởng trong nhiều nhiệm vụ.", "eng": "The head teacher's deputy assists with many of his duties."}, {"viet": "Một hình thức diễn xuất hết sức cổ truyền trong kịch nghệ Nhật Bản.", "eng": "The highly stylised form of acting in Japanese theatre."}, {"viet": "Cái nóng của khí hậu oi bức vùng Indiana nóng nực khiến cho con chó gia đình đó phải chui rúc xuống gầm chiếc xe tải nhẹ để hưởng bóng mát.", "eng": "The hot kind of hot Indiana hot weather that sends the family dog scrooching under the pickup truck to enjoy the shade."}, {"viet": "Thượng nghị viện đã đảo ngược quyết định của Hạ nghị viện.", "eng": "The House of Lords overturned the decision by the House of Commons."}, {"viet": "Ý kiến đó sẽ chẳng bao giờ thực hành được.", "eng": "The idea would never work in practice."}, {"viet": "Tác động của khí hậu đối với sản xuất nông nghiệp.", "eng": "The influence of the climate on agricultural production."}, {"viet": "Bọn xâm lược đã cướp bóc lương thực và những đồ quý giá ở các thị trấn và làng mạc ven bờ biển.", "eng": "The invaders plundered food and valuables from coastal towns and villages."}, {"viet": "Chuyến đi tới London mất 3 tiếng đồng hồ.", "eng": "The journey to London takes three hours."}, {"viet": "Thận làm phần lớn công việc này.", "eng": "The kidneys do most of this work."}, {"viet": "Ấu trùng của bướm thường hay bướm đêm thường được gọi là sâu bướm.", "eng": "The larva of a moth or a butterfly is often called a caterpillar."}, {"viet": "Hợp đồng thuê nhà đó còn hiệu lực bốn năm nữa.", "eng": "The lease has four years left to run."}, {"viet": "Ánh sáng lọt qua khe hẹp.", "eng": "The light came through the narrow aperture."}, {"viet": "Kỳ nghỉ hè dài trải ra trước mặt của họ.", "eng": "The long summer holiday stretched ahead of them."}, {"viet": "Thầy phù thuỷ phô trương bùa yêu thuốc lú của lão.", "eng": "The magician displayed his charms and potions."}, {"viet": "Viên giám đốc buộc những nhân công làm việc chăm chỉ bằng cách dọa đuổi việc.", "eng": "The manager tried to bully his men into working harder by threatening them with dismissal."}, {"viet": "Bữa ăn này có thể làm mỗi người chúng ta phải trả 15 bảng Anh.", "eng": "The meal is likely to set us back £ 15 each."}, {"viet": "Công nhân đã đình công một tuần nay.", "eng": "The men have been on strike for a week."}, {"viet": "Sự thoát hiểm kỳ diệu của vài người trong vụ rơi máy bay.", "eng": "The miraculous survival of some people in the air crash."}, {"viet": "Bài học rút ra từ câu chuyện này là'Chậm còn hơn không'.", "eng": "The moral of this story is'Better late than never'."}, {"viet": "Phim bắt đầu chiếu vào lúc bảy giờ đúng, nhưng tôi muốn có mặt ở đó sớm hơn.", "eng": "The movie starts at seven sharp, but I would like to be there early."}, {"viet": "Những nhu cầu của cộng đồng phải được đặt lên trước những đòi hỏi của cá nhân.", "eng": "The needs of the community must take precedence over individual requirements."}, {"viet": "Luật mới có hiệu lực từ mồng 1 tháng giêng.", "eng": "The new laws was made retroactive to 1 January."}, {"viet": "Chính sách lương mới gây ra một sự tranh cãi dữ dội tại cuộc họp hôm qua.", "eng": "The new wages policy caused a terrible fracas at the meeting yesterday."}, {"viet": "Chuyến tàu tiếp sau đi Manchester chạy vào lúc 10 giờ.", "eng": "The next train to Manchester is at 10: 00."}, {"viet": "Số sinh viên tính trung bình là năm trăm.", "eng": "The number of student averages five hundreds."}, {"viet": "Cơ quan có thẩm quyền chứng nhận độ an toàn của các sản phẩm của chúng tôi và chúng tôi bảo đảm là chúng tôi đạt chất lượng cao.", "eng": "The official authority certifies our products for safety and we guarantee their high quality."}, {"viet": "Những người già trong làng nghi ngờ những cái mà giới trẻ đang làm.", "eng": "The older people in the village look askance at what the young people were doing."}, {"viet": "Tính chất cứng nhắc của những tập tục cổ truyền.", "eng": "The ossification of traditional practices."}, {"viet": "Tất cả báo chí đã cố thi nhau đoán về nước cờ sắp tới của ông Tổng thống.", "eng": "The papers have all been trying to second-guess each other about the President's next move."}, {"viet": "Con đường uốn khúc dọc bờ sông.", "eng": "The path wound along the side of the river."}, {"viet": "Dân chúng muốn thông tin từ chính phủ, không phải tuyên truyền.", "eng": "The people want information from the government, not propaganda."}, {"viet": "Với cái ăng-ten mới hình ảnh tivi đã rõ hơn nhiều.", "eng": "The picture is much clearer with the new aerial."}, {"viet": "Kế hoạch có sự ủng hộ của nhà nước.", "eng": "The plan has the backing of the government."}, {"viet": "Vở kịch được nhiều bài nhận xét ca ngợi trên báo chí.", "eng": "The play got rave notices in the papers."}, {"viet": "Cảnh sát đang hỏi cung hai người tình nghi.", "eng": "The police are interrogating two suspects."}, {"viet": "Cảnh sát đẩy tên trộm ra khỏi nhà và lên xe bịt kín của họ.", "eng": "The police hustled the thief out of the house and into their van."}, {"viet": "Viên cảnh sát cẩn thận nhích dần về phía trước.", "eng": "The policeman slowly edged his way forward."}, {"viet": "Áp-phích này sẽ không dính dù cho tôi đã phết đẫm hồ.", "eng": "The poster wouldn't stick even though I drenched it with glue."}, {"viet": "Bài nói của Tổng thống nhằm cho tầng lớp quần chúng đông đảo và thực tế không nói điều gì quan trọng.", "eng": "The President's speech is designed to appeal to the lowest common denominator and doesn't actually say very much of importance."}, {"viet": "Gần đây giá vàng không biến động nhiều lắm.", "eng": "The price of gold does not fluctuate so much recently."}, {"viet": "Người tù nhân thấy cửa mở và bỏ chạy.", "eng": "The prisoner noticed that the door was open and ran away."}, {"viet": "Chương trình kéo dài một giờ mười lăm phút.", "eng": "The programme lasted an hour and a quarter."}, {"viet": "Quần chúng thường không muốn chấp nhận sự thay đổi.", "eng": "The public are usually unwilling to accept change."}, {"viet": "Cuộc viếng thăm chính thức của Nữ hoàng tại Trung Quốc.", "eng": "The Queen's state visit to China."}, {"viet": "Tên hiếp dâm bị kết án trên cơ sở chứng cứ pháp lý.", "eng": "The rapist was convicted on the basis of forensic evidence."}, {"viet": "Những người tị nạn rất thiếu chăn mền, còn lương thực thì lại còn thiếu nhiều hơn nữa.", "eng": "The refugees are badly off for blankets, and even worse off for food."}, {"viet": "Nước trong hồ chứa xuống rất thấp sau vụ hạn kéo dài.", "eng": "The reservoir was very low after the long drought."}, {"viet": "Ngài James Smith rất tôn kính, Bộ trưởng Ngoại giao.", "eng": "The Right Honourable James Smith, Foreign Secretary."}, {"viet": "Con đường ngoằn ngoèo lượn qua dãy đồi.", "eng": "The road wanders through the range of hills."}, {"viet": "Những cây hồng đã nở hoa độ một tuần.", "eng": "The roses have been in flower for a week."}, {"viet": "Lương họ trả cho tôi không cao cho lắm.", "eng": "The salary they pay me is none too high."}, {"viet": "Nhà trường mới có được một vật quý giá, đó là ông Smith.", "eng": "The school has a valuable new acquisition in Mr. Smith."}, {"viet": "Hạt giống tự nó cũng có ích, nhưng ích lợi hơn lại là chất bông trắng muốt gắn trên các hạt giống.", "eng": "The seeds themselves are useful but even more useful is the fluffy white cotton fastened to the seeds."}, {"viet": "Những con cừu này có bộ lông dày đẹp.", "eng": "The sheep have fine thick fleeces."}, {"viet": "Xưởng đóng tàu đang làm ba công việc khác nhau.", "eng": "The shipyard is working on three different jobs."}, {"viet": "Những thắng cảnh của thành phố đó bao giờ cũng gây ấn tượng tốt cho khách du lịch nước ngoài.", "eng": "The sights of the city never fail to impress foreign tourists."}, {"viet": "Sự lay động khẽ khàng của cành lá trong cơn gió.", "eng": "The slow see-saw of the branch in the wind."}, {"viet": "Những người lính cuối cùng cũng qua được các buổi kiểm tra về sức chịu đựng.", "eng": "The soldiers eventually completed the endurance tests."}, {"viet": "Diễn giả quên bài nói vì vậy phải nói theo trí nhớ.", "eng": "The speaker forgot his notes so he had to talk from memory."}, {"viet": "Mức Sống ở nước chúng tôi thấp hơn ở nước của anh.", "eng": "The standard of living in our country is lower than in yours."}, {"viet": "Cơn bão đã tạm lắng để cho họ cứu những người sống sót.", "eng": "The storm relented us long enough for them to rescue the survivor."}, {"viet": "Chất này phải 60 tiếng đồng hồ mới cháy hết.", "eng": "The stuff takes sixty hours in burning."}, {"viet": "Cuộc liên hoan tao ngộ trở thành rất nhạt nhẽo.", "eng": "The surprise party turned out as flat as a pancake."}, {"viet": "Cô giáo bị bĩu môi búng lưỡi chế giễu khi cô ta quay lưng đi.", "eng": "The teacher got a raspberry as she turned her back."}, {"viet": "Truyền hình ít có sức hấp dẫn đối với tôi.", "eng": "The television has little attraction for me."}, {"viet": "Bọn trộm chạy trốn với 100 tờ một nghìn đô la của ngân hàng địa phương.", "eng": "The thieves got away with 100 G from the local bank."}, {"viet": "Ngăn kéo trên cùng là ngăn có để dao kéo ở trong.", "eng": "The top drawer is the one with the cutlery in."}, {"viet": "Con tàu tiến lên qua những thung lũng.", "eng": "The train was burrowing through valleys."}, {"viet": "Xe tải cũng trộn xi măng, phải vậy không?", "eng": "The trucks mix the cement too, don't they?"}, {"viet": "Hai bên đã không đạt được thoả thuận.", "eng": "The two sides failed to reach agreement."}, {"viet": "Sự thật không úp mở, nói thẳng thắn sự thật.", "eng": "The unvarnished truth, told the unvarnished truth."}, {"viet": "Làng đó bị tách biệt khỏi thế giới bởi các hồ và đầm lầy.", "eng": "The village is shut off from the world by lakes and marshes."}, {"viet": "Cái đồng hồ anh cho tôi chạy thật đúng giờ.", "eng": "The watch you gave me keeps perfect time."}, {"viet": "Cả nước đã kháng chiến chống bọn xâm lược.", "eng": "The whole country resisted the invaders."}, {"viet": "Người dự thi thắng cuộc một bức ảnh đẹp.", "eng": "The winning entry was a beautiful photo."}, {"viet": "Dân số lao động của đất nước đang giảm dần.", "eng": "The working population of the country is growing smaller."}, {"viet": "Chuyện của họ kể về những gì đã xảy ra không khớp nhau.", "eng": "Their accounts of what happened don't hang together."}, {"viet": "Thân hình thon dài duyên dáng của chúng được che kín bằng các cơ quan tỏa sáng đỏ, xanh lơ và xanh lục thanh nhã.", "eng": "Their long, graceful bodies are covered with organs that give off delicate red, blue or green light."}, {"viet": "Sau đó thêm vào rau bina và đậu hũ, và đun sôi chúng lên.", "eng": "Then add the spinach and tofu, and boil them."}, {"viet": "Có một cửa hàng thuốc bên kia nhà băng.", "eng": "There's a drugstore kitty corner from the bank."}, {"viet": "Kia là bà O'Brien đang đưa lũ con đi dạo.", "eng": "There's Mrs O'Brien taking her brood for a walk."}, {"viet": "Có điều gì có vẻ ám muội đang xảy ra ở đây.", "eng": "There's something rather fishy going on here."}, {"viet": "Có nhiều mối nguy hiểm trong cuộc hành trình qua Châu Phi.", "eng": "There are many hazards in a journey across Africa."}, {"viet": "Tiếng Nhật có 3 loại chữ: kanji, hiragana, katakana.", "eng": "There are three types of Japanese characters: kanji, hiragana, katakana."}, {"viet": "Trong góc tường có một cái rượu nhỏ.", "eng": "There in the corner is a mini-bar."}, {"viet": "Còn một khía cạnh khác của vấn đề này mà anh chưa xét tới.", "eng": "There is another dimension to this problem which you haven't considered."}, {"viet": "Một sự bực bội lan rộng đối với ban điều hành ở cái cách họ phớt lờ mọi yêu sách của chúng tôi.", "eng": "There is widespread resentment against the management over the way they have ignored our demands."}, {"viet": "Sau cơn bão, điện bị mất.", "eng": "There was a power failure after the storm."}, {"viet": "Hầu như không có xe cộ nên chúng tôi đến đó chưa đầy một tiếng.", "eng": "There was very little traffic, so we got there in less than an hour."}, {"viet": "Đấy! Tôi đã bảo anh là dễ mà!", "eng": "There you are! I told you it was easy!"}, {"viet": "Những hàng hoá này được bảo hiểm đối với hoả hoạn hay trộm cắp.", "eng": "These goods are covered against fire or theft."}, {"viet": "Những thân cây bò lan um tùm này sẽ bị chặt bớt khỏi bụi.", "eng": "These straggly stems should be pruned off the bush."}, {"viet": "Qua rađiô, họ cứ khen mãi buổi trình diễn mới của anh ấy.", "eng": "They've been plugging his new show on the radio."}, {"viet": "Họ đang làm điều đó vì đoán trước anh thành công.", "eng": "They are doing it in anticipation of your success."}, {"viet": "Họ đã mua một con chó để ngăn ngừa những vụ trộm có thể xảy ra.", "eng": "They bought a dog to prevent any burglaries."}, {"viet": "Họ chống lại đề nghị của chúng tôi bằng cách đưa ra đề nghị riêng của họ.", "eng": "They countered our proposal with one of their own."}, {"viet": "Họ trao đổi con tin với nhau.", "eng": "They exchanged hostages with each other."}, {"viet": "Họ phải đứng hàng giờ mà không thay đổi tư thế.", "eng": "They had to stand for hours without changing position."}, {"viet": "Họ đặt người phụ nữ bị thương xuống cỏ.", "eng": "They laid the injured woman on the grass."}, {"viet": "Họ phải phân biệt trách nhiệm cá nhân của mình với trách nhiệm chung.", "eng": "They must distinguish their individual accountabilities form their joint accountabilities."}, {"viet": "Họ chở ( hàng ) bằng bè mảng dưới sông.", "eng": "They rafted ( the stores ) down the river."}, {"viet": "Họ xếp đống văn phòng phẩm lên giá.", "eng": "They shelved the new stock of stationery."}, {"viet": "Họ dùng báo chí để gieo rắc những quan điểm hữu khuynh.", "eng": "They use the press to disseminate right-wing views."}, {"viet": "Số mệnh đã định là họ không bao giờ gặp lại nhau nữa.", "eng": "They were destined never to meet again."}, {"viet": "Họ sẽ nói cho ông biết tại phòng thông tin.", "eng": "They will tell you at the information bureau."}, {"viet": "Hành vi này là một thí dụ tính ích kỷ của anh.", "eng": "This behaviour illustrates your selfishness."}, {"viet": "Cái đất nước này ngày một trở nên tồi tệ ông già nói.", "eng": "This country's going to the dogs said the old man."}, {"viet": "Thức ăn này không thích hợp với khách của bạn.", "eng": "This food is not fit for your visitors."}, {"viet": "Tôi là Trần ở phòng số 123.", "eng": "This is Mr. Chen in Room 123."}, {"viet": "Đền Lạt ma này được sáng lập bởi Hoàng đế Càn Long vào năm 1744.", "eng": "This Lama Temple was founded by the Emperor Qian Long in 1744."}, {"viet": "Con lừa già này cưỡi rất tốt và an toàn cho một đứa trẻ.", "eng": "This old donkey is a good quiet mount for a child."}, {"viet": "Thế này là giảm 5% về giá trị thực tế.", "eng": "This represents a reduction of 5% in real terms."}, {"viet": "Cái bàn này ở chợ bán rất rẻ.", "eng": "This table was going for a song at the market."}, {"viet": "Quần áo đó chẳng làm tôn lên hình thức bên ngoài của cô ấy.", "eng": "Those clothes do nothing to enhance her appearance."}, {"viet": "Tuổi trẻ ngày nay không kính trọng người lớn tuổi hơn họ.", "eng": "Today's youth don't have respect for their elders."}, {"viet": "Xe lửa chắc là phải chậm vì sương mù.", "eng": "Trains are subject to delay during fog."}, {"viet": "Ngay từ đầu, trong khi nghiên cứu thiên văn học, Copernicus đã quả quyết rằng ý tưởng này không đúng.", "eng": "Very early in his study of astronomy Copernicus decided that this idea was wrong."}, {"viet": "Các phương cách đã được đề ra sao cho quả nặng di động một đoạn ngắn, sau đó dừng lại, tiếp tục di động thêm và cứ như thế tiếp diễn.", "eng": "Ways were worked out of letting the weight move a little way, then stopping it, then letting it move a little more, and so on."}, {"viet": "Chúng tôi sẽ cố gắng thực hiện đơn đặt hàng vào Thứ hai, nhưng hiện nay chúng tôi thiếu người quá.", "eng": "We'll try to get the order through Monday, but we're very short-staffed at the moment."}, {"viet": "Chúng tôi dự định mùa hè này thăm Châu âu.", "eng": "We're planning to visit Europe this summer."}, {"viet": "Những tháng vừa qua chúng ta đã trao đổi nhiều thư từ quan trọng và tôi đã mong đợi được gặp trực tiếp ông.", "eng": "We've had a lot of important correspondence these past months and I've looked forward to meeting you in person."}, {"viet": "Có vẻ như chúng ta luôn mang đủ thứ chổi cùn rế rách khi chúng ta đi nghỉ.", "eng": "We always seem to take everything but the kitchen sink when we go on holiday."}, {"viet": "Chúng tôi đang tìm cách làm rõ ràng sự hoạt động của chính phủ.", "eng": "We are trying to demystify the workings of government."}, {"viet": "Chúng tôi không thể trồng rau khi đất vẫn còn bị sương giá làm đông cứng.", "eng": "We can't plant the vegetables while the earth is still frostbound."}, {"viet": "Chúng tôi trèo ra khỏi lỗ ngay trước mặt hai cảnh sát đầy kinh ngạc.", "eng": "We climbed out of the hole, right in front of two astonished policemen."}, {"viet": "Chúng tôi không buôn bán nhiều với các công ti nước ngoài.", "eng": "We don't do much business with foreign companies."}, {"viet": "Chúng tôi yểm hộ anh ấy bằng hoả lực khi anh ấy lao qua khoảng trống trong rừng.", "eng": "We gave him covering fire as he dashed across the clearing."}, {"viet": "Chúng tôi đã phải lắng nghe một bài lên lớp dài dòng về việc không được lãng phí thời gian.", "eng": "We had to listen to a long sermon about not wasting time."}, {"viet": "Chúng tôi không bao giờ khám phá ra được cái gì đã xảy ra ( giữa họ ) đêm hôm đó.", "eng": "We have never discovered what took place ( between them ) that night."}, {"viet": "Chúng tôi hỏi xem có còn chỗ trống nào nữa không.", "eng": "We inquired whether there were any more vacancies."}, {"viet": "Chúng tôi rất thích đi chơi về vùng quê vào ngày nghỉ cuối tuần.", "eng": "We love to get out into the countryside at weekends."}, {"viet": "Đã đến lúc chúng ta phải đi.", "eng": "We must make a move, we must be on the move."}, {"viet": "Chúng tôi chỉ ăn một tí qua loa vào bữa trưa.", "eng": "We only had a little snack at lunchtime."}, {"viet": "Khi trang trí căn phòng, chúng tôi giữ lại chỗ lò sưởi như trước kia.", "eng": "We retained the original fireplace when we decorated the room."}, {"viet": "Ngày nay chúng ta tiêu nhiều tiền hơn vào thức ăn.", "eng": "We spend more of our money on food these days."}, {"viet": "Chúng tôi có cà phê Hải Nam và cà phê Vân Nam.", "eng": "We've got Hainan and Yunnan coffee."}, {"viet": "Chúng tôi vô cùng thích thú bởi cảnh núi đồi.", "eng": "We were enraptured by the view of the mountains."}, {"viet": "Chúng ta nhất định sẽ không đầu hàng mà không chiến đấu.", "eng": "We will not surrender without a struggle."}, {"viet": "À, hiện giờ ông ấy đang bận.", "eng": "Well, he's busy at the moment."}, {"viet": "À, có nhiều phong cảnh mà chỉ mất ít ngày lái xe từ Los Angeles.", "eng": "Well, there are many scenic areas that are only a few days drive from Los Angeles."}, {"viet": "Giới hạn tốc độ trên xa lộ là bao nhiêu?", "eng": "What's the speed limit on the motorway?"}, {"viet": "Họ đang làm cái gì ầm ĩ thế?", "eng": "What are they making such a hoo-ha about?"}, {"viet": "Ý bà là sao, sau đó ông ấy sẽ trả giá cho việc đó là sao?", "eng": "What do you mean, he pays for it later?"}, {"viet": "Anh hiểu thế nào về chúng?", "eng": "What interpretation would you place on them?"}, {"viet": "Bạn chuyên về lĩnh vực nào?", "eng": "What is your area of expertise?"}, {"viet": "Ở Nhật Bản, những con số nào được xem là xui xẻo?", "eng": "What numbers are considered to be bad luck in Japan?"}, {"viet": "Chuyến tàu đến nơi lúc mấy giờ?", "eng": "What time does the train reach its destination?"}, {"viet": "Khi Derek thấy Bob làm hỏng xe đạp của anh ta thì một trận đánh nhau thực sự đã xảy ra.", "eng": "When Derek found Bob had damaged his bicycle, it really made the feathers fly."}, {"viet": "Khi tôi xem những tấm hình cũ của tôi, nó làm tôi nhớ lại những kỉ niệm đẹp.", "eng": "When I look at my old photos, it brings back good memories."}, {"viet": "Khi bác sĩ cắm kim tiêm vào cánh tay cô bé, nó kêu la ầm ĩ.", "eng": "When the doctor stuck the needle into her arm, the child screamed blue murder."}, {"viet": "Khi nào thì đơn đặt hàng sẽ sẵn sàng để tôi ký?", "eng": "When will the order be ready for me to sign?"}, {"viet": "Bạn mua quần áo của cô ấy ở đâu?", "eng": "Where do you buy her clothes?"}, {"viet": "Bạn thích thuốc nào hơn, thuốc tây hay đông dược?", "eng": "Which do you prefer, Western medicine or Chinese medicine?"}, {"viet": "Trong khi chúng tôi còn đang lưỡng lự, thì đã có người khác mua mất ngôi nhà.", "eng": "While we were wavering, somebody else bought the house."}, {"viet": "Ai bảo anh thế?''Ồ, một người nào đó, tôi không nhớ ai'.", "eng": "Who told you?''Oh, somebody or other, I've forgotten who'."}, {"viet": "Tại sao anh không chơi bóng đá mà lại đứng nhìn thế?", "eng": "Why don't you play football instead of looking on?"}, {"viet": "Liệu chiếc xe ôtô này có chịu được điều kiện mùa đông ở đây không?", "eng": "Will this car stand up to winter conditions here?"}, {"viet": "William Morris là một trong những người đầu tiên đề xướng chủ nghĩa xã hội.", "eng": "William Morris was one of the early prophets of socialism."}, {"viet": "Với thành tích này, cô ấy đã giành được danh hiệu vô địch lần thứ ba.", "eng": "With this performance, she has notched up her third championship title."}, {"viet": "Liệu bạn có đồng ý là môn bóng bầu dục và bóng đá đều đòi hỏi kĩ năng nhiều mặt chứ?", "eng": "Would you also agree that rugby and soccer require greater all-round skill?"}, {"viet": "Bà muốn gọi bây giờ chưa?", "eng": "Would you like to order now?"}, {"viet": "Cô đánh máy luôn địa chỉ vào nhé?", "eng": "Would you type an address label as well?"}, {"viet": "Vâng, tôi không thể cáng đáng chi phí chuyến bay thường kì.", "eng": "Yes, I can't afford a regular flight."}, {"viet": "Yoga là một phương pháp tốt để học cách thư giãn.", "eng": "Yoga is a good discipline for learning to relax."}, {"viet": "Ông cần có những bằng chứng mạnh mẽ hơn để biện hộ cho yêu sách của ông đối với sự thừa kế.", "eng": "You'll need stronger evidence to defend your claim to the inheritance."}, {"viet": "Gần đây anh thức khuya quá nhiều.", "eng": "You've been having too many late nights recently."}, {"viet": "Anh vui lòng khoá cửa ra vào khi đi khỏi nhà được không?", "eng": "You be so good as to lock the door when you leave?"}, {"viet": "Ở cửa hàng góc phố, anh có thể mua được dây, keo dán, kẹp giấy và những thứ đại loại như thế.", "eng": "You can buy string, glue, paper-clips and suchlike at the corner shop."}, {"viet": "Anh có thể đi bộ từ đây ra công viên nhưng nó cũng khá xa đấy.", "eng": "You can walk from here to the park but it's a goodish distance."}, {"viet": "Con quên những sự kiên và tình cảm buồn đi.", "eng": "You forget the unhappy events and feelings."}, {"viet": "Anh chỉ phải tùy cơ ứng biến.", "eng": "You just have to play it by ear."}, {"viet": "Bố muốn nói quả có vấn đề khiến cả thành phố phải quan tâm?", "eng": "You mean there is such a problem as to create general concern in town?"}, {"viet": "Anh phải nếm thử rượu vang tự làm lấy của bà ta-thật đáng là một sự nếm trải!", "eng": "You must try some of her home-made wine-it's quite an experience!"}, {"viet": "Tôi thấy em hoàn toàn bình thường.", "eng": "You seem perfectly normal to me."}, {"viet": "Anh không nên ký hợp đồng chừng nào mà chưa nghiên cứu cẩn thận các điều khoản.", "eng": "You shouldn't make a contract until you have studied its provisions carefully."}, {"viet": "Anh sẽ nhận được tiền của anh, cho dù chuyện gì xảy ra đi nữa.", "eng": "You will get your money, no matter what happens."}, {"viet": "Những lời bình luận của anh sẽ được chúng tôi lưu ý cẩn thận.", "eng": "Your comments will receive our close attention."}, {"viet": "Trường của anh đã công bố thời gian biểu cho khoá học mới rồi đấy.", "eng": "Your school set forth the timetable for the new course."}]