[{"viet": "Một miếng xăn-uých của tôi đã bị cắn.", "eng": "A bite had been taken out of my sandwich."}, {"viet": "Một con Chihuahua, chẳng hạn, không thể giúp ích nhiều trong việc kéo xe được.", "eng": "A Chihuahua, for instance, would not be very helpful a pulling loads."}, {"viet": "Những kẻ lừa đảo biến những góa phụ giàu có thành nạn nhân của họ.", "eng": "A confidence trickster preying on rich windows."}, {"viet": "Một ngày trong lịch của chúng ta là thời gian ban ngày và thời gian ban đêm cộng lại.", "eng": "A day on our calendar is daytime and night time together."}, {"viet": "Cái trò lừa gạt hai mặt ấy làm mất sáu sinh mạng.", "eng": "A double-cross that costs six lives."}, {"viet": "Trận đấu dữ dội giữa hai võ sĩ đô vật.", "eng": "A fierce struggle between two wrestlers."}, {"viet": "Một chuyện kỳ quặc đã xảy ra với tôi hôm nay.", "eng": "A funny thing happened to me today."}, {"viet": "Rất nhiều chuyện phụ thuộc vào quyết định này.", "eng": "A great deal hangs on this decision."}, {"viet": "Vùng áp cao khắp nam châu Âu đã tạo thời tiết đẹp ấm áp cho mọi miền.", "eng": "A high over southern Europe is bringing fine sunny weather to all parts."}, {"viet": "Một thư ký cấp thấp ở một cơ quan.", "eng": "A junior clerk in an office."}, {"viet": "Thư viện với lượng lớn sách hiếm.", "eng": "A library with a store a rare books."}, {"viet": "Máy dập các phụ tùng động cơ.", "eng": "A machine for stamping out engine parts."}, {"viet": "Chúc tất cả bạn đọc một lễ Noel vui vẻ!", "eng": "A merry Xmas to all our readers!"}, {"viet": "Một phương pháp mới về giảng dạy ngôn ngữ.", "eng": "A new approach to language teaching."}, {"viet": "Một người vô thần được nuôi dưỡng bằng một mớ giáo lý cũ rích.", "eng": "A pagan suckled in a creed out-worn."}, {"viet": "Một quan điểm cá nhân về lịch sử quốc gia.", "eng": "A personal perspective of the nation's history."}, {"viet": "Một chế độ ăn uống kham khổ sẽ làm giảm sức đề kháng của ai đối với bệnh tật.", "eng": "A poor diet lowers one's resistance to illness."}, {"viet": "Một luồng gió phụt qua thổi bay tờ giấy.", "eng": "A puff of wind blew the paper away."}, {"viet": "Một sự đảo lộn các thủ tục, các khuynh hướng, các quan điểm thông thường.", "eng": "A reversal of the usual procedures, tendencies, opinions."}, {"viet": "Cái hất đầu tỏ vẻ khinh miệt.", "eng": "A scornful toss of the head."}, {"viet": "Một chương trình ca ngợi công việc của cảnh sát.", "eng": "A show that glamorizes police work."}, {"viet": "Một người lính tỏ ra có lòng can đảm vô cùng.", "eng": "A soldier who showed great courage."}, {"viet": "Một sợi bông lòng thòng ở gấu váy.", "eng": "A strand of cotton hanging from the hem of a skirt."}, {"viet": "Một giáo viên có dính phấn trên áo của anh ta.", "eng": "A teacher with chalk on his jacket."}, {"viet": "Một bộ lạc hầu như không bị ảnh hưởng bởi tác động bên ngoài.", "eng": "A tribe hardly affected by external influence."}, {"viet": "Một tuần sống ở biển đã giúp cô ta hồi phục sức khỏe của cô ta.", "eng": "A week by the sea brought her back to health."}, {"viet": "Cách đây 50 năm các nhà khoa học nhận thấy có nhiều sự việc kỳ lạ xảy ra với một vài thí nghiệm của họ.", "eng": "About 50 years ago scientists noticed that odd things were happening to some of their experiments."}, {"viet": "Bỏ một lòng đỏ trứng vào bột và bơ để làm nó quyến lại.", "eng": "Add an egg-yolk to the flour and fat to make it to bind the mixture."}, {"viet": "Xét cho cùng thì tiếng Anh được xem là một ngôn ngữ quốc tế.", "eng": "After all, english is supposed to be an international language."}, {"viet": "Sau khi chạy được mười phút, anh ta lại đi từng bước.", "eng": "After running for ten minutes, he dropped into a walk."}, {"viet": "Sau khi bạn xem xong, vui lòng quay trả băng viđêô lại.", "eng": "After you are done, please rewind the video tape."}, {"viet": "Tất cả động vật có vú đều có bộ não phần nào giống chúng ta.", "eng": "All mammals have brains somewhat like ours."}, {"viet": "Các sĩ quan và thủy thủ đều được mời.", "eng": "All the officers and ratings were invited."}, {"viet": "Mặc dầu ban đầu hơi chậm chút xíu, tác giả lại tranh thủ kịp thời gian.", "eng": "Although the beginning is a skosh slow, the author picks up the pace."}, {"viet": "Một chương trình nghị sự không tỏ ra dung hòa.", "eng": "An agenda that does not smack of compromise."}, {"viet": "Một chuyên gia về nâng cao hiệu quả biệt phái từ văn phòng chính.", "eng": "An efficiency expert on loan from the main office."}, {"viet": "Một sự gia tăng gần 50% so với năm ngoái.", "eng": "An increase of nearly 50% over last year."}, {"viet": "Một cuộc giải phẫu lấy sạn thận.", "eng": "An operation to remove kidney stones."}, {"viet": "Và số còn lại trong đám chúng tôi, những con người thụ động trên thế gian này, đã tiếp tục sinh sống, làm như là không có chuyện gì bất hạnh đã xảy ra.", "eng": "And the rest of us, we passives of the world, proceeded as if nothing untoward had happened."}, {"viet": "Nam cực là nơi hẻo lánh nhất trên trái đất.", "eng": "Antarctica is the loneliest place on earth."}, {"viet": "Thẻ tín dụng có phổ biến ở châu Âu không?", "eng": "Are credit cards popular in Europe?"}, {"viet": "Ngay bây giờ cô có làm gì đặc biệt không?", "eng": "Are you doing anything special right now?"}, {"viet": "Ông là du khách đến thăm Hồng Kông phải không, ông Goodman?", "eng": "Are you visiting Hong Kong as a tourist, Mr. Goodman?"}, {"viet": "Là một người già, người ta thường bị sống một mình.", "eng": "As an old person, one is often condemned to live alone."}, {"viet": "Khi thời gian trôi qua mà chẳng thấy tăm hơi gì của đất liền, các thủy thủ đe dọa nổi loạn.", "eng": "As time went by with no land appearing, the men threatened to mutiny."}, {"viet": "Cuối cùng tôi qua được phần khó khăn nhất về bài thi học kỳ.", "eng": "At last I'm over the hump on my term paper."}, {"viet": "Sự chú ý đến từng chi tiết thể hiện tính tuyệt mỹ của một thợ thủ công giỏi.", "eng": "Attention to detail is the hallmark of a fine craftsman."}, {"viet": "Sướng quýnh lên do hứng trí, nhiệt tình, phấn chấn v. v.", "eng": "Be bubbling over with excitement, enthusiasm, high spirits, etc."}, {"viet": "Chịu trách nhiệm thi hành luật pháp.", "eng": "Be responsible for the administration of the law."}, {"viet": "Sự lủng củng nội bộ ở hậu trường về Bộ tham mưu của Tổng thống.", "eng": "Behind-the-scenes infighting on the President's staff."}, {"viet": "Màu đen không phải là màu ưa thích của tôi.", "eng": "Black is not my favorite colour."}, {"viet": "Những chữ sáng nổi bật trên nền sẫm màu.", "eng": "Bright lettering that stands out well from a dark background."}, {"viet": "Những bụi cây cọ vào cửa kính ôtô.", "eng": "Bushes scraped against the car windows."}, {"viet": "Nhưng hầu hết mọi người đều chấp nhận nó-họ xem nó là một điều phiền phức hơn là vấn đề nghiêm trọng về sản xuất.", "eng": "But most people just accept it-they regard it more as an inconvenience than as a serious production problem."}, {"viet": "Mua căn nhà này thật là một bước tai hại vì có một con đường chính sẽ được làm phía sau nó.", "eng": "Buying this house was a disastrous step: it's going to have a main road built behind it."}, {"viet": "C đọc nhẹ trong từ city và đọc mạnh trong từ cat.", "eng": "C is soft in city and hard in cat."}, {"viet": "Tôi có thể xem một mẫu sản phẩm của các ông được không?", "eng": "Can I see a sample of your product?"}, {"viet": "Cô có thể lấy nó ra mà không làm rách cái áo khoác được không?", "eng": "Can you get it out without tearing the down jacket?"}, {"viet": "Anh có nhận thấy điểm sai lầm trong lập luận của họ không?", "eng": "Can you spot the flaw in their argument?"}, {"viet": "Ôm một vật gì trong cánh tay của mình.", "eng": "Carry something in the crook of one's arm."}, {"viet": "Bọn trẻ được xếp lớp theo khả năng.", "eng": "Children are streamed according to ability."}, {"viet": "Lau sạch lỗ phun của lò ga.", "eng": "Clean the gas jet on the cooker."}, {"viet": "Đề cập tới một chủ đề với những tư tưởng sao chép lại.", "eng": "Come to a subject with ready made ideas."}, {"viet": "Xin chúc mừng, tôi nghe nói bạn đã sinh một bé gái!", "eng": "Congratulations, I heard you had a baby girl!"}, {"viet": "Cô ấy có thể đi họp ngay lập tức không?", "eng": "Could she go to the meeting immediately?"}, {"viet": "Anh vui lòng cho tôi biết về những đặc điểm khác nhau của chúng?", "eng": "Could you tell me about their different features?"}, {"viet": "Cắt cho tôi một mẩu phó mát nhỏ thôi.", "eng": "Cut me just a small sliver of cheese."}, {"viet": "Đã thắng được vị đương nhiệm trong một cuộc bầu cử sít sao.", "eng": "Defeated the incumbent in a close election."}, {"viet": "Làm tiêu tan hy vọng, sự nghiệp, danh tiếng của ai.", "eng": "Destroy somebody's hopes, career, reputation."}, {"viet": "Bạn có biết là trà xanh Nhật Bản có hàm lượng vitamin cao không?", "eng": "Did you know that Japanese green tea is very high in vitamins?"}, {"viet": "Đuổi hai thủ môn trong cùng một lần giao bóng.", "eng": "Dismiss two batsmen in the same over."}, {"viet": "Ở nước bạn, người lớn tuổi có nhận lương hưu không?", "eng": "Do the elderly receive a pension in your country?"}, {"viet": "Bạn có cảm thấy rằng các công ty đòi hỏi quá nhiều thời gian của nhân viên không?", "eng": "Do you feel that companies require too much time from their employees?"}, {"viet": "Cô có cái nào rẻ hơn không?", "eng": "Do you have one less expensive?"}, {"viet": "Bạn sống một mình hay sống cùng gia đình?", "eng": "Do you live on your own or with your family?"}, {"viet": "Bạn nghĩ nó có chói mắt quá không?", "eng": "Do you think it is too much?"}, {"viet": "Sáng mai con phải làm các bài tập của con trước tiên.", "eng": "Do your assignments first thing in the morning."}, {"viet": "ĐỪNG NÓI VỚI CON HÃY NÓI VỚI CÔNG TY.", "eng": "DON'T TELL ME, TELL THE COMPANY."}, {"viet": "Đừng làm rớt những quả đào, chúng dễ bị thâm lắm.", "eng": "Don't drop the peaches-they bruise easily."}, {"viet": "Đừng nằm ườn trên giường cả buổi sáng vậy!", "eng": "Don't lie in bed all morning!"}, {"viet": "Đừng nghĩ những gì bà ta đã nói là quan trọng-bà ta chỉ trêu chọc thôi.", "eng": "Don't take what she said seriously-she was only teasing."}, {"viet": "Ở Úc người ta nói tiếng Anh theo cách riêng.", "eng": "Down under they speak their own kind of English."}, {"viet": "Suốt những ngày thường, đường sá rất nhộn nhịp nhưng vào các ngày chủ nhật có rất ít xe cộ.", "eng": "During the week, the road is very busy but there is very little traffic on Sundays."}, {"viet": "Đổ cốc nước của mình vào chậu rửa bát.", "eng": "Empty one's glass into the sink."}, {"viet": "Dẫu cho anh đã thấy nó nhặt tiền, anh không thể chắc chắn rằng nó đã ăn cắp tiền đó.", "eng": "Even if you saw him pick up the money, you can't be sure he stole it."}, {"viet": "Bằng chứng chống lại chúng đang càng ngày càng nhiều.", "eng": "Evidence was piling up against them."}, {"viet": "Tận dụng một tình thế để có lợi cho riêng mình.", "eng": "Exploit a situation for one's own advantage."}, {"viet": "Những tai nạn gây tử vong giảm đi mức độ thường xuyên trong những năm gần đây.", "eng": "Fatal accidents have decreased in frequency over recent years."}, {"viet": "Những phim ảnh không thích hợp cho trẻ con.", "eng": "Films that are unsuitable for children."}, {"viet": "Nước chanh sủi bọt có thể chứa rất nhiều ga.", "eng": "Fizzy lemonade can be very gassy."}, {"viet": "Ví dụ như Nancy, cô gái sống ở nhà kế bên luôn luôn ăn kẹo, nhưng cô ấy luôn luôn có thể giữ được thân hình mảnh khảnh đấy.", "eng": "For example, Nancy who lives next door is always eating candy, but she always manages to stay slender."}, {"viet": "Frank Sinatra trình diễn ở phòng hòa nhạc Festival.", "eng": "Frank Sinatra in concert at the Festival Hall."}, {"viet": "Làm vườn là một trong những sở thích chủ yếu của cô ta.", "eng": "Gardening is one of her chief enjoyments."}, {"viet": "Muốn làm cho xong công việc đó vào ngày mai thì phải mất nhiều công sức đấy.", "eng": "Getting the job finished by tomorrow will take a lot of doing."}, {"viet": "Hãy xả nước cho thật sạch.", "eng": "Give your hair a good rinse after shampooing it."}, {"viet": "Tin vui cho tất cả những người gửi tiết kiệm-có một sự tăng lãi suất!", "eng": "Good news for all savers-a rise in interest rates!"}, {"viet": "Mưa đá rơi lộp độp trên mái nhà tôn.", "eng": "Hailstones rattled on the tin roof."}, {"viet": "Hành khách đã lên tàu chưa?", "eng": "Have the passengers gone on board yet?"}, {"viet": "Cậu đã từng thấy voi chưa?", "eng": "Have you ever seen an elephant?"}, {"viet": "Anh đã xem vở Hamlet mới ở Nhà hát chưa?", "eng": "Have you seen the new production of Hamlet at the Playhouse?"}, {"viet": "Ông ấy là người Pháp làm việc ở Ý.", "eng": "He's a French national working in Italy."}, {"viet": "Anh ta đã tự tiện lấy đồ dùng văn phòng của tôi.", "eng": "He's been helping himself to my stationery."}, {"viet": "Nó làm việc tích cực, nhưng không lanh lợi lắm.", "eng": "He's hard-working, but not very clever."}, {"viet": "Anh ta thật sự si mê người bạn gái mới của mình.", "eng": "He's really stuck on his new girlfriend."}, {"viet": "Nó vô ý đụng nhẹ đầu xe vào cột cổng.", "eng": "He accidentally nudged the gatepost with the front of the car."}, {"viet": "Hắn đã nhờ tôi cho hắn gửi lời thăm hỏi anh.", "eng": "He asked me to remember him to you."}, {"viet": "Anh ta mất bình tĩnh và bật khóc khi anh ta nghe tin đó.", "eng": "He broke down and wept when he heard the news."}, {"viet": "Nó làu bàu về việc bị yêu cầu tự nấu ăn sáng.", "eng": "He caviled at being asked to cook his own breakfast."}, {"viet": "Nó húc vào trần nhà nứt đầu!", "eng": "He cracked his nut on the ceiling!"}, {"viet": "Hôm nay anh ấy lại không đến, nhưng Jane đã trực thay cho anh ấy rồi.", "eng": "He didn't show up again today, but Jane covered for him."}, {"viet": "Anh ta bắt đầu một nghề mới.", "eng": "He embarked on a new career."}, {"viet": "Ông ta cảm thấy mình bị mắc lừa trong việc cưới nàng.", "eng": "He felt he had been entrapped into marrying her."}, {"viet": "Ông ta đã tạo ra một nhãn hiệu thực phẩm đông lạnh nổi tiếng mang tên mình.", "eng": "He gave his name to a well-known brand of frozen food."}, {"viet": "Ông ta từ từ đứng lên khỏi chiếc ghế bành.", "eng": "He got up slowly from the armchair."}, {"viet": "Nó đã phải trả lời bừa cho xong vì nó không biết câu trả lời đúng.", "eng": "He had to fudge a reply because he didn't know the right answer."}, {"viet": "Anh ấy đã mồ côi từ thủa lên năm.", "eng": "He has been an orphan since he was five."}, {"viet": "Anh ta có thói quen rất khó chịu là hút thuốc trong bữa ăn.", "eng": "He has the irritating habit of smoking during meals."}, {"viet": "Ông ta đã dụ dỗ họ mua một chiếc xe ô tô mới mặc dù họ thực sự không muốn.", "eng": "He inveigled them into buying a new car, even though they didn't really want one."}, {"viet": "Hắn ta không gây cảm tình tí nào.", "eng": "He is not at all prepossessing."}, {"viet": "Nó giật mạnh cần câu lên khỏi mặt nước.", "eng": "He jerked the fishing-rod out of the water."}, {"viet": "Anh ta bỏ ra khỏi phòng mà không giải thích.", "eng": "He left the room without explanation."}, {"viet": "Ông ta mất cả hai người con trong cuộc chiến tranh.", "eng": "He lost both his sons in the war."}, {"viet": "Anh ta đã đánh lừa để tôi nghĩ rằng anh ta giàu.", "eng": "He misled me into thinking he was rich."}, {"viet": "Anh ta vẽ hình tam giác màu đỏ.", "eng": "He outlined the triangle in red."}, {"viet": "Ông ta thích đọc tài liệu riêng tư trong phòng làm việc của mình.", "eng": "He preferred to read the documents in the privacy of his study."}, {"viet": "Ông ta thắc mắc về tính khả thi của đề nghị đó.", "eng": "He questioned the practicality of the proposal."}, {"viet": "Anh ta đăng ký ở khách sạn dưới một cái tên giả.", "eng": "He registered at the hotel under an assumed name."}, {"viet": "Hắn là một kẻ hay tán tỉnh phụ nữ.", "eng": "He's a devil with the ladies."}, {"viet": "Anh ta bắt đầu còng lưng xuống vì công việc căng thẳng.", "eng": "He's beginning to buckle under the pressure of work."}, {"viet": "Anh ấy đã làm cho quan điểm anh ấy trở nên rất rõ ràng.", "eng": "He's made his views abundantly clear."}, {"viet": "Anh ta giống cha mình như đúc.", "eng": "He's the spit and image of his father."}, {"viet": "Nó nói nó bị cúm, nhưng tôi nghĩ nó giả vờ để trốn việc.", "eng": "He says he's got flu, but I think he's malingering."}, {"viet": "Ông ta đã bắn hụt vài viên đạn trước khi trúng được mục tiêu.", "eng": "He shot off several bullets before hitting the target."}, {"viet": "Hắn đã lừa gạt tôi về những chuyện lớn hắn đã làm.", "eng": "He sold me a bill of goods about those big jobs he'd had."}, {"viet": "Ông ấy trốn tránh cả năm trời.", "eng": "He stayed in hiding for a year."}, {"viet": "Anh ta cố mỉm một nụ cười, mặc dầu điều đó có vẻ làm anh ta phải lấy hết sức mình.", "eng": "He summoned up a smile, though it seemed to take all his strength."}, {"viet": "Anh ấy ném quả bóng cho tôi nhưng tôi bắt trượt và nó rơi xuống đất.", "eng": "He threw the ball to me, but I missed it and it landed on the ground."}, {"viet": "Ông ta được đào tạo để trở thành một luật sư.", "eng": "He trained to be a lawyer."}, {"viet": "Nó đã giở khăn quàng ra khỏi cổ.", "eng": "He unwound the scarf from his neck."}, {"viet": "Ông ta suy sụp tinh thần kể từ sau khi thất bại trong kinh doanh.", "eng": "He was a broken man after the failure of his business."}, {"viet": "Anh ta bị đánh lừa đưa cho cô ấy một khoản tiền lớn.", "eng": "He was beguiled into giving her large sums Of money."}, {"viet": "Ông ta quyết tâm trở thành tổng thống của đất nước.", "eng": "He was destined to become the President of the country."}, {"viet": "Anh ta rất đau khổ khi cô ta bỏ đi.", "eng": "He was heart-broken when she left."}, {"viet": "Ông ta có đường lối vừa cứng rắn vừa mềm dẻo.", "eng": "He was on a power trip."}, {"viet": "Anh ta bị tù khổ sai 12 năm.", "eng": "He was sentenced to 12 year's penal servitude."}, {"viet": "Trông bề ngoài anh ta như chết rồi.", "eng": "He was to all outward appearances dead."}, {"viet": "Ông ta đi câu và đã câu được một con lớn.", "eng": "He went fishing and caught a big un."}, {"viet": "Anh ta được giải thưởng vì âm thanh, ánh sáng của anh ta tạo ra trong phim.", "eng": "He won an award for the special effects he did for this film."}, {"viet": "Nguyên tắc của tôi là giữ cho thân thể khoẻ mạnh và tinh thần minh mẫn.", "eng": "Health of body and mind is my gospel."}, {"viet": "Vẻ thờ ơ bên ngoài của cô ta đã làm hắn càng lo lắng hơn.", "eng": "Her apparent indifference made him even more nervous."}, {"viet": "Cô ta tự nhận là nhà báo chẳng qua chỉ là cái mẹo để vào được rạp hát không phải trả tiền.", "eng": "Her claim to be a journalist was simply a subterfuge to get into the theatre without paying."}, {"viet": "Những cuộc phiêu lưu đầy hấp dẫn của cô ấy ở Himalaya.", "eng": "Her exciting adventures in the Himalayas."}, {"viet": "Mái tóc của cô ta nhiều tĩnh điện.", "eng": "Her hair was full of static."}, {"viet": "Việc cô ta thiếu kinh nghiệm là một khiếm khuyết nghiêm trọng.", "eng": "Her lack of experience is a severe disability."}, {"viet": "Cuốn phim mới của cô ta rất thành công.", "eng": "Her new film is quite a hit."}, {"viet": "Văn xuôi của bà ta lạm dụng ngôn ngữ tới tột độ.", "eng": "Her prose strains language to the limits."}, {"viet": "Bài phát biểu của bà ta vẫn tiếp tục bằng cùng một giọng buồn bã đó.", "eng": "Her speech continued in the same dismal strain."}, {"viet": "Sự giàu có của cô ta đã giúp cô ta có được ảnh hưởng rất lớn ở mọi giới trong xã hội.", "eng": "Her wealth gives her enormous leverage in social circles."}, {"viet": "Này, anh có bao giờ nghe nói về đảo Thái tử Edward chưa?", "eng": "Hey, have you ever heard of Prince Edward Island?"}, {"viet": "Quần kiểu cách của anh ta trông lạc lõng ở trong văn phòng.", "eng": "His arty clothes look out of place in the office."}, {"viet": "Tên tuổi của ông ta không một vết nhơ.", "eng": "His character is without a blemish."}, {"viet": "Lòng tận tuỵ với chó của anh ta giống một cái gì rất lố bịch.", "eng": "His devotion to his dog borders on the ridiculous."}, {"viet": "Sự thất bại của anh ta phần lớn là do thiếu tự tin.", "eng": "His failure is in great measure due to lack of confidence."}, {"viet": "Cách xử lý tình huống của anh ấy thật đáng khâm phục.", "eng": "His handling of the situation was admirable."}, {"viet": "Cách ăn nói của anh ta không là không nhượng bộ: anh ta bảo họ phải cải tiến công việc nếu không họ sẽ bị sa thải.", "eng": "His language was uncompromising: he told them their work must improve or they would be fired."}, {"viet": "Mẹ anh ta lo là bọn trẻ lớn tuổi sẽ dẫn con mình tới chỗ lầm lạc.", "eng": "His mother worries that the older boys will lead him astray."}, {"viet": "Bức họa của ông ấy về những con bò đã thắng giải.", "eng": "His picture of cows won a prize."}, {"viet": "Súng của anh ấy nổ tách một cái và con nai ngã ra chết.", "eng": "His rifle cracked and the deer fell dead."}, {"viet": "Phong cách của ông ta gợi lại phong cách của Picasso.", "eng": "His style is reminiscent of Picasso's."}, {"viet": "Cái chết của vợ anh ta đã làm cho anh ta yếu đuối và chán nản.", "eng": "His wife's death left him feeling vulnerable and depressed."}, {"viet": "Tổ chức một cuộc điều tra nội bộ để tìm xem ai là kẻ chịu trách nhiệm.", "eng": "Holding an internal inquiry to find out who is responsible."}, {"viet": "Các bà nội trợ thường mềm lòng với những món quà miễn phí trước khi người bán hàng đề cập thẳng vấn đề.", "eng": "Housewives were softened up with free gifts before the salesman began the hard talking."}, {"viet": "Làm sao anh có thể đứng yên để cho anh ta đối xử với con chó của anh ta như thế?", "eng": "How can you stand by and let him treat his dog like that?"}, {"viet": "Hân hạnh được biết cô, cô Lưu.", "eng": "How do you do, Miss Liu."}, {"viet": "Bạn đã ở lại đó bao lâu?", "eng": "How long did you stay there?"}, {"viet": "Bạn bắt được bao nhiêu cá?", "eng": "How many fish did you catch?"}, {"viet": "Anh đã đóng góp bao nhiêu cho quỹ cứu nạn?", "eng": "How much did you subscribe to the disaster fund?"}, {"viet": "Ông xã chị hồi này ra sao?", "eng": "How's your old man these days?"}, {"viet": "Mặc quần của con nhanh lên.", "eng": "Hurry up and put on your own."}, {"viet": "Tôi muốn gửi một ít tiền vào cất ở két sắt.", "eng": "I'd like to put some of my money in safekeeping."}, {"viet": "Tôi sẽ bàn lại chuyện đó với cô ấy khi cô ấy bình tĩnh lại một chút.", "eng": "I'll discuss it with her again when she's cooled down a bit."}, {"viet": "Tôi cần có đèn chớp để chụp cảnh này, ánh sáng không đủ lắm.", "eng": "I'll need flash for this shot, the light isn't good enough."}, {"viet": "Khi phải tiếp xúc với người bệnh thì tôi nhát kinh khủng.", "eng": "I'm a terrible coward when it comes to dealing with sick people."}, {"viet": "Tôi không hài lòng với thái độ của anh chút nào.", "eng": "I'm far from pleased with your behaviour."}, {"viet": "Thứ bảy tới tôi sẽ có một buổi tiệc, ghi nó vào sổ tay của cô để khỏi quên nhé.", "eng": "I'm having a party next Saturday, put it down in your diary so you don't forget."}, {"viet": "Tôi chẳng phải là một nhà làm vườn gì, mặc dù tôi cũng có trồng một ít rau.", "eng": "I'm not much of a gardener although I grow a few vegetables."}, {"viet": "Tôi xin lỗi, hiện giờ nhà hàng khá đông.", "eng": "I'm sorry, it's rather busy at the moment."}, {"viet": "Tôi đang tính chuyện đổi chiếc xe ô-tô của tôi lấy chiếc lớn hơn.", "eng": "I'm thinking of changing my car for a bigger one."}, {"viet": "Tôi sục sạo khắp thành phố cả buổi sáng để tìm một món quà tặng cô ấy.", "eng": "I've been chasing around town all morning looking for a present for her."}, {"viet": "Tôi đã tìm kỹ tất cả các túi nhưng không thấy chìa khoá đâu cả.", "eng": "I've gone through all my pockets but I can't find my keys."}, {"viet": "Tôi bị mất một chiếc khuyên tai Đó cũng lại là một chiếc đắt tiền.", "eng": "I've lost an ear-ring It was an expensive one too."}, {"viet": "Lúc nào tôi cũng tin cậy ở anh, thế mà bây giờ anh lại bỏ rơi tôi.", "eng": "I've trusted you all along the line and now you've let me down."}, {"viet": "Tôi thường xuyên đọc mục của cô ấy trên tờ báo địa phương.", "eng": "I always read her column in the local paper."}, {"viet": "Tôi rất tiếc, nhưng ngân hàng không chấp nhận chi phiếu 9000 đô la của các ông để thanh toán khoản nợ.", "eng": "I am sorry, but the bank did not accept your cheque of $ 9,000 in settlement of your account."}, {"viet": "Được ông mời nên chiều nay tôi đến.", "eng": "I avail myself of your invitation and come this evening."}, {"viet": "Tôi tình cờ gặp lại anh bạn học cũ trên đường Oxford sáng nay.", "eng": "I came across an old school friend in Oxford Street this morning."}, {"viet": "Tôi không thể để cho hành động tử tế này bị bỏ qua được.", "eng": "I can't let this act of kindness go unnoticed."}, {"viet": "Tôi có thể mặc quần áo như thế nào tuỳ tôi khi ở trong nhà mình!", "eng": "I can dress how I like in my own house!"}, {"viet": "Tôi không thể chịu được con người đó.", "eng": "I can't abide that man."}, {"viet": "Tôi đã ngỏ lời khen ngợi cô ta về diễn xuất đầy tài năng của cô.", "eng": "I complimented her on her skilful performance."}, {"viet": "Tôi rủa cô nàng vì đã làm hỏng kế hoạch của tôi.", "eng": "I cursed her for spoiling my plans."}, {"viet": "Tôi phát hiện một cánh buồm ở tận chân trời.", "eng": "I descry a sail on the horizon."}, {"viet": "Tôi không thích anh huýt gió.", "eng": "I dislike it when you whistle."}, {"viet": "Tôi không biết anh ta có chuyện gì, suốt cả ngày anh ta cứ lục lọi lung tung.", "eng": "I don't know what's the matter with him, he is just scrounging around all day long."}, {"viet": "Tôi không nghĩ rằng tôi có thể chịu thêm được nữa sự mè nheo của cô.", "eng": "I don't think I can take much more of your nagging."}, {"viet": "Em không cần mấy cái quần áo cũ của anh để lại đâu.", "eng": "I don't want your old hand-me-downs!"}, {"viet": "Tôi không cần đồng tiền ghê tởm của anh.", "eng": "I don't want your stinking money."}, {"viet": "Tôi cảm thấy ốm quá, đáng lẽ tôi không nên uống nhiều như thế!", "eng": "I feel ghastly, I shouldn't have drunk so much!"}, {"viet": "Tôi thấy cách xử sự vô trách nhiệm của hắn không thể tin nổi.", "eng": "I find his irresponsible behaviour beyond belief."}, {"viet": "Tôi quá thất vọng về cuộc đời, công việc là lối thoát của tôi.", "eng": "I get so depressed about life, work is my salvation."}, {"viet": "Tôi cãi cọ một chút với người thu ngân.", "eng": "I had a bit of a carry-on with the cashier."}, {"viet": "Hôm nay tôi phải đi hàn hai cái răng ở phòng nha sĩ.", "eng": "I had to have two fillings at the dentist's today."}, {"viet": "Tôi hoàn toàn tin tưởng vào tài năng của các bác sĩ.", "eng": "I have absolute trust in the skill of doctors."}, {"viet": "Tôi không có điều gì phản đối về nguyên tắc đạo đức đối với điều đó.", "eng": "I have no principled objection to it."}, {"viet": "Tôi có hai chị gái, cả hai đều sống ở Hà Nội.", "eng": "I have two sisters, both live in Ha Noi."}, {"viet": "Tôi nghe nói bóng rổ rất được ưa chuộng ở Úc.", "eng": "I hear that basketball is very popular in Australia."}, {"viet": "Tôi hy vọng rằng đồng tiền được kiếm ra một cách lương thiện.", "eng": "I hope that money was honestly come by."}, {"viet": "Tôi rất cần một ít tiền Trung Quốc.", "eng": "I just badly want some Chinese money."}, {"viet": "Tôi biết Ngân Hàng nhân Dân Trung Quốc là ngân hàng trung ương Trung Quốc và hầu hết tất cả ngân hàng của các anh đều là ngân hàng sở hữu nhà nước.", "eng": "I know that the People's Bank of China is the central bank of China and almost all your banks are state-owned ones."}, {"viet": "Tôi thích núi, sông, rừng.", "eng": "I like the mountains, the river, the forest."}, {"viet": "Tôi sẽ đến vào tối mai.", "eng": "I'll come round tomorrow evening."}, {"viet": "Em sẽ khâu nó cho anh.", "eng": "I'll sew it for you."}, {"viet": "Tôi cũng tính tìm một cô vợ.", "eng": "I'm also looking for a wife."}, {"viet": "Tôi phỏng vấn suốt cả buổi chiều nay.", "eng": "I'm interviewing all this afternoon."}, {"viet": "Rất tiếc, chúng tôi không có thứ đó.", "eng": "I'm sorry, we don't keep them."}, {"viet": "Tôi có thể đặt một cuộc làm ăn nào đó theo cách của anh.", "eng": "I may be able to put some business your way."}, {"viet": "Tôi phải gửi bức thư này đi rất khẩn.", "eng": "I must post this letter-It's very urgent."}, {"viet": "Tôi chẳng bao giờ tiếp thu được gì nhiều từ những bài thuyết trình của ông ta.", "eng": "I never get much from his lectures."}, {"viet": "Tôi đi ngang qua nhà thờ trên đường đi làm.", "eng": "I pass the church on my way to work."}, {"viet": "Tôi gọi điện cho tắc xi và chỉ một lúc sau, nó đã đến.", "eng": "I rang for a taxi and it arrived soon after."}, {"viet": "Tôi ngờ vực hành vi của anh ta.", "eng": "I regard his behaviour with suspicious."}, {"viet": "Mùa hè vừa rồi đã có lần tôi gặp anh ta.", "eng": "I saw him sometime last summer."}, {"viet": "Tôi sẽ phải báo cáo tình hình đó với nhà đương cục.", "eng": "I shall have to report this to the authorities."}, {"viet": "Tôi đã bỏ ra nhiều thời gian để đi tham quan.", "eng": "I spent most of my time in sightseeing."}, {"viet": "Tôi thông cảm với anh, bản thân tôi cũng có một kinh nghiệm đau khổ tương tự.", "eng": "I sympathize with you, I've had a similar unhappy experience myself."}, {"viet": "Tôi nghĩ tốt hơn nên ngồi cạnh cửa sổ, như vậy chúng tôi có thể thưởng thức những ánh đèn đêm.", "eng": "I think it's better to sit by the window so that we can enjoy the evening lights."}, {"viet": "Tôi nghĩ ông đã gọi nhầm số.", "eng": "I think you have the wrong number."}, {"viet": "Tôi mang theo sách đọc giải trí trong chuyến hành trình trên xe lửa.", "eng": "I took some light reading for the train journey."}, {"viet": "Tôi dùng một ít đường khi làm bánh ở nhà.", "eng": "I use a little sugar in mine at home."}, {"viet": "Tôi muốn tất cả các anh ra khỏi nhà tôi.", "eng": "I want the lot of you to get out of my house."}, {"viet": "Tôi muốn anh xuất phát khi tôi đếm đến 5.", "eng": "I want you to start on a count of 5."}, {"viet": "Tôi hy vọng nhận được một món quà của cô ta cho nên tôi rất thất vọng khi không nhận được gì cả.", "eng": "I was expecting a present from her, so I was disappointed I didn't receive one."}, {"viet": "Tôi bị chọn ra để báo tin buồn đó.", "eng": "I was picked on to announce the bad news."}, {"viet": "Mãi đến lúc này tôi mới biết là có sự hiện hữu của hắn.", "eng": "I was unaware of his existence until now."}, {"viet": "Tôi sẽ dùng cà phê sau đó.", "eng": "I will have some coffee later, please."}, {"viet": "Tôi sẽ không đi cho đến khi nào tôi chuẩn bị xong xuôi hết thảy.", "eng": "I won't go until I'm good and ready."}, {"viet": "Tôi tha thiết mong trở lại Scốt-len.", "eng": "I would dearly love to go back to Scotland."}, {"viet": "Tôi muốn thử đôi giày này.", "eng": "I would like to try this pair of shoes on."}, {"viet": "Thành ngữ thường không thể dịch một cách chính xác qua một ngôn ngữ khác.", "eng": "Idioms usually cannot be translated literally in another language."}, {"viet": "Nếu tôi bắt được người nào làm việc này, tôi sẽ vặn cổ nó!", "eng": "If I find the person who did this, I'll wring his neck!"}, {"viet": "Nếu đúng vậy thì tại sao bạn không vào trong một mình đi?", "eng": "If that's true, then why don't you go inside by yourself?"}, {"viet": "Nếu chúng ta không bán được thêm hàng, chúng ta sẽ phải cắt giảm sản xuất.", "eng": "If we don't sell more goods, we'll have to cut back on production."}, {"viet": "Nếu anh cộng tác, chúng tôi sẽ thả anh, người cảnh sát nói.", "eng": "If you co-operate we'll let you go, said the policeman."}, {"viet": "Nếu có thời gian, quý khách có thể tham quan các Hồ Đồng của Bắc Kinh.", "eng": "If you have time, you can visit Beijing's Hutongs."}, {"viet": "Nếu anh muốn một thầy giáo dạy nhạc giỏi thì ông ấy là người anh đang cần.", "eng": "If you want a good music teacher, he's your man."}, {"viet": "Trong một cuộc khủng hoảng, những thành kiến cũ biến mất và mọi người cùng nhau làm việc.", "eng": "In a crisis, old prejudices fall away and everyone works together."}, {"viet": "Trong luật pháp nước Anh, một bị cáo được coi như là vô tội cho đến khi chứng minh được anh ta là phạm tội.", "eng": "In English law, an accused man is presumed innocent until he is proved guilty."}, {"viet": "Theo sự đánh giá của tôi, ông ta là ứng cử viên phù hợp hơn.", "eng": "In my estimation, he's the more suitable candidate."}, {"viet": "Trong việc làm chủ tiếng Anh, nó vô địch.", "eng": "In the command of English, he stands alone."}, {"viet": "Trong từ'today'trọng âm đặt vào âm tiết thứ hai.", "eng": "In the word'today'the accent is on the second syllable."}, {"viet": "Lạm phát là điều lo lắng chính của chính phủ.", "eng": "Inflation is the Government's main bugbear."}, {"viet": "Nó có khác so với bóng đá chơi ở châu Âu hay Trung Quốc không?", "eng": "Is it different from the football played in Europe or China?"}, {"viet": "Ở bàn anh còn chỗ trống nào cho tôi không?", "eng": "Is there a space for me at your table?"}, {"viet": "Đôi khi bóng đá chẳng gọi là football đó sao?", "eng": "Isn't soccer called football sometimes?"}, {"viet": "Việc hát'Auld Lang Syne'vào đêm giao thừa là một truyền thống.", "eng": "It's a tradition to sing'Auld Lang Syne'on New Year's Eve."}, {"viet": "Thật khó phân xử đôi bên.", "eng": "It's difficult to decide between the two."}, {"viet": "Đó là một công việc thú vị nhưng tiền lương không tốt.", "eng": "It's interesting work but the pay isn't very good."}, {"viet": "Trời không còn mưa to nữa, nhưng vẫn mưa lâm thâm đôi chút.", "eng": "It's not raining heavily any more, but it's still spitting a bit."}, {"viet": "Đó là sự pha trộn của ông nội, cháu trai, chắt như vậy đấy.", "eng": "It's such a mixture of grandfathers, grandsons, great-grandsons."}, {"viet": "Báo chí đã hành động sai trái khi đăng bài công kích Nữ hoàng mà cương vị Nữ hoàng lại không cho phép bà tự biện hộ.", "eng": "It's wrong of the press to publish articles attacking the Queen when she can't answer back."}, {"viet": "Mẹ rất buồn khi nghe tin con đã không chịu vâng lời.", "eng": "It grieves me to hear how disobedient you've been."}, {"viet": "Vui đấy, nếu họ không biết về điều đó.", "eng": "It is fun, if they don't know about it."}, {"viet": "Khi lái xe thắt dây an toàn là an toàn hơn, tuy nhiên nhiều người lại không thắt.", "eng": "It is safe to wear seat belts when driving, nevertheless, many people do not wear them."}, {"viet": "Có thể phải mất vài tuần lễ đơn của anh mới được giải quyết.", "eng": "It may take a few weeks for your application to be processed."}, {"viet": "Giống như xương trong cơ thể anh vậy.", "eng": "It's like the bones in your body."}, {"viet": "Xem ra rất có thể là nó sẽ tới trước khi trời tối.", "eng": "It seems probable that he will arrive before dusk."}, {"viet": "Đó là một vụ đâm xe nặng nhưng không ai tử vong.", "eng": "It was a bad crash, but there were no fatality."}, {"viet": "Người ta đã tìm thấy nó đúng nơi mà cô ta đã bỏ quên.", "eng": "It was found at the precise spot where she had left it."}, {"viet": "Nó đã bị đánh cắp ở phòng khách sạn.", "eng": "It was stolen from my hotel room."}, {"viet": "Bỏ lỡ mất phim chính thì thật là đáng tiếc.", "eng": "It would be a pity to miss the main film."}, {"viet": "Nghe nói người Nhật rành chuyện đó lắm mà.", "eng": "Japanese are good at that, I've heard."}, {"viet": "Các phóng viên tới tấp hỏi đối với ông bộ trưởng.", "eng": "Journalists shooting questions at the minister."}, {"viet": "Vua Lia trong một vở kịch mới gây nhiều tranh luận.", "eng": "King Lear in a controversial new production."}, {"viet": "Đừng tặng bàn thắng nào của chúng ta cho đối phương.", "eng": "Let's not make our opponents a present of any goals."}, {"viet": "Cuộc sống ở ngoại ô có thể khá tẻ nhạt.", "eng": "Life in the suburbs can be pretty pedestrian."}, {"viet": "Nhiều ngôi nhà cũ rộng lớn nay đã chuyển thành những căn hộ.", "eng": "Many large old houses have now been converted into flats."}, {"viet": "Những ngày phiên chợ ở Southall là vào thứ tư và thứ bảy.", "eng": "Market days in Southall are Wednesday and Saturday."}, {"viet": "Thưa ông, xin ông cho biết họ của ông ạ?", "eng": "May I have your surname, sir?"}, {"viet": "Gia đình của Melissa's muốn tổ chức tiệc cưới tại nhà họ, nhưng ông cố Jack cố nài cho được.", "eng": "Melissa's family wanted to have the reception at their house, but great-grandpa Jack insisted."}, {"viet": "Phần lớn các giáo sư trở nên thoải mái hơn khi ở bên ngoài giảng đường.", "eng": "Most professors unbend outside the lecture theatre."}, {"viet": "Địa chỉ của tôi là số 22 ngõ cụt Laburnum, vậy số nhà của ông ấy phải là số 26.", "eng": "My address is No 22 Laburnum Close so his must be No 26."}, {"viet": "Mắt tôi tình cờ nhìn thấy một cuốn sách cũ bụi bặm sau lưng giá sách.", "eng": "My eye alighted on a dusty old book at the back of the shelf."}, {"viet": "Chân tôi vẫn còn đau khi chạm vào chỗ bị thâm tím.", "eng": "My leg is still very tender where it was bruised."}, {"viet": "Em gái tôi rất khoẻ-nó có thể bơi 5 dặm.", "eng": "My sister's very strong-she can swim 5 miles."}, {"viet": "Các nhà thương lượng đang tìm kiếm một cách giải quyết hoà bình cho cuộc tranh chấp này.", "eng": "Negotiators are looking for a peaceful settlement to the dispute."}, {"viet": "Không, trái lại là chưa bao giờ đời của tôi lại khốn khổ như thế này.", "eng": "No, far from it, I've never been so miserable in my life."}, {"viet": "Cho dù anh viện lý do gì đi nữa, tôi cũng không muốn nghe nó đâu.", "eng": "No matter what your excuse is, I don't want to hear it."}, {"viet": "Bây giờ đây là tờ đơn xin chính thức để đòi hoàn lại tiền cho ngân phiếu du lịch bị mất.", "eng": "Now here's the official application form for claiming refund for lost traveler's cheques."}, {"viet": "Được, Mary ạ-cô không phiền nếu tôi gọi cô bằng tên chứ?", "eng": "Of course, Mary-you don't mind my calling you by your first name, do you?"}, {"viet": "Vâng, một nhân viên giặt ủi sẽ đến phòng của ông trong vài phút nữa,.", "eng": "OK, a laundryman will be in your room in a few minutes."}, {"viet": "Dựa vào cơ sở nào mà ông đưa ra lời buộc tội ấy?", "eng": "On what grounds do you make that accusation?"}, {"viet": "Một trong những nhiếp ảnh gia ưu tú nhất thế giới.", "eng": "One of the best photographers in the world."}, {"viet": "Giờ làm việc của chúng tôi là vì sự tiện lợi của khách hàng.", "eng": "Our business hours are for the customers'convenience."}, {"viet": "Chủ nhà của chúng tôi làm cho chúng tôi vui.", "eng": "Our host pleasured us with his company."}, {"viet": "Cái gọi là biệt thự bên bờ biển của chúng tôi chỉ là một căn nhà gỗ nhỏ một tầng cách bờ biển hai dặm.", "eng": "Our so-called villa by the sea was a small bungalow two miles from the coast."}, {"viet": "Mặt nạ oxy ở trên máy bay chỉ được dùng lúc khẩn cấp.", "eng": "Oxygen masks are used in aircraft only in emergencies."}, {"viet": "Người ta không được phép lấy nhau trong một phạm vi huyết tộc nào đó.", "eng": "People are not allowed to marry within certain degrees of consanguinity."}, {"viet": "Peter mắc nhiều lỗi nhất lớp.", "eng": "Peter made the most mistakes of all the class."}, {"viet": "Chính trị trước một cuộc tuyển cử có thể là chuyện hoàn toàn vô nghĩa.", "eng": "Politics before an election can be quite a fandango."}, {"viet": "Samuel Pepys là người ghi nhật kí Anh nổi tiếng của thế kỉ 17.", "eng": "Samuel Pepys was a famous English diarist of the 17th century."}, {"viet": "Nhiều năm lập kế hoạch đã được đưa vào sử dụng để biến nó thành một trong những toài nhà đẹp nhất thành phố.", "eng": "Several years'planning went into making it one of the finest in the city."}, {"viet": "Cô ta là người có hy vọng đoạt giải cho đội Anh.", "eng": "She's a good prospect for the British team."}, {"viet": "Cô ta đã làm việc liên tục ở một ngân hàng từ khi thôi học.", "eng": "She's been working in a bank since leaving school."}, {"viet": "Cô ta vừa học xong khóa học ở trường dạy nấu ăn.", "eng": "She's just graduated from the School of Cookery."}, {"viet": "Cô ấy đã tự đặt một nhiệm vụ khó khăn cho mình.", "eng": "She's set a difficult task for herself."}, {"viet": "Cô ấy đã đạt được một số thành công với quyển sách đầu tay của mình.", "eng": "She achieved a measure of success with her first book."}, {"viet": "Cô ta trở thành trọng tài tối cao của mốt quần áo tắm biển.", "eng": "She became the supreme arbiter of fashion in beach wear."}, {"viet": "Cô ta ngã phịch xuống sàn nhà nằm một đống.", "eng": "She collapsed on the floor in a heap."}, {"viet": "Cô ta vui thích giữa đám đông hâm mộ.", "eng": "She delights to be surrounded by admirers."}, {"viet": "Cô ấy đánh rơi kính và làm vỡ nó.", "eng": "She dropped her glasses and broke them."}, {"viet": "Cô ta bồn chồn đi tất tả từ phòng này sang phòng nọ.", "eng": "She fluttered nervously about, going from room to room."}, {"viet": "Bà ấy đã giúp cho tất cả học sinh của bà đỗ được tiếng Pháp trình độ A.", "eng": "She got all her pupils through French'A'Level."}, {"viet": "Cô ta có sáng kiến bắt đầu công việc của mình.", "eng": "She had the gumption to start her own business."}, {"viet": "Cô ta có công ty tư vấn riêng của cô ta.", "eng": "She has her own consulting business."}, {"viet": "Cô ta tưởng tượng mình đi vào văn phòng và nói cho mọi người biết mình nghĩ gì về họ.", "eng": "She imagined walking into the office and telling everyone what she thought of them."}, {"viet": "Cô ấy ít khi nhân nhượng trong một vấn đề như vậy.", "eng": "She is rarely yielding on such an issue."}, {"viet": "Cô ta đặt bức ảnh lên bàn, phía mặt úp xuống.", "eng": "She laid the picture face downward on the table."}, {"viet": "Cô ta mặc bộ quần áo này trông hơi đàn ông.", "eng": "She looks rather masculine in that suit."}, {"viet": "Cô ta lẽ ra không cần phải đích thân đến-viết thư là được rồi.", "eng": "She needn't have come in person-a letter would have been enough."}, {"viet": "Cô ta đóng vai trò một người nâng đỡ cho đội khi tình hình trở nên tệ hại.", "eng": "She played a sheet anchor role for the team when things were going badly."}, {"viet": "Cô ấy nhận tin với một tiếng thở dài thất vọng.", "eng": "She received the news with a despairing sigh."}, {"viet": "Cô ta đang ở tột đỉnh của sự nghiệp của cô ta.", "eng": "She's at the peak of her career."}, {"viet": "Cô ta ở quanh quẩn đâu đây.", "eng": "She's somewhere about the place."}, {"viet": "Cô ấy dường như bằng lòng với cuộc sống của mình làm món đồ chơi cho một người đàn ông giàu có.", "eng": "She seemed content with her life as a rich man's plaything."}, {"viet": "Cô ta trượt chân ngã ( trên băng ) và gẫy chân.", "eng": "She slipped ( on the ice ) and broke her leg."}, {"viet": "Cô ấy đi khỏi con đường chính và bị lạc.", "eng": "She strayed from the road and got lost."}, {"viet": "Cô ta ném một hòn đá xuống ao và nhìn những gợn sóng lan ra.", "eng": "She threw a stone into the pond and watched the ripples spread."}, {"viet": "Cô ấy tháo dây thừng ra và thả con thuyền lênh đênh.", "eng": "She untied the rope and set the boat adrift."}, {"viet": "Bà ấy là một thành viên phái tả hăng hái trong đảng.", "eng": "She was active as a left-winger in the party."}, {"viet": "Bà ấy đau buồn trước cái chết của chồng.", "eng": "She was desolated by the death of her husband."}, {"viet": "Cô ta đang lập mưu với cô em gái để chống lại mẹ của cô ta.", "eng": "She was intriguing with her sister against his mother."}, {"viet": "Cô ấy được đón tiếp bằng tràng pháo tay nồng nhiệt.", "eng": "She was received with warm applause."}, {"viet": "Cô ta bị lừa vào một cuộc hôn nhân bất hạnh.", "eng": "She was trapped into an unhappy marriage."}, {"viet": "Cô ta ôn lại cẩn thận lời của vai mình đóng trước đêm đầu tiên của vở diễn.", "eng": "She went over her lines before the first night of the play."}, {"viet": "Cô ấy đã gắn một bông hoa lan duy nhất trên chiếc áo dạ hội của mình.", "eng": "She wore single orchid on her evening dress."}, {"viet": "Bắt tay trong lúc cầm lắc la lắc lư một chiếc bánh quy và một tách trà.", "eng": "Shook hands while juggling a cookie and a teacup."}, {"viet": "Ra dấu hướng nào mình sắp rẽ.", "eng": "Signal which way one is going to turn."}, {"viet": "Sáu tình nghi đang bị giữ theo Đạo luật Ngăn ngừa Khủng bố.", "eng": "Six suspects are being held under the Prevention of Terrorism Act."}, {"viet": "Hút thuốc có thể làm hại sức khoẻ của bạn.", "eng": "Smoking can be damaging to your health."}, {"viet": "Vậy chúng ta chưa bỏ lỡ chỗ nào hào hứng cả.", "eng": "So we haven't missed anything exciting yet."}, {"viet": "Một ngày nào đó anh ấy sẽ làm vua.", "eng": "Some day he will be a king."}, {"viet": "Có vài người không làm phần việc của họ.", "eng": "Some people are not doing their whack."}, {"viet": "Một ngày nào đó, anh ta sẽ cưỡi một con bạch mã đến rước tôi đi.", "eng": "Someday he'll come riding on a white horse to take me away."}, {"viet": "Sắp xếp lại hết một đống ảnh cũ.", "eng": "Sort through a pile of old photographs."}, {"viet": "Moi thêm nhiều tiền của người đóng thuế.", "eng": "Squeeze more money out of the taxpayer."}, {"viet": "Cứ liên lạc với tôi và anh sẽ được yên ổn.", "eng": "Stick with me and you'll be all right."}, {"viet": "Kéo căng những tấm khăn trải giường trên giường.", "eng": "Strained the sheets over the bed."}, {"viet": "Một hành động như vậy có thể chứng minh là đúng trên cơ sở hiệu quả lớn hơn.", "eng": "Such action can be justified on the grounds of greater efficiency."}, {"viet": "Chủ nhật là ngày đầu trong tuần.", "eng": "Sunday is the first day of the week."}, {"viet": "Thụy Sĩ nằm giữa Pháp, Đức, Áo và Ý.", "eng": "Switzerland lies between France, Germany, Austria and Italy."}, {"viet": "Đừng có cầm nhầm chiếc rađiô của tôi!", "eng": "Take your thieving hands off my radio!"}, {"viet": "Cho tôi biết anh nghĩ gì-sao anh cứ ngậm tăm thế?", "eng": "Tell me what you think-have you lost your tongue?"}, {"viet": "Cần phải cảm ơn tất cả những người đã giúp đỡ.", "eng": "Thanks are due to all those who helped."}, {"viet": "Chuyến đi xe đạp đó làm tôi mệt lử cò bợ.", "eng": "That bike ride absolutely finished me off."}, {"viet": "Sáng kiến đó không thành, như vậy là điều đó lại trở về con số không.", "eng": "That idea hasn't worked, so it's back to square one."}, {"viet": "Đêm đó chúng tôi chè chén tới tận sáng.", "eng": "That night we partied until dawn."}, {"viet": "Tông màu vàng đó thật chói.", "eng": "That shade of yellow is loud."}, {"viet": "Thế là tôi không được nhiều thì giờ ngoạn cảnh, phải không?", "eng": "That wouldn't give me much time for sightseeing, would it?"}, {"viet": "Bị cáo được xét thấy là vô tội và được tha.", "eng": "The accused man was found not guilty and discharged."}, {"viet": "Máy bay rơi và bùng cháy.", "eng": "The aircraft crashed and burst into flames."}, {"viet": "Lượng mưa hàng năm của vùng.", "eng": "The annual precipitation of the region."}, {"viet": "Quân đội diễn tập trong sa mạc.", "eng": "The army is on manoeuvres in the desert."}, {"viet": "Cử tọa được mời đặt câu hỏi với diễn giả.", "eng": "The audience are now invited to put questions to the speaker."}, {"viet": "Em bé vạch nguệch ngoạc trên mặt bàn.", "eng": "The baby scrawled on the table-top."}, {"viet": "Ngân hàng của Anh tác động để làm ổn định đồng bảng.", "eng": "The Bank of England intervened to stabilize the pound."}, {"viet": "Giọng hát hay của cô ấy làm chúng tôi mê mẩn.", "eng": "The beauty of her singing enraptured us."}, {"viet": "Con chim khoét thủng một lỗ trên băng bằng mỏ của nó.", "eng": "The bird picked a hole in the ice with its beak."}, {"viet": "Có thể trông thấy cái xác chết dưới mặt hồ.", "eng": "The body was visible below the surface of the lake."}, {"viet": "Vụ rắc rối ở biên giới đã dẫn đến cuộc chiến tranh giữa hai nước.", "eng": "The border incident led to war between the two countries."}, {"viet": "Não có một chức năng rất quan trọng, nó kiểm soát hệ thống thần kinh của cơ thể.", "eng": "The brain performs a very important function, it controls the nervous system of the body."}, {"viet": "Toà nhà này đủ chỗ cho 2000 người, nhưng thiết kế kém.", "eng": "The building seats 2000 people, but is of poor design."}, {"viet": "Kết quả của cuộc bầu cử bổ sung được coi như là một nhận định về toàn thể chính phủ.", "eng": "The by-election result is seen as a verdict on the whole government."}, {"viet": "Chiếc ôtô đó có một cái lốp không an toàn.", "eng": "The car has a suspect tire."}, {"viet": "Khi mắc lại dây điện cho ngôi nhà, người ta đã phải nhấc các tấm thảm đi.", "eng": "The carpets had to be taken up when the house was rewired."}, {"viet": "Cái cần thiết chủ yếu là sự đoàn kết của nhân dân.", "eng": "The central necessity is the union of the people."}, {"viet": "Ông dược sĩ pha thuốc cho tôi.", "eng": "The chemist mixed up some medicine for me."}, {"viet": "Đứa trẻ kéo tay và lôi tôi đi với nó.", "eng": "The child tugged at my hand to make me go with her."}, {"viet": "Bọn trẻ đã quen với trường mới của chúng.", "eng": "The children have adapted to their new school."}, {"viet": "Bọn trẻ đang chơi vui vẻ ở bên ngoài trong đất cát.", "eng": "The children were outside playing happily in the dirt."}, {"viet": "Tiếng lốp cốp của giầy cao gót trên sàn đá.", "eng": "The clack of high heels on a stone floor."}, {"viet": "Người thủ quỹ câu lạc bộ chịu trách nhiệm trước câu lạc bộ về khoản tiền được giao.", "eng": "The club treasurer is held answerable to the club for the money given to him."}, {"viet": "Vị tư lệnh quyết định hoãn cuộc tấn công lớn cho đến mùa xuân.", "eng": "The commander decided to postpone the big push until the spring."}, {"viet": "Công ty đã tự đề ra những mục tiêu sản xuất nghiêm khắc trong năm nay.", "eng": "The company has set itself some stiff production goals for this year."}, {"viet": "Hội nghị đã được tổ chức rất tốt.", "eng": "The conference was organized very well."}, {"viet": "Đoàn hộ tống gặp khó khăn trên sa mạc.", "eng": "The convoy was stranded in the desert."}, {"viet": "Quốc gia kiệt quệ sau nhiều năm chiến tranh đã bắt đầu từ từ khôi phục lại.", "eng": "The country prostrated after years of war, began slowly recover."}, {"viet": "Thuỷ thủ đoàn ở trong một tình cảnh thiểu não khi họ tới được bờ.", "eng": "The crew were on a sorry plight by the time they reached shore."}, {"viet": "Căn bậc ba của 64 ( 3/64 ) là 4 ( 4 x 4 x 4 = 64 ).", "eng": "The cube root of 64 ( 3/64 ) is 4 ( 4 x 4 x 4 = 64 )."}, {"viet": "Sông Danube là một trong những con sông chính ở Châu Âu.", "eng": "The Danube is one of the principal rivers of Europe."}, {"viet": "Sự tôn sùng một hoàng đế La Mã.", "eng": "The deification of a Roman emperor."}, {"viet": "Thầy mo được đưa đến để chữa trị cho đứa trẻ người ta cho là bị quỷ ám.", "eng": "The devil dancer was brought into cure the child, suppose to be possessed of a fiend."}, {"viet": "Món này được nấu bằng lòng cừu.", "eng": "The dish was made from entrails of a sheep."}, {"viet": "Bác sĩ nói tim tôi vẫn tốt.", "eng": "The doctor says my heart is still in good nick."}, {"viet": "Con chó bới một khúc xương trong vườn.", "eng": "The dog scratched up a bone in the garden."}, {"viet": "Người tài xế thoát nạn chỉ bị thương nhẹ nhưng chiếc xe ô tô đã hoàn toàn hư hại.", "eng": "The driver escaped with minor injuries but the car was completely written off."}, {"viet": "Tuyến đường cao tốc chạy về miền đông.", "eng": "The eastbound section of the motorway."}, {"viet": "Những hậu quả vô tận của cuộc sống mua chịu.", "eng": "The endless repercussions of living on credit."}, {"viet": "Người ta vẫn không tìm ra tung tích của người tù vượt ngục.", "eng": "The escaped prisoner's whereabouts is still unknown."}, {"viet": "Cuộc thám hiểm làm cô ta cạn túi.", "eng": "The expedition was a drain on her pocket."}, {"viet": "Ngôi sao sa vạch một đường cong dài trên bầu trời.", "eng": "The falling star described a long curve in the sky."}, {"viet": "Các cột hàng rào được đóng vững chắc trên nền đất.", "eng": "The fence posts were fixed firmly in the ground."}, {"viet": "Bộ phim được công diễn lần đầu tiên tại Liên hoan phim Cannes.", "eng": "The film was premiered at the Cannes Festival."}, {"viet": "Xí nghiệp cố thoát khỏi khó khăn trong thời kỳ suy thoái.", "eng": "The firm managed to stay afloat during the recession."}, {"viet": "Thuyền đánh cá bắt đầu chuyển động với sức đẩy của đầu máy.", "eng": "The fishing boat began to move with propulsion by the motor."}, {"viet": "Cầu thủ đó bất ngờ tấn công khung thành.", "eng": "The footballer took a strike at the goal."}, {"viet": "Sương muối tuần trước là một tai hoạ lớn đối với nền công nghiệp chanh.", "eng": "The frost last week was a great calamity to the citrus industry."}, {"viet": "Nước lụt vỗ vào bức tường của khu vườn.", "eng": "The garden wall is being washed by the flood water."}, {"viet": "Những vẻ mặt đờ đẫn của những người còn sống sót.", "eng": "The glazed expressions of the survivors."}, {"viet": "Chính phủ đi ngược lại lời hứa lúc ban đầu khi tranh cử.", "eng": "The government are backpedalling on their election promises."}, {"viet": "Chính phủ chi nhiều tiền vào giáo dục.", "eng": "The government is spending a lot of money on education."}, {"viet": "Nữ kiện tướng về môn quần vợt chuyên nghiệp của phụ nữ.", "eng": "The grande dame of women's professional tennis."}, {"viet": "Đội quân danh dự chào vị tướng một cách lịch sự.", "eng": "The guard of honour saluted the general smartly."}, {"viet": "Tiếng cười nói vui vẻ của bọn trẻ con đang nô đùa.", "eng": "The happy sounds of children at play."}, {"viet": "Bậc thầy về kỹ thuật hiện đại.", "eng": "The high priest of modern technology."}, {"viet": "Bệnh viện đã được bỏ phiếu tán thành trợ cấp 100000 pao cho nghiên cứu.", "eng": "The hospital was voted 100000 pounds for research."}, {"viet": "Ngôi nhà tọa lạc trong một cánh đồng cỏ nhấp nhô rộng 50 mẫu Anh.", "eng": "The house is set in fifty acres of rolling parkland."}, {"viet": "Ý tưởng về cây thông Giáng Sinh bắt nguồn từ nước Đức.", "eng": "The idea of Christmas trees came from Germany."}, {"viet": "Toán tuần tiễu bộ binh đã rời khỏi lúc tảng sáng.", "eng": "The infantry patrol pushed off before dawn."}, {"viet": "Người phỏng vấn đã dồn cô vào thế bí.", "eng": "The interviewer has driven her into the corner."}, {"viet": "Sông Jordan chảy vào Biển Chết.", "eng": "The Jordan River brings water to the Dead Sea."}, {"viet": "Tên bắt cóc doạ sẽ cưa chân tay đứa bé nếu tiền chuộc không được nộp sớm.", "eng": "The kidnapper threatened to mutilate the child if his price was not paid soon."}, {"viet": "Đường hẻm đó lằn các vết lốp xe.", "eng": "The lane was rutted with tire tracks."}, {"viet": "Nhà lãnh đạo phải là một người có quyền lực.", "eng": "The leader must be a person of authority."}, {"viet": "Xuồng cứu đắm đã được ném ngay xuống để cứu bốn người.", "eng": "The lifeboat was launched immediately to rescue the four men."}, {"viet": "Thị trường chứng khoán Luân Đôn hôm nay rối ren cả lên.", "eng": "The London Stock Exchange is in turmoil today."}, {"viet": "Việc tờ tạp chí để lộ các bí mật quốc phòng.", "eng": "The magazine's disclosure of defence secrets."}, {"viet": "Viên quản lý đến làm cho công nhân lao ngay vào việc.", "eng": "The manager's arrival galvanized the workers into activity."}, {"viet": "Trọng tải tối đa của xe tải này là một tấn.", "eng": "The maximum load for his lorry is one ton."}, {"viet": "Tưởng nhớ đến người mẹ đã quá cố khiến nó ứa nước mắt.", "eng": "The memory of his dead mother brought tears to his eyes."}, {"viet": "Người ta thấy ông bộ trưởng chiếm đoạt tiền của chính phủ.", "eng": "The minister war found to have appropriated government money."}, {"viet": "Mặt trăng nhô ra khỏi đám mây.", "eng": "The moon emerges from behind the clouds."}, {"viet": "Mùi bánh mì mới nướng thật hấp dẫn.", "eng": "The mouthwatering smell of freshly baked bread."}, {"viet": "Cái chắn bùn trái của xe bị hư hỏng trong vụ đâm nhau.", "eng": "The nearside wing has damaged in the collision."}, {"viet": "Luật mới sẽ có hiệu lực từ tháng sau.", "eng": "The new law comes into force next month."}, {"viet": "Hệ thống mới không chỉ rẻ hơn mà còn có thêm thuận lợi là nhanh hơn cái cũ.", "eng": "The new system is not only cheap, but has the added advantage of being much faster than the old one."}, {"viet": "Sáng hôm sau, nó khổ sở vì hậu quả khó chịu của bữa rượu.", "eng": "The next morning he was suffering from."}, {"viet": "Số người nộp đơn xin học gần đây đã giảm đi.", "eng": "The number of applicants for the course has been tapering off recently."}, {"viet": "Viên sĩ quan ra lệnh cho binh sĩ của mình ngừng bắn.", "eng": "The officer ordered his men to cease fire."}, {"viet": "Lão già lang thang đó lê bước lại gần tôi.", "eng": "The old tramp shambled up to me."}, {"viet": "Người tổ chức đã quen với các nghi lễ chính thức đối với những cuộc thăm viếng của hoàng gia.", "eng": "The organizer was familiar with the protocol of royal visits."}, {"viet": "Lâu đài đầy những đồ cổ vô giá.", "eng": "The palace is full of priceless antiques."}, {"viet": "Vỏ hình đĩa của con hà.", "eng": "The pateliform shell of the limpet."}, {"viet": "Dân chúng của các quốc gia hiện nay để dành các y phục truyền thống cho các ngày lễ.", "eng": "The people of some countries now save the customs they used to wear every day for holidays."}, {"viet": "Tài năng trình diễn của nhạc sĩ dương cầm ấy thật tuyệt vời.", "eng": "The pianist's execution of the concerto was marvelous."}, {"viet": "Sự thật rõ ràng là chúng tôi không làm nổi việc đó.", "eng": "The plain fact is that we just can't afford it."}, {"viet": "Lớp mạ đang bắt đầu bong ra ở nhiều chỗ.", "eng": "The plating is beginning to wear off in places."}, {"viet": "Mũi ghim, dao, bút chì, v. v.", "eng": "The point of a pin, knife, pencil, etc."}, {"viet": "Cảnh sát đã tìm ra manh mối, nó sẽ giúp họ bắt được tên cướp.", "eng": "The police have found a clue which will help them to catch the robber."}, {"viet": "Cảnh sát sẽ không nương tay trong cuộc chiến của họ chống lại tội ác.", "eng": "The police will not relent in their fight against crime."}, {"viet": "Khả năng có thể xảy nghĩ đến mà rùng mình.", "eng": "The possibility of war is too horrifying, to contemplate."}, {"viet": "Người phụ tá của tổng thống về cả chính sách đối nội và đối ngoại.", "eng": "The President's big enchilada on both foreign and domestic policy."}, {"viet": "Giá lên xuống khoảng từ 5 đến 6 bảng Anh.", "eng": "The price fluctuates between £ 5 and £ 6."}, {"viet": "Những lời khăng khăng phủ nhận của tù nhân về những lời buộc tội anh ta.", "eng": "The prisoner's repeated denials of the charges against him."}, {"viet": "Chức giáo sư môn động vật học đang thiếu người và đã được thông báo.", "eng": "The professorship of zoology is vacant and has been advertised."}, {"viet": "Những người phản đối tỏ ra bất chấp lệnh cấm biểu tình của chính phủ.", "eng": "The protesters showed their defiance of the official ban on demonstrations."}, {"viet": "Nữ hoàng ban tước hiệp sĩ cho một số nhân vật lỗi lạc.", "eng": "The Queen conferred knighthoods on several distinguished men."}, {"viet": "Giọt mưa đập vào cửa kính.", "eng": "The rain was beating against the window-panes."}, {"viet": "Vấn đề giảm nạn thất nghiệp phải là quan trọng nhất trong chính sách kinh tế của chính phủ.", "eng": "The reduction of unemployment should be paramount in the government's economic policy."}, {"viet": "Các phóng viên đã cầm giữ ông ta lại phỏng vấn một giờ đồng hồ.", "eng": "The reporters collared him for an hour."}, {"viet": "Ông nhà giàu cấp tiền để xây cùng một bệnh viện và một trường học ở thành phố nơi ông sinh ra.", "eng": "The rich man founded a hospital and a school in the town where he was born."}, {"viet": "Con đường mở rộng ra thành đường hai tuyến xe.", "eng": "The road opened out into a dual carriageway."}, {"viet": "Phòng đã không được dọn vệ sinh chu đáo.", "eng": "The room was not cleaned well."}, {"viet": "Chiếc thuyền buồm đi nhanh nhờ gió thổi thuận chiều.", "eng": "The sailing boat made good speed, thanks to a following wind."}, {"viet": "Kế hoạch ấy bị bỏ xó sau cuộc thảo luận ngắn ngủi.", "eng": "The scheme was pigeon-holed after the brief discussion."}, {"viet": "Mật vụ đã tra hỏi điệp viên bị tình nghi đó hàng giờ.", "eng": "The secret police sweated the suspected spy for hours."}, {"viet": "Các cổ đông được triệu tập để dự buổi họp toàn thể.", "eng": "The shareholders were summoned to a general meeting."}, {"viet": "Con tàu chạy dưới lá cờ Hà Lan.", "eng": "The ship was sailing under the Dutch flag."}, {"viet": "Nhìn thấy cô ta, tim anh ta đập nhanh hơn.", "eng": "The sight of her set his heart beating faster."}, {"viet": "Những tòa nhà chọc trời vượt hẳn lên trên Niu-Yóoc.", "eng": "The skyscrapers that tower over New York."}, {"viet": "Người lính bị mù mắt trong vụ nổ.", "eng": "The soldier was blinded in the explosion."}, {"viet": "Con chim sẻ đậu xuống một cành cây gần đó.", "eng": "The sparrow alighted on a nearby branch."}, {"viet": "Các nhân viên được yêu cầu phải chú ý đề phòng các tờ giấy bạc giả.", "eng": "The staff were asked to watch out for forged banknotes."}, {"viet": "Những câu chuyện đang được loan truyền thì hoàn toàn sai lạc.", "eng": "The stories being bandied about are completely false."}, {"viet": "Sinh viên gây huyên náo mãi không thôi trên đường phố.", "eng": "The students kicked up no end of a racket in the street."}, {"viet": "Người mà ta tưởng là ăn mày thực ra là một viên cảnh sát cải trang.", "eng": "The supposed beggar was really a police officer in disguise."}, {"viet": "Thầy giáo mắng cả lớp một trận gay gắt.", "eng": "The teacher delivered sharp rebuke to the class."}, {"viet": "Răng của con cá này rất dài nên khó có thể hình dung làm sao nó có thể khép miệng lại được.", "eng": "The teeth of this fish are so long that it is difficult to see how it can over close its mouth."}, {"viet": "Tên trộm lẻn ra ( ngoài cửa ) khi không có ai nhìn.", "eng": "The thief slid out ( of the door ) while no one was looking."}, {"viet": "Đề bài tiểu luận ít có quan hệ với nội dung.", "eng": "The title of the essay bore little relation to the contents."}, {"viet": "Chuyến tàu hoả đã được sắp xếp thời gian để khớp với chuyến phà.", "eng": "The train is timed to connect with the ferry."}, {"viet": "Đoàn quân bị đổ máu trong cuộc giao tranh.", "eng": "The troops were bloodied in the skirmish."}, {"viet": "Hai quá trình này không giống nhau.", "eng": "The two processes are not analogous."}, {"viet": "Trường đại học đã được một nhà triệu phú từ thiện sáng lập.", "eng": "The university was founded by a millionaire philanthropist."}, {"viet": "Phong cảnh đẹp nhất là nhìn lúc ban ngày.", "eng": "The view is best seen by daylight."}, {"viet": "Tiếng nước ùng ục do chân vịt của tàu thuyền gây ra.", "eng": "The wash made by the steamer's propellers."}, {"viet": "Người da trắng phản ứng mạnh mẽ chống lại phong trào đòi chính quyền của người da đen.", "eng": "The White backlash to the Black power Movement."}, {"viet": "Gió hôm nay sẽ nhẹ và thay đổi.", "eng": "The winds today will be light and variable."}, {"viet": "Những người thợ đang đòi hỏi được trả một đồng lương đủ sống.", "eng": "The workers are demanding to be paid a living wage."}, {"viet": "Lớp thanh niên ngày nay có những cơ hội lớn hơn bao giờ hết so với trước đây.", "eng": "The youth of today have greater opportunities than ever before."}, {"viet": "Câu chuyện thân tình của họ làm tôi cảm thấy mình thừa.", "eng": "Their intimate conversation made me fell de trop."}, {"viet": "Vậy thì, ông đã ký duyệt cái nào trong số chúng chưa?", "eng": "Then, have you countersigned any of them?"}, {"viet": "Có một quyển sách trên bàn-có phải đó là quyển anh cần không?", "eng": "There's a book on the table-is that the one you want?"}, {"viet": "Có một chút hiểu lầm, tôi không nói đó là lỗi của anh.", "eng": "There's been a slight misunderstandting I wasn't suggesting it was your fault."}, {"viet": "Trong xe còn một chỗ ngồi nếu anh chen vào được.", "eng": "There's room for one more in the car if you squash in."}, {"viet": "Có nhiều sự khác nhau giữa sống ở thành phố và sống ở nông thôn.", "eng": "There are many differences between living in a city and living in the country."}, {"viet": "Có bã chè dưới đáy tách của tôi.", "eng": "There are tea leaves in the bottom of my cup."}, {"viet": "Thỉnh thoảng có những tràng súng nổ trong đêm.", "eng": "There have been sporadic outbursts of gunfire during the night."}, {"viet": "Cũng có một quầy phục vụ món salad trộn và món tráng miệng.", "eng": "There is also a salad and dessert bar."}, {"viet": "Có cái gì đó trục trặc trong thiết bị lái.", "eng": "There is something wrong with the steering."}, {"viet": "Có một nội lực thâm hậu trong quả đấm đó.", "eng": "There was a lot of power behind that blow."}, {"viet": "Có khả năng là sẽ bán doanh nghiệp này.", "eng": "There was some question of selling the business."}, {"viet": "Sẽ có những cuộc lễ để đánh dấu ngày sinh của Nữ hoàng.", "eng": "There will be ceremonies to mark the Queen's birthday."}, {"viet": "Những bông hoa này là biểu tượng nhỏ của lòng biết ơn của tôi.", "eng": "These flowers are a small token of my gratitude."}, {"viet": "Những đôi giày này tỏ ra ( có những dấu hiệu ) đã mòn.", "eng": "These shoes are showing ( signs of ) wear."}, {"viet": "Họ đang muốn thuê một căn hộ hai phòng ngủ cho tháng bảy và tháng tám.", "eng": "They're wanting to rent a two-bedroom apartment for July and August."}, {"viet": "Hai người là tử thù của nhau.", "eng": "They are at daggers drawn with each other."}, {"viet": "Họ đối xử tốt với cô gái, cung cấp cho cô ta thức ăn và chỗ ở.", "eng": "They befriended the young girl, providing her with food and shelter."}, {"viet": "Họ có thể bày tỏ quan điểm của họ chỉ bằng hình thức làm loãng đi, dựa vào kiểu bóng gió và ẩn dụ của Aesop.", "eng": "They could express their views only in a diluted form, resorting to Aesopian hints and allusions."}, {"viet": "Họ vào khu vực này mà không có giấy phép.", "eng": "They entered the area without permission."}, {"viet": "Họ có ba cầu thủ bảo vệ cầu môn ( chống lại tiến công ).", "eng": "They had three players defending the goal ( against attack )."}, {"viet": "Họ có tung vấn đề ra một hồi xem những ý kiến khác nhau nảy sinh.", "eng": "They kick the problem around for a while and see What ideas emerge."}, {"viet": "Họ gặp nhau vào tháng sáu và sau đó trở thành tình nhân.", "eng": "They met in June and became lovers soon after."}, {"viet": "Họ chèo mạnh và nhanh chóng vào đến bờ.", "eng": "They pulled hard and reached the shore quickly."}, {"viet": "Họ cử một đại diện tới cuộc họp.", "eng": "They sent a representative to the meeting."}, {"viet": "Họ đối xử với đứa bé như thể nó là con của họ.", "eng": "They treated the child as if she were their own."}, {"viet": "Họ bị đe doạ phải trở lại làm việc.", "eng": "They were browbeaten into returning to work."}, {"viet": "Họ khóc và than vãn cho số kiếp của họ.", "eng": "They were weeping and bemoaning their fate."}, {"viet": "Vùng này được đặt tên là'Cornish Riviera'.", "eng": "This area is known as the'Cornish Riviera'."}, {"viet": "Khái niệm này là điều hết sức cốt lõi trong lý thuyết của bà ấy.", "eng": "This concept is at the very core of her theory."}, {"viet": "Bộ phim này giành được bốn giải Oscar.", "eng": "This film is the winner of four Oscars."}, {"viet": "Điều này ngược lại với cái chúng tôi thực sự muốn.", "eng": "This is counter to what we really want."}, {"viet": "Đây không phải đúng mùa lê.", "eng": "This isn't the season for pears."}, {"viet": "Tờ báo này có một bài tường thuật độc nhất vô nhị.", "eng": "This newspaper has an exclusive report."}, {"viet": "Chiếc radio này bảo hành trong ba năm.", "eng": "This radio is guaranteed for three years."}, {"viet": "Diễn biến đột ngột này đã làm đảo lộn tất cả các kế hoạch của chúng ta.", "eng": "This sudden development turned all our plans topsy-turvy."}, {"viet": "Năm nay chứng kiến lễ kỷ niệm ba trăm năm ngày sinh của Handel.", "eng": "This year sees the tercentenary of Handel's birth."}, {"viet": "Chắc chắn là lúc đầu sẽ không dưới 200000 đô la.", "eng": "To stand on the safe side, not less than $ 200,000 for a start."}, {"viet": "Tình trạng xe cộ tối nay thật là hỗn độn.", "eng": "Traffic conditions tonight are chaotic."}, {"viet": "Các uỷ viên của uỷ ban đã nêu nhiều vấn đề thú vị.", "eng": "Various committee members made interesting points."}, {"viet": "Nước được chứa trong những két ở dưới mái.", "eng": "Water is stored in tanks under the roof."}, {"viet": "Chúng tôi sẽ mang chúng đến phòng của bà ngay.", "eng": "We'll send them to your room right away."}, {"viet": "Hiện nay chúng tôi ở một vị thế đưa ra những yêu sách của mình ( đối với những người điều hành ).", "eng": "We're now in a position to dictate our own demands ( to the management )."}, {"viet": "Chúng tôi có bán một vài bộ tiền kim loại và tiền giấy.", "eng": "We've got some sets of coins and notes on sale."}, {"viet": "Chúng tôi suýt quay ra đánh nhau về chuyện nên chọn tấm thảm màu gì.", "eng": "We almost came to blows over what colour our new carpet should be."}, {"viet": "Chúng tôi xin gửi đến ông một ít tiền để đền đáp sự giúp đỡ quý báu của ông.", "eng": "We are sending you some money in acknowledgement of your valuable help."}, {"viet": "Chúng tôi không thể vượt qua đồng cỏ ở chỗ đó được vì nước sông đang dâng lên.", "eng": "We can't cross the meadow there because the river is in flood."}, {"viet": "Nhà hàng chúng tôi phục vụ cả thức ăn Trung Quốc lẫn thức ăn phương Tây.", "eng": "We cater to both Chinese and Western taste."}, {"viet": "Chúng tôi giữ công việc kế toán, nhưng chúng tôi không am hiểu công việc này cho lắm.", "eng": "We do keep accounts for the business, but we are not very scientific about it."}, {"viet": "Chúng tôi nhận thấy anh ấy làm việc phù hợp với tài năng của anh ta hơn nhiều.", "eng": "We found him work more suited to his abilities."}, {"viet": "Chúng tôi phải thán phục tài bơi thuyền của anh ta.", "eng": "We had to admire his prowess as an oarsman."}, {"viet": "Chúng tôi có cái màu xanh nước biển và màu be.", "eng": "We have it in navy and beige."}, {"viet": "Chúng tôi hi vọng bằng thí nghiệm có thể tìm ra câu trả lời cho vấn đề này.", "eng": "We hope to find the answer to this problem by experiment."}, {"viet": "Chúng tôi mong sẽ sớm nhận được số tiền này.", "eng": "We look forward to receiving the amount due soon."}, {"viet": "Chúng ta phải nhắc nhở các chủ thầu phải giữ đúng bảng báo giá của họ.", "eng": "We must hold the contractors to their estimates."}, {"viet": "Chúng tôi đưa ra rất nhiều nơi nghỉ để lựa chọn.", "eng": "We offer a wide range of holidays to choose from."}, {"viet": "Chúng tôi bù lại thời gian đã mất bằng cách ra đi sớm.", "eng": "We recovered lost time by setting out early."}, {"viet": "Chúng ta cần phải cố gắng tránh cái thái độ phân biệt'các ông các bà và chúng tôi'trong quan hệ chủ thợ.", "eng": "We should try to get away from a'them and us'attitude in industrial relations."}, {"viet": "Chúng tôi có bán, nhưng không có nhiều người hỏi mua.", "eng": "We use to carry it, but we didn't get many calls for it."}, {"viet": "Tụi anh đã là bạn thân, cho nên anh nhớ gương mặt của cô ấy rất rõ.", "eng": "We were close friends, so I pretty much remember her face."}, {"viet": "Chúng tôi sẽ tiếp tục chiến đấu đến cùng, không có chuyện đầu hàng.", "eng": "We will fight on to the end, there will be no surrender."}, {"viet": "Thế đấy, liên đoàn bóng đá chưa bắt đầu dự định gì đó cho trẻ con hay sao?", "eng": "Well, didn't this football league start out as some thing for the kids?"}, {"viet": "À, tin đó chắc chắn dành cho tôi đấy.", "eng": "Well, that's certainly news to me."}, {"viet": "Thưa bà, giày của bà bị làm sao vậy?", "eng": "What's the matter with your shoes anyway, madam?"}, {"viet": "Các môn thể thao được ưa chuộng nhất ở châu Âu là những môn nào?", "eng": "What are the most popular sports in Europe?"}, {"viet": "Bạn làm gì khi bạn bị nhức đầu?", "eng": "What do you do when you have a headache?"}, {"viet": "Những điều tôi đã nói về lục quân, với những sửa đổi thích hợp, cũng có thể được áp dụng với hải quân.", "eng": "What I have said about the army also applies, mutatis mutandis, to the navy."}, {"viet": "Súng của anh bắn xa được bao nhiêu?", "eng": "What is the range of your gun?"}, {"viet": "Kỳ hạn nào phổ biến nhất?", "eng": "What maturities are the most popular?"}, {"viet": "Mấy giờ thì cháu tan học?", "eng": "What time are your classes over?"}, {"viet": "Khi Augustus Caesar trở thành hoàng đế trong vài năm sau, tháng sau tháng bảy được đặt theo tên ông ta.", "eng": "When Augustus Caesar became emperor a few years later, the month after July was named for him."}, {"viet": "Khi không được nhân dân địa phương đáp ứng thoả đáng, tôi đã viết đơn cho cơ quan cấp trên.", "eng": "When I didn't get any satisfaction from the local people I wrote to the head office."}, {"viet": "Khi nói chuyện với thanh niên, hãy nói sao cho dễ hiểu.", "eng": "When speaking to young people, keep it simple."}, {"viet": "Khi có khách, cái xô pha được dùng làm giường phụ.", "eng": "When we have guests, the sofa doubles as an extra bed."}, {"viet": "Cái này từ đâu đến thế nhỉ?'.", "eng": "Where did this come from?'."}, {"viet": "Ông thích dùng gì hơn, thịt gà hay thịt bò ạ?", "eng": "Which do you prefer, chicken or beef?"}, {"viet": "Khi ở Pari tôi tình cờ gặp hai người bạn cũ.", "eng": "While in Paris we chanced on two friends."}, {"viet": "Ai để cái vòi chảy thế này, Mũi anh đang chảy nước.", "eng": "Who left the tap running, Your nose is running."}, {"viet": "Tại sao bạn không đến nhà tôi vào thứ bảy tới nhỉ?", "eng": "Why don't you come to my house next Saturday?"}, {"viet": "Màu có bị lan ra khi giặt không?", "eng": "Will the colors run in the wash?"}, {"viet": "Bạn dạy cho tôi một chuyện tiếu lâm hay bằng tiếng Anh nhé?", "eng": "Will you teach me one good English joke?"}, {"viet": "Các công nhân nhất trí bỏ phiếu cho cuộc đình công.", "eng": "With one voice, the workers voted to strike."}, {"viet": "Tôi sẽ bỏ ra bất cứ cái gì để điều này không xảy ra.", "eng": "Would give anything for this not to have happened."}, {"viet": "Bạn có muốn ăn trưa với chúng tôi không?", "eng": "Would you like to have lunch with us?"}, {"viet": "Xin ông vui lòng ghi nó ra nhé?", "eng": "Would you please write it down?"}, {"viet": "Vâng, tôi muốn đặt chỗ trên chuyến bay đi Luân Đôn vào ngày 3.", "eng": "Yes, I'd like to make a reservation to London on the 3rd, the day after tomorrow."}, {"viet": "Vâng, ông chỉ cần điền vào một tờ đơn xin mở một tài khoản.", "eng": "Yes, you only need to fill in an application for opening an account."}, {"viet": "Anh cần phải học chăm nếu anh muốn đỗ ( kỳ thi ).", "eng": "You'll have to work hard if you want to pass ( the exam )."}, {"viet": "Anh không bị ràng buộc phải trả tiền cho những hàng mà anh không đặt mua.", "eng": "You're under no obligation to pay for goods which you did not order."}, {"viet": "Anh nên hiểu câu nói theo đúng từ chữ.", "eng": "You are to understand the phrase literally."}, {"viet": "Bạn có thể thêm chất lỏng vào bột hoặc ngược lại, bột vào chất lỏng.", "eng": "You can add the fluid to the powder or, conversely, the powder to the fluid."}, {"viet": "Anh có thể nói thoải mái trước mặt tôi, tôi sẽ không nói với ai điều anh nói đâu.", "eng": "You can speak quite freely in front of me, I won't tell anyone what you say."}, {"viet": "Ông không sống một mình, phải vậy không?", "eng": "You don't live alone, do you?"}, {"viet": "Anh phải pha thuốc vào nước trước khi uống.", "eng": "You have to water down the medicine before drinking it."}, {"viet": "Anh có thể yên chí là người ta đang làm hết mọi khả năng.", "eng": "You may rest assured that everything possible is being done."}, {"viet": "Anh phải cân nhắc cái giá ban đầu bỏ ra mua một chiếc xe mới với số tiền mà anh dành dụm để sửa chữa chiếc cũ.", "eng": "You must set the initial cost of a new car against the saving you'll make on repairs."}, {"viet": "Ông đã cứu sống tôi, tôi mang ơn ông suốt đời.", "eng": "You saved my life, I am forever in your debt."}, {"viet": "Anh nên viết về những gì họ làm.", "eng": "You should write about the things they do."}, {"viet": "Yêu cầu anh sẽ giúp bà Smith chuẩn bị một bản báo cáo.", "eng": "You will be required to assist Mrs Smith in preparing a report."}, {"viet": "Quyển sách của anh có vẻ hay hơn quyển của tôi, anh có muốn đánh đổi ( cho tôi ) không?", "eng": "Your book looks more interesting than mine, do you want to swap ( with me )?"}, {"viet": "Câu hỏi của anh đã làm anh ta ngừng lại đột ngột.", "eng": "Your question stopped him in his tracks."}]