[{"viet": "Năm thứ nhất sau công nguyên thật sự không phải là năm Chúa được sinh ra.", "eng": "A. D. i was not actually the year when Christ was born."}, {"viet": "Một con mèo cọ nhẹ vào chân của cô ta trong bóng tối.", "eng": "A cat brushed against her leg in the darkness."}, {"viet": "Một kiểu đồng phục lố lăng.", "eng": "A comic-opera style of uniform."}, {"viet": "Một tội ác được thực hiện với sự thông đồng của cảnh sát.", "eng": "A crime carried out with the connivance of connivance with the police."}, {"viet": "Một bữa tiệc chiêu đãi vị đại sứ.", "eng": "A dinner was given for the ambassador."}, {"viet": "Những cử động ì ạch, nặng nề của một người béo.", "eng": "A fat man's ponderous movements."}, {"viet": "300.000 quân đã được trang bị vũ khí và sẵn sàng chiến đấu.", "eng": "A force of 300,000 already under arms."}, {"viet": "Một luật sư giỏi có thể giúp anh thoát khỏi bản án.", "eng": "A good lawyer might be able to get you off."}, {"viet": "Búa được dùng để đóng đinh.", "eng": "A hammer is used for driving in nails."}, {"viet": "Một ngọn sóng lớn đã làm ngập chiếc xuồng.", "eng": "A huge wave swamped the boat."}, {"viet": "Một đạo luật được thảo có lợi cho những ai sở hữu đất.", "eng": "A law weighted in favour of those owning land."}, {"viet": "Cuộc đấu tranh lâu dài đã kết thúc thành công.", "eng": "A long struggle that culminate in success."}, {"viet": "Một vấn đề bên lề không liên quan gì tới các kết quả bầu cử.", "eng": "A marginal issue that had no bearing on the election results."}, {"viet": "Một đống quần áo phải giặt và là.", "eng": "A mountain of washing and ironing."}, {"viet": "Một món tiền không phải là nhỏ.", "eng": "A not inconsiderable sum of money."}, {"viet": "Tiền trợ cấp thường đâu phải là một trong những sự bận tâm của tuổi mười tám!", "eng": "A pension is not usually one of the preoccupations of an eighteen year old!"}, {"viet": "Một cú phóng từ mỏm đá xuống biển.", "eng": "A plunge into the sea from the rocks."}, {"viet": "Một sản phẩm trong giai đoạn đang phát triển.", "eng": "A product at a developmental stage."}, {"viet": "Một quy định cấm đỗ xe trong khu trung tâm thành phố.", "eng": "A regulation to prohibit parking in the city centre."}, {"viet": "Một cuộc bầu phiếu bổ sung để phân thắng bại giữa hai ứng cử viên được nhiều phiếu nhất ngang nhau.", "eng": "A runoff between the two top vote getters."}, {"viet": "Một hình dáng lờ mờ thoáng qua trong bóng hoàng hôn.", "eng": "A shadowy figure glimpsed in the twilight."}, {"viet": "Giá cả nhà cửa tăng nhẹ trong vòng một năm.", "eng": "A small year-on-year increase in house prices."}, {"viet": "Một cuộc khởi sự dàn quân khoảng năm 1993.", "eng": "A start of deployment in the 1993 time frame."}, {"viet": "Một điều bất ngờ đã chờ sẵn trong chuyến đi của chúng tôi.", "eng": "A surprise awaited us on our arrival."}, {"viet": "Những bước chập chững đầu tiên của đứa bé tập đi.", "eng": "A toddler's first few halting steps."}, {"viet": "Từ phía trên có tiếng gọi vọng xuống chúng tôi.", "eng": "A voice called down to us from above."}, {"viet": "Một thế giới hết sạch thú vui, không còn có ý nghĩa gì.", "eng": "A world leached of pleasure, voided of meaning."}, {"viet": "Hành động ngược với ý muốn của ai.", "eng": "Act counter to somebody's wishes."}, {"viet": "Sau vài năm bị lu mờ ông ta lại được bổ nhiệm vào nội các.", "eng": "After a few years in the wilderness he was reappointed to the Cabinet."}, {"viet": "Sau khi mất việc, thật là điều an ủi nhạt nhẽo khi người ta bảo tôi đã trúng xổ số của cơ quan.", "eng": "After losing my job it was cold comfort to be told I'd won the office raffle."}, {"viet": "Sau vụ tai tiếng gần đây chính phủ mất hết tín nhiệm.", "eng": "After the recent scandal the Government has lost all credibility."}, {"viet": "Tất cả kinh phí phải được vào sổ kế toán.", "eng": "All expenditure must be entered up in the account book."}, {"viet": "Tất cả pháo hoa lớn sẽ bắn sau.", "eng": "All the big ones come later."}, {"viet": "Còn hầu hết cả châu Âu đều nhanh chóng biết đến các cuộc du hành của Columbus sau khi chuyến đi kết thúc.", "eng": "Almost all Europe knew about the voyages of Columbus soon after they were over."}, {"viet": "Bản dịch tóm tắt cuốn Chiến tranh và Hòa bình.", "eng": "An abridged version of War and Peace."}, {"viet": "Một văn bằng nghệ thuật hạng danh dự về xã hội học.", "eng": "An arts degree with honours in sociology."}, {"viet": "Một từ ngữ mà ý nghĩa của nó đã bị sai lệch bởi sự lạm dụng thường xuyên.", "eng": "An expression whose meaning has been perverted by constant misuse."}, {"viet": "Một viên sĩ quan phải biết cách điều khiển binh lính của mình.", "eng": "An officer must know how to handle his men."}, {"viet": "Một bản tường trình vào phút chót về các cuộc biến loạn.", "eng": "An up-to-the-minute account of the riots."}, {"viet": "Ann sợ chết điếng khi cánh cửa lặng lẽ mở ra.", "eng": "Ann froze with terror as the door opened silently."}, {"viet": "Những người xin việc sẽ được gọi phỏng vấn vào lúc thích hợp.", "eng": "Applicants will be called for interview in due course."}, {"viet": "Chúng tôi có hân hạnh được gặp lại anh không?", "eng": "Are we to have the pleasure of seeing you again?"}, {"viet": "Bạn có tự hào về các đội bóng bầu dục của nước bạn không?", "eng": "Are you proud of your rugby teams?"}, {"viet": "Để bổ sung cho một loạt chương trình truyền hình, đài BBC sẽ xuất bản một cuốn sách.", "eng": "As a follow-up to the television series the BBC is publishing a book."}, {"viet": "Ngay khi đồng hồ đánh năm tiếng, họ ngừng làm việc và ra về.", "eng": "As soon as the clock strikes five, they down tools and off they go."}, {"viet": "Vào tuổi chín mươi, bà ấy già khọm và yếu đuối lắm.", "eng": "At 90, she's getting very old and frail."}, {"viet": "Ở giai đoạn này chúng ta có ba điểm chính cần xem xét-các vị đã có chúng trong tờ chương trình nghị sự.", "eng": "At this stage we have three main points to consider-you have them on your agenda."}, {"viet": "Những công ty ngân hàng phát triển trong thế kỷ thứ 15 và 16 là những tổ tiên trực tiếp của những ngân hàng thương mại hiện đại.", "eng": "Banking firms that developed during the 15th and 16th centuries are the direct ancestors of modern commercial banks."}, {"viet": "Chịu trách nhiệm gián tiếp trước Tổng thống.", "eng": "Be indirectly responsible to the President."}, {"viet": "Khăn trải giường và chăn bừa bộn trên sàn nhà.", "eng": "Bedclothes in a tumble on the floor."}, {"viet": "Bên kia quả đồi, vùng đất dốc hẳn xuống phía dòng sông.", "eng": "Beyond the hill, the land falls away sharply towards the river."}, {"viet": "Giá cả cũng như mức sống đều thấp hơn trước chiến tranh.", "eng": "Both the cost and the standard of living were lower before the war."}, {"viet": "Xây một sân vận động mới cho Thế vận hội.", "eng": "Build a new stadium for the Olympic Games."}, {"viet": "Nhưng tôi cần được đánh bóng giày bây giờ.", "eng": "But I need to have my shoes shined now."}, {"viet": "Nhưng con không thể buồn mãi được.", "eng": "But you can't be unhappy all the time."}, {"viet": "À này, anh đã mua vé chưa?", "eng": "By the way, have you bought your ticket?"}, {"viet": "Xin cho tôi xem lại thực đơn lần nữa?", "eng": "Can I have another look at the menu?"}, {"viet": "Vui lòng mua cho tôi một ít lê?", "eng": "Can you buy me some pears?"}, {"viet": "Anh có thể cung cấp chỗ ở cho ba mươi người không?", "eng": "Can you provided accommodation for thirty people?"}, {"viet": "Anh không thể làm hắn im đi được sao?", "eng": "Can't you shut him up?"}, {"viet": "Sự hỗn loạn ngự trị tuyệt đối trong ngôi nhà mới của chúng tôi.", "eng": "Chaos reigns supreme in our new house."}, {"viet": "Ngày lễ Giáng Sinh thì cố định, nhưng ngày lễ Phục Sinh thì thay đổi hàng năm.", "eng": "Christmas is fixed, but Easter is a movable feast."}, {"viet": "Sưu tầm tiền tệ của nước khác là sở thích của ông ấy.", "eng": "Collecting currencies of different countries is his hobby."}, {"viet": "Tập trung vào cuộc tái bầu cử, giải quyết qua loa các việc khác.", "eng": "Concentrated on reelection, skimping other matters."}, {"viet": "Các vụ nổi loạn phá rối, giống như các vụ bạo loạn ở thành phố.", "eng": "Convulsive upheavals, such as urban riots."}, {"viet": "Anh có thể vui lòng giúp tôi năm bảng Anh cho đến cuối tuần không?", "eng": "Could you oblige me with five pounds until the weekend?"}, {"viet": "Các nhà phê bình nhận xét là vở kịch đó không mới lạ.", "eng": "Critics remarked that the play was not original."}, {"viet": "Chứng điếc có thể là một khuyết tật nghiêm trọng.", "eng": "Deafness can be a serious handicap."}, {"viet": "Ước mong rằng những sáng kiến này sẽ dẫn tới những cuộc trao đổi thêm nữa.", "eng": "Desirous that these initiatives should lead to further exchanges."}, {"viet": "Em có biết thuê một chiếc xe hơi tốn bao nhiêu không?", "eng": "Did you find out how much it costs to rent a car?"}, {"viet": "Đấm một cú thẳng vào đầu ai.", "eng": "Direct a blow at somebody's head."}, {"viet": "Xin hãy lịch sự lắng nghe những điều tôi phải nói.", "eng": "Do me the courtesy of listening to what I have to say."}, {"viet": "Cô có bán coca-cola không có đường và không có caphein không?", "eng": "Do you carry sugar-free and caffeine-free Coke?"}, {"viet": "Khách sạn có giường xếp và giường cũi nào cho thuê không?", "eng": "Do you have any folding beds and cots for rent?"}, {"viet": "Bạn có biết nhà ga ở đâu không?", "eng": "Do you know where the station is?"}, {"viet": "Anh có nhớ là anh đã để chìa khóa ở chỗ nào không?", "eng": "Do you remember where you put the key?"}, {"viet": "Ông có hiểu điều tôi muốn nói không?", "eng": "Do you understand what I mean?"}, {"viet": "Như vậy đã tính luôn phí phục vụ chưa?", "eng": "Does this include a service charge?"}, {"viet": "Đừng gọi cô ta bây giờ-có thể chúng ta sẽ đến muộn mất.", "eng": "Don't call her now-it would make us late."}, {"viet": "Đừng đánh giá tác phẩm của bà ta một cách quá chủ quan.", "eng": "Don't judge her work too subjectively."}, {"viet": "Đừng mập mờ nữa: hãy cho chúng tôi câu trả lời rõ ràng.", "eng": "Don't shuffle: give us a clear answer."}, {"viet": "Bạn không quan tâm đến tương lai của đất nước này sao?", "eng": "Don't you care about this country's future?"}, {"viet": "Việc dùng ma túy là một hình thức quên lãng sự đời của một số người.", "eng": "Drug-taking is a form of escapism for some people."}, {"viet": "Các nỗ lực nhằm đạt đến sự công bằng xã hội hoàn toàn.", "eng": "Efforts to achieve complete social justice."}, {"viet": "Giao một công việc cho người phụ tá.", "eng": "Entrust the task to an assistant."}, {"viet": "Mọi người đều có quyền được xét xử công bằng.", "eng": "Everyone has a right to a fair trial."}, {"viet": "Xin lỗi cho hỏi, tôi có thể lấy đơn xin thẻ tính điểm ở đâu ạ?", "eng": "Excuse me, where can I pick up a point card application?"}, {"viet": "Tiếng thơm lưu danh ngàn đời.", "eng": "Fame that will endure for ever."}, {"viet": "Rất ít các bản thảo ngày xưa còn được bảo tồn.", "eng": "Few of the early manuscripts have been preserved."}, {"viet": "Giải nhất cuộc tranh tài sẽ là một bữa ăn tại nhà hàng do bạn chọn.", "eng": "First prize in the competition will be a meal at the restaurant of your choice."}, {"viet": "Theo lối đi của những nhà thám hiểm trước.", "eng": "Following in the track of earlier explorers."}, {"viet": "Khu rừng trụi lá do chất hóa học trong không khí.", "eng": "Forests defoliated by chemicals in the air."}, {"viet": "Dầu nhiên liệu thiếu suốt mùa đông.", "eng": "Fuel oil ran short during winter."}, {"viet": "Được bớt tiền cho một chiếc xe.", "eng": "Get an allowance for your old car."}, {"viet": "Trách mắng ai một trận nên thân.", "eng": "Give somebody a good ticking-off."}, {"viet": "Hãy đi đến ngôi nhà cuối làng và tôi sẽ gặp anh ở đó.", "eng": "Go to the farthest house in the village and I'll meet you there."}, {"viet": "Lính gác đi tuần tra vòng đai sân bay.", "eng": "Guards patrolled the perimeter of the airfield."}, {"viet": "Đã giữ vững được ưu thế trong nghề phần lớn là nhờ nổi tiếng về chất lượng.", "eng": "Has preserved its hammerlock on the business largely because of its reputation for quality."}, {"viet": "Anh có đủ chỗ để làm việc không?", "eng": "Have you enough space to work in?"}, {"viet": "Anh có nghĩ tới những gì anh sẽ làm trong năm năm tới không?", "eng": "Have you looked ahead to what you'll be doing in five years'time?"}, {"viet": "Hắn uống say và lại vào đánh nhau.", "eng": "He'd had a skinful and got into a fight."}, {"viet": "Nó luôn luôn làm mất mặt vợ nó trước mọi người.", "eng": "He's always putting his wife down in public."}, {"viet": "Anh ta trở nên béo bệu do không tập thể dục đầy đủ.", "eng": "He's getting fat and flabby because he doesn't have enough exercise."}, {"viet": "Ông ta không phải là nhà văn giỏi như người đời ca ngợi.", "eng": "He's not such a good writer as he's cracked up to be."}, {"viet": "Anh ta quen với giao thông vì anh ta thường lái xe trong thành phố.", "eng": "He's used to traffic because he often drives in town."}, {"viet": "Hai vợ chồng anh ấy cứ lục đục hoài.", "eng": "He and his wife are always at loggerheads."}, {"viet": "Anh ấy lầm bầm thốt ra một lời xin lỗi.", "eng": "He bleated out a feeble excuse."}, {"viet": "Anh ấy cứ việc gửi thư cho tôi mệt nghỉ, tôi cũng sẽ chẳng bao giờ trả lời.", "eng": "He can write me letters till he's blue in the face, I'm not going to reply."}, {"viet": "Anh ta chẳng còn biết làm gì nữa mà chỉ đứng đó thán phục.", "eng": "He could do nothing but stand and wonder."}, {"viet": "Hắn ù ờ khi tôi bảo là mình sắp lập gia đình.", "eng": "He did a double take when I said I was getting married."}, {"viet": "Ông ta cho rằng không có lợi lộc gì trong quảng cáo đó.", "eng": "He doesn't think there's any mileage in that type of advertising."}, {"viet": "Ông ta cảm thấy rằng môn kịch nghệ trong trường chưa được quan tâm đúng mức.", "eng": "He feels that there's not enough stress on drama at the school."}, {"viet": "Anh ấy cho rằng sẽ tự hạ rất thấp giá trị của mình nếu phải làm việc cho nhân viên của mình trước đây.", "eng": "He found it very demeaning to have to work for his former employee."}, {"viet": "Anh ta được huy chương vì lòng dũng cảm.", "eng": "He got a medal for bravery."}, {"viet": "Hắn cúi đầu khi đi ra khỏi toà.", "eng": "He had his head down as he walked out of the court."}, {"viet": "Nó rất ghét phải thức dậy sớm như vậy.", "eng": "He has a strong objection to getting up so early."}, {"viet": "Anh ta không có ý kiến gì độc đáo; anh ta chẳng qua chỉ bắt chước ông bố mà thôi.", "eng": "He has no original opinions; he's just his father's echo."}, {"viet": "Anh ấy va đầu gối vào góc bàn.", "eng": "He hit his knee on the corner of the table."}, {"viet": "Ông ta là người Pháp, cô ấy người Đức, nhưng họ có tiếng Anh là ngôn ngữ chung.", "eng": "He is French, she is German, but they have English as a common language."}, {"viet": "Hắn không có khả năng lái trong tình trạng hiện giờ.", "eng": "He is unfit to drive in his present state."}, {"viet": "Ông ta tuyên bố ngay mà không có lời mở đầu gì cả.", "eng": "He launched into his statement without any preamble."}, {"viet": "Hắn trừng mắt nhìn tôi khi tôi bảo hắn lười biếng.", "eng": "He looked daggers at me when I told him he was lazy."}, {"viet": "Ông ta đã tìm cách chào 12 người trong năm giây mà không nhìn thẳng vào mắt người nào cả.", "eng": "He managed to say hello to 12 people in five seconds without making eye contact with a single one."}, {"viet": "Anh ta vọt vào ngay trước mặt tôi.", "eng": "He nipped in just in front of me."}, {"viet": "Anh ném bóng ngay vào gôn của bên mình.", "eng": "He played the ball onto his wicket."}, {"viet": "Nó đã cho đối thủ ăn đòn bằng những cú đấm dữ dội vào người.", "eng": "He punished his opponent with fierce punches to the body."}, {"viet": "Hắn đã bị đấm thật mạnh vào đầu.", "eng": "He received a severe blow to the head."}, {"viet": "Ông ta không quan tâm gì tới tất cả sự chống đối những ý kiến của ông ta.", "eng": "He role roughshod over all opposition to his ideas."}, {"viet": "Anh ta luôn luôn làm ở chỗ bận rộn nhất.", "eng": "He's always in the thick of it things."}, {"viet": "Anh ta có ít ý kiến.", "eng": "He's hard up for ideas."}, {"viet": "Anh ta ở chung với bạn Alan của tôi.", "eng": "He's rooming with my friend Alan."}, {"viet": "Anh ta ngồi xuống chỗ ngồi gần nhất.", "eng": "He sat down the nearest available seat."}, {"viet": "Anh ấy thường gặp cô ta nhưng không muốn dính líu quá nhiều.", "eng": "He sees her often but doesn't want to get too involved."}, {"viet": "Ông ta sập cửa bằng một cử chỉ giận dữ.", "eng": "He slammed the door with a vehement gesture."}, {"viet": "Nó rắc đường lên món ngũ cốc của mình.", "eng": "He sprinkled sugar over his cereal."}, {"viet": "Anh ta bắt đầu bơi nhanh về phía bờ.", "eng": "He struck out strongly for the shore."}, {"viet": "Ông ta buộc con ngựa vào một cái cây.", "eng": "He tethered his horse to a tree."}, {"viet": "Ông ta phê bình nghiêm khắc bài tiểu luận của tôi, nhưng tôi thấy ý kiến của ông ta bổ ích.", "eng": "He took my essay apart but I found his criticism helpful."}, {"viet": "Nó quay đầu lại và nhìn về phía sau.", "eng": "He turned his head and looked back."}, {"viet": "Ông ta muốn chứng minh cho Damocles thấy rằng cuộc sống của một người cai trị không dễ dàng gì-rằng cuộc sống của ông ta luôn luôn đầy nguy hiểm.", "eng": "He wanted Damocles to know that a ruler's life is not easy-that often his life is in danger."}, {"viet": "Anh ta được bổ nhiệm quản đốc thay cho ông Jones.", "eng": "He was appointed manager vice Mr. Jones."}, {"viet": "Ông ta hoàn toàn bị thua sút trong chiến dịch nhằm tranh thủ sự ủng hộ của các bộ trưởng khác.", "eng": "He was completely outmaneuvered in his campaign to win the support of other ministers."}, {"viet": "Hắn bị bỏ tù sáu tháng vì tham gia vào vụ cướp.", "eng": "He was gaoled for six months for his part in the robbery."}, {"viet": "Anh ta mong có được công ăn việc làm trở lại.", "eng": "He was looking forward to being in work again."}, {"viet": "Anh ta nhanh chóng nhận lời thách đấu của đối phương.", "eng": "He was quick to take up the gauntlet thrown down by the opposition."}, {"viet": "Nó đang toát mồ hôi khắp người.", "eng": "He was sweating at every pore."}, {"viet": "Anh ta bị thương ở một bộ phận rất cần cho sự sống.", "eng": "He was wounded in a vital part of his anatomy."}, {"viet": "Nó sẽ không bao giờ yên lòng cho tới khi nó biết được sự thật.", "eng": "He will never rest until he knows the truth."}, {"viet": "Anh ta quấn một miếng giẻ sạch quanh mắt cá chân mình.", "eng": "He wrapped a clean rag around his ankle."}, {"viet": "Giúp ai vì thương hại, tốt bụng, rộng lượng, v. v.", "eng": "Help sb out of pity, kindness, generosity, etc."}, {"viet": "Kinh nghiệm dày dặn làm cho cô ta thích hợp với công việc.", "eng": "Her breadth of experience makes her suitable for the job."}, {"viet": "Nụ cười, sự thành thật, sự duyên dáng, v. v. của cô ấy làm người ta hết giận.", "eng": "Her disarming smile, frankness, charm, etc."}, {"viet": "Kinh nghiệm đầu tiên của cô ta về đời sống ở một đô thị lớn.", "eng": "Her first taste of life in a big city."}, {"viet": "Cơn bệnh của cô ấy chỉ là một kế nhằm tránh gặp gỡ anh ấy.", "eng": "Her illness is merely a device to avoid him."}, {"viet": "Đầu óc cô ta nhảy từ chuyện này sang chuyện khác.", "eng": "Her mind Jumped from one thing to another."}, {"viet": "Sự kiên nhẫn và khéo léo của cô ta đã nổi tiếng.", "eng": "Her patience and tact was legendary."}, {"viet": "Hôn lễ thứ hai của bà ta đã được tổ chức ở Thánh đường St John.", "eng": "Her second marriage was held in St John's Church."}, {"viet": "Thời gian của bà ta bị công việc viết lách chiếm hết.", "eng": "Her time is fully taken up with writing."}, {"viet": "Tờ đơn xin đã được điền và ký rồi đây.", "eng": "Here is the application form filled out and signed."}, {"viet": "Hoài bão của anh ta là gặp mặt đối mặt với ngôi sao nhạc pốp yêu thích của mình.", "eng": "His ambition was to meet his favourite pop star face to face."}, {"viet": "Ông chủ của anh ta khó tính.", "eng": "His boss has a foul temper."}, {"viet": "Lòng dũng cảm của anh ta đã mang lại những tiếng khen về trung đoàn của mình.", "eng": "His courage has brought great credit to his regiment."}, {"viet": "Mắt anh ta nhìn mãi vào chiếc nhẫn kim cương trên tay cô ấy.", "eng": "His eyes lingered on the diamond ring on her finger."}, {"viet": "Mối quan tâm hàng đầu của anh ta là lo cho hạnh phúc của nàng.", "eng": "His fundamental concern was for her welfare."}, {"viet": "Những lời nhận xét không tử tế của anh ta đối với người nước ngoài làm cô ấy rất tức giận.", "eng": "His insensitive remarks about foreigners made her hackles rise."}, {"viet": "Trí nhớ của anh ta bị kém đi vì bệnh tật của anh ta.", "eng": "His memory is blurred by his illness."}, {"viet": "Cha mẹ anh ấy hết sức tin tưởng vào tương lai của anh ấy.", "eng": "His parents have great expectations for his future."}, {"viet": "Kỷ lục về cưỡi ngựa vượt rào của anh ta là không ai bằng.", "eng": "His record as a show-jumper is unequalled."}, {"viet": "Lời phát biểu của ông ta thật kỳ quặc.", "eng": "His speech was full of whimsy."}, {"viet": "Khiếu thẩm mỹ không sai chệch về quần áo, bản năng không nhầm lẫn trong việc mua bán, ý thức không nhầm lẫn về phương hướng.", "eng": "His unerring taste in clothes, instinct for a bargain, sense of direction."}, {"viet": "Cô ấy chợt nghĩ ra được một cái tên hay cho cuốn tiểu thuyết mới của mình.", "eng": "Hit upon a good title for her new novel."}, {"viet": "Đua ngựa là nỗi đam mê của cô ta Âm nhạc là niềm say mê của anh ta.", "eng": "Horse-racing is her passion Music is a passion with him."}, {"viet": "Tôi biết cám ơn anh và cháu thế nào đây?", "eng": "How can I thank all of you?"}, {"viet": "Ngày nghỉ của cậu thế nào?''Rất tốt đẹp'.", "eng": "How did your holiday go?''It went very well'."}, {"viet": "Việc xử lý các số liệu bằng máy vi tính mới nhanh đến đâu?", "eng": "How fast does the new micro process the data?"}, {"viet": "Tôi nên lấy bao nhiêu hộp sô-cô-la?", "eng": "How many boxes of chocolate should I get?"}, {"viet": "Con đường này và xe lửa cắt nhau bao nhiêu lần ở trên tấm bản đồ này?", "eng": "How many times do the road and the railway intersect on this map?"}, {"viet": "Anh định trả bao nhiêu cho cái xe ô tô cũ của tôi?", "eng": "How much will you give me for my old car?"}, {"viet": "Bản chất con người kinh tởm một sự độc ác như vậy.", "eng": "Human nature revolts at such cruelty."}, {"viet": "Tôi muốn đặt một bàn cho ba người tối nay.", "eng": "I'd like to book a table for three for tonight."}, {"viet": "Tôi sẽ sắp xếp lại một buổi ăn tối để tất cả chúng ta có thể họp mặt nhau.", "eng": "I'll arrange a dinner so we can all get together."}, {"viet": "Tôi sẽ phải đến dự đám tang dì tôi, dù sao bà ta cũng là người ruột thịt của tôi.", "eng": "I'll have to go to my aunt's funeral-she was my own flesh and blood after all."}, {"viet": "Tôi đề nghị với anh thế này-chúng ta hãy hỏi Fred để mượn xe ôtô của anh ta.", "eng": "I'll tell you what-let's ask Fred to lend us his car."}, {"viet": "Tôi rất lấy làm tiếc, tôi có kế hoạch khác rồi.", "eng": "I'm awfully sorry, but I have other plans."}, {"viet": "Tôi sẽ làm một mẻ khác để tối nay tôi sẽ có bánh mới ra lò.", "eng": "I'm going to make another batch so they will be fresh for tonight."}, {"viet": "Tôi không làm phiền anh chứ? cô ấy hỏi một cách lo lắng.", "eng": "I'm not boring you? she asked anxiously."}, {"viet": "Tôi căm phẫn vì sự tàn nhẫn của tội ác này.", "eng": "I'm shocked by the atrocity of this crime."}, {"viet": "Tôi chắc rằng bà ta sẽ ủng hộ đề nghị của anh.", "eng": "I'm sure she will be in sympathy with your proposal."}, {"viet": "Tôi đang viết bài về một số nhân viên trên chiếc tàu sân bay này.", "eng": "I'm working on a story about some of the men on this aircraft carrier."}, {"viet": "Tôi làm việc trong vườn cả chiều.", "eng": "I've been working in the garden all afternoon."}, {"viet": "Tôi đã nghe đủ về công việc của anh rồi, thôi cho qua đi!", "eng": "I've heard enough about your job, so skip it!"}, {"viet": "Tôi đã tìm khắp nơi cây bút bị đánh mất của tôi.", "eng": "I've searched high and low for my lost pen."}, {"viet": "Tôi cũng muốn được như thế.", "eng": "I also want to be like that."}, {"viet": "Tôi không lấy gì làm vui lắm về quyết định này.", "eng": "I am not altogether happy about the decision."}, {"viet": "Tôi hỏi chị ấy xem chị ấy có thể trông hộ những đứa trẻ cho tôi trong một tiếng không.", "eng": "I asked her if she would look after children for an hour."}, {"viet": "Tôi mua một ít thuốc nhuộm màu xanh ngày hôm qua.", "eng": "I bought some blue dye yesterday."}, {"viet": "Tôi không thể xong việc này vào thứ sáu được-ông trông đợi ở tôi quá nhiều đấy!", "eng": "I can't finish this job by Friday-you expect too much of me!"}, {"viet": "Tôi không thể cho anh câu trả lời thiếu cân nhắc.", "eng": "I can't tell you the answer off the top of my head."}, {"viet": "Tôi thấy là hôm nay bạn rất thích chuyến đi của mình.", "eng": "I can see you're enjoying your trip today."}, {"viet": "Tôi không thể tưởng tượng được tại sao cô ấy lại lấy hắn.", "eng": "I can't think why she ever married him."}, {"viet": "Sáng nay tôi không sao làm cho ô tô chạy được.", "eng": "I couldn't get the car to start this morning."}, {"viet": "Tôi muốn đưa họ đi ăn tối.", "eng": "I'd like to take them out to dinner."}, {"viet": "Tôi không thấy nhiều nhà dưới 50000 pao.", "eng": "I didn't see many houses under 50000 pounds."}, {"viet": "Tôi không biết, nhưng dường như đây không phải là phong cách của cậu ấy.", "eng": "I don't know, but it doesn't seem like his style."}, {"viet": "Tôi không phản đối khi anh thỉnh thoảng hút thuốc.", "eng": "I don't mind you smoking occasionally."}, {"viet": "Tôi không muốn khắt khe nhưng cô ấy đâu phải là đầu bếp tài giỏi gì.", "eng": "I don't want to be uncharitable, but she's not a terrible good cook."}, {"viet": "Tôi không ưa cái thói hắn nhìn tôi.", "eng": "I don't like the way he looks at me."}, {"viet": "Tôi giải thích cho anh ấy là tôi đã lỡ xe buýt.", "eng": "I explained to him that I'd missed the bus."}, {"viet": "Tôi cảm thấy mình lại giống hệt một đứa trẻ vậy.", "eng": "I felt just like a kid again."}, {"viet": "Tôi sẵn sàng thừa nhận điều tôi nói là sai.", "eng": "I freely admit that what I said was wrong."}, {"viet": "Tôi đã có được việc làm này nhờ vào sự giới thiệu của anh.", "eng": "I got the job on the strength of your recommendation."}, {"viet": "Tôi đã chuẩn bị xong xuôi những lời phản bác của mình, nhưng Stephens đã ra tay trước tôi.", "eng": "I had my objection all prepared, but Stephens forestalled me."}, {"viet": "Bây giờ tôi có một cuộc gọi trên đường dây khác.", "eng": "I have a call on the other line now."}, {"viet": "Tôi sống ở đó từ khi tôi là một đứa trẻ.", "eng": "I have lived here ever since I was a child."}, {"viet": "20 phút nữa tôi phải có mặt ở sân bay-làm ơn gọi cho tôi một tắc xi.", "eng": "I have to be at the airport in 20 minutes-please call a taxi."}, {"viet": "Tôi đã không ăn gì từ lúc điểm tâm đến giờ.", "eng": "I haven't eaten since breakfast."}, {"viet": "Tôi xem hắn như một kẻ ngu xuẩn.", "eng": "I hold him to be a fool."}, {"viet": "Tôi hi vọng anh vẫn giữ được sự tiến bộ gần đây.", "eng": "I hope you will maintain your recent improvement."}, {"viet": "Con biết, nhưng khi cô gái tuyệt vọng thì buồn nhỉ?", "eng": "I know, but wasn't it sad when the girl was lost?"}, {"viet": "Tôi thích mèo nhưng không may là tôi bị dị ứng với chúng.", "eng": "I like cats but unfortunately I'm allergic to them."}, {"viet": "Ngày mai tôi rời Hồng Kông rồi.", "eng": "I'll be leaving Hong Kong tomorrow."}, {"viet": "Ngày mai tôi sẽ gửi cho anh cái đó qua bưu điện.", "eng": "I'll mail it to you tomorrow."}, {"viet": "Tôi là bạn của ông ấy.", "eng": "I'm a friend of his."}, {"viet": "Tôi sẽ đi Paris vào tuần tới.", "eng": "I'm going to Paris next week."}, {"viet": "Tôi đặc biệt thích tranh sơn dầu.", "eng": "I'm particular to oil paintings."}, {"viet": "Tôi đã tự pha cho mình một tách trà trong khi chờ đợi''Ồ, đừng lo, hoàn toàn tốt thôi!'.", "eng": "I made myself a cup of tea while I was waiting''Oh don't worry, that's quite all right'."}, {"viet": "Tôi phải nghiên cứu kỹ lưỡng tuyến đường trước khi chúng tôi đi.", "eng": "I must gen up on the route before we leave."}, {"viet": "Tôi cần tìm thông tin về công nghiệp ô tô.", "eng": "I need to find information on the car industry."}, {"viet": "Bố chỉ cần đun nước sôi và cho mì ống vào.", "eng": "I only have to boil water and add pasta."}, {"viet": "Tôi vừa bóp cò thì súng nổ.", "eng": "I pulled the trigger and the gun went off."}, {"viet": "Tôi chắc bây giờ anh ấy đã ăn xong rồi.", "eng": "I reckon he must have finished eating by now."}, {"viet": "Tôi đã nói là tôi vui lòng giúp đỡ.", "eng": "I said I should be glad to help."}, {"viet": "Tôi thắc mắc một cách nghiêm chỉnh là liệu chúng ta có nên tiếp tục hay không.", "eng": "I seriously question whether we ought to continue."}, {"viet": "Tôi ngủ để ngỏ cửa sổ trừ khi trời thật lạnh.", "eng": "I sleep with the window open unless It's really cold."}, {"viet": "Tôi giám sát công nhân chất hàng lên xe tải.", "eng": "I supervised the workers loading the lorry."}, {"viet": "Tôi nghĩ tôi đã làm bài thi rất tốt nhưng cuộc phỏng vấn thì thật tai hại.", "eng": "I think I aced the exam, but the interview was murder."}, {"viet": "Tôi nghĩ là lời đề nghị đó đáng được xem xét.", "eng": "I think the suggestion merits consideration."}, {"viet": "Tôi doạ tố cáo nó với cảnh sát.", "eng": "I threatened to expose him to the police."}, {"viet": "Tôi cố nhét rất nhiều trái cây vào tủ lạnh.", "eng": "I try to pack the fridge with lots of fruits."}, {"viet": "Tôi bỏ phiếu không trong cuộc trưng cầu dân ý.", "eng": "I voted No in the referendum."}, {"viet": "Tôi muốn mướn một hộp ký gửi an toàn.", "eng": "I want to rent a safe deposit box."}, {"viet": "Tôi bị tống vào một chiếc xe cảnh sát.", "eng": "I was bundled into a police van."}, {"viet": "Tôi đã đến muộn, nhưng may là cuộc họp chưa bắt đầu.", "eng": "I was late, but fortunately the meeting hadn't started."}, {"viet": "Tôi sững sờ nghe tin anh ta chết.", "eng": "I was stunned by the news of his death."}, {"viet": "Tôi ra thành phố nhưng em tôi ở lại nhà.", "eng": "I went to the city, but my brother remained at home."}, {"viet": "Tôi mong là chúng tôi có thể cách âm được phòng ngủ của mấy đứa con trai!", "eng": "I wish we could sound-proof the boys'bedroom!"}, {"viet": "Tôi tự hỏi không biết anh ấy có bao giờ dừng lại để nghĩ xem tôi đã chịu đựng thế nào chưa.", "eng": "I wondered if he'd ever stopped to think how I felt."}, {"viet": "Tôi muốn đi đến khách sạn Sheraton.", "eng": "I would like to go to the Sheraton Hotel."}, {"viet": "Không đời nào tôi bán bức tranh đó.", "eng": "I wouldn't sell that picture for all the world."}, {"viet": "Nếu như hắn không đi và không có chuyện rắc rối với cảnh sát.", "eng": "If he hasn't gone and got into trouble with the police."}, {"viet": "Tôi có nhất thiết phải tham dự cuộc họp không?", "eng": "If necessary is it really necessary for me to attend the meeting?"}, {"viet": "Nếu mọi việc trở nên xấu, tôi là người thua thiệt chứ không phải anh.", "eng": "If things go wrong I'm the one who'll lose out, not you."}, {"viet": "Nếu quý vị hài lòng với những điều khoản và điều kiện này thì vui lòng đặt hàng với chúng tôi.", "eng": "If you are satisfied with these terms and conditions, please honor us with your orders."}, {"viet": "Nếu có bao giờ cậu quyết định bán xe của cậu, mình mong cậu giành cho mình quyền ưu tiên mua trước.", "eng": "If you ever decide to sell your car, I hope you'll give me first refusal."}, {"viet": "Nếu anh nhắm mắt, anh không thể nhìn.", "eng": "If you shut your eyes, you can not see."}, {"viet": "Hãy tưởng tượng sự ngạc nhiên của chúng tôi khi thấy cô ấy ở đó.", "eng": "Imagine our surprise on seeing her there."}, {"viet": "Trong kinh doanh, ai cũng vì bản thân mình.", "eng": "In business, it's every man for himself."}, {"viet": "Trong cách nói gián tiếp, câu'Nó nói'Tôi sẽ đến'', trở thành'Nó nói rằng nó sẽ đến'.", "eng": "In indirect speech,'He said,'I will come''becomes'He said he would come'."}, {"viet": "Dù bị mù nhưng cô ấy vẫn có thể tự đi được.", "eng": "In spite of her blindness she was able to travel on her own."}, {"viet": "Trong cụm từ a beautiful song, beautiful là tính từ.", "eng": "In the phrase a beautiful song, beautiful is an adjective."}, {"viet": "Ở nước bạn, gần đây có những vụ tai tiếng về chính trị nào đã xảy ra?", "eng": "In your country, what political scandals have occurred recently?"}, {"viet": "Phân biệt đối xử là một vấn đề nghiêm trọng ở nước bạn phải không?", "eng": "Is discrimination a big problem in your country?"}, {"viet": "Đó là chuyện buồn cười nhất tôi chưa từng nghe thấy bao giờ.", "eng": "Is the funniest thing I have ever heard."}, {"viet": "Cái giá này có đủ chắc cho những cuốn sách nặng này không?", "eng": "Is this shelf secure enough for these heavy books?"}, {"viet": "Thật là may, tai nạn xảy ra ở rất gần bệnh viện.", "eng": "It's a mercy the accident happened so close to the hospital."}, {"viet": "Tốt hơn là nên thiên về mặt khoan dung đối với những kẻ phạm tội trẻ tuổi.", "eng": "It's better to err on the side of tolerance when dealing with young offenders."}, {"viet": "Thật khó mà đánh giá khả năng của nó khi chúng tôi chưa tận mắt nhìn thấy công việc nó làm.", "eng": "It's hard to measure his ability when we haven't seen his work."}, {"viet": "Chống lại luật lệ thật vô ích.", "eng": "It's no used kicking against the rules."}, {"viet": "Luật lệ của câu lạc bộ này là không được nói đến tôn giáo và chính trị.", "eng": "It's rule of this club that religion and politics are forbidden and may not be talked about."}, {"viet": "Can thiệp vào chuyện vợ chồng người ta là không khôn ngoan.", "eng": "It's unwise to interfere between husband and wife."}, {"viet": "Việc sử dụng thẻ tín dụng không thích hợp cho tôi.", "eng": "It does not suit me to use credit card."}, {"viet": "Người ta tin rằng Hoàng Đế một trong những ông tổ đất nước được chôn cất ở đó.", "eng": "It is believed that the Yellow Emperor, one of the forefathers of the Chinese Nation, was buried there."}, {"viet": "Chiếc áo cà sa không làm nên nhà sư.", "eng": "It is not the gay coat that makes the gentlemen."}, {"viet": "Có vẻ như hôm nay trời sẽ mưa.", "eng": "It looks like it's going to rain today."}, {"viet": "Đã đến lúc bắn pháo hoa rồi.", "eng": "It's about time for the fireworks."}, {"viet": "Các cô thật tử tế khi trả lại tiền.", "eng": "It's very kind of you to return it."}, {"viet": "Cô ta mất ba tiếng đồng hồ để sửa cái xe đạp của mình.", "eng": "It took her three hours to mend her bicycle."}, {"viet": "Khó khăn lắm tôi mới kìm được nước mắt.", "eng": "It was at much as I could do not to cry."}, {"viet": "Chỉ đến khi tôi làm thủ tục nhận phòng ở khách sạn Hòa Bình tôi mới phát hiện mười ngân phiếu du lịch lên đến 1,000 đô la Mỹ đã bị mất.", "eng": "It was only when I checked in at the Peace Hotel that I found ten traveller's cheques amounting to US $ 1,000 had been lost."}, {"viet": "Sẽ khó cho anh nếu che giấu những bất đồng sau nhiều năm như thế.", "eng": "It will be difficult for you to smooth over your differences after so many years."}, {"viet": "Jackie đã thi đỗ lấy bằng lái xe rồi đấy Anh nói đùa đấy à-cô ta thậm chí lái xe chạy thẳng cũng không nổi!", "eng": "Jackie's passed her driving test, you must be joking-she can't even steer straight!"}, {"viet": "John nghĩ là chúng tôi không thích anh ta, nhưng đó không phải là sự thật.", "eng": "John imagines that we don't like him, but it isn't true."}, {"viet": "Đúng khi anh nghĩ rằng anh đã chứng minh được là ông ấy sai thì ông ta thay đổi lập trường.", "eng": "Just when you think you've proved him wrong, he shifts his ground."}, {"viet": "Việc xây dựng luật sẽ khó khăn và mất nhiều thời gian.", "eng": "Legislation will be difficult and take time."}, {"viet": "Chúng ta hãy vào bếp đi.", "eng": "Let's go to the kitchen."}, {"viet": "Nhiều trận đấu tranh tài được chơi vào ngày Giáng sinh và năm mới.", "eng": "Many bowl games are played around Christmas and New Year's Day."}, {"viet": "Nhiều binh lính đã bị thương trong lúc tháo chạy vì thất bại.", "eng": "Many soldiers fell wounded in their flight from the defeat."}, {"viet": "Vui lòng cho tôi biết là loại trường hợp khẩn cấp gì?", "eng": "May I ask what kind of emergency?"}, {"viet": "Có lẽ kỳ hè tới, con nên đi Pháp.", "eng": "Maybe I should go to France next summer."}, {"viet": "Hầu hết những cuộc họp của chúng tôi đều dành cho việc thảo luận về vấn đề nhà ở.", "eng": "Most of our meeting were devoted to discussing the housing problem."}, {"viet": "Bà Williams biết tất cả những ai lui tới ở nhà hàng xóm.", "eng": "Mrs. Williams next door knows all the comings and goings of everyone in the neighbourhood."}, {"viet": "Điện thoại di động của tôi giống cái của bạn.", "eng": "My cellular phone is the same as yours."}, {"viet": "Bà tôi là một kho thông tin về lịch sử gia tộc chúng tôi.", "eng": "My grandmother is a mine of information about our family's history."}, {"viet": "Bố mẹ tôi không tán thành lối sống Bohemian của tôi.", "eng": "My parents dispparoved of the bohemian life I led."}, {"viet": "Thắng ván cờ làm cho tôi lên tinh thần một chút.", "eng": "My win at chess raised my spirit a little."}, {"viet": "Báo chí phục vụ cho những người thích các chuyện bê bối.", "eng": "Newspapers catering to people's love of scandal."}, {"viet": "Không, chúng tôi học cùng trường trung học.", "eng": "No, we went to high school together."}, {"viet": "Chẳng có quyền gì để làm điều gì.", "eng": "Not have any right to do something."}, {"viet": "Số phiếu cần thiết để được bầu.", "eng": "Number of votes requisite for election."}, {"viet": "Ồ, nghe có vẻ là ý kiến hay đấy.", "eng": "Oh, that sounds a good idea."}, {"viet": "Sau khi cân nhắc kĩ lưỡng, tôi đã quyết định đi bằng tàu hoả.", "eng": "On mature reflection, I've decided to go by train."}, {"viet": "Một nhận xét thiếu thận trọng không đúng lúc có thể phá huỷ toàn bộ kế hoạch.", "eng": "One indiscreet remark at the wrong moment could ruin the whole plan."}, {"viet": "Há miệng của bạn ra to hơn một chút nha sĩ đó nói.", "eng": "Open your mouth a little wider, said the dentist."}, {"viet": "Cái khách sạn nhỏ bẩn thỉu ấy mới trông thấy đã không gây cho chúng tôi mấy tin tưởng.", "eng": "Our first sight of the dingy little hotel did not inspire us with much confidence."}, {"viet": "Giấy tờ của chúng tôi được kiểm tra khi chúng tôi đi qua phòng kiểm tra hộ chiếu ở sân bay.", "eng": "Our papers are checked as we go through passport control at the airport."}, {"viet": "Bên ngoài nhà một đoàn người nối đuôi nhau đang tăng lên.", "eng": "Outside the house a queue was already building."}, {"viet": "Yêu cầu các khách quen để túi lại ở phòng giữ mũ áo.", "eng": "Patrons are requested to leave their bags in the cloakroom."}, {"viet": "Những người đỗ xe trên vỉa hè là kẻ vi phạm trật tự công cộng.", "eng": "People who park on the pavement are a public nuisance."}, {"viet": "Xin hãy cho tôi biết lúc nào tôi có thể đến chỗ anh để lấy thẻ tín dụng về.", "eng": "Please tell me when I can go to your place to fetch my credit card."}, {"viet": "Gần đây chương trình truyền hình nào được yêu thích nhất ở Canada?", "eng": "Recently, what is the most popular T. V. program in Canada?"}, {"viet": "Hẹn gặp lại ông vào ngày thứ năm-lúc ấy chúng ta sẽ có thể thảo luận được việc này.", "eng": "See you on Thursday-we'll be able to discuss it then."}, {"viet": "Cô ta đã nói những lời hứa như vậy trước đấy và chúng không đáng tin lắm.", "eng": "She'd made such promises before, and they didn't carry much conviction."}, {"viet": "Cô ta là một diễn viên giỏi cũng như là một ca sĩ hát hay.", "eng": "She's as good an actress as she is a singer."}, {"viet": "Cô ta có quan niệm nhiệt tình hão huyền về việc cải tạo xã hội.", "eng": "She's got some starry-eyed notion about reforming society."}, {"viet": "Cô ta làm việc đó chỉ vì tốt bụng-cô ấy không có lý do riêng tư gì cả.", "eng": "She's only doing it out of kindness-she's got no particular axe to grind."}, {"viet": "Cô ấy rất bất mãn vì không được tiền thưởng.", "eng": "She's very dissatisfied at not getting a bonus."}, {"viet": "Cô ta đến rất sớm nóng lòng muốn gặp anh ấy.", "eng": "She arrived too early in her impatience to see him."}, {"viet": "Bà ta không thể chịu được một bàn làm việc bừa bãi lộn xộn, mọi thứ phải đâu ra đấy.", "eng": "She cannot bear an untidy desk. everything must be just so."}, {"viet": "Cô ấy cong ngón tay út khi uống trà.", "eng": "She crooked her little finger as she drank her tea."}, {"viet": "Chị ấy lặn xuống dưới nước rồi mấy giây sau lại vụt ngoi lên như một cái nút chai.", "eng": "She dived below the surface, then bobbed up like a cork again a few seconds later."}, {"viet": "Cô ấy lần tìm cái bút chì trong túi xách.", "eng": "She felt around in her bag for a pencil."}, {"viet": "Cô lấy ô đâm vào anh chàng.", "eng": "She gave the man a prod with her umbrella."}, {"viet": "Bà đã được đón tiếp ở tất cả các cung điện của Châu Âu.", "eng": "She had been received at all the courts of Europe."}, {"viet": "Cô ấy đã hết sức yêu mến đứa em nhỏ của mình.", "eng": "She has already formed a strong attachment to her baby brother."}, {"viet": "Cô ta không muốn nói gì nhiều.", "eng": "She hasn't got much to say for herself."}, {"viet": "Cô ta tỏ ra cực kỳ có tay nghề trong cách thực hiện công việc.", "eng": "She is extremely professional in her approach to her job."}, {"viet": "Cô ta chỉ mong được chú ý đến, do đó mới ăn mặc kỳ quặc vậy.", "eng": "She just wants to be noticed, that's why she dresses so strangely."}, {"viet": "Cô ta lốp bóng qua đầu đối phương ra đằng sau sân.", "eng": "She lobbed the ball over her opponent's head to the back of the court."}, {"viet": "Cô ấy đã bịa đặt một câu chuyện giả để che giấu sự thật.", "eng": "She manufactured a false story to hide the facts."}, {"viet": "Cô ta đã có một lời khen rất có duyên về các bức tranh của tôi.", "eng": "She paid me a very charming compliment on my paintings."}, {"viet": "Cô ta yêu anh ta khá nhiều nhưng chưa đủ để lấy anh ta.", "eng": "She quite likes him but not enough to marry."}, {"viet": "Cô ta hơi nguy hiểm cho an ninh quốc gia.", "eng": "She's a poor security risk."}, {"viet": "Cô ta không bao giờ cảm thấy yên tâm.", "eng": "She's never at peace with herself."}, {"viet": "Cô ta đang ngồi ngốn ngấu bánh quy.", "eng": "She sat stuffing herself with biscuits."}, {"viet": "Nàng đã biểu lộ lòng dũng cảm to lớn nhất.", "eng": "She showed courage of the highest order."}, {"viet": "Bà ta đã xúc động nói về tỉ lệ thất nghiệp cao.", "eng": "She spoke with feeling about the high rate of unemployment."}, {"viet": "Cô ta hơi một tí là mếch lòng.", "eng": "She takes offence at the slightest thing."}, {"viet": "Cô ta đã cố gắng nắm những chỉ dẫn, nhưng chẳng hiểu mô tê gì cả.", "eng": "She tried to understand the instructions, but she was completely at sea."}, {"viet": "Chị ấy muốn em nuôi hộ con mèo trong bốn tuần-điều đó hơi quá quắt!", "eng": "She wants you to feed her cats for four weeks-that's a bit steep!"}, {"viet": "Cô ta đang mang một gói sách bọc trong giấy màu nâu.", "eng": "She was carrying a parcel of books done up in brown paper."}, {"viet": "Bà ta đang phơi quần áo giặt lên dây.", "eng": "She was hanging her washing on the line."}, {"viet": "Hôm qua, cô ta chưng diện chiếc áo khoác mới bằng lông thú.", "eng": "She was parading her new fur coat yesterday."}, {"viet": "Chị ấy ngạc nhiên vì sự thông minh của cậu bé.", "eng": "She was surprised by the boy's intelligence."}, {"viet": "Cô ấy đi mà chẳng nhìn gì cả và đâm thẳng vào tôi.", "eng": "She wasn't looking straight into me."}, {"viet": "Cô ấy sẽ không phản đối đâu, cô ấy lành lắm.", "eng": "She won't object, she's so meek and mild."}, {"viet": "Cô ấy quát anh ta về tội say rượu triền miên.", "eng": "She yelled at him about his constant drunkenness."}, {"viet": "Rùng mình khoan khoái trong bồn nước nóng.", "eng": "Shudder with pleasure in a hot bath."}, {"viet": "Singapore là một đất nước đa văn hoá nên chúng ta có thể ăn nhiều loại thức ăn.", "eng": "Singapore is a multi-cultural country so we can eat many kinds of food."}, {"viet": "Những công ty nhỏ bị những công ty khổng lồ nuốt chửng.", "eng": "Small firms being swallowed up by giant corporations."}, {"viet": "Nên bây giờ tôi không bao giờ đeo nó cả.", "eng": "So I never wear it now."}, {"viet": "Khẩn khoản xin thông tin về xa lộ mới.", "eng": "Solicit information about the new motorway."}, {"viet": "Một số nhân viên văn phòng chẳng hạn.", "eng": "Some of the clerical staff, for examples."}, {"viet": "Một số sinh viên bị chết trong vụ nổ.", "eng": "Some students was killed by ( the ) blast."}, {"viet": "Buổi dạ hội tái tạo lịch sử trên nền một tu viện đổ nát.", "eng": "Son et lumière in the grounds of a ruined abbey."}, {"viet": "Sống phiêu bạt ở châu Âu vài năm.", "eng": "Spend a few years knocking about in Europe."}, {"viet": "Ở lại xứ Wales đến hết lễ Nô-en và tết dương lịch.", "eng": "Stay in Wales over Christmas and the New Year."}, {"viet": "Đừng có giở trò ngớ ngẩn nữa, hãy giúp tôi nâng cái này lên đi!", "eng": "Stop playing silly buggers and help me lift this!"}, {"viet": "Chế ngự dục tình của mình bằng cách lao động siêng năng.", "eng": "Sublimating one's sex drive by working hard."}, {"viet": "Đột nhiên thư từ bắt đầu tới-hôm nay lại thêm một cái nữa.", "eng": "Suddenly the letters started arriving-another of them came today."}, {"viet": "Các giám định viên đã thực hiện việc định giá ngôi nhà của chúng tôi.", "eng": "Surveyors carried out a valuation of our house."}, {"viet": "Nhận ai theo sự đánh giá của chính người đó.", "eng": "Take somebody at his own valuation."}, {"viet": "Nài nỉ mẹ chúng cho thêm kẹo.", "eng": "Teasing their mother for more sweets."}, {"viet": "Cám ơn, nhưng thật sự ông không cần phải làm vậy.", "eng": "Thank you, but you really didn't have to."}, {"viet": "Đó quả là điều đáng lo ngại vì có thể chúng ta vô tình xúc phạm đến những người khác.", "eng": "That's the frightening thing about it, that we may not even know we're offending the other party."}, {"viet": "Con chó đó vừa táp chân tôi.", "eng": "That dog just bit me in the leg."}, {"viet": "Người đó không thể cho vào được.", "eng": "That man is not to be admitted."}, {"viet": "Để giữ cái nồi trên bếp lửa.", "eng": "That's for holding a pot over the fire."}, {"viet": "Đó là một trò đánh lừa đê tiện đối với một bà lão.", "eng": "That was a scurvy trick to play on an old lady."}, {"viet": "Những nạn nhân của tai nạn đang được chăm sóc đặc biệt.", "eng": "The accident victims are in intensive care."}, {"viet": "Cánh phi cơ đã có dấu hiệu biểu hiện sự mỏi của kim loại.", "eng": "The aeroplane wing showed signs of metal fatigue."}, {"viet": "Góc giới hạn bởi hai cạnh của một tam giác.", "eng": "The angle contained by two sides of a triangle."}, {"viet": "Vùng Bắc cực, hoang mạc, nhiệt đới, v. v.", "eng": "The Arctic, desert, tropical, etc regions."}, {"viet": "Những câu hỏi có dấu sao có thể được loại bỏ.", "eng": "The asterisked questions may be omitted."}, {"viet": "Nhiệt độ trung bình ở Oxford tháng qua là 18 độ C.", "eng": "The average temperature in Oxford last month was 18 ° C."}, {"viet": "Trường vũ ba lê sẵn sàng dành các suất học miễn phí cho trẻ em có năng khiếu đặc biệt.", "eng": "The ballet school offers free places to children who are exceptionally talented."}, {"viet": "Trận chiến đó là một cuộc tàn sát đẫm máu.", "eng": "The battle was a blood-bath."}, {"viet": "Các vị tai to mặt lớn ở Pari muốn xem nó.", "eng": "The bigwigs in Paris wanted to have a look at it."}, {"viet": "Hội đồng xét xử việc trừng phạt các tù nhân.", "eng": "The boards adjudicate on the punishment of prisoners."}, {"viet": "Cuốn sách đã nhận được nhiều lời phê bình tán thưởng.", "eng": "The book received considerable critical acclaim."}, {"viet": "Cậu bé không xấu hổ trước tiếng cười của các bạn cùng lớp.", "eng": "The boy was not abashed by the laughter of his classmates."}, {"viet": "Các giáo viên Anh ở Trung Quốc được trả lương bằng tiền địa phương.", "eng": "The British teachers in China were paid in local currency."}, {"viet": "Chiếc xe buýt ngừng với một cú giật mạnh.", "eng": "The bus stopped with a jerk."}, {"viet": "Tù binh bị quân đội chiến thắng biến thành nô lệ.", "eng": "The captives were enslaved by the victorious army."}, {"viet": "Chiếc xe ôtô rẽ vòng ở góc phố và mất hút.", "eng": "The car turned round the corner and disappeared from sight."}, {"viet": "Con mèo ngồi không nhúc nhích đợi con chuột chạy.", "eng": "The cat sat motionless, waiting for the mouse to move."}, {"viet": "Sự chuyển của a thành an trước nguyên âm là một hiện tượng xanđi.", "eng": "The change of to an before a vowel is an example of sandhi."}, {"viet": "Đứa trẻ đó lên sáu, gần tới bảy tuổi.", "eng": "The child is six, going on seven years of age."}, {"viet": "Lũ trẻ chưa quen với đời sống ở đô thị.", "eng": "The children are unused to city life."}, {"viet": "Bọn trẻ sung sướng mê hồn khi ông ta nói với chúng về kì nghỉ.", "eng": "The children went into ecstasies when he told them about the holiday."}, {"viet": "Sự lan truyền của tin tức, thông tin, tin đồn, v. v.", "eng": "The circulation of news, information, rumours, etc."}, {"viet": "Sự đóng cửa của nhà máy xe ôtô đã có ảnh hưởng gián tiếp đến các nhà sản xuất lốp xe.", "eng": "The closure of the car factory had a knock-on effect on the tire manufacturers."}, {"viet": "Trường tổ chức các khoá học mùa hè cho người nước ngoài học tiếng Anh.", "eng": "The college runs summer courses for foreign learners of English."}, {"viet": "Công ty đang thăm dò vàng ở khu vực đó.", "eng": "The company are prospecting for gold in that area."}, {"viet": "Người chỉ huy toàn diện, xuất sắc cả về các tác phẩm hợp xướng và giao hưởng.", "eng": "The compleat conductor, excelling in both choral and symphonic works."}, {"viet": "Các thứ trong ngăn kéo bị vung vãi lung tung khắp nơi.", "eng": "The contents of the drawers were strewn all over the place."}, {"viet": "TSPQD của đất nước đã tăng 10% năm nay.", "eng": "The country's GNP has risen by 10% this year."}, {"viet": "Toà đã gửi trát đòi bà ta ra làm chứng.", "eng": "The court subpoenaed her as a witness."}, {"viet": "Đám đông tản mất khi bão nổi lên.", "eng": "The crowd melted away when the storm broke."}, {"viet": "Vết đứt không còn chảy nước nữa và bắt đầu lành rồi.", "eng": "The cut is no longer weeping and is starting to heal."}, {"viet": "Nhìn lại thấy quyết định đó hết sức kỳ cục.", "eng": "The decision seems extremely odd, in retrospect."}, {"viet": "Sự mô tả sản phẩm của nhiều nước có thể che giấu một sự thật.", "eng": "The description product of more than one country can cover a multitude of sins."}, {"viet": "Những quần áo bẩn đang ngâm trong nước xà phòng.", "eng": "The dirty clothes are soaking in soapy water."}, {"viet": "Bác sĩ khám bệnh nhân một cách cẩn thận.", "eng": "The doctor examined her patient carefully."}, {"viet": "Con chó nằm cuộn tròn trước lửa.", "eng": "The dog curled up in front of the fire."}, {"viet": "Bột nhào xẹp dần lại khi trời lạnh.", "eng": "The dough shrank slowly in the cold air."}, {"viet": "Những dư vị của niềm say đắm trước đây.", "eng": "The dying embers of a former passion."}, {"viet": "Giới cử tri đang bắt đầu chán những điệu bộ màu mè của ông ta.", "eng": "The electorate is growing tired of his posturings."}, {"viet": "Việc kết nạp năm thành viên mới.", "eng": "The enrolment of five new members."}, {"viet": "Vai chính biểu diễn rất hay.", "eng": "The excellent performance of the main actor."}, {"viet": "Anh ta đỏ bừng mặt mỗi lần anh nhắc đến tên cô ấy là sự để lộ rõ ràng.", "eng": "The fact that he blushes whenever you mention her name."}, {"viet": "Chúa Cha, Chúa Con và Thánh Thần.", "eng": "The Father, the Son and the Holy Spirit."}, {"viet": "Bộ phim không được người kiểm duyệt xem qua.", "eng": "The film hasn't been viewed by the censor."}, {"viet": "Cuộc giải trí hàng năm của công ty đến nhà hát.", "eng": "The firm's annual outing to the theatre."}, {"viet": "Giải nhất sẽ được trao cho đứa nhỏ nhất trong lớp.", "eng": "The first prize went to the youngest child in the class."}, {"viet": "Sương mù hơi nguy hiểm cho việc lái xe.", "eng": "The fog made driving a bit dicey."}, {"viet": "Mối thông cảm giữa các nhiếp ảnh gia chuyên nghiệp.", "eng": "The freemasonry of professional photographers."}, {"viet": "Bọn du đãng đang điều hành một hệ thống bảo kê cho chúng trong tất cả những thành phố lớn.", "eng": "The gang were running protection rackets in all the big cities."}, {"viet": "Người ta cho rằng hồn ma của Bà Margaret vẫn còn lảng vảng tại nhà thờ này.", "eng": "The ghost of Lady Margaret is supposed to haunt this chapel."}, {"viet": "Chính sách kinh tế của chính phủ là mục tiêu của bao lời chỉ trích trên báo chí.", "eng": "The Government's economic policies have come in for much criticism in the newspapers."}, {"viet": "Chính phủ đã né tránh vấn đề nhân quyền vì họ sợ nó sẽ làm cho họ không được yêu thích.", "eng": "The government have fudged the issue of equal rights because they're afraid it would make them unpopular."}, {"viet": "Chính phủ chắc sẽ đổ trong kì bầu cử tới.", "eng": "The government will probably fall at the next election."}, {"viet": "Mặt đất sụt thẳng ngay chỗ chân chúng tôi.", "eng": "The ground dropped away sheer at our feet."}, {"viet": "Chiến tranh vùng vịnh choán những chỗ khổng lồ trên báo, đài v. v..", "eng": "The Gulf War got massive media coverage."}, {"viet": "Mưa lớn là nguyên nhân của nạn lụt.", "eng": "The heavy rain was the cause of the flood."}, {"viet": "Con ngựa lấy mũi đẩy nhẹ túi tôi.", "eng": "The horse nudged my pocket with its nose."}, {"viet": "Ngôi nhà đã bỏ hoang nhiều năm.", "eng": "The house had been left unoccupied for several years."}, {"viet": "Thân phận con người thân phận nô lệ.", "eng": "The human condition the condition of slavery."}, {"viet": "Sự kiện ấy vẫn còn khắc sâu trong ký ức của nàng qua bao năm nay.", "eng": "The incident remained etched on her memory years."}, {"viet": "Những kẻ xúi giục bạo động trong xã hội của chúng ta.", "eng": "The instigators of violence in our society."}, {"viet": "Miếng thạch rơi tõm vào đĩa.", "eng": "The jelly plopped into the disk."}, {"viet": "Ban giám khảo sắp thông báo tên những người thắng cuộc.", "eng": "The jury are about to announce the winners."}, {"viet": "Mấy thằng cha ở cơ quan đã gửi cho anh tấm bưu thiếp chúc chóng bình phục.", "eng": "The lads at the office have sent you a get-well card."}, {"viet": "Luật cấm không cho dùng phân bón hoá học.", "eng": "The law forbids the use of chemical fertilizers."}, {"viet": "Bức thư đó đã được gởi nhầm đến địa chỉ cũ của chúng tôi.", "eng": "The letter was misdirected to our old address."}, {"viet": "Văn học của một thời đại phản ánh giá trị và thị hiếu của nó.", "eng": "The literature of a period reflects its values and tastes."}, {"viet": "Thời điểm sa sút nhất trong tiến trình hoạt động của công ty.", "eng": "The lower-water mark of the company's fortunes."}, {"viet": "Tinh trùng của con đực thụ tinh trứng của con cái.", "eng": "The male sperm fertilizes the female egg."}, {"viet": "Trận thi đấu thu hút nhiều khán giả.", "eng": "The match attracted a large crowd."}, {"viet": "Cuộc biểu tình tràn ngập đường phố.", "eng": "The meeting overflowed into the street."}, {"viet": "Các khoáng chất cấu tạo thành những tinh thể này tự tạo nên những hình thể đó không cần sự giúp đỡ của ai.", "eng": "The minerals these crystals are made of form into these shapes without anyone's help."}, {"viet": "Số tiền quyên góp được không đủ số lượng yêu cầu.", "eng": "The money collected fell short of the amount required."}, {"viet": "Kiến nghị đã được thông qua với 12 phiếu thuận 10 phiếu chống.", "eng": "The motion was passed by 12 votes to 10."}, {"viet": "Cái tên Curie là một tên rất nổi tiếng.", "eng": "The name Curie is famous."}, {"viet": "Người nhạc trưởng mới khởi sự bằng việc loại bỏ những nhạc công kém khỏi dàn nhạc.", "eng": "The new conductor started by weeding out the weaker players in the orchestra."}, {"viet": "Những đề nghị mới tác động đến cả giới tăng lữ lẫn người thế tục.", "eng": "The new proposals affect both clergy and laity."}, {"viet": "Tin tức được tiếp nhận bằng hoan hô, bằng tiếng la ó, v. v.", "eng": "The news was greeted with cheering, booing, etc."}, {"viet": "Những lời chú giải đã giúp làm sáng tỏ những phần khó nhất của văn bản.", "eng": "The notes helped to elucidate the most difficult parts of the text."}, {"viet": "Chiếc tàu vượt đại dương làm cho chiếc tàu kéo đang kéo nó nhỏ xíu lại.", "eng": "The ocean liner dwarfed the tugs that were towing it."}, {"viet": "Bà già ngồi hàng giờ suy nghĩ một cách u sầu đến nhưng điều có thể xảy ra trong quá khứ.", "eng": "The old lady would sit for hours, thinking sadly of an the might-have-beens."}, {"viet": "Có giá trị hơn sự bất lợi.", "eng": "The opportunity overbalances the disadvantages."}, {"viet": "Chỗ đau ở chân cô ta không đến nỗi làm cô ta không đi được.", "eng": "The pain in her foot wasn't such as to stop her walking."}, {"viet": "Đảng phải cố giành lại cho được sự ủng hộ đã bị mất đi.", "eng": "The party must try to win back the support it has lost."}, {"viet": "Những người hoạt động vì hoà bình đi bộ thành nhóm tới toà nhà quốc hội Hoa Kỳ.", "eng": "The peace activists marched en masse to the capitol."}, {"viet": "Những chuyện áp chế lặt vặt trong công việc nội trợ hàng ngày.", "eng": "The petty tyrannies of domestic routine."}, {"viet": "Phi công của cơ thể chúng ta là bộ não.", "eng": "The pilots of our bodies are our brains."}, {"viet": "Những người lập kế hoạch đã không chuẩn bị đối phó với sự trục trặc trong hệ thống năng lượng.", "eng": "The planners had not provided for a failure of the power system."}, {"viet": "Sự mát mẻ dễ chịu của buổi tối.", "eng": "The pleasant cool of the evening."}, {"viet": "Cảnh sát không có nhiều chứng cớ để dựa vào.", "eng": "The police don't have much evidence to go on."}, {"viet": "Cảnh sát tìm kiếm trong phạm vi 2 km.", "eng": "The police searched within a radius of two kilometers."}, {"viet": "Ban nhạc pop chạy ra xe ô tô, đằng sau là nhóm người hâm mộ đuổi theo hò reo ầm ĩ.", "eng": "The pop group raced for their cars, pursued by fans in full cry."}, {"viet": "Sự ưu trội của màu xanh trong cách phối hợp màu này.", "eng": "The predominance of blue in the colour scheme."}, {"viet": "Tổng thống bình tĩnh trong suốt cuộc khủng hoảng toàn cầu.", "eng": "The President was calm throughout the global crisis."}, {"viet": "Thủ tướng cải tổ lại nội các.", "eng": "The prime minister reshuffled the cabinet."}, {"viet": "Vấn đề tiêu chuẩn hoá cách dùng gạch nối trong từ ghép.", "eng": "The problem of the standardization of the use of hyphens in compounds."}, {"viet": "Tỷ lệ đỗ so với trượt trong kỳ thi mãn khóa.", "eng": "The proportion of passes to failures in the final examination."}, {"viet": "Loại nhung màu tím được làm ở Thiên Tân.", "eng": "The purple one is made in Tianjin."}, {"viet": "Chiếc Radiô đó phát ra nhạc pop om sòm.", "eng": "The radio blared out pop music."}, {"viet": "Những người nổi loạn đã trở về nhà do có lệnh tổng ân xá.", "eng": "The rebels returned home under a general amnesty."}, {"viet": "Tiền thuê nhà đã tới kỳ trả, do đó tấm ngân phiếu của anh đến thật sự như của trời cho!", "eng": "The rent was due, so your cheque came as an absolute godsend!"}, {"viet": "Kết quả của chính sách này sẽ còn không chắc chắn trong một thời gian.", "eng": "The results of this policy will remain dubious for some time."}, {"viet": "Con sông này chảy vào một cái hồ.", "eng": "The river runs into a lake."}, {"viet": "Mái nhà bị đạn bắn thủng lỗ chỗ.", "eng": "The roof was riddled with bullet holes."}, {"viet": "Vận động viên chạy tăng tốc độ khi anh ta đến gần đích.", "eng": "The runner spurted as he approached the line."}, {"viet": "Vụ bê bối đó đã làm giảm rất nhiều uy tín của ông ta trước quần chúng.", "eng": "The scandal took away greatly from his public image."}, {"viet": "Biển dần dần lặng sóng khi con tàu của chúng tôi ra khơi xa.", "eng": "The sea gradually calmed down as we steamed out."}, {"viet": "Viên trung sĩ hất hai vai lại sau và ưỡn ngực ra.", "eng": "The sergeant threw his shoulders back and his chest out."}, {"viet": "Khi cơn bão ngớt, con tàu nhổ neo.", "eng": "The ship sailed when the storm had abated."}, {"viet": "Phim quay từ từ lướt ngang cảnh gian phòng.", "eng": "The shot panned slowly across the room."}, {"viet": "Tình hình ở ngoài đường phố trở thành đe dọa.", "eng": "The situation in the streets was turning ugly."}, {"viet": "Cây hoa tuyết vừa mới bắt đầu mọc.", "eng": "The snowdrops are just beginning to come up."}, {"viet": "Tiếng gió xào xạc trong các rặng cây.", "eng": "The sough of the wind in the trees."}, {"viet": "Lòng thì muốn nhưng sức không cho phép, lực bất tòng tâm.", "eng": "The spirit is willing but the flesh is weak."}, {"viet": "Chiếc tàu hơi nước đi lại đều đặn giữa hai bờ sông đối diện nhau.", "eng": "The steamer plied between opposite shores of the river."}, {"viet": "Sự căng thẳng của việc học thi làm cậu ta phát ốm.", "eng": "The stress of working for examination made him ill."}, {"viet": "Toàn bộ tri thức của loài người về chủ đề này.", "eng": "The sum of human knowledge on this subject."}, {"viet": "Tòa nhà cao tròn là hầm ủ thức ăn tươi.", "eng": "The tall round building are silos."}, {"viet": "Các giáo viên trực đi dạo quanh kiểm tra trường trong giờ ăn trưa.", "eng": "The teachers on duty me policing the school buildings during the lunch hour."}, {"viet": "Những kẻ khủng bố đã tăng cường chiến dịch đánh bom của chúng.", "eng": "The terrorists have intensified their bombing campaign."}, {"viet": "Thuỷ triều tràn vào làm ở đây nước dâng lên đột ngột.", "eng": "The tide comes in with a sudden rush here."}, {"viet": "Thành phố tràn ngập đầy bùn nhớp nháp.", "eng": "The town was deluged with thick slimy mud."}, {"viet": "Cây bên đường nặng trĩu hoa vàng.", "eng": "The trees along the road were heavy with yellow blossoms."}, {"viet": "Hai sự kiện này chẳng hề liên quan gì với nhau.", "eng": "The two events are totally unconnected."}, {"viet": "Liên đoàn đồng lòng bãi công.", "eng": "The union decided unanimously to go on strike."}, {"viet": "Mật thất đo được 210 mét từ đông sang tây và 62 mét từ bắc xuống nam.", "eng": "The vault measures 210 meters from east to west and 62 meters from north to south."}, {"viet": "Ngoài tiền lương những người hầu bàn còn nhận được tiền buộc boa hậu hĩnh.", "eng": "The waiters get good tips over and above then wages."}, {"viet": "Thời tiết có ảnh hưởng không tốt đến sự thành công của kế hoạch của chúng tôi.", "eng": "The weather militated against the success of our plans."}, {"viet": "Gió thổi dữ dội đến nỗi không thể đi ngược lại được.", "eng": "The wind's blowing with a vengeance it's almost impossible to walk against it."}, {"viet": "Từ duckling là một hậu tố giảm nhẹ, được tạo nên từ duck.", "eng": "The word duckling is a diminutive, formed from duck."}, {"viet": "Năm kia anh ta đã giành được một huy chương vàng và năm trước nữa anh được huy chương bạc.", "eng": "The year before last he won a gold medal, and the year before that he won the silver."}, {"viet": "Nhiệt tình của họ đã giảm xuống từ khi họ phát hiện ra cái giá phải trả.", "eng": "Their enthusiasm has toned down since they discovered the cost."}, {"viet": "Trường của họ thách thức trường chúng tôi thi đấu bóng đá.", "eng": "Their school challenged ours to a football match."}, {"viet": "Sau đó, chúng tôi có thể thiết kế một hệ thống cho anh, thiết kế một hệ thống tốt nhất cho anh.", "eng": "Then we can design a system for you, design the best system for you."}, {"viet": "Có chỗ cho anh ký ở đây.", "eng": "There's a space here for your signature."}, {"viet": "Giá của hai máy tính cũng không chênh lệch nhau nhiều lắm.", "eng": "There's not much difference in price between the two computers."}, {"viet": "Có bánh bích quy trên bàn ở trong phòng ăn đấy.", "eng": "There are cookies on the table in the dining room."}, {"viet": "Có một vài vấn đề quan trọng chúng ta cần phải bàn.", "eng": "There are several important matters we must discuss."}, {"viet": "Gần đây các vị chánh án có khuynh hướng xử nặng.", "eng": "There has been a recent trend among judges towards giving more severe punishments."}, {"viet": "Có một bài thơ về Mẹ Ngỗng trả lời câu hỏi này.", "eng": "There is a Mother Goose rhyme that gives an answer to this question."}, {"viet": "Không có đủ sáng và tối trong bức vẽ của anh.", "eng": "There is not enough light and shade in your drawing."}, {"viet": "Có sự hoang mang lo bom nổ trong buổi diễu hành.", "eng": "There was a bomb scare during the procession."}, {"viet": "Không thể tránh được mức độ tạo tình huống nào đó trong cuộc thí nghiệm.", "eng": "There was inevitably a degree of artificiality about the experiment."}, {"viet": "Có bảy phiếu tán thành kế hoạch và ba phiếu chống lại nó.", "eng": "There were seven votes for the plan and three votes against it."}, {"viet": "Mây này đôi lúc trông giống như cuộn khói.", "eng": "These clouds sometimes look like curls of smoke."}, {"viet": "Những người dân ấy, giờ đây chúng ta gọi là những người hang động.", "eng": "These people we now call the cave men."}, {"viet": "Họ là những người ưu tú-rồi anh sẽ thích họ.", "eng": "They're first-class people-you'll like them."}, {"viet": "Họ đồng ý phân xử những sự bất đồng giữa họ.", "eng": "They agreed to arbitrate their differences."}, {"viet": "Họ đi sang Pháp qua đường London.", "eng": "They are travelling to France by way of London."}, {"viet": "Họ tính với tôi cái giá cắt cổ cho một công việc đơn giản.", "eng": "They charged me extortionately for a simple job."}, {"viet": "Họ không hiểu rằng thân xác sẽ già đi nhưng còn trí tuệ thì không.", "eng": "They don't comprehend that the body gets old, but not the mind."}, {"viet": "Họ để cho con cái họ rất tự do.", "eng": "They give their children a great deal of liberty."}, {"viet": "Người ta phải nạo vét con kênh cho tàu bè có thể đi lại được!", "eng": "They have to dredge the canal so that ships can use it!"}, {"viet": "Họ có làm một ít vũ khí bằng xương, nhưng phần lớn vũ khí của họ vẫn làm bằng đá.", "eng": "They made some weapons of bone, but they still made most of their weapons of stone."}, {"viet": "Họ dự định làm lễ kết hôn vào mùa hè.", "eng": "They plan to get married in the summer."}, {"viet": "Người ta cho rằng toát được mồ hôi ra là khỏi cảm lạnh.", "eng": "They say a good sweat will cure a cold."}, {"viet": "Họ đề nghị phải tiến hành cuộc tấn công.", "eng": "They suggest that an attack should be made."}, {"viet": "Chúng run sợ đến gặp cô giáo để nói cho cô biết là chúng đã đánh vỡ kính cửa sổ.", "eng": "They went to the teacher in fear and trembling to tell her that they'd broken a window."}, {"viet": "Họ đã nhanh chóng đáp lại lời kêu cứu của chúng tôi.", "eng": "They were prompt to respond our call for help."}, {"viet": "Hãy nghĩ xem bố mẹ đứa bé bị bắt cóc đau khổ đến thế nào.", "eng": "Think how much the parents of the kidnapped boy must have suffered."}, {"viet": "Lâu đài này có từ thế kỷ 14.", "eng": "This castle dates from the 14th century."}, {"viet": "Vụ giết người khủng khiếp này chắc chắn là hành động của một người điên.", "eng": "This dreadful murder is surely the act of a madman."}, {"viet": "Đây là một cuốn sách về thực hành kinh doanh đối lại với lí thuyết.", "eng": "This is a book about business practice as opposed to theory."}, {"viet": "Đây là cái gói mà chúng tôi đã mong đợi ( từ New York tới ).", "eng": "This is the parcel which we have been expecting ( from New York )."}, {"viet": "Phương pháp này có hai cái lợi: trước hết nó rẻ hơn và sau là nó nhanh hơn.", "eng": "This method has two advantages: first it is cheaper and second it is quicker."}, {"viet": "Tấm phim kính này bị hỏng rồi-in ra sẽ không rõ lắm.", "eng": "This plate has been damaged-it won't print very well."}, {"viet": "Con bé hớt lẻo này bị cả lớp ghét.", "eng": "This sneaky girl was disliked by the rest of the class."}, {"viet": "Đây là một giai đoạn quan trọng trong sự phát triển của đất nước.", "eng": "This was an important stage in the country's development."}, {"viet": "Hàng ngàn người đang bị chết đói ở Châu Phi.", "eng": "Thousands of people are starving in Africa."}, {"viet": "Tom bỏ đi theo một hướng còn Harry theo một hướng khác.", "eng": "Tom went off in one direction and Harry in another."}, {"viet": "Các công đoàn xem ý định của chính phủ muốn cấm việc làm thêm giờ là có thể dẫn đến những biện pháp nghiêm trọng hơn.", "eng": "Unions regard the government's intention to ban overtime as the thin end of the wedge."}, {"viet": "Có phải quan toà đã quá khắt khe đối với tên ăn cắp không?", "eng": "Was the judge too severe on the thief?"}, {"viet": "Chúng ta sẽ phải tìm ra một cái cớ để không đi dự liên hoan.", "eng": "We'll have to find a pretext for not going to the party."}, {"viet": "Chúng ta gặp khó khăn khi cứ phải trả mãi món tiền thế chấp.", "eng": "We're having difficulty keeping up our mortgage payments."}, {"viet": "Chúng tôi đã có thiết bị trực tuyến khoảng một năm nay.", "eng": "We've been on-line for about a year now."}, {"viet": "Chúng tôi làm như thể nó là một vụ cháy thật.", "eng": "We act as if it's a real fire."}, {"viet": "Chúng tôi ở trong một tình thế khó khăn hơn bao giờ hết.", "eng": "We are in a worse predicament than ever."}, {"viet": "Hai chúng tôi thích nhau ngay từ đầu.", "eng": "We both liked each other right off the bat."}, {"viet": "Chúng ta chỉ có thể đạt tới thoả thuận được nếu như cả hai chúng ta nói rõ hết ý định của mình, không úp mở.", "eng": "We can only reach agreement if we both put our cards on the table."}, {"viet": "Chúng tôi muốn thưởng thức cảnh vật buổi tối.", "eng": "We'd like to enjoy the evening view."}, {"viet": "Chúng tôi mong nhận được một tiền lương công nhật xứng đáng với ngày công lao động.", "eng": "We expect a fair day's wage for a fair day's work."}, {"viet": "Hôm nay chúng tôi đã nhận được một bức điện tín từ New York nói rằng ông Charles Caruso sẽ đến vào ngày mai, sớm hơn dự tính một ngày.", "eng": "We had a wire from New York today saying that Mr. Charles Caruso is arriving tomorrow, a day earlier than expected."}, {"viet": "Chúng tôi đã hoạt động được năm năm và có uy tín rất tốt trong lĩnh vực này.", "eng": "We have been established for five years and have a very good reputation in this field."}, {"viet": "Hôm nay, chúng tôi đã gửi tới ngài bản vựng tập mới của chúng tôi.", "eng": "We have today forwarded you our new catalogue."}, {"viet": "Chúng tôi đã trải qua suốt mùa hè tại bãi biển.", "eng": "We lingered away the summer at the beach."}, {"viet": "Chúng ta phải đi về thôi, đã quá nửa đêm rồi.", "eng": "We must be getting home, it's past midnight."}, {"viet": "Chúng ta cần có một tiêu chuẩn so sánh để đánh giá buổi biểu diễn.", "eng": "We need a yardstick to measure our performance by."}, {"viet": "Chúng tôi đã đi vào một màn sương mù dày đặc ngay bên ngoài Edinburgh.", "eng": "We ran into a patch of thick fog just outside Edinburgh."}, {"viet": "Chúng tôi sẽ không giữ ông quá năm phút đâu.", "eng": "We shall not keep you more than five minutes."}, {"viet": "Chúng tôi đã đi khắp các cánh đồng để tìm con cừu lạc.", "eng": "We through the fields, looking for stray sheep."}, {"viet": "Chúng tôi đi xem phim và không đi đâu nữa.", "eng": "We went to the cinema and nowhere else."}, {"viet": "Chúng tôi đang nóng nực trong bộ quần áo mùa đông.", "eng": "We were sweltering in our winter clothes."}, {"viet": "Mặc chiếc áo dài kiểu không đặc biệt.", "eng": "Wearing a dress of no particular description."}, {"viet": "À, nếu cả hai anh cứ khăng khăng như thế thì tôi sẽ đồng ý với các anh.", "eng": "Well, if you both insist, I'll go along with you."}, {"viet": "Bạn có thể đổi nó cho cửa hàng được không?", "eng": "Were you able to trade it in?"}, {"viet": "Còn nhãn hiệu thuốc lá này thì sao ạ?", "eng": "What about this brand of cigarettes?"}, {"viet": "Vậy việc chúng ta nhìn thấy các chòm sao nào khi nhìn lên bầu trời, còn tùy thuộc vào thời gian nào trong năm nữa.", "eng": "What constellations we see when we look up at the sky depends partly, when, on what time of year it is."}, {"viet": "Bạn cảm thấy thế giới sẽ đối mặt với những vấn đề gì về môi trường trong tương lai gần?", "eng": "What environmental problems do you feel the world will face in the near future?"}, {"viet": "Dự báo thời tiết cho ngày mai ra sao?", "eng": "What is the forecast for tomorrow?"}, {"viet": "Cái cầu này làm bằng vật liệu gì?", "eng": "What kind of material is the bridge made of?"}, {"viet": "Đội bóng ở trong tình trạng thế nào sau khi thất bại?", "eng": "What shape is the team in after its defeat?"}, {"viet": "Những điều ông nói chung quy là một lời buộc tội trực tiếp.", "eng": "What you say amounts to a direct accusation."}, {"viet": "Khi anh ấy đọc diễn văn anh ấy bắt đầu bằng cách nói Thưa quý bà và quý ông.", "eng": "When he made a speech he began by saying Ladies and gentlemen."}, {"viet": "Khi mua một món hàng của Mỹ, bạn phải ý thức rằng, trong hầu hết mọi trường hợp, giá trên nhãn không phải là giá mà bạn phải trả tiền.", "eng": "When making a purchase in the U. S., you should be aware that, in most cases, the price on the label is not the price you pay."}, {"viet": "Khi nhiều tro chung quanh đống lửa, họ cũng gạt tro sang một bên và phủ lên những bộ xương này.", "eng": "When there were too many ashes around the fire, they pushed these aside, too, and covered up the bones."}, {"viet": "Những đồ để vá lỗ thủng đâu rồi?", "eng": "Where's the doings for mending punctures?"}, {"viet": "Anh ta đúng hay không còn là điều không chắc chắn.", "eng": "Whether he was right or not is arguable."}, {"viet": "Anh dán nhãn vào mặt nào của hộp?", "eng": "Which side of the box do you put the label on?"}, {"viet": "Ông nói ông làm nghề gì ạ?", "eng": "Who did you say you are?"}, {"viet": "Tại sao anh lại bị rớt kì thi lấy bằng lái Tôi vượt đèn đỏ.", "eng": "Why did you fail your driving test I went through a red light."}, {"viet": "Tại sao lại phải tách người tàn tật ra khỏi người lành mạnh?", "eng": "Why should the handicapped be segregated from the able-bodied?"}, {"viet": "Xin cô giữ hành lý giúp tôi nhé?", "eng": "Will you keep my luggage for me?"}, {"viet": "Với tất cả tiền bạc và các bạn là diễn viên điện ảnh, cô ta quả thực sống một cuộc đời đầy thú vị.", "eng": "With all her money and film-star friends, she really lives her life in the fast lane."}, {"viet": "Loại bỏ trọng lượng thừa bằng tập thể dục đều đặn.", "eng": "Work off excess weight by regular exercise."}, {"viet": "Ông có muốn tôi nhắn cho anh ấy điều gì không?", "eng": "Would you like me to tell him something?"}, {"viet": "Ông làm ơn ký duyệt những ngân phiếu của ngân hàng SanWa được không?", "eng": "Would you please countersign these Sanwa Bank's cheques?"}, {"viet": "Nhiều năm nghiên cứu đã thất bại không tìm ra được cách điều trị căn bệnh.", "eng": "Years of research work have failed to produce a cure for the disease."}, {"viet": "Vâng, quy trình làm tranh chép lại rất phức tạp.", "eng": "Yes, the process of making a reproduction is quite complicated."}, {"viet": "Anh sẽ được món lãi khá về những cổ phần này.", "eng": "You'll get a good return on these shares."}, {"viet": "Anh không có khả năng nói tiếng Trung Quốc hơn tôi.", "eng": "You're no more capable of speaking Chinese than I am."}, {"viet": "Người ta đề nghị anh ( vui lòng ) không hút thuốc.", "eng": "You are ( kindly ) requested not to smoke."}, {"viet": "Anh không thể tự mình nhấc nó lên ( mà không có sự giúp đỡ ).", "eng": "You can't lift that by yourself ( without help )."}, {"viet": "Anh có thể nghe tường thuật bóng đá trong phòng ngủ.", "eng": "You can listen to the football game in the bedroom."}, {"viet": "Anh đáng được hưởng một ngày nghỉ sau tất cả những công việc vất vả của anh.", "eng": "You deserve a holiday after all your hard work."}, {"viet": "Bạn suy nghĩ cũng lâu rồi, đã đến lúc quyết định đi.", "eng": "You have pondered long enough, it is time to decide."}, {"viet": "Trong cháu khoảng cỡ số 10.", "eng": "You look like you're about a size ten."}, {"viet": "Anh hẳn là đã uống ngót một chai rượu tối qua.", "eng": "You must have drunk the best part of a bottle of wine last night."}, {"viet": "Anh quay tay quay này để vận hành cỗ máy.", "eng": "You operate the mechanism by winding this handle."}, {"viet": "Bạn không nên hỏi gì về tuổi tác, tình trạng hôn nhân, hay bất cứ gì riêng tư của vị khách đó.", "eng": "You should not ask about the guest's age, marital status, or anything private."}, {"viet": "Anh muốn một hệ thống giao thông công cộng.", "eng": "You want a public transport system."}, {"viet": "Các diễn viên trẻ dự tuyển để trở thành ngôi sao.", "eng": "Young actors who are candidates for stardom."}, {"viet": "Mẹ anh mà nghe được chuyện này bà ấy sẽ nổi khùng lên.", "eng": "Your mother will be furious if she gets to hear of this."}]