[{"viet": "Một chiếc máy bay lớn đậu trên đường băng là một bộ máy tuyệt diệu.", "eng": "A big airplane standing on the runway is a wonderful machine."}, {"viet": "Một cá tính nổi bật nét chân thật và hồn nhiên.", "eng": "A character marked by frankness and simplicity."}, {"viet": "Một chất tổng hợp được sử dụng làm chất liệu lót sàn.", "eng": "A composition used as flooring material."}, {"viet": "Một cái đập chặn dòng nước của một con sông phải kiên cố.", "eng": "A dam to hold back a river has to be very strong."}, {"viet": "Cần phải đưa chó ra ngoài đi dạo mỗi ngày.", "eng": "A dog needs to be taken out for a walk every day."}, {"viet": "Một đồng lúa mì bị bão thổi rạp xuống.", "eng": "A field of wheat flattened by storms."}, {"viet": "Cùng một chất lượng trái cây chung cho tất cả rượu làm từ loại nho này.", "eng": "A fruity quality is common to all wine made from this grape."}, {"viet": "Một thống đốc đã tạm giữ lại những món tiền được dành cho các thành phố và thị trấn sử dụng.", "eng": "A governor who impounded monies designated for the use of cities and towns."}, {"viet": "Một hàng rào cao bao quanh trại tù.", "eng": "A high fence ringed the prison camp."}, {"viet": "Một nhà báo có tài săn tin rất chính xác.", "eng": "A journalist with an infallible nose for a story."}, {"viet": "Một lá thư đầy những lời phàn nàn và than thân trách phận.", "eng": "A letter full of complaints and self-pity."}, {"viet": "Bức tường thấp sẽ phân định vườn nhà ta với vườn của nhà hàng xóm.", "eng": "A low brick wall divide our garden from and our neighbour's garden."}, {"viet": "Cuộc họp mặt sĩ quan cao cấp nhất trong quân đội.", "eng": "A meeting of the most senior army officers."}, {"viet": "Một nước kiệt quệ do một nỗ lực đuổi theo chiến tranh.", "eng": "A nation devitalized by a sustained war effort."}, {"viet": "Một y tá đã luôn túc trực để săn sóc.", "eng": "A nurse was in constant attendance."}, {"viet": "Một nhân vật không cần phải giới thiệu vì quá nổi tiếng.", "eng": "A person who needs no introduction."}, {"viet": "Một nhà chính trị được đánh giá qua phương pháp xử lý thực tiễn của anh ta.", "eng": "A politician valued for his pragmatic approach."}, {"viet": "Một quán rượu gần giao lộ của đường Công Lý và đại lộ Lê Lợi.", "eng": "A pub near the junction of Cong Ly Road and Le Loi Avenue."}, {"viet": "Một việc tiếp tục chiến sự, các hoạt động, các cuộc đàm phán.", "eng": "A resumption of hostilities, activities, negotiations."}, {"viet": "Một trường học dành cho những người khuyết tật nặng.", "eng": "A school for the severely handicapped."}, {"viet": "Một đợt ngắn chiếu các phim câm xuất sắc vào các chiều thứ bảy.", "eng": "A short season of silent film classics on Saturday afternoons."}, {"viet": "Người lính phải tuân lệnh những sĩ quan cấp trên của anh ta.", "eng": "A soldier must obey his superior officers."}, {"viet": "Một chuyện sốt dẻo trên báo chí.", "eng": "A story that is hot off the press."}, {"viet": "Một chiếc máy hát băng vẫn còn có nhiều lợi ích.", "eng": "A tape player that still has a lot of mileage left."}, {"viet": "Chẳng hạn một du khách có thể không nhìn thấy bất cứ một người đàn ông nào mặc váy ngắn tại Scotland.", "eng": "A traveler in Scotland, for instance, might not see any man wearing kilts."}, {"viet": "Một lớp nhựa không thấm nước phủ trên tấm kim loại.", "eng": "A waterproof plastic skin on a metal sheet."}, {"viet": "Một ngôi nhà thờ ở thế kỷ 16 với những nét trang hoàng của thế kỷ 18.", "eng": "A16th century church with 18th century embellishment."}, {"viet": "Thực sự thì căn nhà của họ không khác với căn riêng của chúng tôi.", "eng": "Actually, their house is not unlike our own."}, {"viet": "Sau một thời gian, việc lái xe trở thành bản năng tự nhiên đối với anh.", "eng": "After a while, driving becomes second nature to you."}, {"viet": "Sau khi thanh toán hết mọi hóa đơn, tôi thấy là mình đã tiêu hết năm bảng Anh.", "eng": "After paying all the bills, I found myself £ 5 down."}, {"viet": "Sau khi sách và bìa đã được chuẩn bị xong, người ta ghép cả hai vào với nhau.", "eng": "After work is finished on the book and on the covers, the two are brought together."}, {"viet": "Tất cả ngựa là động vật nhưng không phải tất cả động vật là ngựa.", "eng": "All horses are animals, but not all animals are horses."}, {"viet": "Tất cả vẻ oai nghiêm của những nghi lễ hoàng gia.", "eng": "All the majesty of royal ceremonies."}, {"viet": "Mặc dù cô ta chẳng nói gì cả nhưng tôi biết rằng cô ta không thích ý kiến đó.", "eng": "Although she didn't say anything, I sensed that she didn't like the idea."}, {"viet": "Một chính quyền đầy tham nhũng.", "eng": "An administration riddled with corruption."}, {"viet": "Một ngày khởi hành sớm không thuận tiện cho chúng tôi.", "eng": "An early departure date is inconvenient for us."}, {"viet": "Một cuộc khảo sát bao quát các vấn đề thế giới.", "eng": "An inclusive survey of world affairs."}, {"viet": "Cửa sổ mở là sự mời mọc các tên trộm.", "eng": "An open window is an invitation to burglars."}, {"viet": "Và cuối cùng nhưng không kém phần quan trọng là vấn đề tài trợ đầy đủ.", "eng": "And last but not least there is the question of adequate funding."}, {"viet": "Một cuộc nghiên cứu khác cho thấy là các phụ nữ đã phục vụ tại Việt Nam vẫn còn phải đấu tranh với sự chán nản, lo âu và với những hình ảnh quá khứ đau thương của cuộc chiến tranh hiện rõ trong trí óc họ.", "eng": "Another study shows that women who served in Vietnam still struggle with depression, anxiety, and painful flashbacks from the war."}, {"viet": "Sự nồng nhiệt ngưỡng mộ của cô ta đối với người nghệ sĩ.", "eng": "Ardent in her admiration of the artist."}, {"viet": "Bạn có quan tâm đến các vấn đề môi trường không?", "eng": "Are you concerned with environmental problems?"}, {"viet": "Con định kể cho mẹ nghe gì đó phải không?", "eng": "Are you trying to tell me something?"}, {"viet": "Với tư cách là một diễn viên, một ca sĩ, và một nghệ sĩ xiếc tung hứng, cô ta đủ khả năng cho vai đó bằng ba cách.", "eng": "As an actor, a singer and a juggler, she was triply qualified for the role."}, {"viet": "Khi xe lửa bắt đầu chuyển bánh, một luồng gió lùa vào làm chúng tôi mát rượi.", "eng": "As the train began to move, a pleasant draught cooled us all down."}, {"viet": "Theo lệnh của cha, nó đã viết thư cho luật sư.", "eng": "At his father's bidding he wrote to his lawyer."}, {"viet": "Chăm lo những nhu cầu cấp bách của ai.", "eng": "Attend to somebody's instant needs."}, {"viet": "Nhạy bén với những sắc thái của ý nghĩa.", "eng": "Be able to react to nuances of meaning."}, {"viet": "Được tái nhận làm thành viên của Liên Hiệp Quốc.", "eng": "Be readmitted to the united Nations."}, {"viet": "Có thái độ trang nghiêm đúng cách trong một phiên toà.", "eng": "Behave with due gravity in a court of law."}, {"viet": "Chim chóc đang hót líu lo ngoài kia.", "eng": "Birds were singing away happily outside."}, {"viet": "Muốn đứt hơi sau khi chạy lên cầu thang.", "eng": "Breathless after running up the stairs."}, {"viet": "Chôn cất một người theo đúng nghi lễ quân đội.", "eng": "Bury a person with full military honours."}, {"viet": "Nhưng phải mất khoảng 10 ngày để gom số tiền thu được nếu ngân phiếu đó được ký phát ở ngân hàng Luôn Đôn.", "eng": "But it will take about ten days to collect the proceeds if the cheque is drawn on London bank."}, {"viet": "Mua vàng để phòng ngừa lạm phát.", "eng": "Buy gold as a hedge against inflation."}, {"viet": "Theo tập quán người ta thường trêu chọc nhau vào ngày 1 tháng Tư.", "eng": "By tradition, people play practical jokes on 1 April."}, {"viet": "Tôi có thể thanh toán bằng chi phiếu du lịch được không?", "eng": "Can I pay with traveller's check?"}, {"viet": "Em tìm xem có chỗ nào ngồi được không?", "eng": "Can you find somewhere to squat?"}, {"viet": "Cô có thể cho tôi biết tôi đang ở đâu trên bản đồ này không?", "eng": "Can you show me where I am on this map?"}, {"viet": "Bị cuốn vào trong làn sóng cuồng loạn.", "eng": "Carried along on tidal wave of hysteria."}, {"viet": "Giữ trong lòng kỷ niệm về người mẹ đã qua đời.", "eng": "Cherish the memory of one's dead mother."}, {"viet": "Cho rằng tình dục và bạo lực trên truyền hình dẫn đến sự đồi trụy của giới trẻ.", "eng": "Claiming that sex and violence on TV led to the corruption of young people."}, {"viet": "Nào, hãy xử sự công bằng một chút-Anh đã sử dụng máy vi tính lâu quá rồi, bây giờ đến lượt tôi chứ.", "eng": "Come on, fair dos-You've a long go on the computer and now it's my turn."}, {"viet": "Những vụ xung đột và tranh chấp vẫn còn phải được giải quyết.", "eng": "Conflicts and frictions that have still to be resolved."}, {"viet": "Tôi có thể phỏng vấn cô về tiệm giặt tự động này được không?", "eng": "Could I interview you about this Laundromat?"}, {"viet": "Cô có thể chỉ tôi đường đi đến đó trên bản đồ này không?", "eng": "Could you show me the way there on this map?"}, {"viet": "Khách hàng sẽ có ấn tượng sâu sắc trước khả năng lành nghề của các nhân viên được đào tạo kỹ càng của chúng tôi.", "eng": "Customers will be impressed by the expertise of our highly trained employees."}, {"viet": "Ngay trong thâm tâm họ cũng muốn những điều giống như nhau.", "eng": "Deep down, they all want the same thing."}, {"viet": "Mặc dù dự báo thời tiết tốt, sáng hôm sau trời vẫn mưa như thường.", "eng": "Despite the good weather forecast, the next morning was as wet as ever."}, {"viet": "Anh có nghe thấy cái gì sột soạt trong bụi cây không?", "eng": "Did you hear something rustling through the bushes?"}, {"viet": "Thoát khỏi các trách nhiệm về tài chính, những điều cam kết với xã hội.", "eng": "Disencumber oneself of financial responsibilities, social commitments."}, {"viet": "Làm điều gì không chút khó khăn nào.", "eng": "Do something without the slightest difficulty at all."}, {"viet": "Bạn có bao giờ sử dụng điện thoại di động khi đi xe lửa không?", "eng": "Do you ever use your cellular phone while riding the train?"}, {"viet": "Bạn có bảo hiểm y tế của chính phủ không?", "eng": "Do you have government health insurance?"}, {"viet": "Bạn có thích phim chiến tranh như \"Trân Châu Cảng\" không?", "eng": "Do you like war films like \"Pearl Harbour\"?"}, {"viet": "Theo cô thì ông ấy có họp lâu không?", "eng": "Do you think he'll be long?"}, {"viet": "Bà có muốn mang giày ngay không?", "eng": "Do you want to wear them right away?"}, {"viet": "Hai con chó cố táp đuôi nhau.", "eng": "Dogs biting at each other's tails."}, {"viet": "Đừng vẽ bức tranh quá nhỏ.", "eng": "Don't draw the picture too small."}, {"viet": "Đừng để ông chủ của bạn bắt gặp bạn đang lơ đãng đấy!", "eng": "Don't let your boss catch your napping!"}, {"viet": "Nếu tôi ngủ thiếp đi khi anh đang phát biểu thì đừng cho đó là sự xúc phạm; bởi vì tôi mệt lắm.", "eng": "Don't take it as an insult if I go to sleep during your speech; I'm very tired."}, {"viet": "Gấp đôi mền lại cho ấm thêm.", "eng": "Double the blanket over for extra warmth."}, {"viet": "Trong thời gian bị chiếm đóng, chúng tôi phải sống quy phục hoàn toàn kẻ xâm lược.", "eng": "During the occupation, we had to live in total submission to the invader."}, {"viet": "Những xúc cảm trong tình trạng xáo động.", "eng": "Emotions in a state of turbulence."}, {"viet": "Ngay cả lúc chạy hết tốc lực, máy tàu cũng chỉ rung rất ít.", "eng": "Even at full speed the ship's engines cause very little vibration."}, {"viet": "Mọi thứ đều rất ấn tượng và thật hấp dẫn.", "eng": "Everything's so striking and fascinating."}, {"viet": "Các chuyên gia đã chứng nhận thể văn này đúng là của Shakespeare.", "eng": "Experts have authenticated the writing as that of Shakespeare himself."}, {"viet": "Phong cách nghệ thuật và văn chương thay đổi liên tục.", "eng": "Fashions in art and literature are changing constantly."}, {"viet": "Điền câu trả lời của bạn bằng chữ hoa, không bằng chữ thường.", "eng": "Fill in your answer in capital letters, not small letters."}, {"viet": "Năm ngàn người đã đáp máy bay đi Paris trong kỳ nghỉ lễ phục sinh.", "eng": "Five thousand people were flown to Paris during the Easter weekend."}, {"viet": "Cho dù bạn có nói gì đi nữa, tôi vẫn nghĩ rằng cô ấy là cô giáo giỏi nhất mà chúng ta có.", "eng": "For all you say, I think she's the best teacher we've got."}, {"viet": "Làm ơn cho tôi bốn vé hạng chót.", "eng": "Four tickets for the gallery, please."}, {"viet": "Nạn cờ bạc và mãi dâm đã bị cấm, nhưng chỉ được phần nào thôi.", "eng": "Gambling and prostitution have been prohibited, but only sort of."}, {"viet": "Hãy nhanh lên nếu không anh sẽ nhỡ chuyến xe buýt đấy.", "eng": "Get your skates on or you'll miss the bus."}, {"viet": "Cho thì giờ và tiền bạc của mình một cách hào phóng.", "eng": "Give unsparingly of one's time and money."}, {"viet": "Chào tất cả các bạn nghe đài!", "eng": "Good evening to all our listeners!"}, {"viet": "Đành phải bớt phần ăn của các trẻ lớn để nuôi các trẻ sơ sinh.", "eng": "Had to scant the older children in order to nourish the newborn."}, {"viet": "Bảo tài xế đem xe đến lúc 4 giờ.", "eng": "Have the driver bring the car round at 4."}, {"viet": "Bạn có bao giờ mua thứ gì qua Internet chưa?", "eng": "Have you ever purchased anything over the Internet?"}, {"viet": "Bạn đã xem bộ phim mới nhất của cô ta chưa?", "eng": "Have you seen her latest picture?"}, {"viet": "Nó là kẻ hay tán tỉnh đàn bà-đừng xem nó quá quan trọng.", "eng": "He's a bit of philander-don't take him too seriously."}, {"viet": "Ông ta đã làm ở nhà băng lâu hơn bất kỳ người nào khác.", "eng": "He's been at the bank longer than anyone else."}, {"viet": "Anh ta có bước khởi đầu rất tốt trong công việc mới của anh ta.", "eng": "He's got off to a flying start in his new job."}, {"viet": "Từ khi bỏ thuốc lá anh ta lên cân nhiều.", "eng": "He's put on a lot of weight since he gave up smoking."}, {"viet": "Anh ấy đang tiếp tục mở rộng kinh doanh.", "eng": "He's working on the enlargement of the business."}, {"viet": "Anh ta gần như bảo tôi là kẻ nói dối.", "eng": "He as good as said I'm a liar."}, {"viet": "Ông ta tự cất bia tại nhà.", "eng": "He brews his own beer at home."}, {"viet": "Nó thoáng thấy cô ta trước khi cô lẩn mất trong đám đông.", "eng": "He caught a glimpse of her before she vanished into the crowd."}, {"viet": "Anh ta không rời mắt nhìn cô gái đẹp mới đến.", "eng": "He couldn't take his eyes off the beautiful newcomer."}, {"viet": "Theo di chúc ông ta đã không lo liệu đầy đủ cho vợ và các con.", "eng": "He didn't provide for his wife and children in his will."}, {"viet": "Anh ấy làm ra tiền gấp đôi cô ấy.", "eng": "He earns double what she does."}, {"viet": "Anh ấy cảm thấy hoàn toàn nhục nhã bởi lời nhận xét mới đây của cô ta.", "eng": "He felt completely crushed by her last remark."}, {"viet": "Nhân dịp sinh nhật anh ta tặng cô nàng một chiếc áo lông đắt tiền.", "eng": "He gave her an expensive fur for her birthday."}, {"viet": "Anh ta giải đáp câu đố nhanh như chớp.", "eng": "He got the answer to the riddle as quick as a flash."}, {"viet": "Ông ấy được sự ủng hộ rộng rãi của các tầng lớp nhân dân.", "eng": "He had the support of large sections of the populace."}, {"viet": "Anh ta có một năng khiếu đáng buồn là giỏi nói điều bậy bạ.", "eng": "He has an unfortunate aptitude for saying the wrong thing."}, {"viet": "Hắn có những quan điểm thật lạ lùng.", "eng": "He has some very strange ideas."}, {"viet": "Ông ta được thừa hưởng một gia tài nhưng lại chết một tháng sau đó; đó là một trong những điều trớ trêu nho nhỏ của cuộc đời.", "eng": "He inherited a fortune but died a month later; one of life's little ironies."}, {"viet": "Ông ta tỉ mỉ về bề ngoài của mình và bị ám ảnh về thói quen sạch sẽ.", "eng": "He is meticulous about his appearance and obsessive about cleanliness."}, {"viet": "Anh ấy thật sự không cùng kiểu người với bạn, bạn biết đấy.", "eng": "He isn't really your type, you know."}, {"viet": "Nó lặng lẽ bỏ đi, không ai thấy và không ai nghi ngờ.", "eng": "He left quietly, unseen and unsuspected."}, {"viet": "Hắn trông trẻ hơn vợ nhưng thực ra thì hắn già hơn rất nhiều.", "eng": "He looks younger than his wife, but in actual fact he's a lot older."}, {"viet": "Trong cuộc phỏng vấn đó anh ta có thể ra vẻ thích thú về tư cách mày râu của mình.", "eng": "He might seem during the interview to relish his machismo."}, {"viet": "Anh ấy đã phản đối việc đề xuất xây dựng một hội trường mới.", "eng": "He opposed the proposal to build a new hall."}, {"viet": "Ông ấy đã khen ngợi nàng về tính can đảm.", "eng": "He praised her for her courage."}, {"viet": "Mỗi tháng nó góp nửa số tiền lương cho kỳ đi nghỉ trượt tuyết mà nó dự định.", "eng": "He puts half of his salary each month towards the skiing holiday he's planning."}, {"viet": "Ông ta từ chối tiên đoán khi nào thì nền kinh tế bắt đầu cải thiện.", "eng": "He refused to prophesy when the economy would begin to improve."}, {"viet": "Hắn ta là một thằng nhóc xấc xược.", "eng": "He's a cheeky little nipper."}, {"viet": "Ông ấy được đưa lên hàng quý tộc.", "eng": "He's been elevated to the peerage."}, {"viet": "Hắn bỏ nàng đi rồi à? Có sao đâu? Đằng nào thì hắn cũng có bao giờ ở nhà đâu.", "eng": "He's left her? What's the odds? He was never at home anyhow."}, {"viet": "Hắn là con cưng của giám đốc.", "eng": "He's the manager's blue-eyed boy."}, {"viet": "Anh ấy nhìn thấy nhiều thứ mới mẻ quá đến nỗi không thể nhớ hết.", "eng": "He saw so many new things that he couldn't remember them all."}, {"viet": "Ông ta xua đuổi những đứa nhỏ ra khỏi cửa hàng.", "eng": "He shooed the little children out of the shop."}, {"viet": "Anh ấy quý các con gái đến nỗi cứ mua mãi những đồ chơi đắt tiền cho chúng.", "eng": "He so adores his daughters that he keeps buying them expensive toys."}, {"viet": "Anh ta bắt đầu uống rượu quá nhiều và dần dần trở nên tiều tuỵ.", "eng": "He started to drink too much and gradually ran to seed."}, {"viet": "Thời còn trẻ ông ta có nhiều mặc cảm tội lỗi.", "eng": "He suffered much embarrassment in his youth."}, {"viet": "Hắn ta đã ngăn trở những kế hoạch của chúng tôi.", "eng": "He threw a monkey wrench into our plans."}, {"viet": "Ông ta truy ra dòng dõi của mình từ các đời vua Stuart.", "eng": "He traces his descent from the Stuart kings."}, {"viet": "Nó thông cảm được hoàn cảnh khó khăn của anh ra sao.", "eng": "He understands how hard things have been for you."}, {"viet": "Ông ta khuyến cáo tôi là không được đến muộn.", "eng": "He warned me not to be late."}, {"viet": "Anh ấy bị thương nặng trong chiến tranh và bây giờ vẫn còn mang sẹo.", "eng": "He was badly wounded in the war and still bears the scars."}, {"viet": "Ông ta rất tức giận về sự can thiệp của bà ta.", "eng": "He was deeply resentful of her interference."}, {"viet": "Anh ta được các sĩ quan đồng ngũ của anh ta kính nể.", "eng": "He was greatly respected by his brother officers."}, {"viet": "Anh ta không có mặt cho cuộc phỏng vấn.", "eng": "He was not available for the interview."}, {"viet": "Anh ta bị cám dỗ bởi triển vọng về lợi nhuận.", "eng": "He was seduced by the prospect of gain."}, {"viet": "Anh ta bị tống khỏi nhà hàng vì anh ta say rượu.", "eng": "He was thrown out of the restaurant because he was drunk."}, {"viet": "Ông ta giận dữ điên cuồng khi chúng tôi nói với ông ta về lỗi lầm đó.", "eng": "He went apeshit when we told him about the mistake."}, {"viet": "Ở khoảng cách đó, nó sẽ không bắn trúng đích được.", "eng": "He won't hit the target at that distance."}, {"viet": "Các tiêu đề được in dạng chữ khác với chữ trong quyển sách.", "eng": "Headings printed in a different type from the book."}, {"viet": "Phong cách bóng gió của cô ta thật khó mà theo được.", "eng": "Her allusive style is difficult to follow."}, {"viet": "Con cái là niềm an ủi lớn lao của bà ấy.", "eng": "Her children are a great comfort to her."}, {"viet": "Giọng tiếng Anh của cô ta rất hay làm anh sẽ nghĩ cô ta là người nói tiếng Anh mẹ đẻ.", "eng": "Her English accent is so good, you would think she was a native speaker."}, {"viet": "Tóc cô ấy có nếp gợn sóng tự nhiên.", "eng": "Her hair has a natural wave."}, {"viet": "Sự tử tế và tính rộng rãi của bà ta cân bằng với những cơn nóng giận thất thường của bà ta.", "eng": "Her kindness and generosity cancel out her occasional flashes temper."}, {"viet": "Đĩa hát mới của cô ta có hai bài tuyệt vời.", "eng": "Her new album has two great tracks on it."}, {"viet": "Mục đích chủ yếu của bà ta là nổi tiếng trên trường quốc tế với tư cách một nhà khoa học.", "eng": "Her principal objective was international fame as a scientist."}, {"viet": "Con trai bà ta đã bị ghi bằng lái xe hai lần vì chạy quá tốc độ.", "eng": "Her son has had two endorsements for speeding."}, {"viet": "Giọng của cô ta đôi khi run ở nốt cao.", "eng": "Her voice sometimes wobbles on high notes."}, {"viet": "Tính cách, đặc điểm, tín ngưỡng cha truyền con nối.", "eng": "Hereditary characteristics, features, beliefs."}, {"viet": "Đôi tay anh ta vung vẩy khi anh ta đi.", "eng": "His arms swung as he walked."}, {"viet": "Các tranh biếm hoạ của ông ta đã đả kích một cách không thương tiếc các nhà chính trị hàng đầu thời đó.", "eng": "His cartoons mercilessly lampooned the leading politicians of the day."}, {"viet": "Cách miêu tả của anh ta không ăn khớp với cách miêu tả của anh.", "eng": "His description does not square with your."}, {"viet": "Mặt anh ta sưng lên vì đau răng.", "eng": "His face was swollen up with toothache."}, {"viet": "Tay anh ấy nắm chặt món tiền.", "eng": "His hand closed over the money."}, {"viet": "Sự hiểu biết của anh ấy về ngoại ngữ thật tuyệt vời.", "eng": "His knowledge of languages is excellent."}, {"viet": "Mẹ anh ta là một phụ nữ đáng sợ nhất.", "eng": "His mother is the most formidable lady."}, {"viet": "Những cảm nghĩ riêng tư của mình tạo nên nét đặc trưng trong tác phẩm của anh ta.", "eng": "His personal feelings color his writing."}, {"viet": "Việc ông ấy từ chức đủ cho thấy ông ta tức giận đến thế nào.", "eng": "His resignation is a measure of how angry he is."}, {"viet": "Giọng nói to và rắn rỏi của anh ấy cắt ngang tiếng rì rầm của cuộc trò chuyện một cách dễ dàng.", "eng": "His strong voice cut through the hum of conversation like a knife through butter."}, {"viet": "Giọng của ông ta thấp xuống thành tiếng thì thầm.", "eng": "His voice sank to a whisper."}, {"viet": "Chặn cái cửa mở bằng một hòn đá.", "eng": "Hold the door open with a stone."}, {"viet": "Việc sửa chữa nhà, đi nghỉ mát và các phí tổn khác đã giảm khoản tiền còn lại trong ngân hàng của cô ta xuống đến mức gần như không còn gì.", "eng": "House repairs, holidays, and other expenses reduced her bank balance to almost nothing."}, {"viet": "Làm sao mà bạn có thể uống nhiều như vậy?", "eng": "How can you drink so much?"}, {"viet": "Anh ứng xử làm sao với lời buộc tội đó?", "eng": "How do you answer the charge?"}, {"viet": "Ông sẽ lưu lại nước này bao lâu?", "eng": "How long are you going to stay in this country?"}, {"viet": "Các ông có bao nhiêu đơn vị cho đồng nhân dân tệ?", "eng": "How many denominations do you have for Yuan?"}, {"viet": "Họ lừa anh hết bao nhiêu?", "eng": "How much did they sting you for?"}, {"viet": "Làm thế quái nào cô ấy đã xoay sở được như vậy?", "eng": "How on earth did she manage that?"}, {"viet": "Săn cáo là một môn thể thao riêng biệt của người Anh.", "eng": "Hunting foxes is a peculiarly English sport."}, {"viet": "Tôi muốn hẹn để khám răng tổng quát.", "eng": "I'd like to make an appointment for a dental check-up."}, {"viet": "Tôi sẽ đến nếu không có gì trở ngại.", "eng": "I'll come if nothing untoward happens."}, {"viet": "Tôi sẽ sắp xếp để có người gặp bạn tại sân bay.", "eng": "I'll make arrangements for you to be met at the airport."}, {"viet": "CON NGƯỜI TÔI CẦN LOẠI PHIM NHƯ VẬY.", "eng": "I'M A MAN WHO NEEDS A MOVIE LIKE THAT."}, {"viet": "Tôi sẽ thực hiện cuộc thi bơi được bảo trợ vào ngày thứ Bảy-ông bảo trợ cho tôi chứ?", "eng": "I'm doing a sponsored swim on Saturday-will you sponsor me?"}, {"viet": "Tôi đã đọc được hết một nửa quyển tiểu thuyết thứ nhì của ông ta.", "eng": "I'm half-way through reading his second novel."}, {"viet": "Lúc này tôi không được bà ấy trọng dụng.", "eng": "I'm not in her good graces at the moment."}, {"viet": "Tôi xin lỗi, tôi không hoàn toàn hiểu ý anh nói.", "eng": "I'm sorry, I can't quite catch your drift."}, {"viet": "Tôi kể cho anh nghe điều này là tuyệt đối riêng tư đấy, không để cho ai khác biết đâu.", "eng": "I'm telling you this in absolute confidence, no one else must know."}, {"viet": "Tôi đã đề nghị anh làm việc này cho tôi vì tôi biết rằng anh không phải là người trốn việc.", "eng": "I've asked you to do this for me because I know you're not a quitter."}, {"viet": "Tôi đã đoạn tuyệt với trò cờ bạc-chỉ mất tiền toi thôi.", "eng": "I've finished with gambling-it's a waste of money."}, {"viet": "Tôi biết anh ấy trước bữa ăn sáng đã chạy 10 dặm.", "eng": "I've known him to run 10 miles before breakfast."}, {"viet": "Tôi đã thử mọi cách để có thể làm nhưng vô hiệu.", "eng": "I've tried all available means but in vain."}, {"viet": "Tôi luôn luôn biết khi một điều gì đó làm anh ta lo lắng.", "eng": "I always know when something is bothering him."}, {"viet": "Tôi được thông tin chắc chắn rằng ông ta sắp từ chức.", "eng": "I am reliably informed that he's about to resign."}, {"viet": "Tôi ăn nhiều thức ăn quá đến nỗi suýt nữa bị bệnh.", "eng": "I ate so much food I was almost sick."}, {"viet": "Tôi bảo cô ta là quân đạo đức giả chết tiệt làm cô ta giật mình kinh ngạc.", "eng": "I called her a damned hypocrite and that made her sit up and take notice."}, {"viet": "Tôi không thể nghĩ tới việc sống ở một nơi nào khác ngoài nước Anh.", "eng": "I can't imagine living any where but England."}, {"viet": "Tôi có thể thay một chiếc bánh xe mất có 2 phút thôi.", "eng": "I can change a tire in 2 minutes flat."}, {"viet": "Tôi không thể cho phép một lối cư xử như vậy trong nhà tôi.", "eng": "I cannot have such behaviour in my house."}, {"viet": "Tôi đòi chiếc áo thầy giáo tìm thấy.", "eng": "I claimed the coat that the teacher found."}, {"viet": "Tôi có thấy lỗ sâu nào đâu.", "eng": "I couldn't see any hole though."}, {"viet": "Tôi đã quyết định đi ngủ sớm với một cuốn sách.", "eng": "I decided to retire early with a book."}, {"viet": "Tôi dùng bữa ở nhà hàng trên sân thượng và ngắm nhìn cảnh quan rực rỡ của Paris ban đêm.", "eng": "I dined at a restaurant on the top platform and enjoyed the splendid view of Paris at night."}, {"viet": "Tôi không biết kích thước chính xác của căn phòng.", "eng": "I don't know the exact size of the room."}, {"viet": "Tôi không nghĩ rằng ý tưởng trở thành một nhà báo của cô ta lại có thể thành đạt.", "eng": "I don't think her idea of becoming a journalist ever came to much."}, {"viet": "Tôi không muốn ngừng hẳn không gặp nàng.", "eng": "I don't want to stop seeing her altogether."}, {"viet": "Em không hiểu tại sao phụ nữ lại tự hạ phẩm giá mình theo cách đó.", "eng": "I don't understand why women degrade themselves in that way."}, {"viet": "Bố cảm thấy rất dễ chịu vì thời tiết ở đây rất khô ráo.", "eng": "I feel comfortable because the weather is very dry."}, {"viet": "Tôi thấy không thể nào làm cho cô ta hiểu được.", "eng": "I find her impossible to get through to."}, {"viet": "Nói chung tôi thường tranh thủ đi xem triển lãm khi tôi đến New York công tác.", "eng": "I generally try to take in a show when I'm in New York on business."}, {"viet": "Tôi đã đoán được điều đang xảy ra bằng một vài nhận định cô ta nói ra.", "eng": "I guessed what was happening by the new remarks she let fall."}, {"viet": "Tôi phải đặt cọc trước 10% giá tiền của ngôi nhà.", "eng": "I had to deposit 10% of the price of the house."}, {"viet": "Tôi có một nhóm nhân viên mười người.", "eng": "I have a staff of ten."}, {"viet": "Tôi không hề ảo tưởng về năng lực của mình.", "eng": "I have no illusions about my ability."}, {"viet": "Tôi có quá ít thời gia để hoàn thành công việc này.", "eng": "I have too little time to finish this work."}, {"viet": "Tôi nghe xếp Fred đã thăng cấp tuần trước, tôi cho là điều này lẽ ra đã xảy ra lâu đời.", "eng": "I hear old Fred got promoted last week-and about time too."}, {"viet": "Tôi mong không có gì nghiêm trọng cả.", "eng": "I hope it's nothing serious."}, {"viet": "Tôi đã mời năm người chị tôi, nhưng không phải tất cả đều đến được.", "eng": "I invited my five sisters but not all of them can come."}, {"viet": "Tôi biết vài điều không hay về cô ta.", "eng": "I know several things to her discredit."}, {"viet": "Tôi thích phim hài lãng mạn hơn là phim khoa học giả tưởng, kể cả những phim mới sản xuất như ” Công viên kỷ jura phần III ” hay “ hành tinh khỉ ”.", "eng": "I like romantic comedies rather than science fiction films, including the newly produced Jurassic Park HI or Planet of the Apes."}, {"viet": "Tôi sẽ kiểm tra xem tôi có gì ăn nào.", "eng": "I'll check and see what I have."}, {"viet": "Tôi sẽ gặp anh vào đầu năm mới.", "eng": "I'll see you in the new year."}, {"viet": "Tôi e rằng xe ô tô của anh đang nằm cản đường đấy.", "eng": "I'm afraid your car is in the way."}, {"viet": "Tôi đồng ý tham gia cuộc thi ở cự ly 1.000 mét.", "eng": "I'm in for the 1,000 metres."}, {"viet": "Tôi lấy làm tiếc, tôi không biết.", "eng": "I'm sorry, I don't know."}, {"viet": "Tôi xoay xở để xoáy vật liệu về dựng lên một túp lều.", "eng": "I managed to scrounge the materials to build a shed."}, {"viet": "Tôi phải giữ một ít nhân dân tệ vì tôi có thể sử dụng chúng ở sân bay.", "eng": "I must keep some Yuan for I may use them at the airport."}, {"viet": "Tôi không bao giờ làm điều gì quan trọng vào thứ sáu 13, tôi dị đoan về chuyện đó.", "eng": "I never do anything important on Friday the 13th, I'm superstitious about it."}, {"viet": "Tôi chịu ơn phải trả đối với ông về những gì ông đã làm.", "eng": "I owe you a debt of gratitude for what you've done."}, {"viet": "Tôi hoàn toàn hiểu rằng anh cần một sự thay đổi.", "eng": "I quite understand your needing a change."}, {"viet": "Tôi không chịu để cho người ta chà đạp thêm nữa!", "eng": "I refuse to be trampled on any longer!"}, {"viet": "Tôi chỉ mới gặp cô ta đây.", "eng": "I saw her only the other day."}, {"viet": "Tôi sẽ phải xin phép ông chủ của tôi.", "eng": "I shall have to ask for permission from the governor."}, {"viet": "Tôi đã nói rõ với anh là không được làm như vậy.", "eng": "I specifically told you not to do that."}, {"viet": "Tôi thề nói sự thật, xin thề.", "eng": "I swear to tell the truth, so help me God."}, {"viet": "Tôi nghĩ rằng tôi sẽ chọn món xà lách trái cây.", "eng": "I think I will go for the fruit salad."}, {"viet": "Tôi nghĩ là chúng ta nên chọn Bill ở vị trí biên trong trận tới.", "eng": "I think we should play Bill on the wing in the next match."}, {"viet": "Tôi kéo cô ta ra một chỗ để hỏi về cách cư xử kỳ quặc của cô ta.", "eng": "I took her on one side to ask about her odd behaviour."}, {"viet": "Tôi biết anh sẽ nói là anh ta sẽ hợp tác.", "eng": "I understood him as saying that he would co-operate."}, {"viet": "Tôi muốn trả thù cô ấy vì nhiều lí do chính đáng.", "eng": "I want revenge against her on more scores than one."}, {"viet": "Tôi cần kem đánh răng và xà bông tắm.", "eng": "I want toothpaste and toilet soap."}, {"viet": "Tôi ngã xuống nhưng Peter đã cứu mạng tôi.", "eng": "I was dropping but Peter saved my life."}, {"viet": "Tôi chỉ nói đùa khi nói là đã đánh mất chùm chìa khoá của anh.", "eng": "I was only fooling when I said I'd lost your keys."}, {"viet": "Tôi nghe nói phim đó rất hay, nhưng tôi quên mất tên phim rồi.", "eng": "I was told it is very interesting, but i've forgotten its name."}, {"viet": "Tôi sẽ lái xe đưa anh đi bất cứ đâu anh muốn.", "eng": "I will drive you everywhere you want to go."}, {"viet": "Chẳng ai bắt buộc được tôi phải mua cái xe hơi mà tôi không thích!", "eng": "I won't be railroaded into buying a car I don't want!"}, {"viet": "Tôi sẵn sàng đi bây giờ cũng như sau này.", "eng": "I would as left go now as later."}, {"viet": "Tôi muốn nói chuyện với ông Jones.", "eng": "I would like to speak to Mr. Jones."}, {"viet": "Chủ nghĩa lý tưởng không còn chỗ đứng trong nền chính trị hiện đại.", "eng": "Idealism has no place in modern politics."}, {"viet": "Nếu bố nằm ngửa giơ hai chân lên, có lẽ mỡ bụng của bố sẽ tiêu bớt đấy.", "eng": "If I do sit-ups, maybe I'll lose some stomach fat."}, {"viet": "Nếu vậy, tôi đề nghị ông dùng thử món ăn Tứ Xuyên.", "eng": "If so, I suggest you have a taste for Sichuan food."}, {"viet": "Nếu chúng ta phân quyền về địa phương, các tỉnh sẽ có nhiều quyền tự trị hơn.", "eng": "If we decentralize, the provinces will have more autonomy."}, {"viet": "Nếu các ông có thể cho chúng tôi mức chiết khấu 10%, chúng tôi dự tính đặt 1000 tá cho sản phẩm này.", "eng": "If you can give us a 10% discount, we have in mind an order for 1,000 dozen of this product."}, {"viet": "Nếu quý khách có bất cứ thắc mắc nào trong suốt chuyến bay, xin đừng ngần ngại hỏi hai nữ tiếp viên hàng không của quý khách.", "eng": "If you have any quesions during the flight, please do not hesitate to ask your two hostesses the flight,."}, {"viet": "Nếu anh cố khởi động bằng số cao nhất anh sẽ làm chết máy.", "eng": "If you try to start off in top gear you'll stall."}, {"viet": "Năm 1582 ông nhờ một nhà thiên văn học người ý tính toán một quy tắc tốt hơn cho các năm nhuận.", "eng": "In 1582 he asked an Italian astronomer to help him work out a better rule for leap years."}, {"viet": "Ở nước Anh, chim cúc cu là báo hiệu của mùa xuân.", "eng": "In England the cuckoo is the herald of spring."}, {"viet": "Trong các cuộc chiến tranh hiện đại, cả chiến sĩ lẫn những người không phải là chiến sĩ đều bị giết hại.", "eng": "In modern wars, both combatants and non-combatants are killed."}, {"viet": "Trong Kinh thánh, một niên đại là vào năm đầu của Cyrus, vua Ba Tư.", "eng": "In the Bible one date is in the first year of Cyrus, king of Persia."}, {"viet": "Ở Hoa Kỳ, người ta đo khoảng cách bằng dặm chứ không bằng kilômét.", "eng": "In the USA distance is measured in miles, not kilometres."}, {"viet": "Nỗi phiền muộn, sự thống khổ, niềm vui v. v. không sao tả xiết.", "eng": "Inexpressible sorrow, anguish, joy, etc."}, {"viet": "Chuyển sang chỗ đó có được không?", "eng": "Is it all right to move to that seat?"}, {"viet": "Gần đây có cửa hàng văn phòng phẩm nào tốt không?", "eng": "Is there a good stationer's shop near here?"}, {"viet": "Con gái của bạn đang học cái gì đó rồi phải không?", "eng": "Is your daughter already learning something?"}, {"viet": "Từ đây ra ngân hàng chỉ một quãng ngắn.", "eng": "It's a short distance from here to the bank."}, {"viet": "Khó khăn thật nhưng nó còn có thể tệ hại hơn nữa.", "eng": "It's difficult enough, but it could have been worse."}, {"viet": "Không thể nào không mủi lòng bởi những báo cáo về nạn đói.", "eng": "It's impossible to remain unmoved by the reports of the famine."}, {"viet": "Đó không phải là sách của mình-mình mượn của thư viện đấy.", "eng": "It's not my book-I've got it on loan from the library."}, {"viet": "Tôi vẫn ân hận là đã không kịp báo trước cho cô ta.", "eng": "It's still on my conscience that I didn't warn her in time."}, {"viet": "Ăn quá nhiều chất béo thì không tốt cho sức khoẻ.", "eng": "It's very unhealthy to eat so much fat."}, {"viet": "Nó có phần giải nghĩa về các hiện vật được triển lãm.", "eng": "It gives an explanation of the exhibits."}, {"viet": "Ăn cắp tiền của người mù thật là đê tiện.", "eng": "It is dishonorable to steal a blind man's money."}, {"viet": "Ngày nay khó mà tìm thấy được một thiên tài như vậy.", "eng": "It is rare to find such genius nowadays."}, {"viet": "Tình hình có vẻ tệ hơn vẻ bề ngoài đấy.", "eng": "It may be worse than it seems."}, {"viet": "Nó ở lối đi kế tiếp.", "eng": "It's in the next aisle."}, {"viet": "Đối với chúng ta, hình như can thiệp vào giai đoạn này là không thích đáng.", "eng": "It seems inappropriate for us to intervene at this stage."}, {"viet": "Mỗi khi cô ấy huýt sáo một mình là thường làm tôi khó chịu.", "eng": "It used to annoy me when she whistled to herself."}, {"viet": "Nó dễ khi tôi đã học được cách làm.", "eng": "It was easy once I learnt how to do it."}, {"viet": "Nó hấp dẫn đến nỗi tôi không thể bỏ nó xuống được!", "eng": "It was so exciting I couldn't put it down!"}, {"viet": "Trời sẽ không mưa đâu: anh có thể để ô lại.", "eng": "It won't rain: you can leave your umbrella behind."}, {"viet": "Ưu thế của Nhật Bản ( đối với các nước khác ) trong lĩnh vực vi điện tử.", "eng": "Japan's priority ( over other countries ) in the field of microelectronics."}, {"viet": "Jones chuộc lại lối chơi kém cỏi của mình trước đó bằng cách ghi hai bàn thắng.", "eng": "Jones redeemed his earlier poor performance by scoring two goals."}, {"viet": "Ken vắng mặt nên tôi sẽ thay mặt anh ấy nhận giải.", "eng": "Ken is not present, so I shall accept the prize on his behalf."}, {"viet": "Chúng ta hãy ấn định một ngày cụ thể cho buổi họp tới.", "eng": "Let's fix a definite date for the next meeting."}, {"viet": "Đại úy Lucas sẽ giúp anh tránh sự phiền toái.", "eng": "Lieutenant Lucas will keep you out of trouble."}, {"viet": "Có nhiều khuyết tật trong tính cách của anh ấy.", "eng": "Many imperfectabilities in his character."}, {"viet": "Marilyn muốn được yêu thương chứ không muốn được đề cao như một người nổi tiếng.", "eng": "Marilyn wanted to be loved, not lionized."}, {"viet": "Vui lòng cho tôi 10 con tem loại 5 đô la?", "eng": "May I have ten five-dollar stamps, please?"}, {"viet": "Bữa ăn là tuyệt hảo chỉ trừ món đầu tiên.", "eng": "Meal was excellent except for the first course."}, {"viet": "Hầu hết mọi người tỏ dấu hiệu của sự thoái hoá khi về già.", "eng": "Most people show signs of regression when they grow old."}, {"viet": "Những tiếng nói bị nghẹt lại từ phòng bên vọng sang.", "eng": "Muffled voices coming from the next room."}, {"viet": "Đứa con gái lớn nhất của tôi là học sinh trung học năm thứ 2.", "eng": "My eldest daughter is a sophomore in high school."}, {"viet": "Chùm chìa khoá của tôi biến mất-thật là hết sức lạ kỳ!", "eng": "My keys have disappeared-it's most peculiar!"}, {"viet": "Cái áo sơ mi của tôi đang nằm đâu đó trên sàn.", "eng": "My shirt is kicking around on the floor somewhere."}, {"viet": "Lái thuyền trên sông rất khó vì những tảng đá.", "eng": "Navigation is difficult on the river because of the rocks."}, {"viet": "Không-nếu anh không đi bây giờ thì nhất định là anh phải đi bộ về nhà.", "eng": "No-if you don't come now, you can jolly well walk home."}, {"viet": "Mẹ muốn nói, dù bất tiện thế nào đi nữa?", "eng": "No matter how inconvenient, you mean?"}, {"viet": "Bây giờ ông ấy sắp đến tuổi về hưu, ông ấy bắt đầu chơi gôn.", "eng": "Now he's getting towards retirement age he's started playing golf."}, {"viet": "Trong tất cả số con cái, cô ta là người cảm thấy đau khổ nhất về cái chết của mẹ mình.", "eng": "Of all the children, she felt her mother's death the most."}, {"viet": "Dầu đã chiếm chỗ của cà phê như mặt hàng xuất khẩu chính.", "eng": "Oil has superseded coffee as our main export."}, {"viet": "Trên đường đến khách sạn, bạn có thể giới thiệu nơi chốn và nói chuyện với ông ấy về các chủ đề mà có thể ông ấy quan tâm.", "eng": "On the way to the hotel, you can introduce the place and talk to him on subjects that he may be interested in."}, {"viet": "Một trong những giải pháp anh có thể chọn là xin từ chức.", "eng": "One of the alternatives open to you is to resign."}, {"viet": "Cơ thể chúng ta luôn luôn chuyển hoá những thức ăn mà chúng ta ăn.", "eng": "Our bodies constantly metabolize the food we eat."}, {"viet": "Các kế hoạch đi nghỉ phép của chúng tôi đã hỏng vì những cuộc đình công trong ngành vận tải.", "eng": "Our holiday plans fell through because of transport strikes."}, {"viet": "Kế hoạch của chúng tôi hoàn toàn bị đảo lộn trong thời gian có cuộc bãi công.", "eng": "Our schedule went completely off the rails during the strike."}, {"viet": "Quyền sở hữu về những bất động sản lớn càng ngày càng bị phân tán.", "eng": "Ownership of the large estates is increasingly fragmented."}, {"viet": "Mọi người luôn so sánh tôi với em gái tôi.", "eng": "People are always comparing me to my sister."}, {"viet": "Bổng lộc bao gồm cả việc sử dụng chiếc xe của công ty.", "eng": "Perquisites include the use of the company car."}, {"viet": "Cảnh sát báo cho công chúng biết cần cảnh giác đề phòng những tên khủng bố bị tình nghi.", "eng": "Police warned the public to be on the alert for suspected terrorists."}, {"viet": "Muối có tác dụng bảo quản thức ăn.", "eng": "Salt had a preservative effect on food."}, {"viet": "Nhiều hãng mới đây đã đi đến bước đường cùng.", "eng": "Several firms have gone to the wall recently."}, {"viet": "Cô ta là một người theo thuyết nam nữ bình quyền, nói theo ý nghĩa khái quát nhất của từ này.", "eng": "She's a feminist, in the broadest sense of the word."}, {"viet": "Cô ta nghiền ngẫm lá thư lạ lùng của anh ấy nhiều tuần liền.", "eng": "She's been puzzling over his strange letter for weeks."}, {"viet": "Cô ta chỉ là kẻ ba hoa, thật ra cô ta không biết chút gì về nghệ thuật cả.", "eng": "She's just a pseud, she knows nothing about art really."}, {"viet": "Cô ấy thật sự chỉ bận tâm chuyện riêng của mình và không giao tiếp với ai kể từ khi Peter bỏ cô ấy.", "eng": "She's really turned in on herself since Peter left her."}, {"viet": "Cô ta đi cùng với hắn vì một ý thức trung thành.", "eng": "She accompanied him from a sense of loyalty."}, {"viet": "Cô ấy nhận ra được là có cái gì đang cháy.", "eng": "She became aware that something was burning."}, {"viet": "Cô ta tự nhận là biết tất cả mọi thứ về máy vi tính nhưng thực sự cô ta chỉ là người giả bộ.", "eng": "She claims to know all about computers but really she's a sham."}, {"viet": "Bà ta đã đề tặng cuốn sách đầu tiên của mình cho chồng.", "eng": "She dedicated her first book to her husband."}, {"viet": "Cô ấy vẽ một hàng cây lùi về đằng xa để biểu thị luật phối cảnh.", "eng": "She drew a row of trees receding into the distance to demonstrate the laws of perspective."}, {"viet": "Cuối cùng cô ta rề rà bước vào, sau tất cả mọi người khác hai tiếng đồng hồ.", "eng": "She finally drifted in two hours after everyone else."}, {"viet": "Cứ sáu tháng cô ta đi thăm bố mẹ ở xứ Wales một lần.", "eng": "She goes to see her parents in Wales once every six months."}, {"viet": "Bà ta có kế hoạch đầy tham vọng để khai trương công ty của bà ta.", "eng": "She had some grandiose plan to start up her own company."}, {"viet": "Cô ta có đủ tài năng để trở thành một đấu thủ giỏi hơn tất cả các đấu thủ khác.", "eng": "She has enough talent as a player to be a world-beater."}, {"viet": "Bà hy vọng cháu sẽ là con trai.", "eng": "She hopes it will be a boy."}, {"viet": "Bà ta có một tâm tính bình tĩnh phi thường.", "eng": "She is possessed of a wonderfully calm temperament."}, {"viet": "Cô ta biết cách áp đảo những người đưa ra những câu hỏi hắc búa.", "eng": "She knows how to score off people who ask difficult questions."}, {"viet": "Khi tôi la hét cô ấy sửng sốt nhìn lên.", "eng": "She looked up in surprise when I shouted."}, {"viet": "Phải buộc cô ấy chấp hành luật lệ.", "eng": "She must be made to comply with the rules."}, {"viet": "Cô ấy vạch ra một cách để tránh mọi quan liêu giấy tờ.", "eng": "She planned a way to circumvent all the bureaucratic red tape."}, {"viet": "Cô ấy giận vì không được phục vụ trước.", "eng": "She really created because she wasn't served first."}, {"viet": "Cô ta là một chuyên gia ngành ngữ âm.", "eng": "She's an authority on phonetics."}, {"viet": "Cô ta thật sự gặp phải những khó khăn to lớn.", "eng": "She's really up against it."}, {"viet": "Cô ta nguệch ngoạc mấy chữ trên bưu thiếp.", "eng": "She scrawled a few words on a postcard."}, {"viet": "Bà ta đã rút hết tiền lãi của doanh nghiệp bỏ vào tải khoản của mình.", "eng": "She siphoned off profits from the business into her account."}, {"viet": "Cô ấy đứng ở phía bên kia hàng rào.", "eng": "She stood on the other side of the fence."}, {"viet": "Cô ta tưởng cái áo ấy là đẹp lắm-tôi thì tôi cho cô ta mặc áo trông thật xấu xí kinh khủng.", "eng": "She thinks that dress is pretty-I think she looks a fright in it."}, {"viet": "Cô ấy mở sâm banh và nó nổ tung ra.", "eng": "She uncorked the champagne and it fizzed out."}, {"viet": "Cô ấy hết sức sung sướng khi tôi báo cho cô ấy biết tin đó.", "eng": "She was absolutely ecstatic when I told her the news."}, {"viet": "Người ta cứ đinh ninh rằng cô ấy sẽ là người thắng cuộc.", "eng": "She was deemed to be the winner."}, {"viet": "Nàng có vẻ chấp nhận sự tán tỉnh của anh ta.", "eng": "She was inclined to accept his suit."}, {"viet": "Cô ta hoàn toàn khẳng định về số tiền cần phải có.", "eng": "She was quite positive about the amount of money involved."}, {"viet": "Cô ấy quá sợ hãi sau khi bị tấn công đến nỗi không báo cáo được gì với cảnh sát.", "eng": "She was too shaken after being assaulted to report the incident to the police."}, {"viet": "Cô ấy đi vào rừng và bị lạc đường.", "eng": "She went into the woods and got lost."}, {"viet": "Cô ta đeo một mặt hình treo trên một sợi dây chuyền bạc.", "eng": "She wore a locket hanging on a silver chain."}, {"viet": "Cứt thật! Mình lỡ tàu rồi!", "eng": "Shit! I've missed the train!"}, {"viet": "Anh kí tên vào cuối trang này.", "eng": "Sign your name at the bottom of the page."}, {"viet": "Sáu hương vị khác nhau của kem.", "eng": "Six different flavours of ice-cream."}, {"viet": "Khói cuộn lên từ tòa nhà đang cháy.", "eng": "Smoke billowed from the burning houses."}, {"viet": "Thế ra ông gọi đây là chợ trời à?", "eng": "So this is what you call a flea market!"}, {"viet": "Vài đứa trẻ làm đèn lồng bằng những quả bí vào đêm trước ngày lễ các Thánh.", "eng": "Some children make lanterns out of pumpkins at Halloween."}, {"viet": "Vài vùng ở Wales bị cấm mua bán rượu ngày chủ Nhật.", "eng": "Some parts of Wales are dry on Sundays."}, {"viet": "Có ai đi gọi bác sĩ ngay! Tôi thấy bà này bị một cơn đau tim.", "eng": "Somebody get a doctor! I think this woman's had a heart attack."}, {"viet": "Rất tiếc, nhưng bây giờ tôi phải đi.", "eng": "Sorry but I must leave now."}, {"viet": "Mùa xuân đã đến và các bờ dậu đều đâm chồi nảy lộc mới.", "eng": "Spring has come and the hedges are putting forth new leaves."}, {"viet": "Ở quanh quẩn đây nhé, chúng tôi có thể cần đến anh.", "eng": "Stick around, we may need you."}, {"viet": "Nguy cơ chiến tranh bao trùm châu Âu.", "eng": "Storm-clouds of war gathering over Europe."}, {"viet": "Một con quái vật ghê gớm và bí mật như thế khiến cho tôi hết sức tò mò.", "eng": "Such a portentous and mysterious monster roused all may curiosity."}, {"viet": "Những người tắm nắng nằm dang thẳng tay chân trên bãi cỏ.", "eng": "Sunbathers lay spread-eagle on the grass."}, {"viet": "Bơi và lướt ván đều là những môn thể thao dưới nước.", "eng": "Swimming and water skiing are both aquatic sports."}, {"viet": "Vào ở trong trường đại học.", "eng": "Take up one's residence in college."}, {"viet": "Bảo hắn ta hãy tránh xa em gái tôi ra!", "eng": "Tell him to stay away from my sister!"}, {"viet": "Rất cám ơn bạn về món quà này.", "eng": "Thank you very much for the present."}, {"viet": "Đứa bé đó giống bố y hệt!", "eng": "That baby looks just like her father!"}, {"viet": "Bài thi trắc nghiệm về sử đó thật dễ ợt.", "eng": "That history test was duck soup."}, {"viet": "Vị chủ mới cao ngạo của chúng tôi.", "eng": "That new jumped-up boss of ours."}, {"viet": "Đó là chỗ bắn pháo hoa đấy.", "eng": "That's where the fireworks are."}, {"viet": "Cái đó sẽ tránh cho chúng ta nhiều rắc rối.", "eng": "That will save us a lot of trouble."}, {"viet": "Các hình thái đối cách của các đại từ'I','we'và'she'là'me','us'và'her'.", "eng": "The accusative forms of the pronouns'I','we'and'she'are'me','us'and'her'."}, {"viet": "Không khí trong phòng này khó chịu quá, mở cửa sổ ra!", "eng": "The air in this room is foul, open the window!"}, {"viet": "Lời thông báo đó bị ngắt quãng bởi tiếng reo hò từ đám đông.", "eng": "The announcement was punctuated by cheers from the crowd."}, {"viet": "Quân đội ngăn kế hoạch làm nổ cầu của kẻ thù.", "eng": "The army foiled the enemy's plan to blast the bridge."}, {"viet": "Viên Tổng chưởng lý, Tổng thanh tra, Toàn quyền, Tổng thư ký, v. v.", "eng": "The Attorney, Inspector, Governor, Secretary, etc General."}, {"viet": "Đứa bé đang khoái chí bi ba bi bô trong nôi.", "eng": "The baby is prattling away happily in her cot."}, {"viet": "Ngân hàng cho cô ta vay 500 bảng Anh.", "eng": "The bank made her an advance of £ 500."}, {"viet": "Nhóm Beatles ghi đĩa hát đầu tiên năm 1962.", "eng": "The Beatles cut their first disc in 1962."}, {"viet": "Con chim xù lông trong nắng.", "eng": "The bird fluffed its feathers in the sun."}, {"viet": "Thi thể của các nạn nhân không phải là một cảnh đẹp mắt.", "eng": "The bodies of the victims were not a pretty sight."}, {"viet": "Sách nằm bừa bãi trên kệ.", "eng": "The books were lying on the shelves all anyhow."}, {"viet": "Các cậu bé leo trèo trên khắp các tảng đá.", "eng": "The boys were climbing about on the rocks."}, {"viet": "Toà nhà đẹp nhưng không thực tế lắm.", "eng": "The building is aesthetic but not very practical."}, {"viet": "Nhà doanh nghiệp cuối cùng đã buộc ban chấp hành đồng ý với kế hoạch nhiều bước của ông ta.", "eng": "The businessman eventually forced the board to agree to his game plan."}, {"viet": "Chiếc ô tô long lở vì thiếu sự chú ý chăm sóc.", "eng": "The car dilapidated because of lack of attention."}, {"viet": "Người thợ mộc mặc một chiếc quần yếm màu xanh.", "eng": "The carpenter was wearing a pair of blue overalls."}, {"viet": "Kiểm duyệt chương trình vô tuyến.", "eng": "The censorship of television programmes."}, {"viet": "Pho mát có vị hơi quá hăng đối với tôi.", "eng": "The cheese is a little too sharp for me."}, {"viet": "Con bé rúc vào người mẹ nó.", "eng": "The child snuggled up to her mother."}, {"viet": "Chờ đợi lâu, bọn trẻ đâm ra sốt ruột.", "eng": "The children grew restless with the long wait."}, {"viet": "Các cháu bé không thể nào an ủi được khi bố các cháu mất đi.", "eng": "The children were inconsolable when their father died."}, {"viet": "Giới công nhân viên chức nhà nước đe dọa sẽ đình công.", "eng": "The Civil Service is threatening to strike."}, {"viet": "Câu lạc bộ đã ký giao kèo với một thủ môn mới cho mùa bóng này.", "eng": "The club has signed up a new goal-keeper this season."}, {"viet": "Vai hề trình diễn thật quá tồi!", "eng": "The comedian's performance was the pits!"}, {"viet": "Công ty vừa nhận được một hệ thống máy tính mới.", "eng": "The company has just taken delivery of a new computer system."}, {"viet": "Sự ngưng đọng hơi thành nước.", "eng": "The condensation of steam to water."}, {"viet": "Chuyển hướng cuộc nói chuyện sang các đề tài dễ chịu hơn.", "eng": "The conversation towards more pleasant topics."}, {"viet": "Đất nước đó đang chuẩn bị tham chiến.", "eng": "The country is making preparations to go to war."}, {"viet": "Con lạch chuyển hướng vào máng nước bê tông ngay trên thị trấn.", "eng": "The creek is diverted into a concrete flume just above the town."}, {"viet": "Điều mỉa mai tột cùng là tôi thậm chí chẳng thích cô ta.", "eng": "The crowning irony was that I didn't even like her."}, {"viet": "Các diễn viên múa biểu diễn đầy tài nghệ.", "eng": "The dancers gave a very slick performance."}, {"viet": "Người bị cáo được đem ra đối chất với nguyên cáo.", "eng": "The defendant is confronted with the plain tiff."}, {"viet": "Việc đồng pao mất giá đã làm cho những ước tính của chúng tôi sai chệnh nhiều nghìn.", "eng": "The devaluation of the pound has put our estimates out by several thousands."}, {"viet": "Căn bệnh này sẽ dẫn đến chứng bại liệt dần dần.", "eng": "The disease results in creeping paralysis."}, {"viet": "Bác sĩ dùng một cái bơm bao tử hút hết những thứ nằm trong dạ dày của bà ta ra.", "eng": "The doctor removed the contents of her stomach with a stomach pump."}, {"viet": "Con chó chạy vòng tròn trong một chiếc vòng.", "eng": "The dog ran round and round in a circle."}, {"viet": "Người thợ may đặt những vải lót nhỏ vào gấu áo dài.", "eng": "The dressmaker put small weights in the hem of the dress."}, {"viet": "Trận động đất đã được tiên đoán trước đó nhiều tháng.", "eng": "The earthquake had been predicted several months before."}, {"viet": "Những ông chủ và các công đoàn còn cách xa nhau hàng dặm.", "eng": "The employers and the unions are still miles apart."}, {"viet": "Thiết bị đã bắt được tín hiệu từ vệ tinh.", "eng": "The equipment picked up the signal from the satellite."}, {"viet": "Cuộc triển lãm là một sự tổng kết cuộc đời sáng tác của ông ấy.", "eng": "The exhibition was a summation of his life's work."}, {"viet": "Bà tiên đỡ đầu vung chiếc đũa thần lên.", "eng": "The fairy godmother waved her magic wand."}, {"viet": "Câu của Rudyard Kipling nói về sự độc ác của phụ nữ.", "eng": "The female of the species is more deadly than the male."}, {"viet": "Phim cũng được nhưng tôi đã từng xem những phim hay hơn.", "eng": "The film was all right but I've seen better ones."}, {"viet": "Hãng đang tìm kiếm những mặt bằng rộng lớn hơn.", "eng": "The firm is looking for larger premises."}, {"viet": "Cá kho quá lâu nên bị khô quắt lại.", "eng": "The fish was overdone and very dry."}, {"viet": "Trận đấu bóng đã phải đá thêm giờ.", "eng": "The football match went into extra time."}, {"viet": "Cửa trước đóng đánh rầm.", "eng": "The front door slammed with a loud bang."}, {"viet": "Vườn trông đẹp lộng lẫy về mùa hè.", "eng": "The garden looks beautiful in its summer finery."}, {"viet": "Vùng biển lạnh như băng ở Bắc cực.", "eng": "The glacial waters of the Arctic."}, {"viet": "Chính phủ giữ thái độ không nhân nhượng đối với vấn đề độc lập.", "eng": "The government adopted an uncompromising posture on the issue of independence."}, {"viet": "Chính phủ đang có kế hoạch cải cách luật uống rượu và lái xe.", "eng": "The government is planning to reform the law on drinking and driving."}, {"viet": "Các vạch chia độ được đánh dấu bên ngoài chiếc bình.", "eng": "The graduations are marked on the side of the flask."}, {"viet": "Sự chia rẽ ngày càng gia tăng giữa cánh tả và cánh hữu của đảng.", "eng": "The growing polarity between the left and the right wings of the party."}, {"viet": "Bàn tay của Chúa và đòn đánh của con người hình như đều nặng nề như nhau... cho ta cảm giác mạnh mẽ không ngừng tăng lên về thế giới này giống như một lò sát sinh.", "eng": "The hand of God and mankind's self-inflicted blows seem equally heavy... giving a strong cumulative impression of the world as an abattoir."}, {"viet": "Bãi chứa rác của nhà cao tầng là một biểu tượng cho cả thành tựu lẫn thất bại.", "eng": "The high-rise garbage repository is a metaphor for both accomplishment and failure."}, {"viet": "Bệnh viện phải giải quyết các trường hợp cấp cứu như tai nạn ô tô.", "eng": "The hospital has to treat emergencies such as car accidents."}, {"viet": "Căn nhà đó chưa được câu dây điện vào.", "eng": "The house is not wired for electricity yet."}, {"viet": "Ý kiến đó đã bị ủy ban đả kích kịch liệt.", "eng": "The idea got slated by the committee."}, {"viet": "Miền Bắc nước Anh với những nhà máy cũ hoang tàn.", "eng": "The industrial wasteland of Northern England."}, {"viet": "Ban phỏng vấn thấy khả năng của anh ta là có thể chấp nhận được, điều trở ngại duy nhất là tiếng Anh của anh ta quá kém.", "eng": "The interview board found his qualifications acceptable, the only hitch being, his poor command of the English language."}, {"viet": "Người nài ngựa chống tay nhẹ nhàng nhảy lên yên.", "eng": "The jockey vaulted lightly into the saddle."}, {"viet": "Mấu chốt toàn bộ vấn đề là sự ghen tuông của hắn.", "eng": "The key to the whole affair was his jealousy."}, {"viet": "Chủ nhà đang gây sức ép đẩy cô ta ra khỏi nhà.", "eng": "The landlord's putting the screws on to get her out of the house."}, {"viet": "Sự sắp xếp phòng ốc tại một tòa nhà.", "eng": "The layout of rooms in a building."}, {"viet": "Những sự lừa dối Quốc Hội và nhân dân Mỹ.", "eng": "The lies to Congress and the American people."}, {"viet": "Ổ khoá gỉ cho nên chúng tôi đã phải phá vỡ cửa.", "eng": "The lock was rusty, so we had to smash the door open."}, {"viet": "Chiếc máy đó làm rối tung vải vóc.", "eng": "The machine snarled the material up."}, {"viet": "Ban giám đốc từ chối không đồng ý với yêu sách của chúng tôi đòi tăng lương 6%.", "eng": "The management has refused to agree to our demand for a 6% pay rise."}, {"viet": "Vấn đề này đã được đưa ra để xét xử.", "eng": "The matter was brought up for adjudication."}, {"viet": "Những người của tiểu ban đã mất một thời gian dài mới đi đến một quyết định.", "eng": "The members of the committee were long in reaching a decision."}, {"viet": "Bộ trưởng phải dự đủ các buổi lễ long trọng, như ăn tiệc với các vị khách nước ngoài của chính phủ và lễ khai trương các trường học và bệnh viện mới.", "eng": "The minister has to attend all kinds'official functions, such as dinners to welcome foreign guests of the government, and the openings of new schools and hospitals."}, {"viet": "Phía trước tượng đài được xây bằng đá.", "eng": "The monument was fronted with stone."}, {"viet": "Những người đưa đám đứng im lặng để tỏ lòng tôn kính trong khi quan tài được hạ xuống nơi an nghỉ cuối cùng.", "eng": "The mourners stood in silent tribute as the coffin was laid to rest."}, {"viet": "Những đứa trẻ hư bị mắng một trận nên thân.", "eng": "The naughty children got a good dressing down."}, {"viet": "Bệnh viện mới sẽ là một toà nhà rất cao.", "eng": "The new hospital will be a very tall structure."}, {"viet": "Trung tâm thể thao mới có nhà tắm hơi và nhà tắm nắng.", "eng": "The new sports centre has saunas and solariums."}, {"viet": "Chuyến bay tiếp không bay thẳng tới Rome, nó bay qua Paris.", "eng": "The next flight doesn't go direct to Rome, it goes by way of Paris."}, {"viet": "Số 15 không thể chia chẵn cho 7.", "eng": "The number 15 is indivisible by 7."}, {"viet": "Viên sĩ quan ra lệnh cho binh lính của mình nổ súng.", "eng": "The officer commanded his men to fire."}, {"viet": "Người thuỷ thủ già thích thêu dệt về cuộc đời mình trên biển cả.", "eng": "The old sailor loves to spin yarns about his life at sea."}, {"viet": "Tổ chức không nhận anh ta là người của mình khi anh ta bị bắt vì tội gian lận.", "eng": "The organization disowned him when he was arrested for fraud."}, {"viet": "Sơn quét đã bắt đầu bong, cần được tân trang sớm.", "eng": "The paintwork is beginning to flake, it'll need doing over."}, {"viet": "Các hành khách được phép lên bờ nửa tiếng tại Corfu.", "eng": "The passengers were allowed ashore for half an hour at Corfu."}, {"viet": "Nhân dân Anh quốc chẳng hạn, họ cai trị chính họ như một nước cộng hòa mặc dù họ có vua hoặc nữ hoàng.", "eng": "The people of England, for example, rule themselves as in a republic although they have king or queen."}, {"viet": "Những ảnh hưởng sinh lý của sự du hành không gian.", "eng": "The physiological effects of space travel."}, {"viet": "Cả vùng đó thành một biển lửa gào thét.", "eng": "The place was a roaring inferno."}, {"viet": "Cái đĩa rơi xuống nền nhà đánh xoảng.", "eng": "The plate hit the floor with a smash."}, {"viet": "Các bài thơ được in trên một máy in nhỏ.", "eng": "The poems were printed on a small hand press."}, {"viet": "Cảnh sát đã không tìm được bất cứ dấu vết nào của băng đó, chúng tôi đã mất hết tung tích của anh ta.", "eng": "The police have been unable to find any trace of the gang, we've lost all trace of him."}, {"viet": "Cảnh sát quyết tâm tìm ra bọn đầu sỏ.", "eng": "The police were determined to sniff out the ringleaders."}, {"viet": "Cực dương của một bình điện.", "eng": "The positive terminal of a battery."}, {"viet": "Sự giữ gìn sức khỏe của mình.", "eng": "The preservation of one's health."}, {"viet": "Gió thường thổi ở đây là gió tây-nam.", "eng": "The prevailing wind here is from the south-west."}, {"viet": "Những nguyên tắc của chủ nghĩa tư bản và chủ nghĩa xã hội là hoàn toàn trái ngược nhau.", "eng": "The principles of capitalism and socialism are diametrically opposed."}, {"viet": "Nghề y là một nguồn trách nhiệm nghiêm khắc.", "eng": "The profession of medicine is a stern taskmaster."}, {"viet": "Các triển vọng đó không thể khích lệ hơn được nữa.", "eng": "The prospects couldn't be rosier."}, {"viet": "Chuyến thăm mới đây của Nữ hoàng là vào tháng năm, khi bà khai trương một bệnh viện mới.", "eng": "The Queen's last visit was in May, when she opened the new hospital."}, {"viet": "Mưa làm áo sơ mi anh ta dính sát vào người.", "eng": "The rain plastered his shirt to his body."}, {"viet": "Hình người mặc áo màu đỏ ở cận cảnh là bà mẹ của nghệ sĩ.", "eng": "The red figure in the foreground is the artist's mother."}, {"viet": "Bản tường trình đầy những lời dối trá và quanh co.", "eng": "The report was full of lies and prevarications."}, {"viet": "Những tiếng chân bước đều nhịp nhàng.", "eng": "The rhythmic tread of marching feet."}, {"viet": "Con đường chia thành hai ngả ngay khi qua làng.", "eng": "The road forks just beyond the village."}, {"viet": "Căn phòng đầy khói thuốc lá.", "eng": "The room was full of cigarette smoke."}, {"viet": "Tủ sắt đã bị lục tung và nhiều tài liệu bị đem đi.", "eng": "The safe had been rifled and many documents taken."}, {"viet": "Kế hoạch đặt dưới sự bảo trợ của hội Hướng Đạo.", "eng": "The scheme is under the aegis of the Scout Association."}, {"viet": "Đoạn thứ hai chơi chậm và nghiêm trang.", "eng": "The second movement is a largo."}, {"viet": "Bên trong tối tăm của kho thóc.", "eng": "The shadowy interior of the barn."}, {"viet": "Con tàu nghiêng một cách nguy hiểm nhưng vẫn nổi.", "eng": "The ship was listing badly but still kept afloat."}, {"viet": "Sườn núi, tháp, đống rơm.", "eng": "The side of the mountain, tower, haystack."}, {"viet": "Bầu trời tối sầm khi cơn bão đến gần.", "eng": "The sky turned dark as the storm came near."}, {"viet": "Đất đã được cày xới lên.", "eng": "The soil had been turned up by the plough."}, {"viet": "Con tàu vũ trụ hạ cánh xuống Thái Bình Dương.", "eng": "The spacecraft splashed down in the Pacific."}, {"viet": "Sân vận động đông nghẹt những người hâm mộ đang hò reo.", "eng": "The stadium was packed with chanting fans."}, {"viet": "Nước chảy liên tục đã làm các hòn đá mòn nhẵn.", "eng": "The stones had been worn smooth by the constant flow of water."}, {"viet": "Học sinh ham mê học tập.", "eng": "The student gave himself up to studying."}, {"viet": "Những cánh cửa ở siêu thị đóng tự động.", "eng": "The supermarket doors shut automatically."}, {"viet": "Thầy giáo khiển trách học trò về tội lười biếng.", "eng": "The teacher admonished the boys for being lazy."}, {"viet": "Ấm chè mất cái nắp đúng của nó nhưng cái nắp này thay cũng được.", "eng": "The teapot has lost its proper lid but this one will do instead."}, {"viet": "Tên trộm đã trốn thoát-nó chạy nhanh quá tôi không đuổi kịp.", "eng": "The thief got away-he was too quick for me."}, {"viet": "Tiếng leng keng của cái chuông, của kính vỡ, của đá lạnh được ngoáy trong cốc.", "eng": "The tinkle of a bell, of breaking glass, of ice being stirred in a drink."}, {"viet": "Tàu ở sân ga số 2 là tàu đi London.", "eng": "The train at platform 2 is the London train."}, {"viet": "Quân lính vừa tiến lên vừa toả rộng ra.", "eng": "The troops fanned out as they advanced."}, {"viet": "Hai phần của ống tẩu đã rời ra ở chỗ nối.", "eng": "The two parts of the pipe have separated at the joint."}, {"viet": "Hoa Kỳ là một nước cộng hòa.", "eng": "The United States is a republic."}, {"viet": "Thắng lợi này có tác dụng lấy lại thăng bằng cho những thất bại trước đây của chúng ta.", "eng": "The victory compensates for our earlier defeats."}, {"viet": "Chiến tranh đã được đưa vào lãnh thổ địch.", "eng": "The war was carried into enemy territory."}, {"viet": "Những chiếc bánh xe không thẳng hàng chúng cần phải kéo lại cho thẳng.", "eng": "The wheels are out of alignment-they need to be brought back into alignment."}, {"viet": "Cửa sổ đã bị băng đóng cứng, tôi không mở được.", "eng": "The window has frozen up and I can't open it."}, {"viet": "Công việc được tiến hành theo đúng sự chỉ dẫn của cô ấy.", "eng": "The work was done according to her instructions."}, {"viet": "Người cảnh sát trẻ làm ngơ trước sự trốn chạy của người đàn ông đó bởi vì anh ta thấy thương hại ông ta.", "eng": "The young policeman connived at the man's escape because he felt sorry for him."}, {"viet": "Nhà của họ đầy những đồ trang trí nho nhỏ.", "eng": "Their house is full of little ornaments."}, {"viet": "Công trình của họ đang được hoan nghênh nhiệt liệt như một sự đột phá lớn nhất của thập kỉ trong nghiên cứu ung thư.", "eng": "Their work is being acclaimed as the greatest breakthrough of the decade in cancer research."}, {"viet": "Có ( một cảm giác ) lo âu đang lan truyền.", "eng": "There's ( a feeling of ) unrest in the air."}, {"viet": "Có một đoạn mở đầu khoảng tám gạch nhịp trước khi bắt đầu.", "eng": "There's an intro of eight bars before you come in."}, {"viet": "Chỉ có sự chênh lệch đôi chút giữa hai số ước lượng.", "eng": "There's only a marginal difference between the two estimates."}, {"viet": "Có tới hàng trăm động từ trong tiếng Anh và đa số là động từ có quy tắc.", "eng": "There are hundreds of verbs in English and most are regular."}, {"viet": "Hiện nay vẫn còn nhiều chi phái.", "eng": "There are still many branches today."}, {"viet": "Trong tuần qua không có việc khai báo thêm nào về các ca bệnh dịch tả.", "eng": "There have been no more notifications of cholera cases in the last week."}, {"viet": "Thức ăn ở đây rất đa dạng.", "eng": "There is a variety of food here."}, {"viet": "Có mù tạc hay gì đó ở đít cậu kia kìa.", "eng": "There is some mustard or something on your backside."}, {"viet": "Sau cơn bão mặt nước dâng lên cao.", "eng": "There was a heavy swell after the storm."}, {"viet": "Có khá đông người đến xem trận đấu hôm thứ Bảy.", "eng": "There was quite a respectable crowd at the match on Saturday."}, {"viet": "Sẽ có một bữa đại tiệc tổ chức để chào mừng ông vào tối mai.", "eng": "There will be a banquet in honor of you tomorrow night."}, {"viet": "Những sự sút kém về tài chính sẽ không cho phép tôi đi nghỉ.", "eng": "These financial reverses will prevent my taking a holiday."}, {"viet": "Các ghế này dành riêng cho khách đặc biệt.", "eng": "These seats are reserved for special guests."}, {"viet": "Họ là những người kiểm tra các lò phản ứng hạt nhân.", "eng": "They're the ones who check the nuclear reactors."}, {"viet": "Tất cả đều khoẻ, cám ơn.", "eng": "They are all fine, thank you."}, {"viet": "Họ cho sự ghen tuông là đặc trưng cô em họ cô ta.", "eng": "They attributed feelings of jealousy to her cousin."}, {"viet": "Họ đã âm mưu lật đổ chính phủ.", "eng": "They conspired to overthrow the Government."}, {"viet": "Họ chọn bà ấy thay mặt họ trong uỷ ban.", "eng": "They elected her to represent them on the committee."}, {"viet": "Họ ít thèm muốn của cải.", "eng": "They had little desire for wealth."}, {"viet": "Họ lôi kéo chúng tôi vào công việc từ thiện của họ.", "eng": "They involved us in their charity work."}, {"viet": "Họ có thể thắng trận nhưng chúng tôi sẽ đấu một trận quyết liệt với họ.", "eng": "They may win the game, but we'll give them a run for their money."}, {"viet": "Họ hứa là sẽ làm xong công việc vào tháng Sáu, nhưng liệu họ có thể giữ được lời hứa không?", "eng": "They promise to finish the job in June, but can they deliver?"}, {"viet": "Họ dường như đang ở bình diện tư tưởng khác.", "eng": "They seem to exist on a different spiritual plane."}, {"viet": "Họ thương hại đám con cái của bà ấy và cho chúng một nơi ở.", "eng": "They took compassion on her children and offered them a home."}, {"viet": "Họ khánh kiệt gia sản vì cố gắng trả tiền cho con cái ăn học.", "eng": "They were beggared by trying to pay for their children's education."}, {"viet": "Họ thường lang thang từ nơi này sang nơi khác.", "eng": "They were used to roaming about from place to place."}, {"viet": "Nó đúng với sự miêu tả của chiếc túi bị đánh cắp.", "eng": "This answers to the description of the stolen bag."}, {"viet": "Công ty này rất cần những người mới có tài năng.", "eng": "This company is badly in need of new blood."}, {"viet": "Thất bại này chính là sự trừng phạt anh về cái tội quá lười nhác.", "eng": "This failure is a judgement on you for being so lazy."}, {"viet": "Đây là một trường hợp điển hình về sự thiếu vạch kế hoạch một cách cẩn thận.", "eng": "This is a typical case of lack of proper planning."}, {"viet": "Đảo này là nơi lý tưởng cho những người quan sát các loài chim.", "eng": "This island is a paradise for bird-watchers."}, {"viet": "Cái áo mới này hơi rộng.", "eng": "This new shirt is a bit on the large side."}, {"viet": "Cái bánh put-đinh này có 2 pao quả tươi.", "eng": "This pudding has two pounds of fresh fruit in it."}, {"viet": "Đường phố này tạo ra một khung cảnh đẹp để nhìn đến nhà thờ.", "eng": "This street offers a fine vista of the cathedral."}, {"viet": "Những thua lỗ của năm nay đã xoá sạch lời lãi của năm ngoái.", "eng": "This year's losses have wiped out last year's profits."}, {"viet": "Để tạo ấn tượng cho khách mua hàng, dịch vụ hậu mãi thì thế nào?", "eng": "To impress the buying public, how about the after-sales service?"}, {"viet": "Thương nghiệp đã sớm được phục hồi lại sau hậu quả của chiến tranh.", "eng": "Trade soon recovered from the effects of the war."}, {"viet": "Thường thường cứ mỗi cây có chừng 20 quả.", "eng": "Usually there are about 20 pods on a tree."}, {"viet": "Nước có chứa những lượng chì rất nhỏ.", "eng": "Water containing minute quantities of lead."}, {"viet": "Thưa ông Parkinson, tôi sẽ dành riêng bộ quần áo này cho ông.", "eng": "We'll put the suit aside for you, Mr Parkinson."}, {"viet": "Chúng tôi đang tạo ra những thay đổi theo nhiều hướng khác nhau.", "eng": "We're making changes in various directions."}, {"viet": "Chúng tôi đã tới được bước thu thập các số liệu nhưng chưa phân tích được.", "eng": "We've got as far as collecting our data but we haven't analysed it yet."}, {"viet": "Tất cả chúng ta chơi rất kém.''Hãy nói phần anh thôi, tôi nghĩ là tôi chơi hoàn toàn tốt'.", "eng": "We all played very badly.''Speak for yourself, I think I played quite well'."}, {"viet": "Chúng ta sẵn sàng cất cánh.", "eng": "We are ready for take-off."}, {"viet": "Chúng tôi nhìn thấy cái hồ hiện ra khi quành qua góc phố.", "eng": "We came in view of the lake as we turned the corner."}, {"viet": "Chúng tôi không thể tìm ra địa điểm chúng tôi muốn đến trên bản đồ này.", "eng": "We can't find destination on this map."}, {"viet": "Chúng ta không mang theo bữa ăn trưa.", "eng": "We didn't bring any lunch."}, {"viet": "Chúng tôi đi theo vết chân của anh ấy trên tuyết.", "eng": "We followed his tracks through the snow."}, {"viet": "Lão Thanh tra thuế cứ đến ám chúng ta liên tục.", "eng": "We had sundry visitations from the Tax Inspector."}, {"viet": "Chúng tôi có rượu vang Pháp, giấm và nước xốt cà và dưa muối.", "eng": "We have French wine and vinegar and Thousand Island."}, {"viet": "Chúng tôi vấp phải nhiều khó khăn đột xuất ngay khi còn ở giai đoạn lập kế hoạch.", "eng": "We hit several snags while still at the planning stage."}, {"viet": "Chúng tôi sẽ khâu nó trước khi giặt.", "eng": "We'll stitch it before washing."}, {"viet": "Chúng ta phải có sự ngăn nắp trong cách sắp đặt hồ sơ văn phòng của chúng ta.", "eng": "We must get some method into our office filing."}, {"viet": "Chúng tôi không bao giờ biết tiền của ai.", "eng": "We never discovered whose money it was."}, {"viet": "Chúng tôi nhận được tin là hàng hoá đã được gửi đi.", "eng": "We received advice that the goods had been dispatched."}, {"viet": "Chúng ta nên nhờ ký duyệt ngân phiếu du lịch ở đây.", "eng": "We should have the traveller's cheques countersigned here."}, {"viet": "Chúng tôi rẽ ở góc và thấy con đường đổ xuống rất dốc.", "eng": "We turned the corner and saw that the road descended steeply."}, {"viet": "Chúng tôi kinh sợ khi nghe thấy cô ấy bị giết.", "eng": "We were appalled when we heard that she had been murdered."}, {"viet": "Chúng ta sẽ giàu có an nhàn nếu anh làm việc đó.", "eng": "We will be in clover if you get that job."}, {"viet": "À, ông có thể cho chúng tôi biết mức đặt hàng tối thiểu là bao nhiêu được không?", "eng": "Well, can you tell me what is the minimum order we should place?"}, {"viet": "Này, thực ra chúng ta không thể bảo con phải làm gì trong mọi trường hợp.", "eng": "Well, really we can't tell him what to do in any case."}, {"viet": "Chiều cao của Đỉnh Brilliance là bao nhiêu?", "eng": "What's the height of the Summit of Brilliance?"}, {"viet": "Công việc của bạn có những thuận lợi nào?", "eng": "What are the good points of your job?"}, {"viet": "Người ta làm gì với nó?", "eng": "What do people do with it?"}, {"viet": "Bạn đã đến thăm những di tích lịch sử nào?", "eng": "What historical sites have you visited?"}, {"viet": "Có khả năng thời tiết sẽ tốt hơn không?", "eng": "What is the possibility of the weather improving?"}, {"viet": "Cái gì đã làm cho anh nghi cô ta lấy tiền?", "eng": "What made you suspect her of having taken the money?"}, {"viet": "Nguyên nhân thực sự là gì còn đang để ngỏ cho việc phỏng đoán.", "eng": "What the real cause was is open to conjecture."}, {"viet": "Bao giờ thì anh sẽ nói với em anh về món tiền nó nợ tôi?", "eng": "When are you going to tackle your brother about that money he owes me?"}, {"viet": "Khi tôi tới cô ấy đã đi rồi.", "eng": "When I arrived she had already gone away."}, {"viet": "Khi cô ấy nói cô ấy mệt là có ý muốn nói cô ấy muốn chúng tôi đi.", "eng": "When she said she was tired, it was a hint that she wanted us to go."}, {"viet": "Khi nước đông lại nó trở thành rắn và chúng ta gọi nó là nước đá.", "eng": "When water freezes it becomes solid and we call it ice."}, {"viet": "Tôi có thể mua vé xe buýt ở đâu?", "eng": "Where can I purchase tickets for the bus?"}, {"viet": "Bạn thích nhất cửa hàng bách hóa nào ở Nhật Bản?", "eng": "Which department store in Japan do you like the best?"}, {"viet": "Khi còn đang đi học, Nick đã phải sống trong một căn phòng bé xíu ở một nơi nghèo nàn.", "eng": "While he was studying, Nick has to slum it in a tiny room."}, {"viet": "Nhà soạn nhạc bạn yêu thích là ai?", "eng": "Who is your favorite classical music composer?"}, {"viet": "Tại sao chúng ta không cố gắng mua vé xem cái gì đó tháng sau nhỉ?", "eng": "Why don't we try to get tickets for something next month?"}, {"viet": "Cuối tuần này trời sẽ nóng phải không?", "eng": "Will it be hot this weekend?"}, {"viet": "Xin chỉ cho cháu cách sử dụng vòi sen ạ?", "eng": "Will you show me how to use the shower?"}, {"viet": "Khi cha mẹ đi vắng, tôi tha hồ làm vương làm tướng ở nhà.", "eng": "With my parents away I've got the house to myself."}, {"viet": "Những mối quan tâm, trò tiêu khiển, lo toan... trần tục.", "eng": "Worldly concerns, distractions, preoccupations, etc."}, {"viet": "Bạn có muốn đi xem phim không?", "eng": "Would you like to go and see a movie?"}, {"viet": "Anh làm ơn cho tôi biết một điều gì đó về tài khoản ký thác được không?", "eng": "Would you please tell me something about time deposits?"}, {"viet": "Vâng, tôi có thể mua một vài nhân dân tệ Trung Quốc bằng đô la Mỹ ở đây không?", "eng": "Yes, can I buy some Chinese yuan with American dollars here?"}, {"viet": "Vâng, ông có thể mướn một cái hết 2 đô la trong 2 giờ.", "eng": "Yes, you can rent one for a dollar for two hours."}, {"viet": "Anh phải nhanh lên nếu muốn đến kịp đó lúc chín giờ.", "eng": "You'll have to shift if you want to get there by nine o'clock."}, {"viet": "Chắc chắn ông không đòi 40 pao cho cuốn sách này đấy chứ?''Vâng, giá thế là rẻ đấy ạ!'.", "eng": "You're surely not asking 40 pounds for this book?''Yes-it's cheap at the price!'."}, {"viet": "Anh rõ ràng là không sẵn sàng hợp tác.", "eng": "You are plainly unwilling to co-operate."}, {"viet": "Bạn cũng không thể dùng đèn pin vì hết pin rồi.", "eng": "You can't use the flashlight either because the batteries are dead."}, {"viet": "Anh có thể thấy là cô ta trông giống ông bố.", "eng": "You can see that she favours her father."}, {"viet": "Nếu ông không đầu tư vào những cổ phần này là ông đang từ chối một vận may.", "eng": "You don't invest in these shares, you're saying no to a fortune."}, {"viet": "Anh phải trả cho hành lý quá mức qui định trên máy bay.", "eng": "You have to pay for excess luggage on a plane."}, {"viet": "Bây giờ anh có thể gặp vất vả, nhưng sau này đến lúc nào đó anh sẽ được phần thưởng.", "eng": "You may have to suffer hardships now, but in the fullness of time you will have your reward."}, {"viet": "Anh cần phải ghi tên vào đội.", "eng": "You must put your name down for the team."}, {"viet": "Anh có nhận thấy rằng phải mấy ngày nữa chúng ta mới có tin không?", "eng": "You realize it'll be a matter of days before we get news?"}, {"viet": "Cậu nên kể cho cô ta nghe, vì sớm muộn rồi cô ta cũng khám phá ra.", "eng": "You should tell her, because she'll find out sooner or later."}, {"viet": "Anh sẽ được đưa đến tận biên giới, sau đó anh sẽ phải tự tìm lấy đường đi.", "eng": "You will be accompanied as far as the border, thereafter you must find your own way."}, {"viet": "Quyển tập đẹp đẽ của anh làm cho quyển tập dơ bẩn của tôi trông thật đáng xấu hổ.", "eng": "Your beautiful notebook puts my untidy notebook to shame."}, {"viet": "Đề nghị của ông không đề cập tí nào đến vấn đề có cần một sự thay đổi hay không.", "eng": "Your proposal begs the question whether a change is needed at all."}]