[{"viet": "Người bảo vệ đã bị thương khi ngân hàng bị cướp.", "eng": "A bank guard was hurt when the bank was help up."}, {"viet": "Sự hơi lạnh nhạt trong lời chào hỏi của nàng.", "eng": "A certain frostiness in her greeting."}, {"viet": "Một công ty đã ngưng kinh doanh.", "eng": "A company which has ceased trading."}, {"viet": "Một con đường nhỏ xấu trong khu vực tồi tàn nhất tỉnh.", "eng": "A crummy little street in the worst part of town."}, {"viet": "Một con số lớn đáng lo ngại về tai nạn.", "eng": "A disquietingly large number of accidents."}, {"viet": "Thức khuya một vài đêm thì chẳng hề hại cho ai cả.", "eng": "A few late nights never did anyone any harm."}, {"viet": "Một dòng nước từ ống tuôn ra tràn lan.", "eng": "A free flow of water came from the pipe."}, {"viet": "Một vị cố vấn của chính phủ đã bị một chuyên gia trẻ hơn hạ bệ.", "eng": "A government adviser dethroned by a young expert."}, {"viet": "Một võ sĩ quyền Anh hạng nặng được gọi là người vĩ đại nhất.", "eng": "A heavyweight boxer known as The Greatest."}, {"viet": "Bức tranh đó ghép với 1.000 mảnh.", "eng": "A jig saw with 1,000 pieces."}, {"viet": "Một chiếc lá có kích cỡ bên ngoài to.", "eng": "A leaf with a large surface area."}, {"viet": "Nhiều công việc đọc, sửa bản in thử được giao cho những người làm báo hành nghề tự do.", "eng": "A lot of proof-reading is put out to freelancers."}, {"viet": "Một con chim đầu đàn già dặn của nền văn học Mỹ.", "eng": "A mature statesman of American letters."}, {"viet": "Một buổi tối nghe nhạc với cả nhà quây quần bên chiếc dương cầm.", "eng": "A musical evening with the whole family gathered round the piano."}, {"viet": "Một tiểu thuyết gia tạo ra các nhân vật và một cốt truyện.", "eng": "A novelist creates characters and a plot."}, {"viet": "Một người không thể cùng một lúc lại ở hai nơi được.", "eng": "A person can't be in two places at once."}, {"viet": "Một chính sách phổ biến nền giáo dục cao hơn dành cho tất cả mọi người chứ không chỉ riêng cho một thiểu số có đặc quyền.", "eng": "A policy of making higher education available to all and not just a privileged few."}, {"viet": "Một chiều hướng lâm vào cảnh nợ nần.", "eng": "A propensity for getting into debt."}, {"viet": "Một nghị quyết đòi hỏi những điều kiện tốt đẹp hơn.", "eng": "A resolution in demanding better conditions."}, {"viet": "Một lời giải thích thỏa đáng về sự huyền bí.", "eng": "A satisfactory explanation of the mystery."}, {"viet": "Một cái rùng mình chạy nhanh dọc xuống xương sống của cô ta.", "eng": "A shiver ran down her spine."}, {"viet": "Một xã hội suy đồi về đạo đức.", "eng": "A society that is morally bankrupt."}, {"viet": "Một cấu trúc bằng thép có gỗ cù tùng lấp kín.", "eng": "A steel structure with an infill of redwood sheathing."}, {"viet": "Một nỗ lực có tính toán trước kỹ càng nhằm bôi nhọ thanh danh ai.", "eng": "A systematic attempt to ruin somebody's reputation."}, {"viet": "Một chuyến xe lửa chở những người làm việc đi về thường xuyên.", "eng": "A train carrying commuters to and from work."}, {"viet": "Một sự thiếu thốn lương thực và những đồ y tế.", "eng": "A want of food and medical supplies."}, {"viet": "Một diễn viên trẻ cố gắng một cách tuyệt vọng để được các nhà phê bình quan tâm đến.", "eng": "A young actor trying desperately to be noticed by the critics."}, {"viet": "Hành động không đi đôi với lời nói của hắn.", "eng": "Actions which were not in consonance with his words."}, {"viet": "Sau một thời gian năm năm xa cách cha mẹ của anh ta.", "eng": "After a separation of five years from his parents."}, {"viet": "Sau nhiều tranh luận, chúng tôi quyết định di chuyển đến Oxford.", "eng": "After much debate, we decided to move to Oxford."}, {"viet": "Sau ba tuần lễ cô ta đã quen với sức nóng khủng khiếp đó.", "eng": "After three weeks she had got used to the extreme heat."}, {"viet": "Tất cả mưu chước của cô ta đã không đủ thuyết phục họ bán tài sản đó.", "eng": "All her wiles were not enough to persuade them to sell the property."}, {"viet": "Mọi sự kiện chắc chắn phù hợp với lý thuyết của anh.", "eng": "All the facts certainly fit your theory."}, {"viet": "Dù tuổi đã cao ông ấy vẫn còn rất năng động.", "eng": "Although he's quite old he's still very active."}, {"viet": "Cách đọc thơ truyền cảm của một diễn viên.", "eng": "An actor's sensitive reading of a poem."}, {"viet": "Một tác giả sính tạo ra từ mới.", "eng": "An author with a fondness for neologism."}, {"viet": "Một bản báo cáo về cảnh sống nông thôn đã được lý tưởng hoá.", "eng": "An idealized account of village life."}, {"viet": "Một cụ già tóc trắng như tuyết.", "eng": "An old man with hair as white as snow."}, {"viet": "Còn nữa, vòi hoa sen không đủ áp lực.", "eng": "And, there isn't enough pressure in the shower."}, {"viet": "Một giờ nữa trôi qua và đám đông trở nên bồn chồn.", "eng": "Another hour passed and the crowd grew restive."}, {"viet": "Những cuộc hẹn có thể thỏa thuận với cô thư ký của tôi.", "eng": "Appointments can be made by arrangement with my secretary."}, {"viet": "Tất cả các anh có ngồi đủ gần để thấy được màn ảnh không?", "eng": "Are you all sitting near enough to see the screen?"}, {"viet": "Bạn có chắc chắn điều đó đúng không?", "eng": "Are you sure that is correct?"}, {"viet": "Thông thường nấu một con gà anh nên đun 20 phút cho mỗi cân thịt.", "eng": "As a rule of thumb, you should cook a chicken for 20 minutes for each pound that it weights."}, {"viet": "Vì hàng hóa bị hư hại nên cô ta cảm thấy hoàn toàn có lý do chính đáng để đòi lại tiền.", "eng": "As the goods were damaged she felt fully justified in asking for her money back."}, {"viet": "Thoạt tiên tôi cứ tưởng anh ta nhút nhát, nhưng sau đó tôi khám phá ra rằng anh ta chẳng hề quan tâm đến người khác.", "eng": "At first I thought he was shy, but then I discovered he was just not interested in other people."}, {"viet": "Tấn công là hình thức phòng thủ tốt nhất.", "eng": "Attack is the best form of defense."}, {"viet": "Đập dùi cui vào đầu ai.", "eng": "Bash somebody on the head with a club."}, {"viet": "Là thứ trưởng bộ tài chính.", "eng": "Be Parliamentary under-secretary to the Treasury."}, {"viet": "Trước khi kết thúc chương trình, chúng ta hãy điểm qua tin tức thể thao.", "eng": "Before the end of the programme let's take a glance at the sport news."}, {"viet": "Billy bị bệnh và chán công việc của mình.", "eng": "Billy is sick and tired of his job."}, {"viet": "Những hành động dũng cảm và làm vẻ vang thêm tên tuổi của ai.", "eng": "Brave deeds adding lustre to one's name."}, {"viet": "Các tài khoản đầu tư của các công ty xây dựng sinh lợi nhuận cao.", "eng": "Building societies'investment accounts yield high interest."}, {"viet": "Nhưng nếu ông là chàng trai 25 tuổi thì cô ta có thể không làm vậy.", "eng": "But if you were twenty-five she wouldn't."}, {"viet": "Nhưng con mới học lớp 10 cơ mà.", "eng": "But you're just in the 10th grade."}, {"viet": "Tiện thể cho tôi hỏi, tỉ giá hối đoái của đô la Mỹ là bao nhiêu?", "eng": "By the way, what's the rate of exchange for US dollars?"}, {"viet": "Tôi có thể đi nhờ xe ông một chuyến được không?", "eng": "Can I hitch a ride with you?"}, {"viet": "Ông có thể cho tôi biết rõ hơn về thủ tục mới không?", "eng": "Can you enlighten me as to the new procedure?"}, {"viet": "Ông có nhớ hắn ta trông như thế nào không?", "eng": "Can you remember what he looked like?"}, {"viet": "Cẩn thận! Mày sẽ làm lật úp thuyền đấy.", "eng": "Careful! You'll tip the boat over."}, {"viet": "Kiểm tra điện thế của một dụng cụ so với nguồn điện.", "eng": "Check the voltage of an appliance against the supply."}, {"viet": "Cuộc sống thị thành lôi cuốn nhiều thanh niên nông thôn.", "eng": "City life beckons many country boys."}, {"viet": "Đến ngồi đây-anh đã giữ cho em một chỗ.", "eng": "Come and sit here-I've kept you a place."}, {"viet": "Cư xử một cách đáng kính, đường hoàng, như là một người lịch sự.", "eng": "Conduct oneself honourably, with dignity, like a gentleman."}, {"viet": "Các viên chức thối nát sẽ không cấp giấy phép nếu bạn không đút lót cho họ.", "eng": "Corrupt officials who won't issue permits unless you bribe them."}, {"viet": "Anh có thể giới thiệu một số món cho tôi được không?", "eng": "Could you recommend some to me?"}, {"viet": "Sự ác độc thì hoàn toàn trái ngược với bản chất anh ấy.", "eng": "Cruelty was quite alien to his nature."}, {"viet": "Tháng mười hai là tháng cuối cùng của năm.", "eng": "December is the last month of the year."}, {"viet": "Dù thất vọng anh ta vẫn nở được một nụ cười.", "eng": "Despite his disappointment, he managed a smile."}, {"viet": "Ở trường bạn có ngày hội thể thao không?", "eng": "Did you have a Sports Day at your school?"}, {"viet": "Sự bất mãn kích thích những người đó nổi loạn.", "eng": "Discontent stirred the men to mutiny."}, {"viet": "Nghiên cứu phản ứng phụ của thuốc ngừa thai.", "eng": "Do research on the side-effects of the pill."}, {"viet": "Tài khoản của ông có lãi không?", "eng": "Do you earn interest on the account?"}, {"viet": "Cô có phòng trống nào cho đêm nay không?", "eng": "Do you have any vacancies for tonight?"}, {"viet": "Bạn có thích chiếc áo cánh màu này không?", "eng": "Do you like the blouse in this shade?"}, {"viet": "Anh có quan hệ tốt với ông chủ của anh không?", "eng": "Do you stand well with your boss?"}, {"viet": "Anh muốn giấy có kẻ hàng hay giấy trơn?", "eng": "Do you want ruled paper or plain?"}, {"viet": "Chính phủ nước bạn có tài trợ cho những bà mẹ đơn thân không?", "eng": "Does your government provide financial assistance to single mothers?"}, {"viet": "Đừng đánh giá thấp những thành tựu của cô ta.", "eng": "Don't cry down her real achievements."}, {"viet": "Đừng để cô ấy gây mối bất hòa giữa các anh-cô ta chỉ ghen đấy thôi.", "eng": "Don't let her make mischief between you-she's only jealous."}, {"viet": "Đừng có đứng thọc tay trong túi.", "eng": "Don't stand with your hands in your pockets."}, {"viet": "Anh không thích màu tím dịu hơn, nhạt hơn à?", "eng": "Don't you like the softer, lighter purple better?"}, {"viet": "Tính bền là một tiêu chuẩn chất lượng.", "eng": "Durability is one yardstick of quality."}, {"viet": "Các cuộc vận động bầu cử bao giờ cũng bị phương pháp mị dân và những điều tệ hại hơn chi phối hoàn toàn.", "eng": "Election campaigns have always been riddled with demagogy and worse."}, {"viet": "Phép xã giao rất được coi trọng tại Anh quốc thời Victoria.", "eng": "Etiquette was considered very important in Victorian England."}, {"viet": "Mọi người đều được khám xét trước khi lên máy bay.", "eng": "Everyone was frisked before getting on the plane."}, {"viet": "Lả đi vì nóng sốt và mê sảng.", "eng": "Exhausted by the fever and delirium."}, {"viet": "Sự thay đổi tổ chức có tính tiên liệu.", "eng": "Far-sighted changes in the organization."}, {"viet": "Năm mươi người, không tính trẻ em.", "eng": "Fifty people, not counting the children."}, {"viet": "Các thuyền đánh cá và du thuyền đã theo tàu khách lớn vào cảng.", "eng": "Fishing boats and pleasure-craft followed the great liner into the harbour."}, {"viet": "Bọn côn đồ bóng đá hành động điên loạn khắp thành phố.", "eng": "Football hooligans ran riot through the town."}, {"viet": "May cho anh ta, mark đã nhanh chóng tìm được việc khác.", "eng": "Fortunately for him Mark quickly found another job."}, {"viet": "Làm cho sự khác biệt giữa hai ứng cử viên không rõ rệt.", "eng": "Fuzzing the difference between the two candidates."}, {"viet": "Tống khứ cái thằng điên khùng ưa quấy phá đó đi!", "eng": "Get rid of that meddlesome fool!"}, {"viet": "Sơn hai nước cửa ra vào.", "eng": "Give the door two coats of paint."}, {"viet": "Vàng được khai thác sâu ngầm dưới lòng đất.", "eng": "Gold is mined from deep under ground."}, {"viet": "Ăn mặc cầu kỳ bằng những mảnh tròn lóng lánh và lông chim.", "eng": "Gussied herself up in sequins and feathers."}, {"viet": "Thời gian có trôi qua nhanh không?", "eng": "Hasn't the time gone quickly?"}, {"viet": "Bạn có bao giờ bị cú sốc văn hóa chưa?", "eng": "Have you ever experienced culture shock?"}, {"viet": "Anh đã đấu quần vợt với cô ta chưa?", "eng": "Have you played her at tennis yet?"}, {"viet": "Sau trận ốm, nó cần phải được chăm chút.", "eng": "He'll need to be coddled after his illness."}, {"viet": "Anh ấy đang nộp đơn xin vào làm hai chỗ khác để đảm bảo cho chắc nếu không qua được cuộc phỏng vấn vào làm chỗ này.", "eng": "He's applying for two other jobs as an insurance against not passing the interview for this one."}, {"viet": "Cậu ta phải trơ trẽn lắm mới ăn mặc như vậy mà đi làm.", "eng": "He's got a nerve, going to work dressed like that."}, {"viet": "Anh ấy là một trong những người điềm tĩnh nhất mà tôi biết.", "eng": "He's one of the most even-tempered individuals I know."}, {"viet": "Anh ta rất thông thái nhưng hơi đãng trí.", "eng": "He's very learned but rather absent-minded."}, {"viet": "Ông ta xuất hiện, có nhiều con cái của ông ấy vây quanh.", "eng": "He appeared, surrounded by his numerous progeny."}, {"viet": "Anh ta là bằng chứng cho lời cung khai của tôi.", "eng": "He bore witness to my testimony."}, {"viet": "Nó chẳng biết chơi bóng đá chút nào!", "eng": "He can't play football for nuts!"}, {"viet": "Anh ấy vẫn còn nghe mùi tỏi mà họ đã dùng trong bữa trưa.", "eng": "He could still taste the garlic they'd had for lunch."}, {"viet": "Anh ta chẳng trả lời ngay cả thư của tôi.", "eng": "He didn't answer even my letter."}, {"viet": "Anh ấy lái xe nhanh hơn một năm trước đây.", "eng": "He drives faster than he did a year ago."}, {"viet": "Anh ta ngã xuống nước trước sự khoái trá của bọn trẻ.", "eng": "He fell in the water, much to the entertainment of the children."}, {"viet": "Ông ta giật mình và thình lình thức giấc.", "eng": "He gave a start and woke up suddenly."}, {"viet": "Anh ta bước vào ngành nhiếp ảnh nhờ một bằng Mỹ thuật.", "eng": "He got into photography via a Fine Arts degree."}, {"viet": "Anh ấy quá cố gắng tránh ảnh hưởng của sức gió nên đã đưa máy bay lệch khỏi đường bay.", "eng": "He had overcompensated for the effect of the wind, and taken the aircraft off course."}, {"viet": "Ông ấy bị đau ở ngực.", "eng": "He has an ache in the chest."}, {"viet": "Ông ta có những quan điểm khá mập mờ về vấn đề ấy.", "eng": "He has rather indefinite views on the question."}, {"viet": "Hắn nhận ra ngay sự dễ chịu của môi trường mới này.", "eng": "He immediately noticed the amenity of his new surroundings."}, {"viet": "Anh ta không trước sau như một trong lòng trung thành của mình-lúc thì anh ta ủng hộ họ, lúc thì anh ta chống lại họ.", "eng": "He is inconsistent in his loyalty-sometimes he supports us, sometimes he's against us."}, {"viet": "Hiện giờ anh ấy đang tiếp ai đó.", "eng": "He is with someone right now."}, {"viet": "Ông ta để tiền boa dưới cái đĩa.", "eng": "He left a tip under his plate."}, {"viet": "Hắn trông như thể hắn cần được tắm rửa thật kỹ.", "eng": "He looks as if he needs a good wash."}, {"viet": "Có lẽ ông ta không thể giúp đỡ nhưng hỏi ông ta thì đâu có mất mát gì.", "eng": "He may not be able to help but there's no harm in asking him."}, {"viet": "Hắn thường tô điểm những câu chuyện về những cuộc du lịch của hắn.", "eng": "He often embellishes the tales of his travels."}, {"viet": "Nó chỉ ngọn tháp ở chân trời xa.", "eng": "He pointed to the tower on the distant horizon."}, {"viet": "Anh ấy để toàn tâm toàn ý vào công việc, làm việc ngày đêm.", "eng": "He put his whole self into the job, working night and day."}, {"viet": "Ông ta đề cập tới cuốn sách của cô ta trong bài diễn văn của mình.", "eng": "He referenced her book in his speech."}, {"viet": "Ông ta đã cai trị một đế quốc lớn.", "eng": "He ruled over a great empire."}, {"viet": "Ông ấy là một ông già kỳ quặc.", "eng": "He's an queer old cuss."}, {"viet": "Anh ta ở trong ngành Công binh Hoàng gia Anh.", "eng": "He's in the Royal Engineers."}, {"viet": "Anh ta thật là con người bất tài bé nhỏ làm ra vẻ kẻ cả.", "eng": "He's such a snotty-nosed little wimp."}, {"viet": "Nó đã thoát chết bằng cách trốn ra khỏi nước.", "eng": "He saved his own neck by fleeing the country."}, {"viet": "Anh ta phát biểu những ý kiến phản đối của mình đối với kế hoạch.", "eng": "He set out his objections to the scheme."}, {"viet": "Anh ta mỉm cười chào và gật gật đầu.", "eng": "He smiled his greetings and bobbed his head."}, {"viet": "Anh ta đăm đăm nhìn lơ đãng về phía xa xôi.", "eng": "He stared, unseeing, into the distance."}, {"viet": "Anh ta đã khơi dậy được mối đồng cảm của toàn dân.", "eng": "He succeed in arousing the nation's sympathy."}, {"viet": "Nó nghĩ là toàn thế giới tập trung quanh nó.", "eng": "He thinks the whole world revolves around him."}, {"viet": "Anh ta nắm bánh lái và lái tàu vào cảng.", "eng": "He took the wheel and steered the ship into port."}, {"viet": "Anh ấy véo tai đứa cháu một cách trìu mến.", "eng": "He tweaked the baby's ear affectionately."}, {"viet": "Hắn muốn có thu nhập thường xuyên nhưng lại không muốn làm việc.", "eng": "He wants a regular income but doesn't want to work."}, {"viet": "Anh ấy đòi bán chiếc xe 400 bảng Anh, nhưng chúng tôi yêu cầu bớt còn 350 bảng.", "eng": "He was asking £ 400 for the car, but we cut him down to £ 350."}, {"viet": "Anh ta chết vì bệnh viêm phổi khi còn trẻ.", "eng": "He was cut down by pneumonia at an early age."}, {"viet": "Người ta cho anh uống thuốc gây nôn sau khi anh ấy ăn phải những quả mọng có độc tố.", "eng": "He was given an emetic medicine after eating poisonous berries."}, {"viet": "Ông ta thoá mạ với vợ tôi nhiều nhất.", "eng": "He was most insulting to my wife."}, {"viet": "Ông ta đã được yêu cầu báo cáo lại với ủy ban về khiếu nại đó.", "eng": "He was requested to report back to the committee on the complaint."}, {"viet": "Nó giận đến mức không thể nói được tiếng nào.", "eng": "He was that angry he couldn't say a word."}, {"viet": "Nó đã chặn đường tôi để yêu cầu vay tiền.", "eng": "He waylaid me with a request for a loan."}, {"viet": "Ông ta đã chúc cặp vợ chồng trẻ một cuộc sống hạnh phúc và thành đạt.", "eng": "He wished the young couple a life of happiness and prosperity."}, {"viet": "Anh ta đã viết thư báo là anh sắp về nhà.", "eng": "He wrote that he would be coming home soon."}, {"viet": "Diễn xuất của cô ta đã đem lại niềm vui thích cho hàng triệu người.", "eng": "Her acting has given pleasure to millions."}, {"viet": "Cá tính của cô ta vừa keo kiệt lại vừa hào phóng.", "eng": "Her character was compounded in equal parts of meanness and generosity."}, {"viet": "Những lời cảm ơn quá dạt dào tình cảm của cô ta đã làm bối rối mọi người.", "eng": "Her effusive thanks embarrassed everybody."}, {"viet": "Trong lúc đói kém, ông bà cô ta đã từ Ai-len chuyển đến.", "eng": "Her grandparents came over from Ireland during the famine."}, {"viet": "Sự can thiệp của cô ta đã chấm dứt buổi họp.", "eng": "Her intervention brought the meeting to a close."}, {"viet": "Thái độ ngờ nghệch của cô ta gây ra sự giễu cợt của họ.", "eng": "Her naive attitude provoked their derision."}, {"viet": "Những hoạt động chính trị đã dẫn bà ấy tới sự bất đồng với luật pháp.", "eng": "Her political activities brought her into collision with the law."}, {"viet": "Em gái cô ta mơ mộng suốt ngày, tôi nghĩ là cô ấy đã phải lòng ai.", "eng": "Her sister has been in a trance all day, I think she falls in love with someone."}, {"viet": "Sự tận tụy vị tha của bà ta đối với con cái mình.", "eng": "Her unselfish devotion to her children."}, {"viet": "Chúc mừng hạnh phúc tương lai của bạn!", "eng": "Here's to your future happiness!"}, {"viet": "Cái vẻ ngoài vô tội của anh ta che đậy sự đồng phạm của anh ta trong tội ác.", "eng": "His apparent innocence belied his complicity in the crime."}, {"viet": "Mai con bò đực của anh ấy sẽ đến phối giống cho lũ bò cái nhà ta.", "eng": "His bull will come to serve our cows tomorrow."}, {"viet": "Ông bố đánh cho cậu ta một trận nên thân.", "eng": "His dad gave him a good hiding."}, {"viet": "Mặt nó đầy những vết thâm tím sau trận đánh nhau.", "eng": "His face was a mass of bruises after the fight."}, {"viet": "Kế hoạch tài chính to lớn của anh ấy đã sụp đổ một cách tan tành.", "eng": "His great financial schemes crashed disastrously."}, {"viet": "Những câu chuyện đùa của anh ta làm cả bàn đều vui vẻ.", "eng": "His jokes amused the whole table."}, {"viet": "Doanh nghiệp khiêm tốn của ông ấy cuối cùng bành trướng ra thành một đế quốc siêu thị.", "eng": "His modest business eventually expanded into a supermarket empire."}, {"viet": "Màn biểu diễn không thực sự đạt được trình độ cao thông thường của anh ấy.", "eng": "His performance didn't really come up to his usual high standard."}, {"viet": "Câu trả lời của ông ta đầy sự lảng tránh và gần như là dối trá.", "eng": "His replies were full of evasions and half-truths."}, {"viet": "Truyện của ông ta mở ra những thế giới mới của tưởng tượng.", "eng": "His stories opened up new worlds of the imagination."}, {"viet": "Quan điểm của ông ta về án tử hình là không thể chấp nhận được đối với nhiều người.", "eng": "His views on capital punishment are unpalatable to many."}, {"viet": "Nén cảm xúc, sự bực tức, cơn tức giận, v. v. của mình.", "eng": "Hold in one's feelings, temper, anger, etc."}, {"viet": "Các khách sạn thường tăng giá cả vào mùa đông khách du lịch.", "eng": "Hotels usually raise their prices in the high season."}, {"viet": "Chúng ta làm thế nào để vô hiệu hoá sự tuyên truyền của địch?", "eng": "How can we nullify the enemy's propaganda?"}, {"viet": "Tôi mặc cái áo này trông thế nào?''Trông đẹp lắm'.", "eng": "How do I look in this dress?''You look very nice in it'."}, {"viet": "Nồng độ của các thứ rượu được đo như thế nào?", "eng": "How is the strength of alcoholic drinks measured?"}, {"viet": "Tôi sẽ rửa cho bà bao nhiêu tấm hình?", "eng": "How many copies shall I print off for you?"}, {"viet": "Các khoản tiền trả thêm là bao nhiêu?", "eng": "How much are the bonus payments?"}, {"viet": "Cách bao lâu bạn về thăm quê bạn?", "eng": "How often do you visit your hometown?"}, {"viet": "Hàng trăm chiếc thuyền nhỏ đi theo con tàu chở hành khách vào cảng.", "eng": "Hundreds of small crafts accompany the liner into harbour."}, {"viet": "Tôi thật lòng muốn chúc mừng anh nhân ngày hôn lễ của anh.", "eng": "I'd like to heartily congratulate you on your marriage."}, {"viet": "Tôi sẽ mua thêm thịt và chỉ việc đem ướp lạnh thôi.", "eng": "I'll buy extra meat and just freeze it."}, {"viet": "Tôi sẽ cuộc 3 ăn 1 rằng nó sẽ xin được việc làm đó.", "eng": "I'll lay odds of three to one that he gets the job."}, {"viet": "Tôi sẽ đợi thêm chút nữa.", "eng": "I'll wait a little longer."}, {"viet": "Tôi mệt đứ đừ sau trận quần vợt đó.", "eng": "I'm completely buggered after that game of tennis."}, {"viet": "Tôi sẽ đến bệnh viện thăm anh tôi.", "eng": "I'm going to the hospital to visit my brother."}, {"viet": "Tôi sẽ không đi, trước hết tôi không có vé, và sau nữa là tôi không thích vở kịch này.", "eng": "I'm not going, to begin with I haven't a ticket, and secondly I don't like the play."}, {"viet": "Hôm nay tôi mệt quá, tôi không thể tập trung vào cái gì được cả.", "eng": "I'm so tired that I can't focus on anything today."}, {"viet": "Tôi chắc là cái đồng hồ đeo tay của anh sẽ được tìm ra trong một ngày gần đây.", "eng": "I'm sure your watch will turn up one of these days."}, {"viet": "Tôi luôn luôn thấy cô ấy thóc mách một cách không thể chịu được.", "eng": "I've always found her unbearably nosey."}, {"viet": "Tôi đã quyết định nhận việc ở công ty ABC.", "eng": "I've decided to take a job with ABC Corporation."}, {"viet": "Tôi vừa mới được tăng lương 2000 pao.", "eng": "I've just been given a 2000 pounds pay rise."}, {"viet": "Tôi đã nói chuyện với anh ta trên điện thoại nhưng thật ra tôi chưa bao giờ gặp anh ta cả.", "eng": "I've spoken to him on the telephone but I've never actually met him."}, {"viet": "Tôi luôn luôn đưa cho đứa bé một chiếc bát nhựa để nó khỏi đập vỡ.", "eng": "I always give the body a plastic bowl so he can't break it."}, {"viet": "Tôi bắt giữ anh vì tội mưu toan ăn trộm.", "eng": "I am placing you under arrest for attempted burglary."}, {"viet": "Tôi hỏi bác sĩ liệu tôi có thể ngồi dậy được không.", "eng": "I asked the doctor if I could get up."}, {"viet": "Cháu mang đến cho bác chút quà ở Nhật.", "eng": "I brought you something from Japan."}, {"viet": "Tối nay tôi không thể đi chơi được, tôi bị ỉa chảy.", "eng": "I can't go out tonight, i got a case of back-door trot."}, {"viet": "Tôi không thể làm việc trong này được, thật quá ồn ào.", "eng": "I can't work in here-it's far too noisy."}, {"viet": "Tôi không thể chấp nhận việc anh ta lấy vợ như thế.", "eng": "I cannot approve of his marrying so young."}, {"viet": "Tôi bắt được nó ngay khi nó sắp rời tòa nhà.", "eng": "I caught him just as he was leaving the building."}, {"viet": "Không ngủ được, suốt đêm trở mình trằn trọc trên giường.", "eng": "I couldn't sleep, but kept tossing and tossing about in bed all night."}, {"viet": "Tôi có thể giao phó cả cuộc đời tôi cho anh ấy.", "eng": "I'd trust him with my life."}, {"viet": "Tôi không thích việc anh ta nhận tất cả công lao.", "eng": "I didn't like him all the credit."}, {"viet": "Tôi không hiểu làm thế nào bà ấy chịu đựng được sự độc ác của nó đối với bà ấy.", "eng": "I don't know how she puts up with his cruelty to her."}, {"viet": "Tôi không thường gặp cô ấy vì cô ấy ở xa.", "eng": "I don't see her much because she lives so far away."}, {"viet": "Tôi không muốn nghe anh ca thán nữa?", "eng": "I don't want to hear another peep out of you?"}, {"viet": "Tôi không nghĩ là trí óc hắn hoàn toàn sáng suốt.", "eng": "I don't think he's quite all there."}, {"viet": "Hôm nay, tôi cảm thấy hơi khó ở.", "eng": "I feel a bit under the weather today."}, {"viet": "Tôi cảm thấy đau buồn về việc không thể giúp đỡ cô ta.", "eng": "I felt wretched about not being able to help her."}, {"viet": "Tôi tặng cô ấy vài hộp sôcôla gọi là đôi chút cảm ơn.", "eng": "I gave her some chocolates as a small thank-you."}, {"viet": "Tôi nghĩ nó không là lực sĩ như tôi thuở xưa.", "eng": "I guess he's not the athlete I was."}, {"viet": "Tôi có cảm giác rõ rệt là lúc đó tôi đang bị theo dõi.", "eng": "I had the distinct impression that I was being followed."}, {"viet": "Tôi có một số điều phàn nàn về căn phòng khách sạn các ông đã dành cho tôi.", "eng": "I have a number of complaints about the hotel room you've given me."}, {"viet": "Tôi không có khái niệm về chỗ một trận đánh giống cái gì.", "eng": "I have no conception of what a battle likes."}, {"viet": "Tôi phải lấy lòng ông chủ vì tôi cần xin tăng lương.", "eng": "I have to keep my boss sweet because I need to ask for a rise."}, {"viet": "Tôi chưa hề đọc một cuốn sách nào của Tôlstôi.", "eng": "I haven't read any books by Tolstoy."}, {"viet": "Tôi hy vọng tôi sẽ không làm gián đoạn bữa ăn tối.", "eng": "I hope I am not interrupting dinner."}, {"viet": "Tôi đòi hỏi anh phải có ngay biện pháp sửa sai điều này.", "eng": "I insist on your taking immediate action to put this right."}, {"viet": "Tôi biết tôi có thể giao những đứa nhỏ cho anh chăm sóc.", "eng": "I know I can trust my children with you."}, {"viet": "Tôi thích trời nắng nhiều vào ngày nghỉ.", "eng": "I like lots of sun on holiday."}, {"viet": "Trên đường về nhà tôi sẽ mua bánh mì.", "eng": "I'll buy some bread on my way home."}, {"viet": "Tôi sẽ chạy đua với anh tới trường.", "eng": "I'll race you to school."}, {"viet": "Tôi e rằng tôi đã quá muộn.", "eng": "I'm afraid I'm awfully late."}, {"viet": "Tôi rất vui khi nói rằng bà ấy đang hồi phục dần.", "eng": "I'm happy to say that she's improving."}, {"viet": "Tôi thật tình cám ơn cả bố cháu và cháu.", "eng": "I'm so grateful to all of you."}, {"viet": "Tôi xoay xở để vừa đủ sống bằng cách bán những bức tranh của tôi.", "eng": "I manage to scrape a living by selling my pictures."}, {"viet": "Chắc tôi đã bị quẫn trí-trong một chốc, tôi không thể nhớ ra số điện thoại của mình nữa.", "eng": "I must have had a brainstorm-I couldn't remember my own telephone number for a moment."}, {"viet": "Tôi cần phải lau sạch kính chắn gió.", "eng": "I need to wipe the windshield."}, {"viet": "Tôi có bỏ nhưng không thể được.", "eng": "I ought to, but I can't."}, {"viet": "Tôi vừa lắp vào ngày hôm qua thôi.", "eng": "I put them on just yesterday."}, {"viet": "Tôi giật lùi lại trước con rắn trong nỗi kinh hoàng.", "eng": "I recoiled in horror from the snake."}, {"viet": "Tôi ngồi nhỏm lên trên giường khi tôi nghe thấy tiếng động.", "eng": "I sat up in bed when I heard the noise."}, {"viet": "Tôi sẽ chóng gặp lại anh ta.", "eng": "I shall be seeing him soon."}, {"viet": "Tôi đã bị con dao sắc cứa vào ngón tay.", "eng": "I snicked my finger on the sharp knife."}, {"viet": "Tôi nghĩ là anh lại muốn mượn tiền tôi, phải không?", "eng": "I suppose you want to borrow money from me again?"}, {"viet": "Tôi nghĩ mình cũng nên bắt đầu tập luyện thôi.", "eng": "I think I'm going to start working out."}, {"viet": "Tôi nghĩ hệ thống mới này có nhiều điểm thuận lợi.", "eng": "I think this new system has a lot going for it."}, {"viet": "Tôi đã bảo anh ấy là cứ phát biểu về bất cứ chủ đề nào mà anh ấy muốn.", "eng": "I told him to speak on any subject he wanted."}, {"viet": "Tôi biết là ông Milton đã đề ra được một chiến dịch quảng cáo đầy ấn tượng cho chúng ta.", "eng": "I understand that Mr. Milton has worked out an impressive advertising campaign for us."}, {"viet": "Tôi muốn có tiền mặt ngay.", "eng": "I want cash on the nail."}, {"viet": "Tôi muốn sống hết quãng đời còn lại trên một hòn đảo miền nhiệt đới.", "eng": "I want to spend the rest of my life on a tropical island."}, {"viet": "Tôi bị muộn do tắc đường.", "eng": "I was delayed by the traffic."}, {"viet": "Câu chuyện đó làm tôi xúc động.", "eng": "I was moved by that story."}, {"viet": "Tôi rất vui vì kỳ thi đã kết thúc.", "eng": "I was thankful that the exams were over."}, {"viet": "I will có thể được rút gọn lại thành I'll.", "eng": "I will can be contracted to I'll."}, {"viet": "Tôi mong anh không sụt sịt nữa.", "eng": "I wish you wouldn't keep sniffling."}, {"viet": "Tôi làm việc cho cả điện ảnh và truyền hình.", "eng": "I work for both the big and the small screen."}, {"viet": "Tôi muốn gọi thức ăn sang.", "eng": "I would like to place an order for breakfast."}, {"viet": "Tôi lập tức viết thư trả lời để cám ơn lời mời của họ.", "eng": "I wrote back immediately to thank them for the invitation."}, {"viet": "Tôi mà biết nhiệm vụ nặng nề dường này trước khi nhận thì tôi đã chẳng bao giờ thử làm.", "eng": "If I'd known the enormity of the task before I took it on, I wouldn't have attempted it."}, {"viet": "Dù cô ta có ngu đi chăng nữa thì ít nhất cô ta cũng là người lương thiện.", "eng": "If she's stupid, at least she's honest."}, {"viet": "Nếu tất cả chúng ta cùng cộng tác thì chúng ta sẽ hoàn thành việc này vào lúc năm giờ.", "eng": "If we all cooperate we'll finish this by five o'clock."}, {"viet": "Nếu anh không có điều kiện có được bản mới của quyển sách, có lẽ anh có thể tìm được một bản đã dùng rồi.", "eng": "If you can't afford a new copy of the book, perhaps you can find a second-hand one."}, {"viet": "Nếu anh cứ tiếp tục như vậy thì sẽ bị ghét.", "eng": "If you go on like that you'll get yourself disliked."}, {"viet": "Nếu anh tưởng rằng tôi sẽ cho anh mượn ô tô của tôi thì anh có thể suy nghĩ lại đi!", "eng": "If you think I'm going to lend you my car you can think again!"}, {"viet": "Nhân viên phụ trách về nhập cư sẽ đòi xem giấy tờ của ông.", "eng": "Immigration officials will ask to see your papers."}, {"viet": "Ở những nước phải khó khăn mới được một nền giáo dục thì người ta càng trân trọng nó khi có được nó.", "eng": "In countries where it's difficult to get an education, people appreciate it more when they do get it."}, {"viet": "Tại vùng Mãn Châu, mùa đông rất lạnh lẽo.", "eng": "In Manchuria the winters are very cold."}, {"viet": "Nếu vậy thì ông nên gửi thư bảo đảm thì hơn.", "eng": "In that case, you'd better have it registered."}, {"viet": "Trong cuộc đấu tranh sinh tồn, cái cây con hay động vật con ấy có lẽ là thứ thích ứng nhất để sống sót.", "eng": "In the struggle to live, this plant or animal is the one most likely to survive."}, {"viet": "Nhà nước ngày càng giữ một vai trò lãnh đạo độc đoán trong lĩnh vực này.", "eng": "Increasingly the state is taking a big brother in this area."}, {"viet": "Ông ấy có khó gần không?", "eng": "Is he hard to get along with?"}, {"viet": "Từ psychosis có trong ngôn ngữ cá nhân của anh không?", "eng": "Is the word psychosis part of your idiolect?"}, {"viet": "Đây là nơi kiểm tra để lên máy bay chứ?", "eng": "Is this where I check in?"}, {"viet": "Cho trẻ con ăn thật là công việc vất vả.", "eng": "It's a real hassle to get the children to eat."}, {"viet": "Cung cách cô ta nói dối và lừa đảo để giành lấy những gì cô ta muốn thật là nhục nhã.", "eng": "It's criminal the way she lies and cheats to get what she wants."}, {"viet": "Điều quan trọng là phải phân biệt thực tế với hư cấu.", "eng": "It's important to distinguish fact from fiction."}, {"viet": "Bạn cũng biết đúng ra một người sống tân thời cũng phải tiêu nhiều tiền đó.", "eng": "It's not exactly cheap to be a swinger, you know."}, {"viet": "Đã lâu lắm trời không mưa đến nỗi lòng sông khô cạn.", "eng": "It's so long since it rained that the river-bed is dry."}, {"viet": "Họ thật là táo bạo đã cố gắng mở một công việc kinh doanh như vậy.", "eng": "It's very enterprising of them to try and start up a business like that."}, {"viet": "Nó chẳng làm cho mình thích thú tí nào.", "eng": "It doesn't grab me at all."}, {"viet": "Trong tình hình kinh tế hiện nay thật khó tìm được việc làm.", "eng": "It is difficult to find work in the present economic situation."}, {"viet": "Đọc và sửa các bản in thử là một phần nhiệm vụ của anh.", "eng": "It is part of your duties to proof-read."}, {"viet": "Với tôi ) điều anh nói chẳng có gì quan trọng: tôi sẽ không đi, anh nói gì thì nói: tôi không đi đâu.", "eng": "It makes no difference ( to me ) what you say, I'm not going."}, {"viet": "Tám ngàn đô la một năm.", "eng": "It's eight thousand dollars a year."}, {"viet": "Dường như mọi người đều coi cuộc hôn nhân của họ là thất bại ngay cả trước khi tạo cho nó một cơ may thực sự.", "eng": "It seemed that everyone had written off their marriage even before it had been given a proper chance."}, {"viet": "Cảnh sát đã mất nhiều ngày để theo dõi con mồi của họ.", "eng": "It took the police several days to track down then quarry."}, {"viet": "Cô ta thật là can đảm dám phản đối ông chủ của cô ấy.", "eng": "It was courageous of her to oppose her boss."}, {"viet": "Anh ta là con người vô tình, đấy là nói nhẹ nhất.", "eng": "It was rather thoughtless of him, to say the least."}, {"viet": "Không dễ gì nâng giá uýt-ki ngon lên.", "eng": "It will not be easy to hoist price of better whiskies."}, {"viet": "Tài năng của Jane Austen trong sự mô tả tính cách nhân vật.", "eng": "Jane Austen's skill at characterization."}, {"viet": "Johnny luôn luôn hành động một cách ngu xuẩn trong giờ học.", "eng": "Johnny's always playing the fool during lessons."}, {"viet": "Cứ ngồi đấy! Không được cho ai nhìn thấy anh.", "eng": "Keep down! You mustn't let anybody see you."}, {"viet": "Chúng ta hãy đổi chỗ nhé-từ chỗ này em sẽ có thể nhìn thấy rõ hơn.", "eng": "Let's change places-you'll be able to see better from here."}, {"viet": "Chúng ta hãy gửi cho Paul một bức điện tín khác đi.", "eng": "Let's send another cable to Paul."}, {"viet": "Nhiều thí dụ và thông tin ngoài ngữ pháp là trong số những khía cạnh đặc trưng của cuốn từ điển này.", "eng": "Many examples and extra grammatical information are among the special features of this dictionary."}, {"viet": "Nhiều cử tri đã không hài lòng với chính sách của chính phủ.", "eng": "Many voters are displeased with the government's policies."}, {"viet": "Xin phép cho em đi vệ sinh, thưa cô Taylor?", "eng": "May I go to the rest room, Mrs. Taylor?"}, {"viet": "Có lẽ chúng ta có thể nói chuyện sau khi tôi nói chuyện điện thoại.", "eng": "Maybe we could talk after my phone call."}, {"viet": "Phần lớn da mặt anh ta bị cháy xém trong vụ hoả hoạn.", "eng": "Most of the skin on his face got burnt away in the fire."}, {"viet": "Hầu hết sự hiểu biết của chúng tôi về công trình của anh ấy là dựa vào một tiểu sử.", "eng": "Much of our knowledge, and consequently much of our appreciation of his work is based on one biography."}, {"viet": "Con gái tôi là một học sinh trung học.", "eng": "My daughter is a high school student."}, {"viet": "Cảm tưởng của tôi là cô ấy nói không thật lòng.", "eng": "My impression is that she in not telling the truth."}, {"viet": "Ý thích của tôi là nhà hát hơn rạp chiếu bóng.", "eng": "My preference is for the theatre rather than the cinema."}, {"viet": "Tình đoàn kết dân tộc khi phải đương đầu với hiểm nguy.", "eng": "National solidarity in the face of danger."}, {"viet": "Thứ ba tới là hạn chót phải gửi đơn.", "eng": "Next Tuesday is the deadline for sending in your application."}, {"viet": "Không có sự khác biệt rõ ràng tồn tại giữa các loại khách sạn khác nhau.", "eng": "No firm distinction exists between the different kinds of hotels."}, {"viet": "Bây giờ thì anh bị sai đi làm tất cả những việc này.", "eng": "Now, I'm asked to do all these things."}, {"viet": "Tuân theo tinh thần, chứ không phải lời văn của luật pháp.", "eng": "Obey the spirit, not the letter of the law."}, {"viet": "Ồ, còn gia đình McDonald có gửi thiệp mời ăn tối.", "eng": "Oh, yes, the McDonalds sent me a dinner invitation."}, {"viet": "Trên lĩnh vực đối nội, tài chính, giáo dục, v. v.", "eng": "On the domestic, financial, education, etc front."}, {"viet": "Một trong những khả năng ít được biết đến của anh ấy là tài vẽ tranh biếm hoạ.", "eng": "One of his less well-known accomplishment was his ability to draw cartoons."}, {"viet": "Đại sứ của chúng tôi có toàn quyền.", "eng": "Our ambassador has plenipotentiary power."}, {"viet": "Hoá đơn khí đốt của chúng tôi cho quý vừa qua cao một cách bất thường.", "eng": "Our gas bill for the last quarter was unusually high."}, {"viet": "Giá của chúng ta khác với giá của những nhà cạnh tranh với chúng ta một cách không chấp nhận được.", "eng": "Our prices are out of line with those of our competitors."}, {"viet": "Bị tội lỗi, sự hối hận, nợ nần đè nặng.", "eng": "Overburdened with guilt, remorse, debt."}, {"viet": "Phải trả hội phí cho thư ký của câu lạc bộ.", "eng": "Payment of subscriptions should be made to the club secretary."}, {"viet": "Có lẽ một ngày gần đây chúng ta có thể họp mặt nhau lại.", "eng": "Perhaps we could get together one of these days."}, {"viet": "Cảnh sát nói rằng một số tiền giả đang được lưu hành.", "eng": "Police say a number of forged banknotes are in circulation."}, {"viet": "Bạn biết làm người giàu lúc nào cũng thoải mái.", "eng": "Rich people always have easy lives, you know."}, {"viet": "Nhiều nguyên nhân gộp lại đã gây ra chiến tranh.", "eng": "Several causes operated to bring about the war."}, {"viet": "Cô ấy sẽ tố giác nếu chúng ta gây áp lực.", "eng": "She'll sing if we put the pressure on."}, {"viet": "Gần đây cô ấy bị ốm nhiều nhưng bây giờ trông cô ấy rất khoẻ.", "eng": "She's been ill a lot recently but she's looking very well now."}, {"viet": "Cô ấy không vui vì anh không đến thăm cô ấy.", "eng": "She's hurt because you haven't visited her."}, {"viet": "Cô ta hết sức học hành để trau dồi tiếng Pháp của cô ta.", "eng": "She's putting a lot of work into improving her French."}, {"viet": "Cô ấy đã khéo léo xin nghỉ thêm được một tuần cho mình.", "eng": "She's wangled an extra week's holiday for herself."}, {"viet": "Cô ấy quả quyết việc này đã xảy ra.", "eng": "She avers that this has really happened."}, {"viet": "Bà ta thách thức tờ báo chứng minh câu chuyện của mình.", "eng": "She challenged the newspaper to prove its story."}, {"viet": "Cô ấy không dám xuất hiện trên phố.", "eng": "She daren't show her face in the street."}, {"viet": "Cô ta không tỏ ra thích lấy anh cho lắm.", "eng": "She doesn't much desire to manifest him."}, {"viet": "Cô ta cảm thấy thực sự vui mừng sau khi đã qua được kỳ thi lấy bằng lái xe.", "eng": "She felt really bucked after passing her driving test."}, {"viet": "Cô ta không để lộ ra một dấu hiệu bên ngoài nào về nỗi buồn mà chắc chắn cô ta phải cảm thấy.", "eng": "She gives no outward sign of the sadness she must feel."}, {"viet": "Cô ta đã xỏ lỗ tai để đeo bông tai.", "eng": "She had her ears pierced so that she could wear earring."}, {"viet": "Cô ta đã được nhìn nhận là có khả năng trở nên một ngôi sao quần vợt trong tương lai.", "eng": "She has been spotted as a likely tennis star of the future."}, {"viet": "Cô ấy cầm con chim nhỏ trong lòng bàn tay.", "eng": "She held the small bird in the hollow of her hand."}, {"viet": "Cô ấy chẳng bao giờ nghỉ việc mà không có lý do chính đáng.", "eng": "She is never absent from work without good cause."}, {"viet": "Cô ta đã bắt chúng tôi phải đợi mà chẳng cảm thấy một chút ân hận nào cả.", "eng": "She kept us waiting without the slightest compunction."}, {"viet": "Cô ta trông đẹp rực rỡ trong ánh lửa.", "eng": "She looked beautifully in the fire light."}, {"viet": "Cô ấy bị đặt nhầm chỗ vào công việc đó, cô ấy có thể làm một công việc gì đó sáng tạo hơn.", "eng": "She misplaced in that job, she ought to be doing something more creative."}, {"viet": "Bà làm nhiệm vụ của một công chúa một cách đầy tự tin.", "eng": "She performs the duties of a princess with great aplomb."}, {"viet": "Cô ấy đã phản ứng một cách giận dữ đối với những lời phê bình có ý tốt của tôi.", "eng": "She reacted angrily to my well-intentioned remarks."}, {"viet": "Cô ta đã đóng trong nhiều vở nhạc kịch câm.", "eng": "She's acted in a lot of pantomime."}, {"viet": "Cô ta cao hơn 2 mét.", "eng": "She's over two metres tall."}, {"viet": "Cô ta nói rằng cô ta không thích trẻ con nói chung.", "eng": "She says she doesn't like children in the mass."}, {"viet": "Trên sân khấu cô ta biểu lộ sự tự tin phi thường đối với một người còn trẻ như cô.", "eng": "She shows remarkable assurance on stage for one so young."}, {"viet": "Bà ta đã ở lại Lagos hơn một tháng.", "eng": "She stayed in Lagos over a month."}, {"viet": "Cô ấy có ý độc quyền cuộc chuyện trò.", "eng": "She tended to monopolize the conversation."}, {"viet": "Cô ấy hướng cái nhìn lo âu từ người này sang người khác.", "eng": "She turned her worried gaze from one person to the other."}, {"viet": "Bà ấy có một ảnh hưởng mạnh mẽ trong phong trào phụ nữ.", "eng": "She was a powerful force in the women's movement."}, {"viet": "Bà ta hoàn toàn lúng túng trước những câu hỏi đặt cho bà.", "eng": "She was completely flummoxed by the questions put to her."}, {"viet": "Cô ta ở trong một trạng thái xúc động ra mặt.", "eng": "She was in a state of visible agitation."}, {"viet": "Hôm chủ nhật người ta nói bà ấy bị chấn thương não.", "eng": "She was pronounced brain dead on Sunday."}, {"viet": "Cô ta là người độc nhất có thể làm được việc đó.", "eng": "She was the only person able to do it."}, {"viet": "Cô ta lại trở về ngôi nhà lạnh lẽo buồn tẻ của cô ta.", "eng": "She went back to her cold unwelcoming house."}, {"viet": "Nàng giành được vài cúp về môn bắn súng.", "eng": "She won several cups for shooting."}, {"viet": "Rượu Seri làm đau đầu nhưng hắn vẫn uống vì không có gì khác.", "eng": "Sherry gave him a headache but he drank it faute de mieux."}, {"viet": "Ngán ăn cái món bắp cải luộc bữa nào cũng có.", "eng": "Sick to death of eating boiled cabbage with every meal."}, {"viet": "Ngồi suy nghĩ miên man về các biến cố trong ngày.", "eng": "Sit musing on the events of the day."}, {"viet": "Mỉm cười một cách tự mãn trước những thất bại của các người khác.", "eng": "Smile smugly at the failures of others."}, {"viet": "Họ đã ăn quá nhiều đến nỗi không thể nhúc nhích trong cả giờ đồng hồ sau.", "eng": "So much did they eat that they could not move for the next hour."}, {"viet": "Người có quan điểm rất chính trị.", "eng": "Some body who is very political in outlook."}, {"viet": "Một vài thành viên nghiệp đoàn không muốn ngăn cản.", "eng": "Some of the union members did not want to picket."}, {"viet": "Về mặt nào đó thứ người sống đang hành hạ người chết.", "eng": "Some ways the living tyrannize the dying."}, {"viet": "Xin lỗi, tôi đã có kế hoạch cho thứ bảy rồi.", "eng": "Sorry, I've already made plans for Saturday."}, {"viet": "Chuyến đáp xuống biển của tàu vũ trụ được hoạch định vào lúc 5.30 sáng.", "eng": "Splashdown was scheduled for 5.30 am."}, {"viet": "Tăng cường chiến dịch vận động giải trừ vũ khí hạt nhân.", "eng": "Step up the campaign for nuclear disarmament."}, {"viet": "Thức khuya để xem bộ phim trên TV.", "eng": "Stop up late to watch a film on TV."}, {"viet": "Thành công trong kinh doanh chỉ là vấn đề biết được khi nào thì phải giành lấy cơ hội.", "eng": "Success in business is simply a matter of knowing when to take a chance."}, {"viet": "Đường và bột bị phân huỷ khi vào bào tử.", "eng": "Sugar and starch me broken down in the stomach."}, {"viet": "Những con thiên nga vụng về kỳ lạ khi ở trên mặt đất.", "eng": "Swans are surprisingly awkward on land."}, {"viet": "Đi lối rẽ thứ nhì sau khi đi qua nhà ga.", "eng": "Take the second turning after the station."}, {"viet": "Truyền hình đã giáng một đòn rất nặng vào ngành công nghiệp điện ảnh.", "eng": "Television has hit the cinema industry very hard."}, {"viet": "Xin cảm ơn ông về sự tiếp đãi niềm nở của ông.", "eng": "Thank you for your kind hospitality."}, {"viet": "Bởi vậy cho nên em cứ luôn bảo anh phải lắp đặt một hệ thống chỉ đường trong xe hơi.", "eng": "That's why I'm always telling you to install a car navigation system."}, {"viet": "Thằng con trai ngu xuẩn của tôi đã làm hỏng chiếc xe mới của nó rồi.", "eng": "That fool son of mine has smashed up his new car."}, {"viet": "Chắc lại tiệc tùng gì đó, tôi nghe thấy anh nôn suốt đêm sau khi về nhà.", "eng": "That must have been some party, i heard you airing your belly for most of the night, after you got home."}, {"viet": "Đó là mối băn khoăn ít nhất của tôi.", "eng": "That's the least of my anxieties."}, {"viet": "Đó là phần hay nhất trong ngày.", "eng": "That was the best part of the day."}, {"viet": "Số tài khoản đúng là 768-0-8211.", "eng": "The account should be 768-0-8211."}, {"viet": "Hợp đồng đã được tôi giữ đúng còn anh ấy thì không.", "eng": "The agreement has been kept on my part but not on his."}, {"viet": "Việc chú giải cuốn sách mất của ông ấy nhiều thì giờ.", "eng": "The annotation of the book took him a lot of time."}, {"viet": "Những vùng đất khô cằn của sa mạc Sahara.", "eng": "The arid wastes of the Sahara."}, {"viet": "Bản danh mục kèm theo cho biết chi tiết về hàng hoá chở trên tàu.", "eng": "The attached schedule gives details of the shipment."}, {"viet": "Những chiếc răng cửa đầu tiên của em bé vừa nhú lên.", "eng": "The baby's first front teeth are just coming through."}, {"viet": "Ngân hàng cho phép ứng tiền cho chứng khoán của ông ấy.", "eng": "The bank allowed to advance money against his securities."}, {"viet": "Từ nhà tôi tới bãi biển có thể đi bộ được.", "eng": "The beach is within walking distance of my house."}, {"viet": "Quả bóng bi a lăn nhẹ nhàng ngang qua bàn.", "eng": "The billiard ball travelled gently across the table."}, {"viet": "Chiếc thuyền đâm vào một bãi cát và mắc cạn nhưng chẳng bao lâu chúng tôi đã làm cho nó lại nổi.", "eng": "The boat stuck on a sandbank but we soon got it afloat again."}, {"viet": "Cuốn sách này đã được dịch chưa có sự cho phép của tác giả.", "eng": "The book was translated without the sanction of the author."}, {"viet": "Bọn trẻ giả bộ làm như chúng là những nhà du hành vũ trụ.", "eng": "The boys made believe that they were astronauts."}, {"viet": "Những vấn đề ám ảnh làm mờ mắt: giá cả cao và khả năng sản xuất thấp.", "eng": "The bugaboos that have plagued vision systems: high price and slow throughput."}, {"viet": "Việc kinh doanh sụp đổ bất chấp sự bắt đầu tuyệt diệu.", "eng": "The business collapsed despite a brave start."}, {"viet": "Chiếc xe ôtô xóc chồm chồm trên đường núi mấp mô.", "eng": "The car bounced along the bumpy mountain road."}, {"viet": "Chiếc xe ôtô lạc tay lái và đâm mạnh vào bên hông một chiếc xe buýt.", "eng": "The car went out of control and ploughed into the side of a bus."}, {"viet": "Trần nhà đổ sụp xuống và gạch vụn tuôn xuống căn phòng.", "eng": "The ceiling collapsed and rabble poured into the room."}, {"viet": "Vẻ quyến rũ của nông thôn vào mùa xuân.", "eng": "The charm of the countryside in spring."}, {"viet": "Đứa bé phản ứng với thuốc, lên cơn co giật.", "eng": "The child reacted to the drug by going into convulsions."}, {"viet": "Lũ trẻ chạy ào xuống cầu thang.", "eng": "The children charged down the stairs."}, {"viet": "Mấy đứa nhỏ bị dính bùn từ đầu đến chân.", "eng": "The children were covered from head to toe."}, {"viet": "Thành phố đang nằm dưới quyền kiểm soát của lực lượng địch quân.", "eng": "The city is in the control of enemy forces."}, {"viet": "Những đám mây tan đi và ánh nắng tỏa ra.", "eng": "The clouds parted and the sun shone out."}, {"viet": "Phần phụ trương in màu của tờ báo Chủ Nhật.", "eng": "The colour supplements of the Sunday newspapers."}, {"viet": "Công ty đã trao bản tóm tắt hồ sơ vụ kiện cho một luật sư hàng đầu để bào chữa cho mình.", "eng": "The company has briefed a top lawyer to defend it."}, {"viet": "Máy vi tính bị trục trặc và đã in ra dữ kiện sai.", "eng": "The computer malfunctioned and printed out the wrong data."}, {"viet": "Sự tương phản giữa hai anh em là đáng kể.", "eng": "The contrast between the two brothers is remarkable."}, {"viet": "Nước này xuất khẩu trái cây nhiệt đới Cà chua là trái cây hay là rau?", "eng": "The country exports tropical fruits a tomato a fruit or a vegetable?"}, {"viet": "Mắt của con cua ở đầu những cuống ngắn.", "eng": "The crab's eyes are at the end of short stalks."}, {"viet": "Đám đông có thái độ đúng đắn đến mức sự có mặt của cảnh sát là không cần thiết.", "eng": "The crowd was so well-behaved that the police presence was superfluous."}, {"viet": "Cuối cùng con đập phải chịu thua và đổ sập dưới sức nặng của nước lũ.", "eng": "The dam eventually yielded and collapsed under the weight of water."}, {"viet": "Thất bại này là một thua thiệt lớn cho ngành ngoại giao của chúng tôi.", "eng": "The defeat constitutes a major set-back for our diplomacy."}, {"viet": "Nhà thám tử xem xét khung cửa sổ để tìm dấu tay.", "eng": "The detective examined the window frame for fingerprints."}, {"viet": "Sự phát hiện đó là đỉnh điểm công việc của đời ông.", "eng": "The discovery was the culmination of his life's work."}, {"viet": "Ông bác sĩ nhìn vào tai tôi.", "eng": "The doctor looked into my ears."}, {"viet": "Con chó đó sợ những người lạ.", "eng": "The dog is shy of strangers."}, {"viet": "Chiếc ngăn kéo đã bị lôi hết các thứ chứa bên trong ra.", "eng": "The drawer had been emptied of its contents."}, {"viet": "Những bánh xe máy cày xoáy tung mặt đất.", "eng": "The earth had been churned up by the wheels of the tractor."}, {"viet": "Tòa đại sứ rõ ràng là một mục tiêu chính của các cuộc tấn công khủng bố.", "eng": "The embassy is an obvious target for terrorist attacks."}, {"viet": "Việc vào sổ tất cả các chi tiêu là cần thiết.", "eng": "The entry of all expenditure is necessary."}, {"viet": "Ban quản trị đã ra quyết định về tương lai của công ty.", "eng": "The executive have been making decisions about the future of the company."}, {"viet": "Sự việc đã quá rõ ràng, tìm cách tô vẽ cho chúng là vô ích.", "eng": "The facts are quite clear, it's no use trying to dress them up."}, {"viet": "Các cụm mây màu trắng nhẹ như lông chim là mây ti.", "eng": "The feathery white clouds are cirrus clouds."}, {"viet": "Ngôi sao điện ảnh đi ra ô tô của anh ta theo sau là một nhóm nhà báo.", "eng": "The film star walked to his car followed by a crowd of journalists."}, {"viet": "Công ty đã lưu trữ toàn bộ hồ sơ vào máy vi tính.", "eng": "The firm has computerized its records."}, {"viet": "Hai số đầu sau dấu thập phân lần lượt chỉ số phần mười và số phần trăm.", "eng": "The first two figures after the decimal point indicate tenths and hundredths respectively."}, {"viet": "Thức ăn thật tuyệt và rượu cũng thế.", "eng": "The food was excellent, and likewise the wine."}, {"viet": "Những quan hệ hữu nghị tồn tại giữa các nước chúng ta.", "eng": "The friendly relations existing between our countries."}, {"viet": "Vườn không cần phải tưới-đêm qua đã mưa rồi.", "eng": "The garden doesn't need watering-it rained last night."}, {"viet": "Cô gái đã gây ấn tượng tốt với gia đình chồng chưa cưới của mình bởi tính tình hoạt bát và hóm hỉnh của cô.", "eng": "The girl impressed her fiances family with her liveliness and sense of humour."}, {"viet": "Uỷ ban quốc phòng bí mật của chính phủ, mà những người trong bọn họ gọi là DefCom.", "eng": "The government's secret defence committee, known to the initiated as DefCom."}, {"viet": "Chính phủ quyết tâm thanh toán nạn khủng bố.", "eng": "The government is determined to put an end to terrorism."}, {"viet": "Bưu điện trung ương rất bận rộn vào dịp lễ Giáng Sinh.", "eng": "The GPO is very busy at Christmas."}, {"viet": "Nhóm này đã tách ra khỏi hiệp hội chính thức.", "eng": "The group have split away off the official union."}, {"viet": "Những bộ mặt hốc hác của những người thợ mỏ được cứu thoát cho thấy họ đã phải chịu đựng như thế nào.", "eng": "The haggard faces of the rescued miners showed that they had suffered."}, {"viet": "Con gà mái nằm ấp trứng gần như suốt cả ngày.", "eng": "The hen sits for most of the day."}, {"viet": "Những con ngựa trong cánh đồng cỏ hay bị lũ ruồi nhặng quấy phá.", "eng": "The horses in the meadow were being pestered by flies."}, {"viet": "Việc bảo quản căn nhà trở nên quá tốn kém đối với họ.", "eng": "The house is becoming too expensive for them to keep up."}, {"viet": "Nhịp sống hối hả của thành phố.", "eng": "The hustle and bustle of city life."}, {"viet": "Thời gian ủ bệnh là hai tuần.", "eng": "The incubation period is two weeks."}, {"viet": "Lãi suất thường biến động vì lạm phát.", "eng": "The interest rate often fluctuates because of inflation."}, {"viet": "Công việc đó đòi hỏi tôi phải sống ở Luân Đôn.", "eng": "The job involved my living in London."}, {"viet": "Việc đối chiếu những tư tưởng những nền văn minh, những truyền thống ( khác nhau ).", "eng": "The juxtaposition of ( different ) ideas, civilizations, traditions."}, {"viet": "Cái chụp đèn sẽ làm cho ánh sáng dịu đi.", "eng": "The lampshade will soften the light."}, {"viet": "Câu hỏi tưởng chừng bâng quơ của vị luật sư khiến cho nhân chứng mất cảnh giác.", "eng": "The lawyer's seemingly innocent question caught the witness off his guard."}, {"viet": "Ứng cử viên Đảng tự do đã thắng dễ dàng với hàng nghìn phiếu dư thừa.", "eng": "The liberal candidate romped in with thousands of votes to spare."}, {"viet": "Chính quyền địa phương cần một khoản vay lớn để xây dựng nhiều trường học hơn.", "eng": "The local government needs a big loan to build more schools."}, {"viet": "Vụ bê bối trên xa lộ M15 đã nêu bật vấn đề an toàn.", "eng": "The M15 scandal throws the security issue into stark relief."}, {"viet": "Người đàn ông rút từ trong túi ra một khẩu súng ngắn.", "eng": "The man produced a revolver from his pocket."}, {"viet": "Chất liệu đó sờ vào thấy ấm và mượt như nhung cái lạnh của đá cẩm thạch khi sờ vào.", "eng": "The material has a warm, velvety touch the cold touch of marble."}, {"viet": "Cuộc họp sẽ được tổ chức tại trung tâm của cộng đồng.", "eng": "The meeting will be held in the community centre."}, {"viet": "Cuộc đi thăm nhà tù của ông bộ trưởng không đem lại nhiều thông tin.", "eng": "The minister's visit to the prison was not instructive."}, {"viet": "Số tiền đó đóng góp vào chi phí về việc xây dựng một ngôi trường mới.", "eng": "The money will go towards the cost of building a new school."}, {"viet": "Ngọn núi vươn lên như một bức ngăn bằng đá dốc ngược.", "eng": "The mountain rose up in a steep wall of rock."}, {"viet": "Kho bạc quốc gia trống rỗng.", "eng": "The nation's coffers are empty."}, {"viet": "Bắt đầu ( từ ) tháng sau, tiền vé mới sẽ là 1 pao.", "eng": "The new fare will be 1 pound, beginning ( from ) next month."}, {"viet": "Quyết định mới mang lại hiệu quả cho những lời giới thiệu của ủy ban đặc biệt.", "eng": "The new ruling gives effect to the recommendations of the special committee."}, {"viet": "Tờ báo đả kích ông ấy về sự bênh vực của ông ấy đối với chính sách khủng bố.", "eng": "The newspaper really went for him over his defense of terrorism."}, {"viet": "Cuốn tiểu thuyết quá dài và viết rất phóng túng.", "eng": "The novel is too long and self-indulgent."}, {"viet": "Khu nhà văn phòng đã có người trả giá.", "eng": "The office block is under offer."}, {"viet": "Ông già ngồi xổm xuống bên lò sưởi.", "eng": "The old man squatted down by the fire."}, {"viet": "Cam này không có vị ngon lắm.", "eng": "The oranges don't taste very good."}, {"viet": "Bức hoạ được xác nhận là bản gốc.", "eng": "The painting has been authenticated as an original."}, {"viet": "Lúc chúng tôi đến bữa tiệc đang nhộn nhịp.", "eng": "The party was in full swing when we arrived."}, {"viet": "Người dân rất thân thiện, và thời tiết thì đẹp.", "eng": "The people are friendly, and the weather is nice."}, {"viet": "Bức ảnh đó gây sự phản đối ầm ĩ.", "eng": "The photo caused a real hoo-ha."}, {"viet": "Những tấm bảng biểu ngữ lên án hành động của chính phủ.", "eng": "The placard condemned the government action."}, {"viet": "Cây cối được mưa làm cho tươi tốt.", "eng": "The plants benefited from the rain."}, {"viet": "Cốt truyện quá phức tạp đối với tôi-tôi không thể theo dõi được.", "eng": "The plot was too complicated for me-I couldn't follow it."}, {"viet": "Cảnh sát bao vây những người biểu tình.", "eng": "The police grouped themselves round the demonstrators."}, {"viet": "Cảnh sát ngăn đám đông lại.", "eng": "The police tried to hold the crowd back."}, {"viet": "Những vùng đông dân gần duyên hải.", "eng": "The populous areas near the coast."}, {"viet": "Những khó khăn, vấn đề, những điều chưa rõ ràng, v. v. hiện thời.", "eng": "The present difficulties, problems, uncertainties, etc."}, {"viet": "Báo chí muốn phá vỡ cố gắng tranh chức Tổng thống của ông ta.", "eng": "The press want to sink his bid for the Presidency."}, {"viet": "Quần áo của công chúa là do một nhà tạo mốt trẻ tuổi đang nổi lên may.", "eng": "The princess is dressed by a rising young designer."}, {"viet": "Đoàn rước đi vào nhà thờ.", "eng": "The procession moved into the church."}, {"viet": "Việc đặt ra ngoài vòng pháp luật các tờ báo chỉ trích chính phủ.", "eng": "The proscription of newspapers critical of the government."}, {"viet": "Tính chất của lòng thương xót không pha tạp với những giọt nước mắt dễ dãi.", "eng": "The quality of mercy has not been adulterated with easy tears."}, {"viet": "Mưa như trút nước suốt ngày.", "eng": "The rain's been bucketing down all day."}, {"viet": "Ký ức đó tràn đầy vui tươi.", "eng": "The recollection was saturated with sunshine."}, {"viet": "Bản báo cáo thật gay gắt ở sự không khoan nhượng đối với những điều giả dối.", "eng": "The report is biting in its intolerance of deceit."}, {"viet": "Sự đảo ngược lại các mùa ở hai bán cầu.", "eng": "The reversal of the season in the two hemispheres."}, {"viet": "Đường bộ và đường tàu hoả chạy song song với nhau.", "eng": "The road and the railway are parallel to each other."}, {"viet": "Căn phòng đo được 15 x 20 bộ.", "eng": "The room measures fifteen feet by twenty feet."}, {"viet": "Bao xi măng rớt xuống đất cái bịch.", "eng": "The sack of cement hit the ground with a thumb."}, {"viet": "Phong cảnh đẹp không thể tả được.", "eng": "The scenery was beautiful beyond expression."}, {"viet": "Bọc ghế làm bằng nhựa PVC.", "eng": "The seat covers were made of PVC."}, {"viet": "Việc thanh toán một món nợ, sự giải quyết một cuộc xung đột, một yêu sách.", "eng": "The settlement of a debt, dispute, claim."}, {"viet": "Con tàu bị dồi sóng trên biển động.", "eng": "The ship wallowed in the rough sea."}, {"viet": "Súp chua cay Tứ Xuyên rất ngon.", "eng": "The Sichuan Hot and Sour Soup is very delicious."}, {"viet": "Da tạo nên lớp vỏ che chở tốt.", "eng": "The skin makes a good covering."}, {"viet": "Những đảng viên Đảng Xã hội có vẻ đã sẵn sàng cho chiến thắng trong cuộc tổng tuyển cử.", "eng": "The socialists look set for victory in general election."}, {"viet": "Âm thanh trong phim phải trùng hợp với diễn xuất.", "eng": "The sound on a film must synchronise with the action."}, {"viet": "Những điệu múa ngoài trời mà nhiều dân tộc ưa thích là những điệu múa dân gian.", "eng": "The square dances so many people enjoy are folk dances."}, {"viet": "Tin tức từ Tokyo đưa về đã làm cho giá thị trường chứng khoán khủng hoảng.", "eng": "The stock-market panic was simply overreaction to the news from Tokyo."}, {"viet": "Sợi dây quấn quanh một ống các-tông.", "eng": "The string is wound round a cardboard cylinder."}, {"viet": "Mặt trời không bao giờ lặn trên Đế quốc Anh là một thành ngữ cũ.", "eng": "The sun never sets on the British Empire is an old saying."}, {"viet": "Thuế sẽ chỉ ảnh hưởng đối với giới có của.", "eng": "The tax will affect only the propertied classes."}, {"viet": "Đội đã trình diễn một lối chơi rất điệu nghệ.", "eng": "The team produced a very workmanlike performance."}, {"viet": "Lí thuyết không phù hợp với sự kiện.", "eng": "The theory does not tally with the facts."}, {"viet": "Đã đến lúc củng cố công ty sau một vài năm bành trướng nhanh chóng.", "eng": "The time has come for the firm to consolidate after several years of rapid expansion."}, {"viet": "Hiệp định thương mại đã góp phần tăng cường những mối liên hệ giữa hai nước.", "eng": "The trade agreement helped to strengthen the bonds between the two countries."}, {"viet": "Vụ án được tiến hành với quá trình đầy đủ luật pháp.", "eng": "The trial was conducted with due process of law."}, {"viet": "Hai người yêu ghì xiết nhau trong vòng tay.", "eng": "The two lovers locked in each other's arms."}, {"viet": "Các công đoàn đang vận động đòi ngày làm việc ngắn hơn.", "eng": "The unions are campaigning for a shorter working day."}, {"viet": "Những nốt ngân vang của đàn xelô, giọng nữ cao, chim bạch yến.", "eng": "The vibrant notes of a cello, contralto, canary."}, {"viet": "Những bức tường thực sự rung lên với tiếng rống của họ.", "eng": "The walls fairly shook with their bellowing."}, {"viet": "Sự thịnh vượng của một đất nước, thậm chí sự sống còn của thế giới phụ thuộc vào sự tỉnh táo minh mẫn của tổng thống.", "eng": "The well-being of the country, even the survival of the world, depends on the president being compos."}, {"viet": "Tiếng gió rít kinh khủng.", "eng": "The wind screamed in a frightening cacophony."}, {"viet": "Công việc làm không được chu đáo lắm.", "eng": "The work had not been done very thoroughly."}, {"viet": "Những thanh niên có nhiều triển vọng đã xếp hàng trước các giám khảo.", "eng": "The young hopefuls lined up before the judges."}, {"viet": "Chính phủ của họ tham gia hiệp ước.", "eng": "Their government acceded to the treaty."}, {"viet": "Cơn giận bất thần của họ rõ ràng là thực sự, không thể là do bày đặt được.", "eng": "Their sudden outburst was obviously genuine, it couldn't have been contrived."}, {"viet": "Sau đó anh chiên nó trong dầu ăn nóng.", "eng": "Then you fry it in hot cooking oil."}, {"viet": "Thật hoàn toàn không thể biết anh ta sẽ phản ứng ra sao.", "eng": "There's absolutely no knowing how he'll react."}, {"viet": "Không có gì trong hộp này, nó rỗng không.", "eng": "There's nothing in this box, it's empty."}, {"viet": "Có năm công ty hàng không phục vụ trên tuyến đường này.", "eng": "There are five airlines operating on this route."}, {"viet": "Có một số mặt hàng hấp dẫn trong danh mục.", "eng": "There are some cute items in the catalog."}, {"viet": "Nhiệm kỳ này có rất ít tiến bộ.", "eng": "There has been very little progress this term."}, {"viet": "Có một hình thức chuẩn mực về lời thề được dùng trong toà án.", "eng": "There is a standard form of oath used in law-courts."}, {"viet": "Chỉ có sự giống nhau về hình thức bề ngoài giữa hai hệ thống đó, thực tế, chúng khác nhau cơ bản.", "eng": "There is only a formal resemblance between the two systems, they are in fact radically different."}, {"viet": "Có một cảm giác lạc quan trong nước khi chính phủ mới được bầu lên.", "eng": "There was a feeling of optimism in the country when the new government was elected."}, {"viet": "Không có sự xì xào nào về chuyện bê bối trong đời tư của ông ấy.", "eng": "There was no suggestion of scandal in his private life."}, {"viet": "Có những sự phản đối như thường lệ của nhóm người chống phá thai.", "eng": "There were the usual protests from the anti-abortion contingent."}, {"viet": "Thuốc này không nên dùng trong thời kì có thai.", "eng": "These drugs should not be taken during pregnancy."}, {"viet": "Những sản phẩm này giá hơi cao hơn những sản phẩm do các hãng khác sản xuất, nhưng chúng tôi chắc chắn rằng chất lượng của chúng tôi thì vượt trội.", "eng": "These products are slightly higher in price than those produced by the other manufacturers, but we're sure that they are far better in quality."}, {"viet": "Họ không chuyện trò với nhau sau cuộc cãi nhau.", "eng": "They're not speaking after their argument."}, {"viet": "Họ tập hợp đủ chứng cớ để buộc cho hắn sáu tội.", "eng": "They amassed enough evidence to convict him on six charges."}, {"viet": "Vài phút nữa họ sẽ đến-trong khi chờ đợi chúng ta sẽ uống một tách trà.", "eng": "They arrive in a few minutes-meanwhile we'll have a cup of tea."}, {"viet": "Chúng đến từ nhà máy xi măng.", "eng": "They come from the cement factory."}, {"viet": "Họ vẽ những bức tranh có màu sắc tuyệt đẹp về những con thú lên vách hang.", "eng": "They drew excellent colored pictures of animals on the walls of their caves."}, {"viet": "Một cách riêng rẽ, bọn họ đã đi đến một kết luận như nhau.", "eng": "They had all severally reached the same conclusion."}, {"viet": "Họ ngồi xổm bên ngọn lửa để sưởi ấm.", "eng": "They hunkered by the fire, warming themselves."}, {"viet": "Họ tiến vào và chiếm thị trấn.", "eng": "They marched in and took over the town."}, {"viet": "Họ cầu chúa chấm dứt nỗi khổ đau đoạ đầy của họ.", "eng": "They prayed for their sufferings to end."}, {"viet": "Chúng nó kéo đẩy bàn ghế làm xước mặt sàn.", "eng": "They scored the floorboards by pushing furniture about."}, {"viet": "Bản thân họ cũng đã có kinh nghiệm tương tự.", "eng": "They themselves had had a similar experience."}, {"viet": "Tất cả bọn họ đều vui về tin đó.", "eng": "They were all very pleased with the news."}, {"viet": "Họ quấn khăn choàng và áo ấm.", "eng": "They were swathed in scarves and sweaters."}, {"viet": "Thành tựu này cho đến nay chưa hề ai vượt được.", "eng": "This achievement has never been improved on."}, {"viet": "Vải này được chế tạo để chịu được độ bào mòn và độ giằng xé cao.", "eng": "This cloth is designed to stand up to a lot of wear and tear."}, {"viet": "Bài luận này của anh ta rất khó nhằn.", "eng": "This essay of his is a laborious piece of work."}, {"viet": "Đây là cơ hội có một không hai.", "eng": "This is a once in a lifetime chance."}, {"viet": "Thông báo cho công chúng biết.", "eng": "This is to give notice, notice is hereby given."}, {"viet": "Tình hàng xóm láng giềng này gần đây giảm sút đi nhiều.", "eng": "This neighbourhood has gone down a lot recently."}, {"viet": "Máy in này tương thích với phần lớn các máy vi tính.", "eng": "This printer is compatible with most microcomputers."}, {"viet": "Ngôi sao này không trông thấy được bằng mắt thường.", "eng": "This star is not visible to the naked eye."}, {"viet": "Đây sẽ là một cuộc họp mặt thân mật.", "eng": "This will be an informal gathering."}, {"viet": "Ba chiếc tàu nhỏ khởi hành từ Palos ở Tây Ban Nha.", "eng": "Three small ships set sail from Palos in Spain."}, {"viet": "Đêm nay sương mù sẽ dầy hơn và sau đó có mưa từ tây nam.", "eng": "Tonight the fog will thicken and then more rain will move in from the southwest."}, {"viet": "Trừ phi chúng ta có được sự giúp đỡ tài chính của chính phủ, còn không bệnh viện sẽ phải đóng cửa.", "eng": "Unless we receive more financial assistance from the government, the hospital will have to close."}, {"viet": "Người ta cho rằng bột giặt có chứa enzim tẩy các vết bẩn có hiệu quả hơn.", "eng": "Washing powders containing enzymes are said to remove stains more efficiently."}, {"viet": "Chúng tôi sẽ chuyển bà sang phòng khác ngay.", "eng": "We'll move you to another room right away."}, {"viet": "Chúng tôi mời ba đôi nữa tới ăn tối.", "eng": "We're invited three other couples to dinner."}, {"viet": "Gần đây chúng ta được hưởng một thời gian đẹp trời liên tục bất thường.", "eng": "We've enjoyed an exceptional run of fine weather recently."}, {"viet": "Tất cả chúng tôi đều cảm thấy có ý muốn đi ngay.", "eng": "We all felt a disposition to leave at once."}, {"viet": "Chúng ta có quan hệ hữu nghị với nước đó.", "eng": "We are on a friendly footing with that country."}, {"viet": "Chúng tôi gọi nó là hệ thống tiền tệ thập phân.", "eng": "We call it decimal currency system."}, {"viet": "Chúng tôi không thể chấp nhận ngay bảng giá của các ông, bởi vì giá do các ông đưa ra thì hơi cao hơn so với mức của các nhà cung cấp khác.", "eng": "We cannot accept your offer immediately, because your price is relatively higher than that of other suppliers."}, {"viet": "Chúng tôi không muốn đi dạo khi thấy bầu trời u ám.", "eng": "We did not feel like going out for a walk, when we saw a sombre sky."}, {"viet": "Chúng tôi cung cấp một ít thông tin sai lạc cho tên gián điệp, hi vọng nó sẽ chuyển lại cho chính phủ của nó.", "eng": "We fed the spy some false information in the hope that he would pass it back to his government."}, {"viet": "Chúng tôi đã có những cuộc thảo luận kéo dài về chính trị tại trường đại học.", "eng": "We had long debates at college about politics."}, {"viet": "Chúng ta có đủ nhiên liệu để qua hết mùa đông này.", "eng": "We have enough fuel to see the winter out."}, {"viet": "Chúng ta không đủ thức ăn cho mọi người, nhưng sẽ phải liệu cơm gắp mắm thôi.", "eng": "We haven't really got enough food for everyone but we'll have to make shift with what we've got."}, {"viet": "Chúng tôi sẽ đến khi làm xong.", "eng": "We'll come when we're finished."}, {"viet": "Chúng ta phải hoãn chuyến đi lại cho đến khi thời tiết tốt lên.", "eng": "We must delay our journey until the weather improves."}, {"viet": "Chúng ta cần có những công sự phòng thủ kiên cố chống kẻ thù.", "eng": "We need strong defences against the enemy."}, {"viet": "Chúng tôi đã đọc ( hết ) biên bản cuộc họp trước.", "eng": "We read ( through ) the minutes of the last meeting."}, {"viet": "Chúng ta phải ý thức được sự nguy hiểm của hoả hoạn.", "eng": "We should be aware of the danger of fire."}, {"viet": "Chúng tôi đã thử nó theo mọi cách kết hợp có thể tưởng tượng ra được.", "eng": "We tried it in every conceivable combination."}, {"viet": "Tất cả chúng tôi cười phá lên khi nghe anh ấy đùa.", "eng": "We were all in fits ( of laughter ) at his jokes."}, {"viet": "Chúng tôi đã được bọn trẻ chào đón ngay ở cửa ra vào.", "eng": "We were welcomed at the door by the children."}, {"viet": "Những biểu ngữ chào mừng giăng ngang phố.", "eng": "Welcome banners stretched across the street."}, {"viet": "À … ờ, hãy vào trong văn phòng của tôi.", "eng": "Well, let's go into my office."}, {"viet": "Người đàn ông đang đứng ở góc đó đang làm gì vậy?", "eng": "What's that man standing on the comer doing?"}, {"viet": "Một vài món ăn điển hình của người Anh là những món nào?", "eng": "What are some typical British dishes?"}, {"viet": "Anh làm thế nào mà xoay xở để có được than trong khi thợ mỏ đình công?", "eng": "What did you do for coal during the miners'strike?"}, {"viet": "Bạn đã chơi những trò chơi nào khi bạn là học sinh tiểu học?", "eng": "What games did you play when you were an elementary school student?"}, {"viet": "Tên con sông lớn nhất ở Pháp là gì?", "eng": "What is the name of the largest river in France?"}, {"viet": "Bạn làm loại công việc nào?", "eng": "What kind of work do you do?"}, {"viet": "Khi còn nhỏ, bạn đã chơi môn thể thao nào?", "eng": "What sports did you play as a child?"}, {"viet": "Các bánh xe không bám chặt mặt đường trơn.", "eng": "Wheels won't bite on a slippery surface."}, {"viet": "Khi nhà của bà ấy bị trộm, bà ấy đã đòi bảo hiểm bồi thường.", "eng": "When her house was burgled, she made a claim on the insurance."}, {"viet": "Khi quay, tốt hơn nên dùng những cành cây ăn trái làm củi để làm tăng hương vị cho vịt.", "eng": "When roasting, it's better to use fruit tree branches as firewood to lend more flavor to the duck."}, {"viet": "Khi họ nói với tôi rằng tôi đã giành được chiếc xe ô tô, tôi mừng đến phát điên lên.", "eng": "When they told me I'd won a car, I absolutely freaked."}, {"viet": "Tôi có thể mua vé ở đâu?", "eng": "Where can I buy the ticket?"}, {"viet": "Trong chuyến đi của anh, thành phố nào anh có ấn tượng nhất?", "eng": "Which city impressed you most during your trip?"}, {"viet": "Bạn muốn làm việc cho nơi nào, công ty lớn hay công ty nhỏ?", "eng": "Which would you like to work for, a big company or a small one?"}, {"viet": "Ai đang chơi cây viôlông số một trong đàn nhạc giao hưởng đó?", "eng": "Who is playing 1st violin in the symphony?"}, {"viet": "Sao bạn mang theo dù vậy?", "eng": "Why do you take your umbrella with you?"}, {"viet": "Đời sống hoang dã không bị phá rối bởi những nhà ở của con người.", "eng": "Wildlife undisturbed by human habitations."}, {"viet": "Ông làm ơn ký lại ở đằng sau chúng được không?", "eng": "Will you please sign again on their backs?"}, {"viet": "Với sự điều khiển của cô ấy, công ty đã bắt đầu phát đạt.", "eng": "With her at the wheel, the company began to prosper."}, {"viet": "Điều kiện làm việc trong công nghiệp đã được cải thiện nhiều.", "eng": "Working conditions in the industry have improved greatly."}, {"viet": "Ông cho tôi một cuộc hẹn được không?", "eng": "Would you like to accept the appointment?"}, {"viet": "Xin ông vui lòng gửi nó cho chúng tôi càng sớm càng tốt?", "eng": "Would you please send it to us at your earliest convenience?"}, {"viet": "Rồi, nhưng chưa bao giờ thấy một công trường nhộn nhịp như vậy.", "eng": "Yes, but never a site that was so busy."}, {"viet": "Dạ có, chúng tôi nhận, và ông có thể nhận tiền thối lại bằng đô la Mỹ.", "eng": "Yes, we do, and you can have the change in US dollars."}, {"viet": "Bạn sẽ phải nỗ lực nhiều hơn nếu bạn muốn thi đỗ.", "eng": "You'll have to exert yourself more if you want to pass your exam."}, {"viet": "Anh đi nhờ xe làm sự việc rắc rối.", "eng": "You're opening the door to trouble by hitchhiking."}, {"viet": "Anh là người gây trở ngại hơn là giúp đỡ.", "eng": "You are more of a hindrance than a help."}, {"viet": "Anh ta không thể lay chuyển cô ta khỏi niềm tin đã ăn sâu bén rễ của cô ta được.", "eng": "You can't shift her from her entrenched beliefs."}, {"viet": "Anh có thể tính tiền xăng vào chi phí doanh nghiệp.", "eng": "You can put the cost of the petrol down to business expenses."}, {"viet": "Mày là đồ khốn nạn hèn hạ! Sao mày có thể làm một việc như thế?", "eng": "You dirty rat! How could you do a thing like that?"}, {"viet": "Khi đáp ứng một lời rao vặt trên báo, anh phải nhanh chân mới được.", "eng": "You have to be quick off the mark when you answer a newspaper advertisement."}, {"viet": "Ông có thể yêu cầu công ty của ông xin một ngân phiếu ký phát ở ngân hàng của chúng tôi.", "eng": "You may ask your company bank to apply for a cheque drawn on our bank."}, {"viet": "Ông cần chiếu cố anh ta vì anh ta mới ốm dậy.", "eng": "You must make allowances for him because he has been ill."}, {"viet": "Nếu anh cứ cố chấp, anh sẽ làm cho họ bực mình thêm.", "eng": "You persist, you will annoy them even more."}, {"viet": "Anh nên tỏ ra lễ độ hơn đối với gia chủ.", "eng": "You should show more civility to your host."}, {"viet": "Cháu kéo đuôi con mèo thì thật là nghịch.", "eng": "You were naughty to pull the cat's tail."}, {"viet": "Bản tường trình của anh về việc này không khớp bản tường trình của tôi.", "eng": "Your account of the affair does not agree with mine."}, {"viet": "Vui lòng cho xem hộ chiếu và phiếu khai báo hải quan của cháu.", "eng": "Your passport and customs declaration form, please."}]