[{"viet": "Trẻ con biết bò trước khi biết đi.", "eng": "A baby crawls around before it can walk."}, {"viet": "Một con mèo đi rón rén qua đám cỏ về phía con mồi của nó.", "eng": "A cat slinking through the grass toward its pray."}, {"viet": "Một ủy ban gồm những người lãnh đạo công đoàn có thế lực.", "eng": "A committee of influential union leaders."}, {"viet": "Một tên tội phạm hết sức vô lương tâm.", "eng": "A criminal utterly devoid of conscience."}, {"viet": "Một đứa trẻ tàn tật trong một chiếc xe lăn.", "eng": "A disabled child in a wheelchair."}, {"viet": "Một cảm giác buồn ngủ dần dần xâm chiếm anh ta.", "eng": "A feeling of drowsiness crept over him."}, {"viet": "Một ấn tượng sơ khởi về cuộc xung đột ác liệt sắp diễn ra.", "eng": "A foretaste of the fierce conflict to come."}, {"viet": "Một tay tổ chức giỏi chú tâm tới chi tiết.", "eng": "A good organizer pays attention to detail."}, {"viet": "Một người đàn ông bảnh trai có hàm vuông rắn rỏi.", "eng": "A handsome man with a strong square jaw."}, {"viet": "Một trăm năm sau đó người Anh biết cách làm ra một thức uống sô-cô-la rất ngon bằng cách dùng với sữa thay nước.", "eng": "A hundred years later the English had learned to make a very good drink of chocolate by using milk instead of water."}, {"viet": "Bãi cỏ có những khoảng nắng khoảng mát.", "eng": "A lawn chequered with sunlight and shade."}, {"viet": "Một xe tải đã đâm vào một dãy xe ô tô đang đổ.", "eng": "A lorry drove into a line of parked cars."}, {"viet": "Một chiến lược tiếp thị đã khiến cho các nhà cạnh tranh của chúng tôi thua xa.", "eng": "A marketing strategy that left our competitors in the dust."}, {"viet": "Một phim chỉ có những hình ảnh biếm họa hời hợt về các đề tài lịch sử.", "eng": "A movie with only cardboard caricatures of its historical subjects."}, {"viet": "Một bức thư với những thay đổi tinh tế về giọng điệu.", "eng": "A note with subtle variances of pitch."}, {"viet": "Một sự gia tăng theo tỉ lệ phần trăm trong giá vé.", "eng": "A percentage increase in ticket prices."}, {"viet": "Một bài thơ bị gán sai cho Shakespeare.", "eng": "A poem erroneously attributed to Shakespeare."}, {"viet": "Một ý thức sâu sắc vấn đề đó.", "eng": "A profound awareness of the problem."}, {"viet": "Một chiếc ôtô tin cậy được thì vô giá.", "eng": "A reliable car is worth its weight in gold."}, {"viet": "Lương 12.000 bảng Anh một năm.", "eng": "A salary of £ 12.000 a year."}, {"viet": "Một tiếng gõ cọc cọc dữ dội ở cửa trước.", "eng": "A sharp rat-tat on the front door."}, {"viet": "Một nụ cười thấp thoáng trên môi của cô ấy.", "eng": "A smile played about her lips."}, {"viet": "Một chương trình máy vi tính tân tiến nhất.", "eng": "A state-of-the-art computer program."}, {"viet": "Một người đàn ông có vẻ khả nghi đang lẩn lút trong bóng tối.", "eng": "A suspicious-looking man lurking in the shadows."}, {"viet": "Một chế độ cực quyền đàn áp tất cả các thể chế tự trị trong nỗ lực của nó nắm lấy linh hồn con người.", "eng": "A totalitarian regime crushes all autonomous institutions in its drive to seize the human soul."}, {"viet": "Một ngọn núi lửa phun khói, dung nham và tro bụi.", "eng": "A volcano emits smoke, lava and ashes."}, {"viet": "Một nhà văn chuyên sâu về văn học Pháp thời Trung Cổ.", "eng": "A writer delving in medieval French literature."}, {"viet": "Hành động đúng chức năng của ai là một nhân viên cảnh sát.", "eng": "Act in one's capacity as a police officer."}, {"viet": "Sau một cuộc tranh luận dài, Hạ nghị viện đã thông qua dự luật đó.", "eng": "After a long debate, the House of Commons approved the bill."}, {"viet": "Sau ba mươi năm quản lý cửa hàng bà ta quyết định đã đến lúc giải nghệ.", "eng": "After managing the shop for thirty years she decided it was time to put up the shutters."}, {"viet": "Sau cuộc tàn sát, bãi chiến trường là một cảnh tượng khủng khiếp.", "eng": "After the slaughter, the battlefield was a gruesome sight."}, {"viet": "Tất cả các loài cá đều thở bằng mang.", "eng": "All fishes have gills for breathing."}, {"viet": "Tất cả các màu sắc đều rất hài hoà, màu chủ yếu là màu hồng của hoa hồng.", "eng": "All the colors are coordinated the main color is rose pink."}, {"viet": "Hầu như qua một đêm đã có một sự thù nghịch mới và tràn lan về phía những người giàu có đối với các kẻ nghèo.", "eng": "Almost overnight there was a new and wide spread hostility on the part of the haves toward the have-nots."}, {"viet": "Một giọng nói không khác nhiều với giọng Cockney.", "eng": "An accent not far removed from Cockney."}, {"viet": "Một cuộc tấn công bằng bộ binh và xe bọc thép.", "eng": "An attack by infantry and armour."}, {"viet": "Một khoản thêm 10% tiền phục vụ được tính vào hóa đơn của nhà hàng.", "eng": "An extra 10% was added to the restaurant bill for service."}, {"viet": "Một thuốc mỡ thoa các vết cháy và các vết bỏng.", "eng": "An ointment for burns and scalds."}, {"viet": "Một sự đột ngột quan tâm đến môi trường.", "eng": "An upsurge of interest in the environment."}, {"viet": "Anne's, boy's là các hình thức sở hữu.", "eng": "Anne's the boy's are possessive forms."}, {"viet": "Các đơn phải được viết thành 3 bản.", "eng": "Applications must be made out in triplicate."}, {"viet": "Cháu là học sinh trung học phải không?", "eng": "Are you a high school student?"}, {"viet": "Anh đã sẵn sàng quay xuống chưa?", "eng": "Are you ready to go back down?"}, {"viet": "Thật ra, tất cả những gì chúng ta cần hiện giờ là đẩy mạnh tốt việc khuyến mãi.", "eng": "As a matter of fact, all we need now is a good promotional push."}, {"viet": "Khi họ vừa nghe tin có thể có sự khan hiếm thực phẩm, họ bắt đầu tích trữ.", "eng": "As soon as they heard about possible food shortages, they began to stock up."}, {"viet": "Ở một khoảng cách xa an toàn đối với tầm súng.", "eng": "At a safe remove from the gunfire."}, {"viet": "Tàu chìm ở độ sâu bao nhiêu?", "eng": "At what depth does the wreck lie?"}, {"viet": "Ngân hàng đang cho những người muốn mua nhà riêng mượn tiền ngày càng nhiều.", "eng": "Banks are putting out more and more money to people buying their own homes."}, {"viet": "Thiếu nhiệt tình, can đảm, sức mạnh.", "eng": "Be lacking in warmth, courage, strength."}, {"viet": "Những con ong bay nhởn nhơ từ hoa này sang hoa khác.", "eng": "Bees flitting about from flower to flower."}, {"viet": "Những số lượng tiết kiệm to lớn về nhiên liệu nhờ hiệu quả cao hơn.", "eng": "Big savings on fuel through greater efficiency."}, {"viet": "Mua gia súc còn sống và đem về giết thịt.", "eng": "Bought on the hoof and then slaughtered."}, {"viet": "Xây những viên đá rời thành một bức tường vững chắc.", "eng": "Build loose stones into a strong wall."}, {"viet": "Nhưng tôi vẫn nghĩ có thể học cách thức chán nản trong sung sướng!", "eng": "But I still think that I could learn to be bored but happy!"}, {"viet": "Nhưng cháu không biết John đâu.", "eng": "But you didn't know John."}, {"viet": "Nhân tiện, tôi muốn biết tôi có thể mở một tài khoản bằng tiền đô la với ngân hàng của anh không.", "eng": "By the way, I want to know if I may open an account in dollar currency with your bank."}, {"viet": "Xin cho tôi thêm một ít thạch được không?", "eng": "Can I have some more jelly, please?"}, {"viet": "Cô có thể đổi tờ 1 đô la này được không?", "eng": "Can you change this one-dollar bill?"}, {"viet": "Anh có thể đọc được một bảng số xe cách 50 m không?", "eng": "Can you read a car number-plate at fifty metres?"}, {"viet": "Anh không thể nghĩ ra một từ thích hợp hơn chữ thú vị để diễn tả kỳ nghỉ hè của anh à?", "eng": "Can't you think of a better word than nice to describe your holiday?"}, {"viet": "Đặc biệt là cô ta coi sự đùa cợt đó một cách rất tự nhiên.", "eng": "Characteristically she took the joke very well."}, {"viet": "Christopher Columbus là một trong những nhà thám hiểm vĩ đại.", "eng": "Christopher Columbus was one of the great explorers."}, {"viet": "Kha Luân Bố đã khám phá ra châu Mỹ nhưng không thám hiểm lục địa mới này.", "eng": "Columbus discovered America but did not explore the new continent."}, {"viet": "Những nhượng bộ góp phần đáng kể vào việc làm thỏa mãn những kẻ chỉ trích anh ta.", "eng": "Concessions which go a long way towards satisfying his critics."}, {"viet": "Sự hợp tác giữa cảnh sát và quần chúng để tóm tên tội phạm đó.", "eng": "Cooperation between the police and the public in catching the criminal."}, {"viet": "Cô vui lòng dọn dẹp phòng vào buổi chiều được không?", "eng": "Could you please do it in the afternoon?"}, {"viet": "Vượt biên giới Mêhicô sang Mỹ.", "eng": "Cross the line from Mexico into the US."}, {"viet": "Giải quyết những chi tiết thực tế cơ bản của đồ án.", "eng": "Dealing with the nuts and bolts of the project."}, {"viet": "Bất chấp những vấn đề phức tạp của mình, chúng tôi tiếp tục xoay sở mà không gặp khó khăn mấy.", "eng": "Despite all our problems, we continue to rub along."}, {"viet": "Anh có ghi lại số điện thoại của ông ta không?", "eng": "Did you get his telephone number down?"}, {"viet": "Ngay phía trước chúng ta là cung điện Hoàng gia.", "eng": "Directly ahead of us is the royal palace."}, {"viet": "Đừng dùng quá liều lượng đã chỉ định.", "eng": "Do not exceed the prescribed dose."}, {"viet": "Cô có tính tiền địa chỉ không?", "eng": "Do you charge for the address?"}, {"viet": "Bạn có bạn bè nào từ thời học tiểu học không?", "eng": "Do you have any friends from your elementary school days?"}, {"viet": "Bạn có biết ai là vận động viên nổi tiếng nhất của Nhật Bản không?", "eng": "Do you know who Japan's most famous athlete is?"}, {"viet": "Bạn có thấy cây kẹo đó không?", "eng": "Do you see that piece of candy?"}, {"viet": "Anh có muốn ăn điểm tâm với trứng luộc không?", "eng": "Do you want a boiled egg for breakfast?"}, {"viet": "Dây biểu chương này được cột ở phía trước hay phía sau?", "eng": "Does this sash tie in front or at the back?"}, {"viet": "Khi lái xe đừng chạy sát lề đường.", "eng": "Don't cling to the kerb when you are driving."}, {"viet": "Đừng bắt chúng tôi phải hồi hộp thêm nữa-thế kết thúc câu chuyện ra sao?", "eng": "Don't keep us in suspense any longer-what happens at the end of the story?"}, {"viet": "Đừng nói với tôi bằng cái giọng đó.", "eng": "Don't speak to me in that tone of voice."}, {"viet": "Mày dám lè lưỡi ra với tao à!", "eng": "Don't you dare stick your tongue out at me!"}, {"viet": "Ma túy đã đẩy anh ta một cách không thương xót đến một cái chết yểu.", "eng": "Drugs drove him remorselessly to an early death."}, {"viet": "Món xốt ma-yon-ne trứng được làm bằng trứng luộc chín trộn với xốt ma-yon-ne.", "eng": "Egg mayonnaise is made with mayonnaise and hard-boiled eggs."}, {"viet": "Cần phải cho vào hỗn hợp đó lượng bột và đường bằng nhau.", "eng": "Equal amounts of flour and sugar should be added to the mixture."}, {"viet": "Mọi người đều chán những điều trơ tráo trắng trợn của chúng.", "eng": "Everyone is tired of their blatant effronteries."}, {"viet": "Xin lỗi, quần áo của ông giặt xong rồi.", "eng": "Excuse me, your clothes are ready."}, {"viet": "Các gia đình chỉ được có một con.", "eng": "Families restricted to having one child."}, {"viet": "Rất ít nhà văn chớm gần được phong cách vĩ đại của Shakespeare.", "eng": "Few writers even begin to approach Shakespeare's greatness."}, {"viet": "Trước hết bạn phải có bằng lái đã.", "eng": "First you have to get a driver's license."}, {"viet": "Theo bước của triều đại nhà Tần, Vạn Lý Trường Thành được tu bổ và gia cố bởi các triều đại tiếp theo, nhưng những nổ lực lớn nhất là do triều đại nhà Minh thực hiện.", "eng": "Following the Qin Dynasty, the Great Wall was restored and reinforced by successive dynasties, but the greatest efforts were made by the Ming Dynasty."}, {"viet": "Lớp 4 là lớp rất khó dạy.", "eng": "Form 4 is a difficult class to teach."}, {"viet": "Suy nghĩ tìm lời lẽ thích hợp để nói.", "eng": "Fumble for the right thing to say."}, {"viet": "Dự trữ than cho mùa đông.", "eng": "Get in stocks of coal for the winter."}, {"viet": "Trách mắng ai vì tới muộn.", "eng": "Give somebody a scolding for being late."}, {"viet": "Đi đến ngã ba và rẽ trái.", "eng": "Go up to the fork and turn left."}, {"viet": "Đoán thử xem tôi đã tình cờ gặp ai trong buổi liên hoan hôm qua nào?", "eng": "Guess who I saw at the party yesterday?"}, {"viet": "Người xây dựng đã đưa hóa đơn tính tiền chưa?", "eng": "Has the builder presented his bill yet?"}, {"viet": "Bạn có bao giờ bị phân biệt đối xử chưa?", "eng": "Have you ever been discriminated against?"}, {"viet": "Bạn đã có kế hoạch nào cho kỳ nghỉ đông chưa?", "eng": "Have you made any plans for your winter vacation yet?"}, {"viet": "Ông ấy sẽ rất tức giận chúng ta nếu chúng ta đến muộn.", "eng": "He'll be furious with us if we're late."}, {"viet": "Anh ta luôn luôn khoác lác về thành công của anh ta với đàn bà.", "eng": "He's always shooting his mouth off about his success with women."}, {"viet": "Anh ta đã bỏ uống và giờ đây là một con người đổi mới.", "eng": "He's given up drink and is now a reformed character."}, {"viet": "Anh ta không thân mật lắm với những người mới đến.", "eng": "He's not very friendly with newcomers."}, {"viet": "Cụ ấy bây giờ gần đến tuổi 80 và cần đến sự chăm sóc thường xuyên.", "eng": "He's verging on 80 now and needs constant attention."}, {"viet": "Anh ấy và tôi nói giống nhau.", "eng": "He and I said the same."}, {"viet": "Hắn hấp háy mắt trong ánh sáng mặt trời chói chang.", "eng": "He blinked in the bright sunlight."}, {"viet": "Anh ta không thể trốn tránh trách nhiệm về các hành động của mình.", "eng": "He cannot evade responsibility of his actions."}, {"viet": "Nó không dứt được sự nghi ngờ là vợ nó không chung thủy.", "eng": "He could not divest himself of the suspicion that his wife was being unfaithful."}, {"viet": "Ông ta làm điều đó như một ân huệ đặc biệt.", "eng": "He did it as a special favour."}, {"viet": "Nó độc đoán, và tất cả chúng tôi ghét điều đó.", "eng": "He domineered, and the rest of us hated it."}, {"viet": "Hắn ngã xuống và va mạnh vào đầu.", "eng": "He fell and got a nasty bang on the head."}, {"viet": "Ông ta sáng lập hội từ thiện để tưởng nhớ người vợ quá cố.", "eng": "He found the charity in memory of his late wife."}, {"viet": "Anh ấy bị say bí tỉ ở buổi tiệc Giáng Sinh.", "eng": "He got absolutely sozzled at the Christmas party."}, {"viet": "Ông ta đã có nhiều hoạt động lý thú khi du lịch ở châu Phi.", "eng": "He had many interesting experiences while travelling in Africa."}, {"viet": "Hắn có đầu óc hẹp hòi.", "eng": "He has a very narrow mind."}, {"viet": "Nó chẳng có gì để gọi là của riêng nó.", "eng": "He has nothing he can call his own."}, {"viet": "Ông ấy có những quan điểm lạ lùng về tôn giáo.", "eng": "He holds strange views on religion."}, {"viet": "Cậu ấy sẽ phát khùng lên khi cậu ấy phát hiện anh đã nói dối đấy.", "eng": "He is going to be mad when he finds out you lied."}, {"viet": "Ông ta rất yêu thương con cái của mình.", "eng": "He is very affectionate towards his children."}, {"viet": "Hắn nằm trơ trọi giữa đường dưới cái nhìn thương hại của khách qua đường.", "eng": "He lays helplessly in the street under the pitying gaze of the bystanders."}, {"viet": "Ông ta đội cái nón nhỏ xíu đó trông hết sức khôi hài.", "eng": "He looked highly comical wearing that tiny hat."}, {"viet": "Anh ta cố vùng mạnh để thoát thân.", "eng": "He managed to wrench himself free."}, {"viet": "Anh ấy không phải là một võ sĩ quyền Anh giỏi cho lắm.", "eng": "He not much cop as a boxer."}, {"viet": "Nó chơi bóng đá với bọn bạn vào các chiều thứ bảy.", "eng": "He plays football with the boys on Saturday afternoons."}, {"viet": "Ông ta đã cho tất cả các con mình học trường nội trú.", "eng": "He put all his children through boarding-school."}, {"viet": "Ông ta đã nhận được tập mẫu cùng với những phụ tùng đi theo.", "eng": "He received the catalogue and all the gubbins that goes with it."}, {"viet": "Nó đã từ lính thường tiến lên trở thành sĩ quan.", "eng": "He rose from the ranks to become an officer."}, {"viet": "Anh ta chẳng bao giờ lo lắng về điều gì cả.", "eng": "He's always worrying over nothing at all."}, {"viet": "Hôm nay anh ta thật là bẳn tính, cứ gắt gỏng với mọi người.", "eng": "He's in a really bad mood today, growling at everyone."}, {"viet": "Anh ta quá say sưa với ý tưởng đó đến nỗi không thể nói về bất cứ điều gì khác.", "eng": "He's so infatuated with the idea that he can't talk about anything else."}, {"viet": "Anh ta ngồi phải cái mũ của mình làm nó bẹp gí.", "eng": "He sat on his hat and squashed it flat."}, {"viet": "Anh ta ít nói tốt về nước Anh.", "eng": "He seldom has a good word to say for Britain."}, {"viet": "Dù có đủ loại tiếng ồn anh ta vẫn ngủ tiếp.", "eng": "He slept on through all the noise."}, {"viet": "Anh ta quay tít cái bánh xe đạp của mình.", "eng": "He spun the wheel of his bicycle."}, {"viet": "Anh ta bám chặt lấy lý thuyết của anh ta.", "eng": "He stuck fast to his theory."}, {"viet": "Hắn nghĩ rằng hắn có thể cười nhạo tôi, nhưng tôi sẽ cho nó biết tay ngay thôi.", "eng": "He thinks he can laugh at me, but I'll settle with him soon."}, {"viet": "Anh ấy trút hết cơn tức giận của mình vào con mèo.", "eng": "He took out his anger on the cat."}, {"viet": "Ông ta đã chuyển giao công việc kinh doanh cho con gái ông.", "eng": "He turned the business over to his daughter."}, {"viet": "Nó muốn vay tiền của tôi nhưng tôi đã bảo thẳng với nó là đừng hòng.", "eng": "He wanted to borrow some money from me but I told him to get stuffed."}, {"viet": "Anh ta bị đuổi việc một cách độc đoán.", "eng": "He was arbitrarily dismissed from his job."}, {"viet": "Ông ta được khen ngợi về một tác phẩm rất là chuyên nghiệp.", "eng": "He was complimented on a very professional piece of work."}, {"viet": "Anh ta khoa tay ra hiệu cho tôi rối rít nhưng tôi không thể nào hiểu anh ta đang muốn nói gì.", "eng": "He was gesticulating wildly at me, but I could not understand what he was trying to tell me."}, {"viet": "Ông ấy được uỷ ban cử làm người phát ngôn.", "eng": "He was made spokesman by the committee."}, {"viet": "Anh ta có hơi bực mình với bạn bè của anh ta ( vì đã không gọi điện thoại báo cho biết là họ sẽ đến ).", "eng": "He was rather displeased with his friends ( for not having phoned to say they were coming )."}, {"viet": "Anh ta ngạc nhiên vì những lời nhận định châm chọc chua cay của cô ấy.", "eng": "He was taken aback by her caustic remarks."}, {"viet": "Anh ta không ý thức được là mình đã làm phật ý cô ấy.", "eng": "He wasn't conscious of having offended her."}, {"viet": "Ông ta có lẽ sẽ từ chức vì chính sách của mình thất bại hoàn toàn.", "eng": "He will presumably resign in view of the complete failure of his policy."}, {"viet": "Anh ta viết một mục hàng tuần cho tờ báo địa phương.", "eng": "He writes a weekly column for the local newspaper."}, {"viet": "Nhà nước đã giúp đỡ những nạn nhân của trận động đất.", "eng": "Helps for the earthquake victims are provided by the state."}, {"viet": "Sự nghiệp của cô ta lên tột đỉnh khi đoạt được một giải Oscar.", "eng": "Her career climaxed in the award of an Oscar."}, {"viet": "Con chó của cô ta màu nâu khoang trắng.", "eng": "Her dog is brown with white splashes."}, {"viet": "Cử chỉ thẳng thắn của cô ấy khiến cho tôi tin cô ấy.", "eng": "Her frank manner inclines me to believe her."}, {"viet": "Những trò bắt chước của cô ấy luôn luôn làm cho tôi phá ra cười.", "eng": "Her imitations always set me off laughing."}, {"viet": "Sự đau đớn khổ cực làm cho cô ta suýt phát khóc.", "eng": "Her misery brought her to the verge of tears."}, {"viet": "Việc diễn xuất của cô ta trong vở kịch đó đã thực sự làm cho cô thành một nữ diễn viên kịch nổi tiếng.", "eng": "Her performance in that play really put her on the map as a comedy actress."}, {"viet": "Thư ký của bà ta đảm trách tất cả các cuộc hẹn của bà ta.", "eng": "Her secretary takes care of all her appointments."}, {"viet": "Những chuyến đi của bà ta đã đưa bà tới khắp mọi miền trên trái đất.", "eng": "Her travels had taken her to every quarter of the globe."}, {"viet": "Đây là nơi có tính chất nổi bật, sự giác ngộ, giây phút quyết định.", "eng": "Here is the inscape, the the epiphany, the moment of truth."}, {"viet": "Lời tuyên bố của ông ta đã tạo ra những nỗi kinh ngạc bất ngờ.", "eng": "His announcement produced gasps of amazement."}, {"viet": "Các câu trả lời láo xược của anh ta làm các vị phỏng vấn bực mình.", "eng": "His brash answer annoyed the interviewers."}, {"viet": "Lòng dũng cảm của anh ấy dần dần xẹp đi khi anh ấy nhận ra rằng tình thế là tuyệt vọng.", "eng": "His courage slowly ebbed away as he realized how hopeless the situation was."}, {"viet": "Mắt anh ta đỏ ngầu lên vì thiếu ngủ.", "eng": "His eyes were bloodshot from lack of sleep."}, {"viet": "Với cách dùng từ khá phóng túng, nhà để dụng cụ làm vườn của ông ta mà ông ta gọi là nhà nghỉ mát mùa hè của ông ấy.", "eng": "His garden shed which, with a certain amount of poetic licence, he calls his summer-house."}, {"viet": "Mối quan tâm của anh ta đối với vấn đề đó được khơi dậy bởi cuốn sách.", "eng": "His interest in the subject was awakened by the book."}, {"viet": "Thư của ông ta được viết không lấy gì làm thích hợp lắm.", "eng": "His message was not very happily worded."}, {"viet": "Bố mẹ nó chu cấp cho nó trong chừng mực họ có thể.", "eng": "His parents supported him as far as they could."}, {"viet": "Sự bình phục của anh ấy là một chỉ báo tài năng của các bác sĩ.", "eng": "His recovery is a tribute to the doctors'skill."}, {"viet": "Diễn văn của ông ta ngắn gọn và đúng trọng tâm.", "eng": "His speech was short and to the point."}, {"viet": "Những quan điểm lập dị của ông đã khiến ông ta thành một người ngoài xã hội.", "eng": "His unpopular views made him a social leper."}, {"viet": "Chuyển từng phần của công nghiệp quốc doanh sang sở hữu tư nhân.", "eng": "Hive off parts of a nationalized industry to private ownership."}, {"viet": "Những tờ hoá đơn bệnh viện đã làm cho tiền tiết kiệm của bà ta hao hụt lớn.", "eng": "Hospital bills had made deep inroads into her savings."}, {"viet": "Sao thằng bé ấy có thể ních nhiều kem đến thế.", "eng": "How can that boy put away so much cream."}, {"viet": "Axít tác dụng vào kim loại ra sao?", "eng": "How do acids react on metals?"}, {"viet": "Cô tập luyện piano ra sao rồi?", "eng": "How have you done your piano practice?"}, {"viet": "Có bao nhiêu người ra ứng cử trong cuộc bầu cử Tổng thống?", "eng": "How many candidates are running in the Presidential election?"}, {"viet": "Bạn có bao nhiêu ngày nghỉ phép?", "eng": "How many vacation days do you have?"}, {"viet": "Cách bao lâu bạn tán gẫu với bạn bè trên điện thoại?", "eng": "How often do you chat with your friends on the phone?"}, {"viet": "Sự ẩm ướt là thước đo độ ẩm trong khí quyển.", "eng": "Humidity is a measure of moisture in the atmosphere."}, {"viet": "Tôi muốn hủy chỗ tôi đã đặt trên chuyến bay 071 đi Luân Đôn vào ngày 4.", "eng": "I'd like to cancel my reservation on Flight 071 to London on the 4th."}, {"viet": "Tôi sẽ sung sướng chừng nào đám cưới này xong xuôi.", "eng": "I'll be glad when this wedding is over and done with."}, {"viet": "Tôi sẽ phải gửi nó bằng điện khẩn.", "eng": "I'll have to send it by Urgent Telegram."}, {"viet": "Tôi sẽ chuyển lại cuộc gọi của ông cho người khác hiểu.", "eng": "I'll transfer your call to the person in charge."}, {"viet": "Tôi bắt đầu cảm thấy bị đối xử hơi tệ thôi.", "eng": "I'm beginning to feel just a little put-upon."}, {"viet": "Tôi sẽ đi Paris vào tuần tới Một sự trùng khớp ngẫu nhiên làm sao! Tôi cũng vậy.", "eng": "I'm going to Paris next week What a coincidence! So am I."}, {"viet": "Tôi sẽ không đi với anh-Dứt khoát như thế thôi! Mary cho biết rõ như vậy.", "eng": "I'm not coming with you-and that's final! declared Mary."}, {"viet": "Tôi đã chán ngấy cái trò úp úp mở mở này rồi.", "eng": "I'm sick of all this cloak-and-dagger stuff."}, {"viet": "Tôi chắc chắn bà chủ tiệm đã cân thiếu chỗ khoai tây đó.", "eng": "I'm sure the shopkeeper gave me short measure when she weighed out the potatoes."}, {"viet": "Tôi đang viết một cuốn sách ngữ pháp tiếng Anh hiện đại.", "eng": "I'm writing a grammar of modern English."}, {"viet": "Mình đã mua được phần nhạc thu của phim đó.", "eng": "I've bought the sound-track of that film."}, {"viet": "Anh nghe nói công ty xuất bản Asuka sẽ phát hành cuốn sách mới về thành ngữ tiếng anh.", "eng": "I've heard that Asuka publishing company will be releasing a new English phrase book."}, {"viet": "Tôi đã từng thấy khuôn mặt anh ta trước đây nhưng tôi không thể nhận ra anh ta.", "eng": "I've seen his face before but I can't place him."}, {"viet": "Tôi luôn lẫn lộn \"game\" và \"match\".", "eng": "I always confuse \"game\" and \"match\"."}, {"viet": "Sự giải thích của anh không làm tôi vừa ý.", "eng": "I am not content with your explanation."}, {"viet": "Tôi đã hỏi cô ấy cậu Sam ở đâu, nhưng cô ấy chỉ nhún vai.", "eng": "I asked her where Sam was, but she just shrugged."}, {"viet": "Tôi đã mua chiếc ôtô cái mà anh đã mua.", "eng": "I bought the same car that you did."}, {"viet": "Tôi không thể xỏ chân vào đôi giày này được, giày nhỏ quá.", "eng": "I can't get into these shoes, they've too small."}, {"viet": "Tôi không tài nào nghĩ ra được đã để cái ô của mình ở đâu, trí nhớ tôi hoàn toàn trống rỗng!", "eng": "I can't think where I've left my umbrella, my mind's a complete blank!"}, {"viet": "Giờ đây tôi còn có thể hình dung cô ta như cách đây nhiều năm.", "eng": "I can still see her as she was years ago."}, {"viet": "Tôi không thể lội qua được bằng đôi ủng này.", "eng": "I can't wade in these boot."}, {"viet": "Tôi không thể nào không nhận xét về tuổi trẻ của cô ấy.", "eng": "I couldn't help remarking on her youth."}, {"viet": "Tôi muốn uống thử bia của các anh?", "eng": "I'd like to try your bee?"}, {"viet": "Tôi không cho rằng buổi trình diễn của cô ta hay như thường lệ.", "eng": "I didn't think her performance was up to par."}, {"viet": "Tôi không biết nhiều về đồ sứ nên không thể đánh giá được những cái đĩa này.", "eng": "I don't know enough about porcelain to be able to price these plates."}, {"viet": "Tôi không phản đối những gì cô ta nói, nhưng tôi rất không tán thành cung cách cô ta nói ra điều đó.", "eng": "I don't object to what she says, but I strongly disapprove of her manner of saying it."}, {"viet": "Tôi không muốn những sự khó khăn của tôi đè nặng lên anh.", "eng": "I don't want to burden you with my problems."}, {"viet": "Má không thích con ở khuya ngoài đường như thế.", "eng": "I don't like you staying out so late."}, {"viet": "Tôi thèm một bữa ăn Ấn Độ mua về.", "eng": "I fancy an Indian take-away."}, {"viet": "Tôi buồn nôn khi con tàu bắt đầu chuyển động.", "eng": "I felt sick when the ship started to move."}, {"viet": "Tôi thở hổn hển khi tôi nhảy xuống dòng sông lạnh.", "eng": "I gasped as I jumped into the cold river."}, {"viet": "Tôi được siêu thị tặng những cái cốc vại này.", "eng": "I got these mugs as freebies at the supermarket."}, {"viet": "Tôi chẳng ham đánh nhau tí nào.", "eng": "I had no stomach for a fight."}, {"viet": "Tôi căm ghét sự tàn bạo.", "eng": "I have a deep horror of cruelty."}, {"viet": "Tôi đã làm mất các chi phiếu du lịch của tôi.", "eng": "I have lost my traveler's checks."}, {"viet": "Tôi phải giảm việc ăn quà vặt.", "eng": "I have to cut down on junk food."}, {"viet": "Tôi không muốn mất thì giờ đâu.", "eng": "I haven't got all day."}, {"viet": "Tôi nghĩ rằng kế hoạch đó không thể thực hiện được.", "eng": "I hold the view that the plan cannot work."}, {"viet": "Tôi hy vọng bà sẽ không làm mất nó.", "eng": "I hope you would not lose it."}, {"viet": "Hơn nhiều người khác, tôi không bao giờ thò mũi.", "eng": "I know better than most how to keep myself to myself."}, {"viet": "Tôi thích cô ấy và hi vọng tình cảm này được đền đáp.", "eng": "I like her and I hope the feeling is mutual."}, {"viet": "Tôi sẽ chuẩn bị xong trong tích tắc.", "eng": "I'll be ready in half a minute."}, {"viet": "Tôi sẽ đón bạn ở nhà ga lúc 7 giờ.", "eng": "I'll meet you at the station at seven."}, {"viet": "Tôi hơi sợ các đám cháy.", "eng": "I'm a little afraid of fires."}, {"viet": "Tôi sẽ tráng nhựa con đường trước nhà dẫn tới gara.", "eng": "I'm going to tarmac the front drive."}, {"viet": "Tôi cũng rất vui khi nghe nói vậy.", "eng": "I'm quite pleased to hear that."}, {"viet": "Anh làm cái này đặc biệt dành cho sinh nhật của em.", "eng": "I made this specially for your birthday."}, {"viet": "Tôi phải trồng mấy củ hành kia trước khi thời tiết bắt đầu lạnh.", "eng": "I must get those bulbs planted before the cold weather sets in."}, {"viet": "Tôi cần gặp thiếu tá Amennian tại câu lạc bộ phi công lúc bốn giờ.", "eng": "I need to meet Major Armenian in the pilots'lounge at four o'clock."}, {"viet": "Tôi chỉ biết nàng qua danh tánh thôi.", "eng": "I only know her by name."}, {"viet": "Tôi đã dùng hết sức bình sinh để đẩy tảng đá.", "eng": "I pushed the rock with all my might."}, {"viet": "Tôi trù tính đến Delhi lúc 6 giờ.", "eng": "I reckon to arrive in Delhi at six o'clock."}, {"viet": "Tôi không nói gì cả vì có trẻ con ở đấy.", "eng": "I said nothing because of the children being there."}, {"viet": "Tôi sẽ đi vắng không quá một tuần.", "eng": "I shall be away for no more than a week."}, {"viet": "Tôi kéo lướt tấm thảm tới trước lò sưởi.", "eng": "I slid the rug in front of the fire."}, {"viet": "Tôi cho rằng dấu chìa khoá ô tô đi là cái trò đùa không phải lối của anh ta.", "eng": "I suppose hiding the car keys was not his idea of a joke."}, {"viet": "Tôi nghĩ tôi làm khá tốt trong cuộc phỏng vấn.", "eng": "I think I fared quite well in the interview."}, {"viet": "Tôi nghĩ nó bị trục trặc cái gì đó.", "eng": "I think there is something wrong with it."}, {"viet": "Tôi lật úp cái hộp và sôcôla đổ ra hết.", "eng": "I tipped the box over and the chocolates fell out."}, {"viet": "Tôi quay đầu chạy khi tôi trông thấy con bò đực lao về phía tôi.", "eng": "I turned and ran when I saw the bull making for me."}, {"viet": "Tôi ở nhà chờ cả ngày nhưng họ không đến.", "eng": "I waited in all day but they didn't arrive."}, {"viet": "Tôi muốn gặp ông ta ngay lúc ông ta đến.", "eng": "I want to see him the minute that he arrives."}, {"viet": "Tôi hoàn toàn sửng sốt trước sự xuất hiện bất thần của anh ta.", "eng": "I was completely nonplussed by his sudden appearance."}, {"viet": "Sáng nay tôi lại đi làm muộn-ông chủ sẽ không tha cho tôi đâu.", "eng": "I was late for work again this morning-my boss is after my blood."}, {"viet": "Tôi được ba mẹ trợ cấp trong khi còn đi học.", "eng": "I was supported by my parents when I was studying."}, {"viet": "Tôi đã đi dọc theo bờ biển nước Mỹ.", "eng": "I went to travel along the west coast of the U. S."}, {"viet": "Tôi mong bạn đừng huýt sáo như thế nữa.", "eng": "I wish you'd leave off whistling like that."}, {"viet": "Một giờ nữa tôi cũng chưa làm xong.", "eng": "I won't be finished for another hour."}, {"viet": "Tôi muốn hỏi thăm về một người bạn đang nằm tại đó.", "eng": "I would like to inquire about a friend who is staying there."}, {"viet": "Tôi không để tay tôi bị nhơ nhuốc vì nhận hối lộ.", "eng": "I wouldn't sully my hands by accepting a bride."}, {"viet": "Dù hắn đã nói thế, hắn cũng không nghĩ là anh sẽ để bụng đâu.", "eng": "If he said that, he didn't expect you to take it personally."}, {"viet": "Nếu không có ai phản đối, tôi xin tuyên bố cuộc họp kết thúc.", "eng": "If no one has any objections, I'll declare the meeting closed."}, {"viet": "Nếu việc đó mà hỏng thì công việc của cậu sẽ gặp nguy đấy.", "eng": "If this goes wrong your job's on the line."}, {"viet": "Nếu anh muốn biết ý kiến của tôi thì đây: anh ta sẽ không sống được bao lâu nữa.", "eng": "If you ask me, he hasn't got long to live."}, {"viet": "Nếu thất bại không qua được kỳ thi lấy bằng lái xe, chớ nản lòng.", "eng": "If you fail your driving test the first time, don't let it discourage you."}, {"viet": "Nếu cậu đứng dậy, cậu sẽ làm mất thăng bằng cái xuồng.", "eng": "If you stand up you'll overbalance the canoe."}, {"viet": "Phải có biện pháp ngay tức thì để ngăn không cho lửa lan rộng ra.", "eng": "Immediate action must be taken to stop the fire spreading."}, {"viet": "Ở Trung Quốc, chúng tôi thường bắt đầu bằng một số món ăn nguội.", "eng": "In China, we usually begin with some cold dishes."}, {"viet": "Ở Nhật Bản, nhiều giáo viên trung học không muốn đến trường.", "eng": "In Japan, many high school teachers would not like to go to school."}, {"viet": "Mặc dù anh ấy đã làm những việc xấu, tôi vẫn tin ở bản chất thánh thiện của anh ấy.", "eng": "In spite of the bad things he's done I still believe in his essential goodness."}, {"viet": "Trong bức hoạ chân dung đó, ông ấy được miêu tả ở tư thế nằm trên ghế bành.", "eng": "In the portrait he is shown lying on a sofa."}, {"viet": "Theo ý bạn, nơi đến du lịch được ưa chuộng nhất trên thế giới là nơi nào?", "eng": "In your opinion, what is the most popular tourist destination in the world?"}, {"viet": "Thưa ông, ông hài lòng về mọi thứ chứ ạ?", "eng": "Is everything to your satisfaction, sir?"}, {"viet": "Có bà chủ ở nhà không?", "eng": "Is the mistress of the house in?"}, {"viet": "Đây có phải là nhà của ông John Smith không?", "eng": "Is this the home of Mr. John Smith?"}, {"viet": "Đàn ông hay đàn bà là người lái xe tốt hơn, đó là điều còn phải bàn.", "eng": "It's a moot point whether men or women are better drivers."}, {"viet": "Bill Smith, một bàn dành cho tám người vào khoảng 7 giờ 30 tối nay.", "eng": "It's Bill Smith, a table for eight at about 7: 30 this evening."}, {"viet": "Nó được tổ chức vào giữa tháng giêng âm lịch.", "eng": "It's held in mid January of the lunar calendar."}, {"viet": "Thật không hay nếu em mang theo quá nhiều.", "eng": "It's not a good idea to carry a lot of cash on you."}, {"viet": "Nghĩa là có ăn như thế thì mì mới ngon hơn.", "eng": "It's said that noodles taste better that way."}, {"viet": "Phận sự của anh là phải báo tin cho ông ấy.", "eng": "It's up to you to break the news to him."}, {"viet": "Thật là không khôn ngoan nếu mua chiếc áo khoác đắt tiền này trong lúc những chiếc rẻ tiền hơn cũng vẫn tốt như vậy.", "eng": "It doesn't make sense to buy that expensive coat when these cheaper ones are just as good."}, {"viet": "Người ta buộc tội rằng ngày 30 tháng mười một, bị cáo..", "eng": "It is charged that on 30 November, the accused.."}, {"viet": "Chuyện đó ngày nay đã được mọi người thừa nhận là một sai lầm.", "eng": "It is now generally admitted to have been a mistake."}, {"viet": "Có vẻ việc này đã trở thành nhiệm vụ nặng nề.", "eng": "It looks like this will become a large task."}, {"viet": "Nó ở cuối lối đi này.", "eng": "It's at the end of this aisle."}, {"viet": "Nó mang tính sống còn đối với sự thành công của bất cứ ai.", "eng": "It's vital to one's success."}, {"viet": "Nó phải mất một thời gian mới quen được với trường học mới.", "eng": "It took him some time to orientate himself in his new school."}, {"viet": "Anh ta thật táo bạo khi diễn thuyết trước tất cả những người ấy.", "eng": "It was bold of him to make a speech in front of all those people."}, {"viet": "Thật rõ rành rành là nó nói dối.", "eng": "It was patently obvious that he was lying."}, {"viet": "Sẽ rất có ích khi giữ một ít nhân dân tệ Trung Quốc trước khi rời đi.", "eng": "It will be helpful keeping some Chinese yuan before leaving."}, {"viet": "Jame ạ, tôi đang nghĩ về công việc của công ty đó.", "eng": "James, I've been thinking about that company's job."}, {"viet": "John rất giỏi sắp xếp-anh ta luôn luôn làm công việc tốt và nhanh.", "eng": "John is very organized-he always does his work well and quickly."}, {"viet": "Công lý đã trừng phạt những kẻ phạm tội.", "eng": "Justice was meted out to the offenders."}, {"viet": "Trước trận đấu Leonard nhìn Durian chằm chằm cố tìm hiểu anh ta theo trực giác.", "eng": "Leonard stared hard at Durian before the fight, trying to psych him out."}, {"viet": "Chúng ta hãy hoãn việc quyết định.", "eng": "Let's hold off on making a decision."}, {"viet": "Nhiều sự thay đổi đã được đưa vào trong thời của tổng thống trước.", "eng": "Many changes were introduced during the regime of the late President."}, {"viet": "Nhiều sinh viên có số lần tham dự lớp học rất ít.", "eng": "Many students have a very poor attendance record."}, {"viet": "Liệu tôi có thể mượn cuốn sách một vài ngày được không?", "eng": "May I borrow the book for a day or two?"}, {"viet": "Có lẽ nó đã có bán ở các hiệu sách rồi.", "eng": "Maybe it has already hit the bookstores."}, {"viet": "Hầu hết mọi miền trong cả nước sẽ khô, nhưng có thể có mưa ở một số vùng.", "eng": "Most of the country will be dry, but there may be some rain locally."}, {"viet": "Bà Jones chờ đợi sự vâng lời của tất cả học sinh của bà.", "eng": "Mrs Jones excepts obedience from all her pupils."}, {"viet": "Cái áo khoác của tôi quá cũ kĩ không thể mặc đi xem nhạc kịch được.", "eng": "My coat is too beat up to wear to the opera."}, {"viet": "Những ngày vội vàng của tôi trôi đi rất nhanh.", "eng": "My hasting days fly on with full career."}, {"viet": "Cha mẹ tôi dạy tôi đừng bao giờ nói dối.", "eng": "My parents taught me never to tell lies."}, {"viet": "Bạn gái của Nam thật hấp dẫn.", "eng": "Nam's girl friend is a bit of all right."}, {"viet": "Các báo gửi những phóng viên chuyên đến những nơi đang diễn ra các sự kiện quan trọng.", "eng": "Newspapers send special correspondents to places where important events take place."}, {"viet": "Không, anh đi nhầm đường rồi.", "eng": "No, you're going the wrong way."}, {"viet": "Không nhiều lắm, nhưng hộ chiếu của tôi để trong túi xách.", "eng": "Not much, but my passport was in the bag."}, {"viet": "Nhiều điều bảo đảm rằng chúng ta đã được an toàn.", "eng": "Numerous reassurances that we were safe."}, {"viet": "Ồ, trên quần áo của bà có những vết bẩn.", "eng": "Oh, there are stains on your clothes."}, {"viet": "Sáng thứ bảy, cha tôi trịnh trọng phân phát tiền tiêu vặt cho từng đứa con.", "eng": "On Saturday morning my father solemnly dispensed pocket money to each of the children."}, {"viet": "Một bữa ăn mỗi ngày sẽ không đủ cho một đứa trẻ đang lớn lên.", "eng": "One meal a day won't suffice a growing."}, {"viet": "Hoặc có lẽ là một vụ cháy nhỏ ở nhà bếp.", "eng": "Or maybe a small fire in a kitchen."}, {"viet": "Lực lượng ta rút lui về những vị trí đã chuẩn bị sẵn.", "eng": "Our forces retire to prepared positions."}, {"viet": "Sự thâm nhập của chúng ta vào hàng phòng ngự của địch.", "eng": "Our penetration of the enemy's defences."}, {"viet": "Vô cùng xúc động, anh ta siết chặt tay cô ấy và ra về.", "eng": "Over-come with emotion, he pressed her hand and left her."}, {"viet": "Tỏ ra ít quan tâm tới tình cảm của những người khác.", "eng": "Pay little regard for the feelings of others."}, {"viet": "Người ta sẽ không tôn trọng ( điều ao ước của ) tôi được sống riêng tư.", "eng": "People won't respect my ( desire for ) privacy."}, {"viet": "Xin chờ một chút để tôi kiểm tra.", "eng": "Please wait a moment while I check."}, {"viet": "Những nhận xét thích hợp với cuộc thảo luận.", "eng": "Remarks that are germane to the discussion."}, {"viet": "Nhìn từ góc độ này người phụ nữ trong tranh đang mỉm cười.", "eng": "Seen from this angle the woman in the picture is smiling."}, {"viet": "Bà ấy thà chết hơn là mất các con.", "eng": "She'd rather die than lose the children."}, {"viet": "Cô ấy rất hận những đồng nghiệp của cô ấy.", "eng": "She's at daggers drawn with her colleagues."}, {"viet": "Cô ta cũng chia sẻ những nỗi buồn vô hạn của cô ta.", "eng": "She's had her share of heart-breaks."}, {"viet": "Bà ta đã dành dụm một món tiền nhỏ cho lúc về hưu của bà ta.", "eng": "She's out aside a tidy sum for her retirement."}, {"viet": "Cô ta rất giỏi truyền đạt tư tưởng của cô ta.", "eng": "She's very good at putting her ideas across."}, {"viet": "Cô ấy yêu cầu nhà báo chớ có trích dẫn lời nhận định của cô ấy.", "eng": "She asked the newspapers reporter not to quote her remark."}, {"viet": "Bà vẫn tiếp tục giảng dạy khi đã quá tuổi nghỉ hưu khá nhiều.", "eng": "She carried on teaching well beyond retirement age."}, {"viet": "Cô ấy nằm cuộn tròn trước ngọn lửa với một cuốn sách.", "eng": "She curled up in front of the fire with a book."}, {"viet": "Cô ấy luyện tập để cho khoẻ giọng.", "eng": "She does exercises to strengthen her voice."}, {"viet": "Cô ta cảm thấy những giọt mưa rơi trên gương mặt ngẩng lên của cô.", "eng": "She felt drops of rain on her upturned face."}, {"viet": "Cô ấy nhìn tôi chằm chằm không tin khi tôi nói cho cô hay cái tin ấy.", "eng": "She gazed at me in disbelief when I told her the news."}, {"viet": "Cô bé đã bị thuỷ đậu và người đầy vết lấm tấm.", "eng": "She had chicken-pox and was covered in spots."}, {"viet": "Cô ta có một lối diễn đạt thích hợp để tóm tắt một tình hình.", "eng": "She has an apt turn of phrase for summing up a situation."}, {"viet": "Cô ấy vẫn chưa giành được thắng lợi, chưa được chút nào.", "eng": "She hasn't won yet, by any manner of means."}, {"viet": "Cô ấy đang trở thành một phụ nữ trẻ đẹp.", "eng": "She is growing into a beautiful young woman."}, {"viet": "Cô ta cứ lần lữa mãi không chịu đến nha sĩ.", "eng": "She keeps putting off going to the dentist."}, {"viet": "Cô trông coi các cô em với sự chăm nom săn sóc ân cần.", "eng": "She looked after her little sisters with loving care."}, {"viet": "Bà ta có thể bực mình nếu anh không đáp lại lời mời của bà.", "eng": "She may be offended if you don't reply to her invitation."}, {"viet": "Cô ta vẽ với những nét bút mạnh bạo.", "eng": "She paints with bold strokes of the brush."}, {"viet": "Khi lùi xe, cô ta đâm ô tô vào một cái cây.", "eng": "She ran her car into a tree while reversing."}, {"viet": "Cô bé đúng là con bé tinh nghịch.", "eng": "She's a real little pickle."}, {"viet": "Cô ta không phải là người vùng này.", "eng": "She's not from these parts."}, {"viet": "Cô ấy ngồi dưới gốc cây để tránh nắng.", "eng": "She sat underneath the tree out of the sun."}, {"viet": "Cô ấy đã chỉ vẽ phương pháp phân tích của mình cho học sinh.", "eng": "She showed her methods of analysis to her pupils."}, {"viet": "Cô ta dứ dứ ngón tay trong không khí để nhấn mạnh điều cô đang nói.", "eng": "She stabbed at the air with her finger to emphasize what she was saying."}, {"viet": "Bà ta điềm tĩnh nói chuyện với các phóng viên về cuộc thử thách ghê gớm của bà.", "eng": "She talked composedly to reporters about her terrible ordeal."}, {"viet": "Cô bước đi nhẹ nhàng để khỏi làm đứa bé thức dậy.", "eng": "She trod lightly so as not to wake the baby."}, {"viet": "Cô ta là nhân viên ngân hàng cho đến lúc chiến tranh, khi cô được huấn luyện làm y tá.", "eng": "She was a bank clerk until the war, when she trained as a nurse."}, {"viet": "Bà ta bị tính trội bốn bảng Anh so với số tiền ghi trên hóa đơn.", "eng": "She was charged an excess of £ 4 over the amount stated on the bill."}, {"viet": "Bà ta bị giam trong khi chờ xét xử.", "eng": "She was held in custody pending trial."}, {"viet": "Cô bé nhớ mẹ của cô bé.", "eng": "She was pining for her mother."}, {"viet": "Cô ta được đưa vào bệnh viện với một bên phổi bị thủng.", "eng": "She was taken to hospital with punctured lung."}, {"viet": "Cô ta nhìn những cố gắng vụng về của họ với vẻ thích thú có chút giễu cợt.", "eng": "She watched their fumbling efforts with wry amusement."}, {"viet": "Cô ta thắng được 100 bảng Anh rồi vung hết tiền sắm áo quần mới.", "eng": "She won £ 100 and then splurged it all on new clothes."}, {"viet": "Cởi bỏ quần áo của mình vào một ngày nóng nực.", "eng": "Shedding one's clothes on a hot day."}, {"viet": "Đóng cửa lại, nếu không ánh sáng sẽ làm mờ phim.", "eng": "Shut the door or the light will fog the film."}, {"viet": "Thả dây cáp xuống vị trí dưới đáy biển.", "eng": "Sink the cable into position on the sea bed."}, {"viet": "Những cái bánh quy nhỏ thơm ngon là một món khai vị đơn giản.", "eng": "Small savoury biscuits provide a simple appetizer."}, {"viet": "Vì vậy thay vì tất cả đi cùng một lúc, chúng ta hãy đến thăm bạn ấy từng người một.", "eng": "So instead of going all together, let's visit her individually."}, {"viet": "Điều chỉnh ống kính một chút có lẽ là cần thiết.", "eng": "Some adjustments of the lens may be necessary."}, {"viet": "Thức ăn đã được ăn một ít, nhưng không phải tất cả.", "eng": "Some of the food has been eaten, but not all of it."}, {"viet": "Có những điều không nói ra thì tốt hơn.", "eng": "Some things are better left unsaid."}, {"viet": "Chẳng bao lâu toàn trường đã biết tin cô ấy thắng giải.", "eng": "Soon, the whole school knew about her win."}, {"viet": "Qua những ngày nghỉ hè ở vùng biển.", "eng": "Spend summer holidays by the sea."}, {"viet": "Bình tĩnh lại đi, anh đang làm cho tôi căng thẳng tột độ!", "eng": "Steady on, you're giving me the jimjams!"}, {"viet": "Hãy thôi cãi vã về cách sử dụng dấu phẩy.", "eng": "Stop quibbling about the use of the comma."}, {"viet": "Nộp bản đã được sửa chữa của một quyển tiểu thuyết để xuất bản.", "eng": "Submit the revision of a novel for publication."}, {"viet": "Sue có vẻ rất trầm lặng nhưng đừng có lầm, cô ta tính rất nóng nảy đấy!", "eng": "Sue seems very quiet, but make no mistake, she has a terrible temper!"}, {"viet": "Sống sót trong tai nạn đâm ôtô nhưng đã làm xe tan nát hoàn toàn.", "eng": "Survived the crash but totaled the car."}, {"viet": "Mời ông mang chiếc xe ôtô ra chạy thử xem ông có thích nó không.", "eng": "Take the car for a trial run to see if you like it."}, {"viet": "Sự thay đổi về kỹ thuật phân cách những nhà cải cách với những kẻ theo đuôi.", "eng": "Technological change separates the innovators from the tag-along."}, {"viet": "Cám ơn, nhất định tôi sẽ có mặt ở đó.", "eng": "Thank you, I'll be there without fail."}, {"viet": "Chính người này đã làm điều ấy-cô ta nói, chỉ về phía tôi.", "eng": "That's the man who did it, she said, pointing at me."}, {"viet": "Cái áo này xấu quá, tôi thà chết chứ không đời nào mặc.", "eng": "That dress is so ugly I wouldn't be seen dead in it."}, {"viet": "Anh chàng rồ dại kia lái xe quá nhanh.", "eng": "That maniac drives far too fast."}, {"viet": "Đó chính là điều tôi cần!", "eng": "That's just what I wanted!"}, {"viet": "Đó là một ý nghĩ ngu ngốc nhất tôi chưa từng nghe thấy.", "eng": "That was an airheaded idea if I ever heard one."}, {"viet": "Tai nạn đã xảy ra do sự cẩu thả của cô ta.", "eng": "The accident was due to her negligence."}, {"viet": "Những người kể trên đang hành động một cách đáng ngờ.", "eng": "The aforementioned person was acting suspiciously."}, {"viet": "Dân Anglo-Saxon, Đức-Bắc âu...", "eng": "The Anglo-Saxon, Germanic, Nordic, etc races."}, {"viet": "Lĩnh vực tài chính, đào tạo, phát triển, v. v.", "eng": "The area of finance, training, development, etc."}, {"viet": "Vận động viên đột ngột tăng vọt tốc độ lên.", "eng": "The athlete's electrifying burst of speed."}, {"viet": "Con sông Avon là một phụ lưu của sông Severn.", "eng": "The Avon is a tributary of the Severn."}, {"viet": "Băng nhạc đó đã đi biểu diễn lưu động gần một tháng nay rồi.", "eng": "The band has been on the road for almost a month."}, {"viet": "Chiến trường là một quang cảnh khủng khiếp.", "eng": "The battlefield was a frightened scene."}, {"viet": "Tuyên ngôn nhân quyền trong Hiến pháp Mỹ.", "eng": "The Bill of Rights of the US Constitution."}, {"viet": "Chiếc thuyền đến ngang hàng với chúng tôi và ra hiệu cho chúng tôi dừng lại.", "eng": "The boat came abreast of us and signalled us to stop."}, {"viet": "Cuốn sách này có vẻ hơi quá lạ kỳ, ngay cả về việc mô tả cái mà mọi người thực sự thừa nhận là một cuộc cách mạng.", "eng": "The book seems a little too gee-whiz even for describing what everyone does admit is a revolution."}, {"viet": "Cậu con trai mà lúc nãy tôi nói chuyện là con trai của chủ tôi.", "eng": "The boy who I spoke to a moment ago is the son of my employer."}, {"viet": "Những cánh đồng bát ngát của miền Tây nước Mỹ.", "eng": "The broad plains of the American West."}, {"viet": "Chiếc xe buýt chạy nhanh đến nỗi cô ấy không hề biết cái gì đâm vào mình nữa.", "eng": "The bus was moving so fast she never knew what hit her."}, {"viet": "Công ty cho thuê xe là vụ làm ăn liên doanh liều lĩnh gần đây nhất của họ.", "eng": "The car-hire firm is their latest joint business venture."}, {"viet": "Chiếc xe đang chạy với tốc độ 90 dặm Anh một giờ.", "eng": "The car was doing 90 miles an hour."}, {"viet": "Con mèo ở dưới gầm bàn.", "eng": "The cat was under the table."}, {"viet": "Những thay đổi không tạo cho quan hệ sản xuất tốt hơn.", "eng": "The changes were not productive of better labour relation."}, {"viet": "Đứa trẻ đang than khóc trước cái chết của mẹ.", "eng": "The child lamented over the death of her mother."}, {"viet": "Bọn trẻ con rất thích thú về cái máy vi tính mới.", "eng": "The children are wild about the new computer."}, {"viet": "Bọn trẻ vui mừng hò reo nhảy múa.", "eng": "The children went wild with excitement."}, {"viet": "Thùng chứa đó cạn sạch trong vòng năm phút.", "eng": "The cistern empties in five minutes."}, {"viet": "Quần áo ngâm trong nước xà phòng.", "eng": "The clothes are soaking in soapy water."}, {"viet": "Vụ đâm xe đó làm cho chiếc ôtô quay tròn nhiều vòng văng qua đường.", "eng": "The collision sent the car spinning across the road."}, {"viet": "Công ty bị vỡ nợ 2 triệu pao.", "eng": "The company crashed with debts of 2 million pounds."}, {"viet": "Những cái rắc rối của toán học cao cấp.", "eng": "The complexities of higher mathematics."}, {"viet": "Những hậu quả tiếp theo vụ tai tiếng đó.", "eng": "The continuing reverberations of the scandal."}, {"viet": "Tài nguyên thiên nhiên của đất nước bao gồm than và dầu.", "eng": "The country's natural resources include coal and oil."}, {"viet": "Toà án ồn ào khi bị cáo được dẫn vào.", "eng": "The courtroom buzzed as the defendant was led in."}, {"viet": "Đám đông ném trứng thối như mưa vào diễn giả.", "eng": "The crowd pelted bad eggs at the speaker."}, {"viet": "Chu kỳ của các thời kỳ thịnh vượng và suy thoái kinh tế.", "eng": "The cycle of economic booms and plumps."}, {"viet": "Quyết định ấy có lợi cho hắn.", "eng": "The decision went in his favour."}, {"viet": "Mục đích của người vẽ kiểu là tạo ra một sự hài hoà về hình dáng và lớp mặt.", "eng": "The designer's aim is to produce a harmony of shape and texture."}, {"viet": "Những người thua cuộc thất vọng cố lê về nhà để hồi phục sức lực.", "eng": "The disappointed losers crawled home to lick their wounds."}, {"viet": "Bác sĩ cho ông ấy một cuộc hẹn sớm hơn vì ông ấy bị ốm nặng.", "eng": "The doctor gave him a prior appointment as he was critically ill."}, {"viet": "Con chó đớp tôi một miếng hiểm vào chân.", "eng": "The dog gave me a nasty nip on the leg."}, {"viet": "Cách viết câu này rất tối tăm.", "eng": "The drafting of this clause is very obscure."}, {"viet": "Đôi cánh lớn của đại bàng làm cho nó bay rất nhanh.", "eng": "The eagle's large wings enable in to fly very fast."}, {"viet": "Việc cung cấp điện đã bị cắt tại nguồn.", "eng": "The electricity supply has been cut off at the mains."}, {"viet": "Sự giải trí của một nhóm khách nước ngoài.", "eng": "The entertainment of a group of foreign visitors."}, {"viet": "Tỉ số hối đoái của đồng pao khoảng 90 rupi SriLankan.", "eng": "The exchange rate of the pound sterling is approximately ninety Sri Lankan rupees."}, {"viet": "Những nhân tố đã ảnh hưởng đến quyết định của tôi.", "eng": "The factors that influenced my decision."}, {"viet": "Vòi nước cứ chảy nhỏ giọt suốt đêm.", "eng": "The faucet has been dripping all night long."}, {"viet": "Bộ phim thu hút đông đảo khán giả.", "eng": "The film is drawing large audiences."}, {"viet": "Giấy của công ti in nổi tên và địa chỉ của nó.", "eng": "The firm's paper is embossed with its name and address."}, {"viet": "Chim cổ đỏ đầu tiên là một dấu hiệu của mùa xuân.", "eng": "The first robin is a precursor of spring."}, {"viet": "Phần kế tiếp là quan trọng nhất.", "eng": "The following is of the greatest importance."}, {"viet": "Điểm đóng băng của nước là 0 độ C.", "eng": "The freezing-point of water is 0 độ C."}, {"viet": "Bọn găngxtơ nấp trong một ngôi nhà gỗ cho đến khi an toàn để trở lại thành phố.", "eng": "The gangsters hid out in a remote cabin until it was safe to return to the city."}, {"viet": "Nhà in lớn và hiện đại in cuốn sách này thậm chí có thể in đồng thời các tranh minh họa có màu cùng với việc in chữ.", "eng": "The giant modern press that printed this book even printed the colored pictures along with the type."}, {"viet": "Sự can thiệp của chính phủ là rất không đúng lúc.", "eng": "The government's intervention was badly mistimed."}, {"viet": "Chính phủ đã ra lệnh ỉm đi một số tin tức trong thời gian khủng hoảng.", "eng": "The government imposed a news blackout during the crisis."}, {"viet": "Sự thu hẹp dần ngành công nghiệp than của nhà nước.", "eng": "The governments gradual run-down of the coal industry."}, {"viet": "Mặt đất cần phải san phẳng trước khi anh trồng thành bãi cỏ.", "eng": "The ground should be levelled before you plant a lawn."}, {"viet": "Súng bắn tóe lửa hai phát và anh ta gục chết.", "eng": "The gun spat twice and he fell dead."}, {"viet": "Nhà vô địch thế giới quyền Anh hạng nặng.", "eng": "The heavy weight boxing champion of the world."}, {"viet": "Con ngựa bắt đầu đi bằng nước kiệu đều.", "eng": "The horse started off at a steady trot."}, {"viet": "Ngôi nhà được mở rộng thêm từng thời kỳ.", "eng": "The house has been added to from time to time."}, {"viet": "Cuộc săn lùng những kẻ khủng bố vẫn tiếp tục.", "eng": "The hunt for these terrorists still continues."}, {"viet": "Đứa trẻ đó gục đầu xuống là có ý muốn ngủ.", "eng": "The inclination of the child's head suggested sleep."}, {"viet": "Sự phối âm đó rất độc đáo.", "eng": "The instrumentation is particularly fine."}, {"viet": "Các nữ trang là tài sản riêng của bà ấy.", "eng": "The jewels were her personal property."}, {"viet": "Bồi thẩm đoàn đã công bố phán quyết của mình.", "eng": "The jury has rendered its verdict."}, {"viet": "Hồ sâu 1300 bộ, nhưng mặt hồ vẫn có đến non 1300 bộ dưới mặt nước biển.", "eng": "The lake is about 1,300 feet deep, but its surface is still nearly 1,300 feet below sea level."}, {"viet": "Luật pháp buộc cha mẹ phải gởi con cái tới trường.", "eng": "The law obliges parents to send their children to school."}, {"viet": "Bức thư được viết với nét bút duyên dáng.", "eng": "The letter was written in flowing handwriting."}, {"viet": "Chiếc thuyền nhỏ bằng giấy bắt gặp xoáy nước và quay tròn trong dòng nước.", "eng": "The little paper boat was caught in an eddy and spun round and round in the water."}, {"viet": "Hành lý được chuyển từ từ vào thang máy.", "eng": "The luggage was shunted slowly into the lift."}, {"viet": "Họ đồng ý đến hội đồng phân xử để giải quyết việc đòi tăng lương.", "eng": "The man agreed to go to arbitration to settle their pay claim."}, {"viet": "Trận đấu đã phải bỏ dở vì bãi sũng nước.", "eng": "The match had to be abandoned because the pitch was waterlogged."}, {"viet": "Cuộc họp phát hiện có một số lĩnh vực chưa nhất trí.", "eng": "The meeting revealed certain areas of disagreement."}, {"viet": "Những người thợ mỏ tranh cãi với chủ của họ về tiền lương.", "eng": "The miners were in dispute with their employers over pay."}, {"viet": "Tiền cùng với danh sách mua hàng để trên bàn.", "eng": "The money is on the table with the shopping-list."}, {"viet": "Ý nghĩ của nàng thay đổi như một con chim bay tung tăng.", "eng": "The motions of her mind were as incalculable as the flit of a bird."}, {"viet": "Cái tên Santa Claus xuất phát từ Saint Nicholas", "eng": "The name Santa Claus comes from Saint Nicholas."}, {"viet": "Những tấm rèm mới rất hoà hợp màu sắc với chiếc thảm.", "eng": "The new curtains tone in beautifully with the carpet."}, {"viet": "Tỷ lệ thanh toán mới chưa được nhất trí một cách chính thức.", "eng": "The new rates of pay have not been formally agreed."}, {"viet": "Tin tức đó rất là vừa lòng chúng tôi.", "eng": "The news was very pleasing to us."}, {"viet": "Biển đề trên cửa nói thư viện đóng cửa.", "eng": "The notice on the door said that the library was closed."}, {"viet": "Xác suất là 50 đối lập với 1 chống lại người mới đến.", "eng": "The odds are 50 to 1 against the newcomer."}, {"viet": "Ông già này không thể đi được nếu không có gậy chống.", "eng": "The old man cannot walk without a stick."}, {"viet": "Phe đối lập đã bác bỏ bản báo cáo coi như là một sự che giấu khuyết điểm.", "eng": "The opposition dismissed the report as a whitewash."}, {"viet": "Tự nhiên cánh tay cô ta đau nhói.", "eng": "The pain shot up her arm."}, {"viet": "Người đại biểu của đảng đã được ban lãnh đạo đảng cung cấp đầy đủ tài liệu trước.", "eng": "The party representative had been well primed with the facts by party headquarters."}, {"viet": "Những người nông dân phải phục dịch và phục tùng lãnh chúa của họ.", "eng": "The peasant owed service and obedience to their overlord."}, {"viet": "Dược sĩ pha chế thuốc theo đơn.", "eng": "The pharmacist made up the prescription."}, {"viet": "Tiếng binh của đạn chạm vào đá.", "eng": "The ping of bullets hitting the rocks."}, {"viet": "Các đồ án về toà thị chính mới vẫn chỉ là niềm hy vọng trong con mắt của nhà kiến trúc.", "eng": "The plans for the new town hall were then still only a gleam in the architect's eye."}, {"viet": "Những điều thú vị của cuộc sống nơi thôn dã.", "eng": "The pleasures of living in the country."}, {"viet": "Cuối cùng cảnh sát truy lùng hắn khắp Pari.", "eng": "The police eventually ran him to earth in Paris."}, {"viet": "Đồn cảnh sát ở cách đây một dặm trên quả đồi phía trước-cứ đi thẳng là đến.", "eng": "The police station is a mile ahead up the hill-just follow your nose."}, {"viet": "Những khuy bấm trên bộ áo ngủ của một đứa bé.", "eng": "The poppers on a child's pyjamas."}, {"viet": "Cái móng của chim đại bàng có thể quắp mồi được.", "eng": "The prehensile claws of an eagle."}, {"viet": "Tổng thống không có thì giờ để bình luận.", "eng": "The president was not available for comment."}, {"viet": "Thủ tướng đã được báo cáo tình hình đầy đủ trước buổi họp.", "eng": "The Prime Minister was fully briefed before the meeting."}, {"viet": "Vấn đề sẽ cần phải được xem xét kỹ.", "eng": "The problem will need a lot of going into."}, {"viet": "Đề nghị đó đã được nhất trí chấp nhận.", "eng": "The proposal was accepted with unanimous approval."}, {"viet": "Mục đích của chương trình này chủ yếu là giáo dục.", "eng": "The purpose of the programme is primarily educational."}, {"viet": "Cái mảng nổi được là nhờ những thùng xăng rỗng.", "eng": "The raft was buoyed up by empty petrol cans."}, {"viet": "Việc xây dựng xảy ra vì hậu quả của cuộc chiến tranh.", "eng": "The rebuilding which took place in the aftermath of the war."}, {"viet": "Mùi ghê tởm của miếng thịt thiu.", "eng": "The repellent smell of rotting meat."}, {"viet": "Các kết quả không phù hợp với hy vọng của chúng ta.", "eng": "The results were not answerable to our hopes."}, {"viet": "Dòng sông Thames chảy qua Luân Đôn.", "eng": "The River Thames flows through London."}, {"viet": "Phòng chật ních rồi, chúng tôi không thể nhét thêm người nào vào được nữa.", "eng": "The room's full, we can't cram any more people in."}, {"viet": "Những người chạy thi cố gắng nước rút khi đến gần cột mốc.", "eng": "The runners spurted as they approach the winning post."}, {"viet": "Những vết sẹo trên cơ thể làm cho lời khai của anh ấy có thể đúng là anh ấy đã bị tra tấn.", "eng": "The scars on his body lent colour to his claim that he had been tortured."}, {"viet": "Biển ở cách khách sạn hai dặm.", "eng": "The sea is two miles away from the hotel."}, {"viet": "Đường lượn khúc của dòng sông.", "eng": "The serpentine course of the river."}, {"viet": "Chiếc tàu đắm cách Stockholm mười dặm.", "eng": "The ship sank ten miles out of Stockholm."}, {"viet": "Cuộc trình diễn đã phải huỷ bỏ vì khán giả quá ít.", "eng": "The show had to be taken off because of poor audiences."}, {"viet": "Tình hình không xấu như anh nói.", "eng": "The situation is not so bad as you suggest."}, {"viet": "Cái ông gọi là nhà quí tộc này đập cửa cái sầm.", "eng": "The so-called gentleman slammed the door."}, {"viet": "Tiếng cái cốc vỡ tan từng mảnh trên sàn nhà.", "eng": "The sound of a glass smashing into pieces on the floor."}, {"viet": "Chiếc xe ôtô thể thao chạy vụt qua chúng tôi.", "eng": "The sports car shot past us."}, {"viet": "Nhà máy thép đóng cửa nghỉ lễ.", "eng": "The steel works are closed for the holidays."}, {"viet": "Cuộc đình công đã lan sang các nhà máy khác.", "eng": "The strike has already spread to other factories."}, {"viet": "Trời nắng nhưng dầu sao tôi cũng cứ mang áo mưa đi.", "eng": "The sun's out, but I'll take a raincoat just the same."}, {"viet": "Xe tăng chạy trên mặt chiến hào quân địch.", "eng": "The tank trundled over the enemy's trench."}, {"viet": "Đội bóng chơi tồi làm huấn luyện viên không hài lòng.", "eng": "The team's poor performance dissatisfied the coach."}, {"viet": "Bọn khủng bố sẽ chỉ thả các con tin với một vài điều kiện nào đó.", "eng": "The terrorists will only release their hostages on certain conditions."}, {"viet": "Thuỷ triều xuống dần bởi vậy chúng tôi phải đầu hàng.", "eng": "The tide was running out, where-fore we surrendered."}, {"viet": "Thành phố đã giữ vững trước các cuộc tấn công liên tiếp của kẻ thù.", "eng": "The town was held against frequent enemy attacks."}, {"viet": "Các cây có bóng mát mời gọi mọi người tránh nắng.", "eng": "The trees offered welcome shade from the sun."}, {"viet": "Hai cô gái giống nhau đến nỗi người lạ khó mà phân biệt cô này với cô kia.", "eng": "The two girls are so alike that strangers find, it difficult to tell the one from the other."}, {"viet": "Nghiệp đoàn đã cố gắng để cải thiện điều kiện làm việc của chúng tôi.", "eng": "The union has striven to improve our working conditions."}, {"viet": "Động từ'go'không phải là động từ quy tắc, còn'walk'là quy tắc.", "eng": "The verb'go'is not regular, but'walk'is."}, {"viet": "Người đi bộ đường dài dừng lại, say sưa trong âm thanh của rừng.", "eng": "The walker paused, pleasuring in the sounds of the forest."}, {"viet": "Thời tiết xấu mà thức ăn thì kinh tởm.", "eng": "The weather was bad and the food dreadful."}, {"viet": "Cơn gió thổi những chiếc lá khỏi cây.", "eng": "The wind blew the leaves off the trees."}, {"viet": "Cái từ đó gọi là acedia, đó là sự chán chường, không muốn cố gắng lan tới tận con tim và trở thành sự chán chường bất cần.", "eng": "The word is acedia, it is the weariness of effort that extends to the heart and becomes a weariness of caring."}, {"viet": "Ví dụ lòng đỏ trứng gà vừa mới thành hình là một tế bào.", "eng": "The yolk of a newly-formed hen's egg, for instance, is a cell."}, {"viet": "Tiếng tăm của họ hoàn toàn dựa trên một kỷ lục duy nhất.", "eng": "Their fame rests entirely on one record."}, {"viet": "Tiếng thét của họ dội qua cánh rừng.", "eng": "Their shouts echoed through the forest."}, {"viet": "Vậy người ta thường làm gì vào đêm giao thừa?", "eng": "Then what do you usually do on the Eve?"}, {"viet": "Có tin đồn ông ta sẽ từ chức.", "eng": "There's a story afloat that he'll resign."}, {"viet": "Ít có khả năng anh ta thành công.", "eng": "There's not much likelihood he'll succeed."}, {"viet": "Có nhiều loại trùng có lỗ khác nhau.", "eng": "There are different kinds of foraminifera."}, {"viet": "Có nhiều cách trang trí cho đồ gốm.", "eng": "There are several ways of decorating a piece of pottery."}, {"viet": "Đã có tai nạn xảy ra tại nhà máy.", "eng": "There has been an accident at the works."}, {"viet": "Có một chiếc tàu lượn mới ở Vancouver.", "eng": "There is a new roller coaster in Vancouver."}, {"viet": "Đầu máy không có gì hỏng hóc cả.", "eng": "There is nothing amiss with the engine."}, {"viet": "Có một tờ séc kẹp vào sau lá thư.", "eng": "There was a cheque clipped to the back of the letter."}, {"viet": "Có ít sai trệch so với thông lệ của anh ta.", "eng": "There was little deviation from his usual routine."}, {"viet": "Có mấy thứ đồ vật trên sàn căn phòng.", "eng": "There were several objects on the floor of the room."}, {"viet": "Những vết nứt này có thể chứa những vi khuẩn nguy hiểm.", "eng": "These cracks can harbor dangerous bacteria."}, {"viet": "Những viên thuốc này chính là thứ để trị chứng cảm lạnh của anh.", "eng": "These pills are the very thing for your cold."}, {"viet": "Họ đi chơi một ngày tới Black pool.", "eng": "They're going on a day trip to Black pool."}, {"viet": "Tất cả họ đều phải tham gia, dù muốn hay không.", "eng": "They all had to take part, willy-nilly."}, {"viet": "Chúng ăn rất nhanh và nhiều loài ăn cả những thứ mà chúng ta không muốn để cho chúng ăn.", "eng": "They are very big eaters, and many of them eat things that we are not willing to let them have."}, {"viet": "Họ nói rằng máy bay lạ đã bay vào không phận Trung Quốc mà không có sự cho phép.", "eng": "They claimed that foreign planes had entered Chinese airspace without permission."}, {"viet": "Họ không buộc phải hoàn thành công việc trước khi tôi đến.", "eng": "They don't have to have finished the work before I arrive."}, {"viet": "Họ đã bị trừng phạt đích đáng khi cuối cùng kế hoạch của họ bị bại lộ.", "eng": "They got their just deserts when the scheme was finally uncovered."}, {"viet": "Họ phải vâng lời, dù họ muốn hay không.", "eng": "They have to obey, whether they will or not."}, {"viet": "Họ trả cho chúng tôi một khoản tiền khá cho ngôi nhà.", "eng": "They made us a good offer for the house."}, {"viet": "Họ chơi khúc dạo đầu với một nhịp độ khá chậm.", "eng": "They played the overture at fairly slow tempo."}, {"viet": "Người ta nói rằng Hoàng Sơn nổi tiếng về bốn kỳ quan của nó.", "eng": "They say Huangshan is famous for its Four Wonders."}, {"viet": "Chúng đã đầu hàng mà không chống trả nhiều lắm.", "eng": "They surrendered without putting up much of a fight."}, {"viet": "Họ đã được các đảng viên giúp đỡ một cách thành công.", "eng": "They were ably supported by the Party members."}, {"viet": "Người ta có thể nhận ra họ do họ ăn mặc tồi tàn.", "eng": "They were recognizable by the poverty of their dress."}, {"viet": "Hãy nghĩ về hộp đêm, các ngôi sao, các cô gái đẹp.", "eng": "Think of the night clubs, the stars, the beautiful girl."}, {"viet": "Sáng nào kênh này cũng phát đi vào lúc 7 giờ.", "eng": "This channel comes on the air every morning at 7 am."}, {"viet": "Cái áo này đắt gấp đôi cái ấy.", "eng": "This dress is twice as expensive as that."}, {"viet": "Đây rõ ràng là một trường hợp nhầm lẫn nhân thân, thí dụ khi bắt nhằm một người không phải là thủ phạm.", "eng": "This is a clear case of mistaken identity."}, {"viet": "Đây là lời khen ngợi dành riêng cho ông ta sau khi chết.", "eng": "This is the praise allotted to him after death."}, {"viet": "Chỗ tiền này có thể góp vào số tiền anh đang tiết kiệm để mua một chiếc máy ảnh.", "eng": "This money can go towards the new camera you're saving up for."}, {"viet": "Vở kịch này thường vẫn được coi là của Shakespeare.", "eng": "This play is usually attributed to Shakespeare."}, {"viet": "Thứ xà phòng này giặt như có phép mầu-vết bẩn biến sạch cả.", "eng": "This soap works like magic-the stains just disappear."}, {"viet": "Đây là rạn nứt nghiêm trọng nhất trong hôn nhân của chúng tôi.", "eng": "This was the most profound breach in our mariage."}, {"viet": "Hàng ngàn người khách hàng hài lòng thì không thể lầm được, vậy tại sao các bạn không dùng thử loại bột giặt mới của chúng tôi?", "eng": "Thousands of satisfied customers can't be wrong, so why don't you try our new washing-powder?"}, {"viet": "Cà chua rẻ nhất khi chúng vào vụ.", "eng": "Tomatoes are cheapest when they are in season."}, {"viet": "Trừ phi đội Anh cải tiến lối chơi nếu không họ sẽ thua trận này.", "eng": "Unless England improve their game they're going to lose the match."}, {"viet": "Có quá nhiều nhiễu không nghe rõ được điện của họ.", "eng": "Was too much static to hear their message clearly."}, {"viet": "Chúng ta sẽ phải gọi ai đó đến sửa mái nhà.", "eng": "We'll have to get someone to do the roof."}, {"viet": "Chúng tôi đến đây để thảo luận việc Ann gia nhập câu lạc bộ.", "eng": "We're here to discuss Ann's joining the club."}, {"viet": "Chúng tôi được bảo phải tăng sản lượng của chúng tôi, nhưng nói thì dễ làm mới khó.", "eng": "We've been told to increase our output, but it easier said than done."}, {"viet": "Chúng tôi khắc khoải hàng giờ về việc nên giải quyết vấn đề nào trước.", "eng": "We agonized for hours about which problem to be solved first."}, {"viet": "Chúng tôi đang tìm các mặt hàng mà chúng tôi đã fax cho ông và sẽ rất biết ơn ông nếu ông có thể gửi mẫu các mặt hàng đó.", "eng": "We are looking for the items that we faxed to you and would be grateful if you could send samples of the same."}, {"viet": "Chúng tôi mua đô la ở chợ đen.", "eng": "We bought our dollars on the black market."}, {"viet": "Chúng ta có thể có chỗ ngồi cho mười người nếu chúng ta kê sát hai bàn lại với nhau.", "eng": "We can provide seats for ten people if we put these two tables end to end."}, {"viet": "Chúng tôi kinh doanh các mặt hàng da như găng tay, va-li và túi xách tay.", "eng": "We deal in leather goods, such as gloves, suitcases and handbags."}, {"viet": "Chúng tôi đã trải qua vài chuyến bay bị xáo động nhẹ trên Đại Tây Dương.", "eng": "We experienced some slight turbulence flying over the Atlantic."}, {"viet": "Chúng ta đã ăn đậu và sau đó là các món rau quả khác.", "eng": "We had beans and then a second vegetable."}, {"viet": "Chúng tôi có bia, rượu uýt-ki, rượu brandy và rượu vang.", "eng": "We have beer, whiskey, brandy and wine."}, {"viet": "Chúng tôi còn khuyết chân đánh máy.", "eng": "We have vacancies for typists."}, {"viet": "Chúng tôi đốt lửa lên và ngay sau đó thấy ấm áp dễ chịu.", "eng": "We lit the fire and were soon as warm as toast."}, {"viet": "Trong thời buổi khó khăn này chúng ta phải khoan thứ cho cô ta.", "eng": "We must bear with her during difficult period."}, {"viet": "Chúng ta cần phối hợp tuyệt diệu trong trận bóng.", "eng": "We need excellent coordination for ball games."}, {"viet": "Chúng ta hãy dùng món hầm cho bữa ăn tối.", "eng": "We're having stew for supper."}, {"viet": "Chúng tôi cần có thêm nhân viên cho văn phòng mới.", "eng": "We shall want more staff for the new office."}, {"viet": "Chúng tôi lái xe quanh Hollywood và ngắm nhà của các ngôi sao.", "eng": "We took a drive around the Hollywood and looked at the stars'homes."}, {"viet": "Chúng tôi đến Vương Phủ Tỉnh và kẻ nào đó đã lấy trộm túi xách của tôi ở đó.", "eng": "We went to Wangfujing and someone stole my handbag there."}, {"viet": "Chúng tôi chán ngấy cái cảnh bị xô lấn khắp nơi bởi các công chức sốt sắng.", "eng": "We were tired of being pushed around by officious civil servants."}, {"viet": "Dự báo thời tiết là một ngành khoa học không chính xác.", "eng": "Weather forecasting is an inexact science."}, {"viet": "À, tùy thuộc vào kích cỡ và vị trí của cái hộp.", "eng": "Well, it depends on the size and location of the box."}, {"viet": "Không phải bạn bị bệnh nằm liệt giường trong một thời gian dài sao?", "eng": "Weren't you sick in bed for a long time?"}, {"viet": "Nghị gì mà kì cục thế, chàng trai-tôi là một người phụ nữ có chồng đứng đắn.", "eng": "What an outrageous suggestion, young man-I'm a respectable married woman."}, {"viet": "Nước nào có tiếng là đi đầu về môi trường?", "eng": "What country is renowned for its environmental progress?"}, {"viet": "Bạn nghĩ xem hình thức tập luyện nào là khó nhất?", "eng": "What exercise do you think is the most difficult?"}, {"viet": "Tình trạng mới nhất giữa hai bên trong cuộc đàm phán giải trừ quân bị là thế nào?", "eng": "What is the latest state of play in the disarmament talks?"}, {"viet": "Ở nước bạn, bạn cần có loại bằng cấp gì để trở thành giáo viên?", "eng": "What kind of qualifications do you need to become a schoolteacher in your country?"}, {"viet": "Những gì cô ta nói nghe có vẻ thuyết phục đấy, nhưng tôi nghi rằng đó là nói dối.", "eng": "What she said sounded convincing, but I suspect it to be a lie."}, {"viet": "Điều anh nói có thể bị hiểu sai.", "eng": "What you say is open to misconstruction."}, {"viet": "Khi anh ta nhận ra lỗi lầm, anh ta rất hối hận.", "eng": "When he realized his mistake, he had to eat humble pie."}, {"viet": "Khi đồng tiền cố gắng để mua cái đẹp thì nó chỉ mua được.", "eng": "When money tries to buy beauty it tends to purchase a."}, {"viet": "Khi chúng gặp một vũng nước, chúng uống thật nhiều.", "eng": "When they come to a water hole, they drink a great deal."}, {"viet": "Anh trai bạn đang ở đâu?''Anh ấy đang ở Paris'.", "eng": "Where's your brother?''He's in Paris'."}, {"viet": "Có được hay không, tôi không thể nói được.", "eng": "Whether or not it is possible, I cannot say."}, {"viet": "Ông thích súp xào, nước dùng, hay súp thịt hầm?", "eng": "Which soup would you like, consommé or pottage?"}, {"viet": "Anh nghĩ là ai sẽ được nhiều phiếu nhất?", "eng": "Who do you think will get the most votes?"}, {"viet": "Tại sao anh lại bỏ qua cơ hội vào trường đại học?", "eng": "Why did you pass up the opportunity to go to university?"}, {"viet": "Sao hôm qua em nghỉ học vậy Paul?", "eng": "Why were you absent from class yesterday, Paul?"}, {"viet": "Anh có thể cho tôi vay ít tiền giúp tôi qua được vận khó đến khi tôi có được séc trả lương không?", "eng": "Will you lend me some money to tide me over until I get my pay cheque?"}, {"viet": "Với một cái nhún nhẹ nhàng con mèo đã phóc lên cành cây.", "eng": "With an easy spring the cat reached the branch."}, {"viet": "Tính toán tổng số tiền lời của một khoản nợ.", "eng": "Work out the grossed-up interest on a loan."}, {"viet": "Anh có muốn dùng chút cà phê không?'.", "eng": "Would you like some coffee?'."}, {"viet": "Xin các ông vui lòng tìm hiểu xem việc vận chuyển đã gặp vấn đề gì?", "eng": "Would you please find out what has happened to the shipment?"}, {"viet": "Vâng, được, tôi sẽ mời ông ấy lên.", "eng": "Yes, all right, I'll send him up."}, {"viet": "Phải, trên trời không có đám mây nào và ở nơi đây chúng ta có được một cảnh tuyệt đẹp.", "eng": "Yes, there aren't any clouds in the sky and we've got such a beautiful view here."}, {"viet": "Nếu tọng thức ăn như vậy anh sẽ bị nấc đấy.", "eng": "You'll get hiccups if you gobble your food like that."}, {"viet": "Anh bắt đầu làm việc này không đúng cách.", "eng": "You're not going about the job in the right way."}, {"viet": "Chắc chắn anh sẽ đỗ-anh đã học hành rất chăm chỉ mà.", "eng": "You are bound to pass the exams-you've worked very hard."}, {"viet": "Anh không thể thi đỗ mà không có sự chuẩn bị.", "eng": "You can't pass an exam without preparation."}, {"viet": "Bà có thể chuyển sang phòng 410.", "eng": "You can move to Room 410."}, {"viet": "Anh không làm tôi bối rối chút nào.", "eng": "You didn't embarrass me in the slightest."}, {"viet": "Anh đã không làm một cách nghiêm chỉnh điều mà người ta đã chờ đợi ở anh.", "eng": "You have signally failed to do what was expected of you."}, {"viet": "Trông anh có vẻ khá mệt mỏi phờ phạc, tại sao anh không đi nghỉ?", "eng": "You look pretty run-down, why don't you take a holiday?"}, {"viet": "Chắc hẳn ông đã gọi nhầm số.", "eng": "You must have the wrong number."}, {"viet": "Anh nên đi chơi ( ra khỏi nhà ) nhiều hơn.", "eng": "You ought to get out ( of the house ) more."}, {"viet": "Ông nên thanh toán đủ tiền để mua ngân phiếu du lịch.", "eng": "You should pay money in full for the purchase of traveller's cheques."}, {"viet": "Ông muốn nói chuyện về ông cố Jack, chứ không phải là cô dâu, phải vậy không?", "eng": "You want to talk about great-grandpa Jack, not the bride, don't you?"}, {"viet": "Những đôi tình nhân sờ nắn nhau ở sau xe.", "eng": "Young couples are groping in the back of cars."}, {"viet": "Mẹ cậu sẽ rất bực mình nếu bà phát hiện được điều cậu đã làm!", "eng": "Your mum will go spare if she finds out what you've done!"}]