[{"viet": "Xe đạp di chuyển thường tiện hơn xe ô tô rất nhiều trong những thành phố tấp nập.", "eng": "A bicycle's often far more convenient than a car in busy cities."}, {"viet": "Một chương trong đó cô ấy bàn dài dòng về những lợi ích của việc ăn chay.", "eng": "A chapter in which she dilates on the benefits of vegetarianism."}, {"viet": "Một mạng lưới phức tạp gồm những phần có liên hệ chặt chẽ với nhau.", "eng": "A complex network of interrelated parts."}, {"viet": "Một người cuốn thuốc lá cừ khôi.", "eng": "A dab hand at rolling cigarettes."}, {"viet": "Một bản báo cáo gồm những tài liệu về cuộc chiến tranh Việt Nam.", "eng": "A documentary account of the Vietnam war."}, {"viet": "Một vài đứa trẻ lẽo đẽo theo sau bố mẹ mình.", "eng": "A few young children straggling along behind their parents."}, {"viet": "Gà đông lạnh phải để cho tan hết đá rồi mới nấu.", "eng": "A frozen chicken should be allowed to defrost completely before cooking."}, {"viet": "Một chính phủ không cho phép sự đối lập.", "eng": "A government which refuses to tolerate opposition."}, {"viet": "Hàm lượng cholesteron cao trong máu có thể gây ra bệnh tim.", "eng": "A high cholesterol level in the blood can cause heart disease."}, {"viet": "Một lời bông đùa không phù hợp với cuộc nói chuyện lịch sự.", "eng": "A joke that was incongruous with polite conversation."}, {"viet": "Người ít quan trọng luôn luôn được giới thiệu với người quan trọng hơn.", "eng": "A less important person is always introduced to a more important person."}, {"viet": "Một câu chuyện tình đầy tình cảm chán ngấy.", "eng": "A love story full of cloying sentiment."}, {"viet": "Một cuộc họp nổi bật lên tính cách vui vẻ và thân thiện.", "eng": "A meeting marked by good humour and friendliness."}, {"viet": "Một doi đất hẹp vươn ra biển.", "eng": "A narrow tongue of land jutting out into the sea."}, {"viet": "Một y tá lo cho nhu cầu của anh ta.", "eng": "A nurse attends to his needs."}, {"viet": "Một người thường muốn chia sẻ ý tưởng với một người khác.", "eng": "A person often wishes to share an idea with someone else."}, {"viet": "Một nhà chính trị dày dạn nhờ qua sáu cuộc vận động tranh cử.", "eng": "A politician seasoned by six election campaigns."}, {"viet": "Một sự trì trệ bực mình tại sân bay.", "eng": "A provoking delay at the airport."}, {"viet": "Một mô hình ngôi nhà trong hang động thời kỳ đồ sắt.", "eng": "A restoration of an Iron Age cave dwelling."}, {"viet": "Một học giả có kiến thức cao nhất.", "eng": "A scholar of the highest attainments."}, {"viet": "Một người đàn ông lùn có vóc dáng một tay bơi.", "eng": "A short man with the physique of a swimmer."}, {"viet": "Một bộ quân phục chỉ cho mọi người biết anh ta là một người lính.", "eng": "A soldier's uniform tell everyone that he is a soldier."}, {"viet": "Một câu chuyện ăn sâu vào thực tế.", "eng": "A story firmly rooted in reality."}, {"viet": "Một nỗ lực thiếu cương quyết để cải tổ hệ thống đó.", "eng": "A tame attempt to reform the system."}, {"viet": "Một cảm giác khỏe khoắn nhất thời.", "eng": "A transitory feeling of well-being."}, {"viet": "Một chiếc tàu chiến được cung cấp những sĩ quan có kinh nghiệm.", "eng": "A warship manned by experienced officers."}, {"viet": "Một nhà văn trẻ người trong thời gian gần đây đã trở nên nổi tiếng.", "eng": "A young writer who has recently come into prominence."}, {"viet": "Thực ra, ở Nhật, người ta cũng nêu ra vấn đề tương tự như vậy.", "eng": "Actually, something of the same question was raise in Japan."}, {"viet": "Sau một tuần, tôi đã chán ăn cá.", "eng": "After a week I tired of eating fish."}, {"viet": "Sau bàn thắng thứ năm của chúng tôi trận đấu đó đã trở thành một cuộc đại bại.", "eng": "After our fifth goal the match became a rout."}, {"viet": "Sau nhiều tuần lễ ngấm ngầm thù oán nhau, cuối cùng họ đã tranh cãi cho ra lẽ.", "eng": "After weeks of silent hostility, they've at last had it out with each other."}, {"viet": "Tất cả sự hậu thuẫn cho ông ta biến mất khi ông ta thực sự cần đến nó.", "eng": "All his support melted away when he really needed it."}, {"viet": "Đèn đường đã tắt hết cả.", "eng": "All the lights were out in the streets."}, {"viet": "Mặc dù cô ta về hạng nhì nhưng thời gian của họ chỉ cách nhau có một phần mười giây.", "eng": "Although she came second their times were only a tenth of a second apart."}, {"viet": "Một địa chỉ được in nổi trên giấy viết thư.", "eng": "An address embossed on the notepaper."}, {"viet": "Một câu hỏi hóc búa làm ông bộ trưởng hết chống đỡ nổi.", "eng": "An awkward question which penetrated the minister's guard."}, {"viet": "Một giọng nói đầy quyền uy khiến mọi người phải tuân theo.", "eng": "An imperative tone of voice that had to be obeyed."}, {"viet": "Một sự chỉ trích dữ dội về chính sách nhà đất của chính phủ.", "eng": "An onslaught on government housing policies."}, {"viet": "Ở đó có rất ít mưa.", "eng": "And it gets little rain."}, {"viet": "Lại một ngày mưa nữa, anh ấy nói với giọng buồn bã.", "eng": "Another rainy day, he remarked glumly."}, {"viet": "Các nhà khảo cổ đã lần ra dấu vết của nhiều con đường thời La Mã ở Anh.", "eng": "Archaeologists have traced many Roman roads in Britain."}, {"viet": "Bạn sắp đi dạo chơi phải không?", "eng": "Are you coming out for a walk?"}, {"viet": "Anh sẽ lại lang thang đi nghỉ nữa à?", "eng": "Are you swanning off on holiday again?"}, {"viet": "Là một thanh niên, anh ấy tỏ ra ít có triển vọng.", "eng": "As a youth he showed little promise."}, {"viet": "Khi câu chuyện, cảnh tượng, cuộc điều tra tự nó bộc lộ.", "eng": "As the story, scene, enquiry unfolds itself."}, {"viet": "Ngay lúc cô ta đến, lũ trẻ đã bỏ chạy mất.", "eng": "At her approach the children ran off."}, {"viet": "Những nỗ lực để chiếm lấy số phiếu của thanh thiếu niên.", "eng": "Attempts to win the teenage vote."}, {"viet": "Làm ơn gởi cho tôi cái thư này.", "eng": "Be a pet and post this letter for me."}, {"viet": "Im lặng và tiếp tục làm việc của anh đi.", "eng": "Be quiet and get on with your work."}, {"viet": "Bắt đầu tóm tắt bằng chứng đã được trình bày.", "eng": "Begin a summation of the evidence presented."}, {"viet": "Những con chim làm tổ trên các cành ở ngọn cây.", "eng": "Birds nesting in the tree-tops."}, {"viet": "Bữa ăn sáng được phục vụ từ 7 giờ đến 11 giờ, bữa ăn trưa từ 12 giờ đến 3 giờ, và bữa ăn tối từ 6 giờ đến 9 giờ.", "eng": "Breakfast is served from 7 to 11, lunch from 12 to 3, and dinner from 6 to."}, {"viet": "Phà lửa cho tróc sơn cũ trước khi sơn lại cửa.", "eng": "Burn the old paint off before repainting the door."}, {"viet": "Nhưng hiện giờ là mùa mưa, vì thế ngay cả khi anh giặt thì nó cũng sẽ không khô.", "eng": "But it's the rainy season so even if I do the laundry, it won't dry."}, {"viet": "Mua átpirin tại tiệm thuốc ở góc đường.", "eng": "Buy aspirin at the chemist's on the corner."}, {"viet": "Vào lúc này thế lực chính trị của ông ta đang suy giảm dần.", "eng": "By this time his political influence was on the wane."}, {"viet": "Tôi có thể đặt chỗ trước bằng điện thoại không?", "eng": "Can I make reservations by telephone?"}, {"viet": "Anh có thể khám phá những điều này không?", "eng": "Can you find out these things?"}, {"viet": "Bạn có thể chỉ cho tôi cách chơi không?", "eng": "Can you show me how to play?"}, {"viet": "Nghề thợ mộc, sửa chữa ô tô, kim loại in ấn, viết dự thảo.", "eng": "Carpentry, auto shop, metal shop, printing, drafting."}, {"viet": "Ấp ủ hy vọng đoạt huy chương Thế vận hội Olympic.", "eng": "Cherish the hope of winning an Olympic medal."}, {"viet": "Đòi hỏi quyền bất khả xâm phạm về ngoại giao yêu cầu luật pháp bảo vệ.", "eng": "Claim diplomatic immunity, the protection of the law."}, {"viet": "Này, khai ra đi: ai đã làm chuyện đó?", "eng": "Come on, cough up: who did it?"}, {"viet": "Đã xác định khả năng tưởng tượng của tôi về Hollywood như là một nơi vừa hấp dẫn vừa trác táng.", "eng": "Confirmed my fantasy of Hollywood as both Oz and Gomorrah."}, {"viet": "Vui lòng cho tôi biết tôi có phải chuyển xe không?", "eng": "Could I have a transfer, please?"}, {"viet": "Cô có thể cho tôi xem một đôi khác màu đen không?", "eng": "Could you show me another pair in black?"}, {"viet": "Các tấm màn cửa phải được kéo xuống trong suốt thời gian tắt đèn.", "eng": "Curtains must be drawn during the black-out."}, {"viet": "Khi người ta cần giúp đỡ, việc làm thiết thực hơn là lời nói.", "eng": "Deeds are better than words when people need help."}, {"viet": "Mặc dù phe đối lập mạnh, đảng cầm quyền đã thắng.", "eng": "Despite strong opposition, the ruling party carried the day."}, {"viet": "Ông đã gặp khó khăn khi liên lạc với tôi à?", "eng": "Did you have trouble in reaching me?"}, {"viet": "Bệnh tật và nghèo đói thường đi chung với nhau.", "eng": "Disease and poverty often go together."}, {"viet": "Làm điều gì hoàn toàn chỉ vì tư lợi.", "eng": "Do something purely out of self-interest."}, {"viet": "Có bao giờ anh thấy được những vết đốm trước mắt mình không?", "eng": "Do you ever see floating specks in front of your eyes?"}, {"viet": "Bạn có tin là cảnh sát ngăn chặn được tôi phạm không?", "eng": "Do you have faith in the police to stop crimes?"}, {"viet": "Anh có thích cưỡi ngựa không?", "eng": "Do you like to ride horseback?"}, {"viet": "Bạn có đi xe lửa mỗi ngày không?", "eng": "Do you take the train every day?"}, {"viet": "Bạn có muốn xem tập ảnh của tôi không?", "eng": "Do you want to see my photo album?"}, {"viet": "Không được phép dẫn chó trong tòa nhà.", "eng": "Dogs are not permitted in the building."}, {"viet": "Đừng quấy rầy mẹ anh trong khi bà ấy đang chuẩn bị bữa cơm chiều.", "eng": "Don't disturb your mother while she's getting the dinner."}, {"viet": "Đừng có nương tay với bọn tội phạm này.", "eng": "Don't let these criminals off lightly."}, {"viet": "Đừng chụp nguyên mặt cô ta như tấm ảnh của hộ chiếu.", "eng": "Don't take her full face like a passport photo."}, {"viet": "Nói nước đôi để tránh khỏi phiền phức cho ai.", "eng": "Double-talk one's way out of trouble."}, {"viet": "Ban ngày tôi cứ ngủ gà ngủ gật.", "eng": "During the day, I have trouble staying awake."}, {"viet": "Bắt tay vào một chương trình hiện đại hóa quan trọng.", "eng": "Embark on a major modernization programme."}, {"viet": "Dù chỉ là một thanh niên hắn đã dấn sâu vào tội ác.", "eng": "Even as a young man he was up to his neck in crime."}, {"viet": "Mọi việc đang xúc tiến theo chương trình.", "eng": "Everything is going according to schedule."}, {"viet": "Kinh phí cho dự án đã suy giảm như sau: lương 10 triệu bảng, cây trồng 4 triệu bảng, vật liệu thô 5 triệu bảng.", "eng": "Expenditure on the project break down as follows: wages £ 10m, plant £ 4m, raw materials £ 5m."}, {"viet": "Nặn cục đất sét thành cái bát.", "eng": "Fashion a lump of clay into a bowl."}, {"viet": "Điền vào một biểu mẫu bằng chữ in hoa.", "eng": "Fill in a form in block letters."}, {"viet": "Năm công nhân cản đường đã bị thương trong cuộc ẩu đả.", "eng": "Five pickets were injured the scuffle."}, {"viet": "Cho dù ông ta giàu có và danh tiếng, ông ta vẫn là một người đàn ông rất cô đơn.", "eng": "For all his wealth and fame, he's very lonely man."}, {"viet": "Bốn giờ vừa điểm trên đồng hồ nhà thờ.", "eng": "Four o'clock had just struck on the church clock."}, {"viet": "Những ý tưởng của Galileo đã đi trước xa thời đại mà ông sống.", "eng": "Galileo's ideas were well in advance of the age in which he lived."}, {"viet": "Những triệu chứng khó chịu trong quá trình cai nghiện sau khi bỏ hút thuốc lá.", "eng": "Get withdrawal symptoms after giving up smoking."}, {"viet": "Bóp ống kem đánh răng một cái.", "eng": "Give the tube of toothpaste a squeeze."}, {"viet": "Chào cô, tôi vừa đăng kí nhận phòng.", "eng": "Good evening, I've just checked in."}, {"viet": "Đã phải ngăn chặn một kế hoạch dở.", "eng": "Had to put the kibosh on poorly conceived plan."}, {"viet": "Chính quyền đã được báo về chuyện này chưa?", "eng": "Have the authorities been notified of this?"}, {"viet": "Bạn gặp các cụ thân sinh của tôi bao giờ chưa?", "eng": "Have you ever met my folks?"}, {"viet": "Con có nói cám ơn với Bà Brown về bữa tiệc chưa?", "eng": "Have you said your thank-you to Mrs. Brown for the party?"}, {"viet": "Nó hơi trưởng giả học làm sang, không bao giờ nói chuyện với hạng người như tôi.", "eng": "He's a bit of a snob-won't speak to the likes of me."}, {"viet": "Từ khi ốm, anh ta ăn thấy kém ngon.", "eng": "He's been a bit off oats since his illness."}, {"viet": "Nó giấu tiền dành dụm được trong cả đời mình vào một cái vali cũ.", "eng": "He's got his life savings stashed in an old suitcase."}, {"viet": "Ông ta sẵn sàng trả chiếc ôtô này 2500 pao nhưng tôi không nghĩ là ông ta sẽ trả cao hơn.", "eng": "He's prepared to pay 2500 pounds for the car but I don't think he'll go any higher."}, {"viet": "Chúng tôi gọi ông ta là một người nghiện rượu còn biết kiềm chế.", "eng": "He's what we call a controlled alcoholic."}, {"viet": "Ông ta đã đến như thể ứng với lời cầu của cô ấy.", "eng": "He arrived as if in answer to her prayers."}, {"viet": "Anh ấy can đảm kiềm giữ những giọt nước mắt.", "eng": "He bravely held back his tears."}, {"viet": "Hắn cố tìm một cách tuyệt vọng điều gì đó để nói.", "eng": "He cast about desperately for something to say."}, {"viet": "Anh ta không thể diễn đạt tình cảm của mình thành lời.", "eng": "He couldn't put his feelings into words."}, {"viet": "Ông ấy không thích thành phố.", "eng": "He didn't like the city."}, {"viet": "Anh ta kiếm được có 8000 bảng Anh một năm trong khi đó cô ta kiếm ít nhất là 20000 bảng Anh.", "eng": "He earns £ 8000 a year whereas she gets at least £ 20000."}, {"viet": "Nó chợt cảm thấy không cưỡng được muốn nhảy cẫng lên.", "eng": "He felt an irresistible impulse to jump."}, {"viet": "Hắn liếc nhìn cô ta khả ố, và cô ta đỏ mặt lên.", "eng": "He gave her a suggestive glance, and she blushed."}, {"viet": "Hắn lãnh án mười năm tù vì tội cướp có vũ khí.", "eng": "He got ten years for armed robbery."}, {"viet": "Nó trơ tráo nói là tôi nói dối.", "eng": "He had the effrontery to say I was lying."}, {"viet": "Anh ấy có mức thu nhập đến 6 con số.", "eng": "He has an income of six figures."}, {"viet": "Anh ấy có hiểu biết đôi chút về Nhật ngữ.", "eng": "He has some little acquaintance with the Japanese language."}, {"viet": "Ông ta ra hiệu rẽ phải, thế mà lại rẽ trái!", "eng": "He indicated that he was turning right, but then he turned left!"}, {"viet": "Ông ấy là một bằng chứng sống về những điều kỳ diệu của y học hiện đại.", "eng": "He is living proof of the wonders of modern medicine."}, {"viet": "Anh ta ít khi có mặt trong văn phòng.", "eng": "He isn't in the office very much."}, {"viet": "Ông ta bỏ vợ để theo một cô học trò của mình.", "eng": "He left his wife for one of his students."}, {"viet": "Nó trông có vẻ khả nghi đấy-anh có nghĩ là hắn dò xét xem tụi mình đang manh nha cái gì không?", "eng": "He looks suspicious-do you think he's rumbled what we're up to?"}, {"viet": "Ông ta có thể đến đây kịp giờ, nhưng tôi không dám chắc.", "eng": "He might get here in time, but I can't be sure."}, {"viet": "Anh ta xô mạnh cửa một cái cho cô ấy vào.", "eng": "He opened the door for her with a flourish."}, {"viet": "Anh ta tự rót uýt-xki cho mình khoảng hai ngón tay.", "eng": "He poured himself two fingers of whisky."}, {"viet": "Ông ta tăng giá để bù vào chi phí vật liệu đã tăng lên.", "eng": "He put up his prices to offset the increased cost of materials."}, {"viet": "Nó từ chối đi vào chi tiết kế hoạch của nó.", "eng": "He refused to go into details about his plans."}, {"viet": "Ông ấy là giám đốc ngân hàng hay là gì đó.", "eng": "He's a bank manager or something."}, {"viet": "Ông ta đã chết và đã được chôn cất lâu lắm rồi!", "eng": "He's been dead and buried for years!"}, {"viet": "Anh ta là người chúng ta cần cho công việc ấy.", "eng": "He's just the person we need for the job."}, {"viet": "Anh ấy là nòng cốt của toàn đội.", "eng": "He's the kingpin of the whole team."}, {"viet": "Ông ta đã thấy nhiều chuyện lạ trong khi đi dạo quanh quẩn trong cổ thành.", "eng": "He saw many strange things during his perambulations in the old city."}, {"viet": "Ông ta chuyển gánh nặng từ vai trái sang vai phải.", "eng": "He shifted the load from his left to his right shoulder."}, {"viet": "Hắn chộp lấy khẩu súng của mình và bắn.", "eng": "He snatched up his gun and fired."}, {"viet": "Ông ta bắt đầu uống nhiều rượu khi vợ ông ta bỏ đi.", "eng": "He started tippling when his wife left him."}, {"viet": "Ông ta bị một cơn đau tim nặng.", "eng": "He suffered a massive heart attack."}, {"viet": "Anh ta doạ đá đít tôi hay đại khái là như thế nếu tôi không đi ngay.", "eng": "He threatened to kick me in the arse-hole or something like that, if I didn't t leave at once."}, {"viet": "Anh ta đụng nhẹ tôi vào cánh tay.", "eng": "He touched me on the arm."}, {"viet": "Làm công việc này, ông ta trả công tôi quá thấp ( khoảng 10 pao ).", "eng": "He underpaid me for the work ( by 10 pounds )."}, {"viet": "Càng về cuối bài diễn văn anh ta càng hăng lên.", "eng": "He warmed up as he went on with his speech."}, {"viet": "Ông ta rất đau lòng vì con trai chết.", "eng": "He was badly cut up by the death of his son."}, {"viet": "Ông ta có dính líu sâu trong âm mưu đó.", "eng": "He was deeply implicated in the plot."}, {"viet": "Ông được mọi người vô cùng ngưỡng mộ.", "eng": "He was greatly loved."}, {"viet": "Nó được đặt biệt danh Người Lùn vì nó cao quá!", "eng": "He was nicknamed Shorty because he was so tall!"}, {"viet": "Anh ta được đưa ngay tới bệnh viện nhưng đã chết khi đến nơi.", "eng": "He was rushed to hospital but was dead on arrival."}, {"viet": "Nó là nguyên nhân vô tình của tất cả sự hiểu lầm này.", "eng": "He was the unknowing cause of all the misunderstanding."}, {"viet": "Ông ta không nghe lời khuyên của các đồng nghiệp và xin từ chức.", "eng": "He went against the advice of his colleagues and resigned."}, {"viet": "Anh ta ăn ngấu nghiến bữa sáng rồi vội đi ra ngoài.", "eng": "He wolfed down his breakfast and rushed out."}, {"viet": "Những kẻ điên rồ lái xe 90 dặm giờ trong sương mù.", "eng": "Headbangers who drive at 90 miles an hour in the fog."}, {"viet": "Sự yêu mến của cô ta đối với nó là sâu sắc, bền chặt.", "eng": "Her affection for him is deeply rooted."}, {"viet": "Đứa con của bà ta là một gánh nặng đối với các thầy giáo của nó.", "eng": "Her child is a trial to his teachers."}, {"viet": "Những kẻ thù của bà ta đang âm mưu hạ bệ bà.", "eng": "Her enemies are scheming her downfall."}, {"viet": "Tóc nàng xõa xuống bờ vai.", "eng": "Her hair flowed down over her shoulders."}, {"viet": "Những chuyện đùa của cô ta làm tất cả chúng tôi cười.", "eng": "Her jokes made us all laugh."}, {"viet": "Tính vui vẻ tự nhiên của cô ta giúp cô ta vượt qua cơn khủng hoảng.", "eng": "Her natural resilience helped her overcome the crisis."}, {"viet": "Sự quan tâm chủ yếu của bà ta là bảo vệ tài sản.", "eng": "Her prime concern is to protect the property."}, {"viet": "Bức thư của con trai bà đã xua tan tất cả nỗi sợ hãi và lo lắng của bà.", "eng": "Her son's letter dissipated all her fears and anxiety."}, {"viet": "Tiếng nói cô ta thực sự tác động đến tôi.", "eng": "Her voice really does something to me."}, {"viet": "Tiền của ông đây và thêm hộ chiếu và bản ghi nhớ đổi tiền nữa.", "eng": "Here you are and also your passport and the exchange memo."}, {"viet": "Những lí lẽ của anh ta có một nền tảng kinh tế học hợp lí.", "eng": "His arguments has a sound economic base."}, {"viet": "Sự cẩu thả của hắn đã làm hắn mất việc.", "eng": "His carelessness lost him the job."}, {"viet": "Thất bại của anh ta chấm dứt sự thống trị của Mỹ trong môn thể thao này.", "eng": "His defeat ended American domination of the sport."}, {"viet": "Mặt anh ta nghiêm khắc và không muốn tha thứ.", "eng": "His face was hard and unforgiving."}, {"viet": "Vai Hamlet của anh ta là một sự phát hiện đối với các nhà phê bình.", "eng": "His Hamlet was a revelation to the critics."}, {"viet": "Nó biết tiếng Pháp cũng khá nhưng cần phải giỏi hơn nữa.", "eng": "His knowledge of French is fair, but ought to be better."}, {"viet": "Mẹ anh ta là người gây cho anh ta rất nhiều đau khổ.", "eng": "His mother is a sore trial to him."}, {"viet": "Tính kiên trì của anh ấy đã được đền đáp khi cuối cùng họ chấp thuận tiếp tục các cuộc tranh luận.", "eng": "His persistence was rewarded when they finally agreed to resume discussions."}, {"viet": "Việc từ chức của ông ta và sự náo động trong công luận tiếp sau đó.", "eng": "His resignation and the consequent public uproar."}, {"viet": "Sức lực của anh ta đã giảm sút theo năm tháng.", "eng": "His strength has diminished over the years."}, {"viet": "Giọng hắn làm chói tai tôi.", "eng": "His voice grates on my ears."}, {"viet": "Cầm cái chai và kéo cái nút ra bằng tay kia.", "eng": "Hold the bottle and pull the cork out with the other hand."}, {"viet": "Giá nhà hình như đã tới một giai đoạn ổn định nhưng chúng có thể lại sắp bắt đầu tăng nữa.", "eng": "House prices seem to have reached a plateau, but they may start raising again soon."}, {"viet": "Làm sao anh có thể tiếp tục làm việc với những tiếng ồn ào không ngớt đó?", "eng": "How can you continue to work with all that noise going on?"}, {"viet": "Chúng ta làm thế nào để ngăn chặn những hỏng hóc liên tục như thế này?", "eng": "How do we prevent these continual breakdowns?"}, {"viet": "Ông định ở lại đây bao lâu?", "eng": "How long are you going to stay here?"}, {"viet": "Đi thuyền từ Hull đến Oslo mất mấy ngày?", "eng": "How many days'sail is it from Hull to Oslo?"}, {"viet": "Cái túi đó giá bao nhiêu-Giá năm pao.", "eng": "How much did that bag cost-It costed five pounds."}, {"viet": "Đứa bé lên mấy thì bắt đầu đi được?", "eng": "How old was the baby when she started to walk?"}, {"viet": "Đi săn, bắn súng và những hoạt động tương tự.", "eng": "Hunting and shooting and kindred activities."}, {"viet": "Tôi muốn thực hiện một cuộc gọi tìm người cho ông Giang.", "eng": "I'd like to make a person-to-person call to Mr. Jiang."}, {"viet": "Tôi sẽ sớm tới gặp anh','Đó có phải là một lời hứa không?'.", "eng": "I'll come and see you soon.''Is that a promise?'."}, {"viet": "Tôi sẽ cho anh mượn cái đó với điều kiện là anh cho tôi mượn lại xe đạp.", "eng": "I'll let you borrow it on one condition you lend me your bicycle in return."}, {"viet": "Tôi hơi điếc, xin vui lòng phát âm rõ từng lời của bạn một cách cẩn thận.", "eng": "I'm a little deaf-please articulate your words carefully."}, {"viet": "Tôi nhất quyết ra đi và không gì ngăn được tôi.", "eng": "I'm determined to go and nothing will stop me."}, {"viet": "Tôi giỏi về môn sử nhưng về môn số học thì không cừ mấy.", "eng": "I'm good at history but not so hot at arithmetic."}, {"viet": "Tôi sẽ không phí thêm một lời nào nữa về vấn đề đó.", "eng": "I'm not going to waste any more word on the subject."}, {"viet": "Tôi rất tiếc, ở đây không có ai có tên đó cả.", "eng": "I'm sorry, but there's no one here by that name."}, {"viet": "Chiều nay tôi sẽ đưa các con đi vườn thú.", "eng": "I'm taking the kids to the zoo this afternoon."}, {"viet": "Tôi thu xếp một ta xi đón chúng tôi lúc 7g15.", "eng": "I've arranged for a taxi to pick us up at 7, 15."}, {"viet": "Tôi đã điền sai vào mẫu đơn này, cho tôi tờ khác được không?", "eng": "I've filled in this form incorrectly, can I have another blank?"}, {"viet": "Tôi biết anh ta từ khi anh ta tóc còn để chỏm.", "eng": "I've known him since he was in short pants."}, {"viet": "Tôi đã nói với anh tình hình là như vậy, anh phải hành động sao cho phù hợp.", "eng": "I've told you what the situation is, you must act accordingly."}, {"viet": "Tôi luôn luôn giữ đúng hẹn, nhưng nhiều người không bao giờ có mặt như đã hẹn.", "eng": "I always keep my appointments, but many people never show up for theirs."}, {"viet": "Tôi bối rối không hiểu tại sao cậu ta không trả lời thư của tôi.", "eng": "I am puzzled by his failure to reply to my letter."}, {"viet": "Tôi cam đoan với ông là họ sẽ đến ngay.", "eng": "I assure you they will come soon."}, {"viet": "Tôi ghé thăm bạn nhưng bạn đi vắng.", "eng": "I called at your house but you'd already left."}, {"viet": "Tôi không thể nào chịu thêm được nữa, tôi phải tìm nhà vệ sinh thôi.", "eng": "I can't hold out much longer, I must find a toilet."}, {"viet": "Tôi có thể làm chứng sự thật tuyệt đối trong lời khai của anh ta.", "eng": "I can attest to the absolute truth of his statement."}, {"viet": "Tôi không thể tha thứ cho mình vì đã không gặp mặt mẹ tôi trước khi bà qua đời.", "eng": "I cannot forgive myself for not seeing my mother before she died."}, {"viet": "Tôi đã làm thủ tục nhận phòng cách đây 5 phút, và tôi phát hiện thiếu mất một kiện hành lý.", "eng": "I checked into my room 5 minutes ago and found one piece of my luggage is missing."}, {"viet": "Tôi không thể cho chiếc xe ô-tô nổ máy được.", "eng": "I couldn't get the car start."}, {"viet": "Tôi cân nhắc một hồi lâu và rồi quyết định không đi.", "eng": "I debated it for a while."}, {"viet": "Tôi chẳng muốn điều đó xảy ra.", "eng": "I didn't want that to happen."}, {"viet": "Tôi không biết chính xác vì sao cô ấy mất việc.", "eng": "I don't know precisely why she lost her job."}, {"viet": "Tôi nghĩ anh ta chưa tìm được một công việc nào như ý trong cuộc sống.", "eng": "I don't think he's yet found his niche in life."}, {"viet": "Tôi không muốn nghe có vẻ tự cao tự đại, nhưng tôi nghĩ cuốn sách mới của tôi có thể là cuốn bán chạy nhất.", "eng": "I don't want to sound conceited, but I think my new book might be a best seller."}, {"viet": "Con không hiểu bài tập toán về nhà.", "eng": "I don't understand my math homework."}, {"viet": "Bố thấy dễ chịu hơn khi mọi thứ đều sạch sẽ.", "eng": "I feel better when things are clean."}, {"viet": "Tôi thấy dậy sớm rất khó.", "eng": "I find getting up early a great trouble."}, {"viet": "Tôi thôi việc vì nó không có triển vọng.", "eng": "I gave up my job because there was no future in it."}, {"viet": "Tôi chắc rằng anh cảm thấy mệt mỏi sau chuyến đi.", "eng": "I guess you're feeling tired after your journey."}, {"viet": "Tôi phải trông nom con mèo của hàng xóm trong khi họ đi nghỉ.", "eng": "I had to babysit for our neighbour's cat while they were on vacation."}, {"viet": "Tôi bị vướng rách một lỗ ở cái quần nịt tốt nhất của tôi.", "eng": "I have a snag in my best black tights."}, {"viet": "Tôi không hiểu hắn ta ba hoa liến thoắng cái gì vậy.", "eng": "I have no idea what he was babbling on about."}, {"viet": "Tôi phải đánh máy thư từ và trả lời điện thoại.", "eng": "I have to type letters and answer the phone."}, {"viet": "Tôi nghe nói nhiều người trong các bạn đến quán rượu bằng xe hơi.", "eng": "I hear many of you go to bars by car."}, {"viet": "Tôi hy vọng rằng đây chẳng phải là lợi dụng lòng hiếu khách của anh, nhưng tôi có thể ở lại dùng bữa cơm được chăng?", "eng": "I hope it's not imposing on your hospitality, but could I stay to dinner?"}, {"viet": "Tôi mời bà ta vì sợ bà ta mếch lòng.", "eng": "I invited her because I was afraid of giving umbrage."}, {"viet": "Tôi đã trông thấy bà Hill nhưng chúng tôi chưa bao giờ làm quen nhau.", "eng": "I know Mrs Hill by sight, but we've never met."}, {"viet": "Tôi thích dạo chơi ở vùng quê.", "eng": "I like rambling around in the country."}, {"viet": "Tôi sẽ gọi lại cho ông sau.", "eng": "I'll call you again later."}, {"viet": "Tôi sẽ xem xem tôi có thể giúp được gì.", "eng": "I'll see what I can do to help."}, {"viet": "Tôi e rằng cậu đã bị lừa.", "eng": "I'm afraid you've been had."}, {"viet": "Không ai đồng ý với tôi.", "eng": "I'm in a minority of one."}, {"viet": "Tôi rất tiếc, anh ấy ra ngoài đi dạo rồi.", "eng": "I'm sorry, he went out for a walk."}, {"viet": "Tôi đã điều khiển lại được chiếc xe ô tô sau khi nó trượt.", "eng": "I managed to right the car after it skidded."}, {"viet": "Tôi phải giúp đỡ họ-họ là máu mủ ruột rà của tôi.", "eng": "I must help them-They're my own flesh and blood."}, {"viet": "Tôi chưa bao giờ đi xe đạp lên quả đồi này-nó dốc quá.", "eng": "I never cycle up that hill-it's too steep."}, {"viet": "Tôi vô cùng biết ơn vợ con tôi.", "eng": "I owe a lot to my wife and children."}, {"viet": "Tôi hoàn toàn hiểu rằng anh cần một sự thay đổi.", "eng": "I quite understand that you need a change."}, {"viet": "Tôi không chịu để các nhà quảng cáo ép mua món hàng tôi không cần.", "eng": "I refuse to be brainwashed by advertisers into buying something I don't need."}, {"viet": "Tôi thấy cô ấy ra khỏi phòng của anh ta với một vẻ tội lỗi trên nét mặt Thôi nói đủ rồi đấy.", "eng": "I saw her coming out of his room with a guilty look on her face Enough said."}, {"viet": "Tôi sẽ hoàn thành báo cáo của tôi vào thứ sáu.", "eng": "I shall have completed my report by Friday."}, {"viet": "Rất tiếc chúng tôi không có các chuyến tham quan bảo tàng có hướng dẫn viên.", "eng": "I sorry, we don't have guided tours of the museum."}, {"viet": "Tôi thề sẽ không nói với ai điều bí mật của anh.", "eng": "I swear I won't tell anyone your secret."}, {"viet": "Tôi nghĩ tôi bị bệnh cúm.", "eng": "I think I've come down with the flu."}, {"viet": "Tôi nghĩ chúng ta nên đi khỏi đây.", "eng": "I think we should be toddling off."}, {"viet": "Tôi đi đường tắt qua cánh đồng để đến trường.", "eng": "I took a short cut across the field to get to school."}, {"viet": "Tôi hiểu ông đang rất bận.", "eng": "I understand you are very busy."}, {"viet": "Tôi chỉ muốn điều tốt lành nhất cho các con tôi.", "eng": "I want nothing but the best for my children."}, {"viet": "Tôi muốn viết về máy bay và máy bay trực thăng, và nhân viên.", "eng": "I want to write about the planes and helicopters, and the men."}, {"viet": "Tôi bị đuổi khỏi câu lạc bộ.", "eng": "I was driven out of the club."}, {"viet": "Tôi sắp sửa gọi điện thoại cho cảnh sát thì cô ấy về.", "eng": "I was on the point of phoning the police when she arrived home."}, {"viet": "Tôi bị trói nhưng đã tự cố cởi trói.", "eng": "I was tied up, but managed to work free."}, {"viet": "Tôi sẽ làm cho ông việc đó và chỉ lấy một số tiền công nhỏ là 50 bảng Anh.", "eng": "I will do it for you for a small consideration of £ 50."}, {"viet": "Tôi sẽ không bị đánh lừa lần này-tôi quyết tâm nói ra những gì tôi nghĩ.", "eng": "I won't be fobbed off this time-I'm determined to say what I think."}, {"viet": "Tôi làm công việc xây dựng vào mùa hè và đi học cao đẳng vào mùa đông.", "eng": "I worked in construction in the summer and went to college in the winter."}, {"viet": "Tôi muốn gửi lá thư này đến Đài Loan.", "eng": "I would like to send this letter to Taiwan."}, {"viet": "Băng lại đóng trên cánh phi cơ.", "eng": "Ice re-formed on the plane's wings."}, {"viet": "Nếu tôi tìm ra những người chịu trách nhiệm, tôi sẽ báo cho cảnh sát không một chút ân hận.", "eng": "If I could find the people responsible, I would have no compunction about telling the police."}, {"viet": "Nếu cô ấy được phần thưởng đến mức này thì càng tốt cho cả đội.", "eng": "If she wins the award, so much the better for the team."}, {"viet": "Nếu chúng ta tiếp tục phá hủy vùng đồng quê thì sẽ có thêm nhiều loài vật bị tuyệt chủng nữa.", "eng": "If we continue to destroy the countryside many more animals will become extinct."}, {"viet": "Nếu anh có thể đến muộn thì tôi cũng có thể làm như vậy: như nhau cả thôi.", "eng": "If you can arrive late, then so can I: What is sauce for the goose is sauce for the gander."}, {"viet": "Nếu ông có bất cứ thắc mắc nào liên quan đến hàng mẫu, xin cho chúng tôi biết.", "eng": "If you have any inquiries about the samples, please let us know."}, {"viet": "Nếu anh ra nước ngoài thì điều thiết yếu nhất là phải có giấy tờ đúng.", "eng": "If you travel abroad, it is essential that you have the night papers."}, {"viet": "Trong câu'This is my bike','this'là một đại từ chỉ định.", "eng": "In'This is my bike','this'is a demonstrative pronoun."}, {"viet": "Bất cứ điều gì xảy ra, tôi cũng sẽ đến đấy để hỗ trợ anh.", "eng": "In either event, I'll be there to support you."}, {"viet": "Ở nhiều nước phương Tây trinh tiết không được đánh giá cao như trước.", "eng": "In many Western countries, virginity is not highly valued as it used to be."}, {"viet": "Trong không khí có rất ít nước để có thể có tác dụng như một tấm chăn, và sức nóng của ban ngày thoát ra rất nhanh ngay khi mặt trời lặn.", "eng": "In the air there is very little water to act as a blanket, and the heat of the day escape very fast as soon as the sun goes down."}, {"viet": "Trong trường hợp bãi công không chắc sẽ xảy ra, sản xuất sẽ bị ảnh hưởng nặng nề.", "eng": "In the unlikely event of a strike, production would be badly affected."}, {"viet": "Sự cần cù của những chú kiến nhỏ bé đó trông thật là kỳ diệu.", "eng": "Industry of these little ants is wonderful to behold."}, {"viet": "Nó là nhà vệ sinh công cộng hay phải trả tiền?", "eng": "Is it a public or pay restroom?"}, {"viet": "Có một cửa hàng bách hóa ở vùng này phải không?", "eng": "Is there a department store in this neighborhood?"}, {"viet": "Phòng chơi bi da của quý vị bây giờ còn mở cửa chứ?", "eng": "Is your billiard room open now?"}, {"viet": "Thật là hổ thẹn khi đi lấy tiền của những người không thể có đủ khả năng để đóng tiền.", "eng": "It's a shame to take money from those who can't afford it."}, {"viet": "Điều đó khó, nhưng tôi sẽ kiên trì với nó.", "eng": "It's difficult, but I'm going to persevere with it."}, {"viet": "Không thể xây dựng luật cho mọi trường hợp ngẫu nhiên được.", "eng": "It's impossible to legislate for every contingency."}, {"viet": "Không phải chỉ có thức ăn cho khách tôi phải nghĩ đến-mà còn bao thứ linh tinh khác nữa.", "eng": "It's not just the food for the guests I have to think about-there are all the etceteras as well."}, {"viet": "Kiểm tra hành lý ở sân bay là chuyện bình thường.", "eng": "It's standard practise to check luggage at airports."}, {"viet": "Cậu cho mình lợi thế lúc ban đầu thật là rất có tinh thần thượng võ.", "eng": "It's very sporting of you to give me an initial advantage."}, {"viet": "Phải hỏi vay mượn thật là việc phiền lòng anh ta.", "eng": "It galled him to have to ask for a loan."}, {"viet": "Khó mà lôi bọn trẻ con đi loanh quanh các cửa hiệu với tôi.", "eng": "It is difficult tugging the children round the shops with me."}, {"viet": "Hoàn toàn rõ ràng là cô ấy sẽ không đến.", "eng": "It is quite clear that she is not coming."}, {"viet": "Có lẽ sẽ an toàn hơn nếu không loan báo về sự hiện diện của anh.", "eng": "It may be safer not to advertise your presence."}, {"viet": "Nó ở trong một địa điểm thuận tiện.", "eng": "It's in a convenient position."}, {"viet": "Hình như tôi đã hỏi một câu không đúng lúc.", "eng": "It seems I asked the wrong question."}, {"viet": "Hoá ra bà dì cô ta và bà chị họ tôi chỉ là một người.", "eng": "It turns out that her aunt and my cousin are one and the same person."}, {"viet": "Cậu đến muộn là bất lịch sự đấy.", "eng": "It was discourteous of you to arrive late."}, {"viet": "Các anh rất láu cá không nói cho chúng tôi biết các anh đã gặp nhau rồi.", "eng": "It was sly of you not to tell us you'd already met."}, {"viet": "Chắc cậu đã nhận thấy gần đây mình cực kỳ bận.", "eng": "It won't have escaped your notice that I've been unusually busy recently."}, {"viet": "Jane viết cho anh ta một lá thư dài, song không bao giờ anh ta viết trả lại cả.", "eng": "Jane wrote him a long letter, but he never wrote back."}, {"viet": "Nói nghiêm túc, anh nghĩ như thế nào về vấn đề đó?", "eng": "Joking apart, what do you think of it?"}, {"viet": "Kelly đá một hòn gạch vào thùng rác nghe đánh xoảng một tiếng.", "eng": "Kelly kicked an alley apple so that it struck a garbage can with a metallic crash."}, {"viet": "Chúng ta hãy tìm hiểu xem cửa hàng đó mấy giờ đóng cửa.", "eng": "Let's find out what time that store closes."}, {"viet": "Chúng mình hãy xem bộ phim em đã thuê nhé.", "eng": "Let's watch the movie I rented."}, {"viet": "Nhiều người khách thích ăn món salad hoặc trước hoặc cùng với món chính.", "eng": "Many guests like to have a salad either before or with the main course."}, {"viet": "Được coi là một chất độc ma tuý hại hơn của côcain.", "eng": "Marijuana is considered a gateway drug for cocaine mariluana."}, {"viet": "Cho tôi xin thêm vài ống hút nhé?", "eng": "May I have several more straws?"}, {"viet": "Có lẽ các sản phẩm của các ông có chất lượng hàng đầu, nhưng đơn giản là chúng tôi không thể đặt hàng mua chúng với giá này được.", "eng": "Maybe your products are of top quality, but we simply cannot order them at this price."}, {"viet": "Hầu hết mọi người đều phải làm việc để sống.", "eng": "Most people have to work in order to live."}, {"viet": "Cô ta quá ư huyên thiên.", "eng": "Much too fond of the sound of her own voice."}, {"viet": "Bằng lái xe của tôi hết hạn vào tháng 11?", "eng": "My driver's license expires in November?"}, {"viet": "Công việc của tôi không hấp dẫn lắm nhưng cũng có những lúc vui.", "eng": "My job is not a very glamorous one but it does have its moments."}, {"viet": "Vị giác của tôi không được tốt lắm vì tôi bị cảm lạnh.", "eng": "My sense of taste isn't very good, I have a cold."}, {"viet": "Tất nhiên anh sẽ phải thảo luận với vợ anh.", "eng": "Naturally you will want to discuss it with your wife."}, {"viet": "Nijinsky rất nghiêm khắc trong những đòi hỏi về sự hoàn thiện của ông ta.", "eng": "Nijinsky was unsparing in his demands for perfection."}, {"viet": "Cho dù anh ấy có cố gắng nhiều đến mấy đi nữa, anh ấy cũng không thể làm cô ấy thay đổi ý định.", "eng": "No matter how hard he tried, he couldn't get her to change her mind."}, {"viet": "Nào, hãy im lặng một lát và nghe đây.", "eng": "Now be quiet for a new moments and listen to this."}, {"viet": "Thật khá lạ lùng, chúng tôi cũng vừa mới nói đến việc đó.", "eng": "Oddly enough, we were just talking about the same thing."}, {"viet": "Dầu và mỡ sẽ làm hỏng cao su lốp xe của ông.", "eng": "Oil and grease will rot the rubber of your tyres."}, {"viet": "Bên cạnh là 18 vị La Hán.", "eng": "On the side are 18 Luohans."}, {"viet": "Một trong những ống dẫn không khí đã bị tắc.", "eng": "One of the air-ducts has become blocked."}, {"viet": "Các nhà khoa học giỏi nhất của chúng ta đang bị các nước khác lấy đi.", "eng": "Our best scientists are being creamed off by other countries."}, {"viet": "Ngày nghỉ của chúng tôi kết thúc đột ngột khi chúng tôi mất hết cả tiền.", "eng": "Our holiday came to an abrupt end when we lost all our money."}, {"viet": "Mục điểm báo tuần này của chúng ta được ông chủ bút tờ'Thời báo'trình bày.", "eng": "Our review of this week's papers is presented by the editor of'The Times'."}, {"viet": "Quyền sở hữu về tài sản đòi hỏi phí tổn lớn.", "eng": "Ownership of property involves great expense."}, {"viet": "Mọi người luôn luôn vui vẻ.", "eng": "People always have a good time."}, {"viet": "Những uỷ viên thường trực của Hội đồng bảo an Liên hiệp quốc có quyền phủ quyết đối với bất cứ kiến nghị nào.", "eng": "Permanent members of the United Nations Security Council have a veto over an proposal."}, {"viet": "Cảnh sát tới tất cả những quán ba mà tên tình nghi hay lui tới.", "eng": "Police visited all the bars that the suspect frequented."}, {"viet": "Bãi bỏ tự do ngôn luận để ngăn chặn các ấn phẩm khiêu dâm không phải là đường lối đúng đắn các quan tòa nói như vậy.", "eng": "Sacrificing free speech to put skids on prurient printed matter is not the correct path the courts said."}, {"viet": "Sau trận mưa to, nhiều cánh đồng đã bị ngập nước.", "eng": "Several fields are under water after the heavy rain."}, {"viet": "Cô ta có phần trội hơn tất cả các đồng nghiệp của cô ấy.", "eng": "She's a cut above the rest of her colleagues."}, {"viet": "Bà ấy bị đau lưng suốt đời.", "eng": "She's been plagued by back pain all her life."}, {"viet": "Bà ta đã để nhiều tâm trí vào công việc đó.", "eng": "She's invested a lot of emotional energy in that business."}, {"viet": "Nàng đã thực sự bám chặt anh ta.", "eng": "She's really got her claws into him!"}, {"viet": "Cô ta sốt sắng nhận lời mời.", "eng": "She accepted the invitation with alacrity."}, {"viet": "Cô ấy trông ít giống mẹ.", "eng": "She bears little resemblance to her mother."}, {"viet": "Bà ta cho mình là siêu linh và có thể đoán trước được tương lai.", "eng": "She claims to be psychic and to be able to foretell the future."}, {"viet": "Cô ta đã quyết định từ bỏ cõi thế tục để vào tu viện.", "eng": "She decided to renounce the world and enter a convent."}, {"viet": "Cô ta nằm mơ thấy những con quái vật khủng khiếp mắt bốc lửa và răng nhọn đang săn đuổi cô ta.", "eng": "She dreamt that terrible monsters with flaming eyes and sharp teeth were chasing her."}, {"viet": "Bà ta nổi bật lên trong cuộc tranh luận công khai về vấn đề đó.", "eng": "She figured conspicuously in the public debate on the issue."}, {"viet": "Ngày nào cô ấy cũng đi bơi, bất kể trời lạnh thế nào.", "eng": "She goes swimming every day however cold it is."}, {"viet": "Cô ta đã quyết lấy anh ấy làm chồng.", "eng": "She had reached an unalterable decision to marry him."}, {"viet": "Cô ta đã chinh phục được trái tim của nhiều đàn ông.", "eng": "She has conquered the hearts of many men."}, {"viet": "Cô ta hy vọng tránh được sự nhận diện bằng cách đeo kính râm.", "eng": "She hoped to avoid recognition by wearing dark glasses."}, {"viet": "Cô ta rất say sưa trong việc trông nom súc vật.", "eng": "She is passionate about caring for animals."}, {"viet": "Bà ấy biết rất nhiều về lịch sử địa phương-bà ấy sẽ có thể kể cho anh biết về những ngôi nhà này được xây dựng từ bao giờ.", "eng": "She knows a lot about local history-she'll be able to tell you when these houses were built."}, {"viet": "Cô ta ( rời mắt khỏi cuốn sách ) ngước nhìn khi tôi bước vào phòng.", "eng": "She looked up ( from her book ) as I entered the room."}, {"viet": "Cô ta phải điên mới lái xe nhanh như thế.", "eng": "She must be a lunatic to drive her car so fast."}, {"viet": "Cô ấy véo tay tôi rất mạnh, bây giờ vẫn còn đau.", "eng": "She pinched my arm hard, and it still hurts."}, {"viet": "Bà ta thực sự nổi nóng khi tôi xin thêm tiền.", "eng": "She really blew a gasket when I asked for more money."}, {"viet": "Cô ta là một người đẹp tuyệt trần.", "eng": "She's an absolute knock-out."}, {"viet": "Cô ấy là số một trong môn quần vợt.", "eng": "She's really hot stuff at tennis."}, {"viet": "Cô ấy mò trên sàn để nhặt những đồng tiền cô ấy đánh rơi.", "eng": "She scrabbled about on the floor picking up the coins she'd dropped."}, {"viet": "Cô ta xin được một cách ngon lành việc làm ở ngân hàng ngay sau khi tốt nghiệm.", "eng": "She simply walked into a job at the bank as soon as she graduated."}, {"viet": "Cô ta đứng trước cửa sổ, in bóng lên nền trời rạng đông.", "eng": "She stood in front of the window, silhouetted against the dawn sky."}, {"viet": "Cô ta tưởng ở đây cô ta ghê gớm lắm.", "eng": "She thinks she's the bee's knees around here."}, {"viet": "Cô nàng quấn sợi tóc quanh ngón tay.", "eng": "She twisted her hair round her fingers."}, {"viet": "Chị ấy ở nước ngoài suốt mùa hè qua.", "eng": "She was abroad all last summer."}, {"viet": "Cô ta dứt khoát thờ ơ với lời đề nghị ấy.", "eng": "She was decidedly cool about the proposal."}, {"viet": "Cô ta ở trong tình trạng lộn xộn đến nỗi không nhớ nổi là thứ mấy nữa.", "eng": "She was in such a muddle she couldn't even remember what day it was."}, {"viet": "Cô ta nói rất rõ ràng là tại sao cô ta ra đi.", "eng": "She was quite explicit about why she left."}, {"viet": "Người ta đã bảo bà phải nộp phạt, nhưng bà ta từ chối không chịu tuân theo.", "eng": "She was told to pay the fine, but refused to comply."}, {"viet": "Cô nàng phá lên cười ngất.", "eng": "She went into peals of laughter."}, {"viet": "Bà ấy đội mũ miện bằng vàng khảm bằng đá quý.", "eng": "She wore a gold crown encrusted with jewels."}, {"viet": "Những tàu buôn bán giữa Luân Đôn và Viễn Đông.", "eng": "Ships trading between London and the Far East."}, {"viet": "Ghi tên học một khóa thư ký.", "eng": "Sign up for a secretarial course."}, {"viet": "Sáu cái xác được lấy ra trong đống xe vụn.", "eng": "Six bodies were recovered from the wreck."}, {"viet": "Trước đây sương khói làm sự lưu thông ở Luân Đôn bị ngưng trệ.", "eng": "Smog used to bring London traffic to a standstill."}, {"viet": "Vậy người vợ là nhân viên văn phòng.", "eng": "So the wife is an office worker."}, {"viet": "Vài cái ghế được gắn vỏ bọc rời.", "eng": "Some chairs are fitted with loose covers."}, {"viet": "Một số sơn phần chính là dầu.", "eng": "Some paints have an oil base."}, {"viet": "Có ai đó đã nghí ngoáy cái đài nên bây giờ nó tịt rồi.", "eng": "Somebody's been messing about with the radio and now it doesn't work."}, {"viet": "Rất tiếc, chúng tôi không thể đồng ý được.", "eng": "Sorry, we can't reach an agreement."}, {"viet": "Truyền đạt nguyên tắc làm việc chăm chỉ.", "eng": "Spreading the gospel of hard work."}, {"viet": "Steven, đó là cái tên dễ gọi đấy.", "eng": "Steven, that's an easy one to call."}, {"viet": "Những câu chuyện được truyền từ đời ông cha lại cho chúng ta.", "eng": "Stories that came down to us from our forefathers."}, {"viet": "Trước đây người ta chưa từng được xem một cuộc trưng bày như thế.", "eng": "Such a display has never before been seen."}, {"viet": "Các luật điều chỉnh những hoạt động về bất động sản ngăn trở việc xây cất nhà lớn trên những khu đất nhỏ.", "eng": "Sumptuary laws discouraging construction of large house on small plots of land."}, {"viet": "Những tay bơi lội phải thận trọng với nước thủy triều mạnh.", "eng": "Swimmers should beware of strong tides."}, {"viet": "Gỡ hai mắt xích của sợi xích ra để thu ngắn nó lại.", "eng": "Take two links out of the chain to shorten it."}, {"viet": "Hãy nói với anh ta là tôi đang bận và tôi sẽ gọi lại cho anh ta sau.", "eng": "Tell him I'm busy and I'll call him back later."}, {"viet": "Rất cám ơn anh về những bông hoa xinh đẹp này.", "eng": "Thank you very much for the beautiful flowers."}, {"viet": "Lập luận đó hoàn toàn không thích hợp-anh lẫn lộn vấn đề rồi.", "eng": "That argument's completely irrelevant-you're confusing the issue."}, {"viet": "Thứ dầu nặng đó sẽ làm tắt máy.", "eng": "That heavy oil will clog up the machinery."}, {"viet": "Kiểu tóc mới đó đúng là làm cô ta đẹp hơn nhiều.", "eng": "That new hairstyle really does a lot for her."}, {"viet": "Đó là những gì người dự báo thời tiết nói.", "eng": "That's what the weatherman said."}, {"viet": "Điều đó sẽ làm cho mọi thứ đồng đều một chút.", "eng": "That will even things up a bit."}, {"viet": "Sự tích luỹ tiền nong, tri thức, kinh nghiệm.", "eng": "The accumulation of money, knowledge, experience."}, {"viet": "Viên thiếu tướng Không quân phổ biến cho đoàn bay ném bom biết đầy đủ chi tiết về nhiệm vụ nguy hiểm của họ.", "eng": "The Air Commodore briefed the bomber crew on their dangerous mission."}, {"viet": "Lời loan báo đó được mọi người vui mừng đón nhận.", "eng": "The announcement was met with general rejoicing."}, {"viet": "Quân đội đã can đảm chống lại lực lượng của địch.", "eng": "The army defied the enemy's forces."}, {"viet": "Cuộc toan tính lật đổ tên bạo chúa.", "eng": "The attempted overthrow of the tyrant."}, {"viet": "Đứa bé đến thời kỳ hóng chuyện.", "eng": "The baby has reached the talking stage."}, {"viet": "Ngân hàng đang thúc ép chúng tôi trả nợ.", "eng": "The bank is pressing us for repayment of the loan."}, {"viet": "Con gấu đã trưởng thành toàn diện.", "eng": "The bear was a fully grown adult."}, {"viet": "Con chim vỗ cánh và bay đi.", "eng": "The bird flapped its wings and flew away."}, {"viet": "Những con tàu trong hải cảng đã tạo nên một quang cảnh đẹp.", "eng": "The boats in the harbor make a beautiful scene."}, {"viet": "Quyển sách nêu lên nhiều vấn đề quan trọng ( làm chúng ta suy nghĩ ).", "eng": "The books raises many important issues ( for our consideration )."}, {"viet": "Bọn con trai tất cả đều nhìn cô ta cái nhìn gợi dục.", "eng": "The boys were all giving her the glad eye."}, {"viet": "Thậm chí tòa nhà vẫn chưa được khởi công.", "eng": "The building hasn't even been begun."}, {"viet": "Công việc kinh doanh sớm được thiết lập một cách vững chắc trong thành phố.", "eng": "The business was soon firmly established in the town."}, {"viet": "Tôi mua chiếc ôtô đó tốn cả một gia tài.", "eng": "The car cost me a small fortune."}, {"viet": "Cái bào của người thợ mộc phát ra tiếng ken két chát chúa mỗi lúc một to dần.", "eng": "The carpenter's plane whistles its wild ascending lisp."}, {"viet": "Trát xi măng trải ra bề mặt rồi sau đó tô cho bằng phẳng.", "eng": "The cement should strew proud of the surface and then be smoothed down later."}, {"viet": "Tiếng hoan hô ở cách xa nửa dặm còn nghe thấy.", "eng": "The cheering could be heard half a mile away."}, {"viet": "Đứa trẻ chứng tỏ óc sáng kiến cao khi đi tìm cảnh sát.", "eng": "The child showed great initiative in going to fetch the police."}, {"viet": "Lũ trẻ ùa đến để gặp mẹ.", "eng": "The children flew to meet their mother."}, {"viet": "Các học sinh được phép nghỉ học.", "eng": "The children were granted a holiday from school."}, {"viet": "Thành phố, do nhầm lẫn, được gọi là N.", "eng": "The city which, by a misnomer is called N."}, {"viet": "Câu lạc bộ tìm cách đạt được sự bảo trợ của một công ty thương mại địa phương.", "eng": "The club has made an approach to a local business firm for sponsorship."}, {"viet": "Hình thức kết hợp Afro nghĩ là là African kết hợp với American làm thành Afro-American.", "eng": "The combining form Afro-meaning African, combines with American to make Afro-American."}, {"viet": "Công ty có một năm đầu thành công ở trong nước nhưng sự thâm nhập vào thị trường thế giới thì chậm.", "eng": "The company has had a successful first year at home but penetration of the international market has been slow."}, {"viet": "Những kết luận đó chắc phải có căn cứ thực tế vững chắc nào đó.", "eng": "The conclusions must have some solid foundation in reality."}, {"viet": "Cuộc trò chuyện miên man chuyển từ đề tài này sang đề tài khác.", "eng": "The conversation drifts from one topic to another."}, {"viet": "Đất nước ở trong một tình trạng kinh tế tồi tệ.", "eng": "The country is in a bad economic state."}, {"viet": "Các tác phẩm của các nhà thơ và họa sĩ.", "eng": "The creations of poets and artists."}, {"viet": "Tiếng gáy của con gà trống là tiếng báo hiệu bình minh.", "eng": "The crowing of the cock is a harbinger of dawn."}, {"viet": "Cô vũ nữ được ca ngợi nhiều.", "eng": "The dancer was showered with praise."}, {"viet": "Bị cáo khiếu nại rằng ông ta đã không được xét xử công minh.", "eng": "The defendant claimed that he had not had a fair trial."}, {"viet": "Sự định lượng muối trong nước biển.", "eng": "The determination of the salt in sea water."}, {"viet": "Căn bệnh đó xuất hiện thường xuyên nhất ở vùng quê.", "eng": "The disease occurs most frequently in rural areas."}, {"viet": "Bác sĩ khuyên một viên sulphur ba lần một ngày.", "eng": "The doctor recommended a capsule of sulphur three times a day."}, {"viet": "Con chó chạy lon ton cạnh chủ.", "eng": "The dog padded along next to its owner."}, {"viet": "Chiếc áo đầm được thêu hoa.", "eng": "The dress was embroidered with flowers."}, {"viet": "Trận động đất đã cướp đi hàng ngàn sinh mạng.", "eng": "The earthquake claimed thousands of lives."}, {"viet": "Tổ chức của chủ va chạm với nghiệp đoàn.", "eng": "The employers'organization is on a collision course with the unions."}, {"viet": "Thiết bị đã nhận được tín hiệu từ vệ tinh.", "eng": "The equipment picked up an the signal from the satellite."}, {"viet": "Cuộc triển lãm đã không đạt tiêu chuẩn so với năm vừa rồi.", "eng": "The exhibition didn't measure up to last year."}, {"viet": "Hương thơm nhè nhẹ của nước hoa cô ấy dùng vẫn còn vương lại trong phòng.", "eng": "The faint smell of her perfume lingered in the room."}, {"viet": "Những tình cảm ràng buộc chàng với nàng.", "eng": "The feelings that bind him to her."}, {"viet": "Cuốn phim đó là một thành công lừng lẫy.", "eng": "The film was a resounding success."}, {"viet": "Xí nghiệp sắp sửa phá sản dưới sự điều hành của ban giám đốc mới.", "eng": "The firm is going to pot under the new management."}, {"viet": "Con cá đó táp miếng mồi.", "eng": "The fish snapped at the bait."}, {"viet": "Trận đấu bóng đá đó là một trận điển hình xuất sắc.", "eng": "The football match was a classic."}, {"viet": "Phát ngôn viên của nhóm nghị sĩ lãnh đạo về vấn đề quốc phòng.", "eng": "The front-bench spokesman on defense."}, {"viet": "Mảnh vườn đang biến thành bãi hoang.", "eng": "The garden is turning into a wilderness."}, {"viet": "Các cô gái rít lên những lời thoá mạ các luật sư.", "eng": "The girls shrieked abuse at the lawyers."}, {"viet": "Chính quyền đã hành động mau lẹ để giảm bớt cảnh khốn khổ đang lan rộng do cơn động đất gây ra.", "eng": "The Government acted quickly to relieve the widespread distress caused by the earthquake."}, {"viet": "Chính phủ đang làm một cố gắng muộn màng để chấm dứt nạn đầu cơ.", "eng": "The government is making a belated attempt to stop profiteering."}, {"viet": "Sự rút nước dần của con sông đó.", "eng": "The gradual subsidence of the river."}, {"viet": "Sự vỡ mộng ngày càng tăng đối với các chính sách của chính phủ.", "eng": "The growing disillusionment with the Government's policies."}, {"viet": "Thiếu mất cái búa trong hộp dụng cụ của tôi.", "eng": "The hammer is missing from my tool-box."}, {"viet": "Dân tộc tạp chủng ở Hoa Kỳ.", "eng": "The heterogeneous population of the U. S. A."}, {"viet": "Bệnh viện có một khu trị liệu và một khu giải phẫu.", "eng": "The hospital has a medical ward and a surgical ward."}, {"viet": "Ngôi nhà được đem thế chấp ( cho ngân hàng ) ( để vay 30000 pao ).", "eng": "The house is mortgaged ( to the bank ) ( for 30000 pounds )."}, {"viet": "Ông nảy ra ý nghĩ đó trong lúc đang tắm.", "eng": "The idea came to him in his bath."}, {"viet": "Thời đại công nghiệp đã đưa đến những lợi ích không sao kể hết.", "eng": "The industrial age has brought innumerable benefits."}, {"viet": "Khoảng thời gian giữa ánh chớp và tiếng sấm.", "eng": "The interval between a flash of lightning and the sound of thunder."}, {"viet": "Những việc đã làm xong được đánh dấu bên cạnh.", "eng": "The jobs that are done have been ticked off."}, {"viet": "Vai trò chủ yếu của một giáo viên trong quá trình học tập.", "eng": "The key role of the teacher in the learning process."}, {"viet": "Khu đất đó được xác định cho việc sử dụng về công nghiệp.", "eng": "The land was zoned for industrial use."}, {"viet": "Các luật sư đã thảo luận về vụ kiện này hàng giờ đồng hồ.", "eng": "The lawyers argued the case for hours."}, {"viet": "Nắp hộp này đậy không khít.", "eng": "The lid of this box doesn't close properly."}, {"viet": "Vị trí các sảnh đường được lựa chọn cẩn thận.", "eng": "The locations for pavilions are carefully chosen."}, {"viet": "Máy này chỉ nhận những đồng 10 xu thôi.", "eng": "The machine only accepts 10p coins."}, {"viet": "Người đàn ông đang chơi game đó rất trẻ.", "eng": "The man who was playing that game was very young."}, {"viet": "Vấn đề này ngoài phạm vi trách nhiệm của tôi.", "eng": "The matter is outside my area of responsibility."}, {"viet": "Thành viên của phong trào Lao động.", "eng": "The member of the Labour Movement."}, {"viet": "Ông bộ trưởng đã khởi xướng một cuộc điều tra chính thức toàn bộ về vụ.", "eng": "The minister has instigated a full official inquiry into the incident."}, {"viet": "Tháng bảy là tháng mang tên ông.", "eng": "The month of July named for him."}, {"viet": "Những dãy núi tắm trong nắng vàng.", "eng": "The mountains were bathed in golden light."}, {"viet": "Tính vui nhộn tự nhiên của bọn trẻ.", "eng": "The natural exuberance of young children."}, {"viet": "Chính quyền mới đã mở đầu một giai đoạn thịnh vượng.", "eng": "The new government ushered in a period of prosperity."}, {"viet": "Trung tâm buôn bán mới là một điều chướng tai gai mắt.", "eng": "The new shopping centre is an offence to the eye."}, {"viet": "Chuyến bay còn chỗ kế tiếp cất cánh lúc 4 giờ chiều thứ bảy, ngày 4 tháng 8.", "eng": "The next available flight leaves at 4: 00 p. m. Saturday, August 4th."}, {"viet": "Chất thải hạt nhân được chôn sâu dưới đất.", "eng": "The nuclear waste was buried deep underground."}, {"viet": "Văn phòng sẽ ấm lên trong chốc lát.", "eng": "The office will soon heat up."}, {"viet": "Giáo sư già nổi tiếng là bậc tài giỏi được người ta tham bác nhiều vấn đề.", "eng": "The old professor renowned as genius, was consulted on many matters."}, {"viet": "Phẩm hàm Garter là một loại phẩm hàm hiệp sĩ cổ.", "eng": "The Order of the Garter is an ancient order of chivalry."}, {"viet": "Tất cả những bức hoạ được sao lại trong sách.", "eng": "The paintings were all reproduced in the book."}, {"viet": "Hành khách ngồi, sốt ruột vì sự chậm trễ kéo dài.", "eng": "The passengers sat chafing at the long delay."}, {"viet": "Những người trên đường phố chủ yếu là khách du lịch.", "eng": "The people in the streets were mainly tourists."}, {"viet": "Tính hoá lí của chất đồng phân.", "eng": "The Physicochemical Properties Of Anisomer."}, {"viet": "Nơi để đi tới tìm các món hàng giả mạo về chất lượng.", "eng": "The place to go for quality knock off."}, {"viet": "Vữa phải khô trước khi bạn có thể sơn phòng.", "eng": "The plaster will have to dry out before you can paint the room."}, {"viet": "Bài thơ đó đọc nghe như một bài thơ dịch.", "eng": "The poem reads like a translation."}, {"viet": "Cảnh sát bám đuôi tôi-họ biết tôi ở đây.", "eng": "The police have been tailing me-they know I'm here."}, {"viet": "Cảnh sát được điều đến để điều tra việc đó.", "eng": "The police were brought in to probe the incident."}, {"viet": "Bức chân dung là tài sản đáng tự hào nhất của anh ấy.", "eng": "The portrait was his proudest possession."}, {"viet": "Việc giữ gìn và bảo tồn thú hoang.", "eng": "The preservation and conservation of wildlife."}, {"viet": "Kết quả có thể dự đoán là một thất bại trong bầu cử.", "eng": "The presumable result is an election defeat."}, {"viet": "Ông hiệu trưởng gác lại những đề nghị mới cho đến khi có đủ nguồn tài chính.", "eng": "The principal shelved the new proposals till as such time as finances were available."}, {"viet": "Những sản phẩm của ngành công nghiệp chế tạo.", "eng": "The products of manufacturing industry."}, {"viet": "Nguy cơ nổ ra chiến tranh hiện ra lù lù trong đầu óc mọi người.", "eng": "The prospect of war loomed large in everyone's mind."}, {"viet": "Xe ngựa của Nữ Hoàng có sáu con ngựa kéo.", "eng": "The Queen's coach was drawn by six horses."}, {"viet": "Cơn mưa đến từ hướng tây.", "eng": "The rain is coming from the west."}, {"viet": "Số thập phân tuần hoàn 3.999... cũng được miêu tả là 3.9 tuần hoàn.", "eng": "The recurring decimal 3.999... is also described as 3.9 recurring."}, {"viet": "Bản báo cáo như chuyện tầm bậy.", "eng": "The report sounded like so much baloney."}, {"viet": "Tàu thuyền có thể đi lại được trên sông Rhin từ Strasbourg đến biển.", "eng": "The Rhine is navigable from Strasbourg to the sea."}, {"viet": "Con đường đột ngột rẽ sang trái.", "eng": "The road curved suddenly to the left."}, {"viet": "Căn phòng đầy những cuộn khói làm nga thở.", "eng": "The room was filled with choking clouds of smoke."}, {"viet": "Sự loại bỏ an toàn chất thải phóng xạ.", "eng": "The safe disposal of radio active waste."}, {"viet": "Kế hoạch vẫn còn ở giai đoạn phôi thai của nó.", "eng": "The scheme is still in its embryonic stage."}, {"viet": "Thứ hai là Bu-đa-pét, thủ đô của nước Hung-ga-ri.", "eng": "The second is Budapest, the capital of Hungary."}, {"viet": "Ấn tượng của thảm kịch ban đầu này đã ảnh hưởng suốt cả cuộc đời cô ấy.", "eng": "The shadow of this early tragedy has affected her whole life."}, {"viet": "Con tàu bị mắc kẹt trong băng.", "eng": "The ship was jammed in the ice."}, {"viet": "Sườn tàu chạm sát vào bến phát ra tiếng kêu ken két.", "eng": "The side of the boat hit the quay with a grinding jar."}, {"viet": "Bầu trời trông tối xầm và như báo trước có dông gió.", "eng": "The sky looks black and threatening."}, {"viet": "Công tước phu nhân ăn mặc sang trọng tiếp các vị khách của mình ở phòng khách.", "eng": "The soigné duchess received her guests in the drawing room."}, {"viet": "Con tàu vũ trụ đó đang di chuyển theo quỹ đạo quanh mặt trăng.", "eng": "The spacecraft is in orbit round the moon."}, {"viet": "Chuồng ngựa đặt cách đây một dặm.", "eng": "The stable is a mile away."}, {"viet": "Hòn đá đập vào cạnh đầu tôi.", "eng": "The stone struck me on the side of the head."}, {"viet": "Chỗ ăn ở của sinh viên hết sức thiết thực.", "eng": "The student accommodation is strictly utilitarian."}, {"viet": "Ánh sáng mặt trời sẽ làm hoa nở.", "eng": "The sunshine will bring out the blossom."}, {"viet": "Cái nhìn nghiêm khắc của thầy giáo đã khiến nó phải nín thinh.", "eng": "The teacher's stern look reduced him to silence."}, {"viet": "Hai đội hoà nhau mỗi bên sáu điểm.", "eng": "The teams are all square with six points each."}, {"viet": "Tên trộm tỏ ra ăn năn vì tất cả những hành động đã qua của mình.", "eng": "The thief expressed penitence for all his past actions."}, {"viet": "Tính truyền thống, tính rụt rè trong các cách trang trí của anh ta.", "eng": "The timid conventionality of his designs."}, {"viet": "Tàu hoả đến đúng 9 giờ 05.", "eng": "The train arrived at 9.05 to the minute."}, {"viet": "Quân lính xuống xe lửa ở gần trận địa.", "eng": "The troops detrained near the battle zone."}, {"viet": "Hai đảng đó đã đạt được một sự nhất trí.", "eng": "The two parties have reached a consensus."}, {"viet": "Vương quốc Anh gồm có Anh, xứ Wales, Scotland và Bắc Ireland.", "eng": "The United Kingdom takes in England, Wales, Scotland and Northern Ireland."}, {"viet": "Các nước thắng trận đòi hỏi ở những kẻ địch trước đây những khoản bồi thường khổng lồ.", "eng": "The victorious nations are demanding huge indemnities from their former enemies."}, {"viet": "Chiến tranh gây ra tổn thất nhân mạng lớn lao.", "eng": "The war took a heavy toll of human life."}, {"viet": "Mưa đã làm lúa mì đổ rạp.", "eng": "The wheat had been beaten down by the rain."}, {"viet": "Cái cửa sổ này không đóng được chặt nếu không chêm nó lại.", "eng": "The window doesn't stay closed unless you wedge it."}, {"viet": "Việc xây dựng chiếc cầu mất sáu tháng.", "eng": "The work of building the bridge took six months."}, {"viet": "Nhà hoạ sĩ trẻ đã triển lãm ( tác phẩm của mình ) tại một số phòng tranh.", "eng": "The young painter has exhibited ( his work ) in several galleries."}, {"viet": "Những hi vọng và mơ ước của họ chứng tỏ là hão huyền.", "eng": "Their hopes and dreams proved to be smoke."}, {"viet": "Cả cuộc đời họ là một cuộc vật lộn bền bỉ chống nghèo đói.", "eng": "Their whole life was a constant battle against poverty."}, {"viet": "Sẽ có đủ chỗ nếu tất cả chúng ta ép sát vào nhau một chút.", "eng": "There'll enough room if we all squeeze up a bit."}, {"viet": "Có một cuộc trình diễn làm đồ gốm ở hội chợ.", "eng": "There's an exhibition of pottery-making at the fair."}, {"viet": "Có một vấn đề nhỏ bạn phải quan tâm.", "eng": "There's one small problem you have to take care of."}, {"viet": "Có hàng trăm sao chổi trong Thái Dương hệ của chúng ta, nhưng có nhiều người chưa từng nhìn thấy một ngôi sao chổi nào.", "eng": "There are hundreds of comets on our solar system, but many people have never seen one."}, {"viet": "Có những đầu nhọn ở dưới giầy chạy.", "eng": "There are spikes on the bottom of shoes used for running."}, {"viet": "Về sau, đế quốc này cũng còn những thay đổi khác.", "eng": "There have been many later changes in the Empire, too."}, {"viet": "Có một gia sư dạy cho bọn trẻ khi chúng nằm bệnh viện.", "eng": "There is a tutor to teach the children while they're in hospital."}, {"viet": "Có chỗ không giống nhau giữa sự miêu tả của họ.", "eng": "There is some discrepancy between their two description."}, {"viet": "Có tiếng rên trong lớp khi thầy giáo cho họ một bài kiểm tra.", "eng": "There was a groan from the class when the teacher gave them the test."}, {"viet": "Chỉ có thời gian để phác hoạ kế hoạch.", "eng": "There was only time to adumbrate the plan."}, {"viet": "Nó không có nhiều cái để lựa chọn.", "eng": "There weren't many options open to him."}, {"viet": "Những số liệu này chứng minh là báo cáo nói rằng công việc kinh doanh đang đi xuống là sai.", "eng": "These figures give the lie to reports that business is declining."}, {"viet": "Những vẩy này phủ lên nhau giống như ván lợp mái nhà.", "eng": "These scales lap over one another like the shingles on roof."}, {"viet": "Họ đi theo một đường lối cứng rắn trong cuộc thương lượng về tiền lương.", "eng": "They're taking a hard line in the pay negotiation."}, {"viet": "Họ đang chấp nhận cách suy nghĩ của chúng tôi đối với cuộc sống.", "eng": "They are adopting our attitude to life."}, {"viet": "Họ định rút lui khỏi thế giới, cố gắng không nghĩ đến nó nữa.", "eng": "They attempt to withdraw from the world to block it out."}, {"viet": "Họ coi hành vi của bà ta là một thứ màu mè hợm mình đáng xấu hổ.", "eng": "They considered her behaviour a shameful piece of snobbery."}, {"viet": "Họ chỉ vừa đủ sống dè xẻn trên đồng lương ít ỏi của ông ấy.", "eng": "They eke out a bare existence on his low salary."}, {"viet": "Họ chạy sang Mỹ và thoát khỏi sự kiểm soát của kẻ thù.", "eng": "They had fled to American, and were beyond the grasp of their enemies."}, {"viet": "Họ đầu tư tiền rất có lãi.", "eng": "They invested the money very profitably."}, {"viet": "Chúng có thể lột da nhiều lần.", "eng": "They may shed their skins several times."}, {"viet": "Họ đã kéo dài cuộc viếng thăm thêm vài ngày nữa.", "eng": "They prolonged their visit by a few days."}, {"viet": "Chúng nó dường như đang gặp khó khăn gì đó để khởi động chiếc xe hơi.", "eng": "They seem to be having some difficulty in starting the car."}, {"viet": "Họ nói một cách không chính thức với tôi rằng tôi đã có việc làm.", "eng": "They told me informally that I had got the job."}, {"viet": "Chúng nó kính sợ đến câm miệng bởi giọng nói nghiêm khắc của bà ta.", "eng": "They were awed into silence by the sternness of her voice."}, {"viet": "Thật là không may họ bị thua vì họ chơi rất giỏi.", "eng": "They were unlucky to lose because they played so well."}, {"viet": "Điều này đúng với sự miêu tả chiếc túi bị đánh cắp.", "eng": "This answer to the description of the stolen bag."}, {"viet": "Công ty này tham gia vào công việc xuất khẩu lẫn nhập khẩu.", "eng": "This company engaged in both export and import business."}, {"viet": "Cái thứ keo cực dính này chắc là dùng vào việc đó sẽ rất tốt.", "eng": "This extra strong glue should do the job nicely."}, {"viet": "Đây là một sự việc không bình thường tạm thời và chẳng bao lâu sẽ được đâu vào đấy.", "eng": "This is a temporary aberration and it will soon be put right."}, {"viet": "Đây là phát thanh viên âm nhạc của các bạn, chúng tôi ngừng buổi phát thanh và hẹn gặp lại các bạn tuần sau theo nhạc hiệu của chúng tôi.", "eng": "This is your resident DJ signing off for another week with our signature tune."}, {"viet": "Cái lệnh mới này sẽ đòi hỏi ( chúng ta ) phải làm việc thêm giờ.", "eng": "This new order will mean ( us ) working overtime."}, {"viet": "Đề nghị này của anh khó mà được thoả mãn.", "eng": "This proposal of yours hardly meets the case."}, {"viet": "Eo biển này dài khoảng hai mươi dặm và rộng từ 1/3 đến 2 dặm.", "eng": "This strait is about twenty miles long and from one-third of a mile to two miles wide."}, {"viet": "Công việc này đòi hỏi phải cẩn thận, không được làm vội.", "eng": "This work needs care, it mustn't be hurried."}, {"viet": "Để vào được những hang có hình vẽ, người ta phải bò qua những lối đi hẹp.", "eng": "To get to some of the rooms where the pictures are, one has to crawl through narrow passageways."}, {"viet": "Buôn bán luôn luôn nhộn nhịp vào kỳ lễ Nôen.", "eng": "Trade is always good over the Christmas period."}, {"viet": "Thông thường thì đầu kia cũng được gắn vào một thanh gỗ hoặc xương.", "eng": "Usually the other end was fastened to a rod, too."}, {"viet": "Nước và băng là cùng một chất dưới những dạng khác nhau.", "eng": "Water and ice are the same substance in different forms."}, {"viet": "Chúng tôi sẽ trả anh một nửa trước rồi trả một nửa kia khi anh làm xong công việc.", "eng": "We'll pay you half up front and the other half when you've finished the job."}, {"viet": "Chúng tôi đang tìm một người thực sự tận tâm với công việc này.", "eng": "We're looking for someone with a real sense of commitment to the job."}, {"viet": "Chúng tôi còn thừa một cái vali nhưng hơi khó lấy.", "eng": "We've got a spare suitcase but it's not very get-at-able."}, {"viet": "Tất cả chúng tôi đều cười nhạo Jane khi cô nói là cô tin có ma.", "eng": "We all laughed at Jane when she said she believed in ghosts."}, {"viet": "Chúng tôi rất quan tâm đến đồ chơi chạy bằng máy trưng bày ở Hội chợ Thương mại Quảng Châu gần đây và sẽ rất vui nếu có được các chi tiết về điều khoản xuất khẩu của quý vị.", "eng": "We are quite interested in the mechanical toys demon-strated at the recent Guangzhou Trade Fair and should be glad to have details of your export terms."}, {"viet": "Chúng tôi đã mượn nó sáng nay.", "eng": "We came for it this morning."}, {"viet": "Chúng ta không thể tồn tại lâu mà không có thức ăn và nước uống.", "eng": "We cannot survive for long without food and drink."}, {"viet": "Chúng tôi không mang theo cái áo len nào hoặc thứ gì tương tự cả.", "eng": "We didn't take any sweaters or anything else."}, {"viet": "Chúng tôi bay từ London tới Bombay một mạch.", "eng": "We flew from London to Bombay in one hop."}, {"viet": "Chúng tôi đã suy tính lại việc mua ngôi nhà khi phát hiện ra giá của nó.", "eng": "We had second thoughts about buying the house when we discovered the price."}, {"viet": "Chúng tôi có món nướng sốt Pháp, rouquefort và nước sốt thập cẩm.", "eng": "We have French, Roquefort and thousand island dressing."}, {"viet": "Chúng tôi đi bộ việt dã đến những hồ lớn hơn.", "eng": "We hike to the larger lakes."}, {"viet": "Chúng tôi sẽ gửi bản sao vào chuyến thư tới.", "eng": "We'll send the duplicate by next mail."}, {"viet": "Chúng ta phải loại bỏ những con ruồi nguy hại này.", "eng": "We must get rid of these pestilent flies."}, {"viet": "Chúng tôi cần một nhà báo có tri thức chuyên môn và anh ấy đáp ứng nhu cầu đó.", "eng": "We needed a journalist with specialist knowledge, and he fitted the bill."}, {"viet": "Chúng tôi nhận được lời kể khá rời rạc về sự kiện đó.", "eng": "We received a rather fragmented account of the incident."}, {"viet": "Chẳng bao lâu nữa chúng ta phải được tin về cô ấy thôi.", "eng": "We should have news of her before long."}, {"viet": "Chúng tôi cố gắng giữ cái trung dung giữa làm việc quá căng và không làm gì cả.", "eng": "We try to strike a happy medium between working too hard and not working at all."}, {"viet": "Chúng tôi đều nóng lòng nghe tin anh đến nơi an toàn.", "eng": "We were anxious for news of your safe arrival."}, {"viet": "Chúng ta sẽ đến trong khoảng 3 tiếng nữa.", "eng": "We will arrive in about three hours."}, {"viet": "Được, Bob, những ngân hàng xưa nhất bắt đầu ở Babylon gần 4000 năm trước đây.", "eng": "Well, Bob, the earliest banks started in Babylon almost 4,000 years ago."}, {"viet": "À, Peter, bạn có thể học ở thư viện trường đại học.", "eng": "Well, Peter, you could work in the university library."}, {"viet": "Mức phải trả cho người giữ trẻ hiện nay là bao nhiêu?", "eng": "What's the going rate for baby-sitters?"}, {"viet": "Phận sự của một người quản lý giao thông là gì?", "eng": "What are the duties of a traffic warden?"}, {"viet": "Lúc bạn 12 tuổi bạn muốn trở thành gì?", "eng": "What did you want to be when you were 12 years old?"}, {"viet": "Những gì anh ta nói chẳng liên quan gì lắm đến vấn đề.", "eng": "What he said had not much bearing on the problem."}, {"viet": "Dân số của Mỹ là bao nhiêu?", "eng": "What is the population of the United States?"}, {"viet": "Điều gì khiến anh quyết định đi vào lĩnh vực máy vi tính?", "eng": "What made you decide to get into computers?"}, {"viet": "Bạn đang nhìn cái quái quỉ gì vậy?", "eng": "What the hell are you looking at?"}, {"viet": "Khi nào thì anh tính chuyện cưới vợ và ổn định cuộc sống?", "eng": "When are you going to marry and settle down?"}, {"viet": "Khi thầy giáo của nó kể cho ba mẹ nó nghe về hành vi của nó, nó cảm thấy rất xấu hổ.", "eng": "When his teacher told his parents about his behavior, he felt great shame."}, {"viet": "Khi cô ấy tình cờ nhắc đến ngày sinh của cô ấy, anh ta ghi nhớ ngay trong đầu ngày đó.", "eng": "When she mentioned her birthday casually, he made a mental note of it."}, {"viet": "Trận Waterloo vào năm nào?''Tháng sáu năm 1815'.", "eng": "When was the date of the Battle of Waterloo?''June 1815'."}, {"viet": "Tôi có thể có được một bản của cuốn sách mới nhất của bà ta ở đâu?", "eng": "Where can I obtain a copy of her latest book?"}, {"viet": "Cửa hàng bách hóa nào phục vụ các bà nội trợ?", "eng": "Which department store caters to housewives?"}, {"viet": "Trong khi châu Âu chìm trong Thời Kỳ Đen Tối, các nơi khác trên thế giới đang chuyển mình về phía trước.", "eng": "While Europe was in the Dark Ages, other parts of the world were moving forward."}, {"viet": "Vận động viên nổi tiếng nhất của nước bạn là ai?", "eng": "Who is your country's most famous athlete?"}, {"viet": "Tại sao cái máy tính không hoạt động được nữa?", "eng": "Why doesn't the calculator work any more?"}, {"viet": "Tôi sẽ được thông báo khi bạn tôi nhận được bức thư này chứ?", "eng": "Will I be informed when my friend gets the letter?"}, {"viet": "Ông vui lòng xem chúng đã đủ chưa ạ?", "eng": "Will you see if are all right?"}, {"viet": "Với các cơ căng thẳng, đợi cuộc đua bắt đầu.", "eng": "With muscles tensed, waiting for the race to start."}, {"viet": "Hoạt động cho sự hoà hợp trong các vấn đề quốc tế.", "eng": "Working towards harmony in international affairs."}, {"viet": "Ông muốn đi máy bay hãng American Airlines, Western, twa hay United?", "eng": "Would you like to fly American Airlines, Western, twa or United?"}, {"viet": "Cô vui lòng lấy cây viết ở trong túi của tôi ra nhé?", "eng": "Would you please take the pen from my pocket?"}, {"viet": "Có ạ, nhưng ông sẽ phải điền vào một phiếu mượn.", "eng": "Yes, but you will have to fill out a rental slip."}, {"viet": "Vâng, cô vui lòng tìm một phòng hội nghị giúp chúng tôi được không?", "eng": "Yes, would you please find a conference room for us?"}, {"viet": "Anh phải đạp nhanh lên nếu anh muốn đuổi kịp người khác.", "eng": "You'll have to pedal faster if you want to catch up with the others."}, {"viet": "Anh chắc chắn sẽ đỗ nếu anh tích cực học tập.", "eng": "You're sure of passing the exam if you work hard."}, {"viet": "Anh được lệnh phải thôi cái hành vi đó đi.", "eng": "You are ordered to desist from such behaviour."}, {"viet": "Anh không thể tưởng tượng được tôi vui mừng như thế nào được gặp anh!", "eng": "You can't think how glad I am to see you!"}, {"viet": "Anh có thể thấy nó say mê cô ta-suốt buổi liên hoan nó cứ quấn lấy cô ta.", "eng": "You can see he's infatuated by her-he was all over her at the party."}, {"viet": "Bạn không cần phải đến các trường Đại học Oxford và Cambridge mới có được trình độ giáo dục tốt ở cấp đại học.", "eng": "You don't have to go to Oxbridge to receive a good university education."}, {"viet": "Anh phải so quyết định của anh với quyết định của người khác.", "eng": "You have to measure your determination with that of other people."}, {"viet": "Có thể lúc đầu anh sẽ gặp khó khăn nhưng cứ tiếp tục anh sẽ thấy dễ dàng hơn.", "eng": "You may have some difficulty at first but you'll find it easier as you go along."}, {"viet": "Mỗi lần anh muốn mượn sách anh phải đưa thẻ thư viện của anh ra.", "eng": "You must present your library ticket every time you borrow books."}, {"viet": "Cháu sẽ đi bộ đến trường phải không?", "eng": "You're walking to school, aren't you?"}, {"viet": "Bà nên đi xe điện số 1 để đến đường Thanh Minh.", "eng": "You should take the number 1 tram to Qingming Road."}, {"viet": "Anh sẽ phải chịu trách nhiệm với tôi về bất cứ sự hư hỏng nào của chiếc xe.", "eng": "You will answer to me for any damage to the car."}, {"viet": "Lưng cậu có vẻ đau-quả thực hôm nay cậu bị cháy nắng đấy.", "eng": "Your back looks sore-you're really catch the sun today."}, {"viet": "Những lời hứa của anh đã không được thực hiện.", "eng": "Your promises have failed to materialize."}]