[{"viet": "Giảm 10 xu nếu ông dùng phiếu này.", "eng": "10p off if you use this coupon."}, {"viet": "Một tấm lịch trông thì rất đơn giản.", "eng": "A calendar looks very simple."}, {"viet": "Một điều khoản trong hợp đồng này quy định rằng bên thuê sẽ trả tiền sửa chữa tòa nhà.", "eng": "A clause in the agreement provides that the tenant shall pay for repairs to the building."}, {"viet": "Một đất nước sống trong mối hiểm họa triền miên của nạn đói.", "eng": "A country living under the constant threat of famine."}, {"viet": "Một sa mạc trải rộng hàng trăm dặm.", "eng": "A desert spreading for hundreds of miles."}, {"viet": "Trượt môn lịch sử, đỗ tất cả các môn khác.", "eng": "A fail in history and passes in everything else."}, {"viet": "Một công ty tập trung vào thị trường Châu Âu.", "eng": "A firm which concentrates on the European market."}, {"viet": "Chất men tráng là chất có khả năng cứng lại thành một lớp thủy tinh mỏng.", "eng": "A glaze is a substance that hardens into a thin layer of glass."}, {"viet": "Một người khách đến thăm ông Brown đến từ Mỹ.", "eng": "A guest has come to see Mr. Brown from the United States."}, {"viet": "Một ngôi nhà được xây bằng đá xám.", "eng": "A house built of grey stone."}, {"viet": "Một nhóm đông người từ Nhật Bản đã hiện diện tại hội nghị.", "eng": "A large contingent from Japan was present at the conference."}, {"viet": "Một sự khích lệ nhẹ nhàng có thể cần thiết ở giai đoạn này.", "eng": "A little gentle prodding may be necessary at this stage."}, {"viet": "Giọng nam thường trầm hơn giọng nữ.", "eng": "A man's voice is usually lower than a woman's."}, {"viet": "Chỉ một lúc suy xét sẽ cho anh thấy là anh sai lầm.", "eng": "A moment's reflection will show you are wrong."}, {"viet": "Một mốt mới về loại giày gót thấp.", "eng": "A new vogue for low heeled shoes."}, {"viet": "Một người lái xe ôtô đến nhờ chúng tôi giúp.", "eng": "A passing motorist came to our help."}, {"viet": "Một bộ com-lê vải sọc với một chiếc cà vạt đúng điệu trong giới kinh doanh.", "eng": "A pinstriped suit with a power tie."}, {"viet": "Một chất thuốc để che các vết nám da.", "eng": "A preparation to hide skin blemishes."}, {"viet": "Những cuộc đình công đột nhiên lan rộng trong ngành công nghiệp thép.", "eng": "A rash of strikes in the steel industry."}, {"viet": "Một căn phòng có trải thảm phủ hết sàn.", "eng": "A room carpeted wall-to-wall."}, {"viet": "Phải có một cái miệng sành ăn mới thưởng thức được món rượu ngon.", "eng": "A sensitive mouth is necessary to appreciate good wine."}, {"viet": "Hình một cái đầu lâu được vẽ lên tường.", "eng": "A skull was painted on the wall."}, {"viet": "Một bài diễn văn được sắp đặt khôn khéo nhằm kích động thính giả đến điên cuồng.", "eng": "A speech cleverly designed to lash the audience into a frenzy."}, {"viet": "Một cơ sở sự thật trong câu chuyện của bà ta.", "eng": "A substratum of truth in her story."}, {"viet": "Một lý thuyết không được thực tế chứng minh.", "eng": "A theory that is not supported by the facts."}, {"viet": "Một tấm mạng bằng loại vải the mỏng nhất.", "eng": "A veil spun of the finest gossamer."}, {"viet": "Một kẻ làm ra vẻ sành rượu chỉ uống những rượu ngon nhất.", "eng": "A wine snob who will only drink the best wines."}, {"viet": "Theo dự báo thời tiết thì tối nay trời sẽ mưa.", "eng": "According to the weather report, it's going to rain this evening."}, {"viet": "Các quảng cáo nhằm dụ người ta tiêu tiền.", "eng": "Advertisements are designed to entice people spending money."}, {"viet": "Sau cái chết của anh ấy, người chị mới sắp xếp lại các đồ dùng cá nhân của anh ấy.", "eng": "After his death his sister sorted through his personal belongings."}, {"viet": "Sau vụ rớt máy bay, các mảnh vỡ của chiếc máy bay văng tứ tung khắp một vùng rộng lớn.", "eng": "After the crash, debris from the plane was scattered over a large area."}, {"viet": "Nhân viên công ty hàng không có thể mua vé máy bay với giá hạ.", "eng": "Airline personnel can purchase flight tickets at reduced prices."}, {"viet": "Tất cả việc sửa chữa được thực hiện tại chỗ và không hợp đồng với bên ngoài.", "eng": "All repairs are done on the premises and not put out."}, {"viet": "Tất cả những lời đàm tiếu này đều nhằm vào Sarah-tai của cô ta hẳn là nổ tung lên mất!", "eng": "All this gossip about Sarah-her ears must be burning!"}, {"viet": "Những xe cứu thương lao nhanh với còi hụ vang.", "eng": "Ambulances racing along with sirens wailing."}, {"viet": "Một đơn kháng án không hợp lệ.", "eng": "An appeal that will not lie."}, {"viet": "Một trận đấu sôi động với nhiều pha hấp dẫn trước cửa khung thành.", "eng": "An exciting match with a lot of goal-mouth incidents."}, {"viet": "Một chiếc bình cổ không thể thay thế được, nó là một chiếc duy nhất thuộc loại này.", "eng": "An irreplaceable antique vase, the only one of its kind."}, {"viet": "Một sự cải thiện rõ ràng về sức khỏe của tôi.", "eng": "An undoubted improvement in my health."}, {"viet": "Ngoài ra, bà cứ tự nhiên nghỉ ngơi trong tiền sảnh.", "eng": "And you're welcome to rest in the lobby."}, {"viet": "Bất cứ điều gì hứa hẹn kiếm được quá nhiều tiền đều không thể không nguy hiểm.", "eng": "Anything that promises to pay too much can't help being risky."}, {"viet": "Có dấu hiệu tiến bộ nào không?", "eng": "Are there any signs of improvement?"}, {"viet": "Ông đến đây đi nghỉ hay là công tác?", "eng": "Are you here for a holiday or on business?"}, {"viet": "Sắp xếp lại kế hoạch của tôi cho thích hợp với kế hoạch của bạn.", "eng": "Arrange the accommodation of my plans to yours."}, {"viet": "Rất có thể nàng đã hoàn toàn quên điều đó.", "eng": "As likely as not she's forgotten all about it."}, {"viet": "Yêu cầu nhà xây dựng cho anh giá của công việc đó.", "eng": "Ask the builder to give you a price for the work."}, {"viet": "Rốt cuộc thì vị giám đốc mới cũng chẳng có gì hơn ông trước đây cả.", "eng": "At the end of the day the new manager is no better than the previous one."}, {"viet": "Trẻ sơ sinh thường hay quấy khi không có mẹ một bên.", "eng": "Babies often fret themselves when their mothers are not near."}, {"viet": "Phải quan tâm tới những người đi đường khác.", "eng": "Be considerate to other road-users."}, {"viet": "Bị thua trước một đội tệ nhất trong liên đoàn à?", "eng": "Beaten by the worst team in the league?"}, {"viet": "Ở dưới những cơ ngực đó có một trái tim đập.", "eng": "Beneath those pecs there beats a heart."}, {"viet": "Lao nhanh xuôi xuống xa lộ với tốc độ 90 dặm Anh một giờ.", "eng": "Bombing down the motorway at ninety miles an hour."}, {"viet": "Nhà xuất cảng hàng đầu của Anh về thiết bị khoan.", "eng": "Britain's premier exporter of drilling equipment."}, {"viet": "Nhưng tôi không thể nói chắc là nó có thể được tẩy sạch hay không.", "eng": "But I can't tell for sure if it can be completely removed."}, {"viet": "Nhưng những điều luật này dần dần được thay đổi trong thế kỷ thứ 14 và 15, và chức năng ngân hàng bắt đầu xuất hiện lại ở Ý và Bỉ và sau đó ở Pháp, đức và Anh.", "eng": "But these laws were gradually changed during the 14th and 15th centuries, and banking functions started appearing again in Italy and Belgium and later in France, Germany and England."}, {"viet": "Bằng một sự lường gạt nào đó hợp pháp-hoặc có lẽ bất hợp pháp-ông ta đã có thể tuyên bố cuộc bầu cử đó không có giá trị.", "eng": "By some perhaps legal-or illegal-jiggery-pokery, he could declare the election void."}, {"viet": "Bây giờ con có thể mặc lại quần jean được rồi chứ?", "eng": "Can I change back into my jeans now?"}, {"viet": "Chúng ta có thể làm cho họ tin là sản phẩm mới này sẽ giải quyết được vấn đề cho họ không?", "eng": "Can we convince them that the new product will solve it for them?"}, {"viet": "Anh có thể nới lỏng nắp lọ này ra không?", "eng": "Can you loose the lid of this jar?"}, {"viet": "Anh có thể với tay lên đụng đầu cửa được không?", "eng": "Can you touch the top of the door?"}, {"viet": "Một số tên trong quyển sách được gạch dưới toàn bộ.", "eng": "Certain names in the book were underlined throughout."}, {"viet": "Bọn trẻ con đang chơi bóng trong sân sau nhà.", "eng": "Children were playing ball in the yard at the back of the house."}, {"viet": "Phối hợp những động tác của mình khi bơi.", "eng": "Co-ordinate one's movements when swimming."}, {"viet": "Các nhà lãnh đạo công ty biết là những ngành công nghiệp của mình phải tiết kiệm thì mới tồn tại được.", "eng": "Company leaders know their industries must be lean to survive."}, {"viet": "Sự gián đoạn liên tục thì rất khó chịu khi bạn đang chú tâm làm việc.", "eng": "Constant interruptions are very aggravating when you're trying to work."}, {"viet": "Anh có thể cho tôi vài lời khuyên về cách giải quyết công việc đó không?", "eng": "Could you give me a few pointers on how to tackle the job?"}, {"viet": "Bao trùm toàn bộ phạm vi khả năng.", "eng": "Covering the whole spectrum of ability."}, {"viet": "Củi ướt không bắt lửa tốt.", "eng": "Damp wood doesn't burn well."}, {"viet": "Đám người biểu tình cố vượt qua hàng rào cảnh sát.", "eng": "Demonstrators tried to break through the police cordon."}, {"viet": "Đã làm tất cả điều đó vì thích tiếng khen.", "eng": "Did it all for the love of praise."}, {"viet": "Trường cấp ba có dạy bạn tiếng Nhật không?", "eng": "Did your senior high school offer Japanese language education?"}, {"viet": "Hãy dùng thêm một phần nữa đi-còn nhiều lắm.", "eng": "Do have a second helping-there's heaps more."}, {"viet": "Ở nước bạn, hầu như người ta luôn cho tiền boa ở nhà hàng phải không?", "eng": "Do you almost always give tips at restaurants in your country?"}, {"viet": "Ở nước bạn có một mùa mưa phải không?", "eng": "Do you have a rainy season in your country?"}, {"viet": "Bạn có biết tờ thời báo Nhật Bản tại nhà ga xe lửa giá bao nhiêu không?", "eng": "Do you know how much the Japan Times is at the train station?"}, {"viet": "Bạn có thanh toán các hóa đơn ở cửa hàng phục vụ 24/24 giờ không?", "eng": "Do you pay your bills at the convenience store?"}, {"viet": "Anh có cho rằng Đảng Bảo Thủ sẽ tái đắc cử không?", "eng": "Do you think the Tories will get re-elected?"}, {"viet": "Sự giam cầm làm được gì để ngăn chặn tội ác?", "eng": "Does prison do anything to prevent crime?"}, {"viet": "Đừng có ích kỷ như thế-ở trong nhà này phải ăn đồng chia đủ.", "eng": "Don't be so selfish-it's share and share alike in this house."}, {"viet": "Đừng gieo rắc hy vọng cho cô ta-anh thừa biết là lọt vào ngành điện ảnh khó khăn đến dường nào mà.", "eng": "Don't give her ideas-you know how difficult it is to get into films."}, {"viet": "Đừng có kéo mạnh những trang giấy đó như thế kẻo chúng bị rách.", "eng": "Don't pull the pages so hard or they will tear."}, {"viet": "Đừng có đánh giá thấp sự đóng góp của Jim vào việc nghiên cứu đó.", "eng": "Don't undervalue Jim's contribution to the research."}, {"viet": "Húp nước chè của mình xì xụp.", "eng": "Drink one's tea, sipping noisily."}, {"viet": "Dành một số tiền cho việc nghiên cứu.", "eng": "Earmark a sum of money for research."}, {"viet": "Khắc hoa văn lên một tấm kim loại.", "eng": "Engraving a design on a metal plate."}, {"viet": "Từng người một trong bọn họ bỏ chạy và bỏ rơi tôi.", "eng": "Every man jack of them ran off and left me."}, {"viet": "Xin lỗi, các vị có thể cho chúng tôi xem thực đơn được không?", "eng": "Excuse me, could you possibly let us see your menu?"}, {"viet": "Đã tỏ thái độ bình tĩnh khi đương đầu với cái chết.", "eng": "Faced the grave with calm resignation."}, {"viet": "Cảm thấy rất bất mãn khi mất việc làm của mình.", "eng": "Feel much aggrieved at losing one's job."}, {"viet": "Các đội chữa cháy từ chối băng qua hàng người ngăn chặn.", "eng": "Fire crews refused to cross the picket line."}, {"viet": "Tình trạng sức khoẻ thất thường của anh ta.", "eng": "Fluctuations in the state of his health."}, {"viet": "Trong hai năm qua, hàng ngàn người dân theo dõi sự tiến triển của việc xây dựng tòa nhà mới, mà nó đã trở thành một điểm mốc.", "eng": "For the past two years, the people of the city have been watching daily the progress of construction of the new building, which has already become a landmark."}, {"viet": "Từ một thủ thư bây giờ cô ta trở thành một nghị sĩ.", "eng": "From being a librarian she is now an MP."}, {"viet": "Thưa quý vị, tôi xin phép được giới thiệu ông Vương với quý vị?", "eng": "Gentlemen, may I have the pleasure of introducing Mr. Wang to you?"}, {"viet": "Hãy giúp mẹ rửa bát đi con.", "eng": "Give me a hand with a the washing-up."}, {"viet": "Đi bộ dọc theo khu vực bờ sông.", "eng": "Go for a walk along the riverside."}, {"viet": "Thừa nhận là đúng những điều do ai nói ra.", "eng": "Grant the truth of what somebody says."}, {"viet": "Sự làm việc cật lực là cách duy nhất để đạt được thành công trong kinh doanh.", "eng": "Hard graft is the only way to succeed in business."}, {"viet": "Bạn có tin gì về nơi hiện cô ấy đang ở không?", "eng": "Have you any news of where she is staying?"}, {"viet": "Em có thuốc sát trùng nào để xức chỗ vết đứt này không?", "eng": "Have you got any antiseptic for this cut?"}, {"viet": "Sau khi nói là bà ấy rất thích việc đó, bà chuyển sang phê bình cách thức tôi làm việc đó.", "eng": "Having said how much she liked it, she then proceeded to criticize the way I'd done it."}, {"viet": "Vào buổi sáng sớm, mắt ông ta bao giờ cũng lờ đờ.", "eng": "He's always bleary-eyed early in the morning."}, {"viet": "Lúc này ông ta đang giải quyết thư từ của ông ta.", "eng": "He's dealing with his post at the moment."}, {"viet": "Ông ta đã sút cân nhiều: so với trước đây, ông ta nhẹ đi ba kí lô.", "eng": "He's lost a lot of weight: he's three kilos lighter than he used to be."}, {"viet": "Một ông già như ông ta mà sôi nổi đến thế thì đáng ngạc nhiên thật.", "eng": "He's surprisingly sprightly for an old man."}, {"viet": "Anh ta luôn mang theo một chai rượu vang khi đi ăn cơm.", "eng": "He always brings a bottle of wine with him when he comes to dinner."}, {"viet": "Mới đầu anh ấy chơi rất xuất sắc nhưng trong những phút cuối thì chơi có phần kém đi.", "eng": "He began by playing brilliantly but he's rather gone off the boil in the last few minutes."}, {"viet": "Anh chàng tiến về phía tôi, mỉm cười và chìa tay ra.", "eng": "He came towards me, smiled and offered his hand."}, {"viet": "Anh ta xuất thân từ một gia đình tan vỡ.", "eng": "He comes from a broken home."}, {"viet": "Nó quả quyết là nó vô tội.", "eng": "He declared that he was innocent."}, {"viet": "Ông ta không theo cái khuôn mẫu thông thường của một nhà doanh nghiệp thành phố mặc bộ com-lê màu sẫm và cầm cái ô cuốn.", "eng": "He doesn't conform to the usual stereotype of the city businessman with a dark suit and rolled umbrella."}, {"viet": "Ông ta dùng hết ảnh hưởng của mình để khiến họ chấp nhận kế hoạch của ông ta.", "eng": "He exerted all his influence to make them accept his plan."}, {"viet": "Anh ta lôi một sợi dây dài ra khỏi túi.", "eng": "He fished a length of string out of his pocket."}, {"viet": "Anh ấy ra hiệu cho tôi biết đã đến lúc đi.", "eng": "He gestured to me that it was time to go."}, {"viet": "Hắn đã lừa gạt sở thuế nhiều năm nay.", "eng": "He had been cheating the taxman for years."}, {"viet": "Ông ta có một ngôi nhà ở Luân Đôn và một căn nhà nhỏ gần biển.", "eng": "He has a house in London and a cottage near the sea."}, {"viet": "Anh ấy có cơ sở làm ăn riêng và đi khắp thế giới.", "eng": "He has his own business and travels around the world."}, {"viet": "Khi nhận được lá thư đó, anh ấy ghét cô ta hơn lúc nào hết.", "eng": "He hated her more than ever, when he got that letter."}, {"viet": "Anh ấy nhất quyết phải thắng bằng bất cứ giá nào.", "eng": "He is bent on winning at all costs."}, {"viet": "Anh ta vẫn không thể diễn đạt được cảm nghĩ của mình bằng tiếng Anh.", "eng": "He is still unable to express himself in English."}, {"viet": "Anh ấy đá trái bóng xuống sông.", "eng": "He kicked the ball into the river."}, {"viet": "Anh ấy sống ở thôn quê.", "eng": "He lives right out in the country."}, {"viet": "Anh ta không giấu giếm quan điểm cực tả của mình.", "eng": "He made no bones about his extreme left-wing views."}, {"viet": "Nó đã quên viết thư và nói cám ơn.", "eng": "He neglected to write and say Thank you."}, {"viet": "Ông ta mồm thì nói bênh vực cho nữ giới nhưng vợ của ông ta vẫn phải làm tất cả việc nhà.", "eng": "He pays lip-service to feminism but his wife still does all the housework."}, {"viet": "Anh ta hứa ủng hộ cô ấy dù xảy ra thế nào chăng nữa.", "eng": "He promised to support her come what may."}, {"viet": "Anh ta đọc một đoạn về trồng lúa trong cuốn địa lý.", "eng": "He read a passage on rice farming from the geography book."}, {"viet": "Anh ấy cương quyết chống lại việc khởi hành sớm.", "eng": "He resolved against making an early start."}, {"viet": "Anh ấy là một người hoàn toàn tốt.", "eng": "He's a thoroughly nice person."}, {"viet": "Ông ấy càng ngày càng nghễnh ngãng lúc về già.", "eng": "He's getting deafer in his old age."}, {"viet": "Hắn không ốm-đúng ra hắn hơi phục phịch là đằng khác.", "eng": "He's not thin-if anything he rather on the plumb size."}, {"viet": "Anh ta nói không có thì giờ hoặc viện ra một cái cớ nào đó đại loại như thế.", "eng": "He said he hadn't got time or made some such excuse."}, {"viet": "Anh ấy dường như hơi miễn cưỡng ra đi.", "eng": "He seemed somewhat loath to depart."}, {"viet": "Ông ấy đã xuất hiện trong chốc lát ở bữa tiệc.", "eng": "He showed himself briefly at the party."}, {"viet": "Anh ta trải qua vài năm dưới sự chỉ dẫn của một huấn luyện viên Úc hàng đầu về quần vợt.", "eng": "He spent several years under the wing of a top Australian tennis coach."}, {"viet": "Anh ta đứng run rẩy ở bờ nước sâu để chờ nhào xuống.", "eng": "He stood shivering on the brink, waiting to dive in."}, {"viet": "Nó khoái chí cực kỳ khi chứng minh người khác sai.", "eng": "He takes great delight in proving others wrong."}, {"viet": "Ông ta coi thường đề nghị của tôi.", "eng": "He took a dim view of my suggestion."}, {"viet": "Anh ta cố làm cho tôi tin lá thư kể chuyện mất ví tiền của anh ta.", "eng": "He tried to sell me a line about losing his wallet."}, {"viet": "Anh ta nói dông dài hàng giờ mà chẳng ai nghe.", "eng": "He waffled on for hours but no one was listening."}, {"viet": "Anh ấy mệt lử sau một ngày ở chỗ xây nhà.", "eng": "He was all in after a day on the building site."}, {"viet": "Nó xách một cái hộp bự tổ chảng.", "eng": "He was carrying a dirty great box."}, {"viet": "Ông ta được miễn vì lý do tuổi tác.", "eng": "He was excused by reason of his age."}, {"viet": "Hắn bị giết bằng một viên đạn duy nhất trúng vào tim.", "eng": "He was killed by a single bullet in the heart."}, {"viet": "Khi lên tới đỉnh đồi anh ta thở hổn hển.", "eng": "He was panting when he reached the top of the hill."}, {"viet": "Anh ta đã sớm thức tỉnh khỏi giấc mộng làm giàu.", "eng": "He was soon awakened from his dream of getting rich."}, {"viet": "Ông ta hoàn toàn vô lương tâm trong việc làm ăn với các với công ty đối thủ.", "eng": "He was utterly unscrupulous in his dealings with rival firms."}, {"viet": "Hắn xoay tít cô bạn nhảy trên sàn nhẩy.", "eng": "He whirled his partner round the dance floor."}, {"viet": "Ông ta khai thác vùng Bắc xứ Wales.", "eng": "He works the North Wales area."}, {"viet": "Đánh nước đôi bằng cách đánh cuộc cả hai đội đều thắng.", "eng": "Hedge one's bets by backing both teams to win the game."}, {"viet": "Sắc đẹp của nàng mờ nhạt đi bên cạnh mẹ nàng.", "eng": "Her beauty pales beside her mother's."}, {"viet": "Tham vọng bao trùm của cô ấy là trở thành một nhà văn nổi tiếng.", "eng": "Her crowning ambition was to become a famous writer."}, {"viet": "Tiếng tăm của cô ta đã truyền tới những nơi xa xôi nhất trên địa cầu.", "eng": "Her fame has reached the most far-flung corners of the globe."}, {"viet": "Sự giúp đỡ của cô ta đã rất quan trọng trong lúc cấp bách đó.", "eng": "Her help was critical during the emergency."}, {"viet": "Cô ta thoát chết nhờ một phép lạ.", "eng": "Her life was saved by a miracle."}, {"viet": "Cơn thịnh nộ của bà ta hầu như chính đáng.", "eng": "Her outburst of rage was hardly seemly."}, {"viet": "Được tiếng là một người mẹ tốt rất có lợi cho chị ấy.", "eng": "Her reputation as a good mother speaks well for her."}, {"viet": "Việc ra đi bất ngờ của cô ấy làm đảo lộn các kế hoạch của tôi.", "eng": "Her sudden departure has disarranged my plans."}, {"viet": "Vấn đề của cậu đấy, đường nhiên liệu bị tắc.", "eng": "Here's your problem, the fuel line's all gunked up."}, {"viet": "Giọng của anh ta lè nhè anh thấy rất rõ-tôi khó có thể hiểu điều anh ta nói.", "eng": "His accent is so thick you could cut it with a knife-I can hardly understand a word he says."}, {"viet": "Cách cư xử của ông ta cuối cùng đã khiến cô ấy bỏ ông ta.", "eng": "His behaviour finally provoked her into leaving him."}, {"viet": "Lời bình của ông khi nghe được tin ấy không thích hợp để in.", "eng": "His comment when he heard the news was not printable."}, {"viet": "Những kẻ thù của ông ta đã cố gắng chứng tỏ là ông ta có dính líu vào vụ sát nhân.", "eng": "His enemies tried to implicate him in the murder."}, {"viet": "Buổi biểu diễn đầu tiên của anh ta là một thảm bại: khán giả la ó đuổi anh ta rời khỏi sân khấu.", "eng": "His first performance was a débâcle: the audience booed him off the stage."}, {"viet": "Các ý kiến của hắn về vấn đề này hơi mơ hồ.", "eng": "His ideas on this subject are a bit foggy."}, {"viet": "Môi của anh ta có màu tím và má của anh ta tái xanh bởi vì không có tia màu đỏ nào đập vào chúng để được phản chiếu.", "eng": "His lips are purple and his cheeks bluish because no red rays are reaching them to be reflected."}, {"viet": "Nỗi băn khoăn liên tục của anh ta về việc giữ bí mật tác phẩm của mình.", "eng": "His obsessive secrecy about his work."}, {"viet": "Những hành động riêng tư của ông ta mâu thuẫn hoàn toàn với những ý kiến ông ta phát biểu công khai.", "eng": "His private actions are in direct contradiction with his publicly expressed opinions."}, {"viet": "Lời đe dọa độc ác của hắn làm ai nghe cũng ớn lạnh.", "eng": "His sinister threat chilled all who heard it."}, {"viet": "Ý nghĩ của anh ta cứ luẩn quẩn với những sự kiện mới đây ở Ấn Độ.", "eng": "His thoughts kept running on recent events in India."}, {"viet": "Tác phẩm của anh ta thì đúng đắn nhưng hoàn toàn thiếu óc tưởng tượng.", "eng": "His work is sound but totally unimaginative."}, {"viet": "Anh yêu, nếu anh đi ra ngoài anh có thể mua một lít nước tương được chứ?", "eng": "Honey, would you pick up some soy sauce if you are going out?"}, {"viet": "Anh lo liệu về tiền bạc, thức ăn, thời gian v. v. như thế nào rồi?", "eng": "How are you fixed for money, food, time, etc?"}, {"viet": "Làm thế nào mà cô ta vào nghề người mẫu?", "eng": "How did she get into the modeling racket?"}, {"viet": "Bây giờ ông ta về hưu rồi, ông ta làm gì cho hết thời gian?", "eng": "How does he occupy himself now he's retired?"}, {"viet": "Phải mất bao lâu tôi mới bình phục?", "eng": "How long will it take before I recover?"}, {"viet": "Các anh chị có tất cả bao nhiêu hành lí?", "eng": "How many pieces of baggage do you have between you?"}, {"viet": "Thời tiết nóng nực này còn tiếp tục bao lâu nữa?", "eng": "How much longer will this hot weather go on?"}, {"viet": "Tuy vậy, giá thành sẽ lên rất cao.", "eng": "However, the cost will be extremely high."}, {"viet": "Chính tôi cũng nghe một cái gì đại loại như thế.", "eng": "I'd heard something of the kind myself."}, {"viet": "Tôi thích đi xem hát tối nay nhưng tôi rất bận.", "eng": "I'd love to go to the theatre tonight, but I'm too busy."}, {"viet": "Tôi cho anh suy nghĩ kỹ cho đến mai.", "eng": "I'll give you till tomorrow to chew it over."}, {"viet": "Tôi sẽ gởi cho anh vài ý tưởng về việc chúng tôi sẽ làm việc ra sao, và những điều chúng tôi có thể cung cấp cho khách hàng.", "eng": "I'll send you some ideas of how we would work, and what we could offer a customer."}, {"viet": "Tôi e rằng những rắc rối này chỉ mới là một sự kiện mở màn.", "eng": "I'm afraid that these troubles are just a prelude."}, {"viet": "Tôi sẽ đi tản bộ để hít thở không khí trong lành.", "eng": "I'm going for a walk to get some fresh air."}, {"viet": "Tôi đang tìm việc, và tôi đặc biệt quan tâm đến công ty của ông.", "eng": "I'm looking for employment, and I'm specially interested in your company."}, {"viet": "Tôi đang gánh chịu hậu quả vì đã quá chén đêm qua, tôi bị nhức đầu khủng khiếp!", "eng": "I'm paying the penalty for drinking too much last night, I've got a dreadful headache!"}, {"viet": "Ngày mốt anh sẽ bắt đầu chế độ ăn uống mới.", "eng": "I'm starting a new diet the day after tomorrow."}, {"viet": "Tôi quen dùng loại chất lượng hảo hạng và sẽ không lấy loại hạng hai.", "eng": "I'm used to high quality and won't take second-best."}, {"viet": "Tôi đã bóp óc để ( cố ) nhớ lại tên anh ta.", "eng": "I've been racking my brains ( trying ) to remember his name."}, {"viet": "Tôi phải lựa chọn giữa hai việc làm.", "eng": "I've got to make a choice between the two jobs."}, {"viet": "Suốt cả tuần mình chẳng thấy tăm hơi của cậu ta ở đâu.", "eng": "I've not seen hide nor hair of him all week."}, {"viet": "Tôi phục cái cách cô ấy nhún vai.", "eng": "I admire the way she is able to shrug off unfair criticism."}, {"viet": "Tôi rất mừng là anh ta đã chấp nhận quan điểm đó.", "eng": "I am delighted that he should take that view."}, {"viet": "Tôi kêu gọi mọi người có cùng suy nghĩ hãy ủng hộ tôi.", "eng": "I appeal to all like-minded people to support me."}, {"viet": "Tôi cuộc là anh ta có nhúng tay vào việc đó.", "eng": "I bet he had a hand in it."}, {"viet": "Tôi không thể tập trung vào công việc khi tôi đói.", "eng": "I can't concentrate on my work when I'm hungry."}, {"viet": "Tôi không thể gặp anh vào thứ hai được vì tôi đã có hẹn trước đó.", "eng": "I can't see you on Monday because I have a previous engagement."}, {"viet": "Tôi chỉ có thể mang hai cái cùng một lúc.", "eng": "I can only carry two at a time."}, {"viet": "Tôi không thể đọc được chữ viết ngoáy này.", "eng": "I can't read this scribble."}, {"viet": "Tôi vừa nhìn thấy được một hình người trong bóng tối.", "eng": "I could just make out a figure in the darkness."}, {"viet": "Vui lòng cho tôi gửi bưu kiện này.", "eng": "I'd like this parcel sent, please."}, {"viet": "Tôi không thích việc anh ta nhận tất cả công lao.", "eng": "I didn't like his taking all the credit."}, {"viet": "Tôi không phủ nhận rằng anh đang nói thật.", "eng": "I don't deny but that you're telling the truth."}, {"viet": "Tôi không thích chuyện đó, nhưng tôi sẽ cho qua.", "eng": "I don't like it, but I'll let it pass."}, {"viet": "Tôi không hiểu tường tận cái hay của trò chơi bi-a, nhưng tôi thích xem nó trên truyền hình.", "eng": "I don't understand the finer points of snooker but I enjoy watching it on TV."}, {"viet": "Em chẳng trang điểm chút nào cả.", "eng": "I don't have any make-up on."}, {"viet": "Tôi đã gặp rất nhiều khó khăn khi mới bắt đầu làm công việc này.", "eng": "I encountered many difficulties when I first started this job."}, {"viet": "Tôi ngủ trên tàu và tới Glasgow.", "eng": "I fell asleep on the train and fetched up in Glasgow."}, {"viet": "Tôi chợt thấy một tờ 5 bảng Anh trên lề đường.", "eng": "I found a £ 5 note on the pavement."}, {"viet": "Tôi bị điểm B trừ trong bài kiểm tra.", "eng": "I got B minus in the test."}, {"viet": "Tôi đã có thời gian lưu trú rất dễ chịu.", "eng": "I had a very pleasant stay."}, {"viet": "Tôi tình cờ đi ngang qua, nên tôi tạt vào thăm bạn.", "eng": "I happened to be passing, so I dropped in."}, {"viet": "Tôi đã có quá đủ rắc rối trong cuộc sống rồi, đâu còn có thể chăm lo cho các con vật cưng của cô bị ốm nữa!", "eng": "I have enough complication in my life without having to look after your sick pets!"}, {"viet": "Tôi ít khi thấy sự tàn ác như thế.", "eng": "I have seldom seen such brutality."}, {"viet": "Tôi không có thì giờ để thu xếp mọi việc, vì vậy cứ hỗn độn lung tung cả.", "eng": "I haven't had time to arrange everything, so I'm all at sixes and sevens."}, {"viet": "Tôi nghe thấy vài tiếng động rất khả nghi trong vườn.", "eng": "I heard some very queer noises in the garden."}, {"viet": "Tôi mong anh dành cho tôi quyền ưu tiên mua căn nhà của anh khi nào anh quyết định bán.", "eng": "I hope you'll give me the first refusal on your house if you ever decide to sell it."}, {"viet": "Tôi giữ các quyển sách tham khảo của mình gần chỗ bàn viết để tiện dùng.", "eng": "I keep my reference books near my desk for convenience."}, {"viet": "Tôi đã bỏ túi xách của tôi trên xe lửa.", "eng": "I left my bag on the train."}, {"viet": "Hiện nay tôi sống ở đây nhưng tôi không hiểu ban đầu là ai sống.", "eng": "I lived here now but I wonder who lived here originally."}, {"viet": "Tối nay tôi sẽ thay đổi.", "eng": "I'll have a change tonight."}, {"viet": "Tôi rất ghét phải đi đến những cuộc hội nghị như thế.", "eng": "I loathe having to go to these conferences."}, {"viet": "Cháu 14 tuổi, còn anh ấy 16 tuổi.", "eng": "I'm fourteen and he's sixteen."}, {"viet": "Tôi chơi quần vợt không khá lắm.", "eng": "I'm not much good at tennis."}, {"viet": "Mang khăn tắm theo con thấy xấu hổ lắm.", "eng": "I'm too embarrassed to take a towel."}, {"viet": "Tôi hoàn toàn ý thức được việc đến nước này, vì vậy tôi không phàn nàn gì.", "eng": "I moved to this country with my eyes open, so I'm not complaining."}, {"viet": "Tôi cần một quyển từ điển tiếng Pháp mới Tôi có thể tham khảo ý kiến của anh về cuốn tốt nhất để mua được không?", "eng": "I need a new French dictionary Can I pick your brains about the best one to buy?"}, {"viet": "Tôi phản đối vì nó quá trẻ không thể làm được công việc này.", "eng": "I objected that he was too young for the job."}, {"viet": "Tôi thích trao đổi trực tiếp với ông ta hơn.", "eng": "I prefer to deal with him direct."}, {"viet": "Thật sự tôi không biết phải nói gì.", "eng": "I really don't know what to say."}, {"viet": "Tôi thuật lại cách thức ông ta đã phản ứng.", "eng": "I reported how he had reacted."}, {"viet": "Tôi nhận thấy Anh quốc đã chơi giỏi trong cuộc thi ném đĩa.", "eng": "I see Britain did well in the discus."}, {"viet": "Tôi muốn đến lại đó trong tương lai gần.", "eng": "I should like to go there again in the near future."}, {"viet": "Tôi dừng ôtô lại nhưng vẫn để nổ máy.", "eng": "I stopped the car but left the motor ticking over."}, {"viet": "Tôi cho rằng ông ta có phần thích thú với ý kiến đó.", "eng": "I think he's rather taken with the idea."}, {"viet": "Tôi nghĩ cô ấy uống thuốc ngủ vì biết mẹ mình sẽ phát hiện kịp thời, đó chỉ là chuyện làm để doạ.", "eng": "I think she took the pills knowing her mother would find her in time, it was just a cry for help."}, {"viet": "Tôi cứ nghĩ nó sai lầm nhưng rốt cuộc là đúng.", "eng": "I thought it was a mistake but it was right after all."}, {"viet": "Tôi cố ngăn cô ấy bỏ việc.", "eng": "I tried to prevent her from leaving her job."}, {"viet": "Tôi đã nghe danh tiếng của ông.", "eng": "I've heard of your reputation."}, {"viet": "Tôi muốn về nhà! Hả? Tôi bảo là tôi muốn về nhà!", "eng": "I want to go home! Eh? I said I want to go home!"}, {"viet": "Lúc nào tôi cũng là một người khiêu vũ vụng về.", "eng": "I was always an awkward dancer."}, {"viet": "Tôi đã hy vọng về một cuộc tình lâu dài, chứ đâu phải chỉ quan hệ một đêm.", "eng": "I was hoping for a lasting affair, not just a one-night stand."}, {"viet": "Tôi ngạc nhiên đến mức phải tự véo vào mình để chắc rằng đó chỉ là một giấc mơ.", "eng": "I was so amazed I had to pinch myself in case it was all a dream."}, {"viet": "Tôi không hoảng sợ trước những điều ông ta nói-đó chỉ là lời doạ hão thôi.", "eng": "I wasn't frightened by what be said-it was just bluster."}, {"viet": "Tôi ước ao không có nhiều việc phải làm đến như thế, cô ta thở dài nói.", "eng": "I wish I didn't have so much to do, she sighed."}, {"viet": "Tôi không biết cô có nhận chi phiếu du lịch hay không.", "eng": "I wonder if you accept traveller's checks."}, {"viet": "Tôi muốn loại nào đó có chiều rộng.", "eng": "I would like something with a wide width."}, {"viet": "Tôi không thể tin tưởng ngồi vào chiếc xe do Kevin lái, anh ta có hành động khùng khùng.", "eng": "I wouldn't depend on a ride from Kevin, he is a real flake."}, {"viet": "Nếu tao bắt được mày ăn cắp nữa, tao sẽ đánh cho tối tăm mặt mày.", "eng": "If catch your stealing again, I'll beat the daylight out of you!"}, {"viet": "Nếu là anh, tôi sẽ đi tìm một công việc khác.", "eng": "If I were you I'd start looking for another job."}, {"viet": "Nếu thời tiết khá hơn, chúng ta có thể đi dạo.", "eng": "If the weather gets better we could go out for a walk."}, {"viet": "Nếu bạn bị ra máu bạn nên đến gặp một bác sĩ.", "eng": "If you're passing blood, you ought to see a doctor."}, {"viet": "Nếu bạn không dùng lưới đậy đậu thì chim sẽ ăn chúng hết.", "eng": "If you don't net your peas, the birds will eat them."}, {"viet": "Nếu bây giờ anh trả tiền cho cả hai đứa chúng tôi thì chúng tôi có thể thanh toán với nhau sau.", "eng": "If you pay for both of us now, we can settle up later."}, {"viet": "Nếu ông muốn đưa đơn khiếu nại, ông nên liên hệ với giám đốc.", "eng": "If you wish to lodge a complaint you'd better get on to the manager."}, {"viet": "Những người du hành thời cổ đã kể nhiều câu chuyện hoang đường về Biển Chết.", "eng": "In ancient times travellers told many wild stories about the Dead Sea."}, {"viet": "Trong he doesn't know but I do, do là thành phần có nhiệm vụ thay thế.", "eng": "In he doesn't know but I do, do is substitute."}, {"viet": "Trong những năm gần đây đã có nhiều sự thay đổi.", "eng": "In recent years there have been many changes."}, {"viet": "Trong bóng tối tăng dần của một chiều đông.", "eng": "In the gathering gloom of a winter's afternoon."}, {"viet": "Trong những lúc khủng hoảng, có một người bạn để trông cậy là một điều tốt lành.", "eng": "In times of crisis it's good to have a friend to turn to."}, {"viet": "Bị các đài phát thanh lậu phá rối việc thu sóng.", "eng": "Interference with radio reception caused by pirates."}, {"viet": "Có phải Quốc hội làm việc cả mùa hè không?", "eng": "Is Parliament in session during the summer?"}, {"viet": "Tôi hỏi Có chuyện gì không ổn à?", "eng": "Is there anything wrong? I asked?"}, {"viet": "Đây là một câu chuyện cảnh giác để đừng mua máy tính.", "eng": "It's a cautionary tale about how not to buy a computer."}, {"viet": "Anh ta thật là kiêu căng khi cho rằng lần nào anh ta cũng sẽ thắng.", "eng": "It's arrogant of him to assume he'll win every time."}, {"viet": "Lúc này khó mà tìm được một căn hộ đẹp.", "eng": "It's getting difficult to find a nice apartment these days."}, {"viet": "Trước kỳ thi cảm thấy run là chuyện bình thường.", "eng": "It's natural ti feel nervous before an exam."}, {"viet": "Tôi chẳng ngạc nhiên gì khi biết cái đó đã được mua bằng tiền ăn cắp.", "eng": "It's paid for with stolen money, I shouldn't wonder."}, {"viet": "Đã đến lúc chúng ta giãi bày với nhau về công việc của anh.", "eng": "It's time we had a heart-to-heart chat about your work."}, {"viet": "Có thể là trái cây, kem hoặc bánh nướng.", "eng": "It can be fruit, ice-cream or pie."}, {"viet": "Thật ngược đời là một nước giàu có như thế lại có nhiều người nghèo khổ đến như vậy.", "eng": "It is a paradox that such a rich country should have so many poor people living in it."}, {"viet": "Phổ biến những lời tai tiếng về người khác là hèn hạ.", "eng": "It is mean to spread gossip about others."}, {"viet": "Phân biệt đối xử giữa những con người theo lý lịch gia đình của họ là sai.", "eng": "It is wrong to differentiate between people according to their family background."}, {"viet": "Để rồi xem liệu anh có đúng không.", "eng": "It remains to be seen whether you are right."}, {"viet": "Đó là bệnh viện Saint Paul.", "eng": "It's Saint Paul's Hospital."}, {"viet": "Mọi chuyện vẫn như vậy mà, không phải như vậy sao?", "eng": "It still is, isn't it?"}, {"viet": "Thật quá chật chội nhưng cuối cùng chúng tôi cũng xếp được hết quần áo vào va li.", "eng": "It was a tight squeeze but we finally got all the clothes into the case."}, {"viet": "Chỉ có thể phân biệt được túp lều trên sườn núi.", "eng": "It was just possible to pick out the hut on the side of the mountain."}, {"viet": "Bị phạt trước cả lớp thật là mất phẩm giá.", "eng": "It was very degrading to be punished in front of the whole class."}, {"viet": "Có biết được anh ta đang ở đâu tôi mới yên tâm được.", "eng": "It would ease my mind to know where he was."}, {"viet": "Việc làm, tiền hưu trí và nhà ở là những vấn đề căn bản của chính trị.", "eng": "Jobs, pensions and housing are the bread-and-butter issues of politics."}, {"viet": "Hãy quăng mọi thứ ra kia-tí nữa tôi sẽ phân loại sau.", "eng": "Just dump everything over there-I'll sort it out later."}, {"viet": "Cuộc tranh cãi năm ngoái, nay đã là nước chảy qua cầu rồi.", "eng": "Last year's dispute is water under the bridge now."}, {"viet": "Cho xem giấy đăng kí xe.", "eng": "Let me see the car registration."}, {"viet": "Hãy nhìn vào bản đồ, và anh sẽ thấy rằng có ba đỉnh chính trong số 72 đỉnh ở Hoàng Sơn.", "eng": "Look at the map, and you'll see that there are three major peaks of the 72 peaks in Huangshan."}, {"viet": "Nhiều người coi loại phim này không thú vị.", "eng": "Many people find this kind of film unpleasant."}, {"viet": "Marry lại bắt đầu học kỳ mùa thu ở trường đại học.", "eng": "Mary starts college again fall term."}, {"viet": "Cho tôi được đề nghị là chúng ta tiến hành theo trình tự và trước hết là xem xét chiến dịch được đề xuất?", "eng": "May I suggest that we proceed in order and take a look at the proposed campaign first?"}, {"viet": "Hầu hết súc vật lúc mới sinh đều có lông tơ.", "eng": "Most animals are soft and fluffy when first born."}, {"viet": "Thưa ông Palmer, ngân phiếu đô la của ông được đổi thành số tiền nhân dân tệ này.", "eng": "Mr. Palmer, your dollar cheque is changed into this sum of RMB Yuan."}, {"viet": "Ông chủ tôi nói thẳng rằng tôi không thể ra đi sớm được.", "eng": "My boss told me flat that I could not leave early."}, {"viet": "Những ngón tay tôi đang bắt đầu đau nhức sau khi đụng vào chỗ hồ dán đó.", "eng": "My fingers are beginning to prick after touching that paste."}, {"viet": "Phương châm của tôi là:'Cuộc sống thế nào chấp nhận thế nấy'.", "eng": "My motto is:'Live each day as it comes."}, {"viet": "Chú tôi đã trở thành một người khá quen thuộc ở câu lạc bộ.", "eng": "My uncle has become quite an institution at the club."}, {"viet": "Luật mới sẽ được đưa ra để giúp các gia đình chỉ có bố hoặc mẹ.", "eng": "New legislation is to be introduced to help single-parent families."}, {"viet": "Không, tôi chào đời trong thành phố.", "eng": "No, I was born in the city."}, {"viet": "Người ta không ngại phiền gì miễn sao đảm bảo cho chúng tôi được tiện nghi thoải mái.", "eng": "No trouble was spared to ensure our comfort."}, {"viet": "Cứ khóc lóc mãi thế này để làm gì chứ?", "eng": "Now then, what's all this crying in aid of?"}, {"viet": "Ồ, tôi biết anh cảm thấy thế nào rồi.", "eng": "Oh, I know how you feel."}, {"viet": "Người già không thể tích cực như người trẻ.", "eng": "Old people cannot be so active as young people."}, {"viet": "Người ta không thể tự mình làm quen hoàn toàn với sự chỉ trích hiểm độc như vậy.", "eng": "One cannot inure oneself altogether to such malicious criticism."}, {"viet": "Có một điều xác thực là chúng ta đã giành được một thắng lợi lớn!", "eng": "One thing is sure, we've won a great victory!"}, {"viet": "Giám đốc của chúng tôi đang nằm viện, nhưng quyền giám đốc có thể gặp anh.", "eng": "Our director is in hospital, but the acting director can see you."}, {"viet": "Cuộc gặp gỡ của chúng ta là ngẫu nhiên và tuyệt nhiên không bố trí sẵn.", "eng": "Our meeting was fortuitous and quite unarranged."}, {"viet": "Chuyến đi của chúng ta bắt đầu vào ngày 21 tháng 7 và kết thúc vào ngày 27.", "eng": "Our trip starts on the 21st of July and finishes on the 27th."}, {"viet": "Những phần của hiệp ước cũ được hợp nhất trong hiệp ước mới.", "eng": "Parts of the old treaty are embodied in the new one."}, {"viet": "Những người bị bệnh đái đường phải chích in-su-lin, bởi vì cơ thể của họ không thể tự tạo ra chất này.", "eng": "People suffering from diabetes have to have insulin injections, because they cannot produce their own."}, {"viet": "Làm ơn đừng hút thuốc khi có biển báo cấm hút thuốc.", "eng": "Please refrain from smoking while the no-smoking sign is on."}, {"viet": "Hoãn thi hành một kế hoạch để sử dụng về sau.", "eng": "Put a plan idea into cold storage."}, {"viet": "Các nhà khoa học đã dùng máy tính để tính khả năng bay của tên lửa.", "eng": "Scientists have computed the probable course of the rocket."}, {"viet": "Chúng ta đi lấy hành lý của ông nhé?", "eng": "Shall we go and see about your luggage?"}, {"viet": "Bà ta luôn luôn là một người quan tâm đến tình hình chính trị.", "eng": "She's always been a political aware person."}, {"viet": "Cô ta say mê yêu thuật và siêu nhiên.", "eng": "She's fascinated by black magic and the occult."}, {"viet": "Cô ta xinh đẹp-song cần phải mạnh dạn hơn.", "eng": "She's nice-but needs a lot of bringing out."}, {"viet": "Cô ta giống mẹ như đúc.", "eng": "She's the spitting image of her mother."}, {"viet": "Cô ta bao giờ cũng phí sức vào việc đó-tôi chỉ cần nửa thời gian là làm được!", "eng": "She always makes such a meal of it-I could do it in half the time!"}, {"viet": "Cô ta bước vào phòng và đóng cửa lại.", "eng": "She came into the room and shut the door."}, {"viet": "Cô ta chỉ có thể nói khàn khàn vì bị cảm nặng.", "eng": "She could only croak because of her heavy cold."}, {"viet": "Cô ấy không nói thẳng tên ông Smith nhưng rõ ràng là cô ấy ám chỉ ông ta.", "eng": "She didn't mention Mr Smith by name but it was clear she was alluding to him."}, {"viet": "Cô ấy đối phó với một loạt câu hỏi.", "eng": "She faced a battery of questions."}, {"viet": "Cô ấy kể quá phóng đại tô màu về các chuyến du lịch của cô ấy.", "eng": "She gave a highly coloured account of her travels."}, {"viet": "Cô ta có cảm giác mình đang bị theo dõi.", "eng": "She had a feeling that she was being watched."}, {"viet": "Cô bé có cá tính rõ rệt dù chỉ lên bốn.", "eng": "She has a distinct identity even though she is only four years old."}, {"viet": "Cô ấy hát vai nhân vật chính trong vở'Carmen'.", "eng": "She has sung the title-role in'Carmen'."}, {"viet": "Cô ấy luôn luôn đúng giờ nhưng bạn cô ấy luôn luôn đến muộn.", "eng": "She is always punctual, but her friend is always late."}, {"viet": "Chị ấy rất khiêm tốn về các giải thưởng chị ấy giành được.", "eng": "She is very modest about the prizes she has won."}, {"viet": "Cô ta nấn ná ở ngoài trường sau khi tất cả những người khác đã về nhà.", "eng": "She lingered outside the school after everyone else had gone home."}, {"viet": "Cô ta nói lên vài nhận xét về thời tiết.", "eng": "She made one or two observations about the weather."}, {"viet": "Cô ta thường dành một giờ để chải chuốt trước khi đi phố.", "eng": "She often spends an hour titivating before going out."}, {"viet": "Cô ấy tuyên bố là không biết gì về những ý định của họ.", "eng": "She professed ignorance of their intentions."}, {"viet": "Cô ta quyết định không bao giờ gặp lại hắn nữa.", "eng": "She resolved that she would never see him again."}, {"viet": "Bà ấy đã nhận lại được công việc cũ.", "eng": "She's got her old job back."}, {"viet": "Bà ta nói rằng chẳng có gì bị mất trộm cả, song đó chỉ là một sự giấu giếm.", "eng": "She said nothing was stolen, but that's just a cover-up."}, {"viet": "Cô ấy bày các quân lên bàn cờ.", "eng": "She set out the pieces on the chess-board."}, {"viet": "Bài phát biểu của bà ấy vang giọng khuyến cáo.", "eng": "She sounded a note of warning in her speech."}, {"viet": "Chị ấy giúp đỡ chồng tiền cô ấy kiếm được do dạy học.", "eng": "She supports her husband on the money she earns from teaching."}, {"viet": "Cô ta cần ba cú đánh nhẹ từ rìa sân cỏ để đưa bóng vào lỗ.", "eng": "She took three putts from the edge of the green."}, {"viet": "Cô ấy dễ dàng đoạt được các giải thưởng về toán và khoa học của nhà trường.", "eng": "She waltzed off with the school prizes for maths and science."}, {"viet": "Bà ta xấu hổ vì cách cư xử ( xấu ) của các con bà.", "eng": "She was ashamed of her children's ( bad ) behaviour."}, {"viet": "Cô ấy đã bị cấm vào câu lạc bộ.", "eng": "She was forbidden access to the club."}, {"viet": "Cô ấy hết sức xin lỗi khi cô ấy nghe thấy tôi đã phải đợi.", "eng": "She was most apologetic when she heard I had been kept waiting."}, {"viet": "Cô ấy quá hồi hộp đến nỗi khó diễn đạt được ý kiến của mình.", "eng": "She was so excited that she had difficulty in articulating her ideas."}, {"viet": "Cô ta bực mình vì tiếng ồn không ngớt.", "eng": "She was wearied by the constant noise."}, {"viet": "Cô ấy là một thành viên xứng đáng cho câu lạc bộ.", "eng": "She will be quite an acquisition to the club."}, {"viet": "Nếu có thể cô ấy đã giúp chúng tôi rồi, nhưng không thể được.", "eng": "She would help us if she could, but she can't."}, {"viet": "Tỏ ra khá bình tĩnh khi đương đầu với cuộc khủng hoảng.", "eng": "Show considerable phlegm in facing the crisis."}, {"viet": "Từ khi mất việc, anh ta thường nếm mùi chán chường sâu sắc.", "eng": "Since losing his job, he has often experienced a profound sense of ennui."}, {"viet": "Giấc ngủ thì cần thiết cho sức khỏe của mình.", "eng": "Sleep is necessary to one's health."}, {"viet": "Khịt khịt mũi vui vẻ với lời đề nghị.", "eng": "Snort with mirth at the suggestion."}, {"viet": "Một xã hội là nguồn tư tưởng pháp lý phương Tây.", "eng": "Society that was the springhead of Western legal thought."}, {"viet": "Một thằng cha ngu xuẩn nào đó đã nghịch cái cần anten của xe tôi!", "eng": "Some joker's been playing around with my car aerial!"}, {"viet": "Một vài nơi có nhiệt độ trên 900F.", "eng": "Some places have had temperatures in the 900F."}, {"viet": "Có cái gì ở trong bụi cây đã làm cho ngựa của cô ta hoảng sợ.", "eng": "Something in the bushes spooked her horse."}, {"viet": "Nói với một giọng nhỏ hầu như không nghe được.", "eng": "Speak in an almost inaudible voice."}, {"viet": "Các vì sao trông như những chấm sáng trên nền trời đen.", "eng": "Stars seen as points of light in a dark sky."}, {"viet": "Đừng lần chần chọn phim nữa nếu không anh sẽ lỡ cả hai phim.", "eng": "Stop dithering about which film you want to see or you'll miss them both!"}, {"viet": "Những cơn gió ngược thổi mạnh làm cho thuyền khó rời cảng.", "eng": "Strong cross breezes make it difficult for boats to leave harbour."}, {"viet": "Tivi có ảnh hưởng đến mức nó có thể làm cho người ta một sớm một chiều trở nên nổi tiếng.", "eng": "Such is the influence of TV that it can make a person famous overnight."}, {"viet": "Được, nhưng đắt tiền hơn một chút so với gửi thư thông thường.", "eng": "Sure, but it costs a little more than regular airmail."}, {"viet": "Nghỉ một giờ để ăn trưa.", "eng": "Take an hour's break for lunch."}, {"viet": "Xe taxi được phép đậu và đón khách tại ga xe lửa.", "eng": "Taxis licensed to ply for hire at the railway station."}, {"viet": "Sự căng thẳng thần kinh là nguyên nhân chính của bệnh tim.", "eng": "Tension is a major cause of heart disease."}, {"viet": "Lạ thật-anh ta vừa ở đây mà giờ anh ta đã đi mất rồi.", "eng": "That's funny-he was here a moment ago and now he's gone."}, {"viet": "Cái áo choàng tồi tàn hơn trước đây.", "eng": "That coat has seen better days."}, {"viet": "Trò đùa đó không đáng cười.", "eng": "That joke didn't rate a laugh."}, {"viet": "Nhà hàng có thu được 10,000 đô la một tháng.", "eng": "That restaurant takes in $ 10,000 a month."}, {"viet": "Cái cây ở bên trái bức vẽ không đúng luật xa gần.", "eng": "That tree on the left of the picture is out of perspective."}, {"viet": "Việc thêm 50 học sinh mới làm trường tiểu học quá đông.", "eng": "The accession of 50 new pupils over-crowded the primary school."}, {"viet": "Nữ nghệ sĩ bị một đám đông phóng viên quây lấy khi cô rời cửa sân khấu.", "eng": "The actress was confronted by a large group of reporters as she left the stage door."}, {"viet": "Vị đại sứ được Thủ tướng triệu hồi về Luân Đôn.", "eng": "The ambassador was called back to London by the Prime Minister."}, {"viet": "Những quả táo toàn là sâu.", "eng": "The apples are full of worms."}, {"viet": "Vài chỗ trong bài báo này hơi chuyên môn.", "eng": "The article is rather technical in places."}, {"viet": "Tác giả cuốn sách hướng dẫn này là một kiến trúc sư chuyên nghiệp.", "eng": "The author of the guidebook is an architect by profession."}, {"viet": "Cái túi rách vì sức nặng của hàng đã mua đựng trong túi.", "eng": "The bag broke under the weight of the shopping inside it."}, {"viet": "Người pha chế rượu từ chối ông ta theo cách cũ.", "eng": "The bartender gave lip the old heave-ho."}, {"viet": "Bữa cơm ngon nhất mà tôi từng được ăn.", "eng": "The best dinner I've had."}, {"viet": "Lợi ích quá hiển nhiên.", "eng": "The blinding obviousness of the advantage."}, {"viet": "Quyển sách thiếu mất hai trang.", "eng": "The book had two pages missing."}, {"viet": "Tay võ sĩ đã đấu với nhiều đối thủ.", "eng": "The boxer has fought many opponents."}, {"viet": "Phần xây gạch trong ngôi nhà này cần được sửa chữa lại.", "eng": "The brickwork in this house is in need of repair."}, {"viet": "Bọn trộm đêm đã vét sạch đồ nữ trang của cô ấy.", "eng": "The burglars cleaned her out of all her jewellery."}, {"viet": "Ngọn nến xèo xèo một tý yếu ớt rồi tắt hẳn.", "eng": "The candle gave a few faint splutters and then went out."}, {"viet": "Chiếc ôtô đâm thẳng vào bức tường.", "eng": "The car ran slap-bang into the wall."}, {"viet": "Toà lâu đài được sử dụng làm nhà tù.", "eng": "The castle has been used as a gaol."}, {"viet": "Ông chủ tịch muốn tất cả các giám đốc chúng tôi theo học một khoá học nói viết rõ ràng năm nay.", "eng": "The Chairman wants all our managers to take a course in communication skills this year."}, {"viet": "Đứa trẻ bị bỏng trong lúc nghịch diêm.", "eng": "The child burnt itself while playing with a match."}, {"viet": "Giày dép bọn trẻ được dồn vào trong góc tường.", "eng": "The children's shoes were all clumped together in a corner."}, {"viet": "Bọn trẻ con bằng lòng tự nguyện trở lại.", "eng": "The children returned on their own accord."}, {"viet": "Ngày lễ giáng sinh đến gần rồi.", "eng": "The Christmas holiday will soon be upon us."}, {"viet": "Đỉnh cao của lễ kỷ niệm là bắn pháo hoa.", "eng": "The climax of the celebration was a firework display."}, {"viet": "Thời tiết lạnh làm cho cây cối chết.", "eng": "The cold weather caused the plants to die."}, {"viet": "Uỷ ban chủ yếu bao gồm các giáo viên và các cha mẹ học sinh.", "eng": "The committee was composed mainly of teachers and parents."}, {"viet": "Công ty cung cấp dịch vụ sau khi bán rất tốt.", "eng": "The company provides a very good after-sales service."}, {"viet": "Lời giải thích lí thuyết âm mưu về vụ ám sát tổng thống Kennedy.", "eng": "The conspiracy theory explanation of president Kennedy's assassination."}, {"viet": "Chi phí đó sẽ được công ty thanh toán.", "eng": "The cost will be met by the company."}, {"viet": "Khoá học đó nhằm vào các sinh viên ngoại quốc.", "eng": "The course was oriented towards foreign students."}, {"viet": "Hoa màu chết cả vì không có mưa.", "eng": "The crops all perished because there was no rain."}, {"viet": "Các rèm và thảm phối hợp khéo.", "eng": "The curtains and the carpet are a good match."}, {"viet": "Vụ mua bán đó hoàn toàn trung thực.", "eng": "The deal was complete above board."}, {"viet": "Việc vén bức màn bí mật về sự phục sinh của Chúa Giêsu đã làm hoang mang, nhiều tín đồ Thiên Chúa Giáo.", "eng": "The demystification of the Resurrection upsets many Christians."}, {"viet": "Những khó khăn của việc đi du lịch mùa đông.", "eng": "The difficulties of travel in midwinter."}, {"viet": "Sự tách biệt giữa tôn giáo và khoa học.", "eng": "The divorce between religion and science."}, {"viet": "Các bác sĩ làm việc ở trung tâm y tế.", "eng": "The doctors worked at the Health Centre."}, {"viet": "Đồng đôla đã suy yếu trong trao đổi tiền tệ quốc tế.", "eng": "The dollar has weakened in international currency trading."}, {"viet": "Thuốc này bị luật của Quốc hội cấm.", "eng": "The drug was banned by an act of Parliament."}, {"viet": "Trứng được đóng gói và đưa đi cửa hàng.", "eng": "The eggs are packed and sent to the shops."}, {"viet": "Động cơ chỉ đánh lửa ở ba xi-lanh.", "eng": "The engine is only firing on three cylinders."}, {"viet": "Những sự kiện dẫn đến tội giết người đã được chiếu lại trong một loạt cảnh hồi tưởng.", "eng": "The events that led up to the murder were shown in a series of flashbacks."}, {"viet": "Vẻ mặt của cô ấy đã xác nhận nỗi lo sợ nhất của chúng tôi.", "eng": "The expression on her race confirmed our worst."}, {"viet": "Nông trường đã được điều chỉnh thích hợp với nhu cầu của dân địa phương.", "eng": "The farm was keyed to the needs of the local people."}, {"viet": "Hồ sơ đã cho thấy Smith là biệt hiệu của Simpson.", "eng": "The files indicate that Smith is an alias for Simpson."}, {"viet": "Ngọn lửa đã tắt trước khi đội cứu hoả đến.", "eng": "The fire had burnt out before the fire brigade arrived."}, {"viet": "Thập niên đầu tiên của thế kỷ 20.", "eng": "The first decade of the 20th century."}, {"viet": "Sàn nhà đã được chà nhẵn.", "eng": "The floor has been sanded smooth."}, {"viet": "Những cuộc đàm phán tới đây tạo mối hy vọng về các vụ giảm vũ khí thật sự.", "eng": "The forthcoming talks the hope of real arms reductions."}, {"viet": "Chúng ta không thấy được tương lai.", "eng": "The future is hidden from us."}, {"viet": "Vị tướng từ chối rút quân của mình ra khỏi thị trấn.", "eng": "The general refused to withdraw his troops from the town."}, {"viet": "Sân gôn ở phía sau nhà chúng tôi.", "eng": "The golf course is behind our house."}, {"viet": "Chính phủ đã và đang xem nhẹ vấn đề lương của giáo viên.", "eng": "The government has been soft-pedalling the question of teachers'pay."}, {"viet": "Uỷ ban bảo mật quốc phòng của chính phủ được giới trong cuộc biết đến dưới cái tên là DefCom.", "eng": "The government secret defense committee, known to the initiated as DefCom."}, {"viet": "Lợi ích lớn của việc cắm trại là rẻ tiền.", "eng": "The great virtue of camping is that it is cheap."}, {"viet": "Người khách trọ muốn nhờ sửa giày của bà ấy.", "eng": "The guest wants to have her shoes repaired."}, {"viet": "Tim là máy bơm giúp cho máu chảy trong cơ thể chúng ta.", "eng": "The heart is a pump that keeps blood flowing through our bodies."}, {"viet": "Chuyến nghỉ mát là một liều thuốc tuyệt vời làm giảm căng thẳng trong công việc văn phòng.", "eng": "The holiday was a marvellous antidote to the pressures of office work."}, {"viet": "Khách sạn đó trông ra biển.", "eng": "The hotel looks towards the sea."}, {"viet": "Căn nhà thuộc về người trả giá cao nhất.", "eng": "The house went to the highest bidder."}, {"viet": "Sự đập mạnh của quả bóng quần vợt làm chân anh ta đau điếng.", "eng": "The impact of the tennis ball really stung his leg."}, {"viet": "Việc đấu thủ chủ chốt của họ bị thương có thể là một nhân tố quyết định trong trận đấu.", "eng": "The injury to their key player could be a decisive factor in the game."}, {"viet": "Hòn đảo đó đã hoàn toàn bị Âu hóa sau chiến tranh.", "eng": "The island became fully westernised after the war."}, {"viet": "Vị quan tòa bác bỏ quyết định trước.", "eng": "The judge overruled the previous decision."}, {"viet": "Những chú mèo con đó hết sức tinh nghịch.", "eng": "The kittens were full of mischief."}, {"viet": "Kiểu máy vi tính mới nhất có nhiều nét đặc trưng mới.", "eng": "The latest computer model embodies many new features."}, {"viet": "Cái chân giờ đây đã duỗi thẳng hoàn toàn.", "eng": "The leg is now at full extension."}, {"viet": "Đường dây bận và người trực tổng đài hỏi tôi có muốn giữ máy không.", "eng": "The line was engaged and the operator asked if I'd like to hang on."}, {"viet": "Chiếc xe tải trượt trên một quãng lớp nước đá trên đường.", "eng": "The lorry skidded on a stretch of black ice."}, {"viet": "Bộ phim chính tiếp theo phim hoạt hình.", "eng": "The main feature following the cartoon."}, {"viet": "Những người diễu hành mang những biểu ngữ ghi'Cấm vũ khí hạt nhân'bằng chữ lớn.", "eng": "The marchers carried banners with the words'No Nuclear Weapons'in large letters."}, {"viet": "Các bộ phận của máy bơm đã quá cũ.", "eng": "The mechanics of the pump are very old."}, {"viet": "Mét là đơn vị của chiều dài.", "eng": "The metre is a unit of length."}, {"viet": "Chất pha chế này có thể loãng vừa đủ để rót ra được.", "eng": "The mixture may be thin enough to poured."}, {"viet": "Phần bằng phẳng nhất của sân gôn.", "eng": "The most even part of the golf course."}, {"viet": "Viện bảo tàng có một số vật triển lãm mới hấp dẫn từ Ấn Độ.", "eng": "The museum has some interesting new exhibits from India."}, {"viet": "Sân bay mới làm cho cuộc sống của chúng tôi vô cùng khốn khổ, vì tiếng ồn liên tục của nó.", "eng": "The new airport has made our lives hell because of the continual noise."}, {"viet": "Mẫu mới không có bán ở các cửa hiệu.", "eng": "The new model is not on sale in the shops."}, {"viet": "Tin khuyến khích tôi thay đổi ý kiến.", "eng": "The news makes me inclined to change my mind."}, {"viet": "Ồn không chịu được và chúng tôi đã chạy ra khỏi phòng.", "eng": "The noise was unbearable and we hurried out of the room."}, {"viet": "Cô y tá thăm bệnh nhân tại nhà.", "eng": "The nurse visits patients in their homes."}, {"viet": "Chiếc ô tô cũ không còn giúp ích gì nữa.", "eng": "The old car has outlived its usefulness."}, {"viet": "Cũng có thể trang trí duy nhất trên món đồ gốm chính là chất men tráng.", "eng": "The only decoration on a piece of pottery may be the glaze itself."}, {"viet": "Quyển sách xúc phạm đã gây náo động trong dư luận.", "eng": "The outrageous book created a sensation."}, {"viet": "Nghị viện thông qua chính sách được đề nghị.", "eng": "The Parliament approved the proposed policy."}, {"viet": "Bệnh nhân bây giờ hết nguy hiểm rồi, nhưng một thời gian trước đây thì không thể nói chắc được.", "eng": "The patient is out of danger now, but it was touch-and-go for a while."}, {"viet": "Người trình diễn chỉ nhận được những cái nhìn thương hại của khán giả.", "eng": "The performer received only pitying looks from his audience."}, {"viet": "Bánh patê đã chín rồi-chỉ cần làm nóng lại thôi.", "eng": "The pie has already been cooked-it just needs heating up."}, {"viet": "Chiếc máy bay đâm sầm vào núi.", "eng": "The plane crashed into the mountain."}, {"viet": "Vở kịch là một thành công về doanh thu.", "eng": "The play was a commercial success."}, {"viet": "Cảnh sát lo lắng về sự gia tăng số lượng các vụ đâm dao trong thành phố.", "eng": "The police are worried about the increase in the number of stabbings in the city."}, {"viet": "Cảnh sát giữ một vai trò trọng yếu trong xã hội chúng ta.", "eng": "The police perform a vital role in our society."}, {"viet": "Vị chính khách đã đưa ra một câu trả lời lập lờ.", "eng": "The politician gave an equivocal answer."}, {"viet": "Quyền lực và của cải đổ dồn về hoàng tử.", "eng": "The power and wealth which accrued to the prince."}, {"viet": "Tổng thống phải chịu trách nhiệm.", "eng": "The President has to bear the blame."}, {"viet": "Vị linh mục đó rất thông cảm tôi.", "eng": "The priest showed me great understanding."}, {"viet": "Những tù nhân mở đường qua rào dây thép gai và chạy thoát.", "eng": "The prisoners cut their way through the barbed wire and escaped."}, {"viet": "Dự án đã bị khập khiễng vì thiếu tiền.", "eng": "The project was hamstrung by lack of funds."}, {"viet": "Nhịp đập có thể cảm thấy trong cổ tay của người ta.", "eng": "The pulse can be felt in a persons wrists."}, {"viet": "Những vấn đề nêu lên bởi tân sinh vật học làm ta khó hình dung.", "eng": "The question raised by the new biology simply boggle the mind."}, {"viet": "Sự công bố một chúc thư, hôn nhân ở nhà thờ.", "eng": "The reading of a will, marriage banns, etc."}, {"viet": "Những giá trị tương đối của hai kế hoạch, hai ứng cử viên, hai chiếc ô tô.", "eng": "The relative merits of the two plans, candidates, cars."}, {"viet": "Nhà hàng ăn uống ấy chật ních người.", "eng": "The restaurant was crammed with people."}, {"viet": "Số người dùng ma tuý tăng lên là một mối quan tâm chung.", "eng": "The rise in drug taking is a matter of public concern."}, {"viet": "Vụ cướp đã dẫn đến một cuộc chạm súng giữa bọn cướp và cảnh sát.", "eng": "The robbery led to shoot-out between the robbers and the police."}, {"viet": "Rác trên chiếc xe bò đổ xuống đầy đường.", "eng": "The rubbish from the cart emptied onto the street."}, {"viet": "Các bộ phận của não cũng thế.", "eng": "The same parts are there."}, {"viet": "Những phát minh khoa học của thế kỷ 20.", "eng": "The scientific inventions of the 20th century."}, {"viet": "Câu: công việc lút đầu, lút cổ là một sự cường điệu.", "eng": "The sentence: I've got a stack of work a smile high is a hyperbole."}, {"viet": "Thuyền trưởng chỉ huy tất cả sĩ quan và binh lính.", "eng": "The ship's captain commands all the officers and men."}, {"viet": "Cửa hàng mở cửa mỗi ngày trừ chủ nhật.", "eng": "The shop is open everyday, excluding Sundays."}, {"viet": "Ca sĩ đã trình diễn lấy được.", "eng": "The singer gave an erratic performance."}, {"viet": "Mùi đó vẫn còn phảng phất.", "eng": "The smell still hasn't gone away."}, {"viet": "Đế ủng của nó cần phải được đóng lại.", "eng": "The soles of his boots needed repairing."}, {"viet": "Việc chăm sóc đặc biệt dành cho những bé sinh non.", "eng": "The special care of premature babies."}, {"viet": "Những lời khai của hai nhân chứng mâu thuẫn với nhau.", "eng": "The statements of the two witnesses conflict."}, {"viet": "Câu chuyện được viết theo ngôi thứ nhất: nó bắt đầu bằng: Tôi sinh ra ở...", "eng": "The story was written in the first person: it began I was born in..."}, {"viet": "Thắng lợi của vụ mùa tuỳ thuộc vào thời tiết.", "eng": "The success of the crop depends on the weather."}, {"viet": "Cái công tắc ở ấm đun nước không chịu nằm yên ở vị trí bật.", "eng": "The switch on the kettle won't stay down."}, {"viet": "Thầy giáo tách hai đứa trẻ đang đánh nhau ra.", "eng": "The teacher separated the two boys who were fighting."}, {"viet": "Các tay chơi quần vợt cần tập trung cao độ trong khi thi đấu.", "eng": "The tennis players need total concentration during play."}, {"viet": "Ý định từ chức chưa bao giờ nảy ra trong đầu tôi.", "eng": "The thought of resigning never crossed my mind."}, {"viet": "Cuộc du lịch đi qua sáu thủ đô châu Âu.", "eng": "The tour took in six European capitals."}, {"viet": "Bước quá độ từ trẻ con lên người lớn.", "eng": "The transition from childhood to adult life."}, {"viet": "Hai lý lẽ đó về cơ bản là như nhau.", "eng": "The two arguments are in essence the same."}, {"viet": "Ăng ten truyền hình ở khắp mọi nơi làm hỏng thị giác của ta.", "eng": "The ubiquitous televison aerial spoil the view."}, {"viet": "Sự ganh đua nhau thường thấy giữa em trai và chị gái.", "eng": "The usual rivalry between brother and sister."}, {"viet": "Trạm dừng chân đầu tiên trong chuyến đi thăm của nhà chính trị là một nhà máy mới.", "eng": "The visiting politician's first port of call was the new factory."}, {"viet": "Nước hai dòng sông hoà vào nhau tạo thành một con sông.", "eng": "The waters of the two rivers mingled to form one river."}, {"viet": "Toàn đội kết thúc lượt bóng được 10 điểm.", "eng": "The whole side was skittled out for 10 runs."}, {"viet": "Các nhân chứng không nhất trí về điểm này.", "eng": "The witnesses are at variance on this point."}, {"viet": "Vết thương chưa lành, hãy còn ít nhiều chảy mủ.", "eng": "The wound hasn't healed-there's still a discharge."}, {"viet": "Nhà thờ quan trọng đối với họ còn hơn cả vua hoặc đất nước họ.", "eng": "Their church was more important to them than their king of their country."}, {"viet": "Khi họ lại gặp nhau, sự kình địch trước đây giữa họ bèn bộc lộ ra.", "eng": "Their old rivalry soon surfaced when they met again."}, {"viet": "Rồi nó lại lớn dần lên thành một trăng đầy lại.", "eng": "Then it grew into a full moon again."}, {"viet": "Có nhiều bệnh cúm quanh đây-dân bị đổ hàng loạt.", "eng": "There's a lot of flu about-people are going down like ninepins."}, {"viet": "Không cần phải ra vẻ kiêu kỳ đối với tôi như thế!", "eng": "There's no need to get so high and mighty with me!"}, {"viet": "Xem ra chẳng có ai muốn giúp đỡ cả.", "eng": "There appeared to be nobody willing to help."}, {"viet": "Không có mấy nơi trên thế giới khô hạn như vậy.", "eng": "There are not many parts of the world as dry as that."}, {"viet": "Không có chương trình nào hay trên ti vi cả.", "eng": "There aren't any interesting programs on TV."}, {"viet": "Họ đều có một điểm giống nhau của gia đình.", "eng": "There is a family likeness in all of them."}, {"viet": "Không có sự tương đương chính xác giữa thì của tiếng Pháp với thì hiện tại hoàn thành của tiếng Anh.", "eng": "There is no exactly equivalent French tense to the present perfect tense in English."}, {"viet": "Chắc là có một con cá thật to ở đầu dây.", "eng": "There must be a huge fish on the end of the line."}, {"viet": "Có một hẫng hụt lớn trong cuộc sống của cô ấy sau khi chồng cô mất.", "eng": "There was a terrible gap in her life after her husband died."}, {"viet": "Chúng tôi có bốn người, vì vậy chúng tôi chia quả cam làm bốn phần và mỗi người ăn một miếng.", "eng": "There were four of us, so we divided the orange into quarters and each ate a piece."}, {"viet": "Những luận cứ này tạo thành chỗ dựa cho luật sư bào chữa.", "eng": "These arguments make up the case for the defence."}, {"viet": "Những vấn đề này sẽ phải hoãn lại đến kỳ họp sau.", "eng": "These matters will have to be left over until the next meeting."}, {"viet": "Họ đã mời một nhân vật nổi tiếng quen mặt để khai mạc siêu thị mới.", "eng": "They'd invited some B-list celebrity to open the new supermarket."}, {"viet": "Họ đã giảm giá ở cửa hàng, vì thế mua vào lúc này là rất tốt.", "eng": "They've reduced the prices in the shop, so it's a good time to buy."}, {"viet": "Họ đi nghỉ ở vùng Lake District.", "eng": "They are on holiday in the Lake District."}, {"viet": "Chúng nó gọi thầy giáo là Lão béo nhưng không bao giờ gọi thẳng trước mặt.", "eng": "They called their teacher'Fatty'but never to his face."}, {"viet": "Họ đánh dấu con sông làm ranh giới.", "eng": "They designated the river as the boundary."}, {"viet": "Họ đoán trước kết quả của kỳ thi với một sự chính xác lạ thường.", "eng": "They forecast the exam results with uncanny accuracy."}, {"viet": "Người ta cùng nhau ăn tối, ăn món ăn truyền thống-bánh chẻo, đại khái giống như bánh bao và thức khuya xem các chương trình truyền hình đến sáng sớm hôm sau.", "eng": "They have dinner together, eating traditional food-jiao zi, something like dumpling and stay up watching TV programs until early the following day."}, {"viet": "Họ sống trong tầm của máy phát.", "eng": "They live within range of the transmitter."}, {"viet": "Họ tổ chức một cuộc thám hiểm Everest.", "eng": "They organized an expedition to Everest."}, {"viet": "Họ ở lại trên sân thượng sau bữa tối, hưởng cái yên bình của buổi chiều.", "eng": "They remained on the terrace after dinner, enjoying the calm of the evening."}, {"viet": "Họ đã xài nhiều tiền vào việc du lịch.", "eng": "They spent a lot of money for travels."}, {"viet": "Họ muốn rút ngắn thời gian chế tạo một chiếc xe ô tô.", "eng": "They want to shorten the time it takes to make the car."}, {"viet": "Họ bị lôi cuốn vào một cuộc cãi lộn kéo dài về pháp lý ( với công ty ) ( về tiền lương ).", "eng": "They were involved in a long legal wrangle ( with the company ) ( over payment )."}, {"viet": "Họ ăn ở hiệu ăn mỗi tháng một lần.", "eng": "They would dine out together once a month."}, {"viet": "Cuốn sách này trong tầm khả năng của các độc giả trẻ.", "eng": "This book is within the capacity of younger reader."}, {"viet": "Sự chậm trễ này đã gây cản trở cho kế hoạch của tôi.", "eng": "This delay has caused some hindrance to my plans."}, {"viet": "Loại cỏ này có thời người ta nghĩ là một loại thuốc chữa bệnh.", "eng": "This herb was once thought to be a curative."}, {"viet": "Đây là mảnh đất riêng, anh không được đi qua nó.", "eng": "This is private land, you can't walk across it."}, {"viet": "Triều đại này là một trong những điểm sáng chói nhất của lịch sử La Mã.", "eng": "This long reign was one of the bright spots in the history of Rome."}, {"viet": "Phần này của bộ não điều khiển sự hô hấp và nhịp đập của tim.", "eng": "This part of the brain controls breathing and the beating of the heart."}, {"viet": "Món cá thu này không thể ăn được và nó có mùi khó chịu.", "eng": "This saury is inedible and it stinks."}, {"viet": "Thành phố này là nơi ẩn náu của những người tị nạn chính trị.", "eng": "This town is the sanctuary of political refugees."}, {"viet": "Những người muốn chấm dứt địa vị chính thức của Giáo hội Anh.", "eng": "Those who want to disestablish the Church of England."}, {"viet": "Tokyo và New York là những trung tâm tài chính lớn.", "eng": "Tokyo and New York are major financial centres."}, {"viet": "Hai cuộc hôn nhân bất hạnh đã để lại dấu ấn trong bà ta.", "eng": "Two unhappy marriages have left their mark on her."}, {"viet": "Chiến tranh làm những người lánh nạn phân tán khắp lục địa.", "eng": "War left refugees strew over the continent."}, {"viet": "Vậy chúng tôi mong được đón ông tối nay.", "eng": "We'll be expecting you this evening then."}, {"viet": "Chiều nay chúng tôi tiếp đón những người hàng xóm của mình.", "eng": "We're entertaining our neighbours this evening."}, {"viet": "Thường đến tháng Năm thời tiết chỗ chúng tôi mới thay đổi.", "eng": "We're usually into May before the weather changes."}, {"viet": "Chúng tôi có nhiều rượu, nhưng lại thiếu bia.", "eng": "We've plenty of wine, but we're shy on beer."}, {"viet": "Chúng tôi đang bận đánh máy một lá thư.", "eng": "We are busy typing a letter."}, {"viet": "Chúng tôi cho rằng nó bất lịch sự là vì nó mệt mỏi.", "eng": "We ascribe his rudeness to his fatigue."}, {"viet": "Chúng ta có thể rút ra vài bài học cho tương lai ( từ tai nạn này ).", "eng": "We can draw some lessons for the future ( from this accident )."}, {"viet": "Chúng ta có thể xem một vài nhà thơ hiện đại chẳng hạn như Eliot và Hughes.", "eng": "We could look at some modern poets, like Eliot and Hughes."}, {"viet": "Chúng tôi không bán thức uống có cồn.", "eng": "We don't sell alcoholic beverages."}, {"viet": "Chúng tôi dậy sớm để có thể đi bơi.", "eng": "We got up early so that we could go for a swim."}, {"viet": "Chúng ta có một ít bánh mì và chút ít.", "eng": "We have a bit of bread and little."}, {"viet": "Hôm nay chúng tôi có một số món ăn Quảng Đông đặc trưng gồm: heo sữa quay, Long Hổ tranh hùng, sữa sấy khô, gà ướp muối nướng và thịt chó hầm.", "eng": "We have some typical Cantonese food today: Roast Suckling Pig, the Battle between the Dragon and the Tiger, Dried Milk, Salt-Baked Chicken and Dog Meat Casserole."}, {"viet": "Chúng ta biết là nó được trồng tại Mê-hi-cô và Trung Mỹ vào thời ông Cortes.", "eng": "We know it was being cultivated in Mexico and central America in the time of Cortes."}, {"viet": "Chúng ta có thể nói về cái đẹp, nhưng bản thân cái đẹp là trừu tượng.", "eng": "We may talk of beautiful things, but beauty itself is abstract."}, {"viet": "Chúng ta phải quên đi những bất đồng giữa chúng ta và cứu lấy công ty.", "eng": "We must sink our differences and save the firm."}, {"viet": "Chúng tôi trả tiền thuê nhà vào đầu tháng.", "eng": "We pay our rent at the beginning of every month."}, {"viet": "Chúng tôi đã lục soát nhà đó không sót chỗ nào.", "eng": "We searched the house from top to bottom."}, {"viet": "Ngày nay chúng ta vẫn sử dụng lịch của Giáo hoàng Gregory.", "eng": "We still use Pope Gregory's calendar."}, {"viet": "Chúng ta muốn biết bạn bè của chúng ta cảm thấy như thế nào khi họ buồn.", "eng": "We want to know how our friends feel when they are unhappy."}, {"viet": "Quân địch đông hơn chúng tôi gấp hai lần.", "eng": "We were outnumbered two to one by the enemy."}, {"viet": "Chúng tôi sẽ rất biết ơn nếu ngài thanh toán nhanh chóng các khoản tiền phải trả.", "eng": "We would be grateful for prompt payment of your account."}, {"viet": "À, tôi có một tài khoản ký thác ở đây.", "eng": "Well, I have a time deposit here."}, {"viet": "À, phải, tôi cho là ông ấy bị bệnh, ôi trời ơi, tôi không thích nói về chuyện đó tí nào.", "eng": "Well, yes, I think he's oh, dear, I have to say it."}, {"viet": "Thật là một tác phẩm điêu khắc đẹp đẽ của thiên nhiên!", "eng": "What a beautiful sculpture of nature!"}, {"viet": "Về việc cô ta từ chức, cậu có ý kiến gì không?", "eng": "What are your views on her resignation?"}, {"viet": "Bạn thường làm gì vào cuối tuần?", "eng": "What do you usually do on the weekend?"}, {"viet": "Tiền thuê một căn hộ ở Los Angeles trung bình là bao nhiêu?", "eng": "What is the average rent for an apartment in Los Angeles?"}, {"viet": "Bạn có ý kiến gì về các hệ thống loại bỏ chất thải của Nhật?", "eng": "What is your opinion of Japan's waste disposal systems?"}, {"viet": "Người đàn ông ấy đang làm gì trên đó vậy?", "eng": "What's that man doing up there?"}, {"viet": "Ấn tượng đầu tiên của bạn về Nhật Bản là gì?", "eng": "What was your first impression of Japan?"}, {"viet": "Khi nào tàu khởi hành?.", "eng": "When does the train leave?."}, {"viet": "Khi còn trẻ bố mẹ tôi muốn tôi trở thành giáo viên.", "eng": "When I was young my parents wanted me to be a teacher."}, {"viet": "Khi cảnh sát vặn hỏi người đàn ông đó, anh ta thú nhận.", "eng": "When the police questioned the man, he confessed."}, {"viet": "Khi anh đi tới cuối đường này thì rẽ phải.", "eng": "When you get to the end of this road, turn right."}, {"viet": "Ở Úc, nơi lướt ván tốt nhất là ở đâu?", "eng": "Where is the best place for surfing in Australia?"}, {"viet": "Cửa hàng bách hoá nào phổ biến nhất ở Quảng Châu?", "eng": "Which is the most popular department store in Guangzhou?"}, {"viet": "Ai rót trà đây Tôi xin làm chủ tiệc nhé?", "eng": "Who's going to pour the tea Shall I do the honours?"}, {"viet": "Cô muốn nói chuyện với ai?", "eng": "Who would you like to talk to?"}, {"viet": "Tại sao bạn không dùng đèn cầy?", "eng": "Why don't you use a candle?"}, {"viet": "Bạn sẽ gọi điện cho anh ấy vào sáng mai được chứ?", "eng": "Will you call him tomorrow morning as promised?"}, {"viet": "Chào ai buổi sáng, chào tạm biệt, chúc mừng ngày sinh, chào mừng, v. v.", "eng": "Wish sb good morning, goodbye, happy birthday, welcome, etc."}, {"viet": "Phụ nữ vẫn còn đang tranh đấu để được hoàn toàn giải phóng.", "eng": "Women are still struggling to be fully emancipated."}, {"viet": "Anh làm ơn đi lấy cho tôi ly nước được không?", "eng": "Would you go and get me a glass of water?"}, {"viet": "Cảm phiền bạn báo hủy hộ tôi nhé?", "eng": "Would you mind calling canceling them for me?"}, {"viet": "Viết lại toàn bộ một báo cáo, tấm séc, đơn thuốc.", "eng": "Write out a report, cheque, prescription, etc."}, {"viet": "Vâng, cho tôi một ly Bloody Mary.", "eng": "Yes, I would like a Bloody Mary."}, {"viet": "Anh nghĩ rằng nó sẽ có sự lễ độ thông thường để xin lỗi về những điều nó đã nói.", "eng": "You'd think he'd have the common decency to apologize for what he said."}, {"viet": "Bạn thuộc cung Xử Nữ mặc dù bạn là phái nam.", "eng": "You're a Virgo even though you're a man."}, {"viet": "Giờ đây anh đã mắc vào một mớ bòng bong hay ho gớm!", "eng": "You've got yourself into a pretty mess now!"}, {"viet": "Không thể làm ba thứ cùng một lúc.", "eng": "You can't do three different things at once."}, {"viet": "Ông có thể chờ hóa đơn tôi gửi đến trong vài tuần nữa.", "eng": "You can expect a bill from me in a couple of weeks."}, {"viet": "Anh có thể là một nhà văn rất cừ nếu anh quyết chí đạt tới.", "eng": "You could be a very good writer if you set your mind to it."}, {"viet": "Bạn đã đóng kịch ở trường, phải vậy không?", "eng": "You have acted in a school play, haven't you?"}, {"viet": "Bạn biết bộ phim kinh điển đó có diễn viên Vivian Leigh và Clark Gable đóng vai chính, phim đó đã đoạt 10 giải thưởng của Viện Hàn Lâm.", "eng": "You know that old classic starring Vivian Leigh and Clark Gable, that won 10 Academy Awards."}, {"viet": "Chắc là anh đã đói sau cuộc đi bộ dài.", "eng": "You must be hungry after your long walk."}, {"viet": "Bạn cần phải có sự phối hợp thật tốt trong môn bóng.", "eng": "You need excellent co-ordination for ball games."}, {"viet": "Anh nên giảm ánh sáng đèn pha ô tô khi gặp một chiếc xe khác vào ban đêm.", "eng": "You should dip your headlights when you meet another car at night."}, {"viet": "Ông thì rành quá, nhưng ông suýt làm gãy mũi tôi đó.", "eng": "You sure did, but you almost broke my nose."}, {"viet": "Ông đã rút năm mươi nhân dân tệ và bây giờ còn lại một trăm.", "eng": "You withdrew fifty Yuan and now have one hundred left."}, {"viet": "Bài luận văn của anh ta đưa ra cách giải quyết hơi sơ sài về vấn đề này.", "eng": "Your essay gives a rather sketchy treatment of the problem."}, {"viet": "Sở thích của anh về nhạc pop thật sự làm anh trở nên lỗi thời.", "eng": "Your taste in pop music really dates you."}]