[{"viet": "8 có thể chia chẵn cho 2 và 4, nhưng không chia chẵn cho 3.", "eng": "8 is divisible by 2 and 4, but not by 3."}, {"viet": "Một tòa lâu đài nằm cheo leo phía trên sông.", "eng": "A castle perched above the river."}, {"viet": "Đuôi sao chổi luôn luôn chảy ra như dòng suối xuất phát từ phía mặt trời.", "eng": "A comet's tail always streams out way from the sun."}, {"viet": "Một thủy thủ đoàn nổi loạn chống lại thuyền trưởng của nó.", "eng": "A crew that mutinies against its captain."}, {"viet": "Một bản tóm tắt những tin tức trong tuần.", "eng": "A digest of a week's news."}, {"viet": "Một buổi trình diễn thời trang với sự có mặt của tất cả những nhân vật lỗi lạc và đạo đức tham dự.", "eng": "A fashionable affair attended by all the great and the good."}, {"viet": "Sân bóng đá được chiếu sáng bằng đèn pha.", "eng": "A football pitch illuminated with floodlights."}, {"viet": "Một người sành sỏi về nghệ thuật, rượu, cá tính.", "eng": "A good judge of art, wine, character."}, {"viet": "Một phần bánh săn-uýt kẹp giăm bông và một ly nước cam.", "eng": "A ham sandwich and a glass of orange juice."}, {"viet": "Một số lượng đông người di trú vào châu Âu.", "eng": "A huge migration of people into Europe."}, {"viet": "Một bài phê bình ca ngợi vở kịch mới.", "eng": "A laudatory review of the new play."}, {"viet": "Một chuỗi dài những ngày nắng.", "eng": "A long progression of sunny days."}, {"viet": "Một bản đồ nước Anh được đặt lên trên một bản đồ Texas.", "eng": "A map of Great Britain superimposed on a map of Texas."}, {"viet": "Một người lái xe phải hiểu các bảng hiệu giao thông.", "eng": "A motorist must be able to read traffic signs."}, {"viet": "Một nơi bình thường hay là một nơi cao cấp?", "eng": "A normal place or a fancy place?"}, {"viet": "Một penny là một phần trăm của một bảng.", "eng": "A penny is a hundredth part of a pound."}, {"viet": "Một phiên họp toàn thể quốc hội.", "eng": "A plenary session of the assembly."}, {"viet": "Một đoàn khách tham quan lũ lượt đến ngôi nhà đó.", "eng": "A procession of visitors came to the house."}, {"viet": "Một cuộc vận động tái bầu cử được hy vọng là nỗ lực cuối cùng trong sự nghiệp sắp tàn của bà ta.", "eng": "A reelection campaign that was expected to be her last hurrah."}, {"viet": "Nhu cầu đột xuất về đồng bảng Anh tiếp sau sự tăng giá của nó so với đồng đô la.", "eng": "A run on sterling following its rise in value against the dollar."}, {"viet": "Một sự thử thách cam go về sức chịu đựng của các tay leo núi.", "eng": "A severe test of climbers'stamina."}, {"viet": "Một con đường nhỏ phía sau nhà ga.", "eng": "A small street behind the station."}, {"viet": "Mối quan tâm của bà ta tới tương lai của con cái.", "eng": "A stake in her children's future."}, {"viet": "Ăn quá nhiều thức ăn béo bổ có hại cho anh.", "eng": "A surfeit of rich food is bad for you."}, {"viet": "Con chuột chù bình thường nhỏ bé thở mười lần nhanh hơn con người.", "eng": "A tiny pygmy shrew breathes ten times as first as a person."}, {"viet": "Một mối nghi ngờ theo bản năng về những bước tiến tới hòa bình của họ.", "eng": "A visceral mistrust of their peace moves."}, {"viet": "Một nhóm công tác được thành lập để điều tra vấn đề đó.", "eng": "A working party has been set up to look in the problem."}, {"viet": "Hành động phù hợp với nguyên tắc của ai.", "eng": "Act according to one's principles."}, {"viet": "Sau đó vài tuần Marie quyết định rằng bà sẽ có nhiều thời giờ để học tập nếu sống một mình.", "eng": "After a few weeks Marie decided that she would have more time to study if she lived by herself."}, {"viet": "Sau nhiều năm sống ở đây tôi đã trở nên quen với khí hậu lạnh.", "eng": "After living here for years I've become inured to the cold climate."}, {"viet": "Sau khi việc in và gấp đã hoàn thành, các tay sách được ghép lại với nhau.", "eng": "After the printing and folding are done, all the signatures that make up a book are gathered together."}, {"viet": "Toàn bộ nước uống phải được lọc sạch.", "eng": "All drinking water must be filtered."}, {"viet": "Tất cả con đường dẫn tới cung điện đều được quân đội canh gác.", "eng": "All the approaches to the palace were guarded by troops."}, {"viet": "Có trợ cấp thì giảm thu nhập.", "eng": "Allowances to be set against income."}, {"viet": "Một công việc cực nhọc 18 tiếng đồng hồ tại các đồng cỏ khô.", "eng": "An 18-hour slog in the hay fields."}, {"viet": "Một họa sĩ phết cả lớp sơn lên vải.", "eng": "An artist who plasters the paint on the canvas."}, {"viet": "Chỉ cần phơi sáng phim trong một phần trăm giây là đủ.", "eng": "An exposure of one-hundredth of a second will be enough."}, {"viet": "Một lời cầu hôn với cô em út.", "eng": "An offer of marriage to the youngest sister."}, {"viet": "Một người chuyên chở đồ ăn trộm mà không biết.", "eng": "An unwitting carrier of stolen goods."}, {"viet": "Ann không biết bơi và bị bỏ chới với ở tận phía nước sâu của hồ bơi.", "eng": "Ann couldn't swim and was left floundering about in the deep end of the swimming-pool."}, {"viet": "Những người xin việc phải trên 18 tuổi.", "eng": "Applicants must be over the age of 18."}, {"viet": "Có phải chúng ta đã hết nợ nhau hay anh còn nợ tôi 1 bảng Anh?", "eng": "Are we quits or do you still owe me a pound?"}, {"viet": "Em vừa ý về căn hộ mới đó không?", "eng": "Are you pleased with the new flat?"}, {"viet": "Khi một nhà phê bình già đi, anh ta thường trở nên cáu kỉnh hơn và ít phản ứng hơn.", "eng": "As a critic gets older, he or she usually grows more tetchy and limited in responses."}, {"viet": "Ngay khi tin tức về thảm kịch đó được loan báo, những làn sóng chấn động đã nhanh chóng lan ra trên toàn quốc.", "eng": "As soon as news of the tragedy was announced, shock waves spread rapidly to all parts of the country."}, {"viet": "Ở tuổi trên 70 ông ta đủ niên kỷ gọi là phi thường.", "eng": "At 70 plus, he is old enough to be metaphysical."}, {"viet": "Ở đoạn này của vở kịch, đa số diễn viên không có trên sân khấu.", "eng": "At this point in the play, most of the actors are off-stage."}, {"viet": "Hy vọng thăng chức của ông ta tiêu tan.", "eng": "Bang went his hopes of promotion."}, {"viet": "Có cơ may giành được chức vụ quản lý.", "eng": "Be in the running for a management post."}, {"viet": "Bắt đầu huyên thuyên sau vài ba cốc rượu.", "eng": "Becoming garrulous after a few glasses of wine."}, {"viet": "Vượt ra ngoài sự hiểu biết của con người.", "eng": "Beyond the confines of human knowledge."}, {"viet": "Cả hai phía vẫn còn từ chối không chịu đàm phán.", "eng": "Both sides still refuse to come to the negotiating table."}, {"viet": "Bộ giảm chấn làm giảm hẳn xóc.", "eng": "Buffers absorbed most of the shock."}, {"viet": "Nhưng tôi phải nói là mọi thứ được sắp xếp thật chu đáo và chúng tôi cảm thấy như đang ở nhà vậy.", "eng": "But I must say everything was arranged satisfactorily, and we felt quite at home."}, {"viet": "Nhưng anh cũng có thể làm nó ở ngoài trời.", "eng": "But you can make it outdoors, too."}, {"viet": "À này, bạn có giữ liên lạc với Bill Black không?", "eng": "By the way, do you keep in touch with Bill Black?"}, {"viet": "Cho tôi một cốc dâu được không?", "eng": "Can I have a strawberry-ice?"}, {"viet": "Tôi có thể đăng kí chuyến bay 4 giờ tới Paris được không?", "eng": "Can you book me onto the four o'clock flight to Paris?"}, {"viet": "Anh có thể chứng minh điều đó cho tôi không?", "eng": "Can you prove it to me?"}, {"viet": "Anh có thấy là nó đang lừa anh không?", "eng": "Can't you see that he's deceiving you?"}, {"viet": "Đổi tàu với chừng đó hành lý quả thật là một việc vất vả.", "eng": "Changing trains with all that luggage was a real hassle."}, {"viet": "Giáng sinh nhằm vào ngày thứ Hai.", "eng": "Christmas Day falls on a Monday."}, {"viet": "Sưu tập tem, tiền cổ, bao diêm, những ấn bản đầu tiên.", "eng": "Collect stamps, old coins, matchboxes, first editions."}, {"viet": "Vi tính bây giờ có khắp nơi-công ty chúng ta chẳng bao lâu nữa cũng sẽ thay đổi.", "eng": "Computers are everywhere now-our firm is switching over soon."}, {"viet": "Nói trào lộng về sự điên rồ hoàn toàn của cuộc chạy đua vũ khí hạt nhân.", "eng": "Conveying with gallows humour the utter insanity of the nuclear-arms race."}, {"viet": "Cô nhích lại gần vợ tôi thêm một chút?", "eng": "Could you move a little closer to my wife?"}, {"viet": "Những người chỉ trích chính sách chính phủ viện lẽ rằng những biện pháp mới về chống tội phạm được đưa ra hoàn toàn chỉ là lấy vải thưa che mắt thánh.", "eng": "Critics of government policy argue that the new measures introduced to fight crime are simply papering over the cracks."}, {"viet": "Lá khô bị gió cuốn đi.", "eng": "Dead leaves driven along by the wind."}, {"viet": "Những đồng nghiệp xảo quyệt đã ngăn họ đề bạt tôi.", "eng": "Designing colleagues stopped them from promoting me."}, {"viet": "Cậu có cảm thấy có vài giọt mưa không?", "eng": "Did you feel a few spots of rain?"}, {"viet": "Bạn hãy cúi đầu dưới một vòm cửa thấp.", "eng": "Dip your head under the low arch."}, {"viet": "Ở Anh nhiều người có vườn phải không?", "eng": "Do many people have gardens in England?"}, {"viet": "Anh có mang theo một chiếc bánh xe dự phòng trong xe ôtô của anh không?", "eng": "Do you carry a spare wheel in your car?"}, {"viet": "Bạn có cuốn sách nào yêu thích không?", "eng": "Do you have any favorite books?"}, {"viet": "Anh có biết tôi có thể nhờ sửa giày ở đâu không?", "eng": "Do you know where I can get my shoes repaired?"}, {"viet": "Em còn nhớ khi chúng mình mới lấy nhau không?", "eng": "Do you remember when we first got married?"}, {"viet": "Anh có hiểu được cái khó khăn ở địa vị tôi không?", "eng": "Do you understand the difficulty of my position?"}, {"viet": "Chuyến xe buýt này có đi đến công viên Hyde không?", "eng": "Does this bus go to Hyde Park?"}, {"viet": "Đừng có mua bây giờ, có khôn thì chờ bán xon hạ giá hãy mua.", "eng": "Don't buy now-you'd do better wait for the sales."}, {"viet": "Đừng có đẩy tôi, kẻo tôi sẽ làm đổ cái gì bây giờ!", "eng": "Don't jog me, or you'll make me spill something!"}, {"viet": "Đừng có khơi mào cho ông ta nói chuyện chính trị, nếu không ông ta sẽ nói liên tục suốt cả buổi tối đấy.", "eng": "Don't set him off talking politics or he'll go on all evening."}, {"viet": "Đừng lo khi đôi giày mới mang có vẻ hơi chật; da của nó rất dễ giãn ra.", "eng": "Don't worry if the shoes seem a bit tight at first; the leather has plenty of give in it."}, {"viet": "Lái xe ngang qua một vài thành phố công nghiệp rộng lớn.", "eng": "Drove through several large industrial towns."}, {"viet": "Tác động của lực hấp dẫn lên các vật thể trong không gian.", "eng": "Effects of gravitation on bodies in space."}, {"viet": "Phải ghi tên vào sáng thứ hai.", "eng": "Entries should be in on Monday morning."}, {"viet": "Trừ tôi ra, ai cũng nhận được giấy mời.", "eng": "Everyone except me got an invitation."}, {"viet": "Xin lỗi, tôi có thể mua đồng xu để đi xe điện ngầm ở đâu ạ?", "eng": "Excuse me, where can I get a token for the subway?"}, {"viet": "Những người ngã ngựa bị mấy con ngựa lao tới đạp lên.", "eng": "Fallen riders were trampled underfoot by the charging horses."}, {"viet": "Ít người có thể phủ nhận sự lãnh đạo của ông ta có tầm ảnh hưởng quan trọng.", "eng": "Few can deny the impact of his leadership."}, {"viet": "Trước hết chúng ta phải xem tốn kém bao nhiêu đã.", "eng": "First off, let's see how much it'll cost."}, {"viet": "Đi theo con đường quanh co khúc khuỷu xuống sườn núi.", "eng": "Followed a tortuous road down the mountain side."}, {"viet": "Khách nước ngoài chỉ được phép cư trú một tháng.", "eng": "Foreign visitors are only allowed one month's residence."}, {"viet": "Mẹ mày không gặp mày lần nữa tao cũng cóc cần.", "eng": "Fuck you-I don't care if I never see you again."}, {"viet": "Hãy bỏ chung tất cả các thứ với nhau trước khi anh bắt đầu nấu.", "eng": "Get all the ingredients together before you start cooking."}, {"viet": "Đấm ai một cú mạnh vào đầu.", "eng": "Give somebody a crack on the head."}, {"viet": "Đi đến Majorca để hưởng những ngày nghỉ của mình.", "eng": "Go to Majorca for one's holidays."}, {"viet": "Bảo lãnh cho việc trả nợ của ai.", "eng": "Guarantee the payment of somebody's debts."}, {"viet": "Ông ấy có quyền gì để sử dụng tước hiệu đại tá không?", "eng": "Has he right to use the style of Colonel?"}, {"viet": "Anh có nắm hết bài báo cáo chưa?", "eng": "Have you digested the report yet?"}, {"viet": "Anh có mời anh em Smith đến dự tiệc không?", "eng": "Have you invited the Smith brothers to the party?"}, {"viet": "Anh ta thà làm bất cứ điều gì còn hơn là làm cho bố mẹ anh ta không vui lòng.", "eng": "He'd do anything rather than displease his parents."}, {"viet": "Nó luôn luôn chơi chữ, nhưng tôi thấy chẳng buồn cười gì cả.", "eng": "He's always punning and I don't find it funny."}, {"viet": "Ông ta đã khá già mà còn đá bóng.", "eng": "He's getting a bit long in the tooth to be playing football."}, {"viet": "Nó sút bóng không tốt-nó tính không đúng thời điểm.", "eng": "He's not playing his shots well-his timing is faulty."}, {"viet": "Anh ta bị rất nhiều áp lực vì vợ anh ta bị bệnh người.", "eng": "He's under a lot of stress because his wife's very ill."}, {"viet": "Nó và anh nó có lối sống hoàn toàn khác nhau.", "eng": "He and his brother have quite different lifestyles."}, {"viet": "Anh ta gạt hết tiền của chúng tôi.", "eng": "He bilked us of our money."}, {"viet": "Thường liên lạc được với ông ta tại nơi làm việc.", "eng": "He can usually be contacted at his place of work."}, {"viet": "Hắn lãnh ngay một cú đau điếng vào đầu.", "eng": "He copped a nasty whack on the head."}, {"viet": "Nó rất muốn trở thành diễn viên, vì thế bạn phải để cho nó có thời gian để gạt bỏ ham muốn đó.", "eng": "He desperately wants to be an actor, so you'll have to give him time to get it out of his system."}, {"viet": "Nó không nói được tiếng Anh nhiều nhưng nó có thể làm cho người ta hiểu được nó.", "eng": "He doesn't speak much English but he can make himself understood."}, {"viet": "Anh ta dán chặt mắt của anh ta vào tôi.", "eng": "He fastened his eyes on me."}, {"viet": "Ông ấy tìm thấy nó giữa đống sách cũ.", "eng": "He found it among a pile of old books."}, {"viet": "Hắn lãnh một viên đạn vào đùi.", "eng": "He got a bullet on the thigh."}, {"viet": "Anh ta có những ý tưởng cao xa trong thời còn trẻ của anh ta, nhưng dần dà tất cả đều sụp đổ.", "eng": "He had high ideas in his youth but gradually the whole edifice crumbled."}, {"viet": "Anh ta hơi bị khò khè trong ngực.", "eng": "He has a slight wheeze in his chest."}, {"viet": "Ông ta chẳng còn một tí sức lực nào trong mình!", "eng": "He has no kick left in him!"}, {"viet": "Anh ấy bị một cú đấm thôi sơn vào đầu.", "eng": "He hit himself a nasty blow on the head."}, {"viet": "Anh ta quá lưu luyến những đồ vật gợi lại cho anh ta thời thơ ấu của mình.", "eng": "He is fixated on things that remind him of his childhood."}, {"viet": "Anh ta không phấn khởi được về viễn ảnh của doanh nghiệp đó.", "eng": "He is underwhelmed by the prospect of that enterprise."}, {"viet": "Ông ta đã đưa ra một bài bút chiến dữ dội chống lại các chính sách của nhà nước.", "eng": "He launched into a fierce polemic against the government's policies."}, {"viet": "Nó ngoái lại nhìn về phía sau.", "eng": "He looked backwards over his shoulder."}, {"viet": "Ông ta tìm cách bám vào một mỏm đá nhô ra từ vách đá.", "eng": "He managed to hang on to a piece of rock protruding from the cliff face."}, {"viet": "Anh ấy quan tâm tới ý kiến của tôi nhưng không đưa ra một quyết định dứt khoát nào.", "eng": "He nibbled at my idea but would not make a definite decision."}, {"viet": "Anh ta đứng vững trên mặt đất.", "eng": "He planted his feet firmly on the ground."}, {"viet": "Anh ta đục hai lỗ ở hộp dầu rồi đổ nó ra.", "eng": "He punched two holes in the tin of oil, and then poured it out."}, {"viet": "Anh ta nhận được học bổng kèm theo trợ cấp phụ.", "eng": "He received a scholarship and collateral aid."}, {"viet": "Anh ta cưỡi ngựa phi nước đại.", "eng": "He rode off at a gallop."}, {"viet": "Hắn ta luôn đói, hắn ta dường như lúc nào cũng muốn ăn nhiều hơn.", "eng": "He's always hungry-he seems to want more and more to eat."}, {"viet": "Anh ta đã quá thoải mái trong công việc ấy; chúng ta phải kiểm tra anh ta chặt chẽ hơn.", "eng": "He's had it too cosy in that job; we ought to keep a stricter check on him."}, {"viet": "Anh ấy đã thôi việc, tôi biết đó là sự thực.", "eng": "He's resigned, I know it for a fact."}, {"viet": "Anh ta ngồi ở mép bàn đung đưa chân.", "eng": "He sat at the edge of the table dangling his legs."}, {"viet": "Ông ta có vẻ rất nghiêm, nhưng thật ra ông ta có óc khôi hài lý thú.", "eng": "He seems very serious, but in fact he has a delightful sense of humour."}, {"viet": "Anh ta đóng sầm cửa để biểu lộ sự phản đối.", "eng": "He slammed the door to register his disapproval."}, {"viet": "Anh ta loan tin ấy khắp thành phố.", "eng": "He spread the news around the town."}, {"viet": "Anh ấy cho tôi cảm giác anh ta là người rất thông minh.", "eng": "He struck me as being a very clever man."}, {"viet": "Anh ta có khuynh hướng lí tưởng hoá quãng thời gian anh ta ở trong quân đội.", "eng": "He tends to idealize the time he spent in the army."}, {"viet": "Anh ta ăn con át của tôi bằng một con chủ bài nhỏ.", "eng": "He took my ace with a low trump."}, {"viet": "Anh ta không ngó ngàng gì tới gia đình từ khi nổi tiếng.", "eng": "He turned his back on his family when he become famous."}, {"viet": "Ông ta đòi chiếc ô tô 800 pao nhưng tôi đã mặc cả để ông ta hạ giá ( còn 600 pao ).", "eng": "He wanted 800 pounds for the car but I beat him down ( to 600 pounds )."}, {"viet": "Ông ta xin tiền để xây dựng một trường học mới.", "eng": "He was appealing for funds to build a new school."}, {"viet": "Anh ta hoàn toàn bối rối vì cách cư xử của nàng.", "eng": "He was completely foxed by her behaviour."}, {"viet": "Ông ta bị phát hiện cấu kết với địch.", "eng": "He was found to be hand in glove with the enemy."}, {"viet": "Anh ta nhìn Nick với lòng kính trọng miễn cưỡng.", "eng": "He was looking at Nick with a certain grudging respect."}, {"viet": "Nó bị phạt vì đã không tuân lệnh.", "eng": "He was punished for his disobedience."}, {"viet": "Hắn ta bị nghi ngờ có cộng tác với địch.", "eng": "He was suspected of collaborating with the enemy."}, {"viet": "Anh ấy làm việc trong một cửa hàng, trước đây, anh ấy làm việc trong nhà hàng.", "eng": "He was working in a shop, previously, he worked in a restaurant."}, {"viet": "Nó sẽ ra đi vào cuối học kì tức là 30 tháng bảy.", "eng": "He will leave at the end of term, to wit 30 July."}, {"viet": "Anh ta gây ấn tượng mạnh mẽ tại Broadway bằng một cuộc trình diễn xuất sắc.", "eng": "He wowed Broadway with a brilliant performance."}, {"viet": "Hãy giúp tôi chuyển chiếc trường kỷ ra xa lò sưởi.", "eng": "Help me to shift the sofa away from the fire."}, {"viet": "Chiếc vòng đeo tay của cô ta được cẩn những viên ngọc lục bảo.", "eng": "Her bracelet was set with emeralds."}, {"viet": "Sự biến mất của cô ta đã phát sinh ra những tin đồn bừa bãi nhất.", "eng": "Her disappearance gave rise to the wildest rumors."}, {"viet": "Hiện nay tiểu thuyết đầu tay của bà ấy không còn in nữa nhưng ông có thể tìm thấy một bản cũ.", "eng": "Her first novel is out of print now but you may find a second-hand copy."}, {"viet": "Bệnh tật đã làm cho cô ta trông xanh xao và gầy.", "eng": "Her illness had left her looking pale and thin."}, {"viet": "Sự đóng góp ít ỏi của nàng vào quỹ của chúng ta.", "eng": "Her meager contribution to our funds."}, {"viet": "Sự ủng hộ nhiệt tình của bà ta đối với sự nghiệp của chúng ta.", "eng": "Her passionate support for our cause."}, {"viet": "Công việc học hành của cô ấy không đạt yêu cầu lắm.", "eng": "Her school work isn't quite up to the mark."}, {"viet": "Ba năm học của cô ta ở trường đại học Oxford đã sống ba ngày tại Oxford với tư cách là một khách du lịch.", "eng": "Her three years at Oxford spend three days in Oxford as a tourist."}, {"viet": "Đây là vé và hộ chiếu của tôi.", "eng": "Here is my ticket and passport."}, {"viet": "Giọng văn ẩn ý của ông ấy thật khó mà hiểu nổi.", "eng": "His allusive style is difficult to follow."}, {"viet": "Ông chủ phê bình làm cho anh ta cảm thấy có phần bối rối.", "eng": "His boss's criticism left him feeling rather abashed."}, {"viet": "Lòng can đảm của anh ta khiến mọi người phải thán phục.", "eng": "His courage compels universal admiration."}, {"viet": "Mắt hắn nhìn rõ dần trong căn phòng tối.", "eng": "His eyes focused slowly in the dark room."}, {"viet": "Tình bạn của anh ấy là cái duy nhất làm cho cuộc sống có thể chịu nổi.", "eng": "His friendship was the only thing that made life bearable."}, {"viet": "Tên họ viết tắt của anh ta được khắc vào hộp thuốc lá.", "eng": "His initials were engraved on the cigarette case."}, {"viet": "Các bữa ăn của ông ấy bao giờ cũng ngon, song lần này ông ta còn làm ngon hơn hẳn.", "eng": "His meals are always very good, but this time he's excelled himself."}, {"viet": "Cha mẹ anh không có thiện cảm với tham vọng của anh muốn trở thành một diễn viên.", "eng": "His parents do not sympathize with his ambitions to become an actor."}, {"viet": "Chuyện anh ta kể không gây được cảm xúc nào.", "eng": "His recitation was almost expressionless."}, {"viet": "Bài diễn văn của ông ta đã được điều chỉnh cho thật thích hợp với những gì cử tọa muốn nghe.", "eng": "His speech was finely tuned to what the audience wanted to hear."}, {"viet": "Sự chính xác về một món hời của anh ta không thể sai được.", "eng": "His unerring accuracy for a bargain."}, {"viet": "Đánh bóng về phía tay thuận của nàng.", "eng": "Hit the ball to her forehand."}, {"viet": "Những đám người hâm mộ, người du lịch, cổ động viên bóng đá, người đi mua hàng.", "eng": "Hordes of fans, tourists, football supporters, shoppers, etc."}, {"viet": "Tôi chỉnh đồng hồ báo thức này bằng cách nào?", "eng": "How can I set this alarm clock?"}, {"viet": "Anh đã làm gì tối hôm qua đó?", "eng": "How did you pass the evening?"}, {"viet": "Thị trấn của người da đỏ đó cách bao xa?", "eng": "How far is that Indian town?"}, {"viet": "Tôi nên mang theo bao nhiêu hộp sô-cô-la?", "eng": "How many boxes of chocolate should I bring?"}, {"viet": "Nha sĩ đã nhổ bao nhiêu răng?", "eng": "How many teeth did the dentist take out?"}, {"viet": "Tôi nên thêm bao nhiêu nước vào bột trộn sẵn?", "eng": "How much water should I add to the mix?"}, {"viet": "Ô này, ô này, ở đây có chuyện gì thế?", "eng": "Hullo, hullo, hullo, what's going on here?"}, {"viet": "Tôi muốn làm đơn xin làm nhân viên quản lí cửa hàng.", "eng": "I'd like to apply for a job as a storekeeper."}, {"viet": "Tôi chấp nhận giá 350 pao chiếc xe hơi, hoặc bớt một chút.", "eng": "I'll accept 350 pounds or the car, or nearest offer."}, {"viet": "Tôi phải kiếm một chiếc đệm mới cho giường của tôi, cái này lò xo đã hỏng hết.", "eng": "I'll have to get a new mattress for my bed, the springs have gone in this one."}, {"viet": "Tôi sẽ kể cho các bạn nghe một câu chuyện vui nếu tôi có thể lạc đề một chút.", "eng": "I'll tell you a funny story, if I may digress for a moment."}, {"viet": "Tôi được phân công tháp tùng ông khi ông ở Trung Quốc.", "eng": "I'm assigned to accompany you during your stay in China."}, {"viet": "Em sẽ đem giặt hấp cái áo khoác này.", "eng": "I'm going to have this coat dry-cleaned."}, {"viet": "Mày nên nhớ tao không phải là thứ mày sai lúc nào cũng được.", "eng": "I'm not at your beck and call, you know."}, {"viet": "Tôi nói đàng hoàng, chúng tôi mong anh hoàn tất đúng thời hạn công việc đã giao cho anh.", "eng": "I'm serious: we expect you to complete the assignment on time."}, {"viet": "Tôi tin chắc cô ấy giấu chúng ta điều gì đó.", "eng": "I'm sure she's keeping something back from us."}, {"viet": "Tôi đang hoàn chỉnh các ghi chép của tôi để làm thành một bài luận văn.", "eng": "I'm working my notes up in to a dissertation."}, {"viet": "Suốt ngày tôi đi lang thang trong một trạng thái bàng hoàng.", "eng": "I've been wandering around in a daze all day."}, {"viet": "Tôi đã nghe nói rất nhiều về trà Long Tỉnh.", "eng": "I've heard a lot about Dragon Well tea."}, {"viet": "Tôi đã nói dứt khoát rồi-không chấp nhận như thế thì thôi.", "eng": "I've said my last word-take it or leave it."}, {"viet": "Tôi cũng có nhiều sách về làm vườn nếu bạn thích xem chúng.", "eng": "I also have plenty of books on gardening if you'd like to see them."}, {"viet": "Tôi chưa quen với thành phố này.", "eng": "I am new to this town."}, {"viet": "Tôi hỏi cô ấy có thích trường mới của mình không nhưng cô ấy chỉ nhún vai.", "eng": "I asked her if she liked her new school but she just shrugged her shoulders."}, {"viet": "Tôi mua nó vì nó gọn, dễ xách chứ không vì kiểu dáng của nó.", "eng": "I bought it for its portability, not its appearance."}, {"viet": "Tôi không tìm thấy đồng hồ của tôi, chắc tôi đánh mất nó.", "eng": "I can't find my watch, I must have lost it."}, {"viet": "Tôi chưa có thể cho anh biết thêm bất cứ điều gì về chuyện đó, nhưng anh hãy chờ thông báo những diễn biến mới.", "eng": "I can't tell you any more about it yet, but watch this space."}, {"viet": "Từ phòng khách sạn tôi có thể nhìn thấy những ngọn núi xung quanh.", "eng": "I can see the surrounding mountains from my hotel room."}, {"viet": "Tôi không nghĩ ra được tôi đã bỏ quên chìa khóa ở đâu.", "eng": "I can't think where I left my keys."}, {"viet": "Tôi chẳng hiểu lập luận của hắn một chút nào cả.", "eng": "I couldn't follow his argument at all."}, {"viet": "Tôi muốn xem hoá đơn của tôi.", "eng": "I'd like to see my bill."}, {"viet": "Tôi không nhận ra hắn vì hắn đã thay đổi quá nhiều.", "eng": "I didn't recognize him because he had altered so much."}, {"viet": "Tôi không đồng ý với quan điểm của ông ta về giáo dục.", "eng": "I don't hold with his views on education."}, {"viet": "Tôi không ngại giúp đỡ, nhưng tôi không chịu tự mình làm tất cả mọi thứ.", "eng": "I don't mind helping, but I draw the line at doing everything myself."}, {"viet": "Tôi không muốn quanh quẩn ở đấy khi tình trạng lộn xộn bắt đầu.", "eng": "I don't want to be around when the balloon goes up."}, {"viet": "Tôi không thích những người bán hàng mời chào đon đả.", "eng": "I don't like oily shop assistant."}, {"viet": "Tôi giải thích mọi điều, mặc dù vậy anh ta vẫn không hiểu.", "eng": "I explained everything, but even then he didn't understand."}, {"viet": "Tôi cảm thấy không muốn giúp hắn.", "eng": "I felt indisposed to help him."}, {"viet": "Tôi đã tìm thấy chiếc áo khoác của anh sau khi anh rời khỏi trường đại học.", "eng": "I found your coat after you had left the university."}, {"viet": "Tôi sợ hết hồn, hết vía.", "eng": "I got the fright of my life."}, {"viet": "Tôi khó khăn lắm mới thuyết phục được cô ta.", "eng": "I had much difficulty in convincing her."}, {"viet": "Tôi có một vé xe đi 30 ngày của hang Greyhouse American.", "eng": "I have a 30 day Greyhound American."}, {"viet": "Tôi có ít kiến thức về tiền tệ Trung Quốc.", "eng": "I have little knowledge of Chinese currency."}, {"viet": "Tôi có 3 chị em gái, tôi là con thứ hai.", "eng": "I have three sisters, I'm number two."}, {"viet": "Tôi không có một bộ quần áo nào ra hồn để mặc.", "eng": "I haven't a thing to wear."}, {"viet": "Tôi nói để anh ta hiểu ý là tôi không hài lòng với công việc của anh ta.", "eng": "I hinted that I was dissatisfied with his work."}, {"viet": "Tôi mong ông sẽ rất vui khi ở đây.", "eng": "I hope you will have a very enjoyable stay."}, {"viet": "Cháu đã làm đổ và làm vỡ lọ hoa rồi.", "eng": "I knocked over the vase and broke it."}, {"viet": "Tôi thích đọc nhất là loại tiểu sử và tự truyện.", "eng": "I like biographies and autobiographies, especially."}, {"viet": "Tôi sẽ rất vui được đến dự.", "eng": "I'll be happy to go."}, {"viet": "Tôi sẽ cho bạn biết càng sớm càng tốt.", "eng": "I'll let you know as soon as possible."}, {"viet": "Tôi làm đầu bếp ở nhà hàng của bạn tôi.", "eng": "I'm a chef at my friend's restaurant."}, {"viet": "Tôi sẽ ra đi vào ngày 5 thánh.", "eng": "I'm going to leave on January."}, {"viet": "Tôi đang trên đường đến New York.", "eng": "I'm on my way to New York."}, {"viet": "Tôi đóng riêng cho mình những bàn ghế thô sơ ở trong vườn.", "eng": "I made my own crude garden furniture."}, {"viet": "Tôi phải làm xong bài tập về nhà trước khi đi ngủ.", "eng": "I must finish my homework before I go to bed."}, {"viet": "Tôi cần đổi tiền đô la sang tiền frăng.", "eng": "I need to change my dollars into francs."}, {"viet": "Tôi chỉ bơi có hai lần năm ngoái.", "eng": "I only had two swims last year."}, {"viet": "Tôi dự định khởi hành sớm ngày mai.", "eng": "I propose to make an early start tomorrow."}, {"viet": "Tôi vừa mới dọn đến khu này và một người bạn của tôi giới thiệu bác sĩ Smith.", "eng": "I recently moved to this area and a friend of mine recommended Dr. Smith."}, {"viet": "Tôi chào cô ta, nhưng cô ta hoàn toàn phớt lờ tôi!", "eng": "I said hello to her, but she ignored me completely!"}, {"viet": "Tôi đã thư theo lối phát chuyển nhanh hôm thứ Hai.", "eng": "I sent the letter first class on Monday."}, {"viet": "Tôi thả lỏng dây câu cho con cá bơi.", "eng": "I slackened the line to let the fish swim."}, {"viet": "Tôi cho rằng chị ấy là một nhà quản lý giỏi.", "eng": "I summed her up as a competent manager."}, {"viet": "Tôi nghĩ là trong vấn đề này tôi đúng, nhưng tôi sẽ không khư khư bám lấy điều đó.", "eng": "I think I'm right on this issue but I wouldn't go to the stake over it."}, {"viet": "Tôi nghĩ món gà quay giòn và món thịt bò xắt lát xào ớt và xanh ớt đỏ thì khá đặc biệt.", "eng": "I think the Roasted Crispy Chicken and Sliced Beef with Green and Red Pepper are quite special."}, {"viet": "Tao nghĩ mày đâu còn dại dột gì nữa.", "eng": "I thought you were old enough to know better."}, {"viet": "Tôi cố theo dõi tình hình hiện nay bằng cách đọc báo.", "eng": "I try to keep in touch with current events by reading the newspapers."}, {"viet": "Tôi đã xung phong làm một tài xế.", "eng": "I volunteered to act as chauffeur."}, {"viet": "Tôi muốn nhắc các ông về hóa đơn 10000 đô la chưa thanh toán, nó đã quá hạn lâu rồi.", "eng": "I want to remind you of the unpaid bill of $ 10,000, which is long overdue."}, {"viet": "Còn tôi thì sinh năm 1960.", "eng": "I was born in nineteen sixty."}, {"viet": "Tôi chỉ mong đợi cho điều đó xảy ra.", "eng": "I was just waiting for that to happen."}, {"viet": "Tôi bế tắc khi ở nước ngoài mà không một xu dính túi.", "eng": "I was stranded in a foreign with no money."}, {"viet": "Tôi đã tới câu lạc bộ đó ở Camden đêm thứ sáu, thật là hay đéo chịu được.", "eng": "I went to that club in Camden on Friday night, it's definitely the bollocks."}, {"viet": "Ông Hopkins đang nói chuyện trên một đường dây khác.", "eng": "I wish to speak to Mr. Hopkins."}, {"viet": "Tôi không biết tại sao cô ta lại đột ngột thay đổi tình cảm.", "eng": "I wonder why she suddenly had a change of heart."}, {"viet": "Tôi muốn đi công viên Trung tâm.", "eng": "I would like to go to Central Park."}, {"viet": "Tôi không cho rằng nó lấy cắp tiền của chính bà nó!", "eng": "I wouldn't put it past him to steal money from his own grandmother!"}, {"viet": "Nếu như anh ta có một chút hiểu biết thì anh ta đã nhận ra rồi.", "eng": "If he had a morsel of sense, he'd realize."}, {"viet": "Khi nào kim loại nóng lên thì nó giãn nở.", "eng": "If mental gets hot it expands."}, {"viet": "Nếu họ đề nghị tôi một việc làm ở Mỹ, tôi sẽ chộp ngay lấy dịp may đó.", "eng": "If they offered me a job in the USA, I'd jump at the chance."}, {"viet": "Nếu anh đã chuẩn bị xong, anh có thể bắt đầu công việc.", "eng": "If you are ready, you may start your work."}, {"viet": "Nếu anh ăn nhiều sô-cô-la quá sẽ phát phì đấy.", "eng": "If you eat too much chocolate you'll get fat."}, {"viet": "Nếu anh thay đổi ý kiến, hãy cho tôi biết.", "eng": "If you should change your mind, do let me know."}, {"viet": "Minh hoạ nhiều khi có ích hơn là định nghĩa để cho thấy các từ có nghĩa gì.", "eng": "Illustration is often more useful than definition for showing what words mean."}, {"viet": "Ở Ấn Độ thuộc Anh, các uỷ viên Hội đồng quận có quyền lực pháp luật.", "eng": "In British India, district commissioners had judicial powers."}, {"viet": "Trong câu I was there when he arrived, when he arrived là mệnh đề phụ.", "eng": "In I was there when he arrived, when he arrived is subordinate clause."}, {"viet": "Mặc dù tất cả những chuyện đã xảy ra nhưng tôi vẫn không thù hằn gì anh ấy.", "eng": "In spite of all that happened, I bear him no ill-will."}, {"viet": "Trong nhóm từ'all the boys'và'both his parents'những từ'all'và'both'là từ chỉ định.", "eng": "In the phrase'all the boys'and'both his parents','all'and'both'are predeterminer."}, {"viet": "Ở đất nước bạn, có báo thể thao nào giống như báo thể thao ở Nhật Bản không?", "eng": "In your country, do you have sports newspapers similar to those in Japan?"}, {"viet": "Giá tiền hay độ tin cậy, cái nào là yếu tố quyết định để chọn một ô tô mới?", "eng": "Is cost or reliability the main determinant in choosing a new car?"}, {"viet": "Thủ tướng đương nhiệm của Anh có được ngưỡng mộ không?", "eng": "Is the current Prime Minister of the U. K. popular?"}, {"viet": "Điểm này có là chủ yếu trong lý lẽ của ông không?", "eng": "Is this point material to your argument?"}, {"viet": "Đó là một vấn đề hoàn toàn không quan trọng.", "eng": "It's a matter of complete indifference to me."}, {"viet": "Người ta đang đồn rằng Thủ tướng có thể từ chức.", "eng": "It's being put about that the Prime Minister may resign."}, {"viet": "Thật khó mà giữ quan hệ được tất cả bạn học cũ.", "eng": "It's hard to keep track of all one's old school friends."}, {"viet": "Đừng tìm cách lừa tôi vô ích-tôi biết đích xác cái gì đang xảy ra.", "eng": "It's no use trying to pull the wool over my eyes-I know exactly what's going on."}, {"viet": "Phòng đó phải tiện nghi, có máy điều hoà nhiệt độ, và được trang bị phòng tắm riêng.", "eng": "It's required that the room be comfortable, air-conditioned, and be equipped with a private bathroom."}, {"viet": "Các thói quen làm tổ không bình thường nói lên sự khu biệt của loài chim này đối với những chim khác.", "eng": "It's unusual nesting habits differentiate this bird from other."}, {"viet": "Món quà này trông cũng đáng giá 10 $ lắm chứ, không phải sao?", "eng": "It does look as if it could have cost $ 10, doesn't it?"}, {"viet": "Sự thật đương nhiên ( khi nói ) rằng một tổng thể là lớn hơn bất kỳ một bộ phận nào của nó.", "eng": "It is axiomatic ( to say ) that a whole is greater than any of its parts."}, {"viet": "Không phải là giá cả mà chính là chất lượng nên giày dép chúng tôi ăn khách.", "eng": "It is not price but quality that sells our shoes."}, {"viet": "Trông giống như một sân bóng mềm vậy.", "eng": "It looks like a Softball field."}, {"viet": "Ở đây là khoảng 2 giờ 30 chiều.", "eng": "It's about 2: 30 in the afternoon here."}, {"viet": "Nó sạch sẽ và rộng rãi.", "eng": "It's very clean and spacious."}, {"viet": "Phải mất nhiều công thuyết phục ông ta mới đồng ý.", "eng": "It took a lot of coaxing before he agree."}, {"viet": "Rõ ràng là anh ta không hiểu gì về sửa chữa ô tô.", "eng": "It was apparent that he knew nothing about how to repair cars."}, {"viet": "Đó là một trong những tình tiết ngộ nghĩnh nhất trong đời tôi.", "eng": "It was one of the funniest episodes in my life."}, {"viet": "Đó sẽ là một kinh nghiệm thú vị.", "eng": "It will be an interesting experience."}, {"viet": "Jack đã lớn quá không mặc vừa chiếc áo khoác vì thế tôi mua cho nó một cái to hơn.", "eng": "Jack has outgrown his coat so I need to buy him a bigger one."}, {"viet": "John vừa mới cắt đứt với bạn gái của anh ta xong.", "eng": "John has just split up with his girl-friend."}, {"viet": "Thử hỏi anh đã làm gì để được chia phần nào?", "eng": "Just what did you do to earn any of the action?"}, {"viet": "Các vấn đề pháp lý đúng thực là lĩnh vực của Andrew.", "eng": "Legal problems are very much Andrew's territory."}, {"viet": "Tháng này chúng ta hãy đi Hawaii nhé.", "eng": "Let's go to Hawaii this month."}, {"viet": "Nhiều doanh nghiệp lớn bắt đầu từ những sự khởi đầu nhỏ bé.", "eng": "Many big businesses start from small beginnings."}, {"viet": "Nhiều người đến lập nghiệp đã bị cám dỗ vì những triển vọng làm giàu dễ dàng.", "eng": "Many settlers were allured by promises of easy wealth."}, {"viet": "Cho tôi hỏi thêm một vài câu nữa được không, đại úy Lucas?", "eng": "May I ask some more questions, Lieutenant Lucas?"}, {"viet": "Có lẽ tôi có thể sắp xếp kì nghỉ cho trùng khoảng thời gian bạn đến.", "eng": "Maybe I can arrange my vacation around the same time."}, {"viet": "Phần lớn quần áo của tôi là do anh tôi để lại cho.", "eng": "Most of my clothes were handed down to me by my older brother."}, {"viet": "Bà Jones là người nghiện rượu tự thú nhận.", "eng": "Mrs. Jones is a self confessed alcoholic."}, {"viet": "Con mèo của tôi đã bị một con chó cắn rách toạc tai.", "eng": "My cat had its ear ripped open by a dog."}, {"viet": "Ông tôi mất đã 10 năm.", "eng": "My grandfather has been dead for ten years."}, {"viet": "Cha mẹ tôi và tôi thuộc những thế hệ khác nhau.", "eng": "My parents and I belong to different generations."}, {"viet": "Vợ tôi muốn bếp quét vôi trắng và bà ta đã nói là phải nghe.", "eng": "My wife wanted the kitchen painted white, and what she says, goes."}, {"viet": "Tin tức của báo chí làm mọi người tiếp tục quan tâm đến chuyện này.", "eng": "Newspaper reports kept interest in the story alive."}, {"viet": "Thưa không, Chúng tôi có hàng trăm mặt hàng, nhưng đây chỉ là những danh mục các mặt hàng được biết đến nhiều nhất.", "eng": "No, We have hundreds of items, but these are the lists of the most popular ones."}, {"viet": "Thông thường tôi chỉ có thời gian để đọc các tạp chí mà tôi đặt mua thôi.", "eng": "Normally I only have time to keep up with the magazine subscriptions I have."}, {"viet": "Bom hạt nhân là vũ khí răn đe cuối cùng.", "eng": "Nuclear weapons are the ultimate deterrent."}, {"viet": "Ồ, cám ơn bác rất nhiều, bác Freeman ạ.", "eng": "Oh, thank you very much, Mrs. Freeman."}, {"viet": "Khi rời nhà trường anh ấy học nghề ở xưởng của anh trai anh ấy.", "eng": "On leaving school he had an apprenticeship with his brother in his work."}, {"viet": "Người liều lĩnh dám phớt lờ các bức thư của giám đốc ngân hàng.", "eng": "One ignores letters from the bank manager at one's peril."}, {"viet": "Mở hồ sơ cho từng nhân viên.", "eng": "Open a file on each member to staff."}, {"viet": "Buổi gặp gỡ đầu tiên của chúng ta thường trở lại tâm trí tôi.", "eng": "Our first meeting often recurs to my mind."}, {"viet": "Chi nhánh khác của chúng tôi chỉ cách đây vài nhà phía dưới con đường này.", "eng": "Our other branch is just a few doors down the road."}, {"viet": "Ngoại trừ các anh chị trong nhà cô ấy không có một người bạn thân nào cả.", "eng": "Outside her brothers and sisters, she has no real friends."}, {"viet": "Sự nghiên cứu, tra hỏi, lắng nghe kiên nhẫn.", "eng": "Patient research, questioning, listening."}, {"viet": "Những người không có những gì họ cần.", "eng": "People who don't have what they need."}, {"viet": "Vui lòng cho tôi biết cách điền vào tờ khai này?", "eng": "Please tell me how to fill out this from the airport?"}, {"viet": "Gần đây, hai vai của bố mẹ tê cứng.", "eng": "Recently, my shoulders have been stiff."}, {"viet": "Có thấy chàng trai đang đứng ở đằng kia không?", "eng": "See the boy who is standing over there?"}, {"viet": "Vào lúc đó, cô ta đã ngủ thiếp đi, phải không?", "eng": "She'd fallen asleep by that time, hadn't she?"}, {"viet": "Bà ta là một quản trị viên trong một công ty điện toán.", "eng": "She's an executive in a computer company."}, {"viet": "Cô ta thật là năng nổ.", "eng": "She's got lots of her get-up-and-go."}, {"viet": "Cô ta chỉ mới ở đây với chúng tôi có một tháng cho nên cô ta vẫn còn đang học hỏi những mánh khóe nhà nghề.", "eng": "She's only been with us a month so she's till learning the tricks of the trade."}, {"viet": "Cô ấy đan rất khéo tay.", "eng": "She's very dexterous with the knitting needles."}, {"viet": "Cô ấy đến nhà hát khá sớm.", "eng": "She arrived at the theatre rather early."}, {"viet": "Cô ta có thể làm được mọi công việc.", "eng": "She can turn her hand to all sorts of jobs."}, {"viet": "Cô ta chui vào dưới chăn nằm bên cạnh anh ta.", "eng": "She crept in beside him under the bedclothes."}, {"viet": "Chị ta làm như không biết khi được hỏi ý kiến về vấn đề đó.", "eng": "She dissemble when asked her opinion on the subject."}, {"viet": "Cô ta cảm thấy thù địch đối với các bạn chồng.", "eng": "She felt adverse to her husband's friends."}, {"viet": "Cô ta đã dùng bọt biển cọ mạnh khắp tất cả mặt sàn.", "eng": "She gave the floor a vigorous sponge all over."}, {"viet": "Khi còn thiếu thời bà ta đã có mặt trên sân khấu chuyên nghiệp.", "eng": "She had been on the professional stage in her youth."}, {"viet": "Bà ấy đã diễn thuyết trước các thính giả khắp đất nước.", "eng": "She has addressed audiences all over the country."}, {"viet": "Cô ta không cưỡi ngựa đi chơi nữa từ sau vụ tai nạn.", "eng": "She hasn't been out riding since the accident."}, {"viet": "Cô ta gốc người Anh nhưng lấy chồng người Việt Nam.", "eng": "She is English by birth but Vietnamese by marriage."}, {"viet": "Cô ta phải sầy vẩy mới vào được đại học với những giấy chứng nhận khả năng quá ít ỏi.", "eng": "She just scraped into university with the minimum qualifications."}, {"viet": "Cô ta sẽ không bao giờ có thể nhìn lại được nữa.", "eng": "She'll never be able to see again."}, {"viet": "Cô ấy tỏ ra ít quan tâm vào việc nghiên cứu.", "eng": "She manifested little interest in her studies."}, {"viet": "Cô ta khoá móc xe đạp của cô vào thanh vịn cầu thang.", "eng": "She padlocked her bike to the railings."}, {"viet": "Thế rồi trong đà bực tức, cô đã kết hôn với Peter.", "eng": "She quarrelled with Paul and then married Peter on the rebound."}, {"viet": "Cô ta là một người có thế lực khó ưa nhất.", "eng": "She's a most undesirable influence."}, {"viet": "Cô ấy rất si mê Arthur Higgins.", "eng": "She's mad keen on Arthur Higgins."}, {"viet": "Cô ấy ngồi ở một góc và nghĩ tới điều vui mừng sắp tới.", "eng": "She sat in the corner and brooded over the delight to come."}, {"viet": "Bà ta tỏ ra hoàn toàn thành thạo trong việc điều khiển cuộc thảo luận.", "eng": "She showed complete mastery in her handling of the discussion."}, {"viet": "Cô ta nói với chúng tôi trong những lúc tỉnh táo.", "eng": "She spoke to us in her conscious moments."}, {"viet": "Tuần sau thi, nên cô ấy học khuya lắm.", "eng": "She takes her exams next week, so she's burning the midnight oil."}, {"viet": "Cô ta cố đến thăm chồng trong tù nhưng không được vào.", "eng": "She tried to see her husband in prison but was denied access."}, {"viet": "Cô ta muốn rời khỏi nơi hiu quạnh đó.", "eng": "She wants to move from that godforsaken place."}, {"viet": "Cô ta đã bị tán tỉnh chấp nhận một hợp đồng mới.", "eng": "She was cajoled into accepting a new contract."}, {"viet": "Cô ta nửa bực bội, nửa vui vui trước vẻ kiêu ngạo của anh ta.", "eng": "She was half annoyed, half amused at his arrogance."}, {"viet": "Cô ấy ở ngoài tầm nghe tiếng nói của tôi.", "eng": "She was out of range of my voice."}, {"viet": "Cô ta tuyệt không hay biết mình có vẻ ngu ngốc như thế nào.", "eng": "She was sublimely unaware of how foolish she looked."}, {"viet": "Cô ấy không thực sự khóc đâu, cô ấy chỉ giả vờ thôi.", "eng": "She wasn't really crying, she was only pretending."}, {"viet": "Cô ta sẽ không chịu nổi lâu dài công việc đó-vì nó quá vất vả.", "eng": "She won't last long in that job-it's so tough."}, {"viet": "Cô ta giật mạnh sợi dây thừng nên nó đứt.", "eng": "She yanked on the rope and it broke."}, {"viet": "Cởi áo choàng của mình ra cho mát.", "eng": "Shucked their coats and cooled off."}, {"viet": "Hãy hát to lên để chúng tôi có thể nghe được bạn.", "eng": "Sing up, let's hear you."}, {"viet": "Tất cả những chi phí phụ nhỏ nhoi trở thành một số lượng lớn.", "eng": "Small extra costs all swell the total."}, {"viet": "Thế là tôi đã ở tù ba năm.", "eng": "So I've been in prison for three years."}, {"viet": "Binh lính được điều đến để dẹp các cuộc nổi loạn.", "eng": "Soldiers were sent in to quell the riots."}, {"viet": "Một số trẻ em bị lạm dụng tình dục.", "eng": "Some of the children had been sexually abused."}, {"viet": "Trong thập kỉ qua, nhiều chủng loại đã biến mất hoàn toàn.", "eng": "Some species have disappeared altogether in the last decade."}, {"viet": "Lúc thì chúng tôi ra bãi biển, lúc thì chúng tôi tắm nắng ở sân trong.", "eng": "Sometimes we went to the beach and at other times we sunbathed on the patio."}, {"viet": "Tốc độ được giới hạn trong các thành phố là 30 dặm Anh một giờ.", "eng": "Speed is restricted to 30 mph in towns."}, {"viet": "Cứ ở ngoài phòng đợi nếu em muốn, nhưng nhớ rằng cuộc trình diễn bắt đầu trong hai phút nữa.", "eng": "Stay in the foyer if you wish, but bear in mind that the performance begins in two minutes."}, {"viet": "Thôi đừng đùa giỡn nữa và tiếp tục công việc đi.", "eng": "Stop playing around and get on with the job."}, {"viet": "Đưa luận án đó ra xem xét kỹ lưỡng.", "eng": "Subject the thesis to careful scrutiny."}, {"viet": "Cái hộp bỗng nhiên bật mở và một con chó con nhảy ra.", "eng": "Suddenly the box split open and a puppy jumped out."}, {"viet": "Từ trên đỉnh đồi quan sát cánh đồng quê.", "eng": "Survey the countryside from the top of the hill."}, {"viet": "Thực hiện những biện pháp chữa trị nạn thất nghiệp.", "eng": "Take remedial measures against unemployment."}, {"viet": "Những giọt nước mắt là bằng chứng cho nỗi đau khổ của cô ta.", "eng": "Tears that testified to her grief."}, {"viet": "Cám ơn, nhưng tự tôi sẽ xoay xở được mà.", "eng": "Thank you, but I'll manage all right myself."}, {"viet": "Từ trước tới giờ đây là bữa ăn ngon nhất mà tôi được ăn, không còn bữa nào ngon hơn được nữa.", "eng": "That's the best meal I've had, bar none."}, {"viet": "Điều đó không có nghĩa là tôi không làm nổi một công việc.", "eng": "That doesn't mean I can't do a job."}, {"viet": "Ông ấy có thể phát hiện một câu chuyện thời sự ở bất cứ nơi nào.", "eng": "That man can nose out a news story anywhere."}, {"viet": "Láo xược bấy nhiêu đó đủ rồi!", "eng": "That's enough of your cheek!"}, {"viet": "Chơi xỏ Marry là một trò ma mãnh khá hèn hạ đấy.", "eng": "That was a pretty mean trick to play on Mary."}, {"viet": "Tai nạn-kết quả là ba người bị chết.", "eng": "The accident resulted in three people being killed."}, {"viet": "Phần nhào lộn trên không là phần hay nhất của buổi biểu diễn.", "eng": "The aerobatics were the best part of the show."}, {"viet": "Người xưa quan niệm rằng trái đất dẹp.", "eng": "The ancients conceived of the world as being flat."}, {"viet": "Kiến trúc ở khu trung tâm thành phố là sự kết hợp thành công giữa cái cũ và mới.", "eng": "The architecture in the town centre is a successful combination of old and new."}, {"viet": "Người bán hàng ghi giá quần áo trước khi trưng bày.", "eng": "The assistant priced the garments before putting them on display."}, {"viet": "Ở đây lượng tuyết rơi trung bình là 10 cm một năm.", "eng": "The average snowfall here is 10 cm a year."}, {"viet": "Quả bóng bay thẳng qua cửa sổ.", "eng": "The ball went smack through the window."}, {"viet": "Tiểu đoàn được xếp thành những đại đội trên sân doanh trại.", "eng": "The battalion formed up by companies on the barrack square."}, {"viet": "Tội càng to thì càng bị tống giam lâu.", "eng": "The bigger the crime, the longer the gaol sentence."}, {"viet": "Ban giám đốc một bệnh viện.", "eng": "The board of governors of a hospital."}, {"viet": "Quyển sách đó trình bày toàn cảnh lịch sử của nước Anh từ thời kỳ Trung cổ.", "eng": "The book presents a panorama of British history since the Middle Ages."}, {"viet": "Cậu bé bước đi với những bước tự tin đàn ông.", "eng": "The boy walked with a confident manly stride."}, {"viet": "Kinh nghiệm nhiều hơn của cầu thủ Anh cho anh ta một lợi thế nhất định.", "eng": "The British player's greater experience gives him a theoretical advantage."}, {"viet": "Chiếc xe buýt ngừng lại để cho một bà cụ xuống.", "eng": "The bus stopped to set down an old lady."}, {"viet": "Anh đội trưởng hết quyền đánh gậy sau khi ghi mới được 3 điểm chạy.", "eng": "The captain was out for three."}, {"viet": "Chiếc xe ôtô đã dừng lại cách bức tường khoảng một insơ.", "eng": "The car stopped within a fraction of an inch of the wall."}, {"viet": "Con mèo bị chiếc xe tải chẹt nát Anh ta ngồi lên chiếc mũ của mình và làm bẹp nó.", "eng": "The cat run over by the lorry and squashed He sat on his hat and squashed it flat."}, {"viet": "Sự thay đổi thời tiết có thể ảnh hưởng tới sức khoẻ của anh.", "eng": "The change in climate may affect your health."}, {"viet": "Đứa trẻ đang trải qua một thời kỳ khó khăn.", "eng": "The child is going through a difficult phase."}, {"viet": "Trẻ em còn nhỏ quá không thể ngồi nghe được hết buổi hoà nhạc dài.", "eng": "The children are too young to sit through a long concert."}, {"viet": "Bọn trẻ nhòm từ cửa sổ trên gác.", "eng": "The children watched from an upstairs window."}, {"viet": "Hình tròn, hình vuông và hình đa giác là những hình của hình học phẳng.", "eng": "The circle, square, and polygon are plane figures."}, {"viet": "Ngày hết hạn nộp đơn là ngày một tháng Năm.", "eng": "The closing date for applications is 1 May."}, {"viet": "Trường đại học đón tiếp một nhóm các nhà khoa học Nga sang thăm.", "eng": "The college is playing host to a group of visiting Russian scientists."}, {"viet": "Kế toán của công ty cho thấy có một trò ảo thuật về tài chính.", "eng": "The company accounts show a little financial sleight of hand."}, {"viet": "Những lời than phiền vẫn cứ tiếp tục trong cùng một tâm trạng.", "eng": "The complaints continued in the same vein."}, {"viet": "Những thứ bên trong hộp rơi xuống bàn.", "eng": "The contents of the box fell onto the floor."}, {"viet": "Nền kinh tế đất nước đó phụ thuộc vào du lịch.", "eng": "The country's economy is dependent on tourism."}, {"viet": "Những người có mặt trong phòng xử án đều đứng dậy khi quan tòa bước vào.", "eng": "The court rose as the judge entered."}, {"viet": "Đám đông uống lấy từng lời ông ta nói.", "eng": "The crowd lapped up every word he said."}, {"viet": "Cuộc tranh luận sôi nổi trong quốc hội.", "eng": "The cut and thrust of parliamentary debate."}, {"viet": "Quyết định được sự tán thành của hội đồng.", "eng": "The decision met with the committee's approval."}, {"viet": "Lời mô tả là'sản phẩm của nhiều nước'có thể che giấu một thực tế tồi tệ.", "eng": "The description'produce of more than one country'can cover a multitude of sins."}, {"viet": "Các giám đốc cố tống khứ bà ấy đi nhưng tất cả nhân viên của bà đã ủng hộ bà.", "eng": "The directors were trying to get rid of her, but her staff all supported her."}, {"viet": "Bác sĩ phát hiện gan của cô ấy bị bệnh.", "eng": "The doctor discovered that her liver was diseased."}, {"viet": "Con chó sợ run khi chủ nó quát.", "eng": "The dog cowered when its master shouted at it."}, {"viet": "Thuận lợi đôi đường vừa dễ dùng vừa rẻ.", "eng": "The double advantage of being easy and cheap."}, {"viet": "Thuốc nhuộm đó không ngấm màu trong nước lạnh.", "eng": "The dye won't take in cold water."}, {"viet": "Cuộc bầu cử trở thành không may cho những người trong Đảng bảo thủ.", "eng": "The election went badly for the Conservatives."}, {"viet": "Sự dã man của tội ác đó đã làm choáng váng thậm chí cả những người cảnh sát từng trải.", "eng": "The enormity of the crime has shocked even experienced policemen."}, {"viet": "Kỳ thi đang tới gần, gây lo lắng.", "eng": "The exams are getting uncomfortably close."}, {"viet": "Việc cô ta có mặt ở đây hàm ý một mức độ quan tâm nào đấy.", "eng": "The fact she was here implies a degree of interest."}, {"viet": "Cậu bé béo phị đã bị các bạn trong lớp trêu chọc.", "eng": "The fat boy was victimized by his classmates."}, {"viet": "Bộ phim đã nhận được sự hoan nghênh của giới phê bình.", "eng": "The film has received critical acclaim."}, {"viet": "Sắp bắt đầu bắn pháo hoa rồi đấy.", "eng": "The fireworks are about to begin."}, {"viet": "Điểm đầu tiên là: thị trường có tiềm năng.", "eng": "The first one is: potential market."}, {"viet": "Bộ phận chỉnh tiêu điểm máy ảnh của tôi không còn hoạt động tốt nữa.", "eng": "The focus on my camera isn't working properly."}, {"viet": "Sự tự do thoải mái và những khoảng đất trống ở nông thôn.", "eng": "The freedom and space of the countryside."}, {"viet": "Băng du đãng bỏ chạy khi nghe tiếng xe cảnh sát.", "eng": "The gang took to flight when they heard the police car."}, {"viet": "Nụ cười thoáng hiện trên môi cô ta.", "eng": "The ghost of a smile played round her lips."}, {"viet": "Việc chính phủ dự liệu những biện pháp mới.", "eng": "The Government's contemplation of new measures."}, {"viet": "Chính quyền phải dự phòng số lượng dầu có thể thiếu trong những tháng tới.", "eng": "The government has to provide against a possible oil shortage in the coming months."}, {"viet": "Chính phủ sẽ phải sớm thông báo ngày bầu cử.", "eng": "The government will have to announce the date of the election soon."}, {"viet": "Những căn hộ ở tầng trệt đã bị phá hoại trầm trọng.", "eng": "The ground-floor flats had been badly vandalized."}, {"viet": "Hố sâu ngăn cách giữa hai nhà lãnh đạo không thể vượt qua được.", "eng": "The gulf between the two leaders cannot be bridged."}, {"viet": "Mưa nặng hạt làm bãi cưỡi ngựa chạy êm.", "eng": "The heavy rain made the course ride soft."}, {"viet": "Con ngựa đã bất ngờ vung hai chân sau đá.", "eng": "The horse lashed out with its back legs."}, {"viet": "Ngôi nhà này thể hiện ý tưởng của chúng tôi về một ngôi nhà hiện đại.", "eng": "The house embodies our idea of a modern home."}, {"viet": "Cơ thể con người là một hệ thống hết sức phức tạp.", "eng": "The human body has very complex organization."}, {"viet": "Sự cố đó đã để lại một ấn tượng sâu đậm trong tôi.", "eng": "The incident left a vivid impression on me."}, {"viet": "Ông thanh tra đó đi xuống mỏ.", "eng": "The inspector went down the mine."}, {"viet": "Cái xương hàm đó là vật khám phá có ích nhất của chúng tôi.", "eng": "The jawbone was our most valuable discovery."}, {"viet": "Những vấn đề hấp dẫn bề ngoài đã chiếm ưu thế trong cuộc bầu cử năm nay.", "eng": "The junk issues that have dominated this year's election."}, {"viet": "Hình đăng ten của một mạng nhện.", "eng": "The lacy pattern of a spider's web."}, {"viet": "Luật pháp phân biệt giữa ngộ sát và cố sát.", "eng": "The law discriminates between accidental and intentional killing."}, {"viet": "Bức thư là một sự nhắc nhở gây lo lắng về các món nợ của tôi.", "eng": "The letter was an uncomfortable reminder of my debts."}, {"viet": "Chúng tôi đã điền thêm tên các thành viên mới, bây giờ bản danh sách này là cập nhật.", "eng": "The list is up to date now that we've added the new members'names."}, {"viet": "Mức thấp nhất về tiền bạc của công ty.", "eng": "The low-water mark of the company's fortunes."}, {"viet": "Chim đực giao cấu với chim cái.", "eng": "The male bird copulates with the female."}, {"viet": "Cột buồm bị uốn cong suốt trận bão.", "eng": "The mast was bent during the storm."}, {"viet": "Cuộc họp được xem như là bước đầu nhằm tiến tới sự hợp nhất lớn hơn giữa các đảng phái.", "eng": "The meeting is seen as the first step towards greater unity between the parties."}, {"viet": "Cuối cùng, quả thuỷ lôi nằm yên dưới đáy biển.", "eng": "The mine finally came to rest on the sea bed."}, {"viet": "Đơn vị tiền tệ của Nhật Bản là đồng yên.", "eng": "The monetary unit of Japan is the yen."}, {"viet": "Đề nghị đó được tán thành với mười phiếu thuận, sáu phiếu chống.", "eng": "The motion was carried by ten votes to six."}, {"viet": "Tên và địa chỉ của công ti in nổi trên giấy của nó.", "eng": "The name and address of the firm are embossed on its paper."}, {"viet": "Hệ thống computer mới đắt nhưng tiền tiết kiệm cuối cùng nó sẽ đem lại thì hết sức có ý nghĩa.", "eng": "The new computer system is expensive, but the eventual savings it will bring me very significant."}, {"viet": "Sản phẩm mới đã đưa công ty lên hàng đầu trong lĩnh vực phần mềm vi tính.", "eng": "The new product took the company to the forefront of the computer software field."}, {"viet": "Nguồn tin được truyền trực tiếp từ Anh đến Nhật.", "eng": "The news was beamed live from Britain to Japan."}, {"viet": "Bức thư không có tên, chỉ kí là Người có thiện ý.", "eng": "The note was anonymous, signed only A well-wisher."}, {"viet": "Biển thật trong suốt và tuyệt đẹp.", "eng": "The ocean is crystal clear and beautiful."}, {"viet": "Bà già hết sức bực mình vì sự ồn ào của bọn trẻ.", "eng": "The old lady was most displeased with the children's noisy behaviour."}, {"viet": "Ý kiến của sinh viên, cử tri, xã hội, v. v. nói chung.", "eng": "The opinion of students, voters, society, etc at large."}, {"viet": "Gan bàn chân cũng giữ cho chân chúng không lún sâu xuống cát.", "eng": "The pads also keep their feet from sinking down into the sand."}, {"viet": "Đảng có thể liên kết với Công đảng thành một liên minh mới.", "eng": "The party may realign with Labour in a new coalition."}, {"viet": "Ông chủ của những tên lừa đảo tép riu này là những tổ chức tội ác lớn.", "eng": "The paymasters of these petty crooks are the big crime syndicates."}, {"viet": "Các máy bơm xăng tính theo lít.", "eng": "The petrol pumps have gone metric."}, {"viet": "Viên phi công tìm cách tránh đụng độ với máy bay địch.", "eng": "The pilot took evasive action to avoid a collision with the enemy aircraft."}, {"viet": "Phi cơ bắt đầu lao thẳng xuống.", "eng": "The plane went into a nosedive."}, {"viet": "Những vở kịch ở đây bao giờ cũng đông khán giả.", "eng": "The plays here are always well attended."}, {"viet": "Cảnh sát đã phát hiện thấy địa chỉ tìm thấy ở người bị giết là một địa chỉ bí mật.", "eng": "The police discovered that the address found on the murdered man was a mail drop."}, {"viet": "Cảnh sát khám xét cô ta để tìm ma túy.", "eng": "The police searched her for drugs."}, {"viet": "Liên hoan nhạc Pop đã làm những người dân thuần phác ở Canterbury bất bình.", "eng": "The pop festival has shocked the good burghers of Canterbury."}, {"viet": "Vùng đồng cỏ trải rộng tứ phía đến tận chân trời.", "eng": "The prairies stretch on all sides as far as the eye can see."}, {"viet": "Tổng thống muốn ổn định nền kinh tế.", "eng": "The President wants to put the economy right-side up."}, {"viet": "Ông Thủ tướng đã đập tơi bời những luận điệu của phe đối lập.", "eng": "The Prime Minister made mincemeat of his opponent's arguments."}, {"viet": "Vấn đề chủng tộc là một tình huống tiềm tàng chứa đựng sự bùng nổ.", "eng": "The problem of race is a potential powder key."}, {"viet": "Tỷ lệ giữa con gái và con trai ở trường là bằng nhau.", "eng": "The proportion of girls to boys in the school is about equal."}, {"viet": "Những người định cư Thanh giáo ở New England.", "eng": "The Puritan settlers in New England."}, {"viet": "Radio mở hơi to-anh có thể vặn nhỏ đi không?", "eng": "The radio's rather loud-can you turn it down?"}, {"viet": "Cuộc nổi loạn đã nhanh chóng bị quân đội đàn áp.", "eng": "The rebellion was soon stamped on by the army."}, {"viet": "Tiền thuê nhà hoá lí, ngoài ra địa điểm lại tuyệt vời.", "eng": "The rent is reasonable and moreover, the location is perfect."}, {"viet": "Kết quả hai cuộc thí nghiệm được kết hợp thành một.", "eng": "The results of the two experiments were conflated."}, {"viet": "Sông trở nên khô cạn trong thời gian hạn hán.", "eng": "The river ran dry during the drought."}, {"viet": "Mái đường hầm trong mỏ đã sụp đổ.", "eng": "The roof of the mine passage collapsed."}, {"viet": "Vận động viên chạy vẫn sung sức ở vòng cuối cùng.", "eng": "The runner is still going strong on the last lap."}, {"viet": "Vụ bê bối có thể làm chính phủ đổ.", "eng": "The scandal may bring down the government."}, {"viet": "Không khí ở biển đã tác động đến sức khoẻ của bà ta.", "eng": "The sea air has made a difference to her health."}, {"viet": "Viên trung sĩ ra lệnh cho binh lính của mình đứng vào hàng.", "eng": "The sergeant ordered his men to fall in."}, {"viet": "Chiếc tàu đã ra khơi xuôi gió.", "eng": "The ship sailed before the wind."}, {"viet": "Những màn ngắn tạo thành vở kịch.", "eng": "The short scenes that compose the play."}, {"viet": "Tình thế không cho phép bất kỳ sự trì hoãn nào.", "eng": "The situation does not permit of any delay."}, {"viet": "Lớp tuyết ở dưới chân xốp và dày.", "eng": "The snow underfoot was soft and deep."}, {"viet": "Con ngựa hung đó thắng cuộc dễ dàng.", "eng": "The sorrel easily won the race."}, {"viet": "Sự tăng đồng bộ của lương và giá cả.", "eng": "The spiral of rising wages and prices."}, {"viet": "Miếng bít tết này còn sống ở giữa.", "eng": "The steak was uncooked in the middle."}, {"viet": "Những mặt mạnh và yếu của một lý lẽ.", "eng": "The strengths and weaknesses of an argument."}, {"viet": "Bầu trời u ám báo hiệu thời tiết xấu.", "eng": "The sullen skies indicated bad weather."}, {"viet": "Các cuộc thương lượng đi đến chỗ cắt giảm số lượng tên lửa.", "eng": "The talks resulted in reducing the number of missiles."}, {"viet": "Các thầy giáo rất am hiểu trong lĩnh vực môn học của mình.", "eng": "The teachers are at home in their subjects."}, {"viet": "Bọn khủng bố bắn bừa bãi vào đám đông.", "eng": "The terrorists fired into the crowd at random."}, {"viet": "Làn sóng triều tạo thành một bức tường nước khủng khiếp.", "eng": "The tidal wave formed a terrifying wall of water."}, {"viet": "Thành phố mời dự cái tạm gọi là cuộc biểu diễn văn nghệ, nhưng chẳng có gì giống thứ mà anh thấy trong thành phố.", "eng": "The town offers entertainments of a kind, but nothing like what you'll find in the city."}, {"viet": "Cây đã đến ngày chặt đi đó đã được hoãn lại trong vòng sáu tháng.", "eng": "The tree that was due to be cut down has been reprieved for six months."}, {"viet": "Hai thành phần được tổng hợp bằng một quá trình hoá học.", "eng": "The two elements are synthesized by a chemical process."}, {"viet": "Công đoàn đã lên án ban quản trị về việc không xét đến việc đàm phán tiếp theo.", "eng": "The union accused the management of closing the door on further negotiation."}, {"viet": "Những lãnh thổ rộng lớn của đế chế Trung Hoa.", "eng": "The vast dominions of the Chinese Empire."}, {"viet": "Những người hầu bàn vấp cả vào nhau trong lúc họ hăng hái phục vụ.", "eng": "The waiters almost felt over themselves in their anxiety to please."}, {"viet": "Thời tiết là điều kiện quyết định trận đấu có được tổ chức hay không.", "eng": "The weather is one variable that will determine, whether the match would be played or not."}, {"viet": "Người mẹ goá và các con đang lâm vào tình trạng nghèo túng.", "eng": "The widow and children me very poorly off."}, {"viet": "Chữ ngày có hai nghĩa.", "eng": "The word day has two meanings."}, {"viet": "Những chiếc thuyền buồm đang di chuyển tìm vị trí,.", "eng": "The yachts were manoeuvring for position."}, {"viet": "Việc họ đính hôn được công bố trên báo địa phương.", "eng": "Their engagement was announced in the local paper."}, {"viet": "Vụ tai tiếng của họ thật sự đã gây rất nhiều lời bàn tán.", "eng": "Their scandal has really set tongues wagging."}, {"viet": "Vậy đây đúng là xe buýt đến đó rồi.", "eng": "Then this is the right bus."}, {"viet": "Giữa hai tỉnh này có một làng nhỏ.", "eng": "There's a small village midway between these two towns."}, {"viet": "Không có nhiều cô ả gợi tình ở bữa tiệc này.", "eng": "There's not much crumpet around at this party."}, {"viet": "Có nhiều chòm sao nằm ở khắp các hướng.", "eng": "There are constellations in every direction from the earth."}, {"viet": "Có vài lỗi sai trong tính toán.", "eng": "There are several errors in the calculations."}, {"viet": "Có rất nhiều sự bôi xấu chính trị trong cuộc đấu tranh giành phiếu bầu.", "eng": "There has been a lot of political mud-slinging in the battle for votes."}, {"viet": "Có rất nhiều nơi để tham quan.", "eng": "There is a lot to see."}, {"viet": "Chẳng mảy may sự thật nào trong lời đồn đại này.", "eng": "There is not an atom of truth in the rumour."}, {"viet": "Có một vụ cướp ngân hàng đêm qua, hãy nói cho tôi việc gì đã xảy ra.", "eng": "There was a bank robbery last night, let tell me what transpired."}, {"viet": "Ngày càng có nhiều sự chỉ trích cách chỉ đạo chiến tranh của chính phủ.", "eng": "There was growing criticism of the Government's conduct of the war."}, {"viet": "Chỉ có vẻn vẹn một trăm người có mặt.", "eng": "There were scarcely a hundred people present."}, {"viet": "Các vòng này được gọi là đảo san hô vòng.", "eng": "These circles are called atolls."}, {"viet": "Những người này để lại nhiều dấu vết.", "eng": "These people left many signs behind them."}, {"viet": "Họ dự kiến sẽ có số người tham dự đông đảo tại cuộc họp.", "eng": "They're expecting a large attendance at the meeting."}, {"viet": "Họ khuyên cô ấy đừng vội lập gia đình.", "eng": "They advised her against marrying quickly."}, {"viet": "Họ là sản phẩm của sự giàu có sau chiến tranh.", "eng": "They are the products of post-war affluence."}, {"viet": "Họ bắt được nó tằng tịu với vợ ông.", "eng": "They caught him messing about with your wife."}, {"viet": "Chúng chết vì ở trên mặt biển, áp suất bên trong cơ thể chúng lớn hơn nhiều so với áp suất bên ngoài.", "eng": "They do so because at the surface the pressure inside their bodies is much greater than the pressure outside."}, {"viet": "Chúng thừa hưởng tình cảm đó từ tôi.", "eng": "They get the feeling from me."}, {"viet": "Họ có tính cách giống nhau mà.", "eng": "They have the same type of personalities."}, {"viet": "Chúng làm tôi khó mà gặp được cô ta.", "eng": "They made it difficult for me to see her."}, {"viet": "Họ đã tìm được cha, mẹ đỡ đầu cho trẻ mồ côi.", "eng": "They placed the orphans with foster-parents."}, {"viet": "Họ thưởng thức các lạc của cuộc sống thôn dã.", "eng": "They savor the pleasures of country life."}, {"viet": "Họ đã thành công trong việc họ đã bắt tay vào làm.", "eng": "They succeeded in what they set out to do."}, {"viet": "Họ đi nghỉ tuần trăng mật ở Ý.", "eng": "They went to Italy for their honeymoon."}, {"viet": "Họ nổ súng bắn thỏ suốt cả buổi chiều.", "eng": "They were popping away at the rabbits all afternoon."}, {"viet": "Hồi tưởng lại thời thơ ấu xa xôi của mình đi.", "eng": "Think further back into your childhood."}, {"viet": "Trường hợp này không thể thử nghiệm bằng quy luật thông thường.", "eng": "This case is not amenable to the normal rules."}, {"viet": "Điều này không phù hợp với miêu tả.", "eng": "This does not answer to the description."}, {"viet": "Phát minh này báo trước thời đại của máy vi tính.", "eng": "This invention heralded the age of the computer."}, {"viet": "Đây là Công ty thương mại Phương Đông.", "eng": "This is the Oriental Trading Co."}, {"viet": "Đài kỷ niệm này dành để tưởng niệm những người chết trong chiến tranh.", "eng": "This memorial commemorates those who died in the war."}, {"viet": "Loại cây này cần được tưới hai lần một tuần.", "eng": "This plant needs to be watered twice a week."}, {"viet": "Hòn đảo này chứa đựng toàn bộ thiên nhiên thu nhỏ.", "eng": "This small island contains the whole of nature in microcosm."}, {"viet": "Đây là điềm rõ ràng của những điều sẽ xảy ra.", "eng": "This was a striking portent of things to come."}, {"viet": "Hàng ngàn vụ lừa đảo xảy ra mỗi năm.", "eng": "Thousands of frauds are committed every year."}, {"viet": "Tom lạnh quá nằm co ro sát lò sưởi.", "eng": "Tom was cold so he huddled up against the radiator."}, {"viet": "Những người đàm phán của công đoàn đang kiên trì không nhượng bộ nhằm đạt được giải pháp tiền lương cao hơn.", "eng": "Union negotiators are holding out for a more generous pay settlement."}, {"viet": "Tôi đã bị chọn làm người công bố các tin tức xấu.", "eng": "Was picked on to announce the bad news."}, {"viet": "Chúng ta đành phải chấp nhận nguy cơ có thể gặp một toán địch tuần tiễu.", "eng": "We'll have to chance meeting an enemy patrol."}, {"viet": "Chúng tôi có một cuộc họp mặt nhỏ để mừng David được đề bạt.", "eng": "We're having a little get-together to celebrate David's promotion."}, {"viet": "Chúng tôi đã đi tìm một ngôi nhà hàng tháng nay rồi và tôi nghĩ rằng đó là cái nhà này.", "eng": "We've been looking for a house for months and I think this is it."}, {"viet": "Chúng tôi tình cờ tìm được câu trả lời đúng.", "eng": "We accidentally discovered the right answer."}, {"viet": "Chúng ta ở đây để chứng kiến sự kết hợp của hai người trong hôn ước.", "eng": "We are here to witness the union of two people in marriage."}, {"viet": "Chúng tôi ném bom thành phố của họ để trả thù những cuộc tấn công của họ vào thành phố của chúng tôi.", "eng": "We bombed their cities in revenge for their attacks on ours."}, {"viet": "Chúng ta thường liên hệ giữa tuổi tác với mức độ xảy ra thường xuyên của bệnh tật.", "eng": "We can often correlate age with frequency of illness."}, {"viet": "Chúng tôi muốn một bàn dành cho bốn người.", "eng": "We'd like a table for four."}, {"viet": "Cuối cùng chúng tôi đã đến nơi.", "eng": "We eventually arrived at our destination."}, {"viet": "Chúng tôi bị xóc nảy người ở phía sau chiếc xe tải cũ kĩ.", "eng": "We had a very jerky in ride in the back of the old truck."}, {"viet": "Chúng tôi trở nên quen với công việc mới của mình.", "eng": "We have become accustomed to our new duties."}, {"viet": "Chúng tôi phải ở lại từ thứ ba cho đến thứ sáu.", "eng": "We have to stay from Tuesday to Friday."}, {"viet": "Chúng tôi rất thích khách sạn này nên năm nay chúng tôi cũng sẽ lại tới đó.", "eng": "We liked the hotel so much that we're going there again this year."}, {"viet": "Chúng ta phải tránh lặp lại sự cố gắng lãng phí.", "eng": "We must avoid wasteful duplication of effort."}, {"viet": "Chúng tôi cần một nghìn vai phụ cho cảnh đám đông quần chúng.", "eng": "We need a thousand extras for the big crowd scene."}, {"viet": "Chúng tôi dựng hàng rào lên và đóng vào vị trí.", "eng": "We raised the fence and fixed it in position."}, {"viet": "Chúng ta sẽ không bao giờ ngần ngại ( với nhiệm vụ ) nói hết sự thật cho dân chúng.", "eng": "We shall never flinch from ( the task of ) telling the people the whole truth."}, {"viet": "Chúng tôi cứ nghĩ anh ta chết rồi, nhưng rồi chúng tôi nghe thấy tim anh ta đập.", "eng": "We thought he was dead, but then we detected a heartbeat."}, {"viet": "Chúng tôi đã gắng sức và đã hoàn thành công việc nhanh chóng.", "eng": "We went to it and got the job done quickly."}, {"viet": "Chúng tôi lâm vào tình thế bế tắc khi ô tô của chúng tôi hỏng.", "eng": "We were stranded when our car broke down."}, {"viet": "Những vũ khí có thể gây ra sự huỷ diệt nhân loại.", "eng": "Weapons that could prove to be the destruction of humankind."}, {"viet": "À, nếu có nhiều tiền, tôi sẽ khỏi làm việc.", "eng": "Well, if I had a lot of money I wouldn'd have to work."}, {"viet": "Có nhiều tranh của hoạ sĩ Anh không?", "eng": "Were there many pictures by British artists?"}, {"viet": "Còn luật chống cho vay nặng lãi thời Trung cổ thì sao?", "eng": "What about the laws against usury during the Middle Ages?"}, {"viet": "Vậy việc chúng ta nhìn thấy các chòm sao nào khi nhìn lên bầu trời, còn tùy thuộc một phần vào từng thời điểm trong đêm.", "eng": "What constellations we see as we look up at the sky depends partly, then, on what time of night it is."}, {"viet": "Bạn có những quan tâm gì về môi trường?", "eng": "What environmental concerns do you have?"}, {"viet": "Độ dài cho váy đầm hợp thời trang là bao nhiêu?", "eng": "What is the fashionable length for skirts?"}, {"viet": "Ông muốn dùng loại trái cây gì?", "eng": "What kind of fruit would you like to have?"}, {"viet": "Ở nước bạn, các ngân hàng có những dịch vụ nào?", "eng": "What services do banks offer in your country?"}, {"viet": "Điều bạn viết ra chẳng qua là vô nghĩa.", "eng": "What you have written is so much nonsense."}, {"viet": "Khi nghe được tin ấy, anh ta đã phản ứng với một ý thức căm giận.", "eng": "When he heard the news he reacted with a sense of outrage."}, {"viet": "Khi đánh giá thành tích của anh ta, đừng có tính đến tuổi tác của anh ấy.", "eng": "When judging his performance, don't take his age into account."}, {"viet": "Khi bố mẹ chết, lũ trẻ phải tự xoay xở lấy.", "eng": "When their parents died, the children had to shift for themselves."}, {"viet": "Cái thằng em vô tích sự của cậu đâu rồi?", "eng": "Where's that misbegotten brother of yours?"}, {"viet": "Ở mọi nơi nào có bất công thì chúng ta cố gắng giúp đỡ.", "eng": "Wherever there is injustice, we try to help."}, {"viet": "Bạn đọc phần nào trong báo trước tiên?", "eng": "Which section of the newspaper do you read first?"}, {"viet": "Ai đến tiệm giặt tự động vào ban đêm?", "eng": "Who comes to the Laundromat at night?"}, {"viet": "Tại sao bạn chọn đến Nhật Bản?", "eng": "Why did you choose to come to Japan?"}, {"viet": "Tại sao tôi lại phải hứng chịu khiển trách vì lỗi lầm của một người nào khác?", "eng": "Why should I take the blame for somebody else's mistakes?"}, {"viet": "Ông làm ơn giữ máy một lát được không?", "eng": "Will you hold the line a moment?"}, {"viet": "Với tất cả sự kính trọng thích đáng, tôi hoàn toàn không đồng ý.", "eng": "With all due respect, I disagree completely."}, {"viet": "Hoạt động vì sự hiểu biết tốt hơn giữa các tôn giáo trên thế giới.", "eng": "Work for a better understanding between world religions."}, {"viet": "Bạn có muốn tôi chỉ cho bạn cách gấp một người hầu bàn bằng giấy không?", "eng": "Would you like me to show you how to fold a paper footman?"}, {"viet": "Ông vui lòng điền vào biểu mẫu này?", "eng": "Would you please complete this form?"}, {"viet": "Bao năm làm cùng một việc buồn tẻ có thể biến anh thành một cái máy.", "eng": "Years of doing the same dull job can turn you into a machine."}, {"viet": "Có, tên tôi là Bill Smith.", "eng": "Yes, the name's Bill Smith."}, {"viet": "Bạn sẽ thấy đoạn cuối hết sức thích hợp.", "eng": "You'll find the last paragraph extremely apropos."}, {"viet": "Chúng tôi hết sức hoan nghênh các bạn tham gia với chúng tôi nếu các bạn muốn.", "eng": "You're most welcome to join us if you feel so disposed."}, {"viet": "Anh luôn luôn nhìn vào phía đen tối của sự việc.", "eng": "You always look on the dark side of things."}, {"viet": "Anh không thể rời đất nước không có hộ chiếu.", "eng": "You can't leave the country without a passport."}, {"viet": "Thưa ông, ông có thể để hành lý ở chỗ tôi.", "eng": "You can leave your baggage with me, sir."}, {"viet": "Anh đã xử lý một tình thế lúng túng rất khéo.", "eng": "You dealt with an awkward situation very tactfully."}, {"viet": "Anh đã bỏ qua một số lỗi trong bài này.", "eng": "You have overlooked several of the mistakes in this work."}, {"viet": "Trông cậu như cần được khích lệ.", "eng": "You look as though you need cheering up."}, {"viet": "Anh phải đi khám bác sĩ nếu anh ho ra máu.", "eng": "You must go to the doctor if you've coughing up blood."}, {"viet": "Anh biết đâu được tháng tới điều gì sẽ xảy ra.", "eng": "You never know what the next month have got in store."}, {"viet": "Anh không bao giờ được liều lĩnh khi đang lái xe ôtô.", "eng": "You should never take chances when driving a car."}, {"viet": "Anh phải đi chuyến xe buýt số 143 ở khu thương mại Kahala.", "eng": "You want a 143 from the Kahala Mall."}, {"viet": "Anh đổ tiếng xấu cho tôi nếu anh nghĩ rằng tôi làm điều đó chỉ vì những lý do ích kỷ.", "eng": "You wrong me if you think I only did it for selfish reasons."}, {"viet": "Mẹ cậu nổi cơn tam bành khi bà ta thấy cậu lấy xe của bà ấy.", "eng": "Your mother's going to have a conniption when she finds out you took her car."}]