[{"viet": "3 bảng Anh là quá rẻ đối với một quyển sách bìa cứng.", "eng": "£ 3 is very cheap for a hardback book."}, {"viet": "Một võ sĩ quyền Anh luyện tập căng thẳng ở phòng tập hằng ngày.", "eng": "A boxer who has a work-out in the gym every day."}, {"viet": "Điếu thuốc rực sáng trong đêm tối.", "eng": "A cigarette glowed in the dark."}, {"viet": "Một nhà nghỉ mát có vẻ đẹp theo kiểu xưa.", "eng": "A cottage with old-world charm."}, {"viet": "Một xe giao hàng đã chở hàng tạp hóa đặt mua.", "eng": "A delivery van has brought the grocery order."}, {"viet": "Một gã say rượu bước đi loạng choạng dọc theo lề phố.", "eng": "A drunken man lurching along the street."}, {"viet": "Đống bừa bộn mày làm ra đẹp đấy!", "eng": "A fine mess you've made of that!"}, {"viet": "Một người to lớn, với miệng thèm ăn kinh khủng.", "eng": "A gigantic person, with a gigantic appetite."}, {"viet": "Một chỗ ẩn núp của quân du kích trong núi.", "eng": "A guerrilla hide-out in the mountains."}, {"viet": "Một con ngựa đáp ứng nhanh theo nhu cầu người cưỡi của nó.", "eng": "A horse responsive to the needs of its rider."}, {"viet": "Một vùng đất xứng đáng là quê hương của các anh hùng.", "eng": "A land fit for heroes to live in."}, {"viet": "Một bảng liệt kê các luật ban hành cần phải thảo luận trong phiên họp.", "eng": "A list of must legislation for the session."}, {"viet": "Một người thường đi loanh quanh thu nhặt phế liệu.", "eng": "A man comes round regularly collecting scrap."}, {"viet": "Một sai lầm có nguy cơ phải trả giá đắt.", "eng": "A mistake that threatens to be costly."}, {"viet": "Một chính đảng mới thường ăn cắp tư tưởng của các đảng phái đối lập.", "eng": "A new political party usually poaches ideas from its rivals."}, {"viet": "Một gói hàng được buộc bằng dây ruy băng.", "eng": "A parcel tied up with tape."}, {"viet": "Một mảnh kính có cạnh sắc bén.", "eng": "A piece of glass with a jagged edge."}, {"viet": "Một nhà giảng đạo nổi tiếng về những bài thuyết giảng truyền cảm của ông ta.", "eng": "A preacher famous for his inspiring sermons."}, {"viet": "Một máy thu thanh có đủ cả túi đeo.", "eng": "A radio complete with a carrying case."}, {"viet": "Một con đường uốn khúc qua dãy núi Anpơ.", "eng": "A road that sinuates through the Alps."}, {"viet": "Một tai nạn có vẻ là xe đâm rồi bỏ chạy.", "eng": "A semblable hit-and-run accident."}, {"viet": "Một tình trạng có một không hai trong lịch sử nhà trường.", "eng": "A situation unprecedented in the history of the school."}, {"viet": "Một loại vải đặc biệt giữ thân nhiệt.", "eng": "A special fabric that traps body heat."}, {"viet": "Một thời gian học mải miết mệt mỏi của một sinh viên về Cicero.", "eng": "A student's weary slog through Cicero."}, {"viet": "Một cuộc công kích khủng bố bằng bom để trả đũa lại những vụ bắt giữ gần đây.", "eng": "A terrorist bomb attack in retaliation for recent arrests."}, {"viet": "Một cuộc đàm thoại bổ ích về các vấn đề chung.", "eng": "A useful dialogue on common problems."}, {"viet": "Một bản nghiên cứu sâu rộng những diễn biến mới đây trong việc bảo tồn đời sống hoang dã.", "eng": "A wide-range review of recent developments in wildlife conservation."}, {"viet": "Theo sách giáo khoa của tôi, tôi biết là nó cao khoảng 137 mét.", "eng": "According to my textbook, I know it is about 137 meters."}, {"viet": "Phải công nhận rằng, lúc đó anh ta không biết điều đó.", "eng": "Admittedly, he didn't know that at the time."}, {"viet": "Sau khi bị phê bình thậm tệ, vở kịch đó nhanh chóng ngừng diễn.", "eng": "After getting bad reviews the play quickly died the death."}, {"viet": "Sau đó mọi người bắt đầu chuẩn bị cho mùa xuân.", "eng": "After that people begin to prepare for spring."}, {"viet": "Chú trọng hơn nữa vào sự chính xác trong lối hành văn của ông.", "eng": "Aim for more precision in your style."}, {"viet": "Cả họ hàng nhà chúng tôi đến bữa tiệc mừng thọ bát tuần của ông nội.", "eng": "All our family came to our grandfather's eightieth birthday party."}, {"viet": "Tất cả cửa sổ đã được che kín ván.", "eng": "All the windows were boarded up."}, {"viet": "Tôi có phải ăn mặc đẹp không?", "eng": "Am I expected to dress up?"}, {"viet": "Một đám đông giận dữ chen lấn qua hàng rào cảnh sát và tiến vào đường phố.", "eng": "An angry crowd burst through the lines of police and into the street."}, {"viet": "Một bất động sản được bán đấu giá toàn bộ.", "eng": "An estate that was auctioned off lock, stock, and barrel."}, {"viet": "Một chuyến đi nước ngoài dự kiến vào tháng sau.", "eng": "An intended trip abroad next month."}, {"viet": "Một bản mô tả tổng quát các kế hoạch của công ty vào năm tới.", "eng": "An overview of the company's plans for the next year."}, {"viet": "Và khi nào chị muốn trở lại?", "eng": "And when do you want to come back?"}, {"viet": "Dù sao tôi cũng phải mang theo dù.", "eng": "Anyhow, I have to take my umbrella."}, {"viet": "Bây giờ có chương trình ca nhạc nào hay đang biểu diễn không?", "eng": "Are there any good musicals playing now?"}, {"viet": "Anh cứ ngồi chơi trong khi cô ấy phải làm hết mọi việc à?", "eng": "Are you going to sit on your hands while she does all the work?"}, {"viet": "Arizona là biểu bang có nhiều người da đỏ nhất.", "eng": "Arizona is the state with the most."}, {"viet": "Bởi vì lúc này mẹ cô ta rất nghèo nên cô ta không hy vọng vào nguồn giúp đỡ đó.", "eng": "As her mother was now very poor she could expect no help from that quarter."}, {"viet": "Xin phép nghỉ để dự lễ cưới.", "eng": "Ask for leave of absence to attend a wedding."}, {"viet": "Với tỉ lệ đó, ở chỗ đông người như thế này thì làm bồi bàn ở đây có thể kiếm được rất nhiều đấy.", "eng": "At that rate, being a waiter here in this busy place could be very profitable."}, {"viet": "Nhận thức được bối cảnh xung quanh ai.", "eng": "Awake to the one's surroundings."}, {"viet": "Cẩn thận với những cái đĩa này đấy, chúng dễ mẻ lắm.", "eng": "Be careful with these plates-they chip very easily."}, {"viet": "Được ban cho một đặc ân thấy được tương lai.", "eng": "Be vouchsafed a vision of the future."}, {"viet": "Tôi đảm bảo với anh, chính phủ sẽ không can thiệp vào hệ thống thuế.", "eng": "Believe you me, the government won't meddle with the tax system."}, {"viet": "Bị gió thổi bay khắp mọi hướng.", "eng": "Blown hither and thither by the wind."}, {"viet": "Nước Anh đã chuyển đổi sang tiền tệ thập phân vào ngày 15 tháng hai năm 197.", "eng": "Britain converted to decimal currency on February 15th, 197."}, {"viet": "Nhưng lúc này ông ấy có thể trở lại bất cứ lúc nào.", "eng": "But he should be back any minute now."}, {"viet": "Nhưng mức giá các ông đưa ra thì hơi cao.", "eng": "But the price you offered is rather high."}, {"viet": "Rời khỏi nhà cha mẹ của tôi là tôi đã cắt nguồn tiếp tế.", "eng": "By leaving my parents'home, I cut the umbilical cord."}, {"viet": "Anh có thể chữa cái đó hay là không?", "eng": "Can he mend it or not?"}, {"viet": "Thành phố có thể được bảo vệ chống cuộc tấn công không?", "eng": "Can the town be secured against attack?"}, {"viet": "Anh có thể nhận ra cái dù của anh trong cái đống này không?", "eng": "Can you identify your umbrella among this lot?"}, {"viet": "Có thể cho tôi biết rạp chiếu phim ở đâu không?", "eng": "Can you tell me where the movie theater is?"}, {"viet": "Bị bắt quả tang, hắn không còn cách nào khác là phải thú tội.", "eng": "Caught in the act, he had no alternative but to confess."}, {"viet": "Giày trẻ em không rẻ-hoàn toàn ngược lại.", "eng": "Children's shoes aren't cheap-quite the reverse."}, {"viet": "Quần áo không phù hợp đến tức cười.", "eng": "Clothes that were almost comically inappropriate."}, {"viet": "Tình trạng bất ổn của cộng đồng đang nhanh chóng tiến đến điểm bùng nổ.", "eng": "Community unrest is rapidly approaching the flash point."}, {"viet": "Số lượng đáng kể súc vật chết.", "eng": "Considerable numbers of animals have died."}, {"viet": "Bạn có thể giải thích nó một lần nữa không?", "eng": "Could you explain it once more?"}, {"viet": "Làm mất tác dụng của một chất độc.", "eng": "Counteract the effect of a poison."}, {"viet": "Bố ơi, đi lại chủ yếu bằng phương tiện gì vậy?", "eng": "Daddy, what is the main mode of transportation?"}, {"viet": "Yêu cầu là phải có sự cải tổ.", "eng": "Demands that there should be reform."}, {"viet": "Ra điều kiện cho kẻ thù bại trận.", "eng": "Dictate terms to a defeated enemy."}, {"viet": "Anh đã xem bức tranh gốc à?", "eng": "Did you see the original painting?"}, {"viet": "Viết lại hoàn toàn bài diễn văn ban đầu.", "eng": "Do a complete rewrite of the original speech."}, {"viet": "Liệu chúng ta có đòi phải có một vị Tổng thống ăn ảnh trên truyền hình không?", "eng": "Do we insist on a telegenic President?"}, {"viet": "Bạn có biết dàn stereo chất lượng cao không?", "eng": "Do you have a high quality stereo system?"}, {"viet": "Bạn biết người nào có óc hài hước không?", "eng": "Do you know anybody who has a very good sense of humor?"}, {"viet": "Em có cần kem và đường không?", "eng": "Do you need cream and sugar?"}, {"viet": "Theo bạn việc hút thuốc đang giảm hay đang tăng?", "eng": "Do you think that smoking is decreasing or increasing?"}, {"viet": "Anh ấy đi làm hay đi học?", "eng": "Does he work or go to school?"}, {"viet": "Đừng đi trễ, nếu không các em sẽ bỏ lỡ nó đấy.", "eng": "Don't be late or you'll miss it."}, {"viet": "Đừng quên các đồ tắm của bạn.", "eng": "Don't forget your swimming things."}, {"viet": "Đừng mở cửa, cho dù bất cứ ai đến.", "eng": "Don't open the door, no matter who comes."}, {"viet": "Đừng đem mấy món hàng cũ năm ngoái ra mà gạt tao mua!", "eng": "Don't try fobbing off last year's goods on me!"}, {"viet": "Trang trí đèn lên một cây Giáng sinh.", "eng": "Dress a Christmas tree with lights."}, {"viet": "Mỗi người phải được một phần công bằng.", "eng": "Each person must have an equitable share."}, {"viet": "Đội Anh sẽ thua trận-đó là điều chắc chắn!", "eng": "England will lose the match-that's a certainty!"}, {"viet": "Rốt cuộc anh ta chán không muốn cố gắng như thế nữa.", "eng": "Eventually he tired of trying so hard."}, {"viet": "Xin lỗi, nhưng tôi không nghĩ điều đó hoàn toàn đúng.", "eng": "Excuse me, but I don't think that's quite true."}, {"viet": "Cảnh sát tiếp viện đến vừa đúng lúc.", "eng": "Extra police arrived not a moment too soon."}, {"viet": "Cảm thấy khiếp đảm trước sự đổ máu.", "eng": "Feel a sense of revulsion at the bloodshed."}, {"viet": "Tốt, trong vài ngày nữa tôi sẽ trở lại gặp bạn và cho bạn biết.", "eng": "Fine, I'll get back to you in a couple of days and let you know."}, {"viet": "Ngập ngừng suốt một bài diễn văn chuẩn bị chưa kỹ.", "eng": "Flounder through a badly prepared speech."}, {"viet": "Đối với một số người thì việc trị liệu theo nhóm có hiệu quả, nhưng với em thì không.", "eng": "For some people, group therapy is effective, but it wasn't for me."}, {"viet": "Cà chua tươi được chở tới bằng máy bay từ quần đảo Canary.", "eng": "Fresh tomatoes lifted in from the Canary Islands."}, {"viet": "Thông thường, sau món chính có món tráng miệng nào đó.", "eng": "Generally, there is some dessert after the main course."}, {"viet": "Trả lời thẳng thắn một câu hỏi thẳng thắn.", "eng": "Give a straight answer to a straight question."}, {"viet": "Hãy đi mua thêm một ít dầu để chúng ta khỏi bị thiếu.", "eng": "Go and get some more oil so we don't run short."}, {"viet": "Các kế hoạch của chính phủ về một cuộc tiêm ngừa bệnh sởi quy mô.", "eng": "Government plans for a mass immunization against measles."}, {"viet": "Treo bức tranh trên phía bức tường đối diện với cửa sổ.", "eng": "Hang the picture on the wall opposite the window."}, {"viet": "Tất cả các bạn đã có phần chia công bằng chưa?", "eng": "Have you all had a fair whack?"}, {"viet": "Cậu đã nghĩ ra cái gì trục trặc ở xe của cậu chưa?", "eng": "Have you figured out what wrong with your car?"}, {"viet": "Trò chuyện nhỏ nhẹ với một người bạn.", "eng": "Having a quiet conversation with a friend."}, {"viet": "Hắn ta là một kẻ gian xảo, không làm ăn được với hắn.", "eng": "He's a tricky fellow to do business with."}, {"viet": "Nó đã lớn rồi đi ra ngoài không cần bố mẹ nữa.", "eng": "He's big enough to go out without his parents."}, {"viet": "Hắn chỉ toàn chuyện khoác lác, cái thằng huênh hoang ngu ngốc!", "eng": "He's just full of wind, the pompous fool!"}, {"viet": "Anh ta còn nằm bệnh viện nhưng đã có vẻ tươi tỉnh lắm.", "eng": "He's still in hospital, but he seems quite perky."}, {"viet": "Ông ta đồng ý, dù ông ta cảm thấy điều đó hoàn toàn ngược lại với sự phán đoán sáng suốt của mình.", "eng": "He agreed, but very much against his better judgment."}, {"viet": "Anh ấy đã trở thành một vận động viên hàng đầu với sự hy sinh phần nào đối với bản thân mình.", "eng": "He became a top sportsman at some sacrifice to himself."}, {"viet": "Hôm qua anh ấy đã đến đây, và đó là sự thực!", "eng": "He came here yesterday, and that's a fact!"}, {"viet": "Nó hay nuốt chữ khi nói.", "eng": "He clipped his words when speaking."}, {"viet": "Anh ấy dám chịu ông ngoại giận khi anh ta bỏ việc nhà.", "eng": "He dared his grandfather's displeasure when he left the family business."}, {"viet": "Nó chia sức ra để hoạt động chính trị và kinh doanh.", "eng": "He divides his energies between politics and business."}, {"viet": "Anh ấy dựng nên một dụng cụ gì đó để hứng nước mưa.", "eng": "He erected some contrivance for storing rain-water."}, {"viet": "Ông ấy nhận thấy cuộc sống ở thôn quê hợp với ông ta hơn là ở thành thị.", "eng": "He finds country life preferable to living in the city."}, {"viet": "Anh ấy nhường chỗ ngồi cho một phụ nữ mang thai.", "eng": "He gave up his seat to a pregnant woman."}, {"viet": "Anh ấy cài một nhành hoa ở khuyết áo.", "eng": "He had a spray in his button hole."}, {"viet": "Anh ta nắm vững ngôn ngữ Pháp.", "eng": "He has a good command of the French language."}, {"viet": "Ông ta chẳng nói gì với chúng tôi về việc ông ta định làm gì.", "eng": "He has given us no intimation of what he intends to do."}, {"viet": "Anh ta chẳng được lợi ích gì qua kinh nghiệm đó.", "eng": "He hasn't benefited from the experience."}, {"viet": "Ông ta sợ rằng mình có thể làm mất khách hàng.", "eng": "He is afraid that he might lose customers."}, {"viet": "Ông ta thiên về việc cải cách dần hơn là cách mạng.", "eng": "He is reformist rather than revolutionary."}, {"viet": "Hắn cứ nghĩ đi nghĩ lại bài toán đó cho đến khi giải được mới thôi.", "eng": "He kept chipping away at the problem until he had solved it."}, {"viet": "Lúc thiếu thời ông ta sống ở Edinburgh.", "eng": "He lived in Edinburgh as a boy."}, {"viet": "Nó đã làm một công việc không phải nhà nghề khi dựng cho chúng tôi một căn lều ở trong vườn.", "eng": "He made a very unprofessional job of putting up the garden shed for us."}, {"viet": "Anh ta lẩm bẩm mấy lời xin lỗi và ngay sau đó anh ta bỏ đi.", "eng": "He muttered a few words of apology and with that he left."}, {"viet": "Ông ta đã chia mảnh đất ra từng lô nhỏ.", "eng": "He parcelled out the land into small plots."}, {"viet": "Ông ta khai là không biết gì về âm mưu đó cả.", "eng": "He professed that he knew nothing about the plot."}, {"viet": "Nó chạy quành góc phố và đâm sầm vào cột đèn.", "eng": "He ran round the corner and banged straight into a lamp-post."}, {"viet": "Anh ta đã đặt quá nhiều lòng tin vào lời hứa của nàng.", "eng": "He reposed too much confidence in her promises."}, {"viet": "Anh ấy đúng là người xông xáo!", "eng": "He's a real go-getter!"}, {"viet": "Hắn ta đang giáp mặt với dây thòng lọng treo cổ.", "eng": "He's facing the hangman's noose."}, {"viet": "Tôi e là ông ấy không có đây.", "eng": "He's not in, I'm afraid."}, {"viet": "Anh ta rất thân thiết với ông chủ.", "eng": "He's well in with the boss."}, {"viet": "Anh ta gãi đầu với vẻ lúng túng.", "eng": "He scratched his head with a perplexed air."}, {"viet": "Ông ta hét to bảo tôi rằng thuyền đang chìm.", "eng": "He shouted to me that the boat was sinking."}, {"viet": "Anh ta cả tuần ở trong thành phố còn chủ nhật thì ở nhà.", "eng": "He spends the week in town but is at home on Sundays."}, {"viet": "Hắn lấy cắp đồ đạc ngay trước mắt tôi.", "eng": "He stole the stuff from under my very eyes."}, {"viet": "Anh ta thề trả thù những kẻ đã giết em gái anh ta.", "eng": "He swore to take vengeance on the people who had killed his sister."}, {"viet": "Anh ta kể một câu chuyện không thể có được là Tổng thống hỏi ý kiến anh ta.", "eng": "He told us a far-fetched story about the President asking for his advice."}, {"viet": "Anh ta cố giữ cho các giấc mơ đã bị tiêu tan của mình còn nguyên vẹn.", "eng": "He tried to keep his withered dream intact."}, {"viet": "Anh ta đã thốt lên nhiều tiếng tán thán dữ dội.", "eng": "He uttered several vigorous expletives."}, {"viet": "Ông ấy đã bị tố cáo là tìm dẫn gái cho các người cộng tác làm ăn của ông.", "eng": "He was accused of procuring women for his business associates."}, {"viet": "Anh ta bị đưa ra toà vì tội say rượu lái xe.", "eng": "He was brought up on a charge of drunken driving."}, {"viet": "Ông ta được bầu làm tổng thống nhiệm kỳ thứ hai.", "eng": "He was elected to a second presidency."}, {"viet": "Hắn bị kết tội ba lần giết người.", "eng": "He was indicted on three counts of murder."}, {"viet": "Anh ta dầm mưa suốt ngày và do đó bị cảm lạnh nặng.", "eng": "He was out in the rain all day and this brought on a bad cold."}, {"viet": "Nó xấu hổ đến nỗi lấy tay che mặt.", "eng": "He was so ashamed that he hid his face in his hands."}, {"viet": "Nó không biết là tôi có mặt.", "eng": "He was unaware that I was present."}, {"viet": "Anh ấy đã ngủ trong khi làm việc.", "eng": "He went to sleep over his wok."}, {"viet": "Nó làm cật lực để xong công việc.", "eng": "He worked on all cylinders to get the job finished."}, {"viet": "Những bước chân nặng nề báo hiệu là thầy giáo đang đến gần.", "eng": "Heavy footsteps signed the teacher's approach."}, {"viet": "Sự ghét uống rượu của cô ấy khiến cô ấy tránh tất cả những buổi tiệc tùng có rượu.", "eng": "Her aversion to alcohol consumption caused her to shun all social gatherings where such beverages would be served."}, {"viet": "Lòng dũng cảm và tâm trạng vui vẻ của cô ta đã giúp cô vượt qua những lúc bĩ cực.", "eng": "Her courage and good humour saw her through the bad times."}, {"viet": "Gương mặt cô ta bị khuất trong bóng tối.", "eng": "Her face was in deep shadow."}, {"viet": "Người ta thấy thính giác của bà ta hơi kém.", "eng": "Her hearing was found to be slightly defective."}, {"viet": "Xương chân cô ấy bị nứt ở hai chỗ.", "eng": "Her leg fractured in two places."}, {"viet": "Chỉ vì bướng bỉnh nên nàng không chịu xin lỗi.", "eng": "Her obstinacy prevented her from apologizing."}, {"viet": "Lời phê bình của cô ta làm tôi dừng ngay lại.", "eng": "Her remark pulled me up short."}, {"viet": "Chuyện của cô ta không có gì ngoài một loạt những điều bịa đặt.", "eng": "Her story was nothing but a series of fabrications."}, {"viet": "Đây là một tờ năm pao, anh có thể giữ lại tiền thừa.", "eng": "Here's a five-pound note-you can keep the change."}, {"viet": "Hiragana và katakana là những ký tự bản địa của Nhật.", "eng": "Hiragana and katakana are native Japanese characters."}, {"viet": "Râu cằm của ông cụ thòng xuống tới ngực.", "eng": "His beard fell to his chest."}, {"viet": "Cái áo khoác của anh ta đã toác ra ở các đường nối.", "eng": "His coat has split at the seams."}, {"viet": "Những ý tưởng về giáo dục của anh ấy đi trước rất nhiều so với thời đại của anh.", "eng": "His educational ideas were far in advance of his time."}, {"viet": "Những lời bào chữa yếu ớt của nó cứ ấp a ấp úng ( và rơi vào im lặng ).", "eng": "His feeble excuses soon tailed off ( into silence )."}, {"viet": "Ngôi nhà của anh ấy ở góc đường School và phố Green.", "eng": "His house is on the corner of School Road and Green Street."}, {"viet": "Sự bình tĩnh của anh ấy làm đối trọng với tính hung hăng của cô ta.", "eng": "His level-headedness counterbalances her impetuousness."}, {"viet": "Một thằng cháu vô giá trị, vô tích sự của anh ta.", "eng": "His no-acccount, good-for-nothing nephew."}, {"viet": "Phòng mạch của ông bác sĩ đó ở trung tâm thành phố.", "eng": "His practice is in the centre of the city."}, {"viet": "Đôi giày anh ấy bết đầy bùn.", "eng": "His shoes were caked with mud."}, {"viet": "Những thị hiếu của anh ta rất phù hợp tôi.", "eng": "His tastes are in harmony with mine."}, {"viet": "Công việc của anh ta không đạt tới trình độ chuyên môn đòi hỏi.", "eng": "His work does not reach the standard required."}, {"viet": "Nói thật là tôi chỉ có bấy nhiêu tiền!", "eng": "Honestly, that's all the money I've got!"}, {"viet": "Lệ phí mướn như thế nào, tôi trả tiền hàng tháng hay hàng năm?", "eng": "How about the rental fee, do I pay by the month or the year?"}, {"viet": "Sao anh dám chỉ trích hắn? Hắn giỏi hơn anh nhiều!", "eng": "How dare you criticize him? He's twice the man that you are!"}, {"viet": "Cậu dùng thời gian nhàn rỗi ra sao?", "eng": "How do you spend your spare time?"}, {"viet": "Bạn làm việc ở đó được bao lâu?", "eng": "How long have you worked there?"}, {"viet": "Trong gia đình bạn có bao nhiêu người?", "eng": "How many people are there in your family?"}, {"viet": "Cái áo đó giá bao nhiêu?''Giá 50 pao'.", "eng": "How much is that dress?''It's 50 pounds'."}, {"viet": "Anh hiểu như thế nào về sự im lặng của anh ta?", "eng": "How would you interpret his silence?"}, {"viet": "Tôi sẽ là người đầu tiên nhận là mình sai lầm.", "eng": "I'd be the first to admit I might be wrong."}, {"viet": "Cho tôi 2 cuộn TSO 100, phim màu, 36 kiểu.", "eng": "I'd like two rolls of ISO 100, color film, 36 shots, please."}, {"viet": "Tôi sẽ đưa cho anh chìa khóa của căn hộ để anh có thể vào được.", "eng": "I'll give you a key to the flat so that you can let yourself in."}, {"viet": "Tôi xin phát biểu điều này hộ họ, họ có năng lực.", "eng": "I'll say this for them, they're efficient."}, {"viet": "Tôi e là nếu anh chuyển bất cứ nhân viên văn phòng nào đi, anh cũng sẽ tạo thêm rắc rối.", "eng": "I'm afraid if you moved any of the clerical staff, you'd create more problems."}, {"viet": "Tôi đang sắm sửa áo quần cho con cái chuẩn bị vào trường học mới.", "eng": "I'm getting the children fitted out with clothes for their new school."}, {"viet": "Tôi muốn hỏi thăm về căn hộ cho thuê của ông.", "eng": "I'm inquiring about your rental apartment."}, {"viet": "Tôi chỉ hỏi vay một số tiền-tôi sẽ trả lại cho cậu.", "eng": "I'm only asking for a loan-I'll pay you back."}, {"viet": "Tôi rất tiếc phải quấy quả ông nhiều như thế.", "eng": "I'm sorry to have to put you to so much trouble."}, {"viet": "Tôi sẽ cố tránh, lánh mặt các chủ nợ.", "eng": "I'm trying to keep my creditors at bay."}, {"viet": "Tôi đã cân nhắc cẩn thận lời khuyên của anh nhưng tôi vẫn chưa quyết định làm gì.", "eng": "I've been mulling over your advice but I still haven't decided what to do."}, {"viet": "Tôi đã mặc xong quần áo lao động và sẵn sàng bắt đầu công việc.", "eng": "I've got my overalls on, so I'm ready to start work."}, {"viet": "Tôi chưa bao giờ thấy một sự tương phản như vậy giữa hai anh em.", "eng": "I've never seen such a contrast between two brothers."}, {"viet": "Tôi đã yêu cầu Đại úy Lucas dẫn anh đi xem quanh.", "eng": "I've asked Lieutenant Lucas to show you around."}, {"viet": "Tôi chịu trách nhiệm với công ty về việc sử dụng thiết bị này.", "eng": "I am answerable to the company for the use of this equipment."}, {"viet": "Tôi rất vui được gặp ông, thưa ông Wilson.", "eng": "I am very happy to meet you, Mr. Wilson."}, {"viet": "Tôi nghĩ nó khởi hành vào lúc 7 giờ 45 phút sáng thứ sáu, ngày 16.", "eng": "I believe it is at 7: 45 a. m. on Friday, the 16th."}, {"viet": "Tôi không thể mua bất cứ thứ gì cho đến khi lĩnh lương.", "eng": "I can't buy anything until I have my wages."}, {"viet": "Tôi không thể nói là tôi say mê người chồng mới của cô ta.", "eng": "I can't say I'm wild about her new husband."}, {"viet": "Tôi không thể hiểu nổi những chữ nguệch ngoạc này.", "eng": "I can make nothing of this scribble."}, {"viet": "Thành thật mà nói tôi không thể phủ nhận điều đó.", "eng": "I can't in all honesty deny it."}, {"viet": "Tôi có thể nghe chân cô ta đi thình thịch trên cầu thang.", "eng": "I could hear her feel pounding on the stairs."}, {"viet": "Tôi muốn mua một cân táo.", "eng": "I'd like a pound of apples, please."}, {"viet": "Tôi không cố tình làm thế-đó là chuyện chẳng may.", "eng": "I didn't do it deliberately-it was an accident."}, {"viet": "Tôi không tin lời nói của anh ta về sự giàu có của mình.", "eng": "I don't believe his claim about how rich he is."}, {"viet": "Tôi không thích ăn thức ăn đã bị người khác sờ mó vào.", "eng": "I don't like eating food that's been fingered by someone else."}, {"viet": "Tôi nghĩ là chúng ta không nên dành thời gian nhiều hơn nữa cho vấn đề này.", "eng": "I don't think we should devote any more time to this question."}, {"viet": "Bác Freeman ơi, cháu cảm thấy không được khỏe.", "eng": "I don't feel well, Mrs. Freeman."}, {"viet": "Đúng hẹn, tôi gõ cửa nhà anh ta lúc 3 giờ.", "eng": "I duly knocked on his door at three o'clock."}, {"viet": "Tôi thông cảm với bất cứ ai phải lái xe trong kiểu thời tiết thế này.", "eng": "I feel sorry for anyone who has to drive in this sort of weather."}, {"viet": "Tôi làm theo các lời chỉ dẫn một cách cẩn thận.", "eng": "I followed the instructions religiously."}, {"viet": "Vào mùa hè, hầu hết các ngày nghỉ cuối tuần, tôi đều đi chơi thuyền buồm.", "eng": "I go yachting most weekends in the summer."}, {"viet": "Tôi bị sốc khi nghe tin ấy.", "eng": "I had a shock when I heard the news."}, {"viet": "Tôi đã phải vội vàng rửa ráy và mặc quần áo.", "eng": "I had to wash and dress in a hurry."}, {"viet": "Tôi đã làm đứt vài sợi dây của cái vợt quần vợt của tôi.", "eng": "I have broken several strings in my tennis racket."}, {"viet": "Tôi chỉ có các chuyện tầm phào để kể tiếp.", "eng": "I have only reports to go on."}, {"viet": "Tôi không có cái tem nào Anh cho tôi một cái được không?", "eng": "I haven't got any stamps Could you give me one?"}, {"viet": "Tôi nghe về chuyện đó thông qua một trong những người có quan hệ làm ăn với tôi.", "eng": "I heard about it through one of my business connections."}, {"viet": "Tôi hy vọng chúng ta có thể chia tay nhau trong tình bạn.", "eng": "I hope we can part as friends."}, {"viet": "Tôi chỉ nghĩ rằng anh ta thật khó ưa, có thế thôi.", "eng": "I just think he is very unpleasant, full stop."}, {"viet": "Tôi sống một cuộc sống rất bận rộn, do đó thời gian rảnh rỗi là một món rất quí đối với tôi.", "eng": "I lead a very busy life, so spare time is a very precious commodity to me."}, {"viet": "Tôi sống một cuộc đời thật vô vị, chẳng có gì vui thú cả.", "eng": "I live a pretty mundane life, nothing interesting ever happens to me."}, {"viet": "Tôi sẽ cho anh một ví dụ.", "eng": "I'll give you an example."}, {"viet": "Anh sẽ quăng nó đi và mua đôi mới.", "eng": "I'll throw it away and get new ones."}, {"viet": "Tôi đến sớm-ắt hẳn là đồng hồ của tôi chạy nhanh.", "eng": "I'm early-my watch must be fast."}, {"viet": "Tôi không đến với anh đâu!", "eng": "I'm not coming with you!"}, {"viet": "Tôi chắc là ông sẽ không gặp điều đó đâu.", "eng": "I'm sure you won't."}, {"viet": "Tôi có lẽ nên xét việc đó sau.", "eng": "I might well consider it later."}, {"viet": "Tôi suýt nữa ngã khỏi ghế khi tôi nghe tin đó.", "eng": "I nearly fell off my chair when I heard the news."}, {"viet": "Tôi để ý xem cô ta làm cái đó như thế nào.", "eng": "I noticed how she did it."}, {"viet": "Tôi lấy hết can đảm cầu hôn cô ta.", "eng": "I plucked up my courage and asked her to marry me."}, {"viet": "Tôi nhận thấy họ muốn ở lại một mình với nhau vì thế tôi cảm thấy rất lúng túng.", "eng": "I realized they wanted to be alone together so I felt very awkward."}, {"viet": "Tôi nhớ đã đọc tiểu sử của cô ấy lần đầu tiên được xuất bản vào năm 197.", "eng": "I remember reading her biography first published in 197."}, {"viet": "Này, anh có thể cho tôi mượn 5 bảng Anh không?", "eng": "I say, can you lend me five pounds?"}, {"viet": "Tôi coi việc được mời là một vinh dự.", "eng": "I should deem it an honour to be invited."}, {"viet": "Sau trận ốm tôi vẫn cảm thấy hơi yếu.", "eng": "I still feel a bit weak after my illness."}, {"viet": "Tôi cám ơn cô ấy vì món quà cô ấy đã gửi tặng tôi.", "eng": "I thanked her for the present she sent me."}, {"viet": "Tôi nghĩ là điện thoại của tôi bị nghe trộm.", "eng": "I think my phone is being tapped."}, {"viet": "Tôi tưởng tôi có khả năng mua được cái đó, sau đó tôi đã tính toán lại chính xác và thấy nó quá đắt.", "eng": "I thought I could afford it, then I costed it out properly and found it was too expensive."}, {"viet": "Tôi cố làm cho cậu bồi bàn chú ý.", "eng": "I tried to catch the waiter's attention."}, {"viet": "Tôi bỏ thuốc rồi, bạn biết đấy.", "eng": "I've given up, you know."}, {"viet": "Nếu họ có bán, anh muốn uống trà Ô Long rồi.", "eng": "I want to drink Oolong-tea if they have it."}, {"viet": "Tôi hoàn toàn ( sợ ) chết điếng.", "eng": "I was absolutely petrified ( with fear )."}, {"viet": "Tôi định viết thư nhưng lại gọi điện.", "eng": "I was going to write but called instead."}, {"viet": "Tôi đã bị một con chó to nhào ra tấn công ngay khi tôi vừa mở cổng.", "eng": "I was set on by a large dog as soon as I opened the gate."}, {"viet": "Tôi bị tiếng động trong phòng đánh thức ( dậy ).", "eng": "I was woken ( up ) by a noise in the room."}, {"viet": "Tôi muốn anh ta hiểu rõ rằng những kỳ kiểm tra là quan trọng.", "eng": "I wish he'd get into his head that exams are important."}, {"viet": "Tôi không hiểu người hàng xóm mất tích từ lâu của tôi có còn sống hay không.", "eng": "I wonder if my long lost neighbour can still be alive."}, {"viet": "Tôi muốn một chỗ ngồi ở phía trước máy bay.", "eng": "I would like a seat in the front of the airplane."}, {"viet": "Tôi hết sức khuyên anh không làm điều đó.", "eng": "I would strongly advise you against it."}, {"viet": "Nếu ai gọi, bảo họ là tôi không có ở nhà.", "eng": "If anyone calls, tell them I'm not at home."}, {"viet": "Nếu tôi kể cho cảnh sát là tôi đang ở với anh vào hôm đó, anh sẽ làm chứng cho tôi chứ?", "eng": "If I tell the police I was with you that day, will you back up my story?"}, {"viet": "Nếu cảnh sát hỏi mày thì mày cứ làm bộ như không biết gì hết.", "eng": "If the police question you, act dumb."}, {"viet": "Nếu anh sắp đi ra nước ngoài, anh đã tiêm chưa?", "eng": "If you're going abroad, have you had your injections yet?"}, {"viet": "Nếu bạn không sấy khô tóc, bạn sẽ bị cảm lạnh.", "eng": "If you don't dry your hair, you will catch a cold."}, {"viet": "Nếu anh nhỡ chuyến tàu đó thì có chuyến tàu khác sau đó một giờ.", "eng": "If you miss the train there's another an hour later."}, {"viet": "Nếu anh quan sát kỹ anh sẽ thấy tôi làm cái đó được làm như thế nào.", "eng": "If you watch carefully you will see how it is done."}, {"viet": "Trong tất cả sản phẩm của chúng tôi, trọng tâm là ở chất lượng.", "eng": "In all our products the accent is on quality."}, {"viet": "Trong tiếng Pháp có ba dấu có thể trên nguyên âm e.", "eng": "In French there are three possible accents on the vowel e."}, {"viet": "Trong những năm trước họ đã chẳng bao giờ làm như vậy.", "eng": "In past years they never would have done that."}, {"viet": "Trong hồi cuối chúng ta sẽ thấy được ai là kẻ sát nhân.", "eng": "In the final episode, we'll find out who did the murder."}, {"viet": "Thời đó, sự không quy phục tôn giáo là không thể tha thứ được.", "eng": "In those days, religious dissent was not tolerated."}, {"viet": "Thay vào đó, các tờ giấy cói hay các trang giấy cói được nối liền vào với nhau làm thành một dải băng dài.", "eng": "Instead, sheets or pages of papyrus were pasted together to form a long strip."}, {"viet": "Đây có phải là lần đầu quý khách đến thăm Bắc Kinh không?", "eng": "Is it your first visit to Beijing?"}, {"viet": "Còn vấn đề gì khác cần bàn bạc không?", "eng": "Is there anything else to discuss?"}, {"viet": "Từ đây đến đó 500 dặm, suýt soát.", "eng": "It's 500 miles from here, or as near as makes no difference."}, {"viet": "Một điều chắc chắn tuyệt đối là con ngựa này sẽ thắng.", "eng": "It's an absolute cinch that this horse is going to win."}, {"viet": "Dù con ngựa mới này về đích nhất hay bét thì cũng hoà.", "eng": "It's even money whether the new horse comes first or last."}, {"viet": "Thật là kỳ lạ không biết anh đã mất đến bao nhiêu cân!", "eng": "It's miraculous how much weight you've lost!"}, {"viet": "Đi đến công viên chỉ mất 5 phút xe buýt.", "eng": "It's only a 5-minute bus-ride to the park."}, {"viet": "Đã đến lúc phải có người làm cho anh ta nhận ra hậu quả của những hành động của anh ta.", "eng": "It's time someone made him aware of the effects of his actions."}, {"viet": "Sự việc xảy ra là người chủ nhân đã đi rồi.", "eng": "It arrived the master had already departed."}, {"viet": "Tất nhiên nó hoàn toàn được điều hòa không khí, và có tổng cộng 20 thang máy.", "eng": "It is, of course, completely air-conditioned, and has a total of 20 elevators."}, {"viet": "Nó còn thua kém Trung Quốc về mặt văn minh.", "eng": "It is in arrear of China in civilization."}, {"viet": "Thật đáng tiếc là ông đã bỏ lỡ cuộc họp.", "eng": "It is unfortunate that you missed the meeting."}, {"viet": "Nó chuyển từ trạng thái lỏng sang trạng thái hơi.", "eng": "It passes from a liquid to a gaseous state."}, {"viet": "Nó dài hơn một ngàn bộ.", "eng": "It's over a thousand feet long."}, {"viet": "Tôi nghe ông có vẻ bị trường hợp “ turista ”.", "eng": "It sound to me like you have a case of turista."}, {"viet": "Đó là một công việc cấp tập vì thế mà làm không được tốt.", "eng": "It was a rapid job and therefore not done well."}, {"viet": "Không thể tìm khiếm khuyết trong biểu diễn của cô ấy.", "eng": "It was impossible to fault her performance."}, {"viet": "Chính nhờ có anh mà chúng tôi có thể gặp lại nhau.", "eng": "It was through you that we were able to meet again."}, {"viet": "Hẳn là điên rồ nếu cứ tiếp tục nữa.", "eng": "It would be senseless to continue any further."}, {"viet": "Jill sẽ khám phá ra bí mật của anh-cô ta tinh lắm!", "eng": "Jill will find out your secret-she never misses a trick!"}, {"viet": "Khoan hẵng! Để tôi sửa thẳng lại cái cà vạt cho anh đã.", "eng": "Just a minute! Let me put your tie straight."}, {"viet": "Nhiều đèn lồng treo trên các cây quanh hồ.", "eng": "Lanterns were strung in the trees around the pool."}, {"viet": "Để tôi giới thiệu sơ lược cho ông.", "eng": "Let me give you a brief introduction."}, {"viet": "Cả Luân Đôn xôn xao vì sự bổ nhiệm mới.", "eng": "London was abuzz over the new appointment."}, {"viet": "Sau vụ động đất nhiều người vẫn còn bị vùi sống.", "eng": "Many people are still buried alive after the earthquake."}, {"viet": "Mary và Helen thay nhau lần lượt ngồi chăm bà mẹ ốm.", "eng": "Mary and Helen took turns at sitting up with their sick mother."}, {"viet": "Tôi có thể xem giấy uỷ quyền của anh về việc này không?", "eng": "May I see your authorisation for this?"}, {"viet": "Tục ngữ có câu Dục tốc bất đạt.", "eng": "More haste, less speed, as the saying goes."}, {"viet": "Thưa ông Green, ông đã đề cập trong bức thư vừa rồi của ông rằng trước đây ông đã đến thăm Hồng kong, và lần đó là khi nào vậy?", "eng": "Mr. Green, you mentioned in your last letter that you've visited Hong Kong before, and when was that?"}, {"viet": "Sinh nhật của tôi là ngày 12 tháng.", "eng": "My birthday is the twelfth of July."}, {"viet": "Cha tôi dạy tôi làm tính cộng và tính trừ.", "eng": "My father taught me to do addition and subtraction."}, {"viet": "Má tôi là người Nhật thế hệ thứ hai.", "eng": "My mother is a second generation Japanese."}, {"viet": "Tôi đồng tình với những công nhân trong vụ tranh chấp này.", "eng": "My sympathies are with the workers in this dispute."}, {"viet": "Chứng cứ mới đánh đổ lí thuyết của anh ta.", "eng": "New evidence makes hay of his theories."}, {"viet": "Không, tôi đang tính đổi việc làm.", "eng": "No, I'm considering switching jobs."}, {"viet": "Để giành được sự ủng hộ của họ, không có cái giá nào là quá cao.", "eng": "No price is too high for winning their support."}, {"viet": "Giờ đây khi cô ta đã đánh bóng một cách chính xác, cô ta chơi một ván quần vợt tuyệt hay.", "eng": "Now that she's got her eye in she plays an excellent game of tennis."}, {"viet": "Ồ, 2000 đô la Mỹ gửi cho bà từ New York đây rồi.", "eng": "Oh, here is US $ 2,000 right for you from New York."}, {"viet": "Tuổi già lặng lẽ đến với bạn trước khi bạn nhận ra nó.", "eng": "Old age creeps up on you before you realize it."}, {"viet": "Khả năng tự tắm rửa và tự mặc quần áo.", "eng": "One's ability to wash and dress oneself."}, {"viet": "Ngửi mùi thịt thối một cái là đủ rồi!", "eng": "One smell of the rotten meat was enough!"}, {"viet": "Hợp đồng của chúng tôi hiện đang được xem xét lại.", "eng": "Our contracts are currently under review."}, {"viet": "Nhà thờ địa phương của chúng tôi đang tổ chức bán hàng để quyên tiền nhân dịp Giáng sinh.", "eng": "Our local church is having a Christmas bazaar."}, {"viet": "Đội chúng tôi đã gây được tiếng tốt cho mình là đã thắng trong trận đấu.", "eng": "Our team gave a splendid account of themselves to win the match."}, {"viet": "Quốc hội ban hành những đạo luật mới chống may tuý.", "eng": "Parliament enacted new laws against drugs."}, {"viet": "Ở vùng này trong nước, người ta phát âm từ đó một cách khác.", "eng": "People pronounce the word differently in this part of the country."}, {"viet": "Xin hãy ký từng tờ một.", "eng": "Please have each of them signed."}, {"viet": "Dự án chắc sẽ phải đợi đấy cho đến khi uỷ ban đưa ra quyết định.", "eng": "Project must remain in limbo until the committee makes its decision."}, {"viet": "Các nhà khoa học đang theo dõi cẩn thận tiến trình của con tàu vũ trụ.", "eng": "Scientists are carefully charting the progress of the spacecraft."}, {"viet": "Tôi dẫn đường cho ông nhé?", "eng": "Shall I show you the way?"}, {"viet": "Cô ta là một cô gái ngông cuồng bất trị nhưng nhà trường mới đó chắc sẽ rèn luyện được cô ta.", "eng": "She's a wild uncontrollable girl, but that new school should knock some sense into her."}, {"viet": "Cô ta đã bỏ rơi phần lớn bạn bè cũ-hay là họ đã bỏ rơi cô ta!", "eng": "She's dropped most of her old friends-or they've dropped her!"}, {"viet": "Cô ấy là một nghệ sĩ thành danh.", "eng": "She's made a name for herself as an artist."}, {"viet": "Cô ta sẽ dự thi sớm một năm, chỉ để thử chuẩn bị cho kỳ thi thật.", "eng": "She's taking the exam a year early, just as a trial run for the real thing."}, {"viet": "Cô ấy luôn luôn nhúng bánh quy vào cà phê.", "eng": "She always dunks her biscuits in her coffee."}, {"viet": "Cô ta gọi nhà hát lớn mới xây dựng là cái công trình gớm guốc kia.", "eng": "She calls the new opera house that hideous erection."}, {"viet": "Cô ta có thể chài mồi lũ chim trên cây!", "eng": "She could charm the birds from the trees!"}, {"viet": "Cô ta thỉnh thoảng cũng làm người mẫu khi còn là sinh viên để có thêm ít tiền.", "eng": "She did some modelling as a student to earn a bit of money."}, {"viet": "Cô ta còn đi đến chỗ lái xe đưa tôi về nhà nữa.", "eng": "She even went to the length of driving me home."}, {"viet": "Cô ta lóng ngóng với các bản ghi chép của mình rồi bắt đầu nói.", "eng": "She fumbled with her notes and began to speak."}, {"viet": "Cô ta chào họ, gọi họ bằng tên một cách thân tình.", "eng": "She greeted them by their first names in a familiar way."}, {"viet": "Cô ấy trả lời những câu hỏi thù địch của họ hết sức tự tin.", "eng": "She handled their hostile questions with great aplomb."}, {"viet": "Chị ấy đã phục hồi và trở lại với bản thân của mình.", "eng": "She has recovered and is her own self again."}, {"viet": "Cô ấy là một cô gái đẹp và rất dễ thương.", "eng": "She is a nice-looking girl and very sweet."}, {"viet": "Cô ta là bức chân dung giông mẹ cô ta như đúc.", "eng": "She is the living portrait of her mother."}, {"viet": "Bà ấy để cho các con chơi ở ngoài phố.", "eng": "She lets her children play in the street."}, {"viet": "Cô ta đã may một cái váy bằng vải tôi cho.", "eng": "She made a skirt out of the material I gave her."}, {"viet": "Bà ấy nhận thấy ông ta đã ra về nhưng không nói gì cả.", "eng": "She observed that he'd left but made no comment."}, {"viet": "Cô ấy thích nhạc pop và jazz hơn nhạc cổ điển.", "eng": "She prefers pop music and jazz to classical music."}, {"viet": "Bà ta bỏ từng cái một trong hộp ra.", "eng": "She removed every single thing from the box."}, {"viet": "Cô ấy sẽ tham dự kỳ thi chứng chỉ cấp 1 Cambridge.", "eng": "She's going in for the Cambridge."}, {"viet": "Bà ấy còn rất trẻ trung ở tuổi sáu mươi lăm.", "eng": "She's very youthful sixty-five."}, {"viet": "Cô ta chộp lấy lời gợi ý của tôi và thực thi ngay lập tức.", "eng": "She seized on my suggestion and began work immediately."}, {"viet": "Cô ta cùng người bạn lưu lại ở Dalas một đôi ngày.", "eng": "She sojourned with a friend in Dallas some days."}, {"viet": "Cô ấy bị mất trí nhớ sau vụ đâm xe.", "eng": "She suffered amnesia after the car crash."}, {"viet": "Cô ấy phật ý khi tôi hỏi cô ấy bao nhiêu tuổi.", "eng": "She took offence when I asked her how old she was."}, {"viet": "Cô ấy làm không công ở bệnh viện.", "eng": "She volunteers at the hospital for love."}, {"viet": "Cô ấy làm theo tất cả những gì tôi gợi ý.", "eng": "She was amenalbe to whatever I suggested."}, {"viet": "Cô ấy bị vướng víu với những chiếc vali nặng.", "eng": "She was encumbered with heavy suitcases."}, {"viet": "Bà ta đã được phong giáo sư ở tuổi 40.", "eng": "She was made professor at the age of 40."}, {"viet": "Cô ấy đang khoe người chồng mới của mình tại bữa tiệc.", "eng": "She was showing off her new husband at the party."}, {"viet": "Cô ta quở trách tôi rất nặng lời khi tôi bỏ quên quyển sách.", "eng": "She was very sharp with me when I forgot my book."}, {"viet": "Cô ta quay tròn liên tục sợi dây thừng.", "eng": "She whirled the rope round and round."}, {"viet": "Bà ấy lo buồn đến sinh bệnh về cậu con trai bị mất tích.", "eng": "She worried herself sick about her missing son."}, {"viet": "Lách vai mình chen qua đám đông.", "eng": "Shoulder one's way through the crowd."}, {"viet": "Kể từ trận ốm đến nay cô ấy không thích đi ra ngoài ( khỏi nhà ).", "eng": "Since her illness she has not been up to going out much."}, {"viet": "Quật mạnh vào đám cỏ dại cao bằng cây gậy.", "eng": "Slashing at the tall weeds with a stick."}, {"viet": "Xem trộm các món quà Giáng sinh.", "eng": "Sneak a look at the Christmas presents."}, {"viet": "Những người làm công tác xã hội xác nhận là trẻ em đang bị bạc đãi.", "eng": "Social workers claimed the children were being ill-treated."}, {"viet": "Cách này hay cách khác, những người này phải làm việc.", "eng": "Some how or other there people have to work."}, {"viet": "Một số người tưởng rằng học lái xe dễ như chơi.", "eng": "Some people think learning to drive is a breeze."}, {"viet": "Có người đang gõ mạnh vào cửa.", "eng": "Someone was rapping loudly at the door."}, {"viet": "Chim sẻ làm tổ bằng rơm và cành con.", "eng": "Sparrows building a nest of straw and twigs."}, {"viet": "Đứng đấu lưng xem ai cao hơn nào.", "eng": "Stand back to back and let's see who's taller."}, {"viet": "Đừng có giở trò ngốc nghếch nữa và trả lại đôi giầy cho tao.", "eng": "Stop arising about and give me back my shoes."}, {"viet": "Những người lãnh đạo cuộc đình công đã báo cáo một số tiến triển trong các cuộc toạ đàm để dàn xếp cuộc tranh chấp.", "eng": "Strike leaders have reported some progress in the talks to settle the dispute."}, {"viet": "Cách trang trí ấy là một nét đặc trưng của thời kỳ ba-rốc.", "eng": "Such decoration was a typical feature of the baroque period."}, {"viet": "Hay là chúng ta đi bơi đi!", "eng": "Suppose we go for a swim!"}, {"viet": "Liếc nhanh xem thứ gì giấu trong tủ chén.", "eng": "Take a peek at what was hidden in the cupboard."}, {"viet": "Thuế được trừ vào tiền lương của anh.", "eng": "Tax is deducted from your salary."}, {"viet": "Mười người lính bị giết và ba mươi người bị thương nặng.", "eng": "Ten soldiers were killed and thirty seriously wounded."}, {"viet": "Đó là một công trình tuyệt mỹ.", "eng": "That's an absolutely fascinating piece of work."}, {"viet": "Thằng bé đó luôn luôn nghịch hết trò này đến trò khác.", "eng": "That child is always busy with some devilment or other."}, {"viet": "Đó là chiếc cầu Kim Môn nổi tiếng.", "eng": "That is the famous Golden Gate Bridge."}, {"viet": "Cái chỗ đó do một lũ người máy điều hành, bạn không thể nói chuyện với ai được.", "eng": "That place is run by a bunch of droids, you can't talk to anyone."}, {"viet": "Bộ đồ đó cần được là ủi.", "eng": "That suit ought to be pressed."}, {"viet": "Khả năng nói được tiếng Trung Quốc là một trong những thành công của anh ấy.", "eng": "The ability to speak Chinese was among his attainments."}, {"viet": "Người nghệ sĩ tạo ra một mối quan hệ mật thiết với khán giả.", "eng": "The actor developed a close rapport with his audience."}, {"viet": "Sự gắn bó giữa mĩ cảm và xúc cảm tôn giáo.", "eng": "The alliance between aesthetic and religious feeling."}, {"viet": "Lời biện hộ các chính sách cách mạng của đảng.", "eng": "The apologia of the party's revolutionary policies."}, {"viet": "Mũi tên bay thẳng và đúng phắp vào mục tiêu của nó.", "eng": "The arrow flew straight and true to its mark."}, {"viet": "Tính khắc khổ của những biện pháp kinh tế của Chính phủ.", "eng": "The austerity of the Government's economic measures."}, {"viet": "Tin buồn ấy đã làm tôi chán nản cả ngày.", "eng": "The bad news has spoilt my day."}, {"viet": "Nền bê tông không trải thảm lành lạnh dưới chân tôi.", "eng": "The bare concrete floor was cold on my feet."}, {"viet": "Chuông rền vang qua khu đất nhà thờ.", "eng": "The bells pealed out across the churchyard."}, {"viet": "Nước quả mâm xôi vấy bẩn đỏ những ngón tay của chúng.", "eng": "The blackberry juice stained their fingers red."}, {"viet": "Quyển sách đó vẫn còn nằm y nguyên ở trên kệ của tôi.", "eng": "The book's still sitting on my shelf."}, {"viet": "Đường biên giới giữa Lào và Việt Nam.", "eng": "The boundary between Laos and Viet Nam."}, {"viet": "Sự đổ vỡ hôn nhân của họ là một sự giải thoát lớn lao cho cô ta.", "eng": "The break-up of their marriage was an enormous liberation for her."}, {"viet": "Gánh nặng tội lỗi đã được cất khỏi vai tôi.", "eng": "The burden of guilt has been lifted from my shoulders."}, {"viet": "Con kênh đó bây giờ được mở cho tàu bè qua lại.", "eng": "The canal is now open to shipping."}, {"viet": "Những sự thay đổi kiểu mẫu thường xuyên của nhà chế tạo ô tô.", "eng": "The car manufacturer's frequent changes of models."}, {"viet": "Vụ đó đã được xử trước một ban bồi thẩm.", "eng": "The case was tried before a jury."}, {"viet": "Ông chủ tịch nói hai tiếng đồng hồ về các kế hoạch của ông ta với công ty.", "eng": "The chairman expatiated for two hours on his plans for the company."}, {"viet": "Lời than van của đứa trẻ có thể được nghe thấy từ nhà tang lễ.", "eng": "The child's laments could be heard from the funeral house."}, {"viet": "Đứa bé bị giằng ra khỏi tay mẹ nó.", "eng": "The child was torn from its mother's arms."}, {"viet": "Bọn trẻ đã trêu chọc cô giáo chúng.", "eng": "The children played a trick on their teacher."}, {"viet": "Việc chọn lựa tùy thuộc hoàn toàn vào anh.", "eng": "The choice rests entirely with you."}, {"viet": "Nhân viên đó biển thủ 1000 bảng của ngân hàng nơi cô ta làm việc.", "eng": "The clerk embezzled 1000 pounds from the bank where she worked."}, {"viet": "Cà phê chưa đủ nguội để uống.", "eng": "The coffee's not cool enough to drink."}, {"viet": "Ủy ban có thành kiến bảo thủ.", "eng": "The committee has a conservative bias."}, {"viet": "Công ty sẽ đặt lại trụ sở của nó ở vùng Midlands.", "eng": "The company is to relocate its headquarters in the Midlands."}, {"viet": "Những người đi chinh phục tiến vào đến đâu giết chóc và cướp bóc đến đấy.", "eng": "The conquerors advanced, killing and plundering as they went."}, {"viet": "Giá sinh hoạt tiếp tục tăng lên.", "eng": "The cost of living continues to rise."}, {"viet": "Đôi trai gái đó bị buộc tội ăn cắp lớn.", "eng": "The couple was charged with grant larceny."}, {"viet": "Các nhà phê bình đón nhận vở kịch mới với thái độ lẫn lộn.", "eng": "The critics gave the the new play a mixed reception."}, {"viet": "Dòng nước chảy phía bờ biển.", "eng": "The current sets in towards the shore."}, {"viet": "Ngày tháng dường như thấm thoắt trôi qua.", "eng": "The days seemed to race past."}, {"viet": "Cuộc biểu tình diễn ra mà không hề có bạo động.", "eng": "The demonstration proceeded without incident."}, {"viet": "Cuốn từ điển đó được in lại có sửa đổi chút ít.", "eng": "The dictionary is reprinted with minor collections."}, {"viet": "Vòng quay một ngày của các hành tinh.", "eng": "The diurnal movement of the planets."}, {"viet": "Các bác sĩ đã làm tất cả những gì khả năng con người có thể làm được.", "eng": "The doctors did all that was humanly possible."}, {"viet": "Tính giáo điều của một số nhà phê bình âm nhạc.", "eng": "The dogmatism of some music critics."}, {"viet": "Nạn hạn hán đang ngày càng thêm nghiêm trọng.", "eng": "The drought is becoming increasingly severe."}, {"viet": "Cục giáo dục hỏi về lai lịch anh ta.", "eng": "The Education Board inquired about his antecedences."}, {"viet": "Việc tuyển dụng ba người trợ lý mới.", "eng": "The engagement of three new assistants."}, {"viet": "Ánh sáng mờ của buổi chiều trên các con đường trong thành phố khi mặt trời đã khuất sau những căn nhà cao nhất.", "eng": "The evening glow of the city streets when the sun has gone behind the tallest houses."}, {"viet": "Vụ nổ làm vỡ mọi cửa sổ trong ngôi nhà.", "eng": "The explosion shattered every window in the building."}, {"viet": "Những người hâm mộ ùa ra sân vận động hoan hô cuồng nhiệt.", "eng": "The fans poured out of the stadium cheering wildly."}, {"viet": "Cuộc đánh nhau là do một số thanh niên uống rượu say khởi sự.", "eng": "The fight was started by some youths who had been drinking."}, {"viet": "Chiếc cầu đẹp nhất của cả nước Peru gãy và hất năm người đi trên cầu xuống vịnh phía dưới.", "eng": "The finest bridge in all Peru broke and precipitated five travellers into the gulf below."}, {"viet": "Cuốn sách in đầu tiên ở Anh được in tại nhà in của một thợ in người Anh tên là William Caxton năm 1474.", "eng": "The first book ever printed in English came from the press of English printer William Caxton in 1474."}, {"viet": "Đường bay của một mũi tên, một phi tiêu, một tên lửa, v. v.", "eng": "The flight of an arrow, a dart, a missile, etc."}, {"viet": "Các cánh rừng chạy dài hàng trăm dặm.", "eng": "The forests stretch for hundreds of miles."}, {"viet": "Vụ tài trợ đó là một vụ làm ăn chỉ có một lần.", "eng": "The funding was a one-shot deal."}, {"viet": "Ấn tượng chung về bức họa đó thật l sâu đậm.", "eng": "The general effect of the painting is overwhelming."}, {"viet": "Người cha đỡ đầu của một thế hệ mới các nhà vật lý hạt nhân.", "eng": "The godfather of a new generation of nuclear physicists."}, {"viet": "Chính phủ đã phê chuẩn những gì ông bộ trưởng đã làm.", "eng": "The government gave its sanction to what the Minister had done."}, {"viet": "Năm nay chính phủ dự kiến sẽ quy định những hạn chế khắt khe về chi phí công cộng.", "eng": "The government plans to set strict limits on public spending this year."}, {"viet": "Tân Thế Giới rộng lớn đã được phát hiện.", "eng": "The great New World had been discovered."}, {"viet": "Người khách trọ muốn yêu cầu mang một bữa ăn trưa dành cho hai người đến phòng của bà ấy.", "eng": "The guest wants lunch for two sent to her room."}, {"viet": "Thầy hiệu trưởng đã trông thấy tôi vẽ lên bảng-Tôi tới số rồi.", "eng": "The headmaster saw me draw the picture on the blackboard-I'm for it now."}, {"viet": "Những cái bản lề rít kèn kẹt khi cánh cổng xoay lui.", "eng": "The hinges grated as the gate swung back."}, {"viet": "Xe buýt của khách sạn đến đón tất cả các chuyến xe lửa.", "eng": "The hotel bus meets all the trains."}, {"viet": "Ngôi nhà bị vùi dưới tuyết dày mười'phít'.", "eng": "The house was buried under ten feet of snow."}, {"viet": "Các minh hoạ phù hợp với văn bản.", "eng": "The illustrations consort with the text."}, {"viet": "Người tài xế bị thương đã được cứu ra bằng cách cắt chiếc xe bị tai nạn.", "eng": "The injured driver was cut from the wreckage of his car."}, {"viet": "Những nhà điều tra phải đối diện một bức tường im lặng.", "eng": "The investigators were confronted by a wall of silence."}, {"viet": "Vị quan tòa đó có tiếng là hoàn toàn vô tư.", "eng": "The judge had a reputation for complete objectivity."}, {"viet": "Nhà vua nguyện xây một tu viện thờ Chúa nhân ngày chiến thắng.", "eng": "The king vowed an abbey to God for the victory."}, {"viet": "Thành viên sống sót cuối cùng của gia đình đó.", "eng": "The last surviving member of the family."}, {"viet": "Những chiếc lá quay tròn khi rơi.", "eng": "The leaves whirled round as they fell."}, {"viet": "Ngay sau ánh chớp là tiếng sấm đùng đùng.", "eng": "The lightening was quickly followed with heavy thunder."}, {"viet": "Hàng hoá trên xe đã được cột chặt.", "eng": "The lorry's load had been trapped securely down."}, {"viet": "Bàn thắng tuyệt vời đó khích lệ mạnh mẽ đội bóng đi đến chiến thắng.", "eng": "The magnificent goal spurred the team on to victory."}, {"viet": "Những nhà sản xuất nói là vải đó bền mãi.", "eng": "The manufacturers claim that the material is imperishable."}, {"viet": "Những biện pháp có ảnh hưởng tai hại.", "eng": "The measures had a detrimental effect."}, {"viet": "Nhóm người ăn tập thể đã đặt mua một số bàn ghế mới.", "eng": "The mess has ordered some new furniture."}, {"viet": "Người ta chưa tìm được đứa bé mất tích.", "eng": "The missing child has not been found yet."}, {"viet": "Chất moocphin được đưa vào người bằng cách tiêm.", "eng": "The morphine was administered by injection."}, {"viet": "Tên sát nhân len lén tới gần nạn nhân không đề phòng của hắn.", "eng": "The murderer crept up on his unsuspecting victim."}, {"viet": "Chiều nào những người hàng xóm cũng mở rađiô to cốt là chọc tức chúng tôi.", "eng": "The neighbours play their radio loudly every afternoon just to spite us."}, {"viet": "Giám đốc mới muốn loại bỏ số người không cần thiết và hợp lý hoá sản xuất.", "eng": "The new manager wants to cut out the dead wood and streamline production."}, {"viet": "Tin làm tôi sửng sốt đau đớn.", "eng": "The news gave me a nasty shock."}, {"viet": "Tiếng ồn ào từ bữa tiệc kia trở nên quá đáng.", "eng": "The noise from that party is getting a bit much."}, {"viet": "Y tá chọc qua da trên ven bằng kim tiêm và bơm thuốc vào.", "eng": "The nurse pierced the skin covering his vein with a syringe and injected the medicine."}, {"viet": "Người già bị đối xử như những công dân loại hai.", "eng": "The old are treated as second-class citizens."}, {"viet": "Người đã đưa tôi đến đây à?", "eng": "The one who brought me here?"}, {"viet": "Kết quả cuộc bầu cử là điều đã được dự đoán chắc chắn trước.", "eng": "The outcome of the election is a foregone conclusion."}, {"viet": "Miếng giấy da rách vụn trong tay tôi.", "eng": "The parchment fell to bits in my hands."}, {"viet": "Bệnh nhân đã chết trên bàn mổ.", "eng": "The patient died on the operating-table."}, {"viet": "Chiếc bánh ngọt hoàn hảo là điều kiện thiết yếu của một đám cưới hiện đại được chuẩn bị cẩn thận.", "eng": "The perfect cake is the sine qua non of the carefully planned modern wedding."}, {"viet": "Hình vẽ cho thấy một số loại.", "eng": "The picture shows a few."}, {"viet": "Máy bay nghiêng khi nó chuẩn bị hạ cánh.", "eng": "The plane banked as it prepared to land."}, {"viet": "Vở kịch viết hay nhưng diễn xuất không hay.", "eng": "The play is well written but it does not make good theatre."}, {"viet": "Cảnh sát đang án binh bất động bên ngoài căn nhà mà người có súng đang ẩn nấp.", "eng": "The police are playing a waiting game outside the house where the armed man is hiding."}, {"viet": "Cảnh sát đã thông báo lần nữa cho thanh niên đó.", "eng": "The police Mirandized the kid again."}, {"viet": "Chính sách đó đã bị lên án trên bục giảng đạo.", "eng": "The policy was condemned from the pulpit."}, {"viet": "Khoai tây được phân loại theo cỡ.", "eng": "The potatoes are graded by size."}, {"viet": "Tổng thống phát biểu ý định giảm thuế.", "eng": "The President enounced his intention to reduce tax."}, {"viet": "Giá cả trong cửa hàng này thật cắt cổ.", "eng": "The prices in this shop are extortionate."}, {"viet": "Người tù chỉ được cho bánh mì và nước.", "eng": "The prisoner was given only bread and water."}, {"viet": "Hiện giờ đề án đang tiến triển tốt đẹp.", "eng": "The project is now well under way."}, {"viet": "Việc quảng cáo cho cuốn sách rất kém nên số bán được thấp.", "eng": "The publicity for the book was poor and sales were low."}, {"viet": "Sự tìm kiếm vàng, tri thức, hạnh phúc.", "eng": "The quest for gold, knowledge, happiness."}, {"viet": "Tỷ lệ của 1 trên 5 và của 20 trên 100 là như nhau.", "eng": "The ratios of 1 to 5 and 20 to 100 are the same."}, {"viet": "Con vật may mắn của trung đoàn là con dê.", "eng": "The regimental mascot is a goat."}, {"viet": "Các khách ăn quen của nhà hàng bị các khách du lịch chen bật ra.", "eng": "The restaurant's regular customers are being crowded out by tourists."}, {"viet": "Sự khắc nghiệt của mùa đông ở Bắc Cực, sự gian khổ của cuộc sống tù ngục.", "eng": "The rigor of an Arctic winter, of prison life."}, {"viet": "Chắc là hôm nay đường xá bớt đông đúc hơn.", "eng": "The roads should be less crowded today."}, {"viet": "Sở đúc tiền Hoàng gia sẽ rập khuôn một loại đồng tiền vàng kỷ niệm.", "eng": "The Royal Mint will strike a commemorative gold coin."}, {"viet": "Sự thân mật giả tạo của người bán hàng.", "eng": "The salesman's synthetic friendliness."}, {"viet": "Ban quản trị hành chính nhà trường lo giám sát các bữa ăn ở nhà trường.", "eng": "The school staff is expected to supervise school meals."}, {"viet": "Viên thượng nghị sĩ nói quanh co về vấn đề thuế cao hơn.", "eng": "The senator skirted round the issue of higher taxes."}, {"viet": "Hầm trú ẩn là một kiến trúc bằng gạch.", "eng": "The shelter is a brick construction."}, {"viet": "Mặt trước cửa hàng được lắp các cửa cuốn.", "eng": "The shop-front is fitted with rolling shutters."}, {"viet": "Tiếp theo sự im lặng là tiếng chuông đồng hồ điểm giờ.", "eng": "The silence was succeeded by the striking of a clock."}, {"viet": "Mùi thơm của táo đút lò tỏa khắp nhà.", "eng": "The smell of baked apples pervaded the house."}, {"viet": "Những tên lính đi tới đi lui với hy vọng gặp vài cô gái.", "eng": "The soldiers went on the prowl hoping to meet some girls."}, {"viet": "Diễn giả tha hồ nói đủ thứ chuyện về các sự kiện trong tuần qua.", "eng": "The speaker roamed freely over the events of the past week."}, {"viet": "Phòng khánh tiết mở cho công chúng vào thứ năm.", "eng": "The state apartments are open to the public on a Thursday."}, {"viet": "Câu chuyện về âm nhạc ngày nay của chúng ta bắt đầu với Johann Sebastain Bach.", "eng": "The story of our music of today begins with Johann Sebastain Bach."}, {"viet": "Các nhân vật đã được khéo bố trí trong những bức ảnh này.", "eng": "The subjects are well posed in these photographs."}, {"viet": "Các chim én bay là là trên mặt nước.", "eng": "The swallows are skimming over the water."}, {"viet": "Thầy giáo dẫn học sinh ra sân chơi.", "eng": "The teacher marched the children out to the playground."}, {"viet": "Nhiệt độ mười độ dưới không.", "eng": "The temperature was ten degrees below zero."}, {"viet": "Điều quan trọng là không nên ngắt lời ông ta khi ông ta đang nói.", "eng": "The thing is not to interrupt him while he's talking."}, {"viet": "Tổng cộng là 250 nhân dân tệ.", "eng": "The total amount is RMB 250 Yuan."}, {"viet": "Kẻ bụi đời thường phát hiện rất nhanh những đồng xu rơi dưới đất.", "eng": "The tramp always keeps his eyes peeled for coins lying on the ground."}, {"viet": "Các phóng viên vô tuyến trông hơi bối rối.", "eng": "The TV reporters looked slightly baffled."}, {"viet": "Hai bộ lạc luôn luôn hận thù nhau.", "eng": "The two tribes are always feuding."}, {"viet": "Việc sử dụng máy tính trong kinh doanh là một sự kiện tương đối mới.", "eng": "The use of computers in business is a fairly recent development."}, {"viet": "Dân làng lấy nước từ một cái giếng.", "eng": "The villagers get their water from a well."}, {"viet": "Chất nước hoặc nước đá bây giờ biến đổi ngược lại, có nghĩa là, trở thành hơi nước vô hình.", "eng": "The water or ice changes back, that is, into invisible water vapor."}, {"viet": "Cả ngôi nhà rung lên mỗi khi chiếc xe tải nặng chạy qua.", "eng": "The whole house vibrates whenever a heavy lorry passes."}, {"viet": "Việc thu hồi một sản phẩm trên thị trường.", "eng": "The withdrawal of a product from the market."}, {"viet": "Giải chung kết cúp thế giới được phát sóng trực tiếp từ Anh sang Nhật.", "eng": "The World Cup Final was beamed live from Britain to Japan."}, {"viet": "Thái độ của họ làm xúc phạm đến nơi linh thiêng.", "eng": "Their behaviour profaned the holy place."}, {"viet": "Những kỷ niệm về ngày cưới hãy còn rõ nét trong tâm trí họ.", "eng": "Their memories of the wedding are still fresh in their minds."}, {"viet": "Rồi thì tôi có thể đổi một ít bảng Anh lấy nhân dân tệ phải không?", "eng": "Then I can exchange some pounds for Chinese yuan?"}, {"viet": "Có khoá phía dưới biểu đồ giải thích những kí hiệu.", "eng": "There's a key underneath the diagram that explains the symbols."}, {"viet": "Điều đó không có khả năng xảy ra.", "eng": "There's no likelihood of that happening."}, {"viet": "Đít quần cũ này mòn nhẵn bóng quá rồi.", "eng": "There's too much shine on the seat of these old trousers."}, {"viet": "Trong hơn một nửa triệu loài côn trùng có hàng ngàn loài bướm đêm hoặc bướm.", "eng": "There are more than half a million kinds of insects, thousands of these kinds of insects are moths or butterflies."}, {"viet": "Có hai âm tiết trong window, win và dow.", "eng": "There are two syllables in window, win and dow."}, {"viet": "Thắng vài trận mà trở nên tự mãn là nguy hiểm.", "eng": "There is a danger of becoming complacent if you win a few games."}, {"viet": "Trên sa mạc ít có cây cối.", "eng": "There is little vegetation in the desert."}, {"viet": "Không có nhiều nhưng anh sẽ phải giải quyết với số ít ỏi đó ổn thoả.", "eng": "There isn't much of it but you'll have to make ( it ) do."}, {"viet": "Có một sự hạ giá đột ngột sau mùa lễ hội.", "eng": "There was a slump in sales after the festive season."}, {"viet": "Có những bài tường thuật về vụ tai nạn đó trên báo.", "eng": "There were accounts of the incident in the paper."}, {"viet": "Đây là những vấn đề có liên quan đến phúc lợi của cộng đồng.", "eng": "These are matters that bear on the welfare of the community."}, {"viet": "Những đất này đã được cấp cho gia đình chúng tôi vĩnh viễn.", "eng": "These lands were granted to our family in perpetuity."}, {"viet": "Chiếc quần này không còn ôm eo tôi tý nào nữa!", "eng": "These trousers won't meet round my waist any more!"}, {"viet": "Họ đã đi xuống đến quán rượu để uống.", "eng": "They've gone down to the pub for a drink."}, {"viet": "Họ đang chiếu sáng vài thứ cùng một lúc.", "eng": "They are lighting several things at one time."}, {"viet": "Họ mang con cái đến cửa Chúa và Người đã ban phúc cho chúng.", "eng": "They brought the children to Jesus and he blessed them."}, {"viet": "Họ quyết định cứ tiếp tục bất chấp thời tiết.", "eng": "They decided to carry on in spite of the weather."}, {"viet": "Chúng bắt đầu ( ăn ) rất ngon lành.", "eng": "They fell to ( eating ) with great gusto."}, {"viet": "Họ trở nên thành thạo khai bản mẫu.", "eng": "They have become adept at filling in forms."}, {"viet": "Họ rời đi trong bóng tối bao phủ.", "eng": "They left under cloak of darkness."}, {"viet": "Họ nhận thấy những cái cánh nhỏ xíu hợp với thân như thế nào.", "eng": "They observed how the tiny wings were fitted to the body."}, {"viet": "Họ thu lượm được lợi ích to lớn nhờ sự đào tạo.", "eng": "They reaped great benefit from their training."}, {"viet": "Họ bíu vách đá, chậm chạp trèo lên.", "eng": "They slowly clawed their way up the cliff."}, {"viet": "Chúng chờ cho đến khi thật an toàn rồi mới chất các hàng hoá ăn cắp lên xe tải.", "eng": "They waited until the coast was clear before loading the stolen goods into the van."}, {"viet": "Chúng nó yêu đương ngay trước mũi tôi, mà tôi cũng chẳng hay biết gì cả!", "eng": "They were having an affair under my very nose, and I didn't even realize!"}, {"viet": "Họ đã làm việc gần sáu tiếng đồng hồ không nghỉ.", "eng": "They worked for almost six hours without a pause."}, {"viet": "Cuốn sách này cho anh một ý niệm tốt về cuộc sống thời La Mã cổ đại.", "eng": "This book gives you a good idea of life in ancient Greece."}, {"viet": "Nhà ở này được phân ra một phần để làm nhà kho tạm.", "eng": "This crib takes apart for easy storage."}, {"viet": "Loại đất có sỏi này thoát nước nhanh và dùng để trồng loại cây ăn củ rất tốt.", "eng": "This gravelly soil is well drained and good for growing root crops."}, {"viet": "Bây giờ không phải lúc chơi ngông mua một dàn âm thanh nổi.", "eng": "This is no time to lash out on a new stereo."}, {"viet": "Bức thư này đã cung cấp cho bà ta tất cả những lý lẽ mà bà đang cần.", "eng": "This letter gave her all the ammunition she needed."}, {"viet": "Bức tranh này tiêu biểu cho phong cách thời đầu của hoạ sĩ.", "eng": "This painting exemplifies the artist's early style."}, {"viet": "Căn phòng này cần được làm cho vui mắt lên-dùng giấy dán tường màu vàng và màu đỏ anh thấy thế nào?", "eng": "This room needs jolling up-how about yellow and red wallpaper?"}, {"viet": "Lý thuyết này căn cứ ở những chứng cứ đã được biết.", "eng": "This theory is grounded on known facts."}, {"viet": "Những lời bình phẩm đó của anh ta đã đi quá xa giới hạn cho phép.", "eng": "Those remarks he made were quite beyond the pale."}, {"viet": "Đặc sản hôm nay là cá cờ.", "eng": "Today's special is the spearfish."}, {"viet": "Cách đây hơn hai mươi lăm thế kỷ, người Hy Lạp đã làm ra các bình hoa xinh xắn đáng yêu như bất cứ bình nào đã được làm ra trên thế giới.", "eng": "Twenty-five hundred years ago the Greeks made vases as lovely as any that have ever been made."}, {"viet": "Các cử tri đã bị cuộc vận động của phe đối địch làm giảm nhiệt tình đối với đảng.", "eng": "Voters have been distanced from the party by adverse publicity."}, {"viet": "Chúng tôi muốn tổ chức một bữa tiệc chào mừng tại nhà hàng của các anh.", "eng": "We'd like to have a welcome banquet in your restaurant."}, {"viet": "Chúng tôi điếc tai vì dàn âm nhạc nổi của nhà bên cạnh.", "eng": "We're being deafened by next door's stereo."}, {"viet": "Chúng tôi rất lấy làm buồn khi được tin bố anh mất.", "eng": "We're sorry to hear of your father's death."}, {"viet": "Chúng tôi đã vạch thử nhiều kế hoạch cho kỳ nghỉ nhưng vẫn còn chưa quyết định điều gì chắc chắn.", "eng": "We've made tentative plans for a holiday but haven't decided anything certain yet."}, {"viet": "Chúng tôi đã sáp nhập với một tập đoàn quốc gia.", "eng": "We are affiliated with the national group."}, {"viet": "Chúng ta làm việc liên kết với nhiều công ty địa phương để góp tiền cho những người vô gia cư.", "eng": "We are working in association with a number of local companies to raise money for the homeless."}, {"viet": "Tôi nghĩ, chúng tôi có thể rẻ hơn bất kỳ ai khác.", "eng": "We can be cheaper than anyone else, I think."}, {"viet": "Chúng tôi có thể nghe thấy một bữa tiệc ở căn hộ trên gác.", "eng": "We could hear a party in the flat upstairs."}, {"viet": "Chúng tôi thường không nhận séc nhưng trong trường hợp của anh, chúng tôi sẽ làm một ngoại lệ.", "eng": "We don't usually take cheques but we'll make an exception in your case."}, {"viet": "Chúng ta đi học hằng ngày trừ chủ nhật.", "eng": "We go to school everyday except Sunday."}, {"viet": "Chúng tôi đã phải lội qua sông sang bờ bên kia.", "eng": "We had to wade through the river to the opposite bank."}, {"viet": "Chúng ta có khối thời gian để kịp tàu.", "eng": "We have plenty of time to catch the train."}, {"viet": "Chúng tôi chỉ cần tên và số hộ chiếu của ông.", "eng": "We just need your name and passport number."}, {"viet": "Chúng tôi đã xoay xở đưa được tất cả hành lý lên ô tô nhưng mà thật là chật như nêm.", "eng": "We managed to get all the luggage into the car but it was a tight squeeze."}, {"viet": "Chúng tôi phải cung cấp nhà ở tươm tất cho người nghèo.", "eng": "We must provide decent housing for the poor."}, {"viet": "Chúng tôi phác ra những ý kiến phản đối chính đối với đề nghị đó.", "eng": "We outlined our main objections to the proposal."}, {"viet": "Trong chuyến đi chúng tôi đã đến thăm rất nhiều địa phương, tôi không thể nhớ hết được.", "eng": "We saw so many places on the tour I can't remember them all."}, {"viet": "Chúng tôi ở nhà vì thời tiết xấu.", "eng": "We stayed at home because of the bad weather."}, {"viet": "Chúng tôi đi bộ qua chợ để vào bãi gửi xe.", "eng": "We walked through the market to the car park."}, {"viet": "Chúng tôi vội nên chúng tôi đã phải ăn vội một bữa ăn nhanh.", "eng": "We were in a hurry so we had to make do with a quick snack."}, {"viet": "Tối nay chúng tôi không cần phải trải giường.", "eng": "We won't do it tonight."}, {"viet": "À em cũng mệt chút xíu.", "eng": "Well, I am a bit tired."}, {"viet": "À, chúng tôi là tàu chiến.", "eng": "Well, we're a battle ship."}, {"viet": "Thưa ông, tên ông là gì và số phòng của ông là số mấy?", "eng": "What's your name and your room number, sir?"}, {"viet": "Anh lẩm bẩm cái gì thế? Tôi chẳng hiểu gì hết!", "eng": "What are you mumbling about? I can't understand a word!"}, {"viet": "Anh nghĩ anh ta làm gì?", "eng": "What do you think he does?"}, {"viet": "Loại trang phục nữ nào đang được ưa chuộng?", "eng": "What is popular in women's clothes?"}, {"viet": "Kỉ niệm thân thương nhất của bạn trong thời thơ ấu là gì?", "eng": "What is your fondest memory from your childhood?"}, {"viet": "Người ta cần những trình độ nào cho vị trí đó?", "eng": "What qualifications does one need for that position?"}, {"viet": "Bạn không thích những loại ô nhiễm tiếng ồn nào?", "eng": "What types of noise pollution do you dislike?"}, {"viet": "Ông muốn có bàn vào lúc mấy giờ?", "eng": "When do you like your table available?"}, {"viet": "Khi tôi đề nghị đi uống, cô ta ho ra hiệu không tán thành.", "eng": "When I suggested a drink, she coughed disapprovingly."}, {"viet": "Khi bữa ăn kết thúc, khách đặt khăn ăn lên bàn và đứng lên, một lần nữa cánh đàn ông giúp kéo ghế cho phụ nữ đứng lên.", "eng": "When the meal is finished, the guests put their napkins on the table and stand up, the men again helping the ladies with their chairs."}, {"viet": "Khi nào anh làm xong, hãy đưa cho tôi sợi dây điện để tôi cắm nó vào.", "eng": "When you are done, hand me the cord and I will plug it in."}, {"viet": "Anh đã đến thăm chỗ nào khác nữa ở Paris?", "eng": "Where else did you visit in Paris?"}, {"viet": "Nơi nào đắt đỏ hơn, Nhật Bản hay đất nước bạn?", "eng": "Which is more expensive, Japan or your home country?"}, {"viet": "Lấy cành cây vót thành cọc lều.", "eng": "Whittling a tent peg from a branch into a tent-peg."}, {"viet": "Ai là người chủ đầu tiên của ngôi nhà này?", "eng": "Who was the original owner of this house?"}, {"viet": "Tại sao bạn không cùng đi với tôi?", "eng": "Why don't you come with me?"}, {"viet": "Tất cả các bạn cùng đồng ca điệp khúc nhé?", "eng": "Will you all join in singing the refrain, please?"}, {"viet": "Mùa đông gây ra những khó khăn cho người già.", "eng": "Winter poses particular difficulties for the elder."}, {"viet": "Các bà vợ được trông mong tha thứ cho sự sa ngã của các ông chồng.", "eng": "Wives were expected to forgive their husbands'lapses."}, {"viet": "Thứ bảy này nếu ông không bận, mời ông đến dung trà với chúng tôi nhé?", "eng": "Would you come and have tea with us this Saturday if you are not engaged?"}, {"viet": "Anh có muốn ngồi gần cửa sổ không?", "eng": "Would you like to sit near the window?"}, {"viet": "Nàng bóp tay than vãn cho số phận của mình.", "eng": "Wringing her hands and bewailing her face."}, {"viet": "Vâng, tôi cần một ít tiền mặt cho chuyến đi thăm Thượng Hải của tôi.", "eng": "Yes, I need some cash for my visit in Shanghai."}, {"viet": "Tốt hơn anh nên tự thu xếp hành lý và vali, có thể anh phải đi tối nay đấy.", "eng": "You'd better pack yourself a suitcase, you might have to leave tonight."}, {"viet": "Rồi chẳng bao lâu nữa anh sẽ biết được những người trong khoa này ai là ai.", "eng": "You'll soon find out who's who in this department."}, {"viet": "Bạn có vết nhọ nồi trên má.", "eng": "You've got a smudge of soot on your check."}, {"viet": "Anh không thể kết án một người chỉ dựa trên chứng cớ gián tiếp.", "eng": "You can't convict a man of a crime on circumstantial evidence alone."}, {"viet": "Ông có thể vượt qua sông bên dưới thác một quãng ngắn.", "eng": "You can cross the river a short distance below the waterfall."}, {"viet": "Anh không thể lúc nào cũng làm việc được, anh phải có chút giải trí.", "eng": "You cannot work over time, you must have some recreation."}, {"viet": "Tốt hơn là anh gọi điện cho mẹ anh trước khi đi.", "eng": "You had better phone your mother before you go."}, {"viet": "Anh biết rõ ràng là anh vô lý.", "eng": "You know as well as I do that you're being unreasonable."}, {"viet": "Ông cần phải tính đến năm phần trăm hao phí dọc đường.", "eng": "You must allow for five percent wastage in transit."}, {"viet": "Anh cần một cái khăn quàng đỏ tươi để làm cho bộ quần áo xám này nổi lên.", "eng": "You need a bright red scarf to perk up that grey suit."}, {"viet": "Con nên mang theo dù để phòng hờ.", "eng": "You should bring your umbrella just in case."}, {"viet": "Anh ngố ạ, anh thua chúng tôi ván bài rồi.", "eng": "You silly fool, you've lost us the game."}, {"viet": "Anh sẽ cần một số kinh nghiệm trong quản lý trước khi anh có thể điều hành ban.", "eng": "You will need some experience in administration before you can run the department."}, {"viet": "Hồ sơ tội phạm của anh có thể bất lợi cho anh trong việc kiếm công ăn việc làm.", "eng": "Your criminal record could count against you in finding a job."}, {"viet": "Chuyện kể của anh nhạt nếu không có nguy hiểm tô điểm thêm.", "eng": "Your story is tame without the sauce of danger."}]