[{"viet": "Nếu điều đó giữ được hạnh phúc gia đình thì vẫn còn hời đấy!", "eng": "It'll be cheap at the price if it keeps the family happy!"}, {"viet": "Một tủ sách che một phần căn phòng.", "eng": "A bookcase screens off part of the room."}, {"viet": "Một quả trứng sôcôla có một đồ chơi bằng nhựa nhỏ ở bên trong.", "eng": "A chocolate egg with a plastic novelty inside."}, {"viet": "Một thức uống lạnh vào ngày nóng thường được vui vẻ đón nhận.", "eng": "A cooling drink is welcome on a hot day."}, {"viet": "Một tên đào ngũ đã tiết lộ sự bố trí đội hình của hạm đội địch.", "eng": "A defector revealed the disposition of the enemy fleet."}, {"viet": "Một chiếc áo đầm có luồn dây chun ở thắt lưng.", "eng": "A dress with an elasticated waist."}, {"viet": "Một bộ phận lọc giữ lại bụi từ trên không rơi xuống.", "eng": "A filter traps dust from the air."}, {"viet": "Một người hiền lành có vẻ ngoài cộc cằn.", "eng": "A gentle man with a rough exterior."}, {"viet": "Một nhóm nhà văn đã phối hợp tạo ra một loạt chương trình tivi.", "eng": "A group of writers who confected a television series."}, {"viet": "Một kỳ nghỉ sẽ thích hợp với anh nhất.", "eng": "A holiday will be just the thing for you."}, {"viet": "Một cái thang tựa vào bức tường.", "eng": "A ladder leaning against the wall."}, {"viet": "Một cuộc đình công đột ngột được kêu gọi để phản đối sự sa thải một đồng nghiệp.", "eng": "A lightning strike called to protest about the dismissal of a workmate."}, {"viet": "Một thiếu tá có phù hiệu vòng hoa trên cầu vai đồng phục của anh ta.", "eng": "A major has a crown on the shoulder of his uniform."}, {"viet": "Một hệ thống hướng dẫn tên lửa theo quán tính.", "eng": "A missile's inertial guidance system."}, {"viet": "Một phát minh mới sẽ có ứng dụng trong công nghiệp.", "eng": "A new invention that will have application in industry."}, {"viet": "Một quang cảnh bao quát nhìn từ trên đỉnh tháp.", "eng": "A panoramic view from the top of the tower."}, {"viet": "Một bức tranh vẽ anh ta giống như hề.", "eng": "A picture depicting him as a clown."}, {"viet": "Một dòng điện vào máy vi tính tăng vọt đã làm cháy một số linh kiện điện trở nhạy.", "eng": "A power surge to the computer that fried a number of sensitive electronic components."}, {"viet": "Một sự run hồi hộp chờ đợi chạy khắp người khán giả.", "eng": "A quiver of expectancy ran through the audience."}, {"viet": "Một xí nghiệp cạnh tranh đã dụ mất các thảo chương viên điện toán giỏi nhất của chúng ta.", "eng": "A rival firm poached our best computer programmers."}, {"viet": "Người phục vụ nhiệm kỳ thứ hai trong Hạ nghị viện.", "eng": "A second termer in the House of Representatives."}, {"viet": "Một ngọn đèn cháy sáng trong căn nhà trống.", "eng": "A single light burned in the empty house."}, {"viet": "Khoảng cách quỹ đạo từ phi thuyền đến trái đất.", "eng": "A spacecraft's orbital distance from the earth."}, {"viet": "Một cuộc dạo quanh vườn khó mà xem như là tập thể dục được!", "eng": "A stroll round the garden hardly qualifies as exercise!"}, {"viet": "Một mục khách mời mười phút trên chương trình rađio.", "eng": "A ten-minute guest spot on a radio programme."}, {"viet": "Một loại âm nhạc được gọi là nhạc đồng ca.", "eng": "A type of music that is termed plainsong."}, {"viet": "Không được mời mà cả đám chúng tôi đều đi dự bữa tiệc đó.", "eng": "A whole crowd of us arrived at the party uninvited."}, {"viet": "Chấp nhận cái gì, mỉm cười, huýt sáo, làm việc một cách vui vẻ.", "eng": "Accept something, smile, whistle, work cheerfully."}, {"viet": "Ban phép xức dầu thánh cho ai.", "eng": "Administer the last rites to somebody."}, {"viet": "Sau khi xuống máy bay, chúng tôi phải qua khâu kiểm tra hộ chiếu.", "eng": "After disembarkation, we went through passport control."}, {"viet": "Sau khi bơi cả tiếng đồng hồ, cuối cùng anh ấy cũng tới được bờ.", "eng": "After swimming for an hour, he finally gained the shore."}, {"viet": "Nông nghiệp vẫn là một ngành kinh doanh quan trọng ở nước bạn, phải không?", "eng": "Agriculture is still a big business in your country, isn't it?"}, {"viet": "Tất cả họ phải giúp đỡ người mộ đạo nhận thức đạo phật.", "eng": "All of them are obliged to help the devotee to realize Buddhahood."}, {"viet": "Tất cả các tiểu bang ở phía Nam đều là các tiểu bang trồng bông vải.", "eng": "All the southern States are cotton States."}, {"viet": "Trái Đất luôn luôn có phân nửa ngày và phân nửa đêm.", "eng": "Always one half of the Earth is having day and one half night."}, {"viet": "Một chiếc xe cứu thương lao tới hiện trường xảy ra tai nạn.", "eng": "An ambulance dashed to the scene of the accident."}, {"viet": "Một người nhiệt tình ủng hộ chính nghĩa.", "eng": "An enthusiastic promoter of good causes."}, {"viet": "Một người đầu bếp chính có đầu óc cải tiến thay đổi thực đơn thường lệ cho mới lạ.", "eng": "An innovative chef who puts a new spin on traditional fare."}, {"viet": "Một aoxơ đường có khoảng 100 calo.", "eng": "An ounce of sugar has about 100 calories."}, {"viet": "Và từ ga xe lửa đến khách sạn của cô bằng cách nào là tốt nhất?", "eng": "And what's the best way to your hotel from the railway station?"}, {"viet": "Bất cứ cơn mưa nào rơi xuống cũng nặng hạt, loại mà chúng ta gọi là mưa to bất thần.", "eng": "Any rain that falls is likely to come in heavy showers, the kind we call cloudbursts."}, {"viet": "Có phải mầm mống của hành vi phạm tội được gieo rắc từ thuở nhỏ không?", "eng": "Are the seeds of criminal behaviour sown early in life?"}, {"viet": "Mày có hợp tác với chúng tao không hay chúng tao phải sử dụng vũ lực đây?", "eng": "Are you going to cooperate or do we have to get physical?"}, {"viet": "Anh quên hết lịch sự rồi sao?", "eng": "Aren't you forgetting your manners?"}, {"viet": "Từ thứ Hai tới, bạn có thể sử dụng văn phòng của tôi.", "eng": "As from next Monday you can use my office."}, {"viet": "Vì bạn thích chiếc váy áo của tôi và tôi thích cái của bạn, vậy chúng ta trao đổi chứ?", "eng": "As you like my dress and I like yours, shall we do a swap?"}, {"viet": "Ở tuổi 60 ông ta vẫn chơi quần vợt giỏi như mọi người.", "eng": "At sixty he still plays tennis with the best of them."}, {"viet": "Quay mặt để khỏi nhìn một cảnh tượng kinh khủng.", "eng": "Avert one's glance from the terrible sight."}, {"viet": "Hãy giữ mồm giữ miệng; tai vách mạch rừng đó!", "eng": "Be careful what you say; even the walls have ears!"}, {"viet": "Là người được tất cả những người láng giềng nâng cốc rượu chúc mừng.", "eng": "Be the toast of the whole neighbourhood."}, {"viet": "Mệt mỏi thường làm tôi phát cáu.", "eng": "Being tired often makes me short-tempered."}, {"viet": "Máu chảy dọc theo ống vào trong lọ.", "eng": "Blood flowed along the tube into the bottle."}, {"viet": "Nuôi cả một gia đình khi bạn đang thất nghiệp không phải chuyện dễ dàng.", "eng": "Bringing up a family when you are unemployed is no picnic."}, {"viet": "Ngoài ra anh không quan tâm đến nét đẹp của ngôn ngữ sao?", "eng": "But don't you care about the beauty of the language?"}, {"viet": "Tôi đã bị chết đuối rồi, nếu như anh không nhìn thấy tôi dưới nước.", "eng": "But that you had seen me in the water, I would have drowned."}, {"viet": "Với sự rộng lượng cho phép của Nữ hoàng.", "eng": "By gracious permission of her Majesty."}, {"viet": "Bình tĩnh đi nào-cần gì phải nóng giận lên về chuyện đó!", "eng": "Calm down-there's no need to get into a lather about it!"}, {"viet": "Ai có thể dịch biệt ngữ pháp luật này sang tiếng Anh thông thường giúp tôi được không?", "eng": "Can someone translate this legal jargon into plain English for me?"}, {"viet": "Vui lòng đưa cho tôi cuốn sách đó?", "eng": "Can you hand me that book, please?"}, {"viet": "Anh có thể cho tôi biết lãi suất tiền gửi không kỳ hạn vào lúc này được không?", "eng": "Can you tell me the rate of current deposit at present?"}, {"viet": "Sâu bướm biến thành bướm hoặc con ngài.", "eng": "Caterpillars change into butterflies or moths."}, {"viet": "Trẻ em phải làm y như chúng được chỉ bảo.", "eng": "Children must do as they're told."}, {"viet": "Truyền hình phát đi với phụ đề dành cho những người bị khuyết tật về thính giác.", "eng": "Close-captioned television for the hearing-impaired."}, {"viet": "Đưa một bệnh nhân vào bệnh viện tâm thần.", "eng": "Commit a patient to a mental hospital."}, {"viet": "Những kẻ bảo thủ đã chuẩn bị kỹ càng khi đả kích các nhà xây dựng về tương lai của địa điểm xây cất.", "eng": "Conservationists fought a pitched battle with developers over the future of the site."}, {"viet": "Bạn có thể làm điều đó lần nữa không?", "eng": "Could you do it another time?"}, {"viet": "Anh có thể viết một chương trình khác theo cùng những cách như vậy được không?", "eng": "Could you write another programme on the same lines?"}, {"viet": "Bố, vớ của bố có một lỗ thủng đấy.", "eng": "Dad, there's a hole in your sock."}, {"viet": "Đòi tăng lương kể từ tháng Mười tới.", "eng": "Demand a rise in wages from next October."}, {"viet": "Đặt một kế hoạch tái phát triển khu trung tâm thành phố.", "eng": "Devise a scheme for redeveloping the city centre."}, {"viet": "Ông đã bấm chuông gọi phải không ạ? người nữ tiếp viên hỏi.", "eng": "Did you ring, sir? asked the stewardess."}, {"viet": "Chia tiểu thuyết ra thành chương.", "eng": "Divide a novel up into chapters."}, {"viet": "Họ có ăn mừng lễ Giáng Sinh ở nước đó không?", "eng": "Do they observe Christmas Day in that country?"}, {"viet": "Các anh có cái nào sáng hơn không?", "eng": "Do you have a brighter one?"}, {"viet": "Bạn có đầu tư vào thị trường chứng khoán không?", "eng": "Do you invest in the stock market?"}, {"viet": "Ông cảm phiền cho tôi hỏi ông đang làm gì ở đây vậy?", "eng": "Do you mind me asking what you are doing here?"}, {"viet": "Bạn có nghĩ là cơm hộp ở các cửa hàng phục vụ 24/24 giờ của Nhật thì ngon không?", "eng": "Do you think that Japanese convenience store lunch boxes are delicious?"}, {"viet": "Có bao giờ ông ta đi ngủ mà không say rượu không?", "eng": "Does he ever go bed sober?"}, {"viet": "Đừng có bắt tôi cộng hóa đơn, toán không phải là sở trường của tôi đâu.", "eng": "Don't ask me to add up the bill, arithmetic isn't my strong point."}, {"viet": "Đừng có quên cho mèo ăn nhé.", "eng": "Don't forget to feed the cat."}, {"viet": "Đừng giành nói chuyện một mình với vị khách quí của chúng ta-còn có những người khác muốn nói chuyện với cô ta.", "eng": "Don't monopolize our special guest-there are others who would like to talk to her."}, {"viet": "Đừng gạt con chó để nó nghĩ rằng nó có thể được bạn cho cái bánh hăm-bơ-gơ.", "eng": "Don't trick the dog into thinking he can have your hamburger."}, {"viet": "Rút thăm xem ai trúng số trong một cuộc xổ số.", "eng": "Draw the winning ticket in a raffle."}, {"viet": "Mỗi cậu bé được cho một trái táo.", "eng": "Each of the boys was given an apple."}, {"viet": "Đội Anh đã nhường một quả cho đối thủ của họ ngay phút đầu tiên.", "eng": "England conceded a goal to their opponents in the first minute."}, {"viet": "Ngay cả tình trạng hoàn toàn vô danh tiểu tốt cũng không hẳn là một trở ngại cho thành công về chính trị.", "eng": "Even utter obscurity need not be an obstacle to political success."}, {"viet": "Chỉ trích gay gắt chính phủ không hành động.", "eng": "Excoriate the government for its failure to act."}, {"viet": "Việc duỗi cánh tay bị thương làm đau đớn.", "eng": "Extension of the injured arm was painful."}, {"viet": "E rằng chúng ta có thể làm đứa bé thức giấc.", "eng": "Fearful that we might wake the baby."}, {"viet": "Tìm thấy vài mảnh vỡ của một chiếc lọ hoa La Mã cổ.", "eng": "Find several fragments of a Roman vase."}, {"viet": "Chuyến bay BA 193 đi Paris đang đón khách lên.", "eng": "Flight BA 193 for Paris is now boarding."}, {"viet": "Có điều là tôi không có tiền; và điều nữa là tôi rất bận.", "eng": "For one thing, I've no money; and for another I'm too busy."}, {"viet": "Các sự kiện thường kém quan trọng hơn nỗ lực giải thích hành động.", "eng": "Frequently events matter less than spin control."}, {"viet": "GB là chữ viết tắt của Great Britain.", "eng": "GB is the abbreviation of Great Britain."}, {"viet": "Bảo lãnh hạnh kiểm tốt của ai.", "eng": "Give a guarantee of somebody's good behaviour."}, {"viet": "Những nền công nghiệp phát triển nhanh hấp dẫn đầu tư như ngành kỹ thuật vi xử lý và laser.", "eng": "Go-go industries such as microprocessing and laser technology."}, {"viet": "Đã bắn hai phát trước khi con hươu biến mất.", "eng": "Got off two shots before the deer disappeared."}, {"viet": "Chi phí vận chuyển đã được trừ trước khi ông nhận được tiền.", "eng": "Handling charges had been deducted before you got the money."}, {"viet": "Chúng ta có mục gì chiều nay không?", "eng": "Have we got anything on for this evening?"}, {"viet": "Bạn có bao làm giáo viên dạy tiếng Anh chưa?", "eng": "Have you ever worked as an English teacher?"}, {"viet": "Các con của chị đã bắt đầu đi học rồi cơ à?", "eng": "Have your children started school already?"}, {"viet": "Hắn là một tội phạm đã cải tạo, tuy thế có thể tái phạm.", "eng": "He's a reformed criminal who may yet backslide."}, {"viet": "Nó được tạm tuyển làm việc đến nay đã hơn một năm và bây giờ muốn có một công việc cố định lâu dài.", "eng": "He's been temping for over a year now and wants a permanent job."}, {"viet": "Anh ta là người tài năng phi thường so với lứa tuổi quá trẻ như vậy.", "eng": "He's incredibly together for someone so young."}, {"viet": "Hắn đã vung phí tất cả tiền dành dụm vào rượu chè.", "eng": "He's squandered all his savings on drink."}, {"viet": "Ông ta lên giọng cha chú khuyên bảo các đồng nghiệp trẻ.", "eng": "He adopts an avuncular tone of voice when giving advice to junior colleagues."}, {"viet": "Hắn tự nhốt mình trong nhà.", "eng": "He barred himself in the house."}, {"viet": "Ông ta thong thả đi xuôi con đường.", "eng": "He came ambling down the road."}, {"viet": "Anh ta nhận đó là sáng kiến của mình.", "eng": "He claims it was his idea."}, {"viet": "Hắn đã lừa dối tôi hàng tháng rồi!", "eng": "He'd been two-timing me for months!"}, {"viet": "Hắn không thèm ngồi với những người như chúng ta.", "eng": "He disdains to sit with people like us."}, {"viet": "Hắn bước vào bằng cửa sau.", "eng": "He entered by the back door."}, {"viet": "Ông ta nhồi thuốc vào nõ tẩu.", "eng": "He filled the bowl of his pipe with tobacco."}, {"viet": "Anh đưa tay cho bà cụ nắm khi băng qua đường.", "eng": "He gave the old lady his arm as they crossed the street."}, {"viet": "Anh ấy đã có thành tích chiến đấu dũng cảm.", "eng": "He had a good war record."}, {"viet": "Ông ta có một căn nhà lớn và một chiếc ôtô đắt tiền, chưa kể một biệt thự ở Pháp.", "eng": "He has a big house and an expensive car, not to mention a villa in France."}, {"viet": "Anh ta có những món nợ tổng cộng lên tới hơn 200 bảng Anh.", "eng": "He has debts totalling more than £ 200."}, {"viet": "Anh ấy làm việc chăm chỉ suốt năm.", "eng": "He has worked hard all year."}, {"viet": "Ông ta là một nhà xuất khẩu kim cương thành đạt.", "eng": "He is a successful exporter of diamonds."}, {"viet": "Anh ta có nhiều của cải.", "eng": "He is possessed of great wealth."}, {"viet": "Anh ta cứ luôn mồm kêu ca là không có tiền.", "eng": "He keeps griping about having no money."}, {"viet": "Ông ấy thích bầy biện quanh chính anh ta những thứ đẹp.", "eng": "He likes to surround himself with beautiful things."}, {"viet": "Hắn kiếm được nhiều tiền nhờ bán phế liệu.", "eng": "He made a considerable fortune selling waste materials."}, {"viet": "Tối hôm qua chắc hẳn hắn đã nốc hết nửa chai uýt-ki.", "eng": "He must have put away half a bottle of whisky last night."}, {"viet": "Ông ấy thu dọn đồ đạc của mình và ra đi.", "eng": "He packed up his things and left."}, {"viet": "Anh ta thuyết phục bạn mình cho vay 100 đôla.", "eng": "He prevails upon his friend to lend you a hundred dollars."}, {"viet": "Anh ấy chạy đi để không bị nhìn thấy.", "eng": "He ran away lest he should be seen."}, {"viet": "Anh ta lặp lại câu hỏi chầm chậm để cô ta có thể hiểu được.", "eng": "He repeated the question slowly in order that she should understand."}, {"viet": "Ông ta là một bậc thầy trong nghề diễn viên.", "eng": "He's a master of the actor's craft."}, {"viet": "Hắn ăn nguyên một cân mận.", "eng": "He's eaten a whole pound of plums."}, {"viet": "Ông ta không phải là người thích xã giao lắm.", "eng": "He's not a very social person."}, {"viet": "Anh ta rất thích người bạn gái mới của mình.", "eng": "He's very much struck on his new girl-friend."}, {"viet": "Hắn hiếm khi có đủ tiền để sống lay lắt.", "eng": "He scarcely has enough money to keep body and soul together."}, {"viet": "Ông ta không nên phàn nàn mới phải.", "eng": "He shouldn't complain about that."}, {"viet": "Ông ta càng lúc càng nói công khai về khó khăn của mình.", "eng": "He speaks more and more openly about his problem."}, {"viet": "Ông ấy vẫn chơi ném bóng khi tôi còn bé.", "eng": "He still played Softball when I was a little girl."}, {"viet": "Anh ta vụt quả bóng bay vào khán đài chính.", "eng": "He swiped the ball into the grandstand."}, {"viet": "Ông ta bảo các nhiếp ảnh viên thôi đừng quấy nhiễu ông ta nữa.", "eng": "He told me the photographers to stop pestering him."}, {"viet": "Ông ta cố gắng che giấu gia đình sự nghiện rượu nặng của mình.", "eng": "He tried to conceal his heavy drinking from his family."}, {"viet": "Trước đây anh ấy vẫn ủng hộ nền kinh tế kiểm soát khối lượng tiền tệ, song anh ta hầu như đã thay đổi quan điểm của mình khi thấy nền kinh tế đó đã làm gia tăng nạn thất nghiệp như thế nào.", "eng": "He used to support monetarist economics, but he underwent quite a conversion when he saw how it increased unemployment."}, {"viet": "Anh ta có thể phát triển hết khả năng của mình qua âm nhạc.", "eng": "He was able to fulfill himself though music."}, {"viet": "Anh ta chạy vượt quá tốc độ.", "eng": "He was breaking the speed limit."}, {"viet": "Anh ta bị tống ra khỏi câu lạc bộ, trung đoàn.", "eng": "He was drummed out of the club, the regiment."}, {"viet": "Ông ta tán thành tuyên bố ngừng bắn.", "eng": "He was in favour of the declaration of a truce."}, {"viet": "Anh ta chỉ có lỗi một phần trong vụ tai nạn đó.", "eng": "He was only partially to blame for the accident."}, {"viet": "Hắn bị quẳng ra khỏi câu lạc bộ vì đánh nhau.", "eng": "He was slung out of the club for fighting."}, {"viet": "Anh ta đang cố quyết định xem có nên cầu hôn với cô ta hay không.", "eng": "He was trying to decide whether he should propose to her."}, {"viet": "Anh ấy đi thẳng đến nhà bạn yêu cầu giúp đỡ.", "eng": "He went straight to his friend's house help to ask for help."}, {"viet": "Ông ta mặc một cái quần bò cũ và đi đôi giày vải.", "eng": "He wore old jeans and a pair of sneakers."}, {"viet": "Hò dô ta, nào!', các thuỷ thủ vừa hô vừa kéo neo lên.", "eng": "Heave ho!'cried the sailors as they raised the anchor."}, {"viet": "Các bài báo của cô ấy là những bài đọc thú vị cho du khách.", "eng": "Her articles make interesting reading for travellers."}, {"viet": "Sự nói dối thường xuyên của cô ta khiến tôi không tin mọi điều cô ấy nói.", "eng": "Her constant lying led me to distrust everything she said."}, {"viet": "Mặt cô ta lộ nét buồn trong giấc ngủ.", "eng": "Her face is sad in repose."}, {"viet": "Đầu của cô ta không cân xứng với tầm vóc thân thể.", "eng": "Her head is out of proportion to the size of her body."}, {"viet": "Bài diễn văn gần đây nhất của bà ấy cho thấy chính phủ đã hoàn toàn thay đổi cách suy nghĩ.", "eng": "Her latest speech represents a complete volte-face in government thinking."}, {"viet": "Quyển tiểu thuyết của bà ấy là một tác phẩm chế giễu thói đua đòi trong xã hội.", "eng": "Her novel is a satire on social snobbery."}, {"viet": "Sự từ chối của bà ta đã làm tiêu tan tất cả những niềm hy vọng của chúng tôi.", "eng": "Her refusal crushed all our hopes."}, {"viet": "Tuyên bố của bà ta chẳng khác gì một lời thú nhận tội lỗi.", "eng": "Her statement is tantamount to a confession of guilt."}, {"viet": "Công việc của cô ta được phân ra vừa làm trợ giáo vừa nghiên cứu.", "eng": "Her work was divided between tutoring and research."}, {"viet": "Tỉ lệ giá thế chấp cao hơn đã được bù đắp một phần bằng trợ thuế gia tăng.", "eng": "Higher mortgage rates are partly offset by increased tax allowances."}, {"viet": "Lưng ông ta còng theo tuổi tác.", "eng": "His back was bowed with age."}, {"viet": "Sự đòi quyền sở hữu của hắn không hiệu lực.", "eng": "His claim to ownership is invalid."}, {"viet": "Vai trò kép của ông ta vừa là nhà soạn nhạc vừa là nhạc trưởng.", "eng": "His dual role as composer and conductor."}, {"viet": "Cha nó bảo nó phải đứng ngoài chuyện rắc rối.", "eng": "His father told him to stay out of trouble."}, {"viet": "Trong lòng anh ta trào lên một niềm kiêu hãnh vì thành tựu của mình.", "eng": "His heart swelled with pride at his achievement."}, {"viet": "Chân anh ta phải bị cưa cụt đến trên đầu gối.", "eng": "His leg had to be taken off above the knee."}, {"viet": "Chiếc xe ôtô mới mà anh ta phải trả 7000 pao, cũng đã phải đem đi sửa chữa rồi.", "eng": "His new car, for which he paid 7000 pounds, has already had to be repaired."}, {"viet": "Sự gắng sức của anh ta để tỏ ra hóm hỉnh thật đáng khinh.", "eng": "His poor attempts to be witty."}, {"viet": "Sự phục vụ của ông ta đối với Nhà nước đã được đánh giá cao, thí dụ đã được tặng thưởng tước hầu.", "eng": "His services to the State were recognized."}, {"viet": "Áo len của anh ta móc vào một cành cây.", "eng": "His sweater snagged on a tree branch."}, {"viet": "Những lời nói của ông ta gây ra sự bất đồng trong những người theo ông ta.", "eng": "His words caused a great deal of dissension among his followers."}, {"viet": "Những người vô gia cư chiếm một ngôi nhà vô chủ để ở.", "eng": "Homeless people squatting in a derelict house."}, {"viet": "Đi xem phim với chúng tôi nhé?", "eng": "How about going to the movies with us?"}, {"viet": "Sao anh lại có thể đối xử tàn tệ với cô ấy đến như vậy? Thật xấu hổ cho anh quá!", "eng": "How could you treat her so badly? Shame on you!"}, {"viet": "Làm sao anh hiểu được điều đó?", "eng": "How do you make that out?"}, {"viet": "Bạn giữ vị trí hiện nay được bao lâu rồi?", "eng": "How long have you been in your present position?"}, {"viet": "Sao Mộc có bao nhiêu vệ tinh?", "eng": "How many moons does Jupiter have?"}, {"viet": "Nước Anh viện trợ cho nước ngoài bao nhiêu?", "eng": "How much foreign aid does Britain give?"}, {"viet": "Sự sắp xếp thuế mới này sẽ ảnh hưởng tới anh như thế nào?", "eng": "How will the new tax arrangements affect you?"}, {"viet": "Tôi đề nghị dùng phương pháp khác.", "eng": "I'd advise taking a different approach."}, {"viet": "Tôi muốn đề cập đến vấn đề mà ông đã nêu lên lúc nãy.", "eng": "I'd like to take up the point you raised earlier."}, {"viet": "Tôi sẽ cho anh mượn nó với một điều kiện là bù lại anh phải cho tôi mượn chiếc xe đạp của anh.", "eng": "I'll get you borrow it on one condition that you lend me your bicycle in return."}, {"viet": "Tôi sẽ hoàn lại cho anh đầy đủ tiền xe của anh.", "eng": "I'll refund you the full cost of your fare."}, {"viet": "Tớ sợ rằng tớ đã thất thố và hôn anh ta như điên.", "eng": "I'm afraid I forgot myself and kissed him wildly."}, {"viet": "Tôi rất lấy làm tiếc nhưng tôi không gặp bạn hôm nay được.", "eng": "I'm frightfully sorry, but I can't see you today."}, {"viet": "Tôi đang rất vội đến ngân hàng.", "eng": "I'm in an awful hurry to get to the bank."}, {"viet": "Tôi không giỏi lắm về môn sử.''Tôi cũng vậy.'.", "eng": "I'm not very good at history''Same here'."}, {"viet": "Bố rất tiếc vì chúng đã xảy ra, nhưng bố không thể buồn suốt được.", "eng": "I'm sorry they happened, but I can't stay unhappy all the time."}, {"viet": "Người ta nói với tôi là hắn đang ở tù, tôi có thể tin ngay.", "eng": "I'm told he's been in prison, and I can well believe it."}, {"viet": "Tôi đã tìm cô ta khắp nơi.", "eng": "I've been looking for her left, right and center."}, {"viet": "Tôi đã được ngành Hoá chất quốc gia phỏng vấn.", "eng": "I've got an interview with National Chemicals."}, {"viet": "Tôi chưa bao giờ thấy anh ta sai sót, cho dù vấn đề đó có khó xử thế nào đi nữa.", "eng": "I've never known him to put a foot wrong, no matter how delicate the issue."}, {"viet": "Tôi hết sức tán thưởng sự rộng lượng của bạn.", "eng": "I'm most appreciative of your generosity."}, {"viet": "Tôi là người lao động chỉ đúng theo nghĩa đen là tôi làm việc, tôi không được trả tiền về việc tôi làm.", "eng": "I am a worker only in the sense that I work, I don't get paid for what I do."}, {"viet": "Tôi hoàn toàn lúng túng trước những câu định nghĩa dùng trong trò chơi ô chữ này.", "eng": "I am totally bewildered by the clues to this crossword puzzle."}, {"viet": "Tôi bắt đầu thấy sáng vấn đề.", "eng": "I began to see daylight with the problem."}, {"viet": "Tôi không thể dự cuộc họp được-anh có thể chuyển lời tạ lỗi giúp tôi không?", "eng": "I can't attend the meeting-would you make my excuses, please?"}, {"viet": "Tôi không tài nào nhận ra được người này trong ảnh đó.", "eng": "I can't put my finger on the person in that photograph."}, {"viet": "Tôi nghe anh nói to và rõ.", "eng": "I can hear your loud and clear."}, {"viet": "Tôi không thể làm cho tivi hoạt động được.", "eng": "I can't get the TV to work."}, {"viet": "Tôi đã biết lái ô tô trước khi ra trường.", "eng": "I could drive a car before I left school."}, {"viet": "Anh ghét bất cứ điều gì chen vào giữa hai chúng ta.", "eng": "I'd hate anything to come between us."}, {"viet": "Tôi không có ý nói là ông phải mở một tài khoản tiết kiệm có kỳ hạn.", "eng": "I did not mean you must open a fixed account."}, {"viet": "Tôi rất mong ông ta đừng chiếu cố các nhân viên trẻ trong Bộ của ông ấy.", "eng": "I do wish he wouldn't condescend to the junior staff in his department."}, {"viet": "Tôi không hiểu tại sao ô tô không khởi động được, có lẽ đó là vấn đề bộ phận điện.", "eng": "I don't know why the car won't start, perhaps it's a problem in the electrics."}, {"viet": "Tôi không nghĩ là chúng ta sẽ thành công, nhưng dù sao chúng ta hãy cứ thử xem.", "eng": "I don't think we'll succeed but let's try anyway."}, {"viet": "Tôi không hiểu nổi cái chuyện điên khùng đó.", "eng": "I don't dig that crazy stuff."}, {"viet": "Tôi thiu thiu ngủ và bỏ mất đoạn cuối phim.", "eng": "I dropped off and missed the end of the film."}, {"viet": "Tôi cảm thấy khá là mệt mỏi vì tất cả những áp lực nơi công sở.", "eng": "I feel rather harassed by all the pressures at the office."}, {"viet": "Tôi thấy khía cạnh này trong công việc đặc biệt thích hợp với tôi.", "eng": "I find this aspect of my job particularly congenial."}, {"viet": "Tôi đi đến câu lạc bộ của các vận động viên cứ cách hai ngày một lần.", "eng": "I go to an athletic club every other day."}, {"viet": "Tôi đã có những giờ phút hết sức khó chịu ở chỗ ông nha sĩ.", "eng": "I had a most unpleasant time at the dentist's."}, {"viet": "Tôi phải ở nhà vì tôi bị cảm nặng.", "eng": "I had to stay at home because I caught a bad cold."}, {"viet": "Tôi đã bị hạ tầng công tác xuống vai trò chỉ là một trợ lý mà thôi.", "eng": "I have been relegated to the role of the mere assistant."}, {"viet": "Tôi có một cái giống y như cái này ….", "eng": "I have one just like it."}, {"viet": "Tôi chưa quyết định, tôi còn suy tính.", "eng": "I haven't decided yet, I'm mulling it over in my mind."}, {"viet": "Tôi nghe thấy một tiếng cách nhỏ và ánh đèn pin lóe lên.", "eng": "I heard a little snick and a flashlight came on."}, {"viet": "Tôi hi vọng đến thăm anh vào giờ này không gây phiền phức cho anh.", "eng": "I hope this isn't an inconvenient time for me to visit you."}, {"viet": "Tôi chỉ việc để lại thông báo khi tôi ra về vào buổi sáng.", "eng": "I just leave her a note when I leave in the morning."}, {"viet": "Tôi biết là chân anh đau, anh hãy kiên nhẫn đợi bác sĩ đến.", "eng": "I know your leg hurts, just be patient until the doctor arrives."}, {"viet": "Lúc đầu tôi thích anh ta nhưng bây giờ anh ta đã lộ bản chất thật của mình.", "eng": "I liked him at the first, but now he's shown his true colours."}, {"viet": "Tôi sẽ chuẩn bị mọi thứ cho buổi đi chơi ngoài trời.", "eng": "I'll get things ready for the picnic."}, {"viet": "Tôi sẽ cho biết sự thật nếu tôi biết.", "eng": "I'll tell the truth when I know it."}, {"viet": "Tôi tin tưởng là anh sẽ đến.", "eng": "I'm depending on your coming."}, {"viet": "Hôm nay tôi không có xe ôtô.", "eng": "I'm minus my car today."}, {"viet": "Tôi bị bí ở câu hỏi thứ hai.", "eng": "I'm stuck on the second question."}, {"viet": "Tôi đã gặp cô tại buổi tiệc tối qua, cô có nhớ không?", "eng": "I met you at the party last night, do you remember?"}, {"viet": "Tôi phải lựa lời nói để tránh mọi hiểu lầm.", "eng": "I must weigh my words to avoid any misunderstanding."}, {"viet": "Tôi đề nghị Tom đi pha trà.", "eng": "I nominate Tom to make the tea."}, {"viet": "Tôi coi khinh anh nếu anh không thể trả tôi tiền vào ngày mai.", "eng": "I pity you if you can't pay me the money by tomorrow."}, {"viet": "Tôi đã đọc quyển sách khi in thử.", "eng": "I read the book in proof."}, {"viet": "Tôi ở lại Luân Đôn cho tới tháng 5.", "eng": "I remain in London until May."}, {"viet": "Tôi thấy cái bình đó trong tủ hàng ở một tiệm bán đồ cổ.", "eng": "I saw the vase in the window of an antique shop."}, {"viet": "Tôi mua đồ tạp hóa dùng cho cả tuần.", "eng": "I shop for groceries every Tuesday."}, {"viet": "Tôi bắt đầu dọn các đồ trang trí bằng sứ nhưng đang làm việc đó thì đánh rơi một cái bình.", "eng": "I started moving the china ornaments but dropped a vase in the process."}, {"viet": "Tôi buộc tội anh ấy đã để ngỏ cửa?", "eng": "I taxed him with leaving the door open?"}, {"viet": "Tôi nghĩ sẽ là một ý kiến hay nếu bạn cũng tham dự vào việc xây dựng đó.", "eng": "I think it would be a good idea if you had a hand in the construction also."}, {"viet": "Tôi nghĩ là anh ta đóng vai Hamlet thật tuyệt.", "eng": "I thought he did Hamlet superbly."}, {"viet": "Tôi đã thử dùng mọi bài bản mà vẫn không thuyết phục được họ.", "eng": "I tried every trick in the book but I still couldn't persuade them."}, {"viet": "Anh cứ luôn muốn xem bộ phim này.", "eng": "I've always wanted to see this movie."}, {"viet": "Tôi muốn mua một bộ quần áo mới vì tôi được mời đi dự đám cưới.", "eng": "I want to buy a new outfit because I've been invited to a wedding."}, {"viet": "Tôi là người chứng kiến cuộc cãi nhau của họ.", "eng": "I was a witness to their quarrel."}, {"viet": "Người ta nói cho tôi hiểu là cô ấy ốm.", "eng": "I was given to understand that she was ill."}, {"viet": "Tôi ghê tởm cái thói quen bẩn thỉu của nó cứ hay khạc nhổ.", "eng": "I was revolted by his dirty habit of spitting."}, {"viet": "Tôi rất vui lòng là có thể giúp được.", "eng": "I was very pleased to be able to help."}, {"viet": "Tôi sẽ đưa các ông đến tầng hai.", "eng": "I will show you to the second floor."}, {"viet": "Tôi tự hỏi không biết có ai nhận món gì đó khác với món họ đã đặt không.", "eng": "I wonder if anyone has received something different than what they ordered."}, {"viet": "Tôi cần số lượng giá trị 2000 đô la.", "eng": "I would like $ 2,000 worth."}, {"viet": "Tôi thích một căn hộ có một nhà bếp lớn hơn.", "eng": "I would prefer an apartment with a larger kitchen."}, {"viet": "Nếu như và khi nào những người vô thần chiếm đa số thì họ có thể không in câu đó lên đồng tiền kim loại.", "eng": "If and when atheist gain the majority, they can have it removed from coins."}, {"viet": "Nếu tôi đặt hàng bây giờ, không biết khi nào tôi có thể nhận được sản phẩm đó.", "eng": "If I order now, I wonder when I can receive the product."}, {"viet": "Nếu tiền đề chính là'Con trai thích trái cây'và tiền đề thứ là'Bạn là con trai', vậy kết luận sẽ là'Do đó bạn thích trái cây'.", "eng": "If the major premise is'Boys like fruit'and the minor premise is'You are a boy', then the conclusion is'Therefore you like fruit'."}, {"viet": "Nếu anh cho phép ra ngoài đề một tí thôi,.", "eng": "If you'll allow a slight digression,."}, {"viet": "Nếu ông không rút tất cả số tiền ông đã gửi thì số tiền còn lại chư rút sẽ tiếp tục có lãi theo lãi suất cho phép lúc gửi tiền.", "eng": "If you do not withdraw all the sum you deposited, the amount remaining undrawn shall continue to bear interest at the rate allowed at the time of deposit."}, {"viet": "Nếu anh muốn, tối nay chúng ta có thể đi chơi.", "eng": "If you like, we could go out this evening."}, {"viet": "Nếu muốn kỳ này thi đỗ anh phải kiên quyết bắt tay vào ( nỗ lực làm việc ).", "eng": "If you want to pass that exam, you'll have to knuckle down ( to some hard work )."}, {"viet": "Trong một phút yếu đuối, tôi đã đồng ý trả tiền cho chuyến đi nghỉ phép của cô ta.", "eng": "In a weak moment, I agreed to pay for her holiday."}, {"viet": "Ở loài cá thì khó có thể nhận thấy.", "eng": "In fishes the cerebrum is hardly noticeable."}, {"viet": "Để củng cố sự thống nhất chính trị của đế chế mình, Càn Long ủng hộ những người theo Phái Vàng đang rất mạnh ở Tây Tạng và Mông Cổ.", "eng": "In order to strengthen the political unity of his empire, Qian Long sided with the followers of the Yellow Sect that were very powerful in Tibet and Mongolia."}, {"viet": "Trong biểu thức 3x22x1 = y, thì y là hàm hiện của x.", "eng": "In the expression 3x2 + 2x + 1 = y y is an explicit function of x."}, {"viet": "Trong cuộc thi đấu này, anh cần có kỹ năng hơn là sức lực.", "eng": "In this game, you need more science than strength."}, {"viet": "Mực tình cờ bắn lên sàn và tường.", "eng": "Ink had been randomly squirted on the floor and the walls."}, {"viet": "Ăn trái cây vẫn còn xanh có an toàn không!", "eng": "Is it safe to eat the fruit if it's still green?"}, {"viet": "Có nguồn tài nguyên nào chúng ta chưa khai thác đến không?", "eng": "Is there any resource that we have left untapped?"}, {"viet": "Một tu sĩ mà không hành động từ thiện thì không xứng đáng.", "eng": "It'll befit a priest to act uncharitably."}, {"viet": "Anh thế là tốt quá rồi, công việc tốt lại nhà đẹp-hoàn cảnh của anh thật đáng mừng.", "eng": "It's all right for you, with a good job and a nice house-you're laughing."}, {"viet": "Thật dễ bán dịch vụ bảo hiểm cho người bi quan.", "eng": "It's easy to sell insurance to a pessimist."}, {"viet": "Có thể họ sẽ thất bại trong cuộc bầu cử.", "eng": "It's likely that they will lose the election."}, {"viet": "Thường là khó đề cập đến chủ đề giới tính.", "eng": "It's often difficult to broach the subject of sex."}, {"viet": "Vẫn cái chuyện thường thấy: ai cũng muốn nhà cửa gọn gàng sạch sẽ nhưng chẳng ai muốn tự tay mình dọn dẹp.", "eng": "It's the same old story: everybody wants the house tidy, but nobody wants to tidy it himself."}, {"viet": "Hình như là hai nhà lãnh đạo đang có cuộc hội đàm bí mật.", "eng": "It appears that the two leaders are holding secret talks."}, {"viet": "Nó đã bị co và biến dạng.", "eng": "It has shrunk out of shape."}, {"viet": "Trong trường hợp khẩn cấp, điều quan trọng là phải giữ bình tĩnh.", "eng": "It is important to stay calm in an emergency."}, {"viet": "Người ta nghĩ rằng Thủ tướng định đi thăm Moscow tháng sau.", "eng": "It is thought that the Prime Minister will visit Moscow next month."}, {"viet": "Phải can đảm lắm mới bỏ nhiều tiền như vậy vào một sản phẩm.", "eng": "It must have taken a lot of nerve to risk much money on one product."}, {"viet": "Đó là một trong những món đặc sản của nhà hàng.", "eng": "It's one of the specialties of the house."}, {"viet": "Đi đường vành đai sẽ nhanh hơn.", "eng": "It should be quick if we take the ring road."}, {"viet": "Đó là một hành động can đảm khi anh ấy cứu bạn khỏi chết đuối.", "eng": "It was a noble act when he saved his friend from drowning."}, {"viet": "Nguyện vọng rõ ràng của ông ta là anh sẽ được cái đồng hồ vàng của ông ấy sau khi ông chết.", "eng": "It was his express wish that you have his gold watch after he died."}, {"viet": "Đó là một buổi sáng mà mọi thứ đều trục trặc.", "eng": "It was the sort of morning when everything goes wrong."}, {"viet": "Kết hợp hai nhà máy với nhau sẽ có lợi nhiều hơn.", "eng": "It would be more profitable to combine the two factories."}, {"viet": "Jenny kinh hoàng vì những đứa trẻ hỗn láo này.", "eng": "Jenny was alarmed by these brash children."}, {"viet": "Nhảy cẫng lên trong niềm hân hoan vì phát hiện đó.", "eng": "Jumping about in excitement at the discovery."}, {"viet": "Lan là một cô gái đẹp mê hoặc không ai cưỡng lại được.", "eng": "Lan's such a little charmer that everyone finds her irresistible."}, {"viet": "Để tôi kiểm tra sổ giao hàng của chúng tôi.", "eng": "Let me check our delivery records."}, {"viet": "Giao thông hướng về London được tản qua Slough.", "eng": "London-bound traffic is being diverted via Slough."}, {"viet": "Nhiều ý kiến đề nghị của anh đã được đưa vào kế hoạch mới.", "eng": "Many of your suggestions have been incorporated in the new plan."}, {"viet": "Mary ở đây còn tất cả những người khác ở đâu?", "eng": "Mary's here and where are all the others?"}, {"viet": "Tôi đặt cái cặp của ông ở đây được không?", "eng": "May I put your briefcase here?"}, {"viet": "Mẹ ơi, cái áo sơ-mi này không cần ủi.", "eng": "Mom, this shirt doesn't require ironing."}, {"viet": "Vui lòng đi ra cửa sau, và đến trạm chuyển tiếp đây rồi.", "eng": "Move to the rear door, please, and here's the transfer."}, {"viet": "Tài khoản của tôi ở ngân hàng cho thấy có hai lần rút tiền mỗi lần 85 pao.", "eng": "My bank account shows two debits of 85 pounds each."}, {"viet": "Cha tôi không bao giờ quay lại thành phố.", "eng": "My father never went to the city again."}, {"viet": "Mẹ tôi đã nói tôi bao nhiêu lần về sự lộn xộn bừa bãi trong phòng của tôi.", "eng": "My mother's been onto me for ages about the mess in my room."}, {"viet": "Bài phát biểu của tôi không được nói ra hoàn toàn như ý tôi đã định.", "eng": "My statement didn't come out quite as I had intended."}, {"viet": "Đừng bao giờ mua một chiếc ô tô theo giá đã quảng cáo, phải luôn luôn tìm cách mặc cả.", "eng": "Never pay the advertised price for a car, always try to bargain."}, {"viet": "Không, tôi không biết cô ấy là ai cả.", "eng": "No, I don't know who she is."}, {"viet": "Không ai chơi cái trò chơi ấy nữa, nó chỉ là thời thượng nhất thời.", "eng": "No one plays that game any more, it was only a fad."}, {"viet": "Vì mọi người đã có mặt ở đây, chúng ta hãy bắt đầu công việc đi.", "eng": "Now that everybody is here, let's get down to business."}, {"viet": "Trong số những người được thăm dò ý kiến, thì cứ mười người có bảy người cho biết là họ ưa thích bánh mì đen hơn.", "eng": "Of those polled, seven out of ten said they preferred brown bread."}, {"viet": "Được rồi, chúng tôi sẽ mang chúng đến ngay.", "eng": "OK, we'll bring them right up."}, {"viet": "Một khi giá cả đã được thoả thuận, một hợp đồng mua bán đã được nhanh chóng ký kết.", "eng": "Once the price had been agreed, a deal was quickly concluded."}, {"viet": "Một trong những huyền thoại vĩ đại của nhạc pop, Elvis Presley.", "eng": "One of the great legends of pop music, Elvis Presley."}, {"viet": "Hoa hồng 15 đô la Mỹ của chúng tôi đã được khấu trừ.", "eng": "Our commission of US $ 15 has been deducted."}, {"viet": "Dự án sau cùng của chúng tôi tốn kém hơn là chúng tôi đã trù tính.", "eng": "Our latest project was more costly than we had envisaged."}, {"viet": "Thầy giáo chúng tôi có cái tội là thiên vị rành rành.", "eng": "Our teacher is guilty of blatant favouritism."}, {"viet": "Cha mẹ nào cũng muốn con cái vâng lời.", "eng": "Parents who want children to show complete submission to their wishes."}, {"viet": "Người ta cứ luôn nói với tôi là người Trung Quốc rất hiếu khách.", "eng": "People have always told me the Chinese are very hospitable."}, {"viet": "Tôi cũng xin gửi lời thăm hỏi đến ông ấy luôn.", "eng": "Please give him my regards also."}, {"viet": "Có lẽ họ sẽ gửi cho tôi một ngân phiếu.", "eng": "Probably they will send me a cheque."}, {"viet": "Những vết đen trên tủ là do thuốc lá cháy.", "eng": "Scars on the cupboard from burning cigarettes."}, {"viet": "Bây giờ tôi phát hành vé cho ông nhé?", "eng": "Shall I issue your ticket now?"}, {"viet": "Cô ta là một người lạ lùng, sự thật, cô ta hơi kỳ cục một chút.", "eng": "She's a strange person, in fact, she's a bit of a fruit cake."}, {"viet": "Cô ta chịu trách nhiệm trực tiếp trước Bộ trưởng.", "eng": "She's directly responsible to the Minister."}, {"viet": "Người ta xem bà ta như người có uy tín hàng đầu về vấn đề này.", "eng": "She's looked on as the leading authority on the subject."}, {"viet": "Cô ta đang học ngành thống kê ở trường đại học.", "eng": "She's studying statistics at university."}, {"viet": "Cô ta ném quả bóng tuyết vào tôi nhưng tôi tránh được.", "eng": "She aimed a snowball at me, but I ducked in time."}, {"viet": "Cô ta ném quần áo của mình vào ngăn tủ mà không gấp.", "eng": "She bundled her clothes into the drawer without folding them."}, {"viet": "Cô ấy tiếp xúc với tôi ngay sau khi cô ấy đến.", "eng": "She contacted me as soon as she arrived."}, {"viet": "Cô ta quyết định một mình làm một công việc khác thường và phát động một phong trào.", "eng": "She dicided to branch out alone and launch a campaign."}, {"viet": "Nàng thích sống một mình lẻ loi trong căn hộ của mình.", "eng": "She enjoys the solitude of her own flat."}, {"viet": "Bà ta thấy khó có thể xác lập được một lề thói mới sau khi về hưu.", "eng": "She found it difficult to establish a new routine after retirement."}, {"viet": "Bà ta túm lấy gáy tôi và quẳng tôi ra ngoài.", "eng": "She grabbed me by the scruff of my neck and threw me out."}, {"viet": "Bà ấy có hai đối thủ chính trị mạnh.", "eng": "She had two potential political adversaries."}, {"viet": "Cô ta không cho biết là cô ta đề nghị nên phản ứng như thế nào.", "eng": "She has not indicated how she proposes to react."}, {"viet": "Bà ấy bực bội khi thấy lúc nào ông ta cũng bận tâm về tiền bạc.", "eng": "She irritatingly found his preoccupation with money irritating."}, {"viet": "Cô ấy luôn cảm thông và đầy lòng khoan dung.", "eng": "She is sympathetic and full of forgiveness."}, {"viet": "Cô ta đã bỏ nhà đi cách đây hai tuần và từ đấy chúng tôi không biết tin gì về cô ta nữa.", "eng": "She left home two weeks ago and we haven't heard from her since."}, {"viet": "Cô ấy đã tỏ ra rất miễn cưỡng, nhưng cuối cùng đã chấp nhận đề nghị của chúng tôi.", "eng": "She made a great show of reluctance, but finally accepted our offer."}, {"viet": "Cô ấy không chỉ nhảy vào cuộc thi-thậm chí cô còn chiếm giải nữa!", "eng": "She not only entered the competition-she actually won it!"}, {"viet": "Nàng coi thường ý tưởng cho rằng anh ấy không bao giờ trở lại.", "eng": "She poured scorn on the suggestion that he might never return."}, {"viet": "Cô ta kể lại ( cho họ ) chuyện đó đã xảy ra như thế nào.", "eng": "She related ( to them ) how its happened."}, {"viet": "Cô ta xứng đáng được thăng thưởng sớm.", "eng": "She's due for promotion soon."}, {"viet": "Cô ta thường có mặt ở nhà trước 7 giờ.", "eng": "She's usually in by seven o'clock."}, {"viet": "Cô ấy dường như là chủ đề chính của câu chuyện vào lúc này.", "eng": "She seems to be the staple topic of conversation at the moment."}, {"viet": "Cô ấy vồ lấy cành cây một cách cuống quít khi bị ngã.", "eng": "She snatched wildly at the branch as she fell."}, {"viet": "Cô ta nịnh hót ông ấy bằng cách đồng ý với tất cả những gì ông ta nói.", "eng": "She sucks up to him by agreeing with everything he says."}, {"viet": "Cô ta mang tất cả những vỏ không về cửa hàng.", "eng": "She took all the empties back to the shop."}, {"viet": "Bà ta thường có những học trò giỏi nhất đỗ vào đại học.", "eng": "She usually gets her best pupils into university."}, {"viet": "Cô ta luôn được các bạn bè thân thiết của cô ấy đề cao.", "eng": "She was always made much of her adoring friends."}, {"viet": "Cô ta hoan hỉ khi nghe tin ấy.", "eng": "She was elated by the news."}, {"viet": "Cô ta trông xanh xao và mệt mỏi sau cơn thử thách gay go của cô ta.", "eng": "She was looking pale and wan after her ordeal."}, {"viet": "Cô ta được cử ra nước ngoài làm một nhiệm vụ khó khăn.", "eng": "She was sent abroad on a difficult assignment."}, {"viet": "Bà ta ốm lắm, nhưng đã qua cơn hiểm nghèo.", "eng": "She was very ill, but is now out of danger."}, {"viet": "Cô ta khóc tới mức bị kiệt sức.", "eng": "She wept herself into a state of exhaustion."}, {"viet": "Cô ta làm việc ở Cơ quan nhà nước.", "eng": "She works in the Civil Service."}, {"viet": "Em nên phết bơ trước khi nướng bánh mì hay sao khi nướng?", "eng": "Should I spread the butter before toasting it or after?"}, {"viet": "Từ khi trốn thoát khỏi nhà tù, Tom sống trong nơm nớp lo sợ bị bắt lại.", "eng": "Since he escaped from goal, Tom has been living on a razor's edge, terrified of recapture."}, {"viet": "Đào tẩu khỏi đất nước với số tiền ăn cắp.", "eng": "Skip out of the country with the stolen money."}, {"viet": "Vuốt cho hết các nếp nhăn ở khăn trải giường.", "eng": "Smooth out the rucks in the bedclothes."}, {"viet": "Hoạt động xã hội làm cho người già khỏi cô đơn.", "eng": "Social activities preserve our people from loneliness."}, {"viet": "Một số thức ăn dễ hấp thụ hơn một số khác.", "eng": "Some foods assimilate more easily than others."}, {"viet": "Một số người nói rằng ngồi thiền rất tốt cho sức khỏe.", "eng": "Some people say meditation is very good for your health."}, {"viet": "Người nào đó có tên Henry muốn gặp anh.", "eng": "Someone of the name of Henry wants to see you."}, {"viet": "Đặt những cây cột cách nhau ba mét.", "eng": "Space out the post three metres apart."}, {"viet": "Đầm đất cho chặt cứng lại.", "eng": "Stamp the soil down so that it's compact."}, {"viet": "Kiên trì chịu đựng trước cảnh đói.", "eng": "Stoic resignation in the face of hunger."}, {"viet": "Sự căng thẳng có thể làm cho virút đang ngủ yên trong máu hoạt động.", "eng": "Stress may activate the virus which has lain dormant in the blood."}, {"viet": "Quần áo xuề xoà như thế không phù hợp với một dịp trang trọng.", "eng": "Such casual dress would not be correct for a formal occasion."}, {"viet": "Ủng hộ sự hợp nhất giữa hai đảng của chúng ta.", "eng": "Support the union between our two parties."}, {"viet": "Mang một cuốn phim đi rửa.", "eng": "Take a film to be developed."}, {"viet": "Giá biểu thuế đánh vào việc nhập khẩu hàng công nghiệp.", "eng": "Tariffs on the import of manufactured goods."}, {"viet": "Năm rồi người ta ghi nhận có mười vụ vỡ nợ ở thành phố này.", "eng": "Ten bankruptcies were recorded in this town last year."}, {"viet": "Đó là một cuốn sách hay nhưng không thể so sánh với cuốn này được.", "eng": "That's a good book, but it doesn't bear comparison with this one."}, {"viet": "Con mèo lặng lẽ rón rén tiến về phía con chim.", "eng": "That cat crept silently towards the bird."}, {"viet": "Nhà của chúng tôi ngay trước mặt anh.", "eng": "That is our house right in front of you."}, {"viet": "Người đó vừa đi bộ vừa hút thuốc.", "eng": "That person is smoking and walking at the same time."}, {"viet": "Nhận xét ấy, theo tôi là không phù hợp sự thực.", "eng": "That statement, I submit is not in accord with the truth."}, {"viet": "Đồng 50 penni có hình con sư tử đội vương miện ở mặt trái.", "eng": "The 50p coin has a crowned lion on its reverse."}, {"viet": "Câu chuyện được đặt ra trong bối cảnh nước Pháp.", "eng": "The action is set in France."}, {"viet": "Tiếng còi báo động vang lên và thế là tất cả chúng tôi a lê hấp ai vào căn cứ nấy.", "eng": "The alarm goes off and-whammo!-we're all at our assigned stations."}, {"viet": "Thuốc chống dị ứng đó làm tôi mụ người nên tôi không thể suy nghĩ tỉnh táo được.", "eng": "The antihistamine spaces me out so I can't think clearly."}, {"viet": "Mùi thơm của thức ăn nấu nướng toả ra khi nàng mở cửa.", "eng": "The aroma of cooking greeted her as she opened the door."}, {"viet": "Khán giả im phăng phắc đến nỗi bạn có thể nghe được tiếng ruồi bay.", "eng": "The audience was so quite that you could have heard a pin drop."}, {"viet": "Hậu quả của những năm chiến tranh.", "eng": "The backwash effect of the war years."}, {"viet": "Lá cờ phất phới trong làn gió nhẹ.", "eng": "The banner streamed in the breeze."}, {"viet": "Người hành khách xin xu của khách qua đường.", "eng": "The beggar cadged dimes from passers-by."}, {"viet": "Lối hành văn cẩu thả của ông ta đã làm mất đi nét đặc sắc của câu chuyện.", "eng": "The bite of his story is spoiled by his slovenly style."}, {"viet": "Cuộc oanh tạc tiếp tục không ngừng.", "eng": "The bombardment continued without cessation."}, {"viet": "Ông chủ sẽ thật sự quở trách anh nghiêm khắc nếu anh làm việc này không đúng thời hạn.", "eng": "The boss will really give it to you if you miss the deadline for the job."}, {"viet": "Đồ đồng cần được đánh bóng-nó xỉn quá rồi.", "eng": "The brasswork needs polishing-it's badly tarnished."}, {"viet": "Viên đạn ghim vào óc anh ấy.", "eng": "The bullet was lodged in his brain."}, {"viet": "Chiến dịch chống việc uống rượu và lái xe ẩu sẽ gồm cả việc kiểm tra những người lái xe mô tô.", "eng": "The campaign against drinking and driving will include spot checks on motorists."}, {"viet": "Nếu nói về máy thì chiếc xe ô tô đó là tốt, nhưng cũng phải hết sức lưu ý tới thân xe đấy.", "eng": "The car is fine as far as the engine is concerned but the bodywork needs a lot of attention."}, {"viet": "Vụ án đó sẽ được đưa ra xét xử vào tháng tới.", "eng": "The case comes up for trial next month."}, {"viet": "Ông chủ tịch... cố làm đám biểu tình ngừng bằng cách dùng búa gõ.", "eng": "The chairman... tries to gavel the demonstration to an end."}, {"viet": "Tình cảm của đứa bé phải chịu đựng sự ức chế liên tục.", "eng": "The child's affections were suffered continual restraint."}, {"viet": "Người ta trình báo đứa trẻ bị mất tích hôm thứ Sáu.", "eng": "The child was reported missing on Friday."}, {"viet": "Bọn trẻ thích tạt nước vào nhau.", "eng": "The children love splashing water over each other."}, {"viet": "Khuôn mặt đầy bồ hóng của người quét ống khói.", "eng": "The chimney sweep's sooty face."}, {"viet": "Người dọn dẹp đã làm rối tung giấy tờ của tôi nên tôi không tìm được cái tôi cần.", "eng": "The cleaner had muddled my papers, and I couldn't find the one I wanted."}, {"viet": "Bây giờ chiếc áo đối với hắn còn quá rộng, nhưng rồi hắn lớn lên thì vừa.", "eng": "The coat is too big for him now, but he will grow into it."}, {"viet": "Ủy ban đã quyết định vấn đề đó nằm ngoài phạm vi cứu xét của mình.", "eng": "The committee decided that the matter lay outside its terms of reference."}, {"viet": "Công ty ấy đang thăm dò tìm vàng ở vùng đó.", "eng": "The company is prospecting for gold in that area."}, {"viet": "Tín đồ từng đoàn lũ lượt đi vào nhà thờ.", "eng": "The congregation entered the church in procession."}, {"viet": "Sự thối rữa của thân thể sau khi chết.", "eng": "The corruption of the body after death."}, {"viet": "Miền quê đó bị tràn ngập những băng cướp bóc.", "eng": "The countryside was overrun by marauding bands."}, {"viet": "Cuộc khủng hoảng đó đã thử thách lòng can đảm và tài ba của anh ấy.", "eng": "The crisis put his courage and skill to the test."}, {"viet": "Những đặc tính chữa bệnh của một loại dược thảo.", "eng": "The curative properties of a herb."}, {"viet": "Ngày biểu diễn xiếc, lũ trẻ phấn khởi rộn ràng.", "eng": "The day of the circus, the children were atingle with excitement."}, {"viet": "Những yêu cầu về các nhà thể thao ngày nay có thể đưa tới sự kiệt quệ khi còn trẻ.", "eng": "The demands on sportsmen today can bad to burn-out at an early age."}, {"viet": "Nhà độc tài đó đã dẹp tất cả mọi phe đối lập cho là bất hợp pháp.", "eng": "The dictator represses an opposition as illegal."}, {"viet": "Tiếng rì rầm xa xa của biển, tiếng róc rách xa xa của một con suối, tiếng ầm ì xa xa của xe cộ đi lại, v. v.", "eng": "The distant murmur of the sea, of a brook, of traffic, etc."}, {"viet": "Bác sĩ sẽ gặp anh ngay.", "eng": "The doctor will see you momentarily."}, {"viet": "Con chó đang khịt khịt đánh hơi chung quanh các rễ cây.", "eng": "The dog was snuffling around the roots of a tree."}, {"viet": "Người lái xe hơi bị choáng sau vụ tai nạn nhưng còn cái khác thì không bị sao hết.", "eng": "The driver was rather shocked after the accident, but otherwise all right."}, {"viet": "Ông chủ bút đó đã làm hỏng bài báo của tôi bằng cách bỏ hẳn nhiều đoạn trong bài.", "eng": "The editor mutilated my text by removing whole paragraphs from it."}, {"viet": "Quân địch đang bao vây chúng ta.", "eng": "The enemy troops were hemming us in."}, {"viet": "Giọng êm ái của một diễn giả.", "eng": "The euphony of a speaker's voice."}, {"viet": "Vụ nổ ở nhà máy hóa chất gây ra nỗi kinh hoàng về một vụ ô nhiễm trầm trọng.", "eng": "The explosion at the chemical factory caused a major pollution scare."}, {"viet": "Gia đình đó lại bị một thảm kịch nữa giáng xuống.", "eng": "The family was struck by yet another tragedy."}, {"viet": "Cánh đồng dốc về hướng đông.", "eng": "The field slopes away to the east."}, {"viet": "Tình trạng tài chính khó khăn là do chiến tranh.", "eng": "The financial embarrassment was consequent on the war."}, {"viet": "Các buồng hạng nhất ở phía trước.", "eng": "The first-class compartments are in front."}, {"viet": "Hạm đội đang diễn tập ở biển Ban-tích.", "eng": "The fleet is manoeuvring in the Baltic."}, {"viet": "Hôm nay các bộ trưởng bộ ngoai giao của 15 nước EU gặp nhau ở Brussels.", "eng": "The foreign minister of the 15 EU countries meet in Brussels today."}, {"viet": "Người hậu vệ làm anh ta ngã lăn ra đất.", "eng": "The fullback brought him crashing to the ground."}, {"viet": "Bộ quân phục của viên tướng được trang điểm bằng những dải viền vàng.", "eng": "The general's uniform was trimmed with gold braid."}, {"viet": "Người thủ môn đập bóng hai lần xuống đất rồi đá bóng lên.", "eng": "The goalkeeper bounced the ball twice before kicking it."}, {"viet": "Chính phủ gạt bỏ những mục không cần thiết ra khỏi ngân sách.", "eng": "The government eliminated dispensable items from the budget."}, {"viet": "Chính phủ vẫn phải tiếp tục thuyết phục những người hay hoài nghi rằng chính sách của chính phủ sẽ có kết quả.", "eng": "The government must still convince the skeptics that its policy will work."}, {"viet": "Sự khác nhau quan trọng nhất giữa thành phố trên và dưới là ở phẩm chất của các cửa hiệu.", "eng": "The great divide between the upper and lower town is the quality of the shops."}, {"viet": "Người khách trọ bỏ quên chìa khoá trong phòng.", "eng": "The guest has left his key in his room."}, {"viet": "Thầy hiệu trưởng phạt roi các cậu học sinh vì tội không vâng lời.", "eng": "The headmaster canned the boys for disobedience."}, {"viet": "Ngọn núi không thể đến từ phía biển.", "eng": "The hill is unapproachable from the seaside."}, {"viet": "Cái nắng nóng làm anh ấy đổ mồ hôi.", "eng": "The hot sun made him exude sweat."}, {"viet": "Ngôi nhà đó nằm cách xa con đường.", "eng": "The house stands back from the road."}, {"viet": "Đèn đồng hồ loé sáng báo hiệu đầu máy sắp sửa quá nóng.", "eng": "The idiot light flashed on to show that the engine was about to overheat."}, {"viet": "Tính không ổn định cố hữu của hoá chất này.", "eng": "The inherent instability of this chemical."}, {"viet": "Việc phát minh ra động cơ chạy bằng hơi nước và ứng dụng chúng trong nhà máy đã thúc đẩy rất mạnh tới sự phát triển của thành phố.", "eng": "The invention of the steam engine and its use in factories gave a very big push to the growth of cities."}, {"viet": "Phán quyết của quan tòa đã chấm dứt cuộc tranh chấp giữa những người hàng xóm.", "eng": "The judge's ruling put to rest the dispute between the neighbours."}, {"viet": "Yêu cầu của nhà vua có giá trị như một mệnh lệnh.", "eng": "The King's request was tantamount to a command."}, {"viet": "Bàn thắng cuối cùng là một bàn thắng tuyệt vời.", "eng": "The last goal was a blinder."}, {"viet": "Những chiếc lá cây bắt đầu héo.", "eng": "The leaves are beginning to wilt."}, {"viet": "Ngọn đèn trong phòng tắm quá mờ trong khi đó ngọn đèn bàn lại quá sáng.", "eng": "The light in the bathroom is too dim while the table lamp is too bright."}, {"viet": "Cái vẻ ngây thơ cô ta tạo ra đã đánh lừa hết bọn tôi.", "eng": "The look of innocence she assumed has us all fooled."}, {"viet": "Quan toà đã từ chối cấp giấy tại ngoại hậu cứu cho anh ta.", "eng": "The magistrate refused him bail."}, {"viet": "Bà quản đốc sắp rảnh-anh có thể đợi bà ấy ở đây.", "eng": "The manager will be free soon-you can wait for her here."}, {"viet": "Tìm giá trị trung bình của 13, 5 và 27 bằng cách cộng ba số lại với nhau rồi chia với 3.", "eng": "The mean of 13, 5 and 27 is found by adding them together and dividing by 3."}, {"viet": "Tất cả cánh đàn ông đã đi câu cá.", "eng": "The menfolk have gone out fishing."}, {"viet": "Tên lửa trệch khỏi đường bay của nó.", "eng": "The missile deflected from its trajectory."}, {"viet": "Ấn bản buổi sáng của một tờ báo.", "eng": "The morning edition of a newspaper."}, {"viet": "Tên trấn lột đâm nạn nhân bằng một con dao.", "eng": "The mugger thrust at his victim with a knife."}, {"viet": "Các nhà thương thuyết không tìm được sự thoả hiệp nào.", "eng": "The negotiators could find no middle ground."}, {"viet": "Ông giám đốc mới đã đến khi cô ấy vắng mặt.", "eng": "The new manager had arrived during her absence."}, {"viet": "Cuộc đua ngựa Newmarket bao giờ cũng được nhiều người tham gia.", "eng": "The Newmarket Stakes is always a popular race."}, {"viet": "Bầu trời đêm lấp lánh sao.", "eng": "The night sky gemmed with stars."}, {"viet": "Bộ lông của các chim đực vào mùa đạp mái.", "eng": "The nuptial plumage of male birds."}, {"viet": "Cây đèn dầu cần có một bóng tròn mới.", "eng": "The oil-lamp needs a new globe."}, {"viet": "Thế vận hội Olympic thực sự là được hàng tỉ người trên thế giới xem.", "eng": "The Olympic Games were watched by literally billions of people around the world."}, {"viet": "Tế bào kia gọi là trứng.", "eng": "The other is called an egg."}, {"viet": "Gói bưu kiện đã đến trong chuyến thư sáng nay, tức do lần phát thư sáng nay đưa đến.", "eng": "The parcel came in this morning's post."}, {"viet": "Sự hồi phục nhanh chóng của bệnh nhân sau cuộc phẫu thuật.", "eng": "The patient's speedy revival after her operation."}, {"viet": "Những người mà họ ghé đây ngày hôm qua muốn mua căn nhà này.", "eng": "The people who called yesterday want to buy the house."}, {"viet": "Bức tranh về việc chế tạo đồ gốm ngày xưa cho thấy những phụ nữ đang nặn đồ gốm chỉ bằng đôi tay của họ.", "eng": "The picture of pottery making long ago shows the women doing the shaping with only their hands."}, {"viet": "Kế hoạch đã được tán thành với vài sửa đổi nhỏ.", "eng": "The plan was approved, with some minor modifications."}, {"viet": "Vở kịch làm chúng tôi cười ngặt nghẽo.", "eng": "The play had us in stitches."}, {"viet": "Cảnh sát treo một giải thưởng lớn cho ai biết tin tức về vụ giết người.", "eng": "The police are offering a big reward for any information about the murder."}, {"viet": "Cảnh sát kiểm tra tất cả những bè bạn của nạn nhân.", "eng": "The police made a check on all the victim's friends."}, {"viet": "Người cảnh sát được hối lộ 600 bảng Anh để im miệng.", "eng": "The policeman was offered a bribe of £ 600 to keep his mouth shut."}, {"viet": "Người bưu tá ngày nào cũng phải dậy trước lúc rạng đông.", "eng": "The postman has to get up before dawn everyday."}, {"viet": "Tổng thống luôn luôn có sáu vệ sĩ túc trực sát cạnh.", "eng": "The President always has six bodyguards in close attendance."}, {"viet": "Giá của ngôi nhà bao gồm cả nhiều đồ đạc và trang bị cố định không hợp với sở thích của chúng tôi.", "eng": "The price of the house included many existing fixtures and fittings that were not to our taste."}, {"viet": "Tù nhân đó không tỏ ra hối hận gì về những tội ác của hắn.", "eng": "The prisoner shows no remorse for his crimes."}, {"viet": "Đề án trở nên quá tốn kém nên chúng tôi đã phải rút bỏ.", "eng": "The project became so expensive that we had to pull out."}, {"viet": "Bộ máy tuyên truyền quảng cáo đã che giấu những thua lỗ nặng nề của công ty.", "eng": "The public relations machine covered up the firm's heavy losses."}, {"viet": "Nữ hoàng được các giám đốc tháp tùng khi bà đi thăm nhà máy.", "eng": "The queen was escorted by the directors as she toured the factory."}, {"viet": "Tỷ lệ lạm phát phải được giữ ở mức thấp.", "eng": "The rate of inflation must be held down."}, {"viet": "Những người tị nạn chịu cảnh thiếu thốn khủng khiếp.", "eng": "The refugees suffered terrible deprivations."}, {"viet": "Sự hưởng ứng quỹ quyên góp thật phi thường.", "eng": "The response to the appeal fund has been phenomenal."}, {"viet": "Quyền vùng lên, và gạt bỏ chính quyền hiện hữu.", "eng": "The right to rise up, and shake off the existing government."}, {"viet": "Con đường luồn lách xuyên qua một dãy đồi.", "eng": "The road weaves through the range of hill."}, {"viet": "Con đường duyệt binh rải rác phân ngựa sau khoảng hai mươi phút.", "eng": "The route of the parade was littered with alley apples after about twenty minutes."}, {"viet": "Việc bán được những chiếc khay mới đã đem lại một khoản tiền lớn cho công ty.", "eng": "The sale of novelty trays turned out to be a nice little earner for the company."}, {"viet": "Trường học thiếu thiết bị.", "eng": "The school is rather badly-off for equipment."}, {"viet": "Ô. Baker, người tự xưng là lãnh đạo giáo phái.", "eng": "The self-styled leader of the sect, Mr Baker."}, {"viet": "Khối lượng lớn công việc kinh doanh, việc làm, thư từ, v. v.", "eng": "The sheer volume of business, work, mail, etc."}, {"viet": "Sức ép của tiếng nổ đã làm vỡ tan nhiều cửa sổ.", "eng": "The shock of the blast shattered many windows."}, {"viet": "Tấm biển nhạt màu vì năm tháng và nắng gió.", "eng": "The sign was bleached by age and weather."}, {"viet": "Vận hội của thị trấn nhỏ thăng trầm cùng với vận hội của mỏ.", "eng": "The small town's fortunes rose and fell in cadence with the mine's."}, {"viet": "Những người lính điểm số bắt đầu từ người đứng ở bên tay phải.", "eng": "The soldiers numbered off, starting from the right-hand man."}, {"viet": "Diễn giả cứ nói loanh quanh ngoài đề.", "eng": "The speaker kept wandering off from the point."}, {"viet": "Tiết mục chính là một nhóm nhạc rốc trẻ.", "eng": "The star turn was a young rock group."}, {"viet": "Câu chuyện nó kể là hoàn toàn bịa đặt.", "eng": "The story he told was complete romance."}, {"viet": "Các kiểu dáng của sảnh đường Trung Quốc rất khác nhau.", "eng": "The styles of Chinese pavilions vary greatly."}, {"viet": "Viên thanh tra xem xét kỹ lưỡng toàn bộ ngôi nhà và khuyên chúng tôi không nên mua.", "eng": "The surveyor went over the house thoroughly and advised us not to buy it."}, {"viet": "Thầy giáo giới thiệu cho học sinh của mình những bước cơ bản trong lĩnh vực sinh học.", "eng": "The teacher initiated his students into the field of biology."}, {"viet": "Ban đêm nhiệt độ giảm mạnh.", "eng": "The temperature fell sharply in the night."}, {"viet": "Bọn kẻ cắp đã bỏ chạy khi chuông báo động trộm vang lên.", "eng": "The thieves ran away when the burglar alarm went off."}, {"viet": "Dòng thác đã xói thành một con lạch chảy xuống sườn đồi.", "eng": "The torrent scoured a gully down the hillside."}, {"viet": "Năm phút nữa xe lửa sẽ đến.", "eng": "The train will arrive in 5 minutes."}, {"viet": "Học phí ở trường đó cực kỳ cao.", "eng": "The tuition at that school is sky high."}, {"viet": "Hai quốc gia đã ký hiệp định hợp tác chống chủ nghĩa khủng bố.", "eng": "The two states made a compact to co-operate against terrorism."}, {"viet": "Tối nay tổng thống Mĩ sẽ phát biểu trên đài truyền hình.", "eng": "The US. president is speaking on television tonight."}, {"viet": "Ngôi làng đã bị bom của địch phá huỷ.", "eng": "The village was blasted by enemy bombs."}, {"viet": "Nước kêu ồng ộc khi chảy qua lỗ nút.", "eng": "The water gurgled as it ran down the plug-hole."}, {"viet": "Toàn bộ buổi tối ấy dường như hư ảo một cách lạ kỳ.", "eng": "The whole evening seemed strangely unreal."}, {"viet": "Thời tiết giá rét đã gây ra hỗn loạn trên các nẻo đường.", "eng": "The wintry weather has caused chaos on the roads."}, {"viet": "Tác phẩm của tất cả những nhà văn nói trên.", "eng": "The works of all the aforementioned writers."}, {"viet": "Cuộc tranh luận giữa họ làm buổi liên hoan kém vui đi đôi chút.", "eng": "Their argument put a bit of a damper on the party."}, {"viet": "Cuộc hôn nhân của họ đang trải qua một thời kỳ khó khăn.", "eng": "Their marriage has been going through a bad patch."}, {"viet": "Rồi mỗi năm thứ tư họ có thể có năm nhuận với 366 ngày.", "eng": "Then every fourth year they would have a leap year with 366 days in it."}, {"viet": "Có một con đường tốt loại A đi lên phía bắc đó là đường A1.", "eng": "There's a good A-road going North the A1."}, {"viet": "Không có gì che giấu được sự thật hắn là một kẻ nói dối.", "eng": "There's no disguising the fact that he's a liar."}, {"viet": "Có phần nào không ổn ở sự phối hợp màu, nhưng tôi không thể nào xác định rõ được.", "eng": "There's something wrong with this colour scheme but I can't quite pin it down."}, {"viet": "Có nhiều nơi để đến thăm.", "eng": "There are many places to visit."}, {"viet": "Có hai mệnh đề trong Chúng tôi chọn cái chúng tôi muốn.", "eng": "There are two clauses in We choose what we want."}, {"viet": "Có lời kêu gọi nhượng bộ một số quyền nhất định.", "eng": "There is a call for the concession of certain rights."}, {"viet": "Nó ở đằng góc giao lộ đó.", "eng": "There is it at the corner of the intersection."}, {"viet": "Không còn chỗ nào để kê đồ đạc.", "eng": "There isn't enough space for any more furniture."}, {"viet": "Có một cuộc đánh nhau ầm ĩ khi các công nhân được biết là họ đã mất việc.", "eng": "There was a riot when the workers were told they had lost their jobs."}, {"viet": "Họ nói rằng, không bao giờ có sóng gợn trên mặt hồ.", "eng": "There were, they said never any waves on its surface."}, {"viet": "Những sự việc hoàn tất này chỉ là phần phụ đối với mục đích chủ yếu của anh ta.", "eng": "These accomplishments are merely collateral to his primary goal."}, {"viet": "Những vết mực này sẽ không tẩy sạch được ( khỏi quần áo tôi ).", "eng": "These ink stains won't come out ( of my dress )."}, {"viet": "Ba người này, đó là chủ đất, người hợp đồng thuê và người thuê.", "eng": "These three persons, viz landlord, lessee and tenant."}, {"viet": "Họ ứng xử với tình thế một cách rất người lớn.", "eng": "They've dealt with the situation in a very adult way."}, {"viet": "Họ sắp cưới nhau, và quan trọng hơn nữa họ đang cùng nhau gây dựng cơ sở kinh doanh.", "eng": "They are going to get married, and what's more they are setting up in business together."}, {"viet": "Họ mang áo quần đến và học trong khi giặt áo quần.", "eng": "They bring their clothes and study while the clothes wash."}, {"viet": "Họ nhảy múa như là một kiểu cầu nguyện thần linh.", "eng": "They danced as a way of praying to their gods."}, {"viet": "Họ đã thất bại trong mọi cố gắng trèo lên ngọn núi.", "eng": "They failed in all their attempts to climb the mountain."}, {"viet": "Họ không chờ đợi một sự chống đối như vậy.", "eng": "They has not bargained for such opposition."}, {"viet": "Họ để lại những dấu chân để đánh lừa cảnh sát.", "eng": "They left footprints as a plant to confuse the police."}, {"viet": "Lúc này họ cần có thêm tiền, nhưng điều quan trọng hơn là họ cần được sự giúp đỡ dài hạn.", "eng": "They need more money now but, more important, they need long-term help."}, {"viet": "Chúng đang chơi đùa với bạn bè.", "eng": "They're playing with their friends."}, {"viet": "Họ tỏ ra thật bình tĩnh khi đối phó với cuộc hoả hoạn.", "eng": "They showed great sang-froid in dealing with the fire."}, {"viet": "Họ vốn sống ở Xcốtlen nhưng đã chuyển xuống miền nam.", "eng": "They used to live in Scotland but they moved down south."}, {"viet": "Họ được cảnh báo một cách rõ ràng là không được lên núi vào buổi tối.", "eng": "They were explicitly warned not to go up the mountain at night."}, {"viet": "Họ giành được chức vô địch cách đây năm năm.''Đúng thế'.", "eng": "They won the championship five years ago.''So they did.'."}, {"viet": "Loại nhung màu xanh này được làm ở Thượng Hải.", "eng": "This blue one is made in Shanghai."}, {"viet": "Tem phiếu này có thể đổi lấy tiền ở bất cứ chi nhánh nào của chúng tôi.", "eng": "This coupon can be redeemed at any of our branches."}, {"viet": "Trò chơi này sẽ làm bọn trẻ bận rộn suốt buổi chiều.", "eng": "This game will keep the children occupied all afternoon."}, {"viet": "Đây là bạn cùng lớp của tôi, John Winters.", "eng": "This is my classmate, John Winters."}, {"viet": "Sự kiện gần đây nhất này có thể là cái đòn bẩy thúc đẩy chính phủ thay đổi chính sách.", "eng": "This latest incident may be the lever needed to change government policy."}, {"viet": "Loại nước cam này không chứa các hương liệu nhân tạo.", "eng": "This orange drink contains no artificial flavourings."}, {"viet": "Nhà ăn này dọn ra những suất ăn ít ỏi.", "eng": "This restaurant serves very mingy portions."}, {"viet": "Văn bản này có nhiều chỗ bẫy đối với người dịch.", "eng": "This text presents many pitfalls for the translator."}, {"viet": "Lũ trẻ ấy sẽ làm tôi chết mất thôi, đêm nào chúng cũng về rất muộn.", "eng": "Those kids will be the death of me, coming home so late every night."}, {"viet": "Hôm nay thật sự là một dịp vui đối với tất cả chúng ta được có mặt ở đây.", "eng": "Today is indeed a joyous occasion for all of us present here."}, {"viet": "Hãy bật nó lên bằng cái điều khiển từ xa đi.", "eng": "Turn it on using the remote control."}, {"viet": "Tội ác bạo lực chỉ là một trong những tệ nạn làm nhức nhối xã hội hiện đại.", "eng": "Violent crime is only one of the maladies afflicting modern society."}, {"viet": "Chúng ta nên để một ít tiền chi tiêu cho những việc ngẫu nhiên.", "eng": "We'd better leave some money to pay for the incidentals."}, {"viet": "Chúng tôi đã bị phiền phức nhiều rồi.", "eng": "We're already been put to great inconvenience."}, {"viet": "Chúng tôi hò reo cổ vũ đội bóng chày của trường.", "eng": "We're rooting for the college baseball team."}, {"viet": "Chúng tôi đã mời gia đình Fraser đến chơi tối nay.", "eng": "We've invited the Frasers round this evening."}, {"viet": "Chúng tôi xin lỗi vì sự trả lời chậm trễ lá thư của ông.", "eng": "We apologize for our tardy response to your letter."}, {"viet": "Chúng tôi thành thật xin lỗi vì đã gây ra bất tiện này.", "eng": "We are very sorry for the inconvenience."}, {"viet": "Chúng ta không thể cho phép những lỗi như vậy xảy ra nữa.", "eng": "We can afford any more mistakes of that kind."}, {"viet": "Chúng tôi coi việc này rất quan trọng.", "eng": "We consider this very important."}, {"viet": "Chúng ta chẳng phải nhìn đâu xa mới tìm ra chứng cứ của.", "eng": "We don't have to look far afield to find evidence of..."}, {"viet": "Chúng tôi kiếm được lãi suất khẩu từ hàng hoá và các việc dịch vụ.", "eng": "We get export earnings from goods and services."}, {"viet": "Chúng tôi phải tằn tiện để thanh toán được các hoá đơn.", "eng": "We had to scrimp and save to pay the bills."}, {"viet": "Chúng tôi vẫn chưa được các ông ủng hộ đặt hàng và xin được hỏi là các ông đã có quyết định chưa.", "eng": "We have not been favored with your order yet and we would like to ask if you have made a decision."}, {"viet": "Chúng tôi đã mời cô ta đến ăn cơm tối nhưng cô cũng không buồn đến.", "eng": "We invited her to dinner but she didn't even bother to turn up."}, {"viet": "Chúng tôi liên lạc với con tàu bằng điện đài.", "eng": "We made contact with the ship by radio."}, {"viet": "Chúng ta không được quên người dân thường.", "eng": "We must not forget about the grass roots."}, {"viet": "Chúng tôi chỉ xem bức vẽ mới trong tình trạng chưa hoàn thành.", "eng": "We only saw the new painting in the rough."}, {"viet": "Chúng tôi ngồi quanh trong quán giải khát tán gẫu.", "eng": "We sat around in the bar, shooting the breeze."}, {"viet": "Chúng tôi ở hai tuần bên bờ biển mùa hè.", "eng": "We spent two weeks by the seaside in the summer."}, {"viet": "Chúng tôi chờ tin tức với một cảm giác lo lắng ngày càng tăng.", "eng": "We waited for news with a growing sense of anxiety."}, {"viet": "Chúng tôi đã bị bịp và mất nhiều tiền.", "eng": "We were given the shaft, and lost a lot of money."}, {"viet": "Chúng tôi sẽ không hoàn thành công việc đó vào hôm nay, nhưng chúng tôi sẽ xong giai đoạn khởi đầu.", "eng": "We won't finish the job today but we'll have made a start."}, {"viet": "À, để tôi xem hiện giờ ông ấy có rảnh không, nếu ông thấy không phiền phải chờ trong chốc lát.", "eng": "Well, i'll just see if he's free now, if you don't mind waiting a moment."}, {"viet": "Thôi, tốt hơn chúng ta nên thắt đai an toàn.", "eng": "Well, we'd better fasten our seat-belts."}, {"viet": "Từ tree là gì trong ngôn ngữ của bạn?", "eng": "What's the word for tree in your language?"}, {"viet": "Bạn đang làm gì ở khu này vậy?", "eng": "What are you doing in this neighborhood?"}, {"viet": "Tối nay ta đi xem hát nhé, anh thấy thế nào?", "eng": "What do you say to going to the theatre tonight?"}, {"viet": "Cuốn sách được ưa chuộng nhất của ông ấy là gì?", "eng": "What is his most popular book?"}, {"viet": "Anh giải thích sao cho việc đến chậm?", "eng": "What is your explanation for being late?"}, {"viet": "Tôi lên xe lửa ở thềm ga nào?", "eng": "What platform do I go to for the train?"}, {"viet": "Vậy mấy giờ cậu ấy có ở nhà?", "eng": "What time will he be home?"}, {"viet": "Có khi nào anh nhận ra rằng mình đã nắm được một cái gì đó thật sự có tầm quan trọng lớn lao?", "eng": "When did you realize you were onto something really big?"}, {"viet": "Khi tôi ngồi trên chiếc ghế cũ, nó long ra từng mảnh.", "eng": "When I sat on the old chair, it fell to pieces."}, {"viet": "Khi lính cứu hoả tới nơi thì cả toà nhà đang cháy dữ dội.", "eng": "When the firemen arrived the whole building was blazing."}, {"viet": "Ông muốn tổ chức tiệc khi nào?", "eng": "When would you like your banquet?"}, {"viet": "Tiền thuế ở Nhật Bản được dùng vào đâu?", "eng": "Where does tax money go in Japan?"}, {"viet": "Ông có loại ngoại tệ nào?", "eng": "Which foreign currency do you have?"}, {"viet": "Màu trắng là màu hỗn hợp của tất cả các màu sắc có trong cầu vồng.", "eng": "White is a mixture of all the colors in the rainbow."}, {"viet": "Cô ả tôi thấy đi cùng anh tối hôm qua là ai thế?", "eng": "Who was that bird I saw you with last nigh?"}, {"viet": "Tại sao chúng ta không đổi đề tài nhỉ?", "eng": "Why don't we change the subject?"}, {"viet": "Món này chuẩn bị có lâu không?", "eng": "Will this take long to prepare?"}, {"viet": "Gió thổi dồn cát thành từng đồi, hay đụn cát.", "eng": "Winds pile up the sand into hills, or dunes."}, {"viet": "Trong khoảng đất này, có một dãy những cung điện nguy nga tráng lệ của nhà Minh và nhà Thanh, nổi bật với những cây cột đỏ và mái ngói màu vàng.", "eng": "Within the area, there is a row of magnificent Ming and Qing palaces, characterized by red pillars and yellow tiles."}, {"viet": "Bà Brown, bà có muốn một tách trà không?", "eng": "Would you care for a cup of tea, Mrs. Brown?"}, {"viet": "Ông có muốn tính nó vào hóa đơn tiền khách sạn của ông không?", "eng": "Would you like to put it on your hotel bill?"}, {"viet": "Chà, đây quả là một nơi đẹp đấy.", "eng": "Wow, this is really a nice place."}, {"viet": "Phải, tôi hiểu, nhưng tôi vẫn cảm thấy hơi ngài ngại.", "eng": "Yes, I know, but it still makes me a little uncomfortable."}, {"viet": "Anh nên hỏi ý kiến một lần nữa thì hơn trước khi để cho người đó nhổ hết răng của anh.", "eng": "You'd better get a second opinion before you let that man take out all your teeth."}, {"viet": "Bạn sẽ không bao giờ đạt được sự thành công với thái độ đó.", "eng": "You'll never get anywhere with that attitude."}, {"viet": "Chắc chắn là em đã trang trí tuyệt đẹp nhà bếp.", "eng": "You've certainly made an excellent job of the kitchen."}, {"viet": "Trong những vấn đề về sở thích, không thể võ đoán được.", "eng": "You can't be dogmatic in matters of taste."}, {"viet": "Ông có thể đòi bồi hoàn lại tiền cho những ngân phiếu bị mất.", "eng": "You can claim refund of the lost cheques."}, {"viet": "Anh không thể tách các hành động của Chính phủ với những chính sách làm cơ sở cho những hành động đó.", "eng": "You cannot dissociate the Government's actions from the policies which underlie them."}, {"viet": "Cậu đưa phần này của chiếc vé cho người kiểm soát và giữ lấy phần kia.", "eng": "You give this portion of the ticket to the inspector and keep the other."}, {"viet": "Anh biết đấy, tôi cũng cho là vậy.", "eng": "You know, I've been thinking."}, {"viet": "Có lẽ ông nên gửi nó theo loại Ấn phẩm.", "eng": "You might send it as Printed Matter."}, {"viet": "Bạn không được lái xe lên phố có biển đề'Cấm vào'.", "eng": "You mustn't drive up a street with a No Entry, sign."}, {"viet": "Bạn nên đề nghị ngay, trực tiếp đến hoặc bằng thư.", "eng": "You should apply immediately, in person or by letter."}, {"viet": "Anh không nên nói về mọi người sau lưng họ.", "eng": "You shouldn't talk about people behind their backs."}, {"viet": "Anh sẽ phải trả tiền họ, anh không có một sự lựa chọn nào.", "eng": "You will have to pay them, you have no option."}, {"viet": "Rất cám ơn sự hợp tác của bạn.", "eng": "Your cooperation will be appreciated very much."}, {"viet": "Những người gọi là bạn anh sẽ không giúp anh trong khó khăn.", "eng": "Your so called friends won't help you in trouble."}]