[{"viet": "2, 3, 4 và 6 là thừa số của 12.", "eng": "2, 3, 4 and 6 are factors of 12."}, {"viet": "Một máy ảnh có thể trị giá vài đô-la.", "eng": "A camera may cost only a few dollars or it may cost hundreds of dollars."}, {"viet": "Một nhân viên khách sạn đến dọn dẹp phòng, người khách trọ muốn mượn cái bàn ủi và cái bàn để ủi quần áo.", "eng": "A clerk comes to clean the room and the guest wants to borrow an iron and an ironing board."}, {"viet": "Sức mạnh của một đất nước là đường sá và đường sắt của nó.", "eng": "A country's sinews are its roads and railways."}, {"viet": "Bán một căn nhà hấp dẫn ở vùng quê, cho gia đình, kiểu Georgian.", "eng": "A desirable country, family, Georgian, etc residence for sale."}, {"viet": "Sự giảm sút nhu cầu tàu chở dầu đã làm cho hàng ngàn công ăn việc làm trong ngành công nghiệp đóng tàu lâm vào tình trạng nguy ngập.", "eng": "A fall in demand for oil tankers has put thousands of jobs in the ship-building industry in jeopardy."}, {"viet": "Một người trượt tuyết loại cao thủ đầy can đảm.", "eng": "A first class skier with a lot of nerve."}, {"viet": "Một dịp hấp dẫn được toàn thể giới thượng lưu tham dự.", "eng": "A glittering occasion attended by the whole of high-society."}, {"viet": "Một vị khách thanh toán bằng thẻ tín dụng.", "eng": "A guest pays by credit card."}, {"viet": "Một nhà đầy đồ đạc cổ xưa và những đồ trang trí mỹ thuật.", "eng": "A house full of antique furniture and objects d'art."}, {"viet": "Một gia đình đông người cần một căn nhà rộng.", "eng": "A large family needs a large house."}, {"viet": "Ở nhiều vùng, bức tranh về một chiếc máng ăn bé nhỏ có thể thay cho một cây Giáng Sinh.", "eng": "A little manger scene may take the place of a Christmas tree in many lands."}, {"viet": "Một người thiếu khả năng tiên liệu để làm một lãnh đạo.", "eng": "A man who lacks the initiative to be a leader."}, {"viet": "Một tháng đã trôi qua mà công việc không tiến triển.", "eng": "A month has gone by and the work hasn't moved forward at all."}, {"viet": "Một tác phẩm mới của nhà soạn nhạc bản Các con mèo.", "eng": "A new work by the composer of Cats."}, {"viet": "Những cánh đồng trông giống như một tấm vải chắp vá loang lổ nhìn từ trên máy bay.", "eng": "A patchwork of fields seen from an aeroplane."}, {"viet": "Chỗ nào thứ ấy, và thứ nào chỗ ấy.", "eng": "A place for everything, and everything in its place."}, {"viet": "Áp suất 6 pao trên một insơ vuông.", "eng": "A pressure of 6 lb to the square inch."}, {"viet": "Một lời cầu xin khoan hồng hơi thiếu sức thuyết phục.", "eng": "A rather passionless plea for clemency."}, {"viet": "Một căn phòng ngổn ngang những đồ đạc cũ kỹ vô dụng.", "eng": "A room encumbered with old and useless furniture."}, {"viet": "Một bầu trời quang đãng và một vùng biển xanh tươi.", "eng": "A serene sky and a bright blue sea."}, {"viet": "Một cơn gió nhẹ làm lay đông lá cây.", "eng": "A slight breeze moved the leaves of the trees."}, {"viet": "Một bài diễn văn toàn những điều khái quát.", "eng": "A speech full of sweeping generalizations."}, {"viet": "Một sự ập vào bất ngờ bởi các nhân viên thuế.", "eng": "A sudden descent by tax officials."}, {"viet": "Một bản luận án dày đặc những điều trích dẫn từ các nguồn tài liệu khác.", "eng": "A thesis crowded with references to other sources."}, {"viet": "Một vùng rất chậm tiến của quốc gia đó, không có đường sá đàng hoàng và không có điện.", "eng": "A very backward part of the country, with no proper roads and no electricity."}, {"viet": "Một nhà lãnh đạo khôn ngoan biết khoan hồng khi chiến thắng.", "eng": "A wise ruler is generous in victory."}, {"viet": "Gom góp đủ chứng cớ để củng cố thêm cho lời buộc tội của hắn.", "eng": "Accumulate enough evidence to ensure his conviction."}, {"viet": "Những người quảng cáo tranh giành sự chú ý của quần chúng.", "eng": "Advertisers jostling for the public's attention."}, {"viet": "Sau bài diễn văn của ông ta ông ta đã yêu cầu thính giả đặt câu hỏi và phê bình.", "eng": "After his speech he invited questions and comments from the audience."}, {"viet": "Sau khi ly dị, ông ta cố làm cho lũ con chống đối lại mẹ của chúng.", "eng": "After the divorce he tried to turn the children against their mother."}, {"viet": "Ôi thôi, chúng đã bán hết cả rồi, thưa bà.", "eng": "Alas, they've all sold out, madam."}, {"viet": "Được, vậy tôi sẽ nhờ gửi thư bảo đảm.", "eng": "All right, i'll have it registered, then."}, {"viet": "Tất cả thư này phải được trả lời.", "eng": "All this mail must be answered."}, {"viet": "Trẻ em Hoa Kỳ treo bít tất của chúng lên vào trước ngày lễ Giáng Sinh và mong rằng Santo Claus đổ đầy đồ chơi và các món ăn ngon vào đó.", "eng": "American children hang up their stockings on Christmas Eve and hope that Santa Claus will fill them with toys and good things to eat."}, {"viet": "Sự nhận biết giá trị tác phẩm của nhà thơ.", "eng": "An appreciation of the poet's work."}, {"viet": "Một cán bộ điều hành đã bị căng thẳng tinh thần vì khối lượng công việc quá nặng nề.", "eng": "An executive who was pressurized by a heavy workload."}, {"viet": "Một hòn đảo chỉ có chim ở.", "eng": "An island inhabited only by birds."}, {"viet": "Một sự khởi hành không may cho chuyến đi.", "eng": "An unfortunate start to the trip."}, {"viet": "Và bạn không cần phải biết.", "eng": "And you don't have to know."}, {"viet": "Dù sao, tôi cũng vẫn rất thích thành phố đó.", "eng": "Anyway, I still liked the city very much."}, {"viet": "Ở Anh có nhiều chương trình truyền hình giáo dục dành cho trẻ em không?", "eng": "Are there many educational T. V. programs for children in England?"}, {"viet": "Cậu có biết bí mật của cô ta không?", "eng": "Are you in on her secret?"}, {"viet": "Bị lính gác bắt giữ tại đường qua biên giới.", "eng": "Arrested by guards at the border crossing."}, {"viet": "Miễn là cô ta lấy được ý trung nhân.", "eng": "As long as she is going to marry Mr. Right."}, {"viet": "Được hỏi về ngày bầu cử, vị Thủ tướng cho biết là chưa có quyết định.", "eng": "Asked about the date of the election, the Prime Minister commented that no decision had yet been made."}, {"viet": "Cuối cùng chúng tôi thích đi suốt đêm, ngủ từng lúc một.", "eng": "At the end we preferred to travel all night, sleeping in snatches."}, {"viet": "Vi khuẩn sinh sôi trong môi trường có đường.", "eng": "Bacteria growing in a sugar medium."}, {"viet": "Thiếu khả năng, kinh nghiệm, hiểu biết.", "eng": "Be deficient in skill, experience, knowledge."}, {"viet": "Người đẹp thì hay ghen, và hằn học chịu đựng sự có mặt của đối thủ.", "eng": "Beauty is jealous, and illy bears the presence of the rival."}, {"viet": "Ngoài ra, anh có biết mã vùng của nơi này không?", "eng": "Besides, do you know the area code of this place?"}, {"viet": "Đăng ký đi nghỉ mát qua hệ thống thông tin hiển thị dữ liệu.", "eng": "Book a holiday through view data."}, {"viet": "Nước Anh được ủy quyền cai trị đông Phi, nguyên thuộc địa của Đức.", "eng": "Britain was mandated to govern the former colony of German East Africa."}, {"viet": "Nhưng cháu không biết kích cỡ của Mỹ.", "eng": "But I don't know American sizes."}, {"viet": "Nhưng thẳng thắn mà nói, chúng tôi không biết nhiều về món ăn Trung Quốc.", "eng": "But to be frank, we don't know much about Chinese food."}, {"viet": "Vào cuối tháng thì chúng tôi tiến triển nhiều rồi.", "eng": "By the end of the month, we'll be well away."}, {"viet": "Tôi có thể kiểm tra túi nhỏ này ở đâu không?", "eng": "Can I check this small bag somewhere?"}, {"viet": "Chúng tôi có thể lái thử nó được không?", "eng": "Can we give it a test drive?"}, {"viet": "Anh có thể dọn cái kệ đó để có chỗ đặt thêm sách được không?", "eng": "Can you make room on that shelf for more books?"}, {"viet": "Anh có thể xoay xở để chúng tôi được vé miễn phí không?", "eng": "Can you work it so that we get free tickets?"}, {"viet": "Được, các ngày thứ ba và thứ sáu là những ngày thu rác.", "eng": "Certainly, Tuesdays and Fridays are garbage days."}, {"viet": "Những trẻ em thiếu sự an toàn của một nơi ở tốt.", "eng": "Children who lack the security of a good home."}, {"viet": "Thả xe xuống dốc đồi để tiết kiệm xăng.", "eng": "Coast down a hill to save petrol."}, {"viet": "So với ngôi nhà của chúng ta thì nhà của họ là một lâu đài tráng lệ.", "eng": "Compared to ours their house is a palace."}, {"viet": "Dựng mô hình tháp Eiffel theo tỷ lệ.", "eng": "Construct a scale model of the Eiffel Tower."}, {"viet": "Anh trả lại cây bút mực cho tôi có được không?", "eng": "Could you give me my pen back?"}, {"viet": "Vươn cổ ra phía trước để nhìn cho rõ hơn.", "eng": "Crane forward in order to get a better view."}, {"viet": "Khiêu vũ đã không còn có gì thú vị đối với nàng nữa.", "eng": "Dancing has lost all its enchantment for her."}, {"viet": "Phủ nhận quyền dự họp của ai.", "eng": "Deny somebody the right of assembly."}, {"viet": "Cô ta có nói là cô ta ghét anh không?", "eng": "Did she say she hated you?"}, {"viet": "Anh không làm gì nữa sao?", "eng": "Didn't you do anything else?"}, {"viet": "Tôi có phát hiện ra một chút gì mai mỉa không nhỉ?", "eng": "Do I detect a tinge of irony?"}, {"viet": "Con có luôn luôn viết bằng tay trái không?", "eng": "Do you always write left-handed?"}, {"viet": "Bạn có nghề tay trái không?", "eng": "Do you have a second job?"}, {"viet": "Cô có biết cách sử dụng máy ảnh đó không?", "eng": "Do you know how to work that camera?"}, {"viet": "Cô có thích đế thấp không?", "eng": "Do you prefer a low heel?"}, {"viet": "Bố có nghĩ là chúng ta có thể đón được quả bóng home run không?", "eng": "Do you think we can catch a home run ball?"}, {"viet": "Cô ta có nhiều kinh nghiệm giảng dạy hay không?", "eng": "Does she have much experience of teaching?"}, {"viet": "Đừng có cuống lên mà mua cái nhà đó.", "eng": "Don't be stampeded into buying the house."}, {"viet": "Đừng đi-tôi có thể cần anh.", "eng": "Don't go-I may need you."}, {"viet": "Đừng quá tin tưởng vào những điều mà báo chí nói.", "eng": "Don't put too much confidence in what the papers say."}, {"viet": "Đừng dùng cánh cửa này cho đến khi sơn khô.", "eng": "Don't use this door until the paint is dry."}, {"viet": "Rượu và đồ nhắm sẽ được dọn ra.", "eng": "Drinks and nibbles will be served."}, {"viet": "Sinh nhai bằng nghề viết văn.", "eng": "Earn one's living from writing."}, {"viet": "Hưởng thành quả lao động của ai.", "eng": "Enjoy the fruits of one's labours."}, {"viet": "Mọi người tại cuộc họp đều mang băng đỏ để ủng hộ.", "eng": "Every one at the rally wore red ribbons as favours."}, {"viet": "Xin lỗi, tôi tin rằng ông là ông John Green ở công ty Paciffic.", "eng": "Excuse me, I believe you are Mr. John Green of the Pacific Company."}, {"viet": "Những nhà máy chỉ sử dụng lao động cực nhọc ăn lương ít.", "eng": "Factories that employ only slave labour."}, {"viet": "Cảm thấy xấu hổ vì đã nói dối.", "eng": "Feel shame at having told a lie."}, {"viet": "Nhóm lính cứu hỏa đã phải phá cửa để tới cứu những người bị kẹt trong đó.", "eng": "Firemen had to break the door down to reach the people trapped inside."}, {"viet": "Bay từ London đến Paris mỗi ngày hai lần.", "eng": "Fly between London and Paris twice daily."}, {"viet": "Đây là lần thứ bao nhiêu rồi tôi nói với anh là tôi không biết!", "eng": "For the umpteenth time, I tell you I don't know!"}, {"viet": "Từ đỉnh phẳng và rộng của nó, chúng ta có thể nhìn bao quát.", "eng": "From its flat and vast top, we can have a wide view."}, {"viet": "Địa chất học, hay là khoa học nghiên cứu vỏ quả đất.", "eng": "Geology, or the science of the earth's crust."}, {"viet": "Hãy cho tôi biết sơ qua về kế hoạch của ông.", "eng": "Give me a rough idea of your plans."}, {"viet": "Tiếp nào, kể cho tôi nghe họ đã nói gì.", "eng": "Go on, be a devil-tell me what they said."}, {"viet": "Mài cà rốt thành những miếng nhỏ.", "eng": "Grate the carrot into small pieces."}, {"viet": "Thành công của cô ta phần lớn là nhờ làm việc chăm chỉ.", "eng": "Hard work has a lot to do with her success."}, {"viet": "Bạn còn chuyện gì phải làm nữa không?", "eng": "Have you anything else to do?"}, {"viet": "Hộ chiếu của cậu đã có dấu nào chưa?", "eng": "Have you got any stamps in your passport?"}, {"viet": "Nhờ nói chuyện với những nhân chứng, bây giờ tôi đã có những ý niệm đúng đắn hơn về câu chuyện xảy ra.", "eng": "Having talked to the witnesses I now have a better idea of what happened."}, {"viet": "Anh ấy bao giờ cũng thận trọng để thực hiện công việc đúng như quy định.", "eng": "He's always careful to do things by the book."}, {"viet": "Ngay cả lúc thuận lợi nhất ông ta còn là một con người khó tính bình thường không thể chịu nổi.", "eng": "He's difficult at the best of times usually he's impossible."}, {"viet": "Anh ta có vợ nhưng lại lén lút có thêm một cô bồ.", "eng": "He's married but he has a girl-friend on the side."}, {"viet": "Anh ta là giáo viên giỏi nhất mặc dù có ít kinh nghiệm nhất.", "eng": "He's the best teacher even though he has the least experience."}, {"viet": "Hắn luôn làm những gì mẹ dặn.", "eng": "He always does what his ma tells him to."}, {"viet": "Anh ta nhiều lần nài nỉ nàng dừng lại.", "eng": "He begged her repeatedly to stop."}, {"viet": "Nó đi tới gần tôi và hỏi giờ.", "eng": "He came up to me and asked the time."}, {"viet": "Trong một cơn chán nản nó đã tự tử.", "eng": "He committed suicide during a fit of depression."}, {"viet": "Anh ấy cố ý vắng mặt không đi họp.", "eng": "He deliberately absented himself from the meeting."}, {"viet": "Nó chẳng đếm xỉa gì đến ai.", "eng": "He doesn't give a fuck about anyone else."}, {"viet": "Nó hy vọng đi máy bay với vé hạng nhất-toàn bộ.", "eng": "He expects first-class air travel-the lot."}, {"viet": "Hắn ta nịnh hót cô ta một cách trắng trợn, vậy mà cô ấy lại cả tin.", "eng": "He flatters her outrageously, and she swallows it whole."}, {"viet": "Anh ấy hồi hộp khi leo núi.", "eng": "He gets his thrills from rock-climbing."}, {"viet": "Ông ta nguyên là quan toàn quyền của một nước được Anh bảo hộ.", "eng": "He had been Governor of a British Protectorate."}, {"viet": "Hiện thời ông ta có rất nhiều mối lo về chuyện tài chính.", "eng": "He has a lot of financial worries at the moment."}, {"viet": "Ông ấy sống một cuộc đời yên ổn ở vùng quê.", "eng": "He has led a sheltered life in the country side."}, {"viet": "Ông ta ghét phí phạm thời gian vào những chi tiết không quan trọng.", "eng": "He hates wasting time on unimportant details."}, {"viet": "Ông ta phản đối gay gắt việc sử dụng vũ khí hạt nhân.", "eng": "He is bitterly opposed to nuclear weapons."}, {"viet": "Cậu ta thông minh nhất lớp.", "eng": "He is the brightest child in the class."}, {"viet": "Anh ta biết tất cả các chi tiết nhỏ về hài kịch và bi kịch.", "eng": "He knew all niceties of the sock and buskin."}, {"viet": "Anh ta sống ở nơi khỉ ho cò gáy.", "eng": "He lives way out in the boondocks."}, {"viet": "Ông ta nói bóng gió tới sự thiếu kinh nghiệm của nàng.", "eng": "He made oblique references to her lack of experience."}, {"viet": "Anh ta chẳng hề mó tay vào việc nhà-vợ anh ta làm hết mọi thứ.", "eng": "He never does a hand's turn around the house-his wife does everything."}, {"viet": "Hắn biểu diễn màn ảo thuật đó rành rành trước mắt toàn thể khán giả.", "eng": "He performed the trick in full view of the whole audience."}, {"viet": "Anh ta cầu hôn và nàng đã nhận lời anh ta.", "eng": "He proposed marriage and she accepted him."}, {"viet": "Nó đọc đi đọc lại bức thư.", "eng": "He read the letter through and through."}, {"viet": "Anh ta kính trọng khoa học nhưng không phải nịnh bợ nó.", "eng": "He respected science without adulating it."}, {"viet": "Anh ta là một người rất khó làm vừa lòng.", "eng": "He's a very hard man to please."}, {"viet": "Anh ấy hơi ngớ ngẩn một tí hơi.", "eng": "He's gone a bit daft in the head."}, {"viet": "Anh ta không đáng tin cậy lắm, dù vậy tôi vẫn thích anh ta.", "eng": "He's not very reliable, but I like him all the same."}, {"viet": "Nó nói nó sẽ trả, nhưng trên thực tế nó chẳng có xu nào.", "eng": "He said he would pay, but in point of fact he has no money."}, {"viet": "Ông ấy dường như có tài tiên tri.", "eng": "He seemed to have the gift of prophecy."}, {"viet": "Nó tỏ ra chẳng quan tâm gì đến việc đời chung quanh nó.", "eng": "He showed no interest in the world around him."}, {"viet": "Anh ấy để cả buổi chiều học tập.", "eng": "He spent the entire afternoon in study."}, {"viet": "Anh ấy khom người dưới cái xà thấp.", "eng": "He stooped under the low beam."}, {"viet": "Ông ta có quan điểm là người ta phải chịu trách nhiệm về các hành động của chính mình.", "eng": "He takes the view that people should be responsible for their own actions."}, {"viet": "Anh ta bước một bước về phía cửa.", "eng": "He took a step towards the door."}, {"viet": "Anh ta cố gắng gạt bỏ tất cả những ý nghĩ về cô ấy ra khỏi tâm trí mình.", "eng": "He tried to shut all thoughts of her out of his mind."}, {"viet": "Ông ta đi rảo bước, quay tròn cái gậy của mình trong không khí.", "eng": "He walked along briskly, twirling his cane in the air."}, {"viet": "Nó được phép đi chơi nhưng cha mẹ nó ra điều kiện nó phải về nhà trước nửa đêm.", "eng": "He was allowed to go out, but his parents made it a condition that he should get home before midnight."}, {"viet": "Nó được chứng nhận là mất trí và đưa đi bệnh viện tâm thần.", "eng": "He was certified and sent to mental hospital."}, {"viet": "Nó được miễn truy tố vì thật sự là nó quá trẻ.", "eng": "He was exempt from charges by virtue of the fact that he was so young."}, {"viet": "Anh ta bị đâm vào bụng sau một cuộc loạn đả ở thành phố.", "eng": "He was knifed in the stomach during a street fight."}, {"viet": "Anh ta đã bị phạt vì chơi xấu đối với bên tấn công, thí dụ bên tấn công được hưởng một quả đá phạt trực tiếp.", "eng": "He was penalized for a foul on the striker."}, {"viet": "Hắn bị cảnh sát phát hiện khi đang lên máy bay đi Pari.", "eng": "He was spotted by police boarding a plane for Paris."}, {"viet": "Ông ta rất ân cần với bà lão và làm mọi việc cho bà.", "eng": "He was very attentive to the old lady and did everything for her."}, {"viet": "Chàng thầm thì những lời âu yếm bên tai nàng.", "eng": "He whispered endearments in her ear."}, {"viet": "Anh ta sẽ kinh ngạc vì không nhìn thấy các con lợn ủi rác trong những vũng bùn ngoài đường phố.", "eng": "He would be surprised not to see pigs rooting for garbage in the mud in the streets."}, {"viet": "Máy bay lên thẳng ném đồ tiếp tế cho dân làng lâm nạn.", "eng": "Helicopters dropped supplies for the stranded villagers."}, {"viet": "Hành vi của cô ta tối qua hoàn toàn không phù hợp với tính cách của cô ấy.", "eng": "Her behaviour last night was quite out of character."}, {"viet": "Cái chết của cô ta xảy đến như là một cú sốc mạnh đối với chúng tôi.", "eng": "Her death came as a terrible shock to us."}, {"viet": "Cha cô ta cho cô ta lựa chọn giữa việc học tiếp lên đại học hoặc bắt đầu đi làm.", "eng": "Her father gave her the alternative of going on to college or starting to work."}, {"viet": "Những hy vọng của bà ta lại được sum họp với gia đình.", "eng": "Her hopes of reuniting with her family."}, {"viet": "Đôi môi của nàng mọng như những quả anh đào chín.", "eng": "Her lips were ripe as cherries."}, {"viet": "Những lầm lỗi của chính cô ấy đã làm cho cô ấy rất dễ tha thứ đối với ( các sai lầm của ) người khác.", "eng": "Her own mistakes made her very tolerant towards ( the faults of ) others."}, {"viet": "Công trình nghiên cứu của cô ta phát hiện vài sự kiện lý thú.", "eng": "Her research has thrown up some interesting facts."}, {"viet": "Quần áo mùa hè của cô ấy không bảo vệ cô ấy chống lại cái rét.", "eng": "Her summer clothes gave her no protection against the cold."}, {"viet": "Đây là năm tờ mười đô la, bốn tờ năm đô la và mười tờ một đô la.", "eng": "Here are five ten-dollar bills, four five-dollar bills and ten one-dollar bills."}, {"viet": "Lời tường thuật của anh ta về việc anh ta bị cho hít thuốc mê, bị bắt cóc và bị tra tấn hoàn toàn là được bịa đặt ra.", "eng": "His account of being drugged, kidnapped and tortured was made up of whole cloth."}, {"viet": "Hành vi của nó có thể giải thích được nếu xét rằng gần đây nó đau ốm.", "eng": "His behaviour is explicable in the light of his recent illness."}, {"viet": "Sự tin cậy hoàn toàn của ông ta vào những đồng nghiệp của mình.", "eng": "His complete reliance on his colleagues."}, {"viet": "Sự nhiệt tình của anh ta làm cho mọi người khác phải để ý.", "eng": "His enthusiasm made everyone else interested."}, {"viet": "Bước đầu tiên tham gia vào chính trường của anh ta đã không thành công.", "eng": "His first sortie into politics was unsuccessful."}, {"viet": "Thói quen lười biếng báo hiệu một tương lai ảm đạm cho anh ta.", "eng": "His idle habits bode ill for his future."}, {"viet": "Sự đau ốm kéo dài đã làm ông ta suy yếu.", "eng": "His long illness had pulled him down."}, {"viet": "Danh hiệu chính thức của ông ta là Thanh tra Tài chính.", "eng": "His official designation is Financial Controller."}, {"viet": "Những lời hứa của hắn chỉ toàn là chuyện vô nghĩa.", "eng": "His promises were so just much meaningless talk."}, {"viet": "Số lượng ít ỏi của anh ta được tăng thêm do số tiền hoa hồng.", "eng": "His small salary is augmented by a commission."}, {"viet": "Thành tích ba phút hai giây của hắn vẫn chưa bị hạ.", "eng": "His time of 3 min 2 sec remains unbeaten."}, {"viet": "Tác phẩm của ông ấy phải được lưu giữ cho hậu thế.", "eng": "His work must be preserved for posterity."}, {"viet": "Danh dự đòi hỏi ông phải từ chức.", "eng": "Honour demands that he should resign."}, {"viet": "Anh có quan hệ như thế nào với các bạn đồng nghiệp?", "eng": "How are you making out with your colleagues?"}, {"viet": "Buổi liên hoan đã diễn ra như thế nào?''Rất tốt, xin cám ơn'.", "eng": "How did the party turn out?''It turned out very well, thanks'."}, {"viet": "Làm thế nào cô ấy có dáng vẻ như thế nhỉ?", "eng": "How does she look like that?"}, {"viet": "Sẽ mất bao lâu để gửi tiền đi New York bằng điện chuyển tiền?", "eng": "How long will it take to remit money to New York by telegraphic transfer?"}, {"viet": "Ở Mỹ có bao nhiêu đội bóng rổ chuyên nghiệp?", "eng": "How many professional basketball teams do you have in the States?"}, {"viet": "Anh cần bao nhiêu tiền?''50 pao chắc là đủ cho lúc này?'.", "eng": "How much money do you need?''50 pounds should be enough to be going on with?'."}, {"viet": "Tuy nhiên, chúng tôi vẫn chưa nhận được hàng.", "eng": "However, they have not reached us yet."}, {"viet": "Tôi vừa thức dậy và vẫn còn ngái ngủ.", "eng": "I'd just woken up and was still drowsy."}, {"viet": "Tôi không đời nào cho phép con tôi làm điều đó.", "eng": "I'd never dream of allowing my child to do that."}, {"viet": "Tôi sẽ đến thăm cô ấy, chỉ khi anh cũng đi.", "eng": "I'll go to see her, provided you come too."}, {"viet": "Tôi sẽ chỉ cho anh chỗ cất đồ phụ tùng.", "eng": "I'll show you where the spares are kept."}, {"viet": "Tôi e rằng hôm nay ông giám đốc không có ở văn phòng.", "eng": "I'm afraid the manager isn't in today."}, {"viet": "Sáng nay tôi sẽ đi phố, anh có muốn tôi mua cho anh thứ gì không?", "eng": "I'm going into town this morning, do you want me to get you anything?"}, {"viet": "Tôi sẽ gặp thiếu tá Amenian tại câu lạc bộ phi công lúc bốn giờ.", "eng": "I'm meeting Major Armenian in the pilots'lounge at four o'clock."}, {"viet": "Tôi hài lòng thấy bạn đã thực hiện một sự khởi đầu thuận lợi như vậy cho học kỳ mới.", "eng": "I'm pleased that you've made such an auspicious start to the new term."}, {"viet": "Tôi vẫn còn mười lăm ngày nghỉ phép.", "eng": "I'm still due fifteen day's holiday."}, {"viet": "Lúc này tôi rất bận, hãy chờ cho đến khi công việc bớt đi một chút.", "eng": "I'm very busy just now, wait until things have eased up a little."}, {"viet": "Tôi đã chạy khắp nơi ( trong thành phố ) suốt sáng để tìm mua quà Nôen.", "eng": "I've been running around ( town ) all morning looking for Christmas presents."}, {"viet": "Tôi có hai vé đi xem trận chung kết Cúp.", "eng": "I've got two tickets for the Cup Final."}, {"viet": "Tôi mới đến thành phố này hai ngày thôi, nên thật sự là tôi chưa biết hết đường đi.", "eng": "I've only been in this city two days, so I really don't know my way around yet."}, {"viet": "Tôi thừa nhận rằng anh có lý của anh.", "eng": "I admit that you have a point."}, {"viet": "Tôi sinh ra là người Pháp và qua hôn nhân, là một người dân của nước Anh.", "eng": "I am French by birth and a British subject by marriage."}, {"viet": "Tôi cám ơn ông về đơn đặt hàng kiểu mẫu 16.", "eng": "I appreciate your order for model 16."}, {"viet": "Tôi chắc sẽ có rất nhiều băng trên những con đường nhỏ chưa rải cát hoặc muối.", "eng": "I bet there'll be lots of ice on the minor roads where the griters haven't been."}, {"viet": "Tôi không thể về hưu làm công chúng thất vọng.", "eng": "I can't disappoint my public by retiring."}, {"viet": "Tôi không thể không cần đến anh ấy ngày hôm nay-chúng ta cần có mọi người ở đây.", "eng": "I can't spare him today-we need everybody here."}, {"viet": "Tôi chỉ có thể suy đoán rằng anh ấy tự nguyện ra đi.", "eng": "I can only speculate that he left willingly."}, {"viet": "Tôi không thể chấp nhận những phương pháp của anh được.", "eng": "I can't sanction your methods."}, {"viet": "Tôi không thể không thừa nhận rằng anh ta đúng còn tôi thì sai.", "eng": "I could not but admit that he was right and I was wrong."}, {"viet": "Tôi muốn đổi tiền yên ra đô la.", "eng": "I'd like to change yen to dollars."}, {"viet": "Tôi không nói thật đâu, tôi chỉ đùa thôi.", "eng": "I didn't mean that seriously-i was only joking."}, {"viet": "Tôi không nghi ngờ gì về tính chân thật trong bản báo cáo của anh.", "eng": "I don't doubt the veracity of your report."}, {"viet": "Tôi không ưa ôpêra, nhạc thính phòng hợp với sở thích của tôi hơn.", "eng": "I don't like opera, chamber music is more my style."}, {"viet": "Tôi không hiểu vấn đề đó là gì.", "eng": "I don't understand what the problem is."}, {"viet": "Tôi không rõ, có phải \"chỉ mới hôm qua\".", "eng": "I don't know about \"just yesterday\"."}, {"viet": "Tôi thích thú mọi cuốn tiểu thuyết của ông ấy chỉ trừ cuốn mới đây.", "eng": "I enjoyed all his novels with the exception of his last."}, {"viet": "Tôi hơi miễn cưỡng báo tin đó cho cô ấy.", "eng": "I felt a certain reluctance to tell her the news."}, {"viet": "Tôi thấy khu vườn Anh xung quanh tôi.", "eng": "I found an English garden all about me."}, {"viet": "Tôi buộc phải gia nhập đội bóng khi người cầu thủ cừ nhất của họ bị thương.", "eng": "I got conscripted into the team when their top player was injured."}, {"viet": "Tôi có một cuộc phỏng vấn, nhưng tôi đã quên đến dự.", "eng": "I had an interview, but I forgot to show up."}, {"viet": "Tôi ghét bị trói buộc bởi những qui tắc và luật lệ vụn vặt.", "eng": "I hate being fettered by petty rules and regulations."}, {"viet": "A ha, rốt cuộc tôi đã tìm được việc làm!", "eng": "I have found it-a job at last!"}, {"viet": "Tôi có vài câu hỏi về công việc mà anh giao cho tôi.", "eng": "I have several queries about the work you gave me."}, {"viet": "Trước đây tôi không nghe thấy thành ngữ đó-nó mới được đặt ra hay sao?", "eng": "I haven't heard that expression before-is it recent coinage?"}, {"viet": "Mình nghe nói bệnh cảm của bạn ấy trở nặng hơn và hiện giờ bạn ấy đang nằm viện.", "eng": "I heard that her cold got worse and now she's in the hospital."}, {"viet": "Tôi hi vọng anh mãn nguyện với điều anh làm.", "eng": "I hope you're satisfied with what you did."}, {"viet": "Tôi để một quyển từ điển bên cạnh lúc chơi ô chữ.", "eng": "I kept a dictionary beside me when I'm doing crosswords."}, {"viet": "Tôi để tiền thanh toán và tiền boa của anh trên bàn đấy.", "eng": "I left the payment and your tips on the table."}, {"viet": "Khi tôi còn là một cậu bé, tôi sống ở cái làng này.", "eng": "I lived in this village when I was a boy."}, {"viet": "Tôi sẽ yêu cầu mỗi người mang theo một món.", "eng": "I'll have everyone bring one dish."}, {"viet": "Tôi tìm chiếc đồng hồ của tôi ở khắp nơi nhưng tôi không tìm thấy.", "eng": "I looked everywhere for my watch, but I couldn't find it."}, {"viet": "Tôi đang quen dần với thức ăn ở đây.", "eng": "I'm getting used to the food here."}, {"viet": "Tôi không mong muốn thay đổi cả thế giới đâu!", "eng": "I'm not out to change the world!"}, {"viet": "Tôi đang cố liên lạc với John.", "eng": "I'm trying to reach John, please."}, {"viet": "Tôi phải đăng báo để tìm một thư ký mới.", "eng": "I must advertise for a new secretary."}, {"viet": "Tôi cần kiếm một cái áo hợp với cái quần này.", "eng": "I need a top to wear with these trousers."}, {"viet": "Tôi ngỏ ý giúp đỡ và cô ta nhận với vẻ biết ơn.", "eng": "I offered help, and she accepted gratefully."}, {"viet": "Tôi thích chơi ten-nít ở ngoài trời.", "eng": "I prefer to play tennis outdoors."}, {"viet": "Tôi thấy thương cảm cho cô ta khi chồng cô ta chết.", "eng": "I really felt for her when her husband died."}, {"viet": "Tôi bực mình vì mỗi việc tôi làm đều phải xin phép anh ta.", "eng": "I resent having to get his permission for everything."}, {"viet": "Tôi xem nó là điềm báo của những sự việc bất lành sẽ xảy đến.", "eng": "I see it as a portent of things to come."}, {"viet": "Tôi cần phải thận trọng tìm hiểu hãng này trước khi ngài ký kết điều gì.", "eng": "I should make a few discreet enquires about the firm before you sign anything."}, {"viet": "Tôi đã nhiệt tình khuyên anh ấy đừng chọn con đường đó.", "eng": "I strongly advised him not to take that path."}, {"viet": "Tôi nghĩ là anh ta sống ở đó nhưng tôi không thể nói chắc được.", "eng": "I think he lives there but I couldn't say for sure."}, {"viet": "Tôi nghĩ giá đó cũng ở Mỹ.", "eng": "I think that's about the same as in the US."}, {"viet": "Tôi nghĩ là hôm nay trời ấm áp hơn đấy chứ.", "eng": "I thought it was supposed to get warmer today."}, {"viet": "Tôi đã tìm cách giúi cho nó lời ghi chép khi thầy giáo đang nhìn đi chỗ khác.", "eng": "I tried to slip the note to him while the teacher wasn't looking."}, {"viet": "Tôi đã quen biết gia đình đó nhiều năm rồi.", "eng": "I've known the family for years."}, {"viet": "Cô biết đấy, tôi muốn đến Quảng trường Washington.", "eng": "I want to go to Washington Square, you see."}, {"viet": "Là một đứa trẻ sinh ra trong quân đội và đã học ở bảy trường khác nhau trước khi học xong trung học.", "eng": "I was an army brat and went to seven different school before I got out of high school."}, {"viet": "Tôi bị thúc ép phải đi đến một quyết định vội vã.", "eng": "I was hustled into making a hasty decision."}, {"viet": "Tôi giận dữ đến nỗi không tự chủ được và đã đánh nó.", "eng": "I was so furious I couldn't control myself, and I hit him."}, {"viet": "Tôi không biết nội dung bí mật của cuộc đàm phán.", "eng": "I wasn't privy to the negotiations."}, {"viet": "Ước gì tôi biết được cái gì sắp xảy ra.", "eng": "I wish I knew what was going to happen."}, {"viet": "Tôi không biết ông có thể cùng ăn tối với chúng tôi tối nay tại nhà hàng King hay không.", "eng": "I wonder if you could join us for dinner this evening at King's Restaurant."}, {"viet": "Tôi muốn đặt trước một phòng cho bữa tiệc tối nay.", "eng": "I would like to book a room for a party this evening."}, {"viet": "Tôi không hy vọng là thời tiết sẽ đẹp.", "eng": "I wouldn't gamble the weather being fine."}, {"viet": "Nếu đội Anh có thể loại Richards thì họ có thể thắng được trận đấu.", "eng": "If England can get Richards out, they might win the match."}, {"viet": "Nếu sẽ là một buổi liên hoan om sòm thì anh có thể coi như không có tôi.", "eng": "If it's going to be a rowdy party, you can count me out."}, {"viet": "Nếu quả thật có thiên đường trên trái đất thì nó là đây!", "eng": "If there's a heaven on earth, this is it!"}, {"viet": "Nếu bạn đi trên con đường ít ánh sáng vào ban đêm, bạn phải bận quần áo dễ thấy.", "eng": "If you're walking along a badly-lit road at night you should wear conspicuous clothes."}, {"viet": "Nếu ông không trả tiền hơi đốt sớm, ông có thể bị ngưng cung cấp đấy.", "eng": "If you don't pay your gas bill soon you may be cut off."}, {"viet": "Nếu ông gọi điện cho thư ký của tôi cô ta sẽ định ngày giờ hẹn gặp ông.", "eng": "If you phoned my secretary she'd give you an appointment."}, {"viet": "Nếu bạn muốn bất cứ cuốn sách nào của tôi, hãy cho tôi biết nhé.", "eng": "If you would like to borrow any of my books, please let me know."}, {"viet": "Tôi chịu trách nhiệm trước ban giám đốc về kỉ luật của văn phòng.", "eng": "In answerable to the directors for office discipline."}, {"viet": "Trong cuốn sách mới của cô ta, cô ta dấn thân vào lĩnh vực siêu nhiên.", "eng": "In her new book she ventures into the super-natural."}, {"viet": "Ở La Mã phần lớn công việc sao chép này do các nô lệ thực hiện.", "eng": "In Roman times slaves did most of this copying."}, {"viet": "Trong cuộc Đại chiến, binh sĩ được coi là có thể bị hy sinh.", "eng": "In the Great War soldiers were considered expendable."}, {"viet": "Sau cuộc đua chúng tôi phải mất vài phút để nhịp thở bình thường trở lại.", "eng": "In took us a few minutes to get our breath after the race."}, {"viet": "Sự khủng bố quốc tế không phải là một hiện tượng lạ lùng mới đây.", "eng": "International terrorism is not just a recent phenomenon."}, {"viet": "Cô ấy là công nhân trong một tổ chức hay là công nhân tự do?", "eng": "Is she an inhouse worker or a freelance?"}, {"viet": "Có đủ chỗ cho tôi trên ô tô không?", "eng": "Is there enough room for me in the car?"}, {"viet": "Thật là một điều mâu thuẫn khi yêu thương súc vật mà lại mặc áo lông thú.", "eng": "It's a contradiction to love animals and yet wear furs."}, {"viet": "Ở đây tối mò mò: bật đèn lên.", "eng": "It's awfully dark in here: put the light on."}, {"viet": "Trong công nghiệp ô tô đang có cạnh tranh mạnh mẽ.", "eng": "It's getting very competitive in the car industry."}, {"viet": "Nó mới được trang hoàng, hơn nữa nó được trang bị đầy đủ và rộng rãi.", "eng": "It's newly decorated, and it's well-equipped and spacious."}, {"viet": "Có thể là nó đã không nhận được thư.", "eng": "It's possible that he hasn't received the letter."}, {"viet": "Đã đến lúc anh nên nghe đôi điều sự thật chua xót về bản thân.", "eng": "It's time you listened to a few home truths about yourself."}, {"viet": "Ngẫu nhiên hôm đó tàu chậm.", "eng": "It chanced that the train was late that day."}, {"viet": "Nhiều người có quan niệm sai cho rằng tất cả những người Scotlen đều là bủn xỉn.", "eng": "It is a popular misconception that all Scotsmen are mean."}, {"viet": "Còn lâu mới có chuyện là mức thất nghiệp sẽ giảm xuống.", "eng": "It is most improbable that the level of unemployment will fall."}, {"viet": "Chế tạo ô tô với số lượng ít như vậy sẽ không có lãi.", "eng": "It isn't cost-effective to build cars in such small quantities."}, {"viet": "Nó đòi hỏi phải có chìa khóa của bà và chìa khóa của ngân hàng để mở hộp.", "eng": "It requires your key and the bank's key to open a box."}, {"viet": "Vợ chồng ông thật tử tế vì cả hai đã đến đây.", "eng": "It's so nice of you both to come."}, {"viet": "Tôi đột nhiên dần dần nhận ra là tôi đã đi nhầm tàu.", "eng": "It suddenly gradually dawned on me that I'd caught the wrong train."}, {"viet": "Đó là một lỗi nhỏ, nhưng cô ấy mất điểm và trượt.", "eng": "It was a trivial mistake, but she lost marks and failed to qualify."}, {"viet": "Ông ta đã sai lầm là lại trả nợ thay cho con gái.", "eng": "It was misguided of him to pay his daughter's debts again."}, {"viet": "Anh thật là rộng rãi đã cho họ mượn chiếc ô tô mới của anh để họ đi nghỉ.", "eng": "It was very generous of you to lend them your new car for their holiday."}, {"viet": "Nói cám ơn chỉ là sự lịch sự thông thường.", "eng": "It would only have been common courtesy to say thank you."}, {"viet": "John cực kỳ thích vạch ra những lỗi lầm của người khác.", "eng": "John's extremely fond of pointing out other people's mistakes."}, {"viet": "Hãy nghe nó kìa! Nó tưởng nó là ai thế?", "eng": "Just hark at him! Who does he think he is?"}, {"viet": "Năm ngoái bệnh viện đã điều trị cho hơn bốn mươi trường hợp sốt rét.", "eng": "Last year the hospital treated over forty cases of malaria."}, {"viet": "Để tôi chỉ cho anh xem một số áo quần.", "eng": "Let me show you some of the clothing."}, {"viet": "Los Angeles là một thành phố náo nhiệt.", "eng": "Los Angeles is an exciting city."}, {"viet": "Nhiều người thích đi thăm các thác nước trong khu vực.", "eng": "Many people like to visit the waterfalls in the area."}, {"viet": "Mary bạo dạn một cách đáng ngạc nhiên đối với một cô gái hình như còn trẻ như vậy.", "eng": "Mary was surprisingly bold for a girl who seemed so young."}, {"viet": "Bây giờ cho phép tôi nhận món quý khách gọi nhé?", "eng": "May I take your order now?"}, {"viet": "Hầu hết trẻ con biết đi trước khi biết nói.", "eng": "Most children are able to walk before they are able to talk."}, {"viet": "Thưa ông Smith, ông Vương sẽ tiếp ông ngay.", "eng": "Mr. Smith, Mr. Wang will be with you in a minute."}, {"viet": "Anh tôi và tôi trông giống nhau quá đến nỗi người ta tưởng chúng tôi là anh em sinh đôi.", "eng": "My brother and I look so alike that people often think we are twins."}, {"viet": "Bản năng đầu tiên của tôi là từ chối nhưng về sau tôi đã xem xét lại.", "eng": "My first instinct was to refuse, but later I reconsidered."}, {"viet": "Tôi là Dianna Hope và hộ chiếu của tôi đây.", "eng": "My name is Dianna Hope and here is my passport."}, {"viet": "Tôi sơ ý làm cắt ngang câu chuyện giữa hai người.", "eng": "My unwitting interruption of their private conversation."}, {"viet": "Tân binh có ba giờ luyện tập quân sự mỗi ngày.", "eng": "New recruits have three hours of drill a day."}, {"viet": "Không, với tôi vậy là được rồi.", "eng": "No, it is all right for me."}, {"viet": "Thảo nào mà cô khiêu vũ giỏi như vậy.", "eng": "No wonder you are so skilful."}, {"viet": "Bây giờ chúng tôi gặp hầu hết những người chỉ muốn ngắm nhìn thôi.", "eng": "Now we have mostly people who just want to look."}, {"viet": "Ồ, tôi cho điều đó tuyệt đấy.", "eng": "Oh, I suppose that it would be nice."}, {"viet": "Người già muốn được độc lập.", "eng": "Old people want to keep their independence."}, {"viet": "Người ta có thể cảm thấy sự kích động rộn ràng trong đám đông.", "eng": "One could feel the excitement pulsing through the crowd."}, {"viet": "Hết thành phố này thì sang đến thành phố khác, và giữa hai thành phố có một con đường.", "eng": "One town ends where the next begins and there's a road that runs between."}, {"viet": "Nỗ lực của chúng ta được hướng vào việc đạt một trình độ sản xuất cao hơn.", "eng": "Our effort is geared to a higher level of production."}, {"viet": "Đội bóng nữ quốc gia của chúng tôi khá kiên cường.", "eng": "Our National Women's Team is pretty tough."}, {"viet": "Quân của chúng ta đã chọc thủng phòng tuyến của địch.", "eng": "Our troops have penetrated through the enemy's lines."}, {"viet": "Những người làm công tác Đảng đã bắt đầu một cuộc vận động để thu nhận đảng viên mới.", "eng": "Party workers sallied forth in a drive to find new members."}, {"viet": "Khán giả tụ tập ở sân vận động để xem trận chung kết crickê.", "eng": "People thronged the stadium to watch the finals of the cricket match."}, {"viet": "Làm ơn cử người đến dọn vệ sinh phòng.", "eng": "Please send someone to clean the room."}, {"viet": "Các bộ sách khổ bốn quá lớn nên không thể để vừa kệ này được.", "eng": "Quarto volumes are too large to fit on this shelf."}, {"viet": "Các nhà khoa học nghiên cứu sự di trú của loài cá tới những vùng nước xa.", "eng": "Scientists have studied the migration of fish over long distances."}, {"viet": "Chúng ta sẽ gặp nhau ở đây sau bữa ăn tối nhé?", "eng": "Shall we meet here after supper?"}, {"viet": "Bà ta luôn bắt ne bắt nét con cái của bà ta.", "eng": "She's always carping at her children."}, {"viet": "Cô ta thấy khó mà tiến bộ được trong một doanh nghiệp do đàn ông chiếm ưu thế.", "eng": "She's finding it hard to make her way in a business dominated by men."}, {"viet": "Cô ta không giàu như người ta nói.", "eng": "She's not as rich as people make her out to be."}, {"viet": "Cô ta trở nên mảnh khảnh kể từ khi cô ta ăn kiêng.", "eng": "She's thinned down a lot since she went on a diet."}, {"viet": "Chị ấy luôn tỏ ra tốt bụng đối với trẻ con và súc vật.", "eng": "She always shows kindness to children and animals."}, {"viet": "Cô ta tới cuộc họp với ý định thầm kín là giành được quyền kiểm soát ngân sách.", "eng": "She came to the meeting with a hidden agenda to gain control of the budget."}, {"viet": "Cô ta không thể nào chấp nhận toàn bộ thái độ mê tín thuốc tây được.", "eng": "She couldn't accept the whole drug-culture bit."}, {"viet": "Cô ta không thiếu sự giúp đỡ từ bạn bè.", "eng": "She didn't want for help from her friends."}, {"viet": "Bà ta đã ngất đi nhưng rượu mạnh đã nhanh chóng làm bà tỉnh lại.", "eng": "She fainted but the brandy soon revived her."}, {"viet": "Cô ấy rùng mình khi nhìn thấy con rắn.", "eng": "She gave a shudder when she saw the snake."}, {"viet": "Cô ta có nhiều điều thiếu sót cần phải bù vào thời gian vắng mặt.", "eng": "She had a lot of leeway to make up water her absence."}, {"viet": "Bà ấy có một người giúp việc giặt áo quần.", "eng": "She has a helper to wash the clothes."}, {"viet": "Cô ta có vẻ duyên dáng tự nhiên của một vũ công bẩm sinh.", "eng": "She has the natural grace of born dancer."}, {"viet": "Có thể là cô ta biết các khó khăn chứ?", "eng": "She is aware of the difficulties, presumably?"}, {"viet": "Cứ mỗi lần gặp cô ta, tôi lại thấy cô ta bận một chiếc áo khác.", "eng": "She is wearing a different dress every time I see her."}, {"viet": "Cô ấy nghe bài giảng của giáo viên với vẻ chăm chú.", "eng": "She listened to the teacher's lesson with an intent expression."}, {"viet": "Chị ấy tự đưa ra những gợi ý.", "eng": "She made the suggestions off her own bat."}, {"viet": "Cô ấy chỉ mặc như thế vì ấn tượng mà nó tạo ra.", "eng": "She only dresses like that for the effect it creates."}, {"viet": "Cô ấy hứa với em trai là sẽ viết thư cho nó.", "eng": "She promised her brother that she would write to him."}, {"viet": "Bà ta vẫn giữ lại được kí ức rõ ràng về vụ đó.", "eng": "She retains a clear memory of the incident."}, {"viet": "Cô ta bị lấy cắp mất cái ví.", "eng": "She's had her wallet taken."}, {"viet": "Cô ấy nói cô ấy là người trượt tuyết lão luyện nhưng tôi nghĩ cô ấy chỉ nói bốc.", "eng": "She said she was an expert skier but I think she was just shooting a line."}, {"viet": "Tháng nào cô ấy cũng dành riêng ra một ít tiền.", "eng": "She sets aside a bit of money every month."}, {"viet": "Cô ấy nói tiếng địa phương chứ không phải tiếng Anh tiêu chuẩn.", "eng": "She speaks a dialect, not the Queen's English."}, {"viet": "Cô ấy sống sót sau tai nạn, nhưng cô ấy bị tàn tật suốt đời và sẽ không bao giờ đi lại được nữa.", "eng": "She survived the accident but she was maimed for life and will never walk again."}, {"viet": "Bà ta lao xuống cầu thang, chạy bổ ra ngoài nhà kêu to lên'Cháy!'.", "eng": "She tore downstairs and out of the house shouting'Fire!'."}, {"viet": "Cô ấy muốn bánh ngọt, tốt nhất là bánh kem sôcôla.", "eng": "She wanted a cake, preferably one with chocolate icing."}, {"viet": "Cô ta đã được tặng thưởng một bằng khen về tài chơi đàn pianô.", "eng": "She was awarded a certificate of merit for her piano-playing."}, {"viet": "Cô ta phạm tội tấn công một nhân viên cảnh sát.", "eng": "She was found guilty of assaulting a police officer."}, {"viet": "Cô ta cẩu thả trong công việc của cô ta.", "eng": "She was negligent in her work."}, {"viet": "Cô ta lòng tràn ngập đau buồn chẳng biết làm gì, chỉ biết khóc.", "eng": "She was so overcome with grief could do nothing but weep."}, {"viet": "Cô ta mặc một chiếc áo dài đỏ xinh xắn hợp thời trang.", "eng": "She was wearing a snappy little red number."}, {"viet": "Cô ấy sẽ không bao giờ theo phe của chúng ta đâu.", "eng": "She will never come over to our side."}, {"viet": "Bà ta không phải là người tôi sẽ chọn làm Thủ tướng.", "eng": "She wouldn't be my choice as Prime Minister."}, {"viet": "Tỏ ra sáng suốt trong việc chọn sở thích của mình.", "eng": "Show discrimination in one's choice of hobbies."}, {"viet": "Từ khi bình phục sau lần mổ cô ta trở lại vui sống hơn.", "eng": "Since recovering from her operation, she's had a new lease of life."}, {"viet": "Những đường gợn nhỏ trên bề mặt của tấm kim loại.", "eng": "Slight ripples on the surface of the metal."}, {"viet": "Ngập đầu với đống đơn xin công việc đó.", "eng": "Snowed under with applications for the job."}, {"viet": "Ở đây có bán nước ngọt và nước khoáng.", "eng": "Soft drinks and minerals sold here."}, {"viet": "Một vài cửa hàng địa phương thực sự đã chém đẹp ( túi tiền ) của những người đi nghỉ.", "eng": "Some local shops are really fleecing the holiday-makers ( of their money )."}, {"viet": "Một số chính khách rất nổi tiếng về tài hùng biện của họ.", "eng": "Some politicians are famous for their power of oratory."}, {"viet": "Lẽ ra trước đây phải làm một cái gì đó.", "eng": "Something ought to have been done before now."}, {"viet": "Nói đến quê hương của mình một cách luyến nhớ.", "eng": "Speak longingly of one's native land."}, {"viet": "Tiến hành kiện ai để ly dị.", "eng": "Start proceedings against somebody for divorce."}, {"viet": "Đừng có nói vòng vo nữa mà hãy trả lời thẳng đi!", "eng": "Stop flannelling and give a straight answer!"}, {"viet": "Chết dí ở nhà như thế này cô ta cảm thấy cuộc sống quá đơn điệu.", "eng": "Stuck at home like this, she felt like a vegetable."}, {"viet": "Những vấn đề như vậy vượt quá sự hiểu biết của con người.", "eng": "Such matters transcend man's knowledge."}, {"viet": "Được chứ, nó cũng có chức năng chụp hình.", "eng": "Sure, it also has a camera."}, {"viet": "Hãy chơi bất cứ môn thể thao nào-bóng rổ, khúc côn cầu trên băng, bơi lội hay bất cứ cái gì tương tự.", "eng": "Take any sport-basketball, ice hockey, swimming or whatever."}, {"viet": "Dạy chó đứng hai chân sau để xin thức ăn.", "eng": "Teach one's dog to beg for its food."}, {"viet": "Chủ nghĩa khủng bố là một mối đe doạ cho cả nước.", "eng": "Terrorism is a threat to the whole country."}, {"viet": "Chính là vì thế!-tôi không thể làm việc được khi anh làm ầm quá như vậy.", "eng": "That's just it!-I can't work when you're making so much noise."}, {"viet": "Thưa ngài, vậy là 10,00 $ ạ", "eng": "That comes to $ 10.00, sir."}, {"viet": "Cú chơi xấu đối với Smith sau cùng đó đã làm chúng tôi thua trận.", "eng": "That last foul against Smith lost us the match."}, {"viet": "Không cần phải có lời nhận xét thô lỗ đó!", "eng": "That rude remark was not called for!"}, {"viet": "Bộ đồng phục đó làm họ trông có vẻ lố bịch.", "eng": "That uniform makes them look absurd."}, {"viet": "Tai nạn làm xe cộ ùn lên hàng mấy khối nhà.", "eng": "The accident backed the traffic up for blocks."}, {"viet": "Phí tổn được tính thêm cho từng kiện hàng rời.", "eng": "The added cost of unitizing bulk products."}, {"viet": "Quốc hội Mỹ tương đương với Nghị viện Anh.", "eng": "The American Congress corresponds to the British Parliament."}, {"viet": "Việc chỉ định vị giám đốc mới đã gây ra nhiều tranh luận.", "eng": "The appointment of the new director aroused a lot of controversy."}, {"viet": "Bài báo thẩm vấn hành vi đạo đức của một số nhà báo người ta cho rằng đã dùng sự đe doạ để được phỏng vấn.", "eng": "The article questions the ethical conduct of certain journalists, who are claimed to have used threats in order to obtain interviews."}, {"viet": "Tác giả mà anh phê bình trong bài điểm sách đã viết thư phúc đáp.", "eng": "The author whom you criticized in your review has written a letter in reply."}, {"viet": "Các phiếu khai nhận hành lý được bấm ghim vào vé mà.", "eng": "The baggage claim are stapled to your ticket."}, {"viet": "Đơn vị cơ bản của nhân dân tệ là đồng và đơn vị phụ là hào và xu.", "eng": "The basic unit of RMB is yuan and the subsidiary units ar jiao and fen."}, {"viet": "Phương án tốt nhất là nên hoàn toàn lờ nó đi.", "eng": "The best plan would be to ignore it completely."}, {"viet": "Dãy nhà này có một người quản gia không cư ngụ tại đây.", "eng": "The block of flats has a nonresident intendant."}, {"viet": "Cuốn sách tôi đang tìm sờ sờ ngay trước mặt tôi.", "eng": "The book I was looking for was staring me in the face."}, {"viet": "Chàng võ sĩ quyền Anh được cứu nhờ tiếng chuông báo kết thúc hiệp đấu.", "eng": "The boxer was saved by the bell."}, {"viet": "Cô dâu mặc y phục trắng.", "eng": "The bride was dressed in white."}, {"viet": "Việc chôn cất diễn ra vào thứ Sáu.", "eng": "The burial took place on Friday."}, {"viet": "Chiếc ca nô bị cuốn trong cơn lốc.", "eng": "The canoe was sucked into the whirlpool."}, {"viet": "Chiếc xe hơi đã hết xăng khi ở cách thành phố ba dặm.", "eng": "The car runs out of gas three miles from the town."}, {"viet": "Tòa lâu đài tọa lạc trong một khung cảnh đẹp như tranh có những ngọn đồi bao quanh.", "eng": "The castle stands in a picturesque setting surrounded by hills."}, {"viet": "Chức chủ tịch ủy ban thay đổi theo thể thức luân phiên.", "eng": "The chairmanship of the committee changes in rotation."}, {"viet": "Đứa bé chạy về phía tôi.", "eng": "The child came running towards me."}, {"viet": "Tất cả bọn trẻ trông đều hồng hào sau kì nghỉ hè.", "eng": "The children all looked in the pink after their holiday."}, {"viet": "Bọn trẻ tranh nhau giành những đồng tiền.", "eng": "The children scrambled for the coins."}, {"viet": "Sự đổ xô nhau đi mua hàng vào dịp Noen Tôi đang vội lắm nên không thể dừng lại được.", "eng": "The Christmas rush I'm in a tearing rush so I can't stop."}, {"viet": "Người leo núi trượt chân và rơi xuống chết.", "eng": "The climber slipped and dropped to his death."}, {"viet": "Sự tan vỡ của các cuộc thương lượng, sự suy sụp sức khoẻ, sự sa sút của luật pháp và trật tự.", "eng": "The collapse of negotiations, sb's health, law and order."}, {"viet": "Vì lợi ích chung mà hai nước chúng ta đoàn kết lại.", "eng": "The common interests that unite our two countries."}, {"viet": "Công ty yêu cầu việc thanh toán phải được thực hiện đúng thời gian.", "eng": "The company required that payment be made on time."}, {"viet": "Những sự gián đoạn không ngớt đã làm cho tôi ngừng tập trung vào công việc của mình.", "eng": "The constant interruptions stopped me settling to my work."}, {"viet": "Những nếp nhà tranh rất hài hoà với cảnh quan.", "eng": "The cottages harmonize well with the landscape."}, {"viet": "Tòa đã phán quyết cô ta có tội.", "eng": "The court adjudged her to be guilty."}, {"viet": "Cây đà ngang được ghép mộng với cây cột thẳng đứng.", "eng": "The cross-piece is mortised into the up right post."}, {"viet": "Những bức màn hoà hợp với tấm thảm.", "eng": "The curtains tone with the carpet."}, {"viet": "Số người chết trong vụ động đất, trên đường giao thông, sau vụ thảm sát.", "eng": "The death-toll in the earthquake, on the roads, after the massacre."}, {"viet": "Rừng rậm châu Phi và Nam Mỹ.", "eng": "The dense jungles of Africa and South America."}, {"viet": "Sự truyền bá kiến thức qua sách báo và các buổi diễn thuyết.", "eng": "The diffusion of knowledge through books and lectures."}, {"viet": "Bến tàu ngưng hoạt động cả tuần lễ vì đình công.", "eng": "The docks were strikebound for a week."}, {"viet": "Tài liệu này đã được đánh máy bằng một máy đánh chữ xách tay nhỏ.", "eng": "The document had been typed on a small portable."}, {"viet": "Mùi vị nổi bật trong một món ăn.", "eng": "The dominant flavour in the dish."}, {"viet": "Người say rượu đập vỡ mọi bàn ghế.", "eng": "The drunken man smashed up an the furniture."}, {"viet": "Khuỷu tay áo len của cô sờn rồi-tôi sẽ phải vá lại.", "eng": "The elbows of your jersey are worn-I'll need to patch them."}, {"viet": "Động cơ kêu xình xịch yếu ớt một lúc rồi tắt.", "eng": "The engine sputtered feebly for a while and then stopped."}, {"viet": "Bằng chứng làm cơ sở cho vụ án của anh ta là vững chắc.", "eng": "The evidence underpinning his case was sound."}, {"viet": "Những khu đất rộng của một ngôi nhà ở nông thôn.", "eng": "The extensive grounds of a country house."}, {"viet": "Người chủ trại đuổi theo những kẻ xâm nhập với một chiếc gậy lớn.", "eng": "The farmer came after the intruders with a big stick."}, {"viet": "Đường ghi tiếng của bộ phim không khớp với hình ảnh.", "eng": "The film's sound-track is out of sync with the picture."}, {"viet": "Đám cháy đã biến căn nhà thành đống tro tàn.", "eng": "The fire reduced the house to ashes."}, {"viet": "Đoạn đầu thế là hay-bây giờ chúng ta phải đợi một tuần nữa để xem đoạn tiếp theo.", "eng": "The first episode was good-now we have to wait a week for the next."}, {"viet": "Sàn đầy những sách vở, giấy và các thứ quần áo.", "eng": "The floor was littered with books, papers and articles of clothing."}, {"viet": "Phần phía trước của đoàn tàu chỉ dành cho hành khách mua vé hạng nhất.", "eng": "The forward part of the train is for first-class passengers only."}, {"viet": "Lời nói liến thoắng líu ríu của các học sinh đang phấn khích có thể nghe thấy từ lớp học.", "eng": "The gabble of excited children could be heard coming from the classroom."}, {"viet": "Vị tướng đó đã bị cách chức lột lon.", "eng": "The general was stripped of his rank."}, {"viet": "Tin vui đó tác động như liều thuốc bổ đối với tất cả chúng tôi.", "eng": "The good news acted as a tonic on us all."}, {"viet": "Chính phủ đã lập ngân sách chi tiêu cho giáo dục là 10.000.000 pao.", "eng": "The government has budgeted 10.000.000 pounds for education spending."}, {"viet": "Chính phủ thành lập ban điều tra nguyên nhân của vụ tai nạn máy bay.", "eng": "The government set up a court of enquiry to investigate the causes of the air disaster."}, {"viet": "Vạn Lý Trường Thành là sự kết tinh về trí tuệ của người Trung Quốc cổ xưa.", "eng": "The Great Wall was the embodiment of the wisdom of the ancient Chinese people."}, {"viet": "Người khách trọ muốn nhờ người đến thu gom quần áo cần giặt ủi của mình.", "eng": "The guest wants to send someone to collect his laundry."}, {"viet": "Việc thay tim sẽ tiến hành ngay khi nào kiếm được người hiến tặng thích hợp.", "eng": "The heart transplant will take place as soon as suitable donor can be found."}, {"viet": "Kỳ nghỉ rất tốn kém nhưng nếu nó làm cho bạn khoẻ ra thì cũng đáng đồng tiền lắm chứ.", "eng": "The holiday will be very expensive but if it helps to make you fit and healthy again it will be cheap at the price."}, {"viet": "Khách sạn có đầy đủ tiện nghi nhất.", "eng": "The hotel provides the utmost in comfort."}, {"viet": "Căn nhà sẽ được đưa ra đấu giá.", "eng": "The house will be sold by auction."}, {"viet": "Những nội dung của luật mới ban hành cần được nghiên cứu.", "eng": "The implications of the new legislation will need to be looked at."}, {"viet": "Sở Thuế Vụ có trách nhiệm thu thuế lợi tức.", "eng": "The Inland Revenue is responsible for collecting income tax."}, {"viet": "Hòn đảo được nối với đất liền bằng một chiếc cầu.", "eng": "The island is joined to the mainland by a bridge."}, {"viet": "Quan toà nhắc nhở nhân chứng rằng bà ta đã thề trước toà.", "eng": "The judge reminded the witness that she was still under oath."}, {"viet": "Các hiệp sĩ đi chiến đấu trên vùng đất thánh nhận thấy rằng lối sống của họ không phải là duy nhất.", "eng": "The knights who went to fight in the Holy Land saw that their way of living was not the only way."}, {"viet": "Đoạn mới nhất trong truyện săn tìm nhà của cô ấy.", "eng": "The latest episode in her house hunting saga."}, {"viet": "Giới luật sư luôn luôn chống lại sự thay đổi.", "eng": "The legal profession have always resisted change."}, {"viet": "Con tàu khách chạy nhanh nhờ thời tiết tốt.", "eng": "The liner made good sea-way because of the fine weather."}, {"viet": "Chiếc xe tải chất đầy những thùng hoa quả.", "eng": "The lorry was ladened with boxes of fruit."}, {"viet": "Những mục chính yếu trong cương lĩnh giải trừ quân bị của họ.", "eng": "The main planks of their disarmament platform."}, {"viet": "Giá hạ ghi ở mặt sau phiếu.", "eng": "The markdown price is on the back of the ticket."}, {"viet": "Phương tiện truyền thông đại chúng phải bị khiển trách về việc gây ra tiếng đồn.", "eng": "The media are to blame for starting the rumours."}, {"viet": "Tác dụng dịu của xà phòng đó.", "eng": "The mild action of the soap."}, {"viet": "Bọn tội phạm cướp phá nhiều cửa hàng trong vùng.", "eng": "The mob looted many shops in the area."}, {"viet": "Nghệ sĩ kịch câm nổi tiếng nhất.", "eng": "The most famous exponent of mime."}, {"viet": "Viện bảo tàng nằm ở ngay đó.", "eng": "The museum is located right there."}, {"viet": "Đạo luật mới đã được thông qua tại Nghị viện thật êm thắm.", "eng": "The new bill had a smooth passage through Parliament."}, {"viet": "Những người hàng xóm mới dọn đến hôm qua.", "eng": "The new neighbours moved in yesterday."}, {"viet": "Tin bà ấy từ chức chẳng bao lâu đã lan truyền khắp nơi.", "eng": "The news of her resignation soon got about."}, {"viet": "Đám thanh niên ồn ào đã bị tống ra khỏi rạp chiếu phim.", "eng": "The noisy youths were ejected from the cinema."}, {"viet": "Y tá và thợ mỏ được tăng lương người 5%, người 7%.", "eng": "The nurses and miners got pay rises of 5% and 7% respectively."}, {"viet": "Cái xích cũ chỉ cần giật mạnh vài cái là bật ra ngay.", "eng": "The old chain only needed a couple of yanks before it snapped."}, {"viet": "Người duy nhất trong văn phòng hút thuốc.", "eng": "The only person in the office who smokes."}, {"viet": "Những nét nổi bật của phong cảnh.", "eng": "The outstanding features of the landscape."}, {"viet": "Sự thiên vị của cha mẹ với con cái của họ.", "eng": "The partiality of parents for their own children."}, {"viet": "Bệnh nhân đó bây giờ đủ khỏe để có thể ngồi dậy được trên giường.", "eng": "The patient is well enough to sit up in bed now."}, {"viet": "Sự hoán vị của x, y và z là xyz, xzy, yxz, yzx, zxy, zyx.", "eng": "The permutations of x, y and z are xyz, xzy, yxz, yzx, zxy, zyx."}, {"viet": "Các mảnh đồ chơi lắp ráp khít vào nhau.", "eng": "The pieces of the puzzle lock into each other."}, {"viet": "Chiếc phi cơ khuất sau một đám mây.", "eng": "The plane disappeared behind a cloud."}, {"viet": "Vở kịch bị các nhà phê bình chỉ trích gay gắt.", "eng": "The play was damned by the reviewers."}, {"viet": "Cảnh sát đã bắt giữ nhầm người.", "eng": "The police arrested the wrong man."}, {"viet": "Cảnh sát bắt những tên tội phạm ở sân bay.", "eng": "The police picked up the criminals at the station."}, {"viet": "Vị chính khách hoàn toàn lúng túng trước những câu hỏi đặt ra cho bà ta.", "eng": "The politician was completely flummoxed by the questions put to her."}, {"viet": "Tài diễn xuất trên sân khấu của ông ấy không thể nào quên được.", "eng": "The power of his stage presence could never be forgotten."}, {"viet": "Ông giám đốc đương nhiên theo chức vụ là uỷ viên tiểu bang.", "eng": "The president is ex officio a member of the committee."}, {"viet": "Tính ưu việt của các giá trị đạo đức, nền quân chủ, vị trí lãnh đạo của Đảng Cộng sản.", "eng": "The primacy of moral values, the monarchy, the Communist Party."}, {"viet": "Những tù nhân lê bước dọc theo hành lang và đi vào xà lim.", "eng": "The prisoners shuffled along the corridor and into their cells."}, {"viet": "Dự án đó tiến triển với mức độ đều đặn.", "eng": "The project went forward at a steady gait."}, {"viet": "Cú đánh trúng vào quai hàm hắn và hắn quị xuống bất tỉnh.", "eng": "The punch caught him on the jaw and he sank down pole-axed."}, {"viet": "Cách nhanh nhất là đi bằng xe lửa, cách tốt nhất tiếp theo là đường bộ.", "eng": "The quickest way is by train, the next best way is to go by road."}, {"viet": "Nguyên nhân thực của cuộc nổi loạn không rõ ràng nhưng duyên cớ là việc bắt giữ hai người đàn ông.", "eng": "The real cause of the riot was unclear, but the occasion was the arrest of two men."}, {"viet": "Nỗ lực cầu toàn liên tục.", "eng": "The relentless striving after perfection."}, {"viet": "Trả lại tài sản, hàng hoá, v. v. bị mất cắp.", "eng": "The restoration of stolen property, goods, etc."}, {"viet": "Biểu đồ thống kê tội ác gia tăng.", "eng": "The rising graph of crime statistics."}, {"viet": "Tảng đá bị nứt dưới áp lực lớn.", "eng": "The rock fractured under the tremendous pressure."}, {"viet": "Những mỏm đá gồ ghề và những đám lá xanh làm cho bức hoạ sinh động thêm.", "eng": "The rugged rocks and green leaves add animation to the painting."}, {"viet": "Những năm tháng của cuộc đời tôi được đếm trên đầu ngón tay.", "eng": "The sands are numbered that make up my life."}, {"viet": "Các nhà khoa học luận ra một phương pháp nhận biết vi khuẩn.", "eng": "The scientists evolved a method of identifying bacteria."}, {"viet": "Câu He is dead and I alive có hiện tượng tỉnh lược, tức là lược từ am.", "eng": "The sentence He is dead and I alive contains ellipsis, ie of the word am."}, {"viet": "Gỗ xà trên thuyền kêu ken két trong cơn bão.", "eng": "The ship's timbers groaned during the storm."}, {"viet": "Cửa hàng đặt 20 cuốn của quyển sách đó và bây giờ không tống khứ đi được.", "eng": "The shop ordered 20 copies of the book and now it can't get rid of them."}, {"viet": "Cô ca sĩ được người chị đệm piano theo.", "eng": "The singer was accompanied at the piano by her sister."}, {"viet": "Khói làm mắt tôi cay xè.", "eng": "The smoke is stinging my eyes."}, {"viet": "Người lính tỏ lòng thương hại người tù và thả anh ta.", "eng": "The solider showed mercy to his prisoner and set him free."}, {"viet": "Khán giả ngồi ở bên ngoài vòng tròn đó.", "eng": "The spectators sit on the outside of that circle."}, {"viet": "Đi bộ từ nhà tôi đến ga mất mười phút.", "eng": "The station is a ten-minute walk from my house."}, {"viet": "Tiếng động lạ tắt dần và một sự yên lặng tuyệt đối bao quanh chúng tôi.", "eng": "The strange noise died away and an absolute silence closed in upon us."}, {"viet": "Sự kết thúc thắng lợi của một cuộc vận động kéo dài.", "eng": "The successful culmination of a long campaign."}, {"viet": "Ký hiệu của nhà thờ trên bản đồ thường là dấu chữ thập.", "eng": "The symbol for a church on a map is usually a cross."}, {"viet": "Thầy giáo giải thích cho chúng tôi cách dùng máy tính.", "eng": "The teacher showed us how to use the computer."}, {"viet": "Sự căng thẳng giữa chúng tôi đã dịu đi chút ít.", "eng": "The tension between us has eased off a little."}, {"viet": "Sự đe doạ trước cuộc tấn công của nước ngoài đã thống nhất chính phủ và các phe đối lập.", "eng": "The threat of a foreign attack united the government and its opponents."}, {"viet": "Khách du lịch hấp dẫn vì ngôi làng cổ xưa.", "eng": "The tourists were attracted to the quaint village."}, {"viet": "Cái bẫy đã cắm sâu vào thịt con thỏ.", "eng": "The trap had cut deeply into the rabbit's flesh."}, {"viet": "Hai quyển sách đều giống nhau chỉ trừ ( cái chuyện ) là quyển này có lời giải đáp ở đằng cuối.", "eng": "The two books are the same except ( for the fact ) that this one has an answer key at the back."}, {"viet": "Sản phẩm, kết quả, kết luận, v. v. cuối cùng.", "eng": "The ultimate outcome, result, conclusion, etc."}, {"viet": "Đường nét lờ mờ của một con tàu trong sương mù.", "eng": "The vague outline of a ship in the fog."}, {"viet": "Vị khách không ai khác là ông tổng thống.", "eng": "The visitor was none other than the President."}, {"viet": "Sóng rất cao, và con thuyền bắt đầu bị tràn nước.", "eng": "The waves were very high, and the boat began to ship water."}, {"viet": "Cả hàng phố đều biết về tai nạn.", "eng": "The whole street knew about the accident."}, {"viet": "Nỗi gian truân của người đàn bà giành được sự cảm thông của chúng tôi.", "eng": "The woman's plight engaged our sympathy."}, {"viet": "Những người bị thương được đặt nằm trong nhà trại.", "eng": "The wounded were bedded in the farmhouse."}, {"viet": "La bàn là những thanh nam châm nhỏ được gắn sao cho chúng có thể xoay quanh trục dễ dàng.", "eng": "Their compasses were small magnets fastened so that they could turn around easily."}, {"viet": "Đối thủ của họ ở cương vị có quyền lực nên chống lại thật là vô ích.", "eng": "Their opponents had the whip hand and it was useless to resist."}, {"viet": "Vậy chúng ta gặp nhau lúc 5 giờ 30 nhé.", "eng": "Then let's meet at 5: 3."}, {"viet": "Nạn buôn lậu qua biên giới ở đây rất nặng nề.", "eng": "There's a lot of smuggling across this frontier."}, {"viet": "Ở vùng lân cận quanh đây không có bưu cục.", "eng": "There's no post office in the immediate neighbourhood."}, {"viet": "Có 26 chữ cái trong bảng chữ cái tiếng Anh.", "eng": "There are 26 letters in the English alphabet."}, {"viet": "Một hoặc hai điều cần phải giải quyết nảy sinh từ báo cáo.", "eng": "There are one or two points to deal with, arising from the report."}, {"viet": "Không có đủ ghế cho cuộc họp-chúng ta cần nhiều gấp rưỡi thế này.", "eng": "There aren't enough chairs for the meeting-we need half as many again."}, {"viet": "Có một nhà để xe xây ở bên cạnh ngôi nhà.", "eng": "There is a garage built onto the side of the house."}, {"viet": "Không có thêm tiền nữa-tôi đã nói rõ chưa nhỉ?", "eng": "There is no more money-do I make myself plain?"}, {"viet": "Ngày xưa, có một nông dân nghèo có bốn người con trai.", "eng": "There once lived a poor farmer who had four sons."}, {"viet": "Cắt nước trong thành phố vì cống chính đang sửa chữa.", "eng": "There was a water cut in the city, as the main sewer was under repairs."}, {"viet": "Có những cuộc mít tinh lớn mà khẩu hiệu là Hãy trả lại cho chúng tôi 11 ngày.", "eng": "There were great meeting at which he cry was, Give us back our 11 days."}, {"viet": "Những ngôi nhà thời cổ đẹp này là một bộ phận của di sản dân tộc của chúng ta.", "eng": "These beautiful old churches are part of our national heritage."}, {"viet": "Những đỉnh núi này là một trong những cảnh đẹp nhất của thiên nhiên.", "eng": "These mountains are one of nature's loveliest sights."}, {"viet": "Họ sẽ tìm ra ai đã làm việc đó, dù anh có nói với họ hay không.", "eng": "They'll find out who did it, whether you tell them or not."}, {"viet": "Họ lại ghi bàn nữa-thế là chúng ta hết hy vọng thắng trận đấu này.", "eng": "They've scored again-there go our chances of winning the match."}, {"viet": "Chúng rất thích hợp cho văn phòng.", "eng": "They are perfect for the office."}, {"viet": "Họ vận động để phụ nữ được nhận vào câu lạc bộ.", "eng": "They campaigned for the admission of women to the club."}, {"viet": "Họ không ngần ngại gì ủng hộ ông ta.", "eng": "They did not waver in their support for him."}, {"viet": "Họ đã tìm ra chất đó sau 4 năm làm việc căng thẳng và đáng nản lòng.", "eng": "They found it, but only after four years of very hard and discouraging work."}, {"viet": "Họ đã nhồi nhét ngữ pháp tiếng Anh vào đầu chúng.", "eng": "They have had English grammar hammered into them."}, {"viet": "Họ sống bấp bênh trên thu nhập từ đôi ba việc đầu tư nhỏ nhoi.", "eng": "They lived precariously on the income from a few small investments."}, {"viet": "Họ có một ngôi nhà tranh ở Xcốtlen một ngôi nhà ở London và có cả một căn hộ dự phòng ở Paris.", "eng": "They own a cottage in Scotland and a house in London as well as a pied-à-terre in Paris."}, {"viet": "Họ yêu cầu được vay tiền ngân hàng.", "eng": "They requested a loan from the bank."}, {"viet": "Họ tốn nhiều thì giờ để bàn luận về những điều huyền bí của cuộc sống.", "eng": "They spent their time philosophizing about the mysteries of life."}, {"viet": "Họ muốn Copernicus viết ra một quyển sách về chúng.", "eng": "They wanted Copernicus to write a book about them."}, {"viet": "Họ buộc phải thề trung thành với người lãnh đạo của họ.", "eng": "They were made to swear allegiance to their leader."}, {"viet": "Họ thắp nến, đặt nến vào mỗi hốc trên vách chùa đá và dán lại bằng giấy trắng.", "eng": "They would light a candle, put it into each of the holes in the bodies of the stone pagoda and seal the holes with white paper."}, {"viet": "Cuốn sách này là tặng phẩm của anh tôi.", "eng": "This book was a present from my brother."}, {"viet": "Về sau nó được cắt ra thành 12 viên kim cương hoàn mỹ.", "eng": "This diamond was later cut into 12 flawless stone."}, {"viet": "Rượu uýt ki nhà làm này có hương vị ngây ngất.", "eng": "This homemade whisky has a real kick to it."}, {"viet": "Đây là mùa đẹp nhất trong năm.", "eng": "This is the best season of the year."}, {"viet": "Cỗ máy này đã được đặc biệt sửa lại cho hợp với việc sử dụng dưới nước.", "eng": "This machine has been specially adapted for use underwater."}, {"viet": "Giấy phép này cho quyền tôi đi lại bằng tàu hoả chỉ mất nửa giá vé.", "eng": "This pass enables me to travel half-price on trains."}, {"viet": "Trường này đặt mục tiêu phân bổ thời gian cho các môn học văn chương và khoa học được cân xứng.", "eng": "This school aims to balance the amount of time spent on arts and science subjects."}, {"viet": "Chuyến đi này là chuyến đi rất quan trọng trong lịch sử khoa học, bởi vì nó đã khiến Darwin viết ra một trong những cuốn sách nổi tiếng nhất trên thế giới có tên là Nguồn Gốc của Muôn Loài.", "eng": "This trip is a very important one in the history of science, for it led Darwin to write one of the world's most famous books, the book is The Origin of Species."}, {"viet": "Though'và'through'không vần với nhau, và cùng không vần với'tough'.", "eng": "Though'and'through'don't rhyme, and neither rhymes with'tough'."}, {"viet": "Bố mẹ Tom tin tưởng cậu ta vì cậu ta biết lẽ phải trái.", "eng": "Tom's parents trust him because he is very sensible."}, {"viet": "Hai năm sau con gái I-rê-ne của họ ra đời.", "eng": "Two years later their daughter Irene was born."}, {"viet": "Tàu chiến tuần tra ở Bắc Đại Tây Dương.", "eng": "Warships were on patrol in the North Atlantic."}, {"viet": "Chúng ta sẽ tiếp tục như đã thoả thuận còn họ thì có thể họ sẽ phá bĩnh.", "eng": "We'll carry on as arranged and they can do their worst."}, {"viet": "Chúng tôi đang chuẩn bị một buổi liên hoan cho sinh nhật của cô ta.", "eng": "We're getting up a party for her birthday."}, {"viet": "Chúng tôi được ghi vào danh sách những người chờ cho chuyến bay ngày mai.", "eng": "We're wait-listed for tomorrow's flight."}, {"viet": "Chúng tôi đã nâng sản xuất lên để đáp ứng nhu cầu.", "eng": "We've scaled up production to meet demand."}, {"viet": "Chúng tôi dự định đi thăm Luân Đôn.", "eng": "We are contemplating a visit to London."}, {"viet": "Chúng tôi đề nghị ông ta bình luận về tình hình quốc tế.", "eng": "We asked him to make a comment on the international situation."}, {"viet": "Không có cô ta chúng tôi vẫn hoàn toàn có thể xoay sở được.", "eng": "We can get on perfectly well without her."}, {"viet": "Chúng ta có thể thấy nó bị kích động như thế nào qua vẻ sôi nổi trên gương mặt nó.", "eng": "We could see how excited he was by the animation in his face."}, {"viet": "Chúng tôi nằm ngủ lăn lóc trên sàn nhà Tony sau cuộc liên hoan.", "eng": "We dossed down on Tony's floor after the party."}, {"viet": "Chúng tôi phát quang đi qua những bụi cây còi cọc.", "eng": "We hacked our way through the undergrowth."}, {"viet": "Chúng ta còn phải đi xa đấy.", "eng": "We have a long way to go."}, {"viet": "Chúng ta có mười cầu thủ, vậy chúng ta cần một cầu thủ nữa để lập thành một đội.", "eng": "We have ten players, so we need one more to make up a team."}, {"viet": "Chúng ta biết là công ty của chúng ta có vấn đề, chúng ta đã giải quyết vấn đề đó bằng sản phẩm mới của chúng ta.", "eng": "We know that our company had a problem, we solved that problem with our new product."}, {"viet": "Chúng tôi gặp nhau cách đây đã lâu.", "eng": "We met a long time ago."}, {"viet": "Chúng ta cần hợp lý hoá các thủ tục sản xuất.", "eng": "We must streamline our production procedures."}, {"viet": "Chúng tôi lên kế hoạch một chuyến bay đủ khách.", "eng": "We plan to have a full flight."}, {"viet": "Chúng tôi ít khi đặt trước khách sạn khi đi du lịch, chúng tôi thường thuận đâu ở đấy.", "eng": "We seldom book hotels when travelling, we usually just take pot luck."}, {"viet": "Chúng tôi dừng lại ở biên giới và xuất trình hộ chiếu.", "eng": "We stopped at the border and showed our passports."}, {"viet": "Chúng tôi muốn đặt hàng mẫu 74.", "eng": "We want to place an order for model 74."}, {"viet": "Chúng tôi bị căn vặn hàng tiếng đồng hồ, cuối cùng họ mới đưa đúng mẫu khai cho chúng tôi.", "eng": "We were pissed around for hours before they finally gave us the right form."}, {"viet": "Giá có đủ chỗ chúng tôi còn có thể đưa thêm những dẫn chứng khác.", "eng": "We would give more examples if we could afford the space."}, {"viet": "Ồ, khi còn trẻ, bố chỉ muốn ăn đúng mức thôi.", "eng": "Well, I just wish I'd eaten right when I was young."}, {"viet": "À, bà có thể đến lấy lại bất kỳ lúc nào.", "eng": "Well, you may come to get it back at any time."}, {"viet": "Mùi dễ chịu quá! Em xức nước hoa đấy à?", "eng": "What a lovely smell! Are you wearing scent?"}, {"viet": "Những ước mơ thời trẻ của chúng ta đâu cả rồi?", "eng": "What became of the dreams of our youth?"}, {"viet": "Bạn muốn cái áo mới thế nào, kẻ sọc hay kẻ ô?", "eng": "What do you want for your new dress, a stripe or a check?"}, {"viet": "Đường lối hành động tốt nhất chúng ta có thể theo là gì?", "eng": "What is the best course of action we can take?"}, {"viet": "Bạn nghĩ gì về tỉ lệ tội phạm ở Mỹ?", "eng": "What is your opinion of the crime rate in the United States?"}, {"viet": "Chi phí trả cho hướng dẫn viên một ngày là bao nhiêu?", "eng": "What's the fee per day for a guide?"}, {"viet": "Anh sẽ sắp xếp như thế nào cho vận chuyển tối nay?", "eng": "What will you do for transport tonight?"}, {"viet": "Khi có nhiều thức ăn, chúng ăn thật nhiều, nhiều hơn nhu cầu của chúng lúc ấy.", "eng": "When food is plentiful, they eat a great deal, much more than they need at the time."}, {"viet": "Lúc nào là thời điểm thích hợp nhất để đến đó?", "eng": "When is a good time to visit?"}, {"viet": "Khi số còn lại của băng cướp đã bị bắt giữ, nó thoát khỏi được hình phạt bằng cách cung cấp bằng chứng chống lại bọn đó.", "eng": "When the rest of the gang were arrested, he saved his own skin by giving evidence against them."}, {"viet": "Khi anh đã bỏ ra ngần ấy tiền cho một bữa ăn, ắt phải nghĩ là nó sẽ tuyệt hảo.", "eng": "When you pay that much for a meal you expect the best."}, {"viet": "Dịch vụ quản lý đồ bị thất lạc nằm ở đâu?", "eng": "Where is the lost and found?"}, {"viet": "Các dược sĩ dùng hệ đo lường nào?", "eng": "Which measure of weight do pharmacists use?"}, {"viet": "Cô gái đứng sau lưng Richard là ai thế?", "eng": "Who's the girl standing behind Richard?"}, {"viet": "Cho dù những người kia là ai, tôi cũng không muốn gặp họ.", "eng": "Whoever those people are, I don't want to see them."}, {"viet": "Sao lại cho phép những người đó tuỳ ý vào địa điểm vậy?", "eng": "Why give these people licence to enter the place at will?"}, {"viet": "Em đổi sang kênh khác đi, em yêu?", "eng": "Will you change the channel, honey?"}, {"viet": "Với tất cả lòng tôn kính, thưa ngài, tôi không đồng ý.", "eng": "With ( all due ) respect, sir, I disagree."}, {"viet": "Những người phụ nữ dẫn đầu cuộc vận động đòi quyền bình đẳng.", "eng": "Women leading the agitation for equal rights."}, {"viet": "Anh làm ơn giữ hộ cái này một lát?", "eng": "Would you kindly hold this for a moment?"}, {"viet": "Anh cảm phiền đến khách sạn xem thử họ có thể giữ phòng cho Paul không nhé?", "eng": "Would you mind going to the hotel to see if they can reserve a room for Paul?"}, {"viet": "Hãy viết bài tập này ở cuối sách.", "eng": "Write this exercise at the back of your book."}, {"viet": "Có, trong các bức điện tín gửi ra nước ngoài, địa chỉ cũng bị tính tiền.", "eng": "Yes, in overseas cables the address is also charged."}, {"viet": "Cậu sẽ được ghi vào sổ đen của sếp, nếu cậu không làm việc tích cực hơn.", "eng": "You'll be in the boss's bad books if you don't work harder."}, {"viet": "Anh đã đến đúng vào lúc cần có mặt.", "eng": "You're arrived at exactly the right moment."}, {"viet": "Cậu đã để cho săm xì hết hơi.", "eng": "You've let all the air out of the tyres."}, {"viet": "Anh không thể trông chờ tôi dọn nhà ngay tức khắc được.", "eng": "You can't expect me to move my home at the drop of a hat."}, {"viet": "Cháu có thể lấy nước ngọt ở trong tủ lạnh đấy.", "eng": "You can get a soft drink from the refrigerator."}, {"viet": "Anh có thể bị thương vì cái hàng rào dây thép gai đó!", "eng": "You could do yourself a mischief on that barbed-wire fence!"}, {"viet": "Anh lầm rồi, người phụ nữ đó là em gái tôi, không phải vợ tôi.", "eng": "You have been misinformed, the woman was my sister, not my wife."}, {"viet": "Ông biết thành phố này đang có vấn đề, nên ông phải biết lí do chứ.", "eng": "You know this city is in trouble, and you know why."}, {"viet": "Chắc là ông đã nhầm tôi với người em sinh đôi của tôi.", "eng": "You must be muddling me up with my twin brother."}, {"viet": "Anh cần phải tập luyện nhiều trước khi có thể chơi cho đội chúng ta.", "eng": "You need more practice before you can play for our team."}, {"viet": "Anh nên khuyến khích cô ấy trong ý định trở thành bác sĩ chứ không nên có thái độ tiêu cực như vậy.", "eng": "You should encourage her in her attempts to become a doctor, instead of being so negative about it."}, {"viet": "Anh mở rađiô bằng cách ấn cái nút này.", "eng": "You switch the radio on by pressing this button."}, {"viet": "Cô không thể thành một ca sĩ tốt nếu cô không thực tập nhiều hơn.", "eng": "You won't come a good singer if you don't practise more."}, {"viet": "Gương mặt anh nhắc nhở lại bà mẹ anh.", "eng": "Your face is reminiscent of your mother."}, {"viet": "Điều bối rối đối với anh là anh đã đặt các ưu tiên của anh lộn ngược!", "eng": "Your trouble is you've got your priorities back to front!"}]