[{"viet": "20 xu là tiền vé xe buýt thấp nhất.", "eng": "20p is the minimum fare on buses."}, {"viet": "Một chiếc ôtô rẽ tốt ở các góc đường.", "eng": "A car that steers well on corners."}, {"viet": "Một nhà chính trị khôn ngoan biết cách chi phối công luận.", "eng": "A clever politician who knows how to manipulate public opinion."}, {"viet": "Một cặp vợ chồng dẫn hai đứa con đi vào quán rượu.", "eng": "A couple with two children enter the bar."}, {"viet": "Một cuốn nhật ký chứa đựng những mẩu thông tin hữu ích.", "eng": "A diary containing gobbets of useful information."}, {"viet": "Một gia đình sống bằng tiền trợ cấp cho người nghèo.", "eng": "A family living on supplementary benefit."}, {"viet": "Một lá cờ có hai hình cái chìa khoá chéo nhau.", "eng": "A flag with a design of two crossed keys."}, {"viet": "Một diễn viên múa ba-lê tài năng phải bắt đầu tập múa khi con rất trẻ.", "eng": "A good ballet dancer must begin to learn dancing when he is very young."}, {"viet": "Hướng dẫn viên đưa khách đi tham quan khắp viện bào tàng.", "eng": "A guide conducted the visitors round the museum."}, {"viet": "Một ngôi nhà nằm trên một sườn đồi có cây cối rậm rạp.", "eng": "A house set on a wooded hillside."}, {"viet": "Một số lớn sách vừa bị đánh cắp ở thư viện.", "eng": "A large number of books have been stolen from the library."}, {"viet": "Một cộng đồng nghệ sĩ năng động, hoạt động với tính cách gây phấn chấn trong xã hội.", "eng": "A lively artistic community, acting as the leaven in society."}, {"viet": "Một người có thái độ quá tỉ mỉ và chi ly.", "eng": "A man with a very prim and precise manner."}, {"viet": "Tâm trạng chủ bại đã lan rộng trong toàn quân.", "eng": "A mood of defeat permeated the whole army."}, {"viet": "Bài phóng sự điều tra đăng trên báo về các điều kiện trong bệnh viện đã khiến người dân đòi hỏi phải có những cải thiện.", "eng": "A newspaper probe into hospital conditions has led the public to ask for improvements."}, {"viet": "Một thỏa thuận về lương bổng kèm với những điều bảo đảm về việc làm.", "eng": "A pay deal with built-in guarantees of employment."}, {"viet": "Một kế hoạch sản xuất năng lượng từ phế liệu.", "eng": "A plan to produce energy from waste material."}, {"viet": "Một cái áo đầm cổ trắng đứng đắn.", "eng": "A prim little dress with a white collar."}, {"viet": "Một sự khác biệt rõ rệt giữa thiên tài và sự điên khùng.", "eng": "A razor-edge of difference between genius and madness."}, {"viet": "Một dãy số năm trên bảng đen.", "eng": "A row of fives on the blackboard."}, {"viet": "Một loạt các bức họa in về đời sống ở Luân Đôn.", "eng": "A series of prints of London life."}, {"viet": "Một đạo quân nhỏ của Anh nằm trong lực lượng gìn giữ hòa bình của Liên Hiệp Quốc.", "eng": "A small British contingent in the U. N peace-keeping force."}, {"viet": "Một tinh thần thiện chí trong các quan hệ quốc tế.", "eng": "A spirit of goodwill in international relations."}, {"viet": "Một lượng nhiên liệu đủ cho mùa đông.", "eng": "A sufficiency of fuel for the winter."}, {"viet": "Một ngàn bảng Anh thì không là gì đối với một người giàu có.", "eng": "A thousand pounds is nothing to a rich man."}, {"viet": "Một cụ già 80 được giữ gìn sức khỏe tốt.", "eng": "A very well-preserved man of eighty."}, {"viet": "Một phụ nữ có nét mặt dữ tợn.", "eng": "A woman with a fierce countenance."}, {"viet": "Bị tố cáo không tuân thủ hiệp định cấm thử nghiệm.", "eng": "Accused of non-observance of the test-ban agreement."}, {"viet": "Phi châu ở xa Anh quốc hơn là Pháp.", "eng": "Africa is further from England than from France."}, {"viet": "Sau khi tôi bị thương ở lưng, tôi chỉ có thể nhấc những đồ vật nhẹ thôi.", "eng": "After I hurt my back, I was only able to pick up light objects."}, {"viet": "Sau khi hạ màn kết thúc chúng tôi tới hậu trường.", "eng": "After the final curtain we went backstage."}, {"viet": "Alexander thích câu trả lời này.", "eng": "Alexander liked this answer."}, {"viet": "Được rồi, cô có thể dùng thịt bò chín kỹ nếu muốn.", "eng": "All right, you can have it well-done, if you wish."}, {"viet": "Tất cả các khách du lịch đều phải xuất trình giấy phép trước khi vào tòa nhà.", "eng": "All visitors must show their passes before entering the building."}, {"viet": "Trong số những nhà soạn kịch Anh, ít ai phủ nhận rằng Shakespeare là người có ảnh hưởng lớn nhất.", "eng": "Among English playwrights, few would deny that Shakespeare holds sway."}, {"viet": "Một lập luận dựa vào một giả thiết sai lầm.", "eng": "An argument resting on a false assumption."}, {"viet": "Một món tiền chi tiêu 500 bảng Anh về đồ đạc mới.", "eng": "An expenditure of £ 500 on new furniture."}, {"viet": "Một làng ít người biết tới ở vùng quê.", "eng": "An obscure village in the country."}, {"viet": "Một cuộc hưởng ứng thống nhất đối với lời kêu gọi gây quỹ.", "eng": "An united response to the appeal for funds."}, {"viet": "Cơn giận dâng lên trong lòng hắn.", "eng": "Anger was welling up in him."}, {"viet": "Ngoài món ăn cay ra, chúng tôi còn có món ăn chua ngọt, món ăn có vị thanh đạm và món ăn có nhiều mùi vị.", "eng": "Apart from hot food, we have sweet and sour food, light taste food and multi-flavoured food."}, {"viet": "Có nhiều công ty có vốn đầu tư mạo hiểm ở nước bạn phải không?", "eng": "Are there many venture capital firms in your country?"}, {"viet": "Bạn có thích tập Judo không?", "eng": "Are you interested in practicing judo?"}, {"viet": "Cái đít là từ thô tục để chỉ cặp mông.", "eng": "Arse is a vulgarism for the buttocks."}, {"viet": "Người ta càng già đi thì càng bảo thủ.", "eng": "As people get older they become more set in their ways."}, {"viet": "Những nhạc công có tham vọng phải luyện tập nhiều giờ một ngày.", "eng": "Aspiring musicians must practise many hours a day."}, {"viet": "Lúc anh gọi thì tôi đang ở trong nhà kho trong vườn.", "eng": "At the moment you called I was in the garden shed."}, {"viet": "Đóng tiền bảo chứng 500 bảng Anh cho việc cam kết của ai.", "eng": "Bail in one's own recognizance of £ 500."}, {"viet": "Hoang mang về tin tức đó.", "eng": "Be filled with dismay at the news."}, {"viet": "Vì bị thương Jones đúng là một điều bất lợi cho cả đội.", "eng": "Because of his injury Jones was just a liability to the team."}, {"viet": "Ngoài ra, chúng tôi không có phương tiện hâm nóng nó.", "eng": "Besides, we don't have the facilities for heating it."}, {"viet": "Những vụ rắc rối ở biên giới mở màn cho một cuộc chiến toàn diện.", "eng": "Border incidents that were curtain-raiser to a full-scale war."}, {"viet": "Nói chung, tôi đồng ý với anh.", "eng": "Broadly speaking, I agree with you."}, {"viet": "Nhưng tôi đã chờ khoảng 20 phút rồi.", "eng": "But I have already waited for about twenty minutes."}, {"viet": "Nhưng chúng tôi có sẵn một phòng cao cấp, có một phòng khách và một phòng bếp nhỏ.", "eng": "But we happen to have a suite available, with a living room and a kitchenette."}, {"viet": "Vào lúc chúng tôi về đến nhà.", "eng": "By the time we reached home."}, {"viet": "Tôi có thể liên lạc lại với bà vào thứ 6 này để trả lời không?", "eng": "Can I get'back to you with an answer this Friday?"}, {"viet": "Liệu chúng ta có thể đối phó lại tất cả những lời phản đối của họ không?", "eng": "Can we meet all their objections?"}, {"viet": "Bạn có thể nêu tên vài ngân hàng lớn và đáng tin cậy ở Úc được không?", "eng": "Can you name some big and reliable banks in Australia?"}, {"viet": "Các thí sinh phải ngồi nguyên tại chỗ của mình cho đến khi tất cả bài thi được thu xong.", "eng": "Candidates shall remain in their seats until all the papers have been collected."}, {"viet": "Thách thức vị trí tối cao của Nhật Bản trong lĩnh vực điện tử.", "eng": "Challenging Japan's supremacy in the field of electronics."}, {"viet": "Thức ăn Trung Quốc nổi tiếng khắp thế giới.", "eng": "Chinese food is well-known to the world."}, {"viet": "Tiền kim loại thường được nhận biết bằng kích cỡ, nhưng đồng 10 xu thì nhỏ hơn cả đồng 5 xu lẫn đồng 1 xu, và vì thế dễ nhầm, và đồng 25 xu cũng dễ bị nhầm là đồng 5 xu và thường được dùng để cho tiền boa, để bỏ vào những chiếc máy hoạt động khi bỏ tiền.", "eng": "Coins are generally recognized by their size, but a dime is smaller than either a nickel or a penny, and is therefore easily mistaken for them, and a quarter can also be easily mistaken for a nickel and is frequently used for tipping, for some coin operate."}, {"viet": "Những đơn khiếu nại về tiêu chuẩn phục vụ cần phải được gửi tới ông chủ.", "eng": "Complaints about standards of service should be addressed to the proprietor."}, {"viet": "Việc học tập của tất cả sinh viên được đánh giá liên tục.", "eng": "Continuous assessment is made of all students'work."}, {"viet": "Bạn có thể đi đến đó thay ông Jones không?", "eng": "Could you go there instead of Mr. Jones?"}, {"viet": "Những người nhẹ dạ tin vào những gì các mục quảng cáo nêu ra.", "eng": "Credulous people who believe what the advertisements say."}, {"viet": "Em yêu, tối nay thấy em anh muốn hôn quá.", "eng": "Darling, you look so kissable tonight."}, {"viet": "Những nhận xét mang tính gièm pha về một thành tựu lớn lao.", "eng": "Depreciatory remarks about a great achievement."}, {"viet": "Tổng thống có nói nhiều với bạn không?", "eng": "Did the President say much to you?"}, {"viet": "Những cách diễn tả khác nhau một lời nói trong vở Hamlet.", "eng": "Different readings of a speech in Hamlet."}, {"viet": "Tôi có được sự quan tâm hoàn toàn của anh không?", "eng": "Do I have your unreserved attention?"}, {"viet": "Cậu có tin sự bất tử của linh hồn hay không?", "eng": "Do you believe in the immortality of the soul?"}, {"viet": "Ông có tài khoản ở ngân hàng chúng tôi không?", "eng": "Do you have an account with us?"}, {"viet": "Anh có biết cách nào làm một người ngưng ngáy không?", "eng": "Do you know of any way to stop a person snoring?"}, {"viet": "Bạn thích ăn mặc bình thường hay ăn mặc trang trọng hơn?", "eng": "Do you prefer to dress casual or business like?"}, {"viet": "Liệu anh có thể khéo léo dàn xếp chuyện đó được không?", "eng": "Do you think you can wangle it?"}, {"viet": "Thằng bé có biết bảng chữ cái không?", "eng": "Does the boy know his ABC?"}, {"viet": "Đừng có tin tất cả những điều tầm phào mà anh đã nghe.", "eng": "Don't believe all the gossip you hear."}, {"viet": "Đừng có dùng quá nhiều nước sốt như vậy!", "eng": "Don't go so heavy on the sauce!"}, {"viet": "Đừng chạy xe đạp trên vỉa hè.", "eng": "Don't ride your bicycle on the pavement."}, {"viet": "Đừng để mình cáu giận về một chuyện gì đó quá tầm thường như vậy.", "eng": "Don't work yourself up about something so trivial."}, {"viet": "Lái xe trong cơn bão tuyết thật là một sự kinh hoàng.", "eng": "Driving during the blizzard was a nightmare."}, {"viet": "Ăn thêm nhiều trái cây đi; nó sẽ có lợi cho em.", "eng": "Eat more fruit; it will do you good."}, {"viet": "Thực phẩm vừa đủ cho chúng ta trong ba ngày.", "eng": "Enough food to last us three days."}, {"viet": "Vào dịp lễ Giáng sinh hàng năm, sự lái xe say rượu thường gây ra tổn thất của nó.", "eng": "Every year at Christmas drunken driving takes its toll."}, {"viet": "Xin lỗi, tôi muốn Martin xem thức ăn đó.", "eng": "Excuse me, I want Martin to see the food."}, {"viet": "Không trả lời được một câu hỏi.", "eng": "Fail to reply to a question."}, {"viet": "Cảm thấy không yên ổn trong môi trường mới của mình.", "eng": "Feel unsettled in one's new surroundings."}, {"viet": "Trước tiên, sau khi đến khách sạn, tôi không thể làm thủ tục nhận phòng vì người khách trọ trước chưa trả phòng.", "eng": "First, after I arrived at your hotel I couldn't check into my room because the previous guest hadn't checked out."}, {"viet": "Gấp đôi lá thư lại trước khi cho vào phong bì.", "eng": "Fold the letter in two before putting it in the envelope."}, {"viet": "Vẹt một lối đi qua đám đông.", "eng": "Force a passage through the crowd."}, {"viet": "Nhìn từ trên đỉnh toàn cảnh của vùng núi Alps thật hùng vĩ.", "eng": "From the summit there is a superb panorama of the Alps."}, {"viet": "Được một bản nhận xét công tác tốt của ông chủ mình.", "eng": "Get a good report from one's boss."}, {"viet": "Xin ông vui lòng cho tôi vài quả cà chua đừng quá chín.", "eng": "Give me tomatoes that aren't too ripe."}, {"viet": "Đi bắt trộm thú trên đất của một chủ trại.", "eng": "Go out poaching on a farmer's land."}, {"viet": "Hy Lạp, cội nguồn của văn hóa Tây phương.", "eng": "Greece, the cradle of Western culture."}, {"viet": "Chỉ trích một lúc đề nghị đó.", "eng": "Harrumphed for a while over the proposal."}, {"viet": "Anh có từng dự lễ hội powwow không, Martin?", "eng": "Have you been to a powwow, Martin?"}, {"viet": "Cậu có thì giờ để gọi điện cho ông ta hay không?", "eng": "Have you got time to phone him?"}, {"viet": "Có bạn ở đây chắc chắn là có ích rồi.", "eng": "Having you around sure comes in handy."}, {"viet": "Nó luôn luôn phách lối về chuyện làm vườn nhưng thật ra nó chẳng biết gì lắm về chuyện đó.", "eng": "He's always laying down the law about gardening but he really doesn't know much about it."}, {"viet": "Anh ta đã bỏ vợ và đi với một cô sinh viên.", "eng": "He's dumped his wife and gone off with one of his students."}, {"viet": "Anh ta không phải là nhạc sĩ chuyên mà chỉ là người chơi theo kiểu tài tử.", "eng": "He's not a dedicated musician, just a dabbler."}, {"viet": "Hắn là loại người mà tớ ghét thật sự.", "eng": "He's the sort of person I really dislike."}, {"viet": "Hắn lúc nào cũng phô trương kiến thức của mình.", "eng": "He always makes a parade of his knowledge."}, {"viet": "Anh ấy xử sự với một sự khiêm tốn thích hợp với cương vị thứ yếu của mình.", "eng": "He behaved with a modesty becoming his junior position."}, {"viet": "Anh ta biết nấu nướng, và nấu rất ngon.", "eng": "He can cook, and he does it jolly well."}, {"viet": "Anh ta thú thật là mình hoàn toàn không biết gì về các kế hoạch của họ.", "eng": "He confessed himself to be totally ignorant of their plans."}, {"viet": "Hắn phủ nhận những gì hắn biết được về vấn đề đó.", "eng": "He denied knowing anything about it."}, {"viet": "Anh ta không phải nỗ lực vì quyền lợi của tôi, nhân danh tôi.", "eng": "He doesn't have to exert himself on my behalf."}, {"viet": "Ông ta ngạc nhiên là đã không ai tình nguyện giúp đỡ.", "eng": "He expressed surprise that no one had offered to help."}, {"viet": "Anh ta ghê tởm quăng tờ báo đi.", "eng": "He flung the paper away in disgust."}, {"viet": "Chàng mặc áo giáp ra trận.", "eng": "He girded himself with armour for the battle."}, {"viet": "Ông ta đã từng phải chịu đựng một chiến dịch nói bóng gió của giới báo chí.", "eng": "He had been subject to a campaign of innuendo in the press."}, {"viet": "Đầu óc anh ta không hiểu nổi môn toán.", "eng": "He has a mental block about maths."}, {"viet": "Anh ta thông thạo ngôn ngữ đó.", "eng": "He has made himself master of the language."}, {"viet": "Ông ta xiết cứng cánh tay của tôi.", "eng": "He held my arm in a vise-like grip."}, {"viet": "Phải công nhận là anh ta khôn ngoan nhưng không chăm chỉ lắm.", "eng": "He is clever, to be sure, but not very hard-working."}, {"viet": "Hắn là người ngoan cố nhất mà tôi biết.", "eng": "He is the most opinionated man I know."}, {"viet": "Anh ta đánh gục đối thủ của mình ba lần ở hiệp thứ nhất.", "eng": "He knocked his opponent down three times in the first round."}, {"viet": "Đến lúc ấy thì anh ta có kết quả rồi.", "eng": "He'll have had the results by then."}, {"viet": "Kể câu chuyện đến đâu hắn bịa đến đó.", "eng": "He made the story up as he went along."}, {"viet": "Ông ấy chẳng bao giờ leo được lên chức vị thật cao trong công ty cả.", "eng": "He never got very high in the company."}, {"viet": "Anh ta cầm cái túi lên và vội vã đi theo dọc sân ga.", "eng": "He picked up his bag and hurried off along the platform."}, {"viet": "Ông ta hóa ra là một tay lái xe giỏi hơn cả vô địch thế giới.", "eng": "He proved himself to be a better driver than the world champion."}, {"viet": "Ông ấy thật sự sang trọng và sống xa hoa.", "eng": "He really has some class and lives in style."}, {"viet": "Ông ta sẽ về hưu vào năm tới, người kế vị của ông đã chờ đợi sẵn sàng.", "eng": "He retires as chairman next year, his successor is already waiting in the wings."}, {"viet": "Anh ta còn sống, tim anh vẫn còn đập.", "eng": "He's alive-his heart is still beating."}, {"viet": "Hôm nay anh ta có thắt cà vạt.", "eng": "He's got a tie on today."}, {"viet": "Hắn muốn xin mày tí huyết đấy!", "eng": "He's out for your blood!"}, {"viet": "Nó đã nói rằng tên bạn của nó là Sam.", "eng": "He said that his friend's name was Sam."}, {"viet": "Anh ta có vẻ nghèo nhưng tôi ngờ rằng anh ta có rất nhiều tiền.", "eng": "He seems poor, but I suspect that he has quite a lot of money."}, {"viet": "Nó tỏ ra quan tâm quá sớm về nữ giới.", "eng": "He shows a precocious interest in the opposite sex."}, {"viet": "Ông ta phát biểu để bênh vực cho chính sách ngoại giao của quốc gia.", "eng": "He spoke in defense of the nation's foreign policy."}, {"viet": "Nó nằm sóng soài trước lò sưởi và ngủ thiếp đi.", "eng": "He stretched out in front of the fire and fell asleep."}, {"viet": "Ông ta đã nếm thử món xúp để xem mình đã nêm đủ muối chưa.", "eng": "He tasted the soup to see if he had put enough salt in it."}, {"viet": "Anh ta lái xe đưa cô ta đi chơi.", "eng": "He took her out for a drive."}, {"viet": "Anh ta cố gắng hết sức để mở cửa nhưng nó vẫn cứ đóng nguyên.", "eng": "He tried with all his might to open the door but it stayed shut."}, {"viet": "Nó đột ngột bỏ vợ ra đi!", "eng": "He walked out his wife just like that!"}, {"viet": "Nó luôn luôn đứng hạng bét về môn toán.", "eng": "He was always bottom of the class in maths."}, {"viet": "Nó bị kết tội làm ách tắc giao thông trên xa lộ.", "eng": "He was charged with obstructing the highway."}, {"viet": "Cuối cùng hắn ta cũng phải biết điều và thả các con tin ra.", "eng": "He was finally brought to his senses and agreed to let the hostages go."}, {"viet": "Nó bị tất cả bà con hàng xóm cười cho.", "eng": "He was laughed at by the whole neighborhood."}, {"viet": "Ông ta tức giận tột độ khi trông thấy sự bừa bãi.", "eng": "He was positively furious when he saw the mess."}, {"viet": "Anh ấy vẫn còn bực bội về buộc tội sai lầm đối với anh ấy.", "eng": "He was still bitter about the unjust accusations made against him."}, {"viet": "Anh ta rất lo lắng cho sự trở về an toàn của cô ta.", "eng": "He was very solicitous for her safe return."}, {"viet": "Cô ấy sẽ trở lại vào tháng tới.", "eng": "He will be back next month."}, {"viet": "Ông ấy có lẽ sẽ không đắc cử theo tình hình hiện nay.", "eng": "He would not be elected on present form."}, {"viet": "Xin chào, tôi có thể hỏi số dư tài khoản của ông được không?", "eng": "Hello, may I inquire about the balance of my account?"}, {"viet": "Những lời xu nịnh của bà ta không làm thay đổi quyết định của chúng tôi.", "eng": "Her blandishments won't change our mind."}, {"viet": "Quyết định rút lui của bà ta làm tất cả chúng tôi ngạc nhiên.", "eng": "Her decision to retire surprised us all."}, {"viet": "Nàng có cảm giác nửa thì bực mình nửa thì nhẹ nhõm.", "eng": "Her feelings were part anger, part relief."}, {"viet": "Chồng cô ấy ghen nếu cô ấy trò chuyện với người đàn ông khác.", "eng": "Her husband gets jealous if she talks to other men."}, {"viet": "Tiền lương thấp không tương xứng với khả năng của cô ấy.", "eng": "Her low salary is not commensurate with her abilities."}, {"viet": "Bố mẹ cô ta mất khi cô lên năm và cô ta được bà dì nuôi.", "eng": "Her parents died when she was a baby and she was brought up by her aunt."}, {"viet": "Các trách nhiệm của cô làm cô trưởng thành khi còn ít tuổi.", "eng": "Her responsibilities matured her at an early age."}, {"viet": "Nước mắt nàng rơi lã chã xuống má.", "eng": "Her tears flowed freely down her cheeks."}, {"viet": "Đây là ba trong những câu chuyện đó:", "eng": "Here are three of them:"}, {"viet": "Hành động của ông ta đã chấm dứt giai đoạn cải cách hy vọng thành công nhất trong lịch sử nước Phổ.", "eng": "His action terminated the most hopeful period of reform in Prussian history."}, {"viet": "Bàn tay to lớn chai sạn của anh ta nói lên một người lao động vất vả.", "eng": "His big calloused hands bespoke a hard-working man."}, {"viet": "Tư cách của hắn vi phạm những nguyên tắc của cách xử thế.", "eng": "His conduct offended against the rules of decent behaviour."}, {"viet": "Sự kích thích của anh ta lớn đến mức anh ta gào lên.", "eng": "His excitement was such that he shouted."}, {"viet": "Trán hắn nhăn lại vì sự cố gắng suy nghĩ.", "eng": "His forehead corrugated with the effort of thinking."}, {"viet": "Nó sắp tới, sắp đi, sắp về hưu, sắp tới thăm, v. v.", "eng": "His impending arrival, departure, retirement, visit, etc."}, {"viet": "Nỗi bận tâm chính của anh ta lúc đó là sao cho có đủ ăn.", "eng": "His main preoccupation at that time was getting enough to eat."}, {"viet": "Sự chống đối của ông ta chỉ củng cố quyết tâm của chúng tôi.", "eng": "His opposition served only to strengthen our resolve."}, {"viet": "Cách nói chuyện trước công chúng của ông ta vẫn chưa được tự tin lắm.", "eng": "His public speaking manner is still not very assured."}, {"viet": "Các con trai ông ấy là người đồng sở hữu của công việc kinh doanh.", "eng": "His sons are joint owners of the business."}, {"viet": "Cách đối xử của anh ta đối với các con vật đó thật độc ác.", "eng": "His treatment of those animals is cruel."}, {"viet": "Sự tức giận của anh ta sôi sục trong người, đến nỗi anh ta có thể đã đánh nó chết.", "eng": "His wrath so stirred within him, that he could have struck him dead."}, {"viet": "Hy vọng sớm gặp lại bạn.", "eng": "Hope to see you again soon."}, {"viet": "Làm sao tôi có thể đền bù vì đã làm hỏng cuộc liên hoan của họ?", "eng": "How can I ever make amends for ruining their party?"}, {"viet": "Khi ở nước ngoài, anh sống thế nào?", "eng": "How did you fare while you were abroad?"}, {"viet": "Anh có ấn tượng, thế nào về loại nhạc này?'.'Nó chẳng gây ấn tượng chút nào'.", "eng": "How does this music grab you?''It doesn't grab me at all'."}, {"viet": "Buổi họp kéo dài bao lâu?", "eng": "How long will the meeting last?"}, {"viet": "Bạn cần bao nhiêu tờ giấy?", "eng": "How many sheets of paper do you need?"}, {"viet": "Trong tài khoản ngân hàng tôi có bao nhiêu tiền?", "eng": "How much money is there in my bank account?"}, {"viet": "Làm cách nào mà ông ta có thể soạn nhạc được khi ông ta điếc đến như thế?", "eng": "However does he manage to write music when he is so deaf?"}, {"viet": "Tôi muốn được giới thiệu với cô gái đó mà anh đã nói chuyện!", "eng": "I'd like an intro you were talking to!"}, {"viet": "Tôi rất muốn đi, nhưng tôi phải đi làm vào thứ bảy.", "eng": "I'd really like to, but I've got to work Saturday."}, {"viet": "Khi đã trả hết nợ tôi chỉ còn lại vừa đúng 10 pao.", "eng": "I'll have just 10 pounds over when I've paid all my debts."}, {"viet": "Tôi sẽ mang theo một ít bánh quy ngộ nhỡ chúng ta đói.", "eng": "I'll take some biscuits in case we got hungry."}, {"viet": "Tôi e rằng anh không thể dùng những chiếc ghế đó, chúng đã được dành trước.", "eng": "I'm afraid you can't use those chairs-they're already spoken for."}, {"viet": "Thứ bảy này tôi sẽ đi xem triển lãm mỹ thuật.", "eng": "I'm going to an art exhibition this Saturday."}, {"viet": "Tôi hay hoảng sợ ( ở trong ) những đám đông.", "eng": "I'm nervous of ( being in ) large crowds."}, {"viet": "Tôi hơi ngờ vực về điều được gọi là sự cảm thông của họ đối với kẻ nghèo khó.", "eng": "I'm rather sceptical about their professed sympathy for the poor."}, {"viet": "Tôi bối rối hết sức, tôi chẳng biết phải làm gì cả.", "eng": "I'm stumped, I just don't know what to do."}, {"viet": "Rất vui được làm quen với ông thưa ông Trần.", "eng": "I'm very happy to make your acquaintance, Mr. Chan."}, {"viet": "Tôi gọi điện suốt cả buổi sáng mà không nói chuyện được với bác sĩ.", "eng": "I've been telephoning a morning, but I haven't been able to speak to the doctor."}, {"viet": "Tôi đã có những công việc tốt hơn, nhưng tôi thích làm việc ban đêm.", "eng": "I've had better jobs, but I like to work at night."}, {"viet": "Tôi đã gọi cho anh trứng và khoai tây rán.", "eng": "I've ordered you egg and chips egg and chips."}, {"viet": "Tôi đồng ý là nó đã hết sức cố gắng nhưng sự thật là nó không hoàn thành công việc đúng thời hạn.", "eng": "I agree that he tried hard but the fact remains that he has not finished the job in time."}, {"viet": "Tôi rất sẵn lòng đón nghe bất cứ điều gì ông nói và sự trợ giúp của ông là vô cùng quý báu.", "eng": "I am happy to listen to anything you say and your assistance is most valuable."}, {"viet": "Tôi đến bệnh viện lúc tám giờ, nhưng tới chín giờ mới đến phiên làm việc.", "eng": "I arrive at the hospital at eight o'clock, but I don't go on duty until nine."}, {"viet": "Tôi đã đặt trước một bàn dành cho hai người vào lúc 8 giờ tối nay.", "eng": "I booked a table for two for 8: 00 this evening."}, {"viet": "Tôi chưa lái xe được, tôi còn đang học.", "eng": "I can't drive yet-I'm still learning."}, {"viet": "Tôi không thể chịu được việc anh ta cứ ngắt lời liên tiếp.", "eng": "I can't stand him interrupting all the time."}, {"viet": "Tôi có thể phát hiện được việc bỏ phế qua một chiếc cửa ra vào bị gãy hoặc chiếc cửa sổ kính vỡ nát.", "eng": "I can read abandonment in a broken door or shattered window."}, {"viet": "Ôi dường như tôi không thể tìm thấy danh thiếp kinh doanh của tôi.", "eng": "I can't seem to find my business card."}, {"viet": "Tôi có thể thấy anh ta có vẻ nghi ngại về chuyện cho tôi mượn ô tô.", "eng": "I could see he had some misgiving about lending me his car."}, {"viet": "Tôi muốn ăn thức ăn cay.", "eng": "I'd like to have hot food."}, {"viet": "Tôi không cần phải ra ngoài nhưng tôi muốn hít thở không khí trong lành.", "eng": "I didn't need to go out but I wanted a breath of fresh air."}, {"viet": "Tôi không hiểu được điều đó, tại sao nàng có thể làm một điều như thế nhỉ?", "eng": "I don't get it, why could she do a thing like that?"}, {"viet": "Tôi không thích chợ, nó quá đông người.", "eng": "I don't like the market, it is too crowded."}, {"viet": "Tôi không muốn một kẻ nghiện ma tuý điều khiển mình.", "eng": "I don't want any C-head operating on me."}, {"viet": "Tôi không biết con số chính xác.", "eng": "I don't know the exact number."}, {"viet": "Tôi ghen tị với những người phụ nữ có địa vị cao.", "eng": "I envy women with high positions."}, {"viet": "Tôi cảm thấy lo ngại về toàn bộ ca mổ.", "eng": "I felt apprehensive about the whole operation."}, {"viet": "Tôi đã tìm thấy nó trên mạng.", "eng": "I found it on the internet."}, {"viet": "Tôi thực sự bối rối khi đánh mất các chìa khoá của mình.", "eng": "I got into a real flap when I lost my keys."}, {"viet": "Tôi đã được báo trước về những gì sẽ đến.", "eng": "I had been warned what to expect."}, {"viet": "Tôi ghét tông màu dịu của những bộ áo quần mặc vào mùa hè.", "eng": "I hate muted tones in summer clothes."}, {"viet": "Tôi đã nghe hai lời kể khác nhau về vụ tai nạn.", "eng": "I have heard two versions of the accident."}, {"viet": "Ngay bây giờ tôi đang có khách.", "eng": "I have some visitors right now."}, {"viet": "Thực tình tôi chưa hiểu anh muốn nói gì.", "eng": "I haven't really latched on to what you mean."}, {"viet": "Tôi nghe nói là làm việc tình nguyện rất phổ biến ở Boston.", "eng": "I heard that volunteering is very popular in Boston."}, {"viet": "Tôi hy vọng em sẽ vui vẻ trong thời gian lưu lại ở Mỹ.", "eng": "I hope you enjoy your stay in the States."}, {"viet": "Tôi biết cô ấy nhưng chúng tôi chưa bao giờ là bạn thân của nhau.", "eng": "I knew her, but we'd never been bosom friends."}, {"viet": "Tôi đã cho nó vay 5 pao với điều kiện là nó sẽ trả tôi hôm nay.", "eng": "I lent him 5 pounds on the understanding that he would repay me today."}, {"viet": "Tuần tới tôi sẽ đi công tác.", "eng": "I'll be away business next week."}, {"viet": "Tôi sẽ phải giúp người đàn ông đó.", "eng": "I'll have to help that man."}, {"viet": "Tôi đánh mất chìa khoá ở đâu đó trong khoảng giữa xe hơi và nhà.", "eng": "I lost my keys somewhere between the car and the house."}, {"viet": "Tôi rất vui vì cháu có thể đến.", "eng": "I'm glad you could come."}, {"viet": "Tôi không chắc khi nào tôi trở lại.", "eng": "I'm not sure when I want to return."}, {"viet": "Tôi đang chờ một cuộc điện thoại.", "eng": "I'm waiting for a phone call."}, {"viet": "Tôi phải là người phụ nữ hạnh phúc nhất trái đất!", "eng": "I must be the happiest woman on earth!"}, {"viet": "Tôi cần phải tập bắn súng nhiều hơn nữa.", "eng": "I need more practice at shooting."}, {"viet": "Tôi thường đến suối nước nóng bởi vì suối nước nóng giúp huyết quản của tôi lưu thông tốt.", "eng": "I often go to hot springs because it improves my blood circulation."}, {"viet": "Tôi nhấn chân ga cho tới khi máy rú lên.", "eng": "I pressed the accelerator until the engine screamed."}, {"viet": "Tôi thật đã khéo chọn chiếc xe ôtô này-Nó bị hỏng hoài!", "eng": "I really picked a winner with this car-It's always breaking down!"}, {"viet": "Tôi tôn trọng ông ta với tư cách một nhà văn và với tư cách một con người.", "eng": "I respect him as a writer and as a man."}, {"viet": "Tôi hiểu tại sao Los Angeles thường được gọi là một thành phố đầy quyến rũ.", "eng": "I see why Los Angeles is often called a glamorous city."}, {"viet": "Tôi coi việc được mời là một điều vinh dự.", "eng": "I shouldn't count it an honour to be invited."}, {"viet": "Tôi đột nhiên cảm thấy hơi khó chịu nên phải nằm xuống.", "eng": "I suddenly came over all funny and had to lie down."}, {"viet": "Tôi nghĩ tác phẩm của anh ta được đề cao quá mức.", "eng": "I think his work is extremely overrated."}, {"viet": "Tôi nghĩ ý kiến đó hay đấy.", "eng": "I think that's a good idea."}, {"viet": "Tôi cứ tưởng còn lại ít bích quy nhưng chúng nó đã ngốn sạch.", "eng": "I thought that would be some biscuits leg but they've wolfed the lot."}, {"viet": "Tôi cố suy nghĩ xem việc gì đã có thể xảy nhưng chẳng có ý nghĩ nào nảy ra trong óc tôi cả.", "eng": "I tried to think what could have happened, but nothing suggested itself."}, {"viet": "Tôi chưa bao giờ ngủ giường trên mà.", "eng": "I've never slept in an upper berth."}, {"viet": "Tôi muốn thông báo cho ông ấy về việc giấy chuyển tiền của ông ấy đã đến.", "eng": "I want to inform him of the arrival of his remittance."}, {"viet": "Người ta yêu cầu tôi tổ chức chuyến đi chơi, nhưng tôi đã làm hỏng nó.", "eng": "I was asked to organize the trip, but I messed it up."}, {"viet": "Tôi còn non nớt vào hồi đó và yêu dễ dàng.", "eng": "I was in my salad days then, and fell in love easily."}, {"viet": "Tôi lấy làm tiếc khi nghe tin bà cô anh đã qua đời.", "eng": "I was sorry to hear that your aunt had passed away."}, {"viet": "Tôi đã đi phỏng vấn nhà doanh nghiệp thích làm ăn theo cách riêng của mình này.", "eng": "I went along to interview this maverick businessman himself."}, {"viet": "Tôi ước muốn có cái gì xảy ra làm xẹp cái tôi của cô ta.", "eng": "I wish something would happen to puncture her ego."}, {"viet": "Không biết những người ở nhà bên cạnh đã có chuyện gì rồi?", "eng": "I wonder what became of the people who lived next door?"}, {"viet": "Tôi muốn đổi một số chi phiếu du lịch lấy tiền mặt.", "eng": "I would like to cash some traveler's checks."}, {"viet": "Tôi sẽ không để cho các đứa cháu của tôi ở lại nữa-bất luận thế nào!", "eng": "I wouldn't have my sister's children to stay again-not at any price!"}, {"viet": "Nếu nó lại xin tiền anh, hãy bảo nó xéo đi.", "eng": "If he asks you for money again just tell him to get knotted."}, {"viet": "Nếu nó là bộ phim mới phát hành, chúng ta chỉ có thể thuê nó trong một hoặc hai ngày.", "eng": "If it is a new release, we can only rent it for one or two days."}, {"viet": "Nếu xe có gì hỏng hóc hãy gọi điện cho bảo trì.", "eng": "If there is anything wrong with the car, can the maintenance."}, {"viet": "Nếu mày cố vay khéo nữa thì tao không có tiền đâu.", "eng": "If you've on the scrounge again, I've no money."}, {"viet": "Nếu không tập luyện nhiều hơn nữa, anh sẽ bị béo đấy.", "eng": "If you don't take more exercise you'll get fat."}, {"viet": "Nếu anh sống trong khu đó, hãy đến thăm nhé.", "eng": "If you're in the area, come and visit."}, {"viet": "Nếu vợ anh tiếp tục vu cáo, tôi sẽ phải buộc lòng nặng lời với chị ấy.", "eng": "If your wife continues to slander me, will have to give her a piece of my mind."}, {"viet": "Giữa nhà trường và trường đại học tôi còn theo học một lớp cấp tốc ba tháng tiếng Ý.", "eng": "In between school and university I did a three-months crash course in Italian."}, {"viet": "Trong cuộc đời ngắn ngủi của mình, hắn đã trải qua cả một loạt tội phạm từ ăn trộm vặt cho đến giết người.", "eng": "In his short life he had run the entire gamut of crime, from petty theft to murder."}, {"viet": "Ở một số xã hội cổ, vua được tôn sùng như thần thánh.", "eng": "In some ancient societies kings were deified."}, {"viet": "Như là phương sách cuối cùng, chúng ta vẫn có thể đi bộ về nhà.", "eng": "In the last resort we can always walk home."}, {"viet": "Ở Washington các thư ký hội đồng chính phủ đứng để người ta chụp ảnh và đọc diễn văn.", "eng": "In Washington cabinet secretaries pose and speechify."}, {"viet": "Liệu 10 pao có đủ cho các chi tiêu của anh không?", "eng": "Is 10 pounds sufficient for your expenses?"}, {"viet": "Bức vẽ trên bảng kia là của cô đấy phải không, Clare?", "eng": "Is that drawing on the board your handiwork, Clare?"}, {"viet": "Có thức ăn đặc trưng của người Mỹ bản địa không?", "eng": "Is there typical Native American food?"}, {"viet": "Thật là may mắt tất cả chúng tôi đều thi đậu.", "eng": "It's a good thing all of us passed the examination."}, {"viet": "Đi ra đường một mình ban đêm đã trở nên nguy hiểm.", "eng": "It's becoming dangerous to go out alone at night."}, {"viet": "Thật là mừng thấy cụ Jenkins lại dậy được và đi ra ngoài.", "eng": "It's good to see old Mr. Jenkins out and about again."}, {"viet": "Ở với anh thật không vui vẻ gì, lúc nào cũng đau khổ rên rỉ!", "eng": "It's no fun being with you, old misery!"}, {"viet": "Ai là người chi phối trong cái nhà này, điều đó đã quá rõ!", "eng": "It's quite clear who wears the trousers in that house!"}, {"viet": "Xin lỗi để xoa dịu lương tâm của anh là điều quá muộn.", "eng": "It's too late to salve your conscience by apologizing."}, {"viet": "Đi vào nhà vệ sinh phải trả 50 xu, này, anh đã bao giờ thấy như thế chưa?", "eng": "It cost 50p to go to the toilet, well, did you ever?"}, {"viet": "Họ nên đi với một mục đích rõ ràng trong đầu.", "eng": "It is advisable that they go with a clearly defined goal in mind."}, {"viet": "Tôi rất hân hạnh chào mừng tất cả quý vị đã đến đây hôm nay.", "eng": "It is my pleasure to welcome you all here today."}, {"viet": "Sau này người ta mới biết là người lái xe say rượu.", "eng": "It later emerged that the driver of the car had been drunk."}, {"viet": "Đó là vấn đề lương tâm.", "eng": "It's a matter of conscience."}, {"viet": "Nó là văn phòng đầu tiên ở bên trái.", "eng": "It's the first office on the left."}, {"viet": "Nó phải mất nhiều thời gian và tập luyện.", "eng": "It takes a lot of time and practice."}, {"viet": "Người ta đã thoả thuận rằng một cuộc họp nữa là cần thiết.", "eng": "It was agreed that another meeting was necessary."}, {"viet": "Không có gì ngạc nhiên khi anh ta bị bỏ tù-mọi người đều biết là thế nào rồi cũng xảy ra chuyện đó ( với anh ta ).", "eng": "It was no surprise when he was sent to prison-everyone knew he had it coming ( to him )."}, {"viet": "Anh đã gửi hoa tới, thật là chu đáo quá.", "eng": "It was very thoughtful of you to send flowers."}, {"viet": "Qua rút thăm, Italia sẽ gặp Tây Ban Nha trong giải vô địch bóng đá thế giới.", "eng": "Italy have been drawn to play Spain in the World Cup."}, {"viet": "John đã trở thành kẻ tội phạm chuyên nghiệp.", "eng": "John's turned out to be a real low-life."}, {"viet": "Hãy nhắc tôi nhớ lại, anh sinh ra tại York phải không?", "eng": "Just refresh my memory were you born in York?"}, {"viet": "Tuy nhiên về sau ông đã đổi ý.", "eng": "Later, however, he changed his mind."}, {"viet": "Chúng ta hãy quyết định nơi chúng ta muốn đi nhé.", "eng": "Let's decide where we want to go."}, {"viet": "Đột kích vào lãnh thổ của địch.", "eng": "Make a foray into enemy territory."}, {"viet": "Nhiều người đã bị chết bẹp khi toà nhà đó sụp xuống đè lên họ.", "eng": "Many people were crushed when the building collapsed on top of them."}, {"viet": "Xoa bóp giúp làm giảm tình trạng căng thẳng của cơ bắp.", "eng": "Massage helps relieve the tension in one's muscles."}, {"viet": "Bây giờ tôi có thể hút bụi sàn nhà được không?", "eng": "May I vacuum the floor now?"}, {"viet": "Phần lớn động từ tiếng Anh đều thêm biến tố'-ed'ở thời quá khứ.", "eng": "Most English verbs are inflected with'-ed'in the past tense."}, {"viet": "Thưa ông Vương, đây là ông Clarke thuộc giàn nhạc Tài tử.", "eng": "Mr. Wang, this is Mr. Clarke of the Amateur Orchestra."}, {"viet": "Xe ô tô của tôi tồi lắm rồi, nó cứ hỏng luôn.", "eng": "My car's on its last legs-it keeps breaking down."}, {"viet": "Bạn tôi đã giới thiệu thuật bấm huyệt là một cách điều trị tình trạng căng thẳng.", "eng": "My friend recommended acupressure as a treatment for stress."}, {"viet": "Thần kinh của tôi sẽ không thể chịu đựng được lâu hơn.", "eng": "My nerves won't stand the strain much longer."}, {"viet": "Đồng hồ của tôi chạy nhanh năm phút.", "eng": "My watch is five minutes fast."}, {"viet": "New York nổi tiếng vì những toà nhà chọc trời.", "eng": "New York is famous for its skyscrapers."}, {"viet": "Chưa, nhưng một ngày kia tôi sẽ đến đó.", "eng": "No, not yet, but I'll go someday for sure."}, {"viet": "Không ai phải sợ bị mắc bệnh ấy cả.", "eng": "Nobody need be afraid of catching the disease."}, {"viet": "Bây giờ ông đã gặp ban giám đốc và phòng kinh doanh.", "eng": "Now you have seen the management and sales departments."}, {"viet": "Ôi, chỉ đơn giản như đóng thuế và đầu tư.", "eng": "Oh, just simple things like paying taxes and making investments."}, {"viet": "Tại các nông trại lớn, súc vật thường được đóng dấu.", "eng": "On big farms cattle are usually branded."}, {"viet": "Một đầu vườn được ngăn lại bằng một hàng rào để giữ gà.", "eng": "One end of the garden was fenced off for chickens."}, {"viet": "Chỉ những người trong nhóm tuổi từ 20 đến 30 cần nộp đơn.", "eng": "Only people in the age-bracket 20-30 need apply."}, {"viet": "Toàn bộ tổ chức của chúng ta đã bị điệp viên của địch thâm nhập.", "eng": "Our entire organization had been infiltrated by enemy agents."}, {"viet": "Cô thư ký mới của chúng tôi tỏ ra rất có năng lực.", "eng": "Our new secretary appeared to be quite efficient."}, {"viet": "Những buổi đi xem hát của chúng tôi làm cho chuyến đi nghỉ càng thêm vui vẻ.", "eng": "Our visits to the theatre made the holiday more amusing."}, {"viet": "Các hành khách nên theo mũi tên xanh nếu họ không có gì khai báo.", "eng": "Passengers should follow the green arrows if they have nothing to declare."}, {"viet": "Người ta thường nói con voi có một trí nhớ rất tốt.", "eng": "People usually say that elephant never forget."}, {"viet": "Vui lòng ký ở phía dưới tấm chi phiếu.", "eng": "Please sign the checks at the bottom."}, {"viet": "Dù mưa hay nắng chúng ta cũng sẽ đi.", "eng": "Rain or shine, we will go."}, {"viet": "Những thùng bịt kín đựng chất thải hạt nhân đã được ném xuống biển.", "eng": "Seated containers of nuclear waste have been dumped in the sea."}, {"viet": "Giá cổ phần sụt xuống sau khi có tin tức về những con số thương mại đáng buồn.", "eng": "Share prices collapsed after news of poor trading figures."}, {"viet": "Cô ấy luôn luôn sẵn sàng nai lưng giúp người khác.", "eng": "She's always ready to put herself out to help others."}, {"viet": "Cô ta sẽ giành hai giải năm nay, giải Thế vận hội và giải vô địch thế giới.", "eng": "She's going for the double this year, the Olympics and the World Championship."}, {"viet": "Cô ấy không thoả mãn với bất cứ thứ gì ngoài cái tốt nhất.", "eng": "She's not satisfied with anything but the best."}, {"viet": "Cô ấy đang đóng thử vai nữ hoàng Clê-ô-pát.", "eng": "She's trying out for the part of Cleopatra."}, {"viet": "Cô ta trả lời bằng một giọng đầy xúc động.", "eng": "She answered in a voice filled with emotion."}, {"viet": "Không dùng kính bà ấy không thể nhìn mà đọc được.", "eng": "She can't see to read without her glasses."}, {"viet": "Cô ấy không tìm ra được lối ra khỏi toà nhà.", "eng": "She couldn't find her way out of the building."}, {"viet": "Bà ta điều khiển việc lập kế hoạch cho đại hội liên hoan.", "eng": "She directed the planning of the festival."}, {"viet": "Bà ta cảm thấy mình như bị nhốt suốt đời làm người nội trợ.", "eng": "She feels penned in by her life as a housewife."}, {"viet": "Cô ta âu yếm ôm chặt lấy mẹ.", "eng": "She gave her mother an affectionate hug."}, {"viet": "Bà ta có linh tính gở rằng máy bay sẽ bị tai nạn.", "eng": "She had a sinister foreboding that the plane would crash."}, {"viet": "Cô ấy có một phong cách giảng dạy mới lạ.", "eng": "She has a new style of teaching."}, {"viet": "Bà ấy có hai con, một gái và một trai.", "eng": "She has two children, a girl and a boy."}, {"viet": "Bà ta chẳng nghèo chút nào, thực ra bà ta rất giàu.", "eng": "She is by no means poor, in fact, she's quite rich."}, {"viet": "Hiện giờ cô ấy không có nhà.", "eng": "She isn't at home at the moment."}, {"viet": "Bà ta vẫn còn sống nhiều năm sau khi chồng bà chết.", "eng": "She lived on for many years after her husband died."}, {"viet": "Là một nhà viết tiểu thuyết, bà ta có một cuộc sống không ổn định.", "eng": "She makes a rather precarious living as a novelist."}, {"viet": "Cô ấy mở cửa thật êm để khỏi náo động đứa bé đang ngủ.", "eng": "She opened the door quietly so as not to disturb the sleeping child."}, {"viet": "Cô ấy lái chiếc xe tải sang trái để tránh con chó.", "eng": "She pulled the van to the left to avoid a dog."}, {"viet": "Cô ta theo đuổi mọi người đàn ông đẹp trai nào mà cô ta gặp.", "eng": "She runs after every good-looking man she meets."}, {"viet": "Cô ta thuộc nhóm giỏi nhất môn toán.", "eng": "She's in the top set in maths."}, {"viet": "Cô ấy nói một điều gì đó về nó, nhưng tôi không thể nhớ đó là cái gì.", "eng": "She said something about it, but I can't remember what it was."}, {"viet": "Cô ta làm vui lây cho tất cả mọi người chung quanh cô ta.", "eng": "She sheds happiness all around her."}, {"viet": "Cô ấy học một năm ở trường đại học nông nghiệp, nhưng không thích.", "eng": "She spent a year at some aggie college, but didn't like it."}, {"viet": "Cô ta lắc lắc mông một cách khêu gợi khi nhảy.", "eng": "She swayed her hips sensuously as she danced."}, {"viet": "Cô ấy cố không để lộ sự thiên vị trong cách đối xử với bọn trẻ cô ấy trông nom.", "eng": "She tried not to show preference in her treatment of the children in her care."}, {"viet": "Bà ấy cần thêm một cái giường xếp và một cái giường cũi.", "eng": "She wants a folding bed and a cot."}, {"viet": "Tôi không thể nhận ra cô ta là cô gái mà tôi quen biết hồi còn đi học.", "eng": "She was barely recognizable as the girl I had known at school."}, {"viet": "Bà ta đã trở nên hơi ngớ ngẩn và không bao giờ có thể để mặc bà một mình được.", "eng": "She was getting a bit dotty and could never be left alone."}, {"viet": "Cô ta khó chịu vì những nhận xét coi thường phụ nữ của ông ta.", "eng": "She was offended by his sexist remarks."}, {"viet": "Cô ta bửa những khúc gỗ ra bằng cái rìu.", "eng": "She was splitting logs with an axe."}, {"viet": "Cô ta mệt mỏi vì làm việc quá sức.", "eng": "She was worn down by overwork."}, {"viet": "Cô ta ao ước có được cơ may vào đại học.", "eng": "She wishes that she'd been given the chance to go to university."}, {"viet": "Cô ta viết về chính trị cho một tờ tuần báo.", "eng": "She writes about politics for a weekly journal."}, {"viet": "Tỏ ra ít quan tâm tới tình cảm của những người khác.", "eng": "Show little regard for the feelings of others."}, {"viet": "Vì trong toa không có ai khác nên tôi có thể nằm dang chân dang tay.", "eng": "Since there was no one else in the compartment I was able to spread myself."}, {"viet": "Làm vôi bắn tung tóe trên khắp sàn nhà.", "eng": "Slosh the whitewash all over the floor."}, {"viet": "Vậy là sau khi la hét và kêu gào một tiếng đồng hồ bà ta đã bước ra ngoài nước mắt đầm đìa.", "eng": "So after shouting and screaming for an hour she walked out in tears."}, {"viet": "Lính phải phục tùng ( sĩ quan của họ ).", "eng": "Soldiers are expected to obey ( their officers )."}, {"viet": "Vài nghị sĩ từ chối theo đường lối của đảng về quốc phòng.", "eng": "Some MPs refused to follow the party line on defence."}, {"viet": "Một số cảnh trong vở kịch có phần không đứng đắn.", "eng": "Some scenes in the play are rather near the bone."}, {"viet": "Điều này xảy ra trong đời mỗi người.", "eng": "Something which happens in the life of each individual."}, {"viet": "Những sự giảm giá đặc biệt đối với người già trên tất cả các xe buýt.", "eng": "Special concessions on all bus fares for old people."}, {"viet": "Quản lý nhà nước là một ý niệm rất xa lạ với phong cách Mỹ.", "eng": "State control is very un-American notion."}, {"viet": "Đừng có ăn không ngồi rồi như thế, hãy giúp em dọn dẹp đi.", "eng": "Stop idling and help me clean up."}, {"viet": "Các sinh viên phải ở lại cư xá trong suốt học kỳ.", "eng": "Students must remain in residence during term."}, {"viet": "Những tuyên bố thiên vị như thế rất dễ gây ra sự phản đối mạnh mẽ.", "eng": "Such tendentious statements are likely to provoke strong opposition."}, {"viet": "Chắc chắn là cô ta không có gan nói điều đó với anh ấy?", "eng": "Surely she didn't have the nerve to say that to him?"}, {"viet": "Hãy mang đến cho bà ta một ít đồ ăn sáng để trên một cái khay.", "eng": "Take her some breakfast on a tray."}, {"viet": "Những thầy giáo nhồi sọ cho trẻ em những lý thuyết phản xã hội.", "eng": "Teachers who indoctrinate children with antisocial theories."}, {"viet": "Bọn khủng bố đánh bom nhiều trạm cảnh sát.", "eng": "Terrorists bombed several police stations."}, {"viet": "Đó không phải là cách cư xử đúng theo Cơ đốc giáo.", "eng": "That's not a very Christian way to behave."}, {"viet": "Con bò đó là một con vật cho sữa nhiều.", "eng": "That cow is a good milker."}, {"viet": "Thằng ranh con Jimmy đó lại giấu đôi dép của tao rồi!", "eng": "That little scamp Jimmy has hidden my slippers again!"}, {"viet": "Đó chỉ là vấn đề quan điểm.", "eng": "That's a matter of opinion."}, {"viet": "Đó là một cú anh ta chơi xuất sắc.", "eng": "That was a cracking shot he played."}, {"viet": "Tai nạn xảy ra bên ngoài nhà tôi.", "eng": "The accident happened outside my house."}, {"viet": "Cơ cấu hành chính của chính phủ.", "eng": "The administrative machinery of government."}, {"viet": "Người Mỹ chọn ông Bush làm Tổng thống.", "eng": "The Americans chose Mr Bush as president."}, {"viet": "Các nhà khảo cổ đã tìm thấy những đồng tiền vàng và đồ gốm ở lớp sâu nhất của di chỉ.", "eng": "The archaeologists found gold coins and pottery in the lowest level of the site."}, {"viet": "Họa sĩ yêu cầu cô ấy làm mẫu.", "eng": "The artist asked her to pose for him."}, {"viet": "Nhà cầm quyền treo giải cho ai bắt được những kẻ sống ngoài vòng pháp luật.", "eng": "The authorities put a price on the outlaws head."}, {"viet": "Quả bóng trượt qua cột gôn vào lưới.", "eng": "The ball glanced off the goal post into the net."}, {"viet": "Tổ chức của người Basque ly khai ETA.", "eng": "The Basque separatist organization ETA."}, {"viet": "Tình trạng giàu có ở khu phố cổ của thành phố, giàu có, phong lưu.", "eng": "The better-off live in the older section of town."}, {"viet": "Cú đánh vào đầu làm anh ta choáng váng một lát.", "eng": "The blow on the head dazed him fore a moment."}, {"viet": "Quyển sách đáng khâm phục về văn phong.", "eng": "The book is admirable in respect of style."}, {"viet": "Cậu con trai xin phép được đi cùng chúng tôi.", "eng": "The boy begged that he might be allowed."}, {"viet": "Chiếc cầu được di chuyển từng phần một đến địa điểm mới.", "eng": "The bridge was moved piece by piece to a new site."}, {"viet": "Người lái xe buýt bóp còi cảnh báo người đàn ông bước xuống đường.", "eng": "The bus driver hooted at the man who stepped onto the road."}, {"viet": "Hệ thống tư bản dựa trên động cơ lợi nhuận.", "eng": "The capitalist system is based on the profit motive."}, {"viet": "Chiếc xe ôtô cho thấy có những dấu hiệu bỏ bê.", "eng": "The car shows signs of neglect."}, {"viet": "Con mèo ăn vụng thức ăn và chuồn mất.", "eng": "The cat ate the food and sneaked off."}, {"viet": "Da con tắc kè hoa biến đổi theo màu sắc của môi trường xung quanh.", "eng": "The chameleon's skin replicates the pattern of its surroundings."}, {"viet": "Đứa trẻ bộc lộ tâm trạng của mình bằng cách đập vỡ các đồ chơi.", "eng": "The child gave vent to his feelings, by smashing up all his toys."}, {"viet": "Bọn trẻ đó suýt soát nhau về tuổi tác.", "eng": "The children are close to each other in age."}, {"viet": "Lũ trẻ ngồi nghịch hàng giờ chiếc máy phát thanh mới của chúng.", "eng": "The children spent hours horsing around with their new radio."}, {"viet": "Thánh lễ nhà thờ là lễ tưởng niệm các nạn nhân của cuộc thảm họa.", "eng": "The church service was a memorial to the disaster victims."}, {"viet": "Phong cách đơn sơ của một loại kiến trúc hiện đại nào đó.", "eng": "The clinical style of some modern architecture."}, {"viet": "Sự sưu tập và trình bày những dữ liệu thống kê.", "eng": "The collection and presentation of statistical data."}, {"viet": "Các công ty gặp nhiều khó khăn do những sự chậm trễ về bưu điện.", "eng": "The companies were greatly inconvenienced by the postal delays."}, {"viet": "Công ty đó bị phạt 1.000 bảng Anh, điều mà những người chỉ trích cho là quá nhẹ.", "eng": "The company was fined £ 1,000, which critics said was too light."}, {"viet": "Sự thành lập một đoàn cố vấn.", "eng": "The constitution of an advisory group."}, {"viet": "Hội đồng có một chính sách không phân biệt chủng tộc.", "eng": "The council has a policy of nondiscrimination."}, {"viet": "Toà án quyết định phạt anh ta 50000 pao về các thiệt hại.", "eng": "The court awarded him damages of 50000 pounds."}, {"viet": "Đám đông gần một nghìn người.", "eng": "The crowd approximated a thousand people."}, {"viet": "Phong tục đó vẫn còn sót lại ở một số ngôi làng.", "eng": "The custom still lingers on in some villages."}, {"viet": "Số người chết đã tăng lên tới 100.", "eng": "The death toll mounted to 100."}, {"viet": "Cả vụ xôn xao những lời đồn.", "eng": "The department was buzzing with rumours."}, {"viet": "Chiếc bàn ăn sáng ngời ánh bạc và pha lê.", "eng": "The dining-table shone with silver and crystal."}, {"viet": "Bác sĩ khuyên anh ta tập thể dục nhiều hơn.", "eng": "The doctor advised him to take more exercise."}, {"viet": "Các tài liệu đó sẽ được cất trong mười năm nữa.", "eng": "The documents will stay under wraps for ten more years."}, {"viet": "Cánh cửa gài bằng một cái then.", "eng": "The door fastens with a latch."}, {"viet": "Vịt đông trùng thảo ư?", "eng": "The Duck with Chinese Caterpillar Fungus?"}, {"viet": "Cuộc bầu cử là một thí dụ của chế độ dân chủ trong hành động.", "eng": "The election demonstrates democracy in action."}, {"viet": "Đội bóng đá Anh là đội vô địch thế giới năm 1966.", "eng": "The English football team were world champion in 1966."}, {"viet": "Một thành viên đương nhiên của ủy ban.", "eng": "The ex officio member of the committee."}, {"viet": "Việc thu những phần đóng góp về tài chính.", "eng": "The extraction of financial contributions."}, {"viet": "Người nông dân sàng sảy thóc để tách trấu khỏi hạt.", "eng": "The farmer winnows his grain to separate it from the chaff."}, {"viet": "Bộ phim gây nhiều cảm nghĩ xấu, nhất là trong giới công nhân mà đời sống của họ được phim đó mô tả.", "eng": "The film caused a lot of bad feeling, not least among the workers whose lives it described."}, {"viet": "Người lính cứu hỏa đó xô cánh cửa sập xuống để tới được chỗ mấy đứa trẻ.", "eng": "The fireman smashed the door down to reach the children."}, {"viet": "Lần đầu tiên tôi có cảm giác mọi việc không ổn là khi giá cổ phần bắt đầu hạ.", "eng": "The first inkling I had that all was not well was when the share prices began to fall."}, {"viet": "Bây giờ tất cả các hoa đều đã nở.", "eng": "The flowers are all open now."}, {"viet": "Hôm qua bốn chiếc máy bay đó, mỗi chiếc đã thực hiện hai lần xuất kích.", "eng": "The four planes each made two sorties yesterday."}, {"viet": "Trò chơi đó dễ ợt từ đầu đến cuối.", "eng": "The game was a cakewalk from beginning to end."}, {"viet": "Hơi ấm áp của ánh nắng dịu thấm đẫm vào cơ thể khốn khổ của anh ta.", "eng": "The genial sunshine saturating his miserable body with its warmth."}, {"viet": "Hàng hoá được trưng bày trong cửa kính.", "eng": "The goods were on display in the shop window."}, {"viet": "Chính phủ đã hành động để xua tan lời đồn đại.", "eng": "The government has moved to dispel the rumours."}, {"viet": "Chính phủ cố làm nhiễu các buổi truyền tin của du kích.", "eng": "The government tried to jam the guerrillas'transmissions."}, {"viet": "Người Hy Lạp và La Mã nghĩ rằng các vị thần của họ đôi khi cưỡi xe ngựa.", "eng": "The Greeks and Romans thought that their gods sometimes rode in chariots."}, {"viet": "Khách khứa bắt đầu cởi mở sau khi cạn vài ly rượu.", "eng": "The guests expanded a little when they'd get a glass or two of wine."}, {"viet": "Hơi nóng của lửa đã làm vênh những đĩa hát này.", "eng": "The heat of the fire has bent these records."}, {"viet": "Chiếc vòng lăn dọc theo vỉa hè.", "eng": "The hoop rolled along the pavement."}, {"viet": "Khách sạn tốt và thời tiết dễ chịu.", "eng": "The hotel was good and the weather was agreeable."}, {"viet": "Các ngôi nhà bị động đất làm rung chuyển.", "eng": "The houses were rocked by the earthquake."}, {"viet": "Dấu vết của một chiếc lá trong một hoá thạch.", "eng": "The impression of a leaf in a fossil."}, {"viet": "Sự đưa thêm các tài nguyên vào dự án.", "eng": "The input of additional resources into the project."}, {"viet": "Sự phát hành lần xuất bản mới của cuốn từ điển này.", "eng": "The issue of a new edition of this dictionary."}, {"viet": "Chánh án nói với người đàn ông đó không được đe doạ vợ anh ta nữa.", "eng": "The judge told the man to desist from threatening his wife."}, {"viet": "Ứng cử viên đảng Lao động đã đánh đổ được số đa số 4000 của đảng Bảo thủ trước đây.", "eng": "The Labour candidate overturned the previous Conservative majority of 4000."}, {"viet": "Những phát minh khoa học mới nhất đã gây nghi ngờ đối với những lý thuyết trước đây.", "eng": "The latest scientific discoveries cast doubt on earlier theories."}, {"viet": "Chiều dài của căn phòng là mười mét, nó dài mười mét.", "eng": "The length of the room is ten metres, it is ten metres in length."}, {"viet": "Con sư tử cắn ngập răng vào cổ con linh dương.", "eng": "The lion buried its teeth in the antelope's neck."}, {"viet": "Việc mất đứa con trai đã làm cho bố mẹ hoà giải được với nhau.", "eng": "The loss of their son brought the parents together."}, {"viet": "Nhân chứng chính đã biến mất một cách đầy bí ẩn.", "eng": "The main witness had mysteriously disappeared."}, {"viet": "Các thị trường có nguy cơ suy sụp nhanh.", "eng": "The market threatened to go into free fall."}, {"viet": "Tủy sống nối liền với bó dây thần kinh lớn mà chúng ta gọi là dây sống.", "eng": "The medulla is connected with the big bundle of nerves we call the spinal cord."}, {"viet": "Tập đoàn quân sự kiên quyết dập tắt mọi sự chống đối chính trị.", "eng": "The military junta is determined to put down all political opposition."}, {"viet": "Khu nhà văn phòng hiện đại trông rất chướng mắt giữa những tòa nhà cũ kỹ trong vùng này.", "eng": "The modern office block sticks out like a sore thumb among the old buildings in the area."}, {"viet": "Sự kết hợp sắc đẹp với tài năng hài hòa nhất.", "eng": "The most successful marriage of beauty and talent."}, {"viet": "Bản nhạc thật sự làm cho tôi hứng khởi.", "eng": "The music really stirred my blood."}, {"viet": "Chiếc cầu mới là một thắng lợi về mặt kỹ thuật.", "eng": "The new bridge is the triumph of engineering."}, {"viet": "Nhà máy mới sẽ hoạt động vào tháng ba.", "eng": "The new plant comes on stream in March."}, {"viet": "Tin về bệnh dịch làm dân chúng hoảng sợ.", "eng": "The news of the epidemic struck terror into the population."}, {"viet": "Tuyến xe phía bắc của xa lộ.", "eng": "The North bound carriage way of a motorway."}, {"viet": "Các cây sồi bị còi cọc vì thiếu nước.", "eng": "The oaks were dwarfed from lack of moisture."}, {"viet": "Viên tướng già đã bắt đầu viết hồi ký.", "eng": "The old general has started to write his memoirs."}, {"viet": "Cách duy nhất để xác định anh có thích cái gì không là thử nó.", "eng": "The only way to tell if you like something is by trying it."}, {"viet": "Người giám sát giải thích công việc cho những huấn sinh trẻ.", "eng": "The overseer was explaining the job to young trainees."}, {"viet": "Đảng đó kêu gọi các người ủng hộ hãy chứng tỏ công khai sự hậu thuẫn của mình.", "eng": "The party called upon its supporters to declare themselves."}, {"viet": "Người ta quan sát thấy bệnh nhân đi đứng khó khăn.", "eng": "The patient was perceived to have difficulty in standing and walking."}, {"viet": "Người đã giúp một cách hào phóng nhất cho dự án là người mù bẩm sinh.", "eng": "The person who gave most generously to the scheme has been blind from birth."}, {"viet": "Các trụ cột phải chống đỡ sức nặng của cái mái.", "eng": "The pillars have to support the weight of the roof."}, {"viet": "Máy bay sắp sửa hạ cánh.", "eng": "The plane is about to land."}, {"viet": "Vở kịch được diễn để thử nghiệm.", "eng": "The play was staged as an experiment."}, {"viet": "Cảnh sát xông vào qua cửa đi và tóm bọn đó.", "eng": "The police burst in through the door and arrested the gang."}, {"viet": "Cảnh sát cử người theo dõi ngôi nhà của kẻ bị tình nghi.", "eng": "The police put a watch on the suspect's house."}, {"viet": "Sự trưng bày lộng lẫy và quốc lễ khai mạc nghị viện.", "eng": "The pomp and ceremony of the State Opening of Parliament."}, {"viet": "Trạm điện phải đóng cửa sau khi một sai sót được phát hiện trong hệ thống làm mát.", "eng": "The power station was shut down after a fault was detected in the cooling system."}, {"viet": "Tổng thống gặp các phụ tá cao cấp của Nhà Trắng vào bữa điểm tâm.", "eng": "The President met with senior White House aides at breakfast."}, {"viet": "Diễn văn của Thủ tướng được tiếp đón bằng tiếng la ó phản đối và giễu cợt.", "eng": "The Prime Minister's speech was greeted with boos and jeers."}, {"viet": "Sự tư hữu hoá ngành công nghiệp thép.", "eng": "The privatisation of the steel industry."}, {"viet": "Đoạn mở đầu'của'Những truyện ở Canterbury'.", "eng": "The Prologue to the'Canterbury Tales'."}, {"viet": "Sự trừng phạt phải phù hợp với lỗi lầm.", "eng": "The punishment should correspond to the offence."}, {"viet": "Chân con thỏ bị vướng vào bẫy.", "eng": "The rabbit's foot was caught in a snare."}, {"viet": "Phần cuối đuôi chiếc máy bay.", "eng": "The rearmost section of the aircraft."}, {"viet": "Phạm vi rộng lớn đặc biệt của kiến thức ông ta.", "eng": "The remarkable breadth of his learning."}, {"viet": "Kết quả của thí nghiệm là đáng hài lòng.", "eng": "The result of the experiment was satisfactory."}, {"viet": "Dòng sông vỡ bờ và làm ngập thành phố.", "eng": "The river burst its banks and flooded the town."}, {"viet": "Vùng đồi trọc nhấp nhô đặc trưng cho vùng này ở nước Anh.", "eng": "The rolling downs that characterize this part of England."}, {"viet": "Luật của câu lạc bộ không cho phép hút thuốc.", "eng": "The rules of the club do not permit smoking."}, {"viet": "Các viên chức cấp dưới sẽ không ăn không ngồi rồi.", "eng": "The satraps will not sit idly by."}, {"viet": "Dân Xcôtlen là dân thích mạo hiểm và có óc sáng tạo.", "eng": "The Scots are an adventurous and inventive people."}, {"viet": "Người lính gác hô Ai đi đó?", "eng": "The sentry gave the challenge, who goes there?"}, {"viet": "Chiếc tàu này có thủy thủ đoàn gồm 57 người không kể các sĩ quan.", "eng": "The ship has a crew of 57 exclusive officers."}, {"viet": "Cửa hàng nhận séc, thẻ tín dụng, tất nhiên không quên ( tức là cũng nhận cả ) tiền mặt.", "eng": "The shop will accept cheques and credit cards, not forgetting ( ie and also ) cash, of course."}, {"viet": "Số ít là man, số nhiều là men.", "eng": "The singular is man, the plural is men."}, {"viet": "Những đường nét mềm mại của một công trình điêu khắc.", "eng": "The smooth contours of a sculpture."}, {"viet": "Bài hát có điệu nhịp nhàng.", "eng": "The song has a good beat."}, {"viet": "Bài nói được dịch lại bằng ngôn ngữ ra hiệu cho người điếc.", "eng": "The speech was interpreted in sign language for the hearing impaired."}, {"viet": "Bức tượng của nữ đồng trinh Mary được dựng trong một mỏm đất cao trong khu đất nhà thờ.", "eng": "The statue of the Virgin Mary was erected in a grove in the church grounds."}, {"viet": "Đường phố vồng cao hẳn lên ở điểm đó.", "eng": "The street is quite steeply cambered at this point."}, {"viet": "Tiếng động bất thình lình trong bụi cây làm con ngựa hoảng hốt.", "eng": "The sudden noise in the bushes startled her horse."}, {"viet": "Sự bố trí các ghế có hệ thống.", "eng": "The systematic arrangement of the chairs."}, {"viet": "Thầy giáo đã bảo nó ở lại sau khi hết tiết học.", "eng": "The teacher told him to stay behind after class."}, {"viet": "Những điều khoản trong hiệp định phải được hoàn toàn rõ ràng để không thể có khả năng hiểu sai.", "eng": "The terms of the agreement must be quite explicit, so that there is no possibility of misapprehending them."}, {"viet": "Nguy cơ chiến tranh ngày càng đến gần hơn.", "eng": "The threat of war is coming steadily nearer to home."}, {"viet": "Thành phố có được một nhà trưng bày mỹ thuật nổi tiếng thế giới.", "eng": "The town boasts a world-famous art gallery."}, {"viet": "Các du khách bị quyến rũ bởi vẻ đẹp của phong cảnh.", "eng": "The travellers were beguiled by the beauty of the landscape."}, {"viet": "Hai công ty đó đã sát nhập với nhau để tạo ra hiệu quả lớn hơn.", "eng": "The two companies consolidated for greater efficiency."}, {"viet": "Người được nói dưới đây là nhân chứng kí vào bản hợp đồng này.", "eng": "The under mentioned is witness to this contract."}, {"viet": "Giá trị của bức vẽ được ước tính vài nghìn bảng.", "eng": "The value of the painting was estimated at several thousand pounds."}, {"viet": "Sự hưởng thụ khoái lạc của một chầu tắm nước nóng.", "eng": "The voluptuous enjoyment of a hot bath."}, {"viet": "Cách ăn mặc của các khách du lịch xúc phạm đến các tiêu chuẩn nghiêm chỉnh của địa phương.", "eng": "The way tourists dress offends local standards of propriety."}, {"viet": "Cả làng đứng lên phản đối kịch liệt cái ý đồ xây dựng một sân bay gần đó.", "eng": "The whole village is up in arms about the proposal to build an airport nearby."}, {"viet": "Các phụ nữ này kiếm sống bằng nghề dệt.", "eng": "The women earn their living by weaving."}, {"viet": "Đô vật đã quật được đối thủ của mình ngã xuống ( thảm ).", "eng": "The wrestler succeeded in throwing his opponent ( to the canvas )."}, {"viet": "Anbom đầu tiên của họ được thu đầu tiên năm 1991.", "eng": "Their debut album was recorded in 1991."}, {"viet": "Tổng thống của họ ngang với thủ tướng của chúng ta.", "eng": "Their president is the counterpart of our Prime Minister."}, {"viet": "Vậy thì hãy nói với cô ấy bằng ánh mắt của mình.", "eng": "Then tell her with your eyes."}, {"viet": "Có một nhà hàng Nhật rất ngon nằm trên đường Princess.", "eng": "There's a nice Japanese restaurant on Princess Street."}, {"viet": "Không có lửa làm sao có khói, người ta thường nói như vậy.", "eng": "There's no smoke without fire, as the saying goes."}, {"viet": "Có rất nhiều sách du lịch mới.", "eng": "There are a lot of new travel books around."}, {"viet": "Có giấy, bút chì v. v. trên bàn.", "eng": "There are papers, pencils etcetera on the table."}, {"viet": "Dường như không còn bóng đèn dự phòng.", "eng": "There doesn't seem to be a spare light bulb."}, {"viet": "Đang có sự thiếu lòng tin đối với chính phủ.", "eng": "There is a lack of confidence in the Government."}, {"viet": "Không hề có tiền lệ cho loại hoạt động như thế.", "eng": "There is no precedent for such an action."}, {"viet": "Không cần để lại kết số tối thiểu nào cả.", "eng": "There's no minimum balance required."}, {"viet": "Sau nhận xét hớ hênh của bà ta đã có một sự im lặng gây lúng túng, nhưng bà ta đã có thể cười xoà.", "eng": "There was an embarrassing silence after her indiscreet remark but she was able to laugh it off."}, {"viet": "Có nhiều kẻ cơ hội và một số ít người sống theo nguyên tắc đạo đức.", "eng": "There were many opportunists and few men of principle."}, {"viet": "Những cuốn sách này được bán cho trường học nhưng những người sử dụng thực sự lại là sinh viên.", "eng": "These books are sold to schools, but the end users are the students."}, {"viet": "Những sản phẩm mới này bán rất chạy.", "eng": "These new products have had a quick turnover."}, {"viet": "Tất cả họ đang nhìn ngắm mình Cậu tự mình đánh lừa mình rồi.", "eng": "They're all watching me You flatter yourself."}, {"viet": "Họ đã tăng tốc độ sản xuất loại xe hơi mới.", "eng": "They've speeded up production of the new car."}, {"viet": "Họ âm mưu làm cho bà ta được bầu làm người lãnh đạo.", "eng": "They are scheming to get her elected as leader."}, {"viet": "Họ vẫn có thể tới ngân hàng nếu họ thiếu tiền.", "eng": "They can always go to bank if they need more money."}, {"viet": "Chúng đã biến khỏi mặt đất.", "eng": "They disappeared off the face of the earth."}, {"viet": "Chúng cho ta lông làm vải mềm.", "eng": "They furnish hair that can be made into soft cloth."}, {"viet": "Chúng chưa bao giờ sống ở nơi nào khác cả.", "eng": "They have never lived anywhere else."}, {"viet": "Họ xem tranh của chúng tôi, nhưng họ không cho chúng tôi xem tranh của họ.", "eng": "They looked at our pictures, but they didn't show us theirs."}, {"viet": "Họ qua nhiều giờ trong thảo luận học tập nghiêm chỉnh.", "eng": "They passed the hours in learned discourse."}, {"viet": "Họ cai trị chính họ bằng sự lựa chọn người cai trị của họ và người lập pháp của họ.", "eng": "They rule themselves by choosing their rulers and their law-makers."}, {"viet": "Chúng ăn trộm tất cả mọi thứ ở trong nhà.", "eng": "They stole every mortal thing in the house."}, {"viet": "Họ theo dõi thấy cô ấy dần dần yếu đi khi bệnh tăng lên.", "eng": "They watched her gradually weaken as the disease progressed."}, {"viet": "Họ không miễn cưỡng kiếm một chút tiền thêm.", "eng": "They were not averse to making a little extra money."}, {"viet": "Bọn trộm đã nẫng đi tất cả hàng hoá ở nhà khi bị cháy.", "eng": "Thieves snaffled all the goods from the burnt warehouse."}, {"viet": "Công ty kinh doanh này sẽ xin được vay tiền.", "eng": "This business firm would apply for a loan."}, {"viet": "Quyển từ điển này đứng hàng đầu trong số những từ điển của Oxford dành cho người mới học.", "eng": "This dictionary is the flagship of Oxford's range of learners dictionaries."}, {"viet": "Ngôi nhà này có tất cả những tiện nghi hiện đại nhất.", "eng": "This house has an the latest conveniences."}, {"viet": "Đây là hệ quả không thể tránh được của quyết tâm đi đến thành công của anh ấy.", "eng": "This is the inevitable corollary of his determination to succeed."}, {"viet": "Người này được tất cả những ai quen biết đều yêu quí.", "eng": "This man was beloved of all who knew him."}, {"viet": "Cái bút này thật vô dụng: nó không viết được cho tử tế nữa.", "eng": "This pen is a dead loss: it just won't write properly."}, {"viet": "Việc nghiên cứu này chủ yếu liên quan tới việc phòng bệnh.", "eng": "This search is concerned primarily with prevention of the disease."}, {"viet": "Sự cố khó chịu này đã làm giảm sự thích thú của chúng tôi buổi tối hôm đó.", "eng": "This unpleasant incident detracted from our enjoyment of the evening."}, {"viet": "Mặc dầu đã gần hai mươi tuổi mà anh ta vẫn hầu như mù chữ.", "eng": "Though nearly twenty he was barely literate."}, {"viet": "Tom đã để râu từ khi chúng tôi gặp cậu ấy lần trước.", "eng": "Tom has sprouted a beard since we saw him last."}, {"viet": "Dưới kính hiển vi, những con vật bé li ti này trông giống như những viên ngọc.", "eng": "Under a microscope these tiny animals look like jewels."}, {"viet": "Chán nản khi biết nghệ sĩ múa yêu thích của cô ấy dùng ma tuý.", "eng": "Was dismayed to learn that her favorite dancer used drugs."}, {"viet": "Chúng ta sẽ hoàn thành dự án đúng thời hạn nếu không còn có những xáo trộn nào nữa.", "eng": "We'll finish the project on time if there are no more foul-ups."}, {"viet": "Năm nay chúng tôi sẽ đi Pháp để nghỉ.", "eng": "We're going to France for our holidays this year."}, {"viet": "Chúng tôi nghèo hơn từ khi Mary thôi việc.", "eng": "We're worse off since Mary stopped working."}, {"viet": "Chúng ta đã thử cách thuyết phục hoà bình, bước tiếp theo của chúng ta là gì?", "eng": "We've tried peaceful persuasion, what's our next move?"}, {"viet": "Chúng tôi đang quảng cáo món thịt bò hầm với bánh mì tỏi.", "eng": "We are featuring beef stew with garlic bread."}, {"viet": "Chúng tôi đợi nguồn cung cấp thực phẩm mới tới.", "eng": "We await the arrival of fresh medical supplies."}, {"viet": "Chúng ta có thể đi nếu ông muốn.", "eng": "We can go if you want."}, {"viet": "Chúng ta không thể cho nó thấy là nó sai lầm.", "eng": "We couldn't convince him of his mistake."}, {"viet": "Chúng tôi đã lái xe đi và về hao hết một bình xăng.", "eng": "We drove there and back on one the tankful of petrol."}, {"viet": "Chúng tôi gặp quá nhiều phiền phức trong chuyến đi du lịch vì tàu hoả đến chậm.", "eng": "We had a lot of bothers on the journey because the train was late."}, {"viet": "Thưa ông, bây giờ chúng tôi có bàn cho ông rồi.", "eng": "We have a table for you now, sir."}, {"viet": "Chúng ta phải lôi cuốn khách hàng thuộc giới trẻ.", "eng": "We have to attract younger customers."}, {"viet": "Chúng tôi nằm trên bãi cát, tắm mình trong ánh nắng.", "eng": "We lay on the beach, saturated in sunshine."}, {"viet": "Chúng tôi đã nhỡ máy bay vì bị kẹt trên xa lộ.", "eng": "We missed the plane through being held up on the motorway."}, {"viet": "Chúng ta phải cố đa dạng hoá chương trình học tập để thu hút được nhiều sinh viên hơn nữa.", "eng": "We must try to diversify the syllabus to attract more students."}, {"viet": "Chúng tôi vẽ lộ trình của con tầu trên bản đồ của chúng tôi.", "eng": "We plotted the ship's route on our map."}, {"viet": "Chúng tôi đã thu xếp ổn định cho bọn trẻ vào trường mới khi chúng tôi chuyển đến New York.", "eng": "We settled the children into new school when we moved to New York."}, {"viet": "Chúng tôi giám sát các nhân viên khác và công việc của họ.", "eng": "We supervise other men and their work."}, {"viet": "Chúng tôi muốn đi chơi dã ngoại, song phải huỷ bỏ cuộc đi vì trời mưa.", "eng": "We wanted to go for a picnic, but we had to scrub it because of the rain."}, {"viet": "Chúng tôi bị quở trách nghiêm khắc vì đến muộn.", "eng": "We were roundly told off for being late."}, {"viet": "Chúng tôi muốn tăng đơn đặt hàng ban đầu của chúng tôi và nhập khẩu nhiều hàng cô-tông theo tấm của Trung Quốc.", "eng": "We would like to increase our original order and import a lot of Chinese Cotton Piece Goods."}, {"viet": "Vậy, tôi đã nhấn số đó nhưng màn hình yêu cầu ông nhập số đó một lần nữa.", "eng": "Well, I pushed that number but the display board is asking you to enter the secret number one more time."}, {"viet": "À … nó tên là Tàu chiến 200.", "eng": "Well it's called Battleships Two Thousand."}, {"viet": "Thật đáng tiếc là anh không thể đi xem kịch với chúng tôi tối nay.", "eng": "What a pity that you can't come to the theatre with us tonight."}, {"viet": "Tôi có thể làm được điều gì cho ông?''Tôi muốn mua một pao táo'.", "eng": "What can I do for you?''I'd like a pound of apples, please'."}, {"viet": "Cái đó ( nó đến hay đi ) có gì quan trọng?", "eng": "What does it matter ( whether he comes or goes )?"}, {"viet": "Món ngỗng đỏ son như thế nào?", "eng": "What is the Carmine Goose like?"}, {"viet": "Những món hàng nào ở tạp hóa là miễn thuế?", "eng": "What items at the grocery store are tax-free?"}, {"viet": "Bây giờ là mấy giờ vậy, Tiểu Lý?", "eng": "What's the time, Xiao Li?"}, {"viet": "Tôi sẽ làm gì khi đến trạm dừng của tôi?", "eng": "What would I do when it's my stop?"}, {"viet": "Khi bị kích động anh ta có thể rất giận dữ.", "eng": "When he's roused, he can get very angry."}, {"viet": "Ngày Quốc Khánh của nước bạn là khi nào?", "eng": "When is your country's birthday or Independence Day?"}, {"viet": "Khi tôm gặp nguy hiểm, chất nước này đổ ra ngoài và tạo vết bẩn đục sáng ngời.", "eng": "When the shrimp are in danger, this water pours out and forms glowing clouds."}, {"viet": "Mỗi lần mua xăng, anh ta lại ghi vào bản công tác phí.", "eng": "Whenever he buys petrol, he puts it on his expense account."}, {"viet": "Lễ tốt nghiệp của bạn sẽ diễn ra ở đâu vậy?", "eng": "Where is your graduation ceremony taking place?"}, {"viet": "Ông muốn đến thư viện nào?", "eng": "Which one do you want to go to?"}, {"viet": "Một số nhà văn nổi tiếng ở đất nước của bạn là những ai?", "eng": "Who are some famous writers in your country?"}, {"viet": "Tại sao tôi cứ phải luôn luôn trả tiền cho các chuyến đi học của anh?", "eng": "Why am I always forking out money on your school trips?"}, {"viet": "Tại sao anh lại chọn riêng biến cố này để phê phán?", "eng": "Why have you singled out this incident for criticism?"}, {"viet": "Bạn làm điều này giúp tôi nhé?", "eng": "Will you do this for me?"}, {"viet": "Với một bước nhảy, cô ấy vượt qua suối.", "eng": "With a great leap, she crossed the stream."}, {"viet": "Tự hỏi đã mấy giờ rồi, đi đâu bây giờ, chuyện đó kéo dài đến bao giờ, tại sao ông ta lại đi.", "eng": "Wondered what time it was, where to go, how long it would last, why he had left."}, {"viet": "Ông thích chỗ ngồi gần cửa sổ hay cạnh lối đi?", "eng": "Would you like a window or aisle seat?"}, {"viet": "Vậy ông không phiền ngồi chung bàn với người khác chứ?", "eng": "Would you mind sharing a table, then?"}, {"viet": "Làm một cuốn từ điển là một công việc lâu dài và khó khăn nhưng chúng tôi đang nỗ lực hoàn thành.", "eng": "Writing a dictionary is a long and difficult business but we're getting there."}, {"viet": "Được, bây giờ chúng ta hãy lên xe lửa để tránh phải vội vã vào phút chót.", "eng": "Yes, let's get on board now to avoid the last minute rush."}, {"viet": "Anh sẽ làm bẩn tay nếu anh động vào chiếc máy đó.", "eng": "You'll dirty hands if you touch that machine."}, {"viet": "Anh cứ tự do đến nơi nào anh thích trên đất nước này.", "eng": "You're free to travel where you will in the country."}, {"viet": "Lần này thì anh đã thật sự làm hỏng hết tất cả.", "eng": "You've really loused things up this time."}, {"viet": "Bạn không thể đoán trước được cuộc chiến sẽ chấm dứt như thế nào.", "eng": "You can't foretell how the war will end."}, {"viet": "Các anh có thể đi sau khi tôi đã ghi tên của các anh.", "eng": "You can go once I have taken your names."}, {"viet": "Anh có thể ngửi thấy mùi rượu ở hơi thở của anh ta.", "eng": "You could smell the booze on his breath."}, {"viet": "Bạn có khiếu thẩm tuyệt vời về các các bà đấy!", "eng": "You have great taste in women!"}, {"viet": "Người ta sẽ học được một thứ tiếng tốt hơn nếu đến thăm đất nước nói ngôn ngữ ấy.", "eng": "You learn language better if you visit the country where it's spoken."}, {"viet": "Ông phải khai tất cả những gì ông đã kiếm được năm ngoái.", "eng": "You must declare all you have earned in the last year."}, {"viet": "Cậu cần phải khéo léo một tí mới thành đạt được trong công ty này.", "eng": "You need to be a bit of a politician to succeed in this company."}, {"viet": "Mẹ nên đứng lên và đi lòng vòng.", "eng": "You should get up and walk around."}, {"viet": "Anh nghĩ quá nhiều đến tiện nghi vật chất.", "eng": "You think too much of material comforts."}, {"viet": "Dù khoẻ đến đâu, anh cũng không di chuyển được tảng đá này.", "eng": "You won't move that stone, however strong you are."}, {"viet": "Người dẫn chương trình buổi diễn tối nay là Max Astor.", "eng": "Your host on tonight's show is Max Asto."}, {"viet": "Yu, con sẽ bày bát đĩa lên bàn được chứ?", "eng": "Yu, would you set the dishes on the table?"}]