[{"viet": "Một cuốn sách rất có thể cho là có tiếng nói quyết định về đề tài đó.", "eng": "A book which may fairly claim to be the last word on the subject."}, {"viet": "Ống khói bị tắc do lớp bồ hóng ngày càng đóng dầy thêm.", "eng": "A chimney blocked by an accretion of soot."}, {"viet": "Dụng cụ để cắt những hình cong.", "eng": "A contrivance for cutting curved shapes."}, {"viet": "Một cuộc tấn công dữ dội sâu vào lãnh thổ của đối phương.", "eng": "A deep thrust into the opponent's territory."}, {"viet": "Một chiếc áo đầm làm nổi rõ thân hình của cô ta.", "eng": "A dress that show off her figure well."}, {"viet": "Một bộ phim mà sẽ làm bạn thích thú vì hào hứng.", "eng": "A film to make you thrill with excitement."}, {"viet": "Người cha, mẹ không nuôi dưỡng đứa trẻ đó thì không phải là cha, mẹ nó.", "eng": "A genitor who does not parent the child is not its parent."}, {"viet": "Một nhóm người phản đối đã tụ tập bên ngoài văn phòng hãng.", "eng": "A group of protesters gathered outside the firm's office."}, {"viet": "Ngôi nhà nghỉ mát thật ra chỉ là một kho thóc được cường điệu lên thôi.", "eng": "A holiday cottage which is only a glorified barn."}, {"viet": "Biết tiếng Pháp là điều hết sức cần thiết.", "eng": "A knowledge of French is an absolute essential."}, {"viet": "Một ngọn đèn vẫn sáng trong phòng làm việc của anh ấy.", "eng": "A light was still burning in his study."}, {"viet": "Một bước tiến triển quan trọng trong việc nghiên cứu bệnh ung thư.", "eng": "A major breakthrough in cancer research."}, {"viet": "Một thiểu số người muốn có chiến tranh.", "eng": "A minority of the people want war."}, {"viet": "Chính phủ mới đã được hình thành.", "eng": "A new government was formed."}, {"viet": "Một cuốn sách nhỏ phát hành bởi Chính phủ kết hợp với Hội đồng Thể dục thể thao.", "eng": "A pamphlet produced by the Government in coordination with the Sports Council."}, {"viet": "Một quyển ảnh lưu niệm đám cưới.", "eng": "A pictorial record of the wedding."}, {"viet": "Một bảng Anh ngày nay mua được ít đồ hơn cách đây một năm.", "eng": "A pound today buys much less than it did a year ago."}, {"viet": "Một cuộc quan sát khắp đường phố đó cho thấy không ai có lai vãng.", "eng": "A quick survey of the street showed that no one was about."}, {"viet": "Một chiếc nhẫn có nạm một viên kim cương.", "eng": "A ring with a diamond in it."}, {"viet": "Một bằng cấp hạng hai về môn lịch sử.", "eng": "A second-class degree in history."}, {"viet": "Một ca sĩ với một giọng hát hết sức đặc sắc.", "eng": "A singer with a most unusual voice."}, {"viet": "Một con lợn nái sục mõm vào máng thức ăn.", "eng": "A sow with her snout in a trough of food."}, {"viet": "Một cuộc đình công xuất phát từ việc sa thải hai công nhân.", "eng": "A strike caused by the dismissal of two workers."}, {"viet": "Nhiệt độ 30 độ C trong bóng râm.", "eng": "A temperature of 30 độ C in the shade."}, {"viet": "Một sự bồn chồn vì trong trạng thái đề phòng và hồi hộp chờ đợi.", "eng": "A twitter of suspense and anticipation."}, {"viet": "Lá cờ trắng được dùng như dấu hiệu của sự đầu hàng.", "eng": "A white flag is used as a token of surrender."}, {"viet": "Nhận một tấm séc thay vì tiền mặt.", "eng": "Accept a cheque in lieu of cash."}, {"viet": "Điều chỉnh độ căng của dây đàn vĩ cầm.", "eng": "Adjust the tension of a violin string."}, {"viet": "Sau khi Copernicus hoàn tất công việc ở trường Đại học Cracow, ông đến ý để nghiên cứu.", "eng": "After Copernicus finished his work at the University of Cracow, he went to Italy to study."}, {"viet": "Sau sáu tháng đình công, các công nhân đó không còn chịu đựng được nữa.", "eng": "After six months on strike, the workers were at the end of their rope."}, {"viet": "Những kẻ quấy rối đang kích động nhân dân nổi dậy chống lại những người cầm quyền.", "eng": "Agitators were exciting the people to rebellion against their rulers."}, {"viet": "Tất cả quần áo của tôi đều có vẻ cũ hết rồi.", "eng": "All of my clothes look so old."}, {"viet": "Dẫu sao cũng có một phần sự thật trong những điều cô ấy nói.", "eng": "All the same, there's some truth in what she says."}, {"viet": "Nhớ luôn luôn cất bằng lái xe ở nơi an toàn.", "eng": "Always keep your driving licence in a safe place."}, {"viet": "Một nền kinh tế èo uột sẵn đã rơi vào tình trạng suy sụp mặc dù có sự can thiệp của nước ngoài.", "eng": "An already ailing economy precipitated into ruin despite foreign intervention."}, {"viet": "Một hoạt náo viên nhái các nhân vật nổi tiếng.", "eng": "An entertainer who impersonates celebrities."}, {"viet": "Một mưu mẹo tinh vi để làm cho bà ta ký vào chứng từ mà không đọc.", "eng": "An ingenious contrivance to get her to sign the document without reading it."}, {"viet": "Một cơ quan cái mà thối nát tận trong ruột.", "eng": "An organization that is rotten to the core."}, {"viet": "Và thực ra chúng tôi cũng có thể xây dựng nó cho anh.", "eng": "And we can actually build it for you."}, {"viet": "Bất cứ người nào dưới 18 tuổi đều không đủ tư cách hưởng quyền lợi.", "eng": "Any person under the age of 18 is ineligible for benefit."}, {"viet": "Có phải những người láng giềng đó đi nghỉ không?", "eng": "Are the neighbours away on holiday?"}, {"viet": "Ông định đi bằng xe buýt hay máy bay?", "eng": "Are you going by bus or by plane?"}, {"viet": "Con không thấy ân hận về chuyện con đã làm sao?", "eng": "Aren't you sorry about what you've done?"}, {"viet": "Về phần tôi, tôi sẽ chọn khó học màu.", "eng": "As for me, I would choose the color coordinating course."}, {"viet": "Khi bạn đi thuyền qua thác ghềnh và chỗ cạn, vượt thung lũng, các rừng tre và vách núi sương mù che khuất, bạn sẽ có cảm giác đang đi du lịch xuyên qua một cuộn tranh dài truyền thống của Trung Quốc.", "eng": "As you are sailing through rapids and shallows, passing valleys, bamboo groves and mist-shrouded crags, you will have the feelings of travelling through a long scroll of traditional Chinese painting."}, {"viet": "Một lần nọ, bác sĩ chỉ cho tôi một cơ may hồi phục năm mươi-năm mươi thôi đấy.", "eng": "At one time, the doctor gave me only a fifty-fifty chance to recover."}, {"viet": "Lòng tham làm kẻ giàu thậm chí muốn giàu thêm.", "eng": "Avarice makes rich people want to become even richer."}, {"viet": "Cẩn thận đừng chạm tự ái cô ta nhé.", "eng": "Be careful that you don't hurt her feelings."}, {"viet": "Bảo đảm xếp đặt chúng một cách ngay ngắn nhé.", "eng": "Be sure to place them correctly."}, {"viet": "Bị tống vào tù là sự suy thoái cuối cùng.", "eng": "Being sent to prison was the final degradation."}, {"viet": "Mù loà có thể là một sự đau khổ khủng khiếp.", "eng": "Blindness can be a terrible affliction."}, {"viet": "Mang hỗn hợp đem đun sôi rồi để nó riu riu mười phút.", "eng": "Bring the mixture to the boil, then let it simmer for ten minutes."}, {"viet": "Nhưng bạn có nghĩ là tôi đủ thông minh để theo học khoá học đó không?", "eng": "But do you think I'm smart enough to take the course?"}, {"viet": "Nhưng có người nói với tôi rằng đây đúng là xe buýt để đi.", "eng": "But somebody told me this was the right bus to take."}, {"viet": "Làm việc đó, anh ta đã cho thấy bản chất thật của mình.", "eng": "By doing that he showed his true self."}, {"viet": "Callas có giọng dài kỳ lạ.", "eng": "Callas's vocal range was astonishing."}, {"viet": "Người ta có thể nuôi chuột túi làm thú cưng không?", "eng": "Can people keep kangaroos as pets?"}, {"viet": "Cô có thể cho tôi một ít tiền lẻ được không?", "eng": "Can you give me some smaller change?"}, {"viet": "Anh có thể cho tôi biết thêm về điều đó không?", "eng": "Can you tell me something more about it?"}, {"viet": "Bắt ai trong lúc không đề phòng.", "eng": "Catch somebody in an unguarded moment."}, {"viet": "Trẻ con thì thích các đồ chơi mới, nhưng các đồ chơi rẻ tiền chẳng bao lâu cũng thành nhàm.", "eng": "Children love new toys, but the novelty will soon wear off."}, {"viet": "Có leo ngọn núi đó mới biết ai là người tài giỏi.", "eng": "Climbing that mountain will certainly sort out the men from the boys."}, {"viet": "Truyền hình thương mại là loại truyền thông hữu hiệu để quảng cáo.", "eng": "Commercial television is an effective medium for advertising."}, {"viet": "Connors bị thua trước Becker với tỷ số 3-l.", "eng": "Connors went down to Becker by three sets to one."}, {"viet": "Anh có thể đổi những đồng một hào này sang đồng nhân dân tệ giúp tôi được không?", "eng": "Could you change these coins of one Jiao into Yuan for me, please?"}, {"viet": "Cô có thể đánh thêm một bức thư nữa trước khi cô đi được không?", "eng": "Could you type one more letter before you go?"}, {"viet": "Bố ơi, cho đến bây giờ, con đang ăn ra sao?", "eng": "Dad, how am I doing so far?"}, {"viet": "Giao hàng khoảng 90 ngày sau khi nhận thư tín dụng.", "eng": "Delivery is about 90 days after the receipt of the L/C."}, {"viet": "Vô cùng khao khát đi du lịch theo giá rất cao.", "eng": "Developing a boundless appetite for high-ticket travel."}, {"viet": "Em có bỏ đường vào trong trà không?", "eng": "Did you put sugar in my tea?"}, {"viet": "Thay đổi dòng lưu thông xe cộ từ đường này qua đường khác.", "eng": "Divert traffic from one road to another."}, {"viet": "Họ cũng uống rượu phải không?", "eng": "Do they drink at the same time?"}, {"viet": "Bạn có thích xem những tiết mục tấu hài không?", "eng": "Do you go to stand-up comedy shows?"}, {"viet": "Anh có nghe tiếng kẻng giờ cơm tối không?", "eng": "Do you hear the dinner gong?"}, {"viet": "Có phiền gì anh không nếu tôi tắt đài?", "eng": "Do you mind if I switch the radio off?"}, {"viet": "Bạn có nghĩ rằng rất có thể như vậy không?", "eng": "Do you think that it is likely?"}, {"viet": "Sự hài hước của người Anh có khác với sự hài hước của người Bắc Mỹ không?", "eng": "Does British humor differ from North American humor?"}, {"viet": "Đừng nhờ nó làm chuyện đó-nó dở lắm.", "eng": "Don't ask him to do it-he hasn't a clue."}, {"viet": "Đừng quên đếm lại tiền thừa trả lại cho anh.", "eng": "Don't forget to count your change."}, {"viet": "Đừng hiểu nhầm tôi, ý tôi làm sao tôi nói vậy.", "eng": "Don't mistake me, I mean what I say."}, {"viet": "Đừng có dịch từng từ một.", "eng": "Don't translate word for word."}, {"viet": "Sử dụng sức mạnh dự trữ chưa khai thác.", "eng": "Draw on untapped reserves of strength."}, {"viet": "Mỗi người đã vượt qua việc quản lí theo kinh nghiệm để chuyển qua những thủ tục điều hành chuyên nghiệp hơn.", "eng": "Each has already move beyond seat-of-the-pants management to more professional operating procedures."}, {"viet": "Máy sẽ không chạy nếu không có dầu nhờn.", "eng": "Engines won't run without lubricants."}, {"viet": "Mặc dù con đã vặn đồng hồ báo thức.", "eng": "Even though I set the alarm clock."}, {"viet": "Lòng yêu nước quá khích có thể dẫn đến tính bài ngoại.", "eng": "Excessive patriotism can lead to xenophobia."}, {"viet": "Những biểu hiện chào mừng Nữ hoàng.", "eng": "Expressions of welcome to the Queen."}, {"viet": "Ban đêm nỗi sợ hãi lẩn quất đe dọa khắp thành phố.", "eng": "Fear stalks through the town at night."}, {"viet": "Tìm ra ai là người phạm tội.", "eng": "Find out where the guilt lies."}, {"viet": "Các đốm màu nâu và trắng trên ức của một con chim.", "eng": "Flecks of brown and white on a bird's breast."}, {"viet": "Từ neat ở dòng thứ 3 xin đọc là nest.", "eng": "For neat in line 3 read nest."}, {"viet": "Tiếng Pháp cũng là một ngôn ngữ chính thức, phải không?", "eng": "French is also an official language, isn't it?"}, {"viet": "Bối rối nhìn cảnh tượng kỳ lạ.", "eng": "Gazing in confusion at the strange sight."}, {"viet": "Lau sạch sẽ mặt của một đứa bé.", "eng": "Give a child's face a good sponging."}, {"viet": "Vinh quang đạt được trên chiến trường.", "eng": "Glory won on the field of battle."}, {"viet": "Đã quen với một công việc hàng ngày theo giờ hành chánh.", "eng": "Got into the groove of a nine-to-five job."}, {"viet": "Handel vay mượn nhạc của những nhà sáng tác khác.", "eng": "Handel borrowed music from other composers."}, {"viet": "Không bị ngăn cấm xem các hồ sơ đó.", "eng": "Have unhindered access to the files."}, {"viet": "Anh có bao giờ đến thăm một công trường xây dựng trước đây chưa?", "eng": "Have you ever visited a construction site before?"}, {"viet": "Bạn đã sử dụng thẻ ghi nợ để mua sắm ở nước bạn chưa?", "eng": "Have you used a debit card for shopping in your country?"}, {"viet": "Hắn ta có lẽ là con người khó chịu nhất mà tôi từng gặp.", "eng": "He's a probably the most exasperating man I've ever met."}, {"viet": "Ông ấy đã được thăng chức, và cũng khá kịp thời.", "eng": "He's been promoted, and about time too."}, {"viet": "Anh ta thường hay làm bắn nước bọt mỗi khi nói nhanh.", "eng": "He's inclined to spit when he talks quickly."}, {"viet": "Anh ta là người mà thỉnh thoảng tôi có trò chuyện và cười đùa.", "eng": "He's someone I have an occasional chat and joke with."}, {"viet": "Ông ấy rất ưa cái máy chữ cũ của tôi đến nỗi tôi phải tặng cho ông ta.", "eng": "He admired my old typewriter so much, I made him a present of it."}, {"viet": "Ông ấy giở mũ ra khi đám tang đi qua.", "eng": "He bared his head as the funeral procession passed."}, {"viet": "Anh ta bận nấu ăn tối.", "eng": "He busied himself cooking the dinner."}, {"viet": "Hắn đã khẳng định rằng nữ trang ăn cắp được tìm thấy trong nhà hắn là một tang vật gài.", "eng": "He claimed that the stolen jewellery found in his house was a plant."}, {"viet": "Anh ấy cắt bóng về đường biên.", "eng": "He cut the ball to the boundary."}, {"viet": "Anh ấy tạo một bầu không khí nồng nhiệt xung quanh mình.", "eng": "He diffuses enthusiasm all around him."}, {"viet": "Anh ta thích cái trò tán tỉnh các cô gái trong cơ quan.", "eng": "He enjoys flirting with the girls in the office."}, {"viet": "Ông ta cảm thấy quá xấu hổ nên không xin giúp đỡ.", "eng": "He felt too ashamed to ask for help."}, {"viet": "Anh ta sút trái banh một cú đẹp mắt.", "eng": "He gave the ball a tremendous boot."}, {"viet": "Ông ta chặt cành cây cho rời ra.", "eng": "He hacked away at the branch until it fell off."}, {"viet": "Nó đã nộp đơn xin thôi việc tuần vừa qua.", "eng": "He handed in his notice last week."}, {"viet": "Anh ta đã từ Leeds đến tận đây để kiếm việc.", "eng": "He has come all the way from Leeds to look for a job."}, {"viet": "Anh ta thắng hầu hết các trận đấu bằng cú nốc ao.", "eng": "He has won most of his fights by knock-outs."}, {"viet": "Anh ta là một thần tượng nhạc pop được dành cho và tạo ra cho thế hệ video.", "eng": "He is a pop icon designed and manufactured for the video generation."}, {"viet": "Anh ta chỉ mới ba mươi tuổi mà đã hoàn thành được bốn bộ phim.", "eng": "He is only thirty and already he has four films to his credit."}, {"viet": "Anh ta chỉ muốn được để yên.", "eng": "He just wants to be left in peace."}, {"viet": "Nó thích nghe những lời gièm pha đồng nghiệp nó.", "eng": "He likes to hear all the dirt about his colleagues."}, {"viet": "Anh ta hung hăng đâm bổ tới địch thủ của mình.", "eng": "He lunged wildly at his opponent."}, {"viet": "Ông ta phải thẳng thắn chấp nhận rằng mình không còn trẻ nữa.", "eng": "He must face up to the fact that he is no longer young."}, {"viet": "Ông ta có một cửa hàng rượu ở phố có nhiều hiệu ăn và cửa hàng.", "eng": "He owns a liquor store out on the strip."}, {"viet": "Nó giả vờ ốm để ở nhà.", "eng": "He pretended that he was ill so that he could stay at home."}, {"viet": "Anh ta bỏ đi và từ đó đến nay không thấy đâu hết.", "eng": "He ran away and hasn't been seen since."}, {"viet": "Ông ta không thừa nhận đứa con trai mình ( là người thừa kế hợp pháp ).", "eng": "He renounced his son ( as an unworthy heir )."}, {"viet": "Ông ta là người không bao giờ thay đổi ý kiến.", "eng": "He's a man of set opinions."}, {"viet": "Hắn bị ở tù về tội ăn cướp có vũ khí.", "eng": "He's done time for armed robbery."}, {"viet": "Anh ta thực sự không phải là loại người xấu.", "eng": "He's not a bad sort really."}, {"viet": "Anh ấy rất thích thể thao.", "eng": "He's very fond of sport."}, {"viet": "Anh ta vừa mới đến thì người ta bảo anh ta điều đó.", "eng": "He scarcely came when he was told that."}, {"viet": "Ông ta không nên ngồi yên chịu đựng những lời kết tội này.", "eng": "He should not sit down under these accusations."}, {"viet": "Anh ta nói tiếng Anh với sự biểu hiện kín đáo của giọng Pháp.", "eng": "He speaks English with suggestion of a French accent."}, {"viet": "Anh ta vẫn hy vọng nhận được thư nàng.", "eng": "He still hopes is still hoping for a letter from her."}, {"viet": "Anh ta đi bơi ở biển vào mùa đông-hẳn là anh ta bị ấm đầu!", "eng": "He swims in the sea in winter-he ought to have his head examined!"}, {"viet": "Nó bảo là tôi không qua được cuộc sát hạch nhưng tôi nhất định làm cho nó phải thừa nhận là nó đã nói sai.", "eng": "He told me I wouldn't pass the test but I'm determined to make him swallow his words."}, {"viet": "Anh ta cố gắng tránh để quá nhiều thời gian với đồng bào của mình khi anh ta sống ở nước ngoài.", "eng": "He tried to avoid spending too much time with his compatriots when he lived abroad."}, {"viet": "Khi ông ấy còn trẻ, ông ấy thường đá bóng vào các ngày thứ bảy.", "eng": "He used to play football every Saturday when he was young."}, {"viet": "Nó bị vợ xúi giục nên đã có những hoạt động phi pháp này.", "eng": "He was abetted in these illegal activities by his wife."}, {"viet": "Anh ta có tật lác mắt bẩm sinh.", "eng": "He was born with a squint."}, {"viet": "Nó chảy máu nhỏ giọt ( xuống sàn ).", "eng": "He was dripping blood ( on to the floor )."}, {"viet": "Anh ta bị hôn mê trong nhiều ngày, nhưng bây giờ anh ta đã ( hoàn toàn ) hồi tỉnh lại.", "eng": "He was in a coma for days, but now he's ( fully ) conscious again."}, {"viet": "Ông ta là một trong những nhà trí thức đáng kính nể nhất vào thời đại của mình.", "eng": "He was one of the most formidable intellects of his time."}, {"viet": "Anh ta ngồi vắt chân lên nhau.", "eng": "He was sitting cross-legged on the floor."}, {"viet": "Anh ta cố gắng trở nên có ích nhưng có phần cường điệu.", "eng": "He was trying to be helpful, but he rather overdid it."}, {"viet": "Anh ấy đi ra ngoài lấy cớ rằng mệt mỏi.", "eng": "He went out with the ostensible object of his tired."}, {"viet": "Ông ta đã mặc một chiếc áo khoác dày để chống lại cái lạnh cắt da.", "eng": "He wore a thick overcoat as a protection against the bitter cold."}, {"viet": "Hãy hâm sữa cho đến lúc nó vừa ấm ấm.", "eng": "Heat the milk until it is just lukewarm."}, {"viet": "Bài báo của cô ta đánh đổ lý luận của anh ta một cách xuất sắc.", "eng": "Her article brilliantly demolishes his argument."}, {"viet": "Công ty của cô ấy phái cô ấy đi Paris và thanh toán mọi khoản chi phí.", "eng": "Her company sent her to Paris and paid all her expenses."}, {"viet": "Mặt cô ấy xịu xuống khi tôi nói cho cô ấy biết tin.", "eng": "Her face fell when I told her the news."}, {"viet": "Cái mũ của cô nàng là một vật độc đáo làm bằng ruy băng và lông chim.", "eng": "Her hat was an amazing affair of ribbons and feathers."}, {"viet": "Cuốn tiểu thuyết mới nhất của bà ta kém các cuốn khác của bà ấy.", "eng": "Her latest novel isn't a patch on her others."}, {"viet": "Cuốn tiểu thuyết của cô ấy miêu tả cuộc sống ở thành phố London hiện đại ( như một thử thách ).", "eng": "Her novel depicts life in modern London ( as an ordeal )."}, {"viet": "Hành vi gần đây của cô ấy xác định ý nghĩ của tôi là ở cô ấy không hạnh phúc.", "eng": "Her recent behaviour confirms my opinion that she is not happy here."}, {"viet": "Tinh thần cô ta phấn chấn lên khi nghe tin ấy.", "eng": "Her spirits rose at the news."}, {"viet": "Tác phẩm của bà ấy nổi tiếng về lối viết ngắn gọn, súc tích.", "eng": "Her work is known for pithiness of style."}, {"viet": "Thuế cao làm cho xí nghiệp tư nhân phá sản.", "eng": "High taxes bleeding private enterprise."}, {"viet": "Thái độ của ông ta đối với những người thất nghiệp rất không công bằng.", "eng": "His attitude towards the unemployed is very one-sided."}, {"viet": "Con cái anh ấy rất thô bạo với đồ chơi của chúng.", "eng": "His children are very rough with their toys."}, {"viet": "Sau vụ đâm ô tô, bằng lái xe của nó đã bị thu hồi.", "eng": "His driving licence was revoked after the crash."}, {"viet": "Bố cậu ấy định cho cậu ta trở thành kỹ sư.", "eng": "His father meant him to be an engineer."}, {"viet": "Tình trạng tim của cậu ta hay làm cho cậu ấy thở hổn hển.", "eng": "His heart condition makes him short of breath."}, {"viet": "Đứa con trai lười biếng của ông ấy thật như đá đeo.", "eng": "His lazy son is a millstone round his neck."}, {"viet": "Sự giàu có mới tạo dựng được của ông ta thật xứng hợp với ông ấy.", "eng": "His new-found prosperity sits well on him."}, {"viet": "Quan điểm chính trị của anh ta có sắc thái cuồng tín.", "eng": "His political views have a savor of fanaticism."}, {"viet": "Viên thư kí của ông ta phải chịu đựng tính nết khó chịu của ông ta.", "eng": "His secretary has to bear the burnt of his temper."}, {"viet": "Khả năng thích hợp của anh ta đối với công việc đó bị nghi ngờ.", "eng": "His suitability for the post is open to question."}, {"viet": "Ý chí của anh ta đã giúp anh ta vượt qua được sự thử thách.", "eng": "His will carried him through the ordeal."}, {"viet": "Kem làm tại chỗ là một trong những món đặc biệt của chúng tôi.", "eng": "Home-made ice-cream is one of our specialties."}, {"viet": "Ta cùng đi xem phim nhé?", "eng": "How about going to a movies?"}, {"viet": "Sao anh lại có thể làm một việc như vậy? Anh không biết ngượng à?", "eng": "How could you do such a thing? Have you no shame?"}, {"viet": "Ông muốn rút tiền bằng cách nào, bằng ngân phiếu hay khi xuất trình sổ gửi tiền của ông?", "eng": "How do you like to make drawings, by cheque or upon presentation of your deposit book?"}, {"viet": "Thịt này treo bao lâu rồi?", "eng": "How long has this meat been hung for?"}, {"viet": "Bao nhiêu thành viên mới đủ số đại biểu cần thiết?", "eng": "How many members make a quorum?"}, {"viet": "Hoá đơn của chúng tôi bao nhiêu vậy?", "eng": "How much does our bill come to?"}, {"viet": "Anh ta chơi đàn violon hay tuyệt.", "eng": "How well he plays the violin."}, {"viet": "Những người hâm mộ cuồng loạn tại một buổi trình diễn nhạc rốc.", "eng": "Hysterical fans at a rock concert."}, {"viet": "Tôi rất muốn ở lại nếu không làm phiền anh quá.", "eng": "I'd like to stay if it's not too much of an imposition ( on you )."}, {"viet": "Tôi sẽ bảo thư ký của tôi gửi e-mail cho anh tất cả những chi tiết.", "eng": "I'll get my secretary to e-mail you with all the details."}, {"viet": "Tôi sẽ đến đón anh ở khách sạn lúc tám giờ.", "eng": "I'll pick you up at the hotel at eight o'clock."}, {"viet": "Tôi e rằng tôi không thể nói thay Geoff, tuy nhiên.", "eng": "I'm afraid I can't speak for Geoff, but."}, {"viet": "Tôi cởi hết quấn áo và tắm.", "eng": "I'm fixing to air my pores and take a shower."}, {"viet": "Tôi vội khủng khiếp nên tôi không thể ngưng được.", "eng": "I'm in a dreadful rush so I can't stop."}, {"viet": "Tôi sẽ không chịu thêm những lời lăng mạ của anh nữa!", "eng": "I'm not taking any more of your insults!"}, {"viet": "Xin lỗi tôi đã làm anh đau.", "eng": "I'm sorry I hurt you I didn't mean to."}, {"viet": "Tôi đã mệt vì phải chiều lòng mọi người.", "eng": "I'm tired of trying to please everyone."}, {"viet": "Suốt buổi sáng tôi đã làm việc cực lực bên lò bếp nóng.", "eng": "I've been laboring away over a hot stove all morning."}, {"viet": "Tôi có tất cả các đĩa hát của cô ta nhưng tôi chưa hề thấy con người thực của cô.", "eng": "I've got all her records but I've never seen her in the flesh."}, {"viet": "Tôi chưa bao giờ nghe một người nào đọc diễn văn vụng về đến thế.", "eng": "I've never heard anyone so inept at making speeches."}, {"viet": "Tôi sẽ nói chuyện với giám đốc và báo cho ông biết ngay.", "eng": "I'll talk to the manager and tell you soon."}, {"viet": "Tôi thắc mắc không biết làm sao anh lại có ý nghĩ như vậy?", "eng": "I always thought you were a nurse?"}, {"viet": "Tôi chán nghe anh ta dạy đời quá rồi.", "eng": "I am tired of listening to you preach at me."}, {"viet": "Tôi đã bắt đầu bố cục cốt truyện các tiểu thuyết vào khoảng thời gian tôi tập đọc.", "eng": "I began plotting novels at about a time I learnt to read."}, {"viet": "Tôi không đủ khả năng để bảo quản và sửa chữa cả một toà nhà lớn và vườn.", "eng": "I can't afford the upkeep of a large house and garden."}, {"viet": "Tôi không thể nào mà cho anh mượn một số tiền nhiều như thế được.", "eng": "I can't possibly lend you so much money."}, {"viet": "Tôi nghe tiếng máy bay trên đầu.", "eng": "I can hear a plane flying over head."}, {"viet": "Tôi không thể xóa được nó.", "eng": "I can't get it to rub out."}, {"viet": "Sáng nay tôi không sao làm cho ô tô chạy được.", "eng": "I could't get the car started this morning."}, {"viet": "Tôi rất muốn giảm vài pao.", "eng": "I'd definitely like to lose a few pounds."}, {"viet": "Tôi đã không uống bất cứ thứ gì ở tủ lạnh.", "eng": "I did not drink anything from the refrigerator."}, {"viet": "Tôi không cho sách là những chuyện ngông cuồng.", "eng": "I do not regard books as extravagances."}, {"viet": "Tôi không biết tại sao nhưng tôi rất thèm món cà-ri.", "eng": "I don't know why but I have a craving for green curry."}, {"viet": "Tôi cho rằng họ không cần được giúp đỡ nhưng dẫu sao tôi cũng cứ đề nghị.", "eng": "I don't think they need help, but I think I should offer anyway."}, {"viet": "Tôi không quan tâm tí nào tới những gì họ nghĩ.", "eng": "I don't care two pence what they think."}, {"viet": "Tôi uống cà phê đen, trong khi đó thì anh ấy lại thích cà phê pha kem.", "eng": "I drink black coffee while he prefers it with cream."}, {"viet": "Tôi thấy đau ở đây mỗi khi uống cái gì đó lạnh.", "eng": "I feel pain here whenever I drink something cold."}, {"viet": "Tôi nhận thấy toàn bộ đề tài đó rất nhàm chán.", "eng": "I find the whole thing very boring."}, {"viet": "Tôi đi xuôi theo dòng sông bằng ca nô.", "eng": "I go down the river in my canoe."}, {"viet": "Tôi đã nhận được bức thư của người từng sở hữu cửa hàng ở góc phố đó.", "eng": "I had a letter from the person who used to own the corner shop."}, {"viet": "Tôi đã phải rút ra khỏi cuộc đua maratông vì bị cảm lạnh nặng.", "eng": "I had to scratch from the marathon because of a bad cold."}, {"viet": "Tôi đã được nghe nhiều điểm tốt của anh trong công việc.", "eng": "I have been hearing favorable remarks of your work."}, {"viet": "Tôi đã để ý thấy có vài nhân viên đến làm việc chậm một giờ, tôi sẽ không nêu tên ai cả, nhưng ai có tật thì giật mình..", "eng": "I have noticed some employees coming to work an hour late, I shall name no names, but it the cap fits.."}, {"viet": "Tôi không học tiếng Pháp lâu rồi, nên tôi chỉ dùng được một vài từ.", "eng": "I haven't been learning French for long, so I can only manage a few words."}, {"viet": "Tôi nghe nói một câu nổi tiếng rằng ” Sau khi đến thăm núi Hoàng Sơn, sẽ không còn ngọn núi nào khác làm bạn quan tâm nữa ”.", "eng": "I heard a famous saying which goes After visiting Mount Huangshan, no other mountains will arouse your interest any more."}, {"viet": "Tôi mong cái bùa này sẽ đem lại may mắn cho chị.", "eng": "I hope this charm will bring you luck."}, {"viet": "Tôi chỉ nghĩ rằng bây giờ tôi lạc hậu rồi.", "eng": "I just guess I'm kind of old-fashioned."}, {"viet": "Tôi biết là anh không tin tôi nhưng xin hãy nghe tôi nói cho hết!", "eng": "I know you don't believe me but please hear me out!"}, {"viet": "Tôi thích kiểu tóc mới của bạn.", "eng": "I like your new-look hair-style."}, {"viet": "Tôi sẽ thu xếp cho anh một chỗ ở.", "eng": "I'll fix you up with a place to stay."}, {"viet": "Tôi sẽ cho anh ta biết ngay khi tôi gặp anh ấy.", "eng": "I'll tell him as soon as I see him."}, {"viet": "Tôi đang suy nghĩ nên đi đâu trong ngày nghỉ.", "eng": "I'm debating where to go on holiday."}, {"viet": "Tôi đang ngóng chờ bạn đây.", "eng": "I'm looking forward to seeing you."}, {"viet": "Tôi vẫn còn đang phác thảo chương đầu tiên.", "eng": "I'm still drafting the first chapter."}, {"viet": "Tôi đã gặp gỡ quá nhiều người trong bữa tiệc đó đến nỗi giá có gặp lại họ tôi cũng không nhận ra được một nửa trong số họ.", "eng": "I met so many people at the party that I wouldn't know half of them again."}, {"viet": "Tôi phải vận động để giãn bắp thịt.", "eng": "I must take some exercise and loosen up my muscles."}, {"viet": "Tôi chưa bao giờ nghĩ đến việc cô ta sẽ quyết định điều đó!", "eng": "I never thought she'd decide that!"}, {"viet": "Tôi đã xách nhầm túi của bà.", "eng": "I picked up your bag by mistake."}, {"viet": "Tôi đọc nó suốt ngày đêm.", "eng": "I read it night and day."}, {"viet": "Tôi hồi tưởng cái ngày định mệnh đó nhiều lần trong trí óc tôi.", "eng": "I relived that fateful day over and over in my mind."}, {"viet": "Tôi đã nhìn thấy cửa địa ngục sâu thăm thẳm.", "eng": "I saw the opening maw of hell."}, {"viet": "Tôi sẽ viết thơ cho anh nữa vào cuối tháng.", "eng": "I shall write to you again at the end of the month."}, {"viet": "Tôi bóp mạnh cái chai và nước chấm toé ra.", "eng": "I squeezed the bottle and the sauce squirted out."}, {"viet": "Tôi nói chuyện với nhiều người trong giới văn nghệ sĩ, nhà văn, diễn viên múa và nhà làm phim.", "eng": "I talked to many artistic people writers, dancers, and film makers."}, {"viet": "Tôi nghĩ nó rất hữu ích.", "eng": "I think it's very useful."}, {"viet": "Tôi cho rằng đưa tin 24 tiếng trên truyền hình về cuộc bầu cử là quá mức cần thiết.", "eng": "I thought 24 hours of television coverage of the election verge on overkill."}, {"viet": "Tôi đã gạt anh ấy nghĩ rằng tôi đã làm việc suốt ngày ở đó.", "eng": "I tricked him into thinking I was there all day working."}, {"viet": "Tôi thường đi đường M6 khi đi tới Scotland.", "eng": "I usually take the M6 when I go to Scotland."}, {"viet": "Tôi muốn đăng ký một vé tới Paris.", "eng": "I want to book a ticket to Paris."}, {"viet": "Tôi báo trước cho anh biết, tôi bắt đầu hết kiên nhẫn với anh rồi đó.", "eng": "I warn you, I'm beginning to lose my patience with you."}, {"viet": "Họ phun khí tê vào khi họ nhổ răng cho tôi.", "eng": "I was given gas when they pulled my tooth out."}, {"viet": "Tôi thường xuyên bị mắng mỏ ở trường vì không làm bài tập ở nhà.", "eng": "I was regularly bawled out at school for not doing homework."}, {"viet": "Tôi rất ghen với chiếc xe đạp mới của Sarah.", "eng": "I was very jealous of Sarah's new bicycle."}, {"viet": "Lúc đó tôi sẽ đến lấy nó.", "eng": "I will pick it up then."}, {"viet": "Tôi thắc mắc anh ấy đã học ảo thuật bằng cách nào?", "eng": "I wonder how he learned to do it?"}, {"viet": "Tôi cho rằng ca mổ sẽ kéo dài khoảng một tiếng đồng hồ.", "eng": "I would imagine the operation will take about an hour."}, {"viet": "Tôi sẽ không ủng hộ một kế hoạch như thế.", "eng": "I would not lend countenance to such a plan."}, {"viet": "Nếu một người muốn cuối xuống nhặt một cái đinh, não truyền thông điệp đến các cơ lưng, nó cũng truyền thông điệp đến các cơ ở tay và ngón tay.", "eng": "If a person wishes to stoop over to pick up a pin, the brain sends messages to muscles back, It also sends messages to muscles in the arms and fingers."}, {"viet": "Nếu như có thể đánh bạo mà đoán, tôi sẽ nói rằng cô ta khoảng 30.", "eng": "If I might hazard a guess, I'd say she was about 30."}, {"viet": "Nếu như sợi tóc đứt, Damocles sẽ bị giết chết.", "eng": "If the hair should break, Damocles would be killed."}, {"viet": "Xin anh vui lòng để lại tên, chúng tôi sẽ liên hệ càng sớm càng tốt.", "eng": "If would care to leave your name, we'll get in touch as soon as possible."}, {"viet": "Nếu chia 39 cho 3, câu trả lời là 13.", "eng": "If you divide 39 by 3, the answer is 13."}, {"viet": "Nếu anh nâng cái ghế lên, tôi sẽ lau tấm thảm phía dưới.", "eng": "If you lift up the chair I'll clean the carpet underneath it."}, {"viet": "Nếu anh muốn sụt cân, đây là một số điều cần làm và cần tránh.", "eng": "If you want to lose weight, here are some do's and don'ts."}, {"viet": "Trong trò kéo co, các đối thủ kéo hết sức mình.", "eng": "In a tug-of-war, the competitors pull as hard as they can."}, {"viet": "Thực ra, hiện nay con đang đọc một cuốn sách hay.", "eng": "In fact I'm reading a good book now."}, {"viet": "Có chỗ nó phình ra giống như một cái hồ rộng.", "eng": "In one spot it spreads out so that it is like a broad lake."}, {"viet": "Buổi tối, anh ta vùi đầu vào sách.", "eng": "In the evenings he buries himself in his books."}, {"viet": "Trong cuốn từ điển này, những chữ viết hoa được dùng để chỉ dẫn ( bạn ) tham khảo một từ qua từ khác.", "eng": "In this dictionary, capital letters are used to cross ( you ) refer from one word to another."}, {"viet": "Tiêm chủng cho súc vật là công việc hàng ngày của một bác sĩ thú y.", "eng": "Injecting animals is all in a day's work for a vet."}, {"viet": "Có thể gặp ông Smith ngay bây giờ được không?", "eng": "Is it possible to see Mr. Smith right now?"}, {"viet": "Có nơi nào để anh có thể giới thiệu để luyện tập thân thể không?", "eng": "Is there any place you recommend to workout?"}, {"viet": "Sẽ là điều kỳ diệu nếu anh ta bỏ thuốc lá!", "eng": "It'll be a miracle if he ever gives up smoking!"}, {"viet": "Chúng ta ăn bây giờ hay lát nữa đối với tôi cũng thế thôi.", "eng": "It's all one to me whether we eat now or later."}, {"viet": "Thật dễ tin ở những điều báo chí nói.", "eng": "It's easy to be led astray by the reports in the papers."}, {"viet": "Như xe tải nhỏ có chỗ ngủ.", "eng": "It's like a small truck that you can sleep in."}, {"viet": "Nó khác xa với màu mình đang đi tìm.", "eng": "It's nowhere near the colour I'm looking for."}, {"viet": "Chính những người nhỏ bé chịu thua thiệt bởi những chính sách này chứ không phải những người giàu có.", "eng": "It's the little people who get hurt by these policies, not wealthy."}, {"viet": "Họ sửng sốt thấy tôi ở đây.", "eng": "It amazed them to know that I was here."}, {"viet": "Chúng tôi được biết là anh đã lừa đảo công ty.", "eng": "It has come to our knowledge that you have been cheating the company."}, {"viet": "Chúng ta phải nhanh chóng có quyết định, đó là một điều cấp bách.", "eng": "It is imperative that we make a quick decision."}, {"viet": "Nó là quần thể những công trình kiến trúc lịch sử lớn nhất còn tồn tại ở Trung Quốc và là trung tâm của Bắc Kinh.", "eng": "It is the largest surviving complex of historical buildings in China and the heart of Beijing."}, {"viet": "Ắt hẳn là bạn đã vất vả lắm.", "eng": "It must have been a lot of hard work."}, {"viet": "Nó nằm ở phía bên phải đường.", "eng": "It's on the right side of the street."}, {"viet": "Chắc là dễ thương rồi, 55 đô một ngày mà.", "eng": "It should be at $ 55 a day."}, {"viet": "Phải mất một thời gian dài anh ta mới dần dần tới gần cái điều anh ta thật sự muốn nói.", "eng": "It was a long time before he worked around to what he really wanted to say."}, {"viet": "Ước muốn lúc lâm chung của bà ấy là được chôn bên cạnh chồng.", "eng": "It was her dying wish to be buried next to her husband."}, {"viet": "Nó cũng là kỳ nghỉ hào hứng nhất.", "eng": "It was the most exciting as well."}, {"viet": "Báo tin cho họ lúc này có thể là không có lợi.", "eng": "It would be inexpedient to inform them at this stage."}, {"viet": "Jennings phủ nhận tội đồng loã trong vụ giết người.", "eng": "Jennings denied complicity in the murder."}, {"viet": "Tháng 7 và 8 trời cực kỳ nóng.", "eng": "July and August are extremely hot."}, {"viet": "Phụ nữ cưỡi ngựa theo cách ngồi dạng chân hoặc ngồi một bên yên.", "eng": "Ladies ride horses by sitting astride or side-saddle."}, {"viet": "Để tôi xem lại và tối nay về nhà tôi sẽ gọi điện cho bạn.", "eng": "Let me check and I'll call you at home tonight."}, {"viet": "Nghe đây thằng nhóc, đừng có giở trò sai bảo tao.", "eng": "Listen, son, don't start giving me orders."}, {"viet": "Có nhiều phụ nữ điều khiển thiết bị.", "eng": "Many of the women operate equipment."}, {"viet": "Marx không bao giờ tách con người khỏi môi trường xã hội của anh ta.", "eng": "Marx never dissociated man from his social environment."}, {"viet": "Tôi xin mạn phép yêu cầu ông phát biểu vài lời sau bữa ăn tối được không?", "eng": "May I prevail on you to make a speech after dinner?"}, {"viet": "Mẹ ơi, mẹ có đồ gì cần ủi không?", "eng": "Mom, do you have anything that needs ironing?"}, {"viet": "Mẹ bảo bữa trưa đã dọn ra rồi thế là tất cả nhào đến bàn.", "eng": "Mother said lunch was ready and there was a mad dash for the table."}, {"viet": "Cái răng sâu của tôi sáng nay làm tôi đau quá.", "eng": "My bad tooth is really giving me gyp this morning."}, {"viet": "Bố tôi không có ở nhà sáng nay nhưng đến chiều ông ấy sẽ về.", "eng": "My father is out this morning, but he will be in this afternoon."}, {"viet": "Đầu óc tôi rối tung cả lên.", "eng": "My mind was in a complete haze."}, {"viet": "Kính của tôi bị vỡ, tôi cần phải mua cái khác.", "eng": "My spectacles are broken, I'll need to buy another pair."}, {"viet": "Đừng lo, sẽ có chuyến khác trong vòng năm phút.", "eng": "Never mind, there'll be another one in five minutes."}, {"viet": "Không, tôi không muốn dùng món gì đó khó tiêu như thức ăn ý đâu.", "eng": "No, I don't want something heavy like Italian food."}, {"viet": "Không ai có đầu óc tỉnh táo mà lại để cho một đứa bé con đi ra ngoài một mình.", "eng": "No one in their right senses would let a small child go out alone."}, {"viet": "Nào, giày của bố sẽ trông bóng loáng thôi.", "eng": "Now my shoes will look shiny."}, {"viet": "Về các vở kịch của bà ta, có ba vở thành công và một vở thất bại.", "eng": "Of her plays, three were successes and one was a failure."}, {"viet": "OK, xin hãy điền vào đơn xin phép này.", "eng": "OK, please fill in this application form."}, {"viet": "Khi một người đã chết không thể làm cho họ sống lại.", "eng": "Once someone has died, they cannot be brought back to life."}, {"viet": "Một trong những đoạn buồn cười nhất của quyển sách xảy ra ở chương 6.", "eng": "One of the funniest episodes in the book occurs in Chapter 6."}, {"viet": "Những nỗ lực của chúng ta chắc chắn sẽ có kết quả và sẽ đóng góp nhiều cho tình hữu nghị của chúng ta.", "eng": "Our co-operative efforts are sure to be productive and will contribute much to our friendship."}, {"viet": "Tình hình không tiến triển của chúng ta thật là rất chán nản.", "eng": "Our lack of progress is very dispiriting."}, {"viet": "Thầy giáo của chúng tôi bao nhiêu năm nay cứ dạy đi dạy lại những bài học giống nhau.", "eng": "Our teacher has been dishing up the same lessons for years."}, {"viet": "Bố mẹ không nên thiên vị đứa con này hơn những đứa con khác.", "eng": "Parents shouldn't favor one of their children more than the others."}, {"viet": "Dân chúng phải chấp nhận tình trạng khẩn cấp ác liệt của chiến tranh.", "eng": "People had to accept the harsh exigencies of war."}, {"viet": "Xin hãy yêu cầu ngân hàng phát hành sửa đối thư tín dụng đó.", "eng": "Please ask the issuing bank to make an amendment of the credit."}, {"viet": "Những trường hợp ưu tiên, như là các gia đình không nhà, được giải quyết trước.", "eng": "Priority cases, such as homeless families, get dealt with first."}, {"viet": "Này, môn thể thao bạn ưa thích là gì vậy?", "eng": "Say, what's your favourite sport?"}, {"viet": "Tôi gắp cho ông một ít cá nhé?", "eng": "Shall I help you to some fish?"}, {"viet": "Cô ta làm việc chậm, nhưng công bình mà nói cô ta thực sự cố gắng rất nhiều.", "eng": "She's a slow worker but, to give her due, she does try very hard."}, {"viet": "Nàng đã quyết tâm thành đạt trong nghề mới của nàng.", "eng": "She's determined to make a go of her new career."}, {"viet": "Cô ta đã sống ở đó từ trước chiến tranh.", "eng": "She's lived there since before the war."}, {"viet": "Cô ấy đang học ngành cơ khí.", "eng": "She's studying engineering at university."}, {"viet": "Cô ấy đồng ý nhận việc đó nhưng sau đó lại ân hận về quyết định của mình.", "eng": "She agreed to take the job, but regretted her decision after."}, {"viet": "Bà ấy đã ép uỷ ban thông qua kế hoạch của bà.", "eng": "She bulldozed her plans past the committee."}, {"viet": "Bà ấy khen ngợi Mary đã đỗ tất cả mọi môn thi.", "eng": "She complimented Mary on passing all her exams."}, {"viet": "Cô ấy ghét phải nói chuyện với mọi người trong bữa tiệc.", "eng": "She detests having to talk to people at parties."}, {"viet": "Cô ấy thêu vào đệm những bông hoa.", "eng": "She embroidered the cushion with flowers."}, {"viet": "Cô ấy thấy cung cách của anh ta đối với cô ấy rõ ràng không thân thiện.", "eng": "She found his manner towards her distinctly hostile."}, {"viet": "Bà ta mở được cửa ra, nhưng khá vất vả.", "eng": "She got the door open, but only with some difficulty."}, {"viet": "Cô ấy đã phải luyện cho lòng mình cứng cỏi không động lòng trắc ẩn.", "eng": "She had to steel her heart against pity."}, {"viet": "Bà ta chẳng có bà con nào ngoài một bà cô già.", "eng": "She has no relations besides an aged aunt."}, {"viet": "Nhân danh người được bà bảo trợ bà ấy đã đầu tư tiền.", "eng": "She invested the money on behalf of her ward."}, {"viet": "Bà ta ăn uống khó tính lắm nên tôi không bao giờ mời bà ta ăn tối cả.", "eng": "She is so fastidious about her food that I never invite her for dinner."}, {"viet": "Bà ta để cái ví của mình lại trên bàn để thử thách tính thật thà của đứa bé.", "eng": "She left her purse on the table as a test of the child's honesty."}, {"viet": "Bà ta làm một cái nệm bằng những mẩu vải thừa.", "eng": "She made a cushion out of odd bits of material."}, {"viet": "Bà ta chẳng bao giờ thay đổi quyết tâm thành đạt của bà ta.", "eng": "She never swerves from her determination to succeed."}, {"viet": "Cô ấy bảo đảm chắc chắn với tôi rằng đó là sự thật.", "eng": "She positively assured me that it was true."}, {"viet": "Cô ta coi việc thương lượng giá cả với khách hàng là biệt tài của mình.", "eng": "She regards negotiating prices with customers as her special preserve."}, {"viet": "Cô ta điên mới cho hắn mượn tiền.", "eng": "She's crazy to lend him the money."}, {"viet": "Cô ta đang tập sự làm luật sư.", "eng": "She's training for the bar."}, {"viet": "Cô ta có vẻ thờ ơ, nhưng thực chất cô ta rất hài lòng.", "eng": "She seems indifferent, but deep down she's very pleased."}, {"viet": "Cô ta làm quần mắc vào dây thép gai.", "eng": "She snags her tights on the barbed wire."}, {"viet": "Cô ấy trượt chân làm cho mắt cá bị trật khớp đau điếng.", "eng": "She stumbled and gave her ankle a painful wrench."}, {"viet": "Cô ấy bị quỵ hoàn toàn khi chồng chết.", "eng": "She took a bad knock when her husband died."}, {"viet": "Cô ấy dùng nhiều biệt ngữ đến nỗi tôi không bao giờ hiểu được những lời giải thích của cô ấy.", "eng": "She uses so much jargon I can never understand her explanations."}, {"viet": "Người ta luôn luôn không tin cô ta.", "eng": "She was always looked on with distrust."}, {"viet": "Cô ấy bị đẩy hết chỗ này đến chỗ khác và mỗi người cô ấy gặp lại chẳng giúp ích gì hơn người trước.", "eng": "She was driven from pillar to post and each person she spoke to was more unhelpful than the last."}, {"viet": "Cô ấy chỉ bị phạt tiền thay vì phải vào tù.", "eng": "She was let off with a fine instead of being sent to prison."}, {"viet": "Cô nàng giận sôi lên vì lời nhận xét của anh chàng.", "eng": "She was seething at his remarks."}, {"viet": "Hôm qua cô ấy rất tức giận nhưng nó kéo dài không lâu-hôm nay cô ấy vui vẻ trở lại rồi.", "eng": "She was very angry yesterday, but It didn't last-she was happy again today."}, {"viet": "Nàng vào đại học Cambridge năm 1977.", "eng": "She went up to Cambridge in 1977."}, {"viet": "Bà ta làm việc quần quật từ sáng đến tối.", "eng": "She works hard from morning to night."}, {"viet": "Tôi đi lấy áo khoác của ông ở phòng bên cạnh lại cho ông nhé?", "eng": "Should I fetch you your coat for you from the next room?"}, {"viet": "Từ khi trở thành một ông lớn, hắn đã bỏ rơi rất nhiều bạn hữu.", "eng": "Since he became a big shot, he sold many of his friends down the river."}, {"viet": "Những bệnh ngoài da là bệnh nghề nghiệp thông thường của công nhân nhà máy.", "eng": "Skin disorders are common occupational diseases among factory workers."}, {"viet": "Hút thuốc bị cấm trong rạp chiếu bóng này.", "eng": "Smoking isn't allowed in this cinema."}, {"viet": "Tận hưởng bầu không khí của những làng mạc xứ Tây Ban Nha.", "eng": "Soaking up the atmosphere of the Spanish villages."}, {"viet": "Nhiều chất phụ gia có thể gây ung thư.", "eng": "Some food additives may contribute to cancer."}, {"viet": "Một số người rất thích lý sự với mọi người.", "eng": "Some people love to dispute with everyone."}, {"viet": "Có người đang bấm chuông ở cửa.", "eng": "Someone is ringing at the door."}, {"viet": "Phương nam đối diện với phương bắc trên la bàn.", "eng": "South is opposite north on a compass."}, {"viet": "Đóng dấu lên phong bì tên và địa chỉ của mình.", "eng": "Stamp an envelope with one's name and address."}, {"viet": "Dự trữ thức ăn cho dịp Giáng Sinh.", "eng": "Stock up with food for Christmas."}, {"viet": "Tăng cường thêm quân cho một đơn vị đồn trú.", "eng": "Strengthen a garrison with extra troops."}, {"viet": "Tư cách đạo đức như vậy trong một vài giới có thể bỏ qua nhưng ở đây không thể dung thứ được.", "eng": "Such behaviour may pass in some circles but it will not tolerated here."}, {"viet": "Cung cấp các mẫu xét nghiệm để phân tích trong phòng thí nghiệm.", "eng": "Supply specimens for laboratory analysis."}, {"viet": "Ném vài lần vào cái lon thiếc trong hồ.", "eng": "Take a couple of shies at the tin can in the lake."}, {"viet": "Gõ các ngón tay của cô ta lên mặt bàn.", "eng": "Tapping her fingers on the table."}, {"viet": "Nhiệt độ vượt hẳn mức 40.", "eng": "Temperatures are well up in the forties."}, {"viet": "Được 10 rồi, còn phải gặp 5 thí sinh nữa.", "eng": "That's 10 down, another 5 candidates to see yet."}, {"viet": "Chiếc xe đó chắc phải nhiều tiền lắm.", "eng": "That car must have cost a bundle."}, {"viet": "Đó quả là một điều phi thường!", "eng": "That is indeed a remarkable thing!"}, {"viet": "Bức tranh đó chắc hẳn là đáng giá một món tiền rất lớn.", "eng": "That painting must be worth a king's ransom."}, {"viet": "Phim đó nghe có vẻ hợp với sở thích về phim ảnh của tôi ấy.", "eng": "That sounds like my kind of movie."}, {"viet": "Đại hội Olimpích lần thứ 21 tổ chức tại Montreal.", "eng": "The 21st Olympiad took place in Montreal."}, {"viet": "Đạo luật tái khẳng định những giá trị của gia đình là nền tảng đạo đức của một dân tộc.", "eng": "The Act reaffirmed family values as the moral bedrock of a nation."}, {"viet": "Sân bay đầy những người đi nghỉ hè.", "eng": "The airport was thronged with holiday-makers."}, {"viet": "Những người vận động chống vũ khí hạt nhân đang trở nên mạnh hơn.", "eng": "The anti-nuclear lobby are becoming stronger."}, {"viet": "Quân đội sẽ làm cho anh ta trưởng thành.", "eng": "The army will make a man of him."}, {"viet": "Khán giả hứng thú vào đêm khai mạc vở kịch.", "eng": "The audience was enthusiastic on the opening night of the play."}, {"viet": "Trong cú va đụng, đuôi xe ô tô bị bẹp dúm dó.", "eng": "The back of the car was badly dented in a collision."}, {"viet": "Các ngân hàng tiếp tục hoạt động khi họ giảm tỉ lệ cho vay lãi của họ.", "eng": "The banks set the ball rolling when they reduced their lending rates."}, {"viet": "Thịt bò nửa sống nửa chín, không thể nào ăn được.", "eng": "The beef was underdone and quite uneatable."}, {"viet": "Trong buổi lễ, giám mục làm lễ thêm sức cho một số.", "eng": "The bishop conducted a number of confirmations at the service."}, {"viet": "Quả bom ấy có chứa chất nổ mạnh.", "eng": "The bomb was packed with high explosive."}, {"viet": "Ông chủ muốn gặp anh-anh nên lên gác mau lên.", "eng": "The boss wants you-you'd better get upstairs at the double."}, {"viet": "Rượu mạnh đã hoàn toàn làm cho anh ta lại sức.", "eng": "The brandy completely restored him."}, {"viet": "Viên đạn trúng bức tường và lệch hướng đi.", "eng": "The bullet hit a wall and was deflected from its course."}, {"viet": "Lạc đà là một phương thức vận chuyển ở sa mạc.", "eng": "The camel is a mode of transport in the desert."}, {"viet": "Công nghiệp ô tô là một trong những nhóm chủ lớn nhất của chúng tôi.", "eng": "The car industry is one of our biggest employers."}, {"viet": "Vụ án này đã được đưa ra trước quan toà Cooper tuần trước.", "eng": "The case came before Judge Cooper last week."}, {"viet": "Cái ghế không chắc lắm và đã gẫy khi nó ngồi lên.", "eng": "The chair wasn't strong enough and it broke when he sat on it."}, {"viet": "Vị thủ lĩnh được Thủ tướng tiếp đãi.", "eng": "The chief was received by the Prime Minister."}, {"viet": "Đứa trẻ đó bị đói giơ xương.", "eng": "The child was reduced to a skeleton."}, {"viet": "Trẻ con liếm môi khi chiếc bánh ngọt được cắt ra.", "eng": "The children licked their lips as the cake was cut."}, {"viet": "Mấy đứa trẻ ăn sô-cô-la đến phát bệnh luôn nếu tôi cứ để chúng ăn thoải mái.", "eng": "The children would eat themselves sick on chocolate if I let them."}, {"viet": "Lớp học hoạt động sôi nổi, học sinh nào cũng bận rộn.", "eng": "The classroom was full of activity, every child was busy."}, {"viet": "Bờ biển rất khó nhận ra được trong sương mù.", "eng": "The coast was barely distinguishable in the mist."}, {"viet": "Uỷ ban đã khởi sự công việc của mình trong những tình thế thuận lợi.", "eng": "The committee began its work under favourable auspices."}, {"viet": "Công ty đó đang được tích cực đề nghị bán cho nhiều người.", "eng": "The company is now actively being shopped around."}, {"viet": "Sự hợp lưu của dòng sông Rhine và sông Mosel.", "eng": "The confluence of the Rhine and the Mosel."}, {"viet": "Mối liên hệ giữa chiều cao và trọng lượng của ai.", "eng": "The correlation between somebody's height and weight."}, {"viet": "Vùng thôn quê chan hoà ánh nắng.", "eng": "The countryside was bathed in brilliant sunshine."}, {"viet": "Bọn tội phạm không biết là cảnh sát đang nghe trộm, thí dụ bằng cách nối vào dây điện thoại của chúng.", "eng": "The criminals did not know the police were listening in."}, {"viet": "Chiếc chén rơi khỏi bàn tay bị liệt của anh ấy.", "eng": "The cup slipped from his palsied grasp."}, {"viet": "Hôm kia em cũng nói là bố em bị ốm.", "eng": "The day before yesterday you said your father was sick."}, {"viet": "Mùi vị ngon lành của thịt được quay trong chính nước thịt.", "eng": "The delicious smell of meat roasting in its own juices."}, {"viet": "Chính sách của nhà độc tài chẳng bao lâu đã làm mất thiện cảm của quần chúng.", "eng": "The dictator's polices soon disaffected the people."}, {"viet": "Sự chấm dứt một cuộc hợp tác kinh doanh.", "eng": "The dissolution of a business partnership."}, {"viet": "Ông bác sĩ đã bị gạt bỏ vì không đủ trình độ.", "eng": "The doctor was struck off for incompetence."}, {"viet": "Con chó đã cắn vào mắt cá chân cô ấy.", "eng": "The dog was nipping at her ankles."}, {"viet": "Bác tài xế nhấn còi khi đến khúc rẽ.", "eng": "The driver tooted his horn as he approached the bend."}, {"viet": "Gờ của cái đĩa đó đã được làm nhẵn bằng máy.", "eng": "The edge of the disk had been machined smooth."}, {"viet": "Quân địch đáp lại hỏa lực của chúng tôi.", "eng": "The enemy replied to our fire."}, {"viet": "Tài sản thừa kế sẽ thuộc về con trai trưởng.", "eng": "The estate went to the eldest son."}, {"viet": "Sự khai thác những mỏ dầu mới khám phá.", "eng": "The exploitation of newly discovered of fields."}, {"viet": "Gia đình đã có những giấy tờ công nhận quyền sở hữu của họ.", "eng": "The family possessed documents that proved their right to ownership."}, {"viet": "Số ít người đến nghe buổi hòa nhạc đó đều thấy thích.", "eng": "The few who came to the concert enjoyed it."}, {"viet": "Những đề nghị cuối cùng là một sự thoả hiệp phần nào không thành công giữa nhu cầu sinh lợi và những yêu sách của những người bảo thủ địa phương.", "eng": "The final proposals were a rather unsuccessful compromise between the need for profitability and the demands of local conservationists."}, {"viet": "Công ty sẽ áp dụng nguyên tắc ai mới được nhận vào làm sẽ bị sa thải đầu tiên.", "eng": "The firm will apply the principle of'last in, first out'."}, {"viet": "Căn hộ sẽ được tân trang lại cho các người thuê mới.", "eng": "The flat will be refurbished for the new tenants."}, {"viet": "Khu bán sách ngoại ngữ ở đằng kia kìa.", "eng": "The foreign languages section is over there."}, {"viet": "Toàn bộ câu chuyện đó đã không bao giờ được đưa ra công khai.", "eng": "The full story was never made public."}, {"viet": "Khuôn mặt hốc hác của một người đói ăn.", "eng": "The gaunt face of a starving man."}, {"viet": "Thủ môn đập bóng hai lần trước khi sút.", "eng": "The goal keeper bounced the ball twice before kicking it."}, {"viet": "Chính phủ đã không giành được sự ủng hộ của nhân dân.", "eng": "The government did not have the support of the population."}, {"viet": "Chính phủ làm trung gian giữa công nhân và chủ.", "eng": "The government mediated between the workers and employers."}, {"viet": "Lợi thế quan trọng nhất của kim loại này là nó không gỉ.", "eng": "The great advantage of this metal is that it doesn't rust."}, {"viet": "Người khách trọ phát hiện hành lý của ông ta bị mất.", "eng": "The guest found his luggage is missing."}, {"viet": "Đầu đề đó nổi bật trên trang giấy.", "eng": "The headline glared from the page."}, {"viet": "Bọn không tặc trả tự do cho các con tin.", "eng": "The hijackers set the hostages free."}, {"viet": "Sức nóng mặt trời làm giộp sơn.", "eng": "The hot sun blistered the paint."}, {"viet": "Ngôi nhà ở trên đỉnh đồi.", "eng": "The house stands at the top of the hill."}, {"viet": "Chính là chỗ trước đây mà chúng ta đã dừng lại.", "eng": "The identical place where we stopped before."}, {"viet": "Những điều tạo nên cá tính của ai.", "eng": "The ingredients of somebody's character."}, {"viet": "Sự phát minh ra ngành in đã đem đến những thay đổi quan trọng trong xã hội.", "eng": "The invention of printing caused important changes in society."}, {"viet": "Quyết định của thẩm phán đã bị toà thượng thẩm bác.", "eng": "The judge's decision was set aside by the Appeal court."}, {"viet": "Tên sát thủ là một kẻ phi luân lí không hề thấy ăn năn.", "eng": "The killer was an amoral man who felt no remorse."}, {"viet": "Chuyến xe buýt cuối cùng đã chạy mất nên chúng tôi phải cuốc bộ về nhà.", "eng": "The last bus had gone so we had to hoof it home."}, {"viet": "Dây buộc và vòng đeo cổ trông thật dễ thương.", "eng": "The leash and collar look cute."}, {"viet": "Ngọn hải đăng chiếu thẳng vào mạn tàu.", "eng": "The light house was abeam of the ship."}, {"viet": "Người sĩ quan phục vụ lâu năm nhất luôn luôn có quyền ưu tiên.", "eng": "The longest-serving officer always takes precedence."}, {"viet": "Quan toà đã cho hắn hưởng án treo.", "eng": "The magistrate bound him over for a year."}, {"viet": "Ông bầu khuyên chúng tôi đừng quá căng thẳng trước trận đấu quan trọng.", "eng": "The manager warned us not to get too keyed up before the big match."}, {"viet": "Bữa ăn kể cả rượu lên đến 12 pao mỗi suất.", "eng": "The meal with wine came to 12 pounds each."}, {"viet": "Những người đàn ông đang đãi vàng ở bờ sông.", "eng": "The men were panning for gold in the river."}, {"viet": "Người hà tiện giấu tiền của mình vào một hốc tường trong phòng ngủ.", "eng": "The miser hid his money in a recess in his bedroom."}, {"viet": "Càng biết nó tôi càng mến nó.", "eng": "The more I know him, the more I like him."}, {"viet": "Dây cu-roa chuyển động đưa nguyên liêu vào máy.", "eng": "The moving belt feeds the machine with raw material."}, {"viet": "Cuộc thương lượng đã tới chỗ bế tắc, cả hai bên đều không chịu thoả hiệp.", "eng": "The negotiations had reached an impasse, with both sides refusing to compromise."}, {"viet": "Chiếc máy mới được xem là giải pháp cho tất cả các vấn đề sản xuất của chúng ta, nhưng có qua thử thách mới biết được hay dở.", "eng": "The new machine is supposed to be the solution to all our production problems, but the proof of the pudding is in the eating."}, {"viet": "Người đàn bà mới đến, cố càng ít xuất đầu lộ diện càng tốt.", "eng": "The newcomer tried to make herself as inconspicuous as possible."}, {"viet": "Ca đêm tan vào lúc bình minh.", "eng": "The night shift comes off at dawn."}, {"viet": "Số lượng tạp chí văn nghệ tăng lên.", "eng": "The numbers of literary magazines accelerate."}, {"viet": "Một chi của một gia đình giàu có.", "eng": "The offshoot of a wealthy family."}, {"viet": "Thế Vận Hội luôn luôn được truyền hình.", "eng": "The Olympic Games are always televised."}, {"viet": "Điều bất lợi chủ yếu của ứng cử viên kia là tuổi của bà ta.", "eng": "The other candidate's main disadvantage is her age."}, {"viet": "Báo chí nhanh chóng lên án sai lầm của anh ta.", "eng": "The papers were quick to condemn him for his mistake."}, {"viet": "Tình trạng người bệnh đêm qua đã tồi tệ hơn.", "eng": "The patient's condition worsened during the night."}, {"viet": "Nhân dân thở phào khi kẻ cường hào trong làng bị đưa ra xét xử.", "eng": "The people were relieved, when the village scourge was put behind bars."}, {"viet": "Bức tranh đáng giá đại khái một trăm đôla.", "eng": "The picture is worth, say hundred dollars."}, {"viet": "Sơ đồ tầng trệt hoàn toàn đối xứng.", "eng": "The plan of the ground floor is completely symmetrical."}, {"viet": "Vở kịch đó nhận được những bài chỉ trích.", "eng": "The play got splendid unfavourable reviews."}, {"viet": "Cảnh sát đang theo dõi những đối tượng đáng ngờ suốt hai bốn tiếng đồng hồ.", "eng": "The police are keeping the suspects under round-the-clock surveillance."}, {"viet": "Cảnh sát ngăn đám đông lại khi xe của Tổng thống đi qua.", "eng": "The police kept crowd back as the President's car passed."}, {"viet": "Viên cảnh sát đó bị buộc tội sao nhãng nhiệm vụ.", "eng": "The policeman was accused of dereliction of duty."}, {"viet": "Người đưa thư mang đến cho tôi một bưu kiện lớn.", "eng": "The postman brought me a large package."}, {"viet": "Phu nhân Tổng thống chăm chú theo dõi từng lời của ông.", "eng": "The President's wife follows his every word."}, {"viet": "Tiền mua các món hàng có thể trả góp.", "eng": "The price of the goods is payable in instalments."}, {"viet": "Phiên tòa xử tù nhân đó là một trò hề.", "eng": "The prisoner's trial was a farce."}, {"viet": "Chương trình được trình diễn đúng với trình độ.", "eng": "The programme was pitched at just the right level."}, {"viet": "Công chúng bị loá mắt bởi đời sống riêng tư của các nhân vật được mọi người biết tiếng.", "eng": "The public is fascinated by the private lives of public figures."}, {"viet": "Nữ hoàng được trao vương miện với nhiều nghi lễ.", "eng": "The Queen was crowned with much ceremony."}, {"viet": "Tỷ giá đã hạ xuống một lượng không đáng kể.", "eng": "The rate has fallen by an insignificant amount."}, {"viet": "Những người tị nạn đã mất hết nhà cửa và tài sản của mình, và bây giờ chỉ còn là vấn đề một sống hai chết.", "eng": "The refugees had lost their homes and their possessions, and it was now a case of sink or swim."}, {"viet": "Nghị quyết đã được nhất trí trông qua.", "eng": "The resolution was carried nem con."}, {"viet": "Quyền được đối xử bình đẳng trong hệ thống công lý về trọng tội và thiếu niên.", "eng": "The right to equal treatment in the criminal and juvenile justice system."}, {"viet": "Con đường bừa bộn những xác ôtô.", "eng": "The road was littered with wrecked cars."}, {"viet": "Sự quay vòng của trái đất quanh mặt trời.", "eng": "The rotation of the earth round the sun."}, {"viet": "Việc bán súng phải tuân theo những hạn chế về pháp lý.", "eng": "The sale of firearms is subject to many legal restrictions."}, {"viet": "Trường học ở một nơi thuận tiện, gần nhà tôi.", "eng": "The school is in a convenient place, near my home."}, {"viet": "Những người tuyển chọn bị tố cáo là đã tỏ ra có thành kiến khi không đưa anh ấy vào đội tuyển.", "eng": "The selectors were accused of showing prejudice in failing to include him in the team."}, {"viet": "Thật là vô cùng vui sướng thật sự được gặp lại anh sau tất cả những năm đó.", "eng": "The sheer joy of seeing you again after all these years."}, {"viet": "Điện giật làm tôi bủn rủn cả chân tay.", "eng": "The shock made me go all weak at the knees."}, {"viet": "Cái bảng đó cho biết'Nguy hiểm: đá lở'.", "eng": "The sign said,'Danger: falling rocks'."}, {"viet": "Chẳng bao lâu cậu bị mệt và bị bỏ xa phía sau những người đi bộ khác.", "eng": "The small boy soon became tired and lagged far behind the rest of the walkers."}, {"viet": "Quân lính đã phải rút lui khi quân địch tiến lên.", "eng": "The soldiers had to retreat as the enemy advanced."}, {"viet": "Rõ ràng diễn giả đã đánh đúng vào tình cảm của cử toạ.", "eng": "The speaker had obviously struck a chord with his audience."}, {"viet": "Bản đồ sao ở trang sau cho thấy vô số các chòm sao.", "eng": "The star map on the next page shows many constellations."}, {"viet": "Câu chuyện kết thúc với cái chết của nhân vật chính.", "eng": "The story concludes with the hero's death."}, {"viet": "Kiểu áo của cô ấy làm nổi eo nhỏ của cô ấy.", "eng": "The style of her dress accentuated her small waist."}, {"viet": "Cuộc điều tra bao gồm một mẫu đại diện cho cư dân.", "eng": "The survey covers a representative sample of the population."}, {"viet": "Bà giáo hy vọng nâng cao kiến thức của lũ trò nhỏ bằng cách đọc cho chúng nghe các câu chuyện tôn giáo.", "eng": "The teacher hoped to elevate the minds of her young pupils by reading them religious stories."}, {"viet": "Tiếng răng rắc rất rõ của một chiếc xương gãy.", "eng": "The telltale crepitation of a broken bone."}, {"viet": "Bọn trộm đã để lại người gác đêm bị trói chặt và nhét giẻ vào mồm.", "eng": "The thieves left the night-watchman tied up and gagged."}, {"viet": "Tầng thượng có một nhà hàng in bóng lên nền trời với quang cảnh tuyệt vời của thành phố và vùng đồng quê bao quanh.", "eng": "The top storey contains a skyline restaurant with superb views of the city and surrounding countryside."}, {"viet": "Chuyến tàu hoả đó đến muộn và tôi đã không chuyển tàu được.", "eng": "The train was late and I missed my connection."}, {"viet": "Sự thật lắm khi khó thấy được.", "eng": "The truth is often difficult to come at."}, {"viet": "Hai tàu vũ trụ sẽ ghép lại ( với nhau ) trên quỹ đạo.", "eng": "The two spacecraft will link up ( with each other ) in orbit."}, {"viet": "Phía trên của một cái cuống lá được coi là mặt đối trục.", "eng": "The upper side of a leaf stalk is known as the adaxial surface."}, {"viet": "Ngôi làng tràn ngập niềm vui của mùa Giáng sinh.", "eng": "The village rang with the joy of Christmas."}, {"viet": "Sau khi xây xong đập, nước trở nên sâu hơn.", "eng": "The water deepened after the dam was built."}, {"viet": "Toàn bộ cuộc tranh luận chung qui lại là một cuộc đấu tranh giành quyền lực giữa ban giám đốc và các nghiệp đoàn.", "eng": "The whole dispute comes down to a power struggle between management and trade unions."}, {"viet": "Đội thắng trở về nhà trong niềm vui thắng lợi.", "eng": "The winning team returned home in triumph."}, {"viet": "Các công nhân đào một cái hào để đặt ống dẫn nước mới.", "eng": "The workmen dug a trench for the new water-pipe."}, {"viet": "Mục tiêu của họ là phục hồi nền công nghiệp Anh.", "eng": "Their aim is to regenerate British industry."}, {"viet": "Sự thất bại hiển nhiên của họ trong việc hiện đại hoá nền công nghiệp của đất nước.", "eng": "Their manifest failure to modernize the country's industries."}, {"viet": "Sau dó đến Công viên Quốc gia Yellowstone.", "eng": "Then comes the National Yellowstone Park."}, {"viet": "Có sự rò mạch trong hộp cầu chì đó.", "eng": "There's a faulty connection in the fuse-box."}, {"viet": "Những ngày Chủ nhật không bao giờ có nhiều tin tức.", "eng": "There's never very much news on Sundays."}, {"viet": "Đầu máy có cái gì hỏng hóc.", "eng": "There's something wrong with the engine."}, {"viet": "Có nhiều kiểu đời mới xuất hiện trên thị trường.", "eng": "There are many new styles coming out in the market."}, {"viet": "Có hai mươi em học sinh có mặt hôm nay.", "eng": "There are twenty children present today."}, {"viet": "Có một siêu thị lớn ở phía bên trái.", "eng": "There is a big supermarket on the left-hand side."}, {"viet": "Thậm chí còn có cả một hệ thống chỉ đường nữa.", "eng": "There is even a navigation system."}, {"viet": "Không còn cái nào trong tủ.", "eng": "There isn't any in the cupboard."}, {"viet": "Có một luồng hơi từ động cơ phụt ra trước khi máy ngừng lại.", "eng": "There was a puff of steam from the engine before it stopped."}, {"viet": "Không đủ nước để cho con tàu nổi.", "eng": "There wasn't enough water to float the ship."}, {"viet": "Anh lại mắc cái tật ấy, cứ vội vã kết luận trên cơ sở bằng chứng mong manh nhất.", "eng": "There you go again-jumping to conclusions on the slightest evidence."}, {"viet": "Loại này giúp cho chúng ta bằng cách đem phấn hoa từ hoa này sang hoa khác khi chúng hút nhụy.", "eng": "These help us by carrying pollen from flower to flower as they are getting the nectar."}, {"viet": "Sách lược này khó có thể giúp ích được anh.", "eng": "These tactics are unlikely to help you."}, {"viet": "Họ đã cắt đứt việc đính hôn của họ.", "eng": "They've broken off their engagement."}, {"viet": "Họ thường bị cảnh cáo là không hành động nhanh chóng.", "eng": "They are frequently admonished for their failure to act quickly."}, {"viet": "Họ buộc hai chân anh ta ( vào nhau ) để anh ta không thể trốn thoát được.", "eng": "They bound his legs ( together ) so he couldn't escape."}, {"viet": "Chúng cuộn mình trong cái chăn ấm.", "eng": "They cuddled up together under the warm blanket."}, {"viet": "Họ dành cho Nữ hoàng một sự chào mừng nồng nhiệt.", "eng": "They extended the Queen a warm welcome."}, {"viet": "Họ đã không được ăn thức ăn nóng hơn một tuần rồi.", "eng": "They hadn't tasted hot food for over a week."}, {"viet": "Họ học được cách gửi đi các tín hiệu bằng tiếng trống, khói và ánh sáng phản chiếu bằng gương.", "eng": "They learned to send signals with drums and smoke and mirrors."}, {"viet": "Họ phải mặc đồng phục.", "eng": "They must wear uniforms."}, {"viet": "Mỗi chiếc 2,00 $ hoặc 3 chiếc thì tính 5,00 $", "eng": "They're $ 2.00 each, or $ 5.00 for three."}, {"viet": "Lẽ ra họ nên bớt lang thang đây đó mà dành nhiều thời giờ hơn cho con cái.", "eng": "They should spend less time gallivanting about and more with their children."}, {"viet": "Họ dùng mái chèo để đẩy thuyền sau khi đầu máy hỏng.", "eng": "They used oars to propel the boat after the motor failed."}, {"viet": "Họ không thấy đường để lái xe qua cơn bão tuyết.", "eng": "They were driving blind through the snowstorm."}, {"viet": "Người ta sẽ không phê chuẩn chúng ta chi tiêu ở mức thế này đâu.", "eng": "They won't sanction our spending on this scale."}, {"viet": "Mối bất hoà gay gắt này làm mất cả thanh danh của đảng đó.", "eng": "This blood-letting is damaging the reputation of the party."}, {"viet": "Đất nước này đang lụn bại, chúng ta cần phải thay đổi chính phủ.", "eng": "This country is going to rack and ruin, we need a change of government."}, {"viet": "Cửa hàng thời trang Pháp này bán thời trang Paris mới nhất.", "eng": "This French boutique sells the latest Parisian fashion."}, {"viet": "Đây là ông Reed thuộc trường âm nhạc Largo.", "eng": "This is Mr. Reed of the Largo Music School."}, {"viet": "Ván cuối cùng này sẽ quyết định ai là nhà vô địch.", "eng": "This last game will decide who is to be champion."}, {"viet": "Nhóm xã hội đã từng quan trọng một thời đó đang ngày càng bị gạt ra ngoài lề ( của cách quản lý đất nước ).", "eng": "This once important social group is becoming more and more marginal ( to the way the country is run )."}, {"viet": "Nhà hàng thì hơi đắt đối với tôi.", "eng": "This restaurant is a bit pricey for me."}, {"viet": "Trà này được pha chế bằng cách trộn lẫn canomin và trà bạch tuyết.", "eng": "This tea is blended by mixing camomile with pekoe."}, {"viet": "Cần phải uốn nắn lũ trẻ tệ hại này.", "eng": "Those dreadful children need to be taken in hand."}, {"viet": "Ngày nay Bom-bay là một trong những thành phố lớn nhất thế giới.", "eng": "Today Bombay is one of the largest cities of the world."}, {"viet": "Những bộ lạc của các dân tộc bán khai từ phía Bắc và phía Đông đang kéo vào Đế quốc.", "eng": "Tribes of barbarians were pushing into the empire from the north and east."}, {"viet": "Bạo lực là một điều ghê tởm với bản chất hiền hoà của anh ta.", "eng": "Violence is abhorrent to his gentle nature."}, {"viet": "Tốt hơn hết là chúng ta tìm hiểu rõ sự thể ra sao trước khi tiến hành bất cứ hành động nào.", "eng": "We'd better find out how the land lies before taking any action."}, {"viet": "Tất cả chúng ta đều có thể phạm sai lầm khi chúng ta mệt mỏi.", "eng": "We're all liable to make mistakes when we're tired."}, {"viet": "Vào thời điểm này trong năm, chúng tôi khá bận.", "eng": "We're quite busy for this time of year."}, {"viet": "Chúng tôi đã có đến ba cuộc hội nghị mà vẫn chưa đạt được thoả thuận.", "eng": "We've had three meetings, and still we haven't reached agreement."}, {"viet": "Chúng tôi dự kiến là nhu cầu chắc sẽ lên.", "eng": "We anticipate that demand is likely to increase."}, {"viet": "Chúng ta rất vinh dự được thượng nghị sĩ Dobbs đến với chúng ta tối nay.", "eng": "We are very privileged to have Senator Dobbs with us this evening."}, {"viet": "Chúng ta không thể làm việc chung với nhau được nữa, tôi nghĩ đã đến lúc đường ai nấy đi.", "eng": "We can't work together any more, I think it's time we went our separate ways."}, {"viet": "Chúng tôi đã so sánh giá cả ở cửa hàng với giá cả ở chợ.", "eng": "We compared the prices in the shop with the prices in the market."}, {"viet": "Chúng tôi không có đủ tiền để điều hành bệnh viện một cách đàng hoàng.", "eng": "We don't have enough money to run the hospital properly."}, {"viet": "Chúng tôi nhìn ra khoảng mênh mông vô bờ bến của sa mạc.", "eng": "We gazed out over the limitless expanses of the desert."}, {"viet": "Chúng tôi đã phải rón rén từng bước trên con đường lầy bùn.", "eng": "We had to pick our way along the muddy track."}, {"viet": "Chúng ta không có chứng cứ xác thực về tội của cô ta.", "eng": "We have no positive proof of her guilt."}, {"viet": "Chúng tôi mời 30 người nhưng chỉ một số ít người đến.", "eng": "We invited 30 people but only a handful ( of them ) came."}, {"viet": "Chúng tôi đã cập bến lúc chạng vạng tối sau ba tuần đi biển.", "eng": "We made a landfall at dusk after three weeks at sea."}, {"viet": "Chúng ta không được tự mãn về những thành tựu của chúng ta, vẫn còn rất nhiều việc phải làm.", "eng": "We must not be complacent about our achievements, there is still a lot to be done."}, {"viet": "Chúng tôi vừa thoát khỏi một tai nạn hiểm nghèo.", "eng": "We only just missed having a nasty accident."}, {"viet": "Chúng tôi chào mừng ngài vì những cố gắng không mệt mỏi của ngài cho hoà bình.", "eng": "We salute you for your tireless efforts for peace."}, {"viet": "Cả buổi chiều chúng tôi lê bước hết cửa hàng nọ đến cửa hàng kia.", "eng": "We spent the afternoon traipsing from one shop to another."}, {"viet": "Chúng tôi đến thăm bà con của chúng tôi khá thường xuyên.", "eng": "We visit our relatives quite often."}, {"viet": "Chúng tôi được hướng dẫn đi thăm một vòng trong nhà thờ.", "eng": "We were given a conducted tour of the cathedral."}, {"viet": "30 phút nữa chúng tôi sẽ bắt đầu.", "eng": "We will start in 30 minutes."}, {"viet": "Vậy, sẽ phải đợi bao lâu?", "eng": "Well, how long will it take?"}, {"viet": "À, đây quả thật là một điều ngạc nhiên.", "eng": "Well, this is certainly a surprise."}, {"viet": "Vào mùa xuân thời tiết ở Đại Liên như thế nào?", "eng": "What's the weather like in Dalian in spring?"}, {"viet": "Bạn sẽ làm gì cho ngày nghỉ sắp đến?", "eng": "What are you doing for this coming holiday?"}, {"viet": "Bạn thường làm gì vào thời gian rỗi?", "eng": "What do you often do in your spare time?"}, {"viet": "Điều gì ngượng ngùng đã xảy ra với bạn khi bạn còn nhỏ?", "eng": "What is an embarrassing thing that happened to you when you were younger?"}, {"viet": "Vòng đeo tay của bạn làm bằng gì?'.", "eng": "What is your bracelet made of?'."}, {"viet": "Những người Canada thuộc dòng dõi người Pháp sống ở những vùng nào của Canada?", "eng": "What parts of Canada do Canadians of French descent live?"}, {"viet": "Mấy giờ thì bưu điện đóng cửa vậy?", "eng": "What time is the post-office closed?"}, {"viet": "Chị và chồng chị đi lại với nhau lần cuối là bao giờ?", "eng": "When did you and your husband last have intercourse?"}, {"viet": "Khi tôi rút lui tôi sẽ viết hồi kí.", "eng": "When I retire, I'm going to write my memoirs."}, {"viet": "Khi xí nghiệp đóng cửa, điều đó có nghĩa là sẽ có 500 người dôi ra.", "eng": "When the factory closes, it will mean 500 redundancies."}, {"viet": "Khi nào bạn sẽ bắt đầu làm việc lại?", "eng": "When will you start work again?"}, {"viet": "Tối nay em muốn đi đâu?", "eng": "Where do you want to go tonight?"}, {"viet": "Người lái xe nào phải chịu trách nhiệm về tai nạn này?", "eng": "Which driver was to blame for the accident?"}, {"viet": "Uytxki có thể là tốt cho anh nếu uống điều độ.", "eng": "Whisky can be good for you if taken in moderation."}, {"viet": "Đội nào là đội đoạt Cúp thế giới năm 1982?", "eng": "Who was is that won the World Cup in 1982?"}, {"viet": "Tại sao bạn nghĩ chuyện đó không kéo dài lâu lắm?", "eng": "Why don't you think it lasted very long?"}, {"viet": "Liệu cái giá này có đỡ được sức nặng của tất cả các cuốn sách kia không?", "eng": "Will this shelf sustain the weight of all these book?"}, {"viet": "Dù thắng hay thua, đó vẫn sẽ là một trận đấu rất hay.", "eng": "Win or lose, it should be a very good match."}, {"viet": "Với tiền'boa'tôi kiếm được nhiều nhất là 150 pao một tuần.", "eng": "With tips I can earn 150 pounds a week, at the very outside."}, {"viet": "Anh có thể tin được không, hôm nay cô ta đến sở trong bộ áo dạ hội!", "eng": "Would you believe, she came to work in an evening dress!"}, {"viet": "Bạn có thích chơi gôn với chúng tôi không?", "eng": "Would you like to play golf with us?"}, {"viet": "Nếu tôi đề nghị giúp đỡ, liệu cô ấy có phật ý không?", "eng": "Wouldn't she take it amiss if I offered to help?"}, {"viet": "Có, tôi bị sốt nhẹ và ớn lạnh.", "eng": "Yes, I have a slight fever and the chills."}, {"viet": "Anh nên trang bị cho mình một ít thông tin trước khi đi phỏng vấn.", "eng": "You'd better clue yourself up a bit before you go for the interview."}, {"viet": "Anh cần có cái kẹp để cặp mẫu vật lên.", "eng": "You'll need tweezers to hold up the specimen."}, {"viet": "Anh ta đã làm việc cả buổi sáng-anh xứng đáng được nghỉ.", "eng": "You've been working all morning-you deserve a rest."}, {"viet": "Các ông không thể bắt tôi được! Chắc chắn có một sự lầm lẫn nào đó!", "eng": "You can't arrest me! There must be some mistake!"}, {"viet": "Anh có thể chọn trong số hàng hoá rất nhiều.", "eng": "You can choose from a wide range of goods."}, {"viet": "Anh muốn viết gì thì viết, chừng nào mà nó làm những độc giả khờ dại vẫn thích.", "eng": "You can write what you like, as long as it keeps the punters happy."}, {"viet": "Bạn có những buổi hoàng hôn đẹp ở vùng nhiệt đới.", "eng": "You get beautiful sunsets in the tropics."}, {"viet": "Mày canh chừng để tao lấy tiền.", "eng": "You keep watch and I'll steal the money."}, {"viet": "Lần tới bạn sẽ thắng bạn ấy thôi.", "eng": "You might beat her the next time."}, {"viet": "Các bạn phải hiểu được các nguyên lý của toán học trước khi chúng ta có thể học tiếp.", "eng": "You must understand the elements of mathematics before we can proceed further."}, {"viet": "Em sẽ có một bộ áo mới cho ngày sinh nhật.", "eng": "You shall have a new dress for your birthday."}, {"viet": "Anh không nên nói những điều tốt đẹp đó về tôi-anh làm tôi đỏ mặt!", "eng": "You shouldn't say such nice things about me-spare my blushes!"}, {"viet": "Một ngày nào đó, mày sẽ phải chịu trách nhiệm về những tội ác của mày.", "eng": "You will have to answer for crimes one day."}, {"viet": "Chúng tôi đã nhận được sách của ông gửi đến.", "eng": "Your consignment of books has duly come to hand."}, {"viet": "Giày của ông sẽ được trả lại vào sáng hôm sau.", "eng": "Your shoes will be returned n-the next morning."}]