[{"viet": "Một dự luật có lẽ sẽ làm trì hoãn việc xử lý thức ăn bằng phóng xạ trong nước này.", "eng": "A bill that would sidetrack food irradiation in this country."}, {"viet": "Một khách sạn rẻ tiền ở một khu tồi tàn của thành phố.", "eng": "A cheap hotel in a seedy part of town."}, {"viet": "Một hệ thống vi tính hữu dụng tối đa.", "eng": "A computer system of maximum utility."}, {"viet": "Một bộ quần áo sậm không để lộ ra bụi bẩn.", "eng": "A dark suit doesn't show the dirt so much."}, {"viet": "Một con chó rụng lông khắp nhà.", "eng": "A dog that moults all over the house."}, {"viet": "Một cánh đồng tràn lan cây tầm ma và cây gai.", "eng": "A field rank with nettles and thistles."}, {"viet": "Sự chỉnh đốn lại toàn bộ tổ chức của cơ quan, phòng ban.", "eng": "A full-scale reorganization of the department."}, {"viet": "Một nhà lão luyện về tài ngoại giao.", "eng": "A grand master of foreign diplomacy."}, {"viet": "Một cơn sốt cao là một dấu hiệu báo trước căn bệnh.", "eng": "A high fever is an early manifestation of the disease."}, {"viet": "Một quan tòa phải công bằng và phải xem xét mọi việc một cách khách quan.", "eng": "A judge should be impartial and should study every matter objectively."}, {"viet": "Một thư viện và phòng hòa nhạc cùng ở trong một tòa nhà.", "eng": "A library and concert-hall both under one roof."}, {"viet": "Một tháng âm lịch là khoảng thời gian giữa hai lần trăng mới.", "eng": "A lunar month is the period between two new moons."}, {"viet": "Một thành viên trong giới cố vấn được ưu đãi của Tổng thống.", "eng": "A member of the President's favoured circle of advisers."}, {"viet": "Cái cà-vạt màu nhã có thể mang với áo sơ mi bất cứ màu gì.", "eng": "A neutral tie can be worn with a shirt of any colour."}, {"viet": "Tờ 100 nhân dân tệ được đưa vào lưu hành.", "eng": "A one-hundred-Yuan note has been put in circulation."}, {"viet": "Một người mà chỗ ở của anh ta không ai biết.", "eng": "A person whose whereabouts is unknown."}, {"viet": "Một chính khách thích đối đầu với các phóng viên.", "eng": "A politician who relishes joust with reporters."}, {"viet": "Một tổ chức xã hội giúp người nghèo.", "eng": "A public institution to help the poor."}, {"viet": "Một cuộc triển lãm những tác phẩm thuộc quá khứ của nhà họa sĩ đó.", "eng": "A retrospective exhibition of the painter's work."}, {"viet": "Một nhà khoa học cần phải tỉ mỉ khi làm các thử nghiệm.", "eng": "A scientist must be precise in making tests."}, {"viet": "Vì thiếu quân cảnh nên căn cứ không quân đó không an toàn.", "eng": "A shortage of military police made the air base insecure."}, {"viet": "Tên, cấp bậc và số quân của một người lính là tất cả những gì anh ta có thể nói với kẻ địch.", "eng": "A soldier's name, rank and serial number are all that he may tell an enemy."}, {"viet": "Một truyện kết thúc có hậu.", "eng": "A story with a happy ending."}, {"viet": "Người thầy phải thể hiện uy quyền của mình.", "eng": "A teacher must show is authority."}, {"viet": "Một hiệp ước nhằm ngăn chặn một cuộc chiến tranh thế giới.", "eng": "A treaty designed to prevent a world war."}, {"viet": "Một người bảo trợ giàu có đã cứu giúp chúng tôi bằng một số tiền tặng lớn.", "eng": "A wealthy sponsor came to our rescue with a generous donation."}, {"viet": "Cách đây khoảng 1000 năm một tu sĩ tên là Gerbert đã làm ra một dụng cụ đo thời gian mà người ta gọi là đồ ma thuật.", "eng": "About 1,000 years ago a monk named Gerbert made a timepiece which people called magical."}, {"viet": "Thật ra đây là xe của bạn tôi.", "eng": "Actually this is my friend's car."}, {"viet": "Sau một năm trong công việc này, bà ta quyết định đã đến lúc phải đánh giá vị trí của bà ta.", "eng": "After a year in the job, she decided it was time to take stock of her situation."}, {"viet": "Sau một hồi thẩm vấn kéo dài, cuối cùng cô ta đã thú nhận.", "eng": "After prolonged questioning, she finally confessed."}, {"viet": "Sau nhiều năm làm việc cực nhọc và nghèo túng, ông ta cuối cùng đã suy sụp về sức khỏe.", "eng": "After years of hard work and poverty, he finally snapped."}, {"viet": "Tất cả những gì tôi yêu cầu ở anh là anh đến sớm.", "eng": "All I requested of you was that you came early."}, {"viet": "Càng có nhiều lý do hơn để làm điều gì.", "eng": "All the more reason for doing something."}, {"viet": "Dù cô ta không được quyền dự bữa tối, tôi nghĩ rằng chúng ta nên mời cô ấy với tính cách xã giao.", "eng": "Although she is not entitled to attend the dinner, I think she should be invited as a matter of form."}, {"viet": "Một phản ứng chống lại lời đề nghị.", "eng": "An adverse reaction to the proposals."}, {"viet": "Một người lập dị có nhiều phong cách kỳ lạ.", "eng": "An eccentric with many odd mannerisms."}, {"viet": "Một sự gia tăng số người ghi danh học các lớp múa ba lê.", "eng": "An increase in registrations for ballet classes."}, {"viet": "Một nhạc kịch dành cho trẻ con do nhạc sĩ lỗi lạc Daryl Runswick trình diễn.", "eng": "An opera for children from the musician extraordinaire Daryl Runswick."}, {"viet": "Và bây giờ để tăng thêm phần thích thú cho các bạn, chúng tôi xin giới thiệu một tuyển tập những giai điệu được ưa chuộng.", "eng": "And now for your further delectation, we present a selection of popular melodies."}, {"viet": "Một phương pháp khác để tạo hình đồ gốm là dùng một cái khuôn.", "eng": "Another way to shape pottery is to use a mold."}, {"viet": "Phải chăng các nhà họa sĩ làm việc cho ngành quảng cáo đang tự bán rẻ mình?", "eng": "Are artists who work in advertising selling themselves?"}, {"viet": "Anh có thỏa mãn với đồng lương hiện tại không?", "eng": "Are you content with your present salary?"}, {"viet": "Bạn có theo xu hướng thời trang hiện thời không?", "eng": "Are you up-to-date with current fashion trends?"}, {"viet": "Là diễn viên Jane không cùng hạng với Susan.", "eng": "As an actress Jane is not in the same class as Susan."}, {"viet": "Theo tình hình này, ít có cơ may giải quyết vụ tranh chấp này.", "eng": "As things stand, there is little chance of a settlement in the dispute."}, {"viet": "Cuối cùng, giữa các người đồng hương, anh ta thoải mái phát biểu ý kiến.", "eng": "At last, among friends, he was free to speak his mind."}, {"viet": "Số người dự những buổi thuyết trình của tôi đã giảm đi đáng kể.", "eng": "Attendance at my lectures has fallen off considerably."}, {"viet": "Là mục tiêu cho mọi người chế giễu.", "eng": "Be an object of general derision."}, {"viet": "Được thả tự do theo chính sự cam kết của ai.", "eng": "Be released on one's own recognizance."}, {"viet": "Lối cư xử đã khiến nó bị ghét bỏ.", "eng": "Behaviour that exposed him to odium."}, {"viet": "Cuộc cãi vã gay gắt đã xảy ra từ chỗ hiểu lầm này.", "eng": "Bitter arguments ensued from this misunderstanding."}, {"viet": "Xây bít lò sưởi để ngăn ngừa gió lùa.", "eng": "Brick up a fireplace to prevent draughts."}, {"viet": "Xe buýt chạy ngang qua núi đã bị bọn cướp tấn công.", "eng": "Buses driving through the mountains have been attacked by bandits."}, {"viet": "Nhưng pha trà là một công việc dễ dàng, không phải sao?", "eng": "But making tea is an easy job, isn't it?"}, {"viet": "Mua thịt ở cửa hàng thịt.", "eng": "Buy meat at the butcher's shop."}, {"viet": "Lệnh này được những ai thi hành?", "eng": "By whom was the order executed?"}, {"viet": "Tôi có thể trông cậy vào anh giúp đỡ được không?", "eng": "Can I reckon on you to help?"}, {"viet": "Bạn có biết sửa xe hơi ở mức độ nào đó không?", "eng": "Can you fix a car to some extent?"}, {"viet": "Anh có thể đo bằng gang tay một quãng tám trên đàn piano không?", "eng": "Can you span an octave on the piano?"}, {"viet": "Cứ làm tiếp tục trong khi tôi đi vắng.", "eng": "Carry on working while I'm away."}, {"viet": "Những cơn đau ngực có thể là triệu chứng của bệnh tim.", "eng": "Chest pains may be symptomatic of heart disease."}, {"viet": "Các nhà soạn nhạc cổ điển như Mozart và Haydn.", "eng": "Classical composers such as Mozart and Haydn."}, {"viet": "Nào, ngốc quá đi mất, động não lên nào!", "eng": "Come on, you dozy lot-use your heads!"}, {"viet": "Chúc mừng ai về kết quả thi đậu cao.", "eng": "Congratulate somebody on good exam results."}, {"viet": "Chiều nay tôi có thể nghĩ lại trong phòng được không?", "eng": "Could I rest in the room this afternoon?"}, {"viet": "Ông có thể đánh vần nó cho tôi không?", "eng": "Could you spell that for me?"}, {"viet": "Những phong tục tập quán đặc thù của thế kỷ 18.", "eng": "Customs peculiar to the 18th century."}, {"viet": "Thất bại trong cuộc bầu cử là cả sự ngậm đắng nuốt cay đối với ông ta.", "eng": "Defeat in the election was a bitter pill for him to swallow."}, {"viet": "Mặc dù muốn gặp lại anh ta nhưng cô ấy vẫn từ chối không chịu trả lời thư anh ấy.", "eng": "Despite waiting to see him again, she refused to reply to his letters."}, {"viet": "Anh đã cố ý đá tôi phải không?", "eng": "Did you kick me on purpose?"}, {"viet": "Các cử tri bị vỡ mộng muốn có một đảng khác thay cho cả hai đảng chính.", "eng": "Disillusioned voters want an alternative to the two main parties."}, {"viet": "Hãy rời khỏi máy truyền hình và ra ngoài đi dạo xem nào.", "eng": "Do tear yourself away from the television and come out for a walk."}, {"viet": "Nước bạn xuất khẩu nhiều gỗ phải không?", "eng": "Do you export a lot of lumber?"}, {"viet": "Anh có gặp nhiều người như tôi không?", "eng": "Do you have many people like me?"}, {"viet": "Bạn sống có xa nhà ga lắm không?", "eng": "Do you live far from the station?"}, {"viet": "Em nghĩ anh có nên xin một cái túi đựng thức ăn thừa không?", "eng": "Do you think I should ask for a doggy bag?"}, {"viet": "Bạn đeo kính hay kính sát tròng?", "eng": "Do you wear glasses or contact lenses?"}, {"viet": "Theo học một khoá thương mại ở trường đại học địa phương.", "eng": "Doing a commercial course at the local college."}, {"viet": "Đừng có phóng xe bạt mạng như vậy!", "eng": "Don't drive so doggoned fast!"}, {"viet": "Đừng để bữa ăn tối của anh nguội đi.", "eng": "Don't let your dinner get cold."}, {"viet": "Đừng có thái độ với tôi như thế chứ anh bạn!", "eng": "Don't take that attitude with me, young man!"}, {"viet": "Chắc chắn là anh ấy sẽ mang đàn theo, như lệ thường.", "eng": "Doubtless he'll be bringing his guitar, as usual."}, {"viet": "Trong lúc Nữ hoàng từ chiếc du thuyền hoàng gia lên bờ.", "eng": "During the Queen's landing from the Royal Yacht."}, {"viet": "Công nhân được khuyến khích mua các cổ phần ở hãng đó.", "eng": "Employees are encouraged to purchase shares in the firm."}, {"viet": "Cho dù trời mưa, ngày hội thể thao vẫn sẽ được tổ chức.", "eng": "Even if it rains, sports day will still be held."}, {"viet": "Mọi việc vẫn tốt đẹp cho đến khi Fred đến và làm rối tung tất cả lên.", "eng": "Everything was just fine until Fred came along and fouled things up."}, {"viet": "Giải thích một lý thuyết từng điểm một.", "eng": "Explain a theory point by point."}, {"viet": "Đã nói ngọt với anh ta để đoạt tiền của anh ta.", "eng": "Fast-talked him out of his money."}, {"viet": "Việc làm phim bây giờ được xem như một hình thức nghệ thuật.", "eng": "Film-making is now accepted as an art-form."}, {"viet": "Tập trung tư tưởng của ai vào việc đang làm.", "eng": "Fix one's thoughts on what one is doing."}, {"viet": "Chỉ cần trả thêm 2 đô la là mẹ cũng có thể uống nước.", "eng": "For an extra $ 2 you can have drinks with that as well."}, {"viet": "Pháp không theo kịp Đức về ngành sản xuất than.", "eng": "France has fallen behind Germany in coal production."}, {"viet": "Khán giả há hốc mồm kinh ngạc.", "eng": "Gapes of astonishment on the faces of the spectators."}, {"viet": "Kết hôn là một việc hệ trọng.", "eng": "Getting married is a serious undertaking."}, {"viet": "Hãy nhường đường cho xe cộ đến từ bên phải.", "eng": "Give way to traffic coming from the right."}, {"viet": "Chào ông, hãng hàng không Eastern Airlines nghe đây, tôi là Lý.", "eng": "Good morning, Eastern Airlines, Miss Li's speaking."}, {"viet": "Hadlee đang chạy lấy đà để ném bóng.", "eng": "Hadlee is now running up to bowl."}, {"viet": "Kiên quyết làm việc gì đó.", "eng": "Have the guts to do something."}, {"viet": "Bạn có bao giờ đọc truyện The Tale of Genji chưa?", "eng": "Have you ever read The Tale of Genji?"}, {"viet": "Chị xem sổ danh bạ chưa?", "eng": "Have you seen the address book?"}, {"viet": "Cậu ấy là một người vô tư lự vốn coi nhẹ trách nhiệm.", "eng": "He's a carefree fellow who bears his responsibilities lightly."}, {"viet": "Anh ta được thuê đến trang trí ngôi nhà.", "eng": "He's been engaged to decorate the house."}, {"viet": "Anh ta bị ghi vào bằng lái do đã lái xe ẩu.", "eng": "He's had his license endorsed for dangerous driving."}, {"viet": "Hắn thật là thằng rồ: đi khắp nơi với những bộ quần áo rất kỳ quặc.", "eng": "He's quite mad: he goes round in very odd clothes."}, {"viet": "Hắn ta cuỗm đi 8.000 bảng Anh ăn cắp của chủ.", "eng": "He absconded with £ 8,000 stolen from his employer."}, {"viet": "Anh ấy xin ông chủ cho lãnh trước một tháng lương.", "eng": "He asked his employer to advance him a month's salary."}, {"viet": "Khi nghe tin vui mặt mày nó rạng rỡ hẳn lên.", "eng": "He brightened up when he heard the good news."}, {"viet": "Nó bị kẹt ngón tay cái trong cánh cửa.", "eng": "He caught his thumb in the door."}, {"viet": "Anh ta bọc tấm nệm bằng vải mới.", "eng": "He covered the cushion with new material."}, {"viet": "Anh ta không nói lời nào về chuyện đó.", "eng": "He didn't say a word about it."}, {"viet": "Anh ta chỉ ăn đồ nhạt vì bị loét dạ dày.", "eng": "He eats only bland food because of his ulcer."}, {"viet": "Ông ta cảm thấy bị xúc phạm nặng vì sự phản bội của chúng.", "eng": "He felt deeply wounded by their disloyalty."}, {"viet": "Khi nó bị ngã, lưng nó bị đau dữ dội.", "eng": "He gave his back a nasty jar when he fell."}, {"viet": "Anh ta đã bị đuổi khi ông quản lý mới đến.", "eng": "He got the push when the new manager came."}, {"viet": "Anh ấy đã cố gắng sửa cái khóa ba lần và đành bỏ cuộc.", "eng": "He had three tries at mending the lock and gave up."}, {"viet": "Hắn đã trở nên quen với những công việc mới.", "eng": "He has become accustomed to his new duties."}, {"viet": "Anh ấy có khả năng làm việc đó.", "eng": "He has the ability to do the work."}, {"viet": "Ông ấy cứ nhất định bắt tôi gọi là ông nội Jack.", "eng": "He insists I call him grandpa Jack."}, {"viet": "Ông ta không còn ở tuổi hoa niên nữa.", "eng": "He is no longer in the first flush of youth."}, {"viet": "Nó lắp bắp những gì đó mà tôi cho là một lời xin lỗi.", "eng": "He jabbered out what I assumed was an apology."}, {"viet": "Anh ta rời quân ngũ và trở về đời sống dân sự.", "eng": "He left the army and returned to the civilian life."}, {"viet": "Anh ta đánh bạc thua hết tiền và bây giờ thực sự đang gặp khó khăn về tiền bạc.", "eng": "He lost all his money gambling and now he's really in Queer Street."}, {"viet": "Ông ta hòa nước và rượu nho với nhau.", "eng": "He mingled the water and wine together."}, {"viet": "Ông ấy đã sắp đặt cuộc sống theo những nguyên tắc khắt khe.", "eng": "He ordered his life according to strict rules."}, {"viet": "Mỗi mùa giáng sinh, ông lại thuyết giảng bài giáo lí y như vậy.", "eng": "He preaches the same sermon every Christmas."}, {"viet": "Anh ấy đặt công việc lên trước mọi chuyện.", "eng": "He puts his work before everything."}, {"viet": "Nó xem tất cả những chi tiết hành chính này là điều nó không đáng quan tâm.", "eng": "He regarded all these administrative details as beneath his notice."}, {"viet": "Hắn là một con cáo già xảo quyệt.", "eng": "He's a cunning old fox."}, {"viet": "Ông ta ở trong chính trường suốt cuộc đời của mình.", "eng": "He's been in politics all his life."}, {"viet": "Anh ta là người Luân Đôn chính tông.", "eng": "He's London born and bred."}, {"viet": "Anh ta là người quản lý cửa hàng.", "eng": "He's the one who runs the store."}, {"viet": "Anh ta trông thấy hai người đàn ông chạy vắt giò lên cổ tránh xa con tê giác hung hăng.", "eng": "He saw two men running flat-out from the wild rhinoceros."}, {"viet": "Anh ta ghi bàn từ khoảng cách hai mươi yard.", "eng": "He shot a goal from twenty yards out."}, {"viet": "Ông ta đã đắm mình vào bầu không khí nơi đây.", "eng": "He soaked himself in the atmosphere of the place."}, {"viet": "Anh ta nói rằng anh ta chưa hề nhìn thấy tên tội phạm trước đây.", "eng": "He stated that he had never seen the criminal before."}, {"viet": "Anh ấy thường xuyên bị những đợt suy nhược.", "eng": "He suffers from frequent bouts of depression."}, {"viet": "Nó lao mình vào dưới chiếc xe buýt.", "eng": "He threw himself under a bus."}, {"viet": "Anh ta đã đổi chiếc ôtô của mình và bù thêm tiền để lấy một xe kiểu mới.", "eng": "He traded in his car for a new model."}, {"viet": "Ông ta phá huỷ phần lớn công việc tốt đẹp của người tiền nhiệm.", "eng": "He undid most of the good work of his predecessor."}, {"viet": "Anh ta là kẻ cuồng tín không khoan nhượng, đầu óc hẹp hòi.", "eng": "He was a bigoted narrow minded fanatic."}, {"viet": "Nó hy vọng tàu chạy đúng giờ.", "eng": "He was banking on the train being on time."}, {"viet": "Ông ta mê sảng, nói lảm nhảm về thời thơ ấu của mình.", "eng": "He was delirious, murmuring about his childhood."}, {"viet": "Nó đẹp trai, và thông minh, và là một vận động viên xuất sắc đấy.", "eng": "He was handsome, and smart, and a great athlete."}, {"viet": "Nó được tiếng là lịch sự.", "eng": "He was noted for his politeness."}, {"viet": "Ông ấy bị bỏ tù vì gian lận sổ sách.", "eng": "He was sent to prison for cooking the books."}, {"viet": "Nó mệt nhưng mà vui sau cuộc đi dạo dài.", "eng": "He was tired but happy after the long walk."}, {"viet": "Anh ta đi xuôi ngược vùng bờ biển miền Nam.", "eng": "He went backwards and forwards the South coast."}, {"viet": "Nó không chịu khuất phục trước sự phê bình đó.", "eng": "He won't take that criticism lying down."}, {"viet": "Những người ủng hộ việc sử dụng thực phẩm thiên nhiên đang luôn luôn giành hậu thuẫn.", "eng": "Health food supporters are always evangelising."}, {"viet": "Vẻ mặt giận dữ của cô ta báo trước một sự đối đầu.", "eng": "Her angry face forbode a confrontation."}, {"viet": "Cả hai đứa con bà ta đều có mắt xanh.", "eng": "Her children both have blue eyes."}, {"viet": "Tài sản của bà ta được chia cho bốn đứa con.", "eng": "Her estate was divided between her four children."}, {"viet": "Tóc cô ấy nhạt hơn nhiều do ánh nắng mặt trời.", "eng": "Her hair is much lighter from the sun."}, {"viet": "Cách cư xử tử tế của bà ấy đối với các con tôi làm cho tôi quý mến bà ấy.", "eng": "Her kindness to my children greatly endeared her to me."}, {"viet": "Cuốn sách mới của bà ấy sẽ làm lu mờ tất cả những cuốn trước của bà ấy.", "eng": "Her new book will overshadow all her earlier ones."}, {"viet": "Đề nghị của cô ta bị bác liên tục.", "eng": "Her proposal met with continual rejections."}, {"viet": "Món trứng rán phồng của nàng luôn luôn dễ tiêu.", "eng": "Her soufflés are always so light."}, {"viet": "Cô ấy nói nhỏ quá, tôi hầu như không nghe thấy.", "eng": "Her voice was slow, I could barely hear her."}, {"viet": "Cuộc đời cô ấy là một câu chuyện bi thảm Ảnh hưởng của ô nhiễm đối với các bờ biển thật là bi thảm.", "eng": "Hers is a tragic story effect of the pollution on the beaches is absolutely tragic."}, {"viet": "Tính tự kiêu biểu lộ rõ trong mỗi lời nói của anh ta.", "eng": "His arrogance comes out in every speech he makes."}, {"viet": "Sự huyên thuyên bất tận của anh ta bắt đầu làm tôi bực mình.", "eng": "His ceaseless chatter began to annoy me."}, {"viet": "Ước muốn thành công của anh ta vẫn còn âm ỉ.", "eng": "His desire for success remained latent."}, {"viet": "Mặt hắn xa lạ đối với tôi.", "eng": "His face was unfamiliar to me."}, {"viet": "Cách xử lý tình huống nguy ngập của anh ta chứng tỏ cá tính mạnh mẽ của mình.", "eng": "His handling of the crisis attested to his strength of character."}, {"viet": "Sự thiếu kinh nghiệm của anh ấy được bù đắp bởi sự nhiệt tình học tập.", "eng": "His lack of experience was balanced by his willingness to learn."}, {"viet": "Mẹ nó bất ngờ thôi không trợ cấp cho nó bằng cách báo là bà ấy đang bán nhà.", "eng": "His mother pulled the carpet from under his feet by announcing that she was selling the house."}, {"viet": "Tính nết của anh ta hơi bất thường.", "eng": "His personality is a little unstable."}, {"viet": "Việc từ chức của ông ấy sẽ có hậu quả nghiêm trọng đối với công ti.", "eng": "His resignation will have serious repercussions for the firm."}, {"viet": "Sự khờ dại của anh ta ai cũng biết Tôi đã quyết định không hỏi vay vì tính bủn xỉn ai cũng biết của cô ta.", "eng": "His stupidity is proverbial decided not to ask her for a loan in view of her proverbial meanness."}, {"viet": "Đề nghị giúp đỡ của anh ấy là một đề nghị chân thật.", "eng": "His was a sincere offer of help."}, {"viet": "Thôi đi! Tiếp tục cãi lý như thế thì chẳng ra làm sao cả!", "eng": "Hold the phone! There's no sense in continuing this argument!"}, {"viet": "Nhà ở khu vực này rất đắt tiền.", "eng": "Houses are very expensive in this area."}, {"viet": "Làm thế nào anh có thể phán đoán nên mua cuốn từ điển nào?", "eng": "How can you judge which dictionary to buy?"}, {"viet": "Anh giải thích việc anh ấy làm như thế nào?", "eng": "How do you construe what he did?"}, {"viet": "Anh giữ thăng bằng trên một chân được bao lâu?", "eng": "How long can you balance on one foot?"}, {"viet": "Toàn bộ một bộ tiền bao gồm bao nhiêu đơn vị tiền tệ?", "eng": "How many denominations does a whole set include?"}, {"viet": "Bạn đánh cược vào cuộc đua đó bao nhiêu?", "eng": "How much did you lay on that race?"}, {"viet": "Cưng của mẹ hôm nay có khỏe không?", "eng": "How's my little poppet today?"}, {"viet": "Nhanh lên! Tôi đỗ xe cạnh một chiếc đã đậu trước và người gác đang đến kìa!", "eng": "Hurry up! I'm double-parked and the warden's coming!"}, {"viet": "Tôi muốn ngợi ca và cám ơn tất cả các nhân viên trong cơ quan vì những cố gắng vất vả các bạn đã bỏ vào cho dự án này.", "eng": "I'd like to pay tribute to the office staff for all the hard work they've put in on this project."}, {"viet": "Tôi sẽ đến ngày mai, nếu thời tiết cho phép.", "eng": "I'll come tomorrow, weather permitting."}, {"viet": "Mình sẽ đón cậu ở cổng nhà hát.", "eng": "I'll meet you at the entrance to the theatre."}, {"viet": "Tôi là một người âm thầm mê các chương trình nhiều tập trên TV.", "eng": "I'm a secret fan of soap operas on TV."}, {"viet": "Tôi rất lấy làm hổ thẹn về sơ suất của tôi, xin đừng cho ai chú ý tới nữa.", "eng": "I'm embarrassed about my mistake, please don't draw attention to it."}, {"viet": "Em rất vui khi được đến nước Mỹ.", "eng": "I'm happy to be here in the United States."}, {"viet": "Tinh thần tôi không ổn định nên tôi không thể bàn chuyện tiền bạc được.", "eng": "I'm not in the right frame of mind to start discussing money."}, {"viet": "Tôi xin lỗi, tôi không có ý xúc phạm khi nói vậy.", "eng": "I'm sorry, I intended no offence when I said that."}, {"viet": "Tôi sợ hãi trước viễn cảnh chỉ có một mình trong căn nhà.", "eng": "I'm terrified at the prospect of being alone in the house."}, {"viet": "Tôi đã miệt mài làm việc này hàng tiếng đồng hồ.", "eng": "I've been beavering away at this job for hours."}, {"viet": "Tôi lại quên mất tên anh rồi-chắc hôm nay tôi không được tỉnh táo.", "eng": "I've forgotten your name again-I must be slipping."}, {"viet": "Tôi đã sống ở đây gần nửa cuộc đời.", "eng": "I've lived here the better part of my life."}, {"viet": "Tôi đã dùng thử loại bột giặt mới này, kết quả rất tốt.", "eng": "I've tried this new detergent with excellent results."}, {"viet": "Tôi luôn thấy cần thiết kiểm soát xem các cửa sổ đã đóng hết trước khi ra ngoài chưa.", "eng": "I always make a point of checking that all the windows are shut before I go out."}, {"viet": "Tôi nhận thấy rằng vẫn còn nhiều thứ nữa phải làm.", "eng": "I am sensible that a good deal more is still to be done."}, {"viet": "Tôi nhập vào một nhóm khách du lịch đang đi vào viện bảo tàng.", "eng": "I attached myself to a group of tourists entering the museum."}, {"viet": "Tôi ghé đến ba lần khác nhau nhưng hắn đều đi vắng.", "eng": "I called on three different occasions, but he was out."}, {"viet": "Tôi không thể hầu dưng anh suốt ngày được.", "eng": "I can't keep running after you all day."}, {"viet": "Con có thể đếm được từ 1 đến 100.", "eng": "I can count up to 100."}, {"viet": "Tôi thấy điều anh nói với điều anh làm chẳng có gì giống nhau.", "eng": "I cannot reconcile what you say with what you do."}, {"viet": "Nếu tôi ăn sô-cô-la tôi sẽ nổi ban.", "eng": "I come out in a rash if I eat chocolate."}, {"viet": "Tôi cho là mình may mắn mới có được việc làm.", "eng": "I count myself lucky to have a job."}, {"viet": "Tôi xem đó là một vinh dự lớn khi được mời nói chuyện với anh.", "eng": "I deemed it a great honour to be invited to address you."}, {"viet": "Tôi không đồng ý với anh ở cả hai điểm.", "eng": "I disagree with you on both counts."}, {"viet": "Tôi không biết trọn câu chuyện, nhưng nó có nói đến một đội bóng chày.", "eng": "I don't know the whole story, but he mentioned the baseball team."}, {"viet": "Tôi không nghĩ là có ai cần tôi giúp đỡ, nhưng tôi vẫn cứ đi, để tỏ ra sẵn sàng.", "eng": "I don't think I'm needed as a helper, but I'll go away, just to show willing."}, {"viet": "Tôi không muốn mất thời giờ với những chuyện vớ vẩn ấy.", "eng": "I don't want to waste time on trivialities."}, {"viet": "Tôi không muốn nó tiếp tục.", "eng": "I don't want it to run on."}, {"viet": "Sáng nay, rõ ràng là tôi cảm thấy không khoẻ.", "eng": "I feel decidedly unwell this morning."}, {"viet": "Tôi thấy khó gần gũi anh ta.", "eng": "I find him difficult to approach."}, {"viet": "Tôi mong có con khi nhìn thấy quần áo trẻ con ở cửa hiệu.", "eng": "I get broody when I see baby clothes in shop windows."}, {"viet": "Tôi còn 33 bảng trong tài khoản của tôi.", "eng": "I had 33 pounds left in my bank account."}, {"viet": "Tôi phải thu xếp cho mười cuộc hẹn gặp trong một buổi sáng.", "eng": "I had to fit ten appointments into one morning."}, {"viet": "Tôi có một đầu mối hữu ích ở New York.", "eng": "I have a useful contact in New York."}, {"viet": "Tôi chỉ có biết sơ sơ về những tiểu thuyết của bà ấy.", "eng": "I have no more than a nodding acquaintance with her novels."}, {"viet": "Tối nay tôi có 20 bài luận phải chấm.", "eng": "I have twenty essays to mark tonight."}, {"viet": "Tôi nghe nói Sally lại có thai.", "eng": "I hear Sally's expecting again."}, {"viet": "Tôi hy vọng chúng ta đến muộn không làm phiền họ.", "eng": "I hope our arriving late didn't put them out."}, {"viet": "Tôi đã đoán ông ấy trạc 50 tuổi.", "eng": "I judged him to be about 50."}, {"viet": "Tôi biết rõ nó ở đâu đây-chắc chắn là như vậy!", "eng": "I know that it's here somewhere-it must be!"}, {"viet": "Tôi thích ngôi nhà nhưng không ưa cái khu này.", "eng": "I like the house but I'm not sold on the area."}, {"viet": "Tôi sẽ kiểm tra tình hình phòng trống.", "eng": "I'll check the room availability."}, {"viet": "Tôi sẽ mang nó đến cho bà ngay.", "eng": "I'll send it to you right away."}, {"viet": "Tôi đẫm mồ hôi khắp người vì chạy.", "eng": "I'm all sweaty from running."}, {"viet": "Tôi thấy thích món gì đó dễ tiêu.", "eng": "I'm in the mood for something light."}, {"viet": "Rất tiếc, Susan vừa ra ngoài.", "eng": "I'm sorry, Susan just went out."}, {"viet": "Tôi rất thán phục thấy cô ta đồng ý làm một điều nguy hiểm đến như vậy.", "eng": "I marvel that she agreed to do something so dangerous."}, {"viet": "Tôi phải tìm ra một số đồ linh tinh để góp vào cuộc bán gây quỹ từ thiện của nhà thờ.", "eng": "I must look out some bits and pieces for the church jumble sale."}, {"viet": "Tôi chẳng bao giờ ăn một bữa cơm quá no.", "eng": "I never eat a big dinner."}, {"viet": "Tôi nhồi nhét vô số trích dẫn vào câu trả lời.", "eng": "I padded out my answer with plenty of quotations."}, {"viet": "Tuần trước, tôi tình cờ gặp lại người bạn cũ là Jean ở Pari.", "eng": "I ran across my old friend, Jean, in Paris last week."}, {"viet": "Tôi phản đối việc bị áp đảo tinh thần bởi những quảng cáo trong việc mua các đồ mà tôi không cần.", "eng": "I refused to be brainwashed by advertises into buying something I don't need."}, {"viet": "Hôm nọ tôi có gặp ông ta trên tỉnh.", "eng": "I saw him in town the other day."}, {"viet": "Thật đáng tiếc, tôi sẽ không dự được cuộc liên hoan!", "eng": "I shall have to miss the party, worse luck!"}, {"viet": "Tôi đã qua một tiếng đồng hồ rất hữu ích trong thư viện.", "eng": "I spent a very productive hour in the library."}, {"viet": "Tôi sụt mười pao trong một tuần vì ngày nào cũng chơi bóng quần.", "eng": "I sweated off ten pounds in a week by playing squash everyday."}, {"viet": "Tôi nghĩ nếu bạn mặc áo khoác thì sẽ được đấy.", "eng": "I think if you wore a jacket it would be okay."}, {"viet": "Tôi nghĩ tốt hơn là các ông nên gửi hàng đi bằng đường hàng không.", "eng": "I think you'd better dispatch them by air."}, {"viet": "Tôi đã đo thân nhiệt ngay trước khi rời khỏi nhà, và nhiệt độ là 38,5 ° C.", "eng": "I took my temperature just before I left home, and it was 38,5 ° C."}, {"viet": "Tôi nhận trả những khoản tiền mà người ta đã chi phí cho tôi.", "eng": "I undertook to indemnify them for expenses incurred on my behalf."}, {"viet": "Tôi muốn loại có chất lượng tốt.", "eng": "I want something of good quality."}, {"viet": "Tôi muốn anh thẳng thắn với tôi.", "eng": "I want you to be square with me."}, {"viet": "Tôi cảm thấy ngượng ngùng vì những lời bình phẩm của anh ta về quần áo của tôi.", "eng": "I was embarrassed by his comments about my clothes."}, {"viet": "Tôi chỉ nghe đài bằng nửa tai trong khi làm thức ăn.", "eng": "I was only listening to the radio with half an ear, while preparing some food."}, {"viet": "Tôi bị choáng váng vì bỗng nhận ra rằng có thể tôi sẽ không bao giờ gặp lại cô ấy nữa.", "eng": "I was truck by the sudden realization that I would probably never see her again."}, {"viet": "Nếu cô muốn, tôi sẽ lấy một phần khác cho cô.", "eng": "I will get you another if you like."}, {"viet": "Tôi sẽ không đi vào tất cả các chi tiết đáng buồn, chỉ cần nói rằng toàn bộ câu chuyện là một tai hoạ hoàn toàn.", "eng": "I won't go into all the depressing details, suffice it to say that the whole affair was an utter disaster."}, {"viet": "Tôi sẽ bẻ gãy cần câu nếu tôi ngồi mấy tiếng đồng hồ mà chẳng câu được gì.", "eng": "I would break my rod if I sat about for hours getting nothing."}, {"viet": "Tôi muốn nhấn mạnh điểm này.", "eng": "I would like to stress this point."}, {"viet": "Lý tưởng ra, chúng tôi phải có khoảng không gian rộng gấp đôi hiện nay.", "eng": "Ideally, we should have twice as much office space as we have now."}, {"viet": "Nếu tôi không đến cuộc liên hoan, tôi sẽ cảm thấy thiệt thòi.", "eng": "If I don't go to the party, I shall feel I'm missing out."}, {"viet": "Đây quả thật là ý kiến hay nhất lâu nay tôi mới nghe thấy!", "eng": "If that's not the best idea I've heard in a long time!"}, {"viet": "Nếu chúng ta không có chính quyền mạnh thì sẽ có tình trạng nổi loạn và vô chính phủ.", "eng": "If we do not have strong government, there will be rioting and anarchy."}, {"viet": "Nếu anh không làm được điều đó, tôi cũng đồng tình.", "eng": "If you cannot do it, I will understand."}, {"viet": "Nếu quý khách có bất cứ thắc mắc nào trong suốt chuyến bay, xin đừng ngần ngại hỏi hai nữ tiếp viên hàng không của quý khách.", "eng": "If you have any questions during the flight, please do not hesitate to ask your two hostesses the flight,."}, {"viet": "Nếu bạn dùng thuốc tẩy vết bẩn thì sẽ hết thôi.", "eng": "If you use a stain remover, it will be OK."}, {"viet": "Vào năm 1831, Charler Darwin rời Anh quốc lên tàu Beagle thực hiện chuyến du lịch năm năm vòng quanh thế giới.", "eng": "In 1831 Charler Darwin set sail from England on the Beagle for the five-years trip around the world."}, {"viet": "Trong tiếng Anh, một số câu hỏi có ngữ điệu lên giọng.", "eng": "In English, some questions have a rising intonation."}, {"viet": "Một cách thân mật như một người lớn tuổi tôi ôm lấy vai cô ấy.", "eng": "In my best avuncular fashion I put my arm round her shoulder."}, {"viet": "Trong thời sơ kì của nền văn minh Ai Cập.", "eng": "In the childhood of the civilization of Egypt."}, {"viet": "Trong chiến tranh binh lính có thể hy sinh.", "eng": "In the war soldiers were considered expendable."}, {"viet": "Lạm phát đã thực sự ảnh hưởng vào bưu chính.", "eng": "Inflation has really hit the post office."}, {"viet": "Nếu tôi buộc những cái này lại thành bó thì có tốt hơn không?", "eng": "Is it better if I bundle these up?"}, {"viet": "Có khả năng được cử ra nước ngoài không?", "eng": "Is there a possibility of getting sent abroad to work?"}, {"viet": "Lời tuyên bố của anh có thể đem ra chứng thực được không?", "eng": "Is your statement susceptible of proof?"}, {"viet": "Đó là một toà nhà cao màu vàng, vì vậy ông không thể không thấy đâu.", "eng": "It's a tall yellow building, so you can't miss it."}, {"viet": "Thật khó đánh giá sự thiệt hại, điều này đem lại cho tiếng tăm chính trị của ông ta.", "eng": "It's difficult to appraise the damage, this might do to his political reputation."}, {"viet": "Cái đó viết bằng tiếng Trung Quốc-tôi gần như không hiểu gì cả.", "eng": "It's in Chinese-I can make little of it."}, {"viet": "Với thư tín hải ngoại thì không sao.", "eng": "It's not overseas mail that's the problem."}, {"viet": "Thật kỳ lạ chúng ta không được tin gì về anh ta.", "eng": "It's strange we haven't heard from him."}, {"viet": "Khôn ra thì nên gửi bảo đảm thư có tiền.", "eng": "It's wise to register letters containing banknotes."}, {"viet": "Hiển nhiên là cuộc sống ở nông thôn tốt cho sức khoẻ hơn cuộc sống thành thị.", "eng": "It goes without saying that country life is healthier than town life."}, {"viet": "Bây giờ để tóc ngắn đang là mốt.", "eng": "It is fashionable to have short hair nowadays."}, {"viet": "Đó là phòng 502 ở cùng tầng đó.", "eng": "It is Room 502 on the same floor."}, {"viet": "Có thể đấy không phải là công việc tốt nhất trên đời, nhưng đó là một cách để kiếm sống.", "eng": "It may not be the best job in the world, but it's a living."}, {"viet": "Việc đó thất thường nên tôi cũng không biết.", "eng": "It's irregular so I'm not sure."}, {"viet": "Hình như đã lâu lắm rồi tôi mới có thời gian đọc sách.", "eng": "It seems like it's been ages since I've had time to read."}, {"viet": "Trước kia đi thăm bảo tàng thường không phải trả tiền.", "eng": "It used to cost nothing to visit a museum."}, {"viet": "Tấm thép này được dựng lên vào cuối thế kỷ thứ 18.", "eng": "It was erected towards the end of the 18th century."}, {"viet": "Anh thật là tốt bụng đã nhớ đến ngày sinh nhật của tôi.", "eng": "It was so kind of you to remember my birthday."}, {"viet": "Tôi cho là chuyện đó chỉ được đối với thiếu nữ Nhật chứ còn với thiếu nữ Mỹ thì không thể.", "eng": "It works with Japanese girls, I guess, but not with American girls."}, {"viet": "Nhật Bản đang trở thành một nước tiên tiến nhất đứng về mặt kỹ thuật.", "eng": "Japan is becoming the most advanced country technologically."}, {"viet": "Việc hành nghề báo chí không chấp nhận được đối với báo hiện hành.", "eng": "Journalistic practices unacceptable to the aboveground press."}, {"viet": "Keth dùng nhà tắm suốt cả buổi sáng.", "eng": "Keth's been hogging the bathroom all the morning."}, {"viet": "Chúng ta hãy đến cửa hàng bán thức ăn nhẹ, tôi mong là bạn sẽ thích nó.", "eng": "Let's go to a snack bar, I hope you'll like it."}, {"viet": "Đời sống ở đây đang ngày một khó khăn hơn lúc nào hết-chúng ta hãy rời đi khi xin thôi việc còn dễ.", "eng": "Life here is getting more difficult all the time-let's go while the going's good."}, {"viet": "Nhiều hội nghị quốc tế được tổ chức ở Giơ-ne-vơ.", "eng": "Many international conferences are held in Geneva."}, {"viet": "Những vấn đề, những bất đồng, những bất hoà, v. v. trong đời sống vợ chồng.", "eng": "Marital problems, disagreements, disharmony, etc."}, {"viet": "Cho phép tôi được hân hạnh nhảy điệu này không?", "eng": "May I have the pleasure of this dance?"}, {"viet": "Trong khi tất cả các bạn tôi đều có việc làm lương hậu.", "eng": "Meanwhile, all my friends got well-paid jobs."}, {"viet": "Phần lớn cây cối được nuôi dưỡng bằng nước hút lên qua rễ của chúng.", "eng": "Most plants are nourished by water drawn up through their roots."}, {"viet": "Con la là vật trung gian giữa con ngựa và con lừa.", "eng": "Mule is a compromise between a horse and an ass."}, {"viet": "Bạn tình cũ của tôi luôn xuất hiện mỗi khi tôi đi chơi.", "eng": "My ex-boyfriend turns up like a bad penny every time I go out."}, {"viet": "Sự thiếu kinh nghiệm của tôi có thể làm tôi thất bại.", "eng": "My lack of experience may count against me."}, {"viet": "Túi mua hàng của tôi rách ra và mọi thứ rơi vãi lung tung.", "eng": "My shopping bag broke and everything tumbled out."}, {"viet": "Các cuộc thương thuyết giữa hai bên đã thất bại.", "eng": "Negotiations between the two sides have broken down."}, {"viet": "Chưa, nhưng em đã xem nó trên tivi?", "eng": "No, but I've seen it on TV?"}, {"viet": "Cho dù chuyện gì xảy ra đi nữa, tôi cũng sẽ có mặt ở đó.", "eng": "No matter what happens, I'll be there."}, {"viet": "Giờ đây anh ta lấy một người vợ giàu, anh ta thực sự chắc chắn thành công.", "eng": "Now he's married a rich wife he's really got it made."}, {"viet": "Tất nhiên khi anh già, em sẽ vẫn yêu anh.", "eng": "Of course, I'll still love you when you're old."}, {"viet": "Dầu là tài nguyên thiên nhiên quan trọng nhất của Kôoet.", "eng": "Oil is Kuwait's most important natural resource."}, {"viet": "Trong vấn đề này, cô ta đã tự mình đứng về phía Phe đối lập.", "eng": "On this issue, she has ranged herself with the Opposition."}, {"viet": "Một trong những nhu cầu cơ bản của nhiều nước đang phát triển là nước.", "eng": "One of the basic needs in many developing countries is water."}, {"viet": "Hơi thở của chúng tôi làm mờ cửa kính xe hơi.", "eng": "Our breath is misting up the car windows."}, {"viet": "Ngày nghỉ của chúng ta chỉ thành công một phần.", "eng": "Our holiday was only a partial success."}, {"viet": "Chỗ của chúng tôi ở vị trí rất tốt để nghe nhạc.", "eng": "Our seats were in a good position to hear the music."}, {"viet": "Oxford ở nửa đoạn đường giữa Luân Đôn và Stratford-on-Avon.", "eng": "Oxford is halfway between London and Stratford-on-Avon."}, {"viet": "Dân chúng bắt đầu giậm giật vì tất cả những tin đồn này.", "eng": "People are beginning to get twitchy about all these rumours."}, {"viet": "Peter sẽ biết, anh ấy luôn nhạy bén với tình hình.", "eng": "Peter'll know, he always keeps an ear to the ground."}, {"viet": "Các chính khách luôn làm anh ta giận sôi máu.", "eng": "Politicians always raise his blood pressure."}, {"viet": "Nước mặn làm các vật nổi hơn là nước ngọt.", "eng": "Salt water is more buoyant than fresh water."}, {"viet": "Nhiều lớp áo quần mỏng sẽ giữ cho anh được ấm hơn là một lớp dày.", "eng": "Several thin layers of clothing will keep you warmer than one thick one."}, {"viet": "Bà ta là một đảng viên đã đóng đảng phí đầy đủ.", "eng": "She's a fully paid up member of the party."}, {"viet": "Gần đây cô ta đã trải qua một thời gian khó khăn.", "eng": "She's been through a bad patch recently."}, {"viet": "Cô ấy vừa đoạn tuyệt với người bạn trai của cô ấy.", "eng": "She's just broken up with her boy-friend."}, {"viet": "Cô ta đang ôn lại những điều ghi chú về môn sử để thi.", "eng": "She's revising her history notes for the test."}, {"viet": "Bà ta kết tội chồng mình đã làm cho các con họ chẳng lại bà.", "eng": "She accused her husband of setting their children against her."}, {"viet": "Cô ta trở nên nổi tiếng nhờ mối thân hữu với một số nhà thơ.", "eng": "She became famous through her association with several poets."}, {"viet": "Cô ta làm ngơ trước những sự không chung thuỷ của chồng.", "eng": "She closed her eyes to her husband's infidelities."}, {"viet": "Bà ta đã bỏ đảng Tự do và gia nhập đảng Xã hội.", "eng": "She defected from the Liberals and joined the Socialists."}, {"viet": "Cô ta đã kéo dài cuộc phỏng vấn đến hơn một tiếng đồng hồ.", "eng": "She drew the interview out to over an hour."}, {"viet": "Bà ta sờ để xem chất lượng lụa.", "eng": "She fingered the silk to feel its quality."}, {"viet": "Bà ta bị năm năm tù giam vì tội gian lận.", "eng": "She got a five-years jail sentence for fraud."}, {"viet": "Cô ấy có những đốm trên mặt khi cô ấy bị ốm.", "eng": "She had spots on her face when she was ill."}, {"viet": "Cô ấy rất có ảnh hưởng với ông giám đốc, nên chắc chắn có thể giúp được anh.", "eng": "She has great influence with the manager and could no doubt help you."}, {"viet": "Bà ta té tát lăng mạ người hầu bàn bất hạnh.", "eng": "She hurled insults at the unfortunate waiter."}, {"viet": "Bà ta đang đưa ra những đề nghị cấp tiến để cải cách chế độ bầu cử.", "eng": "She is putting forward radical proposals for electoral reform."}, {"viet": "Bà ta thiếu tiền bạc để chu cấp cho một gia đình đông con cái.", "eng": "She lacks the means to support a large family."}, {"viet": "Với mái tóc ngắn trông cô ấy khác quá.", "eng": "She looks different with her hair short."}, {"viet": "Chắc hẳn cô ấy đã tìm ra chế độ ăn kiêng có hiệu quả.", "eng": "She must have found a diet that works."}, {"viet": "Bà ấy dự định đi du lịch trong giai đoạn nghỉ hưu.", "eng": "She plans to spend her retirement travelling."}, {"viet": "Bà nhớ lại với một nụ cười ao ước quãng thời gian êm đềm của tuổi thơ.", "eng": "She recalled with a wistful the halcyon days of her youth."}, {"viet": "Mụ già ấy là người thích chõ mũi vào công chuyện của kẻ khác!", "eng": "She's an interfering old busybody!"}, {"viet": "Cô ấy đã tự đặt ra cho mình một nhiệm vụ khó khăn.", "eng": "She's set herself a difficult task."}, {"viet": "Cô ấy rán miếng thịt bò để giữ lại nước thịt.", "eng": "She seared the steak to seal in the juices."}, {"viet": "Bà ấy nói quanh co về chuyện chi phí cao.", "eng": "She skirted round the problem of the high cost."}, {"viet": "Cô ta đứng dậy, cáo lỗi và bước ra khỏi cuộc họp.", "eng": "She stood up, excused herself and walked out of the meeting."}, {"viet": "Cô ta đã tưởng viên kim cương bị mất cho tới khi cô thấy cái gì đó lấp lánh trên tấm thảm.", "eng": "She thought the diamond was lost until she saw something glinting on the carpet."}, {"viet": "Cô ấy hứa sẽ trả tiền trước tháng bảy.", "eng": "She undertook to pay the money back before July."}, {"viet": "Một người hoàn toàn xa lạ đến bắt chuyện với cô ta.", "eng": "She was accosted by a complete stranger."}, {"viet": "Cô ta bị lừa mất tiền bởi một tay kế toán bất lương.", "eng": "She was defrauded of her money by a dishonest accountant."}, {"viet": "Cô ta bị thương và do đó phải chịu mất thu nhập.", "eng": "She was injured and suffered consequential loss of earnings."}, {"viet": "Cô ta được tái nhập viện ba ngày sau.", "eng": "She was readmitted to hospital three days later."}, {"viet": "Cô ta là người có giáo dục nên đã không để lộ vẻ thất vọng.", "eng": "She was too well-bred to show her disappointment."}, {"viet": "Cô ấy uống thuốc tránh thai theo lời khuyên của bác sĩ.", "eng": "She went on the pill on her doctor's advice."}, {"viet": "Cô ấy có một vẻ ngạc nhiên trên nét mặt.", "eng": "She wore a surprise expression on her face."}, {"viet": "Bị căng thẳng đến nỗi phải thú nhận tội lỗi.", "eng": "Shocked into a confession of guilt."}, {"viet": "Ra hiệu cho ai phải đi đường nào.", "eng": "Signal to somebody which way to go."}, {"viet": "Sáu giờ đúng, bởi vì tôi phải có mặt ở văn phòng trước tám giờ.", "eng": "Six o'clock sharp, because I have to be in the office by eight."}, {"viet": "Những thiết bị báo khói báo trước cho chúng ta về hỏa hoạn.", "eng": "Smoke sensors warned us of the fire."}, {"viet": "Vậy Troy là chắt của ông.", "eng": "So Troy is your great-grandson."}, {"viet": "Một vài giám đốc công ty kiếm được nhiều tiền.", "eng": "Some company directors make an absolute bomb."}, {"viet": "Có một vài người, nhân đây phải kể đến cả Arthur, đúng là không giữ gìn bản thân một cách đúng mức.", "eng": "Some people, and incidentally that includes Arthur, just won't look after themselves properly."}, {"viet": "Ai đó đã cuỗm mất cái bút của tôi.", "eng": "Somebody has walked off with my pen."}, {"viet": "Rất tiếc làm mất lòng cậu, nhưng mình không có tiền để cho cậu mượn.", "eng": "Sorry to be so disobliging, but I have no money to lend you."}, {"viet": "Những đám ruồi chi chít như các hạt bụi bay lên bay xuống.", "eng": "Squadrons of flies like particles of dust danced up and down."}, {"viet": "Đặt bừa mấy cuốn sách này lên bàn được không?", "eng": "Stick the books on the table, will you?"}, {"viet": "Những giống muỗi có sức chống lại thuốc diệt côn trùng.", "eng": "Strain of mosquitoes that are resistant to insecticide."}, {"viet": "Một tội nghiêm trọng như thế không được bỏ qua mà không bị trừng phạt.", "eng": "Such a serious crime must not go unpunished."}, {"viet": "Những người tắm nắng nằm dang hai tay hai chân trên bãi cát.", "eng": "Sunbathers lie spread-eagled on the sand."}, {"viet": "Anh chuyển câu chuyện sang một đề tài khác.", "eng": "Switch the conversation to different topic."}, {"viet": "Đừng có đụng bàn tay choắt bẩn thỉu của mày vào người tao!", "eng": "Take your dirty little paws off me!"}, {"viet": "Báo tôi biết nếu anh thay đổi địa chỉ.", "eng": "Tell me if you change your address."}, {"viet": "May mắn thay, cuối cùng trời cũng đã tạnh mưa.", "eng": "Thankfully, it's at last stopped raining."}, {"viet": "Chiếc xe đạp ấy của tôi-tôi mua nó hôm qua.", "eng": "That bicycle is mine-I bought it yesterday."}, {"viet": "Con ngựa đó là con được ưa thích là cái chắc.", "eng": "That horse is the odds-on favourite."}, {"viet": "Cái toà nhà đỗ xe nhiều tầng mới xây ấy hoàn toàn là một vật quái đản!", "eng": "That new multi-storey car-park is an utter monstrosity!"}, {"viet": "Đó là lý do mọi người thích nó.", "eng": "That's why everyone likes it."}, {"viet": "Mụ đó là người hết sức khó chịu.", "eng": "That woman is a thorough nuisance."}, {"viet": "Bị cáo đã được chứng nhận là mất trí.", "eng": "The accused has been certified as insane."}, {"viet": "Không khí dường như rung động với ánh sáng trắng.", "eng": "The air seemed to pulsate with the bright light."}, {"viet": "Bản tuyên bố sẽ xuất hiện trên báo chí ngày mai.", "eng": "The announcement will appear in tomorrow's newspapers."}, {"viet": "Quân đội đã trấn áp cuộc nổi dậy.", "eng": "The army has suppressed the revolt."}, {"viet": "Việc cho rằng loài động vật có trí thông minh.", "eng": "The attribution of intelligence to certain animals."}, {"viet": "Đứa bé đó trễ hai tuần rồi mà chưa chào đời.", "eng": "The baby is two weeks overdue."}, {"viet": "Ông quản lý ngân hàng đó thực sự là đáng khiển trách vậy mà ông ta cố trút trách nhiệm đó cho một người thư ký.", "eng": "The bank manager was really to blame, though he tried to pin it on a clerk."}, {"viet": "Mùa thu đẹp đẽ bù lại cho mùa hè ẩm ướt.", "eng": "The beautiful autumn made up for the wet summer."}, {"viet": "Con chim bị vướng vào lưới sắt.", "eng": "The bird got entangled in the wire netting."}, {"viet": "Cơ thể nhanh chóng thích ứng với những thay đổi về nhiệt độ.", "eng": "The body quickly adjusts itself to changes in temperature."}, {"viet": "Sách vở bị vất lung tung khắp phòng.", "eng": "The books were scattered round the room any old how."}, {"viet": "Bọn con trai nhổ nước bọt qua cửa sổ xe lửa.", "eng": "The boys were spitting out of the train window."}, {"viet": "Việc xây dựng chiếc cầu mới sẽ được tiến hành như đã định.", "eng": "The building of the new bridge will go ahead as planned."}, {"viet": "Người mua đã xin một bức thư tín dụng để thanh toán 3000 đô la cho người bán.", "eng": "The buyer applied for a letter of credit to pay 3,000 dollars to the seller."}, {"viet": "Chiếc xe từ từ lăn bánh khỏi lề đường.", "eng": "The car drew slowly away from the kerb."}, {"viet": "Chiếc thảm ngắn mất khoảng ba bộ.", "eng": "The carpet is too short by three feet."}, {"viet": "Ngân hàng trung ương sẽ hướng dẫn những ngân hàng chuyên ngành tham gia vào những hoạt động tín dụng.", "eng": "The central bank will guide the specialized banks to engage in credit activities."}, {"viet": "Các công ty hoá chất đang thải chất độc xuống các con sông và nhánh sông của chúng ta.", "eng": "The chemical companies are poisoning our rivers with effluent."}, {"viet": "Đứa bé há hốc mồm nhìn chằm chằm vào chiếc bánh ngọt to tướng.", "eng": "The child stared open-mouthed at the huge cake."}, {"viet": "Bọn trẻ được gửi vào trường nội trú từ lúc còn nhỏ.", "eng": "The children had been shipped off to boarding-school at an early age."}, {"viet": "Qua sự việc mạo hiểm của chúng, lũ trẻ may mắn không sao cả.", "eng": "The children were none the worse for their adventure."}, {"viet": "Các nền văn minh của Ai Cập cổ xưa và thành phố Babylon.", "eng": "The civilization of ancient Egypt and Babylon."}, {"viet": "Câu lạc bộ thuê một người gác cửa chuyên ngăn cản các phần tử bất hảo vào.", "eng": "The club hires a bouncer to keep out undesirables."}, {"viet": "Chẳng bao lâu người diễn viên hài đã làm cho họ cười bò ra.", "eng": "The comedian soon had them rolling in the aisles."}, {"viet": "Công ty ngày nay đã được thành lập một cách thành công trong mười năm và đã thực sự đạt tới một giai đoạn phát triển đầy đủ.", "eng": "The company has now been successfully established for ten years, and has really come of age."}, {"viet": "Người soát vé thổi còi và con tàu từ từ chuyển bánh.", "eng": "The conductor blew his whistle and the train slowly moved off."}, {"viet": "Việc cải đạo của người Ăng-lô Xắc-xông do các giáo sĩ truyền giáo Cơ đốc tiến hành.", "eng": "The conversion of the Anglo-Saxons by Christian missionaries."}, {"viet": "Đất nước phải xem xét kĩ lưỡng đến thảm kịch thất nghiệp.", "eng": "The country must have a long hard look at the tragedy of unemployment."}, {"viet": "Thủy thủ đoàn xuống xuồng cứu hộ khi tàu đó bị trúng ngư lôi.", "eng": "The crew took to the lifeboats when the ship was torpedoed."}, {"viet": "Tàu tuần dương bị trúng thuỷ lôi và chìm nghỉm trong năm phút.", "eng": "The cruiser was mined, and sank in five minutes."}, {"viet": "Nhảy múa ngoài đường phố thật không đàng hoàng đối với một sĩ quan.", "eng": "The dancing in the street is rather infradig for an officer."}, {"viet": "Các lính phòng thủ trong đồn đã đổi sinh mạng mình bằng một giá thật đắt.", "eng": "The defenders of the fort sold their lives dearly."}, {"viet": "Sự phát triển của công nghiệp ở địa phương.", "eng": "The development of industry in the area."}, {"viet": "Những cây bị bệnh được lộ rõ bằng những khối u nổi lên ở ngoài vỏ.", "eng": "The diseased trees are marked by protuberances on their bark."}, {"viet": "Bác sĩ nói tôi hoàn toàn khỏe mạnh.", "eng": "The doctor said I was as sound as a bell."}, {"viet": "Con chó xộc thẳng qua luống hoa.", "eng": "The dog rushed straight through the flower-bed."}, {"viet": "Người lái xe chạy sau tôi tìm cách vượt lên ở làn đường ngoài cùng.", "eng": "The driver behind me tried to overtake on the inside."}, {"viet": "Vụ động đất đã làm cho bức tường lún xuống và bắt đầu sụp đổ.", "eng": "The earthquake made the wall sink and start to crumble."}, {"viet": "Chỗ vây quanh khu đất công có nghĩa người thường không được sử dụng nó nữa.", "eng": "The enclosure of public land meant that ordinary people could no longer use it."}, {"viet": "Công việc xây cất một bệnh viện mới phải mất nhiều năm.", "eng": "The erection of the new hospital took several years."}, {"viet": "Việc mở rộng nhà máy có nghĩa là có công ăn việc làm cho sáu chục công nhân nữa.", "eng": "The expansion of the factory will mean the employment of sixty extra workers."}, {"viet": "Sự sụp đổ của chính phủ dẫn đến cuộc nội chiến.", "eng": "The fall of the government resulted in civil war."}, {"viet": "Góc phụ nữ của tạp chí thường làm cho nhiều người khó chịu.", "eng": "The feminist angle of the magazine used to annoy a lot of people."}, {"viet": "Cuộn phim được quảng cáo rùm beng như là một kiệt tác nhưng tôi thấy nó rất dở.", "eng": "The film was built up to be a masterpiece, but I found it very disappointing."}, {"viet": "Công ty đang sản xuất ra một sản phẩm mới có sự phối hợp với đồng nghiệp nước ngoài.", "eng": "The firm is working on a new product in combination with several overseas partners."}, {"viet": "Hôm nay cá không cắn câu.", "eng": "The fish won't bite today."}, {"viet": "Đội bóng đá cần hăng hái thêm một chút.", "eng": "The football team needs a bit more ginger in it."}, {"viet": "Mũi xe ô-tô có một chỗ móp.", "eng": "The front of the car has a dent in it."}, {"viet": "Mảnh vườn trông thật đẹp mắt khi hoa hồng đang nở rộ.", "eng": "The garden looks lovely when the roses are in bloom."}, {"viet": "Sự mâu thuẫn rành rành giữa luật của Mỹ do quyền lực đặt ra với các quyền tự nhiên.", "eng": "The glaring discrepancy between American positive law and natural rights."}, {"viet": "Chính phủ và nghiệp đoàn đang trên chiều hướng dẫn đến va chạm.", "eng": "The Government and unions are on a collision course."}, {"viet": "Chính phủ có trách nhiệm trong việc cung cấp dịch vụ y tế.", "eng": "The government is responsible for the provision of medical services."}, {"viet": "Giải Grand National sẽ vẫn được tổ chức chạy dù thời tiết xấu.", "eng": "The Grand national will be run in spite of the bad weather."}, {"viet": "Sự gia tăng tội ác thô bạo là một vấn đề rõ ràng có thật.", "eng": "The growth of violent crime is a very real problem."}, {"viet": "Cái cán tuột ra ngay trong tay tôi.", "eng": "The handle came right off in my hand."}, {"viet": "Tòa án tối cao sẽ phán quyết về luật mới đó có phù hợp với hiến pháp hay không.", "eng": "The high court will rule on the constitutionality of the new law."}, {"viet": "Bệnh viện có một đội ngũ bác sĩ phẫu thuật và những người gây mê đã được kiểm tra.", "eng": "The hospital maintains a staff of board certified surgeons and anaesthesiologists."}, {"viet": "Ngôi nhà đó ở ngay góc phố, anh không thể không trông thấy nó.", "eng": "The house is on the corner, you can't miss it."}, {"viet": "Ý tưởng về một kỳ nghỉ ở nước ngoài chắc chắn là hấp dẫn.", "eng": "The idea of a holiday abroad is certainly appealing."}, {"viet": "Quan sát tính cần cù của những con kiến bé nhỏ này mới thấy thật là phi thường.", "eng": "The industry of these little ants is wonderful to behold."}, {"viet": "Cuộc phỏng vấn tệ hơn anh ta mong đợi nhiều.", "eng": "The interview was much worse than he had expected."}, {"viet": "Súc thịt này chưa chín lắm.", "eng": "The joint isn't quite done yet."}, {"viet": "Ý chủ đạo trong diễn văn của ông ấy là tầm quan trọng của việc giải quyết vấn đề lạm dụng trẻ em.", "eng": "The keynote of his address was the importance of tackling the problem of child abuse."}, {"viet": "Phong cảnh ở Quế Lâm nổi bật bởi những ngọn đồi xanh, nước trong veo, những tảng đá xinh đẹp và những hang động kỳ lạ.", "eng": "The landscape in Guilin is characterized by its green hills, clear water, pretty rocks and grotesque caves."}, {"viet": "Không khí buồn tẻ của viện bảo tàng.", "eng": "The leaden atmosphere of the museum."}, {"viet": "Chiếc áo phao cứu sinh giữ cho cô ta nổi cho đến khi tới bờ.", "eng": "The life jacket buoyed her up until she arrived."}, {"viet": "Những khúc gỗ bị trôi xuôi dòng tới nhà máy.", "eng": "The logs are drifted downstream to the mill."}, {"viet": "Cái máy sẽ tự vận hành trong vài giây.", "eng": "The machine will start by itself in a few seconds."}, {"viet": "Ban giám đốc cần phải gặp gỡ công đoàn.", "eng": "The management should get together with the union."}, {"viet": "Vấn đề đó hầu như lắng xuống rồi.", "eng": "The matter was pretty much dying down."}, {"viet": "Các thành viên của đảng đối lập chất vấn Bộ trưởng tài chính trong bản tường trình về ngân sách của ông ta.", "eng": "The members of the opposition heckled the Finance Minister during his budget speech."}, {"viet": "Vị bộ trưởng đành phải từ bỏ lập trường trước đây của mình.", "eng": "The minister made an undignified retreat from his earlier position."}, {"viet": "Bề mặt của mặt trăng lỗ chỗ những miệng núi lửa nhỏ.", "eng": "The moon's surface is pocked with small craters."}, {"viet": "Chuột không bao giờ dám rời xa hang của nó.", "eng": "The mouse never ventured far from its hole."}, {"viet": "Hải quân sắp đưa ra một loại chiến hạm mới trong năm nay.", "eng": "The navy is introducing a new class of warship this year."}, {"viet": "Khu nhà ở mới xây trải dài sang tận bên kia sân chơi.", "eng": "The new housing estate stretches beyond the playing-fields."}, {"viet": "Máy bay ném bom chiến lược mới giá mỗi chiếc 84 triệu đô la.", "eng": "The new strategic bombers cost $ 84 millions apiece."}, {"viet": "Phiên chợ tới sẽ vào ngày 15.", "eng": "The next market is on the 15th."}, {"viet": "Số người được nhận vào không được quá 200.", "eng": "The number admitted must not exceed 200."}, {"viet": "Viên sĩ quan đã mất uy tín đối với đồng đội của mình.", "eng": "The officer had lost authority with his men."}, {"viet": "Thời kỳ Đồ đá cũ ở châu Âu đã kết thúc hơn 8000 năm trước đây.", "eng": "The Old Stone Age in Europe ended more than 8,000 years ago."}, {"viet": "Tổ chức đó là sáng kiến của ông thị trưởng.", "eng": "The organization was the brainchild of the mayor."}, {"viet": "Lâu đài đã ra thông báo phủ nhận lời buộc tội của tờ báo.", "eng": "The palace has issued a communiqué denying the paper's allegations."}, {"viet": "Tháng vừa qua là một tháng khó khăn đối với ông ấy.", "eng": "The past month has been a difficult one for him."}, {"viet": "Người thời xưa nhìn thấy các chòm sao như là các bức tranh trên bầu trời.", "eng": "The people of long ago saw the constellations are pictures in the sky."}, {"viet": "Vài nốt nhạc chơi sai đã làm hỏng buổi trình diễn của nghệ sĩ pi-a-nô.", "eng": "The pianist's performance was blemished by several wrong notes."}, {"viet": "Nơi các con sông gặp nhau.", "eng": "The place where the rivers join."}, {"viet": "Cái đĩa tôi đánh rơi tan từng mảnh trên sàn.", "eng": "The plate which I dropped lay in pieces on the floor."}, {"viet": "Thi sĩ đã biểu trưng hoá người tình của ông bằng một bông hoa.", "eng": "The poet has symbolised his lover with a flower."}, {"viet": "Cảnh sát đã giữ hai người đàn ông ở đồn cảnh sát để xét hỏi.", "eng": "The police have detained two men for questioning at the police station."}, {"viet": "Cảnh sát đã có mặt tại hiện trường sau năm phút tôi gọi điện.", "eng": "The police were on the spot after five minutes of my phone call."}, {"viet": "Khả năng của hành động đối chiếu với sự chắc chắn của hành động.", "eng": "The possibility of actions contrasted with the certainty of actions."}, {"viet": "Việc tổng thống đến là sự kiện làm bùng nổ một sự hoan hô ầm ĩ.", "eng": "The president's arrival was a signal for an outburst of cheering."}, {"viet": "Sự ngăn ngừa hành động tàn ác với súc vật.", "eng": "The prevention of cruelty to animals."}, {"viet": "Thợ in đã bỏ sót cả một dòng ở chỗ này.", "eng": "The printers have missed out a whole line here."}, {"viet": "Ông giáo sư lơ đãng đi vơ vẩn dọc con đường.", "eng": "The professor bumbled absent-mindedly along the road."}, {"viet": "Các giáo phái Tin lành gồm có giáo phái Giám lý, giáo hội Trưởng lão và giáo phái Rửa tội người lớn.", "eng": "The Protestant denominations include the Methodists, the Presbyterians and the Baptists."}, {"viet": "Chiếc thuyền buồm của Nữ hoàng có mười tàu khu trục đi hộ tống.", "eng": "The Queen's yacht had an escort of ten destroyers."}, {"viet": "Trận mưa ngớt lâu vừa đủ cho tôi đi mua sắm.", "eng": "The rain relented just long enough for me to go shopping."}, {"viet": "Sự hoán đổi cổ phần của mình.", "eng": "The redemption of one's shares."}, {"viet": "Tay phóng viên đánh hơi thấy một chuyện hay.", "eng": "The reporter began to smell a good story."}, {"viet": "Mùi rượu mạnh đúng tuổi thơm phức.", "eng": "The rich bouquet of mature brandy."}, {"viet": "Con đường chỉ có thể đi lại vào thời tiết khô.", "eng": "The road is only negotiable in dry weather."}, {"viet": "Một căn phòng bài trí theo kiểu xưa.", "eng": "The room was furnished with antiques."}, {"viet": "Cái giường nhỏ võng xuống là một sự thay thế tồi tệ cho một chiếc giường.", "eng": "The sagging cot was a poor apology for a bed."}, {"viet": "Kế hoạch tác động ngược trở lại vào cô ta một cách cô không hề nghĩ tới.", "eng": "The scheme rebounded on her in a way she had not expected."}, {"viet": "Thứ hai sẽ là Đại Vực ở Arizona.", "eng": "The second should be the Grand Canyon in Arizona."}, {"viet": "Thân mỏ neo, chìa khoá, cán gậy đánh gôn.", "eng": "The shank of an anchor, a key, a golf-club."}, {"viet": "Con tàu được công bố là bị mất tích.", "eng": "The ship was posted as missing."}, {"viet": "Các cạnh của hai tam giác đều bằng nhau từng đôi một.", "eng": "The sides of the two triangles are equal each to each."}, {"viet": "Bầu trời đỏ rực với mặt trời lặn.", "eng": "The sky was aglow with the setting sun."}, {"viet": "Người lính đánh ngã kẻ tấn công mình bằng một cú đánh mạnh.", "eng": "The soldier floored his attacker with one heavy blow."}, {"viet": "Những đồ trang kim trên bộ áo của nàng tiên trong vở kịch câm.", "eng": "The spangles on the fairy's dress in the pantomime."}, {"viet": "Toàn thể công nhân viên đã tự nguyện đồng ý về một lệnh cấm tăng lương trong một thời gian.", "eng": "The staff have agreed to a voluntary wage freeze."}, {"viet": "Cửa hàng đó có nhiều vòng đeo tay để chọn.", "eng": "The store had a wide selection of bracelets."}, {"viet": "Các sinh viên tập hợp ở hội trường.", "eng": "The students collected in the assembly hall."}, {"viet": "Các mê tín chi phối, các đầu óc nguyên thuỷ.", "eng": "The superstitions that rule primitive minds."}, {"viet": "Giáo viên thổi còi để bắt đầu cuộc đua.", "eng": "The teacher blew a whistle to start the race."}, {"viet": "Các đặc điểm kỹ thuật của chiếc ô tô mới.", "eng": "The technical specifications of a new car."}, {"viet": "Tên trộm chạy rất nhanh khi nghe tiếng báo động.", "eng": "The thief ran like anything when he heard the alarm."}, {"viet": "Bọn trẻ con mệt nhọc lê bước theo sau cha mẹ chúng.", "eng": "The tired children trailed along behind their parents."}, {"viet": "Chuyến tàu đi từ London đến Leeds chỉ dừng có hai lần.", "eng": "The train goes from London to Leeds with only two stops."}, {"viet": "Quân lính tập họp lại chung quanh vị chỉ huy.", "eng": "The troops rallied around their leader."}, {"viet": "Hai mẩu gỗ đã được ghép chặt vào nhau bằng dây kim loại.", "eng": "The two pieces of wood were wired together."}, {"viet": "Vũ trụ được tạo ra từ một quả cầu vật chất nguyên thuỷ.", "eng": "The universe was created out of a primordial ball of matter."}, {"viet": "Video đã được bấm sẵn để ghi lại trận đấu.", "eng": "The video was pre-set to record the match."}, {"viet": "Thời tiết ấm làm cho chúng tôi thèm muốn đi bơi.", "eng": "The warm weather tempted us into going for a swim."}, {"viet": "Các bánh xe phải quay đồng bộ.", "eng": "The wheels must synchronize as they revolve."}, {"viet": "Các cửa sổ để cho ánh sáng và không khí lọt vào.", "eng": "The windows permit light and air to enter."}, {"viet": "Việc anh làm hôm nay hoàn toàn là một sự tương phản việc anh làm tuần trước.", "eng": "The work you did today is quite a contrast to what you did last week."}, {"viet": "Thế hệ trẻ ngày nay không biết cách xử sự.", "eng": "The younger generation today lacks in manners."}, {"viet": "Nhà của họ là một toà nhà to xấu xí như cái trại lính.", "eng": "Their house was a great barracks of a place."}, {"viet": "Năm của họ bắt đầu khi sao Sirius xuất hiện ở phía đông lúc rạng đông, và một năm dài 365 ngày.", "eng": "Their year began when Sirius appeared in the eastern sky at dawn, and was 365 days long."}, {"viet": "Có tin đồn sẽ tổng tuyển cử.", "eng": "There's ( some ) talk of a general election."}, {"viet": "Đồng dollar vừa mất giá thêm.", "eng": "There's been a further devaluation of the dollar."}, {"viet": "Chỉ còn duy nhất một chỗ trống ở bãi đỗ xe.", "eng": "There's only one place left in the car park."}, {"viet": "Có một ít thức ăn thừa của Denny.", "eng": "There are leftovers from Denny's."}, {"viet": "Luật hạn chế nhập cư rất chặt ở nước này.", "eng": "There are strict immigration controls in this country."}, {"viet": "Đã có những sự phát triển tích cực trong các quan hệ quốc tế.", "eng": "There have been positive developments in international relations."}, {"viet": "Có một loại vi-rút đang xâm nhập.", "eng": "There is a virus going around."}, {"viet": "Trong món mì thịt bò có cái gì đó.", "eng": "There is something in the beef noodles."}, {"viet": "Có một lớp bụi trên sách trước khi tôi lau chúng.", "eng": "There was a layer of dust on the books before I cleaned them."}, {"viet": "Có một khoảng cách thẳng đứng từ nơi chúng tôi đứng tới biển phía dưới.", "eng": "There was sheer drop from where we stood to the sea below us."}, {"viet": "Sẽ có một trận ầm ĩ thật sự nếu người ta bắt được anh đang ăn cắp.", "eng": "There will be a real fuss if you're caught stealing."}, {"viet": "Loại cá này có trọng lượng thay đổi từ 3 đến 5 pao.", "eng": "These fish vary in weight from 3 lb to 5 lb."}, {"viet": "Những thủ đoạn đáng xấu hổ này nhằm đảm bảo cho việc đắc cử của ông ta.", "eng": "These shameful manoeuvres were aimed at securing his election."}, {"viet": "Họ đang tìm cách đổ lỗi cho người khác.", "eng": "They're trying to fasten the blame on others."}, {"viet": "Họ là những người tốt bụng nhất thế giới.", "eng": "They are among the most benign people on earth."}, {"viet": "Họ tự nhốt mình trong phòng.", "eng": "They barricaded themselves in their rooms."}, {"viet": "Họ còn tiếp tục đào xuống sâu cho đến khi gặp một vài túi khí thiên nhiên.", "eng": "They continued down until they came to some pockets of natural gas."}, {"viet": "Họ đã cố làm cô ta sung sướng nhưng vô hiệu.", "eng": "They endeavoured to make her happy but in vain."}, {"viet": "Họ không biết thuần hoá một con thú nào hoặc trồng một thứ cây gì.", "eng": "They had not learned to tame any animals or grow plants."}, {"viet": "Họ chỉ dừng công việc và ngồi ăn.", "eng": "They just stop working and sit and eat."}, {"viet": "Họ gặp nhau mỗi tháng một lần để đánh giá tình hình chính trị hiện nay.", "eng": "They meet monthly to asses the current political situation."}, {"viet": "Họ tiên đoán đúng là đảng Bảo thủ sẽ thắng trong cuộc bầu cử.", "eng": "They prophesied correctly that the Conservatives would win the election."}, {"viet": "Họ bán tất cả tài sản ở Nam Phi.", "eng": "They sell off all investments in south Africa."}, {"viet": "Họ lần ra tên tội phạm ở một ngôi nhà trong thành phố.", "eng": "They traced the criminal to a house in the city."}, {"viet": "Chúng bị lừa nên tin rằng chúng ta chưa sẵn sàng tấn công.", "eng": "They were bluffed into believing we were not ready for the attack."}, {"viet": "Người ta đã khuyên họ không nên leo núi lúc thời tiết xấu như thế.", "eng": "They were warned not to climb the mountain in such bad weather."}, {"viet": "Người ta đón chào sự bổ nhiệm này với lòng nhẹ nhõm, tinh thần bải hoải, v. v.", "eng": "This appointment was greeted with relief, dismay, etc."}, {"viet": "Công ty này là tổ chức kinh doanh lớn nhất thuộc loại của nó.", "eng": "This company is one of the largest enterprises of its kind."}, {"viet": "Tạp chí thời trang này có những bức ảnh chụp các hoá mĩ phẩm.", "eng": "This fashion magazine often has photograph of makeovers in it."}, {"viet": "Đây là một loại hàng dệt rất đặc biệt.", "eng": "This is a very special fabric."}, {"viet": "Điều này không khác mấy so với hệ thống cũ.", "eng": "This isn't materially different from the old system."}, {"viet": "Tin đó làm tất cả chúng tôi giật mình và chú ý.", "eng": "This news made us all sit up and take notice."}, {"viet": "Cái mà người ta cho là Cuốn tiểu thuyết hết sức độc đáo thật ra là vừa tẻ nhạt lại vừa viết dở.", "eng": "This quote startlingly original novel unquote is both boring and badly written."}, {"viet": "Đề tài ấy nằm ngoài tầm hiểu biết của tôi.", "eng": "This subject is beyond the scope of my mind."}, {"viet": "Những chỉ số bán ra của năm nay là rất đáng khích lệ.", "eng": "This year's sales figures are very encouraging."}, {"viet": "Theo ý kiến của tôi, những vấn đề như phương thức đầu tư, giá cả và phương thức thanh toán là những vấn đề đầu tiên phải dàn xếp cho các cuộc thương lượng kinh doanh của chúng ta.", "eng": "To my mind, the first things to settle upon for our business negotiations are some initial matters, such as mode of investment, prices, and method of payment."}, {"viet": "Hôm nay, việc mua bán ở thị trường chứng khoán rất sôi nổi.", "eng": "Trading was brisk on the Stock Exchange today."}, {"viet": "Những nguyên liệu có giá trị đã được thu hồi ( từ con tàu vận tải bị đắm ).", "eng": "Valuable raw materials were salvaged ( from the sunken freighter )."}, {"viet": "Nước được đưa qua một loạt kênh thuỷ lợi.", "eng": "Water is channelled through a series of irrigation canals."}, {"viet": "Chúng ta sẽ doạ cô ta không được nói với cảnh sát.", "eng": "We'll scare her out of telling the police."}, {"viet": "Tất cả chúng tôi không giỏi ca hát hay chơi nhạc.", "eng": "We're not all good at singing and playing, but it's very important in our lives."}, {"viet": "Chúng ta chỉ có một tiếng đồng hồ để làm công việc đó.", "eng": "We've got only an hour to do the job."}, {"viet": "Tất cả chúng tôi đều tự nguyện vận chuyển lương thực tới cho người già.", "eng": "We all volunteered to deliver the food to the old people."}, {"viet": "Chúng tôi chuyển từ Luân Đôn về sống ở nông thôn.", "eng": "We are removing from London to the country."}, {"viet": "Chúng ta không thể gán tất cả những tồi tệ về kinh tế cho sự quản lí yếu kém của đảng Bảo thủ.", "eng": "We can't ascribe all our economic alls to Tory mismanagement."}, {"viet": "Chúng tôi cho ngựa chạy nước tế trên nhiều dặm.", "eng": "We cantered our horses for several miles."}, {"viet": "Chúng tôi bàn nhau khi nào thì đi.", "eng": "We discussed when to go."}, {"viet": "Chúng tôi nuôi nấng cháu bé gái mấy tháng trong khi mẹ cháu ốm nằm viện.", "eng": "We fostered the little girl for several months while her mother was in hospital."}, {"viet": "Chúng tôi tìm ra được chỗ đó thật là cả một công phu kinh khủng.", "eng": "We had the dickens of a job finding the place."}, {"viet": "Chúng tôi chưa nhận được thư báo là nhận được thư của chúng tôi.", "eng": "We have had no acknowledgment of our letter yet."}, {"viet": "Chúng tôi hi vọng cuộc sống đại học sẽ giúp nó rộng cánh một chút.", "eng": "We hope college life would help him to spread his wings a bit."}, {"viet": "Chúng tôi sẽ cố hết sức để tẩy vết ố đó.", "eng": "We'll try our best to remove the stain."}, {"viet": "Chúng ta phải tiếp đón quý khách một cách long trọng.", "eng": "We must give our guests the red carpet treatment."}, {"viet": "Chúng tôi hiện có đầy đủ số lượng nhân viên đóng gói.", "eng": "We now have a full complement of packers."}, {"viet": "Chúng tôi nhận ra sự thật những điều anh nói.", "eng": "We recognized the truth of what you said."}, {"viet": "Nếu chúng tôi có tiền thì chúng tôi đã chuyển đến một ngôi nhà lớn hơn.", "eng": "We should move to a larger house if we had the money."}, {"viet": "Chúng tôi xoắn cái khăn trải giường thành sợi thừng và thoát ra bằng cách bám nó tụt xuống.", "eng": "We twisted the bed sheets into a rope and escaped by climbing down it."}, {"viet": "Chúng tôi bon bon ( trên xa lộ ) với tốc độ bảy mươi dặm một giờ.", "eng": "We were bowling along ( the motorway ) at seventy miles per hour."}, {"viet": "Chúng tôi sẽ tiến hành cuộc điều tra đó một cách khẩn trương nhất.", "eng": "We will carry out the enquiry as expeditiously as possible."}, {"viet": "À, ông có thể cho tôi những danh mục này không?", "eng": "Well, could you leave these with me?"}, {"viet": "Này, có thể nói con người cô ta biết cách tự ve vuốt đấy nhé.", "eng": "Well, she was a girl knew how to enjoy herself, you might say."}, {"viet": "Có chuyện gì vậy-mày không dám đọc những điều trong đó sao?", "eng": "What's the matter-daren't you read what it says?"}, {"viet": "Những khoản được kê trong hoá đơn này gồm những gì?", "eng": "What are the items covered in this bill?"}, {"viet": "Một ngày bình thường ở sở làm bạn thường làm những việc gì?", "eng": "What do you do in an average day at your job?"}, {"viet": "Những ngày nghỉ nào là tuần lễ vàng?", "eng": "What holidays make up Golden Week?"}, {"viet": "Mặt hàng xuất khẩu chủ yếu của New Zealand là gì?", "eng": "What is the primary export of New Zealand?"}, {"viet": "Chuyện gì làm mẹ buồn, hả mẹ?", "eng": "What makes you feel unhappy, momma?"}, {"viet": "Những việc gì làm cho bạn cảm thấy bị căng thẳng?", "eng": "What things cause you to feel stressed?"}, {"viet": "Khi nào anh đạt được trình độ A?", "eng": "When are you taking A level?"}, {"viet": "Khi tôi mua chuối xanh, chúng sẽ tươi lâu hơn.", "eng": "When I buy green bananas, they will stay fresher longer."}, {"viet": "Năm 67 tuổi, bà chết vì hậu quả của sự tiếp xúc quá nhiều với chất ra-đi-um, là chất mà chính bà và chồng bà đã khám phá ra.", "eng": "When she was 67, she died from the effects of too much exposure to radium, the very element she and her husband discovered."}, {"viet": "Cuối cùng khi chúng tôi lên được đỉnh đồi, tất cả chúng tôi đều kiệt sức.", "eng": "When we finally topped the hill, we were all exhausted."}, {"viet": "Tôi có thể thấy Bắc cực quang ở đâu?", "eng": "Where can I see the Northern Lights?"}, {"viet": "Anh làm việc ở bộ phận nào trong công ty?", "eng": "Which division of the company do you work in?"}, {"viet": "Mặc dù tôi thấy công việc này khó khăn đấy nhưng tôi không nghĩ rằng không thể làm được.", "eng": "While I admit the things is difficult, I do not think it impossible."}, {"viet": "Biết đâu đấy điều này có thể là điểm khởi đầu cho tình bằng hữu tốt đẹp.", "eng": "Who knows, this could be the beginning of a beautiful friendship."}, {"viet": "Tại sao anh không bỏ cái thói tránh né chờ xem mà hãy quả quyết lấy một lần đi?", "eng": "Why don't you come down of the fence and commit yourself for once?"}, {"viet": "Việc tập luyện sẽ hủy bỏ nếu trời mưa phải không?", "eng": "Will practice be canceled if it rains?"}, {"viet": "Chúng mày có thôi không làm ầm ĩ kinh khủng như thế nữa không nào!", "eng": "Will you stop making that horrible noise!"}, {"viet": "Không có tin tức gì về những người thám hiểm, chúng ta chỉ có thể phỏng đoán vị trí hiện nay của họ.", "eng": "With no news from the explorers we can only surmise their present position."}, {"viet": "Lo nghĩ và bệnh tật đã làm cho ông ta già trước tuổi.", "eng": "Worry and illness had made him prematurely old."}, {"viet": "Cháu có muốn đi ngủ ngay bây giờ không?", "eng": "Would you like to go to bed now?"}, {"viet": "Vui lòng bảo tài xế chở chúng tôi đến khách sạn nhé?", "eng": "Would you please tell the driver to take us to the Hotel?"}, {"viet": "Đúng, tốc độ của cô ấy là hoàn toàn tốt, sau khi đã cân nhắc kĩ.", "eng": "Yes, her speed was quite good, after considering."}, {"viet": "Vâng, anh chỉ cần một bếp lửa nhỏ.", "eng": "Yes, you just need a little fire."}, {"viet": "Anh phải ăn mặc cho chỉnh tề một chút trước khi ra ngoài.", "eng": "You'll have to smarten yourself up a bit before going out."}, {"viet": "Anh đã quá già để mà đi lang thang khắp Châu Âu.", "eng": "You're too old to go gallivanting around Europe."}, {"viet": "Anh chỉ được mang trong giới hạn tám lít rượu miễn thuế.", "eng": "You are restricted to eight litres of duty-free wine."}, {"viet": "Anh không thể thắng được, anh đã hoàn toàn bị đặt vào thế kẹt rồi.", "eng": "You can't win, you've been completely snookered."}, {"viet": "Bây giờ ông có thể nhìn thấy con sông.", "eng": "You can see the river now."}, {"viet": "Anh không cần phải đội mũ trong nhà.", "eng": "You don't need to keep your hat on indoors."}, {"viet": "Anh phải lên gân vào ở cuộc phỏng vấn việc làm.", "eng": "You have to sell yourself at a job interview."}, {"viet": "Bạn có thể để ý thấy rằng quán rượu là dành cho đàn ông, chứ không dành cho phụ nữ.", "eng": "You may notice that the pub is for men, but not for women."}, {"viet": "Anh đành phải cam chịu một cuộc sống nghèo khổ.", "eng": "You must reconcile yourself to a life of poverty."}, {"viet": "Có thật là anh đã thắng được ngần ấy tiền cá một con ngựa không?", "eng": "You really won all that money on a horse??"}, {"viet": "Bạn nên thử một ít súp ướp lạnh này.", "eng": "You should try some of this chilled soup."}, {"viet": "Người ta sẽ yêu cầu anh phải làm việc các ngày thứ bảy.", "eng": "You will be expected to work on Saturdays."}, {"viet": "Hành vi của anh thiếu nhất quán-anh nói một đằng làm một nẻo.", "eng": "Your behaviour lacks consistency-you say one thing and do another."}, {"viet": "Kiến nghị của anh đang được cứu xét một cách khẩn trương.", "eng": "Your proposal is being actively considered."}]