[{"viet": "5.000 bảng Anh đã được dành riêng cho một kế hoạch huấn luyện mới.", "eng": "5,000 has been appropriated for a new training scheme."}, {"viet": "Một tấm thảm hình vuông mỗi cạnh 6 mét có diện tích 36 mét vuông.", "eng": "A carpet six metres square has an area of 36 square metres."}, {"viet": "Một cách phối hợp màu sắc có màu đỏ nổi bật.", "eng": "A colour scheme in which red predominates."}, {"viet": "Một khoá học cấp tốc về lập trình điện toán.", "eng": "A crash course in computer programming."}, {"viet": "Một sự khác biệt quan điểm về vai trò của Anh đối với châu Âu.", "eng": "A difference of opinion about Britain's role vis-à-vis Europe."}, {"viet": "Một cái quạt đặt trong bếp để thổi đi những mùi nấu nướng.", "eng": "A fan in the kitchen for expelling cooking smells."}, {"viet": "Một vi khuẩn bệnh cúm không phản ứng gì với sự chữa trị.", "eng": "A flu virus that is not responsive to treatment."}, {"viet": "Một nền giáo dục tốt có thể trang bị cho bạn suốt đời.", "eng": "A good education should equip you for life."}, {"viet": "Một cái bàn chải tóc có gáy bằng đồi mồi.", "eng": "A hairbrush with a tortoiseshell back."}, {"viet": "Một căn nhà có thể có khả năng cải tiến được.", "eng": "A house with some scope for improvement."}, {"viet": "Sự thay đổi nơi thi đấu vào phút cuối.", "eng": "A last-minute change of venue."}, {"viet": "Cuộc xung đột lâu dài và gay gắt giữa giới chủ và công nhân.", "eng": "A long and bitter conflict between employers and workers."}, {"viet": "Một sinh vật giống người cao khoảng 4 bộ Anh.", "eng": "A manlike creature about 4 feet tall."}, {"viet": "Tình yêu của người mẹ đối với con mình thì mạnh mẽ vô cùng.", "eng": "A mother's love for her child is very strong."}, {"viet": "Một sự nghiệp cao cả đã bị làm vẩn đục bởi lòng tham của những người ủng hộ của nó.", "eng": "A noble cause defiled by the greed of its supporters."}, {"viet": "Một sự mô tả thiếu sinh động các biến cố thực sự rất sôi động.", "eng": "A pedestrian description of events that were actually very exciting."}, {"viet": "Một vở kịch được các nhà bình luận khen ngợi nhiệt liệt.", "eng": "A play which reviewers have praised highly."}, {"viet": "Một bản phóng sự điều tra về vụ thất thoát ngân quỹ nhà nước.", "eng": "A probe into the disappearance of government funds."}, {"viet": "Một công thức nấu ăn cho bạn biết là bạn cần bao nhiêu trứng, bao nhiêu sữa, v. v.", "eng": "A recipe tells you that you need so many eggs, so much milk, etc."}, {"viet": "Một cuộc thử tài về bóng bầu dục giữa những người có thể và tuyển được.", "eng": "A Rugby trial between probables and possibles."}, {"viet": "Một bộ sừng nai và các vật kỷ niệm săn bắn khác.", "eng": "A set of antlers and other trophies."}, {"viet": "Một số tiền nhỏ để trả cho công phục vụ của ai.", "eng": "A small payment in consideration of somebody's services."}, {"viet": "Hình vuông có bốn cạnh còn hình tròn thì không có cạnh nào cả.", "eng": "A square has four sides but a circle has no sides."}, {"viet": "Một cái sân thấp hơn ở cuối khu vườn.", "eng": "A sunken terrace at the bottom of the garden."}, {"viet": "Một con hổ quất đuôi qua lại, từ bên nọ sang bên kia một cách giận dữ.", "eng": "A tiger lashing its tail angrily to and fro, from side to side."}, {"viet": "Một túp lều trong làng lợp mái bằng lá cọ.", "eng": "A village hut thatched with palm leaves."}, {"viet": "Một từ với nhiều sắc thái về nghĩa.", "eng": "A word with many shades of meaning."}, {"viet": "Axít đã làm rỗ bề mặt miếng bạc.", "eng": "Acid had pitted the surface of the silver."}, {"viet": "Sau một vài cốc rượu, hắn bắt đầu thư giãn và nói cởi mở hơn.", "eng": "After a few drinks, he began to unwind and talk more openly."}, {"viet": "Sau giai đoạn phổng phao Jane trở nên rất mảnh mai.", "eng": "After Jane lost her puppy-fat she became very slim."}, {"viet": "Sau bữa tiệc tất cả chúng tôi ai về phòng nấy.", "eng": "After the party we all went off to our respective rooms."}, {"viet": "Bất thình lình cánh cửa mở tung ra.", "eng": "All at once the door opened."}, {"viet": "Tất cả những gì làm bại lộ sự ngạc nhiên của anh ta là một cái hít vào nhanh.", "eng": "All that betrayed hissurprise was a sharply indrawn breath."}, {"viet": "Cho phép người thuê nhà được quyền sử dụng khu vườn.", "eng": "Allow a tenant the use of the garden."}, {"viet": "Trong số những người có mặt, có bà thủ tướng cùng phu quân.", "eng": "Among those present were the Prime Minister and her husband."}, {"viet": "Một bài báo chỉ đề cập sơ lược đến một vấn đề.", "eng": "An article that only glances at a problem."}, {"viet": "Một cuộc tư vấn lương tâm của ai.", "eng": "An exploration of one's conscience."}, {"viet": "Mùi tham nhũng bao quanh con người hắn.", "eng": "An odor of corruption hangs about him."}, {"viet": "Một anh nhà quê rặt hoàn toàn chẳng có một chút lịch sự gì cả.", "eng": "An unsophisticated country fellow who completely lacked polish."}, {"viet": "Động vật không có xương sống thì không có não.", "eng": "Animals without backbones have no cerebrums."}, {"viet": "Ký thêm tên ai vào một văn kiện.", "eng": "Append one's signature to a document."}, {"viet": "Tất cả chúng ta có thỏa thuận với nhau về phương cách hành động hay nhất không?", "eng": "Are we all agreed on the best course of action?"}, {"viet": "Anh có ở trong danh sách trúng tuyển không?", "eng": "Are you on the short list?"}, {"viet": "Pháo binh được triển khai ở phía tây.", "eng": "Artillery was deployed in the west."}, {"viet": "Ngay khi vừa đến anh ta đã đi thẳng tới quầy rượu.", "eng": "As soon as he arrived he made a beeline for the bar."}, {"viet": "Khác với chiêm tinh học, thiên văn học là một khoa học chính xác.", "eng": "Astronomy, as distinct from astrology, is an exact science."}, {"viet": "Vào tiếng bíp thứ ba là đúng 6 giờ 45.", "eng": "At the third pip the time will be 6.45 exactly."}, {"viet": "Nhóm côn đồ đi lang thang khắp phố.", "eng": "Bands of hooligans roving round the streets."}, {"viet": "Tức bực về thời gian chậm trễ dài.", "eng": "Be in a froth over the long delay."}, {"viet": "Vì chúng ta đã vật thể hóa các loài thú vật nên chúng ta có thể xử lý chúng một cách khách quan.", "eng": "Because we have objectified animals we are able to treat them impersonally."}, {"viet": "Better là dạng so sánh tương đối của good.", "eng": "Better is the comparative of good."}, {"viet": "Cả hai mẹ con đều khỏe.", "eng": "Both mother and baby are doing well."}, {"viet": "Chải mớ lông rối của một con chó.", "eng": "Brush the tangles out of a dog's fur."}, {"viet": "Nhưng tôi e rằng 5% là giá thấp nhất của chúng tôi rồi.", "eng": "But I'm afraid 5% is our rock-bottom price."}, {"viet": "Nhưng khi nó hỏng, chúng tôi phải sửa nó.", "eng": "But when it breaks we have to fix it."}, {"viet": "À này, cô có thể cho tôi biết thêm chi tiết về nó được không?", "eng": "By the way, could you give me more details about it?"}, {"viet": "Vui lòng cho tôi một tách cà phê mới pha nhé?", "eng": "Can I have a fresh cup of coffee please?"}, {"viet": "Anh có thể khuyên tôi tiếp theo phải làm gì không?", "eng": "Can you advise me what to do next?"}, {"viet": "Xin các anh đến kiểm tra?", "eng": "Can you please come and check it out?"}, {"viet": "Anh không thể nói thẳng cho tôi là được hay không à?", "eng": "Can't you give me a straight yes or no?"}, {"viet": "Những thay đổi về nhiên liệu được sử dụng để đẩy.", "eng": "Changes in the fuel used for propulsion."}, {"viet": "Các tín đồ Thiên Chúa giáo tin rằng Chúa Giêsu đã sống lại vào ngày Chủ Nhật Phục Sinh.", "eng": "Christian believe that Jesus rose from the dead on Easter Sunday."}, {"viet": "Các đồng nghiệp đã tặng vị chủ tịch về hưu một tấm séc.", "eng": "Colleagues presented the retiring chairman with a cheque."}, {"viet": "Cô đọng một lập luận chỉ trong vài câu.", "eng": "Compress an argument into just a few sentences."}, {"viet": "Việc chuyển đổi tiếng Anh phân biệt giới tính qua tiếng Anh không phân biệt giới tính không phải là phương thuốc chữa cấp thời-đó chẳng qua là bất cứ cái gì máy móc thôi.", "eng": "Conversion of sexist English into nonsexist English is not a quick fix-it is anything but mechanical."}, {"viet": "Xin cô để lại tiền cọc?", "eng": "Could you leave a deposit, please?"}, {"viet": "Những tên tội phạm tại đào ở vùng lân cận.", "eng": "Criminals who were loose in the neighborhood."}, {"viet": "David từ Tây Ban Nha đã gửi cho chúng tôi một tấm bưu thiếp.", "eng": "David sent us a card from Spain."}, {"viet": "Hãy kể cho tôi biết anh đã được tiếp đón như thế nào.", "eng": "Describe to me how you were received."}, {"viet": "Anh đã ăn hết cả những cái đó à?", "eng": "Did you eat all of them?"}, {"viet": "Bữa ăn tối vào lúc năm giờ đúng và chúng ta sẽ đến nhà John sau.", "eng": "Dinner is at five sharp and we will leave for John's sometime afterwards."}, {"viet": "Im đi nào, nếu không mày làm tao tính sai đấy.", "eng": "Do keep quiet or you'll throw me out in my calculations."}, {"viet": "Anh có dùng cả than và củi để đốt lò sưởi này không?", "eng": "Do you burn coal as well as wood on this fire?"}, {"viet": "Cô có loại kẹo nào không có đường không?", "eng": "Do you have any candy that is sugar-free?"}, {"viet": "Bà có biết cậu ấy mặc cỡ nào không?", "eng": "Do you know what size he wears?"}, {"viet": "Bạn có thật sự thích xem Thế Vận Hội không?", "eng": "Do you really like to watch the Olympics?"}, {"viet": "Bạn có nghĩ bạn qua được kỳ kiểm tra không?", "eng": "Do you think you passed the test?"}, {"viet": "Lãi suất tăng phụ thuộc anh giữ giấy chứng nhận bao lâu phải không?", "eng": "Does the rat go up depending on how long you keep the certificate?"}, {"viet": "Khỏi cần phải diện, cứ đến với quần áo anh mặc như mọi ngày.", "eng": "Don't bother to dress up-come as you are."}, {"viet": "Đừng có ngắt lời diễn giả bây giờ, ông ta sẽ trả lời các câu hỏi sau.", "eng": "Don't interrupt the speaker now, he will answer questions later."}, {"viet": "Đừng có rải tiền của bạn khắp nơi.", "eng": "Don't scatter your money around."}, {"viet": "Đừng lo; mọi khó khăn đang được giải quyết.", "eng": "Don't worry; everything's under control."}, {"viet": "Lúc nào đó hãy ghé qua chỗ tôi, tôi sẽ cho bạn xem bộ sưu tập của tôi.", "eng": "Drop over sometime and I'll show you my collection."}, {"viet": "Edith rất thận trọng khi nặn óc tìm các từ ngữ trong khi thân thể nhỏ bé của cô ta run lẩy bẩy vì cố gắng tìm cho ra các từ ngữ đó.", "eng": "Edith would watch her wrestling with words, her thin little body juddering with the effort to unlock them."}, {"viet": "Bị vướng vào một mạng lưới chính trị.", "eng": "Entangled in a mesh of political intrigue."}, {"viet": "Mọi người đều cho rằng ông ta đáng trách nhưng họ không biết mặt kia của vấn đề.", "eng": "Everyone assumes he's to blame but they don't know the other side of the coin."}, {"viet": "Xin lỗi ông bạn, tôi mượn tờ báo được không?", "eng": "Excuse me, old man, can I borrow your newspaper?"}, {"viet": "Không nói chữ không, có thể được ngầm hiểu là có.", "eng": "Failure to say No may, by implication, be taken to mean Yes."}, {"viet": "Khuấy động trong đám công nhân nhà máy.", "eng": "Ferment trouble among the factory workers."}, {"viet": "Trước tiên là đo nó cho kỹ, sau đó cưa gỗ cho đúng chiều dài.", "eng": "First measure it up, then cut the timber to the correct length."}, {"viet": "Theo những điều chỉ dẫn trên hộp sơn.", "eng": "Follow the instructions on a tin of paint."}, {"viet": "Những người nước ngoài nhập cư khó hội nhập.", "eng": "Foreign immigrants who don't integrate well."}, {"viet": "Thưa ông, từ địa phương của ông, giá mỗi cú đi New York là khoảng 5 đô cho 3 phút.", "eng": "From your locality, sir, a New York call is about $ 5 for 3 minutes."}, {"viet": "Được giảm án tù sáu tháng.", "eng": "Get a remission of six months."}, {"viet": "Thể hiện ra sự hồ hởi chấp thuận và ủng hộ của mình về một kế hoạch.", "eng": "Give one's hearty approval and support to a plan."}, {"viet": "Trải qua một thời kỳ tái điều chỉnh.", "eng": "Go through a period of readjustment."}, {"viet": "Các nhóm du khách liên tục đổ xô tới quảng trường chính của thành phố.", "eng": "Groups of tourists eddying continually about the main square of the city."}, {"viet": "Đã vượt quá cả dự kiến tệ hại nhất về những nhà phê bình ông ta gay gắt nhất.", "eng": "Has exceeded even the worst-case estimate of his harshest critics."}, {"viet": "Anh đã cân nhắc việc đi đến đó bằng cách nào chưa?", "eng": "Have you considered how to get there?"}, {"viet": "Anh đã nghe tin vui chưa?", "eng": "Have you heard the glad tidings?"}, {"viet": "Nó đã ngủ vạ vật một tuần lễ, trong các bờ mương, các đống rơm.", "eng": "He'd been sleeping rough for a week, in ditches and haystacks."}, {"viet": "Nó luôn vắng mặt khi có việc phải làm.", "eng": "He's always missing when there's work to be done."}, {"viet": "Anh ta theo bước chân cha và trở thành bác sĩ.", "eng": "He's following in his father's footsteps and becoming a doctor."}, {"viet": "Anh ấy không đặc biệt thông minh nhưng là một người cần mẫn và chắc sẽ thi tốt.", "eng": "He's not especially clever, but he's a diligent worker and should do well in the examination."}, {"viet": "Ông ta đã đi nhiều nhưng bây giờ ông ta trở về ở hẳn Anh.", "eng": "He's travelled a lot but he's now come back to Britain once and for all."}, {"viet": "Anh ta luôn cố nói áp đảo để thoát khỏi những tình huống gay go.", "eng": "He always tries to bluster his way out of difficult situations."}, {"viet": "Anh ta thuộc một câu lạc bộ riêng biệt.", "eng": "He belongs to an exclusive group."}, {"viet": "Ông ấy có thể trưng ra chứng cứ để hỗ trợ cho những cáo giác của mình.", "eng": "He can produce evidence to support his allegations."}, {"viet": "Anh ta tiếp tục nói với giọng trêu ghẹo.", "eng": "He continued in a quizzical tone."}, {"viet": "Anh ta mô tả điều ấy hết sức chi tiết từng ly từng tí.", "eng": "He described it in great detail."}, {"viet": "Anh ấy trông có vẻ chưa tập thể dục đầy đủ.", "eng": "He doesn't look as though he gets enough exercise."}, {"viet": "Nó thi trượt nhưng nó có vẻ chẳng lo lắng gì cả.", "eng": "He failed the examination but he didn't seem to care."}, {"viet": "Ông ấy đã tham dự chiến dịch Bắc Phi trong cuộc chiến tranh vừa qua.", "eng": "He fought in the N Africa campaign during the last war."}, {"viet": "Hắn hay đàn đúm với bọn côn đồ.", "eng": "He goes round with a bunch of thugs."}, {"viet": "Anh ta đã cho gửi hoa đặc biệt bằng đường hàng không cho dịp lễ.", "eng": "He had flowers specially flown in for the ceremony."}, {"viet": "Ông ấy nổi tiếng là người phê bình thẳng thắn.", "eng": "He has a reputation for being a forthright critic."}, {"viet": "Anh ta không thể tự kiềm chế.", "eng": "He has no command over himself."}, {"viet": "Hắn chém kẻ thù của mình ra từng mảnh.", "eng": "He hewed his enemy to pieces."}, {"viet": "Ông ta là người Anh chính tông.", "eng": "He is English to the core."}, {"viet": "Ông ta sẽ bị bắn lúc bình minh.", "eng": "He is to be shot at dawn."}, {"viet": "Ông ta đặt tay lên vai tôi.", "eng": "He laid his hand on my shoulder."}, {"viet": "Anh ấy nhìn cô ta với vẻ đau khổ.", "eng": "He looked at her with a hurt expression."}, {"viet": "Hắn đã tìm cách tránh được người truy nã hắn.", "eng": "He managed to avoid his pursuers."}, {"viet": "Anh ta không bao giờ tỉnh táo được lâu.", "eng": "He never stays sober for long."}, {"viet": "Anh ta hãnh diện về bộ quần áo đúng mốt của mình.", "eng": "He piqued himself on his stylist attire."}, {"viet": "Anh ta rụt tay ra khỏi nước nóng.", "eng": "He pulled his hand out of the hot water."}, {"viet": "Anh ta bị treo bằng lái sau hai lần bị phát hiện có nồng độ rượu trong máu.", "eng": "He received a driving ban after being caught with twice the legal amount of alcohol in his blood."}, {"viet": "Nó hoàn toàn xứng đáng với tất thảy những gì đã xảy ra cho nó.", "eng": "He richly deserved all that happened to him."}, {"viet": "Ông ta lúc nào cũng khoe của.", "eng": "He's always flaunting his wealth."}, {"viet": "Anh ta được xếp hạng 6 về kỹ năng chơi đàn vi ô lông.", "eng": "He's got Violin Grade 6."}, {"viet": "Hắn ta thật là khùng: hắn đi đây đó với bộ quần áo rất kỳ dị.", "eng": "He's quite mad: he goes round in very old clothes."}, {"viet": "Ông ta đập gót giày đánh cốp khi chào.", "eng": "He saluted with a click of his heels."}, {"viet": "Anh ta dường như thường xuất hiện ở những nơi bất ngờ nhất.", "eng": "He seems to pop up in the most unlikely places."}, {"viet": "Ông ta len lén đi ngang qua, cố làm ra vẻ tự nhiên.", "eng": "He sidled past, trying to seem casual."}, {"viet": "Nó đã nói không một chút xúc cảm.", "eng": "He spoke without a trace of emotion."}, {"viet": "Ông ấy nện tôi tới tấp bằng cái gậy.", "eng": "He struck at me repeatedly with a stick."}, {"viet": "Ông ta gọi điện cho vợ để nói ông ta sẽ về trễ.", "eng": "He telephoned his wife to say he'd be late."}, {"viet": "Anh ta coi chuyện thoát nợ cho cả đôi bên là điều thoải mái.", "eng": "He took it easy as a good riddance for both sides."}, {"viet": "Anh ấy xắn tay áo sơ mi lên.", "eng": "He tucked up his shirt sleeves."}, {"viet": "Anh ta đi đứng theo một kiểu kỳ quặc.", "eng": "He walks in a peculiar fashion."}, {"viet": "Anh ta là một người bán xe hơi nhiều kinh nghiệm và có thể nhận ra một khách hàng dễ tính khi nhìn thấy một người nào đó!", "eng": "He was an experienced car salesman and recognized an easy prospect when he saw one!"}, {"viet": "Rõ ràng nó có tội và chỉ có thể trông mong vào sự độ lượng của toà án.", "eng": "He was clearly guilty and could only throw himself on the mercy of the court."}, {"viet": "Ông ta buộc phải bán tài sản nghệ thuật quý giá của ông ta.", "eng": "He was forced to dispose of his art treasures."}, {"viet": "Anh ta đang nghe nhạc ở đài.", "eng": "He was listening to music on the radio."}, {"viet": "Ông ta bị mệt đứt hơi sau khi leo lên hết những nấc thang đó.", "eng": "He was puffed out after climbing all those stairs."}, {"viet": "Tin cha anh chết làm anh sững sờ.", "eng": "He was stunned by the news of his father's death."}, {"viet": "Anh ta trắng bệch ra như chết và run rẩy toàn thân.", "eng": "He was white as death and all atremble."}, {"viet": "Anh ta sẽ làm bất cứ điều gì để đạt được mục đích của mình.", "eng": "He will do anything in order to achieve his aim."}, {"viet": "Thậm chí đến mười penni nó cũng không cho tôi vay, sao mà lại có thể bần tiện đến thế cơ chứ?", "eng": "He wouldn't even lend me ten pence, how mean can you get?"}, {"viet": "Mũ bảo hộ dùng để phòng ngừa tai nạn.", "eng": "Helmets that provide insurance against an accident."}, {"viet": "Cuốn sách của cô ta là tác phẩm có uy tín về Milton.", "eng": "Her book is the definitive work on Milton."}, {"viet": "Phản ứng lạnh lùng của cô ta trước tình trạng khủng hoảng.", "eng": "Her detached response to the crisis."}, {"viet": "Những ngón tay của cô ấy tê buốt vì sương giá.", "eng": "Her fingers were bitten by the frost."}, {"viet": "Tư tưởng của cô ta rập khuôn tư tưởng của Trốtki.", "eng": "Her ideas are patterned on Trotsky's."}, {"viet": "Thái độ của cô ta lúc nào cũng có vẻ lảng tránh, cô ta chẳng bao giờ chịu nhìn thẳng vào mặt tôi.", "eng": "Her manner was always very evasive, she would never look straight at me."}, {"viet": "Cha mẹ cô ấy cố kết đôi cô ta với anh láng giềng giàu có.", "eng": "Her parents tried to pair her off with a rich neighbour."}, {"viet": "Những tiểu thuyết dâm ô của cô ta làm cho công chúng kinh tởm.", "eng": "Her scabrous novels shocked the public."}, {"viet": "Những ý tưởng của bà ấy đi ngược về thời xuân sắc của bà ấy.", "eng": "Her thought wandered back to her youth."}, {"viet": "Ở Bắc Kinh này dùng điện 220 vôn.", "eng": "Here in Beijing it is 220 volts."}, {"viet": "Tuổi thanh xuân của anh ấy không phải là một thời kỳ sung sướng đối với anh ấy.", "eng": "His adolescence was not a happy time for him."}, {"viet": "Cuốn sách của ông ta được dự định xuất bản vào tháng Mười.", "eng": "His book is due to be published in October."}, {"viet": "Lời đáp lạnh nhạt của anh ta khiến ta phải nghĩ rằng anh ta không thích ý kiến ấy.", "eng": "His cool response suggested that he didn't like the idea."}, {"viet": "Mắt anh ta đột nhiên trố ra.", "eng": "His eyes almost started out of his head."}, {"viet": "Thái độ thân thiện của nó không lừa gạt được chúng tôi lâu.", "eng": "His friendly manner did not deceive us for long."}, {"viet": "Cách nói không rõ ràng của anh ta làm cho người ta không thể hiểu được anh ta.", "eng": "His indistinct speech made it impossible to understand him."}, {"viet": "Cung cách cư xử của nó thật là kinh khủng-không thể tin hắn bất cứ trong tình huống nào!", "eng": "His manners are appalling-you can't take him anywhere!"}, {"viet": "Những bức tranh của ông ta mờ mờ một cách có dụng ý, đó là một phần của phong cách của ông.", "eng": "His paintings are deliberately flat, it's part of his style."}, {"viet": "Động cơ thực sự thúc đẩy hắn phạm tội vẫn còn chưa rõ rệt.", "eng": "His real motive for the crime remains obscure."}, {"viet": "Cách nói của ông ta khiến người ta không thể hiểu ông được.", "eng": "His speech made it impossible to understand him."}, {"viet": "Chú nó cho nó một cái tàu hoả đồ chơi nhân ngày sinh nhật.", "eng": "His uncle gave him a toy train for his birthday."}, {"viet": "Lịch sử có ảnh hưởng đến cả ngày nay và mai sau.", "eng": "History influences both the present and the future."}, {"viet": "Hi vọng đạt được một giải pháp hoà bình đang tan dần.", "eng": "Hopes of a peace settlement are now fading."}, {"viet": "Làm thế nào tôi có thể chuộc lỗi về cung cách tôi đã đối xử với anh?", "eng": "How can I make up for the way I've treated you?"}, {"viet": "Thưa ông, ông thấy bữa tối thế nào ạ?", "eng": "How did you like the dinner, sir?"}, {"viet": "Anh còn nhớ đến tận thời điểm nào?", "eng": "How far does your memory go back?"}, {"viet": "Mất bao lâu để gửi tiền từ đây đến Luôn Đôn?", "eng": "How long would it take to send money from here to London?"}, {"viet": "Có bao nhiêu kẻ sống vô gia cư ở thành phố này?", "eng": "How many street people are there in this city?"}, {"viet": "Anh đem theo bao nhiêu tiền tiêu vặt vào ngày nghỉ?", "eng": "How much spending money did you take with you on holiday?"}, {"viet": "Các vùng rừng, sa mạc, đất canh tác, v. v. rộng lớn.", "eng": "Huge tracts of forest, desert, farmland, etc."}, {"viet": "Tôi muốn phóng to gấp rưỡi bức ảnh này.", "eng": "I'd like the photograph enlarged so that it's half as big again."}, {"viet": "Tôi thà lo sớm tránh xa hơn là bị phỏng vấn trên TV.", "eng": "I'd sooner run a mile than be interviewed on television."}, {"viet": "Tôi sẽ phải kiểm tra các mục nhập trong sổ cái.", "eng": "I'll have to check the entries in the ledger."}, {"viet": "Tôi tin điều anh nói là chuyện đó sẽ không xảy ra nữa.", "eng": "I'll take your word for it that it won't happen again."}, {"viet": "Tôi lo sao cho anh ấy được chăm sóc chu đáo.", "eng": "I'm anxious that he should be well cared for."}, {"viet": "Tôi sẽ thắng bộ để đi dự tiệc.", "eng": "I'm going to get dolled up for the party."}, {"viet": "Tôi không quen thức dậy sớm.", "eng": "I'm not accustomed to getting up so early."}, {"viet": "Thật sự dạo này tôi không nắm bắt được thông tin về thời trang.", "eng": "I'm really out of touch with fashion these days."}, {"viet": "Tôi chắc anh ấy sẽ thích thú khi gặp lại bạn.", "eng": "I'm sure he would be interested to see you."}, {"viet": "Tôi báo trước cho anh biết, hắn mà say tôi sẽ tống cổ hắn.", "eng": "I'm warning you, if he gets drunk I'll how him the door."}, {"viet": "Tôi đang vẩn vơ với ý nghĩ chuyển ra nước ngoài.", "eng": "I've been toying with the idea of moving abroad."}, {"viet": "Tôi đã xem truyền hình quá nhiều trong tuần này.", "eng": "I've had rather an overdose of TV this week."}, {"viet": "Tôi đã đọc cuốn sách từ đầu chí cuối.", "eng": "I've read the book from beginning to end."}, {"viet": "Lúc trước tôi đồng ý nhưng sau đó tôi đã đổi ý.", "eng": "I agreed at the time but later changed my mind."}, {"viet": "Tôi ra ngoài một chút để mua một ít sữa.", "eng": "I am just popping out to buy some milk."}, {"viet": "Tôi hỏi ông ta xem sự quyết liệt của lời buộc tội đó là tự nhiên hay là dàn cảnh.", "eng": "I ask him whether the slam-dunk of the indictment was a spontaneous or planned bit of theater."}, {"viet": "Tôi đã mua một bức tranh cũ có in hình phố High.", "eng": "I bought an old engraving of the High Street."}, {"viet": "Thậm chí tôi không còn đủ can đảm hẹn gặp cô ấy nữa là.", "eng": "I can't even get up enough guts to ask her for a date."}, {"viet": "Tôi không thể nhận một lời khen nào, tất cả công việc là do người khác làm.", "eng": "I can't take any credit, the others did all the work."}, {"viet": "Tôi có thể sử dụng chiếc dao cạo điện của tôi từ mạch điện chính.", "eng": "I can run my electric razor off the mains."}, {"viet": "Tôi không thể phân biệt được hai đứa trẻ sinh đôi.", "eng": "I can't tell one twin from the other."}, {"viet": "Tôi có thể nói được đôi điều về nó.", "eng": "I could tell you a thing or two about him."}, {"viet": "Tôi muốn thuê căn nhà này.", "eng": "I'd like to rent this house."}, {"viet": "Tôi vẫn chưa nhận được thư của anh ấy.", "eng": "I didn't receive a letter from him yet."}, {"viet": "Tôi không có đủ sức để nâng cái bàn này.", "eng": "I don't have enough strength to lift this table."}, {"viet": "Tôi không thích anh kết giao với những người như vậy.", "eng": "I don't like you associating with such people."}, {"viet": "Tôi cũng không muốn chúng nó lẵng nhẵng đi theo!", "eng": "I don't want them stringing along as well!"}, {"viet": "Tôi không thích sự lựa chọn bạn của anh ta.", "eng": "I don't like his choice of friends."}, {"viet": "Tôi cho là anh đúng, tuy thế tôi sẽ hỏi lại anh ta.", "eng": "I expect you're tight, I'll ask him, though."}, {"viet": "Tôi thấy khó chịu khi từ chối, nhưng tôi không có cách nào khác.", "eng": "I felt ghastly about refusing, but I had no alternative."}, {"viet": "Tôi thấy sự tuân thủ nghi thức của dịp này bực cả mình.", "eng": "I found the formality of the occasion irritating."}, {"viet": "Tôi nhận được máy trợ thính ở ( Sở ) y tế quốc dân.", "eng": "I got my hearing aid on the National Health ( Service )."}, {"viet": "Tôi có một nửa quả táo còn em tôi có nửa kia.", "eng": "I had half the apple and my brother had the other half."}, {"viet": "Tôi không thích bất ngờ đưa cho anh cái này trước một thời gian ngắn như vậy.", "eng": "I hate to spring this on you at such short notice."}, {"viet": "Bác vừa mới tráng đĩa xong.", "eng": "I have just rinsed the dishes off."}, {"viet": "Tôi rất sợ bị kẹt trong thang máy hỏng.", "eng": "I have this horror of being trapped in a broken lift."}, {"viet": "Tôi không hiểu tý nào ý anh muốn nói gì.", "eng": "I haven't the vaguest idea what you mean."}, {"viet": "Tôi giúp anh ấy tìm ra đồ vật của anh ấy.", "eng": "I helped him to find his things."}, {"viet": "Tôi hi vọng ông sẽ có thời gian tham quan Bắc Kinh.", "eng": "I hope you'll have time to see Beijing."}, {"viet": "Tôi biết anh ta trốn ở đâu rồi.", "eng": "I knew where he was hiding."}, {"viet": "Tôi thích một bữa ăn có chất đặc trong đó.", "eng": "I like a meal that has some substance to it."}, {"viet": "Tôi sẽ luôn luôn biết ơn ông.", "eng": "I'll be eternally grateful to you."}, {"viet": "Ngày mai tôi sẽ đi Thượng Hải.", "eng": "I'll leave for Shanghai tomorrow."}, {"viet": "Tôi thích cái áo đầm này và vải đó rất nhẹ phù hợp để mặc vào mùa hè đấy,.", "eng": "I love this dress and the fabric is very light for the summer."}, {"viet": "Anh sẽ đi ra ngoài một lát.", "eng": "I'm going out for a little while."}, {"viet": "Tôi già rồi, nhưng tôi thích cuộc sống của tôi.", "eng": "I'm old, but I enjoy my life."}, {"viet": "Tôi có cuộc hẹn với bác sĩ.", "eng": "I made an appointment to see the doctor."}, {"viet": "Trễ rồi, tôi phải đi gấp.", "eng": "I must dash, I'm late."}, {"viet": "Tôi cần có thì giờ để suy nghĩ về điều anh đề nghị.", "eng": "I need time to reflect on what you offered."}, {"viet": "Tôi chỉ nhìn thoáng thấy mặt tên trộm thôi vì thế tôi không thể miêu tả được.", "eng": "I only caught a glimpse of the thief's face so I can't describe it."}, {"viet": "Tôi đề nghị nâng ly chúc mừng tình hữu nghị và sự hợp tác thành công của chúng ta.", "eng": "I propose a toast to our friendship and successful cooperation."}, {"viet": "Tôi bị ngã tím bầm chân.", "eng": "I received a bruise on my leg from a fall."}, {"viet": "Tôi đã vò mạnh nhưng vết bẩn vẫn không đi.", "eng": "I rubbed hard but the stain just wouldn't go."}, {"viet": "Xem ra là tôi đã phí phạm một ngày trời hoàn toàn vô ích.", "eng": "I seem to have spent my day quite profitlessly."}, {"viet": "Tôi rùng mình nghĩ về các khó khăn phía trước chúng tôi.", "eng": "I shudder to think of the problems ahead of us."}, {"viet": "Tôi đề nghị cô nên tập thể dục nhiều hơn, tôi cho rằng cô sẽ thấy có lợi.", "eng": "I suggest you to take more exercise, I think you'll find it pays dividends."}, {"viet": "Tôi nghĩ rằng mùa hè này tôi sẽ sống thả phanh xem nó ra sao mà.", "eng": "I think I'll just free-wheel this summer and see what happens."}, {"viet": "Tôi nghĩ rằng cửa đã khoá, nhưng tốt hơn cả là tôi ra xem cho chắc.", "eng": "I think the door's locked, but I'd better go and make sure."}, {"viet": "Tôi nghĩ chúng ta sẽ ăn trưa trong thành phố.", "eng": "I thought we were going to have lunch in town."}, {"viet": "Tôi hy vọng là cô ta ốm không đến nỗi trầm trọng.", "eng": "I trust she's not seriously ill."}, {"viet": "Tôi đã đoạt giải một kỳ nghỉ tại New York.", "eng": "I've won a holiday in New York."}, {"viet": "Tôi muốn xem những vật này.", "eng": "I want to look at these."}, {"viet": "Tôi bị hấp dẫn bởi một cô gái ở văn phòng bên.", "eng": "I was becoming attracted to a girl from the next office."}, {"viet": "Tôi vừa mới định nói cho anh biết thì anh ngắt lời tôi.", "eng": "I was just about to tell you when you interrupted."}, {"viet": "Tôi vẫn còn đang bàng hoàng sau khi chia tay với Peter thì tôi gặp và yêu Harry.", "eng": "I was still getting over Peter when I met and fell in love with Harry."}, {"viet": "Tôi đã đi khắp nước Nhật cách đây 3 năm khi tôi còn ở Hải Quân.", "eng": "I went through Japan three years ago when I was in the Navy."}, {"viet": "Tôi mong muốn quá trời anh ta vặn nhỏ radiô một chút!", "eng": "I wish to God he'd turn that radio down!"}, {"viet": "Tôi tự hỏi không biết họ có đến kịp không?", "eng": "I wonder whether they will arrive on time?"}, {"viet": "Tôi muốn bày tỏ những lời chúc tốt đẹp nhất cho thành công của sự hợp tác giũa chúng ta.", "eng": "I would like to express my best wishes for the success of our co-operation."}, {"viet": "Cho dù anh là người cuối cùng còn lại trên quả đất này tôi cũng sẽ không lấy anh.", "eng": "I wouldn't marry you if you were the last person on earth."}, {"viet": "Nếu nó không nhận thức hết hậu quả của những hành động của nó, thì thật là đáng thương cho nó.", "eng": "If he doesn't realize the consequences of his actions, I'm sorry for him."}, {"viet": "Nếu như trời mưa, chúng ta sẽ phải huỷ trận đấu ngày mai.", "eng": "If it were to rain, we would have to cancel the match tomorrow."}, {"viet": "Nếu chúng không đủ số này, một số mỡ trong cơ thể chúng bị đốt sạch.", "eng": "If they do not get that many, some of their body fat burns up."}, {"viet": "Nếu anh bị táo bón anh nên ăn khoai lang.", "eng": "If you are constipated you should eat sweet potatoes."}, {"viet": "Nếu không nhanh lên, con sẽ bị trễ đấy.", "eng": "If you don't hurry, you'll be late."}, {"viet": "Nếu anh thấy có người đang chết đuối thì anh sẽ làm gì?", "eng": "If you saw somebody drowning what would you do?"}, {"viet": "Tôi sẽ trả tiền bữa ăn sáng và tiền xe taxi ngày mai bằng tiền mặt.", "eng": "Ill pay cash for tomorrow's breakfast and taxi."}, {"viet": "Ở Anh, sách báo khiêu dâm một thời đã được bán lén lút.", "eng": "In Britain pornography was once sold under the counter."}, {"viet": "Khi trời nóng, nhiệt độ tăng lên rất cao.", "eng": "In hot weather the temperature gets very high."}, {"viet": "Về một số mặt nào đó trong thế kỷ qua, nền văn minh dường như không tiến triển nhiều lắm.", "eng": "In some ways, civilization does not seem to have progressed much in the last century."}, {"viet": "Vào thời xưa, ông bà và tổ tiên chúng tôi phải di chuyển rất nhiều.", "eng": "In the old days, our grandparents and our ancestors had to move around a lot."}, {"viet": "Ở Yaesu, mỗi ngày bạn có thể ăn ở một chỗ khác nhau trong ba tháng.", "eng": "In Yaesu, you can eat in a different place every day for three months."}, {"viet": "Còn gì thắc mắc về kế hoạch đó không?", "eng": "Is anything about the plan yet in doubt?"}, {"viet": "Đó là đường xe tải chạy vào phải không?", "eng": "Is that where the trucks come in?"}, {"viet": "Chiếc cầu này có đủ vững để chịu được các xe tải nặng không?", "eng": "Is this bridge strong enough to support heavy lorries?"}, {"viet": "Ngày mai nghỉ, cho nên cậu có thể ngủ muộn.", "eng": "It's a holiday tomorrow, so you can lie in."}, {"viet": "Đó là một trong những mùa thu lạnh nhất trong nhiều năm nay.", "eng": "It's been one of the coldest autumns for years."}, {"viet": "Thật khó chọn giữa hai ứng cử viên: cả hai giống y hệt nhau.", "eng": "It's hard to choose between the two candidates: they're both much of a muchness."}, {"viet": "Không phải chỉ là phủi bụi không thôi đâu, cần phải lau chùi mạnh vào.", "eng": "It's no use just passing the duster over it, it need a bit of elbow grease."}, {"viet": "Ông thật tử tế vì đã đến đón tôi.", "eng": "It's really so kind of you to come to meet me."}, {"viet": "Thật là bất công khi phạt Peter mà không phạt James, cả hai đứa đều xử sự rất tồi.", "eng": "It's unfair to punish Peter and not James, they were both behaving badly."}, {"viet": "Hình như khoảng cách đến đường cái không xa mấy.", "eng": "It didn't seem to be any distance to the road."}, {"viet": "Hi vọng tha thiết của tôi là hắn sẽ không bao giờ trở lại nữa.", "eng": "It is any devout hope that he will never come back."}, {"viet": "Không phải là vượt quá giới hạn của khả năng (rằng...).", "eng": "It is not beyond the bounds of possibility (that...)."}, {"viet": "Có vẻ như đối với chúng ta bây giờ thế là hết.", "eng": "It looks as though it's all up with us now."}, {"viet": "Đó là một phim rất xưa.", "eng": "It's a very old movie."}, {"viet": "Đã đến lúc em phải giặt quần áo rồi.", "eng": "It's time for me to do the laundry."}, {"viet": "Phải mất ba năm mới có đủ trình độ chuyên môn.", "eng": "It takes three years to become qualified."}, {"viet": "Đấy là một quyết định hấp tấp tuỳ hứng.", "eng": "It was an impetuous spur of the moment decision."}, {"viet": "Anh đem bán tài sản là không khôn ngoan lắm đâu.", "eng": "It was not very wise of you to sell the property."}, {"viet": "Anh thật không thận trọng đã gọi điện cho tôi ở quan.", "eng": "It wasn't very discreet of you to ring me up at the office."}, {"viet": "Thịt của nó ngon, mềm, có vị tươi ngon.", "eng": "Its meat is fine and tender and tastes fresh and delicious."}, {"viet": "John có thể nói tiếng Nga tàm tạm nhưng không thể đọc được.", "eng": "John can speak Russian after a fashion, but can't read it at all."}, {"viet": "Ba chai bia Thanh Đảo là được rồi.", "eng": "Just three bottles of beer, Tsing Tao beer."}, {"viet": "Để chiếc ô tô không khoá như vậy có khác nào mời các ông trộm xơi.", "eng": "Leaving the car unlocked like that is just an open invitation to thieves."}, {"viet": "Cuối tuần này chúng ta đi chơi đi.", "eng": "Let's go away this weekend."}, {"viet": "Con người là hệ thống thu nhỏ của toàn bộ loài người.", "eng": "Man is a microcosm of the whole of mankind."}, {"viet": "Ở Braxin có sự pha trộn giữa nhiều chủng tộc.", "eng": "Many races are mixed together in Brazil."}, {"viet": "Chúc tất cả mọi sinh nhật của ông đều hạnh phúc và vui vẻ.", "eng": "May all your birthdays be happy and gay."}, {"viet": "Có lẽ chúng ta cũng có thể sử dụng cả rác trong nhà bếp.", "eng": "Maybe, we can also use kitchen garbage."}, {"viet": "Hầu hết đàn ông đều sẵn lòng giúp một người phụ nữ trong cơn hoạn nạn.", "eng": "Most men will help a damsel in distress."}, {"viet": "Thưa ông chủ tịch, tôi đề nghị sẽ thảo luận vấn đề này sau bữa ăn trưa.", "eng": "Mr Chairman, I move that the matter be discussed after lunch."}, {"viet": "Ô tô của tôi đang chữa cho nên lúc này tôi không có xe đi.", "eng": "My car is being repaired so I'm without transport at the moment."}, {"viet": "Ấn tượng chung của tôi là điều đó hoàn toàn tốt.", "eng": "My general impression was that it was quite good."}, {"viet": "Ý kiến của riêng tôi là chúng ta nên mua cái đó.", "eng": "My own feeling is that we should buy it."}, {"viet": "Vợ tôi có một việc làm bán thời gian.", "eng": "My wife has a part-time job."}, {"viet": "Tin tức về những vụ trộm cướp làm nhiều người hoảng sợ phải lắp ổ khoá mới vào cửa nhà họ.", "eng": "News of the robberies frightened many people into fitting new locks to their doors."}, {"viet": "Không, đây không phải là rượu tôi gọi.", "eng": "No, this is not the wine I ordered."}, {"viet": "Các hạ sĩ quan gồm hạ sĩ và trung sĩ.", "eng": "Non-commissioned officers include corporals and sergeants."}, {"viet": "Dạo này bà ấy dễ quên những buổi hẹn nếu không ghi lại.", "eng": "Nowadays she is apt to forget appointments unless she writes them down."}, {"viet": "Ồ, hãy làm cách gì đó để giải quyết đi, nếu không tôi sẽ lỡ máy bay mất!", "eng": "Oh, please do something about it, or i'll miss the plane!"}, {"viet": "Trên đường về nhà, nó đã bị một cơn bão ập đến.", "eng": "On his way home he was overtaken by a storm."}, {"viet": "Ta phải hét thật to người ta mới nghe được giữa tiếng náo động đó.", "eng": "One had to shout to be heard above the tumult."}, {"viet": "Chỉ cần hạt giống của vụ mùa cũng đủ tốt cho chúng tôi rồi, thí dụ để quảng cáo thực phẩm.", "eng": "Only the pick of the crop is good enough for us."}, {"viet": "Các nguồn năng lượng dùng được của ta hạn chế.", "eng": "Our feasible sources of energy are limited."}, {"viet": "Văn phòng của chúng tôi ở trung tâm thành phố.", "eng": "Our office is in the centre of the town."}, {"viet": "Quá thương xót về sự đau đớn tột cùng của cô ta họ đã cho phép cô ta ở lại.", "eng": "Out of compassion for her terrible suffering, they allowed her to stay."}, {"viet": "Qua được kỳ thi quả là trò may rủi-nó có học thi chút nào đâu!", "eng": "Passing the exam was a real fluke-he didn't work for it at all!"}, {"viet": "Những người bị cuộc sống xa hoa làm cho mềm yếu.", "eng": "People who are softened by luxurious living."}, {"viet": "Làm ơn cho anh ấy biết là tôi sẽ gọi điện.", "eng": "Please tell him that I'll call again."}, {"viet": "Thực tế không tệ như tôi đã nghĩ.", "eng": "Reality is not as bad as I thought."}, {"viet": "Hãy xem chúng ta có bao nhiêu đĩa, nhưng đừng tính những chiếc đã bị rạn.", "eng": "See how many plates we have, but don't count in the cracked ones."}, {"viet": "Cổ phiếu của công ty đã bị sụt giá.", "eng": "Shares in the company have depreciated."}, {"viet": "Cô ta luôn luôn rất dễ phật lòng.", "eng": "She's always very quick to taken offence."}, {"viet": "Tôi chẳng biết vì duyên cớ nào mà cô ấy lại ghét tôi đến thế.", "eng": "She's got a down on me, I don't know why."}, {"viet": "Hiện thời cô ấy rất bận, cô ta không thể tiếp chuyện với bạn được.", "eng": "She's occupied at the moment, she cannot speak to you."}, {"viet": "Cô ta thường hay kén chọn người đi chơi với mình.", "eng": "She's very choosy about who she goes out with."}, {"viet": "Cô ta lập luận không phải không có lý rằng không ai có thể đủ khả năng trả tiền.", "eng": "She argued, and not without reason, that no one could afford to pay."}, {"viet": "Cô ta có thể làm được bất cứ cái gì: ghế, bàn, tủ-bất kỳ.", "eng": "She can make anything: chairs, tables, cupboards-you name it."}, {"viet": "Bà ấy rải lối đi ngoài vườn bằng đá cuội.", "eng": "She covered her garden path with shingles."}, {"viet": "Cô ta không thèm trả lời nhận định thô lỗ của anh ta.", "eng": "She disdained to answer his rude remarks."}, {"viet": "Cô ta ngã xuống biển và bị cá mập ăn thịt.", "eng": "She fell over board and the sharks got her."}, {"viet": "Cô ta đã bỏ rơi tôi khi cô ta bắt đầu hẹn hò với Roger.", "eng": "She gave me the elbow when she started going out with Roger."}, {"viet": "Cô ấy trả lời có vẻ như là tức giận.", "eng": "She had answered with something akin to anger."}, {"viet": "Cô ta rất ưa thích Beethoven.", "eng": "She has a strong affinity for Beethoven."}, {"viet": "Cô ta viết thư đòi phải xin lỗi.", "eng": "She has written to demand an apology."}, {"viet": "Cô ta có năng khiếu về hai mặt: nhà văn và nghệ sĩ.", "eng": "She is doubly gifted: as a writer and as an artist."}, {"viet": "Bà ấy quỵ xuống khi chúng tôi nói với bà ấy tin tức xấu về con trai bà ấy.", "eng": "She just folded up when we told her the bad news about her son."}, {"viet": "Cô ta sống hoà thuận với hàng xóm láng giềng.", "eng": "She lives in harmony with her neighbours."}, {"viet": "Cô ta thu xếp để dồn nhiều cuộc tham quan vào trong ba ngày.", "eng": "She managed to pack a lot of sightseeing into three days."}, {"viet": "Bà ấy cách chức giám đốc của anh ta.", "eng": "She ousted him as manager'from his position."}, {"viet": "Cô ta đặt tờ báo sang một bên và cầm lấy một cuốn sách.", "eng": "She put the newspaper aside and picked up a book."}, {"viet": "Phải tính đến thế lực của bà ta.", "eng": "She's a force to be reckoned with."}, {"viet": "Cô ấy nằm liệt giường vì bị gãy chân.", "eng": "She's laid up with a broken leg."}, {"viet": "Cô ta quấn mình trong chăn, ngồi bên bếp lửa.", "eng": "She sat by the fire, swaddle in a blanket."}, {"viet": "Cô ấy hò hét khản cả giọng cổ vũ đội.", "eng": "She shouted herself hoarse cheering on the team."}, {"viet": "Cô ta vung tiền mua một đôi giày mới.", "eng": "She splashed out on a new pair of shoes."}, {"viet": "Cô ấy tích cực tham gia vào chính trị địa phương.", "eng": "She takes an active part in local politics."}, {"viet": "Cô ấy cố trêu chọc làm tôi phát khùng.", "eng": "She tried to needle me into losing my temper."}, {"viet": "Cô ta muốn đi vào giới kịch nghệ.", "eng": "She wants to go into the theatre."}, {"viet": "Cô ta là người Công giáo chính thống.", "eng": "She was born and bred a Catholic."}, {"viet": "Cô ta đã bị say mềm không biết trời đất gì nữa tối hôm qua.", "eng": "She was got completely paralytic last night."}, {"viet": "Cô ấy bị mồ côi trong thời chiến.", "eng": "She was orphaned in the war."}, {"viet": "Cô ấy vẫn còn yếu sau trận ốm.", "eng": "She was still weak after her illness."}, {"viet": "Cô ta không hoàn toàn thành thật, khi cô ta nói thích tôi.", "eng": "She wasn't entirely sincere when she said she liked me."}, {"viet": "Cô ấy sẽ không bị thuyết phục ngay cả đối với lập luận hợp lôgic.", "eng": "She won't be persuaded even by logical argument."}, {"viet": "Cô ta đã viết cho anh ấy một lá thư dài.", "eng": "She wrote him a long letter."}, {"viet": "Chứng minh sự sai trái trong những yêu sách của bà ta.", "eng": "Show the falseness of her claims."}, {"viet": "Từ khi chúng tôi gửi giấy mời đi, chúng tôi nhận được năm lời nhận và một lời từ chối.", "eng": "Since we sent out the invitations we've received five acceptances and one refusal."}, {"viet": "Những công việc kinh doanh nhỏ của chúng ta thực sự không thể cạnh tranh được với nhưng tổ chức lớn.", "eng": "Small businesses like ours can't really compete with the big boys."}, {"viet": "Nữ diễn viên múa ba lê uyển chuyển đến nỗi nàng dường như đang lướt đi vậy.", "eng": "So graceful was the ballerina that she just seemed to glide."}, {"viet": "Binh lính bị hoả lực súng máy bắn chết như rạ.", "eng": "Soldiers mown down by machine-gun fire."}, {"viet": "Vài nhận xét của anh ta không thích hợp mấy.", "eng": "Some of his remarks were rather off-key."}, {"viet": "Có thằng đáng ghét nào đó đã xoáy cái khăn mặt của tôi.", "eng": "Some so-and-so has pinched my towel."}, {"viet": "Đôi khi một người đến và người kia ở nhà trông con.", "eng": "Sometimes one person comes and the other person stays at home with the children."}, {"viet": "Những chấm đỏ trên nền màu xanh.", "eng": "Speckles of red in a blue background."}, {"viet": "Vào trong đám đông con đứng sát phía sau mẹ nhé.", "eng": "Stay close behind me in the crowd."}, {"viet": "Đừng chọc tức anh ta nữa nếu không anh ta có thể đánh mày đấy.", "eng": "Stop needling him or he might hit you."}, {"viet": "Hãy nghiên cứu những ngụ ý trong lời tuyên bố của Tổng thống.", "eng": "Study the implications of the President's statement."}, {"viet": "Đột nhiên, chỉ trong nháy mắt cuộc đời nàng bị đảo lộn.", "eng": "Suddenly, in the twinkling of an eye her whole life had been turned upside down."}, {"viet": "Ngạc nhiên vì những câu trả lời con nít đối với những vấn đề của chúng tôi.", "eng": "Surprised by their jejune responses to our problems."}, {"viet": "Lấy một trong hai cuốn sách trên bàn-cái nào cũng được.", "eng": "Take one of the books on the table-either of them will do."}, {"viet": "Gỗ tếch bị nắng mưa làm đổi thành màu xam xám.", "eng": "Teak weathers to a greyish colour."}, {"viet": "Xét nghiệm sự ô nhiễm trong nước.", "eng": "Testing for pollution in the water."}, {"viet": "Anh bị thâm quầng nhiều ở mắt đấy.", "eng": "That's quite a shiner you've got there."}, {"viet": "Điều đó làm cho cô ta quyết định không rời nhà.", "eng": "That determined her against leaving home."}, {"viet": "Cái xà thấp ấy đúng là một tai hoạ! Tôi cứ bị đập đầu vào đó mãi.", "eng": "That low beam is a menace! I keep hitting my head on it."}, {"viet": "Một chiều khoảng ba mét chiều bốn mét.", "eng": "That's about three metres by four."}, {"viet": "Làm việc đó thật là nhỏ mọn và hiểm độc!", "eng": "That was a mean and dirty thing to do!"}, {"viet": "Tai nạn chắc chắn đã xảy ra vào khoảng 11 giờ sáng.", "eng": "The accident must have happened at about 11 o'clock in the morning."}, {"viet": "Chiến dịch quảng cáo vẫn đang được chuẩn bị.", "eng": "The advertising campaign is still in preparation."}, {"viet": "Tổ tiên của chiếc xe đạp hiện đại là chiếc xe đạp một bánh nhỏ một bánh to.", "eng": "The ancestor of the modern bicycle was called a penny farthing."}, {"viet": "Kiến trúc sư đề nghị tu sửa lại toà nhà.", "eng": "The architect suggested that the building be restored."}, {"viet": "Vụ ám sát tổng thống Kennedy.", "eng": "The assassination of president Kennedy."}, {"viet": "Tuổi trung bình của sinh viên là 19.", "eng": "The average age of the students is 19."}, {"viet": "Quả bóng bật từ tường rơi xuống ao.", "eng": "The ball rebounded off the wall into the pond."}, {"viet": "Những miếng gạch ốp trong phòng tấm bị rạn nứt và một số đã rơi ra khỏi tường.", "eng": "The bathroom tiles are cracked and some of them have fallen off the wall."}, {"viet": "Những con sư tử trở chứng không theo lệnh người dạy.", "eng": "The big cats suddenly turned on their trainer."}, {"viet": "Ban giám đốc không vui vì việc buôn bán giảm sút.", "eng": "The board are unhappy about falling sales."}, {"viet": "Quyển sách đó kém ở đoạn nói về thời Trung cổ.", "eng": "The book is weak on the medieval period."}, {"viet": "Cậu bé nài xin được phép lái chiếc máy kéo.", "eng": "The boy pleaded to be allowed to ride on the tractor."}, {"viet": "Chiếc ô tô của Anh đã ở phía trước nhiều phút rồi.", "eng": "The British car has been in front now for several minutes."}, {"viet": "Dịch vụ xe buýt đã trở lại bình thường sau cuộc đình công.", "eng": "The bus service has returned to normal after the strike."}, {"viet": "Thuyền trưởng của chiếc tàu đang chìm dùng đèn chớp để thu hút sự chú ý của đội bảo vệ duyên hải.", "eng": "The captain of the sinking ship used flares to attract the attention of the coastguard."}, {"viet": "Chiếc xe ôtô đó đâm sầm vào bức tường.", "eng": "The car smashed into the wall."}, {"viet": "Con mèo không được cho ăn trong mấy tuần lễ nên chỉ còn da bọc xương.", "eng": "The cat had not been fed for weeks and was just a bag of bones."}, {"viet": "Hi vọng thành công ánh lên trước mắt họ.", "eng": "The chance of success glitters before them."}, {"viet": "Đứa trẻ ốm cả tuần nay.", "eng": "The child has been poorly all week."}, {"viet": "Bọn trẻ con bây giờ đang ở độ tuổi đôi mươi.", "eng": "The children are now in their twenties."}, {"viet": "Lũ trẻ ùa ra khỏi xe ôtô.", "eng": "The children tumbled out of the car."}, {"viet": "Xi-nê đã phải nhường chỗ phần lớn cho vi-đê-ô gia đình.", "eng": "The cinema has largely yielded to the home video."}, {"viet": "Đồng hồ điểm giờ nhưng không điểm nửa giờ.", "eng": "The clock strikes the hours but not the half-hours."}, {"viet": "Nhà trường cấp bằng tốt nghiệp cho 50 sinh viên khoa học năm ngoái.", "eng": "The college graduated 50 students from the science department last year."}, {"viet": "Kết quả của công ty cho thấy có một bước nhảy vọt lớn về lời lãi.", "eng": "The company's results show a huge jump in profits."}, {"viet": "Tầm giọng của một ca sĩ.", "eng": "The compass of a singer's voice."}, {"viet": "Hoàn thành công việc cả đời của mình.", "eng": "The consummation of one's life work."}, {"viet": "Nữ bá tước tham dự buổi lễ với bá tước, chồng bà.", "eng": "The countess attended the ceremony with her husband, the count."}, {"viet": "Toà án đã nghe luật sư của hai bên.", "eng": "The court heard counsel for both sides."}, {"viet": "Đám đông đón chào các diễn viên bằng tiếng la hét và huýt sáo.", "eng": "The crowd greeted the performers with boos and hisses."}, {"viet": "Hải quan đã tìm thấy ma tuý giấu trong hàng hoá.", "eng": "The customs have found heroin hidden in freight."}, {"viet": "Người quá cố đã để lại một khoản tiền lớn cho vợ ông ta.", "eng": "The deceased left a large sum of money to his wife."}, {"viet": "Chiều sâu của một cái giếng, mỏ, hộp, hòm.", "eng": "The depth of the well, mine, box, trunk."}, {"viet": "Ông đạo diễn phim đang tìm một nơi thích hợp để quay bộ phim mới của ông.", "eng": "The director is looking for a suitable locale for his new film."}, {"viet": "Bác sĩ suy nghĩ về ca mổ khó khăn mà ông phải thực hiện.", "eng": "The doctor contemplated the difficult operation he had to perform."}, {"viet": "Con chó nhảy chồm chồm đến với chủ nó.", "eng": "The dog came bounding up to its master."}, {"viet": "Cánh cửa ghép gỗ sồi nặng trịch.", "eng": "The door was heavily timbered with oak."}, {"viet": "Trường phái hội hoạ Hà Lan, Vênêxi.", "eng": "The Dutch, Venetian, etc school of painting."}, {"viet": "Cuộc bầu cử là một cuộc đấu đá giữa ba phe Bảo thủ, lao động và Đảng Dân chủ.", "eng": "The election was a three-cornered fight between Conservatives, labour and SLD."}, {"viet": "Đội Braxin hoàn toàn chơi hay hơn hẳn đội Anh.", "eng": "The English team were totally outplayed by the Brazilians."}, {"viet": "Vị giám khảo phải chấm 150 bài viết những câu trả lời.", "eng": "The examiner had to mark 150 scripts."}, {"viet": "Vải vóc được buôn bán qua một mạng lưới thương nhân.", "eng": "The fabrics are merchandised through a network of dealers."}, {"viet": "Buổi trình diễn thời trang đó là một sự phô trương đầy màu sắc rực rỡ.", "eng": "The fashion show was a technicolour extravaganza."}, {"viet": "Bộ phim đó có cốt truyện khá tầm thường.", "eng": "The film has a rather tired plot."}, {"viet": "Lò sưởi là điểm trọng tâm trong căn phòng.", "eng": "The fireplace is the focal point of the room."}, {"viet": "Người đầu tiên đặt chân lên mặt trăng.", "eng": "The first man to set foot on the moon."}, {"viet": "Những đóa hoa sẽ tươi lại trong nước.", "eng": "The flowers will revive in water."}, {"viet": "Khung tủ, giường, ba lô.", "eng": "The frame of a cupboard, bed, rucksack."}, {"viet": "Thủ lĩnh của băng cướp đó đã bị một tên trong toán cướp khai báo.", "eng": "The gang leader was shopped by one of the robbers."}, {"viet": "Khu bệnh tuổi già của một bệnh viện.", "eng": "The geriatric ward of a hospital."}, {"viet": "Đôi cánh mỏng dính của con ruồi.", "eng": "The gossamer wings of a fly."}, {"viet": "Chính phủ đã nâng lương và giá cả trong giới hạn cao nhất là 10%.", "eng": "The government has set a wages and prices ceiling of 10%."}, {"viet": "Chính quyền thì yếu kém và không phải lúc nào cũng công bằng.", "eng": "The government was week and not always fair."}, {"viet": "Những con quỉ phá hoại lại chui vào máy tính lần nữa.", "eng": "The gremlins have got into the computer again."}, {"viet": "Những hướng dẫn lưu ý chúng tôi về bức tranh khác.", "eng": "The guide directed our attention to the other picture."}, {"viet": "Các súng hạng nặng dội ầm ầm vào các bức tường của công sự.", "eng": "The heavy guns pounded away at the walls of the fort."}, {"viet": "Con ngựa vểnh tai khi nghe tiếng động.", "eng": "The horse cocked up its ears when it heard the noise."}, {"viet": "Nhà cửa và tài sản đã được giao cho người con gái đầu thừa kế theo thứ tự.", "eng": "The house and estate are entailed on the eldest daughter."}, {"viet": "Những con sóng khổng lồ đánh chiếc tàu bị đắm tan ra từng mảnh.", "eng": "The huge waves battered the wrecked ship to pieces."}, {"viet": "Số đầu tiên của một tạp chí.", "eng": "The inaugural issue of a magazine."}, {"viet": "Bên trong màu trắng.", "eng": "The inside is white."}, {"viet": "Chiếc áo vét tông bị dây thép gai xé rách thành nhiều mảnh.", "eng": "The jacket was torn to shreds by the barbed wire."}, {"viet": "Nước của thứ quả này là một loại thuốc ngủ nhẹ.", "eng": "The juice of this fruit is a mild narcotic."}, {"viet": "Những đường lối quanh co của bệnh quan liêu.", "eng": "The labyrinthine corridors and alleys of bureaucratic red tape."}, {"viet": "Bộ phận giặt ủi đã nhầm lẫn.", "eng": "The laundry has made a mistake."}, {"viet": "Các chữ nằm trên trang giấy này có màu đen bởi vì chất mực màu đen hấp thụ tất cả những màu sắc đập vào nó.", "eng": "The letter on this page are black because the black ink absorbs all the colors that strike it."}, {"viet": "Chất cồn giữ cho kim định hướng khỏi đu đưa lúc chiếc tàu lắc lư.", "eng": "The liquid keeps the card from swinging as the ship sways from side to side."}, {"viet": "Sự công khai bày tỏ tình cảm của những người yêu nhau.", "eng": "The lovers'open display of affection."}, {"viet": "Đa số báo chí ủng hộ chính sách đối ngoại của chính phủ.", "eng": "The majority of the press support the Government's foreign policy."}, {"viet": "Cuộc ra đi hàng loạt của mọi người xuống biển và lên núi để nghỉ hè.", "eng": "The mass exodus of people to the sea and mountains for the summer holidays."}, {"viet": "Cuộc họp kết thúc trong một sự huyên náo.", "eng": "The meeting ended in an uproar."}, {"viet": "Người giao sữa sáng nay đến muộn.", "eng": "The milkman was late this morning."}, {"viet": "Mona Lisa là kiệt tác của Leonardo.", "eng": "The Mona Lisa was Leonardo's masterpiece."}, {"viet": "Bà mẹ bế đứa con gái nhỏ.", "eng": "The mother was carrying her little girl."}, {"viet": "Sự kỳ diệu của nền quân chủ Anh.", "eng": "The mystique of the British monarchy."}, {"viet": "Chắc chắn là ông chủ tịch mới sẽ làm cho mọi người biết sự hiện diện của mình!", "eng": "The new chairman is certainly making his presence felt!"}, {"viet": "Loại máy vi tính xách tay mới đang bán rất chạy.", "eng": "The new portable computers are going like hot cakes."}, {"viet": "Tin mới chẳng bao lâu đã lan tới tận nơi xa nhất.", "eng": "The news soon spread to the farthest corner."}, {"viet": "Khu vực lạnh ở phía bắc của miền này gọi là Mãn Châu.", "eng": "The northern, cooler part of it is called Manchuria."}, {"viet": "Điều trái với tình yêu là sự thù hận.", "eng": "The obverse of love is hate."}, {"viet": "Bà già đó sống lâu hơn tất cả các con cái mình.", "eng": "The old lady has survived all her children."}, {"viet": "Lễ khánh thành tòa nhà mới này là việc biến một tham vọng đã từ lâu công ty này ấp ủ trở thành hiện thực.", "eng": "The opening of this new building is the realization of an ambition long held by this company."}, {"viet": "Các trường đại học Oxford và Cambridge được nhiều người tài trợ.", "eng": "The Oxford and Cambridge colleges have numerous endowments."}, {"viet": "Đảng đó đoàn kết sau lưng các vị lãnh đạo đảng.", "eng": "The party is united behind its leaders."}, {"viet": "Theo dấu vết của các vết thương thì đúng là bị tấn công bằng dao.", "eng": "The pattern of injuries is consistent with an attack with a knife."}, {"viet": "Cái tiếng ồn rất khó chịu của các máy bay đang bay vào đất liền.", "eng": "The pestilential noise of aeroplanes coming into land."}, {"viet": "Viên phi công đã đáp xuống theo sự chỉ định của máy móc do tầm nhìn bị hạn chế.", "eng": "The pilot made an instrument landing because of low visibility."}, {"viet": "Chiếc máy bay đó đến muộn mất một giờ.", "eng": "The plane was an hour behind time."}, {"viet": "Các vận động viên phải tập trung vào buổi sáng để tập luyện.", "eng": "The players will meet for a practice in the morning."}, {"viet": "Hàng rào cảnh sát không thể cản đám đông dừng lại.", "eng": "The police cordon was unable to hold back the crowd."}, {"viet": "Cảnh sát nói rằng anh ta đã lái xe quá tốc độ qui định trên đường cao tốc.", "eng": "The police said he'd been speeding on the motorway."}, {"viet": "Hệ thống treo kém nên ngồi xe khá xóc.", "eng": "The poor suspension gives a rather bumpy ride."}, {"viet": "Những kỹ năng thực hành cần thiết trong nghề mộc.", "eng": "The practical skills needed in carpentry."}, {"viet": "Vị chủ tịch đã thẳng tay trừ khử những đối thủ của ông ta.", "eng": "The president ruthlessly disposed of his rivals."}, {"viet": "Khi tập nội các mới, ông thủ tướng đã làm một cuộc thanh trừng kĩ lưỡng.", "eng": "The Prime Minister in forming the new cabinet has made a clean sweep."}, {"viet": "Vấn đề không dễ chút nào.", "eng": "The problem is far from easy."}, {"viet": "Dụng cụ phù hợp cho công việc đó.", "eng": "The proper tool for the job."}, {"viet": "Con chó con đã đái một bãi trên tấm thảm.", "eng": "The puppy has done a piddle on the carpet."}, {"viet": "Vấn đề phân biệt chủng tộc là một vấn đề chính trị nan giải.", "eng": "The racial discrimination issue is a political hot potato."}, {"viet": "Lý do để anh ấy ra đi đột ngột chẳng bao lâu trở nên quá rõ ràng.", "eng": "The reasons for his sudden departure soon became apparent."}, {"viet": "Tiền thuê phải trả vào cuối mỗi quý.", "eng": "The rent is due at the end of each quarter."}, {"viet": "Những kết quả xét nghiệm về thai nghén của cô ta là âm tính.", "eng": "The results of her pregnancy test were negative."}, {"viet": "Con sông dài hơn năm mươi kilômét.", "eng": "The river is over fifty kilometres long."}, {"viet": "Mái nhà sập dưới sức nặng của lớp tuyết phủ.", "eng": "The roof collapsed under the weight of snow."}, {"viet": "Thế bài đã nghiêng về tôi.", "eng": "The run of the cards favoured me."}, {"viet": "Vụ tai tiếng đó làm anh ta bị mang tiếng suốt đời.", "eng": "The scandal branded him for life."}, {"viet": "Kịch bản đó đã bị sửa đổi khá nhiều, nhất là về mặt kết cấu.", "eng": "The script suffered considered sea change, particularly in structure."}, {"viet": "Viên trung úy hét to ra lệnh cho binh lính của mình.", "eng": "The sergeant bawled out a command to his men."}, {"viet": "Con tàu bị mất các cột buồm trong cơn bão.", "eng": "The ship lost its masts in the gale."}, {"viet": "Cửa hàng rất nhộn nhịp vào mùa Giáng Sinh.", "eng": "The shops are very busy at Christmas."}, {"viet": "Vị trí của pháo đài cổ nhìn thấy rõ từ trên không.", "eng": "The site of the old fort is clearly visible from the air."}, {"viet": "Con rắn cuốn quanh cánh tay tôi.", "eng": "The snake twisted round my arm."}, {"viet": "Nhà tiên tri trong vở kịch'Julius Caesar'của Shakespeare.", "eng": "The soothsayer in Shakespeare's'Julius Caesar'."}, {"viet": "Trước khi một em bé ra đời, tinh hoàn và trứng phải gặp nhau và kết hợp với nhau.", "eng": "The sperm and egg have to meet and join before a baby can be born."}, {"viet": "Sự sút giảm đều đều lòng tin vào Tổng thống.", "eng": "The steady erosion of the President's credibility."}, {"viet": "Các đường phố lênh láng máu sau cuộc tàn sát.", "eng": "The streets were running with blood after the massacre."}, {"viet": "Đề nghị đó được hội đồng hoàn toàn nhất trí chấp thuận.", "eng": "The suggestion was accepted nem con by the committee."}, {"viet": "Người thợ may khâu khoá kéo vào quần.", "eng": "The tailor sewed a zipper on to the trouser."}, {"viet": "Thầy giáo bị sốc bởi sự thiếu quan tâm rõ ràng của bố mẹ đối với hành vi của con mình.", "eng": "The teacher was shocked by the parent's apparent lack of concern about their child's behaviour."}, {"viet": "Những kẻ khủng bố đe doạ làm nổ tung chiếc máy bay chở khách bị bắt cóc.", "eng": "The terrorists are threatening to blow up the hijacked airliner."}, {"viet": "Cơn bão có thể làm thời tiết dịu đi.", "eng": "The thunderstorm may settle the weather."}, {"viet": "Bây giờ mỏ đã đóng cửa thành phố như là chết.", "eng": "The town is dead now the mine has closed."}, {"viet": "Sự điều trị loạn dâm bằng tâm lý liệu pháp.", "eng": "The treatment of sexual perversion by psychotherapy."}, {"viet": "Hai loại tiền tệ đã đạt tỉ suất ngang nhau, sự ngang giá.", "eng": "The two currencies have now reached parity."}, {"viet": "Thắng lợi bất ngờ đã khích lệ tinh thần toàn đội.", "eng": "The unexpected win boosted the team's morale."}, {"viet": "Lọ hoa đã bị vỡ tan thành hàng nghìn mảnh.", "eng": "The vase shattered into a thousand pieces."}, {"viet": "Người hầu bàn phủi những miếng bánh vụn trên bàn xuống.", "eng": "The waiter flicked the crumbs off the table."}, {"viet": "Thời tiết là mục chính trong cuộc trò chuyện của họ.", "eng": "The weather forms the staple of their conversation."}, {"viet": "Mụ phù thuỷ dùng tà thuật biến hoàng tử thành con cóc.", "eng": "The wicked fairy bewitched the prince and turned him into a frog."}, {"viet": "Từ'hour'phát âm không có âm bật hơi ở đầu từ.", "eng": "The word'hour'is pronounced without an initial aspirate."}, {"viet": "Tia X quang cho thấy chân cậu bé đã bị gãy.", "eng": "The X-ray showed that the boy's leg was broken."}, {"viet": "Những cố gắng của họ đáng được ông ủng hộ.", "eng": "Their efforts are worthy of your support."}, {"viet": "Trung đoàn của họ ở vị trí tiền tiêu.", "eng": "Their regiment was in an advanced position."}, {"viet": "Cũng có một phòng lớn dùng để họp hành.", "eng": "Then there's a big room, for meetings."}, {"viet": "Có khả năng phần nào là nó sẽ đến.", "eng": "There's a reasonable chance that he'll come."}, {"viet": "Không có lấy một tí sự thật nào trong lời khiếu nại đó cả.", "eng": "There's not a scrap of truth in the claim."}, {"viet": "Mỗi lục địa đều có đất của Anh.", "eng": "There are British lands on every continent."}, {"viet": "Có nhiều rạp chiếu bóng ở khu vực này.", "eng": "There are several cinemas in the locality."}, {"viet": "Giữa hai trường này xưa nay vẫn có mối liên kết chặt chẽ với nhau.", "eng": "There has always been a close association between these two schools."}, {"viet": "Có rất nhiều bụi ở trên nóc tivi.", "eng": "There is a lot of dust on top of the TV."}, {"viet": "Không có dấu hiệu bớt căng thẳng nào trong cuộc khủng hoảng bắt cóc máy bay.", "eng": "There is no sign of a let-up in the hijack crisis."}, {"viet": "Không thể có sự thiếu thống nhất ở trong đảng ta.", "eng": "There should be no disunity within our party."}, {"viet": "Có sự phản kháng ầm ĩ về việc tăng thuế.", "eng": "There was an uproar over the tax increases."}, {"viet": "Có giọng điệu ghen ghét trong lời nói của anh ấy.", "eng": "There were overtones of envy in his speech."}, {"viet": "Người hang động cũng làm mô hình thú vật.", "eng": "These cave men also made models of animals."}, {"viet": "Những bức vẽ này sẽ tạo thành phần cốt lõi của một bộ sưu tập mới.", "eng": "These paintings will form the nucleus of a new collection."}, {"viet": "Họ hoàn toàn chống lại những kiến nghị mới.", "eng": "They're completely anti the new proposals."}, {"viet": "Họ không tham gia cuộc tranh luận.", "eng": "They absented themselves from the debate."}, {"viet": "Theo kế hoạch thì hàng sẽ đến Hồng Kông vào ngày 7 tháng mười hai.", "eng": "They are supposed to arrive in Hong Kong on December 7."}, {"viet": "Họ không thể săn bắn, nhưng họ được phép câu cá.", "eng": "They cannot hunt, but they are allowed to fish."}, {"viet": "Nó làm được nhiều hơn cả việc khiến cho một cơ thể hoạt động và làm cho nó đi đến nơi mà chúng ta muốn.", "eng": "They do more than keep our body machines running and make them go where we want them to go."}, {"viet": "Họ đã sửa chữa hoàn hảo chiếc xe hơi nên trông nó như mới.", "eng": "They gave the car the works and it looks like new."}, {"viet": "Chúng có vẩy ở trên cánh.", "eng": "They have scales on their wings."}, {"viet": "Họ đã làm một đồ thị để xem thời tiết mỗi ngày nóng thế nào trong một tháng.", "eng": "They made a graph of how hot the weather was every for a month."}, {"viet": "Họ thêu dệt câu chuyện về việc tìm đá quý.", "eng": "They pitched a yarn about finding the jewels."}, {"viet": "Họ ngồi trong bóng râm vì mặt trời quá nóng.", "eng": "They sat in the shade because the sun was too hot."}, {"viet": "Họ cởi quần áo và chạy xuống nước.", "eng": "They stripped off and ran into the water."}, {"viet": "Họ đi sâu vào các mỏ than đá, mỏ sắt và mỏ đồng.", "eng": "They went into coal and iron and copper mines."}, {"viet": "Họ đã bị thuyết phục ký giấy từ bỏ các yêu sách đối với người chủ đất.", "eng": "They were persuaded to sign a waiver of claims against the landlord."}, {"viet": "Công việc trong công ty đã tới tình trạng làm ông ấy đang nghĩ đến việc từ chức.", "eng": "Things have come to such a state in the company that he's thinking of resigning."}, {"viet": "Lớp sơn bóng ở xe hơi này là cái bảo vệ có hiệu quả chống gỉ.", "eng": "This car polish is an effective shield against rust."}, {"viet": "Cuộc thảo luận này bàn về một tình huống tôi rất chú ý.", "eng": "This discussion is on a matter of considerable interest to me."}, {"viet": "Sự việc này trong thời thơ ấu của anh ta không bao giờ được nhắc đến nữa.", "eng": "This incident in his childhood is never again referred to."}, {"viet": "Đây là công việc khó nhọc nhất xưa nay tôi chưa từng làm.", "eng": "This is the most onerous task I have ever undertaken."}, {"viet": "Vấn đề này không quan trọng lắm và không nên chiếm của chúng ta nhiều thời gian.", "eng": "This matter isn't very important and shouldn't detain us very long."}, {"viet": "Bài nhạc này cần khởi đầu mạnh hơn.", "eng": "This piece of music needs to be played with more attack."}, {"viet": "Cửa hiệu này có mặt hàng áo khoác mùa đông đẹp.", "eng": "This shop has a nice line in winter coats."}, {"viet": "Thắng lợi này lập lại thế cân bằng cho những thất bị trước đây của chúng ta.", "eng": "This victory compensates for our earlier defeats."}, {"viet": "Tuy rất thông minh, song cô ta vẫn khá khiêm tốn.", "eng": "Though very intelligent, she is nevertheless rather modest."}, {"viet": "Tom dương dương tự đắc vì được một đám đông những người đẹp bao vây.", "eng": "Tom swaggered in surrounded by a bevy of beauties."}, {"viet": "Với ban quản trị mới, tình hình đã trở nên ngày càng xấu hơn.", "eng": "Under the new management things have gone from bad to worse."}, {"viet": "Phải chăng chỉ vì tham lam mà mày đã ăn trộm cái đó?", "eng": "Was it simple greed that made you steal it?"}, {"viet": "Chúng tôi không chịu được sự hỗn láo của cậu, anh bạn trẻ ạ!", "eng": "We'll have no more of your sauce, young man!"}, {"viet": "Chúng tôi định đi thăm vài người bạn cũ ở New York.", "eng": "We're going to visit some old friends in New York."}, {"viet": "Gần đây chúng tôi làm vườn rất nhiều.", "eng": "We've been doing a lot of gardening lately."}, {"viet": "Chúng tôi có rượu Whisky, rượu vang, bia, nước trái cây và xôđa.", "eng": "We've got whisky, wine, beer, juice and soda."}, {"viet": "Chúng ta sẽ đi xem vở kịch mới ở nhà hát.", "eng": "We are going to see the new play at the Playhouse."}, {"viet": "Chúng tôi tin là chất lượng cao cấp của sản phẩm của chúng tôi sẽ thuyết phục quý vị thử một đơn đặt hàng.", "eng": "We believe that the high quality of our goods will make you place a trial order with us."}, {"viet": "Chúng ta có thể gặp nhau tại nhà của tôi hoặc nhà của anh, tuỳ ý anh muốn.", "eng": "We can meet at my house or yours, just as you wish."}, {"viet": "Khi chúng tôi lên tới đỉnh đồi, chúng tôi nhìn thấy lâu đài.", "eng": "We crested the hill, we saw the castle."}, {"viet": "Chúng tôi thuê người hướng dẫn để chỉ đường đi qua dãy núi.", "eng": "We engaged a guide to show us the way across the mountains."}, {"viet": "Chúng tôi đã có một sự bất đồng nhỏ về thời gian.", "eng": "We had a slight misunderstanding over the time."}, {"viet": "Tất cả chúng ta đều phải thắt lưng buộc bụng.", "eng": "We have all got to tighten our belts, you know."}, {"viet": "Bây giờ tôi phải đi để kịp xe buýt.", "eng": "We have to leave now, so that we can catch the bus."}, {"viet": "Chúng tôi đã bỏ lỡ một cơ hội trốn thoát cuối cùng.", "eng": "We let the last chance of escape slip through our fingers."}, {"viet": "Chúng ta phải cử người nào đó làm thư kí.", "eng": "We must appoint sb to act as Secretary."}, {"viet": "Chúng ta cần một bệnh viện dành cho việc chữa bệnh.", "eng": "We need a clinic expressly for the treatment."}, {"viet": "Chúng tôi để báo thành đống trên sàn.", "eng": "We put the newspapers in piles on the floor."}, {"viet": "Chúng ta sẽ phải nghe nhiều lời vô vị nữa về nguy cơ của bội chi.", "eng": "We shall have to listen to more platitudes about the dangers of overspending."}, {"viet": "Rồi chúng tôi chuyển về Paris, nơi chúng tôi đã từng sống sáu năm.", "eng": "We then moved to Paris, where we lived for six years."}, {"viet": "Chúng tôi lên bờ khi thuyền tới cảng.", "eng": "We went ashore when the boat reached the port."}, {"viet": "Chúng tôi đã bị tuyết bó chân trong lều suốt hai tuần.", "eng": "We were snow-bound in the cottage for two weeks."}, {"viet": "Từ weak kết hợp với từ tea nhưng từ feeble thì không.", "eng": "Weak collocates with tea but feeble does not."}, {"viet": "À, anh muốn đi đến một hòn đảo ở vùng nhiệt đới.", "eng": "Well, I want to go to a tropical island."}, {"viet": "Say mê hòn đảo tuyệt vời.", "eng": "Were enamoured with the charming island."}, {"viet": "Cái người đàn ông đó nói nhiều quá đi-không ai có thể chen vào một lời.", "eng": "What a talker that man is-no one else can get a word in."}, {"viet": "Thành phố nào có giá trị sinh hoạt cao nhất ở Châu Âu?", "eng": "What city has the highest cost of living in Europe?"}, {"viet": "Phần tiền thưởng của anh tổng cộng là bao nhiêu?", "eng": "What does your share of the bonus work out at?"}, {"viet": "Nếu chúng tôi mua 10000 đơn vị thì ngày giao hàng sớm nhất là ngày nào?", "eng": "What is the earliest delivery date if we purchase 10,000 units?"}, {"viet": "Kế bên loại cá Mahi-Mahi là loại cá gì vậy?", "eng": "What kind of fish is that next to the Mahi-Mahi?"}, {"viet": "Công việc chính của ông là gì vậy?", "eng": "What's your line of business?"}, {"viet": "Ông nên đề nghị chúng ta làm gì lúc đó?", "eng": "What would you suggest we do then?"}, {"viet": "Ông ta chết đi để lại gia đình cơ cực.", "eng": "When he died, his family was left destitute."}, {"viet": "Nếu nói chuyện kĩ xảo nghề nghiệp, Sally giỏi hơn bất cứ ai.", "eng": "When it comes to craftsmanship, Sally is on her own."}, {"viet": "Khi thời tiết khá lên chúng tôi cố leo lên núi.", "eng": "When the weather improved we essayed the ascent of the mountain."}, {"viet": "Mỗi khi cảnh sát đến gặp anh ta, Jack luôn tỏ ra là một người ngay thẳng tươi cười, hoàn hảo.", "eng": "Whenever the police were on to him, Jack was always a complete, smiling cleanskin."}, {"viet": "Quý vị muốn ngồi ở đâu?", "eng": "Where would you like to sit?"}, {"viet": "Ở nước ông chính đảng nào đang cầm quyền?", "eng": "Which political party is in office in your country?"}, {"viet": "Anh là ai mà bảo tôi không được để xe đạp ở đây?.", "eng": "Who are you to tell me I can't leave my bicycle here?."}, {"viet": "Tại sao anh lại thành kiến với người nước ngoài như vậy?", "eng": "Why are you so prejudiced against foreigners?"}, {"viet": "Tại sao không nén lại thêm chút nữa?", "eng": "Why not stay a bit longer?"}, {"viet": "Anh có dùng ít xúp trước khi dọn món thịt không?", "eng": "Will you have some soup before the meat course?"}, {"viet": "Nó vươn tay ra, với tới cái giá.", "eng": "With a stretch of his arm, he reached the shelf."}, {"viet": "Nhà thơ Wordsworth lấy cảm hứng từ cảnh vật vùng Hồ, đó là một nguồn cảm hứng lớn đối với ông.", "eng": "Wordsworth found inspiration from the Lake District scenery, It was a great source of inspiration to him."}, {"viet": "Ông có muốn tôi dọn dẹp phòng của ông bây giờ không?", "eng": "Would you like me to clean your room now?"}, {"viet": "Anh vui lòng mang đến cho tôi một suất ăn tối nhé?", "eng": "Would you please bring me a supper?"}, {"viet": "Vâng, tôi cũng nghĩ như vậy.", "eng": "Yeah, that's what I thought."}, {"viet": "Hãy lên chuyến xe buýt số 4 rồi xuống xe ở bến đỗ thứ 5.", "eng": "Yes, take the No. 4 but and get off the fifth stop."}, {"viet": "Anh sẽ thấy đoạn cuối hết sức thích hợp.", "eng": "You'll find last paragraph extremely apropos."}, {"viet": "Anh đã rất hớ hênh để người ta có thể buộc tội là không thành thật.", "eng": "You're laying yourself wide open to accusations of dishonesty."}, {"viet": "Anh đã có trong tay một bằng đại học.", "eng": "You already had one university degree under your belt."}, {"viet": "Không thể không lo ngại cho tương lai của con cái mình.", "eng": "You can't help being anxious about your children's future."}, {"viet": "Anh có thể nghe tiếng súng quân địch nổ đì đùng ở phía xa.", "eng": "You can hear the enemy guns booming away in the distance."}, {"viet": "Ông nên tiêu cho lẹ hơn.", "eng": "You'd better spent them quickly."}, {"viet": "Anh không có cảm xúc trước vẻ đẹp của thiên nhiên.", "eng": "You have no feeling for the beauty of nature."}, {"viet": "Ông sẽ nhìn thấy nó khi chúng ta đi qua.", "eng": "You'll see it as we pass by."}, {"viet": "Anh phải trả lời đúng tối thiểu 40 câu hỏi mới qua được kỳ thi.", "eng": "You must get a minimum of 40 questions right to pass the examination."}, {"viet": "Anh cần quần áo ấm để che đỡ cho anh khỏi lạnh.", "eng": "You need warm clothes to protect you against the cold."}, {"viet": "Cậu phải nhìn tận mắt cái lối trơ tráo khi cô ta đã lấy chiếc rađiô của mình mà chẳng thèm hỏi lấy một lời.", "eng": "You should have seen the cool way she took my radio without even asking."}, {"viet": "Mở một nắp hộp bình thường bằng cách xoay ngược chiều kim đồng hồ.", "eng": "You unscrew a normal lid by twisting it anticlockwise."}, {"viet": "Cậu sẽ viết đẹp hơn nếu cậu có một cái bút tốt.", "eng": "You would write better if you had a good pen."}, {"viet": "Hành lí của ông sẽ được chuyển bằng máy bay trực thăng từ phi trường về khách sạn của ông.", "eng": "Your luggage will be conveyed by helicopter from the airport to your hotel."}]