[{"viet": "Người mù đọc chữ bằng cách đưa ngón tay sờ lên những dòng chấm nhỏ.", "eng": "A blind person reads Braille by running his fingers over lines of dots."}, {"viet": "Một đứa trẻ nằm trên giường gần như bắt đầu khóc thút thít.", "eng": "A child in a bed nearly began to whimper."}, {"viet": "Một đống máy móc cũ kỹ gỉ sét.", "eng": "A conglomeration of rusty old machinery."}, {"viet": "Một nỗ lực nghiên cứu trên qui mô cả nước kéo dài suốt một thập kỷ.", "eng": "A decade long national research effort."}, {"viet": "Một rãnh nước bị những chiếc lá úa làm nghẹt.", "eng": "A drain clogged up with dead leaves."}, {"viet": "Một hồ sơ thông tin tối mật.", "eng": "A file of top secret information."}, {"viet": "Sự nhớ lại lờ mờ các biến cố đã qua.", "eng": "A fuzzy recollection of past events."}, {"viet": "Một khối nước lớn đã làm ngập làng.", "eng": "A great mass of water overwhelmed the village."}, {"viet": "Một bút pháp rất gượng gạo.", "eng": "A highly affected style of writing."}, {"viet": "Cái vòng đeo khóa dùng để mắc các chìa khóa vào.", "eng": "A key ring is for carrying keys on."}, {"viet": "Một nỗ lực sống còn để lọt vào vòng chung kết.", "eng": "A life-or-death attempt to reach the grand final."}, {"viet": "Một cái máy có sẵn nguồn điện năng.", "eng": "A machine with an integral power source."}, {"viet": "Một bản dịch có vần luật của thiên anh hùng ca Iliad.", "eng": "A metrical translation of the Iliad."}, {"viet": "Một chiếc xe đạp mới là điều không thể bàn tới được-chúng ta không đủ tiền mua.", "eng": "A new bicycle is out of the question-we can't afford it."}, {"viet": "Một vết đau khó chịu ở vòm miệng của cô ta.", "eng": "A painful sore in the roof of her mouth."}, {"viet": "Một lòng khát khao trả thù nhỏ nhen của cô ta.", "eng": "A petty desire to have her revenge."}, {"viet": "Danh tiếng mau phai nhoà của một ca sĩ nhạc pop.", "eng": "A pop singer's evanescent fame."}, {"viet": "Việc bắt đầu cuộc họp đúng giờ.", "eng": "A punctual start to the meeting."}, {"viet": "Một món trộn ghê tởm bột với cà ri.", "eng": "A revolting mixture of pasta and curry."}, {"viet": "Tiếng thắng xe kêu rít khiến chúng tôi chạy ra xem ngoài phố đã xảy ra chuyện gì.", "eng": "A screech of brakes made us took to see what had happened in the street."}, {"viet": "Một người bệnh ở trong tình trạng nguy kịch.", "eng": "A sick person in a grave condition."}, {"viet": "Một hình ảnh ảm đạm về tương lai của thế giới.", "eng": "A sombre picture of the future of the world."}, {"viet": "Một chiếc áo kỳ quặc chẳng ra hình thù gì đã từng là một cái áo vét.", "eng": "A strange shapeless garment that had once been a jacket."}, {"viet": "Một giọt nước mắt lăn xuống má của anh ấy.", "eng": "A tear rolled down his cheek."}, {"viet": "Một kẻ phá rối trong một tập thể bao giờ cũng là kẻ hắc ám.", "eng": "A troublemaker within a group is always bad news."}, {"viet": "Một sự đón nhận nồng nhiệt cuộc thay đổi từ đời sống thành thị sang nông thôn.", "eng": "A welcome change from town to country life."}, {"viet": "Khoảng ba phần tư nhân dân thế giới hiện nay mặc quần áo bằng vải bông.", "eng": "About three-fourths of all the people in the world today wear cotton clothing."}, {"viet": "Thêm ít than nữa vào để giữ cho lửa cháy tiếp.", "eng": "Add some more coal to keep the fire going."}, {"viet": "Sau tất cả những gì đã xảy đến giữa hai người.", "eng": "After all that has passed between them."}, {"viet": "Sau vài ngày chất thịt lên men và hạt, hay hột, tách rời ra.", "eng": "After several days the pulp ferments and the seeds, or beans, separate from it."}, {"viet": "Sau đó cô ta đã bớt khắt khe và để cho con cái thức khuya xem TV.", "eng": "Afterwards she relented and let the children stay up late to watch TV."}, {"viet": "Tất cả mọi người đều bình đẳng trước Thượng đế.", "eng": "All men are equal in the sight of God."}, {"viet": "Tất cả quang cảnh lộng lẫy của buổi lễ đăng quang.", "eng": "All the pageantry of a coronation."}, {"viet": "Mặc dù trời đang nắng, tôi vẫn mang theo một cái ô chỉ để phòng xa.", "eng": "Although the sun was shining, I took an umbrella just to be on the safe side."}, {"viet": "Một vẻ giả tạo bao trùm toàn bộ buổi lễ.", "eng": "An air of unreality hung over the whole ceremony."}, {"viet": "Một lệnh cấm vận buôn bán với các đảo khác.", "eng": "An embargo on trade with other island."}, {"viet": "Một câu trả lời gián tiếp về một câu hỏi.", "eng": "An indirect answer to a question."}, {"viet": "Một loại nước cam cô đặc để bạn pha loãng với nước.", "eng": "An orange concentrate which you dilute with water."}, {"viet": "Và kìa cô ta bằng xương bằng thịt.", "eng": "And there she was as large as life."}, {"viet": "Dự đoán trời sắp tối nên tất cả bọn họ mang theo đèn pin.", "eng": "Anticipating that it would soon be dark, they all took torches."}, {"viet": "Ở nước bạn, giấy phép hoặc giấy chứng nhận có quan trọng không?", "eng": "Are licenses or certificates important in your country?"}, {"viet": "Anh có thích công việc mới của bạn không?", "eng": "Are you enjoying your new job?"}, {"viet": "Bây giờ, cô đang làm việc với ông chủ cô phải không?", "eng": "Are you with your boss now?"}, {"viet": "Khi Khổng Phu Tử quan sát những người ở quanh ông, ông nóng lòng muốn giúp đỡ họ.", "eng": "As Confucius watched the people around him, he became eager to help them."}, {"viet": "Như thường lệ phần lớn nhất của ngân sách là dành cho quốc phòng.", "eng": "As usual, the lion's share of the budget is for defense."}, {"viet": "Cuối cùng thì mùa đông cũng qua đi.", "eng": "At last winter came to an end."}, {"viet": "Au là ký hiệu hóa học của vàng.", "eng": "Au is the chemical symbol for gold."}, {"viet": "Cẩn thận đó-gai sẽ đâm vào anh đấy.", "eng": "Be careful-the thorns will prick you."}, {"viet": "Ngượng ngùng vẻ bề ngoài của ai.", "eng": "Be self-conscious about one's appearance."}, {"viet": "Là một thám tử đòi hỏi phải đi đây đi đó luôn.", "eng": "Being a detective involves a lot of leg work."}, {"viet": "Từ blacken là một động từ chỉ nguyên nhân, có nghĩa là làm cho đen.", "eng": "Blacken is causative verb meaning cause to become black."}, {"viet": "Đưa cuộc vận động đến thành công.", "eng": "Bring a campaign to a successful issue."}, {"viet": "Việc kinh doanh lắng xuống vào thời gian này trong năm.", "eng": "Business is quiet at this time of the year."}, {"viet": "Nhưng tôi quá mệt đến độ không mở mắt được.", "eng": "But now I'm so tired I can't keep my eyes open."}, {"viet": "Do một sự ngẫu nhiên kỳ lạ chúng tôi tình cờ đi cùng một xe lửa.", "eng": "By a strange coincidence we happened to be travelling on the same train."}, {"viet": "Tính diện tích tam giác được tạo ra theo cách này.", "eng": "Calculate the area of the triangle thus formed."}, {"viet": "Xin Ngài cho phép tôi xem vé?", "eng": "Can I see your ticket, guvnor?"}, {"viet": "Vui lòng chuyển cho anh ấy tin nhắn giúp tôi nhé?", "eng": "Can you give him a message for me?"}, {"viet": "Anh có thể đại diện cho tôi ở buổi họp không?", "eng": "Can you substitute for me at the meeting?"}, {"viet": "Ôtô không được phép đi ngang qua trung tâm thành phố.", "eng": "Cars are not allowed to go through the city centre."}, {"viet": "Trẻ con không thích bị nghe các giáo viên khoa trương nói oang oang dài dòng.", "eng": "Children dislike being spouted at by pompous teachers."}, {"viet": "Lau sạch đèn đó dễ lắm; chỉ cần chùi nó bằng một miếng giẻ ướt.", "eng": "Cleaning the light is simplicity itself; just wipe it with a damp cloth."}, {"viet": "Hãy đi đến sàn nhảy disco nào, đừng làm người cổ lỗ sĩ như vậy!", "eng": "Come to the disco and stop being such an old fogy!"}, {"viet": "Xin chúc mừng, tôi biết bạn đã được thăng chức Phó Chủ tịch!", "eng": "Congratulations, I understand you were promoted-to vice president!"}, {"viet": "Chúng ta vào văn phòng nhé?", "eng": "Could we go into the office?"}, {"viet": "Anh có thể cho tôi biết lãi suất được không?", "eng": "Could you tell me the interest rate?"}, {"viet": "Tự ai đó thoát ly gia đình của mình.", "eng": "Cut oneself loose from one's family."}, {"viet": "Bất chấp thói thường bằng cách ăn mặc lố lăng.", "eng": "Defy convention by wearing outrageous clothes."}, {"viet": "Các chi tiết của cuộc bầu cử sẽ được niêm yết ngoài tòa thị sảnh.", "eng": "Details of the election will be posted outside the town hall."}, {"viet": "Bà tự làm bánh phải không, Bà A?", "eng": "Did you make it yourself, Mrs. A?"}, {"viet": "Bộ phận hiển thị, máy in và những thiết bị ngoại vi khác.", "eng": "Display units, printers and other peripherals."}, {"viet": "Có phải người Ý thực sự thiết kế hay hơn chúng ta không?", "eng": "Do the Italians really design better than we do?"}, {"viet": "Bạn có cảm thấy là đa số sinh viên đại học ở nước bạn học hành chăm chỉ không?", "eng": "Do you feel that the majority of university students in your country study hard?"}, {"viet": "Ông có số các chi phiếu không?", "eng": "Do you have the numbers of the checks?"}, {"viet": "Bạn muốn nói về cô Anne Smith hay về cô Mary Smith?", "eng": "Do you mean Miss Anne Smith or Miss Mary Smith?"}, {"viet": "Bạn có nghĩ rằng hiện giờ Nhật Bản là một nước rất giàu không?", "eng": "Do you think Japan is a very rich country now?"}, {"viet": "Các bác sĩ đã phát hiện một khối u ác tính trên vú của cô ấy.", "eng": "Doctors found a cancer on her breast."}, {"viet": "Đừng nhận trách nhiệm về tai nạn đó.", "eng": "Don't admit liability for the accident."}, {"viet": "Đừng bao giờ đặt chân đến ngôi nhà này một lần nữa!", "eng": "Don't ever set foot in this house again!"}, {"viet": "Đừng hoảng hốt-hãy bình tĩnh!", "eng": "Don't lose your head-keep calm!"}, {"viet": "Đừng có nói trong khi miệng con đầy thức ăn.", "eng": "Don't talk with your mouth full."}, {"viet": "Tiến sĩ Lý ạ, chúng tôi đã xem xét đơn xin việc của ông rất cẩn thận.", "eng": "Dr. Li, we have reviewed your job application form very carefully."}, {"viet": "Những hạt bụi lửng lơ trong một ánh nắng xiên.", "eng": "Dust motes hung in a slant of sunlight."}, {"viet": "Mê giọng nói của chính mình.", "eng": "Enamoured of the sound of one's own voice."}, {"viet": "Mặc dù đôi khi cô ta có phạm sai lầm đi chăng nữa-cô ta cũng chỉ là con người.", "eng": "Even she makes mistakes occasionally-she's only human."}, {"viet": "Những người nghiện rượu trước đây đã cam kết bỏ rượu.", "eng": "Ex-drinkers who have taken the pledge."}, {"viet": "Các nhà thám hiểm đi đến những nơi chưa có người đặt chân tới.", "eng": "Explorers going where no man had trod before."}, {"viet": "Số phận đã an bài việc hội ngộ của họ.", "eng": "Fate had pre-ordained their meeting."}, {"viet": "Tiền tài trợ cho cơ quan y tế nhà nước lấy từ những người đóng thuế.", "eng": "Finance for National Health Service comes from taxpayers."}, {"viet": "Ngọn lửa phụt ra khỏi miệng ống.", "eng": "Flames jetted out of the nozzles."}, {"viet": "Xem thêm chi tiết ở trang 9 và các trang tiếp theo.", "eng": "For further information see pp 9 et seq."}, {"viet": "Con nói thật, mẹ có thể giảm một ít cân.", "eng": "Frankly, mother, you could lose a few pounds."}, {"viet": "Rạch tay của ai một vết sâu bằng một mảnh thuỷ tinh vỡ.", "eng": "Gash one's arm on a piece of broken glass."}, {"viet": "Tìm hiểu được cách bố trí của vùng lân cận.", "eng": "Getting to know the geography of a neighbourhood."}, {"viet": "Căn cứ vào số liệu thống kê của chính phủ về tình trạng thất nghiệp, cơ may thắng cử của họ xem ra mỏng manh lắm.", "eng": "Given the government's record on unemployment, their chances of winning the election look poor."}, {"viet": "Rượu tốt sẽ ngon hơn theo thời gian.", "eng": "Good wine will improve with age."}, {"viet": "Một nửa số tiền đó nên đổi thành séc du lịch.", "eng": "Half of that should be in travelers'checks."}, {"viet": "Có những hiểu biết thích hợp với công việc đó.", "eng": "Have the right qualities of mind for the job."}, {"viet": "Trước đây bạn có bao giờ học tiếp thị chưa?", "eng": "Have you ever studied marketing before?"}, {"viet": "Anh đã nộp đơn xin việc làm của anh chưa?", "eng": "Have you sent in your application for the job?"}, {"viet": "Anh ta là một thợ giỏi, nhưng cần phải thúc giục anh ta.", "eng": "He's a good worker but he needs hurrying up."}, {"viet": "Ông ấy ra ra vào vào bệnh viện suốt cả năm.", "eng": "He's been in and out of hospital all year."}, {"viet": "Cậu ấy bất tài không còn hy vọng gì, nhưng tôi cho rằng cậu ta có ý định tốt.", "eng": "He's hopelessly inefficient, but I suppose he means well."}, {"viet": "Ông ta đã giong buồm đi khắp bốn biển để tìm sự mạo hiểm.", "eng": "He's sailed the seven seas in search of adventure."}, {"viet": "Ông ta đã buộc tội những kẻ chỉ trích tác phẩm của ông là những người phi văn hóa.", "eng": "He accused those who criticized his work of being philistines."}, {"viet": "Anh ấy hỏi chúng tôi vài câu.", "eng": "He asked us a few questions."}, {"viet": "Nó bẻ thanh sôcôla ra làm hai.", "eng": "He broke the bar of chocolate into two pieces."}, {"viet": "Anh chứng nhận đó là nét chữ của vợ mình.", "eng": "He certified that it was his wife's handwriting."}, {"viet": "Anh ta di chuyển chiếc xe đẩy kêu rầm rầm qua các cửa.", "eng": "He crashed the trolley through the doors."}, {"viet": "Ông ta chết sau khi bị một con hổ cào xé.", "eng": "He died after being mauled by a tiger."}, {"viet": "Anh ta dùng con dao để làm đòn bẩy.", "eng": "He employed his knife as a lever."}, {"viet": "Anh ấy lục túi kiếm tiền.", "eng": "He felt in his pocket for some money."}, {"viet": "Anh ta đã đưa cái đó cho cô em gái của mình.", "eng": "He gave it to his sister."}, {"viet": "Anh ta chào tôi trên đường phố bằng một cái vẫy tay thân mật.", "eng": "He greeted me in the street with a friendly wave of the hand."}, {"viet": "Nó phải trả một món tiền phạt rất lớn.", "eng": "He had to pay a walloping great fine."}, {"viet": "Anh ta đã cố khắc phục vấn đề ấy trong một thời gian dài.", "eng": "He has been grappling with the problem for a long time."}, {"viet": "Hắn phải sống với ý thức khủng khiếp là mình đã gây nên cái chết của họ.", "eng": "He has to live with the dreadful knowledge that he caused their deaths."}, {"viet": "Ông ấy là một chủ ngân hàng có nhiều kinh nghiệm quản lý kinh tế.", "eng": "He is a banker with long experience in managing the economy."}, {"viet": "Hắn không những kiêu căng mà còn ích kỷ nữa.", "eng": "He is not only arrogant but also selfish."}, {"viet": "Anh ấy tự nguyện gia nhập quân đội.", "eng": "He joined the army of his own accord."}, {"viet": "Anh ta nâng cô bé lên và đặt nó ngồi trên tường.", "eng": "He lifted the child and sat her on the wall."}, {"viet": "Hắn mất bình tĩnh và tấn công một cách điên cuồng.", "eng": "He lost his temper and struck out wildly."}, {"viet": "Anh ta trộn một món rau xà lách cho khách.", "eng": "He mixed his guests a salad."}, {"viet": "Anh ta đã thắng được sự thôi thúc mạnh mẽ bỏ chạy.", "eng": "He overcame a strong temptation to run away."}, {"viet": "Trong tình hình này anh ấy muốn giấu tên.", "eng": "He prefers in this instance to remain anonymous."}, {"viet": "Hắn nhảy vội lên ngựa và phóng đi mất.", "eng": "He quickly mounted his horse and rode away."}, {"viet": "Ông ta sống độc thân suốt đời.", "eng": "He remained a bachelor all his life."}, {"viet": "Anh ta là một người ủng hộ chứ không phải là một nhà lãnh đạo.", "eng": "He's a follower, not a leader."}, {"viet": "Ông ta mù cả hai mắt.", "eng": "He's blind in both eyes."}, {"viet": "Ông ta rất tự mãn với chính mình.", "eng": "He's mighty pleased with himself."}, {"viet": "Ông ta già quá so với con nên con không thể kết hôn với ông ta được đâu.", "eng": "He's too old for you to marry."}, {"viet": "Nó nói nó đã quên mất điều đó-chuyện cứ như thật!", "eng": "He says he just forgot about it-a likely story!"}, {"viet": "Anh ta đã bắn con sư tử ở ngay trước họng súng.", "eng": "He shot the lion at point blank range."}, {"viet": "Anh ta hàn sợi dây điện trở lại.", "eng": "He soldered the wire back on."}, {"viet": "Hắn ta ở trong những khách sạn sang trọng nhất.", "eng": "He stays in the swankiest hotels."}, {"viet": "Chắc chắn ông ấy đang sống xa hoa.", "eng": "He sure is living in style."}, {"viet": "Anh ấy tưới nước vào ngọn lửa để ngăn nó khỏi lan ra.", "eng": "He threw water on the fire to prevent it from spreading."}, {"viet": "Anh ta đi khắp nơi trên thế giới.", "eng": "He travelled to places all over the world."}, {"viet": "Ông ấy dùng một cái hộp để chặn cho cửa mở.", "eng": "He used a box to prop the door open."}, {"viet": "Ông ta là một tín đồ công giáo nhưng không ngoan đạo.", "eng": "He was a Catholic but didn't practice his religion."}, {"viet": "Anh ấy than thở vì hỏng thi.", "eng": "He was bewailing his failure in the examination."}, {"viet": "Anh ta thất vọng không xin được việc làm đó, nhưng rồi anh ta sẽ vượt qua được.", "eng": "He was disappointed at not getting the job, but he'll get over it."}, {"viet": "Hắn bị giữ với hai cánh tay bị giật cánh khuỷu ra sau lưng.", "eng": "He was held with his arms pinioned together behind his back."}, {"viet": "Anh ấy rất sung sướng sau khi thắng trận đấu.", "eng": "He was on cloud nine after winning the competition."}, {"viet": "Anh ấy run sợ trước ý nghĩ về việc bay lần đầu.", "eng": "He was shaking in his shoes at the thought of flying for the first time."}, {"viet": "Anh ta quá ngớ ngẩn không đòi hoá đơn.", "eng": "He was too feather-brained to ask a receipt."}, {"viet": "Anh ta vào trạm điện thoại và quay số.", "eng": "He went into the booth and dialled the number."}, {"viet": "Anh ta thắng trong cuộc tranh luận bằng ngụy biện.", "eng": "He won the argument by sophistry."}, {"viet": "Nghe thông báo về một trận bão qua máy vô tuyến trên tàu.", "eng": "Hear a gale warning on a ship's radio."}, {"viet": "Tài kể chuyện của cô ấy đã sớm được thầy giáo nhận thấy.", "eng": "Her aptitude for story telling was soon noticed by her teacher."}, {"viet": "Quả lốp làm động tác giả rất khéo của cô ta hoàn toàn làm hụt bước chân đối thủ.", "eng": "Her cleverly disguised lob completely wrong-footed her opponent."}, {"viet": "Hai mắt của cô ấy nằm rất sát nhau.", "eng": "Her eyes are set very close together."}, {"viet": "Tay cô ấy giật nẩy khi cô ấy đánh rơi đồ uống của mình.", "eng": "Her hand jerk as she dropped her drink."}, {"viet": "Cuốn tiểu thuyết mới nhất của bà ta đã lên tới ba lần tái bản trong năm xuất bản đầu tiên của nó.", "eng": "Her last novel ran into three reprints in its first year of publication."}, {"viet": "Công việc mới của cô ta chắc chắn sẽ làm cho cô liên tục bị bận rộn.", "eng": "Her new job certainly keeps her on the trot."}, {"viet": "Khả năng và kinh nghiệm của cô ta khẳng định cô ta đủ tư cách đảm nhận công việc này.", "eng": "Her qualifications and experience confirm her eligibility for the job."}, {"viet": "Lời cảm ơn của cô ấy hơi tâng bốc quá đáng.", "eng": "Her speech of thanks was a little too fulsome."}, {"viet": "Toàn thể gia đình bà ta được huy động vào công việc khi cửa hàng đông khách.", "eng": "Her whole family were pressed into service when the shop was busy."}, {"viet": "Này, cung hoàng đạo của bạn là gì vậy?", "eng": "Hey, what is your zodiac sign?"}, {"viet": "Toàn bộ tài sản của ông ta gồm các cổ phần trong một công ty và một căn nhà ở London.", "eng": "His assets included shares in the company and a house in London."}, {"viet": "Những cá tính của ông ta không chỉ tồn tại sau những vấn đề rối beng và những thất bại ê chề của họ mà còn học hỏi được những kinh nghiệm của họ nữa.", "eng": "His characters not only survive their snarled problems and pratfalls but learn from their experiences."}, {"viet": "Sự biến mất của anh ta hoàn toàn không thể giải thích được.", "eng": "His disappearance was quite unaccountable."}, {"viet": "Sự thông thạo tiếng địa phương của ông ta làm cho tôi ngạc nhiên.", "eng": "His familiarity with the local languages surprised me."}, {"viet": "Sự phê phán gay gắt của ông ta không phù hợp với giọng điệu thân mật của cuộc họp.", "eng": "His harsh criticism jarred with the friendly tone of the meeting."}, {"viet": "Cuốn phim cuối của ông ấy là một thất bại thật sự.", "eng": "His last movie was a real turkey."}, {"viet": "Âm nhạc của anh ấy đã trở thành một sự say mê nào đó.", "eng": "His music has become something of a cult."}, {"viet": "Các kế hoạch của hắn là con đường dẫn đến thảm họa.", "eng": "His plans are a recipe for disaster."}, {"viet": "Phòng của nó để lộn xộn áo quần cũ, bát đĩa sành cáu bẩn và đồ đạc gẫy.", "eng": "His room was a litter of old clothes, dirty crockery and broken furniture."}, {"viet": "Thành công đã làm cho ông ta mạnh dạn khuếch trương việc kinh doanh của mình.", "eng": "His success emboldened him to expand his business."}, {"viet": "Tài năng vận động viên vượt trội của vợ anh ấy là sự lăng mạ đối với tính chất nam nhi của anh ta.", "eng": "His wife's superiority as an athlete was an affront to his masculinity."}, {"viet": "Phó-mát được khoét lỗ để cho không khí tiếp xúc với nấm mốc.", "eng": "Holes are made in the cheese to let air reach the mold."}, {"viet": "Cuộc sống tình yêu của bạn thế nào-có bạn trai chưa?", "eng": "How's your love life these days-got a boyfriend?"}, {"viet": "Làm thế nào mà anh có thể chịu đựng được người đàn bà khủng khiếp đó?", "eng": "How can you tolerate that awful woman?"}, {"viet": "Bạn thấy việc săn cáo thế nào?", "eng": "How do you feel about fox-hunting?"}, {"viet": "Anh cho rằng thời tiết tốt này sẽ còn kéo dài bao lâu?", "eng": "How long do you think this fine weather will last?"}, {"viet": "Nhóm của ông có bao nhiêu người?", "eng": "How many guests are there in your party?"}, {"viet": "Vá giầy ông lấy bao nhiêu?", "eng": "How much do you charge for mending shoes?"}, {"viet": "Mẹ tôi có thể nhận tiền trong bao lâu nữa?", "eng": "How soon can my mother receive the money?"}, {"viet": "Chồng và vợ hoán đổi vai trò.", "eng": "Husband and wife have reversed roles."}, {"viet": "Tôi muốn đặt trước một bàn ăn tối vào tối nay.", "eng": "I'd like to reserve a table for dinner this evening."}, {"viet": "Tôi sẽ giặt quần áo vì vậy bạn sẽ ủi đồ.", "eng": "I'll do the laundry so you'll do the ironing."}, {"viet": "Tôi sẽ không bao giờ quên được hình ảnh lần đầu tiên con gái tôi khiêu vũ trước công chúng.", "eng": "I'll never forget seeing my daughter dance in public for the first time."}, {"viet": "Tôi là người được uỷ nhiệm cho đến khi ông hiệu trưởng trở về.", "eng": "I'm acting as surrogate till the headmaster returns."}, {"viet": "Tôi đã chán ngấy với những lời kêu ca không ngừng của anh rồi.", "eng": "I'm fed up with your endless complaining."}, {"viet": "Tôi sẽ phải đi cắt chỉ hôm nay,.", "eng": "I'm having my stitches out today."}, {"viet": "Tôi sẽ không hy sinh ngày nghỉ của mình chỉ để đi mua sắm với Jane.", "eng": "I'm not sacrificing my day off just to go shopping with Jane."}, {"viet": "Xin cáo lỗi, cửa hàng này không có bán thuốc lá.", "eng": "I'm sorry, this shop doesn't carry cigarettes."}, {"viet": "Tôi đang nghĩ đến việc tổ chức một buổi tiệc bất ngờ cho sinh nhật của Billy.", "eng": "I'm thinking of having a surprise party for Billy's birthday."}, {"viet": "Tôi đã lái xe 20 năm nay và chưa bao giờ gặp tai nạn-phỉ thui!", "eng": "I've been driving for 20 years and never had an accident-touch wood!"}, {"viet": "Tôi gặp phải một vài vấn đề tôi muốn hỏi ông''Được, anh nói ngay đi'.", "eng": "I've got a couple of questions I'd like to ask you''Right, fire away'."}, {"viet": "Tôi đã bị mất quá nhiều tiền trong năm nay, do đó tôi buộc phải dẹp tiệm.", "eng": "I've lost so much money this year that I'm being forced to shut up shop."}, {"viet": "Hôm nay tôi đi bộ nhiều quá, đôi chân mỏi nhừ.", "eng": "I've walked so much today that my dogs are really killing me."}, {"viet": "Mỗi sáng tôi luôn luôn gặp anh ấy trên xe lửa.", "eng": "I always see him every morning on the train."}, {"viet": "Tôi rất tiếc là chúng tôi không thể cung cấp hàng đúng hẹn do khâu vận chuyển bị trì trệ.", "eng": "I am sorry that we cannot supply the goods on time due to a delay in shipment."}, {"viet": "Tôi đòi giảm giá xuống còn 600 bảng Anh.", "eng": "I beat down the price to £ 600."}, {"viet": "Tôi bị cúm và không thể đi làm được.", "eng": "I came down with flu and was unable to go to work."}, {"viet": "Tôi không thể quyết định đi xem phim nào.", "eng": "I can't make up my mind which film to go and see."}, {"viet": "Tôi có thể làm rất nhanh cho anh một ít trứng bác.", "eng": "I can easily whip you up some scrambled egg."}, {"viet": "Tôi không thể tin vào tai mình nữa!", "eng": "I can't believe my ears!"}, {"viet": "Tôi xin chúc mừng anh đã kiếm được một công việc mới.", "eng": "I congratulate you on getting a new job."}, {"viet": "Tôi rất vui được đến dự.", "eng": "I'd be delighted to come."}, {"viet": "Tôi vốn hết sức ghét bạo lực.", "eng": "I detest violence with my whole being."}, {"viet": "Tôi cũng vậy, nhưng nó rất tốn kém.", "eng": "I do, too, but it costs too much."}, {"viet": "Tôi không hiểu cái gì ám ảnh để anh làm một việc như vậy.", "eng": "I don't know what possessed you to do such a thing."}, {"viet": "Tôi không nghĩ cô ta là nghệ sĩ điển hình.", "eng": "I don't think she's the artistic type."}, {"viet": "Tôi không muốn vào đường đột, nhưng tôi có thể nói chuyện với ông một chút được không?", "eng": "I don't wish to intrude, but could I talk to you for a moment?"}, {"viet": "Tôi nghi ngờ sự an toàn của việc vận chuyển hàng theo cách này.", "eng": "I doubt the safety of transporting goods this way."}, {"viet": "Tôi cảm thấy rất vinh dự vì được ông tin tưởng.", "eng": "I feel highly honoured by your trust."}, {"viet": "Tôi thấy thức ăn Ấn Độ rất cay, nhưng anh sẽ thích cái này, nó rất vừa.", "eng": "I find Indian food too hot, but you'll like this, it's very mild."}, {"viet": "Mỗi ngày tôi thức dậy lúc 6 giờ.", "eng": "I get up at six o'clock every day."}, {"viet": "Tôi có một cơ hội để gây ấn tượng với cô ấy về khả năng của tôi mà tôi đã đánh hỏng mất.", "eng": "I had a chance to impress her with my efficiency and I muffed it."}, {"viet": "Tôi phải cố gắng ý thức rằng không nên đối xử thô bạo với anh ấy.", "eng": "I had to make a conscious effort not to be rude to him."}, {"viet": "Tôi lúc nào cũng thích nghe nói về chính phủ Mỹ.", "eng": "I have always liked hearing about the United States Government."}, {"viet": "Tháng này tôi không có tiền thừa.", "eng": "I have no spare money this month."}, {"viet": "Tôi có hai vé xem vở nhạc kịch “ Câu chuyện bờ Tây ”.", "eng": "I have two tickets for the musical West Side Story."}, {"viet": "Tôi nghe nói học tiếng Nhật rất phổ biến ở Úc.", "eng": "I hear that studying Japanese is popular in Australia."}, {"viet": "Tôi hy vọng rằng ý kiến về sự bình đẳng về cơ hội cho nam nữ đã được mọi người công nhận mãi mãi.", "eng": "I hope that the idea of equality of opportunity for men and women is here to stay."}, {"viet": "Tôi thật không hiểu được việc nó lấy tiền.", "eng": "I just can't understand his taking the money."}, {"viet": "Tôi biết địa điểm chính xác nơi việc ấy xảy ra.", "eng": "I know the exact spot where it happened."}, {"viet": "Tôi thích nấu nướng món ăn Tàu cho gia đình tôi.", "eng": "I like to cook Chinese dishes for my family."}, {"viet": "Lần tới tôi sẽ xử sự khá hơn.", "eng": "I'll do better next time."}, {"viet": "Tao đấm mày vào mắt bây giờ!", "eng": "I'll smash you in the eye!"}, {"viet": "Tôi làm việc ở trụ sở chính.", "eng": "I'm at the head office."}, {"viet": "Tôi sắp đem cất xe ô tô.", "eng": "I'm just going to put the car away."}, {"viet": "Tôi xin lỗi vì đã đến trễ.", "eng": "I'm sorry I'm late."}, {"viet": "Ý tôi là đây là nơi anh chào đời phải không?", "eng": "I mean, is this where you were born?"}, {"viet": "Tôi phải nói là tôi không thích cái cung cách của anh ta.", "eng": "I must say I didn't like the cut of his jib."}, {"viet": "Tôi không bao giờ cho mượn sách, chẳng bao giờ đòi lại được.", "eng": "I never lend books, you never get them back."}, {"viet": "Tôi đã qua được môn toán nhưng hỏng môn tiếng Pháp.", "eng": "I passed in maths but failed in French."}, {"viet": "Tôi xếp bà ta vào hàng các nhà văn hay nhất của đất nước.", "eng": "I rank her among the country's best writers."}, {"viet": "Tôi xem đề nghị của anh đáng quan tâm.", "eng": "I regard your suggestion as worthy of consideration."}, {"viet": "Tôi thấy chính Jane trong siêu thị mà.", "eng": "I saw Jane herself in the supermarket."}, {"viet": "Tôi sẽ nhận nhiệm vụ tìm ra xem ai chịu trách nhiệm.", "eng": "I shall make it my business to find out who is responsible."}, {"viet": "Tôi lục cả ngày trời trên gác mái để tìm những tấm ảnh cũ.", "eng": "I spent the day ferreting in the attic for old photographs."}, {"viet": "Tôi tắm vào ban đêm trước khi ngủ.", "eng": "I take a bath at night before bed."}, {"viet": "Tôi nghĩ nó chỉ có ấn bản bìa cứng thôi.", "eng": "I think it's only available in hard cover."}, {"viet": "Tôi nghĩ chắc là anh lầm đã nhìn thấy anh ấy ở nhà hát, tôi chắc anh ấy ở nước ngoài cả tuấn cơ mà.", "eng": "I think you must be mistaken about seeing him at the theatre, I'm sure he's been abroad all week."}, {"viet": "Tôi đã phòng xa khóa mọi thứ trong két.", "eng": "I took the precaution of locking everything in the safe."}, {"viet": "Trước đây tôi có thể trượt băng rất giỏi, nhưng nay đã không còn thành thạo nữa.", "eng": "I used to be able to skate quite well, but I've lost the knack."}, {"viet": "Tôi muốn chỗ rác này được dọn ngay tức khắc!", "eng": "I want this rubbish cleared away pronto!"}, {"viet": "Tôi muốn trở thành hoạ sĩ, nhưng hoàn cảnh đã quyết định khác đi.", "eng": "I wanted to be a painter, but circumstances decided otherwise."}, {"viet": "Đúng ra là ông ấy nên đến đây tự mình nhận lấy giải thưởng.", "eng": "I was fitting that he should be here to receive the prize in person."}, {"viet": "Tôi được thăng chức cách đây 2 năm.", "eng": "I was promoted two years ago."}, {"viet": "Tôi thật không may đã làm mất chùm chìa khóa.", "eng": "I was unfortunate enough to lose my keys."}, {"viet": "Tôi sẽ gắng hết sức để đến đúng giờ.", "eng": "I will make every effort to arrive on time."}, {"viet": "Tôi không muốn uống rượu gì cả, tôi chỉ uống cốc nước xôđa thôi.", "eng": "I won't have any wine, I'll just have a soda water."}, {"viet": "Có lẽ tôi sẽ làm lại đúng như vậy.", "eng": "I would do the same again."}, {"viet": "Tôi muốn ông gặp ông Lương.", "eng": "I would like you to meet Mr. Liang."}, {"viet": "Nếu a = b và b = c thì hệ quả là a = c.", "eng": "If a = b and b = c it follows that a = c."}, {"viet": "Nếu tôi có cơ hội để đi thì tôi sẽ chớp ngay.", "eng": "If I had the chance to go, I'd take it like a shot."}, {"viet": "Nếu quả bóng bay qua vạch, coi như nó ra ngoài.", "eng": "If the ball crosses the line it is out."}, {"viet": "Nếu chúng ta can thiệp thì hại nhiều hơn là lợi.", "eng": "If we interfere, it may do more harm than good."}, {"viet": "Nếu anh cứ tiếp tục xử sự như thế, anh sẽ bị mang tai mang tiếng.", "eng": "If you continue to behave in this way, you'll being discredit to yourself."}, {"viet": "Nếu anh cứ chà xát mãi, lớp sơn sẽ tróc ra.", "eng": "If you keep rubbing, the paint will come off."}, {"viet": "Nếu con muốn khoẻ mạnh thì bố sẽ cù cho con nhột.", "eng": "If you want to be healthy, I will tickle you."}, {"viet": "Trong cơn cuồng nộ của lòng căm thù, anh ta đã giết kẻ thù của mình.", "eng": "In a frenzy of hate, he killed his enemy."}, {"viet": "Thực ra, các trường hợp như ông rất bình thường đến độ chúng tôi gọi bệnh này là “ Turista ”.", "eng": "In fact, cases like your are so common that we call this disease turista."}, {"viet": "Trong tâm tưởng, tôi hãy còn có thể nhìn thấy ngôi nhà nơi tôi ra đời.", "eng": "In my mind's eye, I can still see the house where I was born."}, {"viet": "Trong quá trình ông ta khảo sát nước này.", "eng": "In the course of his explorations of the country."}, {"viet": "Những năm ngay sau chiến tranh.", "eng": "In the years immediately after the war."}, {"viet": "Những ảnh hưởng tác động đến sự phát triển tính cách của một đứa trẻ.", "eng": "Influences which affect the development of a child's personality."}, {"viet": "Sử dụng được một ngoại ngữ một cách tự nhiên thoải mái thì có khó không?", "eng": "Is it difficult to feel at home in a foreign language?"}, {"viet": "Có lúc nào phòng họp rảnh không?", "eng": "Is there a time when the conference room is free?"}, {"viet": "Có chỗ nào để chúng ta có thể nói chuyện riêng với nhau không?", "eng": "Isn't there anywhere we can talk privately?"}, {"viet": "Đó là một đề nghị rất dễ chấp nhận, tôi sẽ phải suy nghĩ nghiêm chỉnh.", "eng": "It's a very attractive offer, and I'll have to give it serious thought."}, {"viet": "Thật khó có thể kết bạn được với cô ta, cô ta lúc nào cũng gây gổ.", "eng": "It's difficult to make friends with her, she's constantly on the offensive."}, {"viet": "Nó chỉ là một lỗ sâu nhỏ mà ông đã bị lâu rồi.", "eng": "It's just a small one but you've had it for a long time."}, {"viet": "Đó không phải là điều gì đó chúng ta muốn nói tới.", "eng": "It's not something we want to have talked about."}, {"viet": "Phải mất ít nhất là ba ngày mới bình phục được.", "eng": "It's supposed to take at least three days to get over."}, {"viet": "Bây giờ đến lượt anh hát, vậy hãy trổ tài đi.", "eng": "It's your turn to sing now to do your stuff."}, {"viet": "Chuyện đó đã xảy ra vào ba trường hợp khác nhau.", "eng": "It happened on three separate occasions."}, {"viet": "Thật đáng khen, vì uy tín của mình mà anh đã trả lại tiền anh bắt được, tính thật thà của anh làm vẻ vang cho anh.", "eng": "It is greatly your credit that you gave back the money you found, your honesty does you credit."}, {"viet": "Bên tám lạng bên nửa cân.", "eng": "It is six of one and half a dozen of the other."}, {"viet": "Điều đó có nghĩa là không có ai ở trong đó cả?", "eng": "It means that no one is in there?"}, {"viet": "Nó ở cạnh cái bót đi giày.", "eng": "It's next to the shoehorn."}, {"viet": "Hình như là chúng ta sẽ không bao giờ biết tên sát nhân là ai.", "eng": "It seems that we'll never know the killer is."}, {"viet": "Thật là một điều hơi sỉ nhục khi cô ta từ chối gặp tôi.", "eng": "It was a bit of a slap in the face when she refused to see me."}, {"viet": "Anh thật hào phóng đã chia cho tôi thức ăn.", "eng": "It was generous of you to share your food with me."}, {"viet": "Chính là Susan đã chỉ cho chúng ta vấn đề.", "eng": "It was Susan who brought the problem to our notice."}, {"viet": "Từ chối lời mời của họ sẽ là không ý nhị.", "eng": "It would be bad taste to refuse their invitation."}, {"viet": "Tiếng Nhật khó ghê lắm, nhưng tôi nghĩ có thể học được.", "eng": "Japanese is awfully difficult, but I guess it's possible."}, {"viet": "Làm một cuộc hành trình xuyên qua Bắc Mỹ bằng đường bộ.", "eng": "Journeying overland across North America."}, {"viet": "Kiến thức đã được lưu truyền qua nhiều thế kỷ.", "eng": "Knowledge which has been passed down over the centuries."}, {"viet": "Chúng ta hãy bắt đầu với chỗ ngủ của nhân viên.", "eng": "Let's start with the men's sleeping quarters."}, {"viet": "Sau khi cô ta đã ra đi, cuộc sống dường như buồn tẻ, vô vị.", "eng": "Life seemed grey and pointless after she'd gone."}, {"viet": "Nhiều người đã bị bắn hoặc bắt giữ trong cuộc bỏ chạy tán loạn.", "eng": "Many men were shot or captured in the débâcle."}, {"viet": "Chấm các bài thi quả là một việc vất vả.", "eng": "Marking the exam papers was quite a slog."}, {"viet": "Cho phép chúng tôi được giới thiệu với ông các sản phẩm mới nhất của chúng tôi?", "eng": "May I introduce our latest products to you?"}, {"viet": "Những người đàn ông bị sắc đẹp và sự thông minh của các cô mê hoặc.", "eng": "Men are seduced by her beauty and wit."}, {"viet": "Hầu hết các chất tẩy tổng hợp đều dưới dạng bột hoặc lỏng.", "eng": "Most synthetic detergents are in the form of powder or liquid."}, {"viet": "Đơn xin của tôi đã bị ách tắc vì cuộc đình công của ngành bưu điện.", "eng": "My application was held up by the postal strike."}, {"viet": "Những câu nói đùa thiếu tế nhị của cha tôi bao giờ cũng làm tôi bối rối.", "eng": "My father's bad jokes always make me curl up."}, {"viet": "Đứa con gái nhỏ của tôi đến để tôi ôm.", "eng": "My little daughter came to me for a cuddle."}, {"viet": "Chị tôi dự định sẽ nướng một cái bánh cưới phết bơ và phủ đường lên.", "eng": "My sister is going to bake a wedding cake and ice it."}, {"viet": "Không một ai trong bọn họ biết về điều đó, vậy tất yếu là đã có ai đó tiết lộ bí mật.", "eng": "Neither of them knew about it, and the corollary of that is that someone else revealed the secret."}, {"viet": "Không, tôi không vội, vì vậy anh cứ lái chậm rãi và cẩn thận.", "eng": "No, I'm not, so please drive slowly and carefully."}, {"viet": "Không được đùa cợt em gái của con nữa, con có hiểu không?", "eng": "No more tricks on your sister, do you understand?"}, {"viet": "Bây giờ tôi đã biết rõ hối phiếu là gì rồi.", "eng": "Now I've got a clear idea of what the bill of exchange is."}, {"viet": "Tất nhiên, các ông sẽ chịu trách nhiệm cho bất cứ tổn thất nào do việc đóng gói không đúng cách.", "eng": "Of course, you will be responsible for any loss resulting from improper packing."}, {"viet": "Được, bố sẽ đi mua một ít ở chỗ người bán dạo bắp rang.", "eng": "OK, I'll get some from the popcorn vendor."}, {"viet": "Trước đây lâu lắm rồi, tôi đã từng là sinh viên ở đây.", "eng": "Once, in the dim and distant past, I was a student here."}, {"viet": "Một trong những điều kiện của công việc này là anh phải biết lái xe.", "eng": "One of the conditions of the job is that you should be able to drive."}, {"viet": "Việc kinh doanh của chúng tôi bó hẹp vào những giới hạn chật hẹp.", "eng": "Our business is confined within narrow limits."}, {"viet": "Phòng khách sạn của chúng ta ở đây nhìn ra biển.", "eng": "Our hotel room here looks out on the sea."}, {"viet": "Con trai tôi đái dầm cho đến năm mười một tuổi.", "eng": "Our son was a bed wetter till he was 11."}, {"viet": "Những hộp kẹo có thời hạn sử dụng khoảng một hay hai tháng.", "eng": "Packets of sweet with a shelf life of one or two months."}, {"viet": "Người ta đến để hỏi thăm sức khoẻ của đứa bé.", "eng": "People called to inquire after the baby."}, {"viet": "Kiến nghị chính phủ thay đổi luật nhập cư.", "eng": "Petition the government for a change in the immigration laws."}, {"viet": "Đầu độc tâm hồn thanh thiếu niên bằng tài liệu tuyên truyền xấu.", "eng": "Pollute the minds of the young with foul propaganda."}, {"viet": "Nỗi say mê cuồng nhiệt của Sandy vẫn là võ thuật.", "eng": "Sandy's consuming passion is still the martial arts."}, {"viet": "Sh và ea trong từ sheaf là những chữ ghép đọc thành một âm.", "eng": "Sh and ea in sheaf are digraphs."}, {"viet": "Đặc biệt cô ta là một người nội trợ khi cô ấy không dạy tiếng Anh.", "eng": "She's a house wife when she isn't teaching English, that is."}, {"viet": "Cô ấy đang bận học Hiến pháp Mỹ cho kỳ thi ngày mai.", "eng": "She's busy getting up the American constitution for tomorrow's exam."}, {"viet": "Cô ta vừa mới bắt đầu-cô sẽ phải mất một hoặc hai tuần để học cách làm việc.", "eng": "She's just started-it'll take her a week or two to learn the ropes."}, {"viet": "Cô ấy ngang bướng đến nỗi cô ta luôn làm ngược lại những gì anh yêu cầu.", "eng": "She's so cussed she always does the opposite of what you ask."}, {"viet": "Bà ấy tham gia tích cực vào hoạt động chính trị địa phương.", "eng": "She actively participates in local politics."}, {"viet": "Cô ấy cúi xuống để nhặt một cuốn sách ở dưới bàn.", "eng": "She bent down to pick up a book from the floor."}, {"viet": "Cô ấy đi lại hằng ngày từ Oxford đến London.", "eng": "She commutes from Oxford to London everyday."}, {"viet": "Cô ta trình bày cách tốt nhất để tự vệ.", "eng": "She demonstrated how best to defend oneself."}, {"viet": "Cô ấy lái xe về phía London.", "eng": "She drove off in the direction of London."}, {"viet": "Cô ta lừa lấy hết tiền của ông già.", "eng": "She fooled the old man out of all his money."}, {"viet": "Cô ta chán nản và bắt đầu buông trôi mọi thứ.", "eng": "She got depressed and began to let things slide."}, {"viet": "Cô ấy đem gắn viên ngọc xa-phia lên chiếc nhẫn vàng.", "eng": "She had the sapphire set in a gold ring."}, {"viet": "Cô ta làm ra được nhiều tiền do việc kinh doanh của cô và bây giờ thì gia đình cô cũng muốn dính vào việc đó.", "eng": "She has made a lot of money from her business and now her family want to get in on the act too."}, {"viet": "Cô ta gây ấn tượng tốt đẹp với chúng tôi với cách thức khiêm tốn và dễ gần.", "eng": "She impressed us with her modest and approachable manner."}, {"viet": "Người ta nói rằng bà ta vẫn sống khoẻ mạnh ở Nam Mỹ.", "eng": "She is reported to be alive and well and living in South America."}, {"viet": "Cô ấy tựa cái xe vào tường.", "eng": "She leant her bicycle against the wall."}, {"viet": "Cô ấy đã mất đi sự cân bằng thường có và đã giận dữ quát lên với anh ta.", "eng": "She lost her usually equilibrium and shouted at him angrily."}, {"viet": "Cô ta cần hoàn thiện tiếng A-rập của mình trước khi đi làm việc ở Cairo.", "eng": "She needs to perfect her Arabic before going to work in Cairo."}, {"viet": "Bà ấy đóng một vai trò tích cực trong hoạt động chính trị địa phương.", "eng": "She plays an active part in local politics."}, {"viet": "Cô ta nhận ra có khả năng sai lầm trong phương pháp đang được sử dụng.", "eng": "She recognized the potential for error in the method being used."}, {"viet": "Bà ấy là người sống cô độc suốt đời.", "eng": "She's been a loner all her life."}, {"viet": "Cô ta vẫn chỉ là một đứa trẻ.", "eng": "She's still only a youngster."}, {"viet": "Cô ấy dường như không quan tâm đến mối nguy hiểm đang lâm vào.", "eng": "She seemed quite unconcerned about the risks she was taking."}, {"viet": "Cô ấy lướt ra khỏi phòng khi không có ai nhìn.", "eng": "She slipped out of the room when nobody was looking."}, {"viet": "Cô ấy kéo sợi dây giữa hai cọc.", "eng": "She stretched the rope between the two poles."}, {"viet": "Cô ta tung quả bóng lên rồi lại bắt lấy.", "eng": "She threw the ball up and caught it again."}, {"viet": "Bà ta dùng lịch sử gia đình mình làm nền cho cuốn tiểu thuyết của bà.", "eng": "She used her family's history as a base for her novel."}, {"viet": "Cô ấy phật ý bởi cái cách những người trong uỷ ban phớt lờ những ý kiến của cô ấy.", "eng": "She was affronted by the way the men an the committee ignored her opinions."}, {"viet": "Cô ta bị sốc vì cái chết của anh ấy.", "eng": "She was devastated by his death."}, {"viet": "Cô ta bị choáng vì người bạn thân tín của cô ta phản bội.", "eng": "She was jolted by the betrayal of her trusted friend."}, {"viet": "Cô ta chịu trách nhiệm mua đồ dùng dựng cảnh cho phim truyền hình.", "eng": "She was responsible for buying the properties for the television screen."}, {"viet": "Cô ấy đang cố giữ bình tĩnh, nhưng vẫn có giận dữ rõ ràng trong giọng nói của cô ta.", "eng": "She was trying to remain calm, but there was a distinct edge to her voice."}, {"viet": "Cô ta học thẳng từ trường trung học lên đại học.", "eng": "She went straight from school to university."}, {"viet": "Cô ấy luyện tập chăm chỉ để dành một chỗ đứng trong đội dự giải Olympic.", "eng": "She worked hard for her place in the Olympic team."}, {"viet": "Mua sắm ở Ginza có thể là rất đắt.", "eng": "Shopping in Ginza can be extremely expensive."}, {"viet": "Bảng hiệu với ba quả cầu treo ngoài các cửa hiệu cầm đồ.", "eng": "Signs with three balls hang outside pawnbrokers'shops."}, {"viet": "Đội đó thắng sáu thua hai.", "eng": "Six wins and two defeats for the team."}, {"viet": "Hút thuốc lá là điều rất nguy hiểm cho sức khoẻ.", "eng": "Smoking is a serious health hazard."}, {"viet": "Vậy văn phòng mới của ông Kemp ở đâu?", "eng": "So where is Mr. Kemp's new office?"}, {"viet": "Sự thay đổi màu phần nào bề mặt sơn.", "eng": "Some discolouration of the paint work."}, {"viet": "Một số người cho rằng các công ty đa quốc gia có quá nhiều quyền lực.", "eng": "Some people believe that the multinationals have too much power."}, {"viet": "Chúng ta phải đến Glasgow bằng cách này hay cách khác.", "eng": "Somehow we must get to Glasgow."}, {"viet": "Bóp còi báo hiệu cho người chạy xe đạp.", "eng": "Sound the horn to alert a cyclist."}, {"viet": "Bị lớp trẻ chèn ép bật ra khỏi thị trường lao động.", "eng": "Squeezed out of the job market by younger men."}, {"viet": "Nói tóm lại, mục tiêu của chúng ta có thể đạt được.", "eng": "Still and all, our objective can be achieved."}, {"viet": "Những cây thông hình dáng lạ kỳ, những tảng đá kỳ dị, những biển mây và những suối nước nóng.", "eng": "Strangely-shaped pines, grotesque rocks, seas of cloud and hot springs."}, {"viet": "Thêm bộ trang phục như vậy vào tủ quần áo của tôi thì có lẽ hữu ích.", "eng": "Such an outfit would be a useful addition to my wardrobe."}, {"viet": "Ánh nắng mặt trời lung linh trên mặt hồ.", "eng": "Sunlight playing on the surface of the lake."}, {"viet": "Những sự khác biệt về cú pháp giữa tiếng Anh và tiếng Pháp.", "eng": "Syntactic differences between English and French."}, {"viet": "Tu một chai bia với những hơi dài.", "eng": "Taking long swigs at a bottle of beer."}, {"viet": "Nhìn xác trà trong tách của ai để đoán vận mạng cho người đó.", "eng": "Tell somebody's fortune from the tea-leaves in his cup."}, {"viet": "Cám ơn ông đã giúp đỡ, ông thật là người tốt bụng.", "eng": "Thanks for helping, you're a sweetie."}, {"viet": "Cuốn sách đó thật là dở.", "eng": "That book is a real loser."}, {"viet": "Cuộc phỏng vấn đó hoàn toàn là điều bôi nhọ một con người lương thiện.", "eng": "That interview was an absolute libel on a honest man."}, {"viet": "Tiếng ồn đó làm tôi điên cả đầu.", "eng": "That noise is sending me up the wall."}, {"viet": "Cửa hàng đó bán giá quá đắt đối với tôi.", "eng": "That shop is too dear for me."}, {"viet": "Chữ'b'trong'doubt'và chữ'w'trong'wrong'là câm.", "eng": "The'b'in'doubt'and the'w'in'wrong'are silent."}, {"viet": "Bị cáo đó được phóng thích sau khi nộp 1.000 bảng Anh tiền bảo lãnh trong thời gian chờ tòa xử.", "eng": "The accused was released on bail of £ 1,000 pending trial."}, {"viet": "Máy bay đó sẽ bay lần đầu tiên ngày mai.", "eng": "The aircraft makes its maiden flight tomorrow."}, {"viet": "Tình thế khác thường là đi thuê hai người làm nhưng lại có ít việc hơn để làm.", "eng": "The anomalous situation of hiring more hands but having less work done."}, {"viet": "Quân đội đã chiếm giữ thủ đô của quân địch.", "eng": "The army occupied the enemy's capital."}, {"viet": "Khán giả dễ dàng tràn khắp nhà hát nhỏ.", "eng": "The audience easily overflowed the small theatre."}, {"viet": "Đứa bé ném thức ăn của nó lên sàn nhà.", "eng": "The baby threw its food on the floor."}, {"viet": "Vụ cướp nhà băng đã được ghi lại trên băng viđêô.", "eng": "The bank robbery was recorded on video."}, {"viet": "Vẻ đẹp của phong cảnh vượt quá tất cả những điều mong đợi của tôi.", "eng": "The beauty of the scenery surpassed all my expectations."}, {"viet": "Những con chim mổ thủng một lỗ trên bao tải.", "eng": "The birds pecked a hole in the sack."}, {"viet": "Bolo không có ý nghĩa gì khác à?", "eng": "The bolo doesn't have any other meaning?"}, {"viet": "Thật khó phân định rạch ròi giữa ngôn ngữ thân mật và tiếng lóng.", "eng": "The borderline between informal language and slang is hard to define."}, {"viet": "Phanh kêu rít khi chiếc xe ôtô ngừng lại.", "eng": "The brakes screeched as the car stopped."}, {"viet": "Toà nhà được nâng thêm một tầng nữa.", "eng": "The building was heightened by another storey."}, {"viet": "Quán cà phê là chỗ để nhìn rõ cuộc đời đi qua.", "eng": "The cafe was a good vantage point for watching the world go by."}, {"viet": "Xe ôtô có bốn số tiến và một số lùi.", "eng": "The car has four forward gears and one reverse gear."}, {"viet": "Chiếc xe ngựa chạy qua cổng cung điện.", "eng": "The carriage passed through the palace gate."}, {"viet": "Thế kỉ đầy phát minh đã ảnh hưởng đến lối sống của chúng ta.", "eng": "The century has been full of inventions that have affected the way we live."}, {"viet": "Tấm séc sẽ được trả tiền mặt theo chứng minh căn cước.", "eng": "The cheque will be cashed on proof of identity."}, {"viet": "Đứa bé đi lầm đường và bị lạc.", "eng": "The child wandered off and got lost."}, {"viet": "Trẻ em đã đi chơi ở công viên.", "eng": "The children have gone to play in the park."}, {"viet": "Bọn trẻ con đang chơi trò làm lính.", "eng": "The children were playing at soldiers."}, {"viet": "Tràng vỗ tay được kéo dài mấy phút đồng hồ.", "eng": "The clapping was sustained for several minutes."}, {"viet": "Người lái xe chờ cho mọi người lên xe hết.", "eng": "The coach-driver waited until everybody was on."}, {"viet": "Viên sĩ quan chỉ huy đã kiến nghị trung sĩWilliams được tặng thưởng huy chương vì lòng dũng cảm.", "eng": "The commanding officer put Sergeant Williams in for a medal for bravery."}, {"viet": "Trật tự của công ti từ thư kí tới giám đốc điều hành.", "eng": "The company hierarchy went from secretary to managing director."}, {"viet": "Hình dạng bề mặt trái đất, bó dây thanh, hình thể thái dương hệ.", "eng": "The configuration of the earth's surface, the vocal tract, the solar system."}, {"viet": "Nồi cơm không dùng được vì bộ phận điện bị hỏng.", "eng": "The cooker isn't working because of an electrical fault."}, {"viet": "Sau cuộc đình công kéo dài đất nước này hầu như bị lụn bại.", "eng": "The country was almost brought to its knees by the long strike."}, {"viet": "Mức độ tội ác đang gia tăng đáng ngại.", "eng": "The crime rate is depressingly high."}, {"viet": "Chim cu cu đẻ trứng vào tổ các chim khác.", "eng": "The cuckoo lays its eggs in other birds'nests."}, {"viet": "Chiếc khung đen làm nổi bật sự sáng sủa của bức tranh.", "eng": "The dark frame accentuates the brightness of the picture."}, {"viet": "Những đại biểu phải được xếp chỗ ngồi đúng theo nghi thức.", "eng": "The delegates have to seated according to protocol."}, {"viet": "Biểu đồ đã được sao chép lại rất chính xác.", "eng": "The diagram had been copied with great precision."}, {"viet": "Các vụ sa thải đã dẫn đến một cuộc đình công.", "eng": "The dismissals led to a strike."}, {"viet": "Bác sĩ bảo ông ấy giảm ăn mỡ.", "eng": "The doctor told him to cut down his consumption of fat."}, {"viet": "Con chó tấn công tôi và cắn vào chân tôi.", "eng": "The dog turned on me and bit me on the leg."}, {"viet": "Người tài xế bóp còi cho tôi tránh đường.", "eng": "The driver honked his horn at me to get out of the way."}, {"viet": "Cuộc khủng hoảng kinh tế ngày càng trở nên trầm trọng.", "eng": "The economic crisis is getting worse and worse."}, {"viet": "Các nước thù địch trao đổi tù binh.", "eng": "The enemy countries exchanged prisoners."}, {"viet": "Những người tù xổng vẫn còn chưa bị bắt lại.", "eng": "The escaped prisoners are still at large."}, {"viet": "Việc đó đã để lại cho tôi một cảm giác đau đớn sâu sắc.", "eng": "The experience left me with a feeling of deep hurt."}, {"viet": "Sự hào nhoáng giả tạo của đời sống thành phố lớn.", "eng": "The false allure of big city life."}, {"viet": "Chiếc phà đã được sửa chữa lại thành tàu chở quân và nhập vào hạm đội.", "eng": "The ferry was refitted as a troop-ship and joined the fleet."}, {"viet": "Phim quá rời rạc đến nỗi mình không thể nào kể lại cho cậu nghe cốt truyện nói về cái gì.", "eng": "The film was so disjointed that I couldn't tell you what the story was about."}, {"viet": "Hãng trả phụ trội cho công việc tại những vùng ai cũng chê.", "eng": "The firm pays over the odds for working in unpopular areas."}, {"viet": "Năm kiểu kiến trúc bằng cột cổ Hy Lạp.", "eng": "The five classical orders of architecture."}, {"viet": "Dấu chân thật rõ mồn một, chắc chúng còn mới.", "eng": "The footprints are quite distinct, they must be fresh."}, {"viet": "Quả ở dưới đáy hộp bị giập.", "eng": "The fruits at the bottom of the box had been squashed."}, {"viet": "Đơn vị đồn trú giữ vững trước sức tấn công của địch.", "eng": "The garrison held out against the enemy attack."}, {"viet": "Sự hấp dẫn bề ngoài của ngành công nghiệp giải trí.", "eng": "The glitter of a show-business career."}, {"viet": "Chính phủ không thể ngăn chặn làn sóng phẫn nộ của dân chúng.", "eng": "The government are unable to stem the tide of popular indignation."}, {"viet": "Chính quyền đang cố gắng tạo công ăn việc làm mới.", "eng": "The government is trying to create new jobs."}, {"viet": "Sau một đoạn tụt thẳng đứng xuống, đồ thị dần dần trở lại theo chiều ngang.", "eng": "The graph flattens out gradually after a steep fall."}, {"viet": "Nhân viên gác đường ray phất cờ và đoàn tàu rời sân ga.", "eng": "The guard waved his flag and the train left the station."}, {"viet": "Họ có các cuộc bầu cử nhưng không có sự lựa chọn.", "eng": "The have elections, but there are no choices to be made."}, {"viet": "Vào buổi tối đường phố chính sáng rực ánh đèn.", "eng": "The high street is a blaze of lights in the evening."}, {"viet": "Những con tin đã thoát cơn hoạn nạn của mình không hề hấn gì.", "eng": "The hostages emerged from their ordeal unscathed."}, {"viet": "Ngôi nhà rất là đổ nát nhưng vẫn có thể dùng được.", "eng": "The house is very dilapidate but it has possibilities."}, {"viet": "Cái ý nghĩ đọc một bài diễn văn trước công chúng đã làm anh ta sững sờ.", "eng": "The idea of making a speech in public petrified him."}, {"viet": "Sự đưa gián điệp của mình xâm nhập vào một tổ chức.", "eng": "The infiltration of an organization with one's agents."}, {"viet": "Phần giới thiệu giải thích cách bố cục các chương.", "eng": "The introduction explains how the chapters are organized."}, {"viet": "Cô ký giả đem nộp bản thảo.", "eng": "The journalist has handed in her copy."}, {"viet": "Bọn bắt cóc đòi một món tiền chuộc khổng lồ.", "eng": "The kidnappers demanded an enormous ransom."}, {"viet": "Cậu bé gầy gò là cầu thủ bóng rổ cừ.", "eng": "The lanky lad was a good basket ball player."}, {"viet": "Vị lãnh tụ đã tuyên dương những người đã hy sinh cho đất nước.", "eng": "The leader spoke in praise of those who had died for their country."}, {"viet": "Thang máy bị hỏng cho nên chúng tôi đã bị kẹt trong đó.", "eng": "The lift broke down and we were trapped inside it."}, {"viet": "Cuộc leo núi lâu dài đã thử thách sức chịu đựng của chúng tôi.", "eng": "The long climb tested our powers of endurance."}, {"viet": "Một tạp chí do một người điều khiển điều hành, không có hội nghị ban biên tập và mỗi quyết định cuối cùng đều từ... người lãnh đạo bí mật của chúng tôi.", "eng": "The magazine has been a one man show, with no editorial conferences and with every ultimate dicision coming from our... secretive leader."}, {"viet": "Vị giám đốc đó ra chỉ thị cho những nhân viên thuộc quyền.", "eng": "The manager gave the men their instructions."}, {"viet": "Viên thị trưởng và những cộng sự mang tai mang tiếng của ông ta.", "eng": "The mayor and his disreputable cohorts."}, {"viet": "Kỉ niệm còn để lại một dư vị chua chát.", "eng": "The memory would take on a sour aftertaste."}, {"viet": "Ông bộ trưởng bị chất vấn về những kế hoạch của ông ta về ngành công nghiệp.", "eng": "The minister was queried about his plans for the industry."}, {"viet": "Mặt trăng ló ra từ sau những đám mây.", "eng": "The moon peeped out from behind the clouds."}, {"viet": "Tiếng tàu đi ru tôi ngủ.", "eng": "The movement of the train lulled me to sleep."}, {"viet": "Nhu cầu về thời gian thảnh thơi cho cá nhân là điều bức thiết không sao tránh được.", "eng": "The need for personal space inevitably asserts itself."}, {"viet": "Luật mới tác dụng có lợi cho chúng ta.", "eng": "The new law operates to our advantage."}, {"viet": "Những biểu thuế mới đã bóp nghẹt mậu dịch.", "eng": "The new tariffs have put a stranglehold on trade."}, {"viet": "Chuyến máy bay đi tới New York sẽ khởi hành trong vòng 20 phút nữa.", "eng": "The next plane to New York departs in 20 minutes."}, {"viet": "Một số trường hợp không được báo cáo đầy đủ.", "eng": "The number of cases has been underreported."}, {"viet": "Sĩ quan ra lệnh cho binh lính tấn công.", "eng": "The officer ordered the soldiers to attack."}, {"viet": "Bà cụ già buông một tiếng cười khằng khặc lớn.", "eng": "The old woman gave a loud cackle."}, {"viet": "Những cư dân bản xứ vẫn còn dùng lá chuối thay vì dùng đĩa.", "eng": "The original inhabitants still a Southeast Asian atmosphere."}, {"viet": "Con nhà giàu được nuông chiều.", "eng": "The pampered children of the rich."}, {"viet": "Con đường mòn mất hút trong rừng sâu.", "eng": "The path petered out deep in the forest."}, {"viet": "Người ta đã quây quanh các vị khách hoàng gia.", "eng": "The people pressed round the royal visitors."}, {"viet": "Sự lấy và giao nông sản.", "eng": "The pick-up and delivery of farm produce."}, {"viet": "Kế hoạch đó không phải đem lại sự phồn vinh mà trái lại là sự tàn phá.", "eng": "The plan caused not prosperity but ruin."}, {"viet": "Đêm diễn đầu tiên của vở kịch đó là một thất bại hoàn toàn.", "eng": "The play's first night was a disaster."}, {"viet": "Học thuyết độc hại về sự ưu việt của chủng tộc.", "eng": "The poisonous doctrine of racial superiority."}, {"viet": "Cảnh sát vừa phát hiện ra chiếc xe đào tẩu.", "eng": "The police have just found the escape vehicle."}, {"viet": "Viên cảnh sát né tránh tất cả những câu hỏi hóc búa.", "eng": "The policeman evaded all the difficult questions."}, {"viet": "Thư từ tới đều đặn lúc tám giờ mỗi sáng.", "eng": "The post arrives regularly at eight every morning."}, {"viet": "Vị cố vấn kinh tế của tổng thống.", "eng": "The president's consultant on economic affairs."}, {"viet": "Giá toàn bộ là 25 bảng Anh.", "eng": "The price is £ 25 full board."}, {"viet": "Tên tù khẩn nài viên chánh án để khoan hồng.", "eng": "The prisoner besought the judge to be merciful."}, {"viet": "Lợi nhuận sẽ được chia cho các nhà đầu tư.", "eng": "The profits will be dealt out among the investors."}, {"viet": "Nhà phân tâm học đó chuyên về việc đặt những câu hỏi gài bẫy.", "eng": "The psychoanalyst specialized in asking loaded questions."}, {"viet": "Sự hiện diện của Nữ hoàng sẽ là vinh dự cho chúng tôi.", "eng": "The Queen is gracing us with her presence."}, {"viet": "Những người dân bình thường thấy không hài lòng.", "eng": "The rank-and-file are getting discontented."}, {"viet": "Người trọng tài cuối cùng đã tới, trận đấu bắt đầu.", "eng": "The referee having finally arrived, the game began."}, {"viet": "Những người cứu hộ đã mang những người trèo núi về bình an vô sự.", "eng": "The rescuers brought the climbers back safe and sound."}, {"viet": "Người chú giàu có mà anh ta khoe khoang chỉ là chuyện tưởng tượng.", "eng": "The rich uncle of whom he boasts is great a myth."}, {"viet": "Con đường lại chạy thẳng sau một loạt khúc cong.", "eng": "The road straightens after a series of bends."}, {"viet": "Nguồn gốc của vấn đề là sự thiếu tin cậy.", "eng": "The root of the problem is lack of trust."}, {"viet": "Chân nữ thuỷ thủ mắc vào dây thừng.", "eng": "The sailors legs got entangled with the ropes."}, {"viet": "Đứa học trò nhăn mặt làm trò ở sau lưng thầy giáo.", "eng": "The school boy make a face at his teacher's back."}, {"viet": "Ngài ngoại trưởng hiện nay đang cứu xét lời đề xuất.", "eng": "The secretary of state is presently considering the proposal."}, {"viet": "Tiếng kêu chói tai nhức óc của con quạ.", "eng": "The sharp raucous cawing of a crow."}, {"viet": "Con tàu đắm ở bờ biển Kent.", "eng": "The ship was wrecked on the Kent coast."}, {"viet": "Cảnh tượng có quá nhiều đứa trẻ đói ăn làm cho anh ta ghê sợ.", "eng": "The sight of so many starving children made his gorge rise."}, {"viet": "Những người nô lệ phủ phục dưới chân chủ họ.", "eng": "The slaves prostrated themselves at their master's feet."}, {"viet": "Quân lính đóng trại trong rừng.", "eng": "The soldiers are encamped in the forest."}, {"viet": "Thái độ hồ hởi của người nói đã làm cho một cuộc hội nghị buồn chán sinh động hẳn lên.", "eng": "The speaker's exuberance enlivened a boring conference."}, {"viet": "Cầu thang xoắn trôn ốc đi lên quanh một cây trụ ở giữa.", "eng": "The staircase winds upwards round a central pillar."}, {"viet": "Cơn bão tiếp tục với độ mãnh liệt không giảm.", "eng": "The storm continued with unabated violence."}, {"viet": "Các sinh viên theo dõi khi nhà phẫu thuật tiến hành ca mổ.", "eng": "The students watched as the surgeon performed the operation."}, {"viet": "Mặt chất lỏng dần dần đặc lại.", "eng": "The surface of the liquid gradually crusted over."}, {"viet": "Thầy giáo làm một sự so sánh giữa quả tim người và cái bơm.", "eng": "The teacher drew an analogy between the human heart and a pump."}, {"viet": "Điện thoại lại hoàn toàn dùng được rồi.", "eng": "The telephone is fully operational again."}, {"viet": "Tên trộm đã quyết định làm lại cuộc đời sau khi được phóng thích.", "eng": "The thief was determined to turn over a new leaf once he was released from prison."}, {"viet": "Toa lét không xối được nước, tôi đã thử nhiều lần nhưng không ăn thua.", "eng": "The toilet won't flush, I've tried flushing it several times, but it won't work."}, {"viet": "Đoàn tàu ở sân ga số 3 đi London, đỗ ở Didcot và Reading.", "eng": "The train on platform 3 is for London, calling at Didcot and Reading."}, {"viet": "Tàu chở lính được hộ tống vượt qua đại tây dương.", "eng": "The troopships were convoyed across the Atlantic."}, {"viet": "Hai phòng nối nhau bởi một hành lang.", "eng": "The two rooms connect by a corridor."}, {"viet": "Mùi khó chịu của pho mát thối nẫu.", "eng": "The unpleasant odour of over-ripe cheese."}, {"viet": "Quan điểm cho rằng quả đất bẹt là không còn có thể đứng vững được nữa.", "eng": "The view that the earth is flat is no longer tenable."}, {"viet": "Bát đĩa phải rửa đã được bỏ vào trong chậu rửa bát.", "eng": "The washing-up had been left in the sink."}, {"viet": "Những bức tường trắng tương phản với tấm thảm đen.", "eng": "The white walls make a contrast with the black carpet."}, {"viet": "Rượu vào làm tôi lắm lời, thích tranh cãi và cãi lộn.", "eng": "The wine rendered me loquacious, disputatious and quarrelsome."}, {"viet": "Công nhân trong nhà máy được trả lương theo giờ còn nhân viên văn phòng được trả lương tháng.", "eng": "The workers in the factory are paid by the hour and the clerical staff are paid a monthly salary."}, {"viet": "Viên bác sĩ thú y gây mê con voi bằng mũi tên có tẩm thuốc.", "eng": "The zoo veterinary surgeon tranquillized the elephant with a drugged dart."}, {"viet": "Tuy nhiên, vua hay nữ hoàng của họ không nắm quyền lực thực tế.", "eng": "Their kings or queens, however, have no real power."}, {"viet": "Vậy thì tôi phải nhanh lên thôi, nếu không tôi sẽ bị trễ họp.", "eng": "Then, I must hurry, or i'll be late for the meeting."}, {"viet": "Có tin đồn lan đi rằng ông chủ đã từ chức.", "eng": "There's a buzz going round that the boss has resigned."}, {"viet": "Có hành vi gian lận với kế toán của câu lạc bộ và một số tiền đã bị mất.", "eng": "There's been some dirty work with the club accounts, and some money is missing."}, {"viet": "Có một sự nghi ngờ nào đó về việc anh ta có thích hợp với công việc này không.", "eng": "There's some doubt about his suitability for the job."}, {"viet": "Có nhiều bộ lạc khác nhau với những tập quán, ngôn ngữ, và tôn giáo khác nhau.", "eng": "There are many different tribes with different customs, languages, and religions."}, {"viet": "Có những người nói rằng bà ta sẽ không bao giờ được bổ nhiệm.", "eng": "There are those who say she should never have been appointed."}, {"viet": "Năm nay đã có ba trường hợp bị đuổi ra khỏi trường.", "eng": "There have been three expulsions from the school this year."}, {"viet": "Có một sự khác nhau về thể giữa'Nó đã đi qua đường'và'Nó đang đi qua đường'.", "eng": "There is an aspectual difference between'He crossed the road'and'He was crossing the road'."}, {"viet": "Đôi giày này còn dùng được lâu.", "eng": "There is still much wear in these shoes."}, {"viet": "Có tình trạng lộn xộn về chỗ ăn chỗ ở trong khách sạn của chúng tôi.", "eng": "There was a muddle over our hotel accommodation."}, {"viet": "Hãy còn chút bất ổn rơi rớt lại sau vụ nổi loạn bị dẹp tan.", "eng": "There was still some residual unrest after the rebellion had been crushed."}, {"viet": "Chúng tôi sẽ không tính tiền bữa ăn này.", "eng": "There will be no charge for the meal."}, {"viet": "Bốn giai đoạn ấy là: trứng, ấu trùng, nhộng và bướm trưởng thành.", "eng": "These four stages are egg, larva, pupa, and adult."}, {"viet": "Chẳng bao lâu những đóng góp nhỏ đó cộng lại sẽ thành một con số lớn.", "eng": "These small contributions soon count up to a sizeable amount."}, {"viet": "Họ nhờ tôi biên tập một trong những lần xuất bản mới của kịch Shakespear.", "eng": "They've asked me to edit the of the volumes in their new series of Shakespeare plays."}, {"viet": "Chúng được tổ chức đẹp đẽ và cho những người đi cắm trại những ý tưởng đặc biệt.", "eng": "They are beautifully organized and give particular thought to campers."}, {"viet": "Chúng bắt đầu phát triển và nhân lên rất nhanh.", "eng": "They begin to grow and multiply very fast."}, {"viet": "Họ đã chẳng thể thoát được nếu các lính gác không làm ngơ.", "eng": "They could not have escaped without the connivance of the guards."}, {"viet": "Chúng dụ dỗ anh ta tham gia vào âm mưu.", "eng": "They enticed him into joining the conspiracy."}, {"viet": "Họ phải lựa chọn giữa chết đói và đầu hàng.", "eng": "They had to decide between starvation and surrender."}, {"viet": "Họ hôn nhau say đắm khi cô ta đến.", "eng": "They kissed passionately when she arrived."}, {"viet": "Họ có thể làm công việc ấy nếu anh đưa ra tiền thưởng để nhử trước mặt họ.", "eng": "They might do the job if you dangle a bonus in front of them."}, {"viet": "Họ giải thích sai lạc sự từ chối của chúng tôi.", "eng": "They put a bad construction on our refusal."}, {"viet": "Họ dọn món thịt gà làm món ăn chính.", "eng": "They served chickens as the main course."}, {"viet": "Họ tìm cách thuyết phục cô ta khai man trước toà.", "eng": "They tried to persuade her to commit perjury."}, {"viet": "Họ buộc phải ký hợp đồng.", "eng": "They were coerced into signing the contract."}, {"viet": "Họ sẽ yêu cầu ông cho họ xem đấy.", "eng": "They will ask you to show it to them."}, {"viet": "Bài báo này quá nhiều biệt ngữ quả là khó hiểu đối với tôi.", "eng": "This article's so full of jargon it's just double Dutch to me."}, {"viet": "Hợp đồng này đảm bảo rằng công ty sẽ được lợi nhuận trong tháng này.", "eng": "This contract assures the company's profit this month."}, {"viet": "Cuộc khủng hoảng tài chính này đã thúc đẩy các nhân tố mới.", "eng": "This financial crisis has brought new factors into play."}, {"viet": "Đây không phải là lúc để mua quần áo mới.", "eng": "This is hardly the time for buying new clothes."}, {"viet": "Công việc này phải được thực hiện một cách nghiêm chỉnh-Tôi không muốn những biện pháp nửa vời.", "eng": "This job must be done properly-I want no half measures."}, {"viet": "Truyện này đã được chuyển thể từ nguyên bản tiếng Nga để dùng cho truyền thanh.", "eng": "This novel has been adapted for radio from the Russian original."}, {"viet": "Công thức này đủ dùng cho bốn suất ăn.", "eng": "This recipe will be enough for four servings."}, {"viet": "Món tiền này sẽ phải được chia cho sáu đứa bé đó.", "eng": "This sum of money is to be apportioned among the six boys."}, {"viet": "Những đứa bé đó đã được thả lỏng chạy nhảy lung tung.", "eng": "Those boys have been allowed to run wild."}, {"viet": "Cuộc tấn công ngày hôm nay đã làm hại nghiêm trọng đến những cố gắng để có được hoà bình trong khu vực.", "eng": "Today's attack has seriously impaired attempts to achieve peace in the area."}, {"viet": "Giao thông trong thành phố hoàn toàn tắc nghẽn.", "eng": "Traffic in the city is at a complete standstill."}, {"viet": "Có thể trông thấy rõ ràng các bộ phận cơ thể của nó.", "eng": "Various parts of his anatomy were clearly visible."}, {"viet": "Nước rỉ qua các kẽ nứt ở tường.", "eng": "Water seeps through cracks in the wall."}, {"viet": "Chúng ta sẽ dàn xếp mọi khó khăn khi nào đến chỗ họ.", "eng": "We'll smooth away any difficulties when we reach them."}, {"viet": "Chúng tôi chào hỏi những người láng giềng mới.", "eng": "We're on speaking terms with the new neighbours."}, {"viet": "Chúng tôi phải chở năm người với tất cả hành lí của họ trong xe.", "eng": "We've got to get five people plus all their luggage in the car."}, {"viet": "Chúng tôi cũng có cái này màu đỏ nhưng gót thấp hơn.", "eng": "We also have this in red but the heel is shorter."}, {"viet": "Chúng tôi xin lỗi về sự phiền phức này.", "eng": "We are sorry for the inconvenience."}, {"viet": "Ta không thể ép nó và đừng cố ép.", "eng": "We can't force him and we shouldn't try to."}, {"viet": "Chắc chắn là chúng ta đã gặp may về thời tiết.", "eng": "We certainly struck lucky with the weather."}, {"viet": "Chúng tôi không có tin tức đó.", "eng": "We do not have that information."}, {"viet": "Chúng tôi thấy mình đối lập với nhiều đồng nghiệp trong vấn đề này.", "eng": "We found ourselves in opposition to several colleagues on this issue."}, {"viet": "Chúng tôi phá giảm giá ( đồng tiền ) của chúng tôi năm ngoái.", "eng": "We had to devalue ( our currency ) last year."}, {"viet": "Từ lâu chúng tôi đã ủng hộ các mục đích của Đảng Xanh.", "eng": "We have long sympathized with the aims of the Green Party."}, {"viet": "Chúng tôi bay đi Mĩ có công việc quan trọng rồi quay lại Luân Đôn.", "eng": "We hopped across to America on important business and then back to London."}, {"viet": "Chúng tôi xem ngôi nhà ở bên trong và bên ngoài.", "eng": "We looked at the house from within and without."}, {"viet": "Chúng ta phải hi vọng ngày mai thời tiết đẹp để chúng ta đi picnic.", "eng": "We must just keep our fingers crossed that the weather will stay fine for our picnic tomorrow."}, {"viet": "Chúng tôi mời anh ta lên xe quá giang, nhưng anh ta không nhận lời.", "eng": "We offered him a lift, but he didn't accept."}, {"viet": "Chúng tôi coi hành động của anh là một tội ác.", "eng": "We regard your action as a crime."}, {"viet": "Chúng tôi đã đóng tất cả các cửa trước khi đi nghỉ.", "eng": "We shut up the house before going on holiday."}, {"viet": "Trước đây tụi anh thường tập đồng diễn theo tiếng nhạc để biểu diễn.", "eng": "We used to practice synchronizing to the music for our performance."}, {"viet": "Chúng tôi đã bị lừa gạt là nó có thể giúp được chúng tôi.", "eng": "We were deceived into believing that he could help us."}, {"viet": "Chúng ta sẽ đi nếu đẹp trời, nếu không thì ở nhà.", "eng": "We will go out if it is clear, If not, we remain home."}, {"viet": "Các cậu này, chiều nay chúng mình đi chơi đi?", "eng": "Well, folks, shall we go out this afternoon?"}, {"viet": "Á, cách nhanh nhất, tôi nghĩ, là bằng điện chuyển tiền từ ngân hàng của ông ở Luôn Đôn đến chúng tôi.", "eng": "Well, the fastest way, I think, is by telegraphic transfer from your bank in London to us."}, {"viet": "Tên bệnh viên mà bà ấy đang nằm là gì?", "eng": "What's the name of the hospital where she's staying?"}, {"viet": "Những lí lẽ ủng hộ và phản đối của việc có điện thoại di động là gì?", "eng": "What are the pros and cons of having a cell phone?"}, {"viet": "Ông có gì trong thùng chứa đó?", "eng": "What do you have in that container?"}, {"viet": "Rượu tôi muốn uống là Triều Đại, chứ không phải Trường Thành.", "eng": "What I want is Dynasty, not Great Wall."}, {"viet": "Ý nghĩa của biểu tượng này là gì?", "eng": "What is the significance of this symbol?"}, {"viet": "Ông sẽ đổi loại tiền nào?", "eng": "What money are you going to change?"}, {"viet": "Buổi sáng bạn thức dậy lúc mấy giờ?", "eng": "What time do you get up in the morning?"}, {"viet": "Tôi có thể xem căn nhà lúc nào?", "eng": "When can I see the house?"}, {"viet": "Khi tôi nhận được văn bằng luật tôi sẽ bắt đầu công việc ở thành phố quê hương cũ của tôi.", "eng": "When I get my law degree I'm going to hang out my shingle in my old hometown."}, {"viet": "Khi tai nạn xảy ra, đám đông thường thấy đã tụ tập lại.", "eng": "When the accident happened, the usual crowd gathered."}, {"viet": "Khi chúng ta nói về số ngày trong một năm, chúng ta dùng ngày với nghĩa 24 giờ.", "eng": "When we talk about the number of days in the year we are using day to mean 24 hours."}, {"viet": "Tôi có thể nhận lại hành lý của tôi ở đâu?", "eng": "Where do I claim my baggage?"}, {"viet": "Bạn thích thức ăn nào hơn, thức ăn Nhật hay thức ăn Ý?", "eng": "Which do you prefer, Japanese or Italian food?"}, {"viet": "Trong khi ông chủ tịch đang nói thì hai thành viên của uỷ ban sôi nổi chuyện riêng với nhau ở cuối bàn.", "eng": "While the chairman was speaking, two committee members were engaged in heated byplay at the end of the table."}, {"viet": "Ai ngủ muộn sáng nay nào?', cô ta châm biếm.", "eng": "Who overslept this morning?'she quipped."}, {"viet": "Tại sao anh không kiếm lấy một căn hộ riêng?", "eng": "Why don't you get a flat of your own?"}, {"viet": "Liệu nhà máy điện mới có thể đáp ứng được các yêu cầu về năng lượng giá rẻ của chúng ta không?", "eng": "Will the new power-station be able to supply our cheap energy requirements?"}, {"viet": "Vui lòng nói lại tên bạn lần nữa?", "eng": "Will you tell me your name again?"}, {"viet": "Với việc ông chủ tịch mới nhậm chức, công ty bắt đầu thịnh vượng.", "eng": "With the advent of the new chairman, the company began to prosper."}, {"viet": "Yêu cầu ông đóng góp phải chăng là tôi quá táo bạo?", "eng": "Would it be presumptuous of me to ask you to contribute?"}, {"viet": "Ông có muốn nghe về kế hoạch làm việc mà chúng tôi sắp xếp đã sắp xếp cho ông không ạ?", "eng": "Would you like to hear about the schedule we have arranged for you?"}, {"viet": "Cô có thích nghe nhạc cổ điển không?", "eng": "Would you rather go to hear classical music?"}, {"viet": "Có rồi, tôi được cho nhiều thuốc lắm, nhiều đến nỗi tôi không biết phải uống thế nào nữa.", "eng": "Yes, i've been given so much, that I simply don't know what to do with it at all."}, {"viet": "Trận tuyết lở hôm qua đã làm chết một toán trượt tuyết và phá huỷ nhiều cây cối.", "eng": "Yesterday's avalanche killed a party of skiers and destroyed several trees."}, {"viet": "Cô sẽ làm tổn thương tình cảm của anh ấy nếu cô quên ngày sinh nhật của anh ấy.", "eng": "You'll hurt his feelings if you forget his birthday."}, {"viet": "Anh rất may đã sống sót sau tai nạn đó.", "eng": "You're very lucky to be alive after that accident."}, {"viet": "Anh có thể lấy bất cứ cuốn sách nào trong tủ sách của tôi.", "eng": "You are welcome to any book in my library."}, {"viet": "Anh có thể luôn luôn tin cậy ở Angela-cô ấy không bao giờ làm bạn bè thất vọng đâu.", "eng": "You can always rely on Angela she'd never let the side down."}, {"viet": "Anh có thể mang hành lí xách tay lên máy bay.", "eng": "You can take your hand luggage with you on the plane."}, {"viet": "Anh không muốn nói chuyện về chúng tôi.", "eng": "You don't want to talk about us."}, {"viet": "Anh không làm công việc một cách đúng đắn-anh sẽ phải làm lại.", "eng": "You haven't done the job properly-You'll have to do it again."}, {"viet": "Ý anh là tôi nên uống một ít trà Ô Long, phải vậy không?", "eng": "You mean I should drink some oolong, don't you?"}, {"viet": "Anh phải trình vé ở chỗ chắn trước khi anh có thể lên tàu.", "eng": "You must show your ticket at the barrier before you can get on the train."}, {"viet": "Anh biết không, tôi chỉ mới đến đây vài ngày thôi.", "eng": "You see, I've been here just a few days."}, {"viet": "Bạn đừng quá hấp tấp trong việc quyết định lập gia đình.", "eng": "You shouldn't be too hasty in deciding to get married."}, {"viet": "Anh sẽ khó có thể thanh minh được tại sao anh lại dùng những lời lẽ xúc phạm như thế.", "eng": "You will find it difficult to explain away your use of such offensive language."}, {"viet": "Ô tô của anh có thể bị hư hại nếu để đây không có người trông nom.", "eng": "Your car may get damaged her if you leave it unattended."}, {"viet": "Ông đã đặt một phòng đơn trong ba ngày.", "eng": "Your reservation is for a single room for three days."}]