[{"viet": "Một cuốn sách mô tả quá trình suy thoái của đế quốc La Mã.", "eng": "A book which traces the decline of the Roman empire."}, {"viet": "Một du khách người Trung Quốc bước vào một cửa hàng miễn thuế.", "eng": "A Chinese tourist enters a duty-free shop."}, {"viet": "Một bến đậu tiện lợi trong một cái vịnh khuất gần đây.", "eng": "A convenient landing-place in a nearby sheltered cove."}, {"viet": "Một thất bại gây thảm họa cho đất nước.", "eng": "A defeat that was disastrous to the country."}, {"viet": "Một cái áo đầm có đường xẻ bên hông khêu gợi.", "eng": "A dress with a provocative slit at the side."}, {"viet": "Một cuốn phim với lời đối thoại dí dỏm và tài trí.", "eng": "A film with witty and intelligent dialogue."}, {"viet": "Một làn gió nhẹ làm rung rinh những chiếc lá.", "eng": "A gentle breeze stirred the leaves."}, {"viet": "Một nhóm trong chúng tôi sẽ đến Luân Đôn dự ngày lễ đó.", "eng": "A group of us are going up to London for the day."}, {"viet": "Ngày nghỉ không hẳn có nghĩa là chẳng làm gì.", "eng": "A holiday need not mean inactivity."}, {"viet": "Một phương pháp thiếu năng động cho sự học tập của nó.", "eng": "A lackadaisical approach to his studies."}, {"viet": "Một ngọn hải đăng chớp sáng ở đằng xa.", "eng": "A lighthouse was flashing in the distance."}, {"viet": "Một nhân vật quan trọng trên vũ đài quốc tế.", "eng": "A major figure on the international stage."}, {"viet": "Ảo ảnh là một ảo giác.", "eng": "A mirage is an optical illusion."}, {"viet": "Một phát minh mới sẽ có những ứng dụng khác nhau trong công nghiệp.", "eng": "A new invention that will have a variety of applications in industry."}, {"viet": "Một nhóm chuyên gia truyền hình nổi tiếng.", "eng": "A panel of well-known television pundits."}, {"viet": "Một bức ảnh có ghi lời chú thích Thủ tướng đang trong kì nghỉ.", "eng": "A picture Caption the President relaxing on holiday."}, {"viet": "Người có thế lực là người có thể tập hợp được một số ân huệ từ một nhóm người có quyền lực rồi dùng mớ ân huệ đó để giao dịch làm ăn.", "eng": "A power broker is someone who can assemble a number of favors due from a coterie of powerful people and then use that agglomeration of favors to work a deal."}, {"viet": "Một nơi nghỉ mát êm tịnh, hẻo lánh.", "eng": "A quiet, out-of-the-way resort."}, {"viet": "Một sự tăng nhiệt độ trung bình.", "eng": "A rise in the average temperature."}, {"viet": "Lần đếm phiếu thứ hai trong một cuộc bầu cử.", "eng": "A second count of the votes in an election."}, {"viet": "Một hoa đơn chỉ có một bộ cánh hoa.", "eng": "A single flower has only one set of petals."}, {"viet": "Khoảng thời gian hai tuần giữa các cuộc hẹn.", "eng": "A space of two weeks between appointments."}, {"viet": "Một dải băng có thể dài 144 bộ.", "eng": "A strip might be as long as 144 feed."}, {"viet": "Một ngôi đền đẽo từ khối đá.", "eng": "A temple chiselled out of solid rock."}, {"viet": "Một bản tóm tắt dài hai trang về một báo cáo của chính phủ.", "eng": "A two-page summary of a government report."}, {"viet": "Một chiếc khăn trải bàn màu trắng sọc đỏ.", "eng": "A white table-cloth with red stripes."}, {"viet": "Chấp nhận hoàn toàn trách nhiệm về những hậu quả.", "eng": "Accept full responsibility for the consequences."}, {"viet": "Làm phép xức dầu cho một người hấp hối.", "eng": "Administer the last rites to a dying man."}, {"viet": "Sau bữa cơm tối tất cả chúng ta dời sang phòng nghỉ.", "eng": "After dinner we all adjourned to the lounge."}, {"viet": "Sau khi bị lu mờ một thời gian, giờ cô ta nổi tiếng trở lại.", "eng": "After suffering an eclipse, she is now famous again."}, {"viet": "Các hợp tác xã nông nghiệp ở Ấn Độ và Trung Quốc.", "eng": "Agricultural co-operatives in India and China."}, {"viet": "Toàn bộ đồ chơi đã bị hư.", "eng": "All of the toys were broken."}, {"viet": "Tất cả phòng đơn đều có người rồi.", "eng": "All the single rooms are taken."}, {"viet": "Luôn xem bài làm của con cẩn thận trước khi nộp nhé.", "eng": "Always look your work through before handing it in."}, {"viet": "Một thái độ lẫn lộn về phía vợ của người bạn thân nhất của ai.", "eng": "An ambivalent attitude towards one's best friend's wife."}, {"viet": "Một người say mê các loại nhạc pop.", "eng": "An enthusiast for all kinds of pop music."}, {"viet": "Một biển nằm trong đất liền như biển Caspian.", "eng": "An inland sea such as the Caspian."}, {"viet": "Chuyên viên nắn xương đã săn sóc phần lưng bị chấn thương của bà ta.", "eng": "An osteopath has been treating her injured back."}, {"viet": "Và chúng tôi sẽ phải tính tiền bà về việc khoan mở cái hộp và thay ổ khóa.", "eng": "And we would have to charge you for drilling open the box and replacing the lock."}, {"viet": "Bất cứ sự phát biểu công khai hoặc bán công khai nào về chủ nghĩa phân biệt chủng tộc cũng có thể gây tranh cãi.", "eng": "Any public or semi-public expression of racism is controversial."}, {"viet": "Giá vé giống nhau cả chứ?", "eng": "Are the price all the same?"}, {"viet": "Anh sẽ đi đến đó bằng xe lửa hay máy bay?", "eng": "Are you going there by train or by plane?"}, {"viet": "Anh thật là một đầu bếp cừ khôi!", "eng": "Aren't you a great cook!"}, {"viet": "Về phần anh, anh phải tự thấy xấu hổ.", "eng": "As for you, you ought to be ashamed of yourself."}, {"viet": "Như các vị đều biết, những nhà thiết kế sẽ đến vào tuần tới và tôi muốn nghe đề nghị của các vị trước.", "eng": "As you know, the designers will be coming in next week and I'd like to hear your suggestions first."}, {"viet": "Trong những cuộc trưng bày, chó được chia thành sáu nhóm: thể thao, phi thể thao, làm việc, chó săn, chó sục và chó cảnh.", "eng": "At shows dogs are divided into six group: sporting, non-sporting, working, hound, terrier, and toy."}, {"viet": "Ngừa tai nạn bằng hành động tức thời.", "eng": "Avert an accident by prompt action."}, {"viet": "Hãy giữ gìn lời ăn tiếng nói-những nhận xét của anh có thể bị kiện đấy.", "eng": "Be careful what you say-your remarks may be actionable."}, {"viet": "Làm trò cười cho thiên hạ.", "eng": "Be the butt of everyone's jokes."}, {"viet": "Là con gái ông chủ đâu có nghĩa là một phương tiện thần kỳ để xin được bất cứ công việc lương cao nào trong hãng đó.", "eng": "Being the boss's daughter is not an open sesame to every well-paid job in the firm."}, {"viet": "Nếu thận hư, máu có thể được lọc bằng phương pháp thẩm thấu.", "eng": "Blood can be cleaned by osmosis if the kidneys have failed."}, {"viet": "Mang theo bản ghi nhớ đổi tiền họ đưa ông khi ông đổi đô la Canada lần trước.", "eng": "Bring with you the exchange memo which they gave you when you exchanged your Canadian dollars to RMB Yuan last time."}, {"viet": "Nhưng bạn có nghĩ đó là kỳ nghỉ thú vị nhất mà chúng ta đã từng có không?", "eng": "But do you think that was the most enjoyable holiday we've ever had?"}, {"viet": "Nhưng nó nổi tiếng vì con đường rộng nhất thế giới mà.", "eng": "But that's famous for being the widest road in the world."}, {"viet": "Anh ấy đã làm chúng tôi nguôi giận khi thẳng thắn thừa nhận rằng mình chẳng phải là một tay chơi xuất sắc.", "eng": "By frankly admitting he wasn't a brilliant player, he disarmed us all."}, {"viet": "Bình tĩnh-không có gì phải nổi nóng cả!", "eng": "Calm down-it's nothing to get steamed up about!"}, {"viet": "Người khác có thể giúp tôi ông chuyện này.", "eng": "Can someone else help you with this matter."}, {"viet": "Anh có thể đoán được ý nghĩa của từ đó trong ngữ cảnh đó không?", "eng": "Can you guess the meaning of the word from the context?"}, {"viet": "Ông có thể cho tôi biết những đơn vị nhân dân tệ của đô la Canada được không?", "eng": "Can you tell me the denominations for Canadian dollar?"}, {"viet": "Đáp ứng các sở thích cá nhân của mọi người.", "eng": "Cater for different people's individualities."}, {"viet": "Trẻ con phải đến trường trong độ tuổi từ 5 đến 16.", "eng": "Children must attend school between 5 and 16."}, {"viet": "Cắt một bài báo trong tờ báo.", "eng": "Clip an article out of the newspaper."}, {"viet": "Giao cho một họa sĩ vẽ một bức tranh.", "eng": "Commission an artist to paint a picture."}, {"viet": "Hiến cuộc đời mình cho việc phục vụ Chúa.", "eng": "Consecrate one's life to the service of God."}, {"viet": "Anh có thể cắt bớt bài luận văn của mình từ 10.000 xuống còn 5.000 từ không?", "eng": "Could you cut your essay from 10,000 to 5,000 words?"}, {"viet": "Anh có thể trông chừng áo quần tôi trong khi tôi bơi không?", "eng": "Could you watch over my clothes while I have a swim?"}, {"viet": "Bố ơi, đây là lần đầu tiên trong mùa này chúng ta được xem một trận đấu bóng chày.", "eng": "Dad, it's the first time this season for us to watch a baseball game."}, {"viet": "Lục trong một chiếc túi để kiếm cái gì.", "eng": "Delve into a pocket for something."}, {"viet": "Sáng chế một loại tranzito mới.", "eng": "Devise a new type of transistor."}, {"viet": "Bà đã báo chuyện đó với cảnh sát chưa?", "eng": "Did you report it to the police?"}, {"viet": "Chia một ngôi nhà làm thành những căn hộ.", "eng": "Divide a large house up into flats."}, {"viet": "Họ có loại bột giặt như vậy à?", "eng": "Do they have such a detergent?"}, {"viet": "Bạn có tài khoản ngân hàng ở Nhật Bản không?", "eng": "Do you have a bank account in Japan?"}, {"viet": "Nước bạn có nhập khẩu nhiều rượu vang Pháp không?", "eng": "Do you import a lot of French wine?"}, {"viet": "Bạn có phiền nếu chúng ta đổi đề tài không?", "eng": "Do you mind if we change the subject?"}, {"viet": "Bạn có nghĩ rằng Nhật Bản rất quan tâm đến thời trang không?", "eng": "Do you think that Japan is very fashion-oriented?"}, {"viet": "Việc viết hậu thuẫn quyền phụ nữ có thuộc phạm vi quyển sách của bạn không?", "eng": "Does feminist writing come within the scope of your book?"}, {"viet": "Xin đừng hỏi tôi cách làm món trứng rán như thế nào; nấu ăn không phải là sở trường của tôi.", "eng": "Don't ask me how to make an omelette; cooking isn't my métier."}, {"viet": "Đừng quên hút bụi tất cả các góc nhà.", "eng": "Don't forget to do all the corners."}, {"viet": "Đừng uống nhiều loại rượu lẫn lộn trong các bữa tiệc!", "eng": "Don't mix your drinks at the parties!"}, {"viet": "Đừng có cư xử với tôi như thể tôi là một thằng khờ.", "eng": "Don't treat me as if I were an idiot."}, {"viet": "Rút ra các số trúng thưởng do ngẫu nhiên.", "eng": "Draw the winning numbers at random."}, {"viet": "Mỗi ngôn ngữ có một hệ thống nguyên âm khác nhau.", "eng": "Each language has a different vowel system."}, {"viet": "Đội Anh đang đấu trong đồng phục màu xanh và trắng.", "eng": "England are playing in the blue and white strip."}, {"viet": "Mặc dù chúng ta ngồi ghế hạng thường, nhưng chỗ ngồi cũng không thấy chật hẹp.", "eng": "Even though we are in economy, the seats don't feel cramped."}, {"viet": "Đổi xe ô tô của mình lấy một chiếc mới.", "eng": "Exchange one's car for a new one."}, {"viet": "Kéo dài một sợi cáp để bắt qua hai trụ.", "eng": "Extend a cable between two posts."}, {"viet": "E sợ việc rút lại sự cho phép của cha mẹ anh ta.", "eng": "Feared the withdrawal of his parents'permission."}, {"viet": "Tìm thấy nguồn cung cấp trái cây và rau tươi dồi dào.", "eng": "Find plentiful supplies of fresh fruit and vegetables."}, {"viet": "Chân ruồi bám được vào những mặt phẳng bằng sự hút.", "eng": "Flies'feet stick to surfaces by suction."}, {"viet": "Đã có lần cô ta mất dè dặt thường lệ của mình và đã trở nên rất hoạt bát.", "eng": "For once, she lost her customary reserve and became quite lively."}, {"viet": "Thường xuyên những biện pháp trọng yếu băng qua các phòng này một cách êm ru, không có một lời xì xào bàn tán nào.", "eng": "Frequently, measures of major import glide through these chambers with nary a whisper of debate."}, {"viet": "Nhìn đắm đuối cô gái anh ta thương yêu.", "eng": "Gazing with rapture at the girl he loved."}, {"viet": "Tạo ra ấn tượng sai lạc về của cải lớn lao.", "eng": "Give a false impression of great wealth."}, {"viet": "Cung cấp thừa thãi cho thị trường những loại táo rẻ tiền từ nước ngoài.", "eng": "Glut the market with cheap apples from abroad."}, {"viet": "Đã mua món hàng của tôi với giá đó.", "eng": "Got my pennyworth at that price."}, {"viet": "Chi phí vận chuyển được tính trong số tiền này.", "eng": "Handling charges are included in this amount."}, {"viet": "Chúng ta có đủ bằng chứng để phán đoán chưa?", "eng": "Have we enough evidence to go by?"}, {"viet": "Bạn có bao giờ đến thăm ai ở viện điều dưỡng chua?", "eng": "Have you ever visited someone in a nursing home?"}, {"viet": "Anh đã rửa tất cả các đĩa đó chưa?", "eng": "Have you washed up all the plates?"}, {"viet": "Ông ta là một con người lịch sự, dù rằng đôi khi có hơi vênh vang.", "eng": "He's a real gentleman, if a little pompous at times."}, {"viet": "Anh ta giận dỗi mấy ngày vì bị loại ra khỏi đội.", "eng": "He's been sulking for days about being left out of the team."}, {"viet": "Anh ta bất tài và không đáng giữ lại.", "eng": "He's incompetent and not worth keeping on."}, {"viet": "Thỉnh thoảng người ta thấy ông ta ngồi đó suốt ngày.", "eng": "He's sometimes been known to sit there all day."}, {"viet": "Anh ta công nhận là mình có lỗi.", "eng": "He admitted that he was in the wrong."}, {"viet": "Nó bị trầy ống chân khi ngã vào các bậc đá.", "eng": "He barked his shins by falling against some stone steps."}, {"viet": "Ông ta không tham khảo ý kiến các đồng sự trong ban và cứ tiến hành cuộc thương lượng làm ăn.", "eng": "He bypassed his colleagues on the board and went ahead with the deal."}, {"viet": "Ông ta tuyên bố kết quả của cuộc bầu cử đã bị gian lận.", "eng": "He claimed the result of the election was rigged."}, {"viet": "Anh ta đã mang nỗi bất bình với ông chủ của mình.", "eng": "He'd been nursing a grievance against his boss."}, {"viet": "Anh ta không thèm đi xem phim với những người như chúng tôi.", "eng": "He disdains going to the cinema with people like us."}, {"viet": "Ông ta thích cưỡi ngựa, câu cá và săn bắn.", "eng": "He enjoys riding, fishing and shooting."}, {"viet": "Hắn làm giả vé miễn phí để xem trận đấu.", "eng": "He fiddled a free ticket for the match."}, {"viet": "Ông ta đã đánh cho tên trộm một trận nên thân.", "eng": "He gave the burglar a proper hiding."}, {"viet": "Cậu ấy đã bị sốt và bỏ ăn cơm tối.", "eng": "He had a fever and threw up his dinner."}, {"viet": "Nó chạy đi rất nhanh xuống con đường.", "eng": "He hared off down the street."}, {"viet": "Anh ta đã cam kết nuôi dưỡng con cái của người anh.", "eng": "He has committed himself to support his brother's children."}, {"viet": "Anh ta đã làm việc từ thời còn bé cho hãng đó đã ba mươi năm nay.", "eng": "He has worked for the firm, man and boy for thirty years."}, {"viet": "Ông ta là người da đỏ thuần chủng.", "eng": "He is a pure Red Indian."}, {"viet": "Ông ta chống đối kịch liệt sự kỳ thị chủng tộc.", "eng": "He is passionately opposed to racial discrimination."}, {"viet": "Ông ta cứ hay quên đủ thứ: tôi nghĩ là ông ta bắt đầu già lẫn.", "eng": "He keeps forgetting things: I think he's getting senile."}, {"viet": "Hắn thích tự xưng mình là một nhà trí thức.", "eng": "He likes to set himself up as an intellectual."}, {"viet": "Nó làm bất cứ công việc gì đột xuất để sinh sống.", "eng": "He made a catch-as-catch-can living doing odd jobs."}, {"viet": "Chắc hẳn là anh ta đã biết cô ấy muốn gì.", "eng": "He must have known what she wanted."}, {"viet": "Ông ta đi tới đi lui trên sân ga đợi chuyến xe lửa.", "eng": "He paced up and down the platform, waiting for the train."}, {"viet": "Hắn làm ra bộ rất chăm sóc con cái, nhưng đó là hoàn toàn nói phét: thậm chí chẳng bao giờ hắn dẫn chúng đi chơi nữa kia.", "eng": "He pretends to care so much about his children, but it's all eyewash: he never even takes them out."}, {"viet": "Anh ta bỏ nhà đi khi anh ta mười ba tuổi.", "eng": "He ran away from home when he was thirteen."}, {"viet": "Anh ấy đã lặp đi lặp lại điều đó vài lần cho đến khi ghi nhớ được.", "eng": "He repeated it several times over until he could remember it."}, {"viet": "Ông ta là một người phi thường về kiên nhẫn.", "eng": "He's a marvel of patience."}, {"viet": "Anh ta bò xuống kỳ cọ.", "eng": "He's down on his knees scrubbing."}, {"viet": "Ông ấy không phải là cầu thủ, ông ấy là huấn luyện viên.", "eng": "He's not a player, he's the manager."}, {"viet": "Hắn ta còn rất non nớt so với tuổi của hắn.", "eng": "He's very immature for his age."}, {"viet": "Chắc là anh ta không thoát được khi bị bắt lại.", "eng": "He scarcely escaped when he was recaptured."}, {"viet": "Ở tuổi ông ta không nên chơi bóng đá.", "eng": "He shouldn't be playing football at his time of life."}, {"viet": "Anh ta nói bằng những câu ngắn, mạnh mẽ, đồng thời dùng những từ đơn giản, bình dân mà kích động, sôi nổi.", "eng": "He speaks in short, punchy sentences, using plain, populist words that excite."}, {"viet": "Hắn vẫn còn nợ chúng tôi số hàng hóa mà hắn nhận tháng rồi.", "eng": "He still owes us for the goods he received last month."}, {"viet": "Ông ta quật bừa con chó bằng cái gậy của mình nhưng hụt.", "eng": "He swiped at the dog with his stick, but missed."}, {"viet": "Anh ta bảo tôi đừng mua nhưng dù sao chăng nữa tôi vẫn cứ mua.", "eng": "He told me not to buy it, but I bought it anyhow."}, {"viet": "Anh ta cố gắng trèo lên cây nhưng anh ta không thể.", "eng": "He tried to climb the tree, but he could not."}, {"viet": "Trước đây hắn thường buôn lậu súng qua biên giới.", "eng": "He used to run guns across the border."}, {"viet": "Nó có thể phát triển hết khả năng qua âm nhạc.", "eng": "He was able to fulfil himself through music."}, {"viet": "Hắn bị tố cáo như là kẻ gây rối vì đã tham gia cuộc biểu tình.", "eng": "He was branded as a trouble-maker for taking part in the demonstration."}, {"viet": "Anh ta nói những điều ngu ngốc về ý nghĩa cuộc đời.", "eng": "He was drivelling on about the meaning of life."}, {"viet": "Lần cuối cùng tôi gặp nó, nó đang ở trong tâm trạng thật sự bối rối.", "eng": "He was in a real state when I last saw him."}, {"viet": "Ông ta chỉ là một trong số những người cần được giúp đỡ.", "eng": "He was only one amongst many who needed help."}, {"viet": "Ông ấy ngồi ở ghế trước lò sưởi.", "eng": "He was sitting on a chair in front of the fire."}, {"viet": "Anh ta đang cố gắng quyết định xem có nên cầu hôn với cô ta hay không.", "eng": "He was trying to decide whether he should propose."}, {"viet": "Anh ta đi vòng phía bên của ngôi nhà.", "eng": "He went round to the side of the house."}, {"viet": "Nó mặc những quần áo tồi tàn nhất đến dự liên hoan: nó chẳng có ý thức gì trong trường hợp này!", "eng": "He wore his shabbiest clothes to the party: he has no sense of occasion!"}, {"viet": "Đốt nóng lò lên nhiệt độ 2000C.", "eng": "Heat the oven to a temperature of 2000C."}, {"viet": "Các bài báo của cô ấy là những bài đọc thú vị cho du khách.", "eng": "Her articles are interesting reading for travellers."}, {"viet": "Tình trạng của cô ấy chứng tỏ có một sự tiến triển đều đặn.", "eng": "Her condition is showing a progressive improvement."}, {"viet": "Mặt cô ấy béo ra vì cô ấy tăng cân.", "eng": "Her face is beginning to fill out as she puts on weight."}, {"viet": "Chiếc mũ của cô ta nằm ngay ngắn trên đầu.", "eng": "Her hat was set squarely on her head."}, {"viet": "Cuốn tiểu thuyết mới nhất của bà ấy đã được đón nhận với những lời ca ngợi nhiệt liệt.", "eng": "Her latest novel was received with great éclats."}, {"viet": "Cuốn tiểu thuyết của bà ta đã bị các nhà phê bình đả kích thậm tệ.", "eng": "Her novel has been badly mauled by the critics."}, {"viet": "Buổi độc tấu của cô ấy bắt đầu bằng khúc xô-nát của Haydn.", "eng": "Her recital led off with a Haydn sonata."}, {"viet": "Lời tuyên bố của bà ta bao hàm nhiều điểm không đúng.", "eng": "Her statement contained several inaccuracies."}, {"viet": "Tác phẩm của cô ta vượt trội các tác phẩm khác và dễ dàng chiếm vị trí thứ nhất.", "eng": "Her work stands out from the rest as easily the best."}, {"viet": "Thu nhập cao hơn có nghĩa là đóng thuế nhiều hơn, cho nên tất cả là vấn đề cân bằng lỗ lãi.", "eng": "Higher earnings mean more tax, so it's all swing and roundabouts."}, {"viet": "Quan điểm của anh ta đã được hình thành một phần là do những kinh nghiệm trước đó.", "eng": "His attitudes were shaped partly by early experiences."}, {"viet": "Cằm hắn nhô ra khá nhiều.", "eng": "His chin juts out rather a lot."}, {"viet": "Hành vi say rượu của nó là hết sức đáng chê trách.", "eng": "His drunken behaviour was extremely objectionable."}, {"viet": "Cha anh ta đã giúp vốn để anh có thể mở hiệu bán sách.", "eng": "His father set him up as a bookseller."}, {"viet": "Tim ông ta ngừng đập và ông ta sớm chết sau đó.", "eng": "His heart stopped beating and he died soon after-wards."}, {"viet": "Chức vụ giảng viên của ông ta có thể kéo dài được 3 năm.", "eng": "His lectureship is tenable for a period of 3 years."}, {"viet": "Chiếc ôtô mới của anh ta, mà anh ta đã trả 7000 bảng Anh, chưa chi đã phải đem chữa rồi.", "eng": "His new car, for which he paid £ 7000, has already had to be repaired."}, {"viet": "Chính trị của ông ta là cánh tả, nhưng ông ta không thích được phân loại là người xã hội chủ nghĩa.", "eng": "His politics are are fairly leftwing, but he doesn't like to be categorized as a socialist."}, {"viet": "Những đóng góp của ông ấy cho đất nước không bao giờ được chính thức đền đáp.", "eng": "His services to the country were never officially acknowledged."}, {"viet": "Tính cách được cho là hào phóng của anh ta chỉ là một dạng ích kỷ.", "eng": "His supposed generosity is merely a form of self-interest."}, {"viet": "Lời nói của nó trọng lượng đối với bạn đồng nghiệp.", "eng": "His word weighs heavily with his colleagues."}, {"viet": "Rượu vang chế tại nhà có thể có rất nhiều chất rượu.", "eng": "Home-made wine can be very alcoholic."}, {"viet": "Chúng ta đi Luân Đôn chơi một ngày đi?", "eng": "How about going to London for the day?"}, {"viet": "Cô làm sao có thể chịu được tất cả các cảnh bạo lực trong bộ phim?", "eng": "How could you stomach all the violence in the film?"}, {"viet": "Cậu thích uống trà như thế nào?''Mình thích trà hơi nhạt một chút'.", "eng": "How do you like your tea?''I like it rather weak'."}, {"viet": "Ông thấy như vậy bao lâu rồi?", "eng": "How long have you been feeling this way?"}, {"viet": "Anh đã đi bao nhiêu dặm trong chuyến du lịch này?", "eng": "How many miles did you do during your tour?"}, {"viet": "Đi Taxi từ đây đến bờ sông kia bao nhiêu tiền?", "eng": "How much for the taxi from here to the waterfront?"}, {"viet": "Bộ luật mới sẽ tác động đến những người thất nghiệp như thế nào?", "eng": "How will the new law hit the unemployed?"}, {"viet": "Tôi muốn tát vào mặt hắn vì hắn đã thô lỗ như vậy!", "eng": "I'd a good mind to smack him for being so rude!"}, {"viet": "Tôi muốn ngồi bên cửa sổ.", "eng": "I'd like to take the seat by the window."}, {"viet": "Tôi sẽ mua một vài món đồ lưu niệm cho các bạn của tôi.", "eng": "I'll get some souvenirs for my friends."}, {"viet": "Tôi để ông ấy trong danh sách thiếp mừng Giáng sinh của tôi.", "eng": "I'll put him on my Christmas card list."}, {"viet": "Tôi e là tôi không thích các món ăn làm từ thịt rắn hay thịt chó.", "eng": "I'm afraid I don't like snake dishes or dog meat."}, {"viet": "Tôi sẽ bay sang Hồng Kông ngày mai.", "eng": "I'm flying to Hong Kong tomorrow."}, {"viet": "Tôi vội khủng khiếp nên tôi không thể ngưng được.", "eng": "I'm in a tearing rush so I can't stop."}, {"viet": "Tôi chẳng quá thích thú về cái ý nghĩ sống trọn một ngày với anh ta.", "eng": "I'm not too enamoured with the idea of spending a whole day with him."}, {"viet": "Tôi rất tiếc anh đã đi đến chỗ thất vọng.", "eng": "I'm sorry that you've resorted to deception."}, {"viet": "Tôi phát ngấy lên vì những lời phàn nàn không ngớt của anh.", "eng": "I'm tired of your unending complaints."}, {"viet": "Tôi phải trông nom bốn đứa trẻ nhỏ suốt ngày và tôi hầu như đã kiệt sức!", "eng": "I've been looking after four young children all day and I really am at the end of my tether!"}, {"viet": "Tôi có một ý này, sao chúng ta không tổ chức một bữa tiệc nhỉ?", "eng": "I've got an idea, why don't we have a party?"}, {"viet": "Mình chưa bao giờ nghe thấy cái mớ rác rưởi như thế cả!", "eng": "I've never heard such a load of garbage!"}, {"viet": "Tôi hoàn toàn ác cảm với cái cách vợ anh ta đối xử với anh ta.", "eng": "I'm completely disgusted with the way his wife has treated him."}, {"viet": "Tôi còn nợ 500 bảng Anh.", "eng": "I am £ 500 to the bad."}, {"viet": "Tôi phải thông báo với anh là.", "eng": "I am to inform you that."}, {"viet": "Tôi bắt đầu lên cân khi tôi hết ăn kiêng.", "eng": "I began to gain when I went off my diet."}, {"viet": "Tôi không thể chi tiền thêm nữa về thức ăn.", "eng": "I can't afford to spend any more on food."}, {"viet": "Tôi không thể chứng minh là tôi không nói dối-anh cứ tin lời nói của tôi thôi.", "eng": "I can't prove I'm not lying-you'll just have to take my word for it."}, {"viet": "Tôi có thể nghe được những tiếng nói xuyên qua tường.", "eng": "I can hear voices through the wall."}, {"viet": "Tôi không thể đóng cái nắp được.", "eng": "I can't get the lid on."}, {"viet": "Tao có thể hả dạ bóp cổ mày vì đã đưa tao vào tình trạng lộn xộn này!", "eng": "I could cheerfully strangle you for getting me into this mess!"}, {"viet": "Tôi đoán cô ta trạc 30 tuổi.", "eng": "I'd guess she's about 30."}, {"viet": "Tôi đã không gọi bất cứ cuộc điện thoại nào.", "eng": "I did not make any telephone calls."}, {"viet": "Hằng ngày tôi làm công việc đưa mấy đứa trẻ đến trường.", "eng": "I do the milk run every day taking the children to school."}, {"viet": "Tôi không biết tại sao cô ấy lại lấy cái người đàn ông kinh khủng đó, tôi thì tôi tránh anh ta cho thật xa.", "eng": "I don't know why she's marrying that appalling man, I wouldn't touch him with a barge-pole."}, {"viet": "Tôi không nghĩ rằng chúng ta sẽ thành công, nhưng chúng ta cũng cứ thử xem.", "eng": "I don't think we'll succeed, still, we can but try."}, {"viet": "Tôi không thích nhạc jazz hiện đại.", "eng": "I don't dig modern jazz."}, {"viet": "Trên đường đến trường tôi đã đánh rơi ví tiền của tôi.", "eng": "I dropped my wallet on the way to school."}, {"viet": "Tôi cảm thấy hoàn toàn hăng hái sáng nay.", "eng": "I feel quite sparkly this morning."}, {"viet": "Tôi thấy quyết định của họ thật đáng ngạc nhiên.", "eng": "I find their decision simply staggering."}, {"viet": "Tôi đi bơi để tốt cho sức khoẻ của tôi.", "eng": "I go swimming for the good of my health."}, {"viet": "Tôi đã nói chuyện rất lâu với ông hiệu trưởng về thằng con tôi.", "eng": "I had a long talk with the headmaster about my son."}, {"viet": "Tôi phải đứng suốt đoạn đường về nhà trên xe buýt.", "eng": "I had to stand all the way home in the bus."}, {"viet": "Người ta đã khuyên tôi thử dùng những viên thuốc này để chống say sóng.", "eng": "I have been recommended to try these pills for seasickness."}, {"viet": "Tôi có một đứa con có nước da trắng, một đứa ngăm ngăm đen.", "eng": "I have one fair and one dark child."}, {"viet": "Tôi chưa quyết định thực đơn, nói chi đến việc đi mua thức ăn.", "eng": "I haven't decided on the menu yet, let alone bought the food."}, {"viet": "Tôi nghe thấy một tiếng ồn lạ lúc nửa đêm.", "eng": "I heard a funny noise in the middle of the night."}, {"viet": "Tôi hy vọng sự bất đồng này không làm vẩn đục tình bạn của chúng ta.", "eng": "I hope this disagreement won't cloud our friendship."}, {"viet": "Em chỉ cầu mong chúng mình không đến quá muộn thôi.", "eng": "I just hope and pray we aren't too late."}, {"viet": "Tôi biết cô không ưa tôi hút thuốc lá nhưng cần gì phải lải nhải mãi về chuyện đó.", "eng": "I know you don't like my smoking, but there's no need to go on about it."}, {"viet": "Tôi thích tất cả các môn chơi bóng.", "eng": "I liked all kinds of ball games."}, {"viet": "Tôi biếu họ mấy quả cà chua.", "eng": "I'll get them some tomatoes."}, {"viet": "Tôi sẽ nói với ông Vương là ông đang có mặt ở đây.", "eng": "I'll tell Mr. Wang you are here."}, {"viet": "Tôi rất vui mừng về thành công của anh.", "eng": "I'm delighted at your success."}, {"viet": "Tôi yêu cô ấy như điên như dại.", "eng": "I'm madly in love with her."}, {"viet": "Tối nay tôi sẽ không ở nhà.", "eng": "I'm stopping at home tonight."}, {"viet": "Tôi tình cờ gặp hắn tại siêu thị.", "eng": "I met up with him at the supermarket."}, {"viet": "Tôi phải nói cho các ông biết rằng giá cả của các ông cao hơn một số bảng báo giá chúng tôi đã nhận được từ các công ty khác.", "eng": "I must tell you that your prices are higher than some of the quotations we have received from other firms."}, {"viet": "Tôi không còn coi anh ta nằm trong số bạn bè của tôi nữa.", "eng": "I no longer count him among my friends."}, {"viet": "Tôi thấy tội nghiệp cho người vợ chịu đau khổ lâu dài của ông ta.", "eng": "I pity his long-suffering wife."}, {"viet": "Tôi đọc báo mới biết là ông ta đã từ chức.", "eng": "I read that he had resigned."}, {"viet": "Tôi vẫn còn hơi nghi ngờ về những động cơ của cô ta.", "eng": "I remain dubious about her motives."}, {"viet": "Tuần trước tôi trông thấy đôi giầy giống như vậy trong một cửa hàng.", "eng": "I saw the same shoes in a shop last week."}, {"viet": "Tôi sẽ chẳng vội vàng gì mời nó lần nữa-nó đã cư xử rất tệ.", "eng": "I shan't invite him again in a hurry-he behaved very badly."}, {"viet": "Đối với cô ta tôi là người thay thế cha mẹ cô ta.", "eng": "I stand towards her inloco parentis."}, {"viet": "Tôi buộc tội anh ấy đã để ngỏ cửa.", "eng": "I taxed him with leaving the door open."}, {"viet": "Tôi nghĩ nó sẽ đặc biệt đối với ông.", "eng": "I think it will be special for you."}, {"viet": "Tôi nghĩ là các kiểu tóc như thế không còn đúng mốt nữa.", "eng": "I thought hairstyles like that were on the way out."}, {"viet": "Tôi đã cố gắng tiếp xúc với anh ta, mặc dù không thành công.", "eng": "I tried, albeit unsuccessfully, to contact him."}, {"viet": "Tôi đã bỏ tiền vé của nó vào rồi.", "eng": "I've already put his fare in."}, {"viet": "Tôi muốn mua một quyển ngữ pháp tiếng Pháp.", "eng": "I want to buy a French grammar."}, {"viet": "Tôi đã hơi cộc cằn với anh ta.", "eng": "I was a little curt with him."}, {"viet": "Tôi đã sử dụng bể bơi của họ.", "eng": "I was given the use of their swimming pool."}, {"viet": "Tôi ghê tởm cái thói khạc nhổ bẩn thỉu của hắn.", "eng": "I was revolt by his dirty habit of spitting."}, {"viet": "Bản báo cáo làm tôi sợ hết sức.", "eng": "I was very much frightened by the report."}, {"viet": "Tôi sẽ cùng chịu phí tổn với anh.", "eng": "I will share in the cost with you."}, {"viet": "Tôi thắc mắc không biết làm sao anh lại có ý nghĩ như vậy?", "eng": "I wonder how you got that impression?"}, {"viet": "Nếu tôi là anh, tôi sẽ đứng xa con chó kia ra!", "eng": "I would keep my distance from that dog, if I were you!"}, {"viet": "Tôi xếp cô ta vào loại những ca sĩ có giọng nữ cao danh tiếng.", "eng": "I would place her among the world's greatest sopranos."}, {"viet": "Nếu một ống dẫn nước nổ thì phải khoá vòi ống lại ngay.", "eng": "If a water-pipe bursts turn off the stopcock immediately."}, {"viet": "Nếu tôi có xúc phạm anh thì đấy chỉ là vô tình.", "eng": "If I offended you it was unwittingly."}, {"viet": "Nếu cái nắp của một cái hộp như thế nằm ở đáy một con sông sâu 20 bộ, một con sông như thế không có gì là sâu, thì nước ở bên trên có thể nặng hơn nữa tấn.", "eng": "If the lid of such a can were lying at the bottom of a river 20 feet deep, and that is not at all deep for a river, the water on top of it would weigh more than half a ton."}, {"viet": "Nếu anh muốn tôi giúp anh, tôi sẽ rất sẵn lòng thôi.", "eng": "If you'd like me to help you, I'd be only too glad to."}, {"viet": "Nếu anh không yêu cầu mổ, anh có thể được điều trị như một bệnh nhân ngoại trú.", "eng": "If you do not require surgery you can be treated as an out-patient."}, {"viet": "Nếu bạn thích lần khác chúng ta cũng có thể đến viện Bảo tàng ABC để xem những tác phẩm của các nghệ sĩ bậc thầy.", "eng": "If you like, we can also go to ABC Museum to see the works of the masters another time."}, {"viet": "Nếu anh muốn làm ra tiền, anh phải suy nghĩ đến tiền.", "eng": "If you want to make money you've got to think money."}, {"viet": "Với giọng nói lạc đi vì xúc động, anh ấy báo tin về cái chết của người bố.", "eng": "In a voice cracking with emotion, he announced the death of his father."}, {"viet": "Khi đẹp trời, tôi có thể lái xe bỏ mui.", "eng": "In fine weather I can drive my car with the hood down."}, {"viet": "Để chứng tỏ quan điểm của mình, chị ấy đưa cho họ xem con số bán gần đây nhất.", "eng": "In order to prove her point she showed them the latest sales figures."}, {"viet": "Trong kỳ thi đó, tôi đã quay cóp ( một câu trả lời ) của cô gái ngồi bên cạnh.", "eng": "In the exam, I cribbed ( an answer ) from the girl next to me."}, {"viet": "Trong cuốn từ điển này, ký hiệu V được dùng có nghĩa là cấm kỵ.", "eng": "In this dictionary the ideogram V is used to mean taboo."}, {"viet": "Những thiệt hại phải chịu đựng trong khi đeo đuổi nhiệm vụ.", "eng": "Injuries suffered in the pursuance of one's duties."}, {"viet": "Có thật sự cách đó năm dặm không?", "eng": "Is it really five miles over there?"}, {"viet": "Có lý do nào khiến cậu không nên làm điều đó không?", "eng": "Is there any reason why he shouldn't?"}, {"viet": "Thật là tồi khi con người ta phản bội bạn bè cũ.", "eng": "It'll befit a man to betray old friends."}, {"viet": "Vị bác sĩ nhẹ nhàng nói Ông ấy thế là hết rồi.", "eng": "It's all over with him, the doctor said gently."}, {"viet": "Nói sau việc chọn diễn viên đóng phim thì dễ, thí dụ nói là người ta đã chọn không đúng diễn viên.", "eng": "It's easy to second-guess the casting of the film."}, {"viet": "Giống như là lục phủ ngũ tạng của bạn sẽ bị văng ra ngoài.", "eng": "It's like your guts will come out of your mouth."}, {"viet": "Đây là một trường phái tranh theo phong cách chi tiết cổ xưa được gọi là Công bút ở Trung Quốc.", "eng": "It's of a school of painting in ancient meticulous-style known as Gongbi in China."}, {"viet": "Chính cảnh sát là những người luôn ở tuyến lửa khi có những cuộc biểu tình chính trị.", "eng": "It's the police who are always in the firing-line when there are political demonstrations."}, {"viet": "Hình như cô ấy không theo chỉ dẫn của chúng tôi.", "eng": "It appears that she failed to follow our instructions."}, {"viet": "Nó đã cứu mạng tôi và mạng của muôn vàn người khác.", "eng": "It has saved my life, and the lives of countless others."}, {"viet": "Điều quan trọng đối với tôi là anh phải có mặt ở đó.", "eng": "It is important to me that you should be there."}, {"viet": "Quyết định khi nào công bố cuộc bầu cử là quyền hạn của thủ tướng.", "eng": "It is the Prime Ministers prerogative to decide when to call an election."}, {"viet": "Chắc là ông nhà bên cạnh đó.", "eng": "It must have been the guy next door."}, {"viet": "Đó là một trong những sở thích của tôi.", "eng": "It's one of my hobbies."}, {"viet": "Có thể tìm ra ông ấy sinh ra ở đâu.", "eng": "It should be possible to ascertain where he was born."}, {"viet": "Đó là một bữa ăn kém, không ai thích cả.", "eng": "It was a meal of sorts, but nobody enjoyed it."}, {"viet": "Do anh ta rượu chè cho nên cuộc hôn nhân của họ tan vỡ.", "eng": "It was his drinking that busted up their marriage."}, {"viet": "Đó là đồ vật đắt nhất mà tôi đã mua từ trước đến giờ.", "eng": "It was the most extravagant purchase I have ever made."}, {"viet": "Nên khoá cửa khi anh đi đâu.", "eng": "It would be just as well to lock the door when you go out."}, {"viet": "Jenny không nghĩ ra được cô ấy đã đặt quấn sách ở đâu.", "eng": "Jenny can't think where she might have put the book."}, {"viet": "Từ trong xe anh ấy đã gọi với Lên xe nhanh đi.", "eng": "Jump in he called from the car."}, {"viet": "Thịt cừu non ướp tỏi và cây hương thảo.", "eng": "Lamb seasoned with garlic and rosemary."}, {"viet": "Để tôi kiểm tra xem …, ông nói đúng.", "eng": "Let me check it you are right."}, {"viet": "Cậu bé Jimmy thật sự kiệt sức sau cái ngày dài đầy mệt mỏi ấy.", "eng": "Little Jimmy was really out for the count after that long tiring day."}, {"viet": "Nhiều người trong bọn họ có thái độ đối kháng với tổng thống.", "eng": "Many of them are antagonistic towards the President."}, {"viet": "Chiếc áo của Mary chiều dài không đúng-nó ngắn quá.", "eng": "Mary's dress is not the right length-it's too short."}, {"viet": "Tôi đặt máy ghi âm lên bàn này được không?", "eng": "May I put the recorder on this table?"}, {"viet": "Mẹ ơi, không có việc gì để làm, vậy chúng ta đi xem phim nhé?", "eng": "Mom, there is nothing to do, so how about going to see a movie?"}, {"viet": "Người soát vé nói Xin vui lòng nhích vào trong?", "eng": "Move along, please, said the bus conductor?"}, {"viet": "Tài khoản ngân hàng của tôi bị hụt mất 50 pao.", "eng": "My bank account is 50 pounds in the red."}, {"viet": "Tôi không bao giờ dung thứ sự không hoàn chỉnh.", "eng": "My father never tolerated imperfection."}, {"viet": "Hôm nay mẹ tôi đã bị tai nạn xe hơi!", "eng": "My mom got in a car accident today!"}, {"viet": "Mắt cá bị bong gân làm tôi đau đớn suốt cả tuần.", "eng": "My sprained ankle has been acting up badly all week."}, {"viet": "Đừng bao giờ trả cao hơn giá đặt bán một ngôi nhà.", "eng": "Never offer more than the asking price for a house."}, {"viet": "Không, tôi không có thú tiêu khiển nào cả.", "eng": "No, I don't have any hobbies."}, {"viet": "Không ai được rời lớp học cho đến khi tiếng chuông reo.", "eng": "No one may leave the classroom until the bell goes."}, {"viet": "Bây giờ hãy cho tôi biết sự thật: tôi không muốn nghe những chuyện bịa đặt của anh thêm nữa'.", "eng": "Now tell me the truth: I don't want any more of your fairy stories'."}, {"viet": "Trong hai cái tôi cũng chẳng biết nên xem cái nào là tốt hơn.", "eng": "Of these two, I do not know which to prefer."}, {"viet": "Vâng, vậy để tôi lặp lại những gì ông vừa nói với tôi: một bữa tiệc chào mừng ở Hội trường Hoa Hồng vào lúc 7 giờ 30 tối mai, sáu bàn dành cho 58 người, mỗi bàn 2000 nhân dân tệ, món ăn Quảng Đông, thức uống và trái cây.", "eng": "OK, so let me repeat what you've told me: a welcome banquet in the Rose Hall at 7: 30 tomorrow evening, six tables for fifty-eight at 2,000 Yuan a table, Cantonese dishes, drinks and fruit."}, {"viet": "Một khi vấn đề trở thành công khai, anh ta đã bị báo chí quấy rầy.", "eng": "Once the affair became public, he was persecuted by the press."}, {"viet": "Một trong những niềm tự hào của di sản nước Anh là quyền được xét xử công bằng.", "eng": "One of the glories of the British heritage is the right to a fair trial."}, {"viet": "Tiền hoa hồng 1500 đô la Mỹ của chúng tôi đã được khấu trừ.", "eng": "Our commission of US $ 1,500 has been deducted."}, {"viet": "Kiểu mới nhất của chúng tôi chắc sẽ đáp ứng hoàn toàn các đòi hỏi của ngài.", "eng": "Our latest model should meet your requirements exactly."}, {"viet": "Thầy giáo của chúng tôi luôn nói chung chung, không bao giờ đi vào chi tiết điều gì cả.", "eng": "Our teacher is always generalizing, he never deals with anything."}, {"viet": "Các bố mẹ đã đoàn tụ lại với con cái bị lạc của họ.", "eng": "Parents were reunited with their lost children."}, {"viet": "Người ta bảo tôi là cô ấy rất dễ thương, nhưng hoàn toàn không như vậy.", "eng": "People had told me she was very pleasant but she's nothing of the kind."}, {"viet": "Xin đừng quên mang theo biên lai thu tiền tạm cấp và hộ chiếu của ông, thưa ông Owen.", "eng": "Please don't forget to bring along with you the Provisional Receipt for Collection and your passport, Mr. Owen."}, {"viet": "Những công ty tư nhân quản lý tiền gửi và tiền vay.", "eng": "Private firms handled deposits and loans."}, {"viet": "Tao không tin lời mày, mày không có cơ hội đâu!", "eng": "Say you, you haven't got a chance!"}, {"viet": "Tôi giúp chị rửa bát đĩa được không?''Đừng mất thời gian-tôi sẽ làm sau'.", "eng": "Shall I help you with the washing up?''Don't bother-I'll do it later'."}, {"viet": "Cô ta là một minh tinh trong xứ này nhưng cô ta không bao giờ thành công trong cả nước.", "eng": "She's a star in this country but she never made it big in the state."}, {"viet": "Bà ta đã quyết định giành phần thắng bằng mọi giá.", "eng": "She's determined to win, by fair means or foul."}, {"viet": "Cô ấy bị viễn thị và cần có kính để đọc sách.", "eng": "She's long-sighted and needs glasses to read."}, {"viet": "Cô ấy học lịch sử nghệ thuật ở Florence.", "eng": "She's studying history of art in Florence."}, {"viet": "Cô ấy đã cố hết mình để hoàn tất đúng thời hạn.", "eng": "She aid her damnedest to get it done on time."}, {"viet": "Bà ta cụng đầu vào cửa và chửi toáng lên.", "eng": "She bumped her head in the doorway and swore loudly."}, {"viet": "Cô ta làm bẽ mặt những người chỉ trích bằng việc phá kỷ lục.", "eng": "She confounded her critics by breaking the record."}, {"viet": "Cô ta dành cả cuộc đời mình cho việc theo đuổi sự vui chơi.", "eng": "She devoted her life to the pursuit of pleasure."}, {"viet": "Cô ấy ôm choàng đứa bé trong tay một cách âu yếm.", "eng": "She enfolded the child lovingly in her arms."}, {"viet": "Nàng thấy khó mà lo liệu khi giá cả các thứ đều tăng cao.", "eng": "She found it difficult to contrive when prices of everything went up."}, {"viet": "Cô ta đã làm cho họ đưa hết tiền cho cô ấy bằng một mánh lới lừa gạt độc ác.", "eng": "She got them to hand over all their money by a wicked deceit."}, {"viet": "Cô ta đã phải đi làm để có tiền học xong trường Luật.", "eng": "She had to work her way through law school."}, {"viet": "Học kỳ này cô ta đã không bị bắt học đầy đủ ở trường.", "eng": "She has not been sufficiently stretched at school this term."}, {"viet": "Cô ấy làm anh ta bực bội vì cứ luôn tay nghịch cái bút chì.", "eng": "She irritated him by constantly twiddling her pencil."}, {"viet": "Bà ta vẫn thúc bách đòi được bồi thường.", "eng": "She is still pressing her claim for compensation."}, {"viet": "Cô ta đã bỏ nhà ra đi để thoát khỏi sức ép buộc cô phải tuân theo lối sống của gia đình.", "eng": "She left home to escape the pressure to conform to her family's way of life."}, {"viet": "Cô ta đã đi đường vòng và gặp lại chúng tôi ở bên kia rừng.", "eng": "She made a detour and rejoined us on the other side of the wood."}, {"viet": "Cô ấy gật đầu khi tôi hỏi cô ấy có thích phim đó không.", "eng": "She nodded when I asked if she liked the film."}, {"viet": "Cô ta đã thổ lộ hết với tôi những điều lo âu của cô qua một tách cà phê.", "eng": "She poured out her troubles to me over a cup of coffee."}, {"viet": "Bà ta tự hào về cái tên Cassandra Postlethwaite.", "eng": "She rejoices in the name of Cassandra Postlethwaite."}, {"viet": "Ở trường cô ta học hành rất tiến bộ.", "eng": "She's doing very well at school."}, {"viet": "Cô ấy đang bài cái trò quỷ quái gì đây.", "eng": "She's up to some devilry or other."}, {"viet": "Cô ấy dường như là cục nam châm đối với những người gặp khó khăn.", "eng": "She seems to be a loadstone for people in trouble."}, {"viet": "Cô ta đã nịnh hót dụ tôi vào cuộc.", "eng": "She snared me into going by using flattery."}, {"viet": "Cô đã moi được ở anh ta tên người thắng cuộc.", "eng": "She succeeded in pumping the name of the winner out of him."}, {"viet": "Cô ta đã lợi dụng sự hào phóng của tôi.", "eng": "She took advantage of my generosity."}, {"viet": "Bà ấy thường nấu một bữa ăn nóng vào buổi chiều.", "eng": "She usually cooks a hot meal in the evening."}, {"viet": "Cô ấy luôn luôn được các bạn yêu quí mình đề cao.", "eng": "She was always made much of by her adoring friends."}, {"viet": "Cô ta là nạn nhân dễ dàng của những người chào hàng gian xảo.", "eng": "She was easy prey for dishonest salesmen."}, {"viet": "Cô ta chờ mong ngày bước lên xe hoa.", "eng": "She was looking forward to the day when she would walk up the aisle."}, {"viet": "Chị ấy được lựa chọn để bắt đầu kế hoạch đã được đề nghị.", "eng": "She was selected to initiate the proposed plan."}, {"viet": "Cô ta rất xấu hổ vì đã lấy cắp tiền.", "eng": "She was very ashamed that she had stolen the money."}, {"viet": "Nàng khóc vì hoàn toàn vui mừng khi biết anh ấy được bình an.", "eng": "She wept from the very joy of knowing he was safe."}, {"viet": "Cô ấy làm ở phòng kế toán.", "eng": "She works in the accounts department."}, {"viet": "Tôi cần phải kí tên bằng bút chì hay bút mực?", "eng": "Should I sign my name in pencil or ink?"}, {"viet": "Từ khi vượt ngục, Tom đã sống trong tình trạng nơm nớp sợ bị bắt lại.", "eng": "Since he escaped from gaol, Tom has been living on a razor's edge, terrified of recapture."}, {"viet": "Vội vàng bỏ đi không nói với ai tiếng nào.", "eng": "Skip off without saying anything to anyone."}, {"viet": "Căng thẳng tấm khăn trải giường.", "eng": "Smooth out a sheet on a bed."}, {"viet": "Xà phòng không tẩy sạch được vết ố đó.", "eng": "Soap won't shift that stain."}, {"viet": "Một số thức ăn gây táo bón.", "eng": "Some foods are binding the bowels."}, {"viet": "Có người coi sự khoả thân là thô bỉ.", "eng": "Some people regard nudity as offensive."}, {"viet": "Có ai đó đã gửi lại bức thư này cho anh.", "eng": "Someone left this note for you."}, {"viet": "Trả góp tiền mua ngôi nhà trong vòng hai mươi năm.", "eng": "Space out payments for a house over twenty years."}, {"viet": "Đóng dấu tên và địa chỉ của mình lên phong bì.", "eng": "Stamp one's name and address on an envelope."}, {"viet": "Đôi bít tất dài làm bằng vải lưới lụa mịn.", "eng": "Stockings made of fine silk mesh."}, {"viet": "Tình trạng căng thẳng và mệt mỏi thường dẫn đến sự thiếu tập trung.", "eng": "Stress and tiredness often result in a lack of concentration."}, {"viet": "Sự lỗ mãng như thế đúng là bản tính của anh ta.", "eng": "Such bluntness is characteristic of him."}, {"viet": "Ủng hộ một sự nghiệp, đảng chính trị, cuộc cải cách.", "eng": "Support a cause, political party, reform."}, {"viet": "Nghỉ vài ngày vào dịp Giáng sinh.", "eng": "Take a few day's holiday at Christmas."}, {"viet": "Gõ những ngón tay của mình theo đúng nhịp nhạc.", "eng": "Tapping one's fingers in time with the music."}, {"viet": "Các liên từ chỉ thời gian như when, while.", "eng": "Temporal conjunctions, eg. when, while."}, {"viet": "Đó là một sự phủ nhận hoàn toàn điều anh đã nói trước đây.", "eng": "That's a flat contradiction of what you said before."}, {"viet": "Loại xe ôtô đó đã ngưng sản xuất cách đây năm năm.", "eng": "That car went out of production five years ago."}, {"viet": "Rõ ràng đó là hướng hành động tốt nhất.", "eng": "That is indubitably the best course of action."}, {"viet": "Nhãn hiệu đặc biệt đó được bán hết rồi.", "eng": "That particular brand is all sold out."}, {"viet": "Nhìn lại sự việc như kiểu Ănglê.", "eng": "That sounds like typical British understatement."}, {"viet": "Chiếc DC-3 đã được sử dụng 50 năm, một trong những máy bay chở nặng bền bỉ và hiệu quả nhất của ngành hàng không.", "eng": "The 50-year-old DC-3, one of aviation's most effective work-horses."}, {"viet": "Diễn xuất không đủ hay để bù lại sự tồi tệ của vở kịch.", "eng": "The acting was not good enough to redeem the awfulness of the play."}, {"viet": "Chuông báo động đã làm bọn trộm hoảng sợ bỏ chạy.", "eng": "The alarm frightened the burglars away."}, {"viet": "Những hành động xuẩn ngốc của những đảng phái chính trị chủ yếu.", "eng": "The antics of the main political parties."}, {"viet": "Mùi thơm của cà phê, xì gà, hạt dẻ nướng.", "eng": "The aroma of coffee, cigars, hot chestnuts."}, {"viet": "Cử toạ im phăng phắc đến mức anh có thể nghe được tiếng đinh ghim rơi.", "eng": "The audience was so quiet you could have heard a pin drop."}, {"viet": "Ghế ở hàng sau của xe hơi đủ rộng cho ba người ngồi.", "eng": "The back seat of the car is wide enough for three people."}, {"viet": "Cờ của nhiều nước bên ngoài trụ sở Liên Hiệp Quốc.", "eng": "The banner of various countries outside the UN headquarters."}, {"viet": "Bia chảy từ trong thùng ra dưới sức nén.", "eng": "The beer comes out of the barrel under pressure."}, {"viet": "Các vị giám mục, linh mục và các thầy phó tế lần lượt đi vào trong thánh đường.", "eng": "The bishops, priests and deacons processed into the cathedral."}, {"viet": "Quả bom đã nổ tung giữa một phố đông người.", "eng": "The bomb went off in a crowed street."}, {"viet": "Ông sếp hết sức tức giận khi ông ấy trông thấy bản báo cáo hàng bán.", "eng": "The boss went ape when he saw the sales report."}, {"viet": "Đồ đồng cần phải đánh bóng-nó xỉn quá rồi.", "eng": "The brass needs polishing-it's badly tarnished."}, {"viet": "Viên đạn đi chệch ông ta chừng hai insơ.", "eng": "The bullet missed him by two inches."}, {"viet": "Trại sắp xếp hệ thống kèm người cho những người bơi lội ở hồ.", "eng": "The camp uses a buddy system for swimmers in the lake."}, {"viet": "Loại ô tô ấy có thể có đồ bọc lót đệm màu đen hoặc đỏ.", "eng": "The car is available with black or red trim."}, {"viet": "Vụ án đó sẽ được đưa ra xét xử vào tháng tới.", "eng": "The case comes to trial next month."}, {"viet": "Bài phát biểu ngắn của vị chủ tịch đã tóm lược những quan điểm của ủy ban.", "eng": "The chairman's short statement encapsulates the views of the committee."}, {"viet": "Tình cảm của đứa bé phải chịu đựng sự ức chế liên tục.", "eng": "The child's affections were kept under continual restraint."}, {"viet": "Đứa trẻ miễn cưỡng rời mẹ nó.", "eng": "The child was reluctant to leave her mother."}, {"viet": "Trẻ em thích chơi ngoài trời.", "eng": "The children love playing out in the open."}, {"viet": "Tiếng đồng hồ nhà thờ đổ dồn.", "eng": "The chime of church of the clock."}, {"viet": "Tiếng lọc cọc của chiếc máy điều hoà nhiệt độ cũ kỹ.", "eng": "The clatter of the antiquated air conditioning machine."}, {"viet": "Chiếc áo khoác hơi bị ngắn ống tay.", "eng": "The coat is rather short in the sleeves."}, {"viet": "Uỷ ban cuối cùng đã tán thành đề nghị của bộ trưởng.", "eng": "The committee came out in favor of the minister's proposals."}, {"viet": "Công ty ấy sẵn sàng từ bỏ cái danh tiếng là kinh doanh các hàng sang trọng để quay sang kinh doanh các mặt hàng hấp dẫn lớp thanh thiếu niên hơn.", "eng": "The company is prepared to trade off its up-market image against a stronger appeal to teenage buyers."}, {"viet": "Giáo đoàn cúi đầu đọc kinh.", "eng": "The congregation bowed their heads in prayer."}, {"viet": "Mục trao đổi thư từ của tờ Thời báo.", "eng": "The correspondence columns of The Times."}, {"viet": "Miền quê bị phủ tuyết.", "eng": "The countryside was blanketed with snow."}, {"viet": "Cuộc khủng hoảng có nguy cơ bùng nổ thành nội chiến.", "eng": "The crisis is in danger of boiling over into civil war."}, {"viet": "Tác dụng chữa bệnh của nước chanh đối với người thiếu vitamin C.", "eng": "The curative effects of lemon juice on scurvy victims."}, {"viet": "Người quản lý ban ngày làm hết các công việc văn phòng rồi.", "eng": "The day manager does all the office work."}, {"viet": "Sự đòi hỏi một cuộc bầu cử tăng lên đến đỉnh điểm.", "eng": "The demand for an election rose to a crescendo."}, {"viet": "Nhà độc tài ngăn chặn mọi chống đối được coi là bất hợp pháp.", "eng": "The dictator represses all opposition as illegal."}, {"viet": "Tiếng súng máy nổ ran ở xa xa.", "eng": "The distant crackle of machine-gun fire."}, {"viet": "Bác sĩ sẽ lại ghé thăm tối nay.", "eng": "The doctor will look in again this evening."}, {"viet": "Con chó đang hít đánh hơi ở cái cột đèn.", "eng": "The dog was sniffing at the lamp-post."}, {"viet": "Người lái xe bị bắt vì tội ngộ sát.", "eng": "The driver was arrested on a charge of manslaughter."}, {"viet": "Vị chủ bút đang thiếu bài để đăng trên số ra tháng Năm.", "eng": "The editor is short of contributions for the May issue."}, {"viet": "Quân địch bao vây thành phố và chỉ đạo một cuộc chiến tranh tiêu hao.", "eng": "The enemy surrounded the town and conducted an war of attrition."}, {"viet": "Tính đạo lý về quyết định của ông ta là đáng nghi ngờ.", "eng": "The ethics of his decision are doubtful."}, {"viet": "Những người thám hiểm lả đi vì đói và rét.", "eng": "The explorers were faint from hunger and cold."}, {"viet": "Cả gia đình đang ngồi tại bàn ăn.", "eng": "The family was sitting at the kitchen table."}, {"viet": "Trong số các vận động viên có ba người giữ kỷ lục thế giới.", "eng": "The field includes three world record holders."}, {"viet": "Tỉ số cuối cùng là 4-3.", "eng": "The final score was 4-3."}, {"viet": "Công ty sẽ được tiếp thêm sức mạnh bằng những khoản tiền mới được rót vào.", "eng": "The firm would be revitalized by an injection of new funds."}, {"viet": "Những kẻ phiến loạn chạy trốn đã tìm được nơi nương náu trong nhà thờ gần đó.", "eng": "The fleeing rebels found a sanctuary in the nearby church."}, {"viet": "Bộ trưởng ngoại giao là thành viên của chính phủ phụ trách công việc ngoại giao.", "eng": "The Foreign Minister is the member of the cabinet responsible for foreign affair."}, {"viet": "Toàn bộ trọng trách đưa ra quyết định đổ lên đầu bà ta.", "eng": "The full weight of decision-making falls on her."}, {"viet": "Các con ngỗng bay thành hình chữ V.", "eng": "The geese were flying in a V."}, {"viet": "Thủ môn đã tìm cách cứu nguy được cú sút ở cự ly gần.", "eng": "The goalie managed to save a shot struck at close range."}, {"viet": "Chính phủ không giành được số phiếu tuyệt đối.", "eng": "The government does not have an overall majority."}, {"viet": "Chính phủ phải tiếp tục thuyết phục những người hoài nghi rằng chính sách của chính phủ sẽ đưa đến kết quả.", "eng": "The government must still convince the sceptics that its policy will work."}, {"viet": "Con chim lớn đứng trên không trên cánh đồng để rình chuột.", "eng": "The great bird hovered above the field looking for a mouse."}, {"viet": "Người khách trọ đã đợi bữa ăn sáng một tiếng.", "eng": "The guest has been waiting for the breakfast for an hour."}, {"viet": "Ông hiệu trưởng dùng roi đánh học trò vì tội không vâng lời.", "eng": "The headmaster caned the boys for disobedience."}, {"viet": "Người đi du ngoạn ngừng lại một lúc để thưởng thức những âm thanh của rừng sâu.", "eng": "The hiker paused pleasuring in the sounds of the forest."}, {"viet": "Ánh nắng nóng đã làm lá héo đi.", "eng": "The hot sun had withered the leaves."}, {"viet": "Ngôi nhà đó hơi thụt vào xa con đường.", "eng": "The house stands back a little from the road."}, {"viet": "Việc nhận dạng các nạn nhân trong vụ tai nạn đã mất một thời gian.", "eng": "The identification of the accident victims took some time."}, {"viet": "Dân ở nơi đó dễ mắc bệnh thấp khớp do khí hậu ẩm thấp.", "eng": "The inhabitants are predisposed to rheumatism by the damp climate."}, {"viet": "Việc phát minh ra máy cán bông đã cách mạng hoá công nghiệp bông ở Anh.", "eng": "The invention of the cotton gin revolutionised the cotton industry in Great Britain."}, {"viet": "Phán quyết của quan toà là bồi thường thiệt hại cho bị cáo.", "eng": "The judge's decision was to award damages to the defendant."}, {"viet": "Lời tuyên bố từ bỏ ngai vàng của nhà vua.", "eng": "The king's renunciation of the throne."}, {"viet": "Đợt nung đồ gốm lần cuối cùng luôn luôn là giai đoạn kết thúc.", "eng": "The last firing always the last step."}, {"viet": "Thời tiết là điều chúng ta ít lo lắng nhất.", "eng": "The least worry we have is about the weather."}, {"viet": "Đèn trong phòng tắm không sáng.", "eng": "The light in the bathroom doesn't turn on."}, {"viet": "Cái vẻ ngây thơ mà cô ta khoác lên mình đã làm tất cả chúng tôi bị mắc lừa.", "eng": "The look of innocence she assumed had us all fooled."}, {"viet": "Quan toà ban lệnh bắt anh ta.", "eng": "The magistrate issued a warrant for his arrest."}, {"viet": "Ông giám đốc không thể đến dự nhưng ông đã cử viên phó của mình đại diện.", "eng": "The manager was unable to attend but sent his deputy as a substitute."}, {"viet": "Những ngôi nhà nhỏ tiều tuỵ nơi những người cùng khổ đang sống.", "eng": "The mean little houses where the poorest people live."}, {"viet": "Những người mà họ muốn gặp anh.", "eng": "The men who wanted to meet you."}, {"viet": "Dấu hiệu không rõ ràng làm tôi lạc lối.", "eng": "The misleading sign led me astray."}, {"viet": "Buổi sáng hé rạng tươi sáng sau cơn bão.", "eng": "The morning dawned fresh and clear after the storm."}, {"viet": "Bùn và đá bị nghiền nát được rửa sạch còn lại kim cương.", "eng": "The mud and crushed rock are washed away, and the diamonds are left."}, {"viet": "Các cuộc thương thuyết được che đậy bí mật.", "eng": "The negotiations were cloaked in secrecy."}, {"viet": "Những chiếc máy mới làm cho chúng tôi có thể cắt và bó lúa mạch nhanh chóng.", "eng": "The new machines enable us to cut and tie up our wheat quickly."}, {"viet": "Cuộc đua ngựa có thưởng ở Newmarket luôn là một cuộc đua được dân chúng ưa thích.", "eng": "The Newmarket stakes is always a popular race."}, {"viet": "Bầu trời ban đêm thay đổi theo mùa.", "eng": "The night sky changes with the seasons."}, {"viet": "Các nhà tu nữ sống trong nhà tu nữ gần nhà thờ.", "eng": "The nuns lived in the convent close to the church."}, {"viet": "Tên khổng lồ tàn ác bẻ tay chân các nạn nhân của nó trước khi ăn thịt họ.", "eng": "The ogre dismembered his victims before he ate them."}, {"viet": "Thế vận hội Olympic bắt đầu bằng cuộc diễu hành của tất cả các nước tham gia.", "eng": "The Olympic Games began with a parade of all the competing nations."}, {"viet": "Còn người chị kia học ở Trường Đại học Waseda.", "eng": "The other goes to Waseda University."}, {"viet": "Chứng liệt đã ảnh hưởng đến chân phải của ông ấy làm cho ông chỉ có thể đi lại được một cách khó khăn.", "eng": "The paralysis affects his right leg and he can only walk with difficulty."}, {"viet": "Các luật sư của bệnh nhân đó phát ra một trát đòi bác sĩ ra hầu tòa, nêu ra tội bất cẩn.", "eng": "The patient's solicitors issued a writ against the doctor, alleging negligence."}, {"viet": "Dân chúng bị diễn giả kích động trở thành cuồng nhiệt.", "eng": "The people were whipped up into a frenzy by the speaker."}, {"viet": "Bức tranh thấy đẹp nổi bật hẳn lên trên bức tường trơn.", "eng": "The picture may be seen to its best advantage against a plain wall."}, {"viet": "Kế hoạch qua mặt ủy ban thường trực Thượng Viện đã gặp sự phản kháng tức thời của một vài chủ tịch thuộc đảng Cộng Hoà.", "eng": "The plan to end-run the regular Senate committee ran into instant resistance from some of their new Republican chairmen."}, {"viet": "Vở kịch đó đã diễn sáu tháng.", "eng": "The play had a run of six months."}, {"viet": "Hiện giờ cảnh sát sắp phát hiện được tên tội phạm đó.", "eng": "The police are now on the scent of the culprit."}, {"viet": "Chiếc xuồng cảnh sát hô chúng tôi dừng lại.", "eng": "The police launch hailed to us to come to."}, {"viet": "Viên cảnh sát được cho 500 pao hối lộ để im miệng.", "eng": "The policeman was given a bribe of 500 pounds to keep his mouth shut."}, {"viet": "Người phát thư đã mang đến cho bạn một gói bưu kiện.", "eng": "The postman has brought a parcel for you."}, {"viet": "Tổng thống khẳng định sự cam kết của Mỹ đối với các đồng minh bên kia Đại Tây Dương.", "eng": "The President affirmed America's commitment to its transatlantic allies."}, {"viet": "Giá của kỳ đi nghỉ không bao gồm tiền phòng.", "eng": "The price of the holiday is exclusive of accommodation."}, {"viet": "Người tù nhân không tỏ vẻ ân hận vì tội ác của mình.", "eng": "The prisoner shows no remorse for his crime."}, {"viet": "Người chắc chắn sẽ được bổ nhiệm vào vị trí đó.", "eng": "The prohibitive favourite to win the nomination."}, {"viet": "Công chúng không hoàn toàn đánh giá được loại hình nghệ thuật này.", "eng": "The public is not quite attuned to this kind of art."}, {"viet": "Nữ hoàng lên ngôi ở một nhà thờ cổ nhất thành phố.", "eng": "The Queen was enthroned in the city's most ancient church."}, {"viet": "Tỷ lệ lạm phát tăng lên 2%.", "eng": "The rate of inflation has increased by 2%."}, {"viet": "Những người di tản sống trong khu đất của đền được yêu cầu không được báng bổ đền bằng cách ăn thịt sống.", "eng": "The refugees housed in the temples premises, were requested not to defile it by eating flesh."}, {"viet": "Sự hưởng ứng của dân chúng đối với lời kêu gọi cứu đói là tức thì.", "eng": "The response of the people to the famine appeal was immediate."}, {"viet": "Quyền khen chê một tác phẩm văn học.", "eng": "The right to praise or blame a literary work."}, {"viet": "Con đường quá hẹp, xe hơi không đi qua được.", "eng": "The road was too narrow for cars to pass."}, {"viet": "Đường đi đó đã được đánh dấu để dễ đi theo.", "eng": "The route has been marked so that it is easy to follow."}, {"viet": "Việc bán ma túy bị luật pháp cấm.", "eng": "The sale of narcotics is proscribed by law."}, {"viet": "Trường ở phía tay trái đường và nhà anh ấy ở phía tay phải.", "eng": "The school is on the left of the road, and his house is on the right."}, {"viet": "Bác sỹ tự xưng là Smith không bao giờ học ở Đại học.", "eng": "The self-styled Dr Smith has never been at university."}, {"viet": "Sự hứng khởi hoàn toàn do bản năng về một cuộc đi chơi bằng xe máy.", "eng": "The sheer visceral excitement of a motor-bike ride."}, {"viet": "Lại trông thấy bà ta làm tôi sửng sốt suýt giật nảy mình.", "eng": "The shock of seeing her again made me nearly jump out of my skin."}, {"viet": "Biển đề:'Đi về bên trái', nên tôi không nghĩ rằng chúng ta có thể rẽ phải ở đây được.", "eng": "The sign says'Keep Left', so I don't think we can turn right here."}, {"viet": "Những đám mây nhỏ không đem lại cơn mưa may mắn.", "eng": "The small clouds did not bring blessed rain."}, {"viet": "Những người lính đó nhúng tay vào nước.", "eng": "The soldiers imbrue then hands in the water."}, {"viet": "Diễn giả vẫn đi miên man lạc ra ngoài vấn đề.", "eng": "The speaker kept wandering off away from the point."}, {"viet": "Tiết mục chính trong buổi biểu diễn của chúng tôi tối nay sẽ là nhóm nhào lộn Trung Quốc.", "eng": "The star turn in our show tonight will be a group of Chinese acrobats."}, {"viet": "Truyện được đơn giản hoá để trẻ em dễ đọc.", "eng": "The story has been simplified so that children can read it."}, {"viet": "Phong cách nói của anh ấy hoàn toàn trái với của tôi.", "eng": "The style of his speech was in complete antithesis to mine."}, {"viet": "Cuộc điều tra cho thấy ngôi nhà này ẩm thấp.", "eng": "The survey revealed that the house was damp."}, {"viet": "Tôi biết nhà trường sẽ đóng cửa một ngày vào tuần tới.", "eng": "The teacher informed us that the school would be closed for one day next week."}, {"viet": "Tối qua nhiệt độ tụt một cách rõ rệt.", "eng": "The temperature dropped appreciably last night."}, {"viet": "Bọn ăn trộm cãi nhau về cách chia của cướp được.", "eng": "The thieves quarrel with one another about how to divide the loot."}, {"viet": "Những đảng viên Đảng bảo thủ trong nhiệm kỳ ba sẽ thắng thế.", "eng": "The Tories in their third term will be unstoppable."}, {"viet": "Con tàu đi nhanh quá chúng tôi có ảo giác là nó đang bay.", "eng": "The train went so fast we had the illusion that it was flying."}, {"viet": "Những cuộc đua môtô giành Cúp Người du lịch ở trên đảo Man.", "eng": "The TT motorcycle races on the Isle of Man."}, {"viet": "Hai tuyên bố mâu thuẫn nhau.", "eng": "The two statements contradict each other."}, {"viet": "Kết quả của sự bất đồng ý kiến là một luật lệ mới.", "eng": "The upshot of the disagreement was a new law."}, {"viet": "Tên côn đồ trong làng nổi tiếng vì thói hung bạo của nó.", "eng": "The village thug was known for his uncouth ways."}, {"viet": "Nước luồn qua khe rồi chảy xuống đồng bằng.", "eng": "The water funnelled through the gorge and out onto the plain."}, {"viet": "Toàn bộ khu vực ở vào một tình trạng hết sức tồi tệ.", "eng": "The whole district is in a terribly run-down state."}, {"viet": "Thời gian thắng cuộc là 1 phút 5 giây.", "eng": "The winning time was 1 minute 5 seconds."}, {"viet": "Những người thợ ở trần đến thắt lưng.", "eng": "The workmen were stripped to the waist."}, {"viet": "Lời kêu gợi tài trợ của họ không được đáp ứng là bao.", "eng": "Their appeal for funds didn't elicit much a response."}, {"viet": "Cuộc hôn nhân của họ đã trở thành một thứ hoàn toàn giả tạo.", "eng": "Their marriage had become a complete sham."}, {"viet": "Vậy ông nghĩ có cần thiết để xem xét lại bản hợp đồng hiện tại không vì tháng tới là nó hết hạn rồi?", "eng": "Then do you think it necessary to reconsider the present contract since it's going to expire next month?"}, {"viet": "Tuần tới có một trận giao hữu giữa Leeds United và Manchester City.", "eng": "There's a friendly match between Leeds United and Manchester City next week."}, {"viet": "Không có cầu, chúng ta sẽ phải lội qua ( dòng suối ).", "eng": "There's no bridge, we'll have to wade across ( the stream )."}, {"viet": "Đầu máy có cái gì hỏng hóc.", "eng": "There's something wrong with the wrong time."}, {"viet": "Các tế bào thực vật và động vật còn vô số hình dạng khác nữa.", "eng": "There are many other shapes of both plant and animal cells, too."}, {"viet": "Có hai cuộn băng, em muốn xem cuộn nào?", "eng": "There are two, which one do you want to see?"}, {"viet": "Dưới tiền sảnh có chi nhánh của Ngân hàng Trung Quốc.", "eng": "There is a branch of the Bank of China down in the lobby."}, {"viet": "Càng ngày sự mất kiên nhẫn càng tăng trước sự bất lực của chính phủ trong việc giải quyết vấn đề đó.", "eng": "There is growing impatience at the government's inability to solve the problem."}, {"viet": "Không có đủ chỗ cho chúng ta, nói chi đến sáu con chó và một con mèo nữa.", "eng": "There isn't enough room for us, let alone six dogs and one cat."}, {"viet": "Có một báo cáo về tin một người tù bỏ trốn.", "eng": "There was a report on the news about an escaped convict."}, {"viet": "Chúng tôi nhảy mãi đến tận sáng sớm.", "eng": "There we were, bopping away till the small hours."}, {"viet": "Không cần phải bận tâm đến phí tổn nếu như anh không phải trả tiền!", "eng": "These's no need to mind the expense if you're not paying!"}, {"viet": "Những ý kiến này đang được lưu hành trong một thời gian.", "eng": "These ideas have been in circulation for some time."}, {"viet": "Ba người này chịu trách nhiệm cho cả nhóm.", "eng": "These three are answerable to the whole group."}, {"viet": "Kể từ lần cuối cùng tôi gặp họ đến giờ, họ đã ăn nên làm ra.", "eng": "They've come up in the world since I last met them."}, {"viet": "Họ sẽ đi nghỉ hai tuần.", "eng": "They are going on holiday for two weeks."}, {"viet": "Chúng hít thở ô-xy, một trong các khí tạo thành không khí.", "eng": "They breathe in oxygen, one of the gases the air is made of."}, {"viet": "Họ nhảy múa thành một vòng tròn quanh những người đánh trống.", "eng": "They dance in a circle around the drummers on the outside."}, {"viet": "Họ sẽ đứng trước một cái chết chắc chắn nếu như họ không được cứu thoát hôm nay.", "eng": "They face certain death unless they can be rescued today."}, {"viet": "Họ không dám thở khi có người đi qua cửa.", "eng": "They hardly dared breathe as somebody walked past the door."}, {"viet": "Họ đưa người bị kết án lên đoạn đầu đài.", "eng": "They led the condemned man to the scaffold."}, {"viet": "Họ cần một ngôi nhà rộng vì họ có tới chín đứa con.", "eng": "They need a large house because they have nine children."}, {"viet": "Chúng nổi tiếng khắp thế giới.", "eng": "They're famous throughout the world."}, {"viet": "Họ tỏ ra hoàn toàn vô tư khi thảo luận các vấn đề nhạy cảm này.", "eng": "They showed complete impartiality in discussing these sensitive issues."}, {"viet": "Trước đây họ là bạn của nhau, nhưng bây giờ thì đã xa nhau rồi.", "eng": "They used to be friends, but now they've drifted apart."}, {"viet": "Họ đã bị đuổi khỏi căn hộ vì không trả tiền thuê nhà.", "eng": "They were evicted from their flat for not paying the rent."}, {"viet": "Họ thắng trận vì quân họ đông hơn rất nhiều.", "eng": "They won the battle because of their massive superiority in numbers."}, {"viet": "Chiếc áo khoác này cần phải được làm xong hoàn toàn tôi mới mặc.", "eng": "This blouse needs to be finished off before I can wear it."}, {"viet": "Nước này đứng hàng cuối cùng về sản lượng công nghiệp.", "eng": "This country ranks last in industrial output."}, {"viet": "Quả này chưa chín-chúng ta không ăn được.", "eng": "This fruit isn't ripe yet-we can't eat it."}, {"viet": "Đây là danh thiếp của tôi, và tôi là Trương Quang Thu.", "eng": "This is my card, and I'm Kwang-chiu Chang."}, {"viet": "Diễn biến mới đây nhất càng củng cố thêm quyết tâm ra đi của tôi.", "eng": "This latest development has further strengthened my determination to leave."}, {"viet": "Cái này khá hơn cái kia một chút nhưng cũng không hơn nhiều.", "eng": "This ones slightly better than that, but not much."}, {"viet": "Nhà hàng này có những món ăn Pháp rất ngon.", "eng": "This restaurant serves gourmet French dishes."}, {"viet": "Sự kiện khủng khiếp này mãi mãi khắc sâu trong tâm trí tôi.", "eng": "This terrible event is etched forever on my memory."}, {"viet": "Những đứa trẻ kia đang ngồi tên đất.", "eng": "Those kids are sitting on the ground."}, {"viet": "Hôm nay là ngày thu rác, phải không?", "eng": "Today is garbage day, isn't it?"}, {"viet": "Anh biết đấy, sự thật bao giờ cũng lạ lùng hấp dẫn hơn những điều tưởng tượng.", "eng": "Truth is stranger than fiction, you know."}, {"viet": "Tội ác hung bạo lên đến mức không thể chấp nhận được.", "eng": "Violent crime has reached an unacceptable level."}, {"viet": "Chúng ta hãy nên nằm án binh cho đến khi sự phản đối ầm ĩ của quần chúng lắng xuống.", "eng": "We'd better keep a low-profile until the public outer has died down."}, {"viet": "Tất cả chúng tôi đều hết lòng ủng hộ anh-chúc anh may mắn trong cuộc phỏng vấn tuyển người vào làm việc!", "eng": "We're all rooting for you-good luck with your job interview!"}, {"viet": "Chúng tôi xin chịu trách nhiệm về sự hư hại này theo những điều kiện được ghi trên bảng kê quần áo giặt ủi.", "eng": "We're responsible for the damage according to the conditions on your laundry list."}, {"viet": "Chúng tôi đã đặt một máy tê-lếch mới trong văn phòng.", "eng": "We've installed a new telex in the office."}, {"viet": "Chúng tôi đã làm trước họ và chiếm lấy cái cầu.", "eng": "We anticipated them and seized the bridge."}, {"viet": "Chúng tôi rất lấy làm tiếc về sự chậm trễ này.", "eng": "We are very sorry for the delay."}, {"viet": "Chúng tôi có thể trả một món tiền nào đó trước cho thẻ tín dụng của ông.", "eng": "We can advance a certain sum of money against your credit card."}, {"viet": "Chúng tôi thường xuyên kiểm tra chất lượng sản phẩm của chúng tôi.", "eng": "We conduct regular checks on the quality of our products."}, {"viet": "Chúng tôi không có cuốn sách đó trong kho nhưng chúng tôi có thể đặt mua được.", "eng": "We don't have the book in stock but we can order it."}, {"viet": "Chúng tôi được một bữa ăn tối khi chúng tôi làm ca muộn.", "eng": "We get an evening meal when we're on the late shift."}, {"viet": "Chúng tôi đã phải vét tất cả để lập cho đủ một đội và thế là chúng tôi đã thua với tỷ số 6-1.", "eng": "We had to scrape the barrel to get a full team, and then we lost 6-1."}, {"viet": "Bây giờ thì chúng tôi không có chỗ trống, song chắc chắn là tôi sẽ nhớ đến đơn xin việc của anh.", "eng": "We have no vacancies now, but we'll certainly bear you application in mind."}, {"viet": "Chúng tôi đã mời Bill, Tom và Sue-người cuối cùng là em gái Bill.", "eng": "We invited Bill, Tom and Sue-the last being Bill's sister."}, {"viet": "Chúng ta nhượng bộ để giữ lấy hoà bình.", "eng": "We made concessions for the sake of peace."}, {"viet": "Chúng ta cũng không thể loại trừ khả năng là đứa bé đã cao chạy xa bay.", "eng": "We must not exclude the possibility that the child has run away."}, {"viet": "Chúng tôi mới chuyển nhà tuần trước nên chưa yên nơi ăn chốn ở.", "eng": "We only moved house last week and we haven't settled in yet."}, {"viet": "Chúng tôi hát những câu đó theo điệu Doodle Mỹ.", "eng": "We sang these lines to the tune of Yankee Doodle."}, {"viet": "Chúng tôi đã dùng thời gian còn lại trong ngày đó đi vãn cảnh.", "eng": "We spent the remainder of the day sightseeing."}, {"viet": "Chúng tôi thề tiếp tục chiến đấu cho đến khi tất cả những đòi hỏi của chúng tôi được đáp ứng.", "eng": "We vowed to fight on until all our demands were met."}, {"viet": "Chúng tôi được trao toàn quyền trang trí lại khách sạn.", "eng": "We were given carte blanche to redecorate the hotel."}, {"viet": "Chúng tôi sẽ rút lại bảng giá này nếu nó không được chấp nhận trong hai tháng.", "eng": "We will withdraw this offer if it is not accepted within two months."}, {"viet": "À, tôi muốn gặp giám đốc về những hợp đồng máy dệt.", "eng": "Well, I'd like to see the manager about contracts for textile machinery."}, {"viet": "Để được như chú Ned phải cần đến toán học rất nhiều.", "eng": "Well, Uncle Ned needed lots of math."}, {"viet": "Chữ to travel tiếng Việt là gì?", "eng": "What's the word for to travel in Vietnamese?"}, {"viet": "Anh đang làm gì ở loanh quanh đây?", "eng": "What are you doing in this neck of the woods?"}, {"viet": "19 giờ 10 anh nói làm sao?", "eng": "What do you say for nineteen ten?"}, {"viet": "Cơ quan anh vào làm việc lúc mấy giờ?", "eng": "What is clocking-in time at your office?"}, {"viet": "Theo bạn thế nào là một người bạn đích thực?", "eng": "What is your definition of a true friend?"}, {"viet": "Tỷ lệ thu nhập của nó phải đóng thuế là bao nhiêu?", "eng": "What percentage of his income is taxable?"}, {"viet": "Khi bạn 10 tuổi, bạn đi ngủ lúc mấy giờ?", "eng": "What time was your bedtime when you were ten years old?"}, {"viet": "Anh đi nghỉ về khi nào?", "eng": "When did you get back from your holiday?"}, {"viet": "Khi tôi nói có một số người ngốc nghếch, tôi không ám chỉ đến anh.", "eng": "When I said some people are stupid, I wasn't referring to you."}, {"viet": "Khi cuộc chiến đấu kết thúc, ta sẽ thanh toán công việc với bọn theo địch.", "eng": "When the fighting is over, we'll reckon with the enemy's sympathizers."}, {"viet": "Khi rượu lên men, nó tạo ra những bong bóng khí.", "eng": "When wine is fermented it gives off bubbles of gas."}, {"viet": "Bạn muốn khiêng nó để đâu?", "eng": "Where do you want to take it?"}, {"viet": "Tôi sẽ lên tàu ở sân ga nào vậy?", "eng": "Which flatform shall I get on board, please?"}, {"viet": "Whisky thường được liên hệ với xứ Xcốt-len.", "eng": "Whisky is usually associated with Scotland."}, {"viet": "Ai là người lãnh xướng trong album nhạc mới đây nhất của nhóm?", "eng": "Who was on sang lead vocal on the group's last record?"}, {"viet": "Tại sao họ không thích nhau nhỉ?", "eng": "Why don't they like each other?"}, {"viet": "Liệu cái va li này có đựng được hết quần áo của tôi không?", "eng": "Will this suitcase hold all my clothes?"}, {"viet": "Vào thời điểm đó lên giây đồng hồ treo có nghĩa là nhấc quả nặng lên tại vị trí khởi hành của nó.", "eng": "Winding the clock in those days meant lifting up the weight to its starting point."}, {"viet": "Gia đình bạn đông người, có lẽ đó chính là căn hộ bạn cần.", "eng": "With your large family, it might be just what you need."}, {"viet": "Bạn có tự cho mình là người ham đọc sách không?", "eng": "Would you call yourself an avid reader?"}, {"viet": "Bạn có muốn xuất bản một quyển sách hay phát hành một đĩa nhạc không?", "eng": "Would you like to publish a book or release a CD?"}, {"viet": "Chà, mẹ giỏi toán thật đấy.", "eng": "Wow, mom you really are good in math."}, {"viet": "Có, tôi có một đứa em trai và một đứa em gái.", "eng": "Yes, I have one brother and one sister."}, {"viet": "Trước hết anh nên cam kết trên giấy trắng mực đen đã.", "eng": "You'd better get a commitment in black and white first."}, {"viet": "Anh không bao giờ đuổi kịp được anh ấy đâu, dù có cố gắng đến mấy.", "eng": "You'll never catch him however hard you try."}, {"viet": "Anh chắc chắn được về hưu.", "eng": "You've certainly earned your retirement."}, {"viet": "Không thể bạ ai cũng mời đến cuộc liên hoan được.", "eng": "You can't ask just anybody to the party."}, {"viet": "Ông có thể chọn cách nấu nào ông muốn.", "eng": "You can choose which way you want it cooked."}, {"viet": "Anh không thể làm chủ được số mệnh của mình.", "eng": "You cannot be the master of your own fate."}, {"viet": "Anh lo đồ uống còn tôi chuẩn bị đồ ăn.", "eng": "You get the drink, and I'll organize the eats."}, {"viet": "Anh biết đấy, thiết bị trở nên quá nóng thì dây điện bắt đầu cháy.", "eng": "You know, equipments get too hot, wires start burning."}, {"viet": "Xin anh hãy vui lòng ghé lại siêu thị để đón tôi.", "eng": "You might just call in at the supermarket for me."}, {"viet": "Anh không được lái xe, anh đang say mèm!", "eng": "You mustn't drive, you're too far gone!"}, {"viet": "Anh nên tích luỹ theo cách này.", "eng": "You should accrue more interest this way."}, {"viet": "Anh không nên nhất quyết chống lại mọi hình thức của sự tiến bộ.", "eng": "You shouldn't set your face against all forms of progress."}, {"viet": "Anh sẽ phải trả 50 pao đầu tiên trong số phí tổn chữa chiếc xe ô tô hỏng của anh vì số tiền thoả thuận trả bảo hiểm trong hợp đồng của anh là 50 pao.", "eng": "You will have to pay the first 50 pounds of the cost of repairing your damaged car as there is an excess of 50 pounds on your policy."}, {"viet": "Sự hợp tác của ông có ý nghĩa rất nhiều đối với chúng tôi.", "eng": "Your cooperation means a great deal to us."}, {"viet": "Da của anh bắt đầu nhăn lại khi anh già hơn.", "eng": "Your skin starts to sag as you get older."}]