[{"viet": "Một vận đơn đã được phát hành hôm nay.", "eng": "A bill of lading has already been issued today."}, {"viet": "Một khoản chi phí 1, 90 bảng Anh sẽ được tính tròn lên thành 2 bảng Anh, và một khoản chi phí 3, 10 bảng Anh tính tròn xuống thành 3 bảng Anh.", "eng": "A charge of 1.90 will rounded up to 2, and one of 3.10 rounded down to 3."}, {"viet": "Một cuộc giả tạo phản ứng hạt nhân bằng máy vi tính.", "eng": "A computer simulation of the nuclear reaction."}, {"viet": "Một khu rừng tối tăm mà ở trong đó nhiều nguy hiểm đang rình rập.", "eng": "A dark forest wherein dangers lurk."}, {"viet": "Con chó đánh hơi ở một cái cột đèn.", "eng": "A dog smelling at a lamp-post."}, {"viet": "Một cánh đồng đầy hoa dại.", "eng": "A field profuse with wild flowers."}, {"viet": "Cuộc chiến tranh hạt nhân trên quy mô toàn diện có thể dẫn đến việc hủy hoại hoàn toàn loài người.", "eng": "A full-scale nuclear war could lead to the annihilation of the human race."}, {"viet": "Sự di chuyển dần của dân từ nông thôn ra thành thị.", "eng": "A gradual shift of people from the country to the town."}, {"viet": "Một hàng rào cao bảo vệ ngôi nhà khỏi những kẻ xâm nhập.", "eng": "A high fence that safeguard the house against intruders."}, {"viet": "Một quan tòa phải không được có thành kiến.", "eng": "A judge must be free from prejudice."}, {"viet": "Bản dịch thoát cho thấy tư tưởng tổng quát về các ý định của tác giả.", "eng": "A liberal translation giving a general idea of the writer's intentions."}, {"viet": "Một người ủng hộ trung thành của đảng Lao động.", "eng": "A loyal supporter of the Labour Party."}, {"viet": "Một hội viên giới quý tộc Anh.", "eng": "A member of the British nobility."}, {"viet": "Quốc dân đại hội đã thảo luận hiến pháp mới.", "eng": "A national assembly debated the new constitution."}, {"viet": "Một viên đá nặng một cara là khá lớn đối với một chiếc nhẫn.", "eng": "A one-carat stone is rather large for a ring."}, {"viet": "Một người có tiểu não bị tổn thương sẽ cử động theo kiểu co giật.", "eng": "A person whose cerebellum has been injured moves in a jerky way."}, {"viet": "Một chính khách không đáp ứng với tâm trạng trong nước.", "eng": "A politician who is unresponsive to the mood of the country."}, {"viet": "Chỗ ăn uống tập thể không phải là nơi nói về các việc riêng tư.", "eng": "A public dinner isn't the place at which to talk about one's private affairs."}, {"viet": "Một cuộc hiện đại hóa hệ thống sưởi.", "eng": "A retrofit for the heating system."}, {"viet": "Một trường học có danh tiếng xuất sắc.", "eng": "A school with an excellent reputation."}, {"viet": "Một sự thiếu lương thực trong một vài quốc gia.", "eng": "A shortage of food in some countries."}, {"viet": "Sự can đảm của một người lính được thử thách nơi chiến trường.", "eng": "A soldier's courage is put to the proof in battle."}, {"viet": "Một câu chuyện làm chúng tôi rơi nước mắt.", "eng": "A story that reduced us to tears."}, {"viet": "Một máy thu băng đang ở vị trí thu.", "eng": "A tape recorder in recording mode."}, {"viet": "Một hành động phản nghịch như sự làm gián điệp.", "eng": "A treasonable act as such as espionage."}, {"viet": "Một dung dịch nước muối loãng.", "eng": "A weak solution of salt and water."}, {"viet": "Bỏ con thuyền ở chỗ cạn.", "eng": "Abandoned the boat in the shallows."}, {"viet": "Thực ra, nó lớn hơn nhiều so với nhu cầu hiện nay.", "eng": "Actually it's much bigger than it needs to be these days."}, {"viet": "Sau một năm im hơi lặng tiếng, tôi đã nhận được thư của cô ta.", "eng": "After a year's silence, I got a letter from her."}, {"viet": "Sau khi cầu nguyện tôi cảm thấy hồi sinh về mặt tinh thần.", "eng": "After praying, I felt spiritually renewed."}, {"viet": "Sau nhiều năm tháng chiến tranh, nhân dân khát khao hòa bình.", "eng": "After years of fighting the people longed for peace."}, {"viet": "Diogenes nói với Alexander rằng: Tất cả những gì tôi đòi hỏi là ông đừng có đứng chắn giữa tôi và mặt trời.", "eng": "All I ask, said Diogenes, it that you do not stand between me and the sun."}, {"viet": "Tất cả những kịch tính của phiên xử vụ giết người nghiêm trọng.", "eng": "All the melodrama of a major murder trial."}, {"viet": "Mặc dù cô ta cảm thấy mệt, cô ta vẫn cứ đi làm.", "eng": "Although she felt ill, she still went to work."}, {"viet": "Một người ham nhục dục liều lĩnh, cứ tiếp tục sa đà vào tất cả các nguồn lạc thú đủ loại.", "eng": "An adventurous voluptuary, angling in all streams for variety of pleasures."}, {"viet": "Trận động đất đã để lại cảnh đổ nát cho toàn thành phố.", "eng": "An earthquake left the whole town in ruins."}, {"viet": "Một sự gia tăng tội ác là một trong những hậu quả phụ của nạn thất nghiệp.", "eng": "An increase in crime is one of the by-products of unemployment."}, {"viet": "Một chỗ trống trong hãng quảng cáo.", "eng": "An opening in an advertising agency."}, {"viet": "Số tháng mặt trăng không bằng nhau theo từng năm.", "eng": "And moon months do not fit evenly into years."}, {"viet": "Một loại chi phiếu khác được chấp nhận rộng rãi hơn được gọi là chi phiếu du lịch.", "eng": "Another type of check which is more acceptable is called a traveller's check."}, {"viet": "Tất cả các món quà này dành cho tôi phải không?", "eng": "Are all these presents for me?"}, {"viet": "Anh có biết người ta coi hành vi đó là như thế nào không?", "eng": "Are you conscious of how people will regard such behaviour?"}, {"viet": "Bạn có theo kịp khuynh hướng kinh doanh hiện thời không?", "eng": "Are you up-to-date on current business trends?"}, {"viet": "Với tư cách là một diễn viên cô ta tỏ ra có phẩm chất ưu tú thực sự.", "eng": "As an actor she shows real quality."}, {"viet": "Vì không có sữa, chúng ta đành phải uống cà phê đen vậy.", "eng": "As there's no cream, we'll have to content ourselves with black coffee."}, {"viet": "Vào thời cực thịnh của mình đế quốc La Mã bao gồm hầu hết châu Âu.", "eng": "At its zenith the Roman empire covered almost the whole of Europe."}, {"viet": "Việc dự buổi cầu nguyện tối không bắt buộc.", "eng": "Attendance at evening prayers is not compulsory."}, {"viet": "Dễ thương nào, pha cho anh tách trà đi!", "eng": "Be an angel and make me a cup of tea!"}, {"viet": "Phải nên thực tế-em không thể mong hưởng lương hậu ở tuổi mười tám.", "eng": "Be realistic-you can't expect a big salary at eighteen."}, {"viet": "Cách cư xử do sợ hãi mê tín.", "eng": "Behaviour based on fear and superstition."}, {"viet": "Birmingham là thành phố lớn nhất ở nước Anh sau Luân Đôn.", "eng": "Birmingham is the largest city in Britain next to London."}, {"viet": "Việc hối lộ các viên chức và những việc xấu xa khác cần che đậy của chính phủ.", "eng": "Bribery of officials and other skeletons in the governments cupboard."}, {"viet": "Dịch vụ xe buýt trong vùng này đã giảm nhiều.", "eng": "Bus services in this area have been chopped."}, {"viet": "Nhưng nhiều thứ ở đây là thứ tạp nham bỏ đi.", "eng": "But mach of it is junk."}, {"viet": "Mua nhiều cổ phần để đầu cơ.", "eng": "Buy many shares as a speculation."}, {"viet": "Để mở đầu, tôi sẽ giải thích một phần về bối cảnh lịch sử.", "eng": "By way of an introduction, I shall explain some of the historical background."}, {"viet": "Tôi có thể giới thiệu ông vào chân thư ký của câu lạc bộ gôn không?", "eng": "Can I put your name forward for golf club secretary?"}, {"viet": "Bạn có thể xong công việc ngày mai không?", "eng": "Can you finish the work tomorrow?"}, {"viet": "Mỗi đêm bạn ngủ có ngon lắm không?", "eng": "Can you sleep very well every night?"}, {"viet": "Cứ tiếp tục công việc của bạn trong khi tôi đi vắng.", "eng": "Carry on with your work while I'm away."}, {"viet": "Cờ vua là một trò chơi đòi hỏi tập trung cao độ.", "eng": "Chess is a game that calls into play all one's powers of concentration."}, {"viet": "Đeo một chiếc vòng quanh cổ tay ai.", "eng": "Clasp a bracelet round one's wrist."}, {"viet": "Nào, nhanh chân lên, chúng ta muộn rồi đấy.", "eng": "Come on, shake a leg, we're late already."}, {"viet": "Cảnh sát đã rút lui khi chạm trán với một đám đông phẫn nộ.", "eng": "Confronted by an angry crowd the police retreated."}, {"viet": "Tôi đề nghị tổ chức ở Hội trường Hoa Hồng được không ạ?", "eng": "Could I recommend the Rose Hall?"}, {"viet": "Anh vui lòng chỉ cho chúng tôi cách ăn món này?", "eng": "Could you show us how to eat this dish?"}, {"viet": "Nhân viên hải quan giải người đàn ông đó cho cảnh sát.", "eng": "Customs officials turned the man over to the police."}, {"viet": "Sự thất bại trong cuộc bầu cử bổ sung là một trở ngại chính cho đảng cầm quyền.", "eng": "Defeat in the by-election is a major set-back to the ruling party."}, {"viet": "Mặc cho những lời tuyên bố long trọng của họ, họ vẫn vui vẻ chấp nhận sự giúp đỡ của chúng ta.", "eng": "Despite their protestations, they were glad to accept our help."}, {"viet": "Bà có bảo hiểm những viên ngọc trước khi chúng bị trộm không?", "eng": "Did you insure the jewels before they were stolen?"}, {"viet": "Sự bất lương không phải là bản chất của hắn.", "eng": "Dishonesty is foreign to his nature."}, {"viet": "Thôi đừng khoác lác nữa-thật là khó chịu.", "eng": "Do stop showing off-it's embarrassing."}, {"viet": "Bộ mày tưởng tao sẽ uống thứ nước ghê tởm này sao?", "eng": "Do you expect me to drink this vile concoction?"}, {"viet": "Ở nước bạn có nhiều vụ tội phạm liên quan đến băng nhóm phải không?", "eng": "Do you have many gang related crimes in your country?"}, {"viet": "Anh có thích trà của anh ngọt không?", "eng": "Do you like your tea sweet?"}, {"viet": "Bạn có nghĩ rằng tôi có khả năng làm luật sư không?", "eng": "Do you think I have what it takes to be a lawyer?"}, {"viet": "Anh có xem bóng đá trên vô tuyến truyền hình không?", "eng": "Do you watch football on television?"}, {"viet": "Chó vẫy đuôi khi chúng mừng rỡ.", "eng": "Dogs wag their tails when they are pleased."}, {"viet": "Đừng uống trà, chờ cho đến khi nó ngấm hết đã.", "eng": "Don't drink the tea until it has finished infusing."}, {"viet": "Đừng để áo của anh chạm vào tường-sơn còn ướt đấy.", "eng": "Don't let your coat touch the wall-the paint's still wet."}, {"viet": "Đừng có tưởng im lặng là đồng ý.", "eng": "Don't take silence for approval."}, {"viet": "Nghi ngờ báo chí tự do có khả năng xử lý công bằng thông tin đó, tránh không làm cho nó giật gân.", "eng": "Doubted the ability of the liberal press to handle such information fairly, to refrain from sensationalizing it."}, {"viet": "Trong suốt nhiệm kỳ đầu tiên của Tổng Thống.", "eng": "During the President's first term of office."}, {"viet": "Thuê người nào đó làm thử một thời gian.", "eng": "Employ somebody for a trial period."}, {"viet": "Nếu nó không hết, bạn có thể mang nó ra tiệm giặt tẩy.", "eng": "Even if it doesn't, you can take it to the cleaners."}, {"viet": "Mọi việc đang diễn ra tốt đẹp, nhưng rồi chúng tôi đã gặp phải rắc rối.", "eng": "Everything was going well but then we hit trouble."}, {"viet": "Các chuyên gia dẫn chứng tính xác thực của bức họa.", "eng": "Experts vouch for the painting's authenticity."}, {"viet": "Cô ta đã nói ngọt để lọt vào được buổi trình diễn đó.", "eng": "Fast-talked her way into the show."}, {"viet": "Lòng đầy ghê tởm khi thấy việc tàn ác với thú vật.", "eng": "Filled with nausea at the sight of cruelty to animals."}, {"viet": "Năm phiếu thuận, ba phiếu chống và hai phiếu trắng đối với đề nghị đó.", "eng": "Five votes in favour of the proposal, three against and two abstentions."}, {"viet": "Để biết nghĩa các ký hiệu này, hãy xem bản giải thích ghi ở bên trái.", "eng": "For an explanation of the symbols see the key inset left."}, {"viet": "Bốn năm ở tiểu học phải làm cho những đứa trẻ đó khôn ngoan hơn.", "eng": "Four year of prep school should polish those children."}, {"viet": "Các băng nhóm thanh niên đánh nhau ngoài đường phố.", "eng": "Gangs of youths brawling in the street."}, {"viet": "Việc được tăng lương ở hãng này chẳng khác gì chuyện mò kim đáy biển.", "eng": "Getting a pay rise in this firm is like getting blood from a stone."}, {"viet": "Biểu lộ nỗi căm phẫn của ai.", "eng": "Give voice to one's indignation."}, {"viet": "Việc thông tin đầy đủ về sự kiện đó.", "eng": "Good media coverage of the event."}, {"viet": "Đã làm việc lâu năm lạ thường trong công ty đó.", "eng": "Had unusual longevity in the company."}, {"viet": "Mong quí vị vui lòng đi theo lối này.", "eng": "Have the goodness to step this way, please."}, {"viet": "Bạn có bao giờ đọc truyện Old man and the Sea của Hemingway chưa?", "eng": "Have you ever read Old man and the Sea by Hemingway?"}, {"viet": "Em có thấy chùm chìa khoá của anh ở nơi nào quanh đây không?", "eng": "Have you seen my keys floating about anywhere?"}, {"viet": "Anh ta hơi quá hào phóng với những lời khen của mình.", "eng": "He's a bit too free with his compliments."}, {"viet": "Nó đã lừa dối vợ nó để đi lại với một một người đàn bà khác trong nhiều tháng.", "eng": "He's been deceiving his wife with another woman for months."}, {"viet": "Nó đã thụt két trong nhiều năm nay.", "eng": "He's had his fingers in the till for years."}, {"viet": "Nó rất có thể nói dối để thoát khỏi sự rắc rối.", "eng": "He's quite capable of lying to get out of trouble."}, {"viet": "Nó sai-tôi không thể đồng tình với nó được.", "eng": "He's wrong-I have no sympathy with him."}, {"viet": "Anh ta cầu xin sự tha thứ cho những điều sai trái anh ta đã làm.", "eng": "He asked forgiveness for what he had done wrong."}, {"viet": "Nó kiềm chế sự giận dữ của mình trước những nhận xét xúc phạm của cô ta.", "eng": "He bridled with anger at her offensive remarks."}, {"viet": "Nó vấp chân vào rễ cây và lảo đảo muốn ngã.", "eng": "He caught his foot on a tree root and stumbled."}, {"viet": "Ông ta đã khuyên họ từ bỏ kế hoạch ấy.", "eng": "He counselled them to give up the plan."}, {"viet": "Ông ta không trả lời mà chỉ mỉm cười một cách nghiêm trang.", "eng": "He didn't reply, but just smiled primly."}, {"viet": "Anh ta thận trọng lần theo gờ tường để tới đứa bé đang hoảng sợ.", "eng": "He eased himself along the ledge to reach the terrified boy."}, {"viet": "Anh ta rất giận dữ về cách họ đã đối xử với anh ta.", "eng": "He felt deeply incensed by the way he had been treated."}, {"viet": "Chàng vỗ nhè nhẹ trìu mến lên đầu gối nàng.", "eng": "He gave her knee an affectionate pat."}, {"viet": "Ngày đầu tiên đi học cậu ta đã bị gán cái bí danh Béo-và thật không may nó thành tên thường xuyên.", "eng": "He got the nickname Fatty on his first day at school-and unfortunately the name stuck."}, {"viet": "Ông ta có cái vẻ của một viên chức cao cấp nhưng không có thực quyền.", "eng": "He had the trapping of high office but no real power."}, {"viet": "Anh ấy đã trở thành một người bạn rất thân của tôi.", "eng": "He has become a very close friend of mine."}, {"viet": "Ông ta đã xuống sức trong vòng hai năm qua.", "eng": "He has suffered from failing health for the last two years."}, {"viet": "Ông ta nhấn mạnh là các giấy tờ đó phải được tiêu hủy.", "eng": "He insisted that the papers should be destroyed."}, {"viet": "Anh ấy không bao giờ khuyên bảo chậm trễ.", "eng": "He is never behindhand in offering advice."}, {"viet": "Nó thúc khuỷu tay mạnh vào cạnh sườn tôi.", "eng": "He jabbed his elbow into my side."}, {"viet": "Anh ấy đã thôi học khi mới mười sáu.", "eng": "He left school when he was sixteen."}, {"viet": "Anh ta đã mất sạch tiền và lại phải bắt đầu hoàn toàn từ hai bàn tay trắng.", "eng": "He lost all his money and had to start again completely from scratch."}, {"viet": "Ông ta làm điệu bộ diễn vai chàng say rượu.", "eng": "He mimed the part of a drunken man."}, {"viet": "Anh ấy đã gọi một panh bia cho mình.", "eng": "He ordered himself a pint of beer."}, {"viet": "Hắn đang đùng đùng bước ra khỏi phòng trong cơn tức giận.", "eng": "He pranced out of the room in a fury."}, {"viet": "Ông ta coi trọng hạnh phúc của con cái hơn tất cả điều đáng quan tâm khác.", "eng": "He puts his children welfare before all other consideration."}, {"viet": "Anh ta không chịu nhúng tay vào những việc bẩn thỉu.", "eng": "He refused to soil his hands."}, {"viet": "Anh ta chắc chắn là người thắng cuộc.", "eng": "He's a cinch to win the race."}, {"viet": "Nó đã ốm hai tuần nay.", "eng": "He's been ill for two weeks."}, {"viet": "Ông ta sống tại số 4.", "eng": "He's living at No 4."}, {"viet": "Ông ấy là người viết bài trên báo đài.", "eng": "He's the one that's writing the story."}, {"viet": "Anh ta đã nhìn thấy hồn ma của người vợ đã chết của anh ta.", "eng": "He saw the apparition of this dead wife."}, {"viet": "Ông ấy giũ tấm thảm cho hết bụi.", "eng": "He shook the carpet to get rid of the dust."}, {"viet": "Anh ấy đã nói đùa rườm rà đến nỗi chúng đã mất đi tính hài hước.", "eng": "He so overelaborated his jokes that they lose their humor."}, {"viet": "Ông ta tuyên bố một cách quả quyết rằng ông ta chưa bao giờ trông thấy người này.", "eng": "He stated positively that he had never seen the man."}, {"viet": "Ông ta tỏ ra bị bất lợi so với người đồng thời với ông ta có địa vị cao hơn.", "eng": "He suffers by comparison with his greater contemporary."}, {"viet": "Hắn cầu xin lòng khoan dung của tôi.", "eng": "He threw himself on my mercy."}, {"viet": "Anh ấy đã đổi chiếc xe cũ của anh ấy lấy chiếc xe mới mà hiện giờ anh ấy đang dung.", "eng": "He traded his old car in on the new one he has now."}, {"viet": "Anh ấy đã trải qua 5 lần phẫu thuật bàn chân.", "eng": "He underwent five operations on his foot."}, {"viet": "Anh ta đã có vợ mà cô ta không được biết.", "eng": "He was, unbeknown to her, already married."}, {"viet": "Hắn bị đày biệt xứ suốt đời.", "eng": "He was banished from his homeland for life."}, {"viet": "Nó dứt khoát ở vị trí hợp lệ khi nó ghi bàn thắng.", "eng": "He was definitely onside when he scored that goal."}, {"viet": "Anh ta bị đưa ra toà vì lái xe ẩu.", "eng": "He was had up in court for dangerous driving."}, {"viet": "Nó không phải là đứa học nhanh như anh nó.", "eng": "He was not so quick a learner as his brother."}, {"viet": "Anh ta bị đuổi ra khỏi sân vì có hành động thô bạo với thủ môn của đội kia.", "eng": "He was sent off for fouling the other team's goalkeeper."}, {"viet": "Anh ta bị ngăn cản trong các mục đích của mình vì số đen.", "eng": "He was thwarted in his aims by bad luck."}, {"viet": "Anh ta trở lại trường đại học sau thời gian mười năm.", "eng": "He went back to college after an elapse of ten years."}, {"viet": "Ông ấy sẽ không chịu đựng được bất kỳ hành động ngu xuẩn nào nữa trong đám nhân viên.", "eng": "He won't stand any nonsense from the staff."}, {"viet": "Hàng năm những người đứng đầu nhà nước dự nhiều buổi lễ hội chính thức.", "eng": "Heads of state attend numerous functions every year."}, {"viet": "Lòng căm giận của cô tan biến và cô bắt đầu cười.", "eng": "Her anger melted and she began to laugh."}, {"viet": "Con cái của bà ta bao giờ cũng ăn mặc lịch sự.", "eng": "Her children are always smartly turned out."}, {"viet": "Cô ấy vào là dấu hiệu để vỗ tay.", "eng": "Her entrace is the signal for applause."}, {"viet": "Mái tóc buộc kiểu đuôi ngựa của cô ta.", "eng": "Her hair in a pony-tail."}, {"viet": "Sự tử tế của cô ta đối với anh ấy gặp phải sự từ chối tàn nhẫn.", "eng": "Her kindness to him was met with a cruel rebuff."}, {"viet": "Cuốn sách mới của bà ấy cho thấy bà ấy là một cây viết tiểu thuyết hàng đầu.", "eng": "Her new book shows her to be a first-rate novelist."}, {"viet": "Lời tiên đoán của bà ta đã được chứng tỏ là đúng.", "eng": "Her prophecy was proved to be correct."}, {"viet": "Con trai của bà ta đúng là một đứa vô tích sự.", "eng": "Her son's a bit of a tear away."}, {"viet": "Tiếng nói của cô ta hầu như không nghe được vì tiếng át của gió.", "eng": "Her voice was scarcely audible above the noise of the wind."}, {"viet": "Heroin và cocain là các loại ma tuý mạnh.", "eng": "Heroin and cocaine are hard drugs."}, {"viet": "Việc ông ấy đến lại gây ra một cuộc tranh cãi khác.", "eng": "His arrival set the scene for another argument."}, {"viet": "Vụ kiện của nó đã được đưa ra toà.", "eng": "His case was brought up before the court."}, {"viet": "Việc anh ta đào ngũ là một điều ô nhục đối với gia đình anh ta.", "eng": "His desertion from the army was a dishonor to his family."}, {"viet": "Mặt anh ấy nhăn nhó vì đau.", "eng": "His face was twisted with pain."}, {"viet": "Cách xử lý tình hình của ông ta đáng khâm phục.", "eng": "His handing of the situation was admirable."}, {"viet": "Kiến thức của ông ấy bao trùm nhiều lĩnh vực khác nhau.", "eng": "His knowledge spans many different areas."}, {"viet": "Mẹ ông ấy mất năm ngoái.", "eng": "His mother passed away last year."}, {"viet": "Mối quan hệ cá nhân của ông ta với giới cử tri có ích khi cần thiết.", "eng": "His personal relationship with the electorate stands in good stead."}, {"viet": "Sự từ chức của ông ấy sẽ có những hậu quả nghiêm trọng.", "eng": "His resignation will have serious repercussion."}, {"viet": "Sự nghiên cứu của anh ấy chắc chắn sẽ là phán quyết cuối cùng về vấn đề cho nhiều năm sau.", "eng": "His study will surely be the last word on the subject for many years."}, {"viet": "Giọng anh ta bị khản sau khi nói một tiếng đồng hồ.", "eng": "His voice was hoarse after talking for an hour."}, {"viet": "Xin cầm máy đợi để tôi xem cô ta có ở đây không?", "eng": "Hold the line while I see if she's here?"}, {"viet": "Nhà cửa và các nhà máy nhường chỗ cho những cánh đồng trống khi chuyến tàu tăng tốc độ.", "eng": "Houses and factories gave place to open fields as the train gathered speed."}, {"viet": "Anh thật trơ tráo khi hỏi thêm tiền.", "eng": "How can you have to your face to ask for more money."}, {"viet": "Anh đi làm bằng gì?''Tôi thường đi xe buýt.'.", "eng": "How do you come to work?''I usually get the bus'."}, {"viet": "Một người có thể nhịn ăn được bao lâu?", "eng": "How long can a human being go without food?"}, {"viet": "Toàn bộ một bộ tiền bao gồm bao nhiêu đơn vị tiền tệ vậy?", "eng": "How many denominations does a whole set include, please?"}, {"viet": "Anh bán cái xe cũ của anh được bao nhiêu tiền? Tôi bán nó được 800 bảng Anh.", "eng": "How much did you get for your old car? I got £ 800 for it."}, {"viet": "Tôi không biết được người ta thiết kế trò chơi điện tử như thế nào.", "eng": "How people design computer games is beyond me."}, {"viet": "Nhanh lên, bác sĩ! Đó là một vấn đề sinh tử.", "eng": "Hurry doctor! It's a matter of life and death."}, {"viet": "Tôi muốn gặp con gái ông ấy, mọi người ca ngợi cô ấy lắm.", "eng": "I'd like to meet his daughter, everyone speaks very highly of her."}, {"viet": "Tôi sẽ đi thẳng vào vấn đề-công việc anh làm chưa tốt lắm đâu.", "eng": "I'll come straight to the point-your work isn't good enough."}, {"viet": "Tôi sẽ xoay xở với chiếc ôtô này một năm nữa.", "eng": "I'll make out with this car for another year."}, {"viet": "Tôi là phóng viên của đài tiếng nói Hoa kỳ.", "eng": "I'm a reporter for the Voice of America."}, {"viet": "Tôi phải quay lại văn phòng trong năm phút nữa.", "eng": "I'm due back at my office in five minutes."}, {"viet": "Tôi sung sướng nói lên lòng biết ơn của tôi đối với thầy giáo.", "eng": "I'm happy to acknowledge my debts to my teachers."}, {"viet": "Tôi không muốn bất đồng với anh.", "eng": "I'm not in the mood to disagree with you."}, {"viet": "Xin lỗi, tôi đã quên mất sự khác biệt về giờ giấc.", "eng": "I'm sorry, I forgot about the time difference."}, {"viet": "Tôi trả quá muộn tiền thuê nhà tháng này.", "eng": "I'm terribly behind with the rent this month."}, {"viet": "Tôi đã viết bài tiểu luận này miệt mài hàng tiếng đồng hồ.", "eng": "I've been bashing away at this essay for hours."}, {"viet": "Tôi lại quên tên anh rồi, đầu óc tôi dạo này kém đi.", "eng": "I've forgotten his name again, I must be slipping."}, {"viet": "Tôi đã giao Bộ này cho bàn tay rất có năng lực của Bill.", "eng": "I've left the department in Bill's very efficient hands."}, {"viet": "Tôi đã dùng thử một vài loại thuốc khác nhau nhưng không loại nào có tác dụng.", "eng": "I've tried several different medications and none of them work."}, {"viet": "Lúc nào tôi cũng thích toán học và thích đụng tới máy móc.", "eng": "I always liked mathematics and tinkering with machines."}, {"viet": "Tôi xin từ chức chủ tịch và chuyển giao chức vụ đó cho người phó của tôi.", "eng": "I am resigning as chairman and handing over to my deputy."}, {"viet": "Tôi không tin lắm vào điều cô ta nói.", "eng": "I attach little credence to what she says."}, {"viet": "Tôi ghé thăm với hy vọng gặp cô ta ở nhà.", "eng": "I called in the hope of finding her at home."}, {"viet": "Tôi không thể tưởng rằng có ai lại quan tâm đến tôi làm gì.", "eng": "I can't imagine that anyone cares what I do."}, {"viet": "Tôi có thể tự nấu các bữa ăn cho mình.", "eng": "I can cook my own meals."}, {"viet": "Tôi không thể nào vượt qua được cảm giác ghê tởm đối với việc ăn ốc sên.", "eng": "I cannot overcome my repugnance to eating snails."}, {"viet": "Tôi xuất thân từ một gia đình 3 người con trai và 2 người con gái.", "eng": "I come from a family of three boys and two girls."}, {"viet": "Tôi xem anh ta là người sành xét đoán cá tính.", "eng": "I count him a good judge of character."}, {"viet": "Tôi quyết định đi bằng một chiếc tắc-xi cho thoải mái.", "eng": "I decided to treat myself to a taxi."}, {"viet": "Tôi không đồng ý với những sự việc mà cách lập luận của anh dựa vào.", "eng": "I disagree with the facts on which your argument is based."}, {"viet": "Tôi không biết các bước của điệu nhảy này.", "eng": "I don't know the steps for this dance."}, {"viet": "Tôi không nghĩ người ta cần tôi giúp đỡ, nhưng dù sao tôi cũng sẽ đi, chỉ để chứng tỏ tôi sẵn lòng.", "eng": "I don't think I'm needed as a helper, but I'll go anyway, just to show willing."}, {"viet": "Tôi không muốn làm mếch lòng ai, bởi vậy tôi sẽ không nói ra điều mình nghĩ.", "eng": "I don't want to tread on anybody's toes so I won't say what I think."}, {"viet": "Tôi không ưa nghe lời nói thô lỗ của anh tí nào!", "eng": "I don't want any mouth from you!"}, {"viet": "Tôi cảm thấy gò bó do những hạn chế trong công việc của tôi.", "eng": "I feel cramped by the limitations of my job."}, {"viet": "Tôi nhận thấy anh ấy rất dễ bị lý lẽ thuyết phục.", "eng": "I find him amenable to argument."}, {"viet": "Tôi được dịp ngủ muộn vào những ngày cuối tuần.", "eng": "I get a chance to sleep in at the weekend."}, {"viet": "Tôi dẫn ông ta tới ghế của ông.", "eng": "I guided him to his chair."}, {"viet": "Tôi phải sờ soạng cái công tắc bật trong đêm tối.", "eng": "I had to feel about in the dark for the light switch."}, {"viet": "Tôi ngờ rằng cô ta không nói cho tôi biết sự thật.", "eng": "I have a suspicion that she is not telling me the truth."}, {"viet": "Tôi không hề có ý định ở vào địa vị phụ thuộc viên giám đốc mới cho nên tôi đã từ chức.", "eng": "I have no intention of playing second fiddle to the new director, so I've resigned."}, {"viet": "Tôi đã đối xử không tốt với anh, làm thế nào tôi chuộc lại lỗi lầm đây.", "eng": "I have treated you unkindly, how can I atone."}, {"viet": "Tôi nghe nói Peter Brown dạo này làm ăn khấm khá lắm.''Hạng người như Peter Brown bao giờ cũng làm ăn khấm khá!'.", "eng": "I hear Peter Brown's doing very well.''The Peter Browns of this world always do well!'."}, {"viet": "Tôi hy vọng nó không khẩn cấp.", "eng": "I hope it wasn't urgent."}, {"viet": "Tôi ghi vội địa chỉ của cô ấy trên tờ báo của tôi.", "eng": "I jotted down her address on my newspaper."}, {"viet": "Tôi biết khi nói về chuyện tự sát tôi đã làm động lòng.", "eng": "I know that in talking about suicide I may have touched a raw nerve."}, {"viet": "Tôi thích màu hợp với tôi, bạn có thấy vậy không?", "eng": "I like the color on me, don't you?"}, {"viet": "Tôi sẽ kiểm tra sổ yêu cầu đặt phòng của chúng tôi xem ….", "eng": "I'll check our reservation record."}, {"viet": "Tôi sẽ cử một thợ ống nước đến ngay.", "eng": "I'll send a plumber right away."}, {"viet": "Tôi hoàn toàn ủng hộ việc mở các quán rượu cả ngày.", "eng": "I'm all for pubs being open all day."}, {"viet": "Tôi làm việc trong ngành xây dựng.", "eng": "I'm in the construction industry."}, {"viet": "Tôi rất tiếc, hiện giờ John đi vắng rồi.", "eng": "I'm sorry, john is out right now."}, {"viet": "Tôi hết sức thán phục cô ta đã đồng ý làm điều nguy hiểm như vậy.", "eng": "I marvel that she agreed to do so dangerous."}, {"viet": "Tôi phải học tự kiềm chế.", "eng": "I must learn to restrain myself."}, {"viet": "Tôi không bao giờ mơ một điều như vậy có thể xảy ra.", "eng": "I never dreamt that such a thing could happen."}, {"viet": "Tôi đã bỏ một số lon coca-cola vào thùng làm lạnh để đi pic-nic.", "eng": "I packed a bunch of cokes in the cooler for the picnic."}, {"viet": "Tôi đã nổi xung lên hàng giờ về quyết định ấy.", "eng": "I raged for hours at the decision."}, {"viet": "Tôi từ chối không muốn nghe những chuyện vớ vẩn trẻ con của anh nữa.", "eng": "I refuse to listen to anymore of your childish banana oil."}, {"viet": "Xin thề là tôi đã thấy hắn ta làm điều đó.", "eng": "I saw him do it: cross my heart."}, {"viet": "Tôi sẽ phải sử dụng tiền tiết kiệm của mình.", "eng": "I shall have to draw on my savings."}, {"viet": "Tôi đã tiêu rất nhiều tiền trong kỳ nghỉ của mình.", "eng": "I spent a lot of money on my vacation."}, {"viet": "Tôi đã sụt được mười cân Anh trong một tuần nhờ chơi quần vợt trong nhà hàng ngày.", "eng": "I sweated of ten pounds in a week by playing squash every day."}, {"viet": "Tôi nghĩ tôi thích một cặn hộ nhỏ hơn.", "eng": "I think I would prefer something smaller."}, {"viet": "Tôi nghĩ tối nay chúng ta sẽ đi đấy.", "eng": "I think we will leave tonight."}, {"viet": "Tôi chắc chắn là mình sẽ được mời đến dự đám cưới anh trai tôi.", "eng": "I took it for granted that U would be invited to my brother's wedding."}, {"viet": "Tôi hiểu chút ít những điều anh ấy nói.", "eng": "I understood little of what he said."}, {"viet": "Tôi muốn dùng món gì đó dễ tiêu cho bữa ăn trưa.", "eng": "I want something light for lunch."}, {"viet": "Tôi muốn anh ra khỏi đây, càng sớm càng tốt.", "eng": "I want you out of here, and the sooner the better."}, {"viet": "Tôi được giáo dục trong cay đắng trường đời.", "eng": "I was educated in the school of hard knocks."}, {"viet": "Tôi chỉ đùa khi tôi nói là tôi muốn cưới bạn.", "eng": "I was only kidding when I said I want to marry you."}, {"viet": "Tôi đã mắc bẫy khai hết những gì tôi biết với cảnh sát.", "eng": "I was trapped into telling the police all I knew."}, {"viet": "Em sẽ bắt đầu thực hiện nó ngay.", "eng": "I will get started on it right away."}, {"viet": "Tôi sẽ không cố gắng tự sửa ô tô của tôi, tôi biết sự hạn chế thợ cơ khí của mình.", "eng": "I won't even try to fix the car myself, I know my limitations as a mechanic."}, {"viet": "Sẽ là sai lầm nếu cho rằng chúng ta sẽ không còn phải nghĩ gì về vấn đề này nữa.", "eng": "I would be a mistake to assume we've heard the last of this issue."}, {"viet": "Tôi muốn ở lại một đêm nữa.", "eng": "I would like to stay another night."}, {"viet": "Để đạt kết quả tốt nhất, chúng ta phải dành gấp đôi thời gian cho dự án.", "eng": "Ideally, we should allot twice as much time to the project."}, {"viet": "Nếu tôi không trở về căn cứ, người ta sẽ cho rằng tôi là lính trốn trại.", "eng": "If I don't get back to the base, they're going to think I'm AWOL."}, {"viet": "Nếu một số vận động viên dùng thuốc kích thích thì như thế là không công bằng đối với các vận động viên khác.", "eng": "If some athletes use drugs, it is unfair to the others."}, {"viet": "Nếu chúng ta quyết định tiếp thị thể nghiệm thì một số nhân viên bán hàng lâu năm sẽ vào cuộc.", "eng": "If we decide to do some test marketing, some of the senior salesmen are brought into picture."}, {"viet": "Nếu anh điều khiển nổi nghị lực của mình thì anh sẽ hoàn thành được nhiều việc.", "eng": "If you can harness your energy, you will accomplish a great deal."}, {"viet": "Nếu các em có bất kỳ câu hỏi nào, xin cứ giơ tay lên.", "eng": "If you have any questions, please raise your hand."}, {"viet": "Nếu cậu quay mặt ra ngoài, cậu có thể thấy dễ ngủ hơn.", "eng": "If you turn over you might find it easier to get to sleep."}, {"viet": "Vào năm 1713, chính quyền nước Anh tặng một giải thưởng 10000 Bảng Anh cho bất cứ ai có khả năng chế tạo ra một dụng cụ đo thời gian thực sự chính xác.", "eng": "In 1713 the British government offered a prize of 10,000 Pound to anyone who could make a timepiece that would keep really accurate time."}, {"viet": "Ở nước Anh, ngài phải lái xe bên phía đường ngược lại với các nước khác ở châu Âu.", "eng": "In England you must drive on the opposite side of the road to the rest of Europe."}, {"viet": "Ở phần lớn các vùng đất trên thế giới, người ta có nhiều y phục hơn là cần thiết.", "eng": "In most parts of the world people have more clothes than they used to have."}, {"viet": "Ở giữa là các nhạc công, người đánh trống và các ca sĩ.", "eng": "In the center are the musicians, the drummers and singers."}, {"viet": "Ở chỗ bán xe dùng rồi cái anh chàng này quá sốt sắng đến chỗ tôi và nói anh ta có cái tôi có thể dùng được suốt đời.", "eng": "In the used car dealership, this backslapper comes up to me and tells me he's got something that will last me a lifetime."}, {"viet": "Bộ binh là xương sống của hầu hết mọi quân đội.", "eng": "Infantry were the backbone of most armies."}, {"viet": "Nói chuyện với các nhân viên có được không ạ?", "eng": "Is it all right to talk to the men?"}, {"viet": "Bạn có ủng hộ đảng chính trị nào không?", "eng": "Is there a political party that you support?"}, {"viet": "Xóm bạn ở có yên tĩnh và an toàn không?", "eng": "Is your neighborhood quiet and safe?"}, {"viet": "Đây là đũa khuấy, có lẽ để nấu cháo.", "eng": "It's a stirring stick, probably for porridge."}, {"viet": "Thật khó mà nuôi nổi một gia đình với thu nhập ít ỏi.", "eng": "It's difficult raising a family on a small income."}, {"viet": "Không thể nào làm cho anh ta ngừng nói một khi anh ta đã cất lời.", "eng": "It's impossible to stop him talking once he starts off."}, {"viet": "Đây không phải là kế hoạch của tôi, hãy tìm người khác đứng tên.", "eng": "It's not my scheme, try fathering it on somebody else."}, {"viet": "Cuộc đời con người liên kết với nhau thật kỳ lạ.", "eng": "It's strange how people's lives interconnect."}, {"viet": "Vứt bỏ những thứ ấy đi thật là lãng phí, sau này chúng ta có thể dùng đến nó.", "eng": "It's wasteful to throw these away, we might be able to use them one day."}, {"viet": "Chỉ nghĩ đến thôi cũng đã làm tôi vô cùng lo lắng.", "eng": "It gives me the all overs just to think of it."}, {"viet": "Thật hết sức khó mà có ai sống sót sau vụ nổ.", "eng": "It is extremely doubtful that anyone survived the explosion."}, {"viet": "Nó được yêu cầu phải đảm bảo sự cân đối tài chính vĩ mô bằng cách sử dụng những văn kiện chính sách tiền tệ và hướng dẫn những ngân hàng chuyên ngành và những cơ sở tài chính khác tham gia vào những hoạt động tín dụng.", "eng": "It is required to assure the macro-financial balance by using its monetary policy instruments and to guide the specialized banks and other financial institutions to engage in credit activities."}, {"viet": "Điều này có thể làm anh quan tâm, bà ta đã chết từ dạo ấy.", "eng": "It may interest you to know that she's since died."}, {"viet": "Nó thích thú nhưng là công việc rất nặng nhọc.", "eng": "It's interesting but very hard work."}, {"viet": "Dường như đây là một nơi tốt để sinh sống.", "eng": "It seems like a good place to live."}, {"viet": "Đó vốn là nhà hàng ưa thích của tôi nhưng gần đây chất lượng nấu nướng đã giảm sút.", "eng": "It used to be my favourite restaurant but the standard of cooking has fallen off recently."}, {"viet": "Với một cuốn từ điển thì dễ dịch.", "eng": "It was easy to translate with a dictionary."}, {"viet": "Hài hước quá, chúng tôi không nhịn được cười.", "eng": "It was so funny we couldn't stop laughing."}, {"viet": "Sẽ không sao đâu nếu cô ta không thích bạn.", "eng": "It won't matter she doesn't like you."}, {"viet": "Nước Nhật bao gồm bốn hòn đảo chính.", "eng": "Japan consists of four main islands."}, {"viet": "Jones sẽ vắng mặt trong đội hình của đội.", "eng": "Jones will be missing from the team line-up."}, {"viet": "Dầu hoả được dân làng dùng để thắp đèn vào ban đêm.", "eng": "Kerosene is used by the villagers to light their lamps at night."}, {"viet": "Chúng ta hãy vào buồng này nhé?", "eng": "Let's go into this compartment, shall we?"}, {"viet": "Cuộc đời thường được ví như là một cuộc hành trình.", "eng": "Life has often been likened to a journey."}, {"viet": "Nhiều ảnh hưởng giúp tạo nên tính cách của trẻ em.", "eng": "Many influences help to fashion our children's characters."}, {"viet": "Tẩm thịt bê vào rượu vang trắng trong hai giờ.", "eng": "Marinate the veal in white wine for two hours."}, {"viet": "Cho tôi chìa khoá phòng 302?", "eng": "May I have the key for Room 302?"}, {"viet": "Trong lúc đó, tôi sẽ đi mua vài tờ tạp chí ở quầy đằng kia để đọc trên xe lửa.", "eng": "Meantime, I'll go and get a few magazines at that stand to read on the train."}, {"viet": "Ngày nay hầu hết mọi người đều thừa nhận là có khủng hoảng.", "eng": "Most people will now acknowledge that there is a crisis."}, {"viet": "Bọn ngốc đã để chìa khoá trong xe khoá lại!", "eng": "Muggins here locked his keys in the car!"}, {"viet": "Cái dao cạo điện của tôi hoạt động ở 110 vôn.", "eng": "My electric shaver operates on 110 volts."}, {"viet": "Sự hiểu biết của tôi về vấn đề đó khá là chắp vá.", "eng": "My knowledge of the subject is no more than fragmentary."}, {"viet": "Giày tôi ướt sũng vì đi bộ ngoài mưa.", "eng": "My shoes are sodden from walking in the rain."}, {"viet": "Các cuộc hội đàm nhằm đưa hai bên trong cuộc tranh chấp xích lại gần nhau hơn.", "eng": "Negotiations aimed at bringing the two sides in the dispute closer together."}, {"viet": "Không, nhưng thật sự tôi cũng chưa nhìn quanh đây mà.", "eng": "No, but I haven't really looked around, either."}, {"viet": "Cho dù chuyện gì xảy ra đi nữa, cũng không có gì làm hỏng ngày này được.", "eng": "No matter what, nothing is going to ruin this day."}, {"viet": "Bây giờ ông chủ cũ của bà ta đi rồi, bà ta luôn luôn nói xấu ông ấy.", "eng": "Now he's left, she's always slagging off her old boss."}, {"viet": "Tất nhiên là muốn, nhưng tôi không muốn ngắt lời ông ấy.", "eng": "Of course, but I don't want to interrupt."}, {"viet": "Dầu phải được tinh chế trước khi dùng.", "eng": "Oil has to be refined before it can be used."}, {"viet": "Trên những hòn đảo này người ta sử dụng hệ thống đổi chác.", "eng": "On these islands a system of barter is used."}, {"viet": "Một trong những khía cạnh của vấn đề là thiếu tiền.", "eng": "One of the aspects of the problem is the lack of money."}, {"viet": "Thân thể chúng ta sản sinh ra chất kháng thể để chống lại bệnh tật.", "eng": "Our bodies produce antibodies to counteract disease."}, {"viet": "Cuộc đi nghỉ của chúng tôi đã phải huỷ bỏ khi người điều hành hãng du lịch phá sản.", "eng": "Our holiday was cancelled when the travel operator went bankrupt."}, {"viet": "Chỗ ngồi của chúng ta ở khán đài.", "eng": "Our seats are in the grandstand."}, {"viet": "Oxford và vùng chung quanh nó rất đáng đi thăm.", "eng": "Oxford and its environs are worth a visit."}, {"viet": "Về cơ bản mọi người trên khắp thế giới đều giống nhau.", "eng": "People are basically the same the world over."}, {"viet": "Tình cảm cá nhân không nên xen vào khi phải có những quyết định trong kinh doanh.", "eng": "Personal feelings should not come into play when one has to make business decisions."}, {"viet": "Cảnh sát sẽ đề phòng những kẻ gây rối trong trận đấu hôm nay.", "eng": "Police will be looking out for trouble-makers at today's match."}, {"viet": "Nước muối có sức nổi hơn nước ngọt rất nhiều.", "eng": "Salt water has greater buoyancy than fresh water."}, {"viet": "Nhiều nhà xuất bản đang cạnh tranh trên cùng một thị trường.", "eng": "Several publishers are competing in the same market."}, {"viet": "Bà ta đúng là một bà già ngớ ngẩn hay xen vào chuyện người khác!", "eng": "She's a foolish interfering old woman!"}, {"viet": "Bà ta dùng thuốc an thần từ khi đứa con bà chết.", "eng": "She's been taking antidepressants since her baby died."}, {"viet": "Đứa em trai út của cô ta nói Chị ấy chỉ là một cô gái ủy mị.", "eng": "She's just a soppy girl, said her youngest brother."}, {"viet": "Cô ấy có trách nhiệm tổ chức toàn bộ buổi diễn.", "eng": "She's responsible for organizing the whole show."}, {"viet": "Cô ấy buộc tội ông xếp định sờ mó cô ấy ở lối đi.", "eng": "She accused her boss of trying to fondle her in the hallway."}, {"viet": "Cô ấy ngày càng lo lắng khi cuộc phỏng vấn tiếp tục.", "eng": "She became ever more nervous as the interview continued."}, {"viet": "Cô ta cạy ghét bẩn ở móng tay.", "eng": "She cleaned the dirt from her finger-nails."}, {"viet": "Cô ấy đã đánh bại tất cả những người cạnh tranh xin việc với vẻ thoải mái tự nhiên.", "eng": "She defeated all her rivals for the job with nonchalant ease."}, {"viet": "Bà ta đã lưu ý tôi về một sai lầm trong bản báo cáo.", "eng": "She drew my attention to an error in the report."}, {"viet": "Cô ta thấy khó mà bỏ hút thuốc lá được.", "eng": "She finds it difficult to stop smoking."}, {"viet": "Cô ta được 80 điểm trên 100 về môn địa lý.", "eng": "She got 80 marks out of 100 for geography."}, {"viet": "Bà ta đã sống suốt cuộc đời lao động của mình trong nhà máy.", "eng": "She had spent all her working life in the factory."}, {"viet": "Cô ấy biểu thị sự phản đối của mình đối với bản kế hoạch và tôi hoàn toàn đồng tình ( với cô ta ) ( về vấn đề này ).", "eng": "She has expressed her opposition to the plan, and I fully concur ( with her ) ( in this matter )."}, {"viet": "Cô ta hy vọng sang năm vào đại học.", "eng": "She hopes to go to university next year."}, {"viet": "Chị ấy đang đưa xuất bản một câu chuyện về thời kỳ chiến tranh.", "eng": "She is publishing a history of the war period."}, {"viet": "Cô ấy biết thành phố này rõ hơn anh.", "eng": "She knows this town better than you do."}, {"viet": "Cô ta hãnh diện nhìn kết quả công việc của mình.", "eng": "She looked with pride at the result of her work."}, {"viet": "Cô ta chắc hẳn đã có những buổi học bí mật.", "eng": "She must have been having lessons on the sly."}, {"viet": "Cô ấy dự định đóng vai Macbeth phu nhân trong y phục mùa hè.", "eng": "She plans to act Lady Macbeth in summer stock."}, {"viet": "Cô ấy thực sự ra sức phô trương mình.", "eng": "She really tries to make the most of herself."}, {"viet": "Cô ta là một tay quần vợt xuất sắc.", "eng": "She's an excellent tennis player."}, {"viet": "Cô ta đang có mối quan hệ với một anh chàng đã có vợ.", "eng": "She's seeing a married man."}, {"viet": "Cô ấy dán phong bì và tem lên đó.", "eng": "She sealed the envelope and put a stamp on it."}, {"viet": "Cô ta nhảy từ đề tài này qua đề tài kia.", "eng": "She skipped from one subject to another."}, {"viet": "Bà ấy đã ra tranh cử không thành công ở các cuộc bầu cử địa phương.", "eng": "She stood unsuccessfully in the local elections."}, {"viet": "Cô ta cho rằng đọc tiểu thuyết lãng mạn là một cách tiêu thì giờ hoang phí.", "eng": "She thought that reading romantic novels was a frivolous way of spending her time."}, {"viet": "Bà ấy cam đoan hoàn thành tất cả trách nhiệm của một bộ trưởng.", "eng": "She undertook to discharge all the responsibilities of a Minister."}, {"viet": "Cô ta hoàn toàn chết điếng vì sợ hãi.", "eng": "She was absolutely petrified with fright."}, {"viet": "Nàng xúc động sâu sắc trước cảnh nghèo khổ và chết đói nàng đã chứng kiến.", "eng": "She was deeply affected by the poverty and starvation she had witnessed."}, {"viet": "Cô ta tức điên lên vì anh ta đã dám táo bạo thu xếp chuyến đi mà không hỏi ý kiến cô ta trước.", "eng": "She was infuriated by his presumption in making the travel arrangements without first consulting her."}, {"viet": "Cô ấy hơi xẵng với anh ta khi anh ta nhờ cô ấy giúp đỡ.", "eng": "She was rather short with him when he asked for help."}, {"viet": "Cô ta quá yếu đến nỗi đứng không được.", "eng": "She was too weak to stand."}, {"viet": "Bà ta bỏ chồng để đi lấy ông bán sữa.", "eng": "She went off with the milkman."}, {"viet": "Cô ta đeo trên cổ một sợi dây chuyền có hình thánh giá nhỏ bằng bạc.", "eng": "She wore a small silver cross on a chain round her neck."}, {"viet": "Làn sóng sửng sốt lan truyền khắp ban đó vì sự từ chức của ông trưởng ban.", "eng": "Shock waves reverberated round the department from the manager's resignation."}, {"viet": "Tỏ dấu hiệu bất mãn của mình bằng cách từ chối bỏ phiếu.", "eng": "Signal one's discontent by refusing to vote."}, {"viet": "Sáu tháng đã trôi qua mà chúng ta vẫn không có tin tức gì của họ cả.", "eng": "Six months had passed, and we still had no news of them."}, {"viet": "Khói phun ra từ một ống khói.", "eng": "Smoke issuing forth from a chimney."}, {"viet": "Vậy thì lần này tôi sẽ mất một ít tiền lãi.", "eng": "So this time I would lose some interest."}, {"viet": "Một vài công ty có thể làm cho tình hình xấu hơn nếu họ tìm cách giảm dần các y tế phí bằng cách giới hạn những phúc lợi liên quan tới sự chăm sóc về tâm lý và tinh thần.", "eng": "Some companies may make things worse if they seek to ratchet down their medical expenses by limiting benefits for psychological or psychiatric care."}, {"viet": "Một số bệnh nhân có những thay đổi tâm lý không bình thường về vị giác và khứu giác sau khi phẫu thuật.", "eng": "Some patients develop aberrations of taste and smell after some surgical procedure."}, {"viet": "Có người có sáng kiến ghi âm lại cuộc họp.", "eng": "Somebody had the bright idea of recording the meeting."}, {"viet": "Xin lỗi tôi đụng phải anh, đó chỉ là phản xạ tự nhiên thôi.", "eng": "Sorry I hit you, it was a pure reflex."}, {"viet": "Mùa xuân sẽ lại sớm trở về.", "eng": "Spring will soon come round again."}, {"viet": "Cứ đặt nó xuống bất cứ chỗ nào em thích.", "eng": "Stick it down anywhere you like."}, {"viet": "Kéo căng sợi dây thừng đến độ đứt.", "eng": "Strain a rope to breaking-point."}, {"viet": "Một sự quả quyết đáng ngờ như vậy chắc chắn sẽ gây nên sự chỉ trích.", "eng": "Such a questionable assertion is sure to provoke criticism."}, {"viet": "Những người tắm nắng nằm giang rộng tay chân trên bãi cỏ.", "eng": "Sunbathers lay spread eagles on the grass."}, {"viet": "Bơi được giới hạn chỉ ở đoạn sông này thôi-chỗ còn lại nguy hiểm.", "eng": "Swimming is restricted to this part of the river only-the rest is dangerous."}, {"viet": "Hãy lấy cái mũ nào hợp với anh nhất.", "eng": "Take whichever hat suits you best."}, {"viet": "Nói cho tôi biết tôi đã đặt nó thẳng chưa?", "eng": "Tell me if I've got it straight?"}, {"viet": "Cám ơn lời mời tử tế của bà rất nhiều.", "eng": "Thank you very much for your kind invitation."}, {"viet": "Thứ bia đó làm tôi thật là buồn ngủ.", "eng": "That beer made me quite sleepy."}, {"viet": "Con ngựa này hoàn toàn không có khả năng thắng, tôi sẽ không phí tiền của ông đánh cá vào nó.", "eng": "That horse is a complete outsider, I wouldn't waste your money on it."}, {"viet": "Tay thủ thư mới đó là một hạng người kỳ cục, có phải không?", "eng": "That new librarian is an odd specimen, isn't he?"}, {"viet": "Đó là chỗ anh sai đấy.", "eng": "That's where you're wrong."}, {"viet": "Cái bà ấy đúng là một của nợ! Hãy để bà ta đứng cách xa chiếc máy này ra!", "eng": "That woman is a menace! Keep her away from this machine!"}, {"viet": "Bị cáo thoát khỏi sự trừng phạt vì thiếu bằng chứng.", "eng": "The accused got off scot-free because of lack of evidence."}, {"viet": "Không khí ở những vùng núi này thật là trong lành.", "eng": "The air is so pure in these mountains."}, {"viet": "Thông báo đó sẽ xuất hiện trên báo ngày mai.", "eng": "The announcement will appear in tomorrow's newspaper."}, {"viet": "Quân đội đã đè bẹp cuộc nổi dậy.", "eng": "The army has put down the revolt."}, {"viet": "Nét hấp dẫn của ngôi nhà là ở sự đơn giản của nó.", "eng": "The attraction of the house lay in its simplicity."}, {"viet": "Đứa bé đó được 3 tháng tuổi.", "eng": "The baby is three months old."}, {"viet": "Ông giám đốc ngân hàng hơi khó khăn về việc để cho tôi rút quá số tiền gởi ngân hàng.", "eng": "The bank manager was a bit sticky about letting me have an overdraft."}, {"viet": "Nhóm Beatles là thần tượng nhạc pop những năm 60.", "eng": "The Beatles were the pop idols of the 60's."}, {"viet": "Con chim vỗ cánh trong lồng.", "eng": "The bird fluttered its wings in the cage."}, {"viet": "Thể xác không thể chịu nổi những lượng phóng xạ lớn như vậy.", "eng": "The body cannot tolerate such large amounts of radiation."}, {"viet": "Sách rải bừa bãi khắp trên sàn nhà.", "eng": "The books were scattered pell-mell over the floor."}, {"viet": "Các cậu bé lấy gậy thúc con gấu qua chấn song.", "eng": "The boys were prodding at the bear through the bars."}, {"viet": "Toà nhà được lau dọn hết sức đều đặn.", "eng": "The building is cleaned with great regularity."}, {"viet": "Con bướm vỗ cánh bay từ bông hoa này sang bông hoa khác.", "eng": "The butterfly fluttered from flower to flower."}, {"viet": "Chiếc xe mở hết tốc lực đạt 200 dặm một giờ.", "eng": "The car does 200 miles per hour flat out."}, {"viet": "Có sẵn thảm các khổ khác nhau.", "eng": "The carpet is available in various widths."}, {"viet": "Các tâm của các vòng tròn đồng tâm trùng khớp với nhau.", "eng": "The centers of concentric circles coincide."}, {"viet": "Người đầu bếp đưa ra một trong những tác phẩm ngoạn mục nhất của mình, món thiên nga quay nguyên con.", "eng": "The chef had produced one of his most spectacular creations, a whole roasted swan."}, {"viet": "Đứa bé mải mê với những quyển sách của mình hàng giờ liền.", "eng": "The child spends hours poring over her books."}, {"viet": "Lũ trẻ rất thích ở hội chợ vui chơi.", "eng": "The children had a whale of a time at the funfair."}, {"viet": "Trẻ em được xếp thành những hàng thẳng.", "eng": "The children were marshalled into straight lines."}, {"viet": "Cuộc nội chiến đã làm anh em đánh lại nhau.", "eng": "The civil war set brother against brother."}, {"viet": "Quán rượu thuê người để tống cổ bọn vô lại, phá phách.", "eng": "The club hires a bounce to keep out undesirable."}, {"viet": "Người diễn viên hài kịch đã làm cho khán giả ôm bụng cười.", "eng": "The comedian had the audience folding up."}, {"viet": "Ty đóng ở Bờ biển phía Tây, thí dụ California.", "eng": "The company has located on the West Coast."}, {"viet": "Cách diễn tấu bản giao hưởng của người chỉ huy dàn nhạc gây nhiều tranh cãi.", "eng": "The conductor's controversial interpretation of the symphony."}, {"viet": "Việc chuyển một kho thóc thành nhà ở, chuyển đổi đồng pao thành đôla.", "eng": "The conversion of a barn into a house, of pounds into dollars."}, {"viet": "Đất nước đang trải qua lạm phát phi mã, giá trị đồng tiền trong sáu tháng qua đã giảm xuống một nửa.", "eng": "The country is suffering from galloping inflation, the value of its money has halved in the past six months."}, {"viet": "Cả đội quay ngửa tay chèo vào những thước cuối cùng của cuộc thi.", "eng": "The crew feathered their oars for the last few yards of the race."}, {"viet": "Tàu du lịch đã bố trí một sàn nhảy nhỏ ngoài trời cho du khách.", "eng": "The cruise ship has arranged a small open air dance for the tourists."}, {"viet": "Các vũ nữ xoay tít theo tiếng nhạc dồn dập.", "eng": "The dancers gyrated wildly to the strong beat of the music."}, {"viet": "Bị cáo hoặc luật sư của anh ta phải có mặt tại tòa án.", "eng": "The defendant or his attorney must appear in court."}, {"viet": "Sự phát triển từ một hạt giống thành một cây.", "eng": "The development of a seed into a plant."}, {"viet": "Căn bệnh đó vẫn không được phát hiện trong vài năm.", "eng": "The disease went undetected for several years."}, {"viet": "Bác sĩ bảo ông ta không được nhấc đồ nặng.", "eng": "The doctor said he must not lift heavy weights."}, {"viet": "Con chó nhảy xổ vào tôi, vẫy đuôi mừng.", "eng": "The dog rushed at me, wagging its tail."}, {"viet": "Người say rượu đi lắc lư qua đường.", "eng": "The drinker man lurched across the street."}, {"viet": "Cơn động đất đã san bằng thành phố.", "eng": "The earthquake laid the city flat."}, {"viet": "Các ông chủ đã đưa ra một đề nghị mới đối với lực lượng lao động.", "eng": "The employers made a new offer to the work-force."}, {"viet": "Việc xây dựng toà nhà mất mấy tháng.", "eng": "The erection of the building took several months."}, {"viet": "Sự mở rộng các mặt kinh doanh của ông ta.", "eng": "The expansion of his business interests."}, {"viet": "Kế theo sự sụp đổ của chế độ độc tài phát xít là một sự phản ứng dữ dội của cánh tả.", "eng": "The fall of the fascist dictatorship was followed by a left-wing backlash."}, {"viet": "Giống cái của bá tước là nữ bá tước.", "eng": "The feminine form of'count'is'countess'."}, {"viet": "Bộ phim hết sức buồn tẻ.", "eng": "The film was boring to a degree."}, {"viet": "Hãng này đang buôn bán có lãi.", "eng": "The firm is trading at a profit."}, {"viet": "Cá sẽ ươn nếu bạn không bỏ vào tủ lạnh.", "eng": "The fish will go bad if you don't put it in the fridge."}, {"viet": "Đội bóng đã có tổng số bàn thắng thấp mùa bóng năm ngoái.", "eng": "The football team had a low goal aggregate last season."}, {"viet": "Đầu ô tô bẹp dúm do va chạm.", "eng": "The front of the car crumpled on impact."}, {"viet": "Khu vườn trông thật đẹp mắt khi những khóm hồng trổ hoa.", "eng": "The garden looks lovely when roses are in bloom."}, {"viet": "Ánh sáng mặt trời làm chói mắt cô ấy.", "eng": "The glare of the sun made her eye hurt."}, {"viet": "Chính phủ và các công đoàn đang ở trong chiều hướng dẫn đến xung đột.", "eng": "The Government and the unions are on a collision course."}, {"viet": "Chính phủ đang hoàn tất một số cải cách xã hội triệt để.", "eng": "The government is putting through some radical social reforms."}, {"viet": "Đại khách sạn, địa điểm của cuộc nói chuyện tuần này đông nghịt người.", "eng": "The Grand Hotel, venue of this week's talks, is packed out."}, {"viet": "Sự phát triển của nhà máy giúp cho các thành phố lớn mạnh lên.", "eng": "The growth of factories helped cities grow."}, {"viet": "Khăn tay có viền ren trắng.", "eng": "The handkerchief is edged with white lace."}, {"viet": "Giá cao ngăn chặn việc sử dụng rộng rãi loại thuốc này.", "eng": "The high cost prohibits the widespread use of the drug."}, {"viet": "Bệnh viện đang thiếu chăn màn sạch.", "eng": "The hospital is getting short of clean linen."}, {"viet": "Căn nhà này cũ nhưng còn ở được cho đến hết đời tôi.", "eng": "The house is old but it will last my time."}, {"viet": "Ý tưởng này bắt đầu giành được sự ưa thích rộng rãi.", "eng": "The idea is beginning to gain widespread favor."}, {"viet": "Nền công nghiệp đã được tài trợ quá lâu dài bằng những khoản trợ cấp của chính phủ.", "eng": "The industry has been feather-bedded by government grants for too long."}, {"viet": "Cuộc phỏng vấn tệ hơn anh ta mong đợi nhiều.", "eng": "The interview was far worse than he had expected."}, {"viet": "Sự kết hợp này là do người cha và người mẹ giao hợp với nhau mà có.", "eng": "The joining comes about when the mother and father mate."}, {"viet": "Chiếc chìa khoá quay nửa vòng và bị mắc kẹt.", "eng": "The key turned halfway and then jammed."}, {"viet": "Ông chủ nhà thiết đãi chúng tôi một chầu rượu miễn phí.", "eng": "The landlord gave us a drink on the house."}, {"viet": "Thời hạn giao món hàng này là hai tháng.", "eng": "The lead time on this item is two months."}, {"viet": "Tuổi thọ trung bình của chiếc xe ôtô loại vừa, sự hoạt động của chính phủ hiện nay.", "eng": "The life expectancy of the average car, the present government."}, {"viet": "Khúc gỗ bị dòng nước cuốn xuôi.", "eng": "The log was swirled away downstream by the current."}, {"viet": "Chiếc máy lấy tên của người đã phát minh ra nó.", "eng": "The machine takes its name from its inventor."}, {"viet": "Ban quản lý có quyền từ chối tiếp nhận.", "eng": "The management reserves the right to refuse admission."}, {"viet": "Vấn đề đó được hoãn lại cho đến cuộc họp tới.", "eng": "The matter was held over until the next meeting."}, {"viet": "Các thành viên của đoàn bồi thẩm đã được giải tán.", "eng": "The members of the jury were discharged."}, {"viet": "Ông bộ trưởng gửi đi một bản tuyên bố cho báo chí.", "eng": "The minister issued a statement to the press."}, {"viet": "Tâm trạng của khán giả có thể thay đổi trong nháy mắt.", "eng": "The mood of the crowd can change in the twinkling of an eye."}, {"viet": "Con chuột phóng mất khi tôi tới gần.", "eng": "The mouse darted away when I approached."}, {"viet": "Hải quân duy trì tuần tra trên không và trên biển 24 giờ trên 24, thí dụ để tìm những người sống sót sau một vụ đắm tàu.", "eng": "The navy are maintaining a 24-hour air and sea patrol."}, {"viet": "Khu nhà mới nằm ven xa lộ.", "eng": "The new housing estate borders on the motorway."}, {"viet": "Sân vận động mới vẫn chưa sẵn sàng được sử dụng.", "eng": "The new stadium is as yet unready for use."}, {"viet": "Viên lớn thứ hai đính trên vương miện của vua.", "eng": "The next largest one was set in his crown."}, {"viet": "Số 57306 có năm chữ số.", "eng": "The number 57306 contains five digits."}, {"viet": "Viên sĩ quan ra lệnh cho họ tiến lên.", "eng": "The officer directed them to advance."}, {"viet": "Cái sô-pha cũ kỹ sẽ phải bỏ đi thôi.", "eng": "The old settee will have to go."}, {"viet": "Tổ chức này được điều hành trên cơ sở tự nguyện.", "eng": "The organization is run on a voluntary basis."}, {"viet": "Đôi vớ ngắn không phải của người khách trọ này.", "eng": "The pair of socks are not the guest's."}, {"viet": "Quá khứ, hiện tại và tương lai.", "eng": "The past, the present and the future."}, {"viet": "Năm 2000 trước Công Nguyên, ấn Độ cũng đã dệt được vải bông.", "eng": "The people of India were weaving cotton cloth in 2000 B. C."}, {"viet": "Cuộc biểu diễn bản công-xéc-tô của nghệ sĩ dương cầm thật tuyệt vời.", "eng": "The pianist's execution of the concerto was marvellous."}, {"viet": "Nơi này đầy những người loại công nghiệp giải trí.", "eng": "The place was heaving with showbiz types."}, {"viet": "Đĩa này là một cái trong một cặp nhưng tôi đã làm vỡ cái đi cặp với nó rồi.", "eng": "The plate was one of a pair, but I broke its twin."}, {"viet": "Nhà thơ đó bày tỏ niềm say mê bốc lửa của mình cho người đàn bà anh yêu.", "eng": "The poet expressed his burning passion for the woman he loved."}, {"viet": "Cảnh sát đã soạn thảo một danh sách những kẻ tình nghi.", "eng": "The police have compiled a list of suspects."}, {"viet": "Cảnh sát nhan nhản mỗi khi tổng thống xuất hiện trước công chúng.", "eng": "The police were much in evidence whenever the President appeared in public."}, {"viet": "Anne's','the boy's','the boys''là những hình thái sở hữu.", "eng": "The possessive case'Anne's','the boy's','the boys''are possessive forms."}, {"viet": "Chức vụ tổng thống là khát vọng của anh ta từ khi còn là sinh viên đại học.", "eng": "The presidency has been his aspiration since his college."}, {"viet": "Ý kiến phổ biến là ủng hộ cải cách.", "eng": "The prevalent opinion is in favour of reform."}, {"viet": "Chữ in quá nhỏ, không có kính tôi không thể đọc được.", "eng": "The print is too small for me to read without glasses."}, {"viet": "Những nghề nghiệp bao gồm bác sĩ, y tá hoặc luật sư.", "eng": "The professions include being a doctor, nurse, or lawyer."}, {"viet": "Sự thịnh vượng của một quốc gia tuỳ thuộc vào mức sống của người dân thường.", "eng": "The prosperity of a country is up to the standard of living of the man in the street."}, {"viet": "Lời đề nghị của Nữ Hoàng ngang với một mệnh lệnh.", "eng": "The Queen's request was tantamount to a command."}, {"viet": "Mưa tuôn từ mái nhà xuống.", "eng": "The rain ran off the roof."}, {"viet": "Sự chuộc lại tài sản, hết nợ, các cổ phần, lời hứa.", "eng": "The redemption of one's property, debts, shares, promises."}, {"viet": "Bản báo cáo sinh động đến nỗi tôi cảm thấy dường như tôi ở đó.", "eng": "The report was so descriptive, I felt as if I were there."}, {"viet": "Các đồng lúa nằm ở đáy thung lũng, và lên tận các ngọn đồi với các thửa ruộng hình bậc thang do người nông dân tạo nên.", "eng": "The rice fields lie on the valley floors and climb hills on stairways of terraces built by the farmers."}, {"viet": "Con đường cấm xe cộ qua lại.", "eng": "The road is closed to vehicular traffic."}, {"viet": "Căn phòng được trang bị đồ đạc màu đỏ và nâu ấm áp.", "eng": "The room was furnished in warm reds and browns."}, {"viet": "Những biện pháp đề phòng an toàn không thoả đáng.", "eng": "The safety precautions are totally inadequate."}, {"viet": "Kế hoạch đó phải được cung cấp vốn đúng mức.", "eng": "The scheme must be properly resourced."}, {"viet": "Ca 2 bắt đầu từ 4 giờ chiều đến 12 giờ đêm.", "eng": "The second shift runs from 4 p. m. to 12 midnight."}, {"viet": "Đoạn cuối nông của bể bơi.", "eng": "The shallow end of a swimming pool."}, {"viet": "Con tàu thận trọng lách qua sương mù dày đặc.", "eng": "The ship was nosing its way through the fog."}, {"viet": "Cạnh XZ đối diện góc XYZ.", "eng": "The side XZ subtends the angle XYZ."}, {"viet": "Phía trên chúng ta, bầu trời trong xanh một màu.", "eng": "The sky was a clear blue over your heads."}, {"viet": "Đất bị nước lũ cuốn sạch, phơi ra những tảng đá trơ trụi.", "eng": "The soil was washed away by the flood, exposing bare rock."}, {"viet": "Khoảng đất rào kín cung điện rộng lớn này trải dài 1km từ Bắc đến Nam và 750 m trên trục đông-tây.", "eng": "The spacious palace compound stretches one kilometer from north to south and 750 meters on its east-west axis."}, {"viet": "Các nhân viên không bận tâm về giờ giấc công việc mới nhưng họ sẽ không chịu chấp nhận cắt giảm tiền lương.", "eng": "The staff don't mind the new work schedule but they would jib at taking a cut in wages."}, {"viet": "Hàng hoá được xếp vào kho.", "eng": "The storables were stowed in the warehouse."}, {"viet": "Các học sinh đến được trang bị bút viết và sách vở.", "eng": "The students came armed with pencils and notebooks."}, {"viet": "Các siêu cường không chắc có hoàn toàn giải trừ quân bị.", "eng": "The superpowers are unlikely to disarm completely."}, {"viet": "Thầy giáo chỉ định một ban mười người lo kế hoạch tham quan.", "eng": "The teacher appointed a committee of ten students to plan an excursion."}, {"viet": "Những khó khăn về chuyên môn của việc in màu.", "eng": "The technical difficulties of colour printing."}, {"viet": "Tên trộm che mặt bằng một chiếc bít tất dài.", "eng": "The thief masked his face with a stocking."}, {"viet": "Cơ thể chúng ta được hình thành bởi nhưng viên gạch nhỏ gọi là tế bào.", "eng": "The tiny bricks our bodies are built of are called cells."}, {"viet": "Tàu đi từ Luân Đôn đến Exetơ qua Brixton.", "eng": "The train goes from London to Exeter via Bristol."}, {"viet": "Các đội quân đã rút khỏi chiến trường.", "eng": "The troops have withdrawn from the battlefield."}, {"viet": "Hai bức tranh treo không thật ngang nhau-bức này cao hơn bức kia.", "eng": "The two pictures are not quite level-that one is higher than the other."}, {"viet": "Vũ trụ dần dần bộc lộ các điều bí mật trước các nhà khoa học.", "eng": "The universe is slowly yielding up its secrets to Scientists."}, {"viet": "Viđêô đã được lập trình sẵn để tự động bật lên lúc mười giờ.", "eng": "The video is programmed to switch itself on at ten o'clock."}, {"viet": "Thời tiết ấm vào mùa đông quả thật là một món quà ban thưởng của thiên nhiên.", "eng": "The warm weather in winter has been a real bonus."}, {"viet": "Những bánh xe phải quay đồng bộ.", "eng": "The wheels must synchronise as they revolve."}, {"viet": "Cửa sổ đóng vì trời mưa.", "eng": "The window was closed because it was raining."}, {"viet": "Công trình trị giá hơn 810.000 pao.", "eng": "The work will cost 810.000 pounds plus."}, {"viet": "Cầu thủ ten-nít trẻ rõ ràng có lợi thế hơn một chút trước đấu thủ già hơn của anh ta.", "eng": "The young tennis player definitely had the edge on his older opponent."}, {"viet": "Căn nhà của họ là vật bị giải toả cho con đường mới qua tỉnh.", "eng": "Their house was a casualty of the new road through the town."}, {"viet": "Năm của họ thoạt đầu có 12 tháng.", "eng": "Their year at first had 12 months in it."}, {"viet": "Còn có ( nhiều ) khả năng cải tiến trong công việc của anh.", "eng": "There's ( plenty of ) room for improvement in your work."}, {"viet": "Sức khoẻ của ông ta tốt hơn.", "eng": "There's been a change for the better in his health."}, {"viet": "Chỉ có duy nhất một cái gối-tôi sẽ tung đồng tiền với anh để xem ai được.", "eng": "There's only one pillow-I'll toss you for it."}, {"viet": "Tại Kansas và các phần đất khác cách xa biển ở Hoa Kỳ, đều có các lớp đá phấn.", "eng": "There are layers of chalk in Kansas and other parts of the United State that are far away from the sea."}, {"viet": "Vẫn còn quá nhiều người sống dưới mức tối thiểu.", "eng": "There are still too many people living below the poverty line."}, {"viet": "Lại có nhiều câu chuyên khác giống như thế.", "eng": "There have been other stories like it."}, {"viet": "Có một tiệm thuê băng viđêô trong xóm tôi.", "eng": "There is a video rental store in my neighborhood."}, {"viet": "Có vài chữ viết ở mặt bên kia của trang giấy.", "eng": "There is some writing on the other side of the page."}, {"viet": "Có một ngọn đèn treo trên cái bàn.", "eng": "There was a lamp hanging over the table."}, {"viet": "Có một sự biến đổi đột ngột về tình cảm công chúng thiên về người đàn bà bị tố cáo.", "eng": "There was revulsion of public feeling in favour of the accused woman."}, {"viet": "Sẽ có nhiều cuộc thương lượng cửa sau trước khi đạt được một hợp đồng.", "eng": "There will be a lot of wheeling and dealing before an agreement is reached."}, {"viet": "Chúng được làm bằng giấy cói.", "eng": "These first books were made of papyrus."}, {"viet": "Các câu này đều có chung một mẫu hình ngữ pháp.", "eng": "These sentences all have the same grammatical pattern."}, {"viet": "Họ nghèo quá không đủ tiền để đi nghỉ.", "eng": "They're too badly-off to have a holiday."}, {"viet": "Họ ở trong số những người ( công nhân ) lương thấp nhất nước.", "eng": "They are among the lowest-paid ( workers ) in the country."}, {"viet": "Họ lừa bịp chúng tôi để tham gia câu lạc bộ.", "eng": "They bamboozled us into joining the club."}, {"viet": "Họ tiếp tục chiến đấu trong hoàn cảnh bất lợi.", "eng": "They continue to fight in the face of adversity."}, {"viet": "Họ đã thuê nó trông nom đứa bé.", "eng": "They employed him to look after the baby."}, {"viet": "Họ không có cách nào để biết phương hướng lúc mây mù.", "eng": "They had no way of telling directions when it was cloudy."}, {"viet": "Họ đã làm quá sớm, đi xây nhà để xe trước khi được cấp giấy phép.", "eng": "They jumped the gun by building the garage before permission had been given."}, {"viet": "Họ đo vận tốc của cơn lốc tại đài khí tượng.", "eng": "They measured the velocity of the cyclone, at the observatory."}, {"viet": "Họ đã hứa là nếu bà ta tham gia, họ sẽ để cho bà ta có lợi.", "eng": "They promised to make it worth her while if she would take part."}, {"viet": "Họ bán nhiều loại rượu vang ở đây.", "eng": "They sell many different sorts of wine here."}, {"viet": "Họ đứng bên ngôi mộ bỏ mũ ra yên lặng cúi chào.", "eng": "They took off their hats by the grave in silent salute."}, {"viet": "Họ đang tươi rói lên vì sức khoẻ và hạnh phúc.", "eng": "They were blooming with health and happiness."}, {"viet": "Họ dan díu với nhau mấy năm trời trước khi lấy nhau.", "eng": "They were walking out for years before they got married."}, {"viet": "Sự ra vẻ quan tâm ấy của anh ta đối với âm nhạc hiện đại hoàn toàn là giả tạo.", "eng": "This apparent interest of his in modern music is completely pseudo."}, {"viet": "Đây là công ty quan trọng nhất trong kinh doanh dầu mỏ.", "eng": "This company is number one in the oil business."}, {"viet": "Bức tranh nổi tiếng này được coi là của Van Gogh nhưng thực ra nó là của giả.", "eng": "This famous painting was thought to be by Van Gogh, but it is in fact a forgery."}, {"viet": "Đây là dụng cụ tiện lợi để mở đồ hộp.", "eng": "This is a very convenient tool for opening cans."}, {"viet": "Đây không phải là một cái giường cũ bình thường-mà là cái giường của Shakespeare.", "eng": "This isn't any old bed-it belonged to Shakespeare."}, {"viet": "Tin tức này hỗ trợ thêm cho các báo cáo trước về cuộc ngừng bắn.", "eng": "This news lends some support to earlier reports of a ceasefire."}, {"viet": "Bảng báo giá này áp dụng đối với số lượng tối thiểu là 100 tá.", "eng": "This quotation is for a minimum quantity of 100 dozen."}, {"viet": "Kiểu y phục này được gọi là Âu phục.", "eng": "This style of clothing is called Western dress."}, {"viet": "Các con số bán ra năm nay có vẻ đáng hài lòng.", "eng": "This year's sales figures are looking good."}, {"viet": "Để sống được trong hang động họ phải đuổi những con gấu hang khổng lồ và nhiều con thú khác nữa ra.", "eng": "To live in the caves themselves they had do drive out giant cave bears and many other animals."}, {"viet": "Việc buôn bán trên thị trường chứng khoán hôm nay không sôi nổi.", "eng": "Trading on the Stock Exchange was light today."}, {"viet": "Những trầm tích dầu có giá trị đã được phát hiện qua khoan thử.", "eng": "Valuable deposits of oil have been found by drilling."}, {"viet": "Nước bị nhiệt biến thành hơi và bị lạnh biến thành băng.", "eng": "Water is changed into steam by heat and into ice by cold."}, {"viet": "Chúng ta sẽ tiết kiệm được thời gian nếu ta đi xuống con đường này.", "eng": "We'll save time if we go down this road."}, {"viet": "Chúng tôi gần như thường xuyên đến nhà thờ vào những ngày Chủ nhật.", "eng": "We're nearly always at church on Sundays."}, {"viet": "Chúng tôi có rất nhiều thì giờ trước khi tàu chạy.", "eng": "We've got heap of time before the train leaves."}, {"viet": "Tất cả chúng tôi xin chia buồn với ông trong sự tổn thất này.", "eng": "We all sympathize with you in your bereavement."}, {"viet": "Chúng tôi lấy làm hoan hỉ tham dự buổi tiệc cưới của anh ta.", "eng": "We are rejoiced to attend his wedding party."}, {"viet": "Chúng ta không thể trang bị hoàn toàn cho quân đội.", "eng": "We can't afford to equip the army properly."}, {"viet": "Chúng ta không thể nói về mọi thứ được.", "eng": "We can't talk about everything."}, {"viet": "Chúng tôi phát hiện ra là mình nhầm tầu.", "eng": "We discovered that we were on the wrong train."}, {"viet": "Chúng ta đã có được ấn tượng rất tốt đối với bà ấy.", "eng": "We formed a very favourable impression of her."}, {"viet": "Chúng tôi tìm nhà của họ thật là khốn khổ.", "eng": "We had the deuce of a time finding their house."}, {"viet": "Chúng tôi có sự ngưỡng mộ to lớn về tư cách đạo đức tốt của ông ta.", "eng": "We have great admiration for his good behaviour."}, {"viet": "Chúng tôi hy vọng rằng cuộc sống ở trường cao đẳng sẽ giúp cho nó hoạt bát hơn một tí.", "eng": "We hope college life will help him to spread his wings a bit."}, {"viet": "Bây giờ chúng tôi sẽ lấy hóa đơn.", "eng": "We'll take the bill now."}, {"viet": "Một ngày nào đấy chúng ta phải họp nhau lại uống một bữa.", "eng": "We must get together for a drink some time."}, {"viet": "Thật ngạc nhiên khi chúng tôi ghi nhận rằng doanh số bán hàng của các ông đối với sản phẩm của chúng tôi đã giảm sút rõ rệt trong vài tháng qua.", "eng": "We note with surprise that your sales of our products have apparently declined for the last few months."}, {"viet": "Chúng tôi liệt cô ta vào trong số những phóng viên giỏi nhất của chúng tôi.", "eng": "We reckon her among our best reporters."}, {"viet": "Chúng tôi muốn thêm một nhận xét nữa vào những nhận xét trước.", "eng": "We should like to add a rider to the previous remarks."}, {"viet": "Chúng tôi bắt đầu xoay trần ra dọn dẹp và chỉ trong một buổi chiều, toàn bộ ngôi nhà đã sạch sẽ gọn gàng.", "eng": "We turned to and got the whole house cleaned in an afternoon."}, {"viet": "Chúng tôi sửng sốt nghe tin cô ta lấy chồng.", "eng": "We were bowled over by the news of her marriage."}, {"viet": "Chúng tôi sẽ gọi bà khi nào xong.", "eng": "We will call you when it is ready."}, {"viet": "Vâng, món ăn Quảng Đông có phần thanh đạm, món ăn Bắc Kinh có nhiều dầu mỡ, còn món Tứ Xuyên đều có nhiều gia vị và cay, nhưng chúng có nhiều vị khác nhau.", "eng": "Well, Cantonese food is rather light, Beijing food is heavy, and Sichuan food is usually hot and spicy."}, {"viet": "À, chúng ta đi ăn tối với nhau và đi xem phim nhé?", "eng": "Well, shall we have dinner together and go to the movies?"}, {"viet": "Thời gian dài nhất mà cô ấy làm một công việc là bao lâu?", "eng": "What's the longest she's held down a job?"}, {"viet": "Công nghiệp quan trọng ở tỉnh anh là gì?", "eng": "What are the important industries in the town?"}, {"viet": "Ba bức tượng này có ý nghĩa gì?", "eng": "What do these three statues signify?"}, {"viet": "Ở nước bạn, người lớn tuổi có những sở thích phổ biến nào?", "eng": "What hobbies are popular with the elderly in your country?"}, {"viet": "Giá của bộ tiền giấy bao nhiêu?", "eng": "What is the price of this set of notes?"}, {"viet": "Chuyện gì làm bố thấy buồn, bố?", "eng": "What makes you feel sad, daddy?"}, {"viet": "Hiện giờ những thứ gì đang hợp thời trang ở Nhật?", "eng": "What things are trendy in Japan now?"}, {"viet": "Bao giờ thì anh lại lên Scotlen?", "eng": "When are you next going up to Scotland?"}, {"viet": "Khi tôi nêu lên vấn đề tài trợ, ông ta đã xen ngay vào rằng vấn đề đó đã được giải quyết.", "eng": "When I brought up the question of funding, he quickly interjected that it had been settled."}, {"viet": "Đến tuổi 21 thì cô ta được hưởng di sản thừa kế.", "eng": "When she was 21 she came into her inheritance."}, {"viet": "Khi chúng tôi đến nơi thì phim đã gần hết.", "eng": "When we arrived the film was already over."}, {"viet": "Tôi có thể thuê một xe cắm trại ở đâu?", "eng": "Where can I rent a camper?"}, {"viet": "Cô đề nghị những món nào ở nhà hàng đó?", "eng": "Which dishes do you recommend in the restaurant?"}, {"viet": "Mặc dầu tôi thừa nhận rằng có những khó khăn, nhưng tôi không đồng ý là những khó khăn đó không thể giải quyết được.", "eng": "While I admit that there are problems, I don't agree that they cannot be solved."}, {"viet": "Người chơi quần vợt bạn yêu thích là ai?", "eng": "Who is your favorite tennis player?"}, {"viet": "Tại sao không đem con trai đi theo?", "eng": "Why don't you bring Junior to the party?"}, {"viet": "Đội chúng ta sẽ bị đưa xuống hạng hai không?", "eng": "Will our team be relegated to the second division?"}, {"viet": "Liệu anh có còn ở đây khi tôi quay lại không?", "eng": "Will you still be here when I get back?"}, {"viet": "Do xuất thân từ tầng lớp lao động, tôi cảm thấy như cá trên cạn giữa đám người thượng lưu đó.", "eng": "With my working-class background I feel like a fish out of water among these high-society people."}, {"viet": "Sự lo lắng về công việc kinh doanh đã biến bà ta thành một người suy nhược thần kinh.", "eng": "Worry about the business has turned her into a nervous wreck."}, {"viet": "Bạn có thích chơi leo núi không?", "eng": "Would you like to go mountain climbing?"}, {"viet": "Anh làm ơn cho tôi biết tôi có thể đổi lại nhân dân tệ sang đô la Mỹ ở đâu không?", "eng": "Would you please tell me where 1 can change the RMB back into US dollars?"}, {"viet": "Có, ba con có năm cái áo sơ-mi cần ủi.", "eng": "Yes, daddy has five shirts that needs ironing."}, {"viet": "Phải, bạn đi vào hàng còn tôi sẽ lấy khay, dao và nĩa.", "eng": "Yes, you go and follow the line and I'm going to pick up the trays, and knives and forks."}, {"viet": "Các bạn sẽ phải chuyển sang phòng khác-tôi muốn dọn vệ sinh chỗ này.", "eng": "You'll have to shift yourselves to another room-I want to clean in here."}, {"viet": "Bà quá nôn nóng với cô ta, cô ta hãy còn là một đứa bé thôi.", "eng": "You're too impatient with her, she's only a child."}, {"viet": "Anh cần phải mua bảo hiểm.", "eng": "You are required to purchase insurance."}, {"viet": "Anh không thể mặc cái quần cũ này đi dự đám cưới, hoàn toàn không phù hợp.", "eng": "You can't wear those old trousers for the wedding it's absolutely not comme il faut."}, {"viet": "Bạn có thể thấy con sông trước mặt và những ngọn núi xa xa.", "eng": "You can see the river in the near distance and the mountains beyond."}, {"viet": "Cậu không cần phải được phép của tôi mới thay đổi các đồ vật.", "eng": "You don't need my say-so to change things."}, {"viet": "Anh phải xem các thay đổi này trong bối cảnh: chúng là bộ phận của một kế hoạch lớn hơn.", "eng": "You have to see these changes in context: they're part of a larger plan."}, {"viet": "Anh có thể không thích anh ta nhưng anh phải thán phục tính kiên trì của anh ta.", "eng": "You may not like him, but you've got to admire his persistence."}, {"viet": "Cậu phải nhận ra rằng trượt một kỳ thi chẳng phải là tận cùng của thế giới.", "eng": "You must realize that failing one exam is not the end of the world."}, {"viet": "Anh thực sự phải đi thôi!''Được, nếu anh khăng khăng muốn vậy'.", "eng": "You really must go!''All right, if you insist'."}, {"viet": "Anh nên đối đãi họ tôn kính hơn.", "eng": "You should treat them with more consideration."}, {"viet": "Anh sẽ chuốc vào thân nếu anh gửi lá thư giận dữ đó cho một người quyền thế như vậy.", "eng": "You will be doing yourself a disservice if you send that angry letter to such a powerful person."}, {"viet": "Hành vi của anh đã gây cho chúng tôi nhiều phiền hà.", "eng": "Your behaviour has occasioned us a lot of trouble."}, {"viet": "Đề nghị của anh không hợp lí, nó tuyệt đối không thành công.", "eng": "Your proposal is absurd it's an absolute nonstarter."}]