[{"viet": "Một quyển sách chỉ có các chuyên gia mới hiểu được.", "eng": "A book that is comprehensible only to specialists."}, {"viet": "Đứa bé thở khò khè vì bị cảm lạnh.", "eng": "A child snuffling with a bad cold."}, {"viet": "Một chòm sao có thể nhìn thấy được ở phía tây của bầu trời, ngay sau khi mặt trời lặn, sẽ lặn vào lúc nửa đêm và các chòm sao khác sẽ mọc lên ở hướng đông.", "eng": "A constellation visible in the western sky just after sunset will have set by midnight, and other constellations will have risen in the east."}, {"viet": "Một quyết định không có tiền lệ trong luật Anh.", "eng": "A decision not precedented in English law."}, {"viet": "Một ký ức lờ mờ những việc đã xảy ra.", "eng": "A dreamy recollection of what happened."}, {"viet": "Một cuốn phim đầy xảo thuật quay phim khiến cho không che đậy nổi một cốt truyện yếu kém.", "eng": "A film full of tricky camera work that fails to disguise a weak story."}, {"viet": "Một băng tội phạm làm giả giấy bạc mười bảng Anh.", "eng": "A gang of criminals counterfeiting ten-pound notes."}, {"viet": "Một câu chuyện kinh khủng về tra tấn và giết người.", "eng": "A grim little tale of torture and murder."}, {"viet": "Một lối tường thuật hết sức cường điệu về sự cố đó.", "eng": "A highly exaggerated version of the incident."}, {"viet": "Bộ đồ lắp ráp một đầu máy xe lửa mẫu.", "eng": "A kit to build a model railway locomotive."}, {"viet": "Một người suốt đời ủng hộ việc giải trừ quân bị.", "eng": "A life long of advocate of disarmament."}, {"viet": "Một cách bài trí mới hấp dẫn của tờ tạp chí.", "eng": "A magazine's attractive new page layout."}, {"viet": "Tòa án quân sự tuyên án tử hình bọn khủng bố.", "eng": "A military tribunal sentenced the terrorists to death."}, {"viet": "Một giám đốc mới trong sở này sẽ thực sự thúc đẩy công việc tiến mạnh.", "eng": "A new director in this department will really get things moving."}, {"viet": "Một bức tranh theo phong cách của Raphael.", "eng": "A painting in the manner of Raphael."}, {"viet": "Một bản ký hiệu phiên âm những điều họ nói.", "eng": "A phonetic transcription of what they said."}, {"viet": "Người lái xe phải chịu một phần trách nhiệm.", "eng": "A portion of the blame must be borne by the driver."}, {"viet": "Một sự mô tả hoàn toàn chung chung sự việc đó.", "eng": "A purely impressionistic description of the incident."}, {"viet": "Một khoản tiền thưởng không tương xứng với công sức của họ.", "eng": "A reward incommensurate with their efforts."}, {"viet": "Một nhà kho tồi tàn trong con đường nhỏ hẻo lánh.", "eng": "A scrubby little shed in a back street."}, {"viet": "Một tín hiệu bằng cờ đỏ.", "eng": "A signal made with a red flag."}, {"viet": "Viêm họng có thể làm bạn ho và việc ho lại làm họng đau hơn.", "eng": "A sore throat can make you cough, and coughing makes the throat worse."}, {"viet": "Một cuộc tấn công chiến lược nhắm vào vị trí yết hầu của địch.", "eng": "A strategic attack aimed at the enemy's jugular."}, {"viet": "Một cô con gái ở tuổi thanh thiếu niên xa cách dần mẹ của cô gái đó.", "eng": "A teenage girl growing away her mother."}, {"viet": "Một tay chuyên nghiệp thực thụ có thể làm thất bại những nỗ lực của tôi.", "eng": "A true professional could knock my efforts into a cocked had."}, {"viet": "Một người đầy thiện chí nhưng thiếu khả năng.", "eng": "A well-meaning but ineffectual person."}, {"viet": "Lơ đãng đọc lướt những bảng yết thị trên tường phòng đợi.", "eng": "Absent-mindedly perusing the notices on the waiting-room wall."}, {"viet": "Thêm muối vào thức ăn để mùi vị ngon hơn.", "eng": "Adding salt to food improves the flavour."}, {"viet": "Sau tất cả những gì đã được nói và làm, các nhà cạnh tranh của chúng tôi rốt cuộc đã thành công; họ đã lũng đoạn thị trường.", "eng": "After all was said and done, our competitors had the last laugh; they cornered the market."}, {"viet": "Sau vài buổi tập ở phòng thể dục, tôi cảm thấy khỏe hẳn lên.", "eng": "After several sessions at the gym, I feel a lot fitter."}, {"viet": "Agatha Christie là người phụ nữ trội nhất của các nhà văn viết truyện trinh thám.", "eng": "Agatha Christie, the queen of detective-story writers."}, {"viet": "Mọi cố gắng của tôi rốt cuộc đều thất bại.", "eng": "All my efforts ended in failure."}, {"viet": "Tất cả những người biết điều bí mật này đều là đối tượng nguy hiểm cho an ninh.", "eng": "All the people who know this secret represent a security risk."}, {"viet": "Mặc dù họ thua, đội bóng ấy vẫn chơi với tinh thần rất hăng hái.", "eng": "Although they lost, the team played with tremendous spirit."}, {"viet": "Một chiếc máy bay có độ bay cao tối đa là 20.000 bộ.", "eng": "An aircraft with a ceiling of 20,000 ft."}, {"viet": "Một bộ bách khoa được xuất bản trong 25 tuần.", "eng": "An encyclopedia published in 25 weekly parts."}, {"viet": "Một người chống lại nguyên nhân cấm sản xuất và bán rượu.", "eng": "An infidel to the prohibitionist cause."}, {"viet": "Một lệnh phóng thích ai khỏi tình trạng giam giữ.", "eng": "An order for somebody's release from captivity."}, {"viet": "Và lần này đừng quên hộ chiếu nhé.", "eng": "And this time don't forget your passport."}, {"viet": "Có ai cho giá trên 20 bảng Anh không?, người bán đấu giá rao.", "eng": "Any advance on £ 20?, called the auctioneer."}, {"viet": "Hầu hết mọi người phản đối đề nghị đó phải không?", "eng": "Are most people against the proposal?"}, {"viet": "Bạn ủng hộ hay chống lại kế hoạch làm đường mới?", "eng": "Are you for or against the new road scheme?"}, {"viet": "Vào những ngày cuối tuần, giờ làm việc của quý vị có giống như vậy không?", "eng": "Are your hours the same on weekends?"}, {"viet": "Về phần tôi, nếu cô ta thích cái bàn của tôi thì cô ta cứ việc lấy mà sử dụng.", "eng": "As far as I'm concerned, if it's my desk she wants she's welcome to it."}, {"viet": "Khi chúng tôi tới gần con bé, nó cầm gậy đánh tứ tung.", "eng": "As we approached her, she laid about her with a stick."}, {"viet": "Ít ra dưới thời họ, dân La Mã có hòa bình, thịnh vượng được hai thế kỷ.", "eng": "At least under them the Romans had peace and prosperity for two centuries."}, {"viet": "Tháng tám năm nay khí hậu như là nhiệt đới.", "eng": "August was almost tropical this year."}, {"viet": "Cẩn thận khi băng ngang qua đường.", "eng": "Be careful in crossing the road."}, {"viet": "Bắt cặp với ai chơi bài brít.", "eng": "Be somebody's partner at bridge."}, {"viet": "Biết đọc trước là cô bé có lợi thế ban đầu hơn các học sinh khác.", "eng": "Being already able to read gave her a head start over the other pupils."}, {"viet": "Sự phân biệt giới tính trắng trợn trong việc tuyển chọn nhân viên.", "eng": "Blatant sexism in the selection of staff."}, {"viet": "Nêu tất cả những điều khiếu nại của anh với ông chủ.", "eng": "Bring all your gripes to the boss."}, {"viet": "Nhưng ít ra con đã có thể gọi điện về nhà.", "eng": "But, you could have at least called."}, {"viet": "Nhưng một trong những mục đích của việc nghiên cứu thị trường là tìm hiểu xem có thị trường cho sản phẩm đó hay không và xem chúng ta có thể bán sản phẩm đó ở thị trường đó hay không.", "eng": "But one of the objects of market research is to find out whether there is a market for the product and whether we can sell the product in that market."}, {"viet": "Bằng cách phân tích các thành phần của câu, chúng ta hiểu rõ hơn về văn phạm Anh ngữ.", "eng": "By analyzing the parts of the sentence we learn more about English grammar."}, {"viet": "Đòi hỏi một cuộc đấu tranh công khai về những tiêu chuẩn an toàn.", "eng": "Call for a public inquiry into safety standards."}, {"viet": "Cho tôi nói chuyện với người quản lý của các anh đi?", "eng": "Can I speak to your manager?"}, {"viet": "Bạn có tiền lẻ đổi cho tôi tờ năm bảng Anh được không?", "eng": "Can you give me a five-pound note?"}, {"viet": "Cô có thể đưa tôi đến bệnh viện không?", "eng": "Can you take me to the hospital?"}, {"viet": "Các nhà sản xuất yêu cầu hoàn trả lại những xe ôtô bị khiếm khuyết trầm trọng.", "eng": "Cars with serious faults have been called in by the manufacturers."}, {"viet": "Trẻ con đang đùa giỡn trong hồ bơi.", "eng": "Children frolicking about in the swimming-pool."}, {"viet": "Giải tỏa một vụ bất hòa nhỏ giữa các đồng nghiệp.", "eng": "Clear up a misunderstanding between colleagues."}, {"viet": "Ngày nay những chương trình hài kịch đều rất dở.", "eng": "Comedy programs nowadays are third-rate."}, {"viet": "Chúc mừng chiến thắng của đội anh.", "eng": "Congratulations on the victory of your team."}, {"viet": "Chúng tôi có thể giúp được gì không?", "eng": "Could we help in any way?"}, {"viet": "Anh có thể cho tôi biết có thể mua những bộ tiền kim loại để sưu tầm ở đâu không?", "eng": "Could you tell me where I can buy sets of coins for collection purposes?"}, {"viet": "Đừng nói chuyện nữa và làm công việc của mày đi!", "eng": "Cut the chatter and get on with your work!"}, {"viet": "Không được phép trì hoãn, dù chỉ một ngày.", "eng": "Delay is not permissible, even for a single day."}, {"viet": "Xác định độ cao của một ngọn núi.", "eng": "Determine how high a mountain is."}, {"viet": "Anh tự tay dời hết chỗ đồ đạc đấy à?", "eng": "Did you move all this furniture on your own?"}, {"viet": "Khoảng cách xa không thành vấn đề đối với viễn thông hiện đại.", "eng": "Distance is no problem with modern telecommunications."}, {"viet": "Có phải các nhân viên bán hàng cứ vào nhà của khách hàng và nói: Đây là một sản phẩm mới tuyệt vời giải quyết được tất cả các vấn đề của quý vị không?", "eng": "Do the salesmen just walk into the customers'premises and say: Here's a wonderful new product to solve all your problems?"}, {"viet": "Bạn có thấy khó kết bạn mới không?", "eng": "Do you find it difficult to make new friends?"}, {"viet": "Ở nước bạn bạn có gặp vấn đề này không?", "eng": "Do you have this kind of problem in your country?"}, {"viet": "Bạn cảm phiền trông giùm Marry khi tôi đến cửa hàng được không?", "eng": "Do you mind baby-sitting Mary while I go to the store?"}, {"viet": "Cô có nghĩ là lễ hội powwow quan trọng không?", "eng": "Do you think powwows are important?"}, {"viet": "Bác sĩ cho biết tình trạng của bệnh nhân không có gì thay đổi.", "eng": "Doctors say there is no change in the patient's condition."}, {"viet": "Đừng để lòng trung thành riêng tư tác động đến sự xét đoán của bạn.", "eng": "Don't allow personal loyalty to colour your judgment."}, {"viet": "Đừng phơi cái này ngoài nắng.", "eng": "Don't expose this to sunlight."}, {"viet": "Đừng có rối rít như thế về mấy đứa trẻ.", "eng": "Don't make so much fuss over the children."}, {"viet": "Đừng kể cho tôi nó kết thúc ra sao-Tôi chưa đọc hết đâu.", "eng": "Don't tell me how it ends-I haven't read all the way through yet."}, {"viet": "Tiến sĩ Mitchell bị bệnh, do đó tôi sẽ thay mặt bà ta.", "eng": "Dr Mitchell's ill so I'm deputizing for her."}, {"viet": "Vùng đất định cư của người Hà Lan và người Anh ở Bắc Mỹ.", "eng": "Dutch and English settlements in North America."}, {"viet": "Xâm phạm quyền tự do của cá nhân.", "eng": "Encroach on the liberty of the individual."}, {"viet": "Ngay cả thư viện đó cũng rất xa đây, tôi e là vậy.", "eng": "Even that's quite far away, I'm afraid."}, {"viet": "Kiểm tra sinh viên kiến thức toán học của họ.", "eng": "Examine students on their knowledge of mathematics."}, {"viet": "Thám hiểm đáy biển trong một chiếc tàu ngầm.", "eng": "Exploring the sea bed in a submersible."}, {"viet": "Di chúc của người cha đã gây ra nhiều sự bất hòa trong con cái.", "eng": "Father's will caused much dissension among his children."}, {"viet": "Tìm một người thay thế cho Sue trong khi cô ta bị ốm.", "eng": "Find a replacement for Sue while she is ill."}, {"viet": "Quần ống loe đã lỗi thời từ nhiều năm nay.", "eng": "Flared trousers went out years ago."}, {"viet": "Đối với cô ta được sống sót qua cơn thử thách như thế thật là phi thường.", "eng": "For her to have survived such an ordeal was remarkable."}, {"viet": "Những kiểu đóng cổ phần gian lận trong công ty mới.", "eng": "Fraudulent applications for shares in the new company."}, {"viet": "Đưa ra một lời giải thích khó tin về nguyên nhân của tai nạn.", "eng": "Gave an incredible explanation of the cause of the accident."}, {"viet": "Những món quà trao đổi như là một tặng vật biểu hiện tình bạn.", "eng": "Gifts exchanged as a pledge of friendship."}, {"viet": "Nhờ bỏ hút thuốc mà cô ấy trông trẻ ra.", "eng": "Giving up smoking has taken years off her."}, {"viet": "Hàng hóa trên xe tải được che bằng một tấm vải dầu.", "eng": "Goods on a lorry covered by a tarpaulin."}, {"viet": "Nửa số dân làng buộc phải ra khỏi nhà vì ống dẫn nước chính bị vỡ làm ngập lụt.", "eng": "Half the village were flooded out by a burst water main."}, {"viet": "Bị chói mắt vì ánh nắng.", "eng": "Have the sun in one's eyes."}, {"viet": "Trước đây bạn có bao giờ nói chuyện với một người rất nổi tiếng chưa?", "eng": "Have you ever talked with a very famous person before?"}, {"viet": "Anh đã trả tiền cho cô ta về số hàng hóa đó chưa?", "eng": "Have you settled up with her for the goods?"}, {"viet": "Ông ta là một viên chức hành chính địa phương có nghĩa là một công chức.", "eng": "He's a local government administrator, that is to say a civil servant."}, {"viet": "Nó đã lặn biệt tăm từ khi tôi hỏi về số tiền nó nợ tôi.", "eng": "He's been lying low ever since I asked him for the money he owes me."}, {"viet": "Cậu ta bị bố ghét bỏ vì cậu ấy nói dối.", "eng": "He's in disgrace because he told a lie."}, {"viet": "Anh ta quá tự phụ-tôi muốn được thấy chứng minh rằng anh ta sai.", "eng": "He's so cocksure-I'd love to see him proved wrong."}, {"viet": "Ông ta làm như thể mình là một ông lớn.", "eng": "He act's as if he is one of the nobs."}, {"viet": "Anh ta đảm nhiệm mọi việc của công ty trong lúc ông bố đi vắng.", "eng": "He assumed full charge of the firm in his father's absence."}, {"viet": "Anh ta lái cuộc thảo luận vào đề tài bóng đá.", "eng": "He brought the discussion round to football."}, {"viet": "Hắn làm mẻ một trong những cái cốc đẹp nhất của tôi.", "eng": "He chipped one of my best glasses."}, {"viet": "Anh ta nói khàn khàn vài ba tiếng.", "eng": "He croaked out a few words."}, {"viet": "Ông ta chết trong một vụ đắm tàu ở ngoài khơi bờ biển phía nam.", "eng": "He died in a shipwreck off the south coast."}, {"viet": "Anh ta kết thúc bài nói bằng một câu chuyện vui.", "eng": "He ended off his speech by telling a very funny joke."}, {"viet": "Nó cảm thấy có cái gì đó tương tự lòng thương hại.", "eng": "He felt something akin to pity."}, {"viet": "Anh ta cho tôi một tấm séc béo bở.", "eng": "He gave me a nice fat cheque."}, {"viet": "Càng ngày anh ta càng trở nên ỷ lại vào cô ta.", "eng": "He grew increasingly to rely on her."}, {"viet": "Ông ấy phải cắt xén bớt tiền lương của mình.", "eng": "He had to take a cut in his salary."}, {"viet": "Ông ta đã bị xử phạt 1000 bảng Anh.", "eng": "He has been sentenced to pay a fine of £ 1000."}, {"viet": "Nó phải làm việc vào những ngày cuối tuần.", "eng": "He has to work at weekends."}, {"viet": "Ông ta là người Đan Mạch bởi vì ông sinh ra ở Đan Mạch nhưng ông trở thành công dân nước Anh vào năm 30 tuổi.", "eng": "He is a Dane inasmuch as he was born in Denmark, but he became a British citizen at the age of 30."}, {"viet": "Anh ta thường hay thô lỗ với tôi, thế mà tôi vẫn thích anh ta.", "eng": "He is often rude to me, but I like him nevertheless."}, {"viet": "Anh ấy đứng phắt dậy khi ông chủ bước vào.", "eng": "He jumped to his feet as the boss came in."}, {"viet": "Nó thích leo núi vào cuối tuần.", "eng": "He likes go climbing at weekends."}, {"viet": "Anh ta thua trận này, nhưng không nên cho rằng anh ta không thể là một nhà vô địch tương lai.", "eng": "He lost this match, but don't write him off as a future champion."}, {"viet": "Ông ta đã dọn đến vùng Leeds và làm chủ một nhà in.", "eng": "He moved to Leeds and set up as a printer."}, {"viet": "Anh ta đã không nhận ra một lỗi chính tả ở trang đầu tiên.", "eng": "He overlooked a spelling error on the first page."}, {"viet": "Anh ta trình bày vấn đề dưới một dạng hoàn toàn mới mẻ.", "eng": "He presented quite a new view of the affair."}, {"viet": "Anh ta giơ tay lên ra hiệu cho chúng tôi dừng lại.", "eng": "He raised his arm as a signal for us to stop."}, {"viet": "Trong mọi hoàn cảnh dễ dàng cũng như gay go, anh ta vẫn trung thành với tôi.", "eng": "He remained loyal to me through thick and thin."}, {"viet": "Anh ấy đánh giá ngựa rất tốt.", "eng": "He's a good judge of horseflesh."}, {"viet": "Rõ ràng anh ta là một ứng cử viên trội nhất.", "eng": "He's clearly the best candidate."}, {"viet": "Anh ta là bạn qua thư từ của tôi ở Nhật.", "eng": "He's my pen pal from Japan."}, {"viet": "Hắn ta đang cố tán tỉnh cô thư ký của hắn.", "eng": "He's trying to seduce his secretary."}, {"viet": "Nó nói rằng Nó sẽ không hợp tác phải không? Được chúng ta sẽ sớm giải quyết vấn đề này!", "eng": "He says He won't co-operate, does he? Well, we'll soon see about that!"}, {"viet": "Chắc ông ấy sẽ về đây ngay bây giờ.", "eng": "He should be here any minute now."}, {"viet": "Anh ta nhanh chóng bị khuất phục trước vẻ duyên dáng của nàng.", "eng": "He soon fell victim to her charms."}, {"viet": "Anh ta lái con thuyền một cách cẩn thận qua những tảng đá.", "eng": "He steered the boat carefully between the rocks."}, {"viet": "Ông ấy đã nghi rằng có một chỗ rò ở đâu đó dọc theo ống dẫn.", "eng": "He suspected that a leak was present somewhere along the pipe."}, {"viet": "Anh ta đập tay vào bàn để nhấn mạnh điều anh ta đang nói.", "eng": "He thumped the table with his hand to emphasize what he was saying."}, {"viet": "Anh ta bán đồ chơi cho một công ti lớn ở Niu Yooc.", "eng": "He travels in toys for a big company in New York."}, {"viet": "Anh ta sử dụng những lời lẽ mới đẹp đẽ làm sao!", "eng": "He used some pretty choice language!"}, {"viet": "Ông ta là một người nước ngoài như điều người ta nhận thấy ở giọng nói của ông ta.", "eng": "He was a foreigner, as they perceived from his accent."}, {"viet": "Anh ta vô tình không biết đến sự rắc rối do mình gây ra.", "eng": "He was blithely unaware of the trouble he had caused."}, {"viet": "Anh ta kinh tởm những điều anh ta thấy trong thành phố ấy.", "eng": "He was disgusted with what he saw in that town."}, {"viet": "Anh ta bị trúng hàng loạt nắm tuyết.", "eng": "He was hit by a volley of snowballs."}, {"viet": "Anh ta ở trên sân khấu trong gần suốt vở kịch.", "eng": "He was on the stage for most of the play."}, {"viet": "Ông ta đã bị bắn bởi một tên khủng bố mang súng máy.", "eng": "He was shot by a terrorist with a machine-gun."}, {"viet": "Ông ta quá kiêu căng nên không tham gia vào cuộc vui của chúng ta.", "eng": "He was too proud to join in our fun."}, {"viet": "Hắn cuỗm đi mất 10.000 bảng Anh của công ty.", "eng": "He went off with £ 10,000 of the company's money."}, {"viet": "Anh ta được danh hiệu Cầu thủ crickê của trường trong năm.", "eng": "He won the title school Boy Cricketer of the Year."}, {"viet": "Nghe bằng tai'và'chia ra thành bốn phần tư'là sự thừa từ.", "eng": "Hear with one's ears'and'divide into four quarters'are pleonasms."}, {"viet": "Việc bà ta bị bắt gây ra một vụ phản ứng bất ngờ trong giới báo chí.", "eng": "Her arrest produced a sudden reaction from the press."}, {"viet": "Quần áo cô ta ướt sũng nước mưa.", "eng": "Her clothes were sopping from the rain."}, {"viet": "Mắt bà ta soi mói lướt trên bộ áo mới của bà bạn.", "eng": "Her eyes ran critically over her friend's new dress."}, {"viet": "Hai tay cô ấy tái đi vì lạnh.", "eng": "Her hands were blue with cold."}, {"viet": "Quyển sách gần đây nhất của bà ấy bàn đến vấn đề người tàn tật.", "eng": "Her latest book discusses the problems of the disabled."}, {"viet": "Vở kịch mới của cô ta đã thu hút nhiều sự chú ý của quần chúng.", "eng": "Her new play has attracted a lot of publicity."}, {"viet": "Sự nhanh trí của cô ta đã cứu sống cậu bé.", "eng": "Her quick wits saved the boy's life."}, {"viet": "Bài diễn văn của bà ta được ( hội nghị ) hoan nghênh.", "eng": "Her speech went down well ( with the conference )."}, {"viet": "Những lời khen ngợi của cô ấy là chất kích thích làm việc chăm chỉ hơn.", "eng": "Her words of praise were a stimulus to work harder."}, {"viet": "Anh hãy che em khỏi cặp mắt nhìn chằm chằm của Day đi!", "eng": "Hide me from Day's garish eye!"}, {"viet": "Kẻ tấn công anh ta đã sấn sổ tiến lại gần anh ta với con dao.", "eng": "His attacker made at him with a knife."}, {"viet": "Anh ta thật là một người có sức lôi cuốn mạnh mẽ, nhưng tôi vẫn chưa tin anh ta.", "eng": "His charm is undeniable but still mistrust."}, {"viet": "Sự miễn cưỡng của anh ta về việc giải quyết những nguyên nhân của vấn đề.", "eng": "His disinclination to tackle the cause of the problem."}, {"viet": "Gia đình anh ta không khá giả lắm.", "eng": "His family is not very well off."}, {"viet": "Đầu của anh ta nhét đầy những điều vô bổ.", "eng": "His head is cluttered up with useless facts."}, {"viet": "Cuốn sách mới nhất của ông ta là vô giá trị, hình như ông ta cho rằng mình là một tác giả nổi tiếng thì có thể cứ viết bừa mà không sao cả!", "eng": "His latest book is rubbish, he seems to think that because he's a famous author he can get away with murder!"}, {"viet": "Tên ông, theo tiếng Trung Quốc, là Khổng Phu Tử.", "eng": "His name in Chinese was Kung-fu-tee."}, {"viet": "Thơ ông ca ngợi vẻ đẹp của thiên nhiên.", "eng": "His poetry celebrates the beauty of nature."}, {"viet": "Anh ta bị cắt lương ( mười phần trăm ).", "eng": "His salary has been cut ( by ten per cent )."}, {"viet": "Sự thành công của hắn chủ yếu nhờ vào may mắn.", "eng": "His success was largely due to luck."}, {"viet": "Vợ hắn đã có ảnh hưởng cải hóa đối với hắn.", "eng": "His wife has had a civilizing influence on him."}, {"viet": "Không phải mùa nghỉ, giá đi nghỉ hạ hơn.", "eng": "Holiday prices are lower out of season."}, {"viet": "Uống cô-ca cô-la và ăn bánh hăm-bơ-gơ nhé?", "eng": "How about a coke and a hamburger?"}, {"viet": "Làm sao mà anh tới muộn như vậy?", "eng": "How come you're so late?"}, {"viet": "Bạn đi làm bằng cách nào?", "eng": "How do you get to work?"}, {"viet": "Làm thủ tục hải quan mất bao lâu?", "eng": "How long does it take to get through customs?"}, {"viet": "Bạn làm việc một tuần bao nhiêu tiếng?", "eng": "How many hours a week do you work?"}, {"viet": "Ông cần rút ( ở ngân hàng ) bao nhiêu?", "eng": "How much do you need to take out ( of the bank )?"}, {"viet": "Schoeffer chắc hẳn sẽ phải vô cùng kinh ngạc khi biết có một ngày các bản in của cuốn sách đó có giá trị bằng số vàng tương đương trọng lượng của chúng.", "eng": "How surprised Schoeffer would have been if he had known that copies of this book would someday be worth their weight in gold."}, {"viet": "Các Hồ Đồng đại khái là những đường hẻm, ở đó quý khách có thể nhìn thấy những ngôi nhà đậm nét truyền thống Trung Quốc.", "eng": "Hutongs are something like lanes, where very traditional Chinese houses can be seen."}, {"viet": "Tôi muốn gặp ông Lương, trưởng bộ phận.", "eng": "I'd like to see Mr. Liang, the section chief."}, {"viet": "Tôi sẽ giải thích cho anh mọi thứ để ở đâu.", "eng": "I'll explain to you where everything goes."}, {"viet": "Em chỉ an tâm khi em biết anh bình an vô sự.", "eng": "I'll only relax when I know you're safe."}, {"viet": "Tôi e rằng anh ta đã bị phật ý vì nhận xét của anh đấy.", "eng": "I'm afraid he took your remarks personally."}, {"viet": "Tôi cảm thấy kha là đờ đẫn sau tất cả những chuyện ăn uống đêm qua.", "eng": "I'm feeling rather logy after all that eating and drinking last night."}, {"viet": "Tôi thực chán ngấy với lời ca thán liên miên của anh.", "eng": "I'm heartily sick of your constant complaining."}, {"viet": "Tôi không dám chắc là tôi có thành công hay không, nhưng chắc chắn tôi hy vọng như thế.", "eng": "I'm not sure if I'll succeed, but I certainly hope so."}, {"viet": "Xin lỗi tôi bị chậm, gần cầu có tắc nghẽn.", "eng": "I'm sorry I'm late there was a hold-up near the bridge."}, {"viet": "Tôi hoàn toàn không hài lòng về công việc anh làm.", "eng": "I'm thoroughly dissatisfied with your work."}, {"viet": "Tôi đã nghe nói nhiều về những việc làm của anh.", "eng": "I've been hearing a lot about your doings."}, {"viet": "Tôi đã có mẩu tin có thể làm anh thích thú đấy.", "eng": "I've got a snippet of information that might interest you."}, {"viet": "Tôi đã để kính của tôi lạc chỗ ở đâu rồi-không có trong túi của tôi.", "eng": "I've misplaced my glasses-they're not on my bag."}, {"viet": "Tôi đã đoạt giải được một kỳ nghỉ ở New York.''Thế cơ à?'.", "eng": "I've won a holiday in New York.''What?'."}, {"viet": "Bao giờ tôi cũng bắt đầu một ngày bằng việc xem xét kỹ thư từ gửi đến.", "eng": "I always start the day by going through my mail."}, {"viet": "Tôi tin chắc là mẫu mã tiên tiến này sẽ gây ấn tượng cho quý vị.", "eng": "I am sure that you'll be impressed with this advanced design."}, {"viet": "Tôi xin phép thuyết trình trước hội đồng.", "eng": "I beg leave to address the council."}, {"viet": "Tôi đến thăm cô ta chỉ cầu may, tôi đã không điện thoại báo cho cô ta trước.", "eng": "I came to see her on spec, I hadn't phoned her."}, {"viet": "Tôi không thể mở được cái hộp-có cách gì đặc biệt không?", "eng": "I can't open the box-is there a trick to it?"}, {"viet": "Tôi có thể cảm thấy một chiếc đinh đâm vào giày của tôi.", "eng": "I can feel a nail sticking into my shoe."}, {"viet": "Tôi không thể chịu được người đàn bà đó.", "eng": "I can't endure that woman."}, {"viet": "Nhân ngày hôn lễ, tôi xem đây là một vinh dự đặc biệt được thay mặt cho các bạn học của cô dâu xin chúc cô dâu gặp những điều may mắn tốt lành nhất.", "eng": "I consider it a special privilege to wish the bride on behalf of her classmates the best of luck on the occasion of her wedding."}, {"viet": "Tôi sẽ rất vui khi giới thiệu bạn với họ.", "eng": "I'd be glad to introduce you to them."}, {"viet": "Tôi làm việc đó vì anh ấy bảo tôi làm.", "eng": "I did it because he told me to."}, {"viet": "Tôi thật sự không ưa việc bà ta cứ bắt tôi phải chấp nhận những ý kiến cực đoan của bà ta.", "eng": "I do dislike having her extremist ideas rammed down my throat."}, {"viet": "Tôi không biết là nó có nói sự thật hay là không.", "eng": "I don't know whether he's telling the truth or not."}, {"viet": "Tôi nghĩ là chiếc ghế này không đủ vững chắc để có thể đứng lên.", "eng": "I don't think that chair's firm enough to stand on."}, {"viet": "Anh không muốn nài ép em nhiều, em sẽ không ra đi đấy chứ?", "eng": "I don't want to press you, but shouldn't you be leaving?"}, {"viet": "Tôi khiếp sợ là có thể sẽ không bao giờ gặp lại anh nữa.", "eng": "I dread that I may never see you again."}, {"viet": "Tôi cảm thấy mình đang bế tắc trong công việc này.", "eng": "I feel I'm stagnating in this job."}, {"viet": "Tôi thấy khó có thể phán đoán được cuộc bầu cử sẽ diễn ra như thế nào.", "eng": "I find it hard to judge how the election will go."}, {"viet": "Tôi cho là hôn nhân của họ kéo dài đến nửa năm là cùng.", "eng": "I give their marriage six months at the very most."}, {"viet": "Tôi bị ngã từ trên lưng ngựa và gãy tay.", "eng": "I had a fall from a horse and broke my arm."}, {"viet": "Tôi phải trả tới 8200 pao để chữa cái xe ôtô của tôi!", "eng": "I had to pay out 8200 pounds to get my car repaired!"}, {"viet": "Tôi đã thu xếp với ngân hàng của anh để đổi các chi phiếu ra tiền mặt ở đây.", "eng": "I have an arrangement with your bank to cash cheques here."}, {"viet": "Không có ngôn từ nào có thể diễn đạt hết sự biết ơn của tôi.", "eng": "I have no words to express my thanks."}, {"viet": "Tôi đã gói xong các gói và đã sẵn sàng để đem gửi bưu điện.", "eng": "I have wrapped the parcels and they're ready to be posted."}, {"viet": "Tôi nghe nói họ đã thua hơn mười nghìn ván bài ấy.", "eng": "I hear they've dropped over ten thousand on the deal."}, {"viet": "Tôi hy vọng rằng các thùng gỗ đó sẽ đủ chắc chắn.", "eng": "I hope the crates will be strong enough."}, {"viet": "Tôi không thể nào nói giỏi được.", "eng": "I just can't speak it well."}, {"viet": "Tôi biết rõ nơi đó, vậy để tôi làm người hướng dẫn cho'.", "eng": "I know the place well, so let me be your guide'."}, {"viet": "Tôi cũng thích chơi bóng đá nữa.", "eng": "I like to play football, too."}, {"viet": "Tôi lái xe và anh chỉ đường.", "eng": "I'll driver the car; you navigate."}, {"viet": "Tôi sẽ ở đây cho anh có bầu có bạn.", "eng": "I'll stay here and keep you company."}, {"viet": "Tôi đang trông đợi sự giúp đỡ của anh.", "eng": "I'm banking on your help."}, {"viet": "Lâu lâu tôi lại nghỉ một ngày.", "eng": "I'm just taking one day at a time."}, {"viet": "Tôi rất tiếc đã để anh phải chờ.", "eng": "I'm sorry to keep you waiting."}, {"viet": "Con đã tính gọi, nhưng không tìm được điện thoại.", "eng": "I meant to, but I couldn't find a phone."}, {"viet": "Tôi phải nói là tôi thán phục anh ta-chưa bao giờ tôi nghĩ là anh ta được lọt vào đội một.", "eng": "I must say I take my hat off to him-I never thought he would get into the first team."}, {"viet": "Tôi không bao giờ đi qua ngôi nhà cũ của tôi mà không nghĩ đến những năm hạnh phúc tôi đã sống ở đó.", "eng": "I never pass my old house but I think of the happy years I spent there."}, {"viet": "Tôi xếp cô ta vào loại người cơ hội.", "eng": "I pegged her as an opportunist."}, {"viet": "Tôi đã đi tới kết luận rằng hắn ta đã nói dối.", "eng": "I reached the conclusion he's been lying."}, {"viet": "Tôi tiếc mình không có điều kiện để giúp anh.", "eng": "I regret I am not in a position to help you."}, {"viet": "Hôm nọ tôi gặp Peter, à này, anh ta mời chúng ta ăn trưa vào tuần tới đấy.", "eng": "I saw Peter the day other, incidentally, he's invited us to lunch next week."}, {"viet": "Chắc tôi sẽ bị suy sụp lần nữa nếu tôi ở lâu hơn trong cái nhà này.", "eng": "I shall probably have another breakdown if I stay any longer in this house."}, {"viet": "Tôi để cả buổi sáng giẫy cỏ ( ngoài vườn ).", "eng": "I spent the morning weeding ( the garden )."}, {"viet": "Tôi coi như thế là xong-chúng tôi đã nghe đề nghị cuối cùng của ông rồi đấy?", "eng": "I take it that's that-we've heard your final offer?"}, {"viet": "Tôi nghĩ là bây giờ họ mở cửa rồi.", "eng": "I think it is open now."}, {"viet": "Tôi nghĩ rằng anh cần phải sửa đổi lại các con số tổng cộng của anh cho chính xác hơn.", "eng": "I think you should rework your sums."}, {"viet": "Do sơ suất tôi đã không cầm cái túi của tôi mà cầm cái túi của ông.", "eng": "I took your bag instead of mine by mistake."}, {"viet": "Trước kia tôi sống ở Luân Đôn.", "eng": "I used to live in London."}, {"viet": "Tôi muốn anh làm ơn cho tôi một việc, anh có thể cho tôi mượn ô tô của anh được không?", "eng": "I want to ask a favor of you, will you lend me your car?"}, {"viet": "Tôi đã muốn đi xem phim, nhưng nó chật ních người đến nỗi chúng tôi không thể kiếm được một chỗ.", "eng": "I wanted to go to the movies, but it was so packed we couldn't get a seat."}, {"viet": "Tôi bị ép buộc phải ký một hợp đồng trái với ý muốn của tôi.", "eng": "I was forced to sign the agreement against my will."}, {"viet": "Tôi được cô tôi nuôi nấng tại một nông trại.", "eng": "I was raised by my aunt on a farm."}, {"viet": "Tôi thức suốt đêm với cháu bé bị ốm.", "eng": "I was up all night with a sick child."}, {"viet": "Tôi sẽ không khi nào chấp nhận những đòi hỏi của họ.", "eng": "I will never agree to their demands."}, {"viet": "Tôi không thể chịu được sự thô lỗ của anh thêm nữa đâu.", "eng": "I won't stick your rudeness any longer."}, {"viet": "Tôi sẽ bỏ ra bất cứ thứ gì để điều này đừng xảy ra.", "eng": "I would give anything for this not to have happened."}, {"viet": "Tôi không bao giờ cho tiếng Đức là một thứ ngôn ngữ dễ.", "eng": "I would never call German an easy language."}, {"viet": "Nếu một phim được biên tập tốt, nó có thể đóng góp lớn để tăng phần hấp dẫn.", "eng": "If a film is well edited, it can add greatly to its excitement."}, {"viet": "Nếu không tận mắt nhìn thấy, có lẽ tôi đã không tin điều đó.", "eng": "If I hadn't seen it with my own eyes I wouldn't have believed it."}, {"viet": "Nếu dân chúng bắt được anh ta, họ sẽ treo cổ hắn tại một cây gần nhất.", "eng": "If the crowd catches him, they'll string him up on the nearest tree."}, {"viet": "Nếu chúng tôi chỉ có được 5 phút để ra tàu thì sẽ quá ít ỏi.", "eng": "If we only allow five minutes for catching our train, we'll be cutting it too fine."}, {"viet": "Nếu mày tiếp tục trộm cắp thì rồi cuối cùng mày sẽ vào tù.", "eng": "If you continue to steal you'll end up in prison."}, {"viet": "Nếu cậu đụng đến đứa bé đó, tớ sẽ không tha thứ cho cậu.", "eng": "If you lay a finger on that boy, I'll never forgive you."}, {"viet": "Nếu anh muốn thay đổi chính phủ như thay đồ lót thì anh nên di cư tới một nước nhỏ chính trị hỗn độn nào đó.", "eng": "If you want to change the governments like underwear, may be you should emigrate to some banana republic."}, {"viet": "Bực bội về hàng dài mua vé.", "eng": "In a grouch about the long line for tickets."}, {"viet": "Thật ra, tôi sẽ nằm ngủ giường trên mà.", "eng": "In fact, I'll take the upper berth."}, {"viet": "Trong công việc làm trước đây của tôi, hàng ngày tôi thường ra thành phố.", "eng": "In my previous job, I used to travel to the city everyday."}, {"viet": "Trong bầu không khí phê bình hiện nay, tác phẩm của bà ta không được mến mộ.", "eng": "In the current critical climate her work is not popular."}, {"viet": "Trong các cụm từ at home, in the hall, on Sunday, by train, at, in, on, by là các giới từ.", "eng": "In these phrases at home, in the hall, on Sunday, by train, at, in, on, by are prepositions."}, {"viet": "Thông tin được thu thập từ nhiều sách tham khảo khác nhau.", "eng": "Information culled from various reference books."}, {"viet": "Đây là điều tôi tưởng tượng ra hay quả thật là anh đã sụt cân đi nhiều?", "eng": "Is it my imagination or have you lost a lot of weight?"}, {"viet": "Đến đó sớm có được cái thuận lợi gì không?", "eng": "Is there any advantage to be gained from getting there early?"}, {"viet": "Bây giờ trà không nhạt quá à?", "eng": "Isn't it too weak now?"}, {"viet": "Nó có diện tích bằng quận Aichi.", "eng": "It's about the same size as Aichi-prefecture."}, {"viet": "Cách nó đối xử với mẹ nó thật là đáng xấu hổ.", "eng": "It's disgraceful the way he treats his mother."}, {"viet": "Đem theo quần áo ấm đi nghỉ vào mùa Đông là quyết định đúng.", "eng": "It's just common sense to take clothes on holiday in winter."}, {"viet": "Chẳng phải vì trọng lượng mà những cái bao này khó khênh vác, mà chính là do kích thước của nó cồng kềnh.", "eng": "It's not their weight that makes these sacks hard to carry, it's their bulk."}, {"viet": "Đây là thời điểm tốt nhất để trượt tuyết ở đây, tại nơi nghỉ này.", "eng": "It's the best time to ski here in this resort."}, {"viet": "Trời tối rồi-Để tôi kéo rèm.", "eng": "It's getting dark I'd better draw the curtain."}, {"viet": "Nó đã trở thành nhiệm vụ nặng nề rồi.", "eng": "It has become a large task."}, {"viet": "Thật khó mà làm việc có hiệu quả tại một chỗ chật hẹp như vậy.", "eng": "It is hard to work efficiently in suck a confined space."}, {"viet": "Đã thành thông lệ là phải nộp một số tiền ký gửi cho đơn đặt hàng của mình.", "eng": "It is standard practice to pay a deposit with one's order."}, {"viet": "Nó có thể bị co khi nhúng nước nóng đấy.", "eng": "It might shrink in hot water."}, {"viet": "Hiện giờ không có sẵn loại cà phê này.", "eng": "It's not available at the moment."}, {"viet": "Dường như có nhiều thứ khác nhau để lựa chọn quá.", "eng": "It seems there's a great variety to choose from."}, {"viet": "Đây là một nhiệm vụ khó khăn, nhưng chúng ta đã hoàn thành tốt đẹp.", "eng": "It was a difficult task, but we brought it off."}, {"viet": "Đến được London vào giữa trưa là tốc độ đi khá lắm.", "eng": "It was good going to reach London by midday."}, {"viet": "Đó là cái đòn cuối cùng vào những bất hạnh của anh ta.", "eng": "It was the copestone of his misfortunes."}, {"viet": "Sẽ nguy hiểm nếu xem thường khả năng của anh ta.", "eng": "It would be dangerous to underrate his ability."}, {"viet": "Phụ nữ Nhật không quan tâm tới công cuộc giải phóng phụ nữ, đó là điển hình.", "eng": "Japanese women are not interested in women's liberation, for example."}, {"viet": "Đánh giá người nào đó theo những công trạng của chính họ.", "eng": "Judge somebody on his own merits."}, {"viet": "Công đảng đã không thắng cử dễ dàng ở khu Đông Oxford.", "eng": "Labour did not have an easy election victory in East Oxford."}, {"viet": "Vậy ta bảo nó nên nhận một công việc, và rồi nó sẽ muốn tiếp tục đi học tốt nghiệp ở trường.", "eng": "Let's tell him he should get a job, and then he'll want to go graduate school."}, {"viet": "Cuộc sống ngày nay được phân chia thành làm việc và nghỉ ngơi.", "eng": "Life today is compartmentalized into work and leisure."}, {"viet": "Nhiều thanh niên trong chúng ta không biết các điệu nhảy xưa.", "eng": "Many of our young people don't know the old dances."}, {"viet": "Trịnh trọng đưa người vào yết kiến Nữ hoàng.", "eng": "Marshal people into the presence of the Queen."}, {"viet": "Tôi có thể biết khi nào bạn tôi có thể nhận giấy chuyển tiền không?", "eng": "May I know when my friend can receive the remittance?"}, {"viet": "Cái của cháu màu nâu sọc đỏ bao quanh.", "eng": "Mine is brown with a red stripe around it."}, {"viet": "Phần lớn các yêu sách về tiền lương đã được giải quyết bằng thoả hiệp.", "eng": "Most wage claims are settled by compromise."}, {"viet": "Trợ lý của tôi sẽ thay mặt cho tôi khi tôi đi vắng.", "eng": "My assistant will stand in for me while I'm away."}, {"viet": "Bố tôi và tôi không bao giờ đồng ý với nhau.", "eng": "My father and I have never seen eye to eye."}, {"viet": "Điều phàn nàn của tôi là giá cả những đồ giải khát.", "eng": "My main gripe was the price of refreshments."}, {"viet": "Chị Lucy của tôi lúc nào cũng cố gắng theo dõi vòng eo của chị ấy bằng cách gắn chặt với chế độ ăn kiêng nghiêm ngặt gồm các món ăn không có tinh bột, nhưng chị ấy cứ liên tục tăng cân.", "eng": "My sister Lucy is always trying to watch their waistline by adhering to a strict diet of non-starchy foods, but she keeps putting on weight."}, {"viet": "Không đời nào! cô ta đáp, người ưỡn thẳng.", "eng": "Never!'she replied, drawing herself up to her full height."}, {"viet": "Không, tôi đang tìm bạn bè tôi.", "eng": "No, I am looking for my friends."}, {"viet": "Không có chứng cứ mới nào nảy ra trong quá trình điều tra.", "eng": "No new evidence emerged during the enquiry."}, {"viet": "Tôi hiện là sinh viên đại học.", "eng": "Now I'm a student at a university."}, {"viet": "Tất nhiên cái áo mà tôi thích hơn cả là áo đắt nhất.", "eng": "Of course the coat I like best cost the most."}, {"viet": "Được rồi, anh sẽ thử đóng xem sao.", "eng": "OK, I'll give it a try."}, {"viet": "Một khi anh ta bắt đầu nói về công việc kiểm duyệt, anh không thể nào ngăn lại được-đó là chủ đề ưa thích của anh ta.", "eng": "Once he starts talking about censorship you can't stop him-it's his pet subject."}, {"viet": "Một trong những hậu quả của căn bệnh này là rụng tóc.", "eng": "One of the effects of this illness is that you lose your hair."}, {"viet": "Xe của chúng tôi bị hỏng máy trên xa lộ.", "eng": "Our car had a breakdown on the motorway."}, {"viet": "Mối quan tâm trước mắt của chúng ta là đối với gia đình những người đã chết.", "eng": "Our immediate concern is for the families of those who died."}, {"viet": "Cửa hàng chúng tôi chuyên về thư pháp và tranh.", "eng": "Our store specializes in calligraphy and paintings."}, {"viet": "Cha mẹ có trách nhiệm đối với hạnh phúc của con cái.", "eng": "Parents are responsible for the welfare of their children."}, {"viet": "Người ta mang nó trên vali đi xuống đường trong ngày hội.", "eng": "People carry it down the street on their shoulders during a festival."}, {"viet": "Picnic là một hoạt động giải trí ngoài trời rất tốt.", "eng": "Picnic is a good open-air recreation."}, {"viet": "Ngày nay bơ thực vật không có chất tạo thành cholesterol trong máu rất phổ biến.", "eng": "Polyunsaturated margarine is very popular now."}, {"viet": "Sarah đang đi sang Paris với Pierre theo kế hoạch trao đổi, và sang năm anh ấy lại sang Scotland ở đây với cô ta.", "eng": "Sarah is going on an exchange to Paris to stay with Pierre, and he is coming to stay with her here in Scotland next year."}, {"viet": "Đến lúc đề án này hoàn thành thì tôi đã nằm dưới mồ rồi.", "eng": "Shall be pushing up daisies by the time the project is finished."}, {"viet": "Bà ta là một con người rất dai, bà ta sẽ không chấp nhận câu trả lời'không'.", "eng": "She's a most insistent person, she won't take'no'for an answer."}, {"viet": "Cô ta chắc chắn là đã sử dụng các cơ hội của mình một cách tối ưu.", "eng": "She's certainly made the best use of her opportunities."}, {"viet": "Cô ta rất thích tham dự vào bất cứ những cuộc thảo luận nào về dự án mới.", "eng": "She's keen to get in on any discussions about the new project."}, {"viet": "Cô ấy quá đần độn nên anh phải giải thích kỹ mọi thứ.", "eng": "She's so stupid that you have to spell everything out."}, {"viet": "Cô ấy viết địa chỉ lá thư cho bà Wilson.", "eng": "She addressed the letter to Mrs Wilson."}, {"viet": "Cô ta tự làm mình mang tiếng vì đi làm muộn một giờ.", "eng": "She blotted her copy-book by being an hour late for work."}, {"viet": "Cô ta khiếu nại về những bất công mà cô phải chịu đựng.", "eng": "She complained of the wrongs she had suffered."}, {"viet": "Cô ấy có được niềm vui thú lớn trong âm nhạc.", "eng": "She derived great enjoyment from music."}, {"viet": "Cô ấy kiếm được 16.000 đô la một năm không phải đóng thuế công việc ở nước ngoài.", "eng": "She earns $ 16000 a year tax-free in her job overseas."}, {"viet": "Cô ấy quên cách giải bài đố ô chữ.", "eng": "She forgot how the puzzle fitted together."}, {"viet": "Chị ấy đạt kết quả hạng nhất trong các kỳ thi.", "eng": "She got first-class results in her exams."}, {"viet": "Bà ta phải ra hầu toà để làm chứng.", "eng": "She had to appear in court to give evidence."}, {"viet": "Cô ta không bao giờ giỏi chuyện giấu giếm che đậy.", "eng": "She has never be en adroit at concealment."}, {"viet": "Cô ấy thừa hưởng một món tiền nhỏ từ ông mình.", "eng": "She inherited a little money from her grandfather."}, {"viet": "Bà ta được sắp xếp đọc diễn văn vào tối nay.", "eng": "She is scheduled to give a speech tonight."}, {"viet": "Cô ấy đã học thuộc cả bài để có thể nhắc lại vào hôm sau.", "eng": "She learnt the whole lesson so that she could repeat it the next day."}, {"viet": "Cô ta thích cái cảm giác ánh nắng mơn man trên làn da.", "eng": "She loved the feel of the sun on her skin."}, {"viet": "Cô ấy không bao giờ đi chệch khỏi những thói quen vốn có của mình.", "eng": "She never deviates from her regular habits."}, {"viet": "Cô ấy đã van nài anh ta đừng bỏ cô một mình.", "eng": "She pleaded with him not to leave her alone."}, {"viet": "Bà ta từ chối không chịu sửa đổi các nguyên tắc của mình.", "eng": "She refused to compromise her principles."}, {"viet": "Cô ấy mê mẩn suốt ngày.", "eng": "She's been in a trance all day."}, {"viet": "Cô bé cao so với tuổi của cô bé.", "eng": "She's tall for her age."}, {"viet": "Cô ấy dường như thích thú với sự đau khổ của chúng tôi.", "eng": "She seemed to take pleasure in our suffering."}, {"viet": "Cô ta chậm bước lại nên tôi có thể đi kịp cô.", "eng": "She slowed down her pace so I could keep up with her."}, {"viet": "Cô ta vùng vẫy để thoát khỏi những tên tấn công cô.", "eng": "She struggled to get away from her attacker."}, {"viet": "Cô ta bảo tôi là người ích kỉ, đáng ghét, thô lỗ, xấu xí và tất cả những thứ đó.", "eng": "She told me I was selfish, hateful, rude, ugly, and all that jazz."}, {"viet": "Cô ta vốn nhút nhát ghê lắm, nhưng một năm ở nước ngoài đã làm cô ta thay đổi hẳn.", "eng": "She used to be terribly shy, but a year abroad has completely transformed her."}, {"viet": "Cô ta bối rối vì sự xuất hiện đột ngột của anh ta tại buổi liên hoan.", "eng": "She was agitated by his sudden appearance at the party."}, {"viet": "Cô ta bị xao lãng ( khỏi công việc ) bởi tiếng ồn bên ngoài.", "eng": "She was distracted ( from her work ) by the noise outside."}, {"viet": "Bà ấy đã tử tế thết chúng tôi một bữa.", "eng": "She was kind enough to stand us a meal."}, {"viet": "Cô ta cưa tới cưa lui ổ bánh mì bằng con dao cùn.", "eng": "She was sawing the bread with a blunt knife."}, {"viet": "Cô ấy không khoẻ và không thể chơi trong những trận đấu lớn.", "eng": "She was unfit and couldn't play in the big match."}, {"viet": "Cô bé đi ngủ một cách ngoan ngoãn lúc 7 giờ.", "eng": "She went to bed obediently at 7 o'clock."}, {"viet": "Cô ta đã làm việc ở Pháp trong suốt kỳ nghỉ dài.", "eng": "She worked in France during the long vacation."}, {"viet": "Bỏ qua các thủ tục thông thường để công việc được giải quyết nhanh.", "eng": "Short-circuit the normal procedures to get something done quickly."}, {"viet": "Nào, bình tĩnh lại và đừng có la hét nữa.", "eng": "Simmer down, now, and stop shouting."}, {"viet": "Xèo xèo và suỵt là những từ tượng thanh.", "eng": "Sizzle and hush are onomatopoetic words."}, {"viet": "Hút thuốc có hại cho sức khoẻ.", "eng": "Smoking is injurious to the health."}, {"viet": "Thế là mày đã nhảy sang phe cánh bên kia, đồ phản bội đê tiện!", "eng": "So you've changed sides, you dirty rat!"}, {"viet": "Một vài phó từ tiếng Anh dùng như tính từ.", "eng": "Some English adverbs function as adjectives."}, {"viet": "Một số người thích thể thao, ngược lại một số người lại ghét nó.", "eng": "Some people enjoy sport, whereas others hate it."}, {"viet": "Có ai đã làm xước mặt bóng véc-ni trên bàn giấy của tôi rồi.", "eng": "Someone's scratched the varnish on my desk."}, {"viet": "Những sóng âm được đo bằng tầm hoạt động của chúng.", "eng": "Sound waves are measured by their amplitude."}, {"viet": "Xếp đĩa vào kệ ráo nước.", "eng": "Stack up the dishes on the draining board."}, {"viet": "Hãy khuấy ly cà phê để cho cặn lắng xuống.", "eng": "Stir the coffee to settle the grounds."}, {"viet": "Dâu tây không bao giờ bày bán lâu.", "eng": "Strawberries are never in for long."}, {"viet": "Như là ớn lạnh, sổ mũi, ho, sốt, hoặc hắt hơi.", "eng": "Such as the chills, a runny nose, a cough, a fever, or sneezing."}, {"viet": "Ánh nắng mặt trời có tác dụng chữa bệnh.", "eng": "Sunshine can have a therapeutic effect."}, {"viet": "Bàn dành cho 8 người ở tầng một hiện đã hết rồi.", "eng": "Tables for eight on the first floor are not available now."}, {"viet": "Hãy nói chuyện bình tĩnh không dùng tới những lời đe dọa.", "eng": "Talk calmly without resort to threats."}, {"viet": "Hãy bảo bọn trẻ đừng có nghịch nữa.", "eng": "Tell the children to keep out of mischief."}, {"viet": "Cám ơn về lời mời, nếu có dịp có lẽ chúng tôi sẽ nhận lời với anh.", "eng": "Thanks for the invitation, we may take you up on it sometime."}, {"viet": "Thằng bé này bao giờ cũng bị lẻ ra khi lũ trẻ chia thành đội.", "eng": "That boy is always the odd man out when the children are divided into teams."}, {"viet": "Đó là một vấn đề riêng biệt, không liên quan gì tới cuộc thảo luận của chúng ta.", "eng": "That is a separate issue and irrelevant to our discussion."}, {"viet": "Cái đó là một loại nĩa dùng để giữ hoặc trở thịt trên bếp lửa.", "eng": "That one is a kind of fork for holding or turning meat over the fire."}, {"viet": "Mùi đó gợi nhớ đến trường học.", "eng": "That smell is evocative of school."}, {"viet": "Đồng 10 xu sẽ hồi lại.", "eng": "The 10 cents will he returned."}, {"viet": "Thành tích của một vận động viên và một nhà văn không thể so sánh với nhau được.", "eng": "The achievements of an athlete and a writer are not comparable."}, {"viet": "Chiếc máy bay khuất vào trong mây.", "eng": "The aircraft was swallowed up in the clouds."}, {"viet": "Câu đáp số là 62-hoàn toàn đúng.", "eng": "The answer is 62-quite right."}, {"viet": "Quân đội đã rút lui sau trận đánh.", "eng": "The army pulled back after the battle."}, {"viet": "Khán giả đã cười ở tất cả những đoạn thú vị, thí dụ trong một vở kịch.", "eng": "The audience laughed in all the right places."}, {"viet": "Đứa bé đang bú vú mẹ.", "eng": "The baby was nursing at its mother's breast."}, {"viet": "Ngân hàng sẽ đòi hỏi thế chấp mới cho vay khoản tiền lớn như thế.", "eng": "The bank will insist on collateral security for a loan of that size."}, {"viet": "Vẻ đẹp của thành Venice phụ thuộc phần lớn vào kiểu kiến trúc của những toà nhà cổ.", "eng": "The beauty of Venice consists largely in the style of its ancient buildings."}, {"viet": "Con chim xù lông của nó lên.", "eng": "The birds ruffled up its feathers."}, {"viet": "Hơi bom thổi bay hai người qua đường sang bên kia dãy phố.", "eng": "The bomb blast blew two passers-by across the street."}, {"viet": "Ông chủ đánh giá rất cao về cô ta.", "eng": "The boss has a very high opinion of her."}, {"viet": "Cành cây đó bật lại và đập vào mặt tôi.", "eng": "The branch sprang back and hit me in the face."}, {"viet": "Toà nhà được trang trí bằng những lá cờ nhỏ.", "eng": "The building was tricked out with little flags."}, {"viet": "Mấy cái bánh bị cháy khét lên.", "eng": "The cakes were burnt to a cinder."}, {"viet": "Chiếc xe ô tô đụng vào một cái cây và lộn qua đường.", "eng": "The car hit a tree and cartwheeled across the road."}, {"viet": "Ô tô bị hư hỏng nặng nề trong vụ tai nạn.", "eng": "The cars were badly damaged in the accident."}, {"viet": "Buổi lễ đã được kết thúc bằng việc hát bài quốc ca.", "eng": "The ceremony was brought to close by the singing of the national anthem."}, {"viet": "Con gà con cuối cùng phá vỡ được cái vỏ trứng và cố chui ra.", "eng": "The chick finally broke through the shell and struggled out."}, {"viet": "Người ta thấy đứa trẻ đi tha thẩn một mình trên các phố.", "eng": "The child was found wandering the streets alone."}, {"viet": "Mấy nhỏ đã bắt chước được tiếng địa phương.", "eng": "The children have picked up the local accent."}, {"viet": "Bọn trẻ tranh cãi nhau xem ai thắng.", "eng": "The children were squabbling about who had won the game."}, {"viet": "Lớp học đang tiến hành một công trình nghiên cứu về sự chiếm đóng của người La Mã ở Anh.", "eng": "The class are doing a project on the Roman occupation of Britain."}, {"viet": "Huấn luyện viên đang giúp những người trẻ tuổi đầy hứa hẹn tập dượt trong đội dự bị.", "eng": "The coach is bringing on some promising youngsters in the reserve team."}, {"viet": "Ủy ban lên tiếng bác bỏ kế hoạch đưa ra.", "eng": "The commission declared against the proposed scheme."}, {"viet": "Công ty đang tăng cường tìm kiếm một giám đốc kinh doanh mới.", "eng": "The company is casting its net wide in its search for a new sales director."}, {"viet": "Quyền tịch thu của các nhân viên hải quan.", "eng": "The confiscatory powers of customs officials."}, {"viet": "Công an bố ráp một nhà điểm ở Phố Tư tuần trước.", "eng": "The cops busted a call house on Fourth Street last week."}, {"viet": "Trong suốt cuộc đình công đất nước ở trong tình trạng rối ren.", "eng": "The country was in a turmoil during the strike."}, {"viet": "Tên tội phạm Mick Clark dùng vài bí danh.", "eng": "The criminal Mick Clark uses several aliases."}, {"viet": "Di sản văn hoá của thời Phục hưng.", "eng": "The cultural legacy of the Renaissance."}, {"viet": "Ngày đó đã in vào kí ức cửa cô ấy mãi mãi.", "eng": "The date is stamped on the memory forever."}, {"viet": "Sự mềm mại của vải, của da một đứa bé.", "eng": "The delicacy of the fabric, a child's skin."}, {"viet": "Mặt đồng hồ ghi những thay đổi áp suất rất nhỏ.", "eng": "The dial records very slight variations in pressure."}, {"viet": "Đồ trưng bày được đặt trong một vòng nguyệt quế.", "eng": "The display was wreathed with laurel."}, {"viet": "Bác sĩ bảo tôi không được uống rượu.", "eng": "The doctor told me to keep off alcohol."}, {"viet": "Con chó bị mùi thịt thu hút.", "eng": "The dog was attracted by the smell of the meat."}, {"viet": "Anh tài xế cẩn thận lái xe ôtô đó vào ga-ra lên phía cạnh đường.", "eng": "The driver manoeuvred the car into the garage, over the side of the road."}, {"viet": "Các hệ thống kinh tế của Nhật và Trung Quốc.", "eng": "The economies of Japan and China."}, {"viet": "Súng địch đã loại nhiều chiến xa của chúng tôi khỏi vòng chiến đấu.", "eng": "The enemy guns put many of our tanks out of action."}, {"viet": "Bài luận văn đó cần phải được viết lại.", "eng": "The essay needs to be rewritten."}, {"viet": "Sự trải nghiệm những bất hạnh trong thời thơ ấu của anh ta đã in sâu trong ký ức của anh ta.", "eng": "The experiences of his unhappy childhood are branded on his memory."}, {"viet": "Địa vị cao sang của gia đình đó trong xã hội New York.", "eng": "The family's rise in New York society."}, {"viet": "Ngày hội sẽ tiến hành miễn là không mưa.", "eng": "The fête will go ahead provided the rain keeps off."}, {"viet": "Cuốn phim sẽ không bao giờ được giới kiểm duyệt chấp nhận.", "eng": "The film will never pass the censors."}, {"viet": "Hãng ấy công bố sổ sách kế toán của mình trong tháng Tám.", "eng": "The firm publishes its accounts in August."}, {"viet": "Lá cờ tô thêm chút màu sắc cho tòa nhà màu xám.", "eng": "The flag adds a dash of colour to the grey building."}, {"viet": "Sức thuyết phục trong lập luận của ông ấy mạnh đến nỗi nhiều người đã thay đổi ý nghĩ qua một đêm.", "eng": "The force of his argument was so great that many people changed their minds overnight."}, {"viet": "Những kẻ chạy trốn đêm đi ngày nghỉ.", "eng": "The fugitives travelled by night and rested by day."}, {"viet": "Đồng hồ khí đốt được đặt trong tủ ngăn dưới cầu thang.", "eng": "The gas meter is housed in the cupboard under the stairs."}, {"viet": "Những ngày, năm tháng, triều đại, v. v. vinh quang của Elizabeth I.", "eng": "The glorious days, years, reign, etc of Elizabeth I."}, {"viet": "Chính phủ tiến hành những hoạt động từ thiện trong làng.", "eng": "The government carried out welfare activities in the village."}, {"viet": "Chính phủ bị chỉ trích gay gắt từ mọi phía về chính sách kinh tế của mình.", "eng": "The government is under fire from all sides on its economic policy."}, {"viet": "Cỏ phủ sương vào sáng sớm.", "eng": "The grass was covered with frost in the early morning."}, {"viet": "Những tên lính gác là những con thú dữ tàn ác còn tên chỉ huy của chúng là hoá thân của ác quỷ.", "eng": "The guards were sadistic beasts and their leader was the devil incarnate."}, {"viet": "Chấn thương ở đầu làm cô ấy điếc suốt đời.", "eng": "The head injury deafened her for life."}, {"viet": "Bọn không tặc bắt các con tin của chúng phải chịu đủ điều nhục nhã.", "eng": "The highjackers inflicted all kinds of indignities on their captives."}, {"viet": "Những con tin bị trói bằng dây thừng và bị nhét giẻ vào mồm.", "eng": "The hostages were bound with ropes and gagged."}, {"viet": "Ngôi nhà trông bề ngoài không hấp dẫn lắm nhưng bên trong rất rộng.", "eng": "The house isn't much to look at but it's quite spacious inside."}, {"viet": "Ý tưởng cho rằng thực vật và động vật ngày nay bắt nguồn từ các loài động thực vật đơn giản xưa kia được gọi là Thuyết chuyển hóa.", "eng": "The idea that all plants and animals of today came from the simple plants and animals of long ago is called the theory of evolution."}, {"viet": "Sự tung quân lính vào một tổ chức.", "eng": "The infiltration of troops into an organization."}, {"viet": "Kẻ xâm lược đã thắng dân bản xứ.", "eng": "The invader prevailed over the native population."}, {"viet": "Chuyến đi từ Đà Lạt đến Nha Trang mất khoảng một tiếng rưỡi.", "eng": "The journey from Dalat to Nhatrang takes about an hour and a half."}, {"viet": "Những kẻ bắt cóc đã đòi một triệu pao cho việc thả anh ta ra an toàn.", "eng": "The kidnappers have demanded 1 million pounds for his safe release."}, {"viet": "Đơn vị lớn nhất của tiền nhân dân tệ là mười nghìn yên.", "eng": "The largest denomination of Japanese currency is a ten-thousand-yen note."}, {"viet": "Chiếc xe ôtô dẫn đầu bị lộn nhào ở nửa vòng đua thứ mười.", "eng": "The leading cars crashed midway through the tenth lap."}, {"viet": "Ngọn đèn bên trên bồn rửa mặt cứ nhấp nháy mãi.", "eng": "The light above the washbasin keeps flickering."}, {"viet": "Thời gian dài từ khi sinh đến khi chết.", "eng": "The long haul from the cradle to the grave."}, {"viet": "Ma lực của thơ ca Sêchxpia, của rừng cây mùa thu.", "eng": "The magic of Shakespeare's poetry, of the woods in autumn."}, {"viet": "Ông giám đốc làm cho nhân viên văn phòng của mình nhận thức rõ tầm quan trọng của việc giữ sổ sách chính xác.", "eng": "The manager impressed on his office staff the importance of keeping accurate records."}, {"viet": "Bà thị trưởng đeo dây chuyền thánh giá ở cổ.", "eng": "The mayor wore her chain of office round her neck."}, {"viet": "Những người đó bị những người ngoài cuộc xúi giục.", "eng": "The men are being stirred up by outsiders."}, {"viet": "Sự chăm sóc của vợ tôi đã làm cho tôi phục hồi được sức khoẻ.", "eng": "The ministrations of my wife restored me to health."}, {"viet": "Trăng đầy, rồi khuyết, khuyết dần rồi cho đến khi biến mất.", "eng": "The moon was full, then it got smaller and smaller until it disappeared altogether."}, {"viet": "Bộ phim đã được quảng cáo rùm beng quá xa giá trị thật của nó.", "eng": "The movie has been hyped up far beyond its worth."}, {"viet": "Cây kim đã nhảy qua mấy rãnh.", "eng": "The needle has jumped several grooves."}, {"viet": "Luật mới sẽ bảo vệ quyền công dân cho những người bệnh tâm thần.", "eng": "The new law will secure the civil rights of the mentally ill."}, {"viet": "Đồ chơi mới không lôi cuốn đứa bé được lâu.", "eng": "The new toy didn't t engage the child for long."}, {"viet": "Cuộc đua tiếp theo sẽ buộc hắn ta phải ráng hết sức.", "eng": "The next race will put him on his mettle."}, {"viet": "Số nhân viên đang được bớt dần để giảm chi phí.", "eng": "The number of employees is being whittled down in order to reduce costs."}, {"viet": "Người sĩ quan đáp lại cái chào của anh thượng sĩ.", "eng": "The officer returned the sergeant's salute."}, {"viet": "Những con vật già chết đi, nhưng các ngôi nhà đá vôi vẫn còn đó.", "eng": "The older animals die, but their limestone houses remain."}, {"viet": "Những nguồn gốc của tục lệ đó chưa ai biết.", "eng": "The origins of the custom are unknown."}, {"viet": "Trang giấy này trông có màu trắng bởi vì nó phản chiếu tới mắt chúng ta tất cả các màu sắc nằm trong ánh sáng đập vào nó.", "eng": "The paper of this page looks white because it sends back to our eyes all the colors in the light that reaches it."}, {"viet": "Con đường mòn qua khu rừng là một trong những đường đi dạo ưa thích của tôi.", "eng": "The path through the forest is one of my favourite walks."}, {"viet": "Nhân dân nổi dậy chống bọn đàn áp.", "eng": "The people revolted against their oppressors."}, {"viet": "Hình ảnh và âm thanh không đồng bộ.", "eng": "The picture and the sound track were out of sync."}, {"viet": "Kế hoạch thất bại vì nó tỏ ra quá tốn kém.", "eng": "The plan fell down because it proved to be too expensive."}, {"viet": "Vở kịch không làm cho khán giả thích.", "eng": "The play failed to entertain its audience."}, {"viet": "Cảnh sát đang điều tra lý lịch anh ta.", "eng": "The police are checking up on him."}, {"viet": "Cảnh sát đã phát giấy gọi các người lái của cả hai xe dính líu vào vụ tai nạn.", "eng": "The police have taken out a summons against the drivers of both cars involved in the accident."}, {"viet": "Người cảnh sát phóng theo sau kẻ cắp.", "eng": "The policeman raced after the thief."}, {"viet": "Bưu điện sắp xếp những thư từ theo tỉnh chúng gửi đến.", "eng": "The post office sorts letters according to which town they are going to."}, {"viet": "Cái chết mới đây của Tổng thống đã làm cho cuộc đảo chính quân sự diễn ra.", "eng": "The president's recent death set the stage for a military coup."}, {"viet": "Giá là 800 pao, gồm cả thuế giá trọn gói.", "eng": "The price is 800 pounds inclusive of tax inclusive terms."}, {"viet": "Tên tù đã chịu khuất phục khi bị thẩm vấn.", "eng": "The prisoner gave way under interrogation."}, {"viet": "Chương trình này thực sự chỉ là một công việc chắp nối.", "eng": "The programme's a real scissors-and-paste job."}, {"viet": "Trẻ con không được vào quán rượu.", "eng": "The pub was out of bounds to the schoolboys."}, {"viet": "Nữ hoàng sẽ cho hạ thuỷ một tàu chiến mới hôm nay.", "eng": "The Queen is to launch a new warship today."}, {"viet": "Sự tiếp thu nhanh chóng những kỹ thuật mới của công nghệ.", "eng": "The rapid assimilation of new techniques in industry."}, {"viet": "Hình phản chiếu của cây cối trên mặt hồ.", "eng": "The reflection of the trees in the lake."}, {"viet": "Các nhà nghiên cứu lặp đi lặp lại thí nghiệm đó ở loài chuột.", "eng": "The researchers are repeating the experiment on rats."}, {"viet": "Điều bí ẩn về vũ trụ xuất hiện làm sao.", "eng": "The riddle of how the universe originated."}, {"viet": "Con đường về làng ngoặt sang phải.", "eng": "The road to the village branches off to the right."}, {"viet": "Sợi dây thừng còn khá dài đủ chạm đến mặt đất.", "eng": "The rope was plenty long enough to reach the ground."}, {"viet": "Lương ở đây là thấp so với mức lương ở nơi khác.", "eng": "The salaries here are low as against the rates elsewhere."}, {"viet": "Viên cố vấn trường học có nói ngay bây giờ con phải quyết định xem nên học một khóa học nghề hay một khóa dự bị đại học.", "eng": "The school counselor says I have to decide now whether to takes a shop course or a college prep course."}, {"viet": "Sự an toàn của toàn bộ sự vận hành này đã bị một người cẩu thả huỷ hoại.", "eng": "The security of the whole operation has been jeopardized by one careless person."}, {"viet": "Vỏ bọc bao quanh một dây cáp điện.", "eng": "The sheath round an electric cable."}, {"viet": "Các con tàu đụng nhau trong sương mù.", "eng": "The ships collided in the fog."}, {"viet": "Trông thấy món thịt hầm mỡ màng làm hắn ta buồn nôn.", "eng": "The sight of the greasy stew made his stomach turned his stomach."}, {"viet": "Khẩu hiệu là lối chơi chữ tên sản phẩm.", "eng": "The slogan was a pun on the name of the product."}, {"viet": "Những tên lính nện anh ấy đến chết bằng báng súng trường.", "eng": "The soldiers clubbed him to death with their rifles."}, {"viet": "Người diễn thuyết đã lôi cuốn cảm xúc của chúng ta hơn là trí tuệ.", "eng": "The speaker appealed to our emotions rather than to our minds."}, {"viet": "Tiêu chuẩn chiều cao đòi hỏi đối với tiếp viên hàng không.", "eng": "The standard of height required for airhostess."}, {"viet": "Trận bão đó đã gây nhiều thiệt hại rất lớn lao.", "eng": "The storm did a powerful lot of harm."}, {"viet": "Sinh viên viết một bức thư ngỏ cho Bộ trưởng Bộ giáo dục.", "eng": "The students wrote an open letter to the Minister of Education."}, {"viet": "Bề mặt Hồ Tây được bao phủ bằng lá và hoa sen rất đẹp.", "eng": "The surface of the West Lake is covered with beautiful leaves and flowers of the lotus plant."}, {"viet": "Thầy giáo cho tôi điểm tốt cho câu chuyện của tôi.", "eng": "The teacher gave me a good mark for my story."}, {"viet": "Buổi truyền hình đến từ nước Mỹ qua vệ tinh.", "eng": "The television broadcast came from America by satellite."}, {"viet": "Tên trộm luôn luôn sợ bị phát hiện.", "eng": "The thief went in constant fear of discovery."}, {"viet": "Họ mang theo một giỏ lớn đi picnic vì vậy có rất nhiều thức ăn.", "eng": "The took a large hamper on the picnic, so there was plenty of food."}, {"viet": "Xe lửa chạy ầm ầm qua làng.", "eng": "The train thundered through the village."}, {"viet": "Điều rắc rối là một năm không hẳn là 365 1/4 ngày.", "eng": "The trouble was that a year is not quite 365 1/4 days long."}, {"viet": "Hai phía hoàn toàn đồng ý với nhau về vấn đề này.", "eng": "The two sides are completely in accord on this matter."}, {"viet": "Ứng cử viên thất bại yêu cầu đếm lại phiếu.", "eng": "The unsuccessful candidate demanded a re-count."}, {"viet": "Phòng họp lớn của làng được dành riêng cho các việc công và các cuộc họp.", "eng": "The village hall is given over to civic functions and meetings."}, {"viet": "Sự lãng phí của công về dự án đó đã bị chỉ trích.", "eng": "The waste of public money on the project was criticized."}, {"viet": "Cái công việc ấy đều thối nát ( vì nạn tham nhũng ).", "eng": "The whole business stinks ( of corruption )."}, {"viet": "Người thắng được chọn phần thưởng trước tiên.", "eng": "The winner has first pick of the prizes."}, {"viet": "Những người thợ muốn có một tiếng nói trong các quyết định về quản lý.", "eng": "The workers want a voice in management decisions."}, {"viet": "Trong số này có một số thành phố như là Thebes, Babylon, Nineveh, Tyre, Damascus, Athens, Carthage, Byzantium và Rome.", "eng": "Thebes, Babylon, Nineveh, Tyre, Damascus, Athens, Carthage, Byzantium and Rome were a few of them."}, {"viet": "Lãnh tụ của họ là tấm gương tuyệt mỹ của lòng dũng cảm.", "eng": "Their leader was the apotheosis, of courage."}, {"viet": "Vậy thì, có những loại ngân hàng nào khác ở Trung Quốc?", "eng": "Then, what other kinds of banks are there in China?"}, {"viet": "Có món ăn sẵn của tàu ở trung tâm thành phố ấy.", "eng": "There's a Chinese take-away in the town centre."}, {"viet": "Có ít việc phải làm trong công việc này hơn là trong công việc trước.", "eng": "There's less to do in this job than the last."}, {"viet": "Có kẻ rình rập sau bụi rậm.", "eng": "There's someone lurking behind that bush."}, {"viet": "Có nhiều tờ quảng cáo trong hộp thư của tôi.", "eng": "There are many flyers in my mailbox."}, {"viet": "Có bã trà trong tách của tôi-anh không lọc trà.", "eng": "There are three leaves in my cup-you haven't strained the tea."}, {"viet": "Ở đó ông đã trông thấy nhiều loài thực vật và động vật lạ lùng.", "eng": "There he saw many strange plants and animals."}, {"viet": "Tối nay trên truyền hình có một chương trình lí thú.", "eng": "There is an interesting program on television tonight."}, {"viet": "Có quá nhiều trò quảng cáo tân kỳ!", "eng": "There is too much advertising gimmickry!"}, {"viet": "Khi Mary đi vào câu chuyện ngừng lại.", "eng": "There was a pause in the conversation when Mary came in."}, {"viet": "Đã có biện pháp an ninh chặt chẽ cho chuyến đi thăm của Giáo hoàng.", "eng": "There was tight security for the Pope's visit."}, {"viet": "Sẽ có mưa ở khắp các vùng của đất nước.", "eng": "There will be rain in all parts of the country."}, {"viet": "Những tuyến này tạo ra những chất hoá học rất quan trọng cho cơ thể chúng ta hoạt động.", "eng": "These glands produce chemicals that are very important in making our bodies work as they should."}, {"viet": "Tôi e rằng những vết bẩn này sẽ không mất đi.", "eng": "These stains won't come off, I'm afraid."}, {"viet": "Họ là bạn của nhau từ hồi học cấp ba.", "eng": "They've been buddies since high school."}, {"viet": "Họ quyết tâm thắng cử bằng tất cả mọi biện pháp xấu tốt.", "eng": "They are determined to win the election by fair means of foul."}, {"viet": "Họ tống cổ anh ta vì say rượu trong khi làm việc.", "eng": "They booted him out for being drunk at work."}, {"viet": "Chúng có thể kéo xe.", "eng": "They could pull loads."}, {"viet": "Cuối cùng họ đã nhận ra rằng người lãnh đạo mà họ vô cùng kính trọng có nhược điểm được che giấu.", "eng": "They eventually realized that the leader they so admired had feet of clay."}, {"viet": "Họ đã phải giảm bớt tham vọng và mua một căn nhà nhỏ hơn cái họ mong muốn.", "eng": "They had to lower their sights and buy a smaller house than they would have liked."}, {"viet": "Họ biết tất cả các điệu xưa.", "eng": "They know all the old dances."}, {"viet": "Họ chuyển vào hang động.", "eng": "They moved into the caves."}, {"viet": "Họ lắp đặt đường dây điện thoại dưới lòng đất.", "eng": "They put the telephone line underground."}, {"viet": "Khi có gió thuận họ liền dong buồm ra khơi.", "eng": "They set sail with the first fair wind."}, {"viet": "Họ cố gắng đối phó lịch sự với những khách hàng đang nổi giận.", "eng": "They try to tackle politely with angry customers."}, {"viet": "Họ cảm thấy bị xúc phạm vì bị sa thải đột ngột.", "eng": "They were deeply affronted by their abrupt dismissal."}, {"viet": "Họ sẽ phải gọi điện cho chi nhánh của anh để được uỷ quyền.", "eng": "They will have to phone your branch for authorization."}, {"viet": "Cái túi này không nặng, thật ra nó nhẹ so với đa số các túi khác.", "eng": "This bag isn't heavy, actually it's light compared to most."}, {"viet": "Bản sao này gần giống với bản gốc hơn các bản sao khác mà tôi đã thấy.", "eng": "This copy is nearer the original than the others I've seen."}, {"viet": "Hãng này cần phải có những thay đổi căn bản trên mọi phương diện.", "eng": "This firm needs radical changes across the board."}, {"viet": "Đây chỉ là khẩu súng đồ chơi, không bắn được.", "eng": "This is just a toy gun, it doesn't shoot."}, {"viet": "Kiểu chính xác này có thể đạt được bởi kỹ thuật hiện đại.", "eng": "This kind of accuracy is attainable by modern techniques."}, {"viet": "Đây là câu chuyên của một nhà khoa học trẻ ngây thơ, không trải đời.", "eng": "This now is the story of an unworldly young scientist."}, {"viet": "Loại đồng hồ treo tường đặc sắc này cũng cho biết ngày trong tuần, ngày của tháng, vị trí của các hành tinh và chu kỳ của mặt trăng.", "eng": "This remarkable clock also told the day of the week, the day of the month, the position of the planets, and the phase of the moon."}, {"viet": "Loại vải dệt tổng hợp này do bộ phận nghiên cứu của chúng tôi chế tạo.", "eng": "This synthetic fabric is produced by our research department."}, {"viet": "Bọn trẻ ấy chẳng bị thiếu cái gì.", "eng": "Those children want for nothing."}, {"viet": "Tỉ giá hôm nay mua vào là 1,60 đô la Mỹ một bảng Anh.", "eng": "Today's rate for cash purchase is US $ 1,60 to the pound."}, {"viet": "Các lính biệt kích đang được huấn luyện phải trải qua một kỳ huấn luyện đột kích mệt lử người.", "eng": "Trainee commandos are put through an exhausting assault course."}, {"viet": "Nhiều chuyện không may xảy ra đã đưa ông ta đến chỗ phá sản.", "eng": "Various strokes of misfortune led to his ruin."}, {"viet": "Sóng vỗ vào mạn thuyền.", "eng": "Waves washing against the side of a boat."}, {"viet": "Chúng tôi sẽ dùng món đọt cải xốt dầu hào, đậu tây và súp nấm.", "eng": "We'll take the Season Vegetables in Oyster Sauce, the String Beans and the Mushroom Soup."}, {"viet": "Hàng ngày, chúng tôi mở cửa từ 8 giờ sáng đến 7 giờ tối.", "eng": "We're open from 8 am till 7 pm every day."}, {"viet": "Chúng tôi phải viết một tuỳ bút về chiến tranh với Napoleon.", "eng": "We've got to write an essay about the war with Napoleon."}, {"viet": "Chúng tôi thường pha trà vào 11 giờ.", "eng": "We always have a brew-up at 11 o'clock."}, {"viet": "Chúng ta còn thiếu hai người nữa ( mới đủ đội ).", "eng": "We are still two men shy ( of a full team )."}, {"viet": "Chúng ta không thể tiếp tục như thế này được-hình như chúng ta lúc nào cũng tranh cãi.", "eng": "We can't go on like this-we seem to be always arguing."}, {"viet": "Chúng tôi cụng li và uống chúc mừng sức khoẻ cho nhau.", "eng": "We chinked glasses and drank each other's health."}, {"viet": "Chúng tôi không thích cà phê, nhưng chúng tôi không chịu nổi nếu không có trà.", "eng": "We don't care for coffee but we can't stand it if there is no tea."}, {"viet": "Chúng tôi thấy phần còn lại của bữa ăn ở trên bàn.", "eng": "We found the remains of a meal on the table."}, {"viet": "Chúng tôi đã phải vội vã tìm một căn hộ-không còn thời gian đâu để kén cá chọn canh.", "eng": "We had to find a flat in a hurry-there was no time to pick and choose."}, {"viet": "Chúng tôi đã đo mức tiêu thụ nhiên liệu của chiếc xe.", "eng": "We have measured the car's fuel consumption."}, {"viet": "Tôi đắn đo mãi rồi mới quyết định mua cái nhà.", "eng": "We hummed and ha'd for ages before deciding to buy the house."}, {"viet": "Chúng tôi tìm khoá ở khắp nơi nhưng không thấy nó ở đâu cả.", "eng": "We looked for the key everywhere but it was nowhere to be found."}, {"viet": "Ta phải hạn chế chi tiêu vào cái mà ta có thể.", "eng": "We must limit expenses to what we can afford."}, {"viet": "Chúng tôi thường đến Nhật Bản vào mùa hè, nhưng năm nay để có sự thay đổi chúng tôi sẽ đi Anh Quốc.", "eng": "We often go to Japan in the summer, but this year, we're going to England for a change."}, {"viet": "Chúng tôi khiển trách anh ta vì hành vi của anh ta.", "eng": "We remonstrated with him about his behaviour."}, {"viet": "Thỉnh thoảng chúng tôi đi xem phim nhưng không thường xuyên.", "eng": "We sometimes go to the cinema, but not very often."}, {"viet": "Thông thường chúng tôi chăm sóc mẹ một tháng vào mùa hè.", "eng": "We usually have my mother for a month in the summer."}, {"viet": "Chúng tôi đã bị bức ép phải đi xem ô-pê-ra.", "eng": "We were dragooned into going to the opera."}, {"viet": "Dù sao chúng tôi cũng sẽ cải thiện điều kiện vệ sinh của khách sạn chúng tôi.", "eng": "We will improve our sanitary conditions, anyway."}, {"viet": "Ồ, thật tình mà nói nếu tất cả người Anh đều độc đoán về ngôn ngữ như anh thì mọi người Mỹ cùng nhau bỏ tiếng Anh mà chuyển sang nói tiếng Pháp mất.", "eng": "Well, frankly, if all Englishmen were as overbearing about the language as you are, Americans would disown English altogether and speak French."}, {"viet": "Vậy có lẽ vấn đề liên quan đến tiền bạc.", "eng": "Well, the problem is an awful lot of money involved."}, {"viet": "Tỉ giá hối đoái là bao nhiêu?.", "eng": "What's the rate of exchange?."}, {"viet": "Những mục đích xã hội và tinh thần của xã hội là gì?", "eng": "What are the social and moral aims of the society?"}, {"viet": "Anh thích làm gì vào thời gian rỗi?", "eng": "What do you like to do in your spare time?"}, {"viet": "Nếu xe lửa trễ thì sao?", "eng": "What if the train's late?"}, {"viet": "Cách điều trị bệnh này ra sao?", "eng": "What is the treatment for this condition?"}, {"viet": "Các nhà kinh doanh mới nào đang nổi lên trong thập niên này?", "eng": "What new businesses are emerging in this decade?"}, {"viet": "Bạn muốn đi tập thể hình lúc mấy giờ?", "eng": "What time do you want to go workout?"}, {"viet": "Khi sao chổi ở xa mặt trời thì nó không có đuôi.", "eng": "When comet is far away from the sun, it does not have a tail."}, {"viet": "Khi lên tới đỉnh, tôi thở hồng hộc.", "eng": "When I got to the top I was huffing and puffing."}, {"viet": "Khi tên trộm nghe thấy tiếng ô tô của họ, nó đã chuồn qua cửa sổ.", "eng": "When the burglar heard their car, he hopped it out of the window."}, {"viet": "Phụ nữ được quyền bầu cử ở Anh khi nào?", "eng": "When were women enfranchised in Britain?"}, {"viet": "Người ta mua xà bông ở đâu?", "eng": "Where do people get their soap?"}, {"viet": "Bạn thích cách nào hơn, những kì nghỉ ở khu nghỉ mát hay những kì nghỉ tự túc?", "eng": "Which do you prefer, resort vacations or backpacking vacations?"}, {"viet": "Trong khi họ đang ở thì chúng ta không thể bán căn nhà đó được.", "eng": "While they are in possession, we can't sell the house."}, {"viet": "Anh thích đọc tiểu thuyết của tác giả nào hả Bill?", "eng": "Who's you favorite novelist, Bill?"}, {"viet": "Anh hãy gửi hồ sơ cho tôi để tôi trình cho ban giám đốc nhé?", "eng": "Why don't you have your credentials sent to me and i'll show them to the board?"}, {"viet": "Liệu nhà chức trách Tây Ban Nha có chuyển anh ta về nước để xét xử không?", "eng": "Will the Spanish authorities send him home for trial?"}, {"viet": "William Trương là chủ tịch của Công ty Thương mại Phương Đông.", "eng": "William Chang is a chairman of the Oriental Trading Company."}, {"viet": "Với thất bại của cuộc thí nghiệm, chúng tôi đã lâm vào ngõ cụt.", "eng": "With the failure of the experiment, we had reached a dead end."}, {"viet": "Tôi xếp cô ấy thuộc trong số những người có giọng nữ cao tuyệt nhất thế giới.", "eng": "Would place her among the world's greatest sopranos."}, {"viet": "Ông có muốn để lại lời nhắn không ạ?", "eng": "Would you like to leave a message?"}, {"viet": "Xin ông hãy nói vào bên tai lành của tôi, tai bên kia tôi không nghe được.", "eng": "Would you speak into my good ear, I can't hear in the other one."}, {"viet": "Vâng, tôi muốn đặt trước một bàn để ăn tối vào lúc 7 giờ tối mai.", "eng": "Yes, I'd like to book a table for dinner at 7 tomorrow evening."}, {"viet": "Một lần nữa chúng ta có thể thấy kết quả của việc ra quyết định vội vàng.", "eng": "Yet again we can see the results of hasty decision-making."}, {"viet": "Khi biết cô ấy, anh sẽ mến cô ta.", "eng": "You'll like her once you get to know her."}, {"viet": "Xin mời anh ăn bữa tối với chúng tôi-thật tình chúng tôi chỉ có xúp và bánh mì thôi.", "eng": "You're welcome to join us for supper, such as it is-we're only having soup and bread."}, {"viet": "Anh hoàn toàn có thể giải quyết vấn đề này.", "eng": "You are well able to settle this affair."}, {"viet": "Cậu cứ cầm chắc là nó không đợi chúng mình đâu.", "eng": "You can bet your bottom dollar he won't have waited for us."}, {"viet": "Anh có thể nhận ra người miền Nam qua giọng nói của họ.", "eng": "You can tell southerners by their accent."}, {"viet": "Cô ăn ít quá-vì thế mà cô gầy.", "eng": "You eat very little-that's why you are so thin."}, {"viet": "Cậu đã chạm đến chỗ đau của anh ta khi cậu nhắc đến người vợ đầu tiên của anh ta.", "eng": "You hit a raw nerve when you mentioned his first wife."}, {"viet": "Bạn muốn lái xe bên thuận chiều phải không?", "eng": "You mean on the right side, don't you?"}, {"viet": "Anh phải ngăn không cho Joe nói với họ điều đó.", "eng": "You must stop Joe from telling them about it."}, {"viet": "Anh hiểu cho, tôi phải giữa một ít nhân dân tệ vì tôi có thể sử dụng chúng ở sân bay trước khi tôi rời khỏi.", "eng": "You see I must keep some Yuan for I may use them at the airport before I leave."}, {"viet": "Anh không nên đùa nghịch với những chất hoá học nguy hiểm.", "eng": "You shouldn't fool about with dangerous chemicals."}, {"viet": "Ở khách sạn chúng tôi bạn sẽ cảm thấy thực sự như ở nhà mình!", "eng": "You will find our hotel a true home from home!"}, {"viet": "Mấy đứa con của anh chắc đều háo hức về kỳ nghỉ này lắm.", "eng": "Your children must be all excited about it."}, {"viet": "Số phòng của ông bà chính là số máy nhánh của ông bà.", "eng": "Your room number is just your extension number."}]