[{"viet": "Sự tranh chấp quyết liệt đã để lại một di sản oán hận.", "eng": "A bitter dispute which left an inheritance of ill feeling."}, {"viet": "Trẻ em cần phải sống với mẹ của nó.", "eng": "A child belongs with its mother."}, {"viet": "Một cuộc đối đầu giữa chính quyền và các công đoàn.", "eng": "A confrontation between the Government and the unions."}, {"viet": "Một cuộc biểu diễn các kỹ năng thể thao ngoạn mục.", "eng": "A dazzling display of sporting skill."}, {"viet": "Một vòng đôi giống hình số tám.", "eng": "A double loop like a figure eight."}, {"viet": "Cơ hội thắng thua ngang nhau.", "eng": "A fifty-fifty chance of winning."}, {"viet": "Một chiếc áo khoác lông thú choàng quanh vai cô ta.", "eng": "A fur coat draped round her shoulders."}, {"viet": "Anh được hưởng rất nhiều tiền.", "eng": "A great deal of money is due to you."}, {"viet": "Một cơn sốt cao và một cơn run rẩy.", "eng": "A high temperature and a fit of the shakes."}, {"viet": "Một bãi đồ phế thải đầy những xe cộ hỏng.", "eng": "A junkyard full of spavined vehicle."}, {"viet": "Giấy phép hành nghề bác sĩ.", "eng": "A license to practise as a doctor."}, {"viet": "Một máy thiết kế sơ suất sẽ không bán chạy.", "eng": "A machine of faulty design will not sell well."}, {"viet": "Một bức điện vừa mới gửi đến.", "eng": "A message is just coming through."}, {"viet": "Một cải biên mới của một điệu nhạc khiêu vũ phổ thông.", "eng": "A new arrangement of a popular dance tune."}, {"viet": "Một trang vấy những dấu mực.", "eng": "A page covered in ink blots."}, {"viet": "Một sự ham muốn bệnh hoạn nhằm làm người khác đau đớn.", "eng": "A perverted desire to make others suffer."}, {"viet": "Một người không tuân thủ những giới hạn tốc độ.", "eng": "A poor observer of speed restrictions."}, {"viet": "Giật cái dây ấy một cái sẽ làm chuông kêu lên.", "eng": "A pull on the rope will make the bell ring."}, {"viet": "Một nhà phê bình sách đã gọi cuốn tiểu thuyết của bà ta là siêu lãng mạn và danh hiệu đó dính luôn.", "eng": "A reviewer called her first novel super romantic and the label has stuck."}, {"viet": "Một cuộc leo trèo khó khăn trên những hòn đá ở bờ biển.", "eng": "A scramble over the rocks at the seashore."}, {"viet": "Tiếng kêu the thé phá tan sự tĩnh mịch.", "eng": "A shrill cry penetrated the silence."}, {"viet": "Một người lính tự chứng tỏ là chính anh rất can đảm.", "eng": "A soldier who showed himself to be very brave."}, {"viet": "Một sinh vật lạ từ hành tinh khác.", "eng": "A strange being from another planet."}, {"viet": "Một toán người khuân vác châu Phi đã cùng đi với chúng tôi trong đoàn lữ hành.", "eng": "A team of African bearers came with us on safari."}, {"viet": "Một câu hỏi lắt léo bắt anh ta mày mò tìm câu trả lời.", "eng": "A tricky question which left him groping for an answer."}, {"viet": "Một tuần lễ ở miền quê sẽ làm bà ta khỏe hơn sau cuộc giải phẫu của bà ấy.", "eng": "A week in the country will set her up nicely after her operation."}, {"viet": "Cách xa chừng 500 thước, trên ba chiếc tàu khu trục được neo sát vào núi đá, các thủy thủ mặc quần áo lót trên người của họ đang leo lên boong tàu.", "eng": "About 500 yards away, on three destroyers snubbed up to the rock, men were clambering on the deck in their skivvies."}, {"viet": "Thêm những trang phụ làm sách dầy thêm.", "eng": "Add extra pages to bulk a book out."}, {"viet": "Xét cho cùng thì tiếng Anh được xem là một ngôn ngữ quốc tế.", "eng": "After all, English is supposed to be an international language."}, {"viet": "Sau khi tan trường, cháu sẽ đón xe buýt về nhà.", "eng": "After school, I'll take the bus home."}, {"viet": "Sau khi bạn dùng nó xong, hãy đặt nó lại chỗ cũ.", "eng": "After you use it, put it back."}, {"viet": "Tất cả các loại xe đã được sử dụng.", "eng": "All manner of vehicles were used."}, {"viet": "Phải đút lót tất cả các viên chức trước khi họ chịu giúp đỡ mình.", "eng": "All the officials had to be squared before they would help us."}, {"viet": "Mặc dầu ban đầu hơi chậm chút xíu, tác giả lại tranh thủ kịp thời gian.", "eng": "Although the beginning is a slosh slow, the author picks up the pace."}, {"viet": "Một ngôi sao nhạc pop lớn tuổi cố lấy lại phong độ trước đây.", "eng": "An aging pop star trying to make a come-back."}, {"viet": "Một sợi dây điện bọc cao su.", "eng": "An electric cable insulated with rubber."}, {"viet": "Một tỉ lệ gia tăng dân số có nhà riêng.", "eng": "An increasing percentage of the population own their own homes."}, {"viet": "Một cơ hội như thế không hay xảy đến với tôi.", "eng": "An opportunity like that doesn't often come my way."}, {"viet": "Mày cũng vậy thôi, mà còn tệ hơn nữa!", "eng": "And the same to you, with knobs on!"}, {"viet": "Những biến chứng tiền sản có thể ảnh hưởng đến sức khoẻ của em bé.", "eng": "Antenatal complications can affect a baby's health."}, {"viet": "Ở nước bạn các trung tâm giữ trẻ ban ngày có nhiều lắm không?", "eng": "Are day-care centers abundant in your country?"}, {"viet": "Tối mai anh có làm gì không?", "eng": "Are you doing anything tomorrow evening?"}, {"viet": "Anh có sẵn sàng nhận trách nhiệm không?", "eng": "Are you willing to accept responsibility?"}, {"viet": "Vì là con một nên anh ta được cha mẹ hết sức cưng chiều.", "eng": "As an only child he was the idol of his parents."}, {"viet": "Về việc sửa bài tập của chúng tôi, thầy giáo luôn bắt chúng tự làm việc đó.", "eng": "As to correcting our homework, the teacher always makes us do it ourselves."}, {"viet": "Cuối cùng cô ta đã hiểu ra họ muốn nói gì.", "eng": "At last she's cottoned on to what they mean."}, {"viet": "Mặc váy bằng lụa và lông thú.", "eng": "Attired in robes of silk and fur."}, {"viet": "Tràn đầy hạnh phúc, tự hào, phấn khởi.", "eng": "Be bursting with happiness, pride, excitement."}, {"viet": "Được thưởng thích đáng dựa theo những gì mà ai đó đáng được hưởng.", "eng": "Be rewarded according to one's deserts."}, {"viet": "Chị ta thấy một cánh cửa sau bức rèm.", "eng": "Behind the curtain she found a door."}, {"viet": "Độ này loại quần da màu đen có vẻ hết sức thời thượng.", "eng": "Black leather trousers seem to be quite the rage these days."}, {"viet": "Những ngọn đèn chiếu sáng trưng dọc theo đường phố.", "eng": "Bright lights blazed all along the street."}, {"viet": "Việc kinh doanh có chiều hướng mới xấu đi.", "eng": "Business has taken a turn for the worse."}, {"viet": "Nhưng hiện giờ ông Wilson đã đi vắng rồi.", "eng": "But Mr. Wilson is out now."}, {"viet": "Vào khoảng 7 giờ một hàng dài đã nối đuôi nhau ngoài rạp chiếu bóng.", "eng": "By 7 o'clock a long queue had formed outside the cinema."}, {"viet": "Cáp truyền hình đã có được ít lâu rồi.", "eng": "Cable television has been around for sometime now."}, {"viet": "Xin vui lòng cho tôi xem chứng minh thư?", "eng": "Can I see some identifications, please?"}, {"viet": "Anh có thể leo qua bức tường không?", "eng": "Can you get over the wall?"}, {"viet": "Anh có tìm ra được nhược điểm trong lập luận của cô ta không?", "eng": "Can you spot the weakness in her argument?"}, {"viet": "Khiêng nghiêng chiếc trường kỷ qua cửa.", "eng": "Carry the sofa sideways through the door."}, {"viet": "Những đứa trẻ được cách ly cẩn thận ra khỏi các kinh nghiệm có hại.", "eng": "Children carefully insulated from harmful experiences."}, {"viet": "Lau những cái cốc cho đến khi sạch bóng.", "eng": "Clean the glasses until they shine."}, {"viet": "Tiến tới một thỏa thuận sơ bộ với ban giám đốc về tiền lương.", "eng": "Come to an understanding with management about pay."}, {"viet": "Xin chúc mừng, tôi nghe nói bạn đã thi đậu rồi.", "eng": "Congratulations, I heard you passed the examination."}, {"viet": "Chúng ta có thể hỏi vợ của tôi sau được không?", "eng": "Could we ask my wife later?"}, {"viet": "Xin ông vui lòng chỉ cho cháu cách đi tới bưu điện ạ?", "eng": "Could you tell me how to get to the post office?"}, {"viet": "Cắt bỏ ngọn héo của hoa hồng.", "eng": "Cut off the dead heads of the roses."}, {"viet": "Những khuyết điểm trong thiết kế không thể điều chỉnh được trong khi sản xuất.", "eng": "Defects in design cannot be put right during production."}, {"viet": "Cắt lính gác một cây cầu.", "eng": "Detail soldiers to guard a bridge."}, {"viet": "Bạn có biết rằng thời gian đào tạo trung bình cho nhân viên mới ở Nhật Bản là rất lâu không?", "eng": "Did you know that the average training period for new employees in Japan is very long?"}, {"viet": "Công viên Disneyland quá lớn đến nỗi tôi đã bị lạc lúc ở đó.", "eng": "Disneyland is so big that I got when I went there."}, {"viet": "Người lớn tuổi có được chăm sóc y tế đầy đủ không?", "eng": "Do the elderly receive adequate medical attention?"}, {"viet": "Bạn có cảm thấy là các trẻ em Nhật hơi bị hư hỏng do được nuông chiều không?", "eng": "Do you feel that Japanese children are a little spoilt?"}, {"viet": "Ngoài việc sưu tập tem, bạn có thú tiêu khiển nào khác không?", "eng": "Do you have other pastimes besides stamp collecting?"}, {"viet": "Chị có yêu anh ta không?-thật sự và chân tình chứ?", "eng": "Do you love him-really and truly?"}, {"viet": "Bạn nghĩ là trời có thể mưa sao?", "eng": "Do you think it might rain?"}, {"viet": "Cắt xén 15% tiền ai kiếm được.", "eng": "Dock 15% off somebody's earnings."}, {"viet": "Tặng những số tiền lớn cho các tổ chức cứu trợ.", "eng": "Donate large sums to relief organizations."}, {"viet": "Đừng ăn hết cả cái bánh ngọt bây giờ, hãy để dành một ít cho ngày mai.", "eng": "Don't eat all the cake now; save some for tomorrow."}, {"viet": "Đừng có la cà trên đường về nhà!", "eng": "Don't loiter on the way home!"}, {"viet": "Đừng ăn nói như vậy với mẹ mày, hoặc với bất cứ ai khác cũng vậy.", "eng": "Don't talk like that to your mother, or to anyone else for that matter."}, {"viet": "Thủ tướng Anh cho đến nay vẫn từ chối bình luận về những bản báo cáo này.", "eng": "Downing street has so far refused to comment on these reports."}, {"viet": "Những tấm phủ chống bụi được trùm lên đồ đạc.", "eng": "Dust-sheets were draped over the furniture."}, {"viet": "Ganh đua chơi dương cầm hơn người chị cô ta.", "eng": "Emulate her elder sister at the piano."}, {"viet": "Cho dù có giàu có, bạn vẫn gặp những vấn đề.", "eng": "Even if you were rich you'd still have problems."}, {"viet": "Các dấu tích về tác dụng của băng trên những tảng đá.", "eng": "Evidences of glacial action on the rocks."}, {"viet": "Những kỳ công nổi tiếng trong tập truyện cổ tích và thơ ca.", "eng": "Exploits famous in legend and song."}, {"viet": "Định mệnh đã an bài là họ sẽ không gặp lại nhau.", "eng": "Fate decreed that they would not meet again."}, {"viet": "Cuối cùng cô ta đã công nhận sự thật về những gì anh ta đã nói.", "eng": "Finally she owned the truth of what he had said."}, {"viet": "Cờ xí được treo cao ngang qua đường phố.", "eng": "Flags had been strung up across the street."}, {"viet": "Ví dụ RMB ¥ 125 có nghĩa là một trăm hai mươi lăm nhân dân tệ ba hào năm xu.", "eng": "For example, RMB ¥ 125 means one hundred and twenty five Yuan three Jiao five fen."}, {"viet": "Phong cách hát không ai bắt trước được của Frank Sinatra.", "eng": "Frank Sinatra's inimitable style of sing."}, {"viet": "Các khu vườn tràn ngập mùi hương húng tây.", "eng": "Gardens sweet with the scent of thyme."}, {"viet": "Bảo được những đứa trẻ này làm theo ý mình là cả một nghệ thuật, tôi có thể nói với anh như vậy!", "eng": "Getting these children to do what you want is a science, I can tell you!"}, {"viet": "Tạo cơ hội cho bản thân tự điều chỉnh.", "eng": "Give yourself a chance to adjust."}, {"viet": "Chúc ngủ ngon, tôi phải đi ngủ sớm.", "eng": "Good night, I must get my beauty sleep."}, {"viet": "Giá vé giảm một nửa cho những người không có lương.", "eng": "Half-price tickets for the unwaged."}, {"viet": "Cảnh sát có bằng chứng gì để buộc tội anh ta không?", "eng": "Have the police got anything on him?"}, {"viet": "Bạn có bao giờ thấy cảnh lưu thông tệ hại như thế này chưa?", "eng": "Have you ever seen traffic worse than this?"}, {"viet": "Cậu đã xem cuộc triển lãm tranh của Picasso chưa?", "eng": "Have you seen the Picasso exhibition?"}, {"viet": "Hắn là một thằng cha buồn cười''Anh muốn nói buồn cười theo kiểu gây cười hay buồn cười theo kiểu quái dị?'.", "eng": "He's a funny chap''Do you mean funny ha-ha or funny peculiar?'."}, {"viet": "Anh ta đã ở đây nhiều năm, giờ đây hẳn anh ta phải biết tường tận công việc đó.", "eng": "He's been here for years, he should know the ins and outs of the job by now."}, {"viet": "Anh ta gặp nhiều khó khăn trang trải tiền thế chấp hàng tháng.", "eng": "He's having a lot of trouble paying his mortgage every month."}, {"viet": "Ông ta là người tu hành nhưng ông ta không cố tình gán ép tín ngưỡng của mình cho mọi người.", "eng": "He's religious but he doesn't try to foist his beliefs on everyone."}, {"viet": "Hắn kết tội tôi làm tình với vợ hắn.", "eng": "He accused me of screwing his wife."}, {"viet": "Ông ấy yêu cầu ngân hàng trả trước cho ông ấy năm ngàn nhân dân tệ.", "eng": "He asked the bank to advance him five thousand Yuan."}, {"viet": "Trong cuộc đối chất, hắn ta đã thúc thủ và buộc phải nhận sự thật.", "eng": "He broke down under cross-examination and admitted the truth."}, {"viet": "Anh ta lắp gạch vào chỗ bằng xi-măng.", "eng": "He cemented the bricks into place."}, {"viet": "Anh ta quất roi và con ngựa nhảy tới phía trước.", "eng": "He cracked his whip and the horse leapt forward."}, {"viet": "Hắn không kể một điều gì cho chúng tôi nghe về ngày nghỉ của hắn cả.", "eng": "He didn't tell us a thing about his holiday."}, {"viet": "Ông ta thoát khỏi vụ án với danh tiếng của mình không bị tổn hại.", "eng": "He emerged from the court case with his reputation undamaged."}, {"viet": "Ông ta cảm thấy bị đồng nghiệp đánh giá hồ đồ.", "eng": "He felt he had been prejudged by his colleagues."}, {"viet": "Ông ấy đặt món ăn với người phục vụ.", "eng": "He gave his order to the waiter."}, {"viet": "Anh ta cố tóm lấy thằng bé, nhưng không thể cứu nó khỏi bị ngã.", "eng": "He grabbed at the boy, but could not save him from falling."}, {"viet": "Ông ấy đã phải nộp hộ chiếu cho nhà cầm quyền.", "eng": "He had to give his passport up to the authorities."}, {"viet": "Anh ta bị mù từ lúc mới lọt lòng.", "eng": "He has been blind from birth."}, {"viet": "Anh ta có toàn quyền sử dụng căn nhà.", "eng": "He has the run of the house."}, {"viet": "Anh ta mời cô ta đi xem hát vào buổi tối.", "eng": "He invited her to be his guest for the evening at the theatre."}, {"viet": "Anh ấy không dễ nản lòng.", "eng": "He is not easily cast down."}, {"viet": "Nó ngần ngại khi nghe giá vé quá cao.", "eng": "He jibbed when he heard how much the tickets would cost."}, {"viet": "Nó có phần miễn cưỡng rời bỏ chúng tôi.", "eng": "He left us with some reluctance."}, {"viet": "Anh ấy đã mất tất cả những gì thân yêu đối với anh ta.", "eng": "He lost everything that was dear to him."}, {"viet": "Anh ta đã đọc sai chuyến tàu cuối thành chuyến tàu nhanh.", "eng": "He misread the last train as the fast train."}, {"viet": "Ông ta sống lâu hơn vợ ba năm.", "eng": "He outlived his wife by three years."}, {"viet": "Anh ta thích hoà với đám đông, để khỏi bị để ý.", "eng": "He preferred to stick with the herd so as not to be noticed."}, {"viet": "Chàng nhanh chóng thích nghi với lối sống mới.", "eng": "He quickly accustomed himself to this new way of life."}, {"viet": "Ông ta nhẩm sẵn cuộc phỏng vấn trong đầu.", "eng": "He rehearsed the interview in his mind beforehand."}, {"viet": "Nó là một thằng gây tai tiếng cho gia đình.", "eng": "He's a discredit to his family."}, {"viet": "Ông ấy bắt đầu bị còng lưng vì tuổi già.", "eng": "He's beginning to stoop with age."}, {"viet": "Ông ấy đang kiếm được hai mươi ngàn một năm.", "eng": "He's making twenty thousand a year."}, {"viet": "Ông ta là người không thích hợp cho công việc đó.", "eng": "He's the wrong man for the job."}, {"viet": "Anh ta nói rằng chỉ đến hôm nay anh ta mới ( cảm thấy ) khá khoẻ.", "eng": "He says he's only ( feeling ) middling today."}, {"viet": "Nó lao ra khỏi trườn như tên bắn khi chuông nổi lên.", "eng": "He shot out of school when the bell rang."}, {"viet": "Anh ta bán xe ô tô mà không cho vợ biết.", "eng": "He sold the car without his wife's knowledge."}, {"viet": "Nó ở lại trường đại học để nghiên cứu.", "eng": "He stayed on at university to do research."}, {"viet": "Anh dốc hết tinh thần dũng cảm cho trận đánh.", "eng": "He summoned up his spirit for the battle."}, {"viet": "Anh ta cất cầu dao và tất cả ánh sáng trong toà nhà tắt ngấm.", "eng": "He threw the master switch and every light in the building went out."}, {"viet": "Hắn giẫm chân lên bó hoa của tôi khi hắn đang chơi bóng đá.", "eng": "He trampled on my flowers when he was getting his football."}, {"viet": "Anh ta làm tôi buồn khi anh ta cười nhạo ý tưởng của tôi.", "eng": "He upset me when he laughed at my idea."}, {"viet": "Khi say rượu anh ta là một kẻ vũ phu.", "eng": "He was a brute when he was under the influence of liquor."}, {"viet": "Hồi đó anh ta rất bí ẩn và không nói với tôi là anh ta định làm gì.", "eng": "He was being very mysterious, and wouldn't tell me what he was up to."}, {"viet": "Anh ta quyết tâm làm theo kế hoạch của mình.", "eng": "He was determined to run with his plan."}, {"viet": "Anh ta đã bị giam cầm ba năm.", "eng": "He was held in captivity for three years."}, {"viet": "Nó lại quấy rầy tôi để vay tiền.", "eng": "He was on at me again to lend him money."}, {"viet": "Hắn bị kết án tử hình do đội xử bắn thi hành.", "eng": "He was sentenced to death by firing-squad."}, {"viet": "Ông cũng trở nên nổi tiếng như Columbus, nhưng ít ai biết ông bằng cái tên Ba Lan của ông.", "eng": "He was to become almost as famous as Comlumbus, but not many people know him by his Polish name."}, {"viet": "Anh ta đi từng nhà bán các bộ bách khoa toàn thư.", "eng": "He went from door to door, selling encyclopaedias."}, {"viet": "Anh ta chinh phục được nhiều trái tim phụ nữ nhờ sự hào hoa phong nhã của mình.", "eng": "He won many hearts by his gallantry."}, {"viet": "Những lo lắng về sức khỏe đã ám ảnh ông ta trong suốt kỳ nghỉ.", "eng": "Health worries preoccupied him for the whole holidays."}, {"viet": "Việc chỉ định bà ta làm lãnh đạo đã làm cho đảng sinh động trở lại.", "eng": "Her appointment as leader revitalized the party."}, {"viet": "Yêu sách của bà ta về tước hiệu đã được các nhà sử học xác minh là chính đáng.", "eng": "Her claim to the title was vindicated by historians."}, {"viet": "Những ván trượt tuyết đắt tiền của cô ta nằm xó đóng đầy bụi.", "eng": "Her expensive skis sat gathering dust."}, {"viet": "Mái tóc của nàng được người thờ uốn bậc nhất tạo hình.", "eng": "Her hair was sculpted by a leading coiffeur."}, {"viet": "Sự thiếu kinh nghiệm của cô ta đã có tác dụng xấu đối với cô ấy.", "eng": "Her lack of experience told against her."}, {"viet": "Cặp kính mới của cô ta làm cho cô trông có phần nghiêm nghị.", "eng": "Her new glasses make her look rather owlish."}, {"viet": "Bác sĩ tâm thần của cô ta đã cho biết là cô ta quá căng thẳng và quá dè dặt nên không thể chịu được một thầy giáo xa lạ.", "eng": "Her psychiatrist had pronounced her too tense and indrawn to endure a strange teacher."}, {"viet": "Lời văn cô ta viết vẫn mang phong cách buồn.", "eng": "Her speech continued in the some dismal strain."}, {"viet": "Trọng lượng của cô ta đã tăng lên tới 7 kilo.", "eng": "Her weight has increased to 7 kilos."}, {"viet": "Này, hãy nhìn ngọn đồi ở đằng kia kìa.", "eng": "Hey, look at the hill over there."}, {"viet": "Tro hoả táng của ông ta được chôn bên cạnh tro hoả táng của vợ ông.", "eng": "His ashes were buried next to those of his wife."}, {"viet": "Tính tình của anh ta dường như hoàn toàn thay đổi kể từ khi anh ta gặp tai nạn.", "eng": "His character seems to have under gone a complete transformation since he had accident."}, {"viet": "Quyển nhật ký của hắn cho thấy rõ hắn là một kẻ tham lam, kiêu ngạo.", "eng": "His diary shows him up as have been a greedy, arrogant man."}, {"viet": "Sự thất bại của ông ta phần lớn là do ông ta đã thiếu lòng tin.", "eng": "His failure is in large measure due to lack of confidence."}, {"viet": "Hai bàn tay nó đan vào nhau khi cầu nguyện.", "eng": "His hands were clasped in prayer."}, {"viet": "Ngôn từ của ông ấy không ai dám kể lại.", "eng": "His language won't bear repeating."}, {"viet": "Bài nói chuyện súc tích của ông ta đủ để thuyết phục được khán giả.", "eng": "His moving speech was enough to carry the audience."}, {"viet": "Kế hoạch anh ta gặp phải sự phản đối kịch liệt.", "eng": "His plan met with fierce opposition."}, {"viet": "Đèn hiệu bên phải của anh ta đang nháy.", "eng": "His right-hand indicator is flashing."}, {"viet": "Kiểu tranh luận của anh ta trong các buổi họp không hung hăng nhưng ương ngạnh hơn.", "eng": "His style of argument in meetings is not so much aggressive as pertinacious."}, {"viet": "Cái chết của người vợ làm anh ta choáng váng.", "eng": "His wife's death was a great blow."}, {"viet": "Coi nhẹ đồng tiền, anh ta tiêu nó một cách phóng khoáng.", "eng": "Holding money lightly, he spent it freely."}, {"viet": "Các bà nội trợ đã bị những quà tặng không mất tiền làm cho mềm lòng trước khi người bán hàng bắt đầu vào chuyện nài nỉ.", "eng": "Housewives were softened up with free gifts before the salesmen began the hard talking."}, {"viet": "Sao anh cứ đứng yên trong khi nó đánh chị ấy như vậy?", "eng": "How can you stand by while he's hitting her?"}, {"viet": "Hân hạnh được biết ông, ông Brown.", "eng": "How do you do, Mr Brown."}, {"viet": "Tôi phải giữa tiền trong tài khoản bao lâu?", "eng": "How long do I have to keep the money in the account?"}, {"viet": "Chúng ta có bao nhiêu cái cốc?", "eng": "How many glasses have we got?"}, {"viet": "Tôi phải trả bao nhiêu tiền?", "eng": "How much do I have to pay?"}, {"viet": "Thật đáng buồn là những cố gắng của anh ta chỉ đi đến thất bại nặng nề.", "eng": "How sad that his efforts should come to nothing."}, {"viet": "Cài lại khuy áo nhanh lên.", "eng": "Hurry up and re-button it."}, {"viet": "Tôi xin phỏng vấn ông về quan điểm của ông về vấn đề nhà ở.", "eng": "I'd like to question you on your views about the housing problem."}, {"viet": "Tôi sẽ bàn chuyện đó với anh bất cứ khi nào anh thích.", "eng": "I'll discuss it with you whenever you like."}, {"viet": "Tôi cần có vài tuần để xem xét sự thể ra sao trước khi tôi có thể đưa ra những quyết định nào đó về tương lai của doanh nghiệp.", "eng": "I'll need several weeks to discover the lie of the land before I can make any decisions about the future of the business."}, {"viet": "Tôi là một người dễ dãi nhưng thái độ của anh thật là quá sức chịu đựng của tôi.", "eng": "I'm a tolerant man but your behaviour is more than I can bear."}, {"viet": "Tôi đã chán ngấy đợi anh ta rồi! Tôi về đây!", "eng": "I'm fed up of waiting for him! I'm going home!"}, {"viet": "Tôi sẽ có một bữa tiệc vào tối thứ bảy tới.", "eng": "I'm having a party next Saturday night."}, {"viet": "Tôi chưa chuẩn bị để đi, tôi chưa có khoá hoặc tiền.", "eng": "I'm not ready to go out yet, I haven't got my keys or my money."}, {"viet": "Tôi xin lỗi, cái tách tự nhiên vỡ từng mảnh trên tay tôi.", "eng": "I'm sorry, the cup just came apart in my hands."}, {"viet": "Tôi đang nghĩ đến việc mở rộng sang dụng cụ thể thao.", "eng": "I'm thinking of expanding into sports equipment."}, {"viet": "Tôi được giao trách nhiệm tổ chức cuộc họp hàng tuần.", "eng": "I've been delegated to organize the weekly meetings."}, {"viet": "Tôi đã làm thủng khuỷu tay áo len của tôi.", "eng": "I've gone through the elbows of my sweater."}, {"viet": "Tôi không nhớ được bao nhiêu lần anh ta nói là sẽ từ bỏ cô ấy.", "eng": "I've lost count of how many times he's said he's leaving her."}, {"viet": "Tôi đã giao cho em trai quản lí công việc của tôi.", "eng": "I've turned over the management of my affairs to my brother."}, {"viet": "Tôi luôn luôn vấn lấy các điếu thuốc của mình.", "eng": "I always roll my own cigarettes."}, {"viet": "Tôi xin lỗi, tôi lầm anh với người tôi quen.", "eng": "I am sorry, I mistook you for someone I know."}, {"viet": "Tôi đánh cá về bốn con ngựa nhưng chẳng thắng về con nào cả!", "eng": "I backed four horses but won nothing!"}, {"viet": "Tôi đến theo lời thỉnh cầu đặc biệt của ông.", "eng": "I came at your special request."}, {"viet": "Tôi không thể để anh trả các món nợ của tôi-tôi không cho phép có chuyện như vậy.", "eng": "I can't let you pay my debts-I won't hear of such a thing."}, {"viet": "Tôi có thể uống bia bất cứ khi nào tôi muốn.", "eng": "I can drink beer whenever I want to."}, {"viet": "Tôi không có khả năng mua với giá đó.", "eng": "I can't afford it at that price."}, {"viet": "Tôi khen ngợi cô ta về diễn xuất điêu luyện của cô.", "eng": "I complimented her on her skillful performance."}, {"viet": "Tôi bị toạc tay vì mép lởm chởm của cái hộp thiếc.", "eng": "I cut myself on the jagged edge of the tin."}, {"viet": "Tôi đã nêu chi tiết về kế hoạch của tôi cho cô ấy nghe.", "eng": "I detailed my plans to her."}, {"viet": "Tôi không ưa chỗ này ngay từ lúc tôi nhìn thấy nó.", "eng": "I disliked the place the moment I clapped eyes on it."}, {"viet": "Tôi không biết anh ta nghĩ gì về cái trò anh ta đang làm.", "eng": "I don't know what he thinks he's playing at."}, {"viet": "Bố nghĩ là tháng này bố sẽ không thể làm gì cả.", "eng": "I don't think I will be able to do anything this month."}, {"viet": "Tôi không muốn trách ai trong các bạn.", "eng": "I don't wish to apportion blame among you."}, {"viet": "Tôi nghi không biết anh ta đã đọc cái đó chưa.", "eng": "I doubt if he has read it yet."}, {"viet": "Tôi thấy chóng mặt, tôi phải ngồi xuống.", "eng": "I feel giddy; I must sit down."}, {"viet": "Tôi thấy quan điểm chính trị của ông ta hơi khó chấp nhận.", "eng": "I find his political views a little hard to take."}, {"viet": "Tôi hiểu-cả hai bạn muốn được ở lại riêng với nhau.", "eng": "I get the picture-you two want to be left alone together."}, {"viet": "Tôi có hơi bốp chát với nó về những khuyết điểm của nó.", "eng": "I had a bit of a ding-dong with him about his mistakes."}, {"viet": "Tôi đã phải bỏ ra một đống của để mua cái ôtô này.", "eng": "I had to lay out a fortune on that car."}, {"viet": "Tôi đã quen với làm việc trong nhiều giờ.", "eng": "I have accustomed myself to working long hours."}, {"viet": "Tôi không có gì để phàn nàn hắn cả.", "eng": "I have no quarrel with him."}, {"viet": "Tôi có hai chị và một anh, cả thảy là ba anh chị.", "eng": "I have two sisters and a brother, three siblings in all."}, {"viet": "Tôi nghe nói Detroit rất lạnh vào mùa đông.", "eng": "I hear that Detroit is very cold in winter."}, {"viet": "Tôi hi vọng tấm ảnh này chụp đẹp.", "eng": "I hope that one comes out."}, {"viet": "Tôi ùa vào phòng cô ấy mở tung cánh cửa.", "eng": "I just breezed in to her room, flinging the door wide."}, {"viet": "Tôi biết chị là một đầu bếp thật giỏi.", "eng": "I know that you are a really good cook."}, {"viet": "Tôi thích hương thơm của nó đấy.", "eng": "I like the way it smells."}, {"viet": "Tôi sẽ liên hệ với nhân viên mang hành lý ngay.", "eng": "I'll contact the bellboy at once."}, {"viet": "Bây giờ tôi sẽ đánh bóng giày cho ông, được không?", "eng": "I'll shine your shoes now, OK?"}, {"viet": "Tôi là học sinh tiểu học.", "eng": "I'm an elementary school student."}, {"viet": "Tôi đang nôn nóng kể cho bạn một tin đây!", "eng": "I'm itching to tell you the news!"}, {"viet": "Xin lỗi nhưng tôi không hiểu cái trò đùa đó.", "eng": "I'm sorry but I can't see the joke."}, {"viet": "Tôi có thể đến muộn-tôi có đôi ba việc phải làm.", "eng": "I may be late-I have got one or two things to attend to."}, {"viet": "Chiều nay tôi phải bỏ ra một giờ để làm vườn.", "eng": "I must put in an hour's gardening this evening."}, {"viet": "Tôi chưa bao giờ nghe một sự náo động nào như thế!", "eng": "I never heard such a carry-on!"}, {"viet": "Tôi đã chuyển bức điện của cô ta cho mẹ của anh ấy.", "eng": "I passed her message on to his mother."}, {"viet": "Tôi rung chuông nhưng không thấy trả lời.", "eng": "I rang the bell but there was no answer."}, {"viet": "Tôi coi những lời buộc tội ấy là đầy đủ cứ liệu.", "eng": "I regard these allegations as actionable."}, {"viet": "Tôi thấy anh ấy đang nói chuyện với vài phi công khác.", "eng": "I saw him talking with some of the other pilots."}, {"viet": "Tôi sẽ đắm mình trong cái sở thích rất tự nhiên của người già, đó là nói về bản thân mình.", "eng": "I shall indulge the inclination so natural in old men, to be talking of themselves."}, {"viet": "Tôi đã tiêu quá nhiều đến nỗi tôi gần như phá sản.", "eng": "I spent so much I'm almost bankrupt."}, {"viet": "Tôi đã khéo léo không nhắc tới cuộc tranh luận của anh ta với sếp.", "eng": "I tactfully refrained from mentioning his argument with the boss."}, {"viet": "Tôi nghĩ nó đắt tiền bởi vì nó được sản xuất tại Paris, trung tâm của thời trang phụ nữ thế giới.", "eng": "I think it's expensive because it was made in Paris, the center of world fashions for women."}, {"viet": "Tôi nghĩ là anh có thể làm được.", "eng": "I think you'll be able to do it."}, {"viet": "Tôi hết sức phật ý với những nhận định thô lỗ của anh ta.", "eng": "I took the greatest exception to his rude remarks."}, {"viet": "Tôi lau xe đạp bằng một miếng giẻ có tẩm dầu.", "eng": "I use an oily rag to clean my bike with."}, {"viet": "Tôi muốn thư này đi kịp với chuyến thư chiều.", "eng": "I want this letter to catch the afternoon mail."}, {"viet": "Tôi muốn giữ bí mật món quà của mẹ nhưng chị tôi đã tiết lộ.", "eng": "I wanted mother's present to be a secret, but my sister let the cat out of the bag."}, {"viet": "Tôi cảm thấy một chút buồn chán, anh biết đấy, và vì thế...'.", "eng": "I was feeling a bit bored, you know, and so...'."}, {"viet": "Tôi chuẩn bị sẽ phải chờ đợi.", "eng": "I was prepared for a wait."}, {"viet": "Tôi đã tưởng nhầm là nó lương thiện cho đến khi nó bị bắt khi đang ăn cắp tiền.", "eng": "I was under the illusion that he was honest until he was caught stealing some money."}, {"viet": "Bây giờ tôi xin tạm biệt hai ông, bởi vì tôi có một cái hẹn khác vào lúc hai giờ.", "eng": "I will leave you two gentlemen now, as I have another appointment at two."}, {"viet": "Tôi không muốn hút, xin cảm ơn-tôi đang cố hút ít đi.", "eng": "I won't have a cigarette, thanks-I'm trying to cut down."}, {"viet": "Tôi muốn mô tả cô ta có vẻ đẹp đoan trang khoẻ mạnh hơn là yêu kiều.", "eng": "I would describe her as handsome rather than beautiful."}, {"viet": "Tôi muốn rút một ít tiền.", "eng": "I would like to withdraw some money."}, {"viet": "Phí nhiều giờ xem truyền hình.", "eng": "Idle away the hours watching TV."}, {"viet": "Nếu tôi tìm ra cái thằng đã làm xước xe ôtô của tôi thì, tôi sẽ vặn cổ nó!", "eng": "If I find the person who scratched my car, I'll wring his neck!"}, {"viet": "Nếu đúng là như vậy, bạn sẽ phải làm việc nhọc nhằn hơn nhiều.", "eng": "If that is the case, you will have to work much harder."}, {"viet": "Nếu chúng ta lên Đỉnh Brilliance, đỉnh chính, thì chúng ta sẽ mất ít thời gian hơn.", "eng": "If we go to the Summit of Brilliance, the main peak, it will take us less time."}, {"viet": "Nếu anh so sánh tác phẩm của cô ấy với tác phẩm của anh ta, anh sẽ thấy tác phẩm của cô ấy hay hơn nhiều.", "eng": "If you compare her work with his, you'll find hers is much better."}, {"viet": "Nếu bạn không có la bàn, hãy dùng các ngôi sao để dẫn đường cho bạn.", "eng": "If you haven't a compass, use the stars to guide you."}, {"viet": "Nếu bạn muốn mua nó, bạn có thể đặt hàng từ danh mục này.", "eng": "If you want it, you can order from the catalog."}, {"viet": "Trong một ngày, một bác sĩ có thể viết tới 30 đơn thuốc cho người bệnh.", "eng": "In a day, a doctor may write 30 prescriptions for patients."}, {"viet": "Theo luật pháp Anh, một người được coi là vô tội cho đến khi được chứng tỏ là người đó có tội.", "eng": "In English law a man is accounted innocent until he is proved guilty."}, {"viet": "Ở quê tôi, trời thường có gió vào tháng 3.", "eng": "In my hometown, it's often windy in March."}, {"viet": "Trong Liên hiệp Anh cũng có nhiều thuộc địa và nhiều vùng đất bị người Anh cai trị một phần.", "eng": "In the Commonwealth there are also many colonies and other areas which are ruled at least in part by Britain."}, {"viet": "Trong từ chemistry trọng âm ở phần thứ nhất của từ.", "eng": "In the word chemistry the stress is on the first part of the word."}, {"viet": "Lạm phát làm giảm sức mua của những người sống bằng thu nhập cố định.", "eng": "Inflation reduces the purchasing power of people living on fixed incomes."}, {"viet": "Người nước ngoài lấy bằng lái ở Mỹ có khó không?", "eng": "Is it difficult for foreigners to get a driver's license in the U. S.?"}, {"viet": "Có chỗ để xe trong bãi đỗ xe của xí nghiệp không?", "eng": "Is there a space for the car in the firm's car park?"}, {"viet": "Đó không phải là một quan điểm phần nào mang tính chất sô vanh đấy chứ?", "eng": "Isn't that a rather chauvinistic attitude to be taking?"}, {"viet": "Đó là tiếng sáo truyền thống của người Mỹ bản địa.", "eng": "It's a traditional Native American flute."}, {"viet": "Thật khó có thể chen chân vào nghề xuất bản.", "eng": "It's difficult to get a foot in the door of publishing."}, {"viet": "Nó chỉ là một sợi dây đen đeo quanh cổ với một miếng ngọc trượt lên xuống.", "eng": "It's just a black cord around the neck with a piece of jewelry that slides up and down."}, {"viet": "Thật là không logic khi chờ đợi một đứa bé hiểu được lời chế nhạo.", "eng": "It's not reasonable to expect a child to understand sarcasm."}, {"viet": "Đó là một điểm quá nhỏ hầu như không đáng phải bận tâm.", "eng": "It's such a small point that it's hardly worth troubling about."}, {"viet": "Anh thật là sai trái khi đùa giỡn với tình cảm của cô ta.", "eng": "It's wrong of you to trifle with her affections."}, {"viet": "Việc ấy có vẻ một tội ác cố ý nhiều hơn là một tai nạn.", "eng": "It had more the appearance of a deliberate crime than an accident."}, {"viet": "Mọi người đều thừa nhận rằng hút thuốc là có hại cho sức khoẻ.", "eng": "It is generally accepted that smoking causes bad health."}, {"viet": "Cứ theo sách tốt hơn là liều mắc lỗi.", "eng": "It is safer to go to by the book than to risk making a mistake."}, {"viet": "Rất có thể là chuyến tàu đó đã bị trễ.", "eng": "It may well be that the train is delayed."}, {"viet": "Nó giống như áo quần để nhảy múa vậy.", "eng": "It's like the clothing for the dance."}, {"viet": "Dường như thật dễ dàng để biết một việc gì ẩn khuất ở đâu đây.", "eng": "It seems so easy that there must be a catch somewhere."}, {"viet": "Đó là một năm kém phát triển đối với các phim mới cả về lượng và chất.", "eng": "It was a bad year for new films, in terms of both quantity and quality."}, {"viet": "Tôi nói cho bạn biết là rất vui.", "eng": "It was fun, I tell you."}, {"viet": "Cậu thật là ngu quá để lộn ngược cái hộp mà không đóng nắp lại.", "eng": "It was stupid of you to turn it upside down without closing the lid."}, {"viet": "Nói dối anh sẽ là trái với đạo lý của tôi.", "eng": "It would be against my principles to lie to you."}, {"viet": "Xe hơi của Nhật chạy ít hao xăng.", "eng": "Japanese cars get good gas mileage."}, {"viet": "Các nhà báo nghiên cứu bài diễn văn của ông bộ trưởng để thấy trước triển vọng nội dung của bản tuyên bố về chính sách trong tháng sau.", "eng": "Journalists studying the minister's speech for pointers to the contents of next month's policy statement."}, {"viet": "Đồ dùng ở nhà bếp nên trông vừa ưa nhìn vừa có tác dụng.", "eng": "Kitchen utensils should be attractive as well as functional."}, {"viet": "Chúng ta hãy bỏ rác trong nhà bếp vào luôn nhé.", "eng": "Let's put in the kitchen garbage as well."}, {"viet": "Cuộc sống lúc này thật khó khăn, nhưng chúng tôi vẫn khắc phục được.", "eng": "Life is hard at the moment, but we're surviving."}, {"viet": "Cũng có nhiều người sống ở đây, tại Oklahoma.", "eng": "Many live here in Oklahoma, too."}, {"viet": "Chợ đầy rẫy những xe hơi cũ còn tốt để bán.", "eng": "Market is saturated with good used cars."}, {"viet": "Cho phép tôi giúp đỡ bạn bằng cách nào đó nhé?", "eng": "May I help you in any way?"}, {"viet": "Học thuộc bảng chữ cái thì khá dễ.", "eng": "Memorizing the alphabet is rather easy."}, {"viet": "Phần lớn tệ phân biệt chủng tộc là dựa trên sự ngu dốt.", "eng": "Most racial discrimination is based on ignorance."}, {"viet": "Sáng nay đồng hồ báo thức của tôi đã không reo.", "eng": "My alarm clock didn't go off this morning."}, {"viet": "Mắt tôi quen dần với bóng tối.", "eng": "My eyes slowly grew accustomed to the gloom."}, {"viet": "Cuộc sống của tôi bây giờ cảm thấy trống trải khi con cái vắng nhà.", "eng": "My life feels empty now the children have left home."}, {"viet": "Tôi và chị gái không đi xem bộ phim đó vì chúng tôi đã xem rồi.", "eng": "My sister and I didn't go to watch the film because we'd seen it before."}, {"viet": "Chẳng chiếc nào cả, xe của mình đang sửa chữa.", "eng": "Neither, mine's being repaired."}, {"viet": "Không, trước hết tôi muốn hỏi về một số nhân viên khác.", "eng": "No, first I want to ask about some other men."}, {"viet": "Cho dù tôi ở đâu đi nữa, Tôi cũng sẽ gặp anh tại nhà hàng trước bảy giờ.", "eng": "No matter where I am, I'll meet you at the restaurant by seven o'clock."}, {"viet": "Bây giờ ông muốn gửi bao nhiêu tiền?", "eng": "Now how much do you want to put in?"}, {"viet": "Chắn chắn là họ không có bán trà Ô Long rồi.", "eng": "Of course, they don't have it."}, {"viet": "OK, nhưng tôi chỉ muốn mua một ít tiền kim loại.", "eng": "OK, but I only want to buy some coins."}, {"viet": "Ừm, anh muốn phòng tầng mấy?", "eng": "On which floor do you want?"}, {"viet": "Một trong những địa chủ lớn nhất hiếm thấy ở nước Anh.", "eng": "One of the biggest single landowners in England."}, {"viet": "Giờ làm việc của chúng tôi từ 9 giờ đến 12 giờ buổi sáng hoặc 1 giờ 30 phút đến 4 giờ bốn giờ ) buổi chiều.", "eng": "Our business hours are from 9: 00 to 12: 00 in the morning or 1: 30 to 4: 00 in the afternoon."}, {"viet": "Chủ nhà đã thiết đãi chúng tôi rất hậu.", "eng": "Our hosts wined and dined us very well."}, {"viet": "Các chiến sĩ của chúng ta chiến đấu tranh chấp từng tấc đất.", "eng": "Our soldiers disputed every inch of ground."}, {"viet": "Hãy gói áo quần cẩn thận, đừng để nó bị nhàu.", "eng": "Pack the clothes carefully so that you don't crease them."}, {"viet": "Người dự tiệc cảm thấy ngượng khi Frank uống rượu say và giở trò quậy.", "eng": "People at the party were embarrassed when Frank got drunk and made an exhibition of himself."}, {"viet": "Peter sẽ lên làm giám đốc điều hành khi Bill về hưu.", "eng": "Peter will take over as managing director when Bill retires."}, {"viet": "Địa vị chính trị ở nước Anh thường là đặc quyền cho tầng lớp có tài sản.", "eng": "Politics in Britain used to be the perquisite of the property-owning classes."}, {"viet": "Samuel hứa sẽ tiếp tục ủng hộ cô ấy, dù cho có chuyện gì xảy ra.", "eng": "Samuel promised to stick by her, whatever happened."}, {"viet": "Nhiều cô gái trẻ đang ngồi quanh đó, vẻ chán chường.", "eng": "Several young girls were sitting around looking bored."}, {"viet": "Bà ta là một nhà văn hay-hãy cố gắng bắt chước văn phong của bà ta.", "eng": "She's a good writer-try to copy her style."}, {"viet": "Chị ấy đã bắt đầu có các vết nhăn quanh mắt.", "eng": "She's beginning to get wrinkles around her eyes."}, {"viet": "Cô ấy vừa mất việc làm, vì thế họ thực sự cảm thấy khó khăn.", "eng": "She's just lost her job, so they're really feeling the squeeze."}, {"viet": "Cô ta rất bình tĩnh, dường như không có điều gì có thể làm cô ta bối rối được.", "eng": "She's so calm, nothing seems to faze her."}, {"viet": "Bà ta thông đồng với nhân chứng khác.", "eng": "She acted in collusion with the other witness."}, {"viet": "Bà ấy khóc khi bà ấy nghe tin bạn mình chết.", "eng": "She began to cry when she heard of her friend's death."}, {"viet": "Cô ta chặn tôi để nói chuyện khi tôi đang ra khỏi tòa nhà.", "eng": "She collared me as I was leaving the building."}, {"viet": "Bà ta đã có một cuộc nói chuyện về triết học cho hội.", "eng": "She delivered a talk on philosophy to the society."}, {"viet": "Cô ấy đánh rơi cái đĩa và nó vỡ tan thành từng mảnh.", "eng": "She dropped the plate and it broke into pieces."}, {"viet": "Cô ấy gập chiếc khăn mùi xoa và đút vào túi.", "eng": "She folded her handkerchief and put in her pocket."}, {"viet": "Ông chủ mắng cho cô ta một trận vì đi muộn.", "eng": "She got blown by her boss for being late."}, {"viet": "Cô ta có cảm tưởng là đã từng gặp anh ấy trước đây.", "eng": "She had the impression that she had seen him before."}, {"viet": "Cô ấy có cách làm riêng của mình.", "eng": "She has her own special way of doing things."}, {"viet": "Cô ấy bắt chước cách nói của thầy giáo cô ấy.", "eng": "She imitated the way her teacher talked."}, {"viet": "Cô ta náo nức muốn thử đôi giày trượt băng mới.", "eng": "She is raring to try out her new skates."}, {"viet": "Cô ấy cười vào mũi hắn, và thế là hắn ta bước ra ngoài.", "eng": "She laughed at him, whereupon he walked out."}, {"viet": "Cô ta trông có vẻ hơi lạc lõng-có lẽ cô ta không nói được tiếng Anh.", "eng": "She looks rather out of it-perhaps she doesn't speak English."}, {"viet": "Cô ấy cần được phép miễn trừ của Nhà thờ để kết hôn với người anh họ của mình.", "eng": "She needs a special dispensation to marry her cousin."}, {"viet": "Cô ta chơi anh ấy một vố hoàn toàn là trò tinh nghịch.", "eng": "She played a trick on him out of sheer devilment."}, {"viet": "Cô ấy nhận giải với một vẻ hờ hững.", "eng": "She received the prize with an air of nonchalance."}, {"viet": "Cô ta đang làm việc trong vườn.", "eng": "She's at work in garden."}, {"viet": "Cô ta đang nghỉ cuối tuần ở thành phố.", "eng": "She's spending the weekend in town."}, {"viet": "Cô ta có vẻ khá thản nhiên về sự thiệt hại ấy.", "eng": "She seemed fairly philosophical about the loss."}, {"viet": "Cô ta trượt chân, mất thăng bằng nhưng kịp thời lấy lại được để khỏi ngã.", "eng": "She slipped, lost her balance and regained it just in time to prevent herself from falling."}, {"viet": "Bà ta ra sức phủ nhận mọi lời buộc tội.", "eng": "She strenuously denies all the charges."}, {"viet": "Cô ta tự lao vào một chiếc xe đang chạy tới.", "eng": "She threw herself in the path of an oncoming vehicle."}, {"viet": "Bà ta đã phải rời bỏ trại của mình chuyển đến ở London.", "eng": "She uprooted herself from the farm and moved to London."}, {"viet": "Cô ta sắt đá, nhưng anh ta cũng không tỏ dấu hiệu gì nhượng bộ.", "eng": "She was adamant, but he was too, showed no sign of yielding."}, {"viet": "Cô ấy bị kẹt lại ở văn phòng vì có những người gọi điện tới đột xuất.", "eng": "She was detained in the office by unexpected callers."}, {"viet": "Cô ta được mời đến đám cưới nhưng đã không đến dự.", "eng": "She was invited to the wedding but didn't attend."}, {"viet": "Cô ta bị những người hàng xóm thường xuyên hắt hủi.", "eng": "She was repeatedly snubbed by her neighbours."}, {"viet": "Cô ta đang run lên vì bị kích động nhưng giọng nói vẫn vững.", "eng": "She was trembling with excitement but her voice was steady."}, {"viet": "Bà ta cấp tốc đến ngân hàng đổi séc lấy tiền mặt.", "eng": "She went post-haste to the bank and cashed the cheque."}, {"viet": "Cô ta đeo huy chương bằng sợi dây vòng quanh cổ của cô ta.", "eng": "She wore the medal on the string round her neck."}, {"viet": "Quay cảnh đó bằng một lần bấm máy duy nhất.", "eng": "Shoot the scene in a single take."}, {"viet": "Điều có nghĩa là ông ta không phủ nhận có thể có cuộc bầu cử.", "eng": "Significantly, he did not deny that there might be an election."}, {"viet": "Sáu con cọp đã bị hạ trước họng súng của ông ta.", "eng": "Six tigers fell to his rifle."}, {"viet": "Hút thuốc lá là một nguyên nhân góp phần gây ung thư phổi.", "eng": "Smoking is a contributory cause of lung cancer."}, {"viet": "Vì vậy chúng tôi chỉ đổi tiền giấy và bù bất kỳ chênh lệch nào bằng nhân dân tệ.", "eng": "So we just exchange the notes and make up any difference in RMB."}, {"viet": "Một vài ngày bạn thắng, một vài ngày thua.", "eng": "Some days you win and some days you lose."}, {"viet": "Một số người cảm thấy bị gợi dục bởi những tạp chí khiêu dâm.", "eng": "Some people are sexually excited by pornographic magazines."}, {"viet": "Một ngày nào đó tôi sẽ trở lại và cưới nàng.", "eng": "Someday I'll come back and marry her."}, {"viet": "Soạn tất cả những thứ này là một công việc vất vả.", "eng": "Sorting this lot out is going to take some doing."}, {"viet": "Chen lên một chiếc xe buýt đông nghẹt.", "eng": "Squeeze one's way onto a crowded bus."}, {"viet": "Những biện pháp cứng rắn hơn để giúp cho việc chống lại hoạt động khủng bố.", "eng": "Stiffer measures to help fight terrorism."}, {"viet": "Cố hiểu cho được những gì bà ta muốn nói.", "eng": "Straining to understand what she meant."}, {"viet": "Những lời khuyên như thế mà anh ta nhận được hầu như chẳng có giá trị gì.", "eng": "Such advice as he was given proved almost worthless."}, {"viet": "Tối chủ nhật thường là khá yên tĩnh.", "eng": "Sunday nights are usually pretty quiet."}, {"viet": "Thụy Sĩ chiếm hết giải trong cuộc thi trượt tuyết.", "eng": "Switzerland swept the board in the skiing competition."}, {"viet": "Từ từ thôi và đừng liến thoắng nữa!", "eng": "Take your time and don't gabble!"}, {"viet": "Hãy nói cho tôi biết dù anh có quan tâm tới hay không.", "eng": "Tell me whether or not you're interested."}, {"viet": "Cám ơn bạn nhưng sao bạn lại gọi điện cho tôi lúc 2 giờ 30 sáng?", "eng": "Thanks but why did you call me at 2: 30 in the morning?"}, {"viet": "Loài chim đó đã trở nên khan hiếm ở đất nước này.", "eng": "That bird has become scarce in this country."}, {"viet": "Sáng kiến đó không thành, như vậy là chúng ta lại trở về con số không.", "eng": "That idea hasn't worked, so we're back to square one."}, {"viet": "Tiếng ồn đó làm tôi phát điên lên!", "eng": "That noise is driving me potty!"}, {"viet": "Chỗ ngoặt gấp này là một cái bẫy chết người cho những người đi xe máy.", "eng": "That sharp bend is a death-trap for motorists."}, {"viet": "Cái thằng ranh con khốn nạn-rồi có ngày tôi sẽ bị treo cổ vì nó!", "eng": "That wretched child-I'll swing for him one of these days!"}, {"viet": "Bị cáo khước từ rút lại lời khai của mình.", "eng": "The accused refused to retract his statement."}, {"viet": "Máy bay phải hạ cánh bắt buộc vì hai trong số những đầu máy của nó bị bốc cháy.", "eng": "The aircraft had to make a forced landing because two of its engines were on fire."}, {"viet": "Khung nhiệt độ hàng năm từ-10 độ C đến 40 độ C.", "eng": "The annual range of temperature is from-10 ° C to 40 ° C."}, {"viet": "Quân đội đang đe dọa sẽ nắm quyền kiểm soát nếu tình trạng nội loạn còn tiếp diễn.", "eng": "The army is threatening to take over if civil unrest continues."}, {"viet": "Khán giả đã bắt đầu nhấp nhỏm một cách thiếu kiên nhẫn.", "eng": "The audience began to shuffle their feet impatiently."}, {"viet": "Đứa bé ọc ra một ít sữa.", "eng": "The baby sicked up a little milk."}, {"viet": "Bờ suối đã bị súc vật đến uống nước giẫm nát.", "eng": "The bank of the stream has been champed by drinking cattle."}, {"viet": "Đời sống ở California hấp dẫn nhờ khí hậu thật là tốt.", "eng": "The beauty of living in California is that the weather is so good."}, {"viet": "Con chim đến đậu trên một cành cây.", "eng": "The bird settled on a branch."}, {"viet": "Cái xác đã bị cuốn trôi ra biển.", "eng": "The body was washed out to sea."}, {"viet": "Ranh giới mập mờ giữa khẩu ngữ và tiếng lóng thật khó mà xác định.", "eng": "The borderland between informal language and slang is hard to define."}, {"viet": "Cái phanh chân nằm giữa chân điều khiển và chân ga.", "eng": "The brake pedal is between the clutch and the accelerator."}, {"viet": "Toà nhà ấy đã bị thiêu trụi.", "eng": "The building was burned to the ground."}, {"viet": "Đường vòng giúp giải toả cho nạn ùn tắc giao thông ở trung tâm thành phố chúng ta.", "eng": "The bypass relieves traffic jams in our city centre."}, {"viet": "Chiếc xe ấy luôn được bảo dưỡng tốt.", "eng": "The car has always been properly maintained."}, {"viet": "Chiếc xe nằm lăn mấy bánh xe chổng ngược.", "eng": "The carriage lay with its wheels uppermost."}, {"viet": "Đồng bằng trung tâm của Bắc Mỹ.", "eng": "The central plains of North America."}, {"viet": "Tấm séc sẽ được lãnh tiền khi xuất trình.", "eng": "The cheque is payable on presentation."}, {"viet": "Đứa trẻ cầu xin mẹ an ủi.", "eng": "The child turned to his mother for comfort."}, {"viet": "Bọn trẻ dán mắt vào vô tuyến cả ngày.", "eng": "The children have been glued to the television all day."}, {"viet": "Trẻ con đã bị tách khỏi cha mẹ.", "eng": "The children were parted from their father."}, {"viet": "Tiếng giầy cao gót lạch cạch trên nền đá.", "eng": "The clack of high heels on the floor."}, {"viet": "Vào năm tới câu lạc bộ sẽ làm lễ kỷ niệm 100 năm thành lập.", "eng": "The club will celebrate its centenary next year."}, {"viet": "Viên sĩ quan chỉ huy và các cấp dưới của ông.", "eng": "The commanding officer and his subordinates."}, {"viet": "Công ty đã tiêu nhiều tiền vào việc quảng cáo dầu gội đầu mới của nó.", "eng": "The company has spent a lot of money on advertising its new shampoo."}, {"viet": "Hội nghị sẽ mở ra khả năng hợp tác quốc tế rộng lớn hơn.", "eng": "The conference will enable greater international co-operation."}, {"viet": "Tay nhà bếp đó dùng nhiều gia vị.", "eng": "The cook is a heavy seasoner."}, {"viet": "Đất nước đó đã chịu đựng nhiều năm hỗn loạn dưới quyền cai trị của một ông vua yếu kém.", "eng": "The country suffered years of misrule under a weak king."}, {"viet": "Đoàn thuỷ thủ được máy bay lên thẳng cứu ( khỏi chiếc tàu bị đắm ).", "eng": "The crew were taken off ( the wrecked vessel ) by helicopter."}, {"viet": "Căn bậc ba của 64 là 4.", "eng": "The cube root of 64 is 4."}, {"viet": "Những kỳ công táo bạo của những người nhảy dù rất đáng khâm phục.", "eng": "The daring exploits of the parachutists were much admired."}, {"viet": "Những sự chậm trễ đã làm toàn bộ thời gian biểu đảo lộn lung tung.", "eng": "The delays put the whole schedule out of joint."}, {"viet": "Con Quỷ thường được gọi một cách phổ biến là Lão Nick.", "eng": "The Devil is vulgarly referred to as Old Nick."}, {"viet": "Món ấy nấu với lòng cừu.", "eng": "The dish was made from the entrails of a sheep."}, {"viet": "Bác sĩ chụp xiti đầu anh ta để tìm nguyên nhân bệnh đau đầu của anh ta.", "eng": "The doctor scanned his head, to find out the cause of his headaches."}, {"viet": "Con chó lấm lét đi ra ngoài khi tôi quát nó.", "eng": "The dog slunk out when I shouted at him."}, {"viet": "Người tài xế phải được đưa ra khỏi chiếc xe bẹp dúm của anh ta.", "eng": "The driver had to be cut free from the wreckage of his car."}, {"viet": "Đồ ăn thức uống trên bàn.", "eng": "The eatables and drinkables on the table."}, {"viet": "Sự tài trợ cho nhiều trường do những cựu học sinh giàu có thực hiện.", "eng": "The endowment of many schools by rich former pupils."}, {"viet": "Tên tù vượt ngục vẫn còn tự do.", "eng": "The escaped prisoner is still at large."}, {"viet": "Sự sử dụng tiền vào vũ khí.", "eng": "The expenditure of money on weapons."}, {"viet": "Bức tường đổ xuống làm tung bụi lên người chúng tôi.", "eng": "The falling wall showered dust on us."}, {"viet": "Hàng rào làm bằng cột gỗ và dây thép gai.", "eng": "The fence was made of wooden posts and barbed wire."}, {"viet": "Bộ phim được chiếu lần đầu tiên ở liên hoan Cannes.", "eng": "The film was premièred at the Cannes festival."}, {"viet": "Hãng cần thêm những người có năng lực như bạn.", "eng": "The firm needs more people of your calibre."}, {"viet": "Việc đánh bắt cá trên khúc sông này được giữ triệt để làm khu vực sử dụng riêng cho tư nhân.", "eng": "The fishing in this stretch of the river is strictly preserved."}, {"viet": "Cầu thủ bị đuổi ra sân vì chơi thô bạo.", "eng": "The footballer was sent off the field for a foul against an opponent."}, {"viet": "Tuyết đông cứng lạo xạo dưới chân chúng tôi.", "eng": "The frozen snow crunched under our feet."}, {"viet": "Mảnh vườn là một khối màu sắc.", "eng": "The garden was a mass of colour."}, {"viet": "Những khuôn mặt của những người còn sống sót.", "eng": "The glazed faces of the survivors."}, {"viet": "Chính phủ đang thảo luận về đề nghị đó.", "eng": "The Government are discussing the proposal."}, {"viet": "Chính phủ theo đường lối cứng rắn đối với sự lạm dụng ma túy.", "eng": "The government is taking a tough line on drug abuse."}, {"viet": "Nữ kiện tướng về môn quần vợt chuyên nghiệp của phụ nữ.", "eng": "The Grande dame of women's professional tennis."}, {"viet": "Người lính gác chào ( vị tướng ) bằng những động tác mạnh mẽ.", "eng": "The guard saluted ( the general ) smartly."}, {"viet": "Tràng tiếng nổ lạch tạch chát chúa của súng máy.", "eng": "The harsh rattle of machine-gun fire."}, {"viet": "Tỉ lệ thất nghiệp cao đang làm cho nhiều gia đình bắt đầu cảm thấy gay go.", "eng": "The high rate of unemployment is making many families feel the pinch."}, {"viet": "Ông chủ và bà chủ đi lại ( giữa những người khách của họ ).", "eng": "The host and hostess circulated ( among their guests )."}, {"viet": "Ngôi nhà nằm cách xa con đường.", "eng": "The house is set well back from the road."}, {"viet": "Ý tưởng về nền dân chủ không phải là mới mẻ.", "eng": "The idea of democracy is not new."}, {"viet": "Sự mệt nhọc kinh niên là triệu chứng của sự nhiễm trùng đó.", "eng": "The infection is symptomized by chronic fatigue."}, {"viet": "Các công việc nội bộ của một quốc gia.", "eng": "The intestine affairs of the nation."}, {"viet": "Nhà báo đã khách quan thu thập tin tức.", "eng": "The journalist collected news straight."}, {"viet": "Hang ổ của bọn bắt cóc là một trang trại cũ ở vùng đồi.", "eng": "The kidnappers'lair was an old farm in the hills."}, {"viet": "Ngôn ngữ khoa học, ngôn ngữ của những người dùng ma tuý, của toà án.", "eng": "The language of science, drug users, the courtroom."}, {"viet": "Người lãnh đạo của đảng chiến thắng được mời để thành lập chính phủ.", "eng": "The leader of the winning party has been invited to form a government."}, {"viet": "Xác những con vật đã mổ thịt.", "eng": "The lifeless bodies of the slaughtered animals."}, {"viet": "Sự thù địch lâu đời giữa hai nước.", "eng": "The long-standing animosities between the two countries."}, {"viet": "Tờ tạp chí đã trở thành phương tiện phổ biến những tư tưởng chính trị của người chủ bút.", "eng": "The magazine became a sounding-board for its editor's political beliefs."}, {"viet": "Văn phòng của giám đốc ở ngay bên.", "eng": "The manager's office is just next door."}, {"viet": "Trọng tải tối đa của chiếc xe tải này là một tấn.", "eng": "The maximum load for this lorry is one ton."}, {"viet": "Ký ức về lời xúc phạm vẫn còn gây đau đớn.", "eng": "The memory of that insult still stings."}, {"viet": "Ông bộ trưởng đã được yêu cầu phát biểu ý kiến về pháp chế mới được đề nghị.", "eng": "The minister was asked to pronounce on the proposed new legislation."}, {"viet": "Trăng tỏa sáng qua cửa sổ.", "eng": "The moon is shining through the window."}, {"viet": "Việc dọn nhà mất sáu tiếng với một toán ba người đàn ông.", "eng": "The move took six hours with a team of three men."}, {"viet": "Cái chắn bùn bên trái bị hỏng trong vụ đâm xe.", "eng": "The nearside wing was damaged in the collision."}, {"viet": "Đạo luật mới sẽ có hiệu lực vào tuần tới.", "eng": "The new law comes into force next week."}, {"viet": "Hệ thống mới đó sẽ sớm được đưa vào sử dụng.", "eng": "The new system will soon be put into effect."}, {"viet": "Sáng hôm sau anh ta có cảm giác ngây ngất.", "eng": "The next morning he was suffering from a hangover."}, {"viet": "Số người tập sự đã giảm một cách đáng kể trong những năm gần đây.", "eng": "The number of apprenticeships has declined sharply in recent years."}, {"viet": "Viên sĩ quan ra lệnh binh lính nổ súng vào quân địch.", "eng": "The officer ordered his men to fire at the enemy."}, {"viet": "Ông già bụi đời lê bước mệt mỏi ngược lên con đường.", "eng": "The old tramp shambled wearily up the path."}, {"viet": "Những người tổ chức hi vọng lễ hội năm nay sẽ thu hút kỉ lục người tham dự.", "eng": "The organizers hope that this years festival will attract record crowds."}, {"viet": "Rạp hát Palace quảng cáo một nhà ảo thuật như là vai trội nhất.", "eng": "The Palace Theatre headlines a magician."}, {"viet": "Con đường mòn đó chạy theo con sông rồi băng qua khu rừng.", "eng": "The path follows the river and then goes through the woods."}, {"viet": "Người dân nước Mỹ hàng năm tiêu thụ hơn 55 tỉ cân Anh sữa và các sản phẩm từ sữa.", "eng": "The people of the United States eat or drink more than 55 billion pounds of milk and milk products every year."}, {"viet": "Chiếc dương cầm làm cho căn phòng nổi bật.", "eng": "The piano gives the room a touch of style."}, {"viet": "Vùng đồng bằng Alberta rất là phì nhiêu.", "eng": "The plains of Alberta are extremely fertile."}, {"viet": "Trung đội dời khỏi chỗ nấp và tiến xuống đường.", "eng": "The platoon broke cover and headed down the road."}, {"viet": "Phần nhọn này là cái đầu của người hầu bàn.", "eng": "The pointed part is the footman's head."}, {"viet": "Cảnh sát đã tìm ra manh mối nó sẽ giúp họ bắt được tên cướp.", "eng": "The police have found a clue with will help them to catch the robber."}, {"viet": "Cuộc viếng thăm của cảnh sát đã thực sự làm cho cô ta lo lắng.", "eng": "The policeman's visit really got her rattled."}, {"viet": "Kiểu làm thuôn các đỉnh tòa nhà trái với các nguyên tắc hiện đại.", "eng": "The post-modern mode of tapering the tops of buildings."}, {"viet": "Vệ sĩ của Tổng thống có mang vũ khí.", "eng": "The President's bodyguard is armed."}, {"viet": "Giá cả dao động giữa 5 pao đến 6 pao.", "eng": "The price fluctuates between 5 pounds and 6 pounds."}, {"viet": "Cuộc biểu tình tuyệt thực của các tù nhân ép các nhà đương cục phải hành động.", "eng": "The prisoner's hunger strike pressurized the authorities into action."}, {"viet": "Hình bóng ngọn tháp in trên nền trời.", "eng": "The profile of the tower against the sky."}, {"viet": "Nguyên mẫu cho các công trình kiến trúc trường học tương lai.", "eng": "The prototype for future school buildings."}, {"viet": "Nữ hoàng phong tước công khanh cho anh ta.", "eng": "The Queen conferred the dignity of a peerage on him."}, {"viet": "Mưa đạt trung bình 36 inch một năm.", "eng": "The rainfall averages 36 inches a year."}, {"viet": "Những cuộn phim không được xếp theo đúng thứ tự.", "eng": "The reels of film were not in the proper order."}, {"viet": "Các báo cáo từ Rôm khác với các báo cáo từ Milan.", "eng": "The reports from Rome disagree with those from Milan."}, {"viet": "Một người nhà giàu bị đòi món tiền chuộc cao cho con gái ông ấy.", "eng": "The rich man was asked to pay a high ransom for his daughter."}, {"viet": "Con đường đó chạy song song với đường xe lửa.", "eng": "The road runs parallel to the railway."}, {"viet": "Căn phòng được sơn toàn màu trắng.", "eng": "The room was painted pure white."}, {"viet": "Người thủy thủ đó đã thả sợi dây ra gọn gàng.", "eng": "The sailor ran the line out neatly."}, {"viet": "Kế hoạch bị ngâm luôn sau cuộc thảo luận sơ bộ.", "eng": "The scheme was pigeonholed after a brief discussion."}, {"viet": "Bí mật đã không bao giờ được tiết lộ cho đến sau khi ông cụ chết.", "eng": "The secret was never told until after the old man's death."}, {"viet": "Hiện nay mỗi cổ phần được định giá là 54 xu.", "eng": "The shares are currently being quoted at 54 pence a share."}, {"viet": "Con tàu bị sóng lớn vùi dập.", "eng": "The ship was struck by a heavy sea."}, {"viet": "Nhìn thấy hắn làm tôi ghê tởm.", "eng": "The sight of him is repulsive to me."}, {"viet": "Cái tát nàng giáng cho anh ta làm má anh bị rát.", "eng": "The slap she gave him made his cheek tingle."}, {"viet": "Người lính đó đã bị xử bắn về tội đào ngũ.", "eng": "The soldier was shot for desertion."}, {"viet": "Sự thưa thớt cây cối của phong cảnh đó.", "eng": "The sparseness of tree on the landscape."}, {"viet": "Đèn sân khấu tạo nên ấn tượng về một cảnh sáng trăng.", "eng": "The stage lighting gives the effect of a moonlit scene."}, {"viet": "Cơn bão cản trở chương trình phát thanh.", "eng": "The storm blanketed out the radio program."}, {"viet": "Các sinh viên chống đối chính phủ.", "eng": "The students rebelled against the government."}, {"viet": "Sự đàn áp một cuộc nổi dậy, sự ỉm đi sự thật.", "eng": "The suppression of a revolt, the facts."}, {"viet": "Thầy giáo đọc một đoạn cho lớp viết.", "eng": "The teacher dictated a passage to the class."}, {"viet": "Bức điện tín nhằm thông báo rằng bà ấy sẽ đến chậm.", "eng": "The telegram was to say that she'd be late."}, {"viet": "Tên trộm dùng bạo lực để lấy tiền của ông già.", "eng": "The thief took the money from the old man by force."}, {"viet": "Tước hiệu được chuyển theo quyền thừa kế cho người con trai cả.", "eng": "The title passes by inheritance to the eldest son."}, {"viet": "Xe lửa khởi hành vào lúc 3 giờ chiều.", "eng": "The train leaves at 3 p. m."}, {"viet": "Quân lính đã bị kiệt sức sau những tháng đánh nhau ác liệt.", "eng": "The troops were exhausted after months of fierce combat."}, {"viet": "Hai công thức này chẳng khác gì nhau.", "eng": "The two recipes are very much the same."}, {"viet": "Âm thanh không thể nhầm lẫn được của một đoàn tàu đang tới gần.", "eng": "The unmistakable sound of an approaching train."}, {"viet": "Phong cảnh toà tháp này nhìn từ đây thật tuyệt.", "eng": "The view of the tower from here is quite great."}, {"viet": "Tiếng sóng vỗ mạn thuyền.", "eng": "The wash of the waves against the side of the boat."}, {"viet": "Cờ trắng là tượng trưng cho sự ngừng bắn hoặc đầu hàng.", "eng": "The white flag is a symbol of a truce or surrender."}, {"viet": "Tấm kính che gió bị rạn nhưng không vỡ ra từng mảnh.", "eng": "The windscreen cracked but did not splinter."}, {"viet": "Các công nhân bực bội và thất vọng với đồng lương của mình.", "eng": "The workers are disgruntled with their wages."}, {"viet": "Lũ thanh niên chen lấn một bà già trên vỉa hè.", "eng": "The youths jostled an old lady on the pavement."}, {"viet": "Sự xâm phạm của họ vào đời sống riêng của chúng tôi là không thể biện bạch được.", "eng": "Their intrusion into our private lives is unwarrantable."}, {"viet": "Vậy thì tôi rất mong lúc nào đó ông sẽ ghé lại chơi.", "eng": "Then, I do hope you'll call in again sometime."}, {"viet": "Ở ngoài kia có một cậu bé, cậu ta chính là người chạy từ trong nhà băng ra đường.", "eng": "There's a boy outside-it's the boy from the house across the road."}, {"viet": "Đã có một tình trạng nhầm lẫn ghê gớm về ngày tháng!", "eng": "There's been an awful mix-up over the dates!"}, {"viet": "Trong hầm rượu còn chỗ để chứa đồ đạc không dùng đến và mọi thứ khác nữa.", "eng": "There's room in the cellar to store unused furniture and what have you."}, {"viet": "Chúng có rất nhiều loại khác nhau.", "eng": "There are many different kinds."}, {"viet": "Trong tất cả các văn phòng đều có máy điện thoại nhánh.", "eng": "There are telephone extensions in every office."}, {"viet": "Vừa rồi ở đây đã xảy ra những sự kiện lạ lùng.", "eng": "There have been strange happenings here lately."}, {"viet": "Luôn luôn có một quản đốc ngay trong khu vực.", "eng": "There is always a manager on the premises."}, {"viet": "Bộ điều chỉnh nhiệt độ bị trục trặc.", "eng": "There is something wrong with the temperature control panel."}, {"viet": "Có tiếng tặc lưỡi to khi cô ấy cầm tấm ảnh lên.", "eng": "There was a loud click as she took the photograph."}, {"viet": "Chỉ còn có chỗ đứng trong phòng hoà nhạc.", "eng": "There was standing-room only left in the concert hall."}, {"viet": "Sẽ có năm người chúng tôi cùng ăn bữa tối, ngoài John.", "eng": "There will be five of us for dinner, besides John."}, {"viet": "Những hoa này chỉ thấy có ở châu Phi.", "eng": "These flowers are found only in Africa."}, {"viet": "Đôi giày này không vừa-ông không còn đôi nào khác ư?", "eng": "These shoes don't fit-haven't you got any others?"}, {"viet": "Năm nay họ phân tôi dạy lớp bắt đầu.", "eng": "They've allocated me the beginners'class to teach this year."}, {"viet": "Họ đang cố gắng ( trèo lên ) phần dốc nhất của ngọn núi.", "eng": "They are attempting ( to climb ) the steepest part of the mountain."}, {"viet": "Họ bắt đầu công việc mới của họ với sự hứng khởi.", "eng": "They began their new assignments with relish."}, {"viet": "Chúng có thể bảo vệ chủ của chúng và của cải của họ.", "eng": "They could guard their masters and their masters'property."}, {"viet": "Chúng lọt vào trong toà nhà cải trang thành những người quét dọn.", "eng": "They entered the building disguised as cleaners."}, {"viet": "Họ phải xin của bố thí ( của những người khác ) để nuôi lũ con.", "eng": "They had to beg alms ( of others ) in order to feed their children."}, {"viet": "Họ đã đuổi hắn ( ra khỏi câu lạc bộ ) vì đánh nhau.", "eng": "They kicked him out ( of the club ) for fighting."}, {"viet": "Họ gặp nhau trong kỳ nghỉ và chẳng bao lâu đã trở thành tình nhân.", "eng": "They met on holiday and soon became lovers."}, {"viet": "Họ có ý định cố gắng thêm một lần nữa.", "eng": "They purpose to make a further attempt."}, {"viet": "Họ đưa nó vào trại cải huấn.", "eng": "They sent him to a house of correction."}, {"viet": "Họ cố gắng làm anh ta tin chắc rằng họ mong muốn làm việc.", "eng": "They tried to assure him of their willingness to work."}, {"viet": "Họ nói liến thoắng không ngừng.", "eng": "They were chatting away nineteen to the dozen."}, {"viet": "Họ làm quan với phương pháp canh tác hiện đại.", "eng": "They were well acquainted with modern farming methods."}, {"viet": "Khu vực này đã được san phẳng để dọn chỗ cho một con đường mòn.", "eng": "This area was bulldozed to make way for a new road."}, {"viet": "Điều này là một sự đe doạ nền an ninh quốc gia.", "eng": "This constitutes a threat to national security."}, {"viet": "Bộ phim này vi phạm tất cả các tiêu chuẩn về thẩm mỹ lành mạnh.", "eng": "This film offends against all the canons of good taste."}, {"viet": "Đây là phần dẫn động, đây là phần số không, còn đây là phần cho chạy lùi.", "eng": "This is drive, this is neutral, this is reverse."}, {"viet": "Lịch trình của chuyến đi này cho chúng ta quyền được thay đổi nhiều.", "eng": "This itinerary leaves us plenty of leeway."}, {"viet": "Tờ báo này đã giữ được sự cân đối trong cách trình bày các dư luận khác nhau.", "eng": "This newspaper maintains a good balance in its presentation of different opinions."}, {"viet": "Cuộc bãi công này của ngành đường sắt thật có phần hơi phiền hà.", "eng": "This rail strike is a bit of a nuisance."}, {"viet": "Bộ đồ này chứng tỏ tay nghề cao.", "eng": "This suit of furniture shows good workmanship."}, {"viet": "Năm nay công ty đã tập trung nâng cao tính hiệu quả của nó.", "eng": "This year the company has concentrated on improving its efficiency."}, {"viet": "Nói về niên đại của một sự việc xảy ra, chúng ta cho con số của năm.", "eng": "To tell the date of a happening, we give the number of the year."}, {"viet": "Giao thông đã giảm nhiều từ khi mở một con đường ngang.", "eng": "Traffic has dropped off since the by-pass opened."}, {"viet": "Nhiều nhân tố đã dẫn đến sự sụp đổ của ông ta.", "eng": "Various factors contributed to his downfall."}, {"viet": "Nước tù đọng trong ao và hào.", "eng": "Water lying stagnant in ponds and ditches."}, {"viet": "Chúng tôi sẽ mang chúng lên phòng của ông ngay.", "eng": "We'll send them up to your room at once."}, {"viet": "Lúc này chúng ta ở vào một vị thế thương lượng khá yếu.", "eng": "We're now in a rather poor bargaining position."}, {"viet": "Chúng tôi phải trông nom con chó của nhà hàng xóm khi họ đi vắng.", "eng": "We've got the neighbours'dog while they're away."}, {"viet": "Chúng tôi đã biết ai được nhận công việc này nhưng chúng tôi chưa được thông báo chính thức.", "eng": "We already know who's got the job but we haven't yet been informed officially."}, {"viet": "Chúng tôi nhận biết được điều danh dự anh mang lại cho chúng tôi.", "eng": "We are sensible of honour you have done us."}, {"viet": "Chúng ta không thể chữa được lành bệnh đó, nó phải phát triển và chấm dứt theo tự nhiên.", "eng": "We can't cure the disease, it must run its course."}, {"viet": "Chúng tôi đáp chuyến bay thẳng từ London tới Singapore.", "eng": "We caught a non-stop flight from London to Singapore."}, {"viet": "Chúng tôi không tin lời giải thích của anh.", "eng": "We do not accept your explanation."}, {"viet": "Chúng tôi thấy khó chọn một tấm thảm: chúng giống nhau quá.", "eng": "We found it hard to choose a carpet: they were all much of a muchness."}, {"viet": "Chúng tôi đã phải gọi thợ hàn chì đến làm thông các đường ống.", "eng": "We had to call a plumber to unblock the drains."}, {"viet": "Về bộ binh và xe bọc thép, chúng tôi ít hơn quân địch.", "eng": "We have less infantry and armour than the enemy."}, {"viet": "Chúng tôi hy vọng sẽ chuyển về ở nông thôn trong tương lai gần đây.", "eng": "We hope to move to the country in the near future."}, {"viet": "Chúng ta có đi tham quan nhà thờ chiều nay không?", "eng": "We look round the cathedral this afternoon?"}, {"viet": "Chúng ta cần phải gia tăng sản lượng để đáp ứng yêu cầu.", "eng": "We must increase our output to meet demand."}, {"viet": "Chúng tôi có dịch vụ hậu mãi tuyệt hảo.", "eng": "We offer an excellent after-sales service."}, {"viet": "Chúng tôi thoả thích thưởng thức món trứng cá với rượu sămpa.", "eng": "We regaled ourselves on caviar and champagne."}, {"viet": "Chúng ta phải đoàn kết để chống sự nghèo đói, bệnh tật.", "eng": "We should unite to fight poverty and disease."}, {"viet": "Chúng tôi dùng tiền để lập một đề án thuỷ lợi.", "eng": "We used the money to set up an irrigation project."}, {"viet": "Chúng tôi hết sức ngạc nhiên trước sự thô lỗ của cô ta.", "eng": "We were completely dumbfounded by her rudeness."}, {"viet": "Chúng tôi định giá tiền thuê nhà là 100 pao một tuần.", "eng": "We will fix the rent at 100 pounds a week."}, {"viet": "À, cô có nghĩ là tôi có thể để lại lời nhắn cho ông ấy không?", "eng": "Well, do you think I could leave a message for him?"}, {"viet": "À, vé xe buýt rẻ hơn nhưng ông phải mua các bữa ăn khi đi đường.", "eng": "Well, the bus fare is cheaper but you have to buy meals while you are traveling."}, {"viet": "Ngày đáo hạn của giấy chứng nhận có tiền gửi là bao giờ?", "eng": "What's the maturity date of this certificate of deposit?"}, {"viet": "Tên của những tờ báo được yêu thích nhất ở đất nước bạn là gì?", "eng": "What are the names of the most popular newspapers in your country?"}, {"viet": "Bạn nghĩ gì khi bạn bị chứng mất ngủ?", "eng": "What do you do when you suffer from insomnia?"}, {"viet": "Những điều tôi đã nói chỉ có hiệu lực đối với một số trong các anh.", "eng": "What I have said applies only to some of you."}, {"viet": "Tỉ giá hối đoái giữa đồng đô-la và đồng pao là bao nhiêu?", "eng": "What is the rate of exchange between the dollar and the pound?"}, {"viet": "Bọn trẻ con đang âm mưu trò ma quái gì đây?", "eng": "What mischief are those children hatching?"}, {"viet": "Họ đã bắt đầu cuộc họp lúc mấy giờ?", "eng": "What time did they start the meeting?"}, {"viet": "Khi ranh giới giữa các nước không được vạch rõ, thường xảy ra rắc rối.", "eng": "When boundaries between countries are not clearly defined, there is usually trouble."}, {"viet": "Khi phát hiện ra là mình đến chỗ hẹn nhầm ngày, tôi rất là bực mình.", "eng": "When I discovered I'd come for the appointment on the wrong day, I could have kicked myself."}, {"viet": "Khi Star chết đi, tôi đã mất tình bầu bạn.", "eng": "When Star died, it was the companionship I missed."}, {"viet": "Khi ở nông thôn, chúng tôi phải mua nhiều vật ở xa.", "eng": "When we lived in the country, we had to send away for many things."}, {"viet": "Bạn đã mua cái áo đầm đó ở đâu?", "eng": "Where did you get that dress?"}, {"viet": "Bạn thích xem cái nào hơn, hài kịch hay phim hồi hộp?", "eng": "Which do you prefer, comedies or suspense movies?"}, {"viet": "Cá dưới biển sâu có con thật xấu xí, nhưng cũng có con thật đẹp.", "eng": "While many of the deep-sea fishes are ugly, others are beautiful."}, {"viet": "Ai bôi những vết bẩn này trên quyển sách mới của tôi thế?", "eng": "Who made these dirty marks on my new book?"}, {"viet": "Sao anh không đến ở với chúng tôi lần tới khi anh đến thăm Durham?", "eng": "Why don't you come to stay with us next time you visit Durham?"}, {"viet": "Liệu màu có phải khi giặt vải không?", "eng": "Will the colour come out if the material is washed?"}, {"viet": "Anh nói với nó hay anh muốn tôi làm điều đó hơn?", "eng": "Will you tell him, or would you sooner I did?"}, {"viet": "Chỉ một tuần trước ngày bầu cử, mọi thứ đang thực sự trở nên sôi động hơn.", "eng": "With only a week to go before the election things are really hotting up."}, {"viet": "Tôi rất không muốn nhật ký của tôi rơi vào tay những người không tốt.", "eng": "Would hate my diary to get into the wrong hands."}, {"viet": "Ông có muốn dùng một ít cơm kèm với chúng không?", "eng": "Would you like to have some rice to go with them?"}, {"viet": "Ông vui lòng chỉ Viện bảo tàng Thành phố khi chúng ta đi qua nó nhé?", "eng": "Would you point out the Metropolitan Museum as we pass it?"}, {"viet": "Vâng, Tôi định đem túi nhỏ này theo người.", "eng": "Yes, I'm keeping this small bag with me."}, {"viet": "Vâng, anh thấy đấy, lớp vải lót của cái áo vét của tôi đã bị sứt đường chỉ khâu.", "eng": "Yes, you see, the lining of my jacket has come stitched."}, {"viet": "Nếu em muốn đậu, em phải học thật chăm chỉ.", "eng": "You'll have to work hard if you want to pass."}, {"viet": "Anh thấy gì khi anh đang xem nó.", "eng": "You're unhappy while you're watching it."}, {"viet": "Bạn rụt rè quá: bạn nên tự tin hơn.", "eng": "You are too shy: you should have more confidence in yourself."}, {"viet": "Anh có thể điều chỉnh màu của vô tuyến bằng cách xoay cái nút.", "eng": "You can adjust the colour on the TV by turning this knob."}, {"viet": "Anh có thể dừng máy lại bằng cách bấm cái nút đỏ.", "eng": "You can stop the machine by pushing the red button."}, {"viet": "Nếu tôi hút thuốc thì bạn không phiền chứ?", "eng": "You don't mind if I have one?"}, {"viet": "Anh phải tưới nó cứ 2 ngày một lần.", "eng": "You have to water it once every two days."}, {"viet": "Cô có thể nghĩ như thế còn thiếu nữ Nhật Bản thì không.", "eng": "You may think so, but Japanese girls don't."}, {"viet": "Anh phải cân nhắc cái giá lúc đầu của một chiếc xe mới với số tiền tiết kiệm được về việc sửa chữa.", "eng": "You must set the initial cost of a new car against the saving you'll make on repairs."}, {"viet": "Anh nói là John lấy sách của anh, nhưng anh có bằng chứng gì không?", "eng": "You say that John took your book, but have you any evidence of that?"}, {"viet": "Ông nên viết rõ dấu chấm thập phân.", "eng": "You should write the decimal point clearly."}, {"viet": "Cậu sẽ bị nghiêm trị nếu cậu không tuân lời.", "eng": "You will be severely punished if you do not obey."}, {"viet": "Anh của con cần yên tĩnh vì anh ấy đang làm việc.", "eng": "Your brother needs peace and quiet because he's working."}, {"viet": "Các câu hỏi của anh sẽ được trả lời trên bục giảng.", "eng": "Your questions will be answered from the platform."}]