[{"viet": "Những cổ phần 2 bảng Anh bây giờ đáng giá 2.75 bảng.", "eng": "£ 2 shares are now worth £ 2.75."}, {"viet": "Một ông chủ đòi hỏi quá nhiều sự kiên nhẫn của mọi người.", "eng": "A boss who taxed everyone's patience."}, {"viet": "Một buổi lễ ở nhà thờ để cầu nguyện cho những người đã chết trong chiến tranh.", "eng": "A church service to remember the war dead."}, {"viet": "Bản quyền có chức năng bảo vệ tác giả và nhà xuất bản của một quyển sách.", "eng": "A copyright protects the author and the publisher of a book."}, {"viet": "Một nỗ lực chủ ý cản trở cuộc tranh luận.", "eng": "A deliberate attempt to stonewall the debate."}, {"viet": "Một hồi trống dồn dập báo hiệu phần nguy hiểm nhất của buổi biểu diễn.", "eng": "A drum roll preceded the most dangerous part of the performance."}, {"viet": "Một cú phát bóng đẹp của hậu vệ.", "eng": "A fine clearance by the full-back."}, {"viet": "Một hộp bột giặt cỡ lớn.", "eng": "A giant-sized packet of detergent."}, {"viet": "Một khuynh hướng ngày càng tăng nghiêng về những gia đình có ít con hơn.", "eng": "A growing trend towards smaller families."}, {"viet": "Một mái ấm cho những trẻ không nhà và trẻ lang thang.", "eng": "A home for waifs and strays."}, {"viet": "Một vũng nước cà phê đổ ra trên bàn giấy của tôi.", "eng": "A lake of spilled coffee on my desk."}, {"viet": "Một tuyến pháo đài được xây dựng dọc theo biên giới để bảo vệ đất nước chống lại các cuộc tấn công.", "eng": "A line of forts was built along the border to protect the country against attack."}, {"viet": "Một trở ngại chính trong một cuộc đàm phán về vũ khí.", "eng": "A major sticking-point in the arms talks."}, {"viet": "Một chỗ sai trên bản đồ đã khiến khách du lịch bị lầm lẫn.", "eng": "A mistake in the map led the traveler into error."}, {"viet": "Có một đôi giày mới bây giờ là đúng lúc.", "eng": "A new pair of shoes wouldn't come amiss."}, {"viet": "Một đoạn văn không có một chữ thừa.", "eng": "A paragraph without a redundant word."}, {"viet": "Một phụ nữ lố lăng với chiếc nón và bộ đồ làm việc áo liền quần hoa hoét của cô ấy.", "eng": "A picturesque figure in her flowery hat and dungarees."}, {"viet": "Một tập tục đã tồn tại không thay đổi trong nhiều thế kỷ.", "eng": "A practice that remained unaltered for centuries."}, {"viet": "Một bài giải thích cấp tiến theo một cách mới về Hamlet của Xếchpia.", "eng": "A radical interpretation of Shakespeare's Hamlet."}, {"viet": "Một con sông có nhiều đá dưới đáy.", "eng": "A river with a stony bottom."}, {"viet": "Một người tự nguyện làm người coi sóc đạo đức xã hội.", "eng": "A self-appointed custodian of public morals."}, {"viet": "Một hớp rượu mạnh đã giúp ông ấy hồi tỉnh lại.", "eng": "A sip of brandy helped to pull him round."}, {"viet": "Một đợt tràn ngập xe ôtô mới trên thị trường.", "eng": "A spate of new cars on the market."}, {"viet": "Một trận cuồng phong nổi lên đã thổi dạt con thuyền của chúng tôi va vào các tảng đá.", "eng": "A strong wind arose and flew our boat on to the rocks."}, {"viet": "Một từ ngữ hàm ý là người ta bất đồng về một điều gì đó.", "eng": "A term connoting that one disapproves of something."}, {"viet": "Một sự áp bức của bạo chúa đối với thần dân của ông ta.", "eng": "A tyrant's oppression of his people."}, {"viet": "Một cuộc tranh cãi sôi nổi về một dự luật thuế mới.", "eng": "A whoop-de-do over the new tax bill."}, {"viet": "Các điều tra viên về tai nạn tìm ra được những nguyên nhân về các vụ rớt phi cơ.", "eng": "Accident investigators who find out the causes of air crashes."}, {"viet": "Ngắm những bức tranh tô điểm cho các bức tường.", "eng": "Admire the paintings that adorn the walls."}, {"viet": "Anh ấy trở về sau năm năm đi đây đó.", "eng": "After five years, he returned from his wanderings."}, {"viet": "Sau mười năm chung sống, họ đã ly dị.", "eng": "After ten years of marriage, they are divorcing."}, {"viet": "Mười ngày huấn luyện đang ở trước mặt chúng ta.", "eng": "Ahead of us lay ten days of intensive training."}, {"viet": "Mọi sự chống đối lại kế hoạch đó đã sụp đổ.", "eng": "All opposition to the scheme has caved in."}, {"viet": "Kem đánh răng đã chảy ri rỉ ra hết rồi.", "eng": "All the toothpaste had oozed out."}, {"viet": "Am, is, are, was và were là các dạng có ngôi của be, being và been là các dạng không ngôi.", "eng": "Am, is, are, was and were are the finite forms of be, being and been are the non-finite forms."}, {"viet": "Một đống áo và bít tất hổ lốn.", "eng": "An amorphous collection of jumpers and socks."}, {"viet": "Con cọp sổng chuồng đang đi lang thang thoải mái trong thành phố.", "eng": "An escaped tiger is roaming free in the town."}, {"viet": "Một buổi trình diễn giao hưởng tẻ nhạt.", "eng": "An insipid performance of the symphony."}, {"viet": "Một biểu lộ tự tin bên ngoài che dấu sự lo lắng của ông ta.", "eng": "An outward show of confidence concealed his nervousness."}, {"viet": "Và tệ hơn nữa anh ấy nói tiếp.", "eng": "And what's more he continued."}, {"viet": "Mọi tàu lửa từ sân ga này đều dừng lại ở Gatwick.", "eng": "Any train from this platform stops at Gatwick."}, {"viet": "Buổi trình diễn tối nay có vé nào không bán được không?", "eng": "Are there any cancellation for this evening's performance?"}, {"viet": "Anh có cho họ biết các kế hoạch đó không?", "eng": "Are you going to let them in on the plans?"}, {"viet": "Lý lẽ dựa trên một nền tảng vững chắc.", "eng": "Arguments that have a firm basis."}, {"viet": "Khi ông ta càng về già, ông ta mất hứng thú trong mọi việc ngoại trừ việc làm vườn.", "eng": "As he grew older he lost interest in everything except gardening."}, {"viet": "Cảm thấy xấu hổ về thái độ của cô ta tại buổi tiệc.", "eng": "Ashamed of her behaviour at the party."}, {"viet": "Tới điểm đó ông chủ tịch góp ý kiến quan trọng bảo vệ mạnh mẽ đường lối của công ty.", "eng": "At that point, the chairman weighed in with a strong defence of company policy."}, {"viet": "Tránh nhìn ánh sáng chói của đèn pha xe ô tô.", "eng": "Avoid the glare of car headlights."}, {"viet": "Cẩn thận với cái xoong đó-cán nó bị lỏng đấy.", "eng": "Be careful with that saucepan-the handle's loose."}, {"viet": "Thẳng thắn về đời sống riêng tư của ai.", "eng": "Be upfront about one's private life."}, {"viet": "Các tín ngưỡng đã trở nên cứng nhắc thành giáo điều khắt khe.", "eng": "Beliefs have ossified into rigid dogma."}, {"viet": "Máu tuôn ra từ vết thương.", "eng": "Blood was pouring from the wound."}, {"viet": "Anh chiếm làm thuộc địa nhiều vùng ở châu Phi.", "eng": "Britain colonized many parts of Africa."}, {"viet": "Nhưng ngày mai tôi sẽ đổi hẳn.", "eng": "But from tomorrow I'm going to change completely."}, {"viet": "Nhưng tiền lãi sẽ được trả theo lãi suất trên tiền gửi không kỳ hạn quyết định vào ngày rút tiền.", "eng": "But the interest shall be paid at the rate on a current deposit ruling on the date of withdrawal."}, {"viet": "Nhờ vào việc khéo đầu tư, bà ấy đã tích luỹ được một tài sản lớn.", "eng": "By investing wisely she accumulated a fortune."}, {"viet": "Điều gì có thể thay thế được tình mẫu tử?", "eng": "Can anything replace a mother's love?"}, {"viet": "Tổn thương cho mối bang giao quốc tế đó có thể được cứu vãn được không?", "eng": "Can the damage done to international relations be repaired?"}, {"viet": "Bạn có thể nuôi thú cưng trong một căn hộ ở khu vực Luân Đôn không?", "eng": "Can you have a pet in an apartment in the London area?"}, {"viet": "Cô có thể nói khi nào chúng ta đến đó chứ?", "eng": "Can you tell me when we'll get there?"}, {"viet": "Mèo và chó có đặc tính hoàn toàn khác nhau-chó thích gần người, mèo thì muốn sống một mình.", "eng": "Cats and dogs have quite different natures-dogs like company, cats are independent."}, {"viet": "Những đứa trẻ chơi đùa khắp bãi cát.", "eng": "Children playing around on the sand."}, {"viet": "Việc kiểm tra kỹ lưỡng cho thấy rõ những vết nứt trên công trình bằng đá.", "eng": "Close inspection shows up the cracks in the stonework."}, {"viet": "Các định kiến chung về cuộc sống của dân Hippy đang ngày càng được xét lại.", "eng": "Common preconceptions about life of Hippy are increasingly being challenged."}, {"viet": "Những người bảo thủ bảo vệ hiện trạng.", "eng": "Conservatives who defend the status quo."}, {"viet": "Anh có thể lái xe đưa tôi đến nhà ga được không?", "eng": "Could you drive me to the station?"}, {"viet": "Luật sư bên bị cáo lập luận rằng thân chủ của mình rõ ràng vô tội.", "eng": "Counsel for the defense submitted that his client was clearly innocent."}, {"viet": "Bố ơi, báo cáo thẻ tín dụng của bố đã đến.", "eng": "Dad, your credit card statement has arrived."}, {"viet": "Nhu cầu giảm vào mấy tháng hè.", "eng": "Demand is slack over the summer months."}, {"viet": "Hiến mình cho những mục tiêu xứng đáng.", "eng": "Devote oneself to worth-while pursuits."}, {"viet": "Bạn có xem các bộ phim nào khác không?", "eng": "Did you see any other films?"}, {"viet": "Những sự chia rẽ trong nước sẽ chuốc lấy những mối nguy hiểm từ nước ngoài.", "eng": "Divisions at home would invite dangers from abroad."}, {"viet": "Tất cả chúng ta có đồng ý rằng đó là một đề nghị tuyệt vời không?", "eng": "Do we all agree that the proposal is a good one?"}, {"viet": "Ở đây khách sạn có phòng khám chữa bệnh không?", "eng": "Do you have a clinic here?"}, {"viet": "Ông có biết về kế hoạch ở Zurich không?", "eng": "Do you know about the project in Zurich?"}, {"viet": "Bạn có ngại làm việc vào chủ nhật không?", "eng": "Do you mind working on Sundays?"}, {"viet": "Bạn có nghĩ John cùng kiểu người với tôi không?", "eng": "Do you think that John is my type?"}, {"viet": "Anh ấy biểu diễn các trò ảo thuật để kiếm sống phải không?", "eng": "Does he perform magic tricks for a living?"}, {"viet": "Đừng có hung hăng quá đáng như vậy.", "eng": "Don't be all-fired aggressive."}, {"viet": "Đừng quên xếp bàn chải đánh răng vào nhé!", "eng": "Don't forget to pack your toothbrush!"}, {"viet": "Đừng chõ mũi vào công việc của người khác.", "eng": "Don't nose into other people's affairs."}, {"viet": "Đừng có cố đùn trách nhiệm của anh sang tôi!", "eng": "Don't try and land me with your responsibilities!"}, {"viet": "Vạch ra các đường lối chỉ đạo về các chính sách giá cả và thu nhập.", "eng": "Drawing up guide-lines on prices and incomes."}, {"viet": "Mỗi người chúng tôi đều có một chiếc xe của công ty.", "eng": "Each of us has a company car."}, {"viet": "Cuộc tấn công của đội Anh yếu đi vì thương tích của một số cầu thủ chủ chốt.", "eng": "England's attack has been weakened by the injury of certain key players."}, {"viet": "Những sự kiện sẽ xảy ra mãi tận sau này.", "eng": "Events that will happen far in the future."}, {"viet": "Xin lỗi, nhưng tôi không thể rút tiền ở máy rút tiền tự động này khi tôi đạt thẻ vào đó.", "eng": "Excuse me, but I can't draw money out of this ATM when I stuck my card into it."}, {"viet": "Tâng bốc đến tận mây xanh đức hạnh của ai.", "eng": "Extol somebody's virtues to the skies."}, {"viet": "Các ngân khoản của liên bang được chuyển qua việc huấn nghệ cho thanh niên.", "eng": "Federal monies retargeted for youth job training."}, {"viet": "Mò mẫm tìm hiểu mớ luật lệ và qui định rắc rối.", "eng": "Finding one's way through the maze of rules and regulations."}, {"viet": "Flock và committee là hai danh từ tập hợp.", "eng": "Flock and committee are collective nouns."}, {"viet": "Cần bán cửa hiệu có hai mặt tiền.", "eng": "For sale, shop premises with frontages on two streets."}, {"viet": "Sơn còn ướt-xin đừng đụng vào.", "eng": "Fresh paint-please do not touch."}, {"viet": "Tướng Smith đang chỉ huy đội quân.", "eng": "General Smith is in command of the army."}, {"viet": "Đưa ra một bản phác thảo về kế hoạch của mình.", "eng": "Give a sketch of one's plans."}, {"viet": "Đi thay quần áo ướt và mặc cái gì đó khô vào.", "eng": "Go and change out of those damp clothes into something dry."}, {"viet": "Các nhân viên chính phủ thường bị các cơ quan an ninh kiểm tra.", "eng": "Government employees are often screened by the security services."}, {"viet": "Môn bay lượn không làm cô ấy sợ hãi.", "eng": "Hang-gliding holds no fears for her."}, {"viet": "Chúng tôi có phải tự đến dự hội nghị không?", "eng": "Have we to make our own way to the conference?"}, {"viet": "Anh đã đóng chặt hết các cửa sổ và các cửa ra vào lại chưa?", "eng": "Have you fastened all the doors and windows?"}, {"viet": "Mẹ không thấy nó được quảng cáo mỗi tối trên báo đó ư?", "eng": "Haven't you notice it's advertised every night in the paper?"}, {"viet": "Anh ấy là một người ăn chay tuyệt đối, ngay cả pho mát cũng không ăn.", "eng": "He's a strict vegetarian-he doesn't even eat cheese."}, {"viet": "Anh ta thật vô lý-anh ta vừa muốn nhiều tiền, lại muốn có nhiều thời gian rỗi.", "eng": "He's being quiet unreasonable-he wants more money and more free time."}, {"viet": "Anh ta chỉ là một anh chàng lang bạt-không ở yên được một nơi nào.", "eng": "He's just a drifter-he can't settle down anywhere."}, {"viet": "Anh ấy vừa đi ra khỏi văn phòng được một lát rồi.", "eng": "He's stepped out of the office for a little while."}, {"viet": "Ông ta xác nhận là ông ta chịu trách nhiệm.", "eng": "He affirmed that he was responsible."}, {"viet": "Anh ta hạ những tay đua khác bằng một khoảng cách 10 giây.", "eng": "He beat the other runners by a margin of ten seconds."}, {"viet": "Anh ta được giải nhất trong cuộc thi thơ ca.", "eng": "He came first in the poetry competition."}, {"viet": "Nó đi khỏi trước khi cảnh sát tới.", "eng": "He cleared out before the police arrived."}, {"viet": "Anh ấy tâng tâng đứa bé trên đầu gối.", "eng": "He danced the baby on his knee."}, {"viet": "Ông ta gạt bỏ lời giải thích chính thức, coi như một chuyện hoàn toàn vô lý.", "eng": "He dismissed the official explanation as complete poppycock."}, {"viet": "Hắn dụ dỗ cô bé bỏ nhà ra đi.", "eng": "He enticed the young girl away from home."}, {"viet": "Cuối cùng tự anh ta đã xoay xở thoát ra khỏi vòng tay ôm âu yếm của cô nàng.", "eng": "He finally managed to disengage himself from her embrace."}, {"viet": "Anh ấy cho bạn bè tất cả những thứ mà anh ấy đã khước từ đối với gia đình.", "eng": "He gave to his friends what he denied to his family."}, {"viet": "Gương mặt anh ấy có vẻ lãnh đạm.", "eng": "He had a passive expression on his face."}, {"viet": "Nó không tin cậy những người lạ.", "eng": "He has a distrust of strangers."}, {"viet": "Hắn mất quyền đại diện cho công chúng.", "eng": "He has forfeited the right to represent the people."}, {"viet": "Anh ấy mong muốn chị được hạnh phúc.", "eng": "He has your welfare at heart."}, {"viet": "Ông ta được thán phục vì văn phong tao nhã của mình.", "eng": "He is admired for the elegance of his writing."}, {"viet": "Anh ta là con người không có cá tính đặc biệt.", "eng": "He is rather a neutral character."}, {"viet": "Ông ta viết nhật kí về cuộc hành trình qua châu Á.", "eng": "He kept a journal of his wanderings across Asia."}, {"viet": "Anh ta nghe nhạc như là một lối tạm lãng quên công việc căng thẳng.", "eng": "He listens to music as an escape from the pressures of work."}, {"viet": "Anh ta tỏ một cử chỉ lỗ mãng để đáp lại.", "eng": "He made a rude sign by way of retort."}, {"viet": "Anh ta phải cương quyết đương đầu với thực tế bị thất nghiệp.", "eng": "He must square up to the reality of being out of work."}, {"viet": "Ông ấy vẽ những cảnh hồi tuổi trẻ của mình.", "eng": "He painted scenes from his youth."}, {"viet": "Ông ấy đã chần chừ cho đến khi quá muộn không còn làm được gì cả.", "eng": "He procrastinated until it was too late to do anything at all."}, {"viet": "Hắn chạy như điên để đuổi kịp chiếc xe buýt.", "eng": "He ran like fury to catch the bus."}, {"viet": "Nó trả lời với một vẻ giễu cợt trong giọng nói.", "eng": "He replied with a note of mockery in his voice."}, {"viet": "Anh ta là một cây hài trên TV được nhiều người ưa thích.", "eng": "He's a popular television entertainer."}, {"viet": "Anh ta giao phó bọn trẻ cho tôi chăm sóc ban ngày.", "eng": "He's entrusted his children to my care for the day."}, {"viet": "So với một người mới học thì hắn không kém.", "eng": "He's not bad for a beginner."}, {"viet": "Ông ấy rất gầy, nhưng không quá gầy.", "eng": "He's very thin, but not too thin."}, {"viet": "Ông ta nghiên cứu kỹ lưỡng bối cảnh rộng lớn về mối quan hệ Ixraen-Ả Rập.", "eng": "He scopes the big picture of Israeli-Arab relations."}, {"viet": "Nó to mồm chửi tục người đàn bà đó.", "eng": "He shouted obscenities at the woman."}, {"viet": "Ta phung phí tất cả thời gian vào trò ô chữ và những việc vớ vẩn khác.", "eng": "He spends all his time on crosswords and other trifles."}, {"viet": "Hắn ăn cắp tiền nhưng có những hoàn cảnh khinh giảm.", "eng": "He stole the money, but there were extenuating circumstances."}, {"viet": "Ông ta xoay người lại trên ghế để đối diện với chúng tôi.", "eng": "He swivelled in his chair to face us."}, {"viet": "Hắn nói cho họ biết về công việc hắn vừa mới thôi, loại thông tin như thế chính là cái họ cần.", "eng": "He told them about the job he had left, such information was just what they needed."}, {"viet": "Anh ấy dùng nĩa cố moi thịt ra khỏi hộp.", "eng": "He tried to hick the meat out of the tin with a fork."}, {"viet": "Anh ta thường mang một bình nước sôi tới văn phòng.", "eng": "He usually carries a carafe of boiled water to office."}, {"viet": "Ông ấy được cử làm đại diện với vua Tây Ban Nha.", "eng": "He was accredited to the Spanish king."}, {"viet": "Anh ta được đưa ra tòa xử và xét thấy có tội.", "eng": "He was brought before the court and found guilty."}, {"viet": "Anh ta bị người trợ lý đầy tham vọng đẩy dần dần khỏi công việc.", "eng": "He was edged out of his job by his ambitious assistant."}, {"viet": "Ông ấy ở vào hoàn cảnh không ai ham là phải chọn lựa giữa việc nằm tù hoặc phải chịu đi đày.", "eng": "He was in the unenviable position of having to choose between imprisonment or exile."}, {"viet": "Năm ngoái ông ấy đã được phong làm linh mục.", "eng": "He was ordained priest last year."}, {"viet": "Ông ta giận dữ đến nỗi quất túi bụi con ngựa gần chết.", "eng": "He was so angry that he nearly flayed his horse alive."}, {"viet": "Do hoàn cảnh không biết trước, anh ấy không thể đi chuyến đó.", "eng": "He was unable to go on the trip, due to unforeseen circumstance."}, {"viet": "Anh ta đến để than phiền với bà chủ, nhưng đã bị đối xử rất cộc cằn.", "eng": "He went to complain to the boss, but got very short shrift."}, {"viet": "Anh ấy đã làm việc để được miễn phí chuyến đi Niu Yóoc.", "eng": "He worked his passage to New York."}, {"viet": "Số thương vong nặng nề trong trận đánh đã được báo cáo.", "eng": "Heavy casualties were reported in the fighting."}, {"viet": "Những cố gắng của nàng nhằm làm họ nguôi giận chỉ làm cho họ giận thêm.", "eng": "Her attempts to calm them down only made matters worse."}, {"viet": "Sự đóng góp của cô ta trong việc nghiên cứu đó phần lớn chưa được trân trọng.", "eng": "Her contribution to the research went largely unacknowledged."}, {"viet": "Gương mặt cô ấy đầm đìa nước mắt.", "eng": "Her face was bathed in tears."}, {"viet": "Sức khoẻ cô ta hồi phục rất nhanh.", "eng": "Her health is improving by leaps and bounds."}, {"viet": "Bài thuyết trình của bà ta bao quát tất cả các diễn biến mới nhất về vấn đề này.", "eng": "Her lecture took in all the recent developments in the subject."}, {"viet": "Những cuốn tiểu thuyết của bà ta được viết rất hay và cũng bán rất chạy.", "eng": "Her novels are well written and commercial as well."}, {"viet": "Việc bà ta từ chối giúp đỡ đã làm đảo lộn hết kế hoạch.", "eng": "Her refusal to help quite upset the applecart."}, {"viet": "Những phẩm chất tuyệt vời của cô ấy trong vai trò một nhà tổ chức.", "eng": "Her sterling qualities as an organizer."}, {"viet": "Nhiệt tình với cuộc sống của cô ta vẫn cứ mãnh liệt như bao giờ.", "eng": "Her zest for life is as great as ever."}, {"viet": "Các ngọn đồi có một màn sương bao phủ.", "eng": "Hills in a vesture of mist."}, {"viet": "Sức khoẻ yếu của cậu ta đã làm cậu ta học chậm ở nhà trường.", "eng": "His bad health has held him back at school."}, {"viet": "Quần áo anh ta lấm đầy bùn và dầu.", "eng": "His clothes were daubed with mud and oil."}, {"viet": "Tiếng kêu vang vọng của nó đã làm náo động cả vùng thung lũng.", "eng": "His echoing cry woke the mountain valley."}, {"viet": "Cha anh ta làm việc trong ban quản trị công ty.", "eng": "His father works in company administration."}, {"viet": "Sự do dự của anh ta đã làm anh ta mất chức vô địch.", "eng": "His hesitation cost him the championship."}, {"viet": "Lá thư của ông ta viết về chủ nghĩa phân biệt chủng tộc trong trường học gửi cho một tờ báo đã thực sự chọc vào tổ ong bắp cày.", "eng": "His letter to the newspaper about racialism in schools has stirred up a real hornet's nest."}, {"viet": "Quyển tiểu thuyết mới của ông ta là một quyển bắt buộc phải đọc đối với dân nghiện tiểu thuyết hình sự.", "eng": "His new novel is a must for all lovers of crime fiction."}, {"viet": "Việc hắn sở hữu khẩu súng đó là chứng cớ thêm vào tội của hắn.", "eng": "His possession of the gun is corroboration of his guilt."}, {"viet": "Cái cổ áo sơ-mi đã làm trầy cổ anh ta.", "eng": "His shirt collar chafed his neck."}, {"viet": "Bài nói của ông ấy đề cập tới lịch sử nước Anh giữa những cuộc chiến tranh.", "eng": "His talk covered British history between the wars."}, {"viet": "Lời nói của ông ấy bị át đi trong tràng vỗ tay tán thưởng.", "eng": "His words were lost in the applause."}, {"viet": "Các phương thuốc, cách chữa trị, các loại thuốc vi lượng đồng căn.", "eng": "Homoeopathic remedies, treatment, medicines."}, {"viet": "Ta cùng đi dự buổi trình chiếu nhé?", "eng": "How about taking in a show?"}, {"viet": "Sao anh lại có thể dám xông vào vào đây mà không gõ cửa?", "eng": "How dare you burst in on us without knocking?"}, {"viet": "Anh lý giải tình hình hiện nay như thế nào?", "eng": "How do you read the present situation?"}, {"viet": "Ông bị sốt bao lâu rồi?", "eng": "How long have you had a fever?"}, {"viet": "Anh còn giữ được quan hệ với bao nhiêu bạn học cũ?", "eng": "How many of your old school friends do you keep up with?"}, {"viet": "Tất cả thứ này bao nhiêu?", "eng": "How much is all of this?"}, {"viet": "Bạn thấy chế độ ăn uống trung bình của người Nhật so với chế độ ăn uống trung bình ở đất nước bạn như thế nào?", "eng": "How would you compare the average Japanese diet with the average diet in your country?"}, {"viet": "Tôi rất biết ơn nếu anh giữ kín được thông tin này.", "eng": "I'd be grateful if you kept this information to yourself."}, {"viet": "Tôi muốn nghĩ kĩ điều đó rồi mới quyết định.", "eng": "I'd like to think it over before deciding."}, {"viet": "Tôi sẽ trả anh 90 đô la một ngày cho công việc đó,'đồng ý!'!", "eng": "I'll give you $ 90 a day for the job, done!"}, {"viet": "Em sẽ nhanh chóng làm cho anh vài quả trứng và thịt muối.", "eng": "I'll rustle up some eggs and bacon for you."}, {"viet": "Tôi e rằng tôi bất đồng ý kiến với anh về vấn đề đó.", "eng": "I'm afraid I have to part company with you there."}, {"viet": "Tôi sắp lấy vợ'.'Ồ, thật là tuyệt!'.", "eng": "I'm getting married.''But that's wonderful!'."}, {"viet": "Tôi thích đọc một cuốn sách hay vì tôi sẽ có một ít thời gian rảnh vào tháng tới đây.", "eng": "I'm in the mood to read a good book since I'll have some free time on my hands this coming month."}, {"viet": "Tôi chẳng thắc mắc-một trong hai ngày đó đều được.", "eng": "I'm not worried-either day would be OK."}, {"viet": "Tôi rất tiếc phải giao cho anh qua nhiều việc làm thêm.", "eng": "I'm sorry to give you so much extra work."}, {"viet": "Tôi đang tìm cách nối dây cho anh, được rồi... anh liên lạc đi.", "eng": "I'm trying to connect you... all right... you're through."}, {"viet": "Tôi đã mong được gặp bác.", "eng": "I've been looking forward to meeting you."}, {"viet": "Tôi có thói quen bật tivi ngay khi vừa về tới nhà.", "eng": "I've got into the habit of switching on the TV as soon as I get home."}, {"viet": "Tôi chưa bao giờ gặp nó trước đây, tôi thề là như thế.", "eng": "I've never seen him before, I swear it."}, {"viet": "Tôi tin chắc là sản phẩm của chúng tôi đạt tiêu chuẩn mà ông mong đợi.", "eng": "I'm sure our products meet the standards you expect."}, {"viet": "Em e là em không hiểu phần ở đây này.", "eng": "I am afraid I don't understand this part here."}, {"viet": "Tôi lo lắng cho tương lai.", "eng": "I am uneasy in my mind about the future."}, {"viet": "Tôi buồn bã nhìn một ông già đang khóc.", "eng": "I beheld with sorrow an old man in tears."}, {"viet": "Tôi không thể nào vay được tiền, nên tôi sẽ phải tự xoay sở lấy.", "eng": "I can't borrow the money so I'll have to manage without."}, {"viet": "Tôi không thể nhớ chính xác cái gì đã xảy ra.", "eng": "I can't remember precisely what happened."}, {"viet": "Tôi chỉ có thể xoay sở vừa đủ sống bằng những gì cha mẹ cho tôi.", "eng": "I can just scrape along on what my parents give me."}, {"viet": "Tôi không thể đi chơi với bạn.", "eng": "I can't go out with you."}, {"viet": "Vất vả lắm tôi mới đọc được cái thứ chữ nguệch ngoạc trẻ con của cô ấy.", "eng": "I could hardly read her childish scrawl."}, {"viet": "Cho tôi rượu vang đỏ nguyên chất.", "eng": "I'd like a dry, red wine, please."}, {"viet": "Tôi quả có nghĩ đến việc từ chức, nhưng tôi đã quyết định là không.", "eng": "I did think of resigning, but I decided not to."}, {"viet": "Tôi không tán thành thái độ thất bại chủ nghĩa của anh.", "eng": "I don't approve of your defeatist attitude."}, {"viet": "Tôi không thích bia có nhiều bọt quá.", "eng": "I don't like beer with too much froth."}, {"viet": "Tôi không nghĩ chúng tôi có thể làm được việc đó, nhưng chúng tôi sẽ cố gắng.", "eng": "I don't think we can do it however, we'll try."}, {"viet": "Một cái xe tôi còn không có.", "eng": "I don't even have a car."}, {"viet": "Tôi đánh rơi cái xô và nước trào ra.", "eng": "I dropped the bucket and water slopped out."}, {"viet": "Tôi cảm thấy buồn bực vì không đưa bọn trẻ đi chơi.", "eng": "I feel rotten about not taking the children out."}, {"viet": "Một mình tôi đã giải xong ô chữ.", "eng": "I finished the crossword all by myself."}, {"viet": "Tôi tới lớp học ban đêm để học nói tiếng Đức.", "eng": "I go to evening classes to do conversational German."}, {"viet": "Tôi đã cãi nhau với người bạn cùng căn hộ về chuyện ai sẽ làm việc nhà.", "eng": "I had a quarrel with my flatmate about who should do the housework."}, {"viet": "Tôi phải lấy hết can đảm của mình để đối mặt với ông chủ.", "eng": "I had to summon up all my nerve to face my boss."}, {"viet": "Gần đây tôi làm việc muộn lắm.", "eng": "I have been working late recently."}, {"viet": "Tôi chỉ có kiến thức sơ sài về địa lý.", "eng": "I have only a sketchy knowledge of geography."}, {"viet": "Tôi chưa vào sổ tên và nghề nghiệp của ông.", "eng": "I haven't enter your name and occupation yet."}, {"viet": "Tôi nghe tin đồn là ông ta sắp thôi việc.", "eng": "I heard a rumour that he was leaving."}, {"viet": "Tôi hy vọng sẽ viết thư trả lời ông về vấn đề của các chi phí trong tuần tới.", "eng": "I hope to get back to you on the question of costs by next week."}, {"viet": "Tôi vừa bị kẹt ngón tay ở cửa.", "eng": "I just pinched my finger in the door."}, {"viet": "Tôi nằm phơi nắng suốt ngày và bị nắng cháy sạm da.", "eng": "I lay in the sun all day and got burnt to a crisp."}, {"viet": "Tôi nghe tất cả những điều phê bình của cô ấy trong sự yên lặng.", "eng": "I listened to all her criticism in silence."}, {"viet": "Tôi sẽ cho anh đi nhờ xe ra ga.", "eng": "I'll give you a lift to the station."}, {"viet": "Xin ông vui lòng đưa cho tôi quyển sách đó.", "eng": "I'll thank you for that book."}, {"viet": "Tuần này tôi phải trực đêm.", "eng": "I'm doing night duty this week."}, {"viet": "Tôi không phải là người vẽ rất giỏi.", "eng": "I'm not a very good drawer."}, {"viet": "Tôi tin chắc là vợ tôi sẽ thích nó.", "eng": "I'm sure my wife will like it."}, {"viet": "Có lẽ tôi có thể đi được đấy.", "eng": "I might be able to do that."}, {"viet": "Bản thân tôi rất thích món ăn cay, nhưng cháu gái tôi lại không thích.", "eng": "I myself do-like hot food, but my niece does not."}, {"viet": "Tôi thường đi bằng phương tiện chuyên chở công cộng.", "eng": "I normally travel by public transport."}, {"viet": "Tôi chơi gôn vào những ngày cuối tuần.", "eng": "I play golf on the weekends."}, {"viet": "Tôi nhận thấy rằng tôi vẫn để nó trong túi suốt thời gian đó.", "eng": "I realized I had had it in my pocket all along."}, {"viet": "Tôi nhớ đã gặp anh ta nhưng không tài nào hình dung ra anh ta được.", "eng": "I remember meeting him but I just can't visualize him."}, {"viet": "Tôi nhìn thấy cậu ở quán rượu đêm qua với bạn gái của cậu.", "eng": "I saw you in the pub last night with your lady friend."}, {"viet": "Tôi sẽ rất lấy làm sung sướng nhận lời mời của anh.", "eng": "I should be very happy to accept your invitation."}, {"viet": "Tôi vẫn nghĩ ra tôi đã đặt nhầm chúng ở đâu.", "eng": "I still can't think where I would have misplaced them."}, {"viet": "Tôi đâm ra có phần cảnh giác với các món hời bán giá hạ.", "eng": "I tend to be a bit leery of cut-price'bargains'."}, {"viet": "Tôi nghĩ rằng hầu hết khách hàng sẽ đầu tư cho kỳ hạn một năm.", "eng": "I think most customers will invest for the one-year terms."}, {"viet": "Tôi nghĩ lời bình luận của anh ta là không thích hợp.", "eng": "I thought his comment was impertinence."}, {"viet": "Tôi đã cố gắng gọi anh nhiều lần hôm qua nhưng không liên lạc được ( với anh ).", "eng": "I tried ringing you several times yesterday but I couldn't get through ( to you )."}, {"viet": "Cháu rất vui khi ở đây.", "eng": "I've been very happy while I was here."}, {"viet": "Tôi muốn kiểm tra một số ngày tháng và địa điềm.", "eng": "I want to check some dates and places."}, {"viet": "Tôi hoàn toàn sửng sốt khi cô ấy nói với tôi giá tiền.", "eng": "I was absolutely flabbergasted when she told me the price."}, {"viet": "Tối nay tôi định đi chơi nhưng tôi đã thay đổi ý kiến.", "eng": "I was going out this evening but I've changed my mind."}, {"viet": "Tôi bị cướp mất tiền mặt và cuốn sổ séc.", "eng": "I was robbed of my cash and cheque-book."}, {"viet": "Tôi đang bước trên đường là hình thức của động từ không hoàn thành.", "eng": "I was walking along the road is in the imperfect."}, {"viet": "Vậy mỗi món tôi sẽ lấy một phần.", "eng": "I will take them each then."}, {"viet": "Ông ta trầm ngâm Tôi tự hỏi liệu có bao giờ tôi sẽ gặp lại họ.", "eng": "I wonder if I shall ever see them again, he mused."}, {"viet": "Làm ơn cho tôi một tách trà.", "eng": "I would like a cup off tea, please."}, {"viet": "Tôi xin giới thiệu món thịt heo xé xốt tỏi, thịt gà thái miếng vuông xào ớt khô và đậu phộng, thịt heo xắt lát ram và món cá giếc chưng tương với ớt khô.", "eng": "I would recommend the Shredded Pork with Garlic Sauce, the Sauted Chicken Cubes with Chilli and Peanuts, Double-Cooked Pork Slices and the Crucian Carp with Chilli Bean Sauce."}, {"viet": "Nếu dầu dính vào lốp ô tô, nó sẽ làm hỏng cao su.", "eng": "If any oil gets on the car tyres, it will perish them."}, {"viet": "Nếu tôi nhớ đúng thì bữa tiệc bắt đầu vào 8 giờ tối.", "eng": "If I remember rightly the party starts at 8 pm."}, {"viet": "Nếu các báo không đưa tin thì ít người biết rằng trái đất đã trải qua một cuộc phiêu lưu kỳ lạ.", "eng": "If the news had not been in the papers, few people would have know that the earth had a strange adventure."}, {"viet": "Nếu anh bị bắt vì tội ăn cắp anh sẽ bị ốm đòn đấy.", "eng": "If you're caught stealing you'll be for the high jump."}, {"viet": "Cậu không tin là tuyết đang rơi, thì cứ ra mà xem!", "eng": "If you don't believe that it's snowing, go and see for yourself!"}, {"viet": "Nếu nhìn chăm chú thì từ đây anh có thể thấy ngay cái nhà thờ.", "eng": "If you look carefully you can just see the church from here."}, {"viet": "Nếu anh muốn tôi đi, sao anh không nói thẳng ra mà lại cứ bóng gió?", "eng": "If you wanted me to go why didn't you say so in plain English instead of making vague hints?"}, {"viet": "Trong tất cả các hoang mạc đều có rất ít nước cho các loài thực vật.", "eng": "In all deserts there is very little water for plants to use."}, {"viet": "Thời xưa, người ta nghĩ rằng có thể chuyển hoá kim loại thường thành vàng.", "eng": "In former times it was thought that ordinary metal could be transmuted into gold."}, {"viet": "Nói cách khác là những môn học khó.", "eng": "In other words, the hard courses."}, {"viet": "Trong lĩnh vực chính trị, nghệ thuật, khoa học, âm nhạc, v. v.", "eng": "In the field of politics, art, science, music, etc."}, {"viet": "Trong câu này chữ BIG viết hoa.", "eng": "In this sentence, the word BIG is in capitals."}, {"viet": "Tranh thủ, khéo lấy được tình cảm của ai.", "eng": "Insinuate oneself into somebody's favour."}, {"viet": "Có đúng là đặt hàng bằng thư tín phổ biến ở Canada không?", "eng": "Is it true that mail order is popular in Canada?"}, {"viet": "Có ai ở đây có thể khẳng định anh ta đã có mặt khi xảy ra tội ác?", "eng": "Is there anyone here who can speak to his having been at the scene of the crime?"}, {"viet": "Sẽ mất khoảng nửa tiếng, vì vào giờ này trong ngày đường sá rất đông xe cộ ạ.", "eng": "It'll take about half an hour, because the streets are heavy with traffic at this time of day."}, {"viet": "Mỗi khi nó nổi nóng thì tốt nhất là cứ chiều theo ý nó.", "eng": "It's always best to humour him when he's in one of his bad moods."}, {"viet": "Thật là xấu hổ khi họ tán tỉnh như vậy giữa công chúng.", "eng": "It's embarrassing when they flirt like that in public."}, {"viet": "Bắt buộc phải trả nợ trong vòng sáu tháng.", "eng": "It's mandatory to pay the debt within six months."}, {"viet": "Nó ở bên kia bờ hồ, nhưng nó được xây dựng bên hồ.", "eng": "It's on the other side of the lake, but it's built on the lake."}, {"viet": "Từ lần chúng tôi gặp nhau đến nay là đúng ba năm chẵn.", "eng": "It's three years to the day since we met."}, {"viet": "Điều đó có vẻ thật, nhưng tôi có những sự ngờ vực của tôi ( về điều đó ).", "eng": "It appears to be genuine, but I have my suspicions ( about it )."}, {"viet": "Anne nói như vậy về ân nhân của mình là không nên.", "eng": "It ill behoves Anne to speak thus of her benefactor."}, {"viet": "Thật không thể nào đoán trước được ai sẽ thắng.", "eng": "It is impossible to predict who will win."}, {"viet": "Đã đến lúc anh rời khỏi gia đình và học cách tự lo liệu lấy.", "eng": "It is time you left home and learnt to fend for yourself."}, {"viet": "Chỉ mất một lát thôi để làm món rau trộn.", "eng": "It only takes a minute to make a salad."}, {"viet": "Nó chỉ có hiệu lực trong tháng này.", "eng": "It's only valid for this month."}, {"viet": "Nó sẽ mất khoảng 15 phút.", "eng": "It should take about 15 mint."}, {"viet": "Được nghe cô ta hát thật là một đặc ân.", "eng": "It was a privilege to hear her sing."}, {"viet": "Tính hài hước của anh ấy đã hấp dẫn tôi ngay từ đầu.", "eng": "It was his sense of humour that first, attracted me to him."}, {"viet": "Chính lúc đó tôi đã có ý nghĩ bỏ chạy.", "eng": "It was then that I conceived the notion of running away."}, {"viet": "Thật là cả gan dám cắm trại ở sân nhà người ta mà không được phép.", "eng": "It would be presuming to camp in a person's yard without permission."}, {"viet": "Jill và Sue bất đồng ý kiến ( với nhau ) về người khách trọ của họ.", "eng": "Jill and Sue are at variance ( with each other ) about their lodger."}, {"viet": "Chỉ một số bộ phận cần phải thay ấy mà.", "eng": "Just a few parts need to be replaced."}, {"viet": "Ngôn ngữ là phương tiện truyền đạt tư tưởng.", "eng": "Language is the vehicle for conveying ideas."}, {"viet": "Hãy cho tôi xuống ở trạm dừng kế tiếp.", "eng": "Let me get off at the next stop."}, {"viet": "London cách Oxford khoảng từ năm mươi đến sáu mươi dặm.", "eng": "London is between fifty and sixty miles from Oxford."}, {"viet": "Nhiều người không hài lòng vì không tìm được những công việc thích hợp.", "eng": "Many people are dissatisfied at not finding suitable jobs."}, {"viet": "Marry, hôm nay người hầu gái đã đến chưa?", "eng": "Mary, did the maid come today?"}, {"viet": "Xin cho tôi xem thực đơn món tráng miệng?", "eng": "May I see the dessert menu?"}, {"viet": "Những khu chung cư cao ngất đồ sộ.", "eng": "Monster high-rise blocks of flats."}, {"viet": "Thưa ông Trần, xin chờ máy một chút.", "eng": "Mr. Chen, please hold on a second."}, {"viet": "Tôi cược là cô ấy sẽ nổi tiếng trong vài năm nữa.", "eng": "My bet is that she'll be famous in a few year's time."}, {"viet": "Cha tôi dường như hài lòng hơn với công việc mới của ông.", "eng": "My father seems more contented in his new job."}, {"viet": "Mẹ tôi không bận tâm đến việc ai đến ở, bà là người rất dễ tính.", "eng": "My mother doesn't mind who comes to stay, she's very easygoing."}, {"viet": "Những lời phê bình của tôi quả là không có hiệu quả.", "eng": "My strictures were quite inefficacious."}, {"viet": "Loại thuốc mới này làm giảm tình trạng tử vong của căn bệnh này.", "eng": "New drugs have reduced the fatality of this disease."}, {"viet": "Không đâu, tôi không được mời.", "eng": "No, I haven't been invited."}, {"viet": "Không ai dám cắt ngang dòng suy nghĩ của anh ta.", "eng": "No one would have dared to break into his abstraction."}, {"viet": "Cho đến bây giờ, hầu hết kết quả bầu cử đã được công bố, chỉ còn đợi reo hò hoan hô.", "eng": "Now that most of the election results have been declared, it's all over bar the shouting."}, {"viet": "Ồ, bà có mất nhiều tiền không?", "eng": "Oh, did you lose a lot of money?"}, {"viet": "Vâng, thưa bác Freeman, cháu đến ngay đây.", "eng": "Okay, Mrs. Freeman, I'm coming."}, {"viet": "Một khi anh đã quyết định như thế, anh sẽ không thể quay lại được nữa đâu.", "eng": "Once you have taken this decision, there will be no going back."}, {"viet": "Trượt chân một cái là anh có thể rơi khỏi vách đá.", "eng": "One slip and you could fall off the cliff."}, {"viet": "Công ty của chúng tôi dẫn đầu những đối thủ chính của nó.", "eng": "Our company is well ahead of its main rivals."}, {"viet": "Chiếc xuồng nhỏ của chúng tôi có vẻ bé nhỏ bên cạnh chiếc du thuyền lớn.", "eng": "Our little dinghy was dwarfed by the big yacht."}, {"viet": "Thầy giáo chúng tôi không công bằng: ông luôn luôn cho những học sinh mà ông ưa thích điểm cao nhất.", "eng": "Our teacher isn't fair: he always gives the highest marks to his favourites."}, {"viet": "Nghị viện đã thảo luận nhiều điểm tu chỉnh vào dự luật.", "eng": "Parliament debated several amendment to the bill."}, {"viet": "Người ở những nơi khác nhau nói những ngôn ngữ khác nhau.", "eng": "People in different countries speak different language."}, {"viet": "Hãy đưa cho tôi sổ gửi tiết kiệm ngân hàng và hộ chiếu của ông?", "eng": "Please give me your passbook and your passport?"}, {"viet": "Những chương trình từ lâu đã không còn có ích.", "eng": "Programmes which have long since ceased to be useful."}, {"viet": "Nhà trường sẽ kết thúc vào cuối tuần này và tôi thấy càng sớm càng tốt.", "eng": "School finishes at the end of the week, and the sooner the better as far as I'm concerned."}, {"viet": "Vậy tôi giữ trước cho ông một chỗ nhé?", "eng": "Shall I reserve you a seat then?"}, {"viet": "Bà ấy là một người đàn bà dữ tợn.''Đúng như cậu nói. Bà ta đã đánh tớ hơn một lần rồi'.", "eng": "She's a violent woman.''You can say that again. She's hit me more than once'."}, {"viet": "Cô ấy làm mọi thứ để qua được kì thi.", "eng": "She's doing her damnedest to pass the exam."}, {"viet": "Cô ta đã mất hết tiền, thật tội nghiệp.", "eng": "She's lost all her money, pour soul."}, {"viet": "Cô ta vững tâm bước vào nghề dạy học.", "eng": "She's taken to teaching like a duck to water."}, {"viet": "Cô ấy được xếp trong danh sách những học sinh giỏi nhất mỗi học kỳ.", "eng": "She also earned a place on the dean's list."}, {"viet": "Cô ta cười phá lên, không nhịn được.", "eng": "She burst out laughing, she couldn't help it."}, {"viet": "Cô ấy vẫn tiếp tục yêu anh ta mặc dù anh ta có nhiều khiếm khuyết.", "eng": "She continued to love him despite his many frailties."}, {"viet": "Bà ấy không tỏ ra đau buồn khi con trai bà ấy chết.", "eng": "She did not show her grief when her son died."}, {"viet": "Bà ấy được thừa nhận là bộ trưởng mạnh nhất trong tân chính phủ.", "eng": "She established herself as the most powerful minister in the new government."}, {"viet": "Bà ta thấy toàn bộ cuộc phỏng vấn là khá bực bội.", "eng": "She found the whole interview rather unnerving."}, {"viet": "Cô ta nắm chắc dây cương dắt con ngựa quay trở lại.", "eng": "She grasped the reins and led the horse back."}, {"viet": "Đã nhiều năm nay cô ta chưa có được một kỳ nghỉ hè thật sự.", "eng": "She hadn't had a proper holiday for years."}, {"viet": "Cô ấy chứng tỏ có sức dẻo dai để tranh đua trong cuộc chạy maratông.", "eng": "She has proved that she has the staying power to complete in the marathon."}, {"viet": "Cô ấy là người tin tưởng nhiệt thành ở quyền lợi của phụ nữ.", "eng": "She is a fervent believer in women's right."}, {"viet": "Cô ấy là sinh viên học khá nhất của tôi.", "eng": "She is the farthest advanced of all my students."}, {"viet": "Bà ta đã dốc toàn tâm toàn ý vào nhiều sự nghiệp đáng kính.", "eng": "She lent her name to many worthy causes."}, {"viet": "Bà ấy hứa với con trai là mua cho nó một cái xe đạp.", "eng": "She made a promise to her son to buy him a bike."}, {"viet": "Cô ấy nhận thấy có vài điều không nhất quán nhỏ trong lý lẽ của anh ta.", "eng": "She noticed several minor inconsistencies in his argument."}, {"viet": "Bà ta đã đề nghị cám ơn uỷ ban trước khi bắt đầu bài diễn văn của bà.", "eng": "She preceded her speech with a vote of thanks to the committee."}, {"viet": "Cô ấy lấy lại người chồng cũ sau mười năm ly dị.", "eng": "She remarried her former husband ten years after their divorce."}, {"viet": "Ngày hôm nay bà ta cảm thấy khỏe hơn rất nhiều.", "eng": "She's feeling miles better today."}, {"viet": "Cô ta rất am tường về nghệ thuật.", "eng": "She's very knowledgeable about art."}, {"viet": "Bà ta hình như chẳng có nguyên tắc đạo đức gì cả khi đụng đến vấn đề kiếm ra tiền.", "eng": "She seems to have no principles at all when it is a question of making money."}, {"viet": "Cô ta làm cho họ bị mất mặt vì không thèm đáp lại lời mời của họ.", "eng": "She snubbed them by not replying to their invitation."}, {"viet": "Cô ta tự nhiên nảy ra ý nghĩ nhuộm tóc mình thành màu xanh.", "eng": "She suddenly took it into her head to dye her hair green."}, {"viet": "Cô ta đem đến cho anh vài bông hoa khi cô đến thăm anh ở bệnh viện.", "eng": "She took him some flowers when she went to see him in hospital."}, {"viet": "Nghĩ đến cái cảnh phải ở nhà cô độc suất một tuần, cô ta chẳng cảm thấy thích thú chút nào.", "eng": "She viewed the prospect of a week alone in the house without much enthusiasm."}, {"viet": "Cô ấy luôn trội hơn các bạn trong lớp.", "eng": "She was always well ahead of the rest of the class."}, {"viet": "Năm ngoái bà đã được bầu vào quốc hội.", "eng": "She was elected to parliament last year."}, {"viet": "Cô ta tức giận nó vì đã để thua trận đấu.", "eng": "She was mad with him for losing the match."}, {"viet": "Cô ta đủ nhanh trí né kẻ tấn công.", "eng": "She was sharp-witted enough to dodge her attacker."}, {"viet": "Cô ta nói rất thuyết phục nhưng tôi vẫn không tin.", "eng": "She was very persuasive but I remain unconvinced."}, {"viet": "Cô ta cứ than phiền về chuyện mình bị khổ sở.", "eng": "She whinged on about how miserable she was."}, {"viet": "Mặc dầu đau ốm bà vẫn làm việc rất hăng hái: Bà ta thật phi thường!", "eng": "She works so hard in spite of her illness: she's a marvel!"}, {"viet": "Ban mới đó có phải là một phần của khoa văn không?", "eng": "Should the new department form part of the Faculty of Arts?"}, {"viet": "Từ khi bị tai nạn, cô ta chỉ có thể làm công việc nhẹ.", "eng": "Since her accident she can only do light work."}, {"viet": "Uống một tách trà cho đỡ khát.", "eng": "Slake one's thirst with a cup of tea."}, {"viet": "Những vết bẩn trên tấm khăn bàn trắng.", "eng": "Smutty marks on the white tablecloth."}, {"viet": "Những nghĩa vụ xã hội gắn với công việc của anh ấy.", "eng": "Social obligations incidental to his job."}, {"viet": "Thịt của một số chim săn được giữ cho đến khi bắt đầu có mùi mới đem nấu nướng.", "eng": "Some game-birds are kept until they are high before cooking."}, {"viet": "Một số người vẫn còn cho rằng khi một phụ nữ bước vào phòng, mà đàn ông không đứng dậy là bất lịch sự.", "eng": "Some people still think it is impolite for men not to stand up when a woman comes into the room."}, {"viet": "Có ai đó đã báo cho cảnh sát biết trước về vụ cướp.", "eng": "Someone tipped off the police about the robbery."}, {"viet": "Chăn thừa đặt cuối mỗi chiếc giường.", "eng": "Spare blankets lay at the foot of each bed."}, {"viet": "Rút lui để hỗ trợ một ứng viên khác.", "eng": "Stand aside in favour another applicant."}, {"viet": "Cúi đầu của mình để vào trong ôtô.", "eng": "Stoop one's head to get into car."}, {"viet": "Nói đúng ra, anh ta không đủ tiêu chuẩn chuyên môn để làm công việc này.", "eng": "Strictly speaking, he's not qualified for the job."}, {"viet": "Những sự cân nhắc như thế chỉ là thứ yếu đối với mục đích của chúng ta về việc cải tiến năng suất.", "eng": "Such considerations are secondary to our main aim of improving efficiency."}, {"viet": "Những cột chống đỡ bức tường sắp đổ.", "eng": "Supports holding up a collapsing wall."}, {"viet": "Dùng một lượng thuốc ngủ quá liều.", "eng": "Take a massive overdose of sleeping tablets."}, {"viet": "Vùng Tasmania được đặt tên theo tên người khám phá ra nó, A. J. Tasman.", "eng": "Tasmania was named after its discover, A. J. Tasman."}, {"viet": "Mười phần trăm lực lượng lao động sẽ dôi ra.", "eng": "Ten per cent of the work-force will be made redundant."}, {"viet": "Đây là thí dụ tiêu biểu cho cái tôi vừa nói đến.", "eng": "That's a prime example of what I was talking about."}, {"viet": "Đứa bé đó nhanh nhẹn như một con khỉ.", "eng": "That child has the agility of a monkey."}, {"viet": "Đó là điều ngược lại với cái anh ta tin tưởng.", "eng": "That is the antithesis of what he believes."}, {"viet": "Tôi thấy bức tranh trên tường trông bị lệch.", "eng": "That picture on the wall looks cockeyed to me."}, {"viet": "Cuộc gây lộn ngu ngốc đó đã làm chúng tôi kém thân mật với nhau.", "eng": "That stupid quarrel has distanced us."}, {"viet": "Phím La trên đàn piano này không kêu.", "eng": "The A key on this piano won't sound."}, {"viet": "Giọng của diễn viên nhỏ dần đi khi anh ta quên lời thoại.", "eng": "The actor's voice tailed away as he forgot his lines."}, {"viet": "Những luận điệu đó bị hoàn toàn bác bỏ.", "eng": "The allegations have been completely disproved."}, {"viet": "Nỗi lo âu của cô ta tuần qua đã làm cô ta kiệt lực.", "eng": "The anxiety of the past week had left her exhausted."}, {"viet": "Việc bắt người cầm đầu là sự báo hiệu cuộc nổi dậy.", "eng": "The arrest of the chief was the signal for a rising."}, {"viet": "Nhiệm vụ cải tạo chế độ quan liêu cực kì khó khăn phức tạp.", "eng": "The augean task of reforming the bureaucracy."}, {"viet": "Tin buồn như phủ một bóng tối lên cuộc họp của chúng tôi.", "eng": "The bad news cast a shadow on our meeting."}, {"viet": "Quán rượu là nơi lui tới quen thuộc của bọn tội phạm.", "eng": "The bar was a favorite haunt of criminals."}, {"viet": "Vịt quay Bắc Kinh là món đặc sản của Bắc Kinh.", "eng": "The Beijing Roast Duck is a Beijing specialty."}, {"viet": "Bọn tống tiền đã bòn rút của anh ta từng đồng xu.", "eng": "The black mailers bled him for every penny he had."}, {"viet": "Những miếng xương không ai đụng tới trong nhiều thế kỷ.", "eng": "The bones had lain undisturbed for centuries."}, {"viet": "Thị trường đã sụp đổ.", "eng": "The bottom has fallen out of the market."}, {"viet": "Vốn tiết mục hàng ngày của dàn nhạc.", "eng": "The bread and butter repertoire of an orchestra."}, {"viet": "Đội Bulls thắng đội Lakers một cách quá dễ dàng tối qua.", "eng": "The Bulls beat the Lakers hands down last night."}, {"viet": "Cuộc vận động nhằm nâng cao nhận thức chung đối với vấn đề.", "eng": "The campaign was designed to increase public awareness of the problem."}, {"viet": "Chiếc xe ôtô ấy gần như mới.", "eng": "The car is pretty nearly new."}, {"viet": "Vụ kiện được xử trong phòng riêng của ông chánh án.", "eng": "The case was heard in camera."}, {"viet": "Ông chủ tịch nói đều đều suốt mấy giờ nghe phát chán.", "eng": "The chairman droned on for hours."}, {"viet": "Mặt đứa trẻ nhem nhuốc sô cô la.", "eng": "The child's face was smeared with chocolate."}, {"viet": "Đứa bé ấy đang ngồi ở bậc thang trên cùng.", "eng": "The child was sitting on the top step."}, {"viet": "Trẻ em chụp ảnh rất dễ thương.", "eng": "The children photographed very attractively."}, {"viet": "Sự lựa chọn mà công ty phải đối phó rất đơn giản: đa dạng hoá hay phá sản.", "eng": "The choice facing the company is simple: diversify or go bankrupt."}, {"viet": "Vị linh mục khuyên răn nó rất nhiều nhưng nó không nghe.", "eng": "The clergyman shepherd him so much but he didn't listen."}, {"viet": "Cái áo khoác này mặc bó chặt.", "eng": "The coat was a tight fit."}, {"viet": "Hội đồng đã cân nhắc kĩ lưỡng đề nghị của chúng tôi.", "eng": "The committee deliberated whether to approve our proposal."}, {"viet": "Công ty đang giảm bớt lực lượng bán hàng.", "eng": "The company is running down its sales force."}, {"viet": "Ảo thuật gia đã làm con chim biến đi.", "eng": "The conjurer magicked the bird away."}, {"viet": "Cái giá phải trả về sinh mạng thì cao.", "eng": "The cost in terms of human life was high."}, {"viet": "Cặp vợ chồng nhà kế bên lúc nào cũng cãi nhau.", "eng": "The couple next door are always arguing."}, {"viet": "Sự đánh giá của giới phê bình đối với bộ phim là thấp.", "eng": "The critics'rating of the film was low."}, {"viet": "Tài khoản vãng lai có hình thức sổ gửi tiền.", "eng": "The current account take the form of a deposit book."}, {"viet": "Ngày đang ngắn dần thế là mùa thu đã đến.", "eng": "The days are closing in now that the autumn is here."}, {"viet": "Cuộc tuần hành đã bộc phát thành bạo lực.", "eng": "The demonstration erupted into violence."}, {"viet": "Các cuốn từ điển đó ở ngay trên kệ phía trước mặt.", "eng": "The dictionaries are on the shelf directly opposite."}, {"viet": "Sự phân bố trường học ở quận này.", "eng": "The distribution of schools in this district."}, {"viet": "Các bác sĩ đã thử mọi cách cứu sống anh ta, nhưng không có kết quả.", "eng": "The doctors by everything to keep him alive but to no avail."}, {"viet": "Con chó đuổi theo con thỏ nhưng không bắt được nó.", "eng": "The dog went after a rabbit but didn't catch it."}, {"viet": "Những người lái tàu là lớp người có khả năng nhất trong nghiệp đoàn đường sắt.", "eng": "The drivers are the aristocracy of the railway men's union."}, {"viet": "Bộ phận biên tập đã chuẩn hoá cách viết chính tả có phần khác thường của tác giả.", "eng": "The editors have normalized the author's rather unusual spelling."}, {"viet": "Quân địch đã đào hào cố thủ vững chãi ở phía bên kia bờ sông.", "eng": "The enemy were strongly entrenched on the other side of the river."}, {"viet": "Các chính phủ Châu Âu đã làm một cố gắng phối hợp để ngăn chặn việc buôn bán ma tuý.", "eng": "The European government made concerted effort to stop drug smuggling."}, {"viet": "Vụ nổ đó đã làm cho tòa nhà thành đống gạch vụn.", "eng": "The explosion reduced the building to a pile of rubble."}, {"viet": "Tháp Pisa nổi tiếng nghiêng về một bên.", "eng": "The famous tower of Pisa leans at an angle."}, {"viet": "Kỷ niệm lần thứ năm mươi cách mạng Nga.", "eng": "The fiftieth anniversary of the Rusian Revdution."}, {"viet": "Những phát hiện của công cuộc nghiên cứu có vẻ thiếu căn cứ.", "eng": "The findings of the research seem unsound."}, {"viet": "Hành động đầu tiên của chế độ mới là gạt bỏ các tướng lĩnh.", "eng": "The first act of the new government is the banishment of the general."}, {"viet": "Chuyến bay đã được ghi tên quá mức rồi, không còn chỗ nữa.", "eng": "The flight has been over-subscribed, there are no seats."}, {"viet": "Những người đi tiên phong phát minh động cơ diesel hiện đại.", "eng": "The forerunners of the modern diesel engine."}, {"viet": "Chức năng của tim là bơm máu đi toàn cơ thể.", "eng": "The function of the heart is to pump blood through the body."}, {"viet": "Đại tướng ước đoán lương thực của quân thù chỉ còn lại khoảng năm ngày thôi.", "eng": "The General conjectured that the enemy had about five days supply of food left."}, {"viet": "Thủ thành làm một cú lao ra đẹp mắt để cứu khung thành.", "eng": "The goalkeeper made a spectacular dive to save the goal."}, {"viet": "Chính phủ của họ tạo điều kiện thuận lợi cho ngành công nghiệp để họ có thể bán những sản phẩm của họ rẻ hơn của chúng tôi.", "eng": "The government featherbeds its industries so that they can sell their products much more cheaply than we can."}, {"viet": "Chính phủ đã ra lệnh cho cảnh sát triển khai để phục hồi trật tự trên đường phố.", "eng": "The government ordered the police out to restore order in the streets."}, {"viet": "Sức mạnh lớn lao không thể đo lường được của tình yêu và quyền lực.", "eng": "The great imponderables of love and power."}, {"viet": "Cái khoá kéo cửa người khách bị kẹt.", "eng": "The guest's zipper is stuck."}, {"viet": "Ông hiệu trưởng đọc diễn văn từ trên bục ở cuối giảng đường.", "eng": "The headmaster gave his speech from a platform at one and of the hall."}, {"viet": "Những ngọn đồi nổi bật tương phản với bầu trời bình minh.", "eng": "The hills stood out in sharp relief against the dawn sky."}, {"viet": "Thời tiết nóng làm cho lúa mì lên đẹp.", "eng": "The hot weather is bringing the wheat on nicely."}, {"viet": "Ngôi nhà nằm nghiêng với quảng trường.", "eng": "The house stood catercorner across the square."}, {"viet": "Chứng bệnh ấy làm cô ta kiệt sức trong nhiều tuần lễ.", "eng": "The illness left her prostrate for several weeks."}, {"viet": "Thế chủ động đã chuyển sang chúng tôi.", "eng": "The initiative has passed to us."}, {"viet": "Cuộc điều tra không đưa ra được chứng cứ quyết định nào.", "eng": "The investigation failed to provide any conclusive evidence."}, {"viet": "Quan toà xét nó có tội và kết án nó năm năm tù.", "eng": "The judge found him guilty and sentenced him to five years."}, {"viet": "Trong vở kịch đó nhà vua được diễn tả như một kẻ xấu xa.", "eng": "The king is represented as a villain in the play."}, {"viet": "Đoạn cuối của con dốc gần thẳng đứng.", "eng": "The last part of the ascent is very steep."}, {"viet": "Những chiếc lá khô quắt lại dưới ánh mặt trời.", "eng": "The leaves shrivelled up in the sun."}, {"viet": "Đèn đỏ nhưng chiếc xe cấp cứu vẫn cứ chạy qua.", "eng": "The light was red but the ambulance drove straight through."}, {"viet": "Những chiếc xe tải đang đua với nhau.", "eng": "The lorries were racing against each other."}, {"viet": "Cực Bắc từ là ở Canada phải không?", "eng": "The magnetic North Pole is in Canada, isn't it?"}, {"viet": "Tên của hãng sản xuất gắn trên bao.", "eng": "The manufacturer's name is emblazoned on the packet."}, {"viet": "Biện pháp đó đã được thông qua với chín phiếu chống sáu.", "eng": "The measure was passed by 9 votes to 6."}, {"viet": "Chỉ thoáng thấy rắn tôi đã sởn gai ốc lên rồi.", "eng": "The mere sight of snakes makes my flesh creep."}, {"viet": "Tên lửa đó bay hướng lên trời.", "eng": "The missile rose upward into the sky."}, {"viet": "Buổi sáng qua đi luân phiên giữa đóng gói và ghi chép báo cáo trên radio.", "eng": "The morning passed in alternation between packing and monitoring the radio reports."}, {"viet": "Tội giết một đứa bé sáu tuổi.", "eng": "The murder of a six-year-old child."}, {"viet": "Hàng xóm láng giềng sống gần gũi nhau.", "eng": "The neighbour lived in close propinquity to each other."}, {"viet": "Giám đốc mới thực sự là một người thành công nhanh chóng.", "eng": "The new manager is a real whizz-kid."}, {"viet": "Tin đó bao trùm lên khắp làng sự ảm đạm sâu đậm.", "eng": "The news cast a deep gloom over the village."}, {"viet": "Giới quý tộc đối xử với dân thường đầy vẻ khinh miệt ngạo mạn.", "eng": "The nobles treated the common people with haughty contempt."}, {"viet": "Cô y tá lau rửa vết thương trước khi khâu.", "eng": "The nurse cleansed the wound before stitching it."}, {"viet": "Thuốc mỡ làm vết bỏng hết đau.", "eng": "The ointment to take the sting out of the burn."}, {"viet": "Một cách thức thường dùng nhất là chữ B-ray.", "eng": "The one most often use is Braille."}, {"viet": "Những nhân chứng khác sẽ xác nhận những điều tôi nói.", "eng": "The other witnesses will bear me out."}, {"viet": "Gói hàng gửi lầm địa chỉ.", "eng": "The parcel was seat to the wrong destination."}, {"viet": "Người bệnh không thể chịu đựng hoá trị liệu trong bất cứ một thời gian nào.", "eng": "The patient cannot endure chemotherapy for any length of time."}, {"viet": "Nhân dân giành được quyền tự do ngôn luận và tự do báo chí.", "eng": "The people won the right to free speech and a free press."}, {"viet": "Bức ảnh chụp ngôi nhà trông nghiêng.", "eng": "The picture show a side-view of the house."}, {"viet": "Kế hoạch đó sẽ mau chóng trở thành hiện thực.", "eng": "The plan will soon become a reality."}, {"viet": "Vở kịch hoàn toàn thích hợp cho trẻ em coi, không có gì gây phản đối cả.", "eng": "The play is quite suitable for children to see, there's nothing exceptionable in it."}, {"viet": "Cảnh sát đang theo dấu một tên tội phạm.", "eng": "The police are on the track of a criminal."}, {"viet": "Cảnh sát đã mở cuộc điều tra lần lượt từng nhà.", "eng": "The police made house-to-house enquiries."}, {"viet": "Người nữ cảnh sát đã ghi những chi tiết về anh ta.", "eng": "The policewoman wrote down his particulars."}, {"viet": "Chiếc bình vỡ nát khi nó rơi xuống sàn nhà.", "eng": "The pot shattered as it hit the floor."}, {"viet": "Tổng thống có quyền phủ quyết những đạo luật của Quốc hội.", "eng": "The President can veto congressional bills."}, {"viet": "Giá sẽ không vượt quá 100 bảng Anh.", "eng": "The price will not exceed £ 100."}, {"viet": "Tù nhân đã bị đưa ra toà để xét xử.", "eng": "The prisoner was brought to court for trial."}, {"viet": "Kế hoạch được Chính phủ ủng hộ.", "eng": "The project had the government's backing."}, {"viet": "Công chúng không bị lừa bởi những gì báo chí loan báo phóng đại về sự kiện đó.", "eng": "The public were not fooled by all the hype the press gave the event."}, {"viet": "Ngài Đại sứ Anh thay mặt cho Nữ hoàng ở đám tang đó.", "eng": "The Queen was represented at the funeral by the British ambassador."}, {"viet": "Hệ thống đánh giá xếp hạng đang được điều chỉnh lại đôi chút.", "eng": "The rating system is under going some complete restructuring."}, {"viet": "Trung đoàn rạng rỡ vinh quang trong trận đánh lấn chiếm.", "eng": "The regiment covered itself with glory in the invasion battle."}, {"viet": "Trách nhiệm đè nặng lên ông ta.", "eng": "The responsibilities weigh heavily on him."}, {"viet": "Các quyền lợi của cá nhân so với các quyền lợi của toàn xã hội.", "eng": "The rights of the individual compared with those of society as a whole."}, {"viet": "Vào buổi chiều, đường sá thường yên tĩnh.", "eng": "The roads are usually quiet in the afternoon."}, {"viet": "Những dãy nhà có cùng một kiểu dáng bên ngoài.", "eng": "The rows of houses were uniform in appearance."}, {"viet": "Bà giám đốc mại vụ gọi điện thoại cho người tương nhiệm của công ty khác.", "eng": "The sales director phoned her counterpart in the other firm."}, {"viet": "Toàn thể trường đứng lên và hát bài nhớ ơn nhà trường.", "eng": "The school rose and sang the Alma Mater."}, {"viet": "Nghị viện sẽ bàn về chủ đề tăng thuế.", "eng": "The senate will debate the subject of tax increases."}, {"viet": "Các tấm trải giường được giắt gọn dưới đệm.", "eng": "The sheets were tucked in neatly."}, {"viet": "Tuần này cửa hàng giầy bán hạ giá.", "eng": "The shoe shop is having a sale this week."}, {"viet": "Việc ký kết bản hiệp định là sự mở đầu cho những quan hệ tốt hơn giữa hai nước.", "eng": "The signing of the agreement was a prologue to better relations between the two countries."}, {"viet": "Hòn đảo nhỏ hơn trong hai hòn đảo được gọi tên một cách thích đáng là The Calf.", "eng": "The smaller of the two islands was aptly named The Calf."}, {"viet": "Những người lính đứng bên ngựa đợi lệnh để nhảy lên.", "eng": "The soldiers stood beside their horses, waiting for the order to mount."}, {"viet": "Diễn giả ngừng lại một lúc rồi lại tiếp tục.", "eng": "The speaker paused for a moment, and then continued."}, {"viet": "Những vì sao chiếu xuyên đêm.", "eng": "The stars that shoot, athwart the night."}, {"viet": "Câu chuyện này quá nghiêm túc, anh có thể xen vài câu nói đùa vào được không?", "eng": "The story is too serious-can't you work a few jokes in?"}, {"viet": "Chủ đề này có thể rất hấp dẫn với anh, nhưng nó chẳng hấp dẫn gì đối với tôi.", "eng": "The subject may be full of interest to you, but it holds no interest for me."}, {"viet": "Người bị tình nghi đã được đưa về đồn cảnh sát để lấy khẩu cung.", "eng": "The suspect has taken to the police station for questioning."}, {"viet": "Thầy giáo đã khiển trách học sinh về tội không học bài.", "eng": "The teacher laced into his students for not studying."}, {"viet": "Nhiệt độ giữ ở mức từ 250C đến 300C suốt cả tuần.", "eng": "The temperature remained between 250C and 300C all week."}, {"viet": "Bọn trộm đã mắc bẫy cảnh sát.", "eng": "The thieves were caught in a police trap."}, {"viet": "Ứng cử viên bảo thủ có nhiều khả năng trúng cử.", "eng": "The Tory candidate stands a good chance of getting in."}, {"viet": "Những con tàu đi ngược chiều nhau.", "eng": "The trains were travelling in opposite directions."}, {"viet": "Ống kính truyền hình đã có mặt khi kết thúc và đã quay cảnh bắt giữ.", "eng": "The TV cameras were in at the death and filmed the arrest."}, {"viet": "Hai hệ thống đó, trên thực tế, là như nhau.", "eng": "The two systems are, in effect, identical."}, {"viet": "Hoa Kỳ đã đồng hoá người nhiều nước khác nhau tới.", "eng": "The USA has assimilated people from many different countries."}, {"viet": "Tất cả dân làng đều ký vào bản kiến nghị yêu cầu cho xây dựng một bệnh viện.", "eng": "The villagers all signed a petition asking for a hospital to be built."}, {"viet": "Nước trong ấm đun đã bốc hơi hết.", "eng": "The water in the kettle had all boiled away."}, {"viet": "Toàn bộ khách sạn bị thêu trụi trong mấy phút.", "eng": "The whole hotel went up in flame in minutes."}, {"viet": "Thầy phù thuỷ lang băm đã có lời rủa độc đối với bầy gia súc của chúng tôi.", "eng": "The witch-doctor has cursed our cattle."}, {"viet": "Rừng của thế giới đang thu hẹp lại với một tốc độ đáng lo ngại.", "eng": "The world's forests are shrinking at an alarming rate."}, {"viet": "Tính toán của họ ngăn chặn sự chống đối bằng cách đóng cửa các toà báo lạ làm nguy hại đến mục đích của mình.", "eng": "Their attempt to prevent opposition by closing down the newspapers was self-defeating."}, {"viet": "Cuộc hôn nhân của họ thật không vừa đôi phải lứa-họ có ít cái hợp nhau.", "eng": "Their marriage was a mismatch-they had little in common."}, {"viet": "Vậy thì cháu sẽ giặt quần áo của cháu vào thứ bảy với bác nhé.", "eng": "Then I'll do my washing on Saturday with you."}, {"viet": "Có một nhu cầu ngày càng tăng về nhà ở mới ở khu này.", "eng": "There's a growing need for new housing in this area."}, {"viet": "Không thể không thừa nhận sự thật là nền kinh tế của đất nước đang gặp khó khăn.", "eng": "There's no getting away from the fact that the country's economy is suffering."}, {"viet": "Có vấn đề nhỏ về tiền anh nợ tôi.", "eng": "There's the small matter of the money you owe me."}, {"viet": "Có rất nhiều điều tôi phải đắn đo trước khi quyết định.", "eng": "There are many things I must consider before making a decision."}, {"viet": "Có hai cái cột đỡ mái nhà.", "eng": "There are two large wooden supports that hold up the roof."}, {"viet": "Có mối quan hệ chặt chẽ giữa tiếng Ý và tiếng Tây ban nha.", "eng": "There is a close affinity between Italian and Spanish."}, {"viet": "Có rất ít sự thống nhất về vấn đề chính sách của chúng ta sẽ thế nào.", "eng": "There is little agreement as to what our policy should be."}, {"viet": "Không có gì khác nhau nhiều giữa họ.", "eng": "There isn't much difference betweeen them."}, {"viet": "Từ đây xuống những tảng đá bên dưới có đến năm trăm phít dựng đứng.", "eng": "There was a sheer drop of five hundred feet to the rocks below."}, {"viet": "Có một vài lỗi lầm nhỏ không quan trọng trong bản dịch.", "eng": "There were a few trivial slips in the translation."}, {"viet": "Những cây táo này bao giờ cũng sai quả.", "eng": "These apple trees have always fruited well."}, {"viet": "Những khoản này không thuộc đề mục này.", "eng": "These items don't belong under this heading."}, {"viet": "Cái quần này cũ quá rồi, không đáng giữ lại.", "eng": "These trousers are so worn they're hardly worth keeping."}, {"viet": "Họ đã tân trang lại hoàn toàn cửa hàng.", "eng": "They've given the shop a completely new look."}, {"viet": "Người ta đang xây cống rãnh dọc con đường.", "eng": "They are laying new sewers along the road."}, {"viet": "Họ đã gây nên sự điêu tàn.", "eng": "They brought about its ruin."}, {"viet": "Họ giải quyết vấn đề một cách kiên quyết.", "eng": "They dealt with the problem in a purposeful way."}, {"viet": "Họ phải lòng nhau ngay: đó là tình yêu sét đánh.", "eng": "They fell in love at once: it was at first sight."}, {"viet": "Họ có quyền ưu tiên đối với tài sản này,.", "eng": "They have a prior claim to the property."}, {"viet": "Họ đã để đứa bé cho một người bạn chăm nom.", "eng": "They left the child in a friend's care."}, {"viet": "Trong tuần họ không bao giờ có thì giờ đi xem chiếu bóng.", "eng": "They never have time to go to the cinema during the week."}, {"viet": "Rồi họ nhận ra rằng cuộc chiến xảy ra thôi.", "eng": "They realized then that war was certain."}, {"viet": "Cô ấy đã cho chúng tôi xem ảnh đám cưới của họ.", "eng": "They showed us the pictures of their wedding."}, {"viet": "Họ sử dụng vườn nhỏ của họ để trồng rau.", "eng": "They utilised their small garden to grow vegetables."}, {"viet": "Họ rất hăng hái nhiệt tình khi nói về kỳ nghỉ của họ.", "eng": "They were full of animation as they talked about their holiday."}, {"viet": "Họ sẽ không tiết lộ cho anh bí mật nào đâu.", "eng": "They won't tell you any secrets."}, {"viet": "Quyển sách này không hấp dẫn.", "eng": "This book does not commend itself to me."}, {"viet": "Nghề thủ công này gần như tàn lụi rồi.", "eng": "This craft had almost died out."}, {"viet": "Chính phủ này lên nắm chính quyền trong kỳ tuyển cử vừa qua.", "eng": "This government came to power at the last election."}, {"viet": "Đây là thời gian riêng tư của tôi, thưa ông Âu Dương.", "eng": "This is my private time, Mr. Auyang."}, {"viet": "Viên luật sư này luôn luôn làm cho các nhân chứng mắc sai lầm bằng cách hỏi những cây hỏi làm người ta lúng túng.", "eng": "This lawyer always tries to trip witness up by asking confusing questions."}, {"viet": "Gói này đáng phải có mười đinh ốc, nhưng lại thiếu hai chiếc.", "eng": "This packet is supposed to contain ten screws, but it's two short."}, {"viet": "Con đường này có thể là con đường chúng ta không muốn-nhưng đó là một sự mạo hiểm mà chúng ta phải chấp nhận.", "eng": "This road may not be the one we want-but that's a chance we're going to have to take."}, {"viet": "Luận thuyết này đã được nhiều nhà khoa học tranh luận.", "eng": "This theory has been contended among several scientists."}, {"viet": "Đôi giày mới đó thật sự hợp thời trang.", "eng": "Those new shoes are really in style."}, {"viet": "Ngày nay phần lớn loại kẹo cao su được sản xuất từ chất chicle.", "eng": "Today most chewing gum is made from chicle."}, {"viet": "Lật miếng giấy qua, và gấp mỗi góc vào chính giữa thêm lần nữa.", "eng": "Turn the paper over, and fold each corner to the center again."}, {"viet": "Vivian Leigh là ngôi sao điện ảnh bạn yêu thích, phải vậy không?", "eng": "Vivian Leigh is your favourite movie star, isn't she?"}, {"viet": "Chúng tôi muốn hàng đến trước ngày 18 tháng giêng nếu có thể được.", "eng": "We'd like the goods to arrive by January 18 if possible."}, {"viet": "Tất cả chúng ta đều phải chết cùng với những thiếu sót và yếu đuối của con người.", "eng": "We're an mortals, with our human faults and weaknesses."}, {"viet": "Chúng tôi bận quá phải thuê người làm giúp một số công việc.", "eng": "We're so busy we have to farm out a lot of work."}, {"viet": "Chúng tôi đã sống ở trang trại này hai mươi năm nay.", "eng": "We've lived on this farm for twenty years."}, {"viet": "Chúng tôi cảm kích sự giúp đỡ kinh tế của ông.", "eng": "We appreciate your economic assistance."}, {"viet": "Chúng tôi được thị trường biết đến là một công ty thương mại cung cấp các sản phẩm đồ dùng nhà bếp có chất lượng và uy tín cao.", "eng": "We are well-established as a trading company of quality kitchenware, and enjoy a very good reputation."}, {"viet": "Tất cả chúng ta đều có thể đưa ra những gợi ý nhưng giám đốc là người có tiếng nói cuối cùng.", "eng": "We can all make suggestions, but the manager has the last word."}, {"viet": "Chúng ta có thể bắt vài con cá và nấu chúng.", "eng": "We could catch some fish and cook them."}, {"viet": "Chúng tôi không thích chúng nên chúng tôi đã ném chúng trở lại biển.", "eng": "We don't like them, so we threw them back into the ocean."}, {"viet": "Cứ vào dịp nghỉ cuối tuần, chúng tôi đều đi chơi thuyền trên hồ.", "eng": "We go boating on the lake every weekend."}, {"viet": "Chúng tôi phải chuyển từ Gatwick sang Heathrow để đi máy bay sang Belfast.", "eng": "We had to transfer from Gatwick to Heathrow to catch a plane to Belfast."}, {"viet": "Chúng tôi có nước cam, táo, bưởi và nước cà chua.", "eng": "We have orange, apple, grapefruit and tomato juice."}, {"viet": "Cuối cùng chúng tôi đã thắng ván bài.", "eng": "We just managed to pull the game out of the fire."}, {"viet": "Chúng ta thực hiện những điều chỉnh nhỏ về giá vàng.", "eng": "We make minor adjustments in gold prices."}, {"viet": "Chúng tôi phải tuân thủ các nghi thức và tham dự lễ tang.", "eng": "We must observe the decencies and attend the funeral."}, {"viet": "Chúng tôi chống sự phân biệt dựa trên cơ sở tôn giáo.", "eng": "We oppose segregation on religious grounds."}, {"viet": "Chúng tôi sốt ruột ngồi đợi phim bắt đầu chiếu.", "eng": "We sat waiting impatiently for the film to start."}, {"viet": "Chúng tôi lên qua một lỗ hổng ở hàng rào.", "eng": "We squeezed through a gap in the hedge."}, {"viet": "Chúng tôi rất lo lắng chờ đợi ý kiến của bác sĩ.", "eng": "We waited in great suspense for the doctor's opinion."}, {"viet": "Chúng tôi đang hy vọng gặp cả đội hôm nay nhưng chỉ có năm cầu thủ có mặt.", "eng": "We were hoping for a full team today but only five players showed up."}, {"viet": "Chúng ta đã thắng trong cuộc đua, nhưng vất vả lắm.", "eng": "We won the race but it was a near thing."}, {"viet": "Ồ, tôi không bị mê hoặc bởi điều mà ông lầm tưởng đâu.", "eng": "Well, I'm not charmed by your ignorance."}, {"viet": "Ấy, ta sẽ làm những gì có thể đảm đương mà.", "eng": "Well, we do that can afford."}, {"viet": "Máy có trục trặc gì thế?.", "eng": "What's wrong with the engine?."}, {"viet": "Tối nay anh định làm gì hả Jun?", "eng": "What are you going to do tonight, Jun?"}, {"viet": "Bạn thấy thế nào nếu có được giấy phép kinh doanh bất động sản?", "eng": "What do you think about getting a real estate agent license?"}, {"viet": "North Island và South Island nghĩa là gì?", "eng": "What is North Island and South Island?"}, {"viet": "Chủ đề yêu thích của anh là gì?", "eng": "What is your favorite subject matter?"}, {"viet": "Có cái khả năng gì mà nó lại sẽ đề nghị nộp tiền phạt cho chúng ta?", "eng": "What price he'll offer to pay the fine for us?"}, {"viet": "Bạn thích đọc loại sách nào?", "eng": "What type of books do you like to read?"}, {"viet": "Anh nghĩ khi nào sẽ ra đi?", "eng": "When do you expect to leave?"}, {"viet": "Khi nhìn thấy chồng đĩa bẩn, tôi phát chán.", "eng": "When I saw the pile of dirty dishes, my heart sank."}, {"viet": "Đến giờ giải lao mọi người đi về phía quầy rượu.", "eng": "When the interval came everyone made for the bar."}, {"viet": "Nếu anh có bảo hiểm, anh được đảm bảo khi mất mát.", "eng": "When you're insured, you're secure against loss."}, {"viet": "Chiếc xe buýt này đi tới đâu?", "eng": "Where does this bus go to?"}, {"viet": "Nơi nào lạnh hơn, New York hay Chicago?", "eng": "Which is colder, New York or Chicago?"}, {"viet": "Rượu vang trắng tạo nên một thức kèm tuyệt hảo cho bữa ăn.", "eng": "White wine provided the perfect accompaniment to the meal."}, {"viet": "Ai là người đầu tiên bay lên bằng khí cầu?", "eng": "Who was the first man to make an ascent in a balloon?"}, {"viet": "Tại sao bạn không gọi điện cho bộ phận hỗ trợ khách hàng?", "eng": "Why don't you call customer support?"}, {"viet": "Liệu chúng ta có xuất bản được cuốn từ điển mới vào cuối năm không?", "eng": "Will we get the new dictionary out by the end of the year?"}, {"viet": "Giành được huy chương vàng còn là một niềm tự hào nữa của cô ta.", "eng": "Winning the gold medal was yet another feather in her cap."}, {"viet": "Không có sự bảo trợ của nhiều công ty lớn, cuộc liên hoan văn nghệ không thể tổ chức được.", "eng": "Without the patronage of several large firms, the festival could not take place."}, {"viet": "Bạn có muốn uống một ly rượu mạnh trước khi chúng ta bắt đầu không?", "eng": "Would you care to have a drink before dinner?"}, {"viet": "Anh có muốn xem con tàu bây giờ không?", "eng": "Would you like to see the ship now?"}, {"viet": "Vật lộn với một vấn đề, một khó khăn, với lương tâm của mình.", "eng": "Wrestle with a problem, a difficulty, one's conscience."}, {"viet": "Đúng vậy, tôi rất tự hào về nó.", "eng": "Yes, I'm really proud of it."}, {"viet": "Anh nên giữ mồm giữ miệng về chuyện này.", "eng": "You'd better keep your mouth shut about this."}, {"viet": "Nếu anh cứ để cái lò sưởi chạy liên tục anh sẽ tích lại một hoá đơn khí đốt khổng lồ.", "eng": "You'll run up a huge gas bill if you leave the heater on."}, {"viet": "Anh đã quên mua trứng! Lời nói vào tai này ra tai kia.", "eng": "You've forgotten to buy the eggs! It goes in one ear and out the other."}, {"viet": "Ông không thể làm ngơ trước một sự thật là nền kinh tế nước ta đang gặp khó khăn.", "eng": "You can't blink the fact that the country's economy is suffering."}, {"viet": "Anh có thể tự hào đã làm được một việc tốt.", "eng": "You can congratulate yourself on having done a good job."}, {"viet": "Anh không thể buộc cô ấy kín miệng lâu đâu, cô ấy không thể kiềm chế được!", "eng": "You cannot keep her quiet for long, she's irrepressible!"}, {"viet": "Anh lấy cần sa từ con trai anh sao?", "eng": "You got marijuana from your son?"}, {"viet": "Anh biết đấy, máy bay dân dụng siêu thanh mới của châu Âu đấy.", "eng": "You know, that new European supersonic airliner."}, {"viet": "Anh phải thích nghi với các chuẩn của xã hội mà anh đang sống.", "eng": "You must adapt to the norms of the society you live in."}, {"viet": "Anh không nên tưởng rằng tôi cũng cảm thấy tội lỗi như anh.", "eng": "You mustn't project your guilt on to me."}, {"viet": "Anh phải thấy xấu hổ vì đã nói dối như thế.", "eng": "You should be ashamed of yourself for telling such lies."}, {"viet": "Anh không thể hi vọng tìm được hạnh phúc hoàn mĩ-nó chỉ là ảo ảnh mà thôi.", "eng": "You shouldn't hope to find perfect happiness-it's just a will-o'the-wisp."}, {"viet": "Rồi chính anh sẽ phải quỳ gối trước ông giám đốc ngân hàng để được vay tiền.", "eng": "You will just have to grovel to the bank manager for a loan."}, {"viet": "Chữ ký duyệt của ông không phù hợp với chữ ký ở góc trên bên trái.", "eng": "Your countersign is not in agreement with the signature on the upper left corner."}, {"viet": "Câu chuyện của anh gần giống với những sự kiện chúng tôi được biết.", "eng": "Your story approximates to the facts that we already know."}]