[{"viet": "14, 21 và 28 là những bội số của 7.", "eng": "14, 21, and 28 are multiples of 7."}, {"viet": "Một con lạc đà có thể bắt đầu mang hàng hóa nặng khi nó được bốn tuổi.", "eng": "A camel can begin to carry heavy loads when it is 4 years old."}, {"viet": "Một sự hiểu thấu đáo những vấn đề.", "eng": "A clear understanding of the problems."}, {"viet": "Một quốc gia bị tê liệt do các cuộc cạnh tranh chính trị.", "eng": "A country paralysed by political rivalries."}, {"viet": "Một bản vẽ hoa hồng trên nền trắng.", "eng": "A design of pink roses on a white ground."}, {"viet": "Một hệ thống phân loại khá đơn sơ.", "eng": "A fairly simple system of classification."}, {"viet": "Một xí nghiệp có 500 công nhân viên trên bảng lương.", "eng": "A firm with 500 employees on the payroll."}, {"viet": "Tia sáng le lói xuyên màn sương.", "eng": "A glimmer of light through the mist."}, {"viet": "Một người khách đang gọi điện cho quán ăn Lệ Đô để đặt bàn.", "eng": "A guest is calling Lido Holiday Inn for booking a table."}, {"viet": "Một căn nhà gần nhà thờ, sông, đường xe lửa.", "eng": "A house by the church, river, railway."}, {"viet": "Một đám đông làm tắc nghẽn các hành lang và lối ra.", "eng": "A large crowd blocked the corridors and exits."}, {"viet": "Cô bé ngồi ở góc nhà, thổn thức khóc.", "eng": "A little girl was sitting and sobbing in the corner."}, {"viet": "Một người đàn ông đi ra ngoài đường cùng con chó.", "eng": "A man walked down the road with his dog."}, {"viet": "Một quốc vương có đặc quyền ân xá phạm nhân.", "eng": "A monarch has the prerogative of pardoning criminals."}, {"viet": "Một chái nhà mới được xây nối vào bệnh viện.", "eng": "A new wing has been annexed to the hospital."}, {"viet": "Một hộ chiếu quá hạn thì hết hiệu lực.", "eng": "A passport that is out of date is invalid."}, {"viet": "Một bản mô tả ngắn gọn về biến cố ấy.", "eng": "A pithy description of the event."}, {"viet": "Một ngữ pháp tiếng Anh theo các qui tắc ngôn ngữ.", "eng": "A prescriptive grammar of the English language."}, {"viet": "Nhịp tim đập 60 lần trong một phút.", "eng": "A rate of 60 pulsations per minute."}, {"viet": "Một căn phòng ngổn ngang những đồ đạc xấu xí.", "eng": "A room cluttered with ugly graceless furniture."}, {"viet": "Một bản án mười năm tù giam.", "eng": "A sentence of ten years imprisonment."}, {"viet": "Một hy vọng mong manh vẫn còn le lói trong anh ta.", "eng": "A slender hope still flickered within him."}, {"viet": "Một bài diễn văn đầy những điều thiếu mạch lạc.", "eng": "A speech full of inconsequent statements."}, {"viet": "Một dãy quầy dành cho một người phục vụ nước ngọt.", "eng": "A succession of one-man stalls offered soft drinks."}, {"viet": "Một lý thuyết thiếu sự nhất quán về nội dung.", "eng": "A theory which lacks internal consistency."}, {"viet": "Một máy đa năng với nhiều công dụng.", "eng": "A versatile machine with manifold uses."}, {"viet": "Một tấm lưới sắt ở phía trước chuồng gà.", "eng": "A wire mesh on the front of the chicken coop."}, {"viet": "Theo tỷ giá hối đoái hôm nay, tổng cộng là 304.000 yên.", "eng": "According to today's exchange rate, that will be ¥ 304,000."}, {"viet": "Các tờ quảng cáo đã dán khắp mọi nơi thông báo cuộc biểu diễn mới.", "eng": "Advertisements have been posted up everywhere announcing the new show."}, {"viet": "Sau vụ ly dị của anh ta, anh ta phải làm lại hoàn toàn cuộc đời của anh ấy.", "eng": "After his divorce, he had to rebuild his life completely."}, {"viet": "Sau thảm họa đó, các cuộc trắc nghiệm được tiến hành trên những tàu chở dầu cùng loại.", "eng": "After the disaster, tests were carried out on the tanker's sister vessels."}, {"viet": "Alan luôn luôn bị đối xử thô bạo ở trường.", "eng": "Alan's always getting cragged at school."}, {"viet": "Tất cả những người chính trực chắc chắn sẽ sửng sốt trước sự tàn bạo này.", "eng": "All right-minded people will be surely shocked by this outrage."}, {"viet": "Tất cả công việc nặng nhọc này đang ảnh hưởng đến ông ta.", "eng": "All this hard work is telling on him."}, {"viet": "Lòng ham thích mạnh mẽ của dân Mỹ đối với xe ôtô.", "eng": "America's love-affair with the automobile."}, {"viet": "Người ta cho mỗi cậu bé một trái táo.", "eng": "An apple was given to each of the boys."}, {"viet": "Một nhà hàng sang trọng, một trường tư đặc biệt.", "eng": "An exclusive restaurant, private school."}, {"viet": "Một hệ thống thủy lợi với các đập, các hồ chứa, và các kênh.", "eng": "An irrigation scheme with dams, reservoirs, and channels."}, {"viet": "Một vùng chưa được thám hiểm nên chưa được vẽ trên bản đồ.", "eng": "An unexplored country that hasn't been mapped."}, {"viet": "Và tốt hơn em nên nhắn một cú điện thoại tại bàn chỉ dẫn để họ gọi cho mình sáng mai.", "eng": "And you better leave a call it the front desk fori tomorrow morning."}, {"viet": "Dù sao thì đông trừng thảo cũng là một trong những loại thuốc bổ truyền thống của Trung Quốc.", "eng": "Anyway, caterpillar fungus is one of the traditional Chinese tonics."}, {"viet": "Ở nước bạn có nơi trú ngụ cho người vô gia cư không?", "eng": "Are there homeless shelters in your country?"}, {"viet": "Ông có ủng hộ việc rút tiền bọn người giàu có bằng cách đánh thuế nặng không?", "eng": "Are you in favour of soaking the rich?"}, {"viet": "Những sắp xếp cho buổi lễ đã được chuẩn bị.", "eng": "Arrangements for the ceremony have been put in train."}, {"viet": "Miễn là trời không mưa, chúng ta có thể chơi.", "eng": "As long as it doesn't rain we can play."}, {"viet": "Hãy yêu cầu được chuyển đường dây tới chính tôi.", "eng": "Ask to be put through to me personally."}, {"viet": "Cuối cuộc đua, anh ấy cảm thấy mệt lả.", "eng": "At the end of the race he felt all in."}, {"viet": "Những chú hươu cao cổ con dường như có cẳng rất dài.", "eng": "Baby giraffes seem to have such long legs."}, {"viet": "Bị xử tại tòa án quân sự vì lơ là nhiệm vụ.", "eng": "Be court-martialled for neglect of duty."}, {"viet": "Gõ nhịp ngón tay trên bàn.", "eng": "Beating a tattoo on the table with his fingers."}, {"viet": "So với việc làm trước đây của anh, lần này có vẻ khá tệ.", "eng": "Beside your earlier work this piece seems rather disappointing."}, {"viet": "Xương thú vật phơi trắng hếu trên sa mạc.", "eng": "Bones of animals bleaching in the desert."}, {"viet": "Những đối tác kinh doanh của Anh ở châu Âu.", "eng": "Britain's trading partners in Europe."}, {"viet": "Nhưng tôi rất muốn nói chuyện về ông cố củ anh.", "eng": "But I do want to talk about your great-grandfather."}, {"viet": "Nhưng đây không phải là xe buýt đi tham quan.", "eng": "But this isn't a sightseeing bus."}, {"viet": "Vào lúc đó thì chúng tôi dứt khoát là đã thua.", "eng": "By that time we were well and truly lost."}, {"viet": "Tôi có thể đổi chỗ với ông được không?", "eng": "Can I change seats with you?"}, {"viet": "Chúng ta có thể bỏ qua những nghi thức đó không?", "eng": "Can we dispense with the formalities?"}, {"viet": "Ông có thể làm cho tóc hai bên trông hơi phồng được không?", "eng": "Can you make both sides look kind of puffy?"}, {"viet": "Bạn có biết tôi cảm thấy thế nào không?", "eng": "Can you understand how I feel?"}, {"viet": "Một vài vấn đề lộ rõ ra ngay từ lúc đầu.", "eng": "Certain problems were apparent from the outset."}, {"viet": "Bọn trẻ con bị những người lính thô bạo giật mạnh ra khỏi tay các bà mẹ.", "eng": "Children were rent from their mother's arms by the brutal soldiers."}, {"viet": "Thợ mỏ than là loại người dẻo dai.", "eng": "Coal-miners are a tough breed."}, {"viet": "Hãy so sánh văn phong của hai bài thơ.", "eng": "Compare the style of the two poems."}, {"viet": "Sự lục đục liên tục giữa vợ chồng trong gia đình.", "eng": "Constant spousal warfare in the household."}, {"viet": "Mẹ có thể cho con đi nhờ xe đến trường được không?", "eng": "Could you give me a lift to school?"}, {"viet": "Ẵm đứa bé trong tay của ai.", "eng": "Cradle a child in one's arms."}, {"viet": "Những vũ nữ xoay tròn trong những chiếc váy xòe ra.", "eng": "Dancers spun in a swirl of skirts."}, {"viet": "Chính Denise và Martin trả tiền món đó.", "eng": "Denise and Martin paid for it themselves."}, {"viet": "Cô ta có buồn phiền về chuyện không xin được việc làm không?", "eng": "Did she mind about not getting the job?"}, {"viet": "Những điều luật như vậy đã quy định việc tính lãi tiền vay là bất hợp pháp phải không?", "eng": "Didn't such laws make it illegal to charge interest on loans?"}, {"viet": "Nhanh lên, đồ to xác đần độn!", "eng": "Do hurry up, your great lump!"}, {"viet": "Cô luôn luôn mang bánh sandwich đi xem pháo hoa à?", "eng": "Do you always bring sandwiches to the fireworks?"}, {"viet": "Ông có đặt phòng trước ở chỗ chúng tôi không, thưa ông?", "eng": "Do you have a reservation with us, sir?"}, {"viet": "Bạn có biết cách làm xirô từ nhựa cây phong không?", "eng": "Do you know how to make maple syrup?"}, {"viet": "Bạn có giấy chứng nhận hay giấy phép nào không?", "eng": "Do you possess any certificates or licenses?"}, {"viet": "Bạn có nghĩ đây là một ý kiến hay không?", "eng": "Do you think this is a good idea?"}, {"viet": "Có phải sự thâm niên cho ta quyền chỉ huy không?", "eng": "Does seniority give one the right to command?"}, {"viet": "Đừng có hà tiện đường quá!", "eng": "Don't be so stingy with the sugar!"}, {"viet": "Đừng có viện cớ vớ vẩn là nhức đầu; tôi biết anh không muốn đi dự buổi tiệc mà.", "eng": "Don't give me that rubbish about having headache; I know you don't want to go to the party."}, {"viet": "Đừng có giả bộ ngây thơ nữa, tụi tao biết mày đã ăn hết mớ bánh quy rồi.", "eng": "Don't put on that innocent look, we know you ate all the biscuits."}, {"viet": "Đừng có dùng toàn những đặc ngữ kỹ thuật đó, hãy cố gắng giải thích bằng tiếng Anh bình thường.", "eng": "Don't use all that technical lingo-try and explain in plain English."}, {"viet": "Uống rượu được biết là có hại.", "eng": "Drinking is known to be harmful."}, {"viet": "Kiếm sống bằng việc dạy học.", "eng": "Earn one's livelihood by teaching."}, {"viet": "Được hưởng một sức khoẻ tốt.", "eng": "Enjoy a high standard of good health."}, {"viet": "Bất kỳ lúc nào anh ấy rảnh anh ấy đều chơi gôn.", "eng": "Every moment he has to spare, he spends it playing golf."}, {"viet": "Xin lỗi, các cô có bàn ủi và bàn để ủi quần áo không?", "eng": "Excuse me, do you have an iron and an ironing board?"}, {"viet": "Những phương tiện quan trọng cho đường lối hành động của lực lượng Mỹ tại Thái Bình Dương.", "eng": "Facilities that are vital to the projection of US force in the Pacific."}, {"viet": "Cảm thấy bị say sóng vì sóng ngầm mạnh.", "eng": "Feel seasick in the heavy swell."}, {"viet": "Lính cứu hỏa đã sử dụng kìm cứu hộ banh rộng xe để đưa người lái và hành khách ra.", "eng": "Firefighter used the jaws of life to remove the operator and the passenger."}, {"viet": "Bay trên các mái nhà của thành phố.", "eng": "Fly above the roofs of the city."}, {"viet": "Thì cũng như người Mỹ thích đọc mục truyện tranh trên báo ấy mà.", "eng": "For the same reason that American men read co strip in the newspaper."}, {"viet": "Từ địa vị cao của ông ta trong công ty.", "eng": "From his exalted position in the firm."}, {"viet": "Sự bình đẳng chủng tộc thật sự dường như vẫn còn quá xa vời.", "eng": "Genuine racial equality still seems light-years away."}, {"viet": "Cho tôi một cây viết-cây nào cũng được.", "eng": "Give me a pen-any pen will do."}, {"viet": "Đi vào công viên vẽ phác họa.", "eng": "Go into the park to sketch flowers."}, {"viet": "Sự phản đối của những người dân thường đối với chính sách của đảng đó.", "eng": "Grass-roots opposition to the party's policy."}, {"viet": "Công việc nặng nhọc luôn giúp anh quên đi những vấn đề gia đình.", "eng": "Hard work always takes your mind off domestic problems."}, {"viet": "Anh có số liệu thống kê nào hậu thuẫn cho lý lẽ của anh được không?", "eng": "Have you any statistics that would enforce your argument?"}, {"viet": "Anh có tiền mặt hay chúng mình sẽ dùng thẻ tín dụng?", "eng": "Have you got any cash or shall we use plastic?"}, {"viet": "Có sáu con và không có thu nhập nào, tôi đã ở vào hoàn cảnh thật tồi tệ.", "eng": "Having six children and no income, I was badly situated."}, {"viet": "Anh ta luôn quấy rầy tôi để vay tiền.", "eng": "He's always bothering me to lend him money."}, {"viet": "Anh ta chối là không có vấn đề với cô thư ký, nhưng quả là không có lửa sao có khói.", "eng": "He's denied having an affair with his secretary, but of course there's no smoke without fire."}, {"viet": "Nó si mê bà giáo dạy sinh học, nhưng đó chỉ là mối tình trẻ con.", "eng": "He's mad about his biology teacher, but it's only puppy-love."}, {"viet": "Anh ấy đang học lớp bảo quản xe ô tô.", "eng": "He's taking classes in car maintenance."}, {"viet": "Ông ta luôn luôn có một sự dè dặt nào đó trong việc thảo luận những vấn đề cá nhân.", "eng": "He always displays a certain reticence in discussing personal matters."}, {"viet": "Ông ta bắt đầu suy xét về những thể thức ký kết.", "eng": "He began to speculate on the modalities of signing."}, {"viet": "Anh ta gặp rắc rối với cảnh sát địa phương.", "eng": "He came up against the local police."}, {"viet": "Nó đến thăm chúng tôi mỗi tuần một lần.", "eng": "He comes to see us once a week."}, {"viet": "Anh ấy dè bỉu những cố gắng của cô như là phí thời giờ vô ích.", "eng": "He decried her efforts as a waste of time."}, {"viet": "Hắn không thỏa mãn với công việc hiện tại.", "eng": "He doesn't feel really fulfilled in his present job."}, {"viet": "Ông ta thể hiện sự thiếu quan tâm hoàn toàn đến đứa con.", "eng": "He exhibited total lack of concern for the child."}, {"viet": "Anh ta nhìn cô ta trừng trừng.", "eng": "He fixed her with an angry stare."}, {"viet": "Anh ấy kiếm được 25.000 bảng Anh mỗi năm.", "eng": "He gets £ 25,000 a year."}, {"viet": "Ông ta đã là giám đốc đề án này ngay từ lúc nó bắt đầu.", "eng": "He had been director of the project since its inception."}, {"viet": "Anh ta làm bánh ngọt rất khéo tay.", "eng": "He has a light hand with pastry."}, {"viet": "Anh ta có những ý tưởng vượt quá địa vị của mình.", "eng": "He has ideas above his station."}, {"viet": "Anh ta ghét công việc này-nhưng anh ta đã nhất quyết tiếp tục làm nó đến cùng vì anh ta cần tiền.", "eng": "He hates the jobs-but he's determined to stick it out because he needs the money."}, {"viet": "Anh ấy nói được hai thứ tiếng Pháp và Tây Ban Nha.", "eng": "He is bilingual in French and Spanish."}, {"viet": "Anh ta lớn hơn tôi mười tuổi.", "eng": "He is ten years senior to me."}, {"viet": "Anh ta vui lòng cho tôi được tự do dùng thư viện của anh ấy cho việc nghiên cứu của tôi.", "eng": "He kindly made me free of his library for my research."}, {"viet": "Anh ta sống ở phía đông thị trấn Exeter.", "eng": "He lives to the east of Exeter."}, {"viet": "Nó ghi chú lung tung trên trang giấy.", "eng": "He made notes anyhow across the page."}, {"viet": "Thực ra hắn không bao giờ nói dối, nhưng hắn thường hành động gần như bất hợp pháp.", "eng": "He never actually tells lies, but he often sails pretty near to the wind."}, {"viet": "Ông ấy thực hiện công việc đó với kỹ năng điêu luyện.", "eng": "He performed the job with practiced skill."}, {"viet": "Anh ta hứa đến vào giờ này giờ nọ nhưng luôn luôn đến chậm.", "eng": "He promises to come at such-and-such a time but is always late."}, {"viet": "Ông ấy đọc nó với một sự thích thú đặc biệt.", "eng": "He read in with particularly great interest."}, {"viet": "Anh ta quyết tâm sống tốt hơn trong tương lai.", "eng": "He resolved to lead a better life in future."}, {"viet": "Anh ta là một thành viên có khả năng của đội.", "eng": "He's a useful member of the team."}, {"viet": "Anh ta dạy tiếng Pháp cho cô ta để đổi lại việc cô ta dạy tiếng Anh cho anh ta.", "eng": "He's giving her French lessons in exchange for her teaching him English."}, {"viet": "Anh ta không có khả năng đóng vai Othello.", "eng": "He's not up to the part of Othello."}, {"viet": "Anh ta nói là anh ta không sợ nhưng giọng nói của anh ta thiếu tự tin.", "eng": "He said he wasn't frightened but his voice lacked conviction."}, {"viet": "Dường như nó mong được phục vụ tối đa.", "eng": "He seemed to expect to be waited on hand and foot."}, {"viet": "Anh ta chứng tỏ sự quan tâm của mình đối với người mẹ đau ốm bằng nhiều sự săn sóc tử tế của mình.", "eng": "He showed his concern for his sick mother by his many little attentions."}, {"viet": "Nó đã trải qua 10 năm làm thủy thủ.", "eng": "He spent ten years before the mast."}, {"viet": "Ông ấy đứng lên để chỉ ra rằng cuộc tiếp kiến đã hết.", "eng": "He stood up to show that the audience was over."}, {"viet": "Anh ta không thận trọng trong công việc của mình.", "eng": "He takes no pride in his work."}, {"viet": "Anh ta liếc nhìn nhanh cuối cuốn sách để kiểm tra lại câu trả lời.", "eng": "He took a peep at the back of the book to check the answer."}, {"viet": "Anh ta cố gắng đút bàn chân to bè vào giày mới.", "eng": "He tried to shoehorn his big feet into the new shoe."}, {"viet": "Anh ta sốt ruột bồn chồn đợi cô ấy đến.", "eng": "He waited for her arrival in a fever of impatience."}, {"viet": "Sau trận ốm, anh ta chỉ còn da bọc xương.", "eng": "He was all skin and bone after his illness."}, {"viet": "Nó bị bắt quả tang ngay khi ăn cắp.", "eng": "He was caught in the very act of stealing."}, {"viet": "Nó được miễn truy tố vì quá trẻ.", "eng": "He was exempt from charges by virtue of being so young."}, {"viet": "Nó đã chết trong Thế chiến thứ hai.", "eng": "He was killed in World War Two."}, {"viet": "Người ta đã không xét trường hợp của ông ta để đề bạt người trẻ hơn.", "eng": "He was passed over in favour of a younger man."}, {"viet": "Nó dồn hết thời gian vào giảng dạy khi mà nó lại mong mỏi được làm công việc nghiên cứu khoa học.", "eng": "He was spending all his time on teaching, whereas he yearned to do research work."}, {"viet": "Anh ta rất giỏi biện bạch cho sự chậm trễ của mình.", "eng": "He was very adept at making excuse for his lateness."}, {"viet": "Anh ta chở họ vút đi trên chiếc ôtô thể thao mới của mình.", "eng": "He whirled them off in his new sports car."}, {"viet": "Nó đã gạt bạn hàng của mình ra khỏi công ti.", "eng": "He wormed his partner out of the business."}, {"viet": "Những người thừa kế đã vội vã xâm nhập vào bất động sản của người đàn ông giàu có.", "eng": "Heirs descended upon the rich man's estate."}, {"viet": "Thái độ của bà ta đối với tôi chứng tỏ bà ấy không thích tôi.", "eng": "Her behavior towards me shows that she doesn't like."}, {"viet": "Lối khiêu vũ của cô ta làm sinh động trở lại phong cách cổ điển.", "eng": "Her dancing reanimates the classical style."}, {"viet": "Cha nàng cúp cấp dưỡng cho nàng.", "eng": "Her father cut off her allowance."}, {"viet": "Nhà cô ấy ở xa vì thế chúng tôi không thường gặp cô ấy.", "eng": "Her home is far away, so we don't often see her."}, {"viet": "Ngành của cô ấy chuyên về bán hơn là sản xuất.", "eng": "Her line is more selling than production."}, {"viet": "Những nhận xét xúc phạm của cô ấy không chấp nhận được.", "eng": "Her outrageous remarks were beyond all reason."}, {"viet": "Sự thỉnh cầu đóng góp của bà ta bị cự tuyệt.", "eng": "Her request for the donation met with a repulse."}, {"viet": "Gợi ý của cô ta làm tôi hoàn toàn bất ngờ.", "eng": "Her suggestion fairly took me by surprise."}, {"viet": "Vé đây, đừng đánh mất đấy.", "eng": "Here are, the tickets, don't lose them."}, {"viet": "Giọng nói của ông ấy chứng tỏ ông là người Xcốtlen.", "eng": "His accent proclaimed him that he was a Scot."}, {"viet": "Tư cách của anh ta từ trước tới nay không hợp đạo lý cho lắm.", "eng": "His behaviour has not been strictly ethical."}, {"viet": "Lời nhận xét của ông ta thật vui nhộn nhưng thật không may là không thích hợp để trích dẫn.", "eng": "His comments were hilarious but unfortunately not quotable."}, {"viet": "Tiếng Anh của anh ta tiến bộ dần.", "eng": "His English is improving little by little."}, {"viet": "Câu trả lời đầu tiên của nó là không, tuy vậy, sau đó nó đã thay đổi ý kiến.", "eng": "His first response was to say no, later, however he changed his mind."}, {"viet": "Tư tưởng của ông ta đi trước thời đại của mình.", "eng": "His ideas were way ahead of his time."}, {"viet": "Văn phong của anh ta hãy còn phần nào thiếu trau chuốt.", "eng": "His literary style is still rather raw."}, {"viet": "Cách cư xử tùy tiện của anh ta làm tôi nổi giận.", "eng": "His offhand manner put my back up."}, {"viet": "Lời tuyên bố quan tâm của ông ta có vẻ không chân thành.", "eng": "His profession of concern did not seem sincere."}, {"viet": "Ván trượt tuyết của anh ta ngoắc vào nhau và anh ta ngã ngồi xuống trông rất vụng về.", "eng": "His skis crossed and he sat down in a most undignified manner."}, {"viet": "Những câu chuyện hồi hộp của ông ta đúng là đọc vô cùng thú vị.", "eng": "His thrillers make enthralling reading."}, {"viet": "Công việc của anh ta thì không tốt lắm.", "eng": "His work isn't up to much."}, {"viet": "Anh yêu, anh quả đúng là người thích ăn cá ngừ.", "eng": "Honey, you are really a tuna lover."}, {"viet": "Dạo này anh làm ăn ra sao?", "eng": "How are you getting along these days?"}, {"viet": "Buổi hòa nhạc tiến triển ra sao?", "eng": "How did the concert go off?"}, {"viet": "Làm thế nào để được nhận vào ở căn hộ Nhà nước?", "eng": "How does one gain admission to the State Apartments?"}, {"viet": "Gửi thư bằng đường hàng không đến Chicago sẽ mất bao lâu?", "eng": "How long will it take to Chicago by airmail?"}, {"viet": "Có bao nhiêu máy bay trên tàu?", "eng": "How many planes are there on the ship?"}, {"viet": "Bạn đã tiêu xài bao nhiêu tiền?", "eng": "How much money did you spend?"}, {"viet": "Tuy nhiên, do tính chất quân sự trong việc kinh doanh của chúng tôi nên tất cả các nhân viên của chúng tôi phải là công dân Mỹ.", "eng": "However, the military nature of our business makes it necessary that all of our employees be U. S. citizens."}, {"viet": "Tôi có lẽ giữ lại căn nhà đó trong lúc này, giá nhà bây giờ đang tăng mạnh.", "eng": "I'd hold on to that house for the time being, house prices are rising sharply at the moment."}, {"viet": "Tôi đã gặp Ann trước rồi, nhưng bạn cô ấy thì hoàn toàn là người lạ đối với tôi.", "eng": "I'd met Ann before, but her friend was a complete stranger to me."}, {"viet": "Tôi sẽ biếu họ mấy quả bí mới hái ở ngoài vườn.", "eng": "I'll go get them some squash from the garden."}, {"viet": "Tôi sẽ cho anh xem chúng và kể thêm cho anh nghe về chuyến đi của tôi.", "eng": "I'll show them to you and tell you more about my trip."}, {"viet": "Tôi e rằng màu sẽ thôi ra khi tôi giặt chiếc váy mới của cô.", "eng": "I'm afraid the colour ran when I washed your new skirt."}, {"viet": "Tôi về nhà đây-tôi đã làm xong chỉ tiêu công việc của tôi trong ngày.", "eng": "I'm going home now-I've done my quota of work for the day."}, {"viet": "Tôi cố giữ khỏi mắc nợ, mặc dù tôi không làm ra nhiều tiền.", "eng": "I'm managing to keep my head above water, though I'm not earning much."}, {"viet": "Tôi hoàn toàn hạnh phúc-tôi sẽ không đánh đổi hoàn cảnh cho bất cứ ai.", "eng": "I'm perfectly happy-I wouldn't change places with anyone."}, {"viet": "Tôi vẫn còn hơi khàn giọng sau cơn cảm lạnh gần đây.", "eng": "I'm still a bit husky after my recent cold."}, {"viet": "Tôi thường rỗi vào khoảng từ thứ ba đến thứ năm.", "eng": "I'm usually free between Tuesday and Thursday."}, {"viet": "Tôi đã cưỡi xe đạp đi trên các đường mòn này 40 năm rồi.", "eng": "I've been riding these trails for 40 years."}, {"viet": "Tôi đã đặt mua hai cuốn sách ở hiệu sách.", "eng": "I've got two books on order at the book shop."}, {"viet": "Tôi chỉ mới vào đại học được có một tuần, cho nên chưa thích nghi được với lề thói thường ngày.", "eng": "I've only been at university for a week, so I haven't got into the swing of things yet."}, {"viet": "Tôi thừa nhận tôi thiên vị, nhưng tôi nghĩ buổi biểu diễn của con trai tôi là xuất sắc.", "eng": "I admit I'm biased, but I think my son's performance was brilliant."}, {"viet": "Tôi nghi ngờ tính thích đáng của việc thừa nhận một yêu cầu như thế.", "eng": "I am doubtful about the propriety of granting such a request."}, {"viet": "Tôi thông cảm là bạn có thể có những cam kết trước rồi.", "eng": "I appreciate that you may have prior commitments."}, {"viet": "Tôi đánh cuộc là tôi chạy nhanh hơn anh'.'Tôi nhận đánh cuộc đấy'.", "eng": "I bet I can run faster than you.''I'll take you up on that.'."}, {"viet": "Tôi không thể nhảy theo nhạc nếu không có nhịp điệu tốt.", "eng": "I can't dance to music without a good rhythm."}, {"viet": "Tôi không thể đậy nắp va li lại khi va li đầy như thế.", "eng": "I can't shut the suitcase lid when it's so full."}, {"viet": "Tôi chỉ có thể di chuyển cái đó với sự giúp đỡ của anh.", "eng": "I can only move it with your help."}, {"viet": "Tôi không thể tiết lộ ai đã nói cho tôi biết.", "eng": "I can't reveal who told me."}, {"viet": "Tôi không bao giờ có thể giải được các phương trình tương thích.", "eng": "I could never do simultaneous equations."}, {"viet": "Tôi muốn tham gia vào kế hoạch này.", "eng": "I'd like to be in on the scheme."}, {"viet": "Tôi không ưa cái cách nhìn xét nét của hắn trước khi nói chuyện với tôi.", "eng": "I didn't like the way he looked me up and down before speaking to me."}, {"viet": "Tôi không phải không thích bản thân môn thể thao-mà đúng là tôi nghĩ rằng nó chẳng qua là sự lãng phí thời gian.", "eng": "I don't dislike sport qua sport-I just think it's rather a waste of time."}, {"viet": "Tôi không ưa John, hắn luôn luôn khoác lác.", "eng": "I don't like John, he is always boasting."}, {"viet": "Tôi không thể hiểu nổi thế hệ trẻ ngày nay.", "eng": "I don't understand the younger generation these days."}, {"viet": "Tôi không biết nữa, hoàn toàn do đùa bỡn thôi.", "eng": "I don't know, pure whimsy."}, {"viet": "Thỉnh thoảng vào buổi tối tôi thích ra ngoài đi xem hát.", "eng": "I enjoy an occasional night out at the theatre."}, {"viet": "Hôm qua tôi ngã xe đạp-vì vậy bị bầm tím.", "eng": "I fell off my bike yesterday-hence the bruises."}, {"viet": "Tôi tìm thấy một cái đinh cắm vào lốp xe.", "eng": "I found a nail sticking in the tire."}, {"viet": "Trên đường đi về nhà tôi bị mắc một trận mưa to.", "eng": "I got caught in the deluge on the way home."}, {"viet": "Tôi đã có hẹn với John, nhưng anh ấy không có mặt.", "eng": "I had an appointment with John, but he never showed up."}, {"viet": "Hầu như không bao giờ tôi có cơ hội để đi.", "eng": "I hardly ever get a chance to go."}, {"viet": "Tôi phải khất lại tiền thuê nhà.", "eng": "I have fallen into arrears with my rent."}, {"viet": "Tuần tới tôi có vài cuộc hẹn.", "eng": "I have several engagements for next week."}, {"viet": "Tôi không nghe thấy tiếng líu lo của bọn trẻ cả tiếng đồng hồ rồi.", "eng": "I haven't heard a peep out of the children for an hour."}, {"viet": "Tôi nghe nói Canada có hơn 2 triệu hồ nước.", "eng": "I heard that Canada has over two million lakes."}, {"viet": "Tôi hy vọng anh không phiền lòng ( vì câu chuyện của tôi ).", "eng": "I hope you're not getting bored ( by my conversation )."}, {"viet": "Tôi để từ điển trên bàn để tra cứu.", "eng": "I keep the dictionary on my desk for reference."}, {"viet": "Tôi bỏ quên chìa khoá trong phòng.", "eng": "I left my key in the room."}, {"viet": "Tôi sống trong niềm kính sợ cha tôi cho đến khi ít ra tôi đã được mười lăm tuổi.", "eng": "I lived in awe of my father until I was at least fifteen."}, {"viet": "Tôi sẽ uống một cốc rượu gin pha thuốc bổ.", "eng": "I'll have a gin and tonic."}, {"viet": "Tôi coi khinh hành vi của anh ta.", "eng": "I look on his behaviour with contempt."}, {"viet": "Tháng tới tôi sẽ lập gia đình.", "eng": "I'm getting married next month."}, {"viet": "Chính tôi cũng chẳng ưa măng tây nhiều đâu.", "eng": "I'm not much of an asparagus lover myself."}, {"viet": "Tôi đang cố trau dồi vốn ngữ pháp của mình.", "eng": "I'm trying to improve my grammar."}, {"viet": "Tôi lẫn lộn ngày tháng và đã đến muộn mất ba ngày.", "eng": "I muddled up the dates and arrived three days late."}, {"viet": "Tôi cần một bàn vào tối thứ bảy.", "eng": "I need a table for Saturday night."}, {"viet": "Tôi có món súp này bằng cách nấu một tách nước trong lò viba và trộn với nước dùng.", "eng": "I obtained this soup by nuking one cup of water and mixing that with bouillon."}, {"viet": "Tôi thích là áo sơ mi lúc chúng còn ẩm.", "eng": "I prefer to iron my shirts while they are still damp."}, {"viet": "Tôi quả thực thích vở kịch đó-thật là một tác phẩm tuyệt vời.", "eng": "I really enjoyed the play-what an excellent production."}, {"viet": "Tôi đã yêu cầu một chỗ ngồi ở khu vực không hút thuốc nhưng chỗ ngồi hiện tại của tôi là một chỗ ở khu vực hút thuốc.", "eng": "I requested a non-smoking seat, but I am in a smoking seat."}, {"viet": "Tôi gặp anh ta hàng ngày trên tàu hỏa nhưng chúng tôi chưa quen thân đến mức có thể nói chuyện với nhau.", "eng": "I see him on the train every day but we're not on speaking terms."}, {"viet": "Tôi xin đề nghị nâng cốc chúc mừng cô dâu và chú rể.", "eng": "I should like to propose a toast to the bride and bridegroom."}, {"viet": "Tôi cất giữ tất cả khoai tây của vườn.", "eng": "I stored all the potatoes from the garden."}, {"viet": "Tôi nghĩ lần tới anh ấy phải học chăm chỉ hơn.", "eng": "I think he has to study harder next time."}, {"viet": "Tôi nghĩ một ai khác nên làm điều đó.", "eng": "I think someone else should do it."}, {"viet": "Tôi nghĩ nó thật là thú vị.", "eng": "I thought it was really entertaining."}, {"viet": "Tôi cố bán cho hắn cái xe cũ của tôi, nhưng hắn không bị cắn câu.", "eng": "I tried to sell him my old car, but he wouldn't bite."}, {"viet": "Tôi đã nghe nói rất nhiều về ông.", "eng": "I've heard so much about you."}, {"viet": "Tôi muốn đến số 345 ngõ Riverside.", "eng": "I want to go to 345 Riverside Drive."}, {"viet": "Tôi ngạc nhiên về sự hiểu biết sâu rộng của anh ta.", "eng": "I was amazed at the extent of his knowledge."}, {"viet": "Bị thúc giục quá nên tôi đã có một quyết định không khôn ngoan.", "eng": "I was hurried into making an unwise decision."}, {"viet": "Tôi quá mải mê trong công việc đến nỗi hoàn toàn quên mất thời gian.", "eng": "I was so engrossed in my work that I completely forgot the time."}, {"viet": "Tôi thật không phải, tôi muốn nói đó là chuyện đùa thôi.", "eng": "I wasn't serious, I meant it as a joke."}, {"viet": "Ước gì tôi biết được mánh khoé của bà ta.", "eng": "I wish I knew what her game is."}, {"viet": "Tôi tự hỏi anh có thể liên hệ với ngân hàng phát hành hay không?", "eng": "I wonder if you could get in touch with the issuing bank?"}, {"viet": "Cho tôi món này và món này.", "eng": "I would like this and this."}, {"viet": "Tôi không nuôi một ý tưởng điên rồ như vậy.", "eng": "I wouldn't entertain such an outrageous idea."}, {"viet": "Nếu những cuộc thảo luận tiến triển một cách đúng đắn, các công ti sẽ sát nhập với nhau.", "eng": "If discussions shape up properly, the companies will merge."}, {"viet": "Nếu nạn lạm phát gia tăng mạnh thì các lãi suất có thể tăng lên.", "eng": "If inflation heats up, interest rates could increase."}, {"viet": "Nếu bàn là quá nóng, anh sẽ làm áo kia bị cháy sém.", "eng": "If thee iron is too hot you'll singe that dress."}, {"viet": "Nếu cậu thô lỗ với ông ấy như vậy sẽ có hại đến việc đề bạt của cậu.", "eng": "If you're rude to him it may jeopardize your chances of promotion."}, {"viet": "Nếu anh không trả tiền hóa đơn họ sẽ cắt nguồn điện và ga của anh.", "eng": "If you don't pay your bills they'll disconnect your electricity and gas."}, {"viet": "Nếu bạn trả tiền đặt cọc bây giờ, bạn có thể trả phần còn lại vào tháng sau.", "eng": "If you pay the deposit now, you can pay the balance next month."}, {"viet": "Nếu anh không lái xe đưa em đi, em sẽ phải đi bộ đến đó.", "eng": "If you won't drive me, I'll have to get there on shank's pony."}, {"viet": "Hai tuần lễ nữa là sẽ xong.", "eng": "In another two weeks it'll be finished."}, {"viet": "Những năm cuối đời, bà ta dành toàn bộ thời gian vào việc viết văn.", "eng": "In her later years she gave herself over to writing full-time."}, {"viet": "Nhìn lại thì dễ thấy được tại sao chúng ta đã sai lầm.", "eng": "In retrospect, it's easy to see why we were wrong."}, {"viet": "Trong bóng tối, tôi chỉ có thể nhận ra được hình dáng của toà nhà mà thôi.", "eng": "In the gloom I could only just discern the outline of a building."}, {"viet": "Trong chương trình ngày hôm nay ba nghệ sĩ nổi tiếng nói chuyện với Chủ tịch Hàn Lâm viện.", "eng": "In today's programme, three well-known artists are in conversation with the President of the Academy."}, {"viet": "Những buổi phát tin tức quốc tế mở cho ta cửa sổ nhìn ra thế giới.", "eng": "International news broadcasts provide a window on the world."}, {"viet": "Nhà tù phải chăng là hình phạt tốt nhất để ngăn chặn một tội ác như thế này?", "eng": "Is prison the best sanction against a crime like this?"}, {"viet": "Có điều gì bạn muốn bàn đến không?", "eng": "Is there anything you would like to talk about?"}, {"viet": "Thật là một điều an ủi khi biết cô ấy bình an.", "eng": "It's a comfort to know that she is safe."}, {"viet": "Xin cho cả gia đình tôi ở lại thật là đòi hỏi ở anh quá nhiều.", "eng": "It's asking rather a lot of you to have my whole family to stay."}, {"viet": "Đã muộn rồi, tốt hơn hết là chúng ta quay lại và đi về nhà.", "eng": "It's getting late, we'd better turn and make for home."}, {"viet": "Kéo tóc em gái con như thế là nghịch.", "eng": "It's naughty to pull your sister's hair."}, {"viet": "Cố giữ bí mật tình bạn của cô thì thật là vô nghĩa-chuyện ấy ai cũng biết cả rồi.", "eng": "It's pointless trying to keep your friendship secret-it's common knowledge already."}, {"viet": "Đã đến lúc chúng tôi phải đi rồi.", "eng": "It's time we were going to go."}, {"viet": "Nó có thể bay từ New york đến Luân Đôn trong ba tiếng rưỡi.", "eng": "It can fly from New York to London in three and a half hours."}, {"viet": "Đó là một loại bánh pítsa, bên trong có xúc xích cay, thịt bò, thịt heo, hành tây, ớt xanh và nấm.", "eng": "It is a pizza with pepperoni, beef, pork, onion, green pepper and mushroom."}, {"viet": "Bây giờ là nửa đêm và chúng tôi dừng chương trình tại đây.", "eng": "It is midnight and we are now closing down."}, {"viet": "Đây không phải là một con chim hiếm mà chỉ là một con chim sẻ thường thấy.", "eng": "It isn't a rare bird, just a common or garden sparrow."}, {"viet": "Cần phải chấm dứt ngay việc cung cấp phúc lợi cho người nghèo khoẻ mạnh.", "eng": "It requires an immediate end to welfare for the able-bodied poor."}, {"viet": "Tôi nay ở đây thật đẹp.", "eng": "It's so beautiful here tonight."}, {"viet": "Điều làm tôi suy nghĩ là không ai tán thành những sự thay đổi đó.", "eng": "It strikes me that nobody is in favour of the changes."}, {"viet": "Cá tính đó dường như có trong máu anh ta.", "eng": "It was a trait that seemed to be in the blood."}, {"viet": "Đó là một tiếng sét ái tình.", "eng": "It was love at first sight."}, {"viet": "Cô ta từ chối không giúp đỡ thật là trái thói quá.", "eng": "It was very disobliging of her to refuse to help."}, {"viet": "Tôi sẽ chết mất nếu thấy nàng đi với hắn.", "eng": "It would finish me off to see her with him."}, {"viet": "Joe đi vào luôn mồm phàn nàn là bên ngoài lạnh quá.", "eng": "Joe came in griping about how cold it was outside."}, {"viet": "Nếu nói cho chính xác thì trong lời tuyên bố của vị bộ trưởng có hai điểm sai.", "eng": "Just for the record, the ministers'statement is wrong on two points."}, {"viet": "Năm ngoái giá trị hàng xuất khẩu vượt hơn hàng nhập khẩu export.", "eng": "Last year export exceeded import in value."}, {"viet": "Ông cho tôi xem bằng lái.", "eng": "Let me see your driver's license."}, {"viet": "Hãy nhìn xem con vượn mẹ chăm sóc con nó ra sao.", "eng": "Look how the mother chimpanzee cares for her young."}, {"viet": "Nhiều người ở Nhật Bản có những bằng cấp mà họ không sử dụng đến.", "eng": "Many people in Japan have qualifications that they do not utilize."}, {"viet": "Mary ôm chặt con búp bê của nó vào ngực.", "eng": "Mary was clutching her doll to her chest."}, {"viet": "Tôi có thể nhận tin nhắn được không?", "eng": "May I take a message, please?"}, {"viet": "Hầu hết ong mật và ong bắp cày là loài côn trùng sống thành đàn.", "eng": "Most bees and wasps are social insects."}, {"viet": "Ông Prescott là một người chơi gôn nổi tiếng đấy.", "eng": "Mr. Prescott is a well-known golfer."}, {"viet": "Đầu óc tôi quay cuồng trước sự phức tạp của các tính toán.", "eng": "My brain swam at the complexity of the calculations."}, {"viet": "Sản phẩm bánh sôcôla đầu tiên tôi thử làm có vị thật là khủng khiếp.", "eng": "My first attempt at a chocolate cake horrible."}, {"viet": "Các bắp thịt của tôi vẫn còn săn cứng do bơi lội.", "eng": "My muscles are still stiff from the swim yesterday."}, {"viet": "Tôi được biết là chúng ta thường gặp nhau ở đây.", "eng": "My understanding was that we would meet here."}, {"viet": "Những máy tính cá nhân mới được sản xuất ra hầu như hàng ngày.", "eng": "New personal computers are brought out almost daily."}, {"viet": "Không, không phải, và như vậy là tôi được sửa rồi.", "eng": "No, it's not, and I stand corrected."}, {"viet": "Nó không đói là cũng phải thôi vì nó đã ăn kẹo suốt cả ngày.", "eng": "No wonder he is not hungry, he has been eating sweets all day."}, {"viet": "Bây giờ thì chúng ta có thể thấy thoải mái rồi.", "eng": "Now we can make ourselves comfortable."}, {"viet": "Ồ, tôi chắc rằng anh ấy có thể đảm đương được.", "eng": "Oh, I'm sure he can cope."}, {"viet": "Người già cần sự quan tâm yêu thương và chăm sóc.", "eng": "Old people need loving care and attention."}, {"viet": "Một câu lạc bộ lấy mất hội viên của một câu lạc bộ khác.", "eng": "One club was poaching member from another."}, {"viet": "Một ông Tim Smith nào đó đã gọi điện thoại để gặp ông nhưng ông đi vắng.", "eng": "One Tim Smith called to see you but you were out."}, {"viet": "Tai chúng tôi quen dần với tiếng ồn của nhà máy mới ở gần bên.", "eng": "Our ears are becoming attuned to the noise of the new factory nearby."}, {"viet": "Những người đàn ông của dân tộc chúng ta đã hy sinh trên chiến trường.", "eng": "Our nation's manhood died on the battlefield."}, {"viet": "Quân đội của chúng ta chỉ gặp những kháng cự chiếu lệ.", "eng": "Our troops encountered only token resistance."}, {"viet": "Bữa tiệc bắt đầu vào 8 giờ, nhưng đừng có cố sống cố chết mà đến.", "eng": "Party's at eight, but don't kill yourself getting here."}, {"viet": "Mọi người nghĩ ông Allen điên rồ vì ông ta trò chuyện với cây cối của ông ta.", "eng": "People think Mr Allen is bananas because he talks to his plants."}, {"viet": "Xin vui lòng bán những sản phẩm mới này với giá tốt nhất có thể được cho chúng tôi.", "eng": "Please sell these new products at the best possible price for us."}, {"viet": "Khả năng: Một chứng chỉ kinh doanh, 2 năm tại Cao đẳng kĩ thuật.", "eng": "Qualifications: a certificate in business studies, two years at a technical college."}, {"viet": "Các nhà khoa học đã có nhiều phát hiện quan trọng.", "eng": "Scientists have made many important discoveries."}, {"viet": "Chúng ta sẽ đi ra ngoài ăn tối nhé?", "eng": "Shall we go out for dinner?"}, {"viet": "Cô ta lúc nào cũng là người hay cáu kỉnh.", "eng": "She's always been an edgy type of person."}, {"viet": "Cô ta chán ngấy cứ phải làm đầy tớ cho ông chồng của cô ấy.", "eng": "She's fed up with being her husband's stooge."}, {"viet": "Cô ấy chẳng phải là người nhút nhát-luôn luôn sẵn sàng lớn tiếng bảo vệ mình.", "eng": "She's no shrinking violet-always ready to speak up for herself."}, {"viet": "Cô ta là một người có thiện chí trong văn phòng nên được giao cho làm hầu hết công việc.", "eng": "She's the willing horse in the office and so gets given most of the work to do."}, {"viet": "Cô ấy dường như luôn luôn thư thái, một tính cách, phong độ, v. v. ung dung.", "eng": "She always seems so laid-back, a laid-back style, manner, etc."}, {"viet": "Cô ấy đã đỗ kỳ thi với kết quả mỹ mãn.", "eng": "She came passed her exams with flying colours."}, {"viet": "Chị ấy có thể thi đỗ dễ như trở bàn tay.", "eng": "She could pass the exam standing on her head."}, {"viet": "Thật sự bà ta đã không làm cho cử toạ hiểu rõ được ý mình.", "eng": "She didn't really get her meaning over to her audience."}, {"viet": "Cô ta thất bại thảm hại trong cố gắng thuyết phục hội đồng.", "eng": "She failed miserably in her attempt to persuade the committee."}, {"viet": "Cô ta khẽ ho để làm cho tôi chú ý.", "eng": "She gave a quiet cough to attract my attention."}, {"viet": "Chị ấy đã gặp cơ hội rất tốt nhưng đã để tuột khỏi tay.", "eng": "She had a great opportunity, but she let it slip."}, {"viet": "Cô ấy có một giọng nói nước ngoài mà tôi không tài nào nhận ra.", "eng": "She has a foreign accent that I can't quite place."}, {"viet": "Cô ấy có tài nhưng cần được huấn luyện.", "eng": "She has talent but she will need coaching."}, {"viet": "Cô ta bực bội vì anh ấy không trả lời thư của mình.", "eng": "She is annoyed that he has not answered her letter."}, {"viet": "Cô ấy rất mẫn cảm nếu động tới chiều cao của cô ấy.", "eng": "She is very sensitive about her height."}, {"viet": "Cô ấy nghe tin với nỗi lo âu ngày càng lớn.", "eng": "She listened to the news with increasing anxiety."}, {"viet": "Cô ta nhắc đích thị đến công việc cẩu thả của anh ấy.", "eng": "She made some pointed references to his careless work."}, {"viet": "Cô ấy chỉ đùa thôi-cô ấy không có ý định thật đâu.", "eng": "She only did it in play-she didn't really want it."}, {"viet": "Cô ta viện cớ loạn thần kinh với các bạn đồng nghiệp.", "eng": "She projects neurosis onto her colleagues."}, {"viet": "Cô ta tựa khuỷu tay lên bàn.", "eng": "She rested her elbows on the table."}, {"viet": "Cô nàng xỏ mũi anh ta.", "eng": "She's got him under her thumb."}, {"viet": "Cô ấy nói là chưa một lúc nào cô có ý định muốn chết cả.", "eng": "She said she had no attention of popping off for sometime yet."}, {"viet": "Cô ấy bắt đầu ra tay phá kỷ lục thế giới về tốc độ chạy bộ.", "eng": "She set out to break the world land speed record."}, {"viet": "Bây giờ cô ấy nói nghe có vẻ như một người hoàn toàn khác vậy.", "eng": "She sounds like a completely different person now."}, {"viet": "Cô bé đã làm tất cả chúng tôi ngạc nhiên trong ngày tựu trường bằng việc tỏ ra hiền lành ngoan ngoãn.", "eng": "She surprised us all on her first day of school by going off like a lamb."}, {"viet": "Cô ấy thề nói sự thật tại toà.", "eng": "She tool an oath to tell the truth in court."}, {"viet": "Cô ấy tha thẩn dạo chơi không mục đích trên bãi biến.", "eng": "She wandered aimlessly along the beach."}, {"viet": "Cô ta ngạc nhiên nghe thấy điều xảy ra.", "eng": "She was astonished to hear what had happened."}, {"viet": "Cô ta đã phạm tội và vì lẽ đó cô ta đã mất việc.", "eng": "She was found guilty, and lost her job in consequence."}, {"viet": "Cô ta hết sức bực bội vì sự thô tục của hắn.", "eng": "She was most put out by his rudeness."}, {"viet": "Cô ta tốt bụng đến mức đã điện thoại gọi tắc xi cho tôi.", "eng": "She was so kind as to phone for a taxi for me."}, {"viet": "Cô ta mặc quần'gin'màu lam bó sát người.", "eng": "She was wearing a pair of tight blue jeans."}, {"viet": "Cô ta sẽ phải học cách cư xử cho đứng đắn.", "eng": "She will have to learn to behave properly."}, {"viet": "Cô ta thích từ chức hơn là tham gia vào những vụ làm ăn gian dối như thế.", "eng": "She would sooner resign than take part in such dishonest business deals."}, {"viet": "Tỏ ra sáng suốt trong việc chọn quần áo của mình.", "eng": "Show discrimination in one's choice of clothes."}, {"viet": "Vì chẳng có ai muốn nhận công việc đó, chúng ta để cho hắn làm cũng được.", "eng": "Since nobody else wants the job, we might as well let him have it."}, {"viet": "Những lát thịt bò kẹp giữa những lát bánh mì mới.", "eng": "Slices of beef between slices of fresh bread."}, {"viet": "Chiều nay nghe nói có mưa tuyết.", "eng": "Snow flurries are expected this evening."}, {"viet": "Socrates đã lý luận rằng một bức tượng đưa đến kết luận là có một nhà điêu khắc.", "eng": "Socrates argued that a statue inferred the existence of a sculptor."}, {"viet": "Vài loại hưu bị rụng sừng.", "eng": "Some kinds of deer shed their horns."}, {"viet": "Một số cây có lá mọc thẳng từ dưới đất.", "eng": "Some plants have leaves that grow straight out of the ground."}, {"viet": "Cần phải thử một cái gì mới để ngăn chặn việc sử dụng ma túy.", "eng": "Something new must be tried to discourage drug use."}, {"viet": "Phát biểu ủng hộ việc cấm tàng trữ vũ khí.", "eng": "Speak in support of a ban on arms supplies."}, {"viet": "Bắt đầu bằng cấp thấp nhất của thang lương.", "eng": "Start on the lowest rung of the salary scale."}, {"viet": "Đừng đánh trống lảng với tôi nữa-trả lời câu hỏi của tôi đi!", "eng": "Stop fencing with me-answer my question!"}, {"viet": "Hết sức cố gắng thúc đẩy cuộc vận động bầu cử tổng thống mà ông ta đã từng dẫn đầu.", "eng": "Struggled to jump-start his once front-running presidential campaign."}, {"viet": "Nói năng như vậy không phù hợp với phụ nữ như cô.", "eng": "Such language does not become a lady like you."}, {"viet": "Chắc chắn rồi, tôi sẽ đến.", "eng": "Sure, I'll be glad to come."}, {"viet": "Mang ô chỉ để phòng xa.", "eng": "Take an umbrella just as a precaution."}, {"viet": "Dạy mỹ nghệ và nghề thủ công ở một trường.", "eng": "Teach arts and crafts in a school."}, {"viet": "Điều kiện cho các đại lý của chúng tôi thường là những điều kiện tốt nhất.", "eng": "Terms for our agents are usually the best ones."}, {"viet": "Như thế mới tốt cho con chứ không phải cho bố, người ta đã bảo như vậy.", "eng": "That's good for you but not for me, so I've been told."}, {"viet": "Chiếc áo khoác đó thật hợp với anh.", "eng": "That coat's just right for you."}, {"viet": "Hành vi đó sẽ làm hỏng dịp may được thăng chức của anh.", "eng": "That kind of behaviour will compromise your chances of promotion."}, {"viet": "Cái nhẫn đó đáng giá một gia tài.", "eng": "That ring must have cost a fortune."}, {"viet": "Loại ngày nghỉ như vậy không hấp dẫn tôi.", "eng": "That type of holiday doesn't appeal to me."}, {"viet": "Sự kết nạp thêm những đảng viên mới vào đảng.", "eng": "The accession of new members to the party."}, {"viet": "Giá thực tế cao hơn nhiều so với dự tính của chúng ta.", "eng": "The actual cost was much higher than we had expected."}, {"viet": "Xe cứu thương đang chạy trên đường.", "eng": "The ambulance is running along the road."}, {"viet": "Các lá đơn xin đã được thẩm tra kỹ lưỡng để xem có thông tin gì giả mạo trong đó không.", "eng": "The applications were carefully screened in case any of them contained false information."}, {"viet": "Bài báo đã công kích về nạn bất công của xã hội.", "eng": "The article lashed out at social injustice."}, {"viet": "Soạn giả không chắc mình viết bi kịch hay hài kịch, vì thế vở kịch đâm ra xôi hỏng bỏng không.", "eng": "The author seems uncertain whether he is writing in a comedy or a tragedy, so the play falls between two stools."}, {"viet": "Chiếc túi đó nhét đầy quần áo bẩn.", "eng": "The bag was stuffed with dirty clothes."}, {"viet": "Những lý do tài chánh căn bản thúc đẩy việc đưa ra quyết định đó.", "eng": "The basic financial motivations for the decision."}, {"viet": "Khu vườn được chăm sóc kỹ nhất trong khu phố.", "eng": "The best kept garden in the street."}, {"viet": "Khu nhà vẫn chỉ là một bộ khung sắt.", "eng": "The block is still just a skeleton of girders."}, {"viet": "Cuốn sách đó không hề có giá trị nghệ thuật-mục đích duy nhất của nó là kích dục ( người đọc ).", "eng": "The book has no artistic merit-its sole aim is to titillate ( the reader )."}, {"viet": "Hàm của võ sĩ quyền Anh bị lung lay.", "eng": "The boxer's jaw went slack."}, {"viet": "Cô dâu trang điểm rất nhiều đồ nữ trang.", "eng": "The bride adorned herself with jewels lavishly."}, {"viet": "Bọn trộm để lại căn nhà trong tình trạng hỗn độn.", "eng": "The burglars left the house in a state of chaos."}, {"viet": "Chiếc ca-nô bị cuốn vào vùng nước xoáy.", "eng": "The canoe was sucked down into the whirlpool."}, {"viet": "Việc sửa chữa ô tô chiếm của cô ta một khoản tiền lớn trong số lượng của mình.", "eng": "The car repairs took quite a chunk out of her salary."}, {"viet": "Tòa lâu đài đó phần lớn được kiến thiết lại.", "eng": "The castle is largely a restoration."}, {"viet": "Ông chủ tịch bị ốm, nên ông phó đã phát biểu thay thế.", "eng": "The chairman was ill so his deputy spoke in his place."}, {"viet": "Đứa trẻ đột nhiên khóc thét.", "eng": "The child burst into loud wails."}, {"viet": "Bữa tiệc trà của bọn trẻ con ồn ào như là lúc cho thú vật ở sở thú ăn!", "eng": "The children's tea-party was like feeding-time at the zoo!"}, {"viet": "Lũ trẻ xô nhau chạy toán loạn xuống cầu thang.", "eng": "The children rushed pell-mell down the stairs."}, {"viet": "Quà Nôen đã được bọc lại bằng giấy xốp.", "eng": "The Christmas presents were wrapped in tissue paper."}, {"viet": "Người leo núi thận trọng lần từng chút theo gờ đá hẹp.", "eng": "The climber edged carefully along the narrow rock ledge."}, {"viet": "Mùa đông lạnh giá nhất đó vẫn còn trong ký ức.", "eng": "The coldest winter in living memory."}, {"viet": "Uỷ ban thậm chí cũng không xem xét đề nghị của tôi.", "eng": "The committee wouldn't even look at my proposal."}, {"viet": "Công ty từ chối không nhận trách nhiệm về vụ tai nạn nhưng đã cho tôi 10.000 bảng coi như tiền bù đắp.", "eng": "The company refused to accept responsibility for the accident, but gave me £ l0.000 as an ex gratia payment."}, {"viet": "Những người khách đến và đi không ngừng ở một khách sạn.", "eng": "The constant comings and goings at a hotel."}, {"viet": "Túp lều nằm quá trống trải trên đỉnh đồi.", "eng": "The cottage is in a very exposed position at the top of the hill."}, {"viet": "Sự thiên vị của tòa án về các quyết định bảo thủ.", "eng": "The court's tilt toward conservative rulings."}, {"viet": "Hoa màu hỏng vì nắng hạn kéo dài.", "eng": "The crops failed because of the drought."}, {"viet": "Các rèm cửa mở tung ra khi gió thổi.", "eng": "The curtains gaped when the wind blew."}, {"viet": "Vụ thỏa thuận này đều có lợi cho tất cả chúng ta.", "eng": "The deal was profitable to all of us."}, {"viet": "Sự bao hàm nghĩa rộng của từ''cây tùng''là tập hợp những cây thuộc họ tùng bách.", "eng": "The denotation of the word''fir''is the set of trees belonging to this family."}, {"viet": "Cái khó là không được cười lớn.", "eng": "The difficulty was in not laughing out loud."}, {"viet": "Việc ly hôn cho anh ta một bài học nhớ đời.", "eng": "The divorce left him a sadder but a wiser man."}, {"viet": "Văn kiện nói rõ ràng cái gì đã được hoạch định.", "eng": "The document clearly states what is being planned."}, {"viet": "Mái vòm của nhà thờ St Paul.", "eng": "The dome of St Paul's cathedral."}, {"viet": "Tên say rượu ngồi đó kể cà kê về những khó khăn của mình.", "eng": "The drunk sat there maundering about his troubles."}, {"viet": "Các chỗ mô tả quá chi tiết cái mưu đồ ấy làm cho cuốn sách trở nên khó đọc.", "eng": "The elaborations of the plot made it a difficult book to read."}, {"viet": "Động cơ phát ra tiếng động kì quặc.", "eng": "The engine's making a funny noise."}, {"viet": "Bằng chứng để buộc tội nó là khá hời hợt.", "eng": "The evidence against him is rather flimsy."}, {"viet": "Việc mở rộng khu vườn sẽ mất nhiều tuần lễ.", "eng": "The extension of the garden will take several weeks."}, {"viet": "Trang trại đó thường xuyên được trưng dụng làm căn cứ cho đội cấp cứu.", "eng": "The farm was under constant requisition as a base for the rescue team."}, {"viet": "Mùa này con ngựa cái con đã được đưa ra đua hai kỳ.", "eng": "The filly has been raced twice this season."}, {"viet": "Vụ hoả hoạn trông có vẻ như là một tai nạn nhưng cảnh sát vẫn xem xét tới khả năng của sự cố ý gây hoả hoạn.", "eng": "The fire looked like an accident but the police me still considering the possibility of arson."}, {"viet": "Hoàng đế đầu tiên của triều đại nhà Tần được chôn cất ở núi Ly Sơn.", "eng": "The first Emperor of the Qin Dynasty was buried at Mount Lishan."}, {"viet": "Sàn nhà nghỉ mát đầy cát.", "eng": "The floor of the beach-hut was sandy."}, {"viet": "Thời vận của chiến tranh tạo ra những người bạn lạ lùng.", "eng": "The fortunes of war create strange bedfellows."}, {"viet": "Tương lai của dự án đang ở trong tình trạng bấp bênh.", "eng": "The future of this project is hanging in the balance."}, {"viet": "Viên tướng cố tránh một trận giao tranh với quân địch.", "eng": "The general tried to avoid an engagement with the enemy."}, {"viet": "Tay đánh gôn quất một cái vào quả bóng.", "eng": "The golfer took a swing at the ball."}, {"viet": "Chính phủ đã chia nhỏ các bất động sản tư nhân lớn.", "eng": "The Government has broken up the large private estates."}, {"viet": "Chính phủ hình như không thể ngăn được thói bạo hành của công an mật.", "eng": "The government seemed unable to limit the excesses of its secret police."}, {"viet": "Vạn Lý TrườngThành là một trong những nơi tuyệt vời nhất trên thế giới và đã thu hút vô số du khách trong và ngoài nước.", "eng": "The Great Wall is one of the most wonderful places in the world and has attracted countless visitors at home and abroad."}, {"viet": "Người khách trọ muốn thuê một người phiên dịch.", "eng": "The guest wants to hire an interpreter."}, {"viet": "Quả tim thực hiện một chức năng sống còn của cơ thể.", "eng": "The heart performs a vital bodily function."}, {"viet": "Ngày nghỉ đó tốt đẹp hơn mong đợi.", "eng": "The holiday was beyond all expectations."}, {"viet": "Nhân viên bảo vệ khách sạn sẽ gọi tắc-xi cho ông.", "eng": "The hotel porter will call a taxi for you."}, {"viet": "Căn nhà nơi tôi sinh ra không còn nữa.", "eng": "The house where I was born no longer exists."}, {"viet": "Cố Cung chính là nhà của những vị hoàng đế trong các triều đại nhà Minh và nhà Thanh, khi ấy nó được đặt tên là “ Tử Cấm Thành ”.", "eng": "The Imperial Palace was the home of the emperors during the Ming and Qing dynasties, when it was known as the Forbidden City."}, {"viet": "Chất mực dùng cho những cánh hoa hút hoặc hấp thụ đa số các màu sắc có trong ánh sáng mặt trời đập vào nó.", "eng": "The ink used for the peals soaks up, or absorbs, most of the colors in the sunlight that strikes it."}, {"viet": "Hòn đảo đã bị ngành du lịch hủy hoại.", "eng": "The island has been ruined by tourism."}, {"viet": "Quan tòa đưa ra phán quyết bác đơn chống án của bà ấy.", "eng": "The judge pronounced against her appeal."}, {"viet": "Con dao lóng lánh phát sợ dưới ánh trăng.", "eng": "The knife gleamed wickedly in the moonlight."}, {"viet": "Diễn biến mới nhất trong cuộc khủng hoảng kéo dài.", "eng": "The latest development in the continuing crisis."}, {"viet": "Người bảo hộ hợp pháp phải hành động vì quyền lợi của đứa bé.", "eng": "The legal guardian must act on behalf of the child."}, {"viet": "Chiếc tàu chở khách được tân trang từ mũi đến lái.", "eng": "The liner has been refitted from stem to stern."}, {"viet": "Chiếc xe tải đó rẽ và hàng hóa chất trên xe bị tuột ra.", "eng": "The lorry turned and its load slipped."}, {"viet": "Thành phần chính của món “ Ngỗng đỏ son ” là ngỗng Thanh Viễn-đặc sản của Quảng Đông.", "eng": "The main ingredient of the dish Carmine Goose is Qing Yuan goose produced in Guangdong."}, {"viet": "Con người lảo đảo dưới sức nặng của đống hàng và ngã quỵ xuống đường.", "eng": "The mare foundered under the heavy load and collapsed in the road."}, {"viet": "Cái bộ phận làm quay bàn đĩa hát bị gãy.", "eng": "The mechanism that revolves the turnable is broken."}, {"viet": "Miền trung Tây là vựa thóc của nước Mỹ.", "eng": "The Mid-West is America's granary."}, {"viet": "Đám đông tiến về phía chúng tôi, la hét phẫn nộ.", "eng": "The mob advanced towards us shouting angrily."}, {"viet": "Kỳ nghỉ tốn kém nhất mà tôi từng trải qua là ở Thụy Sĩ.", "eng": "The most expensive holiday i've ever had was in Switzerland."}, {"viet": "Viện bảo tàng đóng cửa vào ngày Chủ Nhật.", "eng": "The museum is closed to visitors on Sunday."}, {"viet": "Người mới đến chính là Tổng thống.", "eng": "The new arrival was none other than the President."}, {"viet": "Bà nghị sĩ quốc hội mới đó phát biểu lần đầu tiên ở quốc hội ngày mai.", "eng": "The new MP is making her maiden speech in Parliament tomorrow."}, {"viet": "Tin về cái chết của cô ấy lan truyền nhanh chóng.", "eng": "The news of her death circulated quickly."}, {"viet": "Cái tiếng ồn đó làm cho ai cũng phát khùng.", "eng": "The noise would drive anyone scatty."}, {"viet": "Cô y tá quấn một em bé trong cái chăn.", "eng": "The nurse wrapped a baby in a blanket."}, {"viet": "Chiếc xe ô tô cũ đang chạy rất nhanh.", "eng": "The old car was travelling at quite a clip."}, {"viet": "Phần duy nhất trong bữa ăn mà tôi thật sự thích là món tráng miệng.", "eng": "The only part of the meal that I really liked was the dessert."}, {"viet": "Mặt ngoài ngôi nhà cần được quét vôi.", "eng": "The outside of the house needs painting."}, {"viet": "Con vẹt mổ một cái vào ngón tay tôi đau điếng.", "eng": "The parrot gave me a sharp peck on the finger."}, {"viet": "Hôm nay bệnh nhân đó đã khá hơn một chút.", "eng": "The patient is slightly better today."}, {"viet": "Thời gian sau bữa tối được dành riêng cho các trò chơi.", "eng": "The period after supper was given over to games."}, {"viet": "Bài nhạc này cần được chơi mở đầu mạnh hơn.", "eng": "The piece of music needs to be played with more attack."}, {"viet": "Chiếc máy bay rơi ngoài tầm mắt của chúng tôi.", "eng": "The plane crashed out of our sight."}, {"viet": "Vở kịch không những quá dài mà còn diễn dở nữa.", "eng": "The play was badly acted, besides being far too long."}, {"viet": "Cảnh sát bắt giữ cô ấy nhưng hoá ra là một sự lầm lẫn.", "eng": "The police arrested her, but it turned out to be a case of mistaken identity."}, {"viet": "Cảnh sát thuyết phục người bị tình nghi khai báo.", "eng": "The police persuaded the suspect to talk."}, {"viet": "Nhà chính trị lo toan những điều rắc rối của đất nước.", "eng": "The politician is up to his neck in the country's troubles."}, {"viet": "Quyền lực gắn liền với chức vụ Tổng thống.", "eng": "The power inherent in the office of President."}, {"viet": "Tổng thống nhận thức được một cách sâu sắc sự cần thiết phải có thêm bác sĩ và y tá.", "eng": "The President is acutely conscious of the need of more doctor and nurses."}, {"viet": "Các thầy tu xứ Babylon cổ xưa đã làm một thứ lịch có 29 ngày ở một vài tháng và 30 ngày ở những tháng khác.", "eng": "The priests of ancient Babylon worked out a calendar which had 29 days in some months and 30 days in others."}, {"viet": "Những tù nhân trốn thoát bằng cách đào đường hầm dưới chân tường.", "eng": "The prisoners escaped by burrowing under the wall."}, {"viet": "Kế hoạch đã bị phá sản vì thiếu tiền.", "eng": "The project was scuppered by lack of money."}, {"viet": "Việc này do một thành cơ dày gọi là cơ hoành và các xương sườn đảm nhiệm.", "eng": "The pumping is done by a thick wall of muscle called the diaphragm and by the ribs."}, {"viet": "Tất cả các vấn đề câu hỏi đều xoay quanh ôpêra, về một chủ đề mà tôi chẳng hiểu gì cả.", "eng": "The questions were all on opera, about which subject I know nothing."}, {"viet": "Con số chúng ta ghi được vượt xa mức trung bình.", "eng": "The reading we took were well above average."}, {"viet": "Việc phát hành một bộ phim, đĩa hát, cuốn sách, việc phát đi một tin ngắn.", "eng": "The release of a film, record, book, newsflash."}, {"viet": "Tất cả các nhà hàng đều ở tầng hai.", "eng": "The restaurants are all on the second floor."}, {"viet": "Việc tăng giá do hậu quả của vụ mất mùa.", "eng": "The rise in prices consequent upon the failure of the crops."}, {"viet": "Vụ cướp do một bọn đeo mặt nạ tiến hành.", "eng": "The robbery was carried cut by a gang of masked men."}, {"viet": "Hồng ngọc và ngọc sa-phi-a có độ nhẵn và cứng đến nỗi chúng làm giảm đi rất nhiều sự ma sát của đồng hồ đeo tay.", "eng": "The rubies and sapphires used are so smooth and hard that they make the friction in the watch much less."}, {"viet": "Đàn ông cũng như đàn bà nếu phạm cùng tội thì cần phải bị trừng phạt nghiêm khắc ngang nhau.", "eng": "The same transgressions should be visited with equal severity on both man and woman."}, {"viet": "Nhà khoa học dùng cánh tay điện tử để xem xét chất phóng xạ.", "eng": "The scientist used a bionic arm to examine the radioactive material."}, {"viet": "Câu đó không mang ý nghĩa như vậy.", "eng": "The sentence does not bear such a construction."}, {"viet": "Thân tàu thuỷ cọ xát dọc theo thành của bến tàu.", "eng": "The ship's hull scraped along the side of the dock."}, {"viet": "Cửa hiệu thiếu người làm nên tất cả chúng ta sẽ phải làm việc vất vả hơn.", "eng": "The shop is short-handed, so we are all having to work harder."}, {"viet": "Ca sĩ xuất hiện đầu tiên trình bày bản Don Giovanni của Mozart.", "eng": "The singer made his debut as Mozart's Don Giovanni."}, {"viet": "Khói tràn ngập căn phòng ấy và suýt nữa làm ngạt thở những người lính cứu hỏa.", "eng": "The smoke filled the room and almost stifled the firemen."}, {"viet": "Sự lo lắng của một người chồng chu đáo đối với vợ mình.", "eng": "The solicitude of a caring husband for his wife."}, {"viet": "Cảnh tượng bất công khắc sâu vào tâm hồn anh.", "eng": "The spectacle of injustice burn into his soul."}, {"viet": "Đài bắt đầu phát lúc 6 giờ sáng.", "eng": "The station begins broadcasting at 6 A. M."}, {"viet": "The Strand là một trong những đường phố lớn nhộn nhịp nhất của London.", "eng": "The Strand is one of London's busiest thoroughfares."}, {"viet": "Thành công của dự án phần lớn là do kết quả của sự hợp tác.", "eng": "The success of the project was largely the result of good teamwork."}, {"viet": "Nút ấn đóng công tắc và nối liền mạch điện.", "eng": "The switches close the contacts and complete the circuit."}, {"viet": "Thầy giáo đã hướng dẫn học sinh làm bài tập.", "eng": "The teacher shepherded his students doing exercises."}, {"viet": "Nghệ sĩ đơn ca giọng nam cao sẽ không ra mắt được tối nay vì ốm.", "eng": "The tenor soloist is unable to appear tonight because of illness."}, {"viet": "Ý nghĩ cho rằng mình chịu trách nhiệm về cái chết của bà ta đã giày vò tâm trí ông ấy.", "eng": "The thought that he was responsible for her death preyed on his mind."}, {"viet": "Các khách du lịch đã mất hết hành lý của họ trong vụ cháy khách sạn.", "eng": "The tourists lost all their belongings in the hotel fire."}, {"viet": "Sự truyền bệnh do muỗi.", "eng": "The transmission of disease by mosquitoes."}, {"viet": "Hai đội quân giao chiến dữ dội trong vài giờ.", "eng": "The two armies were fiercely engaged for several hours."}, {"viet": "Ukraine là vựa lương thực của Liên Xô trước đây.", "eng": "The Ukraine was the breadbasket of the former Soviet Union."}, {"viet": "Vacxin được dùng để chống lây bệnh cho toàn dân.", "eng": "The vaccine was used to protect the whole population against infection."}, {"viet": "Đội khách quá mạnh Họ đã đánh gục chúng tôi.", "eng": "The visiting team was too strong-they walked all over us."}, {"viet": "Sóng đã đẩy cát lên thành những chóp nhọn.", "eng": "The waves had pushed the sand into little ridges."}, {"viet": "Toàn bộ bài diễn văn là những lời nhảm nhí vô vị.", "eng": "The whole speech was platitudinous nonsense."}, {"viet": "Những người làm chứng từ chối không dám làm chứng vì những tên tội phạm đã lầm lì đe doạ họ.", "eng": "The witnesses refused to give evidence because the criminals had put the frighteners on them."}, {"viet": "Con ngựa bị thương không thể tự nhấc mình từ mặt đất lên được.", "eng": "The wounded horse could not raise itself from the ground."}, {"viet": "Quần áo của chúng vứt thành một đống lộn xộn trên sàn.", "eng": "Their clothes lay in a huddle on the floor."}, {"viet": "Ý kiến của họ sẽ không ảnh hưởng tới quyết định của tôi.", "eng": "Their opinion will not affect my decision."}, {"viet": "Vậy thì nó phải đắt hơn nhiều.", "eng": "Then it must be much more expensive."}, {"viet": "Trong cuốn tiểu thuyết này, có lắm chỗ độn thêm cho dài.", "eng": "There's a lot of padding in this novel."}, {"viet": "Không việc gì mà phải sốt ruột với bà ta, bà ta muốn làm xong lúc nào thì xong lúc đó thôi.", "eng": "There's no point getting impatient with her, she'll finish the job in her own good time."}, {"viet": "Có 150 bệnh nhân trong bệnh viện này.", "eng": "There are 150 patients in this hospital."}, {"viet": "Có một trăm'xu'trong một'đồng'.", "eng": "There are one hundred'fen'in a'Yuan'."}, {"viet": "Không còn bàn nào trống vào lúc 8 giờ, nhưng chúng tôi có thể giữ trước một bàn cho ông vào lúc 9 giờ.", "eng": "There aren't any tables left for eight, but we can book one for you at 9: 00."}, {"viet": "Trong việc này có hương vị lãng mạn.", "eng": "There is a flavor of romance in the affair."}, {"viet": "Không có ai lại không cảm thấy thương hại lũ trẻ đang chết đói.", "eng": "There is no man but feels pity for starving children."}, {"viet": "Phải có hành động tức thời nếu muốn tránh khỏi một sự hỗn loạn hoàn toàn.", "eng": "There must be immediate action if total chaos is to be averted."}, {"viet": "Có chút đượm buồn trong giọng nói của cô ấy.", "eng": "There was a tinge of sadness in her voice."}, {"viet": "Khán giả há hốc mồm ra vì sợ hãi khi anh ta rơi khỏi dây buộc làm xiếc.", "eng": "There were gasps of horror from the spectators as he fell off the tightrope."}, {"viet": "Những bài báo này trước đây chưa được in trọn vẹn.", "eng": "These articles had not found print in entirety before."}, {"viet": "Những biện pháp này sẽ kéo dài mãi sự thù địch giữa hai nhóm.", "eng": "These measures will perpetuate the hostility between the two groups."}, {"viet": "Bất chấp sự phản đối kịch liệt của tôi, họ sẽ phá huỷ cái nhà.", "eng": "They'll demolish this house over my dead body."}, {"viet": "Họ đã từ bỏ lối sống tội ác xưa kia.", "eng": "They've renounced their old criminal way of life."}, {"viet": "Chúng là một trăm đồng, năm mươi đồng, mười đồng, năm đồng và hai đồng tất cả chúng ở dạng tiền giấy, và một đồng được phát hành ở dạng tiền giấy lẫn tiền kim loại.", "eng": "They are one hundred-yuan, fifty yuan, ten-yuan, five-yuan and two-yuan, all are in notes, and one yuan is issued both in note and coin."}, {"viet": "Họ bước nhanh trên đường về phía tôi.", "eng": "They came bombing along the road towards me."}, {"viet": "Chúng không dành nhiều chỗ trong đầu chúng cho bộ não.", "eng": "They did not have much room in their heads for brains."}, {"viet": "Họ đã đấu tranh cho đạo luật dự thảo thông qua ở Nghị viện.", "eng": "They fought the bill through Parliament."}, {"viet": "Cuối cùng họ đã quyết tâm dấn tới và cưới nhau.", "eng": "They have finally decided to take the plunge and get married."}, {"viet": "Họ sống thân mật với hàng xóm láng giềng.", "eng": "They lived in amity with their neighbours."}, {"viet": "Họ bắt tôi phải trả đắt 1 pao cho số hàng mua.", "eng": "They overcharged me 1 pound for the shopping."}, {"viet": "Họ trình bày các lời than phiền của họ với nhà vua.", "eng": "They represent their grievance to the king."}, {"viet": "Họ ở một mình buổi chiều.", "eng": "They spent the afternoon by themselves."}, {"viet": "Họ muốn có con nhưng không có đủ tài chính vào lúc này.", "eng": "They want to start a family but can't afford it in these days."}, {"viet": "Họ bị nghỉ việc vì không có đơn đặt hàng mới.", "eng": "They were laid off because of the lack of new orders."}, {"viet": "Họ nên tiến hành công việc mà không cần những cuộc họp ban bệ hàng tuần.", "eng": "They would get the job done just as well without all the palaver of weekly committee meetings."}, {"viet": "Cuốn sách này trình bày tinh tuý của tư tưởng Wittgenstein chỉ trong năm mươi trang.", "eng": "This book offers a distillation of Wittgenstein thought in a mere fifty pages."}, {"viet": "Ban này bị công ty bỏ quên trong một thời gian quá dài.", "eng": "This department has been the Cinderella of the company for far too long."}, {"viet": "Sự kiện lịch sử này phải được phán xét trong tương lai.", "eng": "This historic event must be judged in the aftertime."}, {"viet": "Đây là giá tốt nhất chúng tôi có thể đưa ra ở thời điểm hiện tại và chúng tôi tin là ông sẽ chấp nhận ngay.", "eng": "This is the best offer we can make at present and we believe that you will accept it at once."}, {"viet": "Chỗ này có vẻ là chỗ tốt để xem pháo hoa đấy.", "eng": "This looks like a good place to watch the fireworks."}, {"viet": "Khu vực này của thành phố dễ hấp dẫn người ta đua đòi.", "eng": "This part of the town has a lot of snob appeal."}, {"viet": "Vụ bê bối này sẽ làm cho toàn đảng mang tiếng.", "eng": "This scandal will reflect badly on the Party as a whole."}, {"viet": "Chuyến tàu này chở cả hành khách lẫn hàng hoá.", "eng": "This train conveys both passengers and goods."}, {"viet": "Ngươi phải yêu Chúa của ngươi với tất cả trái tim và tâm hồn ngươi", "eng": "Thou shalt love the Lord with any thy heart and with all thy soul."}, {"viet": "Đã nói với ai không hết bao nhiêu lần mà kể, hàng tá lần, vô số lần, v. v. đừng làm cái gì.", "eng": "Told sb umpteen, a dozen, countless, etc times not to do sth."}, {"viet": "Hai nhân chứng đã làm chứng buộc tội cô ta và một nhân chứng bênh vực cô ta.", "eng": "Two witnesses testified against her and one in her favour."}, {"viet": "Tiếp sau chiến tranh là nhiều năm khắc khổ.", "eng": "War was followed by many years of austerity."}, {"viet": "Ngày mai, chúng ta sẽ được thông báo liệu chúng ta có phải kiểm tra hay không.", "eng": "We'll be told tomorrow whether we should take the exam or not."}, {"viet": "Chúng ta đã tìm ra nguyên nhân của vấn đề, vậy tiếp theo chúng ta sẽ làm thế nào?", "eng": "We're found the cause of the problem, so where do we go from here?"}, {"viet": "Chúng ta rất thiếu nhân sự làm việc ở cơ quan trong tuần này.", "eng": "We're very short-staffed in the office this week."}, {"viet": "Chúng tôi nhận được một đơn đặt hai tấn than.", "eng": "We've received an order for two tons of coal."}, {"viet": "Chúng tôi đóng cửa cả chủ nhật và ngày lễ.", "eng": "We are close all day Sunday and holidays."}, {"viet": "Chúng ta đã yêu cầu gửi đơn xin và đã bị ngập ( trong đống đơn đó ).", "eng": "We asked for applications and were swamped ( with them )."}, {"viet": "Chúng tôi chỉ có thể kéo dài thời hạn vay của anh đến đây thôi, không hơn.", "eng": "We can extend your loan so far and no further."}, {"viet": "Trong trường hợp của anh chúng tôi có thể giảm nhẹ thủ tục một chút.", "eng": "We could relax the procedure slightly in your case."}, {"viet": "Hôm nay chúng ta không muốn bị trễ.", "eng": "We don't want to be late today."}, {"viet": "Chúng tôi đảm bảo các màu nhuộm này rất bền.", "eng": "We guarantee the fastness of these dyes."}, {"viet": "Chúng tôi có một hợp đồng với Chính phủ về việc cung cấp xe cộ.", "eng": "We have a contract with the Government for the supply of vehicles."}, {"viet": "Chúng ta đã thành công về một điểm cốt yếu: đưa vụ bê bối này ra trước công chúng.", "eng": "We have succeeded in one crucial regard: making this scandal public."}, {"viet": "Chúng tôi không biết chút gì về cô ấy, ngoại trừ họ của cô ấy là Jones.", "eng": "We know nothing about her save that her surname is Jones."}, {"viet": "Chúng tôi đẩy mạnh việc bán các đồ trang bị nội thất của chúng tôi bằng cách quảng cáo trên báo chí.", "eng": "We merchandise our furniture by advertising in newspapers."}, {"viet": "Bằng cách này hay cách khác chúng ta phải ngăn anh ta lại không cho gặp cô ấy.", "eng": "We must stop him from seeing her somehow."}, {"viet": "Chúng tôi hái hoa dại trong rừng.", "eng": "We picked the wild flowers in the woods."}, {"viet": "Hình như chúng tôi đã nghe sai.", "eng": "We seem to have got our wires crossed."}, {"viet": "Chúng tôi đứng bên hồ, như bị mê hoặc bởi những màu sắc lấp lánh của cá.", "eng": "We stood by the lake, mesmerized by the flashing colours of the fish."}, {"viet": "Chúng tôi muốn tặng bà ấy một tặng phẩm để kỷ niệm ngày trọng đại của bà.", "eng": "We want to make her a presentation to celebrate her jubilee."}, {"viet": "Chúng tôi cảm thấy bối rối vì anh ta không viết thư trả lời.", "eng": "We were perplexed by his failure to answer the letter."}, {"viet": "Không được ông giúp đỡ thì chúng tôi có lẽ đã hoàn toàn lúng túng.", "eng": "We would be totally lost without your help."}, {"viet": "Vậy thì tôi hy vọng bạn chóng khỏe.", "eng": "Well, I hope you get well soon."}, {"viet": "À, hôm nay ông đến đúng giờ.", "eng": "Well, you are on time today."}, {"viet": "Thật là phiền toái không cần thiết, chuẩn bị cho các vị khách không tới.", "eng": "What a lot of needless trouble preparing for guests who don't turn up."}, {"viet": "Biển gợi cho anh những sự liên tưởng gì?", "eng": "What associations does the sea have for you?"}, {"viet": "VỚI 138 ĐÔLA, QUÍ VỊ MUA GÌ NÀO?", "eng": "WHAT DO YOU WANT FOR $ 138?"}, {"viet": "Lãi suất ngân hàng ở nước bạn là bao nhiêu?", "eng": "What is the bank interest rate in your country?"}, {"viet": "Bạn nghĩ gì về các cửa hàng bách hóa của Nhật?", "eng": "What is your opinion of Japanese department stores?"}, {"viet": "Cái cặp của ông màu gì?", "eng": "What's the color of your briefcase?"}, {"viet": "Hoàn cảnh cô ấy chết như thế nào?", "eng": "What were the circumstances of surrounding her death?"}, {"viet": "Bao giờ thì vụ kiện của ông ra toà?", "eng": "When does your case come before the court?"}, {"viet": "Tục ngữ có câu nhập gia tùy tục mà ông.", "eng": "When in Tokyo, do as the Tokyoites, they say."}, {"viet": "Khi tổng thống bị ốm, nhiệm vụ của ông được trao cho Phó Tổng thống.", "eng": "When the President is ill, his duties devolve upon the Vice-President."}, {"viet": "Khi cô đến đất nước chúng tôi, hãy đến ở với chúng tôi vài ngày để chúng tôi có thể đáp lại lòng hiếu khách của cô.", "eng": "When you go to our country, be sure to come and stay with us for a few days so that we can return the hospitality."}, {"viet": "Quầy làm thủ tục lên máy bay của Hãng Hành không Trung Quốc ở đâu?", "eng": "Where is the China Airlines check-in counter?"}, {"viet": "Ông muốn có loại bàn nào, trong đại sảnh hay trong phòng?", "eng": "Which kind of table would you like to have, in the hall, or in the room?"}, {"viet": "Ai chịu trách nhiệm về sự lộn xộn khủng khiếp này?", "eng": "Who's responsible for this terrible mess?"}, {"viet": "Bất kể ai chủ toạ cũng sẽ cần phải kiên nhẫn và khéo xử.", "eng": "Whoever presides will need patience and tact."}, {"viet": "Sao lại lo lắng chỉ vì một điểm xấu?", "eng": "Why get up sad just because you got a bad mark?"}, {"viet": "Xin vui lòng trông nom mấy đứa bé khi tôi vắng nhà.", "eng": "Will you care for the children when I'm away."}, {"viet": "Chúc bạn mọi điều tốt đẹp nhất cho năm mới.", "eng": "Wishing you all the best for the coming year."}, {"viet": "Phụ nữ có tuổi thọ trung bình cao hơn nam giới.", "eng": "Women have a higher life expectancy than men."}, {"viet": "Bạn giữ nó cho thẳng trong lúc tôi đóng đinh nhé?", "eng": "Would you hold it straight while I put in the nail?"}, {"viet": "Phiền bạn giúp tôi một việc nhé?", "eng": "Would you mind giving me a hand?"}, {"viet": "Hãy viết bài tiểu luận của anh vào vở, không viết trên giấy nháp.", "eng": "Write the essay in your exercise books, not on rough paper."}, {"viet": "Vâng, nếu ông Dodd muốn gọi điện cho tôi, tôi sẽ ở nhà sau 10 giờ tối nay.", "eng": "Yes, if Mr. Dodd wants to phone me, I'll be in after 10 tonight."}, {"viet": "Anh sẽ được biệt phái về Bộ này tới cuối năm.", "eng": "You'll be attached to this department until the end of the year."}, {"viet": "Anh ta được phép mang 1, 5 lít rượu miễn thuế.", "eng": "You're allowed 1, 5 litres of spirits duty-free."}, {"viet": "Anh thì được hưởng tất cả mọi thú vui còn tôi thì phải làm tất cả công việc cực nhọc.", "eng": "You've had all the fun and I've had all the hard work."}, {"viet": "Các bạn không thể coi hệ thống giáo dục của Anh và của Đức ngang nhau.", "eng": "You can't equate the education system of Britain to that of Germany."}, {"viet": "Ông có thể cảm nhận là nó mềm vô cùng.", "eng": "You can feel that it is extremely soft."}, {"viet": "Quý vị có thể có lãi nhờ bán nhiều hơn nếu giảm giá một ít, 2% chẳng hạn.", "eng": "You could benefit from higher sale with a little concession, say, a 2% reduction."}, {"viet": "Ông có một giờ để dọn dẹp sạch sẽ toàn bộ ngôi nhà này-cho nên hãy bắt đầu chùi, cọ đi!", "eng": "You have an hour to clean the whole house-so get scrubbing!"}, {"viet": "Anh biết đấy, thuật ngữ bank xuất phát từ tiếng Ý banco, có nghĩa là ghế dài hoặc bàn.", "eng": "You know the term bank comes from the Italian word'banco', meaning bench or table."}, {"viet": "Chắc chắn anh đang mơ tưởng hão nếu anh cho rằng nó sẽ trả anh từng ấy!", "eng": "You must be in dream-land if you think he'll pay that much!"}, {"viet": "Với công việc này, cậu cần kiên trì vô cùng.", "eng": "You need infinite patience for this job."}, {"viet": "Bà phải ăn mặc thế nào cho phù hợp với một phụ nữ ở địa vị của bà.", "eng": "You should dress in a way that befits a woman of your position."}, {"viet": "Chắc ông sẽ không đăng lên báo một luận điệu xấu xa như thế.", "eng": "You surely won't print such a scandalous allegation."}, {"viet": "Bạn sẽ không tin đâu, nhưng nhạc trưởng là người từ Trung Quốc sang.", "eng": "You won't believe it, but the conductor's from China."}, {"viet": "Kinh nghiệm làm nhân viên bán hàng của anh làm cho anh có lợi thế hơn các ứng viên khác.", "eng": "Your experience as a sales assistant puts you one up on the other candidates."}, {"viet": "Hành vi thiếu chu đáo của anh làm cho tất cả chúng tôi hết sức buồn bã.", "eng": "Your thoughtless behaviour has caused us all a great deal of distress."}]