[{"viet": "Một tên cướp ngân hàng mang một chiếc mặt nạ trùm đầu.", "eng": "A bank robber wearing a stocking mask."}, {"viet": "Một ông Brown nào đó đã gọi điện lúc anh đi vắng.", "eng": "A certain Mr. Brown telephoned while you were out."}, {"viet": "Một công ty có mức lợi nhuận cao phải đóng thêm khoản thuế lợi tức vượt mức cho chính phủ.", "eng": "A company which makes high profits must pay excess profits duty to the government."}, {"viet": "Một bộ khối nước nặng 62 pao rưỡi.", "eng": "A cubic foot of water weighs about 62 1/2 pounds."}, {"viet": "Một người thợ lặn với tình trạng tinh thần lẫn thể xác ở tư thế sẵn sàng khi thực hiện vụ lặn.", "eng": "A diver whose mental and physical states were at concert pitch before executing the dive."}, {"viet": "Một vài dòng thơ con cóc có nhịp điệu đâu được coi là thơ.", "eng": "A few lines of rhyming doggerel don't count as poetry."}, {"viet": "Một tính từ tiếng Pháp ở giống đực.", "eng": "A French adjective in the masculine."}, {"viet": "Một đoàn chính phủ đang điều tra vấn đề này.", "eng": "A government body is investigating the problem."}, {"viet": "Một bờ rào ngăn chia giữa đất của cô ta và của tôi.", "eng": "A hedge forms the division between her land and mine."}, {"viet": "Một cuộc đi chơi bằng xe gắn máy lắc lư trên đường gồ ghề.", "eng": "A jittery ride over rough terrain."}, {"viet": "Một học viên kéo viôlông ken két.", "eng": "A learner rasping away on his violin."}, {"viet": "Rất nhiều sinh viên đến vào ban đêm.", "eng": "A lot of students come at night."}, {"viet": "Một căn cứ không quân được bảo vệ chặt chẽ tối đa.", "eng": "A maximum-security air force base."}, {"viet": "Một nốt nhạc với tần số 256 bước sóng trong một giây.", "eng": "A musical note with a frequency of 256 vibrations per second."}, {"viet": "Một tiểu thuyết gia có con mắt nhận xét mọi tình tiết.", "eng": "A novelist with an eye for detail."}, {"viet": "Người ta chết khi bộ óc ngưng hoạt động.", "eng": "A person died when his brain ceases to function."}, {"viet": "Một hợp đồng bảo hiểm hoả hoạn.", "eng": "A policy that gives cover against fire."}, {"viet": "Cái thói có tiền là phải tiêu ngay sẽ không giúp cho cậu trở thành giàu có được đâu.", "eng": "A propensity to spend money as soon as you get it won't help you to become rich."}, {"viet": "Một nghị quyết ủng hộ những điều kiện tốt đẹp hơn.", "eng": "A resolution in favour of better conditions."}, {"viet": "Một phòng tắm hơi trong khách sạn hẳn là một tiện nghi hữu dụng.", "eng": "A sauna in the hotel would be a useful amenity."}, {"viet": "Một cửa hàng dự trữ quá nhiều đồ đạc lỗi thời.", "eng": "A shop overstocked with out-of-date furniture."}, {"viet": "Một xã hội bị suy bại vì chủ nghĩa phân biệt chủng tộc.", "eng": "A society that was infected by racism."}, {"viet": "Một phương pháp giải quyết vấn đề từng bước có lớp lang.", "eng": "A step-by-step, programmatic approach to problem solving."}, {"viet": "Cái bàn cạnh giường của ai.", "eng": "A table by the side of one's bed."}, {"viet": "Một đoàn xe bò lăn lạch cà lạch cạch về hướng bắc trên con đường mòn Winnipeg, mỗi chiếc xe có tám con bò kéo, còn các người đánh bò thì đi dọc bên cạnh.", "eng": "A train of heavy wagons rumbled north on the Winnipeg Trail, drawn by octets of oxen, the drovers walking alongside."}, {"viet": "Một tủ áo đầy những quần áo không còn mặc được nữa.", "eng": "A wardrobe full of clothes that are no longer wearable."}, {"viet": "Một thanh niên, không hơn một cậu choai choai bao nhiêu.", "eng": "A young man, hardly more than stripling."}, {"viet": "Những hoạt động có hại cho quyền lợi của chúng ta.", "eng": "Activities detrimental to our interests."}, {"viet": "Sau khi dừng lại một chút họ tiếp tục đi.", "eng": "After a short pause, they continued walking."}, {"viet": "Sau cuộc bàn luận rất lâu, họ quyết định chấp thuận đề nghị của chúng tôi.", "eng": "After much discussion, they decided to accept our offer."}, {"viet": "Sau ba năm, chị có thể chuyển đi.", "eng": "After three years, you can move."}, {"viet": "Tất cả tài sản của ông ta bị cháy hết sạch.", "eng": "All his belongings were burnt in the fire."}, {"viet": "Tất cả chuyện đánh đấm dường như không còn trong anh nữa.", "eng": "All the fight seemed to go out of him."}, {"viet": "Dù hắn chỉ dự thi cho vui thôi nhưng hắn lại chiếm được giải nhất.", "eng": "Although he had only entered the contest for fun, he won first prize."}, {"viet": "Một diễn viên phải học cách cười phớt lờ những lời phê bình xấu xa.", "eng": "An actor has to learn to laugh off bad reviews."}, {"viet": "Một chiếc xe ôtô bám chặt mặt đường ở những khúc rẽ.", "eng": "An automobile that is sure-footed on curves."}, {"viet": "Một sự đam mê sùng bái của cải vật chất.", "eng": "An idolatrous love of material wealth."}, {"viet": "Một khung vải nhún cũ đã mất phần nào tính đàn hồi của nó.", "eng": "An old trampoline that has lost some of its spring."}, {"viet": "Và thông thường chúng tăng trưởng nhiều, giống như thảo mộc.", "eng": "And as a rule they grow much as plants do."}, {"viet": "Lại thêm một cái liếc nhìn nôn nóng vào đồng hồ của hắn.", "eng": "Another impatient glance at his watch."}, {"viet": "Lo lắng về kết quả kỳ thi.", "eng": "Apprehensive about the results of the exams."}, {"viet": "Ông có bị dị ứng với thuốc nào không?", "eng": "Are you allergic to any medication?"}, {"viet": "Các ông có chắc là đã chuyển tiền vào đúng tài khoản không ạ?", "eng": "Are you sure the transfer has been made to the right account?"}, {"viet": "Còn bướm đêm thì tròn trĩnh.", "eng": "As a rule the body of a moth is plump."}, {"viet": "Càng sắp đến cái giây phút quan trọng ấy, cô ta càng lo lắng.", "eng": "As the great moment approached, she grew more and more nervous."}, {"viet": "Lúc đầu tôi cứ nghĩ nó sẽ là một phim rất chán, nhưng sau đó thật sự là nó rất hay.", "eng": "At first I thought it was going to be a drag, but then it really got good."}, {"viet": "Chỉ trích lập trường cứng nhắc của chính phủ về những vụ cắt giảm chi phí giáo dục.", "eng": "Attack the government's uncompromising stand on education cuts."}, {"viet": "BASIC là loại ngôn ngữ lập trình mà hầu hết các lập trình viên học đầu tiên.", "eng": "BASIC is the language most programmers learn first."}, {"viet": "Hãy đặc biệt cẩn thận khi lái xe ban đêm.", "eng": "Be particularly careful when driving at night."}, {"viet": "Trước trận thi đấu tôi đưa đồng hồ cho vợ tôi giữ cho an toàn.", "eng": "Before the game I gave my watch to my wife for safe keeping."}, {"viet": "Bạn của Billy đã tố cáo nó với thầy giáo.", "eng": "Billy's friend split on him to the teacher."}, {"viet": "Bánh mì, khoai tây và các thực phẩm chính khác tiếp tục tăng giá.", "eng": "Bread, potatoes and other staples continue to rise in price."}, {"viet": "Được xây ở vị trí một pháo đài La Mã.", "eng": "Built on the site of a Roman fort."}, {"viet": "Nhưng trong danh sách xếp chỗ ngồi họ có họ khác nhau.", "eng": "But in the seating list they have different last names."}, {"viet": "Nhưng bạn không hòa mình vào các thực khách khác.", "eng": "But you're not mixing with the other guests."}, {"viet": "À này, anh mong mức lương bao nhiêu?", "eng": "By the way, what salary do you expect?"}, {"viet": "Tôi có thể giới thiệu ông máy vi tính đời mới của hãng chúng tôi không?", "eng": "Can I interest you in our latest computer?"}, {"viet": "Anh có thể ước lượng xem nó dài bao nhiêu được không?", "eng": "Can you estimate how long it is?"}, {"viet": "Anh có thể nhắc tôi xướng bài được không?", "eng": "Can you remind me of the bidding?"}, {"viet": "Cẩn thận, cái ghế đó mỏng manh lắm!", "eng": "Careful, that chair's rather frail!"}, {"viet": "Vui vẻ lên, không phải hoàn toàn tuyệt vọng đâu!", "eng": "Cheer up, it's not quite hopeless yet!"}, {"viet": "Cuộc sống đô thị ít có hấp dẫn đối với tôi.", "eng": "City life holds few attraction for me."}, {"viet": "Lại ngồi vào đùi ông nào!", "eng": "Come and sit on Grandpa's lap!"}, {"viet": "Cách cư xử mang lại uy tín lớn cho anh ta.", "eng": "Conduct that is very creditable to him."}, {"viet": "Chi phí đã gia tăng, thì giá cả sẽ gia tăng theo một tỷ lệ tương xứng.", "eng": "Costs have risen, and prices will rise proportionately."}, {"viet": "Bạn có thể cam chịu bị thất nghiệp cả đời không?", "eng": "Could you reconcile yourself to a lifetime of unemployment?"}, {"viet": "Tham gia đấu tranh đòi đối xử công bằng hơn với các nhóm thiểu số.", "eng": "Crusading for fairer treatment of minorities."}, {"viet": "Những ký giả đứng đắn nên bỏ công ra mà kiểm tra các sự kiện mình có.", "eng": "Decent journalists should take the trouble to check their facts."}, {"viet": "Mặc dù vẻ ngoài của anh như vậy người ta vẫn nói anh có chút gì đó của một chàng Đông Gioăng.", "eng": "Despite his looks he's said to be something of a Don Juan."}, {"viet": "Bạn có gặp khó khăn nào khi đến Nhật Bản lần đầu tiên không?", "eng": "Did you have any difficulties when you first came to Japan?"}, {"viet": "Phát hiện liền lò đó không hoạt động.", "eng": "Discovered straight off that the furnace wasn't working."}, {"viet": "Hãy nói là em sẽ ở lại dùng bữa tối đi!", "eng": "Do say you'll stay for supper!"}, {"viet": "Bạn có ăn theo một chế độ ăn cân đối không?", "eng": "Do you eat a balanced diet?"}, {"viet": "Cô có còn chỗ trống nào không?", "eng": "Do you have any vacant seats?"}, {"viet": "Bạn có thích tổng thống Mỹ đương nhiệm không?", "eng": "Do you like the current American President?"}, {"viet": "Bạn có liên lạc với vài người bạn thời thơ ấu của bạn không?", "eng": "Do you stay in touch with some of your childhood friends?"}, {"viet": "Em muốn khu hút thuốc hay khu không hút thuốc?", "eng": "Do you want smoking or non-smoking?"}, {"viet": "Chính phủ nước bạn có đưa ra các chương trình phúc lợi xã hội tốt không?", "eng": "Does your government provide good social welfare programs?"}, {"viet": "Đừng cắt sợi dây, tháo nút ra thôi.", "eng": "Don't cut the string, untie the knots."}, {"viet": "Đừng để anh ta lái xe-anh ta là một người hết sức bất thường khi lái.", "eng": "Don't let him drive-he's complete psycho behind the wheel."}, {"viet": "Đừng có gợi cho cô ta kể một trong mấy câu chuyện chán ngắt của cô ta.", "eng": "Don't start her off on one of her boring stories."}, {"viet": "Anh không thấy sao-đó chỉ toàn là chuyện chụp mũ vu cáo thôi!", "eng": "Don't you see-it was all a frame-up!"}, {"viet": "Suốt thời gian bà ấy bị bệnh, luật sư của bà ta đã đại diện cho bà trong công việc làm ăn.", "eng": "During her illness her solicitor has been acting for her in her business affairs."}, {"viet": "Các cuộc vận động tuyển cử tại Anh kéo dài trong ba tuần.", "eng": "Election campaigns in Britain run for three weeks."}, {"viet": "Những bài báo khen ngợi về cuốn sách mới nhất của ông ta.", "eng": "Eulogistic articles about his latest book."}, {"viet": "Mọi người có giúp sức đều được một phần chia trong lợi nhuận.", "eng": "Everyone who helped gets a share in the profits."}, {"viet": "Trưng bày hoa ở hội chợ hoa.", "eng": "Exhibit flowers at a flower show."}, {"viet": "Đời nào tôi xen vào công việc của anh nhưng tôi thấy cần khuyên anh một điều.", "eng": "Far be it from me to interfere in your affairs but I would like to give you just one piece of advice."}, {"viet": "Năm mươi ngàn đô la được trả trước cho hàng hóa của ông ấy.", "eng": "Fifty thousand dollars was advanced to him against his goods."}, {"viet": "Đánh cá bất hợp pháp trong vùng biển nước ngoài.", "eng": "Fishing illegally in foreign territorial waters."}, {"viet": "Bóng đá là môn chơi có tính chuyên môn.", "eng": "Football is a game of a specialists."}, {"viet": "May thay cho chúng tôi, thời tiết đã thay đổi.", "eng": "Fortunately for us, the weather changed."}, {"viet": "G đọc nhẹ trong từ gin và đọc mạnh trong từ get.", "eng": "G is soft in gin and hard in get."}, {"viet": "Hài lòng với công việc của mình.", "eng": "Get satisfaction from one's work."}, {"viet": "Cọ rửa kỹ lưỡng sàn nhà.", "eng": "Give the floor a good scrub."}, {"viet": "Vàng có màu tương tự như đồng.", "eng": "Gold is similar in colour to brass."}, {"viet": "Phụ khoa là một ngành y.", "eng": "Gynaecology is a branch of medicine."}, {"viet": "Hành động vội vã tất sẽ bị phản đối.", "eng": "Hasty action is to be deprecated."}, {"viet": "Từ trước đến nay cậu có bao giờ lái máy bay trực thăng chưa?", "eng": "Have you ever flown a helicopter?"}, {"viet": "Bạn đã chuẩn bị cho kỳ thi giữa học phần chưa?", "eng": "Have you prepared for mid-term exams?"}, {"viet": "Hắn sẽ không bao giờ thành đạt vì hắn quá lười.", "eng": "He'll never come to much, he's too lazy."}, {"viet": "Không có kính anh ta không nhìn thấy gì hết.", "eng": "He's as blind as a bat without his glasses."}, {"viet": "Đầu óc nó trở nên một chiều-nó chẳng nghĩ gì khác ngoài chuyện tình dục!", "eng": "He's got a one-track mind-all he ever thinks about is sex!"}, {"viet": "Anh ta mới có 24 tuổi, nhưng anh ta hành động như một ông trung niên.", "eng": "He's only 24, but he behaves as if he's already middle-aged."}, {"viet": "Nó chịu ảnh hưởng rất nhiều của những đứa trẻ lớn hơn.", "eng": "He's very much under the influence of the older boys."}, {"viet": "Ông ta xin gia hạn cho thị thực của ông ta.", "eng": "He applied for an extension to his visa."}, {"viet": "Anh ấy đã mua một cái áo vét tại cửa hàng bán trang phục nam.", "eng": "He bought a jacket at the gentleman's outfitters."}, {"viet": "Anh ta không đủ can đảm để xa nhà.", "eng": "He can't pluck up the courage to leave home."}, {"viet": "Chỉ cần nhìn qua một cái anh ta có thể nói ngay chiếc xe ô tô bị trục trặc cái gì.", "eng": "He could tell at a glance what was wrong with the car."}, {"viet": "Hắn không trả lời vì sợ xúc phạm đến nàng.", "eng": "He didn't answer for fear of hurting her."}, {"viet": "Nó lái xe như thằng điên-có ngày chết cho mà xem.", "eng": "He drives like a nut-he'll kill himself one day."}, {"viet": "Anh ta ngã xuống nước một cái tõm.", "eng": "He fell into the water with a splash."}, {"viet": "Anh ấy bật kêu lên một tiếng ú ớ và ngã xuống sàn.", "eng": "He gave a strangled cry and fell to the floor."}, {"viet": "Hắn đã gặp rắc rối với cảnh sát.", "eng": "He got into trouble with the police."}, {"viet": "Anh ấy chùi mặt bàn cho đến khi nào nó sáng bóng lên.", "eng": "He had polished the table-top until it gleamed."}, {"viet": "Anh ta có ham muốn kỳ lạ là làm công việc nặng nhọc.", "eng": "He has an amazing appetite for hard work."}, {"viet": "Anh ấy đã thực sự thành công với cuốn sách mới nhất của mình; nó đang bán rất chạy.", "eng": "He has really scored with his latest book; it's selling very well."}, {"viet": "Ông ta miệt mài trong công việc của mình.", "eng": "He immersed himself totally in his work."}, {"viet": "Anh ta không có khả năng và phải được thay thế.", "eng": "He is inefficient and must be replaced."}, {"viet": "Ông ta làm việc tại đại sứ quán Pháp.", "eng": "He is with the French embassy."}, {"viet": "Ông ấy đã để lại tất cả tiền bạc của mình cho bà vợ mà không nghĩ rằng bà ấy có thể chết trước ông.", "eng": "He left all his money to his wife without thinking that she might predecease him."}, {"viet": "Giọng nói anh ta trong điện thoại như thể bị bệnh vậy.", "eng": "He looks as ill as he sounded on the phone."}, {"viet": "Có thể là nó không nói nhiều nhưng nó suy nghĩ nhiều.", "eng": "He may not say much but he thinks a lot."}, {"viet": "Ông ta thường nhận những khoản tiền mặt chi trả bất hợp pháp từ các nhà phụ trách phát triển bất động sản để đổi lại việc cố ý nói giảm bớt giá trị xây dựng và công việc cải tạo.", "eng": "He often took illegal cash payments from developers in return for low balling the cost of construction and renovation work."}, {"viet": "Nó như trỏ về phía tôi.", "eng": "He pointed vaguely in my direction."}, {"viet": "Nó dán băng keo che quanh các tấm kính trong khi nó sơn các khung cửa sổ.", "eng": "He put masking tape round the edges of the glass while he painted the window frame."}, {"viet": "Ông ta đề cập đến công việc của anh bằng những lời tâng bốc.", "eng": "He referred to your work in flattering terms."}, {"viet": "Ông trị vì 45 năm.", "eng": "He rules for 45 years."}, {"viet": "Anh ta tinh quái như một con khỉ!", "eng": "He's as mischievous as a monkey!"}, {"viet": "Anh ta ở một cương vị quản lý có thế lực.", "eng": "He's in well with management."}, {"viet": "Chắc chắn hắn sẽ làm cho hư thêm.", "eng": "He's sure to bungle the job."}, {"viet": "Anh ta tiết kiệm tiền từng tí một cho đến lúc có đủ để một chiếc xe hơi.", "eng": "He saved money bit by bit until he had enough to buy a car."}, {"viet": "Ông ta bắt đầu chinh phục giới văn chương ở London.", "eng": "He set out to conquer the literary world of London."}, {"viet": "Anh ta hút thuốc lá liên tục trong suốt cuộc hành trình tới Hà Nội.", "eng": "He smoked non-stop all the way to Hanoi."}, {"viet": "Anh ta nhìn chăm chú vào chữ đó cố gắng nhớ xem nghĩa của nó là gì.", "eng": "He stared at the word trying to remember what it meant."}, {"viet": "Hắn thành công nhờ làm việc cật lực.", "eng": "He succeeded by dint of hard work."}, {"viet": "Ông suy nghĩ như sau: Bởi vì quả đất tròn và châu á trải dài thật xa về hướng Đông, nên nó phải uốn quanh một phần rộng lớn con đường vòng quanh quả đất.", "eng": "He though, and since Asia stretches so very far eastward, it must curve a large part of the way around the earth."}, {"viet": "Hắn theo con đường tội lỗi.", "eng": "He took to a life of crime."}, {"viet": "Anh ấy tẩn mẩn xoay các nút rađiô đến khi anh ấy tìm thấy đài đó.", "eng": "He twiddled with the controls of the radio until he found the station."}, {"viet": "Anh ta muốn nó là một phong trào nhiều người.", "eng": "He wants it to be a broadly based movement."}, {"viet": "Ông ta đòi giá chiếc xe là 400 pao nhưng chúng tôi đã thuyết phục ông ta hạ xuống 350 pao.", "eng": "He was asking 400 pounds for the car, but we cut him down to 350 pounds."}, {"viet": "Anh ta vô cùng ngưỡng mộ sắc đẹp và trí thông minh của cô ta.", "eng": "He was dazzled by her beauty and wit."}, {"viet": "Nó bị một tháng tù mà không được chọn cách nộp phạt.", "eng": "He was given one month's imprisonment without the option of a fine."}, {"viet": "Anh ấy là bạn đồng hành của tôi trong nhiều tháng.", "eng": "He was my travelling companion for many months."}, {"viet": "Anh ta được kính trọng, ở trong nước cũng như ở nước ngoài.", "eng": "He was respected, both at home and abroad."}, {"viet": "Anh ta là người được cả gia đình ngưỡng mộ.", "eng": "He was the admiration of his whole family."}, {"viet": "Ông ta đeo một miếng đệm đen trên mắt phải.", "eng": "He wears a black patch over his right eye."}, {"viet": "Nó ao ước sống mà quên đi được các tội ác nó đã phạm.", "eng": "He wished to unlive the crimes he has committed."}, {"viet": "Anh ta viết một bài thơ để đáp lại một sự thôi thúc bên trong.", "eng": "He wrote the poem in response to an inner calling."}, {"viet": "Diễn xuất của nàng đã làm hài lòng hàng triệu người xem.", "eng": "Her acting has given pleasure to millions of people."}, {"viet": "Vẻ duyên dáng của cô ta đã tác động đến các vị thẩm phán có lợi cho cô.", "eng": "Her charm prejudiced the judges in her favour."}, {"viet": "Cuộc đón tiếp dạt dào tình cảm của cô ấy làm chúng tôi cảm thấy không thoải mái.", "eng": "Her effusive welcome made us feel most uncomfortable."}, {"viet": "Sự giàu sang của bà ấy không hề đem lại cho bà ta hạnh phúc.", "eng": "Her great wealth brought her no happiness."}, {"viet": "Đầu tư của cô ta đã đưa đến những hậu quả thảm hại: cô mất tất cả mọi thứ cô ta có.", "eng": "Her investment had disastrous consequences: she lost everything she owned."}, {"viet": "Tôi đã không nhớ ra được tên cô ấy.", "eng": "Her name didn't register with me."}, {"viet": "Những ý niệm chính trị của cô ta rất chiết trung.", "eng": "Her political beliefs are very middle-of-the-road."}, {"viet": "Các cô chị đã dìm cô ta xuống sông một lát.", "eng": "Her sisters ducked her in the river."}, {"viet": "Việc sử ngôn ngữ thô tục của bà ấy đã vi phạm đến các quy tắc lịch sự.", "eng": "Her use of obscene language offends against the proprieties."}, {"viet": "Đây là phiếu lên máy bay của ông, cổng 1.", "eng": "Here's your boarding pass Gate 1."}, {"viet": "Sự xuất hiện con người bằng xương bằng thịt của anh ta đã chấm dứt sự đồn đại về cái chết của anh.", "eng": "His appearance in the flesh ended the rumours about his death."}, {"viet": "Phạm vi tổ chức kinh doanh của ông ta thật là rộng lớn.", "eng": "His business empire was truly vast."}, {"viet": "Bố của hắn ngoẻo cách đây đã hai năm.", "eng": "His dad snuffed it a couple of years ago."}, {"viet": "Nét mặt anh ta thật kỳ lạ khi anh ta nghe cái tin sửng sốt ấy của họ.", "eng": "His face was a study as he listened to their amazing news."}, {"viet": "Ước vọng lớn nhất của ông ta là cho con gái mình tiếp tục kinh doanh.", "eng": "His greatest wish was for his daughter to take over the business."}, {"viet": "Những lời nói đùa của ông ta đã tạo ra được một sự giảm bớt căng thẳng trong một bài nói thực sự buồn tẻ.", "eng": "His jokes provided some comic relief in what was really a dull speech."}, {"viet": "Tiền của ông ta chủ yếu ở đầu tư kinh doanh.", "eng": "His money comes mainly from business investments."}, {"viet": "Thành tích của anh ta chứng tỏ một tài năng phi thường.", "eng": "His performance displays uncommon skill."}, {"viet": "Câu trả lời của anh ta cuối cùng đã làm cho tôi hiểu một cách đầy đủ tính nghiêm trọng của tình hình.", "eng": "His reply finally brought the gravity of the situation home to me."}, {"viet": "Những câu chuyện của ông ta cho thấy sự sử dụng khá nhiều trí tưởng tượng.", "eng": "His stories showed considerable exercise of the imagination."}, {"viet": "Cuộc vận động ráo riết của ông ta đã đánh bại được đối thủ của mình.", "eng": "His vigorous campaign unhorsed his adversary."}, {"viet": "Hãy chờ một chút-tôi không nghĩ mọi người đã đến đủ.", "eng": "Hold it a second-I don't think everyone's arrived yet."}, {"viet": "Những con chó săn đang sục tìm con cáo quanh bãi cây nhỏ.", "eng": "Hounds scouring about in the copse after the fox."}, {"viet": "Làm thế nào để thuyết phục anh ấy liên kết với chúng ta được nhỉ?", "eng": "How can we persuade him into joining us?"}, {"viet": "Điện thoại di động của Nhật so với những điện thoại di động của đất nước bạn thì thế nào?", "eng": "How do Japanese cellular phones compare to those of your country?"}, {"viet": "Thời tiết ở New Zealand thế nào?", "eng": "How is the weather in New Zealand?"}, {"viet": "Có bao nhiêu nước tiếp giáp Thuỵ Sĩ?", "eng": "How many countries border Switzerland?"}, {"viet": "Vé giá bao nhiêu?''Tôi sẽ hỏi'.", "eng": "How much are the tickets?''I'll inquire'."}, {"viet": "Dạo này bao lâu bạn đến thăm cha mẹ bạn một lần?", "eng": "How often do you visit your parents these days?"}, {"viet": "Hàng trăm ngàn thuyền nhân cặp bờ một nước, những cánh tay giơ ra cầu khẩn.", "eng": "Hundreds of thousands of boat people descending on the nation, arms outstretched in need."}, {"viet": "Tôi muốn giúp lắm nhưng không thể được-thật tình đó!", "eng": "I'd like to help, but I can't-on the level!"}, {"viet": "Tôi sẽ gửi điện tín cho Paul để tìm hiểu lịch trình của anh ấy.", "eng": "I'll cable Paul to find out his schedule."}, {"viet": "Tôi dám cuộc với anh năm bảng Anh là cô ấy sẽ không đến.", "eng": "I'll lay you £ 5 that she won't come."}, {"viet": "Tôi sẽ đi bộ đến tận bưu điện với anh.", "eng": "I'll walk with you as far as the post office."}, {"viet": "Tôi hoàn toàn kiệt lực rồi-Tôi chạy suốt cả con đường đó!", "eng": "I'm completely knackered-I ran all the way!"}, {"viet": "Tôi sẽ đi đến vườn ươm cây ở Hampton để mua vài cây con.", "eng": "I'm going to the nurseries in Hampton to buy some plants."}, {"viet": "Tôi sẽ không đi chơi với anh, dứt khoát như vậy!", "eng": "I'm not going out with you and that's flat!"}, {"viet": "Tôi mệt đến nỗi khó mà có thể thức nổi.", "eng": "I'm so tired that I can hardly stay awake."}, {"viet": "Tôi ngạc nhiên về em, ở tuổi em còn chơi búp bê!", "eng": "I'm surprised at you, playing with dolls at your age!"}, {"viet": "Em vẫn luôn luôn say mê anh ấy thực sự.", "eng": "I've always had a real soft spot for him."}, {"viet": "Tôi vừa mới tìm thấy một hàng ăn tuyệt vời gần đây!", "eng": "I've discovered a super restaurant near here!"}, {"viet": "Tôi vừa mới lau sàn xong mà anh lại vứt giấy khắp nơi làm bừa bộn hết cả lên!", "eng": "I've just cleaned the floor, and you're messed it up again by dropping bits of paper everywhere!"}, {"viet": "Tôi cất quần áo mùa đông ở trên gác mái.", "eng": "I've stored my winter clothes away in the attic."}, {"viet": "Tôi luôn chạy trước khi ăn sáng.", "eng": "I always go for a run before breakfast."}, {"viet": "Tôi đang dự định theo học trường thương mai.", "eng": "I am planning to attend the trade school."}, {"viet": "Tôi hỏi bác sĩ liệu tôi có thể ngồi dậy được không.", "eng": "I asked the doctor whether I could get up."}, {"viet": "Tôi lang thang khắp châu Âu một năm trước khi vào đại học.", "eng": "I bummed around Europe for a year before university."}, {"viet": "Tuần này tôi không thể đi học vì tôi nhiễm bệnh.", "eng": "I can't go to school this week because I've got a bug."}, {"viet": "Tôi không thể làm việc khi anh cứ nói liên tu bất tận như thế.", "eng": "I can't work with you chattering away like that."}, {"viet": "Tôi không thể bị khiển trách về lỗi của họ.", "eng": "I cannot be held culpable for their mistakes."}, {"viet": "Tôi liếc mắt nhìn thấy bóng cô ta.", "eng": "I caught sight of her out of the corner of my eye."}, {"viet": "Tôi không thể nào ngủ được: đầu óc của tôi hãy còn quay cuồng vì tất cả những điều đã nhìn thấy và nghe thấy.", "eng": "I couldn't sleep: my mind was still whirling from all I had seen and heard."}, {"viet": "Tôi đã nhảy với nàng suốt đêm.", "eng": "I danced with her all night."}, {"viet": "Tôi không muốn làm phiền anh.", "eng": "I didn't like to disturb you."}, {"viet": "Tôi biết làm sao đền đáp lòng tất của ông.", "eng": "I don't know how to repay you for your kindness."}, {"viet": "Tôi không hiểu hậu quả rồi sẽ như thế nào ( từ những cái anh nói ).", "eng": "I don't see how that follows ( from what you've said )."}, {"viet": "Dẫu sao thì tôi cũng không muốn nghe cái bí mật ngu xuẩn của anh!", "eng": "I don't want to hear your stupid secret anyway!"}, {"viet": "Em nghĩ là em đã không ăn thức ăn gì bị ôi thiu cả.", "eng": "I don't think I ate anything spoiled."}, {"viet": "Tôi cảm thấy mối lo thật sự về cuộc phỏng vấn ngày mai của tôi.", "eng": "I feel a certain apprehension about my interview tomorrow."}, {"viet": "Tôi dự tính sẽ có mặt ở New York trong tháng Giêng.", "eng": "I figure on being in New York in January."}, {"viet": "Tôi đưa cho anh ta một pao và anh ta trả lại tôi 20 xu.", "eng": "I gave him a pound and he gave me 20 pence change."}, {"viet": "Anh nghĩ anh sẽ mua một kệ sách.", "eng": "I guess I'll buy a bookshelf."}, {"viet": "Tôi gặp trở ngại lớn trong việc thuyết phục cô ấy.", "eng": "I had the greatest difficulty in persuading her."}, {"viet": "Hôm nay tôi có một số việc quan trọng phải làm.", "eng": "I have a number of important things to do today."}, {"viet": "Tôi không có một ý niệm gì về điều anh nói.", "eng": "I have no conception of what you mean."}, {"viet": "Tôi phải may đường viền lai.", "eng": "I have to machine the hem."}, {"viet": "Tôi thật sự chưa quen thuộc với công việc của mình.", "eng": "I haven't really got into my job yet."}, {"viet": "Tôi hy vọng tôi có thể vào học được lớp vật lí buổi chiều.", "eng": "I hope I can ace into the afternoon physics class."}, {"viet": "Tôi nhấn mạnh là anh phải có hành động ngay để chấn chỉnh cái đó.", "eng": "I insist that you take immediate action to put this right."}, {"viet": "Tôi biết tôi đã phạm một sai lầm nhưng không cần phải nhay đi nhay lại mãi.", "eng": "I know I made a mistake but there's no need to rub it in."}, {"viet": "Tôi thích những màu chói, nhưng tôi phải cẩn thận với những màu tôi mặc.", "eng": "I like loud colors, but I have to be careful about the ones I wear."}, {"viet": "Tôi sẽ gọi điện cho anh lúc làm việc.", "eng": "I'll buzz you at work."}, {"viet": "Tôi sẽ đọc nó và viết thư trả lời ông.", "eng": "I'll read it and get back to you."}, {"viet": "Tôi e rằng tôi không hoàn toàn nghe kịp anh.", "eng": "I'm afraid I'm not quite with you."}, {"viet": "Tôi đang cho người gắn vòi nước tắm hoa sen.", "eng": "I'm having a shower installed."}, {"viet": "Tôi thấy thật tiếc vì mình vừa bỏ lỡ dịp đó.", "eng": "I'm so sorry that I just missed it."}, {"viet": "Tôi đã tìm cách thoát khỏi được những người đuổi bắt tôi.", "eng": "I managed do give my pursuers the slip."}, {"viet": "Hẳn là tôi bị lãng trí.", "eng": "I must have had a brainstorm."}, {"viet": "Tôi cần hai vé xem phim \"những viên đá lửa\".", "eng": "I need two tickets for \"The Flintstones\"."}, {"viet": "Đáng lẽ tôi đã mua được cái xe với giá rẻ hơn nhưng tôi không phải thạo mua bán lắm.", "eng": "I ought to have got a better price for the car but I'm not a very good businessman."}, {"viet": "Tôi lúng túng về việc đó hàng giờ rồi cuối cùng tự nhiên tôi thấy hiểu được.", "eng": "I puzzled over it for hours before it finally clicked."}, {"viet": "Tôi nhớ lại là anh đã phủ nhận điều đó.", "eng": "I recollect that you denied it."}, {"viet": "Tôi ngồi dậy trên thương khi tôi nghe tiếng động.", "eng": "I sat up in bed when I heart the noise."}, {"viet": "Anh sẽ luôn nghĩ đến em.", "eng": "I shall be with you in spirit."}, {"viet": "Tôi bán chiếc xe hơi của tôi ( cho một người bạn ) với giá 750 pao.", "eng": "I sold my car ( to a friend ) for 750 pounds."}, {"viet": "Tôi đoán là anh đã nhận được thư của tôi.", "eng": "I surmise that you would have received my letter."}, {"viet": "Tôi nghĩ tôi phải đi thôi.", "eng": "I think I must be going."}, {"viet": "Tôi nghĩ cô sẽ tìm được ông Wilson đang dự hội nghị ở đó.", "eng": "I think uo'll find Mr. Wilson in conference there."}, {"viet": "Tôi đã nói rõ ràng, cả quyết cho nó biết tôi nghĩ gì về nó!", "eng": "I told him what I thought of him in no uncertain terms!"}, {"viet": "Tôi nghe nói anh sắp về quê.", "eng": "I understand that you are going out of town."}, {"viet": "Tôi muốn cô ta thi lần nữa nhưng cô ta không nhiệt tình lắm về chuyện đó.", "eng": "I want her to take the exam again but her heart's not in it."}, {"viet": "Tôi muốn dùng tất cả kỳ nghỉ chỉ phơi nắng.", "eng": "I want to spend the whole holiday just basking in the sun."}, {"viet": "Tôi nhận những cú điện thoại tới tấp.", "eng": "I was deluged with phone calls."}, {"viet": "Tôi đã hạnh phúc hơn nhiều vào thời gian đó.", "eng": "I was much happier in those days."}, {"viet": "Tôi là người đến đầu tiên, và cô ta là người thứ hai.", "eng": "I was the first to arrive, and she was the second."}, {"viet": "Tôi sẽ đổi nó cho ông, ngoài ra chúng tôi sẽ không tính tiền bữa ăn tối mà ông đã gọi.", "eng": "I will change it for you and we won't charge you for the dinner you ordered."}, {"viet": "Tôi mong hoàn thành công việc này, cô ấy nói với một tiếng thở dài.", "eng": "I wished I had finished this work, she said with a sigh."}, {"viet": "Tôi làm công việc tự do và được trả theo giờ.", "eng": "I work free-lance and am paid by the hour."}, {"viet": "Tôi muốn được nâng cốc chúc tình hữu nghị và hợp tác giữa hai công ty chúng ta, chúc sức khoẻ ông Willson, chúc sức khoẻ của tất cả quý vị có mặt ở đây.", "eng": "I would like to propose a toast to the friendship and co-operation between our two corporations, to the health of Mr. Wilson, to the health of the ladies and gentlemen present here."}, {"viet": "Tôi đã viết thư đề nghị anh ấy đến vào ngày nghỉ cuối tuần.", "eng": "I wrote suggesting that he should come for the weekend."}, {"viet": "Nếu tôi không nhầm thì đó là người đàn ông chúng ta đã trông thấy trên xe buýt.", "eng": "If I'm not mistaken, that's the man we saw on the bus."}, {"viet": "Nếu cô ta phát hiện ra điều này, cô ta sẽ lấy hết.", "eng": "If she finds out about it, she would take it all."}, {"viet": "Nếu chúng tôi đặt hàng với các ông thì tôi nghĩ giảm giá 10% mới đủ.", "eng": "If we are to place an order with you, I think a discount of about 10% would be sufficient."}, {"viet": "Nếu bạn không trả lời được câu hỏi thì cứ để trống.", "eng": "If you can't answer the question, leave a blank."}, {"viet": "Nếu không phải làm gì bạn sẽ mau chán.", "eng": "If you had nothing to do you'd soon become bored."}, {"viet": "Nếu anh cho rằng tôi sẽ thanh toán tất cả các hoá đơn cho anh thì anh cần phải suy nghĩ lại đi.", "eng": "If you think I'm going to pay all your bills you've got another think coming."}, {"viet": "Những sự kiện quan trọng xảy ra liên tiếp.", "eng": "Important events occurred in rapid sequence."}, {"viet": "Trong môn cricket, quả bóng được ném qua vai.", "eng": "In cricket, the ball is delivered overarm."}, {"viet": "Trên nhiều tàu thuyền lớn hiện giờ người ta sử dụng loại la bàn khác nữa.", "eng": "In many big boats of today another kind of compass is also used."}, {"viet": "Nếu vậy … cám ơn cô.", "eng": "In that case …, thank you."}, {"viet": "Về mùa hè, trái cây bội thu có thể được bảo quản bằng đông lạnh hoặc đóng chai.", "eng": "In the summer, large crops of fruit may be preserved by freezing or bottling."}, {"viet": "Thật là đáng ngạc nhiên, không một ai trước đó nghĩ ra được ý kiến giản đơn như thế.", "eng": "Incredibly, no one had ever thought of such a simple idea before."}, {"viet": "Anh ấy là một trong số người tốt hay trong đám kẻ xấu?", "eng": "Is he one of the goodies or one of the baddies?"}, {"viet": "Phải chăng thế giới đang đi đến thảm hoạ?", "eng": "Is the world headed for disaster?"}, {"viet": "Có phải đây là nơi chúng ta chuyển đường ( đường rẽ ) đi tới Hải Phòng không?", "eng": "Is this where we turn off ( the road turns off ) for Hai Phong?"}, {"viet": "Thật sự rắc rối khi đổi tiền mặt đo la Mỹ ở sân bay.", "eng": "It's a real problem cashing US dollars at the airport."}, {"viet": "Giễu cợt người nói lắp là tàn nhẫn.", "eng": "It's cruel to make fun of people who stammer."}, {"viet": "Có một người nào đó để có thể thổ lộ tâm sự.", "eng": "It's important to have someone that you can confide in."}, {"viet": "Điều đó không đúng là cái mà tôi muốn, nhưng nó sẽ thoả mãn được mục đích của tôi.", "eng": "It's not exactly what I wanted but it will serve my purpose."}, {"viet": "Cô ấy hấp tấp nói thật kỳ lạ khi gặp được bạn.", "eng": "It's so marvellous to see you! she twittered."}, {"viet": "Ở đây thật là êm ái, ngọt ngào, đúng là ấm áp dễ chịu.", "eng": "It's very gentle and sweet up here, it's sort of haimish."}, {"viet": "Đến 6 giờ 45 nó mới mở cửa.", "eng": "It doesn't open until six forty-five."}, {"viet": "Khó có thể quen được với phong tục của một nước khác.", "eng": "It is difficult to get used to another country's customs."}, {"viet": "Đọc và sửa bản in thử là một nhiệm của anh ta.", "eng": "It is part of your duties to proofread."}, {"viet": "Anh nói gì đối với tôi không quan trọng, tôi đã quyết định rồi.", "eng": "It makes no difference to me what you say, I've already decided."}, {"viet": "Đó là mọi thứ anh thấy và nghe.", "eng": "It's everything you see and hear."}, {"viet": "Dường như sự thất bại của hắn đã được định trước rồi.", "eng": "It seemed that his failure was predestined."}, {"viet": "Nhà vô địch quần vợt đã phải chơi mấy ván mới đánh giá được đối thủ của mình.", "eng": "It took the tennis champion a few games to get the measure of his opponent."}, {"viet": "Anh thật là dũng cảm dám nói việc mình làm.", "eng": "It was courageous of you to say what you did."}, {"viet": "Anh thật là nghệch khi có dịp mà chẳng nói được gì.", "eng": "It was rather wet of you to say nothing when you had the chance."}, {"viet": "Mặc quần áo chỉ mất một phút.", "eng": "It will only take a minute to get dressed."}, {"viet": "Jane hình như không có ở đây, cô ấy hẳn là đã đi rồi.", "eng": "Jane doesn't seem to be here, she must've left."}, {"viet": "Johnson đã đoạt được huy chương vàng trong môn 100 mét.", "eng": "Johnson got the gold medal in the 100 metres."}, {"viet": "Cứ đi tiếp cho tới khi anh đến một bùng binh lớn.", "eng": "Keep going until you reach a large roundabout."}, {"viet": "Ta hãy cân nhắc điều lợi điều hại của việc chuyển nhà.", "eng": "Let's consider the pluses and minuses of moving house."}, {"viet": "Trước hết chúng ta hãy bắt đầu với ý tưởng của Martin.", "eng": "Let's start with Martin's idea first."}, {"viet": "Nhiều chuyến đi chơi đã được các bạn cùng nghỉ thu xếp.", "eng": "Many excursions had been arranged by the holiday company."}, {"viet": "Nhiều từ đã được thêm vào quyển từ điển xuất bản lần này.", "eng": "Many words have been added to this edition of the dictionary."}, {"viet": "Xin cho tôi một cái mền và gối nhé?", "eng": "May I have a blanket and pillow?"}, {"viet": "Có lẽ ông đã nhầm số rồi.", "eng": "Maybe you've made a mistake in pushing the numbers."}, {"viet": "Hầu hết những chuyện về đời tư của anh ta đều có vẻ là bịa đặt.", "eng": "Most of the stories about his private life are probably apocryphal."}, {"viet": "Phần lớn lượng bơ tiêu thụ ở Anh là được sản xuất tại Niu Di-lân.", "eng": "Much of the butter eaten in England comes from New Zealand."}, {"viet": "Con gái tôi đang học trường Đại họa ABC.", "eng": "My daughter is attending ABC University."}, {"viet": "Ảnh hưởng của tôi đối với bà ta là nhỏ mọn, cho nên bà ta sẽ không làm theo lời tôi đâu.", "eng": "My influence over her is small, so she won't do as I say."}, {"viet": "Đời tư của tôi không phải là chuyện của anh.", "eng": "My private life is none of your business."}, {"viet": "Toàn dân đoàn kết nhất trí trong thời chiến tranh là điều cần thiết.", "eng": "National unity is essential in wartime."}, {"viet": "Tuần tới chúng ta sẽ đóng cửa để kiểm kê.", "eng": "Next week we shall be closed for stock-taking."}, {"viet": "Chẳng con cá nào bị câu hai lần bởi một cái mồi duy nhất.", "eng": "No fish is caught twice with the same bait."}, {"viet": "Bây giờ, chúng ta hãy tạm nghỉ để uống cà phê đã.", "eng": "Now, let's break off for a cup of coffee."}, {"viet": "Những ý kiến phản đối kế hoạch sẽ được lắng nghe một cách có thiện cảm.", "eng": "Objections to the plan will be listened to sympathetically."}, {"viet": "Ồ, tốt hơn ông nên đến bệnh viện.", "eng": "Oh, you'd better go to the hospital."}, {"viet": "Bằng vào những trận đấu mới đây không có khả năng đội Tây Ban Nha sẽ giật cúp.", "eng": "On the evidence of their recent matches it's unlikely the Spanish team will win the cup."}, {"viet": "Một trong những người biện hộ hàng đầu cho chiến lược kinh tế của Chính phủ.", "eng": "One of leading apologists for the government's economic strategy."}, {"viet": "Súng phòng không của ta đã hạ được năm máy bay ném bom của địch.", "eng": "Our anti-aircraft guns accounted for five enemy bombers."}, {"viet": "Cốc của chúng ta đã bị đổi vị trí-Cái này là của tôi.", "eng": "Our glasses have been switched-this is mine."}, {"viet": "Giá của chúng tôi là từ 2, 50 pao một chai trở lên.", "eng": "Our prices start from 2.50 pounds a bottle."}, {"viet": "Mệt lử vì bị nôn sau khi ăn thịt sống.", "eng": "Overcome by nausea after eating raw meat."}, {"viet": "Việc trả tiền tuỳ thuộc vào việc chuyển hàng.", "eng": "Payment of the money is conditional upon delivery of the goods."}, {"viet": "Có lẽ anh không nên nói chung chung về vấn đề đó.", "eng": "Perhaps you oughtn't to generalize about that."}, {"viet": "Cảnh sát nói rằng người đó có vũ khí và rất nguy hiểm.", "eng": "Police say the man is armed and dangerous."}, {"viet": "Richard đã đổi tiền mặt tất cả những trái phiếu của anh ấy.", "eng": "Richard cashed in all his bonds."}, {"viet": "Nhiều trẻ em lên sởi và những đứa khác chắc chắn cũng sẽ mắc bệnh.", "eng": "Several children have measles, and the others are bound to succumb."}, {"viet": "Cô ta sẽ hiểu và tha thứ, cô ta thật sự rất nhân hậu.", "eng": "She'll understand and forgive, she's really quite human."}, {"viet": "Cô ấy đã bị ốm nhưng bây giờ đi lại bình thường rồi.", "eng": "She's been ill but now she's back in circulation."}, {"viet": "Cô ấy hồi hộp vì phải phát biểu trước một đám đông như thế.", "eng": "She's in a lather about having to speak to such a large crowd."}, {"viet": "Bà ta đưa ra những đề nghị cấp tiến về việc cải cách bầu cử.", "eng": "She's putting forward radical proposals for electoral reform."}, {"viet": "Cô ta đã muốn trở thành diễn viên từ khi còn bé.", "eng": "She's wanted to go on the stage from an early age."}, {"viet": "Cô ta ngoảnh đi nơi khác để khỏi nhìn thấy cảnh đáng sợ.", "eng": "She averted her eyes from the terrible sight."}, {"viet": "Cô ấy sang số để làm cho xe lên đồi nhanh hơn.", "eng": "She changed gear to make the car go up the hill faster."}, {"viet": "Cô ta không dám chường mặt ra đường.", "eng": "She dares not show her face in the street."}, {"viet": "Cô ấy hình như không có cảm giác tội lỗi đối với hành vi xấu xa của mình.", "eng": "She doesn't seem to feel any guilt for her bad behaviour."}, {"viet": "Cô ta cảm thấy bị coi thường vì không ai nói chuyện với cô.", "eng": "She felt slighted because no one spoke to her."}, {"viet": "Cô ấy không tỏ ra một dấu hiệu nỗi buồn phiền nào trong lòng.", "eng": "She gives no outward sum of the sadness she must feel."}, {"viet": "Cô ta trông chờ nhiều ở những gì trường đại học mang lại.", "eng": "She had high expectations of what university had to offer."}, {"viet": "Trong tình cảm của anh ấy, cô ta đã bị người khác chiếm chỗ.", "eng": "She has been supplanted by another in his affections."}, {"viet": "Cô ấy giúp đỡ tôi khi tôi nằm viện.", "eng": "She helped me out when I was in hospital."}, {"viet": "Cô ta không được tự do theo sở thích của mình trong vấn đề hôn nhân.", "eng": "She is not free to follow her own inclination in the matter of marriage."}, {"viet": "Chị ấy làm cho tâm trạng mình tương tự như tâm trạng những người khách khác.", "eng": "She keyed her mood to that of the other guests."}, {"viet": "Cô ta nhìn tôi vẻ căm thù.", "eng": "She looked me with an expression of hatred."}, {"viet": "Cô ta hụt mất giải nhất trong gang tấc.", "eng": "She missed the first prize by a whisker."}, {"viet": "Cô ta trình diễn các bài hát theo phong cách riêng và độc đáo.", "eng": "She performs the songs with style and flair."}, {"viet": "Cô ta phản ứng lại lời xúc phạm bằng cách quay lưng lại với nó.", "eng": "She reacted to the insult by turning her back on him."}, {"viet": "Cô ấy thạo việc trồng hoa hồng.", "eng": "She's adept at growing roses."}, {"viet": "Bà ta đã quá tuổi sinh nở.", "eng": "She's past child-bearing age."}, {"viet": "Cô ta nói cô có quan hệ họ hàng với nhà vua.", "eng": "She says she is related to royal family."}, {"viet": "Cô ta cho chúng tôi xem phần thưởng điền kinh mà cô ta đã giành được.", "eng": "She shows us the athletics award she had won."}, {"viet": "Cô ta hướng dẫn tôi về phía cái bàn ở trong góc.", "eng": "She steered me towards a table in the corner."}, {"viet": "Bà ta có khuynh hướng phản ứng quá gay gắt khi hỏng việc.", "eng": "She tends to over-react when things go wrong."}, {"viet": "Cô ta rẽ trái ở cuối con đường.", "eng": "She turned left at the end of the road."}, {"viet": "Cô ta là một kẻ lường gạt lão luyện và đã lợi dụng tính cả tin của ông già.", "eng": "She was a practiced swindler and took advantage of the old man's confiding nature."}, {"viet": "Cô ấy hoàn toàn bị bối rối bởi câu hỏi thứ hai.", "eng": "She was completely flummoxed by the second question."}, {"viet": "Cô ta ở trong tình trạng hết sức tồi tệ khi chúng tôi đến nơi.", "eng": "She was in a terrible state when we arrived."}, {"viet": "Suốt cả buổi tối, cô ta đã bị gạ gẫm ăn nằm nhiều lần.", "eng": "She was propositioned several times in the course of the evening."}, {"viet": "Cô ta là người duy nhất đáp lại lời mời-những người khác chẳng ai quan tâm đến.", "eng": "She was the only person who replied to the invitation-none of the others bothered."}, {"viet": "Cô ta vui vẻ làm công việc của cô ta.", "eng": "She went cheerfully about her work."}, {"viet": "Cô ấy thắng kiện và được một khoản tiền chi phí tại toà.", "eng": "She won the case and was awarded costs."}, {"viet": "Rượu seri là một trong những cái tật nhỏ của tôi đấy!", "eng": "Sherry is one of my little vices!"}, {"viet": "Các tiệm sửa chữa xe bên hè phố, nơi bày la liệt các bộ phận xe đạp, xe ô tô và xe gắn máy, đang được các thợ máy xem xét kỹ lưỡng.", "eng": "Sidewalk repair shops, where the entrails of bicycles and cars and motorcycles are spread, mechanics poring over them."}, {"viet": "Hãy ngồi phía bên này của xe buýt khi có chỗ ngồi.", "eng": "Sit on this side of the bus when there's a seat."}, {"viet": "Smith đã từ chức'.'Tôi cũng đã hiểu như vậy qua báo chí'.", "eng": "Smith's resigned'.'I gathered as much from the newspapers'."}, {"viet": "Chẳng có hy vọng gì đi ra nước ngoài-chúng ta có thể quên điều đó đi.", "eng": "So much for our hopes of going abroad-we can forget it."}, {"viet": "Vài cậu nhỏ mê sưu tầm tem thư.", "eng": "Some boys have a craze for stamp-collection."}, {"viet": "Vài con đường đi bộ trong vùng này chỉ có thể đi được vào mùa khô.", "eng": "Some of the walks in this area are only possible in dry weather."}, {"viet": "Có một số người có mặt ở buổi họp ngày hôm qua.", "eng": "Some were at the meeting yesterday."}, {"viet": "Xin lỗi, tôi không có ý làm bạn sợ.", "eng": "Sorry, I didn't mean to frighten you."}, {"viet": "Tiếng Anh đàm thoại rất quan trọng nếu anh thật sự muốn học giỏi tiếng Anh.", "eng": "Spoken English is very important if you really want to learn English well."}, {"viet": "Thái độ của Stephen khiến cha mẹ hắn lo lắng nhiều.", "eng": "Stephen's behaviour occasioned his parents much anxiety."}, {"viet": "Đừng huýt sáo nữa! Tiếng đó đang làm tôi khó chịu!", "eng": "Stop whistling! It's getting on my nerves!"}, {"viet": "Thành công trong việc kiếm tiền không phải luôn luôn là một tiêu chuẩn tốt của sự thành công trong đời.", "eng": "Success in making money is not always a good criterion of success in life."}, {"viet": "Đường được biến thành cồn qua quá trình lên men.", "eng": "Sugar is converted into alcohol through the process of fermentation."}, {"viet": "Thề trung thành với Nữ hoàng.", "eng": "Swear an oath of allegiance to the Queen."}, {"viet": "Rẽ theo đường thứ hai bên tay trái.", "eng": "Take the second turning to the left."}, {"viet": "Vô tuyến được dùng làm phương tiện để quảng cáo.", "eng": "Television is used as a medium for advertising."}, {"viet": "Xin cám ơn ông về nhiều ân tình của ông.", "eng": "Thank you for your many kindliness."}, {"viet": "Thế nên má tôi muốn học tiếng Nhật nào?", "eng": "That's why my mother wants to learn Japanese?"}, {"viet": "Cô gái đó đúng là một người cần cù!", "eng": "That girl is certainly a worker!"}, {"viet": "Việc đó chắc là cực nhọc lắm!", "eng": "That must have taken some doing!"}, {"viet": "Giá đó y như giá tôi thuê nhà vậy.", "eng": "That's the same as my rent."}, {"viet": "Đó là phần cốt lõi trong lập luận của ông ấy.", "eng": "That was the pith of his argument."}, {"viet": "Trách nhiệm của chính quyền địa phương đối với Nghị Viện.", "eng": "The accountability of local government to Parliament."}, {"viet": "Hiệp định là một sự thoả hiệp, chứ không phải là một sự phản bội.", "eng": "The agreement is a compromise, not a sell-out."}, {"viet": "Lời tuyên bố đã khẳng định những nghi ngờ của tôi.", "eng": "The announcement confirmed my suspicions."}, {"viet": "Con tatu có vỏ bảo vệ bằng những lá xương.", "eng": "The armadillo has a protective shell of bony plates."}, {"viet": "Cuộc tấn công đó đã xảy ra bất ngờ.", "eng": "The attack occurred without advance warning."}, {"viet": "Đứa bé vừa nhỏ nước dãi xuống cà vạt của tôi.", "eng": "The baby's just dribbled down my tie."}, {"viet": "Ngân hàng và công ty xây dựng ở trong cùng một khu nhà văn phòng.", "eng": "The bank and the building society are in the same office-block."}, {"viet": "Bãi biển ấy dốc thoai thoải về phía biển.", "eng": "The beach slopes gently to the sea."}, {"viet": "Thùng rác cần phải đem đổ, đầy rác rồi.", "eng": "The bin needs emptying, it's full of rubbish."}, {"viet": "Con thuyền bị giạt mạnh xô vào vách đá.", "eng": "The boat was dashed against the rocks."}, {"viet": "Sách sẽ được phát chuyển miễn phí.", "eng": "The book will be delivered post-free."}, {"viet": "Bọn trẻ giả bộ là những nhà du hành vũ trụ.", "eng": "The boys made believe they were astronauts."}, {"viet": "Sự chuẩn bị dần dần cho cuộc thăm viếng của Tổng thống.", "eng": "The build-up to the President's visit."}, {"viet": "Việc kinh doanh lụn bại vì thua lỗ.", "eng": "The business has been crippled by looses."}, {"viet": "Chiếc xe đâm vào vỉa hè.", "eng": "The car bumped against the kerb."}, {"viet": "Tấm kính chắn gió xe ô-tô bị sương giá phủ suốt đêm.", "eng": "The car windscreen frosted over during the night."}, {"viet": "Trần nhà sụp xuống và gạch vụn tuôn xuống căn phòng.", "eng": "The ceiling collapsed and rubble poured into the room."}, {"viet": "Vẻ đẹp của nơi đó chẳng bao lâu sẽ làm anh phải chú ý.", "eng": "The charm of the place soon gets under your skin."}, {"viet": "Đứa bé đọc chuyện nhưng không hiểu được ý nghĩa đầy đủ của nó.", "eng": "The child read the story but did not comprehend its full meaning."}, {"viet": "Những đứa trẻ hì hục trèo qua những tảng đá.", "eng": "The children clambered over the rocks."}, {"viet": "Bọn trẻ dính bùn từ đầu đến chân.", "eng": "The children were covered in mud from head to toe."}, {"viet": "Thành phố bị máy bay địch bắn súng máy.", "eng": "The city is machine-gunned by enemy planes."}, {"viet": "Mây hé ra và mặt trời chiếu xuyên xuống.", "eng": "The clouds parted and the sun shone through."}, {"viet": "Những ngọn đèn màu trông thật đẹp mắt.", "eng": "The coloured lights are very decorative."}, {"viet": "Công ty đó đã tạo được một khoảng cách dẫn đầu khá xa về kỹ thuật la-de.", "eng": "The company has built up a substantial lead in laser technology."}, {"viet": "Máy vi tính tái tạo các dữ kiện thành một bộ biểu đồ.", "eng": "The computer reproduced the data as a set of diagrams."}, {"viet": "Sự tương phản giữa ánh sáng và bóng tối là quan trọng trong nhiếp ảnh.", "eng": "The contrast of light and shade is important in photography."}, {"viet": "Đất nước có nguồn cung cấp dầu và khí đốt thừa thãi.", "eng": "The country has abundant supplies of oil and gas."}, {"viet": "Các thợ thủ công bán sản phẩm của mình cho du khách.", "eng": "The craftsmen sell their work to visitors."}, {"viet": "Đám đông ùn ùn ra qua cổng.", "eng": "The crowd was swarming out through the gates."}, {"viet": "Đập nước bị vỡ, nó không đủ sức để cản nước lũ.", "eng": "The dam gave way, it was not strong enough to hold the flood waters."}, {"viet": "Cuộc thua đó là một tổn thương đối với lòng tự hào của ông ấy.", "eng": "The defeat was a wound to his pride."}, {"viet": "Thám tử giả làm người đưa tang trong đám tang nạn nhân.", "eng": "The detective posed as a mourner at the victim's funeral."}, {"viet": "Cuộc tranh luận biến thành một trận cãi nhau kịch liệt.", "eng": "The discussion deteriorated into a bitter quarrel."}, {"viet": "Bác sĩ kê cho tôi một đơn thuốc.", "eng": "The doctor made me out a prescription."}, {"viet": "Con chó nhảy chồm vào kẻ đột nhập, sủa điên cuồng.", "eng": "The dog jumped at the intruder with frenzied barks."}, {"viet": "Ngăn kéo chặt quá tôi không mở được.", "eng": "The drawer is so tight I can't open it."}, {"viet": "Trái đất có tâm và vỏ bao quanh.", "eng": "The earth has a core and a mantle around it."}, {"viet": "Sự trang điểm một quyển sách, một toà nhà, một bài nói.", "eng": "The embellishment of a book, a building, a speech."}, {"viet": "Sự vào sổ tất cả các khoản chi tiêu là cần thiết.", "eng": "The entry of all the expenditure is necessary."}, {"viet": "Hành vi gương mẫu của những người anh hùng.", "eng": "The exemplary behavior of the heroes."}, {"viet": "Các sự kiện liên quan tới vấn đề này.", "eng": "The facts are relative to this problem."}, {"viet": "Nét đặc trưng của cái nhà này là cái mái bằng.", "eng": "The feature of the house is the flat roof."}, {"viet": "Ngôi sao màn bạc đi du lịch, tên tuổi giấu kín.", "eng": "The film star was travelling incognito."}, {"viet": "Hãng này đã từng trải qua nhiều thăng trầm.", "eng": "The firm has had good times and bad times."}, {"viet": "Người phụ nữ đầu tiên vượt sông Amazon một mình.", "eng": "The first woman to navigate the Amazon alone."}, {"viet": "Thức ăn thật tuyệt và rượu cũng vậy.", "eng": "The food was excellent likewise the wine."}, {"viet": "Những người bạn thỉnh thoảng gặp nhau chuyện gẫu về những ngày tốt đẹp xưa kia ở trường học.", "eng": "The friends met occasionally to chat about the good old days at school."}, {"viet": "Khu vườn kéo dài đến tận sông.", "eng": "The garden extends all the way to the river."}, {"viet": "Cô gái nghĩ ngợi một lúc rồi trả lời.", "eng": "The girl looked thoughtful for a moment and then answered."}, {"viet": "Sở tình báo mật của chính phủ.", "eng": "The government's Secret Intelligence Service."}, {"viet": "Chính phủ bị phân hóa về vấn đề này.", "eng": "The Government is divided on this issue."}, {"viet": "Vẻ uyển chuyển thể hiện trong bước nhảy của nữ diễn viên ba-lê.", "eng": "The grace with which a ballerina leaps into the air."}, {"viet": "Nhóm đã tách ra khỏi hiệp hội chính thức.", "eng": "The group have split off from the official union."}, {"viet": "Mưa đá kêu lách cách trên cái mái bằng thiếc.", "eng": "The hailstones rattled on the tin roof."}, {"viet": "Con gà mái rúc đầu vào cánh.", "eng": "The hen tucked her head under her wing."}, {"viet": "Những con ngựa đó đã nhảy vượt qua được tất cả hàng rào.", "eng": "The horses jumped all the fences."}, {"viet": "Ngôi nhà lắp hai lớp kính vào cửa sổ đằng trước và đằng sau.", "eng": "The house is double-glazed back and front."}, {"viet": "Túp lều làm bằng những tấm gỗ.", "eng": "The hut was made out of pieces of wood."}, {"viet": "Bảng tra nằm ở cuối cuốn ( sách ).", "eng": "The index is at the back ( of the book )."}, {"viet": "Các quyền lợi của những người hưu trí có chiều hướng thay đổi.", "eng": "The interests of senior citizens trend to be varied."}, {"viet": "Cuối cùng công việc cũng sắp hoàn thành.", "eng": "The job is at last nearing completion."}, {"viet": "Chuột túi là loài vật bản địa của Úc.", "eng": "The kangaroo is a native of Australia."}, {"viet": "Khu đất đó được chuyển cho một hội từ thiện theo di chúc.", "eng": "The land demised to a charitable institution."}, {"viet": "Ông luật sư tìm hiểu các chi tiết về những chuyện làm ăn của thân chủ.", "eng": "The lawyer acquainted himself with the details of his client's business affairs."}, {"viet": "Ứng cử viên đảng Tự do đã thắng dễ dàng với hàng ngàn phiếu hơn.", "eng": "The Liberal candidate romped in with thousands of votes to spare."}, {"viet": "Dân địa phương này lúc nào cũng rất thân thiện đối với các khách du lịch.", "eng": "The local people are always very friendly towards tourists."}, {"viet": "Đường M6 rẽ nhánh khỏi đường M1 ngay phía bắc Rugby.", "eng": "The M6 diverges from the M1 just north of Rugby."}, {"viet": "Ông ấy là người hoàn toàn giả dối.", "eng": "The man's a complete phoney."}, {"viet": "Thầy toán tức giận và bắt tôi chép phạt 50 dòng.", "eng": "The maths teacher was furious and gave me 50 lines."}, {"viet": "Cuộc họp sẽ được hoãn cho tới sau này.", "eng": "The meeting will be postponed until afterwards."}, {"viet": "Vị Bộ trưởng đã triệu tập một cuộc họp báo ngay khi được biết kết quả.", "eng": "The Minister called a press conference as soon as the results were known."}, {"viet": "Con khỉ bới vào lông con bạn nó để bắt bọ chét.", "eng": "The monkey scratched about in its mate's fur for fleas."}, {"viet": "Con đường núi chỉ có thể qua lại được về mùa hè.", "eng": "The mountain route that is practicable only in summer."}, {"viet": "Bài quốc ca nghe như thế này này.", "eng": "The national anthem goes like this."}, {"viet": "Thời trang mới mau chóng mất đi vẻ hấp dẫn của nó.", "eng": "The new fashion soon lost its appeal."}, {"viet": "Các quy định mới về an toàn bây giờ đang có hiệu lực.", "eng": "The new safety regulations are now in force."}, {"viet": "Tờ báo đã nhận được một đống thư khiếu nại.", "eng": "The newspaper received a huge post-bag of complaints."}, {"viet": "Cuốn tiểu thuyết này có thể là một cuốn sách bán chạy, nhưng cũng chỉ là một tác phẩm khá mà thôi.", "eng": "The novel may be a best seller, but it's no more than a competent piece of writing."}, {"viet": "Chú bé chạy giấy của văn phòng sẽ đi giao cái gói đó.", "eng": "The office boy will deliver the package."}, {"viet": "Ông lão ấy gần kề miệng lỗ.", "eng": "The old man was nearing his end."}, {"viet": "Dàn nhạc chơi với một âm thanh rất ấm và êm dịu.", "eng": "The orchestra had a distinctively warm and mellow sound."}, {"viet": "Tranh vẽ ấy có một vị trí quan trọng trong bộ sưu tập của anh ta.", "eng": "The painting has pride of place in his collection."}, {"viet": "Bữa tiệc được tổ chức mà cô ta không hề hay biết gì cả.", "eng": "The party was organized without her knowing about it."}, {"viet": "Người dân đang dần dần chán ngấy chiến tranh.", "eng": "The people are growing weary of the war."}, {"viet": "Bức ảnh cho thấy cô ta mặc đồ đen.", "eng": "The photo shows her dressed in black."}, {"viet": "Các bảng áp phích lên án hành động của chính phủ.", "eng": "The placards condemned the government's action."}, {"viet": "Những cây này chết vì thiếu nước.", "eng": "The plants died from want of water."}, {"viet": "Lỗ tháo nước trong bồn rửa mặt của phòng chúng tôi bị tắc.", "eng": "The plughole in our washbasin is clogged."}, {"viet": "Cảnh sát đã nhìn thấy trước sự rắc rối do những người mê bóng đá gây ra và đã có mặt rất đông trên sân bãi.", "eng": "The police had anticipated trouble from the soccer fans and were at the ground in large numbers."}, {"viet": "Cảnh sát cố xuyên tạc lời khai của ông ta thành lời thú nhận tội.", "eng": "The police tried to twist his statement into an admission of guilt."}, {"viet": "Chiếc lọ sứ được bọc trong bông.", "eng": "The porcelain vase was enveloped in cotton."}, {"viet": "Ông giám đốc hiện tại chịu trách nhiệm về sự giảm sút lợi nhuận nhanh chóng của công ty.", "eng": "The present director has presided over a rapid decline in the firm's profitability."}, {"viet": "Báo chí muốn phá vỡ kế hoạch của ông ta giành chức tổng thống.", "eng": "The press wants to sink his bid for the presidency."}, {"viet": "Quận chúa làm lễ thành hôn và mọi người đã đổ vào thành phố nhân dịp trọng đại này.", "eng": "The princess was getting married, and everyone was in town for the great occasion."}, {"viet": "Đám rước thong thả đi xuống chân đồi.", "eng": "The procession moved slowly down the hill."}, {"viet": "Bên nguyên, trong vụ kiện này, dựa vào chứng cứ của hai nhân chứng.", "eng": "The prosecution based their case on the evidence of two witnesses."}, {"viet": "Chất lượng thức ăn của khách sạn thay đổi rõ rệt.", "eng": "The quality of the hotel food is distinctly variable."}, {"viet": "Mưa đập vào kính chắn gió của xe.", "eng": "The rain beat against the car windscreen."}, {"viet": "Sự hoà hợp ý kiến quan điểm.", "eng": "The reconciliation of ideas, opinions, etc."}, {"viet": "Bản báo cáo có vẻ gây ấn tượng nhưng thật ra chỉ toàn những điều lăng nhăng.", "eng": "The report looks impressive but it's really nothing but waffle."}, {"viet": "Tờ tạp chí đã không phê bình gì tính chất bạo lực trong bộ phim.", "eng": "The review is uncritical of the violence in the film."}, {"viet": "Con đường rẽ về hướng tây.", "eng": "The road bears to the west."}, {"viet": "Căn phòng nồng nặc mùi nước hoa rẻ tiền.", "eng": "The room reeked of cheap perfume."}, {"viet": "Bao xi măng đập xuống đất nghe cái huỵch.", "eng": "The sack of cement hit the ground with a thump."}, {"viet": "Quang cảnh đó không giống với bất cứ cái gì tôi đã thấy trước đây.", "eng": "The scenery was unlike anything I'd been before."}, {"viet": "Ghế danh dự ở đầu bàn.", "eng": "The seat of honour at the head of the table."}, {"viet": "Chuyến tàu bảy giờ rất tiện cho chúng tôi.", "eng": "The seven o'clock train will suit us very well."}, {"viet": "Con tàu chỉ là một chấm nhỏ ở chân trời.", "eng": "The ship was a mere speck on the horizon."}, {"viet": "Con vật ốm đang sùi bọt mép.", "eng": "The sick animal was frothing at the mouth."}, {"viet": "Da trên thân thể bà ấy khô và có vảy.", "eng": "The skin on her body was dry and scaly."}, {"viet": "Những đảng viên Đảng Xã hội có vẻ đã sẵn sàng để thắng trong cuộc tổng tuyển cử.", "eng": "The socialists look set for victory set to win the general election."}, {"viet": "Âm thanh của bộ phim phải ăn khớp với động tác trong phim.", "eng": "The sound on a film must synchronize with the action."}, {"viet": "Hình vuông này có diện tích chín centimét vuông.", "eng": "The square has an area of nine square centimetres."}, {"viet": "Thị trường chứng khoán rất nhạy bén với những chuyển biến chính trị có thể xảy ra.", "eng": "The Stock Exchange is sensitive to likely political changes."}, {"viet": "Các đàn dây được chơi nhỏ hơn trong suốt các nhịp cuối cùng của bản giao hưởng.", "eng": "The strings are muted throughout the closing bars of the symphony."}, {"viet": "Mặt trời lọt qua những đám mây dầy.", "eng": "The sun penetrated through the thick clouds."}, {"viet": "Người lái tắc-xi đưa chúng tôi đi con đường quanh dài.", "eng": "The taxi-driver brought us a long way round."}, {"viet": "Đội bóng đã cống hiến một trận đấu tuyệt vời.", "eng": "The team put up a splendid performance."}, {"viet": "Lý thuyết này được dựa trên cơ sở một loạt những giả định sai.", "eng": "The theory is based on a series of wrong assumptions."}, {"viet": "Giờ ở Luân Đôn sớm hơn năm tiếng so với giờ ở New York.", "eng": "The time in London is five hours ahead of the time in New York."}, {"viet": "Phong tục hôn nhau dưới cây tầm gửi.", "eng": "The tradition of kissing under the mistletoe."}, {"viet": "Vật biếu ông ta là hoàn toàn xứng đáng.", "eng": "The tribute accorded him was fully deserved."}, {"viet": "Hai dân tộc chính của nước Tiệp Khắc.", "eng": "The two main nationalities of Czechoslovakia."}, {"viet": "Các công đoàn đang đe doạ đất nước, thí dụ bằng một cuộc bãi công trên toàn quốc.", "eng": "The unions are holding the country to ransom."}, {"viet": "Cha xứ giảng đạo cho giáo dân trong nửa giờ.", "eng": "The vicar preached to the congregation for half an hour."}, {"viet": "Những bức tường của ngôi nhà cũ đó vỡ ra từng mảnh.", "eng": "The walls of that old house are crumbling."}, {"viet": "Câu châm ngôn nổi tiếng'kiến thức là sức mạnh'.", "eng": "The well-known dictum'knowledge is power'."}, {"viet": "Gió rì rào qua rừng thông.", "eng": "The wind soughing through the pine trees."}, {"viet": "Công việc thì gay go mà giờ thì dài.", "eng": "The work is arduous and the hours are long."}, {"viet": "Thanh niên trong xã hội ta cần phải được chăm sóc và bảo vệ.", "eng": "The young in our society need care and protection."}, {"viet": "Ngài Công tước và nữ Công tước xứ Kent.", "eng": "Their Graces, the Duke and Duchess of Kent."}, {"viet": "Sở thích của chúng nó khác với sở thích của tôi.", "eng": "Their tastes are different to mine."}, {"viet": "Rồi em sẽ vào tiểu bang và biết đâu em có thể trở thành hoa hậu Mỹ.", "eng": "Then you go to the state contest, and you knows, you might become Miss America."}, {"viet": "Và cũng có sự chênh lệch giữa giá mua và giá bán.", "eng": "There's also a difference between buying rate and selling rate."}, {"viet": "Trong cửa hàng này không có cái gì giá cao hơn một đô la cả.", "eng": "There's nothing in this shop over a dollar."}, {"viet": "Có bốn-Ồ, không, quên đi! Sáu cái đỏ và ba cái xanh.", "eng": "There are four-no, bag that! Six of the red ones and three blue ones."}, {"viet": "Có một số bức ảnh đẹp ở cuộc trưng bày này.", "eng": "There are some good photographs in this exhibition."}, {"viet": "Rất ít sự tiến bộ trong kì học này.", "eng": "There has been very little progress this tern."}, {"viet": "Có một sự đồng cảm lạ lùng giữa bà già đó và đứa cháu trai của bà ta.", "eng": "There is a strange empathy between the old lady and her grandson."}, {"viet": "Chỉ có một danh sách ứng cử cho dân bầu.", "eng": "There is only one list of candidates for the people to vote for."}, {"viet": "Đã xảy ra hoả hoạn và công trình năm nghiên cứu thế là đi tây.", "eng": "There was a fire, and five years of research work went west."}, {"viet": "Không có chứng cớ thật sự nào chứng tỏ anh ta lầm.", "eng": "There was no tangible evidence to prove that he was wrong."}, {"viet": "Có ba mươi người trong khách sạn không kể các nhân viên.", "eng": "There were thirty people in the hotel, excluding the hotel staff."}, {"viet": "Những người Cơ Đốc giáo đầu tiên này đã bị người La Mã đối xử tàn tệ.", "eng": "These early Christians were treated badly by the Romans."}, {"viet": "Những vấn đề này ngoài phạm vi cuộc điều tra của chúng tôi.", "eng": "These questions lie outside the purview of our country."}, {"viet": "Chúng nó không phải là anh em sinh đôi, nhưng rất giống nhau.", "eng": "They're not twins, but they're very like."}, {"viet": "Họ giải trí bằng cách xem những bức ảnh cũ.", "eng": "They amused themselves by looking at old photographs."}, {"viet": "Họ đến vào một lúc thật bất tiện-chúng tôi vừa mới bắt đầu ăn cơm.", "eng": "They arrived at an inconvenient time-we had just started the meal."}, {"viet": "Chúng ra ngoài khi mặt trời lặn để tìm thức ăn.", "eng": "They come out at sundown to hunt for their food."}, {"viet": "Họ đã cám dỗ những người đầu tư bằng những ảo tưởng về sự giàu có ngay lập tức.", "eng": "They drew investors on with visions of instant wealth."}, {"viet": "Tất cả bọn họ từng người một đã đi đến cùng một kết luận.", "eng": "They had all severalty reached the same conclusion."}, {"viet": "Ngay tức khắc chúng bắt đầu ăn hết trứng này đến trứng khác.", "eng": "They immediately begin eating one another up."}, {"viet": "Chúng nó có thể được miễn làm bài tập này.", "eng": "They may be excused this exercise."}, {"viet": "Họ rao giảng về những học thuyết mới khắp châu Âu.", "eng": "They preached the new doctrines throughout Europe."}, {"viet": "Họ đã đi tìm khắp vùng quê để tìm đứa con bị thất lạc.", "eng": "They scoured the countryside for the lost child."}, {"viet": "Khi ấy họ thông báo ( cho tất cả chúng tôi biết ) những gì đã được quyết định.", "eng": "They then declared ( to us all ) what had been decided."}, {"viet": "Họ nóng ruột mong viện trợ sẽ được gửi đến nhanh.", "eng": "They were anxious that aid should be sent promptly."}, {"viet": "Họ được xe cứu thương đưa đến bệnh viện gần nhất.", "eng": "They were taken by ambulance to the nearest hospital."}, {"viet": "Thành tựu này chứng tỏ cô ấy có khả năng là một thiên tài.", "eng": "This achievement stamps her as a genius."}, {"viet": "Thứ quần áo này bán chạy trong thị trường thanh thiếu niên.", "eng": "This clothing sell well to the teenage market."}, {"viet": "Sự kiện này xảy ra trước khi tìm ra Châu Mỹ nhiều thế kỷ.", "eng": "This event antedates the discovery of America by several centuries."}, {"viet": "Đây là tấm ảnh của Mary, bối cảnh là ngôi nhà của chúng tôi.", "eng": "This is a photo of Mary, with our house in the background."}, {"viet": "Tôi là Tom Smith ở phòng 910.", "eng": "This is Tom Smith in Room 910."}, {"viet": "Chiếc máy bay mới đòi hỏi rất nhiều ở tài năng người lái.", "eng": "This new aircraft makes tremendous demands of the pilot."}, {"viet": "Vấn đề này đã làm tôi bận tâm lâu dài.", "eng": "This problem has worried me for a long time."}, {"viet": "Lời phát biểu này quan trọng ở chỗ là nó đã bộc lộ mức độ hiểu biết của họ.", "eng": "This statement was important insomuch as it revealed the extent of their knowledge."}, {"viet": "Đây sẽ là trận đầu tiên của cô ta thi đấu cho quốc gia, chả là cô ấy chưa lần nào được dự một trận như thế.", "eng": "This will be her first match for her country, she hasn't yet been blooded."}, {"viet": "Ba ngàn người thuộc về thủy thủ đoàn của con tàu và ba ngàn người thuộc về phi hành đoàn.", "eng": "Three thousand belong to the ship's crew and three thousand belong to the flight crew."}, {"viet": "Đêm nay nhiệt độ sẽ tụt xuống ba độ dưới điểm đông.", "eng": "Tonight the temperature will fall to 3 degrees below freezing."}, {"viet": "Nếu cậu không đi ngay, cậu sẽ bị muộn.", "eng": "Unless you go at once you will be late."}, {"viet": "Rửa bát đĩa là cái việc tôi không thích.", "eng": "Washing the dishes is a task I do not enjoy."}, {"viet": "Chúng ta sẽ cần hơn một ấm trà cho hai mươi người.", "eng": "We'll need more than one brew of tea for twenty people."}, {"viet": "Chúng tôi chỉ mới kinh doanh ngành này thôi, tôi e là hiện giờ chúng tôi chưa thể giao dịch nhiều.", "eng": "We're just taking up the line, I'm afraid we can't do much right now."}, {"viet": "Chúng tôi thích giới thiệu thành phố cho anh và cách chúng tôi tổ chức lễ mừng ngày 4 tháng bảy.", "eng": "We've enjoyed showing you the town and how we celebrate the fourth of July."}, {"viet": "Khi cô ấy ra đi, tất cả chúng tôi đều cảm thấy hoàn toàn lẻ loi.", "eng": "We all felt absolutely desolate when she left."}, {"viet": "Chúng ta đang ở giai đoạn đầu của một phát hiện lớn.", "eng": "We are on the threshold of a great discovery."}, {"viet": "Chúng tôi gọi đó là “ Tả ý ” hay tranh ấn tượng.", "eng": "We call it xieyi or impressionistic painting."}, {"viet": "Chúng tôi không thể thuê thêm nhân viên trong tình hình kinh tế trong nước như thế này.", "eng": "We cannot afford to employ more staff in the current economic climate."}, {"viet": "Chúng tôi lặn sâu xuống biển trong kỳ nghỉ hè của chúng tôi.", "eng": "We did some deep-sea diving while we were on holiday."}, {"viet": "Khi lên tới đỉnh núi chúng tôi có cảm giác đã đạt được một thành quả.", "eng": "We felt a great sense of achievement when we reached the top of the mountain."}, {"viet": "Chúng tôi ăn trưa tại chiếc bàn quen thuộc cạnh cửa sổ.", "eng": "We had lunch at our usual table by the window."}, {"viet": "Chúng ta còn có đủ tiền để vượt qua tuần này.", "eng": "We have enough money to see through the week."}, {"viet": "Chúng tôi không có phương tiện để tự mình làm công trình cho nên chúng tôi sẽ cho thầu.", "eng": "We haven't the resources to do the work ourselves, so we'll put it out to contract."}, {"viet": "Chúng tôi sẽ phục vụ bữa ăn sáng miễn phí cho ông.", "eng": "We'll give you a free breakfast."}, {"viet": "Chúng ta phải gặp nhau mặt đối mặt để mà thảo luận tình hình.", "eng": "We must discuss the situation eyeball to eyeball."}, {"viet": "Chúng ta cần cái thang để lên gác xép.", "eng": "We need the steps to get into the loft."}, {"viet": "Chúng tôi đọc nhiều thơ ở trường-bây giờ tôi còn nhớ rất ít.", "eng": "We read a lot of poetry at school-I remember very little now."}, {"viet": "Chúng tôi sẽ rất vui nếu các ông gửi cho chúng tôi một bản ca-ta-lô mới nhất của các ông.", "eng": "We should be glad if you would send us a copy of your latest catalogue."}, {"viet": "Chúng tôi đã gọi bà ngay sau khi nó được tìm thấy, nhưng bà đã đi mất.", "eng": "We tried to call you back as soon as it was found, but you had gone away."}, {"viet": "Lòng chúng tôi xốn xang bồn chồn về ngày cưới.", "eng": "We were all of a twitter on the wedding day."}, {"viet": "Chúng tôi đã được bồi dưỡng một bữa điểm tâm no nê để chuẩn bị cho chuyến đi.", "eng": "We were well primed for the journey with a large breakfast."}, {"viet": "Cố kết một đám tân binh chưa qua huấn luyện thành một lực lượng chiến đấu hữu hiệu.", "eng": "Weld a bunch of untrained recruits into an efficient fighting force."}, {"viet": "À, thư ông A, năm trăm năm mơi đô la của ông được đổi thành 4760.", "eng": "Well, Mr. A, your five hundred and fifty dollars are changed into ¥ 4,760."}, {"viet": "Cậu đang giấu cái gì thế?''Đừng có tò mò như thế!'.", "eng": "What's that you're hiding?''Don't be so inquisitive!'."}, {"viet": "Ở nước bạn, một số việc làm bán thời gian tiêu biểu dành cho học sinh trung học là những việc gì?", "eng": "What are some typical part-time jobs for high school students in your country?"}, {"viet": "Bạn đã làm gì trên máy bay?", "eng": "What did you do in the airplane?"}, {"viet": "Cỡ dây kim loại nào chúng ta phải dùng cho việc này?", "eng": "What gauge of wire should we use for this job?"}, {"viet": "Tên trường đại học hàng đầu ở nước bạn là gì?", "eng": "What is the name of the leading university in your country?"}, {"viet": "Đó là loại công việc gì vậy?", "eng": "What kind of work is that?"}, {"viet": "Bạn thích xem môn thể thao nào?", "eng": "What sports do you like to watch?"}, {"viet": "Vậy thì khi nào anh bạn trai của cô đến ăn cơm tối?", "eng": "When's your young man coming to dinner, then?"}, {"viet": "Khi chồng cô ấy chết, cô ấy đã nhận được 50.000 pao tiền bảo hiểm.", "eng": "When her husband died, she received 50000 pounds in insurance."}, {"viet": "Khi Scott tiến đến Nam cực, ông nhận ra rằng Amundsen đã đến trước mình rồi.", "eng": "When Scott reached the South Pole, he found Amundsen had anticipated him."}, {"viet": "Khi họ muốn chưng diện cho một dịp lễ đặc biệt, họ có thể gắn lông chim, sơn vẽ hoặc đeo trang sức lên người.", "eng": "When they want to dress up for a special occasion they may put on feathers, paint, or jewelry."}, {"viet": "Tôi có thể đoán xe buýt ở đâu?", "eng": "Where can I catch the bus?"}, {"viet": "Công ty nào nổi tiếng về đổi mới?", "eng": "Which company is famous for being innovative?"}, {"viet": "Ông thích loại nào hơn thức ăn Trung Quốc hay thức ăn phương Tây?", "eng": "Which would you prefer, Chinese or Western?"}, {"viet": "Ai được chuẩn bị biện hộ cho bị cáo?", "eng": "Who is prepared to speak for the accused?"}, {"viet": "Theo bạn thì tại sao sự phân biệt đối xử vẫn tồn tại?", "eng": "Why do you think discrimination exists?"}, {"viet": "Sự cố ý không vâng lời, sự cẩu thả có chủ ý, tội cố sát, sự phung phí có chủ tâm.", "eng": "Wilful disobedience, negligence, murder, waste."}, {"viet": "Cô vui lòng nói với ông Green là tôi đang có mặt ở đây?", "eng": "Will you please tell Mr. Green I'm here?"}, {"viet": "Với vẻ đẹp, trí thông minh và sự duyên dáng của cô ta, anh ấy thấy cô thật hấp dẫn không cưỡng lại được.", "eng": "With her beauty, wit and charm, he found her irresistible."}, {"viet": "Làm được ít tiền như vậy thật chẳng bõ bèn.", "eng": "Working for so little money just isn't worthwhile."}, {"viet": "Tối nay bạn có muốn đi nghe nhạc giao hưởng với tôi không?", "eng": "Would you like to attend the symphony with me this evening?"}, {"viet": "Cô vui lòng mang bữa ăn trưa dành cho hai người đến phòng của tôi được không?", "eng": "Would you please send lunch for two to my room?"}, {"viet": "Vâng, nhưng hãy đợi chuyến kế tiếp.", "eng": "Yes, but please wait for the next one."}, {"viet": "Còn, chúng tôi còn một vài vé.", "eng": "Yes, we do have a few left."}, {"viet": "Anh sẽ phải giải thích kỹ cho tôi-tôi không được sáng ý cho lắm.", "eng": "You'll have to explain it to me carefully-I'm not very quick on the uptake."}, {"viet": "Anh thật là tệ! Đến luộc trứng anh cũng không biết sao?", "eng": "You're pathetic! Can't you even boil an egg?"}, {"viet": "Anh là nguồn hy vọng cuối cùng của tôi, nếu anh không giúp được, tôi sẽ bị phá sản.", "eng": "You are my last hope, if you can't help, I'm ruined."}, {"viet": "Cậu không dám ngồi ở quán rượu mà uống Cocacola nữa, đồ mặc váy đàn bà!", "eng": "You can't sit in a pub and drink coke, you big girl's blouse!"}, {"viet": "Cháu có thể để chúng vào cái rổ này.", "eng": "You can put them in this basket."}, {"viet": "Đồ vô trách nhiệm! Tao không thể tin được mày lại khoá chìa ở trong xe!", "eng": "You ditz! I can't believe you locked your keys in your car!"}, {"viet": "Bạn phải ăn mặc đẹp khi đến nhà hàng này.", "eng": "You have to dress up at this restaurant."}, {"viet": "Có thể là cậu bực mình, nhưng thật ra chẳng có gì đáng phải làm ầm ĩ lên cả.", "eng": "You may be a bit upset, but it's really nothing to make a song and dance about."}, {"viet": "Anh ta phải nói với cô ấy cho rõ là hành vi của cô ấy không thể chấp nhận được.", "eng": "You must make it clear to her that her behaviour is not acceptable."}, {"viet": "Anh hứa với chúng tôi chất đốt, nhưng anh có thể bảo đảm cung cấp không?", "eng": "You promised us fuel, but can you guarantee its supply?"}, {"viet": "Anh phải ký một hợp đồng để làm cho công việc của anh trở thành hợp thức.", "eng": "You should sign a contract to make your job situation regular."}, {"viet": "Ý kiến của anh về Mary là rất đúng-cô ấy rất tốt.", "eng": "You were right about Mary-she's very nice."}, {"viet": "Hành động của anh đã làm cho hợp đồng của chúng ta trở nên không có giá trị.", "eng": "Your action has rendered our contract invalid."}, {"viet": "Hộ chiếu của anh cho anh có quyền được chữa bệnh không mất tiền.", "eng": "Your passport qualifies you to receive free medical treatment."}]