[{"viet": "Một bao lơn nhô ra bên trên đường phố.", "eng": "A balcony that projects over the street."}, {"viet": "Một cái hang có vẻ ghê sợ.", "eng": "A cave that smells of terror."}, {"viet": "Một đại đội phòng vệ nhịp nhàng đi qua.", "eng": "A company of guardsmen swung past."}, {"viet": "Một đám đông đã tụ tập bên ngoài cổng tòa đại sứ.", "eng": "A crowd had already collected outside the embassy gates."}, {"viet": "Một cuộc thảo luận với sự đóng góp ý kiến của tất cả các thành viên trong nhóm đó.", "eng": "A discussion with input from all members of the group."}, {"viet": "Một vài mầm cây hoa thủy tiên đã nhú lên.", "eng": "A few daffodils were already poking up."}, {"viet": "Một vòi nước phun nước óng ánh lên cao.", "eng": "A fountain threw high its silvery water."}, {"viet": "Một giáo viên giỏi phải có khả năng lôi cuốn sự chú ý của học trò.", "eng": "A good teacher must be able to hold her pupils'attention."}, {"viet": "Một người đàn ông không có đầu hiện ra ở lâu đài ấy.", "eng": "A headless man haunts the castle."}, {"viet": "A sắp đổi một vài đô la Mỹ sang nhân dân tệ.", "eng": "A is going to change some US dollars into RMB."}, {"viet": "Một lớp bụi trên đồ đạc.", "eng": "A layer of dust on the furniture."}, {"viet": "Nhiều người đến đây.", "eng": "A lot of people come here."}, {"viet": "Một khối tuyết và đá vỡ ra và rơi trúng những người leo núi.", "eng": "A mass of snow and rock broke away and fell on the climbers."}, {"viet": "Một lời giải thích lung tung chắc là không hiểu nổi.", "eng": "A muddled explanation which was scarcely intelligible."}, {"viet": "Một quyển tiểu thuyết bị các bình luận gia chỉ trích thậm tệ.", "eng": "A novel savaged by the reviewers."}, {"viet": "Một cuộc hành trình băng qua núi đầy hiểm họa.", "eng": "A perilous journey across the mountains."}, {"viet": "Một cuộc trình tấu đầy thi vị của bản xônat soạn cho đàn piano.", "eng": "A poetic rendering of the piano sonata."}, {"viet": "Một dự án sớm hơn kế hoạch.", "eng": "A project that is ahead of schedule."}, {"viet": "Một bản dịch bằng tiếng Tây Ban Nha của bản gốc tiếng Ả Rập.", "eng": "A rendering in Spanish of the original Arabic."}, {"viet": "Một tuyển tập điển hình các tác giả truyện ngắn Mỹ.", "eng": "A sampler of American short-story writers."}, {"viet": "Một người lười biếng không bao giờ chịu làm việc và thường xuyên đi vay mượn kẻ khác.", "eng": "A shiftless individual who never works and constantly borrows from others."}, {"viet": "Một tên bắn tỉa nấp trên mái nhà đã nhắm bắn hạ ba trong số binh sĩ đang tuần tiễu.", "eng": "A sniper hidden on a roof picked off three of the soldiers on patrol."}, {"viet": "Một sự gia tăng đáng kể theo thống kê về các vấn đề y tế.", "eng": "A statistically significant increase in health problems."}, {"viet": "Một cái ngắt điện không hoạt động.", "eng": "A switch that doesn't work."}, {"viet": "Một thành phố nổi tiếng về những tòa nhà đẹp, là một trung tâm nghỉ mát dưỡng sức.", "eng": "A town noted for its fine buildings, as a health resort."}, {"viet": "Mức tăng lương 5% tương ứng với một khoản tăng hàng năm 250 bảng Anh cho các công nhân có lương thấp nhất.", "eng": "A wage rise of 5% represents an annual increase of £ 250 for the lowest-paid workers."}, {"viet": "Một nhà văn thiếu nhạy cảm về đối thoại.", "eng": "A writer with a tin ear for dialogue."}, {"viet": "Diễn kịch là nghề kiếm cơm của anh ấy.", "eng": "Acting is his bread and butter."}, {"viet": "Sau khoảng một phút chúng tôi đã gặp anh ta.", "eng": "After a minute or two we saw him."}, {"viet": "Sau nhiều tháng khoan, người ta đã tìm thấy dầu hoả ở ngoài khơi.", "eng": "After months of drilling, oil was found off the coast."}, {"viet": "Sau cuộc họp của công đoàn, tất cả các công nhân đều nhất trí.", "eng": "After the union meeting the workers were all of one mind."}, {"viet": "Trong thời chiến, mọi hàng hóa có thể được nhà nước trưng thu.", "eng": "All goods may be forfeit to the State in time of war."}, {"viet": "Tất cả những người nhảy múa đã xếp một hàng từ các xe hơi và xe tải ở đằng kia.", "eng": "All the dancers made a line from the cars and trucks over there."}, {"viet": "Viết nơi chốn và ngày tháng như quy định luôn.", "eng": "Also write place and date as specified."}, {"viet": "Một thành tích còn vô địch cho đến ngày nay.", "eng": "An achievement that remains unmatched to this day."}, {"viet": "Một cố gắng hợp lý hóa chính tả tiếng Anh.", "eng": "An attempt to rationalize English spelling."}, {"viet": "Một cuộc đốt pháo bông ngoạn mục.", "eng": "An eye-popping display of fireworks."}, {"viet": "Một cổ tục không dễ gì đưa được vào thế giới hiện đại.", "eng": "An old custom that does not transplant easily to the modern world."}, {"viet": "Hãy phân tích mẫu vật này và nhận dạng nó.", "eng": "Analyze the sample and identify it."}, {"viet": "Những thông báo về sự sinh đẻ, cưới hỏi, tang chế xuất hiện trên một vài tờ báo.", "eng": "Announcements of births, marriages and deaths appear in some newspapers."}, {"viet": "Xin nhà xuất bản cho phép in lại một trích dẫn.", "eng": "Apply to the publishers for permission to reprint an extract."}, {"viet": "Bạn khiêu vũ rất giỏi phải không?", "eng": "Are you a very good dancer?"}, {"viet": "Anh mà lại khờ khạo đến đỗi có thể tin vào những gì tên láo toét đó nói với anh sao?", "eng": "Are you simple enough to believe what that liar tells you?"}, {"viet": "Để tái bút bức thư, anh ta viết thêm rằng anh ta yêu cô nàng.", "eng": "As a postscript to his letter he added that he loved her."}, {"viet": "Khi mức dung nạp ma túy của anh nghiện tăng, anh ta đòi hỏi những liều ma túy ngày càng lớn hơn.", "eng": "As the addict's tolerance increases, he requires ever larger doses of the drug."}, {"viet": "Vào lúc rạng đông, toán quân bắt đầu hoạt động.", "eng": "At daybreak the troops went into action."}, {"viet": "Athens là một đô thị lâu đời.", "eng": "Athens is a city of great antiquity."}, {"viet": "Chỉ có cà nhẹ chiếc xe ôtô khác bằng thanh cản.", "eng": "Barely kissed the other car with the bumper."}, {"viet": "Bị cầm cố hết mọi thứ.", "eng": "Be mortgaged up to the hilt."}, {"viet": "Trước khi mua một căn nhà, cần phải nhớ kiểm tra cẩn thận hệ thống điện.", "eng": "Before buying a house make sure you have the electrics checked."}, {"viet": "Bill từ quán rượu trở về rất say.", "eng": "Bill came home from the pub considerably the worse for wear."}, {"viet": "Ô hay quá, hân hạnh được gặp anh!", "eng": "Boy, am I glad to see you!"}, {"viet": "Thiết lập một hệ thống lưu trữ dữ liệu hữu dụng.", "eng": "Build up a bank of useful references."}, {"viet": "Nhưng tôi tưởng ông cũng muốn giảm cân!", "eng": "But I thought you wanted to lose weight!"}, {"viet": "Nhưng bạn biết không, tôi không những cần ngồi viết mà còn cần phải suy nghĩ, cần đi loanh quanh và hút thuốc nữa.", "eng": "But you know, I not only need to sit down and write, I also need to think, to be able to wander around and smoke."}, {"viet": "Nhân tiện hãy cho một cái hẹn nếu bạn muốn.", "eng": "By the way, please bring a date if you want."}, {"viet": "Liệu đó có phải lỗi của tôi không khi người ta không chịu đọc các điều hướng dẫn?", "eng": "Can I help it if people don't read the instructions?"}, {"viet": "Anh vui lòng làm việc thay cho tôi cho đến khi tôi quay lại nhé?", "eng": "Can you cover for me until I get back?"}, {"viet": "Anh có thể nhớ lại điều đó đã được làm như thế nào không?", "eng": "Can you recollect how it was done?"}, {"viet": "Đại úy Jones ở trong số những người mất tích.", "eng": "Captain Jones is among the missing."}, {"viet": "Các vị trí thứ tự trong danh sách các đĩa nhạc pop bán chạy nhất là do số đĩa hát bán được ấn định.", "eng": "Chart placings are determined by the number of records sold."}, {"viet": "Những bao thuốc bị ném vào rãnh nước.", "eng": "Cigarette packets thrown into the gutter."}, {"viet": "Nào, nào, cô Jones, hãy thận trọng về lời cô nói.", "eng": "Come, come, Miss Jones, be careful what you say."}, {"viet": "Kết tội bằng những lời nói thẳng thắn nhất.", "eng": "Condemnation in the most forthright language."}, {"viet": "Bản quyền sẽ hết hạn 50 năm sau ngày tác giả chết.", "eng": "Copyright expires 50 years after the death of the author."}, {"viet": "Vui lòng cho tôi biết giờ làm việc của quý vị?", "eng": "Could you please tell me your hours?"}, {"viet": "Các đám đông những người cổ vũ bóng đá bị sự cuồng loạn tập thể lôi cuốn.", "eng": "Crowds of football supporters gripped by mass hysteria."}, {"viet": "Trong những tranh vẽ thần chết thường được minh họa là bộ xương người.", "eng": "Death is often shown in pictures as a human skeleton."}, {"viet": "Mặc dù cô ấy phê bình, cơ bản cô ta vẫn rất thích anh.", "eng": "Despite her criticisms, she is basically very fond of you."}, {"viet": "Bạn đã đi du lịch theo nhóm phải không?", "eng": "Did you go on a group tour?"}, {"viet": "Thật thất vọng, anh ta chả cho chúng tôi biết thêm điều gì mới.", "eng": "Disappointingly, he had nothing new to show us."}, {"viet": "Đừng đối lập ý kiến của anh với ý kiến của tôi.", "eng": "Do not oppose your will against mine."}, {"viet": "Anh có cho chính anh là người thô lỗ không?", "eng": "Do you consider yourself a rude person?"}, {"viet": "Bạn có những người bạn ở xa không?", "eng": "Do you have any long distance friendships?"}, {"viet": "Cô có thích được nhìn chằm chằm không?", "eng": "Do you like being stared at?"}, {"viet": "Anh có thấy lùm cây đằng kia không?", "eng": "Do you see yonder clump of trees?"}, {"viet": "Bạn có muốn gửi nó bảo đảm không?", "eng": "Do you want it to be registered?"}, {"viet": "Công ty bạn có tổ chức những những bữa tiệc hát karaoke không?", "eng": "Does your company have karaoke parties?"}, {"viet": "Đừng có làm ra vẻ bắt nạt tôi!", "eng": "Don't come the bully with me!"}, {"viet": "Đừng dựa vào bàn kẻo nó nghiêng đấy.", "eng": "Don't lean on the table or it'll tip up."}, {"viet": "Đừng có đứng ngoài mà để người khác làm tất cả công việc.", "eng": "Don't stand aside and let others do all the work."}, {"viet": "Ông không có đồng hồ sao?", "eng": "Don't you have a watch?"}, {"viet": "Đám thanh niên say sưa lang thang ngoài đường phố tìm cách gây sự.", "eng": "Drunken youths roaming the streets looking for trouble."}, {"viet": "Einstein, một trong những nhà thông thái lỗi lạc của thời đại.", "eng": "Einstein, one of the towering intellects of the age."}, {"viet": "Thoát khỏi cuộc sống thực tại hàng ngày.", "eng": "Escape from the reality of everyday existence."}, {"viet": "Ai cũng giận bạn cả, tôi không thể che chở cho bạn.", "eng": "Everyone's angry with you, and I can't screen you."}, {"viet": "Tập nhẫn nhục trong việc giao dịch với mọi người.", "eng": "Exercise forbearance in dealing with people."}, {"viet": "Nạn đói thường theo sau chiến tranh.", "eng": "Famine often follows on the heels of war."}, {"viet": "Sự trung thành với kịch bản.", "eng": "Fidelity to the text of the play."}, {"viet": "Cá lăn ruột bánh mì rồi đem chiên.", "eng": "Fish covered with breadcrumbs and then fried."}, {"viet": "Các nơi nấu thức ăn phải được giữ sạch sẽ.", "eng": "Food preparation areas must be kept clean."}, {"viet": "Các cựu chiến binh gặp khó khăn trong việc thích ứng với cuộc sống dân sự.", "eng": "Former soldiers who have difficulty in adjusting to civilian life."}, {"viet": "Giận dữ vì sự lừa gạt của hắn, nàng đã đả kích hắn bằng một tràng sỉ vả.", "eng": "Furious at his deceit, she let fly at him with a stream of abuse."}, {"viet": "Nhấc đít lên làm việc đi nào!", "eng": "Get off your butts and do some work!"}, {"viet": "Giấy nợ ai 20 bảng Anh.", "eng": "Give somebody an IOU for £ 20."}, {"viet": "Một thành phố tiêu điều giữa một vùng đèo xa xôi hẻo lánh.", "eng": "God forsaken little town in the middle of nowhere."}, {"viet": "Những người khách muốn uống thứ gì đó.", "eng": "Guests who would like something to drink."}, {"viet": "Xe lửa ở Luân Đôn đến chưa?", "eng": "Has the train from London arrived?"}, {"viet": "Bạn có bao giờ đi nghe đàn nhạc giao hưởng Boston chưa?", "eng": "Have you ever been to the Boston Symphony?"}, {"viet": "Anh không đắn đo tí nào về hàng ăn cắp sao?", "eng": "Have you no scruples about buying stolen goods?"}, {"viet": "Rồi có ngày nó sẽ bị trừng phạt đích đáng.", "eng": "He'll get his come up pance one of these days."}, {"viet": "Anh ấy luôn luôn vui lòng giúp đỡ khi chúng tôi thiếu nhân viên.", "eng": "He's always willing to help out when we're short of staff."}, {"viet": "Cuối cùng thì hắn đã bỏ đi, và thế là rảnh nợ.", "eng": "He's gone at least, and good riddance."}, {"viet": "Sau khi bị bệnh anh ta đứng chưa vững lắm.", "eng": "He's not very steady on his legs after his illness."}, {"viet": "Anh ta rất công khai, anh hôn tôi lên cả hai má.", "eng": "He's very demonstrative: he kissed me on both cheeks."}, {"viet": "Anh ấy đáp lại tiếng gọi của bổn phận và đăng kí vào quân đội.", "eng": "He answered the call of duty and enlisted in the army."}, {"viet": "Hắn ăn ở trọ nhà tôi cho đến khi hắn tìm được một căn hộ.", "eng": "He boarded with me until he found a flat."}, {"viet": "Anh ta không chịu nổi sự nhạo báng.", "eng": "He can't bear to be laughed at."}, {"viet": "Anh ta không chịu nổi cái nóng cùng cực ở sa mạc.", "eng": "He could not tolerate the extremes of heat in the desert."}, {"viet": "Anh ta chẳng quan tâm tới những lời chế giễu của tôi, và cứ tiếp tục nói huyên thuyên.", "eng": "He did not heed my gibes, and chattered on."}, {"viet": "Anh ấy vạch ra sự khác biệt hoàn toàn giả tạo giữa nam và nữ độc giả.", "eng": "He drew a quite artificial distinction between men and women readers."}, {"viet": "Anh ấy không kham nổi công việc đó.", "eng": "He fell down on the job."}, {"viet": "Anh ta thúc ngựa phi theo con đường mòn.", "eng": "He galloped the horse along the track."}, {"viet": "Bài luận của nó đạt điểm tối đa.", "eng": "He got full marks for his essay."}, {"viet": "Ông ta đã không nhắc gì đến lời thỉnh cầu của anh.", "eng": "He had no mention of your request."}, {"viet": "Ông ta có cả một kho những câu chuyện tiếu lâm thô tục.", "eng": "He has a wide repertoire of dirty jokes."}, {"viet": "Hầu hết nội dung của cuốn sách này ông ta đã ăn cắp từ các công trình nghiên cứu trước đây về thời đại đó.", "eng": "He has plagiarized most of the book from earlier studies of the period."}, {"viet": "Anh ta tuôn ra mấy câu chửi thề với bà vợ rồi bước ra, đóng sầm cửa lại.", "eng": "He hurled a few oaths at his wife and walked out, slamming the door."}, {"viet": "Ông ấy lớn hơn bà ta vài tuổi.", "eng": "He is her elder by several years."}, {"viet": "Anh ta rất sùng đạo; thế giới vật chất ít có sự thu hút đối với anh ta.", "eng": "He is very religious; corporeal world has little interest for him."}, {"viet": "Ông ta để lại một bà vợ góa và hai đứa con.", "eng": "He leaves a widow and two children."}, {"viet": "Anh ta nhìn thẳng về phía cửa.", "eng": "He looked pointedly at the door."}, {"viet": "Anh ấy đã kết hôn với con gái ông chủ, phải không?", "eng": "He married his boss's daughter, didn't he?"}, {"viet": "Anh ta cho là trời có thể mưa.", "eng": "He observed that it would probably rain."}, {"viet": "Nó chơi piano một cách dễ dàng đáng ngạc nhiên.", "eng": "He plays the piano with surprising facility."}, {"viet": "Ông ta coi trọng vấn đề chăm sóc con cái hơn tất cả các thứ khác.", "eng": "He put his children's welfare above all other considerations."}, {"viet": "Anh ta thừa nhận là mình thiếu trình độ chuyên môn để đảm đương cương vị đó.", "eng": "He recognized his lack of qualifications that he was not qualified for the post."}, {"viet": "Ông ấy đã hoàn tất đường công danh của mình bằng cách trở thành bộ trưởng bộ nội vụ.", "eng": "He rounded off his career by coming home secretary."}, {"viet": "Anh ta là đứa trẻ vụng về, ngang ngược.", "eng": "He's an awkward, contrary child."}, {"viet": "Hắn ta không thích kể chuyện đùa.", "eng": "He's in mood for telling jokes."}, {"viet": "Anh ấy vừa đi khỏi được vài phút rồi.", "eng": "He's stepped out for a few minutes."}, {"viet": "Anh ta ngồi đó tê dại khi bóng ma lướt qua phòng.", "eng": "He sat there petrified as the ghost glided across the room."}, {"viet": "Ông ta bán mấy cái kẹo cho bọn trẻ.", "eng": "He served some sweets to the children."}, {"viet": "Nó trượt khỏi cái thang và ngã xuống đất.", "eng": "He slipped off the ladder and fell to the ground."}, {"viet": "Nó xóc thịt bằng cái nĩa vào thịt.", "eng": "He stabbed the meat with his fork his fork into the meat."}, {"viet": "Ông đã học nghề bác sĩ để rồi sau này làm bộ trưởng.", "eng": "He studies to be a doctor and then to be a minister."}, {"viet": "Hắn cho hắn là người giỏi nhất.", "eng": "He thinks he's the cat's whiskers."}, {"viet": "Nó thi vào trường nhưng không đỗ.", "eng": "He took the entrance exam but didn't get in."}, {"viet": "Anh ta quay lại đương đầu với họ như con cáo ở bước đường cùng.", "eng": "He turned to face them like a fox at bay."}, {"viet": "Anh ta muốn đi toa lét và hỏi xem anh ta có thể rời phòng được không.", "eng": "He wanted to go to the toilet, and asked if he could leave the room."}, {"viet": "Nó đã bị bắt vì bị nghi là ăn cắp số tiền đó.", "eng": "He was arrested on suspicion of having stolen the money."}, {"viet": "Anh ta bị kết tội buôn ma tuý và bị trục xuất khỏi nước.", "eng": "He was convicted of drug offences and deported."}, {"viet": "Cậu ta được cho 820 pao để chi tiêu, nhưng đã thủ túi phần lớn.", "eng": "He was given 820 pounds for expenses, but pocket most of it."}, {"viet": "Anh ta rõ ràng là vui vẻ hơn trước đây.", "eng": "He was markedly more pleasant than before."}, {"viet": "Ông ta được đón tiếp như một vị khách danh dự.", "eng": "He was received as an honoured visitor."}, {"viet": "Anh ta đang nói chuyện với bạn của mình ở bên ngoài cửa.", "eng": "He was talking to his friends outside the house."}, {"viet": "Ông ta không phải là người thành công với tư cách một giáo viên.", "eng": "He wasn't a success as a teacher."}, {"viet": "Anh ta sẽ có một hy vọng xuất ngoại.", "eng": "He will stand a chance of going abroad."}, {"viet": "Ông ta viết văn dưới bút hiệu là Nimrod.", "eng": "He writes under the name of Nimrod."}, {"viet": "Bản báo cáo của bà ấy đúng trong mọi chi tiết.", "eng": "Her account is correct in every particular."}, {"viet": "Sự nghiệp của cô ta gắn chặt với sự nghiệp của anh ấy.", "eng": "Her career was inextricably linked with his."}, {"viet": "Chiếc áo đầm của cô ta dài đến tận mắt cá chân.", "eng": "Her dress reached down to her ankles."}, {"viet": "Các bạn ở nhà máy đã đến thăm cô ta ở bệnh viện.", "eng": "Her friends from work came to see her in hospital."}, {"viet": "Việc thừa kế gia sản đối với cô ta như là của trời cho.", "eng": "Her inheritance came as manna from heaven."}, {"viet": "Mẹ cô ta xông vào khi cô ấy và Mike đang nằm trên giường cùng nhau.", "eng": "Her mother barged in on her and Mike when they were in bed together."}, {"viet": "Tài chơi dương cầm của nàng hết sức quyến rũ.", "eng": "Her piano playing is absolute magic."}, {"viet": "Vẻ ngoài tồi tàn của cô ta đã làm cho khách khứa cười thầm.", "eng": "Her shabby appearance drew sniggers from the guests."}, {"viet": "Tài nghệ là một vận động viên của cô ta không còn nghi ngờ gì nữa.", "eng": "Her undoubted skill as an athlete."}, {"viet": "Đây là quần áo đã giặt ủi của ông và 30 đô la Hồng Kông mà chúng tôi đã tìm thấy trong đó.", "eng": "Here is your laundry and 30 Hong Kong dollars we found in your laundry."}, {"viet": "Câu trả lời của ông ấy chỉ là một hình thức xào xáo lại bài giảng của tôi.", "eng": "His answer was just a rehashed version of my lecture."}, {"viet": "Giọng phát âm vùng Liverpool rất rõ của anh đã làm lộ tung tích của anh ta.", "eng": "His broad Liverpool accent gave him away."}, {"viet": "Những chủ nợ yêu cầu anh ta trả tiền ngay các hoá đơn.", "eng": "His creditors came down on him for prompt payment of his bills."}, {"viet": "Trên khuôn mặt anh ta nở một nụ cười niềm nở.", "eng": "His face expanded in a smile of welcome."}, {"viet": "Vòng hông của ông ấy là 1, 5 mét.", "eng": "His girth is 1,5 metres."}, {"viet": "Người cha tàn phế đang trở thành gánh nặng cho anh ta.", "eng": "His invalid father is becoming a burden to him."}, {"viet": "Đầu của ông ta đầy sáng kiến.", "eng": "His mind is teeming with bright ideas."}, {"viet": "Cuộc đời quá khứ của anh ta đã diễn ra trước mắt anh ta.", "eng": "His past life passed in review before his eyes."}, {"viet": "Lời phán xét của anh ta làm cô ấy thẹn đỏ mặt.", "eng": "His remark brought the colors to her face."}, {"viet": "Vận anh ta đang xuống ( đang suy giảm ).", "eng": "His star is in the descent ( on the wane )."}, {"viet": "Bản phóng sự của anh ta bám sát tình hình về con tin.", "eng": "His up-close coverage of the hostage drama."}, {"viet": "Tổ chức một cuộc bán hàng cũ lấy tiền giúp quĩ bệnh viện.", "eng": "Hold a jumble sale in aid of hospital funds."}, {"viet": "Dẫn chương trình tối nay của chúng tôi là cô Gloria Monroe kiều diễm.", "eng": "Hosting our show this evening is the lovely Gloria Monroe."}, {"viet": "Làm thế nào có thể giảm được khoảng cách giữa người giàu và người nghèo?", "eng": "How can we bridge the gap between rich and poor?"}, {"viet": "Tôi xin cấp giấy phép này như thế nào?", "eng": "How do I apply for this license?"}, {"viet": "Việc nghiên cứu thị trường được thực hiện như thế nào?", "eng": "How is market research carried out?"}, {"viet": "Trường có bao nhiêu học sinh?", "eng": "How many children are there in the school?"}, {"viet": "Bạn đã sống ở đây bao nhiêu năm rồi?", "eng": "How many years have you been living here?"}, {"viet": "Bao lâu anh bị đau lưng một lần?", "eng": "How often do you have a bad back?"}, {"viet": "Hàng trăm người phải ngủ trong nhà hát vì bão tuyết.", "eng": "Hundreds dossed down in the theatre because of the blizzards."}, {"viet": "Tôi muốn phát triển ý này một cách đầy đủ hơn trước khi tôi sang điểm khác.", "eng": "I'd like to develop this idea a little fully before I go on to the next point."}, {"viet": "Tôi sẽ có mặt ở đó chắc chắn đúng hai giờ.", "eng": "I'll be there at two o'clock without fail."}, {"viet": "Tôi sẽ đi tắm rửa sạch sẽ trước cuộc phỏng vấn.", "eng": "I'll just go and freshen myself up before the interview."}, {"viet": "Tôi sẽ cố gắng đến, nhưng tôi cũng không dám chắc là tôi có đến kịp giờ hay không.", "eng": "I'll try to come, though I doubt if I'll be there on time."}, {"viet": "Tôi sẽ rút khỏi kế hoạch này-tôi không tán thành nó.", "eng": "I'm bowing out of this scheme-I don't approve of it."}, {"viet": "Tôi sẽ sống độc thân suốt quãng đời còn lại.", "eng": "I'm going to stay single for the rest of my life."}, {"viet": "Tôi không hoàn toàn hài lòng về đề nghị đó.", "eng": "I'm not entirely happy with that proposal."}, {"viet": "Tôi chán chết đi được vì bị kẹt ở các nơi đáng chán này.", "eng": "I'm sick to death of being stuck in this cursed place."}, {"viet": "Tôi chắc chúng ta có thể dàn xếp thân ái về việc mượn sách.", "eng": "I'm sure we can come to some amicable arrangement about book-borrowing."}, {"viet": "Tôi chỉ mới hoàn thành được một nửa những điều tôi hy vọng làm.", "eng": "I've achieved only half of what I'd hoped to do."}, {"viet": "Tôi đã mang những cuốn sách này khắp trường.", "eng": "I've carted these books all around the school."}, {"viet": "Tôi nghe nói câu lạc bộ mới hơi bẩn.", "eng": "I've heard the new club's a bit of a dive."}, {"viet": "Tôi đã quyết tâm giành thắng lợi trong giải vô địch này.", "eng": "I've set my sights on winning the championship."}, {"viet": "Ban đêm bao giờ tôi cũng lái xe thận trọng hơn.", "eng": "I always drive more carefully at night."}, {"viet": "Tôi không muốn ở lại và nghe những lời lăng nhục xúc phạm này.", "eng": "I am not prepared to stay and listen to these outrageous insults."}, {"viet": "Tôi hỏi anh ta nghĩ gì, song anh ta chỉ càu nhàu.", "eng": "I asked him what he thought, but he just grunted."}, {"viet": "Tôi đã mua chiếc nhẫn này tại hiệu Tiffany với giá 1000 yên.", "eng": "I bought this ring at Tiffany for ¥ 1,000."}, {"viet": "Tôi không làm sạch được những vết cà phê này trên tấm thảm.", "eng": "I can't get these coffee stains out of the carpet."}, {"viet": "Tôi không hiểu được tại sao, nhưng bỗng nhiên tôi có cảm giác là một cái gì khủng khiếp sẽ xảy ra.", "eng": "I can't understand why, but suddenly I had this feeling that something terrible was going to happen."}, {"viet": "Tôi có thể cho anh biết bất cứ điều gì tôi thích.", "eng": "I can tell you anything I like."}, {"viet": "Tôi rất quan tâm đến anh.", "eng": "I care about you a lot."}, {"viet": "Tôi e rằng tôi không thể dùng thêm được thứ gì khác nữa.", "eng": "I couldn't manage another thing, I'm afraid."}, {"viet": "Tôi ước chừng 15.000 bảng Anh.", "eng": "I'd put it at £ 15,000."}, {"viet": "Tôi không muốn nhận tiền nhưng anh ấy nài nỉ tôi mãi.", "eng": "I didn't want to take the money but he pressed it on me."}, {"viet": "Tôi không biết anh ta lắm-sự thật là tôi chỉ mới gặp anh ta một việc.", "eng": "I don't know him very well in fact I've only met him once."}, {"viet": "Tôi không ngờ vực rằng anh đang nói sự thật.", "eng": "I don't question but that you're telling the truth."}, {"viet": "Tôi không muốn đi dạo vào một ngày nóng nực như thế-quá mệt nhọc đối với tôi.", "eng": "I don't want to go for a walk on such a hot day-it's too much like hard work for me."}, {"viet": "Hôm nay tôi thấy không được khoẻ.", "eng": "I don't quite feel myself today."}, {"viet": "Tôi sợ anh ấy sắp chết.", "eng": "I fear he is going to die."}, {"viet": "Tôi thấy mình như một thằng điên khi nhận ra điều mình đã làm.", "eng": "I felt such a fool when I realized what in done."}, {"viet": "Tôi đã biết được bấy nhiêu qua báo chí.", "eng": "I gathered as much from the newspapers."}, {"viet": "Tôi nắm lấy một người đi đường biết hai thứ tiếng nhờ dịch hộ.", "eng": "I grabbed a bilingual passer-by to act as interpreter."}, {"viet": "Ít khi tôi thấy hắn sôi nổi như thế.", "eng": "I had rarely seen him so animated."}, {"viet": "Tôi có cảm giác là lần này chúng ta sẽ có thể đi được.", "eng": "I have a feeling we will be able to go this time."}, {"viet": "Tôi chưa bao giờ tỏ ra đồng ý với chủ nghĩa cực đoan chính trị.", "eng": "I have never associated my self with political extremism."}, {"viet": "Tôi phải về nhà để lo bữa ăn tối cho bọn trẻ con.", "eng": "I have to go home and get supper for the children."}, {"viet": "Cả ngày tôi không hút một điếu thuốc nào cả.", "eng": "I haven't had a smoke all day."}, {"viet": "Tôi mong mọi sự sẽ tốt đẹp với anh.", "eng": "I hope everything is going well with you."}, {"viet": "Tôi ngỡ rằng anh ta sẽ có mặt ở đó.", "eng": "I imagine that he'll be there."}, {"viet": "Tôi biết anh ta nhưng không nói chuyện với anh ta.", "eng": "I know him by sight, but not to talk to."}, {"viet": "Tôi mến anh ta nhưng không thích cô ta.", "eng": "I like him but I don't care for her."}, {"viet": "Tôi sẽ đi với anh ngay.", "eng": "I'll be with you presently."}, {"viet": "Tôi chạy lên trước và mở cửa.", "eng": "I'll nip on ahead and open the door."}, {"viet": "Tôi đau khắp người sau trận đấu.", "eng": "I'm aching all over after the match."}, {"viet": "Con sẽ dắt chó đi dạo.", "eng": "I'm going to walk the dog."}, {"viet": "Ngày mai tôi sẽ đến gặp luật sư của tôi.", "eng": "I'm seeing my solicitor tomorrow."}, {"viet": "Tôi xin kiến nghị đồng ý.", "eng": "I make a motion to accept them."}, {"viet": "Tôi phải quay lại, tôi để quên chìa khoá ô tô của tôi.", "eng": "I must go back, I've left my car key behind."}, {"viet": "Tôi cần xem hộ chiếu của ông.", "eng": "I need to see your passport, please."}, {"viet": "Tôi chỉ cần hai phút với bác sĩ-cuộc gặp ngắn gọn và dễ chịu.", "eng": "I only needed two minutes with the doctor-the visit was short and sweet."}, {"viet": "Tôi gác đơn khiếu nại của nó lại chờ khi có thời gian.", "eng": "I put his complaint on one side until I had more time."}, {"viet": "Tôi nhận ra vài người trong đám khách khứa.", "eng": "I recognized a few of the other guests."}, {"viet": "Tôi bị kẹp vào giữa hai ông to béo trên xe buýt.", "eng": "I sandwiched myself between two fat men on the bus."}, {"viet": "Tối nay tôi sẽ về muộn nên đừng chờ cơm ( tôi ).", "eng": "I shall be home late tonight, so don't wait dinner ( for me )."}, {"viet": "Tôi đã sơ ý cho anh số điện thoại sai.", "eng": "I slipped up and gave you the wrong phone number."}, {"viet": "Tôi nghĩ vậy, nhưng tôi nên nói gì với họ?", "eng": "I suppose so, but what should I tell them?"}, {"viet": "Tôi nghĩ tôi sẽ dùng món đó nhẹ.", "eng": "I think I'll have something light."}, {"viet": "Tôi nghĩ họ sẽ cấp hộ chiếu mới cho bà.", "eng": "I think they'll issue a new one to you."}, {"viet": "Tôi đã nói với cậu ta là ý kiến của cậu ta đâu phải là điều gì quan trọng lắm.", "eng": "I told him his idea was not exactly epoch-making."}, {"viet": "Tôi xoay người lại trên ghế để nói chuyện với cô ấy.", "eng": "I twisted round in my seat to speak to her."}, {"viet": "Tôi sẽ dắt chó đi dạo mỗi buổi sáng.", "eng": "I walk the dog every morning."}, {"viet": "Tôi muốn gửi một lá thư.", "eng": "I want to send a letter."}, {"viet": "Tôi tin chắc rằng anh ta nói thật.", "eng": "I was convinced that he was telling the truth."}, {"viet": "Tôi bị ép buộc phải kể lại câu chuyện đó.", "eng": "I was made to repeat the story."}, {"viet": "Tôi ngạc nhiên khi nghe chúng được nhắc đến cùng nhau, tôi chưa bao giờ nghĩ là trước đây chúng kết giao với nhau.", "eng": "I was surprised to hear them mentioned together I've never connected them before."}, {"viet": "Tôi sẽ đến đây vào ngày 9 tháng 3 và ra đi vào ngày 14.", "eng": "I will arrive on the ninth of March and leave on the four-teenth."}, {"viet": "Tôi xin chúc cô đạt được mọi điều hạnh phúc trên thế gian.", "eng": "I wish you all the happiness in the world."}, {"viet": "Tôi sẽ không làm điều đó nữa.", "eng": "I won't do it again."}, {"viet": "Tôi muốn thực hiện cuộc gọi người nghe trả tiền tới Nhật.", "eng": "I would like to make a collect call to Japan."}, {"viet": "Tôi không muốn diễn tả nó đúng như vậy.", "eng": "I wouldn't put it quite like that."}, {"viet": "Nếu nó muốn lấy số tiền của nó bây giờ tôi e nó chỉ uổng công thôi.", "eng": "If he wants his money now he'll have to whistle for it, I'm afraid."}, {"viet": "Giá mà họ cho chúng tôi biết họ đã quyết định như thế nào.", "eng": "If only they would tell me what they've decided."}, {"viet": "Nếu hôm nay là thứ Tư thì ngày mốt sẽ là thứ Sáu.", "eng": "If today is Wednesday, the day after tomorrow will be Friday."}, {"viet": "Nếu cậu còn ứng xử như vậy trước mặt bạn bè của tớ lần nữa, tớ sẽ tuyệt giao với cậu!", "eng": "If you behave like that in front of my friends again, I'll disown you!"}, {"viet": "Nếu anh hội tụ các tia nắng qua kính lúp vào chiếc lá khô thì nó sẽ cháy.", "eng": "If you focus the sun's rays through a magnifying glass on a dry leaf, it will start to burn."}, {"viet": "Nếu lấy mười hai trừ đi năm, còn lại bảy.", "eng": "If you take five from twelve, you're left with seven."}, {"viet": "Hết sức phổ biến, giàu có, thành công, v. v.", "eng": "Immensely popular, rich, successful, etc."}, {"viet": "Tóm lại tôi muốn nói rằng tôi thích thú lắm.", "eng": "In conclusion I should like to say how much I have enjoyed myself."}, {"viet": "Trong tiếng Nhật chúng tôi gọi là o-mikoshi.", "eng": "In Japanese we say o-mikoshi."}, {"viet": "Ở thời kỳ xưa hơn nữa, năm thường được gọi bằng tên thay vì đánh số.", "eng": "In still earlier times years were often named instead of numbered."}, {"viet": "Trong công thức nấu ăn dặn dùng hai quả trứng.", "eng": "In the recipe it tells you to use two eggs."}, {"viet": "Xúi giục các đảng viên quá khích nổi dậy.", "eng": "Incite militant party members to revolt."}, {"viet": "Ở nước bạn việc thu gom rác có miễn phí không?", "eng": "Is garbage collection free of charge in your country?"}, {"viet": "Mục đích chuyến đi của ông là công tác hay du lịch?", "eng": "Is the purpose of your trip business or pleasure?"}, {"viet": "Đây có đúng là quầy làm thủ tục không?", "eng": "Is this the right counter to check in?"}, {"viet": "Ở vùng đông bắc Honsu, cách Tokyo 215 dặm.", "eng": "It's a northeastern part of Honshu, 215 miles from Tokyo."}, {"viet": "Vận chuyển hàng hoá bằng đường bộ rẻ hơn bằng đường sắt.", "eng": "It's cheaper to ship goods by road than by rail."}, {"viet": "Đến lượt nó phải giặt quần áo nhưng rồi nó sẽ tìm cách lẩn tránh cho mà xem.", "eng": "It's his turn to wash up but he'll try and duck out of it."}, {"viet": "Hình như ông ta không phải là người rất trọng yếu trong hệ thống cấp bậc của công ty.", "eng": "It's not as if he was very important in the company hierarchy."}, {"viet": "Lái xe trong thời tiết này thì đúng là hành động dại dột.", "eng": "It's sheer lunacy driving in this weather."}, {"viet": "Ngày mai mà anh không chơi cho đội thì rắc rối đấy.", "eng": "It's very awkward of you not to play for the team tomorrow."}, {"viet": "Khi nào chúng ta có buổi họp của chúng ta cũng được thôi-đâu có phải là cuộc họp định kỳ.", "eng": "It doesn't matter when we have our meeting-it's a movable feast."}, {"viet": "Đi ngang qua phố một cách không cẩn thận là nguy hiểm.", "eng": "It is dangerous to jaywalk on a busy road."}, {"viet": "Đem so sánh hai vật với nhau thường là có ích.", "eng": "It is often useful to make a comparison between two things."}, {"viet": "Tôi phát điên lên vì cô ta được chọn chứ không phải tôi!", "eng": "It maddens me that she was chosen instead of me!"}, {"viet": "Đã nhiều năm rồi từ khi tôi nghe được tin anh ấy.", "eng": "It's been years since I heard from him."}, {"viet": "Trên chai ghi là'Sản phẩm của Pháp'.", "eng": "It says on the bottle'Produce of France'."}, {"viet": "Tôi phải mất một lúc mới học được các qui tắc của trò chơi nhưng bây giờ thì tôi nghĩ là tôi đã nắm được rồi.", "eng": "It took me a while to learn the rules of the game but I think I've got them taped now."}, {"viet": "Anh thật thiếu suy nghĩ để ô ở ngoài mưa.", "eng": "It was careless of you to leave your umbrella in the rain."}, {"viet": "Việc lần đầu tiên một phụ nữ trở thành thủ tướng đã hoàn toàn là một sự kiện.", "eng": "It was quite an event when a woman first became prime minister."}, {"viet": "Nó sẽ phải tốn 62 xu.", "eng": "It will be sixty-two cents."}, {"viet": "James thích ú à em gái để làm nó hoảng sợ.", "eng": "James love sneaking up on his sister to frighten her."}, {"viet": "John chỉ giả bộ làm phần việc của mình, anh ta thật ra làm ăn không ngay thẳng.", "eng": "John only pretends to do his share of the work, he's just not playing the game."}, {"viet": "Keats là một trong những nhà thơ lãng mạn lớn nhất.", "eng": "Keats is one of the greatest Romantic poets."}, {"viet": "Chúng ta hãy hỏi nhân viên phục vụ xem họ đề nghị món gì.", "eng": "Let's ask the waiter what he recommends."}, {"viet": "Chúng ta hãy qua bên chỗ nhảy múa đi.", "eng": "Let's move over to the dancing."}, {"viet": "Nhiều đôi li dị nhau hoàn toàn lúng túng trước tất cả những giấy tờ pháp luật mà họ phải ký.", "eng": "Many couples who get divorced are befuddled by all of the legal papers they have to sign."}, {"viet": "Nhiều khách du lịch đến viếng thăm Vệ Thành ở Athens.", "eng": "Many tourists visit the Acropolis in Athens."}, {"viet": "Tôi có thể tin một số thông tin đó là thật không?", "eng": "May I depend on some truth?"}, {"viet": "Có lẽ con số là 1074.", "eng": "Maybe the number should be 1074."}, {"viet": "Hầu hết các nhân viên đều ở gần trạm của họ.", "eng": "Most of the men are close to their stations."}, {"viet": "Tuy tôi rất muốn ở lại, nhưng thật quả tôi phải về nhà.", "eng": "Much as I would like to stay, I really must go home."}, {"viet": "Kết luận của tôi là cậu bé đã nói với tôi sự thật.", "eng": "My conclusion was that the boy had told me the truth."}, {"viet": "Người bạn đáng kính của tôi, đại biểu của Chester.", "eng": "My Honourable friend, the member for Chester."}, {"viet": "Hộ chiếu của tôi đã biến mất: vừa lúc nãy đây nó còn trong túi tôi.", "eng": "My passport has disappeared: it was in my pocket a moment ago."}, {"viet": "Tuần này Nancy Wilson sẽ đến thành phố trình diễn đấy.", "eng": "Nancy Wilson is in town performing this week."}, {"viet": "Lần sau ông đến Trung Quốc, tôi sẽ đi cùng ông đến đó.", "eng": "Next time you come to China, I will accompany you there."}, {"viet": "Người ta chưa nhất trí được về cơ sở để thương lượng.", "eng": "No basis for negotiations has been agreed upon."}, {"viet": "Vào ngày nghỉ cuối tuần, không có gì có thể làm tôi hạnh phúc hơn là đi câu cá trên sông.", "eng": "Nothing can make me happier on the weekend than go-ing fishing in the river."}, {"viet": "Ni lông được dùng để làm bít tất và quần áo.", "eng": "Nylon is used to make stockings and clothes."}, {"viet": "À, ở đây làm việc 24 giờ mỗi ngày.", "eng": "Oh, twenty-four hours a day here."}, {"viet": "Vào một ngày nóng như vậy, biển quyến rũ không thể cưỡng lại được.", "eng": "On such a hot day, the sea was irresistible."}, {"viet": "Người ta cần phải biết chắc các sự việc trước khi đưa ra một lời buộc tội công khai.", "eng": "One must be sure of one's facts before making a public accusation."}, {"viet": "Những cuộc phiêu lưu ngoài trời khác có thể là trượt ván trên tuyết xuyên qua những cánh rừng bằng phẳng ở Michigan, di chuyển trên tuyết khắp nơi, trượt tuyết ở rặng Rockies và ở Alaska, lướt ván trượt nước và săn bắn.", "eng": "Other outdoor adventures can be snowshoeing through the flat forests of Michigan, snowmobiling anywhere, skiing in the Rockies and in Alaska, surfing, watering-skiing and hunting."}, {"viet": "Tình bạn của chúng tôi chấm dứt khi chúng tôi rời trường cao đẳng.", "eng": "Our friendship lapses when we left college."}, {"viet": "Máy bay của chúng tôi hơi bị trễ.", "eng": "Our plane was a little delayed."}, {"viet": "Ngoài nhiệm vụ giảng dạy ông ấy còn là chủ tịch của hai hội đồng.", "eng": "Over and above his teaching duties, he is the chairman of two committees."}, {"viet": "Trả tiền điều trị ở bệnh viện là trái với những nguyên tắc xã hội chủ nghĩa của bà ta.", "eng": "Paying for hospital treatment goes against her socialist principles."}, {"viet": "Có lẽ tôi đã bỏ quên nó trong nhà hàng của khách sạn lúc ăn trưa.", "eng": "Perhaps I left it in the hotel restaurant at lunch."}, {"viet": "Cảnh sát đã công bố bản mô tả người đàn ông mà họ muốn điều tra.", "eng": "Police have put out a description of the man they wish to question."}, {"viet": "Tiền thuê phải trả vào ngày cuối cùng của mỗi tháng.", "eng": "Rent is due the last day of each month."}, {"viet": "Xa cách mẹ nó trong thời gian dài.", "eng": "Separated from his mother for long periods."}, {"viet": "Cô ấy sẽ làm điều đó theo cách riêng của cô ấy dù anh có đề nghị gì chăng nữa.", "eng": "She'll do it her way whatever you suggest."}, {"viet": "Cô ta lại than phiền-thật là bực mình với cô ta!", "eng": "She's been complaining again-she's a real pain!"}, {"viet": "Cô ta đang được mổ chân.", "eng": "She's having an operation on her leg."}, {"viet": "Cô ta giao du với một số người dị hợm.", "eng": "She's picked up with some peculiar people."}, {"viet": "Cô ấy tốt nhưng cô ấy có khuynh hướng chi phối cuộc nói chuyện.", "eng": "She's very nice, but she does tend to dominate the conversation."}, {"viet": "Cô ấy đòi quyền phát biểu để tự bảo vệ mình.", "eng": "She asserted her right to speak in her own defence."}, {"viet": "Cô ta ném cái nhìn ranh mãnh về phía người bạn chơi bài bridge cùng phe với cô ta.", "eng": "She cast a sly glance at her bridge partner."}, {"viet": "Cô ấy bị mảnh cốc vỡ làm đứt ngón tay.", "eng": "She cut her finger on a piece of broken glass."}, {"viet": "Cô ta không làm xong công việc bởi vì cô ta luôn luôn lề mề.", "eng": "She doesn't get her work done because she's always dawdling."}, {"viet": "Cô cảm thấy bố mẹ anh ta đang quan sát cô rất nhanh.", "eng": "She felt his parents were giving her the once-over."}, {"viet": "Bà ấy rất bực bội mỗi khi chúng tôi đến muộn.", "eng": "She gets in a fret whenever we're late."}, {"viet": "Cô ấy gặp khó khăn trong việc học phát âm tiếng Anh.", "eng": "She had difficult learning English pronunciation."}, {"viet": "Cô ấy có nguyện vọng làm một nhà văn lớn.", "eng": "She has aspirations to become a great writer."}, {"viet": "Hay tin anh ấy chết, cô ta cứ dửng dưng như không.", "eng": "She heard the news of his death with apparent unconcern."}, {"viet": "Cô ấy đang học quản lý doanh nghiệp ngân hàng.", "eng": "She is learning to manage business."}, {"viet": "Bà ta không ngừng xen ngang vào câu chuyện của chúng tôi.", "eng": "She kept cutting in on our conversation."}, {"viet": "Cô ấy có vẻ ngạc nhiên khi nghe tin đó.", "eng": "She looked astonished when she heard the news."}, {"viet": "Một ngày nào đó cô ta sẽ làm tất cả chúng ta ngạc nhiên.", "eng": "She may yet surprise us all."}, {"viet": "Cô ta dán các bức ảnh vào một quyển sưu tầm.", "eng": "She pasted the pictures into a scrapbook."}, {"viet": "Cô ấy đã chạy đến nhà ga chỉ để thấy rằng con tàu đã rời đi.", "eng": "She ran to the station only to find that the train had left."}, {"viet": "Cô ta là người ăn mặc rất hợp thời trang.", "eng": "She's a very snazzy dresser."}, {"viet": "Cô ta đang trong tình trạng biệt phái qua Bộ quốc phòng.", "eng": "She's on attachment to the Ministry of Defense."}, {"viet": "Cô ta nói: “ chỉ còn chỗ khu ban công và khu lễ phục thôi ”.", "eng": "She says, only balcony and dress circle."}, {"viet": "Cô ấy cho chúng tôi xem các phần thưởng điền kinh cô ta đã giành được.", "eng": "She showed us the athletics awards she had won."}, {"viet": "Cô ta trân trân nhìn tôi bằng con mắt hoài nghi.", "eng": "She stared at me with unbelieving eyes."}, {"viet": "Cô ta nói cứ như đánh đố-thật khó mà biết được cô ta muốn nói gì.", "eng": "She talks in riddles-it's very difficult to know what she means."}, {"viet": "Cô ta quay đi một cách ghê tởm trước cảnh tượng khó chịu ấy.", "eng": "She turned away from the disgusting sight in."}, {"viet": "Bà ta là một nhà khoa học lỗi lạc-hơn nữa lại là một hoạ sĩ có tài.", "eng": "She was a distinguished scientist-and a gifted painter into the bargain."}, {"viet": "Cô ta được chọn làm người đại diện bằng cách rút thăm.", "eng": "She was chosen by lot to represent it."}, {"viet": "Cô ta bị quăng mạnh tới chết.", "eng": "She was hurled to her death."}, {"viet": "Cô ta đang nghiên cứu kỹ lưỡng một tấm bản đồ cũ của vùng đó.", "eng": "She was poring over an old map of the area."}, {"viet": "Cô ta đi đứng loạng choạng với đôi giày rất cao gót.", "eng": "She was teetering along in very high-heeled shoes."}, {"viet": "Cô ta để tóc ngắn trên vai.", "eng": "She wears her hair in a bob."}, {"viet": "Bà ta đã thắng với mức chênh lệch khá lớn.", "eng": "She won by a comfortable margin."}, {"viet": "Shella thì rất thông minh song có phần rụt rè khi diễn đạt ý nghĩ của mình.", "eng": "Shella is very clever but rather backward in expressing her ideas."}, {"viet": "Câm miệng lại! Cô ấy đốp lại hắn.", "eng": "Shut up! she snapped back at him."}, {"viet": "Thưa ông, họ đã tìm thấy cái cặp màu đen của ông.", "eng": "Sir, they have found your black briefcase."}, {"viet": "Chẳng ngạc nhiên mấy khi anh ta mệt đừ!", "eng": "Small wonder that he was so tired!"}, {"viet": "Vì vậy nó sẽ không được bổ sung.", "eng": "So it will not be restocked."}, {"viet": "Một số người Úc vẫn coi nước Anh là nước mẹ của mình.", "eng": "Some Australians still regard Britain as their mother country."}, {"viet": "Một số công việc tốn nhiều thời gian bây giờ đã có thể do máy làm.", "eng": "Some of the more time-consuming jobs can now be done by machines."}, {"viet": "Vài loại cây có thể sống hàng trăm năm.", "eng": "Some trees can live for hundreds of years."}, {"viet": "Những thầy phù thủy trong những chuyện thần tiên thời xưa.", "eng": "Sorcerers in old-fashioned fairy-tales."}, {"viet": "Bớt tiêu tiền là câu trả lời hiển nhiên cho các vấn đề tài chính của ông ta.", "eng": "Spending less money is the obvious answer to his financial problems."}, {"viet": "Hơi nước làm mờ tấm gương trong phòng tắm.", "eng": "Steam has fogged the bathroom mirror."}, {"viet": "Đừng chọc con bé nữa, thằng tiểu yêu!", "eng": "Stop teasing her, you little fiend!"}, {"viet": "Sống được với một bữa mỗi ngày.", "eng": "Subsisted on one meal a day."}, {"viet": "Đau vì độ chua của dạ dày.", "eng": "Suffer from acidity of the stomach."}, {"viet": "Sự hồi hộp làm câu chuyện thêm hấp dẫn.", "eng": "Suspense adds interest to a story."}, {"viet": "Được cấp bằng cao học văn chương.", "eng": "Take the degree of Master of Arts."}, {"viet": "Các thanh thiếu niên không nên đưa vào nhà tù chung với những tội phạm có nhiều tiền án tiền sự.", "eng": "Teenagers should not be sent to prison with hardened criminals."}, {"viet": "Xin cảm ơn anh về tất cả công việc vất vả mà anh đã làm.", "eng": "Thank you for all the hard work you're put in."}, {"viet": "Đó là cách mà những câu chuyện hay tác động đến tình cảm của con.", "eng": "That's the way good stories make you feel."}, {"viet": "Câu hỏi thi đó thật là dễ!", "eng": "That exam question was an absolute gift!"}, {"viet": "Có thể đó là một ý kiến hay đấy.", "eng": "That might be a good idea."}, {"viet": "Cái đó không liên quan nhiều đến lãnh vực của tôi.", "eng": "That's not much in my line."}, {"viet": "Đó hầu như là bữa ăn ngon nhất xưa nay tôi đã từng được thưởng thức.", "eng": "That was much the best meal I've ever tasted."}, {"viet": "Sự cướp cò bất chợt của một khẩu súng trường.", "eng": "The accidental discharge of a rifle."}, {"viet": "Hàng năm cơ quan đó tìm việc cho khoảng 2.000 thư ký.", "eng": "The agency places about 2,000 secretaries per annual."}, {"viet": "Khứu giác tốt của con thú đã bù lại thị giác kém của nó.", "eng": "The animal's good sense of smell compensates for its poor eyesight."}, {"viet": "Cuộc tranh cãi đã biến thành cuộc nói xấu cá nhân.", "eng": "The argument deteriorated into personalities."}, {"viet": "Bầu không khí như muốn nổ tung vì căng thẳng khi hai võ sĩ quyền Anh bước lên võ đài.", "eng": "The atmosphere crackled with tension as the two boxers stepped into the ring."}, {"viet": "Trục của một hình tròn là đường kính của nó.", "eng": "The axis of a circle is its diameter."}, {"viet": "Ban nhạc bắt đầu chơi điệu van-xơ.", "eng": "The band struck up a waltz."}, {"viet": "Đài BBC đã phản đối lại sự phê phán làm cho quần chúng hoá trong những bản tin.", "eng": "The BBC has hit back at criticism of dumbing down in its news output."}, {"viet": "Hoá đơn là 810 pao, cộng thêm 81 pao cho phí bưu điện.", "eng": "The bill was 810 pounds, plus 81 pounds for postage."}, {"viet": "Con thuyền nhích lên một cách chậm chạp ngược con nước.", "eng": "The boat made slow headway against the tide."}, {"viet": "Cuốn sách viết về vấn đề đó quá sơ sài.", "eng": "The book treats the problem too sketchily."}, {"viet": "Bọn con trai luôn châm chọc Jim là béo.", "eng": "The boys always needled Jim about being fat."}, {"viet": "Mấy anh em khác nhau rất nhiều về sở thích.", "eng": "The brothers differ widely in their tastes."}, {"viet": "Cứ 10 phút xe buýt chạy một chuyến.", "eng": "The buses go every ten minutes."}, {"viet": "Xe ô-tô hư-chúng ta sẽ phải cuốc bộ.", "eng": "The car's kaput-we'll have to walk."}, {"viet": "Chiếc xe ôtô bị hỏng nặng đến nỗi coi như bỏ hoàn toàn.", "eng": "The car was so badly damaged that it had to be abandoned as a total loss."}, {"viet": "Các con mèo cất lên tiếng gào khủng khiếp khi con chó xuất hiện.", "eng": "The cats set up a frightful yowling when the dog appeared."}, {"viet": "Công đoàn ngành in biểu quyết chống đình công.", "eng": "The chapel voted against a strike."}, {"viet": "Thằng bé dồn hết thời giờ vào việc thổi sáo.", "eng": "The child occupied himself in playing his flute."}, {"viet": "Bọn trẻ con vội vã từ ngoài đi vào.", "eng": "The children came bundling in from outside."}, {"viet": "Bọn trẻ nhìn chằm chằm khi chúng tôi mở cái gói.", "eng": "The children were all eyes as we opened the parcel."}, {"viet": "Hội đồng thành phố do ông thị trưởng nắm quyền điều khiển.", "eng": "The city council is presided over by the mayor."}, {"viet": "Quần áo trong chiếc va-li bị nhàu nát quá.", "eng": "The clothes were badly crushed in the suitcase."}, {"viet": "Màu của nó cũng tương tự như những cái nút áo của bà.", "eng": "The color is similar to yours."}, {"viet": "Công ty cho anh ta một điện thoại di động để tiếp xúc với khách hàng.", "eng": "The company gave him a mobile phone to contact his clients."}, {"viet": "Vi tính đã làm thay đổi nhiều diện mạo của cuộc sống.", "eng": "The computer has altered so many aspects of life."}, {"viet": "Hợp đồng đang được cân nhắc để ký lại hợp đồng mới.", "eng": "The contract is up for renewal."}, {"viet": "Đất nước chấp nhận yêu sách của ông ấy đối với ngai vàng.", "eng": "The country acknowledged his claim to the throne."}, {"viet": "Con bò cái đã sinh được một con bê.", "eng": "The cow has produced a calf."}, {"viet": "Đám đông bắt đầu la ó phản đối sự rề rà của trận đấu.", "eng": "The crowd started barracking the slow rate of play."}, {"viet": "Cơn lốc khuấy tung sóng ở biển làm cho tàu bè rất nguy hiểm.", "eng": "The cyclone churned the waves of the sea, making it dangerous for ships."}, {"viet": "Mối ác cảm sâu sắc giữa hai người là quá rõ ràng.", "eng": "The deep antipathy between the two men was only very evident."}, {"viet": "Sự huỷ hoại do hoạt động quân sự của địch gây ra.", "eng": "The destruction caused by enemy action."}, {"viet": "Việc ngừng sản xuất những sản phẩm ế ẩm.", "eng": "The discontinuance of our loss-making products."}, {"viet": "Bác sĩ được mời tới đỡ đẻ tại nhà.", "eng": "The doctor has been called to a home confinement."}, {"viet": "Con chó gầm gừ kẻ đột nhập.", "eng": "The dog growled at the intruder."}, {"viet": "Nữ huấn luyện viên kịch đã xem các học viên của mình diễn thử trước buổi trình diễn đầu tiên.", "eng": "The drama coach put her students through their paces before the first performance."}, {"viet": "Những con đại bàng bay lượn trên thung lũng.", "eng": "The eagles soared high above the valley."}, {"viet": "Vòi của con voi là một bộ phận phụ thuộc độc đáo.", "eng": "The elephant's trunk is a unique form of appendage."}, {"viet": "Toàn bộ khung của nhà thờ cần phải trùng tu.", "eng": "The entire fabric of the church needs renovation."}, {"viet": "Việc ngăn cản phụ nữ không cho vào đền.", "eng": "The exclusion of women from the temple."}, {"viet": "Máy móc của nhà máy nằm im trong thời gian công nhân bãi công.", "eng": "The factory machines lay idle during the workers strike."}, {"viet": "Con ngựa được ưa thích chạy vượt dễ dàng các con khác trong đường đua.", "eng": "The favourite easily outran the other horses in the field."}, {"viet": "Cuốn phim đã làm tôi xao lãng được những vấn đề này trong chốc lát.", "eng": "The film managed to distract me from these problems for a while."}, {"viet": "Công ty đó đã được điều hành một cách lỏng lẻo.", "eng": "The firm had been run rather slackly."}, {"viet": "Bước đầu tiên để thay lốp ô tô là tháo bánh ra.", "eng": "The first step in changing a car tyre is to loosen the wheel."}, {"viet": "Thức ăn ở Anh thoạt đầu thì thấy lạ nhưng rồi chẳng bao lâu anh sẽ quen.", "eng": "The food in England is strange at first but you'll soon get used to it."}, {"viet": "Đề thi tiếng Pháp do thầy giáo dạy lớp chúng tôi soạn.", "eng": "The French paper was set by our form teacher."}, {"viet": "Kẽ hở ở hàng rào đủ rộng để cho cừu chui qua.", "eng": "The gap in the fence was just wide enough for the sheep to get through."}, {"viet": "Món quà tặng bằng tiền đó khiến chúng tôi đỡ phải mượn ở ngân hàng.", "eng": "The gift of money saved our having to borrow from the bank."}, {"viet": "Chính sách cứng rắn mới của chính phủ về tội ác có tổ chức.", "eng": "The government's new gettough policy on organized crime."}, {"viet": "Chính phủ đang rút khỏi những kế hoạch tốn kém hơn.", "eng": "The government is backtracking from its more costly plans."}, {"viet": "Ông thống đốc đã được trao toàn quyền hành động.", "eng": "The governor has been invested with full authority to act."}, {"viet": "Mặt đất sũng nước sau cơn mưa tầm tã.", "eng": "The ground was soggy after heavy rain."}, {"viet": "Cái rãnh nước ngập đầy bùn.", "eng": "The gutter has filled up with mud."}, {"viet": "Hoài bão lớn nhất của mình.", "eng": "The height of one's ambition."}, {"viet": "Con ngựa chạy với số tiền đánh cuộc trúng là 10 ăn 1.", "eng": "The horse was running at odds of ten to one."}, {"viet": "Ngôi nhà mục ruỗng và cần lợp mái mới-chúng ta đang nói tới một khoản tiền lớn.", "eng": "The house has dry rot and needs a new roof-we're talking about the megabucks."}, {"viet": "Những người thợ săn vạch một con đường qua lùm bụi.", "eng": "The hunters beat a path through the undergrowth."}, {"viet": "Việc tăng lương sẽ là đáng kể.", "eng": "The increase in salary will be appreciable."}, {"viet": "Công ty bảo hiểm đòi phải có ba bản dự kê tiền sửa chữa chiếc ôtô.", "eng": "The insurance company requires three quotations for repairs to the car."}, {"viet": "Công việc này thực sự chả thử thách gì được anh ấy.", "eng": "The job doesn't really challenge him."}, {"viet": "Ban hội thẩm tuyên án rằng bị cáo là vô tội.", "eng": "The jury returned a verdict of not guilty."}, {"viet": "Mặt hồ đóng băng mãi đến cuối mùa xuân.", "eng": "The lake was frozen over until late spring."}, {"viet": "Luật quy định hình phạt nặng cho sự xúc phạm này.", "eng": "The law prescribes heavy penalties for this offense."}, {"viet": "Những lá thư này có thể được những nhóm phản động làm những tin thất thiệt.", "eng": "The letters might be used to ammunition by reactionary groups."}, {"viet": "Tiền sảnh của một toà nhà thường ở tầng trệt, nhưng ở Trung Tâm Thương mại Thế giới, có các tiền sảnh trên bầu trời!", "eng": "The lobby of a building is usually on the ground floor, but at the World Trade Centre there are lobbies in the sky!"}, {"viet": "Phổi là những khối ống và túi nhỏ xíu.", "eng": "The lungs are messes of tubes and tiny sacs."}, {"viet": "Người đàn ông đó hiện đang bị giam giữ.", "eng": "The man has now been taken into custody."}, {"viet": "Trận đấu bị hủy bỏ vì thời tiết xấu.", "eng": "The match was called off because of bad weather."}, {"viet": "Cuộc họp đã trở thành một cuộc cãi lộn thiếu phẩm cách.", "eng": "The meeting turned into an undignified brawl."}, {"viet": "Điểm đỗ tối thiểu cho kỳ thi là 40 trên 100.", "eng": "The minimum pass mark in the examination is 40 out of 100."}, {"viet": "Tiền được cho với một mục đích rõ ràng.", "eng": "The money was given for a specific purpose."}, {"viet": "Những di tích đổ nát dần dần của một tòa lâu đài cổ.", "eng": "The mouldering ruins of an old castle."}, {"viet": "Những tấm khăn ăn trên khay bị vấy bẩn.", "eng": "The napkins on the tray are stained."}, {"viet": "Thuốc mới ấy tác dụng tốt trong các cuộc thử nghiệm.", "eng": "The new drug has performed well in tests."}, {"viet": "Nhà hàng mới làm ăn rất phát đạt.", "eng": "The new restaurant is doing of roaring trade."}, {"viet": "Tờ báo đã bênh vực cô chống lại những lời buộc tội.", "eng": "The newspaper defended her against the accusations."}, {"viet": "Tiểu thuyết và truyện ngắn là những thể loại khác nhau.", "eng": "The novel and short story are different genres."}, {"viet": "Cái mùi của con mương bị ô nhiễm không thể chịu nổi.", "eng": "The odour from the polluted canal was unbearable."}, {"viet": "Ông lão chống gậy đi khập khiễng trên đường.", "eng": "The old man hobbled along the road with the aid of his stick."}, {"viet": "Phe đối lập dự định đưa ra một kiến nghị chỉ trích cách chính phủ xử lý vụ này.", "eng": "The Opposition plan to put down a censure motion on the Government's handling of the affair."}, {"viet": "Sơn tróc từng mảng ở chỗ cái bàn đụng vào tường.", "eng": "The paint has chipped off when the table touches the wall."}, {"viet": "Buổi liên hoan là một điều vỡ mộng, chẳng mấy ai đến dự!", "eng": "The party was a non-event, hardly anyone came!"}, {"viet": "Việc phạt hành vi mưu toan mua chuộc bằng tiền những nhân chứng là nặng.", "eng": "The penalty for attempting to suborn witnesses are heavy."}, {"viet": "Tính phi văn hóa của loại báo chí bình dân.", "eng": "The philistinism of the popular press."}, {"viet": "Đường ống bị tắc, dội nước cho nó trôi đi.", "eng": "The pipe is blocked, give it a good flush out."}, {"viet": "Những kế hoạch ấy cuối cùng đã được thực hiện.", "eng": "The plans were finally put into execution."}, {"viet": "Cảnh ngộ của các nạn nhân đói khiến ai cũng thương.", "eng": "The plight of the famine victims commands everyone's sympathy."}, {"viet": "Cảnh sát xua những tên tội phạm ra khỏi chỗ ẩn nấp của chúng.", "eng": "The police flushed the criminals out of their lair."}, {"viet": "Cảnh sát đã khai thác thông tin của những người bị tình nghi.", "eng": "The police sweated the information out of the suspected."}, {"viet": "Toàn dân nói chung đều ủng hộ việc cải cách.", "eng": "The population as a whole is in favour of the reform."}, {"viet": "Việc cho đơn thuốc là trách nhiệm của bác sĩ.", "eng": "The prescription of drugs is a doctor's responsibility."}, {"viet": "Báo chí coi những điều sơ hở của ứng cử viên đó như là một mục tiêu để công kích.", "eng": "The press considered the candidate's indiscretions to be game."}, {"viet": "Các vị bộ trưởng trong nội các thủ tướng.", "eng": "The prime ministers cabinet colleagues."}, {"viet": "Những vấn đề khó khăn về việc xác lập nguyên văn của vở'Vua Lia'.", "eng": "The problems of establishing the text of'King Lear'."}, {"viet": "Những đề nghị của từng bên đã đưa ra.", "eng": "The proposals which the parties have severalty made."}, {"viet": "Mát tít bịt kín quanh cửa sổ.", "eng": "The putty gives a good seal around the windows."}, {"viet": "Chiếc cầu xe lửa bắc ngang qua xa lộ.", "eng": "The railroad bridge bisects the highway."}, {"viet": "Trận động đất mới đây là một tai nạn.", "eng": "The recent earthquake was a catastrophe."}, {"viet": "Bài báo cáo đó chứa đựng quá nhiều chi tiết.", "eng": "The report contained a plethora of detail."}, {"viet": "Phần khứ hồi của vé này có giá trị trong ba tháng.", "eng": "The return half of the ticket is good for three months."}, {"viet": "Con sông đó có nhiều cá.", "eng": "The river was teeming with fish."}, {"viet": "Căn phòng đã bị khoá ở bên trong.", "eng": "The room had been locked from the inside."}, {"viet": "Vị giám khảo người Nga đã cho những vận động viên trượt băng của chúng tôi 5,8 điểm.", "eng": "The Russian judge scored our skaters 5.8."}, {"viet": "Bối cảnh của cuốn tiểu thuyết ấy xảy ra ở Xcốtlen.", "eng": "The scene of the novel is set in Scotland."}, {"viet": "Những đường nối dọc bên quần của anh ta.", "eng": "The seams down the side of his trousers."}, {"viet": "Dịch vụ ở khách sạn đó thật là tồi tệ.", "eng": "The service in that hotel was disgraceful."}, {"viet": "Con tàu lướt nhẹ trên mặt nước.", "eng": "The ship slipped through the water."}, {"viet": "Buổi trình diễn được nhà triệu phú tài trợ.", "eng": "The show was sponsored by the millionaire."}, {"viet": "Sản lượng thu hoạch tuỳ thuộc vào năng suất của đất.", "eng": "The size of the crop depends on the productivity of the soil."}, {"viet": "Trật tự xã hội của loài kiến là rất đáng chú ý.", "eng": "The social order of ants is very interesting."}, {"viet": "Tiếng xủng xoẻng của những vòng, xuyến.", "eng": "The sound of jingling bracelets and gangles."}, {"viet": "Hoạt động của tên gián điệp đã được che đậy dưới vỏ bọc ngoại giao.", "eng": "The spy's activities were concealed by the cloak of diplomacy."}, {"viet": "Cái gậy được bọc chì cho nặng hơn.", "eng": "The stick had been weighted with lead."}, {"viet": "Những người đình công đã đạt được một thoả thuận với các ông chủ.", "eng": "The strikers have reached a settlement with the employers."}, {"viet": "Mặt trời làm khô những chỗ ướt trên mặt đất.", "eng": "The sun dries the moisture on the ground."}, {"viet": "Nhà đương cục thuế tính toán mức lãi trung bình của anh ta trên 3000 pao một năm, trong 5 năm.", "eng": "The tax authorities averaged his profit out at 3000 pounds a year over 5 years."}, {"viet": "Đội thám hiểm đã trèo lên sườn núi phía bắc.", "eng": "The team climbed the north face of the mountain."}, {"viet": "Rạp hát hết chỗ rồi, tôi e rằng ông sẽ phải đợi buổi diễn sau.", "eng": "The theatre is full, I'm afraid you'll have to wait for the next show."}, {"viet": "Khoảng thời gian giữa tia chớp và tiếng sét.", "eng": "The time-lag between a flash of lightning and the thunder."}, {"viet": "Thị trấn không thay đổi khi tôi trở lại sau mười năm.", "eng": "The town was unchanged when I went back after ten years."}, {"viet": "Cây cối soi bóng trên mặt nước hồ phẳng lặng.", "eng": "The trees were mirrored in the still water of the lake."}, {"viet": "Hai nửa của cấu trúc đó không khớp với nhau.", "eng": "The two halves of the structure didn't marry up."}, {"viet": "Các lãnh tụ công đoàn đang cố trì hoãn bằng cách kéo dài các cuộc thương lượng.", "eng": "The union leaders are trying to buy time by prolonging the negotiations."}, {"viet": "Trục tung cắt trục hoành ở đây.", "eng": "The vertical line meets the horizontal one here."}, {"viet": "Bức tường nham nhở với các khẩu hiệu.", "eng": "The wall has been defaced with slogans."}, {"viet": "Buổi hôn lễ đã mang tính cách một trò hề khi ông cha sở ngã sấp mặt xuống đất.", "eng": "The wedding took on the character of a farce when the vicar fell flat on his face."}, {"viet": "Gió đã dịu đi, làm cho thuyền chạy an toàn hơn.", "eng": "The wind has moderated, making sailing safer."}, {"viet": "Các từ'elevator'và'lift'khác nhau về hình thái nhưng giống nhau về nghĩa.", "eng": "The words'elevator'and'lift'are different in form but identical in meaning."}, {"viet": "Người trẻ dễ uốn nắn hơn người già.", "eng": "The young are more malleable than the old."}, {"viet": "Lần đầu tiên họ nhìn thấy đất liền sau 10 ngày trên biển.", "eng": "Their first-sight of landscape after ten days at sea."}, {"viet": "Đứa con trai luôn làm họ phải đau đầu.", "eng": "Their son is a constant headache to them."}, {"viet": "Thế thì tại sao các cánh hoa lại có màu đỏ và các đài hoa lại có màu xanh?", "eng": "Then why are the petals red and the sepals green?"}, {"viet": "Có thời gian để làm việc và có thời gian để vui chơi.", "eng": "There's a time to work and a time to play."}, {"viet": "Nhu cầu về mặt hàng này không nhiều.", "eng": "There's not much of a market for these goods."}, {"viet": "Có những mốt chơi chó giống như những mốt quần áo.", "eng": "There are fashions in dogs just as there are fashions in clothes."}, {"viet": "Ngày nay có quá nhiều sự thu hút cạnh tranh làm cho loại hình sân khấu sống đang mất đi khán giả.", "eng": "There are so many counter-attractions these days that the live theatre is losing its audiences."}, {"viet": "Người ta đã tranh luận rất nhiều về vấn đề phá thai hợp pháp.", "eng": "There has been much dispute over the question of legalized abortion."}, {"viet": "Có một sự tương phản rõ rệt giữa hai anh em.", "eng": "There is a remarkable contrast between the two brothers."}, {"viet": "Không có gì ngăn cản chúng tôi đi cả.", "eng": "There is nothing to prevent us from going."}, {"viet": "Có một tiếng sét nổ rồi cơn bão ập đến.", "eng": "There was a crash of thunder, then the storm struck."}, {"viet": "Có tiếng nhạc từ phòng bên.", "eng": "There was music coming from the next room."}, {"viet": "Có vài mẫu đá và quặng đẹp trong bảo tàng.", "eng": "There were some fine specimens of rocks and ores in the museum."}, {"viet": "Những thám tử này được phân công xem xét vụ cướp.", "eng": "These detectives were told off to examine the robbery."}, {"viet": "Những chính sách này sẽ tác động đặc biệt đến người không phải da trắng.", "eng": "These policies will affect non-whites especially."}, {"viet": "Họ đã hạ giá từ 15 bảng xuống 10 bảng.", "eng": "They're lowered the price from £ 15 to £ 10."}, {"viet": "Tất cả họ đều muốn biết quyết định của tôi nhưng tôi nghĩ là tôi sẽ để cho họ lo lắng đợi chờ một chút.", "eng": "They all want to know my decision but I think I'll let them sweat a little."}, {"viet": "Họ đang chăm chú chờ đón những diễn biến mới.", "eng": "They are watching for further developments."}, {"viet": "Họ vội siết chặt tay nhau rồi chào tạm biệt.", "eng": "They clasped hands briefly before saying goodbye."}, {"viet": "Họ không cố gắng hết sức, nhưng rồi cũng chẳng có sự kích thích nào.", "eng": "They don't try very hard, but then there's no incentive."}, {"viet": "Họ giữ bí mật của họ không cho các nước khác trên thế giới biết trong hàng trăm năm.", "eng": "They guarded their secret from the rest of the world for hundreds of years."}, {"viet": "Họ chưa Ấn định ngày làm lễ cưới.", "eng": "They haven't set a date for their wedding yet."}, {"viet": "Họ thu xếp để đề cập được khá nhiều lĩnh vực thảo luận trong một chương trình ngắn ngủi.", "eng": "They managed to cover quite a lot of ground in a short programme."}, {"viet": "Họ góp chung tiền tiết kiệm mua một ô tô.", "eng": "They pooled their savings and bought a car."}, {"viet": "Người ta bảo chúng ta sẽ có một mùa hè nóng nực.", "eng": "They say we're going to have a hot summer."}, {"viet": "Ngày nào chúng nó cũng bơi trong suốt kỳ nghỉ.", "eng": "They swim everyday during the holidays."}, {"viet": "Tất cả bọn họ đều mặc váy trắng giống nhau.", "eng": "They were all dressed alike in white dresses."}, {"viet": "Chúng là những đồ dùng nấu ăn đơn giản làm bằng gỗ.", "eng": "They were simple cooking utensils made from wood."}, {"viet": "Ba mươi người bị chôn vùi vì vụ nổ mìn.", "eng": "Thirty men were entombed by the mine explosion."}, {"viet": "Công việc từ thiện này xứng đáng được sự ủng hộ của anh.", "eng": "This charity is worthy of your support."}, {"viet": "Thuốc này sẽ làm cho anh bớt khó chịu.", "eng": "This drug will relieve your discomfort."}, {"viet": "Đây là một mẫu bài hay trong thi ca trữ tình của Shelley.", "eng": "This is a good example of Shelley's lyric poetry."}, {"viet": "Đây là sách giáo khoa chuẩn về môn đó.", "eng": "This is the standard textbook on the subject."}, {"viet": "Ngọn núi này ở Châu Phi chưa hề có dấu chân người.", "eng": "This mountain in Africa is still a virgin."}, {"viet": "Chính sách này không phù hợp với những mục tiêu đã được công bố của chính phủ.", "eng": "This policy is scarcely consonant with the government's declared aims."}, {"viet": "Món quà đặc biệt này chỉ để dành riêng cho bạn đọc tạp chí này thôi.", "eng": "This special offer has been exclusively designed for readers of this magazine."}, {"viet": "Tuần này, điểm nổi bật là về thế giới của mốt.", "eng": "This week the spotlight is on the world of fashion."}, {"viet": "Hàng ngàn người bị giết trong cuộc tàn sát đẫm máu này.", "eng": "Thousands were slaughtered in this bloody massacre."}, {"viet": "Ngày mai sẽ có một cuộc diễu hành và đua ngựa.", "eng": "Tomorrow there will be a parade and horse races."}, {"viet": "Trừ phi đồng hồ của tôi chạy nhanh, nếu không họ phải có mặt ở đây ngay.", "eng": "Unless my watch is fast, they should be here any moment."}, {"viet": "Tắm rửa thường xuyên để đảm bảo vệ sinh cá nhân.", "eng": "Wash regularly to ensure personal hygiene."}, {"viet": "Chúng tôi phải canh chừng lũ trẻ đề phòng chúng quá mệt.", "eng": "We'll have to watch the children in case they get too tired."}, {"viet": "Chúng ta hiện đang lâm vào tình trạng hết sức rối ren Nó đã nện cho tên trộm một trận nên thân.", "eng": "We're in a proper mess now He gave the burglar a proper hiding."}, {"viet": "Chúng tôi cũng đã giải quyết nhiều việc đổi mới trong tuần này.", "eng": "We've dealt with several renewals this week."}, {"viet": "Chúng tôi chú trọng đến chất lượng hơn số lượng.", "eng": "We aim at quality rather than quantity."}, {"viet": "Chúng tôi được cổ vũ bởi những phát triển gần đây nhất.", "eng": "We are much heartened by the latest developments."}, {"viet": "Chúng tôi dừng chuyến đi London tại Oxford.", "eng": "We broke our journey ( to London ) at Oxford."}, {"viet": "Chúng tôi có thể khẳng định rằng giá cả của chúng tôi hoàn toàn thực tế.", "eng": "We can safely say that our price is quite realistic."}, {"viet": "Chúng tôi hoãn việc xuất hành vì thời tiết xấu.", "eng": "We delayed our departure on account of the bad weather."}, {"viet": "Chúng tôi đã bày tỏ quan điểm của mình một cách khá mãnh liệt.", "eng": "We expressed our views with some violence."}, {"viet": "Chúng ta dùng cá cho món ăn đầu tiên, tiếp theo đó là chim quay và rau tươi.", "eng": "We had fish for the first course, followed by roast fowl and fresh vegetables."}, {"viet": "Chúng tôi đã xem xét đơn xin việc của anh một cách cẩn thận, nhưng không thể có việc cho anh được.", "eng": "We have considered your application carefully, but cannot offer you the job."}, {"viet": "Chúng tôi không có đủ giá để xếp tất cả sách lên.", "eng": "We haven't enough shelves to keep all our books on."}, {"viet": "Chúng tôi sống trong một căn hộ nhỏ và tôi đem áo quần của chúng tôi đến tiệm giặt tự động.", "eng": "We lived in a very small apartment, and I took our clothes to the laundromat."}, {"viet": "Chúng ta phải bảo quản rừng và đất rừng cho những thế hệ tương lai.", "eng": "We must conserve our forests and woodlands for future generations."}, {"viet": "Chúng tôi cần những người có thể tiếp thu được kĩ thuật mới một cách nhanh chóng.", "eng": "We need people who can assimilate new techniques quickly."}, {"viet": "Tất nhiên là chúng tôi chưa làm xong.", "eng": "We're not finished, of course."}, {"viet": "Chúng tôi gác mái chèo và cột thuyền dọc theo bờ.", "eng": "We shipped oars and moored alongside the bank."}, {"viet": "Chúng tôi tung đồng xu ( thí dụ để quyết định việc gì nhờ may rủi ) và nó rơi lật mặt ngửa lên.", "eng": "We tossed a coin and it came down heads."}, {"viet": "Chúng tôi cứ sợ anh ấy sẽ hồi hộp lúng túng trên sân khấu nhưng thực tế anh ấy đã biểu diễn rất hay.", "eng": "We were afraid he would be nervous on stage, but in the event he performed beautifully."}, {"viet": "Chúng tôi đã được chiêu đãi một cuộc ra mắt đặc biệt của ông Thủ tướng hát trên truyền hình.", "eng": "We were treated to the unusual sight of the Prime Minister singing on TV."}, {"viet": "Chúng ta cần đánh thức dậy một niềm tin mới trong lòng những người không tin.", "eng": "Wee need to awaken a new faith in the hearts of nonbelievers."}, {"viet": "À, dường như ông thích các loại hình nghệ thuật Trung Quốc hơn bất cứ gì khác.", "eng": "Well, it seems that you like your Chinese artistic forms better than anything else."}, {"viet": "Thời tiết ẩm ướt có thể còn kéo dài vài ngày nữa.", "eng": "Wet weather may continue for a few more days."}, {"viet": "Những khu thương mại ở nước bạn như thế nào?", "eng": "What are shopping malls like in your country?"}, {"viet": "Lễ Giáng Sinh ngày nào trong tuần?", "eng": "What day of the week will Christmas be?"}, {"viet": "Ở nước bạn thức ăn nào được ưa chuộng?", "eng": "What food is popular in your country?"}, {"viet": "Có gì trục trặc với cái máy tính này vậy?", "eng": "What is the matter with this computer?"}, {"viet": "Loại trà nào được ưa chuộng nhất ở Anh?", "eng": "What kind of tea is the most popular in England?"}, {"viet": "Có gì vĩ đại về cái hố to lớn trong long đất ư?", "eng": "What so great about a big hole in the ground?"}, {"viet": "Bất kể những điều vô nghĩa in trên các báo, một số người vẫn luôn tin.", "eng": "Whatever nonsense the papers print, some people always believe it."}, {"viet": "Khi trông thấy cảnh sát đến, nó đã đột ngột bỏ chạy theo hướng ngược lại.", "eng": "When he saw the police coming he took off in the opposite direction."}, {"viet": "Khi quả lắc được lắp vào đồng hồ treo tường, người ta cũng thêm vào kim chỉ phút.", "eng": "When pendulums were put on clocks, minute hands were added, too."}, {"viet": "Khi họ có đợt bán hạ giá, chỗ đó luôn luôn chật ních người.", "eng": "When they have a sale, the pfece is always packed."}, {"viet": "Anh dự định sẽ đi đâu vào cuối năm?", "eng": "Where are you going at the end of the year?"}, {"viet": "Dù anh có tới hay không tôi cũng sẽ đi xem phim.", "eng": "Whether you come or not, I will be going for the movie."}, {"viet": "Vận động viên bơi lội nào đã thắng trong cuộc bơi tự do 100 mét.", "eng": "Which swimmer won the 100 metres freestyle."}, {"viet": "Ai đã được lựa chọn để tham gia vào dự án?", "eng": "Who has been selected to take part in the project?"}, {"viet": "Tại sao anh không tới khi tôi gọi ( tên anh )?", "eng": "Why didn't you come when I called ( out ) ( your name )?"}, {"viet": "Sự bần cùng lan rộng do nạn thất nghiệp gây ra.", "eng": "Widespread deprivation caused by unemployment."}, {"viet": "Ông vui lòng mở va-li ra?", "eng": "Will you open your suitcase, please?"}, {"viet": "Bằng những ngón tay khéo léo, cô ta đã gỡ rối sợi dây.", "eng": "With deft fingers she untangled the wire."}, {"viet": "Làm việc kiếm được nhiều tiền trong một tập đoàn lớn.", "eng": "Worked for big bucks in a large corporation."}, {"viet": "Anh có muốn dùng thêm ít bánh ngọt nữa không?'.", "eng": "Would you like some more cake?'."}, {"viet": "Xin các ông vui long thu xếp cho chúng tôi được không?", "eng": "Would you please make an arrangement for us?"}, {"viet": "Vâng, và bây giờ địa thế của khách sạn đẹp hơn đấy.", "eng": "Yes, and the hotel situation is better now."}, {"viet": "Có, xe đậu khắp các ngọn đồi.", "eng": "Yes, they're parked all around on the hills."}, {"viet": "Cậu phải trông coi cẩn thận bọn trẻ con.", "eng": "You'll have a keep a close watch on the children."}, {"viet": "Người ta trả lương cho anh không phải để anh ngồi không như thế.", "eng": "You're not pay to sit around doing nothing."}, {"viet": "Bây giờ ông đang ở Bắc Kinh, vậy hãy uống bia Bắc Kinh trước nhé?", "eng": "You are in Beijing now, and why not consider Beijing beer first?"}, {"viet": "Anh không thể phàn nàn về quyết định của toà được-nó rất công bằng.", "eng": "You can't quarrel with the court's decision-it's very fair."}, {"viet": "Anh có thể đỗ ôtô bên ngoài nhà chúng tôi.", "eng": "You can park your car outside our house."}, {"viet": "Anh không cần phải nói với anh ấy, nó làm anh ấy lo lắng.", "eng": "You didn't need to tell him, it just upset him."}, {"viet": "Anh được lựa chọn làm đơn xin từ chức hoặc là bị đuổi việc.", "eng": "You have the choice between resignation and dismission."}, {"viet": "Trông anh rất rám nắng-anh vừa đi nghỉ về đấy à?", "eng": "You look very tanned-have you been on holiday?"}, {"viet": "Ông phải giữ bản ghi nhớ đổi tiền vì ông có thể sử dụng nó sau này.", "eng": "You must keep the exchange memo for you might use it later."}, {"viet": "Anh chắc không dại gì ( mà tin cô ta ).", "eng": "You ought to know better ( than to trust her )."}, {"viet": "Sau lúc đọc nhiều, anh nên cho mắt nghỉ ngơi.", "eng": "You should rest your eyes after a lot of reading."}, {"viet": "Tối qua cậu nực cười quá! Làm sao vậy?", "eng": "You were a bundle of fun last night! What's wrong?"}, {"viet": "Quần áo thanh niên bây giờ lỗi thời nhanh quá.", "eng": "Young people's clothes date quickly nowadays."}, {"viet": "Nhiệm vụ tiếp theo của anh là tìm những người mất tích.", "eng": "Your next assignment will be to find these missing persons."}]