[{"viet": "Số 10 đường Downing là dinh chính thức của Ngài Thủ Tướng Anh.", "eng": "10 Downing Street is the British Prime Minister's official residence."}, {"viet": "Một con nhộng bướm thường gọi là nhộng.", "eng": "A butterfly pupa is often called a chrysalis."}, {"viet": "Một thành phố có một dân số trên 10 triệu.", "eng": "A city with a population of over 10 million."}, {"viet": "Một nước ở Á Châu ít người phương Tây tới thăm.", "eng": "A country in Asia visited by few westerners."}, {"viet": "Một ông vua bị phế truất mất hết quyền hành trước đây của ông ta.", "eng": "A deposed king shorn of his former power."}, {"viet": "Một nhà máy được đặt cạnh tuyến đường sắt.", "eng": "A factory sited next to a railway line."}, {"viet": "Một hãng nổi tiếng nhờ những sản phẩm có chất lượng cao.", "eng": "A firm known for its high-quality products."}, {"viet": "Một ly nước là được rồi, cám ơn.", "eng": "A glass of water would be nice, thank you."}, {"viet": "Một vị khách bị đưa nhầm rượu.", "eng": "A guest has been given the wrong drink."}, {"viet": "Một khách sạn loại khá hơn bình thường.", "eng": "A hotel out of the ordinary run."}, {"viet": "Một số lượng lớn công việc, tiền, đồ đạc.", "eng": "A large amount of work, money, furniture."}, {"viet": "Một ít thức ăn để ai đỡ đói.", "eng": "A little food to stay one's hunger."}, {"viet": "Một người to lớn và diện mạo kinh khủng.", "eng": "A man of enormous size and terrifying aspect."}, {"viet": "Một nhà tù hiện đại đã thay thế nhà tù từ thời Victoria.", "eng": "A modern prison has replaced the Victorian one."}, {"viet": "Một tân vô địch quần vợt có một cú giao bóng tuyệt chiêu.", "eng": "A new tennis champion with a mean service."}, {"viet": "Tàu khách chạy nhanh hơn tàu hàng.", "eng": "A passenger train is faster than goods train."}, {"viet": "Một ấn bản thử nghiệm của một giáo trình ngôn ngữ mới.", "eng": "A pilot edition of a new language course."}, {"viet": "Một số tiền thưởng là 2% được trả cho các khoản tiền đầu tư dài hạn.", "eng": "A premium of 2 per cent is paid on long term-investments."}, {"viet": "Một chứng ban đỏ xuất hiện trên người của anh ta.", "eng": "A rash has appeared on his body."}, {"viet": "Một bữa cơm dành cho hai người dưới ánh nến thơ mộng.", "eng": "A romantic candlelit dinner for two."}, {"viet": "Không nên cư xử thô lỗ với một đứa bé nhạy cảm.", "eng": "A sensitive child should not be mishandled."}, {"viet": "Một cuộc đụng độ giữa hai nhà lãnh đạo đảng.", "eng": "A skirmish between the two party leaders."}, {"viet": "Một chiến thắng lẫy lừng của vận động viên người Pháp.", "eng": "A spectacular victory by the French athlete."}, {"viet": "Một chất gây khó chịu cho da nhạy cảm.", "eng": "A substance that is irritant to sensitive skins."}, {"viet": "Một nhà hát nằm ở địa điểm rất thuận tiện.", "eng": "A theatre with a very central location."}, {"viet": "Một vùng đồng bằng mênh mông chỉ có một ít cây cối mọc chen vào.", "eng": "A vast flat plain interrupted only by a few trees."}, {"viet": "Một bãi ôtô cũ phế thải.", "eng": "A wilderness of old abandoned cars."}, {"viet": "Theo dự báo thời tiết ngày mai trời sẽ nắng.", "eng": "According to the weather forecast it will be sunny tomorrow."}, {"viet": "Quảng cáo xà bông, nhà cửa, dịch vụ.", "eng": "Advertise soap, one's house, one's services."}, {"viet": "Sau ca mổ của cô ấy, cô ấy nằm liệt giường khoảng một tuần.", "eng": "After her operation, she was confined to bed for a week."}, {"viet": "Sau những chào hỏi thân mật, chúng tôi ngồi xuống nói chuyện.", "eng": "After the cordialities, we sat down to talk."}, {"viet": "Đi máy bay ngày nay là một điều bình thường.", "eng": "Air travel is a commonplace nowadays."}, {"viet": "Tất cả tù nhân phải quặt hai cánh tay ra sau lưng đi vào trại.", "eng": "All prisoners were frogmarched out into the compound."}, {"viet": "Tất cả những người có lý trí phải ghét bạo động.", "eng": "All thinking people must hate violence."}, {"viet": "Những kế hoạch đầy tham vọng muốn hoàn thành đề án trước thời hạn.", "eng": "Ambitious plans to complete the project ahead of schedule."}, {"viet": "Một thiết bị dùng để phóng tên lửa vào không gian.", "eng": "An apparatus to project missiles into space."}, {"viet": "Một lượng mỡ quá nhiều trong chế độ ăn uống của ai có thể dẫn đến bệnh tim.", "eng": "An excess of fat in one's diet can lead to heart disease."}, {"viet": "Một cuộc đầu tư có mức rủi ro cao.", "eng": "An investment involving a high degree of risk."}, {"viet": "Một loại nhạc nền không rõ nhưng nghe hay.", "eng": "An undistinguished but listenable soundtrack."}, {"viet": "Cô vui lòng mang hành lý của tôi xuống tiền sảnh được không?", "eng": "And would you please take my luggage to the lobby?"}, {"viet": "Có cái gì nhẹ để các cô gái có thể khiêng vào không?", "eng": "Anything light the girls can carry in?"}, {"viet": "Ở đây có thắng cảnh nào không?", "eng": "Are there any scenic spots here?"}, {"viet": "Anh có hài lòng với cuộc sống của mình không?", "eng": "Are you happy with your life?"}, {"viet": "Chuẩn bị một buổi ăn tối để ăn mừng ngày kỷ niệm của họ.", "eng": "Arrange a dinner to celebrate their anniversary."}, {"viet": "Cho đến cuối thập kỷ 50, bệnh lao phổi vẫn còn là mối đe dọa.", "eng": "As late as the 1950s tuberculosis was still a threat."}, {"viet": "Xin ai tha lỗi về điều gì.", "eng": "Ask somebody's pardon for something."}, {"viet": "Vào lúc làm thủ tục bắt giam thì cảnh sát rút lại trường hợp của họ.", "eng": "At the committal proceedings the police withdrew their case."}, {"viet": "Các em bé bị màu sắc rực rỡ thu hút.", "eng": "Babies are attracted to bright colours."}, {"viet": "Cô ta ngồi trong chiếc ghế bành mà bố cô ta thích.", "eng": "Be comfortably installed herself in her father's favourite armchair."}, {"viet": "Đánh hỗn hợp đến khi nó nổi lên và nhẹ.", "eng": "Beat the mixture until it has a light, puffy texture."}, {"viet": "Dưới vẻ bề ngoài phẳng lặng của hoàn cảnh, có cái gì đó không ổn.", "eng": "Beneath the smooth surface of things, something was wrong."}, {"viet": "Điểm sôi là 100 độ bách phân.", "eng": "Boiling point is 100 Celsius degree."}, {"viet": "Thực phẩm nhập khẩu của Anh quốc từ các nước khác trên thế giới.", "eng": "Britain's food imports from the rest of the world."}, {"viet": "Nhưng tôi tin là tôi sẽ có cơ hội tốt hơn khi làm việc với một công ty nhỏ nhưng phát triển mạnh như công ty của ông.", "eng": "But I believe I would have better opportunities with a small but rapidly expanding company like yours."}, {"viet": "Nhưng cầu thủ chặn cản của bọn họ sẽ giết anh ta mất.", "eng": "But there tackle is going to murder him."}, {"viet": "Đúng ra thì phân nửa phần thưởng đó phải thuộc về tôi.", "eng": "By rights, half the reward should be mine."}, {"viet": "Tôi có thể mang cái này lên máy bay không?", "eng": "Can I carry this on board?"}, {"viet": "Liệu chúng ta có thể coi sự ghen tuông là động cơ của tội ác không?", "eng": "Can we assign jealousy as the motive for the crime?"}, {"viet": "Anh có thể cho tôi mượn ít tiền không?", "eng": "Can you lend me some money?"}, {"viet": "Anh có thể sờ thử xem cái này là cái gì không?", "eng": "Can you tell what this is by feeling it?"}, {"viet": "Ăn mừng sự lên ngôi của nữ hoàng.", "eng": "Celebrating the Queen's accession to the throne."}, {"viet": "Trẻ dưới 16 tuổi được miễn trả tiền đơn thuốc.", "eng": "Children under 16 are exempt from prescription charges."}, {"viet": "Bầu một thành viên mới vào ủy ban.", "eng": "Co-opt a new member onto the committee."}, {"viet": "Các công ty liên kết với nhau trong một cuộc làm ăn tay ba.", "eng": "Companies yoked together in a trilateral deal."}, {"viet": "Tranh cãi liên tục không đem lại một cuộc hôn nhân hạnh phúc.", "eng": "Constant arguing doesn't make for a happy marriage."}, {"viet": "Anh có thể chú ý tới chính tả hơn một tí được không?", "eng": "Could you give a little more attention to spelling?"}, {"viet": "Hãy chĩa súng vào cô ta trong khi tôi gọi điện báo cảnh sát.", "eng": "Cover her while I phone the police."}, {"viet": "Quỷ thật! Tôi đã mất cây dù.", "eng": "Damnation! I've lost my umbrella."}, {"viet": "Những người biểu tình phản đối là dự luật và thuế thiên vị giới giàu có.", "eng": "Demonstrators protested that the tax bill favoured the well-to-do."}, {"viet": "Hình như tôi có nghe thấy tiếng gõ cửa thì phải?", "eng": "Did I hear a knock at the door?"}, {"viet": "Cha mẹ bạn đã có ảnh hưởng rất lớn đối với bạn phải không?", "eng": "Did your parents have a strong influence, on you?"}, {"viet": "Nhớ ăn hết chả cá đi; nó không để lâu được đâu.", "eng": "Do finish of the fish pie; it won't keep."}, {"viet": "Bạn có đồng ý với tôi về nhu cầu cần thêm trường học không?", "eng": "Do you agree with me about the need for more schools?"}, {"viet": "Ông có giấy chứng minh có dán ảnh không?", "eng": "Do you have a picture ID?"}, {"viet": "Bạn biết ở Nhật Bản có bao nhiêu ngày quốc lễ không?", "eng": "Do you know how many national holidays there are in Japan?"}, {"viet": "Ba má bạn sống ở trung tâm Sendai à?", "eng": "Do you parents live in the center of Sendai?"}, {"viet": "Anh có nghĩ rằng Dự luật đó sẽ được thông qua tại nghị viện không?", "eng": "Do you think the Bill will get through Parliament?"}, {"viet": "Bà Feliccia làm mọi việc vào ban ngày phải không?", "eng": "Does Mrs. Feliccia do all the work in the day time?"}, {"viet": "Đừng bồn chồn như vậy-hãy thư giãn một chút.", "eng": "Don't be so nervous-loosen up a bit."}, {"viet": "Đừng có phách lối với tôi, cô nàng!", "eng": "Don't get uppish with me, young lady!"}, {"viet": "Đừng kéo dài sự căng thẳng nữa, hãy cho chúng tôi biết kết quả đi!", "eng": "Don't prolong the agony, just tell us the result!"}, {"viet": "Đừng cố nịnh bợ tôi; tôi sẽ không thay đổi ý kiến đâu.", "eng": "Don't try to soft-soap me; I'm not changing my mind."}, {"viet": "Rượu làm lộ bản chất thú vật trong người hắn.", "eng": "Drink brings out the beast in him."}, {"viet": "Những thí nghiệm ban đầu với các tên lửa quân sự là bước chuẩn bị cho việc du hành vũ trụ.", "eng": "Early experiments with military rockets prepared the ground for space travel."}, {"viet": "Mặt chữ tiếng Anh ít hợp lý.", "eng": "English spelling has little rhyme or reason."}, {"viet": "Mọi đứa trẻ đều biết là 2 với 2 là 4.", "eng": "Every child knows that two and two make four."}, {"viet": "Xin lỗi, anh có thể chỉ cho tôi đường đến thư viện công cộng không?", "eng": "Excuse me, can you tell me the way to the public library?"}, {"viet": "Cặp mắt long lên một cách hiểm độc khi nghĩ tới viễn cảnh báo thù.", "eng": "Eyes that glittered at the prospect of revenge."}, {"viet": "Cảm thấy bối rối khi đối diện một vấn đề khó khăn.", "eng": "Feel inadequate when faced by a difficult problem."}, {"viet": "Nổ súng có chủ đích giết người.", "eng": "Fire a weapon with intent to kill."}, {"viet": "Hoa mọc hai bên bờ đất đường quê.", "eng": "Flowers growing on the banks on each side of the country lanes."}, {"viet": "Đây là lần cuối cùng, mày không được đi!", "eng": "For the nth time, you can't go!"}, {"viet": "Từ một cô bé khá mộc mạc nàng trở thành một phụ nữ đẹp.", "eng": "From a rather plain child she had grown into a beautiful woman."}, {"viet": "Sự thuyết phục nhẹ nhàng có hiệu quả hơn là vũ lực.", "eng": "Gentle persuasion is more effective than force."}, {"viet": "Hãy gọi điện lại cho tôi và chúng ta có thể quyết định thời gian và địa điểm.", "eng": "Give me a call later and we can decide the time and place."}, {"viet": "Cưỡi lừa đi chơi trên bãi biển.", "eng": "Go for a donkey ride on the beach."}, {"viet": "Bà ngoại hơi già đi và không đi ra ngoài nhiều như trước đây nữa.", "eng": "Grandma's getting on a bit and doesn't go out as much as she used to."}, {"viet": "Những ngọn đèn bến cảng lung linh phía chân trời.", "eng": "Harbour lights blinking on the horizon."}, {"viet": "Anh có biết giờ này là mấy giờ không?", "eng": "Have you any idea what time it is?"}, {"viet": "Ông có đồng 50 xu không?", "eng": "Have you got a 50p piece?"}, {"viet": "Sau khi mất việc, ông ta đã bắt đầu quan tâm đến công việc tự nguyện ở địa phương.", "eng": "Having lost his job, he'd begun to interest himself in local voluntary work."}, {"viet": "Anh ta luôn luôn xung đột với cha mình về chính trị.", "eng": "He's always at odds with his father over politics."}, {"viet": "Anh ấy đã nấu ăn thường xuyên đến mức nhắm mắt anh ấy cũng có thể nấu được.", "eng": "He's cooked that meal so often he can do it with his eyes closed."}, {"viet": "Nó đã tổ chức một dàn nhạc sống cho buổi liên hoan.", "eng": "He's lined up a live band for the party."}, {"viet": "Nó là một con đà điểu-nó không muốn biết về chuyện bồ bịch của vợ nó.", "eng": "He's such an ostrich-he doesn't want to know about his wife's love affairs."}, {"viet": "Hắn luôn làm như người chịu tội khi phải làm công việc nhà.", "eng": "He always acts the martyr when he has to do the housework."}, {"viet": "Anh ta trở nên quậy phá om sòm khi có hơi men.", "eng": "He becomes obstreperous when he's had a few drinks."}, {"viet": "Hắn ta đã đến gặp tôi lấy cớ là yêu cầu tôi chỉ bảo trong khi thực sự là hắn muốn mượn tiền.", "eng": "He came to see me under the pretext of asking my advice when he really wanted to borrow money."}, {"viet": "Anh ta lục lọi tất cả hồ sơ để tìm cho ra bằng chứng vụ gian lận.", "eng": "He combed through the files searching for evidence of fraud."}, {"viet": "Anh ta quyết định ra một tờ báo.", "eng": "He decided to start a newspaper."}, {"viet": "Anh ấy vẽ những hình biếm họa ngộ nghĩnh về tất cả những bạn bè của anh ấy.", "eng": "He does very funny caricatures of all his friends."}, {"viet": "Anh ta cáo lỗi đã tới trễ với lý do xe ô tô của mình bị hỏng.", "eng": "He excused himself for being late by saying that his car had broken down."}, {"viet": "Anh ta bắn vài phát vào mục tiêu.", "eng": "He fired several shots at the target."}, {"viet": "Anh ta trố mắt nhìn chăm chăm cảnh đó.", "eng": "He gazed at the scene with staring eyes."}, {"viet": "Có vẻ hắn trốn thoát được là nhờ đút lót cho người gác.", "eng": "He had apparently escaped by bribing a guard."}, {"viet": "Anh ta có một trái tim sắt đá.", "eng": "He has a heart like a flint."}, {"viet": "Ông ta có vài thời kỳ dài làm việc ở ngoại quốc.", "eng": "He has had several long periods of work abroad."}, {"viet": "Anh ta vội vã đến sở làm.", "eng": "He hastened away to the office."}, {"viet": "Anh ta đang được chuẩn bị và huấn luyện để đạt địa vị ngôi sao.", "eng": "He is being groomed for stardom."}, {"viet": "Ông ta vẫn còn ở nấc dưới cùng của bậc thang chính trị.", "eng": "He is still on the bottom rung of the political ladder."}, {"viet": "Anh ấy đá thủng một lỗ ở hàng rào.", "eng": "He kicked a hole in the fence."}, {"viet": "Hắn sống kế bên nhà tôi.", "eng": "He lives near by my house."}, {"viet": "Anh ta xem thường sự tổn thương của mình.", "eng": "He made light of his injury."}, {"viet": "Anh ta lúc nào cũng cần có cử chỉ làm mọi người chú ý đến trong nghề nghiệp của anh ấy.", "eng": "He needs to maintain a high profile in his profession."}, {"viet": "Anh ta đem cầm chiếc đồng hồ vàng để trả tiền thuê nhà.", "eng": "He pawned his gold watch to pay the rent."}, {"viet": "Anh ta hứa giúp đỡ, nhưng tôi không nghĩ là điều đó đem lại cái gì.", "eng": "He promised to help, but I don't think anything will come of it."}, {"viet": "Anh ta với lấy quyển sách trên giá.", "eng": "He reached toward the book on the shelf."}, {"viet": "Ông ta đã từ chức sau khi đảng của ông thảm bại trong bầu cử.", "eng": "He resigned after his party was routed in the election."}, {"viet": "Anh ta là một thằng bé ngỗ nghịch khủng khiếp.", "eng": "He's a terribly naughty child."}, {"viet": "Đầu óc ông ta đầy những tư tưởng hay.", "eng": "He's full of good ideas."}, {"viet": "Anh ta không ngu, chỉ lười thôi.", "eng": "He's not stupid, just lazy."}, {"viet": "Ông ta nói ông ta thà từ chức còn hơn.", "eng": "He said he'd resign first."}, {"viet": "Nó có vẻ mê em gái tôi phát điên lên.", "eng": "He seemed mad keen on my sister."}, {"viet": "Anh ta tỏ ra sự hết sức tôn kính đối với Leonardo.", "eng": "He showed great reverence for Leonardo."}, {"viet": "Trong hầu hết các cuộc vận động đó ông ta đã dùng đường lối lường gạt.", "eng": "He spent much of the campaign on the low road."}, {"viet": "Anh ta đứng ngoài cửa trong tâm trạng khổ sở vì lưỡng lự.", "eng": "He stood outside the door in an agony of indecision."}, {"viet": "Anh ấy đi bộ mỗi buổi sáng để tăng sức khoẻ.", "eng": "He takes a constitutional every morning."}, {"viet": "Anh ta theo học một khoá học về bảo trì ô tô.", "eng": "He took a course to learn about car maintenance."}, {"viet": "Ông ta cố bắt nọn cô thư ký để moi thông tin.", "eng": "He tried to pump the secretary for information."}, {"viet": "Ông ta long trọng tuyên bố là một ngày nào đó ông ta sẽ trở về.", "eng": "He vowed that one day he would return."}, {"viet": "Anh được nhập viện vì những vết bỏng nhẹ.", "eng": "He was admitted to hospital with minor burns."}, {"viet": "Anh ấy bình tĩnh khi tôi báo với anh ấy tin xấu.", "eng": "He was calm when I told him the bad news."}, {"viet": "Anh ta bị dụ thú nhận tội lỗi bồi những câu hỏi khéo léo của cảnh sát.", "eng": "He was entrapped into making a concession by the clever questioning of the police."}, {"viet": "Nó bị ở lại lớp vì nói chuyện trong giờ học.", "eng": "He was kept in detention for talking during class."}, {"viet": "Anh ta được trả một món tiền thù lao khiêm tốn.", "eng": "He was paid a modest emolument."}, {"viet": "Anh ta lặng lẽ và kín đáo đến mức người ta hầu như không biết anh ta có mặt ở đó!", "eng": "He was so quiet and unobtrusive that you would hardly know he was there!"}, {"viet": "Anh ta bực mình vì không được mời.", "eng": "He was upset at not being invited."}, {"viet": "Nó đã gạt cô ta lấy mất đồng 5 bảng cuối cùng.", "eng": "He wheedles her out of her last five pounds."}, {"viet": "Nó làm việc lâu thế thì có hại cho sức khoẻ đấy.", "eng": "He works long hours, to the detriment of his health."}, {"viet": "Xe cộ đông đúc đặt thành vấn đề ở nhiều thành phố cổ.", "eng": "Heavy traffic poses a problem in many old towns."}, {"viet": "Sắc đẹp cô ta làm lu mờ sắc đẹp cô chị.", "eng": "Her beauty extinguishes that of her sister."}, {"viet": "Những lời chỉ trích của cô ta đủ làm cho người ta nổi giận.", "eng": "Her criticisms were enough to make anyone see red."}, {"viet": "Sự trượt thi của cô ta thật sự đã làm cha mẹ cô ấy phiền lòng.", "eng": "Her failing really got up her parents nose."}, {"viet": "Tim cô ta đập thình thịch.", "eng": "Her heart went pit-a-pat."}, {"viet": "Cuộc đời bà đã hiến dâng cho sự nghiệp công lý.", "eng": "Her life was devoted to the cause of justice."}, {"viet": "Những sự dao động tâm tính của bà ấy làm người ta muốn phát điên lên được.", "eng": "Her oscillations in mood are maddening."}, {"viet": "Bản báo cáo của cô ta đúng là không ra làm sao cả.", "eng": "Her report just doesn't stack up."}, {"viet": "Sự thành công của cô ấy trong kỳ thi đã khiến cho cô ấy kiếm được một chỗ ở trường đại học.", "eng": "Her success in the exam earned her a place at university."}, {"viet": "Xin chúc anh mọi sự tốt lành trong năm tới.", "eng": "Here's wishing you all the best in the coming year."}, {"viet": "Sự tin cậy tuyệt đối của ông ta vào những đồng nghiệp của mình.", "eng": "His absolute reliance on his colleagues."}, {"viet": "Hành vi của anh ta không tương xứng với nguyên tắc của anh ta.", "eng": "His behaviour does not accord with his principles."}, {"viet": "Lời bình phẩm của anh ta về tóc của cô ấy được tiếp nhận một cách rất khó chịu.", "eng": "His comment on her hair style really went down like a lead in a balloon."}, {"viet": "Sự chạm trán với con chó giữ nhà đã làm nó mất hết nhuệ khí.", "eng": "His encounter with the guard dog had completely unnerved him."}, {"viet": "Cuốn tiểu thuyết đầu tiên của anh ta làm cho anh ta nổi tiếng một thời rồi từ đó anh ta chẳng viết được cái gì tử tế cả.", "eng": "His first novel was a flash in the pan, and he hasn't written anything decent since."}, {"viet": "Ý kiến anh ta không phù hợp với ý kiến tôi.", "eng": "His ideas do not conform with mine."}, {"viet": "Cuộc đời ông ta đang trôi qua sắp đến lúc kết thúc.", "eng": "His life was wearing on towards its close."}, {"viet": "Sự phản kháng của ông ta bị bác bỏ vì không đúng thủ tục.", "eng": "His objection was ruled to be out of order."}, {"viet": "Án tù của hắn đã được miễn thi hành.", "eng": "His prison sentence has been remitted."}, {"viet": "Tật nói huyên thuyên ngu ngốc của hắn làm thánh cũng phải bực mình.", "eng": "His silly chatter would vex a saint."}, {"viet": "Sự bảo vệ thành công chức vô địch lần thứ ba của anh ấy.", "eng": "His third successful defence of the title."}, {"viet": "Tác phẩm của ông ấy có tầm cỡ cao nhất.", "eng": "His work is of the highest calibre."}, {"viet": "Em yêu, em định nấu bữa ăn tối lúc mấy giờ vậy?", "eng": "Honey, what time are you going to cook dinner?"}, {"viet": "Anh thấy trong người thế nào?''Ồ, khá tốt, cám ơn!'.", "eng": "How are you feeling?''Oh, not so dusty, thanks!'."}, {"viet": "Làm thế nào mà hắn biết được chúng tôi ở đâu?", "eng": "How did it come about that he knew where we were?"}, {"viet": "Bạn viết liền một mạch chữ U như thế nào?", "eng": "How do you write U in cursive?"}, {"viet": "Nó sẽ kéo dài bao lâu?", "eng": "How long will it be running?"}, {"viet": "Có bao nhiêu người làm việc ở phòng ban của bạn?", "eng": "How many people work in your department?"}, {"viet": "Bao lâu nữa chúng ta mới đến khách sạn?", "eng": "How much longer till we reach the hotel?"}, {"viet": "Tuy vậy, tôi sẽ có thể cùng ông ấy đến dự dạ tiệc vào thứ bảy.", "eng": "However, I'll be able to join him at the evening party on Saturday."}, {"viet": "Tôi đã uống hai cốc rượu vang và cảm thấy vui vẻ phấn chấn.", "eng": "I'd had two glasses of wine and I was feeling mellow."}, {"viet": "Tôi thích đi xem trận đấu ngày mai-liệu anh có xoay xở được không?", "eng": "I'd love to go to the match tomorrow-do you think you can wangle it?"}, {"viet": "Tôi sẽ trả anh mười pao để đền bù thiệt hại'.'Nhưng mà như thế chưa đủ'.", "eng": "I'll give you ten pounds to repair the damage'.'But that's not nearly enough!'."}, {"viet": "Tôi sẽ gửi ngay chúng đến bộ phận giặt ủi lần nữa.", "eng": "I'll send them to the laundry again right now."}, {"viet": "Tôi e rằng đó đúng là bản tính của anh ta.", "eng": "I'm afraid that's just the way he is."}, {"viet": "Tôi rất vui khi được ở trong một căn phòng tiện nghi.", "eng": "I'm glad to stay in a comfortable room."}, {"viet": "Tôi đang trọ ở nhà Bà Brown.", "eng": "I'm lodging at Mrs Brown's house."}, {"viet": "Theo ý kiến bác sĩ của tôi thì tôi đã béo lên 2kg.", "eng": "I'm overweight by 2kg according to my doctor."}, {"viet": "Tôi rất lấy làm tiếc là anh đã đi một chuyến vô ích.", "eng": "I'm sorry you've had a wasted journey."}, {"viet": "Bố buồn, nhưng bố không đau khổ hay trầm cảm đâu.", "eng": "I'm unhappy, but I don't stay sorrowful or depressed."}, {"viet": "Tôi đã được ghép đôi với Bob trong vòng thi đấu sau.", "eng": "I've been paired with Bob in the next round of the competition."}, {"viet": "Tôi đã giải quyết xong một đống thư từ hôm nay.", "eng": "I've got through a lot of correspondence today."}, {"viet": "Tôi không cần đến cái máy chữ này nữa, cho nên anh có thể lấy đi.", "eng": "I've no further use for this typewriter, so you can have it."}, {"viet": "Tôi khâm phục anh ta về sự thành công trong nghề nghiệp.", "eng": "I admire him for his success in business."}, {"viet": "Tôi hoàn toàn mất ý thức về phương hướng chúng tôi đang ở phía nào.", "eng": "I am completely disoriented which direction are we heading in."}, {"viet": "Tôi viết về vấn đề đơn xin việc làm của ông.", "eng": "I am writing with reference to your job application."}, {"viet": "Tôi là thành viên của câu lạc bộ âm nhạc.", "eng": "I belong to the music club."}, {"viet": "Tôi không thể tập trung được nữa, tôi sẽ từ bỏ công việc này.", "eng": "I can't concentrate any more, i'm going to jack it in."}, {"viet": "Tôi không thấy có gì hấp dẫn trong việc ngồi ngoài bãi biển suốt ngày cả.", "eng": "I can't see the attraction of sitting on the beach all day."}, {"viet": "Tôi có thể đề nghị với anh 50 bảng Anh nhưng hơn nữa thì không được.", "eng": "I can offer you £ 50, but I can't go any further than that."}, {"viet": "Tôi không liên lạc được với anh ta qua điện thoại.", "eng": "I can't reach him on the phone."}, {"viet": "Tôi có thể nghe thấy họ to tiếng với nhau trong phòng bên cạnh.", "eng": "I could hear them having words in the next room."}, {"viet": "Tôi muốn ăn một ít bánh nướng nhân táo.", "eng": "I'd like some apple pie."}, {"viet": "Tôi không biết anh ta sống ở đâu nhưng tôi có thể đoán.", "eng": "I didn't know where she lived but I could guess."}, {"viet": "Tôi không cần biết tiền ở đâu tới, đó không phải công việc của tôi.", "eng": "I don't care where the money comes from, that is not my pigeon."}, {"viet": "Tôi không ưa nó, nó làm cho tôi khó chịu.", "eng": "I don't like him, he gives me the creeps."}, {"viet": "Tôi không hiểu nổi sự thù hằn của anh ta đối với cha mẹ mình.", "eng": "I don't understand his enmity towards his parents."}, {"viet": "Tôi không có đặt phòng trước.", "eng": "I don't have a reservation."}, {"viet": "Tôi gửi kèm một tấm séc để thanh toán hoá đơn của ông.", "eng": "I enclose a cheque in settlement of your account."}, {"viet": "Tôi cũng thấy khỏe, cám ơn.", "eng": "I feel well, too, thank you."}, {"viet": "Tôi đã quên bỏ dao cạo vào túi hành lý.", "eng": "I forgot to pack my razor."}, {"viet": "Tôi bị một cú điện giật do công tắc đèn đó bị hỏng.", "eng": "I got an electric shock from that faulty light switch."}, {"viet": "Tôi phải vật lộn để giựt con dao khỏi tay hắn.", "eng": "I had a tussle to get the knife off him."}, {"viet": "Tuần trước tôi tình cờ gặp một người quen cũ.", "eng": "I happened on an old acquaintance last week."}, {"viet": "Tôi đã làm tất cả những gì mà luật pháp quy định.", "eng": "I have done all that is required by law."}, {"viet": "Tôi đã đặt trước một bàn cho chúng ta ở nhà hàng.", "eng": "I have reserved a table for us at the restaurant."}, {"viet": "Từ hôm qua đến giờ, tôi không ăn gì cả.", "eng": "I haven't had anything to eat since yesterday."}, {"viet": "Tôi chỉ nghe được một mẫu đối thoại của chúng.", "eng": "I heard only a fragment of their conversation."}, {"viet": "Tôi hy vọng anh đánh giá cao việc này: tất cả đều do chính tay tôi làm.", "eng": "I hope you'll appreciate this: it's all done by my own fair hand."}, {"viet": "Tôi cứ gặp hắn mọi nơi.", "eng": "I keep meeting him at every turn."}, {"viet": "Tôi để nó lên bàn hoặc trong ngăn kéo gì đó.", "eng": "I left it either on the table or in the drawer."}, {"viet": "Tôi sống ở đại lộ Vanowen và hai phố cắt qua gần nhất là Lindley và Etinwanda.", "eng": "I live on Vanowen Boulevard, and the nearest cross streets me Lindley and Etinwanda."}, {"viet": "Thứ bảy này tôi sẽ đi xem với một người bạn.", "eng": "I'll go with a friend this Saturday."}, {"viet": "Tôi sẽ gói nó lại cho ông.", "eng": "I'll wrap it up for you."}, {"viet": "Tôi bay đến Boston theo tuyến con thoi.", "eng": "I'm flying to Boston on the shuttle."}, {"viet": "Tôi không giỏi bằng anh ta.", "eng": "I'm not in his league."}, {"viet": "Tôi chán ngấy lời xu nịnh của anh ta rồi!", "eng": "I'm tired of his soft soap!"}, {"viet": "Tôi nhỡ chuyến xe buýt và phải cuốc bộ về nhà.", "eng": "I missed the bus and had to walk home."}, {"viet": "Tôi cần một chiếc áo mới''Thế à, phải bao nhiêu?'.", "eng": "I need a new coat.''Oh yes? What's the damage?'."}, {"viet": "Tôi phản đối kế hoạch đó vì nó quá tốn kém.", "eng": "I object to the plan on the grounds that it is too expensive."}, {"viet": "Tôi thích cái ghế đặt ở chỗ cũ hơn.", "eng": "I prefer the chair in its old place."}, {"viet": "Tôi thật tình không biết phải cám ơn anh như thế nào.", "eng": "I really don't know how to thank you."}, {"viet": "Tôi hối hận vì đã quá rộng lượng đối với tên lưu manh đó.", "eng": "I repent having been so generous to that scoundrel."}, {"viet": "Tôi đã tìm kiếm trong ký ức của tôi nhưng không thể nhớ được tên của cô ta.", "eng": "I searched my memory, but couldn't remember her name."}, {"viet": "Tôi thích một phòng ở tầng thứ nhất.", "eng": "I should like a room on the first floor."}, {"viet": "Tôi đã làm việc ở một nhà hàng mở cửa cả đêm trong một tháng, tôi không thể thức suốt như vậy.", "eng": "I stopped at an all-nighter for a month, i just couldn't keep those hours through."}, {"viet": "Tôi nghĩ anh ta đang giấu điều gì đó, anh ta biết nhiều hơn những gì anh ta thừa nhận.", "eng": "I think he's holding sth back, he knows more than he admits."}, {"viet": "Tôi nghĩ là cô ấy đúng nhưng vì một lí do nào đó tôi không hoàn toàn chắc.", "eng": "I think she's right but somehow I'm not completely sure."}, {"viet": "Tôi cho rằng đã Tây phương hóa rồi, nhưng xét cho cùng tất cả chúng ta đều quen với những điều đó từ lúc mới sinh và rất khó mà thay đổi được.", "eng": "I thought I was Westernized, but after all we're all used to certain things from birth, and it's hard to change."}, {"viet": "Tôi gắng thuyết phục hắn nhưng chỉ hơi có hiệu quả hoặc vô hiệu quả.", "eng": "I tried to persuade him, but with little or no effect."}, {"viet": "Tôi đã dùng đủ rồi, cám ơn.", "eng": "I've had enough, thank you."}, {"viet": "Tôi muốn đến Zurich vào Chủ Nhật.", "eng": "I want to get to Zurichon Sunday."}, {"viet": "Tôi suýt bị gió thổi bay.", "eng": "I was almost blown over by the wind."}, {"viet": "Tôi đã bị lừa mua phải nữ trang giả.", "eng": "I was hoodwinked into buying fake jewels."}, {"viet": "Tôi trượt đi không gượng được trên mặt băng.", "eng": "I was sliding about helplessly on the ice."}, {"viet": "Tôi không tính đến việc người phỏng vấn hỏi đến đời tư nên đã bị lúng túng mất một chốc.", "eng": "I wasn't expecting the interviewer to ask about my private life and was left floundering for a while."}, {"viet": "Tôi mong tôi có thể bỏ được thuốc lá.", "eng": "I wish I could give up the weed."}, {"viet": "Tôi tự hỏi ông có chấp nhận hối phiếu này không?", "eng": "I wonder if you accept this draft?"}, {"viet": "Cho tôi một ít rượu vang trắng nguyên chất.", "eng": "I would like some dry white wine, please."}, {"viet": "Tôi sẽ không hạ mình để cầu xin ơn huệ của họ.", "eng": "I wouldn't demean myself to ask for favours from them."}, {"viet": "Nếu có, Tôi muốn một chiếc xe hơi tự động.", "eng": "If available, I would like an automatic."}, {"viet": "Giả sử tôi nói với anh rằng tôi đã giết anh ấy thì anh có tin tôi không?", "eng": "If I were to tell you that I killed him, would you believe me?"}, {"viet": "Nếu trà quá đậm, thêm vào một ít nước.", "eng": "If the tea is too strong, add some more water."}, {"viet": "Nếu anh không biết chắc cách làm đó ra sao, hãy hỏi tôi.", "eng": "If you're not sure how to do it, ask me."}, {"viet": "Nếu anh không thích quyết định ấy thì anh cũng phải chịu đựng vậy thôi.", "eng": "If you don't like the decision you'll just have to lump it."}, {"viet": "Nếu ông mở một tài khoản tiết kiệm có kỳ hạn ông sẽ có một giấy chứng nhận gửi tiền theo tên của người gửi.", "eng": "If you open a fixed account you'll have a deposit certificate in the name of the depositor."}, {"viet": "Nếu ngài vui lòng ngồi đợi cho một lát, tôi sẽ báo cho ông giám đốc biết ngài đã đến.", "eng": "If you will sit down for a few moments, I'll tell the manager you're here."}, {"viet": "Ở Ai Cập cổ xưa, mùa sông Nile làm đất đai ngập lụt được tiếp theo sau mùa trồng trọt và chăm bón.", "eng": "In ancient Egypt the season when the Nile flooded the land was followed by the season when crops were planted and cared for."}, {"viet": "Ở Anh, thủ tướng là người đứng đầu nội các.", "eng": "In Great Britain the premier is the head of the cabinet."}, {"viet": "Những năm gần đây một vài vùng đã hoàn toàn thoát khỏi Đế quốc Anh.", "eng": "In recent times some parts of it have broken away completely."}, {"viet": "Nữ hoàng ở trong vườn.", "eng": "In the garden'trong the Queen was in the garden."}, {"viet": "Cùng lúc ấy chúng bắt đầu lấn các tế bào khác và lấy cắp thức ăn của các tế bào khác.", "eng": "In time they begin crowding other cells and stealing food the other cells need."}, {"viet": "Lãi suất đang ở mức kỷ lục.", "eng": "Interest rates are running at record levels."}, {"viet": "Bây giờ đã có rất nhiều tài liệu về cách sử dụng máy tính điện tử tại nhà.", "eng": "Is now an extensive literature on the use of computers in the home."}, {"viet": "Ông có điều gì đặc biệt muốn yêu cầu không?", "eng": "Is there anything special you'd like to order?"}, {"viet": "Đây là một công việc cho người chuyên nghiệp không phải cho người nghiệp dư.", "eng": "It's a business for professionals not amateurs."}, {"viet": "Thật là bực khi chỉ được phép chi tiêu những khoản tiền vặt vãnh như thế.", "eng": "It's annoying to have to get authorization for spending such piddling amounts of money."}, {"viet": "Trời lạnh dần: mùa đông đang bắt đầu.", "eng": "It's getting colder: winter is coming on."}, {"viet": "Trách nhiệm tôi là khoá các cửa ra vào.", "eng": "It's my responsibility to lock the doors."}, {"viet": "Đây chỉ là lần thứ hai đội thua ( một trận đấu ) trong mùa này.", "eng": "It's only the second time the team has lost ( a match ) this season."}, {"viet": "Đến lúc chúng ta cần một luồng sinh khí mới cho công ti này.", "eng": "It's time we got some new blood in this company."}, {"viet": "Sự việc lộ ra là nó đã nói nhiều điều dối trá.", "eng": "It came out that he'd been telling a pack of lies."}, {"viet": "Trả lời trung thực các câu hỏi của con cái là vấn đề nguyên tắc đạo lý đối với bà ấy.", "eng": "It is a matter of principle with her to answer her children's questions honestly."}, {"viet": "Thực hoang đường đến nực cười khi chỉ trao quyền lực cho một người.", "eng": "It is ludicrous to leave the reigns of power in a single ruler."}, {"viet": "Khôn ngoan ra là bạn nên gửi tiền vào ngân hàng để cho an toàn.", "eng": "It is wise to give you money to the bank for safekeeping."}, {"viet": "Tôi thực sự nổi giận khi cô ấy bắt đầu bảo rằng tôi không thành thật.", "eng": "It really got my dander up when she began accusing me of dishonesty."}, {"viet": "Nó được xem là thức uống lạ.", "eng": "It's regarded as a foreign drink."}, {"viet": "Hiển nhiên là chẳng có ai lại đi làm không công.", "eng": "It stands to reason that nobody will work without pay."}, {"viet": "Đó là một buổi biểu diễn tuyệt vời, mặc dù đôi lúc có những sai sót về âm điệu.", "eng": "It was a superb performance, despite occasional lapses of intonation."}, {"viet": "Có lẽ chỉ có nó lấy phần bánh to nhất thôi.", "eng": "It was just like him to take the biggest piece of the cake."}, {"viet": "Đó là một sự kiện không mấy vui vẻ và nó làm nản tinh thần của chúng tôi một thời gian.", "eng": "It was unpleasant event and it dampened out spirits for a while."}, {"viet": "Anh cứ đến dự cuộc họp sẽ thấy là thú vị.", "eng": "It would be well worth your while."}, {"viet": "Sự nghiệp của Joan đối với công ty thực sự là không còn gì cứu vãn được nữa.", "eng": "Joan's career with the firm is really beyond redemption."}, {"viet": "Ông vui lòng gọi điện cho nhân viên trực tổng đài và nói cho cô ấy biết phải gọi điện cho ông lúc mấy giờ sáng.", "eng": "Just call the operator and tell her what time to ring you in the morning, please."}, {"viet": "Tuần rồi một người bạn từ Nhật đến có mời tôi đi ăn tối.", "eng": "Last week a fellow from Japan took me to dinner."}, {"viet": "Để tôi xem. Từ đây đi bộ khoảng một phút.", "eng": "Let me see. It's about a minute walk from here."}, {"viet": "Nhìn xem, toàn thân chúng tôi đều đã rám nắng cả rồi.", "eng": "Look, we've got an all over tan."}, {"viet": "Nhiều người thích địa vị xã hội và yên ổn.", "eng": "Many people desire status and security."}, {"viet": "Marry nói rằng cô ấy tình cờ phát hiện được nhà hàng Ý này và cô ấy muốn đưa chúng ta đến đây.", "eng": "Mary said she found this Italian restaurant that she wants to take us to."}, {"viet": "Vui lòng cho tôi nói chuyên với John?", "eng": "May I speak with John, please?"}, {"viet": "Phần lớn các quảng cáo tác động thông qua sự gợi ý.", "eng": "Most advertisements work through suggestion."}, {"viet": "Ông Miller, ông đã gặp bà Anderson chưa?", "eng": "Mr. Miller, have you met Mrs. Anderson?"}, {"viet": "Ông chủ tôi đang vò đầu bứt tóc về sự chậm trễ trong kế hoạch.", "eng": "My boss is tearing his hair out about the delay in the schedule."}, {"viet": "Cái chân của tôi đang giết tôi ( làm rất đau ).", "eng": "My feet are killing me ( hurting very much )."}, {"viet": "Mẹ tôi chăm sóc ông ấy cẩn thận.", "eng": "My mother takes good, care of him."}, {"viet": "Chú tôi hay cho chúng tôi bộ đồ chơi xếp hình vào dịp lễ Giáng sinh.", "eng": "My uncle always gives us a board game for Christmas."}, {"viet": "Luật mới nhằm giải quyết tệ lạm dụng này sắp được ban hành.", "eng": "New laws to deal with this abuse are in the pipeline."}, {"viet": "Không, bây giờ tôi đã có việc làm rồi.", "eng": "No, I've got a job now."}, {"viet": "Làm ơn không cho đường vào cà phê của tôi, tôi đang ăn kiêng.", "eng": "No sugar in my coffee, please I'm dieting."}, {"viet": "Bây giờ thời tiết ấm hơn, anh có thể đi ra ngoài được đấy.", "eng": "Now the weather is warmer, you can go out."}, {"viet": "Ồ, tôi có một người bạn qua thư từ ở đó.", "eng": "Oh, I have a pen pal there."}, {"viet": "Người già bị ảnh hưởng nhiều nhất bởi giá sinh hoạt tăng lên.", "eng": "Old people are hardest hit by the rising cost of living."}, {"viet": "Người ta có thể tin ở sự thận trọng của các quyết định của ông ấy.", "eng": "One can rely on the prudence of his decisions."}, {"viet": "Một điều anh ấy nói với tôi lúc đó cho đến nay tôi vẫn còn nhớ.", "eng": "One thing he said then has stuck with me ever since."}, {"viet": "Ông phó giám đốc của chúng tôi mới là người đứng đầu thực sự của doanh nghiệp.", "eng": "Our deputy manager is the virtual head of the business."}, {"viet": "Hợp đồng bảo hiểm y tế của chúng ta sẽ giúp trang trải chi phí điều trị toàn bộ gia đình trong trường hợp bệnh tật.", "eng": "Our medical insurance offers protection for the whole family in the event of illness."}, {"viet": "Đội của tôi giành chức vô địch bơi lội.", "eng": "Our team won the swimming championship."}, {"viet": "Một phần của toà nhà đã bị lửa tàn phá.", "eng": "Part of the building was destroyed in the fire."}, {"viet": "Nhiều người đứng túm tụm thành những đám nhỏ để trú mưa.", "eng": "People stood around in small huddles, sheltering from the rain."}, {"viet": "Vui lòng ghi địa chỉ của ông vào phiếu yêu cầu đổi tiền này, cả số hộ chiếu của ông nữa.", "eng": "Please put down your address on this exchange request, also your passport number."}, {"viet": "Đeo đuổi một mối hận thù cá nhân dai dẳng đối với một địch thủ ghét cay ghét đắng.", "eng": "Pursue a personal vendetta against a hated rival."}, {"viet": "Các nhà khoa học đã đưa ra một lý thuyết mới để giải thích hiện tượng này.", "eng": "Scientists have advanced a new theory to explain this phenomenon."}, {"viet": "Chúng ta sẽ ấn định các cuộc họp hàng tuần vào các ngày thứ năm chứ?", "eng": "Shall we assign Thursdays for our weekly meeting?"}, {"viet": "Cô ấy tỏ ra dịu dàng và biết điều miễn là anh phải làm theo những gì cô ta muốn.", "eng": "She's all sweetness and light provided you're doing what she wants."}, {"viet": "Cô ấy rơi vào móng vuốt của cái gã đàn ông đáng kinh khủng ấy.", "eng": "She's fallen into the clutches of that awful man."}, {"viet": "Trong đời của cô ta chưa bao giờ có một ngày cô ta làm việc hết mình.", "eng": "She's never done an honest day's work in her life."}, {"viet": "Cô ấy là người phụ nữ mới đến văn phòng này vì thế hãy giúp cô ấy khi cô ấy cần.", "eng": "She's the new girl in the office, so give her any help she needs."}, {"viet": "Cô ta luôn luôn dành một ít miếng ngon cho con chó của mình.", "eng": "She always keeps some tibits to give her dog."}, {"viet": "Lúc đầu thì bà ấy đến nghỉ vài ngày nhưng cuối cùng thì bà ấy đã ở lại cả tháng.", "eng": "She came initially to spend a few days, but in the end she stayed for a whole month."}, {"viet": "Cô ta không che giấu được sự thích thú của mình trước sự nhầm lẫn của anh ấy.", "eng": "She could not disguise her amusement at his mistake."}, {"viet": "Mãi ngoài năm mươi tuổi, bà ấy mới lấy chồng.", "eng": "She didn't marry until she was over fifty."}, {"viet": "Bà ta trích ra những đoạn cho sinh viên dịch.", "eng": "She extracted passages for the students to translate."}, {"viet": "Cô ấy kêu lên một tiếng tức giận khi nghe tin đó.", "eng": "She gave a cry of anger when she heard the news."}, {"viet": "Cô ta đã có dịp thấy những người cạnh tranh trước khi bước vào phỏng vấn.", "eng": "She had a chance to see the competition before the interview."}, {"viet": "Cô ta có một bàn chân biến dạng và không đi lại được dễ dàng lắm.", "eng": "She has a deformed foot and can't walk very easily."}, {"viet": "Cô ấy phản đối kịch liệt việc làm vào ngày chủ nhật.", "eng": "She has strong objection to working on sundays."}, {"viet": "Cô ta cứ luẩn quẩn ở đây làm phiền mọi người.", "eng": "She is always hovering around the place annoying people."}, {"viet": "Bà ta trên tám mươi mà hoạt động rất tích cực.", "eng": "She is very active for an octogenarian."}, {"viet": "Cô ta nán lại sau buổi hoà nhạc hy vọng gặp nghệ sĩ nổi tiếng.", "eng": "She lingered after the concert, hoping to meet the star."}, {"viet": "Cô ta không hề giấu giếm sự chán ghét môn học đó.", "eng": "She made no bones about her distaste for the subject."}, {"viet": "Nhiều khi bà ta làm việc mười hai tiếng một ngày.", "eng": "She often puts in twelve hours'work a day."}, {"viet": "Cô ta đã làm được một bài xuất sắc trong cuộc thi chung kết.", "eng": "She produced an excellent piece of work in the final examination."}, {"viet": "Cô ấy lấy lại đồng hồ khi chuyến bay của cô ấy từ London đến New York.", "eng": "She reset her watch when her flight from London arrived in New York."}, {"viet": "Bà ta phải nuôi năm miệng ăn.", "eng": "She's got five mouths to feed."}, {"viet": "Bà ta hầu như không nói gì về kinh nghiệm của bà.", "eng": "She said little or nothing about her experience."}, {"viet": "Cô ấy đã lập một kỷ lục thế giới mới về môn nhảy cao.", "eng": "She set a new world record for the high jump."}, {"viet": "Bà ta đã đi tìm và kiếm được tất cả những tác phẩm hội hoạ đầu tay của ông ấy.", "eng": "She sought out and acquired all his early paintings."}, {"viet": "Bà ta nhận quần áo về giặt giũ ở nhà để thêm tiền vào lương hưu.", "eng": "She supplements her pension by taking in washing."}, {"viet": "Bà ấy đã chỉ trích chính phủ về các số liệu kinh tế.", "eng": "She took the government to task over its economic record."}, {"viet": "Cô ấy đi đi lại lại trong lúc chờ đợi.", "eng": "She walked up and down while she was waiting."}, {"viet": "Cô ta được chỉ định điều hành chiến dịch quảng cáo đó.", "eng": "She was appointed to conduct the advertising campaign."}, {"viet": "Cô ta tràn ngập sung sướng khi đẻ con gái.", "eng": "She was filled with elation when her daughter was born."}, {"viet": "Cô ta bị báo chí miêu tả sai là một người quá khích.", "eng": "She was misrepresented in the press as being a militant."}, {"viet": "Bà ta giận đến nỗi không nói được.", "eng": "She was so angry that she couldn't speak."}, {"viet": "Cô ta đi đi lại lại trên con đường chẳng có mục đích gì.", "eng": "She was wandering aimlessly up and down the road."}, {"viet": "Cô ta sẽ đến đây nhanh hơn là cậu chờ đợi.", "eng": "She will be here sooner than you expect."}, {"viet": "Nếu không vì các con thì bà ấy đã bỏ chồng từ nhiều năm trước rồi.", "eng": "She would have left her husband years ago except for the children."}, {"viet": "Tỏ tính tò mò không lành mạnh về sự giết người.", "eng": "Show an unhealthy curiosity about murder."}, {"viet": "Từ khi gia nhập Thị trường chung, thương mại của Anh với châu Âu đã tăng lên nhiều.", "eng": "Since joining the Common Market, Britain's trade with Europe has greatly increased."}, {"viet": "Ngủ trong phòng để ngỏ cửa sổ.", "eng": "Sleep in a room with the windows open."}, {"viet": "Rình ở cổng trường học để phát hiện học sinh đến muộn.", "eng": "Snooping about the school entrance looking for late-comers."}, {"viet": "Xã hội vẫn còn áp dụng cách đối xử trọng nam khinh nữ.", "eng": "Society still discriminates against women."}, {"viet": "Một vài loại côn trùng có tuổi sống không quá vài giờ.", "eng": "Some insects have a life-span of no more than a few hours."}, {"viet": "Nhiều người muốn thấy tội tử hình được áp dụng lại.", "eng": "Some people would like to see the death penalty come back."}, {"viet": "Ở đây có điều gì đó không thích hợp lắm.", "eng": "Something doesn't quite fit here."}, {"viet": "Nói tiếng Anh với một chút giọng Pháp.", "eng": "Speak English with the suggestion of a French accent."}, {"viet": "Những xuất phẩm Ánh sao cho ra mắt đội hợp xướng thiếu nhi của Trung Quốc tại buổi hòa nhạc.", "eng": "Starlight Productions present the Chinese Children's Choir in concert."}, {"viet": "Nín đi, đừng trẻ con như vậy.", "eng": "Stop crying and don't be such a baby."}, {"viet": "Những cơn gió mạnh thổi ngang làm lệch hướng máy bay.", "eng": "Strong cross-winds blew the aircraft off course."}, {"viet": "Cái công việc nông trại công xá rẻ mạt như thế là một hình thức của sự nô lệ.", "eng": "Such ill-paid farm work is a form of servitude."}, {"viet": "Chắc chứ, và nếu ông đi về đêm sau 9 giờ vào tối thứ ba, thứ tư hay thứ năm lại còn rẻ hơn.", "eng": "Sure, and if you travel at night after 9 on Tuesday, Wednesday, or Thursday, it's cheaper yet."}, {"viet": "Chọn đường lối nghiêm khắc với bọn tội phạm.", "eng": "Take a tough line with offenders."}, {"viet": "Tài xế tắc-xi hy vọng được tiền boa hậu từ các khách tại sân bay.", "eng": "Taxi drivers expect good tips from airport pick-ups."}, {"viet": "Quần vợt mất đi vẻ hấp dẫn của nó khi người ta trở về già.", "eng": "Tennis loses its relish when one gets old."}, {"viet": "Đó là câu nói mà tôi đang tìm kiếm cho mình.", "eng": "That's exactly the phrase I was looking for myself."}, {"viet": "Đồng hồ này nhanh tôi phải vặn lùi lại 5 phút.", "eng": "That clock is fast, I must put it back 5 minutes."}, {"viet": "Không có nhiều thay đổi trong làng.", "eng": "That isn't much alteration in the village."}, {"viet": "Chuyện đó nhắc nhở tôi phải cho mèo ăn.", "eng": "That reminds me I must feed the cat."}, {"viet": "Tín hiệu đó có nghĩa là số này đang bận.", "eng": "That tone means that the number is engaged."}, {"viet": "Trọng âm của từ important ở âm tiết thứ hai.", "eng": "The accent in the word important is on the second syllable."}, {"viet": "Nữ diễn viên quên mất lời thoại nhưng ứng khẩu một cách rất thú vị.", "eng": "The actress forgot her lines but ad-libbed very amusingly."}, {"viet": "Viên đại sứ hi vọng rằng nhiệm sở tới của ông ta sẽ là ở Pari.", "eng": "The ambassador expects that his next posting will be to Paris."}, {"viet": "Những cây táo đang nở hoa.", "eng": "The apple trees are in blossom."}, {"viet": "Bài viết về rạp hát đó đã cho chúng tôi vài thông tin nho nhỏ để hiểu biết thêm về tính cách người chủ của nó.", "eng": "The article about the theatre gave us a few sidelights on the character of its owner."}, {"viet": "Nữ văn sĩ loại bỏ nhân vật nam chính của bà trong chương 7.", "eng": "The author kills off her hero in Chapter 7."}, {"viet": "Những thi thể bị nát tơi tả của những người bị giết trong vụ nổ.", "eng": "The badly mangled bodies of those killed by the explosion."}, {"viet": "Những rào chắn đường không giữ được đám đông.", "eng": "The barriers failed to keep the crowds back."}, {"viet": "Sự phác thảo viễn cảnh tối ưu về một cuộc suy thoái kinh tế vừa phải.", "eng": "The best-case scenario of a mild recession."}, {"viet": "Vụ nổ làm tan chiếc ô tô.", "eng": "The blast disintegrated the automobile."}, {"viet": "Quyển sách rơi từ trên bàn xuống sàn.", "eng": "The book fell off the table onto the floor."}, {"viet": "Cái hộp đó thì ráp và không có lót.", "eng": "The box was rough and unlined."}, {"viet": "Gạch được xây trong bê tông.", "eng": "The bricks are bedded in concrete."}, {"viet": "Tên trộm đã bị bắt với đồ ăn cắp còn trên người nó.", "eng": "The burglar was caught with the stolen goods still on him."}, {"viet": "Ứng cử viên đó thất cử sát nút.", "eng": "The candidate lost the election by a whisker."}, {"viet": "Xe du lịch đâm vào xe tải.", "eng": "The car rammed into the lorry."}, {"viet": "Tòa lâu đài nằm ở vị trí kiểm soát được lối đi vào làng.", "eng": "The castle commanded the entrance to the village."}, {"viet": "Ông chủ tịch đã quyết định rằng người phát biểu không đúng thủ tục.", "eng": "The chairman ruled the speaker out of order."}, {"viet": "Thằng bé nhún nhảy trên giường.", "eng": "The child bounced up and down on the bed."}, {"viet": "Mẹ lũ trẻ rất lo cho sự an toàn của chúng khi chúng không đi học về theo giờ thường lệ.", "eng": "The children's mother was very concerned for their safety when they didn't come back from school at the usual time."}, {"viet": "Lũ trẻ giọng rung rung hát bài hát ngắn của chúng.", "eng": "The children quavered out their little song."}, {"viet": "Cơ đốc giáo, Do thái giáo và Hồi giáo.", "eng": "The Christian, Jewish and Muslim faiths."}, {"viet": "Khí hậu ở đây lúc nào cũng nóng, mùa hạ và mùa đông đều nóng như nhau.", "eng": "The climate here is always hot, summer and winter alike."}, {"viet": "Những vùng biển lạnh của Nam cực.", "eng": "The cold seas of the Antarctic."}, {"viet": "Uỷ ban đã tín nhiệm dồn phiếu cho ứng cử viên từng trải nhất.", "eng": "The committee plumped for the most experienced candidate."}, {"viet": "Công ty trả tiền chia vào cuối năm.", "eng": "The company pays the annual bonus at the end of the year."}, {"viet": "Việc củng cố vị trí ở hàng đầu của đảng trong cuộc thăm dò ý kiến.", "eng": "The consolidation of the party's position at the top of the opinion polls."}, {"viet": "Chi phí của dự án này chứng tỏ không tương xứng với kết quả.", "eng": "The cost of this project shows no relation to the results."}, {"viet": "Khoá học mở nhằm mở rộng kiến thức cho chúng tôi.", "eng": "The course was intended to broaden our horizons."}, {"viet": "Năm nay nghệ tây ra hoa chậm vì thời tiết lạnh.", "eng": "The crocuses came out late this year because of the cold weather."}, {"viet": "Bức màn bí mật che giấu những ý định của Chính phủ.", "eng": "The curtain of secrecy that hides the Government's intentions."}, {"viet": "Vụ giao dịch đã cho ( anh ta ) kiếm được một món lãi đáng kể.", "eng": "The deal netted ( him ) a handsome profit."}, {"viet": "Những người biểu tình đã không đông bằng cảnh sát.", "eng": "The demonstrators were outnumbered by the police."}, {"viet": "Từ khó đó đã buộc tôi phải tra từ điển của tôi.", "eng": "The difficult word sent me to my dictionary."}, {"viet": "Giữa cách anh ta trình bày với thực tế sự chia tách gần như là hoàn toàn.", "eng": "The divorce between his version and reality was almost total."}, {"viet": "Các bác sĩ chắc là họ có thể chữa được người bệnh nhưng khi có biến chứng thì họ mất hy vọng.", "eng": "The doctors were sure they could cure the patient, but when complications set in they lost hope."}, {"viet": "Đồng đôla lên giá đều đặn trong suốt tuần.", "eng": "The dollar has been climbing steadily all week."}, {"viet": "Thuốc tự nó không độc, nhưng trở nên nguy hiểm nếu uống với rượu.", "eng": "The drug is not harmful per se, but is dangerous when taken with alcohol."}, {"viet": "Các nhà thông thái ở đại học không biết gì về kinh doanh cả.", "eng": "The egghead at the university know nothing about business."}, {"viet": "Chiếc máy đến thời kỳ cần phải đại tu.", "eng": "The engine is due for an overhaul."}, {"viet": "Các sự kiện tối hôm đó không cần giải thích.", "eng": "The events of that evening speak for themselves."}, {"viet": "Thành ngữ'nouveau riche'được mượn từ tiếng Pháp.", "eng": "The expression'nouveau riche'is borrowed from French."}, {"viet": "Trang trại đó tọa lạc trên đỉnh đồi.", "eng": "The farm sits on top of the hill."}, {"viet": "Ngăn hồ sơ thì ở trong tủ hồ sơ.", "eng": "The files are in a filing cabinet."}, {"viet": "Lửa thiêu huỷ hầu hết toà nhà.", "eng": "The fire destroyed most of the building."}, {"viet": "Công ty đầu tiên đã đưa ra một hoàn giá chào rất hấp dẫn và đã giành được đơn đặt hàng.", "eng": "The first company made a very attractive counter-offer and won the order."}, {"viet": "Nước lũ tràn vào thung lũng.", "eng": "The floods surged along the valley."}, {"viet": "Pháo đài chiếm một vị trí lợi thế.", "eng": "The fort occupies a commanding position."}, {"viet": "Tương lai dường như chẳng có hứa hẹn gì lắm.", "eng": "The future does not seem very hopeful."}, {"viet": "Viên tướng cho quân xếp thành hàng dọc bờ sông.", "eng": "The general ranged his men along the riverbank."}, {"viet": "Vàng được dát thành những lá mỏng.", "eng": "The gold was beaten out into fine strips."}, {"viet": "Nhà nước đã thay đổi các số liệu để che giấu nạn thất nghiệp gia tăng gần đây nhất.", "eng": "The government has been juggling with the figures to hide the latest rise in unemployment."}, {"viet": "Chính phủ nói sẽ không nhường bước trước nạn khủng bố người tiêu dùng.", "eng": "The government said it would not give way to consumer terrorism."}, {"viet": "Ca sĩ vĩ đại đó đã trải qua những ngày cuối đời trong cảnh nghèo khó.", "eng": "The great singer ended his days in property."}, {"viet": "Người khách trọ muốn nghỉ ngơi trong phòng.", "eng": "The guest wants to have a rest in the room."}, {"viet": "Tim và dạ dày do cơ tạo thành.", "eng": "The heart and the stomach are made of muscle."}, {"viet": "Vạch kế hoạch cho nó thì háo hức thế mà bản thân kì nghỉ lại là một điều đáng thất vọng.", "eng": "The holiday itself was rather an anticlimax after all the excitement of planning it."}, {"viet": "Từ khách sạn đi ra bờ biển rất dễ.", "eng": "The hotel is within easy reach of the beach."}, {"viet": "Ngôi nhà có tường cao bao quanh.", "eng": "The house was surrounded by high walls."}, {"viet": "Sự tác động của các phương pháp mới đến nền công nghiệp hiện đại.", "eng": "The impact of new methods on modern industry."}, {"viet": "Vết thương để lại cho anh ta tật đi khập khiễng vĩnh viễn.", "eng": "The injury left him with a permanent limp."}, {"viet": "Những chỗ lồi lõm của bề mặt trái đất.", "eng": "The irregularities of the earth's surface."}, {"viet": "Quan toà ra lệnh xử lại vì có những điều không đúng quy chế.", "eng": "The judge ordered a retrial because of irregularities."}, {"viet": "Nhà bếp rất cần một nước sơn.", "eng": "The kitchen is crying out for a coat of paint."}, {"viet": "Vị cựu thủ tướng đã tham dự buổi lễ.", "eng": "The late prime minister attended the ceremony."}, {"viet": "Chức vị giảng viên là có thể được giữ trong một thời gian ba năm.", "eng": "The lectureship is tenable for a period of three years."}, {"viet": "Đường thẳng cắt đường tròn tại hai điểm.", "eng": "The line cuts the circle at two points."}, {"viet": "Chiếc xe tải lao xuống đồi không điều khiển được.", "eng": "The lorry ran down the hill out of control."}, {"viet": "Yếu tố quyết định chủ yếu cho thành công kinh tế là khả năng kiểm soát lạm phát của chúng ta.", "eng": "The main determinant of economic success is our ability to control inflation."}, {"viet": "Tấm bản đồ chẳng giúp được gì nhiều.", "eng": "The map wasn't much help."}, {"viet": "Biết được kỹ thuật đá bóng là nhờ thực tập.", "eng": "The mechanics of football are learned with practice."}, {"viet": "Sự biến thái của ấu trùng thành bướm.", "eng": "The metamorphosis of a larva into a butterfly."}, {"viet": "Món thịt nướng thập cẩm đã bị bỏ ra khỏi thực đơn.", "eng": "The mixed grill has been taken off the menu."}, {"viet": "Sự hiểu biết khó cảm nhận nhất chính là sự hiểu biết bản thân.", "eng": "The most elusive knowledge of all is self-knowledge."}, {"viet": "Viện bảo tàng chứa đựng nhiều đồ vật có giá trị.", "eng": "The museum contains many objects of value."}, {"viet": "Chiếc máy bay mới phải qua những cuộc thử nghiệm kỹ càng.", "eng": "The new aicraft underwent intensive tests."}, {"viet": "Kiểu ôtô mới lúc này đã được đưa ra bán cho các thị trường xuất khẩu.", "eng": "The new model has now been released for sale to export markets."}, {"viet": "Tôi e rằng tin không vui lắm.", "eng": "The news isn't very cheerful, I'm afraid."}, {"viet": "Tiếng ồn to đến nỗi làm hàng xóm phải khó chịu.", "eng": "The noise was so loud that it was a nuisance to the neighbours."}, {"viet": "Cô y tá lật sấp mình ông già để lau lưng cho ông.", "eng": "The nurse turned the old man over to wash his back."}, {"viet": "Chiếc xe buýt cũ kỹ nảy chồm chồm ( trên một con đường gồ ghề ).", "eng": "The old bus jolted along ( a rough track )."}, {"viet": "Lợi thế duy nhất của một kế hoạch đó là tính đơn giản của nó.", "eng": "The only advantage of the plan is its simplicity."}, {"viet": "Van mở của động cơ chạy bằng xăng hay hơi nước.", "eng": "The outlet valves of a petrol or steam engine."}, {"viet": "Công viên này trải rộng 1700 m từ đông sang tây, 1600 m từ bắc xuống nam và bao phủ khoảng 273 hécta.", "eng": "The park spans 1,700 meters from east to west, 1,600 meters from north to south, and covers about 273 hectares."}, {"viet": "Bệnh nhân đó đang trên đường đến phòng giải phẫu.", "eng": "The patient is on her way to the theatre."}, {"viet": "Xét theo những tiêu chuẩn thông thường của họ thì buổi biểu diễn đó hay.", "eng": "The performance was good, when judged by their usual standards."}, {"viet": "Những bức tranh trong sách cho ta thấy vài loại tinh thể.", "eng": "The pictures show several kinds of crystals."}, {"viet": "Máy bay rơi nhưng phi hành đoàn an toàn.", "eng": "The plane crashed but the crew are safe."}, {"viet": "Vở kịch dựng lại cuộc sống trước chiến tranh.", "eng": "The play recreates life before the war."}, {"viet": "Người cảnh sát đang cố gắng xác định điều gì đã thật sự xảy ra.", "eng": "The police are trying to ascertain what really happened."}, {"viet": "Cảnh sát ít khi nào bắn với ý định giết chết.", "eng": "The police only rarely shoot to kill."}, {"viet": "Sự náo động về chính trị khiến tình hình ở Châu Phi càng hỗn loạn hơn.", "eng": "The political storm has made the situation in Africa more chaotic."}, {"viet": "Thuốc bột không để lại một dư vị đắng nào.", "eng": "The powder leaves no bitter aftertaste."}, {"viet": "Tổng thống phải tuyên thệ công khai.", "eng": "The President has to be sworn in publicly."}, {"viet": "Vị linh mục khiển trách mọi người vì không đi lễ.", "eng": "The priest reproved people for not coming to church."}, {"viet": "Những tù nhân cố vượt ngục nhưng thất bại.", "eng": "The prisoners attempted an escape, but failed."}, {"viet": "Dự án đó là sáng kiến của Max Nicholson.", "eng": "The project was a brainchild of Max Nicholson."}, {"viet": "Sự rung động của máu trong cơ thể.", "eng": "The pulsation of the blood in the body."}, {"viet": "Vấn đề hành động bãi công cần phải được đưa ra cho các thành viên của công đoàn bỏ phiếu.", "eng": "The question of strike action must be put to union members."}, {"viet": "Độc giả được chỉ dẫn xem trang 3.", "eng": "The reader is referred to page 3."}, {"viet": "Giá tương đối của sự đi lại bằng xe lửa và bằng xe buýt.", "eng": "The relative costs of travelling by train and by coach."}, {"viet": "Nhà hàng được kê ra trong cuốn sách hướng dẫn này có vẻ rất ngon.", "eng": "The restaurant listed in this guidebook is supposed to be very good."}, {"viet": "Sự thăng trầm của Đế Quốc Anh.", "eng": "The rise and fall of the British Empire."}, {"viet": "Bọn cướp muốn có giấy thông hành an toàn cho bọn chúng và các con tin để đến sân bay.", "eng": "The robbers wanted safe-conduct to the airport for themselves and their hostages."}, {"viet": "Miếng lót cao su đó là để ngăn mọi hơi ẩm thấm vào.", "eng": "The rubber seal is designed to keep out all the moisture."}, {"viet": "Một luận điểm không thể đúng trong mọi trường hợp.", "eng": "The same argument doesn't hold good in all cases."}, {"viet": "Quan niệm về mặt khoa học, pháp lý, y học, v. v. là.", "eng": "The scientific, legal, medical, etc view is that..."}, {"viet": "Nét gợi cảm trong bức họa của bà ấy.", "eng": "The sensuous appeal of her painting."}, {"viet": "Những công nhân đóng tàu bãi công đòi tăng lương.", "eng": "The ship-builders went out on strike for higher pay."}, {"viet": "Cửa hàng được đóng cửa để sửa chữa.", "eng": "The shop is closed for repairs."}, {"viet": "Cách giản đơn nhất để thành công trong kinh doanh là mua thấp bán cao.", "eng": "The simplest way to succeed in business is to buy low and sell high."}, {"viet": "Mùi khói thuốc làm tôi phát ốm.", "eng": "The smell of smoke makes me sick."}, {"viet": "Điểm duy nhất đền bù cho công việc này là tiền lương.", "eng": "The sole redeeming feature of this job is the salary."}, {"viet": "Diễn giả kích động đám đông tới trạng thái cuồng nhiệt.", "eng": "The speaker worked the crowd up into a state of frenzy."}, {"viet": "Lời phát biểu đó là một cách thuật lại rất méo mó sự thật.", "eng": "The statement is a highly contorted version of the truth."}, {"viet": "Câu chuyện vui đến nỗi khán giả cười bò ra.", "eng": "The story was so funny that the audience fell into a convulsion of laughter."}, {"viet": "Sự thành công của một cuộc đi chơi và ăn ngoài trời thường lệ thuộc vào thời tiết.", "eng": "The success of a picnic usually turns on weather."}, {"viet": "Tên bịp bợm hành động dưới nhiều cái tên giả.", "eng": "The swindler worked under various aliases."}, {"viet": "Thầy giáo cau mặt nhìn tôi bởi vì tôi đến muộn.", "eng": "The teacher scowled at me because I was late."}, {"viet": "Tính mau lẹ của đấu thủ quần vợt là thế mạnh của anh ta.", "eng": "The tennis player's speed is his great asset."}, {"viet": "Ý nghĩ đi máy bay làm tôi khiếp đảm.", "eng": "The thought of flying fills me with panic."}, {"viet": "Người hướng dẫn du lịch ngồi ở phía đầu xe, đi đến đâu giới thiệu đến đấy.", "eng": "The tour guide gave a running commentary from the front of the coach."}, {"viet": "Sự chuyển giao quyền bính cho một chính phủ dân sự.", "eng": "The transferral of power to a civilian government."}, {"viet": "Hai bản tường trình giống y như nhau.", "eng": "The two accounts are precisely the same."}, {"viet": "Các lốp xe này đã mòn nhưng còn dùng được.", "eng": "The tyres are worn but still serviceable."}, {"viet": "Điều thông thường-anh biết đấy-điều gì đó về nhân thân, kinh nghiệm và bất cứ điều gì về bản thân mà anh cảm thấy cần nói.", "eng": "The usual-you know-something about your background and experience and anything personal that you feel is pertinent."}, {"viet": "Những mặt mạnh của nghề dạy học.", "eng": "The virtues of teaching as a profession."}, {"viet": "Nước đã bị cắt mỗi ngày nhiều giờ khi có hạn hán.", "eng": "The water was turned off for several hours a day during the drought."}, {"viet": "Toàn bộ mưu mô đó dường như toàn chuyện đồi bại-chớ có dính líu vào đấy.", "eng": "The whole scheme stinks to high heaven-don't get involved in it."}, {"viet": "Nhân chứng bị thẩm phán cảnh cáo vì đã không trả lời câu hỏi.", "eng": "The witness was admonished by the judge for failing to answer the question."}, {"viet": "Cái lạnh thấu xương của mùa đông đã qua rồi.", "eng": "The worst of the winter is over."}, {"viet": "Cuộc gặp gỡ tình cờ của họ đã đem họ lại bên nhau sau bảy năm xa cách.", "eng": "Their chance meeting brought them back together after seven years apart."}, {"viet": "Đề nghị của họ đẩy tôi vào tình trạng tiến thoái lưỡng nan một chút.", "eng": "Their offer has put me in a bit of a dilemma."}, {"viet": "Rồi nó trở thành một tước vị có nghĩa là Hoàng đế.", "eng": "Then it became a title that meant emperor."}, {"viet": "Có một bất hoà lớn giữa hai gia đình ấy.", "eng": "There's a lot Of bad blood between those two families."}, {"viet": "Không cần phải nổi giận như thế.", "eng": "There's no need to get into such a paddy."}, {"viet": "Có một con đường nhỏ qua rừng.", "eng": "There a narrow path through the forest."}, {"viet": "Không có qui tắc đặc biệt nào về vấn đề anh phải mặc quần áo gì.", "eng": "There are no special rules as regards what clothes you should wear."}, {"viet": "Có rất ít cơ hội được đề bạt.", "eng": "There are very few opportunities for promotion."}, {"viet": "Đây là sự thực không phải là vấn đề quan niệm.", "eng": "There is a fact and not a matter of opinion."}, {"viet": "Không có manh mối gì về nhân dạng của tên trộm.", "eng": "There is no clue to the identity of the thief."}, {"viet": "Ngày mai có thể có thông báo về việc này-hoặc không có, tuỳ theo tình hình.", "eng": "There may be an announcement about this tomorrow-or not, as the case may be."}, {"viet": "Có một ánh lấp lánh đột ngột khi pháo hoa được đốt lên.", "eng": "There was a sudden sparkle as the fireworks were lit."}, {"viet": "Đã có 5 lần hoãn lại trong suốt cuộc hành trình bằng ô tô.", "eng": "There were five delays during the bus trip."}, {"viet": "Đây là hộ chiếu của ông và thêm bản ghi nhớ đổi tiền liên quan để ông tham khảo.", "eng": "These are your passport and also the relative exchange memo for your reference."}, {"viet": "Những vấn đề này nằm ngoài thẩm quyền của toà án này.", "eng": "These matters fall go beyond the cognizance of this court."}, {"viet": "Họ đã có mối quan hệ gần gũi lý tưởng hơn ba mươi năm qua.", "eng": "They'd had a close platonic relationship for more than thirty years."}, {"viet": "Họ đã đổ vodka vào nước quả ép của cô ta cho cô ta say.", "eng": "They've put vodka in her fruit juice to get her drunk."}, {"viet": "Họ không phải là anh em sinh đôi nhưng lại rất giống nhau.", "eng": "They are not twin but they are very like."}, {"viet": "Họ tán tỉnh những tờ báo địa phương đăng truyện đó.", "eng": "They cajoled local newspapers into publishing the story."}, {"viet": "Họ nói đề nghị về lương mới đây là chẳng bõ bèn gì.", "eng": "They described the latest pay offer is derisory."}, {"viet": "Chúng bay nhẹ nhàng trong vườn vào những ngày hè trời nắng.", "eng": "They flit about in our gardens on sunny summer days."}, {"viet": "Họ có vẻ mặt và điệu bộ khác nhau.", "eng": "They have different facial expressions and postures."}, {"viet": "Họ sống hoàn toàn hoà thuận với nhau.", "eng": "They live in perfect accord with each other."}, {"viet": "Chúng nó mở gói và thích thú reo lên.", "eng": "They opened the parcel with whoops of delight."}, {"viet": "Họ ngồi tại chỗ trong khi tôi đi vắng.", "eng": "They remained in their seats during my absence."}, {"viet": "Họ suốt ngày mang mối hận thù với hàng xóm của họ.", "eng": "They spend their time feuding with their neighbours."}, {"viet": "Họ muốn tậu một căn nhà mới, gần biển là tốt nhất.", "eng": "They want to buy a new house, near the sea preferably."}, {"viet": "Họ tỏ ra quan tâm, nhưng họ cho rằng Columbus đòi hỏi quá nhiều phần thưởng nếu ông thành công.", "eng": "They were interested, but they thought that Columbus wanted too much reward if he was successful."}, {"viet": "Họ làm việc cho đến lúc họ phải quỵ xuống.", "eng": "They worked till they were fit to drop."}, {"viet": "Cuốn sách này quá khó đối với tôi-Vớ vẩn!", "eng": "This book is too difficult for me-Nonsense!"}, {"viet": "Quyết định này đã gây ra rất nhiều sự phê bình.", "eng": "This decision has come in for a great deal of criticism."}, {"viet": "Trong cái thời gian còn nhớ lại được thì điều đó không xảy ra.", "eng": "This hasn't happened before within memory."}, {"viet": "Đây chỉ là bản nháp bài diễn văn của tôi thôi, nhưng anh thấy thế nào?", "eng": "This is only the draft of my speech, but what do you think of it?"}, {"viet": "Ổ khoá như con khỉ-không mở được.", "eng": "This lock's a brute-it just won't open."}, {"viet": "Tờ báo này là cơ quan chính thức của Đảng Cộng sản.", "eng": "This paper is the official organ of the Communist Party."}, {"viet": "Bao tải khoai tây này thiếu năm kí lô.", "eng": "This sack of potatoes is five kilos light."}, {"viet": "Tỉnh này nổi tiếng vì những toà nhà đẹp.", "eng": "This town is famous for its beautiful buildings."}, {"viet": "Những người biểu lộ quan điểm bất đồng với giáo lý của giáo phái Anh có thể bị phạt nặng.", "eng": "Those who dissented from Anglican teachings could be heavily fined."}, {"viet": "Chúng ta có thể cùng nhau thúc đẩy đáng kể lợi ích của cả hai bên.", "eng": "Together we can significantly advance our mutual interests."}, {"viet": "Hai cái đinh ốc trong cánh cửa gỗ cũ này đã long ra.", "eng": "Two screws in this old wooden door have worked themselves free."}, {"viet": "Chiến tranh là chắc chắn rồi, chúng ta nên chuẩn vũ khí ngay không chậm trễ.", "eng": "War is certain, we should arm without delay."}, {"viet": "Chúng tôi sẽ mua bảo hiểm cho chuyến hàng.", "eng": "We'll apply for insurance on the shipment."}, {"viet": "Chúng tôi đang tiến hành cuộc thương lượng rất tế nhị.", "eng": "We're conducting very delicate negotiations."}, {"viet": "Chúng ta phát chán vì phải phục tùng quyền lực.", "eng": "We're tired of having to bow to authority."}, {"viet": "Chúng tôi đã trả tiền tàu xe và chỗ ăn chỗ ở rồi, nên chỉ cần mang theo một ít tiền tiêu vặt nữa thôi.", "eng": "We've paid for our travel and accommodation, so we only need to take some pocket-money with us."}, {"viet": "Chúng tôi trở nên quen với tiếng ồn ào của xí nghiệp mới gần kề.", "eng": "We are becoming attuned to the noise of a new factory nearby."}, {"viet": "Chúng tôi tới nhà ga chậm năm phút.", "eng": "We arrived at the station five minutes late."}, {"viet": "Chúng ta có thể quyết định về thời gian và địa điểm.", "eng": "We can decide on the time and place."}, {"viet": "Chúng tôi có thể lờ anh ta và đi thẳng đến ông chủ tịch, nhưng làm như thế sẽ gây ra rắc rối.", "eng": "We could ignore him and go direct to the chairman, but we'd be skating on very thin ice."}, {"viet": "Chúng tôi không nhận được nhiều hơn đơn xin việc.", "eng": "We don't have many applications."}, {"viet": "Chúng tôi đã bị lừa khi mua ngôi nhà này.", "eng": "We got screwed when we bought this house."}, {"viet": "Chúng tôi có 20 kênh để lựa chọn.", "eng": "We have 20 channels to select from."}, {"viet": "Chúng tôi đã giải quyết tã cả ngoại trừ vấn đề biên giới.", "eng": "We have solved all but the border problems."}, {"viet": "Chúng ta biết về loài khủng long chủ yếu qua bộ xương của chúng và những dấu chân trên đá.", "eng": "We know about dinosaurs chiefly through their bones and their footprints in the rocks."}, {"viet": "Chúng ta có thể phải dùng đến một hãng tư vấn bên ngoài.", "eng": "We may have to use an outside firm of consultants."}, {"viet": "Chúng ta phải đặt ra những mục tiêu kinh doanh chính xác cho năm tới.", "eng": "We must set ourselves precise sales targets for the coming year."}, {"viet": "Trên đường đến London, chúng tôi đi qua Oxford.", "eng": "We passed through Oxford on our way to London."}, {"viet": "Chúng tôi đã lục tìm ( xung quanh ) hàng giờ mà không thể nào tìm ra quyển sách.", "eng": "We searched ( around ) for hours, but couldn't find the book."}, {"viet": "Chúng tôi còn cần 100 pao để có đủ số tiền theo yêu cầu.", "eng": "We still need 100 pounds to make up the sum required."}, {"viet": "Chúng tôi muốn giúp làm giảm bớt sự khan hiếm thực phẩm của đất nước.", "eng": "We want to help alleviate the national food shortage."}, {"viet": "Chúng ta bắt buộc phải tham dự lễ khai mạc.", "eng": "We were obligated to attend the opening ceremony."}, {"viet": "Chúng ta sẽ bất lực như người gỗ nếu không có những cơ này.", "eng": "We would be as helpless as wooden dolls if it were not for these muscles."}, {"viet": "À, thật sự tôi không nhớ.", "eng": "Well, I don't really remember."}, {"viet": "À, tại sao con không được học những môn con thích nhỉ?", "eng": "Well, why shouldn't I take the courses I like?"}, {"viet": "Đứa bé xinh đẹp làm sao! cô ta xuýt xoa.", "eng": "What a beautiful little baby! she crooned."}, {"viet": "Những sách quy định cho kỳ thi tiếng Anh trình độ A của anh là những quyển gì?", "eng": "What are your set books for English'A'Level?"}, {"viet": "Anh nghĩ chủ định của tác giả trong đoạn văn này là gì?", "eng": "What do you think was the author's intention in this passage?"}, {"viet": "Tuổi trung bình của các nhân viên được thuê mướn ở công ty của bạn là bao nhiêu?", "eng": "What is the average age of the workers employed at your company?"}, {"viet": "Bạn nghĩ gì về các cửa hàng giảm giá ở Nhật Bản?", "eng": "What is your opinion of discount stores in Japan?"}, {"viet": "Tối nay có chương trình gì trên tivi vậy?", "eng": "What's on TV for tonight?"}, {"viet": "Khi còn nhỏ, quyển sách bạn yêu thích là quyển gì?", "eng": "What was your favorite book when you were a child?"}, {"viet": "Chuyến tàu kế tiếp khởi hành lúc mấy giờ?", "eng": "When does the next train leave?"}, {"viet": "Khi tôi còn trẻ thì việc hút cần sa là điều tội lỗi.", "eng": "When I was young, smoking marijuana was the sin of sins."}, {"viet": "Khi cảnh sát khai quật tử thi lên họ thấy có dấu vết thuốc độc trên đó.", "eng": "When the police exhumed the corpse they discovered traces of poison in it."}, {"viet": "Khi ông xuống đến ga xe điện ngầm, hãy hỏi mua một bản đồ xe điện ngầm.", "eng": "When you get down into the subway booth, ask for a subway map."}, {"viet": "Công ty Thương mại ABC nằm ở đâu?", "eng": "Where is ABC Trading Company located?"}, {"viet": "Ở Anh, cửa hàng bách hóa nào rộng lớn nhất?", "eng": "Which is the largest department store in England?"}, {"viet": "Ai sẽ nấu ăn tối nay Chúng ta tung đồng tiền xem là ai nhé.", "eng": "Who's going to cook tonight Let's toss up."}, {"viet": "Ai có thể tưởng là thấy anh ở đây?", "eng": "Who would have thought to find you here?"}, {"viet": "SAO BẠN KHÔNG THUÊ XE HƠI?", "eng": "WHY DONT YOU RENT A CAR?"}, {"viet": "Ông sẽ ở đó vài phút chứ?", "eng": "Will you be there for a few minutes?"}, {"viet": "Sự khôn ngoan bao gồm việc học để khi nào thì lảng tránh khi nào thì chống lại.", "eng": "Wisdom consists in learning when to evade when to oppose head on."}, {"viet": "Nữ giới cũng được đề bạt lên làm chủ, chủ của gia đình họ, chủ của con cái và chồng họ.", "eng": "Women are promoted to be bosses, bosses of their homes, children and husbands."}, {"viet": "Anh vui lòng xem qua lại các con số này để kiểm tra các tính toán của tôi được không?", "eng": "Would you give these figures a look-over to check my calculations?"}, {"viet": "Bà có muốn dùng cà phê bây giờ không?", "eng": "Would you like your coffee now?"}, {"viet": "Viết vào một mặt của trang còn mặt kia để trống.", "eng": "Write on one side of the page and leave the other side blank."}, {"viet": "Vâng, Tôi sẽ lấy cho ông một đôi khác ngay.", "eng": "Yes, I will get you another pair right away."}, {"viet": "Anh phải rất tinh mắt để nhận ra lỗi chính tả của cô ấy.", "eng": "You'd have to be very sharp-eyed to find any mistakes in her spelling."}, {"viet": "Mày là đồ lợn ích kỷ!''Mày cũng thế, khác gì đâu!'!", "eng": "You're a selfish pig!''And the same to you, with knobs on!"}, {"viet": "Bạn nói quá nhiều về mình.", "eng": "You've got too much to say for yourself."}, {"viet": "Anh không thể tách khoa học khỏi các vấn đề đạo đức.", "eng": "You can't divorce science from ethical questions."}, {"viet": "Anh có thể lái xe đưa tôi đến ngân hàng nếu anh muốn.", "eng": "You can drive me to the bank if you want to."}, {"viet": "Bà nấu nó với bơ và thêm vào một ít nước tương.", "eng": "You cook it in butter and add a drop of soy sauce."}, {"viet": "Bạn có một ngôi nhà rất đẹp.", "eng": "You have a very nice house."}, {"viet": "Con biết là khi con không đi ngủ thì mẹ sẽ buồn.", "eng": "You know it makes me unhappy when you don't go to bed."}, {"viet": "Cậu hoá rồ hay sao mà lại đi chơi trong thời tiết khủng khiếp như thế này.", "eng": "You must be crazy to go walking in such awful weather."}, {"viet": "Để trở thành một chính khách anh phải mặt dày mày dạn.", "eng": "You need a thick skin to be a politician."}, {"viet": "Ông liên hệ với tòa đại sứ Trung Quốc hay Tổng lãnh sự quán Trung Quốc.", "eng": "You should contact the Chinese Embassy or the Consulate General of China."}, {"viet": "Đồ chó chết! Suýt nữa thì mày chẹt chết tao!", "eng": "You stupid bugger! You could have run me over!"}, {"viet": "Anh sẽ thấy nhiều thay đổi trong làng từ năm ngoái đến nay.", "eng": "You will see many changes in the village since last year."}, {"viet": "Máy của anh kêu hơi chói tai-anh nên đưa đi kiểm tra thì hơn.", "eng": "Your engine sounds a bit rough-you'd better have it checked."}, {"viet": "Tài năng của anh đã bị sử dụng sai-hãy học âm nhạc chứ không phải toán!", "eng": "Your talents are misdirected-study music, not maths!"}]