[{"viet": "Một nhân viên khuân vác hành lý sẽ đưa ông đến phòng.", "eng": "A bellman will show you to your room."}, {"viet": "Một thay đổi trong luật pháp sẽ lợi ích cho mọi người.", "eng": "A change in the law would be to everyone's benefit."}, {"viet": "Một kiến trúc phức tạp bằng gỗ và kính.", "eng": "A complex construction of wood and glass."}, {"viet": "Một cửa hàng hấp dẫn bán quần áo thời trang trẻ con.", "eng": "A cutesy boutique for children's fashions."}, {"viet": "Một tờ giấy chứng thực khai sinh của ai.", "eng": "A document certifying somebody's birth."}, {"viet": "Một số người sống sót được kéo ra khỏi đống đổ nát.", "eng": "A few survivors were pulled from the wreckage."}, {"viet": "Một người bạn biết sự quan tâm của Darwin về thiên nhiên đã mời ông du hành trên con tàu Beagle.", "eng": "A friend who knew about Darwin's interested in nature invited him take the trip on the Beagle."}, {"viet": "Một chính phủ trong khi thi hành các chính sách quân phiệt đã khiến cho việc giết người hàng loạt phải trở thành chuyện thường xuyên.", "eng": "A government that routinized mass murder while carrying out its militaristic policies."}, {"viet": "Một con quái vật khủng khiếp đã tấn công dân làng cô thế.", "eng": "A hideous monster attacked the helpless villagers."}, {"viet": "Một vụ liên doanh giữa các hãng phim để sản xuất các bộ phim truyền hình.", "eng": "A joint venture between the film companies to produce TV shows."}, {"viet": "Một thứ nước chanh giải khát uống vào một ngày nóng nực.", "eng": "A lemon refresher imbibed on a hot day."}, {"viet": "Một tiếng động lớn làm mình không còn chú ý thành ra mọi thứ cháy cả.", "eng": "A loud noise diverted my attention and everything was burnt."}, {"viet": "Một giải thích cơ học về nguồn gốc sự sống.", "eng": "A mechanistic explanation of the origin of life."}, {"viet": "Một con đường nhỏ tách ra từ con đường chính.", "eng": "A narrow lane off the main road."}, {"viet": "Đã bắt đầu có một số vụ khởi tố người đàn ông đó nhưng hắn vẫn cứ thoát.", "eng": "A number of prosecutions have been started against this man but he always gets off."}, {"viet": "Một người chính trực về mặt đạo đức.", "eng": "A person of stern moral rectitude."}, {"viet": "Một chính trị gia phải biết cách truyền đạt tư tưởng rõ ràng.", "eng": "A politician must be able to communicate."}, {"viet": "Một người cha tự hào đắm mình trong hào quang chiến thắng của đứa con trai của ông ta.", "eng": "A proud father basking in his son's reflected glory."}, {"viet": "Một nhà hàng với một thực đơn quảng cáo theo kiểu Pháp.", "eng": "A restaurant with a pretentious frenchified menu."}, {"viet": "Một kế hoạch sản xuất giấy từ rơm.", "eng": "A scheme for manufacturing paper from straw."}, {"viet": "Một trích đoạn ngắn từ bản sonat dương cầm.", "eng": "A short extract from a piano sonata."}, {"viet": "Một điểm yếu trong những lời biện hộ của anh ta.", "eng": "A soft spot of his defences."}, {"viet": "Việc ngừng để lấy hơi là cần thiết khi phát âm một số phụ âm.", "eng": "A stoppage of air is necessary to make certain consonant sounds."}, {"viet": "Một cô thiếu nữ có đôi chân dài mặc váy đầm ngắn.", "eng": "A tall leggy girl in a short dress."}, {"viet": "Một người lang thang ăn mặc rách rưới.", "eng": "A tramp in shabby old clothes."}, {"viet": "Một lệnh bắt giữ hắn đã được đưa ra.", "eng": "A warrant is out for his arrest."}, {"viet": "Một nhà cai trị trẻ tuổi chịu ảnh hưởng của bộ trưởng chính yếu của anh ta.", "eng": "A young ruler under the influence of his chief minister."}, {"viet": "Thật ra, món ăn Tứ Xuyên không phải lúc nào cũng cay.", "eng": "Actually, sichuan food is not always hot."}, {"viet": "Sau khi được nuôi nấng rất đàng hoàng cậu ta đã chọn sống một cuộc sống lãng tử của một nghệ sĩ.", "eng": "After a very proper upbringing he chose to lead the Bohemian life of an artist."}, {"viet": "Sau một trong những trận ở châu á, Caesar gửi về La Mã một thông điệp nổi tiếng.", "eng": "After one of his battles in Asia, Caesar sent back a famous message to Rome."}, {"viet": "Sau khi tôi rửa xe xong, bây giờ trông nó bóng loáng.", "eng": "After washing my car, it now looks shiny."}, {"viet": "Tất cả nhận xét của ông ta thì ngắn gọn và đi vào vấn đề.", "eng": "All his observations were short and to the point."}, {"viet": "Tất cả các ngọn đèn nhấp nháy trong giây lát.", "eng": "All the lights flickered for a moment."}, {"viet": "Mặc dù bà ấy đã ở đó mười năm, dân làng vẫn đối xử với bà như thể người ngoài.", "eng": "Although she's lived there for ten years, the villagers still treat her as an outsider."}, {"viet": "Một cô đào phải biết rõ lúc nào vào, lúc nào ra.", "eng": "An actress must learn her entrances and exits."}, {"viet": "Một bài toán nhỏ lắt léo khó giải.", "eng": "An awkward little tickler to solve."}, {"viet": "Một kế hoạch sáng tạo để gây quỹ.", "eng": "An imaginative scheme to raise money."}, {"viet": "Một hệ thống đăng ký vé trực tuyến.", "eng": "An on-line ticket booking system."}, {"viet": "Và tôi khùng đến nỗi tin vào nó!", "eng": "And I was foolish enough to believe him!"}, {"viet": "Một phương án khác là tính năm theo một triều đại của người cai trị.", "eng": "Another plan was to number the years in a ruler's reign."}, {"viet": "Về những điều anh vừa nói.", "eng": "Apropos of what you were just saying."}, {"viet": "Bạn có gần gũi với ông bà của bạn không?", "eng": "Are you close to your grandparents?"}, {"viet": "Bạn có chắc là bạn đã cất những cái đĩa thừa vào chạn không?", "eng": "Are you sure you put the extra plates in the pantry?"}, {"viet": "Với tư cách là một nhà văn tôi xếp ông ta ngang hàng với Joyce.", "eng": "As a writer I'd put him on a par with Joyce."}, {"viet": "Khi chương trình kết thúc, cuộc chuyện trò của họ nhỏ dần.", "eng": "As the programme ended, their conversation was faded out."}, {"viet": "Ban đầu mọi việc tiến hành trôi chảy, nhưng sau đó chúng tôi gặp rắc rối.", "eng": "At first things went well, but later on we ran into trouble."}, {"viet": "Những nỗ lực nhằm thống nhất lại đảng Lao động.", "eng": "Attempts to reunite the Labour Party."}, {"viet": "Ông bạn làm ơn mở cửa cho tôi đi nào?", "eng": "Be a good chap and open the door for me, would you?"}, {"viet": "Im đi! Chúng tôi không muốn nghe lời tục tĩu đó nữa!", "eng": "Be quiet! We don't want to hear that kind of dirt!"}, {"viet": "Trước khi anh bắt đầu chú tâm vào công việc, tôi có thể hỏi anh một câu được không?", "eng": "Before you settle down to work, can I ask you a question?"}, {"viet": "Loài chim có bản năng tập bay.", "eng": "Birds have the instinct to learn to fly."}, {"viet": "Phá kỷ lục 100m của thế giới.", "eng": "Break the World 100 metres record."}, {"viet": "Bọn trộm rình rập quanh khu đất của ngôi nhà ấy.", "eng": "Burglars prowling around in the grounds of the house."}, {"viet": "Nhưng giữ im lặng và không nói chuyện với người ngồi bên cạnh bạn thì không phải là điều lịch sự.", "eng": "But it's not polite to keep silent and not to talk to the person next to you."}, {"viet": "Mua một bó hoa tại quán hàng hoa.", "eng": "Buy a bouquet at the florist's."}, {"viet": "Bằng hành động của mình, họ đã ủng hộ nền dân chủ.", "eng": "By their action, they struck a blow for democracy."}, {"viet": "Tôi có thể gọi điện trực tiếp đến Nhật trên điện thoại này không?", "eng": "Can I make a direct-dial call to Japan on this telephone?"}, {"viet": "Anh tìm cho tôi một khách sạn được không?", "eng": "Can you find me a hotel?"}, {"viet": "Cô có thể cử người đến sửa nó được không?", "eng": "Can you send someone to repair it?"}, {"viet": "Săn sóc những người bệnh và những người già.", "eng": "Caring for the sick and the aged."}, {"viet": "Hóa học là môn ưa thích của cô ấy ở trường.", "eng": "Chemistry was her favourite subject at school."}, {"viet": "Các mục tiêu dân sự đã bị đánh bom để trả đũa cho một vụ đột kích đó.", "eng": "Civilian targets were bombed in reprisal for the raid."}, {"viet": "Thôi nào, cục cưng của mẹ, chúng ta cùng về nhà.", "eng": "Come my dearest, let's go home."}, {"viet": "Công-fét-ti phủ sàn nhà mỗi năm vào ngày 1 tháng Giêng.", "eng": "Confetti covers the floor every year on January 1."}, {"viet": "Một lát nữa tôi gọi lại cho ông nhé?", "eng": "Could I call you back in a few minutes?"}, {"viet": "Xin cô vui lòng cử người đến lấy quần áo cần giặt ủi của tôi?", "eng": "Could you send someone up for my laundry, please?"}, {"viet": "Tỷ giá hối đoái luôn luôn có thể bị thay đổi.", "eng": "Currency exchange rates are always subject to variation."}, {"viet": "Trang trí một bức tường bằng các hoa in.", "eng": "Decorate a wall with flower stencils."}, {"viet": "Mặc dầu được cha mẹ thúc giục mấy lần thằng bé vẫn không chịu xin lỗi.", "eng": "Despite several promptings from his parents the boy refused to apologize."}, {"viet": "Anh có phải nộp phạt hay không?", "eng": "Did you have to pay a fine?"}, {"viet": "Việc thảo luận tất cả các chi tiết này sẽ không đưa chúng ta tới đâu cả; chúng ta phải trở lại các nguyên tắc đầu tiên.", "eng": "Discussing all these details will get us nowhere; we must get back to first principle."}, {"viet": "Làm điều gì hoàn toàn do sự tinh nghịch.", "eng": "Do something out of pure mischief."}, {"viet": "Bạn có bao giờ đọc sách khoa học không?", "eng": "Do you ever read scientific books?"}, {"viet": "Cô có trà xanh Trung Quốc không?", "eng": "Do you have Chinese green tea?"}, {"viet": "Bạn có thích chơi thể thao không?", "eng": "Do you like to play sports?"}, {"viet": "Anh coi tôi là thằng ngốc hay sao?", "eng": "Do you take me for a fool?"}, {"viet": "Bạn có muốn sống ở New York không?", "eng": "Do you want to live in New York?"}, {"viet": "Đồng hồ của bạn chạy có đúng không?", "eng": "Does your watch keep good time?"}, {"viet": "Đừng có làm tôi mất tập trung-tôi đang học mà!", "eng": "Don't distract my attention-I'm trying to study!"}, {"viet": "Đừng để cho sự cố đó làm cho anh thất vọng!", "eng": "Don't let the incident get you upset!"}, {"viet": "Đừng chửi thề trước mặt trẻ con.", "eng": "Don't swear in front of the children."}, {"viet": "Anh không muốn đi cùng chúng tôi hay sao?", "eng": "Don't you want to come with us?"}, {"viet": "Trong lúc khủng hoảng, hiến pháp tạm thời ngưng áp dụng.", "eng": "During the crisis, the constitution was suspended."}, {"viet": "Bài tiết chất thải ra khỏi cơ thể.", "eng": "Eliminate waste matter from the body."}, {"viet": "Ngay cả một nhà leo núi kinh nghiệm cũng có thể gặp khó khăn.", "eng": "Even an experienced climber can get into trouble."}, {"viet": "Mọi thứ đều mờ ảo khi tôi tháo kính ra.", "eng": "Everything is a blur when I take my glasses off."}, {"viet": "Sự sử dụng năng lượng cho một dự án.", "eng": "Expenditure of energy on a project."}, {"viet": "Các nông dân đã đưa những vùng đất khô cằn của Úc vào canh tác.", "eng": "Farmers subdued the arid lands of Australia."}, {"viet": "Hồ sơ nằm rải rác lung tung trong văn phòng.", "eng": "Files were scattered all higgledy-piggledy about the office."}, {"viet": "Năm dòng tính từ đầu trang.", "eng": "Five lines from the top of the page."}, {"viet": "Là một phụ nữ bé nhỏ mà bà ta có sức mạnh đáng ngạc nhiên.", "eng": "For a small woman she has surprising strength."}, {"viet": "Thành lập một phong trào cổ động cho nữ quyền.", "eng": "Founding a movement to promote women's rights."}, {"viet": "Thu nhận các thành viên mới từ số lao động trẻ thất nghiệp.", "eng": "Gain new recruits from among the young unemployed."}, {"viet": "Làm một đơn thỉnh nguyện về việc gì.", "eng": "Get up a petition about something."}, {"viet": "Phủ một lớp véc-ni lên các kệ.", "eng": "Give the shelves a coat of varnish."}, {"viet": "Đánh cờ giỏi mà chơi bài brít cũng không phải là tay mơ.", "eng": "Good at chess and no slouch at bridge, either."}, {"viet": "Có phải họ đã đi trước khi cậu tới đó phải không?", "eng": "Had they left before you got there?"}, {"viet": "Có lý do đầy đủ để làm việc gì.", "eng": "Have sufficient reason for doing something."}, {"viet": "Bạn có bao giờ phát biểu trước hơn 100 người chưa?", "eng": "Have you ever made a speech in front of more than 100 people?"}, {"viet": "Anh đã đọc quyển sách nói về Trung Quốc đó chưa?", "eng": "Have you read that book about China?"}, {"viet": "Anh ta là một người hơi khoác lác, hèn nhát, ngốc nghếch, tẻ nhạt, v. v.", "eng": "He's a bit of a bully, coward, fool, bore, etc."}, {"viet": "Từ sau cái chết của vợ, ông ta ngày càng sống thu mình lại.", "eng": "He's become increasingly withdrawn since his wife's death."}, {"viet": "Nó đã mắc phải chuyện rắc rối ở mức trầm trọng.", "eng": "He's got himself into trouble in a big way."}, {"viet": "Anh ấy có kế hoạch học lấy bằng thạc sĩ văn học Anh.", "eng": "He's planning on doing a master's in English literature."}, {"viet": "Anh ta quen biết nhiều người có thế lực trong giới chính trị.", "eng": "He's well connected in political circles."}, {"viet": "Ông ta lập luận rằng một trong những căn nguyên của tội ác là sự nghèo khó.", "eng": "He argues that one of the root causes of crime is poverty."}, {"viet": "Hắn tát vào mặt thằng bé xấc xược.", "eng": "He boxed the boy's ears for being cheeky."}, {"viet": "Ông ta đã hoàn thành tốt bài diễn văn mặc dầu rất hồi hộp.", "eng": "He carried the speech off well despite feeling very nervous."}, {"viet": "Anh ta cóc cần biết mình sẽ thi đỗ hay trượt.", "eng": "He couldn't give a damn whether he passes the exam or not."}, {"viet": "Ông ấy đã không ngủ được nhiều.", "eng": "He didn't get much sleep."}, {"viet": "Nó răm rắp tuân theo chỉ thị của cấp chỉ huy.", "eng": "He dutifully followed his commander's instructions."}, {"viet": "Anh ta cảm thấy một cái vỗ nhẹ vào vai.", "eng": "He felt a tap on his shoulder."}, {"viet": "Nó ranh mãnh nhìn cô ta.", "eng": "He gave her a roguish look."}, {"viet": "Ông ta rất bực bội vì cái tính cẩu thả của tôi.", "eng": "He got really annoyed with me about my carelessness."}, {"viet": "Hắn trơ trẽn yêu cầu chủ tăng lương 20 phần trăm.", "eng": "He had the brass to ask his boss for a 20% pay rise."}, {"viet": "Anh ta có chiều hướng phát phì.", "eng": "He has an inclination to be fat."}, {"viet": "Nó có nhiều thứ thích và nhiều thứ không thích đến mức không thể nào làm nó vừa lòng được.", "eng": "He has so many likes and dislikes that it's impossible to please him."}, {"viet": "Anh ta tăng tốc độ để vượt qua chiếc xe tải.", "eng": "He increased his speed to overtake the lorry."}, {"viet": "Anh ấy có khả năng thay đổi tâm trạng bất ngờ.", "eng": "He is liable to abrupt swings in mood."}, {"viet": "Anh ta trẻ và thiếu kinh nghiệm, nhưng xin đừng xem đó là điểm bất lợi cho anh ta.", "eng": "He is young and inexperienced, but please do not count that against him."}, {"viet": "Anh ấy để cô ta tứ cố vô thân ở một đất nước xa lạ không một xu dính túi.", "eng": "He left her high and dry in a strange country without any money."}, {"viet": "Anh ta trông trẻ quá, họ sẽ không để anh ta vào đâu.", "eng": "He looks so young they won't let him in."}, {"viet": "Ông ta gặp nhiều người nổi tiếng trong công việc của ông ta.", "eng": "He meets a lot of famous people in his job."}, {"viet": "Anh ta mở cái hộp, để lộ những vật bên trong ra cho khán giả thấy.", "eng": "He opened the box, disclosing the contents to the audience."}, {"viet": "Ông ta tin chắc rằng sẽ có thuốc chữa được căn bệnh đó vào năm 2000.", "eng": "He postulated that a cure for the disease will have been found by the year 2000."}, {"viet": "Anh ta để bánh mì nướng giòn lên khay ăn sáng.", "eng": "He put the toast on the breakfast tray."}, {"viet": "Anh ta từ chối đóng góp lấy cớ rằng anh không đủ sức cáng đáng.", "eng": "He refused to contribute, on the plea that he couldn't afford it."}, {"viet": "Nó bị thoát vị khi nâng một tủ sách.", "eng": "He ruptured himself lifting a bookcase."}, {"viet": "Ông ta có quan hệ tình dục với một học sinh của mình.", "eng": "He's been bonking one of his students."}, {"viet": "Ông ấy vừa mới đi nghỉ phép.", "eng": "He's just gone on leave."}, {"viet": "Anh ấy là người cao nhất nhà.", "eng": "He's the giant of the family."}, {"viet": "Anh ta nhìn thấy cô ấy khi cô ấy bước xuống xe buýt.", "eng": "He saw her as she was getting off the bus."}, {"viet": "Nó ẩn náu nhờ ảnh hưởng của cha nó.", "eng": "He shelters himself under his father's influence."}, {"viet": "Ông ta bật ngón tay tách tách để gọi người hầu bàn.", "eng": "He snapped his fingers to attract the waiter."}, {"viet": "Anh ta đã bắt đầu một cách nhiệt tình nhưng vào một giai đoạn nào đó nỗi buồn chán đã len vào.", "eng": "He started off enthusiastically but at some point along the line boredom set in."}, {"viet": "Anh ta kiện cảnh sát bắt trái phép.", "eng": "He sued the police for wrongful arrest."}, {"viet": "Anh ta cứ hình dung thành phố New York như là hang ổ của tội lỗi.", "eng": "He thought of New York as a den of iniquity."}, {"viet": "Anh ta ném quyển sách xuống bàn.", "eng": "He tossed the book down on the table."}, {"viet": "Ông ta đã tính cho tôi rẻ cuốn sách đó rẻ được 1 bảng Anh.", "eng": "He undercharged me for the book by £ 1."}, {"viet": "Anh ấy muốn biết mọi điều về thức ăn đấy.", "eng": "He wants to know all about food."}, {"viet": "Ông ta đã bị một đám côn đồ đánh đập tàn bạo.", "eng": "He was badly beaten up by a gang of thugs."}, {"viet": "Ông ấy đang mải trò chuyện với người kế toán của mình.", "eng": "He was deep in conversation with his accountant."}, {"viet": "Hắn đã được huỷ án sau khi chứng cứ mới đã minh chứng sự vô tội của hắn.", "eng": "He was granted a pardon after new evidence had proved his innocence."}, {"viet": "Hắn chưa bao giờ được bạn bè cùng lớp tán thưởng.", "eng": "He was never really accepted by his classmates."}, {"viet": "Người ta đã bắt nó đưa về đồn cảnh sát vì say rượu và gây mất trật tự.", "eng": "He was run in for drunk and disorderly behaviour."}, {"viet": "Ông ta là người khởi xướng việc nổi loạn chống lại chính phủ.", "eng": "He was the prime mover in the revolt against the government."}, {"viet": "Nó cân viên đá bằng tay.", "eng": "He weighed the stone in his hand."}, {"viet": "Nó tỉnh dậy thấy có một mình mình ở nhà.", "eng": "He woke up to find himself alone in the house."}, {"viet": "Đi về phía nam, trở về trại, xa khỏi thị trấn, về nhà, v. v.", "eng": "Head south, back to camp, away from the town, towards home, etc."}, {"viet": "Những ý nghĩ tiên tiến của cô ta đã làm cho cô ta trở thành kẻ đảo thiên nghịch địa trong giới nghệ thuật.", "eng": "Her advanced ideas have made her the enfant terrible of the art world."}, {"viet": "Tính tình vui vẻ và tiếng cười sôi nổi của cô ta làm cho cả lớp vui lây.", "eng": "Her cheerful spirits and bubbling laughter infected the whole class."}, {"viet": "Sự khuyến khích của cô ấy đã làm tôi quyết tâm tiếp tục công việc.", "eng": "Her encouragement determined me to carry on with the work."}, {"viet": "Tóc nàng xõa xuống bờ vai.", "eng": "Her hair flopped about over her shoulders."}, {"viet": "Công việc của chị ấy bao gồm nhiều thứ làm chị luôn luôn bận.", "eng": "Her job was responsible, which kept her fully occupied."}, {"viet": "Tên cô ta bị xóa bỏ khỏi danh sách.", "eng": "Her name was expunged from the list."}, {"viet": "Sự hiện diện của cô ta đã mang lại một vẻ thanh lịch cho buổi lễ.", "eng": "Her presence imparted an air of elegance to the ceremony."}, {"viet": "Thái độ thích giao tiếp của cô ấy thức ra để che giấu một bản tính rất e thẹn của mình.", "eng": "Her sociable manner is really a mask for a very shy nature."}, {"viet": "Nàng hạ giọng khi họ bước vào phòng.", "eng": "Her voice fell as they entered the room."}, {"viet": "Của ông đây, năm bộ tiền và số dư.", "eng": "Here you are, the five sets and the balance."}, {"viet": "Lập luận của anh ta dựa trên một nền tảng hiểu biết sâu sắc.", "eng": "His argument rests on a sound understructure of knowledge."}, {"viet": "Kết quả tính của anh ấy đúng nhưng của cô ấy thì sai.", "eng": "His calculation was correct but hers was wrong."}, {"viet": "Cái chết của ông ta được mọi người thương tiếc.", "eng": "His death was regretted by all."}, {"viet": "Nét mặt của anh ta biến dạng vì giận dữ.", "eng": "His face was deformed out of anger."}, {"viet": "Tóc anh ấy đang bắt đầu hói ở phía trước.", "eng": "His hair is beginning to recede from his forehead."}, {"viet": "Đầu gối anh ta đau nhói vì vết trầy.", "eng": "His knee stung from the graze."}, {"viet": "Mẹ hắn luôn luôn bênh vực hắn.", "eng": "His mother always takes his part."}, {"viet": "Những kẻ hành hạ anh ta đã bị trừng phạt nghiêm khắc.", "eng": "His persecutors were severely punished."}, {"viet": "Việc nghiên cứu của ông ta làm nền tảng cho quyển sách mới của ông ta.", "eng": "His research formed the basis of his new book."}, {"viet": "Những nhận xét kỳ lạ của anh ta đã gieo những hồ nghi trong đầu chúng tôi về óc sáng suốt của anh ta.", "eng": "His strange remarks planted doubts in our minds about his sanity."}, {"viet": "Giọng nói của ông ta chứa đầy uy quyền.", "eng": "His voice carries the song of authority."}, {"viet": "Ôm chặt ai vào lòng mình.", "eng": "Hold somebody to one's breast."}, {"viet": "Giá nhà ở khu vực này tụt xuống nhanh.", "eng": "House prices have plummeted in this area."}, {"viet": "Sao mà bạn lại có thể chịu đọc các văn hóa phẩm tầm thường như thế được?", "eng": "How can you bear to read such pap?"}, {"viet": "Làm thế nào chúng tôi biết được viên kim cương này là thật?", "eng": "How do we know that the diamond is real?"}, {"viet": "Một con lạc đà có thể đi mà không ăn trong bao lâu tùy thuộc vào tốc độ sử dụng thức ăn tích trữ của nó.", "eng": "How long a camel can go without eating depends on how quickly it uses up is stored food."}, {"viet": "Mỗi ngày bạn uống bao nhiêu tách cà phê?", "eng": "How many cups of coffee do you drink every day?"}, {"viet": "Anh đã cho bao nhiêu ớt khô vào món cari?", "eng": "How much chilli did you put in the curry?"}, {"viet": "Cô ta bao nhiêu tuổi?''Đoán chừng khoảng 30.'.", "eng": "How old is she?''At a guess, about 30'."}, {"viet": "Xua đuổi mèo hàng xóm ra khỏi vườn.", "eng": "Hunt the neighbour's cats out of the garden."}, {"viet": "Tôi muốn xem kỹ lại rồi sẽ tính.", "eng": "I'd like to look them over and see what we can do."}, {"viet": "Tôi sẽ hỏi lại bộ phận bảo trì.", "eng": "I'll check with the Maintenance Department."}, {"viet": "Tôi sẽ buông đường viền của chiếc áo dài đó xuống cho chú.", "eng": "I'll let down the hem of that dress for you."}, {"viet": "Tôi là một người lái xe rất tệ, nhưng giám khảo đã chấm cho tôi đỗ.", "eng": "I'm a hopeless driver, but the examiner let me through."}, {"viet": "Tôi rất vui mừng nghe tin anh thành công.", "eng": "I'm delighted to hear of your success."}, {"viet": "Tôi sắp đến ở thăm dì tôi một vài ngày.", "eng": "I'm going to visit my aunt for a few days."}, {"viet": "Tôi sẽ không nói cho bạn biết chuyện đó, nó là chuyện riêng tư.", "eng": "I'm not going to tell you about it, it's private."}, {"viet": "Tôi rất tiếc, nhưng mặt hàng mà ông yêu cầu thì lúc này đang hết hàng.", "eng": "I'm sorry, but the item you required is out of stock right now."}, {"viet": "Chốc nữa tôi sẽ đưa bọn trẻ đi bơi.", "eng": "I'm taking the children for a swim later."}, {"viet": "Tôi cứ luôn muốn nói rằng bạn đẹp.", "eng": "I've always wanted to say you're beautiful."}, {"viet": "Tôi có đủ sữa để pha cà phê-nhưng chỉ vừa đủ thôi.", "eng": "I've enough milk for the coffee-but only just."}, {"viet": "Tôi quen cô ấy đã nhiều năm nhưng chưa bao giờ cô ấy là bạn.", "eng": "I've known her for years, but she was never a friend."}, {"viet": "Tôi đã nói với bà là đừng đụng đến đồ đạc của tôi.", "eng": "I've told you to leave my things alone."}, {"viet": "Tôi luôn luôn mang theo đèn pin đi khắp nơi.", "eng": "I always keep a flashlight around."}, {"viet": "Tôi bối rối không hiểu tại sao cậu ta không trả lời thư của tôi.", "eng": "I am puzzled by his failure that he hasn't replied to my letter."}, {"viet": "Tôi cam đoan với ông là sự việc như vậy sẽ không xảy ra lần nữa.", "eng": "I assure you such a thing won't happen again."}, {"viet": "Tôi coi thái độ của hắn là bần tiện và ích kỷ.", "eng": "I call his behaviour mean and selfish."}, {"viet": "Tôi không thể giúp anh được nữa, cô ấy nói một cách mệt mỏi.", "eng": "I can't help you anymore, she said wearily."}, {"viet": "Tôi có cam đoan với anh là cảm giác này sẽ chóng qua đi.", "eng": "I can assure you that this feeling will soon pass."}, {"viet": "Tôi không nỡ lòng nào kết tội một người mẹ ăn cắp chỉ vì một đứa con bị đói.", "eng": "I cannot find it in myself to condemn a mother who steals for a hungry child."}, {"viet": "Sáng sáng, tôi kiểm tra khay công văn đến như một thông lệ.", "eng": "I check my in-tray every morning as a matter of course."}, {"viet": "Tôi không thể che giấu được sự giận dữ của mình.", "eng": "I couldn't disguise my anger."}, {"viet": "Tôi không dám xin bà ta cho tăng lương.", "eng": "I daren't ask her for a rise."}, {"viet": "Tôi nghĩ họ sẽ không hòa hợp với nhau.", "eng": "I didn't think they would get along."}, {"viet": "Tôi không biết ngân hàng này có thể đổi ngoại tệ hay không.", "eng": "I don't know if this bank can change foreign currencies."}, {"viet": "Tôi không nói về cuộc sống riêng tư của tôi ở nơi cơ quan.", "eng": "I don't talk about my private life at the office."}, {"viet": "Tôi không muốn thúc bách ông phải quyết định, nhưng chúng ta không còn lại nhiều thời gian.", "eng": "I don't want to put pressure on you to make a decision, but we haven't much time left."}, {"viet": "Tôi nghĩ đó không phải là một ý kiến hay.", "eng": "I don't think that is a good idea."}, {"viet": "Tôi cảm thấy như thể tôi đang ở trong xứ sở thần tiên.", "eng": "I feel as if I'm in a wonderland."}, {"viet": "Cuối cùng tôi đã tìm thấy đoạn tham khảo trong một quyển từ điển các câu trích dẫn.", "eng": "I finally tracked down the reference in a dictionary of quotations."}, {"viet": "Tôi kiểm tra kỹ toàn bộ chiếc xe ô tô đó.", "eng": "I gave the car a thorough going-over."}, {"viet": "Tôi nghĩ chúng ta sẽ phải đứng vào hàng ở đằng kia.", "eng": "I guess we'll have to join the line there."}, {"viet": "Tôi đã thi đỗ ba môn và trượt một.", "eng": "I had three passes and one fail."}, {"viet": "Tôi có một đứa em gái nhưng không có anh em trai.", "eng": "I have a sister but no brothers."}, {"viet": "Tôi không có quần áo trang trọng cho dịp này,.", "eng": "I have no formal clothes for the occasion."}, {"viet": "Chiều nay tôi phải trông nom đứa em gái nhỏ của tôi.", "eng": "I have to take care of my little sister this afternoon."}, {"viet": "Ông Smith, tôi nghe nói hôm nay là sinh nhật của ông.", "eng": "I hear it's your birthday today, Mr. Smith."}, {"viet": "Tôi hy vọng là tôi sẽ không bao giờ gặp lại hắn nữa.", "eng": "I hope I never set eyes on him again."}, {"viet": "Tôi ngắt lời hắn khi hắn đang thao thao bất tuyệt.", "eng": "I interrupted him while he was in full flow."}, {"viet": "Tôi biết có nhiều người hơn muốn đến.", "eng": "I know many more people who'd like to come."}, {"viet": "Tôi thích uống trà với một chút xíu sữa.", "eng": "I like my tea with just a drop of milk."}, {"viet": "Tôi sẽ phôn cho rạp và tìm hiểu.", "eng": "I'll call the theater and find out."}, {"viet": "Tôi xem thử bà Strong có ở đó không?", "eng": "I'll see if Mrs. Strong is there?"}, {"viet": "Tôi e rằng chúng tôi không thể đến được.", "eng": "I'm afraid we can't come."}, {"viet": "Tôi đang tìm thuê một căn hộ.", "eng": "I'm hunting for an apartment."}, {"viet": "Tôi rất tiếc, ông ấy không có ở trong phòng.", "eng": "I'm sorry, he's not in."}, {"viet": "Tôi kéo được giá của ông ta xuống từ 500 còn 450 bảng Anh.", "eng": "I managed to knock his price down from £ 500 to £ 450."}, {"viet": "Chắc là tôi đã tắt đồng hồ báo thức rồi ngủ trở lại.", "eng": "I must have turned off the alarm clock and gone back to sleep again."}, {"viet": "Tôi không bao giờ mang theo nhiều tiền.", "eng": "I never carry much money with me."}, {"viet": "Tôi tình cờ nghe anh ta nói là sắp đi Pháp.", "eng": "I overheard him saying he was going to France."}, {"viet": "Tôi rất thích cuốn sách nhưng thấy phần kết hơi nhạt nhẽo.", "eng": "I quite enjoyed the book but found the ending rather tame."}, {"viet": "Tôi muốn nói riêng đến những người thường trú, khác với khách vãng lai.", "eng": "I refer specifically to permanent residents, in contradistinction to temporary visitors."}, {"viet": "Tôi đã thấy mục quảng cáo đó trên báo địa phương buổi chiều.", "eng": "I saw advert in the local evening paper."}, {"viet": "Tôi sẽ hoàn toàn làm theo sự chỉ dẫn của luật sư của tôi.", "eng": "I shall go entirely by what my solicitor says."}, {"viet": "Tôi nhanh chóng biết được phải làm gì.", "eng": "I soon spotted what to do."}, {"viet": "Thề có Thượng đế là tôi sẽ nói sự thật.", "eng": "I swear by almighty God that I will tell the truth."}, {"viet": "Tôi nghĩ có lẽ tôi nên cắt tóc ngắn.", "eng": "I think I should probably cut my hair short."}, {"viet": "Tôi nghĩ chúng ta không được nói sự thật cho tới khi sức khoẻ anh ta khá hơn.", "eng": "I think we ought to keep the truth from him until he's better."}, {"viet": "Tôi đã bảo với anh là sẽ có cơn tam bành nếu anh định trái ý bà ta.", "eng": "I told you there would be fireworks if you attempted to contradict her."}, {"viet": "Tôi hiểu điều ông đang nói.", "eng": "I understand what you are saying."}, {"viet": "Tôi không muốn dây vào cái công việc bẩn thỉu này.", "eng": "I want no part in this sordid business."}, {"viet": "Tôi muốn cám ơn bà đã mời tôi đến dự lễ cưới.", "eng": "I want to thank you for inviting me to the wedding and the reception."}, {"viet": "Sáng nay tôi bị lừa không trả mất 10 bảng.", "eng": "I was done out of E 10 in the shop this morning."}, {"viet": "Tôi suýt nữa thì không giữ được bình tĩnh.", "eng": "I was on the brink of losing my temper."}, {"viet": "Tôi đứng cách cái cửa ba bước.", "eng": "I was three strides from the door."}, {"viet": "Tôi thà chết còn hơn phản bội tổ quốc tôi.", "eng": "I will die before I will betray my country."}, {"viet": "Tôi không thể đi khỏi ( cơ quan ) trước bảy giờ.", "eng": "I won't be able to get away ( from the office ) before 7."}, {"viet": "Tôi làm việc 3 ngày một tuần.", "eng": "I work three days a week."}, {"viet": "Tôi muốn gửi cái này bằng dịch vụ chuyển phát nhanh.", "eng": "I would like to send this by special delivery, please."}, {"viet": "Trượt băng là môn thể thao ưa thích nhất của tôi.", "eng": "Ice-skating is my favourite winter sport."}, {"viet": "Nếu tôi trèo lên cái gác xép đó, anh vui lòng đưa cho tôi những cái hộp đó nhé?", "eng": "If I climb up to that attic, will you hand me those boxes?"}, {"viet": "Nếu cô ta muốn cái gì, cô ta chỉ cần hỏi.", "eng": "If she wants anything, she need only ask."}, {"viet": "Nếu chúng ta không thể đồng ý thì chúng ta hãy biểu quyết về việc đó.", "eng": "If we cannot agree, let's vote on it."}, {"viet": "Nếu anh có đủ khả năng mua được một cái ô tô như thế thì huống hồ một cái xe đạp.", "eng": "If you can afford a car like that, then a fortiori you can afford to pay a bicycle."}, {"viet": "Nếu có bất cứ thứ gì cần giặt, bà vui lòng bỏ vào trong túi đựng quần áo cần giặt ủi ở đằng sau cánh cửa phòng tắm.", "eng": "If you have any, please leave it in the laundry bag behind the bathroom door."}, {"viet": "Nếu anh chạm vào dây đang có điện này anh sẽ bị giật.", "eng": "If you touch this live wire, you'll get a shock."}, {"viet": "Trong'the black cat'tính từ'black'bổ nghĩa cho danh từ'cat'.", "eng": "In'the black cat'the adjective'black'modifies the noun'cat'."}, {"viet": "Vi phạm trực tiếp sự hướng dẫn của tôi.", "eng": "In direct contravention of my instructions."}, {"viet": "Trong nhiều môn thể thao, tình trạng sung sức ( của cơ thể ) không quan trọng bằng kỹ thuật.", "eng": "In many sports ( physical ) fitness is not as important as technique."}, {"viet": "Trong khi vắng mặt thầy giáo, lớp học lâm vào tình trạng hỗn loạn.", "eng": "In the absence of their teacher the class was in a state of anarchy."}, {"viet": "Ở Hoa Kỳ, nó được làm bằng sữa bò và được gọi là phó-mát xanh lam.", "eng": "In the United States it is made from cow's milk and is called blue cheese."}, {"viet": "Nền công nghiệp bị thuế khoá đè nặng.", "eng": "Industry is heavily burdened with taxation."}, {"viet": "Có phải là tất yếu logic là tăng lương sẽ dẫn đến tăng giá không?", "eng": "Is it a logical necessity that higher wages will lead to higher prices?"}, {"viet": "Có một cửa hàng phục vụ 24/24 giờ ở gần nhà bạn không?", "eng": "Is there a convenience store near your home?"}, {"viet": "Chế độ dân chủ phương Tây có phù hợp với Châu Á không?", "eng": "Is Western democracy suited for Asia?"}, {"viet": "Có thị trường cho xe ôtô kiểu cũ.", "eng": "It's a seller's market for vintage cars."}, {"viet": "Thức ăn rất ngon, nhưng tôi không thể nào ăn thêm được nữa.", "eng": "It's delicious, but I just can't eat any more."}, {"viet": "Không thể nào mua vé để xem vở kịch đó.", "eng": "It's impossible to get tickets for that play."}, {"viet": "Uống rượu lúc chưa ăn gì là không tốt.", "eng": "It's not good to drink on an empty stomach."}, {"viet": "Bây giờ là mùa xuân và tôi thấy muốn làm điều gì đó mới mẻ.", "eng": "It's spring and I feel like doing something new."}, {"viet": "Ông thật tử tế đã nói như vậy, và tôi hy vọng chúng ta sẽ gặp nhau thường xuyên hơn.", "eng": "It's very nice of you to say so, and I hope we will see each other more frequently."}, {"viet": "Tôi chịu trách nhiệm thông báo cho bà ta biết về cái chết của con trai bà.", "eng": "It fell to me to inform her of her son's death."}, {"viet": "Trong trường hợp này thật khó có thể liên hệ nhân với quả.", "eng": "It is difficult to relate cause and effect in this case."}, {"viet": "Có thể làm cho vi khuẩn và các sinh vật khác sinh sôi nảy nở trong phòng thí nghiệm.", "eng": "It is possible to multiply bacteria and other living organisms in the laboratory."}, {"viet": "Trời có thể lạnh nhưng không mưa, thế cũng may lắm rồi.", "eng": "It may be cold but it not raining Let's be thankful for small mercies."}, {"viet": "Bạn dặn được vé là hay đấy.", "eng": "It's good you could get them."}, {"viet": "Dường như mọi thứ đều được làm tự động cả.", "eng": "It seems everything is done automatically."}, {"viet": "Nó diễn ra rất tốt đẹp, cảm ơn.", "eng": "It turned out very well, thanks."}, {"viet": "Thật khó có thể tìm ra được sự cân bằng đúng đắn giữa sự công bằng và động cơ cá nhân.", "eng": "It was difficult to strike the right balance between justice and expediency."}, {"viet": "Rút cục phải mấy tuần sau tôi mới trả lời thư cô ấy được.", "eng": "It was several weeks before I eventually came round to answering her letter."}, {"viet": "Phải mất nửa giờ để đến nhà ga, kể cả những sự chậm trễ xe cộ.", "eng": "It will take you half an hour to get to the station, allowing for traffic delays."}, {"viet": "Jane mạnh bạo đi lên bục không nao núng.", "eng": "Jane walked boldly up to the platform without faltering."}, {"viet": "Sự bàn bạc chung giữa công nhân với ban quản trị.", "eng": "Joint consultation between workers and management."}, {"viet": "Hãy tránh cho trẻ những cái có thể gây tai hại nếu anh đưa chúng đến xem cuộc đấu.", "eng": "Keep the children out of harm's way if you take them to the match."}, {"viet": "Hãy vui vẻ đi và bất cần hậu quả.", "eng": "Let's enjoy ourselves and damn the consequences."}, {"viet": "Vậy thì chúng ta hãy nói về văn phòng của cô đi.", "eng": "Let's talk about your office then."}, {"viet": "Nhiều hình thái của sự sống dưới nước tồn tại trong các hồ ao.", "eng": "Many forms of aquatic life inhabit ponds."}, {"viet": "Maria hát và tôi đệm đàn piano.", "eng": "Maria sang and I accompanied her on the piano."}, {"viet": "Xin cho tôi một cái nĩa khác nhé?", "eng": "May I have another fork, please?"}, {"viet": "Có lẽ vậy, nhưng không chỉ là may mắn thôi đâu.", "eng": "Maybe you were, but it wasn't only lucky."}, {"viet": "Hầu hết mọi người đều có mức sống cao ở đất nước này.", "eng": "Most people enjoy a high standard of living in this country."}, {"viet": "Rất lấy làm tiếc là tôi không thể nhận lời mời của ông được.", "eng": "Much to my regret, I am unable to accept your invitation."}, {"viet": "Cuốn nhật ký của tôi là nơi chứa đựng tất cả mọi hy vọng và dự kiến của tôi.", "eng": "My diary is the repository of all my hopes and plans."}, {"viet": "Công việc của tôi nữa giống như nhân viên ngân hàng, nữa giống như người chạy giấy.", "eng": "My job is between a bank clerk and a messenger boy."}, {"viet": "Tôi quen lệ là ngày nào cũng dậy lúc bảy giờ.", "eng": "My rule is to get up at seven every day."}, {"viet": "Tất nhiên giấy chứng nhận có kỳ hạn lâu hơn có lãi suất cao hơn.", "eng": "Naturally, certificates with the longer maturities bear a higher rate of return."}, {"viet": "Nick nói với tôi nó muốn một cái xe máy, anh nhồi nhét cái ý tưởng đó vào đầu nó đấy à?", "eng": "Nick tells me he want a motorbike Have you been putting ideas into his head?"}, {"viet": "Không ai độc ác mà lại không có một chút tình thương.", "eng": "No man is so cruel but he may feel some pity."}, {"viet": "Nay trở thành nhà triệu phú, ông ấy là tiêu biểu cho loại người tự lập.", "eng": "Now a millionaire, he typifies the self-made man."}, {"viet": "Hài lòng với công việc của mình.", "eng": "Obtain satisfaction from one's work."}, {"viet": "Ôi, thôi rồi, máy vi tính của tôi bị treo nữa rồi.", "eng": "Oh no, my computer froze up again."}, {"viet": "Anh ta bị đuổi vì ngủ quên trong khi đáng lý phải làm việc.", "eng": "On the job training, he was fired for sleeping on the job."}, {"viet": "Một trong những nữ diễn viên quên mất lời thoại của mình và phải ứng khẩu.", "eng": "One of the actresses forgot her lines and had to extemporize."}, {"viet": "Ngân hàng chúng tôi mở cửa hàng ngày ngoại trừ chủ nhật.", "eng": "Our bank is open every day except Sunday."}, {"viet": "Văn phòng đầu não của chúng tôi có thể liên hệ anh với một chi nhánh ở khu vực của anh.", "eng": "Our head office can put you in touch with a branch in your area."}, {"viet": "Bữa tối thường lệ của nhà hàng chúng tôi gồm có các món khai vị, xúp, rau trộn, món chính tự chọn, món tráng miệng, cà phê.", "eng": "Our regular includes appetizer, soup, salad, choice of the main course, dessert, coffee."}, {"viet": "Những con cú có thể nhìn được trong bóng tối.", "eng": "Owls can see in the dark."}, {"viet": "Những sự thanh toán bằng séc dễ tăng nhiều hơn những vụ giao dịch bằng tiền mặt.", "eng": "Payments by cheque easily outnumber cash transactions."}, {"viet": "Thực phẩm dễ hỏng cần phải được tiêu thụ càng nhanh càng tốt.", "eng": "Perishables need to be consumed as quickly as possible."}, {"viet": "Đơn vị cảnh sát được tăng cường bằng nam nữ nhân viên mới tuyển.", "eng": "Police units were augmented with newly recruited men and women."}, {"viet": "Run-s có hai hình vị và un-like-ly có ba hình vị.", "eng": "Run-s contains two morphemes and un-like-ly contains three."}, {"viet": "Có nhiều màu vàng khác nhau trong hộp thuốc vẽ.", "eng": "Several different yellows in the paintbox."}, {"viet": "Cô ta là một phóng viên hoàn toàn mới vào nghề.", "eng": "She's a complete novice as a reporter."}, {"viet": "Cô ta kém sức khỏe từ khi sinh đứa con.", "eng": "She's been out of sorts since the birth of her baby."}, {"viet": "Cô ta bị thương ở lưng và đang được chữa trị bằng cách kéo giãn trong một tháng.", "eng": "She's injured her back and is in traction for a month."}, {"viet": "Cô ta đã tới tuổi có thể rời trường.", "eng": "She's reached the age when she can leave school."}, {"viet": "Cô ta sỉ nhục nó thậm tệ vì sự lơ là của nó.", "eng": "She abused him roundly for his neglect."}, {"viet": "Cô ấy có mặt quá muộn làm cho kế hoạch chúng tôi bị đảo lộn.", "eng": "She ballsed up our plans by being so late."}, {"viet": "Cô ta tự cho là chưa bao giờ tìm kiếm sự chú ý của người khác.", "eng": "She claims she never sought the limelight."}, {"viet": "Cô ấy quyết định nhận lời đề nghị vì không còn có gì tốt hơn.", "eng": "She decided to accept the offer for want of anything better."}, {"viet": "Cô ấy tế nhị uống rượu từng hớp nhỏ.", "eng": "She drank her wine with small ladylike sips."}, {"viet": "Cô ta giáng cho hắn một cái tát khủng khiếp vào mặt.", "eng": "She fetched him a terrific slap in the face."}, {"viet": "Cô ta phóng chiếc xe đạp mới như bay.", "eng": "She goes like the wind on her new bicycle."}, {"viet": "Trước đây cô ta đã làm việc ở đài truyền hình.", "eng": "She had previously worked in television."}, {"viet": "Cô ta đã phá kỷ lục 5000 mét ở Đại hội Ôlimpich.", "eng": "She has broken the Olympic 5000 metres record."}, {"viet": "Cô ta giữ kỷ lục thế giới về môn chạy 100 mét.", "eng": "She holds the world record for the 100 metres."}, {"viet": "Bà ta chỉ là chủ tịch trên danh nghĩa, công việc thực sự lại do một người khác làm.", "eng": "She is only the nominal chairman, the real work is done by somebody else."}, {"viet": "Cô ấy biết họ sẽ tự ý đi.", "eng": "She knew they would leave of their own accord."}, {"viet": "Cô ta nhìn qua khe hở của bức rèm.", "eng": "She looked through a crack in the curtains."}, {"viet": "Cô ta lẩm bẩm là chưa muốn dậy.", "eng": "She mumbled that she didn't want to get up yet."}, {"viet": "Cô ấy tưởng tượng mình là một nữ hoàng xinh đẹp.", "eng": "She pictured herself as a beautiful queen."}, {"viet": "Cô ấy thực hiện được hoài bão của mình trở thành một người lái xe đua.", "eng": "She realised her ambition to become a racing driver."}, {"viet": "Lúc nào cô ta cũng lải nhải về những lỗi lầm của tôi.", "eng": "She's always harping on my faults."}, {"viet": "Cô ta đang theo học về khoa chính trị học ở trường đại học.", "eng": "She's reading politics at university."}, {"viet": "Cô ấy đạt được một chiến thắng vang dội trước đối thủ của mình.", "eng": "She scored a resounding triumph over her rival."}, {"viet": "Cô ta mỉm cười tỏ ý tán thành.", "eng": "She signified her approval with a smile."}, {"viet": "Nàng đã xâm chiếm trái tim tôi và tôi đau khổ.", "eng": "She stole my heart and I'm all shook up."}, {"viet": "Cô ấy nghĩ đã đến lúc chúng ta phế bỏ nền quân chủ.", "eng": "She thinks it's time we did away with the monarchy."}, {"viet": "Cô ta xoay xoay nút vặn trên radio để xem sẽ nghe đài nào.", "eng": "She twiddled the dial on the radio to see what stations she could pick up."}, {"viet": "Cô ta có thể tin chắc rằng không có thứ gì bị rút ra khỏi ví cô ta cả.", "eng": "She was able to assure herself that nothing had been taken from her purse."}, {"viet": "Bà ta khổ sở vì thằng con trai vô dụng ăn không ngồi rồi của bà.", "eng": "She was cursed with an idle and worthless son."}, {"viet": "Bà ta mặc đồ tang trong một tháng.", "eng": "She was in mourning for a month."}, {"viet": "Chị ấy nhanh chóng nhận ra những chỗ có ý nghĩa nước đôi trong bài báo.", "eng": "She was quick to notice the ambiguities in the article."}, {"viet": "Cô ấy chán việc nấu nướng cho cả gia đình.", "eng": "She was tired of cooking for her family."}, {"viet": "Nàng đi vào phòng rồi đóng cửa lại.", "eng": "She went into her room and shut the door behind her."}, {"viet": "Cô ta sẽ không cho phép các học sinh đến muộn.", "eng": "She won't have boys arriving late."}, {"viet": "Tàu ra khơi trong lúc có bão này thì thật nguy hiểm.", "eng": "Ships out in this storm are in great danger."}, {"viet": "Ra dấu cho người nào biết rằng đã đến giờ đi.", "eng": "Sign to somebody that it is time to go."}, {"viet": "Các hài kịch về tình huống, các chương trình đố vui và các chương trình tầm thường khác.", "eng": "Situation comedies, game shows and other garden-variety television programs."}, {"viet": "Các áo khoác ngoài trước kia thường được công nhân nông trại mặc.", "eng": "Smocks were formerly worn by farm-workers."}, {"viet": "Vì vậy nghĩa của Renbimbi là'tiền tệ của nhân dân'.", "eng": "So the meaning of'Renminbi'means people's currency'."}, {"viet": "Một số tấm thảm có một lớp cao su mút dày gắn phía dưới.", "eng": "Some carpets have a foam rubber underplay attached to them."}, {"viet": "Vài người già có những sở thích kỳ quặc.", "eng": "Some old folks have peculiar tastes."}, {"viet": "Một số nhà văn là bậc thầy của hình thức nhưng nội dung những cuốn sách của họ không hay.", "eng": "Some writers are masters of form, but the content of their books isn't interesting."}, {"viet": "Xin lỗi bà, chúng tôi đóng cửa để ăn trưa.", "eng": "Sorry, madam, we're closing up for lunch."}, {"viet": "Kéo dài thời gian thanh toán ra trong ba tháng.", "eng": "Spread the payments over three months."}, {"viet": "Steven, ở Hồng kong có nhà hàng pháp không?", "eng": "Steven, are there French restaurants in Hong Kong?"}, {"viet": "Những câu chuyện được lưu truyền từ thế hệ này qua thế hệ khác.", "eng": "Stories handed down from generation to generation."}, {"viet": "Một sa mạc khô cằn như vậy chỉ có thể nuôi sống được rất ít sinh vật.", "eng": "Such a barren desert can support very few creatures."}, {"viet": "Mời học sinh tập trung ở hội trường.", "eng": "Summon the pupils together in the school hall."}, {"viet": "Quét bồ hóng ra khỏi ống khói.", "eng": "Sweep the soot out of the chimney."}, {"viet": "Bắt đầu quen đi dạo một mình.", "eng": "Take to going on solitary walks."}, {"viet": "Hãy nói với cô ấy là con đang nằm viện.", "eng": "Tell her I'm in the hospital."}, {"viet": "Cám ơn ông rất nhiều vì đã mời tôi đến ăn tối tại nhà ông chủ nhật tới, ông Jones ạ.", "eng": "Thank you very much for inviting me to dinner at your home next Sunday, Mr. Jones."}, {"viet": "Đồng hồ báo thức đó chắc là chạy nhanh.", "eng": "That alarm clock must be fast."}, {"viet": "Điều đó nghe có vẻ thật.", "eng": "That has the ring of truth about it."}, {"viet": "Chiếc xe Fiat mới đó là một chiếc xe xinh xắn chạy lẹ số một.", "eng": "That new Fiat is a fast little number."}, {"viet": "Đó chính là điều tôi muốn biết.", "eng": "That's what I want to know about."}, {"viet": "Anh sẽ phải trả tất cả 7, 50 pao.", "eng": "That will cost you 7.50 pounds in total."}, {"viet": "Sổ sách kế toán cho thấy tiền lãi 9.000 bảng Anh.", "eng": "The accounts show a profit of £ 9,000."}, {"viet": "Máy điều hoà nhiệt độ chạy không tốt.", "eng": "The air-conditioner is not working well."}, {"viet": "Bản thông báo chữ nghĩa tối.", "eng": "The announcement was ambiguously worded."}, {"viet": "Quân đội đã vấp phải sự chống cự kịch liệt ở mọi thành phố.", "eng": "The army came up against fierce opposition in every town."}, {"viet": "Mưu toan đút lót nhân viên đó đã bị thất bại.", "eng": "The attempt to bride that clerk had failed."}, {"viet": "Đứa bé thích thú ngồi vọc vẫy nước trong lúc tắm.", "eng": "The baby happily splashing about in the bath."}, {"viet": "Ngân hàng không trả được nợ và sẽ không thể làm được nghĩa vụ của mình.", "eng": "The bank is insolvent and will be unable to live up to its obligations."}, {"viet": "Đậu năm nay được mùa lớn.", "eng": "The beans cropped well this year."}, {"viet": "Con chim nghểnh đầu về một phía.", "eng": "The bird cocked its head to one side."}, {"viet": "Chiếc thuyền trông có lẽ khá hơn với một lớp sơn.", "eng": "The boat would look better with a lick of paint."}, {"viet": "Sách trong thư viện được theo môn.", "eng": "The books in the library are classified according to subject."}, {"viet": "Các cậu bé đi thám hiểm ở một vài khu mỏ bỏ hoang.", "eng": "The boys went exploring in some disused workings."}, {"viet": "Tòa nhà đó có nền móng vững chắc.", "eng": "The building has a strong understructure."}, {"viet": "Công việc của ủy ban bị đình trệ do các khó khăn về thủ tục.", "eng": "The business of the committee was delayed by procedural difficulties."}, {"viet": "Chiếc xe ôtô tiêu thụ nhiều nhiên liệu.", "eng": "The car consumes a lot of fuel."}, {"viet": "Vẻ mặt lo âu của bà mẹ phải nuôi những đứa con đói.", "eng": "The careworn face of a mother with hungry children to feed."}, {"viet": "Tất nhiên xi măng là chất lỏng.", "eng": "The cement is liquid, of course."}, {"viet": "Những người lừa đảo và ăn hối lộ ở phố Uôn và Oasinhtơn.", "eng": "The cheats and grafters in Wall street and Washington."}, {"viet": "Đứa trẻ dường như khoẻ mạnh nhưng bác sĩ có vẻ quan tâm.", "eng": "The child seems healthy, but the doctor is concerned."}, {"viet": "Bọn trẻ rất khoái đùa chơi dưới nước.", "eng": "The children enjoyed themselves playing in the water."}, {"viet": "Cuối cùng tất cả các đứa trẻ cũng bị lôi ra khỏi nơi ẩn nấp của chúng.", "eng": "The children were finally all winkled out of their hiding places."}, {"viet": "Dân thành phố đổ ra đường chào mừng đội chiến thắng của mình trở về.", "eng": "The city turned out to welcome back its victorious team."}, {"viet": "Thoạt đầu câu lạc bộ này chỉ có sáu hội viên.", "eng": "The club had only six members to start with."}, {"viet": "Con ngựa non quay ngang trước hàng rào và không chịu nhảy qua.", "eng": "The colt shied at the fence and refused to jump over it."}, {"viet": "Công ty đã sa sút vì nhu cầu hàng hoá giảm.", "eng": "The company has gone into a decline because of falling demand."}, {"viet": "Buổi hoà nhạc sẽ trình diễn ở đại sảnh nhà trường.", "eng": "The concert will be in the school hall."}, {"viet": "Sự hiểu biết thông thường cho rằng tăng lương nhiều sẽ gia tăng lạm phát.", "eng": "The conventional wisdom is that high wage rises increase inflation."}, {"viet": "Ngày mai cả nước đi bầu cử.", "eng": "The country is going to the polls tomorrow."}, {"viet": "Sự gây ra một ấn tượng tốt.", "eng": "The creation of a good impression."}, {"viet": "Đám đông thong thả rời khỏi sân vận động.", "eng": "The crowds drifted away from the stadium."}, {"viet": "Vũ đoàn biểu diễn ở nhiều nước.", "eng": "The dance troupe performed in many countries."}, {"viet": "Bị cáo, một phụ nữ 35 tuổi, chối không có đá viên cảnh sát.", "eng": "The defendant, a woman of 35, denies kicking the policeman."}, {"viet": "Sự cầm tù những kẻ khủng bố không xét xử.", "eng": "The detention of terrorists without trial."}, {"viet": "Bệnh vẫn còn ở giai đoạn ban đầu.", "eng": "The disease is still in its primary stage."}, {"viet": "Bác sĩ cho tôi ngậm nhiệt kế để xem tôi có bị sốt không.", "eng": "The doctor put a thermometer in my mouth to see if I had a temperature."}, {"viet": "Con chó rúc vào tôi trên ghế sôpha.", "eng": "The dog nuzzled against me on the sofa."}, {"viet": "Chiếc áo đầm không vừa và bị nhăn ở phần thắt lưng.", "eng": "The dress fitted badly and puckered at the waist."}, {"viet": "Quả đất cứ 24 giờ lại quay được một vòng xung quanh trục của nó.", "eng": "The earth turns on its axis once every 24 hours."}, {"viet": "Người làm thuê đang đòi ngày làm việc sáu tiếng và tuần làm việc năm ngày.", "eng": "The employees are demanding a six-hour day and five-day week."}, {"viet": "Tất cả mọi trang bị đều đã được đem thực nghiệm.", "eng": "The equipment has all been field-tested."}, {"viet": "Vận động viên chạy kiệt sức đang thở hổn hển để lấy hơi.", "eng": "The exhausted runner was gasping for breath."}, {"viet": "Sự bất đồng ở lãnh vực cung cấp nhân sự là trở ngại chủ yếu cho sự tiến bộ trong các cuộc thương lượng.", "eng": "The failure to agree on manning levels is a major stumbling-block to progress in the talks."}, {"viet": "Cảm giác mà bạn có được khi lao xuống thì cực kỳ vui thú.", "eng": "The feeling you get when diving down is incredible."}, {"viet": "Bản chuyển thể tác phẩm Jane Eyre cho điện ảnh.", "eng": "The film version of Jane Eyre."}, {"viet": "Hãng này là công ty chính của nước Anh sản xuất các thiết bị điện tử.", "eng": "The firm is Britain's main producer of electronic equiment."}, {"viet": "Con cá rơi tõm lại xuống sông.", "eng": "The fish plopped back into the river."}, {"viet": "Những tay mê bóng đá đã trở nên hoàn toàn vô kỷ luật.", "eng": "The football fans have got completely out of hand."}, {"viet": "Những con mèo con hiếu động nhảy trên khắp tấm thảm.", "eng": "The frisky kittens jumped all over the carpet."}, {"viet": "Khu vườn mọc đầy cỏ dại.", "eng": "The garden is overgrown with weeds."}, {"viet": "Các thiếu nữ lần lượt xướng to tên của mình.", "eng": "The girls called out their names in turn."}, {"viet": "Hàng tuần tôi phải nộp cho Nhà nước một phần tiền của mình.", "eng": "The government's weekly bite of my pay check."}, {"viet": "Chính phủ sắp đưa ra một tuần làm việc ngắn hơn.", "eng": "The government is introducing a shorter working week."}, {"viet": "Sự tinh tế dần dần trong những sở thích của cô ta về âm nhạc.", "eng": "The gradual refinement of her tastes in music."}, {"viet": "Khủng hoảng lòng tin ngày càng tăng làm lung lay chức tổng thống của ông ta.", "eng": "The growing credibility gap that crippled his presidency."}, {"viet": "Sảnh đường chắc chắn là không chật ních.", "eng": "The hall was nowhere near full."}, {"viet": "Cô đào chính rời sân khấu.", "eng": "The heroine makes her exit from the stage."}, {"viet": "Tiền bệnh viện làm hao hụt nhiều số tiền tiết kiệm của anh ta.", "eng": "The hospital bills made a big hole in his savings."}, {"viet": "Ngôi nhà ở trong một khung cảnh đẹp.", "eng": "The house is in beautiful surroundings."}, {"viet": "Gió lạnh buốt làm các bông hoa mới nở không rộ lên được.", "eng": "The icy breeze nipped the young blooms."}, {"viet": "Tính đặc trưng trong tác phẩm của ai.", "eng": "The individuality of somebody's work."}, {"viet": "Kẽ hở giữa các viên gạch làm cho khí lạnh lọt vào.", "eng": "The interstice between the bricks let in cold air."}, {"viet": "Công việc hóa ra vất vả hơn chúng tôi tưởng.", "eng": "The job turned out to be harder than we thought."}, {"viet": "Chiếc chìa khóa treo trên một sợi dây gần cửa.", "eng": "The key is hanging on a string by the door."}, {"viet": "Khu đất đó đã dọn sạch cây cối.", "eng": "The land was cleared of trees."}, {"viet": "Luật sư đó được trao quyền thanh toán những hóa đơn của bà ta.", "eng": "The lawyer was empowered to pay all her bills."}, {"viet": "Thư viện ở phía bên kia đường cách nhà trường.", "eng": "The library is on the opposite side of the road from school."}, {"viet": "Đội địa phương đã thắng trận đấu dễ dàng với tỉ số cách biệt lớn.", "eng": "The local team won the match hands down."}, {"viet": "Cái máy đó phải được kiểm tra hàng tuần.", "eng": "The machine must be checked weekly."}, {"viet": "Người quản lý quán ăn tự phục vụ ở đằng kia.", "eng": "The man who run cafeteria is over there."}, {"viet": "Vấn đề đó đang được xem xét từng li từng tí.", "eng": "The matter is being gone into."}, {"viet": "Phần chính của bản nhạc sẽ chơi tiếp theo bằng sáo.", "eng": "The melody is next taken up by the flutes."}, {"viet": "Ông bộ trưởng đã phải né tránh vài câu hỏi rắc rối của các phóng viên.", "eng": "The minister had to fend off some awkward questions from reporters."}, {"viet": "Hình thù gớm ghiếc của một con rồng phun lửa.", "eng": "The monstrous form of a fire-breathing dragon."}, {"viet": "Những ngọn núi soi bóng xuống hồ.", "eng": "The mountains glass themselves in the lake."}, {"viet": "Đảng quốc gia chắc chắn có vị trí mạnh.", "eng": "The Nationalist Party are sure to get in."}, {"viet": "Chính phủ mới phải bắt tay vào tìm kiếm các giải pháp cho các vấn đề kinh tế của đất nước.", "eng": "The new government must set about finding solutions to the country's economic problems."}, {"viet": "Cái cửa hiệu mới mở bên kia đường đã lấy mất hầu hết khách hàng của tôi.", "eng": "The new shop across the road has taken away most of my customers."}, {"viet": "Những tờ báo bị nhét chặt vào hộp thư đến nỗi anh ta phải vất vả mới lấy ra được.", "eng": "The newspapers were so tightly jammed in the letter-box he could hardly get them out."}, {"viet": "Cốt lõi của vấn đề là việc xuất khẩu của chúng ta yếu kém.", "eng": "The nub of the problem is our poor export performance."}, {"viet": "Cơ quan bị những đơn kiện gửi đến tới tấp.", "eng": "The office was flooded with complaints."}, {"viet": "Tờ pao cũ không còn là tiền tệ chính thức nữa.", "eng": "The old pound note is no longer legal tender."}, {"viet": "Ban nhạc sẽ trình diễn hai buổi nữa trước khi rời nước Anh.", "eng": "The orchestra will give two more performances before leaving Britain."}, {"viet": "Bức hoạ trông sẽ đẹp hơn với một ánh phớt hồng.", "eng": "The painting will look better with a tinge of red."}, {"viet": "Hành khách và thủy thủ đoàn đã được tàu cứu hộ Dover vớt lên.", "eng": "The passengers and crew were brought off by the Dover lifeboat."}, {"viet": "Những người trong vụ tai nạn bị thương nặng.", "eng": "The people in the accident had serious injuries."}, {"viet": "Nghệ thuật nhiếp ảnh trong phim nói về đời sống hoang dã ở vùng bắc cực thật tuyệt vời.", "eng": "The photography in the film about arctic wildlife was superb."}, {"viet": "Chỗ danh dự ở đầu bàn.", "eng": "The place of honour at the head of the table."}, {"viet": "Vữa trát đã bắt đầu bong ra khỏi tường.", "eng": "The plaster had started to come away from the wall."}, {"viet": "Bài thơ là sự khẳng định thú vị về sức mạnh tình yêu.", "eng": "The poem is a joyous affirmation of the power of love."}, {"viet": "Cảnh sát đã có bức ảnh cô gái mất tích được phóng to.", "eng": "The police had the photograph of the missing girl enlarged."}, {"viet": "Cảnh sát đã bắt được tên đầu xỏ của xã hội đen chịu trách nhiệm đối với nhiều tội ác trong thành phố.", "eng": "The police were able to capture the leader of the underworld responsible for the many crimes in the city."}, {"viet": "Bức chân dung mẹ cô ta là tài sản quý giá nhất.", "eng": "The portrait of her mother was her most prized possession."}, {"viet": "Sự trao tặng giải thưởng bắt đầu lúc ba giờ.", "eng": "The presentation of prizes starts at three o'clock."}, {"viet": "Những áp lực đeo đẳng tất cả chúng tôi.", "eng": "The pressures that beset us all."}, {"viet": "Tiền vốn của quỹ tín thác không thể chi tiêu được theo những điều khoản của hợp đồng tín thác.", "eng": "The principal of the trust fund is unexpendable under the terms of the trust agreement."}, {"viet": "Sản phẩm đó thành công đến nỗi tên của nó trở nên rất nổi tiếng.", "eng": "The product was so successful that its name became a household word."}, {"viet": "Viễn ảnh được thăng chức cứ lởn vởn trong trí anh ta.", "eng": "The prospect of promotion was dangled before him."}, {"viet": "Bến cảng trông như một con đường đá dài chạy ra biển.", "eng": "The quay looked like a long stone road going into the sea."}, {"viet": "Trời tạnh mưa khá lâu đủ để chúng tôi đi picnic.", "eng": "The rain held off just long enough for us to have our picnic."}, {"viet": "Khả năng phục hồi sức khỏe của không khí trong lành.", "eng": "The recuperative powers of fresh air."}, {"viet": "Bản báo cáo tránh né các vấn đề môi trường.", "eng": "The report simply sidesteps the environmental issues."}, {"viet": "Theo sau cuộc cách mạng là nỗi kinh hoàng bao trùm.", "eng": "The revolution was followed by a reign of terror."}, {"viet": "Con đường kéo dài ra khỏi làng lên tận những ngọn đồi.", "eng": "The road continues beyond the village up into the hills."}, {"viet": "Sau khi mặt trời xuống, căn phòng trở nên mát.", "eng": "The room was cool after the sun had gone down."}, {"viet": "Hộp ký gửi an toàn đó cho ký gửi với lệ phí 300 nhân dân tệ một năm.", "eng": "The safe deposit box rents at 300 yuan a year."}, {"viet": "Kế hoạch khả quan hơn là những cái kẻ gièm pha gợi ra.", "eng": "The scheme is better than it detractors suggest."}, {"viet": "Nửa phần sau của cuốn sách hấp dẫn hơn nửa phần đầu.", "eng": "The second half of the book is more exciting than the first."}, {"viet": "Hình bóng của thảm hoạ đang đến gần.", "eng": "The shadow of the approaching catastrophe."}, {"viet": "Con tàu bất lực trước sức mạnh của cơn bão.", "eng": "The ship was helpless against the power of the storm."}, {"viet": "Sau khi tôi nằm xuống được một lát thì cơn buồn nôn đã qua đi.", "eng": "The sickness passed after I lay down for a while."}, {"viet": "Đó là ngày bầu trời bị một lớp mây che phủ.", "eng": "The sky is covered all over with a layer of clouds."}, {"viet": "Ghế xô-pha có thể dễ dàng chuyển thành giường nằm.", "eng": "The sofa can be readily converted into a bed."}, {"viet": "Điểm cực nam của một hòn đảo.", "eng": "The southernmost point of an island."}, {"viet": "Những phần dưới của con sóc có màu nhạt hơn.", "eng": "The squirrel's under part are lighter in colour."}, {"viet": "Viên đá chạm tường nẩy chéo và trúng vào một người khách qua đường.", "eng": "The stone ricocheted off the wall and hit a passerby."}, {"viet": "Cuộc đấu tranh của những người bị bóc lột chống lại bọn áp bức.", "eng": "The struggle of the weak against their oppressors."}, {"viet": "Mặt trời mọc lúc bình minh thật lộng lẫy.", "eng": "The sunrise at dawn is so magnificent."}, {"viet": "Ảnh hưởng giáo hoá của cô giáo đối với các học sinh của cô.", "eng": "The teacher's civilizing influence on her young pupils."}, {"viet": "Đội bóng sẽ được giới thiệu lên bảng thông báo.", "eng": "The team will be put up on the notice-board."}, {"viet": "Lớp sương mù dày đặc dường như thấm qua cả tường vào trong phòng.", "eng": "The thick fog seemed to have infiltrated through the very walls into the room."}, {"viet": "Dụng cụ đo thời gian này được gọi là rô-nô-mét.", "eng": "The timepiece was called a chronometer."}, {"viet": "Tối hôm nay xe cộ đi ít lại.", "eng": "The traffic was very light this evening."}, {"viet": "Đoàn quân ngay lúc này đang chuẩn bị tiến vào thành phố.", "eng": "The troops are even now preparing to march into the city."}, {"viet": "Hai người bạn cũ choàng tay ôm lấy nhau sung sướng.", "eng": "The two old friends flung their arms round another in delight."}, {"viet": "Liên Hiệp Vương Quốc Anh bao gồm Anh và Bắc Ailen.", "eng": "The United Kingdom consists of Great Britain and Northern Ireland."}, {"viet": "Quân đội chiến thắng đòi hỏi đầu hàng không điều kiện.", "eng": "The victorious army demanded unconditional surrender."}, {"viet": "Chiến tranh đã để lại nhiều biến đổi xã hội.", "eng": "The war brought many social changes in its wake."}, {"viet": "Con cá voi lặn xuống khi chiếc lao đã đâm vào nó.", "eng": "The whale dived as the harpoon struck it."}, {"viet": "Gió cuốn những chiếc lá trên không trung.", "eng": "The wind whirled the leaves into the air."}, {"viet": "Công việc phải xong trong tuần này, cho nên chúng ta phải làm khẩn trương lên!", "eng": "The work must by finished this week, so we'd better get weaving!"}, {"viet": "Người nhạc sĩ trẻ đã nhanh chóng nổi tiếng.", "eng": "The young musician rose quickly to fame."}, {"viet": "Chuyến đi nghỉ của họ đã bị thất bại bởi một chuỗi những điều rủi ro.", "eng": "Their holiday was ruined by a whole series of misadventures."}, {"viet": "Đồng lương của họ chỉ vừa đủ để khỏi đói.", "eng": "Their wages are barely enough to keep the wolf from the door."}, {"viet": "Nếu họ bắt gặp chúng ta bên trong toà nhà thì rắc rối lắm đấy.", "eng": "There'll be the devil to pay if we're caught inside the building."}, {"viet": "Trong gia đình có máu nghệ sĩ.", "eng": "There's an artistic strain in the family."}, {"viet": "Có một buổi hòa nhạc ở nhà hát Empress.", "eng": "There's one at the Empress Concert Hall."}, {"viet": "Có những khác nhau cơ bản giữa những tín ngưỡng của anh và tôi.", "eng": "There are fundamental differences between your religious beliefs and mine."}, {"viet": "Có những nghi lễ Giáng Sinh đặc biệt tại các nhà thờ Cơ Đốc trên khắp thế giới.", "eng": "There are special Christmas services in Christian churches all over the world."}, {"viet": "Trong 50 năm qua y học đã có những sự tiến bộ lớn.", "eng": "There have been great advance in medicine in the last 50 years."}, {"viet": "Có một mẹo để bật nó lên.", "eng": "There is a trick to turning it on."}, {"viet": "Trên cõi đời này có biết bao nhiêu là đau khổ.", "eng": "There is so much suffering in this world."}, {"viet": "Một cuộc tổ chức ăn mừng lớn diễn ra khi đứa trẻ ra đời.", "eng": "There was a great celebration when the baby was born."}, {"viet": "Không có gì mới trong bài giảng nhạt nhẽo của ông ta.", "eng": "There was nothing new in his banal lecture."}, {"viet": "Không đủ giương nhưng vấn đề đã được giải quyết bằng cách George ngủ ở sofa.", "eng": "There weren't enough beds but the matter was resolved by George sleeping on the sofa."}, {"viet": "Các sự kiện này nói lên một cách hùng hồn tính trung thực của cô ấy.", "eng": "These facts speak volumes for her honesty."}, {"viet": "Những tin đồn này là ngược với những tin trước.", "eng": "These rumours contradict previous ones."}, {"viet": "Họ thuê một căn hộ có đầy đủ đồ đạc ở tầng ba.", "eng": "They're renting a furnished flat on the third floor."}, {"viet": "Họ là những người tự trọng và không phụ thuộc ai.", "eng": "They are a proud and independent people."}, {"viet": "Chúng không ăn gì cả ngoài cây cỏ.", "eng": "They ate nothing but plants."}, {"viet": "Họ làm tôi rối lên bằng cách hỏi bao nhiêu là câu hỏi.", "eng": "They confused me by asking so many questions."}, {"viet": "Họ góp mỗi người ba bảng để trả tiền cà phê và xăng-uých.", "eng": "They each put 3 pounds into the kitty to pay for their coffee and sandwiches."}, {"viet": "Họ đã bị đắm tàu ở ngoài khơi bờ biển châu Phi.", "eng": "They had been wrecked off the coast of Africa."}, {"viet": "Họ phỏng vấn những người thuộc mọi tầng lớp xã hội.", "eng": "They interview people from all walks of life."}, {"viet": "Chẳng hạn, việc không thể bỏ phiếu được trong một cuộc bầu cử.", "eng": "They may not, for instance, vote in an election."}, {"viet": "Họ chọc ( vào ) con vật qua các chấn song chuồng.", "eng": "They prodded ( at ) the animal through the bars of its cage."}, {"viet": "Họ tự xem mình như những chàng hiệp sĩ thập tự chinh thời nay.", "eng": "They see themselves as latter-day crusading knights."}, {"viet": "Họ đe doạ xoá toẹt toàn bộ đề án.", "eng": "They threatened to cancel the whole project at a stroke."}, {"viet": "Họ bị tấn công bởi những người dân bộ lạc cướp bóc.", "eng": "They were attacked by marauding tribesmen."}, {"viet": "Họ bị mắc kẹt trong khách sạn đang cháy.", "eng": "They were trapped in the burning hotel."}, {"viet": "Cùng lắm mới được dùng đến núm báo động này.", "eng": "This alarm button is only to be used in extremis."}, {"viet": "Phương thức chia lãi của công ty này nêu ra một gương tốt mà các công ty khác đã theo.", "eng": "This company's profit-sharing scheme set a pattern which others followed."}, {"viet": "Điều nếm trải này đã gây cho ông ta nhiều đau khổ về tinh thần.", "eng": "This experience caused him much mental suffering."}, {"viet": "Đây là dịp thích hợp để xin nghỉ buổi chiều.", "eng": "This is a suitable moment to ask for the afternoon off."}, {"viet": "Đây là chỗ chúng ta chuyển từ ôtô sang xe buýt.", "eng": "This is where we change from car to bus."}, {"viet": "Vật liệu mới này là một sản phẩm phụ của ngành công nghiệp vũ trụ.", "eng": "This new material is a spin-off from the space industry."}, {"viet": "Dự án này chỉ là mở đầu cho một chương trình nghiên cứu lớn hơn nhiều.", "eng": "This project is a curtain raiser for a much bigger programme of research."}, {"viet": "Câu chuyện này đã gói gọn các cảnh tượng thời thơ ấu của ông ta.", "eng": "This story encapsulates scenes from his childhood."}, {"viet": "Từ này nằm trên trang đầu tiên của mỗi quyển sách được in ra ở Hoa Kỳ.", "eng": "This word is on one of the first pages of every book printed in the United States."}, {"viet": "Ở Hoa Kỳ, muốn có bản quyền, tác giả hoặc nhà xuất bản gửi hai bản sao của tác phẩm cho Văn phòng Bản quyền ở Thủ đô Washington, và phải trả một lệ phí nhỏ.", "eng": "To get a copyright in the United States the writer or publisher must send two copies of the work to the Copyright Office in Washington, D. C., he must also pay a small fee."}, {"viet": "Thành phố thì nhỏ bé và tách biệt xa xôi.", "eng": "Towns were small and far apart."}, {"viet": "Thường thì chúng tôi gặp rất ít yêu cầu đổi tiền kim loại, và thật khó cho chúng tôi khi phải giữ đủ tiền kim loại trong phòng khi có thể dùng đến.", "eng": "Usually, we have very little request for coin exchange, and it is difficult for us to maintain enough coins to what may be needed."}, {"viet": "Đồng hồ đeo tay được chế tạo với nhiều hình thù kỳ lạ: bông hoa, bướm, chữ thập và thậm chí sọ người nữa.", "eng": "Watches were made in all sorts of queer shapes: flowers, butterflies, crosses and even skulls."}, {"viet": "Chúng ta chỉ có thể thành công nếu mỗi người chúng ta làm hết sức mình.", "eng": "We'll only succeed if every man jack of us works his hardest."}, {"viet": "Chúng tôi đang tìm người giỏi tiếng Đức.", "eng": "We're looking for someone with a good knowledge of German."}, {"viet": "Năm nay chúng ta có một cô giáo thể thao mới.", "eng": "We've got a new games mistress this year."}, {"viet": "Tất cả chúng tôi xúm xít quanh chiếc đài thu thanh để nghe tin.", "eng": "We all huddled around the radio to hear the news."}, {"viet": "Chúng tôi thấy thương những người tị nạn.", "eng": "We are presdisposed to pity the refugees."}, {"viet": "Chúng tôi tới qua các con đường làng chứ không qua xa lộ.", "eng": "We came by country roads, not by the motorway."}, {"viet": "Chúng ta không thể bỏ qua vấn đề này mà không phản đối.", "eng": "We cannot pass this matter by without protest."}, {"viet": "Chúng tôi không gặp nhau ở San Francisco-chúng tôi gặp nơi trao đổi qua computer.", "eng": "We didn't meet in San Francisco-we met in cyberspace."}, {"viet": "Cuối cùng chúng tôi đã giải quyết xong ai phải trả cho tai nạn.", "eng": "We finally settled who should pay for the accident."}, {"viet": "Chuyến đi của chúng tôi rất tốt-chỉ mất 50 phút.", "eng": "We had quite a good run-it only took us 50 minutes."}, {"viet": "Chúng tôi đã tìm thấy quần áo đã giặt ủi của ông, ba cái váy và ba cái áo kiểu.", "eng": "We have found your laundry, three skirts and three blouses."}, {"viet": "Chúng tôi giúp đỡ lẫn nhau làm những việc phụ trội vào mùa hè.", "eng": "We help one another with the extra work in the summer."}, {"viet": "Chúng tôi sẽ cử người đến sửa chữa ngay bây giờ.", "eng": "We'll send someone to repair it now."}, {"viet": "Cách này hay cách khác chúng ta phải hoàn thành công việc trong tuần này.", "eng": "We must finish the job this week one way or another."}, {"viet": "Chúng ta cần phải bắt đầu thảo luận những vấn đề thực tiễn trước.", "eng": "We need to start discussing practicalities."}, {"viet": "Chúng tôi đã nhận bốn trăm đơn xin việc.", "eng": "We received 400 applications for the job."}, {"viet": "Đáng lẽ chúng tôi đã hoàn thành việc thu hoạch nhưng một cơn bão đã cản trở.", "eng": "We should have finished harvesting, but a storm intervened."}, {"viet": "Chính chúng tôi cố gắng để cho mình nắm được về các xu thế hiện nay.", "eng": "We try and keep ourselves informed about current trends."}, {"viet": "Chúng tôi kinh ngạc trước tài năng lão luyện của anh ta trên các sườn núi trượt tuyết.", "eng": "We were amazed at his expertise on the ski slopes."}, {"viet": "Ở phi cảng chúng tôi giết thì giờ bằng cách đọc tạp chí.", "eng": "We whiled away the time at the airport reading magazines."}, {"viet": "À, tính đến hôm nay thì tài khoản của ông còn 500 nhân dân tệ.", "eng": "Well, as of today you have 500 Yuan in your account."}, {"viet": "À, khi tôi có số gọi từ trạm thông tin New York, tôi phải mất bao nhiêu tiền lẻ.", "eng": "Well, once I get the number from New York information, how much change should I have ready."}, {"viet": "Thủ tục để đòi thanh toán phí tổn là thế nào?", "eng": "What's the drill for claiming expenses?"}, {"viet": "Những tiêu chuẩn để quyết định ai được giải là những tiêu chuẩn nào?", "eng": "What are the criterions of deciding who gets the prize?"}, {"viet": "Anh học gì ở trường cao đẳng?", "eng": "What did you study in college?"}, {"viet": "Những gì anh ta làm là hoàn toàn hợp pháp-cảnh sát không thể đụng chạm tới anh ta được.", "eng": "What he did was perfectly legal-the police can't touch him for it."}, {"viet": "Số phần trăm phụ nữ trong lực lượng lao động ở nước bạn là bao nhiêu?", "eng": "What is the percentage of women in the labor force in your country?"}, {"viet": "Bạn làm việc ở bộ phận nào?", "eng": "What line of work are you in?"}, {"viet": "Bạn đã đến thăm những ngôi chùa và đền thờ nào ở Nhật Bản?", "eng": "What temples and shrines have you visited in Japan?"}, {"viet": "Khi nào chúng ta sẽ đi xem chiếc ô tô ấy của anh?", "eng": "When are we going to see this car of yours?"}, {"viet": "Khi bố mẹ nó chết, nó được giao cho bà cô trông nom.", "eng": "When his parents died, he was placed in the custody of his aunt."}, {"viet": "Khi cô ta nghe được tin ấy thì sự giận dữ của cô thật ghê gớm.", "eng": "When she heard the news her fury knew no bounds."}, {"viet": "Khi hút bụi thì hãy chuyển cái bàn đi và đặt nó lại chỗ cũ khi anh làm xong.", "eng": "When vacuuming, move the table and put it back when you are finished."}, {"viet": "Vui lòng cho tôi biết tôi có thể đón nó ở đâu?", "eng": "Where can I get it, please?"}, {"viet": "Quốc gia nào có ảnh hưởng mạnh hơn trong khối đồng minh?", "eng": "Which country is the predominant member of the alliance?"}, {"viet": "Trong khi ( bị giam ) trong tù, cô ấy đã viết quyển tiểu thuyết đầu tay.", "eng": "While ( locked up ) in prison, she wrote her first novel."}, {"viet": "Vị nào vừa mới đến thế?", "eng": "Who is the worthy who has just arrived?"}, {"viet": "Tại sao nó tốn nhiều tiền vậy?", "eng": "Why does it cost so much?"}, {"viet": "Anh ấy sẽ cho bạn câu trả lời ngay chứ?", "eng": "Will he give you an answer soon?"}, {"viet": "Anh dọn những cuốn sách của anh khỏi bàn tôi được không?", "eng": "Will you remove your books from my desk?"}, {"viet": "Với ánh sáng nhiều màu sắc, bầu trời dưới biển sâu chắc cũng đẹp như bầu trời đầy sao trên đầu chúng ta.", "eng": "With its many-colored lights the sky of the deep sea must be as beautiful as the starry sky above us."}, {"viet": "Làm việc trong một trang trại là một hướng mới đối với anh ta.", "eng": "Working on a farm is a new departure for him."}, {"viet": "Thứ sáu tới cậu đến ăn cơm tối được không?", "eng": "Would you like to come to dinner next Friday?"}, {"viet": "Xin vui lòng cung cấp cho chúng tôi 2000 đơn vị của mẫu hàng số 565 được không ạ?", "eng": "Would you please supply us 2,000 units of item No. 565?"}, {"viet": "Vâng, nhưng ông sẽ phải điền vào một phiếu mượn và đặt cọc 100 nhân dân tệ.", "eng": "Yes, but you'll have to fill out a rental slip and put a hundred Yuan deposit."}, {"viet": "Ừ, khi cô ấy tuyệt vọng, cô ấy sợ hãi.", "eng": "Yes, when she was lost, she was afraid."}, {"viet": "Anh phải sửa chữa chỗ dột đó đi nếu không nó sẽ gây ra nhiều vấn đề sau này.", "eng": "You'll have to mend that leak or it will cause problems later."}, {"viet": "Anh phải thanh toán hoá đơn này ngày thứ sáu.", "eng": "You're supposed to pay the bill by Friday."}, {"viet": "Anh không được phép mang thức ăn vào thư viện.", "eng": "You are not permitted to bring food into the library."}, {"viet": "Bạn không thể chụp ảnh nếu ánh sáng kém.", "eng": "You can't take photographs if the light is bad."}, {"viet": "Anh có thể vĩnh biệt những ngày nghỉ ở bờ biển vì chúng ta đã từng được biết chúng.", "eng": "You can say farewell to seaside holidays as we once knew them."}, {"viet": "Bạn không bị khó khăn với những chữ viết hoa phải không?", "eng": "You don't have a problem with capital letters, do you?"}, {"viet": "Xin ông để lại bằng lái hoặc vật gì làm bằng.", "eng": "You have to leave your driver's license or something."}, {"viet": "Anh có thể viết tiếp ở mặt kia tờ giấy.", "eng": "You may continue on the other side of the paper."}, {"viet": "Anh không nên hiểu lời nhận xét của anh ta là một điều sỉ nhục.", "eng": "You must not take his remark as an insult."}, {"viet": "Anh đang dọn mọi thứ ra khỏi đây.", "eng": "You're moving everything out of here."}, {"viet": "Ông nên đi chuyến xe lửa E.", "eng": "You should take the E train."}, {"viet": "Cậu không đến nỗi nhẹ dạ để tin nó, có phải không?", "eng": "You weren't so naive as to believe him, were you?"}, {"viet": "Thái độ của anh rất đáng bị khiển trách.", "eng": "Your attitude is most reprehensible."}, {"viet": "Sự có mặt của bà đã làm cho đời sống của chúng tôi thêm vô cùng phong phú.", "eng": "Your presence has enriched our lives immeasurably."}]