[{"viet": "Sách được buộc bằng một sợi dây hay băng vải.", "eng": "A book was kept closed with strings or straps."}, {"viet": "Sự say mê nhất thời biển cả trong tuổi thơ ấu.", "eng": "A childhood romance with the sea."}, {"viet": "Một hợp đồng cung cấp văn phòng phẩm.", "eng": "A contract for the supply of office stationery."}, {"viet": "Một đức tin sâu sắc làm nền tảng cho công việc của cô ta giữa đám dân tị nạn.", "eng": "A deep faith underlies her work among refugees."}, {"viet": "Một cái áo đầm cắt tốn vải.", "eng": "A dress that is generously cut."}, {"viet": "Một cuốn phim thật sự dở hết cỡ.", "eng": "A film that really plumbs that depths of bad taste."}, {"viet": "Một khẩu phần vịt quay hậu hĩ.", "eng": "A generous portion of roast duck."}, {"viet": "Một nhóm người tụ tập bên ngoài quán rượu.", "eng": "A group of men gathered outside the pub."}, {"viet": "Một vụ kẹt xe trên xa lộ.", "eng": "A hold-up on the motorway."}, {"viet": "Một con dao có lưỡi cong.", "eng": "A knife with a curved blade."}, {"viet": "Tiếng mưa rơi tí tách vào cửa sổ.", "eng": "A light patter of rain on the window."}, {"viet": "Một quang cảnh tuyệt đẹp của những tháp nhà thờ trong thành phố.", "eng": "A magnificent view of the spires of the city."}, {"viet": "Một trường hợp vi phạm các điều lệ không nghiêm trọng.", "eng": "A minor infraction of the rules."}, {"viet": "Cái áo mới này phải giặt cẩn thận đấy.", "eng": "A new garment should be washed carefully."}, {"viet": "Một đôi giày trắng thêm vào làm cho bộ quần áo nổi bật hoàn toàn.", "eng": "A pair of white shoes completed the striking ensemble."}, {"viet": "Một bản nhạc piano với lối đánh phức tạp.", "eng": "A piano piece with tricky fingering."}, {"viet": "Một lời tái bút được thêm vào cuối lá thư của nàng.", "eng": "A postscript tagged on to her letter at the end."}, {"viet": "Một phép tính nhanh cho thấy là chúng tôi không có lãi.", "eng": "A quick computation revealed that we would not make a profit."}, {"viet": "Một chương trình khắt khe nhằm phục hồi sức khỏe.", "eng": "A rigorous programme to restore physical fitness."}, {"viet": "Một lâu đài lẻ loi, có những bụi cây và hàng rào ngăn cách.", "eng": "A secluded mansion, islanded by shrubbery and fences."}, {"viet": "Một bản tường thuật các sự kiện hoàn toàn vô tư.", "eng": "A simple unbiased account of events."}, {"viet": "Một người miền nam bây giờ sống ở miền bắc nước Anh.", "eng": "A southerner now living in the north of England."}, {"viet": "Một chính sách hoàn toàn không can thiệp vào các công việc nội bộ của các quốc gia khác.", "eng": "A strict policy of non-interference in the internal affairs of other countries."}, {"viet": "Một sự ghét công việc khó nhọc do bản tính.", "eng": "A temperament aversion to hard work."}, {"viet": "Một lĩnh vực khó phân biệt giữa cái tốt và cái xấu.", "eng": "A twilight zone between good and evil."}, {"viet": "Một cuộc quyên góp để làm quà Giáng Sinh cho các nhân viên vệ sinh văn phòng.", "eng": "A whip-round for a Christmas present for the office cleaners."}, {"viet": "Gia tăng mức độ phát triển.", "eng": "Accelerating the rate of the growth."}, {"viet": "Phán quyết về khiếu nại đòi bồi thường của một ai đó.", "eng": "Adjudicate somebody's claim for damages."}, {"viet": "Sau khi bị lăng nhục như thế, máu trong người của tôi sôi lên!", "eng": "After being insulted like that, my blood is really up!"}, {"viet": "Sau khi uống sáu ly rượu vốt-ka, mắt ông ta lờ đờ và ông chẳng còn nhớ được điều gì nữa.", "eng": "After six glasses of vodka, his eyes glazed over and he remembered nothing more."}, {"viet": "Khuấy hỗn hợp để hòa tan bột.", "eng": "Agitate the mixture to dissolve the powder."}, {"viet": "Tất cả các quốc gia trên thế giới hiện đại này đều phụ thuộc lẫn nhau.", "eng": "All nations are interdependent in the modern world."}, {"viet": "Tất cả sự phát triển tinh xảo của nền công nghệ thế kỷ 20.", "eng": "All the refinement of 20th century-technology."}, {"viet": "Đã luôn luôn được những gì chúng muốn mà không phải mất công sức.", "eng": "Always got what they wanted on a platter."}, {"viet": "Một hợp kim kết hợp tính bền chắc và đàn hồi.", "eng": "An alloy combining strength and resilience."}, {"viet": "Một con voi giận dữ lồng lộn trong các bụi cây thấp.", "eng": "An enraged elephant crashing about in the undergrowth."}, {"viet": "Một vụ vi phạm đời tư của ai.", "eng": "An infringement of somebody's privacy."}, {"viet": "Một sinh vật tăng trưởng nhờ sự nhân ra của các tế bào của nó.", "eng": "An organism that grows by the multiplication of its cells."}, {"viet": "Và chúng tôi cũng thích vài món đầu bữa và cá hồi nướng lò.", "eng": "And we also like some hors d'oeuvres and the baked salmon."}, {"viet": "Bất cứ con nào có chiều dài 6 bộ đều được coi là vật khổng lồ.", "eng": "Any one that gets to be six feet long is a giant."}, {"viet": "Hàng hóa này được gửi đi bằng đường hàng không hay đường thủy?", "eng": "Are the goods to be flown or shipped?"}, {"viet": "Anh hợp với công việc mới của anh chứ?", "eng": "Are you getting along all right in your new job?"}, {"viet": "Bạn không định gọi điện cho anh ấy để xem anh ấy có đến được hay không sao?", "eng": "Aren't you going to call him to see if he is coming?"}, {"viet": "Nói về hang động, tôi nghe nói rằng đến thăm những hang động ở Quế Lâm là một trải nghiệm hấp dẫn đấy.", "eng": "As for caves, I hear that visiting the caves of Guilin is a fascinating experience."}, {"viet": "Cho đến nay người ta biết rất ít về nguyên nhân của căn bệnh đó.", "eng": "As yet little is known of the causes of the disease."}, {"viet": "Vào buổi trưa, có 12 hình nhân diễu binh, và có một con gà trống xuất hiện trên nóc đồng hồ, vỗ cánh và cất tiếng gáy.", "eng": "At noon there was a procession of twelve little figures, and a cock appeared at the top of the clock, flapped its wings, and crowed."}, {"viet": "Sự tự động hóa đã làm cho nhu cầu kiểm soát bằng tay trở nên không cần thiết.", "eng": "Automation has largely dispensed with the need for manual checking."}, {"viet": "Coi chừng vỉa hè phủ băng; nó trơn lắm đó.", "eng": "Be careful of the icy pavement; it's really glassy."}, {"viet": "Đừng quên đưa bà chủ đi cùng với ông nhé?", "eng": "Be sure to bring Mrs. Chow with you, won't you?"}, {"viet": "Vừa bị thất nghiệp, lại vừa có hai đứa con, họ cảm thấy không thể nào xoay sở đủ cho cuộc sống.", "eng": "Being out of work and having two children they found it impossible to make ends meet."}, {"viet": "Chà! Trông cái mũ buồn cười thật!", "eng": "Blimey, that's a funny hat!"}, {"viet": "Giúp đỡ cho người bệnh và người bị thương.", "eng": "Bring succor to the sick and wounded."}, {"viet": "Cô vui lòng cho tôi biết khi nào ông ấy sẽ trở lại?", "eng": "But could you tell me when he'll be back?"}, {"viet": "Nhưng bạn ấy chỉ đánh bại tôi ở ván cuối thôi.", "eng": "But she just barely beat me in the very last game."}, {"viet": "Tình bạn của họ dần dần biến thành tình yêu.", "eng": "By degrees their friendship grew into love."}, {"viet": "Gọi các con vào, đã đến giờ dùng trà.", "eng": "Call the children in, it's time for tea."}, {"viet": "Tôi có thể thắt cái cà vạt này với áo sơ mi xanh không?", "eng": "Can I wear this tie with my blue shirt?"}, {"viet": "Cậu có thể cho mình biết đôi điều về những ý định của cậu được không?", "eng": "Can you give me some indications as to your intentions?"}, {"viet": "Anh vui lòng cho tôi biết số điện thoại của phòng tôi?", "eng": "Can you tell me my telephone number?"}, {"viet": "Liếc sơ qua các đầu đề của tờ báo.", "eng": "Cast a glance at the newspaper headlines."}, {"viet": "Trẻ con thích được mọi người quan tâm đến.", "eng": "Children like to be the centre of attention."}, {"viet": "Sự sáo rỗng là đặc điểm của báo chí tồi.", "eng": "Cliché is a feature of bad journalism."}, {"viet": "Các nhà bình luận còn đang mổ xẻ kết quả của cuộc bầu cử.", "eng": "Commentators are still dissecting the election results."}, {"viet": "Hãy cắm phích của tủ lạnh vào nguồn điện đi.", "eng": "Connect the fridge up to the electricity supply."}, {"viet": "Trên đường về nhà bạn ghé qua được không?", "eng": "Could you call by on your way home?"}, {"viet": "Chị có thể buộc dùm chiếc tạp dề này quanh người em được không?", "eng": "Could you tie this apron round me?"}, {"viet": "Bố ơi, bố có biết làm món đó không?", "eng": "Dad, do you know how to make it?"}, {"viet": "Chuyển giao tài sản của mình cho các con của mình.", "eng": "Deliver over one's property to one's children."}, {"viet": "Triển khai một hệ thống ký hiệu mới và đơn giản hơn.", "eng": "Develop a new and simpler notation."}, {"viet": "Bạn có chơi đàn piano khi còn nhỏ không?", "eng": "Did you play the piano when you were a child?"}, {"viet": "Phát những cuốn sách cho từng học sinh trong lớp.", "eng": "Distribute the books among the class."}, {"viet": "Tất cả bọn họ đều nhảy múa điệu cầu mưa giống nhau phải không?", "eng": "Do they all dance the same rain dance?"}, {"viet": "Anh đặt mua tờ Thời Báo hay tờ Người Bảo Vệ?", "eng": "Do you get The Times or the Guardian?"}, {"viet": "Bà có tờ khai hải quan không?", "eng": "Do you have your customs declaration?"}, {"viet": "Ông có phiền nếu tôi bật ghế ra sau không?", "eng": "Do you mind if I recline my seat?"}, {"viet": "Bạn có nghĩ là lễ Giáng Sinh bị thương mại hóa hầu như ở mọi nơi trên thế giới không?", "eng": "Do you think that Christmas is too commercialized almost everywhere in the world?"}, {"viet": "Những văn kiện công chúng không được xem.", "eng": "Documents not accessible to the public."}, {"viet": "Đừng có cãi mẹ của bạn.", "eng": "Don't argue with your mother."}, {"viet": "Đừng quên đóng cửa cẩn thận.", "eng": "Don't forget to close the door properly."}, {"viet": "Đừng có đụng vào bà ấy, bà ta có tính đanh đá lắm đấy.", "eng": "Don't mess with her: she's got a violent temper."}, {"viet": "Đừng đụng cái đĩa đó-nóng lắm đấy!", "eng": "Don't touch that dish-it's very hot!"}, {"viet": "So sánh giữa A và B.", "eng": "Draw a parallel between A and B."}, {"viet": "Mỗi tầng chỉ là một lớp bêtông dày.", "eng": "Each floor is a simple thickness of concrete."}, {"viet": "Tàu của địch quân đã được phát hiện trên màn hình rađa.", "eng": "Enemy ships were detected on the radar screen."}, {"viet": "Ngay cả những chuyên gia cũng cho rằng bức tranh đó là của Van Gogh thật.", "eng": "Even the experts took the painting for a genuine Van Gogh."}, {"viet": "Ngoại trừ tượng nữ thần Tự Do, tất cả những nơi này đều nằm ở một khu của thành phố, đó là Manhattan, dường như là một hòn đảo của những toà nhà chọc trời.", "eng": "Except for the Statue of Liberty, all these places are in one part of the city, that is, Manhattan, which seems to be an island of skyscrapers."}, {"viet": "Không vừa lòng của ai về điều gì.", "eng": "Express one's displeasure at something."}, {"viet": "Nỗi lo sợ lan nhanh ra khắp làng.", "eng": "Fear spread quickly through the village."}, {"viet": "Tìm đúng nghề của mình trong cuộc sống.", "eng": "Find one's true vocation in life."}, {"viet": "Sự nịnh hót có thể làm cho bản ngã của con người khiêm tốn nhất cũng có thể tự cao tự đại.", "eng": "Flattery that would inflate the most modest person's ego."}, {"viet": "Theo ý tôi, ý kiến của Ann hay hơn ý kiến của Mary.", "eng": "For my money, Ann's idea is better than Mary's."}, {"viet": "Sự tự do không nhất thiết hàm ý trách nhiệm.", "eng": "Freedom does not necessarily imply responsibility."}, {"viet": "Linh dương có thể chạy với tốc độ đáng kinh ngạc.", "eng": "Gazelles can move with astonishing velocity."}, {"viet": "Cho một đứa bé cưỡi trên vai mình.", "eng": "Give a child a ride on one's shoulders."}, {"viet": "Những con số thống kê đen tối đã gieo rắc hoang mang trên thị trường chứng khoán.", "eng": "Gloomy statistics which inspired panic in the stock market."}, {"viet": "Bị bắt vì lái xe trên 100 dặm Anh một giờ trên xa lộ.", "eng": "Got caught doing a ton on the motorway."}, {"viet": "Bây giờ các em hãy nộp bài thi.", "eng": "Hand in your examination papers now, please."}, {"viet": "Họ đã làm lành với nhau chưa?", "eng": "Have they made it up yet?"}, {"viet": "Bác có bao giờ dùng thử món ăn của Nhật chưa?", "eng": "Have you ever tried Japanese food?"}, {"viet": "Bạn có nghĩ đến việc thuê một căn hộ có hai tầng không?", "eng": "Have you thought about renting a duplex?"}, {"viet": "Anh ta là công nhân xì sơn ở trong nhà máy địa phương.", "eng": "He's a paint sprayer in the local factory."}, {"viet": "Hắn đã đánh cắp tiền trong thùng đựng tiền.", "eng": "He's been pinching money from the cash box."}, {"viet": "Hôm nay anh ta lại lên cơn giận.", "eng": "He's in one of his moods today."}, {"viet": "Anh ta dễ xúc cảm đến mức cô ta đã dễ dàng tranh thủ được cảm tình của anh.", "eng": "He's so susceptible that she easily gained his affections."}, {"viet": "Anh ta thêm chữ ký của mình vào bản kiến nghị.", "eng": "He added his signature to the petition."}, {"viet": "Vì tới quá muộn nên nó làm hỏng hết các kế hoạch của tôi.", "eng": "He ballsed up all my plans by being so late."}, {"viet": "Nó chôn của cải để tránh bị phát hiện ra.", "eng": "He buried the treasure to prevent its discovery."}, {"viet": "Anh ta đã trích dẫn nhiều nguồn tài liệu cho cuốn sách của mình.", "eng": "He cited many sources for his book."}, {"viet": "Anh ấy làm rách mặt khi đang cạo râu.", "eng": "He cut himself during his face shaving."}, {"viet": "Ông ta bảo vệ sự vô tội của mình cho đến lúc trút hơi thở cuối cùng.", "eng": "He died protesting his innocence to the last."}, {"viet": "Anh ta tận hưởng từng giây phút của ngày nghỉ.", "eng": "He enjoyed every minute of his holiday."}, {"viet": "Anh ấy nghĩ rằng kế hoạch đó không khôn ngoan.", "eng": "He felt the plan was unwise."}, {"viet": "Anh ấy vặn cánh tay tôi một cái.", "eng": "He gave my arm a twist."}, {"viet": "Anh ta ấm ức vì cô ta kiếm nhiều tiền hơn mình.", "eng": "He grudges her earning more than he does."}, {"viet": "Nó không đủ nhanh trí để nhận ra sự nguy hiểm.", "eng": "He hadn't the wits enough to realize the danger."}, {"viet": "Anh ta đã bắt đầu một cuốn sách mới.", "eng": "He has begun a new book."}, {"viet": "Ông ta có hai người anh đều sống ở Luân Đôn.", "eng": "He has two brothers: both live in London."}, {"viet": "Hắn ta là người không thật thà.", "eng": "He is a man without a soul."}, {"viet": "Ông ta là một trong những giám khảo môn khoa học.", "eng": "He is one of the science examiners."}, {"viet": "Anh ta chỉ ngồi nhìn chăm chăm vào khoảng không.", "eng": "He just sat gazing into space."}, {"viet": "Anh ta thích ra ngoài nhậu nhẹt với bạn bè.", "eng": "He likes to go out boozing with his mates."}, {"viet": "Khi công việc không ổn hắn ta thích nói Tao đã bảo mà!", "eng": "He loves to say I told you so! when things go wrong!"}, {"viet": "Cụ ấy xấp xỉ chín mươi tuổi.", "eng": "He must be going on for ninety."}, {"viet": "Hắn nợ tiền chúng tôi, nhưng hắn không chịu nhả ra để trả.", "eng": "He owes us money, but he won't cough it up."}, {"viet": "Anh ta ấn các ngón tay lên đất sét vào đúng những chỗ cần tạo để ép nó thành hình mong muốn.", "eng": "He presses his thumbs and fingers into the clay in just the right places to push it into the shape he wants."}, {"viet": "Nó chạy trước, những người khác chạy theo sát gót.", "eng": "He ran ahead, with the others hard on his heels."}, {"viet": "Anh ta đã giao linh hồn của anh ta cho Thượng đế.", "eng": "He rendered up his soul to God."}, {"viet": "Anh ta là phóng viên tờ Sài Gòn.", "eng": "He's a journalist on the Saigon."}, {"viet": "Hắn ta bẩn thỉu và lại còn hôi hám nữa chứ.", "eng": "He's dirty and what's more he smells."}, {"viet": "Anh ta không có họ hàng gì với tôi.", "eng": "He's no relation to me."}, {"viet": "Ông ấy rất kín miệng về chuyện gia đình của mình.", "eng": "He's very cagey about his family."}, {"viet": "Ông ta nhìn kỹ chân trời để tìm kiếm đất liền.", "eng": "He scanned the horizon, looking for land."}, {"viet": "Nó chỉ cần qua được kỳ thi này.", "eng": "He should just about get by in the exam."}, {"viet": "Anh ta nói tiếng Anh và tiếng Việt dễ dàng như nhau.", "eng": "He speaks English and Vietnamese with equal ease."}, {"viet": "Ông vẫn còn thời giờ để nghiên cứu thiên văn học.", "eng": "He still had time to study astronomy."}, {"viet": "Nó súc miệng bằng nước sát trùng.", "eng": "He swilled his mouth out with antiseptic."}, {"viet": "Ông ấy đã nói với tôi rằng ông ấy sẽ ghé đến lúc nào đó vào tuần sau.", "eng": "He told me he'd drop in sometime next week."}, {"viet": "Anh ta thử rất nhiều nghề, cuối cùng trở thành một bưu tá.", "eng": "He tried many different jobs, in the end he became a postman."}, {"viet": "Trước đây anh ta để râu để ria nhưng bây giờ thì mày râu nhẵn nhụi.", "eng": "He used to have a moustache and beard, but now he's clean-shaven."}, {"viet": "Anh ta là một người mệt mỏi sau chuyến leo núi dài trở về.", "eng": "He was a tired man when he got back from that long climb."}, {"viet": "Anh ta sinh ra là để trở thành đại văn hào.", "eng": "He was born to be a great writer."}, {"viet": "Hắn ta mặc khá chỉnh tề cho khác mọi khi.", "eng": "He was dressed quite presentably for a change."}, {"viet": "Anh ta bị sắc đẹp của nàng mê hoặc.", "eng": "He was hypnotized by her beauty."}, {"viet": "Ông ấy là một trong những nhân vật chính trị hàng đầu của nước này.", "eng": "He was one of the leading political figures of this country."}, {"viet": "Anh ta không dao động trong quyết tâm bỏ hút thuốc lá.", "eng": "He was single-minded in his determination to stop smoking."}, {"viet": "Ông ta cảm động vì sự tiếp đón nồng nhiệt của họ.", "eng": "He was touched by the warmth of their welcome."}, {"viet": "Nó tiếp tục học đến tận khuya.", "eng": "He went on studying deep into the night."}, {"viet": "Anh ấy đeo một sợi dây chuyền vàng trên cổ.", "eng": "He wore a gold chain round his neck."}, {"viet": "Những điều chỉ trích thù nghịch trên báo chí đã khiến cho vị thượng nghị sĩ phải từ chức.", "eng": "Heat from the press forced the senator to resign."}, {"viet": "Thái độ ngạo mạn của cô ta ở toà án đã làm cho đối thủ hoàn toàn rối trí.", "eng": "Her arrogant behaviour on court psyched her opponent completely."}, {"viet": "Lời bình luận của cô ta về chính sách tương lai đưa vào biên bản buổi họp một giọng điệu không phù hợp.", "eng": "Her comments on future policy introduced a jarring note on the proceedings."}, {"viet": "Mắt của cô ấy rất tốt cô ấy có thể nhìn thấy một con tàu từ ngoài biển xa.", "eng": "Her eyesight is so good that she can see a ship far out in the sea."}, {"viet": "Việc học tập tích cực của cô ta đã góp phần đem lại vinh dự cho nhà trường.", "eng": "Her hard work redounds to the honour of the school."}, {"viet": "Cuốn tiểu thuyết mới nhất của cô ta đã được in tới ba lần.", "eng": "Her latest novel has already run to three impressions."}, {"viet": "Tính cao thượng của cô ta làm cho cô ta được thán phục nhiều.", "eng": "Her nobility of character made her much admired."}, {"viet": "Sự đọc của cô bé đã tiến bộ rất nhiều từ khi cô ta chuyển trường.", "eng": "Her reading has improved greatly since she changed schools."}, {"viet": "Tinh thần của nàng suy sụp vì cái tin buồn đó.", "eng": "Her spirits fell at the bad news."}, {"viet": "Công việc của cô ta khá hơn những người khác.", "eng": "Her work is a cut above that of the others."}, {"viet": "Mức lãi suất quá cao khiến cho việc mua chịu trở nên đắt.", "eng": "High interest rates make credit expensive."}, {"viet": "Thái độ đối với tình dục của anh ta bị méo mó bởi lối giáo dục nghiêm ngặt.", "eng": "His attitude to sex is coloured by his strict upbringing."}, {"viet": "Thời thơ ấu của anh ấy đã bị dồn nén và cô độc.", "eng": "His childhood was repressed and solitary."}, {"viet": "Khoản quyên góp là bằng chứng hùng hồn về tính hào phóng của anh ta.", "eng": "His donation speaks volumes for his generosity."}, {"viet": "Cha anh ta đang ở trên khán đài.", "eng": "His father is in the stands."}, {"viet": "Sức khoẻ của anh ấy không tốt.", "eng": "His health is not good."}, {"viet": "Tiếng cười của anh ta vang lên trong vách đá.", "eng": "His laughter resonated among the rocks."}, {"viet": "Thần kinh của anh ta căng thẳng khi anh ta bước vào phòng.", "eng": "His nerves were jangling as he walked into the room."}, {"viet": "Chính đảng của ông ta không nắm chính quyền trong nhiều năm.", "eng": "His political party has been out of office for many years."}, {"viet": "Quyển tiểu thuyết thứ hai của ông ấy đã củng cố danh tiếng nhà văn của ông.", "eng": "His second novel established his fame as a writer."}, {"viet": "Lời đề nghị của ông ta được chào đón bằng những tiếng cười ồ phản đối.", "eng": "His suggestion was greeted with hoots of laughter."}, {"viet": "Bà vợ ông ta tặc lưỡi khó chịu.", "eng": "His wife tut-tutted with annoyance."}, {"viet": "Chén thánh đã hiện đến với ông ta trong lúc suy niệm.", "eng": "Holy Grail appeared to him in the form of a vision."}, {"viet": "Đi bộ một tí được chứ?", "eng": "How about going for a walk?"}, {"viet": "Sao anh lại ủng hộ một con người có tác phong như vậy?", "eng": "How could you countenance such behavior?"}, {"viet": "Bạn thấy sống ở đây thế nào?", "eng": "How do you like living here?"}, {"viet": "Anh ấy giữ chức vụ bao lâu rồi?", "eng": "How long has he held office?"}, {"viet": "Anh lấy mấy miếng vào nước chè?", "eng": "How many lumps do you take in your tea?"}, {"viet": "Ở nước bạn xem một bộ phim tốn bao nhiêu tiền?", "eng": "How much does it cost to see a movie in your country?"}, {"viet": "Cách hỏi thông tin trước khi hạ cánh.", "eng": "How to ask for information before landing."}, {"viet": "Đạo đức giả là nói một đằng nghĩ một nẻo.", "eng": "Hypocrisy is saying one thing and thinking another."}, {"viet": "Tôi muốn ở đây 5 đêm và trả phòng vào sáng thứ bảy.", "eng": "I'd like to stay five nights and check out Saturday morning."}, {"viet": "Tôi sẽ lấy một cái bóng đèn 40 oát đế thay cho bà.", "eng": "I'll get a 40-watt bulb and change it for you."}, {"viet": "Trên đường về nhà con sẽ mua một ít bánh ngọt cho mẹ.", "eng": "I'll pick up some cake for you on the way home."}, {"viet": "Tôi e rằng không thể giúp bà ngay lúc này được-tôi quá bận.", "eng": "I'm afraid I can't help you just at present-I'm too busy."}, {"viet": "Tôi thấy buổi liên hoan này hết sức buồn tẻ.", "eng": "I'm finding this party extremely dull."}, {"viet": "Do được chủng ngừa nên tôi có khả năng kháng lại bệnh đậu mùa.", "eng": "I'm immune to smallpox as a result of vaccination."}, {"viet": "Tôi không ngạc nhiên về chuyện nó không làm xong bài thi, một nửa thời gian nó cứ ngồi nhìn ra ngoài cửa sổ.", "eng": "I'm not surprised he didn't complete the exam, he spent half the time looking out of the window."}, {"viet": "Tôi xin lỗi tôi quên mất ngày sinh của anh, tôi đền bù cho anh như thế nào đây?", "eng": "I'm sorry I forgot about your birthday, how can I make amends to you?"}, {"viet": "Tôi chán ngấy những lời phàn nàn không ngớt của anh ta.", "eng": "I'm tired of his everlasting complaints."}, {"viet": "Tôi đang tập chạy bộ nhiều để có thân hình khoẻ mạnh.", "eng": "I've been jogging a lot to get myself into shape."}, {"viet": "Tôi có đến một nghìn lẻ một chuyện phải làm.", "eng": "I've got a thousand and one things to do."}, {"viet": "Chưa bao giờ tôi phải chịu một buổi sáng tồi tệ như hôm nay.", "eng": "I've never had a worse morning than today."}, {"viet": "Tối nay tôi sẽ lau dọn kĩ lưỡng chạn bếp.", "eng": "I'll do out the kitchen cupboards tonight."}, {"viet": "Tôi luôn nghĩ \"càng rộng càng tốt\".", "eng": "I always thought, \"the wider the better\"."}, {"viet": "Tôi là đại diện của Công ty ABC.", "eng": "I am the representative of ABC Company."}, {"viet": "Xin ông thôi đi nha, người phụ nữ mà ông lăng nhục chẳng may lại là vợ tôi đấy.", "eng": "I beg your pardon but the woman you're insulting happens to be my wife."}, {"viet": "Tôi không tìm thấy tệp về công ty của ông vì tôi đã quên mất mã số rồi.", "eng": "I can't access the file on your company because I've forgotten the code."}, {"viet": "Tôi không thể chơi quần vợt tuần này với anh được-tôi đã bị ra rìa vì trật mắt cá chân rồi.", "eng": "I can't play you at squash this week-I'm hors de combat with a twisted ankle."}, {"viet": "Tôi khó lòng phân biệt hai anh em.", "eng": "I can hardly distinguish between the two brothers."}, {"viet": "Tôi không thể tìm được người thuê căn nhà của tôi.", "eng": "I can't get a let for my house."}, {"viet": "Tôi tiếp tục làm việc, trong lúc đó anh ta đi mua hàng.", "eng": "I continued working, meantime, he went out shopping."}, {"viet": "Tốt hơn là tôi nên gác điện thoại.", "eng": "I'd better get off the phone."}, {"viet": "Tôi làm việc vậy tôi cũng phải có phần.", "eng": "I did my share of the work, and I want my share of the action."}, {"viet": "Tôi không hành động trừ phi do một người thứ ba thúc đẩy.", "eng": "I do not move unless it be under the impulsion of a third party."}, {"viet": "Tôi không biết ai làm món ăn này, nhưng quả là một bữa cơm tồi tệ như cho chó ăn.", "eng": "I don't know who designed this course, but it's a real dog's dinner."}, {"viet": "Tôi nghĩ là không còn lại chiếc vé nào.", "eng": "I don't think there are any tickets left."}, {"viet": "Tôi không gọi như thế là sống.", "eng": "I don't call that living."}, {"viet": "Tôi rút đĩa hát ra khỏi bao.", "eng": "I drew the record out of its sleeve."}, {"viet": "Tôi cảm thấy như thể đầu tôi sắp nổ tung.", "eng": "I feel like my head is about to explode."}, {"viet": "Tôi nhận thấy rằng thật thà sẽ được đền bù.", "eng": "I find that it pays to be honest."}, {"viet": "Anh đến đó khoảng một tuần một lần.", "eng": "I go about once a week."}, {"viet": "Tôi hồ như cảm thấy là việc này có thể xảy ra.", "eng": "I had a kind of feeling this might happen."}, {"viet": "Tôi phải chạy vắt giò lên cổ để bắt kịp xe buýt.", "eng": "I had to run like anything to catch the bus."}, {"viet": "Tôi là con bệnh của bác sĩ Smith trong nhiều năm.", "eng": "I have been a patient of Dr Smith for many years."}, {"viet": "Tôi chẳng có gì phải tự trách mình.", "eng": "I have nothing to reproach myself for."}, {"viet": "Tôi không thể kiếm được cuốn sách này.", "eng": "I haven't been able to obtain this book."}, {"viet": "Tôi nghe nói anh đang tính đến chuyện thôi việc.", "eng": "I hear you are meditating giving up your job."}, {"viet": "Anh mong là chúng không chóng tàn.", "eng": "I hope they don't die soon."}, {"viet": "Tôi vừa mới làm xong một mẻ bánh quy mới ra lò.", "eng": "I just finished making a fresh batch of cookies."}, {"viet": "Tôi biết trái cây xanh có nghĩa là chúng chưa chín, nhưng trông chúng không hấp dẫn lắm.", "eng": "I know when fruit is green it means it isn't ripe yet, but it does not look appealing."}, {"viet": "Tôi thích xem những trận đấu bóng chày.", "eng": "I like to watch baseball games."}, {"viet": "Cháu sẽ tự chuẩn bị bữa ăn trưa cho mình.", "eng": "I'll fix my own lunch."}, {"viet": "Tôi sẽ nói chuyện với bạn sau.", "eng": "I'll talk to you later."}, {"viet": "Tôi rất mê các động cơ hơi nước.", "eng": "I'm crazy about steam-engines."}, {"viet": "Tôi đang tìm Ngân hàng ABC.", "eng": "I'm looking for the ABC Bank."}, {"viet": "Tôi đang bắt đầu lên cân.", "eng": "I'm starting to gain weight."}, {"viet": "Tôi gặp cô ấy hoàn toàn do tình cờ.", "eng": "I met her quite by chance."}, {"viet": "Tôi phải nhấn mạnh sự cần thiết giữ bí mật tuyệt đối dự án đó.", "eng": "I must stress the need for absolute secrecy about the project."}, {"viet": "Tôi không hề hoài nghi là anh đã lấy vợ.", "eng": "I never suspected for a minute that you were married."}, {"viet": "Tôi gọi điện cho Sally nhưng cô ấy đi vắng.", "eng": "I phoned Sally but she was out."}, {"viet": "Tôi đọc chuyện ấy trên báo.", "eng": "I read about it in the newspaper."}, {"viet": "Tôi buông tay ra và nó chạy biến.", "eng": "I released my grip and he ran away."}, {"viet": "Tôi đã trông thấy lỗi đúng vào lúc cô ta mắc phải.", "eng": "I saw the mistake at the very same moment that she did."}, {"viet": "Tôi sẽ đợi ở nhà hàng.", "eng": "I shall wait in the restaurant."}, {"viet": "Tôi ngã xuống thang gác trẹo mắt cá chân.", "eng": "I sprained my ankle falling downstairs."}, {"viet": "Tôi chấp nhận ý kiến của anh, nhưng quan điểm của tôi về vấn đề đó vẫn y như cũ.", "eng": "I take your point, but my views on the matter remain the same."}, {"viet": "Tôi nghĩ nó không có ích.", "eng": "I think it's of no use."}, {"viet": "Tôi nghĩ tình trạng của ông liên quan nhiều đến cách sống hay thói quen của ông.", "eng": "I think your condition has a lot to do with your way of life or habits."}, {"viet": "Tôi lo lắng khi nghĩ đến hậu quả.", "eng": "I tremble to think of the result."}, {"viet": "Tôi thường đi tắt ngang qua công viên trên đường về nhà.", "eng": "I usually cut through the park on my way home."}, {"viet": "Tôi muốn nổi tiếng-tôi chán làm một người bình thường rồi.", "eng": "I want to be famous-I'm tired of being a nobody."}, {"viet": "Tôi rất muốn nói với cô giáo rằng cô rất ngốc nhưng tôi đã im lặng.", "eng": "I wanted to tell the teacher she was stupid but I held my tongue."}, {"viet": "Tôi hoàn toàn quyết tâm gặp hắn.", "eng": "I was fully resolved to see him."}, {"viet": "Tôi được đưa đến gặp ông giám đốc sở điều tra.", "eng": "I was referred to the manager office."}, {"viet": "Tôi rất vinh dự được ngài mời nói chuyện tại hội nghị đó.", "eng": "I was very flattered by your invitation to talk at the conference."}, {"viet": "Tôi sẽ không tán đồng về những sự lầm tưởng tầm thường như vậy.", "eng": "I will not subscribe to popular fallacies."}, {"viet": "Tôi đoạt giải thưởng về luận văn, rồi lại được cấp học bổng: thành công này đưa đến thành công khác!", "eng": "I won the essay prize, then was offered a scholarship: nothing succeeds like success!"}, {"viet": "Tôi cho rằng nó đã quên'.'Tôi dám nói như vậy!", "eng": "I would imagine he's forgotten I dare say!'!"}, {"viet": "Tôi không bao giờ có ý xúc phạm anh ta.", "eng": "I would never wittingly offend him."}, {"viet": "Nếu một nghị sĩ muốn phát biểu về một công ty mà ông ta có quan hệ, ông ta phải nói rõ quan hệ cá nhân của mình.", "eng": "If a Member of Parliament wishes to speak about a company with which he is connected, he must declare his interest."}, {"viet": "Nếu tôi được phép nói chen vào cuộc thảo luận một điểm cần thận trọng.", "eng": "If I may interject a note of caution into the discussion."}, {"viet": "Nếu trong cửa hàng trái cây vẫn còn xanh, có nghĩa là chúng ở đó chưa lâu lắm.", "eng": "If the fruit is still green in the store, it means it hasn't been there a long time."}, {"viet": "Nếu đi đường vòng chúng ta sẽ tránh được trung tâm thành phố.", "eng": "If we take the bypass we'll avoid the town centre."}, {"viet": "Nếu anh quyết định tiến hành thông báo xây dựng lại xin hãy thông báo cho chúng tôi biết?", "eng": "If you decide to go ahead with the rebuilding scheme, can you give us some notification?"}, {"viet": "Nếu anh cho tôi vay 2 bảng Anh, tôi sẽ trả lại anh số tiền đó vào ngày mai.", "eng": "If you lend me £ 2, I'll repay it to you tomorrow."}, {"viet": "Nếu anh muốn vào hội thì lệ phí gia nhập là 20 pao và tiền niên liễm là 10 pao.", "eng": "If you want to join, there's an entrance fee of 20 pounds and an annual membership fee of 10 pounds."}, {"viet": "Thật lạ lùng, cô ấy dường như đã danh giá hơn bởi sự khổ đau mà cô đã trải qua.", "eng": "In a strange way she seemed ennobled by the grief she had experienced."}, {"viet": "Thật ra thì chỉ còn 500 tá mẫu đó trong kho và chúng tôi biết là nhà sản xuất gần đây đã ngưng sản xuất loạt sản phẩm này.", "eng": "In fact, there are only 500 dozen of the model in stock and we know that the manufacturer cut the product line recently."}, {"viet": "Ở New York, như khắp mọi nơi trên Trái Đất, ngày đầu tiên của mùa xuân dài 12 tiếng.", "eng": "In New York, as all over the Earth, the day is 12 hours long on the first day of spring."}, {"viet": "Cuối cùng tham vọng của anh ta là nguyên nhân thất bại của anh ta.", "eng": "In the end his ambition was his undoing."}, {"viet": "Ở trong nước này tiếng Anh là phương tiện dạy học.", "eng": "In this country English is the medium of instruction."}, {"viet": "Những sai lầm ban đầu đề ra kế hoạch lại càng gây thêm tác hại vì sự cẩu thả trong việc thực hiện kế hoạch.", "eng": "Initial planning errors were compounded by carelessness in carrying the plan out."}, {"viet": "Có thể đổi một phòng lớn hơn không?", "eng": "Is it possible to change to something larger?"}, {"viet": "Có chỗ nào đáng xem ở thành phố này không?", "eng": "Is there any place worth seeing in this city?"}, {"viet": "Các vấn đề này hiện nay còn có ý nghĩa quan trọng hơn nữa.", "eng": "Issues now assume even greater importance."}, {"viet": "Luật pháp không cho phép lái xe quá nhanh.", "eng": "It's against the law to drive too fast."}, {"viet": "Anh chế nhạo họ thì dễ thôi nhưng liệu anh có thể làm được hơn thế không?", "eng": "It's easy enough for you to gibe at them, but could you do any better?"}, {"viet": "Ở đây nóng như một cái lò-chúng tôi mở một cửa sổ ra có được không?", "eng": "It's like a furnace in here-can we open a window?"}, {"viet": "Không có chuyện gì phải làm ầm ĩ.", "eng": "It's nothing to make a song and dance about."}, {"viet": "Đó là một loại phim đưa ra mặt tồi tệ nhất của bản chất con người.", "eng": "It's the kind of movie that carters to the worst side of human nature."}, {"viet": "Nó còn giữ cho cơ thể chúng ta ở nhiệt độ thích hợp và giúp giải phóng một số loại chất thải.", "eng": "It also helps keep our bodies the right temperature, and it gets rid of some waste."}, {"viet": "Qua thống kê người ta đã chứng minh rằng...", "eng": "It has been proved statistically that..."}, {"viet": "Nó ở hay đi, điều đó ( đối với tôi ) không quan trọng.", "eng": "It is immaterial ( to me ) whether he stays or leaves."}, {"viet": "Đó là những thứ thuốc người ta thích dùng cho loại bệnh này.", "eng": "It is the drug of choice for this type of illness."}, {"viet": "Chắc là tại gió nên trời mới lạnh như vậy.", "eng": "It must be the wind that makes it so cold."}, {"viet": "Nó ở tầng trệt phải không?", "eng": "It's on the ground floor?"}, {"viet": "Tôi thấy hình như chỉ có hai sự lựa chọn mở ra cho cô ta mà thôi.", "eng": "It seems to me that there are only two options open to her."}, {"viet": "Đó quả là chiến thắng lẫy lừng khi đội chúng ta thắng trong cuộc đua.", "eng": "It was a great triumph when our team won the race."}, {"viet": "Tham vọng mãnh liệt của cô ấy là trở thành một kiến trúc sư.", "eng": "It was her consuming ambition to become an architect."}, {"viet": "Ít nhất là tôi có thể làm được điều đó.", "eng": "It was the least I could do."}, {"viet": "Thật là không khôn ngoan nếu từ bỏ công việc đang làm trước khi có được được công việc khác.", "eng": "It would be imprudent to resign from your present job before you are offered another."}, {"viet": "Jeff có thói quen đi bộ sau bữa ăn tối.", "eng": "Jeff was in the habit of taking a walk after dinner."}, {"viet": "Loay hoay sắp đặt thời gian biểu của mình để cho khớp với các lớp học thêm.", "eng": "Juggling with one's timetable to fit in the extra classes."}, {"viet": "Thưa quý vị, tôi xin đề nghị nâng ly chúc mừng thầy của chúng ta, thầy George Green, nhân dịp sinh nhật lần thứ bốn mươi của thầy!", "eng": "Ladies and gentlemen, I wish to propose a toast to our teacher, Mr. George Green, on the occasion of his fortieth birthday!"}, {"viet": "Thả tôi ra! anh ta rít lên một cách lo lắng.", "eng": "Let go of me! he squeaked nervously."}, {"viet": "Này Bill, thỉnh thoảng con người tôi cũng cần loại phim như vậy.", "eng": "Listen, Bill, I'm a man who needs a movie like that from time to time."}, {"viet": "Nhiều bài tụng ca cổ được hát với lời mới.", "eng": "Many of the old ballads are sung to new words."}, {"viet": "Martin Luther King coi mình là môn đệ của Gandhi.", "eng": "Martin Luther King considered himself a disciple of Gandhi."}, {"viet": "Tôi có thể gọi món đem về đây được không?", "eng": "May I order a takeout here?"}, {"viet": "Cô Miller, mời cô phát biểu về vấn đề này?", "eng": "Miss Miller, why don't you take it from here?"}, {"viet": "Mẹ đã đồng ý cho phép chúng tôi đi dự tiệc, nhưng đến đoạn ở lại qua đêm thì bà kiên quyết phản đối.", "eng": "Mother let us go to the party, but when it came to staying overnight, she put her foot down firmly."}, {"viet": "Cô em gái bé nhỏ của mình không bao giờ khóc trừ phi nó đói.", "eng": "My baby sister never cries unless she is hungry."}, {"viet": "Bố tôi sẽ nổi trận lôi đình nên tôi phải về nhà thôi.", "eng": "My father is going to have a fit so I'm going home."}, {"viet": "Trí óc tôi lộn trở về với lễ Giáng sinh năm ngoái.", "eng": "My mind flashed back to last Christmas."}, {"viet": "Con trai tôi nói thuốc này có thể làm hạ huyết áp của tôi.", "eng": "My son said that it might lower my blood pressure."}, {"viet": "Đừng bao giờ giao phó sơ mi lụa cho máy giặt tự động.", "eng": "Never leave a silk shirt to the tender mercies of an automatic washing-machine."}, {"viet": "Không, không sao, nhưng bạn sẽ được thực hành cho quen nếu bạn tự gọi lấy phải không?", "eng": "No, I don't mind, but it would be good practice for youI do it yourself, wouldn't it?"}, {"viet": "Không ai ngoài thủ thư được xem những bản thảo này.", "eng": "No one except the librarian has access to these manuscripts."}, {"viet": "Hai bạn đã kết hôn bao nhiêu năm rồi?", "eng": "Now many years have you two been married?"}, {"viet": "Tất nhiên là ông biết cô dâu.", "eng": "Of course you know the bride."}, {"viet": "OK, Bây giờ xin hãy cho tôi xem hộ chiếu của ông và “ bản sao của người mua ”.", "eng": "OK, Now show me your passport and the'Purchaser's Copy', please."}, {"viet": "Trước đây có lúc rất hiếm, ngày nay chúng được sử dụng rộng rãi.", "eng": "Once quite rare, they are now in general use."}, {"viet": "Một trong những phúc lợi của công việc này là bảo hiểm sức khoẻ không mất tiền.", "eng": "One of the fringe benefits of this job is free health insurance."}, {"viet": "Nên áp dụng lại tiền thưởng nhân dịp lễ Nôen.", "eng": "Our Christmas bonus should be restored."}, {"viet": "Cuộc hành trình của chúng tôi trôi qua một cách dễ chịu vì những cuộc trò chuyện hào hứng.", "eng": "Our journey was beguiled with spirited talk."}, {"viet": "Thầy giáo chúng tôi luôn luôn để ý đến cách chấm câu.", "eng": "Our teacher has a bee in his bonnet about punctuation."}, {"viet": "Các bậc cha mẹ cần can ngăn con mình đừng hút thuốc.", "eng": "Parents should discourage their children from smoking."}, {"viet": "Người ta bị đau ngực trong không khí đầy khói của thành phố lớn.", "eng": "People developed chest complaints in the smoky atmosphere of the big city."}, {"viet": "Cho phép tôi giới thiệu ông D với cô.", "eng": "Please allow me to introduce Mr. D to you."}, {"viet": "Đá quý được chạm vào cây thông và cây bách.", "eng": "Precious stones were carved into pines and cypresses."}, {"viet": "Này, có lẽ em sẽ thử xem sao!", "eng": "Say, maybe I should try it!"}, {"viet": "Tôi sẽ giúp cô mang vật nặng đó chứ?", "eng": "Shall I help you carry that load?"}, {"viet": "Bà ta đúng là một mệnh phụ-không bao giờ tỏ ra nóng nảy.", "eng": "She's a real lady-never loses her temper."}, {"viet": "Cô ấy quyết định bắt đầu đi dạy lại.", "eng": "She's decided to go back to teaching."}, {"viet": "Cho đến nay cô ta đã sống ở miền tây được mười năm.", "eng": "She's lived in the west for ten years now."}, {"viet": "Cô ấy vẫn còn đang đợi một người chồng tuyệt vời đến với mình.", "eng": "She's still waiting for Mr. Right to come along."}, {"viet": "Cô ấy khẳng định là cô ấy nói thật.", "eng": "She affirmed that she was telling the truth."}, {"viet": "Bà ấy xây nhà không cần biết tốn kém bao nhiêu.", "eng": "She built the house without regard to cost."}, {"viet": "Cô ấy học xong ở Thuỵ sĩ.", "eng": "She completed her education in Switzerland."}, {"viet": "Bà ấy miêu tả trong tự truyện của mình một cuộc viếng thăm nước Nga năm 1909.", "eng": "She describes in her autobiography a visit to Russia in 1909."}, {"viet": "Bà ta làm anh ấy bối rối vì sỉ nhục anh ta trước bạn bè.", "eng": "She embarrassed him in front of his friends with taunt."}, {"viet": "Cô ta thấy các kế hoạch của cô lúc nào cũng thất bại.", "eng": "She found her plans frustrated at every turn."}, {"viet": "Cô ta bị có chửa và đã bị bố mẹ của cô đuổi ra khỏi nhà.", "eng": "She got pregnant and was turned out of the house by her parents."}, {"viet": "Cô ấy phải chen chân qua đám đông để đến sân khấu.", "eng": "She had to press though the throng to reach the stage."}, {"viet": "Cô ấy chẳng hiểu biết gì về sự khó khăn của vấn đề này.", "eng": "She has no notion of the difficulty of this problem."}, {"viet": "Bà ta đã lăng nhục mẹ tôi, cho nên tôi có mối hận phải thanh toán với bà ta.", "eng": "She insulted my mother, so I have an account to settle with her."}, {"viet": "Em gái đó đã mười lăm tuổi mà trình độ hiểu biết như mới ở tuổi lên năm.", "eng": "She is sixteen years old but has a mental age of five."}, {"viet": "Cô ta miễn cưỡng rời nhà ra đi, lòng đầy phiền muộn.", "eng": "She left her home reluctantly and sick at heart."}, {"viet": "Cô kéo câu chuyện vào cuộc trò chuyện.", "eng": "She lugged the story into the conversation."}, {"viet": "Cô ấy hình như không bao giờ phải chịu một phút lo lắng về tiền nong.", "eng": "She never seemed do suffer a moment's anxiety about money."}, {"viet": "Cô ấy ngồi vào gần chỗ lò sưởi ấm.", "eng": "She position herself near the warm fire."}, {"viet": "Cô ta coi lời chỉ trích của bà ấy là thiếu hiểu biết và có thành kiến.", "eng": "She regarded her critics as ignorant and prejudiced."}, {"viet": "Cô ta bận rộn về bài tập làm ở nhà.", "eng": "She's busy with her homework."}, {"viet": "Cô ta chỉ ưa những chuyện ngồi lê đôi mách.", "eng": "She's too fond of idle gossip."}, {"viet": "Bà ta có vẻ khá thân thiện nhưng tôi không thể chấp nhận theo giá trị bề ngoài của bà ấy.", "eng": "She seems friendly enough but I shouldn't take her at face value."}, {"viet": "Cô ta mỉm cười duyên dáng khi nhận hoa.", "eng": "She smiled prettily as she accepted the flowers."}, {"viet": "Cô ta nhét vội lá thư vào túi.", "eng": "She stuffed the letter into her pocket."}, {"viet": "Cô ta kể ngắn gọn điều đã xảy ra.", "eng": "She told them briefly what had happened."}, {"viet": "Bà ta dùng cái tên khi chưa lấy chồng của mình cho những mục đích nghề nghiệp.", "eng": "She uses her unmarried name for professional purposes."}, {"viet": "Bà ta luôn luôn chung thuỷ với chồng.", "eng": "She was always faithful to her husband."}, {"viet": "Cô ấy mặc bộ áo vét và quần dài cực kỳ hấp dẫn.", "eng": "She was dressed in an extremely becoming trouser suit."}, {"viet": "Cô ta đã dẫn đầu một chặng đường đua nhưng cuối cùng về đích thứ tư.", "eng": "She was leading for part of the race but finally finished fourth."}, {"viet": "Người ta thấy cô ấy chạy xa khỏi nơi diễn ra tội ác.", "eng": "She was seen running away from the scene of the crime."}, {"viet": "Cô ấy buồn vì anh ta chẳng nói chuyện với cô.", "eng": "She was upset because he wouldn't talk to her."}, {"viet": "Bà ấy ra bưu điện để lĩnh lương hưu.", "eng": "She went to the post office to collect her pension."}, {"viet": "Cô ta làm việc cho một công ty kỹ thuật.", "eng": "She works for an engineering company."}, {"viet": "Chúng ta nên gọi ông ấy là Ông hay Đức Cha?", "eng": "Should he be styled Mr or Reverend?"}, {"viet": "Tạo ra một chuyến bay giả bằng cách sử dụng một mô hình máy bay trong một đường hầm gió.", "eng": "Simulate flight using a model plane in a wind tunnel."}, {"viet": "Đọc lướt bản tường trình trong nửa giờ.", "eng": "Skim through the report in half an hour."}, {"viet": "Không được phép hút thuốc lá trong toà nhà này.", "eng": "Smoking is prohibited in this building."}, {"viet": "Vậy tiền của các ông cũng dựa vào hệ thống thập phân.", "eng": "So your money is aL based on the decimal system."}, {"viet": "Một số nông dân phải tháo nước ở cánh đồng của họ.", "eng": "Some farmers have to drain their fields."}, {"viet": "Một số người còn dựng lều nữa.", "eng": "Some people have their tents, too."}, {"viet": "Có người trong khán giả bắt đầu cười.", "eng": "Someone in the audience began to laugh."}, {"viet": "Hết súp-chúng tôi chỉ còn nước trái cây.", "eng": "Soup's off-we've only got fruit juice."}, {"viet": "Những hình ảnh các thánh bằng kính nhiều màu.", "eng": "Stained-glass representations of saints."}, {"viet": "Hôm nay giá cổ phiếu đã hạ xuống.", "eng": "Stock prices took a dive today."}, {"viet": "Những sợi bạc trên mái tóc bà ta.", "eng": "Streaks of grey in her hair."}, {"viet": "Thái độ như thế không thể chấp nhận được trong nhóm nhân viên của chúng ta.", "eng": "Such behaviour is not admissible among our staff."}, {"viet": "Hàng tiếp tế được thả dù xuống khu vực bị động đất.", "eng": "Supplies were parachuted into the earthquake zone."}, {"viet": "Ngắm cẩn thận trước khi bắn.", "eng": "Take a careful sight before firing."}, {"viet": "Cây cao làm anh ta không nhìn thấy con đường.", "eng": "Tall trees obstructed his view of the road."}, {"viet": "Kể những câu chuyện tục tĩu đó của hắn.", "eng": "Telling those mucky stories of his."}, {"viet": "Thế thì rất hay, nhưng xe hơi của tôi đem đi bảo trì rồi.", "eng": "That'd be very nice, but my car is out for maintenance."}, {"viet": "Xe ôtô đó chưa bật đèn pha.", "eng": "That car hasn't got its lights on."}, {"viet": "Nói thì dễ hơn là làm đấy.", "eng": "That is easier said than done."}, {"viet": "Cái áo khoác này trông dứt khoát không còn có thể dùng được nữa.", "eng": "That overcoat is looking decidedly past it."}, {"viet": "Ý đó nghe có vẻ tuyệt đấy!", "eng": "That sounds like a great idea!"}, {"viet": "Thế vận hội Olympic 1984 được tổ chức ở Los Angeles.", "eng": "The 1984 ( Olympic ) games was held in Los Angeles."}, {"viet": "Thành lũy Acropolis cao chót vót trong thành phố Athens.", "eng": "The Acropolis dominates the city of Athens."}, {"viet": "Hãng hàng không cho biết tuyến đường này không còn kinh doanh có lãi nữa vì thế họ sẽ ngừng hoạt đông.", "eng": "The airline say this route is no longer economic, so they're going to discontinue it."}, {"viet": "Tuyển tập thơ đó tỏ ra có thiên kiến ưa chuộng các thi sĩ trữ tình.", "eng": "The anthology reveals a prejudice in favour of lyric poets."}, {"viet": "Quân đội bị để trong một vị trí không có gì bảo vệ.", "eng": "The army was left in an exposed position."}, {"viet": "Khán giả mê cuồng trước ngôi sao mới.", "eng": "The audience was bananas over the new star."}, {"viet": "Đứa bé sẽ không chịu ngồi yên tại chỗ lâu để chụp được ảnh.", "eng": "The baby wouldn't stay put long enough for the photo to be taken."}, {"viet": "Những ngân hàng chưa mở cửa.", "eng": "The banks aren't open yet."}, {"viet": "Cửa sổ phòng ngủ trông ra đường.", "eng": "The bedroom windows give on to the street."}, {"viet": "Tiệc sinh nhật là một dịp vui vẻ.", "eng": "The birthday party was a festive occasion."}, {"viet": "Quả bom đó phát nổ do một bộ phận điều khiển từ xa.", "eng": "The bomb was exploded by remote control."}, {"viet": "Hôm nay ông chủ đã la tôi một trận nên thân.", "eng": "The boss really gave me hell today."}, {"viet": "Cành cây đang nhô lên khỏi mặt nước.", "eng": "The brand was sticking up out of the water."}, {"viet": "Thân hình đồ sộ của thanh tra Jones.", "eng": "The bulky figure of Inspector Jones."}, {"viet": "Khả năng toả nhiệt của nhiều nhiên liệu.", "eng": "The calorific properties of various fuels."}, {"viet": "Chiếc xe hơi trước chúng tôi đột ngột rẽ sang trái.", "eng": "The car in front of us suddenly branched off to the left."}, {"viet": "Tôi xin nêu lên là vụ này không có chứng cớ gì.", "eng": "The case, I would submit, is not proven."}, {"viet": "Cái ghế phát ra tiếng kêu răng rắc khi anh ta ngồi lên.", "eng": "The chair gave a groan as he sat down in it."}, {"viet": "Viên thư ký trưởng giám sát công việc trong ban.", "eng": "The chief clerk supervises the work of the department."}, {"viet": "Thằng bé túm lấy váy mẹ nó.", "eng": "The child was plucking at her mother's skirt."}, {"viet": "Bọn trẻ nhảy chồm chồm vì sung sướng.", "eng": "The children jumped up and down with excitement."}, {"viet": "Bọn trẻ đang cãi lộn ( với nhau ) về món đồ chơi mới.", "eng": "The children were wrangling ( with each other ) over the new toy."}, {"viet": "Sự sai lầm điển hình là coi một định luật khoa học như một hệ thống tham khảo có tính cách công thức cho các trường hợp của nó.", "eng": "The classical error is to regard a scientific law as only a shorthand for its instances."}, {"viet": "Bờ biển đó trải ra theo hướng Bắc trong một đường vòng cung lớn.", "eng": "The coast sweeps away northwards in a wide curve."}, {"viet": "Cuộc họp hoãn lại đến hôm sau.", "eng": "The committee adjourned until the following day."}, {"viet": "Công ty sẽ tung ra một mẫu mới vào tháng sau.", "eng": "The company is launching a new model next month."}, {"viet": "Sự xung đột về quyền lợi giữa những nhà sản xuất và người tiêu thụ.", "eng": "The conflicting interests of producers and consumers."}, {"viet": "Xác chết nằm úp mặt xuống vũng máu.", "eng": "The corpse lay face down in a pool of blood."}, {"viet": "Miền quê với tất cả vẻ huy hoàng của nó.", "eng": "The countryside in all its glory."}, {"viet": "Những tên tội phạm bây giờ đã bị khóa chặt cẩn mật.", "eng": "The criminals are now safely under lock and key."}, {"viet": "Trận chung kết tranh cúp là một ngày trọng đại trong lịch thi đấu thể thao.", "eng": "The Cup Final is an important date in the sporting calendar."}, {"viet": "Sự điều hành hàng ngày một cửa hàng, doanh nghiệp, cỗ máy, đất nước.", "eng": "The day-to-day running of a shop, business, machine, country."}, {"viet": "Mùi thơm ngon của cà phê vừa mới pha.", "eng": "The delicious odour of freshly-made coffee."}, {"viet": "Sự phân đôi giữa chiến tranh và hòa bình.", "eng": "The dichotomy between peace and war."}, {"viet": "Cuộc tranh chấp được dàn xếp khá êm thấm.", "eng": "The dispute was settled without acrimony."}, {"viet": "Vị bác sĩ bị tố cáo là có những hành vi sai trái về nghề nghiệp.", "eng": "The doctor was accused of professional misconduct."}, {"viet": "Chú chó sung sướng khi nhìn thấy cô bé và vẫy đuôi.", "eng": "The dog was happy to see her and wagged its tail."}, {"viet": "Tài xế ngồi kiên nhẫn sau tay lái.", "eng": "The driver sat patiently behind the wheel."}, {"viet": "Nền kinh tế thật là xáo trộn.", "eng": "The economy was in a shambles."}, {"viet": "Địch quân tái lập lực lượng cho một cuộc tấn công mới.", "eng": "The enemy regrouped for new attack."}, {"viet": "Vây quanh lãnh địa này là những cây du oai nghiêm.", "eng": "The estate was fringed with stately elms."}, {"viet": "Sự hết hạn của một bằng lái xe, hợp đồng thuê nhà, thẻ tín dụng, hợp đồng, giao kèo, v. v.", "eng": "The expiry of a driving licence, lease, credit card, contract, agreement, etc."}, {"viet": "Gia đình là thành phần cơ bản của xã hội.", "eng": "The family is the basic unit of society."}, {"viet": "Mấy ngôi nhà mà chúng tôi đã xem đều trong tình trạng khủng khiếp.", "eng": "The few houses we have seen are in terrible condition."}, {"viet": "Kỳ thi mãn khóa thật là gay go.", "eng": "The final exam was a tough nut."}, {"viet": "Hãng đó chuyên việc ấn loát quảng cáo.", "eng": "The firm specializes in printing advertisements."}, {"viet": "Căn hộ có bốn phòng ngủ riêng và một nhà bếp chung.", "eng": "The flat has four separate bedrooms and a communal kitchen."}, {"viet": "Tin dự báo thời tiết nói sẽ có bão.", "eng": "The forecast says there will be storms."}, {"viet": "Phục hồi toàn bộ tài sản, quyền lợi vợ chồng, địa vị ngoại giao.", "eng": "The full restitution of property, conjugal right, diplomatic status."}, {"viet": "Cái cổng kêu ken két khi nó mở.", "eng": "The gate screeched as it opened."}, {"viet": "Chiếc găng tay cho thấy rằng cô ta đã có mặt ở nơi xảy ra tội ác.", "eng": "The glove suggest that she was at the scene of the crime."}, {"viet": "Chính phủ quyết định thôi bao cấp bột mì như vậy là làm cho bánh mì tăng giá.", "eng": "The government decided to remove the subsidy on wheat flour, thus causing an increase in the price of bread."}, {"viet": "Chính phủ thiếu một chính sách kinh tế rõ ràng.", "eng": "The Government lacks a coherent economic policy."}, {"viet": "Mỡ lợn có thể dùng để rán.", "eng": "The grease from pork can be used for frying."}, {"viet": "Trong phòng của người khách trọ không có tấm bảng Xin đừng quấy rầy.", "eng": "The guest doesn't have a Do not disturb sign in his room."}, {"viet": "Thầy hiệu trưởng nói chuyện với toàn trường tại buổi họp.", "eng": "The head teacher told the school at assembly."}, {"viet": "Các tên không tặc cuối cùng đầu hàng cảnh sát.", "eng": "The hijackers finally surrendered themselves to the police."}, {"viet": "Miếng kim loại nóng đó co lại khi nguội đi.", "eng": "The hot metal contracts as it cools down."}, {"viet": "Mái nhà không chắc chắn về cấu trúc.", "eng": "The house roof was structurally unsound."}, {"viet": "Ý tưởng chỉ tồn tại trong đầu óc của các nhà thơ.", "eng": "The ideas exist only in the minds of poets."}, {"viet": "Thật khó tháo gỡ những điều tác động đến công việc trong trường hợp này.", "eng": "The influences at work in this case are hard to disentangle."}, {"viet": "Người tàn phế đó nằm tựa người trên những chiếc gối.", "eng": "The invalid lay propped on the pillows."}, {"viet": "Cuộc hành trình thì dài, nhưng gặp anh ta trở lại thật hoàn toàn bõ công.", "eng": "The journey was long, but seeing him again made it all worthwhile."}, {"viet": "Bọn trẻ con cột một đoạn dây thừng vào cây và dùng nó làm cái đu.", "eng": "The kids tied a piece of rope to the tree and used it as a swing."}, {"viet": "Diễn giả loan báo rằng những thành trì cuối cùng của đặc quyền đang sụp đổ.", "eng": "The last bastions of privilege are crumbling, announced the speaker."}, {"viet": "Hợp đồng thuê căn hộ của chúng tôi sẽ hết hạn trong vài tháng nữa.", "eng": "The lease on our flat runs out in a few months."}, {"viet": "Ánh sáng từ một phía làm cho một nửa khuôn mặt của đối tượng chìm trong bóng tối.", "eng": "The light from one side leaves half the subject's face in shadow."}, {"viet": "Cuộc đi bộ dài làm tôi mệt nhoài.", "eng": "The long walk tired me out."}, {"viet": "Nhà ảo thuật vung cái gậy làm con thỏ biến mất.", "eng": "The magician made the rabbit disappear with a wave of his wand."}, {"viet": "Ông giám đốc lờ đi khi nhân viên của ông đi muộn.", "eng": "The manager turned a blind eye when his staff were late."}, {"viet": "Bữa ăn thật hết ý ngoại trừ món đầu tiên.", "eng": "The meal was excellent except for the first course."}, {"viet": "Những người ấy bị dọa đến mức phục tùng hoàn toàn.", "eng": "The men were cowed into total submission."}, {"viet": "Sự thất bại của các kế hoạch của mình.", "eng": "The miscarriage of one's schemes."}, {"viet": "Chiếc mũ càng đẹp thì nó thường càng đắt.", "eng": "The more beautiful the hat, the more expensive it usually is."}, {"viet": "Phim đó là một cảnh sinh động về một người vợ lính.", "eng": "The movie was tableau of a soldier's wife."}, {"viet": "Cuộc thương lượng hoãn lại một tuần.", "eng": "The negotiation were hung up for a week."}, {"viet": "Lãnh đạo mới có đông đảo người ủng hộ.", "eng": "The new leader has a large backing."}, {"viet": "Năm ngoái cái chái mới được xây thêm cho bệnh viện.", "eng": "The new wing was built on to the hospital last year."}, {"viet": "Y tá trực đêm lên ca lúc 7 giờ tối.", "eng": "The night nurse is on at 7 pm."}, {"viet": "Con số mười ba thường được coi là vận xui.", "eng": "The number thirteen is often considered unlucky."}, {"viet": "Viên chức đó đã thêm một chú thích vào danh sách thống kê.", "eng": "The official prefixed an explanatory note to the list of statistics."}, {"viet": "Kiểu dáng xưa nhất là hình vuông, có khung gỗ và mái tranh hoặc mái ngói.", "eng": "The oldest style was square, with a wooden frame and a thatched or tiled roof."}, {"viet": "Các đứa trẻ khác thường trêu chọc nó về giọng nói của nó.", "eng": "The other boys used to tease him because about his accent."}, {"viet": "Báo chí ghi rằng lạm phát đã giảm.", "eng": "The papers record that inflation has dropped."}, {"viet": "Quĩ đạo của nhiều sao chổi cắt ngang quĩ đạo của trái đất.", "eng": "The paths of many comets cross the earth's path."}, {"viet": "Dân chúng sợ chết khiếp vì vụ xử tử những người lãnh đạo của họ.", "eng": "The people were cowed by the execution of their leaders."}, {"viet": "Bức ảnh đó có dạng tròn.", "eng": "The picture is round in shape."}, {"viet": "Kế hoạch đó đang bắt đầu hình thành trong đầu tôi.", "eng": "The plan is beginning to take shape in my mind."}, {"viet": "Vở kịch được báo chí đánh giá tuyệt vời, rất tốt, kém, v. v.", "eng": "The play got splendid, excellent, unfavourable, etc reviews."}, {"viet": "Cảnh sát điều tra vụ phạm tội đó.", "eng": "The police are investigating the crime."}, {"viet": "Cảnh sát có ý định phạt tài xế say rượu thật nặng.", "eng": "The police intend to clobber drunk drivers."}, {"viet": "Viên cảnh sát ghi tên, địa chỉ v.v... của cô ta.", "eng": "The policeman took down her particulars."}, {"viet": "Người đưa thư luôn luôn đến lúc 7 giờ.", "eng": "The postman always calls at 7."}, {"viet": "Bài phát biểu của tổng thống sẽ được truyền đi cả nước.", "eng": "The President's speech will be broadcast nationwide."}, {"viet": "Giá dầu mỏ lên xuống như một cái yô yô.", "eng": "The price of petrol is going up and down like a Yo-Yo."}, {"viet": "Tên tù nhân gõ nhẹ vào tường xà lim nhắn tin.", "eng": "The prisoner rapped out a message on the cell wall."}, {"viet": "Chương trình đó đã đạt được thành công thực sự đối với công chúng.", "eng": "The programme scored a real hit with the public."}, {"viet": "Thái độ khinh thường của dân chúng do các vụ bê bối trong chính phủ.", "eng": "The public cynicism aroused by governmental scandals."}, {"viet": "Nữ hoàng được đăng quang với đầy đủ nghi lễ long trọng.", "eng": "The Queen was crowned with all solemnity."}, {"viet": "Con chuột gặm một lỗ ở chiếc hộp gỗ.", "eng": "The rat gnawed a hole in the wooden box."}, {"viet": "Người tị nạn được cấp chỗ ở trong một trại lính.", "eng": "The refugees are being stowed in a army camp."}, {"viet": "Sự phân giải ánh sáng trắng thành các màu của quang phổ.", "eng": "The resolution of white light into the colours of the spectrum."}, {"viet": "Đức cha Richard Harries, giám mục giáo phận Oxford.", "eng": "The Right Reverend Richard Harries, bishop of Oxford."}, {"viet": "Đường đầy những mảnh kính cửa sổ bị đập vỡ.", "eng": "The road was covered fragments of glass from the shattered window."}, {"viet": "Tình hình đã bắt đầu sa sút khi chúng tôi mất đi khách hàng quan trọng đó ở Nhật.", "eng": "The rot set in when we lost that important customer in Japan."}, {"viet": "Việc xử lý an toàn chất thải hạt nhân là một vấn đề trọng yếu.", "eng": "The sale disposal of nuclear waste is a major problem."}, {"viet": "Nhà trường đã thắng năm ván liên tiếp.", "eng": "The school has won five successive games."}, {"viet": "Việc nhân viên Hải Quan bắt buôn lậu.", "eng": "The seizure of contraband by Customs officers."}, {"viet": "Toàn bộ chi phí của kế hoạch làm cho nó không đáng được xem xét.", "eng": "The sheer cost of the scheme puts it right out of court."}, {"viet": "Cái áo sơ mi đã bị hư khi chúng tôi ủi nó.", "eng": "The shirt was damaged when we pressed it."}, {"viet": "Biển bên đường đề Cấm đỗ xe ( không thể để xe của quí vị ở đây ).", "eng": "The sign by the road said No parking ( you can not leave your car here )."}, {"viet": "Sự sụt giá cổ phần ở Phố Wall đã gây ra một loạt phản ứng dây chuyền trên thị trường chứng khoán khắp thế giới.", "eng": "The slump on Wall Street set up a chain reaction in stock markets around the world."}, {"viet": "Những người lính thấy một nhóm khủng bố.", "eng": "The soldiers found terrorists in their midst."}, {"viet": "Diễn giả bối rối, và bắt đầu tự mâu thuẫn với mình.", "eng": "The speaker had got confused, and started contradicting himself."}, {"viet": "Sản phẩm chính của một nước.", "eng": "The staple product of a country."}, {"viet": "Câu chuyện bắt đầu đầy kịch tính nhưng tình tiết nhạt dần trước khi kết thúc.", "eng": "The story begins dramatically but the plot peters out before the end."}, {"viet": "Phong cách kiến trúc này bắt nguồn từ người Hy Lạp thời cổ đại.", "eng": "The style of architecture originated from the ancient Greeks."}, {"viet": "Vùng đất chung quanh thấp và có đầm lầy.", "eng": "The surrounding land is low and marshy."}, {"viet": "Thầy giáo đã phân công cho mỗi người chúng tôi một công việc trong kì nghỉ.", "eng": "The teacher has assigned each of us a holiday task."}, {"viet": "Vô tuyến truyền hình đã làm cho chúng ta hiểu rõ thảm cảnh của những người tị nạn.", "eng": "The television pictures brought home to us all the plight of the refugees."}, {"viet": "Bọn cướp đã dùng thừng trói gô người gác lại.", "eng": "The thieves had trussed the guard up with rope."}, {"viet": "Đầu tờ giấy phải hợp với cuối.", "eng": "The top of the paper must coincide with the bottom."}, {"viet": "Tàu đã ở trong ga khi chúng tôi đến nhà ga.", "eng": "The train was in when we got to the station."}, {"viet": "Tiếng kèn trompét vang lên khi đám rước diễu hành.", "eng": "The trumpet blared as the procession got underway."}, {"viet": "Hai cửa hàng nhỏ kết hợp thành một cửa hàng lớn.", "eng": "The two small shops combined to make one large one."}, {"viet": "Mặt trên và mặt dưới của lá cây.", "eng": "The upper and the under surface o a leaf."}, {"viet": "Ngôi làng nép mình dưới chân đồi.", "eng": "The village nestled at the foot by the hill."}, {"viet": "Mức nước ngầm đã xuống thấp do hạn hán.", "eng": "The water-table has been lowered by drought."}, {"viet": "Toàn thể đám đông đồng thanh hô lớn:'Nhà vua muôn năm!'.", "eng": "The whole crowd took up the cry:'Long live the King!'."}, {"viet": "Đội thắng công kênh đội trưởng họ ra khỏi sân.", "eng": "The winning team chaired their captain of the field."}, {"viet": "Các công nhân đang đặt móng cho một bệnh viện mới.", "eng": "The workmen are laying the foundations of the new hospital."}, {"viet": "Chuyện tình của họ bị bọn đầy tớ bàn tán xì xào.", "eng": "Their affairs were being discussed below stairs."}, {"viet": "Câu chuyện tình của họ diễn ra trong bối cảnh một đất nước thời chiến.", "eng": "Their love affair was played out against the background of a country at war."}, {"viet": "Sau đó B gọi điện cho một người bạn để hủy bỏ cuộc hẹn.", "eng": "Then B calls a friend to cancel an appointment."}, {"viet": "Có rất ít khả năng anh sẽ thấy nó ở nhà.", "eng": "There's a faint chance that you'll find him at home."}, {"viet": "Chẳng bao giờ có gì đáng xem trên TV cả.", "eng": "There's never anything worth watching on TV."}, {"viet": "Có cái gì đó viết ở cuối trang.", "eng": "There's something written at the foot of the page."}, {"viet": "Trong rừng này có nhiều loại gỗ.", "eng": "There are many kinds of wood growing in this forest."}, {"viet": "Ở đây có quá nhiều trò giải trí khiến không thể làm việc một cách nghiêm chỉnh được.", "eng": "There are too many distractions here to work properly."}, {"viet": "Có một tòa nhà đẹp ở đằng kia.", "eng": "There is a beautiful building over there."}, {"viet": "Giữa hai người đàn ông này có sự đối kháng, sự đối địch.", "eng": "There is antagonism between these two men."}, {"viet": "Ở vùng quanh ( ngay đây ) không có lấy một trường học tốt.", "eng": "There isn't a good school in the ( immediate ) vicinity."}, {"viet": "Công chúng phản đối kịch liệt việc xây dựng một sân bay mới.", "eng": "There was a public outcry about the building of a new airport."}, {"viet": "Chắc chắn là không đủ để ăn và để uống.", "eng": "There wasn't anywhere near enough to eat and drink."}, {"viet": "Đây, tôi đã đem lại cho anh tờ báo.", "eng": "There you are, I've brought your newspaper."}, {"viet": "Những mẫu khai này của chính phủ thật là rối rắm.", "eng": "These government forms are very muddling."}, {"viet": "Các loại thuốc viên này có bán, không cần đơn.", "eng": "These tablets are available over the counter."}, {"viet": "Chúng nó đã là những người thích tranh luận với nhau ngay từ khi chúng đang đi học với nhau.", "eng": "They've been sparring-partners ever since they were at school together."}, {"viet": "Họ đang bị lôi kéo vào một cuộc chiến tranh một cách bắt buộc.", "eng": "They are embroiled in a war against their will."}, {"viet": "Họ đã mua nhà, đất, chuồng trại,-mua tất tần tật.", "eng": "They bought the house, the land, the stables-the whole shooting match."}, {"viet": "Họ vượt qua dãy núi và tiến về phía thung lũng bên kia.", "eng": "They crossed the mountains and headed for the valleys beyond."}, {"viet": "Chúng lợi dụng lòng hào phóng của bà ấy một cách vô liêm sỉ.", "eng": "They exploited her generosity shamelessly."}, {"viet": "Họ đã phải bò qua đường hầm hẹp.", "eng": "They had to worm their way through the narrow tunnel."}, {"viet": "Họ phải khổ sở 2 năm trong tù.", "eng": "They languished in prison for two years."}, {"viet": "Chắc là họ đã cắt đi một số chỗ trong cuộc phỏng vấn.", "eng": "They must have edited bits of the interview out."}, {"viet": "Họ giơ nắm tay lên để chào lãnh tụ của họ.", "eng": "They raised their fists in salute to their leader."}, {"viet": "Họ nhồi nhét người lên tàu.", "eng": "They shoehorn passengers into the train."}, {"viet": "Họ dùng bất cứ thứ gì vớ được, đá, gỗ, chai, lọ làm vũ khí.", "eng": "They used anything that came to hang-stones, piece of wood, bottles-as weapons."}, {"viet": "Họ mặc quần áo đẹp nhất.", "eng": "They were dressed in their Sunday best."}, {"viet": "Họ xem một trận quyền Anh trong phòng tập của nhà trường.", "eng": "They witnessed a boxing bout in the school gymnasium."}, {"viet": "Con chim này là vị khách lạ đến nước Anh vào mùa đông.", "eng": "This bird is an unusual winter visitor to Britain."}, {"viet": "Đất nước này điều khiển khiến 80 phần trăm những ngân hàng của nó.", "eng": "This country controls 80 per cent of its banks."}, {"viet": "Công ty ngoại thương này buôn bán hàng lụa.", "eng": "This foreign trading company deals in silk goods."}, {"viet": "Tôi là ông Frank ở phòng 205 đây.", "eng": "This is Mr. Frank in Room 205."}, {"viet": "Đất này có thể trồng cây ăn trái được.", "eng": "This land is plantable for the fruit trees."}, {"viet": "Cái đài thu thanh này của anh hơi thành đồ bảo tàng rồi đấy, đã đến lúc mua cái mới đi thôi!", "eng": "This old radio of yours is a bit of a museum piece, it's about time you got a new one!"}, {"viet": "Nơi nghỉ này là địa điểm nổi tiếng cho các khách du lịch vào mùa hè.", "eng": "This resort is a mecca for tourists in the summer."}, {"viet": "Trà nay xuất xứ từ Ceylon, vì vậy nó rất ngon.", "eng": "This tea comes from Ceylon, so it's very good."}, {"viet": "Những ngôi nhà tranh đó hoàn toàn ăn nhập với phong cảnh.", "eng": "Those cottages blend perfectly with the landscape."}, {"viet": "Hôm nay, anh có mua một ít chất pha nước tắm.", "eng": "Today, I bought some bath salts."}, {"viet": "Tiếng Anh dịch thông điệp này là: Tôi đã đến, đã thấy, đã thắng.", "eng": "Translated into English the message is, I came, I saw, I conquered."}, {"viet": "Thông thường chỉ có một món chính và xà lách trộn, tiếp theo là món ngọt.", "eng": "Very often there is only one main course and salad, followed by your sweet."}, {"viet": "Chúng ta sẽ có thể giữ mọi người ở cùng tầng với nhau.", "eng": "We'd be able to keep everyone on the same floor."}, {"viet": "Chúng ta cách thành phố nhỏ khoảng hai mươi dặm.", "eng": "We're about twenty miles from the nearest small town."}, {"viet": "Chúng tôi xin tái xác nhận đơn đặt hàng của các ông và sẽ thảo ngay một hợp đồng cho các ông.", "eng": "We're pleased to confirm your order and will draft a contract for you as soon as we can."}, {"viet": "Tuần này rạp chiếu bóng của chúng tôi chật ních người-đó là một bộ phim nổi tiếng.", "eng": "We've had five full houses this week-it's a very popular film."}, {"viet": "Chúng tôi thả neo ( tàu của chúng tôi ) gần bờ.", "eng": "We anchored ( our boat ) close to the shore."}, {"viet": "Chúng tôi rất bận-đến mức mà chúng tôi không thể nào thu xếp để đi nghỉ năm nay được.", "eng": "We are very busy-so much so that we can't manage to take a holiday this year."}, {"viet": "Chúng ta không thể dùng thứ khoai tây này nữa, tất cả đã nảy mầm rồi.", "eng": "We can't use these potatoes, they've all sprouted."}, {"viet": "Chúng ta đi đến kết luận này sau khi nghiên cứu lâu.", "eng": "We come to the conclusion after a long study."}, {"viet": "Chúng tôi không có phòng ăn riêng-chỗ tiếp khách là một phòng dùng chung.", "eng": "We don't have a separate dining-room-the living area is all one."}, {"viet": "Hôm nay chúng tôi dọn quanh nhà.", "eng": "We gave the house a good clear out today."}, {"viet": "Chúng tôi phải đi đường vòng tránh vùng nước lụt.", "eng": "We had to make a detour round the floods."}, {"viet": "Chúng tôi không có ý định chịu quy phục những luận điệu vô lý đó.", "eng": "We have no intention of lying down under these absurd allegations."}, {"viet": "Chúng tôi đổi bạn nhảy, anh ta nhảy với bạn tôi và tôi nhảy với bạn anh ta.", "eng": "We interchanged partners, he danced with mine, and I danced with his."}, {"viet": "Chúng tôi vun lá rụng lại đốt thành một đống lửa lớn ở ngoài vườn.", "eng": "We made a bonfire of dead leaves in the garden."}, {"viet": "Chúng ta phải đi với tốc độ nhanh hơn nếu không sẽ đến chậm.", "eng": "We must move at a quicker pace or we'll be late."}, {"viet": "Chúng tôi chỉ có một dịch vụ xe buýt nòng cốt trong những ngày nghỉ lễ.", "eng": "We only have a skeleton bus service on public holidays."}, {"viet": "Chúng tôi tắm qua loa ở sau căn nhà gỗ.", "eng": "We rigged up a simple shower at the back of the cabin."}, {"viet": "Chúng tôi đã tiêu đến xu cuối cùng vào cái nhà này.", "eng": "We spent every last penny we had on the house."}, {"viet": "Chúng tôi có rượu Whisky, rượu vang, bia, nước trái cây và xôđa.", "eng": "We've got whisky, wine, beer, juice and soda."}, {"viet": "Cuối cùng chúng tôi đã giảng hoà với nhau khi anh ấy đã xin lỗi.", "eng": "We were finally reconciled when he apologized."}, {"viet": "Chúng tôi sẽ bồi hoàn cho khách về bất cứ sự mất mát hoặc hư hỏng nào.", "eng": "We will reimburse the customer for any loss or damage."}, {"viet": "À, món sườn heo quay xào cải chua thì thế nào ạ?", "eng": "Well, how about the Roast Pork Chop with Sour Cabbage?"}, {"viet": "À, những thuốc này chỉ dùng để uống thôi.", "eng": "Well, these are for internal use."}, {"viet": "Chính phủ làm luật mới thì có ích gì nếu nó không được thực hiện?", "eng": "What's the use of a government making new laws if they can't be put into force?"}, {"viet": "Chúng ta sẽ làm gì với các thức ăn còn lại của bữa tiệc?", "eng": "What are we going to do with the food left over from the party?"}, {"viet": "Như thế ý ông là gì ạ?", "eng": "What do you mean by that?"}, {"viet": "Dạng dị ứng thông thường ở Nhật Bản là gì?", "eng": "What is a common allergy in Japan?"}, {"viet": "Anh căn cứ vào đâu để phát biểu như vậy?", "eng": "What is your authority for that statement?"}, {"viet": "Chị đã làm kiểu tóc gì trên đời này thế?", "eng": "What on earth have you done to your hair?"}, {"viet": "Mấy giờ thì tàu của anh đến Glasgow?", "eng": "What time does your train arrive in Glasgow?"}, {"viet": "Thế giới có từ bao giờ?", "eng": "When did the world come into existence?"}, {"viet": "Khi tôi gật đầu, đó là ám hiệu cho anh để ngừng cuộc họp Và tất cả họ đã sống hạnh phúc mãi mãi sau đó-nghe giống như sự gợi ý cho một bài hát.", "eng": "When I nod my head, that's your cue to interrupt the meeting And they all lived happily ever afterwards-which sounds like the cue for a song."}, {"viet": "Khi cửa mở người ta bắt đầu tụ lại thành nhóm trong phòng.", "eng": "When the door was opened people began to pack into the hall."}, {"viet": "Khi nào bạn sẽ rời văn phòng?", "eng": "When will you leave the office?"}, {"viet": "Kế đến bạn dự định đi du lịch ở đâu?", "eng": "Where do you plan to travel next?"}, {"viet": "Bạn thích ngủ ở đâu hơn, trên giường hay trên ghế giường?", "eng": "Which do you prefer to sleep in, a bed or a futon?"}, {"viet": "Đánh các thành phần pha chế thành bột nhão mịn.", "eng": "Whip the ingredients into a smooth paste."}, {"viet": "Thường thì ai đóng bảo hiểm y tế, cá nhân hay công ty nơi họ làm việc?", "eng": "Who usually pays for medical insurance, the individual or the company they work for?"}, {"viet": "Tại sao anh ta không ghi lại cảm tưởng của mình ra giấy?", "eng": "Why don't you set your feeling down on paper?"}, {"viet": "Cái tường mới này có đủ chắc để chống lại nước biển không?", "eng": "Will this new wall resist the force of the sea?"}, {"viet": "Bằng lòng tha thứ cho chồng cô ta về những chuyện ngoại tình nho nhỏ.", "eng": "Willing to forgive her husband's little infidelities."}, {"viet": "Với bài phát biểu này ông ấy đã nổ những phát súng đầu tiên trong cuộc tranh cử tổng thống.", "eng": "With this speech he has fired the opening shots in the election campaign."}, {"viet": "Ông có thể làm ơn mang cái này giúp tôi được không?", "eng": "Would you be good enough to carry this for me?"}, {"viet": "Ông muốn gọi món khi các ông đến chứ?", "eng": "Would you like to order when you come?"}, {"viet": "Nói xin lỗi một lần thôi sẽ chẳng hại gì ( cho anh ) đâu.", "eng": "Wouldn't hurt ( you ) to say sorry for once."}, {"viet": "Phải, tôi rất thích được đi cùng ông?", "eng": "Yes, I'd enjoy your company?"}, {"viet": "Tốt hơn là anh nên làm một cái gì đó đi.", "eng": "You'd be better to do sth."}, {"viet": "Anh sẽ cần dành trọn một ngày mới tham quan hết.", "eng": "You'll need to devote an entire day to that."}, {"viet": "Anh bị bịp rồi-ngôi nhà này sắp sụp đấy!", "eng": "You've been sold a pup-that house is nearly falling down!"}, {"viet": "Các con trai của mẹ là nguồn an ủi lớn cho mẹ khi cha con chết đi.", "eng": "You boys were a great consolation to me when your father died."}, {"viet": "Ông có thể đổi sang xe buýt số 9, xuống xe ở trạm cuối, và ông sẽ thấy mình đứng ở cổng trước của một thư viện lớn.", "eng": "You can change to a No. 9, get off at the terminal, and you'll find yourself at the front entrance of a large library."}, {"viet": "Con có thể dùng tay lau sạch đít hoặc chỉ còn cách là ra khỏi phòng tắm thôi.", "eng": "You can wipe your butt using your hand or just come out of the bathroom."}, {"viet": "Cậu chạy xộc vào như thế làm tớ giật bắn cả mình!", "eng": "You gave me quite a turn, bursting in like that!"}, {"viet": "Đặt cái mông của bạn lên ghế kia nghe tôi nói đây.", "eng": "You just plunk your caboose over there on the settee and listen up to what I have to tell you."}, {"viet": "Tức là công việc như đầy tớ cho đến chết.", "eng": "You mean work like a slave for the rest of their lives."}, {"viet": "Anh phải trao lại bộ đồng phục trước khi rời bỏ.", "eng": "You must turn in your equipment before you leave."}, {"viet": "Cậu tưởng cậu có quyền tối thượng bóc thư của tôi ra sao.", "eng": "You seem to think you have a divine right to open my mail."}, {"viet": "Anh không nên nhạo báng tín ngưỡng của người khác.", "eng": "You shouldn't mock other peoples religious beliefs."}, {"viet": "Anh sẽ có thời gian thăm những nơi khác ngoài những nơi đã ghi trên lộ trình.", "eng": "You will have time to visit other places than those on the itinerary."}, {"viet": "Đơn kiện của ông cần phải được đưa qua những con đường thích đáng.", "eng": "Your complaint must be made through the proper channels."}, {"viet": "Những việc suy đi tính lại của anh thường sáng suốt hơn những ý tưởng đầu tiên.", "eng": "Your second thought is very often wiser than your first ideas."}]