[{"viet": "12 là bội số chung nhỏ nhất của 2, 3, 4 và 6.", "eng": "12 is the least common multiple of 2, 3, 4, and 6."}, {"viet": "Một con bê được dâng để tế nữ thần.", "eng": "A calf was offered up as a sacrifice to the goddess."}, {"viet": "Một sự biểu hiện rõ ràng các ý định của họ.", "eng": "A clear demonstration of their intentions."}, {"viet": "Một quốc gia bị quân địch tràn ngập.", "eng": "A country overrun by enemy troops."}, {"viet": "Một mẫu vẽ có thể được trang trí lên trên đất sét mềm trước lần nung đầu tiên.", "eng": "A design may be pressed into the soft clay before the first firing."}, {"viet": "Một nụ cười yếu ớt thoáng qua khuôn mặt của nàng.", "eng": "A faint smile flickered across her face."}, {"viet": "Một hãng buôn bán vũ khí, hàng dệt, ngũ cốc.", "eng": "A firm which trades in arms, textiles, grain."}, {"viet": "Một tia hi vọng loé lên trong một tình cảnh dường như tuyệt vọng.", "eng": "A gleam of hope in an apparently hopeless situation."}, {"viet": "Một người khách yêu cầu thu xếp một bữa tiệc chào mừng.", "eng": "A guest is asking to arrange a welcome banquet."}, {"viet": "Một ngôi nhà xây trên móng vững chắc.", "eng": "A house built on stable foundations."}, {"viet": "Một công ty lớn tước bỏ tính cách cá nhân của những người làm công.", "eng": "A large corporation that depersonalizes its employees."}, {"viet": "Một món quà nhỏ làm kỷ vật của một chuyến viếng thăm.", "eng": "A little gift as a memento of a visit."}, {"viet": "Mỗi người đều đánh giá qua việc mình làm chứ không phải qua những gì mình nói.", "eng": "A man should be judged by what he does no what he says."}, {"viet": "Một vị quân vương nổi tiếng về lòng đại lượng của ông ta.", "eng": "A monarch famous for his bounty."}, {"viet": "Một phương pháp mới để lưu trữ thông tin.", "eng": "A new way of storing information."}, {"viet": "Một người bảo vệ nhiệt tình các quyền tự do của công dân.", "eng": "A passionate defender of civil liberties."}, {"viet": "Một đường dây đặc quyền đến thủ tướng.", "eng": "A pipeline to the Prime Minister."}, {"viet": "Một số lượng vượt trội về người có mắt xanh trong dân số.", "eng": "A preponderance of blue-eyed people in the population."}, {"viet": "Một nhóm ca sĩ được ưa chuộng thân thiết với những viên chức cao cấp trong chính phủ.", "eng": "A rat pack of popular singers who were friendly with high government officials."}, {"viet": "Phòng bề bộn những đồ đạc không cần thiết.", "eng": "A room cluttered up with unnecessary furniture."}, {"viet": "Một dây thần kinh nhạy cảm trong một chiếc răng có thể gây đau nhức dữ dội.", "eng": "A sensitive nerve in a tooth can cause great pain."}, {"viet": "Một bữa ăn tuyệt hảo ở một hiệu ăn đắt tiền.", "eng": "A slap-up dinner at an expensive restaurant."}, {"viet": "Một bài diễn văn gồm phần lớn những điều nhạt nhẽo, vô vị.", "eng": "A speech consisting mainly of banalities."}, {"viet": "Một bản phân tích tinh tế về vấn đề đó.", "eng": "A subtle analysis of the problem."}, {"viet": "Một lý thuyết không nhất quán về nội dung.", "eng": "A theory which is not internally consistent."}, {"viet": "Một động từ chia bất qui tắc.", "eng": "A verb with an irregular conjugation."}, {"viet": "Một loại rượu vang có rất ít vị.", "eng": "A wine that has very little taste."}, {"viet": "Theo lời khai của nhân chứng, ông đã có mặt vào lúc xảy ra tội ác.", "eng": "According to the witness's testimony, you were present when the crime was committed."}, {"viet": "Các quảng cáo nhằm dụ người ta tiêu tiền.", "eng": "Advertisements are designed to entice people to spend money."}, {"viet": "Sau sự giải ngũ của anh ta, anh ta sang Canada.", "eng": "After his discharge from the army, he went to Canada."}, {"viet": "Sau khi bị thua trận hai vị tướng bị cách chức công khai.", "eng": "After the defeat two generals were publicly disgraced."}, {"viet": "Alan luôn luôn bị đối xử thô bạo ở trường.", "eng": "Alan's always getting scragged at school."}, {"viet": "Tất cả các đại diện chịu trách nhiệm trực tiếp với phòng kinh doanh.", "eng": "All representatives report directly to the sales department."}, {"viet": "Toàn bộ công việc khó khăn này làm cho tôi kiệt sức.", "eng": "All this hard work is knackering me."}, {"viet": "Xe cứu thương phóng nhanh đưa những người bị thương tới bệnh viện.", "eng": "Ambulances rushed the injured to hospital."}, {"viet": "Một cái mùi làm đói bụng bay ra từ nhà bếp.", "eng": "An appetizing smell from the kitchen."}, {"viet": "Một đại lý độc quyền bán xe Ford trong thành phố này.", "eng": "An exclusive agency for the sale of Ford cars in this town."}, {"viet": "Một động lực hướng tới cách mạng không thể đảo ngược.", "eng": "An irreversible momentum toward revolution."}, {"viet": "Một sự phục hồi bất ngờ của cổ phần thiếc trên thị trường chứng khoán.", "eng": "An unexpected rally of tin shares on the Stock Market."}, {"viet": "Và chị là thư kí tạm thời phải không?", "eng": "And you are the temporary secretary?"}, {"viet": "Bất cứ cái gì cũng còn dễ chịu hơn là tiếng ầm ĩ đáng sợ trong nhà này.", "eng": "Anything was preferable to that dreadful din in the house."}, {"viet": "Trong ngăn kéo đó có con tem nào không?", "eng": "Are there any stamps in the drawer?"}, {"viet": "Ông đang vội phải không, thưa ông?", "eng": "Are you in a hurry, sir?"}, {"viet": "Hãy sắp xếp vật trưng bày theo kích thước.", "eng": "Arrange the exhibits according to size."}, {"viet": "Miễn là tôi có thể cho bạn xuống xe trên đường tôi đi làm.", "eng": "As long as I can drop you off on my way to work."}, {"viet": "Xin bác sĩ kê đơn thuốc gì trị chứng ho đó.", "eng": "Ask the doctor to prescribe something for that cough."}, {"viet": "Cuối một ngày nóng bức các công nhân mệt lử đó đã nằm ngủ dưới một cây có bóng mát.", "eng": "At the end of the hot day the spent workers slept under a shading tree."}, {"viet": "Em bé mới sinh thường có cái đầu lớn không cân xứng.", "eng": "Babies often seem to have disproportionately large heads."}, {"viet": "Bị kết tội chứa chấp một kẻ bị truy nã.", "eng": "Be convicted of harbouring a wanted man."}, {"viet": "Bị một bọn thanh niên cô đồ đánh đập tàn nhẫn.", "eng": "Beaten up by a gang of young roughs."}, {"viet": "Ngoài ra tôi còn làm giỏi nhất sở.", "eng": "Beside I'm the best man in the department."}, {"viet": "Bột xương và ni-trát là những phân bón thông thường.", "eng": "Bone-meal and nitrates are common fertilizers."}, {"viet": "Việc Anh quốc công nhận chính thể mới khó có thể xảy ra.", "eng": "Britain's recognition of the new regime is unlikely."}, {"viet": "Tôi nhớ rõ ràng anh đã hứa gọi điện cho tôi mà!", "eng": "But I distinctly remember you promising to phone me!"}, {"viet": "Nhưng thật sự không phải là những ngân hàng trung ương theo nghĩa hiện đại của chúng.", "eng": "But these were really not central banks in the modern sense of them."}, {"viet": "Trước khi mặt trời lặn chúng tôi đã đi được ba mươi dặm.", "eng": "By sunset we had covered thirty miles."}, {"viet": "Tôi có thể đổi nó lại đô la Mỹ được không?", "eng": "Can I change it back into US dollars?"}, {"viet": "Chúng ta có thể bàn việc này vào lần khác không?", "eng": "Can we discuss this another time?"}, {"viet": "Cô có thể giữ chỗ trước cho tôi không?", "eng": "Can you make a reservation for me?"}, {"viet": "Ông có thể xén nó bớt đi một phần tư được không?", "eng": "Can you trim it by a quarter?"}, {"viet": "Một vài người trong số những người có mặt đã uống nhiều quá.", "eng": "Certain of those present had had too much to drink."}, {"viet": "Trẻ con đang chơi trên tuyết.", "eng": "Children were playing in the snow."}, {"viet": "Huấn luyện tay bơi thi Olimpích.", "eng": "Coach a swimmer for the Olympics."}, {"viet": "Hãy so sánh diện tích của các tam giác này.", "eng": "Compare the areas of these triangles."}, {"viet": "Cọ xát liên tục thì ngay cả sợi dây thừng chắc nhất cũng sẽ sờn.", "eng": "Constant rubbing will fray even the thickest rope."}, {"viet": "Anh giúp tôi một tay nào?", "eng": "Could you give me a hand?"}, {"viet": "Nói chuyện khôi hài với bạn bè của mình.", "eng": "Cracking jokes with one's friends."}, {"viet": "Dan Davies đã được chọn để giới thiệu trên TV một chương trình thảo luận mới.", "eng": "Dan Davies has been chosen to front a new discussion programme."}, {"viet": "Denise và Martin vừa mới đây đã trở thành cha mẹ.", "eng": "Denise and Martin have recently become parents."}, {"viet": "Không dè chuyện chỉ trích và ngạc nhiên khi sự việc đó xảy ra.", "eng": "Did not expect criticism and was surprised by its incidence."}, {"viet": "Trường đại học của bạn có một số sinh viên nước ngoài không?", "eng": "Did your university have some foreign students?"}, {"viet": "Liệu tính di truyền và môi trường có quyết định cá tính của mình không?", "eng": "Do heredity and environment determine one's character?"}, {"viet": "Anh có luôn luôn hành động theo tín ngưỡng của mình không?", "eng": "Do you always act in accordance with your convictions?"}, {"viet": "Ông có phòng đặt trước không?", "eng": "Do you have a reservation number?"}, {"viet": "Bạn có biết ở Nhật Bản phải bao nhiêu tuổi mới được lấy bằng lái không?", "eng": "Do you know how old you have to be to get a driver's license in Japan?"}, {"viet": "Bạn có chơi bóng bầu dục hay chơi gôn không?", "eng": "Do you play rugby or golf?"}, {"viet": "Bạn có cho rằng lớp trẻ ở Nhật Bản khác với lớp người lớn tuổi hơn không?", "eng": "Do you think the younger generations in Japan differ from older generations?"}, {"viet": "Chủ nghĩa phân biệt chủng tộc vẫn còn tồn tại ở Mỹ phải không?", "eng": "Does racism still exist in the U. S.?"}, {"viet": "Đừng có yếu đuối như thế-không có gì phải sợ cả.", "eng": "Don't be so soft-there's nothing to be afraid of."}, {"viet": "Đừng hung hăng đe dọa nếu không tôi sẽ gọi cảnh sát!", "eng": "Don't give me any aggro or I'll call the police!"}, {"viet": "Đừng làm tôi rối trí khi tôi đang cố tập trung.", "eng": "Don't put me off when I'm trying to concentrate."}, {"viet": "Đừng có đẩy những vấn đề khó khăn của anh qua tôi.", "eng": "Don't unload your problems onto me."}, {"viet": "Nhậu nhẹt là nguyên nhân làm suy bại đời nó.", "eng": "Drink was the bane of his existence."}, {"viet": "Kiếm tiền đủ để chu cấp cho gia đình sống thoải mái.", "eng": "Earn enough to maintain a family in comfort."}, {"viet": "Đề cao tư thế của Canađa với tư cách là trung gian trong khối Thịnh Vượng Chung.", "eng": "Enhanced Canada's position as honest broker in the Commonwealth."}, {"viet": "Mọi người trong gia đình nàng đều đến dự đám cưới.", "eng": "Every member of her family came to the wedding."}, {"viet": "Xin lỗi, các anh có cái mở nút chai nào không?", "eng": "Excuse me, do you have a bottle opener?"}, {"viet": "Những lời nhận xét cợt nhả là một phần thái độ thường lệ của ông ấy.", "eng": "Facetious remarks are part of his stock-in-trade."}, {"viet": "Cảm thấy hối tiếc về một dịp may đã bỏ lỡ.", "eng": "Feel regret at a missed opportunity."}, {"viet": "Lửa thiêu hủy cả một vùng rừng rộng lớn.", "eng": "Fire devoured a huge area of forest."}, {"viet": "Không thuộc lời của mình trong một vở kịch.", "eng": "Fluff one's lines in a play."}, {"viet": "Vì các mục đích của cuộc khảo sát, chúng tôi chia thành phố thành bốn khu vực.", "eng": "For the purposes of the survey we've split the town into four areas."}, {"viet": "Căn cứ theo diện mạo của cô ta thì tôi cho rằng cô ta là người Thuỵ Điển.", "eng": "From her looks I'd say she was Swedish."}, {"viet": "Chà nhẹ miếng plastic bằng giấy ráp để sơn ăn.", "eng": "Gently sand the plastic to provide a key for the paint."}, {"viet": "Đợi tôi một chút để tôi gom những điều ghi chép của tôi lại nhé.", "eng": "Give me a moment to gather my notes together."}, {"viet": "Đi từ Luân Đôn đến Oa-sinh-tơn qua Nữu Ước.", "eng": "Go from London to Washington via New York."}, {"viet": "Cứ công nhận là chiếc xe ôtô đẹp lắm, nhưng mà anh đã xem giá của nó bao nhiêu chứ!", "eng": "Granted, it's a splendid car, but have you seen how much it costs!"}, {"viet": "Khó mà tưởng tượng được cách đây hơn một trăm năm nó được xây dựng như thế nào.", "eng": "Hard to imagine how it was built over a hundred years ago."}, {"viet": "Anh có bằng chứng nào cho thấy anh là chủ chiếc xe ôtô không?", "eng": "Have you any proof that you are the owner of the car?"}, {"viet": "Các anh có bánh nướng nhân táo không?", "eng": "Have you got any apple pie?"}, {"viet": "Mặc dù nói vậy chứ tôi đồng ý với anh về điểm kia.", "eng": "Having said that, I agree with your other point."}, {"viet": "Ông ta lúc nào cũng khoe khoang sự học hành tấn tới của con cái mình ở nhà trường.", "eng": "He's always boasting about his children's success at school."}, {"viet": "Anh ta đã quyết định di cư và bắt đầu một cuộc sống mới ở Mỹ.", "eng": "He's decided to emigrate and start a new life in America."}, {"viet": "Hắn ta đang nói dối: cậu có thể dễ thấy điều đó.", "eng": "He's lying: you can see that a mile off."}, {"viet": "Nó đã bắt đầu có một vài thói kiểu cách trông rất bực mình.", "eng": "He's taken on some irritating mannerisms."}, {"viet": "Hắn thường im thin thít khi tôi hỏi về gia đình hắn.", "eng": "He always clammed up when I asked him about his family."}, {"viet": "Ông ta bắt đầu bằng cách viết một truyện kinh dị.", "eng": "He began by writing a thriller."}, {"viet": "Hắn tiến về phía tôi với lưỡi gươm tuốt trần.", "eng": "He came towards me with a drawn sword."}, {"viet": "Nó đến từ Boula, chẳng biết ở nơi nào.", "eng": "He comes from Boula, wherever that may be."}, {"viet": "Anh ấy từ chối thảo luận về những kế hoạch của mình.", "eng": "He declined to discuss his plans."}, {"viet": "Anh ta cảm thấy mình xa lạ với chỗ này.", "eng": "He doesn't feel he belongs here."}, {"viet": "Anh ta kiệt sức vì cố gắng.", "eng": "He exhausted himself in the attempt."}, {"viet": "Ông ta nhét tấm bản đồ gọn gàng vào trong túi xách.", "eng": "He fitted the map snugly into the bag."}, {"viet": "Ông ấy ra hiệu bảo họ giữ im lặng.", "eng": "He gestured to them to keep quiet."}, {"viet": "Anh ta đã tán tỉnh Jane sáu tháng rồi.", "eng": "He had been courting Jane for six months."}, {"viet": "Ông ta phải trả một số tiền lớn đã rút trội ở ngân hàng.", "eng": "He has a huge overdraft to pay off."}, {"viet": "Anh ta thua cá ngựa sạch túi.", "eng": "He has his shirt on the horses."}, {"viet": "Ông ấy ghét bỏ tiền của mình làm ra.", "eng": "He hates parting with his money."}, {"viet": "Ông ấy phù hợp hơn với công việc dạy những học sinh lớn tuổi.", "eng": "He is better suited to a job with older pupils."}, {"viet": "Anh ta cao, to và lực lưỡng.", "eng": "He is tall, broad and muscular."}, {"viet": "Ông ta loại trừ hết mọi đối thủ chính trị của mình.", "eng": "He killed off all his political opponents."}, {"viet": "Ông ta sống cách đây ba dãy.", "eng": "He lives three blocks away from here."}, {"viet": "Anh ta chẳng giấu giếm gì về chuyện anh ta ghét tôi.", "eng": "He made no secret of his dislike for me."}, {"viet": "Nó không biết mà cũng không quan tâm đến chuyện gì đã xảy ra.", "eng": "He neither knows nor cares what happened."}, {"viet": "Hắn lén nhìn trộm qua khe hở hàng rào.", "eng": "He peeped through a chink in the fence."}, {"viet": "Ông ta hứa hẹn cho chúng tôi nhiều lợi lộc nếu chúng tôi mua ngay các cổ phần.", "eng": "He promised us rich pickings if we bought the shares immediately."}, {"viet": "Anh ta đọc to lá thư của bà chị.", "eng": "He read his sister's letter aloud."}, {"viet": "Anh ấy cương quyết thực hiện khởi hành sớm.", "eng": "He resolved on making an early start."}, {"viet": "Hắn là kẻ lang thang và thường sống vất vưởng.", "eng": "He's a tramp and used to living rough."}, {"viet": "Ông ta gần đến tuổi về hưu.", "eng": "He's getting towards retirement age."}, {"viet": "Anh ta chẳng nghĩ gì đến người khác.", "eng": "He's not thinking about other people."}, {"viet": "Anh ấy nói anh ấy đợi đã quá lâu, không thể đợi lâu hơn được nữa.", "eng": "He said he waited so long that he couldn't stay any longer."}, {"viet": "Anh ta dường như không hay biết đến điều rắc rối anh ta gây ra.", "eng": "He seemed to be unaware of the trouble he was causing."}, {"viet": "Hắn chứng tỏ là một tên bất lương.", "eng": "He showed himself to be a dishonest rascal."}, {"viet": "Ông ta đã trải qua khoảng mười hai năm của cuộc đời ở châu Phi.", "eng": "He spent some twelve years of his life in Africa."}, {"viet": "Ông ta đứng chăm chăm nhìn vào bóng ma, sững sờ vì khiếp sợ.", "eng": "He stood staring at the ghost, transfixed with terror."}, {"viet": "Anh mất hàng giờ để sửa văn bản thảo.", "eng": "He takes hours to style the manuscript."}, {"viet": "Hắn dùng một liều heroin quá lớn và đã chết.", "eng": "He took a massive overdose of heroin and died."}, {"viet": "Nó toan bán cho tôi cái xe cũ đó, nhưng tôi có phải là thằng điên đâu, tôi có thể thấy nó không có động cơ mà.", "eng": "He tried to sell me that old car, but I'm nobody's fool, I could see it hadn't got an engine."}, {"viet": "Anh ta đợi một lúc trước khi trả lời câu hỏi.", "eng": "He waited for an instant before answering the question."}, {"viet": "Anh ấy đã trang bị đầy đủ để đi trượt tuyết.", "eng": "He was all kitted out to go skiing."}, {"viet": "Anh ấy được giao đóng vai Othello.", "eng": "He was cast in the role of Othello."}, {"viet": "Anh ấy được miễn tập dương cầm.", "eng": "He was excused from piano practice."}, {"viet": "Anh ấy bị chết trong chiến tranh.", "eng": "He was killed in the war."}, {"viet": "Cậu ta khao khát chiếm được nàng.", "eng": "He was panting with desire for her."}, {"viet": "Anh ấy đang lựa ra từng loại những con tem nước ngoài của mình thành từng xấp.", "eng": "He was sorting his foreign stamps into piles."}, {"viet": "Ông ta tuỳ từng trường hợp mà khi thì được mô tả như là một anh hùng, khi thì là một thiên tài, khi lại là một thằng điên.", "eng": "He was variously described as a hero, a genius and a fool."}, {"viet": "Anh ta chở họ vút đi trên chiếc ôtô thể thao mới của mình.", "eng": "He whirled them away in his new sports car."}, {"viet": "Anh ta làm việc với một nhiệt tình hiếm thấy.", "eng": "He works with a fervor not often exampled."}, {"viet": "Các hàng giậu ở hai bên đường.", "eng": "Hedges on either side of the road."}, {"viet": "Phòng ngủ của nàng treo những bức tranh lớn.", "eng": "Her bedroom is hung with posters."}, {"viet": "Vẻ đẹp tuyệt vời của nàng là bộ tóc.", "eng": "Her crowning glory is her hair."}, {"viet": "Cô thư ký trẻ của bà ta biết nắm bắt thời trang.", "eng": "Her fashion-conscious young secretary."}, {"viet": "Ngày nghỉ của cô ấy làm cho cô ta rất có lợi.", "eng": "Her holiday has done her a power of good."}, {"viet": "Sự sống đang dần dần rời khỏi cô ta.", "eng": "Her life was slowly draining away."}, {"viet": "Những nhận xét xúc phạm của cô ấy không chấp nhận được.", "eng": "Her outrageous remarks went beyond all reason."}, {"viet": "Đề nghị của cô ấy về một khoản tiền quyên góp đã bị cự tuyệt.", "eng": "Her request for a donation met with a repulse."}, {"viet": "Sự từ chức đột ngột của bà ta làm tất cả chúng tôi ngạc nhiên.", "eng": "Her sudden resignation took us all by surprise."}, {"viet": "Nào, cậu nắm chắc cái tua-vít trong lúc tớ thử dùng búa.", "eng": "Here, cop hold of the screwdriver while I try the hammer."}, {"viet": "Giọng nói của ông ấy chứng tỏ ông là người Xcốtlen.", "eng": "His accent proclaimed him a Scot."}, {"viet": "Tư cách đạo đức của anh ta gây ra cho tôi sự lo âu lớn lao.", "eng": "His behaviour has caused me great vexation."}, {"viet": "Lời bình luận của ông ấy gây nên rất nhiều sự chỉ trích.", "eng": "His comments provoked a barrage of criticism."}, {"viet": "Tiếng Anh của anh ta tiến bộ rất nhiều nhờ sự giao thiệp của anh ta với người Anh.", "eng": "His English improved enormously because of his association with British people."}, {"viet": "Lần đầu tiên anh ta được hưởng sự thành công.", "eng": "His first real taste of success."}, {"viet": "Hiện nay các phát kiến của ông đối với chúng ta quá đơn giản đến nỗi thật khó hiểu vì sao người ta lại chống lại chúng dữ dội đến như thế.", "eng": "His ideas seems so simple to us now that it is hard to understand why people fought so hard against them."}, {"viet": "Môi nó giật giật khi nó cố gắng nuốt thức ăn.", "eng": "His lips worked as he tried to swallow the food."}, {"viet": "Đề nghị của anh ta hoàn toàn xuất phát từ tư lợi.", "eng": "His offer was motivated solely by self-interest."}, {"viet": "Những vấn đề của ông ta là hình ảnh thu nhỏ của những vấn đề của toàn khu.", "eng": "His problems epitomize the problems of the entire neighbourhood."}, {"viet": "Tài điều khiển khéo léo xe môtô của anh ấy.", "eng": "His skill in manoeuvring a motorcycle."}, {"viet": "Ý nghĩ của anh ấy cứ xoay quanh các biến cố gần đây ở Ấn Độ.", "eng": "His thoughts kept running on recent events in Indian."}, {"viet": "Công việc của anh ta vẫn còn tồi lắm.", "eng": "His work is still strictly bush league."}, {"viet": "Em yêu, em sẽ giúp anh, đúng không?", "eng": "Honey, you're going to give me a hand, right?"}, {"viet": "Anh được cấp bao nhiêu thời gian?", "eng": "How are you fixed for time?"}, {"viet": "Làm thế nào mà cô ta lại lọt vào làm cái nghề người mẫu?", "eng": "How did she get into the modelling racket?"}, {"viet": "Ở một mình cả ngày cảm thấy ra sao?", "eng": "How does it feel to be alone all day?"}, {"viet": "Sẽ mất bao lâu để gửi bằng điện thư?", "eng": "How long will it take by Letter Telegram?"}, {"viet": "Ông có bao nhiêu món hành lý ạ?", "eng": "How many pieces of luggage do you have?"}, {"viet": "Tôi có thể nhận được bao nhiêu tiền nếu đổi xe của tôi cho cửa hang?", "eng": "How much money can I get for my trade-in?"}, {"viet": "Tuy vậy, bên trong không bị cháy nên vẫn ăn được.", "eng": "However, the inside isn't burnt, so it's OK."}, {"viet": "Tôi phân vân trước khi chấp nhận một đề nghị như vậy.", "eng": "I'd hesitate before accepting such an offer."}, {"viet": "Tôi thích bỏ công việc làm và đến sống ở Bahamas.", "eng": "I'd love to jack in my job and go live with in the Bahamas."}, {"viet": "Tôi sẽ đi với ba người các anh, những người còn lại trong nhóm có thể đợi ở đây.", "eng": "I'll go ahead with three of you, and the remainder of the group can wait here."}, {"viet": "Tôi sẽ thả anh xuống ở góc phố nhà anh.", "eng": "I'll set you down on the corner of your street."}, {"viet": "Tôi e ngại rằng những đứa bé này rồi cũng thành hư hỏng hết như hắn thôi.", "eng": "I'm afraid the children will all be dragged down to his level."}, {"viet": "Tôi sẽ đi từ Quảng Châu đến Wellington qua ngả Singapore.", "eng": "I'm going from Guangzhou to Wellington via Singapore."}, {"viet": "Tôi làm mấy cái rèm cho phòng ngủ.", "eng": "I'm making some curtains for the bedroom."}, {"viet": "Xin bạn nhớ cho, Tôi hoàn toàn có thể lo cho chính tôi.", "eng": "I'm perfectly able to look after myself, for your information."}, {"viet": "Tôi đang đói meo đây, vì vậy tôi sẽ không ăn món nào dễ tiêu cho bữa ăn tối đâu.", "eng": "I'm starving, so I'm not going to eat anything light for dinner."}, {"viet": "Tôi thường đến trường sớm nhưng hôm nay tôi đến muộn.", "eng": "I'm usually at school early but today I was late."}, {"viet": "Tôi đã nghỉ ngơi và ăn ngon miệng trở lại.", "eng": "I've been resting and my appetite is coming back."}, {"viet": "Tôi phải lấy chiếc áo khoác của tôi ở chỗ người tẩy hấp về.", "eng": "I've got to pick up my coat from the cleaners."}, {"viet": "Tôi vẫn thường'quay cóp'trong các kỳ thi mà không hề bị bắt lần nào.", "eng": "I've often cheated in exams without being caught."}, {"viet": "Tôi rất phục cái cách xử trí khéo léo của anh trong tình huống đó.", "eng": "I admired your delicate handling of the situation."}, {"viet": "Tôi không thích cho anh ta vay tiền.", "eng": "I am disinclined to lend him any money."}, {"viet": "Tôi hiểu đây không phải là một sự so sánh thích đáng.", "eng": "I appreciate that this is not a fair comparision."}, {"viet": "Tôi cuộc là tôi chạy nhanh hơn anh.", "eng": "I bet I can run faster than you."}, {"viet": "Có anh sát sàn sạt sau lưng, tôi không thể tập trung được.", "eng": "I can't concentrate with you breathing down my neck."}, {"viet": "Tôi không thể dịch chuyển được cái giường-nó quá nặng.", "eng": "I can't shift the bed-it's too heavy."}, {"viet": "Nếu đứng nhón gót thì tôi vừa đủ nhón tới cái kệ.", "eng": "I can only just reach the shelf, if I stand on tiptoe."}, {"viet": "Tôi không thể đọc nổi chữ viết lem luốc của em.", "eng": "I can't read your untidy writing."}, {"viet": "Tôi có thể gặp sau ba giờ.", "eng": "I could meet after three o'clock."}, {"viet": "Tôi muốn tổ chức một buổi tiệc lớn.", "eng": "I'd like to arrange for a large party."}, {"viet": "Đầu tiên tôi không thích ngôi trường mới nhưng tôi đã quen dần với nó.", "eng": "I didn't like the new school at first, but I got used to it."}, {"viet": "Tôi không bàn những chuyện riêng tư với các đồng nghiệp.", "eng": "I don't discuss private matters with my colleagues."}, {"viet": "Tôi không thích James vì anh ta đối xử với người nghèo một cách khinh miệt.", "eng": "I don't like James because he treats poor people with scorn."}, {"viet": "Tôi không hiểu những tính toán phức tạp ở đây.", "eng": "I don't understand the mathematics here."}, {"viet": "Tôi không có cây nào giống vậy cả.", "eng": "I don't have any plants like this."}, {"viet": "Tôi khuyến khích cô ấy chơi quần vợt.", "eng": "I encouraged her to start playing tennis."}, {"viet": "Tôi cảm thấy buộc phải điều tra vấn đề này thêm nữa.", "eng": "I fell impelled to investigate the matter further."}, {"viet": "Tôi tìm được một quyển sách chứa tất cả những thông tin tôi cần.", "eng": "I found a book containing all the information I needed."}, {"viet": "Tôi bực bội và chán nản vì chờ đợi và đi về.", "eng": "I got browned-off with waiting and went home."}, {"viet": "Tôi đã luôn nghĩ rằng ngành ngân hàng bắt đầu trong thời Phục Hưng ở châu Âu.", "eng": "I had always thought that banking started during the Renaissance in Europe."}, {"viet": "Hầu như tôi không còn ăn tiệm nữa.", "eng": "I hardly ever dine out any more."}, {"viet": "Tôi có mọi thứ mà lòng tôi ao ước.", "eng": "I have everything my heart desires."}, {"viet": "Tôi rất e ngại về việc nhận công việc đó.", "eng": "I have serious misgivings about taking the job."}, {"viet": "Tôi chưa có thì giờ đọc bài khảo luận của anh.", "eng": "I haven't had time to look at your essay yet."}, {"viet": "Tôi nghe nói vùng núi đá Ayer có thể không cho du khách đến thăm.", "eng": "I heard that Ayer's Rock might be closed to tourists."}, {"viet": "Tôi hy vọng anh sẽ tránh ( cho nó ) khỏi chuyện lôi thôi trong khi tôi đi vắng.", "eng": "I hope you'll keep ( him ) out off trouble while I'm away."}, {"viet": "Tôi đặt các bức ảnh con cái trên bàn làm việc trước mặt tôi.", "eng": "I keep the children's photographs in front of me on the desk."}, {"viet": "Tôi dựng chiếc xe đạp ngoài cửa tiệm và khi tôi trở ra thì nó đã biến mất.", "eng": "I left my bike outside the shop and when I came out it had gone."}, {"viet": "Tôi sống ở ký túc xá trong thời gian tôi là sinh viên.", "eng": "I lived in a hostel while I was a student."}, {"viet": "Tôi sẽ dùng cô-ca và một ít khoai tây chiên.", "eng": "I'll have a coke and some fries."}, {"viet": "Câu I look và I am looking ở thì hiện tại, I looked, I was looking và I have looked ở thì quá khứ, I will look và I am going to look ở thì tương lai.", "eng": "I look and I am looking are present tenses, I looked, I was looking and I have looked are past tenses, I will look and I am going to look are future tenses."}, {"viet": "Tôi không làm kịp công việc.", "eng": "I'm getting behind with my work."}, {"viet": "Tôi không phải là người chăm viết thư.", "eng": "I'm not much of a correspondent."}, {"viet": "Tôi đang cố làm cho thon lại.", "eng": "I'm trying to get slim."}, {"viet": "Tôi thích đi xe lửa nhiều hơn là xe buýt hay máy bay.", "eng": "I much prefer trains to buses or planes."}, {"viet": "Tôi muốn ăn một miếng bánh xăng-uých cho đỡ thèm.", "eng": "I need a sandwich to take the edge off my appetite."}, {"viet": "Tôi đã phải khó khăn mới lấy được cái đĩa này cho anh.", "eng": "I obtained this record for you with difficulty."}, {"viet": "Tôi thích làm trên máy tính hơn là viết trên giấy.", "eng": "I prefer to edit on-screen rather than on paper."}, {"viet": "Tôi thật sự rất thích bóng đá kiểu Mỹ.", "eng": "I really enjoy American style of football."}, {"viet": "Tôi cực lực bác bỏ bất cứ một ý kiến nào cho rằng tôi hành động không trung thực.", "eng": "I repudiate emphatically any suggestion that I may have acted dishonourably."}, {"viet": "Năm thì mười họa tôi mới gặp nàng.", "eng": "I see her once in a blue moon."}, {"viet": "Tôi muốn gọi một cú điện thoại, nếu có thể được.", "eng": "I should like to make a phone call, if possible."}, {"viet": "Tôi dừng lại nhìn bản đồ rồi lái xe đi tiếp.", "eng": "I stopped to look at a map and then drove on."}, {"viet": "Tôi nghĩ là anh ấy đang vận động chiến dịch một người chống lại việc hút thuốc.", "eng": "I think he's running a one-man crusade against cigarette smoking."}, {"viet": "Tôi nghĩ ở Nhật người ta rất thích mua sắm.", "eng": "I think shopping is extremely popular in Japan."}, {"viet": "Tôi nghĩ là cái đó kỳ quặc anh ta nhận xét.", "eng": "I thought it was odd, he remarked."}, {"viet": "Tôi đã cố gắng gọi cho anh nhưng không liên lạc được, thí dụ vì đường dây bận hoặc hỏng.", "eng": "I tried to ring you but I couldn't get through."}, {"viet": "Tôi đã nghe rất nhiều ý kiến.", "eng": "I've heard so many opinions."}, {"viet": "Con muốn về nhà, nó lải nhải đòi.", "eng": "I want to go home, he whined."}, {"viet": "Tôi ngạc nhiên trước những giá kết thúc mà trước đây không ai nhắc tới.", "eng": "I was amazed at all the closing costs that no one had mentioned before."}, {"viet": "Tôi kinh hoàng vì số lượng công việc tôi phải làm.", "eng": "I was horrified by the amount of work I had to do."}, {"viet": "Tôi quá bận sắp xếp hành lí nên quên mất.", "eng": "I was so busy packing I forgot about it."}, {"viet": "Tôi không sợ những gì hắn nói-đó chỉ là lời hùng hổ bề ngoài thôi.", "eng": "I wasn't frightened by what he said-it was just bluster."}, {"viet": "Ước gì tôi có một căn phòng riêng hẳn.", "eng": "I wish I had my very own room."}, {"viet": "Tôi không biết anh có thể giúp tôi không.", "eng": "I wonder if you can help me."}, {"viet": "Cho tôi món tương tự như vậy,.", "eng": "I would like the same, please."}, {"viet": "Tôi không muốn đề cao cái thứ văn chương vớ vẩn này mà gọi nó là tiểu thuyết được.", "eng": "I wouldn't dignify this trash by calling it a novel."}, {"viet": "Nếu như David có gọi điện, làm ơn nói với anh ta gọi lại ngày mai.", "eng": "If David should ring, please ask him to ring again tomorrow."}, {"viet": "Nếu tôi thắng cuộc thi tài này thì đó sẽ là một mơ ước trở thành sự thật.", "eng": "If I win the tournament, it will be a dream come true."}, {"viet": "Trong trường hợp xấu nhất, chúng ta sẽ phải huỷ bỏ các kế hoạch đi nghỉ hè.", "eng": "If the worst comes to the worst, we'll have to cancel your holiday plans."}, {"viet": "Nếu bạn gọi điện từ bên ngoài Luân Đôn thì hãy quay số 01 trước số đó.", "eng": "If you're phoning from outside London, dial 01 in front of the number."}, {"viet": "Nếu ông không trả tiền các hoá đơn, họ sẽ cắt điện của ông.", "eng": "If you don't pay your bills they'll disconnect your electricity."}, {"viet": "Nếu anh trả tôi 20.000 bảng, tôi sẽ cho tờ báo của anh độc quyền truyện của tôi.", "eng": "If you pay me 20, 000, I'll give your paper the story as an exclusive."}, {"viet": "Nếu bạn chứng kiến một hành động tội ác, bạn sẽ làm gì?", "eng": "If you witnessed a crime, what would you do?"}, {"viet": "Kiếp sau anh ấy có thể là người chơi crickê giỏi.", "eng": "In another incarnation he might be a brilliant cricketer."}, {"viet": "Trong cuốn sách của mình, bà ta đặt vấn đề này lệ thuộc vào những vấn đề khái quát hơn.", "eng": "In her book, she subordinates this issue to more general problems."}, {"viet": "Về đề nghị của ông, ông Trương ạ, có nhiều điểm tôi muốn bàn với ông càng sớm càng tốt.", "eng": "In regard to your proposal, Mr. Zhang, there are several points I'd like to discuss with you as soon as possible."}, {"viet": "Thường thường ở đây không xảy ra sự việc gì nhiều.", "eng": "In the general way of things not much happens here."}, {"viet": "Trong những thời kỳ khủng hoảng, đảng viên cần siết chặt đội ngũ.", "eng": "In times of crisis party members should close ranks."}, {"viet": "Luật quốc tế là một giữ lại lĩnh vực đầy khó khăn đối với ai không quen với tính phức tạp của nó.", "eng": "International law is a minefield for anyone not familiar with its complexity."}, {"viet": "Tiếng Bồ Đào Nha có khác tiếng Tây Ban Nha lắm không?", "eng": "Is Portuguese very different from Spanish?"}, {"viet": "Có gì trục trặc với máy đó phải không?", "eng": "Is there anything wrong with the machine?"}, {"viet": "Đây là một con đường vòng vì vậy chúng ta không phải trở về lối cũ.", "eng": "It's a circular path so we don't have to come back the same way."}, {"viet": "Anh cho rằng lần nào anh cũng sẽ thắng là kiêu căng.", "eng": "It's arrogant of you to assume you'll win every time."}, {"viet": "Muộn rồi đấy chúng ta đi đi.", "eng": "It's getting late, we'd better mosey along."}, {"viet": "Tất nhiên là phải chùng lại sau một ngày làm việc căng thẳng.", "eng": "It's natural to slack off towards the end of a hard day's work."}, {"viet": "Thỉnh thoảng buồn bã là chuyện bình thường.", "eng": "It's perfectly normal to get depressed sometimes."}, {"viet": "Đã đến lúc chúng ta quay lại và trở về nhà.", "eng": "It's time we turned and went back home."}, {"viet": "Trò chuyện ở một buổi liên hoan, có thể là rất khó.", "eng": "It can be very difficult, making conversation at a party."}, {"viet": "Theo quy luật tự nhiên, có mặt ở hai nơi cùng một lúc là không thể được.", "eng": "It is a physical impossibility to be in two places at once."}, {"viet": "Anh phải giúp đỡ bạn bè là điều đúng.", "eng": "It is meet that you should help your friends."}, {"viet": "Đây thật sự không phải là vấn đề chúng ta có đủ khả năng để đi nghỉ hay không-mà chỉ là lúc này tôi quá bận.", "eng": "It isn't a question of whether we can afford a holiday-I'm just too busy at the moment."}, {"viet": "Phải có một cố gắng phi thường để nâng tảng đá đồ sộ đó lên.", "eng": "It required superhuman effort to lift the huge boulder."}, {"viet": "Nó đang chiếu ở rạp chiếu phim ABC.", "eng": "It's showing at the ABC Cinema."}, {"viet": "Vẫn còn khoảng nửa tiếng nữa mới đến nửa đêm.", "eng": "It still wants half an hour till midnight."}, {"viet": "Đó là một tình trạng bấp bênh nguy hiểm không biết bác sĩ có đến đúng giờ không?", "eng": "It was a touch-and-go whether the doctor would get there on time?"}, {"viet": "Đúng là thứ cần để xén cỏ dài.", "eng": "It was just the job for the long grass."}, {"viet": "Anh thật không thành thực đã nói dối họ về trình độ của anh.", "eng": "It was very dishonest of you to lie to them about qualification."}, {"viet": "Nếu ông tỏ ra sẵn sàng cộng tác hơn thì mọi việc sẽ dễ dàng.", "eng": "It would facilitate matters if you were more co-operative."}, {"viet": "Dùng mánh khoé để giành địa vị, quyền lực, ân huệ, v. v..", "eng": "Jockey for position, power, favours, etc."}, {"viet": "Đúng có một lúc tôi đã tưởng ông ấy sẽ từ chối.", "eng": "Just for an instant I thought he was going to refuse."}, {"viet": "Hàng xuất khẩu năm ngoái vượt hàng nhập khẩu về giá trị.", "eng": "Last year's exports exceeded imports in value."}, {"viet": "Để tôi xem quý vị có món gì nào.", "eng": "Let me see what you have."}, {"viet": "Câu Hãy nhìn cô gái nhỏ xinh đẹp trang điểm này là một câu mơ hồ, bởi vì nó không rõ ràng liệu là cô gái đó hay sự trang điểm của cô ta đẹp.", "eng": "Look at those pretty little girls'dresses is ambiguous, because it is not clear whether the girls or the dresses are pretty."}, {"viet": "Nhiều người đã chuyển đến những vùng đất xa xôi của nước Anh để đi tìm một cuộc sống tốt đẹp.", "eng": "Many people have moved to remote parts of Britain in search of the good life."}, {"viet": "Mary chỉ là mãi sau mới thêm thôi-anh chị nó nhiều tuổi hơn nó nhiều.", "eng": "Mary was a bit of an afterthought-her brothers and sisters are all much older than her."}, {"viet": "Tôi có thể tham quan tổng quát một vòng không?", "eng": "May I take a general tour?"}, {"viet": "Hầu hết những người hâm mộ bóng chày đều thích ngồi ở đó.", "eng": "Most baseball fans like to sit there."}, {"viet": "Thưa ông Palmer, ngân phiếu đô la của ông được đổi thành số tiền nhân dân tệ này.", "eng": "Mr. Palmer, your dollar cheque is changed into this sum of RMB yuan."}, {"viet": "Đầu óc tôi không thể một lúc chứa được nhiều thông tin đến thế.", "eng": "My brain can't hold so much information at one time."}, {"viet": "Ngón tay tôi gai gai khi tôi cầm con gà ướp lạnh.", "eng": "My fingers tingled when I held on to the frozen chicken."}, {"viet": "Mẹ tôi sẽ lo lắng bồn chồn nếu nửa đêm mà tôi không về nhà.", "eng": "My mum'll have kittens if I'm not home by midnight."}, {"viet": "Ông chú của tôi lại đến quấy phiền chúng tôi buổi nghỉ cuối tuần này nữa.", "eng": "My uncle is inflicting himself on us again this weekend."}, {"viet": "Những khối công sở mới đang mọc lên khắp nơi.", "eng": "New office blocks are going up everywhere."}, {"viet": "Không đâu, lần này tôi vẽ cẩn thận hơn.", "eng": "No, I will be more careful this time."}, {"viet": "Đừng hòng tôi tiếp tục làm việc cho người ấy.", "eng": "No way will I go on working for that man."}, {"viet": "Bây giờ xin hãy chờ cho một lát.", "eng": "Now wait for a moment, please."}, {"viet": "Ôi, tôi thật tình xin lỗi.", "eng": "Oh, I'm ever so sorry."}, {"viet": "Người già cần sự chăm sóc của tổ chức từ thiện.", "eng": "Old people in need of institutional care."}, {"viet": "Một tính cách không được phân biệt thật rõ ràng với một tính cách khác.", "eng": "One character is not clearly differentiated from another."}, {"viet": "1000 bài hát được phân loại thành những bài dân ca.", "eng": "One thousand songs categorized as folk songs."}, {"viet": "Con chó của chúng tôi trông có vẻ dữ tợn nhưng nó lại hiền khô à.", "eng": "Our dog may look fierce but he wouldn't hurt a fly."}, {"viet": "Mẹ chúng tôi không bao giờ để chúng tôi đi xem chiếu bóng một mình.", "eng": "Our mother never lets us go to the cinema by ourselves."}, {"viet": "Chuyến đi Dunne của chúng tôi thực sự không phải là chuyện gì ghê gớm.", "eng": "Our trip to Dunne wasn't exactly an earth shattering event."}, {"viet": "Những phần của hiệp ước cũ được hợp nhất trong hiệp ước mới.", "eng": "Parts of the old treaty are embodies in the new one."}, {"viet": "Những người bị trật khớp và gãy xương.", "eng": "People suffering from dislocations and broken bones."}, {"viet": "Làm ơn trả ghế và bàn ăn của ông về vị trí thẳng đứng.", "eng": "Please return your seat and table to its upright position."}, {"viet": "Hãy mặc áo khoác vào, nếu không bạn sẽ bị cảm lạnh đấy.", "eng": "Put on your coat, or you'll catch a cold."}, {"viet": "Các nhà khoa học đã phân lập được vi khuẩn gây ra bệnh dịch.", "eng": "Scientists have isolated the virus causing the epidemic."}, {"viet": "Tối nay chúng ta đi xem đấu bóng chuyền nhé?", "eng": "Shall we go and watch the volleyball game tonight?"}, {"viet": "Bà ấy luôn là một người theo dõi diễn biến chính trị.", "eng": "She's always been a politically aware person."}, {"viet": "Cô ấy có thiện cảm với những ý tưởng mới.", "eng": "She's favourably disposed towards new ideas."}, {"viet": "Bà ấy không còn trẻ nữa.", "eng": "She's no longer in the first flush of youth."}, {"viet": "Cô ta chính là hiện thân của lòng tốt.", "eng": "She's the very incarnation of goodness."}, {"viet": "Trong cơn nguy kịch cô ta luôn luôn giữ được ôn hoà, bình tĩnh và tự chủ.", "eng": "She always remains cool, calm and collected in a crisis."}, {"viet": "Cô ta đến kể cái câu chuyện ngớ ngẩn là bị chậm trễ vì con lạc đà ở đường.", "eng": "She came out with some cock-and-bull story about being delayed by a camel in the road."}, {"viet": "Bà ấy chỉ có thể đứng lên với sự giúp đỡ ông chồng.", "eng": "She could only stand with her husband's assistance."}, {"viet": "Cô ấy không hiểu ra rằng cứ phàn nàn, oán thán thì chỉ là vô tình giúp cho Peter thực hiện được mưu đồ.", "eng": "She didn't realize that by complaining she was only playing Peter's game."}, {"viet": "Cô ấy gặp nhóm phỏng vấn một cách tự tin.", "eng": "She faced the interview panel with confidence."}, {"viet": "Cô ta đã viết một bản tường thuật sinh động về những cuộc phiêu lưu của mình.", "eng": "She gave a lively account of her adventures."}, {"viet": "Cô ấy đã có một cơ hội lớn, nhưng lại bỏ lỡ.", "eng": "She had a great chance, but she goofed again."}, {"viet": "Bà ấy có thái độ kiên quyết và thẳng thắn đối với nhân viên của mình.", "eng": "She has a firm, no-nonsense attitude towards her staff."}, {"viet": "Cô ấy được nhận vào làm thử trong thời gian ba tháng trước khi được nhận làm nhân viên chính thức của cơ quan.", "eng": "She has taken on for a three month trial period before being accepted as a permanent member of staff."}, {"viet": "Cô bé là một đứa bướng bỉnh, cô ấy sẽ không ăn trừ khi cô ấy muốn.", "eng": "She is an obstinate child, she won't eat unless she wants to."}, {"viet": "Con bé đó rất có trách nhiệm ở tuổi mới lên sáu.", "eng": "She is very responsible for a six-year-old."}, {"viet": "Bà ta bình thản nghe nhưng lại rất quan tâm đến lý lẽ cả hai bên.", "eng": "She listened dispassionately but with great interest to both arguments."}, {"viet": "Cô ta đến tham quan phòng thí nghiệm nhiều lần mà không có phép.", "eng": "She made several unauthorized visit to the laboratory."}, {"viet": "Cô ấy thường đeo các đồ trang sức như vòng kim cương, chuỗi hạt và hoa tai.", "eng": "She often wears accessories such as a diamond bracelet, a necklace and earrings."}, {"viet": "Cô ta tự nhận là hoàn toàn mù tịt về vấn đề này.", "eng": "She professed total ignorance of the matter."}, {"viet": "Cô ấy trả lời bức thư của tôi bằng một cú điện thoại.", "eng": "She responded to my letter with a phone call."}, {"viet": "Cô ta tóm lấy hắn ở chỗ cổ áo.", "eng": "She's got him by the collar."}, {"viet": "Cô ấy nói cô ấy sẽ chuyển thông điệp đến các sinh viên khác.", "eng": "She said she'd pass the massage on to the other students."}, {"viet": "Bà ta trình bày những lý do từ chức của mình trong một lá thư dài.", "eng": "She set out the reasons for her resignation in a long letter."}, {"viet": "Cô ta xem ra có vẻ đúng là người chúng ta cần cho công việc.", "eng": "She sounds just the person we need for the job."}, {"viet": "Bà ta đã bảo vệ lý thuyết của mình bằng nhiều chứng cứ phong phú.", "eng": "She supports her theory with copious evidence."}, {"viet": "Cô ta kể tiếp câu chuyện từ chỗ John đã ngừng lại.", "eng": "She took up the narrative where John had left off."}, {"viet": "Cô nàng nhảy bổ đến chúng tôi và tuyên bố rằng mình sắp phải đi.", "eng": "She waltzed up to us and announced that she was leaving."}, {"viet": "Cô ấy được yêu cầu nhận diện tên tội phạm.", "eng": "She was asked to identify the criminal."}, {"viet": "Người ta phát hiện ra cô ấy chết trong trường hợp đáng nghi ngờ.", "eng": "She was found dead in suspicious circumstances."}, {"viet": "Cô ta rất phẫn nộ với tôi khi tôi đề nghị cô ta nên cố gắng chăm chỉ hơn một chút.", "eng": "She was most indignant with me when I suggested she might try a little harder."}, {"viet": "Bà ta ốm nặng quá có vẻ khó qua khỏi được.", "eng": "She was so ill that it seemed unlikely that she would pull through."}, {"viet": "Cô ấy mặc một chiếc váy mới nhưng anh ta thậm chí không để ý thấy.", "eng": "She was wearing a new dress, but he didn't even notice it."}, {"viet": "Cô ta sẽ quyết định cần phải làm như thế nào.", "eng": "She will determine how it is to be done."}, {"viet": "Cô ta không bao giờ nghĩ là sẽ lấy một người già như vậy.", "eng": "She would never think of marrying someone so old."}, {"viet": "Tỏ ra vô tư trong phán xét của mình.", "eng": "Show detachment in one's judgments."}, {"viet": "Từ ngày li hôn tôi thực sự hạnh phúc-lại được tự do thoải mái!", "eng": "Since my divorce I've been really happy-footloose and fancy-free again!"}, {"viet": "Cắt một góc mỏng ở cái bánh ngọt.", "eng": "Slice a thin wedge from the cake."}, {"viet": "Nước mũi đứa bé chảy ròng ròng.", "eng": "Snot running down the child's nose."}, {"viet": "Những ngành nghiên cứu xã hội học được tiến hành trên cơ sở của hệ thống Mác-xít.", "eng": "Sociological studies conducted within a Marxist frame of reference."}, {"viet": "Một vài loại bêtông kết cứng nhanh hơn các loại khác.", "eng": "Some kinds of concrete set more quickly than others."}, {"viet": "Vài nơi có nhiệt độ trên 90 độ F.", "eng": "Some places have had temperatures in the 90F."}, {"viet": "Ắt hẳn có cái gì đó trục trặc ở cái máy tính.", "eng": "Something must have gone wrong with the computer."}, {"viet": "Nói một cách bực tức về cảnh ngộ khó khăn của những người nghèo.", "eng": "Speak in anger about the plight of poor people."}, {"viet": "Bắt đầu bằng cấp thấp nhất của thang lương.", "eng": "Start on the bottom rung of the salary scale."}, {"viet": "Đừng có làm trò khùng nữa và hãy đàng hoàng lại xem nào!", "eng": "Stop farting around and behave yourself!"}, {"viet": "Strong tea và by accident là những kết hợp trong tiếng Anh.", "eng": "Strong tea and by accident are English collocations."}, {"viet": "Anh ta nghĩ loại nữ trang như thế chắc là đáng giá hàng nghìn.", "eng": "Such jewels must have cost thousands, he thought."}, {"viet": "Được, nhưng anh phải nhớ chuyện này đấy.", "eng": "Sure, but you'd better remember this."}, {"viet": "Quan tâm một cách hiểu biết về điều gì.", "eng": "Take an intelligent interest in something."}, {"viet": "Bụi cây chè được cắt tỉa thường xuyên để giúp cho búp chè phát triển.", "eng": "Tea bushes are pruned regularly, to aid the growth of leaf buds."}, {"viet": "Những chiếc lều đủ mọi hình dạng và kích cỡ khác nhau.", "eng": "Tents in various different shapes and sizes."}, {"viet": "Tốt quá, tôi phải trả bao nhiêu tiền?", "eng": "That's good, how much shall I pay for it?"}, {"viet": "Chiếc áo choàng đỏ bắt đầu có vẻ cũ.", "eng": "That coat is starting to look worn."}, {"viet": "Chiếc áo thun kia làm nổi bật màu xanh của đôi mắt cô ta.", "eng": "That jumper sets off the blue of her eyes."}, {"viet": "Cái nhẫn đó đáng giá một gia tài.", "eng": "That ring is worth a fortune."}, {"viet": "Điệu nhạc đó không phải sở trường của tôi.", "eng": "That tune is not in my repertoire."}, {"viet": "Việc kết nạp thêm đảng viên mới vào đảng.", "eng": "The accession of new member to the party."}, {"viet": "Nữ diễn viên này tính khí thất thường đến nỗi nhiều người từ chối làm việc với cô ấy.", "eng": "The actress was so temperamental that many people refused to work with her."}, {"viet": "Không khí môi trường trái đất gọi là khí quyển.", "eng": "The ambient air about the earth is called the atmosphere."}, {"viet": "Việc áp dụng những khám phá kĩ thuật mới trong quá trình công nghiệp thường khiến cho công việc dễ làm hơn.", "eng": "The application to new scientific discoveries to industrial processes usually makes jobs easier to do."}, {"viet": "Bài này viết tệ quá không thể cho in được.", "eng": "The article is too badly written to be printable."}, {"viet": "Tác giả đưa ra cách giải quyết vấn đề hoàn hảo với sự xuất hiện của người chị em sinh năm đôi mất tích từ lâu, người này đã giải quyết mọi vấn đề trong vòng hai trang giấy.", "eng": "The author produces a perfect deus exmachina in the form of the woman's long lost twin who cures all her problems in about two pages."}, {"viet": "Túi kẹo trên bàn là một sự cám dỗ quá mạnh đối với đứa trẻ không thể cưỡng lại được.", "eng": "The bag of sweets on the table was too strong a temptation for the child to resist."}, {"viet": "Tầng hầm đã được chuyển thành một xưởng.", "eng": "The basement has been made over into a workshop."}, {"viet": "Những bài diễn văn ứng khẩu hay nhất chính là những bài đã được viết trước cẩn thận.", "eng": "The best impromptu speeches are the ones written well in advance."}, {"viet": "Khối sắt trở nên có từ tính khi bật điện.", "eng": "The block becomes magnetic when the current is switched on."}, {"viet": "Cuốn sách này có rất nhiều minh hoạ.", "eng": "The book has a wealth of illustrations."}, {"viet": "Võ sĩ quyền Anh đó bỏ cuộc với những vết thương trên mắt.", "eng": "The boxer retired from the contest with eye injuries."}, {"viet": "Dãy phòng tân hôn đã sẵn sàng đón tiếp những người hưởng tuần trăng mật.", "eng": "The bridal suite was prepared for the reception of the honeymooners."}, {"viet": "Bọn trộm đêm đã lẻn vào nhà êm ru.", "eng": "The burglars had entered the house by stealth."}, {"viet": "Chiếc xuồng bị dòng nước cuốn theo.", "eng": "The canoe was borne along by the current."}, {"viet": "Chiếc xe hơi đâm thẳng vào tường.", "eng": "The car ran slap into the wall."}, {"viet": "Lâu đài đó rơi vào tình trạng đổ nát.", "eng": "The castle has fallen into ruin."}, {"viet": "Ông chủ tịch bị phê bình vì điều hành tồi trong cuộc họp báo.", "eng": "The chairman was criticized for his maladroit handling of the press conference."}, {"viet": "Đứa trẻ chui vào dưới đống chăn đệm.", "eng": "The child burrowed under the bedclothes."}, {"viet": "Tiếng la hét của lũ trẻ đã làm cho đàn chim sợ bay đi.", "eng": "The children's shouts frightened off the birds."}, {"viet": "Bọn trẻ ùa ra khỏi trường.", "eng": "The children rushed out of school."}, {"viet": "Việc treo đèn kết hoa vào dịp lễ Giáng Sinh ở con đường chính.", "eng": "The Christmas illuminations in the high street."}, {"viet": "Người đàn bà leo núi trượt chân và rơi xuống.", "eng": "The climber's foot slipped, and she fell."}, {"viet": "Thời tiết lạnh làm cho chúng tôi hết cả nhiệt tình đi bơi.", "eng": "The cold weather chilled our enthusiasm for swim."}, {"viet": "Ủy ban sẽ không họp nếu vị chủ tịch vắng mặt.", "eng": "The committee will not meet in default of a chairman."}, {"viet": "Công ty cung cấp nhà ở cho một số nhân viên.", "eng": "The company provides houses for some of its workers."}, {"viet": "Lời giải thích về vụ ám sát Tổng Thống Kennedy là do một nhóm người có thế lực làm.", "eng": "The conspiracy theory explanation of President Kennedy's assassination."}, {"viet": "Chi phí cần thiết cho việc mở một doanh nghiệp.", "eng": "The costs involved in starting a business."}, {"viet": "Khoá học bao gồm ba phần.", "eng": "The course will be composed of three parts."}, {"viet": "Mùa màng tốt ở dưới vùng chúng tôi.", "eng": "The crops are doing well down our way."}, {"viet": "Rèm và thảm hết sức hợp nhau.", "eng": "The curtains and the carpets match perfectly."}, {"viet": "Vụ làm ăn đó được tiến hành một cách gian dối.", "eng": "The deal was conducted mala fide."}, {"viet": "Sự bác đơn xin nghỉ phép của anh ấy.", "eng": "The denial of his request for leave."}, {"viet": "Các khó khăn chúng ta đương đầu rất to lớn.", "eng": "The difficulties that we confront are enormous."}, {"viet": "Toà án li hôn xử cho anh ta quyền thăm con.", "eng": "The divorce court granted him access to his children."}, {"viet": "Học thuyết đã mất uy tín.", "eng": "The doctrine has fallen into discredit."}, {"viet": "Đỉnh tròn của một ngọn đồi, vòm trời đêm, mái đầu hói.", "eng": "The dome of a hill, the night sky, a bald head."}, {"viet": "Người say rượu đó đã bị một đám thanh niên trêu chọc thậm tệ.", "eng": "The drunk had been manhandled by a gang of youths."}, {"viet": "Người Ai Cập thường ướp xác các vua và hoàng hậu của họ.", "eng": "The Egyptians used to embalm the bodies of their dead kings and queens."}, {"viet": "Bây giờ máy chạy êm rồi.", "eng": "The engine is running smoothly now."}, {"viet": "Giá thực phẩm tăng không ngừng.", "eng": "The ever-increasing cost of food."}, {"viet": "Sự mở rộng luật bản quyền tác giả bao gồm cả tài liệu ghi âm.", "eng": "The extension of the copy right laws to cover recorded material."}, {"viet": "Nông trại đó khuất sau ngọn đồi.", "eng": "The farm was tucked away in the hill."}, {"viet": "Các tập tin được truy cập mỗi ngày để cập nhật.", "eng": "The files were accessed every day to keep them up to date."}, {"viet": "Ngọn lửa được khống chế.", "eng": "The fire has been brought under control."}, {"viet": "Những lông tơ đầu tiên đã bắt đầu xuất hiện trên mặt cậu bé.", "eng": "The first down was beginning to appear on the young boy's face."}, {"viet": "Đến lượt Ngài phát biểu-Ngài có thể trình bày luận điểm của mình.", "eng": "The floor is yours-you may present your argument."}, {"viet": "Pháo đài là trung tâm điểm của thành phố cổ.", "eng": "The fortress was the nucleus of the ancient city."}, {"viet": "Tương lai có vẻ khá ảm đạm, nhưng chúng ta vẫn sống trong hy vọng.", "eng": "The future looks rather gloomy, but we live in hope."}, {"viet": "Viên tướng không tỏ ra thương xót và đã giết tất cả tù nhân của ông ta.", "eng": "The general showed no mercy and killed all his prisoners."}, {"viet": "Giải chơi gôn dành cho người chuyên và không chuyên.", "eng": "The golf tournament in open to both amateurs and professionals."}, {"viet": "Chính phủ đã phân chia những phần đất đai tư nhân rộng lớn.", "eng": "The government has broken up the large private estates."}, {"viet": "Chính phủ dường như không thể kìm chế được hành động quá trớn của công an mật.", "eng": "The government seemed unable to curb the excesses of its secret police."}, {"viet": "Vạn lý Trường thành, dài 1500 dặm, được người Trung Quốc xây dựng để ngăn chặn sự xâm lăng của các bộ lạc phương bắc.", "eng": "The Great Wall, 1,500 miles long, was built by the Chinese to shut out invading tribes from the north."}, {"viet": "Người khách trọ muốn dùng dịch vụ cấp tốc.", "eng": "The guest wants to have the express service."}, {"viet": "Tim được tạo thành từ mô cơ.", "eng": "The heart is made of muscle."}, {"viet": "Ngày nghỉ là một thay đổi hấp dẫn đối với chúng tôi.", "eng": "The holiday was a refreshing change for us."}, {"viet": "Khách sạn cung ứng cho khách nhiều trò tiêu khiển đa dạng.", "eng": "The hotel offers its guests a wide variety of amusements."}, {"viet": "Ngôi nhà nơi ở có cửa màu xanh.", "eng": "The house where I live has a green door."}, {"viet": "Hố ngăn cách không thể vượt qua giữa giàu sang và nghèo khó.", "eng": "The impassable gulf that lies between riches and poverty."}, {"viet": "Mực đổ ra khắp cả cái bàn.", "eng": "The ink spilt all over the desk."}, {"viet": "Hòn đảo đã trở thành nơi du hí cho những thương gia giàu của thành phố.", "eng": "The island has become a playground for the rich businessmen of the city."}, {"viet": "Quan tòa đã thông qua bản án về người tù đó.", "eng": "The judge passed sentence on the prisoner."}, {"viet": "Con dao rơi khỏi những ngón tay cứng đờ của bà ta.", "eng": "The knife fell from her nerveless fingers."}, {"viet": "Những kiểu quần áo mới nhất từ các nhà thời trang Luân Đôn.", "eng": "The latest creations from London's fashion houses."}, {"viet": "Ống quần bó của tôi đã bị rách.", "eng": "The leg of my tights has torn."}, {"viet": "Con tàu khách chìm lỉm trong những cơn sóng lớn.", "eng": "The liner foundered in heavy seas."}, {"viet": "Chiếc xe tải thình lình ngoặt mạnh để tránh đứa bé.", "eng": "The lorry swerved sharply to avoid the child."}, {"viet": "Trở ngại chính cho việc phát triển là sự thiếu vốn.", "eng": "The main impediment to growth was a lack of capital."}, {"viet": "Những người biểu tình cầm các biểu ngữ với hàng chữ to chống chiến tranh hạt nhân.", "eng": "The marchers carried streamers with the words No Nuclear weapons in large letters."}, {"viet": "Phương pháp học nói chủ yếu là phương pháp lập đi lập lại liên tục.", "eng": "The mechanism of oral learning is largely that of continuous repetition."}, {"viet": "Khoảng cách tương đương với 2 dặm Anh tính bằng mét.", "eng": "The metric equivalent of two miles."}, {"viet": "Rượu pha làm tôi nôn ọe.", "eng": "The mixture of drinks made me vomit."}, {"viet": "Giai đoạn sôi nổi nhất trong đời hoạt động của ai.", "eng": "The most exciting phase of one's career."}, {"viet": "Viện bảo tàng đóng cửa ( đối với khách thăm ) vào các chủ nhật.", "eng": "The museum is closed ( to visitors ) on Sundays."}, {"viet": "Dự luật mới về các kinh phí của công quỹ có thể có nghĩa là lương của công nhân viên nhà nước sẽ cao hơn.", "eng": "The new appropriations bill could mean a larger paycheck for state employees."}, {"viet": "Xa lộ mới còn lâu mới xong.", "eng": "The new motorway won't be ready for donkey's years."}, {"viet": "Tin tức đã làm tiêu tan hết mọi hi vọng của chúng tôi.", "eng": "The news meant the ruin of all our hopes."}, {"viet": "Tiếng động liên tục suốt đêm không ngừng lúc nào.", "eng": "The noise went on all night without a moment's respite."}, {"viet": "Người y tá tắm rửa và cạo râu cho bệnh nhân.", "eng": "The nurse washed and shaved the patient."}, {"viet": "Chiếc xe ô-tô cũ cứ đều đều lăn bánh tới ngọn đồi.", "eng": "The old car jogged along until it reached the hill."}, {"viet": "Điều khó khăn duy nhất của kế hoạch đó là nó quá tốn kém.", "eng": "The only drawback of the plan is that it costs too much."}, {"viet": "Cái bên ngoài của quả cam thì đắng nhưng bên trong thì ngọt.", "eng": "The outside of an orange is bitter, but the inside is sweet."}, {"viet": "Tình trạng nguy hiểm của các mối quan hệ quốc tế.", "eng": "The parlous state of international relations."}, {"viet": "Bệnh nhân ốm nặng và đang được theo dõi liên tục.", "eng": "The patient is seriously ill and is being kept under continuous observation."}, {"viet": "Các diễn viên ra đón nhận sự hoan nghênh của khán giả.", "eng": "The performers took their curtain-call."}, {"viet": "Miếng ngọc đó thường là bạc gắn với một loại đá nào đó.", "eng": "The piece of jewelry is usually silver with some stone."}, {"viet": "Chiếc máy bay bị nổ ngay sau khi bay vào không phận của anh.", "eng": "The plane crashed just after entering British airspace."}, {"viet": "Vở kịch đã là một phương tiện tuyệt vời để biểu lộ tài năng của nữ diễn viên.", "eng": "The play was an excellent vehicle for the actress'talents."}, {"viet": "Cảnh sát không biết rõ người đàn ông đó chết như thế nào nhưng họ nghi ngờ đó là một vụ giết người.", "eng": "The police aren't sure how the man died but they suspect foul play."}, {"viet": "Cánh sát thuyết phục kẻ bị tình nghi tiết lộ sự thật.", "eng": "The police persuade the suspect to talk."}, {"viet": "Rõ ràng vị chính khách đó chẳng chuẩn bị gì cho bài tập của anh ta.", "eng": "The politician had clearly not done his homework."}, {"viet": "Quyền lực cố hữu của chức vị tổng thống.", "eng": "The power inherent in the office of president."}, {"viet": "Vị đương nhiệm của Nhà Trắng.", "eng": "The president incumbent of the White House."}, {"viet": "Vị linh mục sẽ nghe những lời xưng tội bằng tiếng Anh và tiếng Pháp.", "eng": "The priest will hear confessions in English and French."}, {"viet": "Những người tù đã đào một đường hầm để cố gắng trốn nhưng nó bị sập.", "eng": "The prisoners dug a tunnel to try to escape but it caved in."}, {"viet": "Dự án đó được căn cứ trên giả định là nền kinh tế đang mở rộng.", "eng": "The project was predicated on the assumption that the economy was expanding."}, {"viet": "Cái bơm hút không khí ra khỏi bình qua cái van này.", "eng": "The pump sucks air out of the vessel through this valve."}, {"viet": "Vấn đề lần đầu tiên được nêu lên để bàn bạc cách đây đã nhiều năm.", "eng": "The question was first mooted many years ago."}, {"viet": "Số đọc được trên đồng hồ đo là 4 đô la 80 xu.", "eng": "The reading on the meter is 4 dollars and 80 cents."}, {"viet": "Những điểm tốt tương đối của hai kế hoạch.", "eng": "The relative merits of the two plans."}, {"viet": "Khách sạn đó đèn sáng mờ mờ với những chiếc bàn phócmica bình thường và chỗ ngồi ngăn nhồi đệm.", "eng": "The restaurant was dimlylit, with plain formica tables and cushioned booths."}, {"viet": "Việc tăng lãi suất sẽ tai hại cho những hãng buôn nhỏ.", "eng": "The rise in interest rates will be disastrous as far as small firms are concerned."}, {"viet": "Vụ cướp xảy ra giữa thanh thiên bạch nhật trên một đường phố đông đúc.", "eng": "The robbery occurred in broad daylight, in a crowded street."}, {"viet": "Rác rưởi được bỏ một đống trên sàn.", "eng": "The rubbish was left in a pile on the floor."}, {"viet": "Vẫn sản phẩm ấy nhưng với tên khác.", "eng": "The same product with a different name."}, {"viet": "Tên khoa học của cây ca-cao là Theobroma.", "eng": "The scientific name of this tree is Theobroma."}, {"viet": "Câu Although it's old, it still works well bắt đầu bằng một mệnh đề nhượng bộ.", "eng": "The sentence Although it's old, it still works well begins with a concessive clause."}, {"viet": "Sàn tàu bị ngập sóng trong cơn bão.", "eng": "The ship's deck was awash in the storm."}, {"viet": "Tiệm mở cửa từ trưa trở đi.", "eng": "The shop is open from lunchtime onwards."}, {"viet": "Ca sĩ đã được khán thính giả đứng dậy hoan nghênh nhiệt liệt trong mười phút.", "eng": "The singer got a ten-minute standing ovation."}, {"viet": "Các mùi từ trong bếp bay ra khắp phòng.", "eng": "The smells from the kitchen filled the room."}, {"viet": "Người luật sư đang làm thủ tục thực hiện bản di chúc của mẹ tôi.", "eng": "The solicitor is proceeding with the execution of my mother's will."}, {"viet": "Cảm giác thoả mãn đặc biệt mà bạn có được từ một hành động thực sự vị tha.", "eng": "The special glow you get from a truly unselfish act."}, {"viet": "Lời khai của những người làm chứng đều trái ngược nhau.", "eng": "The statements of the witnesses contradict each other."}, {"viet": "Sự căng thẳng của công việc đã dẫn đến sự suy nhược sức khoẻ hoàn toàn của anh ta.", "eng": "The strain of his job led to the complete breakdown of his health."}, {"viet": "Thành công của đề án vẫn còn rất mong manh.", "eng": "The success of the project is still very much on a knife-edge."}, {"viet": "Công tắc điện trên tường ngoài tầm với của đứa nhỏ.", "eng": "The switch on the wall was beyond the baby's reach."}, {"viet": "Cô giáo ra cho lớp học một bài tập toán về nhà.", "eng": "The teacher set her class a mathematics exercise for homework."}, {"viet": "Ca sĩ giọng nam cao làm chúng tôi thất vọng vì hát thấp.", "eng": "The tenor disappointed us by singing flat."}, {"viet": "Việc nghĩ tới cuộc họp đó quả là đã làm hỏng một ngày của tôi.", "eng": "The thought of that meeting has really put a crimp in my day."}, {"viet": "Du khách cần xem những cuộc sống ở khu ổ chuột.", "eng": "The tourists got an eyeful of slum life."}, {"viet": "Việc đưa lý thuyết vào thực hành.", "eng": "The translation of theories into practice."}, {"viet": "Hai đạo quân chiến đấu giành quyền kiểm soát chiếc cầu.", "eng": "The two armies fought for control of the bridge."}, {"viet": "Liên hiệp Vương quốc Anh đổi sang lưu hành hệ mét vào năm 1971.", "eng": "The UK metricated its currency in 1971."}, {"viet": "Kì nghỉ đã cho tôi một nguồn nghị lực mới.", "eng": "The vacation has given me a new lease of life."}, {"viet": "Người ca sĩ lưu diễn đã trình bày liên tục những bài hát của mình cùng với ban nhạc ngay từ lúc bắt đầu chương trình.", "eng": "The visiting singer ran through his numbers with the orchestra just before program."}, {"viet": "Sóng ập vào mạn sườn của công và nhấn chìm nó.", "eng": "The wave caught the canoe broadside and sank it."}, {"viet": "Toàn đội kết thúc lượt bóng đi được 10 điểm.", "eng": "The whole side was skittled out of 10 runs."}, {"viet": "Các nhân chứng đưa ra hai lời khai hoàn toàn trái ngược.", "eng": "The witnesses gave two completely contradictory accounts."}, {"viet": "Con chim bị thương vỗ cánh sà xuống đất.", "eng": "The wounded bird fluttered to the ground."}, {"viet": "Tình bạn thân thiết của họ đã không bền vững.", "eng": "Their close association did not last long."}, {"viet": "Quần áo duy nhất của họ được làm bằng da thú.", "eng": "Their only clothing was made from animal skins."}, {"viet": "Lúc đó trông nó giống như một nắm tuyết.", "eng": "Then it looks like a snowball."}, {"viet": "Lúc này bệnh cúm đang làm lây nhiều người.", "eng": "There's a lot of flu going round at the moment."}, {"viet": "Không cần phải cám ơn tôi-tôi chỉ làm công việc của tôi thôi.", "eng": "There's no need to thank me-I was only doing my job."}, {"viet": "Có 100 xentimet trong một mét.", "eng": "There are 100 centimetres to the metre."}, {"viet": "Ngày nay có nhiều sách, báo, tạp chí bằng chữ B-ray.", "eng": "There are now books, newspapers, and magazines in Braille."}, {"viet": "Không có cái khăn tay nào được ủi sẵn cả.", "eng": "There aren't any ironed handkerchiefs available."}, {"viet": "Có một chỗ hỏng trong hệ thống điện.", "eng": "There is a fault in the electrical system."}, {"viet": "Hỏi xin ông ấy việc làm chẳng có hại gì hết.", "eng": "There is no harm in asking him for a job."}, {"viet": "Chắc có cuộc liên hoan đang diễn ra ở nhà bên cạnh.", "eng": "There must be a party going on next door."}, {"viet": "Đã có sự om sòm khủng khiếp ( diễn ra ) về việc ai phải trả tiền.", "eng": "There was a terrific hoo-ha ( going on ) about who should pay."}, {"viet": "Có bốn người chúng tôi lèn chặt vào nhau trên chiếc ghế.", "eng": "There were four of us squashed up against each other on the seat."}, {"viet": "Những đồ tạo tác này là bằng chứng làm thay đổi cách nhìn thường cho rằng những người này là hoàn toàn không văn minh.", "eng": "These artefacts are correctives to the usual view of these people as completely uncivilized."}, {"viet": "Những biện pháp này đã được truyền thống thừa nhận.", "eng": "These measures have the sanction of tradition."}, {"viet": "Họ sẽ vui mừng hết trách nhiệm với con trai họ.", "eng": "They'll be glad to get their son off their hands."}, {"viet": "Họ đã bác bỏ đề nghị của chúng ta, cho nên tôi e rằng phải chuẩn bị một kế hoạch mới.", "eng": "They've rejected our proposal, so it's back to the drawing-board, I'm afraid."}, {"viet": "Chúng là một trăm đồng, năm mươi đồng, mười đồng, năm đồng và hai đồng tất cả chúng ở dạng tiền giấy, và một đồng được phát hành ở dạng tiền giấy lẫn tiền kim loại.", "eng": "They are one hundred-Yuan, fifty Yuan, ten-Yuan, five-Yuan and two-Yuan, all are in notes, and one Yuan is issued both in note and coin."}, {"viet": "Họ từ nơi thương lượng trở về không đem lại được kết quả gì.", "eng": "They came back room the negotiations empty-handed."}, {"viet": "Họ nghĩ ra một kế hoạch để đưa ra số vàng bạc châu báu ra khỏi đất nước.", "eng": "They devised a plan for getting the jewels out of the country."}, {"viet": "Họ đấu tranh chống lại đặc quyền, đặc lợi để xây dựng một xã hội công bằng hơn.", "eng": "They fought against privilege in order to create a fairer society."}, {"viet": "Chúng cũng có râu như tất các loài côn trùng khác.", "eng": "They have feelers, as all insects do."}, {"viet": "Họ sống rất thanh đạm, tránh mọi thứ xa xỉ.", "eng": "They lived a very frugal existence, avoiding all luxuries."}, {"viet": "Họ không được để chó chạy rông trên đường.", "eng": "They oughtn't to let their dog run on the road."}, {"viet": "Họ báo tin quân địch cách xa 10 dặm.", "eng": "They reported the enemy to be ten miles away."}, {"viet": "Họ đã hưởng một buổi chiều thú vị lái ô tô đi khắp miền quê.", "eng": "They spent a pleasant afternoon motoring through the countryside."}, {"viet": "Họ muốn có con nhưng lúc này họ không thể đủ chu cấp.", "eng": "They want to start a family but can't afford it at the moment."}, {"viet": "Tất cả bọn họ đã bị giết chết đến người cuối cùng trong một cuộc tấn công vô ích.", "eng": "They were killed, to the last man, in a futile attack."}, {"viet": "Họ nên tập trung hơn nữa vào công việc của họ thì hơn.", "eng": "They would do well to concentrate more on their work."}, {"viet": "Cuốn sách này hẳn phải ở đây, nếu không thì anh đã đánh mất nó rồi.", "eng": "This book must be here, or else you've lost it."}, {"viet": "Cuộc biểu tình này là dấu hiệu của sự bất mãn trong sinh viên.", "eng": "This demonstration was a symptom of discontent among the students."}, {"viet": "Ngọn đồi này là chỗ tốt nhất.", "eng": "This hill is the best place."}, {"viet": "Điều này có liên quan đến một chuyện khẩn cấp.", "eng": "This is regarding an urgent matter."}, {"viet": "Cánh đồng này trông có vẻ thích hợp với nấm.", "eng": "This looks a likely field for mushrooms."}, {"viet": "Phần này của tờ mẫu đơn không dùng cho sinh viên nước ngoài.", "eng": "This part of the form is not applicable to foreign students."}, {"viet": "Khắp thành phố sẽ có nhiều chuyện xì xào về vụ bê bối này.", "eng": "This scandal will furnish the town with plenty of gossip."}, {"viet": "Đồ chơi này không thích hợp với trẻ con.", "eng": "This toy is not suitable for young children."}, {"viet": "Những người muốn được ân sủng của hoàng đế phải phủ phục trước ông ta.", "eng": "Those who wishes a favour of the emperor had to grovel on hands and knees before him."}, {"viet": "Tôkyô va Ôsaka là những thành phố rất khác nhau.", "eng": "Tokyo and Osaka are very different cities."}, {"viet": "Rèm được làm bằng hai khổ vải ghép lại.", "eng": "Two widths of cloth were joined to make the curtain."}, {"viet": "Chiến tranh được nối tiếp bởi nhiều năm gian khổ.", "eng": "War was followed by many year of austerity."}, {"viet": "Chúng tôi sẽ không phát trong mùa hè và đến mùa thu sẽ phát trở lại một đợt mới.", "eng": "We'll be off the air for the summer and returning for a new series in the autumn."}, {"viet": "Chẳng bao lâu nữa gia đình chúng tôi sẽ có thêm một người.", "eng": "We're expecting a new arrival in the family soon."}, {"viet": "Chúng tôi rất biết ơn về sự đỡ đầu của ông ấy.", "eng": "We're very grateful for his sponsorship."}, {"viet": "Chúng tôi đã nhận được nhiều đơn than phiền về tay nghề kém.", "eng": "We've received a lot of complaints of bad workmanship."}, {"viet": "Chúng tôi tin chắc rằng chất lượng của sản phẩm này sẽ làm cho quý vị hài lòng tuyệt đối.", "eng": "We are certain that the quality of this product will give you full satisfaction."}, {"viet": "Chúng tôi yêu cầu họ thục hiện việc thanh toán ngay.", "eng": "We ask them to effect immediate payment."}, {"viet": "Chúng ta có thể ăn hiệu, nếu anh muốn.", "eng": "We can eat in a restaurant, if you like."}, {"viet": "Chúng tôi không thể nào đành lòng làm chuyện đó.", "eng": "We could nohow bring ourselves to do it."}, {"viet": "Chúng tôi không muốn bất cứ thứ gì bị hỏng cả.", "eng": "We don't want anything to break."}, {"viet": "Bố mẹ đã sống với nhau mà.", "eng": "We got used to each other."}, {"viet": "Chúng tôi có một phòng hội nghị có thể chứa 20 người.", "eng": "We have a conference room which can seat 20 people."}, {"viet": "Chúng ta có vài việc phải làm trước đã.", "eng": "We have some work to do first."}, {"viet": "Chúng tôi coi John Smith là một luật gia giỏi và một người bạn tốt.", "eng": "We know John Smith as a fine lawyer and a good friend."}, {"viet": "Chúng tôi đo chênh lệch về nhiệt độ.", "eng": "We measured the difference in temperature."}, {"viet": "Chúng ta phải chọn riêng loại táo tốt ra khỏi loại xấu.", "eng": "We must sort out the good apples from the bad."}, {"viet": "Chúng tôi trả lãi suất cao nhất được phép đối với những ngân hàng thương mại.", "eng": "We pay the highest interest rate permitted for commercial banks."}, {"viet": "Chúng tôi đi tìm sự thật và bằng lòng chịu những hậu quả.", "eng": "We seek the truth and will endure the consequences."}, {"viet": "Chúng tôi mua nhiều rượu vang khi chúng tôi ở Paris.", "eng": "We stocked up on wine when we went to Paris."}, {"viet": "Chúng tôi muốn sống ở vùng lân cận London.", "eng": "We want to live in the neighbourhood of London."}, {"viet": "Chúng tôi đã bị tống về ở nông thôn.", "eng": "We were packed off to stay in the country."}, {"viet": "Chúng tôi sẽ rất vui lòng mua 50 tấn nếu quý vị có thể giảm giá 2%.", "eng": "We would be pleased to purchase 50 tons if you could make a 2% discount."}, {"viet": "À, tôi mong tôi sẽ không gặp lúc khó khăn để giữ danh tiếng của tôi!", "eng": "Well, I hope I'm not going to have a tough time keeping my reputation!"}, {"viet": "À, ông quả là người thận trọng, thảo nào mà công việc làm ăn của ông thành công như vậy.", "eng": "Well, you're a prudent man, no wonder that your business is so successful."}, {"viet": "Thật đáng mừng là anh không bị thương tổn gì trong tai nạn!", "eng": "What a blessing you weren't hurt in the accident!"}, {"viet": "Bạn thích khía cạnh nào của Nhật?", "eng": "What aspects of Japan do you like?"}, {"viet": "Bạn thường làm gì khi bạn ở cùng bạn bè?", "eng": "What do you usually do when you are with your friends?"}, {"viet": "Nhiệt độ mùa hè trung bình ở San Francisco là bao nhiêu?", "eng": "What is the average summer temperature in San Francisco?"}, {"viet": "Bạn có ý kiến gì về các ngân hàng Nhật?", "eng": "What is your opinion of Japanese banks?"}, {"viet": "Tiền phòng một tuần là bao nhiêu?", "eng": "What's the charge per week?"}, {"viet": "Cái chúng tôi cần ở công ty này là những người đem đến ý tưởng và nghị lực mới.", "eng": "What we need in this company is some new blood."}, {"viet": "Bao giờ thì lấy quần áo giặt ở hiệu giặt về?", "eng": "When does the wash come back from the laundry?"}, {"viet": "Khi tôi viết thư cho cha mẹ tôi, tôi gửi kèm theo bức ảnh của đứa nhỏ.", "eng": "When I wrote to my parents, I enclosed a photograph of the baby."}, {"viet": "Khi nhà chính khách đồng ý trả lời các câu hỏi trên truyền hình, ông ta đã bị chất vấn nhiều hơn ông ta dự tính.", "eng": "When the politician agreed to answer questions on television, he got more than he had bargained for."}, {"viet": "Khi ông tới đại lộ University, xin hãy cho cháu biết.", "eng": "When you get to University Avenue, please let me know."}, {"viet": "Thành phố lớn nhất trên thế giới là ở đâu?", "eng": "Where is the biggest city in the world?"}, {"viet": "Bạn thích loại nhạc pop nào hơn, nhạc pop Anh hay nhạc pop Mỹ?", "eng": "Which kind of pop music do you prefer, British or American?"}, {"viet": "Ai sẽ thanh toán những phí tổn cho chuyến đi của anh?", "eng": "Who's meeting the expenses of your trip?"}, {"viet": "Bất cứ kẻ nào phản bội tổ quốc của mình đều sẽ bị mất phẩm giá.", "eng": "Whoever betrays his country shall be abased."}, {"viet": "Tại sao bạn không mặc cái váy màu hồng?", "eng": "Why don't you wear your pink skirt?"}, {"viet": "Em có ghé qua siêu thị để mua ít trứng và sữa không?", "eng": "Will you call in at the supermarket for some eggs and milk?"}, {"viet": "Tôi mong chúng ta có thể cách âm được phòng ngủ của bọn con trai!", "eng": "Wish we could sound-proof the boys'bedroom!"}, {"viet": "Phụ nữ nào cũng như phụ nữ nào, bất kể họ thuộc quốc gia nào hoặc nền văn hóa nào.", "eng": "Women are women regardless of nationality or culture."}, {"viet": "Nếu cần thiết bạn có đi không?", "eng": "Would you go if it is necessary?"}, {"viet": "Cảm phiền bạn báo hủy hộ tôi nhé?", "eng": "Would you mind calling cancelling them for me?"}, {"viet": "Hãy chép lại từ này mười lần để biết được cách viết chính tả của từ ấy.", "eng": "Write out this word ten times so that you learn how to spell it."}, {"viet": "Có, nếu điều đó không làm phiền ông quá nhiều.", "eng": "Yes, if it isn't too much trouble for you."}, {"viet": "Chắc anh nghĩ là cô ta mệt mỏi sau một cuộc hành trình dài như vậy nhưng không phải như vậy đâu.", "eng": "You'd think she'd be tired after such a long journey, but not a bit of it."}, {"viet": "Tất cả các anh đang làm một việc tuyệt vời, hãy cố duy trì việc làm tốt đẹp ấy.", "eng": "You're all doing a splendid job, keep up the good work."}, {"viet": "Anh đã có được bước đầu thắng lợi nếu anh có được một cuộc phỏng vấn.", "eng": "You've gotten to first base if you've landed an interview."}, {"viet": "Anh không thể võ đoán về nhu cầu của nhân dân được.", "eng": "You can't dogmatize about people's needs."}, {"viet": "Anh có thể thấy quần bò hơi co lại khi mang giặt.", "eng": "You can expect some shrinkage when the jeans are washed."}, {"viet": "Anh có thể có lý, trong trường hợp đó, họ sẽ phải trả lại tiền cho anh.", "eng": "You could be right, and in that event they'll have to pay you back."}, {"viet": "Em vẫn luôn luôn là người yêu duy nhất và thật sự của anh.", "eng": "You have always been my one and only true love."}, {"viet": "Anh biết là vợ và con cái của anh phải được coi trọng trước hết.", "eng": "You know that your wife and children come first."}, {"viet": "Nếu anh chưa bao giờ nghe nói về Marx thì hẳn là anh kém hiểu biết.", "eng": "You must be illiterate if you've never heard of Marx."}, {"viet": "Anh cần cảm thấy rằng không có sự ép buộc nào bắt anh phải chấp nhận.", "eng": "You need feel under no compulsion to accept."}, {"viet": "Ông nên cố hết sức để bỏ đi.", "eng": "You should do your best to stop."}, {"viet": "Chắc bạn đã tông vào cái xe đậu đó rồi.", "eng": "You sure rammed that parked car."}, {"viet": "Ông đã rút năm mươi nhân dân tệ và bây giờ còn lại một trăm.", "eng": "You withdrew fifty yuan and now have one hundred left."}, {"viet": "Những chi tiêu của anh sẽ được thanh toán, điều đó là tất nhiên.", "eng": "Your expenses will be paid, that's understood."}, {"viet": "Lý luận của anh không phù hợp với những sự việc đã được biết.", "eng": "Your theory doesn't square with the known facts."}]