[{"viet": "Một kẻ ăn xin mà mặc đồ rách rưới dơ bẩn.", "eng": "A beggar dressed in filthy rags."}, {"viet": "Một cái ghế không đứng được trên hai chân.", "eng": "A chair will not stand on two legs."}, {"viet": "Sự thay đổi khí hậu hoàn toàn đã biến vùng này từ sa mạc thành đầm lầy.", "eng": "A complete change of climate which transformed the area from a desert into a swamp."}, {"viet": "Một viên kim cương cắt có nhiều mặt.", "eng": "A cut diamond has many faces."}, {"viet": "Một bác sĩ hành nghề đa khoa.", "eng": "A doctor working in general practice."}, {"viet": "Một ít đồ đạc khá thô sơ.", "eng": "A few rather plain bits of furniture."}, {"viet": "Người bạn giúp mình trong lúc khó khăn mới thực là bạn.", "eng": "A friend in need is a friend indeed."}, {"viet": "Một chính sách kinh tế lúc hạn chế lúc thả lỏng của chính phủ.", "eng": "A government's stop-go economic policy."}, {"viet": "Trước đây có một nhà tu hành khổ hạnh sống trong hang đó.", "eng": "A hermit used to live in that cave."}, {"viet": "Một công việc có cơ hội để phát huy mọi khả năng của mình.", "eng": "A job with scope for self-fulfillment."}, {"viet": "Một nàng công chúa theo truyền thuyết đã bị chết ở nơi này.", "eng": "A legendary princess died here."}, {"viet": "Nhiều điều sẽ phụ thuộc vào cách cô ta đương đầu với sự thách thức.", "eng": "A lot will depend on how she responds to the challenge."}, {"viet": "Một người thợ máy mua bán ôtô như một nghề tay trái.", "eng": "A mechanic who buys and sells cars on side."}, {"viet": "Một người ngây thơ với bản tính dễ bị xúc cảm.", "eng": "A naive person with a susceptible nature."}, {"viet": "Một số mũ kiểu mới đã được phô bày tại đám cưới.", "eng": "A number of new hats were on parade at the wedding."}, {"viet": "Một người có ham muốn tình dục tầm thường.", "eng": "A person of gross sexual appetites."}, {"viet": "Một cuộc giằng co chính trị giữa những người ủng hộ pháp chế mới và những người chống lại nó.", "eng": "A political tug of war between those in favour of the new legislation and those against it."}, {"viet": "Một sự tả cảnh tầm thường.", "eng": "A prosaic description of the scene."}, {"viet": "Một hàng ăn với cách nấu nướng khéo của Pháp.", "eng": "A restaurant with a fine French kitchen."}, {"viet": "Một cuốn sách nhỏ chỉ trích kịch liệt về sự vô ích của chiến tranh.", "eng": "A scathing tract on the uselessness of war."}, {"viet": "Người chủ tiệm nói là họ bán giầy dép còn; chúng ta thì nói là ông ta bán giầy.", "eng": "A shopkeeper would say he sold footwear; we would say he sold shoes."}, {"viet": "Một nét dịu dàng xuất hiện trong ánh mắt của nàng khi nàng nhìn chàng.", "eng": "A soft light came into her eyes as she looked at him."}, {"viet": "Viên đá văng trúng chiếc xe ôtô và làm hỏng nước sơn.", "eng": "A stone hit the car and damaged the paintwork."}, {"viet": "Một sự mang về bánh hambơgơ, pizza, món ca-ri.", "eng": "A take-away hamburger, pizza, curry."}, {"viet": "Một đoàn xe lửa với những toa chở hành khách và những toa mui trần chở hàng hóa.", "eng": "A train with passenger coaches and goods wagons."}, {"viet": "Một cốt chuyện cũ được viết lại.", "eng": "A warmed-over version of an old plot."}, {"viet": "Một cây con hay một động vật con có thể khác với đồng loại của nó để thích ứng với nơi nó ở.", "eng": "A young plant or animal may be different enough from its neighbors of the same kind to make it better fitted than the others for living where it does."}, {"viet": "Thật ra, tôi muốn mua chi phiếu du lịch.", "eng": "Actually, I want to buy some traveller's checks."}, {"viet": "Sau lúc khởi đầu có phần lao đao, đội đó đã tiến tới đoạt giải vô địch quốc gia.", "eng": "After a somewhat rocky start, the team went on to win the state championship."}, {"viet": "Sau khi suy nghĩ kỹ, chúng tôi miễn cưỡng đồng ý.", "eng": "After much thought, we reluctantly agreed."}, {"viet": "Sau thời gian đôi ba tháng cho tàu chạy giữa các hòn đảo, Columbus quay về Tây Ban Nha.", "eng": "After two or three months of sailing among the island, Columbus returned to Spain."}, {"viet": "Toàn thể gia quyến ông ấy đều có mặt tại lễ cưới.", "eng": "All his kin were at the wedding."}, {"viet": "Tất cả vẻ rực rỡ lộng lẫy của rạp xiếc.", "eng": "All the glitter and show of the circus."}, {"viet": "Dù có đau đớn, cô ta đã dũng cảm nén những giọt nước mắt của mình.", "eng": "Although in pain, she bravely blinked back her tears."}, {"viet": "Một diễn viên đã nổi tiếng trong cuốn phim.", "eng": "An actor who has made his mark in films."}, {"viet": "Một vụ đâm xe khủng khiếp trên xa lộ.", "eng": "An awful smash-up on the motorway."}, {"viet": "Bản phóng tác có minh họa của những bài thơ.", "eng": "An illustrated version of the poems."}, {"viet": "Một đoạn có thể bỏ đi trong một bài văn.", "eng": "An omissible passage in the text."}, {"viet": "Tôi cũng xem bức tượng Hy Lạp Venus de Milo.", "eng": "And I saw the Greek statue of Venus de Milo, too."}, {"viet": "Một tên gọi khác để gọi nó là magnetite.", "eng": "Another name for it is magnetite."}, {"viet": "Sự chấp thuận kế hoạch hàm ý rằng tiền sẽ được lo đầy đủ.", "eng": "Approval of the plan presupposes that the money will be made available."}, {"viet": "Anh có biết giờ giấc không?", "eng": "Are you aware of the time?"}, {"viet": "Ông có chắc ông đang quay đúng số không?", "eng": "Are you sure you are dialing the right number?"}, {"viet": "Để thử nghiệm, kim loại này phải chịu nhiệt rất cao.", "eng": "As a test the metal was subjected to great heat."}, {"viet": "Khi máy bay rơi nhanh xuống đất, người phi công phải nhảy dù ra.", "eng": "As the plane fell rapidly towards the ground, the pilot had to eject."}, {"viet": "Lúc đầu cậu học trò mới đứng hạng cuối lớp nhưng chẳng bao lâu cậu đuổi kịp những bạn khác.", "eng": "At first the new boy was at the bottom of the class but he soon pulled up with the others."}, {"viet": "Các cố gắng nhằm chiếm được pháo đài phòng thủ kiên cố này.", "eng": "Attempts to capture this well-protected fortress."}, {"viet": "Thích thú khi khen ngợi thành công của vợ mình để được thơm lây.", "eng": "Basking in the reflected glory of his wife's success."}, {"viet": "Hãy sẵn sàng cho điều bất ngờ sắp xảy ra.", "eng": "Be prepared for the unexpected to happen."}, {"viet": "Trước khi lập kế hoạch chi tiết, chúng tôi cần biết thêm một số thông tin chính xác.", "eng": "Before we make detailed plans, we need some more facts and figures."}, {"viet": "Chim kêu ríu rít vui vẻ trên cây.", "eng": "Birds chirping away merrily in the trees."}, {"viet": "Cắt đứt mọi quan hệ với gia đình của ai.", "eng": "Break off all relations with one's family."}, {"viet": "Những tên trộm đã đột nhập vào nhà lúc chúng tôi đi nghỉ phép.", "eng": "Burglars had broken in while we were away on holiday."}, {"viet": "Nhưng trước hết là nên đặt bàn trước.", "eng": "But it's a good idea to make a reservation first."}, {"viet": "Bơ mềm thì dễ phết hơn.", "eng": "Butter spreads more easily when it's softer."}, {"viet": "Tiện thể xin cô cho tôi biết tôi phải đi đâu để gửi một bức thư bảo đảm và một gói hàng đến New York?", "eng": "By the way, would you please tell me where I must go to send a registered letter and a package to New York?"}, {"viet": "Tôi có thể để bọn trẻ ông trông chừng được không?", "eng": "Can I leave the children in your safe keeping?"}, {"viet": "Bạn giải được câu đố này không?", "eng": "Can you figure out this puzzle?"}, {"viet": "Bạn có thể gửi thư điện tử bằng điện thoại di động của bạn được không?", "eng": "Can you send E-mail with your cellular phone?"}, {"viet": "Cẩn thận lật từng tờ quyển sách quí báu đó.", "eng": "Carefully turn over the leaves of the precious volume."}, {"viet": "Các hóa chất trong hệ thống chất thải của nhà máy đã làm thay đổi sinh thái của cả vùng.", "eng": "Chemicals in the factory's sewage system have changed the ecology of the whole area."}, {"viet": "Tài liệu của các cơ quan dân chính nhà nước thường được viết theo lối văn cầu kỳ, làm cho một số người bình thường không thể hiểu được.", "eng": "Civil Service documents are often written in gobbledygook that ordinary people cannot understand."}, {"viet": "Đến đây ngay, bà ta tru tréo lên.", "eng": "Come here at once she snapped."}, {"viet": "Ban phúc lành của mình cho ai.", "eng": "Confer one's benediction on somebody."}, {"viet": "Tôi có thể mang cho các ông thứ gì khác nữa không?", "eng": "Could I bring you anything else?"}, {"viet": "Cô có thể bảo đảm cho bọn trẻ con lên giường lúc 8 giờ không?", "eng": "Could you see that the children are in bed 8 o'clock?"}, {"viet": "Tì cằm mình trong hai bàn tay của mình khum lại.", "eng": "Cup one's chin in one's hands."}, {"viet": "Trang hoàng một cây Nôen bằng các đèn màu.", "eng": "Decorate a Christmas tree with coloured lights."}, {"viet": "Mặc dù có sự phủ nhận liên tục, tin đồn ấy vẫn tiếp tục lan rộng.", "eng": "Despite persistent denials, the rumour continued to spread."}, {"viet": "Bạn đi tìm nhà có gặp nhiều khó khăn không?", "eng": "Did you have much difficulty finding the house?"}, {"viet": "Thảo luận vấn đề một cách bình tĩnh và hợp lý.", "eng": "Discuss the matter calmly and reasonably."}, {"viet": "Làm điều gì với thái độ tinh nghịch.", "eng": "Do something in a spirit of mischief."}, {"viet": "Bạn có thích cuộc sống thường ngày của bạn không?", "eng": "Do you enjoy your everyday life?"}, {"viet": "Cháu có thứ gì để khai báo không?", "eng": "Do you have anything to declare?"}, {"viet": "Bạn có thích ăn các món nướng không?", "eng": "Do you like to have barbecues?"}, {"viet": "Bạn có đăng kí truyền hình cáp không?", "eng": "Do you subscribe to cable T. V.?"}, {"viet": "Các em có muốn đi ra biển không?", "eng": "Do you want to go to the beach?"}, {"viet": "Công việc của anh có làm thỏa mãn những điều anh mong đợi không?", "eng": "Does your job fulfill your expectation?"}, {"viet": "Đừng làm tôi thất vọng do anh đến muộn nữa.", "eng": "Don't disappoint me by being late again."}, {"viet": "Đừng thả con chó đó ra giữa bầy cừu.", "eng": "Don't let that dog loose among the sheep."}, {"viet": "Đừng nhồi nhét cho nó những ý tưởng ngớ ngẩn.", "eng": "Don't stuff him with silly ideas."}, {"viet": "Anh không nghĩ là trò đùa đó hơi nhạt nhẽo rồi sao?", "eng": "Don't you think that joke's wearing a bit thin?"}, {"viet": "Trong cuộc nội chiến, hàng ngàn người đã trốn khỏi đất nước.", "eng": "During the civil war thousands of people fled the country."}, {"viet": "Mười một là một tá thiếu một.", "eng": "Eleven is one shy of a dozen."}, {"viet": "Mới gặp nhau có một lần mà họ đã cảm thấy có một sự đồng cảm.", "eng": "Even after meeting only one, they felt a kinship."}, {"viet": "Mọi thứ cây trong vườn đều phát triển tuyệt vời.", "eng": "Everything in the garden is doing splendidly."}, {"viet": "Hy vọng lấy lại được hết vốn đầu tư trong vòng sáu năm.", "eng": "Expect a payback within six years."}, {"viet": "Các tá điền dành hầu hết thời gian của họ làm ngoài trời.", "eng": "Farm workers spend most of their time outdoors."}, {"viet": "Chiến đấu với các sức mạnh thiên nhiên.", "eng": "Fighting against the forces of nature."}, {"viet": "Nối bộ đuôi vào thân máy bay.", "eng": "Fit the tail assembly to the fuselage."}, {"viet": "Trong một khoảng thời gian dài chúng tôi đã không có tin tức gì của nó.", "eng": "For a long while we had no news of him."}, {"viet": "Tìm thấy sự lý thú khi chơi bè trầm trong một tam tấu.", "eng": "Found his groove playing bass in a trio."}, {"viet": "Chiếm được ưu thế so với đối thủ.", "eng": "Gain an advantage over an opponent."}, {"viet": "Bị khiển trách vì công việc cẩu thả.", "eng": "Get ticked off for careless work."}, {"viet": "Chấp nhận kế hoạch đó chỉ ở mức hạn chế.", "eng": "Give the scheme only qualified approval."}, {"viet": "Tốt, bây giờ tôi đã có một ý tưởng chung về hệ thống ngân hàng ở Trung Quốc.", "eng": "Good, now I have a general idea of the banking system in China."}, {"viet": "Đã hiểu được các giá trị văn hoá của người Ý sau khi sinh sống tại thành phố Rome ba năm.", "eng": "Had internalized the cultural values of the Italians after three years of living in Rome."}, {"viet": "Nhiều công ty lớn bị phá sản trong những năm gần đây ở nước bạn phải không?", "eng": "Have many big companies gone bankrupt in recent years in your country?"}, {"viet": "Bạn có bao giờ bất đồng gay gắt với một trong những người bạn của bạn chưa?", "eng": "Have you ever got into a big disagreement with one of your friends?"}, {"viet": "Anh đã đọc tác phẩm mới nhất của bà ta chưa?", "eng": "Have you read her latest work?"}, {"viet": "Cậu ấy ( có phần ) khoái một ly rượu mạnh sau bữa cơm tối.", "eng": "He's ( rather ) partial to a glass of brandy after dinner."}, {"viet": "Từ khi lấy vợ, anh ta trở nên thích đời sống gia đình hơn rất nhiều.", "eng": "He's become a lot more domesticated since his marriage."}, {"viet": "Anh ta kiếm được một công việc rất nhàn hạ.", "eng": "He's got himself a very cushy little number."}, {"viet": "Nó rõ ràng là một thằng ngu nhất tôi từng biết.", "eng": "He's out and away the stupidest man I know."}, {"viet": "Hắn rất hung tợn: ông biết đấy, đó là con ma men ấy mà.", "eng": "He's very violent: it's the demon drink, you know."}, {"viet": "Ông ấy lập luận rằng vai trò của các chính quyền là bảo vệ những kẻ nghèo khổ.", "eng": "He argued that is was the role of governments to protect the weak."}, {"viet": "Anh ấy tưng tưng đứa con trên đùi.", "eng": "He bounced his baby on his knee."}, {"viet": "Anh ta không chịu nổi thời tiết nóng.", "eng": "He can't stand hot weather."}, {"viet": "Anh ấy không thể che đậy nỗi lòng ghen tỵ đối với tôi.", "eng": "He couldn't conceal his envy of me."}, {"viet": "Anh ta thậm chí cũng không buồn nói một lời cảm ơn.", "eng": "He didn't even bother to say thank you."}, {"viet": "Anh ta chan võng nước xốt lên thức ăn.", "eng": "He drowned his meal in gravy."}, {"viet": "Anh ta cảm thấy hãnh diện khi người ta thán phục chiếc xe ôtô mới của mình.", "eng": "He felt a glow of pride as people admired his new car."}, {"viet": "Anh ta đưa cho cô ấy một phần năm số tiền.", "eng": "He gave her a fifth of total amount."}, {"viet": "Anh ta nhận được một khoản tiền lương nhỏ nhoi sau nhiều tuần làm việc.", "eng": "He got paid a piffling sum after weeks of work."}, {"viet": "Anh ấy chỉ nói chuyện với cô ấy có một lần kể từ buổi liên hoan.", "eng": "He had spoken to her only once since the party."}, {"viet": "Anh ta là người bán hàng có thành tích xuất sắc.", "eng": "He has an excellent track record as a salesman."}, {"viet": "Ông ta đã phục vụ ông chủ của mình trong nhiều năm.", "eng": "He has served his master for many years."}, {"viet": "Ông ta thể hiện tất cả những phẩm chất của một giám đốc thành đạt.", "eng": "He incarnates all the qualities of a successful manager."}, {"viet": "Ông ta là lãnh đạo chỉ trên danh nghĩa, vì thật ra, ông phó của ông ta đã nắm hết quyền hành.", "eng": "He is leader in name only: his deputy has effectively taken over."}, {"viet": "Ông ta đang viết một cuốn sách tiếp theo cuốn bán chạy nhất vừa qua của mình.", "eng": "He is writing a sequel to his latest best seller."}, {"viet": "Ông ta rời nước Anh từ 1964 và không bao giờ trở lại nữa.", "eng": "He left England in 1964 and never returned."}, {"viet": "Anh ta trông chẳng giống ai trong bộ quần áo kỳ cục đó.", "eng": "He looks like nothing on earth in those weird clothes."}, {"viet": "Anh ta đo vòng eo được 30 insơ.", "eng": "He measures 30 inches round the waist."}, {"viet": "Ông ta chỉ cư ngụ ngay góc phố đó thôi.", "eng": "He only lives just round the corner."}, {"viet": "Anh ấy có kiến thức rất sâu về lịch sử.", "eng": "He possesses a good knowledge of history."}, {"viet": "Ông ấy xếp sẵn va ly lên xe ôtô để có thể khởi hành sớm.", "eng": "He put the cases in the car so that he should be able to make an early start."}, {"viet": "Ông ta đã không chịu để cho thẩm vấn về bạn bè của ông ta.", "eng": "He refused to be interrogated about his friends."}, {"viet": "Anh ta viết một mạch xong bài báo cho tờ báo địa phương.", "eng": "He runs off an article for the local newspaper."}, {"viet": "Hắn đã trở thành mục tiêu của sự chế giễu.", "eng": "He's become an object of ridicule."}, {"viet": "Hắn chỉ là một kẻ lừa đảo đáng khinh.", "eng": "He's just a cheap crook."}, {"viet": "Ông ấy là tâm điểm của sự chú ý đấy.", "eng": "He's the center of attention."}, {"viet": "Anh ta thấy một vật trắng đi ngang qua phố.", "eng": "He saw a white blob crossing the street."}, {"viet": "Ông ta đã chi phối lịch sử cũng như bị lịch sử chi phối.", "eng": "He shaped history as well as being shaped by it."}, {"viet": "Hắn đóng cái nắp hộp đó xuống cái tách.", "eng": "He snapped down the lid of the box."}, {"viet": "Ông ta lại bắt đầu mắng mỏ chúng tôi vì chất lượng công việc kém.", "eng": "He started in on us again for poor work."}, {"viet": "Đột nhiên nó công kích tôi mà chẳng có lý do gì cả.", "eng": "He suddenly launched out at me for no reason at all."}, {"viet": "Anh ta cho phép mình hưởng thêm một chai nữa.", "eng": "He thought he would indulge himself by opening another bottle."}, {"viet": "Ông ta xé tan bản thảo trong cơn bực bội vô cớ.", "eng": "He tore up the manuscript in a fit of petulance."}, {"viet": "Nó đóng vai chính kém gây ảnh hưởng lớn.", "eng": "He underacted the title-role to considerable effect."}, {"viet": "Ông ta muốn bỏ hết tất cả mọi vật sở hữu hiện đại và trở về với đời sống tự nhiên.", "eng": "He wants to give away all his modern possessions and return to nature."}, {"viet": "Anh ta bị lôi cuốn bởi cô gái và cô này cũng đáp lại tình cảm của anh ta.", "eng": "He was attracted to the girl, who returned his affection."}, {"viet": "Một thông điệp giả đã dụ anh ta.", "eng": "He was decoyed by a false message."}, {"viet": "Anh ta phải ngồi tù sáu tháng vì có tham gia vào vụ cướp.", "eng": "He was goaled for six months for his part in the robbery."}, {"viet": "Anh ta chưa bao giờ thích việc nấu nướng trước đây, nhưng bây giờ thì lại chúi đầu vào bếp.", "eng": "He was never interested in cooking before, but now he's been bitten by the bug."}, {"viet": "Anh ta tức giận có lý về quyết định đó.", "eng": "He was rightly furious at the decision."}, {"viet": "Anh ấy là người duy nhất giúp đỡ các nạn nhân.", "eng": "He was the only one who lifted a finger to help the victims."}, {"viet": "Nó tự cân trên bàn cân trong buồng tắm.", "eng": "He weighed himself on the bathroom scales."}, {"viet": "Anh ta thức dậy, ngáp và vươn vai.", "eng": "He woke up, yawned and stretched."}, {"viet": "Đứng đầu một cuộc nổi dậy, một chính phủ, một đoàn đại biểu.", "eng": "Head a rebellion, government, delegation."}, {"viet": "Phạm vi hoạt động của cô ấy bao gồm quần vợt và hội hoạ.", "eng": "Her activities include tennis and painting."}, {"viet": "Đôi má cô ta đầm đìa nước mắt.", "eng": "Her cheeks were wet with tears."}, {"viet": "Lương giáo viên của cô ấy lên tới 8.500 pao một năm.", "eng": "Her emoluments as a teacher amounted to 8500 pounds a year."}, {"viet": "Tóc và mắt của cô ấy đều màu nâu nhạt.", "eng": "Her hair and eyes are light brown."}, {"viet": "Công việc của cô ấy có liên quan đến máy tính.", "eng": "Her job has something to do with computers."}, {"viet": "Họ tên cô ấy là Mary Wilson, tên cô ấy là Mary.", "eng": "Her name is Mary Wilson, her first name is Mary."}, {"viet": "Đặc điểm nổi bật nhất của cô ấy là tính trung thực.", "eng": "Her predominant characteristic is honesty."}, {"viet": "Váy cô ấy căng phồng lên trong gió.", "eng": "Her skirt ballooned in the wind."}, {"viet": "Giọng cô ta lạc đi khi thuật lại cái tin khủng khiếp đó.", "eng": "Her voice broke as she told the dreadful news."}, {"viet": "Từ đây con đường dốc dần ra tới biển.", "eng": "Here there is a gradual descent to the sea."}, {"viet": "Việc bổ nhiệm ông ấy đã được đăng trong công báo tuần trước.", "eng": "His appointment was gazetted last week."}, {"viet": "Việc kinh doanh của hắn ta chỉ là cái lốt che đậy việc buôn bán ma tuý.", "eng": "His business was a cover for drug dealing."}, {"viet": "Cái chết của nó là một nỗi đau buồn lớn lao cho toàn thể gia đình.", "eng": "His death was a great distress to all the family."}, {"viet": "Mặt anh ta sưng lên vì vết muỗi cắn.", "eng": "His face was bulging with mosquito bites."}, {"viet": "Chỗ ngồi quen thuộc của cô ta tại bàn.", "eng": "His habitual place at the table."}, {"viet": "Triết lý của ông ta về luật-tầm nhìn của ông ta về những qui luật đòi hỏi-thì hời hợt và không đầy đủ.", "eng": "His jurisprudence-his vision of what the rule of law requires-is superficial and inadequate."}, {"viet": "Nhiệm vụ khủng khiếp nhất của anh ta với tư cách phóng viên nước ngoài là báo cáo về cuộc chiến tranh ở Serbia.", "eng": "His most terrifying assignment as a foreign correspondent was to report the war in Serbia."}, {"viet": "Quyền lợi được hưởng của anh ta gồm cả một chiếc ô tô do công ty cấp.", "eng": "His perks include a car provided by the firm."}, {"viet": "Thanh danh của anh ta không có chút tì vết.", "eng": "His reputation is without a blemish."}, {"viet": "Câu chuyện của anh ta có thể là không thể tin được, nhưng nghe có vẻ thật.", "eng": "His story may seem incredible, but it rang true."}, {"viet": "Cậu bé bị vỡ tiếng lúc 13 tuổi.", "eng": "His voice broke when he was thirteen."}, {"viet": "Tự mình chuẩn bị sẵn sàng nắm quyền kiểm soát.", "eng": "Hold oneself in readiness to take control."}, {"viet": "Giá nhà đang hạ, lúc này là lúc nên mua.", "eng": "House prices are low, it's a good time to buy."}, {"viet": "Sao anh có thể tồi như thế mà vẫn coi mình là bạn của tôi?", "eng": "How can you be so unkind and still call yourself my friend?"}, {"viet": "Làm sao họ có thể chui được tất cả vào trong cái nhà búp bê này?", "eng": "How do they all cram into that doll's house?"}, {"viet": "Nhà hàng các cô mở cửa đến mấy giờ?", "eng": "How late are you open until?"}, {"viet": "Có bao nhiêu quốc gia sẽ tham dự cúp thế giới?", "eng": "How many countries will be taking part in the World cup?"}, {"viet": "Tiền mặt đã được cấp là bao nhiêu rồi?", "eng": "How much cash has been allotted?"}, {"viet": "Anh bao nhiêu tuổi?''Bốn mươi.''Thôi đi! Anh trông không thể quá ba mươi lăm lấy một ngày!'.", "eng": "How old are you?''I'm forty.''Get along with you! You don't look a day over thirty five!'."}, {"viet": "Ngồi sụp xuống để tránh gió lạnh buốt.", "eng": "Hunkered down to avoid the icy wind."}, {"viet": "Tôi thật sự muốn biết chuyện gì đang xảy ra ở hậu trường của chính phủ.", "eng": "I'd like to know what really goes on backstage in government."}, {"viet": "Để tôi xem lại … Xin lỗi, chúng tôi chỉ có bánh nướng sô-cô-la.", "eng": "I'll check. Sorry, we only have chocolate pie."}, {"viet": "Tôi sẽ để cho anh tìm cách giải quyết vấn đề này.", "eng": "I'll leave you to sort this problem out."}, {"viet": "Tôi là người hết sức tin tưởng không khí trong lành là vị thuốc chữa bệnh.", "eng": "I'm a great believer in fresh air as a cure for illness."}, {"viet": "Tôi có chết cũng không để cô ta thoát vụ đó!", "eng": "I'm damned if I'm going to let her get away with that!"}, {"viet": "Tôi sẽ dùng gỗ đào để đóng tủ sách.", "eng": "I'm going to use mahogany to make the book-case."}, {"viet": "Tớ sẽ không cho nó vay tiền-cậu nghĩ tớ dở hơi chắc?", "eng": "I'm not going to lend money-do you think I'm crackers?"}, {"viet": "Mẹ xin lỗi, nhưng mẹ chưa tìm được chìa khóa.", "eng": "I'm sorry, but I just can't find the key."}, {"viet": "Tôi đang theo học một lớp hàm thụ về kinh doanh.", "eng": "I'm taking a correspondence course in business studies."}, {"viet": "Tôi vẫn luôn luôn nghĩ anh ta trông rất đàn ông trong bộ quân phục.", "eng": "I've always thought he looked very manly in his uniform."}, {"viet": "Tôi ăn quá nhiều, đến mức bụng muốn vỡ ra.", "eng": "I've eaten so much I feel ready to burst."}, {"viet": "Tôi vừa gặp cậu em rể tôi, tôi nghĩ anh ta đang trên đường tiến hoá.", "eng": "I've just met my new brother-in-law and I think he's the missing link."}, {"viet": "Tôi đã nói với anh rồi-đừng có mó vào đồ đạc của tôi!", "eng": "I've told you before-leave my things alone!"}, {"viet": "Tôi luôn đòi cho được bánh mì làm bằng bột thô.", "eng": "I always insist on whole meal bread."}, {"viet": "Tôi sẵn sàng cho anh vay tiền nếu anh hứa trả.", "eng": "I am prepared to lend you the money if you promise to pay it back."}, {"viet": "Tôi cứ nghĩ rằng bà ấy là mẹ anh ta nhưng thực sự bà ấy là cô anh ta.", "eng": "I assumed she was his mother, but in fact she's his aunt."}, {"viet": "Tôi tính rằng chúng ta sẽ tới London vào khoảng 3 giờ chiều.", "eng": "I calculate that we will reach London at about 3 pm."}, {"viet": "Tôi e rằng không thể giúp anh-chuyện đó ở ngoài tầm tay của tôi.", "eng": "I can't help you, I'm afraid-the matter is out of my hands."}, {"viet": "Lúc nào anh cũng có thể ăn bánh pi-za, hoặc mì ống Ý.", "eng": "I can always eat pizza, or spaghetti."}, {"viet": "Tôi không thể nhảy theo nhạc nếu không có nhịp điệu tốt.", "eng": "I cannot dance to music without a good rhythm."}, {"viet": "Tôi đã đổi chiếc ti vi đen trắng lấy chiếc ti vi màu.", "eng": "I changed my black and white television for a colour set."}, {"viet": "Tôi không thể chịu đựng nổi sức nóng dữ dội đó.", "eng": "I couldn't withstand the murderous heat."}, {"viet": "Tôi không dám để cho Bill tự do ngoài vườn-nó sẽ nhổ hết hoa.", "eng": "I daren't let Bill loose on the garden-he'd pull up all the flowers."}, {"viet": "Tôi chẳng ưa chồng cô ta tí nào.", "eng": "I didn't take to her husband at all."}, {"viet": "Tôi không biết liệu tôi còn đến được nữa không, nhưng mai tôi sẽ cho anh biết.", "eng": "I don't know if I can come yet, but I'll let you know tomorrow."}, {"viet": "Tôi không tin một chút nào là nó sẽ đồng ý.", "eng": "I don't suppose for a minute that he'll agree."}, {"viet": "Tôi không muốn làm ầm lên về chuyện này nhưng tuần này anh đã ba lần đến làm việc chậm.", "eng": "I don't want to make a big thing of it but you have been late for work three times this week."}, {"viet": "Bây giờ thì tôi không muốn vậy.", "eng": "I don't think so now."}, {"viet": "Tôi cảm thấy giận, nhưng nụ cười của cô ta đã xoa dịu tôi.", "eng": "I feel angry, but her smile disarmed me."}, {"viet": "Cuối cùng tôi đã gỡ ra khỏi một mối quan hệ không mấy vui vẻ.", "eng": "I finally manage to disentangle myself from an unhappy relationship."}, {"viet": "Tôi bị mũi kim đâm vào ngón tay.", "eng": "I gave my finger a prick with a needle."}, {"viet": "Tôi cho đó là lí do tại sao tôi yêu cô ấy.", "eng": "I guess that's why I love her."}, {"viet": "Tôi có nhiệm vụ chẳng thích thú gì là báo cho họ biết về các vụ cắt giảm nhân viên.", "eng": "I had the unenviable task of telling them about the staff cuts."}, {"viet": "Tôi có đặt phòng ở khách sạn cô trong ba ngày.", "eng": "I have a reservation with you for three days."}, {"viet": "Tôi thấy không có gì sai sót trong công việc của anh cả.", "eng": "I have no fault to find with your work."}, {"viet": "Tôi phải ôn luyện lại tiếng Pháp của mình.", "eng": "I have to rub up on my French."}, {"viet": "Tôi vẫn chưa nói chuyện với anh.", "eng": "I haven't talked to you yet."}, {"viet": "Hy vọng lần này thì tôi không sai.", "eng": "I hope I'm right this time."}, {"viet": "Tôi đã dự định làm việc đó, nhưng tôi sợ rằng tôi đã quên.", "eng": "I intended to do it, but I'm afraid I forgot."}, {"viet": "Tôi biết được bằng cách xem những tấm hình của bạn lúc bạn còn nhỏ?", "eng": "I know just by looking at your pictures when you were younger?"}, {"viet": "Tôi thích tiền của tôi được gửi trong ngân hàng của anh.", "eng": "I like my money to be deposited in your bank."}, {"viet": "Tôi sẽ gọi điện cho anh ấy ngay bây giờ.", "eng": "I'll call him right now."}, {"viet": "Tôi sẽ xem ông ấy có rảnh để gặp cô không.", "eng": "I'll see if he is free to see you."}, {"viet": "Tôi e rằng điều tệ hơn sẽ xảy ra.", "eng": "I'm afraid there is worse to come."}, {"viet": "Tôi đến đây để gặp ông John Smith.", "eng": "I'm here to see John Smith."}, {"viet": "Rất tiếc, nó không có ở nhà.", "eng": "I'm sorry, he isn't home."}, {"viet": "Tôi kéo được ông ta xuống giá từ 500 còn 450 bảng Anh.", "eng": "I managed to knock him down from £ 500 to £ 450."}, {"viet": "Tôi phải đưa đi hấp tẩy sạch bộ đồ này.", "eng": "I must have this suit cleaned."}, {"viet": "Tôi không cần phải nhắc là giá cả mà ông cho chúng tôi chắc là có tính cạnh tranh.", "eng": "I needn't mention that the price you give us must be competitive."}, {"viet": "Tôi đã dự tính quá nhiều lượng sữa cần dùng cho kỳ nghỉ cuối tuần.", "eng": "I overestimated the amount of milk we'd need for the weekend."}, {"viet": "Tôi không uống cà phê ban đêm vì nó làm tôi mất ngủ.", "eng": "I quit a drinking coffee at night because it kept me awake."}, {"viet": "Tôi lảo đảo trong cơn choáng váng.", "eng": "I reeled round in a daze."}, {"viet": "Tớ đã thấy ma!''Thật không? Ở đâu thế?'.", "eng": "I saw a ghost!''Indeed? Where was it?'."}, {"viet": "Tôi sẽ về muộn, vậy đừng thức khuya ( đợi tôi ).", "eng": "I shall get back late, so don't sit up ( for me )."}, {"viet": "Chẳng mấy chốc tôi đã mê mẩn với sự hấp dẫn của bộ phim đó.", "eng": "I soon lost myself in the excitement of the film."}, {"viet": "Tôi nghi ngờ họ đang hoạch định cái gì đó nhưng họ chưa tiết lộ ra.", "eng": "I suspect they're planning something but they haven't shown their hand yet."}, {"viet": "Tôi nghĩ tôi đã nhớ tắt bếp rồi nhưng tốt hơn anh nên kiểm tra lại xem tôi tắt chưa.", "eng": "I think I remembered to switch the oven off but you'd better check up that I did."}, {"viet": "Con nghĩ chúng ta có kem đánh giày màu đen thôi.", "eng": "I think we have black shoe cream."}, {"viet": "Tôi đã bảo anh là đừng có đụng vào những thứ của tôi!", "eng": "I told you not to touch my things!"}, {"viet": "Tôi biết họ muốn thử món nào khác lạ.", "eng": "I understand they would like to try something different."}, {"viet": "Tôi muốn cái đó được đánh máy ngay lập tức.", "eng": "I want it typed right away, please."}, {"viet": "Tôi muốn phơi nắng cho rám cái lưng thêm một chút nữa.", "eng": "I want to tan my back a bit more."}, {"viet": "Tôi lấy làm thất vọng về diễn xuất của anh ta.", "eng": "I was disappointed with his performance."}, {"viet": "Tôi không ăn ngon cả tuần rồi.", "eng": "I was off my food for a week."}, {"viet": "Tôi đang nghĩ đến việc theo học khóa học đó và kỳ nghỉ tới.", "eng": "I was thinking of taking that course next semester."}, {"viet": "Tôi sẽ hợp tác với điều kiện tôi được thông báo kịp thời.", "eng": "I will cooperate as long as I am notified on time."}, {"viet": "Tôi thức dậy với cơn đau đầu sáng nay.", "eng": "I woke up with a very thick head this morning."}, {"viet": "Tôi làm việc bán phần, thời gian còn lại tôi trông nom con cái.", "eng": "I work part-time and look after my children and look after my children the rest of the time."}, {"viet": "Tôi muốn gặp lại các bạn.", "eng": "I would like to see you again."}, {"viet": "Kem có phủ nước sô cô la bên trên.", "eng": "Ice-cream topped with chocolate sauce."}, {"viet": "Tao mà bắt được mày ăn cắp lần nữa, tao sẽ cho mày một trận nhừ tử!", "eng": "If I catch you stealing again, I'll beat the living daylights out of you!"}, {"viet": "Nếu cô ta nói như thế, thì quả thật cô ta đã nói dối không ngượng mồm.", "eng": "If she said that, she was telling a real whopper."}, {"viet": "Nếu chúng mình không đủ tiền đi Pháp, chúng mình hãy đi Ý vậy.", "eng": "If we can't afford France, let's go to Italy then."}, {"viet": "Nếu anh không ngăn được chó của anh ( khỏi cắn người ) thì anh phải nhốt nó lại.", "eng": "If you can't restrain your dog ( from biting people ), you must lock it up."}, {"viet": "Nếu anh có giường thừa, tôi có thể ở lại tối nay không?", "eng": "If you have a spare bed, may I stay tonight?"}, {"viet": "Nếu anh nghĩ là sẽ không còn chiến tranh nữa thì là anh đang sống trong một thế giới mộng ảo.", "eng": "If you think there won't be any more wars, you're living in a dream world."}, {"viet": "Trong câu'Đây dứt khoát là một phép màu!','dứt khoát'được dùng làm từ nhấn mạnh.", "eng": "In'It's a bloody miracle!','bloody'is used as an intensive word."}, {"viet": "Trong các từ điển, từ được liệt kê theo thứ tự vần.", "eng": "In dictionaries, words are listed according to their orthography."}, {"viet": "Ở nhiều công viên, du khách có thể bơi lội, câu cá, tham dự các buổi thuyết trình và các hoạt động giải trí khác.", "eng": "In many parks, visitors can swim, go fishing, attend lectures and other recreational activities."}, {"viet": "Không có những chính sách đặc biệt do các chuyên gia vạch ra nên phải thay bằng phương pháp tạm thời.", "eng": "In the absence of specific policies carefully tended by specialists, adhocism took place."}, {"viet": "Trong cảnh tĩnh lặng nàng đang hưởng, vẫn có chen vào một chút buồn không sao diễn tả nổi.", "eng": "In the tranquility she enjoyed there was an alloy of inexpressible sadness."}, {"viet": "Công nghiệp được bảo vệ bởi các khoản thuế quan đánh vào hàng nhập khẩu của nước ngoài.", "eng": "Industry cosseted by tariffs on foreign imports."}, {"viet": "Không nghi ngờ gì nữa, đó là tiến trình hành động tốt nhất.", "eng": "Is indubitably the best course of action."}, {"viet": "Có mối liên hệ gì giữa việc hút thuốc với bệnh ung thư phổi không?", "eng": "Is there a connection between smoking and lung cancer?"}, {"viet": "Điều quan trọng sống còn là phải huỷ bỏ lệnh đó ngay lập tức.", "eng": "Is vitally important to cancel the order immediately."}, {"viet": "Và đó là một cuộc tranh cướp bóng ngay trong nửa phần sân đội Welsh.", "eng": "It's a scrummage just inside the Welsh half …."}, {"viet": "Vượt các xe khác ở đoạn đường hẹp này rất nguy hiểm.", "eng": "It's dangerous to pass on this narrow road."}, {"viet": "Không thể nào quay ngược lại dòng xe cộ.", "eng": "It's impossible to back out of the traffic."}, {"viet": "Đó không phải là một sự hào phóng mà trái lại là sự tư lợi.", "eng": "It's not generosity, rather self-interest."}, {"viet": "Có được việc làm vào thời này là cả một chuyện đấy.", "eng": "It's something to have a job at all these days."}, {"viet": "Muộn quá rồi, chắc gần 12 giờ.", "eng": "It's very late, it must be nearly 12 o'clock."}, {"viet": "Tôi có cảm giác dù sao chúng ta cũng phải đi.", "eng": "It feels to me as though we ought to go."}, {"viet": "Thật khó có thể giữ được lòng tự trọng trong công việc đó.", "eng": "It is difficult to preserve one's self-respect in that job."}, {"viet": "Có thể tới thành phố bằng xe lửa không, hay tôi phải đi xe buýt?", "eng": "It is possible to get to the city by train, or must I take a bus?"}, {"viet": "Có thể phải mất hàng tháng mới xong được.", "eng": "It may be a matter of months before it's ready."}, {"viet": "Hôm nay sẽ là một ngày tuyệt đẹp đấy.", "eng": "It's going to be a beautiful day."}, {"viet": "Nó dường như là một nơi vắng vẻ.", "eng": "It seems as though the place is deserted."}, {"viet": "Người ta tiết lộ rằng băng cướp có nội ứng ở trong ngân hàng.", "eng": "It transpired that the gang had had a contact inside the bank."}, {"viet": "Khó mà tìm được những từ thích hợp với dịp này.", "eng": "It was difficult to find words worthy of the occasion."}, {"viet": "Anh thật là sáng suốt vì đã khoá cửa lại.", "eng": "It was sensible of you to lock the door."}, {"viet": "Đi xe hơi phải mất nhiều ngày cho nên chúng ta hãy đi máy bay.", "eng": "It will take days by car, so let's fly instead."}, {"viet": "Janes hứa dẫn tôi đi tham quan.", "eng": "Jane has promised to show me around."}, {"viet": "Kết hợp hai người lại với nhau trong hôn nhân.", "eng": "Join two people together in marriage."}, {"viet": "Các anh cứ nói chuyện với nhau đi, một lát tôi sẽ quay lại.", "eng": "Keep talking amongst yourselves, I'll be back in a minute."}, {"viet": "Ta hãy bỏ các nghi thức đi: cứ gọi tôi là Mike.", "eng": "Let's drop the formalities: call me Mike."}, {"viet": "Chúng ta hãy bàn về một việc khác nhé.", "eng": "Let's talk about something else."}, {"viet": "Nhiều khách du lịch từ Tây Ban Nha, Pháp hoặc bất cứ nào khác tới.", "eng": "Many foreign tourists from Spain, France or wherever."}, {"viet": "Đi bên, diễu hành qua, tiến vào, rút ra, đi khỏi, đi xa, v. v.", "eng": "March by, past, in, out, off, away, etc."}, {"viet": "Cho phép tôi uống một tách cà phê nữa nhé?", "eng": "May I have another cup of coffee, please?"}, {"viet": "Có lẽ bạn nên thử mặc nó màu sáng hơn.", "eng": "Maybe you should try it in a brighter color."}, {"viet": "Tôi ngờ rằng hầu hết mọi người không nhận thức rõ điều này.", "eng": "Most people don't, I suspect, realize this."}, {"viet": "Thật là thất vọng, anh ta đã về hạng chót.", "eng": "Much to his chagrin, he came last in the race."}, {"viet": "Quyết định của tôi không phải là một tiền lệ.", "eng": "My decision does not constitute a precedent."}, {"viet": "Lời nói của tôi không hoàn toàn là vị tha.", "eng": "My invitation was not completely altruistic."}, {"viet": "Bản báo cáo của tôi đã xong nhưng nó nhem nhuốc quá-tôi cần thời gian để làm một bản viết sạch sẽ.", "eng": "My report is finished but it's very messy-I need time to make a fair copy."}, {"viet": "Các quốc gia đã bị áp bức hàng thế kỷ nay đang đấu tranh đòi quyền bình đẳng.", "eng": "Nations that had been oppressed for centuries were now fighting for a place in the sun."}, {"viet": "Nguyễn Trường Tộ dâng bản điều trần lên nhà vua để tìm cách cải tổ toàn diện.", "eng": "Nguyen Truong To presented an apologia to the King in seeking general reforms."}, {"viet": "Không tiếp tục lại ngay công việc xây dựng.", "eng": "No immediate resumption of building work."}, {"viet": "Bây giờ, sang việc kinh doanh hiện nay: mặt hàng mới của chúng ta là tua vít và chìa vặn đai ốc.", "eng": "Now, to the business of the day: our new line of screwdrivers and wrenches."}, {"viet": "Giành được 81 điểm trong số điểm tối đa là 100.", "eng": "Obtain 81 marks out of a maximum of 100."}, {"viet": "Ồ đừng lo, như vậy là đúng quá đi chứ.", "eng": "Oh don't worry, that's quite all right."}, {"viet": "Trên sườn đồi, chúng tôi có thể nhìn thấy hình những con cừu đi trong sương.", "eng": "On the hillside, we could see the vague shapes of sheep coming through the mist."}, {"viet": "Một trong những trách nhiệm đầu tiên của cha mẹ là chăm sóc con nhỏ.", "eng": "One of parents primary responsibilities is childcare."}, {"viet": "Người chỉ đạo nghệ thuật của chúng tôi đã có công thuyết phục được dàn nhạc đến chơi cho chúng tôi.", "eng": "Our artistic director was instrumental in persuading the orchestra to come and play for us."}, {"viet": "Những khẩu súng của chúng tôi bắn tới tấp vào quân thù.", "eng": "Our guns kept blazing away at the enemy."}, {"viet": "Đề nghị của chúng tôi đang đợi cơ quan lãnh đạo bật đèn xanh.", "eng": "Our proposals are waiting for the green light from head office."}, {"viet": "Do chiến tranh chương trình y tế của chính phủ đã bị cắt giảm một cách nghiêm trọng.", "eng": "Owing to the war, the government's public health programme had to be severely curtailed."}, {"viet": "Tiền thù lao sẽ phải tương ứng với khối lượng công việc đã làm.", "eng": "Payment will be proportional to the amount of work done."}, {"viet": "Thức ăn dễ ôi thiu cần phải được giữ trong tủ lạnh.", "eng": "Perishable food should be stored in a refrigerator."}, {"viet": "Cảnh sát cố làm dịu đi tình trạng hỗn độn ở khu trung tâm gây rối.", "eng": "Police tried to make disturbance tumult in storm center."}, {"viet": "Hiện giờ món vịt quay đã hết.", "eng": "Roast duck is used up now."}, {"viet": "Nhiều cặp đang ở trên sàn nhảy.", "eng": "Several couples were on the dance floor."}, {"viet": "Bà ta là một phụ nữ có nghề nghiệp đồng thời là một người mẹ, như thế là bà ta vẹn cả hai đàng.", "eng": "She's a career woman and a mother, so she has the best of both worlds."}, {"viet": "Cô ấy đã nghỉ học một tháng nay, vì thế cô ấy cần nhiều thời gian để bắt cho kịp.", "eng": "She's been off school for a month, so she has a lot of leeway to make up."}, {"viet": "Cô ta đứng đầu trong giới nhà báo.", "eng": "She's in the top flight of journalists."}, {"viet": "Lúc này cô ta không được ông chủ của cô ta ưa thích lắm.", "eng": "She's rather unpopular with her boss at the moment."}, {"viet": "Cô ta gặp khó khăn từ khi cô ta bị đuổi việc.", "eng": "She's been in deep water ever since she got fired from her job."}, {"viet": "Chị ấy còn đắn đo giữa sự hấp dẫn của đồng lương cao và cái triển vọng phải làm việc nhiều giờ.", "eng": "She balanced the attractions of a high salary against the prospect of working long hours."}, {"viet": "Bà ấy cho là tiền nong đã bị phung phí và các khó khăn về tài chính của chúng tôi dường như chứng minh quan điểm đó.", "eng": "She claimed that money had been wasted and our financial difficulties seemed to prove her point."}, {"viet": "Cô ta quyết định không phá thai.", "eng": "She decided not to go through with the abortion."}, {"viet": "Cô ta chêm cái sự việc ấy vào chỉ cốt để làm tôi lúng túng.", "eng": "She dragged up that incident just to embarrass me."}, {"viet": "Cô ấy cảm thấy buồn vì kỳ nghỉ đang hết.", "eng": "She felt very sad that the holiday was ending."}, {"viet": "Khi nào tôi lại gần bàn làm việc của cô ta là cô ta lại trừng mắt nhìn tôi.", "eng": "She glares at me if I go near her desk."}, {"viet": "Mặc dầu bề ngoài có vẻ thô thiển, cô ta có nhiều đức tính tốt.", "eng": "She had many good qualities despite her apparent rudeness."}, {"viet": "Chị ấy có những đợt làm việc vất vả tiếp theo là những thời kỳ dài không hoạt động gì.", "eng": "She has bouts of hard work followed by long periods of inactivity."}, {"viet": "Cô ấy nâng váy lên và bắt đầu nhảy.", "eng": "She hoicked up her skirt and began to dance."}, {"viet": "Cô ta là một trong những người mẫu thời trang hàng đầu trong nước.", "eng": "She is one of the country's top models."}, {"viet": "Cô ấy biết cô ấy đã được sắp đặt cho một tương lai to lớn.", "eng": "She knew she was destined for a great future."}, {"viet": "Cô ta trông có vẻ sắp sửa gục ngã bất cứ lúc nào.", "eng": "She looked ready to collapse at any minute."}, {"viet": "Cô ta chuyển đến Luân Đôn, nơi cô ta bỗng nhiên trở thành một người mê văn hoá.", "eng": "She moved to London, where she suddenly turned into a real culture vulture."}, {"viet": "Cô ấy đã nhặt một hòn đá và ném xuống sông.", "eng": "She picked up the stone and threw it into the river."}, {"viet": "Cô ta đọc hết bức thư, cau mày vì nội dung của nó.", "eng": "She read through the letter, frowning at its contents."}, {"viet": "Cô ta lúc nào cũng xét nét, tìm cách bắt lỗi tôi.", "eng": "She's always finding fault with me."}, {"viet": "Cô ta cuộn tóc lên đỉnh đầu.", "eng": "She's put her hair up."}, {"viet": "Cô ta nhanh chân thu và đăng được câu chuyện trước mọi báo khác trong nước.", "eng": "She scooped all the national newspapers to get the story."}, {"viet": "Cô ấy ra hiệu sự khẳng định của mình bằng cái gật đầu.", "eng": "She signaled her affirmation with a nod."}, {"viet": "Cô ấy vẫn giữ đúng từng từ cô ấy đã nói.", "eng": "She still stands by every word she said."}, {"viet": "Sau đó bà ấy định viết một cái gì đó mang nhiều hoài bão hơn, một cuốn tiểu thuyết 12.000 từ.", "eng": "She then attempted something more ambitious, a novel of 2120.000 words."}, {"viet": "Cô ấy quặp ngón chân vào trong khi bước đi.", "eng": "She turns her toes inwards when she walks."}, {"viet": "Bà ta là một phụ nữ đẹp tuyệt trần.", "eng": "She was a woman of great beauty."}, {"viet": "Nàng đã hối hận buổi sáng nay sau khi cơn giận của nàng bùng nổ.", "eng": "She was contrite this morning after her anger had outburst."}, {"viet": "Cô ấy là người phụ trách nên tôi đã phải giả bộ tán đồng những ý nghĩ kỳ quặc của cô ấy.", "eng": "She was in charge, so I had to play along with her odd ideas."}, {"viet": "Một ông giáo hay nạt nộ và trình độ kém đã làm cho cô ớn môn toán học.", "eng": "She was put off maths by a bullying and incompetent teacher."}, {"viet": "Bà ta có mặt ở đó nhưng có điều đáng chú ý là ông chồng thì lại không.", "eng": "She was there but her husband, interestingly, wasn't."}, {"viet": "Mụ ta tấn công ông ấy bằng một con dao khắc gỗ.", "eng": "She went for him with a carving knife."}, {"viet": "Cô ta chiếm được ghế đó bằng một chênh lệch là 10 phiếu bầu.", "eng": "She won the seat by a margin of ten votes."}, {"viet": "Hãy rọi đèn pin của anh vào ngăn kéo.", "eng": "Shine your torch into the drawer."}, {"viet": "Lựa lọc các ứng viên cho công việc đó.", "eng": "Sifted the candidates for the job."}, {"viet": "Ngồi trên những ghế đẩu quanh bàn.", "eng": "Sitting on stools around the table."}, {"viet": "Smith đã được bầu làm Nghị sĩ đại diện cho khu vực Bath.", "eng": "Smith was returned as MP for Bath."}, {"viet": "Vì vậy mười xu là một hào, hai mươi xu là hai hào.", "eng": "So ten fen is one jiao, twenty fen is two jiao."}, {"viet": "Một ít đô la Canada bằng ngân phiếu du lịch do ngân hàng Hoàng Gia Canada phát hành.", "eng": "Some Canadian dollars in traveller's cheques issued by Royal Bank of Canada."}, {"viet": "Một số trong chúng tôi giống như giám đốc vậy.", "eng": "Some of us are like managers."}, {"viet": "Một số công nhân vẫn không gắn bó với dự án.", "eng": "Some workers remain uncommitted to the project."}, {"viet": "Xin lỗi, tôi đã làm cháy bánh mì nướng.", "eng": "Sorry, I've burnt the toast."}, {"viet": "Hàng thể thao có rất nhiều thứ.", "eng": "Sports goods cover too wide an area."}, {"viet": "Các bậc thang được khoét sâu vào phần dày của bức tường.", "eng": "Steps cut into the thickness of the wall."}, {"viet": "Các vựa ngũ cốc thường xuyên bị côn trùng chuột bọ tấn công, nhất là chuột.", "eng": "Stores of gain are frequently attacked by pests, especially rats."}, {"viet": "Các chính quyền kế tiếp nhau đều không giải quyết được các vấn đề kinh tế của đất nước.", "eng": "Successive administrations have failed to solve the country's economic problems."}, {"viet": "Sumi uống một liều aspirin và đi ngủ.", "eng": "Sumi dosed herself with aspirin and went to bed."}, {"viet": "Quét những mảnh bánh vụn ra khỏi cái bàn vào trong cái hốt rác.", "eng": "Sweep the crumbs off the table into the dustpan."}, {"viet": "Lấy ba quả trứng và đánh nhẹ chúng.", "eng": "Take three eggs and beat them gently."}, {"viet": "Kể cho một người bạn những chi tiết riêng tư của cuộc đời của mình.", "eng": "Tell a friend the intimate details of one's life."}, {"viet": "Rất cám ơn anh vì đã mời tôi đến thăm nhà.", "eng": "Thank you very much for having me over."}, {"viet": "Nữ diễn viên đó có nhiều nếp nhăn trên mặt.", "eng": "That actress has many wrinkles on her face."}, {"viet": "Người thợ làm tóc đó thực sự đã làm hỏng tóc tôi.", "eng": "That hairdresser really butchered my hair."}, {"viet": "Tòa nhà bê tông mới kia là một thứ đáng ghét.", "eng": "That new concrete building is an abomination."}, {"viet": "Đó là việc tôi làm chủ yếu.", "eng": "That's what I do mostly."}, {"viet": "Điều đó sẽ được thực hiện qua ngân hàng của công ty của ông ở Luôn Đôn.", "eng": "That will be done through your company's bank in London."}, {"viet": "Những tài khoản của toàn bộ công ty được điều khiển trong một phòng ban.", "eng": "The accounts of the whole company are controlled in the one department."}, {"viet": "Mục đích của hội nghị là thúc đẩy tình hữu nghị quốc tế.", "eng": "The aim of the conference is to promote international friendship."}, {"viet": "Sự thông báo kết hôn của họ làm ngạc nhiên mọi người.", "eng": "The announcement of their engagement surprised every one."}, {"viet": "Nhiệm vụ của quân đội là phục hồi trật tự công cộng.", "eng": "The army's task was the restoration of public order."}, {"viet": "Kẻ tấn công ( cuộc tấn công ) đã bị đánh lui.", "eng": "The attacker ( the attack ) was beaten off."}, {"viet": "Cuối cùng em bé đã chào đời ngay sau lúc nửa đêm.", "eng": "The baby finally arrived just after midnight."}, {"viet": "Ngân hàng tịch biên tài sản thế chấp.", "eng": "The bank foreclosed on the mortgage."}, {"viet": "Những tia ánh sáng lướt qua bầu trời và tụ lại ở chiếc máy bay.", "eng": "The beams of light moved across the sky and focussed on the aircraft."}, {"viet": "Thế giới có hai quan điểm trái ngược nhau của thời hậu chiến.", "eng": "The bipolar world of the postwar period."}, {"viet": "Con thuyền vỡ tung ra từng mảnh.", "eng": "The boat was torn asunder on the rocks."}, {"viet": "Những cuốn sách sắp xếp lộn xộn, chúng tôi chưa có thì giờ để lọc nó ra.", "eng": "The books are arranged anyhow, we haven't had time to sort them out."}, {"viet": "Bọn trẻ đi cắm trại ở Hi Lạp năm ngoái.", "eng": "The boys went camping in Greece last year."}, {"viet": "Toà nhà cuối cùng không được sử dụng.", "eng": "The building eventually fell into disuse."}, {"viet": "Doanh nghiệp này được đặt dưới sự điều hành của ban giám đốc mới.", "eng": "The business is under new management."}, {"viet": "Chiếc xe ô tô đó đâm vào hàng rào cản rồi lộn xuống mương.", "eng": "The car caromed off the guard rail into the ditch."}, {"viet": "Sự nghiệp được tạo ra công khai-còn tài năng thì thuộc về lĩnh vực riêng tư.", "eng": "The career is born in public-talent in privacy."}, {"viet": "Nghệ thuật của người chơi đàn xen lô là rất gợi cảm.", "eng": "The cellist's bowing was very sensitive."}, {"viet": "Loại phim ảnh rẻ tiền đáp ứng thị hiếu thấp kém của công chúng sao?", "eng": "The cheapjack moviemaking that feeds on the low taste of mob?"}, {"viet": "Đứa trẻ ngồi phía sau lưng tài xế phía sau của xe hơi.", "eng": "The child sat in the back of the car behind the driver."}, {"viet": "Bọn trẻ con ăn rất nhiều bơ quết lên bánh mì của chúng.", "eng": "The children eat piles of butter on their bread."}, {"viet": "Trẻ em được trao cho các bà giữ trẻ trông nom ngay từ khi còn nhỏ.", "eng": "The children were farmed out to nannies at an early age."}, {"viet": "Thành phố đã ngừng chống cự chỉ sau một cuộc vây hãm ngắn.", "eng": "The city succumbed after only a short siege."}, {"viet": "Mô hình trưng bày của câu lạc bộ được lắp trên sàn một chiếc xe lớn và diễu hành qua đường phố chính.", "eng": "The club display was mounted on a huge float and paraded through the main street."}, {"viet": "Màu sắc ở Việt Nam vào mùa xuân không thể nào quên được.", "eng": "The colours of Vietnam in the spring are unforgettable."}, {"viet": "Công ty tuyên bố tiền lãi tăng.", "eng": "The company has declared increased profits."}, {"viet": "Việc tạo nên ý tưởng của cuốn sách mất năm phút, nhưng viết nó đã mất một năm.", "eng": "The conception of the book took five minutes, but writing it took a year."}, {"viet": "Các nút điều khiển đó ngang tầm mắt.", "eng": "The controls are at eye-level."}, {"viet": "Đất nước đó đã đi tới tình trạng bất lợi về mọi mặt: tình trạng thất nghiệp và thiếu thốn lương thực.", "eng": "The country has ended up with the worst of all worlds: inflation unemployment and food shortages."}, {"viet": "Những khớp xương kêu răng rắc của ông già.", "eng": "The creaking joints of an old man."}, {"viet": "Đám đông hò reo cổ vũ các cầu thủ.", "eng": "The crowd yelled out encouragement at the players."}, {"viet": "Chiếc tàu chở hàng bị hỏng đã được kéo về.", "eng": "The damaged freighter was taken in tow."}, {"viet": "Các luật sư biện hộ triệu tập một buổi họp để thảo luận về phương pháp đối phó.", "eng": "The defence lawyers held a meeting to discuss tactics."}, {"viet": "Các thám tử cố gắng chắp nối các sự kiện lại với nhau.", "eng": "The detectives tried to piece together the facts."}, {"viet": "Những cuộc thảo luận đã không đạt được những gì mà tôi mong đợi.", "eng": "The discussions didn't measure up to my expectations."}, {"viet": "Bác sĩ khuyên nghỉ ngơi một thời gian như là cách chữa trị tốt nhất đối với sự suy sụp tinh thần của ông ấy.", "eng": "The doctor prescribed a holiday as the best cure for his depression."}, {"viet": "Con chó nép mình sát lò sưởi cho ấm.", "eng": "The dog nestled up against the warm radiator."}, {"viet": "Bộ đồ không vừa và bị nhăn ở thắt lưng.", "eng": "The dress badly and puckered at the waist."}, {"viet": "Quỹ đạo của trái đất quanh mặt trời.", "eng": "The earth's obit round the sun."}, {"viet": "Chính sách mở rộng của đế chế ở Châu Á.", "eng": "The empire's expansionary policies in Asia."}, {"viet": "Việc tìm ra châu Mỹ mở ra một giai đoạn mới.", "eng": "The epoch-making discovery of America."}, {"viet": "Vận dụng lòng kiên nhẫn là điều chủ yếu trong các cuộc thương lượng ngoại giao.", "eng": "The exercise of patience is essential in diplomatic negotiations."}, {"viet": "Thất bát của mùa màng báo hiệu tai hoạ cho nông dân.", "eng": "The failure of their crops spelt disaster for the peasant farmers."}, {"viet": "Râu là một cách phân biệt tốt hơn cả.", "eng": "The feelers are the best help of all."}, {"viet": "Cuốn phim dựa trên cuốn tiểu thuyết đã khá tùy tiện cắt xén nội dung của nó.", "eng": "The film takes considerable liberties with the novel on which it is based."}, {"viet": "Hãng đó là một điển hình của sự ưu việt.", "eng": "The firm is a byword for excellence."}, {"viet": "Món cá có mùi vị lạ lùng.", "eng": "The fish has a queer taste."}, {"viet": "Những món chúng ta ăn có tác dụng như là nhiên liệu.", "eng": "The foods we eat serve as fuel."}, {"viet": "Đứa bé hoảng sợ bíu chặt lấy bàn tay mẹ nó.", "eng": "The frightened child gripped its mother's hand."}, {"viet": "Ở mạn bắc của khu vườn có trồng những cây thích lớn.", "eng": "The garden is flanked to the large maple trees."}, {"viet": "Cô gái hăm hở cho tôi xem ảnh của cô ấy.", "eng": "The girl was eager to show me her photographs."}, {"viet": "Thái độ cứng rắn của chính phủ đối với những người bãi công.", "eng": "The government's unbending attitude towards the strikers."}, {"viet": "Chính phủ sẽ thực hiện hệ thống tiền hưu mới trong năm năm tới.", "eng": "The government is going to phase in the new pension system over the next five years."}, {"viet": "Sự hoàn thiện dần dần của nền dân chủ hiện đại.", "eng": "The gradual flowering of modern democracy."}, {"viet": "Cánh rừng nhỏ bừng sáng khi trăng ló rạng.", "eng": "The grove brightened after the moon came out."}, {"viet": "Điện Thái Hoà cao 35 m, rộng 60 m.", "eng": "The hall of Supreme Harmony is 35 meters high, 60 meters wide."}, {"viet": "Vị anh hùng bước ra sân khấu ở màn 2.", "eng": "The hero makes his entrance on stage in Act 2."}, {"viet": "Những con ngựa bồn chồn muốn phi nước đại.", "eng": "The horses were raring to have a gallop."}, {"viet": "Ngôi nhà ở vào một vị trí nổi bật trên nền cây xanh của làng.", "eng": "The house is in a prominent position on the village green."}, {"viet": "Tảng băng quá mỏng để có thể chịu được sức nặng của ông.", "eng": "The ice is too thin to bear your weight."}, {"viet": "Những chính sách hỗn độn của chính quyền trước.", "eng": "The indiscriminate policies of the previous administration."}, {"viet": "Tình hình thế giới cực kỳ nghiêm trọng.", "eng": "The international situation is extremely serious."}, {"viet": "Công việc đó tạo cơ hội thăng chức.", "eng": "The job offers prospects of promotion."}, {"viet": "Chiếc ấm đun nước đang bốc hơi trên lò.", "eng": "The kettle was steaming on the stove."}, {"viet": "Ngay cả mặt đất cũng đóng băng ở nhiệt độ thấp như thế.", "eng": "The land itself freezes up in such low temperatures."}, {"viet": "Ông luật sư nhận được một giỏ đồ ăn thức uống của khách hàng nhân ngày giáng sinh.", "eng": "The lawyer received a hamper for christmas from his client."}, {"viet": "Những sách báo mới nhập của thư viện.", "eng": "The library's most recent acquisitions."}, {"viet": "Cửa hiệu địa phương có vài cái rađiô bán giá rẻ.", "eng": "The local shop has some radios going cheap."}, {"viet": "Cái máy này sử dụng rất đơn giản.", "eng": "The machine is quite simple to use."}, {"viet": "Người ấy đứng gần đấy khi hoả hoạn xảy ra.", "eng": "The man was standing around when the fire broke out."}, {"viet": "Vấn đề đang đề cập, đang thảo luận.", "eng": "The matter in hand, under discussion, etc."}, {"viet": "Không khí dịu tạo ra cảm giác mùa thu sắp tới rồi.", "eng": "The mellow air brought in the feel of imminent autumn."}, {"viet": "Bà Bộ trưởng đưa ra lời ám chỉ lộ liễu là bà có ý định tăng thuế.", "eng": "The Minister gave a broad hint that she intends to raise taxes."}, {"viet": "Các tu sĩ trong các tu viện gìn giữ những kiến thức của thời kỳ ban đầu.", "eng": "The monks in their monasteries kept alive the learning for earlier times."}, {"viet": "Người leo núi bị một hòn đá rơi trúng đấu.", "eng": "The mountaineer was struck on the head by a falling stone."}, {"viet": "Hiệp hội toàn quốc các câu lạc bộ công nhân.", "eng": "The National Union of Working Men's Clubs."}, {"viet": "Chính phủ mới huỷ bỏ thuế đánh vào rượu.", "eng": "The new government abolished the tax on wine."}, {"viet": "Tuần sau cô thư kí mới của chúng tôi mới đến, trong thời gian đó chúng tôi phải thu xếp một người thay tạm.", "eng": "The new secretary won't come until next week, in the meantime we've arranged for a temporary."}, {"viet": "Báo chí đưa ra lời tường thuật sai lệch điều đã xảy ra.", "eng": "The newspapers gave a distorted account of what had happened."}, {"viet": "Tiểu thuyết gia đó đã để cho nhân vật nữ chính của mình tự sát ở cuối truyện.", "eng": "The novelist makes his heroine commit suicide at the end of the book."}, {"viet": "Văn phòng đang làm việc hết năng suất để hoàn thành công việc.", "eng": "The office is working on all cylinders to get the job finished."}, {"viet": "Người vú già đã phục vụ trung thành gia đình đó trong ba mươi năm qua.", "eng": "The old nurse had served the family faithfully for thirty years."}, {"viet": "Tất cả ban nhạc đã vào vị trí chờ đợi nhạc trưởng.", "eng": "The orchestra were all in position, waiting for the conductor."}, {"viet": "Bức tranh đã được quyết định bán ( cho một thương gia người Mỹ ) với giá 5000 pao.", "eng": "The painting was knocked down ( to an American dealer ) for 5000 pounds."}, {"viet": "Xe cộ bị cấm đi ngang qua.", "eng": "The passage of motor vehicle is forbidden."}, {"viet": "Nhân dân bị một chế độ tàn bạo áp chế nhiều năm.", "eng": "The people have been kept down for years by a brutal regime."}, {"viet": "Nhà nhiếp ảnh đã chụp được anh ta trong tư thế cầu nguyện.", "eng": "The photographer has caught him in the attitude of prayer."}, {"viet": "Nơi này vốn là một cảng đánh cá được phát triển thành một trung tâm du lịch sầm uất.", "eng": "The place has developed from a fishing port into a thriving tourist centre."}, {"viet": "Cây cối khô héo trong thời tiết hanh khô.", "eng": "The plants withered in the dry weather."}, {"viet": "Số nhiều của child là children.", "eng": "The plural of child is children."}, {"viet": "Cảnh sát đã gài người do thám vào băng cướp.", "eng": "The police had planted a spy in the gang."}, {"viet": "Cảnh sát nhắc nhở dân chúng canh chừng bọn xâm nhập.", "eng": "The police warned people to be on the watch for intruders."}, {"viet": "Những người khuân vác được phát mỗi người một cái chăn.", "eng": "The porters were supplies with a blanket apiece."}, {"viet": "Sự đề xuất tăng thuế đang được xem xét.", "eng": "The present proposal for increasing taxation."}, {"viet": "Sức ép đòi chúng tôi phải hoàn thành nhiệm vụ này sẽ không giảm.", "eng": "The pressure on us to finish this task will not relent."}, {"viet": "Những thành viên đứng đầu trong chính phủ.", "eng": "The principal members of the government."}, {"viet": "Sản phẩm lại còn có nhiều khả năng phát triển hơn trên thị trường xuất khẩu.", "eng": "The product has even more potential in export markets."}, {"viet": "Cảnh tượng giàu có tức thì quá hấp dẫn khó làm ngơ.", "eng": "The prospect of instant riches was too beguiling to ignore."}, {"viet": "Cuộc cãi nhau dẫn tới một sự xa lánh hoàn toàn ( giữa cô ấy với gia đình ).", "eng": "The quarrel led to complete estrangement ( between her and her family )."}, {"viet": "Mưa đã thấm qua quần áo vào da thịt của anh ấy.", "eng": "The rain had penetrated through his clothes to his skin."}, {"viet": "Việc tìm lại được số kim cương thất lạc.", "eng": "The recovery of the missing diamonds."}, {"viet": "Bản tường trình nêu mối liên hệ các mức lương cao với những thiếu hụt lao động.", "eng": "The report relates high wages with labour shortages."}, {"viet": "Sự quay của quả đất trên trục của nó vòng quanh mặt trời.", "eng": "The revolution of the earth on its axis round the sun."}, {"viet": "Con đường rộng ra sau khúc quanh này.", "eng": "The road broadens out after this bend."}, {"viet": "Căn phòng quay cuồng trước mắt anh ta.", "eng": "The room swam before his eyes."}, {"viet": "Tin buồn làm cho anh ấy ứa nước mắt.", "eng": "The sad news brought tears to his eyes."}, {"viet": "Quyền trượng là một biểu tượng của vương quyền.", "eng": "The sceptre is an attribute of kingly power."}, {"viet": "Luỹ thừa hai/ba/bốn, v. v. của x ( = x2, x3, x4, v. v. ).", "eng": "The second, third, fourth, etc power of x ( = x2, x3, x4, etc )."}, {"viet": "Những vùng được tô bóng trên bản đồ.", "eng": "The shaded areas on the map."}, {"viet": "Con tàu phải giạt vào bờ vì thời tiết xấu.", "eng": "The ship was driven ashore by the bad weather."}, {"viet": "Những người dân làng bị ốm tới mụ phù thuỷ già, người ta cho rằng mụ có thể chữa mọi bệnh.", "eng": "The sick villagers went to the old witch who was supposed to be able to cure all diseases."}, {"viet": "Sau cơn bão trời quang đãng.", "eng": "The sky cleared after the storm."}, {"viet": "Hội có nhiều chi nhánh khắp nước.", "eng": "The society has many affiliations throughout the country."}, {"viet": "Các tiểu bang ở Miền Nam đã tách ra khỏi liên bang vào năm 1860-1861.", "eng": "The Southern states which seceded from the union in 1860-1861."}, {"viet": "Loài mực ống của biển sâu cũng là những sinh vật đẹp.", "eng": "The squids of the deep sea are beautiful creatures, too."}, {"viet": "Hòn đá theo đà khi nó lăn xuống đồi.", "eng": "The stone gathered momentum as it rolled downhill."}, {"viet": "Gió to làm cho nhiệt độ dường như thấp hơn thực tế.", "eng": "The strong wind makes the temperature seem lower than it really is."}, {"viet": "Hoa hướng dương đang nở rộ.", "eng": "The sunflowers are in full bloom."}, {"viet": "Lời khuyên của thầy giáo cho tôi nhiều suy nghĩ.", "eng": "The teacher's advice gave me plenty of food for thought."}, {"viet": "Đội bóng đã đến lúc sắp thở hắt ra thì tiếng còi nổi lên.", "eng": "The team were at their last gasp when the whistle went."}, {"viet": "Đêm qua, nhiệt biểu hạ xuống không độ.", "eng": "The thermometer fell to zero last night."}, {"viet": "Thời gian của chuyến đi phụ thuộc vào một số sự biến đổi chẳng hạn như khối lượng xe cộ trên đường.", "eng": "The time of the journey depends on a number of variable, such as the volume of traffic on the road."}, {"viet": "Xe cộ bị dừng lại vì có vụ va chạm nhau trên đường cao tốc.", "eng": "The traffic was help up because of a fender-bender on the express way."}, {"viet": "Các tàu chở quân được hộ tống qua Đại Tây Dương.", "eng": "The troop-ships were convoyed across the Atlantic."}, {"viet": "Hai người trong bọn họ đều bị kẹt trong cuộc vật lộn lớn giành quyền kiểm soát công ty.", "eng": "The two of them are locked in a titanic struggle for control of the company."}, {"viet": "Đóng góp độc đáo của nước Mỹ cho những ai yêu phong cảnh ngoài trời tuyệt vời là các Công viên Quốc gia và Công viên tiểu bang.", "eng": "The unique contribution of the United States to those who love the great outdoors are the National Parks and State Parks."}, {"viet": "Nạn nhân đã bị đâm ( vào ngực ).", "eng": "The victim had been knifed ( in the chest )."}, {"viet": "Kẻ bị truy nã đã trốn vào rừng.", "eng": "The wanted man hid in the forest."}, {"viet": "Miền Tây là vùng đất trung du và miền núi.", "eng": "The western is lands of plateaus and mountains."}, {"viet": "Gió đã quất tung một số viên ngói ( khỏi mái nhà ).", "eng": "The wind whipped several slates off ( the roof )."}, {"viet": "Công việc mệt nhọc nhưng anh ấy vẫn kiên trì đến khi xong.", "eng": "The work is tiring but he will keep at it until it's finished."}, {"viet": "Anh thanh niên khéo léo nhặt những giấy tờ lên.", "eng": "The young man picked the papers up adroitly."}, {"viet": "Những lời sui chỉ của họ về hạnh kiểm của nó thật như nước đổ đầu vịt.", "eng": "Their hints about his behaviour were water off a duck's back."}, {"viet": "Thái độ không giúp đỡ của họ đã làm cho những cố gắng của chúng tôi nhằm cải thiện tình hình mất hết tác dụng.", "eng": "Their unhelpfulness has stultified our efforts to improve things."}, {"viet": "Nếu bị bắt, chúng ta sẽ phải trả giá đắt đấy.", "eng": "There'll be hell to pay if we're caught."}, {"viet": "Có dư chỗ cho trẻ con trên ghế đằng sau.", "eng": "There's ample room for the children on the back seat."}, {"viet": "Hiện nay có một nhóm áp lực mạnh mẽ tán thành cải cách chữ viết trong tiếng Anh.", "eng": "There's now quite a strong pressure group advocating spelling reform in English."}, {"viet": "Có những cốc cà phê đá được châm thêm miễn phí.", "eng": "There are free refills on iced coffee."}, {"viet": "Có vài vết bùn bắn vào quần anh.", "eng": "There are some splashes of mud on your trousers."}, {"viet": "Mới đây đã có bốn vụ đuổi nhà khỏi phố này.", "eng": "There have been four evictions from this street recently."}, {"viet": "Trong giọng nói của anh ta có ý không hài lòng.", "eng": "There is a tang of displeasure in his voice."}, {"viet": "Có rất nhiều cái thừa trong báo cáo này, vì thế có thể dễ rút ngắn nó lại.", "eng": "There is quite a bit of dead wood in the report, so it is easy to shorten it."}, {"viet": "Ở cuối lớp có tiếng cười rúc rích.", "eng": "There was a giggle from the back of the class."}, {"viet": "Tôi chẳng thể làm được gì ngoài việc an ủi anh ta.", "eng": "There was nothing I could do, aside from comforting him."}, {"viet": "Khi khách ra về ai nấy đều thở phào nhẹ nhõm.", "eng": "There were undertones of relief as the visitors."}, {"viet": "Những sự việc này có thể có nhiều cách lý giải.", "eng": "These facts amay be given many possible interpretations."}, {"viet": "Những quả chuối thối này bốc mùi khó chịu.", "eng": "These rotting bananas are giving off a bad smell."}, {"viet": "Họ đang trình diễn bản Trout của Schubert dành cho bộ năm.", "eng": "They're playing Schubert Trout quintet."}, {"viet": "Họ đã chỉ định một người thận trọng làm giám đốc mới, thí dụ người không làm mất lòng mọi người.", "eng": "They appointed a safe person as the new manager."}, {"viet": "Họ đã đồng hoá phong tục của mình theo môi trường mới.", "eng": "They assimilated their customs to the new environment."}, {"viet": "Họ tập trung vào việc làm cho hình ảnh quang học rõ nét hơn.", "eng": "They concentrated on better definition of the optical image."}, {"viet": "Họ dìm cô ấy xuống bể bơi như một trò đùa.", "eng": "They dunked her in the swimming-pool as a joke."}, {"viet": "Họ được kính phục vì tính kỷ luật của họ.", "eng": "They had been admired for their discipline."}, {"viet": "Ông ấy kiểm tra doanh trại vào mỗi thứ sáu.", "eng": "They inspect the barracks every Friday."}, {"viet": "Chúng có thể có một lớp sáp bao phủ để giữ nước không cho nước bốc hơi.", "eng": "They may have a waxy covering that keeps the water in them from evaporating."}, {"viet": "Họ nài ép các ân nhân của họ nhận quà.", "eng": "They pressed gifts on their benefactors."}, {"viet": "Họ khám xét ngôi nhà nhưng không tìm thấy một dấu vết nào của tên tội phạm.", "eng": "They searched the building but dit not find any trace of the criminal."}, {"viet": "Họ nghĩ rằng đó là một điềm báo cho biết trước có một chuyện gì đó rất khủng khiếp sắp xảy ra.", "eng": "They thought it was a sign that something terrible was about to happen."}, {"viet": "Họ được người ta nói quả quyết rằng mọi biện pháp có thể có đều đang được thi hành.", "eng": "They were assured that everything possible was being done."}, {"viet": "Họ sẽ phải gặp nhau vào thời điểm và địa điểm nhất định.", "eng": "They were to meet at a given time and place."}, {"viet": "Chương trình nghị sự này sẽ là cơ sở của cuộc họp sau của chúng ta.", "eng": "This agenda will form the basis of our next meeting."}, {"viet": "Cà phê này mùi thơm quá Vâng, nó vừa chế biến xong.", "eng": "This coffee smells good Yes, it's freshly made."}, {"viet": "Bằng chứng này phù hợp với những gì chúng ta đã biết.", "eng": "This evidence ties in with what we already know."}, {"viet": "Đây là một cuộc tranh chấp nghiêm trọng và có thể dẫn đến xung đột vũ trang.", "eng": "This is a serious dispute, and could lead to armed conflict."}, {"viet": "Đó là kết quả của sự cả tin.", "eng": "This is what comes of being over-confident."}, {"viet": "Chiếc máy bay mới này rải hạt giống đều và nhanh ( trên khắp vùng ).", "eng": "This new machine distributes seed evenly and quickly ( over the whole area )."}, {"viet": "Chương trình này đưa đến cho các khán giả bình thường một dịp để cho tiếng nói của họ được chú ý lắng nghe.", "eng": "This programme gives, ordinary viewers a chance to make their voice heard."}, {"viet": "Nhà kho này nhỏ quá không thể chứa hết hàng hoá.", "eng": "This storeroom is too small to stock all goods."}, {"viet": "Người phụ nữ này là nguồn cảm hứng của tất cả chúng tôi.", "eng": "This woman's an inspiration to all of us."}, {"viet": "Thật ra mà nói thì chất lượng của nó tốt hơn mẫu cũ rất nhiều.", "eng": "To be frank, it is of much higher quality than the old one."}, {"viet": "Khách du lịch ngay khi bước chân đến thăm đất nước chúng tôi đã quên đi những định kiến của họ.", "eng": "Tourists forget their preconceived ideas as soon as they visit our country."}, {"viet": "Đi bằng xe buýt thì tiết kiệm nhưng lại nguy hiểm.", "eng": "Using the bus is economical but dangerous."}, {"viet": "Cẩn thận ô tô khi bạn qua đường.", "eng": "Watch out for the cars when you cross the road."}, {"viet": "Giờ thì chúng ta sẽ chẳng còn đón kịp xe lửa nữa rồi.", "eng": "We'll never be in time for the train now."}, {"viet": "Chúng tôi đang tìm mua một chiếc xe lớn vừa chở khách vừa chở hàng mà có thể chở được nhiều hành lý.", "eng": "We're looking for a spacious station wagon that can hold a lot of luggage."}, {"viet": "Chúng tôi đã tìm được một người Đức làm công cơm nuôi trong sáu tháng.", "eng": "We've got a German au pair for six months."}, {"viet": "Tất cả chúng ta đều tham gia vào cuộc đấu tranh chống tội phạm.", "eng": "We all have a part to play in the fight against crime."}, {"viet": "Chúng tôi bất lực trước những.", "eng": "We are powerless in the face of such forces."}, {"viet": "Chúng tôi sẽ gọi ông bà lúc 6 giờ.", "eng": "We call you at 6: 00."}, {"viet": "Chúng tôi không thể cung cấp nhu cầu thiết yếu cho làng vì có tuyết.", "eng": "We cannot get supplies to the village because of the snow."}, {"viet": "Quá nửa đêm chúng tôi mới về nhà.", "eng": "We didn't get home until gone midnight."}, {"viet": "Cuối cùng chúng tôi đã thuyết phục được họ sự vô tội của chúng tôi.", "eng": "We finally convinced them of our innocence."}, {"viet": "Chúng tôi cũng đã cắm trại ở đó.", "eng": "We had our picnic there, too."}, {"viet": "Chúng tôi đã tìm được một chỗ họp đáp ứng được yêu cầu của chúng ta.", "eng": "We have found a meeting-place that will serve our purpose."}, {"viet": "Chúng tôi nghe thấy mưa rơi lộp độp xuống mái túp lều.", "eng": "We heard the rain spattering down on the roof of the hut."}, {"viet": "Chúng tôi sẽ cần một chiếc xe hơi ở đó.", "eng": "We'll need a car there."}, {"viet": "Hỡi các đồng chí, chúng ta phải đấu tranh cho các quyền của chúng ta!", "eng": "We must fight for our rights, comrades!"}, {"viet": "Chúng tôi cần quy tụ thêm hai cầu thủ để thành lập một đội bóng.", "eng": "We need to rake up two more players to form a team."}, {"viet": "Chúng tôi nhận được nhiều bản đánh máy mới trong một ngày.", "eng": "We receive several new typescripts a day."}, {"viet": "Chúng ta nên xem lại tài liệu lại một lần nữa.", "eng": "We should go over the material once more."}, {"viet": "Chúng tôi tin rằng những thu xếp chúng tôi làm là phù hợp với ước vọng của anh.", "eng": "We trust that the arrangements we have made me conformable to your wishes."}, {"viet": "Chúng tôi suýt nữa bị sóng cuốn đi.", "eng": "We were almost swept off our feet by the waves."}, {"viet": "Chúng tôi không chuẩn bị đối với sự phản ứng như vậy.", "eng": "We weren't prepared for the backlash we got."}, {"viet": "À, hôm nay chúng ta sẽ đến đó nhé?", "eng": "Well, are we going there today?"}, {"viet": "Nào, bây giờ, thưa ông Wilson, tôi muốn thảo luận với ông về chương trình nghị sự phác thảo của ông trong 6 ngày ông ở đây.", "eng": "Well, now, Mr. Wilson, I'd like to discuss with you your rough agenda for your 6-day stay here."}, {"viet": "Thủ đô của Luxembourg là gì?''Tôi không biết, anh làm cho tôi bí rồi!'.", "eng": "What's the capital of Luxembourg?''I don't know, you've got me there!'."}, {"viet": "Hàng xuất khẩu chính của Botswana là gì?", "eng": "What are the chief exports of Botswana?"}, {"viet": "Bạn đã tặng gì cho mẹ bạn vào lễ Giáng Sinh vừa rồi?", "eng": "What did you give your mother last Christmas?"}, {"viet": "Cái gì đã dẫn đến tình trạng đáng tiếc này?", "eng": "What has led to this unhappy state of affairs?"}, {"viet": "Tạp chí thời trang nào đứng hàng đầu ở nước Anh?", "eng": "What is the number one fashion magazine in England?"}, {"viet": "Bạn muốn học ngoại ngữ gì?", "eng": "What languages would you like to study?"}, {"viet": "Điều gì làm bạn ngạc nhiên nhất khi bạn ra nước ngoài lần đầu tiên?", "eng": "What surprised you most when you visited a foreign country for the first time?"}, {"viet": "Khi nào hoa cúc vạn thọ tây nở?", "eng": "When are cosmos flowers in bloom?"}, {"viet": "Khi phổi của anh ta được chụp X quang, căn bệnh có thể nhìn thấy rõ ràng.", "eng": "When his lungs were X-rayed the disease could be clearly seen."}, {"viet": "Cuối cùng khi cô ấy đến thì đã quá muộn.", "eng": "When she finally arrived it was too late."}, {"viet": "Khi hai công ty công nghiệp khổng lồ xung đột nhau, các công ty nhỏ có thể bị dính vào cuộc chiến.", "eng": "When two industrial giants clash, small companies can get caught in the cross-fire."}, {"viet": "Tôi có thể đón Taxi ở đâu?", "eng": "Where can I get a taxi?"}, {"viet": "Nước nào sẽ đăng cai tổ chức cuộc thi thể thao năm nay?", "eng": "Which country is hosting the Games this year?"}, {"viet": "Bất cứ cái nào anh mua cũng được bảo hành sáu tháng.", "eng": "Whichever you buy, there is a six-month guarantee."}, {"viet": "Cầu thủ bóng chày nổi tiếng nhất ở Nhật Bản là ai?", "eng": "Who is the most famous baseball player in Japan?"}, {"viet": "Tại sao anh lại muốn ở đây-thật là một cái ổ chuột khủng khiếp!", "eng": "Why do you want to live here-it's a dreadful hole!"}, {"viet": "Ước tính giá thấp nhất cũng phải 5.000 pao.", "eng": "Will cost 5000 pounds at the lowest computation."}, {"viet": "Anh sẽ nhắc vở cho chúng tôi ở buổi biểu diễn tới được không?", "eng": "Will you prompt for us at the next performance?"}, {"viet": "Bằng chiếc rìu đá, ông chặt gốc cây đến khi nó đổ bắt ngang qua dòng suối.", "eng": "With his stone ax the man chopped at its base until it topped across the stream."}, {"viet": "Làm việc ngoài nắng chẳng bao lâu khiến chúng tôi khát ( ghê gớm ).", "eng": "Working in the sun soon gave us a ( powerful ) thirst."}, {"viet": "Bạn có thích đi cùng không?", "eng": "Would you like to come along?"}, {"viet": "Xin bạn vui lòng nói lớn hơn một chút?", "eng": "Would you please speak a little louder?"}, {"viet": "Đúng vậy, nhưng phụ nữ không làm việc ca đêm.", "eng": "Yes, but women do not work the night shift."}, {"viet": "Dạ phải, tôi có thể giúp gì cho ông ạ?", "eng": "Yes, what can I do for you?"}, {"viet": "Nếu anh muốn đi cùng thì anh phải nhanh nhanh lên.", "eng": "You'll have to make it snappy if you want to come too."}, {"viet": "Không kiêng ăn cũng đủ gầy nhom rồi!", "eng": "You're skinny enough without going on a diet!"}, {"viet": "Bạn sẽ không lập gia đình, đúng không?", "eng": "You are not going to get married, right?"}, {"viet": "Anh không thể xem trọng lời hứa của cô ta được vì cô ấy chưa bao giờ giữ lời.", "eng": "You can't take her promises seriously, she never keeps her words."}, {"viet": "Ông hãy tin chắc là con trai ông không chết một cách vô ích.", "eng": "You can rest assured your son didn't die in vain."}, {"viet": "Anh ít khi làm việc đó ở Nhật phải không nào?", "eng": "You don't do that very much in Japan, do you?"}, {"viet": "Anh phải nín thở khi ở dưới nước.", "eng": "You have to hold your breath under water."}, {"viet": "Ông có thể chọn giữa tài khoản tiết kiệm và tài khoản vãng lai.", "eng": "You may choose between fixed and current account."}, {"viet": "Bạn không nên chỉ quan sát bề ngoài của sự vật.", "eng": "You must not look only at the surface of things."}, {"viet": "Ông đang chận đường hành khách.", "eng": "You're holding up the passengers."}, {"viet": "Anh cần phải cẩn thận nhiều hơn nữa trong công việc.", "eng": "You should take more care over your work."}, {"viet": "Anh lấy xe mà không được phép là sai.", "eng": "You were wrong to take the car without permission."}, {"viet": "Bài báo của anh dài quá, xin hãy cắt bớt còn 1000 từ.", "eng": "Your article's too long-please cut it down to 1000 words."}, {"viet": "Một ngày nào đó những lối đùa ác ý của cậu sẽ giáng trả lại vào đầu cậu.", "eng": "Your practical jokes will redound on your own head one day."}]