[{"viet": "30 bảng Anh một tháng đóng góp vào tiền hưu trí.", "eng": "30 a month goes towards a pension fund."}, {"viet": "Một sự nghiệp bị tiêu tan vì trò ma mãnh chính trị.", "eng": "A career ruined by political skullduggery."}, {"viet": "Một cái đồng hồ và hai cái bình nằm trên mặt lò sưởi.", "eng": "A clock and two vases stood on the mantelpiece."}, {"viet": "Một khóa học kéo dài ba năm.", "eng": "A course of studies spread over three years."}, {"viet": "Một kẻ độc tài hùng hổ tuôn ra những lời sỉ nhục của hắn ta trên đầu cổ đám người chịu trận ngồi nghe.", "eng": "A dictator who ranted his vitriol onto a captive audience."}, {"viet": "Một bữa tiệc gia đình với sự có mặt của cả ba đời.", "eng": "A family party at which all three generations were present."}, {"viet": "Cái lốp xe nhè cái ngày này mà xẹp-Đen đủi thật!", "eng": "A flat tyre today of all days-what bad luck!"}, {"viet": "Một người đi xe đạp cừ khôi có thể vượt qua một quãng đường hơn trăm dặm một ngày.", "eng": "A good cyclist can cover distances of over a hundred miles a day."}, {"viet": "Khẩu súng có tầm bắn hiệu quả.", "eng": "A gun with a good field for fire."}, {"viet": "Một căn nhà nhìn về hướng công viên sẽ đắt hơn.", "eng": "A house which overlooks the park will cost more."}, {"viet": "Phần lớn Vùng trung phi là rừng rậm.", "eng": "A large part of Central Africa is made up of thick forest."}, {"viet": "Số tiền vay sẽ giúp tôi thoát khỏi tình trạng khó khăn.", "eng": "A loan of money would help me out of my predicament."}, {"viet": "Một người có khả năng thích hợp với việc giảng dạy.", "eng": "A man with his ability belongs in teaching."}, {"viet": "Một buổi hoàng hôn quá lạnh lùng.", "eng": "A most remarkable sunset."}, {"viet": "Một tờ báo chỉ là cái loa của đảng Bảo thủ Anh.", "eng": "A newspaper which is merely the mouthpiece of the Tony party."}, {"viet": "Một cuộc chuyển giao êm đẹp sang chính quyền dân sự.", "eng": "A peaceful change-over to civilian rule."}, {"viet": "Một cái bao nhựa để phủ máy chữ.", "eng": "A plastic cover for a typewriter."}, {"viet": "Một bản nguyên vẹn của quyển sách thuộc ấn bản đầu tiên.", "eng": "A pristine copy of the book's first edition."}, {"viet": "Một giải pháp tức khắc cho vấn đề đó.", "eng": "A ready solution to the problem."}, {"viet": "Một chuyến kinh lý của nhà vua khắp cả nước.", "eng": "A royal progress around the country."}, {"viet": "Một tai nạn nghiêm trọng đã xảy ra ngày hôm qua.", "eng": "A serious accident occurred yesterday."}, {"viet": "Một nhóm nhỏ đã bắt đầu có ảnh hưởng trong việc đưa ra chính sách.", "eng": "A small group has begun to predominate in policy-making."}, {"viet": "Một nhánh tầm gửi cho lễ Giáng Sinh.", "eng": "A sprig of mistletoe for Christmas."}, {"viet": "Một mùi lưu huỳnh bay ra từ phòng thí nghiệm.", "eng": "A sulphurous smell coming from the laboratory."}, {"viet": "Một chuyến tàu ba ngày để đến Brest.", "eng": "A three-day sail to get to Brest."}, {"viet": "Một nạn nhân trôi sấp trên mặt nước.", "eng": "A victim floating facedown in the water."}, {"viet": "Một cơ hội tuyệt diệu tự nó đã chợt đến.", "eng": "A wonderful opportunity suddenly presented itself."}, {"viet": "Tố cáo chế độ đó tra tấn những đối thủ chính trị của nó.", "eng": "Accused the regime of torturing its political opponents."}, {"viet": "Sau 40 phút thì đội Spurs đã ghi điểm trái ngược với chiều hướng của trận đấu.", "eng": "After 40 minutes Spurs scored, against the run of play."}, {"viet": "Sau việc thanh tra để tìm ra các dấu hiệu về cách làm ăn vô hiệu quả.", "eng": "After inspection for signs of inefficiency."}, {"viet": "Sau trận sương giá dày đặc, con đường như một thảm băng.", "eng": "After the heavy frost the road was a sheet of ice."}, {"viet": "Alice lau sạch lệ ở đôi mắt nàng.", "eng": "Alice wipe away the tears from her eyes."}, {"viet": "Tất cả những điều mà bà ấy quan tâm là cuộc sống ngoài xã hội.", "eng": "All she cares about is her social life."}, {"viet": "Tất cả mọi sự thay đổi kế hoạch của ông làm cho tôi hoàn toàn rối trí.", "eng": "All your changes of plan have made me totally confused."}, {"viet": "Một số viên kim cương nổi tiếng khác là Koh-i-noor, Great Mogul, Oriloff và Ngôi sao miền Nam.", "eng": "Among the other famous diamonds are the Koh-i-noor, the Great Mogul, The Oriloff, and the Star of the South."}, {"viet": "Một người đàn bà ngạo mạn, thiếu kiên nhẫn không chịu được những người ngu ngốc.", "eng": "An arrogant, impatient woman who doesn't suffer fools gladly."}, {"viet": "Một thí nghiệm để đo tốc độ âm thanh di chuyển.", "eng": "An experiment to measure the speed at which sound travels."}, {"viet": "Một quan sát viên tại hội nghị thượng đỉnh.", "eng": "An observer at a summit conference."}, {"viet": "Một sự đề cập không cần thiết tới quá khứ phạm tội của hắn.", "eng": "An unnecessary reference to his criminal past."}, {"viet": "Da thú, lá cây và cọng cỏ là những thứ họ có thể dùng.", "eng": "Animal skins, leaves, and grasses were about the only ones they could use."}, {"viet": "Kinh hoàng về sự hủy diệt hoàn toàn.", "eng": "Appalled by the totality of the destruction."}, {"viet": "Có giờ làm việc cố định ở công ty anh không?", "eng": "Are there set hours of work in your company?"}, {"viet": "Chính xác là ông đang tìm thứ gì ạ?", "eng": "Are you looking for something in particular?"}, {"viet": "Nghệ thuật có thể được sử dụng như một phương tiện tuyên truyền.", "eng": "Art may be used as a vehicle for propaganda."}, {"viet": "Bởi vì cô ta bệnh có lẽ cô ta cần giúp đỡ.", "eng": "As she's been ill perhaps she'll need some help."}, {"viet": "Quả quyết rằng ai vô tội.", "eng": "Asseverate one's that one is innocent."}, {"viet": "Hồi mới vào nghề cô ấy đầy lạc quan nhưng bây giờ thì không.", "eng": "At the outset of her career she was full of optimism but not now."}, {"viet": "Khu ban công đủ tốt cho tôi rồi.", "eng": "Balcony is good enough for me."}, {"viet": "Được trao quyền hành chiếu theo Mục 95 của Luật Công Ty 1985.", "eng": "Be given power pursuant to Section 95 of the Companies Act 1985."}, {"viet": "Vì những khó khăn về pháp lý, dự án xây dựng đó không bao giờ khởi công được.", "eng": "Because of legal difficulties, the construction project never got off the ground."}, {"viet": "Ngoài Cố Cung ra, Thiên Đàng cũng rất đáng tham quan.", "eng": "Besides the Imperial Palace, the Temple of Heaven is worth seeing, too."}, {"viet": "Mượn băng từ của thư viện sẽ là điều tốt thứ nhì.", "eng": "Borrowing tapes from the library would be the next-best thing."}, {"viet": "Cần phải cẩn thận khi đem đổ các chai vỡ.", "eng": "Broken bottles should be safely disposed of."}, {"viet": "Nhưng tôi rất thích thịt gà.", "eng": "But I like chicken very much."}, {"viet": "Nhưng chúng tôi phải có thẻ và chữ ký cho tất cả những người dử dụng hộp được ủy quyền.", "eng": "But we must have signature cards for all authorized box users."}, {"viet": "Á này, có rượu vang Trung Quốc khác không?", "eng": "By the way, are there other Chinese wines?"}, {"viet": "Tôi có thể lấy cho bạn cái gì khác trước khi chúng ta bắt đầu không?", "eng": "Can I get you anything else before we start?"}, {"viet": "Chúng ta có thể đi thăm một số thác nước được không?", "eng": "Can we see some of the falls?"}, {"viet": "Bạn có thể sử dụng máy vi tính thành thạo không?", "eng": "Can you operate a PC well?"}, {"viet": "Lấy phụ tùng một cái radio cũ để sửa máy hát của mình.", "eng": "Cannibalize an old radio to repair one's record player."}, {"viet": "Đấu tranh cho quyền của giới đồng tính luyến ái.", "eng": "Champion the cause of gay rights."}, {"viet": "Nghẹt thở vì chính thức ăn của mình nôn ra.", "eng": "Choke to death on one's own vomit."}, {"viet": "Thức ăn lạnh được ưa chuộng hơn trong lúc nóng bức này.", "eng": "Cold food would be preferable in this heat."}, {"viet": "Việc hoàn tất công trình xây dựng mất thời gian lâu hơn dự tính.", "eng": "Completion of the building work is taking longer than expected."}, {"viet": "Đóng góp 10 bảng Anh cho việc quyên góp từ thiện.", "eng": "Contribute ten pounds to a charity collection."}, {"viet": "Ông có thể đến miền Tây hoặc Tây Nam không?", "eng": "Could you go to the West or Southwest?"}, {"viet": "Về mặt hào hứng thì môn crikê không thể so được với môn bóng đá.", "eng": "Cricket cannot rival football in excitement."}, {"viet": "Mẹ kiếp, tao làm gãy cây viết rồi.", "eng": "Dash it, I've broken my pen."}, {"viet": "Bị tước quyền công dân của mình.", "eng": "Deprived of one's civil rights."}, {"viet": "Bạn đã học trường tư thục hay trường công lập?", "eng": "Did you attend a private school or a public school?"}, {"viet": "Moi đất lên từ dưới chân tường.", "eng": "Dig the soil away from the bottom of the wall."}, {"viet": "Gây tổn hại khôn xiết đến danh tiếng của ai.", "eng": "Do incalculable harm to somebody's reputation."}, {"viet": "Bạn có tin rằng suối nước nóng tốt cho sức khỏe không?", "eng": "Do you believe that hot springs are good for your health?"}, {"viet": "Các anh có thang máy rồi à?", "eng": "Do you have an elevator already?"}, {"viet": "Bạn có biết tên Thủ tướng đương nhiệm của Nhật không?", "eng": "Do you know the name of the current Prime Minister of Japan?"}, {"viet": "Chú có thành khẩn hứa sẽ trả lại tôi không?", "eng": "Do you promise faithfully to pay me back?"}, {"viet": "Bạn nghĩ bạn đáng tăng lương à?", "eng": "Do you think you deserve one?"}, {"viet": "Khách sạn có chấp nhận séc du lịch không?", "eng": "Does the hotel take traveler's cheques?"}, {"viet": "Đừng tin vào tường thuật của báo về những gì đã xảy ra.", "eng": "Don't believe the newspaper account of what happened."}, {"viet": "Đừng chạm đến lòng tự ái của cô ấy-cô ấy rất dễ giận đấy.", "eng": "Don't hurt her feelings-she bruises very easily."}, {"viet": "Đừng bỏ đi-Tôi đang cần lời khuyên của bạn.", "eng": "Don't run away-I want your advice."}, {"viet": "Đừng lo-ta có khối thì giờ.", "eng": "Don't worry-we've got oceans of time."}, {"viet": "Lúc đầu lái xe bên trái thấy lạ nhưng rồi người ta sẽ quen với chuyện đó.", "eng": "Driving on the left is strange at first but you get used to it."}, {"viet": "Ăn nhiều ngũ cốc và trái cây sẽ có nhiều chất xơ trong bữa ăn của bạn.", "eng": "Eating cereals and fruit gives you plenty of fibre in your diet."}, {"viet": "Đủ vải may hai cái áo đầm.", "eng": "Enough material to make two dresses."}, {"viet": "Mỗi người đều phải làm phần việc hàng ngày trong nhà bếp.", "eng": "Everybody must do a daily stint in the kitchen."}, {"viet": "Xin lỗi, trong khách sạn có hiệu cắt tóc nào không?", "eng": "Excuse me, is there a barber-shop in the hotel?"}, {"viet": "Không đạt được một ý nghĩa cao siêu trong sự đau đớn và nghèo khổ.", "eng": "Fails to achieve a transcendent significance in suffering and squalor."}, {"viet": "Cảm thấy buồn ngủ sau một bữa ăn no.", "eng": "Feeling comatose after a large meal."}, {"viet": "Trước tiên, anh phải mua một loại bột giặt đặc biệt dùng để rửa xe.", "eng": "First, I have to buy a special car detergent."}, {"viet": "Lấy báo gói cái bát thủy tinh này lại.", "eng": "Fold this glass bowl in newspaper."}, {"viet": "Buộc phải chuồn đi một cách vội vã và khiếm nhã đến mức không kịp mặc quần dài.", "eng": "Forced to make a hasty and indecorous departure without his trousers."}, {"viet": "Từ lúc đó trở đi hắn từ chối nói về chuyện đó.", "eng": "From then on he refused to talk about it."}, {"viet": "Có một văn bằng kinh tế hạng nhì bậc thấp.", "eng": "Get a lower second in economics."}, {"viet": "Nộp phạt cho tôi cái đồng hồ của anh.", "eng": "Give me your watch as a forfeit."}, {"viet": "Đi vòng quảng trường rồi đi ra lối thứ ba.", "eng": "Go round the roundabout and take the third exit."}, {"viet": "Phát triển từ một cơ sở kinh doanh nhỏ ban đầu thành một tổng công ty nhiều triệu đô la.", "eng": "Grew from a tiny start-up to a multimillion-dollar corporation."}, {"viet": "Những hạn chế mới hà khắc do lệnh phi lý của chính phủ áp đặt.", "eng": "Harsh new restrictions imposed by government diktat."}, {"viet": "Trước đây ông có tới Paris chưa?", "eng": "Have you been to Paris before?"}, {"viet": "Em nhận được thư hồi âm cho lá thư của em chưa?", "eng": "Have you had an answer to your letter?"}, {"viet": "Anh ta nên đến báo cảnh sát về chuyện đó thì hơn.", "eng": "He'd be better off going to the police about it."}, {"viet": "Anh ta luôn coi trọng bản thân mình.", "eng": "He's always looking out for number one."}, {"viet": "Anh ta có kinh nghiệm về việc trông trẻ.", "eng": "He's experienced in looking after children."}, {"viet": "Anh ta không chỉ là một đấu thủ quyền Anh, anh ta còn là vô địch thế giới nữa đấy.", "eng": "He's not a mere boxer, he's world champion."}, {"viet": "Người ta cho ông ta là một trong những người giàu nhất châu Âu.", "eng": "He's thought to be one of the richest men in Europe."}, {"viet": "Khi nó lúng túng nó cứ lí nhí trong miệng.", "eng": "He always mumbles when he's embarrassed."}, {"viet": "Ông ta tin rằng sắc đẹp không phải là một cái gì áp đặt, mà là một cái gì cố hữu.", "eng": "He believed that beauty was not something imposed, but something immanent."}, {"viet": "Anh ấy có thể chấp điểm mà vẫn thắng tôi về môn gôn.", "eng": "He can give me points at golf."}, {"viet": "Anh ta đã xưng tội với linh mục là mình đã phạm tội.", "eng": "He confessed to the priest that he had sinned."}, {"viet": "Ông ấy đã tố cáo tất cả các địa chủ và kẻ cho vay tiền là những tên bóc lột ác độc.", "eng": "He denounced all landlords and money-lenders as evil predators."}, {"viet": "Anh ta không hiểu vấn đề lắm đâu nhưng anh rất nhiệt tình.", "eng": "He doesn't know much about the subject, but he's very enthusiastic."}, {"viet": "Anh ta phải ra tòa án quân sự vì bất tuân lệnh.", "eng": "He faced a court martial for disobeying orders."}, {"viet": "Anh ta thấy trước rằng công việc sẽ mất nhiều thời gian.", "eng": "He foresaw that the job would take a long time."}, {"viet": "Ông ấy cho người ta cái cảm tưởng là ông ấy bất cần.", "eng": "He gives the impression of not caring a damn."}, {"viet": "Anh ấy hạ mình đi ăn xin.", "eng": "He had come down to begging."}, {"viet": "Nó ngỡ là tôi đang bịp nó.", "eng": "He has a notion that I'm cheating him."}, {"viet": "Ông ta có kinh nghiệm nhiều năm về tâm lý tội phạm.", "eng": "He has many years'experience of the criminal mentality."}, {"viet": "Nó kiên quyết đưa tay ra chịu đòn.", "eng": "He held out his hand unflinchingly for the cane."}, {"viet": "Ông ấy chịu ở lại nơi hiện tại ông ta đang sống.", "eng": "He is content to remain where he is now."}, {"viet": "Ông ấy cùng tuổi với bà vợ của mình.", "eng": "He is the same age as his wife."}, {"viet": "Ông ấy biết rõ từng ngôi nhà trong khu vực ông chịu trách nhiệm.", "eng": "He knows every house in his patch."}, {"viet": "Anh ta sẽ đi lại được ngay đấy mà.", "eng": "He'll soon be about again."}, {"viet": "Hắn coi trọng chiếc xe hơi mới mua quá thể.", "eng": "He makes a fetish of his new car."}, {"viet": "Ông ấy không bao giờ mở cửa hàng vào ngày Chủ Nhật.", "eng": "He never opens up shop on a Sunday."}, {"viet": "Hắn tình cờ làm quen với cô gái đó ở một buổi khiêu vũ ở trường Cao đẳng.", "eng": "He picked up the girl at the college disco."}, {"viet": "Ông ta cho đăng nhiều bài trong các tờ báo khác nhau.", "eng": "He published articles in various newspapers."}, {"viet": "Anh ta thực sự thành công khi sách của anh ta được dựng thành phim Hollywood.", "eng": "He really made it to the big time when his book was turned into a Hollywood movie."}, {"viet": "Anh ta đã tìm lại được những chiếc chìa khoá mà anh đã để trên ô tô.", "eng": "He retrieves the keys he left on the bus."}, {"viet": "Hắn đã cao hơn người anh trai.", "eng": "He's already outgrown his older brother."}, {"viet": "Anh ta có nhiều tiền hơn tất cả chúng ta gộp chung lại.", "eng": "He's got more money than the rest of us put together."}, {"viet": "Anh ta cho một người đi nhờ xe.", "eng": "He's picked up a hitch-hiker."}, {"viet": "Anh ta nói cảnh sát lấy được thông tin đó bằng cách phi pháp.", "eng": "He said the police had obtained this information by illegal means."}, {"viet": "Nó dường như không thích công việc nặng nhọc.", "eng": "He seems to be averse to hard work."}, {"viet": "Anh ấy tỏ ra có ít tình yêu đối với nàng.", "eng": "He shows little love towards her."}, {"viet": "Ông ta nói về người vợ quá cố của mình với sự xúc động sâu sắc.", "eng": "He spoke of his dead wife with deep emotion."}, {"viet": "Ông ta thong thả đi dạo, trông rất yêu đời trong bộ quần áo mới lịch sự.", "eng": "He strolled about, looking very debonair in his elegant new suit."}, {"viet": "Ông ta đã dạy môn toán nhiều năm.", "eng": "He taught mathematics for many years."}, {"viet": "Anh ấy đưa cô dâu mới của mình về thẳng ngôi nhà mới của họ.", "eng": "He took his new bride directly to their new abode."}, {"viet": "Anh đã cố gắng cười để xua đi những nỗi lo sợ của cô ta nhưng không thành công.", "eng": "He tried without success to laugh her fears away."}, {"viet": "Nó đi qua mặt tôi mà không thèm hạ cố nhìn tôi.", "eng": "He walked past me without even deigning to look at me."}, {"viet": "Ông ta bao giờ cũng lương thiện cho dù ông ta nghèo.", "eng": "He was always honest although he was poor."}, {"viet": "Anh ta bị buộc tội vào trái phép toà nhà đó.", "eng": "He was charged with trying to gain illegal entry into the building."}, {"viet": "Anh ấy bị phạt số tiền 200 bảng Anh.", "eng": "He was fined the sum of £ 200."}, {"viet": "Là một người làm thuê lặt vặt lưu động, ông ta làm đủ mọi việc.", "eng": "He was leading a catch-as-catch-can life, working as itinerant handyman."}, {"viet": "Ông ấy được ca ngợi vì công việc ông ấy làm cho người mù.", "eng": "He was praised for his service for the blind."}, {"viet": "Hắn ta vẫn còn nhức nhối, đau đớn sau cuộc ẩu đả vì uống rượu.", "eng": "He was still smarting from the tussle over the bottle."}, {"viet": "Ông ấy đi thăm trường học và các cơ sở giáo dục khác trong vùng.", "eng": "He was visiting and other educational establishments in the area."}, {"viet": "Ông ta sẽ được tấn phong làm Tổng thống vào tháng Giêng.", "eng": "He will be inaugurated as president in January."}, {"viet": "Ông ta thường hay bắt chuyện với những người xa lạ hoàn toàn.", "eng": "He would often strike up conversations with complete strangers."}, {"viet": "Chào bồ, gặp bồ mừng quá!", "eng": "Hello, sugar, nice to see you!"}, {"viet": "Áo của cô ấy tuột ra khỏi váy của cô ấy.", "eng": "Her blouse has parted company with her skirt."}, {"viet": "Việc bà ta ra đi là một tổn thất lớn cho dàn nhạc.", "eng": "Her departure is a great loss to the orchestra."}, {"viet": "Những lời tố cáo hung hăng của cô ta về các kẻ thù của mình.", "eng": "Her fierce denunciations of her enemies."}, {"viet": "Chồng thì bỏ và con cái lại đi lêu lổng, do đó chẳng có gì là ngạc nhiên khi bà ta không thể đương đầu được.", "eng": "Her husband left her and the kids are running wild, so it's not surprising that she can't cope."}, {"viet": "Người tớ gái giúp nàng mặc quần áo dự dạ hội.", "eng": "Her maid helped her to dress for the ball."}, {"viet": "Cha mẹ cô ấy đã phải hy sinh nhiều thứ để cô ấy có thể học đại học.", "eng": "Her parents made many sacrifices so that she could go to university."}, {"viet": "Thái độ khiếm nhã của cô ta chỉ là cái vẻ bề ngoài che đậy sự nhút nhát của cô ấy.", "eng": "Her rudeness is just a front for her shyness."}, {"viet": "Khuynh hướng của cô ấy phát hiện một thoáng buồn lúc này đã tan biến.", "eng": "Her tendency to discover a touch of sadness had for the nonce disappeared."}, {"viet": "Đây là nhân dân tệ Trung Quốc cho một ngàn năm trăm đô la Mỹ.", "eng": "Here are your Chinese yuan for one thousand five hundred US dollars."}, {"viet": "Những hành động của chàng biểu lộ tình yêu của chàng rõ hơn bất cứ lời nói nào.", "eng": "His actions express his love more than any words could do."}, {"viet": "Việc anh ta huênh hoang rằng anh ta có thể uống mười panh bia chẳng gây được ấn tượng đối với ai cả.", "eng": "His boast that he could drink ten pints of beer impressed nobody."}, {"viet": "Lương tâm của anh ta giày vò anh ta sau khi anh ta lấy tiền.", "eng": "His conscience troubled him after he took the money."}, {"viet": "Kinh nghiệm của anh ấy giúp anh ấy phù hợp với công việc đó.", "eng": "His experience fitted him to do the job."}, {"viet": "Nghề viết báo tự do mang lại cho anh ta khoản thu nhập 5.000 bảng Anh mỗi năm.", "eng": "His freelance work brings him in £ 5,000 a year."}, {"viet": "Sự thiếu khả năng hiểu toán học của anh ta.", "eng": "His inability to understand mathematics."}, {"viet": "Phong cách của ông ta vừa duyên dáng lại vừa lịch thiệp.", "eng": "His manner is a blend of charm and politeness."}, {"viet": "Sự nhiệt tình ban đầu của nó đã trở nên kém đi.", "eng": "His original enthusiasm has turned sour."}, {"viet": "Sự trừng phạt anh ta sẽ là một sự răn đe đối với những kẻ khác.", "eng": "His punishment will be a deterrent to others."}, {"viet": "Bài diễn văn của ông ta gây ra một phản ứng giận dữ.", "eng": "His speech called forth an angry response."}, {"viet": "Quần của nó tụt xuống nhưng nó không hề tỏ ra bối rối.", "eng": "His trousers felt down but he appeared quite unabashed."}, {"viet": "Bài viết của anh ta tốt nhưng đọc chỉ tạm được.", "eng": "His writing is good, but his reading is only fair."}, {"viet": "Những nam nữ diễn viên trẻ tuổi lòng đầy hy vọng bị loá mắt bởi sức mê hoặc của Hollywood.", "eng": "Hopeful young actors and actresses dazzled by the glamour of Hollywood."}, {"viet": "Làm cách nào tôi có thể nhét vào cái đầu bò của anh là chúng tôi không đủ tiền mua cái xe đó.", "eng": "How can I get into your thick skull that we can't afford a car."}, {"viet": "Anh đã xoay sở thế nào trong kỳ thi lấy bằng lái xe?", "eng": "How did you get along in your driving test?"}, {"viet": "Ở nước bạn, bảo hiểm y tế đắt như thế nào?", "eng": "How expensive is medical insurance in your country?"}, {"viet": "Bộ phim này sẽ chiếu bao lâu?", "eng": "How long will this movie be showing?"}, {"viet": "Có bao nhiêu con tàu vũ trụ đã di chuyển theo quỹ đạo quanh mặt trăng?", "eng": "How many spacecrafts have orbited the moon?"}, {"viet": "Tôi cần bao nhiêu cước phí cho cái này?", "eng": "How much postage do I need for this?"}, {"viet": "Dù chuyến đi ngắn đến đâu, anh vẫn được ăn cái gì đó trên tuyến bay này.", "eng": "However short the journey is, you always get something to eat on this airline."}, {"viet": "Tôi muốn cái màu đen, hoặc màu trắng hay màu xám cũng được.", "eng": "I'd like it to be black, or white or grey."}, {"viet": "Thật ra, tôi cho rằng ông ta cũng như là bố của anh ta.", "eng": "I'd say he was more like his father, if anything."}, {"viet": "Trước tiên tôi sẽ dùng món xúp và kế tiếp là món gà.", "eng": "I'll have soup first and then the chicken."}, {"viet": "Tôi sẽ nhận cú điện thoại đó tại văn phòng tôi.", "eng": "I'll take the telephone call in my office."}, {"viet": "Tớ đang hoang mang chưa biết cách chữa chiếc xe hơi như thế nào đây.", "eng": "I'm all at sea, I've no idea how to repair cars."}, {"viet": "Tôi sẽ đun sôi một ít nước để pha trà.", "eng": "I'm going to boil some water for our tea."}, {"viet": "Tôi không hơn gì con đầy tớ trong nhà này.", "eng": "I'm no better than a skivvy in this house."}, {"viet": "Tôi còn không rõ tôi sẽ phải làm gì đây.", "eng": "I'm rather unclear about what i'm doing here."}, {"viet": "Tôi chắc rằng ở chỗ nào nó cũng sẽ giở trò ma mãnh ra cả.", "eng": "I'm sure he'll be up to no good wherever he is."}, {"viet": "Tôi rất thích công việc đó, và tôi muốn biết công việc đó có còn trống hay không?", "eng": "I'm very much interested in that position, and would like to know if it's still available?"}, {"viet": "Tôi đã nghĩ đến việc gọi điện thoại cho bạn.", "eng": "I've been thinking of giving you a call."}, {"viet": "Tôi đã có nhiều tình bạn, nhưng chưa bao giờ có một tình bạn thân thiết như thế.", "eng": "I've had many friendships, but never such an intimate one."}, {"viet": "Tôi đã ghi tạm tên anh vào danh sách trận đấu vào thứ bảy, chừng nào anh biết chắc là anh có thể chơi được hãy cho tôi biết ngay.", "eng": "I've pencilled you in for the match on Saturday, tell me as soon as you know for certain if you can play."}, {"viet": "Tôi đồng ý với anh, ngoại trừ anh có một hai điểm lầm.", "eng": "I agree with you, save that you have got one or two facts wrong."}, {"viet": "Tôi đến đây để xem liệu chúng ta có thể thiết lập quan hệ kinh doanh hay không.", "eng": "I am here to see whether we can build up our business."}, {"viet": "Tôi đã tới đây được đúng một năm tính đến hôm nay.", "eng": "I arrived a year ago today."}, {"viet": "Tôi đã mua một vài món đồ lặt vặt lưu niệm.", "eng": "I bought a few trifles as souvenirs."}, {"viet": "Tôi không thể chịu nổi khi nhìn thấy trẻ em phải chịu đau khổ.", "eng": "I can't endure seeing children suffer."}, {"viet": "Tao không thể chịu đựng nổi ổ chuột này nữa, dọn dẹp cho sạch đi!", "eng": "I can't stand this slum any longer, tidy it up!"}, {"viet": "Tôi có thể dễ dàng tin là ở nhà cô ấy rất lười biếng vì ở trường cô ta rất lười.", "eng": "I can readily believe that she's lazy at home, she's very lazy at school."}, {"viet": "Tôi không thể hát thấp như vậy.", "eng": "I can't sing as low as that."}, {"viet": "Tôi có thể thấy là bà ta đang chăm chú nhìn tôi như một khách hàng tương lai.", "eng": "I could see that she was eying me up as a potential customer."}, {"viet": "Tôi muốn biết về thức ăn.", "eng": "I'd like to know about food."}, {"viet": "Tôi không phải trả tiền tàu-nó được thanh toán.", "eng": "I didn't pay for the train fare-it was on expenses."}, {"viet": "Tôi không để ý tí gì đến điều họ nghĩ.", "eng": "I don't give twopence care twopence what they think."}, {"viet": "Tôi e ngại cái giọng ho đó.", "eng": "I don't like the sound of that cough."}, {"viet": "Tôi không muốn dùng món gì dễ tiêu cả, bởi vì nó sẽ không làm tôi no.", "eng": "I don't want anything light, because it won't fill me up."}, {"viet": "Tôi không biết cô ấy đã mua nó ở đâu.", "eng": "I don't know where she bought it."}, {"viet": "Tôi mong ( rằng ) tôi sẽ được trở về vào chủ nhật.", "eng": "I expect ( that ) I will be back on Sunday."}, {"viet": "Tôi cảm thấy óc rối loạn vì mệt lử sau một chuyến bay dài.", "eng": "I felt completely disorientated with the jet lag."}, {"viet": "Tôi thấy mình phải gánh thêm ba người khách nữa đến ăn bữa tối.", "eng": "I found myself landed with three extra guests for dinner."}, {"viet": "Tôi kiếm được nó hầu như với giá cho không trong một cuộc bán đồ tầm tầm.", "eng": "I got it for next to nothing in a jumble sale."}, {"viet": "Tôi uống cà phê sau bữa ăn tối theo thói quen thông thường của tôi.", "eng": "I had coffee after dinner, as is my usual practice."}, {"viet": "Tôi ghét cái âm nhạc bi luỵ dâm đãng mà họ chơi khi hai người hôn nhau trong phim.", "eng": "I hate this lustfully emotional music they play when two people kiss in a film."}, {"viet": "Tôi rất hy vọng đỗ kì thi này.", "eng": "I have high hopes of passing the exam."}, {"viet": "Tôi đã thề vĩnh viễn thù nghịch với mọi hình thức bạo ngược đối với trí óc con người.", "eng": "I have sworn eternal hostility against every form of tyranny over the mind of men."}, {"viet": "Tôi không thấy anh ta từ tám hôm nay rồi.", "eng": "I haven't seen him since yesterday week."}, {"viet": "Tôi nghe tiếng chân hắn trong hội trường.", "eng": "I heard this footsteps in the hall."}, {"viet": "Tôi hy vọng ông đã thưởng thức bữa ăn tối nay.", "eng": "I hope you enjoyed your dinner."}, {"viet": "Tôi biết nó cũng hơi khuôn sáo một chút nhưng cô ấy là tất cả đối với tôi.", "eng": "I knew it's a bit of a cliché, but she means everything to me."}, {"viet": "Tôi cho ( khách trọ ) thuê những phòng không sử dụng của tôi.", "eng": "I let my spare rooms ( to lodgers )."}, {"viet": "Tôi sẽ trở lại vào trong vài ngày nữa.", "eng": "I'll be back in a couple of days."}, {"viet": "Khi nào có bàn trống, tôi sẽ báo cho các vị biết.", "eng": "I'll inform you when a table is free."}, {"viet": "Tôi nói với anh là tôi yêu cô ấy.", "eng": "I love her, I tell you."}, {"viet": "Tôi rất vui khi cô thích chúng.", "eng": "I'm glad you liked them."}, {"viet": "Tôi không dám liều đi dưới mưa như thế này.", "eng": "I'm not venturing out in this rain."}, {"viet": "Tôi đã may mắn chọn đúng và đã thắng!", "eng": "I made a fortunate choice and won!"}, {"viet": "Tôi phải tự mua cho mình một cái áo sơ mi mới.", "eng": "I must buy myself a new shirt."}, {"viet": "Tôi cần một ít tiền mặt cho chuyến thăm Thượng Hải của tôi.", "eng": "I need some cash for my visit in Shanghai."}, {"viet": "Tôi thường kiếm được tiền qua đánh bài nhưng không bao giờ tiết kiệm nổi một xu-dễ đến, dễ đi là khẩu hiệu của tôi.", "eng": "I often win money at cards but never save a penny-easy come, easy go is my motto."}, {"viet": "Tôi hứa là sẽ thanh toán lại cho anh, tôi thề đấy.", "eng": "I promise I'll pay you back, on my honour."}, {"viet": "Tôi đã mất nhiều công sức thực sự cho bài luận vừa rồi của mình.", "eng": "I really sweated over my last essay."}, {"viet": "Bây giờ, tôi trả lại cái thiết bị nối điện cho cô.", "eng": "I return the connector to you."}, {"viet": "Tôi thấy cô thêm trứng vào trước khi đổ sữa.", "eng": "I see you add the egg before the milk."}, {"viet": "Lẽ ra tôi không nên đặt sách xuống.", "eng": "I shouldn't have put my book down."}, {"viet": "Tôi đề xuất Pari là một nơi tốt đẹp cho một tuần trăng mật.", "eng": "I suggest Paris as a good place for a honeymoon."}, {"viet": "Tôi nghĩ chiều nay tôi sẽ chuồn học.", "eng": "I think I'll bunk off classes this afternoon."}, {"viet": "Tôi nghĩ việc đó sẽ không lãng phí thời gian.", "eng": "I think that would be a waste of time."}, {"viet": "Tôi nghĩ giới hạn tốc độ là 55 mà.", "eng": "I thought the spend limit was 5."}, {"viet": "Tôi đã cắt bớt một insơ gấu của chiếc váy này.", "eng": "I trimmed an inch off the hem of this skirt."}, {"viet": "Tôi chỉ mới ở đây được ba tháng.", "eng": "I've only been here three months."}, {"viet": "Tôi muốn rảnh ngày cuối tuần sắp tới để có thể làm vườn.", "eng": "I want to keep next weekend clear so that I can do some gardening."}, {"viet": "Tôi ngồi ở cuối rạp xi-nê nên không thể xem rõ.", "eng": "I was at the back of the cinema and couldn't see well."}, {"viet": "Tôi cứ phân vân về chuyện rời bỏ London, ở đó thì có bạn bè, nhưng ở nước ngoài lại có công ăn việc làm tốt.", "eng": "I was in two minds about leaving London, my friends were there, but the job abroad was a good one."}, {"viet": "Tôi choáng người nghe thấy tin ông ta chết.", "eng": "I was staggered to hear of his death."}, {"viet": "Tôi đi xem hôm chủ nhật rồi với một người bạn.", "eng": "I went last Sunday with a friend."}, {"viet": "Tôi mong sao tàu chạy nhanh hơn và đến cho rồi.", "eng": "I wish the train would hurry up and come."}, {"viet": "Tôi không biết khi nào sẽ hết mùa mưa.", "eng": "I wonder when the rainy season will end."}, {"viet": "Tôi muốn đăng ký hành lý của tôi.", "eng": "I would like to check-in my luggage."}, {"viet": "Tôi chẳng có đủ sức chịu đựng ngồi chữa đồng hồ suốt ngày.", "eng": "I wouldn't have the patience to sit mending watches all day."}, {"viet": "Nếu anh ta cứ tiếp tục lái xe như vậy có ngày anh ta sẽ bỏ mạng.", "eng": "If he carries on driving like that, he'll end up dead."}, {"viet": "Nếu không phải làm việc mệt nhọc, thức ăn sẽ được dự trữ lâu hơn.", "eng": "If it is not working as hard, the food lasts for a long time."}, {"viet": "Nếu không có mỡ thì một vài tế bào của cơ thể bị thay đổi.", "eng": "If there is no fat, some of their body cells burn up instead."}, {"viet": "Nếu bạn cộng 5 với 5 bạn sẽ có 10.", "eng": "If you add 5 and 5, you get 10."}, {"viet": "Nếu cậu không muốn bị lạc thì hãy bám chắc lấy mình.", "eng": "If you don't want to get lost, you'd better stick with me."}, {"viet": "Nếu anh từ chối sự giúp đỡ của cô ấy vì giận cô ta thì tức là anh tự hại mình đấy.", "eng": "If you refuse her help because you're angry with her, you're cutting off your nose to spite your face."}, {"viet": "Sự ngu dốt và mê tín ngăn cản họ thừa hưởng thành quả của y học hiện đại.", "eng": "Ignorance and superstition prevent them from benefiting from modern medicine."}, {"viet": "Ở Anh, Hội đồng thiết kế trao phần thưởng cho các thiết kế công nghiệp tốt.", "eng": "In Britain, the Design Council gives awards for good industrial design."}, {"viet": "Thời trai trẻ, anh ta là một tay hưởng lạc quá độ.", "eng": "In his youth he was an extravagant epicurean."}, {"viet": "Ở một số nước các cuộc hôn nhân được thu xếp bởi những người làm mối.", "eng": "In some countries marriages are arranged by go-betweens."}, {"viet": "Dưới ánh sáng của loại đèn như thế, các cánh hoa hồng vẫn thấy màu đỏ.", "eng": "In the light of a such a lamp the petals of the rose would still look red."}, {"viet": "Các ông muốn chúng được gửi đi theo phương thức nào?", "eng": "In what way do you want them to be sent?"}, {"viet": "Có phải đầu to biểu thị một trí óc thông minh lớn không?", "eng": "Is a large head indicative of high intelligence?"}, {"viet": "Đó là thành phần diễn viên cảu New York à?", "eng": "Is that the New York cast?"}, {"viet": "Kei ơi, chỗ này tập lái xe có tốt không hả?", "eng": "Is this a good place to learn to drive, Kei?"}, {"viet": "Thật là thuận lợi có một bác sĩ sống gần chúng tôi.", "eng": "It's a great convenience to have the doctor living near us."}, {"viet": "Đó là một cú sốc khủng khiếp nhưng cô ấy có sức bật tinh thần và sẽ sớm vượt qua được.", "eng": "It's been a terrible shock, but she's very resilient and will get over it soon."}, {"viet": "Chắc chắn trời sẽ mưa khi anh muốn ra đi.", "eng": "It's guaranteed to rain when you want to go out."}, {"viet": "Anh đến sớm hay muộn, đối với tôi không quan trọng.", "eng": "It's no matter to me whether you arrive early or late."}, {"viet": "Joyce đã bỏ lỡ buổi hoà nhạc thật là khá tiếc!", "eng": "It's rather a shame that Joyce missed the concert!"}, {"viet": "Việc ăn gà tây vào ngày Nôen là truyền thống ở Anh.", "eng": "It's traditional in England to eat turkey on Christmas Day."}, {"viet": "Để cho xe chạy ( họ ) phải chi đến 1000 pao một năm.", "eng": "It costs ( them ) 1000 pounds a year to run a car."}, {"viet": "Nó cũng được niêm yết trên bảng thông báo ở tiền sảnh.", "eng": "It is also posted on the bulletin board in the lobby."}, {"viet": "Để hiểu được chiến lược của người Nga... chúng ta cần phải tách mình ra khỏi huyền thoại của chúng ta và đi vào huyền thoại của họ.", "eng": "It is necessary for us to distance ourselves from our myths and to enter into theirs."}, {"viet": "Chấp thuận hoặc bác bỏ lời đề nghị là trách nhiệm của anh.", "eng": "It lies with you to accept or reject the proposal."}, {"viet": "Một ngày đẹp trời, phải không?", "eng": "It's a nice day, isn't it?"}, {"viet": "Theo hướng ngược lại, lên nguồn của con sông này.", "eng": "It's the other way, up the river."}, {"viet": "Cô nàng mặc quần áo của nàng lâu khủng khiếp.", "eng": "It takes her forever to get dressed."}, {"viet": "Hầu như không thể nào leo lên thuyền trở lại được nữa.", "eng": "It was all but impossible to climb back into the boat."}, {"viet": "Đó không phải là lúc thuận tiện để mở một doanh nghiệp mới.", "eng": "It was not a propitious time to start a new business."}, {"viet": "Đó không phải là một sự nhầm lẫn-anh đã cố tình mở thư của tôi.", "eng": "It wasn't mistake-you purposely opened my letter."}, {"viet": "Mặt hàng số 7 dường như khá thú vị đối với chúng tôi.", "eng": "Item No. 7 seems quite interesting to us."}, {"viet": "John ạ, tại sao bạn không cho tôi biết đôi điều về bạn?", "eng": "John, why don't you tell me a little something about yourself?"}, {"viet": "Ông chỉ cần ký vào dòng chấm chấm là cái xe ô tô thuộc về ông.", "eng": "Just sign on the dotted line and the car is yours."}, {"viet": "Tiếng La tinh có nhiều biến tố hơn tiếng Anh.", "eng": "Latin is a more inflected language than English."}, {"viet": "Chúng ta hãy đi máy bay vé hạng doanh nhân đến Vancouver nhé.", "eng": "Let's fly business class to Vancouver."}, {"viet": "Hãy nhớ là bà không có đeo vật gì bằng kim loại.", "eng": "Make sure that you're not wearing any metal."}, {"viet": "Nhiều người không có việc làm trong thời kỳ suy thoái.", "eng": "Many people were idle during the depression."}, {"viet": "Thi thố tài năng của anh với những chuyên gia trong cuộc thi đố vui này.", "eng": "Match your skill against the experts in this quiz."}, {"viet": "Chúng tôi có thể ngỏ lời chúc mừng anh được không?", "eng": "May we proffer you our congratulations?"}, {"viet": "Hầu hết các gia đình hoàng tộc Châu Âu đều có liên quan họ hàng với nhau.", "eng": "Most European royal families are connected with each other."}, {"viet": "Thưa ông Wilson, Tôi rất tiếc khi nói về cái chết của người chị Lilian yêu quý của ông.", "eng": "Mr. Wilson, I'm very sorry to hear of the death of your beloved sister Lilian."}, {"viet": "Xe ô tô bị pan, rồi tôi lại tự mình khoá cửa nhà không vào được, thật đúng là xui quá!", "eng": "My car broke down, then I locked myself out, it's just not my day!"}, {"viet": "Bạn bè của tôi sẽ đến đây tối nay mà trong phòng của tôi lại không có đủ ghế và tách.", "eng": "My friends are coming here this evening and there aren't enough chairs and cups in my room."}, {"viet": "Công việc mới của tôi bắt đầu vào tháng Năm.", "eng": "My new job starts in May."}, {"viet": "Vợ tôi nằm bệnh viện-có thể đẻ bất cứ lúc nào.", "eng": "My wife's in hospital-our baby could arrive at any time."}, {"viet": "Những người mới tới phải chấp nhận địa vị ở dưới cùng trật tự phân hạng.", "eng": "Newcomers have to accept their position at the bottom of the pecking order."}, {"viet": "Không, ồ nhìn này, tôi có một gói thuốc khác ở đây.", "eng": "No, oh look, I've got another packet here."}, {"viet": "Không ai bảo tôi tìm anh ở đâu, đó chỉ là trực giác.", "eng": "Nobody told me where to find you, it was sheer intuition."}, {"viet": "Ngày nay một người phụ nữ có thể yêu cầu một người đàn ông lấy mình, đúng không?", "eng": "Nowadays, a woman can ask a man to marry her, can't she?"}, {"viet": "Ồ, Coi chừng! và Ôi là những thán từ.", "eng": "Oh, Look out! and Ow! are exclamations."}, {"viet": "Do kiểm tra thêm nữa, người ta thấy rằng chữ ký đó là không thật.", "eng": "On further examination it was found that the signature was not genuine."}, {"viet": "Một gia đình bốn người hết sức túng quẫn.", "eng": "One family in four was on the breadline."}, {"viet": "Họa hoằn lắm tôi mới ăn ở nhà hàng.", "eng": "Only rarely do I eat in restaurants."}, {"viet": "Các nhà xuất khẩu của chúng ta đã kiêu hãnh giữ vững ngọn cờ ở cuộc triển lãm thương mại quốc tế.", "eng": "Our exporters proudly kept the flag flying at the international trade exhibition."}, {"viet": "Hàng dự trữ mới quần áo mùa đông của chúng ta sẽ đến nơi ngay.", "eng": "Our new stock of winter clothes will arrive soon."}, {"viet": "Lực lượng làm việc của chúng ta là hoàn toàn có thể tin cậy.", "eng": "Our work-force are completely dependable."}, {"viet": "Những hành khách đã chết ngạt trong chiếc máy bay đang cháy.", "eng": "Passengers suffocated in the burning aircraft."}, {"viet": "Mọi người háo hức được giới thiệu với ngôi sao điện ảnh đến thăm.", "eng": "People were falling over themselves to be introduced to the visiting film star."}, {"viet": "Hãy chở tôi đến những nơi đáng tham quan trong thành phố này nhé.", "eng": "Please take me to all that is worth seeing in this town."}, {"viet": "Rất hiếm khi cô ta nhờ vả nhưng đây là một vấn đề khẩn cấp.", "eng": "Rarely did she request help but this was a matter of urgency."}, {"viet": "Những nguồn tài liệu phái sinh của ông về cuộc nghiên cứu sử học.", "eng": "Secondary sources of historical research."}, {"viet": "Giá cổ phần cho thấy những bước tiến có ý nghĩa thời nay.", "eng": "Share prices showed significant advances today."}, {"viet": "Cô ấy luôn luôn tỏ ra có một lối suy nghĩ thiếu thực tế.", "eng": "She's always shown an academic turn of mind."}, {"viet": "Cô ấy sẽ gọi điện tối nay! Tôi tin chắc điều đó.", "eng": "She's going to phone tonight! I can feel it in my bones."}, {"viet": "Bà ta không phải là nghèo mà là phung phí tiền bạc.", "eng": "She's not so much poor as careless with money."}, {"viet": "Cô ta cao lạ thường, y như cả hai cha mẹ của cô ta.", "eng": "She's unusually tall, as are both her parents."}, {"viet": "Cô ta trả lời không một chút do dự.", "eng": "She answered without a moment's hesitation."}, {"viet": "Dù thế nào cô ta cũng phải trở về với cha mẹ của cô ta.", "eng": "She can always move back with her parents."}, {"viet": "Cô ấy không thể chịu bị sai bảo làm cái này, cái kia.", "eng": "She couldn't stand to be told what to do."}, {"viet": "Cô ấy bán tống bán tháo hàng hoá ở công viên thành phố.", "eng": "She disburdened her merchandise in the town square."}, {"viet": "Từ khi ly hôn cô ta cảm thấy rất lúng túng trong cuộc sống.", "eng": "She feels very mixed-up about life since her divorce."}, {"viet": "Cô ta tặng cho hắn ta một cú đấm thật mạnh.", "eng": "She gave him a mighty thump."}, {"viet": "Bà đã tích luỹ được nhiều hiểu biết trong cả cuộc đời lâu dài của mình.", "eng": "She had acquired much wisdom during her long life."}, {"viet": "Cô ta đánh giá tác phẩm của anh có phần nào không cao.", "eng": "She has a rather poor opinion of your written work."}, {"viet": "Bà ta có những thông tin có giá trị trong tay.", "eng": "She has valuable information in her possession."}, {"viet": "Cô ta rất dè dặt trong cách ăn mặc.", "eng": "She is conservative in the way she dresses."}, {"viet": "Cô ta dùng khuỷu tay huých mạnh vào xương sườn tôi.", "eng": "She jabbed me in the ribs with her elbow."}, {"viet": "Cô ấy sống trong một ngôi nhà nhỏ ở một nơi khuất nẻo.", "eng": "She lives in a little house out in the middle of nowhere."}, {"viet": "Bà ấy không có thái độ phân biệt giữa con mình với con nuôi.", "eng": "She makes no differences between her own children and her step-children."}, {"viet": "Cô ta mở thùng thư và đút nhanh một tờ báo vào.", "eng": "She opened the letter-box and slipped a newspaper through."}, {"viet": "Cô ấy để thòng lọng quanh cổ con bò.", "eng": "She put a loop rope around the cow's neck."}, {"viet": "Cô ta vội vã đi làm, giường không dọn.", "eng": "She rushed off to work leaving her bed unmade."}, {"viet": "Nàng vừa mới bỏ rơi anh bạn trai của nàng.", "eng": "She's just chucked her boyfriend."}, {"viet": "Mẹ nói là bố mẹ không yêu nhau nữa.", "eng": "She said you just didn't love each other."}, {"viet": "Bà ta lắc cái túi và mấy đồng tiền rơi ra.", "eng": "She shook the bag and some coins fell out."}, {"viet": "Bà đã suốt đời tham gia vận động cho quyền của phụ nữ.", "eng": "She spent her life campaigning for women's rights."}, {"viet": "Bà ta đã lừa Sở Bảo hiểm xã hội lấy 1000 pao.", "eng": "She swindled 1000 pounds out of the Social Security."}, {"viet": "Cô ta cố tránh anh ta ở bữa tiệc nhưng anh ta cứ bám cô ta như đỉa vậy.", "eng": "She tried to get rid of him at the party but he stuck to her like a bur."}, {"viet": "Chị ấy muốn có mặt ở giây phút quyết định khi việc kinh doanh của anh ta cuối cùng sụp đổ.", "eng": "She wants to be in at the kill when his business finally collapses."}, {"viet": "Cô ấy đang đập sạch bụi tấm thảm.", "eng": "She was beating the dust out of the carpet."}, {"viet": "Bà ta được dành cho buổi lễ tiễn đưa trọng thể tại sân bay.", "eng": "She was given a good sendoff at the airport."}, {"viet": "Cô ta cực kỳ hoan hỉ sau thắng lợi.", "eng": "She was on cloud nine after her victory."}, {"viet": "Cô ta nhìn đăm đăm ra xa.", "eng": "She was staring into the distance."}, {"viet": "Cô ấy tắm rửa, mặc quần áo và ăn sáng.", "eng": "She washed, dressed and ate her breakfast."}, {"viet": "Cô ta làm anh ấy bằng một cái liếc mắt khinh bỉ.", "eng": "She withered him with a scornful glance."}, {"viet": "Cô ta viết những truyện vui nhưng còn kém xa phần đông những nhà tiểu thuyết nghiêm túc.", "eng": "She writes quite amusing stories but the she can't hold a candle to the more serious novelist."}, {"viet": "Hãy cho tôi biết khả năng anh làm được cái gì.", "eng": "Show me what you are capable of."}, {"viet": "Vì chúng ta sắp đưa ra mặt hàng hoàn toàn mới, tôi nghĩ chúng ta cần có những cái tên hoàn toàn mới.", "eng": "Since we're introducing something completely new, I think we need completely new names."}, {"viet": "Suốt ngày lê lết khắp nơi chẳng chịu làm gì.", "eng": "Slouching about all day doing nothing."}, {"viet": "Theo chỗ tôi biết, dự án đã xong rồi.", "eng": "So far as I am concerned, the project is over."}, {"viet": "Binh lính trở nên tàn bạo vì cuộc chiến tranh kéo dài.", "eng": "Soldiers brutalized by a long war."}, {"viet": "Một số người Mỹ bản địa đang làm những đồ thủ công Mỹ nghệ đã bị bỏ quên.", "eng": "Some Native Americans are doing arts and crafts that were given up or forgotten."}, {"viet": "Một số trường học đặt tầm quan trọng to lớn vào việc học ngôn ngữ.", "eng": "Some schools place great emphasis on language study."}, {"viet": "Đôi khi anh ta phải đi đây đó tới những miền khác nhau của nước Ý.", "eng": "Sometimes he has to travel, to go to other parts of Italy."}, {"viet": "Những phẩm chất đặc biệt làm nàng nổi bật trong đám dân thường.", "eng": "Special qualities which mark her out from the multitude."}, {"viet": "Văn phòng phẩm được để trong tủ dự trữ.", "eng": "Stationery is kept in the stock cupboard."}, {"viet": "Đừng đùa nữa và bắt tay vào công việc của anh đi.", "eng": "Stop larking about and get on with your work."}, {"viet": "Những học sinh nào thi trượt sẽ phải thi lại.", "eng": "Students who fell the exam will have to take it again."}, {"viet": "Đó là ý kiến của cô ta trước khi gặp Ian.", "eng": "Such was her opinion before meeting Ian."}, {"viet": "Chắc chắn là anh không mong tôi phải tin vào những đề nghị quái gở của anh phải không?", "eng": "Surely you don't expect me to take your potty suggestions seriously?"}, {"viet": "Thủ tục tiến hành các thủ tục tố tụng truy tố người nào.", "eng": "Take legal proceedings against somebody."}, {"viet": "Việc dạy học thì không thỏa đáng lắm về tài chính.", "eng": "Teaching is not very rewarding financially."}, {"viet": "Bọn khủng bố, từ những vị trí rất kín, bắn tỉa vào binh lính.", "eng": "Terrorists sniping at soldiers from well-concealed positions."}, {"viet": "Không phải làm như thế đâu, đồ ngu ạ!", "eng": "That's not the way to do it, you lunk head!"}, {"viet": "Cái con mèo chết tiệt này đã ăn sạch bữa tối của ta rồi!", "eng": "That darn cat has eaten my supper!"}, {"viet": "Việc đó để anh nhận định.", "eng": "That'll be for you to decide."}, {"viet": "Đó là một vấn đề khá tế nhị.", "eng": "That's a rather tender subject."}, {"viet": "Chuyện đó cách đây vài năm.", "eng": "That was a few years back."}, {"viet": "Tai nạn là một lời nhắc nhở có lợi về những nguy hiểm của việc leo trèo.", "eng": "The accident is a salutary reminder of the dangers of climbing."}, {"viet": "Sự tiến bộ của khoa học đã mở ra một chân trời mới.", "eng": "The advance of science opened a new horizon."}, {"viet": "Số lượng máu do nhịp đập của tim bơm.", "eng": "The amount of blood pumped by each heartbeat."}, {"viet": "Công trình kiến trúc nhà hát lớn thành phố quan trọng nhất của kiến trúc sư.", "eng": "The architect's pièce de résistance Opera House."}, {"viet": "Họa sĩ đó dùng sơn dầu để vẽ chân dung.", "eng": "The artist chose the medium of oil for the portrait."}, {"viet": "Nguồn gốc của bài thơ không ai biết.", "eng": "The authorship of this poem is not known."}, {"viet": "Quả bóng chạm vào một hậu vệ và bay lệch hướng vào lưới.", "eng": "The ball hit one of the defenders and was deflected into the net."}, {"viet": "Nước tắm tràn vì tôi quên không tắt nước.", "eng": "The bath overflowed because the water off."}, {"viet": "Xí nghiệp sản xuất xe đạp bây giờ là một hợp tác xã của công nhân.", "eng": "The bicycle factory is now a worker's co-operative."}, {"viet": "Quả đấm đã đánh nó bật vào tường, tay chân dang ra.", "eng": "The blow spread-eagled him against the wall."}, {"viet": "Quyển sách nhắc đến nhiều địa danh nơi mà tôi biết.", "eng": "The book is full of references to places I know."}, {"viet": "Thằng bé cúi xuống để chuẩn bị ăn roi.", "eng": "The boy bent over to be caned."}, {"viet": "Bộ lông rực rỡ màu sắc của chim vùng nhiệt đới.", "eng": "The brightly coloured plumage of tropical birds."}, {"viet": "Chiếc xe buýt nhảy sóc lên trên con đường núi.", "eng": "The bus jolted along the mountain road."}, {"viet": "Sự chểnh mảng của thuyền trưởng đã dẫn đến việc con tàu bị lạc đường.", "eng": "The captain's delinquency led to the loss of the ship."}, {"viet": "Chiếc xe ôtô trượt ra khỏi con đường và lăn lông lốc xuống dốc.", "eng": "The car skidded off the road and rolled over and over down the slope."}, {"viet": "Con mèo thu mình lại, sẵn sàng nhảy.", "eng": "The cat crouched, ready to leap."}, {"viet": "Nhà vô địch bị hạ ngay hiệp đầu sao? Quả là một sự kiện khác thường!", "eng": "The champion beaten in the first round? That's a turn-up for the book!"}, {"viet": "Đứa trẻ bị lạc trong đám người đi xem trận đấu ra về.", "eng": "The child got lost in the press of people leaving the match."}, {"viet": "Bọn trẻ con đang ở ngoài vườn.", "eng": "The children are in the garden."}, {"viet": "Những đứa trẻ vụt nhanh xuống phố.", "eng": "The children streaked off as fast as they could."}, {"viet": "Tháp nhà thờ cao vút lên bởi một góc chuông.", "eng": "The church tower is surmounted by a steeple."}, {"viet": "Đồng hồ vừa đánh chuông ba giờ.", "eng": "The clock has just struck three."}, {"viet": "Sự quyên góp sẽ được tiến hành sau bài giảng đạo.", "eng": "The collection will be taken up made after the sermon."}, {"viet": "Tài chính của công ty được quản lý rất tồi.", "eng": "The company's finances have been badly administered."}, {"viet": "Công ty sẽ cho bạn vay tiền với những điều khoản rất thuận lợi.", "eng": "The company will lend you money on very favorable terms."}, {"viet": "Những hạn chế trong cuộc sống do thu nhập thấp.", "eng": "The constriction of life on a low income."}, {"viet": "Hội đồng có trách nhiệm về việc thu dọn rác rưởi.", "eng": "The council is responsible for refuse collection."}, {"viet": "Tòa án cho phép người mẹ được quyền nuôi đứa con.", "eng": "The court gave the mother custody of the child."}, {"viet": "Đám khán giả hò reo cổ vũ cho cú thắng.", "eng": "The crowd cheered the winning hit."}, {"viet": "Khách hàng luôn đúng bởi vì tiền là quan trọng nhất.", "eng": "The Customer is always right because cash is king."}, {"viet": "Cuộc tranh luận đã thất bại do một sai lầm nhỏ đã biến thành đám chửi nhau tồi tệ.", "eng": "The debate was marred by a brief lapse into unpleasant name-calling."}, {"viet": "Sự phụ thuộc của mùa màng vào thời tiết.", "eng": "The dependence of the crops on the weather."}, {"viet": "Tất cả các khách đều tuyên bố là bữa ăn tối rất ngon.", "eng": "The dinner was pronounced excellent by all the guest."}, {"viet": "Bác sĩ bảo anh ta cởi quần áo sau bình phong.", "eng": "The doctor asked him to undress behind the screen."}, {"viet": "Mũi con chó giật giật như là nó ngửi thấy mùi thịt.", "eng": "The dog's nose twitched as it smelt the meat."}, {"viet": "Cửa mở ra và bố tôi bước vào.", "eng": "The door opened and in walked my father."}, {"viet": "Bụi bặm đã bám lên mọi thứ.", "eng": "The dust had settled on everything."}, {"viet": "Kết quả cuộc bầu cử là một thảm họa cho đất nước.", "eng": "The election result was a disaster for the country."}, {"viet": "Tiếng Anh có nhiều thành ngữ.", "eng": "The English language has many idioms."}, {"viet": "Chính xác là hai giờ ba phút và 35 giây.", "eng": "The exact time is three minutes and 35 seconds past two."}, {"viet": "Hai thái cực của đau khổ và hạnh phúc.", "eng": "The extremes of misery and bliss."}, {"viet": "Nhà nông trữ ngũ cốc để đổi lấy máy móc và hàng hoá.", "eng": "The farmers hoarded grain to barter for machinery and goods."}, {"viet": "Cuốn phim đúc kết vài năm thành nửa giờ đồng hồ.", "eng": "The film compresses several years into half an hour."}, {"viet": "Các nhân viên cứu hỏa là những người sẽ lo chuyện đó.", "eng": "The firemen are the ones who will take care of it."}, {"viet": "Bài giảng đầu tiên giới thiệu mở đầu sinh viên mới về những nét khái quát của môn học.", "eng": "The first lecture introduces new students to the broad outlines of the subject."}, {"viet": "Những bông hoa rũ xuống vì thiếu nước.", "eng": "The flowers drooped because of lack of water."}, {"viet": "Ngày 4 tháng bảy luôn luôn thú vị.", "eng": "The fourth of July is always enjoyable."}, {"viet": "Cảnh sát đang săn lùng băng tội phạm.", "eng": "The gang are being hunted by the police."}, {"viet": "Các dạng sở hữu cách của các đại từ I, we và she là my/mine, our/ours và her/hers.", "eng": "The genitive forms of the pronouns I, We and She are my/mine our/ours and her/hers."}, {"viet": "Hàng sẽ được giao miễn vận phí tới kho của ông.", "eng": "The goods will be delivered franco to your warehouse."}, {"viet": "Chính phủ đã tăng giá thêm mười xu một galông xăng.", "eng": "The government has put ten pence on the price of a gallon of petrol."}, {"viet": "Chính phủ khuyến cáo mạnh mẽ ngành công nghiệp về tầm quan trọng của việc giải quyết vấn đề lương thấp.", "eng": "The government urged on industry the importance of low pay settlements."}, {"viet": "Quyển sách màu xanh lá cây ở đáy chồng và quyển màu đỏ ở trên đỉnh chồng sách.", "eng": "The green book is at the bottom of the pile and the red one is on top."}, {"viet": "Khách khứa phải đi vào nhà khi trời bắt đầu mưa.", "eng": "The guests had to move inside when it started to rain."}, {"viet": "Hơi nóng làm sữa bị chua.", "eng": "The heat turned the milk sour."}, {"viet": "Những cảnh tượng khủng khiếp sau trận động đất.", "eng": "The horrific scenes after the earthquake."}, {"viet": "Bầy chó săn đã mất mùi con cáo.", "eng": "The hounds lost the scent of the fox."}, {"viet": "Vấn đề nhà ở trong nội thành.", "eng": "The housing problem in the inner cities."}, {"viet": "Các doanh số được cải thiện là niềm khích lệ rất cần thiết cho nền kinh tế.", "eng": "The improved trade figures are a much-needed shot in the arm for the economy."}, {"viet": "Cuộc điều tra cần tỉ mỉ và khách quan, đồng thời tiến hành đủ nhanh để tránh bất cứ sự nghi ngờ nào về tính cách lề mề.", "eng": "The inquiry should be thorough and objective, while working fast enough to avoid suspicion of foot-dragging."}, {"viet": "Vấn đề nghỉ uống trà của nhân viên luôn là một vấn đề không rõ ràng.", "eng": "The issue of staff coffee breaks has always something of a grey area."}, {"viet": "Các trọng tài quyết định cho cả hai bên vào chung kết số điểm bằng nhau.", "eng": "The judges awarded both finalists equal points."}, {"viet": "Vị lãnh tụ đảng Lao động được yêu cầu thành lập một chính phủ.", "eng": "The Labour leader was asked to form a government."}, {"viet": "Những con số mới nhất về thương nghiệp chắc chắn sẽ làm vỡ tan sự thỏa mãn của chính phủ về tình trạng kinh tế.", "eng": "The latest trade figures will surely prick the bubble of government complacency about the economic situation."}, {"viet": "Chùa Ngỗng Trời nhỏ hơn là một cấu trúc thanh lịch tiêu biểu cho kiến trúc triều đại nhà Đường.", "eng": "The Lesser Wild Goose Pagoda is an elegant structure typical of the architecture of the Tang Dynasty."}, {"viet": "Con sư tử là biểu tượng của sự can đảm.", "eng": "The lion is the symbol of courage."}, {"viet": "Tiếng nổ lớn đã làm tôi giật nảy mình.", "eng": "The loud bang made me jump."}, {"viet": "Vị thiếu tá đó rất chú trọng tới ngoại hình của mình.", "eng": "The major was very studious of his appearance."}, {"viet": "Cuộc hôn nhân đó đã chấm dứt bằng một vụ kiện tụng.", "eng": "The marriage ended in a legal shootout."}, {"viet": "Cuộc họp giải tán lúc 11 giờ.", "eng": "The meeting broke up at eleven o'clock."}, {"viet": "Dân quân tiêu diệt bọn xâm nhập đến người cuối cùng.", "eng": "The militiamen annihilated the intruders to the last man."}, {"viet": "Xã hội hiện đại và nền kinh tế hiện đại đã trở nên phân tán.", "eng": "The modern society and the modern economy have come to be dispersive."}, {"viet": "Môi trường sống của loài nhậy bị phá huỷ và loài đó đã gần như tuyệt chủng.", "eng": "The moth's habitat is being destroyed and it has nearly died out."}, {"viet": "Tiếng nhạc to đến nỗi chúng tôi phải gào lên mới nghe được nhau.", "eng": "The music was so loud we had to bellow at each other to be heard."}, {"viet": "Hệ thống xe buýt mới giảm một nửa thời gian đi lại.", "eng": "The new bus service cuts the travelling time by half."}, {"viet": "Vở mới ở Nhà hát Quốc gia là một thành công rất lớn.", "eng": "The new play at the National Theatre's a wow."}, {"viet": "Tin Nữ hoàng đến thăm nhà máy làm cho họ hồi hộp xao xuyến.", "eng": "The news of the Queen's visit to the factory put them into a flutter."}, {"viet": "Phía bắc của toà nhà này không có nhiều ánh sáng mặt trời.", "eng": "The north part of the house doesn't get a lot of sun."}, {"viet": "Mục đích của bài tập này là tìm ra xem sao người ta lại thích mèo hơn là chó.", "eng": "The object of this exercise is to find out how people like cats more than dogs."}, {"viet": "Người đàn bà đứng tuổi làm chủ tiệm bánh kẹo này.", "eng": "The old girl who owns the sweet shop."}, {"viet": "Anh có trách nhiệm làm sáng tỏ vấn đề.", "eng": "The onus of proof rests with you."}, {"viet": "Con cú sà xuống con chuột.", "eng": "The owl swooped down on the mouse."}, {"viet": "Đảng đã bị những phần tử cực đoan xâm nhập vào.", "eng": "The party has been penetrated by extremists."}, {"viet": "Người bệnh quằn quại trên giường hấp hối.", "eng": "The patient was writhing on the bed in agony."}, {"viet": "Sự nhân cách hoá điều ác như một con quỷ là một nét đặc trưng của nền hội hoạ thời trung cổ.", "eng": "The personification of evil as devil is a feature of medieval painting."}, {"viet": "Người phi công cho hạ cánh chiếc máy bay bị hỏng xuống cánh đồng.", "eng": "The pilot brought his crippled plane down in a field."}, {"viet": "Chiếc máy bay lắc mạnh rồi ngừng lại.", "eng": "The plane juddered to a halt."}, {"viet": "Các vận động viên đã tập một lúc ở cọc gôn lưới trước trận đấu.", "eng": "The players had a short net before the game."}, {"viet": "Xe cảnh sát càng lúc càng đuổi gần xe bọn cướp.", "eng": "The police car was gaining ground on the robbers."}, {"viet": "Cảnh sát lung xét vùng đó để tìm tội phạm.", "eng": "The police raked the district for the criminals."}, {"viet": "Thật tội nghiệp! Nó vừa mất việc làm.", "eng": "The poor bastard! He's just lost his job."}, {"viet": "Cặp chân sau mạnh mẽ của một con ếch.", "eng": "The powerful back legs of a frog."}, {"viet": "Chủ tịch hội đồng có quyền phủ quyết.", "eng": "The president of the association has the right of veto."}, {"viet": "Vị thủ tướng đã thừa nhận một cách không chính thức là các cuộc thảo luận đã thất bại.", "eng": "The prime minister admitted, of the record that the talks had failed."}, {"viet": "Vấn đề đó đầy rẫy những khó khăn.", "eng": "The problem bristles with difficulties."}, {"viet": "Lời hứa thả tự do được đưa ra như một cái bả để nhử những tù nhân phải nói.", "eng": "The promise of freedom was held out as a bait to trap prisoners into talking."}, {"viet": "Con nhộng ở giai đoạn chuyển tiếp của sự phát triển, đó là giai đoạn trung gian giữa trứng và bướm trưởng thành.", "eng": "The pupa is at an intermediate stage of development, it is intermediate between the egg and the adult butterfly."}, {"viet": "Con thỏ sợ hãi chạy vụt đi.", "eng": "The rabbit scampered away in fright."}, {"viet": "Nguyên nhân cô ấy bị ốm vì cô ấy ăn phải thịt ôi.", "eng": "The reason she was ill was that she had eaten bad meat."}, {"viet": "Sự chuyển những bức tranh khỏi tường.", "eng": "The removal of the pictures from the walls."}, {"viet": "Kết quả đó là một điều chứng minh cho tất cả những nỗ lực của chúng tôi.", "eng": "The result was a vindication of all our efforts."}, {"viet": "Dòng sông đã phá vỡ bờ và làm ngập thung lũng.", "eng": "The river had burst its banks and flooded the valley."}, {"viet": "Người La Mã tính năm của họ từ ngày sáng lập thành Rô-ma.", "eng": "The Romans counted their years from the date of the founding of Rome."}, {"viet": "Quyết định đó không công bằng đối với mọi người.", "eng": "The ruling was not fair to everyone."}, {"viet": "Nhà thống trị tàn bạo đã ra lệnh hành quyết người tù.", "eng": "The savage ruler ordered that the prisoner be executed."}, {"viet": "Tiếng lạo xạo của ngòi bút cạo lên giấy, của móng tay cạo lên bảng đen.", "eng": "The scrape of sb's pen on paper, of sb's fingernail on a blackboard."}, {"viet": "Do đó, các lá đài có màu xanh lá cây.", "eng": "The sepals therefore look green."}, {"viet": "Con tàu va mạnh mạn vào kè bến cảng.", "eng": "The ship hit the harbour wall broadside on."}, {"viet": "Người chủ hiệu đánh nhau với tên ăn cắp.", "eng": "The shopkeeper struggled with the thief."}, {"viet": "Những động tác uốn mình của vũ công.", "eng": "The sinuous movements of the dancer."}, {"viet": "Tính tục tĩu trong những câu nói chọc cười của diễn viên hài kịch.", "eng": "The smuttiness of the comedian's jokes."}, {"viet": "Giọng sang sảng của vị linh mục.", "eng": "The sonorous tones of the priest."}, {"viet": "Tốc độ giới hạn trên đường này là 70 dặm Anh một giờ.", "eng": "The speed limit on this road is 70 mph."}, {"viet": "Bức tượng đã được dời đi chỗ khác.", "eng": "The statue was removed to another site."}, {"viet": "The streets are wet, so it must have rained là một trường hợp dùng lý để suy diễn từ thực tế để biết nguyên nhân.", "eng": "The streets are wet, so it must have rained is an aposteriori case."}, {"viet": "Tuyết tan đột ngột báo hiệu mùa xuân đã đến.", "eng": "The sudden thaw means that spring is here."}, {"viet": "Thực đơn của cơm phần giá rẻ.", "eng": "The table d'hôte menu offers good value."}, {"viet": "Thầy giáo đã ở trong phòng khi tôi tới.", "eng": "The teacher was already in the room when I arrived."}, {"viet": "Anh ấy đã nhận thức ra được cái sự thật khủng khiếp.", "eng": "The terrible truth was borne in on him."}, {"viet": "Cuộc đình công đe doạ xảy ra đã không bao giờ xảy ra.", "eng": "The threatened strike never materialized."}, {"viet": "Trung tâm thành phố ( giao thông ) chật như nêm.", "eng": "The town centre was chock-a-block ( with traffic )."}, {"viet": "Talông các lốp xe đã mòn đến mức nguy hiểm.", "eng": "The tread on the tyres has worn down to a dangerous level."}, {"viet": "Hai đối thủ giành danh hiệu vô địch hạng nặng.", "eng": "The two contenders for the heavyweight title."}, {"viet": "Những người bị thiệt thòi về quyền lợi cần được sự hỗ trợ đặc biệt.", "eng": "The underprivileged need special support."}, {"viet": "Chiếc xe tải trượt đi ( vài phít ) xuống ven đường đê.", "eng": "The van slipped ( a few feet ) down the embankment."}, {"viet": "Sự phô trương thô thiển của những kẻ mới giàu.", "eng": "The vulgar ostentation of the newly rich."}, {"viet": "Thời tiết thật thất thường-mưa đấy nắng ngay đấy.", "eng": "The weather's so fickle one moment it's raining, the next the sun's out."}, {"viet": "Toàn thể dân làng đã tập họp để đón chào giáo hoàng.", "eng": "The whole village turned out to welcome the pope."}, {"viet": "Người đốn củi chặt cành cây.", "eng": "The wood cutter severed the branch from the tree."}, {"viet": "Nhà văn đã mô tả quá trình sáng tác.", "eng": "The writer described the creative process."}, {"viet": "Cảnh gieo neo của họ không làm cho anh ta mủi lòng-anh ta đã quyết định đòi cho kỳ đủ.", "eng": "Their distress had no effect on him-he was determined to have his pound of flesh."}, {"viet": "Đề nghị của họ đã được chấp thuận.", "eng": "Their proposal has met with approbation."}, {"viet": "Rồi ánh sáng lọt qua một thấu kính ở cửa.", "eng": "Then the light shines in through a lens in the opening."}, {"viet": "Có một mẩu gỗ chẹn dưới cửa, anh có thể rút nó ra được không?", "eng": "There's a piece of wood jammed under the door-can you work it clear?"}, {"viet": "Không còn thời gian đâu mà lần lữa-trời sắp tối rồi.", "eng": "There's no time to linger-it'll soon be dark."}, {"viet": "Ở Mỹ có khoảng 42 quốc gia, nhiều công viên trong số đó có những khu vực cắm trại công cộng cũng như khách sạn và nhà hàng.", "eng": "There are about 42 national parks in the United States, many of which have public camping areas as well as hotels and restaurants."}, {"viet": "Còn nhiều chỗ ở phía sau.", "eng": "There are plenty of seats in the rear."}, {"viet": "Ba người chạy trốn vẫn còn xổng sau khi trốn tù.", "eng": "There fugitives are still at large following the prison escape."}, {"viet": "Có một sự ủng hộ rất đông đảo đối với việc giải trừ vũ khí hạt nhân.", "eng": "There is a large body of support for nuclear disarmament."}, {"viet": "Không có vấn đề trùng nhau giữa hai lớp học.", "eng": "There is no question of overlap between the two courses."}, {"viet": "Vẫn còn nhiều thời gian mà.", "eng": "There's plenty of time yet."}, {"viet": "Trên báo hôm nay có một tin thú vị.", "eng": "There was an interesting item in the newspaper today."}, {"viet": "Có những tiếng lầm bầm bất mãn từ phía lực lượng lao động.", "eng": "There were murmurs of discontent from the work-force."}, {"viet": "Những toà nhà này ở trong tình trạng rất cần sửa sang lại.", "eng": "These buildings are in a bad state of repair."}, {"viet": "Điều kiện ồn ào này không cho phép người ta tập trung vào công việc.", "eng": "These noisy conditions aren't really conducive to concentrated work."}, {"viet": "Họ đòi một số tiền lớn cho ngôi nhà của họ.", "eng": "They're asking a high figure for their house."}, {"viet": "Họ yêu cầu chúng ta trả thêm 10% số tiền trả cho kỳ nghỉ vì giá vé máy bay tăng lên.", "eng": "They've surcharged us 10% on the price of the holiday because of a rise in air fares."}, {"viet": "Chúng nhỏ đến nỗi dung tích của một muỗng cà phê có thể chứa hơn một trăm triệu giọt.", "eng": "They are so tiny that more 100 million of them could be put in the bowl of teaspoon."}, {"viet": "Chúng có thể đi bất cứ đâu trong thành phố.", "eng": "They can go anywhere in town."}, {"viet": "Họ không ưa thích nhau đến mức không thể gặp nhau, do vậy họ đã điều hành tất cả công việc kinh doanh của họ thông qua một người trung gian.", "eng": "They disliked each other too much to meet, so they conducted all their business through an intermediary."}, {"viet": "Họ đã bỏ lỡ mất dịp may cuối cùng để thắng trận đấu này.", "eng": "They gave away their last chance of winning the match."}, {"viet": "Họ đã chính thức thông báo lễ đính hôn của họ.", "eng": "They have officially announced their engagement."}, {"viet": "Họ nhìn anh ta từ đầu đến chân.", "eng": "They looked him over from head to foot."}, {"viet": "Họ kiên trì các cải cách nông nghiệp mặc sự chống đối của các chủ trại.", "eng": "They persisted with the agricultural reforms, despite opposition from the farmers."}, {"viet": "Họ nói rằng họ sẽ chơi bóng đá vào ngày thứ bảy.", "eng": "They said they would play football on Saturday."}, {"viet": "Họ đứng đó say sưa ngắm nhìn cảnh đẹp.", "eng": "They stood drinking in the beauty of the landscape."}, {"viet": "Họ đi ra nước ngoài để được thay đổi cảnh quan.", "eng": "They went abroad for a change of scene."}, {"viet": "Họ buộc phải bán nhà để trả nợ.", "eng": "They were obliged to sell their house in order to pay their debts."}, {"viet": "Tình hình đang tiến triển tốt-đừng làm ( cái gì ) đảo lộn tình thế.", "eng": "Things are progressing well-don't ( do anything to ) rock the boat."}, {"viet": "Chiếc bánh này có một lớp sôcôla ở giữa.", "eng": "This cake has got a layer of chocolate in the middle."}, {"viet": "Văn bằng này chứng nhận anh đã học xong trung học.", "eng": "This diploma certifies that you have completed high."}, {"viet": "Ngôi nhà này không hẳn là chống được bão-mái nhà dột!", "eng": "This house isn't exactly stormproof-the roof leaks!"}, {"viet": "Đây là cuộc liên hoan cuối cùng chúng ta tổ chức, cho nên ta hãy thật sự phóng tay, đừng tiếc gì cả.", "eng": "This is the last party we shall give, so let's really push the boat out."}, {"viet": "Dấu này chỉ ra rằng một từ đã bị xoá.", "eng": "This mark denotes that a word has been deleted."}, {"viet": "Hiện tượng này là độc nhất trong ( toàn bộ ) thiên nhiên.", "eng": "This phenomenon is unique in ( the whole of ) nature."}, {"viet": "Câu này không thể giải thích như thế được.", "eng": "This sentence does not bear such a construction."}, {"viet": "Cái van này để điều chỉnh dòng chảy.", "eng": "This valve regulates the flow of water."}, {"viet": "Mặc dù ít quân hơn, họ đã chống lại ( các cuộc tấn công liên tiếp của ) kẻ thù.", "eng": "Though outnumbered, they held off ( repeated attacks by ) the enemy."}, {"viet": "Tom Jones hát một vài bài, giới thiệu vài vị khách cùng thời và nói nhiều về những ngày xưa tươi đẹp.", "eng": "Tom Jones sang a few songs, introduced some contemporary guests, and talked a lot about the good old days."}, {"viet": "Qua cái nhìn đăm đắm của anh ta, cô ấy cảm thấy khó chịu.", "eng": "Under his intense gaze she felt uncomfortable."}, {"viet": "Nó đã bị phát hiện là hợp tác chặt chẽ với địch.", "eng": "Was found to be hand in glove with the enemy."}, {"viet": "Chúng ta sẽ đi dạo nếu anh thích.", "eng": "We'll go for a walk if you feel like it."}, {"viet": "Chúng tôi định mời vài người bạn đến chơi vào thứ sáu, và chúng tôi muốn bạn đến.", "eng": "We're going to have a few friends over on Friday, and we'd love you to come."}, {"viet": "Chúng tôi đã gửi cho các ông đơn ủy thác mua hàng với số tham chiếu là A2738 và mong nhận được sự tái xác nhận của các ông.", "eng": "We've already sent you an indent with Reference No. A2738 and look forward to your confirmation."}, {"viet": "Chúng tôi ( đã bị xếp ) thành một cặp cho bài nhảy tiếp theo.", "eng": "We ( were ) partnered off for the next dance."}, {"viet": "Bây giờ chúng ta đang đến gần thành phố rồi.", "eng": "We are getting near the city now."}, {"viet": "Chúng tôi làm cho kế hoạch bắt chúng tôi của họ thất bại.", "eng": "We baffled their attempts to capture us."}, {"viet": "Chúng tôi có thể để cho anh ở đây được nếu các khách sạn hết chỗ.", "eng": "We can house you if the hotels are full."}, {"viet": "Chúng tôi không thể nào thuyết phục bà già ấy đi bằng máy bay.", "eng": "We couldn't induce the old lady to travel by air."}, {"viet": "Mỗi sáng chúng tôi dùng điểm tâm lúc 7 giờ ngoại trừ những ngày cuối tuần.", "eng": "We eat breakfast at seven every morning except for weekends."}, {"viet": "Chúng tôi đã vui vẻ chuyện gẫu trong khi uống trà.", "eng": "We had a pleasant chat over a cup of tea."}, {"viet": "Ở đây chúng tôi có cả một thành phố đấy.", "eng": "We have a whole city here."}, {"viet": "Chúng ta phải chọn một người quản đốc mới trong bản danh sách ngắn gồm 5 người.", "eng": "We have to choose new manager from a short-list of five candidates."}, {"viet": "Chúng tôi để đèn vì lũ trẻ sợ bóng tối.", "eng": "We leave that light on because the children are frightened of the dark."}, {"viet": "Chúng tôi đã chuyển hàng hoá về phía cột buồm.", "eng": "We moved the cargo forward of the mast."}, {"viet": "Chúng ta phải cố gắng nghĩ về điều gì tốt nhất cho anh ấy, hơn nữa, chúng ta phải xem xét điều anh ấy muốn làm.", "eng": "We must try to think about what is best for him, equally we must consider what he wants to do."}, {"viet": "Chúng tôi hứa sẽ cho cô bé một con búp bên ngày sinh nhật.", "eng": "We promised her a doll for her birthday."}, {"viet": "Tất cả chúng tôi sẽ rất nhớ anh khi anh đi.", "eng": "We shall all miss you when you go away."}, {"viet": "Chúng tôi ngờ ngợ là anh ta hẳn đã gặp một tai nạn.", "eng": "We surmised that he must have had an accident."}, {"viet": "Chúng tôi hoàn toàn sững sờ nhìn cô ta khăn gói ra đi.", "eng": "We watched in blank dismay as she packed her bags."}, {"viet": "Chúng tôi bị tách biệt ra một khoảng mười bộ.", "eng": "We were separated by a space of ten feet."}, {"viet": "Chúng tôi muốn ngồi với nhau.", "eng": "We would like to sit together."}, {"viet": "À, tôi nghĩ là tôi cần thời gian để xem các ca-ta-lo này.", "eng": "Well, I think I need some time to look at these catalogues."}, {"viet": "À, xe buýt chắc chắn là cách đi rẻ đấy.", "eng": "Well the bus certainly a cheap way to go."}, {"viet": "Thật là nhẹ cả người!'cô ta vừa nói vừa tháo đôi giày chật ra.", "eng": "What a relief!'she said, as she took her tight shoes off."}, {"viet": "Thưa bà, tôi có thể cho bà xem thứ gì ạ?", "eng": "What can I show you, madam?"}, {"viet": "Trong T. G Smith T. G là viết tắt của chữ gì vậy?", "eng": "What does T. G stand for in T. G Smith?"}, {"viet": "Mối liên hệ giữa hai tư tưởng đó là cái gì?", "eng": "What is the connection between the two ideas?"}, {"viet": "Ông muốn mở tài khoản loại nào?", "eng": "What kind of accounts do you like to open?"}, {"viet": "Anh đang chơi game gì vậy?", "eng": "What's this game you're playing?"}, {"viet": "Ông muốn uống gì, bia, sâm panh, rượu vang hay rượu Mao Đài?", "eng": "What would you like to drink, beer, champagne, wine, or Maotai?"}, {"viet": "Khi đã trở nên giàu có, nó đã bỏ rơi tất cả các bạn cũ của nó.", "eng": "When he became rich he threw over all his old friends."}, {"viet": "Vậy thì khi nào anh bạn trai của cô đến ăn tối.", "eng": "When is your young man coming to dinner then."}, {"viet": "Khi người Tây Ban Nha xâm chiếm Mê-hi-cô 400 năm trước đây, họ khiếp đảm khi thấy người Aztecs với nền văn minh cao vẫn ăn thịt những chiến binh họ bắt được trong chiến trận.", "eng": "When the Spaniards conquered Mexico 400 years ago, they were horrified to find that the highly civilized Aztecs ate the flesh of some of the warriors they captured in hate."}, {"viet": "Bất kì khi nào đến Luân Đôn tôi đều cảm thấy mình giống một anh chàng nhà quê lên tỉnh.", "eng": "Whenever I go to London, I feel like a provincial."}, {"viet": "Lần này chúng ta sẽ đi câu ở đâu?", "eng": "Where shall we go fishing this time?"}, {"viet": "Những vùng nào của Canada rất lạnh vào mùa đông?", "eng": "Which parts of Canada are very cold in the winter?"}, {"viet": "Ai là người có khả năng sẽ thắng trong cuộc đua tranh chức tổng thống?", "eng": "Who are the front runners in the Presidential contest?"}, {"viet": "Tại sao em lại đến bác sĩ tâm lí?", "eng": "Why are you going to a psychiatrist?"}, {"viet": "Tại sao mà tôi cứ phải luôn luôn làm vệ sinh buồng tắm?", "eng": "Why is it that I always land up cleaning the bath?"}, {"viet": "Giúp tôi một tay lau chùi được không?", "eng": "Will you give me a hand with the cleaning?"}, {"viet": "Với cái cười nhe răng kinh tởm hiện lên trên mặt, hắn rút dao ra.", "eng": "With a nasty grin of his face he took out a knife."}, {"viet": "Những sườn đồi nhiều cây rực lên một màu đỏ về mùa thu.", "eng": "Wooded hillsides that flame red in autumn."}, {"viet": "Các vị có muốn dùng rau củ hoặc súp gì không?", "eng": "Would you like any vegetables or soup?"}, {"viet": "Chị làm ơn ẵm hộ đứa bé một lát được không?", "eng": "Would you mind taking the baby for a moment?"}, {"viet": "Phải rồi, còn tuần trước mấy đứa con của anh bị ốm phải không?", "eng": "Yeah, and last week one of the children wasn't well?"}, {"viet": "Tốt chứ, đường này đâu có xe cộ đi lại.", "eng": "Yes, no cars use this road."}, {"viet": "Anh sẽ trượt môn tiếng Pháp nếu như anh không học tích cực hơn.", "eng": "You'll fail in French unless you work harder."}, {"viet": "Cậu phệ ra rồi đấy-cần phải ăn kiêng đi!", "eng": "You're getting a bit plump-you need to diet!"}, {"viet": "Anh đã bỏ mất một sự nghiệp đầy hứa hẹn.", "eng": "You've thrown up a very promising career."}, {"viet": "Anh không thể cứ làm việc mãi mà không nghỉ một chút.", "eng": "You can't go on working without a break."}, {"viet": "Bạn có thể vào đại học, bạn biết không?", "eng": "You can go to college, you know?"}, {"viet": "Anh có thể kiếm được hàng triệu! Tha hồ!", "eng": "You could win millions! The sky's the limit!"}, {"viet": "Anh đã đưa ra nhiều giả định không biện minh được.", "eng": "You have made several unjustified presuppositions."}, {"viet": "Ông sẽ thấy một lối vào xe điện ngầm ở góc phố.", "eng": "You'll find subway entrance on the corner."}, {"viet": "Anh phải hoặc là tuân thủ nguyên tắc hoặc là rời trường.", "eng": "You must either conform to the rules or leave the school."}, {"viet": "Anh cần phải ăn mặc quần áo hiện đại hơn.", "eng": "You need to have a more modern image."}, {"viet": "Anh nên làm việc từ từ, anh đang mệt rồi đấy.", "eng": "You should go easy, you're getting tired."}, {"viet": "Anh đã gạt tôi nghĩ rằng anh đã dự định trả lại tiền cho tôi.", "eng": "You tricked me into thinking you planned to pay me back."}, {"viet": "Anh nên đi khám bác sĩ về chỗ đau đó.", "eng": "You would be well-advised to see the doctor about that pain."}, {"viet": "Sự chỉ dẫn của anh đối với sinh viên cần chính xác hơn.", "eng": "Your instructions to the students need to be more precise."}]