[{"viet": "57.50 bảng Anh tính cả cước phí và phí đóng gói.", "eng": "£ 57.50 including postage and packing."}, {"viet": "Một công việc làm ăn không thể nào phát đạt nếu không có đầu tư.", "eng": "A business cannot thrive without investment."}, {"viet": "Một thành phố bị tàn phá do nội loạn.", "eng": "A city desolated by civil strife."}, {"viet": "Một cái quầy nằm trơ trọi giữa nhà bếp.", "eng": "A counter forming an island in the kitchen."}, {"viet": "Sự trình bày một chương trình nâng cấp đường sá đã được lên kế hoạch.", "eng": "A demonstration of the projected road improvement scheme."}, {"viet": "Một khuôn mặt dính đầy bụi và mồ hôi.", "eng": "A face covered with grime and sweat."}, {"viet": "Bài tập báo động cháy lâu hơn nhiều.", "eng": "A fire drill is much longer."}, {"viet": "Cô gái đứng ở miệng hang ra hiệu cho anh ta vào.", "eng": "A girl standing at the mouth of the cave beckoned him in."}, {"viet": "Một vị khách yêu cầu hóa đơn thanh toán.", "eng": "A guest asks for the bill."}, {"viet": "Một bệnh viện cần được thiết kế với tính cách một công trình xây dựng có chức năng riêng.", "eng": "A hospital should be planned as a functional building."}, {"viet": "Một phong cảnh có những cánh đồng nhỏ bị hàng rào và những dòng suối nhỏ cắt ngang.", "eng": "A landscape of small fields intersected by hedges and streams."}, {"viet": "Một lối hành văn đầy tao nhã và dí dỏm.", "eng": "A literary style full of elegance and wit."}, {"viet": "Một người rất lo lắng về tương lai-cứ bị ám ảnh bởi cảnh thiên đàng và địa ngục sắp hiển hiện trên trái đất.", "eng": "A man hagridden by the future-haunted by visions of an imminent heaven or hell upon earth."}, {"viet": "Một cái hào ngăn cách các thú vật ở sở thú với những người xem.", "eng": "A moat separates the animals in the zoo from the spectators."}, {"viet": "Một mái nhà mới sẽ tốn khoảng 1.000 bảng Anh.", "eng": "A new roof will cost round about £ 1,000."}, {"viet": "Một chương trình truyền thanh về chính trị của Đảng Lao động.", "eng": "A party political broadcast by Labour Party."}, {"viet": "Cây đàn piano bị sứt một miếng khi chúng tôi dọn nhà.", "eng": "A piece was chipped off the piano when we moved house."}, {"viet": "Một con đường mòn cheo leo chạy xuống sườn núi.", "eng": "A precipitous path down the mountainside."}, {"viet": "Một đường sắt nối Hà Nội với Đà Nẵng.", "eng": "A railway connects Hanoi with Danang."}, {"viet": "Một ngôi sao nhạc rốc thực sự được nhiều người hâm mộ.", "eng": "A rock star that is really heavy."}, {"viet": "Một cảm giác ấm áp, chóng mặt, bị hẫng.", "eng": "A sensation of warmth, dizziness, falling."}, {"viet": "Một sự mô tả khéo léo một ông già cô đơn chịu nhiều đắng cay.", "eng": "A skilful portrayal of a lonely and embittered old man."}, {"viet": "Một loại bột đặc biệt để tẩy đồ lông.", "eng": "A special powder for cleaning fur."}, {"viet": "Một phong cách phát biểu dễ nghe.", "eng": "A style of speech-making that is easy to listen to."}, {"viet": "Một thí dụ trong sách vở chỉ dẫn cách chơi trò chơi đó.", "eng": "A textbook example of how the game should be played."}, {"viet": "Một bộ sưu tập quý giá về đồ sứ cổ.", "eng": "A valuable collection of antique porcelain."}, {"viet": "Một tỉnh ở biên giới không có pháp luật.", "eng": "A wild-and-woolly frontier town."}, {"viet": "Theo đồng hồ treo tường đó, chắc hẳn đồng hồ của tôi chạy nhanh.", "eng": "According to that clock, my watch must be fast."}, {"viet": "Theo một đường lối cứng rắn đối với bọn khủng bố.", "eng": "Adopt a hard line towards terrorists."}, {"viet": "Sau khi đoạt chức vô địch hạng nghiệp dư anh ta đã trở thành nhà nghề.", "eng": "After he won the amateur championship he turned professional."}, {"viet": "Sau trận đánh, cả hai phía đều nhận là mình thắng trận.", "eng": "After the battle both sides claimed victory."}, {"viet": "Không khí là một lưu chất chứ không phải là một chất lỏng, trong khi nước có thể vừa là lưu chất vừa là chất lỏng.", "eng": "Air is a fluid but not a liquid, while water is both a fluid and a liquid."}, {"viet": "Mọi ý kiến trước đây của chúng ta hiện nay đang thay đổi và các công việc của chúng ta buộc phải thay đổi một cách triệt để.", "eng": "All our previous ideas are now in the melting-pot and our jobs are bound to change radically."}, {"viet": "Tất cả những khó khăn này làm trở ngại cho sự tiến bộ của anh ta.", "eng": "All these difficulties cramped his progress."}, {"viet": "Liệu tôi có phải suy ra là anh từ chối phải không?", "eng": "Am I to understand that you refuse?"}, {"viet": "Ngày nghỉ hàng năm là một dịp tiêu tốn lớn.", "eng": "An annual holiday is a big expense."}, {"viet": "Một sự kiện phương hại cho mối quan hệ giữa hai nước.", "eng": "An event which has harmed relations between the two countries."}, {"viet": "Một lúc tạm nghỉ 15 phút sau màn thứ hai.", "eng": "An interval of 15 minutes after the second act."}, {"viet": "Một hố ngăn cách giữa hai phía trong cuộc tranh chấp không thể thu hẹp lại được.", "eng": "An unbridgeable gulf between the two sides in the dispute."}, {"viet": "Và khi con nhớ câu chuyện này, con sẽ có lại tất cả những tình cảm này.", "eng": "And when you remember this story, you'll have these feelings all over again."}, {"viet": "Kẻ nào cố gắng cản trở sự phát triển của kỹ thuật mới chỉ là đấu tranh để chuốc lấy thất bại.", "eng": "Anyone who tries to resist the spread of new technology is fighting a losing battle."}, {"viet": "Có vấn đề gì nảy sinh trong biên bản của buổi họp vừa qua không?", "eng": "Are there any matters arising from the minutes of the last meeting?"}, {"viet": "Tuần sau bạn sẽ đi làm chứ?", "eng": "Are you going to work next week?"}, {"viet": "Có những đội quân đã đi dọc theo những thung lũng của nó.", "eng": "Armies have marched along its valley."}, {"viet": "Khi tôi định nói thì anh ngắt lời.", "eng": "As I was about to say when you interrupted me."}, {"viet": "Hãy hỏi ông ta xem tàu đi Luân Đôn khởi hành ở sân ga nào.", "eng": "Ask him which platform the London train leaves from."}, {"viet": "Ngay lúc đó điện thoại reo.", "eng": "At that very moment the phone rang."}, {"viet": "Dẹp tất cả những giới hạn lặt vặt đó đi!", "eng": "Away with all these pretty restrictions!"}, {"viet": "Bị vướng vào những thủ tục quan liêu rắc rối.", "eng": "Be caught up in a morass of bureaucratic procedures."}, {"viet": "Có một sự liên quan nào đó tới vấn đề đang bàn.", "eng": "Bear some relevance to the matter in hand."}, {"viet": "Ben thường là dạng viết tắt của Benjamin.", "eng": "Ben is usually short for Benjamin."}, {"viet": "Thuyền bè neo cả hai bên bờ sông.", "eng": "Boats moored on both sides of the river."}, {"viet": "Nước Anh có một hiến pháp bất thành văn và Hoa Kỳ thì có hiến pháp bằng văn bản.", "eng": "Britain has an unwritten constitution and the United States has a written constitution."}, {"viet": "Nhưng mà làm sao tôi biết được nó bền vững bao lâu?", "eng": "But how do I know now how long it will last?"}, {"viet": "Nhưng điều trở ngại đối với việc chụp ảnh là nó là một thú tiêu khiển tốn kém, phải vậy không?", "eng": "But the trouble with photograph is it's an expensive hobby, isn't it?"}, {"viet": "Theo ước tính của tôi, con đường tắt này sẽ giúp chúng ta rút ngắn được 5 dặm Anh.", "eng": "By my reckoning, this short cut will save us five miles."}, {"viet": "Tôi có thể giúp ích anh trong việc tổ chức chuyến đi không?", "eng": "Can I be of service to you in organizing the trip?"}, {"viet": "Họ có thể tìm một chút bằng chứng nào chống lại tôi không?", "eng": "Can they find a shred of evidence against me?"}, {"viet": "Cô có thể giữ gói hàng giúp tôi không?", "eng": "Can you keep my package for me?"}, {"viet": "Vui lòng chỉ cho tôi xe điện ngầm nào chạy đến nhà hát Quốc Gia?", "eng": "Can you tell me which subway goes to the National Theater?"}, {"viet": "Sự thám hiểm hang động có nghĩa là khám phá những lối đi ở bên dưới những ngọn đồi.", "eng": "Caving means exploring the passages underneath the hills."}, {"viet": "Trẻ con phải tỏ ra lễ phép với thầy cô của mình.", "eng": "Children should show respect for their teachers."}, {"viet": "Những đám bụi bay trong gió.", "eng": "Clouds of dust blowing in the wind."}, {"viet": "Đi đi về về trong giờ cao điểm đòi hỏi tính nhẫn nại.", "eng": "Commuting in the rush-hour requires a phlegmatic temperament."}, {"viet": "Xét về mặt nhỏ bé của chiếc xe ôtô thì bên trong tương đối là rộng.", "eng": "Considering the smallness of the car, it is relatively roomy inside."}, {"viet": "Cô vui lòng lấy cho tôi thức uống?", "eng": "Could you get me something to drink, please?"}, {"viet": "Những người dân quê trong các y phục cổ truyền của họ.", "eng": "Country people in their traditional costumes."}, {"viet": "Hoa thủy tiên và nghệ tây nở hoa vào mùa xuân.", "eng": "Daffodils and crocuses bloom in the spring."}, {"viet": "Dân chủ hóa cơ cấu điều hành của một tổ chức.", "eng": "Democratize the administration of an organization."}, {"viet": "Có điều gì thú vị trong chuyến đi đến đây của cháu không?", "eng": "Did anything interesting happen during your trip here?"}, {"viet": "Anh có ghi chép tại buổi thuyết trình đó không?", "eng": "Did you take notes at the lecture?"}, {"viet": "Được bảo sao thì anh cứ làm như vậy nếu không anh sẽ gặp rắc rối đấy.", "eng": "Do as you're told, otherwise you'll be in trouble."}, {"viet": "Phụ nữ ở Trung Quốc có chơi bóng đá không?", "eng": "Do women in China play football?"}, {"viet": "Có bản đồ địa phương không?", "eng": "Do you have a local map?"}, {"viet": "Bạn có biết người nào đã thực hiện được hầu hết những mơ ước của họ không?", "eng": "Do you know anyone who has realized most of his dreams?"}, {"viet": "Bạn có thường đến các cửa hàng bách hóa không?", "eng": "Do you often go to department stores?"}, {"viet": "Bạn có nghĩ rằng các giá trị đạo đức của người Nhật đang thay đổi một cách cơ bản không?", "eng": "Do you think that the values of Japanese people are changing radically?"}, {"viet": "Theo anh nó trông giống vàng không?", "eng": "Does it look to you like gold?"}, {"viet": "Đừng có coi thường tài năng của cô ấy như vậy.", "eng": "Don't be so dismissive of her talent."}, {"viet": "Đừng quan trọng hóa những chuyện không đâu.", "eng": "Don't get into a fuss about nothing."}, {"viet": "Đừng đỗ trên vạch vôi màu vàng.", "eng": "Don't park on the double yellow lines."}, {"viet": "Anh đừng có cố sức làm mọi thứ cùng một lúc; hãy làm mỗi lúc một chút.", "eng": "Don't try to do everything at once; take it a bit at a time."}, {"viet": "Việc mặc quần áo luôn làm cho cô ta mất nhiều thời gian.", "eng": "Dressing always takes her such a long time."}, {"viet": "Mỗi vé chỉ cho hai người vào dạ hội.", "eng": "Each ticket admits two people to the party."}, {"viet": "Tiếng Anh có nhiều từ vay mượn từ tiếng Pháp.", "eng": "English has many borrowing words from French."}, {"viet": "Mục tiêu kế tiếp của nhà leo núi là đỉnh Everest.", "eng": "Everest is the climber's next objective."}, {"viet": "Xin lỗi cho hỏi, bánh mì tròn để đâu ạ?", "eng": "Excuse me, but where are the rolls?"}, {"viet": "Tự giải thoát khỏi một cuộc tình bất hạnh.", "eng": "Extricate oneself from an unhappy love affair."}, {"viet": "Cảm thấy tin tưởng rằng mình sẽ thành công.", "eng": "Feel confident that one will succeed."}, {"viet": "Bị phạt 100 bảng Anh vì lái xe ẩu.", "eng": "Fined £ 100 for reckless driving."}, {"viet": "Những bình hoa đặt thành hàng trên ngưỡng cửa sổ.", "eng": "Flowerpots ranged in rows on the window-still."}, {"viet": "Đã mấy năm nay dân chúng ca thán về chính phủ.", "eng": "For some years the people had been murmuring against the government."}, {"viet": "Thịt lợn muối rán kêu xèo xèo trong chảo.", "eng": "Fried bacon spitting in the pan."}, {"viet": "Nói chung, chắc tôi sẽ đồng ý với anh thôi.", "eng": "Generally speaking, I'm inclined to agree with you."}, {"viet": "Hãy cho bà ta uống một ít cà-phê đen-nó sẽ giúp bà ta tỉnh táo lại.", "eng": "Give her some black coffee-that'll help to sober her up."}, {"viet": "Khúm núm tới bên ai hỏi xin tiền.", "eng": "Go cap in hand to somebody asking for money."}, {"viet": "Cố tìm mọi cớ để né tránh một công việc chán nản.", "eng": "Grabbing at any excuse to avoid an unpleasant task."}, {"viet": "Ngồi thoải mái bên lò sưởi với một quyển sách hay.", "eng": "Happily ensconced by the fire with a good book."}, {"viet": "Ông có bằng chứng nào để hậu thuẫn cho lời tuyên bố này không?", "eng": "Have you any evidence to support this statement?"}, {"viet": "Anh đã tìm thấy một người mua nhà của anh chưa?", "eng": "Have you found a buyer for your house?"}, {"viet": "Vì đã ký hợp đồng với họ để sửa chữa, bây giờ chúng tôi không thể rút ra được.", "eng": "Having contracted with them to do the repairs, we cannot withdraw now."}, {"viet": "Nó rất sợ bị trông như lố bịch trước tất cả bạn bè của nó.", "eng": "He's afraid of looking foolish in front of all his friends."}, {"viet": "Nó vụng về và bừa bãi nhưng lại cứ luôn luôn muốn giúp đỡ.", "eng": "He's clumsy and untidy but then again he's always willing to help."}, {"viet": "Nó mới cuỗm mất cái bật lửa của tôi rồi!", "eng": "He's just waltzed off with my cigarette lighter!"}, {"viet": "Anh ấy là một vận động viên giỏi đến mức dễ dàng tham gia hầu hết các môn thể thao.", "eng": "He's such a good athlete that most sports come naturally to him."}, {"viet": "Anh ta viện cớ ốm như một lý do để vắng mặt.", "eng": "He alleged illness as the reason for his absence."}, {"viet": "Ông ta đã trở thành cố vấn chính của bà ta-người phụ tá của bà ta, nếu anh thích gọi như vậy.", "eng": "He became her senior adviser-her deputy, if you will."}, {"viet": "Anh ấy ra tù hy vọng sẽ bắt đầu một cuộc đời mới với một lý lịch trong sạch.", "eng": "He came out of prison hoping to start life again with a clean sheet."}, {"viet": "Anh ta cố chộp lấy cành cây nhưng không với tới được.", "eng": "He clutched at the branch but he couldn't reach it."}, {"viet": "Anh ta phí mất hàng giờ để xem Tivi.", "eng": "He dawdles the hours away watching television."}, {"viet": "Hắn có thái độ thật quái gở, phải không?", "eng": "He does carry on, doesn't he?"}, {"viet": "Ông ta củng cố được cương vị của mình làm tỉnh trưởng lâu dài.", "eng": "He established himself as governor of the province."}, {"viet": "Hắn thấy rằng khó mà sống được theo đúng những lý tưởng của mình.", "eng": "He finds it hard to live up to his ideals."}, {"viet": "Anh ta kể lại từng chi tiết mọi diễn biến trong buổi tối hôm đó.", "eng": "He gave us a blow-by-blow account of the evening's events."}, {"viet": "Anh ta nhậu nhẹt say sưa ba ngày.", "eng": "He had a three day binge."}, {"viet": "Anh ấy có giọng hát tốt.", "eng": "He has a good singing voice."}, {"viet": "Hắn có nhiều quyền lực và của cải, dầu vậy hắn vẫn bất hạnh.", "eng": "He has great power and wealth, but is still unhappy for all that."}, {"viet": "Nó chẳng xuất bản được cái gì mà tự nhận là nhà văn!", "eng": "He hasn't had anything published and he calls himself a writer!"}, {"viet": "Anh ta là một con người sống quá cách biệt.", "eng": "He is an exceedingly insular man."}, {"viet": "Anh ta thấp hơn bà Cooper mấy năm về thâm niên.", "eng": "He is several years junior to Mrs. Cooper."}, {"viet": "Anh ta luôn luôn tiếp tôi đều đặn những tách cà phê trong khi tôi viết báo cáo.", "eng": "He kept me well supplied with cups of coffee while I wrote the report."}, {"viet": "Anh ta sống một cuộc sống ăn bám bằng cách mượn tiền bạn bè của anh ta.", "eng": "He lives a parasitic existence, borrowing money form his friends."}, {"viet": "Hắn tự làm cho mình trở thành đáng ghét vì quá huênh hoang.", "eng": "He made himself unpopular by being so pushy."}, {"viet": "Nó nói chuyện thân mật về công việc của mình.", "eng": "He nattered on about his work."}, {"viet": "Nó qua kì kiểm tra dễ dàng.", "eng": "He passed the test with ease."}, {"viet": "Một năm sống ở nước ngoài đã có lợi cho nó rất nhiều.", "eng": "He profited greatly from his year abroad."}, {"viet": "Anh ta bấm chuông nhưng không ai ra mở cửa.", "eng": "He rang the bell but no one came to the door."}, {"viet": "Ông ta đè nén những thèm muốn sinh lý tự nhiên của mình được xem như là có tội.", "eng": "He repressed his natural sexual desires as sinful."}, {"viet": "Anh ta đúng là người đa cảm.", "eng": "He's a real softie at heart."}, {"viet": "Hôm nay cậu bé lên năm tuổi.", "eng": "He's five years old today."}, {"viet": "Hắn không hoàn toàn sáng suốt.", "eng": "He's not quite compos mentis."}, {"viet": "Anh ta đang viết tiểu sử của Newton.", "eng": "He's writing a life of Newton."}, {"viet": "Anh ta khảo sát hết các từ điển để tìm từ ấy.", "eng": "He searches through dictionaries for the word."}, {"viet": "Anh ta đã tỏ ra rất dè dặt trong việc đưa đơn li hôn.", "eng": "He showed exercised considerable restraint in suing for a divorce."}, {"viet": "Ông ta sống những năm tàn của mình ở nông thôn.", "eng": "He spent his declining years in the country."}, {"viet": "Nó đứng ngắm bức hoạ mấy phút.", "eng": "He stood considering the painting for some minutes."}, {"viet": "Ông ta quay ngoắt lại để đối diện với những kẻ tố cáo mình.", "eng": "He swung round to confront his accusers."}, {"viet": "Anh ấy nhắc chúng tôi coi chừng ( bọn móc túi, chó, đường đóng băng ).", "eng": "He told us to beware ( of pick pockets, the dog, icy roads )."}, {"viet": "Hắn ta cố thuyết phục tôi nhận hối lộ, tôi hi vọng mình chẳng bao giờ hạ thấp mình như thế.", "eng": "He tried to make me accept a bride, I hope I would stoop so low."}, {"viet": "Ông ta đặt giá ngôi nhà cho tôi là 80000 pao.", "eng": "He valued the house for me at 80000 pounds."}, {"viet": "Anh ấy đang hành động với những động cơ tốt đẹp nhất.", "eng": "He was acting from the best of motives."}, {"viet": "Anh ta đã bị tuyết lở vùi và cần phải được moi ra.", "eng": "He was buried by an avalanche and had to be dug out."}, {"viet": "Anh ta đau khổ vì nhiều nỗi thất vọng.", "eng": "He was embittered by his many disappointments."}, {"viet": "Ông ta đã bị lôi cuốn vào một cuộc tranh luận sôi nổi.", "eng": "He was involved in a heated argument."}, {"viet": "Anh ta bề ngoài thì bình tĩnh nhưng trong lòng lại đang sôi sục.", "eng": "He was outwardly calm, but raging within."}, {"viet": "Anh ta quá khốn khổ đến nỗi anh ta đã thực sự nghĩ tới chuyện tự tử.", "eng": "He was so miserable that he seriously thought about ended it all."}, {"viet": "Anh ta không được người ta ưa vì anh ta có thói quen xoi mói hàng xóm láng giềng.", "eng": "He was unpopular, as he had the habit of prying on his neighbours."}, {"viet": "Nó lặn để tránh cảnh sát.", "eng": "He went underground to avoid the police."}, {"viet": "Nó làm việc khi nào có hứng thú.", "eng": "He works as the spirit moves him."}, {"viet": "Mưa to và sự khai thác quá độ đã làm cho đất hết màu mỡ.", "eng": "Heavy rain and excessive use have impoverished the soil."}, {"viet": "Bà ta bị đau lưng dữ dội.", "eng": "Her back gives her a lot of pain."}, {"viet": "Những lời kêu cứu của cô ta không nhận được, nhận được đôi chút, ít nhận được, v. v. sự đáp ứng.", "eng": "Her cries for help met with no, some, little, etc response."}, {"viet": "Vẻ mặt cô ta không chút quan tâm.", "eng": "Her face was void of all interest."}, {"viet": "Tim cô ta giật thót lên khi nghe được tin ấy.", "eng": "Her heart jumped when she heard the news."}, {"viet": "Cho đến giờ thì đời sống của cô ta trôi qua thật êm ả.", "eng": "Her life has run smoothly up to now."}, {"viet": "Đức tính vô giá duy nhất của cô ta là sự điềm tĩnh của cô ta.", "eng": "Her one priceless asset is her unflappability."}, {"viet": "Những nhận xét của cô ta gần như làm mọi người bối rối.", "eng": "Her remarks were embarrassingly close to home."}, {"viet": "Kiểu áo của bà ta thật là kỳ cục.", "eng": "Her style of dress is definitely off-beat."}, {"viet": "Đây là bản tóm tắt những tin chính trong ngày.", "eng": "Here's a roundup of the day's main new stories."}, {"viet": "Những bộ hạ thuê mướn của một tay trùm găng tơ.", "eng": "Hired underlings of a gangster boss."}, {"viet": "Cách cư xử của hắn làm cô ta ngạc nhiên và bối rối.", "eng": "His behaviour amazed and confounded her."}, {"viet": "Các cộng sự của anh ta ghét cay ghét đắng anh ta.", "eng": "His colleagues regarded him with intense dislike."}, {"viet": "Chị hắn vốn là người dìu dắt, cố vấn và bạn của hắn.", "eng": "His elder sister had been his guide, counsellor and friend."}, {"viet": "Diễn xuất của anh ta trong phim không được như mong đợi.", "eng": "His film performance didn't come up to expectations."}, {"viet": "Tính hài hước của anh ta đem lại sự bớt căng thẳng được mọi người hoan nghênh.", "eng": "His humour provided some welcome light relief."}, {"viet": "Cuộc đời anh ta là một chuỗi dài hội họp.", "eng": "His life is one long round of meetings."}, {"viet": "Trừ cái mũi ra thì anh ấy rất đẹp trai.", "eng": "His nose apart he's quite good-looking."}, {"viet": "Sự có mặt của anh là một gánh nặng cho cả nhóm.", "eng": "His presence is a dead weight on the group."}, {"viet": "Anh ta hét to đến nỗi người chết cũng phải giật mình sống lại.", "eng": "His shouting was fit to wake the dead."}, {"viet": "Cú điện thoại của anh ấy đã ngắt dòng suy nghĩ của tôi.", "eng": "His telephone call interrupted my train of thought."}, {"viet": "Tác phẩm của anh ta có thể so sánh với những tác phẩm hay nhất.", "eng": "His work is comparable with the very best."}, {"viet": "Tính chân thật là đặc tính nổi bật nhất của anh ta.", "eng": "Honesty is his most salient characteristic."}, {"viet": "Bực mình quá! Tôi lại để cái ví ở nhà!", "eng": "How annoying! I have left my wallet at home!"}, {"viet": "Làm sao mà anh ta bị gãy chân như thế?", "eng": "How did he come to break his leg?"}, {"viet": "Bạn thường tổ chức ăn mừng đêm Giao thừa ở nước bạn như thế nào?", "eng": "How do you usually celebrate New Year's Eve in your country?"}, {"viet": "Ở nước bạn, trung bình một tuần làm việc bao nhiêu tiếng?", "eng": "How long is the average work week in your home country?"}, {"viet": "Bao nhiêu người có mặt trong cuộc họp?", "eng": "How many people were present at the meeting?"}, {"viet": "Vé khứ hồi đi Boston là bao nhiêu?", "eng": "How much is the round-trip ticket to Boston?"}, {"viet": "Ông muốn thanh toán bằng cách nào ạ?", "eng": "How would you like to make the payment?"}, {"viet": "Thôi nhé tôi cúp máy, có người ở cửa.", "eng": "I'd better ring off now, there's someone at the door."}, {"viet": "Tôi thích đi nghỉ mát nếu tiền của chúng tôi đủ trang trải.", "eng": "I'd love a holiday if our money will stretch that far."}, {"viet": "Tối nay tôi sẽ gọi điện cho bạn để chúng ta có thể quyết định gặp nhau lúc mấy giờ và ở đâu.", "eng": "I'll give you a ring this evening, so that we can decide what time to meet and where."}, {"viet": "Tôi sẽ cử thợ đến sửa chúng ngay.", "eng": "I'll send a repairman to repair them immediately."}, {"viet": "Tôi e rằng John là một trong số những người thất bại trong cuộc đời.", "eng": "I'm afraid John is one of life's also-ran."}, {"viet": "Tôi sẽ cho đi tất cả những quần áo đã quá nhỏ đối với tất cả các con tôi.", "eng": "I'm giving away all the clothes that are too small for the children."}, {"viet": "Tôi làm tạm ở công việc này, tôi hy vọng trở thành một diễn viên.", "eng": "I'm just marking time in this job, I'm hoping to become an actor."}, {"viet": "Tôi chỉ lo thái độ của anh ta đối với công việc thôi, khả năng ( làm thiết kế ) thì không có gì đáng lo ngại.", "eng": "I'm only worried about his attitude to the Job, his competence ( as a designer ) is not a question."}, {"viet": "Tôi rất ái ngại được tin anh ốm.", "eng": "I'm sorry to learn about your illness."}, {"viet": "Tôi không thể tới vì tôi có một cuộc hẹn khác.", "eng": "I'm unable to come because I have another engagement."}, {"viet": "Suốt ngày tôi chạy ngược chạy xuôi, kiệt sức rồi.", "eng": "I've been on the run all day and I'm exhausted."}, {"viet": "Tôi có mấy đoạn thoại rất dài trong Hồi 2 cần học thuộc.", "eng": "I've got some very long speeches to learn in Act 2."}, {"viet": "Tôi chưa từng thấy hai người nào gắn bó ( với nhau ) như vậy.", "eng": "I've never seen two people so attached ( to each other )."}, {"viet": "Tôi thừa nhận là trách nhiệm về việc này, công bằng mà nói, thuộc về tôi.", "eng": "I accept that the responsibility for this lies squarely at my door."}, {"viet": "Tôi càng ngày càng trở nên bực bội vì cách xử sự ích kỷ của anh ta.", "eng": "I am becoming more and more irritated by his selfish behaviour."}, {"viet": "Tôi đang chờ nghe kết quả.", "eng": "I am waiting to hear the result."}, {"viet": "Tôi tin là ông có thể quan tâm đến chúng.", "eng": "I believe they might be of interest to you."}, {"viet": "Tôi không thể đến vì hàng loạt lý do.", "eng": "I can't come, for a whole host of reasons."}, {"viet": "Tôi không thể thu gom được đủ tiền để làm việc đó.", "eng": "I can't scrape together enough cake to do the job."}, {"viet": "Tôi không bao giờ có thể đền đáp lại những điều tốt cô ấy dành cho tôi.", "eng": "I can never repay her many kindness to me."}, {"viet": "Tôi không sao hiểu được cô ấy muốn gì.", "eng": "I can't make out what she wants."}, {"viet": "Tôi có thể nghe thấy ông ta đi tới đi lui trong phòng ngủ suốt đêm.", "eng": "I could hear him prowling around in his bedroom all night."}, {"viet": "Tôi muốn được gọi dậy lúc 6 giờ.", "eng": "I'd like a wake-up call at 6 a. m."}, {"viet": "Tôi không đuổi cô ta, tôi bảo với cô ấy cô ấy có thể đi nếu muốn.", "eng": "I didn't fire her, I told her she could ankle if she wanted."}, {"viet": "Tôi chẳng cần để ý chút nào đến tình cảm của họ.", "eng": "I don't care a jot for their feelings."}, {"viet": "Tôi không thích làm việc với cái dạ dày trống rỗng.", "eng": "I don't like going to work on the empty stomach."}, {"viet": "Tôi không nghĩ rằng anh đã nhận thức hết tính nghiêm trọng của tình hình.", "eng": "I don't think you realize the gravity of the situation."}, {"viet": "Tôi không hiểu bài toán này.", "eng": "I don't get this math problem."}, {"viet": "Tôi ăn ít hơn trước nhiều.", "eng": "I eat lots less than I used to."}, {"viet": "Tôi cảm thấy không đủ khả năng để nói về đề tài đó.", "eng": "I feel unqualified to speak on the subject."}, {"viet": "Tôi quên và đã dùng số sai.", "eng": "I forget it and used the wrong number."}, {"viet": "Chiều hôm nay tôi nướng nhiều bánh.", "eng": "I got a lot of baking done this afternoon."}, {"viet": "Tôi đã có một cuộc cãi nhau ác liệt với ông chủ của tôi hôm nay.", "eng": "I had a stand-up row with my boss today."}, {"viet": "Tôi đã không nhận ra tầm quan trọng của vấn đề.", "eng": "I hadn't realized the magnitude of the problem."}, {"viet": "Tôi đi đến chỗ tin rằng chính sách kinh tế của chính phủ đã lạc hướng.", "eng": "I have come to believe that the Government's economic policy is misguided."}, {"viet": "Tôi hiếm khi thấy một mặt trời lặn đẹp như vậy.", "eng": "I have rarely seen such a beautiful sunset."}, {"viet": "Suốt buổi sáng, tôi chưa có miếng gì cả.", "eng": "I haven't had a bite all morning."}, {"viet": "Tôi nghe tin anh ấy qua đời với lòng thương tiếc sâu sắc.", "eng": "I heard of his death with deep regret."}, {"viet": "Tôi mong là chúng ta không bị trễ.", "eng": "I hope we're not late."}, {"viet": "Tớ muốn cậu biết, nói một cách thẳng thắn là tớ không thể chịu được cái thằng cha đó và tớ không muốn mất thời giờ với nó.", "eng": "I just want you to know, outfront, that I can't stand the guy, and I don't like spending time with him."}, {"viet": "Hàng ngày, tôi để cháu bé cho mẹ tôi chăm sóc.", "eng": "I leave the baby with my mother every day."}, {"viet": "Tôi sống ở giữa London và Guildford.", "eng": "I live halfway between London and Guildford."}, {"viet": "Tôi sẽ trả 1.500 bảng Anh nhưng không cao hơn nữa đâu.", "eng": "I'll go to £ 1,500 but no higher."}, {"viet": "Tôi sẽ tranh thủ gặp anh sau bữa ăn trưa.", "eng": "I'll try and fit you in after lunch."}, {"viet": "Tôi hết sức hối tiếc vì sự chậm trễ.", "eng": "I'm extremely sorry for the delay."}, {"viet": "Tôi đang không được khoẻ lắm.", "eng": "I'm not feeling very well."}, {"viet": "Tôi đang gạo kỹ môn toán của mình.", "eng": "I'm swotting up my maths."}, {"viet": "Tôi đã đọc sai các chỉ dẫn những gì các chỉ dẫn nêu ra.", "eng": "I misread the instructions what the instructions said."}, {"viet": "Tôi cần một cái búa và một ít đinh để sửa cái ghế này.", "eng": "I need a hammer and some nails to mend this chair."}, {"viet": "Tôi huých nàng và chỉ người đàn ông bên kia đường.", "eng": "I nudged her and pointed to the man across the street."}, {"viet": "Tôi thích một bãi biển có cát hơn là bãi biển đầy sỏi.", "eng": "I prefer a sandy beach to a shingly one."}, {"viet": "Tôi không thể nào tách mình khỏi đây được.", "eng": "I really can't tear myself away from here."}, {"viet": "Tôi nhớ những ngày ông thường mở cửa xe cho tôi vào.", "eng": "I remember the days when you used to open the car door for me."}, {"viet": "Tôi đã làm cháy xém chiếc áo sơ mi của tôi lúc đang là nó.", "eng": "I scorched my shirt when I was ironing it."}, {"viet": "Tôi cần phải giữ những bức ảnh cũ này-có thể chúng còn có giá trị.", "eng": "I should hang on to those old photographs-they may be valuable."}, {"viet": "Tôi vẫn còn nhăn mặt khi nhớ lại những điều ngớ ngẩn mà mình đã làm.", "eng": "I still wince at the memory of the stupid things I did."}, {"viet": "Tôi nghĩ quạt lò làm quá khô thức ăn.", "eng": "I think fan assisted ovens dry out the food too much."}, {"viet": "Tôi nghĩ hệ thống giáo dục của chúng tôi nên đưa ra nhiều giờ học mĩ thuật và âm nhạc hơn.", "eng": "I think our education system should offer more art and music classes."}, {"viet": "Tôi nghĩ tôi có thể được thuyên chuyển đi nhưng như thế này tôi sẽ phải tìm việc làm mới.", "eng": "I thought I may be transferred but as it is I shall have to look for a new job."}, {"viet": "Tôi đã cố khuyên ngăn cô ấy ( không lấy chồng ).", "eng": "I tried to dissuade her ( from getting married )."}, {"viet": "Anh ta khò khè nói Tôi bị đau cổ họng.", "eng": "I've got on sore throat he wheezed."}, {"viet": "Tôi muốn nới rộng sân cỏ ra.", "eng": "I want to enlarge the lawn."}, {"viet": "Tôi rất phiền lòng khi thấy có ai đã dùng cái bàn chải răng của tôi.", "eng": "I was aggrieved to find that someone had used my toothbrush."}, {"viet": "Tôi bị xỉ vả vì đến muộn.", "eng": "I was hauled over the coals for being late."}, {"viet": "Tôi đã bàng hoàng khi hay tin anh ta chết.", "eng": "I was shocked at the news of his death."}, {"viet": "Tôi lo lắng chuyện riêng của tôi, không phải của bạn.", "eng": "I was worried on my own account, not yours."}, {"viet": "Ước gì tôi có thể giải quyết được, nhưng chúng ta không thể làm được gì ngoài việc chờ đợi.", "eng": "I wish I could, but we can do nothing but wait."}, {"viet": "Không biết vết bẩn có hết hay không.", "eng": "I wonder if the stain will come out."}, {"viet": "Tôi cần một giường phụ cho con tôi.", "eng": "I would like an extra bed for my child."}, {"viet": "Tôi sẽ làm việc tốt hơn nếu tôi có được một chút yên tĩnh.", "eng": "I would work better if I had a bit of peace and quiet."}, {"viet": "Nếu bất cứ ai đó nghĩ rằng mình có thể làm việc này tốt hơn, xin cứ tự nhiên thử!", "eng": "If anyone thinks he can do this job any better, he's welcome to try!"}, {"viet": "Nếu tôi là đàn ông có lẽ họ đã cho tôi làm công việc đó.", "eng": "If I was a man they would have given me the job."}, {"viet": "Nếu các đề nghị rõ ràng là đúng đắn, tại sao anh lại phản đối?''Đó là một câu hỏi thẳng thắn?'.", "eng": "If the proposals are obviously sensible, why do you oppose them?''That's a fair question?'."}, {"viet": "Nếu con ngoan mẹ sẽ đọc cho mấy vần thơ mẹ ngỗng trước khi con đi ngủ.", "eng": "If you're good I'll read you some Mother Goose before you go to bed."}, {"viet": "Nếu bạn không đầu tư vào những cổ phần này, tức là bạn từ bỏ một dịp may đấy.", "eng": "If you don't invest in these shares, you're saying no to a fortune."}, {"viet": "Nếu ông cần một tài xế, thì tôi đúng là người ông đang tìm.", "eng": "If you need a driver, I'm your man."}, {"viet": "Nếu bạn giàu có, bạn sẽ mua gì?", "eng": "If you were rich, what would you buy?"}, {"viet": "Ở Hoa Kỳ, ý tưởng về một thánh trở thánh ý tưởng về một người đàn ông mập mạp, vui tính, mặc đồ đỏ, sống ở Bắc cực và cưỡi xe trượt tuyết có nai kéo.", "eng": "In America the idea of a saint changed to the idea of a jolly, fat man dressed in red who lives at the North Pole and rides in sleigh drawn by reindeer."}, {"viet": "Nói chung tôi thích những người tôi đang làm việc.", "eng": "In general, I like the people I work with."}, {"viet": "Về chính trị, nước Anh thích sự tiến triển hơn là cách mạng.", "eng": "In politics Britain has preferred evolution to revolution."}, {"viet": "Vào năm thứ tư của triều đại sa-lô-môn xứ Is-ra-en cũng là một niên đại của Kinh thánh.", "eng": "In the fourth year of Solomon's reign over Israel is a Bible date, too."}, {"viet": "Ba tiếng nữa chúng ta sẽ đến Hawaii.", "eng": "In three hours we will be in Hawaii."}, {"viet": "Thay vì nói Peter went to school chúng ta có thể dùng đại từ và nói He went to school.", "eng": "Instead of saying Peter went to school we can use a pronoun and say He went to school."}, {"viet": "Có thể chứng minh sự sống trên Hoả Tinh không?", "eng": "Is life on the planet mars capable of proof?"}, {"viet": "Trước khi rời đây, còn việc gì tôi có thể làm giúp ông bà không ạ?", "eng": "Is there anything I can do for you before I leave?"}, {"viet": "Kéo chuông đánh thức tôi dậy vào lúc ba giờ sáng thật là quá đáng.", "eng": "It's a bit much ringing me up at three o'clock in the morning."}, {"viet": "Đó là một ý tưởng hay nhưng đứng về mặt tài chính thì không được.", "eng": "It's an interesting idea, but from a dollars-and-cents point of view it just won't work."}, {"viet": "Trong phòng này nóng quá, hãy mở cửa sổ ra.", "eng": "It's far too hot in this room, open the windows."}, {"viet": "Tôi tin chắc rằng tính tự mãn là nguồn gốc rắc rối của chúng ta.", "eng": "It's my conviction that complacency is at the root of our troubles."}, {"viet": "Cậu cư xử như thế chỉ tự làm mất giá trị.", "eng": "It's only cheapening yourself to behave like that."}, {"viet": "Đã đến lúc cần phải có thái độ kiên quyết với bọn côn đồ bóng đá.", "eng": "It's time to get tough with football hooligans."}, {"viet": "Cần thiết phải chuyển những dự án không thành công sang những chương trình có thể tiến triển.", "eng": "It becomes necessary to cannibalize unsuccessful project to fund those which can proceed."}, {"viet": "Đây là một lập luận đáng ngờ rằng các viên chức cao cấp có tuân theo luật pháp hay không.", "eng": "It is a dubious argument that high officials are not amenable to the law."}, {"viet": "Phận sự của tất cả những người sử dụng thiết bị này là phải tự mình làm quen với những thủ tục an toàn.", "eng": "It is incumbent upon all users of this equipment to familiarize themselves with the safety procedure."}, {"viet": "Vào lúc này thật khó tiên đoán tương lai của công ty.", "eng": "It is very difficult at this juncture to predict the company's future."}, {"viet": "Trời mưa, còn ngoài ra ngày nghỉ rất tốt.", "eng": "It rained, but otherwise the holiday was good."}, {"viet": "Có lẽ đó là cá ở đảo Hawaii.", "eng": "It's probably a Hawaiian fish."}, {"viet": "Hình như có ai đó đang gọi mở cửa.", "eng": "It sounds like someone is at the door."}, {"viet": "Được gặp Nữ hoàng thật là một việc xúc động.", "eng": "It was a real thrill to meet the Queen."}, {"viet": "Thật không tài nào hiểu được cách vận hành của bộ máy quan liêu khổng lồ như thế.", "eng": "It was in impossible to understand the workings of such a huge bureaucracy."}, {"viet": "Thật sự đó là một cú sốc nặng nề đối với tôi, vì chị ấy luôn luôn rất khỏe mạnh như thế.", "eng": "It was truly a great shock to me, for she was always so very healthy."}, {"viet": "Phải rời khỏi London đối với bà ta sẽ là sự mất mát lớn nhất có thể hình dung được.", "eng": "It would be the greatest imaginable privation for her to have to leave London."}, {"viet": "Thật ra Jim đã không cần phải cố gắng hết sức mình trong kỳ thi này.", "eng": "Jim didn't really have to extend himself in the examination."}, {"viet": "Vì các anh không nên họ cũng không.", "eng": "Just as you would not, so neither would they."}, {"viet": "Những khoản tiền lớn được đền bù cho gia đình về những thiệt hại của họ.", "eng": "Large sums paid to the family in expiation of the wrongs done to them."}, {"viet": "Cho phép tôi giới thiệu ông ấy với ông, thưa ông Lương.", "eng": "Let me introduce him to you, Mr. Liang."}, {"viet": "Nói nghe này anh có danh thiếp không?", "eng": "Look, have you got a card?"}, {"viet": "Nhiều người trong đám tang đeo băng tay đen.", "eng": "Many people at the funeral were wearing black armbands."}, {"viet": "Mary đã đi đoàn tụ với gia đình ở Úc.", "eng": "Mary has just joined her family in Australia."}, {"viet": "Xin cho tôi nói chuyện với John Jones ạ?", "eng": "May I speak to John Jones?"}, {"viet": "Tôi cho là hơn 100 mét.", "eng": "More than 100 meters, I suppose."}, {"viet": "Ông Learner không thể nhìn thấy khi con ngồi trước mặt.", "eng": "Mr. Learner can't see with you in front."}, {"viet": "Mới đây đôi ủng của tôi đã bị hỏng nặng-tôi cần một đôi mới.", "eng": "My boots have taken quite a punishing recently-I need a new pair."}, {"viet": "Cha tôi không bao giờ bằng lòng với cuộc hôn nhân của chúng tôi.", "eng": "My father will never give his consent to our marriage."}, {"viet": "Mẹ tôi thực sự phấn khởi khi tôi nói với mẹ rằng tôi sắp cưới vợ.", "eng": "My mother really flipped when I told her I was getting married."}, {"viet": "Có lẽ móng chân của anh quá dài.", "eng": "My toe nails are probably too long."}, {"viet": "Khách sạn mới có thể chứa được 3000 khách du lịch.", "eng": "New hotel can accommodate 3000 tourists."}, {"viet": "Không, tôi thật sự không nhớ mình đã ở đâu vào lúc đó.", "eng": "No, I really don't remember where I was at that time."}, {"viet": "Không được phép gạ gẫm khách trong ngôi nhà này.", "eng": "No soliciting allowed in this building."}, {"viet": "Đến bây giờ con đã trưởng thành, con phải học lấy cách đứng vững trên đôi chân của mình.", "eng": "Now that you're growing up you must learn to stand on your own two feet."}, {"viet": "Ồ, tôi không biết nữa, nhưng tôi có thể cố gắng.", "eng": "Oh, I don't know about that, but I could try."}, {"viet": "Những phụ nữ lớn tuổi có cách cư xử lịch thiệp, lỗi thời.", "eng": "Old ladies with elegant, rococo manners."}, {"viet": "Người ta có thể tự chúc mừng mình vì những thắng lợi của mình.", "eng": "One can congratulate oneself on one's victories."}, {"viet": "Một sinh viên dám cả gan tranh luận với giáo sư.", "eng": "One student made so bold as to argue with the professor."}, {"viet": "Con gái của chúng tôi gửi lời cầu cứu xin thêm tiền.", "eng": "Our daughter sent us an SOS for some more money."}, {"viet": "Mục tiêu chính của chúng tôi là làm vừa lòng khách hàng.", "eng": "Our main aim is to please the customers."}, {"viet": "Đội bóng chúng tôi đủ khả năng vào bán kết.", "eng": "Our team has qualified for the semi-final."}, {"viet": "Nghị viện đã bỏ phiếu thông qua dự luật mà không có tranh cãi.", "eng": "Parliament voted the bill through without a debate."}, {"viet": "Tối nay dường như mọi người uống quá nhiều rồi, nhưng tôi không kể những bạn đang có mặt ở đây đâu.", "eng": "People seem to have drunk far too much tonight, present company expected of course."}, {"viet": "Cho anh xem bóng đá đi em.", "eng": "Please let me watch the football game."}, {"viet": "Quán rượu được cho là nơi hội họp ưa thích của người Anh, ở đó họ có thể tụ tập với vài người bạn để uống một panh bia và bàn chuyện bóng đá, hoặc đua ngựa, hoặc chuyện kinh doanh, và đôi khi chơi game.", "eng": "Pubs are supposed to be the Englishman's favorite meeting place, where he can get together with a few friends over a pint of beer and talk about football, or horse racing, or business, and sometimes play games."}, {"viet": "Các nhà khoa học đang nghiên cứu các bức ảnh chụp sao Hoả để tìm những dấu hiệu của sự sống.", "eng": "Scientists are studying the photographs of Mars for signs of life."}, {"viet": "Tôi nên dùng dầu hay bơ để chiên hành?", "eng": "Shall I use oil or butter for frying the onions?"}, {"viet": "Cô ta quyết tâm theo đuổi nghề xuất bản.", "eng": "She's absolutely set on publishing as a career."}, {"viet": "Cô ta đã đính hôn với Peter nhưng lại hay đi chơi với những anh chàng khác.", "eng": "She's engaged to Peter but she often goes out with other men."}, {"viet": "Chị ấy chuyển đi nơi khác, đó là một tổn thất đối với công ti của chúng tôi.", "eng": "She's moved to another it's a great loss to our firm."}, {"viet": "Cô ta là cô bé nổi bật nhất trong nhóm.", "eng": "She's the dominant child in the group."}, {"viet": "Cô ấy luôn luôn học hành thật chăm chỉ trước kỳ nghỉ hè.", "eng": "She always goes into overdrive before the holidays."}, {"viet": "Cô ấy quay lại để lấy chiếc hộp cô ấy để quên.", "eng": "She came back to get the box that she'd left behind."}, {"viet": "Cô ta khó mà nén được sự kích động.", "eng": "She could hardly contain her excitement."}, {"viet": "Cô ta không cho rằng thiếu chiếc xe hơi là một sự mất mát lớn.", "eng": "She didn't find the lack of a car any great privation."}, {"viet": "Cô ấy biểu lộ sức chịu đựng lớn trong cuộc leo núi.", "eng": "She exhibited great powers of endurance during the climb."}, {"viet": "Cô ấy nhặt những quả táo rụng và đựng vào vạt áo.", "eng": "She gathered the fallen apples and carried them in her lap."}, {"viet": "Cô ấy đã dạy học sinh mình vững về môn số học.", "eng": "She grounded her pupils well in arithmetic."}, {"viet": "Chị ấy có một người quét dọn đến hai lần một tuần.", "eng": "She has a cleaning lady who comes in twice a week."}, {"viet": "Cô ấy đã thụ xong bản án, nay cô ta sẽ được thả.", "eng": "She has served her sentence, and will now be released."}, {"viet": "Chị ấy là một người phi thường-tôi tự hào được quen biết chị.", "eng": "She is a remarkable person-I am proud to know her."}, {"viet": "Cô ta hoàn toàn không làm nên trò trống gì với tư cách là giáo viên.", "eng": "She is totally ineffective as a teacher."}, {"viet": "Bà ta ưa một chiếc gối mềm và một tấm đệm cứng.", "eng": "She likes a soft pillow and a hard mattress."}, {"viet": "Cô ta len lỏi qua các xe cộ qua lại để sang bên kia đường.", "eng": "She made her way through the traffic to the other side of the road."}, {"viet": "Bà ta treo giải thưởng cho việc tìm thấy cái vòng của bà bị mất.", "eng": "She offered a reward for the return of her lost bracelet."}, {"viet": "Cô ấy ghi đơn thuốc cho tôi vài viên thuốc ngủ.", "eng": "She prescribes some pills to help me sleep."}, {"viet": "Cô ta đã trách mắng anh ta về việc quên ngày kỉ niệm đám cưới của họ.", "eng": "She reproached him for forgetting their anniversary."}, {"viet": "Cô ta có một gia đình phải nuôi.", "eng": "She's got a family to feed."}, {"viet": "Cô ấy hy sinh sự nghiệp của mình để lấy anh ta.", "eng": "She sacrificed her career to marry him."}, {"viet": "Cô ta gửi một giấy chứng nhận của người chủ cũ của cô ta khi làm đơn xin chân đó.", "eng": "She sent a testimonial from her former employer when applying for the post."}, {"viet": "Thỉnh thoảng cô ta cạo lông ở chân.", "eng": "She sometimes shaves the hair off her legs."}, {"viet": "Cô ta gợi ý điều đó và tôi vui vẻ chấp nhận.", "eng": "She suggested it, and I gladly accepted."}, {"viet": "Ta đã đứng về phía tôi chống lại thầy giáo.", "eng": "She took sides with me against the teacher."}, {"viet": "Cô ta bỏ đi, sau đó quay lại và trở về.", "eng": "She walked away and then turned around and came back."}, {"viet": "Cô ta sôi nổi đầy những thiện cảm.", "eng": "She was animated with good feelings."}, {"viet": "Bà ta bực tức vì sự ngu dốt của anh ta.", "eng": "She was exasperated at his stupidity."}, {"viet": "Cô ta bị hạ điểm vì các câu trả lời của cô quá thiếu sót.", "eng": "She was marked down because her answers were too short."}, {"viet": "Cô ta ngồi ngay bên trái tôi.", "eng": "She was sitting immediately to my left."}, {"viet": "Cô ta sôi nổi, đầy sức khỏe và nhiệt tình.", "eng": "She was vibrant with health and enthusiasm."}, {"viet": "Cô bé cứ nhất định dậy sớm và mở rađiô của cô thật to.", "eng": "She will always insist on getting up early and playing her radio loud."}, {"viet": "Có lẽ cô ta thích hợp với công việc này.", "eng": "She would be good for the job."}, {"viet": "Xúc tuyết để dọn lấy một lối đi.", "eng": "Shovel a path through the snow."}, {"viet": "Vì bây giờ tôi ở Trung Quốc, nên tôi thưởng thức cà phê Trung Quốc.", "eng": "Since I'm in China now, I should taste Chinese coffee."}, {"viet": "Chảy nước dãi trước một đĩa mì ống.", "eng": "Slavering over a plate of spaghetti."}, {"viet": "Cắt góc cái hộp các-tông sữa.", "eng": "Snip the corner off the carton of milk."}, {"viet": "Sự bất lực của xã hội để giải quyết số lượng người già ngày càng tăng.", "eng": "Society's incapacity to deal with the growing numbers of the elderly."}, {"viet": "Một vài con số quan trọng còn thiết trong bản báo cáo này.", "eng": "Some important figures are missing from this report."}, {"viet": "Một số người nghĩ rằng hôn nhân là một cuộc may rủi.", "eng": "Some people think that marriage is lottery."}, {"viet": "Một người nào đó cao to và đẹp trai.", "eng": "Someone who is tall and cool."}, {"viet": "Những giây phút hạnh phúc ngắn ngủi được tiếp nối xen kẽ bằng những nỗi khổ đau.", "eng": "Spasmodic periods of happiness followed by misery."}, {"viet": "Dựng cái thang đứng dựa vào tường.", "eng": "Stand the ladder up against the wall."}, {"viet": "Đừng có quấy rầy bố của con với những câu hỏi nữa!", "eng": "Stop badgering your father with questions!"}, {"viet": "Sự độc đáo nổi bật trong cách dùng phép ẩn dụ của bà ta.", "eng": "Striking originality in her use of metaphor."}, {"viet": "Ngày nay những tội ác như thế sẽ không được dung tha.", "eng": "Such enormity would not be tolerated today."}, {"viet": "Thí dụ như phiếu thuận và phiếu chống bằng nhau.", "eng": "Supposing the number of contents and not contents are equal."}, {"viet": "Uống thuốc bột để trị chứng khó tiêu.", "eng": "Take a powder to cure indigestion."}, {"viet": "Thuế thu được ít, chi phí nhà nước lại cao, kết quả là có một khoản thâm thủng ngân sách.", "eng": "Tax was low and state spending was high, resulting in a budget deficit."}, {"viet": "Mười năm phục vụ trong hải quân.", "eng": "Ten year's service in the navy."}, {"viet": "Thật chết tiệt! Chúng ta hết xăng rồi.", "eng": "That's done it! We've run out of petrol."}, {"viet": "Thằng nhóc đó xem ra không chừa được thói tinh nghịch.", "eng": "That child seems incapable of keeping out of mischief."}, {"viet": "Đó cũng là loại tôi đang dùng đấy.", "eng": "That is the type I use, too."}, {"viet": "Chú chó con này là một con vật hết sức quấy phá.", "eng": "That puppy is an absolute terror."}, {"viet": "Giáo viên đó quá lỏng lẻo đối với lớp của mình, thảo nào chúng vô kỉ luật như vậy.", "eng": "That teacher's too lax with his class, no wonder they're so undisciplined."}, {"viet": "Vấn đề phá thai là một thứ thuốc nổ chính trị.", "eng": "The abortion issue is political dynamite."}, {"viet": "Diễn viên tuôn ra một tràng những từ chửi tục trong cuộc phỏng vấn.", "eng": "The actor uttered a string of four-letter words during the interview."}, {"viet": "Không thể nào chấp nhận đòi hỏi của anh.", "eng": "The allowance of your claim is not possible."}, {"viet": "Cái thành công bề ngoài của cuộc hôn nhân của họ.", "eng": "The apparent success of their marriage."}, {"viet": "Tài làm ra vẻ tự tin trong các cuộc phỏng vấn.", "eng": "The art of appearing confident at interviews."}, {"viet": "Tác giả quyết định giấu tên.", "eng": "The author chooses to remain anonymous."}, {"viet": "Thời tiết xấu là tương đối phổ biến.", "eng": "The bad weather has been fairly general."}, {"viet": "Nhân viên quán rượu giới thiệu rượu Branđi với khách.", "eng": "The barman recommends brandy to guests."}, {"viet": "Những lợi ích của y học hiện đại, khoa học, giáo dục cao đẳng.", "eng": "The benefits of modern medicine, science, higher education."}, {"viet": "Những kẻ tống tiền đã lấy của anh ta đến đồng xu cuối cùng.", "eng": "The blackmailers bled him for every penny he had."}, {"viet": "Quyển sách là một bức tranh miêu tả đầy sức hấp dẫn đời sống tại cung đình của vua Henry VIII.", "eng": "The book contains a fascinating portrait of life at the court of Henry VIII."}, {"viet": "Người ném bóng đó đã đôi lần ném bóng xuất sắc.", "eng": "The bowler let go a couple of scorchers."}, {"viet": "Những con sóng vỗ vào bờ biển phủ đầy bọt sóng.", "eng": "The breaking waves left the beach covered with foam."}, {"viet": "Cái chuông báo trộm reo do nhầm lẫn.", "eng": "The burglar alarm was activated by mistake."}, {"viet": "Các tế bào ung thư có thể xâm chiếm các bộ phận khác của cơ thể.", "eng": "The cancer cells may invade other parts of the body."}, {"viet": "Chiếc xe lao vào một nhóm người xem.", "eng": "The car plowed into a group of spectators."}, {"viet": "Người thủ quỹ đã đóng ngăn kéo để tiền và khoá lại.", "eng": "The cashier shut the till and locked it."}, {"viet": "Vị chủ tịch đang thúc một sự thay đổi thủ tục.", "eng": "The chairman is pressing for a change in the procedure."}, {"viet": "Tiếng khóc nức nở của đứa bé đó bớt dần.", "eng": "The child's sobs gradually died down."}, {"viet": "Đứa trẻ đó không nín đi cho tôi nhờ.", "eng": "The child wouldn't quiet down for me."}, {"viet": "Lũ trẻ bỗng giỏng tai lên khi nghe nói đến từ'kem'.", "eng": "The children pricked up their ears when they heard the word'ice-cream'."}, {"viet": "Ban đồng ca hát những lời a-men thật tuyệt.", "eng": "The choir sang the amens beautifully."}, {"viet": "Các nhân viên khách sạn muốn dọn dẹp phòng, nhưng người khách trọ đang không được khoẻ lắm.", "eng": "The clerks want to clean the room and the guest isn't feeling very well."}, {"viet": "Cà phê đổ hết lên quần tôi.", "eng": "The coffee went all over my trousers."}, {"viet": "Hội đồng do ba vị bộ trưởng đứng đầu.", "eng": "The committee is headed by a trio of ministers."}, {"viet": "Công ty chỉ sa thải nhân viên trong những trường hợp có hành vi bậy bạ trắng trợn.", "eng": "The company only dismisses its employees in cases of gross misconduct."}, {"viet": "Hệ quả của những biện pháp ấy sẽ là sự biện minh tốt đẹp nhất cho hành vi của tôi.", "eng": "The consequence of those measures will be the best apology for my conduct."}, {"viet": "Con số thiệt hại được đánh giá một cách khác nhau từ 5000 pao đến 25000 pao.", "eng": "The cost of the damage has been variously estimated at between 5000 and 25.000."}, {"viet": "Lớp học này đã thu hút học sinh từ khắp nơi trong nước.", "eng": "The course draws students from all over the country."}, {"viet": "Những người phê bình lợi dụng sơ hở của tôi và nói rằng tôi dốt nát.", "eng": "The critics seized on my mistake and said I was ignorant."}, {"viet": "Màn được kéo lên cho thấy một phòng khách ở ngoại ô.", "eng": "The curtain goes up on a suburban living-room."}, {"viet": "Tác động tai hại của nạn quan liêu đang làm chậm bước tiến chúng ta.", "eng": "The dead hand of bureaucracy is slowing our progress."}, {"viet": "Những người biểu tình, đốt hình nộm tổng thống.", "eng": "The demonstrators burned a crude effigy of the president."}, {"viet": "Sự khác biệt giữa cái thiện và cái ác.", "eng": "The difference between good and evil."}, {"viet": "Đổi cách suy nghĩ của mình.", "eng": "The diversion of one's thoughts."}, {"viet": "Các bác sĩ tuyên bố là ông ta không còn ở trong tình trạng nguy kịch nữa.", "eng": "The doctors pronounced him to be no longer in danger."}, {"viet": "Con chó cọ cái đầu nhè nhẹ vào tôi ở trên trường kỷ.", "eng": "The dogs nuzzled up against me on the sofa."}, {"viet": "Thuốc làm mất tác dụng của thuốc độc.", "eng": "The drug counteracts the effects of the poison."}, {"viet": "Hội viên thực sự của một hiệp hội.", "eng": "The effective membership of a society."}, {"viet": "Chiếc máy đã bất thần rung mạnh.", "eng": "The engine gave a sudden judder."}, {"viet": "Ánh nắng chiều chiếu xiên qua cửa sổ.", "eng": "The evening sunlight shone aslant through window."}, {"viet": "Tiếng nổ vang xa đến một dặm.", "eng": "The explosion was heard a mile away."}, {"viet": "Những buổi trình diễn tuyệt vời của đoàn nhào lộn Trung Quốc Đã giành được nhiều huy chương vàng tại các cuộc thi nhào lộn quốc tế đấy.", "eng": "The fantastic performances of the Chinese Acrobatic Troupe have won them a lot of golden medals in many international acrobatic contests."}, {"viet": "Hình vẽ ở trang 22 cho thấy bản đồ chính trị của châu Phi.", "eng": "The figure on page 22 shows a political map of Africa."}, {"viet": "Lối thoát khi hoả hoạn ở phía sau toà nhà.", "eng": "The fire-escape is at the back of the building."}, {"viet": "Chương một định rõ phạm vi nghiên cứu của bà ta.", "eng": "The first chapter delimits her area of research."}, {"viet": "Những chiếc lá nổi trên mặt nước và chìm bên dưới có thể thể hiện một hiện tượng lưỡng hình to lớn.", "eng": "The floating and submerged leaves of an aquatic plant may exhibit considerable dimorphism."}, {"viet": "Sự thành lập một chính phủ mới.", "eng": "The formation of a new government."}, {"viet": "Đồ đạc được giao đến dưới dạng bộ phận rời và tự anh phải lắp ráp nó.", "eng": "The furniture is delivered in pieces and you have to assemble it yourself."}, {"viet": "Ấn tượng chung là việc đó đã được cải thiện.", "eng": "The general impression was that it had improved."}, {"viet": "Tiền công hiện hành trả cho công việc của người làm nghề tự do là 5 pao một giờ.", "eng": "The going rate for freelance work is 5 pounds an hour."}, {"viet": "Chính phủ cho chúng tôi một khoản tiền để xây một lớp học khác.", "eng": "The government gave us a grant to build another classroom."}, {"viet": "Chính phủ từ chối yểm trợ những ngành công nghiệp không có hiệu quả.", "eng": "The government refuses to prop up inefficient industries."}, {"viet": "Chiếc thuyền lớn trông thật uy nghi trong sắc màu mới.", "eng": "The great ship looked majestic in her new colours."}, {"viet": "Người khách trọ muốn đổi phòng.", "eng": "The guest wants to change his room."}, {"viet": "Các từ đầu trong cuốn từ điển này được in đậm nét.", "eng": "The headwords in this dictionary are in bold type."}, {"viet": "Một tên chơi khăm đã lừa cho cảnh sát lao vào một cuộc truy tìm vô vọng.", "eng": "The hoaxer had sent the police on a wild-goose chase."}, {"viet": "Khách sạn này có một bể bơi ở bên trong và phòng tắm hơi cùng với những tiện nghi khác.", "eng": "The hotel has an indoor pool and sauna among the amenities."}, {"viet": "Căn nhà đó ở trong tình trạng tồi tàn.", "eng": "The house was in a sorry state."}, {"viet": "Nguyên nhân trực tiếp gây ra cái chết là không rõ.", "eng": "The immediate cause of death is unknown."}, {"viet": "Người đàn ông bị thương vẫn còn chếnh choáng và chỉ có thể thuật lại vụ tai nạn một cách lộn xộn.", "eng": "The injured man was still groggy and could only give a garbled account of the accident."}, {"viet": "Con ngựa của Ai-len dẫn đầu, với các con còn lại lẻ tẻ cách xa nhau ở phía sau.", "eng": "The Irish horse was in the lead, with the rest of the field strung out behind."}, {"viet": "Quan toà quy trách nhiệm vụ tai nạn cho người lái xe.", "eng": "The judge laid the blame for the accident on the driver of the car."}, {"viet": "Nhà vua đã chỉ định một trong các bộ hạ vào chức vụ đó.", "eng": "The King would appoint one of his creature to the post."}, {"viet": "Lần cuối cùng tôi gặp nàng.", "eng": "The last time I saw her."}, {"viet": "Thuyết trình viên đã nói quá mười phút.", "eng": "The lecturer overran by ten minutes."}, {"viet": "Những ánh đèn thành phố lấp lánh ở đằng xa.", "eng": "The lights of the town twinkling in the distance."}, {"viet": "Những người đình công đã tẩy chay, không xếp hàng hoá lên xe tải.", "eng": "The lorry had been blacked by strikers and could not be unloaded."}, {"viet": "Gian chính của rạp hát, phòng hoà nhạc, v. v.", "eng": "The main body of a theatre, concert hall, etc."}, {"viet": "Bản thảo đó phải có chuyên gia mới hiểu được.", "eng": "The manuscript requires an expert to understand it."}, {"viet": "Người ta tuyên bố thứ thịt này không thích hợp cho con người dùng.", "eng": "The meat was declared unfit for human consumption."}, {"viet": "Khi đóng sầm lại, cánh cửa bằng kim loại vang lên.", "eng": "The metal door rang as it slammed shut."}, {"viet": "Sương mù đã tràn vào trong phòng.", "eng": "The mist penetrated into the room."}, {"viet": "Những học sinh có khả năng nhất đã được chọn ra và xếp vào lớp đặc biệt.", "eng": "The most able pupils are creamed off and put into special classes."}, {"viet": "Tất cả các vụ giết người hình như đều theo chung một kiểu nhất định.", "eng": "The murders all seem to follow a set pattern."}, {"viet": "Dây thần kinh là dây điện tín của cơ thể.", "eng": "The nerves are the telegraph lines of our bodies."}, {"viet": "Những nhà cầm quyền quân sự mới nói chính phủ trước đây đầy rẫy tham nhũng.", "eng": "The new military rulers said that the previous government had been riddled with corruption."}, {"viet": "Tin tức đó có vẻ ghê sợ.", "eng": "The news has a sinister sound."}, {"viet": "Tiếng nổ vang lên qua các phố.", "eng": "The noise of the explosion reverberated through the streets."}, {"viet": "Cô y tá chăm sóc cho bệnh nhân dễ chịu vào ban đêm.", "eng": "The nurse settled her patient for the night."}, {"viet": "Toà nhà cổ có rất nhiều nét đặc trưng.", "eng": "The old building has lot of atmosphere."}, {"viet": "Loại đồng hồ không có chuông báo giờ phải được nhìn xem.", "eng": "The ones that did not strike had to be looked at, or watched."}, {"viet": "Kết quả hoàn toàn phù hợp với mong muốn của tôi.", "eng": "The outcome was entirely correspondent with my wishes."}, {"viet": "Nhân dân trong xứ đạo đã phản đối một số cải cách của cha xứ.", "eng": "The parish objected to some of the vicar's reforms."}, {"viet": "Bệnh nhân kêu rất đau tai.", "eng": "The patient is complaining of acute earache."}, {"viet": "Sự hoàn hảo của thiết kế của họ đã được xác nhận ở chỗ nó tồn tại hàng nghìn năm.", "eng": "The perfection of their design is attested by the fact that they survived for thousands of years."}, {"viet": "Bức tranh rất đẹp mắt người xem.", "eng": "The picture was very pleasing to beholders."}, {"viet": "Máy bay lượn vòng trên sân bay trước khi hạ cánh.", "eng": "The plane circled the airport before landing."}, {"viet": "Vở kịch có thể được xem như một biểu tượng về bản chất của con người.", "eng": "The play may be seen as an allegory about the nature of man."}, {"viet": "Cảnh sát có mặt ở đó để thực thi pháp luật.", "eng": "The police are there to enforce the law."}, {"viet": "Cảnh sát chưa bao giờ bắt được anh ta trong bất cứ một hoạt động tội phạm nào, nhưng cuối cùng anh ta phải chạm trán với giới chức thuế vụ.", "eng": "The police never caught him in any criminal activity but he eventually fell foul of the tax authorities."}, {"viet": "Đảng chính trị hiện đang nắm quyền hành.", "eng": "The political party actually in power."}, {"viet": "Sự lên giá nhanh của đồng bảng đang gây khó khăn cho các nhà xuất khẩu.", "eng": "The pound's rapid appreciation is creating problems for exporters."}, {"viet": "Tổng thống phải tuyên thệ trước công chúng.", "eng": "The president has be sworn in publicity."}, {"viet": "Vị Linh mục cúi trước bàn thờ.", "eng": "The priest bowed down before the altar."}, {"viet": "Người tù bị xử biệt giam ba tháng.", "eng": "The prisoner was sentenced to three month's solitary confinement."}, {"viet": "Dự án còn lâu mới hoàn thành.", "eng": "The project isn't anywhere near completion."}, {"viet": "Sức đẩy của dòng nước đưa chúng ta xuôi dòng.", "eng": "The pull of the current carrying us downstream."}, {"viet": "Vấn đề đó được thảo luận đầy đủ chi tiết trong bản báo cáo của tôi.", "eng": "The question is discussed at large in my report."}, {"viet": "Những con sư tử quá đói cắn xé xác con vật.", "eng": "The ravenous lions tore at the carcass."}, {"viet": "Đương kim vô địch, hoa hậu thế giới, v. v.", "eng": "The reigning champion, Miss World, etc."}, {"viet": "Nhà hàng ngày nào cũng mở cửa trừ thứ Hai.", "eng": "The restaurant is open every day except Monday."}, {"viet": "Cuộc nổi loạn đã được dẹp tan mà không có ai chết cả.", "eng": "The riot was brought under the control without loss of life."}, {"viet": "Được chia trong số tiền cướp được của tên cướp.", "eng": "The robber's share of the stolen money."}, {"viet": "Kỳ hiệu hoàng gia phấp phới khi có Nữ Hoàng cư ngụ.", "eng": "The royal standard flies when the Queen is in residence."}, {"viet": "Vào giờ ăn trưa người chào hàng đã hoàn thành hai vụ giao dịch.", "eng": "The salesman had already wrapped up a couple of deals by lunch-time."}, {"viet": "Ngôi trường đó ban đầu rất nhỏ.", "eng": "The school was originally quite small."}, {"viet": "Ý thức về tội lỗi là nét đặc trưng của loài người văn minh.", "eng": "The sense of guilt is the hallmark of civilized humanity."}, {"viet": "Các quận trưởng sẽ có thể tạm tịch thu các tài khoản ngân hàng thuộc về những người không trả được nợ.", "eng": "The sheriffs will be able to sequestrate bank accounts belonging to defaulters."}, {"viet": "Nhân viên bán hàng mặc một chiếc áo khoác làm việc màu trắng.", "eng": "The shop assistant was wearing a white overall."}, {"viet": "Mỏ bạc đó không còn khai thác được nữa.", "eng": "The silver mine is no longer workable."}, {"viet": "Mùi hôi của chất bài tiết trong khu bệnh viện.", "eng": "The smell of excreta in the hospital ward."}, {"viet": "Những người lính bị giết chết vì đạn của ta vì viên phi công tưởng họ là địch.", "eng": "The soldiers were killed by friendly fire when the pilot thought they were the enemy."}, {"viet": "Sự ngắt lời làm diễn giả hoàn toàn bối rối.", "eng": "The speaker was completely thrown by the interruption."}, {"viet": "Nhà nước Israel các quốc gia hiện đại châu Âu.", "eng": "The State of Israel modern European states."}, {"viet": "Câu chuyện bị gia đình của người chết bác bỏ một cách đầy tức giận.", "eng": "The story was angrily denied by the dead man's family."}, {"viet": "Chất này có ái lực đối với nước.", "eng": "The substance has an affinity for water."}, {"viet": "Cảm giác thoải mái của sự tự do, thành công, v. v.", "eng": "The sweet feeling of freedom, success, etc."}, {"viet": "Thầy giáo phạt các học sinh mất trật tự bằng cách bắt chúng ở lại sau giờ học.", "eng": "The teacher punished the noisy children by making them stay after school."}, {"viet": "Thiên đàng nằm ở khu Sùng Văn thuộc khu vựa phía Nam Bắc Kinh, cách trung tâm thành phố khoảng 6km.", "eng": "The Temple of Heaven is located in the Chongwen District in the southern part of Beijing, about 6 km away from the center of the city."}, {"viet": "Loại thứ ba là khách sạn thông thường mà dịch vụ của nó chủ yếu nhằm vào thương mại thông thường.", "eng": "The third is the convention hotel which aims its services largely at the convention trade."}, {"viet": "Tổng chi phí lên đến một trăm đô la.", "eng": "The total expenses amount to a hundred dollars."}, {"viet": "Kỷ yếu của Hội khảo cổ học Kent.", "eng": "The transactions of the Kent Archaeological Society."}, {"viet": "Hai đứa bé sinh đôi giống nhau đến mức không phân biệt được đứa này với đứa kia.", "eng": "The twins are so alike that no one can distinguish one from the other."}, {"viet": "Hai từ đó viết khác nhau nhưng phát âm như nhau.", "eng": "The two words are spelled differently, but pronounced the same."}, {"viet": "Việc dùng xăng không pha chì hiện nay đang được thực hiện từng bước.", "eng": "The use of lead-free petrol is now being phased in."}, {"viet": "Sự ác liệt của cơn bão, cuộc xung đột, tính thô bạo của sự xúc phạm.", "eng": "The violence of the gale, collision, outrage."}, {"viet": "Nước dâng lên cho đến ngang mặt bờ sông.", "eng": "The water rose until it was on a level with the river banks."}, {"viet": "Toàn bộ bữa ăn là ngon, riêng món rượu thì tuyệt hảo.", "eng": "The whole meal was good but the wine in particular was excellent."}, {"viet": "Nhân chứng đã được luật sư chỉ vẽ cho cách khai.", "eng": "The witness had been prime by a lawyer."}, {"viet": "Trung tâm Thương mại Thế giới là một “ Liên Hiệp Quốc thương mại ” nằm dọc theo sông Hudson.", "eng": "The World Trade Centre is a United Nations of Commerce along the Hudson River."}, {"viet": "Cơ thể chúng được chia ra làm 3 phần như tất cả các loài côn trùng khác.", "eng": "Their bodies are divided into three regions, as the bodies of all insects are."}, {"viet": "Tôi chợt quên mất tên của chúng, tôi sẽ nhớ ra ngay bây giờ đây.", "eng": "Their name is on the tip of my tongue, it'll come back to me in a minute."}, {"viet": "Thế thì cháu sẽ mang tiền mặt trở lại sau.", "eng": "Then I'll come back later with cash."}, {"viet": "Có sự giống nhau giữa hai anh em.", "eng": "There's a likeness between two brothers."}, {"viet": "Giữa bạn bè với nhau không cần phải câu nệ hình thức.", "eng": "There's no need for ceremony between friends."}, {"viet": "Thường có xe cộ đi lại nhiều vào thời điểm này trong ngày.", "eng": "There's usually a lot of traffic at this time of day."}, {"viet": "Không có cảnh nào có thể bị phản đối trong vở kịch.", "eng": "There are no exceptionable scenes in the play."}, {"viet": "Có nhiều màu khác nhau để chọn lựa, bạn thích màu nào nhất?", "eng": "There are various colours to choose from, which do you like best?"}, {"viet": "Số phụ nữ nghiên cứu văn học Anh trội hơn rất nhiều.", "eng": "There is a definite preponderance of women among those who study English literature."}, {"viet": "Có đầy đủ tiền cho mọi nhu cầu của anh ta.", "eng": "There is money aplenty for all his needs."}, {"viet": "Có dấu hiệu hứa hẹn ngày mai thời tiết sẽ tốt hơn.", "eng": "There it a promise of better weather tomorrow."}, {"viet": "Có sự xô đẩy cuồng nhiệt về phía sân khấu khi ca sĩ đó xuất hiện.", "eng": "There was a stampede towards the stage when the singer appeared."}, {"viet": "Có những lời yêu cầu của các đảng đối lập đòi Thủ tướng từ chức.", "eng": "There were calls for the Prime Minister's resignation from the Opposition parties."}, {"viet": "Loại này nặng và gần như thẳng.", "eng": "These are rather heavy and are almost straight."}, {"viet": "Những con vật bé nhỏ ấy đã sống hàng triệu năm trên trái đất.", "eng": "These little animals have lived on the earth for many millions of years."}, {"viet": "Đây là những ý tưởng chính của Darwin: Nhiều loài thực vật và động vật đã được sinh ra nhiều hơn số chúng có thể sống được.", "eng": "These were Darwin's chief ideas: Many more plants and animals are produced than can possibly live."}, {"viet": "Họ trở nên hoài nghi về nền dân chủ.", "eng": "They've grown rather cynical about democracy."}, {"viet": "Họ lập gia đình và sống trong thành phố.", "eng": "They are married and live in the city."}, {"viet": "Họ ép buộc tôi kí hiệp ước.", "eng": "They bulldozed me into signing the agreement."}, {"viet": "Họ quyết định đóng cửa công việc kinh doanh vì không thể tìm ra tiền để tiếp tục kinh doanh.", "eng": "They decided to liquidate, as they could not find the money to carry on the business."}, {"viet": "Họ đổ đầy chiếc bình với nước đun sôi để uống.", "eng": "They filled the pitcher with boiled water for drinking."}, {"viet": "Trong quá khứ chúng đã được nuông chiều quá nên bây giờ không đương đầu được với khó khăn.", "eng": "They have been so feather-bedded in the past that they can't cope with hardship now."}, {"viet": "Họ thích đi khí cầu vào ngày nghỉ cuối tuần.", "eng": "They like to go ballooning at weekends."}, {"viet": "Họ dâng những vật cúng lễ để nguôi cơn giận dữ của các vị thần.", "eng": "They offered sacrifices to propitiate the gods."}, {"viet": "Họ thừa nhận công lao của cô ấy và thăng chức cho cô ấy.", "eng": "They recognised her merit and promoted her."}, {"viet": "Chẳng bao lâu họ đã quên đi những sự bất hoà và lại là bạn của nhau.", "eng": "They soon forgot their differences and were friends again."}, {"viet": "Họ bước đi, những ngón tay đan vào nhau.", "eng": "They walked along with their fingers entwined together."}, {"viet": "Họ hy vọng có kết quả thực qua thí nghiệm.", "eng": "They were hoping for a positive result from the experiment."}, {"viet": "Họ đã làm việc cực nhọc để chu cấp cho gia đình đông người của mình.", "eng": "They worked hard to sustain their large family."}, {"viet": "Cuốn sách này chủ yếu là sự xào xáo công trình nghiên cứu của người khác.", "eng": "This book is mainly a distillation of other people's researches."}, {"viet": "Cái tủ này có thể đựng được thức ăn đủ cho một tháng.", "eng": "This cupboard can store enough food for a month."}, {"viet": "Tình huống này đã từng xảy ra với tôi, và cuối cùng tôi đã làm chi cái khoá kéo hết kẹt mà không làm rách gì cả.", "eng": "This happened to me once, and I finally got the zipper clear without tearing anything."}, {"viet": "Đây là một trong những quán cà phê tôi vẫn thường lui tới.", "eng": "This is one of the cafés I used to haunt."}, {"viet": "Thang máy được thiết kế đủ để chở mỗi lần mười bốn người.", "eng": "This lifts were designed to carry only fourteen passengers apiece."}, {"viet": "Bức hoạ này là cái tôi đạt được gần đây nhất.", "eng": "This painting is my latest acquisition."}, {"viet": "Đường đất gồ ghề này sẽ thành đường rải đá trong nay mai.", "eng": "This rough track will soon be a metalled road."}, {"viet": "Vào giờ này tuần tới tôi sẽ đang ngồi trên bãi biển ở Hy Lạp.", "eng": "This time next week I shall be sitting on a beach in Greece."}, {"viet": "Cái quần chật căng của chị không được lịch sự cho lắm.", "eng": "Those tight trousers of yours aren't very decent."}, {"viet": "Ngày nay có nhiều loại nhảy múa khác nhau.", "eng": "Today there is dancing of many different kinds."}, {"viet": "Hai nhà nghiên cứu riêng rẽ đã đạt được những kết luận hầu như nhau.", "eng": "Two independent investigators have reached virtually the same conclusions."}, {"viet": "Cô phục vụ ơi, tôi đã gọi bữa ăn cách đây mười lăm phút rồi.", "eng": "Waitress, I ordered my meal a quarter ago."}, {"viet": "Chúng tôi muốn nhắn gọi giùm lúc 6 giờ sáng mai.", "eng": "We'd like to leave a call for 6: 00 in the morning."}, {"viet": "Chúng tôi có khả năng cung cấp hàng và các dịch vụ hậu mãi chất lượng cao.", "eng": "We're capable of providing the high quality goods and after-sale services."}, {"viet": "Chúng tôi đang vật lộn để sống với một thu nhập nhỏ nhoi.", "eng": "We're struggling along on a tiny income."}, {"viet": "Chúng ta chỉ còn lại vài viên đạn cho nên phải tính toán từng phát một.", "eng": "We've only a few bullets left, so make each one count."}, {"viet": "Tất cả chúng ta đều xúc động bởi tính cách của những đứa trẻ nghèo khổ vô gia.", "eng": "We are all moved by the plight of these poor homeless children."}, {"viet": "Chúng tôi chưa chuẩn bị tý gì cho việc kiểm tra.", "eng": "We aren't nearly ready for the inspection."}, {"viet": "Chúng tôi có thể kiểm tra ngay.", "eng": "We can check it right away."}, {"viet": "Chúng ta có thể nghe thấy trẻ con chạy rầm rầm trên gác.", "eng": "We could hear the children banging about upstairs."}, {"viet": "Chúng tôi không muốn biến vấn đề này thành chuyện cá nhân.", "eng": "We don't want to personalise the issue."}, {"viet": "Chúng tôi đã lâm vào cảnh khó khăn về tiền thuê nhà.", "eng": "We got into difficulties with the rent."}, {"viet": "Chúng tôi không dự định nhiều khách đến thế, vì vậy không đủ thức ăn.", "eng": "We hadn't planned on so many guests so there wasn't enough food."}, {"viet": "Chúng tôi đã tìm khắp mọi nơi mà không thấy các khuy cổ tay áo giả của ông ấy.", "eng": "We have searched high and low but could not find his cuff links."}, {"viet": "Chúng tôi để mắt tới tỉ giá hối đoái để mua cổ phần.", "eng": "We keep an eye on local exchange rates to find out where it is cheapest to buy parts from."}, {"viet": "Chúng tôi đã cố gắng kiên trì chống lại tất cả ý định đóng cửa công ti.", "eng": "We managed to stand out against all the attempts to close the company down."}, {"viet": "Chúng ta phải chạy thôi, nếu không chúng ta sẽ đến chậm.", "eng": "We must run, otherwise we'll be too late."}, {"viet": "Chúng tôi đã trả 60000 đô la cho đơn đặt hàng ngày 8 tháng bảy vào hôm qua.", "eng": "We paid $ 60,000 for our order of July 8 yesterday."}, {"viet": "Chúng tôi thấy con hổ sắp vồ ( con dê ).", "eng": "We saw the tiger about to pounce ( to the goat )."}, {"viet": "Chúng tôi vẫn không hiểu bọn trộm vào bằng cách nào.", "eng": "We still don't know how the thieves gained access."}, {"viet": "Chúng tôi muốn một phần bánh nướng nhân táo, một suất kem và hai phần bánh xốp.", "eng": "We want one apple pie, one ice-cream and two sponge cakes."}, {"viet": "Chúng tôi hồi hộp lo lắng hàng tiếng đồng hồ trong khi các giám khảo quyết định ai là người thắng.", "eng": "We were kept on tenterhooks for hours while the judges were deciding the winners."}, {"viet": "Chúng tôi làm bài dưới sự giám sát của thầy giáo.", "eng": "We worked under the teacher's supervision."}, {"viet": "À, dù sao thì tôi cũng sẽ nhận việc đó.", "eng": "Well, I'd take the job anyway."}, {"viet": "Dạ, khi cháu hắt hơi, người ta mong cháu nói “ xin lỗi ” phải không ạ?", "eng": "Well, when I sneeze, I'm expected to say excuse me right?"}, {"viet": "Ông có kế hoạch gì để đẩy mạnh việc tiêu thụ sản phẩm của công ty chúng tôi?", "eng": "What's your plan for promoting our products?"}, {"viet": "Ông có thú tiêu khiển gì vậy, ông Vương?", "eng": "What are your hobbies, Mr. Wang?"}, {"viet": "Bạn nghĩ gì về Hoàng Gia?", "eng": "What do you think of the Royal family?"}, {"viet": "Cái thằng ngu khốn kiếp đang làm gì trên nóc nhà thế nhỉ?", "eng": "What is that loony airbrain doing there on the roof?"}, {"viet": "Quê bạn nổi tiếng về điều gì?", "eng": "What is your hometown famous for?"}, {"viet": "Anh có quyền gì mà nạt nộ tôi như thế?", "eng": "What right have you to thunder at me like that?"}, {"viet": "Kết quả bàn cãi của các anh thế nào?", "eng": "What was the result of your deliberation?"}, {"viet": "Bạn thường thức dậy lúc mấy giờ?", "eng": "When do you usually get up?"}, {"viet": "Khi muốn thưởng thức nét đẹp của ngôn ngữ thì tôi sẽ đọc thơ.", "eng": "When I want beautiful language, I read poetry."}, {"viet": "Khi giá xăng tăng thì giá vé xe buýt cũng tăng lên tương ứng.", "eng": "When the petrol prices rise there is a parallel rise in bus fares."}, {"viet": "Khi ông ra khỏi thang máy, hãy đi bên phải.", "eng": "When you come out of the elevator, go right."}, {"viet": "Từ lần cuối cùng tôi gặp anh, anh đi đâu?", "eng": "Where have you been since I last saw you?"}, {"viet": "Đài truyền hình nào lớn nhất ở Mỹ?", "eng": "Which is the biggest television station in the United States?"}, {"viet": "Ai làm giấy tờ của tôi rối tung lên thế?", "eng": "Who's been messing about with my papers?"}, {"viet": "Ai sẽ cung cấp tiền để trả cho chuyến đi này?", "eng": "Who will find the money to pay for this trip?"}, {"viet": "Tại sao bạn không xem nó lại một lần nữa?", "eng": "Why don't you go over it once more?"}, {"viet": "Thứ bảy tới bạn có rảnh không?", "eng": "Will you be available next Saturday?"}, {"viet": "Mùa đông không được ấm áp.", "eng": "Winters are not warm."}, {"viet": "Đồ lót của phụ nữ là thứ kích dục phổ biến.", "eng": "Women's underclothes are a common fetish."}, {"viet": "Bạn có bao giờ nghĩ đến việc nhận con nuôi không?", "eng": "Would you ever consider adopting a baby?"}, {"viet": "Cháu có muốn đi tắm không?", "eng": "Would you like to take a shower?"}, {"viet": "Viết chữ hoa, chữ Trung Quốc, tốc ký, v. v.", "eng": "Write capitals, Chinese characters, shorthand, etc."}, {"viet": "Vâng, tôi nghĩ tôi sẽ dùng món thịt bò bít-tết.", "eng": "Yes, I think I'll have the steak."}, {"viet": "Xin tiểu thư hãy xử sự cho đúng đắn!", "eng": "You'd better straighten up, young lady!"}, {"viet": "Anh hãy tưới cây giùm trong lúc tôi đi vắng?", "eng": "You'll water the plants while I'm away, won't you?"}, {"viet": "Anh hiểu lầm hoàn toàn rồi, không phải anh ta nợ tiền tôi, mà là tôi nợ anh ấy!", "eng": "You've got the wrong end of the stick, he doesn't own me money, I owe him!"}, {"viet": "Không thể chữa trị nghèo đói mà không làm một cái gì đó để nâng cao giáo dục: chúng là hai mặt của một đồng tiền.", "eng": "You can't cure poverty without also doing something about improving education: they're two sides of the same coin."}, {"viet": "Anh có thể không cần để ý đến những gì Jack đã nói: hắn là thằng nói dối kinh người.", "eng": "You can discount what Jack said: he's a dreadful liar."}, {"viet": "Các anh đến sớm thế làm chúng tôi ngạc nhiên.", "eng": "You caught us unawares by coming so early."}, {"viet": "Anh có một thành phố một triệu dân.", "eng": "You have a city of one million people."}, {"viet": "Mẹ biết là con không thể làm thế mà.", "eng": "You know I can't do that."}, {"viet": "Bạn phải dùng màn để tránh muỗi đốt.", "eng": "You must avoid being bitten by mosquitoes by using mosquito-net."}, {"viet": "Cô cần phải có rất nhiều tài xử sự mới có thể làm tiếp viên trên máy bay được.", "eng": "You need a lot of tact to be an air hostess."}, {"viet": "Anh phải sang số thôi-máy bắt đầu chạy ì ạch rồi đấy.", "eng": "You should change gear-the engine's starting to labour."}, {"viet": "Số thời gian cậu dùng để chơi thể thao là không cân xứng.", "eng": "You spend a disproportionate amount of your time on sport."}, {"viet": "Anh sẽ không thể đoán được hôm nay tôi gặp ai đâu, đó là thầy giáo cũ của tôi mà đã hai mươi năm chúng tôi không gặp nhau.", "eng": "You will never guess who I met today, my old teacher we haven't met for 20 years."}, {"viet": "Quyết định của anh rất đúng đắn.", "eng": "Your decision was eminently fair."}, {"viet": "Sự ngu đần của cậu sẽ dẫn tôi đến tuyệt vọng.", "eng": "Your stupidity will drive me to despair."}]