[{"viet": "20 năm trước vùng này đã bị một căn bệnh khủng khiếp hoành hành.", "eng": "20 years ago this area was visited by a terrible disease."}, {"viet": "Một chiếc xe ôtô vượt qua mặt tôi với tốc độ 90 dặm Anh một giờ trên đường cao tốc.", "eng": "A car passed me at 90 mph on the motorway."}, {"viet": "Một nhân viên khách sạn dẫn khách đến phòng và giới thiệu về những tiện nghi trong phòng.", "eng": "A clerk shows the guest to his room and talks about the room facilities."}, {"viet": "Vài người đang họp mặt để uống vài cốc rượu.", "eng": "A couple of people are getting together for some drinks."}, {"viet": "Việc chẩn đoán bệnh ung thư đã trở nên trầm trọng cho thấy cần phải giải phẫu gấp.", "eng": "A diagnosis of advanced cancer indicating an emergency operation."}, {"viet": "Một bước hụt của những người leo núi có thể đổi bằng tính mạng của họ.", "eng": "A false step could have cost the climbers their lives."}, {"viet": "Một dây câu bị mắc trong đám cỏ dại.", "eng": "A fishing line entangled among the weeds."}, {"viet": "Một huy chương vàng hoàn toàn ngoài sự mong đợi.", "eng": "A gold medal that was against all expectations."}, {"viet": "Một khách trọ muốn đi đánh bóng giày.", "eng": "A guest wants to have his shoes shined."}, {"viet": "Một nhân viên sẽ đến phòng ông ngay ạ.", "eng": "A house man will soon be in your room."}, {"viet": "Một phần bánh nướng Yoóc-xơ lớn.", "eng": "A large helping of Yorkshire pudding."}, {"viet": "Một cái làng nhỏ nằm chơ vơ trên sườn núi.", "eng": "A little village perched on the side of the mountain."}, {"viet": "Một người có ánh mắt nham hiểm.", "eng": "A man with a dangerous gleam in his eye."}, {"viet": "Một đài kỷ niệm được dựng lên để tưởng nhớ các chiến sĩ đã hy sinh trong cuộc chiến.", "eng": "A monument erected to soldiers killed in the war."}, {"viet": "Một bài báo đã chỉ trích ngài Thủ tướng nặng nề.", "eng": "A newspaper article attacking the Prime Minister."}, {"viet": "Một con đường thật là thẳng tắp.", "eng": "A path so straight and unswerving."}, {"viet": "Một sơ đồ bố trí chỗ ngồi.", "eng": "A plan of the seating arrangements."}, {"viet": "Một giấy có kẻ sọc đẹp mắt dùng để dán phòng ngủ.", "eng": "A pretty striped paper for the bedroom."}, {"viet": "Sự mô tả trung thực cuộc sống của giai cấp lao động.", "eng": "A raw portrayal of working-class life."}, {"viet": "Một chuyến vượt biển đầy sóng gió từ cảng Dover đến Calais.", "eng": "A rough crossing from Dover to Calais."}, {"viet": "Một loạt các vụ bê bối về tham nhũng đã dẫn đến sự sụp đổ của chính quyền.", "eng": "A series of corruption scandals led to the fall of the government."}, {"viet": "Một sự giảm bớt hoạt động trong công nghiệp sữa.", "eng": "A slow-down in the dairy industry."}, {"viet": "Một bài diễn văn kích động đám đông giận dữ.", "eng": "A speech that inflamed the crowd with anger."}, {"viet": "Một cuộc thất bại bất ngờ trong chiến dịch du kích.", "eng": "A sudden reverse in the guerrilla campaign."}, {"viet": "Một con lạc đà khi khát có thể uống một lúc 20 ga-lông nước.", "eng": "A thirsty camel has been known to drink 20 gallons of water at one time."}, {"viet": "Một phản ứng rất nhẫn nại với gian khổ.", "eng": "A very stoical response to hardship."}, {"viet": "Một người đàn bà được đề cập đến cho đến lúc này là bà X.", "eng": "A woman referred to hitherto as Mrs X."}, {"viet": "Tố cáo các quốc gia cạnh tranh về chế độ bảo hộ mậu dịch.", "eng": "Accuse rival countries of protectionism."}, {"viet": "Sự cố vấn cho các nhà đầu tư dựa vào giả thuyết là các lãi suất sẽ tiếp tục giảm.", "eng": "Advice to investors was based on the premise that interest rates would continue to fall."}, {"viet": "Sau khi có bằng kỹ sư, tôi bắt đầu đi chuyên về công nghệ máy vi tính.", "eng": "After I did my engineering degree, I began to specialize in computer technology."}, {"viet": "Sau khi gài số xe khớp.", "eng": "After the engagement of the clutch."}, {"viet": "Rượu làm giảm sự gò bó của con người.", "eng": "Alcohol weakens a person's inhibitions."}, {"viet": "Được, tất cả đều ở trên kệ phía bên phải của ông.", "eng": "All right, they're all on the shelves to your right."}, {"viet": "Cả thảy là 90 nhân dân tệ.", "eng": "All together it is RMB 9."}, {"viet": "Người Mỹ ngốn cả 50 triệu cái xúc xích nóng bình quân vào một ngày mùa hạ.", "eng": "Americans scarf down 50 million hot dogs on an average summer day."}, {"viet": "Một kỷ nguyên tiến bộ không ngừng về ngành y.", "eng": "An area of unstopped progress in medicine."}, {"viet": "Một cuộc triển lãm tranh phong cảnh đồng quê của các họa sĩ địa phương.", "eng": "An exhibition of landscapes by local artists."}, {"viet": "Một vấn đề khiến các cử tri phải có những phản ứng cấp thời.", "eng": "An issue that presses voter's hot buttons."}, {"viet": "Một điều may mắn bất ngờ.", "eng": "An unhoped-for piece of good luck."}, {"viet": "Và chuyên ngành của anh là tài chính quốc tế.", "eng": "And your major is international finance."}, {"viet": "Vậy, ông có phải là Martin Kemp không ạ?", "eng": "Anyway, you are Mr. Martin Kemp?"}, {"viet": "Ở nước bạn có nhiều bà mẹ đơn thân phải không?", "eng": "Are there many single mothers in your country?"}, {"viet": "Bạn có thích cách cắm hoa của Nhật không?", "eng": "Are you interested in Japanese flower arrangement?"}, {"viet": "Kiêu ngạo là một trong những đặc tính thiếu hấp dẫn của anh ta.", "eng": "Arrogance is one of his less attractive characteristics."}, {"viet": "Khi các sự kiện mới được mọi người biết, chính phủ buộc phải nhận lỗi trong việc xử lý vụ tai tiếng về gián điệp.", "eng": "As new facts become known, the Government was forced to climb down over its handling of the spy scandal."}, {"viet": "Thuốc Átpirin được hấp thụ nhanh chóng vào cơ thể.", "eng": "Aspirin is quickly absorbed by the body."}, {"viet": "Ở điểm chung của nghệ thuật và khoa học.", "eng": "At the interface of art and science."}, {"viet": "Các nhân viên phụ trách hành lý có được đưa lên đúng chuyến bay không.", "eng": "Baggage handlers see that baggage is loaded on the correct flights."}, {"viet": "Không trung thành với các cộng sự viên của ai.", "eng": "Be disloyal to one's associates."}, {"viet": "Vì một mối hận thù gia đình, anh ấy không bao giờ nói chuyện với bố mẹ vợ hàng bao nhiêu năm.", "eng": "Because of a family feud, he never spoke to his wife's parents for years."}, {"viet": "Ngoài ra, những màu này hợp với bà hơn.", "eng": "Besides, these colours are more becoming to you."}, {"viet": "Những cuốn sách nhắm vào khách hàng dễ tính và không sành.", "eng": "Books targeted to the low-end consumer."}, {"viet": "Ngành nghệ thuật sân khấu Anh được tài trợ hết sức ít-và tình trạng đó cũng đúng đối với ngành công nghiệp điện ảnh.", "eng": "British theatre is seriously underfunded-and the same is true of the film industry."}, {"viet": "Nhưng trước hết em phải tắm đã.", "eng": "But I get to take a bath first."}, {"viet": "Nhưng chúng ta có thể lái xe đi từ hồ.", "eng": "But we can drive from the lake."}, {"viet": "Vào lúc cuộc bao vây chấm dứt, dân trong thành phố gần như chết đói.", "eng": "By the time the siege ended, the citizens were nearly starving."}, {"viet": "Tôi có thể nhận được sự giúp đỡ của ông trong việc quyên tiền không?", "eng": "Can I enlist your help in raising the money?"}, {"viet": "Chúng em có thể đá bóng quanh đây một lúc được không ạ?", "eng": "Can we kick the ball around for a while?"}, {"viet": "Anh có thể đo chính xác với cái thước này không?", "eng": "Can you measure accurately with this ruler?"}, {"viet": "Xe ô tô của anh có đạt tới tốc độ một trăm dặm Anh một giờ không?", "eng": "Can your car make a hundred miles per hour?"}, {"viet": "Những cái ghế để lộn xộn khắp phòng.", "eng": "Chairs were left untidily around the room."}, {"viet": "Thư pháp Trung Quốc được cho là chìa khoá vàng để hiểu được văn hoá Trung Quốc.", "eng": "Chinese calligraphy is said to be a golden key to understand the Chinese culture."}, {"viet": "Chiếc quan tài khuất dưới một đám bó hoa và vòng hoa phúng điếu.", "eng": "Coffin hidden beneath a mass of floral tributes."}, {"viet": "Các kì thi sát hạch để chọn người cho các chức vụ trong chính phủ.", "eng": "Competitive examinations for the government posts."}, {"viet": "Việc tiếp tục chơi sau giờ nghỉ uống trà đã bị bãi bỏ vì trời mưa.", "eng": "Continuation of play after the tea interval was ruled out by rain."}, {"viet": "Anh có thể ra xem mấy đứa nhỏ đang làm gì không?", "eng": "Could you go and see what the children are doing?"}, {"viet": "Thẻ tín dụng cũng được phần lớn các nhà hàng loại một nhận.", "eng": "Credit cards are also accepted by most first-class restaurants."}, {"viet": "Những quầng thâm đen quanh mắt cô ta vì mất ngủ.", "eng": "Dark rings round her eyes from lack of sleep."}, {"viet": "Việc gửi tiền bao gồm tiền gửi tiết kiệm kỳ hạn và gửi tiết kiệm không kỳ hạn.", "eng": "Deposit contains time deposit and current deposit."}, {"viet": "Nước tẩy này có tẩy được vết bẩn đó không?", "eng": "Did the cleaning fluid work on that stain?"}, {"viet": "Những mối bất đồng giữa giới chủ và công nhân trở nên sâu sắc.", "eng": "Differences between employers and workers go deep."}, {"viet": "Tôi phải thanh toán hóa đơn ở bàn thu ngân phải không?", "eng": "Do I have to pay the bill at the cashier's desk?"}, {"viet": "Anh có tin vào việc giải trừ vũ khí hạt nhân không?", "eng": "Do you believe in nuclear disarmament?"}, {"viet": "Bạn có bằng đại học không?", "eng": "Do you have a university degree?"}, {"viet": "Bạn có biết môn thể thao quốc gia của Nhật Bản không?", "eng": "Do you know Japan's national sport?"}, {"viet": "Anh thích sôcôla sữa hay sôcôla không sữa?", "eng": "Do you prefer milk chocolate or plain chocolate?"}, {"viet": "Bạn có nghĩ bạn có chất nghệ sĩ không?", "eng": "Do you think you are artistic?"}, {"viet": "Chiếc xe ôtô cũ đó liệu còn đem lại lợi ích đáng để chi phí cho nó nữa không?", "eng": "Does that old car still earn its keep?"}, {"viet": "Đừng để bị lừa-hắn chỉ là một tên lang băm thôi.", "eng": "Don't be taken in-he's just a quack."}, {"viet": "Đừng đi ra ngoài-trời lạnh lắm đó.", "eng": "Don't go outside-it's too cold."}, {"viet": "Đừng tin vào ký ức anh ta: anh ta đúng là một người xa rời thực tế.", "eng": "Don't rely on his memory: he's a bit of a dreamer."}, {"viet": "Đừng có chùi các ngón tay dính mứt của con vào khăn bàn.", "eng": "Don't wipe your jammy fingers on the table-cloth."}, {"viet": "Các tài xế luôn bị cám dỗ, luôn chạy lấn sang đường xe khác.", "eng": "Drivers are constantly tempted the change lanes."}, {"viet": "Lễ Phục sinh và lễ Giáng sinh là những ngày lễ của người Thiên Chúa giáo.", "eng": "Easter and Christmas are Christian festivals."}, {"viet": "Được hưởng một giờ yên ổn và thanh tịnh không bị căng thẳng thần kinh.", "eng": "Enjoyed a stressless hour of peace and quiet."}, {"viet": "Lần nào anh ta gọi điện dường như cũng đúng vào lúc tôi đang tắm.", "eng": "Every time he phones I always seem to be in the bath."}, {"viet": "Xin lỗi, tôi đã làm rơi cái nĩa của tôi.", "eng": "Excuse me, I dropped my fork."}, {"viet": "Những điều quen thuộc đối với mọi nam sinh.", "eng": "Facts that are familiar to every schoolboy."}, {"viet": "Cảm thấy sức nóng của các tia nắng mặt trời.", "eng": "Feel the heat of the sun's rays."}, {"viet": "Các công ty tham gia sản xuất đồ nhựa.", "eng": "Firms engaged in the manufacture of plastics."}, {"viet": "Sương mù sẽ còn dai dẳng suốt đêm.", "eng": "Fog will persist throughout the night."}, {"viet": "Qua nhiều năm công việc làm ăn vẫn cứ bình thường.", "eng": "For years the business just kept jogging along."}, {"viet": "Ngay từ lúc đầu đã rõ ràng là hắn phạm tội.", "eng": "From the outset it was clear that he was guilty."}, {"viet": "Các khóa học tiếng Đức và tiếng Ý được tổ chức theo thứ tự tương ứng ở Munich và Rome.", "eng": "German and Italian courses are held in Munich and Rome respectively."}, {"viet": "Cho tao thêm một ít nữa đi, đồ keo kiệt!", "eng": "Give me some more, you meany!"}, {"viet": "Cứ đi trước đi, tôi sẽ theo kịp các bạn ngay.", "eng": "Go on in front, I'll soon catch you up."}, {"viet": "Nhiều biện pháp thận trọng đã được áp dụng để đảm bảo an toàn cho hành khách.", "eng": "Great pains have been taken to ensure the safety of passengers."}, {"viet": "Hãy nghe tiếng búa đập lia lịa kìa, ngay bây giờ, mày sẽ làm em bé thức giấc thôi.", "eng": "Hark that reeling, now, you'll wake the baby."}, {"viet": "Anh đã được chủng ngừa chống lại đậu mùa chưa?", "eng": "Have you been immunized against smallpox yet?"}, {"viet": "Anh có gặp những khó khăn trong công việc hay không?", "eng": "Have you got problems at work?"}, {"viet": "Phải xem cuộn phim quay cảnh gia đình của họ cả buổi tối thì thà chết sướng hơn!", "eng": "Having to watch their home movies all evening was a fate worse than death!"}, {"viet": "Ông ấy luôn luôn chú ý quá mức tới bọn cháu nhỏ.", "eng": "He's always fussing over his grandchildren."}, {"viet": "Nó quỳ xuống và kì cọ.", "eng": "He's down an his knees scrubbing."}, {"viet": "Không bao giờ nó lại làm ta bực mình nhiều hơn khi nó tìm cách giúp đỡ.", "eng": "He's never more annoying than when he's trying to help."}, {"viet": "Ông ấy là người muốn ông đến dự lễ cưới.", "eng": "He's the one that wanted you to come to the wedding."}, {"viet": "Ông thì luôn luôn cho phép; còn bà, ngược lại, luôn luôn từ chối.", "eng": "He always gives permission; she, contrariwise, always refuses it."}, {"viet": "Nó xử sự theo một cách không đúng với bản tính của nó.", "eng": "He behaved in a way that was untypical of him."}, {"viet": "Anh ấy có thể tàn nhẫn để đạt cái mình muốn, nhưng tôi tin rằng anh ấy sẽ không đến độ đi tống tiền.", "eng": "He can be ruthless in getting what he wants, but I believe he would stop short of blackmail."}, {"viet": "Anh ấy che giấu tình cảm của mình sau một thái độ khá lạnh lùng.", "eng": "He conceals his feelings behind a rather stolid manner."}, {"viet": "Ông ta đòi hỏi những môn đồ của mình sự vâng lời tuyệt đối.", "eng": "He demands unquestioning obedience from his followers."}, {"viet": "Anh ta không đủ tiền để thực hiện hết mọi lời cam kết của mình.", "eng": "He doesn't have enough money to meet all his engagements."}, {"viet": "Anh ta đùng đùng nổi giận biểu hiện một cách dùng bóng bảy của động từ nổ.", "eng": "He exploded with rage shows a figurative use of verb to explode."}, {"viet": "Anh ta hạ đo ván đối thủ bằng một cú đấm ngoạn mục trong hiệp một.", "eng": "He floored his opponent with a fine punch in the first round."}, {"viet": "Anh ta lãnh mười ngày tù.", "eng": "He gets ten day's jankers."}, {"viet": "Ông ta đã được cứu sống như thể có sự can thiệp của thần linh.", "eng": "He had been saved from death as if by divine intervention."}, {"viet": "Anh ấy có nhiều vi phạm phải trả lời.", "eng": "He has a lot to answer for."}, {"viet": "Suốt cả đời anh ấy đã sống ở Luân Đôn.", "eng": "He has lived all his life in London."}, {"viet": "Ông ta nhắc thân xác nặng nề của mình ra khỏi ghế.", "eng": "He heaved his huge bulk out of the chair."}, {"viet": "Anh ta chẳng để ý gì đến bề ngoài của mình.", "eng": "He is careless about his personal appearance."}, {"viet": "Anh ta là một người vô trách nhiệm quá sức.", "eng": "He is the limit of irresponsibility."}, {"viet": "Nó biết rằng đây là hy vọng cuối cùng của nó để thắng.", "eng": "He knew this was his last hope of winning."}, {"viet": "Anh ấy sẽ đến gặp ông ngay.", "eng": "He'll be right with you."}, {"viet": "Anh ta đã phạm mười lỗi trong cả mười dòng.", "eng": "He made ten mistakes in as many lines."}, {"viet": "Anh ấy không bao giờ quên mình thuộc dòng dõi thấp hèn.", "eng": "He never forgot his humble origins."}, {"viet": "Anh ta đã cứu vớt cô ta khỏi vũng bùn nhơ và giúp cô trở thành một phụ nữ cao sang.", "eng": "He picked her out of the gutter and made her a great lady."}, {"viet": "Nó quả quyết không làm một việc như thế.", "eng": "He protests that he diet not do such a thing."}, {"viet": "Ông ta nhận thấy khán giả bắt đầu lơ đễnh.", "eng": "He realized his audience's attention was beginning to wander."}, {"viet": "Ông ta nghỉ hưu sớm vì các lý do sức khoẻ.", "eng": "He retired early for health reasons."}, {"viet": "Anh ta có chiều cao khoảng bằng anh.", "eng": "He's about the same height as you."}, {"viet": "Anh ấy biết bảo vệ quyền lợi riêng của mình.", "eng": "He's good at looking after his own interests."}, {"viet": "Anh ta bị đem ra xử xem có đáng được sống không.", "eng": "He's on trial for his life."}, {"viet": "Anh ấy bảo có người đã nói dối nhưng không muốn nêu tên.", "eng": "He said someone had lied but wouldn't name names."}, {"viet": "Anh ta hơi nóng tính nhưng rất đa cảm.", "eng": "He seems bad tempered but he's very soft hearted underneath."}, {"viet": "Ông ta cho chúng tôi xem cái lốp tốt để so với cái cũ.", "eng": "He showed us a good tyre for comparison with the worn one."}, {"viet": "Anh ta nói một cách buồn thảm về tai họa có thể xảy ra trong tương lai.", "eng": "He spoke darkly of possible future disaster."}, {"viet": "Ông ta hết sức phẫn uất lao ra khỏi cuộc họp.", "eng": "He stormed out of the meeting in high dudgeon."}, {"viet": "Đôi khi anh ta nói nhiều điều vớ vẩn.", "eng": "He talks a load of tosh sometimes."}, {"viet": "Anh ta phản đối mạnh điều tôi nói.", "eng": "He took great exception to what I said."}, {"viet": "Hắn tìm cách ngáng chân tôi.", "eng": "He tried to trip me up."}, {"viet": "Nó đi vào trại không mang vũ khí.", "eng": "He walked into the camp unarmed."}, {"viet": "Anh ta luôn luôn lo ngại về dự án mới của tôi.", "eng": "He was always apprehensive about my new project."}, {"viet": "Hắn ta bị kết tội sát nhân ngộ sát.", "eng": "He was charged with first-degree murder."}, {"viet": "Anh ta ghen ghét bực bội vì Richard thi đỗ còn anh ta thì không.", "eng": "He was filled with envy because Richard passed the examination and he did not."}, {"viet": "Ông ta là một người ẩn dật khó tính.", "eng": "He was known as a bad-tempered recluse."}, {"viet": "Hắn đã bị chặn bắt và bị đưa đi thẩm vấn.", "eng": "He was picked up and taken for questioning."}, {"viet": "Nó đứng giang chân ra.", "eng": "He was standing with his feet wide apart."}, {"viet": "Anh ta ốm rất nặng, song các bác sĩ đã cứu anh ta qua khỏi.", "eng": "He was very ill, but the doctors brought him through."}, {"viet": "Nó quét vôi tường cả trong lẫn ngoài.", "eng": "He whitewashed the walls within and without."}, {"viet": "Anh ta lẽ ra đã chống đối nếu đó không phải là bạn.", "eng": "He would have protested save that was a friend."}, {"viet": "Xin chào, có phải đó là nhà của ông Dick Wilson không?", "eng": "Hello, is that Mr. Dick Wilson's house?"}, {"viet": "Phẩm chất tốt của cô ấy là lòng dũng cảm và sự vui vẻ.", "eng": "Her best qualities are courage and cheerfulness."}, {"viet": "Cái chết của cô ấy làm anh ta bàng hoàng.", "eng": "Her death was a shock to him."}, {"viet": "Sự sợ nước của cô ấy có thể truy nguyên thấy bắt nguồn từ một tai nạn thời thơ ấu.", "eng": "Her fear of water can be traced back to a childhood accident."}, {"viet": "Chồng bà ấy lại say bí tỉ.", "eng": "Her husband's been on the booze again."}, {"viet": "Anh ấy trông thật giống con chó của mình-hơn nữa, vợ anh ta cũng vậy!", "eng": "Her looks just like his dog-come to that, so does his wife!"}, {"viet": "Những bức hoạ của cô ấy được đánh giá cao ở nước ngoài.", "eng": "Her paintings are very well considered abroad."}, {"viet": "Sự từ chức của bà ấy đẩy chúng tôi vào một tình thế hết sức lộn xộn.", "eng": "Her resignation landed us in a real mess."}, {"viet": "Sở thích âm nhạc của bà ta rất giống với chồng bà.", "eng": "Her taste in music coincides with her husband's."}, {"viet": "Đây là những quyển sách mà tôi đã mượn của anh cách đây một tuần.", "eng": "Here are the books that I borrowed from you a week ago."}, {"viet": "Những lời tố cáo của ông ta gây nên một sự đáp ứng tức khắc.", "eng": "His accusations brought an immediate response."}, {"viet": "Niềm tin vào tự do của ông ấy là động lực chính của cuộc đấu tranh của ông ấy chống lại chế độ nô lệ.", "eng": "His belief in liberty was the mainspring of his fight against slavery."}, {"viet": "Hành vi của nó đáng bị khiển trách.", "eng": "His conduct deserves to be reprehended."}, {"viet": "Cuộc thi của cậu ta khởi đầu thật khó khăn.", "eng": "His examination got off to a difficult start."}, {"viet": "Tình yêu mến của ông ta đối với người cháu lớn tuổi nhất.", "eng": "His fondness for his eldest grandchild."}, {"viet": "Bệnh tình của anh ấy đã làm cho anh ấy nằm bẹp ở nhà.", "eng": "His illness has left him completely house-bound."}, {"viet": "Sự may mắn của anh ta bị đảo ngược ác nghiệt.", "eng": "His luck suffered a cruel reversal."}, {"viet": "Điều tự cho là nổi tiếng duy nhất của ông ta là ông ta đã có một lần gặp Stalin.", "eng": "His only claim to fame is that he once met Stalin."}, {"viet": "Lời đề nghị của anh ta gặp phải sự phản đối mãnh liệt.", "eng": "His proposal was met by a storm of protest."}, {"viet": "Con trai ông ấy có sự thôi thúc trong lòng muốn làm một thầy tu.", "eng": "His son has a calling to become a priest."}, {"viet": "Cách đối xử của hắn làm cô ta cảm thấy mình bị giảm giá trị.", "eng": "His treatment of her made her feel cheap."}, {"viet": "Vật dụng làm việc của anh ta bừa bãi khắp sàn nhà.", "eng": "His work was spread all over the floor."}, {"viet": "Lên đi, tôi sẽ cho anh quá giang tới nhà ga.", "eng": "Hop in, I'll give you a lift to the station."}, {"viet": "Sao chỉ mới ba vại bia mà có thể say được?", "eng": "How can anybody be so aced on three beers?"}, {"viet": "Làm sao anh có thể xoay sở để có được than trong suốt thời gian thợ mỏ đình công?", "eng": "How did you do for coal during the miners'strike?"}, {"viet": "Chất hoá học này phản ứng như thế nào khi đốt lên?", "eng": "How does this chemical behave when heated?"}, {"viet": "Đi xe buýt mất độ bao lâu?", "eng": "How long will the bus take?"}, {"viet": "Một phút có bao nhiêu giây?", "eng": "How many seconds are there in a minute?"}, {"viet": "Anh ta có bao nhiêu tiền ở nhà băng?''Khá nhiều'.", "eng": "How much money has he got in the bank?''A fair bit'."}, {"viet": "Tuy nhiên, chúng tôi giới thiệu với ông mẫu mới, đây là một mẫu có cải tiến rất nhiều.", "eng": "However, we recommend you the new model, which is a great improvement."}, {"viet": "Tôi muốn mua một vé một chiều đi Glasgow.", "eng": "I'd like a one-way ticket to Glasgow, please."}, {"viet": "Tôi thà ở nhà còn hơn là đi với anh.", "eng": "I'd rather stay at home than go with you."}, {"viet": "Tôi sẽ gọi thêm món phụ khoai tây chiên.", "eng": "I'll have a side order of French fries."}, {"viet": "Tôi sẽ làm cho cô ta vui hơn một chút bằng cách mời cô ta đến dự tiệc.", "eng": "I'll sweeten her up a bit by inviting her to the party."}, {"viet": "Tôi sợ ra ngoài phố vào buổi tối.", "eng": "I'm afraid to go out after dark in the city."}, {"viet": "Tối nay tôi sẽ đến chỗ khác.", "eng": "I'm going somewhere else this evening."}, {"viet": "Tôi rất biết ơn ông đã giúp đỡ chúng tôi.", "eng": "I'm much obliged to you for helping us."}, {"viet": "Tôi khá lo lắng khi anh định rời bỏ công ty.", "eng": "I'm rather alarmed that you're planning to leave the company."}, {"viet": "Tôi đang vật lộn để ăn hết phần ăn khổng lồ mà bạn tiếp tôi.", "eng": "I'm struggling to finish the huge helping you gave me."}, {"viet": "Tôi rất vui vì chúng ta đã đạt đến thoả thuận.", "eng": "I'm very glad we've come to an agreement."}, {"viet": "Suốt ngày tôi đã phải làm công việc trong nhà như trâu ngựa.", "eng": "I've been slaving at the housework all day."}, {"viet": "Tôi vừa có một cuộc trao đổi gay gắt với giám đốc.", "eng": "I've had an acrimonious exchange with the manager."}, {"viet": "Tôi chỉ có thời gian kịp xem lướt qua bản báo cáo.", "eng": "I've only had time to dip into the report."}, {"viet": "Tôi tán thành nhưng tôi không thể thay mặt cho các đồng sự của tôi được.", "eng": "I agree but I can't answer for my colleagues."}, {"viet": "Bác sĩ nói tôi sẽ gõ vào đầu gối của anh để thử phản xạ của anh.", "eng": "I am going to tap your knee to test your reflex said the doctor."}, {"viet": "Tôi thỏa thuận được với cha mẹ tôi để cho chúng tôi mượn xe của ông bà ấy.", "eng": "I arranged with my parents that we could borrow their car."}, {"viet": "Tôi chắc chồng của bạn rất hài lòng.", "eng": "I bet your husband is very pleased."}, {"viet": "Tôi không làm được câu hỏi thứ tư và thứ năm nhưng đã làm được tất cả các câu hỏi khác.", "eng": "I can't do the fourth and fifth questions but I've done all the others."}, {"viet": "Mình không thể nào nhận ra được sự khác nhau giữa chúng.", "eng": "I can't spot the difference between them."}, {"viet": "Tôi có thể trả anh 20 pao bây giờ nhưng tôi nợ lại 10 pao kia.", "eng": "I can pay you £ 20 now but I'll owe you the other £ 10."}, {"viet": "Tôi chẳng thấy nó ở đâu cả.", "eng": "I can't see it anywhere."}, {"viet": "Tôi có thể nhìn thấy một bóng người ở phía xa nhưng tôi không nhận ra là ai.", "eng": "I could see a figure in the distance, but I couldn't make out who."}, {"viet": "Tôi muốn tập lặn với bình khí nén.", "eng": "I'd like to give SCUBA diving a try."}, {"viet": "Tôi đã nói huỵch toẹt: tôi bảo hắn là một thằng ngu.", "eng": "I didn't mince matters: I said he was an idiot."}, {"viet": "Tôi cảm thấy không đủ sức đi làm hôm nay.", "eng": "I don't feel up to going to work today."}, {"viet": "Tôi không thích cách bố trí màu sắc trong phòng khách của họ.", "eng": "I don't like the colour scheme in their sitting-room."}, {"viet": "Tôi không hiểu lý lẽ của anh, anh có thể nói rõ thêm một chút ý của anh được không?", "eng": "I don't understand your argument, could you explain yourself a bit more?"}, {"viet": "Tôi không biết nói cái này bằng tiếng Anh như thế nào.", "eng": "I don't know how to say it in English."}, {"viet": "Tôi rất thích buổi vui tối đó, nhưng riêng bữa ăn hôm ấy thì không ngon lắm.", "eng": "I enjoyed the evening, but the meal wasn't specially good."}, {"viet": "Tôi cảm thấy có ai giật mạnh ở tay áo.", "eng": "I felt a twitch at my sleeve."}, {"viet": "Tôi nhận thấy đó là một chuyện kinh dị phát chán-rất nhạt nhẽo.", "eng": "I found it a disappointing thriller-very milk and water stuff."}, {"viet": "Tôi ở trong một tình trạng hết sức căng thẳng trước đèn đường vì vậy tôi thi hỏng bằng lái xe.", "eng": "I got in an awful fluster at the traffic lights so I failed my driving test."}, {"viet": "Tôi bị đau răng quá và quyết định đi nhổ chiếc răng đau.", "eng": "I had bad toothache and decided to have the offending tooth removed."}, {"viet": "Tôi rất ghét khi máy vi tính bị treo máy.", "eng": "I hate it when my computer freezes up."}, {"viet": "Tôi ớn với những nhận xét ranh mãnh của cậu lắm rồi.", "eng": "I have had enough of your cute remarks."}, {"viet": "Tôi nhớ loáng thoáng về ngày đó.", "eng": "I have some recollection of that day."}, {"viet": "Tôi chưa thực sự hiểu được hoàn toàn các thông tin.", "eng": "I haven't really absorbed all information yet."}, {"viet": "Tôi nghe nói Michelle sẽ kết hôn vào tháng 6.", "eng": "I heard that Michelle is getting married in June."}, {"viet": "Tôi hy vọng anh có thể tìm đúng đường về nhà.", "eng": "I hope you can find your way home."}, {"viet": "Ngay từ đầu phim tôi đã biết là tôi không thích rồi.", "eng": "I knew early on the film that I wasn't going to enjoy it."}, {"viet": "Trong một phút thiếu suy nghĩ tôi đã cho hắn vay 5 bảng Anh.", "eng": "I lent him £ 5 in a moment of rashness."}, {"viet": "Tôi sẽ yêu cầu họ làm vậy bằng fax.", "eng": "I'll ask them to do so by Fax."}, {"viet": "Vậy tôi sẽ dùng dịch vụ cấp tốc.", "eng": "I'll have the express then."}, {"viet": "Tôi mất 5 đô la trong cuộc đua nhưng đó chỉ là chuyện vặt.", "eng": "I lost $ 5 at the races, but that's only a flea bite."}, {"viet": "Tôi rất vui vì cuối cùng tôi cũng đã liên lạc được với ông.", "eng": "I'm glad I've got hold of you at last."}, {"viet": "Tôi không chắc liệu đó có phải là một ý kiến hay hay không.", "eng": "I'm not sure if that is a good idea."}, {"viet": "Tôi rất lấy làm tiếc về việc đó.", "eng": "I'm very sorry for that."}, {"viet": "Tôi cần phải yêu cầu anh đừng có làm như thế nữa.", "eng": "I must ask you not to do that again."}, {"viet": "Tôi hầu như không cần phải nói là tôi rất bối rối lo ngại.", "eng": "I need hardly say that I was very upset."}, {"viet": "Ngày nghỉ cuối tuần tôi thường đi câu cá hồi.", "eng": "I often go fishing at weekends fishing for salmon."}, {"viet": "Con thích xem cái gì đó vui nhộn hơn.", "eng": "I prefer to watch something funny."}, {"viet": "Tôi thực sự làm hỏng các cơ hội của mình vì đã đối đáp kém cỏi trong cuộc phỏng vấn.", "eng": "I really mucked up my chances by doing badly in the interview."}, {"viet": "Tôi đã đặt trước một bàn dùng bữa trà sáng cho ngày mai.", "eng": "I reserved a table for morning tea tomorrow."}, {"viet": "Tôi được biết qua báo chí là ở Pháp sắp có cuộc tổng tuyển cử.", "eng": "I see that there is going to be a general election in France."}, {"viet": "Tôi muốn nói vài lời để giải thích.", "eng": "I should say a few words by way of explanation."}, {"viet": "Tôi vấp một rễ cây suýt nữa thì ngã.", "eng": "I stumbled over a tree root."}, {"viet": "Tôi nghĩ quần áo của cô ấy rất gợi cảm.", "eng": "I think her outfits are so sensuous."}, {"viet": "Tôi nghĩ rằng đó là cách tốt nhất để thắng cử, thay vì che giấu những quan điểm của ông.", "eng": "I think that is the best way to win an election, instead of hiding your views."}, {"viet": "Tôi đã nghĩ anh ta không thể giữ được thăng bằng trên sợi dây mỏng manh đó.", "eng": "I thought that he couldn't keep his balance on that tiny string."}, {"viet": "Tôi cố gắng thuyết phục cô ấy thôi đi, nhưng cô ấy không thay đổi ý kiến.", "eng": "I tried to talk her out of it, but she was adamant."}, {"viet": "Trước đây tôi không hề nghĩ họ lại có liên quan với nhau.", "eng": "I've never connected them before."}, {"viet": "Tôi muốn tổ chức tiệc cưới của tôi ở đây.", "eng": "I want to have my wedding reception here."}, {"viet": "Tôi khó chịu vì những nhận xét lạnh lùng của nó.", "eng": "I was annoyed by his insensitive remarks."}, {"viet": "Tôi ở trong một tình trạng khó xử không biết có nên đi không.", "eng": "I was in a quandary about whether to go."}, {"viet": "Tôi đã mệt nhoài đến nỗi ngủ thiếp đi trên đường về.", "eng": "I was so tired out that I fell asleep on the way back."}, {"viet": "Tôi xem các vũ công quay nhanh ngang qua sàn nhảy.", "eng": "I watched the dancers twirling across the floor."}, {"viet": "Tôi mong muốn người ta không làm sột soạt các tờ chương trình khi có độc tấu.", "eng": "I wish people wouldn't rustle their programmes during the solos."}, {"viet": "Tôi tự hỏi không biết anh có điền đơn cho tôi được không?", "eng": "I wonder if you would fill in the form for me?"}, {"viet": "Tôi muốn gọi số điện thoại này.", "eng": "I would like to call this number."}, {"viet": "Mình chẳng có gì phải dây với đồ cặn bã đó.", "eng": "I wouldn't have anything to do with those scum."}, {"viet": "Nếu nguồn viện trợ của nước ngoài mà cạn thì tình hình sẽ tuyệt vọng.", "eng": "If foreign aid dries up the situation will be desperate."}, {"viet": "Nếu trong trường hợp cần thiết, chúng ta sẽ phải bán nhà.", "eng": "If it comes to the pinch, we shall have to sell the house."}, {"viet": "Nếu có điều gì tôi không thể dung thứ được, thì đó là tính bừa bãi.", "eng": "If there's one thing I can't do with, it's untidiness."}, {"viet": "Nếu anh có dư sữa anh có thể cho tôi một ít không?", "eng": "If you've got any spare milk, could you give me a little?"}, {"viet": "Nếu anh không trả lại tài sản cho chúng tôi, chúng tôi sẽ kiện.", "eng": "If you don't return our property, we'll sue."}, {"viet": "Nếu cậu treo vài bức tranh lên tường, gian phòng trông sẽ sáng sủa hơn.", "eng": "If you put some pictures on the wall the room will look brighter."}, {"viet": "Nếu khoản tiền nợ của anh vượt quá tài sản của anh thì anh có thể bị phá sản.", "eng": "If your liabilities exceed your assets, you'll may go bankrupt."}, {"viet": "Trong lúc tìm cách cứu một em bé khỏi chết đuối, chị ấy suýt bỏ mạng.", "eng": "In attempting to save a child from drowning, she nearly lost her own life."}, {"viet": "Trong nghề của mình, anh ta thường phải tiếp xúc với các ngôi sao điện ảnh.", "eng": "In his job he's rubbing shoulders with film stars all the time."}, {"viet": "Về kích thước, những vùng đất này khác nhau rất nhiều.", "eng": "In size these lands vary greatly."}, {"viet": "Để bảo đảm an toàn, không được phép hút thuốc.", "eng": "In the interest of safety, no smoking is allowed."}, {"viet": "Vì thời tiết, chúng ta sẽ bỏ cuộc đi chơi.", "eng": "In view of the weather, we will cancel the outing."}, {"viet": "Các nhân viên điều tra đã tìm thấy một đường hào chứa hài cốt người.", "eng": "Investigators found a trench containing human remains."}, {"viet": "Có gì đặc biệt đang diễn ra ở đó à?", "eng": "Is something special going on there?"}, {"viet": "Có màu đặc biệt nào anh thích không?", "eng": "Is there particular colour you would prefer?"}, {"viet": "Đây là trò lừa bịp-chúng để năm cái nhãn khác nhau lên các chai và bán đắt hơn giá thật gấp năm lần.", "eng": "It's a fiddle-they put five different labels on the bottles and sell them at five times the proper price."}, {"viet": "Cái xe đạp cũ này mà đòi giá cao như thế thật là một lối ăn cắp vô liêm sỉ!", "eng": "It's barefaced robbery asking such a high price for that old bicycle!"}, {"viet": "Thay vì khói trong đô thị, hít thở không khí đồng quê trong lành thật là tốt.", "eng": "It's good to breathe fresh country air instead of city smoke."}, {"viet": "Thật hay khi có một cái áo khoác mới để mặc vào mùa đông,.", "eng": "It's nice to have a new coat for the winter."}, {"viet": "Mọi người đều biết là cô ấy sắp sinh con.", "eng": "It's public knowledge she's expecting a baby."}, {"viet": "Ở đây tối quá, tôi không nhìn thấy gì cả.", "eng": "It's too dark in here, I can't see anything."}, {"viet": "Nó có ích khi tôi phải làm dự án.", "eng": "It comes in handy when I have projects to do."}, {"viet": "Đó là món thịt rắn và thịt mèo hầm.", "eng": "It is a stew of snake meat and cat meat."}, {"viet": "Tôi tin chắc rằng quyết định đó là một sai lầm.", "eng": "It is my persuasion that the decision was a mistake."}, {"viet": "Chỉ có điều bỏ đi không phải là phong cách của tôi.", "eng": "It isn't just my style to leave."}, {"viet": "Đây là một chỗ tốt để bắt cá.", "eng": "It's a good place to fish."}, {"viet": "Ngày mai chắc chắn trời mưa.", "eng": "It's sure to rain tomorrow."}, {"viet": "Chắc chắn hôm nay trời nóng và oi bức.", "eng": "It sure is hot and muggy today."}, {"viet": "Hôm qua ở đây là một ngày nóng như thiêu như đốt.", "eng": "It was absolutely blazing here yesterday."}, {"viet": "Thật là vui khi nghe được tin bạn.", "eng": "It was nice hearing from you."}, {"viet": "Anh mang theo ô thật là khôn ngoan.", "eng": "It was very sensible of you to bring your umbrella."}, {"viet": "Ông ấy sẽ mất 7 ngày để nhận được tiền gửi.", "eng": "It would take seven days for him to receive the remittance."}, {"viet": "John đã xoay ra sưu tập tem, nó có vẻ thực sự say mê công việc này.", "eng": "John's taken up stamp-collecting, he seems really bitten by it."}, {"viet": "Chỉ một trong vô số vấn đề, lý do, v. v.", "eng": "Just one of a multitude of problems, reasons, etc."}, {"viet": "Sau cùng, chúng tôi đi tham quan Athens rồi từ đó đáp máy bay về nước.", "eng": "Lastly, we're going to visit Athens, and fly home from there."}, {"viet": "Thế thì chúng ta hãy đi thăm bạn ấy đi.", "eng": "Let's all go and visit her."}, {"viet": "May mắn là những tài nguyên thiên nhiên to lớn như hồ, núi, và bờ biển rộng lớn trong nước cho phép người Mỹ có khoảng không gian họ cần để vui chơi.", "eng": "Luckily, the great natural resources such as lakes, mountains and vast seacoasts in the country allow Americans the space they need to enjoy themselves."}, {"viet": "Nhiều người nghiên cứu sự di trú của loài chim.", "eng": "Many people study the migration of birds."}, {"viet": "Sự tầm thường vô vị của văn hoá quần chúng đang giết chết linh hồn chúng ta và làm mọi người trở thành chai sạn.", "eng": "Mass-culture banality is killing our souls and making everybody affectless."}, {"viet": "Cho phép tôi thử một chiếc giường nhé?", "eng": "May I try one of the bunks?"}, {"viet": "Hầu hết tiền được phát hành ở dạng đa đơn vị.", "eng": "Most currencies are issued in multiple denominations."}, {"viet": "Ông Smith sẽ đi Thượng Hải vào ngày hôm sau.", "eng": "Mr. Smith is leaving for Shanghai the next day."}, {"viet": "Tất cả các anh em trai của tôi và tôi đều có nhà ở đó.", "eng": "My brothers and I all have houses there."}, {"viet": "Chuyến bay của tôi bị chậm vì thế tôi có điều kiện tốt để đi mua sắm.", "eng": "My flight was delayed so it was a good opportunity for doing some shopping."}, {"viet": "Ông hàng xóm của tôi mặc quần áo ngủ làm việc, thật khó chấp nhận.", "eng": "My neighbour wears his dressing-gown to work, the mind boggles."}, {"viet": "Chiếc đồng hồ đeo tay của tôi không kêu tích tắc vì nó chạy bằng điện.", "eng": "My watch doesn't tick because it's electric."}, {"viet": "Thành phố New York cũng được người ta biết đến là “ ô Quả táo lớn ”.", "eng": "New York city is also known as the Big apple."}, {"viet": "Không, nhiều khung được làm bằng thép.", "eng": "No, many are made of steel."}, {"viet": "Không có một ai khác trong gia đình cho một cái gì để bán lấy tiền góp quỹ cứu tế, ngoài chị tôi là một người hào hiệp.", "eng": "Nobody else in the family gave anything for the jumble sale, but my sister came up trumps."}, {"viet": "Bây giờ anh đã được thừa hưởng một ít tiền, anh có đủ điều kiện để sống xả láng một tí.", "eng": "Now you've been left some money you can afford to live it up a bit."}, {"viet": "À, đó là một loại trà xanh có mùi hoa nhài.", "eng": "Oh, it's a kind of green tea with the smell of jasmine."}, {"viet": "Trong một chuyến đi vận động tranh cử từng chặng khắp nước.", "eng": "On a whistle-stop tour of the country."}, {"viet": "Người ta không thích ai nghi ngờ lời nói của mình.", "eng": "One does not like to have his word doubted."}, {"viet": "Giá mà ta có một nguồn tiền vô tận!", "eng": "Only one had an unlimited supply of money!"}, {"viet": "Hoá đơn tiền điện của chúng ta đã vượt mức chúng ta có thể chi trả-chúng ta phải bắt đầu tiết kiệm.", "eng": "Our electricity bills are higher than we can afford-we must start to economize."}, {"viet": "Loại mẫu mới của chúng tôi đã được chuẩn bị xong và sẽ có bán vào mùa thu.", "eng": "Our new model is already on the stocks and will be available in the autumn."}, {"viet": "Làng chúng tôi quá nhỏ bé nên đến biển chỉ đường cũng không có.", "eng": "Our village is so small it's not even signposted."}, {"viet": "Hành khách có thể đi qua trên cây cầu dành cho người đi bộ.", "eng": "Passengers may cross by the footbridge."}, {"viet": "Người ta vẫn thường tưởng ( rằng ) trái đất dẹt.", "eng": "People used to believe ( that ) the world was flat."}, {"viet": "Vui lòng chỉ cho tôi đường ngắn nhất đến đó.", "eng": "Please show me the fastest way to get there."}, {"viet": "Mưa ngăn cản những hoạt động thể thao tại đại hội thể thao.", "eng": "Rain hampered the proceedings at the sports meet."}, {"viet": "Lấy dao đánh dấu những cây sẽ phải hạ.", "eng": "Score the trees that are due to be felled."}, {"viet": "Món ăn Thượng Hải có khá nhiều dầu mỡ, còn món ăn Bắc Kinh thì mặn và có nhiều gia vị.", "eng": "Shanghai food is rather oily and Beijing food is salty and spicy."}, {"viet": "Cô ta lúc nào cũng phàn nàn chuyện thiếu các phương tiện thể thao ở trong thành phố.", "eng": "She's always lamenting the lack of sports facilities in town."}, {"viet": "Cô ta mắc chứng hoang tưởng về những điều người khác nghĩ về cô ta.", "eng": "She's getting paranoid about what other people think of her."}, {"viet": "Cô ấy không có trong văn phòng nhưng chưa hẳn là cô ấy ốm.", "eng": "She's not in the office but it doesn't necessarily follow that she's ill."}, {"viet": "Cô ta bị gò bó đến nỗi không thể cười trước những lới bông đùa về tình dục.", "eng": "She's too inhibited to laugh at the jokes about sex."}, {"viet": "Cô ấy với tôi cùng chung cảnh ngộ: cả hai chúng tôi đều thi trượt.", "eng": "She and I are in the same boat: we both failed the exam."}, {"viet": "Bà ấy không thể cho khách ở lúc này.", "eng": "She can't accommodate guests at the moment."}, {"viet": "Cô ta không thể xóa sự kiện đó ra khỏi tâm trí của cô ta.", "eng": "She couldn't erase the incident from her memory."}, {"viet": "Bà ấy chết do hậu quả của việc hít phải khói.", "eng": "She died from the aftereffects of smoke inhalation."}, {"viet": "Cô ta cảm thấy ( mình ) có phần bị đối xử không công bằng.", "eng": "She feels ( she's been ) rather hard done by."}, {"viet": "Mọi vẻ bề ngoài của cô ta đều cho thấy là cô ta cực kỳ giàu có.", "eng": "She gave every appearance of being extremely rich."}, {"viet": "Cô ấy có một giấy phép đi xe lửa không mất tiền.", "eng": "She had a pass that entitled her to free travel on the railway."}, {"viet": "Cô ấy có nhiều ý kiến hay, ví dụ như..", "eng": "She has a lot of good ideas, for instance.."}, {"viet": "Cô ấy đã đi khắp thế giới.", "eng": "She has traveled all a round the globe."}, {"viet": "Cô ấy được thiên phú cho một tài năng to lớn và một nghị lực phi thường.", "eng": "She is blessed with immense talent and boundless energy."}, {"viet": "Bà ấy không phải là người phụ nữ bình thường-mà là Nữ hoàng.", "eng": "She isn't just any woman-she's the Queen."}, {"viet": "Cô ấy sống ở nhà cho đến khi cô ấy lấy chồng.", "eng": "She lived at home right up until she got married."}, {"viet": "Cô ấy tiêu số tiền ít ỏi được lâu.", "eng": "She makes a little money go a long way."}, {"viet": "Bà ta mở cửa phòng ngủ và đi vào.", "eng": "She opened the bedroom door and went in."}, {"viet": "Cô ta long trọng xác nhận là trước đó chưa bao giờ nhìn thấy người đàn ông bị buộc tội.", "eng": "She protested that she had never seen the accused man before."}, {"viet": "Cô ta đã vượt lên khó khăn và trở thành một con người thành đạt lớn.", "eng": "She rose above her difficulties and became a tremendous success."}, {"viet": "Cô ấy đảm trách việc đặt chỗ trước.", "eng": "She's in charge of bookings."}, {"viet": "Khi chúng tôi gặp nhau năm rồi, cô ta đã nói là cô ta sẽ không lập gia đình.", "eng": "She said she wasn't going to get married when we met last year."}, {"viet": "Cô ấy chia sẻ cả những phiền muộn cũng như niềm vui với tôi.", "eng": "She shares in my troubles as well as my joys."}, {"viet": "Cô ấy dành thời gian chăm sóc bố già.", "eng": "She spends her time nursing her old father."}, {"viet": "Cô ta đã đánh đổi ghế của chúng tôi, thành thử tôi ngồi ghế của cô ấy và cô ấy ngồi ghế của tôi.", "eng": "She swapped our chairs, so I had hers and she had mine."}, {"viet": "Chị ấy thết mỗi đứa con một que kem.", "eng": "She treated each of the children to an ice-cream."}, {"viet": "Bà ta muốn xén bớt hàng rào nhưng người hàng xóm phản đối.", "eng": "She wanted to cut down the hedge, but her neighbour objected."}, {"viet": "Người và mặt cô ta bị bỏng nặng.", "eng": "She was badly burned on the face and body."}, {"viet": "Lúc nào cô ta cũng cứ nghĩ đến tin tức đó.", "eng": "She was full of the news."}, {"viet": "Cô ta vẫn chưa chắc là có nên tin hắn không.", "eng": "She was not yet sure if she could trust him."}, {"viet": "Cô ta nhanh chóng lẫn vào đám đông không thấy nữa.", "eng": "She was soon lost from view among the crowd."}, {"viet": "Cô ta bị góa chồng lúc còn trẻ.", "eng": "She was widowed at an early age."}, {"viet": "Cô ta đã đánh điện cho chúng tôi báo là cô ta sẽ bị chậm trễ.", "eng": "She wired us that she would be delayed."}, {"viet": "Cô ta sẽ không ngại ngần gì mà không nói dối nếu cô cho điều đó là có ích.", "eng": "She wouldn't scruple to tell a lie if she thought it would be useful."}, {"viet": "Tỏ ra rất có tài kể chuyện.", "eng": "Show great skill at telling stories."}, {"viet": "Vì chiến tranh, ngành công nghiệp đã dần dần giảm sút.", "eng": "Since the war the industry has gradually languished."}, {"viet": "Nhét một chiếc phong bì vào túi mình.", "eng": "Slip an envelope into one's pocket."}, {"viet": "Vì vậy, anh có thể đề nghị một số cách để nghiên cứu thị trường sâu rộng hơn nữa không?", "eng": "So, can you suggest some lines for further market research?"}, {"viet": "Sự xói mòn đất do mưa và gió là một vấn đề nghiêm trọng ở đây.", "eng": "Soil erosion by main and wind is a serious problem here."}, {"viet": "Một vài người tự nhiên nổi tiếng.", "eng": "Some men have greatness thrust upon them."}, {"viet": "Một số tôn giáo sử dụng nghi thức nhiều hơn các tôn giáo khác.", "eng": "Some religions employ ritual more than others."}, {"viet": "Sự việc hiển nhiên đối với tất cả chúng ta.", "eng": "Something that is manifest to all of us."}, {"viet": "Diễn giả đã kích động đám đông vào ( một tình trạng ) điên cuồng.", "eng": "Speaker worked the crowd up into a ( state of ) frenzy."}, {"viet": "Bắt đầu các dự án là một chuyện, hoàn tất chúng lại là một chuyện khác.", "eng": "Starting projects is one thing, following them through is another."}, {"viet": "Đừng có mà đắc chí chỉ vì mày đấu thắng!", "eng": "Stop gloating-just because you won the game!"}, {"viet": "Sinh viên phải học một năm dự bị trước khi bắt đầu khoá học chính thức.", "eng": "Students have to do a year's preparation before they start the degree course proper."}, {"viet": "Những nguyên tắc như thế này trái với tôn giáo của chúng ta.", "eng": "Such principles are alien to our religion."}, {"viet": "Chắc chắn nó không có kỳ vọng hiểu biết chút ít gì về âm nhạc đâu!", "eng": "Surely he doesn't pretend to any understanding of music!"}, {"viet": "Nhận hoàn toàn trách nhiệm về những hậu quả.", "eng": "Take full responsibility for the consequences."}, {"viet": "Các giáo viên tiết lộ với báo chí rằng họ sẽ bãi công như thế nào.", "eng": "Teachers revealed to the press that they were going on strike."}, {"viet": "Những cuộc tiến công của bọn khủng bố làm cho vị trí của chúng ta rất nguy hiểm.", "eng": "Terrorist attacks made our positions very unhealthy."}, {"viet": "Ông bạn ơi, đó là bí mật có lẽ sẽ không bao giờ được giải quyết đâu.", "eng": "That's my friend, is a mystery which will probably never be solved."}, {"viet": "Nước đó nằm trong phạm vi ảnh hưởng của Mỹ.", "eng": "That country is in America's sphere of influence."}, {"viet": "Cái nắp đó là của cái lọ này.", "eng": "That lid belongs to this jar."}, {"viet": "Thế thì hơi quá lâu đấy.", "eng": "That's a bit too long."}, {"viet": "Thủ đoạn như vậy đối với cô ta thật đáng khinh.", "eng": "That was a cheap trick to play on her."}, {"viet": "Tai nạn đã xảy ra khi máy bay phản lực sắp cất cánh.", "eng": "The accident happened as the jet was about to take off."}, {"viet": "Sự quản trị các công việc về văn học của nước này tất nhiên rơi vào tay các người chào hàng lì lợm và những kẻ trộm cắp.", "eng": "The administration of the nation's literary affairs falls naturally into the hands of touts and thieves."}, {"viet": "Quần chúng Mỹ không còn ủng hộ cuộc chiến ở Việt Nam.", "eng": "The American public stopped supporting the war in Vietnam."}, {"viet": "Số lượng trẻ con trong trường học xấp xỉ là 300.", "eng": "The approximate number of children in the school is 300."}, {"viet": "Pháo binh bắn yểm trợ cho chúng tôi.", "eng": "The artillery gave us covering fire."}, {"viet": "Ban giám hiệu ca thán về các hành vi xấu xa của các sinh viên.", "eng": "The authorities damned the bad behaviour of the students."}, {"viet": "Sự thật đơn giản là anh đã hao phí tiền.", "eng": "The bald truth is that you have wasted your money."}, {"viet": "Cái chậu đầy các đồ nôn mửa.", "eng": "The basin was full of sick."}, {"viet": "Cách tốt nhất để có sự thay đổi về chính trị là qua thùng phiếu.", "eng": "The best way to obtain political change is through the ballot box."}, {"viet": "Hoa trên cây cối trông rất đẹp vào mùa xuân.", "eng": "The blossom on the trees looks lovely in the springtime."}, {"viet": "Cuốn sách đó vừa là một cuốn hấp dẫn vừa là một tác phẩm làm mọi người hài lòng.", "eng": "The book is a page-turner as well as satisfying read."}, {"viet": "Câu trả lời của cậu học trò đối với thầy giáo gần như là vô lễ.", "eng": "The boy's reply to his teacher was bordering on rudeness."}, {"viet": "Cái cầu rung chuyển khi xe tải đi qua.", "eng": "The bridge trembled as the lorry crossed it."}, {"viet": "Xe buýt đến sớm năm phút.", "eng": "The bus arrived five minutes early."}, {"viet": "Cái mũ đó cần phải xoay lại dễ dàng.", "eng": "The cap should twist off easily."}, {"viet": "Chiếc xe ô tô phanh rít lên dừng lại với tiếng kêu ken két.", "eng": "The car screeched to a halt with grinding brakes."}, {"viet": "Vuốt nhọn của con mèo đâm thủng da của tôi.", "eng": "The cat's sharp claws penetrated my skin."}, {"viet": "Sự thách thức của nguồn cung cấp lương thực trong tương lai lên tới mức quan trọng nhất.", "eng": "The challenge of our future food supply is approaching criticality."}, {"viet": "Đứa trẻ đó khiêu vũ quanh phòng để khoe với mọi người.", "eng": "The child danced around the room, showing off to everybody."}, {"viet": "Những đứa trẻ luôn luôn cãi cọ nhau về đồ chơi của chúng.", "eng": "The children are always bickering with one another over then toys."}, {"viet": "Bọn trẻ mỉm cười lịch sự trước những lời pha trò của khách.", "eng": "The children smiled politely at the visitor's pleasantries."}, {"viet": "Giáo hội Thiên Chúa giáo phải có trách nhiệm lên án bạo lực.", "eng": "The Church has a duty to condemn violence."}, {"viet": "Những người leo núi đã lên tới đỉnh Everest sáng hôm qua.", "eng": "The climbers reached the summit of Mount Everest yesterday morning."}, {"viet": "Sự sụp đổ của doanh nghiệp đó là một đòn chí mạng đối với ông ta và gia đình của ông ta.", "eng": "The collapse of the business was a mortal blow to him and his family."}, {"viet": "Đảng cộng sản đã liên kết với những người của Đảng xã hội.", "eng": "The Communist Party has aligned itself with the Socialists."}, {"viet": "Công ty có doanh số 150 triệu pao một năm.", "eng": "The company turns over 150 million pounds a year."}, {"viet": "Những phân tử cấu tạo không khí, nước.", "eng": "The constituent elements of air, of water."}, {"viet": "Hội đồng đã gây sức ép với chủ đất để cải thiện khu đất của ông ta.", "eng": "The council brought pressure to bear on the landholder to improve his property."}, {"viet": "Toà án quyết định phạt 5000 pao bồi thường cho người bị thương.", "eng": "The court awarded 5000 pounds in damages to the injured man."}, {"viet": "Gần cuối trận đấu, sự phấn khích của đám đông ngày càng tăng lên.", "eng": "The crowd's excitement grew near the end of the match."}, {"viet": "Nhiệm vụ canh gác của người bảo vệ.", "eng": "The custodial duties of a security guard."}, {"viet": "Án tử hình đã được bãi bỏ ở một số nước Âu châu.", "eng": "The death penalty has been done away with in many European countries."}, {"viet": "Cả ban ngành mang ơn Amanda trong những năm bà lãnh đạo-bà làm quá thành công đến nỗi khó ai có thể làm tốt như vậy.", "eng": "The department owes a lot to Amanda for her years of leadership-she's a hard act to follow."}, {"viet": "Sự giảm bớt nguồn cung cấp của mình.", "eng": "The diminution of one's resources."}, {"viet": "Cách chữa của bác sĩ đã giảm bớt đau đớn đôi phần.", "eng": "The doctor's treatment gave some relief."}, {"viet": "Bộ phim tài liệu này bàn đến vấn đề đó khá chi tiết.", "eng": "The documentary treated the question in some detail."}, {"viet": "Bác sĩ bấm chuông gọi bệnh nhân kế tiếp.", "eng": "The door buzzed for the next patient."}, {"viet": "Khu vực khô ở Sri Lanka nằm ở phía bắc và phía đông của đảo.", "eng": "The dry zone in Sri Lanka is situated to the north and east of the island."}, {"viet": "Chiến dịch bầu cử đã bước vào giai đoạn căng thẳng.", "eng": "The election campaign has entered a critical phase."}, {"viet": "Eo biển Anh chia cách nước Anh với nước Pháp.", "eng": "The English Channel divides England from France."}, {"viet": "Tiến hóa sau này bao giờ cũng bao gồm cả tiến hóa trước đây.", "eng": "The evolutionary later always subsumes and includes the evolutionary earlier."}, {"viet": "Sự dập tắt một đám cháy, một phong trào chính trị, những hy vọng của tuổi trẻ.", "eng": "The extinction of a fire, a political movement, youthful hopes."}, {"viet": "Người chủ trại doạ suỵt chó ra cắn chúng tôi.", "eng": "The farmer threatened to set his dogs on us."}, {"viet": "Cuốn phim nói về các vụ mổ mắt làm tôi kinh sợ.", "eng": "The film about eyes operations turned my stomach."}, {"viet": "Những người lính cứu hoả cố gắng một cách vô vọng dập tắt đám cháy.", "eng": "The firefighters tried in vain to put out the fire."}, {"viet": "Những nốt đầu tiên của điệu nhạc.", "eng": "The first few notes of a tune."}, {"viet": "Cuộc triển lãm hoa do ông nghị sĩ của địa phương làm giám khảo.", "eng": "The flower show was judged by the local MP."}, {"viet": "Bốn người khiêng quan tài, nâng áo quan lên chầm chậm.", "eng": "The four bearers lifted the coffin slowly."}, {"viet": "Trận đấu mỗi lúc một thêm găng.", "eng": "The game is getting tenser all the time."}, {"viet": "Thuật ngữ chung cho rượu vang, rượu mạnh và bia là'đồ uống có chất cồn'.", "eng": "The generic term for wine, spirits and beer is'alcoholic beverages'."}, {"viet": "Tất cả những món hàng trưng bày đều có giá rất đắt.", "eng": "The goods on display are all very highly priced."}, {"viet": "Chính phủ đã đảo ngược chính sách kinh tế của mình.", "eng": "The government has done a U-turn on its economic policy."}, {"viet": "Chính phủ nhắm mắt làm ngơ trước cảnh nghèo khổ.", "eng": "The government shuts its eyes to poverty."}, {"viet": "Thành tựu lớn nhất của khoa học trong thập niên này.", "eng": "The greatest scientific achievement of the decade."}, {"viet": "Người khách trọ muốn ăn sáng tại phòng của ông ấy.", "eng": "The guest would like to have breakfast in his room."}, {"viet": "Hơi nóng đã làm bong sơn các cửa.", "eng": "The heat has taken the paint off the doors."}, {"viet": "Đội nhà đã trả giá đắt vì những lỗi lầm của hàng phòng ngự.", "eng": "The home team paid dearly for their defensive errors."}, {"viet": "Khách sạn đó bị cháy rụi.", "eng": "The hotel was completely burnt out."}, {"viet": "Những căn nhà trong làng này không có nước máy.", "eng": "The houses in this village are without water."}, {"viet": "Nhà xuất khẩu yếu cầu ngân hang thiết lập một thư tín dụng để trả cho nhà xuất khẩu.", "eng": "The importer asked the bank to establish a letter of credit in favor of the exporter."}, {"viet": "Động lực bên trong của tác phẩm nghệ thuật.", "eng": "The inner dynamic of work of art."}, {"viet": "Giai đoạn cách li của bệnh sởi là bảy ngày.", "eng": "The isolation period for German measles is seven days."}, {"viet": "Toà án kết án hắn một năm tù.", "eng": "The judge sentenced him for a year in prison."}, {"viet": "Phòng thí nghiệm không cho các học sinh vào trừ phi có mặt của một giáo viên.", "eng": "The laboratories are out-of-bounds to all pupils unless a teacher is present."}, {"viet": "Giá thị trường mới nhất của sở giao dịch chứng khoán.", "eng": "The latest quotations from stock exchange."}, {"viet": "Các hội nghị lập pháp của Mỹ.", "eng": "The legislative assemblies of the U. S. A."}, {"viet": "Các dòng mở đầu cho bài tường thuật dài của ông ta.", "eng": "The lines form a prelude to his long narrative."}, {"viet": "Cái chết của người vợ là một đòn nặng đối với ông ta.", "eng": "The loss of his wife was a great blow to him."}, {"viet": "Trọng tâm trong từ photography rơi vào âm tiết thứ ba kể từ cuối lên.", "eng": "The main stress in photography falls on the antepenultimate syllable."}, {"viet": "Hôm nay chợ búa ế ẩm.", "eng": "The market has been flat today."}, {"viet": "Thuốc đã gây ra một phản ứng mạnh.", "eng": "The medicine produced violent reaction."}, {"viet": "Chính phủ quân sự tống địch thủ của mình vào tù.", "eng": "The military government flung its opponents into prison."}, {"viet": "Thời hiện đại, thời đại hạt nhân, thời đại máy tính điện tử.", "eng": "The modern age, the nuclear age, the age of the microchip."}, {"viet": "Biến chuyển quan trọng nhất trong việc ngưng hút thuốc thành công chính là sự hậu thuẫn của bạn bè thân thiết có uy tín trong lối sống mới của người không hút thuốc.", "eng": "The most important variable in successful smoking cessation is the support of significant others in the new nonsmoker's life."}, {"viet": "Âm nhạc đem đến 90 phút thú vị.", "eng": "The music makes for 90 minutes of pleasure."}, {"viet": "Ông chủ mới là mối tai hoạ cho kẻ bất tài.", "eng": "The new boss was the scourge of the inefficient."}, {"viet": "Vị sĩ quan mới chẳng bao lâu đã chiếm được lòng kính trọng của binh sĩ mình.", "eng": "The new officer soon earned the respect of his men."}, {"viet": "Tin về tai nạn gây cho cô ta một cú sốc mạnh.", "eng": "The news of the accident gave her an quite a jolt."}, {"viet": "Người Norman đã chinh phục nước Anh 1066.", "eng": "The Normans conquered England in 1066."}, {"viet": "Chất dinh dưỡng trong đất là một tác nhân kích thích sự phát triển của cây cối.", "eng": "The nutrient in soil acts as a stimulus to growth to make the plant grow."}, {"viet": "Những túp lều cũ kỹ của tá điền đang được tô điểm như thể nhà nghỉ mát.", "eng": "The old farm workers'cottages are being prettified as holiday homes."}, {"viet": "Điều duy nhất mà bọn lừa đảo đó không làm là lột áo tôi.", "eng": "The only thing those swindlers didn't take was the shirt off my back."}, {"viet": "Kích thước toàn bộ của một căn phòng.", "eng": "The overall measurements of a room."}, {"viet": "Vận may của đảng lúc đó ở mức thấp nhất sau thất bại bầu cử.", "eng": "The party's fortunes were at their lowest level after the election defeat."}, {"viet": "Bệnh nhân bị bệnh tái lại và rồi tử vong.", "eng": "The patient suffered a relapse and then died."}, {"viet": "Người trong tấm ảnh này trong rất đẹp trai.", "eng": "The person in this picture is really cool."}, {"viet": "Chồng sách ngã nhào trên sàn.", "eng": "The pile of books toppled over onto the floor."}, {"viet": "Máy bay lượn tròn theo những vòng lớn.", "eng": "The plane flew round and round in wide loops."}, {"viet": "Vở kịch giống như quả trứng có hai phần, và phần tốt thật tuyệt vời.", "eng": "The play was rather like the curate's egg, and the good parts of it were excellent."}, {"viet": "Cảnh sát sai lầm tai hại khi bắt nhầm người.", "eng": "The police blundered badly by arresting the wrong man."}, {"viet": "Cảnh sát đã truy nã chiếc xe mất cắp dọc theo xa lộ.", "eng": "The police pursued the stolen vehicle along the motor way."}, {"viet": "Sự ô nhiễm ở những bãi biển của chúng ta vì dầu.", "eng": "The pollution of our beaches with oil."}, {"viet": "Khả năng ảnh hưởng đến thái độ dân chúng của sách báo.", "eng": "The power of the printed word to influence people's attitudes."}, {"viet": "Tổng thống ra lời kêu gọi đoàn kết quốc gia.", "eng": "The President made a call for national unity."}, {"viet": "Lối vào văn phòng làm việc của thủ tướng.", "eng": "The Prime Minister's entrance into office."}, {"viet": "Các tù nhân bị lùa lên xe lửa.", "eng": "The prisoners were herded onto the train."}, {"viet": "Việc phóng một tên lửa lên không trung.", "eng": "The projection of a missile through the air."}, {"viet": "Các chuyên gia không thống nhất ý kiến về cách tốt nhất để giải quyết vấn đề đó.", "eng": "The pundits disagree on the best way of dealing with the problem."}, {"viet": "Kỳ thi vấn đáp là một dịp tốt để biểu lộ kiến thức của anh ta.", "eng": "The quiz was a good opportunity for the exhibition of his knowledge."}, {"viet": "Điều lý thú thật sự là ông ta vừa là người mơ mộng vừa là một nhà khoa học.", "eng": "The real turn-on is that he is a visionary as well as a scientist."}, {"viet": "Hội dòng tu thánh Benedict.", "eng": "The religious fraternity of St Benedict."}, {"viet": "Kết quả gần như chúng ta đã chờ đợi.", "eng": "The result is pretty much what we expected."}, {"viet": "Những việc mạo hiểm đó đã được coi là không đáng kể.", "eng": "The risks were represented as negligible."}, {"viet": "Tên lửa đó được phóng đi vào buổi trưa.", "eng": "The rocket blasted off at noon."}, {"viet": "Những qui luật này không áp dụng cho tất cả mọi người.", "eng": "The rules do not apply universally."}, {"viet": "Sự thoả mãn một hy vọng, ước mơ, tham vọng, v. v.", "eng": "The satisfaction of a hope, desire, ambition, etc."}, {"viet": "Tỉ số trong trận ở sân một là 30-0.", "eng": "The score is the game on Court One is thirty-love."}, {"viet": "Lính bảo vệ đều ở tại vị trí canh gác của mình.", "eng": "The sentries are all at their posts."}, {"viet": "Con tàu lấy hành khách và len ở một cảng ôxtrâylia.", "eng": "The ship embarked passengers and wool at an Australian port."}, {"viet": "Cửa hàng này trước đây là của gia đình anh ấy.", "eng": "The shop was formerly owned by his family."}, {"viet": "Tiếng chim hót báo hiệu một ngày mới.", "eng": "The singing of the birds heralded the day."}, {"viet": "Khu vực được phép hút thuốc trong một máy bay.", "eng": "The smoking section of an aircraft."}, {"viet": "Vẻ mặt buồn bã của anh ta nói với chúng tôi là anh ta không sung sướng.", "eng": "The sombre, expression on his face, told us that he was unhappy."}, {"viet": "Bài nói đánh dấu sự mở đầu của cuộc tổng phản công của chúng tôi chống lại chính quyền quân sự.", "eng": "The speech marked the start of our counteroffensive against the military government."}, {"viet": "Bức tượng là vật nhắc nhở mãi mãi đến sự nghiệp to lớn của Trần Hưng Đạo.", "eng": "The statue is a lasting reminder of Tran Hung Dao's greatness."}, {"viet": "Dòng nước đã xói thành một con kênh trong cát.", "eng": "The stream had washed a channel in the sand."}, {"viet": "Ánh sáng bừng lên đột ngột của cây đuốc trong đêm tối.", "eng": "The sudden flare of a torch in the darkness."}, {"viet": "Hệ thống nhằm hoạt động có lợi cho giai cấp giàu có.", "eng": "The system tends to operate in favor of the wealthier classes."}, {"viet": "Giáo viên kiểm tra bài tập về nhà của học sinh.", "eng": "The teacher tested the children on their homeworks."}, {"viet": "Nhiệm kì của Tổng thống Hoa Kì là bốn năm.", "eng": "The tenure of the US. presidency is four years."}, {"viet": "Mối đe doạ của sự dư thừa nhân công bỗng nhiên được loại bỏ.", "eng": "The threat of redundancy was suddenly removed."}, {"viet": "Thành phố đã thay đổi rất nhiều kể từ khi tôi còn là một chàng trai.", "eng": "The town's changed a lot since I was a lad."}, {"viet": "Người khách du lịch làm chúng tôi hồi hộp bởi những câu chuyện của anh ta.", "eng": "The traveller thrilled us with his stories."}, {"viet": "Trên bức tranh nổi bật lên hai vệt màu này.", "eng": "The two colour spots tell in the picture."}, {"viet": "Sự sang trọng khác thường của việc đi du lịch rẻ tiền ra nước ngoài.", "eng": "The unaccustomed luxury of cheap foreign travel."}, {"viet": "Thung lũng ở độ cao 8000 fít trên mực nước biển.", "eng": "The valley lies at an altitude of about 8.000 ft."}, {"viet": "Không khí dơ bẩn của các vùng nội thành bị ô nhiễm.", "eng": "The vitiated atmosphere of our polluted inner cities."}, {"viet": "Đường đã thông bây giờ chúng ta có thể đi được.", "eng": "The way is free, we can make our escape now."}, {"viet": "Toàn bộ thành phố đã bị trận động đất phá huỷ.", "eng": "The whole town was destroyed by the earthquake."}, {"viet": "Người đàn bà ngồi trước mặt là một thám tử.", "eng": "The woman sitting opposite is a detective."}, {"viet": "Những người thuỷ thủ bị đắm tàu chỉ là những kẻ hoàn toàn bất lực giữa đại dương dữ dội.", "eng": "The wrecked sailors were but helpless toys in the raging ocean."}, {"viet": "Bữa tiệc cưới con gái họ hoàn toàn là một sự khoe của.", "eng": "Their daughter's wedding reception was sheer ostentation."}, {"viet": "Bố mẹ của họ lo lắng vì sự im lặng của họ.", "eng": "Their parents were disconcerted by their silence."}, {"viet": "Sau đó người ta mới khám phá ra là các bình đất sét nung trong lửa thì dùng tốt hơn.", "eng": "Then people found out that clay vessels baked in a fire were much better."}, {"viet": "Có một vở kịch mới sẽ diễn ở nhà hát địa phương tuần tới.", "eng": "There's a new play coming on at the local theatre next week."}, {"viet": "Không có đất cho tình cảm trong công việc kinh doanh.", "eng": "There's no room for sentiment in business."}, {"viet": "Có nhiều tác phẩm không phải là tiểu thuyết hư cấu mà lại rất hay.", "eng": "There are a lot of beautifully written works of nonfiction."}, {"viet": "Có những cái làm cơ thể chúng ta hơn hẳn bất cứ một thứ máy nhân tạo nào: nó có thể phát triển.", "eng": "There are other ways in which our bodies are far ahead of any man-made machine: They can grow."}, {"viet": "Đến một lúc nào đó chết còn đáng mong muốn hơn là sống.", "eng": "There comes a time There comes a time when dying seems preferable to staying alive."}, {"viet": "Trong sự phân loại tất cả các sinh vật, có một hệ thống thứ bậc.", "eng": "There is a hierarchy in the classification of all living creatures."}, {"viet": "Không cần thiết phải kiểu cách khoa trương như vậy.", "eng": "There is no need to indulge in such heroics."}, {"viet": "Có một chuyến bay lúc 10 giờ.", "eng": "There's a flight at ten o'clock."}, {"viet": "Toà lâu đài cổ có vẻ thơ mộng, trữ tình.", "eng": "There was an air of romance about the old castle."}, {"viet": "Bọn con trai kêu lên khi bọn con gái bắt đầu thắng.", "eng": "There were loud groans from the boys when the girls started to win."}, {"viet": "Những cuốn sách này là những cuốn rất ưa thích của tôi.", "eng": "These books are great favourites of mine."}, {"viet": "Những căn hộ mới này sẽ án ngữ tầm nhìn của chúng ta ra biển.", "eng": "These new flats will interrupt our view of the sea."}, {"viet": "Chúng là một nhóm nhỏ lũ buôn gian bán lận, trộm cướp và giết người lôi thôi lốc thốc.", "eng": "They're a small ragtag army of racketeers, bandits, and muzderers."}, {"viet": "Họ đã thu thêm 10 penni vào giá thuốc lá.", "eng": "They've slapped 10p on the price of cigarettes."}, {"viet": "Họ đang rút quân ra khỏi khu vực chiến trận.", "eng": "They are pulling their troops out of the battle zone."}, {"viet": "Họ không thể bị khởi tố vì sự vi phạm này-họ có quyền miễn trừ ngoại giao.", "eng": "They can't be prosecuted for this offence-they have diplomatic immune."}, {"viet": "Họ không cho tôi việc làm bởi vì bộ mặt tôi không thích hợp.", "eng": "They didn't give me the job because my face doesn't fit."}, {"viet": "Họ tìm thấy xác chết vùi dưới một đống lá.", "eng": "They found the body buried beneath a pile of leaves."}, {"viet": "Họ ít được khuyến khích để làm việc tích cực hơn.", "eng": "They have little inducement to work harder."}, {"viet": "Họ trông giống nhau, nói giống nhau, thậm chí nghĩ cũng giống nhau-họ là hai người thuộc cùng một loại.", "eng": "They look alike, talk alike, even think alike-they're two of a kind."}, {"viet": "Họ trả anh ta 5 pao để rửa xe.", "eng": "They paid him 5 pounds to wash the car."}, {"viet": "Họ đã tước đoạt quyền thừa hưởng tài sản của gia đình.", "eng": "They robbed the family of the inheritance."}, {"viet": "Họ chen chúc qua cổng để vào sân bóng đá.", "eng": "They squashed through the gate into the football ground."}, {"viet": "Người ta đã cảnh cáo cô ta là nếu còn làm như thế nữa cô ta sẽ bị bỏ tù.", "eng": "They warned her that if she did it again she would be sent to prison."}, {"viet": "Các tia này rất giống tia X quang nhưng không phải là X quang.", "eng": "They were much like X rays, but they were not X rays."}, {"viet": "Sương mù dày đặc làm mờ mắt người lái xe.", "eng": "Thick fog blurred the vision of the driver."}, {"viet": "Cậu học sinh xuất sắc này đã đem lại vẻ vang cho các thầy giáo của mình.", "eng": "This brilliant pupil is a credit to his teachers."}, {"viet": "Cuốn từ điển này có nhiều phụ lục, trong đó có một phụ lục về động từ bất quy tắc.", "eng": "This dictionary has several appendices including one on irregular verbs."}, {"viet": "Khách sạn này có phần nào đắt hơn khách sạn kia.", "eng": "This hotel is rather more expensive than that."}, {"viet": "Đây là ngày thứ năm của hội nghị.", "eng": "This is the fifth day of the conference."}, {"viet": "Tuần sau tạp chí này sẽ đăng một bài đặc biệt về giáo dục.", "eng": "This magazine will be running a special feature on education next week."}, {"viet": "Phải cách ly bệnh nhân này với người khác.", "eng": "This patient should be separated from the others."}, {"viet": "Ngôi trường này lớn gấp 3 lần ngôi trường cũ của tôi.", "eng": "This school is three times bigger than my old one."}, {"viet": "Chiếc lốp này hơi xẹp, phải bơm nó lên.", "eng": "This tyre is a bit flat, it needs blowing up."}, {"viet": "Tuy vương quyền của ông ta bị tranh chấp, ông vẫn tiếp tục cai trị trên thực tế.", "eng": "Though his kingship was challenged, he continued to rule de facto."}, {"viet": "Tom chia tiền cho ba đứa con của anh.", "eng": "Tom divided his money between his three children."}, {"viet": "Những bức tranh thú nhỏ đẹp không chê được.", "eng": "Unbearably cute paintings of little furry animals."}, {"viet": "Đính hôn với một người trong gia đình hoàng tộc.", "eng": "Was betrothed to a member of the royal family."}, {"viet": "Chúng ta sẽ ăn tại nhà hàng nào có bàn trống.", "eng": "We'll eat at whichever restaurant has a free table."}, {"viet": "Chúng ta khéo chậm mất, ta hãy đi tắc-xi.", "eng": "We're going to be late, let's get a taxi."}, {"viet": "Chúng tôi đang làm việc khẩn trương quên giờ giấc để hoàn thành bản báo cáo vào thứ sáu.", "eng": "We're working against the clock to finish the report by Friday."}, {"viet": "Chúng tôi vẫn còn có cơ may thắng lợi.", "eng": "We've still got a sporting chance of winning."}, {"viet": "Thậm chí chúng ta hơn các loài động vật có xương sống khác.", "eng": "We are event farther ahead of other animals with backbones."}, {"viet": "Chúng tôi dự lễ cầu kinh buổi tối cũng như đi lễ buổi sáng.", "eng": "We attended evensong as well as morning service."}, {"viet": "Chúng tôi có thể đưa cho bà hơn một chìa nếu bà muốn.", "eng": "We can give you more than one key if you wish."}, {"viet": "Chúng tôi có thể đến thăm triển lãm đó, nếu anh đồng ý.", "eng": "We could visit that exhibition, if you're agreeable."}, {"viet": "Chúng tôi rút thăm xe ai đi trước.", "eng": "We drew lost to see who should go first."}, {"viet": "Chúng tôi đã dự một bữa tiệc thịnh soạn ở đám cưới của Bill.", "eng": "We had a great nosh-up at Bill's wedding."}, {"viet": "Chúng tôi có giấy mời thường xuyên đến thăm họ khi chúng tôi ở vùng này.", "eng": "We have a standing invitation to visit them when we're in the area."}, {"viet": "Chúng tôi có ba món: xúp, thịt và rau và trái cây.", "eng": "We have three courses: soup, meat and vegetables, and fruit."}, {"viet": "Chúng tôi đã dừng lại ở Arizona trên đường đi California.", "eng": "We laid over in Arizona on the way to California."}, {"viet": "Chúng tôi cũng có thể ăn nốt chiếc bánh ngọt vì cũng không còn lại nhiều lắm.", "eng": "We might as well finish the cake, there isn't much left."}, {"viet": "Chúng ta phải cố gắng đưa công ty trở lại thế ổn định.", "eng": "We must try and get company back on an even keel."}, {"viet": "Chúng tôi đã chơi xỏ họ một vố và họ đã mắc bẫy ngay.", "eng": "We played a trick on them and they fell right into it."}, {"viet": "Chúng tôi phục vụ các món ăn Quảng Đông, Tứ Xuyên, Thượng Hải và Bắc Kinh.", "eng": "We serve Cantonese, Sichuan, Shanghai and Beijing cuisine."}, {"viet": "Chúng ta đột nhiên nhận ra sự tăng nhiệt độ rất mạnh.", "eng": "We suddenly became conscious of a sharp increase in the temperature."}, {"viet": "Chúng tôi muốn một ngày nghỉ yên tĩnh nhưng lại quên tính đến lũ trẻ.", "eng": "We wanted a quiet holiday, but we had reckoned without the children."}, {"viet": "Chúng tôi hoàn toàn mất phương hướng vì đường phố quanh co rắc rối.", "eng": "We were quite disorientated by the maze of streets."}, {"viet": "Chúng tôi muốn các ông tái xác nhận đơn đặt hàng này càng sớm càng tốt.", "eng": "We would like to get your confirmation of this order as soon as possible."}, {"viet": "À, tôi sẽ điểm danh nhé.", "eng": "Well, I'm going to take attendance."}, {"viet": "À tôi không biết phải nói như thế nào đây?", "eng": "Well how can I put it?"}, {"viet": "Lớp này ồn quá! thầy giáo nói.", "eng": "What a noisy class you are said the teacher."}, {"viet": "Vui lòng cho tôi biết ông muốn hiệu gì?", "eng": "What brand do you want, please?"}, {"viet": "Người Scotland mặc gì bên dưới ( bên trong ) cái váy của anh ta?", "eng": "What does a Scotsman wear ( underneath ) his kilt?"}, {"viet": "Dây cáp này chịu được sức căng bao nhiêu thì đứt?", "eng": "What is the breaking strain of this cable?"}, {"viet": "Mục đích đi Canada của anh là gì?", "eng": "What is your purpose in going to Canada?"}, {"viet": "Dân số của Nhật là bao nhiêu?", "eng": "What's the population of Japan?"}, {"viet": "Các anh em trai của anh làm nghề gì?", "eng": "What work do your brothers do?"}, {"viet": "Khi anh ấy chán nản, anh ngồi suy nghĩ ủ ê hàng giờ.", "eng": "When he's depressed he sits brooding for hours."}, {"viet": "Khi nào tiểu thuyết đó sẽ được xuất bản dưới dạng bìa mỏng.", "eng": "When is the novel coming out in paperback."}, {"viet": "Khi quả chín người ta cắt quả xuống và để cho chúng cho khô lại trong vài giờ.", "eng": "When the seed pods are ripe, they are cut from the tree and allowed to dry for the few hours."}, {"viet": "Mỗi lần có ai nhắc đến chủ đề về thịt là anh ta lại hùng hổ nói ăn thịt là độc ác và có hại đến thế nào.", "eng": "Whenever anyone mentions the subject of meat he gets on his soapbox and says how wicked and unhealthy meat eating is."}, {"viet": "Lối đi dành cho những chuyến bay chuyển tiếp ở đâu?", "eng": "Where is the passageway for connecting flights?"}, {"viet": "Cách nào trong số ba cách phát âm là cách thông thường nhất.", "eng": "Which of these three pronunciations is the most usual."}, {"viet": "Một vài người nổi tiếng ở đất nước bạn là những ai?", "eng": "Who are some famous people from your country?"}, {"viet": "Toàn bộ các làng đã bị phá huỷ toàn bộ trong các vụ ném bom.", "eng": "Whole villages were wiped out in the bombing raids."}, {"viet": "Tại sao anh có thành kiến với phụ nữ lái xe như vậy?", "eng": "Why have you got a prejudice against women drivers?"}, {"viet": "Anh có làm việc đó như một đặc ân dành riêng cho tôi không?", "eng": "Will you do it for me as a personal favour?"}, {"viet": "Con chim vỗ nhanh đôi cánh và bay đi.", "eng": "With a flicker of its wings the bird flew away."}, {"viet": "Những người phụ nữ mà không rụng trứng đều đặn rất khó có mang được.", "eng": "Women who do not ovulate regularly have difficulty in becoming pregnant."}, {"viet": "Bà có muốn dùng món salad không, thưa bà?", "eng": "Would you like a salad, madam?"}, {"viet": "Ông làm ơn chuyển cái túi của ông đi?", "eng": "Would you mind moving your bag, please?"}, {"viet": "Đề nghị ông viết tên ông bằng chữ hoa in.", "eng": "Write your name in block capitals, please."}, {"viet": "Có, máy bay phản lực, đặc biệt là máy bay siêu thanh, tiêu thụ một số lượng lớn nhiên liệu, vì vậy lượng khí thải cũng lớn.", "eng": "Yes, jets, especially supersonic ones, consume large amounts of fuel, so the amount of exhaust is also large."}, {"viet": "Ông sẽ được đánh thuốc mê nên chắc không cảm thấy gì hết.", "eng": "You'll be under an anaesthetic, so you won't feel a thing."}, {"viet": "Anh đang lái xe trái đường đấy, anh thật là điên rồ!", "eng": "You're driving on the wrong side of the road, you lunatic!"}, {"viet": "Ở đây cậu đã đặt mình vào thế khó xử, mình không thể trả lời câu hỏi của cậu được.", "eng": "You've put me on the spot here, I can't answer your question."}, {"viet": "Bạn không thể mong nắm được tiếng Anh trong vài ngày, bởi vì phải nhớ rằng đó là một ngôn ngữ khó.", "eng": "You can't expect to master English in a few days, after all, it's a difficult language."}, {"viet": "Ông có thể xin nó từ trạm thông tin ở New York.", "eng": "You can get that from New York information."}, {"viet": "Bạn có thể trả xe ở bất cứ thành phố nào tại Wyoming và bay về Los Angeles.", "eng": "You could return the car in any city in Wyoming and fly back to L. A."}, {"viet": "Tôi nghĩ cô khiêu vũ rất nhiều phải không?", "eng": "You have danced a great deal, I suppose?"}, {"viet": "Con biết 20 trừ 10 bằng bao nhiêu không?", "eng": "You know what twenty minus 10 is, don't you?"}, {"viet": "Anh phải tranh thủ những người có thể giúp anh trong kinh doanh.", "eng": "You must cultivate people who can help you in business."}, {"viet": "Anh cần phải có giấy chứng nhận để tìm một công việc.", "eng": "You need some qualification to find a job."}, {"viet": "Anh nên theo phương pháp điều trị có sự nghỉ ngơi nhiều ở trên giường.", "eng": "You should follow your treatment with plenty of rest in bed."}, {"viet": "Anh nhìn nhận mọi chuyện quá nghiêm trọng, hãy cố gắng yêu đời hơn một chút!", "eng": "You take things too seriously, try to enjoy life a bit more!"}, {"viet": "Anh sẽ không thích phim ấy đâu, trong đó có nhiều ngôn ngữ tục tằn.", "eng": "You won't like that film, it's got a lot of bad language."}, {"viet": "Bài tập ở nhà của con đầy lỗi, con phải làm lại đi.", "eng": "Your homework's full of mistakes, you'd better do it over."}, {"viet": "Công việc của anh chậm chạp quá phải tăng tốc lên.", "eng": "Your work is too slow, you must speed up."}]