[{"viet": "Muốn có một chiếc xe đạp thì rẻ thôi.", "eng": "A bicycle is cheap to run."}, {"viet": "Một cá tính được uốn nắn, rèn luyện bằng kỷ luật nghiêm khắc.", "eng": "A character formed by strict discipline."}, {"viet": "Một dụng cụ mới, phức tạp để mở các loại đồ hộp.", "eng": "A complicated new gadget for opening tins."}, {"viet": "Đập nước là một bức tường chắn ngang qua một dòng sông.", "eng": "A dam is a wall across a stream."}, {"viet": "Con chó nằm dưới chân chủ của nó.", "eng": "A dog lying at his master's feet."}, {"viet": "Một bài tường thuật hư cấu về đời sống nông trại.", "eng": "A fictional account of life on a farm."}, {"viet": "Một quầy bán trái cây trong chợ.", "eng": "A fruit stall in the market."}, {"viet": "Một chính sách của chính phủ không phù hợp với các vấn đề xã hội.", "eng": "A governmental policy lacking relevance."}, {"viet": "Cần có độ chính xác cao.", "eng": "A high degree of accuracy is needed."}, {"viet": "Một nhà báo được nhiều người ngưỡng mộ vì tài dí dỏm của bà ta.", "eng": "A journalist much admired for her wit."}, {"viet": "Một lá thư, nhà du lịch, chiếc máy bay trên đường tới Luân Đôn.", "eng": "A letter, a traveller, an aircraft destined for London."}, {"viet": "Một chuyện tình khiến chúng tôi cảm thấy xúc động và buồn.", "eng": "A love story that left us feeling misty and sad."}, {"viet": "Một cuộc họp của những người đứng đầu chính phủ.", "eng": "A meeting of the heads of government."}, {"viet": "Một quốc gia bị nghèo đi bởi các khoản thuế má thất thoát dần.", "eng": "A nation beggared by crippling taxes."}, {"viet": "Một y tá có nhiều nhiệm vụ phải thực hiện khi chăm sóc người bệnh.", "eng": "A nurse has many duties to fulfill in caring for the sick."}, {"viet": "Một người có địa vị cao trong xã hội.", "eng": "A person who is high on the social scale."}, {"viet": "Một chính trị gia hoàn toàn xa rời nhu cầu thực tế của đất nước.", "eng": "A politician totally divorced from the real needs of the country."}, {"viet": "Một sự từ chối tham gia những trò đùa thô lỗ do bản tính quá đoan trang.", "eng": "A prudish refusal to enjoy rude jokes."}, {"viet": "Một bản sơ yếu lý lịch khai man sự thiếu kinh nghiệm của người xin việc.", "eng": "A résumé that glossed over the applicant's lack of experience."}, {"viet": "Một học bổng dành cho các nhạc sĩ trẻ có nhiều triển vọng.", "eng": "A scholarship for young musicians of promise."}, {"viet": "Một phụ nữ lùn phốp pháp đang lạch bạch đi trên vỉa hè.", "eng": "A short plump woman came waddling along the pavement."}, {"viet": "Một người lính bị tàn phế vì các vết thương ở chân.", "eng": "A soldier disabled by leg wounds."}, {"viet": "Một câu chuyện do chính ai đó đặt ra.", "eng": "A story of one's own invention."}, {"viet": "Một sự sần sùi sờ thấy được của da.", "eng": "A tangible roughness of the skin."}, {"viet": "Một bản dịch đó là một kỳ công của kiến thức rộng.", "eng": "A translation that is a monument of scholarship."}, {"viet": "Một kịch bản được viết lại cho thích hợp với truyền hình.", "eng": "A watered-down version of the play for television."}, {"viet": "Một nhà văn trẻ người trong thời gian gần đây đã trở nên nổi tiếng.", "eng": "A young writer who has recently come to prominence."}, {"viet": "Thật sự, điều đó không hoàn toàn đúng.", "eng": "Actually, that's not quite right."}, {"viet": "Sau một tuần trốn chạy, hắn đã ra đầu thú cảnh sát.", "eng": "After a week on the run he gave himself up to the police."}, {"viet": "Sau khi qua mặt xe khác anh phải trở lại đường nhỏ bên trong.", "eng": "After overtaking you should move back into the inside lane."}, {"viet": "Sau những gì hắn gây ra cho gia đình tôi, tôi ghét hắn.", "eng": "After what he did to my family, I hate him."}, {"viet": "Tất cả hy vọng để tìm ra họ đã tiêu tan và cuộc tìm kiếm đã bị huỷ bỏ.", "eng": "All hope of finding them was abandoned and the search was called off."}, {"viet": "Tất cả các giáo sĩ địa phương đều dự lễ.", "eng": "All the local clergy attended the ceremony."}, {"viet": "Mặc dù cô ta không đề cập đến tên tôi, tôi biết lời nhận xét của cô ấy nhằm giúp tôi.", "eng": "Although she didn't mention me by name, I know her remarks were intended for my benefit."}, {"viet": "Một chính quyền rất mong muốn không bị vết nhơ tham nhũng.", "eng": "An administration anxious to be free from the taint of corruption."}, {"viet": "Một chuỗi những khúc rẽ khó đi trên con đường.", "eng": "An awkward series of bends in the road."}, {"viet": "Một khoản tiền thưởng khuyến khích năng suất cao.", "eng": "An incentive bonus for high productivity."}, {"viet": "Một ngày trường làng mở cửa cho khách tới thăm.", "eng": "An open day at the village school."}, {"viet": "Và nó có một vệt sáng màu đỏ và một vệt sáng màu xanh ở cuối mỗi đôi tua cảm xúc dài của nó.", "eng": "And it has a red light and a blue one at the end of each of its two long tentacles."}, {"viet": "Một lý do khác để xây đập là để giữ nước một con sông đủ sâu để thuyền bè qua lại trên sông.", "eng": "Another reason for building dams is to keep the water in a river deep enough for boats to travel on the river."}, {"viet": "Khoa khảo cổ đưa chúng ta vào một cuộc du hành trong quá khứ.", "eng": "Archaeology takes us on a voyage into the past."}, {"viet": "Tối nay anh đến với chúng tôi chứ?", "eng": "Are you coming with us tonight?"}, {"viet": "Có phải mày định lừa tao một vố phải không?", "eng": "Are you trying to put one across me?"}, {"viet": "Như thường lệ hắn đi muộn và phải chạy để đón kịp xe buýt.", "eng": "As always he was late and had to run to catch the bus."}, {"viet": "Khi thủy triều rút ra xa bờ chúng tôi có thể tìm vỏ sò được.", "eng": "As the tide receded from the shore we were able to look for shells."}, {"viet": "Nàng tân công chúa hẳn nhiên đã trang phục hợp với địa vị tại bữa tiệc cưới của nàng.", "eng": "At her wedding the new princess certainly looked the part."}, {"viet": "Dự cơm chiều theo lời mời của ông chủ tịch.", "eng": "Attend the dinner at the chairman's invitation."}, {"viet": "Là một nguồn tin đáng tin cậy về điều gì.", "eng": "Be a reliable source of information about something."}, {"viet": "Hãy giữ yên lặng kẻo anh làm cả nhà thức giấc đó!", "eng": "Be quite or you'll wake the whole house!"}, {"viet": "Có thái độ trang nghiêm đúng cách trong một đám tang.", "eng": "Behave with due gravity at a funeral."}, {"viet": "Những con chim tranh nhau chí chóe những mẩu bánh mì.", "eng": "Birds squabbling over bits of bread."}, {"viet": "Thủ thỉ những lời yêu đương vào tai của ai.", "eng": "Breathe loving words in somebody's ear."}, {"viet": "Con ngựa Burnside chắc sẽ thắng cuộc đua này.", "eng": "Burnside is the firm favourite to win the race."}, {"viet": "Nhưng hai tháng sau mới đáo hạn.", "eng": "But it will mature two months later."}, {"viet": "Mua một số lớn thực phẩm ở cửa hàng địa phương bằng tiền mặt và hàng.", "eng": "Buy food in bulk at the local cash and carry."}, {"viet": "Vào giờ này tuần tới chúng ta sẽ ở New York.", "eng": "By this time next week we shall be in New York."}, {"viet": "Tôi có thể thanh toán bằng thẻ tín dụng được không?", "eng": "Can I pay by credit card?"}, {"viet": "Em hỏi thử xem tàu chạy lúc mấy giờ?", "eng": "Can you find out what time the train leaves?"}, {"viet": "Cô có thể cho tôi xem cái này không?", "eng": "Can you show me this, please?"}, {"viet": "Những tấm thảm trải từ tường này qua tường kia.", "eng": "Carpets stretching from wall to wall."}, {"viet": "Ôm ấp niềm hy vọng là anh ấy sẽ bình phục.", "eng": "Cherish the hope that he will recover."}, {"viet": "Tự nhận là người thừa kế đích thực.", "eng": "Claimed to be the true heir."}, {"viet": "Nào, mọi người, hãy cố gắng nào-chúng ta còn nhiều việc phải làm.", "eng": "Come on, everyone, shoulders to the wheel-we're got a lot to do."}, {"viet": "Những quyền lợi mâu thuẫn nhau có khuynh hướng phân hóa xã hội.", "eng": "Conflicting interests that tend to fractionalize a society."}, {"viet": "Tôi có thể nói chuyện với anh một lát không, nếu như anh không quá bận?", "eng": "Could I have a word with you, if you're not too busy?"}, {"viet": "Cô có thể cho tôi xem màu xanh nước biển không?", "eng": "Could you show me the navy?"}, {"viet": "Tập quán là yếu tố hợp nhất xã hội buổi ban đầu.", "eng": "Custom was in early days the cement of society."}, {"viet": "Những hành động đưa đến sự mất tín nhiệm của ai.", "eng": "Deeds that redound to one's discredit."}, {"viet": "Mặc dầu thời tiết xấu, lễ hội đó vẫn được tiến hành.", "eng": "Despite the bad weather, the fête will go ahead."}, {"viet": "Em có nghe hắn đi ra hay không?", "eng": "Did you hear him go out?"}, {"viet": "Bệnh tật thường tiếp theo sau nạn đói vì cơ thể người ta bị yếu đi.", "eng": "Disease often follows on from starvation because the body is weakened."}, {"viet": "Làm việc gì hữu ích cho cuộc đời của mình.", "eng": "Do something useful with one's life."}, {"viet": "Bạn có bao giờ hát bài hát nào của ban nhạc Beatles không?", "eng": "Do you ever sing any Beatles'songs?"}, {"viet": "Ở Alaska có sông băng không?", "eng": "Do you have glaciers in Alaska?"}, {"viet": "Bạn có thích thử những điều mới lạ không?", "eng": "Do you like to try new things?"}, {"viet": "Anh dạy học trò của anh từng người một hay theo nhóm?", "eng": "Do you teach your students singly or in groups?"}, {"viet": "Ông muốn gửi nó theo loại thường hay thư bảo đảm?", "eng": "Do you want to send it by ordinary or registered mail?"}, {"viet": "Chó không được phép làm bẩn phóng uế ra hè phố.", "eng": "Dogs are not permitted to foul the pavement."}, {"viet": "Đừng có làm như thế, đồ ngốc!", "eng": "Don't do that, you silly muggins!"}, {"viet": "Đừng để thất bại đó làm bạn nản lòng.", "eng": "Don't let this set-back dishearten you."}, {"viet": "Đừng có cho rằng bà ấy nghiêm túc-tất cả chỉ là một màn kịch thôi.", "eng": "Don't take her seriously-it's all an act."}, {"viet": "Kính hai lớp thường là đặc điểm hấp dẫn cho các căn nhà bán.", "eng": "Double glazing is often a good selling-point for houses."}, {"viet": "Trong cơn bão ngói rơi xuống ầm ầm.", "eng": "During the gale roof tiles came hurtling down."}, {"viet": "Di cư từ Anh đến Úc để tìm việc làm.", "eng": "Emigrate from Britain to Australia to find work."}, {"viet": "Ngay khi anh ta hét lên báo trước nguy hiểm thì chiếc ô-tô bị trượt bánh.", "eng": "Even as he shouted the warning the car skidded."}, {"viet": "Mọi thứ sắp đặt một cách vui mắt để đón khách.", "eng": "Everything pleasingly arranged for the guests."}, {"viet": "Kinh nghiệm được truyền từ đời này sang đời khác.", "eng": "Experience handed down from generation to generation."}, {"viet": "Hợp thời trang khoảng cuối thế kỷ trước.", "eng": "Fashionable around the turn of the century."}, {"viet": "Hãy điền vào các chỗ trống trên bản câu hỏi.", "eng": "Fill in the blanks on the question paper."}, {"viet": "Năm con đường tỏa ra từ bùng binh này.", "eng": "Five roads radiate from this roundabout."}, {"viet": "Theo tôi biết, anh ta có thể đã chết rồi.", "eng": "For all I know he could be dead."}, {"viet": "Bốn người lính đứng gác bên cạnh chiếc quan tài.", "eng": "Four soldiers stood guard over the coffin."}, {"viet": "Các con bạc đặt tiền cược vào bàn ru-lét.", "eng": "Gamblers laying their stakes in roulette."}, {"viet": "Hãy sắp xếp các ý của anh trước khi bắt đầu viết.", "eng": "Get your ideas into some kind of order before beginning to write."}, {"viet": "Để rau âm ỉ trong năm phút.", "eng": "Give the vegetables a five-minute simmer."}, {"viet": "Chào ông, tôi có thể giúp được gì cho ông, thưa ông?", "eng": "Good evening, what can I do for you, sir?"}, {"viet": "Phải cải cách nền kinh tế của thành phố này.", "eng": "Had to retool the city's economy."}, {"viet": "Phải biết lịch sự và xin lỗi về những điều anh đã làm!", "eng": "Have the decency to apologize for what you did!"}, {"viet": "Bạn có bao giờ tham gia vào một cuộc vận động chính trị chưa?", "eng": "Have you ever participated in a political campaign?"}, {"viet": "Anh có thấy một xấp giấy tờ nằm ở quanh đây không?", "eng": "Have you seen a pile of papers sitting around?"}, {"viet": "Anh ta là con người khá kì quặc-hàng năm nay anh ta không hề ra khỏi nhà.", "eng": "He's a bit of an odd fish-he's never been out of his house for years."}, {"viet": "Nó đã luôn luôn là cái gai trước mắt tôi kể từ khi nó vào cái ban này.", "eng": "He's been a thorn in my side ever since he joined this department."}, {"viet": "Anh ta chẳng có cái gì ngoài đồng tiền trợ cấp.", "eng": "He's got nothing beyond his state pension."}, {"viet": "Ông ta là Chủ tịch kiêm luôn Thủ quỹ và Thư ký.", "eng": "He's President, Treasurer and Secretary in one."}, {"viet": "Ông ấy được hưởng đặc quyền bán thức ăn ở toà thị chính.", "eng": "He's won a concession to sell food in the town hall."}, {"viet": "Khoảng 10 giờ, anh ấy đến nơi.", "eng": "He arrived at about ten o'clock."}, {"viet": "Nó sống thong dong suốt cuộc đời, không bao giờ phiền muộn về điều gì.", "eng": "He breezes through life, never worrying about anything."}, {"viet": "Ông ấy trút bỏ mọi sự kiềm chế của mình.", "eng": "He cast aside all his inhibitions."}, {"viet": "Anh ấy không thể tiêu đủ đến cuối tháng số tiền của mình.", "eng": "He couldn't stretch out his money to the end of the month."}, {"viet": "Anh ta chưa từng ngỏ ý giúp ai.", "eng": "He didn't once offer to help."}, {"viet": "Nó kiếm được một số tiền khó tưởng tượng nổi.", "eng": "He earns an incredible amount of money."}, {"viet": "Anh ta cảm thấy xấu hổ vì đã làm quá ít việc.", "eng": "He felt ashamed of having done so little work."}, {"viet": "Chàng trao cho nàng một chiếc nhẫn nạm ngọc biểu tượng tình yêu bất diệt của họ khi đứa con trai họ chào đời.", "eng": "He gave her an eternity ring when their son was born."}, {"viet": "Anh ta cố gắng lần thứ ba mới tìm ra câu trả lời.", "eng": "He got the answer on the third take."}, {"viet": "Anh ta khăng khăng cho rằng vị trí của người phụ nữ là ở trong gia đình.", "eng": "He had the fixed idea that a woman's place was in the home."}, {"viet": "Nó có cái tật cố hữu là luôn luôn nói những điều không đâu vào đâu.", "eng": "He has an unerring knack of saying the wrong thing."}, {"viet": "Hắn có vài thói quen khá kì cục.", "eng": "He has some rather odd ways."}, {"viet": "Ông ta báo cho cảnh sát biết một số tiền đã bị mất.", "eng": "He informed the police that some money was missing."}, {"viet": "Nó bị bệnh tâm thần nên không thể bị coi là có trách nhiệm về những hành động của nó.", "eng": "He is mentally ill and cannot be held accountable for his actions."}, {"viet": "Ông ấy không phải là người phung phí lời khen, cho nên khi ông ấy nói Tốt là đúng như thế.", "eng": "He isn't one to ladle out praise, so when he says Good he means it."}, {"viet": "Hắn ta đã bỏ nhà đi cách đây hai tuần và từ đấy chúng tôi không biết tin gì về hắn nữa.", "eng": "He left home two weeks ago and we haven't heard from him since."}, {"viet": "Ông ta trông rất bực tức về việc gì đó.", "eng": "He looks very peeved about something."}, {"viet": "Ít ra hắn cũng phải lịch sự mở miệng xin lỗi chứ!", "eng": "He might have had the grace to say he was sorry!"}, {"viet": "Anh ấy đẩy một cái cho cổng mở.", "eng": "He opened the gate with one push."}, {"viet": "Anh ấy hoàn toàn kiêng rượu dược một tháng.", "eng": "He practised total abstinence for a month."}, {"viet": "Anh ta dốc nhiều sức vào việc cải thiện tiếng Pháp của mình.", "eng": "He puts a lot of work into improving his French."}, {"viet": "Nó từ chối chuyện làm tình trước khi cưới.", "eng": "He refused to make love before they were married."}, {"viet": "Theo ý của tôi thì anh ta hơi quá nghiêm trang bảo thủ.", "eng": "He's a bit too respectable for my tastes."}, {"viet": "Ông ta được bầu vào thẩm phán đoàn.", "eng": "He's been elected to the magistracy."}, {"viet": "Cảnh sát đã quen mặt anh ta.", "eng": "He's known to the police."}, {"viet": "Anh ta là người lái máy bay trực thăng.", "eng": "He's the man who flew the helicopter."}, {"viet": "Anh ấy phục vụ với tư cách là một sĩ quan bộ binh trong cuộc chiến tranh vừa qua.", "eng": "He saw service as an infantry officer in the last war."}, {"viet": "Ông ta đã làm cả công ty sửng sốt bằng việc từ chức.", "eng": "He shocked the whole company by resigning."}, {"viet": "Anh ta hít hơi nước qua mũi mình.", "eng": "He sniffed the vapour up through his nose."}, {"viet": "Anh ta bắt đầu cư xử một cách gây gổ vì vậy chị ấy gọi cảnh sát.", "eng": "He started to behave aggressively so she called the police."}, {"viet": "Vì vụ đụng xe ông ta bị tổn thương ở não không thể chữa được.", "eng": "He suffered irreversible brain damage in the crash."}, {"viet": "Ông ta phủ vội một chiếc khăn lên người bị thương.", "eng": "He threw a blanket over the injured man."}, {"viet": "Ông ta truy nguyên dòng dõi của mình tới tận một gia đình Norman xưa.", "eng": "He traces his descent back to an old Norman family."}, {"viet": "Ông ta trả công thấp cho tôi làm công việc đó mất 10 bảng Anh.", "eng": "He underpaid me for the work by £ 10."}, {"viet": "Anh ta đã báo cho tôi biết trước phải chờ đợi cái gì.", "eng": "He warned me beforehand what to expect."}, {"viet": "Ông ấy đã bị xông hơi ngạt nặng trong chiến tranh.", "eng": "He was badly gassed in the war."}, {"viet": "Ông ta rất tức giận về sự can thiệp của bà ta.", "eng": "He was deeply resentful at her interference."}, {"viet": "Anh ta được các bác sĩ đồng nghiệp của anh ta kính nể.", "eng": "He was greatly respected by his brother doctors."}, {"viet": "Hắn ta không phải là người làm chứng vô tư vì có liên hệ gia đình với bị cáo.", "eng": "He was not an impartial witness because of his affinity with the accused."}, {"viet": "Anh ta bị đuổi vì ăn cắp tiền bằng cách thay đổi sổ kế toán.", "eng": "He was sacked for cooking the books stealing money by making changes in the account."}, {"viet": "Nó đã bị tống vào tù và để cho chết dần chết mòn.", "eng": "He was thrown into prison and left to rot."}, {"viet": "Anh ấy leo lên cột buồm để kiểm tra các lá buồm.", "eng": "He went aloft to check the sails."}, {"viet": "Anh ta sẽ không đi: anh ta kiên quyết như vậy.", "eng": "He won't go: he's quite decided about it."}, {"viet": "Các tiêu đề được in bằng kiểu chữ khác với bài viết.", "eng": "Headings printed in a different type-face from the text."}, {"viet": "Tuổi tác của bà ta chỉ là mối quan tâm thứ yếu.", "eng": "Her age is of secondary interest."}, {"viet": "Con bà ta đã bị nước lũ cuốn đi.", "eng": "Her child was washed away in the flood."}, {"viet": "Nghị lực và tài năng của cô ta đã đưa cô ta lên vị trí cao nhất trong nghề của cô ta.", "eng": "Her energy and talent took her to the top of her profession."}, {"viet": "Tóc của cô ta bị vướng lung tung vào hàng rào dây thép gai.", "eng": "Her hair got all tangled up in the barbed wire fence."}, {"viet": "Những câu nói đùa của cô ta thật sự làm tôi vui.", "eng": "Her jokes really crease me up."}, {"viet": "Sự bực dọc khó chịu nơi cô ấy khiến tôi nghĩ là có việc không ổn.", "eng": "Her nervous manner told me that something was up."}, {"viet": "Động cơ căn bản của cô ta là tham vọng cá nhân.", "eng": "Her prime motive was personal ambition."}, {"viet": "Những lần con trai đến thăm là niềm vui sướng bất ngờ của bà ấy.", "eng": "Her son's visits are a great treat for her."}, {"viet": "Giọng của nàng cần phải được một tay nhà nghề huấn luyện.", "eng": "Her voice should be professionally trained."}, {"viet": "Ở đây ông có cơ hội làm điều gì đó tích cực ….", "eng": "Here you have a chance to do something positive …."}, {"viet": "Lý lẽ của nó nghe có vẻ thuyết phục nhưng là dựa trên sự lừa bịp.", "eng": "His arguments sound convincing but they're based on delusion."}, {"viet": "Tính cẩu thả của anh ta gây nên cái chết của họ.", "eng": "His carelessness was responsible for their deaths."}, {"viet": "Vị phó của ông ta thay ông ta làm lãnh đạo.", "eng": "His deputy replaced him as leader."}, {"viet": "Mặt ông ta chảy nhễ nhại mồ hôi.", "eng": "His face was streaming with sweat."}, {"viet": "Bàn tay anh ta tiếp xúc với một bề mặt nóng.", "eng": "His hand came into contact with a hot surface."}, {"viet": "Trình độ tiếng Pháp của anh ta hãy còn kém.", "eng": "His knowledge of French remained pretty patchy."}, {"viet": "Mẹ của anh ta ở trong một viện dưỡng lão.", "eng": "His mother is in an old folks home."}, {"viet": "Hắn cứ hỏi lải nhải khiến tôi cuối cùng phải nổi giận lên mà trả lời.", "eng": "His persistent questions finally goaded me into angry reply."}, {"viet": "Việc ông ta từ chức đến là đột ngột.", "eng": "His resignation came right out of the blue."}, {"viet": "Sự nỗ lực là điều chứng tỏ sự trung thành của anh ta.", "eng": "His striving is testament to his loyalty."}, {"viet": "Giọng của anh ấy có đặc điểm là rất du dương.", "eng": "His voice had a rich melodic quality."}, {"viet": "Giữ chắc cái ghế trong khi tôi đứng lên.", "eng": "Hold the chair steady while I stand on it."}, {"viet": "Giá nhà không cho thấy dấu hiệu đứng lại.", "eng": "House prices show no sign of levelling off."}, {"viet": "Làm sao anh có thể tiếp tục làm việc với những tiếng ồn ào không ngớt đó?", "eng": "How can you continue working with all that noise going on?"}, {"viet": "Anh giải thích như thế nào về cái vết dập ở xe?", "eng": "How do you account for the dent in the car?"}, {"viet": "Cháu dự định ở lại Mỹ bao lâu?", "eng": "How long are you going to stay in the States?"}, {"viet": "Ông muốn thuê nó bao nhiêu ngày?", "eng": "How many days would you like it for?"}, {"viet": "Xưởng ô tô chém anh bao nhiêu về những chỗ sửa chữa ấy?", "eng": "How much did the garage rush you for those repairs?"}, {"viet": "Ông nói xem cô ta bao nhiêu tuổi?", "eng": "How old would you say she is?"}, {"viet": "Săn thú và bắn súng là những hoạt động tương tự như nhau.", "eng": "Hunting and shooting are kindred activities."}, {"viet": "Tôi muốn đặt trước một bàn dành cho hai người vào lúc 8 giờ tối nay.", "eng": "I'd like to make a reservation for two at 8: 00 this evening."}, {"viet": "Tôi sẽ tạt qua ngôi nhà và lấy các thứ của tôi, nhé?", "eng": "I'll come by the house and get my stuff later, OK?"}, {"viet": "Tôi muốn một tách trà và một quả táo nữa.", "eng": "I'll like a cup of tea and an apple as well."}, {"viet": "Tôi là người chạy đường dài, không phải là người chạy nước rút.", "eng": "I'm a long-distance runner, not a sprinter."}, {"viet": "Tôi thất vọng về anh: tôi đinh ninh anh sẽ thắng.", "eng": "I'm disappointed in you: I expected you to win."}, {"viet": "Tôi đã đọc hết một nửa cuốn tiểu thuyết mới của ông ta.", "eng": "I'm half-way through his second novel."}, {"viet": "Tôi chẳng giấu giếm gì anh-thật lòng tôi chẳng hề biết hắn đang ở đâu.", "eng": "I'm not holding out on you-I honestly don't know where he is."}, {"viet": "Tôi xin lỗi, cảm phiền ông nhắc lại tên của ông được không ạ?", "eng": "I'm sorry, but would you mind repeating your name?"}, {"viet": "Tôi nói với anh điều ấy không biết bao nhiêu lần rồi.", "eng": "I'm telling you so for the umpteenth time."}, {"viet": "Tôi đã thu xếp nhờ hàng xóm cho mèo ăn.", "eng": "I've arranged with the neighbours about feeding the cats."}, {"viet": "Cuối cùng mình đã phát giác được câu chuyện huyền thoại về tính không thể sai lầm của ông ta,.", "eng": "I've finally nailed the myth of his infallibility."}, {"viet": "Tôi biết anh ta từ khi anh ấy còn bé tí.", "eng": "I've known him since he was knee-high to a grasshopper."}, {"viet": "Tôi đã huấn luyện con chó của tôi biết đi nhặt đôi dép của tôi.", "eng": "I've trained my dog to fetch my slippers."}, {"viet": "Không hiểu sao tôi luôn luôn biết là thế nào tôi cũng nhận được việc làm.", "eng": "I always knew I'd get the job, somehow."}, {"viet": "Tôi sẵn sàng đọ sức với anh.", "eng": "I am ready to match my strength with yours."}, {"viet": "Anh đã ăn trưa trong 2,3 phút để có thêm một suất ăn nữa.", "eng": "I ate my lunch in 2 to 3 minutes so that I could get another serving."}, {"viet": "Tôi gọi bà ta là một kẻ đạo đức giả tồi tệ và điều đó đã làm bà ta thức tỉnh.", "eng": "I called her a dammed hypocrite and that made her sit up."}, {"viet": "Tôi không thể bỏ qua được sự thô lỗ của nó nữa.", "eng": "I can't ignore his rudeness any longer."}, {"viet": "Tôi không mấy tin điều cô ta nói.", "eng": "I can barely credit what she said."}, {"viet": "Tôi không thể đồng ý với một đề nghị như thế.", "eng": "I cannot give my blessing to such a proposal."}, {"viet": "Tôi mới kiểm tra lại lịch làm việc của mình và thấy rằng sáng hôm đó tôi có một cuộc hẹn.", "eng": "I checked my calendar just now and found I already had an appointment that morning."}, {"viet": "Tôi không thể chen qua nổi đám đông.", "eng": "I couldn't get through the crush."}, {"viet": "Tôi đã quyết định không hỏi vay cô ta bởi vì cô ta có tiếng là keo kiệt.", "eng": "I decided not to ask her for a loan in view of her proverbial meanness."}, {"viet": "Tôi không muốn làm kỳ đà cản mũi.", "eng": "I didn't wish to play gooseberry."}, {"viet": "Tôi không biết tốc độ chính xác của chiếc ô tô, nhưng chắc chắn là nó chạy rất nhanh.", "eng": "I don't know the car's exact speed, but it was certainly travelling."}, {"viet": "Tôi không nghĩ là anh ấy sẵn lòng tiếp khách du lịch nước ngoài.", "eng": "I don't think he takes kindly to foreign tourists."}, {"viet": "Tôi không muốn nói chuyện với đồ trẻ con, tôi muốn gặp ông quản đốc.", "eng": "I don't want to speak to some pimply youth, I want to see the manager."}, {"viet": "Tôi không hiểu điều ông muốn nói.", "eng": "I don't understand what you mean."}, {"viet": "Tôi buộc lòng phải nói với anh là anh uống quá nhiều rượu đấy.", "eng": "I feel bound to tell you that you're drinking too much."}, {"viet": "Tôi thấy đi xem bảo tàng rất thư giãn.", "eng": "I find going to museums very relaxing."}, {"viet": "Mình đưa cho cậu chiếc bản đồ để cậu khỏi bị lạc.", "eng": "I gave you a map so you wouldn't get lost."}, {"viet": "Tôi nghĩ bạn sẽ phải thấy tại buổi tiệc tối nay.", "eng": "I guess you will have to see tonight at the party."}, {"viet": "Tôi đã phải lựa lời với anh ta mới lấy được thông tin đó.", "eng": "I had to coax the information out of him."}, {"viet": "Tôi nghi trong bụng là nó đã lấy trộm cái ví của tôi.", "eng": "I have a sneaking suspicion that he stole my wallet."}, {"viet": "Cháu không biết bánh mì tròn để ở đâu?", "eng": "I have no idea where the rolls are?"}, {"viet": "Tôi đã nói với anh những quy tắc rồi đó, vậy anh phải hành động thích ứng với nó.", "eng": "I have told you the rules so you must act accordingly."}, {"viet": "Tôi nghe nói ông già Fred đã được đề bạt tuần vừa qua-tôi cho rằng lẽ ra ông ta đã phải được đề bạt từ lâu rồi.", "eng": "I hear old Fred got promoted last week-and about time too, I'd say."}, {"viet": "Tôi hy vọng chuyện đó sẽ không tái diễn.", "eng": "I hope it doesn't happen again."}, {"viet": "Tôi mời cô ta đi với chúng ta, nhưng cô ta từ chối.", "eng": "I invited her to join us, but she declined."}, {"viet": "Tôi biết Paris rõ hơn Rome.", "eng": "I know Paris better than Rome."}, {"viet": "Tôi thích những nhà hàng có bầu không khí của Đông Nam Á.", "eng": "I like restaurants with a Southeast Asian atmosphere."}, {"viet": "Tôi sẽ đổi nó cho ông ngay lập tức.", "eng": "I'll change it for you immediately."}, {"viet": "Tôi sẽ đi xem món xúp chuẩn bị xong hay chưa.", "eng": "I'll see whether it's ready."}, {"viet": "Tôi e rằng anh chẳng còn hiểu nổi tôi nữa.", "eng": "I'm afraid you've lost me."}, {"viet": "Tôi chưa làm xong việc nhà.", "eng": "I'm in arrears with the housework."}, {"viet": "Rất tiếc, tôi không thực hiện được.", "eng": "I'm sorry, I can't make it."}, {"viet": "Tôi đã lục ra được một bản sao của tài liệu đó.", "eng": "I managed to root out a copy of the document."}, {"viet": "Tôi phải đi rửa ráy một chút trước khi ăn cơm.", "eng": "I must just go and freshen myself up before dinner."}, {"viet": "Tôi chưa bao giờ biết được cách khởi động máy.", "eng": "I never discovered how to start the engine."}, {"viet": "Tôi vô cùng biết ơn các giáo viên và cha mẹ tôi.", "eng": "I owe my teachers and parents a great deal."}, {"viet": "Tôi hoàn toàn thông cảm rằng anh cần có một sự thay đổi.", "eng": "I quite understand that you need your needing a change."}, {"viet": "Tôi không chịu để anh sai khiến đâu.", "eng": "I refuse to be dictated to by you."}, {"viet": "Tôi thường gặp cô ta nhiều nhất lúc chúng tôi còn ở đại học.", "eng": "I saw her most when we were at university."}, {"viet": "Vào kỳ nghỉ tôi thích làm gì tùy ý tôi chỉ làm việc gì tôi thích.", "eng": "I shall have nothing to do on holiday but please myself."}, {"viet": "Tôi phần nào nghĩ rằng điều này có thể xảy ra.", "eng": "I sort of thought this might happen."}, {"viet": "Tôi xin thề trước Chúa là chứng cớ tôi sẽ đưa ra.", "eng": "I swear my Almighty God that the evidence I shall give."}, {"viet": "Tôi nghĩ là tôi đã làm mất cặp đựng hồ sơ của tôi rồi.", "eng": "I think I've lost my briefcase."}, {"viet": "Tôi nghĩ năm nay chúng ta nên đi nghỉ ở Thụy Sĩ.", "eng": "I think we should go to Switzerland for our holiday this year."}, {"viet": "Tôi uống một viên aspirin và cơn đau dần dần dịu đi.", "eng": "I took an aspirin and the pain gradually subsided."}, {"viet": "Tôi hiểu là ông đang cần một người làm thư ký.", "eng": "I understand you have an opening for a secretarial position."}, {"viet": "Tôi không muốn gì khác hơn ngoài những điều tốt lành cho các con tôi.", "eng": "I want nothing but the best my children."}, {"viet": "Tôi muốn viết về tập quán và nghi lễ của họ.", "eng": "I want to write about their customs and their celebrations."}, {"viet": "Tôi đang lái xe vào thành phố thì phanh hỏng.", "eng": "I was driving into town when my brakes went."}, {"viet": "Tôi chỉ muộn có năm phút mà cô ta rầy la tôi tới bến.", "eng": "I was only five minutes late but she really bit my head off."}, {"viet": "Tôi bị trói chặt nhưng đã vùng vẫy cho mình tuột ra.", "eng": "I was tied up, but managed to work myself free."}, {"viet": "Tôi sẽ làm việc đó cho anh với một khoản tiền công ít ỏi là 50 pao.", "eng": "I will do it for you for a small consideration of 50 pounds."}, {"viet": "Tôi sẽ không thể vui được cho đến khi tôi biết được là cô ấy vô sự.", "eng": "I won't be happy until I know she's safe."}, {"viet": "Tôi cũng cần 10 con tem loại 25 xu.", "eng": "I would also like ten 25 cent stamps."}, {"viet": "Tôi muốn gửi cái này đến Đài Loan.", "eng": "I would like to send this to Taiwan."}, {"viet": "Ý tưởng đó không thực thi được, cho nên chúng ta không lại hoàn không.", "eng": "Idea hasn't worked, so we're back to square one."}, {"viet": "Nếu tôi được phép xen vào trong cuộc trò chuyện phiếm này một lời nhận định đúng đắn.", "eng": "If I could intrude a note of seriousness into this frivolous conversation."}, {"viet": "Nếu rảnh, tôi muốn mời bạn đi chơi.", "eng": "If so, I'd like to invite you for an outing."}, {"viet": "Nếu chúng ta phân quyền về địa phương thì các tỉnh thành sẽ có nhiều quyền tự trị hơn.", "eng": "If we decentralise, the provinces will have more autonomy."}, {"viet": "Chúng ta sẽ thoả hiệp được với nhau nếu ông có thể hạ giá xuống một ít.", "eng": "If you can drop your price a little, I'll meet you half-way."}, {"viet": "Nếu ông có bất cứ đề nghị nào khác, xin đừng ngần ngại cho chúng tôi có thể thay đổi kịp chương trình nghị sự.", "eng": "If you have any other suggestions, don't hesitate to let us know so that we can alter our agenda in time."}, {"viet": "Nếu cậu cứ cố gắng nâng chiếc vali đó lên, cậu sẽ có thể bị thương đấy!", "eng": "If you try and lift that suitcase you'll do yourself an injury!"}, {"viet": "Năm 1506, ông trở về Frauenberg và sống những năm cuối đời tại đó.", "eng": "In 1506 he returned to Frauenberg and spent the rest of his life there."}, {"viet": "Ở Anh, theo truyền thống người ta ăn gà tây vào ngày lễ Nôen.", "eng": "In England, turkey is traditionally eaten on Christmas Day."}, {"viet": "Trong các cuộc họp bà ta luôn luôn tấn công trước khi có thể bị chỉ trích.", "eng": "In meetings she always takes offensive before she can be criticized."}, {"viet": "Lúc ban đầu, đó là chuyện vặt.", "eng": "In the beginning, it is a pretty concern."}, {"viet": "Ở Mỹ, Washington là trụ sở của chính phủ và thành phố New York là trung tâm chính về thương mại.", "eng": "In the US, Washington is the seat of government and New York City is the chief seat of commerce."}, {"viet": "Điều không thể giải thích được là các nhà báo không có thông báo gì về vụ việc đó, và chuyện bê bối bị giấu kín không có công chúng biết trong nhiều tuần.", "eng": "Inexplicably, journalists failed to report the affair, and the scandal was hidden from the public for several weeks."}, {"viet": "Đó có phải là một vụ việc quan trọng không?", "eng": "Is it a white-tie affair?"}, {"viet": "Trong tiếng Pháp có từ nào thật là tương đương với từ home trong tiếng Anh?", "eng": "Is there a French work that is the exact equivalent of the English word home?"}, {"viet": "Hệ thống sưởi của anh là lò sưởi ga hay điện?", "eng": "Is your central heating gas or electricity?"}, {"viet": "Nó đau nhói như có ai châm kim vào răng của tôi vậy.", "eng": "It's a sharp pain like someone is sticking a needle in my tooth."}, {"viet": "Mua quần áo cho bọn trẻ con mười tuổi thật là khó-ở tuổi này chúng rất là lỡ cỡ.", "eng": "It's difficult buying clothes for ten-year-olds-at that age they're betwixt and between."}, {"viet": "Không thể nêu cụ thể được con số những kẻ không nhà sau trận lụt.", "eng": "It's impossible to put a figure on the number of homeless after the flood."}, {"viet": "Đi dự tiệc một mình thì chẳng thích thú gì mấy.", "eng": "It's not much fun going to a party alone."}, {"viet": "Ở đây thật ngột ngạt! Mở cửa sổ ra đi!", "eng": "It's stifling in here! Open the window!"}, {"viet": "Cô ta có mặt trong ngôi nhà khi tội ác xảy ra thật là một điều rất đáng ngờ.", "eng": "It's very suspicious that she was in the house when the crime happened."}, {"viet": "Tôi rất choáng váng khi người ta nói là tôi bị ốm nặng.", "eng": "It gave me quite a shock to be told I was seriously ill."}, {"viet": "Anh ta hành động như vậy thật đáng xấu hổ.", "eng": "It is disgraceful of him to act in that way."}, {"viet": "Hiếm khi cô ấy nấu bữa ăn tối.", "eng": "It is rare for her to cook dinner."}, {"viet": "Có thể là bất công nhưng không vi phạm hiến pháp, những người tin vào Thượng đế ở Mỹ chiếm đa số.", "eng": "It may be unfair to atheists unconstitutional, believers in God are the majority in America."}, {"viet": "Nó ở phía trước nhà ga.", "eng": "It's in front of the station."}, {"viet": "Thay đổi thời gian biểu luôn như thế có vẻ không hợp lý.", "eng": "It seems illogical to change the timetable so often."}, {"viet": "Tôi rất buồn khi nghe anh ấy nói cô ấy ốm tới mức nào.", "eng": "It upset me when he told me how ill she was."}, {"viet": "Người ta đã phát hiện ra rằng hắn không phải là một bác sĩ đích thực.", "eng": "It was discovered that he was not a proper doctor."}, {"viet": "Thật là hỗn loạn khi bọn trẻ bắt đầu cười ở giữa khoá lễ.", "eng": "It was so embarrassing when the children started laughing in the middle of the service."}, {"viet": "Anh đi hôm nay hay ngày mai cũng chẳng có gì quan trọng lắm.", "eng": "It won't make much difference whether you go today or tomorrow."}, {"viet": "Janet là người đầu tiên tôi đề nghị làm chủ toạ.", "eng": "Janet was my first suggestion as chairperson."}, {"viet": "Nói nghiêm chỉnh, anh biết đấy, anh nên bớt hút thuốc lá đi.", "eng": "Joking apart, you ought to smoke fewer cigarettes, you know."}, {"viet": "Ken có một cái đầu đầy sợ hãi và bực bội, anh ta cần phải gột rửa đi để được thanh thản trở lại.", "eng": "Ken has an attic full of fear and resentment, he needs to clean out before he will feel comfortable again."}, {"viet": "Chúng ta hãy tìm một chỗ kín đáo để có thể bàn vấn đề này.", "eng": "Let's find some private spot where we can discuss the matter."}, {"viet": "Hãy để bọn con trai lo những đồ đạc nặng.", "eng": "Let the guys worry about the heavy stuff."}, {"viet": "Many hands make light work là một câu tục ngữ.", "eng": "Many hands make light work is a proverb."}, {"viet": "Marilyn Monroe là người nổi tiếng nhất trong tất cả các bà hoàng điện ảnh Mỹ.", "eng": "Marilyn Monroe is the most famous of all American movie queens."}, {"viet": "Con ăn gì đó được không?", "eng": "May I have something to eat?"}, {"viet": "Tôi và bạn tôi muốn thuê hai con ngựa.", "eng": "Me and my amigo want to rent a couple of horses."}, {"viet": "Hầu hết mọi người đều hình dung New York là một thành phố của những toà nhà chọc trời.", "eng": "Most people imagine New York as a city of skyscrapers."}, {"viet": "Những con người, ý nghĩ, lý lẽ ngớ ngẩn.", "eng": "Muddle-headed people, ideas, arguments."}, {"viet": "Những cố gắng ban đầu của tôi để học lái xe đều không thành công.", "eng": "My early attempts at learning to drive were unsuccessful."}, {"viet": "Các khớp của tôi cứng lại khi thời tiết lạnh.", "eng": "My joints seize up in the cold weather."}, {"viet": "Phần của tôi ít quá''Tội nghiệp quá nhỉ! Cậu thì chỉ đáng được ngần ấy thôi.'.", "eng": "My share's too small.''Too bad! It's all you're going to get'."}, {"viet": "Đi lại trên sông, biển khó khăn vì những tảng đá ngầm.", "eng": "Navigation is difficult because of the hidden rocks."}, {"viet": "Chín nước công nhận chính phủ mới của đảo.", "eng": "Nine countries recognized the island's new government."}, {"viet": "Mặc dù cố gắng thế nào, tôi cũng không thể dịch chuyển được nó.", "eng": "No matter how hard I tried, I couldn't move it."}, {"viet": "Bây giờ bạn có biết tôi đang nói về ai không?", "eng": "Now do you know who I'm talking about?"}, {"viet": "Trong số những người bạn gái của tôi thì cô ấy là người xinh nhất.", "eng": "Of all my female friends she is the cutest."}, {"viet": "Dầu lửa lấy từ các mỏ này được đặt giá bằng đô la.", "eng": "Oil from these fields is priced in dollars."}, {"viet": "Trên tường có những bức tranh nguyên bản theo phong cách truyền thống của Trung Quốc.", "eng": "On the walls there are original paintings traditional Chinese style."}, {"viet": "Một trong những tay quần vợt lớn của mọi thời đại.", "eng": "One of the all-time great tennis players."}, {"viet": "Con chó cái của chúng tôi chắc sẽ đẻ một lứa đẹp, chúng tôi đã cho nó đi tơ với con chó của John.", "eng": "Our bitch should produce a fine litter, we mated her with John's dog."}, {"viet": "Ngày nghỉ của chúng ta đã khởi đầu tốt đẹp vì thời tiết tốt và các chuyến tàu chạy đúng giờ.", "eng": "Our holiday got off to a flying start because the weather was good and the trains were on time."}, {"viet": "Các nhân viên bán hàng của chúng tôi cần có quyết tâm và nỗ lực.", "eng": "Our sales people need determination and drive."}, {"viet": "Quyền sở hữu đất cho chúng tôi một lợi thế mạnh.", "eng": "Ownership of the land gives us a strong bargaining counter."}, {"viet": "Người nào đi đến gần cổng đều bị lính gác hô'Đứng lại'.", "eng": "People approaching the gate were challenged by the sentry."}, {"viet": "Thái độ, cách cư xử được chấp nhận một xã hội buông lỏng kỷ cương.", "eng": "Permissive attitudes, behaviour the permissive society."}, {"viet": "Cảnh sát cảnh cáo những người đứng xem tránh xa ngôi nhà đang cháy.", "eng": "Police warned bystanders to keep away from the blazing building."}, {"viet": "Những người bán hàng có thể là những người rất khó chịu.", "eng": "Sales people can be a pain in the butt."}, {"viet": "Nhiều hãng đứng ra đấu thầu xây dựng phòng hoà nhạc.", "eng": "Several firms have bid for the contract to build the new concert hall."}, {"viet": "Cô ta giống hệt một cô gái mà tôi đã từng quen biết.", "eng": "She's a dead ringer for a girl I used to know."}, {"viet": "Cô ta miệt mài học những bài tiếng Pháp bao nhiêu tháng nay rồi.", "eng": "She's been plugging away at her French lessons for months."}, {"viet": "Cô ta tham gia vào nhiều hoạt động ngoại khoá như âm nhạc, thể thao và kịch.", "eng": "She's involved in many extracurricular activities, such as music, sport and drama."}, {"viet": "Lúc này cô ta hết sức gắn bó với bạn trai của cô ấy.", "eng": "She's really invested in her boyfriend at the moment."}, {"viet": "Cô ấy phải tra cứu ba hồ sơ khác nhau để tìm được thông tin đúng.", "eng": "She accessed three different files to find the correct information."}, {"viet": "Cô ta trở thành công dân Mĩ sau khi sống ở đó vài năm.", "eng": "She became a US citizen after living there for several years."}, {"viet": "Cô ấy tuyên bố đã nhìn thấy sự hiện hình của những người chết trong ngôi nhà có ma đó.", "eng": "She claims to have seen manifestations of dead people in the haunted house."}, {"viet": "Cô ta quyết định lẽo đẽo đi theo những người khác vì chẳng có việc gì khác!", "eng": "She decided to string along with the others as she had nothing else to do!"}, {"viet": "Cô ta diện theo kiểu sang nhất.", "eng": "She dressed herself in the pink of fashion."}, {"viet": "Bà ấy quay phim con cái mình đang chơi trong vườn.", "eng": "She filmed her children playing in the garden."}, {"viet": "Cô ta sống một cách vô tư lự.", "eng": "She goes through life in a happy-go-lucky fashion."}, {"viet": "Cô ấy đã thực sự chuẩn bị tinh thần cho mình trước trận đấu quan trọng.", "eng": "She had really psyched herself up for the big match."}, {"viet": "Bà ấy có một ảnh hưởng đáng kể đối với Tổng thống.", "eng": "She has considerable influence with the President."}, {"viet": "Cô ta hi vọng bâng quơ là anh ấy sẽ khoẻ vào ngày Noel.", "eng": "She hopes against hope that he would be well by Christmas."}, {"viet": "Hoàng hậu được vẽ hình trong bộ lễ phục đăng quang của bà.", "eng": "She is portrayed wearing her coronation robes."}, {"viet": "Chị ấy biết cách làm cho giới của mình được hài lòng.", "eng": "She knows how to keep her public satisfied."}, {"viet": "Cô ta rời mắt khỏi bài thi của mình nhìn lên với một nét cau mày lo lắng.", "eng": "She looked up from her exam paper with a worried frown."}, {"viet": "Chắc rằng cô ta có nhiều vấn đề về ngôn ngữ.", "eng": "She must be having a lot of problems with the language."}, {"viet": "Cô ấy quay gót và lao nhanh ra ngoài.", "eng": "She pivoted on her heels and swept out."}, {"viet": "Cô ta thực sự được mọi người tin tưởng khi có người nào bị ốm.", "eng": "She really comes into her own when someone is ill."}, {"viet": "Cô ta đúng là một nghệ sĩ xét trên mọi phương diện.", "eng": "She's an artist to her fingertips."}, {"viet": "Cô ta đã thực sự xao xuyến tâm hồn về anh chàng đó.", "eng": "She's really hung up on that guy."}, {"viet": "Trong lúc tỉa cây hoa hồng, cô ta đã để tay bị cào xước nặng.", "eng": "She scratched herself badly while pruning the roses."}, {"viet": "Cô ấy hát trong một ban nhạc đồng quê.", "eng": "She sings in a country and western band."}, {"viet": "Cô ấy giẫm lên chân tôi và thậm chí không thèm xin lỗi!", "eng": "She stood on my foot and didn't even say sorry!"}, {"viet": "Cô ta tưởng là mình biết tất cả mọi chuyện và đòi hỏi chấn chỉnh hành vi xấu.", "eng": "She thinks she knows everything and needs sitting on."}, {"viet": "Cô quấn tóc cô gái quanh ngón tay mình.", "eng": "She twisted the girl's hair round her fingers."}, {"viet": "Chị ấy vắng mặt vì một cái tang mới đây.", "eng": "She was absent because of a recent bereavement."}, {"viet": "Cô ta trưng diện bộ cánh đẹp nhất.", "eng": "She was decked out in her finest clothes."}, {"viet": "Cô bé đang khóc cái chết của con chó con của cô ta.", "eng": "She was in tears over the death of her puppy."}, {"viet": "Cách là áo sơ mi của bà ta rất máy móc chẳng suy nghĩ gì.", "eng": "She was quite mechanical and unthinking in the way she ironed the shirts."}, {"viet": "Bà ấy quá nghèo không có tiền mua quần áo cho con.", "eng": "She was too poor to buy clothes for the children."}, {"viet": "Cô ta đi vào phòng phỏng vấn, hai chân của cô ta run lẩy bẩy.", "eng": "She went into the interview room, her leg shaking like jelly."}, {"viet": "Cô ta đội một cái mũ để che ánh mặt trời khỏi chiếu vào mắt.", "eng": "She wore a hat to keep the sun out of her eyes."}, {"viet": "Các thủy thủ bị đắm tàu ở trên một chiếc bè tạm bợ.", "eng": "Shipwrecked sailors on a makeshift raft."}, {"viet": "Ký hợp đồng mướn thêm công nhân để đẩy mạnh sản xuất.", "eng": "Sign up more workers to boost production."}, {"viet": "Sáu chai rượu vang là đủ.", "eng": "Six bottles of wine will be enough."}, {"viet": "Bom hỏa mù được ném trong suốt các cuộc náo loạn trên đường phố.", "eng": "Smoke-bombs were thrown during the street riots."}, {"viet": "Vậy ra đây là nhà ga Union nổi tiếng ở Los Angeles!", "eng": "So this is the famous Union Station in Los Angeles!"}, {"viet": "Một số đặc tính của cha mẹ có thể truyền lại cho con cái.", "eng": "Some characteristics of the parents are transmissible to their children."}, {"viet": "Một số khu vực trên tàu cấm vào đấy.", "eng": "Some parts of the ship are off limits."}, {"viet": "Có người thách tôi nhảy từ trên cầu xuống sông.", "eng": "Somebody dared me to jump off the bridge into the river."}, {"viet": "Xin lỗi, chúng tôi phải giữ nó làm bản lưu trữ.", "eng": "Sorry, we must keep it for our file."}, {"viet": "Mùa xuân mang đến khí hậu ấm áp và hoa.", "eng": "Spring brings warm weather and flowers."}, {"viet": "Cô tiếp viên ơi, cô có thể dẫn tôi đến chỗ ngồi được không?", "eng": "Stewardess, can you direct me to my seat?"}, {"viet": "Những chuyện cho một ý thức gắn bó và nơi chốn.", "eng": "Stories that give a sense of rootedness and place."}, {"viet": "Một con vật dữ tợn như thế cần phải được đeo rọ mõm.", "eng": "Such a fierce animal ought to be muzzled."}, {"viet": "Những bãi biển đầy nắng dọc theo vùng Riviera.", "eng": "Sun-drenched beaches along the Riviera."}, {"viet": "Những tay bơi đang vùng vẫy dưới nước.", "eng": "Swimmers thrashing about in the water."}, {"viet": "Uống hai viên, ba lần mỗi ngày trước bữa ăn.", "eng": "Take two of the tablets three times daily before meals."}, {"viet": "Hãy bảo anh ta là tôi không thể gặp anh ta bây giờ, anh ta sẽ phải chờ.", "eng": "Tell him I can't see him now, he'll have to wait."}, {"viet": "Cám ơn cô rất nhiều vì đã khiêu vũ vui vẻ.", "eng": "Thank you very much for the delightful dance."}, {"viet": "Em bé đó đã khóc la mấy tiếng đồng hồ rồi.", "eng": "That baby has been bawling for hours."}, {"viet": "Ngọn đồi này ( leo lên ) hết sức dễ.", "eng": "That hill's an absolute doddle ( to climb )."}, {"viet": "Kiểu tóc mới đó đúng là làm cô ta có phần đẹp hơn.", "eng": "That new hairstyle really does something for her."}, {"viet": "Đó là giờ mẹ ăn trưa!", "eng": "That's when I eat lunch!"}, {"viet": "Chi tiết đó sẽ tạo một kết thúc có hậu cho cuốn sách đó.", "eng": "That will make a good ending to the book."}, {"viet": "Những hậu quả tích tụ do ăn quá nhiều.", "eng": "The accumulative effects of eating too much."}, {"viet": "Không khí ở những thành phố lớn bị ô nhiễm.", "eng": "The air in big cities is full of pollution."}, {"viet": "Lời báo tin được dán ở tường toà thị chính.", "eng": "The announcement was posted up on the wall of the town hall."}, {"viet": "Các bác sĩ quân y đã loại một số tân binh vì không đủ sức khỏe.", "eng": "The army doctors rejected several recruits as unfit."}, {"viet": "Quãng thời gian tập trung chú ý của khán giả thường tỉ lệ nghịch với độ dài của bài nói.", "eng": "The attention span of the audience is often in inverse proportion to the length of the speech."}, {"viet": "Đứa trẻ ấy chưa ăn được thức ăn đặc.", "eng": "The baby is not yet taking solids."}, {"viet": "Ngân hàng đang thuyết phục chúng tôi quyết định nhanh.", "eng": "The bank is pressing us to make a quick decision."}, {"viet": "Nhóm Beatles, như nhiều người trong các bạn còn nhớ, xuất thân từ Liverpool.", "eng": "The Beatles, as many of you are old enough to remember, came from Liverpool."}, {"viet": "Con chim bay qua, cánh đập vù vù.", "eng": "The bird flew past, its wings whirring."}, {"viet": "Những chiếc thuyền đậu trong cảng tạo nên một cảnh tượng đẹp.", "eng": "The boats in the harbour make a beautiful scene."}, {"viet": "Những cuốn sách đó hình như đã bị thất lạc.", "eng": "The books seem to have lost."}, {"viet": "Mấy đứa bé nôn nóng muốn bắt đầu.", "eng": "The boys were champing to start."}, {"viet": "Đi xuôi theo con đường đó khoảng 30 mét thì tòa nhà đó ở phía bên phải của ông.", "eng": "The building is about thirty meters down the road on your right."}, {"viet": "Việc kinh doanh sẽ thua lỗ nếu không hiện đại hoá nó.", "eng": "The business will lose money if it doesn't modernize."}, {"viet": "Vụ đâm ô tô không phải là một tai nạn, đó là một mưu toan cố ý nhằm sát hại anh ta.", "eng": "The car crash wasn't an accident, it was a deliberate attempt to kill him."}, {"viet": "Người thợ mộc đã đóng cái tủ này thật là đẹp-anh ta thực sự là một nhà mỹ thuật.", "eng": "The carpenter has made this cupboard beautifully-he's a real artist."}, {"viet": "Nhân viên kiểm duyệt khăng khăng đòi cắt đoạn này khỏi bộ phim.", "eng": "The censor insisted on excising the passage from the film."}, {"viet": "Tiếng reo hò của những người hâm mộ vang lên khắp sân khi đội tuyển ra mắt.", "eng": "The cheers of the fans echoed round the ground as the team appeared."}, {"viet": "Đứa trẻ tỏ ra rất nhanh trí bằng cách chộp lấy em bé đang rơi.", "eng": "The child showed great presence of mind by grabbing the falling baby."}, {"viet": "Các đứa bé xếp thành một hàng.", "eng": "The children formed into a line."}, {"viet": "Bọn trẻ đang vui đùa nghịch ngợm trong khi thầy giáo đi ra ngoài.", "eng": "The children were having some fun and games while the teacher wad out of the room."}, {"viet": "Toàn thể công chức Nhà nước doạ đình công.", "eng": "The Civil Service are threatening to strike."}, {"viet": "Câu lạc bộ có hội viên từ mọi tầng lớp xã hội từ thợ hàn ống nước cho đến bác sĩ.", "eng": "The club has members from every walk of life from plumbers to doctors."}, {"viet": "Tiết mục của tay hài đó thực sự là chọc cười phá lên.", "eng": "The Comedian's act is a real screamer."}, {"viet": "Công ty này trước đây rất chậm trong việc thích ứng với thị hiếu của người tiêu dùng.", "eng": "The company has in the past been slow out of the blocks to adapt to consumer tastes."}, {"viet": "Người bị kết tội thản nhiên nghe bản án của mình.", "eng": "The condemned man listened to his sentence without batting an eyelid."}, {"viet": "Cuộc nói chuyện đó cứ trở đi trở lại vấn đề tiền bạc.", "eng": "The conversation kept reverting to the subject of money."}, {"viet": "Đất nước đó đang chuẩn bị chiến tranh.", "eng": "The country is making preparations for war."}, {"viet": "Thư tín dụng sẽ được gửi bằng đường hàng không?", "eng": "The credit will be sent by airmail?"}, {"viet": "Vương miện là biểu tượng uy quyền của nhà vua.", "eng": "The crown is emblematic of the power of a king."}, {"viet": "Những người nhảy múa đến từ các câu lạc bộ khác nhau.", "eng": "The dancers are from different tribes and have different languages."}, {"viet": "Bị cáo không thể giải thích sự việc là tiền được thấy trong nhà anh ta.", "eng": "The defendant couldn't account for the fact that the money was found in his house."}, {"viet": "Trời! Tôi mất chùm chìa khoá rồi!", "eng": "The deuce! I've lost my keys!"}, {"viet": "Căn bệnh đó vẫn không được phát hiện trong vài năm.", "eng": "The disease remained undetected for several years."}, {"viet": "Bác sĩ khuyên tôi nên xoa bóp để chữa chứng đau lưng của tôi.", "eng": "The doctor recommended massage for my back pain."}, {"viet": "Con chó thở hồng hộc chạy dọc bên cạnh tôi.", "eng": "The dog panted along the road beside me."}, {"viet": "Cái áo đầm cài khóa dây ở sau lưng.", "eng": "The dress zips up at the back."}, {"viet": "Trận động đất đã cướp đi hàng ngàn nạn nhân.", "eng": "The earthquake claimed thousands of victims."}, {"viet": "Giới chủ và những người lãnh đạo nghiệp đoàn vẫn chưa có tiếng nói chung.", "eng": "The employers and the trade union leaders are still poles apart."}, {"viet": "Thiết bị đã nhận được tín hiệu từ vệ tinh.", "eng": "The equipment picked up on the signal from the satellite."}, {"viet": "Cuộc triển lãm đã khuấy động mối quan tâm tới công trình của nghệ sĩ.", "eng": "The exhibition stimulated interest in the artist's work."}, {"viet": "Chợ phiên đã thu hút hàng trăm người từ các thành phố và làng mạc lân cận.", "eng": "The fair attracted hundreds of people from the neighbouring towns and villages."}, {"viet": "Con chim cái nuôi các con của nó cho tới khi chúng rời tổ.", "eng": "The female bird feeds its young until they leave the nest."}, {"viet": "Cuốn phim đó là một thành công to lớn.", "eng": "The film was a rip-roaring success."}, {"viet": "Xí nghiệp đang lâm vào cảnh hết sức gay go và có thể vỡ nợ.", "eng": "The firm is in dire straits and may go bankrupt."}, {"viet": "Con cá bị kẹt giữa các mắt lưới của lưới.", "eng": "The fish was caught in the meshes of the net."}, {"viet": "Trận đấu bóng buồn tẻ quá nên chúng tôi về sớm.", "eng": "The football match was so tame that we left early."}, {"viet": "Cửa trước khoá, chúng tôi sẽ phải đi vòng phía bên của toà nhà.", "eng": "The front door is locked, we'll have to go round the side of the building."}, {"viet": "Khu vườn xếp đặt rất khéo, có nhiều lối đi vui mắt.", "eng": "The garden is well laid out, with many pleasant walks."}, {"viet": "Các cô gái cãi nhau về một gói bút dạ phớt.", "eng": "The girls were bickering over a packet of felt pens."}, {"viet": "Chính phủ đã điều chỉnh chính sách kinh tế cho tình hình mới.", "eng": "The government adjusted the economy policy to the new situation."}, {"viet": "Chính phủ không thực hiện một cố gắng nào để giải quyết nạn thất nghiệp.", "eng": "The Government is making no attempt to attack unemployment."}, {"viet": "Buổi liên hoan mãn khóa đó thật là độc đáo.", "eng": "The graduation party was out of sight."}, {"viet": "Sự chênh lệch ngày càng tăng giữa giàu và nghèo.", "eng": "The growing inequality between rich and poor."}, {"viet": "Con chuột kiểng đã chui qua tấm lưới dây sắt mặt trước lồng.", "eng": "The hamster had got through the wire at the front of its cage."}, {"viet": "Nhạc trưởng mới bắt đầu bằng cách loại bỏ các nhạc công yếu khỏi dàn nhạc.", "eng": "The hew conductor started by weeding out the weaker players in the orchestra."}, {"viet": "Bệnh viện không được trang bị đúng mức.", "eng": "The hospital has no decent equipment."}, {"viet": "Căn nhà đó đã được thế chấp cho ngân hàng để vay 30.000 bảng Anh.", "eng": "The house is mortgaged to the bank for £ 30,000."}, {"viet": "Ý tưởng ấy chỉ có trong đầu óc các thi sĩ thôi.", "eng": "The idea exists only in the minds of poets."}, {"viet": "Cách mạng công nghiệp đã cuốn theo nó những mảng lớn cư dân nông thôn.", "eng": "The industrial revolution uprooted large segments of the rural population."}, {"viet": "Khoảng thời gian giữa ánh chớp và tiếng sét.", "eng": "The interval between the flash of lighting and the sound of thunder."}, {"viet": "Anh nài ngựa cân được 80 cân Anh.", "eng": "The jockey turned the scale at 80lb."}, {"viet": "Chìa khóa bị hóc trong ổ khóa.", "eng": "The key stuck in the lock."}, {"viet": "Vùng đất phía tây dãy núi trải dài ngút tầm nhìn.", "eng": "The land west of the mountains stretched as far as the eye could see."}, {"viet": "Lớp vỏ này thành một lớp đá trắng.", "eng": "The layer of shells became a layer of white rock."}, {"viet": "Nắp lọ mứt này không vặn ra được.", "eng": "The lid of this jam pot won't unscrew."}, {"viet": "Ổ khóa này hỏng vì dùng liên tục.", "eng": "The lock has broken through constant use."}, {"viet": "Cỗ máy đặt trên một cái nền bằng bê-tông.", "eng": "The machine rests on a bed of concrete."}, {"viet": "Ban giám đốc đang tìm kiếm các cách để cải thiện hiệu năng.", "eng": "The management are looking for ways of improving productivity."}, {"viet": "Vấn đề ấy ngoài phạm vi trách nhiệm của tôi.", "eng": "The matter is outside my province."}, {"viet": "Các hội viên đã rời phòng hội đồng.", "eng": "The members left the council chamber."}, {"viet": "Ông Bộ trưởng đã đưa ra một lời giải thích khác về sự phát triển gần đây ở Trung Đông.", "eng": "The minister has put a different gloss on recent developments in the Middle East."}, {"viet": "Tiền trả góp hàng tháng chỉ có 100,000 yên", "eng": "The monthly payment is only ¥ 100,000"}, {"viet": "Núi mù sương ở phía xa.", "eng": "The mountains were hazy in the distance."}, {"viet": "Nghiên cứu vạn vật sa mạc Gobi.", "eng": "The natural history of the Gobi desert."}, {"viet": "Cái áo choàng dài mới để lộ khá nhiều phần giữa ngực của cô ta!", "eng": "The new gown shows a large amount of her cleavage!"}, {"viet": "Cuộc trình diễn mới chắc chắn sẽ thu hút được đông người.", "eng": "The new show is certainly pulling in the crowds."}, {"viet": "Chuyến xe lửa tốc hành kế tiếp khởi hành lúc 10 giờ 30 sáng.", "eng": "The next express train departs at 10: 30 a. m."}, {"viet": "Nhân điều hành tế bào.", "eng": "The nucleus is the ruler of the cell."}, {"viet": "Viên sĩ quan thắt đai kiếm vào.", "eng": "The officer belted his sword on."}, {"viet": "Vị hoàng hậu già được hết sức kính trọng.", "eng": "The old queen was held in great reverence."}, {"viet": "Đàn ogan vang lên ( trong nhà thờ ).", "eng": "The organ resounded ( through the church )."}, {"viet": "Những bức họa đó được bảo quản rất tốt.", "eng": "The paintings were in an excellent state of preservation."}, {"viet": "Hành khách mặt tái nhợt do say sóng.", "eng": "The passengers turned quite green with sea-sickness."}, {"viet": "Người xưa không hài lòng với việc đặt tên đơn giản cho các hình do các vì sao tạo nên.", "eng": "The people of earlier times were not satisfied with simply naming the pictures the stars made."}, {"viet": "Những phản ứng sinh lí của sự du hành trong không gian.", "eng": "The physiological effect of space travel."}, {"viet": "Nơi đó là một nơi rùng rợn lửa cháy bùng, dữ dội, gầm thét, v. v.", "eng": "The place was a blazing, raging, roaring, etc inferno."}, {"viet": "Trí tưởng tượng sáng tạo của các thi sĩ, các nhà soạn nhạc vĩ đại.", "eng": "The plastic imagination of great poets and composers."}, {"viet": "Những bài thơ gửi đến năm mươi trang bằng bản đánh máy.", "eng": "The poems arrived in fifty pages of typescript."}, {"viet": "Cảnh sát không thể tìm ra được tung tích của băng đó.", "eng": "The police have been unable to find any trace of the gang."}, {"viet": "Cảnh sát được gọi đến để giải tán cuộc xô xát.", "eng": "The police were called in to break up the fracas."}, {"viet": "Hình thức nguyên là big cấp so sánh là bigger so sánh bậc nhất là biggest.", "eng": "The positive form is bigthe comparative is bigger the superlative is biggest."}, {"viet": "Việc bảo quản lương thực, giữ gìn sức khoẻ, bảo quản các công trình nghệ thuật.", "eng": "The preservation of food, one's health, works of art."}, {"viet": "Người được gọi là nối ngôi.", "eng": "The pretended heir to the throne."}, {"viet": "Nguyên tắc tất cả mọi người đều có cơ hội như nhau.", "eng": "The principle of equality of opportunity for all."}, {"viet": "Những mặt hàng do các ông chào có mức giá cao hơn nhiều so với những mặt hàng của các nhà sản xuất khác.", "eng": "The products you offered are much higher in price than those of other manufacturers."}, {"viet": "Ứng cử viên tương lai của đảng Lao động ở cuộc tuyển cử tới.", "eng": "The prospective Labour candidate at the next election."}, {"viet": "Đầu Nữ hoàng xuất hiện nhìn nghiêng trên các con tem của Anh.", "eng": "The Queen's head appears in profile on British stamps."}, {"viet": "Mưa cứ rả rích cả đêm.", "eng": "The rain kept on all night."}, {"viet": "Dư ảnh màu đỏ của ngọn lửa bừng lên trước mắt tôi.", "eng": "The red afterimage of the... flame pulsing before my eyes."}, {"viet": "Bản báo cáo là một sự pha trộn giữa một phần đúng nhằm lừa dối và sự lừa bịp hoàn toàn.", "eng": "The report was a mixture of half truth and down right dishonesty."}, {"viet": "Sông Rhone đổ ra Địa Trung Hải.", "eng": "The Rhone empties into the Mediterranean."}, {"viet": "Con đường đó tới hồ là hết.", "eng": "The road dead-ends at the lake."}, {"viet": "Căn phòng được lót một tấm thảm mới.", "eng": "The room was fitted with a new carpet."}, {"viet": "Tủ két đã bị bọn trộm phá vỡ bằng thuốc nổ.", "eng": "The safe had been blown by the thieves."}, {"viet": "Kế hoạch đặt dưới sự bảo trợ của Hội Hướng đạo.", "eng": "The scheme is under the aegis of the Scout asociation."}, {"viet": "Loại thứ hai là khách sạn nghỉ mát phục vụ cho khách đi du lịch giải trí.", "eng": "The second is the resort hotel, which serves the tourists who travel for enjoyment."}, {"viet": "Bóng mát càng dài ra khi hoàng hôn càng đến gần.", "eng": "The shadows lengthened with the approach of sunset."}, {"viet": "Con tàu đã nghiêng về mạn trái.", "eng": "The ship was leaning over to port."}, {"viet": "Sự va đụng đã làm thủng mạn thuyền.", "eng": "The side of the boat was staved in by the collision."}, {"viet": "Có lúc, bầu trời có thể đầy mây.", "eng": "The sky may be very cloudy at one moment."}, {"viet": "Nữ bá tước ăn mặc lịch sự đó đã tiếp khách tại phòng khách.", "eng": "The soignee duchess received her guests in the drawing room."}, {"viet": "Con tàu vũ trụ đã được phóng lên vào buổi trưa.", "eng": "The spacecraft lifted off at noon."}, {"viet": "Sân vận động có thể ra hết người trong bốn phút.", "eng": "The stadium can be emptied in four minutes."}, {"viet": "Đá lạo xạo dưới bánh xe ô tô.", "eng": "The stones crunched under the car tyres."}, {"viet": "Người sinh viên đã ngoáy vội bài luận trong nửa tiếng đồng hồ.", "eng": "The student cobbled together an essay in half an hour."}, {"viet": "Tình trạng tốt hơn của vật này so với vật kia.", "eng": "The superiority of one thing to another."}, {"viet": "Những lời của thầy giáo là một sự khích lệ lớn đối với nó.", "eng": "The teacher's words were a great encouragement to him."}, {"viet": "Các đội xếp đồng hạng trong liên đoàn.", "eng": "The teams tied for first place in the league."}, {"viet": "Tên kẻ trộm đã bắt ép cô ấy phải đưa tiền ra.", "eng": "The thief forced her to hand over the money."}, {"viet": "Việc thay đổi thời gian bảng thông báo chẳng một ai mong muốn.", "eng": "The timing of the announcement was rather unexpected."}, {"viet": "Tàu đến lúc tám giờ 45 phút.", "eng": "The train arrived at four minutes past eight."}, {"viet": "Đoàn quân đi vội tới phòng ăn.", "eng": "The troops double-timed to the mess hall."}, {"viet": "Hai đảng hợp lại thành lập một đáng liên hiệp.", "eng": "The two parties have united to form a coalition."}, {"viet": "Liên Hiệp Quốc duy trì sự có mặt một lực lượng quân sự trong khu vực.", "eng": "The United Nations maintains a military presence in the area."}, {"viet": "Đội chiến thắng đã được tiếp đón rầm rộ khi họ về nước.", "eng": "The victorious team were given a tumultuous welcome when they arrived home."}, {"viet": "Chiến tranh đã kết thúc, đất nước tràn ngập những hi vọng về ngày mai.", "eng": "The war was at an end and the nation was full of hopes for the morrow."}, {"viet": "Cái bánh xe cần phải đưa cho thợ chữa.", "eng": "The wheel must go to the wright for repair."}, {"viet": "Các khung cửa sổ được phân biệt bằng màu xanh tương phản với tường màu trắng.", "eng": "The window frames are picked out in blue against the white walls."}, {"viet": "Việc tính toán tiền lương có thể được thực hiện bằng máy tính.", "eng": "The work of calculating wages can be done by a computer."}, {"viet": "Tất cả thanh niên đều uống Sô-đa.", "eng": "The young people all drink sodas."}, {"viet": "Nhà của họ khác nhà của tôi ở chỗ không có nhà để xe.", "eng": "Their house differs from mine in having no garage."}, {"viet": "Công việc của họ luân phiên giữa London và New York.", "eng": "Their work alternates between London and New York."}, {"viet": "Nếu nhà báo mà biết được các vụ bê bối này thì thật là vui đây.", "eng": "There'll some fun and games if the newspapers get hold of this scandal."}, {"viet": "Em anh có lời nhắn quan trọng cho anh đấy.", "eng": "There's an important message for you from your brother."}, {"viet": "Tôi sợ rằng chỉ còn lại một chút xíu cà phê thôi.", "eng": "There's only a dribble of coffee left, I'm afraid."}, {"viet": "Có hàng trăm người cần có nhà mới.", "eng": "There are hundreds of people who need new housing."}, {"viet": "Vẫn còn nhiều ghế trống.", "eng": "There are still a good few empty seats."}, {"viet": "Đã có nhiều người chết đuối hơn.", "eng": "There have been more deaths from drowning."}, {"viet": "Cuối mỗi chương đều có thư mục có ích.", "eng": "There is a useful bibliography at the end of each chapter."}, {"viet": "Có một ít kem trong tủ lạnh.", "eng": "There is some ice cream in the fridge."}, {"viet": "Suốt đêm đã mưa như trút.", "eng": "There was a heavy rain during the night."}, {"viet": "Có một sự náo động hỗn loạn khi tin tức được loan báo.", "eng": "There was pandemonium when the news announced."}, {"viet": "Ở đây sẽ luôn luôn có chỗ cho anh nếu anh quyết định quay lại.", "eng": "There will always be a place for you here if you decide to come back."}, {"viet": "Những bộ phim này chỉ phù hợp với người lớn thôi.", "eng": "These films are suitable for adults only."}, {"viet": "Những ghế này giành cho người già và người ốm.", "eng": "These seats are reserved for old and sick people."}, {"viet": "Người ta đang giật đổ các ngôi nhà cũ này để xây một khối nhà mới dùng làm cơ quan.", "eng": "They're tearing down these old houses to build a new office block."}, {"viet": "Tất cả bọn họ đều mặc y phục dân tộc.", "eng": "They are all dressed in national costume."}, {"viet": "Họ cho cô em họ cô ta có tính ghen tuông.", "eng": "They attribute her cousin with feeling of jealousy."}, {"viet": "Họ vẫn tự coi mình không thể bị tấn công.", "eng": "They considered themselves inviolate from attack."}, {"viet": "Họ đã thêm vào kho than của họ bằng việc kiếm củi đun.", "eng": "They eked out their coal by collecting firewood."}, {"viet": "Họ có bộ não tốt-ít ra chúng ta có thể đoán biết qua kích thước và hình dáng sọ của họ.", "eng": "They had good brains, at least we can guess that they had from the size and shape of their skulls."}, {"viet": "Họ mời chúng ta cùng dự bữa cơm thanh đạm của họ.", "eng": "They invited us to partake of their simple meal."}, {"viet": "Họ có thể làm hư các cháu nói của mình bằng cách quá chiều theo ý chúng.", "eng": "They may spoil their grandchildren by indulging them too much."}, {"viet": "Họ hứa từ nay không bao giờ say nữa.", "eng": "They promise never to get drunk henceforth."}, {"viet": "Dường như chúng là những cuộc họp hoặc những sự kiện quan trọng mà ở đó người Mỹ bản địa tụ họp và chia sẻ văn hóa của họ.", "eng": "They seem to be important meetings or events where Native Americans come together and share their culture."}, {"viet": "Họ đã mất công khó nhọc để tìm cho được đúng người cần cho công việc.", "eng": "They took a lot of trouble to find the right person for the job."}, {"viet": "Họ rất bàng hoàng trong vụ tai nạn.", "eng": "They were badly shaken in the accident."}, {"viet": "Chúng được sử dụng ở Ba-by-lon cách đây 2500 năm trước Công nguyên.", "eng": "They were used in Babylon as long as 2,500 B. C."}, {"viet": "Điều này chỉ có thể trả lời với ông thủ tướng.", "eng": "This answerable only to the Prime Minister."}, {"viet": "Công ty này có một thị trường nội địa lớn nhưng không xuất khẩu.", "eng": "This company has a large home market but doesn't export."}, {"viet": "Nhà máy này không còn sinh lợi nữa, cho nên nó chẳng còn tồn tại được mấy nỗi.", "eng": "This factory is no longer profitable, so its days are numbered."}, {"viet": "Đây là bản dịch, nguyên bản thì bằng tiếng Pháp.", "eng": "This is a translation, the original is in French."}, {"viet": "Đảo này nằm về phía nam của thành phố.", "eng": "This island bears to the south of the city."}, {"viet": "Vở kịch mới của anh ta bị các nhà phê bình phê phán gay gắt.", "eng": "This new play was really panned hy the critics."}, {"viet": "Quán rượu này là một nơi các nghệ sĩ thường thích lui tới.", "eng": "This pub is a favourite haunt of artists."}, {"viet": "Mứt dâu này vẫn còn lỏng, tôi không sao làm cho nó đông lại được.", "eng": "This strawberry jam is still runny, I can't get it to jell."}, {"viet": "Xe ô tô năm nay là một sự cải tiến mẫu xe năm ngoái.", "eng": "This year's car is an improvement on last year's model."}, {"viet": "Để tính năm của những chuyện xảy ra trước đó chúng ta đếm ngược từ năm thứ nhất.", "eng": "To give the date of earlier happenings, we count back from the year I."}, {"viet": "Về mùa đông việc mua bán không chạy Nhu cầu bị giảm đi cho đến hết những tháng hè.", "eng": "Trade is slack in winter Demand is slack over the summer months."}, {"viet": "Thông thường tiền thuế từ năm đến mười phần trăm giá ghi trên nhãn.", "eng": "Usually the tax is between five and ten percent of the price on the label."}, {"viet": "Nước có thể làm sách bằng cách chưng cất nó.", "eng": "Water can be made pure by distilling it."}, {"viet": "Chúng tôi sẽ tiếp tục từ chỗ chúng tôi đã làm xong hôm qua.", "eng": "We'll pick up where we finished yesterday."}, {"viet": "Chúng tôi đã gộp tất cả sinh viên tiên tiến vào một lớp.", "eng": "We're lumped all the advanced students into a single class."}, {"viet": "Chúng ta được tất cả nữ y tá ủng hộ trong cuộc đấu tranh nhằm ngăn chặn việc đóng cửa các xí nghiệp.", "eng": "We've got all the nurses with us in our fight to stop closures."}, {"viet": "Tất cả chúng tôi đều nuối tiếc vì việc phá huỷ một toà nhà yêu dấu.", "eng": "We all mourn the destruction of a well loved building."}, {"viet": "Chúng tôi rất vui được có mặt ở đây tối nay, tại bữa tiệc chiêu đãi chào mừng chúng tôi.", "eng": "We are quite pleased to be here tonight at this reception given in our honor."}, {"viet": "Chúng tôi về nhà và thấy cô ta đang ngủ trên xô pha.", "eng": "We came home and found her asleep on the sofa."}, {"viet": "Chúng tôi không thể bỏ lệ ấy trừ trường hợp bị bệnh.", "eng": "We cannot waive this rule except in case of illness."}, {"viet": "Chúng ta đã không giành được hợp đồng: chúng ta đã thua sát nút một công ty bỏ giá thấp hơn.", "eng": "We didn't win the contract: we were pipped at the post by a firm whose price was lower."}, {"viet": "Chúng tôi thả con thuyền giữa dòng sông.", "eng": "We floated the canoe out into the middle of the river."}, {"viet": "Chúng tôi còn lại nhiều chai bia-tất cả ( các chai đó ) đều đã biến mất.", "eng": "We had several bottles of beer left-all ( of them ) have disappeared."}, {"viet": "Chúng tôi có món nướng sốt Pháp, Rouquefort và nước sốt thập cẩm.", "eng": "We have French, Rouquefort and thousand island dressing."}, {"viet": "Chúng tôi thuê công nhân, tài xế, mọi người ở địa phương.", "eng": "We hire local workers, drivers, everyone."}, {"viet": "Chúng tôi sẽ gửi ngay cho các ông bản đã sửa lỗi.", "eng": "We'll send you the corrected version immediately."}, {"viet": "Chúng ta phải tống khứ lũ ruồi mắc dịch này đi.", "eng": "We must get rid of these pestilential flies."}, {"viet": "Chúng tôi cần biết tội ác có được mưu tính trước hay không.", "eng": "We needed to know whether the crime had been premeditated."}, {"viet": "Chúng tôi nhận được giấy báo là chúng tôi chưa trả tiền điện.", "eng": "We received a reminder that we had not paid the electric bill."}, {"viet": "Chúng ta nên nhờ ký duyệt ngân phiếu du lịch ở đây.", "eng": "We should have the traveler's cheques countersigned here."}, {"viet": "Đến Lancaster, chúng tôi rẽ ra khỏi xa lộ.", "eng": "We turned off the motorway at Lancaster."}, {"viet": "Chúng tôi phát hoảng khi biết là có thể mất kỳ nghỉ.", "eng": "We were appalled at the prospect of having to miss our holiday."}, {"viet": "Ông trả cho được bao nhiêu chúng tôi cũng xin cám ơn.", "eng": "We will be grateful for whatever amount you can afford."}, {"viet": "À, anh có thể giới thiệu một món cho chúng tôi không?", "eng": "Well, can you recommend one for us?"}, {"viet": "À, xin hãy yêu cầu bà ấy gọi điện thoại khi bà ấy quay về.", "eng": "Well, please ask her to ring us up when she gets back."}, {"viet": "Có ô tô mà không biết lái thì có lợi gì?", "eng": "What's the good of having a car if you can't drive?"}, {"viet": "Những thiếu sót của các hệ thống y tế hiện thời ở Nhật Bản là gì?", "eng": "What are the faults of the current medical systems in Japan?"}, {"viet": "Tất cả các nhân viên làm gì?", "eng": "What do all the men do?"}, {"viet": "Những khoản này xếp vào đề mục nào?", "eng": "What heading do these items fall under?"}, {"viet": "Dân số ở quê bạn là bao nhiêu?", "eng": "What is the population of your hometown?"}, {"viet": "Điều gì đã làm cho ông quyết định đến với công ty chúng tôi?", "eng": "What made you decide to join our company?"}, {"viet": "Điều mà Tổng thống dự kiến là một thế giới không có vũ khí hạt nhân.", "eng": "What the President has in view is a world without nuclear weapons."}, {"viet": "Khi nào ông sẽ về hưu?", "eng": "When are you going to retire?"}, {"viet": "Khi tôi viết xong câu chuyện, tôi đã đọc cho bạn tôi nghe.", "eng": "When I'd written the story, I read it to my friend."}, {"viet": "Khi cô ta bảo tôi là thô lỗ, tôi thực sự nổi giận.", "eng": "When she said I was rude, I really burned."}, {"viet": "Tử Cấm Thành được xây dựng khi nào?", "eng": "When was the Forbidden City built?"}, {"viet": "Tôi có thể mua vé ở đâu?", "eng": "Where can I purchase a ticket?"}, {"viet": "Cửa hàng bách hóa nào phục vụ giới trẻ?", "eng": "Which department store caters to the young generation?"}, {"viet": "Khi còn đang đi học, Nick đã phải chui rúc trong một căn phòng bé xíu.", "eng": "While he was studying, Nick had to slum it in a tiny room."}, {"viet": "Đội bóng chày bạn yêu thích là đội nào?", "eng": "Who is your favorite baseball team?"}, {"viet": "Tại sao chúng ta không trọ ở nhà trọ địa phương?", "eng": "Why don't we adjourn to the local hostelry?"}, {"viet": "Ngày mai bắt đầu làm việc thì có tiện cho anh không?", "eng": "Will it be convenient for you to start work tomorrow?"}, {"viet": "Anh sẽ lo thu xếp cho buổi họp tới của hội đồng chứ?", "eng": "Will you see to the arrangements for the next committee meeting?"}, {"viet": "Với mái tóc ngắn tôi có thể được người ta cho là một cậu bé.", "eng": "With my hair cut short I could have passed for a boy."}, {"viet": "Công nhân đến để tháo dỡ giàn giáo.", "eng": "Workmen arrived to take down the scaffolding."}, {"viet": "Ông muốn đi máy bay hãng American Airlines, Western, TWA hay United?", "eng": "Would you like to fly American Airlines, Western, TWA or United?"}, {"viet": "Vui lòng nói với ông ấy rằng bởi vì có một số công việc đột xuất nên tôi sẽ không thể tham dự giải thi đấu gôn vào sáng mai được.", "eng": "Would you please tell him that because of some unexpected business, I won't be able to take part in the golf tournament tomorrow morning."}, {"viet": "Vâng, tôi có thể mua một vài nhân dân tệ Trung Quốc bằng đô la Mỹ ở đây không?", "eng": "Yes, can I buy some Chinese Yuan with American dollars here?"}, {"viet": "Vâng, anh làm ơn cho tôi biết tôi phải làm gì để nhờ chuyển tiền đến đây cho tôi từ Luôn Đôn được không?", "eng": "Yes, would you tell me what I should do to have money transferred to me here from London?"}, {"viet": "Anh phải đẩy thật mạnh, cái cửa này hơi khó mở.", "eng": "You'll have to push hard, that door is a bit stubborn."}, {"viet": "Chắc chắn anh sẽ thất bại nếu anh làm cách đó.", "eng": "You're sure to fail if you do it that way."}, {"viet": "Bây giờ anh là người tù của chúng tôi và chúng tôi sẽ không thả anh ra cho đến khi nhận được tiền chuộc.", "eng": "You are our prisoner now and we won't release you until a ransom is paid."}, {"viet": "Anh không thể sử dụng nó trong tình trạng hiện nay.", "eng": "You can't use it in its present condition."}, {"viet": "Bạn có thể nhìn thấy hơi thở của mọi người vào ngày rét.", "eng": "You can see people's breath on a cold day."}, {"viet": "Cháu không bao giờ không để ý đến đèn giao thông, đúng không?", "eng": "You don't ignore the traffic lights, right?"}, {"viet": "Ông phải trả thêm một khoản tiền cho việc giao hàng hoả tốc.", "eng": "You have to pay a premium for express delivery."}, {"viet": "Anh có thể phải sống thiếu thốn một chút nếu anh tới ở.", "eng": "You may have to rough it a bit if you come to stay."}, {"viet": "Anh ta phải gạt sang một bên bất cứ ý nghĩ nào về ý định nghỉ phép năm nay.", "eng": "You must put aside any ideas of a holiday this year."}, {"viet": "Không có chi, đó là công việc của tôi mà.", "eng": "You're welcome but it's my job."}, {"viet": "Anh nên coi những gì xảy ra với tôi là một sự cảnh cáo đối với anh.", "eng": "You should take warning from what happened to me."}, {"viet": "Anh có thể làm điều đó phụ thuộc vào lòng dũng cảm của anh.", "eng": "You will be able to do it according as you have the courage."}, {"viet": "Bản viết tay tuyệt đẹp của anh hơn hẳn bản viết nguệch ngoạc của tôi.", "eng": "Your beautiful handwriting puts my untidy scrawl to shame."}, {"viet": "Hành động mau lẹ của anh đã ngăn chặn được một tai nạn nghiêm trọng.", "eng": "Your prompt action prevented a serious accident."}]