[{"viet": "Một nhóm người tận tụy đoàn kết với nhau chống lại những người không đồng ý với họ.", "eng": "A band of true believers bonded together against those who did not agree with them."}, {"viet": "Một buổi lễ để tỏ lòng thành kính với những người đã hy sinh trong trận chiến đấu.", "eng": "A ceremony in honour of those killed in battle."}, {"viet": "Một công ty khởi đầu bằng một số vốn nhỏ.", "eng": "A company that started on a shoestring."}, {"viet": "Đám đông nhanh chóng tụ tập tại địa điểm xảy ra tai nạn.", "eng": "A crowd soon collected at the scene of the accident."}, {"viet": "Các cuộc bầu cử diễn ra không được như mong muốn.", "eng": "A dismal performance in the elections."}, {"viet": "Vài tia nắng yếu ớt le lói trong buổi chiều ảm đạm.", "eng": "A few faint gleams of sunshine lit up the gloomy afternoon."}, {"viet": "Một con chồn bị lũ chó săn đuổi theo sát nút.", "eng": "A fox with the hounds in hot pursuit."}, {"viet": "Một chiếc tàu chở hàng chạy qua.", "eng": "A goods train passed."}, {"viet": "Một lò sưởi chạy tốn rất ít điện.", "eng": "A heater that runs on a very low wattage."}, {"viet": "Một bản nhạc jazz cải biên từ một điệu nhạc cũ.", "eng": "A jazzed up version of an old tune."}, {"viet": "Một vị lãnh đạo có tính can đảm và quả quyết.", "eng": "A leader with courage and determination."}, {"viet": "Nhiều người xếp hàng nối đuôi chờ xem phim.", "eng": "A lot of people queuing for the film."}, {"viet": "Một trận thua không còn hy vọng cứu vãn được.", "eng": "A match lost beyond all hope of retrieval."}, {"viet": "Con la là con vật con không thể sinh sản được của một con ngựa và một con lừa.", "eng": "A mule is the sterile young of a horse and a donkey."}, {"viet": "Một quyển tiểu thuyết với một cốt truyện rất giả tạo.", "eng": "A novel with a very contrived plot."}, {"viet": "Não của con người gồm ba bộ phận chính.", "eng": "A person's brain has three main parts."}, {"viet": "Một chính sách nhằm giảm bớt lãng phí.", "eng": "A policy aimed at reducing waste."}, {"viet": "Một giai đoạn sáng tác nhiều của đời người nhạc sĩ.", "eng": "A prolific period in the composer's life."}, {"viet": "Một phóng viên đang săn tin.", "eng": "A reporter nosing around for news."}, {"viet": "Một chiếc nhẫn sa-phia nạm sáu hột ngọc nhỏ.", "eng": "A sapphire ring with six small stones."}, {"viet": "Một chuyến hàng mễ cốc sang Tây Phi.", "eng": "A shipment of grain for West Africa."}, {"viet": "Một bức thơ khinh rẻ từ chối lời mời.", "eng": "A snooty letter refusing the invitation."}, {"viet": "Một bài nói đều đều chán ngắt của người diễn thuyết.", "eng": "A steady drone from the lecturer."}, {"viet": "Một người tổng hợp các ý kiến khác nhau do những người khác nghĩ ra.", "eng": "A synthesizer of varied ideas conceived by others."}, {"viet": "Một công đoàn có nhiều thế lực.", "eng": "A trade union with plenty of muscle."}, {"viet": "Một cuộc đi bộ trong không khí mát mẻ sẽ làm tôi sảng khoái.", "eng": "A walk in the fresh air will pep me up."}, {"viet": "Một cái hố sâu toác hoác do một trận động đất tạo thành.", "eng": "A yawning gulf opened up by an earthquake."}, {"viet": "Về chỗ làm việc hết đi, tôi nghe ông chủ đang đến đấy!", "eng": "Action stations, I can here the boss coming!"}, {"viet": "Sau khi một chiếc máy bay đến nơi, các nhân viên phụ trách hành lý dỡ túi xách xuống và chuyển chúng đến khu vực nhận hành lý.", "eng": "After a plane reaches its destination, handlers unload bags and transport them to the baggage claim area."}, {"viet": "Khán giả ra về sau nhiều tràng pháo tay.", "eng": "After much applause the audience went home."}, {"viet": "Sau ba ngày trên biển, chúng tôi mới nhìn thấy đất liền.", "eng": "After three days at sea, we sighted land."}, {"viet": "Tất cả các bạn của cô đều đã được thuyết phục giúp vào việc tổ chức môn thi đấu đó.", "eng": "All her friends have been roped in to help organize the event."}, {"viet": "Tất cả các đoàn vũ kịch dân tộc đều soạn ra kịch điệu vũ dân gian.", "eng": "All the ethnic dance troupes theatricalize the dance of the folk."}, {"viet": "Mặc dù kém tài nhưng anh ấy vẫn thắng chỉ do lòng kiên trì bền bỉ của mình.", "eng": "Although he's less talented, he won by sheer dogged persistence."}, {"viet": "Sự xem lại một cú đá phạt đền.", "eng": "An action replay of a penalty kick."}, {"viet": "Một cử tọa bị quyến rũ bởi giọng nói của cô ta.", "eng": "An audience mesmerized by her voice."}, {"viet": "Một ý nghĩ vừa đến với tôi.", "eng": "An idea has occurred to me."}, {"viet": "Một bà cụ bị một bọn thanh niên du đãng trấn lột trong công viên.", "eng": "An old lady mugged by a gang of youths in the park."}, {"viet": "Đồ gốm cổ mà nhiều mẫu đã mất.", "eng": "Ancient pottery whereof many examples are lost."}, {"viet": "Thế là người ta lấy một ngày khác của tháng hai để cộng thêm cho tháng tám.", "eng": "Another day, there fore, was taken from February to add a day to August."}, {"viet": "Bổ nhiệm một người kế tục ông hiệu trưởng.", "eng": "Appoint a successor to the headmaster."}, {"viet": "Anh có thường đọc những tác phẩm của Shakespeare không?", "eng": "Are you acquainted with the works of Shakespeare?"}, {"viet": "Anh vẫn còn đi tới đi lui trên sân khấu chớ?", "eng": "Are you still treading the boards?"}, {"viet": "Theo lệ thường, trang đầu tiên của cuốn sách được trang trí, tô màu rất đẹp.", "eng": "As a rule, beginning letters were beautifully colored."}, {"viet": "Khi chiếc xe buýt rẽ ở góc phố, nó đã va phải một chiếc xe tải.", "eng": "As the bus turned the corner, it collided with a van."}, {"viet": "Thoạt nhìn các kế hoạch có vẻ không thực hiện được.", "eng": "At first glance the plans seemed unworkable."}, {"viet": "Nối với cái gì bằng một đoạn dây.", "eng": "Attach something with a piece of string."}, {"viet": "Nếu không có rủi ro gì chúng ta sẽ đến đúng giờ.", "eng": "Barring accidents, we should arrive on time."}, {"viet": "Đang túc trực theo dõi phòng một biến chuyển bất ngờ trong tình trạng của bệnh nhân.", "eng": "Be on the watch for a sudden change in the patient's condition."}, {"viet": "Trước khi tôi kết thúc, còn hai điều nữa cần phải nói.", "eng": "Before I wind up, there are two more things to be said."}, {"viet": "Bill thề sẽ trả đũa anh mình vì anh ta đã chơi xỏ Bill.", "eng": "Bill swore he'd get even with his brother, who'd played a dirty trick on him."}, {"viet": "Những giám đốc chi nhánh hoàn toàn độc lập trong khu vực riêng của mình.", "eng": "Branch managers have full autonomy in their own areas."}, {"viet": "Chi phí xây dựng lên đến sáu triệu đô la.", "eng": "Building costs amount to six million dollars."}, {"viet": "Nhưng nếu việc giao hàng chậm thì chúng tôi sẽ mất đơn đặt hàng!", "eng": "But if the delivery is late, we will lose the order!"}, {"viet": "Nhưng bà sẽ phải điền vào một phiếu mượn.", "eng": "But you'll have to fill out a rental slip."}, {"viet": "Nhân tiện, ông muốn loại đơn vị tiền tệ nào?", "eng": "By the way, what denominations do you like to have?"}, {"viet": "Để tôi giúp cô mặc áo khoác nhé?", "eng": "Can I help you on with your coat?"}, {"viet": "Anh kéo cái nút chai này ra được không?", "eng": "Can you draw the cork out?"}, {"viet": "Bạn có thể giới thiệu sách nào đó để đọc giải trí được không?", "eng": "Can you recommend some light reading?"}, {"viet": "Khi băng qua đường cần thận trọng.", "eng": "Care is needed when crossing the road."}, {"viet": "Chaucer không những đã đi tới chỗ nghi ngờ giá trị của nhóm làm việc đặc biệt của mình mà còn không thừa nhận nhóm đó nữa.", "eng": "Chaucer not only came to doubt the worth of his extraordinary body of work, but repudiated it."}, {"viet": "Nhiều chuyện kết hợp lại đã làm tiêu tan chương trình cho ngày nghỉ của chúng tôi.", "eng": "Circumstances have combined to ruin our plans for a holiday."}, {"viet": "Hãy đến xem cô ta diễn với ban nhạc mới.", "eng": "Come and see her in performance with the new band."}, {"viet": "Tình trạng mà các bà mẹ trẻ cảm thấy gần như bị cầm tù trong nhà của mình.", "eng": "Conditions in which young mothers feel virtually imprisoned in their homes."}, {"viet": "Các ủy viên quản trị của công ty thường hưởng lương cao.", "eng": "Corporate executives usually have high salaries."}, {"viet": "Bạn có thể giới thiệu cho tôi một kế toán viên giỏi không?", "eng": "Could you put me on to a good accountant?"}, {"viet": "Những đám đông tụ tập đông nghẹt quảng trường chính của thành phố.", "eng": "Crowds thronged the main square of the city."}, {"viet": "Deborah tin ông ta, đồng thời nêu ra trước hết rằng cô ta không phải là người thông minh nhất.", "eng": "Deborah believes him, indicating, for starters, that she isn't the brightest."}, {"viet": "Mặc dầu thành đạt trong nghề nghiệp, nhưng cô luôn luôn bị lu mờ trước người chồng.", "eng": "Despite her professional success, she was always overshadowed by her husband."}, {"viet": "Bạn có làm việc bán thời gian khi còn là sinh viên không?", "eng": "Did you have a part-time job when you were a student?"}, {"viet": "Những vũ công disco được đèn lấp lóe chiếu sáng.", "eng": "Disco dancers lit by strobe lights."}, {"viet": "Làm gia công cho một xí nghiệp may mặc.", "eng": "Do outwork for a clothing factory."}, {"viet": "Bạn có tham gia hoạt động ngoại khóa nào không?", "eng": "Do you do any extra curricular activities?"}, {"viet": "Cô có viên thuốc chống say sóng nào không?", "eng": "Do you have any pills for sick ness?"}, {"viet": "Bạn có thích nghe nhạc đồng quê hay nhạc miền tây không?", "eng": "Do you like listening to country and western music?"}, {"viet": "Thỉnh thoảng bạn có bị cảm không?", "eng": "Do you sometimes catch a cold?"}, {"viet": "Bạn có muốn tôi cho bạn đi nhờ xe không?", "eng": "Do you want me to give you a lift?"}, {"viet": "Nước bạn có những hạn định nghiêm ngặt về ô nhiễm đối với các công ty không?", "eng": "Does your country have strict pollution restrictions for companies?"}, {"viet": "Đừng có cái kiểu chưa đỗ ông nghè đã đe hàng tổng.", "eng": "Don't count your chickens before they are hatched."}, {"viet": "Đừng để đèn-đó là một sự lãng phí điện!", "eng": "Don't leave the lights on-it wastes electricity!"}, {"viet": "Đừng có đứng đó cãi nhau về chuyện ấy.", "eng": "Don't stand there arguing about it."}, {"viet": "Con không biết rằng thời điểm duy nhất con có thể đùa nghịch là vào lễ Halloween à?", "eng": "Don't you know the only time you can play tricks is on Halloween?"}, {"viet": "Do có nhiều người lớn tuổi ở Nhật Bản, thế hệ trẻ phải đóng thuế nhiều để góp phần vào phúc lợi.", "eng": "Due to the large number of elderly people in Japan, younger generations pay a lot of tax to provide benefits."}, {"viet": "Với anh thì cách nào cũng được.", "eng": "Either way is fine with me."}, {"viet": "Thiết lập mối quan hệ mật thiết với ai.", "eng": "Establish a close relationship with somebody."}, {"viet": "Mọi người đều đứng lên khi Nữ Hoàng vào.", "eng": "Everyone stood up when the Queen entered."}, {"viet": "Sự tập thể dục sẽ làm cho bắp thịt của bạn rắn chắc.", "eng": "Exercise will firm up your muscles."}, {"viet": "Những người hâm mộ đã lũ lượt kéo xuống phòng hoà nhạc.", "eng": "Fans had descend on the concert hall in their hordes."}, {"viet": "Năm mươi xu là năm hào?", "eng": "Fifty fen is called five Jiao?"}, {"viet": "Cá chóng ươn thối trong mùa nóng.", "eng": "Fish soon goes bad in hot weather."}, {"viet": "Thực phẩm khan hiếm suốt thời gian chiến tranh.", "eng": "Food was scare throughout the war."}, {"viet": "Choàng thêm chiếc áo khoác dày để chống lạnh, anh ta bước ra ngoài trời tuyết.", "eng": "Fortified against the cold by a heavy coat, he went out into the snow."}, {"viet": "Sự kéo dài thêm cuộc thảo luận sẽ không đạt được một điều gì cả.", "eng": "Further protraction of the discussion will not achieve anything."}, {"viet": "Cút ngay khỏi đây, ông ta quát chúng tôi.", "eng": "Get out of here, he snarled at us."}, {"viet": "Đưa cho em bé bình sữa đi; cái đó giữ cho nó yên được một lát.", "eng": "Give the baby her bottle; that'll keep her quiet for a while."}, {"viet": "Quẹo cua với tốc độ 80 dặm một giờ.", "eng": "Going around the corner at 80 mph."}, {"viet": "Phết keo lên mép một mảnh giấy.", "eng": "Gum the edges of a piece of paper."}, {"viet": "Xe ôtô của anh đã được kiểm tra định kỳ chưa?", "eng": "Has your car had its MOT?"}, {"viet": "Bạn đã bao giờ mua bất thứ gì ở chợ trời chưa?", "eng": "Have you ever bought anything at a flea market?"}, {"viet": "Anh đã trả số tiền anh nợ tôi chưa?", "eng": "Have you paid me back the money you owe me yet?"}, {"viet": "Rồi nó sẽ phải theo mọi người.", "eng": "He'll have to fall into line with the others."}, {"viet": "Anh ta là một người cực kỳ kín đáo, vì thế anh ta rất ngại cho phỏng vấn.", "eng": "He's an extremely private person, hence his reluctance to give interview."}, {"viet": "Hắn sống cái kiểu tiêu chuẩn hai mặt: hắn yêu đương lăng nhăng thì được nhưng cô ta thì không được.", "eng": "He's got a double standard: it's all right for him to have affairs but not for her."}, {"viet": "Anh ta cũng đã lớn tuổi rồi đủ để tự lo lấy mình.", "eng": "He's old enough to take care of himself."}, {"viet": "Nó ốm nặng nhưng các bác sĩ cho rằng nó sẽ qua khỏi.", "eng": "He's very ill but doctors expect him to come through."}, {"viet": "Nó xin lỗi vì những phiền phức mà nó đã gây ra.", "eng": "He apologized for the inconvenience he had caused."}, {"viet": "Anh ta đã đoạt được giải nhất.", "eng": "He bore away the first prize."}, {"viet": "Nó chắc không ngủ được vì những tiếng ồn đó.", "eng": "He can't have slept through all that noise."}, {"viet": "Anh ấy không sao nhịn cười được.", "eng": "He could scarcely suppress a laugh."}, {"viet": "Anh ta đã làm bài tính cộng, nhưng ra đáp số sai.", "eng": "He did the sum but got the wrong answer."}, {"viet": "Anh ta trầm ngâm rít hơi thuốc trong ống điếu tẩu.", "eng": "He drew thoughtfully on his pipe."}, {"viet": "Anh ấy hạ nốc ao kẻ thù chỉ bằng một cú đấm.", "eng": "He fell his enemy with a single blow."}, {"viet": "Nó rú lên một tiếng to và làm rơi cái chảo xuống.", "eng": "He gave a loud shriek and dropped the pan."}, {"viet": "Cậu bé nài nỉ người chị giúp cậu làm bài tập ở nhà.", "eng": "He got his sister to help him with his homework."}, {"viet": "Anh ấy không có ý muốn xâm phạm vào sự riêng tư của họ.", "eng": "He had no wish to intrude on their privacy."}, {"viet": "Ông ấy luôn luôn thích mua bán chứng khoán.", "eng": "He has always been fond of securities trading."}, {"viet": "Anh ta có giọng nói thật êm ái.", "eng": "He has quite a musical voice."}, {"viet": "Anh ta bị đau lưng khi té xuống.", "eng": "He hurt his back when he failed."}, {"viet": "Anh ta hiện sống ở Úc vì có thị thực được làm việc vào kỳ nghỉ.", "eng": "He is in Australia on a working holiday visa."}, {"viet": "Nó tận tình với công việc của mình.", "eng": "He is wedded to his work."}, {"viet": "Anh ta dẫn nhóm đó vào khu vườn.", "eng": "He led the group out into the garden."}, {"viet": "Ông ấy có vẻ run chân.", "eng": "He looks a bit shaky on his feet."}, {"viet": "Có thể anh ta ngu dốt và bần tiện, nhưng anh ta có một thứ bù lại là tính hài hước của mình.", "eng": "He may be stupid and mean, but his one saving grace is his humour."}, {"viet": "Ông ấy bận rộn với một số công việc ngân hàng.", "eng": "He occupied himself with some banking business."}, {"viet": "Anh ta nài xin cha mẹ có thái độ hiểu biết hơn.", "eng": "He pleaded with his parents for a more understanding attitude."}, {"viet": "Hắn thọc hai tay vào trong túi.", "eng": "He put his hands in his pockets."}, {"viet": "Anh ta đã thu băng những bài hát nổi tiếng nhất của mình năm 1991.", "eng": "He recorded his most popular songs in 1991."}, {"viet": "Nó lấy lòng bàn tay xoa trán.", "eng": "He rubbed his palm across his forehead."}, {"viet": "Anh ấy là một chuyên gia về điện tử.", "eng": "He's an expert in electronics."}, {"viet": "Ông ta ở cương vị may mắn là không bao giờ phải lo chuyện tiền bạc.", "eng": "He's in the happy position of never having to worry about money."}, {"viet": "Hắn ta quả là một thằng tầm thường mà tự phụ.", "eng": "He's such a little squirt."}, {"viet": "Anh ta ngồi hai chân chụm lại xuống dưới.", "eng": "He sat with his legs tucked up under him."}, {"viet": "Ông ta đã tấn công những kẻ đột nhập bằng một cây gậy.", "eng": "He set about the intruders with a stick."}, {"viet": "Ông ta đau khổ vì những lời công kích điên cuồng đối với bộ phim của ông.", "eng": "He smarted from the savage attacks on his film."}, {"viet": "Anh ta có cơ hội tốt để thi đậu kỳ thi này.", "eng": "He stands a fair chance of passing the examination."}, {"viet": "Ông ta đệ đơn từ chức, kèm theo sự thú nhận tội lỗi của ông ta.", "eng": "He submitted his resignation, together with an admission of his guilt."}, {"viet": "Ông ta cho rằng tất cả những ai có đức tin đều sẽ lên thiên đường.", "eng": "He thinks that everyone who believes will go to heaven."}, {"viet": "Anh ta hát giọng nam cao trong ban đồng ca nhà thờ.", "eng": "He took the part of the tenor in the church choir."}, {"viet": "Anh ta lật cổ áo khoác lên để chống cơn gió buốt.", "eng": "He turned up his coat collar against the chill wind."}, {"viet": "Nó muốn nói cho thiên hạ biết tin.", "eng": "He wanted to tell the news to the world."}, {"viet": "Ông ta được yêu cầu làm trọng tài giải quyết cuộc tranh chấp gay gắt giữa ban giám đốc và công đoàn.", "eng": "He was asked to arbitrate a serious dispute between management and the unions."}, {"viet": "Người cậu ta đầy vết thâm tím sau khi ngã xe đạp.", "eng": "He was covered in bruises after falling off his bicycle."}, {"viet": "Anh ta được dành cho một cơ hội tham gia thẳng cuộc thi đấu đó.", "eng": "He was given a wild card to take part in the tournament."}, {"viet": "Ông quan tâm hơn đến việc cố đưa ra một sự giải thích cho những gì ông đã nhìn thấy.", "eng": "He was more interested in trying to work out an explanation of what he had seen."}, {"viet": "Đối với một đứa bé thì nó lặng lẽ một cách đáng ngạc nhiên.", "eng": "He was remarkably quiet for such a young child."}, {"viet": "Nó đã bị lôi kéo vào một cuộc đời tội lỗi vì lòng tham lam và tính lười biếng.", "eng": "He was tempted into a life of crime by greed and laziness."}, {"viet": "Nó ngồi xem trận đấu từ chỗ chót vót trên nóc bờ tường.", "eng": "He watched the game from his perch on top of the wall."}, {"viet": "Nó nháy mắt ra hiệu cho tôi là nó đang bông đùa người khác.", "eng": "He winked at me to show that he was playing a joke on the others."}, {"viet": "Anh ta viết thư cho tôi báo là anh ta sẽ đến vào ngày thứ Tư.", "eng": "He wrote me that he would be arriving on Wednesday."}, {"viet": "Những thành tích của cô ta phản ánh lòng can đảm của mình.", "eng": "Her achievements are a reflection of her courage."}, {"viet": "Trường hợp của cô ta không được chính quyền quan tâm tới.", "eng": "Her case was unheard by the authorities."}, {"viet": "Những thành tựu đầu tiên của nàng báo trước tương lai vĩ đại của nàng.", "eng": "Her early achievements were prophetic of her future greatness."}, {"viet": "Chiến thắng giành huy chương vàng của cô đã gỡ lại lần thất bại choáng váng trong giải Vô địch châu Âu.", "eng": "Her gold-medal victory laid the ghost of her shock defeat in the European Championships."}, {"viet": "Trí thông minh của cô ta gần như siêu việt.", "eng": "Her intelligence seems almost superhuman."}, {"viet": "Miệng cô ta mở ra rồi ngậm lại nhưng không nói được tiếng nào.", "eng": "Her mouth opened and shut, but no sound came out."}, {"viet": "Những bài thơ của cô ta vẫn còn chưa in.", "eng": "Her poems are still in manuscript."}, {"viet": "Chiếc áo váy lụa của cô ta kêu sột soạt khi cô ta di chuyển.", "eng": "Her silk dress rustled as she moved."}, {"viet": "Việc cô ta đến bất ngờ đã làm chúng tôi hoàn toàn mất trật tự.", "eng": "Her unexpected arrival threw us into total confusion."}, {"viet": "Đây là ngân phiếu du lịch 50 đô la.", "eng": "Here's my traveler's cheque for $ 5."}, {"viet": "Sự đáp ứng lạnh nhạt đối với tấm bi kịch ấy chứng tỏ anh ta không hiểu vở kịch.", "eng": "His apathetic response to the tragedy showed he did not understand the play."}, {"viet": "Em anh ta chẳng hợp với anh ta lắm.", "eng": "His brother is not much of a companion for him."}, {"viet": "Hồ sơ tội trạng của anh ta khó làm tôi tin anh ta được.", "eng": "His criminal record does not dispose me to trust him."}, {"viet": "Gương mặt anh ta bớt lo lắng và nở một nụ cười.", "eng": "His face relaxed into a smile."}, {"viet": "Cách cư xử tốt của anh ta khiến cho mọi người quí mến anh ta.", "eng": "His good manners predispose people in his favour."}, {"viet": "Công việc ngoại giao là bức bình phong che hoạt động tình báo của ông ta.", "eng": "His job as a diplomat was a blind for his spying."}, {"viet": "Đầu óc anh ta quay cuồng đến nỗi anh ta hầu như không kiểm soát được những suy nghĩ của mình.", "eng": "His mind was in such a whirl that he could hardly compose his thoughts."}, {"viet": "Theo nhận thức của ông ta là các điều kiện đã không thay đổi.", "eng": "His perception that conditions had not changed."}, {"viet": "Nhận xét của anh ta khá sỗ sàng.", "eng": "His remarks were rather close to the bone."}, {"viet": "Chứng đau bụng đã làm cho anh ta cảm thấy khổ sở cả ngày.", "eng": "His stomach-ache made him feel wretched all day."}, {"viet": "Lời kể của anh ta về các sự kiện đều trái ngược với tất cả các chứng cứ.", "eng": "His version of events flies in the face of all the evidence."}, {"viet": "Giữ vững niềm tin, lí tưởng, nguyên tắc v. v. của mình.", "eng": "Hold firm to one's beliefs, ideals, principles, etc."}, {"viet": "Thời tiết quá nóng luôn làm tôi bơ phờ.", "eng": "Hot weather always drags me down."}, {"viet": "Làm thế nào chúng ta có thể tăng thêm uy tín của chúng ta ( trong công chúng )?", "eng": "How can we improve our ( public ) image?"}, {"viet": "Làm thế nào để tôi đến bưu điện?", "eng": "How do I get to the post office?"}, {"viet": "Đội mới đang được phát triển ra sao?", "eng": "How is the new team shaping up?"}, {"viet": "Một năm bạn đi nghe bao nhiêu buổi hòa nhạc?", "eng": "How many concerts a year do you go to?"}, {"viet": "Sẽ phải cần bao nhiêu sự thay đổi?", "eng": "How much alteration will be necessary?"}, {"viet": "Bao lâu một lần bạn nhận điện thoại của bạn bè?", "eng": "How often do you receive phone calls from your friends?"}, {"viet": "Hàng trăm đĩa mới được cho ra mỗi tuần nhưng chỉ có ít đĩa được lọt vào danh sách những bài hay nhất.", "eng": "Hundreds of new records are produced each week but few of them get into the charts."}, {"viet": "Con muốn kết hôn tại Hawaii này vào một ngày nào đó.", "eng": "I'd like to get married here in Hawaii someday."}, {"viet": "Tôi sẽ mắng cho nó một trận vì đã nhét những thứ rác rưởi của hắn vào tủ búp phê của tôi.", "eng": "I'll bollock him for sticking his rubbish in my cupboard."}, {"viet": "Tôi sẽ giữ nó tại quầy tới ngày mai.", "eng": "I'll keep it at the counter till tomorrow."}, {"viet": "Tôi đang cố thuyết phục ông ta đóng góp.", "eng": "I'll try to wangle a contribution out of him."}, {"viet": "Tôi chắc chắn ông ta bảo tôi đến vào lúc hai giờ.", "eng": "I'm certain he told me to come at two o'clock."}, {"viet": "Tôi sẽ tới cửa hàng bánh mì để mua bánh mì.", "eng": "I'm going to the baker's to get some bread."}, {"viet": "Bằng chứng ấy không hoàn toàn làm tôi tin được.", "eng": "I'm not fully persuaded by the evidence."}, {"viet": "Tôi đói đến nỗi bụng tôi đang sôi lên.", "eng": "I'm so hungry that my stomach's rumbling."}, {"viet": "Tôi dám chắc là anh đã sáng suốt chờ đợi ít ngày.", "eng": "I'm sure you're wise to wait a few days."}, {"viet": "Tôi luôn luôn là người say mê những phim lãng mạn.", "eng": "I've always been a sucker for romantic movies."}, {"viet": "Tôi đã hoàn thành một phần khá lớn bài viết của mình.", "eng": "I've completed a fair chunk of my article."}, {"viet": "Tôi đã mời hàng triệu người đến dự bữa tiệc tôi thết.", "eng": "I've invited millions of people to my party."}, {"viet": "Tôi đã qua nhiều đêm không ngủ lo lắng không hiểu mình nên làm gì.", "eng": "I've spent many sleepless nights worrying about what I should do."}, {"viet": "Tôi luôn luôn đứng ngồi không yên trong những cuộc họp kéo dài.", "eng": "I always get the fidgets during long meetings."}, {"viet": "Tôi chẳng phải là hạng người như ông mô tả đâu.", "eng": "I am not what you represent me to be."}, {"viet": "Tôi yêu cầu nhân viên phục vụ đưa anh ta ra.", "eng": "I asked the attendant to conduct him out."}, {"viet": "Tôi đã thở phào nhẹ nhõm khi tôi nghe tin anh ấy bình yên.", "eng": "I breathed a sigh of relief when I heard he was safe."}, {"viet": "Tôi không thể cho anh con số chính xác ngay tức khắc được.", "eng": "I can't give you the exact figures offhand."}, {"viet": "Tôi nôn nóng muốn nhận cái máy giặt của tôi.", "eng": "I can't wait to get my new washing machine."}, {"viet": "Tôi có thể bảo đảm cho sự thật thà của anh ta.", "eng": "I can vouch for his honesty."}, {"viet": "Tôi bắt quả tang con bé đang đọc thư của tôi.", "eng": "I caught her in the act of reading my letter."}, {"viet": "Có lúc tôi đã không tài nào nhớ ra số điện thoại của tôi.", "eng": "I couldn't remember my own telephone number for a moment."}, {"viet": "Tôi thích mở tài khoản vãng lai hơn.", "eng": "I'd rather open a current account."}, {"viet": "Tôi thì mãi đến 4 giờ 30 mới về nhà.", "eng": "I didn't get in till half past four."}, {"viet": "Tôi không biết ông ấy bao nhiêu tuổi nhưng ông ta trông hẳn là trên 40.", "eng": "I don't know how old he is, but he looks well over forty."}, {"viet": "Tôi không nhận ra từ này-nó nghĩa là gì?", "eng": "I don't recognize this word-what does it mean?"}, {"viet": "Tôi không muốn nghe anh nói một tiếng nào hết.", "eng": "I don't want to hear a peep out of you."}, {"viet": "Tôi không nhớ tên anh chàng.", "eng": "I don't remember his name."}, {"viet": "Hôm nay tôi cảm thấy hơi khó ở.", "eng": "I feel a bit funny today."}, {"viet": "Tôi cảm thấy hoàn toàn bị quay cuồng sau khi phải đối phó với năm đứa con hiếu động suốt ngày.", "eng": "I felt totally shell-shocked after coping with fire boisterous children all day."}, {"viet": "Tôi đưa cho mỗi cậu bé một trái táo.", "eng": "I gave each of the boys an apple."}, {"viet": "Tôi đợi phát chán nên bỏ đi.", "eng": "I grew tired of waiting, and left."}, {"viet": "Tôi cũng có cảm giác như vậy.", "eng": "I had such a feeling, too."}, {"viet": "Hạn chót để tôi hoàn thành quyển tiểu thuyết là tháng Ba.", "eng": "I have a March deadline for the novel."}, {"viet": "Tôi chưa bao giờ thấy nước ở đâu trong sạch và đẹp đẽ như ở đây.", "eng": "I have never seen such clear and beautiful water here."}, {"viet": "Tôi phải đến khách sạn New Territories, nhưng tôi chắc là tôi có thể quay lại kịp giờ.", "eng": "I have to go to the New Territories, but I'm sure I can get back in time."}, {"viet": "Tôi chưa có kế hoạch nào cả.", "eng": "I haven't made any plans."}, {"viet": "Mong rằng nó sẽ không nói câu chuyện đùa ấy nữa, nó đã lải nhải nghe phát chán lên rồi.", "eng": "I hope he won't tell that joke again, he's flogged it to death already."}, {"viet": "Tôi tính cả chú tôi trong danh sách những người mời.", "eng": "I included my uncle in my list of people to invite."}, {"viet": "Bố biết cách nấu món đó mà.", "eng": "I know how to cook it."}, {"viet": "Tôi chỉ thích uống trà pha một vài giọt sữa.", "eng": "I like just a dot of milk in my tea."}, {"viet": "Tôi sẽ mang những cái tách mới đến cho ông bà.", "eng": "I'll bring you fresh ones."}, {"viet": "Tôi sẽ gọi điện thoại cho họ bây giờ.", "eng": "I'll phone them up to now."}, {"viet": "Tôi e rằng tôi không thể ở lại được.", "eng": "I'm afraid I can't stay."}, {"viet": "Dĩ nhiên tôi đồng ý phần nào.", "eng": "I'm half inclined to agree."}, {"viet": "Tao chán nhìn thấy mày lắm rồi!", "eng": "I'm sick of the sight of you!"}, {"viet": "Tôi ước lượng tổng số khoảng 50 bảng Anh.", "eng": "I make the total to be about £ 50."}, {"viet": "Tay tôi bị ngứa, chắc là tôi bị bọ chét đốt.", "eng": "I must have been bitten by a flea, my arms are itchy."}, {"viet": "Em cần nghĩ ra kế hoạch để dành lấy anh ta.", "eng": "I need to think of a strategy to win him over."}, {"viet": "Tôi chỉ mong việc giúp anh nằm trong phạm vi khả năng của tôi.", "eng": "I only wish it lay within my power to help you."}, {"viet": "Tôi đặt lòng tin của tôi nơi anh.", "eng": "I put my trust in you."}, {"viet": "Tôi nhận ra anh ta ngay nhờ dáng đi.", "eng": "I recognized him at once by his walk."}, {"viet": "Tôi đã ngồi làm mẫu hàng ngày trong một tuần cho đến khi bức tranh được hoàn tất.", "eng": "I sat every day for a week until the painting was finished."}, {"viet": "Lúc đề án này hoàn tất thì tao chết mất đất rồi đấy.", "eng": "I shall be pushing up daisies by the time the project is finished."}, {"viet": "Khi nó tỏ ra ân cần giúp đỡ như thế, tôi đã nghi là có âm mưu gì rồi!", "eng": "I smelt a rat when he started being so helpful!"}, {"viet": "Tôi cho rằng những thay đổi này có thể bác bỏ được.", "eng": "I suppose these changes are deniable."}, {"viet": "Tôi nghĩ tôi đang già đi.", "eng": "I think I'm getting old."}, {"viet": "Tôi nghĩ rằng bây giờ đã đúng lúc đề cập tới vấn đề thăng chức của tôi.", "eng": "I think this is an appropriate moment to mention the question of my promotion."}, {"viet": "Tôi đã nói cho nó biết sự thật với lời hứa là giữ bí mật.", "eng": "I told him the truth under a promise of secrecy."}, {"viet": "Bây giờ con hiểu những gì làm bố mẹ buồn rồi.", "eng": "I understand now what makes you unhappy."}, {"viet": "Tôi muốn có một cái giường cỡ lớn trong phòng tôi.", "eng": "I want a king-size bed in my room."}, {"viet": "Tôi muốn chỉ cho anh rõ một vài vấn đề.", "eng": "I want to set you right on one or two matters."}, {"viet": "Tôi bực mình với anh ta về việc đến muộn.", "eng": "I was cross with him for being late."}, {"viet": "Tôi rất đau đớn nghe tin buồn về cái chết của cha anh.", "eng": "I was most distressed to hear the sad news of your father's death."}, {"viet": "Tôi được đưa vào hậu trường để gặp các diễn viên.", "eng": "I was taken backstage to meet the actors."}, {"viet": "Tôi sẽ rất sung sướng được trả lời các câu hỏi khi kết thúc.", "eng": "I will be happy to answer questions at the end."}, {"viet": "Tôi mong anh đừng luôn luôn chen kiến của anh vào.", "eng": "I wish you wouldn't always wade in with your opinion."}, {"viet": "Tôi sẽ không dung thứ cho sự xấc xược này.", "eng": "I won't stand for this insolence."}, {"viet": "Tôi muốn mở một tài khoản.", "eng": "I would like to open an account."}, {"viet": "Tôi có lẽ không đánh đổi công việc của mình lấy bất cứ cái gì.", "eng": "I wouldn't trade my job for anything."}, {"viet": "Nếu anh ta không quá tự tin thì tôi sẽ yêu mến anh ấy hơn.", "eng": "If he weren't so all-firedly sure of himself, I'd like him better."}, {"viet": "Nếu vẫn bán tiếp tục ở mức hiện nay, chúng ta sẽ kiếm được lợi nhuận kỷ lục năm nay.", "eng": "If sales continue at that present rate, we will make record profits this year."}, {"viet": "Nếu chúng mình đến muộn, chắc sẽ có chuyện phiền toái đấy.", "eng": "If we're late, there'll be mean trouble."}, {"viet": "Nếu anh đã mua thức ăn nấu sẵn thì chúng ta không cần phải nấu nướng nữa.", "eng": "If you buy some prepared food, we don't need to cook."}, {"viet": "Nếu cậu đi bây giờ rất có thể cậu gặp phải giờ cao điểm.", "eng": "If you go now, you're likely to hit the rush hour."}, {"viet": "Nếu anh nói như vậy cảnh sát sẽ cho tên anh vào sổ đen.", "eng": "If you talk like that, the police will put your name on their black list."}, {"viet": "Những người nhập cư thường thiếu kiến thức chung về đất nước mới của họ.", "eng": "Immigrants often lack cultural literacy of their new country."}, {"viet": "Trong đối lưu, dòng nước nóng chảy lên phía trên.", "eng": "In convection, hot currents flow upwards."}, {"viet": "Trong tiếng La tinh, danh cách của các danh từ thuộc biến cách thứ nhất đều kết thúc bằng chữ'a'.", "eng": "In Latin, the nominative case of first declension nouns ends in'a'."}, {"viet": "Nếu vậy, tôi sẽ mang nó đến bộ phận giặt ủi ngay.", "eng": "In that case, I'll send it to the laundry right away."}, {"viet": "Trong nỗi đau xót của mọi người có mặt.", "eng": "In the sorrow of people who were present."}, {"viet": "Sự hợp tác tăng lên giữa các lực lượng cảnh sát sẽ cải thiện tỉ lệ giải quyết các vụ tội phạm.", "eng": "Increased interaction between different police forces would improve the rate of solving crimes."}, {"viet": "Nó chơi cờ giỏi bằng cô ta không?", "eng": "Is he as good as her at chess?"}, {"viet": "Đền Taj Mahal ở Ấn Độ phải không?", "eng": "Is the Taj Mahal in India?"}, {"viet": "Đây có phải là đường đến viện bảo tàng quốc gia ABC không?", "eng": "Is this the way to ABC National Museum?"}, {"viet": "Đó là nơi mà người ta bán đồ với giá rẻ.", "eng": "It's a place where people sell things at a low price."}, {"viet": "Mọi người bàn tán rằng họ đang có chuyện với nhau.", "eng": "It's common gossip that they're having an affair."}, {"viet": "Điều quan trọng đối với một công ty là phải tiến kịp với những thay đổi trên thị trường.", "eng": "It's important for a firm to keep pace with changes in the market."}, {"viet": "Đọc được ý nghĩ của anh không khó khăn gì.", "eng": "It's not difficult to read your thoughts."}, {"viet": "Công viên này nằm ở Wyoming, Montana và Idaho, trong nặng Rockies.", "eng": "It's situated in Wyoming, Montana and Idaho, in the Rockies."}, {"viet": "Thật khó khi đổi ngoại tệ ở sân bay.", "eng": "It's very difficult to exchange foreign currencies at the airport,."}, {"viet": "Cái đó không thành vấn đề, vì vậy anh không cần phải lo lắng về nó.", "eng": "It doesn't signify, so you needn't worry about it."}, {"viet": "Ngọn núi này khó mà leo lên được.", "eng": "It is difficult to climb this mountain."}, {"viet": "Con trai ông rồi đây sẽ bỏ nhà mà đi là điều có thể xảy ra lắm.", "eng": "It is only to be expected your son will leave home eventually."}, {"viet": "Tôi cảm thấy hạnh phúc một cộng đồng cùng nhau làm việc đó.", "eng": "It makes me feel good to see a community doing something together."}, {"viet": "Tôi không thể biết chúng đang nghĩ gì.", "eng": "It's beyond me what they are thinking."}, {"viet": "Thời gian trước khi cảnh sát đến dường như vô tận.", "eng": "It seemed an eternity before the police arrived."}, {"viet": "Sơn cái trần nhà mất khoảng một ngày tròn.", "eng": "It took more or less a whole day to paint the ceiling."}, {"viet": "Nó là loại cà phê không ngon, chúng tôi không thể uống được.", "eng": "It was coffee of a kind, but we couldn't drink it."}, {"viet": "Cậu thật là ẩu khi ký vào mẫu đơn mà không đọc nó.", "eng": "It was rash of you to sign the form without reading it."}, {"viet": "Nó sẽ giúp tôi hiểu nhiều khi giao dịch với những thương nhân Trung Quốc.", "eng": "It will help me a lot in dealing with Chinese traders."}, {"viet": "Jane rất thân mật, nhưng chồng cô ta thì khá là lạnh nhạt.", "eng": "Jane's very friendly, but her husband's rather antisocial."}, {"viet": "John hồi còn nhỏ là một đứa bé có phần chậm phát triển, gần lên ba mới biết đi.", "eng": "John was rather backward as a child, he was nearly three before he could walk."}, {"viet": "Y theo một lời hẹn, tuân theo luật, giữ lời hứa, thi hành đúng một hiệp ước.", "eng": "Keep an appointment, the law, a promise, a treaty."}, {"viet": "Chúng ta hãy mua vài cái áo thun ở chỗ những người bán dạo bên đường.", "eng": "Let's buy some T-shirts from the street vendor."}, {"viet": "Chúng ta hãy xem nó sẽ tốn bao nhiêu nhé.", "eng": "Let's see how much it will cost."}, {"viet": "Hôm nay nhiều cử tri không đi bỏ phiếu vì thời tiết xấu.", "eng": "Many electors didn't vote today because of the bad weather."}, {"viet": "Nhiều gia đình Uganda Châu Á tái định cư ở Canada.", "eng": "Many Ugandan Asian families resettle in Canada."}, {"viet": "Cho phép tôi lấy cho bạn một thứ gì đó để uống nhé?", "eng": "May I get you something to drink?"}, {"viet": "Có lẽ bia Thanh Đảo được ưa chuộng hơn bia Bắc Kinh một chút.", "eng": "Maybe Tsing Tao beer is a little bit more popular than Beijing beer."}, {"viet": "Hầu hết các cuộc thương lượng đều dựa trên nguyên tắc được hết hoặc không được gì.", "eng": "Most of the negotiations end up with the basic all-or-nothing argument."}, {"viet": "Một cách tự tin hơn nhiều Hôm nay bà ta khá hơn nhiều.", "eng": "Much more confidently She's much better today."}, {"viet": "Con gái và cháu trai của tôi sẽ đến thăm tôi.", "eng": "My daughter and my grandson are coming to see me."}, {"viet": "Nhà tôi ở bên bờ nam ( của con sông ).", "eng": "My house is on the south bank ( of the river )."}, {"viet": "Các kế hoạch của tôi vẫn còn đang rất phôi thai.", "eng": "My plans are still very much in embryo."}, {"viet": "Sự chống đối của toàn dân đối với chính sách của chính phủ.", "eng": "National opposition to government policy."}, {"viet": "Sau môn trượt tuyết, môn thể thao thích nhất của cô ấy là hốc cây trên băng.", "eng": "Next to skiing her favourite sport was ice-hockey."}, {"viet": "Không được đâu, chúng phải theo sát bản kế hoạch đầu tiên.", "eng": "No dice, we'll stick with the original one."}, {"viet": "Bây giờ, tờ đơn xin đã được điền đây.", "eng": "Now, here is my filled out application form."}, {"viet": "Béo phì là một vấn đề đối với nhiều người ở các nước phương Tây.", "eng": "Obesity is a problem for many people in western countries."}, {"viet": "Ồ, anh sẽ trả lại bản ghi nhớ đổi tiền cho tôi chứ?", "eng": "Oh, will you return the exchange memo to me?"}, {"viet": "Trái lại, ông nói rất lưa loát.", "eng": "On the contrary, you're very fluent."}, {"viet": "Một trong những đặc tính nhỏ riêng biệt của cô ta là luôn luôn rửa ráy bằng nước lạnh.", "eng": "One of her little idiosyncrasies is always washing in cold water."}, {"viet": "Tôi có phải viết thư cám ơn không?", "eng": "Ought I to write to say thank you?"}, {"viet": "Khu vườn của chúng ta chạy dài tới tận sông.", "eng": "Our garden goes down as far as the river."}, {"viet": "Địa vị chúng ta có thể cải thiện được.", "eng": "Our position is capable of improvement."}, {"viet": "Ở đàng kia, nhưng tôi khuyên ông đừng đến đó.", "eng": "Over there, but I don't recommend it."}, {"viet": "Đừng bận tâm đến bọn người bép xép.", "eng": "Paying no attention to clacking tongues."}, {"viet": "Có lẽ tối nay thời tiết sẽ thay đổi.", "eng": "Perhaps the weather will change this evening."}, {"viet": "Cảnh sát đã lấy lại được các đồ kim hoàn mất cắp về cho phòng trưng bày.", "eng": "Police restored the stolen jewels to the showroom."}, {"viet": "Rực rỡ trong các cuộn tóc và lớp kem bôi mặt của nàng ta.", "eng": "Resplendent in her curlers and a face-pack."}, {"viet": "Làm gia sư cho một gia đình.", "eng": "Serve as a governess to a family."}, {"viet": "Nếu anh thuyết phục, cô ấy sẽ để cho anh mượn chiếc xe ôtô đó.", "eng": "She'll let you borrow the car if you twist her arm."}, {"viet": "Gần đây cô ấy cảm thấy không được khoẻ.", "eng": "She's been feeling a bit off-colour lately."}, {"viet": "Cô ta đã giấu quyển sách của tôi ở đâu đó.", "eng": "She's hidden my book away somewhere."}, {"viet": "Cô ta đang cắt xén quyển tiểu thuyết ấy theo yêu cầu của nhà xuất bản.", "eng": "She's pruning down the novel at the publisher's request."}, {"viet": "Lúc này bà ta rất bận rộn với những công việc tự nguyện.", "eng": "She's very taken up with voluntary work at the moment."}, {"viet": "Cô ấy cho rằng thành công của mình là do sự cố gắng và chút ít may mắn.", "eng": "She attributed her success to hard work and a bit of luck."}, {"viet": "Chị ấy nhìn thấy cái xe ôtô ở xa.", "eng": "She caught sight of a car in the distance."}, {"viet": "Cô ta hứng tay vào vòi nước.", "eng": "She dabbled her fingers in the fountain."}, {"viet": "Cô ấy không biết tài khoản ngân hàng bí mật của tôi.", "eng": "She doesn't know about my secret bank account."}, {"viet": "Bà ta không có sự đố kí với những phụ nữ trẻ hơn.", "eng": "She felt no antipathy towards younger women."}, {"viet": "Bà ta hút bốn mươi điếu thuốc lá một ngày.", "eng": "She gets through forty cigarettes a day."}, {"viet": "Cố ấy gặp nhiều khó khăn trong việc làm bài tập ở nhà.", "eng": "She had great difficulty in doing her homework."}, {"viet": "Sức khoẻ cô ta yếu mất một thời gian.", "eng": "She has been in delicate health for some time."}, {"viet": "Cô ấy ngập ngừng không muốn nói với anh ta những gì cô ấy nghĩ về anh ta.", "eng": "She held back from telling him what she thought of him."}, {"viet": "Cô ta đang tìm một việc làm lâu dài.", "eng": "She is looking for permanent employment."}, {"viet": "Cô ta luôn luôn cắt ngang cuộc thảo luận của chúng tôi bằng những nhận xét có ý hài hước.", "eng": "She kept interrupting our discussion with facetious remarks."}, {"viet": "Cô ấy nhìn đầu bài thi trán nhăn lại.", "eng": "She looked at the exam paper with a furrowed brow."}, {"viet": "Cô ấy có thể đi ngày mai nhưng vì cô ấy không được khoẻ nên cũng không chắc lắm.", "eng": "She might just go tomorrow, but as she's not feeling well it's not very probable."}, {"viet": "Cô ta thủ vai công chúa đầy tự tin.", "eng": "She performed a role of princess with great aplomb."}, {"viet": "Cô ta viện lý cho quyết định từ bỏ đứa con còn bé của mình bằng cách nói rằng cô không có đủ khả năng để nuôi nó.", "eng": "She rationalized her decision to abandon her baby by saying she could not afford to keep it."}, {"viet": "Cô ta là một người giỏi về máy vi tính.", "eng": "She's a wizard with computers."}, {"viet": "Cô ấy hiện đang ở tận bên Úc.", "eng": "She's out in Australia at the moment."}, {"viet": "Cô ta nói nhiều điều xấu xa về chồng mình sau lưng anh ta.", "eng": "She says nasty things about her husband behind his back."}, {"viet": "Cô ấy tỏ ra hết sức nhiệt tình đối với công việc của cô ấy.", "eng": "She shows boundless enthusiasm for work."}, {"viet": "Cô ta bắt đầu ở cấp thấp nhất và đã làm việc leo dần lên trở thành giám đốc của công ty.", "eng": "She started at the bottom and worked her way up to become manager of the company."}, {"viet": "Bà ấy dạy tôi những nguyên lý chung của hình học.", "eng": "She taught me the principles of geometry."}, {"viet": "Cô ấy chuyển sự chú ý sang một vấn đề mới.", "eng": "She turned her attention to a new problem."}, {"viet": "Bà ta từng là một ca sĩ nổi tiếng trong những ngày vàng son của bà ta.", "eng": "She was a great singer in her heyday."}, {"viet": "Bà ta rõ ràng là người có thế lực.", "eng": "She was clearly an important person."}, {"viet": "Cô ấy đang lo âu vì sự thay đổi việc làm.", "eng": "She was in a funk about changing jobs."}, {"viet": "Cô ta sẵn sàng tiếp nhận bất kỳ điều gì xảy ra.", "eng": "She was prepared for anything to happen."}, {"viet": "Nàng là trung tâm của sự chú ý.", "eng": "She was the cynosure of all eyes."}, {"viet": "Cô ta hơi kỳ quặc một chút và đã bị giam.", "eng": "She went a bit odd and had to be put away."}, {"viet": "Cô ta trúng giải nhất trong cuộc xổ số bán hàng.", "eng": "She won first prize in the raffle."}, {"viet": "Núp dưới cái ô hạt nhân của Mỹ.", "eng": "Sheltering under the American nuclear umbrella."}, {"viet": "Đóng các cửa lại và mở các cửa sổ ra.", "eng": "Shutting the doors and opening the windows."}, {"viet": "Ngồi hơ mình dưới ngọn đèn năng lượng mặt trời.", "eng": "Sit grilling oneself under a sun-ray lamp."}, {"viet": "Làm nhòe chữ in bằng ngón tay.", "eng": "Smear the print with one's finger."}, {"viet": "Quá nhiều ý! Quá nhiều để tôi có thể hiểu được hoàn toàn ngay lập tức!", "eng": "So many ideas! It's all rather too much for me to absorb all at one!"}, {"viet": "Một số loài chim bay về phương nam để tìm nơi sinh sản thuận lợi.", "eng": "Some birds flied South to find good breeding ground."}, {"viet": "Vài chuyện trong tuyển tập chẳng qua là vật bổ sung.", "eng": "Some of the stories in the collection are mere makeweights."}, {"viet": "Một số loại ung thư có thể trị được.", "eng": "Some types of cancer are curable."}, {"viet": "Xin lỗi đã làm phiền anh.", "eng": "Sorry, but you have bothered you."}, {"viet": "Những cây nhọn chĩa ra trên đỉnh một hàng rào.", "eng": "Spiky projections on top of a fence."}, {"viet": "Ngăn dòng nước từ một cái ống bị vỡ.", "eng": "Stem the flow of water from a burst pipe."}, {"viet": "Đừng có ném đá vào con chó đó nữa!", "eng": "Stop throwing stones at that dog!"}, {"viet": "Được hưởng một tài sản do việc hoàn trả cho chủ cũ.", "eng": "Succeed to an estate in reversion."}, {"viet": "Bị bối rối tột độ vì sự chế giễu công khai.", "eng": "Suffer the ultimate embarrassment of public ridicule."}, {"viet": "Chim én đang làm tổ ở trong ga ra.", "eng": "Swallows are nesting in the garage."}, {"viet": "Hãy lấy cuốn băng gốc và sang thành 20 cuốn vào ngày mai.", "eng": "Take the master and make 20 copies by tomorrow."}, {"viet": "Đường dây điện thoại bị phá huỷ vì cơn bão.", "eng": "Telephone communications were knocked out by the storm."}, {"viet": "Cám ơn anh đã làm điều đó!''Đó là một việc thích thú.", "eng": "Thank you for doing that!''It's a pleasure.'."}, {"viet": "ĐÓ LÀ GIỜ MẸ ĂN TRƯA.", "eng": "THAT'S WHEN I EAT LUNCH."}, {"viet": "Điều đó cũng dễ hiểu thôi, hôm qua anh ta trông mệt mỏi lắm.", "eng": "That figures, he looked very unwell yesterday."}, {"viet": "Bộ phim đó quá bạo lực đối với trẻ em.", "eng": "That movie is too violent for children."}, {"viet": "Bây giờ thì thật sự kết thúc rồi.", "eng": "That's really the end now."}, {"viet": "Thật là một bữa ăn ngon.", "eng": "That was quite a decent lunch."}, {"viet": "Chuyện ông ấy kể về thời niên thiếu của mình hoàn toàn bịa đặt.", "eng": "The account he gives of his childhood is quite fictitious."}, {"viet": "Cái vỏ ngoài của điệp viên ấy đã bị vỡ và anh ta phải rời khỏi đất nước đó.", "eng": "The agent's cover had been broken and he had to leave the country."}, {"viet": "Những con vật bị đánh thuốc mê để làm thí nghiệm.", "eng": "The animals were anaesthetized for the experiment."}, {"viet": "Cuộc tranh luận về sinh đẻ có kế hoạch sẽ không bao giờ kết thúc.", "eng": "The argument on birth control will never be concluded."}, {"viet": "Bầu không khí trong bữa ăn tối rất đầm ấm và thân mật.", "eng": "The atmosphere over dinner was warm and friendly."}, {"viet": "Chữ b trong từ dumb thì câm.", "eng": "The b in dumb is mute."}, {"viet": "Ban nhạc lúc này đang thổi một điệu hành khu bằng kèn đồng.", "eng": "The bang was playing some brassy march."}, {"viet": "Yếu tố cực kì quan trọng của thế vận hội Olympic.", "eng": "The be all and end all of the Olympic Games."}, {"viet": "Bản dự luật được trình bày lần thứ nhì ở Nghị viện mà không bị chống đối.", "eng": "The bill was given an unopposed second reading in Parliament."}, {"viet": "Con thuyền chao đảo dữ đội trong cơn bão.", "eng": "The boat rocked violently in the tempest."}, {"viet": "Quyển sách được đề tặng'Tặng Cyril với những lời chúc mừng nồng nhiệt nhất'.", "eng": "The book was inscribed'To Cyril, with warmest regards.'."}, {"viet": "Bọn trẻ lấy phấn vạch ra các cột gôn lên tường sân chơi.", "eng": "The boys chalked out goalposts on the playground wall."}, {"viet": "Cái xô lúc lắc ở đầu dây.", "eng": "The bucket swung from the end of a rope."}, {"viet": "Xe buýt đi ngược chiều nhau-một chiếc đi về nam, chiếc kia đi về bắc.", "eng": "The buses went in opposite direction-one went south and the other went north."}, {"viet": "Chiếc xe ô tô, ngày nghỉ, ngôi nhà trong mộng tưởng của anh.", "eng": "The car, holiday, home of your dreams."}, {"viet": "Chiếc xe ô tô đỗ khi chiếc xe tải đâm vào nó.", "eng": "The car was stationary when the van hit."}, {"viet": "Nguyên nhân của vụ cháy được tìm ra bắt nguồn từ hộp cầu chì sai quy cách.", "eng": "The cause of the fire was traced to a faulty fuse-box."}, {"viet": "Vai bà mẹ tận tuỵ của nhân vật chính.", "eng": "The character part of the hero's devoted mother."}, {"viet": "Thằng bé xếp những chiếc xe ô tô đồ chơi nối đuôi nhau.", "eng": "The child put the toy cars together endways."}, {"viet": "Lũ trẻ chạy đến đón chúng tôi.", "eng": "The children came running to meet us."}, {"viet": "Bọn trẻ con sung sướng phát cuồng khi chúng nhìn thấy những món quà của chúng.", "eng": "The children were bananas when they saw their presents."}, {"viet": "Thành phố ở độ cao 2000 mét so với mực nước biển.", "eng": "The city is at an elevation of 2000 meters."}, {"viet": "Về mùa đông, mây ngưng tụ tạo thành nước.", "eng": "The clouds are precipitated as snow in winter."}, {"viet": "Màu sắc giấy dán tường chọi với màu tấm thảm.", "eng": "The colour of the wallpaper clashes with the colour of the carpet."}, {"viet": "Công ty phải dùng tiền ở quỹ dự trữ để trả cho tất cả những trang thiết bị mới.", "eng": "The company had to dip into a reserve fund to pay for all the new equipment."}, {"viet": "Máy vi tính bây giờ là một dụng cụ cần thiết trong nhiều doanh nghiệp.", "eng": "The computer is now an indispensable tool in many businesses."}, {"viet": "Hợp đồng đó được diễn đạt bằng thứ ngôn ngữ pháp lý khó hiểu.", "eng": "The contract was formulated in difficult legal language."}, {"viet": "Đất nước tiêu thụ nhiều hơn là sản xuất.", "eng": "The country consumes much more than it produces."}, {"viet": "Đàn bò đã chạy ra khỏi cánh đồng đi tự do trên đường.", "eng": "The cows had got out of the field and were loosing in the road."}, {"viet": "Đám đông la hét và chế nhạo người diễn thuyết.", "eng": "The crowd was hooting and jeering at the speaker."}, {"viet": "Tờ Tiếng vọng hàng ngày có số độc giả trên mười triệu người.", "eng": "The Daily Echo has a readership of over ten million."}, {"viet": "Con nai đã đánh hơi thấy mùi của chúng tôi.", "eng": "The deer have got our wind."}, {"viet": "Các chi tiết của vấn đề bị gác lại không xét đến.", "eng": "The details of the matter are left unconsidered."}, {"viet": "Việc phát hiện ra dầu sẽ làm giàu cho đất nước.", "eng": "The discovery of oil will enrich the nation."}, {"viet": "Bác sĩ đã điều trị cho cô ấy một đợt kháng sinh.", "eng": "The doctor has put her on a course of antibiotics."}, {"viet": "Con chó đào lên được vài khúc xương.", "eng": "The dog has unearthed some bones."}, {"viet": "Các quan điểm của nhà soạn kịch được diễn đạt khá hay.", "eng": "The dramatist's conception was well rendered."}, {"viet": "Trục của trái đất là đường ranh giới giữa Bắc Cực và Nam Cực.", "eng": "The earth's axis is the line between the North and South poles."}, {"viet": "Con voi húc đổ dãy cây.", "eng": "The elephant smashed through the trees."}, {"viet": "Toàn bộ ngôi làng bị trận cuồng phong phá hủy tan tành.", "eng": "The entire village was obliterated by the tornado."}, {"viet": "Ủy ban hành pháp của một đảng chính trị.", "eng": "The executive committee of a political party."}, {"viet": "Nhà máy đóng cửa vì không tuân theo quy định an toàn của nhà nước.", "eng": "The factory was closed for failing to comply with government safety regulations."}, {"viet": "Cơ quan FBI đã tập trung bắt đầu từ điệp viên nào có khả năng vào vụ án.", "eng": "The FBI throw every available agent into the case."}, {"viet": "Bộ phim là một thành công vang dội.", "eng": "The film scored a resounding success."}, {"viet": "Hãng đó đã bị tê liệt bởi một loạt các dịch vụ đình công.", "eng": "The firm has been immobilized by a series of strikes."}, {"viet": "Lần đầu tiên khi nghe âm nhạc của họ, tôi rất lấy làm ngạc nhiên.", "eng": "The first time I heard their music I didn't know what had hit me."}, {"viet": "Thức ăn ở khách sạn này thì ngon, nhưng cách phục vụ thì kém.", "eng": "The food is good at this hotel, but the service is poor."}, {"viet": "Những bức tranh tường và trần ở nhà thờ Sistine nổi tiếng thế giới.", "eng": "The frescos in the Sistine Chapel are world-famous."}, {"viet": "Khu vườn mọc um tùm ( cây tầm ma ).", "eng": "The garden's completely overgrown ( with nettles )."}, {"viet": "Tính mạng cô gái được cứu thoát bởi vì các bác sĩ đã làm việc rất khẩn trương.", "eng": "The girl's life was saved because the doctors acted so promptly."}, {"viet": "Các chính sách của chính phủ bắt đầu có hiệu quả.", "eng": "The government's policies are beginning to tell."}, {"viet": "Chính phủ kiên quyết làm giảm quyền lực của các công đoàn.", "eng": "The Government is determined to break the power of the trade unions."}, {"viet": "Thống đốc bị các phóng viên bao vây khi đến sân bay.", "eng": "The governor was surrounded by reporters upon arrival at the airport."}, {"viet": "Trong vòng vài năm nhóm đó đã giải tán trong mối bất hoà.", "eng": "The group dissolved in dissension within a few years."}, {"viet": "Người Gipoi bói rằng cậu đó sẽ chết.", "eng": "The gypsy had foretold that the boy would die."}, {"viet": "Con gà mái gom mẻ ấp dưới đôi cánh.", "eng": "The hen gathered her brood under her wings."}, {"viet": "Vó ngựa làm bốc lên một đám bụi mù.", "eng": "The horses'hooves raised a cloud of dust."}, {"viet": "Căn nhà đó vô cùng ngoạn mục theo mức tưởng tượng được.", "eng": "The house has the most spectacular view imaginable."}, {"viet": "Cơn bão đã để lại phía sau nó một dải bị tàn phá.", "eng": "The hurricane left a trail of destruction behind it."}, {"viet": "Sự tăng lên của xe cộ đi lại xuất hiện cùng với những con đường mới.", "eng": "The increase in traffic that comes with new roads."}, {"viet": "Lãi suất của tài khoản ký thác cao hơn lãi suất của tài khoản tiết kiệm bình thường.", "eng": "The interest rate for time deposits is much higher than regular savings accounts."}, {"viet": "Việc phải làm cho xong, chúng ta hãy quyết tâm bắt tay vào ngay đi.", "eng": "The job has to be done, so let's wade in immediately."}, {"viet": "Hội thẩm đoàn đã bị thuyết phục bởi sự quan trọng của chứng cớ chống lại cô ta.", "eng": "The jury were convinced by the weight of the evidence against her."}, {"viet": "Những con cừu non nhảy tung tăng khắp cánh đồng.", "eng": "The lambs were skipping about in the fields."}, {"viet": "Bãi cỏ bị hư hại chỗ này là do người ta cứ đi băng qua.", "eng": "The lawn is damaged here because people cut off the corner."}, {"viet": "Những con đê chạy dọc theo sông Hồng Hà.", "eng": "The levees along the Hong Ha River."}, {"viet": "Hội đồng địa phương đảm nhiệm việc sửa chữa đường sá.", "eng": "The local council is in charge of repairing roads."}, {"viet": "Những âm thanh du dương của một dàn nhạc.", "eng": "The lush sounds of an orchestra."}, {"viet": "Người đàn ông đó là một kiệt xuất về kiến thức.", "eng": "The man is a prodigy of learning."}, {"viet": "Trận đấu đó đã có hơn hai mươi nghìn người xem.", "eng": "The match was watched by over twenty thousand people."}, {"viet": "Cuộc họp thật chán ngắt từ đầu đến cuối.", "eng": "The meeting was one big yawn from start to finish."}, {"viet": "Bài nói của bộ trưởng đầy sự lẩn tránh.", "eng": "The minister's speech was full of evasion."}, {"viet": "Số tiền chúng thu gom được cho nạn nhân nạn đói chỉ như muối bỏ biển.", "eng": "The money we collected for the famine victims is really just a drop in the ocean."}, {"viet": "Núi làm nền cho bức ảnh của gia đình này.", "eng": "The mountain forms a background to this photograph of the family."}, {"viet": "Quốc gia đó đã không có ý thức đúng đắn về nguy cơ sụp đổ gần kề, với những từ ngữ và thái độ quá khích cùng với sự ưa thích giải quyết bằng biện pháp mạnh.", "eng": "The nation had been flirting with forms of gotterdammerung, with extremes of vocabulary and behavior and an appetite for violent resolution."}, {"viet": "Chứng cứ mới đã làm hỏng vụ án chống lại họ.", "eng": "The new evidence drove a coach and horses through the case against them."}, {"viet": "Con đường mới được mở ra bằng cách phát quang rừng rậm.", "eng": "The new road was hacked out of the jungle."}, {"viet": "Tờ báo đã đăng một bài phơi bày cuộc sống quá khứ của ngôi sao điện ảnh.", "eng": "The newspaper published an exposé of the film star's past life."}, {"viet": "Quyển tiểu thuyết là một bản cáo trạng mạnh mẽ về sự nghèo nàn của đô thị.", "eng": "The novel is a searing indictment of urban poverty."}, {"viet": "Việc đề nghị một công việc mới đúng là đã đem lại một chất xúc tác mà bà ta cần.", "eng": "The offer of a new job provided just the catalyst she needed."}, {"viet": "Ông già được tái sinh trong con cái mình.", "eng": "The old man left reborn in his children."}, {"viet": "Phe đối lập đã lớn tiếng chỉ trích hành động của chính phủ.", "eng": "The Opposition were shrill in their criticism of the Government's action."}, {"viet": "Lớp sơn trên mấy bức tường đang bắt đầu bong ra.", "eng": "The paint on the walls is beginning to flake off."}, {"viet": "Khi chúng tôi đến buổi liên hoan đã gần kết thúc.", "eng": "The party was all but over when we arrived."}, {"viet": "Chữ áp cuối của một từ.", "eng": "The penultimate letter of a word."}, {"viet": "Một số thanh niên quậy phá đã làm hư hại cái buồng điện thoại.", "eng": "The phone box was vandalized by a gang of youths."}, {"viet": "Tiếng mưa lộp độp trên mái nhà.", "eng": "The pit-a-pat of the rain on the roof."}, {"viet": "Cây này có thể hồi lại, nó rất khô và héo nhưng vẫn còn cuộc sống trong đó.", "eng": "The plant may recover, it's very dry and withered, but there's still life in it."}, {"viet": "Cốt truyện của tiểu thuyết đó hiện ra dần trong trí tôi.", "eng": "The plot for the novel gradually developed in my mind."}, {"viet": "Cảnh sát tìm được rất ít manh mối về nhân dạng của tên giết người.", "eng": "The police found very few clues to the murderer's identity."}, {"viet": "Cảnh sát bảo mọi người ở nguyên trong xe.", "eng": "The police told everybody to remain in their cars."}, {"viet": "Dân số thành phố New York.", "eng": "The population of metropolitan New York."}, {"viet": "Bộ mặt hiện nay của xã hội báo trước sự thay đổi lớn lao.", "eng": "The present aspect of society is portentous of great change."}, {"viet": "Báo chí là người bảo vệ sự tự do của chúng ta.", "eng": "The Press is a sentinel of our liberty."}, {"viet": "Hoàng tử xỉ vả những nhà xây dựng vì đã làm hỏng mất cảnh quan của Luân Đôn.", "eng": "The prince vituperated against the developers for ruining London's skyline."}, {"viet": "Buổi lễ sẽ bắt đầu bằng một bài diễn văn chào mừng quan khách.", "eng": "The proceedings will begin with a speech to welcome the guests."}, {"viet": "Lời xác nhận đã quá rõ ràng không cần phải giải thích gì nữa.", "eng": "The proposition is so clear that it needs no explanation."}, {"viet": "Kim tự tháp đã được xây dựng thực sự để tồn tại lâu dài.", "eng": "The pyramids were really built to last."}, {"viet": "Con đường sắt chạy song song với đường cái.", "eng": "The railway runs paralleled to the road."}, {"viet": "Nhân viên đón tiếp chẳng giúp đỡ gì khi chúng tôi đến.", "eng": "The receptionist was less than helpful when we arrived."}, {"viet": "Báo cáo có một mục nói về các tai nạn lao động.", "eng": "The report has a section on accidents at work."}, {"viet": "Các cuộc liên hoan kéo dài thâu đêm.", "eng": "The revelries went on all night."}, {"viet": "Các sông ngòi và đại dương của thế giới.", "eng": "The rivers and oceans of the world."}, {"viet": "Căn phòng trông trống trơn, vì các đồ đạc đã bị đem đi.", "eng": "The room looked bare, shorn of its rich furnishings."}, {"viet": "Tình trạng han gỉ của chiếc xe đạp.", "eng": "The rusty condition of the bicycle."}, {"viet": "Phong cảnh hoà điệu tuyệt vời với tình huống lạ lùng của vở kịch.", "eng": "The scenery chimed perfectly with eerie mood of the play."}, {"viet": "Vỏ sò, ốc là vật lưu niệm về chuyến đi của họ đến Atlantic City.", "eng": "The seashell was a token of their trip to Atlantic City."}, {"viet": "Cung cách phục vụ thật tệ nên tôi sẽ không để lại tiền boa đâu.", "eng": "The service was terrible so I'm not going to leave a tip."}, {"viet": "Con tàu lướt qua sóng và gió ở phía sau.", "eng": "The ship surge through the waves with the wind astern."}, {"viet": "Tiếng kêu lanh lảnh của con vẹt.", "eng": "The shrill call of the parrot."}, {"viet": "Bầu trời màu xám khi chúng tôi tới Luân Đôn.", "eng": "The skies were grey when we arrived in London."}, {"viet": "Những đảng viên đảng xã hội trúng cử trong lần bầu cuối cùng.", "eng": "The socialists came in at the last election."}, {"viet": "Tiếng gió, biển, xe hơi, giọng nói, cốc vỡ.", "eng": "The sound of the wind, sea, a car, voices, breaking glass."}, {"viet": "Phi đội đó thực hiện một chuyến bay trinh sát.", "eng": "The squadron flew a reconnaissance mission."}, {"viet": "Vòi của con bọ cạp nằm ở đuôi nó.", "eng": "The sting of a scorpion is in its tail."}, {"viet": "Những cuộc đình công là dấu hiệu của sự bất mãn ( về trả lương thấp ).", "eng": "The strikes were a sign of discontent ( with poor pay )."}, {"viet": "Mặt trời ở giữa trong hệ thống thái dương.", "eng": "The sun is central in the solar system."}, {"viet": "Tính gộp lại, tăng thuế sẽ gây ra nhiều khó khăn.", "eng": "The tax increases will, in the aggregate, cause much hardship."}, {"viet": "Đội này đã vượt lên trước bỏ xa các đội khác trong giải vô địch.", "eng": "The team has pulled well ahead of the rest in the championship."}, {"viet": "Ngữ điệu đó sẽ là tiếng Anh khi nó được một người có học thức ở Anh sử dụng.", "eng": "The theme is English as spoken by an educated man in England."}, {"viet": "Thời gian cho cuộc họp của chúng ta đã được ấn định rồi.", "eng": "The time for our meeting has been fixed already."}, {"viet": "Đường đi của cơn bão, sao chổi, vệ tinh.", "eng": "The track of a storm, comet, satellite."}, {"viet": "Hướng của bờ biển chuyển về phía tây.", "eng": "The trend of the coast turned toward the west."}, {"viet": "Hai thủ lĩnh đang đấu tranh với nhau để giành quyền lực.", "eng": "The two leaders are struggling for power."}, {"viet": "Công đoàn nói họ sẽ hành động để bảo vệ công ăn việc làm của các thành viên của họ.", "eng": "The union said they would take action to defend their members'jobs."}, {"viet": "Lần gần đây nhất tôi gặp cô ta thì cô ấy đang làm việc ở London.", "eng": "The very next time I saw her she was working in London."}, {"viet": "Bức tường che chắn đạn cho những người lính.", "eng": "The wall sheltered the soldiers from gunfire."}, {"viet": "Sức nặng của cái áo choàng làm cho mặc nó không thoải mái.", "eng": "The weight of the overcoat made it uncomfortable to wear."}, {"viet": "Cơn gió suýt nữa giật chiếc ô tuột khỏi tay tôi.", "eng": "The wind nearly tugged my umbrella out of my hand."}, {"viet": "Những từ trong từ điển này xếp theo vần chữa cái abc.", "eng": "The words in this dictionary are in alphabetical order."}, {"viet": "Khuôn mặt trẻ làm mái tóc bạc trên đó trông rất lạ.", "eng": "The young face belied the grey hair above it."}, {"viet": "Những cuộc cãi vã rất hay xảy ra giữa hai vợ chồng đã làm cho cuộc hôn nhân mất hẳn vẻ tươi đẹp ban đầu.", "eng": "Their frequent rows took the bloom off their marriage."}, {"viet": "Sự ương ngạch của họ làm cho những cuộc thảo luận hoá thành vô nghĩa.", "eng": "Their stubbornes stultified the discussions."}, {"viet": "Rồi thì bạn có thể xin nhiều loại công việc khác nhau.", "eng": "Then you can apply for lots of different jobs."}, {"viet": "Có một nét rất bướng bỉnh ở đứa trẻ đó.", "eng": "There's a very obstinate streak in that child."}, {"viet": "Trong một cốc nước cam vắt không có nhiều chất bổ.", "eng": "There's not much sustenance in a glass of orange squash."}, {"viet": "Có ít ô tô đỗ ở bên ngoài hơn hôm qua.", "eng": "There are fewer cars parked outside than yesterday."}, {"viet": "Có rất nhiều câu chuyện buồn và cảm động gắn liền với Vạn Lý Trường Thành.", "eng": "There are so many sad and touching stories associated with the Great Wall."}, {"viet": "Có một sự nhầm lẫn họ tên.", "eng": "There has been some confusion of names."}, {"viet": "Có một con rắn phía sau bạn kìa.", "eng": "There is a snake behind you."}, {"viet": "Có một thác nước ở sau thành phố, xuôi theo con sông khoảng mười dặm.", "eng": "There is one after the town, down the river about ten miles."}, {"viet": "Có một vẻ lúng túng rõ rệt trong thái độ.", "eng": "There was a distinct sense of embarrassment in the air."}, {"viet": "Không có tin tức gì, mặc dù thế chúng tôi vẫn tiếp tục hy vọng.", "eng": "There was no news, nevertheless we went on hoping."}, {"viet": "Có tiếng la thét vì kích động của lũ trẻ.", "eng": "There were squeals of excitement from the children."}, {"viet": "Những con chó này cho chúng ta thêm một lý do nữa để gọi chó là người bạn tốt của con người.", "eng": "These dogs give us one more reason for calling the dog man's best friend."}, {"viet": "Những người tù này được đặc ân nhận thư hàng ngày.", "eng": "These prisoners have the privilege of getting letters everyday."}, {"viet": "Họ không quan tâm đến phúc lợi đâu: chỉ toàn là trò đấu đá chính trị thôi!", "eng": "They're not concerned with welfare: it's all politics!"}, {"viet": "Họ luôn luôn đến dự tiệc tay không.", "eng": "They always arrive at parties empty-handed."}, {"viet": "Họ đang làm việc để cứu rừng mưa nhiệt đới của Brazil.", "eng": "They are working to save the Brazilian rain forest."}, {"viet": "Họ góp tiền mua cho ông chủ tịch một món quà.", "eng": "They clubbed together to buy the chairman a present."}, {"viet": "Họ không ngồi lâu lắm đâu.", "eng": "They don't sit very long."}, {"viet": "Họ đã ngồi một thời gian dài ở nhà ga giữa các chuyến tàu.", "eng": "They had a long sit at the station between trains."}, {"viet": "Họ giúp anh ta khỏi tình trạng khó khăn.", "eng": "They helped him out of rather a nasty hole."}, {"viet": "Họ xoay xở lách qua được lớp rào dày.", "eng": "They managed to wriggle through the thick hedge."}, {"viet": "Họ hoãn cuộc họp một nửa tháng.", "eng": "They postponed the meeting for a fortnight."}, {"viet": "Họ âm mưu lật đổ đối thủ của họ.", "eng": "They schemed to overthrow their rivals."}, {"viet": "Họ chửi nó là đồ hèn nhát.", "eng": "They taunted him with cowardice."}, {"viet": "Tất cả bọn họ đều diện bảnh bao để dự tiệc.", "eng": "They were all spruced up for the party."}, {"viet": "Họ có nhiệm vụ đến chỗ này một giờ trước đây.", "eng": "They were supposed to be here an hour ago."}, {"viet": "Cái chuyện những chuyến đi của anh ấy là bịa.", "eng": "This account of his travels is apocryphal."}, {"viet": "Lớp học này như là chợ vỡ: hãy yên lặng nào!", "eng": "This classroom is a madhouse: be quiet!"}, {"viet": "Lối vào này được sử dụng thường xuyên, đừng chặn lại.", "eng": "This entrance is in constant use, do not block it."}, {"viet": "Đây là chuyện xảy ra hàng ngày.", "eng": "This is a matter of everyday occurrence."}, {"viet": "Đó là sự thật trong chừng mực tôi biết được.", "eng": "This is the truth in so far as I know it."}, {"viet": "Đây chắc là em trai anh: tôi có thể thấy một dáng vẻ giống nhau.", "eng": "This must be your brother: I can see a family likeness."}, {"viet": "Cảng này xử lý 100 triệu tấn hàng chuyên chở một năm.", "eng": "This port handles 100 million tons of cargo each year."}, {"viet": "Đoạn lời này cần được nói một cách tự nhiên.", "eng": "This speech is meant to be thrown away."}, {"viet": "Cả thành phố này là một chứng tích về tài năng của ông ta, một nhà hoạch định kế hoạch và nhà quản lý.", "eng": "This whole city is a monument to his skill as a planner and administrator."}, {"viet": "Bảy trăm đô la trừ cho ba trăm còn lại bốn trăm.", "eng": "Three hundred dollars from seven hundred leaves four hundred."}, {"viet": "Các lưỡi lửa bập bùng quanh đống lửa đốt ngoài trời.", "eng": "Tongues of flame lapping the edges of the bonfire."}, {"viet": "Trừ khi giới chủ hành động nhanh chóng, nếu không sẽ có bãi công.", "eng": "Unless the employers move quickly, there will be a strike."}, {"viet": "Máy giặt, máy hút bụi và máy rửa bát tất cả đều là những thiết bị tiết kiệm sức lao động.", "eng": "Washing machine, vacuum cleaner and dishwasher are all labour-saving devices."}, {"viet": "Chúng tôi sẽ bàn đến một vài ý kiến và quyết định vào ngày mai.", "eng": "We'll kick some ideas around and make a decision tomorrow."}, {"viet": "Chúng ta đang ở vị trí trong sân nên điều đó không thể được.", "eng": "We're in infield seats so that's impossible."}, {"viet": "Chúng tôi đã làm thất bại những biện pháp nhằm xây dựng thêm một khu làm việc nữa.", "eng": "We've defeated moves to build another office block."}, {"viet": "Tất cả chúng tôi đều khiếp sợ khi nghĩ đến những gì sẽ xảy ra nếu nhà máy đóng cửa.", "eng": "We all dread to think what will happen if the factory closes."}, {"viet": "Bây giờ chúng tôi đã ổn định cuộc sống sung túc trong ngôi nhà của chúng tôi.", "eng": "We are now comfortably established in our new house."}, {"viet": "Họ mua công khai và đọc công khai.", "eng": "We buy them openly and read them openly."}, {"viet": "Chúng tôi có thể hiểu rằng bà ta sẽ phản đối.", "eng": "We can take it as read that she will object."}, {"viet": "Chúng tôi thật hết hi vọng về nó, nó không làm được việc nào quá sáu tháng.", "eng": "We despair of him, he can't keep a job for more than six months."}, {"viet": "Chúng ta đã thất bại và bây giờ tôi mới nhận thức được chúng ta đã sai lầm ở chỗ nào.", "eng": "We failed and with hindsight I now see where we went wrong."}, {"viet": "Chúng tôi đã hy vọng hoàn thành vào lúc bốn giờ.", "eng": "We had hoped to finish by four o'clock."}, {"viet": "Chúng tôi đã tăng giá ô tô mới của chúng tôi lên gấp đôi.", "eng": "We have doubled sales of our new car have."}, {"viet": "Chúng tôi không có chỗ cho một người khách, vả lại, nhà cửa bừa bộn quá.", "eng": "We haven't got room for a visitor, also, the house is far too untidy."}, {"viet": "Chúng ta sẽ có thể xem chúng rất rõ.", "eng": "We'll be able to see them perfectly."}, {"viet": "Chúng ta phải xem xét vấn đề trên mọi phương diện.", "eng": "We must consider the question in all its bearings."}, {"viet": "Chúng tôi cần có người để chào bán sản phẩm của mình ( cho các đại lý, ở nước Đức, v. v. ).", "eng": "We need somebody to market our products ( to retailers, in Germany, etc )."}, {"viet": "Chúng tôi đã ra đến vùng ngoại ô thành phố và bắt đầu tăng tốc.", "eng": "We reached the out skirt of town and begin to pick up speed."}, {"viet": "Nếu không bị tắc dừng dọc đường, thì nửa tiếng nữa là chúng ta đến nơi.", "eng": "We should arrive in half an hour, barring hold-ups."}, {"viet": "Chúng tôi đã đi tới Rome qua Milan và Florence.", "eng": "We travelled to Rome by Milan and Florence."}, {"viet": "Tất cả chúng tôi đều mất tinh thần khi ông ấy từ chối hợp tác.", "eng": "We were all dismayed at his refusal to co-operate."}, {"viet": "Chúng tôi rất túng quẫn khi tôi mất việc.", "eng": "We were very hard up when I lost my job."}, {"viet": "Cân nhắc những lợi thế của cuộc hành quân với những rủi ro có thể xảy ra.", "eng": "Weigh the advantages of the operation against the risks involved."}, {"viet": "À, chúng ta hãy xem qua văn phòng trước đã.", "eng": "Well, let's take a look round the office first."}, {"viet": "Vấn đề đang được tranh luận ở đây là toàn bộ tương lai của nền công nghiệp.", "eng": "What's at issue here is the whole future of the industry."}, {"viet": "Một số chính sách về việc hút thuốc của nước bạn là gì?", "eng": "What are some of your country's smoking policies?"}, {"viet": "Anh ấy đã nói gì trong thông báo đó vậy?", "eng": "What did he say in the announcement?"}, {"viet": "Bạn thích hình thức tập luyện nào hơn?", "eng": "What form of exercise do you prefer?"}, {"viet": "Môn thể thao nào được ưa chuộng nhất trên thế giới?", "eng": "What is the most popular sport in the world?"}, {"viet": "Bạn có thể làm gì với cái ván trượt của bạn?", "eng": "What kind of tricks can you do with your skateboard?"}, {"viet": "Ông cần loại văn bằng nào cho công việc này?", "eng": "What sort of qualifications do you need for the job?"}, {"viet": "Đưa ai đến phòng mổ bằng xe đẩy.", "eng": "Wheel sb to the operating theatre on a trolley."}, {"viet": "Khi hắn ta buộc phải van xin bè bạn, hắn ta cảm thấy mình đến bước đường cùng.", "eng": "When he was forced to beg from his friends, he left he had touched bottom and could no lower."}, {"viet": "Khi đề nghị lịch sự không xong, anh ta dùng tới sự đe doạ.", "eng": "When polite requests failed, he resorted to threats."}, {"viet": "Khi đăng bài phỏng vấn, họ đã đề trong lời nói đầu ghi chú báo trước một số chữ dùng ở đây có thể gây khó chịu.", "eng": "When they published the interview, they prefaced it with an advisory note that some of the language used might be offensive."}, {"viet": "Em có thể mua tạp ở đâu ạ?", "eng": "Where can I buy a notebook?"}, {"viet": "Công ty xe hơi nào nổi tiếng nhất ở nước bạn?", "eng": "Which car company is the most famous in your home country?"}, {"viet": "Đường nào thì nhanh hơn-bằng xe buýt hay bằng tàu hoả?", "eng": "Which way is quicker-by bus or by train?"}, {"viet": "Ai sẽ trao cúp vàng cho người thắng cuộc?", "eng": "Who is going to present the gold cup to the winner?"}, {"viet": "Sao bà lại thích loại đó hơn?", "eng": "Why do you like that one better?"}, {"viet": "Các loài động vật hoang dã không cho phép các loài vật khác xâm nhập vào lãnh thổ của chúng.", "eng": "Wild animals will not allow other animals to enter their territory."}, {"viet": "Em vá giùm anh cái quần này nhé.", "eng": "Will you please put a patch on these trousers."}, {"viet": "Với một nỗi buồn to lớn, cha nàng đồng ý cuộc hôn nhân của nàng.", "eng": "With great sadness, her father consented to her marriage."}, {"viet": "Các công nhân tiếp xúc với amiăng cần mặc quần áo bảo hộ lao động.", "eng": "Workers who handle asbestos need to wear protective clothing."}, {"viet": "Anh có muốn uống tý rượu hoặc đồ uống gì không có rượu không?", "eng": "Would you like some wine or something soft?"}, {"viet": "Anh vui lòng giới thiệu một số món ăn Tứ Xuyên đặc trưng được không?", "eng": "Would you please recommend some typical Sichuan dishes?"}, {"viet": "Có, nhưng tôi chơi quần vợt không giỏi lắm.", "eng": "Yes, but I'm not very good at it."}, {"viet": "Vâng, chúng tôi mở cửa từ 10 giờ sáng đến 5 giờ chiều.", "eng": "Yes, we are open from 10 a. m. till 5 p. m."}, {"viet": "Anh sẽ phải kiên nhẫn với mẹ tôi-bà cụ hơi nghễnh ngãng.", "eng": "You'll have to be patient with my mother-she's going rather deaf."}, {"viet": "Rõ ràng anh có điều gì băn khoăn, tại sao không nói ra đi để bụng làm gì?", "eng": "You're obviously worried about something, why not get it off your chest?"}, {"viet": "Bạn được mời đến xem gian trưng bày quần áo mùa thu của chúng tôi.", "eng": "You are invited to view our autumn collection."}, {"viet": "Anh không thể gặp chị ấy bây giờ-chị ấy đang nói chuyện điện thoại.", "eng": "You can't see her now-she's on the phone."}, {"viet": "Anh sao giùm tôi số giấy tờ này và kẹp chúng lại.", "eng": "You can photocopy these papers for me and staple them."}, {"viet": "Lúc đó bà còn chưa biết hôn nữa mà.", "eng": "You didn't even know how to kiss."}, {"viet": "Anh phải thừa nhận cái lôgic trong lập luận của anh ta.", "eng": "You have to accept the logic of his argument."}, {"viet": "Anh đã làm một quyết định sai lầm và bây giờ anh phải chịu hậu quả.", "eng": "You made the wrong decision and now you must take the consequences."}, {"viet": "Anh phải học cách đặt trọng âm vào đâu.", "eng": "You must learn where to place the stresses."}, {"viet": "Anh còn nợ tôi 85 pao: trả đi chứ!", "eng": "You owe me 85 pounds: come on, disgorge!"}, {"viet": "Anh nên đề nghị bồi thường cho thiệt hại này.", "eng": "You should seek redress for this damage."}, {"viet": "Hôm qua cô nghỉ ai cũng biết đấy.", "eng": "You were conspicuous by your absence yesterday."}, {"viet": "Những người mới tuyển hoàn toàn thiếu mọi kinh nghiệm.", "eng": "Young recruits destitute of any experience."}, {"viet": "Đơn đặt hàng cà phê hạt của các ông bây giờ đã được chuẩn bị xong để vận chuyển.", "eng": "Your order for coffee beans is now ready for shipment."}]