[{"viet": "4 là căn bậc hai của 16, căn bậc ba của 64, căn bậc bốn của 256.", "eng": "4 is the square root of 16, the cube root of 64 and the fourth root of 256."}, {"viet": "Một nghề độc nhất vô nhị ngày nay.", "eng": "A career without parallel in modern times."}, {"viet": "Tiếng chuông đồng hồ trong căn nhà đó điểm nhịp nhàng, trang trọng.", "eng": "A clock struck slowly in the house with a measured, solemn chime."}, {"viet": "Hành động hèn nhát làm hoen ố ký ức của anh ta.", "eng": "A cowardly act that dishonours his memory."}, {"viet": "Từ điển giúp ta phân biệt được cách dùng đúng và sai.", "eng": "A dictionary help one to distinguish correct and incorrect usage."}, {"viet": "Một gia đình đã sinh ra một quái thai.", "eng": "A family that has spawned a monster."}, {"viet": "Một chút thích thú chẳng mấy chốc biến thành một nỗi khát khao nồng cháy.", "eng": "A flicker of interest soon turned into the burning flames of desire."}, {"viet": "Một cuốn từ điển tốt là rất cần thiết cho việc học một ngoại ngữ.", "eng": "A good dictionary is indispensable for learning a foreign language."}, {"viet": "Một thói quen ăn sâu vào cậu nếu cậu không thận trọng.", "eng": "A habit that grows on you if you are not careful."}, {"viet": "Một ngôi nhà có vườn ở phía sau.", "eng": "A house with a garden at the back."}, {"viet": "Một viên đá lớn văng qua cửa sổ.", "eng": "A large stone came flying through the window."}, {"viet": "Một gác xép có sức chứa nhiều.", "eng": "A loft with large storage capacity."}, {"viet": "Một giám đốc có kinh nghiệm phong phú về công nghiệp.", "eng": "A manager with wide experience of industry."}, {"viet": "Một hoa tai làm bằng xà cừ.", "eng": "A mother-of-pearl ear-ring."}, {"viet": "Một dụng cụ xinh xắn tiện lợi để gọt khoai tây.", "eng": "A nifty little gadget for peeling potatoes."}, {"viet": "Một cảm giác lạ lùng như ai đó đã ở từng ở đây.", "eng": "A peculiar feeling that one has been here before."}, {"viet": "Một vở kịch đầy những lời ám chỉ có tính chất thời sự về những nhân vật nổi tiếng.", "eng": "A play full of topical allusions to well-known people."}, {"viet": "Một vật trưng bầy trội nhất trong cuộc triển lãm hoa.", "eng": "A prize exhibit in the flower show."}, {"viet": "Một giải pháp hợp lý cho vấn đề đó.", "eng": "A reasoned approach to the problem."}, {"viet": "Một sự chợt tỉnh trước thực tế của cuộc đời.", "eng": "A rude awakening to the realities of life."}, {"viet": "Một quyết định quan trọng về việc từ bỏ một việc làm vững bền.", "eng": "A serious decision about giving up a steady job."}, {"viet": "Một vết nứt nhỏ khó thấy trên chiếc bình.", "eng": "A small inconspicuous crack in the vase."}, {"viet": "Một quyển tiểu thuyết trinh thám có bố cục chặt chẽ.", "eng": "A spy novel with a strong story."}, {"viet": "Một bảng tường thuật tóm tắt về một cuộc tranh cãi dài.", "eng": "A summary account of a long debate."}, {"viet": "Một cảnh hồi hộp trong đó có một màn đuổi bắt bằng xe ôtô.", "eng": "A thrilling sequence that includes a car chase."}, {"viet": "Một quang cảnh có thể so sánh với bất kỳ quang cảnh nào của dãy núi Alps.", "eng": "A view rivalling anything the Alps can offer."}, {"viet": "Một từ không sử dụng, ngoại trừ trong thuật ngữ y học.", "eng": "A word not used except in medical terminology."}, {"viet": "Đạt được ưu thế quân sự đối với các nước láng giềng.", "eng": "Achieve military supremacy over neighbouring countries."}, {"viet": "Đầu óc của tôi hoàn toàn lú lẫn sau vài cốc uýtki.", "eng": "After a couple of whiskies my head felt all muzzy."}, {"viet": "Sau khi trời mưa, anh có thể rửa xe lần nữa.", "eng": "After it rains, I can wash my car again."}, {"viet": "Sau trận đấu người tôi ướt đẫm mồ hôi.", "eng": "After the match, I was bathed with sweat."}, {"viet": "Tất cả phi cơ phải đổ nhiên liệu trước một chuyến đi dài.", "eng": "All aircraft must fuel before long flight."}, {"viet": "Nghe thấy được tất cả những tiếng động lạ.", "eng": "All sorts of strange sounds met the ear."}, {"viet": "Allen đã vào sân ngay trước khi hết hiệp thứ nhất.", "eng": "Allen went on, just before half time."}, {"viet": "Trong đó có than đá và sắt.", "eng": "Among them are cold and iron."}, {"viet": "Một bài báo được in lại toàn bộ trong một bộ sưu tập sau.", "eng": "An article reprinted in extenso in a later collection."}, {"viet": "Một sự giải thích xa với sự thật.", "eng": "An explanation far removed from the truth."}, {"viet": "Một nếp nhăn rõ ràng trên đường may chiếc áo đầm của cô ta.", "eng": "An obvious pucker in the seam of her dress."}, {"viet": "Một món mì trộn cà ri không ngon.", "eng": "An unsavoury mixture of cold pasta and curry."}, {"viet": "Loài vật sống trong trạng thái tự nhiên.", "eng": "Animals living in their natural state."}, {"viet": "Những lời kêu gọi nhân danh những người bị thua thiệt.", "eng": "Appeals on behalf of the disadvantaged."}, {"viet": "Có phải Tony và Jane cặp bồ với nhau không?", "eng": "Are Tony and Jane going steady?"}, {"viet": "Ở trong bóng tối anh có sợ không?", "eng": "Are you nervous in the dark?"}, {"viet": "Kim cương nhân tạo ngày nay có thể tạo ra trong các lò luyện bằng điện.", "eng": "Artificial diamonds can now be made in electric furnaces."}, {"viet": "Trôi chảy như một bài thơ, nhưng tù túng như nước mương.", "eng": "As slick as a sonnet, but as dull as ditch water."}, {"viet": "Đảm nhận hoàn toàn trách nhiệm về những hậu quả.", "eng": "Assume full responsibility for the consequences."}, {"viet": "Tới vòng xoay theo đường ra thứ ba.", "eng": "At the roundabout, take the third exit."}, {"viet": "Chuối thường được bán theo trọng lượng.", "eng": "Bananas are usually sold by weight."}, {"viet": "Phạm tội xao lãng nhiệm vụ nghiêm trọng.", "eng": "Be guilty of a serious dereliction of duty."}, {"viet": "Do vị tướng thiếu kiên quyết, quân đội của chúng ta đã để mất thế chủ động vào tay địch.", "eng": "Because of the general's indecisiveness, our armies have lost the initiative to the enemy."}, {"viet": "Ngoài những sự kiện lớn này ra, thể thao là hình thức giải trí được yêu thích trên khắp đất nước.", "eng": "Besides these big events, sports as recreation is enjoyed throughout the country."}, {"viet": "Quân lính của cả hai bên đều có những hành động tàn ác vô độ.", "eng": "Both armies were guilty of extremities."}, {"viet": "Bánh mì đen có nhiều chất bổ.", "eng": "Brown bread is full of goodness."}, {"viet": "Nhưng tôi cũng sống bên cạnh con sông.", "eng": "But I live beside the river, too."}, {"viet": "Thế còn những người thợ thì sao, tôi nghe anh nói mà.", "eng": "But what about the workers, I hear you cry."}, {"viet": "Tiện thể cho tôi hỏi, tôi có thể rút tiền bất cứ lúc nào không?", "eng": "By the way, can I make withdrawals at any time?"}, {"viet": "Tôi có thể đi đến đó và trở lại trong ngày được không?", "eng": "Can I go there and back in a day?"}, {"viet": "Chúng ta có thể chạy chậm lại và đi bộ một tí không?", "eng": "Can we slow down and walk for a bit?"}, {"viet": "Bạn biết chơi nhạc khí nào không?", "eng": "Can you play any musical instruments?"}, {"viet": "Bạn không thể vào nhà chơi một lát sao?", "eng": "Can't you come in for a while?"}, {"viet": "Đổi tiền Anh sang tiền Pháp.", "eng": "Change English money into French money."}, {"viet": "Chọn lằn phía trong để chạy.", "eng": "Choosing to run on the inside track."}, {"viet": "Thời tiết lạnh lẽo càng làm chứng phong thấp của tôi tồi tệ hơn.", "eng": "Cold weather play the devil with my rheumatism."}, {"viet": "Các biến chứng nảy sinh và bệnh nhân đã chết.", "eng": "Complications set in and the patient died."}, {"viet": "Việc khống chế giá lương là yếu tố mấu chốt trong chính sách của nhà nước.", "eng": "Controlling wages is the linchpin of Government's policies."}, {"viet": "Ông có thể trông hộ cái va-li cho tôi một chút không?", "eng": "Could you keep an eye on my suitcase for me in a moment?"}, {"viet": "Những tội ác làm cả cộng đồng phẫn nộ.", "eng": "Crimes that inflamed the entire community."}, {"viet": "Từ David bắt đầu và kết thúc bằng mẫu tự D.", "eng": "David begins and ends with a D."}, {"viet": "Xuất thân từ dòng dõi trực hệ với vua David.", "eng": "Descended from King David in a direct line."}, {"viet": "Anh đã mua chiếc xe hơi của anh mới hay là cũ?", "eng": "Did you buy your car new or second-hand?"}, {"viet": "Kiên trì đeo đuổi mục đích của mình.", "eng": "Diligence in pursuing one's aims."}, {"viet": "Làm lấy đi con-Bố không rảnh.", "eng": "Do it yourself-I haven't got time."}, {"viet": "Bạn có tin là có phân biệt đối xử về giới tính ở các công ty không?", "eng": "Do you believe there is sex-discrimination in companies?"}, {"viet": "Ông có chút giờ rảnh rỗi nào để giúp tôi việc này không?", "eng": "Do you have an odd minute to help me with this?"}, {"viet": "Bạn có thuộc lời quốc ca của nước bạn không?", "eng": "Do you know the words to your national anthem?"}, {"viet": "Bạn có đọc báo mỗi ngày không?", "eng": "Do you read the newspaper every day?"}, {"viet": "Anh có nghĩ là anh có thể giúp chúng tôi không?", "eng": "Do you think you'll be able to help us?"}, {"viet": "Có phải cái đạo luật mới chỉ liên quan tới việc trộm cắp không?", "eng": "Does the new law relate only to theft?"}, {"viet": "Đừng nuốt đồ ăn, con sẽ bị khó tiêu đấy!", "eng": "Don't bolt your food, you'll get indigestion!"}, {"viet": "Đừng có quấy rầy ông ta trong khi ông ta đang làm việc.", "eng": "Don't interfere with him while he's working."}, {"viet": "Đừng có giục tôi-điều này cần phải suy nghĩ kỹ.", "eng": "Don't rush me-this needs thinking about."}, {"viet": "Đừng lo, tôi chắc mọi việc rồi sẽ được giải quyết êm xuôi thôi.", "eng": "Don't worry, I'm sure it'll all come out, in the wash."}, {"viet": "Lái xe trong đêm mà không có đèn pha là phạm luật.", "eng": "Driving without headlights at night is illegal."}, {"viet": "Các cuộn bụi xoáy bên đường.", "eng": "Eddies of dust swirled in the road."}, {"viet": "Phải bảo đảm là thị trường truyền thống của chúng ta được chăm sóc; về những vấn đề khác, tôi không quan tâm lắm.", "eng": "Ensure that our traditional markets are looked after; for the rest, I am not much concerned."}, {"viet": "Mỗi ngày tớ gặp rất nhiều người, nhưng tớ cũng đánh máy và lưu tài liệu thật nhiều.", "eng": "Everyday I meet lots of people, but I do lots of typing and filing, too."}, {"viet": "Xin lỗi, có phải đây là ghế của anh không?", "eng": "Excuse me, is this your seat?"}, {"viet": "Thất bại để lại cho cô ta cay đắng và bất thường.", "eng": "Failure left her bitter and twisted."}, {"viet": "Tiền thù lao tính trên thang đối chiếu theo thu nhập.", "eng": "Fees are calculated on a sliding scale according to income."}, {"viet": "Trước hết, họ đúc sàn, sau đó họ dựng tường của tầng tiếp.", "eng": "First, they put in a floor, then they put up the walls for the next story."}, {"viet": "Theo ơn kêu gọi để trở thành một nữ tu.", "eng": "Follow one's vocation to become a nun."}, {"viet": "Việc ngoại giao là một lãnh vực sinh hoạt thoải mái riêng tư của T. R. trong thời gian ông làm Tổng thống.", "eng": "Foreign affairs had been T. R.'s personal playground during Presidency."}, {"viet": "Từ điểm lợi thế này, người ta có thể thấy Đồi Trường Thọ ở bên kia hồ, bờ trước mặt của nó với các ngọn tháp và sảnh đường nằm rải rác.", "eng": "From this vantage point, one can see the Longevity Hillacross the lake, its front bank dotted with towers and pavilions."}, {"viet": "Lấy một hạt cát trong mắt của mình.", "eng": "Get a piece of grit in one's eyes."}, {"viet": "Cho tôi gởi lời thăm ông bà Jones và các cháu.", "eng": "Give my regards to Mr. and Mrs. Jones and family."}, {"viet": "Hãy đi thẳng theo con đường này cho đến khi ông đến chỗ đèn giao thông thứ ba.", "eng": "Go straight along this street until you come to the third light."}, {"viet": "Mặt đất phủ đầy lá ướt, ép chặt với nhau.", "eng": "Ground covered with wet, heavily packed leaves."}, {"viet": "Đóng một vai nói trong vở kịch đó.", "eng": "Has a speaking part in the play."}, {"viet": "Anh đòi tiền bồi thường bảo hiểm chưa?", "eng": "Have you claimed the insurance yet?"}, {"viet": "Anh đã được tiêm thuốc phòng thương hàn chưa?", "eng": "Have you had your typhus shots yet?"}, {"viet": "Anh ta kết giao với những tên tội phạm nổi tiếng.", "eng": "He'd been consorting with known criminals."}, {"viet": "Nó luôn luôn hứa hẹn nhưng chẳng bao giờ giữ lời hứa.", "eng": "He's always making promises, only he never keeps them."}, {"viet": "Nó ngã xuống nước rồi! đừng lo, tôi sẽ cứu nó.", "eng": "He's fallen into the water! don't worry, I'll save him."}, {"viet": "Nó hoàn toàn chẳng có gì là hấp dẫn cả, thật ra nó rất tầm thường.", "eng": "He's not at all exciting, in fact he's really rather commonplace."}, {"viet": "Nó mải mê chăm chú đến nỗi không chú ý gì đến chúng ta.", "eng": "He's too self-absorbed to care about us."}, {"viet": "Nó luôn luôn tránh né những công việc buồn tẻ.", "eng": "He always shirks the unpleasant tasks."}, {"viet": "Cậu ta tin rằng cậu được ơn kêu gọi trở thành linh mục.", "eng": "He believes it is his calling to become a priest."}, {"viet": "Ông ta có thể thủ vai của nhiều chính khách nổi tiếng.", "eng": "He can impersonate many well-known politicians."}, {"viet": "Anh ta tự an ủi mình bằng ý nghĩ là biết đâu chuyện ấy chẳng đã xảy ra tồi tệ hơn.", "eng": "He consoled himself with the thought that it might have been worse."}, {"viet": "Anh ta không tán thành việc bà ta thay đổi chính sách của đảng.", "eng": "He deprecates her changing the party's policy."}, {"viet": "Nó không thích Beethoven và tôi cũng vậy.", "eng": "He doesn't like Beethoven and neither do I."}, {"viet": "Hắn trượt các kỳ thi và bị đuổi khỏi đại học.", "eng": "He failed his exams and was chucked out of university."}, {"viet": "Hôm qua anh ta đã quên mua thêm cà phê nên anh ta không có đủ tư cách dự bữa điểm tâm sáng nay!", "eng": "He forgot to buy more coffee yesterday, so he was persona non grata at breakfast this morning!"}, {"viet": "Gặp phụ nữ nào hắn cũng theo đuổi.", "eng": "He goes after every woman he meets."}, {"viet": "Anh ta đã nhiều lần lái xe về nhà khi đang say-lần này thì anh ta bị cảnh sát chặn lại.", "eng": "He had driven home drunk once too often-this time he got stopped by the police."}, {"viet": "Anh ta có người cộng sự rất khéo léo tổ chức mọi việc cho anh.", "eng": "He has a practical partner who organizes everything for him."}, {"viet": "Ông ta chưa bao giờ là thành viên nghiệp đoàn.", "eng": "He has never belonged to a trade union."}, {"viet": "Anh ấy đã giúp tôi trong giờ phút hoạn nạn.", "eng": "He helped me in my hour of need."}, {"viet": "Ông ta đã ly dị vợ và tôi cũng thế.", "eng": "He is divorced and so am I."}, {"viet": "Anh ta là nạn nhân của chính sự thành công của anh ta.", "eng": "He is the victim of his own success."}, {"viet": "Nó dốc sức hoàn thành công việc đúng giờ.", "eng": "He laboured to finish the job on time."}, {"viet": "Anh ấy mong muốn hơn hết mọi thứ là gặp lại gia đình.", "eng": "He longs above all else to see his family again."}, {"viet": "Anh ta cho là mình thông minh hơn mức thật sự của mình.", "eng": "He makes himself out to be cleverer than he really is."}, {"viet": "Anh ta không bao giờ cười nhiều như vậy.", "eng": "He never so much as smiled."}, {"viet": "Chàng gối đầu vào lòng nàng.", "eng": "He pillowed his head on her lap."}, {"viet": "Anh ta rút một nắm tiền giấy 10 pao từ túi ra.", "eng": "He pulled a wad of 10 pound notes out of his pocket."}, {"viet": "Ông ta xác định rằng tất cả các bên đều phải được đưa vào cuộc đàm phán.", "eng": "He reasserted that all parties should be involved in the negotiations."}, {"viet": "Ông ấy lại tiếp tục trầm ngâm nhìn ngọn lửa.", "eng": "He returned to his contemplation of the fire."}, {"viet": "Ông ta luôn luôn chậm trả tiền thuê nhà.", "eng": "He's always behind time with the rent."}, {"viet": "Anh ta đã đảm nhận một vai trong vở Hamlet.", "eng": "He's got the name-part in Hamlet."}, {"viet": "Ông ta dễ bị bệnh vặt.", "eng": "He's prone to minor ailments."}, {"viet": "Anh đã nói rằng lễ hội powwow này dành cho các bộ lạc khác nhau.", "eng": "He said this powwow was for different tribes."}, {"viet": "Hắn dường như trở nên điên thật.", "eng": "He seems to have gone to be quite potty."}, {"viet": "Anh ta đóng cửa không cho cô ấy vào.", "eng": "He shut the door in her face."}, {"viet": "Anh ta nói quá kiên quyết đến nỗi chúng tôi không ai dám đặt câu hỏi.", "eng": "He spoke so decidedly that none of us dared question him."}, {"viet": "Anh ta đã làm một việc sai trái khi đến dự lễ cưới trong bộ áo quần cũ kỹ.", "eng": "He struck a false note when he arrived for the wedding in old clothes."}, {"viet": "Ông dạy họ rằng một người tốt không bao giờ được tức giận", "eng": "He taught them that a good man never lets himself get angry."}, {"viet": "Anh ta đưa vợ đi ăn hiệu.", "eng": "He took his wife out to dinner."}, {"viet": "Hắn tìm cách đùn việc của mình cho những người khác.", "eng": "He tries to shuffle his work off onto others."}, {"viet": "Ông ấy đi chậm vì chân đau.", "eng": "He walked slowly because of his bad leg."}, {"viet": "Nó cứ luôn gây gổ ở trường.", "eng": "He was always scrapping at school."}, {"viet": "Ông ta đã bị lừa, mất hết tài sản thừa kế hợp pháp.", "eng": "He was cheated of his rightful inheritance."}, {"viet": "Anh ta được phỉnh phờ vì được cô ấy chấp nhận lời khuyên của mình.", "eng": "He was flattered by her acceptance of his advice."}, {"viet": "Anh ta ngớ người ra khi dự đoán của anh ta bị chứng minh là sai.", "eng": "He was left with egg all over his face when his forecast was proved wrong."}, {"viet": "Anh ta được thăng chức thiếu tá.", "eng": "He was promoted major."}, {"viet": "Anh ta đã bị quỵ vì ung thư ở tuổi ba mươi.", "eng": "He was struck down by cancer at the age of thirty."}, {"viet": "Nó đã bị cuốn trôi khỏi boong tàu trong cơn bão.", "eng": "He was washed overboard in the storm."}, {"viet": "Anh ta sẽ đợi thời cơ để yêu cầu ông chủ tăng lương.", "eng": "He will bide time to ask his boss for a raise."}, {"viet": "Nó thà từ chức còn hơn là tham dự vào những chuyện bất lương như thế.", "eng": "He would sooner resign than take part in such dishonest deals."}, {"viet": "Xin chào, đây là rượu của ông, thưa ông.", "eng": "Hello, this is your wine, sir."}, {"viet": "Tác phẩm của bà ấy đoạt nhiều giải thưởng văn chương.", "eng": "Her book gained several literary prizes."}, {"viet": "Những bức phác hoạ của chị ấy có sức hấp dẫn mãnh liệt.", "eng": "Her designs have a strong visual appeal."}, {"viet": "Ngón tay của nàng bị sưng phồng đến nỗi không thể nào gỡ chiếc nhẫn ra được.", "eng": "Her finger was so swollen that she couldn't get the ring off."}, {"viet": "Chồng bà ấy bị chết trong một tai nạn Ô tô.", "eng": "Her husband was killed in a car accident."}, {"viet": "Chồng cô ta được các ông chủ gửi ra nước ngoài.", "eng": "Her man's been sent oversea by his employers."}, {"viet": "Cha mẹ cô ấy đã sống chắt bóp để cho cô ấy đi học hát ở nước ngoài.", "eng": "Her parents pinched and scraped so that she could study singing abroad."}, {"viet": "Tiền lương của cô ấy khoảng 150 bảng Anh một tuần.", "eng": "Her salary is of the order of £ 150 a week."}, {"viet": "Lý thuyết của cô ấy đã bị lung lay bởi chứng cứ mới này.", "eng": "Her theory has been shaken by this new evidence."}, {"viet": "Anh chàng Robert đến kìa, tôi chắc chúng ta sẽ lại phải nghe ý kiến ba xu của anh ta.", "eng": "Here comes Robert, I suppose we'll have to hear his two cents worth."}, {"viet": "Sự nghiện ngập ma tuý đã đẩy đưa hắn vào cuộc đời tội ác.", "eng": "His addiction to drugs propelled him towards a the of crime."}, {"viet": "Cuốn sách của ông thể hiện chính xác những tư tưởng của Anh quốc thời Elizabeth.", "eng": "His book captures exactly the ethos of Elizabethan England."}, {"viet": "Lối nói chuyện của anh ấy nội dung phong phú và thú vị.", "eng": "His conversation is various and delightful."}, {"viet": "Vẻ mặt của anh ấy cho thấy anh ấy thật bất hạnh.", "eng": "His expression shows how unhappy he is."}, {"viet": "Những sự buồn nản thường xuyên của ông ấy là dấu hiệu mở đầu của sự suy nhược hoàn toàn về tinh thần.", "eng": "His frequent depressions were the prelude to a complete mental breakdown."}, {"viet": "Thật khổ tâm phải chứng kiến sự bất tài của ông ta.", "eng": "His incompetence was painful to witness."}, {"viet": "Thái độ của hắn có vẻ ta đây.", "eng": "His manner smacked of superciliousness."}, {"viet": "Sai lầm của bản thân anh ta đã dạy cho anh ta bớt nghiêm khắc đối với khuyết điểm của người khác.", "eng": "His own blunders taught him to let up on the faults of others."}, {"viet": "Việc anh ta được đề bạt nhanh đã gây ra nhiều bất bình trong các đồng nghiệp.", "eng": "His rapid promotion caused much bad feeling among his colleagues."}, {"viet": "Bài diễn văn của ông ấy vẫn theo khuôn mẫu thường lệ.", "eng": "His speech followed the usual pattern."}, {"viet": "Chỗ loét của anh ta lại có triệu chứng phức tạp.", "eng": "His ulcer has kicked up again."}, {"viet": "Lợi tức hàng năm của nó gần 12 triệu đồng.", "eng": "His yearly income approximates to 12 million piastres."}, {"viet": "Một tình huống, cuộc đấu tranh, mưu đồ... tuyệt vọng.", "eng": "Hopeless situation, struggle, attempt, etc."}, {"viet": "Làm sao tôi có thể đến bệnh viện?", "eng": "How can I get to the hospital?"}, {"viet": "Làm sao anh biết được tôi ở đằng sau anh? Chắc chắn anh cái gì cũng nhìn thấy.", "eng": "How did you know I was behind you? You must have eyes in the back of your head."}, {"viet": "Con đường này đi tiếp tới đâu nữa?", "eng": "How far does the road continue?"}, {"viet": "Bạn sẽ đến đó bao lâu?", "eng": "How long will you be there gone?"}, {"viet": "Hoa Kỳ có bao nhiêu bang?", "eng": "How many States are there in the United States of America?"}, {"viet": "Tôi sẽ phải trả bao nhiêu tiền?", "eng": "How much shall I pay for it?"}, {"viet": "Những món nợ chồng chất đang làm suy yếu nền kinh tế của họ.", "eng": "Huge debts are debilitating their economy."}, {"viet": "Tôi muốn tóc tôi cắt giống kiểu tóc trong tấm ảnh này.", "eng": "I'd like my hair cut the same style like in this picture."}, {"viet": "Vâng, tôi phải nói là chúng tôi quan tâm đến những sản phẩm này.", "eng": "I'd say that we are interested in these products."}, {"viet": "Thưa ngài, tôi sẽ phải hỏi ngài tên và địa chỉ nhưng đó hoàn toàn chỉ là vấn đề thể thức thôi.", "eng": "I'll have to ask for your name and address, sir, but it's purely a matter of form."}, {"viet": "Ngày mai bác sẽ dẫn cháu đi chợ trời.", "eng": "I'll take you to a flea market tomorrow."}, {"viet": "Tôi lúc nào cũng bị yêu cầu chi thêm tiền mặt cho những chuyến đi chơi của trường.", "eng": "I'm always being asked to stump up extra cash for school outings."}, {"viet": "Tôi sẽ quẳng đôi giầy cũ này đi.", "eng": "I'm going to chuck out these old shoes."}, {"viet": "Tôi không phải là người nghiện rượu nhưng tôi thích thỉnh thoảng làm một li vang.", "eng": "I'm not a heavy drinker, but i like the occasional glass of wine."}, {"viet": "Dạo này tôi thật sự mê thích loại nhạc jazz.", "eng": "I'm really getting into jazz these days."}, {"viet": "Tôi tin chắc là nó nói điều đó ra chỉ vì ác ý.", "eng": "I'm sure he only said it from spite."}, {"viet": "Lúc này tôi rất kẹt tiền-tôi có thể trả anh tuần sau được không?", "eng": "I'm very pressed for cash at the moment-can I pay you next week?"}, {"viet": "Tôi được cho biết là anh đã gọi điện cho tôi sang nay.", "eng": "I've been told that you rang me up this morning."}, {"viet": "Tôi không có thì giờ chuẩn bị cho cuộc gặp gỡ này, bởi vậy tôi sẽ phải ứng tác thôi.", "eng": "I've had no time to prepare for this meeting, so I'll have to play it by ear."}, {"viet": "Tôi đã đánh cá 10 pao vào con'Black Widow'ở cuộc đua 3 giờ 45'tại Newmarket.", "eng": "I've put 10 pounds on'Black Widow'in the 3.45 at Newmarket."}, {"viet": "Tôi đồng ý với anh ở một mức nào đó.", "eng": "I agree with you to some degree."}, {"viet": "Tôi ở trong một tình thế khó khăn vì tôi vừa mất việc.", "eng": "I am in a difficult position as I have just lost my job."}, {"viet": "Tôi tới cửa hàng mới biết mình đã quên tất cả tiền ở nhà.", "eng": "I arrived at the shop only to find I'd left all my money at home."}, {"viet": "Tôi mua một tờ giấy trên đường đi học về.", "eng": "I bought a paper on the way back from school."}, {"viet": "Tôi không thể chịu đựng nổi khi nhìn thấy trẻ em khổ.", "eng": "I can't endure to seeing children suffer."}, {"viet": "Tôi không thể ngừng ăn những thanh sô cô la này, chúng ngon không cưỡng nổi.", "eng": "I can't stop eating these chocolates-they're so moreish."}, {"viet": "Tôi có thể giới thiệu món bánh rau, đó là món đặc biệt của nhà hàng.", "eng": "I can recommend the vegetable pie, it's the specialty of the house."}, {"viet": "Tôi không thể đứng đây tán gẫu suốt cả ngày.", "eng": "I can't stand here gossiping all day."}, {"viet": "Tôi có thể ngửi thấy là anh ta đã hút thuốc lá.", "eng": "I could smell that he had been smoking."}, {"viet": "Tôi muốn đưa ra một đề nghị.", "eng": "I'd like to make a suggestion."}, {"viet": "Tôi không biết cụ già kỳ quặc đó là ông của anh.", "eng": "I didn't realize that funny old geezer was your grandpa."}, {"viet": "Tôi không chấp nhận những quan điểm của bà ấy về vấn đề giải trừ vũ khí hạt nhân.", "eng": "I don't go along with her views on nuclear disarmament."}, {"viet": "Tôi không thích cái mũ này, cho tôi cái khác.", "eng": "I don't like this hat, give me another one."}, {"viet": "Tôi không muốn cái thằng cha ấy trong đội bán hàng của tôi.", "eng": "I don't want that joker in my sales team."}, {"viet": "Tôi không thích thức uống lạnh.", "eng": "I don't like cold drinks."}, {"viet": "Tôi hy vọng được bồi thường về tổn thất này.", "eng": "I expect some satisfaction for that loss."}, {"viet": "Tôi cảm thấy bị cuốn hút bởi người lạ mặt bí hiểm này.", "eng": "I felt drawn to this mysterious stranger."}, {"viet": "Tôi thấy phần cuối cuốn sách của ông ấy rất thú vị.", "eng": "I found the conclusion of his book very interesting."}, {"viet": "Tôi đã nhận hàng đống thiếp vào ngày sinh nhật của tôi.", "eng": "I got masses of cards on my birthday."}, {"viet": "Tôi quên mang theo tờ ghi chú nên phải ứng khẩu mà nói.", "eng": "I had forgotten to bring my notes and had to speak ad lib."}, {"viet": "Tôi không thích anh ta sử dụng thời gian của anh ta một cách sai lầm như vậy.", "eng": "I hate to see him misusing his time like that."}, {"viet": "Tôi có ý định hỏi ý kiến bà ta khi gặp bà ấy.", "eng": "I have it in mind to ask her advice when I see her."}, {"viet": "Tôi bị cúm hay gì đó.", "eng": "I have the flu or something."}, {"viet": "Tôi đã không gặp anh vài tuần rồi đấy.", "eng": "I haven't seen you for a couple of weeks."}, {"viet": "Tôi nghe nói bạn ở nhà vì bị cảm.", "eng": "I heard you're home with a cold."}, {"viet": "Tôi mongo là ông đã thưởng thức rượu vừa uống.", "eng": "I hope you have enjoyed your drink."}, {"viet": "Tôi biết cô ấy hơn ai hết sẽ phản ứng mạnh mẽ và tranh luận.", "eng": "I knew that she, if anyone, would rise to the bait and argue."}, {"viet": "Tôi bẩy nắp hộp ra bằng một cái gậy.", "eng": "I levered the lid of the box with a stick."}, {"viet": "Tôi sẽ trở lại vào tuần tới trước khi bạn xuất viện.", "eng": "I'll be back next week."}, {"viet": "Một phút nữa tôi sẽ gặp các anh.", "eng": "I'll join you in a minute."}, {"viet": "Tôi thích lắm, nhưng chồng tôi không ăn được.", "eng": "I love it, but my husband can't stand it."}, {"viet": "Tôi rất vui vì ông có thể đến dự.", "eng": "I'm glad you were able to come."}, {"viet": "Tôi không giỏi nhớ các niên đại lắm.", "eng": "I'm not very strong on dates."}, {"viet": "Tôi đã làm bài sai bét trong kỳ thi đó.", "eng": "I made a proper ballup of that exam."}, {"viet": "Ngày hôm nay tôi phải tập trung sức lực vào việc trang trí.", "eng": "I must concentrate my energies on decorating today."}, {"viet": "Tôi cần thêm chỗ rộng rãi hơn.", "eng": "I need some more elbow-room."}, {"viet": "Tôi vừa đến Luân Đôn hôm qua và đồng hồ sinh học của tôi vẫn còn theo giờ Niu Yooc.", "eng": "I only arrived in London yesterday and my body clock is still on New York time."}, {"viet": "Tôi đã hứa giúp chị tôi dọn nhà vào thứ bảy rồi.", "eng": "I promised to help my sister move Saturday."}, {"viet": "Tôi đã tranh luận với cô ta hằng giờ về sự nguy hiểm, nhưng cô ta không hề thay đổi ý kiến.", "eng": "I reasoned with her for hours about the danger, but she would not change her mind."}, {"viet": "Tôi xả sạch dầu gội đầu ở trên tóc tôi.", "eng": "I rinsed the shampoo out of my hair."}, {"viet": "Hình như dạo này tôi tiêu xài nhiều tiền.", "eng": "I seem to be going through a lot of money at the moment."}, {"viet": "Tôi chỉ cho anh một vài điều, sau đó anh sẽ tự mình làm.", "eng": "I show you something, thereafter you'll do it on your own."}, {"viet": "Tôi đề nghị là chúng ta hãy cho qua vấn đề này.", "eng": "I suggest we let the matter drop."}, {"viet": "Tôi nghĩ tôi sẽ dùng một thức uống lạnh thay vì cà phê.", "eng": "I think I'll have a cold drink rather than coffee."}, {"viet": "Tôi nghĩ bây giờ chuối ăn được rồi đấy.", "eng": "I think the bananas are good to eat now."}, {"viet": "Tôi cứ tưởng còn lại ít bích quy nhưng chúng nó đã ngốn sạch!", "eng": "I thought there would be some biscuits left but they've wolfed the lot!"}, {"viet": "Tôi vấp vào con chó và ngã sõng xoài.", "eng": "I tripped over the dog and fell sprawling."}, {"viet": "Tôi vừa mới đến đó mà.", "eng": "I've only this moment come in."}, {"viet": "Tôi muốn biết bạn bè của các anh là ai.", "eng": "I want to know who your friends are."}, {"viet": "Tôi đi vắng nên con tôi đứng ra tiếp khách.", "eng": "I was away so my son acted as host."}, {"viet": "Tôi nổi giận vì lời phê bình liên tục của họ.", "eng": "I was infuriated by their constant criticism."}, {"viet": "Tôi đứng ngay sát bên nàng mà nàng vẫn không nhận ra sự có mặt của tôi.", "eng": "I was standing right next to her, but she didn't even acknowledge my presence."}, {"viet": "Tôi đi bơi còn những người khác chơi quần vợt.", "eng": "I went swimming while the others played tennis."}, {"viet": "Tôi muốn sửa chữa lời khai sai trước đây của tôi.", "eng": "I wish to correct my earlier misstatement."}, {"viet": "Tôi tự hỏi liệu tôi sẽ được tăng lương năm nay chăng.", "eng": "I wonder whether I'll get a raise this year."}, {"viet": "Tôi muốn đổi một số đồng yên Nhật ra đô la.", "eng": "I would like to exchange some yen into dollars."}, {"viet": "Tôi không muốn nghĩ rằng cơ thể con người có thể được kiểm soát bởi công nghệ về gen.", "eng": "I wouldn't like to think human bodies could be controlled by genetic engineering."}, {"viet": "Nếu như nó làm sai thì đó chỉ là vì ngu dốt mà thôi.", "eng": "If he did wrong it was only through ignorance."}, {"viet": "Nếu nó đưa ra một tình huống luân lý phức tạp thì nó hẳn là còn hay hơn nữa.", "eng": "If it posits a complex moral situation, it ought to be even better."}, {"viet": "Nếu sự đau khổ này là hậu quả của tình yêu thì, lạy Chúa, tôi chẳng hề biết tình yêu là gì cả.", "eng": "If these megrims are the effect of Love, thank Heaven, I never knew what it was."}, {"viet": "Nếu anh là hội viên thì bắt buộc phải đi họp.", "eng": "If you are a member, attendance at the meeting is obligatory."}, {"viet": "Nếu anh không làm việc siêng năng anh sẽ thất bại.", "eng": "If you don't work hard, you may fail."}, {"viet": "Nếu bạn nhớ ra bất cứ một tí gì, hãy cho chúng tôi biết.", "eng": "If you remember anything at all, please let us know."}, {"viet": "Làm ngơ trước những lời đả kích của phe đối lập.", "eng": "Ignoring the taunts of the opposition."}, {"viet": "Ở Anh một người bị tố cáo vẫn được cho là vô tội cho đến khi người ta chứng minh được là anh ta phạm tội.", "eng": "In Britain an accused man is presumed innocent until he is proved guilty."}, {"viet": "Ở các xứ nóng, anh có thể ngủ được ngoài trời.", "eng": "In hot countries you can sleep outdoors."}, {"viet": "Trong một vài mốt hiện đại, chúng ta có thể thấy bóng dáng của những năm 1930.", "eng": "In some modern fashions we can see shades of the 1930's."}, {"viet": "Thời gian sẽ cho anh thấy là tôi thành thực.", "eng": "In the long run you'll see that I am sincere."}, {"viet": "Vào mùa đông và mùa xuân, những người đi cắm trại bị quyến rũ bởi bầu trời trong vắt và những tảng đá nhiều màu chói chang của Arizona, Colorado và New Mexico.", "eng": "In winter and in spring, campers are tempted by the clear skies and dazzling multi-coloured rocks of Arizona, Colorado and New Mexico."}, {"viet": "Người vợ có phải chịu trách nhiệm pháp lý đối với những món nợ của chồng không?", "eng": "Is a wife liable for her husband's debts?"}, {"viet": "Có phải đó là các tổng số của cái họ đã dạy anh không?", "eng": "Is that the sum total of what they've taught you?"}, {"viet": "Lời tuyên bố này phải chăng là dấu hiệu tình hình sẽ tốt đẹp hơn?", "eng": "Is this announcement the signal of better times ahead?"}, {"viet": "Thật là một vinh dự lớn lao được chào đón ông và các bạn người Mỹ có mặt ở đây tối nay.", "eng": "It's a great privilege to be able to welcome you and the American friends present here this evening."}, {"viet": "Việc đã qua rồi, dù tốt hay xấu bây giờ chúng ta cũng không thay đổi được nữa.", "eng": "It's been done, and, for better or worse, we can't change it now."}, {"viet": "Người già khó có thể thay đổi được lề thói của họ.", "eng": "It's hard for old people to change their ways."}, {"viet": "Thật là vô ích, xe không khởi động được-chúng ta phải đi bộ thôi.", "eng": "It's no use, the car won't start-we'll have to leg it."}, {"viet": "Bây giờ mới nói xin lỗi là quá muộn-tai hại thì đã xảy ra rồi.", "eng": "It's rather late in the day to say you're sorry-the harm's done now."}, {"viet": "Bob có đặc điểm là biệt tăm đúng vào lúc có việc cần làm!", "eng": "It's typical of Bob to do a disappearing act just when there's work to be done!"}, {"viet": "Anh mà cứ theo dõi tôi suốt như thế thì tôi không thể làm tốt được.", "eng": "It cramps my style to have you watching over me all the time."}, {"viet": "Đi xe đạp ban đêm không có đèn là một hành động phạm pháp.", "eng": "It is an offence to ride a bicycle at night without lights."}, {"viet": "Nôn nóng cũng vô ích, một giờ nữa cơm mới được.", "eng": "It is no use getting impatient, dinner won't be ready for another hour."}, {"viet": "Nó sẽ làm cho cháu cảm thấy khá hơn.", "eng": "It'll make you feel better."}, {"viet": "Rất hân hạnh được gặp ông, ông Lý.", "eng": "It's a pleasure to meet you, Mr. Li."}, {"viet": "Anh biết đấy, đó là biểu tượng của thành phố.", "eng": "It's the symbol of the city, you know."}, {"viet": "Tôi phải mất một tiếng đồng hồ để đi từ đây đến đó rồi quay về.", "eng": "It takes me an hour to walk there and back."}, {"viet": "Đó là thời gian thuận lợi cho sự gặp gỡ giữa các nguyên thủ quốc gia.", "eng": "It was an auspicious moment for a meeting between the heads of state."}, {"viet": "Chẳng bao lâu bi kịch lại giáng xuống lần nữa.", "eng": "It was not long before tragedy struck again."}, {"viet": "Mãi sau này chúng tôi mới nhận ra rằng cô ấy đi rồi.", "eng": "It wasn't until later on that we realized she had gone."}, {"viet": "Cái vẻ ngoài của nó không được hấp dẫn lắm.", "eng": "Its appearance is not very prepossessing."}, {"viet": "John và Liz chia nhau tiền giải thưởng-John dùng nửa của mình để mua một máy tính xử lý văn bản.", "eng": "John and Liz shared the prize money between them-John used his half to buy a word processor."}, {"viet": "Dù sao cũng có một phần sự thật trong điều cô ta nói.", "eng": "Just the same, there's some truth in what she says."}, {"viet": "Cười rất tốt cho sức khoẻ của bố đấy.", "eng": "Laughing is good for your health."}, {"viet": "Chúng ta hãy cho ông ấy một tràng phào tay đi.", "eng": "Let's give him a hand."}, {"viet": "Những kẻ bất lương sẽ bị truy lùng và trừng trị.", "eng": "Malefactors will be pursued and punished."}, {"viet": "Nhiều cây ngủ qua suốt mùa đông.", "eng": "Many plants lie dormant throughout the winter."}, {"viet": "Chim sáo cặp đôi với nhau sẽ bảo vệ khu vực của chúng chống lại những kẻ đột nhập.", "eng": "Mating blackbirds will defend their territory against intruders."}, {"viet": "Chúng tôi xin chúc quý khách có một chuyến bay thú vị.", "eng": "May we wish you a pleasant flight."}, {"viet": "Hầu hết ngoại tệ đều dựa vào hệ thống thập phân.", "eng": "Most foreign currencies are based on decimal currency system."}, {"viet": "Ông X thế chân thầy giáo đang ở bệnh viện.", "eng": "Mr. X substituted the teacher who was in the hospital."}, {"viet": "Xe tôi mất còi tôi phải sửa lại phanh.", "eng": "My car failed its MOT-I had to get the brakes fixed."}, {"viet": "Vườn của tôi thông với vườn nhà bên cạnh qua một cái cổng.", "eng": "My garden communicates with the one next door by means of a gate."}, {"viet": "Ông già tôi muốn tôi trở thành kỹ sư như ông ấy.", "eng": "My old man wants me to be an engineer, like him."}, {"viet": "Vợ của tôi và tôi bị tách riêng.", "eng": "My wife and I are separated."}, {"viet": "Tin về cái chết của ông ta đã được đánh điện cho gia đình ông ta biết.", "eng": "News of his death was cable to his family."}, {"viet": "Không, cái tên đó chẳng gợi cho tôi ý niệm một chút gì.", "eng": "No, the name doesn't convey anything to me."}, {"viet": "Không ai ở gần nơi xảy ra tội ác là không bị nghi ngờ.", "eng": "Nobody who was near the scene of the crime is above suspicion."}, {"viet": "Ngày nay hầu hết các nhà được thắp sáng bằng đèn điện.", "eng": "Nowadays, houses are mostly lit by electricity."}, {"viet": "Ồ tôi có cần giữ bản ghi nhớ đổi tiền không?", "eng": "Oh, need to keep the exchange memo?"}, {"viet": "Khi bố cô ta mất, cô đã sở hữu một gia tài to lớn.", "eng": "On her father's death, she came into possession of a vast fortune."}, {"viet": "Một tờ xanh đôla hiện nay được khoảng 2400 đồng peso Mêhicô.", "eng": "One greenback will get you about 2400 adobe dollars these days."}, {"viet": "Chỉ những cầu thủ xuất sắc nhất mới được lựa chọn để chơi trong trận đó.", "eng": "Only the best players were picked to play in the match."}, {"viet": "Những quan hệ thương mại rộng rãi của chúng tôi tới khắp thế giới.", "eng": "Our far flung trade connections cover the world."}, {"viet": "Tờ báo của chúng tôi đại diện cho tiếng nói của nhân dân.", "eng": "Our newspaper represents the voice of the people."}, {"viet": "Thằng con trai út của chúng tôi học hành khá ở trường.", "eng": "Our youngest son is getting on well at school."}, {"viet": "Các hành khách hoãn chỗ đặt trước sẽ bị mất tiền đặt cọc.", "eng": "Passengers who cancel their reservations will forfeit their deposit."}, {"viet": "Người ta đang ùn ùn ra khỏi ga.", "eng": "People were streaming out of the station."}, {"viet": "Xin dạy cho cháu cách nấu món ăn Mỹ.", "eng": "Please teach me how to cook American food."}, {"viet": "Những con ma thật sống trong ngôi nhà có ma này đấy.", "eng": "Real ghosts live in this haunted house."}, {"viet": "Ở nước đó cảnh sát mật nhan nhản.", "eng": "Secret police agents abounded in that country."}, {"viet": "Giá cổ phần được giữ vững vì người ta hy vọng rằng tình trạng suy thoái sẽ chấm dứt.", "eng": "Share prices were buoyed up by hopes of an end to the recession."}, {"viet": "Cô ta lúc nào cũng nịnh nọt lấy lòng thầy giáo của mình.", "eng": "She's always sucking up to her teacher."}, {"viet": "Bà ta chuyển sang hút thuốc lá nhẹ hơn.", "eng": "She's gone over a milder brand of cigarettes."}, {"viet": "Cô ta nổi tiếng về thái độ ngông cuồng của cô ta.", "eng": "She's notorious for her wild behaviour."}, {"viet": "Bà ta rất năng động, xét theo tuổi của bà.", "eng": "She's very active, considering her age."}, {"viet": "Cô dè dặt bước tới cạnh giường anh ta.", "eng": "She approached his bedside with unassured steps."}, {"viet": "Bà ta không tìm được cách giải quyết những khó khăn về tài chính.", "eng": "She can find no solution to her financial troubles."}, {"viet": "Nàng không thể nào làm dịu nỗi lo của nàng.", "eng": "She couldn't still her anxiety."}, {"viet": "Bà ấy thuyết trình rất dài về mối quan hệ giữa tội ác và môi trường.", "eng": "She discoursed at length on the relationship between crime and environment."}, {"viet": "Cô ta ngã từ thang xuống và gãy cánh tay.", "eng": "She fell off a ladder and broke her arm."}, {"viet": "Bà ta đã khiển trách tôi vì đến muộn.", "eng": "She gave me a row for being late."}, {"viet": "Cô ấy luôn luôn ốm đau.", "eng": "She had always been cursed with ill health."}, {"viet": "Trong tính cách cô ta có sắc thái ranh mãnh.", "eng": "She has a spice of malice in her character."}, {"viet": "Cô ta có những tình cảm mạnh mẽ đối với chủ đề này.", "eng": "She has very strong feelings on this subject."}, {"viet": "Cô ta đang dự tính một chuyến đi thăm London.", "eng": "She is contemplating a visit to London."}, {"viet": "Cô ta giật mạnh sợi dây thừng nhưng nó không nhúc nhích.", "eng": "She jerked the rope but it wouldn't move."}, {"viet": "Cô ấy sống trong một thế giới tưởng tượng nếu cô ấy nghĩ có thể vào đại học mà không cần học hành chăm chỉ.", "eng": "She lives in a world of make-believe if she thinks she can get to college without working hard."}, {"viet": "Cô ấy dè sẻn món tiền sinh viên đi vay để kéo dài đến cuối năm.", "eng": "She managed to eke out her student loan till the end of the year."}, {"viet": "Chị ấy nên trông nom lũ con tốt hơn một chút.", "eng": "She ought to look after children a bit better."}, {"viet": "Cô ta đã thoái thác anh ta, lấy cớ rằng cô ta có quá nhiều việc phải làm.", "eng": "She put him off with the excuse that she had too much work to do."}, {"viet": "Cô ta giống người chị như tạc.", "eng": "She's a carbon copy of her sister."}, {"viet": "Cô ta chỉ giả bộ thôi.", "eng": "She's just putting on an act."}, {"viet": "Cô ấy cất giấu riêng phần lớn tiền lãi trong kinh doanh.", "eng": "She salted away most of the profit from the business."}, {"viet": "Lẽ ra bà ta phải biết rõ hơn là không nên lấy cái ô chọc con vật.", "eng": "She should know better than to poke the animal with her umbrella."}, {"viet": "Cô ấy mất cả buổi chiều nhổ cỏ trong vườn.", "eng": "She spent the afternoon pulling weeds in the garden."}, {"viet": "Cô ta xốc cái ba lô lên lưng.", "eng": "She swung the rucksack onto her back."}, {"viet": "Nàng cố giữ cho thanh danh của nàng khỏi bị bôi nhọ.", "eng": "She tried to keep her reputation free from slur."}, {"viet": "Cô ta muốn mua trực tiếp từ người sản xuất và cắt bỏ người trung chuyển.", "eng": "She wants to buy direct from the manufacturer and cut out the middleman."}, {"viet": "Cô ta đính hôn với ngài quận công.", "eng": "She was betrothed to the duke."}, {"viet": "Cô ta bỗng khó chịu nhận thấy làm vợ ông ta cuộc đời sẽ là thế nào.", "eng": "She was given an unpleasant insight into what life would be like as his wife."}, {"viet": "Cô ta là một trong những người điềm tĩnh không bao giờ lộ vẻ tức giận hoặc bối rối.", "eng": "She was one of those imperturbable people who never get angry or upset."}, {"viet": "Cô ta vẫn còn mặc quần áo lao động.", "eng": "She was still dressed in her working clothes."}, {"viet": "Cô ta không tức giận thật đâu, cô ta chỉ làm ra bộ thế thôi.", "eng": "She wasn't angry really, she was only putting it on."}, {"viet": "Bà ta sẽ không cho trẻ con vào ( trong nhà ) cho đến khi chúng chùi sạch giày.", "eng": "She won't allow the children in ( to the house ) until they've wiped their shoes."}, {"viet": "Bà ta đã viết một cuốn sách công kích xã hội thối nát của chúng ta.", "eng": "She wrote a book declaiming against our corrupt society."}, {"viet": "Tỏ ra tàn nhẫn xem thường tình cảm của người khác.", "eng": "Show ruthless disregard for other people's feelings."}, {"viet": "Vì lỡ xe buýt, chúng tôi phải đi bộ về nhà.", "eng": "Since we have missed the bus, we must walk home."}, {"viet": "Làm việc bớt đi chút, nếu không chỉ tổ làm bạn ốm đấy.", "eng": "Slow up a bit, or you'll make yourself ill."}, {"viet": "Cho đến nay công việc dễ dàng nhưng tình hình có thể sẽ thay đổi.", "eng": "So far the work has been easy but things may change."}, {"viet": "Bọn lính giết người và cướp của bất kỳ nơi nào chúng đến.", "eng": "Soldiers killing and looting wherever they went."}, {"viet": "Một số quan điểm của bà ta có phần thiên về Chủ nghĩa Xã hội.", "eng": "Some of her views are rather socialistic."}, {"viet": "Một vài dấu hiệu tiến bộ trong công việc của cô ta.", "eng": "Some signs of improvement in her work."}, {"viet": "Đôi khi mẹ gặp những người kém may mắn.", "eng": "Sometimes I see very unfortunate people."}, {"viet": "Các chuyên gia có thể phân tích một tình thế và đưa ra những giải pháp.", "eng": "Specialists may analyse a situation and suggest solutions."}, {"viet": "Khoan đã! Tôi thấy cái gì thế này?", "eng": "Stay! What is this I see?"}, {"viet": "Đừng có trêu tôi! Hãy cho tôi biết tôi có được việc làm đó hay không!", "eng": "Stop messing me about! Tell me if I've got the job or not!"}, {"viet": "Nghiên cứu tất cả tài liệu có liên quan đến một vụ án.", "eng": "Study all the documents in a case."}, {"viet": "Đột nhiên, giữa những tiếng kêu khóc, tôi nghe thấy một vài lời.", "eng": "Suddenly, amid the cries, I heard some words."}, {"viet": "Các dụng cụ, sự điều trị, kỹ năng phẫu thuật.", "eng": "Surgical instruments, treatment, skills."}, {"viet": "Đừng chú ý đến lời hăm dọa của hắn-toàn là hùng hổ bề ngoài thôi.", "eng": "Take no notice of his threats-they're sheer bravado."}, {"viet": "Dạy học sinh loại bỏ những từ ngữ thô tục ra khỏi bài viết.", "eng": "Teaching students to rid their writing of barbarisms."}, {"viet": "Terry đã làm tình được với cô Sharon ở ghế sau trong xe ô-tô của anh ta.", "eng": "Terry made it with Sharon on the back seat of his car."}, {"viet": "Đó đúng là số máy của chúng tôi, nhưng không có ông Wilson.", "eng": "That's our number all right, but no Mr. Wilson lives here."}, {"viet": "Quyết định ấy sẽ không được công nhân tán thành.", "eng": "That decision won't go down well on the factory floor."}, {"viet": "Ông sẽ trả 150 đô la một đêm.", "eng": "That'll run you $ 150 a night."}, {"viet": "Đó là một thành phố rất đẹp.", "eng": "That's a very nice city."}, {"viet": "Đúng là một lượt chơi hay: 86 rồi mà chưa bị ra sân.", "eng": "That was a good knock: 86 not out."}, {"viet": "Tai nạn đã làm cho cô ta bị liệt từ hông trở xuống.", "eng": "The accident left her paralysed from the waist down."}, {"viet": "Những thuận lợi của việc vừa học vừa chơi.", "eng": "The advantages of learning through play."}, {"viet": "Tín hiệu tương tự của giọng nói con người đã được số hoá.", "eng": "The analogue signal of the human voice has to be digitized."}, {"viet": "Những sơ đồ của kiến trúc sư cho rạp hát mới.", "eng": "The architect's plan for the new theatre."}, {"viet": "Nhà họa sĩ đã xếp đặt cẩn thận tư thế của người mẫu.", "eng": "The artist posed his model carefully."}, {"viet": "Ngọn gió thu đã làm cho lá chất đống xẹp xuống.", "eng": "The autumnal breeze caused the heaped up leaves to unpile."}, {"viet": "Quả bóng sượt qua cọc phải của anh ta.", "eng": "The ball narrowly shaved his off stump."}, {"viet": "Sàn nhà tắm ngập đầy nước.", "eng": "The bathroom floor was swimming with water."}, {"viet": "Việc đặt giá được sự ủng hộ của các giám đốc.", "eng": "The bid has the backing of the directors."}, {"viet": "Khoảng không màu xanh chúng ta gọi là bầu trời.", "eng": "The blue void we call the sky."}, {"viet": "Quyển sách đó không còn ấn hành nữa và khó mà kiếm ra được.", "eng": "The book is out of print and difficult to procure."}, {"viet": "Cậu bé đi theo cha ra khỏi phòng.", "eng": "The boy followed his father out of the room."}, {"viet": "Kề bên cái chết, bên miệng hố chiến tranh, gần kề tai hoạ, thành công.", "eng": "The brink of death, war, disaster, success."}, {"viet": "Xe buýt có thể đến sớm, vì vậy chúng ta tốt hơn cả nên đi lúc này cho chắc ăn.", "eng": "The bus might be early, so we'd better play safe and leave now."}, {"viet": "Người đội trưởng phản đối về ánh sáng.", "eng": "The captain appealed against the light."}, {"viet": "Ô tô trượt trên một vũng dầu và đâm vào hàng rào.", "eng": "The car skidded on the pool of oil and ran into the fence."}, {"viet": "Con mèo quan sát kỹ mọi chuyển động của chú chuột.", "eng": "The cat followed the mouse's movements carefully."}, {"viet": "Nhà vô địch dẫn đầu với khoảng cách mười tám giây.", "eng": "The champion is leading by eighteen seconds."}, {"viet": "Đứa trẻ ấy chưa bao giờ cảm thấy được đối xử tử tế.", "eng": "The child had never experienced kindness."}, {"viet": "Bọn trẻ đang vui đùa như để xả hơi ngoài vườn.", "eng": "The children are letting off Steam in the garden."}, {"viet": "Bọn trẻ há hốc mồm xem buổi trình diễn.", "eng": "The children took in the spectacle open-mouthed."}, {"viet": "Thuốc lá làm cháy thủng một lỗ ở tấm thảm.", "eng": "The cigarette burnt a hole in the carpet."}, {"viet": "Đồng hồ chỉ hai giờ rưỡi.", "eng": "The clock shows half past two."}, {"viet": "Nhóm tranh luận ở trường cao đẳng đã là xuất phát điểm tự nhiên cho sự nghiệp của bà ta trên chính trường.", "eng": "The college debating society was a natural springboard for her career in politics."}, {"viet": "Công ty đang vận động đẩy mạnh xuất khẩu.", "eng": "The company's gearing up for the big export drive."}, {"viet": "Việc so sánh quả tim với một cái bơm.", "eng": "The comparison of the heart to a pump."}, {"viet": "Tòa lãnh sự đã được nâng cấp lên hàng tòa đại sứ.", "eng": "The consulate was upgraded to embassy status."}, {"viet": "Hội đồng nhiều khi bị kết tội là có những quan điểm cực đoan.", "eng": "The council was often accused of extremism."}, {"viet": "Tòa án đã nhận được một bản đệ trình từ nhóm luật sư biện hộ.", "eng": "The court has received a submission from the defense lawyers."}, {"viet": "Đám đông tan tác ( theo mọi ngả ).", "eng": "The crowd dispersed ( in all directions )."}, {"viet": "Khách hàng được yêu cầu điền một tờ đơn xin phép trước khi mở một tài khoản.", "eng": "The customers are required to fill out an application form before opening an account."}, {"viet": "Con nợ đó bị gọi trình diện trước các quan tòa.", "eng": "The debtor was summoned to appear before the magistrates."}, {"viet": "Vị lãnh tụ bị truất phế đã được phục hồi quyền lực.", "eng": "The deposed chief was restored to power."}, {"viet": "Ngài Tổng giám đốc và vị phó của ông ta.", "eng": "The Director General and his deputy."}, {"viet": "Đáp lại cú điện thoại của tôi, bác sĩ đến ngay tức thời.", "eng": "The doctor came at once in answer to my phone call."}, {"viet": "Con chó cắn sâu vào cánh tay anh ta.", "eng": "The dog bit deeply into his arm."}, {"viet": "Cửa phải làm ngang với tường.", "eng": "The door should be flush with the wall."}, {"viet": "Thùng rác là nơi duy nhất dành cho hầu hết quần áo này.", "eng": "The dustbin is the only place for most of these clothes."}, {"viet": "Kết quả cuộc bầu cử truyền đến liên tục suốt đêm.", "eng": "The election results flowed in throughout the night."}, {"viet": "Đội Anh bị thua ba một.", "eng": "The English team was defeated by three goals to one."}, {"viet": "Bài thi dễ như trở bàn tay.", "eng": "The exam paper was a piece of cake."}, {"viet": "Vải này phải làm để nó không thấm nước.", "eng": "The fabric has been treated to make it waterproof."}, {"viet": "Cự ly dài nhất mà tôi đã chạy là mười dặm.", "eng": "The farthest distance I've run is ten miles."}, {"viet": "Phim tuột khỏi cuộn và quấn quanh máy chiếu.", "eng": "The film flew off the spool and wound itself round the projector."}, {"viet": "Những nhân viên cứu hoả xịt vòi rồng vào ngôi nhà đang cháy.", "eng": "The firemen played their hoses on the burning building."}, {"viet": "Bài rao giảng thứ nhất lấy từ Kinh Phúc âm của Thánh Giôn.", "eng": "The first lesson is taken from St John's Gospel."}, {"viet": "Những bông hoa tạo nên một khối màu sắc nổi bật trên bức tường đá.", "eng": "The flowers made a mass of colour against the stone wall."}, {"viet": "Con cáo đào đường ngầm dưới hàng rào để mò vào chỗ gà.", "eng": "The fox burrowed under the fence to reach the chickens."}, {"viet": "Bọn cướp bất thần tấn công một bà già trong đường xe điện ngầm.", "eng": "The gang jumped an old woman in the subway."}, {"viet": "Sự đung đưa nhè nhẹ của con thuyền làm tôi thấy buồn ngủ.", "eng": "The gentle motion of the ship made me feel sleepy."}, {"viet": "Con khỉ đột đó có một cái trán trông nặng nề.", "eng": "The gorilla had a massive forehead."}, {"viet": "Chính phủ đã giảm kinh phí công cộng.", "eng": "The government has reduced public spending."}, {"viet": "Chính phủ muốn ngăn không cho những người tị nạn vào.", "eng": "The government wants to shut the refugees out."}, {"viet": "Đảng Xanh hy vọng đề cử được một số ứng cử viên cho cuộc tổng tuyển cử.", "eng": "The Green Party hopes to put up a number of candidates in the General Election."}, {"viet": "Khách khứa xúm xít quanh các bàn bày thức ăn.", "eng": "The guests swarmed round the tables where the food was set out."}, {"viet": "Hệ thống sưởi ấm mới đây đã được chỉnh lại để làm cho nó hiệu quả hơn.", "eng": "The heating system has recently been modified to make it more efficient."}, {"viet": "Con ngựa phát hoảng lồng lên khi nghe tiếng súng.", "eng": "The horse bolted in terror at the sound of the gun."}, {"viet": "Tình trạng chung của ngôi nhà là tốt mặc dù nó cần phải sơn lại.", "eng": "The house's general condition is good although it needs painting."}, {"viet": "Bức tranh tường khổng lồ đã được một nhà thiết kế Ý nổi tiếng thực hiện.", "eng": "The huge mural was executed by a noted Italian designer."}, {"viet": "Việc huấn luyện tại chức các giáo viên.", "eng": "The in-service training of teachers."}, {"viet": "Ngòi của con côn trùng đâm xuyên qua lớp da ngoài.", "eng": "The insect's sting penetrates the surface of the skin."}, {"viet": "Vấn đề được giải quyết bằng cách giơ tay biểu quyết.", "eng": "The issue was decided by a show of hands."}, {"viet": "Ông chánh án sẽ xét xử vụ đó vào ngày mai.", "eng": "The judges will decide the case tomorrow."}, {"viet": "Đảng Lao Động sẽ nỗ lực hết sức để giành phần thắng trong cuộc bầu cử.", "eng": "The Labour party are going all out to win the election."}, {"viet": "Việc tung một kiểu xe ôtô du lịch mới của họ đã được báo chí tường thuật nhiều.", "eng": "The launch of their new saloon received much media coverage."}, {"viet": "Lá thư được gửi đi không có tem.", "eng": "The letter had been posted without a stamp."}, {"viet": "Con sư tử lén theo con mồi của nó qua vùng cỏ rậm.", "eng": "The lion stalked its prey through the long grass."}, {"viet": "Tình yêu đồng tiền là cội nguồn của mọi thói xấu.", "eng": "The love of money is the root of all evil."}, {"viet": "Đa số học sinh lớp chúng tôi có mắt màu nâu, chỉ có hai em là mắt màu xanh.", "eng": "The majority of children in our class have brown eyes, only two have blue eyes."}, {"viet": "Ý thức kì diệu về phương hướng của chim di cư.", "eng": "The marvelous directional sense of migrating birds."}, {"viet": "Cuộc họp kết thúc lúc 8 giờ.", "eng": "The meeting concluded at 8, 00."}, {"viet": "Sữa phải được lọc, để nguội và đưa ngay tới trại bơ sữa.", "eng": "The milk must be strained, cooled, and rushed to a dairy."}, {"viet": "Chuột chũi đào xới lối đi của nó dưới mặt đất.", "eng": "The mole bored its way underground."}, {"viet": "Người mẹ đu đưa nôi ru đứa bé ngủ.", "eng": "The mother rocked the baby to sleep in its cradle."}, {"viet": "Việc thờ cúng thiên nhiên bí hiểm của những dân tộc cổ xưa này.", "eng": "The mysterious nature-worship cults of these ancient peoples."}, {"viet": "Chiếc xe ôtô mới là niềm tự hào của toàn gia đình.", "eng": "The new car was the pride of the whole family."}, {"viet": "Vở kịch mới là một ý đồ rất hay.", "eng": "The new play is a brilliant conception."}, {"viet": "Tin tức đó loan nhanh đi khắp trong làng.", "eng": "The news quickly went the round of the village."}, {"viet": "Bắc cực trong những tháng này có đêm liên tục.", "eng": "The North Pole in those months has continuous night."}, {"viet": "Đài khí tượng thông báo thời tiết hàng ngày.", "eng": "The observatory issues the daily weather forecast."}, {"viet": "Bà cụ ấy rất dễ bị lẫn.", "eng": "The old lady easily gets confused."}, {"viet": "Phần mở đầu của một cuốn sách, bài diễn văn, bộ phim, v. v.", "eng": "The opening of a book, speech, film, etc."}, {"viet": "Những người chủ ra lệnh đóng cửa nhà máy.", "eng": "The owners directed that the factory be closed."}, {"viet": "Đảng này đang hy vọng giành thắng lợi trong cuộc tranh cử sắp tới.", "eng": "The party is hoping for victory in the next election."}, {"viet": "Đội tuần tra bị bọn cướp chặn đường.", "eng": "The patrol was waylaid by bandits."}, {"viet": "Sự xuyên tạc chứng cớ cho phù hợp với lợi ích của kẻ quyền thế.", "eng": "The perversion of the evidence to suit powerful interests."}, {"viet": "Viên phi công đã ghi được trên 200 giờ bay.", "eng": "The pilot had logged over 200 hours in the air."}, {"viet": "Chiếc máy bay chạy chậm chạp vào nhà chứa máy bay.", "eng": "The plane nosed into the hangar."}, {"viet": "Các cầu thủ biểu lộ sự hăng hái trong cuộc thi.", "eng": "The players showed much zeal during the tournament."}, {"viet": "Cảnh sát đụng độ với đám đông giận dữ.", "eng": "The police clashes with the angry crowd."}, {"viet": "Cảnh sát đã báo cáo rằng đứa bé bị giết chết đã không bị hiếp dâm.", "eng": "The police reported that the murdered child had not been interfered with."}, {"viet": "Anh chàng tội nghiệp ấy là kẻ lố bịch đáng buồn.", "eng": "The poor fellow was a sad spectacle."}, {"viet": "Quyền làm luật được trao cho Quốc hội.", "eng": "The powers to make laws is vested in Parliament."}, {"viet": "Tổng thống long trọng hứa không bao giờ nhượng bộ bọn khủng bố.", "eng": "The President pledged never to make concession to terrorists."}, {"viet": "Bà Thủ tướng đã chỉ định vài bộ trưởng mới để làm cho chính phủ của mình mạnh thêm lên.", "eng": "The Prime Minister appointed some new ministers to ginger up her administration."}, {"viet": "Vấn đề này đã làm tôi băn khoăn mấy tuần nay.", "eng": "The problem has been bothering me for weeks."}, {"viet": "Người sửa bản in thử đã thay đổi một từ nhưng tôi đã giữ nó nguyên như cũ.", "eng": "The proof-reader had changed a word but I stetted it."}, {"viet": "Các học sinh viết một bài đánh giá về vở kịch mà các em đã xem.", "eng": "The pupils wrote an appreciation of the play that they had just seen."}, {"viet": "Cuộc đua mở rộng cho mọi đối tượng tham dự.", "eng": "The race is open to all comers."}, {"viet": "Lý do tại sao tôi đến muộn là vì tôi bị nhỡ xe buýt.", "eng": "The reason why I'm late is that I missed the bus."}, {"viet": "Tiền thuê nhà là 300 bảng Anh mỗi tháng.", "eng": "The rent is £ 300 per calendar month."}, {"viet": "Lợi nhuận đó là do cắt giảm nhân viên và tăng doanh số bán.", "eng": "The resultant profit from reducing staff and increasing sales."}, {"viet": "Con sông này nguy hiểm cho những tay bơi lội.", "eng": "The river is dangerous for swimmers."}, {"viet": "Người La Mã hy vọng khai hoá cho tất cả các bộ lạc của Châu Âu cổ.", "eng": "The Romans hoped to civilize al the tribes of ancient Europe."}, {"viet": "Tin đồn lan dần ra khắp công ty.", "eng": "The rumour percolated through the firm."}, {"viet": "Quy mô của tấm thảm kịch dần dần được mọi người thấm thía.", "eng": "The scale of the tragedy gradually sank in."}, {"viet": "Cái cổ gầy gò của con gà tây.", "eng": "The scrawny neck of a turkey."}, {"viet": "Tác phẩm kế tiếp nối đúng chỗ tác phẩm trước ngưng.", "eng": "The sequel takes up right where the prequel left off."}, {"viet": "Con tàu va chạm ken két vào bờ cầu tàu.", "eng": "The ship jarred against the quayside."}, {"viet": "Vào giờ này trong ngày, hàng triệu công nhân từ các cửa hàng và cơ quan đổ ra đường phố.", "eng": "The shops and offices pour millions of workers into the street at this time of day."}, {"viet": "Địa điểm này đang được một công ty bất động sản ở London khai thác.", "eng": "The site is being developed by a London property company."}, {"viet": "Con rắn cuốn mình quanh cành cây.", "eng": "The snake coiled round the branch."}, {"viet": "Bồ hóng và bụi than của một thành phố công nghiệp lớn.", "eng": "The soot and grime of a big manufacturing town."}, {"viet": "Đồng hồ vận tốc đang chỉ 95 dặm một giờ.", "eng": "The speedometer was indicating 95 mph."}, {"viet": "Nước cứ chảy long tong từ cái thùng bị rò.", "eng": "The steady drip of water from a leaky barrel."}, {"viet": "Các đường phố nhanh chóng vắng người khi trời bắt đầu đổ mưa.", "eng": "The streets soon emptied of people when the rain started."}, {"viet": "Những nỗi đau khổ của những người tị nạn đang chết đói.", "eng": "The sufferings of the starving refugees."}, {"viet": "Cái bàn bị đẩy dọc qua cửa.", "eng": "The table was pushed endways through the door."}, {"viet": "Thầy giáo đang tán dương bài làm của cô ấy lên tận mây xanh.", "eng": "The teacher was extolling her work to the skies."}, {"viet": "Tên khủng bố dự định đánh bom sân bay.", "eng": "The terrorist planned to bomb the airport."}, {"viet": "Ba ngôi của tam vị nhất thể cùng là bản chất.", "eng": "The three persons of the Trinity are consubstantial."}, {"viet": "Toà thị chính được trưng dụng làm tổng hành dinh của quân đội.", "eng": "The town hall was requisitioned as army headquarters."}, {"viet": "Người thủ quỹ đã cuỗm tiền quỹ của câu lạc bộ rồi bỏ trốn.", "eng": "The treasurer has run off with the club's funds."}, {"viet": "Hai nước đã bước vào liên minh phòng thủ.", "eng": "The two countries entered into a defensive alliance."}, {"viet": "Người đóng thay đã được đưa ra thay thế khi diễn viên chính ốm.", "eng": "The understudy was substituted when the leading actor fell ill."}, {"viet": "Những bản chuyển thể khác nhau tác phẩm của Shakespeare.", "eng": "The various readings of a line in Shakespeare."}, {"viet": "Chỗ thắt lại của một đồng hồ cát, eo đàn viôlông, eo con ong bắp cày.", "eng": "The waist of an hourglass, a violin, a wasp."}, {"viet": "Thời tiết xen lẫn mưa và nắng.", "eng": "The weather alternated between rain and sunshine."}, {"viet": "Như tuồng tất cả thiên hạ đều có mặt ở cuộc liên hoan.", "eng": "The whole world seemed to be at the party."}, {"viet": "Chiếc xe bò bằng gỗ cót két lăn đi.", "eng": "The wooden cart creaked as it moved along."}, {"viet": "Chữ khắc trên đá rất mờ.", "eng": "The writing on the stone was very faint."}, {"viet": "Huấn luyện sơ bộ làm cho họ biết tuân thủ mệnh lệnh.", "eng": "Their early training programs them to be obedient and submissive."}, {"viet": "Những ấn phẩm của họ là nghiệp dư, không được nghiên cứu một cách đầy đủ.", "eng": "Their publications were amateurish and inadequately researched."}, {"viet": "Thế là phía Nam bán cầu được chiếu sáng hơn.", "eng": "Then the southern hemisphere gets more sunlight."}, {"viet": "Có một chỉ tiêu sản xuất mà mỗi công nhân không được đạt thấp hơn.", "eng": "There's a production norm below which each worker must not fall."}, {"viet": "Cơ quan hôm nay không có ai làm việc.", "eng": "There's nobody to staff the office today."}, {"viet": "Cũng có những chỗ cắm trại bên bờ biển, ẩn mình khỏi bãi tắm bởi một dãy những đụn cát, hay một rặng cây dày.", "eng": "There are also campsites by the sea which are hidden from the beach by a line of sand dunes, or a thick belt of trees."}, {"viet": "Có những tin đồn là sắp có sự hợp nhất đến nơi.", "eng": "There are rumours of an impending merger."}, {"viet": "Chẳng hay ho gì khi việc đồng hồ treo chỉ có kim chỉ giờ làm cho người ta tưởng đồng hồ chạy nhanh hoặc chậm một ngày nửa tiếng đồng hồ.", "eng": "There had not been much point in having anything but the hour hands when a clock was likely to again or as mush as half an hour in a single day."}, {"viet": "Có một giới hạn đối với tiền tôi có thể đưa ra.", "eng": "There is a limit to the amount of money I can afford."}, {"viet": "Không có gì giống nhau giữa hai anh em.", "eng": "There is no resemblance between the two brothers."}, {"viet": "Trong phòng dường như có ma.", "eng": "There seemed to be a ghostly presence in the room."}, {"viet": "Có một bà già sống trong một chiếc giày, bà ấy có nhiều con quá chẳng biết làm thế nào.", "eng": "There was an old woman who lived in a shoe who had so many children, she didn't know what to do."}, {"viet": "Chỉ có vài thôn làng.", "eng": "There were only a few villages."}, {"viet": "Sự tính toán này đã đưa ra những kết quả không bình thường.", "eng": "These calculations have given anomalous results."}, {"viet": "Đôi giày cũ này chắc chắn đã khá hữu dụng.", "eng": "These old boots have certainly seen some service."}, {"viet": "Họ đang xây dựng một con đường mới giữa Manchester và Sheffield.", "eng": "They're building a new road between Manchester and Sheffield."}, {"viet": "Họ đã khoá nước lại trong khi sửa chữa đường ống bị vỡ.", "eng": "They've turned off the water while they mend a burst pipe."}, {"viet": "Những lời dạy đó hơi giống các câu châm ngôn trong Thánh Kinh.", "eng": "They are somewhat like the proverbs in the Bible."}, {"viet": "Nó có thể phục hồi nếu bị tổn thương, và nó có thể sinh sản.", "eng": "They can mend themselves if they are injured, and they can have babies."}, {"viet": "Chúng nó chia tiền thành năm phần và mỗi người lấy một phần.", "eng": "They divided the money into fifths and took one fifth each."}, {"viet": "Họ đưa cho ông đất và nước để tượng trưng sự phục tùng.", "eng": "They gave him earth and water in sign of submission."}, {"viet": "Họ đưa đến cho chúng ta một sự đã rồi, tôi sợ là chúng ta hoàn toàn không thể làm gì được nữa.", "eng": "They have presented us with a fait accompli, I'm afraid there's nothing absolutely we can do about."}, {"viet": "Họ thua ván đầu tiên của xét hai.", "eng": "They lost the first game of the second set."}, {"viet": "Họ bới lông tìm vết trong mọi thứ tôi nêu ra.", "eng": "They pick holes in everything I suggest."}, {"viet": "Họ đã bỏ hết tiền lãi vào bất động sản.", "eng": "They sank all their profits into property."}, {"viet": "Họ dừng lại ở một nơi cắm trại được xây dựng quanh một dòng suối trong.", "eng": "They stopped at a camp-ground built around a clear spring."}, {"viet": "Họ đi khắp nơi để nghiên cứu về chúng.", "eng": "They went here, there, and anywhere to study them."}, {"viet": "Họ rất bất bình khi có thông báo tăng giá ồ ạt.", "eng": "They were outraged by the announcement of massive price increases."}, {"viet": "Mọi thứ không thể tồi tệ hơn được nữa về mặt tài chính: tóm lại, chúng ta đã bị phá sản.", "eng": "Things couldn't be worse, financially: in short, we're bankrupt."}, {"viet": "Chiếc xe này tiêu thụ trung bình 40 dặm một galông.", "eng": "This car averages 40 miles to the gallon."}, {"viet": "Phát minh này đánh dấu một bước đột phá trong cuộc đấu tranh chống ung thư.", "eng": "This discovery marks a quantum leap forward in the fight against cancer."}, {"viet": "Bức minh hoạ này cho thấy mặt cắt của cây gỗ.", "eng": "This illustration shows a section through the timber."}, {"viet": "Đây là thực đơn, mời quý vị xem qua, lát nữa tôi sẽ quay lại!", "eng": "This is the menu, please take a look at it, I'll be back later!"}, {"viet": "Vải này đảm bảo là lụa nguyên chất.", "eng": "This material is warranted to be pure silk."}, {"viet": "Bức tranh này giống hệt bức tranh mà mẹ tôi có.", "eng": "This picture is identical to one my mother has."}, {"viet": "Cái áo sơ mi này đã bị hư khi chúng tôi ủi nó.", "eng": "This shirt was damaged when we pressed it."}, {"viet": "Cái bình này có niên đại sớm hơn cái bình kia.", "eng": "This vase is of an earlier date than that one."}, {"viet": "Mặc dầu thỉnh thoảng tỉ giá phải được điều chỉnh do sự biến động trong thị trường tiền tệ quốc tế.", "eng": "Though the rate has to be adjusted from time to time owing to the fluctuation in the international money market."}, {"viet": "Tom đã báo cáo các phát hiện của mình cho giáo sư.", "eng": "Tom reported his discoveries to the professor."}, {"viet": "Trong hoàn cảnh như vậy anh ta cảm thấy không thể chấp nhận được công việc.", "eng": "Under the circumstances, he felt unable to accept the job."}, {"viet": "Người ta đã thúc giục tôi đưa ra một quyết định không khôn ngoan.", "eng": "Was hurried into making an unwise decision."}, {"viet": "Chúng ta sẽ ăn lót dạ rồi lên đường.", "eng": "We'll have a quick nosh, then start out."}, {"viet": "Chúng tôi sẽ cân nhắc một chút trước khi quyết định mua nhà ở đâu.", "eng": "We're going to look round a bit before deciding where to buy a house."}, {"viet": "Chúng mình đã săn khắp nơi để tìm cậu.", "eng": "We've been chasing up hill and down dale trying to find you."}, {"viet": "Chúng ta sẽ dự tiệc ngoài vườn vì dự đoán rằng trời sẽ không mưa.", "eng": "We're having the party in the garden on the presumption that it's not going to rain."}, {"viet": "Chúng ta sẽ rất vui đấy.", "eng": "We are going to have a wonderful time."}, {"viet": "Chúng tôi la hét kêu cứu nhưng không ai nghe thấy cả.", "eng": "We bawled for help but no one heard us."}, {"viet": "Chúng tôi có thể phát hành một giấy chuyển khoản trực tiếp đến ngân hàng của mẹ cô nếu cô biết ngân hàng đó.", "eng": "We can issue a bank transfer direct to your mother's bank if you know the bank."}, {"viet": "Chúng ta không thể bơi được-nước triều xuống thấp quá.", "eng": "We couldn't swim-the tide was too far out."}, {"viet": "Chúng tôi đổ hết giấy lộn ra sàn nhà.", "eng": "We emptied the waste paper onto the floor."}, {"viet": "Chúng tôi ăn xong nhanh bữa trưa và kết thúc bằng một tách cà phê.", "eng": "We had a quick lunch and finished up with a cup of coffee."}, {"viet": "Chúng tôi đã thông báo cho bà rằng thẻ tín dụng của bà ấy đã bị bỏ quên ở ngân hàng chúng tôi.", "eng": "We have advised her that her credit card had been left in our bank."}, {"viet": "Chúng ta phải tiết kiệm nước trong mùa khô.", "eng": "We have to economize on water during the dry season."}, {"viet": "Chúng tôi rời khỏi đường nhựa và lái xe dọc theo đường rừng.", "eng": "We left the blacktop and drove along a forest road."}, {"viet": "Tới một lúc nào đó tất cả chúng ta đều phải chết, đó là một thực tế không thể tránh khỏi.", "eng": "We must all die sometime, that's just a fact of life."}, {"viet": "Chúng ta không được ngừng lại dù chúng ta đang thắng.", "eng": "We mustn't let up, even though we're winning."}, {"viet": "Chúng tôi cung cấp thức ăn cho trẻ con đói.", "eng": "We provided food for the hungry children."}, {"viet": "Chúng ta sẽ làm việc đó hoặc là chết trong cố gắng này.", "eng": "We shall do it or perish in the attempt."}, {"viet": "Chúng ta đã nói chuyện nhiều đến nỗi không để ý thời gian.", "eng": "We talked so much that we didn't notice the time."}, {"viet": "Chúng tôi hoan nghênh việc gửi lực lượng gìn giữ hoà bình.", "eng": "We welcome the dispatch of the peace-keeping force."}, {"viet": "Chúng tôi được dẫn cho xem phía bên ngoài rạp hát nơi thủ tướng Thuỵ Điển bị ám sát.", "eng": "We were shown the spot outside the theatre where the Swedish prime minister was assassinated."}, {"viet": "Chúng tôi sẽ đổi tiền mặt giấy chứng nhận theo yêu cầu của ông.", "eng": "We would redeem your certificate at your request."}, {"viet": "À, tôi nghĩ là ông bị cúm rồi.", "eng": "Well, I think you've caught the flu."}, {"viet": "Tôi đi học trường trung học, trong lúc đó tất cả các bạn tôi đã kiếm được việc làm lương hậu.", "eng": "Went to college, meanwhile, all my friends got well-paid jobs."}, {"viet": "Cô ấy thật là một con người kỳ quặc! Tôi không thể hiểu cô ấy tí nào cả.", "eng": "What a strange person she is! I can't make her out at all."}, {"viet": "Những đặc điểm nào phân biệt người Mỹ với người Canada?", "eng": "What characteristic distinguish the Americans from the Canadians?"}, {"viet": "X biểu thị cho con số nào trong phương trình này?", "eng": "What does x represent in this equation?"}, {"viet": "Tỷ giá hối đoái hiện thời so với tiền tệ ở nước bạn là bao nhiêu?", "eng": "What is the current exchange rate to your country?"}, {"viet": "Công ty của bạn hoạt động ở ngành kinh doanh nào?", "eng": "What kind of business does your company do?"}, {"viet": "Ba của cậu làm nghề gì?", "eng": "What's your father's job?"}, {"viet": "Thưa ông, ông muốn gọi muốn gì ạ?", "eng": "What would you like to order, sir?"}, {"viet": "Khi anh ta trở về nhà lại say lần nữa, cô ấy đã cảnh cáo anh ta phải bỏ rượu đi.", "eng": "When he came home drunk again, she read him the Riot Act."}, {"viet": "Khi nước sôi, thêm vào một ít đường.", "eng": "When it boils, add some sugar to it."}, {"viet": "Khi hai người đàn ông đó gặp nhau họ thấy ghét nhau ngay.", "eng": "When the two men met, they took an instant dislike to each other."}, {"viet": "Bất cứ khi nào tôi nhìn nó, tôi cũng sẽ nhớ cháu.", "eng": "Whenever I look at it, I'll remember you."}, {"viet": "Bò có thể lội qua nơi hẹp nhất của eo biển này.", "eng": "Where the strait is narrowest, oxen could swim across."}, {"viet": "Nó khởi hành ở thềm ga nào?", "eng": "Which platform does it depart from?"}, {"viet": "Chúng ta sẽ mời ai dự tiệc?", "eng": "Who are we going to invite to the party?."}, {"viet": "Tại sao cậu lại chơi một mình?", "eng": "Why are you playing by yourself?"}, {"viet": "Tại sao chúng ta lại không đi chơi để thư giãn nhỉ?", "eng": "Why not go outing to relax ourselves?"}, {"viet": "Bạn đi xem trận bóng đá vĩ đại giữa đội Real Madrid và đội Manchester United nhé?", "eng": "Will you go to watch the great football match between the Real Madrid and the Manchester United?"}, {"viet": "Với một vẻ tươi cười an tâm, thích thú, vui vẻ trên gương mặt.", "eng": "With a relieved, amused, cheerful smile on his face."}, {"viet": "Từ ngữ không thể diễn tả nổi hết được niềm vui sướng của tôi như thế nào.", "eng": "Words can not convey how delighted I was."}, {"viet": "Ông có muốn ông ấy gọi điện lại cho ông không?", "eng": "Would you like him to call you back?"}, {"viet": "Ông vui lòng mở va-li này ra?", "eng": "Would you open this suitcase, please?"}, {"viet": "Ừ, bộ phim này đã phát hành lâu rồi, vì thế chúng ta có thể thuê nó trong một tuần.", "eng": "Yeah, it is an old release, so we can rent it for one week."}, {"viet": "Còn việc này, vui lòng chuyển thư từ của chúng tôi đến địa chỉ này, nếu có thư nào đến sau khi chúng tôi rời khỏi.", "eng": "Yes, please forward our mail to this address, if there's any after we've left."}, {"viet": "Sau một đêm ngủ ngon, anh sẽ cảm thấy dễ chịu hơn.", "eng": "You'll feel better after a good night's sleep."}, {"viet": "Anh sẽ đánh thức tất cả hàng xóm, láng giềng bằng tiếng ồn đó.", "eng": "You're going to wake up the whole neighbourhood with that noise."}, {"viet": "Ông sẽ thấy một lối vào xe điện ngầm ở góc phố.", "eng": "You'll find subway entrance on the corner."}, {"viet": "Anh không thể nào đi phỏng vấn xin việc mà ăn mặc lôi thôi, lếch thếch quá như thế.", "eng": "You can't go to a job interview looking so scruffy."}, {"viet": "Cậu có thể lấy kiểu sang trọng, nếu cậu thích, nhưng tốn kém cho cậu đấy.", "eng": "You can have the deluxe model if you like, but it'll cost you."}, {"viet": "Cậu đâm vào ô tô của tôi thế mà bây giờ cậu lại còn trân tráo hỏi mượn xe đạp của tôi nữa.", "eng": "You crashed my car and now you have the effrontery to ask to borrow my bicycle."}, {"viet": "Anh là người mà tôi dành sự chú ý trọn vẹn không chia sẻ.", "eng": "You have my full and undivided attention."}, {"viet": "Ông sẽ nhận được bữa ăn sáng của mình ngay.", "eng": "You'll get your breakfast soon."}, {"viet": "Anh phải đối mặt với sự thật là anh đang ốm đấy.", "eng": "You must face the fact that you are ill."}, {"viet": "Phải cắm phích đèn vào nó mới cháy được.", "eng": "You need to plug in the lamp before it'll work."}, {"viet": "Ông nên đến lại ngân hàng Trung Quốc.", "eng": "You should go to the Bank of China again."}, {"viet": "Ở góc phố đó ông hãy quẹo phải rồi đi bộ qua bốn khu nhà.", "eng": "You turn right at that corner and go straight for four blocks."}, {"viet": "Anh nên ở trong nhà thì tốt hơn.", "eng": "You would be well advised to stay indoors."}, {"viet": "Cái thư của anh bị lấp dưới một đống giấy tờ.", "eng": "Your letter got buried under a pile of papers."}]