[{"viet": "Con số ước lượng có lẽ là khoảng 3.000 học sinh mỗi năm.", "eng": "3,000 students each year would be an approximation."}, {"viet": "Sự nghiệp tiêu tan do sức khỏe yếu.", "eng": "A career blighted by ill-health."}, {"viet": "Một khí hậu không khắc nghiệt.", "eng": "A climate without extremes of temperature."}, {"viet": "Một khóa học gồm các bài thuyết trình về triết học Hy Lạp.", "eng": "A course of lectures on Greek philosophy."}, {"viet": "Một nhà độc tài đã nắm quyền cai trị đất nước hơn 50 năm.", "eng": "A dictator who controlled the country for over 50 years."}, {"viet": "Một gia đình chỉ có ít tiền không thể mua thịt hàng ngày được.", "eng": "A family on a budget can't afford meat every day."}, {"viet": "Một chiếc xe ôtô hào nhoáng đắt giá có những đồ thêm thắt hấp dẫn như cửa kính tự quay.", "eng": "A flashy expensive car with all sorts of gimmicks like self-winding windows."}, {"viet": "Lau chùi sạch sẽ làm cho căn nhà sáng sủa lên.", "eng": "A good clean will really freshen up the house."}, {"viet": "Một cuốn sách hướng dẫn được biên soạn từ nhiều nguồn khác nhau.", "eng": "A guidebook compiled from a variety of sources."}, {"viet": "Một căn nhà có vẻ không cân xứng với khu vực xung quanh của nó.", "eng": "A house that seemed out of scale with its surrounding."}, {"viet": "Một số quá đông dân từ những thành phố đổ về.", "eng": "A large overflow of population from the cities."}, {"viet": "Số tiền vay 3.000 bảng Anh mà chẳng kèm theo điều kiện gì cả.", "eng": "A loan of £ 3,000 and no strings attached."}, {"viet": "Một người tính tình rất nóng nảy.", "eng": "A man with an inflammable temper."}, {"viet": "Một bản kết hợp nhiều lời khai của các nhân chứng khác nhau.", "eng": "A mosaic of testimony from various witnesses."}, {"viet": "Một bài báo vắn tắt về một cuộc tranh luận trong Nghị viện.", "eng": "A newspaper sketch of a debate in Parliament."}, {"viet": "Một số tiền thanh toán là 30.000 bảng Anh miễn thuế.", "eng": "A payment of £ 30,000 free of tax."}, {"viet": "Cây không thể sống không có nước.", "eng": "A plant cannot exist without water."}, {"viet": "Một nhà tù được xây cất để giam 500 tội nhân.", "eng": "A prison built to hold 500 prisoners."}, {"viet": "Một giải pháp rất thích hợp cho vấn đề đó.", "eng": "A ready-made answer to the problem."}, {"viet": "Một hội đồng của Hoàng gia chuyên điều tra về cá cược và bài bạc.", "eng": "A Royal Commission on betting and gambling."}, {"viet": "Một loạt thử nghiệm đã khẳng định chất lượng cao của nó.", "eng": "A series of tests confirmed the high quality."}, {"viet": "Một số tiền nhỏ đóng góp cho việc quyên góp.", "eng": "A small contribution to the collection."}, {"viet": "Một đấu thủ thể thao người thích được chú ý.", "eng": "A sportsman who likes to be in the spotlight."}, {"viet": "Một bộ chương trình đầy đủ cho vi tính.", "eng": "A suite of programs for a computer."}, {"viet": "Một vụ đe dọa đình công của các nhân viên kiểm soát không lưu.", "eng": "A threatened strike by air-traffic controllers."}, {"viet": "Một phó tổng thống nhiều lần cố gắng lấn át tổng thống.", "eng": "A vice president who repeatedly tried to upstage the president."}, {"viet": "Một phụ nữ với mấy đứa con còn phụ thuộc.", "eng": "A woman with several dependent children."}, {"viet": "Tố cáo chính phủ bóp nghẹt tự do báo chí.", "eng": "Accused the government of throttling the freedom of the press."}, {"viet": "Sau 25 năm trung tâm thị trấn đã thay đổi đến mức không thể nhận ra được.", "eng": "After 25 years the town centre had changed beyond recognition."}, {"viet": "Sau khi em nhận tiền thưởng em sẽ tham gia.", "eng": "After I receive my bonus, I'll join."}, {"viet": "Sau khi gập, các trang sách đã được xếp theo thứ tự.", "eng": "After the folding, the pages are all in the right order."}, {"viet": "Đại đế Alexander đã xâm chiếm Ấn Độ bằng một đạo quân vĩ đại.", "eng": "Alexander the Great invaded India with a large army."}, {"viet": "Mọi chỗ đều có thể đặt trước.", "eng": "All seats are bookable in advance."}, {"viet": "Con chỉ cần nhân đáp số với 2.", "eng": "All you have to do is multiply the answer by 2."}, {"viet": "Trong số các thông điệp chuyển qua dây thần kinh của chúng ta có những thông điệp cho phép chúng ta nhìn, nghe, nếm, ngửi và sờ thấy.", "eng": "Among the messages that travel over the nerves are those that let us see, hear, taste, smell, and feel."}, {"viet": "Một hàng chai lọ có hình dáng và kích cỡ khác nhau.", "eng": "An array of bottles of different shapes and sizes."}, {"viet": "Một kỵ sĩ kinh nghiệm với thế ngồi vững.", "eng": "An experienced rider with a good seat."}, {"viet": "Một vị trí quan sát trong pháo đài biên giới.", "eng": "An observation post in a border fortress."}, {"viet": "Một đoạn tẻ nhạt trong một cuốn phim.", "eng": "An unmotivated episode in a movie."}, {"viet": "Những nhân vật thú vật được nhân tính hoá trong biếm hoạ.", "eng": "Animal characters humanized in cartoons."}, {"viet": "Xin lỗi vì sự có mặt của người nào đã ở bên ai.", "eng": "Apologize for inflicting one's company on somebody."}, {"viet": "Có những thiên hà khác ở ngoài thiên hà của chúng ta không?", "eng": "Are there other universes outside our own?"}, {"viet": "Bạn học tiếng Anh cho vui hay vì công việc?", "eng": "Are you learning English for pleasure or for your work?"}, {"viet": "Nghệ thuật và Kiến trúc cũng nảy nở trong Đế quốc Byzantine ở phương Đông.", "eng": "Art and learning flourished also in the great Byzantine Empire to the east."}, {"viet": "Về điểm thứ hai trong thư anh.", "eng": "As regards the second point in your letter."}, {"viet": "Assertion là một từ phái sinh của assert.", "eng": "Assertion is a derivative of assert."}, {"viet": "Ở phía đối diện của eo biển Marmara có một eo biển nữa tên là Dardanelles.", "eng": "At the opposite end of the Sea of Marmara is another strait-the Dardanelles."}, {"viet": "Đậu rang được bán rẻ tuần này ở siêu thị địa phương.", "eng": "Baked beans are on offer this week at the local supermarket."}, {"viet": "Được phép nghỉ để đi thăm mẹ của ai.", "eng": "Be given leave to visit one's mother."}, {"viet": "Vì bị bệnh nên cô ấy chẳng được lợi lộc gì khi ở ngoại quốc.", "eng": "Because of illness she didn't get much benefit from her stay abroad."}, {"viet": "Ngoài việc mở tài khoản, tôi sẽ đổi một ít đô la sang nhân dân tệ.", "eng": "Besides opening an account I'm going to change some dollars into RMB Yuan."}, {"viet": "Đào một đường hầm xuyên qua một ngọn núi.", "eng": "Bore a tunnel through a mountain."}, {"viet": "Broadway là một quận nhà hát của thành phố New York.", "eng": "Broadway is the theatre district of New York City."}, {"viet": "Nhưng tôi chỉ biết một chút về lịch sử của nó thôi.", "eng": "But I know only a little part of its history."}, {"viet": "Nhưng chúng tôi sẽ giữ sơ yếu lý lịch của cô trong hồ sơ chờ xét của chúng tôi và sẽ liên lạc với cô nếu có chỗ cần người nữa.", "eng": "But we'll keep your resume in our active file and get in touch with you if another opening is available."}, {"viet": "À này, cái áo kiểu của bà bị mất một cái nút.", "eng": "By the way, a button came off your blouse."}, {"viet": "Tôi có thể lấy nó ra bây giờ không?", "eng": "Can I get it out now?"}, {"viet": "Chúng ta có thể thuyết phục họ là kết quả sẽ chứng minh cho việc đầu tư ban đầu không?", "eng": "Can we persuade them that the results will justify the initial investment?"}, {"viet": "Bạn có thể nêu tên một số trường đại học danh tiếng ở Úc không?", "eng": "Can you name some prestigious universities in Australia?"}, {"viet": "Nói một cách thẳng thắn, David ạ, anh thật không biết điều chút nào.", "eng": "Candidly, David, I think you're being unreasonable."}, {"viet": "Các nút chai sâm banh nổ lốp bốp suốt các cuộc liên hoan đó.", "eng": "Champagne corks were popping away throughout the celebrations."}, {"viet": "Vui lòng cho khoai tây và rau trộn.", "eng": "Chips and a green salad, please."}, {"viet": "Đại tá James Blunt đã được tặng thưởng Huân chương Anh dũng Victoria.", "eng": "Col James Blunt was awarded the VC."}, {"viet": "Đã hoàn toàn mất sáng suốt sau vụ phá sản thị trường chứng khoán.", "eng": "Completely lost his marbles after the stock market crash."}, {"viet": "Trái với những lời căn dặn của bác sĩ, anh ấy đã đi làm trở lại.", "eng": "Contrary to the doctor's orders, he had gone back to work."}, {"viet": "Anh có thể đến bưu điện giúp tôi được không?", "eng": "Could you go to the post office for me, please?"}, {"viet": "Ở một số nước hoả táng thông dụng hơn là chôn cất.", "eng": "Cremation is more common than burial in some countries."}, {"viet": "Trò chơi phóng phi tiêu thường được chơi trong các quán rượu ở Anh.", "eng": "Darts is often played in English pubs."}, {"viet": "Bị mất đi sự che chở của mẹ nó.", "eng": "Deprived of his mother's protection."}, {"viet": "Anh đã xin chủ của anh tăng lương chưa?", "eng": "Did you ask your boss for a pay increase?"}, {"viet": "Cách xử lý khác nhau đối với những người người xin việc.", "eng": "Differential treatment of applicants for jobs."}, {"viet": "Tôi có cần mặc quần áo trang trọng đi xem hát không?", "eng": "Do I need to dress for the theatre?"}, {"viet": "Bạn có tin là nhóm máu có thể đoán được cá tính không?", "eng": "Do you believe that blood type can predict personality?"}, {"viet": "Ông có hẹn trước với ông ấy không ạ?", "eng": "Do you have an appointment with him?"}, {"viet": "Bạn có biết loài hoa có tên là tú cầu không?", "eng": "Do you know the flower called hydrangea?"}, {"viet": "Bạn thích chơi các môn thể thao mùa đông hay các môn thể thao mùa hè hơn?", "eng": "Do you prefer winter or summer sports?"}, {"viet": "Bạn có nghĩ bạn cũng có thể đi không?", "eng": "Do you think you could come, too?"}, {"viet": "Tuổi được uống rượu ở các tiểu bang đều khác nhau phải không?", "eng": "Does the drinking age vary from state to state?"}, {"viet": "Đừng có tin hắn-hắn đích thực là kẻ nịnh hót đấy.", "eng": "Don't believe him-he's a real flatterer."}, {"viet": "Đừng có hấp tấp, còn nhiều thời gian mà.", "eng": "Don't hurry, there's plenty of time."}, {"viet": "Đừng làm bù tóc tôi, tôi vừa mới chải đấy.", "eng": "Don't ruffle my hair, I've just combed it."}, {"viet": "Đừng lo-chắc là họ chỉ quên gọi điện thoại thôi mà.", "eng": "Don't worry-they could have just forgotten to phone."}, {"viet": "Lái xe trên đường đóng băng có thể khá khó khăn đấy.", "eng": "Driving on icy roads can be pretty hairy."}, {"viet": "Ăn hết tất cả các thức ăn này trong một tiếng là không thể được.", "eng": "Eating all this food in one hour is impossible."}, {"viet": "Đủ vải để may rèm cho tất cả các phòng.", "eng": "Enough material to curtain all the rooms."}, {"viet": "Mọi người đều bực bội vì những sự thay đổi của kế hoạch.", "eng": "Everybody is pissed off with all the changes of plan."}, {"viet": "Xin lỗi, có ai ngồi ở đây không?", "eng": "Excuse me, is anybody sitting here?"}, {"viet": "Không hiểu hết tính nghiêm trọng của tình thế.", "eng": "Failing to comprehend the full seriousness of the situation."}, {"viet": "Tự cảm thấy mình ngoan hơn các người khác sau khi rửa bát.", "eng": "Feel virtuous at having done the washing-up."}, {"viet": "Trước tiên, cầm một cái bánh hỏi trên tay, dùng hành lá quét một ít tương lên cái bánh hỏi như thế này.", "eng": "First, hold a pancake in your hand and paint a few splashes of bean sauce on the pancake with the scallion like this."}, {"viet": "Gấp chiếc khăn ăn thành tam giác.", "eng": "Fold the napkin into a triangle."}, {"viet": "Ép buộc quân địch rút lui về sau chiến tuyến của chúng.", "eng": "Force the enemy to retreat behind their lines."}, {"viet": "Từ vị trí thuận lợi trên mỏm đá chúng có thể quan sát tàu đến và tàu đi.", "eng": "From their vantage-point on the cliff, they could watch the ships coming and going."}, {"viet": "Hãy nhìn cái ông già kia đội cái mũ thật buồn cười!", "eng": "Get a load of that old bloke with the funny hat!"}, {"viet": "Cho tôi biết những lý do của anh về sự ra đi.", "eng": "Give me your reasons for going."}, {"viet": "Hãy đi thẳng tới cuối con đường.", "eng": "Go right to the end of the road."}, {"viet": "Những mầm xanh nhú lên khỏi mặt đất.", "eng": "Green shoots peeping up through the soil."}, {"viet": "Harry được 6 điểm, susan được 8 điểm nhưng Alison được nhiều điểm nhất.", "eng": "Harry got 6 points, Susan got 8 points but Alison got most."}, {"viet": "Bạn có bao giờ đến dự lễ hội nào của Nhật Bản chưa?", "eng": "Have you been to any Japanese festivals?"}, {"viet": "Anh đã làm việc vất vả cả ngày ở cơ quan phải không?", "eng": "Have you had a hard day at the office?"}, {"viet": "Cậu ta vừa muốn đi vườn thú, vừa muốn đi xem phim.", "eng": "He'd as soon go to the zoo as go to the cinema."}, {"viet": "Ông ấy luôn luôn vứt hàng đống những tờ tạp chí cũ trong phòng.", "eng": "He's always littering up the room with his old magazines."}, {"viet": "Anh ấy thường xuyên gọi điện cho tôi sáng sớm.", "eng": "He's eternally telephoning me early in the morning."}, {"viet": "Ông ta không phải là con người nửa vời-hoặc là ông ta tặng cho một tổ chức từ thiện một món tiền rất lớn hoặc là chẳng cho gì cả.", "eng": "He's not a man who does things by halves-either he donates a huge sum to a charity or he gives nothing."}, {"viet": "Nó đã gầy đi nhiều từ khi nó ăn kiêng.", "eng": "He's thinned down a lot since he went on a diet."}, {"viet": "Anh ta luôn luôn tìm cách đạt được những gì anh ta muốn.", "eng": "He always manages to obtain what he wants."}, {"viet": "Anh ta tin rằng kiếp trước mình là hoàng tử.", "eng": "He believed he had been a prince in a previous incarnation."}, {"viet": "Hắn có thể nhận được nhiều sự giúp đỡ.", "eng": "He can get any amount of help."}, {"viet": "Hắn đã thú nhận những tội ác khác sau khi cướp nhà băng.", "eng": "He confessed to other crimes subsequent to the bank robbery."}, {"viet": "Anh ta phủ nhận việc có dính líu của mình.", "eng": "He denied that he was involved."}, {"viet": "Ông ấy không biết làm cách nào để truyền đạt quan điểm của mình trong các buổi phỏng vấn.", "eng": "He doesn't know how to put himself across at interviews."}, {"viet": "Ông chìa tay ra bắt tay nhân viên mới.", "eng": "He extended his hand to the new employee."}, {"viet": "Nó buộc lòng phải nói với nàng.", "eng": "He forced himself to speak to her."}, {"viet": "Anh ta gây được ấn tượng mình là một công nhân chăm chỉ.", "eng": "He gives the impression of being a hard worker."}, {"viet": "Ông ta đã quá tự trọng nên không yêu cầu giúp đỡ.", "eng": "He had been too proud to ask for help."}, {"viet": "Anh ta uống một ly ca cao trước khi đi ngủ.", "eng": "He has a mug of cocoa before bed."}, {"viet": "Anh ta có nhiều sách nước ngoài trong thư viện của mình.", "eng": "He has many foreign books in his library."}, {"viet": "Anh ấy bám chặt vào mỏm đá để khỏi bị trượt.", "eng": "He held on to the rock to stop himself slipping."}, {"viet": "Ông ta đang suy tính việc từ chức khỏi ủy ban.", "eng": "He is considering resignation from the Board."}, {"viet": "Anh là tấm gương toàn thiện của tính bặt thiệp và lễ độ.", "eng": "He is the quintessence of tact and politeness."}, {"viet": "Anh ta đá đổ cái xô và nước chảy ra hết.", "eng": "He knocked the bucket over and all the water spilt out."}, {"viet": "Anh ta có thể trở thành một tay bơi xuồng phản lực chuyên nghiệp vào mùa xuân tới.", "eng": "He'll probably become a professional jet skier next spring."}, {"viet": "Chỉ có việc đi đến nha sĩ mà anh ta cứ làm như là chuyện quan trọng.", "eng": "He makes a drama out of a simple visit to the dentist."}, {"viet": "Anh ta không bao giờ mó tay làm việc gì trong nhà.", "eng": "He never lifts a finger round the house."}, {"viet": "Ông ấy bế đứa bé lên và đặt nó trên vai.", "eng": "He picked up the child and put her on his shoulders."}, {"viet": "Ông ta tỏ ra không thích ứng với một chức vụ cần có trách nhiệm.", "eng": "He proved unsuited to a position of responsibility."}, {"viet": "Ông ta thật sự sỉ vả cô ta, bảo cô ta là kiêu căng và nhẫn tâm.", "eng": "He really laid into her, saying she was arrogant and unfeeling."}, {"viet": "Nó đã bù đắp được những thua thiệt của mình bằng việc đánh cá vào một loạt những con ngựa thắng.", "eng": "He retrieved his losses by betting on a succession of winners."}, {"viet": "Anh ấy cao gần sáu bộ Anh.", "eng": "He's almost six feet tall."}, {"viet": "Hắn giàu có nhưng khiếm nhã.", "eng": "He's got more money than taste."}, {"viet": "Anh ta được trả lương gấp đôi cho cùng một công việc đó.", "eng": "He's paid double for the same job."}, {"viet": "Anh ta nói tin đồn đó là hoàn toàn không có cơ sở.", "eng": "He said that the rumour was completely unfounded."}, {"viet": "Anh ấy hình như hoàn toàn thích hợp với công việc đó.", "eng": "He seems tailor-made for the job."}, {"viet": "Nó tỏ ra rất siêng năng trong mọi việc.", "eng": "He shows great assiduity in all his work."}, {"viet": "Ông ta kể một cách rất cay đắng về những kinh nghiệm trong tù của mình.", "eng": "He spoke most bitterly of his experiences in prison."}, {"viet": "Ông ta đã bước vào buổi họp một cách quả quyết.", "eng": "He strode purposefully into the meeting."}, {"viet": "Ông dạy học trò phải biết trung thực và tử tế, phải biết thờ kính cha mẹ và biết tuân lệnh các nhà cai trị của mình.", "eng": "He taught his pupils to be honest and kind, to honor their parents, and to obey their rules."}, {"viet": "Anh ta dắt con chó đi theo ( với anh ta ) đến nơi làm việc.", "eng": "He took his dog along ( with him ) to work."}, {"viet": "Anh ấy gắng cười để trấn an nỗi sợ hãi của cô ấy mà không thành công.", "eng": "He tried without success to laugh her fear away."}, {"viet": "Anh ta bước ra ngoài trời tuyết, ăn mặc thật kín trong chiếc khăn quàng dày và chiếc áo khoác ấm áp.", "eng": "He walked out into the snow, heavily muffled up in a thick scarf and warm overcoat."}, {"viet": "Ông ta luôn thân mật với những sĩ quan thuộc cấp.", "eng": "He was always friendly to his subordinate officers."}, {"viet": "Anh ta bị buộc tội là kẻ gây nên cuộc phiến loạn.", "eng": "He was charged with the authorship of the muting."}, {"viet": "Nó đã bị phạt đến 200 pao vì lái xe quá tốc độ.", "eng": "He was fined for speeding to the tune of 200 pounds."}, {"viet": "Ông ta hết lời khen ngợi kế hoạch đó.", "eng": "He was lavish with his praise for the project."}, {"viet": "Anh ta được ca ngợi vì tính lương thiện khi anh ta trả lại tiền.", "eng": "He was praised for his honesty when he return the money."}, {"viet": "Ông ta vẫn tràn đầy lạc quan về tương lai mặc dầu còn có rất nhiều vấn đề.", "eng": "He was still full of optimism for the future despite his many problems."}, {"viet": "Ông ta gặp ma, một người con gái giống như đứa con gái đã chết của ông.", "eng": "He was visited by an apparition, a girl resembling his dead daughter."}, {"viet": "Ông ấy sẽ bị coi là một nhà lãnh đạo yếu kém.", "eng": "He will be considered a weak leader."}, {"viet": "Ông ta đã chẳng thành công trong một vụ làm ăn liều lĩnh như thế nếu như ông ta không phải là một nhà doanh nghiệp khôn ngoan.", "eng": "He would not have succeeded in such a risky business if he had not been such a clever entrepreneur."}, {"viet": "Chào ông Vương, ông David Smith hiện đang ở đây cho cuộc hẹn lúc 10: 30.", "eng": "Hello, Mr. Wang, Mr. David Smith is here for his 10: 30 appointment."}, {"viet": "Cái áo cánh của cô ta không hợp với cái váy của cô ta.", "eng": "Her blouse doesn't go with her skirt."}, {"viet": "Cách biểu diễn điêu luyện bản xônát của cô ấy.", "eng": "Her delicate playing of the sonata."}, {"viet": "Bạn bè của cô ta cũng đều thích thú máy tính như cô.", "eng": "Her fellows share her interest in computers."}, {"viet": "Chồng cô ta phản bội cô ta.", "eng": "Her husband is unfaithful to her."}, {"viet": "Vận may của cô ta hình như có khuynh hướng tăng lên.", "eng": "Her luck seems to have taken an upturn."}, {"viet": "Cha mẹ của cô ấy có ảnh hưởng mạnh mẽ đối với cô ấy.", "eng": "Her parents have a strong influence on her."}, {"viet": "Phòng cô ấy thật quá bừa bộn, quần áo vất lung tung trên sàn.", "eng": "Her room was ever so untidy, there was clothes all over the floor."}, {"viet": "Người thuê nhà của bà ta đã cuốn gói đi mà không trả tiền thuê nhà.", "eng": "Her tenant left, bag and baggage, without paying the rent."}, {"viet": "Đây là nhân dân tệ Trung Quốc cho một ngàn năm trăm đô la Mỹ.", "eng": "Here are your Chinese Yuan for one thousand five hundred US dollars."}, {"viet": "Hành động anh ta không ăn khớp với lời nói.", "eng": "His actions do not consist with his words."}, {"viet": "Tiểu sử ông ta là một tiểu thuyết về công cuộc nghiên cứu khoa học.", "eng": "His biography is a saga of scientific research."}, {"viet": "Lương tâm của anh ta giờ đang day dứt khi anh ta nhận thức được những gì mình đã làm.", "eng": "His conscience is pricking him now that he realizes what he has done."}, {"viet": "Kinh nghiệm của anh ta làm cho anh đáp ứng được công việc.", "eng": "His experience fitted him for the job."}, {"viet": "Phong cách nói trang trọng của ông ấy thích hợp với dịp đó.", "eng": "His formal style of speaking was appropriate to the occasion."}, {"viet": "Việc nó không nói được tiếng Pháp đã đặt nó vào thế bất lợi.", "eng": "His inability to speak French puts him at a disadvantage."}, {"viet": "Chuyện ngồi lê đôi mách có ác ý của anh ta đã gây ra nhiều phiền lụy cho đến khi mọi người biết sự thật.", "eng": "His malicious gossip caused much mischief until the truth became known."}, {"viet": "Tài hùng biện của ông ta chẳng bao lâu đã khiến đám đông la ó các đối thủ của ông.", "eng": "His oratory soon had the crowd booing his opponents."}, {"viet": "Những cú đấm của nó vào người đối thủ tỏ ra đặc biệt có hiệu lực.", "eng": "His punches to his opponent's body proved especially telling."}, {"viet": "Công việc tẻ nhạt của anh ta trong nhà máy.", "eng": "His soulless work in the factory."}, {"viet": "Chuyến đi của anh ta thể hiện một tình huống tăm tối kỳ quái đầy trở ngại và bạo lực bất ngờ.", "eng": "His trip is an eerie nightscape full of rubble and reflexive violence."}, {"viet": "Việc viết lách đem lại cho anh ấy 10000 pao một năm.", "eng": "His writing brings him 10000 pounds a year."}, {"viet": "Hy vọng ông có chuyến đi vui vẻ.", "eng": "Hope you have a nice trip."}, {"viet": "Làm sao tôi có thể báo đáp được lòng tốt của ông?", "eng": "How can I ever repay you for your kindness?"}, {"viet": "Làm sao bạn thu thập được tất cả chúng?", "eng": "How did you get all of them?"}, {"viet": "Em đã làm mất nó như thế nào mới được chứ?", "eng": "How ever did you lose it?"}, {"viet": "Thời tiết đẹp này sẽ kéo dài được bao lâu?", "eng": "How long will this fine weather hold?"}, {"viet": "Tôi phải cắt mấy lát bánh mì đây?", "eng": "How many slices of bread shall I cut?"}, {"viet": "Anh quốc viện trợ cho nước ngoài bao nhiêu?", "eng": "How much overseas aid does Britain give?"}, {"viet": "Dù có kính trọng cô ấy đến mấy, anh cũng không nên coi cô ấy là hoàn hảo.", "eng": "However much you admire her, you shouldn't try and put her on a pedestal."}, {"viet": "Cho tôi món đậu phụ dồn thịt băm xốt ớt khô.", "eng": "I'd like Beancurd with Minced Meat and Chilli'."}, {"viet": "Tôi cho rằng anh ta có khả năng thắng trận ngang bằng với thua trận.", "eng": "I'd say he has an even chance of winning the match."}, {"viet": "Tôi sẽ cho người mang nó đến phòng của bà ngay.", "eng": "I'll have someone send it to your room immediately."}, {"viet": "Tôi sẽ đem báo cáo về nhà để đọc cho thong thả.", "eng": "I'll take the report home and read it at leisure."}, {"viet": "Tôi không đồng ý việc tàn sát súc vật để lấy lông.", "eng": "I'm against killing animals for their fur."}, {"viet": "Tôi sắp đi ngủ và anh cũng nên đi ngủ thôi.", "eng": "I'm going to bed and you would be well advised to do likewise."}, {"viet": "Tôi không phải là người thức suốt đêm, chắc chắn là tôi cần giấc ngủ trước lúc nửa đêm.", "eng": "I'm no all-nighter, I need my beauty sleep, for sure."}, {"viet": "Tôi hơi thiếu tiền-anh có thể cho tôi vay một ít được không?", "eng": "I'm rather short of LSD-can you lend me some?"}, {"viet": "Tôi tin chắc là mọi thứ ông thấy ở Trung Quốc sẽ gây cho ông ấn tượng sâu sắc.", "eng": "I'm sure everything you see in China will impress you deeply."}, {"viet": "Tôi rất vui được gặp lại ông, Thiếu tá.", "eng": "I'm very happy to see you again, Major."}, {"viet": "Trong quá khứ, tôi đã tới đây nhiều lần.", "eng": "I've been there many times in the past."}, {"viet": "Mình chán ngấy câu chuyện huyên thuyên của cậu rồi!", "eng": "I've had enough of your constant chatter!"}, {"viet": "Tôi đã qua kỳ thi viết, còn phải qua kỳ thi vấn đáp nữa.", "eng": "I've passed the written test, the interview is the next hurdle."}, {"viet": "Tôi đồng ý về điểm chính của những gì anh nói nhưng không đồng ý về những điểm chi tiết.", "eng": "I agree with what you say in substance but differ on points of detail."}, {"viet": "Tôi đến đây vì công việc kinh doanh chứ không phải đi nghỉ.", "eng": "I am here on business as opposed to a holiday."}, {"viet": "Tôi đã đến muộn vài phút.", "eng": "I arrived a couple of minutes late."}, {"viet": "Tôi mua một ô tô giá 500 bảng.", "eng": "I bought a care for five hundred pounds £ 500."}, {"viet": "Tôi không thể ăn được món thịt này-nó toàn sụn.", "eng": "I can't eat this meat-it's all gristle."}, {"viet": "Tôi không chịu nổi khi còn nhìn thấy mặt anh.", "eng": "I can't stand the sight of you any more."}, {"viet": "Tôi có thể đi guốc vào bụng anh: anh chẳng đau buồn tý nào cả.", "eng": "I can read you like a book: you're not sorry at all."}, {"viet": "Tôi không thể đóng cái cặp của mình lại được.", "eng": "I can't shut my briefcase."}, {"viet": "Tôi có thể trông thấy khói đang bay ra cửa sổ ngôi nhà đối diện.", "eng": "I could see smoke coming out of the windows of the house opposite."}, {"viet": "Xin mời bạn đến nhà tôi.", "eng": "I'd like to invite you to my home."}, {"viet": "Tôi chẳng để ý điều gì ngoại trừ giọng nói hơi lạ của anh ta.", "eng": "I didn't notice anything beyond his rather strange accent."}, {"viet": "Tôi chẳng cần để tâm những gì anh nói, tôi đi đây.", "eng": "I don't give a damn what you say, I'm going."}, {"viet": "Không thích cái ấn tượng do chồng của cô ta gây ra!", "eng": "I don't like the sound of her husband!"}, {"viet": "Tôi không muốn những thằng chả ra gì đến quầy rượu câu lạc bộ.", "eng": "I don't want any Tom, Dick, and Harry using the club bar."}, {"viet": "Tôi không biết anh ấy mất khi nào.", "eng": "I don't know when he died."}, {"viet": "Tôi ước tính chúng ta sẽ tới vào lúc 5 giờ 30.", "eng": "I estimate that we should arrive at 5.30."}, {"viet": "Tôi cảm thấy như là tôi đang xâm phạm vào nỗi khổ đau riêng tư của họ.", "eng": "I felt as though I was intruding on their private grief."}, {"viet": "Tôi thấy mình đang bị lôi kéo vào một cuộc tranh cãi khác chán ngắt.", "eng": "I found myself being drawn into another dreary argument."}, {"viet": "Tôi đã mua nó ở đại lý du lịch.", "eng": "I got it at the travel agency."}, {"viet": "Bữa trưa tôi đã ăn bánh mì phó mát với bia.", "eng": "I had bread and cheese for lunch, washed down with beer."}, {"viet": "Tôi ghét cả đám chính trị gia.", "eng": "I hate the whole tribe of politicians."}, {"viet": "Tôi bị huyết áp cao và đau tim.", "eng": "I have high blood pressure and heart trouble."}, {"viet": "Tôi có việc khẩn phải làm.", "eng": "I have something urgent to do."}, {"viet": "Tôi không gặp anh ta kể từ lễ Noen năm kia.", "eng": "I haven't seen him since the Christmas before last."}, {"viet": "Tôi nghe tin đó một cách gián tiếp.", "eng": "I heard the news in a roundabout way."}, {"viet": "Tôi hy vọng bạn thích thức ăn này.", "eng": "I hope you enjoyed the food."}, {"viet": "Tôi biết tôi không đỗ một cách dễ dàng nhưng tôi không bao giờ nghĩ là tôi sẽ trượt.", "eng": "I knew I wouldn't take it ace, but I never thought I would flunk it."}, {"viet": "Tôi đã buột miệng nói rằng tôi đang có mang.", "eng": "I let it slip that I was expecting baby."}, {"viet": "Tôi sẽ trở lại trước khi bạn xuất viện.", "eng": "I'll be back before you leave."}, {"viet": "Mình sẽ giúp cậu tìm ra đôi giày.", "eng": "I'll help you to find your shoes."}, {"viet": "Tôi đánh mất hồ sơ của anh hoàn toàn do rủi ro.", "eng": "I lost your file by pure mischance."}, {"viet": "Bác rất vui vì cháu thích bữa ăn này.", "eng": "I'm glad you enjoyed your dinner."}, {"viet": "Tôi không chắc lắm điều này có đúng hay không.", "eng": "I'm not too sure if this is right."}, {"viet": "Bác đã làm một cái bánh cho cháu.", "eng": "I made a cake for you."}, {"viet": "Tôi phải ôn lại tiếng Ý trước khi đi Roma.", "eng": "I must brush up on my Italian before I go to Rome."}, {"viet": "Tôi cần một ít thuốc tiêu để chữa chứng đầy bụng của tôi.", "eng": "I need some antacid to cure my indigestion."}, {"viet": "Hồi trẻ tôi hay đi đến nơi đó.", "eng": "I often went there in my youth."}, {"viet": "Tôi rất coi trọng sự độc lập của tôi nên không thể đi làm việc cho họ được.", "eng": "I prize my independence too much to go and work for them."}, {"viet": "Lẽ ra tôi nên cẩn thận hơn.", "eng": "I really should have been more careful."}, {"viet": "Tôi nghỉ một giờ trước khi đi.", "eng": "I rested for an hour before I went out."}, {"viet": "Tôi thấy bà cho trứng vào trước khi đổ sữa, đó là một cách làm.", "eng": "I see you add the egg before the milk, that's one way of doing it."}, {"viet": "Tôi thì tôi không có dây vào thằng Peter-nó to lớn hơn anh.", "eng": "I shouldn't tangle with Peter-he's bigger than you."}, {"viet": "Tôi đề nghị một chuyến đi tham quan viện bảo tàng.", "eng": "I suggest a tour of the museum."}, {"viet": "Tôi nghĩ là tôi sẽ nhận việc nếu họ tăng tiền lương lên.", "eng": "I think I'd like to take it, if they would increase the pay."}, {"viet": "Tôi nghĩ bàn cạnh cửa sổ thì tốt hơn.", "eng": "I think that the one by the window is better."}, {"viet": "Tôi tưởng con chuột đã chết, nhưng rồi nó co giật nhẹ một cái.", "eng": "I thought the mouse was dead, but then it gave a slight twitch."}, {"viet": "Tôi cố chiếm cảm tình của cô ta.", "eng": "I tried to win her affections."}, {"viet": "Tôi chưa bao giờ thử chơi trượt băng cả.", "eng": "I've never tried ice skating."}, {"viet": "Tôi muốn mời sáu người bạn ăn trưa ngày mai.", "eng": "I want to invite six friends to lunch tomorrow."}, {"viet": "Tôi đang ở chỗ cha tôi.", "eng": "I was at my father's."}, {"viet": "Tôi mù tịt về điều đó mãi đến khi cô ấy cho tôi biết.", "eng": "I was in the dark about it until she told me."}, {"viet": "Tôi nói chuyện với anh ta chỉ mới ngày hôm qua.", "eng": "I was speaking to him only yesterday."}, {"viet": "Tôi về nhà ngay khi tôi làm xong việc.", "eng": "I went home directly I had finished work."}, {"viet": "Tôi mong rằng diễn giả tự giới hạn mình vào chủ đề.", "eng": "I wish the speaker would confine himself to the subject."}, {"viet": "Tôi không biết chị gọi những cái dùng để đựng thư từ, giấy tờ, tài liệu là gì nhỉ?", "eng": "I wonder what you call those things for letters and papers and documents?"}, {"viet": "Tôi muốn làm thủ tục lên máy bay.", "eng": "I would like to check-in."}, {"viet": "Tôi sẽ không có gan để thử bất cứ cái gì nguy hiểm như vậy.", "eng": "I wouldn't have the nerve to try anything so dangerous."}, {"viet": "Nếu ông ta có thể có được một chiếc du thuyền sang trọng thì chắc chắn ông ta lại càng có thể trả nợ được.", "eng": "If he can afford a luxury yacht, then a fortiori he can afford to pay his debts."}, {"viet": "Nếu cần, tôi sẽ đến vào lúc 6 giờ.", "eng": "If it is necessary I will come at 6."}, {"viet": "Nếu như có hy vọng... thì nó ở giai cấp vô sản.", "eng": "If there is hope., it lies in the proles."}, {"viet": "Nếu cộng 5 với 5 ( với nhau ), bạn sẽ có 10.", "eng": "If you add 5 and 5 ( together ), you get 10."}, {"viet": "Nếu anh không thực hành tiếng Anh, anh sẽ quên.", "eng": "If you don't use your English you'll forget it."}, {"viet": "Nếu bạn nhận ra bất cứ người nào trong ảnh, hãy nói cho chúng tôi biết.", "eng": "If you recognize any of the people in the photograph, tell us."}, {"viet": "Ngu dốt là sự kìm hãm tiến bộ.", "eng": "Ignorance acts a brake to progress."}, {"viet": "Ở Anh, cứ ba cuộc hôn nhân thì cuối cùng có một cuộc li hôn.", "eng": "In Britain, one in three marriages ends in divorce."}, {"viet": "Vào thời của ông, người ta nghĩ rằng Quả Đất là trung tâm của vũ trụ và Mặt Trời cùng với tất cả các ngôi sao đều xoay quanh nó.", "eng": "In his time people thought that the Earth was the center of the Universe and that the Sun and all the stars turned around it."}, {"viet": "Ở một số nước người ta tặng quà Giáng Sinh vào ngày 6 tháng Giêng hoặc đêm ngày 12, lúc mà ba nhà thông thái mang quà đến cho Hài nhi Jesus.", "eng": "In some countries Christmas presents are not given until January 6, or Twelfth Night, the time when the Wise Men brought gifts to the baby Jesus."}, {"viet": "Trong những năm cuối đời, ông ấy sống một mình và không bao giờ tiếp khách.", "eng": "In the latter years of his life, he lived alone and never welcomed visitors."}, {"viet": "Bạn hay bị căng thẳng trong những tình huống nào?", "eng": "In what situations do you get nervous?"}, {"viet": "Bà ấy là một tiểu thuyết gia và một nhà triết học lỗi lạc.", "eng": "Is a distinguished novelist and philosopher."}, {"viet": "Có phải ngân hàng Trung Quốc đó không?", "eng": "Is that the Bank of China?"}, {"viet": "Đây mà là khách sạn bốn sao à?", "eng": "Is this a four-star hotel?"}, {"viet": "Phải đến ba dặm nữa mới tới nhà ga.", "eng": "It's a good three miles to the station."}, {"viet": "Quả là một việc khó khăn lâu dài, nhưng cuối cùng thì cuốn từ điển này đã được xuất bản.", "eng": "It's been a long haul but at last this dictionary is published."}, {"viet": "Thật ngu xuẩn đi mong chờ một người có kinh nghiệm như bà ta đi làm một việc với tiền công ít ỏi như thế.", "eng": "It's grotesque to expect a person of her experience to work for such little money."}, {"viet": "Nói với nó chẳng ăn thua gì đâu-cứ để mặc nó bỏ thời gian ra mà tìm tòi.", "eng": "It's no good telling him-leave him to find out in his own sweet time."}, {"viet": "Trời đang mưa''Thảo nào! Tôi cứ băn khoăn là tại sao tôi bị ướt!'.", "eng": "It's raining''No kidding! I wondered why I was getting wet!'."}, {"viet": "Hãy còn quá sớm để biết kết quả thi!", "eng": "It's too soon to know the result of the test!"}, {"viet": "Nó giá 10 pao nhưng tôi bớt đi 20% vì nó không còn mới nữa.", "eng": "It cost me 10 pounds but I'll knock off 20% as it's no longer new."}, {"viet": "Đối với các bác sĩ, thực hiện sự làm chết không đau đớn là trái với luật pháp.", "eng": "It is against the law for doctors to practise euthanasia."}, {"viet": "Tôi đặc biệt hân hạnh được chào mừng ông Vương.", "eng": "It is my special pleasure to welcome Mr. Wang."}, {"viet": "Cái đó khiến nó hoàn toàn luống cuống.", "eng": "It left him at a complete loss for words."}, {"viet": "Nó là cái đồng hồ mới và lúc nào cũng chạy đúng giờ.", "eng": "It's a new watch and keeps good time."}, {"viet": "Nó là ngọn núi cao nhất ở Nhật đấy.", "eng": "It's the highest in Japan."}, {"viet": "Phải có nghị lực mới nói được một điều như thế.", "eng": "It takes character to say a thing like that."}, {"viet": "Tất cả chuyện đó là sự lãng phí thời gian hoàn toàn.", "eng": "It was all a thoroughgoing waste of time."}, {"viet": "Đó không phải là một sự lầm lẫn, anh cố tình mở thư của tôi.", "eng": "It was not a mistake you purposely opened my letter."}, {"viet": "Khắp nơi người ta đều cho rằng cái đó đã thất lạc trong chiến tranh.", "eng": "It was widely supposed to have been lost during the war."}, {"viet": "Nữa này, một cái ghế, nữa này, hai chiếc thảm v. v.", "eng": "Item, one chair, item, two carpets, etc."}, {"viet": "Này John tôi đang họp.", "eng": "John, I'm right in the middle of a meeting."}, {"viet": "Chỉ nói xin lỗi thôi không làm cô ấy nguôi đâu.", "eng": "Just saying sorry is not going to appease her."}, {"viet": "Later that day và on the way home là những cụm từ.", "eng": "Later that day and on the way home are phrases."}, {"viet": "Chúng ta ấn định với nhau vào tuần tới nhé.", "eng": "Let's fix it for next week."}, {"viet": "Bảo đảm rằng tất cả chứng từ phải phù hợp với thư tín dụng.", "eng": "Make sure that all documents are in agreement with the credit."}, {"viet": "Nhiều người đã bị tử thương trong các cuộc ném bom.", "eng": "Many people were fatally wounded during the bomb attacks."}, {"viet": "Đặt kế hoạch và điều khiển một cuộc vận động, vụ trộm, đề án.", "eng": "Mastermind a campaign, robbery, project."}, {"viet": "Chúng tôi xin được giới thiệu kiểu máy tính sắp xếp dữ liệu điện tử mới mà chúng tôi đã sản xuất gần đây?", "eng": "May we offer you the new model of electronic organizer we have recently developed?"}, {"viet": "Đa số các nước châu Âu theo chế độ dân chủ.", "eng": "Most European countries are democracies."}, {"viet": "Ông Vương sẽ rất vui khi nghe điều đó.", "eng": "Mr. Wang will be happy to hear it."}, {"viet": "Ắc quy ô tô tôi đã hết điện, cần phải nạp lại.", "eng": "My car battery has run down, it needs recharging."}, {"viet": "Công ty của các bạn không có một ngôi biệt thự ở Atani.", "eng": "My friends'company owns a villa in Atami."}, {"viet": "Ngôi nhà mới của tôi chưa được nối vào các nguồn cung cấp.", "eng": "My new house is not yet connected to the mains."}, {"viet": "Ngày nghỉ cuối tuần của tôi thật chán-tôi chỉ có hết quanh quẩn trong nhà lại xem ti vi.", "eng": "My weekend was boring-I just floated about the house or watched TV."}, {"viet": "Những em bé gái mới sinh đã làm lộ rõ vẻ nữ tính trong cô ta.", "eng": "Newborn babies bring out the woman in her."}, {"viet": "Không, ồ nhìn này, tôi có một gói thuốc khác ở đây.", "eng": "No, oh look, i've got another packet here."}, {"viet": "Không ai nghĩ rằng anh ấy có thể chịu được 15 hiệp, ấy thế mà anh đã đánh đến hiệp cuối cùng.", "eng": "Nobody thought he'd last 15 rounds, but he went the full distance."}, {"viet": "Bây giờ số mật của ông đúng rồi.", "eng": "Now your secret number is correct."}, {"viet": "Ồ, coi chừng! và Ôi là những thán từ.", "eng": "Oh, look out! and Ow! are exclamations."}, {"viet": "Kiểm tra kỹ lưỡng hơn, thì thấy bức hoạ là đồ giả.", "eng": "On closer examination the painting proved to be a fake."}, {"viet": "Một động tác cựa quậy thì mày sẽ chết!', nó nói, chĩa súng vào tôi.", "eng": "One false move and you're dead!'he said, pointing a gun at me."}, {"viet": "Chỉ những người có thể trạng khoẻ mới nên leo núi.", "eng": "Only people with a strong constitution should go climbing."}, {"viet": "Cuộc chạy trốn của chúng tôi chẳng kém gì một phép màu.", "eng": "Our escape was little short of miraculous."}, {"viet": "Câu chuyện mới ly kỳ của chúng tôi phát làm nhiều buổi sẽ bắt đầu tối nay lúc 7.30.", "eng": "Our new serial thriller begins at 7.30 this evening."}, {"viet": "Khẩu hiệu của chúng tôi là:'Tiến hoá chứ không cách mạng'.", "eng": "Our watchword is:'Evolution, not revolution'."}, {"viet": "Hành khách đứng lên và duỗi chân tay khi đoàn tàu vào ga.", "eng": "Passengers stood and stretched as the train pulled into the station."}, {"viet": "Người ta luôn bình luận về vẻ ngoài của chị tôi.", "eng": "People were always commenting on my sister's look."}, {"viet": "Mời ngồi và xin cứ tự nhiên.", "eng": "Please sit down and make yourselves comfortable."}, {"viet": "Nhân viên bảo vệ công viên thỉnh thoảng đi tuần tra trên các con sông, nhưng bạn tự chịu trách nhiệm về sự rủi ro khi đi du lịch ở các con sông này.", "eng": "Rangers patrol the waters from time to time, but you travel the rivers at your own risk."}, {"viet": "Ghế ngồi ở rạp chiếu bóng thường được đánh số.", "eng": "Seats in the cinema are usually numbered."}, {"viet": "Giá cổ phần bỗng tụt xuống thấp do sự dự báo ảm đạm về kinh tế.", "eng": "Share prices plunged as a result of the gloomy economic forecast."}, {"viet": "Cô ta luôn khéo xoay tiền anh trai của cô ấy.", "eng": "She's always scrounging off her brother."}, {"viet": "Cô ta dự thi lấy chứng chỉ đầu tiên của Cambridge.", "eng": "She's going in for the Cambridge First Certificate."}, {"viet": "Cô ta không do dự nói với chúng tôi những gì cô ta nghĩ.", "eng": "She's not slow to tell us what she thinks."}, {"viet": "Là một cô bé lên mười mà nó nói năng lưu loát khác thường.", "eng": "She's unusually articulate for a ten-year-old."}, {"viet": "Cô ta trả lời rằng cô muốn ngồi ăn một mình.", "eng": "She answered that she preferred to eat alone."}, {"viet": "Cô ta không thể chờ đợi có được tiếng trẻ con trong nhà.", "eng": "She can't wait for the patter of tiny feet."}, {"viet": "Cô ấy không thể mở được cửa cho dù đã dùng hết sức mình.", "eng": "She couldn't open the door, even by exerting all her strength."}, {"viet": "Chị ấy không thừa nhận tất cả trách nhiệm đối với hành động của họ.", "eng": "She disavowed all responsibility for their action."}, {"viet": "Cô ta cảm thấy rất bấp bênh về cuộc hôn nhân của cô ta.", "eng": "She feels very insecure about her marriage."}, {"viet": "Cô ấy đưa cho anh ấy một lá thư để gửi máy bay.", "eng": "She gave him a letter to post by airmail."}, {"viet": "Cô ta có một cơ hội tuyệt vời nhưng đã để tuột mất.", "eng": "She had a wonderful opportunity, but she muffed it."}, {"viet": "Cô ta có thành kiến đối với nhạc hiện đại.", "eng": "She has a prejudice against modern music."}, {"viet": "Từ khi lấy chồng cô ta biến đổi.", "eng": "She has undergone a change since she was married."}, {"viet": "Cô ấy hoàn toàn bị lu mờ trước em gái, thông minh hơn. đẹp hơn và vui tươi hơn.", "eng": "She is completely eclipsed by her sister, who is clever, prettier, and more amusing."}, {"viet": "Cô ta phát hết các giấy mời mà không tham khảo ý kiến cấp trên của cô.", "eng": "She issued all these invitations without any reference to her superiors."}, {"viet": "Cô ấy ở xa trường hơn tôi.", "eng": "She lives farther from the school than I do."}, {"viet": "Bà ta không phân biệt đối xử giữa hai người con trai của bà ta.", "eng": "She makes no difference between her two sons."}, {"viet": "Cô ta mở ngăn kéo lấy ra một đôi bít tất.", "eng": "She opened the drawer and took out a pair of socks."}, {"viet": "Bà ta kéo ghế lùi ra khỏi bàn, vẻ no nê.", "eng": "She pushed her chair back from the table, satiated."}, {"viet": "Cô ấy lao vào phòng báo cho chúng tôi tin tức.", "eng": "She rushed into the room to tell us the news."}, {"viet": "Cô ta khư khư giữ lấy các đặc quyền của cô ta.", "eng": "She's jealous of her privileges."}, {"viet": "Cô ấy nói thứ ba nhưng lại muốn nói là thứ năm.", "eng": "She said Tuesday, but she meant Thursday."}, {"viet": "Cô ta lắc lắc nó để biết chắc là không có gì ở bên trong.", "eng": "She shook it to make certain there was nothing inside."}, {"viet": "Cô ấy bỏ ra một tiếng đồng hồ để chải chuốt trước khi ra khỏi nhà.", "eng": "She spent an hour titivating before going out."}, {"viet": "Cô ta gian lận 1000 đô la trong quỹ bảo hiểm xã hội.", "eng": "She swindled 1000 dollars out of social security."}, {"viet": "Cô ta cố làm ra bộ ngây thơ đối với tôi.", "eng": "She tried to come the innocent with me."}, {"viet": "Cô ta muốn trở thành một nữ diễn viên nhưng bố mẹ cô phản đối.", "eng": "She wants to be an actress, but her parents disapprove."}, {"viet": "Cô ta đánh mạnh vào đầu anh ta bằng cái xoong.", "eng": "She was bashing him over the head with a saucepan."}, {"viet": "Cô ta được tiễn đưa lưu luyến ở sân bay.", "eng": "She was given a good send-off at the airport."}, {"viet": "Khi nhắc đến tôi, cô thường lăng mạ tôi rất thô bỉ.", "eng": "She was often quite scurrilous in her references to me."}, {"viet": "Chị ấy đứng quá gần lò lửa, nên áo bị bắt lửa.", "eng": "She was standing too close to the fireplace and her dress caught fire."}, {"viet": "Bà ấy lo buồn đến sinh bệnh về cậu con trai bị mất tích.", "eng": "She was worried sick about her missing son."}, {"viet": "Bà ta lui vào để tham khảo các cố vấn của bà trước khi công bố một quyết định.", "eng": "She withdrew to confer with her advisers before announcing a decision."}, {"viet": "Cô ta viết về chính trị cho một tờ tuần báo.", "eng": "She writes on politics for a weekly journal."}, {"viet": "Chỉ cho tôi cách anh cầm chúng đi.", "eng": "Show me how you hold them."}, {"viet": "Vì chúng tôi đã ăn rồi nên không thể thưởng thức được tài nấu ăn của bà ấy.", "eng": "Since we'd already eaten, we couldn't do justice to her cooking."}, {"viet": "Đẩy mép tấm ván vào đường rãnh.", "eng": "Slot the edge of the panel into the groove."}, {"viet": "Vậy các anh có món gì đặc biệt không?", "eng": "So do you have something special?"}, {"viet": "Quân lính đã chặn đường cho nên chúng tôi phải quay lại.", "eng": "Soldiers barred the road so we had to turn back."}, {"viet": "Vài nghị sĩ tuân thủ đường lối của đảng về quốc phòng.", "eng": "Some MPs refused to toe the party line on defense."}, {"viet": "Một số trường học rất xem trọng việc học ngôn ngữ.", "eng": "Some schools lay great emphasis on language study."}, {"viet": "Đôi khi anh ta cũng vui đùa hoà mình, nhưng có những lúc anh ta lại có thể rất ủ rũ.", "eng": "Sometimes he's fun to be with, at other times he can be very moody."}, {"viet": "Sự giúp đỡ đặc biệt dành cho các sinh viên thiếu khả năng học tập.", "eng": "Special help for learning-disabled students."}, {"viet": "Những quốc gia tìm liên minh để được mạnh hơn.", "eng": "States seek to become stronger through alliance."}, {"viet": "Đừng rung chùm chìa khóa anh kêu leng keng như thế!", "eng": "Stop jingling your keys like that!"}, {"viet": "Những học sinh thi tốt là những người hay đặt câu hỏi trong lớp.", "eng": "Students who do well in examinations are the ones who ask questions in class."}, {"viet": "Cách đối xử như thế làm cho bất lỳ ai cũng phải chống đối.", "eng": "Such treatment would make anyone rebel."}, {"viet": "Chắc là anh không có ăn cái thứ đó rồi!", "eng": "Surely you're not going to eat that!"}, {"viet": "Anh cứ tin tôi đi-anh ta sẽ trở thành tổng giám đốc công ty này khi anh ta 30 tuổi.", "eng": "Take it from me-he'll be managing director of this company by the time he's 30."}, {"viet": "Dạy học là một nghề đáng mãn nguyện, cho dù đồng lương có tồi.", "eng": "Teaching is a satisfying profession, even if it is badly paid."}, {"viet": "Bọn khủng bố đã đặt một quả bom 50 pao trong nhà ga.", "eng": "Terrorists placed a 50 pounds bomb in the railway station."}, {"viet": "Đó không phải là cái anh muốn nghe qua sóng phát thanh này.", "eng": "That's not the sort of material you expect to hear coming over the air-waves."}, {"viet": "Vết nứt đó phải cần một thời gian dài mới lành.", "eng": "That cut is taking a long time to heal."}, {"viet": "Tổng cộng là 18 đô la, thưa ông.", "eng": "That'll be 18 dollars altogether, sir."}, {"viet": "Đó là một ý kiến hơi lập dị.", "eng": "That's a pretty flaky idea."}, {"viet": "Đó là một buổi biểu diễn đàn piano thật tuyệt.", "eng": "That was a fantastic piano performance."}, {"viet": "Tai nạn xảy ra ở tại góc đường.", "eng": "The accident has happened at the street corner."}, {"viet": "Sự chấp nhận Trung Quốc vào Liên hiệp Quốc.", "eng": "The admission of China to the United Nations."}, {"viet": "Người Mỹ đã đưa một người lên mặt trăng vào năm 1969.", "eng": "The Americans put a man on the moon in 1969."}, {"viet": "Phái viên của Tổng giám mục Canterbury.", "eng": "The Archbishop of Canterbury's envoy."}, {"viet": "Nhà nghệ sĩ đem thuốc màu theo mình.", "eng": "The artist brought his paints with him."}, {"viet": "Nhà chức trách đã áp dụng các biện pháp để ngăn chặn sự gian lận thuế.", "eng": "The authorities took measures to prevent tax fraud."}, {"viet": "Quả bóng đập vào bộ phận khá nhạy cảm của cơ thể anh ta.", "eng": "The ball hit him on a rather delicate part of his anatomy."}, {"viet": "Nước tắm từ từ rút đi.", "eng": "The bath-water slowly drained away."}, {"viet": "Lễ kỉ niệm hai trăm năm ngày tuyên bố độc lập.", "eng": "The bicentennial of the declaration of independence."}, {"viet": "Cú đấm làm cho anh ta quay tròn ngược lại phía bức tường.", "eng": "The blow sent him spinning back against the wall."}, {"viet": "Cuốn sách thật là hấp dẫn, mặc dầu tựa đề không gây được sự quan tâm.", "eng": "The book is fascinating, despite its uninspiring title."}, {"viet": "Cậu con trai xin phép được đi cùng chúng tôi.", "eng": "The boy begged to be allowed to come with us."}, {"viet": "Màu đỏ tươi của rèm cửa làm chết màu nâu của tấm thảm.", "eng": "The bright red of the curtains kills the brown of the carpet."}, {"viet": "Xe buýt lại đến chậm-thật tồi tệ hết mức!", "eng": "The bus is late again it's absolutely disgraceful!"}, {"viet": "Tàu vũ trụ trở nên rất nóng khi quay về bầu khí quyển địa cầu.", "eng": "The capsule gets very hot on re-entry."}, {"viet": "Chiếc xe đó trượt ngang và đâm ngay vào một thân cây.", "eng": "The car skidded and went into a tree."}, {"viet": "Con mèo im lặng rón rén đi về phía con chim.", "eng": "The cat crept silently towards the bird."}, {"viet": "Nhà vô địch và người thách đấu sẽ gặp nhau tuần sau.", "eng": "The champion and the challenger meet next week."}, {"viet": "Đứa bé bị mắng một trận vì tội ăn cắp trái táo.", "eng": "The child given a good telling-off for stealing apples."}, {"viet": "Trẻ em thích ở trường nhưng chúng thiếu tính kỷ luật.", "eng": "The children are happy at the school, but they lack discipline."}, {"viet": "Bọn trẻ tách ra thành nhiều nhóm.", "eng": "The children split up into groups."}, {"viet": "Gác chuông nhà thờ thon dần về phía đầu.", "eng": "The church steeple tapers toward the top."}, {"viet": "Hai cây kim đồng hồ chỉ số mười hai.", "eng": "The clock hands pointed to twelve."}, {"viet": "Cuộc quyên tiền sẽ được thực hiện sau bài giảng đạo.", "eng": "The collection will be taken up after the sermon."}, {"viet": "Sổ sách của công ti được kiểm tra hàng năm.", "eng": "The company's books are audited every year."}, {"viet": "Công ty tài trợ cho cuộc thi crickê.", "eng": "The company was sponsor for the cricket tournament."}, {"viet": "Kết cấu của quang phổ mặt trời.", "eng": "The constitution of the solar spectrum."}, {"viet": "Hội đồng đã cho phép chúng tôi khởi công xây dựng.", "eng": "The council have given us the go-ahead to start building."}, {"viet": "Tòa án phạt anh ta 500 bảng Anh.", "eng": "The court fined him 500 £."}, {"viet": "Đám đông reo hò cổ vũ những vận động viên chạy khi họ bắt đầu vòng chạy cuối cùng.", "eng": "The crowd cheered the runners on as they started the last lap."}, {"viet": "Khách hàng làm theo đề nghị của nhân viên ngân hàng.", "eng": "The customer did as the clerk suggested."}, {"viet": "Cuộc thảo luận đã chuyển sang cuộc cãi vã vô ý thức.", "eng": "The debate turned into thoughtless bickering."}, {"viet": "Sự phụ thuộc của kết quả vào nguyên nhân.", "eng": "The dependence of an effect upon a cause."}, {"viet": "Bữa ăn tối đó là một dịp thoải mái, không khách khí.", "eng": "The dinner was a relaxed, unceremonious occasion."}, {"viet": "Bác sĩ khuyên tôi phải nghỉ ngơi hoàn toàn.", "eng": "The doctor advised me to take a complete rest."}, {"viet": "Con chó bị xén cụt lông để đi trình diễn.", "eng": "The dog's fur was clipped short for the show."}, {"viet": "Tay nắm cửa bị văng ra.", "eng": "The door handle has broken off."}, {"viet": "Lệ phí sẽ được trừ vào tiền lương hàng tuần của anh ta.", "eng": "The dues will be deducted from his weekly pay cheques."}, {"viet": "Cuộc tuyển cử đã làm cho Đảng chỉ còn lại một số nhỏ.", "eng": "The election reduced the Party to a rump."}, {"viet": "Tiếng Anh có quan hệ họ hàng với tiếng Đức.", "eng": "The English language has an affinity with German."}, {"viet": "Sự xác định thành phần chính xác của một chất.", "eng": "The exact composition of a substance."}, {"viet": "Ở một số quốc gia án phạt cao nhất của luật pháp là án tử hình.", "eng": "The extreme penalty of the law in some countries is the death penalty."}, {"viet": "Những người nông dân xếp táo theo nhiều loại khác nhau.", "eng": "The farmers graded the apples into several sizes."}, {"viet": "Bộ phim đã gói gọn nhiều năm trong nửa giờ.", "eng": "The film compresses several years into haft an hour."}, {"viet": "Người lính cứu hỏa đó chết ngạt vì khói.", "eng": "The fireman was suffocated by the fumes."}, {"viet": "Cú đánh gục đầu tiên ngay khi bắt đầu trận đấu.", "eng": "The first knockdown came just after the beginning of the fight."}, {"viet": "Những bông hoa xen với nhau tạo thành một chỉnh thể hài hoà.", "eng": "The flowers blend into a harmonious whole."}, {"viet": "Ngày mùng 4 tháng 7 là quốc khánh của Mĩ.", "eng": "The Fourth of July is a national holiday of U. S."}, {"viet": "Trò chơi này hơi trẻ con đối với trẻ lên chín.", "eng": "The games were a little babyish for nine year olds."}, {"viet": "Các dạng sở hữu cách của các đại từ I, we và she là my/mine, our/ours và her/hers.", "eng": "The genitive forms of the pronouns I, we and She are my/mine our/ours and her/hers."}, {"viet": "Hàng sẽ được giao miễn vận phí tới kho của ông.", "eng": "The goods will be delivered Franco to your warehouse."}, {"viet": "Chính phủ đã hứa áp dụng những biện pháp để giúp đỡ người nghèo.", "eng": "The government has promised to take measure to help the unemployed."}, {"viet": "Chính phủ đảm nhận tài trợ cho các phí tổn ban đầu của kế hoạch đó.", "eng": "The government underwrote the initial costs of the scheme."}, {"viet": "Người Hy Lạp gây những giống chó nhỏ xíu.", "eng": "The Greeks developed tiny lap-dogs."}, {"viet": "Những vị khách bày tỏ lời cảm ơn của họ trước lúc ra về.", "eng": "The guests expressed their thanks before leaving."}, {"viet": "Nhiệt từ cát trắng bức xạ tạo thành một ảo ảnh.", "eng": "The heat reflected from the white sand formed a mirage."}, {"viet": "Lá số tử vi cung Xử Nữ là “ Hãy phóng khoáng khi tiêu tiền cho phụ nữ ”.", "eng": "The horoscope for Virgo is Be generous when spending money on women."}, {"viet": "Những con chó săn đã đánh hơi thấy con cáo.", "eng": "The hounds had winded the fox."}, {"viet": "Những nhu cầu về nhà ở trong những khu phố nội thành của chúng ta đã bị quan niệm sai ngay từ ban đầu.", "eng": "The housing needs of our inner cities have been misconceived from the start."}, {"viet": "Sự không chắc bắt lại được hắn.", "eng": "The improbability of his being recaptured."}, {"viet": "Cuộc thẩm tra đưa ra phán quyết ủng hộ những người chống đối kế hoạch.", "eng": "The inquiry pronounced for the protesters against the scheme."}, {"viet": "Vấn đề nghỉ uống trà của nhân viên luôn là một vấn đề không rõ ràng, không hoàn toàn cho phép nhưng cũng không loại bỏ.", "eng": "The issue of staff-coffee-breaks has always something of a grey area, not strictly allowed but not ruled out either."}, {"viet": "Việc xét xử đó đã có lợi cho bị cáo.", "eng": "The judgement was given in favour of the accused."}, {"viet": "Ứng cử viên của Công đảng sẽ đi vận động ở khu vực bầu cử vào tháng sau.", "eng": "The Labour candidate will canvass the constituency next month."}, {"viet": "Những con số về thương mại rất đáng phấn khởi.", "eng": "The latest trade figures are very encouraging."}, {"viet": "Càng nói ít về toàn bộ vụ đó, tôi càng sung sướng.", "eng": "The less said about the whole affair, the happier I'll be."}, {"viet": "Sư tử là vua của muôn thú.", "eng": "The lion is the king of animals."}, {"viet": "Sự mất mát đó là một thảm kịch đối với tất cả những người có liên quan.", "eng": "The loss was a tragedy for all concerned."}, {"viet": "Vẻ đẹp hùng vĩ của cảnh núi non.", "eng": "The majesty of the mountain scenery."}, {"viet": "Sự kết hợp y học cổ truyền với tây y.", "eng": "The marriage between traditional medicine and Western medicine."}, {"viet": "Cuộc họp tan vỡ giữa cảnh hỗn loạn, mất trật tự.", "eng": "The meeting broke up amid rowdy scenes."}, {"viet": "Quân đội được gọi đến để giải quyết vụ bạo động.", "eng": "The military were called in to deal with the riot."}, {"viet": "Lễ hội powwow hiện đại là một dịp lễ ăn mừng việc trở thành người Mỹ bản địa.", "eng": "The modern powwow is a celebration of being Native American."}, {"viet": "Loại tiêu biểu nhất là rượu đế Thiệu Hưng, nó được làm từ lúa gạo và không mạnh bằng rượu Mao Đài, một loại rượu dịu.", "eng": "The most typical one is Shaoxing rice wine, which is made from rice and is not as strong as Maotai, a kind of mild wine."}, {"viet": "Tiếng nhạc to quá làm tôi ù cả tai.", "eng": "The music was so loud it made my ears ring."}, {"viet": "Những toà nhà mới làm thay đổi diện mạo của làng.", "eng": "The new buildings have changed the character of the village."}, {"viet": "Vở kịch mới ở Nhà hát quốc gia là một thành công vang dội.", "eng": "The new play at the National theatre's a wow."}, {"viet": "Tin Tổng thống chết đã được loan báo trong một buổi phát thanh.", "eng": "The news of the President's death was given out in a radio broadcast."}, {"viet": "Sống ở miền bắc thì ít đắt đỏ hơn là sống ở miền nam.", "eng": "The North is less expensive to live in than the south."}, {"viet": "Vật đó không còn chuyển động nữa.", "eng": "The object is no longer in motion."}, {"viet": "Bà lão sống ở nhà kế bên.", "eng": "The old girl who lives next door."}, {"viet": "Gánh nặng phải nuôi năm con.", "eng": "The onus of bringing up five children."}, {"viet": "Tiếp theo việc lật đổ chế độ cũ là một thời kỳ vô chính phủ.", "eng": "The overthrow of the regime was followed by a period of anarchy."}, {"viet": "Bữa tiệc trở nên vui vẻ om sòm sau khi họ mang thêm rượu.", "eng": "The party got quite hilarious after they brought more wine."}, {"viet": "Bệnh nhân đó quằn quại đau đớn trên giường.", "eng": "The patient was writhing about on the bed in agony."}, {"viet": "Người mất mát nhiều nhất là ông giám đốc.", "eng": "The person with the most to lose is the director."}, {"viet": "Những viên thuốc lẽ ra có thể đã chữa khỏi cho anh ta nếu như anh ta chỉ cần uống đều đặn.", "eng": "The pills might have cured him, if only he'd taken them regularly."}, {"viet": "Máy bay vừa mới cất cánh đây thôi.", "eng": "The plane is taking off as we speak."}, {"viet": "Vở kịch sẽ được lưu diễn ở các tỉnh vào tháng tới.", "eng": "The play will tour the provinces next month."}, {"viet": "Cảnh sát không thể chứng minh lúc đó hắn ở đâu.", "eng": "The police can't establish where he was at that time."}, {"viet": "Cảnh sát thẩm vấn mọi người trong phòng.", "eng": "The police questioned everybody in the room."}, {"viet": "Chó lông xù là vật cưng phổ biến nuôi trong nhà.", "eng": "The poodle is a popular house pet."}, {"viet": "Quân đội hùng mạnh đánh bại kẻ thù.", "eng": "The powerful army vanquished the enemy."}, {"viet": "Tổng thống của một nước được kêu bằng His.", "eng": "The president of a country is addressed as His."}, {"viet": "Nói trên truyền hình, Thủ tướng phủ nhận các tin cho rằng.", "eng": "The Prime Minister, speaking on television, denied reports that."}, {"viet": "Vấn đề đó làm tôi buồn phiền một độ.", "eng": "The problem's been gnawing at me for sometime."}, {"viet": "Lời hứa tặng thưởng có thể làm tăng quyết tâm của họ lên.", "eng": "The promise of a reward might stiffen their resolve."}, {"viet": "Những sự trừng phạt đối với trẻ con là quá nghiêm khắc.", "eng": "The punishments inflicted on the children were too severe."}, {"viet": "Con thỏ rừng ngồi đó không nhúc nhích, bị thôi miên bởi ánh sáng đèn pha chói loà của chúng tôi.", "eng": "The rabbit sat without moving, fascinated by the glare of our headlights."}, {"viet": "Lý do vắng mặt hắn nêu ra rõ ràng là bịa đặt.", "eng": "The reason he gave for his absence was obviously fabricated."}, {"viet": "Tàn quân của một đạo quân tan tác.", "eng": "The remnants of a shattered army."}, {"viet": "Bây giờ kết quả cuộc bầu cử đã được công bố.", "eng": "The result of the poll has now been declared."}, {"viet": "Con sông đó chảy ra biển gần Portsmouth.", "eng": "The river flows into the sea near Portsmouth."}, {"viet": "Sự lãng mạn của Phương Đông đã khơi dậy tinh thần phiêu lưu của anh ấy.", "eng": "The romance of the East had appealed to his adventurous spirit."}, {"viet": "Những luật đối với thói du côn là hoàn toàn rõ ràng.", "eng": "The rules with respect to bullying are quite clear."}, {"viet": "Tuy nhiên nước xốt đã được làm sẵn.", "eng": "The sauce is ready made, however."}, {"viet": "Người buôn sắt vụn có một cái máy đập bẹp xe ô tô.", "eng": "The scrap merchant has a machine which crushes cars."}, {"viet": "Các lá đài hút hết các tia màu đỏ.", "eng": "The sepals soak up the red rays."}, {"viet": "Con tàu va phải một vài tảng đá và đã chìm.", "eng": "The ship hit some rocks and sank."}, {"viet": "Người bán hàng cân thiếu cho chúng ta: đáng lẽ 10 kg, chúng ta chỉ nhận được có 7, 5 kg.", "eng": "The shopkeeper gave us short weight: we got 7.5 kilos instead of 10 kilos."}, {"viet": "Chậu rửa bát trào nước và làm ướt sũng nhà bếp.", "eng": "The sink overflowed and swamped the kitchen."}, {"viet": "Vẻ khoái trá của một con cóc được ăn lót lòng bằng các con ruồi béo của đầm lầy.", "eng": "The smug look of a toad breakfasting on fat marsh flies."}, {"viet": "Bài hát được bắt giọng quá thấp đối với tôi.", "eng": "The song is pitched too low for me."}, {"viet": "Vận tốc tối đa là 40 dặm Anh giờ.", "eng": "The speed limit is 40 miles per hour."}, {"viet": "Bức tượng được tạc bằng đá.", "eng": "The statue was carved out of stone."}, {"viet": "Phố đông đến nỗi xe ô tô không thể vượt được đi qua một rào chắn, người lính gác, một trạm kiểm soát, v. v.", "eng": "The street was so crowded that cars were unable to pass pass a barrier, sentry, checkpoint, etc."}, {"viet": "Sự tăng đột ngột của giá dầu dẫn tới một cuộc khủng hoảng về kinh tế.", "eng": "The sudden rise in oil prices led to an economic crisis."}, {"viet": "Thực đơn của suất ăn để giá hợp lí.", "eng": "The table d'hote menu offers good value."}, {"viet": "Cô giáo cảnh cáo chúng là sẽ phạt bất cứ đứa nào vi phạm kỷ luật.", "eng": "The teacher warned them that she would punish anyone who stepped out of line."}, {"viet": "Các điều khoản của hộp đang phải được xem xét lại.", "eng": "The terms of the contract are subject to review."}, {"viet": "Sự đe doạ của chiến tranh làm cho cả nước lo lắng.", "eng": "The threat of war overshadowed the nation."}, {"viet": "Trung tâm của thành phố đã thay đổi không còn nhận ra được.", "eng": "The town centre had changed beyond all recognition."}, {"viet": "Những câu nói sáo mùi mẫn của cuốn tiểu thuyết lãng mạn.", "eng": "The treacly clichés of romantic fiction."}, {"viet": "Hai công ty đã hợp sức để triển khai một kiểu ô tô đua mới.", "eng": "The two companies have teamed up to develop a new racing car."}, {"viet": "Phần bên dưới xe bị gỉ rất nhiều.", "eng": "The underneath of the car was badly rusted."}, {"viet": "Bức hoạ của Van Gogh đã không đạt được giá thấp nhất đặt ra và đã được thu hồi lại.", "eng": "The Van Gogh failed to reach its reserve and was withdrawn."}, {"viet": "Nguyên âm trong'caught'là nguyên âm dài, trong'cot'là ngắn.", "eng": "The vowel sound in'caught'is long, in'cot'it is short."}, {"viet": "Gương mặt sạm nắng gió của một người thuỷ thủ già.", "eng": "The weather-beaten face of an old sailor."}, {"viet": "Cả làng kéo ra đón vị anh hùng.", "eng": "The whole village turned out to welcome the hero."}, {"viet": "Phụ nữ thường dừng lại ở chợ để trò chuyện qua loa cho hết giờ.", "eng": "The women would stop in the market to pass the time of day."}, {"viet": "Tên tuổi của nhà văn đó bị lu mờ đi nhiều năm sau khi ông ta chết.", "eng": "The writer's name remained in eclipse for many years after his death."}, {"viet": "Sự phát triển của họ so ra thua kém với các quốc gia lân bang.", "eng": "Their development compares poorly with that of neighbour nations."}, {"viet": "Những hứa hẹn của họ chẳng giúp gì bao nhiêu vào việc giải quyết những vấn đề trước mắt của chúng ta.", "eng": "Their promises don't go very far towards solving our present problems."}, {"viet": "Sau đó đáy biển trở thành đất liền.", "eng": "Then the bottom of the sea became dry land."}, {"viet": "Trước sáu trang có một bức tranh.", "eng": "There's a picture six pages further back."}, {"viet": "Thật không thể biết được sau đây nó sẽ còn nghĩ ra cái gì nữa.", "eng": "There's no telling what he'll think up next."}, {"viet": "Có hàng loạt lý do cho điều này.", "eng": "There are a whole bevy of reasons for this."}, {"viet": "Có nhiều máy móc luyện tập và rất sạch sẽ.", "eng": "There are plenty of machines and it's clean."}, {"viet": "Hình như không có giấy gì cả.", "eng": "There doesn't seem to be any."}, {"viet": "Một ngọn đèn treo trên bàn.", "eng": "There is a lamp hung above the table."}, {"viet": "Không có triển vọng giải quyết được cuộc tranh chấp.", "eng": "There is no prospect of a settlement of the dispute."}, {"viet": "Có một cái trên bàn kìa.", "eng": "There's one on your table."}, {"viet": "Sự hoang mang nổi lên tức thì khi chuông báo động réo lên.", "eng": "There was an immediate panic when the alarm sounded."}, {"viet": "Có hơn 5000 loài khủng long.", "eng": "There were more than 5,000 kinds of dinosaurs."}, {"viet": "Các phanh này cần phải ăn hơn.", "eng": "These brakes should be more responsive."}, {"viet": "Những cửa sổ mới này làm cho gian phòng sáng sủa hơn rất nhiều.", "eng": "These new windows have lightened the room considerably."}, {"viet": "Họ luôn luôn kêu ca hết cái này đến cái nọ.", "eng": "They're always beefing about something or other."}, {"viet": "Khi ra nước ngoài họ cất đồ đạc vào kho.", "eng": "They've stored their furniture while they go abroad."}, {"viet": "Họ nghèo khổ quá nên phải dè sẻn.", "eng": "They are so poor that they have to skimp."}, {"viet": "Trong trường hợp khẩn cấp họ có thể nhanh chóng đến trạm của họ.", "eng": "They can get to their stations quickly in an emergency."}, {"viet": "Họ đã bàn luận về đầu tư, tình trạng nền kinh tế và vân vân.", "eng": "They discussed investments, the state of the economy and so forth."}, {"viet": "Họ tạo ra một sự kích thích mới cho nền kinh tế ốm yếu.", "eng": "They gave a new impetus to the ailing economy."}, {"viet": "Họ chưa đồng ý với những yêu cầu của chúng ta, nhưng rõ ràng họ đã nhụt đi.", "eng": "They have not yet agreed to our requests but they are clearly weakening."}, {"viet": "Họ đã tìm con chó bị mất khắp nơi.", "eng": "They looked far and wide for the missing dog."}, {"viet": "Họ nhận thấy họ không được đón tiếp và bỏ đi.", "eng": "They perceived that they were unwelcome and left."}, {"viet": "Họ nói họ sẽ giúp chúng tôi nhưng rồi lại rút lại lời hứa.", "eng": "They said they would help us, but then finked out."}, {"viet": "Họ đứng ôm chặt lấy nhau.", "eng": "They stood clasped in each other's arms."}, {"viet": "Họ vẫy tay ra hiệu cho chúng tôi ngồi lại tại chỗ.", "eng": "They waved to us to stay where we were."}, {"viet": "Họ không quen với ý tưởng dân chủ.", "eng": "They were not used to the idea of democracy."}, {"viet": "Công việc không tiến triển nhanh như chúng ta hy vọng.", "eng": "Things are not moving as fast as we hoped."}, {"viet": "Quán cà phê này là điểm tụ họp của các văn nghệ sĩ.", "eng": "This café is a rendezvous for writers and artists."}, {"viet": "Chế độ ăn kiêng này cho phép anh uống mỗi ngày một cốc rượu vang.", "eng": "This diet allows you one glass of wine a day."}, {"viet": "Căn nhà này thật sự không chịu được bão vì mái nhà thấm dột.", "eng": "This house isn't exactly storm proof leaks."}, {"viet": "Đây là thông báo cuối cùng mời hành khách chuyến bay BA 199 đi Rome.", "eng": "This is the last call for passengers travelling on flight BA 199 to Rome."}, {"viet": "Bản đồ này được thiết kế để khoảng cách con đường có thể dễ tính.", "eng": "This map was designed so that distances by road are easily calculable."}, {"viet": "Nước hoa này cũng không che đậy được cái mùi khó chịu.", "eng": "This perfume won't mask the unpleasant smell."}, {"viet": "Hình thức này không thể áp dụng được trong trường hợp của anh.", "eng": "This section of the form is not applicable in your case."}, {"viet": "Vacxin này sẽ đem lại cho anh khả năng miễn dịch trong hai năm.", "eng": "This vaccine will give you immunity for two years."}, {"viet": "Mặc dù không bảnh trai nhưng người bán hàng đã lôi cuốn được khách hàng bằng cử chỉ lịch sự và hiếu khách.", "eng": "Though not homely, the salesman attracted the customers by being polite and helpful."}, {"viet": "Tom là con trai thứ hai, nó còn có một người anh.", "eng": "Tom is the second son-he has an elder brother."}, {"viet": "Theo quy định hiện hành, anh không được phép mang các con vật vào trong nước.", "eng": "Under existing regulations, you are not allowed to bring animals into the country."}, {"viet": "Tôi quên rằng David đã từng dạy cậu.", "eng": "Was forgetting that David used to teach you."}, {"viet": "Chúng ta sẽ đi xe lửa đến tận London, sau đó sẽ đi xe buýt đường dài.", "eng": "We'll go by train as far as London, and then take a coach."}, {"viet": "Chúng tôi sắp cưới nhau.''Cậu không đùa đấy chứ!'.", "eng": "We're going to get married.''You don't say!'."}, {"viet": "Chúng tôi đã ở lại thăm dì Sophie quá lâu.", "eng": "We've already overstayed our visit to Aunt Sophie."}, {"viet": "Chúng tôi biến phòng ngủ nhỏ nhất thành phòng dành riêng cho cháu bé mới sinh.", "eng": "We've turned the smallest bedroom into a nursery for our new baby."}, {"viet": "Chúng ta đang bay ở độ cao 20.000 phít.", "eng": "We are flying at an altitude of 20000 feet."}, {"viet": "Sáng hôm sau chúng tôi thức dậy trong cơn mưa nhẹ.", "eng": "We awoke next morning to a fine drizzle."}, {"viet": "Chúng ta có thể đi xe đạp đến đó vì chỗ đó không xa đây lắm.", "eng": "We can go there by bike since it's not very far from here."}, {"viet": "Chúng tôi không đưa được chiếc đàn pianô qua cửa.", "eng": "We couldn't get the piano through the door."}, {"viet": "Mỗi người chúng tôi góp vào 2 pao và cử John đi mua thức ăn cho mọi người.", "eng": "We each put 2 pounds in the kitty, and then sent John to buy food for everybody."}, {"viet": "Chúng ta đã qua một kỳ nghỉ chán ngắt-ngày nào trời cũng mưa.", "eng": "We had a mouldy holiday-it rained every day."}, {"viet": "Chúng tôi có một thặng dư thương mại là 400 triệu pao.", "eng": "We have a trade surplus of 400 million pounds."}, {"viet": "Chúng tôi phải luôn luôn tỉnh táo để rình thời cơ.", "eng": "We have to be alert the time and look for our opportunity."}, {"viet": "Chúng tôi để đèn bởi vì lũ trẻ sợ bóng tối.", "eng": "We leave that light on because the children are frightened."}, {"viet": "Chúng tôi dọn đến đây một năm trước mà tôi vẫn còn chưa biết hết mọi thứ ở đâu nữa là.", "eng": "We moved here a year ago, and I still don't know where everything is."}, {"viet": "Chúng ta cần phải cố gắng hệ thống hoá cách làm sổ sách kế toán.", "eng": "We must try to systematize the way we do the accounts."}, {"viet": "Chúng tôi hứa sẽ thanh toán đầy đủ hóa đơn ngay sau đó.", "eng": "We promise to make full settlement of the bill immediate afterwards."}, {"viet": "Chúng ta sẽ đạt được thắng lợi, khi thắng lợi đạt được.", "eng": "We shall achieve success, when success shall be achieved."}, {"viet": "Chúng tôi đoán là anh ta chắc bị tai nạn.", "eng": "We surmised that he must have had accident."}, {"viet": "Chúng tôi xem một chương trình về du lịch qua sa mạc.", "eng": "We watched a programme about travelling through the desert."}, {"viet": "Một sự thôi thúc bất ngờ đã bắt chúng tôi chạy.", "eng": "We were seized by a sudden impulse to run."}, {"viet": "Chúng tôi muốn biết là liệu các ông có thể cho chúng tôi một mức giá tốt hơn cho mặt hàng này nếu chúng đặt 1000 bộ hay không.", "eng": "We would like to know whether you could give us a better price for the product if we placed an order for 1,000 sets."}, {"viet": "À, tôi nghĩ bây giờ tôi nên xuất viện.", "eng": "Well, I think I'd better leave now."}, {"viet": "Lão luyện trong mánh khoé quyến rũ.", "eng": "Well practiced in the arts of seduction."}, {"viet": "Thật đáng tiếc khi nhìn thấy tất cả chỗ thực phẩm đó bị uổng phí.", "eng": "What a pity to see all the foods go to waste."}, {"viet": "Tôi có thể lấy gì cho bạn uống đây?", "eng": "What can I get you to drink?"}, {"viet": "Cô ta muốn làm gì sau khi ra trường?", "eng": "What does she want to do when she leaves school?"}, {"viet": "Khí hậu ở Luân đôn thế nào?", "eng": "What is the climate like in London?"}, {"viet": "Các sản phẩm nào của Nhật được ưa chuộng ở nước bạn?", "eng": "What Japanese products are popular in your country?"}, {"viet": "Hôm nay thời tiết thế nào?", "eng": "What's the weather like today?"}, {"viet": "Bạn sẽ làm gì với món tiền phụ trội đó?", "eng": "What would you do wish the extra money?"}, {"viet": "Khi anh ấy yêu cầu tôi lấy anh, tôi nói đồng ý.", "eng": "When he asked me to marry him I said yes."}, {"viet": "Hồ bơi mở cửa vào lúc nào trong ngày?", "eng": "When is your swimming pool open in a day?"}, {"viet": "Khi xúp gần cạn hết, phía gần với người ăn có thể được nâng nhẹ lên.", "eng": "When the soup gets short toward the end, the side close to the diner can be slightly raised."}, {"viet": "Cứ mỗi lần anh ấy cử động, vết thương lại gây đau buốt lên suốt dọc cánh tay anh.", "eng": "Whenever he moved, the wound sent pains all along his arm."}, {"viet": "Chúng ta đi đâu nhỉ?, Đi công viên nhé?", "eng": "Where shall we go?, What about the park?"}, {"viet": "Sơn nào hợp với bên trong nhà?", "eng": "Which paint is suitable for the inside of a house?"}, {"viet": "Các công ty công nghệ lớn ở nước bạn là những công ty nào?", "eng": "Who are the big technology companies in your country?"}, {"viet": "Sao lại có quá nhiều người ngồi ở chỗ không có mái che vậy?", "eng": "Why are so many people sitting in the bleachers?"}, {"viet": "Sao tôi lại không nghĩ đến việc đó nhỉ?", "eng": "Why haven't I thought of that?"}, {"viet": "Xin bác vui lòng cho cháu một miếng băng dán cá nhân ạ?", "eng": "Will you give me a Band-Aid, please?"}, {"viet": "Nếu như biết suy tính trước một chút chúng ta đã mua được căn nhà mà chúng ta thực sự muốn mua rồi.", "eng": "With a little more forethought we could have bought the house we really wanted."}, {"viet": "Nghề chạm gỗ là một nghề chuyên môn của làng này.", "eng": "Wood-carvings are a speciality of this village."}, {"viet": "Anh có thích một đĩa súp nữa không?", "eng": "Would you like another helping of soup?"}, {"viet": "Cô cảm phiền chụp vài tấm ảnh cho nhóm chúng tôi được không?", "eng": "Would you mind taking a few photos of our group?"}, {"viet": "Xerox'là một cái tên giữ độc quyền và các nhà chế tạo máy sao chụp khác không được phép sử dụng.", "eng": "Xerox'is a proprietary name and may not be used by other makers of photocopiers."}, {"viet": "Vâng, hầu hết mọi người đều sử dụng hộp cỡ nhỏ.", "eng": "Yes, most people use the small size box."}, {"viet": "Anh sẽ dồn tôi vào tình trạng quẫn trí bằng những câu hỏi ngốc nghếch đấy!", "eng": "You'll drive me to distraction with your silly questions!"}, {"viet": "Đêm nay anh có vẻ đầy bí ẩn, có chuyện gì thế?", "eng": "You're full of mystery tonight, what's going on?"}, {"viet": "Tôi đã làm chập mạch chiếc máy giặt.", "eng": "You've short-circuited the washing-machine."}, {"viet": "Anh không liều không thể giàu được.", "eng": "You can't get rich without taking risks."}, {"viet": "Cậu có thể đi ra ngoài nếu như cậu chịu khoác áo ngoài.", "eng": "You can go out on condition that you wear an overcoat."}, {"viet": "Anh có thể đợi đến chết anh ấy cũng không đến đâu.", "eng": "You could wait till Doomsday and he'd never show up."}, {"viet": "Anh bị mắc lỗi ở chỗ này, con 3 này phải là 5.", "eng": "You have made a mistake here, this 3 should be 5."}, {"viet": "Bạn sẽ tìm thấy nó ở gian bán sản phẩm bơ sữa.", "eng": "You'll find it in the dairy section."}, {"viet": "Anh phải tự khép mình vào kỷ luật để hoàn thành công việc đúng thời hạn.", "eng": "You must discipline yourself to finish your work on time."}, {"viet": "Anh cần phải rất vững vàng để đương đầu với sự căng thẳng của một công việc như vậy.", "eng": "You need to be very well balanced to cope with the stress of a job like that."}, {"viet": "Ông nên đi bằng xe điện ngầm hoặc xe buýt.", "eng": "You should go by subway or bus."}, {"viet": "Em xem anh như người giúp việc vậy.", "eng": "You treat me like a servant."}, {"viet": "Anh đem vấn đề này ra toà thì thật là ngu ngốc.", "eng": "You would be ill-advised to take this matter to the court."}, {"viet": "Ý tưởng của anh sẽ không thành công về mặt thương mại.", "eng": "Your idea is just not commercially viable."}]