[{"viet": "Một nhân viên quán rượu lấy rượu cho khách.", "eng": "A barman gets wine for guests."}, {"viet": "Một chiếc ghế được bán như một món còn sót cuối đợt bán xôn.", "eng": "A chair sold as an oddment at the end of the sale."}, {"viet": "Một la bàn cấu tạo bởi một thanh nam châm gọi là la bàn từ-nó có thể cho biết phương hướng vì quả đất hoạt động như một thanh nam châm vĩ đại.", "eng": "A compass made of a magnet-a magnetic compass-tells direction because the earth acts as a great magnet."}, {"viet": "Một làn khói cuộn lên từ một điếu thuốc.", "eng": "A curl of smoke rising from a cigarette."}, {"viet": "Một bác sĩ với đôi bàn tay dịu dàng của ông ta.", "eng": "A doctor who is gentle with his hands."}, {"viet": "Một ít người leo núi bền bỉ cuối cùng đến được đỉnh.", "eng": "A few persevering climbers finally reached the top."}, {"viet": "Một cuộc thẩm vấn nhân chứng mới đây.", "eng": "A fresh examination of the witness."}, {"viet": "Một kế hoạch của chính phủ bị báo chí đả kích gay gắt.", "eng": "A government plan slashed by the press."}, {"viet": "Một người thừa kế nữ sống cực kỳ xa hoa.", "eng": "A heiress living in the lap of luxury."}, {"viet": "Một công việc cần khối óc hơn chân tay.", "eng": "A job needing brains rather than brawn."}, {"viet": "Một cái gờ để phấn bên dưới bảng đen.", "eng": "A ledge for chalk beneath the blackboard."}, {"viet": "Nhiều phụ nữ vừa lo toan được việc gia đình vừa đi làm-hãy noi gương Angela chẳng hạn.", "eng": "A lot of women manage to bring up families and go out to work at the same time-take Angela, for example."}, {"viet": "Một bữa ăn đạm bạc chỉ có bánh mì và phó mát.", "eng": "A meagre meal of bread and cheese."}, {"viet": "Một cuộc binh biến đã xảy ra ở doanh trại quân đội.", "eng": "A mutiny took place in the army camp."}, {"viet": "Nhiều nhà ngoại giao nước ngoài lui tới câu lạc bộ này.", "eng": "A number of foreign diplomats use this club."}, {"viet": "Một người có tài nhớ mọi việc.", "eng": "A person gifted with total recall."}, {"viet": "Một sự đối đầu về chính trị trong suốt những cuộc bầu cử vòng đầu.", "eng": "A political facedown during the primaries."}, {"viet": "Một kế hoạch giảm giá cho những khách hàng thường xuyên.", "eng": "A proposal to offer a discount to regular customers."}, {"viet": "Nhà hàng chuyên về các món ăn Inđônêxia.", "eng": "A restaurant specializing in Indonesian dishes."}, {"viet": "Một vụ tai tiếng dính líu đến nhiều nhân vật tai to mặt lớn của xã hội.", "eng": "A scandal involving several pillars of society."}, {"viet": "Một hiệu nổi tiếng về mặt tín nhiệm.", "eng": "A shop with a good for reliability."}, {"viet": "Một cái đui để gắn bóng đèn điện tròn.", "eng": "A socket for an electric light bulb."}, {"viet": "Một điều qui định được thêm vào phút chót đã làm mất hiệu quả của sắc lệnh đó.", "eng": "A stipulation added at the last minute gutted the ordinance."}, {"viet": "Một sự liệt kê thực đơn dọc theo bàn trước mỗi người ngồi.", "eng": "A tableside recitation of the menu."}, {"viet": "Một chuyến xe lửa đi từ Luân Đôn.", "eng": "A train travelling outwards from London."}, {"viet": "Một lời mời ở lại với ai đầy nhiệt tình.", "eng": "A warm invitation to stay with somebody."}, {"viet": "Một người mẹ trẻ nói huyên thuyên với đứa con nhỏ.", "eng": "A young mother gushing over a baby."}, {"viet": "Thật sự bây giờ tôi đang bận-tôi có thể gọi lại cho anh được không?", "eng": "Actually, I'm busy at the moment-can I phone you back?"}, {"viet": "Sau sáu tuần bị bệnh, tôi phải mất ít lâu mới đi vững vàng lại được.", "eng": "After a six-week illness it took me some time to find my feet again."}, {"viet": "Sau một cuộc thương lượng gay go chúng tôi đã đi đến một thỏa thuận.", "eng": "After much hard bargaining we reached an agreement."}, {"viet": "Sau ba năm không được đề bạt, anh ta quyết định thế là chịu hết mức rồi và xin thôi việc.", "eng": "After three years without promotion he decided he'd had enough and resigned."}, {"viet": "Mọi lời cổ vũ của ba nó đều vô ích.", "eng": "All his father's exhortations were in vain."}, {"viet": "Tất cả đồ đạc đã được tống khứ đi hết.", "eng": "All the furniture has been disposed of."}, {"viet": "Mặc dù mình không tin là có ma nhưng mình sợ chỗ tối.", "eng": "Although I don't believe in ghosts, I'm afraid of dark places."}, {"viet": "Diễn viên phải học cách hướng tiếng nói của mình về phía khán giả.", "eng": "An actor must learn to project his voice."}, {"viet": "Một phần thưởng để công nhận các thành tựu của ai.", "eng": "An award in recognition of one's achievements."}, {"viet": "Một khối đá lờ mờ ở chân trời.", "eng": "An ill-defined lump of rock on the horizon."}, {"viet": "Một cái hòm gỗ cũ thay cho bàn.", "eng": "An old wooden box did duty for a table."}, {"viet": "Và anh ấy đã không nhận ra đó là cô sao?", "eng": "And he didn't realize it was you?"}, {"viet": "Một người khác đóng thay cho ngôi sao nổi tiếng ấy trong các cảnh nguy hiểm.", "eng": "Another man stands in for the big star in the dangerous scenes."}, {"viet": "Tiếp cận điều gì với thái độ sai lầm.", "eng": "Approach something in the wrong spirit."}, {"viet": "Anh có lo lắng tí gì về điều dự báo không?", "eng": "Are you at all worried about the forecast?"}, {"viet": "Anh có chắc đã hoàn toàn hài lòng chưa?", "eng": "Are you sure you're quite satisfied?"}, {"viet": "Anh ta hoàn toàn thất bại trong cái nghề gõ đầu trẻ.", "eng": "As a teacher, he's a disaster."}, {"viet": "Là những người duy nhất nói tiếng Anh, chúng tôi có phần gần gũi với nhau.", "eng": "As the only English speakers, we were rather thrown together."}, {"viet": "Ban đầu có nhiều ngày được làm lễ kỷ niệm như ngày Chúa ra đời.", "eng": "At first several different days were celebrated as the day when Jesus was born."}, {"viet": "Toan tính hối lộ một ban hội thẩm bằng cách tặng tiền.", "eng": "Attempt to bribe a jury with offers of money."}, {"viet": "Về cơ bản đây là một cuộc biểu diễn tốt-tôi chỉ có vài ý kiến phê bình nhỏ liên quan đến kỹ thuật của cô ấy.", "eng": "Basically it was a fine performance-I have only minor quibbles to make about her technique."}, {"viet": "Phải được xem xét dứt khoát để đảm nhiệm một chức vụ trong chính quyền.", "eng": "Be positively vetted for a government post."}, {"viet": "Trước khi chúng tôi đến đây, dường như đây là một thành phố xinh đẹp.", "eng": "Before we came here, it seemed like a nice town."}, {"viet": "Kết rìa tấm thảm lại để nó khỏi xổ chỉ ra.", "eng": "Bind the edge of the rug so that it won't ravel."}, {"viet": "Đập một cục than ra thành những miếng nhỏ.", "eng": "Break a piece of coal into small lumps."}, {"viet": "Ném tờ báo lại đây được không anh?", "eng": "Bung the newspaper over here, will you?"}, {"viet": "Nhưng vào buổi sáng thì trời lạnh, vì thế hãy cẩn thận.", "eng": "But it does get chilly in the morning, so be careful."}, {"viet": "Nhưng bạn không phải lái xe về.", "eng": "But you wouldn't have to drive back."}, {"viet": "À này, cái tên Concorde xuất phát từ đâu vậy?", "eng": "By the way, where does the name Concorde come from?"}, {"viet": "Tôi có thể để hành lý ở đây đến thứ hai tuần tới được không?", "eng": "Can I leave my baggage here until next Monday?"}, {"viet": "Anh có sờ thấy khối u trên đầu tôi không?", "eng": "Can you feel the bump on my head?"}, {"viet": "Ông có thể nhìn thấy tảng đá màu nâu trên các ngọn cây đó không?", "eng": "Can you see that brown rock above the trees?"}, {"viet": "Sự cắt tỉa cẩn thận đúng lúc là bí quyết thành công trong việc trồng hoa hồng.", "eng": "Careful pruning at the right time is the secret of success with roses."}, {"viet": "Đội Chelsea đã bị đội Leeds đè bẹp với tỉ số 6-1.", "eng": "Chelsea were thrashed 6-1 by Leeds."}, {"viet": "Sự bất tuân luật pháp sẽ đưa anh vào nhà tù.", "eng": "Civil disobedience will land you in jail."}, {"viet": "Hãy lại đây và xem bức tranh này.", "eng": "Come here and look at this picture."}, {"viet": "Đánh dấu đoạn xa lộ trong suốt thời gian sửa đường.", "eng": "Cone off a section of motorway during repairs."}, {"viet": "Ông ấy có thể gọi điện cho tôi khi ông ấy trở về không?", "eng": "Could he call me when he gets in?"}, {"viet": "Bạn có thể chụp cho tôi hai mươi bản chương trình nghị sự không?", "eng": "Could you run me off twenty copies of the agenda?"}, {"viet": "Trao đổi văn hóa là một cách lập mối quan hệ cầu nối giữa các quốc gia.", "eng": "Cultural exchanges are a way of building bridges between nations."}, {"viet": "Tuyên bố tạm ngưng buôn bán vũ khí.", "eng": "Declare a moratorium on arms sales."}, {"viet": "Mặc dầu có hình ảnh trong sạch, cơ quan đó vẫn dung túng sự lãng phí và thiếu năng lực.", "eng": "Despite its squeaky-clean image, the agency suffered waste and inefficiency."}, {"viet": "Ông có gặp rắc rối khi đổi ngoại tệ không?", "eng": "Did you have any trouble when exchanging the foreign currency?"}, {"viet": "Sự phân biệt đối xử với người da đen vẫn còn phổ biến.", "eng": "Discrimination against Blacks is still common."}, {"viet": "Làm điều gì chỉ vì ham học hỏi.", "eng": "Do something for interest's sake."}, {"viet": "Bạn có thích nhạc pop của Nhật không?", "eng": "Do you enjoy Japanese popular music?"}, {"viet": "Hiên tại canh có thứ nào tương tự không?", "eng": "Do you have anything similar available at the moment?"}, {"viet": "Bạn có thích cái cách tôi sắp xếp lại căn phòng không?", "eng": "Do you like the way I've rearranged the room?"}, {"viet": "Bạn có học ngoại ngữ nào không?", "eng": "Do you study any foreign languages?"}, {"viet": "Bạn có muốn lấy bằng Thạc sĩ không?", "eng": "Do you want to get a Master's degree?"}, {"viet": "Quê bạn có đội bóng chày không?", "eng": "Does your hometown have a baseball team?"}, {"viet": "Đừng coi thường những gì tôi đã làm.", "eng": "Don't depreciate what I have done."}, {"viet": "Đừng để hắn sửa xe đạp của bạn.", "eng": "Don't let him mend your bike."}, {"viet": "Đừng có thò đầu con ra ngoài cửa sổ xe ôtô.", "eng": "Don't stick your head out of the car window."}, {"viet": "Bạn không nghĩ là tôi thông mình sao?", "eng": "Don't you think I am cute?"}, {"viet": "Suốt cả đời, tác phẩm của ông không bao giờ được xuất bản.", "eng": "During his lifetime, his work was never published."}, {"viet": "Dòng điện truyền đi trong mạch điện.", "eng": "Electricity is flowing in the circuit."}, {"viet": "Ngay cả một cậu học trò cũng có thể viết được một truyện hay hơn thế.", "eng": "Even a schoolboy could manage a better story than that."}, {"viet": "Mọi sự đều phụ thuộc vào kết quả những cuộc đàm phán này.", "eng": "Everything hinges on the outcome of these talks."}, {"viet": "Vào cuối thế kỉ 19 nhiều chính khách Anh đã ủng hộ chủ nghĩa bành trướng.", "eng": "Expansionism was advocated by many British politicians in the late 19th century."}, {"viet": "Thay vì mê thích khiêu vũ, anh ta lại ghê tởm nó.", "eng": "Far from enjoying dancing, he loathes it."}, {"viet": "Chiến đấu vì danh dự tổ quốc của mình.", "eng": "Fight for the honour of one's country."}, {"viet": "Gắn những tròng nhựa màu khói vào kính đeo mắt.", "eng": "Fit smoked plastic lenses in spectacles."}, {"viet": "Để đãi sinh nhật họ đã đưa anh ta đến các nơi giải trí ở thành phố.", "eng": "For a birthday treat they took him out on the town."}, {"viet": "Đã tìm một chỗ thú vị dưới một cây có bóng mát để cắm trại.", "eng": "Found a likely spot under a shady tree for the picnic."}, {"viet": "Được một học bổng học đại học.", "eng": "Gain a scholarship to the university."}, {"viet": "Làm cho căn phòng hoàn toàn đẹp đẽ và gọn gàng.", "eng": "Get the room all nice and shipshape."}, {"viet": "Quét dọn kỹ càng căn phòng đó.", "eng": "Give the room a thorough cleaning."}, {"viet": "Good, better và best là cấp nguyên, cấp so sánh, cấp so sánh bậc nhất của good.", "eng": "Good, better and best are the positive, comparative and superlative degrees of good."}, {"viet": "Tinh thần phấn chấn của họ đã bị kiềm hãm lại.", "eng": "Had a muzzle put on their high spirits."}, {"viet": "Xin mời ông ngồi trong lúc tôi gọi điện.", "eng": "Have a seat, please, while I call."}, {"viet": "Trước đây bạn có bao giờ đi trượt tuyết không?", "eng": "Have you ever gone skiing before?"}, {"viet": "Bạn đã đọc sách của nhà văn Nhật nào chưa?", "eng": "Have you read any books written by a Japanese person?"}, {"viet": "Anh ta sẽ đưa anh về nhà-chỉ cần anh yêu cầu thôi.", "eng": "He'll take you home-you only have to ask."}, {"viet": "Ông ta đòi tiền thuê căn hộ này mỗi tháng 80 pao.", "eng": "He's asking 80 pounds a month rent for that flat."}, {"viet": "Anh ta được gia hạn thời gian để viết xong bản luận án của mình.", "eng": "He's got an extension to finish writing his thesis."}, {"viet": "Anh ấy chỉ làm việc một cách chơi chơi trong thành phố: anh ấy quan tâm đến việc trở thành một người đua xe ôtô nhiều hơn.", "eng": "He's only playing at his job in the city: he's much more interested in being a racing driver."}, {"viet": "Cậu ấy rất dễ mặc cảm vì người bé nhỏ, cho nên đừng nhắc đến chuyện đó.", "eng": "He's very sensitive about being small, so don't mention it."}, {"viet": "Anh ta chia những công việc khác nhau cho những thành viên trong đội.", "eng": "He apportioned the members of the team their various tasks."}, {"viet": "Anh ấy đã mua xe hơi trả góp.", "eng": "He bought the car in installment."}, {"viet": "Dù có cố gắng tới đâu chăng nữa anh ta cũng chẳng trượt tuyết nổi.", "eng": "He can't ski to save his life."}, {"viet": "Anh ấy không thể tập trung tư tưởng vào việc học được.", "eng": "He couldn't bend his mind to his studies."}, {"viet": "Hắn không dốc hết khả năng trong kỳ thi đó.", "eng": "He didn't do himself justice in the exams."}, {"viet": "Hắn lái xe thật nhanh đâm vào cột đèn.", "eng": "He drove full tilt into the lamppost."}, {"viet": "Hắn đã mắc bệnh sốt rét trong một chuyến đi đến châu Phi.", "eng": "He fell sick with malaria on a trip to Africa."}, {"viet": "Hắn đã cung cấp đầy đủ chi tiết về số tài sản bị ăn trộm.", "eng": "He gave full particulars of the stolen property."}, {"viet": "Anh ta phải cực nhọc với công việc tìm chỗ ở cho toàn đội.", "eng": "He got lumbered with the job of finding accommodation for the whole team."}, {"viet": "Hắn đã mất hết mọi hy vọng là nàng còn sống.", "eng": "He had relinquished all hope that she was alive."}, {"viet": "Anh ta có một sở thích chiết trung về âm nhạc.", "eng": "He has an eclectic taste in music."}, {"viet": "Ông ấy đã từng trải nhiều trong cuộc đời dài của mình.", "eng": "He has seen a great deal in his long life."}, {"viet": "Ông ta đã gây ấn tượng sâu sắc cho cử tọa bằng kiến thức uyên bác của mình.", "eng": "He impressed his audience by the profundity of his knowledge."}, {"viet": "Chúa rất nhân từ và bao dung đối với những kẻ có tội mà biết ăn năn.", "eng": "He is kind and gracious to all sinners who repent."}, {"viet": "Ông ta đang viết một cuốn tiểu thuyết mới.", "eng": "He is working on a new novel."}, {"viet": "Anh ta đã ra đi giữa khoảng 5 đến 6 giờ.", "eng": "He left between five and six o'clock."}, {"viet": "Hắn ta trông có vẻ là một con người độc ác.", "eng": "He looks like a mean character."}, {"viet": "Nó không có ý khiếm nhã khi nhận xét vậy.", "eng": "He meant no disrespect by that remark."}, {"viet": "Anh ta tham gia cuộc tranh tài chỉ vì lời thách đố.", "eng": "He only entered the competition for a dare."}, {"viet": "Anh ta nói thành tích của anh ta có gì đáng kể đâu vì anh ta nghĩ những người khác không ưa những người thực sự tài giỏi.", "eng": "He poor-mouths his achievements because he thinks other people don't like really clever people."}, {"viet": "Anh ta đưa chai lên môi và tu một hơi dài.", "eng": "He put the bottle to his lips and drank deeply."}, {"viet": "Ông ta đã từ chối công việc ấy, nói rằng nó sẽ là một sự bán rẻ tài năng của ông ta.", "eng": "He refused the job, saying it would be a prostitution of his talents."}, {"viet": "Nó có nhiều nguy cơ bị bắt hơn.", "eng": "He runs more risk of being arrested."}, {"viet": "Anh ta đang ở đỉnh cao trong nghề của mình.", "eng": "He's at the top of his profession."}, {"viet": "Anh ta chuyên chú vào những điều huyền bí.", "eng": "He's interested in the occult."}, {"viet": "Hắn đang nói nhiều chuyện tào lao.", "eng": "He's talking a load of codswallop."}, {"viet": "Anh ta thấy nhiều hành động tàn bạo trong trại giam.", "eng": "He saw a lot of cruelty in the prison camp."}, {"viet": "Ông ta đã để lại một phần tài sản cho con trai của ông.", "eng": "He settled part of his estate on his son."}, {"viet": "Anh ta dùng dầu xức giữ nếp tóc.", "eng": "He smothers his hair with grease."}, {"viet": "Anh ta nhìn chăm chăm vào những dòng chữ với vẻ bối rối hoàn toàn.", "eng": "He started at the words in complete puzzlement."}, {"viet": "Anh ta đã thành công trong công việc lấy bằng lái xe.", "eng": "He succeeded in passing his driving test."}, {"viet": "Anh ta tưởng có thể đánh bại được bất cứ ai trong quần vợt, nhưng đã gặp ở cô ta một kỳ phùng địch thủ.", "eng": "He thought he could beat anyone at tennis, but he's met his match in her."}, {"viet": "Anh ấy móc rách áo mình vào một cái đinh.", "eng": "He tore his shirt on a nail."}, {"viet": "Anh ta mở đĩa và cho chúng tôi xem món ăn.", "eng": "He uncovered the dish and showed us the food."}, {"viet": "Nó muốn lớn lên làm lính cứu hoả.", "eng": "He wants to be a fireman when he grows up."}, {"viet": "Ông ta đã cố hết sức phủ nhận lời đồn đại về việc sắp sa thải công nhân dư thừa.", "eng": "He was at great pains to deny the rumour of redundancies."}, {"viet": "Ông ấy giả điếc trước những lời van xin của tôi.", "eng": "He was deaf to my supplications."}, {"viet": "Ông ta ra lệnh, và thiên hạ tuân lệnh.", "eng": "He was giving orders, and people were taking them."}, {"viet": "Cậu ta xao lãng bổn phận của mình.", "eng": "He was negligent of his duties."}, {"viet": "Ông ấy chịu trách nhiệm thu mua tiếp liệu cho quân đội.", "eng": "He was responsible for procuring supplies for the army."}, {"viet": "Anh ấy là người đầu tiên lái loại máy bay đó.", "eng": "He was the first man ever to fly that type of aircraft."}, {"viet": "Anh ta mang bít tất sạch hằng ngày.", "eng": "He wears clean socks every day."}, {"viet": "Nó đã rút lại bức thư đầy hằn thù.", "eng": "He withheld the letter out of sheer vindictiveness."}, {"viet": "Anh ta đã vắt kiệt quần áo trước khi treo lên dây để phơi.", "eng": "He wrung the clothes out before putting them on the line to try."}, {"viet": "Hành động của cô ta trái ngược hẳn với lời hứa của cô ta.", "eng": "Her actions contrasted sharply with her promises."}, {"viet": "Khi cô ta cười đôi má có hai lúm đồng tiền.", "eng": "Her cheeks dimpled as she smiled."}, {"viet": "Cô ta nổi bật thành một nghệ sĩ nổi tiếng.", "eng": "Her emergence as a well-known artist."}, {"viet": "Việc học tập miệt mài ngày càng tăng của cô ấy đối với lịch sử tự nhiên.", "eng": "Her growing absorption in the study of natural history."}, {"viet": "Công việc của cô ta thật nhàn hạ: cô ấy hầu như chẳng làm gì mà kiếm được khối tiền.", "eng": "Her job's so cushy: she does next to nothing and earns a fortune."}, {"viet": "Tên của cô ấy là'Francis'hoặc viết tắt là'Fran'.", "eng": "Her name is'Francis', or'Fran'for short."}, {"viet": "Quyền lực của bà ấy bị giới hạn bởi nhiều quy định.", "eng": "Her powers are circumscribed by many regulations."}, {"viet": "Da cô ta còn mịn màng như da trẻ con.", "eng": "Her skin is still as smooth as a baby's bottom."}, {"viet": "Mắt bà ấy mờ đi vì tuổi tác.", "eng": "Her vision was a blur on account of age."}, {"viet": "Cô ta đây rồi-chính là người mà chúng ta đang nói đến!", "eng": "Here she is-the very person we were talking about!"}, {"viet": "Vẻ mặt cho thấy điều làm anh ta đang đau khổ.", "eng": "His appearance witnesses what he has suffered."}, {"viet": "Những đối thủ của ông ta trong kinh doanh biết rằng họ không thể mong đợi một sự khoan dung nào ở một kẻ thù tàn nhẫn như thế.", "eng": "His business rivals knew they could expect no quarter from such a ruthless adversary."}, {"viet": "Cái chết của ông ta theo sau ngay cái chết của bà ta.", "eng": "His death followed hard on hers."}, {"viet": "Mặt anh ta bị rám nắng đậm.", "eng": "His face was badly burnt by the hot sun."}, {"viet": "Thói quen phê bình bừa bãi của ông ta về bất cứ vấn đề gì ông ta chú ý.", "eng": "His habit of scattershot comment on whatever issue catches his eyes."}, {"viet": "Sự phán đoán của ông ta không bị thành kiến cá nhân chi phối.", "eng": "His judgment was uncoloured by personal prejudice."}, {"viet": "Tiêu chuẩn đạo đức của anh ta đã từng bị nghi ngờ.", "eng": "His moral standards have been called into question."}, {"viet": "Vai Othello anh ấy đóng rất hay.", "eng": "His performance of Othello was very good."}, {"viet": "Tiếng tăm như một Romeo của hắn thì hoàn toàn không xứng đáng.", "eng": "His reputation as a Romeo is quite undeserved."}, {"viet": "Câu chuyện của hắn chỉ là một loạt lời nói dối.", "eng": "His story is nothing but a pack of lies."}, {"viet": "Theo thời gian, những chuyến viếng thăm của hắn thưa dần.", "eng": "His visits became less frequent as time passed."}, {"viet": "Đeo lấy cái gì như đỉa.", "eng": "Hold on something like a limpet."}, {"viet": "Cất những quyển sách cũ của mình trên gác mái.", "eng": "House one's books in the attic."}, {"viet": "Sao cậu có thể bàng quan đối với những nỗi đau khổ của những người đang chết đói?", "eng": "How can you be indifferent to the sufferings of starving people?"}, {"viet": "Ở Nhật người ta bỏ không dùng đồ xài rồi theo cách nào?", "eng": "How do people get rid of secondhand things in Japan?"}, {"viet": "Ông thật là tử tế khi giúp tôi!", "eng": "How kind of you to help!"}, {"viet": "Có bao nhiêu nước sẽ tham gia vào Thế vận hội Olympic?", "eng": "How many countries will be participating in the Olympic Games?"}, {"viet": "Bà sẽ đổi bao nhiêu vậy?", "eng": "How much are you going to change?"}, {"viet": "Tôi phải uống thuốc như thế nào?", "eng": "How often should I take them?"}, {"viet": "Các khách du lịch đói rét và thiếu tiền.", "eng": "Hungry, cold, and out-of-pocket travelers."}, {"viet": "Tôi muốn biết về giờ hoạt động của phòng tập thể dục ở khách sạn quý vị.", "eng": "I'd like to know about your business hours of your hotel gymnasium."}, {"viet": "Bố sẽ gọi điện chon nha sĩ và hẹn trước.", "eng": "I'll call the dentist and make an appointment."}, {"viet": "Tôi sẽ để cửa mở khi tôi sử dụng phòng tắm.", "eng": "I'll leave the door open, when I use the bathroom."}, {"viet": "Tôi cao 5 bộ 8 insơ và nặng 156 cân Anh.", "eng": "I'm 5 feet 8 inchestall and weigh 156 pounds."}, {"viet": "Tôi tin chắc là cô ấy nói sự thật.", "eng": "I'm convinced that she is telling the truth."}, {"viet": "Tôi sẽ thưởng cho mình một tấm áo khoác mới.", "eng": "I'm going to treat myself to a new coat."}, {"viet": "Tôi sẽ không è cổ ra để hoàn tất bài luận hôm nay đâu, thầy giáo tôi mãi tới tuần sau mới bắt nộp.", "eng": "I'm not going to break my neck to finish my essay today-my teacher doesn't want it until next week."}, {"viet": "Xin lỗi, tôi không quen với khu vực này.", "eng": "I'm sorry, but I am not familiar with this area."}, {"viet": "Tôi chẳng ngờ rằng trái với mọi người anh lại nghĩ như thế.", "eng": "I'm surprised that you of all people think that."}, {"viet": "Tôi vốn rất ghét đi ngủ sớm.", "eng": "I've always had an aversion to going to bed early."}, {"viet": "Tôi ăn tất cả bánh mì không còn lại chút nào.", "eng": "I've eaten all the bread and there is none left."}, {"viet": "Mình vừa chợt có một ý nghĩ hay: sao chúng ta không thử lật ngược nó sang chiều kia.", "eng": "I've just had an inspiration: why don't we try turning it the other way."}, {"viet": "Tôi đã lập đi lập lại nhiều lần với chúng nó là không chơi ở đó.", "eng": "I've told them again and again not to play there."}, {"viet": "Tôi luôn luôn có những vật lỉnh kỉnh ở trong túi áo khoác.", "eng": "I always have a lot of bits and pieces in my coat pocket."}, {"viet": "Tôi không có khả năng can thiệp vào vấn đề đó.", "eng": "I am powerless do intervene in the matter."}, {"viet": "Tôi bảo anh đừng nói với ai nhưng anh đã phản tôi.", "eng": "I asked you not to tell anyone, but you betrayed me."}, {"viet": "Tôi dự tính ít nhất 200 đô la.", "eng": "I calculate at least two hundred dollars."}, {"viet": "Tôi không thể giúp họ giải quyết cuộc cãi lộn được-họ phải tự giải quyết với nhau thôi.", "eng": "I can't help them to resolve their quarrel-they must fight it out between them."}, {"viet": "Tôi không thể nhớ chính xác chuyện gì đã xảy ra.", "eng": "I can't remember precisely what happened."}, {"viet": "Tôi không thể tưởng tượng được làm sao anh lại để cho đứa bé đi một mình.", "eng": "I cannot conceive why you allowed the child to go alone."}, {"viet": "Tôi bắt gặp thằng cha tò mò đó đọc nhật ký của tôi.", "eng": "I caught that Nosey Peter reading my diary."}, {"viet": "Tôi không thể hiểu được bài thuyết trình của ông ta vì ông ta cứ luôn luôn nhảy từ đề tài này sang đề tài khác.", "eng": "I couldn't understand his lecture because he kept jumping from one topic to the next."}, {"viet": "Tao thách mày nói với mẹ mày đó!", "eng": "I dare you to tell your mother!"}, {"viet": "Tôi không định để bạn đọc lá thư đó.", "eng": "I didn't mean you to read the letter."}, {"viet": "Tôi không biết là nó có nói sự thật hay là không?", "eng": "I don't know if he's telling the truth or not?"}, {"viet": "Tôi không tin lắm vào mục dự báo thời tiết.", "eng": "I don't set much store by weather forecasts."}, {"viet": "Tôi không muốn xen vào trong khi anh ta đang bận.", "eng": "I don't want to intrude on you if you're busy."}, {"viet": "Tôi không đánh giá cao người thầy mới của tôi.", "eng": "I don't think much of my new teacher."}, {"viet": "Tôi thấy rất muốn chạm vào người khác, ít ra là bắt tay.", "eng": "I feel a strong need to touch the other person, at least to shake hands."}, {"viet": "Cuối cùng tôi đã phải bán chiếc xe ô tô, nhưng nó cũng đã đủ tác dụng rồi.", "eng": "I finally had to sell the car, but it had served its turn."}, {"viet": "Tôi đã hướng dẫn đầy đủ để hắn có thể tìm ra ngôi nhà.", "eng": "I gave him full directions to enable him to find the house."}, {"viet": "Cháu đoán vậy, nhưng còn tùy.", "eng": "I guess so, but it depends."}, {"viet": "Tôi đã bị tiêu chảy suốt ngày cuối tuần.", "eng": "I had the runs all weekend."}, {"viet": "Tôi có một cuốn sách nói về việc đó thật hay.", "eng": "I have a really good book about it."}, {"viet": "Tôi không còn sức lực sau khi chơi bóng đá.", "eng": "I have no energy left after playing football."}, {"viet": "Tôi phải ra trình diện ở tòa vào ngày 20 tháng 5.", "eng": "I have to present myself in court on 20 May."}, {"viet": "Đã quá lâu tôi không gặp anh.", "eng": "I haven't seen you for a dog's age."}, {"viet": "Tôi hy vọng tôi sẽ có thể tìm được việc làm.", "eng": "I hope I'll be able to find a job."}, {"viet": "Tôi dự định là anh tiếp thu doanh nghiệp đó.", "eng": "I intend that you shall take over the business."}, {"viet": "Tôi biết tôi sẽ không chết nhưng nó có mùi rất khó chịu.", "eng": "I know I won't die but it stinks."}, {"viet": "Tôi thích nấm nhưng đáng buồn nấm lại không hợp với tôi.", "eng": "I like mushrooms but unfortunately they don't agree with me."}, {"viet": "Tôi sẽ gọi điện lại vào sáng nay.", "eng": "I'll call back later this morning."}, {"viet": "Tao sẽ làm cho mày mở mắt ra!", "eng": "I'll scratch your eyes out!"}, {"viet": "Tôi e rằng đã quá trễ.", "eng": "I'm afraid it's dreadfully late."}, {"viet": "Tôi đến đây dự một hội nghị.", "eng": "I'm here attending a conference."}, {"viet": "Xin lỗi, tôi không thể giúp được ông.", "eng": "I'm sorry, but I can't help you."}, {"viet": "Tôi đã cố túm được cái bình trước khi nó rơi xuống.", "eng": "I managed to grab hold of the jug before it fell."}, {"viet": "Chắc là tôi có làm mất lòng cô ta đâu đó, vì cô ta thực sự công kích tôi kịch liệt.", "eng": "I must have offended her somehow, because she really waded into me."}, {"viet": "Tôi cần số tiền đó một cách ghê gớm, nó đến như một lộc Trời ban cho!", "eng": "I needed that money so desperately, it was like manna from heaven when it arrived!"}, {"viet": "Tôi ăn quá nhiều trong buổi liên hoan tối qua và đã bị khó tiêu ghê gớm.", "eng": "I overate at the party last night and got violent indigestion."}, {"viet": "Tôi nghi ngờ sự sáng suốt khi cho trẻ con quá nhiều tiền như vậy.", "eng": "I question the wisdom of giving the child so much money."}, {"viet": "Tôi đề nghị ( anh ) nên gặp ông ta trước.", "eng": "I recommended ( your ) meeting him first."}, {"viet": "Tôi nhìn thấy một bộ mặt trông như xác chết xuất hiện ở cửa sổ nhỏ.", "eng": "I saw a cadaverous face appear at a small window."}, {"viet": "Tôi sẽ cố gắng giúp đỡ bạn bất kỳ lúc nào có thể làm được.", "eng": "I shall endeavour to accommodate you whenever possible."}, {"viet": "Tôi nhanh chóng nhận ra rằng anh ta nói dối.", "eng": "I soon discerned that the man was lying."}, {"viet": "Tôi ngờ hắn là tên phát xít bí mật.", "eng": "I suspect he's a closet fascist."}, {"viet": "Tôi nghĩ là tôi đã đánh giá quá cao anh ta, anh ta không thể điều khiển được một công việc lớn hơn.", "eng": "I think I overrated him, he can't handle a senior job."}, {"viet": "Tôi nghĩ chúng ta chẳng còn gì để nói về vấn đề đó nữa.", "eng": "I think we've just exhausted that subject."}, {"viet": "Tôi đã bảo họ có mặt ở đây lúc bốn giờ đúng mà.", "eng": "I told them to be here at four o'clock sharp."}, {"viet": "Tôi hiểu đại ý nhưng từng ngôn từ thì không thể hiểu được.", "eng": "I understand the gist but the technical language is over my head."}, {"viet": "Tôi muốn việc đó phải được làm càng nhanh càng tốt.", "eng": "I want it to be done as quickly as possible."}, {"viet": "Tôi muốn chụp vài tấm ảnh ở đó.", "eng": "I want to take some shots there."}, {"viet": "Tôi thất vọng vì không được chọn.", "eng": "I was disappointed not to be chosen."}, {"viet": "Tôi chưa bao giờ là tay nấu ăn khéo.", "eng": "I was never much of a hand at cookery."}, {"viet": "Tôi đang nghĩ đến tuần đầu tiên của tháng 2.", "eng": "I was thinking about the first week in February."}, {"viet": "Tôi sẽ đến vào thứ hai trừ phi là bạn viết cho tôi ngược lại.", "eng": "I will come on Monday unless you write to the contrary."}, {"viet": "Ban đêm tôi tỉnh giấc cảm thấy lạnh.", "eng": "I woke up in the night feeling cold."}, {"viet": "Tôi làm việc tại phòng nhân sự ở công ty Thương mại ABC.", "eng": "I work in the personnel department at ABC Trading Company."}, {"viet": "Tôi muốn đặt trước một bàn ăn tối.", "eng": "I would like to reserve a table for dinner."}, {"viet": "Tôi đã viết cho ông một lá thư về kỳ thi ở trường của con gái tôi.", "eng": "I wrote you a letter regarding my daughter's school examinations."}, {"viet": "Nếu tôi mua nhiều trái cây thì dường như chỉ làm tăng lãng phí thôi.", "eng": "If I buy fruit, it seems to just go to waste."}, {"viet": "Giá như không quay lại lấy bức thư thì cô ấy đã không lỡ chuyến xe buýt.", "eng": "If she hadn't gone back for the letter, she wouldn't have missed the bus."}, {"viet": "Nếu chúng ta chi tiêu cẩn thận, thì chúng ta sẽ đủ tiền mua một chiếc xe hơi mới.", "eng": "If we budget carefully, we'll be able to afford a new car."}, {"viet": "Nếu anh chị không thể có con được, sao không nhận con nuôi?", "eng": "If you can't have children of your own, why not consider adoption?"}, {"viet": "Nếu tình cờ gặp cô ấy anh làm ơn nhắn hộ nhé?", "eng": "If you happen to see her will you give her a message?"}, {"viet": "Nếu cậu nghĩ như vậy, cậu đã sai lầm nghiêm trọng.", "eng": "If you think that, you are grievously in error."}, {"viet": "Trong câu'Are you ill?'thường có sự lên giọng ở'ill', còn ở câu'He's ill'thường có sự xuống giọng ở'ill'.", "eng": "In'Are you ill?'there is usually a rising tone on'ill', while in'He's ill'there is usually a falling tone on'ill'."}, {"viet": "Trong thế cùng, tôi phải nài xin bọn hành hung.", "eng": "In desperation I pleaded with the attackers."}, {"viet": "Ở nhiều nước, khạc nhổ nơi công cộng bị coi là thô tục.", "eng": "In many countries it is considered rude to spit in public."}, {"viet": "Không có sự khuyến khích hoặc giúp đỡ, anh ta buộc phải từ bỏ kế hoạch của mình.", "eng": "In the absence of any encouragement or support, he was forced to drop his plan."}, {"viet": "Về mùa hè thành phố đầy bụi.", "eng": "In the summer the town be comes very dusty."}, {"viet": "Sự phát triển công nghiệp được tập trung ở miền nam đất nước.", "eng": "Industrial development is being concentrated in the south of the country."}, {"viet": "Có phải sự xa cách của anh ta là kết quả của sự học đòi làm trưởng giả hay vì tính nhút nhát?", "eng": "Is his distance a result of snobbery or shyness?"}, {"viet": "Có một nhà hàng Trung Quốc gần đây phải không?", "eng": "Is there a Chinese restaurant nearby?"}, {"viet": "Có phải đây là lần đầu tiên ông đi máy bay không?", "eng": "Is this your first trip by air?"}, {"viet": "Luật của câu lạc bộ này là không được nói về tôn giáo và chính trị, đó là đất cấm.", "eng": "It's a rule of this club that religion and politics may not be talked about, they are forbidden ground territory."}, {"viet": "Quành các góc phố với tốc độ cao là nguy hiểm.", "eng": "It's dangerous to go round corners at speed."}, {"viet": "Đối với tôi, tới đấy trước 8 giờ tối là không thể được.", "eng": "It's impossible for me to be there before 8.00 p. m."}, {"viet": "Không thể làm theo các đề nghị của ông được.", "eng": "It's not feasible to follow your proposals."}, {"viet": "Cô ấy mất việc thì thật là bất công'.'Tôi biết, nhưng chúng ta không thể làm được gì về điều đó.", "eng": "It's so unfair that she's lost her job.''I know, but there's nothing we can do about it'."}, {"viet": "Ông thật tử tế khi đã mời tôi.", "eng": "It's very kind of you to have invited me."}, {"viet": "Thật là một cảm giác kỳ lạ sau bấy nhiêu năm trở lại thăm nơi này.", "eng": "It feels strange to be visiting the place again after all these years."}, {"viet": "Khó mà giữ được thăng bằng khi đi trên hè đường bị đóng băng.", "eng": "It is difficult to keep one's balance on an icy pavement."}, {"viet": "Thật vô nghĩa nếu mua xe mà anh không biết lái.", "eng": "It is pointless to have a car if you can not drive."}, {"viet": "Nó đánh dấu một sự kiện quan trọng trong 50 năm tồn tại của chúng ta.", "eng": "It marks a milestone in our 50 years'existence."}, {"viet": "Việc đó dành cho người da trắng và cũng dành cho người da đỏ nữa.", "eng": "It's for white people and Indians, too."}, {"viet": "Dường như anh đã đi nhầm đường rồi.", "eng": "It seems as if I've taken the wrong road."}, {"viet": "Chúng tôi đã mất quá nhiều thời gian chờ đợi các món ăn được dọn lên.", "eng": "It took us too much time to wait for the courses to be served."}, {"viet": "Khó mà cư xử một cách tự nhiên dưới sức ép biết rõ sự thật.", "eng": "It was difficult to behave naturally under the burden of knowing the truth."}, {"viet": "Anh ta chểnh mảng đến độ quên khoá cửa.", "eng": "It was remiss of his to forget to lock the door."}, {"viet": "Nếu ông điền vào đơn đặt hàng chính thức thì điều đó sẽ thúc đẩy việc giao hàng nhanh hơn.", "eng": "It will speed up delivery if you complete the official order-form."}, {"viet": "Jane có một bộ sưu tập tiền kim loại nước ngoài rất phong phú.", "eng": "Jane has a very good collection of foreign coins."}, {"viet": "Khâu lược những mảng vải này trước khi khâu chúng lại với nhau.", "eng": "Join the pieces of cloth with a loose stitch before finally sewing them together."}, {"viet": "Ngồi yên khi tôi chụp ảnh anh.", "eng": "Keep still while I take your photograph."}, {"viet": "Chúng ta hãy nâng cốc chúc mừng thành công của các kế hoạch của anh.", "eng": "Let's drink to the success of your plans."}, {"viet": "Chúng ta hãy lấy mười bộ phim đi.", "eng": "Let's take out ten movies."}, {"viet": "Nhiều người nổi tiếng đã biết mùi nghèo khổ.", "eng": "Many famous people have known what it is to be poor."}, {"viet": "Chạy maratông mới là môn thể thao đích thực, chứ còn các trò chạy dưỡng sinh kia thì ăn nhằm gì.", "eng": "Marathons are the real McCoy-these little jogs are no challenge at all."}, {"viet": "Cho tôi xin giấy biên nhận nhé?", "eng": "May I have a receipt, please?"}, {"viet": "Có lẽ bố chú ý quá nhiều về điều bố được dạy bảo.", "eng": "Maybe you pay too much attention to what you're told."}, {"viet": "Phần lớn những bộ phim cũ đều là phim đen trắng.", "eng": "Most old films were made in black and white."}, {"viet": "Nhiều ý kiến phỏng đoán về nguyên nhân của việc đâm máy bay.", "eng": "Much speculation over the cause of the air crash."}, {"viet": "Món nợ về lời khuyên của cô ấy đối với tôi không phải là dễ trả...", "eng": "My debt to her for advice is not to be discharged easily."}, {"viet": "Những điều chỉ dẫn của tôi xem ra là khá đơn giản-tôi có phải giải thích rõ ràng nữa không?", "eng": "My instructions seem simple enough-do I have to spell them out again?"}, {"viet": "Hồi ức của tôi về các sự kiện khác với hồi ức của cô ta.", "eng": "My recollection of events differs from hers."}, {"viet": "Những người Ba Lan và người Hy Lạp đã nhập quốc tịch ở Mỹ.", "eng": "Nationalized Poles and Greeks in the USA."}, {"viet": "Năm tới sẽ có nhiều hoa hồng nở rộ đấy.", "eng": "Next year, many roses will bloom."}, {"viet": "Cái đó chẳng mang lại điều gì tốt lành đâu,'bà ta ra cái vẻ trịnh trọng loan báo.", "eng": "No good will come of this'she announced portentously."}, {"viet": "Bây giờ, mục kế tiếp cần xem xét là chi phí có thể có dành cho sản xuất.", "eng": "Now, the next item to consider is the probable cost of going into production."}, {"viet": "Chặn việc thông qua một dự luật tại Nghị viện.", "eng": "Obstruct the passage of a bill through Parliament."}, {"viet": "Ồ, làm sao mà nói chắc được, có thể là một ngày đẹp trời đấy!", "eng": "Oh, you never know, it could be a lovely day!"}, {"viet": "Trên bãi chiến trường không có cái gì là chắc chắn cả.", "eng": "On the field of battle there are no certainties."}, {"viet": "Một trong những điệp viên của chúng ta đã đào ngũ chạy sang bên địch.", "eng": "One of our spies has defected to the enemy."}, {"viet": "Quân đội ta sẽ nhanh chóng buộc quân địch phải tháo chạy.", "eng": "Our army will quickly put the enemy to flight."}, {"viet": "Nhóm chúng tôi gồm có những thầy giáo và bác sĩ.", "eng": "Our group was composed of teaches and doctors."}, {"viet": "Chúng tôi đã bị thời tiết xấu cản trở không tiến lên được.", "eng": "Our progress was hampered by the bad weather."}, {"viet": "Anh ta khuỵ chân của anh ta xuống, lòng tràn đầy biết ơn.", "eng": "Overwhelmed with gratitude, he fell to his knees."}, {"viet": "Việc thanh toán sẽ được thực hiện khi ông nộp cho chúng tôi biên lai liên quan.", "eng": "Payment will be made upon your surrendering to us the relative."}, {"viet": "Có thể ba của em sẽ hạ cố giúp em rửa bát chăng!", "eng": "Perhaps your father would condescend to help with the washing-up!"}, {"viet": "Những cảnh sát kiểm tra tốc độ đang hoạt động trên xa lộ này.", "eng": "Police speed traps are operating on this motorway."}, {"viet": "Bây giờ chính là 10 giờ 30 tối thứ ba.", "eng": "Right now it's 10: 30 Tuesday night."}, {"viet": "Nhiều nguyên nhân đã thúc đẩy tôi đi tới một quyết định.", "eng": "Several considerations have influenced me in coming to a decision."}, {"viet": "Cô ấy đúng là một cây đa nghi-Cô ta sẽ chẳng bao giờ tin là anh trở lại trừ phi cô ta nhìn thấy anh.", "eng": "She's a bit of a doubting-she won't believe you're back till she sees you."}, {"viet": "Cô ta đã có năm đời chồng, vì thế cô ta biết rất nhiều về đàn ông.", "eng": "She's been married five times, so she should know a thing or two about men."}, {"viet": "Nàng vô cùng thích thú về chiếc xe ô tô thể thao mới của nàng.", "eng": "She's in hog heaven in her new sports car."}, {"viet": "Cô ấy chạy thi với Mery trong cuộc chạy 100 mét.", "eng": "She's racing against Mery in the 100 metres."}, {"viet": "Bà ta viết hàng trăm quyển sách nhưng tôi chỉ đọc vài quyển trong số đó.", "eng": "She's written hundreds of books but I've only read a few of them."}, {"viet": "Cô ấy cứ mè nheo bắt tôi làm theo yêu cầu của cô.", "eng": "She badgered me into doing what she wanted."}, {"viet": "Cô ấy thích chọn học chơi vĩ cầm hơn là học dương cầm.", "eng": "She chose to learn the violin in preference to the piano."}, {"viet": "Bà ta giải quyết vấn đề rất giỏi.", "eng": "She dealt with the problem with consummate skill."}, {"viet": "Bà ta chi phối cuộc họp hoàn toàn bằng sức mạnh cá tính của mình.", "eng": "She dominated the meeting by sheer force of character."}, {"viet": "Cô ấy cảm thấy rằng cha mẹ đang trù dập mình.", "eng": "She felt that her parents were picking on her."}, {"viet": "Cô ấy liếc nhanh anh ta một cách e thẹn và rồi cụp mắt xuống.", "eng": "She glanced shyly at him and then lowered her eyes."}, {"viet": "Cô ấy đi tìm chìa khoá của cô ta khắp nơi thì lạ chưa nó nằm trong túi xách của cô ấy.", "eng": "She had looked everywhere for her key when loan and behold there it was in her bag."}, {"viet": "Bà ta hốc hác đi vì sự nghèo túng và bệnh tật.", "eng": "She has been worn down by poverty and illness."}, {"viet": "Cô ta va đầu gối vào góc giường.", "eng": "She hit her knee against the angle of the bed."}, {"viet": "Người ta thường nhầm cô ta với người em gái sinh đôi của cô.", "eng": "She is often mistaken for her twin sister."}, {"viet": "Ngay từ đầu, bà ấy đã biết là chuyện đó sẽ khó khăn.", "eng": "She knew from the word go that it was going to be difficult."}, {"viet": "Cô ta có vẻ đăm chiêu khi nghe tin đó.", "eng": "She looked pensive when she heard the news."}, {"viet": "Cô ấy đã lau sạch những vũng nước đọng trên sàn nhà tắm.", "eng": "She mopped up the pools of water on the bathroom floor."}, {"viet": "Bà ấy đã quở trách anh ta vì ăn nói lỗ mãng.", "eng": "She picked him up for using bad language."}, {"viet": "Cô ta đọc to những đoạn trích từ những bức thư của anh ấy.", "eng": "She read out extracts from his letters."}, {"viet": "Cô ấy lúc nào cũng là người thích đi lang thang.", "eng": "She's always been a rover."}, {"viet": "Cô ấy đang tập một bản nhạc mới trên đàn dương cầm.", "eng": "She's practicing a new piece on the piano."}, {"viet": "Cô ấy hầu như không nói một lời suốt cả buổi tối.", "eng": "She scarcely said a word all the evening."}, {"viet": "Cô ta đứng về phía em trai mình chống lại các học sinh khác trong lớp.", "eng": "She sided with her brother against the others in the class."}, {"viet": "Sau tai nạn cô ấy vẫn còn cảm thấy hơi yếu.", "eng": "She still feels a bit wonky after her accident."}, {"viet": "Cô ta căng thẳng, khi lại nghe thấy tiếng động đó.", "eng": "She tensed, hearing the noise again."}, {"viet": "Cô ấy quay lại nhìn người mới đến và tự giới thiệu.", "eng": "She turned to face the newcomer and introduced herself."}, {"viet": "Cô ấy là giáo viên, trước đó cô ấy làm việc trong công sở.", "eng": "She was a teacher, and before that she worked in an office."}, {"viet": "Cô ta thường bị trêu chọc về giọng phát âm.", "eng": "She was constantly ribbed about her accent."}, {"viet": "Cô ấy ở trong một trạng thái hưng phấn tưng bừng, kể chuyện đùa và mua đồ uống cho tất cả mọi người.", "eng": "She was in an ebullient mood, telling jokes and buying drinks for everyone."}, {"viet": "Cô ta đã bị phạt vì đã quay cóp trong lúc thi.", "eng": "She was punished for copying during the examination."}, {"viet": "Cô ấy là đối tượng bị đám bạn học cùng lớp khinh miệt.", "eng": "She was the scorn of her classmates."}, {"viet": "Cô ấy đi thơ thẩn một lát quanh công viên.", "eng": "She went for a little wander round the park."}, {"viet": "Cô ấy được ván thứ nhất tôi được ván thứ hai, vậy là hoà.", "eng": "She won the first game and I won the second, so now were even."}, {"viet": "Hãy sang số lớn hơn khi anh đạt 30 dặm Anh một giờ.", "eng": "Shift up when you reach 30 mph."}, {"viet": "Rây bột đóng cục ra khỏi bột mì, sàng lúa mì ra khỏi trấu.", "eng": "Sift out the lumps from the flour, the wheat from the chaff."}, {"viet": "Ngồi đây cùng với em là thiên đường rồi.", "eng": "Sitting here with you is heaven."}, {"viet": "Smith là anh chàng được ông chủ yêu thích.", "eng": "Smith is the boss's blue-eyed boy at the moment."}, {"viet": "Vậy là bà ta muốn bán nhà và dọn đến Luân đôn.", "eng": "So she wants to sell the house and move to London."}, {"viet": "Vài tòa nhà không bị hư hại gì trong cơn lốc.", "eng": "Some buildings were left untouched by the hurricane."}, {"viet": "Một số những con sông này xoắn lại và chạy ào xuống các hẻm núi hẹp, hoặc các thung lũng đá sâu, dày đặc cây rừng.", "eng": "Some of these rivers twist and rush down narrow canyons, or deep rocky valleys thick with forests."}, {"viet": "Một số phụ nữ sơn móng chân mình.", "eng": "Some women varnish their toe-nails."}, {"viet": "Rất tiếc, tôi không biết cô ta sống ở đâu.", "eng": "Sorry, I don't know where she lives."}, {"viet": "Thể thao đang bị giảm giá trị do sự thương mại hoá.", "eng": "Sport is being debased by commercialism."}, {"viet": "Stephen không muốn gặp chị của hắn nên hắn lẹ làng tìm cách lẩn tránh và nấp dưới giường.", "eng": "Stephen didn't want to see his sister, so he quickly took evasive action and hid under the bed."}, {"viet": "Cứ ngừng rồi chạy nhiều lần làm các hành khách ngồi lắc la lắc lư.", "eng": "Stops and starts that jolted the passengers."}, {"viet": "Thành công đạt được là do nỗ lực kết hợp của toàn đội.", "eng": "Success was achieved by the combined efforts of the whole team."}, {"viet": "Áp dụng hình phạt cho tương xứng với tội ác.", "eng": "Suit the punishment to the crime."}, {"viet": "Mồ hôi đổ ra nhễ nhại trên mặt anh ta.", "eng": "Sweat was pouring down his face."}, {"viet": "Hãy mang cái hộp không này đi và đem cho tôi một cái hộp đầy.", "eng": "Take this empty box away and bring me a full one."}, {"viet": "Truyền hình có khuynh hướng làm cho những cảnh bạo lực hấp dẫn hơn.", "eng": "Television tends to glamorize acts of violence."}, {"viet": "Dù sao cũng cảm ơn bạn nhưng thật sự tôi phải đi.", "eng": "Thank you just the same but I really must go."}, {"viet": "Vì thế chúng tôi khuyến khích thân chủ của chúng tôi lựa chọn kỳ hạn và số dư cẩn thận nếu họ đầu tư cho những kỳ hạn lâu dài.", "eng": "That's why we encourage our clients to select the terms and balances carefully if they invest for the long terms."}, {"viet": "Khi nói tới bán hàng thì anh chàng đó đầy nhiệt tình, hăng hái.", "eng": "That guy is a ball of fire when it comes to sales."}, {"viet": "Chiếc xe ô tô đó là một chiếc cực đẹp.", "eng": "That new car is an absolute beauty."}, {"viet": "Đó là điều anh ta đã nói với tôi.", "eng": "That's what he told me."}, {"viet": "Đó không phải là một lời nhận xét độ lượng lắm.", "eng": "That wasn't a very charitable remark."}, {"viet": "Các bản thanh toán đã được xử lý bằng máy tính.", "eng": "The accounts are processed by computer."}, {"viet": "Ngân hàng Nông Nghiệp thường ứng tiền cho nông dân để mua hạt giống và phân bón.", "eng": "The Agricultural Bank often advanced money to farmers for seed and fertilizer."}, {"viet": "Lời loan báo sự ra đời của một đứa con trong hoàng tộc được truyền đi khắp nước.", "eng": "The announcement of the royal birth was broadcasted to the nation."}, {"viet": "Việc buôn bán vũ khí phải chịu những quy định chặt chẽ.", "eng": "The arms trade should be subject to rigorous controls."}, {"viet": "Việc tấn công vào chiếc tàu thuỷ đã được coi như là một hành động gây chiến.", "eng": "The attack on the ship was viewed as an act of war."}, {"viet": "Đứa bé vẫn chưa tự ăn một mình được.", "eng": "The baby can't feed itself yet."}, {"viet": "Nhân viên ngân hàng nhìn khách hàng qua phía sau song sắt.", "eng": "The bank clerk peered at the customer through behind the grille."}, {"viet": "Tia sáng của đèn pha xuyên qua màn đêm.", "eng": "The beam of the searchlight pierced the darkness."}, {"viet": "Nhà sinh vật học nhuộm mẫu vật trước khi quan sát nó qua kính hiển vi.", "eng": "The biologist stained the specimen before looking at it through the microscope."}, {"viet": "Chiếc thuyền va vào đá nát ra từng mảnh.", "eng": "The boat was smashed to pieces on the rocks."}, {"viet": "Có thể dễ dàng lắp ráp cái tủ sách bằng một chiếc chìa vít.", "eng": "The bookcase can easily be assembled with a screwdriver."}, {"viet": "Khi chúng tôi xuất hiện mấy thằng bé chạy mất.", "eng": "The boys ran off as soon as we appeared."}, {"viet": "Toà nhà không đúng theo các qui định về an toàn.", "eng": "The building does not conform to safety regulations."}, {"viet": "Doanh nghiệp là một cơ quan lớn, phức tạp.", "eng": "The business is a large, complicated organism."}, {"viet": "Chiếc xe ô tô đó có đủ chỗ ngồi cho năm người lớn, nhưng đó là số tối đa.", "eng": "The car can seat five adults, but that's the max."}, {"viet": "Tấm thiếp gửi chúng tôi đề sai địa chỉ vào nhà cũ của chúng tôi.", "eng": "The card was wrongly addressed to our old home."}, {"viet": "Vẻ thanh thoát tuyệt vời trong giọng nói của cô ta.", "eng": "The celestial beauty of her voice."}, {"viet": "Chỗ ngồi rẻ tiền trong nhà hát.", "eng": "The cheap seats in a theatre."}, {"viet": "Bây giờ mạch của đứa bé đã đều đặn.", "eng": "The child's pulse is now even."}, {"viet": "Bọn trẻ nghịch các núm vặn trên máy ti-vi.", "eng": "The children diddled with the knobs on the television."}, {"viet": "Trẻ em được sơ tán về miền quê khi thành phố đang bị đánh bom.", "eng": "The children were evacuated to the country when the city was being bombed."}, {"viet": "Thành phố đã thông qua một sắc lệnh giới hạn kích thước các bảng quảng cáo, nhưng đã miễn áp dụng luật này đối với những bảng nào được dựng lên trước năm 1982.", "eng": "The city passed an ordinance restricting the size of advertising signs, but grandfathered all those signs erected before 1982."}, {"viet": "Những trò cười vỡ bụng của chàng.", "eng": "The clown's side-splitting antics."}, {"viet": "Màu này không bền vì vậy phải cẩn thận khi giặt những chiếc khăn này.", "eng": "The colours are not fast, to be careful when you wash these towels."}, {"viet": "Công ty đã quyết định đơn giản hoá quá trình sản xuất.", "eng": "The company has decided to streamline its production processes."}, {"viet": "Máy vi tính kiểm tra xem liệu các dữ kiện có được nạp vào đúng không.", "eng": "The computer verified whether the data was loaded correctly."}, {"viet": "Điều khiển việc đổi tiền nghĩa là điều khiển chính thức việc buôn bán ngoại hối và việc nhập vào và rút vốn ra.", "eng": "The control may cover the import and export of goods, rate of exchange and inflow and outflow of capital."}, {"viet": "Đất nước đã chuyển từ chính quyền quân sự sang dân chủ.", "eng": "The country has changed over from military to democratic rule."}, {"viet": "Tiếng vỡ loảng xoảng của những cái đĩa bị rơi.", "eng": "The crash of dishes being dropped."}, {"viet": "Đám đông đã bị tác động mạnh bởi tài hùng biện của anh ấy.", "eng": "The crowd were swayed by his eloquence."}, {"viet": "Sự hư hỏng đến độ chắc chữa không nổi vì tốn nhiều tiền quá.", "eng": "The damage was such that it would cost too much money to repair."}, {"viet": "Bên luật sư của bị cáo tranh cãi rằng chứng cớ đó thiếu tính thuyết phục.", "eng": "The defence argue that the evidence is weak."}, {"viet": "Nhà thám tử đã nghiên cứu các vết tay đến từng chi tiết tỉ mỉ nhất.", "eng": "The detective studied the fingerprints in the minutest detail."}, {"viet": "Cuộc thảo luận chuyển sang đề tài cần phải chăm sóc sức khoẻ của nhân dân được tốt hơn.", "eng": "The discussion turned on the need for better public health care."}, {"viet": "Bác sĩ động viên các y tá bằng cách khen ngợi thành tích trong công việc của họ.", "eng": "The doctor paid tribute to his nurses by braising their work."}, {"viet": "Con chó thè lưỡi trong thời tiết nóng.", "eng": "The dog lolls out its tongue in hot weather."}, {"viet": "Bức tranh thấm đượm cá tính của nghệ sĩ.", "eng": "The drawing is impregnated with the artist's personality."}, {"viet": "Trái Đất xoay quanh Mặt Trời.", "eng": "The earth revolves round the sun."}, {"viet": "Nhà vua tránh không liên quan tới mọi đảng phái chính trị.", "eng": "The Emperor kept aloof from all political parties."}, {"viet": "Nạn dịch đã được chặn đứng lại bằng việc tiêm chủng rộng rãi.", "eng": "The epidemic was held in check by widespread vaccination."}, {"viet": "Quyển vở có những trang giấy trắng được xen kẽ với những trang giấy có kẻ hàng.", "eng": "The exercise book has plain pages interleaves between its lined ones."}, {"viet": "Thất bại trong sự nghiệp của anh ta hầu hết là do anh ta tự vấn lương tâm quá đáng nên làm hỏng việc lớn.", "eng": "The failure in his career mostly resulted from his navel-gazing."}, {"viet": "Sự hồi tiếp của máy vi tính giúp chúng ta cập nhật chương trình.", "eng": "The feedback from the computer enables us to update the program."}, {"viet": "Bộ phim đột ngột nhảy từ những sự kiện năm 1920 sang các sự kiện năm 1930.", "eng": "The film suddenly jumped from the events of 1920 to those of 1930."}, {"viet": "Xí nghiệp đã phải khắc phục những trở ngại để đi đến nền kỹ thuật mới.", "eng": "The firm has to overcome its resistance to new technology."}, {"viet": "Trừ món cá ra, còn thì tất cả thức ăn đều ngon.", "eng": "The fish excepted, all the food is good."}, {"viet": "Thức ăn được bày ra trên bàn trong phút chốc.", "eng": "The food was on the table in seconds."}, {"viet": "Cửa hàng Hữu Nghị có một gian hàng thủ công mỹ nghệ, ở đó hàng tráng men, sơn mài, thêu và các mặt hàng khác được bày bán.", "eng": "The Friendship Store has an arts and crafts department, where cloisonne, lacquerware, embroideries and other things are sold."}, {"viet": "Mảnh vườn đang nở rộ những đoá hoa xuân.", "eng": "The garden is blooming with spring flowers."}, {"viet": "Các nữ sinh đã báo với Linda bằng một ngôi sao điện ảnh sẽ đến thăm trường học nhưng cô không tin họ, cô nghĩ là họ đã phỉnh gạt cô.", "eng": "The girl told to Linda that a movie star was visiting the school, but she did not believe them, she thought they were talking her for a ride."}, {"viet": "Sự quay ngoắt đột ngột của chính phủ đối với nạn thất nghiệp đã gây nên sự rối loạn.", "eng": "The government's sudden turnabout on unemployment has caused some confusion."}, {"viet": "Chính phủ hứa chắc chắn duy trì chương trình năng lượng hạt nhân và không thay đổi chính sách của mình.", "eng": "The government is firmly committed to maintaining its nuclear energy programme, and is very unlikely to change its policy."}, {"viet": "Sự uyển chuyển thường được gán cho mèo.", "eng": "The gracefulness so often imputed to cats."}, {"viet": "Nhóm người tò mò đứng xem tăng lên chẳng mấy chốc thành một đám đông.", "eng": "The group of onlookers soon swelled to a crowd."}, {"viet": "Phòng họp chưa sẵn sàng cho buổi lễ nhưng rồi thì sẽ ổn cả thôi.", "eng": "The hall isn't quite ready for the ceremony yet, but it will be all right on the night."}, {"viet": "Nhân vật chính đó xuất hiện như một vai phóng đại.", "eng": "The hero appears as a larger-than-life character."}, {"viet": "Bài tập quá căng thẳng làm cho những con ngựa kiệt sức.", "eng": "The horses were blown by the violent exercise."}, {"viet": "Nhà đủ đồ dùng tiện nghi.", "eng": "The house is full of conveniences of every sort."}, {"viet": "Nghệ sĩ trượt băng chạm vào rào cản.", "eng": "The ice-skater rammed into the barrier."}, {"viet": "Người da đỏ là những dân cư đầu tiên của Bắc Mỹ.", "eng": "The Indians were the original inhabitants of North America."}, {"viet": "Nội thất của lăng mộ được trang hoàng bằng các báu vật vô giá.", "eng": "The interior of the tomb was adorned with priceless treasures."}, {"viet": "Nếu anh yêu cầu thì công việc đó sẽ là của anh.", "eng": "The job is yours for the asking."}, {"viet": "Ấm nước đang reo trên bếp.", "eng": "The kettle was singing on the cooker."}, {"viet": "Khu đất đó đã được chia ra thành từng lô nhỏ.", "eng": "The land has been separated up into small plots."}, {"viet": "Vị luật sư đưa ra một lời bào chữa khôn khéo cho thân chủ.", "eng": "The lawyer produced a clever defence of his client."}, {"viet": "Người thủ thư quên đóng dấu các cuốn sách tôi mượn.", "eng": "The librarian forgot to stamp my library books."}, {"viet": "Ngành đường sắt địa phương đã ngừng hoạt động từ năm 1958.", "eng": "The local rail service discontinued in 1958."}, {"viet": "Máy được vận hành bằng loạt xung điện tử.", "eng": "The machine is operated by an electronic pulse."}, {"viet": "Người đàn ông hình như nhạc nhiên thấy là lại có người muốn mua ngôi nhà đó.", "eng": "The man seemed astonished that anyone would want to buy the house."}, {"viet": "Vấn đề đã được chuyển cho một cấp cao hơn.", "eng": "The matter has been remitted to a higher authority."}, {"viet": "Cuộc họp vào những ngày thứ Ba và thứ Năm được tổ chức tại hội trường chính.", "eng": "The meetings are on Tuesdays and Thursdays in the main hall."}, {"viet": "Ông bộ trưởng hành động không khôn ngoan, đấy là nói còn nhẹ.", "eng": "The minister didn't act very sensibly to put it mildly."}, {"viet": "Lũ khỉ kêu chí choé khi chúng gặp nguy hiểm.", "eng": "The monkeys cry shrilly when they see danger."}, {"viet": "Mãi đến năm 1953 người ta mới leo được lên đỉnh ngọn núi này.", "eng": "The mountain was not conquered until 1953."}, {"viet": "Quốc kỳ của Vương quốc Anh được gọi là Union Jack.", "eng": "The national flag of the United Kingdom is called the Union Jack."}, {"viet": "Viên tướng mới lập tức tung ra một cuộc tấn công quân địch.", "eng": "The new general immediately launched an offensive against the enemy."}, {"viet": "Chính sách kinh doanh mới hứa hẹn khả quan.", "eng": "The new sales policy promises well."}, {"viet": "Các báo đang làm rùm beng lên vụ lăng nhăng đó.", "eng": "The newspapers are giving the affair considerable prominence."}, {"viet": "Quyển tiểu thuyết đó được chuyển thành một cuốn phim thành công tại Hôliút.", "eng": "The novel was turned into a successful Hollywood film."}, {"viet": "Văn phòng cô ấy dễ tìm-Nó là một toà nhà màu trắng, khá lớn gần ga.", "eng": "The office is easy to find-it's a biggish white building near the station."}, {"viet": "Rốt cuộc những phương pháp cũ hóa ra lại tốt nhất.", "eng": "The old methods proved best after all."}, {"viet": "Âm thanh ban nhạc nghe chói tai.", "eng": "The orchestra was brittle in tone."}, {"viet": "Bức tranh ông tôi cho tôi hóa ra là một bức của danh họa Constable.", "eng": "The painting my grandfather gave me turned out to be a Constable."}, {"viet": "Lúc chúng tôi đến, bữa tiệc hầu như đã tàn rồi.", "eng": "The party was well-nigh over by the time we arrived."}, {"viet": "Lúc ấy người dân sống ở ngoài trời.", "eng": "The people had been living in the open."}, {"viet": "Bức ảnh không thể hiện được đầy đủ màu sắc rực rỡ của các vườn hoa.", "eng": "The photograph does not do full justice to the rich colours of the gardens."}, {"viet": "Chỗ đó có vẻ huyền bí bao quanh nó.", "eng": "The place has an air of mystery about it."}, {"viet": "Những cái cây đó cần được tưới nước hàng ngày.", "eng": "The plants want to be watered daily."}, {"viet": "Các nhân viên bảo vệ thông tin mật thúc đẩy các bộ điều tra bằng những cuộc phỏng vấn và những cuộc trắc nghiệm bằng máy nói sự thật.", "eng": "The plumbers pushed the departments to investigate with interviews and polygraph tests."}, {"viet": "Cảnh sát phải khó khăn lắm mới ngăn chặn được đám đông khỏi đổ xô vào sân bóng.", "eng": "The police had difficulty in restraining the crowd from rushing on to the pitch."}, {"viet": "Cảnh sát thường bắt rất nhiều người uống rượu lái xe vào đêm Giao thừa.", "eng": "The police usually have a glass number of DUI arrest an New Year's Eve."}, {"viet": "Người khuân vác oằn người dưới tất cả đống hành lý.", "eng": "The porter was weighed down by all the luggage."}, {"viet": "Luật hiện tại dự liệu trường hợp này.", "eng": "The present law makes no provision for this."}, {"viet": "Sức ép của đám đông vào các rào chắn.", "eng": "The pressure of the crowd against the barriers."}, {"viet": "Ông hiệu trưởng tiến hành một cuộc điều tra xem ai là người đã ăn cắp sách.", "eng": "The principal carried out a probe to find out who had stolen the books."}, {"viet": "Sự thu mua hàng hoá, nguyên vật liệu, đồ quân nhu, vũ khí.", "eng": "The procurement of goods, raw materials, supplies, weapons."}, {"viet": "Luật sư bên nguyên đối chất nhân chứng bên bị.", "eng": "The prosecution lawyer cross-examined the defense witness."}, {"viet": "Phẩm chất bài làm của bạn báo trước điều tốt đẹp cho kì thi tháng tới.", "eng": "The quality of your work augurs well for the examinations next month."}, {"viet": "Mưa không thể thấm sâu vào mặt đất nhanh như khi rơi xuống.", "eng": "The rain cannot sink into the ground as fast as it falls."}, {"viet": "Giống bò Holstein đạt kỷ lục cao nhất.", "eng": "The record is held by a Holstein cow."}, {"viet": "Bản báo cáo về bệnh viện nêu lên những nguyện vọng như việc cung cấp quần áo giặt là sạch.", "eng": "The report on the hospital mentions such desiderata as a supply of clean laundry."}, {"viet": "Sự hồi sinh của ngôn ngữ xứ Gan.", "eng": "The revival of the Welsh language."}, {"viet": "Sau khi qua chỗ chắn tàu thì con đường phân thành nhiều ngả.", "eng": "The road branches after the level-crossing."}, {"viet": "Phòng có mùi giống bệnh viện.", "eng": "The room smells like a hospital."}, {"viet": "Sự tế thần một con bò đực cho thần Ju-pi-te.", "eng": "The sacrifice of an ox to Jupiter."}, {"viet": "Những vẻ đẹp rực rỡ của cảnh vật dãy núi Rôcky.", "eng": "The scenic splendours of the Rocky Mountains."}, {"viet": "Những chỗ ngồi ở đó rẻ tiền và bạn có thể thấy trận đấu rõ hơn.", "eng": "The seats there are cheap and you can see the game better."}, {"viet": "Lời lẽ vớ vẩn phân biệt giới tính của những người đàn ông khoe khoang và gắn bó với nhau.", "eng": "The sexist jive of men boasting and bonding."}, {"viet": "Con tàu bị vỡ tan thành từng mảnh kim loại.", "eng": "The ship was broken up for scrap metal."}, {"viet": "Con chó ốm sùi bọt mép.", "eng": "The sick dog foamed at the mouth."}, {"viet": "Cái váy này được cắt xéo.", "eng": "The skirt is cut on the bias."}, {"viet": "Các đảng viên đảng Xã Hội đã đạt được đa số tuyệt đối về số phiếu.", "eng": "The Socialists won an absolute majority."}, {"viet": "Bờ phía nam của cánh đồng.", "eng": "The south side of the field."}, {"viet": "Hình vuông được cho là khác biệt với hình chữ nhật.", "eng": "The squared as distinct from the rectangle."}, {"viet": "Hòn đá trúng ngay bên đầu anh ta.", "eng": "The stone caught him on the side of the head."}, {"viet": "Cơn đột quỵ đã làm ông ta liệt nửa người.", "eng": "The stroke left him paralysed on one side of his body."}, {"viet": "Ánh mặt trời chiếu qua kẽ lá tạo nên những đốm sáng trên mặt đất.", "eng": "The sun shining through the leaves dappled the ground."}, {"viet": "Người lái ta xi được một khoản tiền môi giới nếu anh ta đưa khách du lịch tới đó.", "eng": "The taxi driver gets a rake-off from the hotel if he takes tourists there."}, {"viet": "Đội bóng đã được động viên vào buổi sáng của trận đấu quan trọng.", "eng": "The team was given a peptalk on the morning of the big match."}, {"viet": "Phép chữa bệnh tỏ ra không công hiệu.", "eng": "The therapy proved to be inefficacious."}, {"viet": "Sắp đến lúc chúng ta phải đi rồi.", "eng": "The time is approaching when we will have to leave."}, {"viet": "Trên xa lộ này xe cộ không đông lắm.", "eng": "The traffic is not very heavy on this highway."}, {"viet": "Tam ca trình bày cho khách của khách sạn với ba nhạc cụ khác nhau.", "eng": "The trio entertained the hotel guests, with three different instruments."}, {"viet": "Hai đội hình hành quân hàng dọc chuyển lại gần hơn và cuối cùng nhập vào nhau.", "eng": "The two marching columns moved closer and finally merged."}, {"viet": "Công đoàn thương lượng ( với ban quản trị ) về tuần làm việc ngắn hơn.", "eng": "The unions bargained ( with management ) for a shorter working week."}, {"viet": "Người ta đã tìm thấy thân thể của nạn nhân bị chặt chân tay trong một cái rương.", "eng": "The victim's dismembered body was found in a trunk."}, {"viet": "Điệu valse là điệu phổ biến nhất trong các phòng khiêu vũ.", "eng": "The waltz used to be the most popular of the ballroom dances."}, {"viet": "Phần phía trước phía tây nhà thờ có vài cánh cửa sổ cổ rất đẹp.", "eng": "The west front of the church contains some fine old windows."}, {"viet": "Gió rền rĩ trong hàng cây.", "eng": "The wind was moaning through the trees."}, {"viet": "Công việc tốt đấy, nhưng vẫn có thể làm tốt hơn.", "eng": "The work is good, yet it could be better."}, {"viet": "Cái vẻ bề ngoài trẻ trung đang là mốt của năm nay.", "eng": "The young look is in fashion this year."}, {"viet": "Hạnh phúc của họ đã chóng tàn một cách đáng buồn.", "eng": "Their happiness was to be sadly transient."}, {"viet": "Cách xử sự của họ đối với nhau gần như là tàn nhẫn.", "eng": "Their treatment of each other bordered on brutality."}, {"viet": "Vậy là ông hỏi đúng chỗ đấy.", "eng": "Then your're in the right place."}, {"viet": "Mỗi khi tôi chọn bít tất ra bao giờ cũng lẻ một chiếc.", "eng": "There's always an odd one out when I sort out my socks."}, {"viet": "Không có gì mới trong cuốn sách này, tác giả đã chắp nhặt rất nhiều ý tưởng cũ kỹ.", "eng": "There's nothing new in this book, the writer has fudged up a lot of old ideas."}, {"viet": "Có bốn lối ra khẩn cấp trong cửa hàng bách hoá.", "eng": "There are four emergency exits in the department store."}, {"viet": "Có một vài dấu hiệu cho thấy hàng bán được đang tăng lên.", "eng": "There are some signs of sales increasing."}, {"viet": "Có những xung đột gay gắt ở nghị viện giữa những người ủng hộ và phản đối Tổng thống.", "eng": "There have been angry clashes in the Senate between supporters and opponents of the President."}, {"viet": "Có tinh thần anh em gắn bó giữa những con người cô độc này.", "eng": "There is a strong spirit of fraternity among these isolated people."}, {"viet": "Có khối việc trong vườn cần phải làm.", "eng": "There is plenty of work to be done in the garden."}, {"viet": "Khuynh hướng chung là lờ vấn đề đi.", "eng": "There was a general disposition to ignore the problem."}, {"viet": "Không có gì ngoài sự yên lặng trong khu nhà trống.", "eng": "There was nothing but silence in the empty house."}, {"viet": "Có cây ở những khoảng cách đều nhau dọc đường đi.", "eng": "There were trees at intervals along the road."}, {"viet": "Những kết quả tuyệt vời này làm rạng danh toàn thể đội ngũ chúng ta.", "eng": "These excellent results reflect great credit on all our staff."}, {"viet": "Những quy định này được đặt ra để bảo vệ trẻ em.", "eng": "These regulations were made to protects children."}, {"viet": "Họ đang diễn vở'Carmen'tại nhà hát Coliseum.", "eng": "They're playing'Carmen'at the Coliseum."}, {"viet": "Họ kí vào bản tuyên bố.", "eng": "They appended their signatures to the statement."}, {"viet": "Họ yêu cầu anh ta rời cuộc họp và do đó anh ta đi.", "eng": "They asked him to leave the meeting, and accordingly he went."}, {"viet": "Họ đã than phiền về sự phục vụ tồi nhưng cũng không được ông giám đốc làm hài lòng.", "eng": "They complained about the bad service, but got no joy from the manager."}, {"viet": "Họ đã lái xe ra khỏi trung tâm thành phố, mà tiếng xe cộ ầm ầm vẫn còn vang trong tai họ.", "eng": "They drove away from the city centre, the roar of the traffic still dinning in their ears."}, {"viet": "Họ có một quán uống không mất tiền nhân chiêu đãi thị trưởng.", "eng": "They had an open bar at the mayor's reception."}, {"viet": "Họ tăng số tiền tính thêm cho những người vay lớn.", "eng": "They increased the surcharge for big borrowers."}, {"viet": "Họ có thể xây đập ngăn một dòng sông lớn hơn để giữ nước sau những cơn mưa lớn và ngăn ngừa lũ lụt.", "eng": "They may dam a bigger stream to hold back the water after heavy rains and prevent floods."}, {"viet": "Họ trình bày một bản kiến nghị lên nhà cầm quyền.", "eng": "They presented a petition to the governor."}, {"viet": "Họ đã nhất trí cuộc mặc cả bằng cái bắt tay.", "eng": "They sealed the bargain with a handshake."}, {"viet": "Họ tưởng rằng họ sẽ dễ dàng thắng cử, nhưng miếng ăn đến miệng rồi vẫn còn có thể tuột mất.", "eng": "They think they'll win the election easily, but there's many a slip twixt the cup and the lip."}, {"viet": "Họ bị bắt giữ vì say rượu và phá vỡ trật tự công cộng.", "eng": "They were arrested for being drunk and disorderly."}, {"viet": "Chúng có tên là San-ta Ma-ri-a, Pin-ta và Ni-na.", "eng": "They were the Santa Marie, the Pinta, and the Nina."}, {"viet": "Cuộc họp chiều nay đã được hoãn đến tuần sau.", "eng": "This afternoon's meeting has been put back to next week."}, {"viet": "Chiếc áo khoác này sẽ làm anh không bị ướt trong trời mưa.", "eng": "This coat will keep you dry in the rain."}, {"viet": "Bằng chứng này củng cố thêm quan điểm của tôi rằng hắn ta là một tên gián điệp.", "eng": "This evidence reinforces my view that he is spy."}, {"viet": "Đây là một điều bí mật, song tôi biết là tôi có thể tin vào tính thận trọng của anh.", "eng": "This is a secret, but I know I can count on your discretion."}, {"viet": "Điều này đúng đối với tiếng Anh, chứ không đúng với tiếng Pháp.", "eng": "This is true with respect to English but not to French."}, {"viet": "Bằng chứng mới này xác nhận ý kiến của tôi là họ nói dối.", "eng": "This new evidence confirms my opinion that they are lying."}, {"viet": "Thứ sản phẩm này không hấp dẫn thị trường Đức.", "eng": "This product did not appeal to the German market."}, {"viet": "Bức tượng này có tính chất cổ xưa đủ để thu hút sự chú ý của các tay chơi đồ cổ.", "eng": "This statue is of sufficient antiquity to engage the attention of antiquaries."}, {"viet": "Cối xay gió này thiết kế nhằm thích ứng với những nhu cầu khác nhau của địa phương.", "eng": "This windmill was designed for adaptation to different local requirements."}, {"viet": "Giấy chứng nhận gửi tiền kỳ hạn trả lãi suất cao hơn việc gửi tiền bình thường.", "eng": "Time Certificates of Deposit pay a higher rate of interest than regular deposits do."}, {"viet": "Các du khách đặc biệt bị mẫn cảm với các trục trặc về dạ dày.", "eng": "Tourist are particularly susceptible to stomach problems."}, {"viet": "Các hạt giống được lấy ra bằng tay cho mãi tới khi ông Eli Whitnay phát minh ra máy tỉa hạt bông vào năm 1793.", "eng": "Until Eli Whitney invented the cotton gin in 1793 the seeds were taken out by hand."}, {"viet": "Những nốt đốt của ong bắp cày là trầm trọng, tôi biết qua kinh nghiệm bản thân.", "eng": "Wasp stings are serious, as I know to my cost."}, {"viet": "Chúng ta sẽ phải dùng đèn pin khi sử dụng phòng tắm.", "eng": "We'll need to use a flashlight, when using the bathroom."}, {"viet": "Chúng tôi rời khỏi nhà ga chính lúc sáu giờ.", "eng": "We're leaving from the main station at six o'clock."}, {"viet": "Chúng tôi đã chọn ngày 14 tháng tư làm ngày cưới.", "eng": "We've fixed on the 14th of April for the wedding."}, {"viet": "Tất cả chúng ta đều đã ăn một số loại bánh, có lẽ tôi là người ăn nhiều nhất.", "eng": "We all had some of the cake, I probably ate the most."}, {"viet": "Chúng tôi sẽ thi đấu với trường Đại học ABC.", "eng": "We are playing against ABC University."}, {"viet": "Chúng tôi gọi cái này là parking meter.", "eng": "We call this a parking meter."}, {"viet": "Chúng tôi không thể buộc được anh phải làm ( cái đó ), nhưng chúng tôi nghĩ rằng anh nên làm.", "eng": "We cannot compel you to ( do it ), but we think you should."}, {"viet": "Chúng tôi đã làm xong công việc trong phạm vi thời gian người ta đã phân định cho chúng tôi.", "eng": "We did the work within the time they'd allotted ( to ) us."}, {"viet": "Chúng tôi cảm thấy nhẹ nhõm khi nghe tin anh an toàn.", "eng": "We felt relieved to hear you were safe."}, {"viet": "Tôi gặp rất nhiều rắc rối trong việc thuyết phục để họ đồng ý.", "eng": "We had no end of trouble getting them to agree."}, {"viet": "Chúng ta có mọi lý do để nghĩ rằng nó có thể còn sống.", "eng": "We have every reason to think he may still be alive."}, {"viet": "Chúng tôi nghe thấy một tiếng nổ rất lớn hình như tiếng nổ trong xi lanh.", "eng": "We heard a very loud report, which seemed to be a backfire."}, {"viet": "Chúng ta sẽ phải sớm, họp mặt nhau lại nhé.", "eng": "We'll have to get together again soon."}, {"viet": "Chúng ta phải đảm bảo sự liên tục trong việc cung cấp nhiên liệu.", "eng": "We must ensure continuity of fuel supplies."}, {"viet": "Chúng ta cần phải xem xét vấn đề chi phí.", "eng": "We need to go into the question of costs."}, {"viet": "Thật sự chúng ta phải tẩy sạch cẩn thận.", "eng": "We really have to clean carefully."}, {"viet": "Chúng ta nên viết nhiều bài hơn về người Mỹ bản địa.", "eng": "We should do more stories about Native Americans."}, {"viet": "Chúng tôi cố gắng làm anh ta hiểu, nhưng anh ta đã đi quá xa không nghe chúng tôi nói gì nữa hết.", "eng": "We tried to make him understand, but he was too far gone to take in what we were saying."}, {"viet": "Vào cuối chuyến đi, tất cả chúng tôi đều mệt lử.", "eng": "We were all suffering from fatigue at the end of our journey."}, {"viet": "Chúng ta đang chứng kiến sự phát triển khoa học quan trọng nhất thế kỉ.", "eng": "We were witnessing the most important scientific development of the century."}, {"viet": "À, theo hợp đồng ký kết giữa hai ngân hàng, chúng tôi sẽ hoàn lại tiền nhân danh họ cho những ngân phiếu du lịch bị mất với số tiền 1,000 đô la Mỹ đầy đủ để thay thế những ngân phiếu du lịch.", "eng": "Well, according to the agreement made between the two banks, we'll refund on their behalf the lost traveller's cheques in full amount of US $ 1,000 in replacement traveller's cheques."}, {"viet": "À, thưa ông Wilson, tôi muốn nâng ly chúc sức khoẻ của ông.", "eng": "Well, Mr. Wilson, I'd like to propose a toast to your health."}, {"viet": "Nhiệt độ trung bình ở Luân Đôn vào một ngày mùa hè như thế nào?", "eng": "What's the average temperature in London on a summers day?"}, {"viet": "Lợi ích của việc làm tình nguyện là gì?", "eng": "What are the benefits of volunteering?"}, {"viet": "Bạn đã làm gì với cái máy giặt cũ của bạn?", "eng": "What did you do with your old one?"}, {"viet": "Khơi ra thì có tốt gì?", "eng": "What good does it do to bring them up?"}, {"viet": "Tạp chí về kinh doanh nào đứng hàng đầu ở đất nước bạn?", "eng": "What is the number one business magazine in your country?"}, {"viet": "Ở nước bạn, các cửa hàng phục vụ 24/24 giờ có bán các loại sản phẩm nào?", "eng": "What kinds of products are available at convenience stores in your home country?"}, {"viet": "Năm tới bạn sẽ gặp chủ đề gì?", "eng": "What subject matter will you study next year?"}, {"viet": "Lúc còn là cậu bé, con gái ít được cậu quan tâm đến.", "eng": "When a small boy, a girl is of little interest."}, {"viet": "Khi người vợ cũ của anh ta đến buổi liên hoan, anh ấy liền rời nhanh.", "eng": "When his ex-wife arrived at the party he made a swift exit."}, {"viet": "Khi cô ta phát hiện bị mất túi, cô ta đi báo cảnh sát.", "eng": "When she discovered the theft of her bag she went to the police."}, {"viet": "Khi người con gái xinh đẹp này đến, tất cả các trang nam nhi ở trong phòng đều bị hút về phía cô ta.", "eng": "When this beautiful girl arrived, all the men in the room gravitated towards her."}, {"viet": "Tôi có thể chuyển đổi tiền của tôi lấy nhân dân tệ Trung Quốc ở đâu?", "eng": "Where can I Convert my money for Chinese yuan?"}, {"viet": "Nước nào có số dân đông thứ hai?", "eng": "Which country has the second largest population?"}, {"viet": "Người nào trong các anh đến đầu tiên sẽ được nhận một giải thưởng.", "eng": "Whichever of you comes first will receive a prize."}, {"viet": "Đội bóng chày chơi hay nhất ở Nhật Bản là đội nào?", "eng": "Who is the best baseball team in Japan?"}, {"viet": "Bạn nghĩ xem tại sao tuổi thọ trung bình của người Nhật là quá cao?", "eng": "Why do you think the life expectancy of Japanese people is so high?"}, {"viet": "Có ai trả giá 200 bảng cho bức tranh này không?", "eng": "Will anyone bid £ 200 for this painting?"}, {"viet": "Xin anh vui lòng bỏ giúp thư này vào thùng cho tôi, được không?", "eng": "Will you post this letter for me, please?"}, {"viet": "Theo cung cách lịch sự thường ngày, anh ta đã nhường ghế cho cô ấy.", "eng": "With his habitual good manners, he offers her his seat."}, {"viet": "Làm việc trong môi trường mới và xa lạ.", "eng": "Working in new and unfamiliar surroundings."}, {"viet": "Anh có muốn gọi điện về nhà không?", "eng": "Would you like to call home?"}, {"viet": "Xin vui lòng gửi cho chúng tôi ca-ta-lô và những điều kiện ưu đãi nhất đối với mặt hàng mới này nhé?", "eng": "Would you please send us your catalogue and best terms for this new product?"}, {"viet": "Phải, nhưng chúng ta phải đi nhanh lên.", "eng": "Yes, but we've got to hurry."}, {"viet": "Chúng ta sẽ ký một hợp đồng ba năm.", "eng": "Yes, we'll have a three-year lease."}, {"viet": "Anh phải chơi đẹp với nó một chút, nó sẽ làm được việc đấy.", "eng": "You'll have to jolly him along a bit, but he'll do a good job."}, {"viet": "Anh phải chịu trách nhiệm với người phụ trách việc bán hàng.", "eng": "You're responsible to whoever is in charge of sales."}, {"viet": "Anh không có quyền hưởng trợ cấp thất nghiệp nếu anh chưa bao giờ làm việc cả.", "eng": "You are not entitled to unemployment benefit if you have never worked."}, {"viet": "Anh không thể lạm dụng các qui tắc để làm lợi cho mình.", "eng": "You can't stretch the rules to suit yourself."}, {"viet": "Anh có thể tin cậy ở trình độ nghiệp vụ của cố vấn pháp luật của anh trong việc giải quyết chuyện mua căn nhà này.", "eng": "You can rely on your solicitor's professionalism in dealing with the house purchase."}, {"viet": "Anh không đánh giá đúng tầm quan trọng thành tựu của chị ấy.", "eng": "You don't appreciate the magnitude of her achievement."}, {"viet": "Cháu phải đi bác sĩ khám thôi.", "eng": "You have to go to the doctor."}, {"viet": "Anh có thể giữ quyền sách miễn là anh giữ nó sạch sẽ.", "eng": "You may borrow the book so long as you keep in clean."}, {"viet": "Anh phải tự chịu trách nhiệm thanh toán các hoá đơn này.", "eng": "You must make yourself personally responsible for paying these bills."}, {"viet": "Ngài đã đặt tôi vào thế khó xử bởi yêu cầu tôi bình luận về công việc của đồng nghiệp tôi.", "eng": "You put me in an invidious position by asking me to comment on my colleague's work."}, {"viet": "Anh nên ăn no bây giờ-anh có thể không có bữa nào nữa ngày hôm nay đâu.", "eng": "You should stoke up now-you may not get another meal today."}, {"viet": "Anh đã được báo trước rõ ràng là đừng ăn cá.", "eng": "You were specifically warned not to eat fish."}, {"viet": "Lập luận của anh chúng tôi đã rõ ngay từ đầu-không cần phải nói đi nói lại mãi nữa.", "eng": "Your argument was clear to us from the start-there's no need to labour the point."}, {"viet": "Việc bổ nhiệm anh vừa công bố, thì anh đi Hồng Kông.", "eng": "Your posting has just come through, you're going to Hong Kong."}]