[{"viet": "Thời buổi này 20 bảng Anh chẳng nghĩa lý gì khi bạn phải nuôi một gia đình.", "eng": "20 goes nowhere when you're feeding a family these days."}, {"viet": "Đại uý thấp hơn thiếu tá.", "eng": "A captain is inferior to a major."}, {"viet": "Một nhân viên khách sạn dẫn khách đến phòng và trả lời những câu hỏi của khách.", "eng": "A clerk shows the guest to his room and answers the guest's questions."}, {"viet": "Một nước dưới quyền bá chủ của một nước láng giềng hùng mạnh của nó.", "eng": "A country under the suzerainty of its powerful neighbour."}, {"viet": "Một nhân tố quyết định trong sự phát triển tâm lý của anh ta.", "eng": "A determinative factor in his psychological development."}, {"viet": "Một vị trí sau chiến tuyến của chúng ta có thể rút lui về được.", "eng": "A fallback position behind our lines."}, {"viet": "Một con cá bị vướng vào lưới.", "eng": "A fish tangled in the meshes of the net."}, {"viet": "Tình trạng dư thừa trái cây, phim Mỹ, tài năng.", "eng": "A glut of fruit, of American films, of talent."}, {"viet": "Một người khách trọ muốn mượn cái biến thế.", "eng": "A guest wants to borrow a transformer."}, {"viet": "Một căn nhà cần được sửa chữa lớn.", "eng": "A house in need of a major refit."}, {"viet": "Cái nón lớn làm nền cho khuôn mặt xinh đẹp của cô gái.", "eng": "A large hat framed the girl's pretty face."}, {"viet": "Một luồng khói nhỏ bốc xoáy trên chỗ tro tàn của ngọn lửa.", "eng": "A little smoke eddied above the ashes of the fire."}, {"viet": "Một người không bao giờ để mình dính líu vào bạo lực.", "eng": "A man who would never lend himself to violence."}, {"viet": "Một tháng lương 450 bảng Anh, trừ tiền thuế và bảo hiểm quốc gia.", "eng": "A month salary of £ 450, less tax and national insurance."}, {"viet": "Một đôi vợ chồng mới cưới sống ở trên lầu.", "eng": "A newly-married couple live upstairs."}, {"viet": "Một sự rõ ràng bất chấp sự thật.", "eng": "A patent disregard for the truth."}, {"viet": "Một ý định đã bắt đầu xuất hiện trong đầu anh ta.", "eng": "A plan began to form in his mind."}, {"viet": "Một lối phối hợp màu rất ngộ giữa hồng nhạt và xanh da trời.", "eng": "A pretty-pretty colour scheme of pale pinks and blues."}, {"viet": "Một thái độ khá thiển cận đối với cuộc đời.", "eng": "A rather suburban attitude to life."}, {"viet": "Căn phòng được sơn màu xanh lá cây và xanh dương trông mát mắt.", "eng": "A room painted in cool greens and blues."}, {"viet": "Một loạt những xung đột ở vùng biên giới dẫn đến cuộc chiến tranh toàn diện.", "eng": "A series of border clashes which culminated in full-scale war."}, {"viet": "Một chiếc thuyền nhỏ cái mà đã đâm vào đá ngầm.", "eng": "A sloop that had run foul of the submerged reef."}, {"viet": "Một lời phát biểu chúc mừng cho người chiến thắng.", "eng": "A speech of congratulation for the winner."}, {"viet": "Cậu ấy bỗng dưng bị bệnh.", "eng": "A sudden illness overtook him unexpectedly."}, {"viet": "Một lớp tuyết mỏng cứng bên ngoài.", "eng": "A thin crust of frozen snow."}, {"viet": "Một buổi trình diễn rất nhuần nhuyễn nhưng không có hồn.", "eng": "A very polished performance, but without a soul."}, {"viet": "Một phụ nữ có năng lực trí tuệ đáng thán phục.", "eng": "A woman of impressive intellectual powers."}, {"viet": "Người ta đã buộc tội tham nhũng cho ông ta.", "eng": "Accusations of corruption have been laid against him."}, {"viet": "Quảng cáo chủ yếu nhắm vào giới tiêu thụ trẻ.", "eng": "Advertising directed mainly at young consumers."}, {"viet": "Sau cái chết của vợ, ông ta phải mất hai năm mới bình tâm trở lại.", "eng": "After his wife's death it took him two years to get back on his feet."}, {"viet": "Sau khi cuốn sách đã được biên tập xong, mọi sự đều suôn sẻ tới lúc hoàn tất dự án này.", "eng": "After the editing of the book had been finished, it was plain sailing to the end of the project."}, {"viet": "Cồn được dùng làm chất bảo quản cho một số loại thực phẩm.", "eng": "Alcohol is used as a preservative in certain foods."}, {"viet": "Được rồi, tôi sẽ chở anh đến đó.", "eng": "All right, I will take you there."}, {"viet": "Tất cả những con ở trang 40 là bướm đêm.", "eng": "All those on 40 page are moths."}, {"viet": "Các khách du lịch Mỹ hoàn toàn không biết tiếng Pháp.", "eng": "American tourists wholly innocent of French."}, {"viet": "Một ủng hộ viên nhiệt tình cho đội bóng đá nhà.", "eng": "An ardent supporter of the local football team."}, {"viet": "Một cuốn sách bài tập vấy đầy mực.", "eng": "An exercise book blotted with ink."}, {"viet": "Một vấn đề được thảo luận nhiều ở cấp cao.", "eng": "An issue much discussed in the corridors of power."}, {"viet": "Một người thợ bất hạnh, bị bó buộc phải làm công việc mà anh ta ghét.", "eng": "An unhappy worker, condemned to a job he hates."}, {"viet": "Vậy ông muốn đổi hết chứ?", "eng": "And you want to exchange it all?"}, {"viet": "Dù sao đi nữa thì kỳ nghỉ ở Thụy Điển cũng rẻ hơn kỳ nghỉ ở Thụy Sĩ.", "eng": "Anyway, the holiday in Sweden was cheaper than the holiday in Switzerland."}, {"viet": "Có nhiều người hút thuốc à?", "eng": "Are there many people who smoke?"}, {"viet": "Có phải anh ám chỉ tôi là tên nói dối không?", "eng": "Are you insinuating that I am a liar?"}, {"viet": "Đến muộn một lần nữa là mày bị đuổi.", "eng": "Arrive late once more and you're fired."}, {"viet": "Như đa số các anh biết, tôi đã quyết định từ chức.", "eng": "As most of you know, I've decided to resign."}, {"viet": "Aspirin dưới những dạng khác nhau được bán dưới rất nhiều tên thương mại.", "eng": "Aspirin in various forms is sold under a wide range of trade names."}, {"viet": "Phía trước căn nhà, người ta đã trồng một khu vườn đẹp.", "eng": "At the front of the house, someone has planted a beautiful garden."}, {"viet": "Thời tiết xấu đã làm hỏng kế hoạch phóng con tàu vũ trụ hôm nay.", "eng": "Bad weather has frustrated plans to launch the spacecraft today."}, {"viet": "Bị phân biệt vì màu da của ai.", "eng": "Be discriminated against on account of one's colour."}, {"viet": "Bởi vì tôi muốn giữ không cho tăng cân.", "eng": "Because I want to keep my weight down."}, {"viet": "Ngoài ra, có các ngân hàng quốc tế, văn phòng chính phủ, công ty vận tải, nhà hàng, các cơ sở kinh doanh xuất nhập khẩu bên trong toà tháp đôi.", "eng": "Besides, there are international banks, government offices, transportation companies, restaurants and import and export businesses inside the twin towers."}, {"viet": "Đăng ký chuyến đi của ai đến Úc.", "eng": "Book one's passage to Australia."}, {"viet": "Nền công nghiệp chế tạo Anh đang giảm hoạt động dần trong nhiều năm nay.", "eng": "British manufacturing industry has been running down for years."}, {"viet": "Nhưng tôi không biết là chúng bị mất ở Montreal hay trên máy bay.", "eng": "But I don't know whether they were lost in Montreal or on board the plane."}, {"viet": "Nhưng hãy cố tìm mức giá rẻ nhất có thể có nhé.", "eng": "But try to find the cheapest rates available."}, {"viet": "Vào lúc thư này đến anh, thì chắc tôi đã rời khỏi đất nước.", "eng": "By the time that this letter reaches you I will have left the country."}, {"viet": "Liệu tôi có thể tin vào sự trung thành của ông không?", "eng": "Can I count on your loyalty?"}, {"viet": "Chúng ta có thể ăn cơm bây giờ được chứ-con đói rồi.", "eng": "Can we have lunch now-I'm hungry."}, {"viet": "Anh có thể đến dùng cơm trưa vào thứ Ba được không?", "eng": "Can you manage lunch on Tuesday?"}, {"viet": "Anh có thể viết cho tôi một câu chuyện về kỳ nghỉ của anh không?", "eng": "Can you write me a story about your holiday?"}, {"viet": "Xiềng xích là một biểu hiện của sự nô lệ.", "eng": "Chains are a badge of slavery."}, {"viet": "Nghệ thuật nhào lộn Trung Quốc có một lịch sử lâu dài, có thể đã có từ hai ngàn năm trước.", "eng": "Chinese acrobatics has a long history which can dates back to more than two thousand years ago."}, {"viet": "Cà phê gây nghiện một cách từ từ.", "eng": "Coffee is addictive in a mild way."}, {"viet": "Việc so sánh hai bản tường trình cho thấy nhiều sự khác biệt.", "eng": "Comparison of the two accounts revealed numerous disparities."}, {"viet": "Suy tưởng về cái chết của đức Chúa.", "eng": "Contemplating the death of Our Lord."}, {"viet": "Ông có thể cho chúng tôi biết đôi điều về giá cả của các ông được không?", "eng": "Could you give us some idea of your prices?"}, {"viet": "Những nếp nhăn quanh đôi mắt của một người già.", "eng": "Creases round an old man's eyes."}, {"viet": "Những dòng nước nguy hiểm có thể cuốn những người bơi xuống sâu.", "eng": "Dangerous currents can suck swimmers under."}, {"viet": "Các bộ sản sinh ra nhiều ủy ban và tiểu ban.", "eng": "Departments which spawn committees and sub-committees."}, {"viet": "Biểu diễn những động tác điêu luyện trên sân trượt băng.", "eng": "Did some handsome maneuvers on the skating rink."}, {"viet": "Đã chết ở độ tuổi 28, mòn mỏi qua nhiều năm tự hủy hoại bằng ma túy.", "eng": "Died at 28, wasted from years of self-destructing on drugs."}, {"viet": "Tôi có một chìa khóa duy nhất để mở hộp thôi à?", "eng": "Do I have the only key to the box?"}, {"viet": "Anh có thấy điều gì quan trọng trong điều hắn nói không?", "eng": "Do you attach any importance to what he said?"}, {"viet": "Bạn có một cuộc sống căng thẳng phải không?", "eng": "Do you have a stressful life?"}, {"viet": "Anh có biết ngày mai trời sẽ mưa không?", "eng": "Do you know if it will rain tomorrow?"}, {"viet": "Anh thích sân cỏ hay sân cứng?", "eng": "Do you prefer grass or hard courts?"}, {"viet": "Anh có nghĩ là chúng ta hoàn toàn chính đáng trong việc bỏ tiền vào việc phát triển hơn nữa sản phẩm mới của chúng ta không?", "eng": "Do you think we're justified in spending money on further development of our new product?"}, {"viet": "Cô ấy có tỏ ra có năng khiếu nào về thể thao không?", "eng": "Does she show any aptitude for games?"}, {"viet": "Đừng có là thằng phá đám!", "eng": "Don't be such a spoil-sport!"}, {"viet": "Mày đừng có để bị rắc rối!", "eng": "Don't go getting yourself into trouble!"}, {"viet": "Xin đừng đề cập tới vấn đề này nữa.", "eng": "Don't refer to this matter again, please."}, {"viet": "Đừng có đi lạc đề: hãy bám sát trọng tâm.", "eng": "Don't wander from the subject: stick to the point."}, {"viet": "Lái xe mà chẳng quan tâm tới giới hạn tốc độ.", "eng": "Drive without regard to speed limits."}, {"viet": "Khối lượng của trái đất ước tính có cấp độ lớn là 10 lũy thừa 22 tấn; khối lượng của mặt trời là 10 lũy thừa 27 tấn.", "eng": "Earth's mass is the order of magnitude of 10 power 22 tons; that of the sun is 10 power 27 tons."}, {"viet": "Thích lang thang trong một thành phố xa lạ.", "eng": "Enjoy wandering in a strange town."}, {"viet": "Tuần nào cũng vậy, thậm chí vào ngày Chủ nhật, cô ta đều viết thư cho bố mẹ.", "eng": "Every Sunday, week in, week out, she writes to her parents."}, {"viet": "Xin lỗi, tôi muốn biết tôi có thể thuê một người phiên dịch hay không.", "eng": "Excuse me, I'd like to know if I can hire an interpreter."}, {"viet": "Những nhân tố có tác dụng đưa đến một quyết định.", "eng": "Factors that are influential in reaching a decision."}, {"viet": "Cảm thông với ai đang đau khổ.", "eng": "Feel sympathetic towards somebody who is suffering."}, {"viet": "Lính cứu hoả cần có những dụng cụ thở để vào những tòa nhà đang cháy.", "eng": "Firemen needed breathing apparatus to enter the burning house."}, {"viet": "Hãy điều chỉnh cự ly máy ảnh của anh vào những cái cây kia.", "eng": "Focus your camera on those trees."}, {"viet": "Khỏi phải khiêu khích gì hết, tao sẽ bảo cho nó biết tao nghĩ gì về nó.", "eng": "For two pins I'd tell him what I think of him."}, {"viet": "Từ nay trở đi, bạn có thể tự làm lấy.", "eng": "From now on you can work on your own."}, {"viet": "George sẽ đứng ra điều hành về phía Mỹ của chúng ta.", "eng": "George is taking over the running of our American operation."}, {"viet": "Cho tôi tự do hoặc để tôi chết là một ví dụ của phép đối ngữ.", "eng": "Give me liberty, or give me death is an example of antithesis."}, {"viet": "Đi dạo một chuyến ở vùng quê.", "eng": "Go on a ramble in the country."}, {"viet": "Làm trầy chân của mình do va vào một tảng đá.", "eng": "Graze one's leg on a rock."}, {"viet": "Lao động cật lực là nền tảng thành công của anh ta.", "eng": "Hard work was the corner-stone of his success."}, {"viet": "Con lại đánh lộn với anh trai con phải không?", "eng": "Have you been fighting with your brother again?"}, {"viet": "Chúng ta có đủ bánh mì xăng-uýt cho bữa ăn trưa không?", "eng": "Have you got enough sandwiches for lunch?"}, {"viet": "Phải đổi tàu quả là một điều hơi bất tiện.", "eng": "Having to change trains is a small inconvenience."}, {"viet": "Hắn ta mong đợi điều gì sẽ xảy đến.", "eng": "He's always expecting something to turn up."}, {"viet": "Anh ta đã làm việc đúng đắn và đã từ chức.", "eng": "He's done the decent thing and resigned."}, {"viet": "Anh ta là bạn thân của tôi-đi đâu chúng tôi cũng có nhau.", "eng": "He's my alter ego-we go everywhere together."}, {"viet": "Hắn là con người bần tiện nhất mà tôi biết-cậu chẳng moi được của hắn cái gì đâu.", "eng": "He's the meanest person I know-you'll get damn all out of him."}, {"viet": "Anh ta luôn luôn cảm thấy khá lạc lõng trong giới doanh thương.", "eng": "He always felt a bit of a misfit in business world."}, {"viet": "Anh ta giúp vui chúng tôi bằng nhiều câu chuyện phiêu lưu mạo hiểm.", "eng": "He beguiled us with many a tale of adventure."}, {"viet": "Suýt nữa là ông ta đã bị giết.", "eng": "He came within an inch of being killed."}, {"viet": "Hắn dàn xếp với chủ nợ xin hoãn trả nợ.", "eng": "He compounded with his creditors for a postponement of payment."}, {"viet": "Anh ta đòi hoàn lại tiền cho những chiếc vé không sử dụng.", "eng": "He demanded a refund on the unused tickets."}, {"viet": "Anh ta chẳng có một cơ sở nào để dựa vào trong cuộc bàn cãi này.", "eng": "He doesn't have a leg to stand on in this debate."}, {"viet": "Anh ta phân trần về sự đến muộn của mình bằng cách đổ lỗi cho đường quá đông.", "eng": "He explained away his late arrival by blaming it on the crowded roads."}, {"viet": "Anh ta quất nhẹ roi vào con ngựa.", "eng": "He flicked the horse with his whip."}, {"viet": "Anh ta được trả một món tiền còm để làm việc đó.", "eng": "He gets paid peanuts for doing that job."}, {"viet": "Anh ta bị lầm đường lạc lối bởi những người bạn xấu.", "eng": "He had been led astray by undesirable friends."}, {"viet": "Hắn được thừa hưởng nhiều tiền của khi ông chú hắn qua đời.", "eng": "He has a lot of money coming to him when his uncles dies."}, {"viet": "Ông ta là một nhà học giả ít nổi tiếng.", "eng": "He has little repute as an academic."}, {"viet": "Anh ấy đánh đầu quả bóng vào khung thành để trống.", "eng": "He headed the ball into an open goal."}, {"viet": "Ông ta là một nhân vật vừa thuộc thế hệ xưa vừa thuộc thế hệ mới, một tay trùm phong kiến và một nhà kỹ trị tân tiến.", "eng": "He is both an old-world and a new-world figure, a feudal magnificent and a modern technocrat."}, {"viet": "Anh ta là con cả và vì vậy là người thừa kế tước hiệu.", "eng": "He is the eldest son and thus heir to the title."}, {"viet": "Trong thâm tâm anh ta biết rằng anh ta đã làm điều sai trái.", "eng": "He knew in his heart that he was doing the wrong thing."}, {"viet": "Anh ta sẽ có mặt ở đây trong chốc lát nữa.", "eng": "He'll be here very soon."}, {"viet": "Anh ta đạt được cấp trung sĩ trong 6 tháng.", "eng": "He made sergeant in six months."}, {"viet": "Anh ấy không bao giờ quên viết thư cho mẹ mình mỗi tuần.", "eng": "He never fails to write to his mother every week."}, {"viet": "Ông ta đã thuyết phục cô con gái thay đối ý kiến.", "eng": "He persuaded his daughter to change her mind."}, {"viet": "Nó dựa người vào cột cổng.", "eng": "He propped himself against the gatepost."}, {"viet": "Thỉnh thoảng nó cũng đọc sách, nhưng phần nhiều nó chỉ đọc tạp chí.", "eng": "He reads the occasional book, but mostly just magazines."}, {"viet": "Nó đặt cuốn từ điển lên kệ.", "eng": "He restored the dictionary to the shelf."}, {"viet": "Anh ta là một người đặc biệt dẻo dai.", "eng": "He's a very touch piece of work."}, {"viet": "Hắn ta đã hóa khùng rồi.", "eng": "He's gone soft in the head."}, {"viet": "Hiện giờ anh ấy đang nói chuyện trên đường dây khác.", "eng": "He's on another line right now."}, {"viet": "Ông ấy bảo chắc bà ta sắp về rất sớm và vừa vặn lúc đó bà ta bước vào.", "eng": "He said she would be back very soon and, right on cue, she walked in."}, {"viet": "Anh ta có vẻ rất thất vọng khi nhận được tin này.", "eng": "He seemed very downcast at the news."}, {"viet": "Nó tỏ ra hoàn toàn vô tình với số phận của con vật.", "eng": "He showed total insensibility to the animal's fate."}, {"viet": "Anh ta đã làm tôi mất hứng xem phim vì nói chuyện suốt buổi.", "eng": "He spoiled my enjoyment of the film by talking all the time."}, {"viet": "Ông ta tắt cái máy và rời căn phòng.", "eng": "He stopped the machine and left the room."}, {"viet": "Nó đã thuyết phục bố nó cho nó mượn chiếc ô tô.", "eng": "He talked his father into lending him the car."}, {"viet": "Anh ta có ác cảm ngay với ông chủ mới.", "eng": "He took an immediate aversion to his new boss."}, {"viet": "Nó cố kéo dài tôi để xin 5 bảng Anh.", "eng": "He tried to touch me for a fiver."}, {"viet": "Hắn bước vào, mặt dầy mày dạn hỏi mượn tôi 50 bảng Anh!", "eng": "He walked in, bold as brass, and asked me to lend him £ 50!"}, {"viet": "Ông ta bắt đầu hói từ khi 25 tuổi.", "eng": "He was already balding at the age of 25."}, {"viet": "Hắn bị buộc tội có ý định ăn cắp.", "eng": "He was charged with attempted robbery."}, {"viet": "Anh ta đã bị mê hoặc bởi người phụ nữ mà anh ta tình cờ gặp trong phòng đợi ở sân bay.", "eng": "He was fascinated by the woman he had encountered in the airport lounge."}, {"viet": "Anh ta đã bị hạ đo ván ở hiệp ba.", "eng": "He was knocked out in Round Three."}, {"viet": "Khi lên tới đỉnh đồi anh ta đổ mồ hôi xối xả.", "eng": "He was perspiring freely by the time he reached the top of the hill."}, {"viet": "Anh ta đang quằn quại trên nền nhà vì đau đớn.", "eng": "He was squirming around on the floor in agony."}, {"viet": "Anh ấy đã đóng vai đó rất hay.", "eng": "He was very good in the part."}, {"viet": "Nó vừa huýt sáo một điệu nhạc vui vừa đi.", "eng": "He whistled a happy tune as he walked along."}, {"viet": "Nếu như không có tiền thì anh ta đã đi với chúng ta rồi.", "eng": "He would have come with us but that he had no money."}, {"viet": "Chào bạn, tối nay bạn có bận không?", "eng": "Hello, are you going to be busy this evening?"}, {"viet": "Cách xử sự của cô ấy thì không trách cứ vào đâu được.", "eng": "Her behaviour was beyond reproach."}, {"viet": "Cái chết của cô ta là một nỗi đau buồn lớn cho cả gia đình.", "eng": "Her death was a great distress to all the family."}, {"viet": "Cha cô ấy miễn cưỡng đồng ý với đám cưới.", "eng": "Her father reluctantly consented to the marriage."}, {"viet": "Nhà cô ta ở ngay gần đây.", "eng": "Her house is just round the corner."}, {"viet": "Chiếc váy dài của nàng kéo lê trên sàn nhà.", "eng": "Her long skirt was trailing along the floor."}, {"viet": "Bức họa của cô ấy nhận được sự khen ngợi của thầy giáo.", "eng": "Her painting won a commendation from the teacher."}, {"viet": "Sự từ chức của cô ta đến khá ngạc nhiên.", "eng": "Her resignation came as a surprise."}, {"viet": "Cuộc nói chuyện của bà ta thu hút sức tưởng tượng của cả lớp.", "eng": "Her talk captured the imagination of the whole class."}, {"viet": "Đây là vài món quà cháu đã mang từ Nhật.", "eng": "Here are some gifts I brought from Japan."}, {"viet": "Bài tường thuật của anh ấy về các sự kiện là không nhất quán.", "eng": "His account of the events was inconsistent."}, {"viet": "Hành vi của nó chẳng bao lâu đã làm cho cô ta hiểu ra được những ý định chân thành của nó.", "eng": "His behaviour soon undeceived her as to his true intentions."}, {"viet": "Tình trạng của anh ta không hy vọng khá hơn.", "eng": "His condition is unlikely to improve."}, {"viet": "Sự đánh giá của anh ta cho rằng họ có thể làm công việc đó nhanh gấp đôi công ty trước xem ra hình như quá lạc quan.", "eng": "His estimate that they could do the job twice as quickly as the previous firm did seem rather overoptimistic."}, {"viet": "Tính thiếu nghiêm túc của anh ta khiến cho người ta khó mà nói chuyện đàng hoàng với anh ta.", "eng": "His flippancy makes it difficult to have a decent conversation."}, {"viet": "Bệnh hoạn của anh ta giải thích cho sự vắng mặt của anh ta.", "eng": "His illness accounts for his absence."}, {"viet": "Tình yêu của anh ta là sự giả vờ, anh ta chỉ muốn tiền của cô ấy thôi.", "eng": "His love was a sham, he only wanted her money."}, {"viet": "Nét bù lại duy nhất của anh ấy là lòng tốt của anh ấy.", "eng": "His one redeeming feature is his kindness."}, {"viet": "Đề nghị của anh ta gặp nhiều sự phản đối.", "eng": "His proposal encountered much hostility."}, {"viet": "Mục đích duy nhất của nó là nâng cao địa vị của bản thân.", "eng": "His sole aim is personal aggrandizement."}, {"viet": "Sự tin cậy toàn diện của ông ta vào những đồng nghiệp của mình.", "eng": "His total reliance on his colleagues."}, {"viet": "Công việc của anh ta bị hỏng vì anh ấy đã hoàn toàn bị thu hút vào thể thao.", "eng": "His work suffered because of his total absorption in sport."}, {"viet": "Bọn côn đồ là những kẻ gây kinh hoàng cho cả thành phố.", "eng": "Hooligans who are the terror of the entire town."}, {"viet": "Thế bây giờ bố mẹ em sao rồi, Paul?", "eng": "How are your father and your mother now, Paul?"}, {"viet": "Việc đầu tư của anh kết quả ra sao?", "eng": "How did you come out with your investment?"}, {"viet": "Ý kiến đó ảnh hưởng đến anh như thế nào?", "eng": "How does the idea strike you?"}, {"viet": "Đi Oxford mất bao lâu?''Khoảng một tiếng rưỡi, hơn kém vài phút gì đấy'.", "eng": "How long will it take us to get to Oxford?''About an hour and a half, give or take a few minutes'."}, {"viet": "Đã có bao nhiêu vệ tinh được đưa vào quỹ đạo trái đất?", "eng": "How many satellites have been put into orbit round the earth?"}, {"viet": "Anh ta có bao nhiêu tiền trong ngân hàng?-Khá nhiều đấy.", "eng": "How much money does he have in the bank?-A fair bit."}, {"viet": "Tuy nhiên, chúng tôi vẫn chưa bắt đầu làm thủ tục cho chuyến bay đó.", "eng": "However, we have not started checking-in for that flight yet."}, {"viet": "Tôi muốn một ly Côca Côla lớn có thêm nước đá và một ly sữa lắc.", "eng": "I'd like a large coke with extra ice and a milkshake."}, {"viet": "Anh muốn em giữ thông tin này trong phạm vi gia đình thôi.", "eng": "I'd prefer you to keep this information within the family."}, {"viet": "Tôi phải cố sửa cho xong chiếc xe đạp trong hôm nay mới được.", "eng": "I'll have a go at mending your bike today."}, {"viet": "Tôi sẽ trao đổi với bạn băng Michael Jackson của tôi với đĩa Bruce Springsteen của bạn.", "eng": "I'll swap you my Michael Jackson tape for your Bruce Springsteen album."}, {"viet": "Tôi sợ hôm nay là một ngày không hay của anh ta, anh ta thường chơi tốt hơn.", "eng": "I'm afraid this is one of his off day, he usually plays better."}, {"viet": "Ngày mai việc đầu tiên của tôi là đi mua sắm.", "eng": "I'm going shopping first thing in the morning tomorrow."}, {"viet": "Tôi dọn nhà đi, thật ra không có giận gì bạn hoặc những người ở đây, tôi chỉ không ưa cái không khí đó.", "eng": "I'm moving out-no offence to you or the people who live here, but I just don't like the atmosphere."}, {"viet": "Tôi rất quan tâm đến Tây Tạng, một nơi huyền bí.", "eng": "I'm quite interested in Tibet, a mysterious place."}, {"viet": "Tôi vẫn còn chưa quyết định về việc bỏ phiếu cho ai.", "eng": "I'm still undecided about who to vote for."}, {"viet": "Ông Stone, tôi rất đau buồn khi nghe nói rằng vợ ông đã ngã bệnh.", "eng": "I'm very distressed to hear that your wife has been taken ill, Mr. Stone."}, {"viet": "Tôi đã ngồi suốt ngày chầu chực chờ chuông điện thoại.", "eng": "I've been sitting around waiting for the phone to ring all da."}, {"viet": "Tôi có một ngày thật tồi tệ-mọi thứ dường như hỏng hết cả.", "eng": "I've had a dreadful day-everything seems to have gone wrong."}, {"viet": "Tôi chỉ có được 100 pao tiền tôi bán tất cả các món đó.", "eng": "I've only got 100 pounds to show for all the stuff I sold."}, {"viet": "Tôi ủng hộ chính sách cải tạo từng bước một.", "eng": "I advocate a policy of gradual reform."}, {"viet": "Tôi sẽ cần phải nghiên cứu kỹ chủ đề trước khi tôi viết bài.", "eng": "I am going to need to study up on the subject matter before write my paper."}, {"viet": "Tôi biện minh rằng chúng tôi cần một văn phòng lớn hơn.", "eng": "I argued that we needed a larger office."}, {"viet": "Tôi cuộc 3 bảng Anh về con ngựa chạy với số tiền trúng là 20 ăn 1 và được 60 bảng Anh!", "eng": "I bet three pounds on a horse running at odds of twenty to one and won sixty pounds!"}, {"viet": "Hôm nay tôi không giải được trò đố chữ-chắc là tôi cùn đi mất rồi.", "eng": "I can't do the crossword today-I must be losing my touch."}, {"viet": "Tôi không thể tiêu tiền nếu không có sự cho phép của văn phòng trung ương.", "eng": "I can't spend this money without authorization from Head Office."}, {"viet": "Tôi chỉ có thể chịu đựng được Joseph trong một thời gian ngắn.", "eng": "I can only tolerate Joseph in small doses."}, {"viet": "Tôi chẳng thấy ai quanh đây cả.", "eng": "I can't see any one around."}, {"viet": "Tôi chỉ có thể nằm ngửa giơ hai chân lên được 3 lần.", "eng": "I could only manage three sit-ups."}, {"viet": "Tôi muốn làm việc đó một lần nữa.", "eng": "I'd like to do it again."}, {"viet": "Tôi đã không đề cập vấn đề đó bởi vì tôi sợ làm anh ta đau buồn.", "eng": "I didn't mention it because I was afraid of upsetting him."}, {"viet": "Tôi không thú vị gì cái hoàn cảnh này nhưng tôi đành chấp nhận nó.", "eng": "I don't enjoy the situation, but I can live with it."}, {"viet": "Tôi không thích chiếc váy ấy, tôi muốn một cái khác.", "eng": "I don't like that dress, I want a different one."}, {"viet": "Tôi không biết tại sao anh ấy lại không có tiền.", "eng": "I don't understand why he hasn't got any money."}, {"viet": "Tôi không biết làm thế nào để điều khiển máy rút tiền tự động.", "eng": "I don't know how to handle the ATM."}, {"viet": "Tôi thích lúc nghỉ sau khi trượt tuyết hơn là chính môn trượt tuyết.", "eng": "I enjoyed the apres-ski more than the skiing itself."}, {"viet": "Tôi thấy đau nhói ở đầu rồi chuyện tiếp sau mà tôi biết được là mình tỉnh dậy trong bệnh viện.", "eng": "I felt a sharp pain in my head and the next thing I knew was waking up in hospital."}, {"viet": "Tôi thấy bài diễn văn của ông ấy hoàn toàn thích hợp với cuộc tranh luận đang diễn ra.", "eng": "I found his speech wholly apposite to the current debate."}, {"viet": "Tôi đánh vào phía sau đầu hắn ta bằng cây sắt.", "eng": "I got him on the back of the head with a crowbar."}, {"viet": "Tôi có cảm giác lạ lùng như bị theo dõi.", "eng": "I had an uncanny feeling of being watched."}, {"viet": "Tôi ghét đi chơi một mình: tôi đưa con gái tôi đi cùng.", "eng": "I hate going out alone: I take my daughter for company."}, {"viet": "Tôi nghi ngờ nhiều về sự thành thật của cô ta.", "eng": "I have great doubts about her honesty."}, {"viet": "Tôi có tin buồn cho anh đây, anh ta mở đầu một cách nghiêm trang.", "eng": "I have some distressing news for you, he began solemnly."}, {"viet": "Tôi chưa đọc'Cymbeline'nhưng tôi đã đọc tất cả các vở kịch khác của Shakespeare.", "eng": "I haven't read'Cymbeline'but I've read all the other plays by Shakespeare."}, {"viet": "Tôi nghe nói tối nay có thể có tuyết đấy.", "eng": "I heard that it might snow tonight."}, {"viet": "Con hy vọng bố đúng đấy nhưng đừng nói với con, hãy nói với công ty.", "eng": "I hope you are right, Dad, but don't tell me, tell the company."}, {"viet": "Tôi đá con chó, nó phản ứng lại bằng cách gầm gừ.", "eng": "I kicked the dog, which responded with a growl."}, {"viet": "Tôi để họ tự do một mình, vì tôi cảm thấy mình gây bất tiện.", "eng": "I left them alone, as I felt I was in the way."}, {"viet": "Tôi sẽ nhờ một nhân viên khách sạn chụp giúp.", "eng": "I'll ask a clerk to help."}, {"viet": "Tôi không muốn chấp nhận những ý tưởng điên rồ của anh.", "eng": "I'll have none of your wild ideas."}, {"viet": "Tôi nhìn ra ngoài cửa sổ nhưng không trông thấy gì cả.", "eng": "I looked out of the window but saw nothing."}, {"viet": "Tôi vui mừng là ông ta đã bình thường trở lại.", "eng": "I'm glad he's himself again."}, {"viet": "Tôi không biết chắc, có lẽ là 7 giờ.", "eng": "I'm not sure, perhaps 7:"}, {"viet": "Tôi cũng rất vui được gặp lại ông.", "eng": "I'm very happy to see you again."}, {"viet": "Tôi phải xin lỗi vì không thể gặp bạn được.", "eng": "I must apologize for not being able to meet you."}, {"viet": "Mình cần có kinh nghiệm mới kiếm được việc làm nhưng không có việc làm thì mình không thể nào có kinh nghiệm-đúng là một vòng luẩn quẩn.", "eng": "I need experience to get a job but without a job I can't get experience-it's a vicious circle."}, {"viet": "Tôi thường nghĩ rằng những chính trị gia phải ngưng cãi nhau như bọn trẻ con hư thân mất nết vậy.", "eng": "I often feel that politicians should have their heads knocked together, like naughty children."}, {"viet": "Tôi thích ăn thịt và hai món rau của tôi.", "eng": "I prefer to stick to my meat and two veg."}, {"viet": "Tôi thật sự thích nhạc rock và roll.", "eng": "I really like rock and roll."}, {"viet": "Tôi phẫn nộ về cái lối hắn cười khinh khi những nỗ lực của chúng ta.", "eng": "I resent the way he sneers at our efforts."}, {"viet": "Tôi thấy có những sự trùng hợp nhau giữa hai vụ.", "eng": "I see parallels between the two cases."}, {"viet": "Giá như em không đi tới đó một mình thì anh thích hơn.", "eng": "I should prefer it if you did not go there alone."}, {"viet": "Tôi vật lộn với vấn đề này hàng giờ trước khi hiểu được.", "eng": "I struggled with the problem for hours before I saw daylight."}, {"viet": "Tôi nghĩ rằng tình trạng của cô ấy đang khá lên nhưng đó có lẽ cũng chỉ là điều mơ tưởng của tôi.", "eng": "I think her condition is improving but it may just be wishful thinking on my part."}, {"viet": "Tôi nghĩ là con chó ấy bắt đầu thích tôi: nó theo tôi khắp.", "eng": "I think that dog has taken a shine to me: it follows me everywhere."}, {"viet": "Tôi cứ tưởng cô ta nhỏ nhắn và xinh đẹp, hoá ra hoàn toàn ngược lại.", "eng": "I thought she would be small and pretty but she's completely the opposite."}, {"viet": "Tôi đã tìm cách ngăn không cho nó qua cửa nhưng nó cứ xông bừa vào.", "eng": "I tried to stop him coming through the door but he just barged in."}, {"viet": "Tôi làm mất ngân phiếu du lịch của tôi.", "eng": "I've lost my traveler's cheques."}, {"viet": "Tôi muốn hớt tóc, nhưng không tìm được hiệu hớt tóc.", "eng": "I want to have my hair cut, but I can't find a barber shop."}, {"viet": "Tôi rất khó chịu, thực ra là tức giận, về chuyện đã xảy ra.", "eng": "I was annoyed, indeed furious, over what happened."}, {"viet": "Tôi đã ở trong hoàn cảnh đáng sợ-Tôi đã mất tiền và lỡ chuyến tàu.", "eng": "I was in a dreadful plight-I bad lost my money and missed the last train home."}, {"viet": "Tôi khiếp sợ đến nỗi hai chân run lẩy bẩy.", "eng": "I was so terrified that my legs were wobbling."}, {"viet": "Tôi ngắm cô ta trong khi cô ta chải tóc.", "eng": "I watched her as she combed her hair."}, {"viet": "Tôi mong sao tự mình có thể thoát khỏi Jill.", "eng": "I wish l could disentangle myself from Jill."}, {"viet": "Tôi tự hỏi không biết bạn thích nhạc kịch hay không?", "eng": "I wonder if you like opera or not?"}, {"viet": "Tôi muốn mua cái túi xách này.", "eng": "I would like to buy this bag."}, {"viet": "Tôi không muốn đi đến đấy sau khi trời tối, có thể bị trấn lột.", "eng": "I wouldn't go there after dark, you might get mugged."}, {"viet": "Nếu mọi việc tiến triển theo đúng kế hoạch, thì tôi sẽ trở lại trước khi trời tối.", "eng": "If everything goes according to plan, I shall be back before dark."}, {"viet": "Nếu cái đó không được xếp trong mục thể thao thì thử tìm trong mục tiểu sử xem.", "eng": "If It's not under sport, try looking under biography."}, {"viet": "Nếu có việc gì tôi có thể giúp anh, cứ mạnh dạn cho tôi biết nhé.", "eng": "If there's ever anything I can do for you, don't hesitate to let me know."}, {"viet": "Nếu anh đã xong rồi thì chúng ta có thể uống cà phê-nếu không anh nên cứ tiếp tục làm việc.", "eng": "If you've finished we can have a coffee-if not, you'd better keep working."}, {"viet": "Nếu anh không nhận được trả lời nhanh chóng, hãy giục họ.", "eng": "If you don't receive an answer quickly, give them a prod."}, {"viet": "Nếu anh cứ chọc tức con chó, nó sẽ cắn anh.", "eng": "If you provoke the dog, it will bite you."}, {"viet": "Nếu tay em lạnh thì cứ để chúng trong túi.", "eng": "If your hands are cold, keep them in your pockets."}, {"viet": "Trong bất cứ trường hợp nào, chúng tôi thấy có kẻ đã đánh lừa.", "eng": "In any case we found that someone had cheated."}, {"viet": "Trong thời hưng thịnh của mình, ông ta là một chính khách rất có thế lực.", "eng": "In his day, he was a very influential politician."}, {"viet": "Ở vào thời của Shakespeare, một ông chủ nhà in có thể lắng nghe một vở kịch của Shakespeare trình diễn, ghi nó vào giấy và sau đó in ấn và bán.", "eng": "In Shakespeare's time a printer might listen to one of Shakespeare's plays, write it down, and then print and sell it."}, {"viet": "Trong những nơi thầm kín nhất của tâm hồn.", "eng": "In the innermost recesses of the mind."}, {"viet": "Về nhiều mặt, chúng ta kém xa so với nhiều loài động vật có vú.", "eng": "In various ways we are far behind some of our mammal relatives."}, {"viet": "Đưa một đề tài nào vào cuộc nói chuyện.", "eng": "Introduce a subject into a conversation."}, {"viet": "Cô ấy có thề để làm chứng không?", "eng": "Is she prepared to give evidence on oath?"}, {"viet": "Có phải trong tiệm ăn không có chỗ nào tránh khỏi các thứ khói thuốc lá phảng phất khắp nơi hay sao?", "eng": "Is there no escape from the ubiquitous cigarette smoke in restaurants?"}, {"viet": "Đó là một công việc khó nhưng cô ấy là người có thể hoàn thành nó một cách tốt đẹp.", "eng": "It's a difficult job but she's the person to carry it through."}, {"viet": "Cứ cựa quậy, nhắc lên bỏ xuống ( dao, dĩa ) luôn tay ở bàn ăn là không lịch sự.", "eng": "It's bad manners to fidget about ( with the cutlery ) at the table."}, {"viet": "Tốt là ở chỗ kế hoạch của anh khớp với kế hoạch của chúng tôi.", "eng": "It's good that your plans chime with ours."}, {"viet": "Những phong tục cổ được làm cho sống lại thật là một điều hay.", "eng": "It's nice that these old customs are being revived."}, {"viet": "Có lẽ là bài tập báo động cháy, không phải là một vụ cháy thật.", "eng": "It's probably a fire drill, not a real fire."}, {"viet": "Về chuyện liên quan tới lá thư anh gửi cho tôi đó.", "eng": "It's to do with that letter you sent me."}, {"viet": "Tóm lại có hai cách lựa chọn: hoặc là anh cải tiến công việc hoặc là anh thôi việc.", "eng": "It comes down to two choices: you either improve your work, or you leave."}, {"viet": "Thật nhục nhã là bị cáo lại được tuyên bố vô tội.", "eng": "It is a scandal that the defendant was declared innocent."}, {"viet": "Tôi rất hân hạnh được nói với ông William Smith rằng “ chào mừng ông trở lại Hồng kong!", "eng": "It is my great pleasure to say to Mr. William Smith Well come back to Hong Kong!"}, {"viet": "Cười nhạo những nỗi bất hạnh của con người như vậy là không nhân đức.", "eng": "It isn't very Christian to laugh at people's misfortunes like that."}, {"viet": "Còn mấy phút nữa là 6 giờ.", "eng": "It's a few minutes before six o'clock."}, {"viet": "Đến nha sĩ khám thật là căng thẳng.", "eng": "It's stressful to see the dentist."}, {"viet": "Dường như điều này chắc chắn giống với phong cách của hắn.", "eng": "It sure does seem like his style."}, {"viet": "Chúng tôi đã được biết tin đó tám hôm nay rồi.", "eng": "It was a week yesterday that we heard the news."}, {"viet": "Anh thật tốt vô cùng rất cám ơn anh đã đưa tôi đến sân bay.", "eng": "It was most kind of you to take me to the airport."}, {"viet": "Bạn rất là sáng suốt trong việc tìm ra nguyên nhân sự rắc rối một cách nhanh chóng như thế.", "eng": "It was very perspicacious of you to find the cause of the trouble so quickly."}, {"viet": "Anh ta sẽ rắc rối to nếu tôi kể với vợ anh ta là anh đã ở đâu tối qua.", "eng": "It would really cook his goose if I told his wife where he was last night."}, {"viet": "Cha mẹ của John đã phản đối dự định mua xe gắn máy của cậu ta.", "eng": "John's parents vetoed his plan to buy a motorbike."}, {"viet": "Chỉ nghe nó huyên thuyên ngớ ngẩn cũng đã làm tôi mệt lử.", "eng": "Just listening to his silly chatter wears me out."}, {"viet": "Cuối cùng, tôi xin cám ơn tất cả mọi người đã cùng làm việc để cho mái trường mới này được thành công như hôm nay.", "eng": "Lastly, I'd like to thank everyone who was worked to make the new school such a success."}, {"viet": "Để tôi nghĩ xem, hôm nay hình như xe cộ rất đông đúc.", "eng": "Let me think, traffic seems to be very heavy today."}, {"viet": "Áo quần màu chói đôi khi có thể thú vị hơn đấy.", "eng": "Loud clothes can sometimes be more interesting."}, {"viet": "Nhiều người nói rằng tình hình bớt căng thẳng bây giờ là vấn đề lỗi thời rồi.", "eng": "Many people say that detente is now a dead letter."}, {"viet": "Che giấu sự sợ hãi bằng cách làm ra vẻ tự tin.", "eng": "Mask one's fear by a show of confidence."}, {"viet": "Cảm phiền bà rót cho tôi một tách nữa nhé?", "eng": "May I trouble you for another cup?"}, {"viet": "Tất cả mọi đứa trẻ đều thích kẹo nhưng cô ấy là một ngoại lệ.", "eng": "Most children like sweets, but she is the exception, she will not eat them."}, {"viet": "Thưa ông Smith, số dư tài khoản của ông là 500 đô la.", "eng": "Mr. Smith, you've got the balance of $ 500 at your account."}, {"viet": "Anh tôi không bao giờ để tôi đi xe đạp của anh ấy.", "eng": "My brother never lets me ride his bicycle."}, {"viet": "Cần câu của tôi vướng vào cỏ.", "eng": "My fishing line got entangled in weeds."}, {"viet": "Tôi tên là Li Lin ở ngân hàng Trung Quốc, chi nhánh Thượng Hải.", "eng": "My name is Li Lin from the Bank of China, Shanghai Branch."}, {"viet": "Cái bóp, hộ chiếu và các đồ dùng cá nhân khác của tôi.", "eng": "My wallet, passport and other personal effects."}, {"viet": "Những biện pháp mới bảo vệ các tài liệu riêng.", "eng": "New ways of safeguarding personal data."}, {"viet": "Không, nó có độ dài vừa phải rồi.", "eng": "No, it was just the right length."}, {"viet": "Không ai có thể dự kiến hết hậu quả cuộc chiến tranh hạt nhân tổng lực.", "eng": "Nobody can envisage the consequences of total nuclear war."}, {"viet": "Bây giờ có lẽ là lúc không thích hợp để yêu cầu tăng lương.", "eng": "Now would be an injudicious moment to ask for a rise."}, {"viet": "Ồ, tôi để quên thuốc lá ở phòng ngoài rồi.", "eng": "Oh, I've left my cigarettes in the hall."}, {"viet": "Vào một dịp ngoại giao, tốt nhất là bạn nên mặc đồ màu đen hoặc màu xanh da trời.", "eng": "On a diplomatic occasion, it's best for you to be dressed in black or blue."}, {"viet": "Một diễn viên múa đã suýt nữa thì sai bước.", "eng": "One dancer was fractionally out of step."}, {"viet": "Chỉ khi nào thầy giáo cho phép học sinh mới được vào phòng này.", "eng": "Only if a teacher has given permission is a student allowed to enter this room."}, {"viet": "Thắng lợi trong bầu cử đã uỷ thác cho chúng ta cải tổ nền kinh tế.", "eng": "Our election victory has given us a mandate to reform the economy."}, {"viet": "Người làm vườn mới của chúng tôi là một phát hiện tuyệt vời.", "eng": "Our new gardener was a marvellous find."}, {"viet": "Quân ta chọn những vị trí phòng thủ trên đất cao nhìn xuống dòng sông.", "eng": "Our troops took up defensive positions on high ground overlooking the river."}, {"viet": "Khi nào đọc xong, anh chuyển cuốn sách cho tôi.", "eng": "Pass the book on to me when you've finished with it."}, {"viet": "Những người dưới 21 tuổi không được nhập hội.", "eng": "People under 21 are excluded from joining the club."}, {"viet": "Xin vui lòng gửi cho chúng tôi giấy biên nhận chính thức của các ông.", "eng": "Please send us your official receipt."}, {"viet": "R U 18 là câu đố của Anh mười tám tuổi phải không?", "eng": "R U 18 is a rebus for Are you 18?"}, {"viet": "Xúc cùi ra và ăn với đường.", "eng": "Scoop out the pulp and serve it with sugar."}, {"viet": "Chúng ta ngồi dưới bóng cây và thư giãn một chút nhé?", "eng": "Shall we sit in the shade and relax a bit?"}, {"viet": "Bà ta luôn luôn đem con cái của bà ta ra làm gương về tư cách đạo đức.", "eng": "She's always holding up her children as models of behaviour."}, {"viet": "Cô ấy thu lượm được kinh nghiệm hay trong công việc.", "eng": "She's gaining good experience in the job."}, {"viet": "Hôm nay cô ấy không có ở bàn làm việc: cô ấy nghỉ ốm.", "eng": "She's not at her desk today: she's on the sick-list."}, {"viet": "Cô ấy bận quá không ra biển được vì thế cô ấy phải bôi thuốc vào da.", "eng": "She's too busy to go to the beach so the has a bottle tan."}, {"viet": "Bà ta tích luỹ gia tài bằng đầu cơ thị trường chứng khoán.", "eng": "She amassed a fortune by speculating on the stock exchange."}, {"viet": "Cô ta bất ngờ gặp anh ta trong khi anh đang đi tìm phòng của cô.", "eng": "She came upon him unawares as he was searching her room."}, {"viet": "Cô ấy không thể kiềm chế được mình lâu hơn nữa-cô ấy phải kể cho anh ấy nghe tin tức tốt lành.", "eng": "She couldn't contain herself any longer-she simply had to tell him the good news."}, {"viet": "Cô ta đã chết cho sự nghiệp tiến bộ như một kẻ tử vì đạo.", "eng": "She died as a martyr in the cause of progress."}, {"viet": "Cô ta vượt xa những người khác về sắc đẹp và sự thông minh.", "eng": "She far transcends the others in beauty and intelligence."}, {"viet": "Cô ta đã tiết lộ bí mật quốc gia cho kẻ thù.", "eng": "She gave away state secrets to the enemy."}, {"viet": "Cô ấy đã có một đợt nghỉ đáng buồn-một phần thời gian nghỉ cô ấy bị bệnh.", "eng": "She had a miserable holiday-she was ill for part of the time."}, {"viet": "Chị ấy có cả một lô thư từ cần giải quyết.", "eng": "She has a lot of correspondence to deal with."}, {"viet": "Bà ấy có ba cô con gái đến tuổi lấy chồng.", "eng": "She has three very marriageable daughters."}, {"viet": "Cô ta đính hôn với thiếu uý trẻ đó.", "eng": "She is betrothed to that young lieutenant."}, {"viet": "Bà ta đang soạn một cuốn từ điển hay đại loại một cái gì như thế.", "eng": "She is writing a dictionary or something."}, {"viet": "Bà ta đã sống dối mình suốt 20 năm trời coi như là vợ của ông ấy.", "eng": "She lived a lie for 20 years by pretending to be his wife."}, {"viet": "Cô ấy đã sắp xếp giỏ đồ ăn cho cuộc đi chơi ngoài trời.", "eng": "She made up a basket of food for the picnic."}, {"viet": "Cô ta chỉ vừa đủ điểm để qua cuộc kiểm tra.", "eng": "She only just scraped through the test."}, {"viet": "Cô ta làm đĩ để nuôi con.", "eng": "She prostituted herself in order to support her children."}, {"viet": "Cô ta trả lại cuốn sách với lời xin lỗi vì đã giữ nó quá lâu.", "eng": "She returned the book with many apologies for keeping it so long."}, {"viet": "Cô ta thật là thích hợp với công việc.", "eng": "She's ideally suited to the job."}, {"viet": "Cô ta nói cô ta mới 22 tuổi-22 tuổi thế nào được!", "eng": "She said she was only twenty-two-twenty-two my eye!"}, {"viet": "Cô ấy lấy tay che mắt ( để khỏi bị chói nắng ).", "eng": "She shaded her eyes ( from the sun ) with her hand."}, {"viet": "Suốt thời gian tỉnh giấc cô ấy lo lắng về công việc của mình.", "eng": "She spends all her waking hours worrying about her job."}, {"viet": "Bà ta cố nuốt giận rồi quay lại nhìn thẳng vào người buộc tội bà.", "eng": "She swallowed hard, and turned to face her accuser."}, {"viet": "Cô ấy tích cực tập luyện suốt năm mà vẫn không đạt được thân hình đẹp nhất.", "eng": "She trained hard all year yet still failed to reach her best form."}, {"viet": "Cô ta muốn trở thành một nữ diễn viên, nhưng bố cô ta đã dập tắt ý tưởng đó ngay từ đầu.", "eng": "She wanted to be an actress, but her father soon nipped that idea in the bud."}, {"viet": "Cô ấy đã được thưởng vào học tại trường cao đẳng âm nhạc hoàng gia.", "eng": "She was awarded a place at the Royal College of Music."}, {"viet": "Chị ấy rất vui khi đứa con được sinh ra.", "eng": "She was full of joy when her child was born."}, {"viet": "Cô ta chẳng bao giờ là người ngồi lê đôi mách đâu.", "eng": "She was never one to gossip."}, {"viet": "Chị ấy mải mê với công việc đến nỗi không nhận ra là đã muộn.", "eng": "She was so wrapped up in her work that she didn't realize how late it was."}, {"viet": "Cô ấy đội nón khác thường.", "eng": "She was wearing no ordinary hat."}, {"viet": "Nàng lau hai bàn tay dính đầy bột của nàng bằng một cái khăn ướt.", "eng": "She wiped out her floury hands with a damp cloth."}, {"viet": "Cô ấy không chịu tiết lộ nơi ẩn náu của bạn cô cho cảnh sát.", "eng": "She wouldn't disclose her friend's whereabouts to the police."}, {"viet": "Tỏ ra khả năng tự chủ cao trong những lúc căng thẳng.", "eng": "Show great self-control in moments of stress."}, {"viet": "Vì tàu không đến và không có xe buýt, tôi không còn lựa chọn nào khác hơn là đợi.", "eng": "Since the train didn't come, and there was no bus, I had no option but to wait ( = there was nothing I could do except to wait )."}, {"viet": "Đi õng ẹo loanh quanh trong bộ quần áo đen bó sát người.", "eng": "Slinking around in a tight black dress."}, {"viet": "Những kẻ được gọi là phản bội đã bị thanh trừng ( ra khỏi hàng ngũ của họ ).", "eng": "So-called traitors were purged ( from their ranks )."}, {"viet": "Soho là một trong những khu tai tiếng nhất ở Luân Đôn.", "eng": "Soho is one of London's most disreputable areas."}, {"viet": "Một số thành viên trong hội đồng biểu lộ sự dè dặt đối với những đề nghị này.", "eng": "Some members of the committee expressed reservations about these proposals."}, {"viet": "Một vài nhà xuất bản hiện nay đang đa dạng hoá đầu tư vào phần mềm vi tính.", "eng": "Some publishers are now diversifying into software."}, {"viet": "Dường như có cái gì đó đang thu hút tâm trí cô ta lúc này.", "eng": "Something seems to be preoccupying her at the moment."}, {"viet": "Phát âm r rung nhẹ theo lối miền Tây.", "eng": "Speak with a soft West Country burr."}, {"viet": "Bắt đầu nghiên cứu và đạt ngay các kết quả.", "eng": "Started studying and got immediate results."}, {"viet": "Đừng rối rít nữa và hãy ăn đi!", "eng": "Stop fussing and eat your food!"}, {"viet": "Sinh viên có một thư viện nhiều sách để sử dụng.", "eng": "Students have a well-stocked library at their disposal."}, {"viet": "Những nhà thơ như Keats và Shelley làm thơ lãng mạn.", "eng": "Such poets as Keats and Shelley wrote Romantic poetry."}, {"viet": "Có chứ, chúng tôi không bỏ lỡ nơi ấy vì bất cứ lý do gì.", "eng": "Sure, we wouldn't miss it for anything."}, {"viet": "Nhắm mục tiêu cẩn thận trước khi bắn.", "eng": "Take careful aim at the target before firing."}, {"viet": "Thầy giáo phải chuẩn bị rất nhiều trước mỗi bài học.", "eng": "Teachers have to do a lot of preparation before each lesson."}, {"viet": "Các cuộc tấn công của bọn khủng bố đe doạ đến vị trí hiện nay của chúng ta.", "eng": "Terrorist attacks made our position vary unhealthy."}, {"viet": "Như thế khác nào giật cái kẹo khỏi miệng đứa bé.", "eng": "That's like taking a candy from a baby."}, {"viet": "Đó có thể là câu trả lời mà chúng ta đang tìm kiếm.", "eng": "That could easily be the answer we're looking for."}, {"viet": "Nhận xét cuối cùng đó là một cú cay độc nhắm vào tôi.", "eng": "That last remark was a hit at me."}, {"viet": "Bạn mặc cái áo đầm đẹp quá!", "eng": "That's a beautiful dress you have on!"}, {"viet": "Việc đó cách đây đã 40 năm rồi, tất nhiên anh không thể nhớ lại được.", "eng": "That was 40 years ago, but of course you wouldn't remember it."}, {"viet": "Tai nạn đã làm chiếc xe hư hại nhiều.", "eng": "The accident did a lot of damage to the car."}, {"viet": "Phòng liền kề bên là văn phòng của giáo sư Hoàng.", "eng": "The adjoining room is the office of professor Hoang."}, {"viet": "Sự có mặt của quân đội Hoa Kì ở Hi Lạp.", "eng": "The American military presence in Greece."}, {"viet": "Mùa đông đến gần đem theo thời tiết lạnh.", "eng": "The approach of winter brings cold weather."}, {"viet": "Bài này sẽ được mọi người tán thành.", "eng": "The article will meet general approval."}, {"viet": "Nhà chức trách tin rằng có một nội gián trong Bộ Tài chính.", "eng": "The authorities believe there is a mole at the Treasury."}, {"viet": "Phần còn thiếu trong đơn đặt hàng của ông sẽ được gửi ngay khi chúng tôi nhận được lô hàng mới.", "eng": "The balance of your order will be supplied when we receive fresh stock."}, {"viet": "Phần cơ bản của học tập là đọc, viết và những phép tính đơn giản.", "eng": "The basics of education are reading, writing, and simple arithmetic."}, {"viet": "Việc làm tốt nhất là xin lỗi.", "eng": "The best thing to do would be to apologize."}, {"viet": "Máu hình như túa ra từ vết thương và tôi nghĩ tôi sẽ không bao giờ có thể cầm được máu.", "eng": "The blood seemed to pour from the wound and I thought I would never staunch the flow."}, {"viet": "Sách là nguồn thông tin dồi dào.", "eng": "The book is a cornucopia of information."}, {"viet": "Sự cư xử dại dột của thằng bé đã làm cho mẹ nó thức trắng nhiều đêm.", "eng": "The boy's foolish behavior has cost his mother many sleepless nights."}, {"viet": "Chiếc cầu bắc qua sông chỉ một nhịp.", "eng": "The bridge crosses the river in a single span."}, {"viet": "Trạm xe buýt ở cuối đường.", "eng": "The bus-stop is down the road."}, {"viet": "Đại Vực là một hẻm sâu, dài khoảng 200 dặm, sâu một dặm, và được cắt ở đáy bởi sông Colo-rado.", "eng": "The Canyon is a deep gorge, about 200 miles long, one mile deep, and is cut by the Colorado River at the bottom."}, {"viet": "Chiếc xe ôtô thật là cà tàng.", "eng": "The car's in poor nick."}, {"viet": "Tòa lâu đài sẽ trải qua các cuộc trùng tu toàn bộ và tốn kém.", "eng": "The castle will undergo extensive and costly renovations."}, {"viet": "Dãy đá vôi ở miền Nam nước Anh.", "eng": "The chalk downs of southern England."}, {"viet": "Đứa trẻ tô màu các hình trên trang giấy bằng bút chì màu.", "eng": "The child coloured in all the shapes on the page with crayon."}, {"viet": "Bọn trẻ nhìn chăm chú vào gói quà khi chúng tôi mở nó ra.", "eng": "The children are all eyes as we open the parcel."}, {"viet": "Lũ trẻ hình như không bị ảnh hưởng về mặt tình cảm bởi việc ly dị của bố mẹ chúng.", "eng": "The children seem unaffected emotionally by their parents'divorce."}, {"viet": "Nhà thờ làm cho tôi không ngủ được.", "eng": "The church bells keep me from sleeping."}, {"viet": "Những người leo núi hạ trại ở lưng chừng núi.", "eng": "The climbers made camp half-way up the peak."}, {"viet": "Sự sụp đổ của nhà băng gây một nỗi hoang mang ở Sở giao dịch chứng khoán.", "eng": "The collapse of the bank caused a panic on the Stock Exchange."}, {"viet": "Khối thịnh vượng chung bao gồm Anh và nhiều nước khác, kể cả Canađa, Úc và Niu Di-lân.", "eng": "The Commonwealth consists of Britain and various other countries including Canada, Australia and New Zealand."}, {"viet": "Công ty mạo hiểm giảm giá sản phẩm và việc đó lại có kết quả.", "eng": "The company took a gamble by cutting the price of their products, and it paid off."}, {"viet": "Sự nhức nhối liên tục ở những chỗ phồng giộp ở chân anh ta.", "eng": "The constant smart of the blisters on his feet."}, {"viet": "Quyết định của hội đồng sẽ định đoạt số phận của nhà hát địa phương.", "eng": "The council's decision will make or break the local theatre."}, {"viet": "Tòa án cũng sẽ phải xác định một cách xác định một cách sáng suốt là liệu có cần áp dụng việc giới hạn tuổi nào không.", "eng": "The court also will have to make the Solomonic determination whether any age limit applies."}, {"viet": "Thập tự giá là biểu tượng của Thiên Chúa giáo.", "eng": "The cross is the symbol of Christianity."}, {"viet": "Các bức màn cửa treo rũ xuống xếp nếp.", "eng": "The curtains were hanging in folds."}, {"viet": "Cái chết của vị lãnh tụ là một tổn thất nặng nề đối với đảng.", "eng": "The death of its leader was a body-blow to the party."}, {"viet": "Nha sĩ đó dùng a-man-gam để hàn trám răng tôi.", "eng": "The dentist used amalgam to fill my teeth."}, {"viet": "Hình bóng mờ mờ của những toà nhà trong đêm tối.", "eng": "The dim outline of buildings on a dark night."}, {"viet": "Báo cáo của bác sĩ xác nhận những lo sợ xấu nhất của chúng tôi.", "eng": "The doctor's report confirmed our worst fears."}, {"viet": "Tài liệu này đã được cảnh sát xác minh.", "eng": "The document was borne out by the police."}, {"viet": "Cửa mở, khỉ thật, không biết gà có xổng ra không!", "eng": "The door blew open and, doggone it, if the chickens didn't get loose!"}, {"viet": "Người đàn ông say bị kéo ra cửa.", "eng": "The drunken man was escorted firmly to the door."}, {"viet": "Người con trưởng là người cấp dưỡng duy nhất cho gia đình.", "eng": "The eldest son is the family's only provider."}, {"viet": "Vần chữ cái tiếng Anh bắt đầu bằng A và kết thúc bằng Z.", "eng": "The English alphabet begins with A and ends with Z."}, {"viet": "Những tệ nạn bắt nguồn từ chiến tranh.", "eng": "The evils that proceed from war."}, {"viet": "Mặt ngoài của toà nhà trông thật hấp dẫn.", "eng": "The exterior of the building is very attractive."}, {"viet": "Người chủ trại dùng một chiếc gậy nặng tống khứ bọn con trai đi.", "eng": "The farmer saw the boys off with a heavy stick."}, {"viet": "Cái phim viễn tây sẽ được chiếu ngày thứ bảy.", "eng": "The film, which is a western, will be shown on Saturday."}, {"viet": "Ngọn lửa nhanh chóng lan cả ra vùng quê đầy cây cối.", "eng": "The fire swept rapidly across the wooded countryside."}, {"viet": "Một vài thế kỷ đầu của thời đại Trung Cổ, tính đến năm 800, thường được gọi là Thời Đen Tối.", "eng": "The first few hundred years of the Middle Ages, until about 800, are often called the Dark Ages."}, {"viet": "Các luống hoa phong phú về màu sắc.", "eng": "The flower-beds were a riot of colour."}, {"viet": "Những người sáng lập ngôn ngữ học hiện đại.", "eng": "The founding fathers of modern linguistics."}, {"viet": "Tay cờ bạc mất tiền, ô tô và cả nhà của mình cùng một lúc.", "eng": "The gambler lost his money, his car, and his home at one fell swoop."}, {"viet": "Sản xuất điện bằng hơi nước hoặc bằng sức nước.", "eng": "The generation of electricity by steam or water-power."}, {"viet": "Hàng hoá không đạt tiêu chuẩn nhưng nó có thể thông qua.", "eng": "The goods are not up to the mark but they may pass."}, {"viet": "Chính phủ đã quyết định ủng hộ chính sách phát triển toàn diện.", "eng": "The government has decided to go for growth."}, {"viet": "Chính phủ phải dành ưu tiên cho việc xây dựng lại khu vực nội thành.", "eng": "The government should give top priority to rebuilding the inner cities."}, {"viet": "Tai hoạ nặng nề nhất từ trước đến giờ đã giáng xuống chúng tôi.", "eng": "The greatest disaster that has ever befallen us."}, {"viet": "Người khách trọ sẽ trả phòng ngày mai và yêu cầu một cuộc gọi đánh thức.", "eng": "The guest will check out tomorrow and ask for a wake-up call."}, {"viet": "Thời tiết nóng đã làm nó nổi ban.", "eng": "The heat brought him out in a rash."}, {"viet": "Con người thần thánh đó chữa cho họ hết bệnh.", "eng": "The holy man healed them of their sickness."}, {"viet": "Khách sạn này không vừa ý tí nào.", "eng": "The hotel was anything but satisfactory."}, {"viet": "Những ngôi nhà ấy được đặc biệt thiết kế cho người già.", "eng": "The houses are specifically designed for old people."}, {"viet": "Tầm quan trọng của công nghiệp đối với nền kinh tế.", "eng": "The importance of industry to the economy."}, {"viet": "Động lực bên trong của một thời kỳ lịch sử.", "eng": "The inner dynamic of a historical period."}, {"viet": "Hòn đảo đó bị bão cô lập cả tuần lễ.", "eng": "The island was storm-bound for a week."}, {"viet": "Thẩm phán nói không gì có thể giảm nhẹ sự tàn ác của người mẹ đối với đứa con.", "eng": "The judge said that nothing would mitigate the cruelty with which the mother had treated her child."}, {"viet": "Những đề nghị mới nhất của chính phủ Liên Xô về kiểm soát vũ khí.", "eng": "The Kremlin's latest proposals on arms control."}, {"viet": "Những máy bay kiểu mới nhất đã giảm được một nửa thời gian cần thiết bay qua Đại Tây Dương.", "eng": "The latest planes have halved the time needed for crossing the Atlantic."}, {"viet": "Những truyền thuyết về vua Arthur tiêu biểu cho tư tưởng cao đẹp của tinh thần hiệp sĩ.", "eng": "The legends of King Arthur represent the apotheosis of chivalry."}, {"viet": "Tàu khách đụng độ với tàu chở dầu.", "eng": "The liner was in collision with an oil-tanker."}, {"viet": "Kẻ thua cuộc ngồi ủ rủ.", "eng": "The loser sat slumped in dejection."}, {"viet": "Đường chính đã bị ngập lụt, vì thế chúng tôi phải đi vòng bằng những con đường nông thôn hẹp.", "eng": "The main road was flooded so we had to go round by narrow country lanes."}, {"viet": "Chợ luôn luôn tấp nập hơn vào mùa xuân.", "eng": "The market always picks up in the spring."}, {"viet": "Hội những người làm nghề y, ngân hàng, giảng dạy, v. v.", "eng": "The medical, banking, teaching, etc fraternity."}, {"viet": "Cuộc tập trận bị kết án coi như một hành động gây chiến.", "eng": "The military exercise was condemned as an act of aggression."}, {"viet": "Mô hình này là một kết cấu những quả cầu và những cái gậy trông rất kỳ quặc.", "eng": "The model is an odd-looking structure of balls and rods."}, {"viet": "Toà án quan trọng nhất gọi là Toà án tối cao.", "eng": "The most important lawcourt is called the Supreme Court."}, {"viet": "Tổ chức đại nhạc hội là một hoạt động mới mẻ mà chúng tôi hy vọng sẽ trở thành một sự kiện hàng năm.", "eng": "The music festival is a new enterprise which we hope will become an annual event."}, {"viet": "Ông chủ mới đúng là người lập dị.", "eng": "The new boss is a bit of an oddball."}, {"viet": "Tòa nhà văn phòng lù lù này làm xấu hẳn cảnh quan.", "eng": "The new office block is an excrescence on the landscape."}, {"viet": "Tin về cái chết của mẹ anh ấy là cú sốc khủng khiếp đối với anh ấy.", "eng": "The news of his mother's death was a terrible shock to him."}, {"viet": "Thân nhiệt bình thường.", "eng": "The normal temperature of the human body."}, {"viet": "Sự chăm sóc một đứa trẻ yếu đuối, chăm bón một cây mảnh khảnh.", "eng": "The nurture of a delicate child, plant."}, {"viet": "Ngôi nhà cổ bỏ không chẳng bao lâu đã rơi vào đổ nát.", "eng": "The old empty house soon went to rack and ruin."}, {"viet": "Điều duy nhất cứu được công ty là cải tổ toàn diện cung cách điều hành.", "eng": "The only thing that will save the company is a thorough shake-up of the way it is run."}, {"viet": "Bố cục tổng thể của bức tranh thì tốt, nhưng có một vài chi tiết nhỏ không được hài hoà.", "eng": "The overall composition of the picture is good but some of the detail is distracting."}, {"viet": "Buổi liên hoan bắt đầu lúc 8 giờ, nhưng anh đừng cất công tới đúng giờ làm chi!", "eng": "The party's at eight, but don't kill yourself getting here!"}, {"viet": "Người bệnh sáng nay trông như vui vẻ hơn.", "eng": "The patient seems a little livelier this morning."}, {"viet": "Tính chất vĩnh cửu của Giáo hội là một tín điều.", "eng": "The perpetuity of the Church was an article of faith."}, {"viet": "Chồng sách rơi phịch xuống sàn.", "eng": "The pile of books flopped noisily onto the floor."}, {"viet": "Máy bay cất cánh bay về hướng nam.", "eng": "The plane flew off in a southerly direction."}, {"viet": "Vở kịch bị thất bại do những bài nhận định quá bất lợi.", "eng": "The play was killed by bad reviews."}, {"viet": "Cảnh sát đã tụ tập lại dự liệu trước một cuộc mít tinh.", "eng": "The police assembled in anticipation of a meeting."}, {"viet": "Cảnh sát truy nã không khoan nhượng tên tội phạm.", "eng": "The police pursued the criminal remorselessly."}, {"viet": "Chính trị của một nước nằm ở ngoài phạm vi một cuốn sách cho khách du lịch.", "eng": "The politics of a country would be outside the scope of a book for tourists."}, {"viet": "Quyền lực của nền dân chủ ở nước Anh ngày nay chỉ có tính cách tượng trưng hơn là thực chất.", "eng": "The power of the monarchy in Britain today is more symbolical than real."}, {"viet": "Tổng thống đã rời giường bệnh để tham dự buổi lễ.", "eng": "The President left his sick-bed to attend the ceremony."}, {"viet": "Nguyên nhân chủ yếu của tình trạng rắc rối là sự quản lý tồi.", "eng": "The prime cause of the trouble was bad management."}, {"viet": "Tù nhân bị dẫn đi thành bầy như súc vật.", "eng": "The prisoners were herded like cattle."}, {"viet": "Dự án sẽ tiến triển như đã hoạch định.", "eng": "The project will go forward as planned."}, {"viet": "Cú đấm nhằm vào đầu đối thủ của nó.", "eng": "The punch was aimed at his opponent's head."}, {"viet": "Sự yên tĩnh dẫn đến chỗ suy nghĩ về tương lai đen tối.", "eng": "The quiet conduces to thinking about the darkening future."}, {"viet": "Trung tâm thực sự về việc phát triển tiền tệ chính là Phố Uôn.", "eng": "The real nexus of money culture was Wall Street."}, {"viet": "Địa hình nổi được thể hiện rõ trên sơ đồ này.", "eng": "The relief is clearly shown on this plan."}, {"viet": "Những sự câu thúc của ngân sách gia đình do thu nhập eo hẹp.", "eng": "The restraints on the family budget of a limited income."}, {"viet": "Những nguy hiểm vốn gắn liền với cuộc sống của một phi công thử nghiệm.", "eng": "The risks incident to the life of a test pilot."}, {"viet": "Núi Gibraltar đầy những hốc đá với hang động.", "eng": "The Rock of gibraltar is honey combed with caves."}, {"viet": "Thường thường lối sống trong giới luật sư bào chữa là gió chiều nào theo chiều nấy.", "eng": "The rule of life in the defence bar ordinarily is to go along and get along."}, {"viet": "Vệ tinh đã cung cấp đường dây liên lạc bằng viđêô giữa Nhà trắng và điện Kremli.", "eng": "The satellite provides a video link between the White House and the Kremlin."}, {"viet": "Tỉ số cho trận bóng đá là 4-1.", "eng": "The score in the football game was 4-1."}, {"viet": "Câu Bức tranh những người đang chết đói làm xúc động chúng tôi là phép ẩn dụ.", "eng": "The sentence The pictures of starving people touched our hearts is a metaphor."}, {"viet": "Trong cơn bão, chiếc tàu đã trôi.", "eng": "The ship dragged her anchor during the storm."}, {"viet": "Cửa hàng đó định lừa gạt tôi.", "eng": "The shop tried to rip me off."}, {"viet": "Nghe nói là ca sĩ đó đang nhận được sự giúp đỡ để cai nghiện ma tuý.", "eng": "The singer was reported to be receiving help to overcome his drug addiction."}, {"viet": "Khi tình trạng không minh bạch của cuộc tranh cãi được làm sáng tỏ, anh sẽ thấy anh ta là người tài ba như thế.", "eng": "The smoke of controversy has cleared, you will recognize him for the great man he is."}, {"viet": "Người hát đơn ca đã nhận một bó hoa hồng rất lớn.", "eng": "The soloist received a huge bouquet of roses."}, {"viet": "Viễn ảnh thất nghiệp luôn lởn vởn trong óc anh ta.", "eng": "The spectre of unemployment was always on his mind."}, {"viet": "Nhà ga sẽ hoạt động trở lại vào tháng Giêng.", "eng": "The station will be operative again in January."}, {"viet": "Con suối hoàn toàn khô cạn vào mùa hè.", "eng": "The stream dries up altogether in summer."}, {"viet": "Việc giá cổ phần đột ngột hạ giá đã đặt chính phủ trước một vấn đề hóc búa.", "eng": "The sudden drop in share prices has set the government a tricky problem."}, {"viet": "Triệu chứng của bệnh này là sốt và buồn nôn.", "eng": "The symptoms of this disease are fever and sickness."}, {"viet": "Thầy giáo gọi tất cả học sinh vào phòng.", "eng": "The teacher summoned all the children to the room."}, {"viet": "Các vạt lều phải được buộc chặt lại.", "eng": "The tent flaps should be tightly fastened."}, {"viet": "Nguy cơ phải đóng cửa đã ảnh hưởng tới tinh thần của công nhân.", "eng": "The threat of closure affected the workers'morale."}, {"viet": "Toà tháp bị tan vụn do sức nổ.", "eng": "The tower was blown to atoms by the force of the explosion."}, {"viet": "Sự di chuyển của mặt trăng quanh trái đất làm cho mặt trăng hình như thay đổi hình dạng của nó.", "eng": "The traveling of the moon around the earth makes the moon seem to change its shape."}, {"viet": "Hai đứa trẻ đó đang thi nhau để xem ai có thể buộc được đứa kia phải chớp mắt.", "eng": "The two children were having a competition to see who could stare the other out."}, {"viet": "Trọng tài tuyên bố vận động viên bóng chày phạm qui ( vì đứng bên trái trước gôn ).", "eng": "The umpire gave the batsman out ( leg before wicket )."}, {"viet": "Nhân viên giặt quần áo phát hiện 30 đô la Hồng Kông trong quần áo cần giặt ủi của khách trọ.", "eng": "The valet found 30 Hong Kong dollars in the guest's laundry."}, {"viet": "Các khách đến thăm được phục vụ đồ ăn và thức uống thoả thuê.", "eng": "The visitors were plentifully supplied with food and drink."}, {"viet": "Cái cách anh ta đối xử với chị ấy thật là tồi tệ.", "eng": "The way he treated her was really rotten."}, {"viet": "Toàn bộ công việc được làm với sự nhất trí.", "eng": "The whole thing was done in concernment."}, {"viet": "Người đàn bà phụ trách phòng kế toán là một bà chằn đích thị!", "eng": "The woman in charge of the accounts department is an absolute dragon!"}, {"viet": "Chiếc ô tô bị đâm phải được nâng lên trước khi người lái có thể được gỡ ra.", "eng": "The wrecked car had to be lifted before the driver could be extricated."}, {"viet": "Đập của chúng làm cho nước của các con sông tràn ra thành ao.", "eng": "Their dams make the water of streams spread out to form ponds."}, {"viet": "Những vấn đề rắc rối khác của họ dường như đã trở thành vô nghĩa trước thảm hoạ mới nhất này.", "eng": "Their other problems paled into insignificance beside this latest catastrophe."}, {"viet": "Rồi một ngày nọ, Marie gặp ông Pierre Curie, một nhà khoa học, một giáo sư người Pháp.", "eng": "Then one day Marie met Pierre Curie, a French scientist and teacher."}, {"viet": "Có một cái áo đầm đẹp trong tủ kính bày hàng này.", "eng": "There's a lovely dress in this show-window."}, {"viet": "Theo nguyên lý thì không có lý do gì người ta không thể đi lên sao Hoả được.", "eng": "There's no reason in principle why people couldn't travel to Mars."}, {"viet": "Có một vài điều cần giải quyết giữa chúng ta.", "eng": "There are a few things that need straightening out between us."}, {"viet": "Chỉ có khác biệt về ngữ điệu mà thôi.", "eng": "There are only variations on theme."}, {"viet": "Thế là Cơ Đốc giáo có nhiều chi phái khác nhau với những hình thức thờ cúng khác nhau.", "eng": "There came to be many different branches of Christianity that had different forms of worship."}, {"viet": "Có rất nhiều loại cửa hàng khác nhau ở Mỹ, xếp từ các cửa hàng rất lớn gọi là cửa hàng bách hoá, bán quần áo, đồ đạc bằng gỗ, các mặt hàng gia dụng và nhiều mặt hàng khác, đến những cửa hàng rất nhỏ chuyên bán một loại sản phẩm.", "eng": "There is a great variety of shops in the U. S., ranging from very large stores called department stores, offering clothing, furniture, household goods and many other goods, to very small shops that specialize in just one kind of product."}, {"viet": "Không cần thiết để ông ta phải vay tiền ngân hàng.", "eng": "There is no need for him to obtain loans from the bank."}, {"viet": "Dạ có một trận đấu bóng chày trên kênh.", "eng": "There's a baseball game on Channel."}, {"viet": "Cũng có tổ chức các cuộc đua xe ngựa.", "eng": "There was also chariot races."}, {"viet": "Từ những giai đoạn rất lâu chúng tôi không nhận được tin anh ta.", "eng": "There were long periods when we didn't hear from him."}, {"viet": "Về mùa đông những con chim này di trú tới Bắc Phi.", "eng": "These birds migrate to North Africa in winter."}, {"viet": "Những nước láng giềng này đã sống hoà thuận với nhau trong nhiều thế kỉ.", "eng": "These neighbouring states had lived in concord for centuries."}, {"viet": "Nếu anh mặc cái áo khoác khủng khiếp ấy người ta sẽ cười cho đấy.", "eng": "They'll laugh at you if you wear that awful coat."}, {"viet": "Họ đã khởi hành làm một chuyến đi vòng quanh thế giới.", "eng": "They've set off on a journey round the world."}, {"viet": "Họ đang chuẩn bị cho việc trình diễn một chương trình nhạc mới.", "eng": "They are preparing for the presentation of a new musical."}, {"viet": "Họ không đủ khả năng thuê người giúp việc, vì vậy họ phải làm lấy việc nhà.", "eng": "They can't afford a home help, so they have to do for themselves."}, {"viet": "Họ sửa sang lại ngôi nhà và bán nó với một món lợi khổng lồ.", "eng": "They did up the house and sold it for a vast profit."}, {"viet": "Họ kiếm nơi tránh bão trong một nhà kho.", "eng": "They found shelter from the storm in a barn."}, {"viet": "Họ đã bỏ đi, và chúng tôi cũng không ở lại nữa.", "eng": "They have left the place, nor shall we stay."}, {"viet": "Họ sẽ bán cho cháu một số thuốc.", "eng": "They'll give you some medicine."}, {"viet": "Họ đóng gói thức ăn và các dụng cụ cắm trại vào xe moóc.", "eng": "They packed the food and camping equipment in the trailer."}, {"viet": "Theo chỗ chúng tôi biết họ trở lại lúc chín giờ.", "eng": "They returned at nine, as far as we know."}, {"viet": "Họ làm tôi hết sức ngạc nhiên khi mời tôi làm việc đó.", "eng": "They sprang quite a surprise on me when they offered me that job."}, {"viet": "Họ muốn buộc anh ta phải khuất phục.", "eng": "They wanted to hammer him into submission."}, {"viet": "Họ được cha cô ta, là linh mục, làm phép cưới cho.", "eng": "They were married by her father, who's a bishop."}, {"viet": "Họ giật khẩu súng của đối thủ.", "eng": "They wrested his antagonist's from him."}, {"viet": "Chiếc hòm này rất nặng, tôi hầu như không thể nhấc nó lên được.", "eng": "This box is very heavy, I can only just lift it."}, {"viet": "Quyển từ điển này cung cấp các nghĩa của từ và cũng minh hoạ các cấu trúc trong đó các từ có thể được sử dụng.", "eng": "This dictionary gives the meanings of words and also illustrates the constructions they can be used in."}, {"viet": "Khách sạn này có thể đủ phòng cho 500 khách.", "eng": "This hotel can accommodate up to 500 guests."}, {"viet": "Đến thế này là cùng-tôi sẽ không bao giờ đến khách sạn này nữa.", "eng": "This is the end-I'm never coming to this hotel again."}, {"viet": "Máy này là phát minh mới nhất của họ.", "eng": "This machine is their latest invention."}, {"viet": "Hộ chiếu này có giá trị trong một năm nữa.", "eng": "This passport is valid for another year."}, {"viet": "Trường này phụ thuộc vào trường sư phạm.", "eng": "This school is attached to the normal school."}, {"viet": "Loại rắn này chỉ có ở Nam Mĩ.", "eng": "This type of snake is only found in South America."}, {"viet": "Mặc dù anh ta đã 40 nhưng anh ta vẫn bám váy mẹ và không bao giờ lấy vợ.", "eng": "Though he's nearly 40, he's still tied to his mother's apron strings, and has never married."}, {"viet": "Tôm cảm thấy rất nản khi làm bài đại số nhưng sau một lúc thì nó quen dần và bắt đầu thấy thích thú.", "eng": "Tom became very tired of working at his algebra, but after a while he got his second wind and began to enjoy it."}, {"viet": "Vì không trả được các món nợ công ty bị phá sản.", "eng": "Unable to meet its obligations the company went into bankruptcy."}, {"viet": "Thật là một trò đê tiện đi lừa bịp một bà già.", "eng": "Was a scurvy trick to play on an old lady."}, {"viet": "Chúng tôi sẽ giao chúng vào chiều mai, khoảng 4 giờ ạ?", "eng": "We'll deliver them tomorrow afternoon around 4: 00?"}, {"viet": "Bây giờ chúng ta sẽ đi qua Kênh đào Suez.", "eng": "We're going through the Suez Canal now."}, {"viet": "Chúng ta sẽ đợi cho đến khi thời tiết khá lên một chút.", "eng": "We're waiting until the weather picks up a bit."}, {"viet": "Chúng tôi đã tiêu hết toàn bộ số tiền được cấp cho cả năm.", "eng": "We've spent our entire allocation for the year."}, {"viet": "Chúng tôi đang tiến hành một cuộc vận động quảng cáo đặc biệt cho danh mục các loại sách bìa mỏng của chúng tôi.", "eng": "We are doing a special promotion of our paperback list."}, {"viet": "Chúng tôi hết sức coi trọng tới sự gọn gàng.", "eng": "We attach great importance to neatness."}, {"viet": "Chúng tôi có thể có các công ty trong nhóm chúng tôi để làm toàn bộ.", "eng": "We can get the companies in our group to make the whole thing."}, {"viet": "Chúng ta có thể khởi hành vào sáng sớm.", "eng": "We could start early in the morning."}, {"viet": "Chúng tôi uống li rượu chúc mừng cô dâu chú rể.", "eng": "We drank a toast to the bride and groom."}, {"viet": "Chúng tôi đã trải qua những giây phút lo âu trước khi hạ cánh an toàn.", "eng": "We had a few anxious moments before landing safely."}, {"viet": "Chúng ta gặp vấn đề nghiêm trọng đấy, mary à.", "eng": "We have a serious problem, Mary."}, {"viet": "Chúng tôi là người duy nhất có quyền bán loại mặt hàng này.", "eng": "We have the sole right to sell this range of goods."}, {"viet": "Chúng tôi biết là các ông cần một đại lý trong thành phố nay để bán các sản phẩm của các ông.", "eng": "We know that you need an agent in this city for the sale of your products."}, {"viet": "Chúng tôi tình cờ gặp nhau ở siêu thị.", "eng": "We met up at the supermarket."}, {"viet": "Chúng ta cần phải xem xét chi ly tài chính của chúng ta.", "eng": "We must take a hard look at our finances."}, {"viet": "Chúng tôi trồng hoa hồng dọc theo mép bồn cỏ.", "eng": "We planted roses along the side of the case well."}, {"viet": "Chúng tôi bán hàng ngàn cái kem vào mùa hè.", "eng": "We sell ice-creams by the thousand in the summer."}, {"viet": "Chúng ta nhấn trọng âm ở phần thứ nhất của từ chemistry.", "eng": "We stress the first part of the word chemistry."}, {"viet": "Chúng tôi muốn tiến cử ông làm thủ quỹ cho câu lạc bộ.", "eng": "We want to put you up for club treasurer."}, {"viet": "Chúng tôi hài lòng tình hình đã diễn ra như vậy.", "eng": "We were pleased with the way things fell out."}, {"viet": "Chúng tôi muốn một bàn ở cạnh cửa sổ.", "eng": "We would like a table by the window."}, {"viet": "Thôi được, tôi sẽ thử loại vừa chín tới.", "eng": "Well, I'll try it medium."}, {"viet": "À. Tôi đã lên kế hoạch khác cho ngày mai rồi.", "eng": "Well. I had made other plans for tomorrow."}, {"viet": "Scrooge là một lão già quỷ quái hèn hạ làm sao!", "eng": "What a miserable old devil Scrooge was!"}, {"viet": "Những sách nào cần phải học để lấy chứng chỉ thứ nhất của trường Cambridge năm tới?", "eng": "What books have been set for the Cambridge First Certificate next year?"}, {"viet": "Anh muốn gặp tôi làm gì?''Về chuyện lá thư anh gửi cho tôi'.", "eng": "What do you want to see me about?''It's to do with that letter you sent me'."}, {"viet": "Tôi muốn đi công viên Trung tâm?", "eng": "What is the best way to get there?"}, {"viet": "Bạn nghĩ gì về thời trang của giới trẻ?", "eng": "What is your opinion of the young adult generations'fashion?"}, {"viet": "Có vấn đề gì với máy thu băng video vậy?", "eng": "What's the matter with the VCR?"}, {"viet": "Vì hết chuyện nọ đến chuyện kia, tôi đã quên không nói cho anh biết là chúng tôi không thể đến được.", "eng": "What with one thing and another, I forgot to tell you we couldn't come."}, {"viet": "Khi bà đến thăm chúng ta, bà đã hắt hơi suốt.", "eng": "When grandmother visited us, she was sneezing all the time."}, {"viet": "Mùa thích hợp nhất để đến thăm New Zealand là khi nào?", "eng": "When is the best season to visit New Zealand?"}, {"viet": "Khi con đường không đi được, chúng tôi phải bỏ xe và đi bộ.", "eng": "When the road became impassable, we had to ditch the car and walk."}, {"viet": "Khi còn đi học, bạn đã tham gia các hoạt động ngoại khóa gì?", "eng": "When you were in school, what extra-curricular activities did you do?"}, {"viet": "Trạm xe buýt gần nhất ở đâu?", "eng": "Where is the nearest bus stop?"}, {"viet": "Bạn thích đọc báo nào hơn?", "eng": "Which newspaper do you prefer to read?"}, {"viet": "Ai đại diện cho quốc vương trong vụ án này?", "eng": "Who appears for the Crown in this case?"}, {"viet": "Có nhiều cuốn sách được dành trọn để viết về Atlantis.", "eng": "Whole books have been written about it."}, {"viet": "Tại sao bữa ăn sáng của tôi vẫn chưa được mang đến?", "eng": "Why hasn't my breakfast been delivered yet?"}, {"viet": "Cô sẽ khiêu vũ bản tiếp chứ, nếu cô không bận?", "eng": "Will you dance the next, if you are not engaged?"}, {"viet": "Bằng vài nhát kéo nhanh, ông ta đã xén tỉa bụi cây.", "eng": "With a few quick snips of the shears he pruned the bush."}, {"viet": "Cho đến thế kỷ hai mươi, ở Anh, phụ nữ mới được hưởng quyền bầu cử.", "eng": "Women were not given the franchise in Britain until the twentieth century."}, {"viet": "Xin cô cho tôi biết khi nào chúng ta đến công viên Hyde nhé?", "eng": "Would you let me know when we reach Hyde Park?"}, {"viet": "Tôi mở tivi có phiền gì anh không?''Không, hoàn toàn không'.", "eng": "Would you mind if I put the television on?''No, not in the least'."}, {"viet": "Ghi địa chỉ của bạn ở mặt sau ( tấm séc ).", "eng": "Write your address on the back ( of the cheque )."}, {"viet": "Phải rồi, chỉ có điều là ông đang đi hướng ngược lại.", "eng": "Yes, it is, only you're going in the opposite direction."}, {"viet": "Nếu anh không cẩn thận, anh sẽ bị tóm!", "eng": "You'll be pinched if you are not careful!"}, {"viet": "Ông đang kinh doanh rất tốt ở thị trường của chúng tôi.", "eng": "You're doing very nicely in our market."}, {"viet": "Anh đã quên không cho số điện thoại của anh vào.", "eng": "You've missed out your telephone number."}, {"viet": "Ta không thể mong tiền xuất hiện từ trên trời.", "eng": "You can't expect the money to appear from nowhere."}, {"viet": "Anh có thể kiếm xúc xích nóng ở quầy bán đằng kia.", "eng": "You can get hot dogs at the concession stand over there."}, {"viet": "Bạn có thể đi xem lãnh thổ của người da đỏ ở Wyoming.", "eng": "You could even go and see the Indian territory in Wyoming."}, {"viet": "Anh đã rất cẩu thả trong việc thực hiện nghĩa vụ của mình.", "eng": "You have been very remiss in fulfilling your obligations."}, {"viet": "Ông biết đấy, chúng tôi là Renbimbi.", "eng": "You know we call our currency ‘ Renminbi'."}, {"viet": "Nếu anh tin điều đó thì anh thật là ngu.", "eng": "You must be weak in the head if you believe that."}, {"viet": "Anh cần phải có lòng kiên nhẫn nếu anh muốn được người ta phục vụ ở cửa hàng này.", "eng": "You need patience if you want to get served in this shop."}, {"viet": "Trước tiên ông nên cho ngân hàng biết yêu cầu của ông là gì?", "eng": "You should first tell the banker what your request is?"}, {"viet": "Em mặc quần áo mất nhiều thì giờ một cách quá đáng!", "eng": "You take an unconscionable time getting dressed!"}, {"viet": "Anh sẽ không làm đông được tốt đâu nếu cho quá nhiều nước vào thịt nấu đông.", "eng": "You won't get a good set if you put too much water in the jelly."}, {"viet": "Tình bạn của anh có ý nghĩa rất lớn đối với tôi.", "eng": "Your friendship means a great deal to me."}, {"viet": "Việc của anh làm cũng chu đáo thoả đáng, song tôi tin là anh có thể làm tốt hơn.", "eng": "Your work is adequate but I'm sure you could do better."}]