[{"viet": "Một khí cầu bay lơ lửng trên trời.", "eng": "A balloon floated across the sky."}, {"viet": "Một trung tâm kinh doanh thép.", "eng": "A centre of the steel trade."}, {"viet": "Một công ty bị kiệt quệ do doanh số bán giảm sút.", "eng": "A company squeezed by reduced sales."}, {"viet": "Một đám đông xô đẩy và chen lấn nhau để vào.", "eng": "A crowd pushing and shoving to get in."}, {"viet": "Một sự thiếu cân bằng về lực lượng quân sự giữa hai nước.", "eng": "A disequilibrium in the military forces of the two countries."}, {"viet": "Một số học sinh quậy phá có thể dễ dàng làm hư một buổi học.", "eng": "A few disruptive students can easily ruin a class."}, {"viet": "Một cách giải quyết vững vàng cho vấn đề đó.", "eng": "A four-square approach to the problem."}, {"viet": "Cứ khóc cho thỏa đi có lẽ bạn sẽ cảm thấy dễ chịu hơn.", "eng": "A good weep would probably make you feel better."}, {"viet": "Nhiệt độ một cơ thể khoẻ mạnh là 98,4 độ Fahrenheit ở Anh và 98,6 độ Fahrenheit ở Mỹ.", "eng": "A healthy body temperature is 98.4 degrees Fahrenheit in Britain, and 98.6 degrees Fahrenheit in the USA."}, {"viet": "Một chiếc áo vét-tông có những miếng đắp bằng da trên hai khuỷu tay áo.", "eng": "A jacket with leather patches on the elbows."}, {"viet": "Một nhà lãnh đạo không dứt khoát được thì chẳng bao giờ biết làm gì, cứ ầm à ầm ừ.", "eng": "A leader who cannot make his or her mind never knows what to do, hems and haws."}, {"viet": "Nhiều người làm nghề đóng tàu sẽ bị sa thải.", "eng": "A lot of people in shipbuilding will get the axe."}, {"viet": "Một kiệt tác của trường phái lãng mạn.", "eng": "A masterpiece of the Romantics school."}, {"viet": "Con la là một con vật lai giống giữa con ngựa và con lừa.", "eng": "A mule is a cross between a horse and an ass."}, {"viet": "Một cuốn tiểu thuyết không chịu thi vị hóa những thực tế phũ phàng của cuộc chiến tranh.", "eng": "A novel that refuses to romanticize the grim realities of war."}, {"viet": "Một thời kì nổi tiếng là đầy những tư tưởng phóng khoáng của nó.", "eng": "A period remarkable for its liberality."}, {"viet": "Một lối cư xử của một cảnh sát khác biệt với bạn ngay cả khi ông ta đang tử tế.", "eng": "A policeman's way of being separate from you even when he was being nice."}, {"viet": "Một dự án thiết lập một công viên quốc gia mới.", "eng": "A project to establish a new national park."}, {"viet": "Một bản báo cáo do chính phủ đã soạn thảo với sự hợp tác của ngành công nghiệp hóa chất.", "eng": "A report produced by the Government in cooperation with the chemical industry."}, {"viet": "Một cái bánh xăng-uýt và một cốc bia để uống cho dễ nuốt.", "eng": "A sandwich and a glass of beer to rinse it down."}, {"viet": "Một chiếc tàu bị mắc cạn trên bờ cát.", "eng": "A ship stranded on the sand bank."}, {"viet": "Một thái độ đua đòi đối với nhạc pop.", "eng": "A snobbish attitude to pop music."}, {"viet": "Một bức tượng phụ nữ ngồi trên lưng ngựa.", "eng": "A statue of a woman seated on a horse."}, {"viet": "Một nhát chém đã để lại sẹo trên mặt ông ấy từ lúc còn là một thanh niên.", "eng": "A sword cut scarred his face when he was a young man."}, {"viet": "Một thị trấn không phải là cách đây tới một triệu dặm.", "eng": "A town that is not a million miles from here."}, {"viet": "Một lời kêu gọi thức tỉnh đối với các vấn đề ô nhiễm.", "eng": "A wake up call on the problems of pollution."}, {"viet": "Một kẻ phạm pháp lúc nào cũng lo sợ bị phát hiện.", "eng": "A wrongdoer haunted by fear of discovery."}, {"viet": "Dựa theo nguồn tin nhận được, cảnh sát đã khám xét bất ngờ câu lạc bộ.", "eng": "Acting on information received, the police raided the club."}, {"viet": "Sau một giai đoạn lạm phát nhanh, giá cả bây giờ đã ổn định.", "eng": "After a period of rapid inflation, prices have now reached a plateau."}, {"viet": "Sau nhiều tháng làm việc cật lực, kế hoạch của chúng tôi đã có kết quả.", "eng": "After months of hard work, our plans were brought to fruition."}, {"viet": "Sau cuộc cãi nhau om sòm cô ta cuốn gói ra đi.", "eng": "After their row she packed her bags and left."}, {"viet": "Những bím tóc xinh đẹp của cô ta đã bị xén mất hết.", "eng": "All her beautiful tresses have been sheared."}, {"viet": "Tất cả mọi tiếng địa phương thì vô lí như nhau.", "eng": "All the dialects are equally absurd."}, {"viet": "Mặc dầu đã ly dị họ vẫn tiếp tục cùng sống dưới một mái nhà.", "eng": "Although divorced, they continued to live under the same roof."}, {"viet": "Cái chết của đứa con của bà ta đã để lại cho bà ta một khoảng trống đau đớn.", "eng": "An aching void left by the death of her child."}, {"viet": "Một âm mưu toan ám hại nhằm vào tính mạng của Giáo hoàng.", "eng": "An attempt was made on the Pope's life."}, {"viet": "Cô ta được nhà vua ban tặng một vinh dự.", "eng": "An honour bestowed on her by the King."}, {"viet": "Một truyền thuyết Hy Lạp cổ đại kể rằng, nàng Io xinh đẹp sau khi bị thần Zớt biến thành bò đã bơi qua eo biển Bosporus để trốn con ruồi trâu.", "eng": "An old Greek myth tells that the beautiful maiden Io, after Zeus had changed her into a cow, swam the Bosporus to escape a gadfly."}, {"viet": "Phân tích các thành phần của một câu.", "eng": "Analyzing the component parts of a sentence."}, {"viet": "Một bộ phim phiêu lưu khác nữa với kỹ năng không thể bắt chước được của Steven Spielberg?", "eng": "Another adventure film with that inimitable Steven Spielberg touch?"}, {"viet": "Buộc một cái garô lên cánh tay người bị thương.", "eng": "Applying a tourniquet to the wounded man's arm."}, {"viet": "Mỗi tháng bạn có thể để dành một ít tiền không?", "eng": "Are you able to save some money every month?"}, {"viet": "Anh vẫn còn đang tìm việc à?", "eng": "Are you still looking for a job?"}, {"viet": "Để phản đối, đảng đó quyết định không tham gia tranh cử kỳ này.", "eng": "As a protest, the party has decided not to contest this election."}, {"viet": "Khi cơ thể con người hoạt động, nó sinh ra chất thải.", "eng": "As the body works, it produces waste materials."}, {"viet": "Ở mỗi giai đoạn của hoạt động quy mô của cảnh sát.", "eng": "At each stage of the massive police operation."}, {"viet": "Chuộc lại thái độ lỗ mãng của ai.", "eng": "Atone for one's bad behaviour."}, {"viet": "Hàng rào ngăn cách những người tò mò tới gần nơi tụ tập của những người đi đưa đám giàu sụ.", "eng": "Barricades prevented the curious from coming closer to the gathering of gilt-edged mourners."}, {"viet": "Được người bằng vai của ai rất nể trọng.", "eng": "Be much respected by one's compeers."}, {"viet": "Trước lễ Giáng sinh, các nhân viên bán hàng phải chạy tới chạy lui đến đừ cả người.", "eng": "Before Christmas the shop assistants are rushed off their feet."}, {"viet": "Bill chơi tồi, james chơi tồi hơn và tôi thì chơi tồi nhất trong đám!", "eng": "Bill played badly, James played worse and I played worst of all!"}, {"viet": "Trời tôi đã uống biết bao rượu sake!", "eng": "Boy, did I drink a lot of sake!"}, {"viet": "Tạo ra sức đề kháng chống nhiễm trùng.", "eng": "Build up a resistance to infection."}, {"viet": "Như tôi đã biết rằng tiền tệ của các ông bây giờ ổn định hơn trước đây.", "eng": "But I've learned your currency is more stable now than ever before."}, {"viet": "Nhưng ông phải đính các phiếu tên này vô.", "eng": "But you'll have to attach these name bags."}, {"viet": "À, thực đơn dịch vụ phục vụ thức ăn tận phòng ở ngay trên bàn viết đây.", "eng": "By the way, the Room Service menu is right here on the desk."}, {"viet": "Thưa bà tôi có thể giúp bà không ạ?", "eng": "Can I help you, ma'am?"}, {"viet": "Anh có thể phân biệt được sự khác nhau giữa hai buổi biểu diễn tạp kỹ này với buổi kia không?", "eng": "Can you differentiate one variety from the other?"}, {"viet": "Cô có thể giới thiệu nhà hàng nào gần đây không?", "eng": "Can you recommend any restaurants nearby?"}, {"viet": "Ăn được một con hậu của đối phương.", "eng": "Capture one's opponent's queen."}, {"viet": "Bám sát đòi tiền những khách hàng còn nợ.", "eng": "Chase up clients with outstanding debts."}, {"viet": "Chuyển giấy báo cho tất cả các nhân viên bán hàng.", "eng": "Circulate a memorandum to all sales personnel."}, {"viet": "Đi thôi không chúng ta muộn mất.", "eng": "Come along or we'll be late."}, {"viet": "Đúc kết một bản báo cáo dài thành một bản tóm tắt ngắn gọn.", "eng": "Condense a long report into a brief summary."}, {"viet": "Bần thường được dùng để cách nhiệt.", "eng": "Cork is often used for insulation."}, {"viet": "Anh có thể bỏ lá thư này cho tôi chứ?", "eng": "Could you post this letter for me?"}, {"viet": "Đám đông xếp thành hàng dọc theo lộ trình của đám rước.", "eng": "Crowds of people lined the route of the procession."}, {"viet": "Cái chết đã giải thoát anh ta ra khỏi những đau khổ của anh ta.", "eng": "Death released him from his sufferings."}, {"viet": "Mặc dù đau buồn, cô ta thấy có một sức mạnh tiềm tàng trong tâm hồn chính cô ấy.", "eng": "Despite her grief, she found a hidden strength within herself."}, {"viet": "Ông đã nghỉ ngơi khỏe rồi chứ?", "eng": "Did you have a good rest?"}, {"viet": "Không mặc quần áo mùa đông vào mùa xuân.", "eng": "Discard one's winter clothes in spring."}, {"viet": "Làm công việc của mình một cách cẩu thả.", "eng": "Do one's work in a slapdash way."}, {"viet": "Các cô có giao bữa ăn nhẹ đến cho khách hàng không?", "eng": "Do you deliver the snacks to the customers?"}, {"viet": "Anh có những ý kiến gì thêm nữa không?", "eng": "Do you have any other comments?"}, {"viet": "Bạn thích màu đậm hay màu nhạt hơn?", "eng": "Do you like dark colors or light ones better?"}, {"viet": "Ông có phục vụ bán phần ăn cho trẻ em không?", "eng": "Do you serve children's portions?"}, {"viet": "Ông có muốn tôi gọi bác sĩ không?", "eng": "Do you want me to call a doctor?"}, {"viet": "Đất nước bạn có điệu múa truyền thống nào không?", "eng": "Does your country have any traditional dance forms?"}, {"viet": "Đừng có che giấu chuyện đó: nếu anh giận dữ thì hãy biểu lộ ra.", "eng": "Don't cork it all up: if you feel angry show it."}, {"viet": "Đừng để cô ta phải đợi ngoài mưa.", "eng": "Don't leave her waiting outside in the rain."}, {"viet": "Đừng có đứng ở ngoài đó: ông sẽ bị ướt sũng đấy.", "eng": "Don't stand out there: you'll get soaked through."}, {"viet": "Bạn không quen ai rành về máy tính à?", "eng": "Don't you know anyone who knows a lot about computers?"}, {"viet": "Những việc làm mờ ám không thích hợp với những lời lẽ của ông ta về đạo lý trước mọi người.", "eng": "Dubious practices which consort ill with his public statements on morality."}, {"viet": "Thuyết Einstein đánh dấu một giai đoạn mới trong toán học.", "eng": "Einstein's theory marked a new epoch in mathematics."}, {"viet": "Những bài tiểu luận được pha trộn đầy rẫy những câu thơ trích dẫn của các thi sĩ.", "eng": "Essays liberally interlarded with quotations from the poets."}, {"viet": "Mọi người đều nói thời tiết sao mà khủng khiếp thế.", "eng": "Everyone said how awful the weather was."}, {"viet": "Tập thể dục là có lợi cho sức khoẻ.", "eng": "Exercise is good for the health."}, {"viet": "Lạ thật, chưa bao giờ thấy biển!", "eng": "Fancy never having seen the sea!"}, {"viet": "Các thửa ruộng đại mạch và yến mạch chín.", "eng": "Fields of ripe barley and oats."}, {"viet": "Món cá đã bị xóa bỏ khỏi thực đơn.", "eng": "Fish has been taken off the menu."}, {"viet": "Vào khoảng cuối thế kỷ này những sự thiếu hụt lương thực có thể sẽ trở nên tệ hại hơn nữa.", "eng": "Food shortages will probably get worse towards the end of the century."}, {"viet": "Bỏ bê gia đình và bạn hữu của mình.", "eng": "Forsake one's family and friends."}, {"viet": "Đồ đạc dành cho trẻ con cần phải bền.", "eng": "Furniture for young children needs to be indestructible."}, {"viet": "Thoát khỏi một tình huống khó khăn.", "eng": "Get out of a difficult situation."}, {"viet": "Cho ai mua chịu trong sáu tháng không tính lãi.", "eng": "Give somebody six months'interest-free credit."}, {"viet": "Đức Chúa Cha, đức Chúa Con và Chúa Thánh thần.", "eng": "God the Father, god the Son and God the Holy Ghost."}, {"viet": "Cái mặt nó tội lỗi rõ ràng.", "eng": "Guilt was written all over his face."}, {"viet": "Tên sát nhân này đã thỏa mãn cơn khát máu của hắn chưa?", "eng": "Has this murderer slaked his lust for blood yet?"}, {"viet": "Bạn có bao giờ mua vé số chưa?", "eng": "Have you ever bought a lottery ticket?"}, {"viet": "Em đã xếp đồ vào vali của em chưa?", "eng": "Have you packed your suitcase yet?"}, {"viet": "Ông ta sẽ còn phải học nhiều kinh nghiệm trước khi được đề bạt.", "eng": "He'll have to cut his eye-teeth before he gets promoted."}, {"viet": "Ông ta kết hợp trong mình một nghệ sĩ, một nhà khoa học và một nhà doanh nghiệp khôn ngoan nữa.", "eng": "He's an artist, a scientist and a shrewd businessman rolled into one."}, {"viet": "Nó chăm lo cho bản thân nó thì giỏi lắm.", "eng": "He's good at looking after himself."}, {"viet": "Rõ ràng là nó có tội-đây là một trường hợp rõ rành rành.", "eng": "He's obviously guilty-it's an open-and-shut case."}, {"viet": "Đối với một ông già 75 thì ông ấy rất khoẻ mạnh.", "eng": "He's very hale and hearty for a man of 75."}, {"viet": "Anh ta trả lời với vẻ thờ ơ.", "eng": "He answered with an air of detachment."}, {"viet": "Hắn e ngại khi nghĩ đến chuyện bơi lội vào mùa đông.", "eng": "He boggled at the thought of swimming in winter."}, {"viet": "Nó không thể nắm vững được những khái niệm cơ bản của toán học.", "eng": "He can't grasp the basic concepts of mathematics."}, {"viet": "Anh ta có thể nhớ mọi chuyện nhỏ nhặt đến từng chi tiết.", "eng": "He could remember every trivial incident in great detail."}, {"viet": "Ông ta làm các việc vặt quanh nhà trong kỳ nghỉ của ông.", "eng": "He did odd jobs around the house during his holiday."}, {"viet": "Anh ta mở vòi lấy nửa lít bia từ trong thùng ra.", "eng": "He drew off a pint of beer from the barrel."}, {"viet": "Anh ấy té cầu thang và bị gãy cổ tay.", "eng": "He fell downstairs and broke his wrist."}, {"viet": "Anh ta đã đặt hết tiền vào một lần quay số.", "eng": "He gambled his money on one spin of the wheel."}, {"viet": "Anh ta đã xin được công việc hiện tại khi anh rời quân ngũ.", "eng": "He got his present job when he quit the army."}, {"viet": "Hắn chẳng thấy day dứt chút nào về việc giấu cảnh sát thông tin đó.", "eng": "He had no serious qualms about concealing the information from the police."}, {"viet": "Anh ấy đã đồng ý các điều khoản lương và sẵn sàng ký một hợp đồng mới.", "eng": "He has agreed salary terms and is ready to sign a new contract."}, {"viet": "Ông ấy đã dành dụm được một số tiền lớn.", "eng": "He has put aside a good sum of money."}, {"viet": "Anh ta vội vã đi qua mà không nói với tôi gì cả.", "eng": "He hurried by without speaking to me."}, {"viet": "Hiện giờ anh ấy đang họp.", "eng": "He is in a meeting now."}, {"viet": "Ông ấy là cha xứ của một giáo xứ lớn ở vùng quê.", "eng": "He is vicar of a large rural parish."}, {"viet": "Nó sống buông thả và chết trong đói nghèo.", "eng": "He led a disordered life and died in poverty."}, {"viet": "Anh ấy xem xét cẩn thận các đề nghị trước khi chấp thuận chúng.", "eng": "He looked the proposals through before approving them."}, {"viet": "Nhờ lấy vợ anh ta đã thuộc giai cấp quí tộc Pháp!", "eng": "He married into the French aristocracy!"}, {"viet": "Anh ta leo lên được địa vị hiện nay là do ưu đãi hơn là do có công lao hoặc khả năng.", "eng": "He obtained his position more by favour than by merit or ability."}, {"viet": "Hắn ta viện cớ vì nghèo túng để được giảm nhẹ tội ăn trộm.", "eng": "He pleaded poverty in extenuation of theft."}, {"viet": "Anh ta dận mạnh chân ga.", "eng": "He put his foot down hard on the accelerator."}, {"viet": "Ông ta đã nhận ra bức tranh ấy là một tác phẩm đầu tay của Degas.", "eng": "He recognized the painting as an early work by Degas."}, {"viet": "Anh ta giụi mắt rồi ngáp, cứ như thể vừa thức dậy sau một giấc ngủ dài.", "eng": "He rubbed his eyes and yawned as though waking up after a long sleep."}, {"viet": "Hắn là một người Anh chính cống.", "eng": "He's an English man through and through."}, {"viet": "Anh ta ở phòng số một không hai.", "eng": "He's in room one oh two."}, {"viet": "Ông ta còn đang lưỡng lự không biết có nên tham gia cuộc thám hiểm hay không.", "eng": "He's still hesitating about joining the expedition."}, {"viet": "Hắn ngồi khoanh tay trước ngực.", "eng": "He sat with his arms across his chest."}, {"viet": "Ông ta châm que diêm cháy vào gỗ khô.", "eng": "He set a match to the dry timber."}, {"viet": "Nó lẻn ra ngoài trong một lúc cuộc trò chuyện tạm ngưng.", "eng": "He slipped out during a pause in the conversation."}, {"viet": "Ông ta hùng hổ đi ra khỏi phòng với vẻ giận dữ.", "eng": "He stalked angrily out of the room."}, {"viet": "Anh ta nhét vội bức thư qua cửa rồi hối hả bỏ đi.", "eng": "He stuffed the letter through the door and hurried away."}, {"viet": "Ông ta cho là hầu hết nghệ thuật hiện đại là vô giá trị.", "eng": "He thinks most modern art is trash."}, {"viet": "Nó tháo rời cái máy ra từng mảnh rồi lắp ráp lại.", "eng": "He took the machine to pieces and then put it together again."}, {"viet": "Anh ta theo đuổi việc nghiên cứu và hành nghề y khoa.", "eng": "He turned to the study and practice of medicine."}, {"viet": "Ông muốn học hỏi thêm nhiều về nó.", "eng": "He wanted to learn more about it."}, {"viet": "Nhiều lần anh ấy được mời gia nhập đảng, nhưng bao giờ anh ta cũng giữ thái độ cách biệt.", "eng": "He was asked many times to join the party, but he always kept his distance."}, {"viet": "Anh ta ho và thở khò khè suốt đêm.", "eng": "He was coughing and wheezing all night."}, {"viet": "Họ tặng anh ấy một chiếc đồng hồ vàng để bày tỏ lòng biết ơn việc làm của anh ấy đối với công ty.", "eng": "He was given a gold watch in acknowledgement of his work for the company."}, {"viet": "Anh ta được biểu dương vì lòng dũng cảm.", "eng": "He was mentioned in dispatches for his bravery."}, {"viet": "Anh ta đã trở thành một người bới rác và nhặt nhạnh thức ăn ở những đống rác.", "eng": "He was reduced to the life of a scavenger, and collected his food from the garage dump."}, {"viet": "Những hình ảnh về quyền thế và giàu có đã trêu tức ông ta.", "eng": "He was tantalized by visions of power and wealth."}, {"viet": "Anh ta nhìn mọi thứ với vẻ dửng dưng.", "eng": "He watched everything with a blase air."}, {"viet": "Anh ta sẵn sàng đồng ý cho cô ta đi nhờ xe.", "eng": "He willingly agreed to give her a lift."}, {"viet": "Ông ấy viết di chúc kể tên những người con được thừa kế.", "eng": "He wrote a will naming his children as beneficiaries."}, {"viet": "Tài khoản của cô ta được ghi 50 bảng Anh vào bên nợ.", "eng": "Her account was debited with £ 50."}, {"viet": "Cách hoá trang cẩn thận của bà ta che kín những dấu vết của tuổi tác.", "eng": "Her careful make-up hid the signs of age beneath."}, {"viet": "Chiếc áo váy của cô ta phủ đầy những đồng trang trí tròn lấp lánh mỗi khi cô ta di chuyển.", "eng": "Her dress was covered in sequins which twinkled as she moved."}, {"viet": "Thiên tài của cô ta đang phát triển tới tột đỉnh.", "eng": "Her genius was in full bloom."}, {"viet": "Lời xúc phạm của cô ấy đả kích anh ấy có câu trả lời thô bỉ.", "eng": "Her insult stung him into making a rude reply."}, {"viet": "Mẹ cô ấy không bao giờ thôi kể với bạn về những chuyện rắc rối của bà ấy.", "eng": "Her mother never ceases telling you about her troubles."}, {"viet": "Chiếc áo đen bình thường của cô ta là quà đơn sơ đối với một dịp vui vẻ như thế này.", "eng": "Her plain black dress was too severe for such a cheerful occasion."}, {"viet": "Các con ngựa triển lãm của bà ta được chăn nuôi tại một cơ ngơi một mẫu rưỡi Anh của cặp vợ chồng đó ở Malibu.", "eng": "Her show horses were kept on the couple's one-and-a-half are Malibu layout."}, {"viet": "Thái độ, cách cư xử của cô ấy đáng khâm phục.", "eng": "Her unexceptionable behaviour, conduct."}, {"viet": "Trên bàn viết đây có thẻ thông tin.", "eng": "Here on the desk is the information card."}, {"viet": "Những câu trả lời của anh ta thiếu sót một cách thê thảm.", "eng": "His answers were pathetically inadequate."}, {"viet": "Cái chân gãy của anh ấy đã được bó bột.", "eng": "His broken leg was encased in plaster."}, {"viet": "Tội ác của hắn đã đem lại cho hắn một tiếng tăm rất xấu.", "eng": "His crimes earned him considerable notoriety."}, {"viet": "Mặt anh ta khi bực bội trông buồn cười.", "eng": "His face is so ludicrous in its dismay."}, {"viet": "Những điều tiên đoán đen tối của ông ta đã tỏ ra là không đúng.", "eng": "His gloomy prognostications proved to be false."}, {"viet": "Cái áo choàng của anh ta bị tuột khóa dây khi anh ta chạy.", "eng": "His jacket unzipped as he ran."}, {"viet": "Tâm trí anh ta bấn loạn khi được tin đó.", "eng": "His mind reeled when he heard the news."}, {"viet": "Gia đình anh ta đã từng là nông dân bao đời.", "eng": "His people have been farmers for generations."}, {"viet": "Những nhận xét của anh ta chứng tỏ anh ta đáng bị chê trách là thiếu tế nhị.", "eng": "His remarks convicted him of a lack of sensitivity."}, {"viet": "Lời khai của hắn với cảnh sát đã được sử dụng làm bằng chứng để chống lại nó.", "eng": "His statement to the police was used in evidence against him."}, {"viet": "Kì nghỉ lễ vừa rồi anh ta tiêu hơn một ngàn đô la.", "eng": "His vacation cost him upwards of a thousand dollars."}, {"viet": "Tổ chức một cuộc họp mặt hàng năm của những cựu chiến binh.", "eng": "Hold an annual reunion of war veterans."}, {"viet": "Cà phê nóng có thể gây bỏng độ một.", "eng": "Hot coffee can give first-degree burns."}, {"viet": "Làm thế nào chúng tôi có thể diễn tả lòng cảm kích trước sự giúp đỡ kinh tế của ông?", "eng": "How can we express our appreciation for your economic assistance?"}, {"viet": "Tôi có thể tìm được sự hoạt động sôi nổi của thành phố này ở đâu?", "eng": "How do I find out where the action is in this town?"}, {"viet": "Nền kinh tế ở nước bạn như thế nào?", "eng": "How is the economy in your country?"}, {"viet": "Đầu máy ấy có thể kéo được bao nhiêu toa hành khách?", "eng": "How many coaches can that locomotive pull?"}, {"viet": "Ở nước bạn, tiền bảo hiểm xe hơi là bao nhiêu?", "eng": "How much, is basic car insurance in your country?"}, {"viet": "Bao lâu cô nhận được tin của chị cô?", "eng": "How often do you hear from your sister?"}, {"viet": "Mỗi ngày có hàng trăm di dân kinh tế đến thành phố này.", "eng": "Hundreds of economic migrants are arriving in the city everyday."}, {"viet": "Tôi cũng muốn thế, vì tôi cần một cái áo khoác mùa xuân mới.", "eng": "I'd like to do the same, for I need a new spring coat."}, {"viet": "Tôi sẽ đánh bại nó.''Thế ư, anh không có cơ may nào đâu!'.", "eng": "I'll beat him.''Says you, you haven't got a chance!'."}, {"viet": "Tôi chỉ việc khâu lại chỗ rách, và cái áo choàng sẽ lại như mới.", "eng": "I'll just sew up that tear, and the coat will be as good as new."}, {"viet": "Tôi sẽ cố gắng dò xét để đánh giá phản ứng của mọi người đối với đề nghị của chúng ta.", "eng": "I'll try to put out some feelers to gauge people's reactions to our proposal."}, {"viet": "Tôi gọi điện để hỏi về căn hộ cho thuê.", "eng": "I'm calling about the apartment for rent."}, {"viet": "Tôi sẽ đưa anh đi ăn tối, bất kể tốn kém.", "eng": "I'm going to take you out to dinner, no expense spared."}, {"viet": "Tôi không rành khu vực này.", "eng": "I'm not familiar with this area either."}, {"viet": "Tôi ghen tỵ với anh vì anh lại được thêm một ngày nghỉ nữa.", "eng": "I'm so envious of you getting an extra day's holiday."}, {"viet": "Tôi chắc là chúng tôi có mối quan hệ ngân hàng đại lý với ngân hàng của ông bởi vì chúng tôi giữ mối quan hệ đại lý với hầu hết các ngân hàng ở Luôn Đôn.", "eng": "I'm sure we have a correspondent relationship with your bank, as we maintain a correspondent relationship with most of the large banks in London."}, {"viet": "Tôi cũng muốn đi nhưng có mỗi lần chúng ta lên kế hoạch thì lại bị huỷ.", "eng": "I've also wanted to go but every time we make a plan, it gets canceled."}, {"viet": "Tôi đã kiểm tra tờ hướng dẫn giải trí trong thành phố tối nay.", "eng": "I've checked the entertainment guide in town this evening."}, {"viet": "Tôi đã lùng sục khắp nơi nhưng không tìm thấy cái đó.", "eng": "I've hunted everywhere but I can't find it."}, {"viet": "Tôi đã đưa cho anh ta xem những tấm hình, thế mà đến bây giờ anh ta vẫn chẳng tin tôi.", "eng": "I've shown him the photographs but even now he won't believe me."}, {"viet": "Tôi cứ luôn luôn sửa thế ngồi liên tục trong những cuộc họp kéo dài.", "eng": "I always get fidgets during long meetings."}, {"viet": "Tôi không phải là không ý thức được vấn đề đó.", "eng": "I am not unaware of the problem."}, {"viet": "Tôi hỏi anh ta là anh ta có đến hay không.", "eng": "I asked him whether or not he was coming."}, {"viet": "Tôi đã mua cái đồng hồ đeo tay này của một người bạn giá 10 bảng Anh.", "eng": "I bought this watch from a friend for £ 10."}, {"viet": "Tôi không thể nào gọi được-chắc đường dây bị hỏng.", "eng": "I can't get through-the lines must be crossed."}, {"viet": "Tôi không sao lần ra nổi các con số này.", "eng": "I can't untangle these figures."}, {"viet": "Tôi có thể lên dây đàn clavico cũng như chơi nó.", "eng": "I can tune the harpsichord as well as play."}, {"viet": "Sáng nay tôi đã đổi một tấm séc ở ngân hàng.", "eng": "I cashed a cheque at the bank this morning."}, {"viet": "Mình không thể gom góp đâu cho đủ tiền để mua chiếc xe đạp mới.", "eng": "I couldn't rake together enough money for a new bike."}, {"viet": "Tôi thà nhịn đói còn hơn là ăn thứ đó!", "eng": "I'd rather go hungry than eat that!"}, {"viet": "Tôi không ăn một tí thịt nào cả.", "eng": "I didn't eat any meat."}, {"viet": "Tôi không hiểu nó làm thế nào mà tọng hết cả chỗ ấy!", "eng": "I don't know how he manages to put it all away!"}, {"viet": "Tôi không ngờ anh ta lại dính vào vụ bê bối ngân hàng như vậy.", "eng": "I don't realize he was mixed-up in that banking scandal."}, {"viet": "Tôi không muốn tiếp tục làm việc ở đây mãi mãi.", "eng": "I don't want to go on working here ad infinitum."}, {"viet": "Tôi không đọc loại sách báo rẻ tiền đó.", "eng": "I don't read that tripe."}, {"viet": "Xin mạn phép người nói cuối cùng, tôi cảm thấy chúng ta phải hoãn lại.", "eng": "I feel, pace the last speaker, that we should adjourn."}, {"viet": "Tôi cảm thấy chúng ta không có một cơ may vừa phải để thành công.", "eng": "I felt that we weren't getting a fair crack of the whip."}, {"viet": "Tôi cho rằng không phải lúc thích hợp để nói với cô ta.", "eng": "I gauged that it was not a good moment to speak to her."}, {"viet": "Tôi đồng ý với anh rằng cô ta là một người đàn bà khôn khéo, song tôi không muốn làm việc cho cô ta.", "eng": "I grant you she's a clever woman, but I wouldn't want to work for her."}, {"viet": "Tôi quên khuấy mất là hôm nay anh đến.", "eng": "I had slipped my memory that you were arriving today."}, {"viet": "Tôi có nhiều sự đồng cảm với cô ấy vì cô ấy cũng là một người tha phương như tôi.", "eng": "I have a lot of fellow feeling with her because she's a migrant like me."}, {"viet": "Tôi chưa bao giờ được biết nó cư xử khác, ngoài tính ích kỷ.", "eng": "I have never known him behave other than selfishly."}, {"viet": "Tôi phải đi mua sắm tối nay.", "eng": "I have to go shopping this evening."}, {"viet": "Tôi không biết anh ta lâu bằng bạn.", "eng": "I haven't known him as long as you."}, {"viet": "Tôi hy vọng ông ta không nổi giận khi tôi nói với ông ta điều tôi đã làm.", "eng": "I hope he doesn't cup up rough when I tell him what I've done."}, {"viet": "Tôi ngâm thân thể nóng bỏng của mình vào bể bơi mát mẻ.", "eng": "I immersed my boiling body in a cool pool."}, {"viet": "Tôi biết mặt nó nhưng không nhớ tên nó và gặp nó ở đâu.", "eng": "I know his face but i cannot place him."}, {"viet": "Tôi càng yêu mến nó hơn vì tính bộc trực của nó.", "eng": "I like him none the worse for being outspoken."}, {"viet": "Tôi sẽ mang chúng đến ngay.", "eng": "I'll bring them right away."}, {"viet": "Tôi sẽ trả lại bạn tuần sau.", "eng": "I'll pay you back next week."}, {"viet": "Tôi e rằng hiện giờ ông ấy đã đi vắng rồi.", "eng": "I'm afraid he's out just now."}, {"viet": "Mẹ đét đít con bây giờ nào!", "eng": "I'm going to wear you out!"}, {"viet": "Tôi đang đi mua quà Giáng Sinh.", "eng": "I'm shopping for Christmas presents."}, {"viet": "Tôi đâu có nói mình là một người mẫu mực.", "eng": "I make no claim to be a paragon."}, {"viet": "Tôi phải ra ngoài để thoải mái một lúc.", "eng": "I must go out for a quick breather."}, {"viet": "Tôi cần phải ổn định cuộc sống một tí trước khi tôi bắt đầu tìm một công việc làm mới.", "eng": "I need to sort my life out a bit, before I start looking for a new job."}, {"viet": "Tôi chỉ thấy cái đó từ khu bên ngoài.", "eng": "I only saw it from the outside."}, {"viet": "Tôi đã để nó trong tủ búp phê hay đâu đó.", "eng": "I put it in the cupboard or somewhere."}, {"viet": "Tôi nhận ra cô ta ngay khi tôi trông thấy cô ta.", "eng": "I recognized her immediately I saw her."}, {"viet": "Tôi ngồi giữa Sue và Jane trong bữa tiệc Giáng sinh.", "eng": "I sat between Sue and Jane at the Christmas party."}, {"viet": "Tôi sẽ thích thú được biết điều đang xảy ra.", "eng": "I shall be interested to know what happens."}, {"viet": "Tôi lấy dao rọc lá thư.", "eng": "I slitted open the letter with a knife."}, {"viet": "Tôi cho rằng, để bào chữa, anh ấy lúc nào cũng có thể cho là anh ấy có một gia đình phải nuôi nấng.", "eng": "I suppose that, in justification, he could always claim he had a family to support."}, {"viet": "Tôi nghĩ là tôi sẽ nghỉ chiều nay.", "eng": "I think I'll take the afternoon off."}, {"viet": "Tôi cho là họ đã có một cuộc cãi vã.", "eng": "I think they've had a row."}, {"viet": "Tôi nói huỵch toẹt với anh ta là tôi nghĩ anh ta nói dối.", "eng": "I told him straight out that I thought he was lying."}, {"viet": "Tôi đã đánh giá thấp thời gian chúng tôi cần vào khoảng 30%.", "eng": "I underestimated the time we needed by 30%."}, {"viet": "Tôi muốn có bản báo cáo tỉ mỉ về tình hình.", "eng": "I want a complete run-down on the situation."}, {"viet": "Tôi muốn gửi lá thư này tới Nhật, theo đường hàng không.", "eng": "I want to send this letter to Japan, airmail."}, {"viet": "Tôi bị chiếc xe ô tô chạy ngang qua làm bắn bùn lên đầy người.", "eng": "I was covered with mud by a passing car."}, {"viet": "Tôi chỉ là một con tốt trong mưu kế quỷ quyệt của anh ta.", "eng": "I was merely a pawn in his cunning stratagem."}, {"viet": "Tôi hết sức xúc động vì trí thông minh và vẻ duyên dáng của cô ấy.", "eng": "I was swept off my feet by her wit and charm."}, {"viet": "Tôi sẽ rất vui được giải thích cho ông.", "eng": "I will be glad to explain it to you."}, {"viet": "Phải chi anh đừng nói với tôi tất cả chuyện này.", "eng": "I wish you hadn't told me all this."}, {"viet": "Mãi đến sang năm tôi mới đủ khả năng.", "eng": "I won't qualify until next year."}, {"viet": "Tôi muốn đặt chỗ trước cho nhóm 5 người lúc 6 giờ tối nay.", "eng": "I would like to make reservations for a party of five at six o'clock tonight."}, {"viet": "Tôi không cho rằng họ giàu có.", "eng": "I wouldn't say they were rich."}, {"viet": "Nếu anh ta tiêu phí tiền của anh ta thì đó là chuyện riêng của anh ta.", "eng": "If he wastes his money, that's his look-out."}, {"viet": "Nếu chi phí sản xuất gia tăng, sẽ có một sự gia tăng giá cả theo giá cả tương ứng.", "eng": "If production cost go up, there will be increase price pro rata."}, {"viet": "Nếu không được chữa trị thì bệnh đó có thể trở nên nguy hiểm.", "eng": "If untreated, the illness can become severe."}, {"viet": "Giá mà anh chải đầu thì trông anh sẽ gọn gàng hơn đấy.", "eng": "If you brushed your hair, you'd look tidier."}, {"viet": "Nếu anh lạc vào sa mạc, đó là chuyện rắc rối của anh.", "eng": "If you get lost in the desert, that is your funeral."}, {"viet": "Nếu anh nghe lời khuyên của tôi, anh sẽ không dính dáng gì tới nó nữa.", "eng": "If you take my advice, you'll have nothing more to do with him."}, {"viet": "Những người thợ nhập cư được xếp vào loại cư dân nước ngoài.", "eng": "Immigrant workers were classed as resident aliens."}, {"viet": "Đối với các yêu cầu của ông ngày 8 tháng ba, chúng tôi lấy làm tiếc báo cho ông biết là.", "eng": "In connection with your request of March 18 th, we are sorry to tell you..."}, {"viet": "Chỉ trong vòng vài năm qua nó đã vượt lên trên cả Calcutta.", "eng": "In just the past few years it has gone ahead of Calcutta."}, {"viet": "Về môn viết nhạc hoà âm, ông ta là một nghệ sĩ bậc thầy.", "eng": "In symphonic writing he is the master craftsman."}, {"viet": "Ở Sa-ha-ra bây giờ đã có xe buýt và xe tải chạy khắp hoang mạc.", "eng": "In the Sahara regular bus and truck lines now operate across parts of the desert."}, {"viet": "Tăng năng suất hay là mất việc của bạn!", "eng": "Increase productivity or lose your jobs!"}, {"viet": "Chính quyền có phải đang trở nên quá tập trung không?", "eng": "Is government becoming too centralized?"}, {"viet": "Nhà của gia đình Smith ở đâu trong khu vực này phải không?", "eng": "Is the Smiths'residence somewhere in this neighborhood?"}, {"viet": "Bà muốn đến nhà ga này phải không, thưa bà?", "eng": "Is this the station you mean, madam?"}, {"viet": "Điều đáng tiếc là thời tiết hôm nay không tốt hơn cho cuộc đi chơi ngoài trời của chúng ta.", "eng": "It's a pity the weather isn't better for our outing today."}, {"viet": "Rõ ràng là cách vẽ tranh của cô ấy đã chịu ảnh hưởng của Picasso.", "eng": "It's clear that her painting has been influenced by Picasso."}, {"viet": "Trong nhà nóng ta hãy ngồi ngoài vườn.", "eng": "It's hot indoors, let us sit out in the garden."}, {"viet": "Nói chuyện khi mồm đang nhồm nhoàm bị coi là không lịch sự.", "eng": "It's not considered polite to talk with your mouth full."}, {"viet": "Bọn phiến loạn bị đè bẹp chỉ còn là vấn đề thời gian.", "eng": "It's simply a matter of time before the rebels are crushed."}, {"viet": "Nó rất thông dụng, nhất là ở miền Bắc Trung Quốc, hơn nữa vị của nó khá ngon.", "eng": "It's very common, especially in the north part of China and the taste of it is not bad."}, {"viet": "Đơn đặt hàng về muộn một tuần, thế thì còn nói gì chuyên hiệu quả công việc của chúng tôi.", "eng": "It doesn't say much for our efficiency that the order arrived a week late."}, {"viet": "Thật khó tin rằng cách đây chỉ một thời gian tương đối ngắn, chỗ này chỉ là một mảnh đất trơ trụi, và bây giờ đang đứng ở đây là tòa nhà cao 42 tầng nguy nga này.", "eng": "It is difficult to believe that only a relatively short time ago this was a bare patch of land, and now this imposing 42-storey building stands here."}, {"viet": "Nó là một trong những công viên lớn nhất ở Bắc Kinh.", "eng": "It is one of the largest parks in Beijing."}, {"viet": "Điều đó có tác động cực kỳ to lớn đối với tôi.", "eng": "It makes a tremendous difference to me."}, {"viet": "Ngon nhất là tái hoặc tái vừa.", "eng": "It's best rare or medium rare."}, {"viet": "Mà chỉ nói rằng chính phủ không có quyền đưa ra bất cứ đạo luật nào “ đề cao một giáo hội hay cấm đoán quyền tự do hành đạo ”.", "eng": "It says the government cannot make any law respecting an establishment of religion or prohibiting the free exercise of religion."}, {"viet": "Tôi đã phải mất nhiều ngày mới moi được sự thật ở cô ta.", "eng": "It took me days to extract the truth from her."}, {"viet": "Rõ ràng là ngay cả trước khi xuất bản, cuốn sách chắc sẽ thành công.", "eng": "It was clear, even before publication, that the book would be a success."}, {"viet": "Trời mưa to nhưng anh ta vẫn không nản lòng, cứ ra đi.", "eng": "It was raining heavily but he set out undeterred."}, {"viet": "Nó sẽ bảo hiểm tất cả các rủi ro liên quan đến hàng hóa trên tàu.", "eng": "It will cover all risks on the goods."}, {"viet": "Tôi nghĩ rằng Jane còn ở đây-có phải áo khoác của cô ấy kia không?", "eng": "Jane's here, I think-isn't that her coat?"}, {"viet": "John hát rất hay dù ta có thể biện luận rằng Peter là diễn viên khá hơn.", "eng": "John sings very well though Peter is arguably the better actor."}, {"viet": "Giữ một việc là theo dõi hoạt động của chính quyền địa phương.", "eng": "Keep a watching brief on local government activity."}, {"viet": "Cả hai chúng ta hãy đi cùng anh ấy đến xem triển lãm công nghệ nhé.", "eng": "Let's both go with him to see Techexhibit."}, {"viet": "Chúng ta hãy nghĩ ở nơi thoáng mát.", "eng": "Let's rest in a cool place."}, {"viet": "Nhiều người vô gia cư trong thành phố sống ở ngoài đường phố.", "eng": "Many derelicts in the city live on the streets."}, {"viet": "Nhiều cây trút hết lá về mùa đông.", "eng": "Many trees lose their leaves in winter."}, {"viet": "Tôi xin quý khách chú ý vào tờ bướm “ An toàn trong chuyến bay ” mà quý khách có thể tìm thấy trong túi ở ghế phía trước quý khách.", "eng": "May I draw your attention to the Safety in Flightleaflet which you can find in the pocket of the seat in front of you."}, {"viet": "Có lẽ đôi này là cỡ thích hợp.", "eng": "Maybe these are the right size."}, {"viet": "Hầu hết tiền đã được phân chia.", "eng": "Most of the money has already been allotted."}, {"viet": "Nhiều chuyện hài hước của Anh dựa trên tính lưỡng nghĩa của ngôn từ.", "eng": "Much British humour depends on ambiguity."}, {"viet": "Sự tò mò cuối cùng của tôi đã thắng tôi, tôi mở lá thư ra.", "eng": "My curiosity finally got the better of me and I opened the letter."}, {"viet": "Nhà tôi ở gần trạm xe buýt rất tiện.", "eng": "My house is conveniently near a bus-stop."}, {"viet": "Kế hoạch của tôi bị uỷ ban cực lực bác bỏ.", "eng": "My plan was firmly squashed by the committee."}, {"viet": "Sự rút lui khỏi Mátxcơva của Napoleon là bước ngoặt quan trọng trong sự nghiệp của ông ta.", "eng": "Napoleon's retreat from Moscow was a watershed in his career."}, {"viet": "Lần sau bạn phải đến thăm tôi đấy.", "eng": "Next time you must come and visit me."}, {"viet": "Không nước nào dám sao nhãng việc giáo dục thanh niên.", "eng": "No country can afford to neglect the education of its young people."}, {"viet": "Bây giờ, một việc nữa chúng ta phải nghĩ đến là việc thiết kế lại văn phòng chính.", "eng": "Now, another thing we've got to think about is the redesign of the main office."}, {"viet": "Những bệnh nhân béo phì được khuyên thay đổi chế độ ăn uống của họ.", "eng": "Obese patients are advised to change their diet."}, {"viet": "Ồ, căn phòng thật ấm cúng!", "eng": "Oh, what a nice cozy room!"}, {"viet": "Trung bình tôi làm thêm giờ khoảng 2 lần một tuần.", "eng": "On the average I work overtime about twice a week."}, {"viet": "Một đêm nọ, cô ấy nghĩ là cô ấy nghe thấy mẹ cô ấy gọi.", "eng": "One night she thought she heard her mother calling."}, {"viet": "Otter được viết với hai chữ t.", "eng": "Otter is spelled with a double t."}, {"viet": "Kế hoạch tương lai của chúng tôi rất không ổn định, mọi sự đều ở trong tình trạng thay đổi liên tục.", "eng": "Our future plans are very unsettled, everything is in a state of flux."}, {"viet": "Quan điểm của chúng tôi như mặt trăng mặt trời.", "eng": "Our points of view are at opposite poles."}, {"viet": "Từ nhiều thế kỷ những con vật này đã quen sống trong một môi trường khô ráo.", "eng": "Over the centuries, these animals have become habituated to living in such a dry environment."}, {"viet": "Việc trả tiền cho bữa ăn tối làm tôi hơi cạn tiền.", "eng": "Paying for the dinner has left me a bit light."}, {"viet": "Có lẽ tôi nên gửi theo kiểu bảo đảm.", "eng": "Perhaps I should send it by registered mail."}, {"viet": "Điều lệnh của cảnh sát quy định rằng số hiệu của một cảnh sát viên phải được nhìn rõ.", "eng": "Police regulations prescribe that an officer's number must be clearly visible."}, {"viet": "Cứu tên tuổi ai khỏi quên lãng.", "eng": "Rescue somebody's name from oblivion."}, {"viet": "Sự cách li những người mắc bệnh truyền nhiễm với những người bệnh khác.", "eng": "Separation of the infections patients from other patients."}, {"viet": "Cầu trời, một ngày nào đó cô ta sẽ khá hơn!", "eng": "She'll get better one day, please God!"}, {"viet": "Cô ta bị giáng chức từ hiệu trưởng xuống làm hiệu phó.", "eng": "She's been downgraded from principal to deputy."}, {"viet": "Cô ấy yêu say đắm ( hết lòng ) ( anh ta ).", "eng": "She's head over heels in love ( with him )."}, {"viet": "Cô ấy đang tập một bản nhạc mới trên đàn dương cầm.", "eng": "She's practising a new piece on the piano."}, {"viet": "Cô ấy hay mắc cỡ và rất cần được động viên mới dám nói.", "eng": "She's very shy and needs to be drawn out."}, {"viet": "Cô ấy cố gắng đẩy chiếc ô tô sang bên đường.", "eng": "She attempted to push the car to the side of road."}, {"viet": "Bà ta nhớ lại ngày cưới của mình.", "eng": "She cast her mind back to her wedding day."}, {"viet": "Cô ấy có ngốc thì mới chấp nhận.", "eng": "She'd be a fool to accept."}, {"viet": "Cô ta không đủ mọi tiêu chuẩn chuyên môn nhưng tôi nghĩ chúng ta nên chiếu cố cho cô ta.", "eng": "She doesn't have all the qualifications but I think we should stretch a point in her favour."}, {"viet": "Cô ta cảm thấy mình như vật thừa trong bữa tiệc vì tất cả mọi người hình như đều có đôi.", "eng": "She felt like a fifth wheel at the party since everyone else seemed to have paired off."}, {"viet": "Cô ta bị tào tháo đuổi khi uống rượu.", "eng": "She gets the back-door trot when she drinks wine."}, {"viet": "Bà ấy ngủ gục trên tờ báo.", "eng": "She had dropped asleep over her newspaper."}, {"viet": "Cô ấy được chọn làm đại biểu Công Đảng cho tỉnh York.", "eng": "She has been adopted as Labour candidate for York."}, {"viet": "Cô ấy thở dài nhẹ nhõm khi nhìn thấy con chó bị mất.", "eng": "She heaved a sigh of relief at the sight of her lost dog."}, {"viet": "Tất cả bà con hàng xóm đều mến cô ta.", "eng": "She is liked by the whole neighbourhood."}, {"viet": "Cô ấy vẫn mặc áo khoác mặc dù ở trong phòng ấm.", "eng": "She kept her coat on, although it was warm in the room."}, {"viet": "Cô ta đã lườm tôi khi tôi gợi ý cởi bỏ hết quần áo mà bơi.", "eng": "She looked at me rather askance when I suggested a swim in the nude."}, {"viet": "Cô ta làm hỏng khi thi lần cuối.", "eng": "She messed up on the final examination."}, {"viet": "Cô ấy nhìn chăm chú trong màn sương, cố tìm ra đường đi đúng.", "eng": "She peered through the mist, trying to find the right path."}, {"viet": "Bà ta đã chỉ trích công khai ông Bộ trưởng về những nhận xét không thận trọng của ông.", "eng": "She rapped the Minister publicly for his indiscreet remarks."}, {"viet": "Cô ta là một cây toán.", "eng": "She's a whizz at maths."}, {"viet": "Cô ta có quan điểm cực hữu.", "eng": "She's on the far right."}, {"viet": "Cô ấy nói rằng cho dù họ thắng hay thua thì cũng không thành vấn đề.", "eng": "She says it doesn't matter if they win or lose."}, {"viet": "Bà ta tỏ ra hoàn toàn không quan tâm đến người khác và những tình cảm của họ.", "eng": "She shows a total disregard for other people and their feelings."}, {"viet": "Cô trân trân nhìn ra ngoài cửa sổ, chìm đắm trong mơ màng.", "eng": "She stared out of the window, lost in day-dreams."}, {"viet": "Bà ta nói nhiều quá đến nỗi chúng tôi không lúc nào có thể xen vào được.", "eng": "She talks so much that the rest of us never get a look-in."}, {"viet": "Bà ta khiếp hãi quay mặt đi khi nhìn thấy máu me đầm đìa.", "eng": "She turned away in horror at the sight of so much blood."}, {"viet": "Chị ấy là khách thường xuyên của phòng tranh.", "eng": "She was a frequent visitor to the gallery."}, {"viet": "Cô ấy hoan hỉ vì được tăng lương.", "eng": "She was chuffed at getting a pay rise."}, {"viet": "Hôm qua cô ấy bị ốm nhưng hôm nay cô ấy còn yếu hơn.", "eng": "She was ill yesterday, but today she's worse."}, {"viet": "Có lẽ bà ấy là nhà văn vĩ đại nhất trong cùng thế hệ với bà.", "eng": "She was possibly the greatest writer of her generation."}, {"viet": "Cô ta bị căng thẳng và quá xúc động trước buổi trình diễn.", "eng": "She was tense and overstrung before the performance."}, {"viet": "Bà ta thất hứa về những thoả thuận mua bán với chúng tôi.", "eng": "She welshed on the bargain she made with us."}, {"viet": "Cô ta đoạt giải nhất trong môn chạy đua 100 mét.", "eng": "She won first prize in the 100 metres race."}, {"viet": "Núp dưới phía khuất gió ở một hàng rào.", "eng": "Shelter under the lee of a hedge."}, {"viet": "Im miệng ngay không tao đánh cho một cái bây giờ!", "eng": "Shut up or I'll dot you one!"}, {"viet": "Ngài Reginald thường được các bạn thân gọi là Porky.", "eng": "Sir Reginald known to his intimates as Porky."}, {"viet": "Những người đi mua sắm thông minh thường tìm “ hàng giảm giá ” mà, trong hầu hết mọi trường hợp, là một cơ hội tuyệt hảo để mua các sản phẩm có chất lượng với giá đã được giảm.", "eng": "Smart shoppers often look for sales, which, in most cases, are an excellent opportunity to buy quality products at reduced prices."}, {"viet": "Nhiều người đến cùng một lúc đến nỗi tôi không biết có cả thảy bao nhiêungười.", "eng": "So many arrived at once that I lost count of them."}, {"viet": "Một số tấn công nhau lén lút và đe doạ giải quyết những bất đồng bằng việc đánh nhau.", "eng": "Some backstab each other and threaten to settle their differences with a punch."}, {"viet": "Một số tù nhân đánh lạc hướng sự chú ý trong khi Riggs trèo tường.", "eng": "Some of the prisoners created a diversion while Riggs climbed the wall."}, {"viet": "Phóng viên vô danh tiểu tốt nào đó.", "eng": "Some two penny – half penny little reporter."}, {"viet": "Xin lỗi, bây giờ tôi không thể nói chuyện được.", "eng": "Sorry, but I can't talk now."}, {"viet": "Trải qua hai tháng sóng gió tại Anh trong thời chiến tranh.", "eng": "Spent two chanceful months in England during the war."}, {"viet": "Lưới thép mắt cáo được đặt quanh máy móc nguy hiểm.", "eng": "Steel lattice-work placed around dangerous machinery."}, {"viet": "Đừng có rồ dại như thế nữa, các con, lên giường ngủ đi!", "eng": "Stop that nonsense, children, and get into bed!"}, {"viet": "Cho gia súc ăn để trị bệnh bằng pênixilin với liều lượng thấp.", "eng": "Subtherapeutic feeding of penicillin to livestock."}, {"viet": "Chịu những khắc nghiệt của mùa Đông ở Bắc cực.", "eng": "Suffer the asperities of winter near the North Pole."}, {"viet": "Swahili là ngôn ngữ chung cho vùng Đông Phi.", "eng": "Swahili is the principal lingua franca in East Africa."}, {"viet": "Ngay khi có cơ hội đầu tiên bạn phải chụp lấy liền.", "eng": "Take the first opportunity that offers."}, {"viet": "Điện chuyển tiền làm cho việc chuyển tiền nhanh hơn nhiều.", "eng": "Telegraphic transfer makes remittance much faster."}, {"viet": "Cảm ơn sự giúp đỡ ân cần của ông.", "eng": "Thank you for all your kind help."}, {"viet": "Đó là điều tôi muốn và tôi đang rất cần nó.", "eng": "That's what I want, and I want it bad."}, {"viet": "Thằng cha đó bắt đầu làm càn, tống nó đi.", "eng": "That fellow is getting rough, give him the bum's rush."}, {"viet": "Con vật nguy hiểm nhất: một con trâu điên.", "eng": "That most dangerous of all beasts: a maddenned buffalo."}, {"viet": "Điều đó thực sự là đúng quá, tôi e là thế.", "eng": "That's only too true, I'm afraid."}, {"viet": "Lần đầu thử mà như vậy là được đấy.", "eng": "That was not bad for the first attempt."}, {"viet": "Điều chỉnh ước muốn của mình cho phù hợp với nguồn thu nhập.", "eng": "The accommodation of one's desires to one's income."}, {"viet": "Chương trình nghị sự cho cuộc họp là như sau.", "eng": "The agenda for the meeting is as follows."}, {"viet": "Thú được thả rông tự do trong công viên.", "eng": "The animals are allowed to wander at will in the park."}, {"viet": "Cuộc tranh cãi đã kết thúc bằng một trận đấm đá.", "eng": "The argument ended in a punch-up."}, {"viet": "Không khí trong văn phòng thật tự nhiên thoải mái.", "eng": "The atmosphere in the office is quite free and easy."}, {"viet": "Chữ b đã bị viết sai thành chữ d.", "eng": "The b had been wrongly written as a d."}, {"viet": "Ban nhạc đó biểu diễn thực là sôi nổi ở màn thứ nhì.", "eng": "The band was really smoking in the second set."}, {"viet": "Đài BBC dự định truyền hình tất cả các vở kịch của Shakespeare.", "eng": "The BBC plan to televise all Shakespeare's plays."}, {"viet": "Dự luật được thông qua với một phiếu chống.", "eng": "The bill was carried with one dissentient vote."}, {"viet": "Con thuyền rời bến chạy ra giữa sông.", "eng": "The boat pulled out into the middle of the river."}, {"viet": "Cuốn sách được chào đón như một kiệt tác.", "eng": "The book was hailed as a masterpiece."}, {"viet": "Bọn con trai trở về say bí tỉ và cha chúng quở mắng một trận nên thân.", "eng": "The boys came in annihilated and their father had plenty to say to them."}, {"viet": "Hai anh em cùng nhau làm việc.", "eng": "The brothers work in double harness."}, {"viet": "Chiếc xe buýt chạy rầm rập dọc con đường đá.", "eng": "The buses rattle along over the story road."}, {"viet": "Cái bề ngoài bóng loáng của chiếc xe đã làm tôi nghĩ lầm là nó mới hơn nó vốn có.", "eng": "The car's shiny appearance misled me into thinking it was never than it really was."}, {"viet": "Chiếc ô tô đỗ khi chiếc xe tải đâm vào nó.", "eng": "The car was stationary when he van hit."}, {"viet": "Đàn trâu bò chạy đổ xô về phía trang trại.", "eng": "The cattle stampeded towards the farm."}, {"viet": "Chương này có tựa đề'Tuổi thơ ấu của tôi'.", "eng": "The chapter was headed'My Early Life'."}, {"viet": "Đứa bé chọc vào quả bóng làm nó vỡ tung.", "eng": "The child pricked the balloon and it burst."}, {"viet": "Trẻ con bước vào thành từng cặp một.", "eng": "The children came in two by two."}, {"viet": "Bọn trẻ con há hốc mồm vì kích động.", "eng": "The children were an agape with excitement."}, {"viet": "Thành phố cũng là nơi đặt trụ sở của Liên Hiệp Quốc.", "eng": "The city is also a place where the headquarters of the United Nations is located."}, {"viet": "Quầy quần áo và đồ dệt kim ở tầng hai.", "eng": "The clothing and the knitwears counter is on the second floor."}, {"viet": "Chỉ sau hai lần giặt, màu đã phai rồi.", "eng": "The colour has faded after only two washes."}, {"viet": "Công ty này độc quyền cung cấp điện.", "eng": "The company had a monopoly in supplying eletricity."}, {"viet": "Máy vi tính đó đã được lập trình để tính mức lãi gộp về tất cả các lượng hàng bán ra.", "eng": "The computer has been programmed to calculate the gross profit margin on all sales."}, {"viet": "Hợp đồng được kí kết một cách chân thành.", "eng": "The contract was drawn up in good faith."}, {"viet": "Đất nước trở nên rất giàu khi phát hiện ra dầu lửa.", "eng": "The country became very rich following the discovery of oil."}, {"viet": "Những con bò cái đó cho rất nhiều sữa.", "eng": "The cows are producing a lot of milk."}, {"viet": "Đám đông tràn vào sân vận động.", "eng": "The crowd surged into the stadium."}, {"viet": "Cây thuỷ tiên hoa vàng thuộc giống'Thuỷ tiên'.", "eng": "The daffodil belongs to the genus'Narcissus'."}, {"viet": "Những chỗ lõm sâu vào của bờ biển Na Uy.", "eng": "The deep indentations of the Norwegian coastline."}, {"viet": "Việc biệt phái các đơn vị ra khỏi chủ lực.", "eng": "The detachment of units from the main force."}, {"viet": "Sự khám phá của Franklin chứng minh rằng chớp là điện.", "eng": "The discovery by Franklin that lightning is electricity."}, {"viet": "Bác sĩ đã cho bà ta vài viên thuốc để uống chữa ho.", "eng": "The doctor has given her some pills to take for her cough."}, {"viet": "Con chó đã ở trong một trận cắn nhau và rõ ràng là nó bị thua.", "eng": "The dog had been in a fight and had obviously got the worst of it."}, {"viet": "Những lời nói gây xúc động mạnh vốn là đặc trưng của luật sư.", "eng": "The dramatic speeches which are the hallmark of a barrister."}, {"viet": "Bản thảo xưa nhất của bài thơ này.", "eng": "The earliest extant manuscript of this poem."}, {"viet": "Con voi nghiền nát thức ăn bằng những cái răng hàm khoẻ của nó.", "eng": "The elephant grinds its food with its powerful molars."}, {"viet": "Toàn bộ hoạt động đó sẽ mất khoảng năm ngày.", "eng": "The entire operation will take about five days."}, {"viet": "Việc hành hình những đối thủ chính trị làm nhiều người kinh tởm chế độ.", "eng": "The execution of political opponents aroused widespread disgust with the regime."}, {"viet": "Cái nhà máy đó đã che lấp làm cho tôi không nhìn thấy ngọn núi.", "eng": "The factory spoilt my view of the mountain."}, {"viet": "Con ngựa được ưa thích nhất chẳng mấy chốc đã vượt xa những con khác trong cuộc đua.", "eng": "The favourite soon outdistanced the other horses in the race."}, {"viet": "Bộ phim giữ lại được nhiều hương vị phương xa của quyển sách.", "eng": "The film retains much of the book's exotic flavour."}, {"viet": "Xí nghiệp đã đạt doanh thu hàng năm là 75 triệu pao.", "eng": "The firm has an annual turnover of 75 million pounds."}, {"viet": "Điều đầu tiên phải học trong lớp học bơi là học nổi lên như người chết trôi.", "eng": "The first thing you'll learn in your swimming class is the dead man's float."}, {"viet": "Thức ăn trong nhà hàng này dở tệ!", "eng": "The food in this restaurant is the pits!"}, {"viet": "Tình trạng hay xảy ra đẻ non ở vùng này.", "eng": "The frequency of premature births in this region."}, {"viet": "Nhà để xe mở, vậy anh có thể lùi xe vào.", "eng": "The garage is open, so you can reverse in."}, {"viet": "Con hươu cao cổ nổi bật nhờ cái cổ rất dài của nó.", "eng": "The giraffe is characterized by its very long neck."}, {"viet": "Kế hoạch mới của chính phủ nhằm giúp đỡ những người không có việc làm.", "eng": "The government's new scheme is designed to help the jobless."}, {"viet": "Chính phủ đang thảo luận về luật giáo dục.", "eng": "The government is debating the education laws."}, {"viet": "Vị Thống đốc vui lòng chấp thuận lời mời này.", "eng": "The Governor is pleased to accept the invitation."}, {"viet": "Vùng đất trong dinh tổng thống được những người lính mang theo chó đi tuần tra.", "eng": "The grounds of the presidential palace are patrolled by soldiers with dogs."}, {"viet": "Vận động viên thể dục giơ ngang hai cánh tay.", "eng": "The gymnast extended her arms horizontally."}, {"viet": "Chiếc trực thăng thả dây tời kẻo người sống sót lên chỗ an toàn.", "eng": "The helicopter winched the survivor up to safety."}, {"viet": "Con ngựa quất đuôi giận dữ.", "eng": "The horse whisked its tail angrily."}, {"viet": "Căn nhà này có chỗ cho 20 con ngựa.", "eng": "The house has stabling for 20 horses."}, {"viet": "Những thợ săn mất hút con mồi của họ ở trong rừng.", "eng": "The hunters lost sight of their quarry in the forest."}, {"viet": "Sự tăng thuế có nghĩa là mỗi tháng chúng ta sẽ mất đi 30 bảng Anh.", "eng": "The increase in taxes means that we'll be £ 30 a month worse."}, {"viet": "Giá trị trừu tượng của một danh tiếng.", "eng": "The intangible value of a good reputation."}, {"viet": "Công việc này cho anh cơ hội để phát triển tài năng âm nhạc của mình.", "eng": "The job gives scope for your musical abilities."}, {"viet": "Phán quyết của ban hội thẩm bất lợi cho anh ta.", "eng": "The jury's verdict went against him."}, {"viet": "Con cừu non bị đàn quạ mổ.", "eng": "The lamb had been pecked by crows."}, {"viet": "Luật ghi rõ là điều đó hoàn toàn hợp pháp.", "eng": "The law says that this is quite legitimate."}, {"viet": "Những lá thư được kẹp lại bằng cái kẹp giấy.", "eng": "The letters were held together with a paper clip."}, {"viet": "Hội đồng địa phương đảm nhiệm việc sửa chữa đường sá.", "eng": "The local council are in charge of repairing roads."}, {"viet": "Ánh rực sáng của nhà kho đang bốc cháy.", "eng": "The lurid grow of the blazing warehouse."}, {"viet": "Quần chúng chống đối ý kiến này.", "eng": "The man in the street is opposed to this idea."}, {"viet": "Trận đấu được hoãn lại đến thứ bảy sau vì thời tiết xấu.", "eng": "The match was postponed to the following Saturday because of bad weather."}, {"viet": "Cuộc họp đó được sắp xếp tuyệt đối bí mật.", "eng": "The meeting was arranged with the utmost secrecy."}, {"viet": "Cách xử lý khéo léo của vị bộ trưởng về vụ khủng hoảng.", "eng": "The minister's adroit handling of the crisis."}, {"viet": "Tiền đã được thu lại nhờ bán vé xổ số.", "eng": "The money was raised by the sale of raffle tickets."}, {"viet": "Núi nổi bật trên toàn bộ phong cảnh.", "eng": "The mountain dominated the whole landscape."}, {"viet": "Con đường nhỏ đi theo đường chữ chi lên bờ đá.", "eng": "The narrow path zigzags up the cliff."}, {"viet": "Lần xuất bản mới gồm mười trang phụ lục.", "eng": "The new edition includes a ten-page addendum."}, {"viet": "Nhờ có con đường mới mọi người khỏi phải lái xe qua thị trấn nữa.", "eng": "The new road obviates the need to drive through the town."}, {"viet": "Tờ báo đó rõ ràng là thiên vị thiện ý của chính phủ.", "eng": "The newspaper is clearly biassed in the government's favour."}, {"viet": "Quyển tiểu thuyết đó triển khai theo cách truyền thống.", "eng": "The novel develops along traditional lines."}, {"viet": "Những kẻ phạm tội sẽ bị trừng trị một cách nghiêm khắc.", "eng": "The offenders will be severely disciplined."}, {"viet": "Ông lão chống một cây gậy gỗ dài.", "eng": "The old man leant on a long wooden staff."}, {"viet": "Phe đối lập dọa sẽ tiến hành một cuộc biểu quyết về kiến nghị đó.", "eng": "The opposition threatened to force a division on the motion."}, {"viet": "Sơn đó được bán dưới dạng bột.", "eng": "The paint is sold in powdered form."}, {"viet": "Cuộc liên hoan là một thất bại hoàn toàn bởi vì trên các thiếp mời đã ghi sai ngày tháng.", "eng": "The party was a total fiasco because the wrong date was given on the invitations."}, {"viet": "Sự minh mẫn của những năng lực sắc sảo của bà ta.", "eng": "The penetration of her powers of penetration."}, {"viet": "Nền tảng triết học của phương pháp sư phạm.", "eng": "The philosophical underpinnings of educational methods."}, {"viet": "Hệ thống ống nước cần được tân trang.", "eng": "The piping will need to be renewed."}, {"viet": "Các tua cây cuộn lấy chiếc cọc.", "eng": "The plant's tendrils curled up the stick."}, {"viet": "Cảnh ngộ của những người tị nạn thật sự làm tôi đau lòng.", "eng": "The plight of the refugees really wrung of my heart."}, {"viet": "Viên cảnh sát đã tìm thấy một xác chết dưới đáy hồ.", "eng": "The police found a body at the bottom of the lake."}, {"viet": "Cảnh sát cho rằng đứa bé đã bị bắt cóc.", "eng": "The police think the boy has been abducted."}, {"viet": "Dân số trong vùng này đã tăng gấp bốn lần.", "eng": "The population in this area has increased fourfold."}, {"viet": "Chính quyền, chính phủ, hội đồng, v. v. hiện nay.", "eng": "The present administration, government, council, etc."}, {"viet": "Báo chí không gây sự chú ý đối với cuộc bầu cử và coi nhẹ ý nghĩa của nó.", "eng": "The press gave the election no publicity and belittled its significance."}, {"viet": "Hoàng tử cải trang thành một nông dân.", "eng": "The prince masqueraded as a peasant."}, {"viet": "Thủ tục hoàn toàn không phức tạp.", "eng": "The procedure is quite straightforward."}, {"viet": "Sân bay mới được đề nghị bị nhân dân địa phương phản đối kịch liệt.", "eng": "The proposed new airport will be strongly opposed by the local residents."}, {"viet": "Câu đó quá khó đến nỗi mà không ai có thể giải được.", "eng": "The puzzle was so hard that no one could solve it."}, {"viet": "Tuyến đường xe lửa đó phải ngưng chạy vì một vụ lún.", "eng": "The railway line closed because of a subsidence."}, {"viet": "Nỗi lo lắng mới đây của quần chúng bây giờ đã có thể bớt đi.", "eng": "The recent public anxiety about this issue may now be abating."}, {"viet": "Bài báo cáo đã vẽ lên một bức tranh ảm đạm về tính không hiệu quả và nạn tham nhũng.", "eng": "The report drew a grim picture of inefficiency and corruption."}, {"viet": "Sự liên kết những đảng viên Dân Chủ với những đảng viên Tự Do.", "eng": "The reunion of the Democrats with the Liberals."}, {"viet": "Con sông mà dòng nước bẩn của nó chảy vào bến cảng.", "eng": "The river whose dirty water disembogues into the harbor."}, {"viet": "Căn phòng được sưởi nóng bằng dầu.", "eng": "The room is heated by oil."}, {"viet": "Người Nga dự định đưa một vệ tinh vào quỹ đạo vòng quanh sao Hỏa.", "eng": "The Russians plan to put a satellite into orbit round Mars."}, {"viet": "Phong cảnh và trang phục trong vở opêra đó thật là tuyệt đẹp.", "eng": "The scenery and costumes for the opera are out of this world."}, {"viet": "Đoàn tìm kiếm tản ra khắp cả đồng hoang.", "eng": "The search party spread out over the moor."}, {"viet": "Dịch vụ trong nhà hàng này không nhanh lắm và thức ăn cũng không ngon lắm.", "eng": "The service in this restaurant is none too fast and the food is none too good either."}, {"viet": "Chiếc tàu bị mắc cạn trên bờ cát.", "eng": "The ship stuck fast on the bar."}, {"viet": "Cuộc biểu diễn sẽ đi khắp các tỉnh sau khi kết thúc ở London.", "eng": "The show will tour the provinces after it closes in London."}, {"viet": "Người trượt băng nhanh chóng lấy lại được thăng bằng.", "eng": "The skater quickly recovered his balance."}, {"viet": "Những người thuộc phe Xã hội đã thắng cử một cách dễ dàng.", "eng": "The Socialists are coasting to victory in the election."}, {"viet": "Tiếng kêu của những con mòng biển khiến cô nhớ lại những kỳ nghỉ hè thời thơ ấu trên bờ biển.", "eng": "The sound of seagulls carried her back to childhood holidays by the sea."}, {"viet": "Chỗ ẩn trú của tên gián điệp bị phát giác.", "eng": "The spy's cover was blown."}, {"viet": "Bầu không khí ngột ngạt của triều đình, với tất cả những luật lệ hạn chế nhỏ nhặt của nó.", "eng": "The stifling atmosphere of the royal court, with all its petty restrictive rules."}, {"viet": "Những người đình công gây tình trạng lộn xộn khi người quản lý gọi cảnh sát tới.", "eng": "The strikers raised a tumult, when the management called in the police."}, {"viet": "Mặt trời chiếu dữ dội từ bầu trời quang đãng.", "eng": "The sun glaring ( down ) mercilessly from a clear sky."}, {"viet": "Việc tăng thuế là một sự phản bội trắng trợn lời thề ngày bầu cử.", "eng": "The tax increases are a ruthless betrayal of election pledges."}, {"viet": "Đội đã ghi được chiến thắng thứ năm liên tiếp.", "eng": "The team has chalked up its fifth win in a row."}, {"viet": "Nhà hát rộng, chất lượng cách âm tốt.", "eng": "The theatre was large, with good acoustics."}, {"viet": "Đã muộn rồi, chúng ta phải đi thôi.", "eng": "The time's getting on, we ought to be going."}, {"viet": "Cửa hàng đồ chơi là chốn thần tiên của trẻ em.", "eng": "The toy-shop is a fairyland for young children."}, {"viet": "Các cây được trồng cách nhau 20 bộ.", "eng": "The trees were planted at 20 ft intervals."}, {"viet": "Hai nhà báo được sự ưu đãi của nhà lãnh đạo mới.", "eng": "The two journalists basked in the gratitude of the new rulers."}, {"viet": "Đại diện của công đoàn bị buộc tội là bù nhìn của ban giám đốc.", "eng": "The union representative was accused of being a puppet of the management."}, {"viet": "Chỉ riêng ý nghĩ đi ra nước ngoài đã làm anh ta vui thích.", "eng": "The very idea of going abroad delighted him."}, {"viet": "Bức tường được xây dựng rất chắc chắn.", "eng": "The wall is of very solid construction."}, {"viet": "Chi phí cả tuần của chúng tôi là hơn 500 pao nhưng đó là kể cả các bài học về trượt tuyết.", "eng": "The week cost us over 500 pounds but that was with skiing lessons."}, {"viet": "Gió cứ làm chiếc khăn quàng bay phần phật vào mặt anh ta.", "eng": "The wind kept flapping his scarf on his face."}, {"viet": "Những từ czar và kaiser đều do từ caesar mà ra cả.", "eng": "The words czar and kaiser both came from the word caesar."}, {"viet": "Đôi vợ chồng trẻ mua dụng cụ làm bếp mới nhất.", "eng": "The young couple bought the latest cooking utensil."}, {"viet": "Hoa của chúng lúc đầu có màu trắng, nhưng chẳng bao lâu sau trở thành màu đỏ.", "eng": "Their flowers are white at first but soon turn red."}, {"viet": "Những câu chuyện của chúng đều là một phần quan trọng của câu chuyện kể về nền văn minh.", "eng": "Their story is an important part of the story of civilization."}, {"viet": "Khi đó bạn sẽ hoàn toàn tự do.", "eng": "Then you'll have all the freedom you want."}, {"viet": "Bản chất anh ta mang tính độc ác.", "eng": "There's a vein of cruelty in his nature."}, {"viet": "Kêu ca cũng chẳng ích gì nhiều, họ không bao giờ lưu ý cả.", "eng": "There's not much point in complaining, they never take any notice."}, {"viet": "Trong ngành xuất bản có ít chỗ cần những người mới tốt nghiệp.", "eng": "There are few openings in publishing for new graduates."}, {"viet": "Có quá nhiều điểm không đúng trong bản báo cáo này đến mức nó cần phải được viết lại.", "eng": "There are so many inaccuracies in this report that it will have to be written again."}, {"viet": "Chưa hề có tuyên bố chính thức nào về tình trạng sức khoẻ của tổng thống.", "eng": "There has been no official pronouncement yet on the state of the president's health."}, {"viet": "Có sự tương phản rõ rệt giữa cuộc sống của những người nghèo nhất và giàu nhất trong xã hội.", "eng": "There is a sharp contrast between the lives of the poorest and the richest members of society."}, {"viet": "Hiện nay người ta rất lo ngại cho sự an toàn của họ.", "eng": "There is now considerable concern for their safety."}, {"viet": "Có tiếng côm cốp khi anh ta cắn quả táo.", "eng": "There was a crunch as he bit the apple."}, {"viet": "Không có thang máy và chúng tôi đã phải leo sáu đợt cầu thang.", "eng": "There was no lift and we had to climb six flights of stairs."}, {"viet": "Có vài người chơi ở ngoài phố.", "eng": "There were some people playing outside in the street."}, {"viet": "Những sự phát triển này đã tạo ra một nhu cầu lớn.", "eng": "These developments have created a great demand at the moment."}, {"viet": "Những phát triển chính trị này phải được xem trong bối cảnh sự căng thẳng Đông Tây đang tăng lên.", "eng": "These political developments should be seen against a background of increasing East-West tension."}, {"viet": "Ngoài đời họ là vợ chồng đấy, nhưng chẳng bao lâu nữa họ sẽ ly dị.", "eng": "They're married in real life, but they're going to get a divorce soon."}, {"viet": "Theo ý tôi, họ để cho con cái họ tự do quá, lẽ ra họ phải nghiêm khắc hơn.", "eng": "They allow their children too much latitude, in my view, they should be stricter."}, {"viet": "Chúng đặc biệt thích nghi với cuộc sống ở những vùng khan hiếm thức ăn và nước.", "eng": "They are wonderfully fitted for life in regions where food and water are scarce."}, {"viet": "Họ chạm ly lanh canh và uống chúc nhau sức khoẻ.", "eng": "They clinked glasses and drank each other's health."}, {"viet": "Ai lại gọi là \"khiêu dâm\".", "eng": "They don't call it \"pornographic\"."}, {"viet": "Họ đã cười chế giễu Sam.", "eng": "They had a good laugh at Sam's expense."}, {"viet": "Họ dũng cảm chống đỡ các cuộc pháo kích liên tiếp của kẻ thù.", "eng": "They held out bravely against repeated enemy bombing."}, {"viet": "Họ cố gắng bám giữ cho đến khi tiếp viện tới.", "eng": "They managed to hold on until help arrived."}, {"viet": "Họ có tài sản khắp nơi trên thế giới.", "eng": "They possess properly an over the world."}, {"viet": "Họ nói rằng bạn phải luôn luôn giữ nước đóng chai ở khắp nhà.", "eng": "They say you should always keep bottled water around the house."}, {"viet": "Họ thề sẽ trả thù bọn bắt cóc.", "eng": "They swore to take their revenge on the kidnappers."}, {"viet": "Tất cả họ đều càu nhàu về việc công ty từ chối tăng lương cho họ.", "eng": "They were all grumbling about the company's refusal to increase their pay."}, {"viet": "Họ ngồi ưỡn người vươn vai trước lò sưởi.", "eng": "They were sprawled out in front of the fire."}, {"viet": "Tai nạn này chứng tỏ sự cần thiết phải có những điều luật an toàn chặt chẽ hơn.", "eng": "This accident shows the need for stricter safety regulation."}, {"viet": "Toà nhà thờ này là một mẫu hình đẹp của kiến trúc Norman.", "eng": "This church is a fine example of Norman architecture."}, {"viet": "Cuốn từ điển bách khoa này thật sự là một bản tóm tắt đầy đủ kiến thức.", "eng": "This encyclopedia is truly a compendium of knowledge."}, {"viet": "Đây là sự lai ghép hai giống xoài lạ.", "eng": "This is a graft of two uncommon varieties of mangoes."}, {"viet": "Đây là ngày chủ nhật thứ ba liên tục trời mưa.", "eng": "This is the third Sunday in a row that it's rained."}, {"viet": "Nhạc này nghe rất dễ chịu vào lúc đêm khuya.", "eng": "This music's easy on the ear late at night."}, {"viet": "Chính sách này sẽ làm cho giá sinh hoạt thêm cao.", "eng": "This policy will put pounds on the cost of living."}, {"viet": "Loài hoa này nở rộ trong khí hậu ấm.", "eng": "This species of flower flourishes in a warm climate."}, {"viet": "Đây có phải là chỗ chúng ta rẽ đường đi Hull không?", "eng": "This where the road turns off for Hull?"}, {"viet": "Ba ngày đến đó và ba ngày đi về.", "eng": "Three days getting there and three days back."}, {"viet": "Ngày mai chúng ta sẽ đi thăm một số hang động nổi tiếng, ở đó anh có thể thấy thạch nhũ, mầm đá, màn và hoa đá lộng lẫy.", "eng": "Tomorrow we shall go and visit some of the famous caves in which you can see splendid stalactites, stalagmites, stone curtains and flowers."}, {"viet": "Trừ khi có điều gì bất thường xảy ra, tôi sẽ gặp anh tuần tới.", "eng": "Unless something unexpected happens, I'll see you next week."}, {"viet": "Đi rửa tay đi không thì em sẽ bôi bẩn lên giấy đấy.", "eng": "Wash your hands or you'll make smudges on the writing paper."}, {"viet": "Chúng ta chỉ cần kiên nhẫn và rút nó ra từng chút một.", "eng": "We'll just have to be patient and work it out little by little."}, {"viet": "Chúng tôi đang cạnh tranh với nhiều công ty về bản hợp đồng này.", "eng": "We're in competition with several other companies for the contract."}, {"viet": "Chúng tôi đã quyết định thương lượng với giới chủ về yêu sách tiền lương của chúng tôi.", "eng": "We've decided to negotiate with the employers about our wage claim."}, {"viet": "Tất cả chúng tôi đã thoả thuận với nhau về những mục tiêu cơ bản, nhưng khi động đến các chi tiết thì vấn đề trở nên phức tạp hơn.", "eng": "We all agreed on our basic aims, but when we got down to specifics it became more complicated."}, {"viet": "Chúng tôi không có kế hoạch mua một số lượng lớn như vậy của một công ty trong một lần.", "eng": "We are not planning to buy a large quantity from one company at a time."}, {"viet": "Chúng tôi xây dựng thêm phần cơi nới ở trường vì thế chúng tôi có thêm hai lớp học.", "eng": "We built an extension onto the school, so now we have two more classrooms."}, {"viet": "Chúng tôi có thể ở đây chừng nào nguồn dự trữ của chúng tôi vẫn còn.", "eng": "We can stay here for as long as our supplies hold out."}, {"viet": "Chúng tôi yêu cầu có một cuộc điều tra không thiên vị về cách xử lý sự việc đó của chính phủ.", "eng": "We demand an independent inquiry into the government's handling of the affair."}, {"viet": "Tính trung bình mỗi năm chúng tôi bị trượt một sinh viên.", "eng": "We fail one student per year on average."}, {"viet": "Học kỳ trước chúng tôi có mời bà ấy đến đây giảng bài.", "eng": "We had her up here last term to give a lecture."}, {"viet": "Chúng tôi đã giao dịch với Ngân hàng đó trong nhiều năm.", "eng": "We have dealt with that bank for many years."}, {"viet": "Chúng tôi không có nhiều tiền như gia đình nhà Brown.", "eng": "We haven't got as much money as the Browns."}, {"viet": "Chúng tôi sống ở Scốtlen từ 1960 tới 1973.", "eng": "We lived in Scotland from 1960 to 1973."}, {"viet": "Chúng ta phải tính đến tình cảm của những người khác.", "eng": "We must consider the feelings of other people."}, {"viet": "Chúng tôi cần trồng cây cối cho góc vườn này.", "eng": "We need some ground cover for that corner of the garden."}, {"viet": "Chúng tôi đến Delhi lúc 14: 00 giờ theo giờ địa phương.", "eng": "We reach Delhi at 14: 00 hours local time."}, {"viet": "Chúng ta phải luôn có một cái đèn pin để phòng hờ.", "eng": "We should always have a flashlight just in case."}, {"viet": "Chúng tôi lặn lội bao nhiêu dặm đường mà không tìm được chỗ nào để nghỉ lại.", "eng": "We tramped ( for ) miles and miles without finding anywhere to stay."}, {"viet": "Tất cả chúng tôi hoàn toàn rụng rời khi nghe tin sét đánh đó.", "eng": "We were all absolutely pole-axed by the terrible news."}, {"viet": "Chúng tôi bị áp lực ghê gớm.", "eng": "We were under a terrific amount of pressure."}, {"viet": "Xem xét kỹ những hậu quả của một hành động.", "eng": "Weigh ( up ) the consequences of an action."}, {"viet": "À, chính Napoleon đã khởi công xây dựng nhưng mãi đến mười lăm năm sau khi ông ta mất thì người ta mới xây nó xong.", "eng": "Well, it was Napoleon who started building it but the arch was not completed until fifteen years after his death."}, {"viet": "Nếu cảnh sát vào thấy cậu đang cưa chấn song xà lim thì cậu sẽ làm thế nào?", "eng": "What'll you do if the arms come in while you're sawing the bars of your cell?"}, {"viet": "Một vài lễ hội quan trọng ở đất nước bạn là gì?", "eng": "What are some important festivals in your country?"}, {"viet": "Nó đã làm gì để đối phó lại sự thách thức của anh?", "eng": "What did he do in reply to your challenge?"}, {"viet": "Chúng ta đần độn làm sao nên mới không thấy cái bẫy đó!", "eng": "What fools we were not to see the trap!"}, {"viet": "Nhãn hiệu bia được yêu thích ở Mỹ là gì?", "eng": "What is the most popular brand of beer in the United States?"}, {"viet": "Bạn đang dự định trò lừa nào cho ngày cá tháng tư vậy?", "eng": "What kind of tricks are you planning for April Fool's Day?"}, {"viet": "Những cái máy này cần nhiên liệu nào?", "eng": "What sort of fuel do these machines need?"}, {"viet": "Bất kể anh nói gì, cô ta cũng sẽ luôn luôn làm theo ý mình.", "eng": "Whatever you suggest, she will always go her own way."}, {"viet": "Khi anh ta bắt đầu cởi quần áo trước công chúng, tôi thẹn thùng chẳng biết nhìn đi đâu.", "eng": "When he started undressing in public I didn't know where to look."}, {"viet": "Khi lập kế hoạch, nên chú ý tới khả năng thay đổi về tình hình tài chính.", "eng": "When planning ahead, be aware of the possibility of changed circumstances."}, {"viet": "Khi họ phải chọn giữa chất lượng và giá cả, thường thường chất lượng tụt xuống hàng thứ hai.", "eng": "When they have to choose between quality and price, quality usually comes off second-best."}, {"viet": "Các bạn sẽ nghỉ ở đâu?,?", "eng": "Where are you going on holiday?"}, {"viet": "Trong hai anh em, anh gặp ai, người anh hay người em?", "eng": "Which brother did you see, the elder or the younger?"}, {"viet": "Sau đây chúng ta sẽ nghe tiếp băng nào nhỉ?", "eng": "Which tape shall be listened to next?"}, {"viet": "Ai nắm quyền lực tối cao trong nước?", "eng": "Who holds sovereign power in the state?"}, {"viet": "Sao anh đi kiếm dụng cụ và chúng ta sẽ thử xem.", "eng": "Why do not you go and fetch the tools and we'll give it a bash."}, {"viet": "Bến Wigan, đã trở thành bất tử trong cuốn sách Con đường tới bến Wigan của George Orwell.", "eng": "Wigan pier, as immortalized in George Orwell's book The Road to Wigan Pier."}, {"viet": "Xin anh vui lòng đi cất những cuốn sách này vào túi xách của tôi nhé?", "eng": "Will you please go pack these books in my bag?"}, {"viet": "Đội Anh dẫn đầu với tỉ số 3-0, kết quả chắc là Anh thắng.", "eng": "With English leading 3-0, the probable result is an England victory."}, {"viet": "Công nhân đang xung đột với ban giám đốc về tình trạng dư thừa nhân lực.", "eng": "Workers are in dispute with management about the redundancies."}, {"viet": "Cháu có muốn ăn thêm thịt không?", "eng": "Would you like some more meat?"}, {"viet": "Xin ông vui lòng để túi sách của tôi lên ngăn hành lý trên đầu giúp tôi nhé?", "eng": "Would you please put my bag in the overhead bin for me?"}, {"viet": "Phải, còn cô là cô Moore phải không?", "eng": "Yes, and you're Miss Moore?"}, {"viet": "Vâng, nhưng tôi sẽ kiểm tra xem họ có giá vé tham quan đặc biệt hay không.", "eng": "Yes, they are but I'll have to check to see if they have special excursion fares."}, {"viet": "Bạn sẽ phải theo đúng quyết định của trọng tài.", "eng": "You'll have to abide by the referee's decision."}, {"viet": "Anh không đóng góp nhiều trong cuộc nói chuyện này.", "eng": "You're not taking much share in the conversation."}, {"viet": "Ông ở phòng 805, đúng không?", "eng": "You are in Room 805, right?"}, {"viet": "Các anh không thể khám nhà tôi nếu không có lệnh.", "eng": "You can't search my house without a warrant."}, {"viet": "Anh có thể trả bằng tiền mặt hay séc: thế nào cũng được.", "eng": "You can pay by cash or cheque: it comes to the same thing."}, {"viet": "Anh không thật sự nhìn thấy, đó chỉ là sự tưởng tượng của anh thôi.", "eng": "You didn't really see it, it was just your imagination."}, {"viet": "Hiện bạn đang ở tại địa điểm thứ hai trong chương trình đi.", "eng": "You have the second spot on the program."}, {"viet": "Anh đã gây được ấn tượng thuận lợi đối với các giám khảo.", "eng": "You made a favourable impression on the examiners."}, {"viet": "Anh phải hiểu rằng anh không thể đối xử với mọi người như đầy tớ.", "eng": "You must learn that you can't treat people like servants."}, {"viet": "Anh nên hút ít thuốc lá hơn và uống ít bia hơn.", "eng": "You ought to smoke fewer cigarettes and drink less beer."}, {"viet": "Cậu nên xem Carl Smith chạy 100 mét, anh ta nhanh như cắt.", "eng": "You should see Carl Smith run the 100 metres, he's like greased lightning."}, {"viet": "Ông là một ông lão đáng yêu.", "eng": "You were a nice old man."}, {"viet": "Những người trẻ tuổi muốn sống độc lập với bố mẹ.", "eng": "Young people who want independence from their parents."}, {"viet": "Lời đề nghị cho vay của anh ngay lúc này thật đáng hoan nghênh.", "eng": "Your offer of a loan is extremely welcome just now."}]