[{"viet": "Phải là 50 bảng Anh mới vừa đủ.", "eng": "£ 50 should be enough to be going on with."}, {"viet": "Một chùm củ cải hoặc một miếng sô-cô-la đối với bà thực sự là một bữa ăn sang trọng.", "eng": "A bunch of radishes or a bit of chocolate was a real treat."}, {"viet": "Một gánh xiếc đôi khi biểu diễn kết thúc bằng một màn đua xe ngựa.", "eng": "A circus sometimes ends with a chariot race."}, {"viet": "Một vụ bổ nhiệm hội đồng do thống đốc thực hiện.", "eng": "A councilor appointment made by the governor."}, {"viet": "Sự trình bày những chức năng của máy vi tính.", "eng": "A demonstration of the computer's functions."}, {"viet": "Một con đê được xây lên để ngăn lụt.", "eng": "A dyke was built to retain the floods."}, {"viet": "Một xe chữa cháy chạy qua hú còi ầm ĩ.", "eng": "A fire-engine racing along with its sirens wailing."}, {"viet": "Một thiếu nữ đang độ xuân thì, tuổi hai mươi.", "eng": "A girl in her teens or early twenties."}, {"viet": "Một vị khách yêu cầu thứ không có sẵn ở quán rượu.", "eng": "A guest asks for something which is unavailable."}, {"viet": "Một nhà tế bần dành cho những người bệnh hấp hối.", "eng": "A hospice for the terminally ill."}, {"viet": "Một phong cảnh mất vẻ đẹp vì một nhà máy điện án ngữ.", "eng": "A landscape disfigured by a power station."}, {"viet": "Một nhà phê bình văn học không nên quá chủ quan trong phương pháp của anh ta.", "eng": "A literary critic should not be too subjective in his approach."}, {"viet": "Người đàn ông mà bị lòng ghen thúc đẩy thì có thể làm bất cứ điều gì.", "eng": "A man driven by jealousy is capable of anything."}, {"viet": "Một người lạm dụng thiết bị điền kinh của nhà trường.", "eng": "A misuser of school athletic equipment."}, {"viet": "Một đối thủ mới cho chức vô địch.", "eng": "A new rival for the title of champion."}, {"viet": "Có thấy một tốp quân địch trên các ngọn đồi.", "eng": "A party of hostiles was seen in the hills."}, {"viet": "Đồ gốm chỉ được nung sau khi đã được tráng men.", "eng": "A piece of pottery must be fired after it has been coated with a glaze."}, {"viet": "Một kỷ vật quí giá của thời hạnh phúc.", "eng": "A precious memento of happier times."}, {"viet": "Một tiếng thét lạc lõng vang lên từ đám đông nhỏ.", "eng": "A ragged shout went up from the small crowd."}, {"viet": "Cục đá là vật vô tri vô giác.", "eng": "A rock is an inanimate object."}, {"viet": "Một đồng sự thâm niên trong một công ty cố vấn pháp luật.", "eng": "A senior partner in a firm of solicitors."}, {"viet": "Một màn kịch vui ngắn về ca mổ của một bác sĩ.", "eng": "A sketch set in a doctor's surgery."}, {"viet": "Một giá đặc biệt gồm cả năm bảng Anh bưu phí.", "eng": "A special offer at a post-free price of £ 5."}, {"viet": "Một phong cách có đặc trưng chính xác và dí dỏm.", "eng": "A style marked by precision and wit."}, {"viet": "Một văn bản sắp đặt với lề bên phải không thẳng đều.", "eng": "A text set with a ragged right margin."}, {"viet": "Một nhân viên giặt quần áo đến đây để thu gom quần áo cần giặt ủi.", "eng": "A valet is here to collect the laundry."}, {"viet": "Rất nhiều mẫu mã để chọn.", "eng": "A wide variety of patterns to choose from."}, {"viet": "Theo các quy định của khách sạn chúng tôi, ông sẽ phải bồi thường hư hỏng này.", "eng": "According to our regulations you'll have to pay for the damage."}, {"viet": "Tuổi dậy thì là giai đoạn phát triển từ tuổi ấu thơ tới tuổi trưởng thành.", "eng": "Adolescence is the period of progression from childhood to adulthood."}, {"viet": "Sau khi phải chờ cả một giờ đồng hồ, người khách hàng giận sùi bọt mép.", "eng": "After having to wait an hour the customer was foaming at the mouth with rage."}, {"viet": "Sau cuộc cãi nhau cô ta đùng đùng bỏ đi.", "eng": "After the argument she stormed off."}, {"viet": "Không khí đi vào phổi qua mũi, cổ họng, khí quản và cuống phổi.", "eng": "Air comes into them through the nose, throat, windpipe, and the bronchial tubes."}, {"viet": "Tất cả hy vọng của chúng tôi đã bị tiêu tan vì lời công bố đó.", "eng": "All our hopes were dashed by the announcement."}, {"viet": "Tất cả số sách này cần được xếp vào trong các thùng.", "eng": "All these books need to be packed into boxes."}, {"viet": "Từ những nhận xét của anh liệu tôi có thể suy ra rằng anh nghĩ tôi không nói sự thật phải không?", "eng": "Am I to infer from your remarks that you think I'm not telling the truth?"}, {"viet": "Sắp có một thông báo về việc cắt giảm thêm kinh phí của chính phủ.", "eng": "An announcement of further cuts in government expenditure is imminent."}, {"viet": "Một sự kiện làm thay đổi tiến trình lịch sử.", "eng": "An event which changed the course of history."}, {"viet": "Sự ngắt lời làm tôi quên hẳn điều đó.", "eng": "An interruption put it out of my head."}, {"viet": "Một sự rạn nứt ngăn cách giữa hai phía trong cuộc tranh chấp không thể thu hẹp lại được.", "eng": "An unbridgeable gap between the two sides in the dispute."}, {"viet": "Khi nào da vịt trở nên giòn và nâu vàng thì vịt đã được quay xong.", "eng": "And when the skin turns crisp and golden brown, the duck is done."}, {"viet": "Bất cứ ai mà thiếu tính kiên quyết thì không nên làm lãnh đạo.", "eng": "Anyone who lacks decision shouldn't be a leader."}, {"viet": "Có thư nào gửi cho tôi không?", "eng": "Are there any letters for me?"}, {"viet": "Bạn sẽ đi nghe buổi hoà nhạc của ban nhạc Rolling Stones chứ?", "eng": "Are you going to the Rolling Stones concert?"}, {"viet": "Những đội quân tập trung về thủ đô.", "eng": "Armies converging on the capital city."}, {"viet": "Như tôi đã nghĩ, bạn có ở đây.", "eng": "As I expected, you are here."}, {"viet": "Hãy hỏi ông ta về cái nhẫn anh đánh mất-ông ta có thể đã tìm thấy nó.", "eng": "Ask him about the ring you lost-he may have found it."}, {"viet": "Ngay lúc đó Tom mở cửa.", "eng": "At that very minute, Tom opened the door."}, {"viet": "Các phần thưởng dành cho những người đạt thành tựu xuất sắc trong đời sống xã hội.", "eng": "Awards for those who achieve pre-eminence in public life."}, {"viet": "Bị bắt gặp khi nhìn trộm qua lỗ khóa.", "eng": "Be caught peeping through the keyhole."}, {"viet": "Gánh lấy hoàn toàn trách nhiệm về những hậu quả.", "eng": "Bear full responsibility for the consequences."}, {"viet": "Than vãn vì thiếu ngân quỹ nghiên cứu.", "eng": "Bemoan the shortage of funds for research."}, {"viet": "Bầu trời xanh chưa chắc là điều bảo đảm thời tiết sẽ tiếp tục tốt.", "eng": "Blue skies are not a guarantee of continuing fine weather."}, {"viet": "Anh Quốc đã liên minh với các thế lực phương Tây về thương mại và quốc phòng.", "eng": "Britain has allied itself with other western powers for trade and defense."}, {"viet": "Nhưng làm cách nào mà đạo Lạt ma tìm được đến đường Bắc Kinh vậy?", "eng": "But how did Lamaism find its way to Beijing?"}, {"viet": "Nhưng vị của nó thì rất tuyệt vời.", "eng": "But the taste is out of this world."}, {"viet": "Theo ba đếm thì con đã ăn năm cái bánh rồi.", "eng": "By my count, that's five cakes you've had already."}, {"viet": "Tôi có thể giúp gì cho ông không?", "eng": "Can I be of any help to you?"}, {"viet": "Hai định nghĩa này có thể hợp thành một, hay chúng phải để riêng ra?", "eng": "Can these two definitions be conflated, or must they be kept separate?"}, {"viet": "Bạn trông giùm chiếc xe đạp của tôi nhé?", "eng": "Can you keep an eye on my bike?"}, {"viet": "Ông có thể cho tôi biết ông đã mua chúng ở đâu và mua vào ngày tháng nào không?", "eng": "Can you tell me where you purchased them and the date they were purchased?"}, {"viet": "Gây chia rẽ giữa hai người bạn cũ.", "eng": "Cause an estrangement between two old friends."}, {"viet": "Trẻ con không nên để chơi đùa mà không có ai trông nom.", "eng": "Children should not be left to play without supervision."}, {"viet": "Những đám mây hình thù khác nhau trên bầu trời.", "eng": "Clouds of different shapes in the sky."}, {"viet": "Những người đi làm hằng ngày bằng xe buýt ùa vào trạm.", "eng": "Commuters were pouring into the station."}, {"viet": "Cứ xét tới việc anh ấy chỉ vừa bắt đầu làm thì anh ấy quả là biết nhiều về công việc đó.", "eng": "Considering he's only just started, he knows quite a lot about it."}, {"viet": "Xin anh vui lòng tìm cho chúng tôi một bàn dành cho hai người?", "eng": "Could you find us a table for two, please?"}, {"viet": "Các con đường ở nông thôn thường không đi được vào mùa đông.", "eng": "Country lanes that are often impassable in winter."}, {"viet": "Bố nó ơi, anh không thể đi đến Disneyland với số tiền đó đâu.", "eng": "Daddy, you can't go to Disneyland with that amount."}, {"viet": "Chính thể dân chủ dần dần thay thế chế độ quân chủ độc đoán.", "eng": "Democratic government gradually took the place of an all-powerful monarchy."}, {"viet": "Dần dần phát tức khi phải chờ cả ba tiếng đồng hồ trong phòng mạch của bác sĩ.", "eng": "Did a slow burn while waiting three hours in the doctor's office."}, {"viet": "Bạn có dừng lại ở thác Lili để chụp ảnh không?", "eng": "Did you stop at the Lili Fall for some pictures?"}, {"viet": "Có mẫu mã nào hấp dẫn bạn không?", "eng": "Do any of these designs attract you?"}, {"viet": "Hãy làm những gì mà anh cho là đúng.", "eng": "Do what is right in your own sight."}, {"viet": "Gia đình bạn có đông người không?", "eng": "Do you have a large family?"}, {"viet": "Anh có biết ai khác thích anh ta không?", "eng": "Do you know anyone else who likes him?"}, {"viet": "Bạn có thường đến trạm y tế không?", "eng": "Do you often go to a health clinic?"}, {"viet": "Bạn có nghĩ rằng thế vận hội Sydney đã thành công không?", "eng": "Do you think that the Sydney Olympics were successful?"}, {"viet": "Trên đó có nhãn ghi tên ông không?", "eng": "Does it have a tag with your name on it?"}, {"viet": "Đừng có quá thiếu tự tin như thế về tài năng của anh.", "eng": "Don't be so diffident about your talents."}, {"viet": "Đừng có mà đánh lộn với hắn; hắn đánh rất hung ác đấy.", "eng": "Don't get into a fight with him; he can really dish it out."}, {"viet": "Đừng phóng đại quá trường hợp của anh hoặc nếu không sẽ chẳng có ai tin anh đâu.", "eng": "Don't overstate your case or no one will believe you."}, {"viet": "Đừng có cố chống lại cái hệ thống đó nữa.", "eng": "Don't try to buck the system."}, {"viet": "Ăn mặc những thứ rẻ tiền và tầm thường.", "eng": "Dressed in cheap and vulgar finery."}, {"viet": "Mỗi đội đã ghi điểm hai lần và trận đấu đã kết thúc với tỉ số hòa.", "eng": "Each team scored twice and the game ended in a tie."}, {"viet": "Dân ca Anh được soạn bởi Percy Grainger.", "eng": "English folk song, arr Percy Grainger."}, {"viet": "Kể từ lúc tôi còn đi học.", "eng": "Ever since I was at school."}, {"viet": "Xin lỗi, nhưng số tiền này tính cho mục nào?", "eng": "Excuse me, but what's this charge?"}, {"viet": "Sự nghèo nàn cùng cực đã đẩy họ đến thái độ bàng quan hờ hững.", "eng": "Extreme poverty had reduced them to a state of apathy."}, {"viet": "Cảm thấy quan tâm đến ai hoặc điều gì.", "eng": "Feel an interest in somebody or something."}, {"viet": "Những bức tranh đẹp tô điểm cho mấy bức tường trong phòng.", "eng": "Fine paintings graced the walls of the room."}, {"viet": "Phong trào ủng hộ hòa bình và tình yêu của giới trẻ là sản phẩm của thập kỷ sáu mươi.", "eng": "Flower power was a product of the sixties."}, {"viet": "Đối với một số phụ nữ hôn nhân chỉ là một sự tù túng.", "eng": "For some women marriage is a trap."}, {"viet": "Các buổi chiều thứ Sáu được dành ra để ôn bài.", "eng": "Friday afternoons are left free for revision."}, {"viet": "Nói chung, tôi không thích thức ăn có nhiều gia vị.", "eng": "Generally speaking, I don't like spicy food."}, {"viet": "Trìu mến vuốt mái tóc của nàng.", "eng": "Give her hair an affectionate stroke."}, {"viet": "Cút đi, tôi không thích bị nhìn dâm dật như vậy.", "eng": "Go away, I don't enjoy being leered at."}, {"viet": "Kiếm một chỗ ngồi đi và cứ tự nhiên như ở nhà!", "eng": "Grab a seat and make yourself at home!"}, {"viet": "Trên tường có treo một tranh khắc axit một nhà thờ thật đẹp.", "eng": "Hanging on the wall was a fine etching of a church."}, {"viet": "Anh có lời bình luận nào về những diễn biến gần đây không?", "eng": "Have you any comments to make on recent developments?"}, {"viet": "Anh đã quên số tiền mà tôi cho anh vay tuần trước rồi à?", "eng": "Have you forgotten about that money I lent you last week?"}, {"viet": "Đến chừng này rồi anh còn muốn tiếp tục nữa không?", "eng": "Having come thus far do you wish to continue?"}, {"viet": "Ông ta có lẽ là người vững vàng nhất mà tôi biết.", "eng": "He's about the most stable person I know."}, {"viet": "Ông ta rõ ràng là người ứng cử tốt nhất.''Tôi xin phép có ý kiến khác.'.", "eng": "He's clearly the best candidate.''I beg to differ.'."}, {"viet": "Anh ấy chính là người chúng ta cần cho công việc Cô ấy đây-đúng là người chúng ta đang nói đến!", "eng": "He's just the person we need for the job Here she is-the very person we were talking about!"}, {"viet": "Ông ta đang nghiên cứu mức độ tai nạn thường xuyên xảy ra trên quãng đường này.", "eng": "He's studying the occurrence of accidents on this piece of road."}, {"viet": "Hắn nhắm súng vào mục tiêu rồi bắn nhưng trượt.", "eng": "He aimed his gun at the target, fired and missed it."}, {"viet": "Anh ta trở nên lãnh đạm với sự đau khổ xung quanh mình.", "eng": "He became hardened to the suffering around him."}, {"viet": "Nó đến hú họa, tình cờ thấy tôi ở nhà.", "eng": "He came on the off chance of finding me at home."}, {"viet": "Nó bám vào mẹ như đỉa bám dai.", "eng": "He clung to his mother like a barnacle."}, {"viet": "Anh ta phết sơn đỏ lên tấm vải.", "eng": "He daubed some red paint on the canvas."}, {"viet": "Ông ấy toàn mua sắm ở cửa hàng hợp tác xã đó.", "eng": "He does all his shopping at the Co-op."}, {"viet": "Ông ta thoát chết trong đường tơ kẽ tóc.", "eng": "He escaped death by an inch."}, {"viet": "Anh ta cảm thấy khó mà kiên trì giữ cư xử đúng mực đạo đức trong một thời gian dài.", "eng": "He finds it difficult to stick to the straight and narrow for long."}, {"viet": "Anh ta cho chúng tôi mỗi người 5 bảng Anh.", "eng": "He gave us £ 5 each."}, {"viet": "Cậu ấy bị sưng ở đầu gối.", "eng": "He had a swelling on his knee."}, {"viet": "Anh ta là người có óc hài hước bén nhạy.", "eng": "He has a good sense of humour."}, {"viet": "Anh ta có nhiều năng lực tiềm tàng để trở thành nhà văn.", "eng": "He has great capabilities as a writer."}, {"viet": "Anh ấy không có việc nào cả.", "eng": "He hasn't got a job."}, {"viet": "Anh ấy là một trong những công nhân giỏi nhất của chúng tôi.", "eng": "He is among the best of our workers."}, {"viet": "Nó chỉ kém con trai của tôi trong tình thương yêu của tôi.", "eng": "He is second only to my own son in my affections."}, {"viet": "Nó cứ chọc thủng cái ly giấy bằng cây bút chì của mình.", "eng": "He kept jabbing away at the paper cup with his pencil."}, {"viet": "Anh ta sống ở một nơi xa xôi cách đây rất xa.", "eng": "He lives a great distance away."}, {"viet": "Hắn tuỳ tiện tiêu tiền của bạn gái.", "eng": "He made free with all his girlfriend's money."}, {"viet": "Ông ta trách mắng cô ấy suốt ngày.", "eng": "He nagged at her all day long."}, {"viet": "Anh ta chuyền bóng cho cầu thủ biên.", "eng": "He passed the ball to the winger."}, {"viet": "Anh ta đạt nhiều lợi ích nhờ hai năm ở nước ngoài.", "eng": "He profit greatly from his 2 year abroad."}, {"viet": "Anh ta cúp điện thoại trước khi tôi có thể giải thích.", "eng": "He rang off before I could explain."}, {"viet": "Ông ta phát biểu trước toà rằng bị cáo rất ăn năn.", "eng": "He represented to the court that the accused was very remorseful."}, {"viet": "Anh ấy thật buồn cười-gần anh ấy vui đáo để.", "eng": "He's a real laugh-such fun to be with."}, {"viet": "Anh ta thấy công việc rất là khó khăn.", "eng": "He's finding the job very difficult."}, {"viet": "Anh ta không phải là một người dễ dọa đâu.", "eng": "He's not one who is easily frightened."}, {"viet": "Anh ta đã làm hỏng hoàn toàn các dịp may được đề bạt hiếm có.", "eng": "He's wrecked his chances of ever getting promotion."}, {"viet": "Anh ta nheo mắt trước ánh sáng rực rỡ.", "eng": "He screwed up his eyes against the bright light."}, {"viet": "Anh ấy đã tỏ ra khá dè dặt về việc không đưa đơn xin ly dị.", "eng": "He showed considerable restraint in not suing for a divorce."}, {"viet": "Anh ta đã sống cuộc đời trưởng thành tại Canada.", "eng": "He spent his adult life in Canada."}, {"viet": "Anh ta đứng ở chân cầu thang và hét lên với tôi.", "eng": "He stood at the foot of the stairs and shouted up at me."}, {"viet": "Anh ta vung vẩy đôi tay khi anh ta đi.", "eng": "He swung his arms as he walked."}, {"viet": "Anh ta kể cho chúng tôi nghe câu chuyện ngớ ngẩn lạc đường ngay ở góc phố.", "eng": "He told us this cockamamie story about getting lost just the corner."}, {"viet": "Hắn ta cố làm cho tôi nhận hối lộ-Tôi hy vọng mình sẽ không bao giờ hạ thấp mình đến như vậy.", "eng": "He tried to make me accept a bribe-I hope I would never stoop so low."}, {"viet": "Anh ta định giá căn nhà cho tôi là 80.000 bảng Anh.", "eng": "He valued the house for me at £ 80,000."}, {"viet": "Anh ta đã được tha bổng vì không có bằng chứng rõ ràng là anh ta phạm tội.", "eng": "He was acquitted in default of strong evidence of his guilt."}, {"viet": "Nó bị bọn học trò lớn ở trường bắt nạt.", "eng": "He was bullied by the older boys at school."}, {"viet": "Anh ấy đã bị loại ra khỏi cuộc thi ở vòng thứ tư.", "eng": "He was eliminated from the contest in the fourth round."}, {"viet": "Ông ta được giải ngũ vì các vết thương ông ta phải lãnh nhận.", "eng": "He was invalided out of the army because of the wounds he received."}, {"viet": "Nhà vô địch đã thắng điểm anh ta.", "eng": "He was outpointed by the champion."}, {"viet": "Nó ốm đến mức chúng tôi phải cho mời bác sĩ.", "eng": "He was so ill that we had to send for a doctor."}, {"viet": "Nó thật không may đánh mất chìa khoá.", "eng": "He was unlucky enough to loose his keys."}, {"viet": "Anh ta lên tỉnh mục đích để mua một vô tuyến mới.", "eng": "He went to town with the purpose of buying a new television."}, {"viet": "Nó đã làm việc 5 năm ở trong công ti này.", "eng": "He worked with the firm for five years."}, {"viet": "Những chiếc xe tải nặng ầm ầm chạy qua.", "eng": "Heavy lorries thundering along, by, past, etc."}, {"viet": "Chính ông bác sĩ riêng của bà ta đã đỡ đẻ cho bà ấy.", "eng": "Her baby was delivered by her own doctor."}, {"viet": "Những lời kêu gọi giúp đỡ của cô ta ít sự đáp ứng.", "eng": "Her cries for help met with little response."}, {"viet": "Nét mặt cô ta rạng rỡ lên vì hạnh phúc.", "eng": "Her face was transfigured by happiness."}, {"viet": "Tình trạng tim của cô ta làm cô ta khó thở.", "eng": "Her heart condition makes her short of breath."}, {"viet": "Quan điểm tự do của cô ta đã sớm bộc lộ ra là một sự giả tạo hoàn toàn.", "eng": "Her liberal views were soon revealed as mere posturing."}, {"viet": "Đức tính vô giá của nàng là sự điềm tĩnh.", "eng": "Her one priceless asset is her calmness."}, {"viet": "Những lời nhận xét của cô ta làm nổ ra một cuộc tranh luận gay gắt.", "eng": "Her remarks touched off a violent argument."}, {"viet": "Văn phong của bà ấy có lối so sánh phong phú.", "eng": "Her style is rich in simile."}, {"viet": "Có câu đố này cho anh đây: Tại sao'smiles'lại là một từ dài nhất trên đời?-Bởi vì nó được tạo nên bởi hai s's và một'mile'ở giữa.", "eng": "Here's a riddle for you: why is'smiles'the longest word in the world?-Because it is made of two s's with a'mile'between them."}, {"viet": "Chuyển từng phần của một ngành công nghiệp đã quốc hữu hoá sang sở hữu tư nhân.", "eng": "Hire off parts of a nationalized industry to private ownership."}, {"viet": "Với thiện ý của anh ta, cô ấy đã tỉnh ngộ.", "eng": "His behavior soon undeceived her as to his true intentions."}, {"viet": "Các người cộng sự đã bày tỏ lòng kính trọng sâu sắc đối với vị tổng thống hết nhiệm kỳ.", "eng": "His colleagues paid generous tributes to the outgoing president."}, {"viet": "Những nổ lực của anh ta để tìm việc làm đã không thành công.", "eng": "His efforts to get a job were unsuccessful."}, {"viet": "Phim này in không tốt lắm.", "eng": "His film has not printed off very well."}, {"viet": "Tuần rồi nhà hắn bị trộm đột nhập.", "eng": "His house was broken into last week."}, {"viet": "Cuộc sống của anh ta là chỉ có làm việc chứ không hề có giải trí.", "eng": "His life is all work and no play."}, {"viet": "Con chó thông thường hiền lành của nó bất ngờ xông ra cắn nó vào chân.", "eng": "His normally placid dog turned on him and bit him in the leg."}, {"viet": "Biện pháp phục hồi nền kinh tế của ông ấy đã không được nhiệt tình đón nhận.", "eng": "His prescription for economic recovery was not well received."}, {"viet": "Cú sút của anh ấy chạm phần dưới của xà ngang.", "eng": "His shot hit the underside of the bar."}, {"viet": "Những giọt nước mắt của anh ta trông thật cảm động.", "eng": "His tears were pathetic to witness."}, {"viet": "Việc học toán của cậu ta cần được nâng lên ngang các bạn khác.", "eng": "His work in maths needs to be brought up to the standard of the others."}, {"viet": "Tính trung thực hiếm khi có trong nghề này, tôi e rằng như vậy!", "eng": "Honesty is at a premium in this profession, I'm afraid!"}, {"viet": "Tôi phải hiểu nhận xét này như thế nào đây?", "eng": "How am I supposed to take that remark?"}, {"viet": "Sao anh lại dám nói rằng tôi cóp-pi bản ghi chép của anh!", "eng": "How dare you suggest that I copied your notes!"}, {"viet": "Làm sao anh biết khi nào thì sang số?", "eng": "How do you tell when to change gear?"}, {"viet": "Còn bao nhiêu lâu nữa thì đến kỳ nghỉ?", "eng": "How long is it until vacation?"}, {"viet": "Có bao nhiêu người tham gia uỷ ban?", "eng": "How many people sit on the commission?"}, {"viet": "Thư máy bay đi Canada phải trả bao nhiêu?", "eng": "How much is the postage for an airmail letter to Canada?"}, {"viet": "Tối nay bạn muốn đi xem hòa nhạc không?", "eng": "How would you like to go to a concert this evening?"}, {"viet": "Tôi nên suy nghĩ trước khi quyết định.", "eng": "I'd better have a think before I decide."}, {"viet": "Tôi mong cô nhận cái vòng đeo tay này như một món quà.", "eng": "I'd like you to take this bracelet as a gift."}, {"viet": "Ngày mai lúc nào đó tôi sẽ gọi cho anh.", "eng": "I'll give you a ring some time tomorrow."}, {"viet": "Tôi sẽ cử một thợ ống nước đến sửa nó ngay.", "eng": "I'll send a plumber to repair it right away."}, {"viet": "Tôi sợ đề nghị mới của anh sẽ thất bại.", "eng": "I'm afraid it's thumbs down for your news proposal."}, {"viet": "Tôi sẽ tặng sách cho tất cả chúng bạn nhân lễ Giáng sinh.", "eng": "I'm giving all my friends books for Christmas."}, {"viet": "Tôi quan tâm đến lịch sử ngành ngân hàng.", "eng": "I'm interested in the history of banking."}, {"viet": "Tôi chỉ là người chạy giấy ở đây, ông nên hỏi ông chủ.", "eng": "I'm only the office boy here, you'd better ask the guvnor."}, {"viet": "Tôi rất tiếc làm ngắt dòng suy tưởng của ông.", "eng": "I'm sorry to interrupt your contemplations."}, {"viet": "Tôi đang cố để dành tiền mua nhà.", "eng": "I'm trying to save money to buy a house."}, {"viet": "Tôi đã ở trên boong, và tôi đã xem chỗ làm việc của thuyền trưởng.", "eng": "I've been on deck, and I've seen the Captain's quarters."}, {"viet": "Tôi có khá nhiều việc phải thu xếp trong tuần này.", "eng": "I've got rather a lot lined up this week."}, {"viet": "Anh chưa bao giờ nhìn thấy loại cá đó trước khi đi.", "eng": "I've never seen that kind of fish in Japan."}, {"viet": "Tôi thừa nhận ông đã già yếu nhưng dù có thế đi chăng nữa ông ấy vẫn là một nhà chính trị giỏi.", "eng": "I accept that he's old man and frail, be that it may, he's a good politician."}, {"viet": "Tôi cho rằng tình hình này sẽ còn tiếp diễn.", "eng": "I am assuming that the present situation is going to continue."}, {"viet": "Tôi vô cùng xin lỗi đã làm hỏng buổi tối của ông.", "eng": "I am very sorry to have spoilt your evening."}, {"viet": "Tôi tin hầu hết câu chuyện của anh ấy, nhưng tôi còn một vài điều dè dặt.", "eng": "I believe most of his story but I have some reservations."}, {"viet": "Tôi không thể xác nhận tính hiệu quả tuyệt đối cho phương pháp này được.", "eng": "I can't claim infallibility for this method."}, {"viet": "Tôi không thể nói chắc được tuần sau tôi sẽ ở đâu.", "eng": "I can't say with any certainty where I shall be next week."}, {"viet": "Tôi chẳng bao giờ có được áo quần vừa vặn cả.", "eng": "I can never get clothes fit me."}, {"viet": "Tôi không thể đến kịp lúc bảy giờ đâu.", "eng": "I can't make it at seven o'clock."}, {"viet": "Tôi có thể nghe thấy nó đập thình thịch liên tục ở nhà bên cạnh đập một lá đồng.", "eng": "I could hear him hammering in the house next door hammer a sheet of copper."}, {"viet": "Tôi có một phòng đôi có bồn tắm.", "eng": "I'd like a twin room with bath."}, {"viet": "Anh có thể làm nhanh hơn thế một chút được không?", "eng": "I didn't feel any more quickly than that?"}, {"viet": "Tôi cóc cần đến điều người khác nghĩ về tôi.", "eng": "I don't care a fig what others think of me."}, {"viet": "Tôi không thích đi làm với dạ dày lép kẹp.", "eng": "I don't like going to work on an empty stomach."}, {"viet": "Tôi không tin là anh đã hiểu thấu hoàn toàn tính nghiêm trọng của tình hình.", "eng": "I don't think you've quite grasped the seriousness of the situation."}, {"viet": "Tôi không hiểu được điều đó; tại sao nàng có thể làm một điều như thế nhỉ?", "eng": "I don't get it; Why could she do a thing like that?"}, {"viet": "Tôi thành khẩn mong anh xét lại quyết định của mình.", "eng": "I earnestly beg you to reconsider your decision."}, {"viet": "Tôi cảm thấy không đủ khả năng làm công việc đó.", "eng": "I feel unequal to the task."}, {"viet": "Tôi quên mất không nhớ dòng tiếp theo như thế nào.", "eng": "I forget how the next line goes."}, {"viet": "Tôi nhận được thư của chị tôi sáng nay.", "eng": "I got a letter from my sister this morning."}, {"viet": "Tôi tiêu thoải mái và mua hai bộ cánh mới.", "eng": "I had a splurge and bought two new suits."}, {"viet": "Tôi đã không nhận ra được tầm quan trọng của vấn đề.", "eng": "I hadn't realized the dimension of the problem."}, {"viet": "Tôi đến thay mặt cho em tôi, nó bị ốm.", "eng": "I have come on behalf of my brother, he's ill."}, {"viet": "Tôi đã tự thưởng cho mình một ngày nghỉ cuối tuần êm ả.", "eng": "I have promised myself a quiet weekend."}, {"viet": "Tôi chưa đọc được nhiều lắm quyển sách tôi đang đọc.", "eng": "I haven't got very far with the book I'm reading."}, {"viet": "Tôi nghe nói nhiều người Mỹ chưa bao giờ đến thành phố New York.", "eng": "I heard many Americans have never been to New York City."}, {"viet": "Tôi hy vọng chúng tôi sẽ gặp anh nhiều hơn.", "eng": "I hope we'll see more of you."}, {"viet": "Tôi chỉ mới ngoáy một mẩu dây điện vào ổ khoá và'hấp', cánh cửa mở toang.", "eng": "I just turned the piece of wire in the lock and hey presto, the door opened."}, {"viet": "Mỗi sáng tôi đi làm lúc 8 giờ 15.", "eng": "I leave for work at quarter past eight every morning."}, {"viet": "Tôi sống bên ngoài hồ khoảng ba dặm.", "eng": "I live beyond the lake about three miles."}, {"viet": "Tôi sẽ cho các em đoán ba lần!", "eng": "I'll give you three guesses!"}, {"viet": "Tôi sẽ đãi bạn ăn tối.", "eng": "I'll treat you to dinner."}, {"viet": "Tôi đang chờ một cú điện thoại quan trọng.", "eng": "I'm expecting an important call."}, {"viet": "Tôi không rành thức ăn Pháp.", "eng": "I'm not familiar with French food."}, {"viet": "Tôi nhạc nhiên khi bạn phát hiện ra.", "eng": "I'm surprised you could tell."}, {"viet": "Tôi đã ước lượng sai chiều rộng của con suối và đã rơi xuống suối.", "eng": "I misjudged how wide the stream was and fell in."}, {"viet": "Tôi cần một cái phễu để rót xăng vào thùng.", "eng": "I need a funnel to pour petrol into the tank."}, {"viet": "Giờ đây tôi xin mời ông Chủ tịch phát biểu ý kiến.", "eng": "I now invite the President to take the floor."}, {"viet": "Tôi đã suy nghĩ kỹ về sự cố đó, đồng thời lại tự hỏi mình sao điều đó lại có thể xảy ra được.", "eng": "I pondered over the incident, asking myself again how it could have happened."}, {"viet": "Tôi thực sự ưa thích một tách trà ngon.", "eng": "I really appreciate a good cup of tea."}, {"viet": "Tôi nhớ những ngày bà thường nướng bánh cho tôi ăn mỗi tuần một lần.", "eng": "I remember the days when you used to bake a pie for me once a week."}, {"viet": "Tôi nói điều này ở phần đầu cuốn sách của tôi.", "eng": "I say this at the beginning of my book."}, {"viet": "Tôi nên đi mua nước khoáng.", "eng": "I should go buy some mineral water."}, {"viet": "Tôi vẫn nghĩ là cách riêng của tôi tốt hơn!", "eng": "I still think my way is better!"}, {"viet": "Tôi nghĩ rượu vang nguyên chất sẽ ngon hơn.", "eng": "I think dry wine would be better."}, {"viet": "Sau khi cân nhắc mọi mặt tôi nghĩ là tôi thích kiểu cũ hơn.", "eng": "I think on balance I prefer the old system."}, {"viet": "Hình như tôi nghe thấy tiếng ai gọi.", "eng": "I thought I heard somebody calling."}, {"viet": "Tôi cố gắng liên lạc với hắn nhưng không thể được.", "eng": "I tried to contract him but was unable to."}, {"viet": "Tôi có nhiều tiền lẻ trong túi.", "eng": "I've got lots of change in my pocket."}, {"viet": "Con muốn ăn cho đến khi nào con không ăn nổi nữa.", "eng": "I want to eat until I drop."}, {"viet": "Tôi bị tố cáo là ăn cắp tiền của cô ta nhưng thực ra thì là ngược lại.", "eng": "I was accused of stealing money from her but in fact it was the other way round."}, {"viet": "Em đã rất vui khi bọn em ăn bánh mì bột đậu nành và trái cây thập cẩm.", "eng": "I was happy when we had soybean flour bread and mixed fruits."}, {"viet": "Tôi bàng hoàng trước tin cô ấy chết.", "eng": "I was shocked at the news of her death."}, {"viet": "Tôi lo lắng về tiền khách sạn, nhưng đến khi đó tôi có đủ tiền trả.", "eng": "I was worried about the hotel, but in the event I had enough money to pay."}, {"viet": "Ước gì tôi có thể, nhưng thứ sáu tôi bận rồi.", "eng": "I wish I could, but I'm busy Friday."}, {"viet": "Tôi tự hỏi những cuộc thương lượng sẽ giải quyết xong hay không.", "eng": "I wonder if the negotiations will go through."}, {"viet": "Tôi muốn được gọi đánh thức vào lúc 6 giờ sáng mai.", "eng": "I would like a wake-up call at six tomorrow morning, please."}, {"viet": "Tôi hoan nghênh sự giúp đỡ-nhưng đừng cố cho mệt xác chính bạn đó!", "eng": "I would welcome some help-but don't strain yourself!"}, {"viet": "Nếu có ai nghĩ rằng mình làm việc này tốt hơn thì anh ta cứ việc làm đi!", "eng": "If anyone thinks he can do this job any better, he's welcome to it!"}, {"viet": "Nếu anh muốn đầu tư an toàn, anh có thể bỏ tiền vào một công ti xây dựng, thì tốt hơn là làm cái gì khác nhiều.", "eng": "If I want a safe investment, you could do a lot worse than put your money in the building society."}, {"viet": "Nếu những lời đề nghị đó rõ ràng là hợp lý đúng đắn, tại sao anh lại phản đối?", "eng": "If the proposals are obviously sensible, why do you oppose them?"}, {"viet": "Nếu bạn có đi mua sắm, bạn có thể giúp tôi mua ít thuốc lá được không?", "eng": "If you're going to the shops, could you bring me back some cigarettes?"}, {"viet": "Trong vòng bảy ngày nếu anh không nghe thấy gì, thì gọi điện thoại lại nhé.", "eng": "If you don't hear anything within seven days, phone again."}, {"viet": "Nếu bạn dời tới một văn phòng nhỏ hơn, bạn sẽ giảm được phần tổng phí.", "eng": "If you move to a smaller office you will reduce your overheads."}, {"viet": "Nếu bạn ở vào vị trí của tôi, bạn sẽ làm gì?", "eng": "If you were in my place, what would you do?"}, {"viet": "Ở Mỹ, bầu cử tổng thống được tổ chức bốn năm một lần.", "eng": "In America, presidential elections are held every four years."}, {"viet": "Nói chung, bạn có nghĩ là qui định về trang phục nơi công sở ở Nhật Bản quá nghiêm ngặt không?", "eng": "In general, do you think that work dress codes in Japan are too restrictive?"}, {"viet": "Có nhiều đoạn sông Đa-nuýp chảy lững lờ qua vùng đồng bằng.", "eng": "In places the Danube flows sleepily across level farmland."}, {"viet": "Lúc đầu tôi đã có ý muốn từ chối, nhưng sau đó tôi đã nghĩ lại.", "eng": "In the first instance I was inclined to refuse, but then I reconsidered."}, {"viet": "Trong những tháng này, Bắc bán cầu có nhiều giờ chiếu sáng hơn Nam bán cầu.", "eng": "In those months the northern hemisphere gets more hours of sunlight than southern hemisphere."}, {"viet": "Thay vì tiến lên trước, công việc của tôi thực sự là có vẻ như đang đi giật lùi.", "eng": "Instead of making progress, my work actually seems to be going backwards."}, {"viet": "Có nhiều nhà có máy hát karaoke ở đất nước của bạn phải không?", "eng": "Is karaoke popular in your country?"}, {"viet": "Còn việc gì tôi có thể làm giúp ông không?", "eng": "Is there anything I can do for you?"}, {"viet": "Gọi điện cho tôi lúc ba giờ sáng thật là quá đáng.", "eng": "It's a bit much ringing me up at three o'clock."}, {"viet": "Đó là một cuốn sách thú vị nhưng có phần cường điệu.", "eng": "It's an interesting book but rather far-fetched."}, {"viet": "Nó nổi tiếng về lụa, đồ gốm, và lễ hội đèn lồng.", "eng": "It's famous for silk and pottery, and its Lantern Festival."}, {"viet": "Ý kiến đã được cân nhắc của tôi là ông nên từ chức.", "eng": "It's my considered opinion that you should resign."}, {"viet": "Đó là một bức ảnh chụp nhanh, hơn nữa lại chụp tồi.", "eng": "It's only a snap shot and a poor one at that."}, {"viet": "Đã đến lúc thoát ra khỏi cái cuộc sống theo đường mòn hàng ngày làm việc từ 9 giờ sáng đến 5 giờ chiều.", "eng": "It's time to get out of the 9 to 5 rut."}, {"viet": "Người giàu đi nghỉ đông ở vùng nắng ấm đã thành mốt thời thượng.", "eng": "It became fashionable for the rich to winter in the sun."}, {"viet": "Đó là một nơi để nghỉ ngơi dễ chịu, thoải mái.", "eng": "It is a delightful, relaxing place for a holiday."}, {"viet": "Anh có trách nhiệm báo cho mọi người biết sự nguy hiểm.", "eng": "It is incumbent on you to warn people of the danger."}, {"viet": "Không thể tưởng tượng được là chúng ta lại có thể để cho một cuộc huỷ diệt hạt nhân xảy ra.", "eng": "It is unthinkable that we should allow a nuclear holocaust to occur."}, {"viet": "Trời mưa như trút và quần áo tôi bị hỏng hết.", "eng": "It poured with rain and my dress was ruined."}, {"viet": "Thật là hân hạnh khi gặp ông.", "eng": "It's pleasure to meet you."}, {"viet": "Nghe có vẻ là một đề nghị rất tốt đẹp nhưng có thể có điều đáng ngờ.", "eng": "It sounds like a good offer, but there may be a catch."}, {"viet": "Nói chuyện trong những tiếng ồn ào như vậy thật ra là một công việc.", "eng": "It was a real job to talk over that noise."}, {"viet": "Đó là vào tháng Tư-không, tháng Năm, anh ta nói rồi tự anh ta chữa lại.", "eng": "It was in April-no, May, he said, correcting himself."}, {"viet": "Không chắc chúng ta sẽ đến sân bay kịp giờ.", "eng": "It was touch-and-go whether we would get to the airport in time."}, {"viet": "Thật là kinh khủng nếu con xuống máy bay với hội chứng vé hạng thường.", "eng": "It would be terrible if you came down with Economy Class Syndrome."}, {"viet": "Jim và tôi không bao giờ có cùng quan điểm về vấn đề này cả.", "eng": "Jim and I have never seen eye to eye on this matter."}, {"viet": "Đúng như tôi đã nghĩ, món mì Ý ở đây rất ngon.", "eng": "Just as I expected, the pasta here is great."}, {"viet": "Những đơn đặt hàng lớn hiện đang ào ạt đổ đến từ Trung Quốc và thị trường ở đây cũng rất lớn.", "eng": "Large orders are now pouring in from China and the market here is also very strong."}, {"viet": "Cho tôi xem qua thẻ chìa khoá của ông.", "eng": "Let me have a look at your key card."}, {"viet": "Những câu dài phức hợp là đặc điểm của văn phong thời sau của Henry James.", "eng": "Long complex sentences are distinctive of Henry James's later style."}, {"viet": "Nhiều người trong đám tang đeo băng tay đen.", "eng": "Many people at the funeral were wearing black arm-bands."}, {"viet": "Mary có một con cừu nhỏ, lông nó trắng như tuyết, Mary đi đâu, con cừu đi đấy.", "eng": "Mary had a little lamb, its fleece was white as snow, and everywhere that Mary went, the lamb was sure to go."}, {"viet": "Tôi có thể xem hộ chiếu của ông được không?", "eng": "May I see your passport, please?"}, {"viet": "Thường thường ông ta tới và xin lỗi trong vài phút sau khi quát mắng chúng tôi.", "eng": "More often than not he'll come and apologize within minutes of shouting at us."}, {"viet": "Ông Jones là nạn nhân đầu tiên của cuộc tinh giảm nhân viên của xí nghiệp.", "eng": "Mr. Jones was the first casualty of the firm's cut-backs."}, {"viet": "Gần đây, đôi giày của tôi hỏng nặng quá, tôi cần thay một đôi mới.", "eng": "My boots have take quite a punishing recently, i need a new pair."}, {"viet": "Cha tôi ngủ với tờ báo phủ lên mặt.", "eng": "My father went to sleep with a newspaper over his face."}, {"viet": "Mẹ tôi thích đến thành phố thăm các cô con gái của bà ấy, nhưng bà ấy thích ở đây, trong rừng.", "eng": "My mother likes to go to the city to see her daughters, but she likes it here in the forest."}, {"viet": "Tài khoản ký thác của tôi hai tháng sau sẽ đào hạn.", "eng": "My time deposit will mature two months later."}, {"viet": "Chính sách mới của chính phủ đối với vấn đề sức khoẻ.", "eng": "New government policy in the issue of health."}, {"viet": "Chưa, tôi hoàn toàn hiểu được rằng ngân phiếu du lịch chỉ được ký duyệt trước mặt người trả tiền vào lúc thanh toán.", "eng": "No, I perfectly understand that traveller's cheques are to be countersigned only in presence of the paying agent at the time of payment."}, {"viet": "Không có bác sĩ nào có lòng tự trọng mà lại từ chối chữa trị cho một người đau ốm.", "eng": "No self-respecting doctor would refuse to treat a sick person."}, {"viet": "Bây giờ khi những kế hoạch ban đầu được thu gọn lại thì chúng trở nên thực tế hơn nhiều.", "eng": "Now that the original plans have been fined down, they are much more practical."}, {"viet": "Ồ, tôi để quên thuốc lá ở phòng ngoài rồi.", "eng": "Oh, i've left my cigarettes in the hall."}, {"viet": "Các bà già trong buổi chạng vạng của cuộc đời.", "eng": "Old laddies in the twilight of their lives."}, {"viet": "Hạnh phúc của người ta là ở chỗ cố gắng hết sức để hoàn thành nhiệm vụ của mình.", "eng": "One's happiness consists in trying one's best to fulfill one's duty."}, {"viet": "Một cây độc thụ mọc bên sườn núi.", "eng": "One solitary tree grew on the mountainside."}, {"viet": "Con gái chúng tôi sẽ đi học cao đẳng vào mùa thu.", "eng": "Our daughter is going to college in the autumn."}, {"viet": "Giờ nghỉ ăn trưa của chúng tôi từ 12 giờ trưa đến 1 giờ chiều.", "eng": "Our lunch break is from 12 noon to 1 p. m."}, {"viet": "Đội ta đã có năm trận thắng và không thua trận nào trong mùa thi đấu này.", "eng": "Our team has had five wins and no losses this season."}, {"viet": "Quốc hội được trao quyền làm luật.", "eng": "Parliament is vested with the power of making laws."}, {"viet": "Hình như tối nay người ta đã uống quá nhiều đấy, tất nhiên không phải là các bạn.", "eng": "People seem to have drunk far too much tonight, present company excepted of course."}, {"viet": "Hãy cho tôi biết có thể lấy thứ gì cho bạn nhé.", "eng": "Please let me know if there is anything I can get you."}, {"viet": "Suỵt! chúng ta hãy đi ra bây giờ trước khi họ thấy chúng ta!", "eng": "Psst! Let's get out now before they see us!"}, {"viet": "Các nhà khoa học đang đi tìm cách chữa cho căn bệnh.", "eng": "Scientists are in search of a cure for the disease."}, {"viet": "Tôi sẽ buộc cái gói lại hay là dùng băng dính?", "eng": "Shall I tie the parcel or use sticky tape?"}, {"viet": "Cô ta đã nhất quyết phải thành công trong đời.", "eng": "She's absolutely determined to succeed in life."}, {"viet": "Nàng được trời phú cho trí thông minh cũng như sắc đẹp.", "eng": "She's endowed with intelligence as well as beauty."}, {"viet": "Cô ta công diễn đầu tiên ở New York tại hội trường Carnegie.", "eng": "She's making her New York début at Carnegie Hall."}, {"viet": "Bà ấy là ứng cử viên được Đảng Lao động ủng hộ.", "eng": "She's the candidate who is backed by the Labour Party."}, {"viet": "Cô ta lúc nào cũng thắng trong những cuộc cãi vã giữa chúng tôi.", "eng": "She always gets the better of our quarrels."}, {"viet": "Cô ta đáp lại người diễn thuyết bằng một số câu hỏi sắc bén.", "eng": "She came back at the speaker with some sharp questions."}, {"viet": "Cô ấy không thể tìm được lời giải thích hợp lý nào về sự biến mất của nó.", "eng": "She could find no plausible explanation for its disappearance."}, {"viet": "Cô ấy không đóng góp gì cho biểu thảo luận.", "eng": "She didn't contribute anything to the discussion."}, {"viet": "Bà ta thở dài biểu lộ nỗi phiền muộn.", "eng": "She exhaled slowly to show her annoyance."}, {"viet": "Cô ấy há hốc miệng sửng sốt trước vận may của mình.", "eng": "She gasped in wonderment at her good luck."}, {"viet": "Cô ấy làu bàu trong bụng khi thấy chồng công việc mới đặt trên bàn.", "eng": "She groaned inwardly as she saw the fresh pile of work on her desk."}, {"viet": "Cô ấy có cung cách vui vẻ và thân mật.", "eng": "She has a cheerful and friendly demeanor."}, {"viet": "Cô ta có những thông tin về vụ bê bối này và đe doạ tố giác tên của những người dính líu.", "eng": "She has secret information about this scandal, and has threatened to name names."}, {"viet": "Cô ấy là người thật tốt bụng đã chăm sóc tôi trong khi tôi bị ốm.", "eng": "She is a real brick, looking after me while I've been ill."}, {"viet": "Cô bé quá tự cao không đi đến trường với những đứa trẻ khác.", "eng": "She is too proud to walk to school with the other children."}, {"viet": "Cô ấy thích không khí thoải mái và chào đón của trường đại học.", "eng": "She liked the relaxed and welcoming atmosphere of the college."}, {"viet": "Cô ấy làm ra được con số triệu đầu tiên trước khi cô ba mươi tuổi.", "eng": "She made her first million before she was thirty."}, {"viet": "Bà ta dâng lên Chúa một lời cầu xin để chồng bà được bình an trở về.", "eng": "She offered a prayer to God for her husband's safe return."}, {"viet": "Cô ấy kê toa một số thuốc viên để giúp tôi ngủ.", "eng": "She prescribed some pills to help me to sleep."}, {"viet": "Bà ta báo cáo là ( anh ấy ) có nhìn thấy tên cướp.", "eng": "She reported ( his ) having seen the gunman."}, {"viet": "Bà ta là người lắm mồm.", "eng": "She's got a big mouth."}, {"viet": "Cô ta làm việc cật lực để kiếm tiền.", "eng": "She's working hard to earn money."}, {"viet": "Cô ấy gửi một gói sách cho em trai.", "eng": "She sent a parcel of books to her brother."}, {"viet": "Cô ta đôi khi phát biểu những nhận xét kỳ dị nhất.", "eng": "She sometimes comes out with the most extraordinary remarks."}, {"viet": "Cô ta bị những cơn thẫn thờ và chán chường.", "eng": "She suffers from bouts of lethargy and depression."}, {"viet": "Cô ấy đã đặc biệt thận trọng để không nấu quá lửa món thịt.", "eng": "She took particular care not to overcook the meat."}, {"viet": "Bà ấy không đòi quyền lợi được đi du lịch loại nhất.", "eng": "She waived her right to travel first class."}, {"viet": "Cô ta tức giận khi bị khước từ cơ hội gặp tôi.", "eng": "She was angry at being denied the opportunity to see me."}, {"viet": "Cô ấy được giao trọng trách chỉ đạo dự án đó.", "eng": "She was entrusted with the direction of the project."}, {"viet": "Cô ta bị dẫn vào một xà lim.", "eng": "She was marched into a cell."}, {"viet": "Bà ta hát một bài ru con.", "eng": "She was singing a lullaby to her child."}, {"viet": "Cô ta bực bội vì tôi đã đến muộn.", "eng": "She was vexed that I was late."}, {"viet": "Cô ta thì thầm với tôi là cô ta cảm thấy rất sợ.", "eng": "She whispered to me that she felt very afraid."}, {"viet": "Cô ấy bằng lòng ngủ ở góc nào phân cho cô ấy.", "eng": "She would be content to sleep in any corner that was allotted to her."}, {"viet": "La hét hết sức của họ.", "eng": "Shouting at the tops of their voice."}, {"viet": "Từ khi trốn thoát khỏi nhà tù, Tom sống trong nơm nớp lo sợ bị bắt lại.", "eng": "Since his escaped from gaol, Tom has been living on razor's edge, terrified of recapture."}, {"viet": "Cho đứa con một của họ thật nhiều quà và sự quan tâm.", "eng": "Slathered gifts and attention on their only child."}, {"viet": "Những lời nhận xét nhạo báng về vợ ông chủ tịch.", "eng": "Snide remarks about the chairman's wife."}, {"viet": "Những xã hội đã quá giai đoạn phong kiến.", "eng": "Societies that have passed the feudal stage."}, {"viet": "Mụ đàn bà ngu ngốc hôm nay yêu cầu tôi ký vào kiến nghị chống chính phủ.", "eng": "Some idiotical female asked me to sign an anti government petition today."}, {"viet": "Một số người nghĩ rằng mèo đen là may mắn.", "eng": "Some people think that black cats are lucky."}, {"viet": "Người đó phải có tiền và một ngôi nhà lớn.", "eng": "Someone who has money, and a big house."}, {"viet": "Những cố gắng lau dọn nhà cửa không đều đặn.", "eng": "Spasmodic efforts to clean the house."}, {"viet": "Đứng thẳng, đừng có khom vai!", "eng": "Stand straight, don't hunch your shoulders!"}, {"viet": "Đừng lắp ba lắp bắp nữa và hãy nói chậm hơn một chút.", "eng": "Stop babbling and speak more slowly."}, {"viet": "Những cuộc đình công làm nhiều nhà máy trong công nghiệp thép phải đóng cửa.", "eng": "Strikes causing shut-downs in the steel industry."}, {"viet": "Ngày nay, những tội ác nghiêm trọng như vậy sẽ không thể tha thứ được.", "eng": "Such enormities would not be tolerated today."}, {"viet": "Giả dụ là trời mưa thì chúng ta có thể đấu trong nhà được không?", "eng": "Supposing that it rains, can we play the match indoors?"}, {"viet": "Có bi quan đối với vấn đề đó.", "eng": "Take a pessimistic view of the problem."}, {"viet": "Những cuộc cải cách thuế để mở đường cho một tương lai thịnh vượng hơn.", "eng": "Tax reforms which point the way to a more prosperous future."}, {"viet": "Mười năm phục vụ trong lực lượng cảnh sát.", "eng": "Ten year's service in the police force."}, {"viet": "Đó là do anh đã chơi tennis quá lâu đấy.", "eng": "That's because you played tennis so long."}, {"viet": "Đứa bé đó cần phải mắng cho một trận nên thân.", "eng": "That child needs a good talking to."}, {"viet": "Đó là lý do tại sao tôi đã đến sớm.", "eng": "That is the reason why I came early."}, {"viet": "Lời tuyên bố đó dĩ nhiên là không có tính cách thuyết phục.", "eng": "That proclamation of course, will not wash."}, {"viet": "Việc đó được xếp loại thấp trong danh mục ưu tiên của tôi.", "eng": "That task rates low on my priority list."}, {"viet": "Chất bảo vệ của con tàu vũ trụ khi trở về khí quyển.", "eng": "The ablator of a spacecraft on re-entry."}, {"viet": "Diễn viên nghiên cứu kịch bản trước khi quay.", "eng": "The actor studied the script, before the filming took place."}, {"viet": "Quân đồng minh đã sẵn sàng tấn công chiếm lại Châu âu.", "eng": "The Allies were poised of their invasion of Europe."}, {"viet": "Tính vô địch hiển nhiên trong sức mạnh của họ.", "eng": "The apparent invincibility of their forces."}, {"viet": "Các nhà phê bình nghệ thuật đã đánh giá thấp tác phẩm của anh ta bao nhiêu năm nay.", "eng": "The art critics had disvalued his work for years."}, {"viet": "Tác giả đó nổi đoá vì bị nói là đạo văn.", "eng": "The author bristled at the suggestion of plagiarism."}, {"viet": "Thời tiết xấu ngăn người ta thăm dự cuộc diễu hành.", "eng": "The bad weather discouraged people from attending the parade."}, {"viet": "Vỏ những cây tiêu huyền cứ bong ra thường xuyên.", "eng": "The bark of plane trees peels off regularly."}, {"viet": "Những thuận lợi về nền giáo dục đại học.", "eng": "The benefits of modern higher education."}, {"viet": "Sự tàn ác của kẻ tống tiền đối với nạn nhân của nó.", "eng": "The blackmailer's cruelty to his victim."}, {"viet": "Chiếc giá sách tạo thành một góc thẳng với tường.", "eng": "The book case formed a right angle with the wall."}, {"viet": "Người ném bóng ném xoáy quả bóng một cái.", "eng": "The bowler gave a spin to the ball."}, {"viet": "Những ngọn sóng lớn xô đập vào bờ.", "eng": "The breakers came tumbling onto the shore."}, {"viet": "Ý chính của những điều ông ta nói bảo vệ một cách đầy nhiệt tình tầng lớp quý tộc bảo thủ.", "eng": "The burden of what he said was to defend enthusiastically the conservative aristocracy."}, {"viet": "Sự hủy bỏ trận đấu vì sương mù.", "eng": "The cancellation of the match due to fog."}, {"viet": "Chiếc xe suýt chạm vào cột cổng.", "eng": "The car only just cleared the gatepost."}, {"viet": "Người thủ quỹ đã chuồn mất cùng với số tiền thu được trong ngày.", "eng": "The cashier has done a bunk with the day's taking."}, {"viet": "Vị chủ tịch đã chỉ định Christina là người kế tục của mình.", "eng": "The chairman has designated Christina as his successor."}, {"viet": "Kỹ năng của thằng bé thật đáng kinh ngạc đối với tuổi của nó.", "eng": "The child's skill is wonderful for his age."}, {"viet": "Đứa bé đang rên la là nó bị đau ở chân.", "eng": "The child was wailing loudly that she had hurt her foot."}, {"viet": "Lũ trẻ giả bộ ăn những cái bánh nướng làm bằng đất bùn.", "eng": "The children pretended to eat the mud pies."}, {"viet": "Ca đoàn hát bài thánh ca thứ 23.", "eng": "The choir sang the 23rd Psalm."}, {"viet": "Nhân viên ngân hàng sẽ thông báo cho ông ấy rằng hối phiếu đã được thu.", "eng": "The clerk will inform him that the draft has been collected."}, {"viet": "Cà phê quá nóng cô ấy không uống được.", "eng": "The coffee was too hot for her to drink."}, {"viet": "Ủy ban được thành lập bởi các thành viên của cả ba đảng.", "eng": "The committee is constituted of members of all three parties."}, {"viet": "Công ty đã trao công việc đó cho một người khác.", "eng": "The company offered the job to someone else."}, {"viet": "Hậu quả của việc phá bỏ qui định cho công ty hàng không dân dụng.", "eng": "The consequence of deregulating the airline."}, {"viet": "Giá đồ dùng sân khấu trong thành phố quá cao không mua nổi.", "eng": "The cost of property in the city is prohibitive."}, {"viet": "Khoá học gồm bài tập trong lớp và thực hành ở nhà máy.", "eng": "The course consists of some classwork and some practice in the factory."}, {"viet": "Các nhà phê bình chỉ trích gay gắt vở kịch mới của bà ta.", "eng": "The critics roasted her new play."}, {"viet": "Thâm hụt mậu dịch hiện nay chỉ ra một sự mất cân bằng nghiêm trọng giữa nhập khẩu và xuất khẩu của chúng ta.", "eng": "The current trade deficit indicates a serious imbalance between our import and export trade."}, {"viet": "Kiểu xe De Luxe thậm chí còn có khả năng tăng tốc tốt hơn.", "eng": "The De Luxe model has even better acceleration."}, {"viet": "Những người biểu tình giương biểu ngữ và hô to khẩu hiệu.", "eng": "The demonstrators brandished banners and shouted slogans."}, {"viet": "Sự khác nhau, nếu có, cũng hết sức mong manh.", "eng": "The difference, if it exists, is extremely tenuous."}, {"viet": "Sự đổi các chuyến bay vì có sương mù.", "eng": "The diversion of flights because of fog."}, {"viet": "Các bác sĩ tỏ ra không có hy vọng gì có thể phục hồi sức khoẻ.", "eng": "The doctors held out no hope of recovery."}, {"viet": "Mũi con chó giật giật khi nó ngửi thấy mùi thịt.", "eng": "The dogs nose twitched as it smelt the meat."}, {"viet": "Thuốc kích thích tác động đến năng lực tập trung của mình.", "eng": "The drug affects one's powers of concentration."}, {"viet": "Hậu quả của sự ô nhiễm trên bãi biển thật sự bi thảm.", "eng": "The effect of the pollution on the beaches is absolutely tragic."}, {"viet": "Máy hút nước qua ống dẫn.", "eng": "The engine draws water along the pipe."}, {"viet": "Ánh nắng chiều rọi xiên qua cửa sổ.", "eng": "The evening sunlight shone aslant through the window."}, {"viet": "Vụ nổ gây ra do ống dẫn khí bị nổ.", "eng": "The explosion was caused by a burst gas pipe."}, {"viet": "Những người hâm mộ hò hét sôi nổi khi họ thấy anh ấy.", "eng": "The fans screamed with excitement when they saw him."}, {"viet": "Số liệu được diễn tả theo một tỉ lệ phần trăm.", "eng": "The figure is expressed as a percentage."}, {"viet": "Đội cứu hoả đáp ứng ngay cú điện thoại khẩn nhưng không có đám cháy nào cả-đó hoàn toàn là một trò chơi khăm.", "eng": "The fire-brigade answered the emergency call but there was no fire-it was all a hoax."}, {"viet": "Những cuốn sách đầu tiên không có các trang sách được đóng vào với nhau và không có bìa bọc ngoài.", "eng": "The first books were not made of pages bound together inside a cover."}, {"viet": "Chuyến bay rất không thoải mái vì gió xoáy.", "eng": "The flight was very uncomfortable because of turbulence."}, {"viet": "Thể thức của cuộc gặp là sao cho mọi người đều có thể đặt một câu hỏi.", "eng": "The format of the meeting was such that everyone could ask a question."}, {"viet": "Đồ bàn ghế chưa đưa đến cho nên chúng tôi đang dùng các thùng gỗ làm ghế ngồi.", "eng": "The furniture hadn't arrived so we were using crates as seats."}, {"viet": "Viên tướng phải cho binh sĩ vượt sông.", "eng": "The general had to get his troops across the river."}, {"viet": "Mức thù lao bình thường của nghề làm báo tự do là 5 bảng Anh một giờ.", "eng": "The going rate for freelance work is £ 5 an hour."}, {"viet": "Chính phủ đã dành ưu tiên hàng đầu cho việc cải cách hệ thống pháp lý.", "eng": "The Government gave top priority to reforming the legal system."}, {"viet": "Chính phủ từ chối hỗ trợ cho các ngành công nghiệp kém hiệu quả.", "eng": "The government refused to prop up inefficient industries."}, {"viet": "Những nhà văn viết văn xuôi vĩ đại của thế kỷ thứ 19.", "eng": "The great prose writers of the 19th century."}, {"viet": "Người khách trọ muốn mượn một cái máy sấy tóc.", "eng": "The guest wants to borrow a hair-dryer."}, {"viet": "Trụ sở chính thường đóng ở Bristol nhưng đó là trước thời tôi.", "eng": "The headquarters used to be in Bristol, but that was before my time."}, {"viet": "Khía cạnh lịch sử làm chủ đề cho bài tiểu luận của cô ấy.", "eng": "The historical aspect formed the main theme of her essay."}, {"viet": "Khách sạn có đầy đủ tiện nghi hiện đại.", "eng": "The hotel has all modern comforts."}, {"viet": "Ngôi nhà đầy hương vị cà phê.", "eng": "The house was filled the aroma of coffee."}, {"viet": "Tính chất cận tiếp của trận chiến khi được theo dõi trên truyền hình.", "eng": "The immediacy of the war, as seen on television."}, {"viet": "Người đàn ông bị thương đã lả hẳn đi lúc xe cứu thương đến.", "eng": "The injured man was fairly far gone by the time the ambulance arrived."}, {"viet": "Giá cif của hóa đơn là 35 bảng Anh.", "eng": "The invoice was for £ 35 cif."}, {"viet": "Quan tòa đưa ra một bản án nghiêm khắc.", "eng": "The judge imposed a stiff sentence."}, {"viet": "Trước đây người ta cho rằng vừa có khả năng chữa bệnh bằng cách sờ vào con bệnh.", "eng": "The King was formerly thought to have the healing touch."}, {"viet": "Ba giai đoạn cuối cùng này không phải lúc nào cũng diễn ra theo cùng một trật tự.", "eng": "The last three steps do not always come in the same order."}, {"viet": "Diễn giả nhìn xuống một biển những bộ mặt ở phía dưới ông ta.", "eng": "The lecturer looked down at the sea of faces beneath him."}, {"viet": "Đèn cháy cầu chì vì hệ thống điện bị những đồ dùng bằng điện làm cho quá tải.", "eng": "The lights fused because the system was overloaded with electrical appliances."}, {"viet": "Cuộc đình công của các bác tài xế xe tải đã làm trì hoãn những chuyến giao hàng của chúng tôi đến hơn cả tháng trời.", "eng": "The lorry drivers strike has put back our deliveries by over a month."}, {"viet": "Lý lẽ chính chìm ngập trong một mớ chi tiết chán ngắt.", "eng": "The main argument was submerged in a mass of tedious detail."}, {"viet": "Bản thảo này ghi ngày tháng là 10 tháng Tư năm 1937.", "eng": "The manuscript bears the date 10 April 1937."}, {"viet": "Thịt đó bị coi là không thích hợp cho người ăn.", "eng": "The meat was condemned as unfit for human consumption."}, {"viet": "Kim loại bị oằn đi vì sức nóng.", "eng": "The metal buckled in the heat."}, {"viet": "Nhiệm vụ của viên phi công là tiêu diệt toàn bộ doanh trại của địch.", "eng": "The mission of the pilot was to destroy all enemy camps."}, {"viet": "Những con muỗi làm tôi khó chịu đến nỗi tôi không sao ngủ được.", "eng": "The mosquitoes annoyed me so much that I couldn't sleep."}, {"viet": "Tên sát nhân không thể thủ tiêu được cái xác.", "eng": "The murderer was unable to dispose of the body."}, {"viet": "Trung tâm đầu não của chiến dịch bầu cử.", "eng": "The nerve-centre of an election campaign."}, {"viet": "Các biện pháp mới đều phù hợp với chính sách của chính phủ.", "eng": "The new measures are all of a piece with the government's policy."}, {"viet": "Tin đó làm mọi người phấn khởi.", "eng": "The news had an electric effect."}, {"viet": "Tiếng nổ xuyên qua những bức tường dầy nhất.", "eng": "The noise of the explosion penetrated the thickest walls."}, {"viet": "Cô y tá đã lo cho bệnh nhân của mình ngủ thoải mái qua đêm.", "eng": "The nurse settle her patient for the night."}, {"viet": "Toà nhà cũ đó có một vẻ ảm đạm khó tả bao quanh.", "eng": "The old building had an intangible air of sadness about it."}, {"viet": "Những người đứng bên cạnh chiếc xe tải đỏ đấy.", "eng": "The ones standing beside that red truck."}, {"viet": "Kết quả của cuộc bầu cử này có thể được quyết định bởi các cử tri không nhất định bầu riêng cho đảng nào.", "eng": "The outcome of this election may be decided by floating voters."}, {"viet": "Bố mẹ trải qua một sự thử thách kinh khủng khi con của họ bị bắt cóc.", "eng": "The parents went through a terrible ordeal when their child was kidnapped."}, {"viet": "Bệnh nhân cảm thấy dễ chịu sau cuộc giải phẫu.", "eng": "The patient is comfortable after his operation."}, {"viet": "Sự cân xứng hoàn hảo của tòa nhà.", "eng": "The perfect symmetry of the building."}, {"viet": "Bức tranh sẽ chỉ cho chúng ta thấy các phần đó.", "eng": "The picture shows them."}, {"viet": "Máy bay mang bom nguyên tử.", "eng": "The plane carried an armed atomic bomb."}, {"viet": "Vở kịch đó tạo nên một buổi tối giải trí tuyệt diệu.", "eng": "The play makes a splendid evening's entertainment."}, {"viet": "Cảnh sát đang truy tìm tên ăn trộm.", "eng": "The police are searching for the thief."}, {"viet": "Cảnh sát phải cố gắng tái lập trật tự.", "eng": "The police must try to restore order."}, {"viet": "Sự bế tắc về chính trị đã ngăn trở Tổng thống và Quốc hội khẩn trương tiến hành việc cắt giảm ngân sách.", "eng": "The political gridlock that prevented the President and Congress from moving expeditiously to cut the budget."}, {"viet": "Năng lượng tiềm tàng trong nước chảy.", "eng": "The potential energy that reside in flowing water."}, {"viet": "Ông tổng thống đã từ bỏ quyền lực của mình.", "eng": "The president has abnegated his powers."}, {"viet": "Vị linh mục làm phép thánh bánh và rượu.", "eng": "The priest blessed the bread and wine."}, {"viet": "Người tù được phóng thích sớm nhờ hạnh kiểm tốt.", "eng": "The prisoner was released early because of good conduct."}, {"viet": "Dự án vẫn còn ở khởi điểm.", "eng": "The project is still on the launching pad."}, {"viet": "Bánh pútđinh được làm bằng sữa đặc không đường.", "eng": "The pudding was made with evaporated milk."}, {"viet": "Vấn đề được nêu lên trong cuộc họp.", "eng": "The question is bound to come up at the meeting."}, {"viet": "Sự tác hại của thời gian làm tàn phai dung nhan của bà ấy.", "eng": "The ravages of time had spoilt her looks."}, {"viet": "Nội quy định rõ là anh có thể dùng từ điển trong kỳ thi.", "eng": "The regulations specify that you may use a dictionary in the examination."}, {"viet": "Nhà hàng đã được đặt kín chỗ nhưng thỉnh thoảng cũng có người bỏ.", "eng": "The restaurant is fully booked for tonight, but sometimes there are cancellations."}, {"viet": "Tiếng nói sang sảng của một nhà hùng biện.", "eng": "The ringing tones of an orator's voice."}, {"viet": "Tiếng gầm của xe hỏa vang dội trong đường hầm.", "eng": "The roar of the train reverberated in the tunnel."}, {"viet": "Hội Hoàng gia bảo vệ chim.", "eng": "The Royal Society for the Protection of Birds."}, {"viet": "Người bán hàng hưởng một tỉ lệ phần trăm về mỗi thứ họ bán.", "eng": "The salesman get a percentage on everything they sell."}, {"viet": "Trường nghỉ sớm 15 phút.", "eng": "The school was dismissed 15 minutes early."}, {"viet": "Xu hướng giật gân của báo chí lá cải.", "eng": "The sensationalism of the popular press."}, {"viet": "Người chăn cừu lên đường đi tìm con cừu lạc.", "eng": "The shepherd set out to look for the sheep that had wandered."}, {"viet": "Nhân viên bán hàng rất khinh khỉnh với tôi khi tôi nhờ giúp đỡ.", "eng": "The shop assistant was very supercilious towards me when I asked for some help."}, {"viet": "Các kho ủ thức ăn phải được chứa đầy và trồng cây cỏ cho bò ăn.", "eng": "The silos must be filled, and crops must be planted."}, {"viet": "Mùi thức ăn nấu báo cho họ biết sắp tới bữa rồi.", "eng": "The smell of cooking told them there was a meal in the offing."}, {"viet": "Quân đội dàn quân dọc bờ sông.", "eng": "The soldiers were in array along the riverbank."}, {"viet": "Nửa chừng diễn giả ngưng lại ho, rồi bắt đầu tiếp tục lại.", "eng": "The speaker stopped in midstream, coughed, then started up again."}, {"viet": "Nhà nước là người trọng tài cuối cùng về đạo đức trong những trường hợp này.", "eng": "The state is the final arbiter of morality in these cases."}, {"viet": "Câu chuyện đã kích thích trí tưởng tượng của cậu bé.", "eng": "The story stirred the boy's imagination."}, {"viet": "Việc đệ trình một yêu sách, một kiến nghị, một lời kêu gọi, v. v.", "eng": "The submission of a claim, a petition, an appeal, etc."}, {"viet": "Sườn heo xào chua ngọt, cá chép hấp, cải bắp chua hấp thịt heo, và món vịt đông trùng thảo.", "eng": "The Sweet and Sour Pork Chops, the Steamed Carp, the Steamed Preserved Cabbage and Pork, and the Duck with Chinese Caterpillar Fungus."}, {"viet": "Cô giáo phạt David vì trốn học.", "eng": "The teacher punished David for playing truant."}, {"viet": "Thiên Đàng có nhiều khu, như Đoàn Hoàn Khâu, Hoàng Khung, Bức tường Hồi âm, Hòn đá Tam âm, Cầu Bậc Thềm Đỏ, Điện Kì Niên, Cung Trai, ….", "eng": "The Temple of Heaven includes many parts, such as the Circular Mound Altar, the Imperial Vault of Heaven, the Echo Wall, the Triple Sound Stone, the Red Stairway Bridge, the Hall of Prayer for Good Harvest, the Hall of Abstinence, and so on."}, {"viet": "Thứ ba là Ben-grat, thủ đô của nước Nam Tư.", "eng": "The third is Belgrade, the capital of Yugoslavia."}, {"viet": "Sự phá huỷ hoàn toàn đô thị do động đất.", "eng": "The total destruction of a town by an earthquake."}, {"viet": "Đường quốc lộ xuyên Canada là thuộc trách nhiệm liên bang.", "eng": "The Trans-Canada highway is a federal responsibility."}, {"viet": "Hai chị em sinh đôi hầu như không thể phân biệt được.", "eng": "The twin sisters are almost indistinguishable."}, {"viet": "Hai cái cửa sổ cân xứng.", "eng": "The two windows the in admirable proportion of."}, {"viet": "Việc dùng ngựa kéo cày vẫn còn thịnh hành trong nông dân nghèo.", "eng": "The use of horses for ploughing still prevails among the poorer farmers."}, {"viet": "Dân làng bị bọn kẻ cướp ở trên đồi xuống tiến công.", "eng": "The villagers were preyed on by bandits from the hills."}, {"viet": "Khi tôi mở vòi, nước trở nên lạnh.", "eng": "The water ran cold when I turned the tap on."}, {"viet": "Tất cả đều được tìm thấy trong một cánh đồng.", "eng": "The whole lot were discovered in a field."}, {"viet": "Phát biểu của nhân chứng cho thấy anh có dính líu vào vụ cướp.", "eng": "The witness's statement involves you in the robbery."}, {"viet": "Giải World Series và Super Bowl sẽ thu hút hàng vạn người đến sân vận động và sẽ có nhiều tiếng la hét và hoan hô.", "eng": "The World Series and the Super Bowl will attract tens of thousands of fans to the stadium and there will be much shouting and cheering."}, {"viet": "Thuyền của họ bị cuốn vào thác và va vào đá.", "eng": "Their boat was caught in the rapids, and smashed against the rocks."}, {"viet": "Cái hệ thống bị nhiều lời phê phán sự thực lại có hiệu quả hơn nhiều hệ thống được ca ngợi ở nơi khác.", "eng": "Their much reviled system in fact works far better than many highly praised ones elsewhere."}, {"viet": "Vậy tôi sẽ bố trí sáu bàn cho các ông.", "eng": "Then I'll arrange six tables for you."}, {"viet": "Mái nhà có lỗ thủng rò mưa lọt vào.", "eng": "There's a leak in the roof-the rain's coming in."}, {"viet": "Không thể nào nhầm lẫn được về điều cần phải làm.", "eng": "There's no mistaking what ought to be done."}, {"viet": "Trên các đường phố giao thông nhộn nhịp từ sáng sớm đến tối.", "eng": "There's traffic in the streets from dawn till dusk."}, {"viet": "Không có sự hạn chế nào về việc lựa chọn đề tài cho bài luận của bạn.", "eng": "There are no constraints on your choice of subject for the essay."}, {"viet": "Thường có những người bị lừa tiền.", "eng": "There are usually people to be hustled out of their money."}, {"viet": "Một thái độ bảo thủ ngấm ngầm lan tràn khắp xã hội chúng ta.", "eng": "There is a deep-seated conservatism running through our society."}, {"viet": "Có rượu mùi bạc hà, nước chanh, đá và rượu branđi.", "eng": "There is mint liqueur, lemon juice, ice and brandy."}, {"viet": "Không có chỗ cho ai nữa trong ô tô.", "eng": "There isn't room for anyone else in the car."}, {"viet": "Trong thính giả có lác đác người nước ngoài.", "eng": "There was a sprinkling of foreigners among the audience."}, {"viet": "Số người đến xin việc đông một cách kì lạ.", "eng": "There were an astonishing number of applicants for the job."}, {"viet": "Đây là những phẩm chất làm cho bộ phim trở nên rất khác thường.", "eng": "These are qualities which mark the film as quite exceptional."}, {"viet": "Những bức thư này xếp ngay ngắn ( lộn xộn ).", "eng": "These letters are in alignment ( out of alignment )."}, {"viet": "Hai mắt xích này móc vào nhau.", "eng": "These two pieces of the chain hook together."}, {"viet": "Họ không có cơ sở gì để bắt tôi cả, tôi đã có chứng cớ ngoại phạm.", "eng": "They've got nothing on me-I've got an alibi."}, {"viet": "Họ chủ yếu bận rộn với việc buôn bán.", "eng": "They are mainly occupied with trade."}, {"viet": "Họ tự xây nhà để ở.", "eng": "They built their own houses."}, {"viet": "Họ quyết định cho thuê những căn hộ nhỏ hơn với giá rẻ hơn.", "eng": "They decided to let the smaller flats at lower rents."}, {"viet": "Sau toàn bộ công việc nặng nhọc đó họ cảm thấy mệt mỏi rã rời.", "eng": "They felt weary after all their hard work."}, {"viet": "Họ đã bỏ qua lá đơn của tôi một tháng nay.", "eng": "They have been sitting on my application for a month."}, {"viet": "Họ đã nhấc một tảng đá nặng không cần cố gắng.", "eng": "They lifted the heavy rock without effort."}, {"viet": "Họ không xin lỗi gì cả mà chỉ đưa ra một lời giải thích khô khan về sự chậm trễ đó.", "eng": "They offered no apology, just a dry explanation for the delay."}, {"viet": "Họ đã nhận được nhiều thư bày tỏ thông cảm của những người hảo tâm.", "eng": "They received many letters of sympathy from well-wishers."}, {"viet": "Có lúc chúng biến mất vì nước hoặc nước đá ở chúng bốc hơi.", "eng": "They sometimes disappear because the water or ice in them evaporates."}, {"viet": "Họ bước đi, tay khoác nhau.", "eng": "They walked along with their arms entwined."}, {"viet": "Họ đã bị những người cầm súng đeo mặt nạ bắt giữ.", "eng": "They were held captive by masked gunmen."}, {"viet": "Họ làm việc cực nhọc để chu cấp đầy đủ cho gia đình lớn của họ.", "eng": "They worked hard to provide for their large family."}, {"viet": "Quyển sách này được làm cho thích hợp với nhu cầu của sinh viên.", "eng": "This book is adapted for the needs of students."}, {"viet": "Ô chữ này sẽ thật sự làm mệt đầu óc anh đấy.", "eng": "This crossword will really tax your brain."}, {"viet": "Phòng lớn này có thể thành một sân khấu tuyệt vời.", "eng": "This hall would make an excellent theatre."}, {"viet": "Đây là số 6, vậy số 13 hẳn phải ở bên kia đường.", "eng": "This is Number 6, so Number 13 must be on the opposite side of the street."}, {"viet": "Cái thang máy này hầu như không bao giờ hoạt động tốt.", "eng": "This lift is hardly ever in working order."}, {"viet": "Bức tranh này là bức tôi đăng ký vào cuộc thi mỹ thuật.", "eng": "This painting is my entry for the art competition."}, {"viet": "Căn phòng này trông sẽ càng đẹp hơn sau khi quét vôi lại một chút.", "eng": "This room would look all the better for a spot of paint."}, {"viet": "Lần này ông bị xích tay đưa về Tây Ban Nha.", "eng": "This time he was taken back to Spain in chains."}, {"viet": "Dưới con mắt của một nhà thám hiểm biển sâu, những con vật tỏa sáng trông như những vì sao trên bầu trời đêm.", "eng": "Those that glow look to a deep-sea explorer like stars on a night sky."}, {"viet": "Ngày nay có hàng trăm chất liệu để làm vải vóc và có nhiều loại vải mới được phát minh.", "eng": "Today there are hundreds of materials for clothing, and new ones are being invented."}, {"viet": "Hai ý kiến hoàn toàn tương phản nhau.", "eng": "Two ideas completely antipathetic to each other."}, {"viet": "Cô phục vụ, chúng tôi còn phải đợi món xúp của chúng tôi thêm bao lâu nữa?", "eng": "Waitress, how much longer are we going to wait for our soup?"}, {"viet": "Chúng tôi muốn dùng bữa tối món thịt bò với khoai tây nướng.", "eng": "We'd like to have the steak dinner with baked potato."}, {"viet": "Chúng tôi quá bận ở cơ quan đến nỗi không có thì giờ giành cho một công việc nào khác.", "eng": "We're busy that no one in the office can be spared for any other work."}, {"viet": "Chúng tôi vẫn đang đi tìm những người tài trợ cho kế hoạch phát triển nhà ở.", "eng": "We're still trying to find backers for the housing development scheme."}, {"viet": "Chúng tôi thường nghĩ rằng tự chúng tôi sẽ đi đến đó.", "eng": "We've often thought of going there ourselves."}, {"viet": "Tất cả chúng tôi đều tán thành đề nghị của anh.", "eng": "We are all in sympathy with your proposal."}, {"viet": "Chúng tôi không đi vì một lý do đơn giản là chúng tôi không có khả năng để đi.", "eng": "We aren't going for the simple reason that we can't afford it."}, {"viet": "Chúng ta có thể làm bù mọi việc sau.", "eng": "We can catch up on things."}, {"viet": "Chúng tôi có thể nghe thấy giọng của bọn trẻ ở trong vườn.", "eng": "We could hear the children's voices int he garden."}, {"viet": "Chúng tôi không muốn nghe các ý kiến của anh, hãy bám vào các sự kiện!", "eng": "We don't want to hear your opinions, stick to the facts!"}, {"viet": "Chúng tôi đã nhận được báo giá của ba nhà thầu khác nhau trước khi chấp nhận giá thấp nhất.", "eng": "We got estimates from three different contractors before accepting the lowest."}, {"viet": "Chúng tôi đã đánh giá căn hộ thấp 5000 pao.", "eng": "We had undervalued the flat by 5000 pounds."}, {"viet": "Chúng tôi đã theo đuổi mọi thứ đến cùng.", "eng": "We have pursued everything to the bitter end."}, {"viet": "Chúng tôi trữ một nguồn dự trữ thức ăn ở trong nhà.", "eng": "We keep a large supply of food in the house."}, {"viet": "Chúng tôi đã cố gắng chắp lại các lời kể lại sơ sài để tìm ra sự thật.", "eng": "We managed to piece together the truth from several sketchy accounts."}, {"viet": "Chúng ta phải giáo dục lại dân chúng ( để họ ăn uống một cách có lợi cho sức khoẻ hơn ).", "eng": "We must re-educate people ( to eat more healthily )."}, {"viet": "Chúng ta chịu im Nguồn về nguyên lí hấp dẫn.", "eng": "We owe to Newton the principle of gravitation."}, {"viet": "Chúng tôi đã xem vở kịch một cách riêng rẽ rồi sau đó trao đổi ý kiến với nhau.", "eng": "We saw the play separately and compared notes afterwards."}, {"viet": "Chúng tôi ở với bạn bè, cho nên phí tổn rất ít.", "eng": "We stayed with friends, so our expenses were minimal."}, {"viet": "Chúng tôi muốn được nghe sự giải thích thoả đáng về sự chậm trễ của anh.", "eng": "We want a satisfactory explanation of your lateness."}, {"viet": "Chúng tôi hoàn toàn bị bưng bít không biết gì về kế hoạch của ông ta định bán công ty.", "eng": "We were kept completely in the dark about his plan to sell the company."}, {"viet": "Chúng tôi làm việc không ngừng nghỉ để hoàn thành công việc.", "eng": "We worked around the clock to finish the job."}, {"viet": "Vậy, tốt hơn hết thì tôi nên cẩn thận.", "eng": "Well, I'd better be careful."}, {"viet": "Quái, vậy anh đang nói tiếng địa phương lạ lùng nào vậy?", "eng": "Well, what is that strange dialect you're speaking?"}, {"viet": "Ý kiến của anh về Tổng thống mới thế nào?", "eng": "What's your opinion of the new President?"}, {"viet": "Người ta có thể làm gì với một đứa bé thế này?", "eng": "What are you to do with a child like this?"}, {"viet": "Bạn thấy các chương trình truyền hình của Nhật thế nào?", "eng": "What do you think of Japanese T. V. programs?"}, {"viet": "Cái vật to đỏ kia là gì vậy?", "eng": "What is that big red object over there?"}, {"viet": "Nhà của bạn ở nước bạn như thế nào?", "eng": "What is your home like in your country?"}, {"viet": "Công việc thăm dò của anh đã lật ra được những kết quả gì?", "eng": "What results have your soundings turned up?"}, {"viet": "Nhiệt độ trung bình hôm qua là bao nhiêu?", "eng": "What was the average temperature yesterday?"}, {"viet": "Cô nghĩ khi nào thì ông ấy trở về?", "eng": "When do you think he'll be back?"}, {"viet": "Khi tôi rảo bước trên đường phố, tôi thích ngắm nhìn các cửa sổ trưng bày hàng hoá ở mặt tiền cửa hiệu.", "eng": "When I walk along the street, I like to look at the storefront."}, {"viet": "Khi những cây đào đó nở rộ, toàn bộ hồ nước trở nên đẹp rực rỡ.", "eng": "When the peach trees are in full blossom, the whole lake is dazzling beautiful."}, {"viet": "Khi anh tới thì nó ( chỉ ) vừa mới đi.", "eng": "When you arrived he had ( only ) just left."}, {"viet": "Anh đi đâu vậy Lâu lắm không gặp.", "eng": "Where have you been I haven't seen you in a blue moon."}, {"viet": "Thành phố nào lớn nhất thế giới?", "eng": "Which is the biggest city in the world?"}, {"viet": "Ai đã động vào cái đồng hồ vậy?.", "eng": "Who's been interfering with the clock?."}, {"viet": "Ai sẽ dọn sạch cái chỗ phân mèo trong phòng ngủ đây?", "eng": "Who will clean up the cat's mess in the bedroom?"}, {"viet": "Sao bạn không tìm một tập san?", "eng": "Why don't you get a prospectus?"}, {"viet": "Anh có thể chiếu bộ phim đó cho chúng tôi xem được không?", "eng": "Will you be able to project the film for us?"}, {"viet": "Lốp xe mùa đông tạo ra độ bám tăng lên trong bùn hoặc tuyết.", "eng": "Winter tyres give increased traction in mud or snow."}, {"viet": "Lương của phụ nữ là thấp so với đàn ông khi cùng làm một công việc.", "eng": "Women's salaries are low vis-à-vis what men earn for the same work."}, {"viet": "Ông vui lòng cắt bỏ 1 cm tóc mái của tôi nhé?", "eng": "Would you cut 1 cm off my bangs?"}, {"viet": "Ông có muốn bắt đầu bằng món khai vị không ạ?", "eng": "Would you like to start with an appetizer?"}, {"viet": "Lập chương trình để lên bảng quyết toán.", "eng": "Write a program for producing a balance sheet."}, {"viet": "Phải, Tôi hút khoảng 40 hoặc 50 điếu một ngày.", "eng": "Yes, I smoke about forty or fifty a day."}, {"viet": "Anh nên trữ thông tin này trong một đĩa mềm để dùng đến sau này.", "eng": "You'd better store this information in a diskette for future reference."}, {"viet": "Anh sẽ hiểu hơn vài năm sau này khi anh ta đã có một vài kinh nghiệm.", "eng": "You'll understand better a few years down the line when you've had some experience."}, {"viet": "Đồ ngu, mày treo cái tranh ngược rồi.", "eng": "You've got the picture upside-down, you dope."}, {"viet": "Anh không thể nhét hai mươi người vào một phòng nhỏ như vậy.", "eng": "You can't crush twenty people into such a tiny room."}, {"viet": "Ông quay số “ 1 ” cho đường dài rồi quay mã số vùng.", "eng": "You can dial 1 for long distance and then the code."}, {"viet": "Người ta không thể ra giá cho niềm hạnh phúc được.", "eng": "You can't put a price on happiness."}, {"viet": "Ban ngày hầu như không bao giờ có thể trông thấy cú.", "eng": "You hardly ever see owls in the daytime."}, {"viet": "Bạn biết cách làm mọi thứ mà.", "eng": "You know how to do everything."}, {"viet": "Bạn phải lợi dụng mọi cơ hội để nói tiếng Anh.", "eng": "You must avail yourself of every opportunity to speak English."}, {"viet": "Làm công việc này anh cần phải có nhiều kiên nhẫn.", "eng": "You need a lot of patience to do this work."}, {"viet": "Bạn nên mang theo tiền giấy có mệnh giá thấp khi bạn đi du lịch.", "eng": "You should carry small value bills with you as you travel."}, {"viet": "Cậu có phần nào đã hơi xoắn các đầu mút lại với nhau đấy, mình cảm thấy buồn nôn thế nào ấy.", "eng": "You sort of twist the ends together, I feel sort of queasy."}, {"viet": "Anh không bao giờ đuổi kịp được anh ấy đâu, dù có cố gắng đến mấy.", "eng": "You will never catch him however hard you try."}, {"viet": "Quyết định của ông đặt tôi vào một tình thế khó xử.", "eng": "Your decision puts me in an awkward position."}, {"viet": "Việc học tập của anh sẽ sút kém nếu anh chơi đá bóng nhiều quá.", "eng": "Your studies will suffer if you play too much football."}]