[{"viet": "30 là bội số chung của 2, 3, 5, 6, 10 và 15.", "eng": "30 is a common multiple of 2, 3, 5, 6, 10 and 15."}, {"viet": "Một sự nghiệp lên như diều.", "eng": "A career that took off like gangbusters."}, {"viet": "Một cái đồng hồ được bảo hành một năm về trục trặc máy móc hoặc sai sót kỹ thuật.", "eng": "A clock guaranteed for one year against mechanical failure or faulty workmanship."}, {"viet": "Một quyết định của tòa án hợp pháp hóa lập trường của các người phản đối.", "eng": "A court ruling that legitimized the position taken by the protectors."}, {"viet": "Một nhà độc tài với bàn tay đẫm máu của hắn ta.", "eng": "A dictator with much blood on his hands."}, {"viet": "Một gia đình mang tên một dòng họ danh giá và lâu đời.", "eng": "A family that bore an ancient and honoured name."}, {"viet": "Một hương vị đặc trưng của thức ăn nướng trực tiếp trên ngọn lửa.", "eng": "A flavour peculiar to food cooked on an open fire."}, {"viet": "Cần phải xem xét lại kỹ vấn đề này.", "eng": "A good deal of rethinking is needed on this question."}, {"viet": "Một luồng gió mạnh thổi cánh cửa ra vào đóng sầm lại.", "eng": "A gust of wind blew the door shut."}, {"viet": "Căn nhà có gara được xây dựng bên trong.", "eng": "A house with a built-in garage."}, {"viet": "Một tảng băng lớn đã tách khỏi khối băng.", "eng": "A large piece of ice broke away from the main mass."}, {"viet": "Gây tê tại chỗ để nhổ một cái răng.", "eng": "A local anaesthetic for the removal of a tooth."}, {"viet": "Một gã đàn ông có bụng phệ.", "eng": "A man with rolls of fat around his stomach."}, {"viet": "Một sự lựa chọn từ rất không thích hợp.", "eng": "A most unfortunate choice of words."}, {"viet": "Một tờ báo với lượng phát hành hàng ngày khoảng hơn một triệu bản.", "eng": "A newspaper with a daily circulation of more than one million."}, {"viet": "Một quả đào vỏ phủ đầy lông tơ.", "eng": "A peach skin is covered with fuzz."}, {"viet": "Một vở kịch hoàn toàn được trình diễn bằng điệu bộ.", "eng": "A play acted entirely in mime."}, {"viet": "Một văn phòng riêng dành cho Tổng thống.", "eng": "A private office sacred to the President."}, {"viet": "Một chiến thắng tuyệt vời đầu tiên của đội Đức.", "eng": "A real first for the German team."}, {"viet": "Một miếng lót cao su trong nắp lọ.", "eng": "A rubber seal in the lid of a jar."}, {"viet": "Một quyển sách nghiêm túc thoảng qua hoặc có một chút khôi hài.", "eng": "A serious book with an occasional gleam of humour."}, {"viet": "Một ngôi nhà nhỏ có một khu vườn phía trước.", "eng": "A small house with a garden in front."}, {"viet": "Một dòng suối róc rách trào lên mặt đất.", "eng": "A spring bubbling out of the ground."}, {"viet": "Một món tiền xấp xỉ 500 bảng Anh.", "eng": "A sum in the neighbourhood of £ 500."}, {"viet": "Một bản tường trình về mọi mặt của tình hình dưới chính quyền mới.", "eng": "A three dimensional account of conditions under the new government."}, {"viet": "Một chiến thắng đã làm thay đổi cục diện của cuộc chiến tranh.", "eng": "A victory that changed the complexion of the war."}, {"viet": "Một hộp nữ trang bằng gỗ dát vàng.", "eng": "A wooden jewel-box with a gold inlay."}, {"viet": "Tố cáo công đoàn đã phá hoại các cuộc thương thuyết.", "eng": "Accused the union of torpedoing the negotiations."}, {"viet": "Sau một thời kỳ hòa bình ngắn ngủi, chiến tranh lại bùng nổ trở lại.", "eng": "After a brief peace, fighting broke out again."}, {"viet": "Sau việc thanh tra nhà máy để tìm ra các dấu hiệu về cách làm ăn vô hiệu quả.", "eng": "After inspection of the factory for signs of inefficiency."}, {"viet": "Sau khi cướp xong, bọn côn đồ trốn đi trên chiếc xe đánh cắp.", "eng": "After the hold-up, the gang made their gateway in a stolen car."}, {"viet": "Tất cả 14 người bị thương đã được xuất viện sau đó.", "eng": "All 14 injured were later discharged from hospital."}, {"viet": "Cả sáu chúng tôi nhét vào trong một chiếc xe ôtô bé tí tẹo.", "eng": "All six of us packed into a tiny car."}, {"viet": "Việc cô chọc ghẹo anh chàng Dũng tội nghiệp đã trở thành quá lố rồi đấy.", "eng": "All your teasing of poor Dung is getting beyond a joke."}, {"viet": "Trong số các công viên, những kỳ quan thiên nhiên sau đây có ấn tượng nhất: Kỳ quan thiên nhiên thứ nhất được giới thiệu là Thác Niagara nổi tiếng, thu hút hơn 5 triệu du khách mỗi năm.", "eng": "Among the parks, the following are the most impressive natural wonders: The first to be recommended is the well-known Niagara Falls which attract more than 5 million visitors each year."}, {"viet": "Một cái khui hộp nhỏ tiện lợi.", "eng": "An artful little gadget for opening tins."}, {"viet": "Một người sành sỏi về các bình cổ Hy Lạp.", "eng": "An expert on ancient Greek vases."}, {"viet": "Một vết bẩn khó tẩy trên tấm thảm.", "eng": "An obstinate stain on the carped."}, {"viet": "Một người đàn ông khó chịu quát tháo chửi rủa những người khách lạ.", "eng": "An unpleasant man who snarled abuse at strangers."}, {"viet": "Động vật có thể được huấn luyện thèm ăn vào những thời điểm nhất định.", "eng": "Animals can be conditioned to expect food at certain times."}, {"viet": "Rõ ràng là 40 triệu người đã bỏ hút thuốc đó.", "eng": "Apparently the 40 million gave it up."}, {"viet": "Rau diếp này là cây nhà lá vườn hay là anh mua chúng ở chợ?", "eng": "Are these lettuces home-grown or did you buy them in the market?"}, {"viet": "Bạn đang giễu cợt tôi đấy à?", "eng": "Are you making fun of me?"}, {"viet": "Chả biết có “ nghệ thuật ” hay không, có các cảnh xếch xi không?", "eng": "Art movie or not, were there sex scenes?"}, {"viet": "Khi nàng khóc, mắt nàng nhoà đi.", "eng": "As she cried, her eyes filmed over."}, {"viet": "Những hội viên chưa chính thức không có quyền bầu cử.", "eng": "Associate members do not have the right to vote."}, {"viet": "Với tốc độ anh đang làm việc, anh sẽ chẳng bao giờ xong.", "eng": "At the rate you work, you'll never finish."}, {"viet": "Lá chuối có khả năng diệt khuẩn.", "eng": "Banana leaves have the ability to disinfect."}, {"viet": "Hết sức lo ngại vì quần chúng không còn ủng hộ như trước.", "eng": "Be greatly disquieted by the fall in public support."}, {"viet": "Vì bận bịu nhiều công chuyện khác, tôi chỉ có thể viết cuốn sách của mình từng đợt một.", "eng": "Because of other commitments I can only write my book in fits and starts."}, {"viet": "Ngoài những ngân hàng này ra, công ty Đầu tư và Ủy thác Quốc tế Trung Quốc đã được thành lập vào năm 197.", "eng": "Besides these banks, the China International Trust and Investment Corporation was set up in 197."}, {"viet": "Các ông chủ phải luôn luôn giải quyết các trường hợp vắng mặt.", "eng": "Bosses have to deal with no-shows all the time."}, {"viet": "Anh chị em dường như không bao giờ hòa thuận.", "eng": "Brothers and sisters never seem to agree."}, {"viet": "Nhưng tôi thích những người trong các bài viết của tôi.", "eng": "But I like people in my stories."}, {"viet": "Nhưng chúng ta đã dừng lại vài lần khi tôi chụp hình.", "eng": "But we stopped several times while I took pictures."}, {"viet": "À này, chúng được xưởng hoạ của anh chép lại à?", "eng": "By the way, are they reproduced by your studio?"}, {"viet": "Tôi đưa ông thêm một lát bánh nữa có được không?", "eng": "Can I give you another slice of cake?"}, {"viet": "Chúng ta có thể gặp các công nhân bên ngoài trước được không?", "eng": "Can we see the workers outside first?"}, {"viet": "Cô có thể nhận ra bài hát cho một giọng ôpêra trong đoạn đại hòa tấu này không?", "eng": "Can you pick out the operatic arias quotes in this orchestral passage?"}, {"viet": "Tôi lấy cho bạn một thứ gì đó nhé?", "eng": "Can't I get anything for you?"}, {"viet": "Sự may rủi giữ phần rất quan trọng trong nhiều trò chơi trên bàn cờ.", "eng": "Chance plays a big part in many board games."}, {"viet": "Bệnh dịch tả lan tràn khắp trong quận.", "eng": "Cholera was rampant in the district."}, {"viet": "Sự kinh hoàng khủng khiếp đã xâm chiếm toàn thân cô ta.", "eng": "Cold horror penetrated her whole being."}, {"viet": "Các ý tưởng phức tạp không dễ truyền đạt cho những người không chuyên môn.", "eng": "Complex ideas not easily communicable to non-experts."}, {"viet": "Đóng góp vào tuyển tập các bài viết về những vấn đề môi sinh.", "eng": "Contribute to a symposium on environmental issues."}, {"viet": "Anh có thể hoãn quyết định lại đến tuần tới không?", "eng": "Could you hold off making your decision until next week?"}, {"viet": "Những con số tội phạm lớn nhất trong lịch sử cận đại.", "eng": "Crime figures unsurpassed in recent history."}, {"viet": "Bạn gái của Dave thật hết sẩy.", "eng": "Dave's girl-friend is a bit of all right."}, {"viet": "Tìm thấy niềm vui lớn lao trong chuyện học tập của mình.", "eng": "Derive great pleasure from one's studies."}, {"viet": "Bạn có đi xem Thế Vận Hội ở Sydney không?", "eng": "Did you attend the Olympics in Sydney?"}, {"viet": "Đào cả thửa đất trồng rau sâu xuống hai mai.", "eng": "Dig the whole vegetable plot two spits deep."}, {"viet": "Hãy làm việc đó một cách có hiệu quả.", "eng": "Do it in a businesslike manner."}, {"viet": "Bạn có nghĩ là cha mẹ thật sự hiểu con cái của họ không?", "eng": "Do you believe that parents really understand their children?"}, {"viet": "Các anh có thực đơn bằng tiếng Anh không?", "eng": "Do you have an English one?"}, {"viet": "Mày có biết con bé tối qua ở với hắn không?", "eng": "Do you know the piece he has with last night?"}, {"viet": "Anh có thắc mắc về quyền của tôi được đọc cái này không?", "eng": "Do you question my right to read this?"}, {"viet": "Bạn có nghĩ là bạn có óc hài hước không?", "eng": "Do you think you have a good sense of humor?"}, {"viet": "Lá thư này có cần phải trả lời ngay không?", "eng": "Does the letter demand an immediate answer?"}, {"viet": "Đừng tin những gì hắn nói-đó hoàn toàn là những điều vớ vẩn thôi.", "eng": "Don't believe what he's saying-it's pure bunkum."}, {"viet": "Đừng có xen vào những chuyện không liên quan gì tới mày!", "eng": "Don't interfere in matters that do not concern you!"}, {"viet": "Đừng nhầm tưởng là công việc này sẽ dễ dàng.", "eng": "Don't run away with the idea that this job is going to be easy."}, {"viet": "Đừng lo, tôi sẽ liên hệ với bộ phận bảo vệ ngay.", "eng": "Don't worry, I'll contact the Security Department at once."}, {"viet": "Lái xe với nồng độ rượu trong máu nhiều hơn mức cho phép.", "eng": "Driving with more than the permissible level of alcohol in the blood."}, {"viet": "Tình trạng kinh tế có thể là nguyên nhân tạo nên sự bất ổn trong xã hội.", "eng": "Economic conditions may be responsible for the creation of social unrest."}, {"viet": "Đủ để thỏa mãn tất cả những nỗi khao khát của anh.", "eng": "Enough to satisfy all your desires."}, {"viet": "Mọi học sinh đều dự thi, nhưng chỉ có năm người đỗ.", "eng": "Everybody took the exam, but only five passed."}, {"viet": "Xin lỗi, trong khách sạn có câu lạc bộ thể hình không?", "eng": "Excuse me, is there a Health Club at the hotel?"}, {"viet": "Thất bại không ngăn cản được anh ta toan tính thêm một lần nữa.", "eng": "Failure did not deter him from making another attempt."}, {"viet": "Cảm thấy hơi buồn ngủ sau một bữa ăn trưa nặng bụng.", "eng": "Feeling rather somnolent after a large lunch."}, {"viet": "Trước hết ta hãy học cách sang số.", "eng": "First, let's learn how to shift gears."}, {"viet": "Nhạc dân gian đang được hồi sinh.", "eng": "Folk music is currently enjoying a renaissance."}, {"viet": "Dự đoán ngày mai trời sẽ mưa.", "eng": "Forecast that it will rain tomorrow."}, {"viet": "Kể từ đó, nàng biết rằng nàng sẽ thắng.", "eng": "From then on she knew she would win."}, {"viet": "Có một quan điểm mới về tình hình chính trị.", "eng": "Get a new slant on the political situation."}, {"viet": "Xếp hạng ưu tiên cao cho nghiên cứu y học.", "eng": "Give medical research a high-priority rating."}, {"viet": "Cứ đi thẳng dọc theo đường này đến khi ông đến góc đường.", "eng": "Go straight along the road till you come to the corner."}, {"viet": "Được cha mẹ nhiều tham vọng huấn luyện thành ngôi sao điện ảnh.", "eng": "Groomed for stardom by ambitious parents."}, {"viet": "Có một cái lối đối xử đê tiện với những người khác.", "eng": "Has a grubby way of treating others."}, {"viet": "Cô có đem theo hàng mẫu nào không?", "eng": "Have you brought any samples along with you?"}, {"viet": "Trước đây ông đã từng dùng thức ăn Trung Quốc nào ở đây chưa?", "eng": "Have you had any Chinese food here before?"}, {"viet": "Nó chắc giận điên người nếu nó biết được việc cậu đang làm.", "eng": "He'd be livid if he found out what you're doing."}, {"viet": "Anh ta luôn luôn phô trương kiến thức của mình.", "eng": "He's always making a parade of his knowledge."}, {"viet": "Anh ta rất thạo nấu những bữa ăn ngon mà rẻ tiền.", "eng": "He's expert in cooking good cheap meals."}, {"viet": "Nó không thể thực hiện được trách nhiệm của nó như chúng tôi đã nghĩ.", "eng": "He's not able to cut his responsibilities like we thought."}, {"viet": "Ông ta không có tính quyết đoán để làm một người lãnh đạo giỏi.", "eng": "He's too indecisive to make a good leader."}, {"viet": "Anh ấy luôn luôn thắng các đối thủ của mình về môn cờ vua nhờ ranh ma hơn.", "eng": "He always outfoxes his opponents at chess."}, {"viet": "Ông ta tin ở mọi đấng cứu tinh mới về chính trị.", "eng": "He believes in every new political messiah."}, {"viet": "Nó làm gì mặc xác nó, tôi cóc cần biết.", "eng": "He can go hang for all I care."}, {"viet": "Anh ta tâm sự với tôi rằng anh ta đã xin một việc làm khác.", "eng": "He confided to me that he had applied for another job."}, {"viet": "Anh ấy phàn nàn tính cứng nhắc trong quan điểm của bà ta.", "eng": "He deplored the rigidity of her views."}, {"viet": "Anh ta không biết sự khác biệt giữa cái đúng và cái sai.", "eng": "He doesn't know the difference between right and wrong."}, {"viet": "Anh ta ngồi đối diện với tôi ở bên kia bàn.", "eng": "He faced me squarely across the table."}, {"viet": "Ông ấy đã tha thứ cho cô ta trong giờ phút lâm chung.", "eng": "He forgave her on his deathbed."}, {"viet": "Anh ta gây được ấn tượng mình là người làm việc chăm chỉ.", "eng": "He gives the impression that he works hard."}, {"viet": "Ông ta đã lên được vị trí cao nhất nhờ sống lâu lên lão làng, do vậy mà dường như những chức vụ cao lúc nào cũng có người nắm giữ.", "eng": "He had come out on top in the game of musical chairs by which senior posts seemed to be filled."}, {"viet": "Ông ta quan tâm đến hạnh phúc của anh như một người cha.", "eng": "He has a paternal concern for your welfare."}, {"viet": "Anh ấy đã chuyển từ diễn xuất qua sản xuất phim.", "eng": "He has moved from acting to film production."}, {"viet": "Nó nắm con chuột trong lòng bàn tay.", "eng": "He held the mouse in the palm of his hand."}, {"viet": "Anh ấy bằng lòng tiếp tục công việc hiện tại của mình.", "eng": "He is content to stay in his present job."}, {"viet": "Ông ta là người đứng đầu trong xí nghiệp.", "eng": "He is the senior partner in the firm."}, {"viet": "Nó không biết gì về chất lượng công việc của tôi.", "eng": "He knows nothing of the nature of my work."}, {"viet": "Chẳng bao lâu nữa anh ta sẽ đi học phải không?", "eng": "He'll start school soon, won't he?"}, {"viet": "Mỗi khi nấu nướng anh ấy đều biến nhà bếp thành cái chuồng lợn.", "eng": "He makes a pigsty of the kitchen whenever he does the cooking."}, {"viet": "Anh ta chẳng bao giờ khen vợ: anh ta chỉ coi cô ta đương nhiên là phải như thế.", "eng": "He never praises his wife: he just takes her for granted."}, {"viet": "Anh ta nhấc cái vali nặng lên và loạng choạng bước đi.", "eng": "He picked up the heavy suitcase and set off with a stagger."}, {"viet": "Anh ấy đăng các bài viết trên nhiều tờ báo khác nhau.", "eng": "He publishes articles in various newspapers."}, {"viet": "Ở tuổi của ông ta, ông ta thật sự nên nghỉ ngơi nhiều hơn Đúng như thế.", "eng": "He really ought to take more rest at his age Absolutely."}, {"viet": "Anh ta trở về nhà mệt lử, lem luốc và rét run.", "eng": "He returned home spent, dirty and cold."}, {"viet": "Hắn ta luôn luôn đúng là người có tài thu hút người khác.", "eng": "He's always been a bit of a showman."}, {"viet": "Anh ta có tính khí dữ dội.", "eng": "He's got the devil of a temper."}, {"viet": "Ông ấy đã làm hỏng chiếc xe đạp mới của mình.", "eng": "He's pranged his new bike."}, {"viet": "Ông ấy nói họ đã cưới nhau, nhưng tôi dám chắc là họ chưa.", "eng": "He said they were married, although I'm sure they aren't."}, {"viet": "Anh ta dường như trở thành mất trí.", "eng": "He seems to be quite potty."}, {"viet": "Anh ta rùng mình khi nhìn thấy con vật chết.", "eng": "He shuddered when he saw the dead animal."}, {"viet": "Suốt buổi tối đó ông ta chỉ nói ra hai lời.", "eng": "He spoke only two words the whole evening."}, {"viet": "Ông ấy thả bộ ra vào tùy thích.", "eng": "He strolls in and out as he pleases."}, {"viet": "Anh ấy đã dạy tôi cách lái xe.", "eng": "He taught me how to drive."}, {"viet": "Anh ta đứng gần cửa sổ.", "eng": "He took his stand near the window."}, {"viet": "Nó cố tranh giải nhưng không đạt được.", "eng": "He tries for the prize but did not get it."}, {"viet": "Anh ấy đi ngang qua tôi mà không nói gì cả.", "eng": "He walked past me without speaking."}, {"viet": "Anh ta luôn luôn đưa ra những nhận xét khó chịu đối với việc nấu nướng của chị ấy.", "eng": "He was always making snide remarks about her cooking."}, {"viet": "Anh ta bị mê hoặc bởi sự hoạt bát và tâm hồn cao cả của cô ta.", "eng": "He was charmed by her vivacity and high spirits."}, {"viet": "Nó bị sa thải vì bị bắt quả tang thụt két.", "eng": "He was fired for stealing money from the till."}, {"viet": "Anh ta đang dựa vào cái cây.", "eng": "He was leaning against a tree."}, {"viet": "Ông ta tự quyền tuyên bố trước khi quyết định đó được chuẩn y.", "eng": "He was presumptuous in making the announcement before the decision had been approved."}, {"viet": "Anh ta chơ vơ chẳng biết về đâu.", "eng": "He was stranded in the middle of nowhere."}, {"viet": "Ông ta đang chờ ban lãnh đạo quyết định công việc sắp tới của ông ta sẽ là công việc gì.", "eng": "He was waiting for the powers that be to decide what his next job would be."}, {"viet": "Ông ta sẽ được nhớ tới vì một cuốn sách duy nhất đó.", "eng": "He will be remembered for that one book alone."}, {"viet": "Nó có lẽ đã làm bài thi rất khá, chỉ phải cái tội nó quá hồi hộp.", "eng": "He would probably do well in the examination only he gets very nervous."}, {"viet": "Chào cô, tôi là Martin ở phòng 805 đây.", "eng": "Hello, this is Martin in Room 80."}, {"viet": "Vì nóng, cơ thể cô ta đã mất nước một cách nguy hiểm.", "eng": "Her body had dehydrated dangerously with the heat."}, {"viet": "Những điều mô tả của cô ta về cảnh nghèo khó và đau khổ thật là tàn nhẫn và không thể quên được.", "eng": "Her description of poverty and suffering are unsparing and unforgettable."}, {"viet": "Những móng tay của cô ta đỏ như máu.", "eng": "Her finger-nails were blood-red."}, {"viet": "Chồng cô vẫn đồng cam cộng khổ với cô.", "eng": "Her husband stuck by her in good times and bad."}, {"viet": "Những sở thích chính trong cuộc sống của cô là âm nhạc, quần vợt và nấu ăn.", "eng": "Her main interests in life are music, tennis and cooking."}, {"viet": "Cha mẹ cô ấy đã phải hi sinh nhiều để cô ấy có thể học ở nước ngoài.", "eng": "Her parents made many sacrifices so that she could study abroad."}, {"viet": "Tính cộc cằn của cô ta là điều đáng tiếc nhất.", "eng": "Her rudeness was highly regrettable."}, {"viet": "Việc cô ta ăn cắp ở cửa hàng đã gây ra tai tiếng trong làng.", "eng": "Her theft from the shop caused scandal in the village."}, {"viet": "Đây là những cái váy và áo kiểu của ông.", "eng": "Here are your skirts and blouses."}, {"viet": "Hành động của anh ấy đã làm cho anh được mọi người kính trọng.", "eng": "His actions made him universally respected."}, {"viet": "Thi thể của ông ta được mang về Anh chôn cất.", "eng": "His body was brought back to England for burial."}, {"viet": "Những sai lầm ngớ ngẩn thường xuyên của nó khiến nó trở thành trò cười của cả lớp.", "eng": "His constant blunders made him the laughing-stock of the whole class."}, {"viet": "Những sự thanh minh của anh ta luôn luôn khó có thể tin được.", "eng": "His explanations are always difficult to believe."}, {"viet": "Việc làm báo tự do của anh ta đã thu về cho anh ấy 5000 pao một năm.", "eng": "His freelance work brings in 5000 pounds a year."}, {"viet": "Sự bất tài của ông ta đã đưa công ty gần đến chỗ phá sản.", "eng": "His incompetence has brought the company to the brink of bankruptcy."}, {"viet": "Cách nói năng của anh ta làm thần kinh tôi khó chịu.", "eng": "His manner of talking grates on my nerves."}, {"viet": "Ý kiến ban đầu của ông ta là hay, nhưng khi ông thực hiện kế hoạch thì tai hại.", "eng": "His original idea was good, but his execution of the scheme was disastrous."}, {"viet": "Những ngón tay quờ quạng của anh ta đã tìm ra công tắc đèn.", "eng": "His questing fingers found the light switch."}, {"viet": "Bài nói của ông ta gây nên một sự náo loạn trong buổi họp.", "eng": "His speech caused a flurry at the meeting."}, {"viet": "Tiếng huýt sáo không êm ái của hắn làm thần kinh tôi khó chịu.", "eng": "His tuneless whistling jarred on my nerves."}, {"viet": "Chữ viết của nó xấu đến nỗi đối với tôi nó thật giống như chữ tượng hình.", "eng": "His writing is so bad it just looks like hieroglyphics to me."}, {"viet": "Nếu mọi chuyện ổn cả chúng tôi sẽ có mặt ở đó vào giờ ăn tối.", "eng": "Hopefully, we'll be there by dinner time."}, {"viet": "Tao làm thế nào để cho cái đầu ngu tối của mày hiểu được là chúng ta không có khả năng mua ô tô?", "eng": "How can I get it into your thick skull that we can't afford a car?"}, {"viet": "Làm sao anh biết được tôi có ở đây?", "eng": "How did you get to know that I was here?"}, {"viet": "Hiện giờ chúng ta cách New York bao xa?", "eng": "How far away are we from New York now?"}, {"viet": "Xin vui lòng cho biết ông sẽ ở đây bao lâu?", "eng": "How long will you be staying here, please?"}, {"viet": "Bạn đã dùng hết bao nhiêu cuộn chỉ?", "eng": "How many spools of thread did you use?"}, {"viet": "Chúng ta có bao nhiêu chỗ ngồi?", "eng": "How much seating room do we have?"}, {"viet": "Anh muốn vui chơi với tôi thế nào đều được cả thôi.", "eng": "However you get your jollies is fine with me."}, {"viet": "Tôi muốn thêm thời gian để suy nghĩ kỹ lại những vấn đề đó.", "eng": "I'd like more time to think things over."}, {"viet": "Tôi nghĩ là khoảng 300C.", "eng": "I'd say it's about 30 degrees centigrade."}, {"viet": "Tôi sẽ bảo người làm vườn trồng một ít cây.", "eng": "I'll have the gardener plant some trees."}, {"viet": "Tôi sẽ lấy 3 chai loại này.", "eng": "I'll take three bottles of this, please."}, {"viet": "Tôi bây giờ đã xong hết phần kinh doanh của chuyến du lịch.", "eng": "I'm all through with the business part of my trip now."}, {"viet": "Tôi sẽ đi Canađa vào cuối năm nay.", "eng": "I'm going to Canada at the end of the year."}, {"viet": "Tôi đâu có phải là thủy thủ nên tôi không thể chờ nổi tới đất liền.", "eng": "I'm no sailor and I couldn't wait to reach dry land."}, {"viet": "Tôi sẵn sàng đấu sức với bạn.", "eng": "I'm ready to match my strength against yours."}, {"viet": "Tôi chắc chắn là anh ta sẽ đi, chẳng có gì cản được anh ta.", "eng": "I'm sure he'll go, there's nothing to stop him."}, {"viet": "Không đeo kính, tôi chỉ nhìn được rất gần.", "eng": "I'm very near-sighted without my glasses."}, {"viet": "Tôi đã đến châu Âu hai lần rồi, nhưng tôi chưa bao giờ đến phương Đông cả.", "eng": "I've been to Europe twice, but I've never been to the Orient."}, {"viet": "Tôi không tập tành đã lâu, tôi thực sự không được khoẻ mạnh.", "eng": "I've had no exercise for ages, I'm really out of condition."}, {"viet": "Tôi đã rót nhầm cà phê vào tách của cậu.", "eng": "I've poured coffee into your cup by mistake."}, {"viet": "Tôi đồng ý với anh với một mức nào đó.", "eng": "I agree with you to a certain extent."}, {"viet": "Tôi nhận thức sâu sắc những gì đang xảy ra.", "eng": "I am hip to what's going on."}, {"viet": "Tôi đến sau khi anh ta đã đi.", "eng": "I arrived after he had left."}, {"viet": "Hôm qua tôi mua được một bộ quần áo mới đấy.", "eng": "I bought a new dress yesterday."}, {"viet": "Tôi không thể chịu được khi thấy những con vật bị đau đớn như thế.", "eng": "I can't endure to endure seeing animals suffer like that."}, {"viet": "Tôi không thể chịu nổi mấy cái món trang trí lặt vặt rẻ tiền đó.", "eng": "I can't stand those twee little frills."}, {"viet": "Tôi có thể tiến cử anh ta là một người kế toán cực kỳ giỏi.", "eng": "I can recommend him as an extremely good accountant."}, {"viet": "Tôi không thể hát giọng cao như thế được.", "eng": "I can't sing that high."}, {"viet": "Tôi có thể cảm nhận được sự thù địch giữa họ.", "eng": "I could sense the animosity between them."}, {"viet": "Cho tôi để lại lời nhắn.", "eng": "I'd like to leave a message."}, {"viet": "Tôi không hiểu rõ ( anh nói gì ), anh có thể giải thích lại một lần nữa không?", "eng": "I didn't quite follow ( what you were saying ) could you explain it again?"}, {"viet": "Tôi không cần biết tí nào tới những gì họ nghĩ.", "eng": "I don't give twopence for what they think."}, {"viet": "Tôi không thích vị của loại phó mát này.", "eng": "I don't like the taste of this cheese."}, {"viet": "Tôi không muốn tên tôi bị lôi kéo vào chuyện rác rưởi nhớp nhúa.", "eng": "I don't want my name dragged through the muck."}, {"viet": "Tôi không biết tiền đi đâu hết rồi!", "eng": "I don't know where the money goes!"}, {"viet": "Tôi nghĩ một hay hai tiếng nữa ông ấy mới trở lại.", "eng": "I expect him back in one or two hours."}, {"viet": "Tôi hoàn toàn cụt hứng vì lời phê bình mỉa mai của bà ta.", "eng": "I felt completely squashed by her sarcastic comment."}, {"viet": "Tôi nhận thấy một vài bài thơ của cô ta hơi kỳ cục.", "eng": "I found some of her poems a bit weird."}, {"viet": "Con đã mua nó chỗ người bán khăn giấy dạo tại nhà ga.", "eng": "I got it from the tissue-passer at the station."}, {"viet": "Hồi còn bé tóc tôi xoăn.", "eng": "I had curly hair when I was little."}, {"viet": "Tôi không thích ông chủ đứng giám sát tôi.", "eng": "I hate to have my boss standing over me."}, {"viet": "Tôi tin tưởng tuyệt đối vào khả năng của ông.", "eng": "I have implicit faith in your abilities."}, {"viet": "Tôi có trà và nước giải khát.", "eng": "I have tea and soft drinks."}, {"viet": "Từ tháng bảy năm ngoái, tôi không gặp em gái anh ấy.", "eng": "I haven't seen his sister since last July."}, {"viet": "Tôi nghe nói bạn sắp lập gia đình.", "eng": "I heard you are going to get married."}, {"viet": "Tôi hi vọng cháu chóng khỏe hơn.", "eng": "I hope you feel better soon."}, {"viet": "Tôi biết đó là một mánh khoé nhưng tôi bất chấp.", "eng": "I knew it was a trick, but I bit anyway."}, {"viet": "Tôi để mình bị cám dỗ mua chiếc xe ôtô mới.", "eng": "I let myself be seduced into buying a new car."}, {"viet": "Tôi sẽ trở lại trong chốc lát.", "eng": "I'll be back in a little while."}, {"viet": "Tôi sẽ giới thiệu anh với bất cứ ai.", "eng": "I'll introduce you to anyone."}, {"viet": "Tôi yêu cô ấy vì cả những nhược điểm và những đức tính tốt của cô ấy.", "eng": "I love her for her faults as well as for her virtues."}, {"viet": "Tôi mừng thấy anh đã nêu lên điểm ấy.", "eng": "I'm glad you raised that point."}, {"viet": "Tôi không thích cà rốt lắm.", "eng": "I'm not very fond of carrot."}, {"viet": "Hôm qua tôi đã có một phát hiện lớn trong hiệu sách cũ ấy.", "eng": "I made a great find in that second-hand bookshop yesterday."}, {"viet": "Tôi phải thay cái quần này-nó bị dính dầu.", "eng": "I must change these trousers-they've got oil on them."}, {"viet": "Tôi cần một ít tài trợ cho cuộc kinh doanh mạo hiểm này.", "eng": "I need some financial support for this venture."}, {"viet": "Trước kia tôi biết một gã bị thua sạch tiền vì đánh bạc.", "eng": "I once knew a guy who lost all his money in gambling."}, {"viet": "Tôi hứa sẽ không quấy rầy anh đâu.", "eng": "I promise not to disturb you."}, {"viet": "Thật sự là tôi nghĩ chúng ta nên chờ cho đến ngày mai.", "eng": "I really think we should wait until tomorrow."}, {"viet": "Tôi cuộn ngược lại cuốn băng cát xét đó và vặn cho cô ta nghe tiếng của cô ta.", "eng": "I rewound the cassette and played her voice back to her."}, {"viet": "Ly của anh đã cạn rồi, tôi có thể rót thêm không?", "eng": "I see your glass is empty, can I fill it up?"}, {"viet": "Tôi hét to tên tôi cho thầy giáo nghe.", "eng": "I shouted out my name to the teacher."}, {"viet": "Tôi đề nghị hội đồng nên dùng những giám thị chó để tuần tra ngoài bãi biển.", "eng": "I suggest that the council employ dog wardens to patrol the beach."}, {"viet": "Tôi nghĩ rằng tôi sẽ bỏ qua món cá.", "eng": "I think I'll give the fish course a miss."}, {"viet": "Tôi nghĩ các kế toán sẽ cần nói chuyện với người quản lý trường học.", "eng": "I think the accountants will want to talk to the college administration."}, {"viet": "Tôi nghĩ chiếc ấm pha trà làm bằng bạc, nhưng nó chỉ là đồ mạ.", "eng": "I thought the teapot was silver, but it's only plate."}, {"viet": "Tôi vấp ngã cái rầm xuống sàn.", "eng": "I tripped and felt bang on the floor."}, {"viet": "Tôi chỉ đọc về chúng thôi.", "eng": "I've only read about them."}, {"viet": "Tôi muốn biết cách người ta sinh hoạt trên tàu này.", "eng": "I want to know how people live on this ship."}, {"viet": "Tôi được tiếng chuông nhà thờ đánh thức dậy.", "eng": "I was awakened by the sound of church bells."}, {"viet": "Tôi đã tham dự thế chiến thứ nhất.", "eng": "I was in World War One."}, {"viet": "Tôi choáng người khi tôi nghe thấy tin ông ta chết.", "eng": "I was staggered when I heard of his death."}, {"viet": "Tôi ra ngoài mưa nên bị ướt sũng.", "eng": "I went out in the rain, and got saturated."}, {"viet": "Tôi muốn thoát khỏi các gánh nặng.", "eng": "I wish to be relieved of my responsibilities."}, {"viet": "Tôi thắc mắc không biết cô ta từ đâu đến.", "eng": "I wonder where she comes from."}, {"viet": "Tôi muốn đổi 50.000 đô la.", "eng": "I would like to exchange $ 50,000."}, {"viet": "Tôi không thích ở vào tình cảnh của anh nếu họ phát hiện ra cái anh đang làm.", "eng": "I wouldn't like to be in your shoes if they find out what you're doing."}, {"viet": "Lần sau nó mà đến đây gây rối nữa, tôi sẽ cho nó một trận!", "eng": "If he comes here again and tries to make trouble, he'll get an earful from me!"}, {"viet": "Nếu lật ngược tấm bảng lại, chúng tôi sẽ biết là ông muốn chúng tôi dọn dẹp phòng của ông, thưa ông.", "eng": "If it is turned the other way, we'll know you want us to make up your room, sir."}, {"viet": "Nếu ở trong đó không còn, vậy thì chúng ta đã hết giấy vệ sinh rồi.", "eng": "If there is nothing there, then we are out of toilet paper."}, {"viet": "Nếu anh đưa thêm quá nhiều chú thích vào bài viết, người đọc sẽ chỉ thấy cây mà không thấy rừng.", "eng": "If you add too many notes to the text, the readers won't be able to see the wood for the trees."}, {"viet": "Nếu con không muốn đi dã ngoại do trường tổ chức thì con có thể ngủ trở lại.", "eng": "If you don't want to go on your school trip, you can go back to sleep."}, {"viet": "Anh nên nhớ là Mary lúc nào cũng yêu súc vật cả.", "eng": "If you remember, Mary was always fond of animal."}, {"viet": "Không ai được coi như không biết luật.", "eng": "Ignorance of the law is no excuse."}, {"viet": "Ở nước Anh, dịch vụ y tế do Nhà nước quản lý.", "eng": "In Britain, the health, service is run by the state."}, {"viet": "Ở Hồng Kong, cô có thể tìm thấy bất kỳ nhà hàng dân tộc nào mà cô có thể nghĩ ra đấy.", "eng": "In Hong Kong, you can find any nationality restaurant you can think of."}, {"viet": "Ở một số nước đã trở thành những nước cộng hòa, sự việc không được suôn sẻ vì người dân quen quyết định cho chính họ.", "eng": "In some countries that have become republics things have not gone well because the people were not used to making decisions for themselves."}, {"viet": "Do những nhận xét của anh, chúng tôi đã từ chối đề nghị của cô ấy.", "eng": "In the light of your remarks, we rejected her offer."}, {"viet": "Các ông muốn chúng tôi gửi hàng theo phương thức nào?", "eng": "In what way do you want us to consign the goods to you?"}, {"viet": "Phải chăng cách ứng xử của một người đang trong trạng thái khó khăn là tiêu chuẩn đánh giá đủ tin cậy về tính cách của người đó?", "eng": "Is a person's behaviour under stress a reliable gauge of his character?"}, {"viet": "Đó có phải là cổng được xây vào thời Napoleon không?", "eng": "Is that the one that was built in Napoleon's time?"}, {"viet": "Liệu đây có phải là tiền lương thoả đáng cho một công việc có trách nhiệm như vậy không?", "eng": "Is this a realistic salary for such a responsible job?"}, {"viet": "Thật thích thú khi được ngắm vẻ đẹp tự nhiên của miền quê sau những giờ làm việc dài trong tuần.", "eng": "It's a great pleasure to enjoy the natural beauty of the country after long hours of work of the week."}, {"viet": "Đó là một công việc nặng nề, nhưng tôi đã làm hết sức mình.", "eng": "It's been an uphill job, but I've done my best."}, {"viet": "Thật khó có được thời gian để nghiên cứu ( vấn đề ).", "eng": "It's hard finding time to study ( the subject )."}, {"viet": "Nếu mất việc này thì cũng chẳng hề gì, tôi luôn có thể kiếm được một việc khác.", "eng": "It's no skin off nose if I lose this job, I can always get another one."}, {"viet": "Anh không đến dự liên hoan là có phần xa rời xã hội đấy.", "eng": "It's rather antisocial of you not to come to the party."}, {"viet": "Tổng cộng là 289 nhân dân tệ 60 xu.", "eng": "It's two hundred eighty-nine yuan and sixty fen altogether."}, {"viet": "Cái đó giá 10 pao một mét, à không, quên, nó giá 12 pao một mét kia.", "eng": "It costs 10 pounds per metre, no, scrub that, it costs 12 pounds per metre."}, {"viet": "Nói được vài ngôn ngữ là điều thuận lợi.", "eng": "It is an advantage to speak several languages."}, {"viet": "Cần phải đánh răng cho sạch hết bựa.", "eng": "It is necessary to remove plaque by brushing one's teeth."}, {"viet": "Trời phát ra ánh chớp vừa khi tôi sắp sửa ra đi.", "eng": "It lightninged just as I was about to leave."}, {"viet": "Anh biết đấy, đây là tàu chạy bằng năng lượng hạt nhân.", "eng": "It's a nuclear ship, you know."}, {"viet": "Đây là quy định của nhà hàng.", "eng": "It's the policy of the restaurant."}, {"viet": "Nếu bạn gởi thường thì thư sẽ đi lâu hơn.", "eng": "It takes longer if you send it second-class."}, {"viet": "Trời đã mưa khi chúng tôi bắt đầu cuộc hành trình.", "eng": "It was already raining when we started our journey."}, {"viet": "Không phải là lòng tham mà khát vọng đã đẩy anh ta vào tội lỗi.", "eng": "It was not greed but ambition that drove him to crime."}, {"viet": "Vào thời đó, đàn bà uống rượu trong quán là coi không được.", "eng": "It wasn't quite the done thing for women to drink in pubs in those days."}, {"viet": "Những món hàng có giá trị lớn, nhỏ, không nhiều, v. v.", "eng": "Items of great, little, not much, etc worth."}, {"viet": "John luôn cố gắng lưu tâm tới những người có thể giúp đỡ anh ta về mặt nghiệp vụ.", "eng": "John always tries to cultivate people who might be able to help him professionally."}, {"viet": "Hãy bình tĩnh, kể cho tôi nghe chính xác điều gì đã xảy ra.", "eng": "Just take it easy and tell us exactly what happened."}, {"viet": "Latin là ngôn ngữ sinh ra tiếng Ý và tiếng Pháp.", "eng": "Latin is the parent language of Italian and French."}, {"viet": "Chúng ta hãy cho bấm vé đi.", "eng": "Let's get the tickets punched."}, {"viet": "Hãy gây tiếng ồn thật nhỏ khi ăn.", "eng": "Make the least noise when eating."}, {"viet": "Nhiều người muốn cải tổ chế độ bầu cử nhưng tôi không tin chuyện đó sẽ xảy ra.", "eng": "Many people would like the electoral system to be reformed but I don't believe this will ever come to pass."}, {"viet": "Toán học là khoa học về lượng thuần tuý.", "eng": "Mathematics is the science of pure quantity."}, {"viet": "Chúng ta bắt đầu tại bụng tàu được không?", "eng": "May we start at the bottom of the ship?"}, {"viet": "Phần lớn các cầu thủ bóng đá hàng đầu là những vận động viên bẩm sinh.", "eng": "Most first-class footballers are natural athletes."}, {"viet": "Thưa ông Wilson, tôi đã gọi một số thức ăn Trung Quốc.", "eng": "Mr. Wilson, I have ordered some Chinese food."}, {"viet": "Xe hơi của tôi bị hỏng và do vậy tôi bị chậm trễ.", "eng": "My car broke down and consequently I was late."}, {"viet": "Các bạn đang chơi bóng đá và họ muốn chúng tôi cùng chơi.", "eng": "My friends are playing football and they want us to play too."}, {"viet": "Tôi bắt đầu việc làm mới vào tháng Năm.''Từ nay tới đó anh làm gì?'.", "eng": "My new job starts in May.''What are you doing in the interim?'."}, {"viet": "Nhận định của vợ của tôi về tài nấu nướng của tôi là rất có triển vọng.", "eng": "My wife's verdict on my cooking was very favourable."}, {"viet": "Tin tức đang được truyền đến về một vụ đâm tàu nghiêm trọng ở Xcốt-len.", "eng": "News is coming in of a serious train crash in Scotland."}, {"viet": "Không, nhờ bạn đã chỉ đường cho tôi.", "eng": "No, thanks to the directions you gave me."}, {"viet": "Không ai hiểu tình hình hơn anh.", "eng": "Nobody understands the situation better than you."}, {"viet": "Ngày nay, trẻ con thường thích xem vô tuyến hơn đọc sách.", "eng": "Nowadays, children often prefer watching TV to reading."}, {"viet": "Ồ, nhiều loại phim cao bồi miền tây, hài và ca nhạc.", "eng": "Oh, many kinds: westerns, comedies, musicals."}, {"viet": "Nghĩ kỹ lại tôi thấy rằng xét cho cùng cô ấy có lẽ đúng.", "eng": "On further reflection, I saw that she might be right, after all."}, {"viet": "Một cái nhìn lướt qua mình trong gương là đủ.", "eng": "One glimpse at himself in the mirror was enough."}, {"viet": "Chỉ những người có đầu óc hẹp hòi mời từ chối giúp đỡ.", "eng": "Only somebody with a small mind would have refused to help."}, {"viet": "Mắt chúng tôi không thể nhìn thấu được vào đêm tối.", "eng": "Our eyes could not penetrate the darkness."}, {"viet": "Đồng phục mới của chúng tôi chưa được phát.", "eng": "Our new uniforms haven't been issued yet."}, {"viet": "Hiện giờ nhân viên của chúng tôi đang sửa chữa nó.", "eng": "Our workmen are fixing it now."}, {"viet": "Hành khách được yêu cầu mang theo hành lí.", "eng": "Passengers were asked to take all their baggage with them."}, {"viet": "Nhân dân đã bị hạn chế chỉ còn một quả trứng một tuần.", "eng": "People were rationed to one egg a week."}, {"viet": "Làm ơn uống 2 viên sau mỗi bữa ăn.", "eng": "Please take two tablets after each meal."}, {"viet": "Những cuộc thảo luận chính trị không được sôi nổi lắm.", "eng": "Rather low-powered political discussions."}, {"viet": "Kế đến là bồn cầu bị tắc, và khi tôi dội nước, nước đã tràn ra.", "eng": "Secondly, the toilet is clogged and when I flushed it, it overflew."}, {"viet": "Giá cổ phần tụt nhanh trên thị trường chứng khoán.", "eng": "Share prices tumbled on the stock-market."}, {"viet": "Bà ta luôn gắt gỏng vào buổi sáng sớm.", "eng": "She's always snappy early in the morning."}, {"viet": "Bà ta sắp từ chức.''Thế à? Có chắc không?'.", "eng": "She's going to resign.''Really? Are you sure?'."}, {"viet": "Cô ấy không thuộc loại ( đàn bà ) nói dối.", "eng": "She's not the kind ( of woman ) to lie."}, {"viet": "Nàng đang ở trên gác chuẩn bị sẵn để đi ra ngoài.", "eng": "She's upstairs getting herself ready to go out."}, {"viet": "Cô ấy đoán trước được mọi nhu cầu của mẹ.", "eng": "She anticipates all her mother's needs."}, {"viet": "Nó có thể là một con bé thực là ranh ma khi nó muốn tự làm theo ý mình!", "eng": "She can be a proper little minx when she wants to get her own way!"}, {"viet": "Cô ấy không thể nghĩ được gì, đầu óc cô ấy hoàn toàn xáo động.", "eng": "She couldn't think, her mind was in a complete turmoil."}, {"viet": "Cô ấy chui quân bốn và bốc quân Vua.", "eng": "She discarded a four, and picked up a king."}, {"viet": "Cô ta ngã và bị trật khớp đầu gối.", "eng": "She fell and put her knee out of joint."}, {"viet": "Cô ta làm qua loa công việc ấy và bảo đã làm xong rồi.", "eng": "She gave it a lick and a promise and said she was done."}, {"viet": "Chị ta để đứa con hai tuổi một mình trong nhà hai ngày liền.", "eng": "She had allegedly left he two-year-old daughter alone in the house for two days."}, {"viet": "Cô ta có xuất biểu diễn múa hát thường xuyên ở một hộp đêm của địa phương.", "eng": "She has a regular cabaret spot at a local night-club."}, {"viet": "Cô ấy có sở thích rất rộng rãi về văn học.", "eng": "She has very eclectic tastes in literature."}, {"viet": "Đầu óc cô ấy hết sức căng thẳng và điều đó đang ảnh hưởng đến sức khoẻ cô ta.", "eng": "She is constantly under pressure and it is affecting her death."}, {"viet": "Cô ta lấy ô thọc vào sườn tôi.", "eng": "She jabbed me in the ribs with her umbrella."}, {"viet": "Bà ta sống trong một vùng yên tĩnh ở Yorkshire.", "eng": "She lives in a quiet corner of Yorkshire."}, {"viet": "Cô chuẩn bị hôn lễ cho con gái.", "eng": "She makes up marriage for her daughter."}, {"viet": "Bà ta đặt một chiếc ghế ngồi ở vườn cho chồng.", "eng": "She ordered a garden chair for her husband."}, {"viet": "Chị ấy đã đưa ra nhiều lập luận để bênh vực cho quyền bình đẳng.", "eng": "She put forward a good case for equality."}, {"viet": "Cô ta đúng là một con mọt sách.", "eng": "She's a bit of a bookworm."}, {"viet": "Cô ấy vừa mới mất chồng.", "eng": "She's just lose her husband."}, {"viet": "Mẹ còn nói, bố mẹ chưa bao giờ yêu nhau thật sự.", "eng": "She said you never were really in love."}, {"viet": "Cô ấy lắc cái hộp để xem trong ấy có tiền không.", "eng": "She shook the box to see if there was any money in it."}, {"viet": "Cô ấy để hàng giờ mơ mộng hão huyền về chàng diễn viên yêu thích của cô ấy.", "eng": "She spent hours mooning over her favourite actor."}, {"viet": "Cô ta bước đi trên sàn, sột soạt trong chiếc áo lụa dài.", "eng": "She swished across the floor in her long silk dress."}, {"viet": "Cô ta cố sức lấy lòng ông giám đốc với hi vọng được đề bạt.", "eng": "She tried to ingratiate herself with the director, in the hope of getting promotion."}, {"viet": "Bà ấy muốn làm chủ công việc của mình.", "eng": "She wants to be mistress of her own affairs."}, {"viet": "Cô ấy đẹp, đúng rồi, nhưng cặp mắt cô ấy thiếu sinh động.", "eng": "She was beautiful, certainly, but her eyes lacked animation."}, {"viet": "Con bé đó đã được tiêm một mũi phòng bệnh ho gà.", "eng": "She was given a needle for whooping cough."}, {"viet": "Cô ta bệnh sắp chết, nhưng bây giờ thì đỡ hơn rồi.", "eng": "She was on the danger list, but is much better now."}, {"viet": "Cô ta ăn trộm tiền và họ đã báo cô ta cho cảnh sát.", "eng": "She was stealing money and they reported her to the police."}, {"viet": "Cô ấy rửa tay bằng nước nóng.", "eng": "She washed her hands in hot water."}, {"viet": "Cô ta đã rút lại bức thư chỉ vì thù hằn.", "eng": "She withheld the letter out of sheer vindictiveness."}, {"viet": "Bà ta viết những truyện tình lãng mạn về những người đàn ông giàu có và những phụ nữ xinh đẹp.", "eng": "She writes romances about rich men and beautiful women."}, {"viet": "Chỉ cho tôi bức tranh nào anh vẽ.", "eng": "Show me which picture you drew."}, {"viet": "Chúng tôi không thể mua ô tô mới được, vì không có tiền.", "eng": "Since we've no money we can't buy a new car."}, {"viet": "Chậm chậm nào-em không bắt kịp anh nổi!", "eng": "Slow down-I can't keep up with you!"}, {"viet": "Hiện nay tôi có những công việc tạm thời, ở giữa lại là những khoảng cách dài thất nghiệp.", "eng": "So far I've had temporary jobs with long periods of unemployment between."}, {"viet": "Binh lính phát điên lên vì khổ cực quá sức.", "eng": "Soldiers driven mad by superhuman misery."}, {"viet": "Một vài biện pháp đơn giản được cổ vũ như là một phương thuốc giải quyết tình trạng thất nghiệp.", "eng": "Some nostrum peddled as a cure for unemployment."}, {"viet": "Một số trường học rất xem trọng việc học ngôn ngữ.", "eng": "Some schools put great emphasis on language study."}, {"viet": "Thỉnh thoảng tôi giúp mẹ tôi ở nhà.", "eng": "Sometimes I help my mother in her house."}, {"viet": "Giảm giá đặc biệt cho trẻ em, học sinh...", "eng": "Special reduced rate for children, students, etc."}, {"viet": "Các thống kê cho thấy một xu hướng trái ngược với xu hướng ghi nhận ở các quốc gia khác.", "eng": "Statistics showed a reverse trend to that recorded in other countries."}, {"viet": "Đừng mong kiếm ra một công việc hoàn hảo nữa-đó chỉ là điều tưởng tượng mà thôi.", "eng": "Stop looking for the perfect job-it's just a fantasy."}, {"viet": "Các sinh viên chưa có việc làm sau khi tốt nghiệp.", "eng": "Students without jobs to go to after graduation."}, {"viet": "Hãy hút ở cái ống để rút nước lên.", "eng": "Suck on the tube to draw up the water."}, {"viet": "Các bác sĩ phẫu thuật đang làm việc suốt ngày đêm để cứu sống anh ta.", "eng": "Surgeons are working round the clock to save his life."}, {"viet": "Hãy nghe lời mách nước của tôi và mua ngay những cổ phần này đi.", "eng": "Take my tip from me and buy these shares now."}, {"viet": "Dạy sinh viên cách phê bình thơ.", "eng": "Teaching students how to criticise poetry."}, {"viet": "Bọn khủng bố sẽ không tìm được một nơi trú ẩn an toàn ở đây.", "eng": "Terrorists will not find a safe haven here."}, {"viet": "Đó là một phần của công việc phải thực hiện trong bất cứ trường hợp nào.", "eng": "That's one part of the job done at any rate."}, {"viet": "Con mèo chết tiệt đó đã ăn hết bữa tối của tôi rồi!", "eng": "That darned cat has eaten my supper!"}, {"viet": "Bây giờ chắc là người đưa thư đây!", "eng": "That'll be the postman now!"}, {"viet": "Đó là một đôi giày rất kỳ lạ!", "eng": "That's a very fancy pair of shoes!"}, {"viet": "Nếu có một bữa ăn ngon thì chắc hẳn là bữa này!", "eng": "That was a fine meal if ever there was one!"}, {"viet": "Tai nạn đã qua rồi, vậy hãy quên đi.", "eng": "The accident is behind you now, so forget about it."}, {"viet": "Lợi thế của cơ hội có một việc làm tốt hơn so với sự bất tiện của việc chuyển nhà và rời bỏ bạn bè của mình.", "eng": "The advantage of better job opportunities versus the inconvenience of moving house and leaving one's friends."}, {"viet": "Nghị sĩ quốc hội không rảnh để bình luận hôm qua.", "eng": "The amount of money available for comment yesterday."}, {"viet": "Công trình kiến trúc quan trọng nhất là Nhà hát lớn thành phố.", "eng": "The architect's pièce de résistance was the city Opera House."}, {"viet": "Nhà họa sĩ đã vẽ nụ cười dịu dàng của cô ta một cách hoàn hảo.", "eng": "The artist had rendered her gentle smile perfectly."}, {"viet": "Tự do bản thân của mỗi cá nhân phải được tôn trọng.", "eng": "The autonomy of every individual should be respected."}, {"viet": "Quả bóng nằm ngoài đường biên.", "eng": "The ball is out of touch."}, {"viet": "Nước bể tắm đang tràn ra.", "eng": "The bath water is running over."}, {"viet": "Cái xe đạp này không có phanh-anh đi nó là liều mạng đấy.", "eng": "The bicycle has no brakes-you ride at your peril."}, {"viet": "Những vùng trời xanh mênh mông.", "eng": "The blue expanses of the sky."}, {"viet": "Quyển sách này đầy những thuật ngữ khoa học.", "eng": "The book is full of scientific technicalities."}, {"viet": "Thằng bé vứt bỏ các chỉ dẫn của thầy.", "eng": "The boy casts aside the instruction of his teacher."}, {"viet": "Vẻ rực rỡ của mặt trời mọc trên biển.", "eng": "The brilliance of the sunrise on the sea."}, {"viet": "Chiếc xe buýt sượt qua tôi cách có một phân.", "eng": "The bus just shaved me by an inch."}, {"viet": "Lòng dũng cảm của viên đại uý làm cho họ có thể đẩy lùi cuộc tấn công đột ngột của kẻ thù vào doanh trại.", "eng": "The captain's valour made it possible for them to repel the sudden enemy attack on the camp."}, {"viet": "Ô tô trượt trên một vũng dầu và đâm vào hàng rào.", "eng": "The car skidded on a pool of oil and ran into a fence."}, {"viet": "Con mèo náu mình trong cái rổ.", "eng": "The cat ensconced herself in the basket."}, {"viet": "Nhà vô địch phản công bằng cú đấm tay phải.", "eng": "The champion countered with his right."}, {"viet": "Đứa bé ho nhiều vì thế mẹ nó đi khám bác sĩ.", "eng": "The child had a bad cough, so his mother took him to the doctor."}, {"viet": "Lũ trẻ nhảy cẫng lên mừng được nghỉ thêm một ngày.", "eng": "The children are jumping for joy at the thought of an extra day's holiday."}, {"viet": "Bọn trẻ chạy đi hết sức nhanh xuôi con đường.", "eng": "The children streaked off down the street as fast as they could."}, {"viet": "Nhà thờ nơi mà họ đã dự lễ trong nhiều năm.", "eng": "The church where they had worshipped for years."}, {"viet": "Đồng hồ sắp đánh mười hai giờ trưa.", "eng": "The clock is just going to strike noon."}, {"viet": "Ban giám hiệu áp dụng hành động kỉ luật đối với những sinh năm viên chống đối.", "eng": "The college authorities took disciplinary action against the protesting students."}, {"viet": "Sự thâm nhập đầu tiên của công ty vào thị trường máy tính.", "eng": "The company's first foray into the computer market."}, {"viet": "Công ty sẽ sớm có khả năng thanh toán những khoản vay ngân hàng.", "eng": "The company will soon be able to repay its borrowings from the bank."}, {"viet": "Những sự gò bó của cuộc sống do thu nhập thấp.", "eng": "The constrictions of life on a low income."}, {"viet": "Thành viên của hội đồng không đồng ý kiến, tách ra thành phe tự do và phe bảo thủ.", "eng": "The council members disagreed falling into liberal and conservative camps."}, {"viet": "Tòa án không có quyền xét xử các nhà ngoại giao sống ở xứ này.", "eng": "The court has no jurisdiction over foreign diplomats living in this country."}, {"viet": "Đám đông reo hò khi những ngôi sao điện ảnh tới.", "eng": "The crowd cheered when the film stars arrived."}, {"viet": "Số điện thoại của bộ phận quản lý khách hàng lúc nào cũng bận.", "eng": "The customer support number is always busy."}, {"viet": "Hội tọa đàm họp vào các ngày thứ Sáu.", "eng": "The Debating Society meets on Fridays."}, {"viet": "Gian hàng đã được tân trang lại để cải tiến hoạt động của nó.", "eng": "The dependent was revamped to try to improve its performance."}, {"viet": "Bữa cơm tối đều được tất cả khách khứa khen là rất ngon.", "eng": "The dinner was pronounced excellent by all the guests."}, {"viet": "Bác sĩ yêu cầu bệnh nhân cởi quần áo ra.", "eng": "The doctor asked the patient to strip."}, {"viet": "Con chó đang cào vào cửa để được vào.", "eng": "The dog's scratching at the door to be let in."}, {"viet": "Cửa ra vào mở như thế này này''À, thế à'.", "eng": "The door opens like this.''Oh, I see'."}, {"viet": "Bụi trên giá hiện rõ trong ánh nắng.", "eng": "The dust on the shelf shows up in the sunlight."}, {"viet": "Kết quả tuyển cử là một tai hoạ cho đất nước.''Tôi không muốn nói hoàn toàn như vậy.'.", "eng": "The election result was a disaster for the country.''I wouldn't put it quite like that'."}, {"viet": "Người anh đó không tỏ dấu hiệu bực mình gì cả.", "eng": "The English man showed no singns of his annoyance."}, {"viet": "Những đòi hỏi lớn lao của một chức vụ cao trong chính phủ.", "eng": "The exaction of a senior post in government."}, {"viet": "Đám đông hân hoan đang nhảy múa ngoài đường phố.", "eng": "The exultant crowds were dancing in the streets."}, {"viet": "Những cánh đồng trải dài như những tấm thảm màu xanh loang lổ cây nông nghiệp.", "eng": "The farmlands spread out like green carpets chequered with crops."}, {"viet": "Bộ phim có xen vào những đoạn phim thời sự cũ.", "eng": "The film contained some old newsreel footage."}, {"viet": "Những người lính cứu hoả chiến đấu với ngọn lửa hết sức dũng cảm.", "eng": "The firemen fought the blaze very bravely."}, {"viet": "Trận đấu vòng một giữa đội Aberdeen và đội Barcelona.", "eng": "The first leg of the Cup tie between Aberdeen and Barcelona."}, {"viet": "Những bông hoa trông héo hon trong không khí nóng bức.", "eng": "The flowers looked limp in the heat."}, {"viet": "Con cáo vọt khỏi chỗ nấp và chạy băng qua cánh đồng.", "eng": "The fox broke cover and ran across the field."}, {"viet": "Bọn côn đồ đã cướp một kho hàng và một siêu thị.", "eng": "The gang did a warehouse and a supermarket."}, {"viet": "Đặc tính của tiếng Anh, của lứa tuổi.", "eng": "The genius of the English language, of the age."}, {"viet": "Tín nhiệm được bán cùng với cửa hàng đó.", "eng": "The goodwill is being sold together with the shop."}, {"viet": "Chính phủ đã giảm kinh phí quốc phòng.", "eng": "The government has reduced defence spending."}, {"viet": "Chính phủ muốn tránh chiến tranh bằng mọi giá.", "eng": "The government wanted to avoid war at all costs."}, {"viet": "Chiếc ô tô màu xanh'và'lúc bốn giờ rưỡi'là những cụm từ.", "eng": "The green car and'at half past four'are phrases."}, {"viet": "Các vị khách yên lặng khi bài nói bắt đầu.", "eng": "The guests lapsed into silence when the speech began."}, {"viet": "Cái nóng có thể chịu được về ban đêm nhưng ngột ngạt suốt cả ngày.", "eng": "The heat was tolerable at night but suffocating during the day."}, {"viet": "Cái cầy ngựa kéo ngày nay không còn dùng nữa ở hầu hết các nước châu Âu.", "eng": "The horse-drawn plough is now obsolete in most European countries."}, {"viet": "Trong mười hai giờ của đồng hồ trở lại đúng điểm xuất phát.", "eng": "The hour hand of a clock goes right round in twelve hours."}, {"viet": "Những chiếc xe tải lớn chở hàng đã làm rung cả nền móng ngôi nhà.", "eng": "The huge lorries shook the foundations of the house."}, {"viet": "Sức khỏe ông ta vẫn đang khá hơn.", "eng": "The improvement in his health is being maintained."}, {"viet": "Cuộc thẩm tra có tính phê phán công việc của bà ta.", "eng": "The inquiry was critical of her work."}, {"viet": "Vấn đề thật sự rốt cuộc là sự xung đột giữa cánh tả và cánh hữu.", "eng": "The issue really boils down to a clash between left and right."}, {"viet": "Ông chánh án xét xử cho nguyên cáo thua kiện.", "eng": "The judges decided against the plaintiff."}, {"viet": "Đảng Lao Động sẽ nỗ lực hết sức để giành phần thắng trong cuộc bầu cử.", "eng": "The Labour party are going all out for victory in the election."}, {"viet": "Những con số mới nhất về thất nghiệp góp phần chứng tỏ rằng chính sách của chính phủ thất bại.", "eng": "The latest unemployment figures go to show that government policy isn't working."}, {"viet": "Chữ'g'cứng trong từ'gun'và mềm trong từ'gin'.", "eng": "The letter'g'is hard in'gun'and soft in'gin'."}, {"viet": "Hôm đó con sư tử chỉ giết được có mỗi một con mồi.", "eng": "The lion made only one kill that day."}, {"viet": "Loa phóng thanh thông báo mỗi chuyến máy bay đến sân bay.", "eng": "The loudspeaker announced each airplane as it land at the airport."}, {"viet": "Bà thị trưởng đeo ở cổ một sợi dây chuyền chức vụ.", "eng": "The major wore her chain of office round her neck."}, {"viet": "Cuộc hôn nhân đó chỉ kéo dài một tuần và chẳng hề có động phòng.", "eng": "The marriage lasted only a week and was never consummated."}, {"viet": "Cuộc họp chỉ có thể tổ chức vào tháng mười là sớm nhất.", "eng": "The meeting can't be held until October at the earliest."}, {"viet": "Sữa đã được pha nước cho loãng.", "eng": "The milk had been watered down."}, {"viet": "Sự hiện đại hoá nền công nghiệp đã được thực hiện từng giai đoạn suốt một thời kỳ 20 năm.", "eng": "The modernization of the industry was phased over a 20-year period."}, {"viet": "Bà mẹ ôm đứa con trai nhỏ vào lòng để dỗ nó.", "eng": "The mother held her baby son to her bosom to comfort him."}, {"viet": "Bản nhạc đã phát triển đến cao trào sôi nổi ở chương cuối.", "eng": "The music worked up to a rousing finale."}, {"viet": "Chiếc ôtô mới mua tốn nhiều tiền, nhưng chắc chắn là nó đáng đồng tiền bỏ ra.", "eng": "The new car cost a lot of money, but it's certainly worth it."}, {"viet": "Vở kịch mới thất bại và đem khỏi Broadway sau một tuần.", "eng": "The new play flopped and was taken of Broadway after a week."}, {"viet": "Tin chiến thắng đã gây chấn động khắp thế giới.", "eng": "The news of the victory created a sensation throughout the world."}, {"viet": "Bắc Cực và Nam Cực là hai đối cực.", "eng": "The north Pole and the South Pole are antipodes."}, {"viet": "Những người phản đối các kế hoạch xây dựng một đường xa lộ mới.", "eng": "The objectors to the plans for a new motorway."}, {"viet": "Vị hoàng đế cao niên rất được quí mến.", "eng": "The old king was held in great affection."}, {"viet": "Cửa mở ngỏ để lộ ra một nhà bếp nhếch nhác.", "eng": "The open door revealed an untidy kitchen."}, {"viet": "Trên thực tế chính là người em ông chủ đã nắm quyền điều khiển nhà máy trong nhiều năm.", "eng": "The owner's brother has been in practical control of the firm for years."}, {"viet": "Đảng đang cầm quyền sớm nhận biết như thế nào là sự chịu đựng những lời châm biếm về chính trị.", "eng": "The party in power soon learns what it's like to be on the receiving end of political satire."}, {"viet": "Gia sản anh ta nhận được của cha làm cho anh ta có thể phát triển công việc kinh doanh.", "eng": "The patrimony he received from his father made it possible for him to improve his business."}, {"viet": "Phòng nhân sự không nằm ở tầng này.", "eng": "The Personnel Department isn't on this floor."}, {"viet": "Viên phi công lên phi cơ và ngồi xuống ở buồng điều khiển.", "eng": "The pilot climbed into the aero plane and sat down at the controls."}, {"viet": "Máy bay rời Heathrow đi Orly lúc 12 giờ 35.", "eng": "The plane leaves Heathrow for Orly at 12.35."}, {"viet": "Các đấu thủ nghỉ giữa hai hiệp để lau người cho khô.", "eng": "The players paused to rub down between games."}, {"viet": "Cảnh sát buộc tội anh ta là say rượu và phá rối trật tự công cộng.", "eng": "The police charged him with being drunk and disorderly."}, {"viet": "Công an đã cam đoan một lần nữa với bà ta là con bà được an toàn.", "eng": "The police reassured her about her child's safety."}, {"viet": "Thằng cha tội nghiệp đó rất lo lắng bồn chồn trong cuộc phỏng vấn.", "eng": "The poor chap was a bundle of nerves at the interview."}, {"viet": "Quyền hạn của quan tòa được luật pháp định rõ.", "eng": "The powers of a judge are defined by law."}, {"viet": "Chủ tịch của Hội đồng thương mại.", "eng": "The President of the Board of Trade."}, {"viet": "Vị Thủ tướng đã thừa nhận, hoàn toàn không chính thức, là các cuộc hội đàm đã thất bại.", "eng": "The Prime Minister admitted, strictly off the record, that the talks had failed."}, {"viet": "Vấn đề đó đã làm tôi lo rầu trong nhiều tuần lễ.", "eng": "The problem had been nagging me for weeks."}, {"viet": "Lời hứa hẹn có phần thưởng khiến họ thêm quyết tâm.", "eng": "The promise of the reward might stiffen their resolves."}, {"viet": "Giai đoạn nhộng là giai đoạn ngủ.", "eng": "The pupa stage is the sleepy stage."}, {"viet": "Mấy con thỏ nhảy vọt ra ngay khi chúng tôi vừa mở chuồng.", "eng": "The rabbits popped out as soon as we opened the hutch."}, {"viet": "Lý do tại sao anh ấy bỏ rơi cô ta.", "eng": "The reason why he left her."}, {"viet": "Tiền thuê nhà ngốn mất một nửa số thu nhập của anh ấy.", "eng": "The rent gobbles up half his earnings."}, {"viet": "Trong tình huống như vậy thì đó là kết quả tốt nhất có thể được mong đợi.", "eng": "The result was the best that could be expected in the circumstances."}, {"viet": "Con sông đã dâng lên khoảng vài mét.", "eng": "The river has risen by several metres."}, {"viet": "Người La Mã xây dựng một thành phố lớn trên bờ con sông này.", "eng": "The Romans founded a great city in the banks of this river."}, {"viet": "Rượu rum có nồng độ 30% dưới tiêu chuẩn.", "eng": "The rum is 30% below proof."}, {"viet": "Mức độ chi tiêu của ông ấy-50.000 bảng Anh một năm-làm tất cả chúng tôi kinh ngạc.", "eng": "The scale of his spending-£ 50,000 in a year-amazed us all."}, {"viet": "Tiếng sột soạt của móng tay ai cạo trên bảng.", "eng": "The scrape of somebody's fingernail on a blackboard."}, {"viet": "Do đó mà các đài hoa trông có màu đen.", "eng": "The sepals would therefore look back."}, {"viet": "Con tàu tiếp tục đi theo hướng Đông-Nam.", "eng": "The ship is holding a south-easterly course."}, {"viet": "Môi trường mua sắm trong cửa hàng này rất thân thiện.", "eng": "The shopping environment in this shop is most friendly."}, {"viet": "Con ngựa là cha của nhiều con ngựa đua nổi tiếng.", "eng": "The sire of many successful racehorses."}, {"viet": "Con ốc sên rút vào vỏ của nó.", "eng": "The snail retreated into its shell."}, {"viet": "Anh bắt đầu sớm thì anh sẽ xong việc sớm.", "eng": "The sooner you begin, the sooner you'll finish."}, {"viet": "Sự nhanh chóng hồi phục của anh ta sau vụ tai nạn.", "eng": "The speediness of his recovery from the accident."}, {"viet": "Mã số gọi trực tiếp đến Luân Đôn là 01.", "eng": "The STD code for London is 01."}, {"viet": "Các đường phố đã được quét sạch lá.", "eng": "The streets have been swept free of leaves."}, {"viet": "Kênh Suez nối liền Địa trung hải và Biển Đỏ.", "eng": "The Suez Canal joins the Mediterranean and the Red Sea."}, {"viet": "Chiếc bàn lung lay vì những thanh giằng lỏng lẻo.", "eng": "The table is shaky because the braces are loose."}, {"viet": "Thầy giáo tức giận vì các học sinh cư xử không tốt.", "eng": "The teacher was angry because the children were misbehaving."}, {"viet": "Công suất của cỗ máy đồ sộ này thật kinh người.", "eng": "The terrifying power of the huge machine."}, {"viet": "Ba người đều được giao công việc tuỳ theo những khả năng của riêng họ.", "eng": "The three men were given work according to their respective abilities."}, {"viet": "Hội đồng thành phố sẽ quyết định nơi trồng cây.", "eng": "The town council will decide where to plant the trees."}, {"viet": "Người thủ quỹ đã biển thủ 2000 pao trong số tiền của câu lạc bộ.", "eng": "The treasurer embezzled 2000 pounds of the club's money."}, {"viet": "Hai đối thủ tranh chức vô địch thế giới sẽ gặp nhau trận cuối cùng vào tháng tới.", "eng": "The two contenders for the world championship will meet for a show-down next month."}, {"viet": "Mặt dưới của tảng đá phủ đầy rong biển.", "eng": "The underside of the rock was covered with seaweed."}, {"viet": "Nhiều chính phủ quyết định cùng hợp tác đối với vấn đề này.", "eng": "The various government decided to act in concert over this matter."}, {"viet": "Tính thông tục của thị hiếu, quần áo, cung cách của anh ta.", "eng": "The vulgarity of his tastes, clothes, manners."}, {"viet": "Thời tiết, phong cảnh và yếu tố khác hợp lại làm cho dịp nghỉ ngơi của chúng tôi thành công.", "eng": "The weather, scenery and other things cooperated to make our holiday a success."}, {"viet": "Cả làng xôn xao với tin đó.", "eng": "The whole village was astir with the news."}, {"viet": "Gỗ được giữ yên bằng một cái ê tô.", "eng": "The wood is held in position by a clamp."}, {"viet": "Nhà văn thường làm rắc rối các chủ đề với những tình tiết vụn vặt.", "eng": "The writer often obfuscates the real issues with petty details."}, {"viet": "Cuộc ly hôn của họ là một việc không cần có nghi thức.", "eng": "Their divorce was an unceremonious affair."}, {"viet": "Đề nghị của họ vấp phải sự lên án hầu như của tất cả mọi người.", "eng": "Their proposal met with almost universal condemnation."}, {"viet": "Sau đó những người khác đúc khuôn quanh thép.", "eng": "Then the other men put the forms around the steel."}, {"viet": "Có một chồng báo ở góc kia-anh đã tìm dưới đó chưa?", "eng": "There's a pile of newspapers in the corner-have you looked underneath?"}, {"viet": "Than khóc vì những lỗi lầm đã qua thì phỏng có ích gì.", "eng": "There's no use wailing about mistakes made in the past."}, {"viet": "Tất cả các chòm sao này ở Hoa Kỳ đều nhìn thấy rõ.", "eng": "There are all visible in the United States."}, {"viet": "Ở đế có những đường gờ để làm cho giày bám mặt đất.", "eng": "There are ridges on the soles to help the boots grip the surface."}, {"viet": "Hai con trai tôi kìa ông có đoán được đứa nào là đứa lớn không?", "eng": "There go my two sons, can you guess which is the elder?"}, {"viet": "Ở đằng sau cánh cửa phòng tắm có một túi đựng quần áo cần giặt ủi, ông cứ bỏ đồ cần giặt ủi vào trong đó.", "eng": "There is a laundry bag behind the bathroom door, just put your laundry in it."}, {"viet": "Không có lí do gì để băn khoăn về kết quả.", "eng": "There is no reason to be anxious for the result."}, {"viet": "Có sữa ở trong tủ lạnh đấy.", "eng": "There's some milk in the refrigerator."}, {"viet": "Đã có thêm một thông tin lý thú về những sự kiện đó sau khi tập nhật ký của bà ta được xuất bản.", "eng": "There was an interesting postscript to these events when her private diaries were published."}, {"viet": "Không có một chiếc tắc-xi nào phục vụ tại nhà ga cả.", "eng": "There were no cabs in attendance at the station."}, {"viet": "Những tập đó được gọi là tay.", "eng": "These bundles of pages are called signatures."}, {"viet": "Những đai ốc và bu lông định vị các bánh xe.", "eng": "These nuts and bolts hold the wheels on."}, {"viet": "Chắc chắn họ sẽ thắng!''Vớ vẩn! Họ không có một cơ may nào hết!'.", "eng": "They're bound to win!''Rot! They haven't a chance!'."}, {"viet": "Họ đã trang trí loè loẹt cửa hàng ăn nhưng thức ăn thì không cải tiến.", "eng": "They've tarted up the restaurant but the food hasn't improved."}, {"viet": "Các tế bào nhỏ đến nỗi chỉ nhìn thấy chúng qua kính hiển vi.", "eng": "They are so tiny that no one can see them without a microscope."}, {"viet": "Họ có thẻ phát hành bằng bảng Anh như ông muốn.", "eng": "They can issue it in pounds as you hope to."}, {"viet": "Họ lý sự dài dòng về điều họ nên làm gì.", "eng": "They disputed at great length what they should do."}, {"viet": "Họ đưa ra những lời kể trái ngược nhau về những điều đã xẩy ra.", "eng": "They gave conflicting accounts of what had happened."}, {"viet": "Họ nhận được các đơn đặt hàng ở mức 30 đơn một tiếng đồng hồ.", "eng": "They have orders coming in at the rate of 30 an hour."}, {"viet": "Họ nhìn bức tranh, yên lặng ngưỡng mộ.", "eng": "They looked in silent admiration at the painting."}, {"viet": "Họ làm cô ta khó chịu vì bắt tham dự vào âm mưu.", "eng": "They pestered her to join in the scheme."}, {"viet": "Họ hát lên để giữ vững tinh thần.", "eng": "They sang songs to keep their morale up."}, {"viet": "Họ đứng yên lặng để bày tỏ sự tôn kính đối với bà.", "eng": "They stood in silence as a mark of honour to her."}, {"viet": "Họ lao vào công việc như thể cuộc đời họ phụ thuộc vào đó.", "eng": "They went at the job as if their lives depended on it."}, {"viet": "Họ chỉ còn cách đỉnh 100m thì tai nạn xảy ra.", "eng": "They were only 10 metres off the summit when the accident happened."}, {"viet": "Sự việc không phát đạt về kinh tế như dự báo nghĩ.", "eng": "Things aren't as boomy as forecasters thought they would be."}, {"viet": "Loại lạc đà này được phát hiện ở A-Rập và phía Bắc Châu Phi, đôi khi được gọi là lạc đà một bướu.", "eng": "This camel, found in Arab and northern Africa, is sometimes called a dromedary."}, {"viet": "Cái phát hiện này là một bước phát triển lớn và quan trọng trong khoa y học.", "eng": "This discovery is a quantum leap for medical science."}, {"viet": "Cái nhà này hôm qua mới đặt giá bán.", "eng": "This house only came onto the market yesterday."}, {"viet": "Đây là buổi cuối cùng trong một xêri mười hai buổi hoà nhạc mùa đông này.", "eng": "This is the latest in a series of twelve concerts this winter."}, {"viet": "Thứ vải này rất co dãn.", "eng": "This material has a lot of stretch in it."}, {"viet": "Ảnh này chụp tôi với gia đình đi nghỉ.", "eng": "This photograph shows me with my family on holiday."}, {"viet": "Người đầy tớ này làm công việc chuyên cần.", "eng": "This servant does his work with assiduity."}, {"viet": "Loại véc ni này cho độ bền cao.", "eng": "This varnish provides a durable finish."}, {"viet": "Tuy ốm nặng, ông ta vẫn kiên trì bám lấy sự sống.", "eng": "Though seriously ill, he still clings tenaciously to life."}, {"viet": "Tom cứ cãi nhau với em gái về chuyện ai sẽ dùng xe đạp.", "eng": "Tom keeps squabbling with his sister about who is going to use the bicycle."}, {"viet": "Dưới sự chỉ huy của nhạc trưởng mới, ban nhạc đã tạo được một danh tiếng quốc tế.", "eng": "Under its new conductor, the orchestra has established an international reputation."}, {"viet": "Ông ta có ủng hộ án tử hình không?", "eng": "Was he in favour of the death penalty?"}, {"viet": "Một ngày nào đó trong tương lai chúng tôi sẽ đến đó.", "eng": "We'll go there at some time in the future."}, {"viet": "Chúng tôi sẽ đi dự hội hoá trang vào ngày Halloween.", "eng": "We're going to have a masquerade party on Halloween."}, {"viet": "Chúng ta đã giải quyết vấn đề giá cả, chất lượng và số lượng rồi.", "eng": "We've already settled the question of prices, quality and quantity."}, {"viet": "Chúng tôi sẽ chuyển tiền vào tài khoản của ông ngay khi có thể.", "eng": "We'll make a transfer to your account as soon as possible."}, {"viet": "Ngày mai chúng tôi sẽ đi biển một chuyến.", "eng": "We are going for an outing to the sea tomorrow."}, {"viet": "Chúng tôi băng vết thương cho anh ta nhưng không thể chặn máu đang ứa ra.", "eng": "We bandaged his wound but couldn't stop it bleeding."}, {"viet": "Chúng ta có thể đồng cảm với nhân vật chính của vở kịch này.", "eng": "We can identify with the hero of this play."}, {"viet": "Chúng tôi không thể nhìn thấy đường trong đêm tối đen như mực.", "eng": "We couldn't see our way in the pitch-dark."}, {"viet": "Chúng tôi lên tàu ở Southampton và xuống tàu ở New York một tuần sau đó.", "eng": "We embarked at Southampton and disembarked in New York a week later."}, {"viet": "Năm nay, chúng tôi thất thu mùa quả mâm xôi.", "eng": "We had a poor crop of raspberries this year."}, {"viet": "Chúng ta có đầy đủ chứng cứ về sự nguy hiểm của thuốc lá.", "eng": "We have abundant evidence of the dangers of smoking."}, {"viet": "Chúng ta cần phải suy tính vấn đề ngủ ở đâu.", "eng": "We have to consider the question of where to sleep."}, {"viet": "Ngày mai chúng tôi đi nhưng tôi vẫn chưa bắt đầu xếp hành lí.", "eng": "We leave tomorrow but I haven't begun to pack yet."}, {"viet": "Chúng tôi phải ghi chép ( cho ông chủ ) từng đồng xu tiêu trong chuyến đi làm ăn này.", "eng": "We must account ( to our employer ) for every penny we spend during a business trip."}, {"viet": "Chúng ta phải hoạt động cho quyền bình đẳng của mọi người.", "eng": "We must work for equal rights for everyone."}, {"viet": "Chúng tôi đã lên kế hoạch nhận hàng trước dịp nghỉ lễ dài ngày.", "eng": "We proposed to get the goods before the long holiday."}, {"viet": "Chúng ta sẽ hạ cánh ( xuống sân bay Gatwick ) ngay bây giờ-xin hãy cài dây an toàn.", "eng": "We shall be landing ( at Gatwick airport ) shortly-please fasten your seat-belts."}, {"viet": "Chúng tôi ngừng công việc xây dựng trong thời gian mưa.", "eng": "We suspended the building work during the rain."}, {"viet": "Chúng tôi ngắm nhìn sương mù từ thung lũng bên dưới bốc lên.", "eng": "We watched the mists ascending from the valley below."}, {"viet": "Chúng tôi bị ép mua những chứng khoán vô giá trị.", "eng": "We were shanghaied into buying worthless securities."}, {"viet": "Chúng tôi muốn gửi đến các ông bản đề nghị các dịch vụ mà chúng tôi cung cấp, những thứ mà chúng tôi tin chắc sẽ đáp ứng được yêu cầu của các ông.", "eng": "We would like to submit a proposal of the services we provide, which we are sure will fulfil your requirements."}, {"viet": "À, tôi nghĩ tôi phải đi thôi.", "eng": "Well, I think I should be on my way."}, {"viet": "Rất giỏi toán, sành về nghệ thuật, v. v.", "eng": "Well versed in mathematics, the arts, etc."}, {"viet": "Thật là một câu chuyện giật gân! Nó có đủ các yếu tố của một vở kịch mùi mẫn.", "eng": "What a sensational story! It has all the elements of a soap opera."}, {"viet": "Anh có chứng chỉ hay bằng cấp gì?", "eng": "What certificates or diplomas have you got?"}, {"viet": "Thế thì có can chi đến Sunrise?", "eng": "What does that have to do with Sunrise?"}, {"viet": "Chiếc áo nào thích hợp để đi dự đám cưới?", "eng": "What is the correct dress for a wedding?"}, {"viet": "Cô có loại thứ uống có cồn nào vậy?", "eng": "What kind of alcoholic beverages do you have?"}, {"viet": "Có chuyện gì trục trặc với máy rút tiền tự động vậy?", "eng": "What's wrong with the ATM?"}, {"viet": "Các ông muốn dùng món gì kèm với món thịt bò bít-tết?", "eng": "What would you like to go with your steak?"}, {"viet": "Khi anh ấy mua bức tranh người ta bảo anh ấy đó la tranh của Rubens, nhưng sau đó anh ấy thấy là giả.", "eng": "When he bought the picture he was told it was a Rubens, but he later found out that it was a forgery."}, {"viet": "Khi trời sương mù, tàu hoả hay đến chậm lắm.", "eng": "When it's foggy the trains are late more often than not."}, {"viet": "Khi nhà thám hiểm Tây Ban Nha tên Cortes đến Mê-hi-cô, ông nhận thấy người dân tại đó uống một loại nước gọi là sô-cô-la.", "eng": "When the Spanish explorer Cortes came to Mexico, he found the people there using a drink they called chocolate."}, {"viet": "Bất cứ khi nào tôi nghe các tác phẩm này, tôi đều xúc động sâu sắc đến phát khóc.", "eng": "Whenever I listen to these pieces, I will be deeply moved to tears."}, {"viet": "Cháu phải để quần áo ở đâu cho đến lúc đó?", "eng": "Where should I put my clothes till then?"}, {"viet": "Bạn đã tham quan những vùng nào của nước Pháp?", "eng": "Which parts of France have you visited?"}, {"viet": "Ai là luật sư được thuê trong vụ kiện này?", "eng": "Who are the instructing solicitors in this case?"}, {"viet": "Tại sao cậu lại gật đầu nếu cậu không tán thành?", "eng": "Why are you nodding your head if you disagree?"}, {"viet": "Tại sao cô Joan lại lấy một cái thằng ngu như vậy thì thật tôi không hiểu nổi.", "eng": "Why Joan ever married such an idiot in the first place is beyond me."}, {"viet": "Ông có ra ga đợi ông Brown không?", "eng": "Will you go to the station and look out for Mr Brown?"}, {"viet": "Cậu ấy gật đầu chỉ cho mình chỗ mình nên ngồi.", "eng": "With a nod of his head he indicated to me where I should sit."}, {"viet": "Có tin rằng thủ tướng đã từ chức.", "eng": "Word went out that the Prime Minister had resigned."}, {"viet": "Quý vị có thích dùng món tráng miệng nào không ạ?", "eng": "Would you like anything for your dessert?"}, {"viet": "Ông làm ơn nhấc chân ra khỏi bàn tay tôi được không?", "eng": "Would you mind taking your foot off my hand?"}, {"viet": "Ừ, bố đã rất bận nên không thể đưa con đi xem trận đấu.", "eng": "Yeah, I've been really busy and couldn't take you to a game."}, {"viet": "Vâng, nói chung thì tôi rất thích, nhưng phòng tắm không được sạch lắm.", "eng": "Yes, on the whole I enjoyed it a great deal, but the bathroom is not quite clean enough."}, {"viet": "Cậu sẽ cảm thấy khoẻ khoắn hơn qua một ngày nghỉ.", "eng": "You'll feel all better for ( having had ) a holiday."}, {"viet": "Anh đi lầm đường rồi-Anh cần quay lại đường khác.", "eng": "You're going the wrong way-you need to turn round and go back."}, {"viet": "Anh đã chọn thời gian rất khéo cho kỳ đi nghỉ phép-thời tiết tuyệt đẹp.", "eng": "You've timed your holiday cleverly-the weather's at its best."}, {"viet": "Anh không thể đi đầu trần trong thời tiết này.", "eng": "You can't go out bareheaded in this weather."}, {"viet": "Anh có thể vào tù vì lái xe nguy hiểm.", "eng": "You can go to prison for dangerous driving."}, {"viet": "Bạn có thể kiếm được lợi bỏ ra thêm thời giờ nghiên cứu bài đọc.", "eng": "You could with profit spend some extra time studying the text."}, {"viet": "Ở Úc có nhiều rắn độc, đúng không?", "eng": "You have many poisonous snakes in Australia, right?"}, {"viet": "Ông sẽ tìm thấy chúng ở lối đi số.", "eng": "You'll find them in aisle number five."}, {"viet": "Anh phải thuê người nào đó giám sát dự án.", "eng": "You must employ someone to oversee the project."}, {"viet": "Ông cần giữ một ít nhân dân tệ để sử dụng ở sân bay.", "eng": "You need to keep some RMB for the use at the airport."}, {"viet": "Anh nên nhẹ nhàng hơn với cậu bé đó, nó còn non trẻ.", "eng": "You should go easy on that boy, he's only young."}, {"viet": "Anh hãy cố thuyết phục cô ấy ( đi cùng với chúng ta ).", "eng": "You try and persuade her ( to come out with us )."}, {"viet": "Hôm nay tôi khuyên anh nên ở nhà.", "eng": "You would be well-advised to stay at home today."}, {"viet": "Bản báo cáo rất hay của anh nêu lên nhiều câu hỏi quan trọng.", "eng": "Your interesting report raises several important queries."}]