[{"viet": "Một nhân viên quán rượu hỏi một người khác mới vào muốn uống gì.", "eng": "A barman asks a new guest what he would like to drink."}, {"viet": "Có người đã nói cho tôi biết mọi chuyện.", "eng": "A certain person told me everything."}, {"viet": "Một cuộc nghiên cứu so sánh về hệ thống xã hội của hai nước.", "eng": "A comparative study of the social systems of two countries."}, {"viet": "Một tách trà chắc là ai cũng thích.", "eng": "A cup of tea would be most acceptable."}, {"viet": "Một bác sĩ mà tiết lộ những tin tức kín về bệnh nhân là có thái độ không đúng với nghề nghiệp.", "eng": "A doctor who gives away confidential information about patients is not behaving professionally."}, {"viet": "Một vài người nói rằng chủ nghĩa tư bản sẽ không còn phù hợp trong thế kỉ 21 nữa.", "eng": "A few people say that capitalism is going to become out of date in the 21st century."}, {"viet": "Một lớp sơn mới có thể làm biến đổi hẳn bề ngoài một căn phòng.", "eng": "A fresh coat of paint can transform a room."}, {"viet": "Một bộ trưởng có sẵn sự phục vụ của nhiều viên chức.", "eng": "A government minister commands the services of many officials."}, {"viet": "Lông con nhím chĩa ra phía sau.", "eng": "A hedgehog's spines point backwards."}, {"viet": "Một công việc nếu dám làm thì được trả lương hậu.", "eng": "A job in which enterprise is rewarded."}, {"viet": "Một bài giảng được thêm thắt bằng những trích dẫn tối nghĩa.", "eng": "A lecture larded with obscure quotations."}, {"viet": "Những gái làng chơi sống ở khu vực đó trong thành phố.", "eng": "A lot of whores live in that part of the town."}, {"viet": "Một cánh đồng trồng đầy cỏ.", "eng": "A meadow covered planted with grass."}, {"viet": "Cái nhìn nổi loạn trên gương mặt ai.", "eng": "A mutinous look on one's face."}, {"viet": "Một số lí do khiến chúng tôi phải từ chối lời yêu cầu của ông.", "eng": "A number of considerations have led me to refuse your request."}, {"viet": "Một người ở thành phố thời Trung Cổ sẽ kinh ngạc về các vỉa hè bóng loáng, các đèn đường sáng choang và các cống rãnh thoát nước ngầm của thành phố thời nay.", "eng": "A person from a city of the Middle Ages would marvel at the smooth pavements, the bright street lights, and the hidden sewers of today's cities."}, {"viet": "Một chính sách có nguy cơ làm nền kinh tế mất ổn định.", "eng": "A policy that threatens to destabilize the economy."}, {"viet": "Một đề nghị nhận được không nhiều sự ủng hộ.", "eng": "A proposal that received not much support."}, {"viet": "Một hàng ăn xơi được những tay sành ưa thích.", "eng": "A restaurant favoured by the cognoscenti."}, {"viet": "Một thước tỷ lệ một centimet cho mười kilômét.", "eng": "A scale of ten kilometres to the centimetre."}, {"viet": "Một cửa hiệu với những mốt thời trang mới nhất.", "eng": "A shop well stocked with the latest fashions."}, {"viet": "Một nhận xét khác biệt có tính cách chính trị xã hội của giới cử tri.", "eng": "A sociopolitical snapshot of the electorate."}, {"viet": "Một âm mưu ám sát Tổng thống bị thất bại từ trong trứng nước.", "eng": "A stillborn plot to assassinate the President."}, {"viet": "Một cái khăn bàn có viền thêu.", "eng": "A tablecloth with an embroidered border."}, {"viet": "Một đoàn tàu đỗ trong ga.", "eng": "A train standing in the station."}, {"viet": "Một áo khoác ấm thật sự có ích vào thời tiết lạnh.", "eng": "A warm coat is a real boon in cold weather."}, {"viet": "Một chàng trai trẻ với mái tóc rậm dài xõa trên vai của anh ta.", "eng": "A young man with a thick mane hanging over his shoulders."}, {"viet": "Những hành động phá hoại công trình văn hoá do bọn côn đồ bóng đá gây ra.", "eng": "Acts of vandalism committed by football hooligans."}, {"viet": "Sau thời gian sáu tháng thử việc, cô ấy đã được chính thức xác nhận vào chức vụ của cô ấy.", "eng": "After a six-month probationary period, she was confirmed in her post."}, {"viet": "Sau nhiều lần thí nghiệm, bà quả quyết rằng các tia phải xuất phát từ một nguyên tố chưa ai biết đến.", "eng": "After much experimenting she decided that they must come from an element no one knew about."}, {"viet": "Sau ba năm ở tù anh ta lại được đoàn tụ với vợ và gia đình.", "eng": "After three years in prison he was again united with his wife and family."}, {"viet": "Trừ anh ấy ra, cả gia đình anh ấy đều có tóc đỏ.", "eng": "All his family have red hair except him."}, {"viet": "Tất cả thức ăn đều ngon ngoại trừ món xúp hơi mặn.", "eng": "All the food tastes delicious except that the soup is a little too salty."}, {"viet": "Mặc dù tôi đã về hưu, nhưng công việc tự nguyện giúp tôi vẫn biết được tình hình đang diễn ra.", "eng": "Although I'm retired, voluntary work keeps me in the swim of things."}, {"viet": "Một diễn viên phải có khả năng nhớ được những lời thoại của mình.", "eng": "An actor must be able to memorize his lines."}, {"viet": "Một người ham hít khói thuốc thơm của tẩu.", "eng": "An avid inhaler of aromatic pipe smoke."}, {"viet": "Một kế hoạch tiếp thu công ty này được sắp đặt kém.", "eng": "An ill-conceived scheme to take over the company."}, {"viet": "Ngày nay, một thành phố cổ có tường thành bao bọc là trung tâm của một số thành phố châu Âu.", "eng": "An old walled city is the heart of a number of cities of Europe today."}, {"viet": "Và trong nhiều năm, hầu hết các bút viết bảng đều làm bằng phấn.", "eng": "And for many years almost all backboards crayons were made of it."}, {"viet": "Một vùng khí áp thấp nữa di chuyển từ biển Đại Tây Dương.", "eng": "Another low moving in from the Atlantic."}, {"viet": "Tiếp xúc với người quản lý ngân hàng của ai để vay tiền.", "eng": "Approach one's bank manager for a loan."}, {"viet": "Anh làm toán chia có giỏi không?", "eng": "Are you any good at division?"}, {"viet": "Anh có chắc đây là cách nhanh nhất không?", "eng": "Are you sure this is the quickest way?"}, {"viet": "Là tài xế taxi, anh thực sự hiểu được sinh hoạt xã hội.", "eng": "As a taxi-driver you really see life."}, {"viet": "Theo ý nghĩa trong luật thì bị cáo có tội.", "eng": "As the law reads, the defendant is guilty."}, {"viet": "Đầu tiên người ta coi thường sách in.", "eng": "At first people made fun of printed books."}, {"viet": "Các mục tiêu kiến thức trong chương trình học toàn quốc.", "eng": "Attainment targets in the national curriculum."}, {"viet": "Cơ bản tôi đồng ý về các đề nghị của anh, nhưng có một vài điểm nhỏ tôi muốn bàn lại.", "eng": "Basically I agree with your proposals, but there are a few small points I'd like to discuss."}, {"viet": "Hãy vui vẻ với nhau đi-chỉ lần này thôi.", "eng": "Be pleasant to each other-just this once."}, {"viet": "Trước khi thử giải một câu đố, chúng ta hãy xem xét cách tốt nhất để tiếp cận nó.", "eng": "Before trying to solve the puzzle, let us consider the best way to approach it."}, {"viet": "Viền da những cổ tay áo khoác.", "eng": "Bind the cuffs of a jacket with leather."}, {"viet": "Bánh mì bị hạn chế cho mỗi gia đình một ổ.", "eng": "Bread was rationed to one loaf per family."}, {"viet": "Bọn bụi đời ngủ vạ vật trên hè phố.", "eng": "Bums sleeping rough in the streets."}, {"viet": "Nhưng phải chăng như thế là không công bằng đối với những người vô thần không tin vào Thượng Đế?", "eng": "But isn't it unfair to atheists who don't believer in God?"}, {"viet": "Nhưng ông sẽ mất một phần tiền lãi của ông.", "eng": "But you will lose part of your interest."}, {"viet": "À này, tôi có thể đi đánh bóng giày ở đâu?", "eng": "By the way, where can I have my shoes shined?"}, {"viet": "Tôi có thể để lại lời nhắn cho ông ấy được không?", "eng": "Can I leave him a message?"}, {"viet": "Anh có thể kéo dài thêm chuyến viếng thăm này ít ngày nữa không?", "eng": "Can you extend your visit a few days longer?"}, {"viet": "Ông có thể nhìn thấy con suối dưới ánh mặt trời bên cạnh tảng đá đó không?", "eng": "Can you see a stream in the sun beside the rock?"}, {"viet": "Sự kiểm tra kỹ càng các phế tích phát hiện thêm chứng cớ mới.", "eng": "Careful examination of the ruins revealed evidence."}, {"viet": "Phó mát là một chất rắn; sữa là một chất lỏng.", "eng": "Cheese is a solid; milk is a liquid."}, {"viet": "Đường phố đô thị không phải là chỗ để bạn tới, nếu bạn không thích tiếng ồn hoặc đám đông.", "eng": "City streets are no place to be if you don't like noises or crowds."}, {"viet": "Hãy đến gần lửa đi-chắc anh lạnh thấu xương rồi!", "eng": "Come by the fire-you must be chilled to the marrow!"}, {"viet": "Cách xử sự không hợp tư cách của một công dân đứng đắn.", "eng": "Conduct unworthy of a decent citizen."}, {"viet": "Ho như vậy có thể làm cho vết thương toác ra.", "eng": "Coughing like that might open up your wound."}, {"viet": "Em có thể mở nước nóng cho anh vào bồn tắm được không?", "eng": "Could you run me a hot bath?"}, {"viet": "Cố tạo quan hệ bạn bè với những người quyền thế.", "eng": "Cultivating the friendship of influential people."}, {"viet": "Hãy quyết định xem anh muốn làm gì, đừng bắt chước những người khác.", "eng": "Decide what you want to do, don't just imitate others."}, {"viet": "Mặc dù bề ngoài có vẻ điếc của anh ta, anh ta có thể nghe được từng tiếng.", "eng": "Despite his seeming deafness, he could hear every word."}, {"viet": "Ông tìm văn phòng chúng tôi có khó không?", "eng": "Did you have any trouble finding us?"}, {"viet": "Phân biệt giữa trường hợp này với trường hợp kia.", "eng": "Discriminate between one case from another."}, {"viet": "Làm một việc gì theo lệ thường.", "eng": "Do something as a matter of routine."}, {"viet": "Bạn có ăn trái cây mỗi ngày không?", "eng": "Do you eat fruit every day?"}, {"viet": "Bạn có thức uống gì không có cồn không?", "eng": "Do you have anything non-alcoholic?"}, {"viet": "Anh có thích dáng vẻ của tôi khi mặc đồ màu đỏ không?", "eng": "Do you like the way I look in red?"}, {"viet": "Anh còn cư ngụ ở Luân Đôn không?", "eng": "Do you still live in London?"}, {"viet": "Anh có muốn uống thứ gì ở đâu đó, không?", "eng": "Do you want to drink something somewhere?"}, {"viet": "Chữ viết của anh nghiêng về phía trước hay phía sau?", "eng": "Does your handwriting slope forwards or backwards?"}, {"viet": "Đừng coi thường những cố gắng giúp đỡ của tôi.", "eng": "Don't depreciate my efforts to help."}, {"viet": "Đừng giao xe ô tô cho đến khi nào bạn biết chắc nó có đủ tiền.", "eng": "Don't let him have the car until you've seen the colour of his money."}, {"viet": "Đừng ở bên ngoài trời ẩm ướt.", "eng": "Don't stay outside in the damp."}, {"viet": "Bạn có nghĩ rằng công nghệ sinh học hơi nguy hiểm cho nhân loại không?", "eng": "Don't you think biotechnology is a little dangerous for humankind?"}, {"viet": "Trong thời gian nàng cư ngụ, khu vườn đã được cải biến.", "eng": "During her occupancy the garden was transformed."}, {"viet": "Các dây cáp điện giăng chéo ngang dọc trên khắp vùng quê.", "eng": "Electricity cables erected crisscross over the countryside."}, {"viet": "Ngay cả một đứa trẻ cũng hiểu được cuốn sách đó.", "eng": "Even a child can understand the book."}, {"viet": "Mọi thứ đều phải được chăm lo cẩn thận.", "eng": "Everything has to be taken care of very carefully."}, {"viet": "Việc lưu đày đối với ông ấy thật là sống cũng như chết.", "eng": "Exile was for him a living death."}, {"viet": "Không những còn khuya tôi mới đồng ý với hắn, tôi lại còn bị sửng sốt vì những nhận xét của hắn.", "eng": "Far from agreeing with him, I was shocked by his remarks."}, {"viet": "Trẻ hơn chúng ta 50 tuổi.", "eng": "Fifty years younger than we are."}, {"viet": "Chuẩn bị cho một con tàu trước một cuộc hành trình dài.", "eng": "Fit out a ship before a long voyage."}, {"viet": "Những dấu chân bị trận mưa xóa mất.", "eng": "Footprints washed away by the rain."}, {"viet": "Đẩy mạnh sự phát triển các ngành công nghiệp địa phương.", "eng": "Foster the growth of local industries."}, {"viet": "Có chỗ đứng vững chắc trong ngành công nghiệp.", "eng": "Gain a firm foothold in the industry."}, {"viet": "Lấy thêm phân để bón cho khu vườn đó.", "eng": "Get some more fertilizer for the garden."}, {"viet": "Cho các học sinh một bài thi về môn số học.", "eng": "Give the pupils a test in arithmetic."}, {"viet": "Xin tạm biệt-bây giờ tôi nên đi thôi.", "eng": "Good-bye-I'd better be pushing along now."}, {"viet": "Có một sổ đen những viên chức điều hành mà ông ta muốn sa thải.", "eng": "Had a hit list of executives he wanted fired."}, {"viet": "Bị ám ảnh bởi những bóng ma từ dĩ vãng.", "eng": "Haunted by spectres from the past."}, {"viet": "Bạn có bao giờ ra ngoài khơi câu cá chưa?", "eng": "Have you ever gone sea fishing?"}, {"viet": "Em đã thả con mèo ra khỏi nhà chưa?", "eng": "Have you put the cat out yet?"}, {"viet": "Ông ta sẽ lột da cậu nếu ông ta biết được điều cậu làm.", "eng": "He'll skin you alive if he finds out what you've done."}, {"viet": "Anh đã mời tôi đi chơi nhiều lần rồi.", "eng": "He's asked me out several times already."}, {"viet": "Anh ta có đủ tất cả các bằng cấp cần thiết nhưng về tính khí thì không thích hợp.", "eng": "He's got all the right qualifications but is temperamentally unsuitable."}, {"viet": "Nó mới học được hai tuần, nó vẫn còn lạ nước lạ cái.", "eng": "He's only been at the school two weeks, and he hasn't really found his feet yet."}, {"viet": "Hắn ta rất thô lỗ nhưng rồi hắn lại luôn luôn sẵn sàng giúp đỡ.", "eng": "He's very rude but then again he's always willing to help."}, {"viet": "Anh ấy xin chân trợ lý giám đốc.", "eng": "He applied for the position of assistant manager."}, {"viet": "Ông ta nâng mũi máy bay lên và đã hạ cánh an toàn tốt đẹp.", "eng": "He bought the aircraft's nose up and made a perfect landing."}, {"viet": "Mãi cách đây một tháng nó mới nhìn được và nghe được.", "eng": "He can't see, nor could he hear until a month ago."}, {"viet": "Nó không thể trả lời được câu hỏi.", "eng": "He couldn't answer the question."}, {"viet": "Anh ta không đến sớm như chúng tôi đã mong đợi.", "eng": "He didn't arrive as soon as we'd hoped."}, {"viet": "Anh ta thả một hòn sỏi từ trên cầu xuống và chờ nghe tiếng tõm.", "eng": "He dropped a pebble from the bridge and waited for the plop."}, {"viet": "Hắn quỳ sụp xuống xin tha tội.", "eng": "He fell on his knees and begged for mercy."}, {"viet": "Ông ấy dành hầu hết tiền của mình cho việc từ thiện.", "eng": "He gave away most of his money to charity."}, {"viet": "Anh ấy bị lạc đường trong chuyến đi xa.", "eng": "He got lost on the outward journey."}, {"viet": "Nó đã nhận được tin tức từ một nguồn không rõ xuất xứ trong chính phủ.", "eng": "He had received information from a nameless source in the government."}, {"viet": "Ông ta có một tác phong quản lý ung dung và sẽ chẳng thay đổi lề lối làm việc trừ phi tuyệt đối cần thiết.", "eng": "He has an easygoing managerial style and won't rock the boat unless absolutely necessary."}, {"viet": "Anh ta có những nguồn thông tin bí mật.", "eng": "He has secret channels of information."}, {"viet": "Hắn buộc chúng tôi chấp nhận hắn cùng đi nghỉ cuối tuần.", "eng": "He imposed his presence on us for the weekend."}, {"viet": "Hắn tử tế và chân thiện, dù thái độ khá cục mịch.", "eng": "He is kind and friendly despite his rather bluff manner."}, {"viet": "Anh ấy rõ là một học sinh thông minh nhất mà tôi đã từng dạy.", "eng": "He is without doubt the cleverest student I've ever taught."}, {"viet": "Ông ta đã rời đi ngay vào lúc đó.", "eng": "He left at that very instant."}, {"viet": "Anh ấy trông có vẻ thật thà đó nhưng liệu chúng ta có thể tin anh ấy được không?", "eng": "He looks honest enough but can we trust him?"}, {"viet": "Hắn không có ý hại bất cứ ai cả.", "eng": "He means no harm to anyone."}, {"viet": "Hắn chỉ làm những gì người ta bắt buộc hắn.", "eng": "He only did what was required of him."}, {"viet": "Anh ta thò đầu vào cửa nhìn quanh xem cô ta có trong phòng không.", "eng": "He poked his head round the door to see if she was in the room."}, {"viet": "Anh ấy cho đường vào trà và quấy lên.", "eng": "He put sugar in his tea and stirred it."}, {"viet": "Anh ta suy nghĩ trước khi trả lời câu hỏi của tôi.", "eng": "He reflected before answering my question."}, {"viet": "Ông ta quản lý khắt khe phòng của mình.", "eng": "He runs his department with a heavy hand."}, {"viet": "Anh ta đang ở khách sạn Grand.", "eng": "He's at The Grand Hotel."}, {"viet": "Hắn bất tài; hắn sẽ phải đi thôi.", "eng": "He's incompetent; he'll have to go."}, {"viet": "Anh ta tự dưng nghĩ rằng tôi tung ra những tin đồn về anh ta.", "eng": "He's taken it into his head that I'm spreading rumours about him."}, {"viet": "Nó đã liều cả mạng sống để cứu đứa bé đó.", "eng": "He saved the child at considerable risk to his own life."}, {"viet": "Anh ta đã chui vào một nơi để đọc Edmund Wilson.", "eng": "He settled in to read Edmund Wilson."}, {"viet": "Anh ta đã làm đứa bé bị chết ngạt vì một chiếc gối.", "eng": "He smothered the baby with a pillow."}, {"viet": "Hắn ta bắt đầu hành động như một kẻ đồng tính khi chỉ còn hai chúng tôi.", "eng": "He started acting really fruity when we were alone together."}, {"viet": "Ông ta thành công trong việc khơi dậy mối thiện cảm của cả nước.", "eng": "He succeeded in arousing the nation've sympathy."}, {"viet": "Nó suy nghĩ một lát rồi nói.", "eng": "He thought for a moment and then spoke."}, {"viet": "Nó mếch lòng vì những nhận xét của tôi và ra về.", "eng": "He took umbrage at my remarks and left."}, {"viet": "Anh ấy nóng nảy kéo mạnh cái cà vạt của mình.", "eng": "He twitched nervously at his tie."}, {"viet": "Anh ta muốn làm bác sĩ hoặc đi vào con đường kinh doanh.", "eng": "He wants to be a doctor or to go into business."}, {"viet": "Anh ta điều khiển máy lại thành thạo đến ngạc nhiên.", "eng": "He was astonishing adept of manipulating the big machine."}, {"viet": "Ông ta làm ngơ trước những lời nài nỉ của cô ta.", "eng": "He was deaf to her pleas."}, {"viet": "Ông ta hạ lệnh, người ta nhận lệnh, ông ta là người điều khiển.", "eng": "He was giving orders, and people were taking them, he was on a power trip."}, {"viet": "Nó bị tóm khi chạy ra khỏi ngân hàng.", "eng": "He was nabbed while running out of the bank."}, {"viet": "Ông ấy chịu trách nhiệm xếp hạng đấu thủ thắng giải.", "eng": "He was responsible for placing the winners."}, {"viet": "Anh ta có ảnh hưởng lớn lao tới sự thành công của ban nhạc.", "eng": "He was the driving force behind the band's success."}, {"viet": "Nó đeo một thẻ tròn nhận dạng nơi cổ.", "eng": "He wears an identity disc round his neck."}, {"viet": "Ông ấy muốn biết ông ấy có thể mua ngân phiếu du lịch ở ngân hàng đó không?", "eng": "He wishes to know if he can buy traveller's cheques from the bank?"}, {"viet": "Anh ấy đã vắt quần áo trước khi mắc lên dây phơi cho khô.", "eng": "He wrung the clothes before putting them on the line to dry."}, {"viet": "Những hành động của nàng tương phản hẳn với những lời hứa của mình.", "eng": "Her actions contrast sharply with her promises."}, {"viet": "Hai má của cô bé bắt đầu phúng phính.", "eng": "Her cheeks began to fill out."}, {"viet": "Người con gái lớn, người mà bà ta đặt nhiều tin tưởng, đã không làm được như bà ta mong muốn.", "eng": "Her elder daughter, in whom she placed the greatest trust, failed to match her expectations."}, {"viet": "Đức tính lớn nhất của cô ta là lòng tốt.", "eng": "Her greatest attribute was her kindness."}, {"viet": "Lòng đố kỵ của cô ấy là động cơ chính cho cốt truyện cuốn tiểu thuyết.", "eng": "Her jealousy is the mainspring of the novel's plot."}, {"viet": "Tên của cô ta đã bị gạch bỏ khỏi danh sách.", "eng": "Her name had been scratched out of the list."}, {"viet": "Lối nói buồn tẻ của cô ta làm hỏng một bài diễn văn đúng ra là hay.", "eng": "Her poor delivery spoilt an otherwise good speech."}, {"viet": "Mắt cô ấy bị sưng húp.", "eng": "Her skin is puffy round her eyes."}, {"viet": "Quan điểm của bà ta về trẻ em khá lạ lùng.", "eng": "Her views on children are rather outlandish."}, {"viet": "Vé của ông và tiền thối lại đây.", "eng": "Here's your ticket and change."}, {"viet": "Sự xuất hiện của ông ấy là đối tượng cho sự chỉ trích.", "eng": "His appearance was the subject for some critical comment."}, {"viet": "Công việc làm ăn của anh ta thất bại, anh ta đã cầm cố tất cả gia sản của mình để cố gắng cứu lấy nó.", "eng": "His business is failing, he's mortgaged all his assets to try to save it."}, {"viet": "Tật điếc của anh ta đã tách biệt anh ta với cuộc sống của những người khác.", "eng": "His deafness shuts him off from the lives of others."}, {"viet": "Mặt anh ta bừng bừng vì sự kích động.", "eng": "His face was all ablaze with excitement."}, {"viet": "Cái thói quen chơi nhạc ầm ĩ của anh ta vào ban đêm làm cho hàng xóm láng giềng không ưa anh ta.", "eng": "His habit of playing loud music at night didn't endear him to the neighbours."}, {"viet": "Nhận định của ông ta đã bị thiên lệch vì lợi ích riêng tư.", "eng": "His judgement was warped by self-interest."}, {"viet": "Tâm trạng của anh ta thay đổi rất đột ngột mới phút trước còn vui vẻ, phút sau đã kêu ca đủ thứ.", "eng": "His moods change very quickly, one moment he's cheerful, and the next he's complaining about everything."}, {"viet": "Thành tích của ông ta trong kỳ thi không đủ tiêu chuẩn.", "eng": "His performance in the test was not good enough."}, {"viet": "Câu trả lời của nó nửa thật nửa đùa.", "eng": "His reply was taken half seriously, half in jest."}, {"viet": "Chuyện của nó không thể tin được theo nghĩa đen của từ đó.", "eng": "His story is incredible in the literal sense of the word."}, {"viet": "Ngón chơi violon của anh ta tôi nghe khá là nghiệp dư.", "eng": "His violin playing sounds pretty amateur to me."}, {"viet": "Dừng lại một phút cho tôi thở cái đã.", "eng": "Hold on a minute while I get my breath back."}, {"viet": "Hàng giờ hôn hít vuốt ve nhau trên băng sau xe ôtô.", "eng": "Hours of smooching in the back seat of the car."}, {"viet": "Làm thế nào để chúng ta có thể giành được sự ủng hộ của quần chúng?", "eng": "How can we win the allegiance of the masses?"}, {"viet": "Việc làm bán thời gian ở Nhật Bản khác với việc làm bán thời gian ở nước bạn như thế nào?", "eng": "How do part-time jobs in Japan differ from those in your country?"}, {"viet": "Anh tử tế quá cô ta nói một cách mỉa mai khi hắn ta để cửa đóng sầm trước mặt cô ta.", "eng": "How kind of you the said sarcastically when he let the door slam in her face."}, {"viet": "Bạn đã đến bao nhiêu nước?", "eng": "How many countries have you been to?"}, {"viet": "Giá các ông đưa ra là bao nhiêu vậy?", "eng": "How much are you asking for it?"}, {"viet": "Bạn tập luyện bao lâu một lần vậy?", "eng": "How often do you work out?"}, {"viet": "Sự đói khát và bệnh tật đã làm suy nhược thể chất hắn.", "eng": "Hunger and disease had weakened his constitution."}, {"viet": "Tôi muốn mời ông đến dùng bữa tối vào thứ sáu này.", "eng": "I'd like to invite you to dinner this Friday."}, {"viet": "Tôi sẽ gọi điện cho ngân hàng để ngưng ngay việc chuyển tiền.", "eng": "I'll call the bank to stop the transfer immediately."}, {"viet": "Tôi sẽ phải đi sớm để tránh giờ cao điểm.", "eng": "I'll leave early so as to dodge the rush-hour."}, {"viet": "Hôm nay tôi viết thư để anh ta có thể biết lúc nào chúng ta đến.", "eng": "I'll write today so that he may know when to expect us."}, {"viet": "Tôi lo ngại là họ có thể đã đi lạc.", "eng": "I'm concerned that they may have got lost."}, {"viet": "Tôi sẽ chấm những đường xước này bằng một chút sơn để hoàn chỉnh.", "eng": "I'm going to touch up those scratches with a bit of paint."}, {"viet": "Tôi không đến đó nữa, họ tính tôi một tách cà phê đến 1 bảng Anh!", "eng": "I'm not going there again-they charged me £ 1 for a cup of coffee!"}, {"viet": "Xin lỗi tôi là người xa lạ trong thành phố này.", "eng": "I'm sorry, but I'm a stranger in this city."}, {"viet": "Tôi ngạc nhiên thấy một số những ngôi nhà rẻ tiền đó vẫn còn đứng vững được.", "eng": "I'm surprised some of those cheap houses stay up at all."}, {"viet": "Tôi xưa nay vốn ghét dậy sớm.", "eng": "I've always had an aversion to getting up early."}, {"viet": "Tôi đã vẽ cái đó đại khái để anh có chút khái niệm là nó như thế nào.", "eng": "I've drawn it in rough, to give you some idea of how it looks."}, {"viet": "Tôi phải chải đầu nữa thôi, còn ngoài ra tôi đã sẵn sàng rồi.", "eng": "I've just got to comb my hair, but otherwise I'm ready."}, {"viet": "Tôi đã mang đi đại tu chiếc máy đánh chữ của tôi.", "eng": "I've taken my typewriter in for an overhaul."}, {"viet": "Tôi luôn luôn đến nhà bố mẹ tôi vào đêm Giáng sinh.", "eng": "I always go to my parents'house on Christmas Eve."}, {"viet": "Tôi chắc chắn là tôi đã đưa cho anh địa chỉ của anh ấy rồi.", "eng": "I am positive that I gave you his address."}, {"viet": "Tôi yêu cầu người đối diện vui lòng mở cửa.", "eng": "I asked the man opposite if he would open the door."}, {"viet": "Tôi mua đủ đồ tạp hóa dùng cho cả tuần.", "eng": "I buy enough groceries for the whole week."}, {"viet": "Mình không thể nào nghe rađiô thật rõ được, cậu có thể vặn to lên một tí được không?", "eng": "I can't hear the radio very well, could you turn it up a bit?"}, {"viet": "Tôi hết sức yêu cô cháu của tôi.", "eng": "I can't help doting on my grand daughter."}, {"viet": "Tôi không thể tưởng tượng được nó lại muốn hại chúng ta.", "eng": "I cannot conceive that he would wish to harm us."}, {"viet": "Tôi tóm được anh chàng tọc mạch đó đang đọc nhật ký của tôi.", "eng": "I caught that Nosey Parker reading my diary."}, {"viet": "Tôi không có ý nghĩ là để cho anh nhận lấy sự khiển trách.", "eng": "I couldn't think of letting you take the blame."}, {"viet": "Tôi thừa nhận anh là người Anh, nhưng anh vẫn cần một hộ chiếu để chứng minh chứ.", "eng": "I dare say you are British but you still need a passport to prove it."}, {"viet": "Tôi không cố tình làm ông bực mình.", "eng": "I didn't mean to upset you."}, {"viet": "Tôi không hiểu làm sao mà cô chịu đựng được người đàn ông ấy lâu như vậy.", "eng": "I don't know how you stuck that man for so long."}, {"viet": "Tôi không hiểu tại sao tôi lại phải giúp cô ta-cô ấy có thể tự mình gánh lấy một chút hậu quả của mình.", "eng": "I don't see why I should help her-she can stew in her own juice for a bit."}, {"viet": "Tôi không muốn tác động đến anh theo hướng này hay hướng khác, vì vậy tôi sẽ không nói với anh ý kiến của tôi.", "eng": "I don't want to influence you either way, so I won't tell you my opinion."}, {"viet": "Tôi không nghĩ là Jimmy nó nghĩ như vậy.", "eng": "I don't think Jimmy would say so."}, {"viet": "Tôi cảm thấy cần nói chuyện với anh về chuyện đó.", "eng": "I feel a need to talk to you about it."}, {"viet": "Tôi cho là anh muốn gặp tôi về việc này.", "eng": "I figured that you'd want to see me about it."}, {"viet": "Tôi cho anh ta một gợi ý khác, nhưng anh ta vẫn không nhận ra câu trả lời.", "eng": "I gave him another clue, but he still didn't twig the answer."}, {"viet": "Tôi đoán bà ta khoảng 40 tuổi.", "eng": "I guess she was about 4."}, {"viet": "Tôi may mắn gặp hắn ở nhà.", "eng": "I had the luck to find him at home."}, {"viet": "Tôi có một việc làm bán thời gian.", "eng": "I have a part-time job."}, {"viet": "Tôi không nghi ngờ gì về khả năng anh thành công.", "eng": "I have no doubt that you will succeed."}, {"viet": "Tôi sắp xếp việc lau nhà theo từng ngày một cho đến khi người quét dọn thường lệ trở lại.", "eng": "I have to organized the cleaning on a day-to-day basis, until the usual cleaner returns."}, {"viet": "Bao năm nay tôi không gặp hắn.", "eng": "I haven't seen him in years."}, {"viet": "Tôi hy vọng tôi không làm điều gì ngu ngốc để hỏng việc.", "eng": "I hope I do not do something stupid and botch it."}, {"viet": "Tôi phản ứng tự nhiên giơ tay lên để che mặt.", "eng": "I instinctively raised my arm to protect my face."}, {"viet": "Tôi biết tôi đang đứng gần ngăn kéo để tiền khi ông quay vào cửa hàng, nhưng xin đừng vội kết luận.", "eng": "I know I was standing near the till when you came back into the shop, but don't jump to conclusions."}, {"viet": "Tôi thích hầu hết các thành phố, nhưng đối với tôi New York là đẹp nhất.", "eng": "I like most cities, but for me New York is the tops."}, {"viet": "Mười phút nữa tôi sẽ gọi điện lại.", "eng": "I'll call back in ten minutes."}, {"viet": "Lúc nào tôi rảnh rỗi tôi sẽ gọi lại điện thoại.", "eng": "I'll return the call at my leisure."}, {"viet": "Tôi sợ rằng tôi đã hoàn toàn quên chuyện đó.", "eng": "I'm afraid I totally forgot about it."}, {"viet": "Tôi chưa tìm được cái ví của tôi.", "eng": "I'm having trouble finding my wallet."}, {"viet": "Tôi lấy làm tiếc, ông ấy đang có điện thoại.", "eng": "I'm sorry, but he's on the phone."}, {"viet": "Tôi đã gỡ mình ra khỏi tình thế đó bằng cách nói dối một chút.", "eng": "I managed to extricate myself from the situation by telling a small lie."}, {"viet": "Chắc rằng tôi đã hiểu nhầm ý ông.", "eng": "I must have mistaken your meaning."}, {"viet": "Tôi cần anh đưa cho tôi cái vòi đó khi tôi yêu cầu.", "eng": "I need you to hand me the hose when I ask for it."}, {"viet": "Tôi đã ăn quá nhiều trong bữa tiệc ngày hôm qua và đã bị chứng khó tiêu.", "eng": "I over eat at the party yesterday and got violent indigestion."}, {"viet": "Tôi hỏi cô giáo về bài tập cô giao cho chúng tôi.", "eng": "I question the teacher about the work she had given us."}, {"viet": "Tôi đề nghị ông nên tham quan Cố Cung.", "eng": "I recommend you visit the Imperial Palace."}, {"viet": "Tôi gửi tiền tiết kiệm ở Hội xây dựng Brighton.", "eng": "I save with the Brighton Building Society."}, {"viet": "Tôi sẽ làm những gì tôi thích.", "eng": "I shall do as I please."}, {"viet": "Đôi khi tôi nghĩ người thư ký của tôi là người điều hành công ty.", "eng": "I sometimes think my secretary runs the firm."}, {"viet": "Tôi ngờ là anh ta có những động cơ sâu kín để hào phóng đến như thế.", "eng": "I suspect he may have had ulterior motives for being so generous."}, {"viet": "Tôi nghĩ tôi trong tình trạng quá mệt mỏi không còn thương cảm được nữa, tôi không còn thấy quan tâm gì tới chương trình này.", "eng": "I think I must have compassion fatigue, i just can't get interested in this programme."}, {"viet": "Tôi nghĩ là chúng ta đã bàn hết mọi khía cạnh của đề tài đó rồi.", "eng": "I think we've just about exhausted that subject."}, {"viet": "Tôi bảo họ một cách dứt khoát là đi đi.", "eng": "I told them in no uncertain terms to buzz off."}, {"viet": "Tôi biết là rồi anh sẽ hoàn trả món nợ này trong vòng 30 này.", "eng": "I understand that you will repay this loan in 30 days."}, {"viet": "Tôi mướn nó trong ba năm.", "eng": "I want it for three years."}, {"viet": "Tôi muốn đi một chuyến du ngoạn trên biển vòng quanh thế giới.", "eng": "I want to take an around-the-world cruise."}, {"viet": "Tôi sững người trước tin tai nạn ấy.", "eng": "I was devastated by the news of the crash."}, {"viet": "Tôi không hề muốn gia nhập quân đội.", "eng": "I was never meant for the army."}, {"viet": "Tôi mới ở đó có hai ngày đã bị ỉa chảy.", "eng": "I was there for only two days before I was struck down with the Aztec two-step."}, {"viet": "Tôi sẽ đến nếu không có gì trở ngại.", "eng": "I will come if nothing intervenes."}, {"viet": "Tôi cảm thấy hơi khó chịu khi thức dậy.", "eng": "I woke up feeling rather queer."}, {"viet": "Tôi làm việc từ thứ Ba đến thứ Bảy, còn Chủ nhật và thứ Hai là ngày tôi được nghỉ.", "eng": "I work from Tuesday to Saturday, and Sunday and Monday are my days off."}, {"viet": "Tôi muốn xác nhận lại chuyến bay của tôi.", "eng": "I would like to reconfirm my flight."}, {"viet": "Tôi đã viết thư cho công ty ba tuần trước và tôi vẫn chưa nhận được thư báo nhận được.", "eng": "I wrote to the company three weeks ago, and I haven't received an acknowledgement yet."}, {"viet": "Nếu tôi đã từng nói điều đó một lần, tôi còn nói điều đó một trăm lần.", "eng": "If I've said it one, I've said it a hundred times."}, {"viet": "Nếu trong thâm tâm cô ta có nghi ngờ thì không một người nào khác thấy được.", "eng": "If she had inner doubts, it was not apparent to anyone else."}, {"viet": "Nếu cả hai chúng ta đều tính con số này, kết quả của bà sẽ được đối chiếu với kết quả của tôi.", "eng": "If we both add up the figures, your result will be a check on mine."}, {"viet": "Nếu anh không đạt được những con số bán hàng khá hơn, anh sẽ bị sa thải!", "eng": "If you can't deliver improved sales figures, you're fired!"}, {"viet": "Nếu anh có được ba điều ước, anh sẽ chọn những điều nào?", "eng": "If you had three wishes what would you choose?"}, {"viet": "Nếu cậu nghĩ thế, cậu lầm to rồi đấy.", "eng": "If you think that, you are gravely mistaken."}, {"viet": "Nhập khẩu trong ba tháng đầu đã tăng 10 phần trăm so với cùng kỳ năm ngoái.", "eng": "Imports in the first three months have increased by 10 per cent compared with the corresponding period last year."}, {"viet": "Về mẫu mã và chất lượng chế tạo, họ bị người Ý vượt qua.", "eng": "In design and quality of manufacture they were outclassed by the Italians."}, {"viet": "Tại nhiều quốc gia, các nhóm trẻ con đi khắp nơi ca hát các bản nhạc mừng Giáng Sinh.", "eng": "In many countries groups of children go about singing Christmas carols."}, {"viet": "Ở thế kỉ 19, công nghiệp dồn về phía bắc của nước Anh.", "eng": "In the 19th century industry gravitated towards the north of England."}, {"viet": "Mùa hè những người nông dân thu hoạch quả.", "eng": "In the Summer the farmers gather the fruit."}, {"viet": "Thật ra thì nhiều đàn ông mơ đến việc thôi làm công việc từ 9 giờ sáng đến 5 giờ chiều của họ và mua một quán rượu nhỏ ở miền quê, nơi họ tưởng tượng họ sẽ là chủ nhân của một bữa tiệc bảy đêm một tuần.", "eng": "Indeed, many men dream of retiring from their 9-5 jobs and buying a little country pub, where they imagine they'll be the host of a seven-nights-a-week party."}, {"viet": "Nó ngu hay nó đang cố tình trì độn?", "eng": "Is he stupid or is he being deliberately obtuse?"}, {"viet": "Có một tiếp viên hàng không người Trung Quốc trên máy bay phải không?", "eng": "Is there a Chinese flight attendant on board?"}, {"viet": "Đây là lần đầu tiên ông đến Bắc Kinh phải không?", "eng": "Is this your first time in Beijing?"}, {"viet": "Đây quả là một tỉnh nhỏ, đường phố chính chỉ là một dãy phố.", "eng": "It's a really small town, the main drag is only a block long."}, {"viet": "Ở đây nguy hiểm anh nên đi đến nơi an toàn thì hơn.", "eng": "It's dangerous here, you'd better betake yourself to a place of safety."}, {"viet": "Thật quan trọng khi được gặp bạn bè và bà con của chúng ta.", "eng": "It's important to see our friends and relatives."}, {"viet": "Không xa đâu-từ đây đến đó non một tiếng đồng hồ thôi.", "eng": "It's not far-it'll take less than an hour to get there."}, {"viet": "Thật là bất công khi cô ấy đã mất việc của cô ấy.", "eng": "It's so unfair that she's lost her job."}, {"viet": "Thật rất thú vị khi được gặp gỡ nhiều người khác nhau.", "eng": "It's very interesting meeting different people."}, {"viet": "Nó giải thích nhiều loại dịch vụ khác nhau trong khách sạn chúng tôi.", "eng": "It explains our various hotel services."}, {"viet": "Thật khó có thể đánh giá được toàn bộ sự thiệt hại.", "eng": "It is difficult to judge the full extent of the damage."}, {"viet": "Có lẽ đó là tác phẩm nổi tiếng nhất của ông ta.", "eng": "It is perhaps, the best known of his works."}, {"viet": "Tập luyện làm bạn khỏe hơn nhiều.", "eng": "It makes you feel a lot better."}, {"viet": "Nó tốn kém nhưng rất vui.", "eng": "It's expensive, but it's a lot of fun."}, {"viet": "Dường như đó là điều hợp lý duy nhất phải làm.", "eng": "It seemed the only logical thing to do."}, {"viet": "Chúng tôi phải mất vài phút để lấy lại hơi sau cuộc đua.", "eng": "It took us a few minutes to get our breath back after the race."}, {"viet": "Trời tối, tôi chỉ có thể nhận ra mặt của họ thôi.", "eng": "It was dark and I could just distinguish their faces."}, {"viet": "Cô ấy đã lơ đãng đến quên thanh toán hoá đơn.", "eng": "It was remiss of her to forget to pay the bill."}, {"viet": "Chẳng mấy chốc mà sắp được năm năm kể từ ngày chúng ta đến sống ở Cairo.", "eng": "It will soon be five years since we came to live in Cairo."}, {"viet": "Jane tính tình hiền dịu, kín đáo.", "eng": "Jane has a gentle retiring disposition."}, {"viet": "Nối liền các chấm để hoàn thành bức vẽ.", "eng": "Join the dots up to complete the drawing."}, {"viet": "Im mồm nếu không tao bắn!", "eng": "Keep quiet or I'll shoot!"}, {"viet": "Chắc chắn chúng ta phải dừng lại đây để bắt cá nấu bữa ăn trưa.", "eng": "Let's definitely stop here to fish for our lunch."}, {"viet": "Chúng ta hãy chụp ảnh chiếc cầu này nhé.", "eng": "Let's take a picture on the bridge."}, {"viet": "Nhiều người nổi tiếng lại cực kì khiêm tốn.", "eng": "Many famous people are surprisingly humble."}, {"viet": "Mao Đài, tôi phát âm đúng không?", "eng": "Mao Tai, my pronunciation is right?"}, {"viet": "Tôi có thể xem chúng được không, thưa bà?", "eng": "May I have a look at them, madam?"}, {"viet": "Có lẽ bạn có thể cho tôi một số ý kiến về khu vườn của chúng tôi chăng?", "eng": "Maybe you can give me some ideas for our garden?"}, {"viet": "Hầu hết công việc trên tàu là chăm lo thiết bị và các máy móc.", "eng": "Most of the work on the ship is taking care of the equipment and machines."}, {"viet": "Hầu hết những thứ anh ta nói đều phải trừ hao đi.", "eng": "Much of what he says must be discounted."}, {"viet": "Ông bạn thân mến của tôi ơi, chắc chắn ông không muốn nói thế!", "eng": "My dear fellow, surely you don't mean that!"}, {"viet": "Tôi đã được chỉ thị là không được để bất kỳ ai vào.", "eng": "My instructions are that I am not to let anyone in."}, {"viet": "Lý do đối với tôi là chi phí rồi sẽ quá cao.", "eng": "My reason is that the cost will be too high."}, {"viet": "Quốc hữu hoá đường sắt, mỏ than, công nghiệp thép, v. v.", "eng": "Nationalize the railways, the coal-mine, the steel industry, etc."}, {"viet": "Ngân sách năm sau sẽ bị cắt giảm mạnh.", "eng": "Next year's budget will have to be drastically pruned."}, {"viet": "Ở hiệp một không bên nào ghi được bàn.", "eng": "No goals were scored in the first half."}, {"viet": "Bây giờ, chúng ta hãy tiếp tục cuộc thảo luận của chúng ta.", "eng": "Now, let's resume our discussion."}, {"viet": "Những ràng buộc hàm ẩn trong bản hợp đồng.", "eng": "Obligations which are implicit in the contract."}, {"viet": "Ồ, ông muốn nói thiết bị ghi băng.", "eng": "Oh, you mean the recorded device."}, {"viet": "Ở phía xa hơn nữa của phố có một dãy cửa hàng nhỏ.", "eng": "On the farther side of the street, there was a row of small shops."}, {"viet": "Một trong những nghị sĩ hùng biện nổi tiếng nhất của chúng ta.", "eng": "One of our most eminent parliamentarians."}, {"viet": "Chúng tôi đến gần đã làm những con thú hoang chạy đi.", "eng": "Our approach drove away the wild animals."}, {"viet": "Sự tức giận của chính phủ chúng tôi được truyền đạt tới đại sứ của họ.", "eng": "Our government's anger was conveyed to then ambassador."}, {"viet": "Các sản phẩm của chúng tôi đầu bán rất chạy ở bất cứ nơi nào chúng được đưa ra tiêu thụ.", "eng": "Our products have enjoyed successful sales wherever they have been introduced."}, {"viet": "Trong công nghiệp thì tình trạng thừa công nhân có thể là một vấn đề nghiêm trọng.", "eng": "Overmanning can be a serious problem in industry."}, {"viet": "Tiền công sẽ được trả tương xứng với việc đã làm chứ không phải theo thời gian đã bỏ ra để làm việc đó.", "eng": "Payment will be in proportion to the work done, not to the time spent doing it."}, {"viet": "Có lẽ xin ông vui lòng...", "eng": "Perhaps you would be kind enough to..."}, {"viet": "Cảnh sát đã lục soát kỹ lưỡng câu lạc bộ để tìm kiếm ma tuý.", "eng": "Police shook the club down, looking for narcotics."}, {"viet": "Ngay bây giờ nếu ông muốn.", "eng": "Right now if you'd like."}, {"viet": "Nhiều ống khói bị thổi đổ trong trận bão.", "eng": "Several chimneys blew down during the storm."}, {"viet": "Cô ta chơi khá hơn năm ngoái.", "eng": "She's a better player than she was last year."}, {"viet": "Cô ta cứ quanh quẩn ở đây từ nhiều năm.", "eng": "She's been knocking about here for years."}, {"viet": "Sau nhiều tháng tập luyện cô ta ở trong tình trạng tốt.", "eng": "She's in good shape after months of training."}, {"viet": "Cô ấy hoàn toàn không giống mẹ, cô ấy thì cao còn mẹ cô ấy thì rất thấp.", "eng": "She's quite unlike her mother, she's tall and her mother's very short."}, {"viet": "Bà ấy đang soạn một cuốn từ điển hay cuốn gì đại loại như thế.", "eng": "She's writing a dictionary or something."}, {"viet": "Cô ta thức giấc khi cô y tá bước vào buồng.", "eng": "She awoke when the nurse entered the room."}, {"viet": "Cô ấy đã chọn biện pháp in ấn để phổ biến quan niệm của mình.", "eng": "She chose the medium of print to make her ideas known."}, {"viet": "Cô ta nện cho hắn một cú trời giáng với cái que cời.", "eng": "She dealt him a tremendous blow with the poker."}, {"viet": "Cô ấy không muốn đưa người bạn trai mới quen về nhà nếu bố mẹ không ưng thuận ( cậu ấy ).", "eng": "She doesn't want to take her new boy-friend home in case her parents don't approve ( of him )."}, {"viet": "Cô ấy cảm thấy gia đình cô ấy là chướng ngại đối với công việc của cô ấy.", "eng": "She felt that her family were an obstacle to her work."}, {"viet": "Bà ta nêu cho chúng ta một tấm gương sống về tính thánh thiện.", "eng": "She gives us a living example of sanctity."}, {"viet": "Cô ta bỏ nhà đi sau một trận đòn dữ dội.", "eng": "She had left home after a savage beating."}, {"viet": "Người ta đã báo trước cho bà ấy biết về sự nguy hiểm khi lái xe trong tình trạng đó.", "eng": "She has been warned of the danger of driving the car in that state."}, {"viet": "Cô ấy núp dưới một căn cước giả mạo.", "eng": "She hid behind a false identity."}, {"viet": "Cô ta thường hay bị buộc tội là coi thường các đối thủ của mình.", "eng": "She is often accused of rubbishing her opponents."}, {"viet": "Cô ta thúc đầu gối vào chỗ hiểm của kẻ tấn công rồi bỏ chạy.", "eng": "She kneed her attacker in the vitals and ran away."}, {"viet": "Bà ta trông xanh xao và mệt mỏi sau nhiều tuần mất ngủ.", "eng": "She looked pale and drawn after weeks of sleepless nights."}, {"viet": "Cô ta noi gương nhà tiểu thuyết mà cô ta ưa thích.", "eng": "She models herself on her favourite novelist."}, {"viet": "Cô ta chụp toà nhà từ nhiều góc độ khác nhau.", "eng": "She photographed the building from several different angles."}, {"viet": "Cô ấy đọc báo to cho chúng tôi nghe.", "eng": "She read aloud to us from the newspaper."}, {"viet": "Cô ấy đang nhắm lấy một học bổng.", "eng": "She's aiming at a scholarship."}, {"viet": "Cô ấy tạt vào thăm bà mẹ.", "eng": "She's popped over to see her mother."}, {"viet": "Cô ta đọc lướt qua tờ báo khi ăn sáng.", "eng": "She scanned the newspaper over breakfast."}, {"viet": "Cô ấy đã ở tịt trong phòng làm việc của cô ấy hàng giờ.", "eng": "She shuts herself in her study for hours."}, {"viet": "Bà ấy vẫn bám lấy niềm tin cho rằng con trai bà còn sống.", "eng": "She still clings to the belief that her son is alive."}, {"viet": "Cô ta có khuynh hướng tự đề cao mình quá đáng.", "eng": "She tends to thrust herself forward too much."}, {"viet": "Cô ta ngoặt mạnh tay lái về bên trái để tránh người đi xe đạp.", "eng": "She turned the steering-wheel sharply to the left to avoid a cyclist."}, {"viet": "Cô ấy đã thành công cả với tư cách là một nghệ sĩ pianô lẫn một nhạc trưởng.", "eng": "She was a success both as pianist and as a conductor."}, {"viet": "Tôi hôm qua cô ta say lúy túy.", "eng": "She was completely paralytic last night."}, {"viet": "Cô ta khổ sở vì không quyết định được.", "eng": "She was in an agony of indecision."}, {"viet": "Bà ấy kiệt sức cùng với nỗi đau buồn sau cái chết của chồng.", "eng": "She was prostrated with grief after his death."}, {"viet": "Cô ta là hiện thân của sự thanh lịch.", "eng": "She was the personification of elegance."}, {"viet": "Cô ta hoàn toàn không tuân theo các mệnh lệnh của tôi.", "eng": "She went flat against my orders."}, {"viet": "Cô ấy đoạt giải và không ngừng huyên thuyên về địch thủ của cô.", "eng": "She won the competition and won't stop crowing over her rival."}, {"viet": "Đổ lỗi lên vai người khác.", "eng": "Shift the blame onto somebody else's shoulders."}, {"viet": "Rây bột mì vào một cái bát.", "eng": "Sieve the flour into a bowl."}, {"viet": "Ngồi xếp bằng trên sàn nhà.", "eng": "Sitting cross-legged on the floor."}, {"viet": "Smith là một tên họ Anh phổ biến.", "eng": "Smith is a common English surname."}, {"viet": "Thế là lại đến một mùa đông nữa và tôi vẫn bị thất nghiệp.", "eng": "So now it's winter again and I'm still unemployed."}, {"viet": "Một kẻ thông minh nào đó lại cứ để vòi nước chảy suốt cả đêm.", "eng": "Some bright spark has left the tap running all night."}, {"viet": "Một số trong những câu chuyện kinh dị này đúng là những chuyện kinh tởm.", "eng": "Some of these horror stories are real shockers."}, {"viet": "Một số các bà vợ chịu đựng ngược đãi nhiều năm mà không hề bẩm báo.", "eng": "Some wives suffer years of abuse and never report it."}, {"viet": "Xin lỗi tôi đã không biết có anh ở đây.", "eng": "Sorry, I didn't notice you."}, {"viet": "Thể thao đã bị thương mại hóa ngày càng nhiều trong những năm gần đây.", "eng": "Sport has become much more commercialized in recent years."}, {"viet": "Stephen đã thừa nhận Henry là người thừa kế của mình.", "eng": "Stephen acknowledged Henry as his heir."}, {"viet": "Đừng có nhúc nhích nữa và ngồi yên đi!", "eng": "Stop wriggling about and sit still!"}, {"viet": "Sự thành công của cuộc đi chơi picnic thường tuỳ thuộc vào thời tiết.", "eng": "Success of a picnic usually turns on the weather."}, {"viet": "Những tác phẩm duy nhất giống nhật ký về Nội Chiến của Mary Chestnut.", "eng": "Sui generis works like Mary Chestnut's Civil War diary."}, {"viet": "Thề chung thủy cho tới khi chết.", "eng": "Swear to be faithful unto death."}, {"viet": "Đem những lá thư này sang bưu điện.", "eng": "Take these letters over to the post office."}, {"viet": "Các đài vô tuyến truyền hình khắp nơi trên thế giới được nối lại với nhau bằng vệ tinh nhân tạo.", "eng": "Television stations around the world are linked by satellite."}, {"viet": "Cám ơn cô về những lời giải thích tuyệt vời.", "eng": "Thank you for your wonderful explanation."}, {"viet": "Đó là lý do tại sao chúng đang rất được ưa chuộng ở thị trường châu Âu.", "eng": "That's why they are meeting with great favor in the European market."}, {"viet": "Trợ cấp đó chẳng bõ bèn gì: chúng ta sẽ cần nhiều tiền hơn.", "eng": "That grant was pretty small beer: we shall need a lot more money."}, {"viet": "Cú sốc tệ hại đã làm anh ta chừa cái thói tọc mạch của mình.", "eng": "That nasty shock cured him of his inquisitiveness for ever."}, {"viet": "Nó cũng nằm trong ngành kinh doanh của chúng tôi.", "eng": "That's under our line of business."}, {"viet": "Chơi xỏ đứa em trai nhỏ của con không phải là trò đùa hay lắm đâu.", "eng": "That wasn't a very nice trick to play on your baby brother."}, {"viet": "Những nhân viên kế toán kiểm tra sổ sách công ti vào cuối năm tài chính.", "eng": "The accountants audited the company's book at the end of the fiscal year."}, {"viet": "Thỏa thuận có lợi cho chúng ta.", "eng": "The agreement works to our advantage."}, {"viet": "Lời tuyên bố tăng lương đó thực ra là gai góc-chúng ta sẽ phải làm việc nhiều giờ hơn.", "eng": "The announcement of the pay rise had a sting in its tail-we would have to work longer hours."}, {"viet": "Hai tay và hai chân là những bộ phận rất cần thiết cho cơ thể trọn vẹn, chúng bổ túc cho cơ thể con người hoàn chỉnh.", "eng": "The arms and legs are integral parts of the human body, they are integral to the human body."}, {"viet": "Trận cúm đã làm cho cô ấy cảm thấy rất yếu, đứng không vững.", "eng": "The attack of flu left her feeling very groggy."}, {"viet": "Đứa bé không thể ngồi một mình được-nó phải được tựa người vào gối.", "eng": "The baby cannot sit unaided-she has to be propped up on pillows."}, {"viet": "Nhân viên ngân hàng nhìn khách hàng từ phía sau song sắt.", "eng": "The bank clerk peered at the customer from behind the grille."}, {"viet": "Bãi biển đó nhan nhản những người đi tắm.", "eng": "The beach was swarming with bathers."}, {"viet": "Bài thi sinh vật là bài thi rất gay go.", "eng": "The biography paper was a real stinker."}, {"viet": "Chiếc xuồng đã được neo vào một cái cột trên bờ sông.", "eng": "The boat was moored to a post on the river bank."}, {"viet": "Cuốn sách anh cần không có trong thư viện.", "eng": "The book you wanted is out."}, {"viet": "Những binh sĩ ở hải ngoại sẽ có một giáng sinh buồn tẻ.", "eng": "The boys overseas will have a bleak Christmas."}, {"viet": "Những người xây dựng xây cái bếp hết sức dở.", "eng": "The builders have made a complete bodge up of the kitchen."}, {"viet": "Công việc kinh doanh mở rộng từ một văn phòng lên đến mười hai văn phòng.", "eng": "The business has expanded from having one office to having twelve."}, {"viet": "Ô tô dừng lại kịp thời đã ngăn được một tai nạn.", "eng": "The car came to a halt just in time to prevent an accident."}, {"viet": "Tác động gây ung thư của chế độ ăn uống nhiều chất mỡ.", "eng": "The carcinogenic effects of high fat diets."}, {"viet": "Thực tế là các buổi lễ đã không diễn ra.", "eng": "The celebrations were not to be."}, {"viet": "Người lái xe đưa chủ tịch công ty đến văn phòng hàng ngày.", "eng": "The chauffer drove the chairman of the company to office daily."}, {"viet": "Cơ thể đứa bé sờ thấy sốt.", "eng": "The child's body felt feverish."}, {"viet": "Bọn trẻ đều làm bài tốt chỉ có Jo là không làm được.", "eng": "The children did well, the only exception being Jo, who failed."}, {"viet": "Những đứa trẻ tỏ vẻ háo hức khi chúng mở những gói quà.", "eng": "The children were delirious with joy as they opened the parcels."}, {"viet": "Thư viện thành phố được ông thị trưởng khánh thành.", "eng": "The city library was inaugurated by the mayor."}, {"viet": "Anh hề mua vui cho khán giả bằng những trò đùa thơ ngây của mình.", "eng": "The clown amused the audience by his childish antics."}, {"viet": "Cây cối nhiều màu sắc của rừng nhiệt đới.", "eng": "The colourful vegetation of a tropical forest."}, {"viet": "Công ty đã quyết định bắt đầu sản xuất nhiều hơn các mặt hàng xa xỉ.", "eng": "The company has decided to move upmarket."}, {"viet": "Máy vi tính đã xác minh rằng các dữ kiện đã được nạp đúng.", "eng": "The computer verified that the data was loaded correctly."}, {"viet": "Sự trù liệu một phương pháp hữu hiệu.", "eng": "The contrivance of an effective method."}, {"viet": "Nước này có chiến tranh với nước láng giềng đã hai năm nay.", "eng": "The country has been at war with its neighbour for two years."}, {"viet": "Tai nạn máy bay rơi xảy ra chỉ ba phút sau khi cất cánh.", "eng": "The crash occurred only three minutes after take-off."}, {"viet": "Đám đông reo hò cổ vũ con gà của mình, mong cô ta thắng.", "eng": "The crowd were cheering their favourite on, willing her to win."}, {"viet": "Sự hư hại trên bức tranh là hậu quả của bọn phá hoại văn hoá.", "eng": "The damage to the painting is the work of vandals."}, {"viet": "Những người nổi loạn bị thất bại xin cư trú chính trị ở nước khác.", "eng": "The defeated rebels sought politicial asylum in another country."}, {"viet": "Nhà thám tử nghiên cứu các dấu tay theo từng chi tiết tỉ mỉ nhất.", "eng": "The detective studied the finger prints in the minutest detail."}, {"viet": "Cuộc thảo luận tiếp tục lan man hàng giờ đồng hồ.", "eng": "The discussion meandered on for hours."}, {"viet": "Vị bác sĩ bảo tôi phải nằm nghỉ.", "eng": "The doctor ordered me to stay in bed."}, {"viet": "Con chó nằm im đến nỗi tưởng như nó không còn sống nữa.", "eng": "The dog lay so still it scarcely seemed animate."}, {"viet": "Bức vẽ họa cô đang ngồi trên ghế trường kỷ.", "eng": "The drawing depicts her sitting on a sofa."}, {"viet": "Quả đất là một khối cầu dẹt.", "eng": "The earth is an oblate sphere."}, {"viet": "Sự toả ánh sáng từ mặt trời.", "eng": "The emission of light from the sun."}, {"viet": "Nạn dịch tập trung ở vùng đô thị.", "eng": "The epidemic centered in the urban areas."}, {"viet": "Cuốn vở có các trang trắng xen các trang có dòng kẻ.", "eng": "The exercise book has plain pages interleaved between its lined ones."}, {"viet": "Các sự kiện liên quan tới vấn đề đó.", "eng": "The facts relative to the problem."}, {"viet": "Chính phủ liên bang đã bỏ mọi hạn chế về việc sử dụng quỹ vay.", "eng": "The federal government pulled the plug on deficit spending."}, {"viet": "Bộ phim bắt đầu lúc 7 giờ 30 và kéo dài hai tiếng.", "eng": "The film starts at 7.30 and lasts two hours."}, {"viet": "Công ty này có những mối quan hệ với một tổng công ty Mỹ.", "eng": "The firm has ties with an American corporation."}, {"viet": "Hôm nay cá hình như không cắn câu.", "eng": "The fish don't seem to be taking today."}, {"viet": "Thức ăn không thích hợp cho con người tiêu dùng.", "eng": "The food was not fit for human consumption."}, {"viet": "Cửa hàng Hữu Nghị có một gian hàng thủ công mỹ nghệ, ở đó hàng tráng men, sơn mài, thêu và các mặt hàng khác được bày bán.", "eng": "The Friendship Store has an arts and crafts department, where cloisonné, lacquer ware, embroideries and other things are sold."}, {"viet": "Mảnh vườn chẳng ai trông nom.", "eng": "The garden has fallen into a state of neglect."}, {"viet": "Cô gái đó leo qua bức tường.", "eng": "The girl scrambled over the wall."}, {"viet": "Sự thay đổi chính sách thuế khóa đột ngột của chính phủ đã làm kinh ngạc các nhà bình luận chính trị.", "eng": "The government's sudden turn-about on taxation surprised political commentators."}, {"viet": "Chính phủ vẫn tiếp tục cuộc đấu tranh không chắc đã thành công chống lại đa số dư luận của quần chúng.", "eng": "The government is fighting a rearguard action against the mass of public opinion."}, {"viet": "Đường nét đẹp mắt của con tàu.", "eng": "The graceful lines of the ship."}, {"viet": "Những nhóm người đứng xem chẳng bao lâu trở thành một đám đông.", "eng": "The group of onlookers soon swelled into a crowd."}, {"viet": "Phòng đại sảnh có chất lượng âm thanh tốt.", "eng": "The hall has a fine acoustic."}, {"viet": "Những tư tưởng dị giáo của những người theo Tin lành ngày xưa.", "eng": "The heresies of the early Protestants."}, {"viet": "Các con ngựa đã chạy hầu như song song sát bên nhau.", "eng": "The horses ran mostly head-to-head."}, {"viet": "Ngôi nhà được đem bán với tình trạng vô chủ.", "eng": "The house is for sale with vacant possession."}, {"viet": "Kem cứ trôi xuống mát-lạnh và ngọt lịm.", "eng": "The ice-cream slipped down easily-it was cold and delicious."}, {"viet": "Những người da đỏ ở Pê-ru và Mê-hi-cô đã có những cánh đồng trồng bông vải vào thời kỳ của các nhà thám hiểm Tây Ban Nha.", "eng": "The Indians of Peru and Mexico had fields of cotton in the days of Spanish explorers."}, {"viet": "Điểm gặp nhau giữa tội ác và chính trị là nơi mà chúng ta thấy được phần lớn những thực tế của mình.", "eng": "The interface between crime and politics where much of our reality is to be found."}, {"viet": "Công việc có sẵn rồi đấy.", "eng": "The job is up for grabs."}, {"viet": "Ấm nước đang reo trên bếp.", "eng": "The kettle was singing away on the cooker."}, {"viet": "Đất trở nên bằng phẳng ở gần bờ biển.", "eng": "The land flattens out near the coast."}, {"viet": "Vị luật sư bắt bẻ lời cung khai từng ly từng tý.", "eng": "The lawyer picked the testimony apart."}, {"viet": "Việc giải phóng châu Âu bởi quân đội Đồng minh.", "eng": "The liberation of Europe by Allied troops."}, {"viet": "Dân địa phương bị đội quân đánh thuê tàn bạo đàn áp.", "eng": "The local population is kept under by a brutal army of mercenaries."}, {"viet": "Xa lộ 62 nối liền với xa lộ 1.", "eng": "The M62 joins up with the M1."}, {"viet": "Sự hành hạ của người đàn ông đó đối với con chó của ông ta.", "eng": "The man's maltreatment of his dog."}, {"viet": "Vấn đề không thể cho qua ở đó-tôi yêu cầu phải được xin lỗi.", "eng": "The matter cannot rest there-I demand an apology."}, {"viet": "Cuộc họp sẽ kết thúc nhanh-tôi không muốn nó tiếp tục.", "eng": "The meeting will finish promptly-I don't want it to run on."}, {"viet": "Ông bộ trưởng cắt băng khánh thành một đoạn đường ôtô mới.", "eng": "The Minister cut the tape to open a new section of the motorway."}, {"viet": "Những con khỉ kêu the thé khi chúng thấy nguy hiểm.", "eng": "The monkeys cry out shrilly when they see danger."}, {"viet": "Con đường núi có thể đi lại được nhưng chỉ có điều là khó khăn thôi.", "eng": "The mountain track is negotiable, but only with difficulty."}, {"viet": "Quốc hội họp để bàn về cơn khủng hoảng này.", "eng": "The national assembly have met to discuss the crisis."}, {"viet": "Bộ phim mới ấy chỉ là một bản có cải tiến của bộ phim gốc năm 1948.", "eng": "The new film is just a souped-up version of the 1948 original."}, {"viet": "Ông giám đốc mại vụ mới chưa biết là người như thế nào.", "eng": "The new sales director is still a bit of an unknown quantity."}, {"viet": "Những bài tường thuật của báo chí về các trẻ em bị nạn đói làm tôi kinh hoàng.", "eng": "The newspaper reports of starving children appalled me."}, {"viet": "Cuốn tiểu thuyết đó đã được tái xuất bản dưới dạng bìa mềm.", "eng": "The novel was reissued as a paperback."}, {"viet": "Văn phòng đóng cửa những ngày cuối tuần.", "eng": "The office is closed on the weekends."}, {"viet": "Ông cụ đeo một mắt kính buộc một sợi dây.", "eng": "The old man wore an eyeglass attached to a piece of ribbon."}, {"viet": "Hiện thời dàn nhạc này đang lưu diễn ở Đức.", "eng": "The orchestra is currently on tour in Germany."}, {"viet": "Bức tranh không ký tên nên chúng tôi không biết là của ai vẽ.", "eng": "The painting isn't signed so we don't know who it's by."}, {"viet": "Cuộc liên hoan đã thành công bởi vì mọi người đã hết mình vui chơi.", "eng": "The party was successful because everyone entered into the spirit of the thing."}, {"viet": "Nhân dân đó bị chính phủ quân sự áp bức.", "eng": "The people are oppressed by the military government."}, {"viet": "Tấm ảnh phù hợp với sự mô tả kẻ bị truy nã.", "eng": "The photograph answers to the description of the wanted man."}, {"viet": "Nơi này có một vẻ bí ẩn.", "eng": "The place has an air of mystery."}, {"viet": "Những cây đó có lẽ không sống nổi qua đợt giá lạnh này.", "eng": "The plants may not survive the frost."}, {"viet": "Người thợ sửa ống nước nong đầu ống rộng ra trước khi lắp nó vào khúc kế tiếp.", "eng": "The plumber splayed the end of the pipe before fitting it over the next section."}, {"viet": "Cảnh sát đang phỏng vấn những người có thể bị tình nghi và kiểm tra chứng cớ ngoại phạm của họ.", "eng": "The police had been interviewing possible suspects and checking their alibis."}, {"viet": "Cảnh sát đã dùng nhục hình để moi lấy một sự thú nhận của hắn.", "eng": "The police used torture to extort to confession from him."}, {"viet": "Cảng Dover là cửa ngõ của nước Anh đi sang châu Âu.", "eng": "The port of Dover is England's gateway to Europe."}, {"viet": "Người đang giữ chức ở Nhà trắng.", "eng": "The present incumbent of the White House."}, {"viet": "Giới báo chí không được phép tham dự cuộc xử án.", "eng": "The Press were not allowed to attend the trial."}, {"viet": "Những người thừa hưởng chính theo bản di chúc.", "eng": "The principal beneficiaries of a will."}, {"viet": "Đám rước đi chầm chậm xuống chân đồi.", "eng": "The procession passed slowly down the hill."}, {"viet": "Luật sư bên nguyên thẩm vấn chéo một nhân chứng của bên bị.", "eng": "The prosecution lawyer cross-examined the defence witness."}, {"viet": "Chất lượng tay nghề là tốt nhất.", "eng": "The quality of workmanship is unsurpassed."}, {"viet": "Mưa đổ xuống như trút nước.", "eng": "The rain came down in sheets."}, {"viet": "Các đầu từ thu và phát được làm bằng hợp kim pecmaloi tôi.", "eng": "The record and play back heads are made of hardened permalloy."}, {"viet": "Bản báo cáo về bệnh viện nêu ra nhu cầu cấp thiết là cung cấp quần áo giặt ủi sạch sẽ.", "eng": "The report on the hospital mentions much desiderata as a supply of clean laundry."}, {"viet": "Sự phục hồi những tục lệ cổ, giá trị cũ, kỹ năng xưa.", "eng": "The revival of old customs, values, skills."}, {"viet": "Đường phân nhánh sau khi cắt ngang đường xe lửa.", "eng": "The road branches after level-crossing."}, {"viet": "Căn phòng tạo được ấn tượng tốt đối với các bức hoạ của cô ấy.", "eng": "The room shows off her paintings to good effect."}, {"viet": "Bí tích rửa tội, thêm sức, giải tội.", "eng": "The sacraments of baptism, confirmation, confession."}, {"viet": "Trong lúc tạm ngưng các bức phông được thay đổi.", "eng": "The scenes are changed during the interval."}, {"viet": "Trong hạng rẻ nhất ghế ngồi rất sát nhau.", "eng": "The seats are very close together in economy class."}, {"viet": "Các cống rãnh tuôn nước trong cống ra biển.", "eng": "The sewers discharge their contents into the sea."}, {"viet": "Con tàu đã phó mặc cho cơn bão.", "eng": "The ship was at the mercy of the storm."}, {"viet": "Đứa trẻ bị bệnh khóc la thảm thiết.", "eng": "The sick child was wailing miserably."}, {"viet": "Tiếng còi tu huýt chói tai của cảnh sát phá tan sự yên lặng.", "eng": "The skirl of a police whistle split the stillness."}, {"viet": "Các đảng viên đảng Xã hội chiếm ưu thế hơn trong nhiệm kỳ vừa qua của Nghị viện?", "eng": "The Socialists were predominant in the last Parliament?"}, {"viet": "Các tiểu bang ở miền đông-nam nước Mỹ.", "eng": "The south-eastern states of the USA."}, {"viet": "Căn bậc hai của 5 là một số vô tỷ.", "eng": "The square root of 5 is a surd."}, {"viet": "Nhà buôn chứng khoán đã đầu tư vào chứng khoán công nghiệp.", "eng": "The stockbroker has placed the money in industrial stock."}, {"viet": "Sự trang trí con thuyền theo kiểu kẻ sọc tiến triển chậm.", "eng": "The striping of the boat proceeded slowly."}, {"viet": "Mặt trời mọc ở đàng đông và lặn ở đàng tây.", "eng": "The sun rises in the east and sets in the west."}, {"viet": "Chiếc tắc xi bịch bịch một cách khó khăn chạy ngược lên con đường ngoằn ngoèo.", "eng": "The taxi chugged with difficulty up the winding road."}, {"viet": "Đội bóng không cam chịu thua/bị đánh bại.", "eng": "The team refused to resign themselves to defeat."}, {"viet": "Lý thuyết này dựa vào những chứng cứ giai thoại hơn là sự thống kê xác thực.", "eng": "The theory relies more on anecdotal evidence than genuine statistics."}, {"viet": "Đã sắp đến lúc chúng tôi cần phải suy nghĩ về việc mua một ngôi nhà mới.", "eng": "The time is approaching when we must think about buying a new house."}, {"viet": "Xe cộ bò từ từ qua cầu trong giờ cao điểm.", "eng": "The traffic crawled over the bridge in the rush-hour."}, {"viet": "Phụ âm rung r được phát ra bằng cách rung lưỡi đập vào hàm răng trên.", "eng": "The trilled r is produced by vibrating the tongue against the upper teeth."}, {"viet": "Hai con đường chính trong thành phố cắt ngang đối diện trường học.", "eng": "The two main roads in the city intersect opposite the school."}, {"viet": "Công đoàn khăng khăng đòi số lương tăng như đã yêu cầu.", "eng": "The unions are sticking out for a higher pay offer."}, {"viet": "Phó tổng thống trong chuyến đi vận động đã dừng ở Topeca trước khi tiếp tục chuyến đi tới Kansas và Nebraska.", "eng": "The vice president made a whistle-stop in Topeca before continuing his tour of Kansas and Nebraska."}, {"viet": "Các bức tường của căn phòng xếp đầy cả sách.", "eng": "The walls of the room were lined with books."}, {"viet": "Họ say mê album mới của nhóm nhạc rock.", "eng": "The were gaga over the rock group's new album."}, {"viet": "Ngọn gió giật tờ giấy khỏi tay tôi.", "eng": "The wind twitched the paper out of my hand."}, {"viet": "Công việc khó khăn và hệ quả là, mệt nhọc.", "eng": "The work is difficult and, as a corollary, tiring."}, {"viet": "Những con cừu non đang chạy nhảy tung tăng ngoài cánh đồng.", "eng": "The young lambs were frolicking in the field."}, {"viet": "Người dẫn đường đã bỏ rơi họ, nhưng không hề nản lòng, họ vẫn hối hả đi sâu vào trong rừng.", "eng": "Their guide deserted them, but, nothing daunted, they pressed on into the jungle."}, {"viet": "Đỉnh của chúng đôi lúc cách mặt đất vài dặm.", "eng": "Their tops are sometimes several miles above the ground."}, {"viet": "Vậy thì ông vẫn còn rảnh được vài giờ.", "eng": "Then you still have a couple of hours to spare."}, {"viet": "Nhu cầu đối với đồ đạc có chất lượng cao thì luôn luôn sẵn có.", "eng": "There's always a ready sale for high-quality furniture."}, {"viet": "Tháng này không còn tí gì trong két tiền cả.", "eng": "There's nothing left in the exchequer this month."}, {"viet": "Có bốn cách chia trong tiếng Latinh nhưng cũng có nhiều động từ không có quy tắc.", "eng": "There are four conjugations in Latin but also many irregular verbs."}, {"viet": "Có vài tấm ảnh trong đó.", "eng": "There are some pictures in it."}, {"viet": "Có rất nhiều tai nạn trong sương mù, tôi đã đọc thấy một vụ sáng nay.", "eng": "There have been a lot of accidents in the fog, i read about one this morning."}, {"viet": "Có một sự tương phản nổi bật giữa hai cách lý giải.", "eng": "There is a striking contrast between the two interpretations."}, {"viet": "Có một cuộc xung đột công khai giữa những người chống lại và những người ủng hộ bản kế hoạch.", "eng": "There is open warfare between the opponents of the plan and its supporters."}, {"viet": "Có một con cáo đi lảng vảng rình mò gần chuồng gà con.", "eng": "There was a fox on the prowl near the chicken coop."}, {"viet": "Bức điện không có gì là tối nghĩa cả.", "eng": "There was nothing ambiguous in the message."}, {"viet": "Có quá ít người đến cuộc họp.", "eng": "There were too few people at the meeting."}, {"viet": "Những sự kiện này đã giúp định hướng sự nghiệp của cô ấy trong tương lai.", "eng": "These events helped to shape her future career."}, {"viet": "Những quy định này là cái còn sót lại từ những hạn chế được quy định trong thời gian chiến tranh.", "eng": "These regulations are a carry-over from restrictions that were imposed during the war."}, {"viet": "Họ đã mua căn hộ nhỏ này với giá 75000 pao-thật là khó mà có thể tin được!", "eng": "They're paying 75000 pounds for a small flat-it's beyond belief!"}, {"viet": "Họ đã tính trước số tử vong vì AIDS sẽ tăng gấp đôi vào năm 1999.", "eng": "They anticipate that deaths from AIDS will have double in 1999."}, {"viet": "Họ hỏi anh ta một lô câu hỏi.", "eng": "They asked him a menagerie of questions."}, {"viet": "Họ cảm thấy ái ngại về sự mất việc của ông ta.", "eng": "They commiserated with him over the loss of his job."}, {"viet": "Họ lái xe qua thành phố để tránh xa lộ.", "eng": "They drive through the town to avoid the motorway."}, {"viet": "Đã có lúc họ có chuyện tình ái với nhau, song bây giờ nó là chuyện cũ rồi.", "eng": "They had an affair once, but that's ancient history now."}, {"viet": "Họ gán cho tôi những đức tính tốt đẹp hơn mà tôi có.", "eng": "They impute to me better qualities than I possess."}, {"viet": "Chúng có thể che phủ một đỉnh đồi, tăng vẻ duyên dáng cho một khu vườn, hay đứng trong hồ, trộn lẫn một cách hài hoà với khung cảnh xung quanh chúng.", "eng": "They may crown a hilltop, grace a garden, or stand in a lake, mixing harmoniously with their back-grounds."}, {"viet": "Họ buộc anh ta tội giả mạo.", "eng": "They preferred charges of forgery against him."}, {"viet": "Chúng nó đe doạ bà ta để bóp nặn tiền.", "eng": "They screwed the money out of her by threats."}, {"viet": "Họ nghĩ là bà ta có thể tìm cách gọi điện thoại đến, nếu vậy, chắc có người nào đó đang ở đây.", "eng": "They think she may try to phone, if so, someone must stay here."}, {"viet": "Họ đang cãi nhau xem ai sẽ phải rửa bát.", "eng": "They were arguing about who should wash the dishes."}, {"viet": "Họ cám ơn tất cả sự giúp đỡ họ nhận được.", "eng": "They were thankful for all the help they received."}, {"viet": "Chiến dịch quảng cáo đã tăng thêm một cách có ý nghĩa cho sự thành công của chiếc ô tô mới.", "eng": "This advertising campaign has contributed significantly to the success of the new car."}, {"viet": "Chiếc áo khoác này vai quá hẹp.", "eng": "This coat is too narrow across the shoulders."}, {"viet": "Chứng cứ này không nhất quán với điều anh nói.", "eng": "This evidence is not consistent with what you said."}, {"viet": "Đây là một vấn đề ngày càng làm tôi bận tâm.", "eng": "This is a question which increasingly preoccupies me."}, {"viet": "Món này quá nhiều đối với tôi!", "eng": "This is too much for me!"}, {"viet": "Phát minh mới này thách thức các niềm tin truyền thống.", "eng": "This new discovery challenges traditional beliefs."}, {"viet": "Vấn đề này làm tôi băn khoăn rất nhiều trong lúc này.", "eng": "This problem is exercising our minds very much at the moment."}, {"viet": "Bức tượng này là đài kỉ niệm cho một trong những chính khách lớn nhất của chúng ta.", "eng": "This statue is a monument to one of our greatest statesmen."}, {"viet": "Sẽ mất ba phút trong lò vi sóng hoặc 25 phút trong lò bình thường.", "eng": "This will take 3 minutes in a microwave or 25 minutes in a conventional oven."}, {"viet": "Các nhân viên quầy vé cũng làm thủ tục đăng ký gởi hành lý của khách.", "eng": "Ticket counter workers also check in passengers'baggage."}, {"viet": "Chị biết không, việc thì nhiều mà tiền thì lại ít.", "eng": "Too much work, too little money, you know."}, {"viet": "Tôi không giống như những kẻ khổ sở bất hạnh khác, tôi có được một chỗ làm.", "eng": "Unlike many other poor unfortunates, I do have a job."}, {"viet": "Quảng trường Washington chỉ cách trạm cuối một trạm thôi.", "eng": "Washington Square is the last stop but one."}, {"viet": "Chúng ta cần phải sắp ghế cho cuộc họp.", "eng": "We'll need to set out chairs for the meeting."}, {"viet": "Chúng tôi giữ anh ở đây vì sự an toàn của chính anh.", "eng": "We're keeping you here for your own safety."}, {"viet": "Chúng ta đã bàn mọi mặt của vấn đề này rồi, ta hãy chuyển qua vấn đề tiếp theo.", "eng": "We've exhausted this subject, let's go on to the next."}, {"viet": "Tất cả chúng tôi đều nhận thấy rõ sức mạnh trong các lý lẽ của bà ta.", "eng": "We all felt the force of her arguments."}, {"viet": "Chúng tôi tin ở công lý trong vụ kiện của cô ấy.", "eng": "We are persuaded of the justice of her case."}, {"viet": "Chúng tôi gọi họ là \"những người phụ nữ thiên về sự nghiệp.", "eng": "We call them \"career-oriented women\"."}, {"viet": "Chúng ta không thể tin vào thời tiết để tổ chức các cuộc gặp gỡ thể thao.", "eng": "We cannot calculate fine weather for the sports meet."}, {"viet": "Chúng tôi đi ( từ London đến Oxford ) hết một giờ.", "eng": "We did the journey ( from London to Oxford ) in an hour."}, {"viet": "Chúng tôi cảm thấy phấn chấn vì cuộc đi bộ dọc bãi biển.", "eng": "We felt exhilarated by our walk along the beach."}, {"viet": "Chúng tôi đã không gặp khó khăn gì trong việc tìm ra ngôi nhà.", "eng": "We had no difficulty in finding the house."}, {"viet": "Chúng tôi đã náu mình trong một biệt thự đẹp nhất ở miền Nam nước Pháp.", "eng": "We have ensconced ourselves in the most beautiful villa in the South of France."}, {"viet": "Chúng tôi đã nghe một cuộc nói chuyện rất thú vị về nước Nhật.", "eng": "We heard a most interesting talk about Japan."}, {"viet": "Ngày mai chúng tôi sẽ nhập nó về.", "eng": "We'll have it in tomorrow."}, {"viet": "Chúng ta phải điều tra thêm về vấn đề.", "eng": "We must enquire further into the matter."}, {"viet": "Chúng ta cần tìm ra một chiến lược lược quảng cáo thành công.", "eng": "We need to come up with a winning advertising strategy."}, {"viet": "Chúng tôi thực sự không cần đến mọi kiểu mêlô đó!", "eng": "We really don't need all this ridiculous melodrama!"}, {"viet": "Chúng ta sẽ trở thành trò cười nếu chúng ta xuất bản cuốn sách trong tình trạng này.", "eng": "We should become a laughing stock if we published the book in this state."}, {"viet": "Chúng tôi cố gắng an ủi cô ấy khi chó của cô ấy chết.", "eng": "We tried to console her when her dog died."}, {"viet": "Tất cả chúng tôi đã sẵn sàng lên đường thì chuông điện thoại réo.", "eng": "We were all set to go when the telephone rang."}, {"viet": "Chúng tôi bị mất điện ba tiếng đồng hồ nhưng bây giờ thì có lại rồi.", "eng": "We were without electricity for three hours but it's on again now."}, {"viet": "Giàu kinh nghiệm trong ngón nghề quyến rũ.", "eng": "Well-practised in the arts of seduction."}, {"viet": "À, ông Mori, bệnh tình ra sao nào?", "eng": "Well, Mr. Mori, what seems to be the problem?"}, {"viet": "Ông có thể bảo đảm số hàng đặt hàng năm là bao nhiêu?", "eng": "What's the annual order you can guarantee?"}, {"viet": "Uống rượu có ích lợi gì?", "eng": "What are the advantages of drinking?"}, {"viet": "Hôm nay các bạn đã làm gì ở lớp?", "eng": "What did you do today in class?"}, {"viet": "Ai cho anh cái quyền bảo tôi phải làm thế này thế nọ?", "eng": "What gives you the right to tell me what to do?"}, {"viet": "Tiền ở New Zealand gọi là gì?", "eng": "What is the name of your money in New Zealand?"}, {"viet": "Ở nước bạn có các loại chế độ nghỉ thai sản gì?", "eng": "What kinds of maternity leave systems are there in your country?"}, {"viet": "Ông ấy đã thuyết trình về chủ đề gì ở lớp vậy?", "eng": "What subject matter did he lecture on in class?"}, {"viet": "Khi một người bị bệnh hay lây, anh ta thường bị cách ly ( khỏi những người khác ).", "eng": "When a person has an infectious disease, he is isolated ( from other people )."}, {"viet": "Khi con trai bà ấy chết trận, một nỗi trống vắng ngự trị đời bà.", "eng": "When her son was killed in the war, there was a great blank in her life."}, {"viet": "Khi cô ấy trở lại cô ấy thấy rằng nhiều thứ đã thay đổi trong những năm cô ấy đi vắng.", "eng": "When she came back, she found that much had changed in the intervening years."}, {"viet": "Khi công việc gặp trở ngại, anh chỉ cần nghiến răng lại và kiên trì.", "eng": "When things get difficult, you just have to grit your teeth and persevere."}, {"viet": "Tôi có thể chuyển đổi tiền của tôi lấy nhân dân tệ Trung Quốc ở đâu?", "eng": "Where can I Convert my money for Chinese Yuan?"}, {"viet": "Nước nào có số dân đông nhất?", "eng": "Which country has the largest population?"}, {"viet": "Bất cứ ai vào trước thì sẽ được nhận thưởng.", "eng": "Whichever comes in first receives the prize."}, {"viet": "Cái thằng cha đi xe đạp có cái ghi đông dài nghêu kia là ai vậy?", "eng": "Who is that guy riding the bike with ape hangers?"}, {"viet": "Theo bạn thì tại sao một số người trở nên vô gia cư?", "eng": "Why do you think that some people become homeless?"}, {"viet": "Liệu 20 pao có đủ cho những thứ cần thiết tối thiểu ngay cho anh không?", "eng": "Will 20 pounds be enough for your immediate needs?"}, {"viet": "Anh gửi cái này cho tôi qua bưu điện được không?'.", "eng": "Will you post this for me?'."}, {"viet": "Với cái chết của ông ta một giai đoạn quan trọng trong lịch sử công nghiệp đã chấm dứt.", "eng": "With his death a chapter in the history of industry was closed."}, {"viet": "Làm việc tại một làng hẻo lánh tách biệt với thế giới bên ngoài.", "eng": "Working in a remote village cut off from the outside world."}, {"viet": "Bạn có muốn tự mình làm chủ không?", "eng": "Would you like to be self-employed?"}, {"viet": "Xin ông vui lòng gởi cho chúng tôi một mẫu trong thời gian sớm nhất có thể được đối với ông nhé?", "eng": "Would you please send us a sample at your earliest convenience?"}, {"viet": "Đúng vậy, nhưng mẹ và em thích câu chuyện đó.", "eng": "Yes, but we liked the story."}, {"viet": "Vâng, chúng tôi có thể làm điều này cho ông.", "eng": "Yes, we just can do this for you."}, {"viet": "Anh phải kiểm tra lại các con số này lần nữa, cộng vào thấy không đúng.", "eng": "You'll have to go over these figures again, they don't add up."}, {"viet": "Anh đang lên cân một chút đấy, phải vậy không?", "eng": "You're putting on a little weight, aren't you?"}, {"viet": "Trong chế độ ăn kiêng này anh không được ăn đường.", "eng": "You are not allowed to eat sugar on this diet."}, {"viet": "Anh không thể ngăn cản chúng tôi đi nếu chúng tôi muốn.", "eng": "You can't stop us going if we want to."}, {"viet": "Cô có thể liên lạc với tôi qua số điện thoại 470856.", "eng": "You can reach me at 470856."}, {"viet": "Anh quét sơn, còn tôi sẽ dán giấy lên tường.", "eng": "You do the painting and I'll do the papering."}, {"viet": "Phải nhường đường cho xe từ phía trái lên.", "eng": "You have to give way to traffic coming from the left."}, {"viet": "Anh có thể bị gọi để đưa ra chứng cớ trong vụ xét xử này.", "eng": "You may be called to give evidence at the trial."}, {"viet": "Anh phải bù thời gian anh đã lãng phí chiều nay bằng cách làm việc muộn vào tối nay.", "eng": "You must make up the time you wasted this afternoon by working late tonight."}, {"viet": "Chị đặt tất cả những lá thư vào một trong những cái này.", "eng": "You put all the letters in one of these."}, {"viet": "Anh cần phải làm cho phần thực hành của mình đúng với nguyên lý.", "eng": "You should square your practice with your principles."}, {"viet": "Bạn đã ngáy trên xe lửa.", "eng": "You were snoring in the train."}, {"viet": "Lý lẽ của anh sẽ không đứng vững ( trước sự nghiên cứu, xem xét kỹ lưỡng ).", "eng": "Your argument just won't stand up ( to close scrutiny )."}, {"viet": "Kế hoạch của anh tạm được, nhưng có một số điểm anh đã quên không xem xét.", "eng": "Your plan is a good one as far as it goes, but there are several points you've forgotten to consider."}]