[{"viet": "Số 1, 3, 5, 7 là những số lẻ.", "eng": "1, 3, 5 and 7 are odd numbers."}, {"viet": "Nhà kinh doanh phải tránh để các khách hàng của anh ta bất mãn.", "eng": "A businessman must avoid leaving his customers unaccommodated."}, {"viet": "Một thành phố có nhiều công viên nhỏ.", "eng": "A city endowed with numerous small parks."}, {"viet": "Một quốc gia được mọi người ca ngợi như là một nước bảo trợ nền dân chủ.", "eng": "A country admired as a buttress of democracy."}, {"viet": "Một cuộc biểu tình đã được tổ chức để phản đối sự ngược đãi đối với tù nhân.", "eng": "A demonstration was planned to protest the mistreatment of prisoners."}, {"viet": "Gương mặt thay đổi vì có những nét và nếp nhăn nho nhỏ hằn lên.", "eng": "A face etched with a patina of fine lines and tiny wrinkles."}, {"viet": "Một ngọn lửa sẽ kêu xèo xèo nếu rẩy nước lên.", "eng": "A fire hisses if water is thrown on it."}, {"viet": "Một cô bé thè lưỡi ra với anh mình.", "eng": "A girl sticking her tongue out at her brother."}, {"viet": "Một khách trọ đã hút thuốc làm cháy thủng một lỗ trên tấm trải giường.", "eng": "A guest burnt a hole in the bed sheet with a cigarette."}, {"viet": "Một bệnh viện có thể được các viên chức nhà nước thanh tra.", "eng": "A hospital that was visitable by state officials."}, {"viet": "Một phong cảnh có cây cối và một vài luống hoa chen lẫn.", "eng": "A landscape of trees interspersed with a few flowerbeds."}, {"viet": "Một con thằn lằn nhỏ màu nâu bám trên hòn đá không động đậy đang quan sát một con côn trùng.", "eng": "A little brown lizard sat on the stone without moving watching an insect."}, {"viet": "Một người ở địa vị ông ấy trong xã hội khi làm gì cậu phải dè chừng.", "eng": "A man in his position in society should be careful what he does."}, {"viet": "Một mô hình của phi trường mới được đề nghị.", "eng": "A model of the proposed new airport."}, {"viet": "Một bộ những quy tắc mới phải học.", "eng": "A new set of rules to learn."}, {"viet": "Một đảng ủng hộ sự không phân biệt chủng tộc.", "eng": "A party that stands for racial tolerance."}, {"viet": "Một đống đất bên con hào mới đào.", "eng": "A pile of dirt beside a newly-dug trench."}, {"viet": "Con đường dốc dẫn lên sườn núi.", "eng": "A precipitous path led up the mountain side."}, {"viet": "Nhà ga xe lửa không phải là chỗ để bỏ đứa trẻ đứng một mình vào ban đêm.", "eng": "A railway station is no place for a children to be left alone at night."}, {"viet": "Một hoả tiễn được điều khiển bởi những phi hành gia đã được huấn luyện.", "eng": "A rocket manned by trained astronauts."}, {"viet": "Một bài tường thuật gây giật gân về một tội ác bẩn thỉu.", "eng": "A sensationalized account of a squalid crime."}, {"viet": "Một người khéo tay có thể tách đá phiến thành nhiều lớp.", "eng": "A skilled person can split slate into layers."}, {"viet": "Một loại dầu gội đầu đặc biệt làm cho tóc của bạn mượt mà hơn.", "eng": "A special shampoo to strengthen your hair."}, {"viet": "Một văn phong kết hợp hình thức với chức năng.", "eng": "A style that weds form and function."}, {"viet": "Một cuốn sách giáo khoa dạy các nguyên lý hình học cơ bản.", "eng": "A textbook which teaches the basic principles of geometry."}, {"viet": "Một bộ sưu tập có giá trị về đồ gốm Nhật.", "eng": "A valuable collection of Japanese pottery."}, {"viet": "Một lời phóng đại bừa bãi về các sự kiện.", "eng": "A wild overstatement of the facts."}, {"viet": "Theo Kinh Thánh, thượng đế đã tạo ra con người giống như hình ảnh của ông ta.", "eng": "According to the Bible, god created man in his image."}, {"viet": "Có thái độ phản đối về đề nghị thiết lập một đường cao tốc mới ở khu vực lân cận.", "eng": "Adopt a nimby attitude to the proposal for a new motorway."}, {"viet": "Sau khi nghe cuộc nói chuyện của bà ta về máy vi tính, tôi lấy làm tiếc phải nói rằng tôi không hiểu biết hơn chút nào.", "eng": "After hearing her talk on computers I'm afraid I'm none the wiser."}, {"viet": "Sau vụ ném bom chỉ vài ngôi nhà còn đứng.", "eng": "After the bombing only a few houses were left standing."}, {"viet": "Không khí là một hỗn hợp chứ không phải là một hợp chất của các khí.", "eng": "Air is a mixture, not a compound, of gases."}, {"viet": "Tất cả các phòng của chúng tôi đều có nước máy nóng và lạnh.", "eng": "All our rooms have hot and cold running water."}, {"viet": "Tất cả các biến cố này đều đã được tiết lộ do tiên tri.", "eng": "All these events had been revealed by prophecy."}, {"viet": "Tôi có nhầm không khi nghĩ rằng trời đang trở lạnh?", "eng": "Am I wrong in thinking that it is getting colder?"}, {"viet": "Số thu nhận hàng năm cho nghĩa vụ quân sự là 100.000 người.", "eng": "An annual intake of 100,000 men for military service."}, {"viet": "Một kỳ thi thật là cực kỳ gay go.", "eng": "An exam that was a real killer."}, {"viet": "Một lúc yên lặng để tỏ lòng tôn kính đối với người đã chết.", "eng": "An interval of silence to show respect for the dead."}, {"viet": "Một căn nhà không thể xây cất được, do thiết kế khác thường.", "eng": "An unbuildable house, given the eccentric design."}, {"viet": "Và ai là ca sĩ bạn yêu thích?", "eng": "And who is your favourite singer?"}, {"viet": "Bất cứ ai muốn trở thành một nhà soạn nhạc đều phải thông hiểu những kỹ thuật âm nhạc và cách sử dụng chúng để diễn tả niềm vui, nỗi buồn, sự phấn khởi, sự hài lòng và nhiều thứ tình cảm khác của con người.", "eng": "Anyone who wants to become a composer must thoroughly understand the techniques of music and how to use them to express happiness, sadness, excitement, contentment, and many other human feelings."}, {"viet": "Có những món nào khác anh có thể giới thiệu không?", "eng": "Are there any other dishes you could recommend?"}, {"viet": "Ông sẽ lên phòng ngay bây giờ chứ?", "eng": "Are you going to your room now?"}, {"viet": "Quân nhân không được phép rời căn cứ.", "eng": "Army personnel are not allowed to leave the base."}, {"viet": "Như thể không chắc mình đang ở đâu, cô ta do dự và quan sát xung quanh.", "eng": "As if unsure of where she was, she hesitated and looked round."}, {"viet": "Cứ hỏi tôi bất cứ điều gì bạn thích-bạn không tìm được nhược điểm của tôi đâu.", "eng": "Ask me anything you like-you won't catch me out."}, {"viet": "Trong ký ức anh mơ hồ nhận ra là đã từng gặp nàng rồi.", "eng": "At the back of his mind was the vague idea that he had met her before."}, {"viet": "Kính nể vì sự trang nghiêm của buổi lễ.", "eng": "Awed by the solemnity of the occasion."}, {"viet": "Bị bắt về tội ăn cắp của công.", "eng": "Be caught with one's fingers in the till."}, {"viet": "Phải chịu đựng toàn bộ mũi dùi chính của cuộc tấn công.", "eng": "Bear the full brunt of the attack."}, {"viet": "Bắt ai phải theo ý muốn của mình.", "eng": "Bend somebody to one's will."}, {"viet": "Bob, đến lúc này anh đã sẵn sàng đưa ra đánh giá về tài chính chưa?", "eng": "Bob, are you prepared at this stage to make a financial evaluation?"}, {"viet": "Anh quốc đã chính thức công nhận chính thể mới.", "eng": "Britain has recognized the new regime."}, {"viet": "Nhưng làm sao anh biết được điều đó? ông ta ngắt lời.", "eng": "But how do you know that? he interposed."}, {"viet": "Nhưng nam giới còn được đề bạt thăng cấp, còn nữ giới thì không.", "eng": "But then the men are promoted and the women are not."}, {"viet": "Theo đồng hồ tôi bây giờ là hai giờ.", "eng": "By my watch it is two o'clock."}, {"viet": "Nếu tôi đầu tư, tôi có thể chắc chắn có lãi không?", "eng": "Can I be sure of a profit if I invest?"}, {"viet": "Kết quả này có thể được tái tạo trong một phòng thí nghiệm không?", "eng": "Can this effect be reproduced in a laboratory?"}, {"viet": "Anh vui lòng giữ đường dây rảnh?", "eng": "Can you keep the line free?"}, {"viet": "Vui lòng cho tôi biết tôi đi đến bưu điện bằng cách nào?", "eng": "Can you tell me which way I go to get to the post office?"}, {"viet": "Nhường lãnh thổ cho một lân bang.", "eng": "Cede territory to a neighbouring state."}, {"viet": "Bọn trẻ theo sát gót mẹ của chúng.", "eng": "Children tagging along behind their mother."}, {"viet": "Đi nện gót ủng quanh phòng.", "eng": "Clumping about the room in heavy boots."}, {"viet": "Các bài ghi âm bằng đĩa compact phát ra âm thanh tuyệt hảo.", "eng": "Compact disc recordings give excellent sound reproduction."}, {"viet": "Gởi đứa bé cho người chú chăm sóc.", "eng": "Consign a child to its uncle's care."}, {"viet": "Anh có thể lấy hộ tôi quyển sách từ cái giá trên cùng kia không?", "eng": "Could you get me that book down from the top shelf?"}, {"viet": "Những đôi trai gái hôn hít vuốt ve nhau trên sàn nhảy.", "eng": "Couples smooching on the dance floor."}, {"viet": "Hoa thủy tiên và huệ tây nở về mùa xuân.", "eng": "Daffodils and lilies flowering in the spring."}, {"viet": "Nhân khẩu học có tiếng là môn không được quan tâm của kinh tế học.", "eng": "Demography has a reputation for being the stepchild of economics."}, {"viet": "Có phải nền dân chủ có nguồn gốc ở Athens không?", "eng": "Did democracy have its beginnings in Athens?"}, {"viet": "Con cũng lấy rác trong phòng bọn trẻ ra rồi chứ?", "eng": "Did you take out the garbage from the kid's rooms as well?"}, {"viet": "Bảo cậu làm gì thì cậu cứ làm và đừng có cãi với tôi!", "eng": "Do as you're told and don't give me any hassle!"}, {"viet": "Phụ nữ có muốn làm như thế không?", "eng": "Do women want to do that?"}, {"viet": "Cô có bản đồ Thành phố này không?", "eng": "Do you have a map of this town?"}, {"viet": "Bạn có biết người nào nuôi một con thú cưng khác thường không?", "eng": "Do you know anyone who owns an unusual pet?"}, {"viet": "Bạn có thường đến thư viện không?", "eng": "Do you often go to the library?"}, {"viet": "Bạn có nghĩ rằng thế giới này đang trở thành một nơi sống tốt hơn không?", "eng": "Do you think that the world is becoming a better place to live?"}, {"viet": "Chúng tôi đến chậm một tí có sao không?", "eng": "Does it matter if we're a bit late?"}, {"viet": "Đừng đối xử khắt khe quá như thế với đứa em gái của chị.", "eng": "Don't be so horrid to your little sister."}, {"viet": "Đừng có nổi nóng lên vì cái cửa sổ bị vỡ.", "eng": "Don't get mad about the broken window."}, {"viet": "Đừng có đỗ xe ôtô ở đấy-anh có thể bị kẹt trong đó.", "eng": "Don't park there-you'll probably get jammed in."}, {"viet": "Đừng tìm cách nhập nhằng công việc với vui chơi.", "eng": "Don't try to mix business with pleasure."}, {"viet": "Nhỏ dầu ăn vào lòng đỏ trứng đánh nổi.", "eng": "Dribble the oil into the beaten egg yolks."}, {"viet": "Những nỗ lực trước đây nhằm tung ra các tạp chí địa phương hào nhoáng hấp dẫn dành cho phụ nữ.", "eng": "Earlier attempts to launch glossy regionals for women."}, {"viet": "Tiếng Anh là một môn học trong chương trình học chính khoá.", "eng": "English is a subject on the core curriculum."}, {"viet": "Everest là núi cao nhất trên thế giới.", "eng": "Everest is the highest mountain in the world."}, {"viet": "Xin lỗi, cho tôi hỏi quầy thông tin ở đâu ạ?", "eng": "Excuse me, but where is the information counter?"}, {"viet": "Những người hướng ngoại thường thích nói chuyện sôi nổi hơn là ngồi suy ngẫm về ý nghĩa cuộc sống.", "eng": "Extroverts prefer lively conversation to brooding on the meaning of life."}, {"viet": "Cảm thấy băn khoăn về chuyện ra đi có phải là khôn ngoan không.", "eng": "Feel doubtful about the wisdom of going."}, {"viet": "Đọc một mạch xong hết quyển sách.", "eng": "Finish reading a book at one sitting."}, {"viet": "Bông hoa thường thụ tinh nhờ ong khi chúng đi hút mật.", "eng": "Flowers are often fertilized by bees as they gather nectar."}, {"viet": "Đối với người luôn cảm thấy cô đơn thì bạn đã có một lựa chọn quan trọng.", "eng": "For someone who always feels lonely, you made a big choice."}, {"viet": "Lũ trẻ hoảng hốt đang gọi mẹ của chúng tới.", "eng": "Frightened children were calling for their mothers."}, {"viet": "Nói chung, đó là một cách giải quyết rất công bằng.", "eng": "Generally speaking, it's quite a fair settlement."}, {"viet": "Nhấc nó lên: nó nhỏ quá nên không thấy gì hết.", "eng": "Give him a lift: he's too small to see anything."}, {"viet": "Đi dọc theo đường này cho đến khi gặp chốt đèn giao thông.", "eng": "Go down the road till you reach the traffic lights."}, {"viet": "Khoai tây loại A là loại có chất lượng tốt nhất.", "eng": "Grade A potatoes are the best in quality."}, {"viet": "Niềm hạnh phúc không có mối nguy nào có thể làm suy giảm được.", "eng": "Happiness that no fear could alloy."}, {"viet": "Anh có tin những gì hắn nói không?", "eng": "Have you any faith in what he says?"}, {"viet": "Anh đã tìm ra cách trả tiền cho căn nhà đó chưa?", "eng": "Have you found a way to pay for that house yet?"}, {"viet": "Sau khi trượt các kì thi về môn tiếng Pháp, tôi quyết định tập trung vào các môn khoa học.", "eng": "Having failed my French exams, I decided to concentrate on science subjects."}, {"viet": "Nó e ngại rằng lý lịch tội lỗi của nó sẽ ảnh hưởng không tốt tới nó khi xin việc.", "eng": "He's afraid that his criminal record will held against him when he applies for jobs."}, {"viet": "Ông ấy đang đi quyên góp ( tiền ) để cứu tế nạn đói.", "eng": "He's collecting ( money ) for famine relief."}, {"viet": "Anh ta đến muộn-chắc là anh ta đã bị kẹt ở một nơi ách tắc giao thông.", "eng": "He's late-he's probably stuck in a traffic jam."}, {"viet": "Hắn ta là một thằng nhát gan cho nên nó chẳng dám mở miệng đâu.", "eng": "He's such a nervous chap he wouldn't say boo to a goose."}, {"viet": "Ông ấy phân công nhiệm vụ cho mỗi chúng tôi.", "eng": "He allocated tasks to each of us."}, {"viet": "Anh ta trở thành người được ông chú chăm sóc sau khi bố mẹ anh qua đời.", "eng": "He became his uncle's charge after his parents died."}, {"viet": "Ông ấy đi ra vẫy vẫy tập hồ sơ với đám đông.", "eng": "He came out waving the document at the crowd."}, {"viet": "Ông ấy chộp lấy sợi dây chúng tôi đã quăng cho ông ta.", "eng": "He clutched the rope we threw to him."}, {"viet": "Anh ta cân nhắc về việc mua một chiếc xe mới, nhưng cuối cùng không mua.", "eng": "He debated buying a new car, but didn't in the end."}, {"viet": "Hắn thực sự có những tư tưởng khá điên rồ.", "eng": "He does have some pretty loony ideas."}, {"viet": "Hắn ta lẩn trốn khỏi bị bắt trong ba ngày.", "eng": "He evaded capture for three days."}, {"viet": "Anh ta thấy khó mà sống được trong giới hạn khoản thu nhập của mình.", "eng": "He finds it hard to live within his income."}, {"viet": "Anh ấy kéo đàn viôlông cho chúng tôi nghe một giai điệu.", "eng": "He gave us a tune on his fiddle."}, {"viet": "Đôi mắt hắn loé lên sự độc ác.", "eng": "He had a wicked glint in his eyes."}, {"viet": "Anh ta có mối quan hệ công việc tốt đẹp với chủ.", "eng": "He has a good working relationship with his boss."}, {"viet": "Nó đã phát triển về cả chiều cao lẫn trọng lượng.", "eng": "He has grown both in height and weight."}, {"viet": "Anh ta không có đủ kinh nghiệm làm việc đối với công việc này.", "eng": "He hasn't had enough work experience for the job."}, {"viet": "Anh ấy là người làm sáng giá cho nghề nghiệp của mình.", "eng": "He is an ornament to his profession."}, {"viet": "Ông ta bảo thủ đến nỗi không thể nào tranh cãi với ông ấy.", "eng": "He is so bigoted that it is impossible to agree with him."}, {"viet": "Anh ta cứ tiếp tục than vãn mãi.", "eng": "He kept moaning on and on."}, {"viet": "Anh ta sống ở nhà số 95 quảng trường Russell.", "eng": "He lives at No 95 Russell Square."}, {"viet": "Ông ta xin lỗi và rời khỏi cuộc họp.", "eng": "He made his excuses and left the meeting."}, {"viet": "Anh ta gần như lúc nào cũng thắt nơ cổ áo.", "eng": "He nearly always wears a bow tie."}, {"viet": "Ông ấy vỗ nhẹ đầu cô bé một cách trìu mến.", "eng": "He patted her affectionately on the head."}, {"viet": "Anh ấy đã hứa với cô ta nghỉ tuần trăng mật tại Paris khi họ cưới nhau và cô ta đã nhắc anh điều đó.", "eng": "He promised her a honeymoon in Paris when they got married, and she asked held him to it."}, {"viet": "Hắn nói rùm beng với tôi về lỗi lầm của tôi.", "eng": "He ranted on at me about my mistakes."}, {"viet": "Anh ấy từ chối quyết định của toà án cho phép nộp tiền bảo lãnh.", "eng": "He repudiated the court's decision to offer bail."}, {"viet": "Ông ấy là người đi lễ đều đặn.", "eng": "He's a regular church-goer."}, {"viet": "Hắn đang tung tiền của hắn ta ra khoe mẽ với mọi người.", "eng": "He's flashing his money around."}, {"viet": "Anh ấy không thuộc mẫu người thích hoạt động ở ngoài.", "eng": "He's not really an outdoor type."}, {"viet": "Ông ta buồn bã khi nhớ đến cái chết của bà ta.", "eng": "He saddened at the memory of her death."}, {"viet": "Nó làm bỏng tay trên một ống hơi nóng.", "eng": "He seared his hand on a hot steam pipe."}, {"viet": "Ông ta đã thể hiện sự điềm tĩnh đáng phục trong một tình thế khó khăn.", "eng": "He showed great composure in a difficult situation."}, {"viet": "Ông ấy để cả đời để cố gắng cải thiện điều kiện sống của nhân dân lao động.", "eng": "He spent his life trying to improve the living conditions of the masses."}, {"viet": "Anh ta thôi không ứng cử để nhường cho một ứng cử viên tốt hơn.", "eng": "He stood down in the favour of a better candidate."}, {"viet": "Anh ta lấy bóng từ chân cầu thủ đối phương sau đó đá bóng sang sân đối phương.", "eng": "He tackled the other player and kicked the ball across the field."}, {"viet": "Ông ta bảo chúng tôi coi chừng đường đóng băng.", "eng": "He told us to beware of the icy road."}, {"viet": "Anh ta cố gắng lấy lòng người hàng xóm mới.", "eng": "He tried to make time with the new neighbour."}, {"viet": "Ông ta đã trút hết cơn thịnh nộ lên đầu người vợ nhẫn nhục.", "eng": "He vented his anger on his long-suffering wife."}, {"viet": "Anh ta hành động kì quặc đến nỗi phải giữ ở nhà nuôi người tâm thần.", "eng": "He was acting so strangely that he had to be put away."}, {"viet": "Ông ta được chôn cất cùng với vợ.", "eng": "He was buried with his wife."}, {"viet": "Anh ta say mê với ý tưởng, một đứa bé tuyệt vời, một lâu đài trong một cách rừng kì diệu.", "eng": "He was enchanted with the idea, an enchanting child, a palace in an enchanted wood."}, {"viet": "Ông ta bực mình vì những lời phàn nàn dai dẳng của họ.", "eng": "He was irritated by their perpetual complaints."}, {"viet": "Cảnh tượng khá hùng vĩ làm ông ta phải kính sợ.", "eng": "He was over-awed by rather grand surroundings."}, {"viet": "Hắn khốn khổ đến mức đã có ý nghĩ nghiêm chỉnh rằng hắn sẽ tự kết liễu đời mình.", "eng": "He was so miserable that he seriously thought about ending it all."}, {"viet": "Anh ta cố gắng không tiếc sức để cứu bệnh viện khỏi bị đóng cửa.", "eng": "He was unsparing in his efforts to save the hospital from closure."}, {"viet": "Sáng nay anh ta đi lên thành phố.", "eng": "He went up to town this morning."}, {"viet": "Anh ta làm việc tốt nhất vào buổi sáng.", "eng": "He works best in the mornings."}, {"viet": "Những cơn mưa lớn gây ra nhiều vấn đề, ví dụ như đường ngập lụt.", "eng": "Heavy rains cause many problems, for example flooding the roads."}, {"viet": "Hành vi xấu xa của cô ấy là một vết nhơ cho gia đình.", "eng": "Her bad behaviour was a stigma on the family."}, {"viet": "Những lời kêu gọi giúp đỡ của cô ta không nhận được sự đáp ứng.", "eng": "Her cries for help met with no response."}, {"viet": "Mặt của cô ta tươi cười rạng rỡ.", "eng": "Her face was wreathed in smiles."}, {"viet": "Tim của cô ấy như nhảy lên khi cô ấy nhìn thấy anh ta.", "eng": "Her heart lifted at the sight of him."}, {"viet": "Cuộc đời của cô ta chỉ là sự vị kỷ to tướng.", "eng": "Her life is just one big ego-trip."}, {"viet": "Quan điểm của bà ấy rất có ảnh hưởng đến vị chủ tịch.", "eng": "Her opinion carries great weight with the chairman."}, {"viet": "Những lời nhận xét của bà ấy không đúng chỗ và rất xúc phạm.", "eng": "Her remarks were in very poor taste."}, {"viet": "Sự cống hiến cao cả của bà ta cho sự nghiệp đó.", "eng": "Her sublime devotion to the cause."}, {"viet": "Đây là một chiếc giày của tôi, nhưng còn chiếc kia đâu?", "eng": "Here's one of my shoes, but where's its fellow?"}, {"viet": "Mượn thêm một giáo viên sẽ cải thiện được tình hình nhưng chúng ta vẫn cần thêm sách và bàn.", "eng": "Hiring an extra teacher will ameliorate the situation, but we still need more books and desk."}, {"viet": "Hành vi của anh ta tại bữa tiệc thật là tồi tệ.", "eng": "His behaviour at the party was most regrettable."}, {"viet": "Các đồng nghiệp của ông ta chúc ông ta hạnh phúc lúc về hưu.", "eng": "His colleagues wished him happiness on his retirement."}, {"viet": "Chị của cậu ta đã từng là người chỉ dẫn, cố vấn và là bạn của cậu ta.", "eng": "His elder sister had been his guide, counselor and friend."}, {"viet": "Tình trạng tài chính của ông ta thật rối rắm quá thể.", "eng": "His financial affairs are in such a tangle."}, {"viet": "Toàn bộ các ý kiến của ông ta quá lỗi thời rồi.", "eng": "His ideas are all terribly old hat."}, {"viet": "Cuộc đời anh ta chỉ dành cho việc truy hoan.", "eng": "His life is spent in the pursuit of pleasure."}, {"viet": "Những cuốn tiểu thuyết của anh ta phần lớn thuộc loại tự truyện.", "eng": "His novels are largely autobiographical."}, {"viet": "Sự có mặt của ông ấy làm cho buổi lễ đó thêm phần long trọng.", "eng": "His presence lent dignity to the occasion."}, {"viet": "Anh ta không làm sao thắng được sự rụt rè của mình.", "eng": "His shyness got the better of him."}, {"viet": "Đứa con gái mười tuổi của anh ta hoàn toàn mê trở thành diễn viên.", "eng": "His ten-year old daughter is completely stage-struck."}, {"viet": "Tác phẩm của anh ấy khó xếp loại một cách chính xác.", "eng": "His work is difficult to label accurately."}, {"viet": "Ngày nay lương thiện hình như không có giá trị nữa.", "eng": "Honesty seems to be rather at a discount day."}, {"viet": "Thật bực mình, tôi bỏ quên cái ví ở nhà rồi!", "eng": "How annoying, I've left my wallet at home!"}, {"viet": "Anh ấy đã xoay xở thế nào trong khi vợ anh ấy đi xa?", "eng": "How did he make out while his wife was away?"}, {"viet": "Anh nghĩ thế nào về những cơ hội thành công của anh?", "eng": "How do you view your chances of success?"}, {"viet": "Chuyến bay đến Hawaii mất bao lâu?", "eng": "How long is the flight to Hawaii?"}, {"viet": "Có bao nhiêu người ở đấy?", "eng": "How many people were there?"}, {"viet": "Cái nón cao bồi này giá bao nhiêu ạ?", "eng": "How much is this cowboy hat?"}, {"viet": "Ông muốn thanh toán như thế nào?", "eng": "How would you like to pay?"}, {"viet": "Tốt hơn tôi nên bắt đầu cất tất cả đồ chơi của nó đi.", "eng": "I'd better start packing all of his toys away."}, {"viet": "Tôi rất mê chiếc xe đạp ấy, nhưng nó đắt quá.", "eng": "I'd love that bike, but it costs the earth."}, {"viet": "Tôi sẽ cho ông bản ước tính sơ bộ về các chi phí.", "eng": "I'll give you a rough estimate of the costs."}, {"viet": "Tôi sẽ cử nhân viên khuân vác đến phòng của ông để giúp ông mang hành lý.", "eng": "I'll send porters to your room and help you with the luggage."}, {"viet": "Tôi sợ là tiền của tôi không đủ để nghỉ ở nước ngoài năm nay.", "eng": "I'm afraid my finances won't run to a holiday abroad this year."}, {"viet": "Tôi khuyên cậu điều này vì lợi ích của chính cậu.", "eng": "I'm giving you this advice for your own good."}, {"viet": "Tôi chỉ cố ăn ít hơn và vận động nhiều hơn.", "eng": "I'm just trying to eat less and get more exercise."}, {"viet": "Tôi chỉ quan tâm tới công việc nhà trường của em thôi, thầy giáo nói! Cuộc đời riêng của em không phải là mối quan tâm của tôi.", "eng": "I'm only worried about your school work, said the teacher! Your private life isn't my concern."}, {"viet": "Tôi rất tiếc phải nói rằng tôi không thể nhận công việc ấy.", "eng": "I'm sorry to say that I won't be able to accept the job."}, {"viet": "Tôi không thể nào thoát khỏi cái cảm giác uể oải này.", "eng": "I'm unable to throw off this feeling of inertia."}, {"viet": "Tôi bận việc không ngừng từ buổi sáng.", "eng": "I've been on the run ever since the morning."}, {"viet": "Con bị táo bón quá mẹ ơi! Uống thuốc xổ đi.", "eng": "I've got terrible constipation, Mum! Take a laxative."}, {"viet": "Trong đời tôi, tôi chưa bao giờ nói xấu anh ấy.", "eng": "I've never spoken ill of him in my life."}, {"viet": "Tôi hành động phù hợp với nguyên tắc của tôi.", "eng": "I acted in conformity with my principles."}, {"viet": "Tôi bị bao vây liên tục bởi những vị khách từ nước ngoài tới.", "eng": "I am besieged with visitors from a broad."}, {"viet": "Tôi chán nghe những vấn đề khó khăn của anh.", "eng": "I am weary of hearing about your problems."}, {"viet": "Tôi nghĩ bà là bà Johnson, phải vậy không?", "eng": "I believe you're Mrs. Johnson, aren't you?"}, {"viet": "Tôi không thể đến vào chủ nhật được: tôi mắc bận rồi.", "eng": "I can't come on Sunday: I'm already committed."}, {"viet": "Không có kính tôi chẳng nhìn thấy quái gì hết.", "eng": "I can't see a blessed thing without my glasses."}, {"viet": "Tôi sẽ không bao giờ báo đáp được hết bao công ơn của cô ấy đối với tôi.", "eng": "I can never repay her many kindnesses to me."}, {"viet": "Bây giờ tôi không thể trả tiền mua những cuốn sách này,.", "eng": "I can't pay for the books now."}, {"viet": "Tôi nghe thấy tiếng ủng nặng của nó bước thình thịch lên cầu thang.", "eng": "I could hear him thudding about upstairs in his heavy boots."}, {"viet": "Tôi muốn món trứng của tôi luộc sơ.", "eng": "I'd like my egg soft-boiled."}, {"viet": "Hôm qua tôi chẳng nhận được một tấm thiệp nào nhưng hôm nay có vài tấm.", "eng": "I didn't get any cards yesterday but today there are a few."}, {"viet": "Tôi chẳng quan tâm một chút nào đến việc cô ta có ở lại hay không.", "eng": "I don't care a whit whether she stays or not."}, {"viet": "Tôi không thích phải len lỏi qua các đường phố đông nghẹt của London.", "eng": "I don't like having to navigate London's crowded streets."}, {"viet": "Tôi nghĩ ông không hiểu được mức độ nghiêm trọng của việc này.", "eng": "I don't think you understand the seriousness of this matter."}, {"viet": "Tôi không hiểu anh nói gì.", "eng": "I don't get your meaning."}, {"viet": "Tôi nhích chiếc ghế của tôi dần ra phía cửa.", "eng": "I edged my chair towards the door."}, {"viet": "Cô ta thì thầm Tôi cảm thấy rất sợ hãi.", "eng": "I feel very afraid, she whispered."}, {"viet": "Tôi quên để tấm bảng “ Xin đừng quấy rầy ”.", "eng": "I forget to place this Please do not disturb sign outside the door."}, {"viet": "Hôm nay tôi bị một phiếu phạt đỗ xe.", "eng": "I got a parking-ticket today."}, {"viet": "Tôi chợt có linh cảm về số nữ trang mất.", "eng": "I had a sudden intuition about the missing jewels."}, {"viet": "Tôi không nỡ lòng nào từ chối.", "eng": "I hadn't the heart to refuse."}, {"viet": "Tôi đến để chào ông sau khi nghe bài diễn văn tuyệt vời của ông tại Tòa Thị chính.", "eng": "I have come to pay you my respects after hearing your wonderful speech at the City Hall."}, {"viet": "Tôi đã liên lạc với máy tự động trả lời của anh ấy.", "eng": "I have reached his answering machine."}, {"viet": "Tôi chưa ăn miếng gì từ sáng đến giờ.", "eng": "I haven't had a bite of food since morning."}, {"viet": "Tôi nghe tin ông ấy qua đời với sự thương tiếc vô vàn.", "eng": "I heard of his death with great regret."}, {"viet": "Tôi mong là chúng ta sẽ không ngồi ngoài nắng.", "eng": "I hope we won't sit in the sun."}, {"viet": "Tôi luôn có một cuốn từ điển bên cạnh khi chơi ô chữ.", "eng": "I keep a dictionary beside me when I'm doing crosswords."}, {"viet": "Tôi gửi lại thư nhắn anh nơi cô thư ký của anh.", "eng": "I left a message for you with your secretary."}, {"viet": "Tôi sống ở số 107 đại lộ 41 mà.", "eng": "I live in No.107,41st Avenue."}, {"viet": "Tôi sẽ đến văn phòng của tôi.", "eng": "I'll go to my office."}, {"viet": "Lần sau tôi sẽ thử xem.", "eng": "I'll try it next time."}, {"viet": "Hôm nay tôi cảm thấy không khỏe như thường ngày.", "eng": "I'm feeling a bit below par today."}, {"viet": "Anh vẫn chưa cắt đứt quan hệ với em.", "eng": "I'm not finished with you yet."}, {"viet": "Tôi đang gạo kỹ môn sử của mình.", "eng": "I'm swotting up on my history."}, {"viet": "Tôi đã đọc sai những gì nêu ra trong các chỉ thị.", "eng": "I misread what the instructions said."}, {"viet": "Tôi cần một đoạn dây kim loại hay dây để buộc nó lại.", "eng": "I need a length of wire or string to tie it with."}, {"viet": "Tôi kể nàng vào nhóm bạn thân nhất của tôi.", "eng": "I number her among my closest friends."}, {"viet": "Tôi thích nhạc cổ điển hơn nhạc hiện đại.", "eng": "I prefer classical music to modern music."}, {"viet": "Tôi thật sự không thể ăn được món cá đã gọi.", "eng": "I really can't eat the fish I ordered."}, {"viet": "Tôi nhắc cô ta giá vé xe là bao nhiêu.", "eng": "I reminded her how much the fare was."}, {"viet": "Tôi quệt thành xe hơi vào tường.", "eng": "I scraped the side of my car against a wall."}, {"viet": "Tôi thì tôi ghét phải giam hãm trong phòng làm việc cả ngày.", "eng": "I should hate to be confined in an office all day."}, {"viet": "Tôi đã yêu cầu rõ ràng là phải dùng màu sơn đỏ, chứ không phải sơn đen.", "eng": "I stipulated red paint, not black."}, {"viet": "Tôi nghĩ là đầu tóc hoa râm làm cho ông có phần đạo mạo.", "eng": "I think grey hair makes you look rather distinguished."}, {"viet": "Tôi nghĩ mọi người trên khắp thế giới chắc là thích những dịp tụ họp như vậy.", "eng": "I think people all over the world must like gatherings like this."}, {"viet": "Tôi tưởng mình sẽ bị thuyên chuyển, nhưng cứ tình hình này, tôi sẽ phải tìm việc làm mới.", "eng": "I thought I might be transferred, but as it is, I shall have to look for a new job."}, {"viet": "Tôi cố lôi anh ta ra một chỗ.", "eng": "I tried to draw him aside."}, {"viet": "Tớ phải đánh máy những bức thư này.", "eng": "I've got to do type these letters."}, {"viet": "Tôi muốn đổi một vài đô la Mỹ lấy nhân dân tệ Trung Quốc.", "eng": "I want to exchange some US dollars for Chinese Yuan."}, {"viet": "Tôi bực mình khi phát hiện có ai đó đã dùng bàn chải đánh răng của tôi.", "eng": "I was aggrieved to find that someone has used my toothbrush."}, {"viet": "Tôi rất thích thú với ý kiến đó.", "eng": "I was highly tickled by the idea."}, {"viet": "Tôi bị choáng khi nghe thấy tai nạn của anh.", "eng": "I was shocked when I heard about your accident."}, {"viet": "Tôi cứ lo là anh sẽ không trở lại.", "eng": "I was worried that you wouldn't come back."}, {"viet": "Tôi ước mong tôi bí mật nghe được họ bàn về tương lai của tôi.", "eng": "I wish I could be a fly on the wall when they discuss my future."}, {"viet": "Không hiểu có một trung tâm thông tin nào ở đâu không nhỉ?", "eng": "I wonder if there's an information centre anywhere?"}, {"viet": "Cho tôi thêm một ly Scotch và nước.", "eng": "I would like another scotch and water, please."}, {"viet": "Mình không muốn hỏi nó về buổi phỏng vấn xin việc của nó, điều đó hơi làm cho nó dễ bị chạm lòng vào lúc này.", "eng": "I wouldn't ask him about his job interview, it's rather a sore point with him at the moment."}, {"viet": "Nếu anh ấy có làm sao xin hãy cho tôi biết.", "eng": "If anything happens to him, let me know."}, {"viet": "Nếu tôi bị yêu cầu làm việc vào ngày chủ Nhật thì tôi xin nghỉ việc.", "eng": "If I was asked to work on Sundays I should resign."}, {"viet": "Nếu đường bị đóng băng thì anh nên hoãn ngày khởi hành thì hơn.", "eng": "If the roads are icy, you'd be better advised to delay your departure."}, {"viet": "Nếu anh còn đi trễ một lần nữa, anh sẽ bị đuổi việc ngay.", "eng": "If you're late once more, you're getting the boot."}, {"viet": "Bố à, nếu bố không biết tiền ở đâu ra con nghĩ có thể quên chuyến đi Pháp thôi.", "eng": "If you don't know, Dad, I guess I can forget about it."}, {"viet": "Nếu anh cần lời khuyên, tôi xin sẵn sàng giúp.", "eng": "If you need advice, I am at your service."}, {"viet": "Nếu cậu không biếng nhác như vậy, chắc cậu sẽ không béo ị như thế!", "eng": "If you weren't so inactive you wouldn't be so fat!"}, {"viet": "Ở Mỹ, chị nói bảy giờ thiếu 10?", "eng": "In America you say ten of seven?"}, {"viet": "Nói chung bài làm của cô ấy tốt, nhưng bài luận này thì kém quá.", "eng": "In general her work has been good, but this essay is dreadful."}, {"viet": "Trong chính trị, chắc rằng anh sẽ bị các đối thủ bôi nhọ.", "eng": "In politics you expect to get smeared by your opponents."}, {"viet": "Trong giai đoạn thành công rực rỡ, không có gì là trở ngại cả.", "eng": "In the full flush of success, nothing was an obstacle."}, {"viet": "Rồi ra công trình của chị ấy sẽ được thừa nhận như nó xứng đáng.", "eng": "In time, her work will be accorded the recognition in deserves."}, {"viet": "Đáng lẽ tập luyện thì binh lính được đưa đi làm tạp dịch.", "eng": "Instead of training the men were put on fatigues duty."}, {"viet": "Nó được tạo thành bởi sự kết hợp của hai tế bào khác.", "eng": "Is made by the union of two other cells."}, {"viet": "Có thứ gì anh có thề mua giúp trên đường đi làm về tối nay không?", "eng": "Is there anything I can pick up for you on the way back from work tonight?"}, {"viet": "Mong đợi chúng tôi làm việc vào ngày chủ nhật thật là phi lý.", "eng": "It's a bit thick expecting us to work on Sundays."}, {"viet": "Đó là một ý kiến thú vị nhưng có nhiều khó khăn trong thực hành.", "eng": "It's an interesting idea but there are many practical difficulties."}, {"viet": "Đối với người Anh, đi nghỉ ở miền Nam nước Pháp là hợp mốt.", "eng": "It's fashionable among the British to go to the south of France for their holidays."}, {"viet": "Đó là kỳ nghỉ đầu tiên của tôi trong vòng hai năm nên tôi sẽ hết sức tận dụng nó.", "eng": "It's my first holiday for two years so I'm going to make the most of it."}, {"viet": "Đó chỉ là tình cảm vờ vịt thôi, nó muốn mấy cái kẹo đấy!", "eng": "It's only cupboard love, he wants some sweets!"}, {"viet": "Đã đến lúc phải lên tiếng vì những người đang phải chịu sự bất công.", "eng": "It's time to speak up for those who are suffering injustice."}, {"viet": "Trời bắt đầu mưa vì thế cô ấy mở ô.", "eng": "It began to rain so she opened her umbrella."}, {"viet": "Thật là khó khăn khi phải cố đi ra ngoài ăn trưa mỗi ngày.", "eng": "It is a hassle to try to leave for lunch every day."}, {"viet": "Thật là lý thú khi đối chiếu hai nhà văn với nhau.", "eng": "It is interesting to contrast the two writers."}, {"viet": "Cô ta rất lấy làm bực mình vì bị muộn như vậy.", "eng": "It is very provoking of her to be so late."}, {"viet": "Trời mưa, sự dai dẳng thường thấy của thời tiết ở nước Anh.", "eng": "It rained, with the usual cussedness of the English weather."}, {"viet": "Có lẽ nó còn khó uống hơn.", "eng": "It's probably harder to drink."}, {"viet": "Với tôi nghe có vẻ như công việc vậy.", "eng": "It sounds like work to me."}, {"viet": "Đó là một cuộc trò chuyện thoải mái, không hình thức.", "eng": "It was a relaxed and informal discussion."}, {"viet": "Cậu thật là không tế nhị khi nhắc đến những vấn đề hôn nhân rắc rối của cô ta.", "eng": "It was indelicate of you to mention her marriage problems."}, {"viet": "Thật ngạc nhiên cô ấy làm nhanh đến thế.", "eng": "It was unbelievable how quickly she did it."}, {"viet": "Nếu anh đầu tư vào dự án có lẽ sẽ thua thiệt cho anh.", "eng": "It would be to your disadvantage to invest in the project."}, {"viet": "Jim có động cơ ngầm khi đãi tôi một chầu rượu-anh ta muốn mượn chiếc xe tải của tôi.", "eng": "Jim had ulterior motives in buying me a drink-he wants to borrow my van."}, {"viet": "Chỉ vì tôi không than phiền, người ta cứ tưởng là tôi hài lòng.", "eng": "Just because I don't complain, people think I'm satisfied."}, {"viet": "Những thay đổi vào phút cuối cùng đã gây ra rất nhiều sự đảo lộn.", "eng": "Last-minute changes caused a great deal of upset."}, {"viet": "Cho phép tôi giới thiệu bạn tôi, Bill Smith.", "eng": "Let me introduce my friend, Bill Smith."}, {"viet": "Nhìn này, cái túi xách này rất đẹp.", "eng": "Look, the handbag is very beautiful."}, {"viet": "Nhiều người tin rằng nhà tù không phải là một phương thuốc trị tội ác.", "eng": "Many people believe that prison isn't a cure for crime."}, {"viet": "Mary trốn John, để John bị gạt khi nghĩ rằng cô ấy đã đi rồi.", "eng": "Mary hid from John, so that John was tricked into thinking she was gone."}, {"viet": "Vui lòng cho tôi nói chuyện với Lưu Vệ?", "eng": "May I speak to Liu Wei, please?"}, {"viet": "Hơn 50 vở kịch được diễn ở Broadway mỗi mùa.", "eng": "More than 50 productions are presented each season on Broadway."}, {"viet": "Hôm nay ông Lý đến gặp ông để trình bày những quan điểm của ông ấy về triết học Trung Quốc, và để giúp ông bằng bất cứ cách nào trong khả năng của ông ấy liên quan đến công trình nghiên cứu triết học của ông ở Trung Quốc.", "eng": "Mr. Lee came to see you today to express his views on Chinese philosophy, and assist you in any way he can for your study of philosophy in China."}, {"viet": "Ông xếp của tôi đã đi dự một cuộc hội nghị về chất dẻo cuối tuần trước.", "eng": "My boss attended a conference on plastics last weekend."}, {"viet": "Loại rượu ưa thích nhất của tôi là Martell Cordon Bleu.", "eng": "My favorite is Martell Cordon Bleu."}, {"viet": "Mẹ tôi nói: \"Ngủ là phương thuốc tốt nhất\".", "eng": "My mother says, \"sleeping is the best medicine\"."}, {"viet": "Chuyến đi của tôi đến Ấn Độ quả đã làm tôi mở mắt ra.", "eng": "My trip to India was quite an eye-opener."}, {"viet": "Những căn nhà mới mọc lên khắp thị trấn.", "eng": "New houses were springing up all over the town."}, {"viet": "Dạ không, Tôi muốn nói là bà mảnh mai, nên trà xanh là sự lựa chọn khôn ngoan nhất, nhất là vào mùa hè.", "eng": "No, I should say you're slim and green tea is the wisest choice, especially in summer."}, {"viet": "Anh ta vừa mới đến thì lại được yêu cầu đi ngay.", "eng": "No sooner had he arrived than he was asked to leave again."}, {"viet": "Bây giờ việc thi cử đã xong, tôi đang tận hưởng sự tự do.", "eng": "Now the exams are over, I'm savoring my freedom."}, {"viet": "Ồ, cháu không hiểu nghĩa của từ này.", "eng": "Oh, I don't understand the meaning of this word."}, {"viet": "Những đạo luật cũ đã bị cuộc cách mạng xóa sạch.", "eng": "Old laws were swept away by the revolution."}, {"viet": "Từ những số đo về một căn phòng trung bình, ta có thể suy ra được kích thước của toà nhà này.", "eng": "One can extrapolate the size of the building from the measurements of an average room."}, {"viet": "Một mùa hè nọ, tôi làm việc trong một dự án thú vị.", "eng": "One summer I was working on an interesting project."}, {"viet": "Con gái chúng tôi đã sang Úc cách đây mười năm.", "eng": "Our daughter went out to Australia ten years ago."}, {"viet": "Mối băn khoăn chính của chúng tôi là họ không nhận được sự giúp đỡ đầy đủ.", "eng": "Our main concern is that they are not receiving enough help."}, {"viet": "Đội của chúng tôi, tính chung, ghi được nhiều bàn nhất.", "eng": "Our team scored the most goals on aggregate."}, {"viet": "Quốc hội bị giải tán và tổng tuyển cử đã được tổ chức.", "eng": "Parliament was dissolved and a general election was held."}, {"viet": "Người ta trú ở hàng hiên cửa hiệu khi trời bắt đầu mưa.", "eng": "People sheltered in shop doorways when it started raining."}, {"viet": "Vui lòng mua một ít cơm trên đường về nhà.", "eng": "Please pick up some rice on the way home."}, {"viet": "Trừng phạt những người biểu tình là thất sách bởi vì việc đó chỉ càng khuyến khích thêm các cuộc biểu tình khác.", "eng": "Punishing the demonstrators is self-defeating because it only encourages further demonstrations."}, {"viet": "Các nhà khoa học tiếp tục mở rộng kiến thức.", "eng": "Scientists continue to push back the boundaries of knowledge."}, {"viet": "Sẽ dùng cách hàng một hay cách hàng hai khi đánh máy bức thư này?", "eng": "Shall I use single or double spacing when I type this letter?"}, {"viet": "Mấy tuần cuối bà ấy đã hoàn thành được nhiều công việc.", "eng": "She's accomplished a great deal in the last few weeks."}, {"viet": "Ở bên ngoài cô ấy còn đẹp hơn cả ở trong ảnh.", "eng": "She's even more beautiful in the flesh than in photographs."}, {"viet": "Bà ấy rất hay nóng giận.", "eng": "She's much given to outbursts of temper."}, {"viet": "Ở cùng lứa tuổi đó nàng giống mẹ như đúc.", "eng": "She's the double of her mother at the same age."}, {"viet": "Chị ấy lúc nào cũng có một lời nói tử tế dành cho mọi người.", "eng": "She always has a kind word for everyone."}, {"viet": "Cô ta trở lại với một ôm đầy những sách bìa mềm.", "eng": "She came back with an armful of paper acks."}, {"viet": "Cô ta không thể ngồi cũng không thể đứng và đi lảo đảo không có phương hướng.", "eng": "She could neither sit nor stand and walking was adrift without balance."}, {"viet": "Cô ấy không xây dựng gia đình cho đến tận khi cô ấy vào tuổi trung niên.", "eng": "She didn't get married until she was well into middle age."}, {"viet": "Cô ấy trưng bày tranh tại trường chúng tôi.", "eng": "She exhibited her paintings at our school."}, {"viet": "Cô ta thu thập đồ đạc để mỗi nơi một thứ rồi ra đi.", "eng": "She gathered up her scattered belongings and left."}, {"viet": "Cô ta đã càu nhàu trả lời mấy tiếng không hiểu nổi.", "eng": "She grunted some incomprehensible reply."}, {"viet": "Cô ấy nắm được vấn đề một cách khá toàn diện.", "eng": "She has a comprehensive grasp of the subject."}, {"viet": "Bà ta đã mở cửa hàng bán sách.", "eng": "She has set up in business as a bookseller."}, {"viet": "Cô ấy là một nhạc sĩ tài năng và cũng là nhà nhiếp ảnh.", "eng": "She is a talented musician as well as being a photographer."}, {"viet": "Cô ta không đủ năng lực giữ một chức vụ cao như thế.", "eng": "She is unfit for such a senior position."}, {"viet": "Bà ta ưa được tự do và độc lập, không phải làm việc cho ai khác.", "eng": "She likes being her own mistress, and not having to work for someone else."}, {"viet": "Cô ta thấy khoan khoái trong một chiếc ghế bành lớn.", "eng": "She made herself comfortable in a big chair."}, {"viet": "Cô ấy mời anh ta đi cùng xe và anh ta nhận lời.", "eng": "She offered him a lift and he accepted."}, {"viet": "Bà ấy trình bày trường hợp của mình trước uỷ ban.", "eng": "She presented her case to the committee."}, {"viet": "Cô ta đã cứu ba đứa bé khỏi đám cháy hoặc một vụ gì đại loại như thế.", "eng": "She rescued three children from a fire or something."}, {"viet": "Cô ta vớ được một việc làm béo bở.", "eng": "She's got a plum of a job."}, {"viet": "Bà ấy hi sinh công việc của mình để trông nom các con.", "eng": "She sacrificed her job to look after her children."}, {"viet": "Cô ta đã gửi cho tôi một bức thư thật sự gây ấn tượng mạnh.", "eng": "She sent me a real snorter of a letter."}, {"viet": "Bà ấy mau chóng chuẩn bị cho lũ trẻ đi học.", "eng": "She soon got the children ready for school."}, {"viet": "Cô ấy đánh giá tình hình trong nháy mắt.", "eng": "She summed up the situation at a glance."}, {"viet": "Cô ấy theo cách suy nghĩ rằng hành động là một sự giải trí.", "eng": "She took the attitude that acting was a recreation."}, {"viet": "Cô ta bỏ đi không thèm nói đến một lời cảm ơn.", "eng": "She walked away without so much as a thank-you."}, {"viet": "Cô ta lực mình vì cái thái độ vô tư lự của anh ta.", "eng": "She was annoyed at his lighthearted attitude."}, {"viet": "Bà ta bị đày khỏi quê hương vì tham gia vào âm mưu chống lại chính phủ.", "eng": "She was exiled from her country because of her part in the plot against the government."}, {"viet": "Cô ta đã kết hôn trái với ý nguyện của cô ta.", "eng": "She was married against her will."}, {"viet": "Cô ta đang ngồi trong tư thế hết sức khêu gợi.", "eng": "She was sitting in a highly provocative pose."}, {"viet": "Cô ta đã bị báo chí nói xấu vì đã có những quan điểm gây ra tranh luận.", "eng": "She was vilified by the press for her controversial views."}, {"viet": "Bà ấy sẽ yêu cầu luật sư giúp cho đòi tiền ở ngân hàng.", "eng": "She will ask the lawyer to help her to claim the payment from the bank."}, {"viet": "Cô ta sẽ là một vận động viên tốt nếu cô ta lo luyện tập.", "eng": "She would be very good player if only she could get it together."}, {"viet": "Xúc dọn lề đường cho sạch tuyết.", "eng": "Shovel the pavement clear of snow."}, {"viet": "Vì tôi là mẹ nó nên ý kiến của tôi về nó tất nhiên là có thiên kiến.", "eng": "Since I am his mother, my opinion of him is naturally a prejudiced one."}, {"viet": "Chế độ nô lệ đối lập với sự tự do.", "eng": "Slavery is the antithesis of freedom."}, {"viet": "Những mẩu thông tin về việc hợp nhất sắp tới.", "eng": "Snips of information about the up coming merger."}, {"viet": "Hội ngăn cấm ngược đãi thú vật.", "eng": "Society for the prevention of cruelty to animals."}, {"viet": "Một số sự kiện về nhà thơ lớn được kể trong câu chuyện đăng tải.", "eng": "Some incidents about the great poet related in a feuilleton."}, {"viet": "Một số người nghĩ rằng con số 13 là con số không may, nhưng đó chỉ là mê tín.", "eng": "Some people think that the number 13 is unlucky, but that is just a superstition."}, {"viet": "Người nào đó làm việc trong ngành điện tử.", "eng": "Someone who's worked in electronics."}, {"viet": "Làm văng dầu lên áo quần của mình.", "eng": "Spatter one's clothes with oil."}, {"viet": "Dựng cái thang đứng thẳng dựa vào tường.", "eng": "Stand the ladder upright against the wall."}, {"viet": "Thôi, đừng nói vòng vo tam quốc, hãy cho chúng tôi biết ai đã thắng.", "eng": "Stop beating about the bush and tell us who won."}, {"viet": "Hãy cho cô ta leo cây vài tháng và sau đó nếu anh vẫn còn yêu cô ta thì có thể xem đó là tình yêu thật sự.", "eng": "String her along for a few months and if you still think you love her after that, you can consider it true love."}, {"viet": "Một lát nữa những cảm giác như vậy sẽ bừng lên trong anh.", "eng": "Such feelings will well up in you in a minute."}, {"viet": "Giả dụ như chúng ta đúng chúng ta sẽ làm gì?", "eng": "Supposing we are right what should we do?"}, {"viet": "Quan tâm sâu xa đến điều gì.", "eng": "Take a profound interest in something."}, {"viet": "Những món chịu thuế như thuốc lá và rượu mùi.", "eng": "Taxables such as cigarettes and liquor."}, {"viet": "Mười năm trước, cái áo này được coi là thanh lịch nhất.", "eng": "Ten years ago this dress was considered the last word in elegance."}, {"viet": "Thế thì tiết kiệm nhưng thuê một chiếc xe hơi thì có tốt hơn không?", "eng": "That's economical but isn't it better to rent a car?"}, {"viet": "Thằng bé đó tiếp thu cái mới cứ như là một miếng bọt xốp!", "eng": "That child soaks up new facts like a sponge!"}, {"viet": "Đó là loại giấy tôi thích sử dụng.", "eng": "That is the type of paper I like to use."}, {"viet": "Điều đó đã khiến sự việc mang một cục diện khác.", "eng": "That puts a different complexion on the matter."}, {"viet": "Thầy giáo ấy lúc nào cũng trù tôi.", "eng": "That teacher has always had it in for me."}, {"viet": "Định nghĩa trên đây được sắp chữ kiểu rômanh, thí dụ này được sắp chữ nghiêng.", "eng": "The above definition is set in roman, this example is in italics."}, {"viet": "Người diễn viên bắt chước cử động của một con chim.", "eng": "The actor was miming the movements of a bird."}, {"viet": "Bàn thờ đã bị bọn phá hoại làm ô uế.", "eng": "The altar had been defiled by vandals."}, {"viet": "Sự xuất hiện bất ngờ của những chàng chăn bò ở thành phố Niu Yooc.", "eng": "The apparition of cowboys in New York city."}, {"viet": "Nghệ thuật trò chuyện vui vẻ hình như đã qua rồi.", "eng": "The art of good conversation seems lost."}, {"viet": "Tác giả rút gọn cuốn sách của mình để dùng cho học sinh.", "eng": "The author condensed his book for the use of school children."}, {"viet": "Thời tiết xấu đã làm giá rau tăng.", "eng": "The bad weather has sent vegetable prices up."}, {"viet": "Người phục vụ tại quán rượu dùng một cốc nhỏ bằng bạc để đong rượu.", "eng": "The barman uses a small silver measure for brandy."}, {"viet": "Những lợi ích của nền giáo dục tư tương phản với những lợi ích của nền giáo dục công.", "eng": "The benefits of private education over against state education."}, {"viet": "Lưỡi dao rạch toác chân ông ta.", "eng": "The blade slashed his leg open."}, {"viet": "Cuốn sách chẩn đoán căn bệnh về kinh tế của chúng ta hiện nay.", "eng": "The book diagnosed our present economic ills."}, {"viet": "Cái hộp đã bị nạy tung ra.", "eng": "The box had been prised open."}, {"viet": "Sự đổ vỡ cuộc hôn nhân của học không làm ai ngạc nhiên.", "eng": "The breakup of their marriage surprised no one."}, {"viet": "Tên trộm vào nhà qua cửa sổ.", "eng": "The burglar got in through the window."}, {"viet": "Ung thư đã lan đến dạ dày của ông ta.", "eng": "The cancer has spread to his stomach."}, {"viet": "Ô tô nhào xuống sông làm chết tất cả những người trong xe.", "eng": "The car plunged into the river, killing all its occupants."}, {"viet": "Về loại xe ôtô này, máy cát xét là vật phụ thêm tùy ý khách.", "eng": "The cassette player is an optional extra in this make of car."}, {"viet": "Ông chủ tịch đang chờ bắt đầu buổi họp.", "eng": "The chairman is waiting to begin the meeting."}, {"viet": "Tiếng la khóc của đứa trẻ làm chúng tôi thức suốt cả đêm.", "eng": "The child's wailing kept us awake at night."}, {"viet": "Đứa bé chưa hình thành được nhân cách.", "eng": "The children's character is as yet unformed."}, {"viet": "Chương trình của trẻ em liên tục bị cung cấp thiếu tiền.", "eng": "The children programme has been continually underfunded."}, {"viet": "Dàn đồng ca rõ ràng đã ( hát ) lạc điệu ở mấy chỗ.", "eng": "The choir was ( singing ) distinctly out of tune in places."}, {"viet": "Lời nói sáo rỗng này cứ được lặp đi lặp lại đến phát buồn nôn.", "eng": "The cliché is being repeated ad nauseam."}, {"viet": "Các răng bánh xe không ăn khớp hẳn với nhau.", "eng": "The cogs don't quite mesh."}, {"viet": "Ủy ban có thành kiến bảo thủ.", "eng": "The committee is of a conservative bias."}, {"viet": "Công ty đó được điều hành từ các văn phòng ở Luân Đôn.", "eng": "The company operates from offices in London."}, {"viet": "Sự bảo tồn rừng, nguồn nước, các toà nhà cổ, v. v.", "eng": "The conservation of forests, water resources, old buildings, etc."}, {"viet": "Trị giá thiệt hại vật chất do trận lụt không thể xác định được.", "eng": "The cost of the flood damage is impossible to quantify."}, {"viet": "Khoá học về truyện ngụ ngôn và huyền thoại trong văn học hiện đại.", "eng": "The course is about fable and legend in modern literature."}, {"viet": "Các nhà phê bình đả kích gay gắt vở kịch mới của bà ta.", "eng": "The critics tore her new play to pieces."}, {"viet": "Sự nghiệp lâu năm và xuất sắc của bà ấy đã kết thúc.", "eng": "The curtain has fallen on her long and distinguished career."}, {"viet": "Những chiếc lá nhàu của cái cây chết.", "eng": "The dead plant's crinkled leaves."}, {"viet": "Những người biểu tình phân phát truyền đơn cho khách qua đường.", "eng": "The demonstrators distributed leaflets to passers-by."}, {"viet": "Sự chênh lệch giữa lương của anh ấy và lương của anh là rất nhỏ.", "eng": "The difference between his wages and yours is only fractional."}, {"viet": "Sự khác nhau giữa hai hệ thống chính trị.", "eng": "The divide between two political systems."}, {"viet": "Các bác sĩ tuyên bố là ông ta không còn ở trong tình trạng nguy kịch nữa.", "eng": "The doctors pronounced that he was no longer in danger."}, {"viet": "Con chó cọ cái đầu nhè nhẹ vào tôi ở trên trường kỷ.", "eng": "The dogs nuzzled up to me on the sofa."}, {"viet": "Thuốc đó làm giảm phần nào đau đớn.", "eng": "The drug gives some relief from pain."}, {"viet": "Quân số thích hợp của quân đội.", "eng": "The effective strength of the army."}, {"viet": "Đầu máy xe lửa phát ra một tiếng rít ken két rồi dừng lại.", "eng": "The engine gave forth a grinding noise, then stopped."}, {"viet": "Buổi tối hôm đó thật là chán ngắt.", "eng": "The evening was a real turn-off."}, {"viet": "Vụ nổ đó được tính toán thời gian để xảy ra cùng lúc với máy bay cất cánh.", "eng": "The explosion was timed to be simultaneous with the plane's take-off."}, {"viet": "Những ảnh hưởng nghiêm trọng của nạn dịch lớn mới xảy ra.", "eng": "The far reaching implications of a major new epidemic."}, {"viet": "Hình vẽ bên góc làm hỏng bố cục bức tranh.", "eng": "The figure on the left spoils the unity of the painting."}, {"viet": "Vụ hoả hoạn ở xí nghiệp do sự phá hoại ngầm gây ra.", "eng": "The fire at the factory was caused by sabotage."}, {"viet": "Những tín đồ Cơ Đốc đầu tiên đều là người Do Thái, họ tin tưởng rằng chúa Jesus là nhà đứng đầu tôn giáo vĩ đại mà họ có được.", "eng": "The first Christians were Jews who believed Jesus was the great religious leader they had been promised."}, {"viet": "Trận lụt bắt đầu và chúng tôi phải chuyển đến những nền đất cao hơn.", "eng": "The flood started and we had to seek higher ground."}, {"viet": "Các thuộc địa của thực dân trước đây giờ đã trở thành các nước độc lập.", "eng": "The former colonial possessions are now independent states."}, {"viet": "Đồ đạc được bán với giá 900 bảng Anh vào dịp bán hạ giá.", "eng": "The furniture realized £ 900 at the sale."}, {"viet": "Ông tổng giám đốc lịch đã kín.", "eng": "The general manager had a full calendar of the day."}, {"viet": "Giá tiền công hiện hành là 6 bảng một giờ.", "eng": "The going rate for the job is 6 pounds an hour."}, {"viet": "Chính phủ có một đa số hoạt động hữu hiệu.", "eng": "The government has a working majority."}, {"viet": "Chính quyền từ chối thương lượng với bọn khủng bố.", "eng": "The government refuses to treat with terrorists."}, {"viet": "Con tàu lớn lao qua đại dương.", "eng": "The great ship plowed across the ocean."}, {"viet": "Người khách trọ muốn gửi những món đồ quý của ông ấy.", "eng": "The guest wants to check his valuables."}, {"viet": "Những nhà chức trách y tế đang điều tra sự việc.", "eng": "The health authorities are investigating the matter."}, {"viet": "Cái lỗ hổng ấy được che bằng vải bạt.", "eng": "The hole was covered over with canvas."}, {"viet": "Khách sạn có đầy đủ tiện nghi hiện đại.", "eng": "The hotel has every modern comfort."}, {"viet": "Ngôi nhà trong tình trạng hết sức bừa bộn vì bọn trẻ con.", "eng": "The house was in a state of complete disorder because of the young children."}, {"viet": "Tư thì đã rõ nhưng khó mà nói được những gì xa hơn.", "eng": "The immediate future is clear, but it's hard to tell what lies beyond."}, {"viet": "Những binh sĩ bị thương rên la vì đau đớn.", "eng": "The injured soldiers called out in pain."}, {"viet": "Bàn là nóng quá, em sẽ làm cháy sém cái áo đầm mất.", "eng": "The iron's too hot, you'll singe the dress."}, {"viet": "Vị quan tòa nhìn dò xét người tù đang ngồi trên ghế.", "eng": "The judge looked over to the prisoner in the dock."}, {"viet": "Vua muốn bổ nhiệm một trong số bộ hạ của mình vào chức vụ đó.", "eng": "The king would appoint one of his creatures to the post."}, {"viet": "Câu thơ cuối sẽ được đồng ca.", "eng": "The last verse will be sung in unison."}, {"viet": "Báo cáo viên hoàn toàn thích ứng với thính giả.", "eng": "The lecturer was completely en rapport with his auditors."}, {"viet": "Các đèn bị đoản mạch khi tôi nối dây điện.", "eng": "The lights short-circuited when I joined up the wires."}, {"viet": "Chiếc xe tải bị bẹp rúm lại sau khi húc vào thân cây.", "eng": "The lorry had concertinaed after crashing into the tree."}, {"viet": "Phần chủ yếu của quyển sách nói về sự nghiệp chính trị của tác giả.", "eng": "The main body of the book deals with the author's political career."}, {"viet": "Bản thảo đó bị vàng ố qua thời gian.", "eng": "The manuscript was yellowed with age."}, {"viet": "Thịt sẽ bị cháy sém nếu cậu không hạ ga xuống.", "eng": "The meat will scorch if you don't lower the gas."}, {"viet": "Cái khung sắt muốn cong dưới áp lực.", "eng": "The metal frame tends to twist under pressure."}, {"viet": "Sương tan nhanh khi mặt trời lên.", "eng": "The mist quickly dissipated as the sun rose."}, {"viet": "Người học sinh giỏi có khả năng nhất ở lớp.", "eng": "The most able student in the class."}, {"viet": "Tiếng vo ve của bầy ong trong vườn.", "eng": "The murmur of bees in the garden."}, {"viet": "Chiếc lưới được buộc chì để giữ cho nó chìm dưới mặt nước.", "eng": "The net is weighted to keep it below the surface of the water."}, {"viet": "Vị tân bộ trưởng sẽ được Nữ hoàng bổ nhiệm chính thức.", "eng": "The new minister will be confirmed in office by the Queen."}, {"viet": "Tin tức chủ yếu về hội nghị thượng đỉnh mới đây.", "eng": "The news is all about the latest summit meeting."}, {"viet": "Tiếng suối chảy có tác dụng ru ngủ thật dễ chịu.", "eng": "The noise of the stream had a pleasantly somnolent effect."}, {"viet": "Y tá lấy nhiệt độ của tất cả các bệnh nhân.", "eng": "The nurse took the temperatures for all the patients."}, {"viet": "Tòa nhà cổ đó là một mê cung với những hành lang tối om.", "eng": "The old building was a labyrinth of dark corridors."}, {"viet": "Không có ai thích điều đó hơn là chính chúng tôi.", "eng": "The ones who really want it are ourselves, No one loves it more than ourselves."}, {"viet": "Cái vỏ bọc ngoài phần lớn bộ não có màu xám.", "eng": "The outer covering of much of it is gray."}, {"viet": "Cha xứ là người mà nhân dân có thể đến nhờ vả vào lúc khó khăn.", "eng": "The parish priest is someone to whom people can turn in difficult times."}, {"viet": "Bệnh nhân đang hồi phục khá tốt.", "eng": "The patient is getting on satisfactorily."}, {"viet": "Buổi biểu diễn đó đã được đặt hết chỗ.", "eng": "The performance is fully booked up."}, {"viet": "Bức tranh dưới đây vẽ hình một la bàn bỏ túi.", "eng": "The pictures below shows a pocket compass."}, {"viet": "Máy bay lên cao 20.000 bộ.", "eng": "The plane climbed to 20,000 feet."}, {"viet": "Tác động của các lực lượng siêu nhiên lên số phận con người.", "eng": "The play of supernatural forces in human destiny."}, {"viet": "Cảnh sát trở nên nghiêm khắc hơn đối với việc lái xe lúc say rượu.", "eng": "The police are tightening up on drunken driving."}, {"viet": "Cảnh sát theo dõi người đàn ông đang đi vào ngân hàng.", "eng": "The police observed the man enter the bank."}, {"viet": "Những cuộc thanh trừng chính trị tiếp theo sự thay đổi chính phủ.", "eng": "The political purges that followed the change of government."}, {"viet": "Đồng pao trên thị trường chứng khoán hôm nay tụt xuống mấy giá.", "eng": "The pound fell several points on the Stock Market today."}, {"viet": "Tổng thống đã thoát khỏi sự kiện rắc rối và tiếng tăm vẫn nguyên vẹn.", "eng": "The president has emerged from his incident with his reputation intact."}, {"viet": "Ông luật sư thuyết trình một bài dài về sự xấu xa của thông dâm.", "eng": "The priest delivered a long discourse upon the evils of adulter."}, {"viet": "Những người tù bị tống thẳng tay vào xe cảnh sát.", "eng": "The prisoner was thrown bodily into the police van."}, {"viet": "Dự án đó đã được khởi sự với nhiệt tình cao độ.", "eng": "The project jumped off with great enthusiasm."}, {"viet": "Sóng ngầm có thể kéo những người bơi ra biển.", "eng": "The pull of the undertow can drag swimmers out to sea."}, {"viet": "Vấn đề này là một vấn đề rất quan trọng.", "eng": "The question is one of great importance."}, {"viet": "Trời lạnh làm nhụt ý muốn bơi lội của chúng tôi.", "eng": "The raw weather chilled our enthusiasm for a swim."}, {"viet": "Yêu sách về lương bị bác bỏ đã được thợ mỏ đón nhận không kém phần thích thú, phấn khởi.", "eng": "The rejection of their pay claim was given a less than rhapsodic reception by the miners."}, {"viet": "Nhà hàng này ngày nào cũng mở cửa, trừ thứ Hai.", "eng": "The restaurant is open everyday except Monday."}, {"viet": "Cuộc nổi dậy ngày một tăng, chính phủ tuyên bố tình trạng khẩn cấp.", "eng": "The rioting grew worse and the government declared a state of emergency."}, {"viet": "Tên trộm đó đã lấy sạch số giấy bạc.", "eng": "The robber swooped up the banknotes."}, {"viet": "Vị khách hoàng gia được đón chào bằng tiếng kèn trompét vang rền.", "eng": "The royal visitor was saluted by a fanfare of trumpets."}, {"viet": "Người bán hàng nói rằng chiếc ô tô còn tốt và tôi đã khá ngu để mình bị bịp.", "eng": "The salesman said the car was in good condition, and I was foolish enough to fall for it."}, {"viet": "Nhà trường rất vui vẻ hợp tác khi chúng tôi đến quay phim ở đấy.", "eng": "The school was very co-operative when we made a film there."}, {"viet": "Ý thức về công lý thấm nhuần tất cả các trước tác của bà ấy.", "eng": "The sense of justice which informs all her writings."}, {"viet": "Người Shetlander là giống dân sống ở đảo.", "eng": "The Shetlanders are an island race."}, {"viet": "Người bán hàng đã cất công tìm kiếm những thứ mà chúng tôi cần.", "eng": "The shop assistant went out of his way to find what we needed."}, {"viet": "Vầng trăng như một quả cầu bạc chìm dần xuống chân trời.", "eng": "The silvery globe of the moon sank towards the horizon."}, {"viet": "Mùi nước hoa của nàng vẫn còn phảng phất trong ngôi nhà trống trải đó.", "eng": "The smell of her perfume lingered in the empty house."}, {"viet": "Binh sĩ chưa dày dạn với khí hậu khắc nghiệt.", "eng": "The soldiers were not seasoned to the rigorous climate."}, {"viet": "Diễn giả được khán thính giả đứng lên hoan hô.", "eng": "The speaker was given a standing ovation."}, {"viet": "Tình thế đất nước đang vô cùng lâm nguy.", "eng": "The state of the country is desperate."}, {"viet": "Câu chuyện thật điên rồ, nhưng trong vòng hơn 100 năm sau đó, đảo Hi-Brazil được vẽ trên bản đồ.", "eng": "The story was foolish, but for more than 100 years after that, Hi-Brazil was put on maps."}, {"viet": "Các chất được tạo nên từ hỗn hợp các chất lỏng đông đặc do tác động của áp suất.", "eng": "The substances are formed from a mixture of liquids solidifying under pressure."}, {"viet": "Những cây đậu hoa leo lên quấn quanh những que trúc.", "eng": "The sweet peas are twisting up the canes."}, {"viet": "Thầy giáo bảo chỉ có Janet, George và Sue là bị phạt, như thế là tha cho tôi.", "eng": "The teacher said only Janet, George and Sue were to be punished, so that let me out."}, {"viet": "Sự cám dỗ để đánh cắp thì càng nhiều hơn bao giờ trước đây.", "eng": "The temptation to steal is greater than ever before."}, {"viet": "Và đỉnh thứ ba được gọi là Đỉnh Cột Trời, với đầu nhọn nguy hiểm của nó được gọi là ” Lưng cá chép ”.", "eng": "The third one is called Heavenly Capital Peak, with its dangerous point called the Back of a Carp."}, {"viet": "Sự trống rỗng hoàn toàn trong tư tưởng, trong những lời phát biểu của ông ta.", "eng": "The total vacuity of his thoughts, statements."}, {"viet": "Bản sao bài diễn văn của ông ta cần được chấm câu.", "eng": "The transcription of his speech must be punctuated."}, {"viet": "Hai đứa sinh đôi giống nhau nhiều đến nỗi tôi không thể phân biệt được đứa nào với đứa nào,.", "eng": "The twins are so much alike that I can't tell which is which."}, {"viet": "Cô đánh máy đang đi nghỉ tuần này.", "eng": "The typist is away on holiday this week."}, {"viet": "Việc sử dụng nhục hình chắc chắn làm cho bất kỳ con người văn minh nào cũng phải phẫn nộ.", "eng": "The use of torture must disgust any civilized person."}, {"viet": "Những cơn bão dữ dội đã làm mất điện mấy lần.", "eng": "The violent storms cause several power cuts."}, {"viet": "Nước đã rò rỉ hết ra ( khỏi chiếc thùng chứa nước ).", "eng": "The water slowly emptied ( from the cistern )."}, {"viet": "Cả nước ủng hộ chính phủ.", "eng": "The whole nation supported the government."}, {"viet": "Nhân chứng đã được một luật sư mớm cung.", "eng": "The witness had been primed by a lawyer."}, {"viet": "Công trình bằng đá đá cũ của toà nhà này phải được làm mới lại.", "eng": "The worn stonework on this building must be refaced."}, {"viet": "Cơ thể chúng thích hợp với những điều kiện này.", "eng": "Their bodies fit these conditions."}, {"viet": "Ngôi nhà mới của họ là điều ngưỡng mộ của cả làng.", "eng": "Their new cottage was the admiration of the whole village."}, {"viet": "Nhờ đó, hôm nay, bố không bị tàn tạ.", "eng": "Then I might not be the wreck I am today."}, {"viet": "Có một mức tối đa mà tôi có thể tiêu.", "eng": "There's a limit to how much I'm prepared to spend."}, {"viet": "Không cần thiết phải vội vã cuống cuồng như thế-chúng ta còn nhiều thời gian.", "eng": "There's no need to be in such a tearing hurry-we've got plenty of time."}, {"viet": "Đó! Nó đâu có đau lắm phải không?", "eng": "There! That didn't hurt too much, did it?"}, {"viet": "Không có cơ sở để sự tự mãn trong môi trường cạnh tranh ngày nay.", "eng": "There are no grounds for complacency in today's competitive environment."}, {"viet": "Có nhiều phe phái trong chế độ cầm quyền.", "eng": "There are various factions within the ruling regime."}, {"viet": "Có sự giống nhau ở mức độ nhất định giữa hai cậu con trai.", "eng": "There is a degree of resemblance between the two boys."}, {"viet": "Trong cacao có nhiều chất bổ hơn chè.", "eng": "There is more sustenance in cocoa than in tea."}, {"viet": "Đấy: ngay bên phải nhà thờ.", "eng": "There it is: just to the right of the church."}, {"viet": "Có tình trạng xung đột giữa các địch thủ.", "eng": "There was a state of war between the rivals."}, {"viet": "Có những lời tường thuật trái ngược về những gì xảy ra, về điều tổng thống đã nói.", "eng": "There were contradictory version of what happened, of what the president said."}, {"viet": "Đó là những danh hiệu cao quý nhất mà nhà nước ta trao tặng từ trước đến nay.", "eng": "These are the highest distinctions that have ever been given by our government."}, {"viet": "Những chiếc đầu máy xe lửa này chạy trên tuyến đường sắt Great Western cho đến năm 1940.", "eng": "These locomotives ran on Great Western Railway metals until 1940."}, {"viet": "Những từ này bị làm lẫn lộn lung tung không có nghĩa gì cả.", "eng": "These words are jumbled up and don't make sense."}, {"viet": "Họ có những năm hạnh phúc bên nhau.", "eng": "They've had years of happiness together."}, {"viet": "Họ đang vận động những người ủng hộ họ đi bỏ phiếu trong cuộc bầu cử.", "eng": "They are mobilizing their supporters to vote at the election."}, {"viet": "Chúng chen vào hàng ở chỗ bơm xăng.", "eng": "They bully into line at the gas pump."}, {"viet": "Họ đã quyết định tưởng nhớ mãi mãi vị lãnh tụ của họ bằng cách dựng một pho tượng.", "eng": "They decided to perpetuate the memory of their leader by erecting a statue."}, {"viet": "Cuối cùng họ đã phá vỡ hàng phòng ngự của đối phương và ghi được một bàn.", "eng": "They finally cracked the defence and scored a goal."}, {"viet": "Họ đã vi phạm hợp đồng giữa chúng tôi.", "eng": "They have broken the agreement between us."}, {"viet": "Họ đốt lửa để cho dã thú tránh xa.", "eng": "They lit a fire to keep wild animals off."}, {"viet": "Họ chỉ gặp nhau hai lần trong suốt thời gian họ là láng giềng của nhau.", "eng": "They only met twice during the whole time they were neighbours."}, {"viet": "Chúng phản chiếu các tia màu xanh lá cây đó tới mắt của chúng ta.", "eng": "They reflect them to our eyes."}, {"viet": "Chẳng bao lâu sau họ nhận thấy rằng có một số thứ vật dụng sản xuất ở nhà máy tốt hơn ở nhà.", "eng": "They soon found that some things could be made better in factories than at home."}, {"viet": "Họ đi bộ bởi họ không có đủ tiền thuê tắc xi.", "eng": "They walked because they couldn't afford a taxi."}, {"viet": "Họ bị xúc động vì tài năng hoàn hảo của cuộc trình diễn.", "eng": "They were impressed by the sheer professionalism of the performance."}, {"viet": "Họ tiếp tục xây toà nhà suốt cả mùa đông.", "eng": "They worked on the building all through the winter."}, {"viet": "Cuốn sách này hay hơn cuốn trước của anh ấy.", "eng": "This book is much more interesting than his last one."}, {"viet": "Phong tục này được lưu lại từ thời xa xưa.", "eng": "This custom has been handed down from antiquity."}, {"viet": "Đây là một sự nhắc nhở đúng lúc về sự cần thiết phải luôn luôn thận trọng.", "eng": "This has been a timely reminder of the need for constant care."}, {"viet": "Đây là một trong những việc dễ dàng nhất mà tôi từng gặp.", "eng": "This is one of the jammiest jobs I've ever had."}, {"viet": "Chất lỏng này đông nhanh hơn trong thời tiết lạnh.", "eng": "This liquid gels faster in cold weather."}, {"viet": "Bức tranh này là tác phẩm của một nghệ sĩ bậc thầy.", "eng": "This painting is the work of a master hand."}, {"viet": "Cuộc cãi lộn này đã ầm ĩ nhiều tháng rồi.", "eng": "This row has been simmering for months."}, {"viet": "Lần này con lại mặc quần lộn trái rồi.", "eng": "This time you are wearing your pants inside-out."}, {"viet": "Quần này bẩn rồi-anh mặc quần khác thì hơn.", "eng": "Those trousers are dirty-you'd better wear your other pair."}, {"viet": "Ngày nay, người ta dùng hàng tấn sô-cô-la và ca-cao.", "eng": "Today tons of chocolate and cocoa are used."}, {"viet": "Hai người Nhật đã đoạt giải thưởng Nobel văn chương.", "eng": "Two Japanese have won Nobel Prizes in Literature."}, {"viet": "Đi thẳng cho tới khi tới công viên rồi quẹo trái.", "eng": "Walk straight until you come to the park and turn left."}, {"viet": "Chúng tôi muốn xem liệu có cơ hội hợp tác với các ông hay không.", "eng": "We'd like to see whether we could get a chance to cooperate with you."}, {"viet": "Chúng tôi là những người đồng nghiệp cùng bộ phận.", "eng": "We're colleagues, from the same department."}, {"viet": "Chúng tôi thuê một ngôi nhà riêng ở nông thôn vùng Devon trong một tháng.", "eng": "We're taking a cottage in Devon for a month."}, {"viet": "Chúng ta chỉ có một giờ để làm việc này-ta bắt đầu đi thì hơn.", "eng": "We've only got an hour to do the job-we'd better get busy."}, {"viet": "Chúng tôi luôn sẵn sàng phục vụ ông.", "eng": "We are always at your service."}, {"viet": "Chúng tôi còn chưa tiến được nhiều trong kế hoạch của chúng tôi.", "eng": "We aren't very far forward with our plans yet."}, {"viet": "Chúng ta có thể đi đến một sự thoả thuận nào đó về giá cả.", "eng": "We can come to some arrangement over the price."}, {"viet": "Chúng ta có thể nghe thấy tiếng súng của quân địch nổ ầm ầm ở đằng xa.", "eng": "We could hear the enemy guns booming in the distance."}, {"viet": "Chúng tôi không muốn cá nhân hoá vấn đề.", "eng": "We don't want to personalize the issue."}, {"viet": "Chúng tôi đã bị loại khỏi giải ngay từ vòng đầu.", "eng": "We got knocked out of the Cup in the first round."}, {"viet": "Chúng tôi không tính đến khả năng trời có thể mưa.", "eng": "We hadn't reckoned with the possibility that it might rain."}, {"viet": "Chúng tôi đã xem mẫu quảng cáo sản phẩm mới nhất của các ông trên báo, và chúng tôi muốn có một mẫu hàng đó.", "eng": "We have seen your advertisement in the newspaper for your latest product, and we should like to have a sample thereof."}, {"viet": "Chúng tôi duy trì buổi thảo luận về khá nhiều vấn đề.", "eng": "We kept the discussion fairly general."}, {"viet": "Chúng ta sản xuất một số ít sản phẩm và tặng nó cho một số khách hàng nào đó được chọn để tìm hiểu phản ứng của họ.", "eng": "We manufacture a small quantity of the product and offer it to certain selected customers to find out their reactions."}, {"viet": "Chúng ta phải chạy thôi, nếu không thì trễ mất.", "eng": "We must run, otherwise well be too late."}, {"viet": "Chúng tôi ghé thăm cô ta một lát trước khi rời đất nước.", "eng": "We paid her a fleeting visit before leaving the country."}, {"viet": "Chẳng hạn, chúng ta nói Columbus đã khám phá ra châu Mỹ vào năm 1492.", "eng": "We say, for instance, that Columbus discovered America in 1492."}, {"viet": "Ngày nay chúng ta vẫn theo quy tắc này.", "eng": "We still follow his rule."}, {"viet": "Chúng tôi cần một vài tình nguyện viên để chuyển lương thực tới cho người già.", "eng": "We want some volunteers to deliver the food to the old people."}, {"viet": "Chúng tôi đến nơi muộn.", "eng": "We were late arriving at our destination."}, {"viet": "Chúng tôi làm việc không ngừng để hoàn thành dự án đúng thời gian.", "eng": "We worked without cease to get the project finished on time."}, {"viet": "À, tôi rất thích thức ăn, nhưng tôi cũng có vài câu hỏi khác.", "eng": "Well, I do like food, but I have some other questions, too."}, {"viet": "Thôi được, vậy khi chính phủ cho in câu “ In God We Trust lên các đồng tiền kim loại thì đó không phải là đưa ra một đạo luật đề cao một giáo hội tôn giáo hay sao?", "eng": "Well, when the government puts In God We Trust coins, isn't that making a law respecting an establishment of religion?"}, {"viet": "Ý kiến của anh thế nào về năng lượng hạt nhân?", "eng": "What's your point of view on nuclear power?"}, {"viet": "Quý vị làm việc giờ nào vào ngày tết?", "eng": "What are your hours on New Year's Day?"}, {"viet": "Ông nghĩ sao về cái này ạ?", "eng": "What do you think of this one?"}, {"viet": "Tuổi bắt buộc về hưu là bao nhiêu?", "eng": "What is the age for mandatory retirement?"}, {"viet": "Ý kiến của bạn về một kì nghỉ theo mong ước thì như thế nào?", "eng": "What is your idea of a dream vacation?"}, {"viet": "Dạo này có chuyện gì xảy ra với bạn vậy?", "eng": "What's happening with you these days?"}, {"viet": "Kết quả kỳ thi của anh thế nào-anh đỗ hay trượt?", "eng": "What was the result of your examination-did you pass or fail?"}, {"viet": "Năm nay lễ Phục Sinh vào ngày nào?", "eng": "When does Easter Sunday come this year?"}, {"viet": "Khi bị ốm tôi cảm thấy ăn hoàn toàn mất ngon.", "eng": "When I was ill I completely lost my appetite."}, {"viet": "Khi cảnh sát đến, đám đông tản khắp các ngả.", "eng": "When the police arrived, the crowd scattered in all directions."}, {"viet": "Khi tính các món chi tiêu, anh có kể cả tiền tắc xi của anh không?", "eng": "When you did your expenses, did you reckon in your taxi fares?"}, {"viet": "Lúc này anh ở đâu vậy?", "eng": "Where have you been these days?"}, {"viet": "Tháng nào lạnh nhất ở Nhật Bản?", "eng": "Which is the coldest month in Japan?"}, {"viet": "Ai đã gợi ra những ý nghĩ như thế vào đầu anh vậy?", "eng": "Who's been putting such ideas into your head?"}, {"viet": "Ai sẽ trông nom bọn trẻ khi mẹ chúng ở bệnh viện?", "eng": "Who will look after the children when their mother is in hospital?"}, {"viet": "Tại sao bạn không đến đó nhỉ?", "eng": "Why don't you go there?"}, {"viet": "Anh sẽ ra đi vào tuần sau à?'.", "eng": "Will you be leaving next week?'."}, {"viet": "Thời tiết mùa đông ở đây ấm, và cứ mỗi năm người ta gieo trồng hai vụ lúa.", "eng": "Winters are warm, and two crops of rice are grown each year."}, {"viet": "Phụ nữ và trẻ em đã bị quân nổi loạn tàn sát.", "eng": "Women and children were butchered by the rebels."}, {"viet": "Anh có bao giờ nghĩ rằng nó sẽ trở thành một chính khách không?", "eng": "Would you ever have imagined his becoming a politician?"}, {"viet": "Ông có muốn thử một ít chăng?", "eng": "Would you like to try some?"}, {"viet": "Hãy ghi lấy địa chỉ trước khi anh quên mất.", "eng": "Write down the address before you forget it."}, {"viet": "Chắc chắn, tôi đã tìm rồi.", "eng": "Yes, I've looked for it."}, {"viet": "Tốt hơn là ông nên dọn dẹp sạch sẽ căn phòng này trước khi khách tới.", "eng": "You'd better tidy this room before the guests arrive."}, {"viet": "Chúng mày là một lũ yếu đuối!'người trung sĩ hét toáng lên với tân binh.", "eng": "You're a bunch of softies!'the sergeant shouted to the new recruits."}, {"viet": "Anh cần phải kiên quyết, tuy nhiên cũng phải tỏ ra thông cảm.", "eng": "You've got to be firm, but at the same time you must be sympathetic."}, {"viet": "Anh không được cắt chi phí cho phòng thủ-đó là điều bất khả xâm phạm!", "eng": "You can't cut spending on defence-that's sacrosanct!"}, {"viet": "Con có thể làm việc đó vào ngày mốt.", "eng": "You can do that the day after tomorrow."}, {"viet": "Cậu chắc hẳn đi đến đây thong thả lắm nhỉ!", "eng": "You certainly took your time getting here!"}, {"viet": "Anh có trách nhiệm phải trông nom gia đình.", "eng": "You have a duty to look after your family."}, {"viet": "Anh biết là em chúa ghét những môn thể thao đẫm máu.", "eng": "You know I hate blood sports."}, {"viet": "Ông phải là thánh mới chịu được tính khí của hắn.", "eng": "You must be a saint to be able to stand his temper."}, {"viet": "Anh cần có một chiếc cưa khoẻ để cắt kim loại.", "eng": "You need a powerful saw to cut through metal."}, {"viet": "Bà nên kiểm tra với chủ ngân hàng trước khi bà ký những giấy tờ này.", "eng": "You should check with the banker before you sign these papers."}, {"viet": "Cậu bỏ ra một số thời gian đến buồn cười cho việc tắm rửa.", "eng": "You spend a ridiculous length of time in the bath."}, {"viet": "Xem bức tranh này anh sẽ không bao giờ thấy chán.", "eng": "You will never tire of looking at the picture."}, {"viet": "Năm ngoái bộ của anh chi tiền nhiều hơn tất cả các bộ khác cộng lại.", "eng": "Your department spent more last year than all the other departments put together."}, {"viet": "Thành công của anh sẽ góp phần to lớn vào danh tiếng của trường đại học.", "eng": "Your success will greatly redound to the fame of the university."}]