[{"viet": "Mức chiết khấu 7% là mức cao nhất mà chúng tôi có thể dành cho các ông.", "eng": "A 7% discount is the best we can offer you."}, {"viet": "Đôi mắt con mèo long lanh trong đêm tối.", "eng": "A cat's eyes gleaming in the dark."}, {"viet": "Một ủy ban bao gồm những người có quan điểm rất khác nhau.", "eng": "A committee comprising people of widely differing view."}, {"viet": "Một tội ác vẫn còn là một điều bí ẩn chưa được giải quyết.", "eng": "A crime that is an unsolved mystery."}, {"viet": "Một vết cắt bẩn có thể thành nhiễm trùng.", "eng": "A dirty cut may become septic."}, {"viet": "Cảm thấy bớt đau tức khắc sau khi điều trị.", "eng": "A feel instant relief after treatment."}, {"viet": "Một chính sách đối ngoại phù hợp với các qui định của chính phủ.", "eng": "A foreign policy that comports with the government regulations."}, {"viet": "Một bữa cơm ngon thì đừng bao giờ nên ăn vội vàng.", "eng": "A good meal should never be hurried."}, {"viet": "Một địa điểm thích hợp cho trường học mới.", "eng": "A handsome location for the new school."}, {"viet": "Một trăm binh lính được bố trí bảo vệ thị trấn.", "eng": "A hundred soldiers were garrisoned in the town."}, {"viet": "Sân cỏ phủ đầy lá rụng.", "eng": "A lawn carpeted with fallen leaves."}, {"viet": "Một tờ giấy rời nằm trên bàn.", "eng": "A loose leaf of paper lying on the desk."}, {"viet": "Một chỉ số thực phẩm được dùng để tính chỉ số giá hàng tiêu thụ.", "eng": "A market basket is used to calculated the Consumer Price Index."}, {"viet": "Một biện pháp nhằm hất cẳng các đảng viên Lao động quá khích.", "eng": "A move to unseat Labour militants."}, {"viet": "Một bức thư ngắn được ghim vào tài liệu đó.", "eng": "A note pinned to the document."}, {"viet": "Một dân tộc không có ý thức gì về lịch sử.", "eng": "A people with no sense of history."}, {"viet": "Một quả có thể dài hơn 12 inch.", "eng": "A pod may be more than 12 inches long."}, {"viet": "Một cương vị chuyên nghiệp hình như hợp nhất tất cả công việc huấn luyện của ông ta.", "eng": "A professional position that seemed to meld all his training."}, {"viet": "Một thước đo đáng tin cậy về phản ứng của quần chúng.", "eng": "A reliable barometer of public feeling."}, {"viet": "Một vẻ thánh thiện trên gương mặt cô ấy.", "eng": "A saintly expression on her face."}, {"viet": "Một hành động đột nhiên đâm ra chửi bới dữ dội.", "eng": "A sharp descent to violent abuse."}, {"viet": "Một mùi hương gợi lại những kỷ niệm thời ấu thơ của tôi.", "eng": "A smell which summons up memories of my childhood."}, {"viet": "Một chương trình do nhà nước tài trợ có một điều khoản qui định việc chấm dứt đương nhiên.", "eng": "A state-funded programme with a sunset provision."}, {"viet": "Một chút u buồn trong giọng nói của cô ta.", "eng": "A suspicion of sadness in her voice."}, {"viet": "Một chủ đề làm tôi rất quan tâm.", "eng": "A topic that interests me greatly."}, {"viet": "Một tình huống có khuynh hướng đi tới bạo động với các quân lính và những người gây bạo loạn nôn nóng chờ một cuộc đụng độ.", "eng": "A volatile situation with troops and rioters eager for a confrontation."}, {"viet": "Một cuộc đấu tranh gay gắt với lương tâm của ai.", "eng": "A wrestle with one's conscience."}, {"viet": "Hành động theo đúng những quy định.", "eng": "Act in conformity with the rules."}, {"viet": "Sau một lúc hắn ta đứng dậy ra về.", "eng": "After a little he got up and left."}, {"viet": "Sau bữa ăn trưa cô ta ra ngoài để đi bách bộ một lúc.", "eng": "After lunch she sallied forth for a short walk."}, {"viet": "Sau cú sốc thất cử, đảng đã thật sự bắt đầu đoàn kết lại.", "eng": "After the shock of their electoral defeat, the party really began to pull together."}, {"viet": "Tất cả những tên phát xít đều không nhất trí với nhau, không cùng một loại.", "eng": "All fascists are not of one mind, one stripe."}, {"viet": "Tất cả mọi trường hợp có thể được xem xét trong phạm vi của luật lệ hiện hành.", "eng": "All the cases can be considered within the framework of the existing rules."}, {"viet": "Vẻ mặt của bà ta thay đổi hầu như không thể nhận thấy được.", "eng": "Almost imperceptibly her expression changed."}, {"viet": "Sự tăng tốc mức độ phát triển kinh tế.", "eng": "An acceleration in the rate of economic growth."}, {"viet": "Bầu không khí căng thẳng khắp phòng.", "eng": "An atmosphere of tension filled the room."}, {"viet": "Một số rất nhiều những chiếc áo váy tao nhã.", "eng": "An extensive wardrobe of elegant dresses."}, {"viet": "Một cái bếp dầu bị đổ và lập tức cháy bùng thành ngọn lửa.", "eng": "An oil heater was knocked over and burst instantly into flames."}, {"viet": "Một vụ tăng vọt về hàng bán, giá cả, các cuộc đầu tư.", "eng": "An upsurge in sales, costs, investments."}, {"viet": "Ann sẽ là một bổ sung có lợi cho đội chúng ta.", "eng": "Ann will be a very useful addition to our team."}, {"viet": "Đơn phải nộp trước 30 tháng tư.", "eng": "Applications must be in by 30 April."}, {"viet": "Phải chăng phụ nữ trực giác bén nhạy hơn đàn ông?", "eng": "Are women more intuitive than men?"}, {"viet": "Anh có sẵn sàng ăn một tí vào bữa trưa không?", "eng": "Are you ready for a spot of lunch?"}, {"viet": "Với tư cách là một luật sư thì cô ta hoàn toàn bất tài.", "eng": "As a lawyer she's totally incapable."}, {"viet": "Ngay khi đặt chân lên thành phố ấy họ đã đi tham quan khắp nơi.", "eng": "As soon as they arrived in the town they went out to explore."}, {"viet": "Ở cách xa sáu dặm, anh không thể thấy rõ được.", "eng": "At a distance of six miles, you can't see much."}, {"viet": "Bà ta về hưu lúc bao nhiêu tuổi?", "eng": "At what age did she retire?"}, {"viet": "Bây giờ sự phá sản đối với chúng ta thật khó tránh nổi.", "eng": "Bankruptcy now stares us in the face."}, {"viet": "Bị chết ngay do một phát súng độc nhất.", "eng": "Be killed outright by a single gunshot."}, {"viet": "Ong, ruồi, ong bắp cày bay vo ve quanh hũ mứt.", "eng": "Bees, flies and wasps buzzing round a pot of jam."}, {"viet": "Những người to lớn không hẳn là những người khỏe.", "eng": "Big men aren't necessarily strong men."}, {"viet": "Mua để dùng, không phải để trang trí.", "eng": "Bought for use, not for ornament."}, {"viet": "Đưa một điều khoản phụ vào hợp đồng.", "eng": "Build an extra clause into the contract."}, {"viet": "Nhưng tôi thấy anh có cuốn \"Hustler\" và \"Screw\", cả hai đều là bậy bạ nhất.", "eng": "But I see you have \"Hustler\" and \"Screw\", two of the worst."}, {"viet": "Nhưng bạn có thể mướn một xe cắm trại.", "eng": "But you could rent a camper."}, {"viet": "À này, tôi không muốn ủi hồ những cái áo sơ mi này.", "eng": "By the way, I don't want these shirts starched."}, {"viet": "Tôi có thể gửi thư bằng đường hàng không giao nhận đặc biệt không?", "eng": "Can I have it mailed airmail special delivery?"}, {"viet": "Anh có thể đổi tờ 5 bảng Anh này cho tôi không?", "eng": "Can you change this £ 5 note for me?"}, {"viet": "Anh với tay lấy dùm em đôi dép được không?", "eng": "Can you reach me over my slippers?"}, {"viet": "Anh không thể chấp nhận một lời nói đùa sao?", "eng": "Can't you take a joke?"}, {"viet": "Sác-lô diễn xuất sắc nhất trong vai một cậu bé bụi đời.", "eng": "Chaplin was at his best playing the little tramp."}, {"viet": "Những cây Nô-en sáng rực ánh đèn màu.", "eng": "Christmas trees aglow with coloured lights."}, {"viet": "Màu da và giới tính hầu như không liên quan gì với việc chỉ định một người nào đó vào một công việc.", "eng": "Colour and sex are hardly relevant when appointing somebody to a job."}, {"viet": "Hoạt động phối hợp của vài lực lượng cảnh sát.", "eng": "Concerted action by several police forces."}, {"viet": "Quạt mát mặt mình bằng một tờ báo.", "eng": "Cool one's face by fanning it with a newspaper."}, {"viet": "Bạn làm ơn chuyển giúp bơ nhé?", "eng": "Could you pass the butter, please?"}, {"viet": "Khoanh tay trước ngực của ai.", "eng": "Cross one's arms on one's chest."}, {"viet": "Các lái buôn mặc cả với nông dân về giá cà phê.", "eng": "Dealers bargain with growers over the price of coffee."}, {"viet": "Mặc cho mọi cố gắng của chúng tôi để phá cái khóa, nó vẫn không bung ra.", "eng": "Despite all our attempts to break it open, the lock would not yield."}, {"viet": "Anh quên rằng tôi sẽ tới sao?", "eng": "Did you forget that I was coming?"}, {"viet": "Việc đạo diễn kịch này đã được thuận lợi kể từ khi vị chủ nhiệm mới nhậm chức.", "eng": "Directing this play has been all roses since the new producer took over."}, {"viet": "Ở nước bạn, cha mẹ có chia đều trách nhiệm nuôi con cái không?", "eng": "Do mothers and fathers equally share the responsibility of child-raising in your country?"}, {"viet": "Bạn có thể tổ chức ăn mừng ngày lễ Thánh Patrick không?", "eng": "Do you celebrate St. Patrick's Day?"}, {"viet": "Lúc này chị có bán cá hồi tươi không?", "eng": "Do you have any fresh salmon in at the moment?"}, {"viet": "Anh có biết ai đã làm vỡ cửa kính không?", "eng": "Do you know who broke the window?"}, {"viet": "Anh có thấy tòa nhà màu xanh lá cây đó không?", "eng": "Do you see that green building?"}, {"viet": "Bà muốn bóng đèn 60 oát hay là bóng đèn 100 oát ạ?", "eng": "Do you want a 60-watt bulb or a 100-watt bulb?"}, {"viet": "Con đường này có dẫn đến Luân Đôn không?", "eng": "Does this road go to London?"}, {"viet": "Đừng gõ dao vào nĩa của mày.", "eng": "Don't clatter your knives and forks."}, {"viet": "Đừng có hỏi tôi phải làm gì, hãy tự làm theo ý mình đi.", "eng": "Don't keep asking me what to do, use your own discretion."}, {"viet": "Đừng có làm bẩn ống kính; tôi vừa đánh bóng nó đấy.", "eng": "Don't smear the lens; I've just polished it."}, {"viet": "Tôi thách anh tát các con tôi đó!", "eng": "Don't you dare smack my children!"}, {"viet": "Thuốc an thần có thể giúp kiềm chế được những bệnh nhân hung tợn.", "eng": "Drugs can make violent patients controllable."}, {"viet": "Những nỗ lực nhằm phục hồi mốt váy ngắn.", "eng": "Efforts to revive the mini-skirt."}, {"viet": "Việc gây tê ngoài màng cứng bây giờ thường được thực hiện trong lúc sinh đẻ.", "eng": "Epidurals are now often used during childbirth."}, {"viet": "Mọi người đang mong tôi về hưu vào năm tới, nhưng tôi nghĩ tôi sẽ tiếp tục làm việc.", "eng": "Everyone is expecting me to retire next year, but I think I'll continue to work."}, {"viet": "Xin lỗi, ông bà cảm phiền cho tôi đổi chỗ được không ạ?", "eng": "Excuse me, would you mind switching seats with me?"}, {"viet": "Tập làm quen với cách sử dụng một dụng cụ mới.", "eng": "Familiarizing oneself with the use of a new tool."}, {"viet": "Ít người nhận thức được tầm quan trọng của khám phá ấy.", "eng": "Few people realized the significance of the discovery."}, {"viet": "Trước hết chúng ta xem diễu hành vào buổi sang.", "eng": "First we had the parade in the morning."}, {"viet": "Tiếp theo tin tức trong nước, chúng ta có tin địa phương và tin thời tiết địa phương.", "eng": "Following the national news we have the local news and weather."}, {"viet": "Xin thứ lỗi cho sự ngu dốt của tôi, nhưng chính xác là bạn đang nói về điều gì thế?", "eng": "Forgive my ignorance, but what exactly are you talking about?"}, {"viet": "Rất sung sức và chạy tung tăng như một chú chó con.", "eng": "Full of pep and running around like a puppy."}, {"viet": "Đừng có bướng bỉnh nữa và xin lỗi đi.", "eng": "Get down off your high horse and apologize."}, {"viet": "Đưa cho ai một bản phân tích chi tiết tường tận cái gì.", "eng": "Give somebody a run-down on something."}, {"viet": "Đi đến thợ may để đo may một bộ quần áo.", "eng": "Go to the tailor to be measured for a suit."}, {"viet": "Anh có biết hôm qua tôi tình cờ gặp được ai không?", "eng": "Guess who I ran into yesterday?"}, {"viet": "Cô ấy đã trả nợ anh 2 bảng Anh chưa?", "eng": "Has she repaid you the £ 2?"}, {"viet": "Trước đây đã bao giờ bạn là tình nguyện viên chưa?", "eng": "Have you ever been a volunteer before?"}, {"viet": "Ông có đặt trước bàn với chúng tôi không?", "eng": "Have you made a reservation with us?"}, {"viet": "Anh ta sẽ có thể lợi dụng được kinh nghiệm của mình trong công việc mới.", "eng": "He'll be able to put his experience to good use in the new job."}, {"viet": "Anh ta luôn luôn nói vợ anh ta là một của quí thực sự.", "eng": "He's always saying his wife is a real jewel."}, {"viet": "Ông ấy thích đi bộ một mình.", "eng": "He's given to going for long walks on his own."}, {"viet": "Anh ấy nói không rõ trong điện thoại.", "eng": "He's not very coherent on the telephone."}, {"viet": "Khi phải làm vườn, nó thường ra quán rượu để trốn việc.", "eng": "He's usually skiving down at the pub when there's gardening to be done."}, {"viet": "Anh ta và tôi có cùng một sở thích.", "eng": "He and I have a common interest we both collect stamps."}, {"viet": "Anh ta thổi bụi bám trên cuốn sách.", "eng": "He blew the dust off the book."}, {"viet": "Ông ta không thể so sánh với Shakespeare với tư cách là một nhà sáng tác bi kịch.", "eng": "He cannot compare with Shakespeare as writer of tragedies."}, {"viet": "Anh ấy không còn cầm được nước mắt.", "eng": "He could no longer hold back his tears."}, {"viet": "Nó bị trẹo lưng vì nâng đồ đạc nặng.", "eng": "He did his back in lifting heavy furniture."}, {"viet": "Anh ta không muốn có bất cứ một sự ràng buộc nào; đó là lý do tại sao anh ta không lập gia đình.", "eng": "He doesn't want any ties; that's why he never married."}, {"viet": "Anh ta bị ngã chân bầm.", "eng": "He fell and bruised his leg."}, {"viet": "Anh ta nhận thấy sự buồn chán là điều khó có thể chịu đựng được.", "eng": "He found the boredom scarcely endurable."}, {"viet": "Ông ta hồi hộp lây khi thấy đứa con trai ghi được bàn thắng.", "eng": "He got a vicarious thrill out of watching his son score the winning goal."}, {"viet": "Hắn đã xảo quyệt chiếm tình thương yêu của cô ấy dần dần.", "eng": "He had insidiously wormed his way into her affections."}, {"viet": "Anh ta có ảnh hưởng lớn đối với đứa em trai của mình.", "eng": "He has a tremendous hold over his younger brother."}, {"viet": "Anh ta không có được nghị lực của chính mình.", "eng": "He has no will of his own."}, {"viet": "Ông kéo quần lên trước khi ngồi xuống.", "eng": "He hitched up his trousers before sitting down."}, {"viet": "Anh ta được cho biết đầy đủ các chi tiết về dự án mới ấy.", "eng": "He is fully genned up on the new project."}, {"viet": "Anh ấy luôn mặc quần áo vải tuýt.", "eng": "He is usually dressed in tweeds."}, {"viet": "Anh ấy nằm duỗi dài tay chân ra trên thảm cỏ.", "eng": "He lay outstretched on the grass."}, {"viet": "Anh ta trông có vẻ nghiêm trang; tôi cho là có chuyện gì đó không ổn.", "eng": "He looked grim; I could tell something was wrong."}, {"viet": "Ông ta đã làm dịu được cơn giận đang dâng lên của mình.", "eng": "He managed to subdue his mounting anger."}, {"viet": "Nó chạy xe chầm chậm vào gara.", "eng": "He nosed the car into the garage."}, {"viet": "Anh ta chơi điệu nhạc đó sai hoàn toàn.", "eng": "He played the tune all wrong."}, {"viet": "Anh ta thọc cây gậy sâu xuống bùn.", "eng": "He pushed his stick deep down into the mud."}, {"viet": "Anh ta bị mấy vết thương do đạn nhưng không có một bộ phận nào quan trọng bị phạm cả.", "eng": "He received several bullet wounds but was not hit in any of the vital parts."}, {"viet": "Ông ấy xuất thân bình dân trở thành thủ tướng.", "eng": "He rose from humble origins to become prime minister."}, {"viet": "Anh ấy luôn sẵn lòng giúp đỡ bạn bè.", "eng": "He's always ready to help his friends."}, {"viet": "Hôm nay ông ta nóng giận.", "eng": "He's in a mood today."}, {"viet": "Anh ta quyết tâm vào học đại học.", "eng": "He's set on going to university."}, {"viet": "Nó ngồi trong lớp học, đầu óc mơ màng nghĩ ( đến kỳ nghỉ ).", "eng": "He sat in the classroom, day-dreaming ( about the holidays )."}, {"viet": "Hắn chộp lấy cái túi và ôm nó chạy mất.", "eng": "He seized the bag and ran off with it."}, {"viet": "Anh ta ngủ để đèn sáng.", "eng": "He sleeps with the light on."}, {"viet": "Anh ta ăn mặc tươm tất để dự cuộc phỏng vấn.", "eng": "He spruced up for the interview."}, {"viet": "Anh ta gắn bó trung thành với cô ấy qua tất cả những bước thăng trầm của cuộc đời.", "eng": "He stuck by her through all life's ups and downs."}, {"viet": "Anh ta nghĩ mình là người chủ chốt của công ty, nhưng nói cho đúng hơn anh ta thực sự là người không quan trọng.", "eng": "He thinks he's a mainstay of the company, but he's really rather small beer."}, {"viet": "Anh nhấp một ngụm rượu vang rồi phun nó ra.", "eng": "He took one sip of the wine and spat it out."}, {"viet": "Nó trở nên cáu kỉnh khi chúng tôi từ chối cho nó số tiền đó.", "eng": "He turned nasty when we refused to give him the money."}, {"viet": "Anh ta muốn mượn ít tiền nhưng tôi bảo với anh ta tôi không có đồng nào.", "eng": "He wanted to borrow some money, but I told him I didn't have any."}, {"viet": "Anh ta được báo là các bạn của anh ta sắp tới.", "eng": "He was apprised that his friends would arrive soon."}, {"viet": "Anh ta hoàn toàn không biết mình đang bị theo dõi.", "eng": "He was completely unaware that he was being watched."}, {"viet": "Anh ta thành thực xin lỗi về sự sai lầm của mình.", "eng": "He was genuinely apologetic about his mistake."}, {"viet": "Ông ta được cử làm chủ nhiệm câu lạc bộ cricket.", "eng": "He was made president of the cricket club."}, {"viet": "Ông ta được xem như là một nhà thơ lớn nhất của Việt Nam.", "eng": "He was rated as the best poet of Vietnam."}, {"viet": "Nó đã bị chặn lại ngay bên ngoài khu phạt đền.", "eng": "He was tackled just outside the penalty area."}, {"viet": "Ông ấy không phải là giáo viên tồi nhưng ông ấy không thể kiểm soát được lớp.", "eng": "He wasn't a bad teacher but he couldn't control the class."}, {"viet": "Ông ta sẽ nhất quyết cưỡi chiếc xe đạp khủng khiếp đó.", "eng": "He will persist in riding that dreadful bicycle."}, {"viet": "Anh ta nhíu mày, bối rối và lo lắng vì các sự việc lạ lùng.", "eng": "He wrinkled his brow, confused and worried by the strange events."}, {"viet": "Những lời khuyên có ích để giặt quần áo cho lũ trẻ.", "eng": "Helpful hints for cleaning children's clothes."}, {"viet": "Công việc kinh doanh của bà ta đã sút kém khi bà ta ốm.", "eng": "Her business suffered when she was ill."}, {"viet": "Sự không hài lòng của cô ấy về việc anh ấy đến muộn.", "eng": "Her dissatisfaction at his late arrival."}, {"viet": "Cách cắm hoa của cô ta được giải nhất.", "eng": "Her flower arrangement won first prize."}, {"viet": "Trí tưởng tượng có chiều hướng chi phối cô ta.", "eng": "Her imagination tends to run away with her."}, {"viet": "Tâm trí cô ấy đang tập trung cao cho việc học thi.", "eng": "Her mind was in high gear while studying for the examination."}, {"viet": "Biểu diễn của cô ấy trội hơn của tất cả những người khác.", "eng": "Her performance eclipsed all the others."}, {"viet": "Bí mật của cô ta vẫn chưa được kể ra cho đến ngày nay.", "eng": "Her secret remains untold to this day."}, {"viet": "Câu chuyện bi thảm của cô ấy đã làm tất cả chúng tôi xúc động buồn lòng.", "eng": "Her tragic story touched us all touched our hearts with sorrow."}, {"viet": "Bản ghi nhớ đổi tiền đã được điền rồi đây.", "eng": "Here is the filled out exchange memo."}, {"viet": "Cơn giận dữ của ông ấy làm tôi ngạc nhiên-tôi cứ nghĩ ông ấy là một người bình tĩnh.", "eng": "His anger surprised me-I had thought he was a calm person."}, {"viet": "Phanh của ông ta bị tuột trên đồi dốc.", "eng": "His brakes failed on a steep hill."}, {"viet": "Lòng dũng cảm của anh ta phản ánh những tiếng khen về trung đoàn của mình.", "eng": "His courage reflects credit on his regiment."}, {"viet": "Đôi mắt anh ta nhắm lại sung sướng và anh mỉm cười.", "eng": "His eyes shut blissfully and he smiled."}, {"viet": "Thua cờ bạc khiến anh nợ nần đầy dẫy.", "eng": "His gambling losses put him deeply in debt."}, {"viet": "Những nhận xét quá đáng của anh ta đã đưa anh ta vào chỗ phiền toái.", "eng": "His intemperate remarks got him into trouble."}, {"viet": "Các thủy thủ của ông thất vọng vì họ không tìm thấy các thành phố lớn và giàu có.", "eng": "His men were disappointed that they found no great, rich cities."}, {"viet": "Bố mẹ nó rõ ràng là không dạy nó cách xử thế.", "eng": "His parents obviously didn't teach him manners."}, {"viet": "Sự bình phục của ông ta cho ông ta tiếp tục cuộc sống mới.", "eng": "His recovery gave him a new lease of life."}, {"viet": "Bài nói chuyện của ông ta tầm thường nhạt nhẽo quá.", "eng": "His speech was one of great triviality."}, {"viet": "Các bạn độc thân chọc ghẹo anh ấy về các chương trình đám cưới của anh ấy.", "eng": "His unmarried friends twitted him about his wedding plans."}, {"viet": "Công kích mãnh liệt sự bất công và thành kiến.", "eng": "Hitting out at injustice and prejudice."}, {"viet": "Sau một cuộc đua những con ngựa nên được dẫn đi bộ một lát.", "eng": "Horses should be walked for a while after a race."}, {"viet": "Làm sao cô ta có thể phục hồi thanh danh của mình sau vụ tai tiếng đó?", "eng": "How can she salvage her reputation after the scandal?"}, {"viet": "Cái thời đó dường như đã xa vời biết bao, anh ta ngẫm nghĩ.", "eng": "How distant those times seemed now, he reflected."}, {"viet": "Đời sống anh dạo này ra sao?", "eng": "How goes the world with you?"}, {"viet": "Có bao nhiêu sinh viên Canada đi du học?", "eng": "How many Canadian students go abroad to study?"}, {"viet": "Chúng ta đã thua bao nhiêu ván rồi?", "eng": "How many tricks did we lose?"}, {"viet": "Cứ cách bao lâu thì có một chuyến xe buýt?", "eng": "How often do the buses run?"}, {"viet": "Người và vật đều có quyền sống ngang nhau.", "eng": "Humans and animals have an equal right to live."}, {"viet": "Tôi muốn mua vài món đồ gốm tráng men ba màu kiểu triều đại nhà Đường để làm quà tặng.", "eng": "I'd like to buy some tri-color glazed pottery in the Tang style for presents."}, {"viet": "Tôi không muốn để cô ta vào nhà tôi.", "eng": "I'll be damned if I let her come into my house."}, {"viet": "Tôi sẽ phải lo cho sửa chữa cái mái nhà.", "eng": "I'll have to see about getting the roof mended."}, {"viet": "Tôi sẽ đổi cho anh bộ sưu tập tem của tôi lấy chiếc tàu mô hình của anh.", "eng": "I'll trade you my stamp collection for your model boat."}, {"viet": "Tôi đâm ra ngày càng vỡ mộng về London.", "eng": "I'm becoming increasingly disenchanted with London."}, {"viet": "Ngày mai, tôi sẽ đi đám cưới anh trai tôi.", "eng": "I'm going to my brother's weeding tomorrow."}, {"viet": "Tôi không đi với anh đâu''Có chứ! Anh nhất định sẽ phải đi!'.", "eng": "I'm not coming with you''Yes you bloody well are!'."}, {"viet": "Tôi đã ngán đến tận cổ những lời kêu ca dai dẳng của anh.", "eng": "I'm sick and tired of your constant complaints."}, {"viet": "Con biết chắc là cái máy tẩy lông để trong tủ.", "eng": "I'm sure the hair remover is in the closet."}, {"viet": "Tôi lo lắng về tính an toàn của sản phẩm.", "eng": "I'm worried about the safety of the product."}, {"viet": "Tôi đã đặt vé cho anh chuyến bay trực tiếp đi Pari rồi.", "eng": "I've booked you a direct flight to Paris."}, {"viet": "Tôi đã nghe nói rất nhiều về ông, và tôi đã muốn được gặp ông.", "eng": "I've heard so much about you, and I've been wanting to meet you."}, {"viet": "Tôi thấy anh ta uống mười li trong buổi tối.", "eng": "I've seen him knock back ten whiskies in an evening."}, {"viet": "Tôi luôn mang trong người một lá bùa cho may mắn.", "eng": "I always carry one for luck."}, {"viet": "Mẹ ơi, con không mệt đâu, cô bé trả lời.", "eng": "I am not aweary, mother, replied the little girl."}, {"viet": "Tôi hỏi cô ta điều cô ta đã nghĩ, nhưng e liên luỵ cô ấy từ chối trả lời.", "eng": "I asked her what she thought, but she refused to commit herself."}, {"viet": "Tôi mua một chiếc ô tô giống như xe của anh.", "eng": "I bought the same car as yours."}, {"viet": "Tôi không thể xỏ chân vào đôi giày được, chúng chật quá.", "eng": "I can't get into these shoes, they're too small."}, {"viet": "Tôi không nghĩ ra được tôi có thể cất chúng ở nơi nào khác.", "eng": "I can't think where else I would have put them."}, {"viet": "Tôi vẫn còn có thể cảm thấy đau ở chỗ kim châm.", "eng": "I can still feel the prick."}, {"viet": "Tôi ra đi vào lúc này có thể không đúng lắm.", "eng": "I can't very well leave now."}, {"viet": "Tôi không thể nào không cảm thấy ghen tị khi cô ta được thăng lên chức cao hơn tôi.", "eng": "I couldn't help feeling jealous when she was promoted over my head."}, {"viet": "Tôi muốn dùng thử một ít thức ăn Trung Quốc.", "eng": "I'd like to try some Chinese food."}, {"viet": "Tôi không nói với cô ấy chúng tôi sẽ đi nghỉ vì tôi muốn dành cho cô ấy một sự ngạc nhiên.", "eng": "I didn't tell her we were going on holiday because I wanted to give her a surprise."}, {"viet": "Tôi không biết gì về tàu sân bay cả.", "eng": "I don't know anything about aircraft carriers."}, {"viet": "Tôi không cần sự giúp đỡ của ông, cám ơn ông, nhưng đó là một ý nghĩ tốt.", "eng": "I don't need your help, thank you, but it was a kind thought."}, {"viet": "Tôi không muốn sẽ bị lôi kéo vào các cuộc tranh luận của họ.", "eng": "I don't want to become embroiled in their arguments."}, {"viet": "Tôi không thích xem TV một mình.", "eng": "I don't like to watch TV alone."}, {"viet": "Tôi thi trượt và điều an ủi nhỏ nhoi duy nhất là tôi có thể thi lại.", "eng": "I failed my exam, and my only crumb of comfort is that I can take it again."}, {"viet": "Tôi cảm thấy thoả mãn sau bữa ăn đầy đủ.", "eng": "I felt quite satisfied after my big meal."}, {"viet": "Tôi có cảm tưởng rằng vấn đề đã được giải quyết.", "eng": "I gained the impression that the matter had been settled."}, {"viet": "Tôi tới đó suýt giờ để đi chuyến tàu sớm.", "eng": "I got there almost in time to catch the earlier train."}, {"viet": "Vì tàu không đến và không có xe buýt, tôi không còn sự lựa chọn nào khác là đợi.", "eng": "I had no option but to wait there was nothing I could do except wait."}, {"viet": "Tôi có một cái hẹn với bạn gái tối nay.", "eng": "I have a date with my girl-friend tonight."}, {"viet": "Tôi mất vé rồi Nếu thế thì bạn phải mua lại vé.", "eng": "I have lost my ticket Then you must pay again."}, {"viet": "Bác phải dọn dẹp nhà cửa.", "eng": "I have to clean the house."}, {"viet": "Tôi không có nhiều thời giờ.", "eng": "I haven't got a lot of time."}, {"viet": "Tôi cho là các bậc cha mẹ phải chịu trách nhiệm về hạnh kiểm của con cái.", "eng": "I hold the parents responsible for their child's behaviour."}, {"viet": "Tôi mong chị không phật ý nếu tôi không ăn hết chiếc bánh này.", "eng": "I hope you won't be offended if I don't finish this cake."}, {"viet": "Tôi biết một nhà hàng Ý ngon.", "eng": "I know a good Italian restaurant."}, {"viet": "Tôi rất thích môn đánh gôn, nhưng tôi nghĩ tôi thích quần vợt hơn.", "eng": "I like golf a lot, but I guess I like tennis better."}, {"viet": "Tôi sẽ khởi hành rất sớm.", "eng": "I'll be on my way very soon."}, {"viet": "Tôi sẽ gặp anh tại văn phòng.", "eng": "I'll meet you at the office."}, {"viet": "Tôi là học sinh cấp hai.", "eng": "I'm a junior high school student."}, {"viet": "Tôi sẽ sống độc thân cho đến tuổi 3.", "eng": "I'm going to stay single until I'm 3."}, {"viet": "Tôi sẵn sàng thử cái đó.", "eng": "I'm prepared to have a whack at it."}, {"viet": "Tôi mắc quá nhiều lỗi nên phải làm lại toàn bộ.", "eng": "I made so many mistakes that, I had to do it all over."}, {"viet": "Tôi phải gửi những bức thư này đi bằng bưu điện theo chuyến thư đầu tiên ngày mai.", "eng": "I must get these letters off by the first post tomorrow."}, {"viet": "Tôi cần vào nhà vệ sinh.", "eng": "I need to go to the bathroom."}, {"viet": "Tôi vừa vặn kiềm chế được mình khỏi quát tháo với anh ta.", "eng": "I only just managed to stop myself from shouting at him."}, {"viet": "Tôi cố ý để nó ở chỗ anh ta có thể nhìn thấy.", "eng": "I purposely left it where he could see it."}, {"viet": "Tôi xét thấy là ông ấy đã quá già để làm việc đó.", "eng": "I reckon that he is too old for the job."}, {"viet": "Tôi nói không và chúng tôi tranh luận với nhau gay gắt về chuyện đó.", "eng": "I said no and we got into a big argument over it."}, {"viet": "Tôi sẽ rất cảm kích nếu ông thu xếp bất cứ việc gì ông có thể.", "eng": "I shall appreciate it very much if you would fit in whatever you can."}, {"viet": "Tôi ngủ rất ít đêm qua.", "eng": "I slept very little last night."}, {"viet": "Tôi cho rằng ông ta là một người quan trọng trong làng.", "eng": "I suppose he's a somebody in the village."}, {"viet": "Tôi nghĩ tôi đã làm bài được trong kỳ thi.", "eng": "I think I did OK in the exam."}, {"viet": "Tôi nghĩ là có rượu vang Dragon Seal.", "eng": "I think there is Dragon Seal wine."}, {"viet": "Tôi ném sợi dây thừng và anh ấy túm được.", "eng": "I threw the rope and he caught hold of it."}, {"viet": "Tôi hiểu hắn có manh tâm gì khi tôi bắt gặp vài lá thư hắn viết cho Jane.", "eng": "I tumbled to what he was up to when I found some of his letters to Jane."}, {"viet": "Tôi đã đợi anh cả buổi sáng nhưng chẳng thấy mặt anh đâu.", "eng": "I waited for you all morning but you never showed."}, {"viet": "Tôi muốn gặp hắn ngay khi hắn đến.", "eng": "I want to see him the minute he arrives."}, {"viet": "Tôi buộc phải thừa nhận sức mạnh những lý lẽ của anh ta.", "eng": "I was compelled to acknowledge the force of his argument."}, {"viet": "Sáng nay tôi đi học muộn vì tôi ngủ quên.", "eng": "I was late for school this morning because I overslept."}, {"viet": "Tôi bị mời lên gặp chủ tôi để giải thích các hành động của tôi.", "eng": "I was summoned by my boss to explain my actions."}, {"viet": "Tôi đi ra ga và mua vé.", "eng": "I went to the station and bought my ticket."}, {"viet": "Ước gì chúng tôi có những chợ như thế này ở Nhật.", "eng": "I wish we had these in Japan."}, {"viet": "Tôi sẽ không thể nào tìm ra chúng đâu.", "eng": "I won't be able to find them."}, {"viet": "Tôi muốn lấy thuốc theo toa này.", "eng": "I would like to have this prescription filled, please."}, {"viet": "Tôi sẽ không làm bẩn tay vì nhận đút lót.", "eng": "I wouldn't sully my hands by accepting a bribe."}, {"viet": "Nếu ông ta tiến hành quá nhanh, ông ta có thể gây ra sự chống đối mạnh mẽ của phe bảo thủ.", "eng": "If he moved too quickly, he might provoke a backlash from the diehards."}, {"viet": "Nếu thương lượng không xong, chúng ta sẽ phải dùng đến hành động bãi công.", "eng": "If negotiations fail we shall have to resort to strike action."}, {"viet": "Nếu công việc này mà thành công, chúng ta sẽ giàu có sung sướng.", "eng": "If this deal goes through, we'll be in fat city."}, {"viet": "Nếu cô yêu cầu số máy nhánh 725, cô sẽ được nối máy đến phòng của ông Clarke.", "eng": "If you ask for extension 725, you'll get Mr. Clarke's room."}, {"viet": "Nếu bạn thi trượt thì chỉ nên tự trách mình mà thôi.", "eng": "If you fail the exam, you'll only have yourself to blame."}, {"viet": "Nếu anh khạc nhổ trong một xe buýt Luân Đôn anh có thể bị phạt.", "eng": "If you spit in a London bus you may be punished."}, {"viet": "Thấm nhuần lòng yêu nước, tràn đầy tham vọng, lòng tràn đầy tình yêu, v. v.", "eng": "Imbued with patriotism, ambition, love, etc."}, {"viet": "Ở chương 12, chủ đề là Thế chiến thứ nhất.", "eng": "In Chapter 12, the subject matter is World War I."}, {"viet": "Ở ý, ông quan sát những ngôi sao và ghi lại tất cả những gì ông nhìn thấy.", "eng": "In Italy he watched the stars and kept records of what he saw."}, {"viet": "Dù tôi đã cố gắng dỗ, em bé vẫn khóc.", "eng": "In spite of my efforts to pacify it the baby continued to cry."}, {"viet": "Trong vở kịch ông chú già độc ác đóng vai phản diện làm tôn vị hoàng tử trẻ cao quý lên.", "eng": "In the play a wicked old uncle acts as a foil to noble young prince."}, {"viet": "Theo ý bạn, những mối nguy hiểm của việc làm hư hỏng do nuông chiều con cái là gì?", "eng": "In your opinion, what are the dangers of spoiling children?"}, {"viet": "Bữa ăn của bà ngon miệng chứ ạ?", "eng": "Is everything all right with your meal?"}, {"viet": "Ánh sáng có đủ tốt để chụp ảnh được không?", "eng": "Is the light good enough to take photographs?"}, {"viet": "Đây có phải là quầy làm thủ tục cho chuyến bay 887 đi New York không ạ?", "eng": "Is this the counter for checking in of the flight 887 to New York, please?"}, {"viet": "Đây là một thành phố hiện đại với những tòa nhà cao tầng và những vụ ùn tắc giao thông.", "eng": "It's a modern city with high buildings and traffic jams."}, {"viet": "Nghe anh nói thế tôi trút được gánh nặng.", "eng": "It's big load of my mind to hear you say that."}, {"viet": "Dưới sức ép kinh khủng như thế thật khó có thể giữ cho mình không điên được.", "eng": "It's hard to stay sane under such awful pressure."}, {"viet": "Việc leo núi ấy chẳng có gì là khó, nó chỉ là trò trẻ con đối với người leo núi lão luyện.", "eng": "It's not a difficult climb-it should be child's play for an experienced mountaineer."}, {"viet": "Người ta nói rằng nó có thể làm giảm cân.", "eng": "It's said that it can help people reduce weight."}, {"viet": "Nước này cần phải đi đầu trong việc cấm vũ khí hạt nhân.", "eng": "It's up to this country to take the initiative in banning nuclear weapons."}, {"viet": "Tôi thấy có vẻ như những người của đảng Xã hội sẽ không thắng cuộc tuyển cử này.", "eng": "It doesn't look to me as if the Socialists will win the election."}, {"viet": "Nó được gọi là Đỉnh Hoa Sen vì nó có một hình dáng như hoa đoá sen.", "eng": "It is called the Lotus Flower Peak as it's shaped like a lotus flower."}, {"viet": "Vẫn chưa thể đánh giá về định lượng của tính hữu hiệu của đầu tư của chúng ta.", "eng": "It is not yet possible to make a quantitative assessment of the effectiveness of our investment."}, {"viet": "Có vẻ họ thích vui đùa với nhau.", "eng": "It looks like they enjoy one another."}, {"viet": "Đó là một cuộc họp mặt bạn bè thân mặt.", "eng": "It's an informal gathering of friend."}, {"viet": "Đi máy bay rất nhanh và thoải mái.", "eng": "It's very speedy and comfortable."}, {"viet": "Anh ta phải mất một thời gian rất lâu để tìm ra câu trả lời.", "eng": "It took him forever to find the answer."}, {"viet": "Người ta tin là con người có thể bị hồn ma ám ảnh.", "eng": "It was believed that people could be possessed by evil spirits."}, {"viet": "Ai cũng thấy rõ rành rành là cô ta không thích ý kiến đó.", "eng": "It was patent to anyone that she disliked the idea."}, {"viet": "Sẽ rất có ích khi giữ một ít nhân dân tệ Trung Quốc trước khi rời đi.", "eng": "It will be helpful keeping some Chinese Yuan before leaving."}, {"viet": "Khảm ngọc bích có một lịch sử lâu vài ngàn năm ở Trung Quốc.", "eng": "Jade carving has a long history of several thousand years in China."}, {"viet": "John sẽ bắt đầu đi học vào tháng chín.", "eng": "John is starting school in September."}, {"viet": "Công lý thường được nhân hình hoá thành một phụ nữ bịt mắt cầm cái cân.", "eng": "Justice is often personified as a blindfolded woman holding a pair of scales."}, {"viet": "Những đám mây dạng thấu kính có hình bầu dục mượt mà.", "eng": "Lenticular clouds with a smooth, elliptical outline."}, {"viet": "Chúng ta hãy tổ chức một bữa tiệc vào chủ nhật tới nhé.", "eng": "Let's have a party next Sunday."}, {"viet": "Rất nhiều sự chuyển biến đã diễn ra giữa hai cuộc chiến tranh thế giới.", "eng": "Many changes took place between the two world wars."}, {"viet": "Nhiều phong tục lạ từ thời xưa còn sót lại.", "eng": "Many strange customs have survived from earlier times."}, {"viet": "Tôi có được phép yêu cầu bạn đừng nhắc lại điều này không?", "eng": "May I ask you not to repeat this?"}, {"viet": "Có lẽ vì bạn thiếu kiên nhẫn thôi.", "eng": "Maybe it's because you lack the patience."}, {"viet": "Hầu hết trẻ em đều được đưa bằng máy bay tới nơi an toàn.", "eng": "Most of the children were airlifted to safety."}, {"viet": "Bà Hill không tiếp ai ngoài họ hàng ruột thịt.", "eng": "Mrs Hill is not at home to anyone except close relatives."}, {"viet": "Quần áo của tôi không thể bỏ vừa vào vali bé tí ấy được.", "eng": "My clothes won't all go into that tiny suitcase."}, {"viet": "Tay tôi bẩn quá, tôi cần đi rửa tay.", "eng": "My hands are filthy, I'd better go and clean up."}, {"viet": "Cha mẹ chúng tôi tống chúng tôi đi cắm trại mỗi mùa hè.", "eng": "My parents packed us off to camp every summer."}, {"viet": "Đứa con trai út của tôi đang học mẫu giáo.", "eng": "My youngest son goes to kindergarten."}, {"viet": "Báo chí đã tường thuật vụ đó một cách giật gân làm cho nó có vẻ tồi tệ hơn là thực trạng của nó.", "eng": "Newspapers reported the incident sensationally, making it appear worse than it really was."}, {"viet": "Không, ông không cần đi xe buýt.", "eng": "No, you needn't take a bus."}, {"viet": "Tôi cho là không hơn một tháng.", "eng": "Not more than a month, I suppose."}, {"viet": "Nhiều sự gián đoạn đã ngăn cản tôi không hoàn thành được công việc.", "eng": "Numerous interruptions have prevented me from finishing my work."}, {"viet": "Ồ, các loại đặc biệt mà chúng tôi uống với đá.", "eng": "Oh, there's a special kind for the summer which we drink on the rocks."}, {"viet": "Khi xuất trình thẻ hội viên, anh sẽ được mua với giá hạ.", "eng": "On production of your membership card, you will receive a discount on purchases."}, {"viet": "Một người bị bắn chết trong một cuộc loạn đả chính trị.", "eng": "One man was shot dead in a political brawl."}, {"viet": "Hoặc nếu thật sự bỏ cuộc, bạn có thể qua đêm ở một khách sạn.", "eng": "Or it you really have to, you can spend an occasional night in a motel."}, {"viet": "Giờ bay của chúng ta sẽ khoảng một tiếng và chúng ta sẽ lên đến độ cao 8000 bộ và bay với vận tốc 260 dặm một giờ.", "eng": "Our flight time will be approximately one hour and we shall be climbing to an altitude of 8,000 feet and cruising at a speed of 260 miles per hour."}, {"viet": "Nhà hàng Hoa Đào của chúng tôi nổi tiếng về cách nấu nướng theo kiểu Sơn Đông.", "eng": "Our Peach Blossoms is famous for Shandong Cuisine."}, {"viet": "Những người làm gia công trong ngành may thường bị trả công thấp.", "eng": "Outworkers in the clothing industry are usually badly paid."}, {"viet": "Sảnh đường luôn luôn là một phần nghệ thuật phong cảnh và làm vườn Trung Quốc.", "eng": "Pavilions have always been a part of Chinese landscaping and gardening."}, {"viet": "Những người không có bảo hiểm phải trả tiền cho các khoản sửa chữa của họ.", "eng": "People without insurance had to pay for their own repairs."}, {"viet": "Xin hãy đánh dấu mục cô muốn chọn.", "eng": "Please tick off the one which you like to choose."}, {"viet": "Những nhận xét không thích hợp với vấn đề chúng ta đang bàn luận.", "eng": "Remarks not pertinent to the matter we are discussing."}, {"viet": "Nhìn từ trên xuống, các cánh đồng trông như thể một đồ án hình học.", "eng": "Seen from above, the fields looked like a geometrical pattern."}, {"viet": "Cô ta gài các thứ vớ vẩn này lên mái tóc của cô ta để trang điểm.", "eng": "She'd put these whatnots in her hair as decoration."}, {"viet": "Cô ấy đã yêu cầu được để yên nhưng báo chí cứ quấy rầy cô ta hoài.", "eng": "She's asked to be left alone but the press keep pestering her."}, {"viet": "Cô ta đã giận hờn với anh bạn trai của cô ta.", "eng": "She's had a tiff with her boy friend."}, {"viet": "Cô ta đề cập đến việc này chỉ để tránh né mà thôi.", "eng": "She's only introducing this as a quibble."}, {"viet": "Cô ta rất tài về ảo thuật, cô ta có thể phù phép lấy ra một con thỏ từ một chiếc mũ.", "eng": "She's very good at magic, she can conjure a rabbit out of a hat."}, {"viet": "Cô ta nhờ tôi cài giúp chiếc áo váy ở sau lưng.", "eng": "She asked me to do up her dress for her at the back."}, {"viet": "Cô đã giành được phần lớn các giải bơi.", "eng": "She carried off most of the prizes for swimming."}, {"viet": "Cô ấy cuộn tròn chân tay lại thành tư thế như cái bào thai.", "eng": "She curled up her legs and arms into a foetal position."}, {"viet": "Cô ta nhại ông chủ rất giỏi.", "eng": "She does a brilliant take-off of the boss."}, {"viet": "Cô ta cảm thấy không thể phát huy tính sáng tạo của mình.", "eng": "She felt creativity was being strangles."}, {"viet": "Cô ấy cho chúng tôi những lời chỉ dẫn rất cụ thể.", "eng": "She gave us very specific instructions."}, {"viet": "Bà ta đã xơ xác đi vì nghèo khổ và bệnh tật.", "eng": "She had been worn down by poverty and illness."}, {"viet": "Cô ấy luôn luôn có những bạn bè sang trọng vây quanh.", "eng": "She has always been surrounded with fashionable friends."}, {"viet": "Cô ta không có tính kiên trì để làm công việc thêu thùa.", "eng": "She hasn't the patience to do embroidery."}, {"viet": "Cô ấy dòng dõi người Đức nhưng nay là một công dân Pháp.", "eng": "She is German by birth but is now a French citizen."}, {"viet": "Cô ấy tự tách mình ra khỏi người khác.", "eng": "She keeps herself apart from other people."}, {"viet": "Cô ta nóng lòng muốn thoát ra khỏi sự kiềm chế của người mẹ.", "eng": "She longed to escape from her mother's domination."}, {"viet": "Cô ta đã lấy người mà bố mẹ cô ta không đồng ý và đặt bố mẹ cô trước việc đã rồi.", "eng": "She married the man her parents disapproved of and presented them with a fait accompli."}, {"viet": "Cô ta vẽ ra một hình ảnh lạc quan về tương lai của công ty.", "eng": "She painted a rosy picture of the firm's future."}, {"viet": "Cô ấy cào đất lên để xới cỏ dại.", "eng": "She raked over the soil to loosen the weeds."}, {"viet": "Cô ta đúng là sản phẩm của những năm 60.", "eng": "She's a real child of the 60's."}, {"viet": "Bà ta đâu còn là người trẻ nữa, phải không?", "eng": "She's no spring chicken, is she?"}, {"viet": "Cô ấy ngồi tay xoay xoay chân ly rượu.", "eng": "She sat twirling the stem of the glass in her fingers."}, {"viet": "Cô ta rất khéo léo xử trí trong hoàn cảnh phức tạp.", "eng": "She showed great tact in dealing with a tricky situation."}, {"viet": "Cô ấy lèn sách lên giá đến kỳ hết chỗ.", "eng": "She squeezed as many books onto the shelf as she could."}, {"viet": "Bà ta sẽ nhận trách nhiệm tuần sau.", "eng": "She takes up her responsibilities next week."}, {"viet": "Bà ta bước hụt và đập đầu gối vào bàn.", "eng": "She tripped and banged her knee on the desk."}, {"viet": "Năm 19 tuổi cô ấy mất trinh.", "eng": "She was 19 when she lost her virginity."}, {"viet": "Chị ấy đã bị thu hút vào phong trào chống hạt nhân.", "eng": "She was caught up in the anti-nuclear movement."}, {"viet": "Cô ta ngủ với người hàng xóm trong khi chồng cô đi công tác xa.", "eng": "She was having it off with a neighbour while her husband was away on business."}, {"viet": "Bà ta bị công kích trên báo chí vì những bữa tiệc tùng lãng phí.", "eng": "She was pilloried in the press for her extravagant parties."}, {"viet": "Cô ta được nhận vào làm như một thực tập sinh.", "eng": "She was taken on as a graduate trainee."}, {"viet": "Cô ta nhìn mưa đổ ào ào xuống cửa sổ.", "eng": "She watched the rain pouring down the windows."}, {"viet": "Cô ấy sẽ không nói với tôi chỗ cô ta để nó ở chỗ nào.", "eng": "She won't tell me whereabouts she put it."}, {"viet": "Cô ta vụt quả bóng trở lại lên trên lưới.", "eng": "She zapped the ball back over the net."}, {"viet": "Khi ra bạn nhớ khép cửa lại.", "eng": "Shut the door after you when you go out."}, {"viet": "Mất uy tín đối với bạn bè của ai.", "eng": "Sink in the estimation of one's friends."}, {"viet": "Những chữ in nhỏ trong các văn kiện có thể chứa đựng những cái bẫy cho những người không cẩn thận.", "eng": "Small print in documents can contain traps for the unwary."}, {"viet": "Vô tình đến độ cười người khác đang đau đớn.", "eng": "So insensitive as to laugh an someone in pain."}, {"viet": "Điều chỉnh ống kính đôi chút có thể là cần thiết.", "eng": "Some adjustment of the lens may be necessary."}, {"viet": "Vài người trong số các chủ trại đã biết tiết kiệm trong những năm được mùa, còn những người khác thì bị nạn mất mùa làm cho sạt nghiệp.", "eng": "Some of the farmers had been provident in the good years but others were ruined by the bad harvests."}, {"viet": "Nhiều thầy giáo đã nhồi nhét sinh viên của họ.", "eng": "Some teachers spoon-feed their students."}, {"viet": "Hãng SONY sẽ phát một đài giải trí mới.", "eng": "SONY will come out with a new play station."}, {"viet": "Bỏ cả cuộc đời của mình ra chăm sóc cho những người khác.", "eng": "Spend one's entire life caring for other people."}, {"viet": "Hãy bắt đúng làn sóng này để nghe các tin tức thể thao mới nhất.", "eng": "Stay tuned to this wavelength for the latest sports news."}, {"viet": "Thôi đừng e dè nữa, muốn nói gì thì nói đi.", "eng": "Stop pussyfooting around and say what you mean."}, {"viet": "Đệ trình các dự án lên cho hội đồng để phê chuẩn.", "eng": "Submit plans to the council for approval."}, {"viet": "Sue bây giờ đã lấy lại được sự yêu mến của anh ta.", "eng": "Sue is now reinstated in his affections."}, {"viet": "Những sinh vật sống nổi trong một môi trường đối nghịch.", "eng": "Survivable organisms in a hostile environment."}, {"viet": "Hãy lấy cuốn sách mà nó đang nằm ở trên bàn.", "eng": "Take the book which is lying on the table."}, {"viet": "Về phương diện kỹ thuật tòa nhà này là một kiệt tác nhưng ít người thích nó.", "eng": "Technically the building is a masterpiece, but few people like it."}, {"viet": "Cám ơn bạn, tốt hơn là tôi không uống nữa.", "eng": "Thank you, I'd rather not."}, {"viet": "Dứt khoát đấy là người đàn ông tôi đã trông thấy trên ô tô.", "eng": "That's the man I saw in the car all right."}, {"viet": "Cái bộ áo kia hơi sặc sỡ phải không?", "eng": "That dress is a bit loud, isn't it?"}, {"viet": "Ông đó sẽ đóng thay cho ngôi sao lớn ấy trong những pha nguy hiểm.", "eng": "That man will stand in for the big star in the dangerous scenes."}, {"viet": "Đó là điều anh ta nói vậy thôi.", "eng": "That's just what he would say."}, {"viet": "Máy bay cất cánh thật êm, phải vậy không?", "eng": "That was a smooth take-off, wasn't it?"}, {"viet": "Tai nạn xảy ra do sự bất cẩn nghiêm trọng của người lái xe.", "eng": "The accident was caused by the gross negligence of the drive."}, {"viet": "Vụ này đã được báo chí cường điệu lên.", "eng": "The affair was dramatized by the press."}, {"viet": "Người câu cá lội ra giữa dòng sông.", "eng": "The angler waded out into the middle of the river."}, {"viet": "Khu vực đó được một số cửa hàng và các phương tiện khác ở địa phương phục vụ tốt.", "eng": "The area is well serviced by a number of local shops and other facilities."}, {"viet": "Các nhà du hành vũ trụ được huấn luyện trong một loại máy móc tạo nên những điều kiện trong không gian.", "eng": "The astronauts trained in a machine that simulates conditions in space."}, {"viet": "Sông Avon đổ ra biển Severn.", "eng": "The Avon disgorges into the Severn."}, {"viet": "Chuối vẫn còn xanh, vì vậy chúng chưa chín đâu.", "eng": "The bananas are still green, so they aren't ripe yet."}, {"viet": "Bãi chiến trường là một cảnh tượng khủng khiếp.", "eng": "The battlefield was a fearsome sight."}, {"viet": "Bản tuyên ngôn nhân quyền trong hiến pháp Hoa Kì.", "eng": "The bill of rights of the US constitution."}, {"viet": "Chiếc thuyền cập ngang chúng tôi và ra hiệu cho chúng tôi dừng lại.", "eng": "The boat came abreast of us and signaled us to stop."}, {"viet": "Cuốn sách đó dày tới 800 trang.", "eng": "The book runs to 800 pages."}, {"viet": "Cậu bé huýt sáo vui vẻ ( bỏ đi ).", "eng": "The boy was whistling ( away ) cheerfully."}, {"viet": "Nét đại cương của một kế hoạch.", "eng": "The broad outline of a plan."}, {"viet": "Chiếc xe buýt bị xe lửa cắt ngang làm đôi.", "eng": "The bus was cut in two by the train."}, {"viet": "Công ty cho thuê xe hơi là liên doanh làm ăn liều lĩnh gần đây nhất của họ.", "eng": "The car-hire firm is their latest business venture."}, {"viet": "Chiếc xe ô tô lùi lại khó khăn qua đám bùn lỏng.", "eng": "The car wallowed back through the slush."}, {"viet": "Con mèo đang liếm bộ lông của nó.", "eng": "The cat was licking its fur."}, {"viet": "Những thay đổi đó có lợi về một số phương diện nhưng về những phương diện khác thì không.", "eng": "The changes are beneficial in some ways but not in others."}, {"viet": "Đứa trẻ đó giữ năm mươi xu để tiêu vặt.", "eng": "The child kept fifty cents for spending money."}, {"viet": "Hôm nay bọn trẻ rất ồn ào.", "eng": "The children are very boisterous today."}, {"viet": "Bọn trẻ đi ngủ không kêu ca gì hết.", "eng": "The children went to bed without a murmur."}, {"viet": "Viên quản lý gánh xiếc vụt cây roi kêu vun vút.", "eng": "The circus manager snapped his whip."}, {"viet": "Cái máy sấy áo quần thật hết sức lợi hại khi thời tiết ẩm ướt.", "eng": "The clothes-dryer was a life-saver during the wet weather."}, {"viet": "Vụ đâm xe đã biến chiếc ôtô đó thành một đống sắt vô dụng.", "eng": "The collision reduced the car to a useless wreck."}, {"viet": "Công ty ấy sụp đổ với khoản nợ hai triệu bảng Anh.", "eng": "The company crashed with debts of £ 2 million."}, {"viet": "Một chuỗi phức tạp huyền thoại và sự kiện.", "eng": "The complex tissue of myth and fact."}, {"viet": "Các lục địa là Châu âu, Châu á, Châu Phi, bắc Mỹ, Nam Mỹ, úc và Nam Cực.", "eng": "The continents are Europe, Asia, Africa, North America, South America, Australia, and Antarctica."}, {"viet": "Các nhà lãnh đạo của đất nước bị buộc tội bành trướng lãnh thổ.", "eng": "The country's leaders were accused of territorial expansionism."}, {"viet": "Tòa tạm nghỉ để ăn trưa.", "eng": "The court will adjourn for lunch."}, {"viet": "Đám đông rẽ ra cho họ đi qua.", "eng": "The crowd parted to let them through."}, {"viet": "Vết chém đó phải mất một thời gian dài mới liền lại được.", "eng": "The cut took a long time to close up."}, {"viet": "Quyết định đó do người tiền nhiệm của tôi đưa ra.", "eng": "The decision was made by my predecessor."}, {"viet": "Thiết kế của con tàu vũ trụ đang trải qua sự cải tiến sâu rộng.", "eng": "The design of the spacecraft is undergoing extensive modification."}, {"viet": "Sự mất tích của chiếc máy bay đó vẫn còn bí mật.", "eng": "The disappearance of the aircraft remained unexplained."}, {"viet": "Bác sĩ trao cho anh ta một phiếu ghi rõ sức khoẻ tốt.", "eng": "The doctor gave him a clean bill of health."}, {"viet": "Con chó kêu ẳng một cái khi bị tôi dẫm lên chân nó.", "eng": "The dog gave a yelp when I trod on its paw."}, {"viet": "Những cồn cát đổ thoai thoải như sóng gợn ra biển.", "eng": "The downs fell in gentle undulations to the sea."}, {"viet": "Những người quá cần cù chăm chỉ trong công nghiệp hiếm khi đạt được tiềm năng của họ, nói gì tới việc vươn tới đỉnh cao.", "eng": "The eager beavers of industry seldom reach their potential, much less rise to the top."}, {"viet": "Sự bán dịch vụ điện nước.", "eng": "The electricity and water sell-off."}, {"viet": "Công việc táo bạo đó thế nào cũng đi đến thất bại.", "eng": "The enterprise was doomed to failure."}, {"viet": "Tỉ lệ hối đoái hôm nay có lợi cho chúng ta.", "eng": "The exchange rate is in our favour today."}, {"viet": "Các nhà máy phải chịu trách nhiệm về việc làm ô nhiễm không khí trong khu vực cách xa hàng dặm xung quanh.", "eng": "The factories are responsible for fouling up the air for miles around."}, {"viet": "Người cha có mặt vào lúc sinh nở.", "eng": "The father was present at the moment of birth."}, {"viet": "Bộ phim đó đang được trình chiếu tại rạp chiếu bóng địa phương.", "eng": "The film is being shown at the local cinema."}, {"viet": "Trụ sở chính của hãng này đặt ở Luân Đôn.", "eng": "The firm's headquarters are in London."}, {"viet": "Chiếc cầu treo tương đối lớn đầu tiên là cầu Brooklyn ở New York.", "eng": "The first really big suspension bridge ever built was New York's Brooklyn Bridge."}, {"viet": "Cái tiếp đó có ý nghĩa quan trọng nhất.", "eng": "The following is of greatest importance."}, {"viet": "Điểm đóng băng của nước là 0 độ C.", "eng": "The freezing-point of water is 0 0 C."}, {"viet": "Tên cướp lấy trộm một khẩu súng và bắn mở đường chạy ra khỏi trại giam.", "eng": "The gangster stole a gun and shot his way out of prison."}, {"viet": "Suối nước nóng Giant phun nước lên cao 175 bộ trên không ttrung.", "eng": "The Giant Geyzer sends water 175 feet high up into air."}, {"viet": "Biện pháp vụng về của nhà nước đối với những người tàn tật.", "eng": "The government's ham-fisted approach towards the disabled."}, {"viet": "Chính phủ đã ém nhẹm tin tức trong thời gian khủng hoảng.", "eng": "The government imposed a news black-out during the crisis."}, {"viet": "Chính phủ phải đáp ứng đòi hỏi của dân chúng về việc giảm thuế.", "eng": "The government yielded to public demands for lower taxes."}, {"viet": "Mặt đất bị ẩm ướt từng khoảng nhỏ.", "eng": "The ground is wet in patches."}, {"viet": "Khẩu súng có góc nghiêng 45 độ.", "eng": "The gun has an elevation of 45 degrees."}, {"viet": "Những cơn sóng mạnh đập tan con tàu ra từng mảnh.", "eng": "The heavy waves battered the ship to pieces."}, {"viet": "Con ngựa từ từ đi bước một sau một hồi lâu phi nước đại.", "eng": "The horse slowed to a walk after its long gallop."}, {"viet": "Ngôi nhà đó có đủ mọi khuyết điểm vì nó được xây bởi những tay con buôn bất tài.", "eng": "The house has all these defects because it was built by cowboys."}, {"viet": "Những kẻ bộ hành đói khát chậm chạp lê bước dọc con đường.", "eng": "The hungry marchers shambled slowly along the road."}, {"viet": "Các biến cố in sâu vào trí nhớ của cô.", "eng": "The incidents printed themselves on her memory."}, {"viet": "Các chỉ dẫn đó không thể hiểu được ngay.", "eng": "The instructions were not readily understandable."}, {"viet": "Công ty kim hoàn chỉ là cái bình phong cho công việc buôn bán kim cương bất hợp pháp của họ.", "eng": "The jewellery firm is just a front for their illegal trade in diamonds."}, {"viet": "Bồi thẩm đoàn tuyên bố hắn ta phạm tội ngộ sát.", "eng": "The jury found him guilty of manslaughter."}, {"viet": "Phong cảnh vùng Lake District đã tạo cảm hứng cho Wordsworth sáng tác thi ca bất hủ của ông ta.", "eng": "The Lake District scenery inspired Wordsworth to write his greatest poetry."}, {"viet": "Nếu muốn khống chế thực sự tội ác, luật pháp phải được tăng cường hiệu lực.", "eng": "The law must be given more teeth if crime is to be properly controlled."}, {"viet": "Thư viết bằng mật mã vì thế tôi không hiểu được.", "eng": "The letter was written in code and I could not understand it."}, {"viet": "Cô bé xịt nước vào chúng tôi bằng khẩu súng bắn nước của cô ta.", "eng": "The little girl squirted us with water from her water-pistol."}, {"viet": "Quãng âm thấp của kèn clarinet.", "eng": "The lower register of a clarinet."}, {"viet": "Gương mặt người đàn ông đó bị rỗ.", "eng": "The man's face was badly pock-marked."}, {"viet": "Que diêm lóe cháy trong bóng tối.", "eng": "The match flared in the darkness."}, {"viet": "Buổi họp đã kéo dài quá 30 phút.", "eng": "The meeting raw over by 30 minutes."}, {"viet": "Những người thợ mỏ bị chôn sống khi đường hầm sập.", "eng": "The miners were buried alive when the tunnel collapsed."}, {"viet": "Số tiền được gửi uỷ thác cho nó cho đến khi nó hai mươi mốt tuổi.", "eng": "The money is being held in trust for him until he is twenty-one."}, {"viet": "Cơ thể bất động không còn biểu hiện gì của sự sống cả.", "eng": "The motionless body showed no signs of life."}, {"viet": "Tên của thành phố đó nghe rất lãng mạn.", "eng": "The name of the city sounds very romantic."}, {"viet": "Những tấm màn cửa mới thật hoàn toàn hợp với tấm thảm.", "eng": "The new curtains are a perfect match for the carpet."}, {"viet": "Đường xe lửa mới hiện còn đang được xây dựng.", "eng": "The new railway is still under construction."}, {"viet": "Tin tức được loan truyền nhanh chóng cho mọi người.", "eng": "The news was quickly passed round."}, {"viet": "Bản thông báo được đặt ở vị trí quá cao-không ai có thể đọc được.", "eng": "The notice is placed too high-nobody can read it."}, {"viet": "Kẻ thù ghê gớm nhất có thể trở thành cộng sự.", "eng": "The oddest of enemies might become bedfellows."}, {"viet": "Cụ già phân chia tài sản thành từng phần cho các người thừa kế.", "eng": "The old man apportioned the property among the heirs."}, {"viet": "Phe đối lập đang cố làm giảm giá trị những thành tựu của chúng ta.", "eng": "The opposition are trying to diminish our achievements."}, {"viet": "Cơn đau hành làm nó chỉ mong bất tỉnh đi.", "eng": "The pain made him long for oblivion."}, {"viet": "Tổ chức đảng đang hoạt động tới mức cao nhất khi cuộc bầu cử đến gần.", "eng": "The party organization is moving into top gear as the election approaches."}, {"viet": "Các cánh hoa trông có màu đỏ bởi vì các tia màu đỏ đập vào mắt chúng ta.", "eng": "The peals look red because the red rays reach our eyes."}, {"viet": "Những ảo ảnh do đầu óc bị giày vò gây ra.", "eng": "The phantom visions created by a tormented mind."}, {"viet": "Tiếng keng của cái thìa chạm vào cái cốc.", "eng": "The ping of a spoon hitting a glass."}, {"viet": "Kế hoạch về thuế mới đã bị chỉ trích rất kịch liệt.", "eng": "The plans for the new tax have come in for a lot of flak."}, {"viet": "Thú nhàn hạ quá chẳng mấy chốc nhàm chán thôi.", "eng": "The pleasures of idleness soon cloy."}, {"viet": "Cảnh sát xác định không còn nghi ngờ gì về tội của hắn.", "eng": "The police established his guilt beyond all doubt."}, {"viet": "Cảnh sát rọi đèn pha vào căn nhà.", "eng": "The police shone a searchlight on the house."}, {"viet": "Giáo hoàng là người lãnh đạo tôn giáo của nhiều người theo đạo Cơ đốc.", "eng": "The Pope is the spiritual leader of many Christians."}, {"viet": "Tiền tố im-là một hình thái bị đồng hoá của in-.", "eng": "The prefix im-is an assimilated form of in-."}, {"viet": "Tổng thống bị ép buộc từ chức.", "eng": "The president was forced to resign."}, {"viet": "Ông thủ tướng bị một đám phóng viên vây chặt lấy.", "eng": "The Prime Minister was besieged by reporters."}, {"viet": "Vấn đề là làm sao chuyển được máy nặng này.", "eng": "The problem was how to move the heavy machinery."}, {"viet": "Việc đề nghị những điều khoản mới cho một hiệp ước.", "eng": "The proposal of new terms for a peace treaty."}, {"viet": "Ý đồ có thể không phải là rõ ràng ngay tức thì.", "eng": "The purpose may not be immediately evident."}, {"viet": "Chất ra-đi-um đang phát quang lên trong bóng tối.", "eng": "The radium was glowing in the dark!"}, {"viet": "Những kẻ nổi loạn được thu phục nhanh chóng.", "eng": "The rebels were quickly brought under."}, {"viet": "Những lời đối đáp qua lại trên bàn ăn.", "eng": "The repartee flew back and forth across the dinner table."}, {"viet": "Những kết quả ngược với sự mong đợi.", "eng": "The results were contrary to expectation."}, {"viet": "Con sông uốn khúc chảy về phía xa.", "eng": "The river snaked away into the distance."}, {"viet": "Không khí của căn phòng ngột ngạt và âm u giống như mùa đầy những đám mây báo bão.", "eng": "The room's air was broody and sullen, like the season's own, full of storm clouds."}, {"viet": "Những người chạy xuất phát với một tốc độ tối đa.", "eng": "The runners set off at a blistering pace."}, {"viet": "Sự khan hiếm thực phẩm buộc giá cả gia tăng.", "eng": "The scarcity of food forced prices up."}, {"viet": "Biển dần dần lấn vào đất liền.", "eng": "The sea is gradually encroaching on the land."}, {"viet": "Các đặc tính của hội chứng suy hoại khả năng miễn nhiễm qua việc nghiên cứu huyết thanh.", "eng": "The serology of acquired immune deficiency syndrome."}, {"viet": "Con tàu chìm dần cho đến khi boong ngập nước.", "eng": "The ship sank slowly until her deck was afloat."}, {"viet": "Đến chín giờ buổi biểu diễn mới bắt đầu.", "eng": "The show doesn't begin until nine o'clock."}, {"viet": "Tình hình không đáng lo ngại như vẻ của nó.", "eng": "The situation is less worrying than it appears."}, {"viet": "Cái gọi là những người mới giàu lên.", "eng": "The so-called emerging affluent."}, {"viet": "Phần âm thanh giả của vụ đánh nhau trong vở kịch truyền thanh đó rất đạt.", "eng": "The sound effects of the fight were very good in that radio play."}, {"viet": "Người đề xướng một dự luật nhập cư mới.", "eng": "The sponsor of a new immigration bill."}, {"viet": "Những công nhân thép đình công ủng hộ những người thợ mỏ.", "eng": "The steel workers came out in sympathy with the miners."}, {"viet": "Cuộc đình công làm cho ngành công nghiệp đình trệ.", "eng": "The strike brought industry grinding to a halt."}, {"viet": "Cái đỉnh núi cho thấy một toàn cảnh đẹp đẽ.", "eng": "The summit of a mountain offers a fine panorama."}, {"viet": "Cái thùng này trông dễ tưởng nhầm là nhỏ: thật ra nó chứa được rất nhiều.", "eng": "The tank is deceptively small: it actually holds quite a lot."}, {"viet": "Gần đây, đội bóng cảm thấy buồn bực-trong hai tháng không thắng một trận nào.", "eng": "The team's been having a thin time recently-not a single win in two months."}, {"viet": "Tụi khủng bố đã giao nộp hai con tin của chúng cho cảnh sát.", "eng": "The terrorists have yielded two of their hostages up the police."}, {"viet": "Thuỷ triều đang bắt đầu lên, chúng ta nên quay về thôi.", "eng": "The tide is turning, we'd better get back."}, {"viet": "Hai trung đoàn được bố trí đóng quân trong thị trấn.", "eng": "The town was garrisoned with two regiments."}, {"viet": "Nó cao khoảng 20 bộ.", "eng": "The trees grow to be about 20 feet tall."}, {"viet": "Hai người bạn từ lâu không gặp nhau đang mải mê trò chuyện.", "eng": "The two friends were engaged in a dialogue, having met each other after a long time."}, {"viet": "Công đoàn đã thương lượng một tuần làm việc 35 giờ.", "eng": "The union has negotiated a 35-hour working week."}, {"viet": "Địa điểm trận đấu bóng đá là sân vận động Hàng Đẫy.", "eng": "The venue of the football match, was the Hang Day Stadium."}, {"viet": "Nhân viên phục vụ sẽ mang nó đến cho ông ngay.", "eng": "The waitress will bring it to you soon."}, {"viet": "Thời tiết mùa hè năm nay thật là chán ngán.", "eng": "The weather this summer has been most disappointing."}, {"viet": "Gió thổi từ sa mạc đến và phủ đầy cát lên mọi vật.", "eng": "The wind blew from the desert and covered everything with sand."}, {"viet": "Từ này có vài sắc thái ý nghĩa.", "eng": "The word had several shades of meaning."}, {"viet": "Đồng yên đạt tới giá cao kỷ lục trong thương trường hôm nay.", "eng": "The yen hit a record high in trading today."}, {"viet": "Sự thất bại không đi đến một quyết định nào của họ đã đặt cô ta vào một tình thế tuyệt vọng.", "eng": "Their failure to come to a decision put her in an impossible position."}, {"viet": "Tàu của Davy Jones đã chìm xuống đáy biển.", "eng": "Their ship was sent to Davy Jones's locker."}, {"viet": "Vậy các điều kiện thanh toán là gì?", "eng": "Then what are the terms of payment?"}, {"viet": "Có cầu thang ở cả hai đầu hành lang.", "eng": "There's a staircase at either end of the corridor."}, {"viet": "Trên những máy bay này, không có rộng chỗ để duỗi chân.", "eng": "There's not much leg-room in these aircraft."}, {"viet": "Có nhiều kiểu người nhảy múa khác nhau.", "eng": "There are different kinds of dancers."}, {"viet": "Có vài ba loại chó lông mượt.", "eng": "There are several varieties of spaniel."}, {"viet": "Từ khi vợ anh ta chết thì cuộc đời anh trở nên vô nghĩa.", "eng": "There has been a vacuum in his life since his wife died."}, {"viet": "Một cảng mới và hai khách sạn đang được xây dựng.", "eng": "There is a new port and two hotels abuilding."}, {"viet": "Chúng tôi không ai lại không mong muốn giúp đỡ anh.", "eng": "There is not one of us but wishes to help you."}, {"viet": "Trong thái độ của cô ta đối với tôi, có phần hơi lạnh lùng.", "eng": "There was a certain coldness in her attitude towards me."}, {"viet": "Những người đã làm việc tích cực nhất lại ít được khen.", "eng": "There was little credit for those who had worked hardest."}, {"viet": "Có mấy đôi đang tỏ tình với nhau trong công viên.", "eng": "There were several courting couples in the park."}, {"viet": "Những điều kiện này đã ngăn cản chúng tôi tham gia vào cuộc thương lượng.", "eng": "These conditions preclude our taking part in the negotiations."}, {"viet": "Những viên thuốc này là phương thuốc có hiệu quả chữa đau đầu.", "eng": "These pills are an effective cure for a headache."}, {"viet": "Họ vừa ly dị nhau, Tôi có nghe-nhưng anh nhớ cho là, tôi có ngạc nhiên đâu.", "eng": "They're getting divorced, I hear-mind you, I'm not surprised."}, {"viet": "Tất cả chúng nó đều bị cảm lạnh và đều khụt khịt, hắt hơi.", "eng": "They all had colds and were sniffing and sneezing."}, {"viet": "Họ không chắc sẽ đến vì thời tiết quá xấu.", "eng": "They are unlikely to come since the weather is so bad."}, {"viet": "Họ đã chọn cách làm lơ những nhận xét bất lịch sự của bà ta.", "eng": "They chose to pass over her rude remarks."}, {"viet": "Họ không có đủ thức ăn, hoặc áo quần, hay tình thương.", "eng": "They don't have enough food, or clothing, or love."}, {"viet": "Cuối cùng họ thắng thế chúng tôi bằng việc quyết định nói tiếng Đức.", "eng": "They got one over us in the end by deciding to speak in German."}, {"viet": "Họ phải sống ở mỏ.", "eng": "They have to live at the mines."}, {"viet": "Họ còn đặt ra nhiều câu chuyện để giải thích tại sao mỗi chòm sao lại có mặt trên bầu trời.", "eng": "They made up stories to explain how each constellation came to be in the sky."}, {"viet": "Họ đã khoét sâu nỗi lo sợ mất việc làm của anh ta để buộc anh làm những cái họ muốn.", "eng": "They played on his fears of losing his job to get him to do what they wanted."}, {"viet": "Họ nói anh ta là một sinh viên rất giỏi, quả thật anh ta như thế.", "eng": "They say he is the best student, and he is too."}, {"viet": "Chúng nộp súng cho cảnh sát.", "eng": "They surrendered their guns to the police."}, {"viet": "Họ có thể để dành được đủ đồ đạc để bày biện căn buồng.", "eng": "They were able to save enough of their furniture to fill a room."}, {"viet": "Chúng thật sự là những ngôi đền thu hút gửi và cho vay.", "eng": "They were really temples which collected deposits and made loans."}, {"viet": "Cứ thử tưởng tượng một chiếc đầu tàu hỏa lớn có thể tự phục hồi ống khói của nó nếu bị vỡ, có thể lớn hơn gấp 20 lần so với khi nó được làm ra và có thể sinh ra những tàu hỏa mới thì sao?", "eng": "Think of a big locomotive that could mend its smokestack if were broken, and could grow to be 20 times as big as it was when it was made, and could produce new little locomotives!"}, {"viet": "Chiếc ghế này hơi lung lay, bạn có thể giữ hộ khi tôi đứng lên ghế được không?", "eng": "This chair's unsteady, will you hold it while I stand on it?"}, {"viet": "Áo đầm này không còn hợp thời nữa.", "eng": "This dress is not in style any more."}, {"viet": "Đây là một trường hợp phân biệt đối xử rõ ràng ( đối với hàng nhập ngoại ).", "eng": "This is a clear case of discrimination ( against foreign imports )."}, {"viet": "Đây là nơi lần đầu tiên tôi nhìn thấy cô ấy.", "eng": "This is the place where I first saw her."}, {"viet": "Kiểu này phải mất hai năm để tạo ra.", "eng": "This model was two years in the making."}, {"viet": "Vở kịch này thường được gán cho Shakespeare.", "eng": "This play is usually ascribed to Shakespeare."}, {"viet": "Xà phòng này sẽ làm cho da anh sạch ( vết bẩn ).", "eng": "This soap should help clear your skin ( of spots )."}, {"viet": "Đây là phần thưởng cao nhất anh ấy có thể nhận.", "eng": "This was the highest accolade he could receive."}, {"viet": "Hàng ngàn dân tị nạn sẽ chết nếu những đồ tiếp tế này không tới được ( chỗ họ ).", "eng": "Thousands of refugees will die if these supplies don't get through ( to them )."}, {"viet": "Tom làm việc mỗi ngày, vì thế anh ấy đang bắt đầu cảm thấy kiệt sức.", "eng": "Tom works every day so he is starting to feel burned out."}, {"viet": "Những thế lực ngấm ngầm đang hoạt động để lật đổ chính phủ.", "eng": "Unknown forces were at work to overthrow the government."}, {"viet": "Trong gia đình bạn, anh chị em có hiềm khích nhau nhiều không?", "eng": "Was there much sibling rivalry in your family?"}, {"viet": "Chúng ta sẽ phải sa thải nó-nó chẳng làm việc gì cả.", "eng": "We'll have to get rid of him-he never does a stroke."}, {"viet": "Chúng ta sắp có khách, thế nên anh hãy làm bây giờ nhé?", "eng": "We're having visitors so would you do it now?"}, {"viet": "Chúng tôi đã nát óc để tìm lời giải cho bài toán.", "eng": "We've been scratching our heads for a solution to the problem."}, {"viet": "Chúng tôi khuyên họ nên bắt đầu sớm.", "eng": "We advised that they should start early."}, {"viet": "Chúng tôi đang tìm một loại sợi hóa học chất lượng cao.", "eng": "We are looking for a quality chemical fiber."}, {"viet": "Chúng tôi mua nhiều thứ cho chúng tôi.", "eng": "We bought a lot of things for ourselves."}, {"viet": "Trong hoàn cảnh thúc bách, chúng tôi có thể cung cấp chỗ ăn chỗ ở cho sáu người.", "eng": "We can provide accommodation for six people at a push."}, {"viet": "Chúng tôi chuyên về hàng dệt dùng trong gia đình, như tấm ra trải giường, tấm phủ giường, khăn tắm,.", "eng": "We deal in home textiles, such as bedsheets, bedspreads, bath towels, and so on."}, {"viet": "Chúng tôi tính sẽ mất 50 người trong lực lượng lao động của chúng tôi hành năm do sự thiếu hụt người tự nhiên.", "eng": "We expect to lose over 50 people from our work force every year by natural wastage."}, {"viet": "Đêm qua chúng tôi bị một cơn bão khủng khiếp, nhưng đứa bé vẫn ngủ yên suốt đêm.", "eng": "We had an awful storm last night but the baby slept right through."}, {"viet": "Chúng tôi đã được mời đến dự đám cưới con gái họ.", "eng": "We have been invited to their daughter's wedding."}, {"viet": "Mỗi ngày chúng tôi có hai lần phát thư.", "eng": "We have two postal deliveries each day."}, {"viet": "Chúng tôi đã lắng nghe một cách háo hức vì anh ta mang đến tin tức của gia đình chúng tôi.", "eng": "We listened eagerly, for he brought news of our families."}, {"viet": "Chúng ta phải sẵn sàng, gần 5 giờ kém 10 rồi.", "eng": "We must be ready, and it's nearly ten to five."}, {"viet": "Chúng tôi cần bằng chứng cụ thể, không phải lý thuyết.", "eng": "We need concrete evidence, not theories."}, {"viet": "Chúng tôi vui mừng vì ông đã đến.", "eng": "We're glad you could come."}, {"viet": "Chúng tôi sẽ lại bắt đầu vào công việc của chúng tôi trong mười lăm phút nữa.", "eng": "We shall resume our work in a quater of an hour."}, {"viet": "Chúng tôi đã nói thẳng với cô ấy là không muốn cô ấy đến.", "eng": "We told her roundly that she was unwelcome."}, {"viet": "Chúng tôi đã đi ( xem ) buổi biểu diễn ra mắt vở mới của họ.", "eng": "We went to the première of their new presentation."}, {"viet": "Chúng tôi lâm vào tình trạng bối rối vì cái tin đó.", "eng": "We were thrown into confusion by the news."}, {"viet": "Điều kiện thời tiết khá xấu làm cho ngay cả những người leo núi kinh nghiệm nhất cũng phải do dự.", "eng": "Weather conditions were bad enough to give pause to even the most experienced climbers."}, {"viet": "À, lúc nào cũng có người lo lắng cho anh thì tốt chứ sao.", "eng": "Well, it's nice to have somebody to worry about you all the time."}, {"viet": "Anh đã có mặt khi tin tức được loan báo chứ?", "eng": "Were you present when the news was announced?"}, {"viet": "Ông đội cái mũ này trông mới kỳ cục làm sao!", "eng": "What an object you look in that old hat!"}, {"viet": "Nước nào có tiếng là an toàn?", "eng": "What country is known for being safe?"}, {"viet": "Vậy thực ra thì anh muốn nói với tôi cái gì? Nào nói toạc ra đi!'.", "eng": "What exactly are you trying to tell me? Come on, spit it out!'."}, {"viet": "Chính sách của Công đảng về vấn đề nhập cư là thế nào?", "eng": "What is the Labour Party's policy on immigration?"}, {"viet": "Nước bạn có loại vận chuyển công cộng nào?", "eng": "What kind of public transportation does your country have?"}, {"viet": "Điều cô ta nói làm cho tôi nhận ra tôi đã sai lầm.", "eng": "What she said convinced me that I was mistaken."}, {"viet": "Điều anh nói không có liên quan gì đến đề tài đó.", "eng": "What you say is irrelevant to the subject."}, {"viet": "Khi anh ta lên đến đỉnh đồi, anh ta ngừng lại một lúc để nghỉ.", "eng": "When he reached the top of the hill he paused for a minute to rest."}, {"viet": "Khi đàn ông và phụ nữ cùng ăn thì đàn ông phải kéo ghế ra cho phụ nữ và để ý xem tất cả phụ nữ đều ngồi trước khi họ ngồi vào chỗ của mình.", "eng": "When men and women are eating together, the men should pull out the chairs for the women and see that all the ladies are seated before taking their own places."}, {"viet": "Khi họ lau sạch bức tranh họ phát hiện ra bên dưới là một bức tranh của Holbein.", "eng": "When they cleaned up the painting they discovered a Holbein underneath."}, {"viet": "Tờ báo đâu rồi?''Làm sao mà tớ biết được, tớ đã nhìn thấy nó đâu.'.", "eng": "Where's the newspaper?''Search me, I haven't seen it.'."}, {"viet": "Khôn ngoan hay không là tuỳ thuộc vào tinh thần thực hiện công việc.", "eng": "Whether it was unwise or not depends upon the spirit in which it was done."}, {"viet": "Tôi có thể dùng phần mềm nào cho máy tính này?", "eng": "Which software can I use with this computer?"}, {"viet": "Anh cho rằng ai sẽ lên làm Thủ tướng?'.", "eng": "Who do you think will be the next Prime Minister?'."}, {"viet": "Tại sao anh lại quét vôi căn phòng với cái màu khó chịu này?", "eng": "Why did you paint the room that putrid colour?"}, {"viet": "Tại sao phụ nữ lại bị đối xử như những công dân loại hai?", "eng": "Why should women be treated as second-class citizens?"}, {"viet": "Xin ông vui lòng gửi cho chúng tôi những mẫu hàng mới nhất của công ty ông nhé?", "eng": "Will you kindly send us samples of the latest items of your company?"}, {"viet": "Với một cú nhảy nhẹ nhàng, con mèo đã phốc lên cành cây.", "eng": "With an easy spring, the cat reached the brunch."}, {"viet": "Công việc xây dựng nhà hát mới bị chậm lại ba tháng.", "eng": "Work on the new theatre has been set back three months."}, {"viet": "Ông có muốn uống một ít cà phê, trà hay trà xanh Trung Quốc không ạ?", "eng": "Would you like some coffee, tea or Chinese green tea?"}, {"viet": "Ông làm ơn điền vào phiếu rút tiền này được không?", "eng": "Would you please fill in this withdrawal slip?"}, {"viet": "Vâng, sau đó, chúng ta sẽ đi thăm viện bảo tàng và pháo đài trên đỉnh đồi.", "eng": "Yes, after that, we'll visit the museum and the fortress on top of the hill."}, {"viet": "Có, có nhiều nhà hàng ngon và thậm chí có cả bếp trưởng người Pháp làm việc ở đó nữa.", "eng": "Yes, there are many good restaurants and even French chefs are working there."}, {"viet": "Cậu sẽ bị béo nếu cậu ăn tất cả những bánh kem này.", "eng": "You'll get fat if you eat all those cream cakes."}, {"viet": "Chị đúng ra cũng không mảnh mai lắm có phải không?', cô ta nói với người bạn to béo của mình.", "eng": "You're not exactly sylphlike, are you?', she said to her fat friend."}, {"viet": "Ông được phép rút tiền ở tài khoản hai lần trong một tháng.", "eng": "You are allowed to make two withdrawals a month from the account."}, {"viet": "Cô không thể lấy hắn được đâu! Hắn khá già như bố cô vậy!", "eng": "You can't marry him! He's old enough to be your father!"}, {"viet": "Anh có thể đóng giầy từ da súc vật.", "eng": "You can make shoes from the skin of animals."}, {"viet": "Anh đã khôn ngoan bán đi khi giá đang cao.", "eng": "You did well to sell when the price was high."}, {"viet": "Trước đây bạn đã nhận được một bức thư tình, phải không?", "eng": "You have received a love letter before, haven't you?"}, {"viet": "Ông mặc cái áo sơ mi màu đỏ này trông khá hợp.", "eng": "You look pretty good in this red shirt."}, {"viet": "Anh hẳn đã xem được nhiều thứ lạ trong chuyến đi đây đó của anh.", "eng": "You must have seen a lot of strange things in your wanderings."}, {"viet": "Ông phải điền vào bản ghi nhớ đổi tiền như nhân viên ngân hàng báo.", "eng": "You ought to fill in the exchange memo as the clerk tells you."}, {"viet": "Ông nên thanh toán đủ tiền để mua ngân phiếu du lịch.", "eng": "You should pay money in full for the purchase of traveler's cheques."}, {"viet": "Cậu nên về sớm để tránh tắc nghẽn giao thông.", "eng": "You want to leave early to avoid the traffic."}, {"viet": "Trẻ em nhỏ tuổi không nên để cho đi xa bố mẹ.", "eng": "Young children should not be allowed to stray from their parents."}, {"viet": "Mẹ anh sẽ điên tiết lên nếu bà ta biết anh ở đây.", "eng": "Your mother would have a fit if she knew you were here."}]