[{"viet": "20 đại biểu bỏ phiếu thuận đối với kiến nghị đó.", "eng": "20 delegates voted for the motion."}, {"viet": "Nó nối với sông Rhine bằng một con kênh đào.", "eng": "A canal connects it to the Rhine River."}, {"viet": "Một nhân viên khách sạn đang dọn dẹp phòng của Bob.", "eng": "A clerk is cleaning Bob's room."}, {"viet": "Một quốc gia tự cung cấp đủ về than.", "eng": "A country self-sufficient in coal."}, {"viet": "Một chiếc tàu khu trục tuần tiễu trên biển Ban-tích.", "eng": "A destroyer cruising about in the Baltic sea."}, {"viet": "Sự giảm mức lãi suất là một điều có thể xảy ra trong tình hình kinh tế hiện nay.", "eng": "A fall in interest rates is a probability in the present economic climate."}, {"viet": "Chặng đầu tiên trên con đường đến thành công.", "eng": "A first stepping-stone on the path to success."}, {"viet": "Một vẻ u buồn, ủ rũ trên gương mặt của anh ta.", "eng": "A gloomy, overcast expression on his face."}, {"viet": "Một vị khách thanh toán bằng chi phiếu cá nhân.", "eng": "A guest pays with a personal cheque."}, {"viet": "Một ngôi nhà trong tình trạng hoang phế.", "eng": "A house in a state of dereliction."}, {"viet": "Một nhà trại lớn cùng với nhiều căn nhà phụ hữu dụng.", "eng": "A large farm house with useful outbuildings."}, {"viet": "Một phần nhỏ của cuộc đàm đạo là bàn về chính trị.", "eng": "A little of the conversation was about politics."}, {"viet": "Một người tươi cười khi đương đầu với nguy hiểm.", "eng": "A man who laughs in the face of danger."}, {"viet": "Một tháng đã trôi qua mà công việc không tiến triển.", "eng": "A month has passed and the work has not advanced."}, {"viet": "Một tác phẩm mới về thi ca thời Elizabeth.", "eng": "A new work on Elizabethan poetry."}, {"viet": "Một tấm chăn chắp vá từ những mảnh vải vụn của quần áo cũ.", "eng": "A patchwork quilt made of snippings from old clothes."}, {"viet": "Một địa điểm thay đổi từ ngày đến đêm và từ đêm đến ngày, lặp đi lặp lại do cự quay tròn của Quả Đất.", "eng": "A place is moved from day into night and from night into day over and over by the spinning of the Earth."}, {"viet": "Một sự giả bộ quan tâm tới việc tố tụng.", "eng": "A pretended interest in the proceedings."}, {"viet": "Một đầu óc hài hước hơi thô tục.", "eng": "A rather robust sense of humour."}, {"viet": "Một căn phòng được trang hoàng bằng những băng dải giấy màu.", "eng": "A room festooned with paper streamers."}, {"viet": "Trong ngành cảnh sát, trung sĩ thì thấp hơn thanh tra.", "eng": "A sergeant in the police force is below an inspector."}, {"viet": "Thời tiết hơi dễ chịu hơn.", "eng": "A slight improvement in the weather."}, {"viet": "Một bài diễn văn đầy những lời công kích chính phủ.", "eng": "A speech full of thrusts at the government."}, {"viet": "Một sự cố bất ngờ của động cơ buộc phi công phải đáp khẩn cấp.", "eng": "A sudden engine failure forced to pilot to ditch."}, {"viet": "Một lớp bùn dày lắng đọng lại trên các cánh đồng khi nước lũ rút xuống.", "eng": "A thick deposit of mud lay on the fields when the flood went down."}, {"viet": "Một bài báo cáo rất sống động về một chuyến đi.", "eng": "A very descriptive account of a journey."}, {"viet": "Một sự phối hợp ma quái của lời nói xấu bóng gió và lời đồn.", "eng": "A witches brew of innuendo and rumour."}, {"viet": "Sự tìm ra chính xác chỗ hư điện.", "eng": "Accurate diagnosis of an electrical fault."}, {"viet": "Những người quảng cáo tranh giành lẫn nhau sự chú ý của quần chúng.", "eng": "Advertisers jostling with each other for the public's attention."}, {"viet": "Sau cái chết của vợ, ông ta sa sút hẳn.", "eng": "After his wife's death, he fell into a decline."}, {"viet": "Sau khi ngài Công tước mất, cậu con cả yêu cầu được thừa kế tước hiệu cha của anh ấy.", "eng": "After the Dukes death, his eldest son claimed the title."}, {"viet": "Anbani chấm dứt quyền lực của nhà vua sau chiến tranh.", "eng": "Albania lost its throne after the war."}, {"viet": "Được, vậy tôi sẽ nhờ gửi thư bảo đảm.", "eng": "All right, I'll have it registered, then."}, {"viet": "Tất cả điều này sẽ được Bộ Nội Vụ xử lý.", "eng": "All this will be processed by the Home Office machinery."}, {"viet": "Các nghĩa vụ dài hạn của Mỹ đã bị đình lại vô thời hạn kể từ đầu thập kỷ 1950.", "eng": "American long term obligations have been deep-frozen since the early 1950s."}, {"viet": "Một người ả-rập một lần nọ đổ đầy sữa tươi vào một túi nhỏ làm bằng dạ dày bê, và ông ta bắt đầu lên đường để thực hiện một chuyến đi dài băng qua sa mạc nóng cháy.", "eng": "An Arab once filled a pouch made from a calf's stomach which fresh milk and started on a long journey across a hot desert."}, {"viet": "Một cán bộ điều hành hầu như khó có thể giao tiếp.", "eng": "An executive who was virtually incommunicable."}, {"viet": "Một hòn đảo cách bờ biển Cornwall một khoảng.", "eng": "An island off the coast of Cornwall."}, {"viet": "Một lời nhận xét công khai khiếm nhã về đối thủ của cô ta.", "eng": "An ungracious public remark about her rival."}, {"viet": "Mà bạn chưa báo từ chối ư?", "eng": "And you haven't cancelled it yet?"}, {"viet": "Dù sao từ Ottawa đến Quảng Châu cũng là một chuyến đi dài.", "eng": "Anyway, it's a long trip from Ottawa to Guangzhou."}, {"viet": "Ở nước bạn có nhiều nhóm môi trường phải không?", "eng": "Are there many environmental groups in your country?"}, {"viet": "Có phải ông ở trong ngành kinh doanh khách sạn không?", "eng": "Are you in the hotel business?"}, {"viet": "Bị cảnh sát bắt vì sự thô tục rành rành.", "eng": "Arrested by the police for the gross indecency."}, {"viet": "Chúng tôi sẽ không tính tiền giao hàng khi mà anh đã trả tiền trước.", "eng": "As long as you've paid in advance, we won't charge you for delivery."}, {"viet": "Bị ngạt thở bởi khói và hơi độc.", "eng": "Asphyxiated by the smoke and poisonous fumes."}, {"viet": "Ở vùng xích đạo ngày và đêm luôn luôn dài bằng nhau.", "eng": "At the equator day and night are always the same length."}, {"viet": "Vi khuẩn được phóng đại 1.000 lần lớn hơn kích thước thật của chúng.", "eng": "Bacteria magnified to 1,000 times their actual size."}, {"viet": "Có tài giao tiếp với mọi người.", "eng": "Be diplomatic in dealing with people."}, {"viet": "Sắc đẹp đôi khi là một loại bùa mạnh nhất.", "eng": "Beauty is sometimes a most powerful talisman."}, {"viet": "Ngoài ra, ổ khoá va-li của tôi bị hỏng rồi.", "eng": "Besides, the lock of my suitcase is broken."}, {"viet": "Hãy mua vé trước nếu bạn muốn chắc chắn có một chỗ ngồi.", "eng": "Book early if you want to be sure of a seat."}, {"viet": "Anh gia nhập thị trường chung châu Âu vào năm 1973.", "eng": "Britain went into Europe in 1973."}, {"viet": "Nhưng tôi không biết ngày mấy?", "eng": "But I don't know what the date is?"}, {"viet": "Nhưng thú thật, tiếng Anh của tôi rất tệ.", "eng": "But to tell the truth, my English is very poor."}, {"viet": "Nhờ ơn Chúa họ đã được cứu mạng.", "eng": "By the grace of God their lives were spared."}, {"viet": "Tôi có thể trở lại vấn đề đó với bạn sau được không?", "eng": "Can I come back to you on that one later?"}, {"viet": "Chúng ta có thể lên đến tầng thượng không?", "eng": "Can we go to the top floor?"}, {"viet": "Anh có thể hiểu nổi bài thơ này không?", "eng": "Can you make sense of this poem?"}, {"viet": "Anh có thể đoán được những chữ nguệch ngoạc này có nghĩa là gì không?", "eng": "Can you work out what these squiggles mean?"}, {"viet": "Chắc chắn được, chúng tôi có dịch vụ cấp tốc.", "eng": "Certainly, we have an express service."}, {"viet": "Bọn trẻ mà cha phải chăm sóc đã tục huyền.", "eng": "Children whose custodial parent has remarried."}, {"viet": "Những cơn gió dọc theo bờ biển làm mạnh thêm trận bão.", "eng": "Coastwise winds contributed to the storm."}, {"viet": "So với giá cả các công ty khác chào, giá cả của chúng tôi rất thuận lợi.", "eng": "Compared with those offered by other firms, ours are quite favorable."}, {"viet": "Chi phí của người tiêu thụ năm nay tăng 170 triệu.", "eng": "Consumer spending rose this year by 170 million."}, {"viet": "Chị có thể cho tôi biết ý kiến trung thực của chị về quyển sách được không?", "eng": "Could you give me your honest opinion of the book?"}, {"viet": "Nghển cổ của ai để nhìn thấy cái gì.", "eng": "Crane one's neck to see something."}, {"viet": "Khiêu vũ ở đường phố thì khá bôi bác đối với một giám đốc ngân hàng!", "eng": "Dancing in the street is rather infra dig for a bank manager!"}, {"viet": "Phủ nhận việc sống ẩn dật của anh ta ít nhiều là kiểu sống có dụng ý của diễn viên điện ảnh.", "eng": "Deny that his reclusiveness is some sort of deliberate star trip."}, {"viet": "Nàng có nói với anh điều gì thú vị không?", "eng": "Did she tell you anything interesting?"}, {"viet": "Hè này anh không định đến Tây Ban Nha sao?", "eng": "Didn't you have some thought of going to Spain this summer?"}, {"viet": "Liệu tôi có phát hiện ra một chút ganh tị trong lời nhận xét đó không nhỉ?", "eng": "Do I detect a touch of jaundice in that remark?"}, {"viet": "Anh có dự đoán sẽ gặp chuyện gì rắc rối không?", "eng": "Do you anticipate meeting any trouble?"}, {"viet": "Khách sạn cô có sẵn phòng đơn không?", "eng": "Do you have a single room available?"}, {"viet": "Không biết là anh ta có gia đình hay chưa?", "eng": "Do you know if he's married?"}, {"viet": "Bạn thích quần áo bình thường hay quần áo đẹp hơn?", "eng": "Do you prefer casual clothes or dressy clothes?"}, {"viet": "Bạn nghĩ chúng ta có thể để nó trên kệ ở đằng kia không?", "eng": "Do you think we can put it on the shelf over there?"}, {"viet": "Cô ta tối nào cũng phải ở nhà sao?", "eng": "Does she have to stay at home every night?"}, {"viet": "Đừng có ủy mị như vậy!", "eng": "Don't be such a namby-pamby!"}, {"viet": "Đừng có chống lại cha mẹ con.", "eng": "Don't go against your parents."}, {"viet": "Đừng trích dẫn những lời nói của tôi bên ngoài ngữ cảnh.", "eng": "Don't quote my words out of context."}, {"viet": "Đừng đánh thức cô ta dậy-cô ta đang ngủ say.", "eng": "Don't wake her up-she's sound asleep."}, {"viet": "Mở một xa lộ băng qua một rặng núi.", "eng": "Drive a new motorway across a mountain range."}, {"viet": "Kiếm được ở nơi nào đó vào khoảng 20.000 bảng Anh một năm.", "eng": "Earn somewhere in the region of £ 20,000 a year."}, {"viet": "Thưởng thức sức bồi dưỡng của không khí biển.", "eng": "Enjoy the regenerative powers of sea air."}, {"viet": "Mọi người cần phải có thời gian ngồi một mình, xếp đặt mọi chuyện theo thứ tự ưu tiên và trầm ngâm suy nghĩ.", "eng": "Every one should take time to be alone, to prioritize and meditate."}, {"viet": "Xin lỗi, tôi không thể đi qua được.", "eng": "Excuse me, I can't get by."}, {"viet": "Những nhà máy ở thượng nguồn trên chúng ta làm ô nhiễm dòng nước.", "eng": "Factories upstream from us are polluting the water."}, {"viet": "Cảm thấy rét run trong bầu không khí ẩm thấp.", "eng": "Feel shivery in the damp atmosphere."}, {"viet": "Những người lính cứu hoả phải làm việc trong những điều kiện hết sức khó khăn.", "eng": "Firemen having to operate in a difficult conditions."}, {"viet": "Bay thẳng từ New York tới Pari.", "eng": "Fly non-stop from New York to Paris."}, {"viet": "Để có cuộc sống phải có không khí và nước.", "eng": "For there to be life there must be air and water."}, {"viet": "Từ Los Angeles tới Wisconsin sẽ mất độ 3 ngày.", "eng": "From Los Angeles to Wisconsin it will take about three days."}, {"viet": "George Bernard Shaw được nhiều người biết với họ tên viết tắt là GBS.", "eng": "George Bernard Shaw was well-known by his initials GBS."}, {"viet": "Hãy gọi điện cho tôi khi anh về tới nhà.", "eng": "Give me a tinkle when you get home."}, {"viet": "Chè chén linh đình say sưa suốt ba ngày.", "eng": "Go on a drunken bender for three days."}, {"viet": "Nghiền hạt nhục đậu khấu rắc vào món đồ trộn.", "eng": "Grate the nutmeg into the mixture."}, {"viet": "Làm việc chăm chỉ là cần thiết cho thành công.", "eng": "Hard work is fundamental to success."}, {"viet": "Anh đã nhận được bản thông báo các chi tiết của cuộc hội nghị chưa?", "eng": "Have you been circulated with details of the conference?"}, {"viet": "Ông có gì cần khai báo không, thưa ông?", "eng": "Have you got anything to declare, sir?"}, {"viet": "Phải nhận món tiền này là một đòn giáng vào lòng tự trọng của cô ta.", "eng": "Having to accept the money was a blow to her pride."}, {"viet": "Ông ta luôn kêu ca ốm đau này nọ.", "eng": "He's always complaining of some ailment or other."}, {"viet": "Anh ta có thái độ khinh thị mọi người từ Mỹ đến.", "eng": "He's disdainful of anyone from America."}, {"viet": "Anh ấy lấy cô ta, cô ấy lại yêu anh rể của anh ta, và... ồ... rắc rối lắm không giải thích được!", "eng": "He's married to her, and she's in love with his brother-in-law, and... oh, it's too complicated to explain!"}, {"viet": "Nó là kẻ gây rối chủ chốt, những đứa khác chỉ là theo sự dẫn dắt của nó thôi.", "eng": "He's the chief trouble-maker, the others just follow his lead."}, {"viet": "Ông ta luôn ân cần hỏi han về sức khỏe của anh.", "eng": "He always enquires most solicitously about your health."}, {"viet": "Chàng đã xin lỗi nàng về sự khiếm nhã của mình.", "eng": "He begged her to pardon him for his rudeness."}, {"viet": "Ông ta thế mà còn nghĩ thêm ra nhiều chuyện nữa.", "eng": "He came up with still more stories."}, {"viet": "Ông ấy phàn nàn với người bồi bàn rằng bữa ăn của mình đã nguội lạnh.", "eng": "He complained to the waiter that his meal was cold."}, {"viet": "Nó cứ khoái chọc ghẹo cô em của mình.", "eng": "He delights in teasing his younger sister."}, {"viet": "Ông ta chẳng đếm xỉa gì tới bất cứ người nào khác.", "eng": "He doesn't give a shit about anybody else."}, {"viet": "Ông ấy mong được con gái mình phục dịch cho ông cả ngày.", "eng": "He expects his daughter to fetch and carry for him all day."}, {"viet": "Anh ta tự hào rằng mình nói giỏi tiếng Pháp.", "eng": "He flatters himself that he speaks French well."}, {"viet": "Anh ấy sống được với số tiền rất ít ỏi.", "eng": "He gets on by very little money."}, {"viet": "Anh ta đã được hướng nghiệp thành một công chức tương lai.", "eng": "He had been groomed as a future servant."}, {"viet": "Ông ta có nhiều thì giờ rảnh-phần lớn thì giờ ông ta ở ngoài vườn.", "eng": "He has a lot of free time-he spends most of it in the garden."}, {"viet": "Ông ấy để lại lời nhắn cho ông Smith.", "eng": "He has left a message to Mr. Smith."}, {"viet": "Anh ấy không biết cách quản lí nhân sự.", "eng": "He have no idea how to manage people."}, {"viet": "Ông ta may mắn có sức khỏe tốt.", "eng": "He is blessed with excellent health."}, {"viet": "Anh ấy là người lớn hơn trong hai người anh của tôi.", "eng": "He is the elder of my two brothers."}, {"viet": "Ngay từ đầu anh ta đã biết rằng ý kiến đó là vô vọng.", "eng": "He knew from the start the idea was hopeless."}, {"viet": "Ông ấy sẽ trả lời tất cả các câu hỏi của ông.", "eng": "He'll answer all your questions."}, {"viet": "Anh ta khẳng định rằng anh ta đã bị cướp.", "eng": "He made out that he had been robbed."}, {"viet": "Hắn không bao giờ làm mảy may công việc gì cả.", "eng": "He never does a stroke of work."}, {"viet": "Hắn cứ làm phiền hà mặc cho những nỗ lực của chúng tôi gạt hắn ra.", "eng": "He persisted in obtruding himself despite our efforts to get rid of him."}, {"viet": "Anh ta đã quỳ gối cầu hôn, làm như thế thật là quá cải lương.", "eng": "He proposed on his knees, making a real production of it."}, {"viet": "Ông ta ngâm bài thơ đầy diễn cảm.", "eng": "He reads his poems very expressively."}, {"viet": "Nó đã đáp lại cú vô lê của tôi bằng một cú rờ ve.", "eng": "He responded to my volley with a back-hand."}, {"viet": "Hắn là một cầu thủ rất thất thường.", "eng": "He's a very temperamental player."}, {"viet": "Anh ta về nhà rồi phải không?", "eng": "He's gone home, hasn't he?"}, {"viet": "Hôm nay anh ta không tỉnh táo lắm.", "eng": "He's not very with it today."}, {"viet": "Anh ta nói anh ta sẽ trả tiền tôi, tôi đã là một thằng ngu đi tin anh ta.", "eng": "He said he would return the money, and I was fool enough."}, {"viet": "Hắn dường như biết làm điều gì đó theo trực giác.", "eng": "He seemed to know intuitively how to do it."}, {"viet": "Ông ấy tỏ ra có sức chịu đựng phi thường trong suốt thời gian bị bệnh.", "eng": "He showed remarkable endurance throughout his illness."}, {"viet": "Anh ta tiêu quá nhiều tiền về áo quần.", "eng": "He spent too much money on clothes."}, {"viet": "Trong bài diễn văn, anh ấy dừng lại ba lần vì tiếng vỗ tay tán thưởng.", "eng": "He stopped for applause three times during his speech."}, {"viet": "Anh ta nói những chuyện của mình khi là tù binh chiến tranh một cách rất thực tế.", "eng": "He talked about his experiences as a prisoner of war in a very matter of fact way."}, {"viet": "Anh ấy thình lình rẽ sang trái.", "eng": "He took a sudden turn to the left."}, {"viet": "Ông ta đã cố gắng giảm bớt sự căng thẳng của tình hình.", "eng": "He tried to take the heat out of the situation."}, {"viet": "Anh ấy đưa cô ta ra xe của cô ta.", "eng": "He walked her to her car."}, {"viet": "Anh ấy được phép tiếp tục học để lấy bằng cao học.", "eng": "He was allowed to proceed to an MA."}, {"viet": "Anh ta thất vọng vì sách của anh ta bán chậm.", "eng": "He was chagrined at the poor sales of his book."}, {"viet": "Ông ta được miễn trách hoàn toàn về tai nạn đó.", "eng": "He was exonerated from all responsibility for the accident."}, {"viet": "Ông ta đã được phong tước hầu trong danh sách khen thưởng vừa qua về những công tác phục vụ trong ngành công nghiệp.", "eng": "He was knighted in the last Honours List for services to industry."}, {"viet": "Ông ta đã bị cho nghỉ hưu và được thay thế bằng một người trẻ hơn.", "eng": "He was pensioned off and replaced with a younger man."}, {"viet": "Ta ngồi ườn ra trong chiếc ghế bành trước máy truyền hình.", "eng": "He was sprawling in an armchair in front of the TV."}, {"viet": "Ông ta rất can đảm trong ca mổ.", "eng": "He was very brave about his operation."}, {"viet": "Anh ta thì thầm anh ta có thể đổi tiền ở chợ đen.", "eng": "He whispered that he could change money on the black market."}, {"viet": "Anh ta sẽ phản bội niềm tin của họ nếu anh ta phớt lờ nguyện vọng của họ lúc này.", "eng": "He would betray their trust if he ignored their wishes now."}, {"viet": "Những máy bay lên thẳng thả đồ tiếp tế xuống cho những dân làng đang bị kẹt.", "eng": "Helicopters dropped supplies for the stranded villages."}, {"viet": "Độ của cô ấy nói lên sự đau khổ đã được chịu đựng một cách dũng cảm.", "eng": "Her behaviour speaks of suffering bravely borne."}, {"viet": "Cái chết của cô ta gây cho chúng tôi cú sốc ghê gớm.", "eng": "Her death dealt us a terrible blow."}, {"viet": "Bố cô ấy là một lão già bẳn tính.", "eng": "Her father is a cantankerous old devil."}, {"viet": "Con ngựa của bà ta về tới đích đầu tiên.", "eng": "Her horse was first past the winning-post."}, {"viet": "Danh sách những thành tựu nghệ thuật của cô ấy đáng gây ấn tượng.", "eng": "Her list of artistic attainments was impressive."}, {"viet": "Những lỗi lầm của bản thân cô ta đã làm cho cô ta dễ tha thứ cho người khác.", "eng": "Her own mistakes make her very tolerant of others."}, {"viet": "Công việc nghiên cứu của cô ấy là xoáy vào ảnh hưởng về mặt xã hội của nạn thất nghiệp.", "eng": "Her research is centred on the social effects of unemployment."}, {"viet": "Người giám sát của cô ấy hết sức khen ngợi cô ấy.", "eng": "Her supervisor gave her a glowing reference."}, {"viet": "Tiền giấy và ngân phiếu du lịch của tôi đây.", "eng": "Here are my notes and traveler's cheques."}, {"viet": "Sự miêu tả của anh ấy về vụ tai nạn khớp với những lời kể khác.", "eng": "His account of the accident jibes pretty well with other accounts."}, {"viet": "Cách ứng xử của cậu ấy chưa thật người lớn.", "eng": "His behaviour is not particularly adult."}, {"viet": "Sự quan tâm của ông ta đối với người nghèo chỉ là trò giả vờ.", "eng": "His concern for the poor is only a pose."}, {"viet": "Tiểu luận của anh ta là một mớ hỗn độn các ý kiến của những người khác.", "eng": "His essay was a hotchpotch of other people's ideas."}, {"viet": "Bài diễn văn đầu tiên trong cương vị tổng thống của ông ta đã tạo một ấn tượng sâu đậm cho cử toạ.", "eng": "His first speech as president made a strong impression on his audience."}, {"viet": "Cách cư xử khiếm nhã của nó ở bàn ăn đã làm nhiều người khó chịu.", "eng": "His ignorant behaviour at the dinner table caused much embarrassment."}, {"viet": "Bài nói chuyện dài dòng của hắn chỉ toàn là những chuyện khoác lác.", "eng": "His long speech was nothing but gas and hot air."}, {"viet": "Việc loại bỏ anh ta ra khỏi đội làm mọi người khá ngạc nhiên.", "eng": "His omission from the team is rather surprising."}, {"viet": "Việc được đề bạt đã đưa ông ta lên cao nhiều bậc trên thang quản lý.", "eng": "His promotion has moved him up several rungs on the management ladder."}, {"viet": "Những thói trưởng giả rởm của ông ta làm cho ông ta trông lố bịch.", "eng": "His social pretensions make him appear ridiculous."}, {"viet": "Cái lưỡi của hắn thật độc địa.", "eng": "His tongue has a nasty sting."}, {"viet": "Sau khi ông ta chết, tác phẩm của ông ta đã làm bị chìm vào quên lãng.", "eng": "His work sank into oblivion after his death."}, {"viet": "Những danh giá đổ dồn cho vị anh hùng.", "eng": "Honours were showered upon the hero."}, {"viet": "Anh có bao nhiêu tiền mặt?", "eng": "How are you off for cash?"}, {"viet": "Tên tù cư xử như thế nào?", "eng": "How did the prisoner conduct himself?"}, {"viet": "Máy bay Concorde gây ấn tượng với anh như thế nào, Stuart?", "eng": "How does the Concorde impress you, Stuart?"}, {"viet": "Chuẩn bị máy chiếu thì mất bao lâu?", "eng": "How long will it take to set up the projector?"}, {"viet": "Bạn có thể hít đất bao nhiêu cái?", "eng": "How many push-ups can you do?"}, {"viet": "Một tháng bạn chi bao nhiêu tiền cho quần áo?", "eng": "How much money do you spend on clothes a month?"}, {"viet": "Tuy nhiên, ngày nay nó là một công viên.", "eng": "However, today it is a public park."}, {"viet": "Tôi nằm ngửa nhìn những áng mây trôi.", "eng": "I'd lie on my back and look at the clouds passing by."}, {"viet": "Tôi không bao giờ ngờ ông ta xử sự như vậy, ông ta thật là một con người hai mặt.", "eng": "I'd never have expected him to behave like that, he's a real Jekyll and Hyde."}, {"viet": "Tôi sẽ nổi khùng mất nếu cái đó không ngừng sớm.", "eng": "I'll go up the wall if it doesn't stop soon."}, {"viet": "Để tôi tóm được nó đã, tôi sẽ cho nó một trận ngay cho mà xem!", "eng": "I'll soon sort him out, just let me get my hands on him!"}, {"viet": "Tôi e rằng chúng ta phải bỏ qua chiếc xe hơi mới này, chúng ta không thể mua nó nổi.", "eng": "I'm afraid the new car will have to go by the board-we can't afford it."}, {"viet": "Tôi đi chơi đây, anh có đi với tôi không?", "eng": "I'm going out, are you coming with me?"}, {"viet": "Tôi rất vui lòng đưa cô đến đó bằng xe ôtô của tôi.", "eng": "I'm more than happy to take you there in my car."}, {"viet": "Tôi cũng khá cứng cáp đấy chứ, phải vào cơn cúm mới đánh ngã tôi được.", "eng": "I'm pretty indestructible, it takes more than about of flu to lay me low."}, {"viet": "Tôi hãy còn là một học viên, vì vậy đừng hy vọng sự hoàn hảo.", "eng": "I'm still only a learner, so don't expect perfection!"}, {"viet": "Tôi rất lo lắng về bệnh tật của mẹ tôi.", "eng": "I'm very concerned about my mother's illness."}, {"viet": "Tôi đã bị dồn cho trách nhiệm tổ chức hội nghị.", "eng": "I've been saddled with the job of organizing the conference."}, {"viet": "Tôi bị cảm nặng nên mũi họng đầy đờm nhớt.", "eng": "I've had a bad cold and I'm full of catarrh."}, {"viet": "Tôi chỉ gẫy một cánh tay thôi, các bệnh nhân khác còn nặng hơn tôi nhiều.", "eng": "I've only broken my arm, other patients are far worse off than me."}, {"viet": "Tôi xin báo cho anh biết tình hình thị trường.", "eng": "I advise you of the state of the market."}, {"viet": "Tôi sắp trả phòng, làm ơn cử người khuân vác hành lý cho tôi.", "eng": "I am going to check-out, please send a porter for my luggage."}, {"viet": "Tôi thông cảm với vấn đề của bạn nhưng tôi không nghĩ rằng có thể giúp được gì.", "eng": "I appreciate your problem, but I don't think I can help you."}, {"viet": "Tôi dám cá với bạn là tối nay họ sẽ có một trận đấu nữa với tỉ số rất sít sao đấy.", "eng": "I bet they'll have another close match tonight."}, {"viet": "Tôi không thể làm được việc đó'Không sao, tôi sẽ tự mình làm lấy'.", "eng": "I can't do it''No matter, I'll do it myself'."}, {"viet": "Lúc này tôi không thể nào dành thời gian để đi nghỉ.", "eng": "I can't spare the time for a holiday at the moment."}, {"viet": "Tôi chỉ có thể chịu đựng cô ta một thời gian ngắn.", "eng": "I can only stand her only in small doses."}, {"viet": "Nói thật là anh chưa nghe thấy.", "eng": "I can't say that I have."}, {"viet": "Tôi không nắm được thầy giáo nói gì.", "eng": "I could not grasp what the teacher said."}, {"viet": "Bây giờ tôi muốn làm thủ tục trả phòng.", "eng": "I'd like to check out now."}, {"viet": "Tôi không định làm giáo viên-hình như hoàn cảnh đưa đẩy tôi vào nghề ấy.", "eng": "I didn't mean to be a teacher-I sort of drifted into it."}, {"viet": "Tôi không uống rượu dưới bất cứ hình thức nào.", "eng": "I don't drink alcohol in any shape or form."}, {"viet": "Tôi không thích người ta gọi điện vào giờ này-rất là khó chịu.", "eng": "I don't like people phoning at this hours-it's antisocial."}, {"viet": "Tôi không hiểu được anh nói gì, thí dụ vì anh nói nhanh quá.", "eng": "I don't understand what You're saying."}, {"viet": "Tôi không biết mình phải quan hệ với cô ta ra sao.", "eng": "I don't know how I stand with her."}, {"viet": "Tôi thích cuốn tiểu thuyết đầu tay của ông ta nhất.", "eng": "I enjoyed his first novel best of all."}, {"viet": "Tôi cảm thấy cá rỉa ở đầu dây.", "eng": "I felt a nibbler on the end of my line."}, {"viet": "Tôi thấy hắn đang tỉa các cây hồng.", "eng": "I found him pruning his roses."}, {"viet": "Tôi có được mọi thứ tôi cần ở chợ.", "eng": "I got everything I needed in the market."}, {"viet": "Tối đã linh cảm rằng chúng ta sẽ tìm thấy chúng ở đó.", "eng": "I had an intuition that we would find them there."}, {"viet": "Tôi ghét phải bị sống cách biệt ở vùng thôn quê.", "eng": "I hate being shut away in the country."}, {"viet": "Tôi đã làm thủng các khuỷu tay áo len của tôi.", "eng": "I have gone through the elbows of my sweater."}, {"viet": "Tôi có một ít thuốc điếu, chỉ để cho tôi dùng thôi.", "eng": "I have some cigarettes, just for my own use."}, {"viet": "Tôi không tin nhiều vào thuốc này.", "eng": "I haven't much faith in this medicine."}, {"viet": "Tôi nghe nói khúc côn cầu trên băng là môn thể thao được ưa chuộng nhất ở nước bạn.", "eng": "I heard that ice hockey is the most popular sport in your country."}, {"viet": "Tôi hy vọng anh hiểu những gì tôi đang nói.", "eng": "I hope you're taking in what I'm saying."}, {"viet": "Tôi giữ lại một vài quyển sách và cho anh ta những cuốn còn lại.", "eng": "I kept a few books and gave him the rest."}, {"viet": "Tôi ghê tởm rời khỏi phòng ( trước cuộc nói chuyện của họ ).", "eng": "I left the room in disgust ( at their conversation )."}, {"viet": "Tôi sẽ thu xếp một bàn cho ông.", "eng": "I'll arrange one for you."}, {"viet": "Tôi sẽ thay nó trước thứ bảy.", "eng": "I'll have it ready by Saturday."}, {"viet": "Hôm nay tôi đã tìm một chiếc xe hơi mới, nhưng chiếc xe nào cũng đắt tiền quá.", "eng": "I looked for a new car today, but everything was too expensive."}, {"viet": "Tôi lấy làm vui mừng về việc anh đỗ kỳ sát hạch.", "eng": "I'm glad about your passing the test."}, {"viet": "Tôi không hiểu rõ lắm về đạo Lạt Ma.", "eng": "I'm not quite clear about Lamaism."}, {"viet": "Con cũng thấy buồn khi nó kết thúc nữa.", "eng": "I'm unhappy when it's finished, too."}, {"viet": "Tôi phải trả lời cú điện thoại đó, nhưng tôi sẽ trở lại ngay.", "eng": "I must answer that phone, but I'll be right back."}, {"viet": "Tôi cần một ít thuốc tiêu để chữa chứng đầy bụng của tôi.", "eng": "I need an antacid to cure my indigestion."}, {"viet": "Tôi đề nghị đưa ngân phiếu cho anh ấy, nhưng anh ấy đòi tiền mặt.", "eng": "I offered to give him a cheque, but he demanded hard cash."}, {"viet": "Tôi thích ngồi đối diện với đầu máy hơn.", "eng": "I prefer to sit facing the engine."}, {"viet": "Tôi thật sự rất vui khi ở đó.", "eng": "I really had a very pleasant time there."}, {"viet": "Tôi phẫn uất vì bị buộc tội là không có khả năng.", "eng": "I resent the charges of incompetence made against me."}, {"viet": "Tôi thấy khó hi vọng tình trạng sức khoẻ của ông ta sẽ khá hơn chút nào.", "eng": "I see little prospect of an improvement in condition."}, {"viet": "Tôi cần phải điều tra cẩn thận về công ty đó trước khi anh ký bất cứ cái gì nào.", "eng": "I should make a few discreet enquiries about the firm before you sign anything."}, {"viet": "Tôi hết sức căm giận những lời phỉ báng vu vơ.", "eng": "I strongly resent such unwarranted aspersions."}, {"viet": "Tôi cho là anh ta đang tránh mặt tôi.", "eng": "I think he's avoiding me."}, {"viet": "Tôi nghĩ đó là kiểu mà nhiều người Mỹ có.", "eng": "I think that's the way many Americans are."}, {"viet": "Tôi đã nghĩ rằng trời sẽ mưa, nhưng mây đen đã tan và trời đang rất đẹp.", "eng": "I thought it would rain, but the clouds have vanished and it's a fine day."}, {"viet": "Tôi định ngăn anh ta, nhưng anh ta lấy khuỷu tay hất tôi ra.", "eng": "I tried to stop him, but he elbowed me out of the way."}, {"viet": "Tôi đã để quên cái ví của tôi ở nhà.", "eng": "I've left my purse at home."}, {"viet": "Tôi muốn đi với bạn, nhưng lịch làm việc của tôi không rảnh ít nhất một tuần nữa.", "eng": "I want to go with you, but my schedule isn't free for at least another week."}, {"viet": "Tôi tức cô ấy vì đã đánh mất cuốn sách của tôi.", "eng": "I was angry with her for losing my book."}, {"viet": "Tôi xúc động về cách bà ta xử lý vụ này.", "eng": "I was impressed by her handling of the affair."}, {"viet": "Tôi quá mải mê với công việc đến nỗi quên cả thời gian.", "eng": "I was so intent on my work that I didn't notice the time."}, {"viet": "Tôi xem video vào buổi tối.", "eng": "I watch videos in the evening."}, {"viet": "Tôi ước mong được là người tự do, nhưng bản hợp đồng còn ràng buộc tôi thêm ba năm nữa.", "eng": "I wish I were a free agent, but my contract binds me for three more years."}, {"viet": "Tôi không biết là tối mai ông có dự định gì không.", "eng": "I wonder if you have made any plans tomorrow evening."}, {"viet": "Tôi muốn đổi 1 tờ 100 đô la.", "eng": "I would like to break a $ 100 bill."}, {"viet": "Tôi không muốn để cái bàn ấy trong nhà đâu.", "eng": "I wouldn't give that table house-room."}, {"viet": "Nếu hàng năm có nhiều ngày ngắn hơn thời gian để trái đất quay quanh mặt trời, lễ Giáng sinh có thể đến vào giữa mùa hè.", "eng": "If every year of ours were several days shorter than time it takes the earth to go around the sun, Christmas would soon come in the middle of the summer."}, {"viet": "Nếu không có ở trên bàn vậy thì nó ở trong ngăn kéo.", "eng": "If it's not on the table then it will be in the drawer."}, {"viet": "Nếu có viết và giấy ở ngay bên cạnh, tôi sẽ viết bản kê các món hàng đi mua.", "eng": "If there's a pen and paper handy, I'll make a shopping list."}, {"viet": "Nếu anh viết thư cho mẹ anh, đừng quên thêm vào việc mời bà đến ở chơi nhé.", "eng": "If you're writing to your mother, don't forget to put in something about her coming to stay."}, {"viet": "Nếu cậu không chơi, cậu sẽ không được rèn luyện.", "eng": "If you don't play, you'll get out of practice."}, {"viet": "Nếu con chơi trò chơi điện tử tới khuya thì đó là điều xảy ra với con thôi.", "eng": "If you play video games until late at night, that's what's going to happen."}, {"viet": "Nếu bố cậu tìm thấy cậu ở đây, ông ấy sẽ mắng cậu thực đấy!", "eng": "If your father finds you here you'll really catch it!"}, {"viet": "Dự phòng thời tiết xấu, họ đem nhiều đồ ấm.", "eng": "In anticipation of bad weather, they took plenty of warm clothes."}, {"viet": "Trong diễn văn, bà bộ trưởng phản đối mọi thay đổi trong pháp luật hiện hành.", "eng": "In her speech, the Minister came out against any change to the existing law."}, {"viet": "Tuy nhiên, ở những vùng đất hoang mạc gồ ghề, lạc đà vẫn còn là phương tiện chuyên chở tốt nhất.", "eng": "In rough desert country, however, camels are still the best means of transportation."}, {"viet": "Ở trong phòng lớn, hai người đàn ông tiến đến nói chuyện với anh ấy.", "eng": "In the hall he was accosted by two men."}, {"viet": "Nổi cơn điên giận, hết sức mừng rỡ, khiếp sợ cuống cuồng, v. v.", "eng": "In transports of rage, delight, terror, etc."}, {"viet": "Ngừng một vở ôpêra trên ti-vi để xen vào một chương trình quảng cáo thức ăn cho chó mèo kiểng thì thật là đi từ cái cao siêu đến cái lố bịch.", "eng": "Interrupting an opera on television for a pet-food commercial is going from the sublime to the ridiculous."}, {"viet": "Con bé đủ lớn để tự mặc lấy quần áo được chưa?", "eng": "Is she old enough to dress herself yet?"}, {"viet": "Ở Úc có sự bình đẳng hơn ở Anh không?", "eng": "Is there more democracy in Australia than in Britain?"}, {"viet": "Cách ông ta hành hạ con cái như thế thật là vô đạo đức.", "eng": "It's a crime the way he bullies his children."}, {"viet": "Ở tuổi anh khóc vì một cái răng rụng thì thật là trẻ con!", "eng": "It's babyish to cry about having a tooth out at your age!"}, {"viet": "Đây sẽ là buổi biểu diễn chia tay của ông ấy.", "eng": "It's going to be his farewell performance."}, {"viet": "Vào mùa hè thời tiết rất mát mẻ, nhưng vào mùa đông thì rất lạnh.", "eng": "It's nice and cool in summer, but it's very cold in winter."}, {"viet": "Trời mưa như trút, nên tôi sợ là chuyến đi cắm trại của chúng ta sẽ đi tong.", "eng": "It's pouring with rain, so I'm afraid our picnic's gone for a burton."}, {"viet": "Đã đến lúc anh dàn xếp mối bất hoà giữa anh và nó.", "eng": "It's time you settled your dispute with him."}, {"viet": "Nếu anh mua đồ với khối lượng lớn thì sẽ rẻ hơn.", "eng": "It comes cheaper if you buy things in bulk."}, {"viet": "Nguyên tắc của tôi là giúp đỡ người khác khi có thể.", "eng": "It is a principle of mine to help people when I can."}, {"viet": "Tôi tin là nhiều người hơn đã có thể được giúp đỡ.", "eng": "It is my belief that more people could have been helped."}, {"viet": "Không phải lượt tôi, anh ta lí sự.", "eng": "It isn't my turn, he said argumentatively."}, {"viet": "Đây là bóng đèn 100 oát.", "eng": "It's a 100-watt bulb."}, {"viet": "Rất vui khi nghe được tin bạn!", "eng": "It's so nice to hear your voice!"}, {"viet": "Tôi chợt nghĩ ra chúng ta có thể cải thiện tình hình như thế nào.", "eng": "It suddenly struck me how we could improve the situation."}, {"viet": "Đó là một trận đấu rất chênh lệch: đội chúng tôi đã thắng dễ dàng.", "eng": "It was a very one-sided game: our team won easily."}, {"viet": "Với lòng hối tiếc hơn là tức giận mà anh ta đã chỉ trích bạn đồng nghiệp trước đây của mình.", "eng": "It was more in sorrow than in anger that he criticized his former colleague."}, {"viet": "Thật rất không may ( cho anh ) là bị ốm khi nghỉ phép.", "eng": "It was very hard luck ( on you ) to get ill on your holiday."}, {"viet": "Sử dụng một kế toán sẽ có lợi cho bạn.", "eng": "It would pay ( you ) to use an accountant."}, {"viet": "John bị tai nạn, anh ta bị ô tô đâm.", "eng": "John's had an accident, he's been hit by a car."}, {"viet": "Đề nghị cúi về đàng trước một lát.", "eng": "Just lean forward for a moment, please."}, {"viet": "Năm ngoái luật đã được sửa đổi để cho phép có nhiều giải thưởng hơn.", "eng": "Last year the regulations were amended to allow other awards to be made."}, {"viet": "Để tôi dẫn bà đến phòng đó.", "eng": "Let me show you to the room."}, {"viet": "Los Angeles thì đẹp và thời tiết rất tuyệt.", "eng": "Los Angeles is beautiful and the weather is marvelous."}, {"viet": "Nhiều người phản đối việc thực nghiệm trên súc vật.", "eng": "Many people object to experimentation an animals."}, {"viet": "Mary không muốn đi và Peter cũng sẽ không đi.", "eng": "Mary won't go and Peter won't go either."}, {"viet": "Tôi có thể nói với anh ấy là ai đang gọi vậy?", "eng": "May I tell him who's calling?"}, {"viet": "Hầu hết trẻ em đều cảm thấy hơi lo lắng ngày đầu tới trường.", "eng": "Most children feel a bit apprehensive on their first day at school."}, {"viet": "Ông Smith, một trong những khách hàng quen của quán, đến quán rượu.", "eng": "Mr. Smith, one of the regular customers of the bar, comes to the bar."}, {"viet": "Anh tôi đã đính ước với Anne và họ sẽ cưới nhau vào năm tới.", "eng": "My brother is engaged to Anne and they will be married next year."}, {"viet": "Lần đến nhà hát đầu tiên của tôi đã làm thức dậy niềm thích thú không bao giờ hết.", "eng": "My first visit to a theatre awakened an interest which never left."}, {"viet": "Tôi tên là Trương Quan Thu ở công ty Bảo hiểm Vĩnh Thái.", "eng": "My name is Kwang-chiu Chang from the Wing Tai Insurance Company."}, {"viet": "Kế hoạch hè của tôi trùng khớp với Joyce.", "eng": "My vacation plans dovetail nicely with Joyce's."}, {"viet": "Nhưng bộ phim mới phát hành đắt hơn những bộ phim phát hành lâu rồi.", "eng": "New releases are more expensive than old releases."}, {"viet": "Không, nó là máy vi tính dùng được 2 năm rồi.", "eng": "No, it's a two-year-old one."}, {"viet": "Thảo nào bạn trông có dáng đẹp như vậy.", "eng": "No wonder you look so good."}, {"viet": "Giờ đây ta nhìn vấn đề ở một góc cạnh khác.", "eng": "Now we saw the matter in a different light."}, {"viet": "Ồ, tôi cho là cũng có một chỗ bán hàng phúc thiện nào đó của nhà thờ.", "eng": "Oh, I suppose there is an occasional church bazaar."}, {"viet": "Mấy thằng lớn xúm lại hiếp đáp bọn ít tuổi hơn.", "eng": "Older boys ganging up on younger ones."}, {"viet": "Với tôi thì một tách trà là đủ rồi.", "eng": "One cup of tea is enough for me."}, {"viet": "Tôi đã làm việc một năm ở Florida.", "eng": "One year I worked in Florida."}, {"viet": "Những nỗ lực của chúng ta phải nhằm đem lại hiệu quả lớn hơn nữa.", "eng": "Our efforts should be directed towards greater efficiency."}, {"viet": "Người hàng xóm của chúng tôi là một lão già xấu tính xấu nết.", "eng": "Our neighbour's a bad-tempered old so-and-so."}, {"viet": "Quân ta đã chiếm lại thành phố, nhưng đã phải trả một giá nặng nề.", "eng": "Our troops recaptured the city, but they paid a heavy price for it."}, {"viet": "Luồn sợi chỉ qua lỗ kim cuốn một sợi dây thừng quanh một cái cọc.", "eng": "Pass a thread through the eye of a needle pass a rope round a post."}, {"viet": "Những người đi khắp trong nước tìm việc làm.", "eng": "People travelling about the country in pursuit of work."}, {"viet": "Xin vui lòng mang chúng đến Công ty Thiên Nguyệt lúc 12 giờ nhé.", "eng": "Please send them to Tian Yuan Company at twelve o'clock."}, {"viet": "Tôi hoàn toàn không hay biết gì cả, cô ta đã đi trước và mua vé đi nghỉ.", "eng": "Quite unknown to me, she'd gone ahead and booked the holiday."}, {"viet": "Các nhà khoa học ở các nước khác nhau làm việc độc lập với nhau đã đạt tới những kết quả rất giống nhau.", "eng": "Scientists in different countries, working independently of each other have come up with very similar results."}, {"viet": "Mình gặp nhau vào Thứ Năm hay Thứ Sáu?", "eng": "Shall we meet on Thursday or Friday?"}, {"viet": "Cô ta luôn gây phiền toái cho mọi người.", "eng": "She's always causing trouble for people."}, {"viet": "Cô ấy khá may mắn có sức khoẻ tốt.", "eng": "She's fortunate enough to enjoy good health."}, {"viet": "Cô ta không giàu như người ta nói.", "eng": "She's not as rich as people make out."}, {"viet": "Cô ấy đã chấm dứt quan hệ với người tình mới của cô ấy rồi.", "eng": "She's through with her new boy-friend."}, {"viet": "Chị ấy luôn luôn bình tĩnh, trầm lặng và tự chủ trong cơn khủng hoảng.", "eng": "She always stays cool, calm and collected in a crisis."}, {"viet": "Chị ấy đi thoăn thoắt xuống lối ra vườn.", "eng": "She came tripping down the garden path."}, {"viet": "Cô ta không thể trả lời đúng đắn lấy một câu hỏi thôi.", "eng": "She couldn't answer a solitary question correctly."}, {"viet": "Cô ta không cần phải thuyết phục nhiều.", "eng": "She didn't take much persuading."}, {"viet": "Cô ấy quạt bằng tờ báo.", "eng": "She fanned herself with the newspaper."}, {"viet": "Bà ta trịnh trọng hứa sẽ tôn trọng quyết định của họ.", "eng": "She gave a solemn undertaking to respect their decision."}, {"viet": "Bà ta có khối quyền hành nhưng thích ở hậu trường.", "eng": "She had a lot of power, but likes to remain in background."}, {"viet": "Cô ta có tính nóng, song chẳng mấy chốc rồi anh sẽ đâm ra thích cô ta.", "eng": "She has a hot temper, but you will soon grow to like her."}, {"viet": "Chị ấy hoàn toàn có khả năng về công việc này.", "eng": "She has the perfect credentials for the job."}, {"viet": "Cô ta đẹp mà cô chị lại còn đẹp hơn.", "eng": "She is beautiful but her sister is more so."}, {"viet": "Cô ta trung thành với những ý kiến của bản thân và không gì có thể làm cho cô ta thay đổi.", "eng": "She is wedded to her opinions and nothing will change her."}, {"viet": "Bà ta nghe cái tin bi thảm đó, mặt tái nhợt đi.", "eng": "She listened to the tragic news ashen-faced."}, {"viet": "Cô ấy làm ra vẻ sắp đi nhưng anh ấy đã bảo cô ấy ở lại.", "eng": "She made to go but he told her to stay."}, {"viet": "Chỉ có cô ta là phải chịu trách nhiệm về những gì đã xảy ra, cô ấy để xảy ra thì cô ấy chịu.", "eng": "She only has herself to thank for what happened."}, {"viet": "Cô ta tuyên bố với chính mình đã hài lòng với những kết quả.", "eng": "She pronounced herself satisfied with the results."}, {"viet": "Cô ấy đáp lại nụ cười của anh bằng một cái nhìn lãnh đạm.", "eng": "She returned his smile with a frigid glance."}, {"viet": "Cô ấy có cảm giác bị ốm.", "eng": "She's had one of her turns."}, {"viet": "Cô ấy nói cô ấy sẽ bảo anh ta phải làm gì với công việc của mình nhưng đến cuối cùng cô ấy lại chẳng nói gì hết.", "eng": "She said she was going to tell him what he could do with his job, but in the end she just kept her mouth shut."}, {"viet": "Cô ta để thức ăn và đồ uống xuống bàn.", "eng": "She sets food and drink down on the table."}, {"viet": "Cô ta nói tiếng Pháp lưu loát và rất Pháp.", "eng": "She speaks fluent and idiomatic French."}, {"viet": "Cô ta nghi ngờ là những ảnh hưởng bí mật đang có tác động.", "eng": "She suspected that secret influences were at work."}, {"viet": "Cô ta xé tan tất cả các bức thư anh ấy đã gửi cho cô.", "eng": "She tore up all the letters he had sent her."}, {"viet": "Cô ấy muốn phần của mình chứ không có gì khác.", "eng": "She wanted her share but nothing beyond."}, {"viet": "Cô ấy được tặng một huân chương về lòng dũng cảm.", "eng": "She was awarded a medal for bravery."}, {"viet": "Cô ta đã bị xem là có tội hoàn toàn về mọi mặt.", "eng": "She was found on guilty on all counts."}, {"viet": "Cô ấy không bao giờ thích biểu diễn trước công chúng bởi vì cô ấy không muốn biến mình thành một kẻ ngớ ngẩn.", "eng": "She was never keen on performing in public because she was afraid of making a fool of herself."}, {"viet": "Cô ta rất dẻo mồm-cô ta đã có thể lừa bịp bất cứ ai.", "eng": "She was so plausible-she would have deceived anyone."}, {"viet": "Bà ta đội mũ tia-ra, đeo chuỗi hạt kim cương và một xuyến vàng, đủ mọi thứ!", "eng": "She was wearing a tiara, a diamond necklace and a gold bracelet-the works!"}, {"viet": "Cô ấy nháy mắt với tôi, nhưng không vui vẻ gì, một cái nháy mắt cảnh báo.", "eng": "She winked at me, but it was humorless, a wink of warning."}, {"viet": "Bà ta thà chết chứ không chịu tập chạy, bà ấy ghét tập thể dục.", "eng": "She wouldn't be seen dead jogging, she hates exercise."}, {"viet": "Tỏ ra khéo léo trong việc ngăn ngừa một cuộc đình công có nguy cơ xảy ra.", "eng": "Show finesse in averting a threatened strike."}, {"viet": "Từ khi bỏ rượu, cô ấy là một người phụ nữ khác.", "eng": "Since she stopped drinking, she's a changed woman."}, {"viet": "Giảm lực lượng lao động của nhà máy xuống.", "eng": "Slim down the factory's work-force."}, {"viet": "Những bông tuyết tan ra khi chạm mặt đất.", "eng": "Snowflakes melting as they reached the ground."}, {"viet": "Viết đoạn cuối bức thư đó cho bớt gay gắt.", "eng": "Softened the last paragraph of the letter."}, {"viet": "Sáng nay có thư từ gửi đến cho ông.", "eng": "Some mail came for you this morning."}, {"viet": "Một vài chính trị gia nổi tiếng về tài năng diễn thuyết.", "eng": "Some politicians are famous for their powers of oratory."}, {"viet": "Vật gì để mấp mé ở mép bàn.", "eng": "Something poised on the edge of the table."}, {"viet": "Nói chuyện riêng với từng người trong một nhóm.", "eng": "Speak to each member of a group individually."}, {"viet": "Bắt đầu có ý định viết một cuốn tiểu thuyết.", "eng": "Start with the intention of writing a novel."}, {"viet": "Đừng có chơi dại với con dao đó nữa nếu không có người bị thương bây giờ.", "eng": "Stop fooling about with that knife or someone will get hurt."}, {"viet": "Số lượng sinh viên giảm đáng kể do việc cắt giảm trợ cấp.", "eng": "Student numbers have been decimated by cuts in grants."}, {"viet": "Không biết bao nhiêu hình ảnh sống động đã tuôn ra.", "eng": "Such myriad and such vivid jets of images."}, {"viet": "Vâng, Hãy cho tôi biết nếu ông cần được giúp đỡ nhé.", "eng": "Sure, just let me know if you need help."}, {"viet": "Nhớ cẩn thận đừng uống rượu nhiều quá.", "eng": "Take care that not to drink too much."}, {"viet": "Thầy giáo sử dụng quyền lực đối với học trò.", "eng": "Teachers exercise authority over their pupils."}, {"viet": "Khủng bố là mối đe doạ toàn bộ thế giới.", "eng": "Terrorism is a threat to the whole world."}, {"viet": "Thật tệ quá, tôi e là như vậy!", "eng": "That's just too bad, I'm afraid!"}, {"viet": "Công ty đó cung cấp giấy cho nhà in.", "eng": "That company supplies papers to the printers."}, {"viet": "Cú chơi xấu đối với Smith sau cùng đó đã làm chúng tôi thua trận.", "eng": "That last foul on Smith lost us the match."}, {"viet": "Thật ra lời đồn đó không có cơ sở.", "eng": "That rumour is without foundation in fact."}, {"viet": "Chiếc xe hơi cũ đó giá như bèo.", "eng": "That used car is dirt-cheap."}, {"viet": "Tai nạn vừa xảy ra làm tắc nghẽn giao thông ở trung tâm thành phố.", "eng": "The accident blocked traffic in the town centre."}, {"viet": "Địa chỉ ghi ở góc trên bên phải của thư.", "eng": "The address is in the top right-hand corner of the letter."}, {"viet": "Hiến pháp Mỹ được hoạch định, hiến pháp Anh triển khai tự nhiên và từ từ.", "eng": "The American constitution was planned, the British constitution evolved."}, {"viet": "Sự bắt tù nhân vượt ngục.", "eng": "The apprehension of the escaped prisoners."}, {"viet": "Bài báo bộc lộ sự bi quan, nó ngụ ý rằng sẽ không có một sự cải thiện nào cả.", "eng": "The article struck a pessimistic note, it suggested there would be no improvement."}, {"viet": "Tác giả muốn được giấu tên.", "eng": "The author wished to remain anonymous."}, {"viet": "Số tiền dư 500 bảng Anh sẽ được thanh toán trong vòng một tuần.", "eng": "The balance of £ 500 will be paid within one week."}, {"viet": "Đơn vị cơ bản của nhân dân tệ là đồng và đơn vị phụ là hào và xu.", "eng": "The basic unit of RMB is Yuan and the subsidiary units are Jiao and fen."}, {"viet": "Những cầu thủ hay nhất đã bỏ sang các câu lạc bộ lớn, để lại cho chúng tôi những cầu thủ kém.", "eng": "The best players go off to the big clubs, leaving us the dross."}, {"viet": "Máu chảy qua các tĩnh mạch của anh ấy.", "eng": "The blood coursed through his veins."}, {"viet": "Cuốn sách này là một sự biện hộ xuất sắc cho các chính sách của chúng ta.", "eng": "The book is a brilliant defence of our policies."}, {"viet": "Hai võ sĩ quyền Anh ôm ghì nhau và trọng tài phải tách họ ra.", "eng": "The boxers clinched and the referee had to separate them."}, {"viet": "Cô dâu được cha dẫn tới chú rể.", "eng": "The bride was given away by her father."}, {"viet": "Than cháy đã bắt đầu bốc lên ngọn lửa vàng và da cam.", "eng": "The burning coals started to flame yellow and orange."}, {"viet": "Bản đồng ca đó có nốt hát khó.", "eng": "The cantata has a difficult vocal score."}, {"viet": "Xét tới độ tuổi của nó thì chiếc xe chạy vẫn còn tốt.", "eng": "The car runs well, considering its age."}, {"viet": "Những bức tường của tòa lâu đài rất dày.", "eng": "The castle walls were very thick."}, {"viet": "Tất cả ghế đều đặt sai vị trí.", "eng": "The chairs are all out of position."}, {"viet": "Đứa trẻ nắn nót viết tên của nó bằng chữ in hoa bên dưới bức hình của nó.", "eng": "The child carefully printed his name in capitals at the bottom of his picture."}, {"viet": "Tất cả trẻ con đều ngủ ở giường riêng.", "eng": "The children all sleep in separate beds."}, {"viet": "Các cậu bé bò ra khỏi hốc cây.", "eng": "The children scrambled out of the hollow tree."}, {"viet": "Tiếng phì phì và xành xạch của chiếc đầu máy dồn toa.", "eng": "The chuffing and snorting of switch engines."}, {"viet": "Người leo núi đục những bậc trên lớp băng.", "eng": "The climbers cut steps in the ice."}, {"viet": "Sự sút giảm đột ngột của giá cổ phần, đồng đôla, thị trường.", "eng": "The collapse of share prices, the dollar, the market."}, {"viet": "Những người bình thường.", "eng": "The common run of mankind, the run of mankind."}, {"viet": "Đoàn xe tải mới của công ty.", "eng": "The company's new fleet of vans."}, {"viet": "Sự áp bức liên tục đối với công nhân, đã dẫn tới sự xung đột và cách mạng không thể tránh được.", "eng": "The constant oppression of the workers led inevitably to strife and revolution."}, {"viet": "Cái áo sơ-mi bằng vải bông bị co và biến dạng.", "eng": "The cotton shirt has shrunk out of shape."}, {"viet": "Tòa đã xử bồi thường thiệt hại cho cô ta.", "eng": "The court adjudged legal damages to her."}, {"viet": "Xà ngang được ghép mộng vào cột dọc.", "eng": "The cross-piece is mortised into the upright post."}, {"viet": "Những tấm rèm bị một màn lửa bao phủ.", "eng": "The curtains were enveloped in a sheet of flame."}, {"viet": "Cái chết của cha Mary đã làm cho cô buồn phiền không gì an ủi được.", "eng": "The death of her father left Mary disconsolate."}, {"viet": "Rừng rậm nhiệt đới ở khu vực sông A-ma-zôn.", "eng": "The dense tropical forests of the Amazon basin."}, {"viet": "Vẻ trang nghiêm của dịp trọng đại đó bị mất đi khi bà ta ngã xuống bậc thềm.", "eng": "The dignity of the occasion was spoilt when she fell down the steps."}, {"viet": "Bác sĩ cho bà ấy thuốc để chữa cảm lạnh.", "eng": "The doctor's given her some medicine for her cold."}, {"viet": "Tài liệu đã được đánh máy bằng một máy đánh chữ xách tay nhỏ.", "eng": "The document has been typed on a small portable."}, {"viet": "Con lừa mang gánh nặng lên núi.", "eng": "The donkey carried its burden up the mountain."}, {"viet": "Người đàn ông say rượu đứng lảo đảo trên vỉa hè.", "eng": "The drunken man teetered on the edge of the pavement."}, {"viet": "Người con trai lớn tuổi hơn có quyền ưu tiên hơn người con trai ít tuổi hơn.", "eng": "The elder son has precedence over the younger one."}, {"viet": "Đầu tàu bị trật bánh do một cái cây ngáng giữa đường.", "eng": "The engine was derailed by a tree lying across the line."}, {"viet": "Cái giờ phút không hay khi anh ta sẽ phải đối mặt với cơn giận dữ của ông bác.", "eng": "The evil hour when he would have to face his uncle's anger."}, {"viet": "Tầm tri thức rộng lớn của anh ta làm họ ngạc nhiên.", "eng": "The extensiveness of his knowledge surprised them."}, {"viet": "Người nông dân chưa vắt sữa xong.", "eng": "The farmer hasn't finished milking."}, {"viet": "Kết thúc đầy bạo lực của bộ phim đó thật là quá đáng.", "eng": "The film's violent ending is completely over the top."}, {"viet": "Ngọn lửa bắt đầu khi hai sợi dây điện chạm vào nhau.", "eng": "The fire started when two wire came into contact."}, {"viet": "Vật chứng đầu tiên là một con dao mà bên khởi tố cho là vũ khí để giết người.", "eng": "The first exhibit was a knife which the prosecution claimed was the murder weapon."}, {"viet": "Ván sàn trong ngôi nhà cũ kêu cót két ầm ĩ.", "eng": "The floorboards in the old house creaked noisily."}, {"viet": "Nền của toà nhà bằng đá hoa cương.", "eng": "The foundation of the building is of granite."}, {"viet": "Lãi đạt mức trung bình là hai mươi phần trăm.", "eng": "The gain averages out to twenty percent."}, {"viet": "Viên tướng đã vạch ra một kế hoạch tấn công mới.", "eng": "The general worked out a new plan of attack."}, {"viet": "Tin vui đã khích lệ tất cả chúng tôi.", "eng": "The good news bucked us all up."}, {"viet": "Chính phủ tuyên bố nhiều người không có nhà cửa là do họ tự ý lựa chọn.", "eng": "The government has claimed that many people are homeless by choice."}, {"viet": "Chính phủ đã thành lập một đoàn công tác để điều tra vấn đề đó.", "eng": "The government set up a working party to look into the problem."}, {"viet": "Trọng lượng nặng đã làm thanh kim loại gãy rắc làm đôi.", "eng": "The great weight snapped the metal bar in two."}, {"viet": "Người khách trọ muốn chụp một tấm ảnh với nhân viên khách sạn.", "eng": "The guest wants to take a photo with the clerk."}, {"viet": "Việc phân tách sâu sắc thẳng tay về tội ác là một phần cuộc sống và tư duy của tôi.", "eng": "The heartless hip analysis of crime is a part of my life and my mentation."}, {"viet": "Những ngày nghỉ không còn xa lắm.", "eng": "The holidays are not so far off."}, {"viet": "Phòng khách sạn thì trống rỗng và không hấp dẫn.", "eng": "The hotel room was bare and uninviting."}, {"viet": "Căn nhà có cửa gắn kính.", "eng": "The house with a door with a glass panel."}, {"viet": "Tầm quan trọng của việc giao du với những kẻ thao túng giới nghệ thuật.", "eng": "The importance of hanging out with the movers and shakers of the art world."}, {"viet": "Van đóng của động cơ chạy bằng xăng hay hơi nước.", "eng": "The inlet valves of a petrol or steam engine."}, {"viet": "Hòn đảo này, nếu như có tàu bè ghé lại thì cũng chỉ là chuyện hiếm hoi.", "eng": "The island is seldom, if ever, visited by ships."}, {"viet": "Vị chánh án tuyên bố vụ án đó kết thúc.", "eng": "The judge reported the case closed."}, {"viet": "Dao được đánh bởi người thợ rèn trong làng.", "eng": "The knives are made by the village smith."}, {"viet": "Tiết lộ gần đây nhất trong một loạt các tiết lộ gây nhiều thiệt hại.", "eng": "The latest in a series of damaging leaks."}, {"viet": "Tính hợp pháp của hoạt động này sẽ do các tòa án quyết định.", "eng": "The legality of this action will be decided by the courts."}, {"viet": "Tàu khách chạy thông suốt nhờ thời tiết tốt.", "eng": "The liner make good sea-way because of the fine weather."}, {"viet": "Xe tải đó chất đầy gỗ.", "eng": "The lorry was loaded with timber."}, {"viet": "Những ý chính trong câu chuyện, cuộc thảo luận, cuộc tranh luận, v. v.", "eng": "The main points of a story, a discussion, an argument etc."}, {"viet": "Sự khác biệt rõ ràng giữa hai đứa trẻ.", "eng": "The marked difference between the two children."}, {"viet": "Các phương tiện thông tin đại chúng phải chịu trách nhiệm về việc tung tin đồn.", "eng": "The media are to blame for stating the rumours."}, {"viet": "Thời tiết ấm áp sẽ làm cho cây cối nở hoa.", "eng": "The mild weather will bring the trees into blossom."}, {"viet": "Đám đông đùng đùng nổi giận ùa qua làng.", "eng": "The mod rampage through the village."}, {"viet": "Loại hồng trà danh tiếng nhất là trà Ô Lông.", "eng": "The most famous one is oolong."}, {"viet": "Viện bảo tàng chưa bị ngọn lửa bén tới.", "eng": "The museum was not touched by the fire."}, {"viet": "Luật mới do Quốc Hội thông qua đã nhận được sự chấp thuận của nữ hoàng.", "eng": "The new bill passed by Parliament has received the royal assent."}, {"viet": "Tin về cái chết của anh ta như một tiếng sét ngang tai vậy.", "eng": "The new of his death was like a bold from the blue."}, {"viet": "Tin anh ta chết như sét đánh ngang tai.", "eng": "The news of his death is a bolt from the blue."}, {"viet": "Người cầm quyền đất nước trên danh nghĩa.", "eng": "The nominal ruler of the country."}, {"viet": "Các y tá trấn tĩnh người bệnh đang lo lắng bằng những lời lẽ êm dịu.", "eng": "The nurses calmed the anxious patient with soothing words."}, {"viet": "Những đồng tiền cũ đã được thu hồi không lưu hành nữa.", "eng": "The old coins have been withdrawn from circulation."}, {"viet": "Nhược điểm nhẹ duy nhất trong bức tranh này là một vết xước ở góc.", "eng": "The only slight imperfection in this painting is a scratch in the corner."}, {"viet": "Trận chung kết đó đã làm khán giả vô cùng thán phục.", "eng": "The outstanding finale killed the audience."}, {"viet": "Những hạt của nguyên tử là vô cùng nhỏ.", "eng": "The particles in an atom are infinitely small."}, {"viet": "Bệnh nhân đó phải được giữ ấm.", "eng": "The patient must be kept warm."}, {"viet": "Những cột đá cẩm thạch thẳng đứng của một ngôi đền Hy Lạp.", "eng": "The perpendicular marble columns of a Greek temple."}, {"viet": "Những miếng đồ chơi xếp hình ăn khớp chặt với nhau.", "eng": "The pieces of the puzzle lock into each other together."}, {"viet": "Máy bay nhào xuống bất chợt làm phi công ngất đi một lúc.", "eng": "The plane dived suddenly, causing the pilot to black out."}, {"viet": "Vở kịch ấy được trình diễn lần đầu ở Pari.", "eng": "The play was first performed in Paris."}, {"viet": "Cảnh sát yêu cầu tôi miêu tả hai người đàn ông đó.", "eng": "The police asked me to describe the two me."}, {"viet": "Cảnh sát ngăn chặn và phát hiện tội phạm.", "eng": "The police prevent and detect crime."}, {"viet": "Vị chính khách bị huýt sáo đuổi xuống khỏi khán đài.", "eng": "The politician was hissed off the platform."}, {"viet": "Sức mạnh của báo chí ảnh hưởng đến quan điểm của quần chúng.", "eng": "The power of printed word to influence peoples attitude."}, {"viet": "Tổng thống ra một lời kết tội gay gắt chủ nghĩa khủng bố.", "eng": "The President issued a tough denunciation of terrorism."}, {"viet": "Tính ưu việt của Đảng Cộng sản.", "eng": "The primacy of the Communist Party."}, {"viet": "Những người tù tìm cách mua chuộc lính gác để đánh đổi lấy tự do của họ.", "eng": "The prisoners tried to barter with the guards for their freedom."}, {"viet": "Dự án hoạt động kém trong kì nghỉ hè.", "eng": "The project went into low gear during summer vacation."}, {"viet": "Cú đấm vào bụng đã làm cho tôi hoàn toàn hụt hơi.", "eng": "The punch in the stomach completely winded me."}, {"viet": "Nhanh tay làm rối cả mắt.", "eng": "The quickness of the hand deceives the eye."}, {"viet": "Một món hàng thật, không phải là đồ cũ vứt đi.", "eng": "The real kosher article, not just any old rubbish."}, {"viet": "Những thánh tích được tin là có những quyền năng thần kỳ.", "eng": "The relics are credited with miraculous powers."}, {"viet": "Việc đưa trở lại tượng đá cẩm thạch Elgin về Hy Lạp.", "eng": "The restoration of the Elgin marbles to Greece."}, {"viet": "Mức phạm tội tăng lên là một dấu hiệu của thời đại.", "eng": "The rising level of crime is a sign of the times."}, {"viet": "Ban nhạc rock chơi một xê ri ở những nơi ở miền Bắc mỗi nơi chỉ một tối.", "eng": "The rock group played a series of one-night stand in the North."}, {"viet": "Những phế tích của đô thị nói lên sự hoa lệ trước đây của nó.", "eng": "The ruins of the city attest its ancient magnificence."}, {"viet": "Không còn mấy thời gian nữa: đến mai chúng ta đã phải có tiền rồi.", "eng": "The sands are running out: we must have the money by tomorrow."}, {"viet": "Các nhà khoa học bắt đầu dò tìm nguồn gốc các tia kỳ lạ này.", "eng": "The scientists set out to track down the strange rays."}, {"viet": "Câu Ông ấy thường đi thăm Tây Ban Nha vì ông ấy thích khí hậu ở đấy gồm có một mệnh đề chính và một mệnh đề phụ.", "eng": "The sentence He often visits Spain because he likes the climate consists of a main clause and a subordinate clause."}, {"viet": "Con tàu giạt vào bờ đá vỡ tan.", "eng": "The ship broke up on the rocks."}, {"viet": "Cửa hàng hứa sẽ giữ hàng cho tôi nếu tôi trả một khoản tiền đặt cọc.", "eng": "The shop promised to keep the goods for me if I paid a deposit."}, {"viet": "Người ca sĩ được chị mình đệm đàn piano.", "eng": "The singer was accompanied on the piano by her sister."}, {"viet": "Khói làm tôi chảy nước mắt.", "eng": "The smoke made my eyes water."}, {"viet": "Sự vững chắc của toà nhà, lý lẽ, kim loại.", "eng": "The solidity of a building, argument, metal."}, {"viet": "Khán giả điên cuồng khi bên mình thua ở phút cuối của trận đấu.", "eng": "The spectators went into frenzy when their side lost the match in the last minute of play."}, {"viet": "Nhà ga cách nhà tôi một quãng mười phút đi bộ.", "eng": "The station is ten minutes'walk from my house."}, {"viet": "Quai túi cứ luôn luôn tuột ( khỏi vai tôi ).", "eng": "The straps keep slipped off ( my shoulders )."}, {"viet": "Sự xuất hiện đột ngột của viên cảnh sát làm cho tên trộm chạy mất.", "eng": "The sudden appearance of a policeman caused the thief to run away."}, {"viet": "Cách bố trí các vườn một cách cân đối.", "eng": "The symmetrical arrangement of the gardens."}, {"viet": "Thầy giáo ra hiệu cho cậu học sinh bắt đầu.", "eng": "The teacher signalled to the boy to begin."}, {"viet": "Sự căng thẳng chẳng mấy chốc truyền đi khắp mọi người trong đám đông.", "eng": "The tension soon transmitted itself to all the members of the crowd."}, {"viet": "Nỗi lo sợ về một bệnh dịch đã gây ra sự hoảng hốt và náo động rộng lớn.", "eng": "The threat of an epidemic caused great alarm and trepidation."}, {"viet": "Trẻ con tò mò vây quanh khách du lịch.", "eng": "The tourists were surrounded by curious children."}, {"viet": "Người đại lý du lịch đã phá hỏng hoàn toàn sự sắp đặt cho ngày nghỉ của chúng ta.", "eng": "The travel agent completely cocked up the arrangements for our holiday."}, {"viet": "Hai anh em có tính khí hoàn toàn khác nhau.", "eng": "The two brothers have entirely different temperaments."}, {"viet": "Những chân lý cơ bản của triết học và khoa học.", "eng": "The ultimate truths of philosophy and science."}, {"viet": "Sáng nào nhân viên giặt ủi cũng đến thu gom.", "eng": "The valet comes over to collect it every morning."}, {"viet": "Du khách thường mua ngân phiếu du lịch để thanh toán cho những chi phí đi lại ở nước ngoài.", "eng": "The visitors usually purchase traveler's cheques for the payment of travel expenses abroad."}, {"viet": "Con đường ở phía trước bị cây đổ chắn ngang.", "eng": "The way ahead was blocked by fallen trees."}, {"viet": "Cả dải băng được cuốn quanh một thanh gỗ.", "eng": "The whole strip was rolled up around on rod."}, {"viet": "Người phụ nữ ở bàn bên đang liếc mắt đưa tình với anh ta.", "eng": "The woman at the next table was giving him the glad eye."}, {"viet": "Những vết thương nói lên anh ta đã bị một con báo tấn công.", "eng": "The wounds suggested that he had been attacked by a leopard."}, {"viet": "Cuộc nói chuyện về vi tính của họ thật khó hiểu đối với tôi.", "eng": "Their conversation about computers was all double-dutch to me."}, {"viet": "Đối phương của họ đã khống chế bóng trong hầu như suốt cả trận đấu.", "eng": "Their opponents were in possession of the ball for most of the match."}, {"viet": "Vậy thì cho một phần bánh nướng sô-cô-la.", "eng": "Then make it one chocolate pie."}, {"viet": "Trong thường dân có sự ủng hộ mạnh đối với các chính sách của chúng ta.", "eng": "There's a lot of support for our policies on the ground."}, {"viet": "Mở một rạp chiếu bóng ở thành phố này chẳng có lời lãi gì cả.", "eng": "There's no profit in running a cinema in this town."}, {"viet": "Trong phòng của tôi có vài con muỗi.", "eng": "There are a few mosquitoes in my room."}, {"viet": "Chỉ có những sự khác nhau không đáng kể giữa hai bản dịch.", "eng": "There are only small differences between the two translations."}, {"viet": "Không có đủ ghế cho mọi người.", "eng": "There aren't enough chairs to go round."}, {"viet": "Có một sự xích mích lớn giữa giới quản lý và lực lượng lao động.", "eng": "There is a great deal of friction between the management and the work force."}, {"viet": "Không có một giải pháp đơn giản rõ ràng nào cho vấn đề này.", "eng": "There is no neat solution to this problem."}, {"viet": "Nên có một đạo luật chống hành vi phản xã hội đó.", "eng": "There ought to be a law against that sort of antisocial behaviour."}, {"viet": "Tình trạng cực kỳ lộn xộn ở bên ngoài phòng xử án.", "eng": "There was absolute mayhem outside the courtroom."}, {"viet": "Cảnh tượng đến là buồn cười khi con lợn chạy tọt vào cửa hiệu.", "eng": "There were hilarious scenes when the pig ran into the shop."}, {"viet": "Những con vật to lớn này có thể đi ngày này qua ngày khác không ăn, vì chúng đã tích lũy vô số thức ăn trong bướu của chúng.", "eng": "These big animals can go for day without eating, because they store large amounts of food in their humps."}, {"viet": "Đây là tên những nguyên tố.", "eng": "These names are the names of elements."}, {"viet": "Họ biết họ phải làm công việc đó chỉ có vài ba năm và rồi khi họ lập gia đình thì người chồng phải lo bảo đảm cuộc sống cho họ đến mãn đời.", "eng": "They'll get married and be taken care of be their husband for the rest of their lives."}, {"viet": "Họ đã có được sự ủng hộ của chính phủ đối với dự án đó.", "eng": "They've secured government backing for the project."}, {"viet": "Chúng chất chồng quá cao rồi.", "eng": "They are piled up so high."}, {"viet": "Họ đã cắm trại ở chân núi.", "eng": "They camped at the foot of the mountain."}, {"viet": "Họ đã cố gắng hết sức để hoàn tất đúng thời hạn.", "eng": "They did their damnedest to finish on time."}, {"viet": "Họ thấy khó có thể biện hộ được cho việc con trai họ từ bỏ một công việc chắc chắn lương hậu.", "eng": "They found it hard to justify their son's giving up a secure well-paid job."}, {"viet": "Họ vừa làm một công việc mạo hiểm là đi quanh thế giới trong một chiếc thuyền con.", "eng": "They have just embarked on their latest enterprise, which is to sail round the world in a very small boat."}, {"viet": "Họ sống thân ái với nhau trong nhiều năm.", "eng": "They lived together amicably for several years."}, {"viet": "Họ gói ghém đồ đạc chuẩn bị cho chuyến đi.", "eng": "They packed all their things for the journey."}, {"viet": "Họ yêu cầu ngân hàng ứng trước 5000 bảng Anh cho dự án đó.", "eng": "They requested the bank to advance £ 5,000 for the project."}, {"viet": "Chúng nó chia tiền với nhau.", "eng": "They split the money between them."}, {"viet": "Họ muốn quần áo tốt hơn, có nhiều nhà cửa tiện nghi hơn, thức ăn ngon hơn.", "eng": "They wanted finer clothes, more comfortable homes, and more interesting foods."}, {"viet": "Họ làm ồn đến mức đánh thức được cả người chết.", "eng": "They were making enough noise to awaken the dead."}, {"viet": "Họ sử dụng cầu thang chẳng dễ dàng gì.", "eng": "They wouldn't be able to use the stairs very easily."}, {"viet": "Cuốn sách này xưa kia nổi tiếng nhưng ngày nay không ai đọc nữa.", "eng": "This book was once famous, but nobody reads it today."}, {"viet": "Cuốn từ điển gồm khoảng 16000 từ.", "eng": "This dictionary comprises about 16000 words."}, {"viet": "Bài tập này cũng tạm được nhưng lẽ ra anh có thể làm tốt hơn.", "eng": "This homework is all right but you could do better."}, {"viet": "Đây là công trình tốt đẹp nhất anh đã làm được từ trước đến nay.", "eng": "This is the best work you've ever done."}, {"viet": "Cái máy này nguy hiểm: các hệ thống dây dẫn bị hỏng.", "eng": "This machine is dangerous: the wiring is faulty."}, {"viet": "Đoạn này piano chơi một mình.", "eng": "This passage is to be played solo by the piano."}, {"viet": "Trường này có 300 học sinh nội trú và 150 học sinh ngoại trú.", "eng": "This school has 300 boarders and 150 day pupils."}, {"viet": "Loại bóng điện này lắp xoáy vào đui.", "eng": "This type of bulb screws into the socket."}, {"viet": "Tuy khiếp sợ ghê gớm, bề ngoài bà ta vẫn tỏ ra bình tĩnh.", "eng": "Though badly frightened, she appeared outwardly calm."}, {"viet": "Tom này, em muốn đi về miền nam.", "eng": "Tom, I want to go south."}, {"viet": "Tyrannosaurus cũng là một loài khủng long, và có lẽ là loài khủng long khủng khiếp nhất trong tất cả.", "eng": "Tyrannosaurus was another, and probably the most terrible of all."}, {"viet": "Những điều kiện khắc khổ của thời chiến gồm có việc phân phối lương thực theo khẩu phần và tình trạng thiếu chất đốt.", "eng": "Wartime austerities included food rationing and shortage of fuel."}, {"viet": "Chúng ta sẽ qua cầu khi chúng ta đến đó.", "eng": "We'll cross that bridge when we come to it."}, {"viet": "Mùa hè này chúng tôi đi nghỉ ở Tây Ban Nha trong một cái nhà lưu động.", "eng": "We're going caravanning in Spain this summer."}, {"viet": "Chúng tôi đang đợi một phản ứng của văn phòng Tổng thống.", "eng": "We're waiting for a reaction from the Oval office."}, {"viet": "Chúng tôi đã tìm được một số công thức làm bánh mà anh ưa thích.", "eng": "We've searched out some of your favourite recipes."}, {"viet": "Chúng tôi đang dự tính đi chơi Nha Trang.", "eng": "We are contemplating a visit to Nha Trang."}, {"viet": "Chúng tôi đã hỏi ông Brown xem phải mất bao lâu để lái xe đến Chicago thì ông trả lời đại khái là hai ngày.", "eng": "We asked Mr. Brown how long it would take to drive to Chicago and his rough-and-ready answer was two days."}, {"viet": "Chúng ta có thể có thêm một chỗ nữa nếu anh lách lên.", "eng": "We can get one more in if you shove up."}, {"viet": "Chúng ta có thể nhìn thấy ánh sáng lấp lánh đằng xa của đèn trên cảng.", "eng": "We could see the distant twinkle of the harbour lights."}, {"viet": "Chúng tôi kéo cái cây đổ để làm quang mặt đường.", "eng": "We dragged the fallen tree clear of the road."}, {"viet": "Chúng tôi bất đồng ý kiến về việc ai đã thắng.", "eng": "We had a difference of opinion over who had won."}, {"viet": "Chúng ta được sự uỷ quyền của toàn thể hội viên nghiệp đoàn tiến hành hoạt động đình công.", "eng": "We have a mandate from the union membership to proceed with strike action."}, {"viet": "Chúng tôi có quyền khám xét toà nhà này.", "eng": "We have the authority to search this building."}, {"viet": "Chúng ta biết rằng chất men dịch vị, một chất quan trọng trong sự tiêu hóa thức ăn, được tìm thấy trong dạ dày của nhiều loại động vật.", "eng": "We know that rennet, which is important in the digestion of food, is found in the stomachs of many animals."}, {"viet": "Tình cờ mãi hôm qua chúng tôi mới gặp cô ta.", "eng": "We met her only yesterday, as it happens."}, {"viet": "Chúng ta phải đấu tranh chống lại thành kiến đó vì một thái độ khoan dung hơn đối với các tín ngưỡng của chúng ta.", "eng": "We must struggle against this prejudice for a more tolerant attitude to our beliefs."}, {"viet": "Chúng tôi dự định gặp lại nhau trong một tương lai không quá xa.", "eng": "We plan to meet again in the not too distant future."}, {"viet": "Chúng tôi bán rất nhiều loại rượu bia và bia nâu nặng.", "eng": "We sell a wide range of ales and stouts."}, {"viet": "Chúng tôi dừng lại vì chúng tôi thấy có bảng dấu hiệu cấm đường.", "eng": "We stopped because we saw a prohibitive road sign."}, {"viet": "Chúng tôi muốn đặt hàng mẫu 747.", "eng": "We want to place an order for model 747."}, {"viet": "Chúng tôi chơi năm ván nhưng mới đến ván thứ ba thì chúng tôi thôi vì John đã ăn hết cả ba.", "eng": "We were playing the best of five but we stopped after three because John won them all."}, {"viet": "Chúng ta sẽ lên boong trên.", "eng": "We would go onto the upper deck."}, {"viet": "Vậy, bây giờ tôi sẽ trả tiền cho anh trong một năm.", "eng": "Well, I'll pay you for one year now."}, {"viet": "À, thưa sĩ quan, ông thấy đó chúng tôi chỉ là ….", "eng": "Well, you see, officer, we were jus."}, {"viet": "Anh đãi chúng tôi một bữa ăn tuyệt vời-một bữa tiệc thực sự.", "eng": "What a marvellous meal you've given us-a real feast."}, {"viet": "Thật là sung sướng! Hôm nay tôi không phải đi làm.", "eng": "What bliss! I don't have to go to work today."}, {"viet": "Lớn lên em muốn làm gì?", "eng": "What do you want to be when you're grown up?"}, {"viet": "Trong tình trạng này, dùng thuốc nào là tốt nhất?", "eng": "What is the best medication for this condition?"}, {"viet": "Bạn nghĩ gì về hệ thống giao thông công cộng ở Nhật Bản?", "eng": "What is your opinion of the public transportation system in Japan?"}, {"viet": "Toà điện ở đằng kia là gì vậy?", "eng": "What's the hall over there?"}, {"viet": "Ông sẽ làm gì ở New York?", "eng": "What will you do in New York?"}, {"viet": "Khi quá trình hoại thư bắt đầu, bàn chân anh ấy phải cưa đi.", "eng": "When gangrene set in, his foot had to be amputated."}, {"viet": "Khi nào sinh em bé vậy?", "eng": "When is the baby expected to arrive?"}, {"viet": "Khi cơ hội đến đúng lúc, cô ta sẽ nắm ngay lấy.", "eng": "When the right opportunity comes along, she'll take it."}, {"viet": "Khi khởi động máy phải nhớ là ô tô ở số không.", "eng": "When you start the engine, be sure the car is neutral."}, {"viet": "Sống ở vùng nào ở Canada là đắt đỏ nhất?", "eng": "Where is the most expensive area to live in Canada?"}, {"viet": "Núi nào cao thứ hai ở Nhật Bản?", "eng": "Which mountain is the second highest in Japan?"}, {"viet": "Người mà, điều mà, cái mà, mà là những đại từ liên hệ.", "eng": "Who, what, which, that are relative pronouns."}, {"viet": "Bất cứ ai gọi điện thoại muốn nói chuyện với tôi, cứ bảo họ là tôi bận.", "eng": "Whoever wants to speak to me on the phone, tell them I'm busy."}, {"viet": "Sao lại cáu với tôi về những lỗi lầm ngu xuẩn của chính anh?", "eng": "Why grumble at me about your own stupid mistakes?"}, {"viet": "Bà làm ơn kiểm tra những con số này trong tài khoản ký thác không kỳ hạn của bà được không?", "eng": "Will you check these figures in your current deposit account?"}, {"viet": "Đi chơi bằng nhà lưu động, bạn có thể tuỳ nghi dừng nghỉ, không phụ thuộc vào khách sạn nào cả.", "eng": "With a caravan, you can stop at your own convenience, you're not dependent on hotels."}, {"viet": "Phụ nữ ngày nay không còn chấp nhận cách cư xử như vậy nữa.", "eng": "Women today no longer accept such treatment."}, {"viet": "Ông vui lòng cho tôi xem phiếu rút tiền được không?", "eng": "Would you kindly show me the withdrawal slip?"}, {"viet": "Phiền bạn giúp tôi khiêng thùng này nhé?", "eng": "Would you mind helping me carry this box?"}, {"viet": "Viết chi tiết các ghi chú cho bài giảng của mình, biên bản của một cuộc họp, v. v.", "eng": "Write up one's lecture notes, the minutes of a meeting, etc."}, {"viet": "Dạ có, nó dùng kèm với rau tươi.", "eng": "Yes, it comes with fresh vegetables."}, {"viet": "Anh sẽ gặp rắc rối nếu không cẩn thận đường đi nước bước.", "eng": "You'll be in trouble if you don't watch your step."}, {"viet": "Anh đang xử sự tồi hơn cả em trai mình đấy.", "eng": "You're behaving worse than your brother."}, {"viet": "Con lại để mất bộ đồ chơi rồi-con nói sao đây?", "eng": "You've lost your games kit again-what have you got to say for yourself?"}, {"viet": "Anh không thể chờ đợi tôi để ý tới mọi thứ được!", "eng": "You can't expect me to think of everything!"}, {"viet": "Anh có thể mua được vé rẻ hơn vào một số ngày trong năm.", "eng": "You can get cheaper fares on certain days of the year."}, {"viet": "Anh có thể sử dụng thời gian rỗi của anh tốt hơn.", "eng": "You could employ your spare time better."}, {"viet": "Gần đây anh đang đọc một số sách về nghiệp vụ ngân hàng.", "eng": "You have been reading some books recently about banking."}, {"viet": "Ông biết là công ty chúng tôi là một công ty khá nhỏ và còn non trẻ.", "eng": "You know we are rather small and young."}, {"viet": "Cậu phải là mất trí nếu cậu nghĩ là tôi sẽ cho cậu vay 50 pao!", "eng": "You must be out of your mind if you think I'm going to lend you 50 pounds!"}, {"viet": "Anh không cần có sự hiểu biết nào trước vẫn có thể làm được cuộc trắc nghiệm này.", "eng": "You need no prior knowledge to be able to do this test."}, {"viet": "Bạn nên hết sức thận trọng khi lái xe trong sương mù.", "eng": "You should exercise extreme caution when driving in fog."}, {"viet": "Những nhận xét thiếu tế nhị của anh làm hỏng những cố gắng của chúng tôi thuyết phục họ.", "eng": "You tactless remarks made nonsense of our attempts to reassure them."}, {"viet": "Tôi đánh cuộc là anh sẽ không tìm thấy ở đâu những hàng hoá tốt hơn đây.", "eng": "You won't find better goods anywhere else, I'll wager."}, {"viet": "Bố mày sẽ lột sống khi ông ấy nhìn thấy cái này!", "eng": "Your father'll skin you alive when he sees this!"}, {"viet": "Niềm tin của anh đặt vào nó là nhầm chỗ rồi, nó sẽ lừa anh nếu có thể.", "eng": "Your trust in him is misplaced, he'll cheat you if he can."}]