[{"viet": "200 người ở xí nghiệp đó đã bị sa thải.", "eng": "200 men have been sacked at the factory."}, {"viet": "Chiếc xe ôtô thình lình đâm ngang trước mặt tôi.", "eng": "A car suddenly pulled out in front of me."}, {"viet": "Một nhân viên khách sạn dẫn khách đến phòng, người khách đó muốn biết cách nói “ Cám ơn ” và “ Tạm biệt ” bằng tiếng Trung Quốc.", "eng": "A clerk shows the guest to his room and the guest wants to learn how to say Thank you and Good-bye in Chinese."}, {"viet": "Một cặp làm tình ở băng sau xe ôtô.", "eng": "A couple screwing in the back of a car."}, {"viet": "Một sơ đồ trình bày có kế hoạch việc tạo ra và tiêu thụ của cải.", "eng": "A diagram that schematises the creation and consumption of wealth."}, {"viet": "Cứ mỗi lần cửa hàng đó thông báo bán nửa giá đặc biệt về thiết bị stêrêo đắt tiền thì anh ta lại có được một lúc hồ hởi.", "eng": "A familiar rush overtook him each time the store announced a half-price special on expensive stereo equipment."}, {"viet": "Một tỉ lệ cố định của ngân quỹ được đầu tư vào các xí nghiệp Anh.", "eng": "A fixed proportion of the fund is invested in British firms."}, {"viet": "Một lối tường thuật kỳ quặc của Graham Greene.", "eng": "A gonzo version of Graham Greene."}, {"viet": "Một vị khách muốn trả bằng tiền mặt.", "eng": "A guest wishes to pay in cash."}, {"viet": "Một ngôi nhà bên bờ hồ Giơnevơ.", "eng": "A house on the shore of Lake Geneva."}, {"viet": "Chúng ta được đãi một bữa thoải mái.", "eng": "A large meal was laid on for us."}, {"viet": "Một ban nhạc sống luôn có sức thu hút lớn trong một bữa tiệc.", "eng": "A live band is always a good draw at a party."}, {"viet": "Một gã cầm súng bắn vào đám đông.", "eng": "A man with a gun was shooting at the crowd."}, {"viet": "Một đài kỷ niệm do sự đóng góp của quần chúng đài thọ.", "eng": "A monument paid for by public subscription."}, {"viet": "Một bài báo dựa vào giả thiết.", "eng": "A newspaper article based on supposition."}, {"viet": "Một mẫu vẽ đầy đường cong và góc cạnh.", "eng": "A pattern full of curves and angles."}, {"viet": "Một kế hoạch hoá ra không thể thực hiện được.", "eng": "A plan that turned out to be infeasible."}, {"viet": "Một giới thiệu chương trình truyền hình tuần tới.", "eng": "A preview of next week's viewing."}, {"viet": "Một niềm an ủi đối với chúng tôi trong thời kỳ khó khăn này.", "eng": "A ray of comfort for us in these troubled times."}, {"viet": "Một bản phác thảo bài diễn văn của ông ta.", "eng": "A rough draft of his speech."}, {"viet": "Một loạt động tác lướt trên phím đàn dương cầm.", "eng": "A series of glittering glissandi on the piano."}, {"viet": "Khúc nhạc dạo chậm mở đầu phần thứ nhất.", "eng": "A slow theme introduces the first movement."}, {"viet": "Một bài diễn văn tác động đến nhiều cử tri.", "eng": "A speech that swayed many voters."}, {"viet": "Một sự tăng dòng điện đột ngột làm các bóng đèn bị cháy.", "eng": "A sudden surge in the current made the lights fuse."}, {"viet": "Một cuốn tiểu thuyết hết sức đồi bại mà các thanh niên không được phép đọc.", "eng": "A thoroughly corrupt novel which young people should not be allowed to read."}, {"viet": "Một sự đánh giá quá chủ quan về vở kịch đó.", "eng": "A very subjective judgement of the play."}, {"viet": "Một phụ nữ bị một băng du đãng thanh niên đã tấn công và cướp của.", "eng": "A woman was attacked and robbed by a gang of youths."}, {"viet": "Buộc tội ai lừa đảo, hèn nhát, trộm cắp.", "eng": "Accuse somebody of cheating, cowardice, theft."}, {"viet": "Cố vấn cho những sinh viên ra trường chọn nghề.", "eng": "Advising college leavers on their choice of profession."}, {"viet": "Sau khi uống rượu bệnh cảm của tôi đã tở nên nặng hơn.", "eng": "After I drink alcohol, my cold got worse."}, {"viet": "Sau trận đấu võ sĩ quyền Anh bại trận thề sẽ phục thù.", "eng": "After the fight the defeated boxer swore he'd get his own back."}, {"viet": "Người nghiện rượu thường có những lúc mất trí nhớ.", "eng": "Alcoholics often suffer from periods of oblivion."}, {"viet": "Được rồi, chúng tôi sẽ lấy phòng đó.", "eng": "All right, we'll take it."}, {"viet": "Tất cả những sự tàn bạo đều đáng ghét đối với chúng tôi.", "eng": "All tyranny is hateful to us."}, {"viet": "Trong lúc bối rối và vội vàng, nàng đã quên chào tạm biệt.", "eng": "Amid all the rush and confusion she forgot to say goodbye."}, {"viet": "Một khu vực tội ác tràn lan.", "eng": "An area where crime is rife."}, {"viet": "Một cuộc triển lãm tác phẩm của những nhà điêu khắc trẻ.", "eng": "An exhibition of the work of young sculptors."}, {"viet": "Một vấn đề đã chia dư luận quần chúng thành hai phe đối lập nhau.", "eng": "An issue which has polarized public opinion."}, {"viet": "Một đại diện không được hướng dẫn tại một hội nghị chính trị.", "eng": "An uninstructed representative at a political convention."}, {"viet": "Và hộ chiếu của ông và bản ghi nhớ đổi tiền.", "eng": "And your passport and the exchange memo."}, {"viet": "Tối nay Aouita sẽ chạy đua ở cự ly 1500m.", "eng": "Aouita will be running in the 1500 metres tonight."}, {"viet": "Có nhiều công ty cỡ nhỏ và vừa ở nước bạn phải không?", "eng": "Are there many small to medium-sized companies in your country?"}, {"viet": "Bạn thích phim được sản xuất ở châu Âu không?", "eng": "Are you interested in movies made in Europe?"}, {"viet": "Đổ vấy các động cơ xấu xa cho đối thủ.", "eng": "Arrogate evil motives to a rival."}, {"viet": "Cứ khi nào tôi gọi điện cho hắn là đường dây lại bận.", "eng": "As often as I tried to phone him the line was engaged."}, {"viet": "Thuốc Átpirin được hấp thụ nhanh chóng vào cơ thể.", "eng": "Aspirin is quickly absorbed into the body."}, {"viet": "Anh ấy từ chối bỏ phiếu trong kì bầu cử vừa qua.", "eng": "At the last election he abstained from the vote."}, {"viet": "Giờ hành lí chỉ bị giới hạn về kích cỡ, đâu phải trọng lượng.", "eng": "Baggage is limited by size now, not weight."}, {"viet": "Ăn mặc đúng thời trang nhất.", "eng": "Be dressed in the height of fashion."}, {"viet": "Vì động cơ trục trặc, chiếc máy bay đã phải hạ cánh khẩn cấp.", "eng": "Because of engine trouble, the plane had to make an emergency landing."}, {"viet": "Ngoài ra, họ cũng kinh doanh việc đổi tiền.", "eng": "Besides, they also deal in money exchange."}, {"viet": "Sách được cột thành bó hai mươi cuốn.", "eng": "Books tied up in bundles of twenty."}, {"viet": "Phát lời nhắn tin trên băng dân sự.", "eng": "Broadcast a message on CB radio."}, {"viet": "Nhưng tôi phải cho anh ta vào trận.", "eng": "But I had to put him in."}, {"viet": "Nhưng chúng tôi có thể khẳng định rằng giá cả của chúng tôi hoàn toàn thực tế, không thể có bất cứ nhà cung cấp nào khác có thể chào giá thấp hơn chúng tôi nếu như hàng hoá của họ về mặt chất lượng cũng như hàng hoá của chúng tôi.", "eng": "But we can safely say that our price is quite realistic, it's impossible that any other supplier can under quote us if their goods are as good as ours in quality."}, {"viet": "Lúc chúng tôi đến trễ một tiếng đồng hồ, cô ta đang nổi giận.", "eng": "By the time we arrived an hour late she was fuming with rage."}, {"viet": "Tôi có thể giao phó cho anh những kế hoạch bí mật không?", "eng": "Can I entrust you with the secret plans?"}, {"viet": "Chúng tôi có thể gửi lại hành lý đến khi rời khách sạn tối nay được không?", "eng": "Can we leave our bags until we leave this evening?"}, {"viet": "Anh vui lòng xê dịch đi, anh đang cản đường tôi đấy.", "eng": "Can you move, please, you're in my way."}, {"viet": "Tập trung năng lực của ai vào công việc tự nguyện.", "eng": "Canalize one's energies into voluntary work."}, {"viet": "Tính chầu rượu này vào sổ nợ của tôi, anh bạn.", "eng": "Chalk this round up to me, please, barman."}, {"viet": "Tiền tệ Trung Quốc có đồng, hào và xu y như tiền tệ Mỹ có đô la, mười xu và xu vậy.", "eng": "Chinese currency has Yuan, Jiao and fen just US currency has dollar, dime and cent."}, {"viet": "Cônhắc và Ácmanhắc là loại rượu brandi ngon.", "eng": "Cognac and Armagnac are fine brandies."}, {"viet": "Việc soạn tự điển đòi hỏi nhiều thời gian và kiên nhẫn.", "eng": "Compiling a dictionary costs much time and patience."}, {"viet": "Cứ đi tiếp theo hướng này cho đến khi bạn nhìn thấy một tấm bảng hiệu.", "eng": "Continue in this direction until you see a sign."}, {"viet": "Vậy thì cô có thể đi ăn tối với tôi được không?", "eng": "Could you go out for dinner with me, then?"}, {"viet": "Thẻ tín dụng đã làm thay đổi tận gốc thói quen tiêu tiền của dân chúng.", "eng": "Credit cards have brought about a revolution in people's spending habits."}, {"viet": "Màn đêm buông xuống nhanh ở những vùng nhiệt đới.", "eng": "Darkness falls quickly in the tropics."}, {"viet": "Ký thác giấy tờ cho luật sư của mình.", "eng": "Deposit papers with one's lawyer."}, {"viet": "Buổi hòa nhạc có được nhắc đến trên báo không?", "eng": "Did the concert get a mention in the paper?"}, {"viet": "Các chất hữu cơ khác nhau trong đất phản xạ lại sức nóng của mặt trời theo những tỷ lệ khác nhau.", "eng": "Different organic materials in the soil reradiate the sun's heat at different rates."}, {"viet": "Tôi phải nhắc anh lại lần nữa sao?", "eng": "Do I have to remind you yet again?"}, {"viet": "Bạn có tin vào giấc mơ Mỹ không?", "eng": "Do you believe in the American dream?"}, {"viet": "Ông có thực đơn món chay không?", "eng": "Do you have a vegetarian menu?"}, {"viet": "Bạn có biết nhiều về rượu vang không?", "eng": "Do you know much about wine?"}, {"viet": "Bà muốn được khám sáng hay chiều?", "eng": "Do you prefer morning or afternoon?"}, {"viet": "Bạn có nghĩ là bạn có thân hình cân đối không?", "eng": "Do you think you are in good shape?"}, {"viet": "Chương trình Thế Giới Vụ của đài BBC liệu có mang lại một quan điểm thuận lợi về nước Anh không?", "eng": "Does the BBC World Service project a favourable view of Great Britain?"}, {"viet": "Đừng có quá chán nản đến như vậy; tình hình rồi sẽ sáng sủa hơn thôi.", "eng": "Don't be too down-hearted; things will get better."}, {"viet": "Đừng đi ra ngoài sân trường.", "eng": "Don't go outside the school play ground."}, {"viet": "Xin đừng kể lại những gì tôi đã nói với bất cứ ai-nó là chuyện mật.", "eng": "Don't repeat what I said to anyone-it's confidential."}, {"viet": "Đừng chùi mũi vào tay áo của con!", "eng": "Don't wipe your nose on your sleeve!"}, {"viet": "Các người lái xe vào xa lộ phải nhường đường cho xe cộ ở làn bên ngoài.", "eng": "Drivers joining the freeway must yield to traffic in the outside lane."}, {"viet": "Nhẹ tay với cái ghế đó-một cái chân của nó bị lỏng đấy.", "eng": "Easy with that chair-one of its legs is loose."}, {"viet": "Thưởng thức những cảnh vật huy hoàng từ trên đỉnh, ở trên các ngọn núi.", "eng": "Enjoying the magnificent views from the summit, over the mountains."}, {"viet": "Cứ mỗi lần tôi mở miệng của tôi ra nói thì ông ta chống đối tôi.", "eng": "Every time I open my mouth he contradicts me."}, {"viet": "Xin lỗi cho hỏi, tôi đang tìm phòng nhân sự.", "eng": "Excuse me, I'm looking for the Personnel Department."}, {"viet": "Những điều mà mọi học sinh nam đều am tường.", "eng": "Facts with which every schoolboy is familiar."}, {"viet": "Cảm thấy bị ai mắng nhiếc.", "eng": "Feel the lash of somebody's tongue."}, {"viet": "Các công ty đã được mời đấu thầu xây dựng đường cao tốc mới.", "eng": "Firms were invited to tender for the construction of the new motorway."}, {"viet": "Nhét những điều khoản gian lận vào hợp đồng.", "eng": "Foist unfair provisions into the contract."}, {"viet": "Cho anh biết điều này, thư việc ở tầng một.", "eng": "For your information, the library is on the first floor."}, {"viet": "Từ trên mái nhà, chúng ta có thể nhìn thấy toàn bộ công viên.", "eng": "From the roof we could see the full extent of the park."}, {"viet": "Nước Đức phía tây giáp với Pháp và phía nam giáp với Thụy Sĩ.", "eng": "Germany is bounded on the West by France and on the South by Switzerland."}, {"viet": "Cho tôi biết chi tiết về dự án mới này.", "eng": "Give me the gen on this new project."}, {"viet": "Thôi mà anh ơi-trông anh chỉ ba mươi không quá một ngày.", "eng": "Go on with you-you don't look a day over thirty."}, {"viet": "Những tiếng khóc nức nở lớn làm rung cả người nó.", "eng": "Great sobs shook his whole body."}, {"viet": "Khai thác một con sông, một thác nước, ánh mặt trời để làm nguồn năng lượng.", "eng": "Harness a river, a waterfall, the sun's rays as a source of energy."}, {"viet": "Anh có được ghi tên vào danh sách trúng tuyển cho chức vụ đó không?", "eng": "Have you been short-listed for the post?"}, {"viet": "Cậu có cái gì đó cho mình đọc không?", "eng": "Have you got something I could read?"}, {"viet": "Phải làm nhân viên thư ký sau khi đã từng làm chủ đúng là một sự xuống dốc của anh ta.", "eng": "Having to work as a clerk is a bit of a come-down after running his own business."}, {"viet": "Anh ta luôn luôn ca thán về khối lượng công việc.", "eng": "He's always grousing about the work-load."}, {"viet": "Anh ấy đang chuyển thành kịch cho cuốn tiểu thuyết của anh ấy để đưa lên vô tuyến.", "eng": "He's dramatizing his novel for television."}, {"viet": "Anh ta không phải là một người chậm chạp khi đến xin thêm tiền.", "eng": "He's no laggard when it comes to asking for more money."}, {"viet": "Anh ta là người điều khiển thang máy của máy bay.", "eng": "He's the one who operates the elevator for the planes."}, {"viet": "Ông ta lúc nào cũng nghĩ tới chuyện làm ăn.", "eng": "He always has an eye to business."}, {"viet": "Ông ta đã đối xử thân thiết với con cái của bà ấy.", "eng": "He behaved very affectionately towards her children."}, {"viet": "Ông ta có thể rất nghiêm khắc với con cái.", "eng": "He can be very heavy with his children."}, {"viet": "Ông ta che giấu nỗi lo lắng của mình sau vẻ mặt thờ ơ.", "eng": "He conceals his worries behind a mask of nonchalance."}, {"viet": "Hắn phủ nhận không biết gì về tội ác đó.", "eng": "He denied all knowledge of the crime."}, {"viet": "Anh ta không đủ sức làm công việc nặng nhọc như thế này.", "eng": "He doesn't have the physique for such heavy work."}, {"viet": "Ông ta trình bày cặn kẽ rất lâu với tôi những quan điểm của mình về giáo dục.", "eng": "He expounded his views on education to me at great length."}, {"viet": "Anh ta vung tay vừa kịp giữ không cho cô ta ngã xuống.", "eng": "He flung his arm out just in time to stop her falling."}, {"viet": "Nó tiêu hết vèo lương, và đến thứ Hai nó sạch túi.", "eng": "He gets through his pay like a dose of salts, and by Monday he's broke."}, {"viet": "Anh ta đã bị báo chí chơi xỏ khá nhiều.", "eng": "He had been shafted by the press quite a bit."}, {"viet": "Anh ta có tinh trùng loãng.", "eng": "He has a low sperm count."}, {"viet": "Ông ấy đã sống qua hai cuộc cách mạng.", "eng": "He has lived through two revolutions."}, {"viet": "Ông ta giữ một thông báo nói rằng họ đã đuổi theo và hẳn là đã thanh toán một chiếc tàu ngầm có tên lửa tầm sóng.", "eng": "He held a dispatch saying that they had prosecuted and probably killed an Echo-class missile submarine."}, {"viet": "Ông ta đang gánh vác tất cả các công việc của phòng trên vai của ông ta.", "eng": "He is carrying the department on his shoulders."}, {"viet": "Anh ta là trụ cột của nhóm kịch chúng tôi.", "eng": "He is the mainstay of our theatre group."}, {"viet": "Anh ta làm một cái ly ở trên bàn rớt xuống do áo quệt vào.", "eng": "He knocked a glass off the table with a brush of his coat."}, {"viet": "Ông ấy sẽ tiếp ông ngay.", "eng": "He'll be with you in a minute."}, {"viet": "Ông ấy đã tố cáo trước sự hiện diện của các nhân chứng.", "eng": "He made the accusation in the presence of witnesses."}, {"viet": "Ông ấy không bao giờ thất hứa cả.", "eng": "He never goes back on his word."}, {"viet": "Ông ấy đã chọn quả đào chín nhất.", "eng": "He picked out the ripest peach."}, {"viet": "Anh ta hãnh diện đi tản bộ với cô bạn thanh lịch trong công viên.", "eng": "He proudly promenade his elegant companion in the park."}, {"viet": "Anh ta thật sự hành động bừa bãi và nói cho tôi biết anh ta nghĩ gì về tôi.", "eng": "He really cut loose and told me what he thought of me."}, {"viet": "Ông ấy nghỉ hưu khi ông ấy 65 tuổi.", "eng": "He retired from the business when he was 65."}, {"viet": "Anh ta sợ rằng tiền án của anh ta sẽ làm trở ngại cho anh ta khi anh ta đi xin việc.", "eng": "He's afraid that his criminal record will be held against him when he applies for the jobs."}, {"viet": "Anh ta biết cách tiêu tiền bạc của mình.", "eng": "He's good at managing his money."}, {"viet": "Ông ấy là một trong những khách hàng quen của chúng tôi.", "eng": "He's one of our regulars."}, {"viet": "Ông ta nói rằng ông ta lấy làm xấu hổ nếu đặt một cuốn sách in vào thư viện của mình.", "eng": "He said that he would be ashamed to put a printed book in his library."}, {"viet": "Anh ta dường như cuốn hút với đứa trẻ kháu khỉnh đó.", "eng": "He seems getting off with that cute little babe."}, {"viet": "Anh ta bày cho chúng tôi cách sửa lốp dần dần.", "eng": "He showed us how to repair the tyre by step."}, {"viet": "Anh ta nói về việc bản thân bị sa thải với một sự xúc động sâu sắc.", "eng": "He spoke feelingly about his dismissal."}, {"viet": "Hắn đã siết cổ giết bà ta bằng chính cái khăn quàng của bà ấy.", "eng": "He strangled her with her own scarf."}, {"viet": "Nó huênh hoang nhưng kỳ thực chẳng làm gì cả.", "eng": "He talks big but doesn't actually do anything."}, {"viet": "Anh ôm lấy cô ta trong tay và hôn cô.", "eng": "He took her in his arms and kissed her."}, {"viet": "Ông ta cố mường tượng đến một thế kỉ đã qua.", "eng": "He tried to vision himself in a past century."}, {"viet": "Hắn bước vào trong cửa hàng và thản nhiên đánh cắp một đôi găng tay.", "eng": "He walked into the shop and calmly stole a pair of gloves."}, {"viet": "Hắn cứ vòi tiền hoài vậy thôi.", "eng": "He was always asking for money."}, {"viet": "Anh ta bị tố cáo đã bí mật can dự vào âm mưu.", "eng": "He was charged with having been privy to the plot."}, {"viet": "Nó tràn đầy hối hận vì đã từ chối đến thăm cha mình đang hấp hối.", "eng": "He was filled with remorse for having refused to visit his dying father."}, {"viet": "Hắn bị hạ nốc ao ở hiệp hai.", "eng": "He was KO'd in the second round."}, {"viet": "Anh ta bị bêu riếu trên báo chí vì những việc anh ta đã làm.", "eng": "He was pilloried in the newspapers for what he had done."}, {"viet": "Anh ta nhìn chăm chăm ra phía những cánh đồng.", "eng": "He was staring out over the fields."}, {"viet": "Nó rất ngạc nhiên thấy chúng tôi ở đó.", "eng": "He was very much surprised to find us there."}, {"viet": "Anh ta đánh bại địch thủ của mình trong ba ván liền.", "eng": "He whupped his opponent in three straight sets."}, {"viet": "Anh ta chắc là bán hết của cải đã lâu nếu của cải đó không phải kế thừa theo thứ tự.", "eng": "He would have sold the property long ago had it not been entailed."}, {"viet": "Xin chào, chúng tôi lại trở về đây!", "eng": "Hello, it's us back again!"}, {"viet": "Những phẩm chất tốt nhất của cô ta hiện rõ trong một cơn khủng hoảng.", "eng": "Her best qualities come out in a crisis."}, {"viet": "Nợ của bà ta ngày càng chồng chất nên bà ta không có tiền trả.", "eng": "Her debts are piling up and she has no money to pay them."}, {"viet": "Người ta thấy bà ta hơi lãng tai.", "eng": "Her fearing was found to be slightly defective."}, {"viet": "Chồng cô ấy mất mười năm trước nhưng từ đó đến nay cô ấy đã tái giá.", "eng": "Her husband died ten years ago but she has since remarried."}, {"viet": "Số cô ta là số vất vả.", "eng": "Her lot has been a hard one."}, {"viet": "Tranh của bà ta được treo ở nhà trưng bày quốc gia.", "eng": "Her paintings hang in the National Gallery."}, {"viet": "Việc từ nhiệm của bà ta làm thay đổi quan điểm của mọi người về vấn đề đó.", "eng": "Her resignation puts a different complexion on things."}, {"viet": "Những người bạn cùng đội, cùng lớp, cùng chơi của cô ta.", "eng": "Her team-mates, class-mates, playmates."}, {"viet": "Đây là những chỉ dẫn đến nhà hàng.", "eng": "Here are the directions to the restaurant."}, {"viet": "Thành đạt của anh ta không được như hy vọng của anh ta.", "eng": "His achievements had fallen short of his hopes."}, {"viet": "Đức tin của ông trở thành một trong những tôn giáo lớn nhất toàn cầu-Đạo Khổng.", "eng": "His beliefs make up one of the world's great religions-Confucianism."}, {"viet": "Hạnh kiểm của anh ta quá tệ, hết chỗ nói.", "eng": "His conduct is so bad, it beggars all description."}, {"viet": "Sự bực tức của anh ấy vì bị ngắt quãng là có thể hiểu được.", "eng": "His exasperation at being interrupted was understandable."}, {"viet": "Hành vi ngu dại và rốt cuộc là thất bại của anh ta.", "eng": "His foolish behaviour and eventual failure."}, {"viet": "Căn bệnh của anh ấy đã làm anh ấy mất khả năng nói.", "eng": "His illness left him without the power of speech."}, {"viet": "Sự điên dại của hắn không ai có thể chữa nổi.", "eng": "His madness can not be cured."}, {"viet": "Phản ứng duy nhất của hắn ta là sự lặng thinh đầy ý nghĩa.", "eng": "His only reaction was a pregnant silence."}, {"viet": "Văn xuôi của anh ta có sáng kiến, mặc dù nó tuôn ra một cách khó khăn từ một xúc cảm bất ngờ bị ức chế.", "eng": "His prose has moxie, though it rushes and stumbles from a pent-up surge."}, {"viet": "Con ông ta đã cao lớn đến sáu bộ.", "eng": "His son is a giant of 6 feet already."}, {"viet": "Cách cư xử của anh ta đối với cô ấy thật quá sức chịu đựng.", "eng": "His treatment of her was beyond endurance."}, {"viet": "Ngài thị trưởng thành phố Chester.", "eng": "His Worship the Mayor of Chester."}, {"viet": "Tôi mong thế này không phải là lạm dụng lòng hiếu khách của anh, nhưng tôi có thể ở lại ăn bữa tối được không?", "eng": "Hope it's not imposing on your hospitality, but could I stay to dinner?"}, {"viet": "Làm sao tôi có thể tập trung được khi mọi người cứ nói chuyện suốt?", "eng": "How can I concentrate with everyone else talking?"}, {"viet": "Ở trường, bạn học hành như thế nào?", "eng": "How did you do in school?"}, {"viet": "Nước này làm sao so sánh ngang Thuỵ Sĩ được?", "eng": "How does this country compare with Switzerland?"}, {"viet": "Việc lắp đặt dây nói đó mất bao nhiêu thời gian?", "eng": "How long will the connection of the telephone take?"}, {"viet": "Anh chạy 50m mất mấy giây?", "eng": "How many seconds did it take you to run 50 meters?"}, {"viet": "Anh có được bao nhiêu tiền?", "eng": "How much money have you got?"}, {"viet": "Tuy nhiên, chúng tôi phải nhận được thư tín dụng của ông trước khi chúng tôi có thể tái xác nhận đơn đặt hàng.", "eng": "However, we should get your L/C before we can confirm the order."}, {"viet": "Tôi đã đặt một phòng ngắm được cảnh đẹp của thành phố.", "eng": "I'd like a room with a fine view of the city."}, {"viet": "Tôi thà là ở khách sạn xem tivi còn hơn là đi ra ngoài xem một phim như phim cao bồi.", "eng": "I'd rather stay at the hotel to watch TV than go out to a movie like Westerns."}, {"viet": "Tôi chỉ cần một tí kem sữa vào cà phê của tôi thôi.", "eng": "I'll have a wee drop of cream in my coffee."}, {"viet": "Tôi sẽ thay phiên ngồi lái.", "eng": "I'll take a turn at the steering-wheel."}, {"viet": "Tôi e rằng ông bấm nhầm số.", "eng": "I'm afraid you've got the wrong number."}, {"viet": "Tôi sẽ đến đó để làm việc vì có thị thực được làm vào ngày kỳ nghỉ.", "eng": "I'm going there to work on a working holiday visa."}, {"viet": "Trong này tôi nóng quá-làm ơn mở cửa sổ ra.", "eng": "I'm much too warm in here-please open the window."}, {"viet": "Tôi hơi lo sợ khi nghe tin anh dự định rời khỏi công ti.", "eng": "I'm rather alarmed to hear that you're planning lo leave the company."}, {"viet": "Tôi bị vướng với bà chị cả ngày.", "eng": "I'm stuck with my sister for the whole day."}, {"viet": "Tôi rất biết ơn vì anh đã đến tiễn tôi.", "eng": "I'm very grateful to you for coming to see me off."}, {"viet": "Dạo này con học Pháp văn chăm hơn, nhưng lại không đạt kết quả tốt hơn.", "eng": "I've been studying French harder these days, but I don't get any better."}, {"viet": "Tôi nảy ra một ý kiến, chúng ta ra bờ biển đi.", "eng": "I've had an inspiration let's go to the seaside."}, {"viet": "Tôi chỉ vừa mới được thông báo là anh ấy bị thải hồi.", "eng": "I've only just heard about his dismissal."}, {"viet": "Tôi đồng ý về thực chất với điều anh nói.", "eng": "I agree in substance with what you say."}, {"viet": "Tôi rất biết ơn khi có một người bạn như bạn.", "eng": "I am grateful to have a friend like you."}, {"viet": "Tôi đồng ý với cha mẹ tôi rằng chúng tôi có thể mượn xe hơi của họ.", "eng": "I arranged with parent that we could borrow their car."}, {"viet": "Tôi chắc chắn bố mẹ bạn rất sung sướng.", "eng": "I bet your parents are very happy,."}, {"viet": "Tôi không thể uống hơn nửa bình.", "eng": "I can't drink more than half a carafe."}, {"viet": "Tôi không thể chịu được cô ta hoặc những người bạn kiểu cách của cô.", "eng": "I can't stand her or her la-di-da friends."}, {"viet": "Tôi có thể chứng minh là anh đã ở trong thành phố-James đã trông thấy anh ở đó.", "eng": "I can prove that you were in town-James saw you there."}, {"viet": "Mắt này của tôi không nhìn thấy gì cả.", "eng": "I can't see out of this eye."}, {"viet": "Tôi có thể nhìn thấy một bóng người cao lớn ở cửa ra vào.", "eng": "I could see a tall figure near the door."}, {"viet": "Tôi muốn đi đến đó một lần nữa.", "eng": "I'd like to go there again."}, {"viet": "Tôi đã nói thẳng cho ông ta biết là tôi chẳng ưa gì ông ta cả.", "eng": "I didn't mince matters in telling him that I did not like him."}, {"viet": "Tôi thấy Peter không cởi mở lắm.", "eng": "I don't find Peter very communicative."}, {"viet": "Tôi không thích màu mà họ đã chọn cho tấm thảm mới của họ-nó trông thật là khó chịu.", "eng": "I don't like the colour they've chosen for their new carpet-it looks really nasty."}, {"viet": "Tôi không hiểu sự phân biệt của anh: chắc tranh nào cũng là nghệ thuật chứ?", "eng": "I don't understand your distinction: surely all painting is art?"}, {"viet": "Tôi không biết nhiều về thức ăn lắm.", "eng": "I don't know much about food."}, {"viet": "Tôi khoái phần đầu chuyến du lịch.", "eng": "I enjoyed the first part of the trip."}, {"viet": "Tôi thấy chui vào giường nằm là thoải mái nhất.", "eng": "I felt all cosy tucked up in bed."}, {"viet": "Tôi thấy khó có thể đồng cảm được với bất cứ nhân vật nào trong phim.", "eng": "I found it hard to identify with any of the characters in the film."}, {"viet": "Tôi đã tranh thủ làm vườn được một tiếng đồng hồ giữa hai trận mưa rào.", "eng": "I got in an hour's gardening between the showers."}, {"viet": "Tôi đã được cảnh cáo không được đến thăm cô ta khi cô ta còn chưa được khoẻ.", "eng": "I had been warned off visiting her while she was still unwell."}, {"viet": "Tôi ghét việc người ta nói chuyện khi xem phim.", "eng": "I hate it when people talk during a movie."}, {"viet": "Tôi đã bị mất cắp cái đồng hồ.", "eng": "I have had my watch stolen."}, {"viet": "Tôi có vài cái áo sơ mi cần được ủi.", "eng": "I have some shirts to be ironed."}, {"viet": "Tôi chưa thật quen với công việc mới của tôi.", "eng": "I haven't really got into my new job yet."}, {"viet": "Tôi nghe nói kì thi học ngành luật ở Mỹ thì dễ.", "eng": "I heard that the bar exam is easy in the United States."}, {"viet": "Tôi mong ông thấy vui khi ở Trung Quốc.", "eng": "I hope you can have a very pleasant time in China."}, {"viet": "Tôi biết ông ấy đang tức và không thể giáp mặt ông ấy.", "eng": "I knew he was angry and could not face him."}, {"viet": "Tôi cho anh ta mượn 5 bảng Anh với điều kiện là anh ta sẽ trả cho tôi trong ngày hôm nay.", "eng": "I lent him £ 5 on the understanding that he would repay me today."}, {"viet": "Tôi sẽ trở về vào tuần tới, mong được như vậy.", "eng": "I'll back next week, god willing."}, {"viet": "Tôi sẽ dùng món súp cá.", "eng": "I'll have the fish soup."}, {"viet": "Tôi mất thăng bằng và ngã khi tôi đi trên băng.", "eng": "I lost my balance and fell when I was walking on the ice."}, {"viet": "Tôi rất vui là có thể giúp được cho anh.", "eng": "I'm glad I was able to help."}, {"viet": "Tôi không chắc là tôi hiểu đầy đủ.", "eng": "I'm not sure that I fully understand."}, {"viet": "Tôi thành thật xin lỗi vì sai sót này.", "eng": "I'm very sorry for the mistake."}, {"viet": "Tôi phải nhờ bạn đi cùng với tôi đến trạm cảnh sát.", "eng": "I must ask you to accompany me to the police station."}, {"viet": "Tôi vẫn cứ cần phải nói với anh rằng công việc này nguy hiểm.", "eng": "I need hardly tell you that the work is dangerous."}, {"viet": "Tôi thường đi dự những khóa học hè tại nơi cư trú.", "eng": "I often go on residential summer courses."}, {"viet": "Tôi thích làm việc đó một mình.", "eng": "I prefer to work on it alone."}, {"viet": "Bây giờ tôi phải về nhà thôi.", "eng": "I really must be getting home in moment."}, {"viet": "Tôi từ chức vào thứ Sáu và ra đi vào cùng ngày đó.", "eng": "I resigned on Friday and left that same day."}, {"viet": "Tôi biết anh 21 tuổi, đã tốt nghiệp Đại học Quản trị Kinh doanh vào tháng 7 vừa qua.", "eng": "I see that you're twenty-one and graduated from the Business Administration University last July."}, {"viet": "Phải nói là tôi bị nó mê hoặc.", "eng": "I should say I'm charmed by it."}, {"viet": "Tôi yêu cầu phải có bảo chứng đầy đủ.", "eng": "I submit that full proof should be required."}, {"viet": "Tôi nghĩ quần áo của anh ấy rất sinh động.", "eng": "I think his outfits are so dynamic."}, {"viet": "Tôi nghĩ người đàn ông đó là nhân viên cứu hỏa.", "eng": "I think that man is a fireman."}, {"viet": "Tôi cứ ngỡ tôi bị lỡ xe buýt nhưng không.", "eng": "I thought that I'd missed the bus but I hadn't."}, {"viet": "Tôi cố gắng nói với bà ấy nhưng bà ấy phớt lờ tôi đi.", "eng": "I tried to tell her but she ignored me."}, {"viet": "Thật sự thì tôi chưa bao giờ chơi gôn giỏi cả.", "eng": "I've never really been good at golf."}, {"viet": "Tôi muốn nhờ giặt lại chúng.", "eng": "I want to have them washed again."}, {"viet": "Tôi bực tức khi biết chúng nó đi mà bỏ tôi lại.", "eng": "I was annoyed to find they had left without me."}, {"viet": "Tôi vô cùng đau khổ mãi cho đến khi tôi biết cô ta vẫn còn sống.", "eng": "I was in anguish until I knew she was still alive."}, {"viet": "Tôi mệt quá đến nỗi ngủ trên xe buýt.", "eng": "I was so tired that I fell asleep on the bus."}, {"viet": "Tôi xem phim và đã khóc suốt.", "eng": "I watched the film and cried throughout."}, {"viet": "Tôi mong cô ấy không lao vào một cách thô bạo như vậy.", "eng": "I wish she wouldn't barge in like that."}, {"viet": "Tôi không biết bạn có muốn đi xem phim với tôi không?", "eng": "I wonder if you would like to come to the movies with me?"}, {"viet": "Tôi muốn hủy thẻ của tôi.", "eng": "I would like to cancel my card."}, {"viet": "Nếu tôi không tận mắt nhìn thấy thì có lẽ tôi đã không tin là chuyện đó có thể xảy ra được.", "eng": "I wouldn't have believed it possible, if I hadn't seen it happen."}, {"viet": "Nếu như Gutenberg, Schoeffer và Caxton tới một cơ sở in sách ngày nay, chắc hẳn họ rất kinh ngạc trước những thay đổi của ngành in, đóng sách.", "eng": "If Gutenberg and Schoeffer and Caxton could wander into one of our great book-making establishments of today, they would certainly be amazed at the changes that have taken place in book-making."}, {"viet": "Nếu thấy cần thiết, chúng ta sẽ phải sử dụng đến số tiền tiết kiệm.", "eng": "If it comes to the push, we shall have to use our savings."}, {"viet": "Nếu không có ý kiến phản đối, ông Milton sẽ tiếp tục phác thảo những nét chính của chiến dịch.", "eng": "If there are no objections, Mr. Milton will proceed to outline the campaign."}, {"viet": "Nếu anh có nhiều điều rắc rối như tôi trong đời thì anh cần phải là người có một chút quan điểm triết học.", "eng": "If you've had as much trouble as I've had in my life, you need to be a bit of a philosopher."}, {"viet": "Nếu mày không câm đi, tao sẽ quật cho mày một trận.", "eng": "If you don't shut up, I'll belt you."}, {"viet": "Nếu anh chất quá nhiều than lên lửa ngay một lúc, anh sẽ làm tắt lửa.", "eng": "If you put too much coal on the fire at once you'll smother it."}, {"viet": "Nếu hành lý của ông quá trọng lượng quy định, ông phải trả thêm tiền.", "eng": "If your luggage is overweight you'll have to pay extra."}, {"viet": "Tháng tám, nơi này khách du lịch đông nghịt.", "eng": "In August the place is lousy with tourists."}, {"viet": "Trong cuốn sách mới đây của mình, ông ấy viết là thuyết đó đã được chứng minh là sai.", "eng": "In his latest book, he writes that the theory has been disproved."}, {"viet": "Trong môn bóng đá, chỉ người thủ môn mới được phép chơi bóng bằng tay.", "eng": "In soccer, only the goal-keeper may play the ball with his hands."}, {"viet": "Vì thời gian có hạn, tôi xin tóm lược những quan điểm của tôi.", "eng": "In the interests of brevity, I will summarize my views."}, {"viet": "Trong chiến tranh, cuộc đời người lính đầy những hiểm nguy.", "eng": "In war, a soldier's life is full of danger."}, {"viet": "Đầu tư vào công nghiệp là bỏ tiền vào đúng chỗ.", "eng": "Investing in industry is money well spent."}, {"viet": "Thành công phải chăng chỉ là vấn đề làm việc tích cực?", "eng": "Is success simply a matter of working hard?"}, {"viet": "Dự báo thời tiết có nói trời sẽ mưa không?", "eng": "Is there rain in the forecast?"}, {"viet": "May quá có anh ở đây giúp tôi.", "eng": "It's a good job you were here to help me."}, {"viet": "Vào mùa hè ở đây trời đẹp.", "eng": "It's beautiful here in summertime."}, {"viet": "Thật là sung sướng được trở lại cuộc sống văn minh sau hai tuần sống trong lều!", "eng": "It's good to get back to civilization after living in a tent for two weeks!"}, {"viet": "Có chai ở tay của anh chẳng có gì là xấu.", "eng": "It's no disgrace to have calluses on your hands."}, {"viet": "Đi tắt qua cánh đồng là nhanh nhất-đi vòng theo đường cái lâu hơn nhiều.", "eng": "It's quickest to walk across the field-going round by road takes much longer."}, {"viet": "Bây giờ thì đã quá muộn để rút lui ( khỏi sự thoả thuận mua bán ).", "eng": "It's too late to back out ( of the deal ) now."}, {"viet": "Nó bao gồm tiền kim loại đang hiện hành.", "eng": "It consists of the coins that are in current circulation."}, {"viet": "Điều tuyệt đối quan trọng là vấn đề phải được giữ bí mật.", "eng": "It is absolutely vital that the matter is kept secret."}, {"viet": "Tôi rất hân hạnh được chào mừng bà ấy trở lại.", "eng": "It is my pleasure to welcome her back."}, {"viet": "Chuyện đó thật sự không tiến triển.", "eng": "It isn't really working out."}, {"viet": "Nó hơi cay nhưng ngon lắm!", "eng": "It's a little spicy but delicious!"}, {"viet": "Tòa nhà ở ngay đằng kia kìa.", "eng": "It's that building right over there."}, {"viet": "Chắc chắn sẽ rất hay khi có thiết bị mới đó.", "eng": "It sure will be nice to have that new equipment."}, {"viet": "Anh gợi ý một điều như thế là vô lý.", "eng": "It was absurd of you to suggest such a thing."}, {"viet": "Thật là vui khi được nói chuyện với bạn.", "eng": "It was nice talking to you."}, {"viet": "Anh rất tinh ý đã nhận ngay ra chi tiết đó.", "eng": "It was very sharp of you to notice that detail straight away."}, {"viet": "Nền kinh tế Ý đã vượt qua được nền kinh tế các đối thủ gần nhất.", "eng": "Italy's economy has overtaken that of its nearest competitors."}, {"viet": "John gọi điện cho tôi vào một ngày của tuần trước.", "eng": "John's telephoned me one day last week."}, {"viet": "Ấm một cách dễ chịu, không lạnh quá cũng không nóng quá.", "eng": "Just pleasantly warm neither too cold nor too hot."}, {"viet": "Sương giá muộn làm tan nát cả khu vườn.", "eng": "Late frosts are ruination for the garden."}, {"viet": "Chúng ta hãy bắt đầu bài học hôm nay nhé.", "eng": "Let's begin today's lesson."}, {"viet": "Diễn giả bắt đầu nói, Kính thưa bà chủ toạ, kính thưa quý vị.", "eng": "Madam Chairman, ladies and gentlemen, began the speaker."}, {"viet": "Nhiều người đã bảo cô ấy đừng cố, ấy thế mà cô ấy vẫn cứ xông lên trước.", "eng": "Many people told her not to try, but she went ahead notwithstanding."}, {"viet": "Mass là dạng viết tắt của Massachusetts.", "eng": "Mass is the abbreviation of Massachusetts."}, {"viet": "Cháu có thể sử dụng séc du lịch được không?", "eng": "May I use traveler's checks?"}, {"viet": "Phần lớn những vụ mất tích là kết quả của hoạt động khủng bố.", "eng": "Most disappearances are the result of terrorist activity."}, {"viet": "Ông Thomas à, cho phép tôi được giới thiệu bạn tôi, Mary Jones.", "eng": "Mr. Thomas, let me introduce my friend, Mary Jones."}, {"viet": "Sự tính toán của tôi dựa trên những con số phỏng chừng, vì những số liệu thực tế chưa có được.", "eng": "My calculation is based on notional figures, since the actual figures are not yet available."}, {"viet": "Kiểu cắm hoa của tôi cần thêm lá.", "eng": "My flower arrangement needs more foliage."}, {"viet": "Người hàng xóm tôi mặc áo choàng ngủ đi làm việc.", "eng": "My neighbour wears his dressing-gown to work."}, {"viet": "Cái đồng hồ của tôi có cái gì nhỏ mà nó chỉ giờ.", "eng": "My watch has a little thingumbob that shows the time."}, {"viet": "New York là nơi có nhiều dân tộc khác nhau sống.", "eng": "New York is a melting pot of different nationalities."}, {"viet": "Vâng, cháu gái tôi sống với tôi, và tất nhiên Troy đã từng sống ở đây.", "eng": "No, my granddaughter lives with me, and of course Troy used to live here."}, {"viet": "Không ai biết bà ta đã giàu có lên như thế nào.", "eng": "Nobody knew how she had acquired her wealth."}, {"viet": "Anh có thể lái xe lấy vì anh đã đỗ kỳ sát hạch.", "eng": "Now you've passed your test you can drive on your own."}, {"viet": "Ồ, giờ thì chuyện đó không quan trọng.", "eng": "Oh, it doesn't matter now."}, {"viet": "Thay mặt tất cả những vị khách của ông ở đây, tôi xin cám ơn ông đã dành bữa đại tiệc này cho chúng tôi.", "eng": "On behalf of all of your guests here, I wish to thank you for giving us this banquet."}, {"viet": "Người ta ngỡ rằng những lời tuyên bố đó không đúng sự thật.", "eng": "One doubts the veracity of such statements."}, {"viet": "Chỉ có một thành viên của hội đồng là có ý kiến khác với báo cáo tổng kết.", "eng": "Only one member of the committee dissented from the final report."}, {"viet": "Các trường hợp khẩn cấp của chúng tôi thường có nghĩa là chiến đấu.", "eng": "Our emergencies usually mean a battle."}, {"viet": "Sản phẩm mới của chúng tôi sẽ giữ phòng tắm của quý vị sạch sẽ và không hôi hám.", "eng": "Our new product will keep your bathroom clean and odorless."}, {"viet": "Cuộc đến thăm của chúng tôi là không phải lúc, mẹ tôi đã có khách.", "eng": "Our visit was ill-timed, my mother had guests already."}, {"viet": "Hành khách cần làm thủ tục ghi tên chuyến máy bay BA 125 đi Béclin.", "eng": "Passengers should check in for flight BA 125 to Berlin."}, {"viet": "Trước đây người ta nghĩ rằng quả đất dẹt, bây giờ chúng ta biết quả đất tròn.", "eng": "People used to think that the world was flat, now we know it is round."}, {"viet": "Vui lòng cho tôi xem những xâu chuỗi ngọc trai kiểu mới nhất của cô.", "eng": "Please show me your latest-style pearl necklaces."}, {"viet": "Hôm nay có khả năng mưa ở mọi miền của đất nước.", "eng": "Rain is likely in all parts of the country today."}, {"viet": "Nước biển có thể làm thành nước uống được bằng cách cất lọc muối.", "eng": "Sea-water can be made drinkable by distilling out the salt."}, {"viet": "Chia đều 100 pao cho năm người.", "eng": "Share 100 pounds equally between five people."}, {"viet": "Cô ấy luôn luôn gây phiền toái cho bạn bè của cô ấy.", "eng": "She's always making trouble for her friends."}, {"viet": "Bà ấy cho tôi toàn quyền điều hành công việc trong thời gian bà ấy đi vắng.", "eng": "She's given me a completely freehand to manage the business during her absence."}, {"viet": "Cô ta không lạc quan về kết quả đó.", "eng": "She's not optimistic about the outcome."}, {"viet": "Cô ta là con người quá quy tắc không thể mặc những bộ quần áo lố lăng.", "eng": "She's too much of a conformist to wear silly clothes."}, {"viet": "Cô ấy và tôi là người cùng thời với nhau ở trường cao đẳng.", "eng": "She and I were contemporaries at college."}, {"viet": "Cô ấy không thể làm được loại việc đó, cô ấy chỉ là một đứa trẻ.", "eng": "She can't do that sort of work-she's a mere child."}, {"viet": "Cô ta thấy tương lai quá mù mịt nên đã tự tử bằng hơi độc.", "eng": "She couldn't face the future, and gassed herself."}, {"viet": "Cô ấy chết vì một tai nạn giữa tuổi hoa niên.", "eng": "She died of an accident when in full bloom."}, {"viet": "Cô ấy cảm thấy đỡ hơn hôm qua một ít.", "eng": "She feels a shade better than yesterday."}, {"viet": "Bà ta tán thành kế hoạch nhưng không phải không có nhiều sự dè dặt.", "eng": "She gave her approval to the scheme but not without several qualifications."}, {"viet": "Bà ấy có một kho đầy thực phẩm dự trữ.", "eng": "She had a plentiful store of provisions."}, {"viet": "Cô ta ứng đối nhanh trí.", "eng": "She has a mercurial turn of conversation."}, {"viet": "Cô ấy đã thử nhiều loại thức ăn làm giảm cân nhưng cô ấy vẫn béo.", "eng": "She has tried lots of different fad diets but she is still fat."}, {"viet": "Cô ta giỏi nhưng công việc của cô thiếu tổ chức.", "eng": "She is brilliant but her work lacks organization."}, {"viet": "Cô ta không giàu, và tôi cũng không hình dung được là bao giờ thì cô sẽ giàu.", "eng": "She isn't rich, nor do I imagine that she ever will be."}, {"viet": "Bà ta đã sống ở nông thôn suốt cả cuộc đời mình.", "eng": "She lived her whole life in the country."}, {"viet": "Bà ta kiếm sống bằng cách cho người ta ở trọ.", "eng": "She makes a living by taking in lodgers."}, {"viet": "Cô ấy mở cửa một chút hết hơi vì leo cầu thang.", "eng": "She opened the door, a little breathless from climbing the stairs."}, {"viet": "Cô ta đã xuất bản quyển sách đầu tiên năm ngoái và giờ đây đã viết quyển thứ hai.", "eng": "She published her first book last year, and has now written a second."}, {"viet": "Chị ấy mài tròn các góc bàn bằng giấy ráp.", "eng": "She rounded off the corners of the table with sandpaper."}, {"viet": "Cô ấy có thể được thăng chức.", "eng": "She's in line for promotion."}, {"viet": "Bà ta nói rằng bà không làm theo lệnh của một thư ký cấp dưới.", "eng": "She said she wouldn't take orders from a junior clerk."}, {"viet": "Bà ta nhỏ những giọt nước mắt cá sấu khi sa thải anh ta.", "eng": "She shed crocodile tears when she dismissed him from his job."}, {"viet": "Cô ta càng ngày càng bỏ nhiều thời gian ở một mình trong phòng.", "eng": "She spends more and more time alone in her room."}, {"viet": "Bà ta cầm một tờ báo cuộn lại đét vào đít nó.", "eng": "She swatted him on the bottom with a rolled-up newspaper."}, {"viet": "Cô ta coi những người nghiện thuốc lá là đồ cặn bã của trái đất.", "eng": "She treats smokers like the scum of the earth."}, {"viet": "Chị ấy muốn bay một mình qua Đại Tây Dương.", "eng": "She wanted to fly solo across the Atlantic."}, {"viet": "Cô ta bị một con chó dại gây thương tích nặng.", "eng": "She was badly savaged by a mad dog."}, {"viet": "Nàng ăn mặc xong xuôi trong năm phút.", "eng": "She was fully dressed in five minutes."}, {"viet": "Nàng bị ám ảnh bởi ý tưởng là có ai đang theo dõi nàng.", "eng": "She was obsessed with the idea that she was being watched."}, {"viet": "Tại buổi họp mặt, người ta rất nhớ bà ta.", "eng": "She was sorely missed at the reunion."}, {"viet": "Cô ấy đang thắng một cách dễ dàng, nhưng rồi cô ấy bắt đầu không thận trọng và để cho đối thủ của cô ấy vượt qua được khó khăn.", "eng": "She was winning easily, but then she started to get careless and let her opponent off the hook."}, {"viet": "Cô ta ước gì mình được ở nhà.", "eng": "She wished she had stayed at home."}, {"viet": "Cô ấy không muốn nói cho tôi biết qua điện thoại.", "eng": "She wouldn't tell me over the phone."}, {"viet": "Cho anh ta vào! Dạ được thưa bà.", "eng": "Show him in! As you say, madam."}, {"viet": "Từ ngày chung lớp anh ta đã cảm thấy hết sức quyến luyến cô ấy.", "eng": "Since their schooldays he had felt a strong attachment for her."}, {"viet": "Đi trượt lảo đảo nguy hiểm trên con đường lầy lội.", "eng": "Slithering dangerously on the muddy path."}, {"viet": "Vì vậy bạn nên sử dụng một số chi phiếu du lịch khi bạn đi du lịch, đặc biệt nếu bạn dự định mang theo rất nhiều tiền.", "eng": "So, it's advised that you use some traveller's checks when you travel, especially if you intend to carry a great deal of money."}, {"viet": "Đất đã bị cứng vì khí hậu khắc nghiệt.", "eng": "Soil that had been indurated by extremes of climate."}, {"viet": "Vài kim loại dễ hàn hơn những kim loại khác.", "eng": "Some metals weld better than others."}, {"viet": "Vài con đường bị tắc nghẽn do những đống tuyết.", "eng": "Some roads are closed owing to drifting."}, {"viet": "Điều gì không vì lợi ích chung.", "eng": "Something that is not in the public interest."}, {"viet": "Nói được ngôn ngữ đó trôi chảy làm cho chúng ta dễ tiến bộ.", "eng": "Speaking the language fluently certainly smoothed our path."}, {"viet": "Bắt đầu từ ngày mai, bố sẽ mang theo phần ăn trưa cho mình.", "eng": "Starting tomorrow I will bring my own lunch."}, {"viet": "Đừng có cằn nhằn nữa! Cậu chả có gì phải kêu ca cả.", "eng": "Stop grumbling! You've got nothing to complain about."}, {"viet": "Sinh viên đại học năm thứ nhất.", "eng": "Students in their first year at college."}, {"viet": "Những vấn đề như vậy không nên bỏ qua một cách nhẹ nhàng.", "eng": "Such problems should not be passed over lightly."}, {"viet": "Chắc là tôi đã gặp anh ở đâu trước đây rồi.", "eng": "Surely I've met you before somewhere."}, {"viet": "Hãy hết sức chú ý để làm chuyện đó cho đúng đắn.", "eng": "Take great care to do it properly."}, {"viet": "Các giáo viên tiết lộ cho báo chí biết rằng họ sẽ có hành động gì.", "eng": "Teachers revealed to the press what action they were taking."}, {"viet": "Bọn khủng bố, từ những vị trí kín nhất đang bắn tỉa vào các binh lính.", "eng": "Terrorists are sniping at soldiers from well-concealed positions."}, {"viet": "Đó là câu chuyện của tôi và tôi sẽ vẫn nói như thế.", "eng": "That's my story and I'm sticking to it."}, {"viet": "Nước đó còn đang lạc hậu nhiều hơn so với Châu Âu.", "eng": "That country is much in arrear of Europe."}, {"viet": "Dòng đó không nằm trong kịch bản.", "eng": "That line isn't in the script."}, {"viet": "Đó là một luật lệ tốt nên chấp hành.", "eng": "That's a good rule to go by."}, {"viet": "Thật là hút chết! Suýt nữa chúng tôi đâm phải chiếc xe kia.", "eng": "That was a close thing! We nearly hit the other car."}, {"viet": "Tai nạn xảy ra khi tàu hoả đang tới gần Winchester.", "eng": "The accident happened as the train was approaching Winchester."}, {"viet": "Lập trường của chính quyền về thuế là dứt khoát mặc dù có phản ứng không thuận lợi của dân chúng.", "eng": "The administration position on taxes was set in cement despite the unfavourable public response."}, {"viet": "Người Mỹ chọn ông Bush làm tổng thống.", "eng": "The Americans choose Mr. Bush as president."}, {"viet": "Bọn đầu cơ thị trường lại tiến hành công việc, mua các công ty ầm ầm.", "eng": "The arbs are at it again, buying up companies like hot cakes."}, {"viet": "Kiệt tác của người nghệ sĩ được trưng bày ở triển lãm tranh.", "eng": "The artist's masterpiece was on exhibition at the art gallery."}, {"viet": "Chính quyền cấp giấy chứng nhận cho xây lại kho hàng là tốt.", "eng": "The authorities gave the rebuilt ware-house a clean bill of health."}, {"viet": "Quả bóng đi qua ngay chỗ nó-thật là một cú bắt trượt tồi tệ.", "eng": "The ball's gone right past him-that was a bad miss."}, {"viet": "Nền tảng của đạo đức, tình bạn v. v.", "eng": "The basis of morality, friendship, etc."}, {"viet": "Điều may mắn nhất mà chúng ta có thể hy vọng là đừng ai bị giết.", "eng": "The best we can hope for is that nobody gets killed."}, {"viet": "Cú đánh đã làm cho anh ta bất tỉnh.", "eng": "The blow caused him to lose consciousness."}, {"viet": "Cuốn sách đó có khả năng đoạt giải.", "eng": "The book is a probable for the prize."}, {"viet": "Bài làm của cậu bé ở trường trên trung bình.", "eng": "The boy's work at school is above average."}, {"viet": "Chiếc cầu rung lên khi còn tàu chạy nhanh qua.", "eng": "The bridge trembled as the train sped across it."}, {"viet": "Công ty xe buýt đã cung cấp thêm xe buýt vì số lượng hành khách quá nhiều.", "eng": "The bus company provided extra buses because there were so many people."}, {"viet": "Sức chịu đựng của thuỷ tinh đối với sức nóng.", "eng": "The capability of glass in resisting heat."}, {"viet": "Chiếc xe ôtô hình như cứ chạy lệch về bên trái.", "eng": "The car seems to be pulling to the left."}, {"viet": "Chiến thuật mèo vờn chuột của những người hỏi cung.", "eng": "The cat and mouse tactics of the interrogators."}, {"viet": "Người thách thức đã luyện tập rất hăng để chuẩn bị cho cuộc đọ sức lớn.", "eng": "The challenger has been training hard for the big fight."}, {"viet": "Đứa trẻ đó không vâng lời cha mẹ nó và đi xem phim sau khi tan trường.", "eng": "The child defined his parents and went to the cinema after school."}, {"viet": "Bọn trẻ con hôm nay ngoan quá đỗi, Tôi nghĩ chắc là chúng lại đang giở trò gì đây.", "eng": "The children are being too good today, I think there's some monkey business going on."}, {"viet": "Bọn học sinh chuồn khỏi trường và trốn ra công viên.", "eng": "The children sneaked out of school and went to the park."}, {"viet": "Nhà thờ ở gần trường học.", "eng": "The church is close to the school."}, {"viet": "Những người leo núi trên một gờ đá khuất nhô ra từ vách núi.", "eng": "The climbers rested on a sheltered ledge jutting out from the cliff."}, {"viet": "Có lẽ cái vòng đeo cổ cũng ở đó.", "eng": "The collar should also be there."}, {"viet": "Đĩa com-pắc là một điều kỳ diệu của công nghệ hiện đại.", "eng": "The compact disc is a miracle of modern technology."}, {"viet": "Công ty muốn đặt cơ quan của mình ở phía Bắc.", "eng": "The company wants to situate its headquarters in the north."}, {"viet": "Hiến pháp không bảo chúng ta không được tin vào Thượng đế.", "eng": "The Constitution doesn't say we can't believe in God."}, {"viet": "Hội đồng đã dùng sức ép đối với chủ đất để ông ấy phải cải thiện lại khu đất của mình.", "eng": "The council brought pressure to bear on the landlord to improve his property."}, {"viet": "Toà án phạt hắn phải bồi thường 10.000 bảng Anh.", "eng": "The court awarded him damages for 10.000."}, {"viet": "Đám đông vỗ tay tán thưởng anh ta suốt năm phút.", "eng": "The crowd applauded him for five minutes."}, {"viet": "Tục lệ những phu nhân trẻ được giới thiệu với triều đình không còn nữa.", "eng": "The custom of young ladies being presented at court has disappeared."}, {"viet": "Số người chết trong trận động đất tăng lên.", "eng": "The death toll in the earthquake is rising."}, {"viet": "Phòng này tổ chức rất tồi mãi cho đến khi bà ta nhận nó.", "eng": "The department was badly organized until she took charge."}, {"viet": "Toa xe ăn được nối tiếp vào ( toa xe hành khách cuối cùng ).", "eng": "The dining-car was coupled on ( to the last coach )."}, {"viet": "Sự điều trị của ông bác sĩ đem lại những kết quả kỳ diệu: bệnh nhân đã hoàn toàn khỏi.", "eng": "The doctor's treatment has worked marvels: the patient has recovered completely."}, {"viet": "Phim tài liệu đen trắng.", "eng": "The documentary was in black and white."}, {"viet": "Dù cho mọi cố gắng, cửa vẫn không thể mở được.", "eng": "The door defied all attempts to open it."}, {"viet": "Bà công tước cho phép người hầu lui ra trước sự hiện diện của bà ấy.", "eng": "The duchess dismissed the servant from her presence."}, {"viet": "Cuộc vận động bầu cử lên đến đỉnh điểm của nó tối qua với cuộc tranh luận được truyền hình giữa hai ứng cử viên.", "eng": "The election campaign reached its climax last night, with a televised debate between the two candidates."}, {"viet": "Eo biển Măng xơ ở giữa Pháp và Anh.", "eng": "The English Channel is between France and England."}, {"viet": "Mức độ khác biệt về tiến hóa trong một loài.", "eng": "The evolutionary variance within a species."}, {"viet": "Tầm quan trọng ngoài âm nhạc của nhạc kịch.", "eng": "The extra musical importance of the opera."}, {"viet": "Người nông dân làm việc vất vả cả ngày trên cánh đồng của mình.", "eng": "The farmer toiled in his field all day."}, {"viet": "Thực ra thì phim bắt đầu lúc 3 giờ chứ không phải 4 giờ.", "eng": "The film actually starts at 3 o'clock, not 4."}, {"viet": "Lính cứu hoả đã nhấc bổng cậu bé lên vai anh ta.", "eng": "The fireman hoisted the boy onto his shoulders."}, {"viet": "Lần đầu tiên tôi nghe về chuyện công ty đóng cửa chính là khi George nói cho tôi biết.", "eng": "The first I heard about the film closing down was when George told me."}, {"viet": "Những bụi cây nở hoa có màu đỏ sáng rực rỡ.", "eng": "The flowering shrubs were a scarlet flame."}, {"viet": "Bốn hình nhân là một bé trai, một người trung niên, một cụ già và một bộ xương người.", "eng": "The four jacks were figures of a little boy, a middle-aged man, an old man, and a skeleton."}, {"viet": "Những người canh vườn thú đã dùng mũi tên tẩm thuốc để gây mê cho con tê giác.", "eng": "The game wardens tranquillized the rhinoceros with a drugged dart."}, {"viet": "Việc cung cấp rộng rãi nhưng không lo xa của những năm 1960.", "eng": "The generous but improvident welfare provision of the 1960s."}, {"viet": "Số hàng đặt ngày 4 tháng sáu đã được tàu Son of Apollo vận chuyển, chuyến tàu đó khởi hành từ Mỹ vào ngày hôm kia.", "eng": "The goods ordered on June 4 have now been shipped by Son of Apollo, which sailed from U. S. A the day before yesterday."}, {"viet": "Chính phủ đã viện dẫn Luật bảo vệ bí mật Nhà nước để cấm cuốn sách.", "eng": "The government has invoked the Official Secrets Act in having the book banned."}, {"viet": "Chính phủ kế tục chế độ quân chủ bị sụp đổ.", "eng": "The government successive to the fallen monarchy."}, {"viet": "Sự tham lam của những công ty lớn muốn nuốt chửng những công ty cạnh tranh nhỏ hơn của họ.", "eng": "The greed with which large companies swallow up their smaller competitors."}, {"viet": "Người khách trọ muốn đưa vợ mình đến một nơi nào đó đặc biệt để ăn tối.", "eng": "The guest would like to take his wife somewhere special for dinner."}, {"viet": "Cái nóng ở vùng nhiệt đới có thể rất khó chịu.", "eng": "The heat in the tropics can be oppressive."}, {"viet": "Khí thế ban đầu của Chính phủ mới đã hết và bây giờ họ phải bắt tay vào việc giải quyết nhiều vấn đề khó khăn của đất nước.", "eng": "The honeymoon period for the new government is over and they must now start to tackle the country's many problems."}, {"viet": "Khách sạn này trước đây là tư gia.", "eng": "The hotel was formerly a private house."}, {"viet": "Những ngôi nhà bị ảnh hưởng trực tiếp nhất bởi xa lộ.", "eng": "The houses most immediately affected by the motorway."}, {"viet": "Nhà xuất khẩu yếu cầu ngân hang thiết lập một thư tín dụng để trả cho nhà xuất khẩu.", "eng": "The importer asked the bank to establish a letter of credit in favour of the exporter."}, {"viet": "Những nơi sâu thẳm trong rừng.", "eng": "The innermost depths of the forest."}, {"viet": "Vấn đề đó đã sản sinh ra nhiều thư từ hơn bất cứ bài báo chính nào trong tạp chí trước đây.", "eng": "The issue generated more letters than any previous cover story."}, {"viet": "Toà án kết án hẳn một năm tù.", "eng": "The judge sentenced him to a year in prison."}, {"viet": "Các thú vật trong phòng thí nghiệm đã được cho nhiễm loại vi trùng đó.", "eng": "The laboratory animals had been infected with the bacteria."}, {"viet": "Những thông báo giá thị trường mới nhất của Sở giao dịch chứng khoán.", "eng": "The latest quotations from the Stock Exchange."}, {"viet": "Các chân bàn được gắn cao su.", "eng": "The legs of the table were tipped with rubber."}, {"viet": "Các dòng này tạo thành đoạn mở đầu cho bài trường ca kể chuyện của anh ấy.", "eng": "The lines form a prelude to his long narrative poem."}, {"viet": "Tình hình mất việc làm được một số người coi là một điều xấu nhưng tất yếu phải làm để chống lạm phát.", "eng": "The loss of jobs is regarded by some as a necessary evil in the fight against inflation."}, {"viet": "Chủ đề của cuốn sách khó hiểu do tác giả thường xuyên lạc đề.", "eng": "The main theme of the book is obscured by frequent digressions."}, {"viet": "Chỉ số giá cả lên cao chưa từng thấy lần thứ hai.", "eng": "The market indexes have a reached astronomical heights for the second time."}, {"viet": "Thuốc đó thật là đáng sợ, tôi không tài nào nuốt xuống được.", "eng": "The medicine was so horrible, I could hardly get it down."}, {"viet": "Quân đội đã siết chặt sự kiểm soát đất nước.", "eng": "The military has tightened its hold on the country."}, {"viet": "Đạo lí ngày nay hình như là kiếm được tiền càng nhiều càng tốt bất chấp kiếm được bằng cách nào.", "eng": "The modern ethic seem to be to get as much money as you can without worrying how you get it."}, {"viet": "Là người nhạy bén nhất trong ba người, cô ta là người đầu tiên nhận ra được sự nguy hiểm tiềm tàng trong hoàn cảnh của họ.", "eng": "The most perceptive of the three, she was the first to realize the potential danger of their situation."}, {"viet": "Âm nhạc đó bản thân nó không tốt lắm nhưng nó cũng được giúp đỡ tạo nên một không khí thích hợp.", "eng": "The music per se was not very good but it did hel to create the right atmosphere."}, {"viet": "Cậu bé mới đến bị lột quần và quẳng xuống đài phun nước.", "eng": "The new boy was debagged and thrown into the fountain."}, {"viet": "Vị sĩ quan mới chẳng bao lâu đã chiếm được lòng kính trọng của binh sĩ mình.", "eng": "The new officer soon won the respect of his men."}, {"viet": "Tin xảy ra tai nạn đã làm cho cô ta sững sờ choáng váng.", "eng": "The news of the accident gave her an unpleasant jolt."}, {"viet": "Những người Norman cai trị nước Anh do chiếm đoạt.", "eng": "The Normans ruled England by right of conquest."}, {"viet": "Chất dinh dưỡng trong đất là một tác nhân kích thích sự phát triển.", "eng": "The nutrient in the soil acts as a stimulus to growth."}, {"viet": "Những người già cảm thấy lạnh hơn những người trẻ khi trời lạnh.", "eng": "The old feel the cold weather more than the young."}, {"viet": "Vật duy nhất không bị bán cả gói cùng với ngôi nhà là chiếc đàn pianô này.", "eng": "The only thing which had not been sold lock, stock, and barrel with the house was this piano."}, {"viet": "Đủ loại đề tài về đua tranh, bạo lực và hỗn loạn.", "eng": "The overarching themes of race, violence and disorder."}, {"viet": "Thành tích nghèo nàn của đảng trong cuộc bầu cử.", "eng": "The party's poor performance in the election."}, {"viet": "Sau 10 ngày, bệnh nhân được phép dậy.", "eng": "The patient was allowed up after 10 days."}, {"viet": "Người mà tôi phải gọi điện thoại sống ở Ấn Độ.", "eng": "The person that I have to phone lives in India."}, {"viet": "Những người hành hương phủ phục trước bệ thờ.", "eng": "The pilgrims prostrated themselves before the altar."}, {"viet": "Phi cơ đã bay gập ghềnh trong cơn bão.", "eng": "The plane had a rough flight in the storm."}, {"viet": "Vở kịch đã được rút ngắn bằng cách bỏ đi hai màn.", "eng": "The play was shortened by the omission of two scenes."}, {"viet": "Cảnh sát phạt tôi về việc đỗ xe không đúng chỗ.", "eng": "The police booked me for parking the wrong place."}, {"viet": "Cảnh sát đuổi bắt chiếc ô tô bị ăn trộm trên xa lộ.", "eng": "The police pursued the stolen vehicle along the motorway."}, {"viet": "Ô nhiễm đang đe doạ vùng nông thôn của chúng ta.", "eng": "The pollution which is menacing our countryside."}, {"viet": "Cái cưa điện cắt gỗ thành từng lát mỏng ngọt xớt.", "eng": "The power saw sliced the logs like a knife through butter."}, {"viet": "Vị tổng thống đã đưa ra một lời tuyên bố về các mục tiêu của mình.", "eng": "The president made a statement of his aims."}, {"viet": "Chính sách của bà Thủ tướng đã làm cho nhiều người ủng hộ xa lánh bà ta.", "eng": "The Prime Minister's policy alienated many of her followers."}, {"viet": "Những người tù được phép tập thể dục hai tiếng một ngày.", "eng": "The prisoners were permitted two hours'exercise a day."}, {"viet": "Sự chiếu các hình ảnh lên màn ảnh.", "eng": "The projection of images on a screen."}, {"viet": "Sự trừng phạt đối với lời khai giả mạo cho sở thuế có thể rất nghiêm khắc.", "eng": "The punishment for making false statements to the tax authorities can be severe."}, {"viet": "Kẻ say sưa rượu chè trước kia nay hoàn toàn bỏ rượu.", "eng": "The quondam drunkard, now perfectly sober."}, {"viet": "Cái cửa sau được gắn bản lề ở trên để mở ngược lên.", "eng": "The rear door hinges at the top so that is opens upward."}, {"viet": "Những phế tích của một tu viện, của thành La Mã cổ.", "eng": "The remains of an abbey, of an ancient Rome."}, {"viet": "Kết quả của cuộc bầu cử đến với tất cả chúng tôi như là một cú sốc.", "eng": "The result of the election came as a shock to us all."}, {"viet": "Nghi thức hành lễ của Giáo hội Thiên Chúa.", "eng": "The ritual of the Catholic Church."}, {"viet": "Chiếc tên lửa bay với tốc độ phi thường.", "eng": "The rocket travels at phenomenal speed."}, {"viet": "Những điều lệ phải được tuân thủ.", "eng": "The rules must be complied with."}, {"viet": "Sự thỏa mãn cơn đói của mình.", "eng": "The satisfaction of one's hunger."}, {"viet": "Tỉ số được nâng lên một trong lượt thứ chín.", "eng": "The score was one up in the ninth inning."}, {"viet": "Người lính gác chặn người lạ mặt lại ở cổng.", "eng": "The sentry challenged the stranger at the gate."}, {"viet": "Con thuyền lắc lư ở mạn phải.", "eng": "The ship gave a lurch to starboard."}, {"viet": "Cửa hàng tự hào về tính độc nhất của mình.", "eng": "The shop was proud of its exclusiveness."}, {"viet": "Sự lựa chọn thích hợp nhất cho việc giải quyết nạn ách tắc lưu thông.", "eng": "The single most favoured option for dealing with traffic congestion."}, {"viet": "Bầu không khí đầy khói của một thành phố công nghiệp.", "eng": "The smoky atmosphere of an industrial town."}, {"viet": "Con trai của vua James đệ nhị được gọi là Lão Mạo Nhận vì anh ta đòi lên ngôi hoàng đế Anh.", "eng": "The son of king James II was called the Old Pretender because he pretended to the British throne."}, {"viet": "Bài diễn văn có ý định che dấu những tình huống tồi tệ.", "eng": "The speech tended to lacquer over the terrible conditions."}, {"viet": "Bức tượng là một điều mãi mãi nhắc nhở về sự vĩ đại của Churchill.", "eng": "The statue is lasting reminder of Churchill's greatness."}, {"viet": "Con suối về mùa hè thu lại chỉ còn một dòng mảnh.", "eng": "The stream is reduced to a mere trickle in summer."}, {"viet": "Ánh lập loè bất chợt của que diêm trong bóng tối.", "eng": "The sudden gleam of a match in the darkness."}, {"viet": "Hệ thống sẽ phải được thử nghiệm trước khi đưa vào sản xuất.", "eng": "The system will have to be tested before it goes into production."}, {"viet": "Thầy giáo chứng nhận sự trung thực của đứa bé.", "eng": "The teacher testified to the boy's honesty."}, {"viet": "Nhiệm kỳ tổng thống Mỹ là bốn năm.", "eng": "The tenure of the US Presidency is four years."}, {"viet": "Sự đe doạ của bom H hiện ra lù lù trong đầu óc nhiều người.", "eng": "The threat of the H-bomb loomed large in many minds."}, {"viet": "Các quán rượu và quầy rượu của thành phố là nơi quân nhân không được đến.", "eng": "The town's pubs and bars are out of bounds to troops."}, {"viet": "Những khách du lịch dừng lại để ăn ở một quán nhỏ.", "eng": "The travellers stopped to eat at a small inn."}, {"viet": "Hai cộng đồng sống với nhau trong hoà bình.", "eng": "The two communities live together in peace."}, {"viet": "Sự tường thuật lệch lạc của các tờ báo lá cải.", "eng": "The unbalanced reporting of the popular tabloids."}, {"viet": "Những bức hoạ quý không bị lửa chạm tới.", "eng": "The valuable paintings were not touched by the fire."}, {"viet": "Số lượng xe cộ đã bắt đầu giảm.", "eng": "The volume of traffic has begun to tail off."}, {"viet": "Cách đối xử của một số địa chủ đối với tá điền ngày nay có vẻ gần như theo kiểu phong kiến.", "eng": "The way some land-owners treat their tenants today seems almost feudal."}, {"viet": "Cả chuyến đi là một tai hoạ từ đầu đến cuối.", "eng": "The whole trip was a disaster from beginning to end."}, {"viet": "Người phụ nữ nói chuyện với tôi trong cửa hàng sống ở nhà bên cạnh.", "eng": "The woman that spoke to me in the shop used to live next door."}, {"viet": "Đoàn tàu đổ nằm chéo qua đường ray.", "eng": "The wrecked train lay aslant the track."}, {"viet": "Người con gái của họ chết cách đây đã hơn một năm, song họ vẫn còn thương tiếc.", "eng": "Their daughter died over a year ago, but they are still grieving."}, {"viet": "Tiền lương của họ cao hơn nạn lạm phát.", "eng": "Their pay offer was well ahead of inflation."}, {"viet": "Vậy thì cứ gửi cho chúng tôi bằng đường biển đi.", "eng": "Then please send it to us by sea."}, {"viet": "Có một con đường xe lửa nối giữa hai thành phố.", "eng": "There's a new rail link between the two towns."}, {"viet": "Không có dấu hiệu gì anh ta tu tỉnh cả.", "eng": "There's no sign of him mending his ways."}, {"viet": "Về mùa đông lắm bệnh tật.", "eng": "There are a lot of bugs about in winter."}, {"viet": "Có trên 1000 người không có công ăn việc làm ở thành phố chúng tôi.", "eng": "There are over 1000 jobless in our town."}, {"viet": "Sẽ đến lúc người ta muốn chết hơn là thích sống.", "eng": "There comes a time when dying is preferable to staying alive."}, {"viet": "Gia đình tôi có tiền sử bệnh đau tim.", "eng": "There is a history of heart disease in my family."}, {"viet": "Ở đây không có ai tên đó cả.", "eng": "There is no one here by that name."}, {"viet": "Có một sợi tóc trong đó.", "eng": "There's a hair in it."}, {"viet": "Tại cuộc liên hoan hàng năm của cơ quan, người ta có cảm giác dễ sợ là quá nhàm.", "eng": "There was an awful feeling of déjà vu at the annual office party."}, {"viet": "Có nhiều người vắng mặt trong cuộc họp.", "eng": "There were many absentees from the meeting."}, {"viet": "Những sách này thư viện cho mượn.", "eng": "These books are loaned from the library."}, {"viet": "Những biện pháp mới này chứng tỏ một sự quay ngoắt 180 độ trong chính sách của chính phủ.", "eng": "These new measures indicate an about-turn in government."}, {"viet": "Họ là một đôi rất đơn giản-chị thì may quần áo cò anh thì là thợ gốm.", "eng": "They're a very arty-crafty couple-she makes clothes and he's a potter."}, {"viet": "Họ đã bán ngôi nhà và xe hơi để chuẩn bị rời khỏi đất nước.", "eng": "They've sold their house and car in preparation for leaving the country."}, {"viet": "Họ khá là khoe khoang về thiết bị của họ.", "eng": "They are rather boastful about their equipment."}, {"viet": "Tất cả bọn họ đều có thể nhảy múa điệu cầu mưa.", "eng": "They can all dance the rain dance."}, {"viet": "Họ đã không mua được chút bánh mì nào tại hiệu bánh.", "eng": "They didn't have any bread at the baker's."}, {"viet": "Họ tìm thấy kho báu chôn dưới gốc cây.", "eng": "They found the treasure buried under a tree."}, {"viet": "Họ đã làm công việc in rất tốt.", "eng": "They have made a good job of the printing."}, {"viet": "Chúng trông rất khác với đồng loại của chúng ở mực nước nóng hơn.", "eng": "They look very different from their relatives in shallower waters."}, {"viet": "Họ quét sơn nhà bếp rồi quyết định quét toàn bộ và trang trí lại cả các phòng khác luôn thể.", "eng": "They painted the kitchen and then decided to go the whole hog and redecorate the other rooms as well."}, {"viet": "Họ nổi dậy chống lại bạo chúa.", "eng": "They rose in revolt against the tyrant."}, {"viet": "Họ đã ở lại sau cuộc liên hoan để giúp dọn dẹp.", "eng": "They stayed behind after the party to help clear up."}, {"viet": "Họ giặt quần áo bằng bột xà phòng.", "eng": "They washed the clothes with soap powder."}, {"viet": "Họ giống con người ngày nay hơn.", "eng": "They were much more like the people of today."}, {"viet": "Bọn kẻ cắp, sát nhân và bọn bất lương khác.", "eng": "Thieves, murderers and other evildoers."}, {"viet": "Toà sắp đi tới này là Điện Thái Hoà.", "eng": "This building coming up is the Hall of Harmony and Peace."}, {"viet": "Cuốn từ điển này có cả ở dạng điện tử.", "eng": "This dictionary is available in electronic form."}, {"viet": "Viện này lên án hành động của thủ tướng.", "eng": "This house condemns the Prime Minister's action."}, {"viet": "Đây là ngôi nhà đầu tiên tôi xây-Quả là một thành tựu!", "eng": "This is the first house I've ever built-What an accomplishment!"}, {"viet": "Điều này làm cho thuật ngữ kinh tế thị trường tự do hình như là một cái tên không thích hợp.", "eng": "This makes the term free market economy seem something of a misnomer."}, {"viet": "Đợt thanh toán này sẽ làm cho tôi hết nợ.", "eng": "This payment will get me out of the red."}, {"viet": "Nhà trường này được thành lập năm 1850.", "eng": "This school was established in 1850."}, {"viet": "Cái lốp này mòn quá rồi không còn dùng được nữa.", "eng": "This tyre is so worn that it is no longer usable."}, {"viet": "Tuy là một sai lầm nhỏ của cô ta nhưng nó có những hậu quả khôn lường.", "eng": "Though it was a small lapse on her part, it had far reaching consequences."}, {"viet": "Tom cứ nằng nặc đòi ông bác mua cho nó một chiếc máy ảnh.", "eng": "Tom has been badgering his uncle to buy him a camera."}, {"viet": "Sự bất ổn vì tương lai là nguyên nhân sâu xa của nỗi lo lắng choán lấy xã hội Anh.", "eng": "Uncertainly about the future is the root cause of the malaise gripping British society."}, {"viet": "Bị đẩy từ việc làm này sang việc làm khác vì sự lên xuống của nền kinh tế.", "eng": "Was buffeted about from job to job by the vagaries of economy."}, {"viet": "Ngày mai chúng ta sẽ ăn nốt chỗ bánh còn lại.", "eng": "We'll eat the rest of the cake tomorrow."}, {"viet": "Chúng tôi định khi nào để dành đủ tiền sẽ mua một cái nhà.", "eng": "We're going to buy a house when we've saved enough money."}, {"viet": "Chúng tôi đang cố gắng thực hiện những mục tiêu chung.", "eng": "We're working towards common objectives."}, {"viet": "Chúng tôi đã nhận đủ số những người thực tập cho năm nay rồi.", "eng": "We've taken on our full complement of new trainees for this year."}, {"viet": "Chúng tôi có kinh nghiệm trong việc xuất khẩu hàng nhựa sang Đông Âu và hiện đang hy vọng mở một tài khoản tín dụng với quý vị.", "eng": "We are experienced in exporting plastic ware to Eastern Europe and now hope to open a credit account with you."}, {"viet": "Chúng tôi tham dự buổi liên hoan vì ý thức nghĩa vụ bắt buộc nhiều hơn là vì bất cứ điều gì khác.", "eng": "We attended the party more out of a sense of obligation than anything else."}, {"viet": "Chúng tôi có thể gửi cho bạn văn bản trên đĩa máy tính hoặc bản in trên giấy.", "eng": "We can give you the text on computer disk, or as hard copy."}, {"viet": "Chúng ta có thể viết thư cho ông hiệu trưởng.", "eng": "We could write a letter to the headmaster."}, {"viet": "Chúng tôi rút thăm xem ai đi trước.", "eng": "We drew lots to see who should go first."}, {"viet": "Chúng tôi có một khu vườn rộng lớn hơn ở ngôi nhà trước đây của chúng tôi.", "eng": "We had a larger garden at our old house."}, {"viet": "Chúng tôi có một hồ bơi, một phòng tắm hơi, một phòng chơi bô-ling, một phòng chơi bida, một trung tâm y tế và một trung tâm giải trí ở tầng hầm.", "eng": "We have a Swimming Pool, Sauna, BowIing Room, Billiard Room, Health Center and Recreation Center in the basement."}, {"viet": "Chúng tôi có ba trăm nhân viên làm việc trong 15 dây chuyền sản xuất ở Thâm Quyến.", "eng": "We have three hundred employees who work in 15 production lines in Shenzhen."}, {"viet": "Chúng tôi hạ cánh ở Rome lúc sáu giờ chiều.", "eng": "We landed at Rome at six in the evening."}, {"viet": "Chúng tôi có thể giúp anh, tôi sẽ nghiên cứu các khả năng.", "eng": "We might be able to help you, I'll investigate the possibilities."}, {"viet": "Chúng ta phải cố gắng phân tích nguyên nhân của cuộc bãi công.", "eng": "We must try to analyse the causes of the strike."}, {"viet": "Chúng tôi chơi bóng đá và sau đó về nhà.", "eng": "We played football and after that we went home."}, {"viet": "Ở đây chúng tôi phục vụ thức ăn Trung Quốc với nhiều phong cách khác nhau, nhưng tôi không biết chắc là ông thích loại nào hơn.", "eng": "We serve different styles of Chinese food here, but I'm not sure which one you prefer."}, {"viet": "Chúng tôi đột nhiên thấy một chiếc xe tải to đùng này tiến về phía chúng tôi.", "eng": "We suddenly saw this dirty great truck coming towards us."}, {"viet": "Chúng tôi muốn mua một ngôi nhà lớn hơn ngôi nhà này nhưng chúng tôi đã phải liệu cơm gắp mắm.", "eng": "We wanted to buy a bigger house than this but we had to cut our coat according to our cloth."}, {"viet": "Chúng tôi rất hy vọng là anh sẽ được rỗi ngày thứ Sáu.", "eng": "We were rather hoping you'd be free on Friday."}, {"viet": "Chúng tôi muốn ông đặt cọc.", "eng": "We would like to have a deposit."}, {"viet": "À, bây giờ thì con không buồn đâu.", "eng": "Well, I'm not sad now."}, {"viet": "Trời đất, cuối cùng cô ta đã thắng!", "eng": "Well I'll be damned, she won after all!"}, {"viet": "Thật là chán quá! Tôi đã quên mất vé rồi.", "eng": "What a nuisance! I've forgotten my ticket."}, {"viet": "Cái thằng đầu bắp cải nào đặt cái này lộn ngược thế này?", "eng": "What cabbagehead put this thing on upside down?"}, {"viet": "Một cô gái trẻ như em thì cần gì ở một lão già như tôi?", "eng": "What does a young girl like you want with an old crock like me?"}, {"viet": "Thủ đô của Úc là gì?", "eng": "What is the capital city of Australia?"}, {"viet": "Quan điểm của anh thế nào về nhục hình?", "eng": "What is your stance on corporal punishment?"}, {"viet": "Giá của chuyến đi là bao nhiêu?", "eng": "What's the price of the tour?"}, {"viet": "Điều làm tôi lo lắng là bây giờ vợ nó chết rồi không biết nó sẽ xoay sở ra sao.", "eng": "What worries me is how he will manage now his wife's died."}, {"viet": "Khi mới thức dậy cậu ta hay cáu bẳn.", "eng": "When he's just woken up he's like a bear with a sore head."}, {"viet": "Khi nào thì tiểu thuyết đó xuất bản bằng sách bìa mềm?", "eng": "When is the novel coming out in paperback?"}, {"viet": "Sau khi việc đóng sách hoàn thành, sách được xén ở phía cần thiết.", "eng": "When the sewing is completed, the pages of the book are trimmed to the correct size."}, {"viet": "Em kiếm đâu ra thời gian để làm tất cả các chuyện nấu nướng đó?", "eng": "Whenever did you find time to do all that cooking?"}, {"viet": "Bạn thích mua sắm ở nơi nào nhất?", "eng": "Where is your favorite place to shop?"}, {"viet": "Trong ba cách phát âm này cách nào là thông dụng nhất?", "eng": "Which of these three pronunciations is the most usual?"}, {"viet": "Một số ca sĩ nổi tiếng ở đất nước bạn là những ai?", "eng": "Who are some famous singers from your country?"}, {"viet": "Những vở kịch của người nào có thể so sánh với của Shakespeare?", "eng": "Whose plays can compare with Shakespeare's?"}, {"viet": "Tại sao anh phải uống những viên thuốc này?", "eng": "Why have you got to take these tablets?"}, {"viet": "Anh làm ơn giúp tôi, cho tôi vay ít tiền được không?", "eng": "Will you do me a favour and lend me some money?"}, {"viet": "Với cái chớp chớp của hàng lông mi đen dài của cô ta.", "eng": "With a flutter of her long dark eyelashes."}, {"viet": "Mời ông ngồi và xin cứ tự nhiên như ở nhà?", "eng": "Won't you be seated and make yourself at home?"}, {"viet": "Cháu có muốn ăn săn-uýt vào bữa ăn trưa không?", "eng": "Would you like a sandwich for lunch?"}, {"viet": "Bà cảm phiền chuyển cho tôi bình nước?", "eng": "Would you mind passing me the water?"}, {"viet": "Hãy viết tên của bạn trên bìa trước của vở bài tập.", "eng": "Write your name on the front cover of the exercise book."}, {"viet": "Vâng, hãy đến quầy kế tiếp.", "eng": "Yes, just go to the next counter, please."}, {"viet": "Cậu sẽ bị ốm nếu cậu cứ tiếp tục làm việc quá sức.", "eng": "You'll become ill if you continue to overwork."}, {"viet": "Giờ đây anh vui thú hưởng thụ nhưng rồi ngày đền tội sẽ tới.", "eng": "You're enjoying yourself now, but a day of reckoning will come."}, {"viet": "Anh đã đọc cuốn sách này nhiều lần như vậy chắc hẳn là bây giờ anh thuộc lòng nó!", "eng": "You've read that book so many times you must know it backwards by now!"}, {"viet": "Anh không thể đánh lừa một chuyên gia bằng những đồ giả rẻ tiền.", "eng": "You can't fob an expert off with cheap imitations."}, {"viet": "Anh có thể đi tới đó bằng máy bay cũng rẻ như xe lửa.", "eng": "You can get there just as cheaply by air as by train."}, {"viet": "Anh có thể nhìn thấy sự ngon miệng trên đôi môi hồng của anh ta.", "eng": "You could see the gourmandise shining on his rosy lips."}, {"viet": "Mày đã cố tình làm ngược lại những mong muốn của tao.", "eng": "You have deliberately acted against my wishes."}, {"viet": "Anh biết mình đã thành đạt khi được yêu cầu xuất hiện trên ti-vi.", "eng": "You know you've arrived when you're asked to appear on TV."}, {"viet": "Ông phải cắt giảm dần dần và tôi ghi toa cho ông mua loại thuốc an thần nào đó.", "eng": "You must cut it down gradually and I could prescribe some kind of tranquillizer."}, {"viet": "Anh cần có thời gian để thích nghi ( với cuộc sống độc thân ).", "eng": "You need time to readjust ( to living alone )."}, {"viet": "Bạn nên mua một chương trình phần mềm chống vi-rút.", "eng": "You should get an anti-virus software program."}, {"viet": "Đem lũ côn đồ của cậu ra khỏi đây!", "eng": "You take your apes and get out of here!"}, {"viet": "Anh sẽ không lập được đội nếu anh không tiến hành kiểm tra.", "eng": "You won't make the team if you don't try out."}, {"viet": "Bài tập ở nhà của cậu là một sự đáng hổ thẹn: làm lại đi!", "eng": "Your homework is a disgrace: rewrite it!"}, {"viet": "CÁI CỦA BẠN CŨNG GIỐNG NHƯ CÁI CỦA TÔI.", "eng": "YOURS IS THE SAME AS MINE."}]