[{"viet": "Một chút nước chườm sẽ làm cho đầu gối thâm tím của bạn bớt đau.", "eng": "A bit of embrocation will soothe your bruised knee."}, {"viet": "Một bản liệt kê những thứ mang theo khi đi nghỉ.", "eng": "A check-list of things to take on holiday."}, {"viet": "Một buổi hòa nhạc do ông Colin David điều khiển.", "eng": "A concert conducted by Sir Colin David."}, {"viet": "Một ít nước tạt vào mặt của anh ta sẽ làm anh ta tỉnh lại.", "eng": "A dash of water in his face will revive him."}, {"viet": "Một con chó có lông trắng ở ngực của nó.", "eng": "A dog with white markings on its chest."}, {"viet": "Một cánh đồng được trồng những cây sồi non.", "eng": "A field that had been treed with oak saplings."}, {"viet": "Một chiếc tàu chở đầy dầu với thân tàu chìm sâu dưới nước.", "eng": "A fully-loaded tanker with its hull low in the water."}, {"viet": "Một người sưu tầm sách vĩ đại sống cách đây 500 năm lấy làm kiêu hãnh vì tất cả sách của ông đều được viết bằng tay.", "eng": "A great book collector who lived 500 years ago boasted that every book he had was written with the pen."}, {"viet": "Một mức lạm phát cao có nghĩa là giai đoạn khó khăn cho người tiêu thụ.", "eng": "A high inflation rate importing hard times for the consumer."}, {"viet": "Một gói bột giặt loại lớn.", "eng": "A jumble-sized of washing powder."}, {"viet": "Một thư viện có trên 12.000 quyển sách.", "eng": "A library of over 12.000 volumes."}, {"viet": "Sự thèm khát quyền lực, vàng, mạo hiểm.", "eng": "A lust for power, gold, adventure."}, {"viet": "Một không khí im lặng đáng sợ bao trùm những đường phố vắng hoe.", "eng": "A menacing quiet fills the empty streets."}, {"viet": "Một thời đại mới đã bắt đầu hé sáng.", "eng": "A new age are began to dawn."}, {"viet": "Tờ 100 nhân dân tệ được đưa vào lưu hành.", "eng": "A one-hundred-yuan note has been put in circulation."}, {"viet": "Một người có hiểu biết về các thị trường châu Âu.", "eng": "A person with a knowledge of European markets."}, {"viet": "Một nhóm xe hơi được sử dụng bởi các nhân viên chào hàng.", "eng": "A pool of cars used by the firm's salesmen."}, {"viet": "Một diễn giả nói trước công chúng cần có một giọng nói vang tốt.", "eng": "A public speaker needs a voice that carries well."}, {"viet": "Một sự trở lại giờ làm việc bình thường, các thói quen cũ.", "eng": "A return to normal working hours, old habits."}, {"viet": "Một nhà khoa học phải đưa ra chứng cứ để bảo vệ một lý thuyết.", "eng": "A scientist must produce evidence in support of a theory."}, {"viet": "Một sự thiếu thốn lúa gạo, tiền, trang thiết bị.", "eng": "A shortage of rice, funds, equipment."}, {"viet": "Một người lính đào ngũ trong thời chiến sẽ bị trừng phạt nặng.", "eng": "A soldier who deserts in time of war is punished severely."}, {"viet": "Đường thẳng là đường ngắn nhất giữa hai điểm.", "eng": "A straight line is the shortest distance between two points."}, {"viet": "Một sự tận tụy của cô giáo đối với công việc của cô ta.", "eng": "A teacher's devotion to her task."}, {"viet": "Một phần kem nhiều gấp ba lần.", "eng": "A treble portion of ice-cream."}, {"viet": "Một chong chóng trên đỉnh ngọn tháp.", "eng": "A weather-vane surmounts the spire."}, {"viet": "Cách đây khoảng 1500 năm, các bộ lạc man rợ đã tiến công vào Đế quốc La Mã vĩ đại.", "eng": "About 1,500 years ago barbarian tribes pushed their way into the great Roman Empire."}, {"viet": "Cộng 2,74 bảng Anh với 7,26 bảng Anh thì bạn có 10,00 bảng Anh chẵn.", "eng": "Add 2.74 to 7.26 and you get 10.00, in round figures."}, {"viet": "Sau một năm khốn khổ ở đây, cuối cùng tôi cũng rũ áo đi khỏi thành phố này.", "eng": "After a year of misery here, I'm finally shaking the dust of this town off my feet."}, {"viet": "Sau khi xem xét lại đơn xin việc của anh, trông như thể anh đã nhận được công việc đó đấy.", "eng": "After reviewing your application, it looks like you've got the job."}, {"viet": "Sau nhiều năm xích mích, cuối cùng chúng tôi gởi đến các người anh em họ của chúng tôi một thiệp mừng Giáng sinh để giảng hòa.", "eng": "After years of quarrelling we at last sent our cousins a Christmas card as an olive-branch."}, {"viet": "Điều duy nhất tôi muốn là yên bình và tĩnh lặng.", "eng": "All I want is peace and quiet."}, {"viet": "Càng có nhiều lý do hơn để làm điều gì.", "eng": "All the more reason to do something."}, {"viet": "Mặc dù đồng hồ treo tường cổ xưa rất phức tạp, nhưng thật sự không có chiếc nào là một dụng cụ đo thời gian chuẩn xác.", "eng": "Although some of the early clocks were very complicated, none of them were very good timepieces."}, {"viet": "Một chiến dịch quảng cáo nhằm tạo ra sự kích thích rất cần thiết cho việc bán hàng.", "eng": "An advertising campaign to a much-needed fillip to sales."}, {"viet": "Nguyệt thực là một hiện tượng hiếm.", "eng": "An eclipse of the moon is a rare phenomenon."}, {"viet": "Một sự gia tăng về số lượng các công ty buôn bán với Nhật Bản.", "eng": "An increase in the number of firms trading with Japan."}, {"viet": "Phòng mổ phải hoàn toàn vô trùng.", "eng": "An operating theatre should be completely sterile."}, {"viet": "Và như vậy, tôi xin được nói tóm lại là cuộc vận động đã thành công mỹ mãn.", "eng": "And so I would say, in summary, that the campaign has been a great success."}, {"viet": "Trả lời có hay không-đừng nói loanh quanh nữa!", "eng": "Answer yes or no-stop hedging!"}, {"viet": "Ở Canada, các máy rút tiền tự động hoạt động 24 giờ mỗi ngày phải không?", "eng": "Are ATMs open 24 hours a day in Canada?"}, {"viet": "Em đang nấu cái gì đó trong bếp phải không?", "eng": "Are you cooking anything in the kitchen?"}, {"viet": "Mỗi ngày bạn đều rất bận rộn phải không?", "eng": "Are you very busy every day?"}, {"viet": "Là một nghệ sĩ, ông ấy không coi mình phải lệ thuộc vào tập tục xã hội như những người khác.", "eng": "As an artist he didn't consider himself constrained by the same rules of social conduct as other people."}, {"viet": "Trong tình hình hiện tại, chúng ta sẽ không hoàn thành công việc đúng thời hạn được.", "eng": "As things stand, we won't finish the job on time."}, {"viet": "Tuy nhiên, cuối cùng, các dân tộc bán khai cũng ổn định cuộc sống.", "eng": "At last, however, the barbarians began to settle down."}, {"viet": "Số người tham dự buổi hòa nhạc rất ít.", "eng": "Attendance at the concert was very poor."}, {"viet": "Bị bắt vì bỏ mối ma túy.", "eng": "Be arrested for peddling illegal drugs."}, {"viet": "Thận trọng tuân thủ nghi thức ngoại giao của ai.", "eng": "Be religious in one's observance of protocol."}, {"viet": "Hành vi hoàn toàn không hợp với các mục đích của xã hội.", "eng": "Behaviour that is totally incompatible with the aims of the society."}, {"viet": "Những cuộc tranh cãi gây gắt giữa các nghị sĩ trong nghị viện.", "eng": "Bitter exchanges between MP's in parliament."}, {"viet": "Bài brít, xì phé và uýt là những môn cờ bạc.", "eng": "Bridge, poker, and whist are card-games."}, {"viet": "Xe buýt chạy thường xuyên từ thành phố đến phi trường.", "eng": "Buses run frequently from the city to the airport."}, {"viet": "Nhưng có lẽ chúng ta sẽ gây phiền bạn ấy đấy.", "eng": "But maybe we will be a bother to her."}, {"viet": "Mua những con tem mới vào ngày phát hành.", "eng": "Buy new stamps on the day of issue."}, {"viet": "Do làm việc 13 giờ mỗi ngày cô ta đã kiệt sức.", "eng": "By working 13 hours a day she is running herself into the ground."}, {"viet": "Tôi có thể gia hạn cho ông giấy chứng nhận có kỳ hạn không?", "eng": "Can I renew the certificate on maturity?"}, {"viet": "Bạn gỡ chân vịt ra khỏi đám cỏ dại được không?", "eng": "Can you free the propeller from the weeds?"}, {"viet": "Cậu có thể chừa cho mình một điếu thuốc được không?", "eng": "Can you spare a cigarette for me?"}, {"viet": "Thực hiện một cuộc oanh tạc bất ngờ vào các mục tiêu địch.", "eng": "Carry out a blitz on enemy targets."}, {"viet": "Hãy nhai kỹ thức ăn trước khi nuốt.", "eng": "Chew your food well before you swallow it."}, {"viet": "Claude thường biết theo trực giác các cảm nghĩ của tôi về mọi chuyện trước hẳn khi chính tôi nhận thức được chúng.", "eng": "Claude often intuits my feelings about things long before I am really aware of them myself."}, {"viet": "Thôi đi, anh chơi không sòng phẳng!", "eng": "Come on, you're not playing fair!"}, {"viet": "Xin chúc mừng, tôi nghe bạn sắp có em bé!", "eng": "Congratulations, I hear you are going to have a baby!"}, {"viet": "Vui lòng cho tôi nói chuyện với ông Learner?", "eng": "Could I speak to Mr. Learner?"}, {"viet": "Chuyển tivi qua kênh khác được không?", "eng": "Could you switch the TV over?"}, {"viet": "Cắt dây cho con thuyền trôi.", "eng": "Cut a boat adrift from it moorings."}, {"viet": "Thất bại trong trận đánh quan trọng này là dấu hiệu ban đầu về một kết cục bất lợi cho chúng ta.", "eng": "Defeat in this important battle was the beginning of the end for us."}, {"viet": "Bất kể người ta nói gì, tôi vẫn xem anh ta là một người tử tế.", "eng": "Despite what others say, I think he's a very nice chap."}, {"viet": "Bạn có biết là anh nói được 5 thứ tiếng không?", "eng": "Did you know he speaks five languages?"}, {"viet": "Sợ rắn hay nhện là một nỗi sợ thông thường.", "eng": "Dislike of snakes or spiders is a common phobia."}, {"viet": "Cha mẹ cô dâu có phải chịu phí tổn đám cưới không?", "eng": "Do the bride's parents have to bear the cost of the wedding?"}, {"viet": "Bạn có thấy rằng trách nhiệm của con cái là phải chăm sóc cha mẹ già không?", "eng": "Do you feel it is a child's responsibility to look after aging parents?"}, {"viet": "Em có bơ thực vật hay vì bơ từ sữa không?", "eng": "Do you have margarine instead of butter?"}, {"viet": "Bạn sống trong một ngôi nhà hay một căn hộ?", "eng": "Do you live in a house or an apartment?"}, {"viet": "Ông có nghĩ tôi sẽ nhân lại nó không?", "eng": "Do you think I will get it back?"}, {"viet": "Bạn có xức nước hoa hay tinh dầu không?", "eng": "Do you wear perfume or cologne?"}, {"viet": "Chạy với tốc độ đều đều 4000 vòng mỗi phút.", "eng": "Doing a steady 4000 revs per minute."}, {"viet": "Đừng lái xe mà vẫn gài phanh tay.", "eng": "Don't drive with the handbrake on."}, {"viet": "Đừng để cho tình cảm của anh chế ngự mình.", "eng": "Don't let your feeling get the upper hand over you."}, {"viet": "Đừng có dùng cái lối đó với tôi.", "eng": "Don't take that line with me."}, {"viet": "Các hoài nghi, triệu chứng, ngờ vực trở lại thường xuyên.", "eng": "Doubts, symptoms, suspicions that return constantly."}, {"viet": "Trong suốt buổi thu hình vở kịch đó.", "eng": "During the recording of the show."}, {"viet": "Những người đã làm việc ở đây lâu năm sẽ được ưu tiên hơn là những người mới đến.", "eng": "Employees who have worked here for many years will be given preference over newcomers."}, {"viet": "Cho dù chúng ta thừa nhận nhà thơ ấy bị mất trí.", "eng": "Even if we allow that the poet was mad."}, {"viet": "Cuối cùng thì mọi việc cũng tốt đẹp.", "eng": "Everything will come right in the end."}, {"viet": "Hãy giải thích cái đó càng đơn giản càng tốt.", "eng": "Explain it as simply as you can."}, {"viet": "Thức ăn nhanh có hàm lượng colextêrôn cao.", "eng": "Fast food is high in cholesterol."}, {"viet": "Các nhà đạo diễn phim đôi khi là những diễn viên thất bại.", "eng": "Film directors are sometimes frustrated actors."}, {"viet": "Cố ghi nhớ tên của ai trong tâm trí mình.", "eng": "Fix somebody's name in one's mind."}, {"viet": "Đối với một tội nghiêm trọng như thế này, án tù là hình phạt thông thường.", "eng": "For an offence of this gravity, imprisonment is the usual punishment."}, {"viet": "Pháp đã loại Bỉ ra khỏi cúp Châu Âu.", "eng": "France knocked Belgium out of the European cup."}, {"viet": "Vào mùa hè, việc làm vườn chiếm mất nhiều thời gian của tôi.", "eng": "Gardening claims much of my time in the summer."}, {"viet": "Lấy tiền của bà ấy thật dễ-bà ta là người nhẹ dạ.", "eng": "Getting money from her is easy-she's a push-over."}, {"viet": "Đưa bằng chứng nhân danh bị cáo.", "eng": "Give witness on behalf of an accused person."}, {"viet": "Chào ông, bây giờ là 6 giờ.", "eng": "Good morning, it's six o'clock."}, {"viet": "Tốt hơn chúng ta nên mang ô theo nhé?", "eng": "Hadn't we better take an umbrella?"}, {"viet": "Cho thuê chiếc xe trong một tuần.", "eng": "Have the hire of a car for a week."}, {"viet": "Bạn có bao giờ được đào tạo đặc biệt về kinh doanh chưa?", "eng": "Have you ever received special training for business?"}, {"viet": "Bạn đã nhìn thấy những bản phác hoạ cho quyển sách mới đó chưa?", "eng": "Have you seen the artwork roughs for the new book?"}, {"viet": "Ông ta là một bác sĩ và trước khi có con, vợ ông ta cũng thế.", "eng": "He's a doctor, as was his wife before she had children."}, {"viet": "Anh ta trở nên chểnh mảng và mắc những lỗi ngớ ngẩn.", "eng": "He's been getting slack and making silly mistakes."}, {"viet": "Anh ta không còn nơi nào để ở kể từ khi anh ta bị đuổi ra khỏi nhà.", "eng": "He's had nowhere to live since his eviction."}, {"viet": "Ông ta hoàn toàn làm đúng quyền hạn của mình khi đòi có cuộc điều tra.", "eng": "He's quite within his rights to demand an enquiry."}, {"viet": "Nó sốt sắng chấp nhận lời đề nghị của cô ta.", "eng": "He accepted her offer with alacrity."}, {"viet": "Ông ta hỏi xem tôi có biết lái xe không.", "eng": "He asked if I could drive."}, {"viet": "Anh ta bắt đầu đề cập đến vấn đề vay tiền với giám đốc ngân hàng.", "eng": "He broached the subject of a loan with his bank manager."}, {"viet": "Anh ta bắt được quả bóng, rồi nó lại tuột khỏi tay anh ta.", "eng": "He caught the ball, then it slipped through his fingers."}, {"viet": "Hắn trùm tấm khăn lên xác chết.", "eng": "He covered up the body with a sheet."}, {"viet": "Nó đã không thấy chiếc xe đang tới gần ở phía trái.", "eng": "He didn't see the car approaching on his nearside."}, {"viet": "Hắn hích tôi qua một bên.", "eng": "He elbowed me out of the way."}, {"viet": "Anh ta cảm thấy bị các lời cáo giác đó chụp mũ sâu sắc.", "eng": "He felt deeply wronged by the allegations."}, {"viet": "Ông ấy đã bỏ tiền ra để cho các con có được một sự giáo dục tốt nhất.", "eng": "He gave his children the best education that money could buy."}, {"viet": "Nó lãnh ba năm tù về tội hắn đã phạm ở Leeds.", "eng": "He got three years for a job he did in Leeds."}, {"viet": "Anh ta phải vượt qua được mấy hậu vệ để ghi bàn.", "eng": "He had to beat several defenders to score."}, {"viet": "Anh ấy thô lỗ đến nỗi bạn bè đều xa lánh.", "eng": "He has become so rude that his friends are deserting him."}, {"viet": "Anh ấy có lợi thế của một việc làm vững vàng.", "eng": "He has the advantage of a steady job."}, {"viet": "Thân hình to lớn của ông ta án ngữ hết cửa sổ trước mặt tôi, vì thế tôi không thể nhìn ra ngoài được.", "eng": "He interposed his considerable bulk between me and the window, so that I could not see out."}, {"viet": "Anh ta chẳng phải là thần thánh, nhưng anh ta cũng chẳng phải là người hung ác.", "eng": "He is no saint, but he's no villain either."}, {"viet": "Nó ấn chìa khóa vào ổ.", "eng": "He jammed his key into the lock."}, {"viet": "Anh ta rời tòa án mà không một vết hoen ố cho tư cách của anh ta.", "eng": "He left the court without a stain on his character."}, {"viet": "Ông ta mất tất cả tài sản trong trận hỏa hoạn.", "eng": "He lost all his possessions in the fire."}, {"viet": "Ông ta đã làm giảm đến mức tối thiểu giá trị sự đóng góp của cô ấy vào công việc nghiên cứu của mình để giành lấy tất cả sự ca tụng.", "eng": "He minimized the value of her contribution to his research so that he got all the praise."}, {"viet": "Ông ta ra lệnh cho thuộc hạ khai hỏa.", "eng": "He ordered his men to open fire."}, {"viet": "Anh ấy căn cứ tư cách của mình dựa trên niềm tin vào bản chất con người.", "eng": "He predicated his behaviour on his faith in humanity."}, {"viet": "Ông ta đáp chiếc máy bay lượn xuống một cánh đồng.", "eng": "He puts the glider down in a field."}, {"viet": "Anh ta coi đám cưới của anh ta đơn thuần là một phương tiện để đạt được mục đích: anh ta chỉ muốn tài sản của vợ mình.", "eng": "He regarded his marriage merely as a means to an end: he just wanted his wife's wealth."}, {"viet": "Anh ta là người táo bạo trên đường đua.", "eng": "He's a daredevil on the racing-track."}, {"viet": "Ông ấy đã bị ngất lịm đi trong mười phút.", "eng": "He's been out cold for ten minutes."}, {"viet": "Ông ta đã sụt xuống mười cân Anh.", "eng": "He's lost ten pounds in weight."}, {"viet": "Anh ta là người gửi điện tín.", "eng": "He's the one who sends messages."}, {"viet": "Nó nói không đi nhưng tôi nói nó nhất định đi.", "eng": "He say he won't go, but I say he shall."}, {"viet": "Anh ta đã bắn một mũi tên từ cây cung của mình.", "eng": "He shot an arrow from his bow."}, {"viet": "Nó ngâm chiếc sơ mi bị ố của nó vào nước nóng.", "eng": "He soaked his stained shirt in hot water."}, {"viet": "Anh ta nói sự đào tạo của anh ta đã đem lại sự yên ổn và tinh thần trách nhiệm.", "eng": "He stated that his training had given him ballast and a sense of responsibility."}, {"viet": "Anh ta bị đau chân khủng khiếp.", "eng": "He suffers terribly with his feet."}, {"viet": "Nó ném cái cửa đi chỉ để vui chơi cho khoái.", "eng": "He threw his wicket away just for the hell of it."}, {"viet": "Anh ấy đổi chiếc xe máy lấy ôtô.", "eng": "He traded in his motor cycle for a car."}, {"viet": "Ông ta tiết lộ một tin sấm sét bằng cách thông báo sự từ chức của mình.", "eng": "He unleashed a thunderbolt by announcing his resignation."}, {"viet": "Anh ta có vẻ hơi ngại ngùng khi được hỏi về nguồn thu nhập của mình.", "eng": "He was a bit coy when asked about the source of his income."}, {"viet": "Nó đã bị cấm không được dự cuộc họp.", "eng": "He was banned from the meeting."}, {"viet": "Nó đã bị giáng cấp từ trung sĩ xuống hạ sĩ.", "eng": "He was demoted from sergeant to corporal."}, {"viet": "Anh ta thấy khó lòng giải thích sự biến mất của cô ta.", "eng": "He was hard put it to explain her disappearance."}, {"viet": "Hắn nổi tiếng là tay cờ bạc và lêu lổng trác táng.", "eng": "He was notorious as a gambler and rake."}, {"viet": "Hắn ta bị bỏ tù năm năm.", "eng": "He was sent to prison for five years."}, {"viet": "Anh ta mệt mỏi về sự cằn nhằn liên tục của vợ.", "eng": "He was tired of his wife's constant complaints."}, {"viet": "Anh ta đi vội xuống hành lang.", "eng": "He went beetling off down the corridor."}, {"viet": "Anh ta sẽ không cảm ơn chị đã để lại tất cả chỗ bát đĩa này cho anh ta rửa.", "eng": "He won't thank you for leaving him all the washing-up to do."}, {"viet": "Những người ủng hộ việc sử dụng thực phẩm thiên nhiên đang luôn luôn giành hậu thuẫn.", "eng": "Health food supporters are always evangelizing."}, {"viet": "Gương mặt giận dữ của cô ta báo trước một cuộc chạm trán.", "eng": "Her angry face forebode a confrontation."}, {"viet": "Sự lựa chọn quần áo của chị ấy chứng tỏ chị là người sành.", "eng": "Her choice of clothes shows her good taste."}, {"viet": "Sự ước tính về phí tổn của cô ta hoàn toàn sai.", "eng": "Her estimate of the cost was completely wrong."}, {"viet": "Tóc của cô ta dài xuống gần tới thắt lưng.", "eng": "Her hair nearly reached down to her waist."}, {"viet": "Sự tử tế của bà ấy đối với các con tôi làm tôi rất quí bà ấy.", "eng": "Her kindness to my children really endeared her to me."}, {"viet": "Ôtô mới của cô ta chạy nhanh hơn chiếc cũ.", "eng": "Her new car goes faster than her old one."}, {"viet": "Đề nghị của cô ta gặp sự chống đối mạnh mẽ.", "eng": "Her proposal met with strong opposition."}, {"viet": "Những đồ nữ trang lấp lánh của cô ấy là vật hoàn hảo tôn nước da đẹp của cô lên.", "eng": "Her sparkling jewellery served as the perfect foil for her fine complexion."}, {"viet": "Tiếng hét báo động của cô ta đến quá muộn.", "eng": "Her warning shout came too late."}, {"viet": "Bản thân mình là đứa trẻ mồ côi cô ấy hiểu được hoàn cảnh đó.", "eng": "Herself an orphan, she understands the situation."}, {"viet": "Tính kiêu căng của anh ta đã làm cho anh ta có nhiều kẻ thù.", "eng": "His arrogance made him many enemies."}, {"viet": "Việc anh ta bảo vệ tự do ngôn luận được mọi người biết tới.", "eng": "His championship of freedom of speech is well known."}, {"viet": "Bàn viết của ông ấy luôn luôn tràn ngập giấy tờ.", "eng": "His desk is always covered with papers."}, {"viet": "Mặt ông ta nhăn nheo vì tuổi già.", "eng": "His face was wrinkled with age."}, {"viet": "Việc ông ta giải quyết cuộc khủng hoảng có thể một là làm nên sự nghiệp, hai là thất bại.", "eng": "His handling of the crisis could make or mar his career."}, {"viet": "Đất của anh ta tiếp giáp với đường cao tốc.", "eng": "His land abuts on the motorway."}, {"viet": "Mẹ cậu ta làm cậu ta yên lòng là mọi việc sẽ ổn cả thôi.", "eng": "His mother reassured him that everything would be all right."}, {"viet": "Nhân cách của anh ta bổ sung cho nhân cách của cô ấy.", "eng": "His personality is complementary to hers."}, {"viet": "Việc từ chức của ông ấy sẽ có hậu quả nghiêm trọng đối với công ty.", "eng": "His resignation will have serious repercussions on the firm."}, {"viet": "Văn phong của anh ta hơi giống văn phong của Wilde.", "eng": "His style distantly resembles that of Wilde."}, {"viet": "Cái ngực hay đau yếu của nó là di chứng bệnh tật thời thơ ấu.", "eng": "His weak chest was a legacy of a childhood illness."}, {"viet": "Hãy giữ tay lái bằng cả hai tay, như thế này.", "eng": "Hold the wheel in both hands, thus."}, {"viet": "Những ngôi nhà xây san sát bên nhau.", "eng": "Houses built in close proximity to each other."}, {"viet": "Làm sao mà anh có thể sống ở cái ổ chuột này được?", "eng": "How can you live in this dump?"}, {"viet": "Anh đối phó thế nào với vấn đề thị lực kém?", "eng": "How do you cope with the problem of poor vision?"}, {"viet": "Bạn có thể nín thở được bao lâu?", "eng": "How long can you hold your breath for?"}, {"viet": "Chúc ta cần mấy chục trứng để làm bánh?", "eng": "How many dozens of egg do we need to bake the case?"}, {"viet": "Anh trả hết bao nhiêu tiền cho căn nhà của anh?", "eng": "How much did you pay for your house?"}, {"viet": "Susan, công việc mới thế nào?", "eng": "How's the new job, Susan?"}, {"viet": "Nhanh lên, chúng ta để mất thời gian rồi.", "eng": "Hurry up, we're wasting time."}, {"viet": "Tôi muốn gọi cuộc gọi người nghe trả tiền đến Tokyo, Nhật Bản.", "eng": "I'd like to place a collect call to Tokyo, Japan."}, {"viet": "Tôi sẽ liên hệ với người phụ trách tầng ngay, và sẽ cho mang nó đến phòng của ông ngay khi chúng tôi tìm được.", "eng": "I'll contact the bell captain at once and have it sent to your room as soon as we find it."}, {"viet": "Tôi sẽ gặp bạn ở phòng đợi vào lúc 7 giờ.", "eng": "I'll meet you in the foyer at 7 o'clock."}, {"viet": "Tôi là người ủng hộ mạnh mẽ quyền lợi của phụ nữ.", "eng": "I'm a strong supporter of women's rights."}, {"viet": "Tôi vô cùng biết ơn sự giúp đỡ của anh.", "eng": "I'm enormously grateful for your help."}, {"viet": "Tôi lấy làm sung sướng làm công việc đó nhưng tôi không muốn buộc mình vào một ngày tháng đặc biệt nào.", "eng": "I'm happy to do this job, but I don't want to tie myself down to a particular date."}, {"viet": "Tôi không phải không biết rõ là tôi mang ơn anh đến chừng nào.", "eng": "I'm not insensible how much I owe to your help."}, {"viet": "Xin lỗi, tôi không hiểu ông nói gì.", "eng": "I'm sorry, I missed what you said."}, {"viet": "Tôi sợ đi máy bay lắm-Tôi thích đi đường biển hơn.", "eng": "I'm terrified of flying-I'd rather go by sea."}, {"viet": "Tôi bận nhổ cỏ trong vườn.", "eng": "I've been busy weeding in the garden."}, {"viet": "Tôi đã tìm được một công việc hoàn toàn thích hợp với tôi.", "eng": "I've found a job that suits me down to the ground."}, {"viet": "Từ lâu tôi đã quên không biết chúng tôi đã cãi nhau vì chuyện gì.", "eng": "I've long since forgotten what our quarrel was about."}, {"viet": "Tôi đã cố bỏ hút nhiều lần rồi, nhưng không có kết quả.", "eng": "I've tried to give up smoking several times, but it's no good."}, {"viet": "Tôi luôn trả nợ đúng hẹn, đó là một điều rất quan trọng về danh dự của tôi.", "eng": "I always pay my debts punctually, its a point of honour with me."}, {"viet": "Tôi căm phẫn trước sự tàn bạo về tội ác của người này.", "eng": "I am shocked by the atrocity of this man's crimes."}, {"viet": "Tôi gắn biển tên vào tất cả quần áo đi học của các em.", "eng": "I attached name tapes to all their school clothes."}, {"viet": "Sáng nay tôi đã gọi điện về việc phỏng vấn cô tối nay.", "eng": "I called this morning about doing an interview with you this evening."}, {"viet": "Tôi không thể theo kịp tất cả những thay đổi trong công nghệ máy tính.", "eng": "I can't keep up with all the changes in computer technology."}, {"viet": "Tôi chỉ nhớ mang máng về sinh nhật lần thứ tư của mình.", "eng": "I can dimly remember my fourth birthday."}, {"viet": "Bây giờ tôi không thể vội vàng được, tôi sẽ xem xét kế hoạch của anh khi tôi có thời gian.", "eng": "I cannot take time now, but I'll see about your plan when I have time."}, {"viet": "Tôi khen anh đầu bếp về bữa ăn tuyệt vời, sau đó tôi viết thư ca ngợi anh ta với ông chủ, người chủ tiệm ăn.", "eng": "I commended the chef on the excellent meal, I later wrote to commend him to his employer, the restaurant owner."}, {"viet": "Tôi cụng mạnh đầu vào khung cửa thấp.", "eng": "I cracked my head on the low door-frame."}, {"viet": "Tôi cảm kích sâu sắc việc anh đã giúp đỡ tìm ra thẻ tín dụng của tôi.", "eng": "I deeply appreciate your help in finding my credit card."}, {"viet": "Tôi không tin lời nào anh nói ra cả.", "eng": "I disbelieve every word you say."}, {"viet": "Tôi không thuộc lời bài hát nhưng tôi có thể ngân nga điệu bài đó cho anh nghe.", "eng": "I don't know the words of the song but I can hum it to you."}, {"viet": "Tôi cho rằng tôi chưa bao giờ trải qua một sự chán nản thật sự.", "eng": "I don't think I've ever experienced real depression."}, {"viet": "Tôi không muốn làm việc suốt đời trong một cơ quan-tôi muốn sống ra sống!", "eng": "I don't want to work in an office all my life-I want to live!"}, {"viet": "Tôi không muốn làm phiền bạn.", "eng": "I don't want to worry you."}, {"viet": "Tôi cảm thấy buồn chán vì tôi đã thi trượt.", "eng": "I feel depressed because I failed the test."}, {"viet": "Tôi thấy khó nói chuyện với anh ấy-chúng tôi hoàn toàn suy nghĩ khác nhau.", "eng": "I find him difficult to talk to-we're on completely different wavelengths."}, {"viet": "Tôi hết sức hài lòng với việc làm việc với trẻ con.", "eng": "I get great satisfaction from working with children."}, {"viet": "Tối qua tôi đã bị ác mộng.", "eng": "I had a bad dream last night."}, {"viet": "Tôi phải lê bước cày nát các vỉa hè mà rao bán xe.", "eng": "I had to go out and pound sidewalks to try to sell cars."}, {"viet": "Tôi bị đau bao tử dữ dội.", "eng": "I have a very bad stomachache."}, {"viet": "Tôi không có tin tức gì để thông báo.", "eng": "I have no news to impart."}, {"viet": "Tôi có hai anh trai và một em gái: ba anh chị em ruột cả thảy.", "eng": "I have two brothers and a sister: three siblings in all."}, {"viet": "Tôi nghe nói cô ta đã bỏ rơi anh bạn trai.", "eng": "I hear she's ditched her boy-friend."}, {"viet": "Tôi hy vọng là cô ấy chóng biết điều mà thôi đấu một trận mà cô không thể thắng.", "eng": "I hope she soon sees sense and stops fighting a battle she cannot win."}, {"viet": "Tôi mới vừa tìm được cách leo lên cầu thang.", "eng": "I just about manage to get up the stairs."}, {"viet": "Tôi biết rằng sự chế nhạo có thể là một tấm khiên, nhưng không phải là một vũ khí.", "eng": "I know that ridicule may be a shield, but it is not a weapon."}, {"viet": "Tôi thích nước sơn màu nhạt hơn.", "eng": "I like the light-colored paints better."}, {"viet": "Tôi sẽ kiểm tra cho bà.", "eng": "I'll check up for you."}, {"viet": "Tôi sẽ mang nó đến phòng của bà ngay.", "eng": "I'll send it to your room immediately."}, {"viet": "Tôi kỵ công việc nặng nhọc lắm!", "eng": "I'm allergic to hard work!"}, {"viet": "Ở đó, tôi làm ở phòng Thương mại.", "eng": "I'm in the sales department there."}, {"viet": "Tôi rất tiếc, đường dây đang bận.", "eng": "I'm sorry, the line is engaged."}, {"viet": "Tôi thán phục về vẻ đẹp của cảnh vật.", "eng": "I marveled at the beauty of the landscape."}, {"viet": "Tôi phải nhớ trong đầu là mua cà phê là chúng tôi cần thêm cà phê.", "eng": "I must make a mental note to buy coffee that we need more coffee."}, {"viet": "Tôi không bao giờ nghĩ là một vài khoản ấy lại lên tới nhiều đến như vậy.", "eng": "I never expected those few items to come to so much."}, {"viet": "Tôi chỉ phải trả 3000 bảng Anh cho chiếc xe ôtô cũ này nhưng nó đáng giá hơn thế nhiều.", "eng": "I paid only £ 3000 for this used car but it's worth a lot more."}, {"viet": "Sáng nay tôi đã chạm trán một bạn học cũ ở siêu thị.", "eng": "I ran into an old schoolfriend at the supermarket this morning."}, {"viet": "Tôi từ chối không trao đổi thư từ với ông ta về điều đó.", "eng": "I refused to enter into any correspondence with him about it."}, {"viet": "Tôi gặp anh ấy thứ tư nhưng từ đó đến nay chưa nói chuyện với anh ấy.", "eng": "I saw him on Wednesday, but I haven't spoken to him since."}, {"viet": "Tôi sẽ phải thu hết cảm đảm nói với cô ta về điều đó.", "eng": "I shall have to pluck up courage and speak to her about it."}, {"viet": "Tôi đã ở một tuần tại Cancun và chưa nghe thấy nói ai bị ỉa chảy cả.", "eng": "I spent a week in Cancun and never even heard of anybody with Aztec two-step."}, {"viet": "Tôi phát chán lên khi anh ấy bắt đầu nói về ôtô.", "eng": "I switch off when he starts talking about cars."}, {"viet": "Tôi nghĩ đi chơi bằng xe đạp là một ý kiến hay đấy.", "eng": "I think it's a good idea to go outing by bike."}, {"viet": "Tôi nghĩ anh đã biết gần như tất cả mọi người ở đây rồi.", "eng": "I think you already know almost everyone here."}, {"viet": "Tôi xem thoáng qua chiếc ôtô đó và đề nghị mua nó ngay tại chỗ.", "eng": "I took one look at the car and offered to buy it there and then."}, {"viet": "Tôi đã tìm ra được bức chân dung này trên gác mái.", "eng": "I unearthed the portrait from the attic."}, {"viet": "Tôi muốn nghe ý kiến đề xuất ngày hôm nay làm gì.", "eng": "I want suggestions about what to do today."}, {"viet": "Mẹ muốn con học giỏi mà.", "eng": "I want you to do well in school."}, {"viet": "Tôi lúng túng vì những lời nói thán phục quá đáng của họ.", "eng": "I was embarrassed by their fulsome expressions."}, {"viet": "Tôi chỉ đến chậm có hai phút mà họ đã đi tất cả rồi.", "eng": "I was only two minutes late but they'd all buggered off."}, {"viet": "Tôi đã ra công giúp đỡ, nhưng lại không làm nên trò gì.", "eng": "I was trying to help, but I screwed up again."}, {"viet": "Tôi sẽ tiêm cho ông một mũi thuốc.", "eng": "I will give you a shot."}, {"viet": "Tôi không đi vào chi tiết nhưng nói tóm lại là chúng tôi lỡ tàu.", "eng": "I won't go into details but the long and the short of it was that we missed the train."}, {"viet": "Tôi phải đề phòng lạc quan thái quá.", "eng": "I would caution against undue optimism."}, {"viet": "Tôi muốn đưa vợ tôi đến nơi nào đó đặc biệt để ăn tối.", "eng": "I would like to take my wife somewhere special for dinner."}, {"viet": "Những tư tưởng được thịnh hành trong một thời gian ngắn hồi thế kỷ mười tám.", "eng": "Ideas which had enjoyed a brief currency during the eighteenth century."}, {"viet": "Nếu tôi không gởi hoa cho cô ta thì cô ta nói Chẳng bao giờ anh gửi hoa cho em, và nếu tôi gửi thì cô ta nói Anh cảm thấy tội lỗi về chuyện gì vậy? Tôi thật không có cách nào làm hài lòng thiên hạ!", "eng": "If I don't send her flowers she says You never send me flowers, and if I do she says What are you feeling guilty about? I gust can't win!"}, {"viet": "Nếu thế thì chúng ta có thể dùng vỏ trứng làm phân bón.", "eng": "If that's so we can use egg shells as fertilizer."}, {"viet": "Nếu chúng ta quét vôi nhà bếp hôm nay không xong thì ngày mai có thể làm tiếp.", "eng": "If we don't finish painting the kitchen today, we can go on with it tomorrow."}, {"viet": "Nếu anh không mua được thì đừng lo.", "eng": "If you can't, don't worry."}, {"viet": "Nếu anh có bạn bè xấu thì đạo đức anh sẽ bị suy thoái.", "eng": "If you have bad friends, your morals may be corrupted."}, {"viet": "Nếu bạn sử dụng gương bạn có thể thấy được phía sau đầu của bạn.", "eng": "If you use mirrors you can see the back of your head."}, {"viet": "Vào năm 1934, kể từ đó anh đi vào vẽ phong cảnh và chân dung.", "eng": "In 1934, since when he has been working at landscapes and portraits."}, {"viet": "Trong tiếng Anh, chữ's'trong từ'sip'và chữ'z'trong từ'zip'là hai âm vị khác nhau.", "eng": "In English, the's'in'sip'and the'z'in'zip'represent two different phonemes."}, {"viet": "Theo ý kiến tôi, đây chính là cách giải quyết vấn đề.", "eng": "In my book this is the way to handle it."}, {"viet": "Sau những việc như vậy tôi nghĩ tôi nên ở nhà.", "eng": "In the circumstances I think I should stay at home."}, {"viet": "Ở miền Tây, có rặng núi Rocky và Sierra Nevada, với những đỉnh núi phủ tuyết, và ở miền Đông hoang dã, rặng Appalachians có rừng bao phủ, mà đỉnh cao nhất của nó gần 7.000 bộ.", "eng": "In the West, there are the Rocky Mountains and the Sierra Nevada, with their snow-capped peaks, and in the East the wild, forest-covered Appalachians, whose highest summit is nearly 7,000 feet."}, {"viet": "Lạm phát đã đẽo dần số tiền tiết kiệm của họ.", "eng": "Inflation has whittled away their savings."}, {"viet": "Vào mùa thu trời lạnh hay ấm áp?", "eng": "Is it cold or warm in autumn?"}, {"viet": "Có nhà hàng nào ông có thể giới thiệu không?", "eng": "Is there a restaurant that you recommend?"}, {"viet": "Anh ta chẳng là người đàn ông bé nhỏ trông có vẻ kỳ dị hay sao?", "eng": "Isn't he a curious-looking little man?"}, {"viet": "Đây là một kỹ thuật chúng ta chỉ có thể áp dụng đối với những mặt hàng tương đối rẻ và sản xuất đơn giản.", "eng": "It's a technique we can only use for items which are comparatively cheap and simple to produce."}, {"viet": "Thật khó có thể đánh giá được tác động của bài diễn văn của tổng thống.", "eng": "It's difficult to assess the impact of the President's speech."}, {"viet": "Vì lợi ích của công ti phải khuyến khích các thành viên.", "eng": "It's in companies interests to encourage union membership."}, {"viet": "Huấn luyện nhân viên mới không phải là phần việc của tôi.", "eng": "It's not part of my brief to train new employees."}, {"viet": "Thật là ngu ngốc nếu cứ bỏ tiền ra đi học nhạc mà chẳng bao giờ tập tành gì cả.", "eng": "It's stupid to go to the expense of taking music lessons if you never practise."}, {"viet": "Chúng nó đã tìm cách thoát được thì thật là kì lạ.", "eng": "It's wonderful that they managed to escape."}, {"viet": "Đương nhiên là tôi sẽ giúp cậu.", "eng": "It goes without saying that I'll help you."}, {"viet": "Mua xe ôtô mà không có giấy bảo hành thì thật là ngốc nghếch.", "eng": "It is foolish to buy a car without a warranty."}, {"viet": "Ngắt lời người khác đang nói là bất lịch sự.", "eng": "It is rude to interrupt when other people are speaking."}, {"viet": "Trời có thể mưa-anh nên mang ô đi thì hơn ( ngộ ) nhỡ ra ( trời mưa ).", "eng": "It may rain-you'd better take an umbrella ( just ) in case ( it does )."}, {"viet": "Đó đúng là thứ tôi cần.", "eng": "It's just what I needed."}, {"viet": "Hình như với tôi, chúng tôi đã cưới nhau khoảng 5 năm … Thế là lâu lắm rồi.", "eng": "It seems like we've been married about five years to me. That's quite a long time."}, {"viet": "Thông thường việc này có hơn mười bước đấy ạ.", "eng": "It usually involves more than ten steps."}, {"viet": "Đạo này được lập ra ở Tây Tạng và nổi bật bởi nghi lễ cầu kỳ và một tổ chức phân cấp chặt chẽ.", "eng": "It was established in Tibet and was characterized by elaborate ritual and a strong hierarchical organization."}, {"viet": "Thật kỳ cục là tôi lại đi hỏi cô ta kiếm được cái đó ở đâu.", "eng": "It was so odd that I was moved to ask her where she got it."}, {"viet": "Họ không trả lời các thư của tôi làm tôi lo lắng.", "eng": "It worries me that they haven't answered my letters."}, {"viet": "Nước Nhật đang tiến nhanh trong cuộc đua phát triển công nghệ mới.", "eng": "Japan is galloping ahead in the race to develop new technologies."}, {"viet": "Các nhà báo không phải bao giờ cũng đúng ( về những vấn đề họ viết ).", "eng": "Journalists are not always accurate ( in what they write )."}, {"viet": "Keyaki, con sẽ dọn bàn nhé?", "eng": "Keyaki, would you set the table?"}, {"viet": "Bob này, chúng ta đi ra biển cuối tuần này nhé.", "eng": "Let's go to the coast this weekend, Bob."}, {"viet": "Đời sống ở đây dễ dàng hơn là ta thường thấy.", "eng": "Life here is much easier than it used to be."}, {"viet": "Nhiều nhà đầu tư thua lỗ nhiều tiền bạc ở thị trường chứng khoán.", "eng": "Many investors took a terrible bath in the stock market."}, {"viet": "Mark là một đứa bé khó bảo và tôi cho rằng họ đã làm tốt việc dạy dỗ nó.", "eng": "Mark's a difficult child and I think they're making a good job of bringing him up."}, {"viet": "Xin cho tôi xem thẻ tín dụng của ông?", "eng": "May I have your credit card?"}, {"viet": "Trong khi đó, tôi sẽ kiểm tra giờ chuyến bay của Paul đến.", "eng": "Meanwhile, I'll check the arrival time for Paul's flight."}, {"viet": "Hầu hết các danh từ ở số nhiều trong tiếng Anh đều tận cùng bằng's'.", "eng": "Most plural nouns in English end in's'."}, {"viet": "Việc nhân số này với số khác.", "eng": "Multiplication of one number by another."}, {"viet": "Sự chờ đợi anh gọi điện chỉ là điều ước đoán của tôi thôi.", "eng": "My expecting you to call was just a surmise."}, {"viet": "Ông chủ nhà tôi doạ sẽ tăng tiền thuê nhà lên 810 pao một tuần.", "eng": "My landlord's threatening to put the rent up by 810 pounds a week."}, {"viet": "Gia đình chị tôi bất ngờ đến thăm chúng tôi cuối tuần này.", "eng": "My sister's family is descending on us this weekend."}, {"viet": "Các cuộc thương lượng giữa các nghiệp đoàn và ban quản trị trở nên khó khăn hơn do sự thiếu tin cậy lẫn nhau.", "eng": "Negotiations between unions and management are made more difficult by mutual distrust."}, {"viet": "Không, nhưng ngày mai tôi muốn xem phim.", "eng": "No, but I wouldn't mind seeing one tomorrow."}, {"viet": "Cho dù chuyện gì xảy ra đi nữa, họ cũng sẽ luôn luôn ở đó để giúp đỡ nhau.", "eng": "No matter what happens, they will always be there for each other."}, {"viet": "Bây giờ đây là tờ đơn xin chính thức để đòi hoàn lại tiền cho ngân phiếu du lịch bị mất.", "eng": "Now here's the official application form for claiming refund for lost traveller's cheques."}, {"viet": "Tất nhiên là tôi không thích các thành phố lớn.", "eng": "Of course, I don't like big cities."}, {"viet": "Dầu có chất lượng thương phẩm khá.", "eng": "Oil is present in commercial quantities."}, {"viet": "Trong trường hợp này, máy bay trệch khỏi hướng thường lệ của nó.", "eng": "On this occasion the plane deviated from its usual flight path."}, {"viet": "Một trong những nguyên lý cơ bản của đức tin Cơ đốc giáo.", "eng": "One of the basic tenets of the Christian faith."}, {"viet": "Con bò đực của chúng tôi đoạt giải nhất tại triển lãm nông nghiệp.", "eng": "Our bull took first prize at the agricultural show."}, {"viet": "Phóng viên của chúng tôi ở Hong Kong, Trung Đông v. v.", "eng": "Our Hong Kong, Middle East, etc correspondent."}, {"viet": "Con tàu của chúng tôi mắc cạn ở vùng nước nông.", "eng": "Our ship grounded in shallow water."}, {"viet": "Từ Oxford đi London mất khoảng một tiếng đồng hồ đi xe lửa.", "eng": "Oxford to London is about an hour's run by train."}, {"viet": "Mọi người tham gia vận động làm giảm tiếng ồn trong các thành phố của chúng ta.", "eng": "People are campaigning to abate the noise in our cities."}, {"viet": "Peter, tôi có thể nói chuyện riêng với cậu sau giờ học được không?", "eng": "Peter, could I have a word with you after class?"}, {"viet": "Các nhà chính trị đủ các đảng phái, những người sùng đạo, và một hoặc hai người cuồng trí nữa.", "eng": "Politicians of all kinds, religious people, and one or two madmen."}, {"viet": "Việc cứu hộ con tàu đắm gặp khó khăn do thời tiết xấu.", "eng": "Salvage of the wreck was made difficult by bad weather."}, {"viet": "Nhiều làng xóm đã bị cô lập vì mưa tuyết rất dày.", "eng": "Several villages have been isolated by heavy snowfalls."}, {"viet": "Cô ta là một thiên tài về giải các ô chữ.", "eng": "She's a genius at doing cross-word puzzles."}, {"viet": "Mới đây cô ấy rất hồi hộp trông chờ kết quả thi cử.", "eng": "She's been very edgy recently, waiting for the examination results."}, {"viet": "Cô ta vừa mới đi ra với cái ông bạn gì gì đó.", "eng": "She's just gone out with old what you call him."}, {"viet": "Bà ấy đang tràn đầy sức khỏe và sinh lực.", "eng": "She's running over with health and vitality."}, {"viet": "Bà ấy tố cáo chính phủ đã hèn nhát đầu hàng các quyền lợi của giới kinh doanh lớn.", "eng": "She accused the government of a cowardly surrender to big-business interest."}, {"viet": "Cô ta được bà di nuôi dưỡng trở thành người sau khi cha mẹ cô ta qua đời.", "eng": "She became her aunt's charge after her parents died."}, {"viet": "Cô ấy đóng cửa vì trời lạnh.", "eng": "She closed the window as it was chilly."}, {"viet": "Cô ấy bảo vệ mình với một thái độ hung hăng mới, đột ngột.", "eng": "She defended herself with a sudden new aggression."}, {"viet": "Cô ta uống rượu vang và bia nhưng không uống rượu mạnh.", "eng": "She drinks wine and beer but no liquor."}, {"viet": "Bà ta kết thúc bài nói của mình bằng một câu trích dẫn Shakespeare.", "eng": "She finished her speech with a quotation from Shakespeare."}, {"viet": "Trong vụ mua bán đó, cô ta đã kiếm chác được 5 phần trăm tiền hoa hồng.", "eng": "She got a rake-off of 5 per cent from the deal."}, {"viet": "Cô ấy ở trong phòng để tránh sự đối đầu.", "eng": "She had stayed in her room to avoid another confrontation."}, {"viet": "Cô ấy suốt đời lận đận.", "eng": "She has had a difficult path through life."}, {"viet": "Bà ấy hối thúc các con đi học và bắt đầu làm việc.", "eng": "She hustled the children off to school and started working."}, {"viet": "Bà ta tự ra ứng cử vào uỷ ban.", "eng": "She is putting up for election to the committee."}, {"viet": "Cô ấy đã làm bục chỉ chiếc quần chật ống mới do trèo hàng rào.", "eng": "She laddered her new tights climbing the fence."}, {"viet": "Cô ta coi thường những người chưa bao giờ học đại học.", "eng": "She looks down on people who've never been to university."}, {"viet": "Cô ấy chắc hẳn đã bị sái mắt cá chân khi ngã xuống.", "eng": "She must have wrenched her ankle when she fell."}, {"viet": "Cô ta dự tính sẽ học một khoá ngôn ngữ học ứng dụng.", "eng": "She plans to take a course in applied linguistics."}, {"viet": "Bà ta viết lại bài giảng của bà thành một bài nói chuyện trên đài phát thanh.", "eng": "She recast her lecture as a radio talk."}, {"viet": "Cô ta hoàn toàn là người xa lạ đối với tôi.", "eng": "She's an utter stranger to me."}, {"viet": "Cô bé đã mười sáu tuổi, gần tới mười bảy.", "eng": "She's sixteen, going on seventeen."}, {"viet": "Cô ấy khép mình trong phòng riêng để làm việc.", "eng": "She secluded herself in her studio to work."}, {"viet": "Cô ấy đóng sầm cửa ra vào và nặng nề bước ra khỏi nhà.", "eng": "She slammed the door and stomped out of the house."}, {"viet": "Cô ấy đứng lên hát một bài không có nhạc đệm.", "eng": "She stood up and sang an acappella song."}, {"viet": "Cô ấy nghĩ không có đủ bánh mì nhưng lại có nhiều.", "eng": "She thought there wasn't enough bread, but there was plenty."}, {"viet": "Cô ta gỡ tóc ra khỏi máy sấy tóc.", "eng": "She untangled her hair from the hair-drier."}, {"viet": "Cô ấy bị buộc tội có quan hệ tình dục với một số người.", "eng": "She was accused of being intimate with several men."}, {"viet": "Cô ấy sinh ra đứa con khoẻ mạnh.", "eng": "She was delivered of a healthy child."}, {"viet": "Chị ấy đã giúp kiếm việc làm cho tôi.", "eng": "She was instrumental in getting me a job."}, {"viet": "Cô ta thực sự sinh động vì hạnh phúc tại lễ cưới.", "eng": "She was really sparkling with happiness at the wedding."}, {"viet": "Cô ta hoàn toàn không tin cậy được, nên đã bị đuổi.", "eng": "She was totally unreliable, so she got her marching orders."}, {"viet": "Cô ta đã bị tòa xử về tội sát nhân.", "eng": "She went on trial for murder."}, {"viet": "Cô ta đeo một cái thắt lưng rộng quanh eo.", "eng": "She wore a wide belt round her waist."}, {"viet": "Giầy bán xôn rẻ hơn 5 bảng Anh.", "eng": "Shoes are on sale with £ 5 off."}, {"viet": "Đánh tín hiệu cho sĩ quan chỉ huy rằng.", "eng": "Signal to the commanding officer that."}, {"viet": "Sáu giờ đúng, nếu không tôi có thể lỡ chuyến bay.", "eng": "Six o'clock sharp, otherwise I might miss my flight."}, {"viet": "Những người hút thuốc nuốt khói thì có thể trở nên nghiện chất ni-cô-tin.", "eng": "Smokers who inhale are likely to become addicted to nicotine."}, {"viet": "Vì vậy chúng tôi sẽ dùng thử một số món ăn Quảng Đông.", "eng": "So we'd like to try some Cantonese food."}, {"viet": "Một vài thể trạng dễ mắc bệnh lao.", "eng": "Some constitutions are predisposed to consumption."}, {"viet": "Một số người rất khâm phục ông ta song những người khác lại xem ông ấy là một kẻ ưa làm bộ làm tịch mà thôi.", "eng": "Some people admired him greatly while others considered him a poseur."}, {"viet": "Phải có người nào đó mở chuồng-con sư tử không thể tự nó đã thoát ra được.", "eng": "Somebody must have opened the cage-the lion couldn't have escaped on its own."}, {"viet": "Xin lỗi làm phiền bà, nhưng tôi có một điện khẩn của chồng ba.", "eng": "Sorry to disturb you, but I have an urgent message from your husband."}, {"viet": "Những trận mưa hoặc mưa tuyết có gió mạnh từng cơn.", "eng": "Squally showers of rain or sleet."}, {"viet": "Tiếp tục làm một công việc cho đến khi nó được hoàn thành.", "eng": "Stick to a task until it is finished."}, {"viet": "Lược nước khỏi bắp cải khi nó đã chín.", "eng": "Strain off the water from the cabbage when it is cooked."}, {"viet": "Trận bão như thế gây trở ngại cho hạm đội đó.", "eng": "Such a storm will weather the fleet in."}, {"viet": "Chủ Nhật là ngày nghỉ ngơi.", "eng": "Sunday is a day of rest."}, {"viet": "Bật lò sưởi lên-tôi lạnh quá!", "eng": "Switch the heating on-I'm cold!"}, {"viet": "Hãy mang lên cho bố cốc nước này.", "eng": "Take your father up this glass of water."}, {"viet": "Hãy cho tôi biết nếu bạn cần giúp một tay.", "eng": "Tell me if you need a hand."}, {"viet": "Cám ơn, nhưng lần khác tôi sẽ gọi điện lại.", "eng": "Thanks, but I'll call again another time."}, {"viet": "Chiếc xe đạp ấy không phải của anh ta, nó là của anh anh ta.", "eng": "That bicycle isn't his own, it belongs to his brother."}, {"viet": "Nhà đó của bạn ở dưới quê.", "eng": "That house of yours in the country."}, {"viet": "Đĩa hát mới đó bán chạy như tôm tươi.", "eng": "That new recording sold like hot cakes."}, {"viet": "Đó là lý do tại sao tôi đến đây.", "eng": "That's why I'm here."}, {"viet": "Từ đó viết không đúng chính tả.", "eng": "That word is not spelled correctly."}, {"viet": "Bị cáo đã được chứng nhận là mất trí.", "eng": "The accused has been certified to be insane."}, {"viet": "Không gian ngát hương thơm.", "eng": "The air was impregnated with the scent."}, {"viet": "Người dẫn chương trình mời mọi người nhảy múa.", "eng": "The announcer invites everyone to dance."}, {"viet": "Quân đội kết hợp với cảnh sát để săn lùng bọn tội phạm.", "eng": "The army is acting in conjunction with the police in the hunt for the terrorists."}, {"viet": "Khán giả bắt đầu vỗ tay chầm chậm và nhịp nhàng để tỏ vẻ sốt ruột.", "eng": "The audience a slow handclap to show their impatience."}, {"viet": "Đứa bé ở nhà bên cạnh làm cho tôi không ngủ được.", "eng": "The baby next door kept me awake."}, {"viet": "Ông giám đốc ngân hàng thực sự là có lỗi dù cho ông ta cố quy trách nhiệm cho một nhân viên.", "eng": "The bank manager was really to blame, though he try to pin it on a clerk."}, {"viet": "Những bãi biển đẹp là nơi nổi tiếng nhất của hòn đảo.", "eng": "The beautiful beaches are the island's main attraction."}, {"viet": "Con chim đã bị bắn rớt khi đang bay.", "eng": "The bird had been shot down in flight."}, {"viet": "Xác chết cho thấy một số lượng asenic ít ỏi trong ruột.", "eng": "The body showed traces of arsenic in the intestines."}, {"viet": "Kệ sách đó quá cao tôi không thể với tới được.", "eng": "The bookshelf is too high for me to reach."}, {"viet": "Các cậu bé bị gọi lần lượt đến gặp ông giám khảo.", "eng": "The boys were summoned in turn to see the examiner."}, {"viet": "Việc xây dựng trung tâm buôn bán mới là một sự xúc phạm, bà ta phản đối.", "eng": "The building of the new shopping centre is an outrage, she protested."}, {"viet": "Giá mua hôm nay là 27.", "eng": "The buying rate today is 27."}, {"viet": "Chiếc xe ôtô chạy tới ghé sát theo lề đường.", "eng": "The car drew up alongside the kerb."}, {"viet": "Cái thảm đó cần được làm sạch trong giây lát bằng một chiếc máy hút bụi.", "eng": "The carpet needs a quick once-over with a hoover."}, {"viet": "Nhân vật trung tâm của một quyển tiểu thuyết.", "eng": "The central character in a novel."}, {"viet": "Các công ti hoá chất đang đầu độc các dòng sông của chúng ta bằng chất thải.", "eng": "The chemical companies me poisoning on rivers with effluent."}, {"viet": "Đứa bé chơi một bản nhạc của Chopin chốc chốc lại vấp.", "eng": "The child stumbled through a piece by Chopin."}, {"viet": "Mấy đứa nhỏ có dịp vui chơi thoả thích ở rạp xiếc.", "eng": "The children had the time of their lives, at the circus."}, {"viet": "Chẳng thấy lũ trẻ đâu cả.", "eng": "The children were nowhere to be seen."}, {"viet": "Nền văn minh của nhân loại đã tiến bộ trong thế kỉ này.", "eng": "The civilization of mankind advanced in this century."}, {"viet": "Câu lạc bộ đó do một nhóm nhỏ các nhà trí thức khống chế.", "eng": "The club is dominated by a small clique of intellectuals."}, {"viet": "Những màn hài đó trong vở kịch đã diễn quá lố.", "eng": "The comic scenes in the play were overdone."}, {"viet": "Công ty đó đề nghị tiền lương cao.", "eng": "The company has offered a high salary."}, {"viet": "Đại biểu dự hội nghị gồm có các đại diện từ nước ngoài.", "eng": "The conference delegates included representatives from abroad."}, {"viet": "Tội nhân được giảm án vì có hạnh kiểm tốt.", "eng": "The convict's sentence was reduced for good behaviour."}, {"viet": "Đất nước phải bảo đảm an toàn nền quốc phòng của mình.", "eng": "The country must look to its defenses."}, {"viet": "Thủy thủ đoàn cố giành quyền điều khiển con tàu và bị bắn vì tội phản loạn.", "eng": "The crew tried to seize control of the ship, and were shot for mutiny."}, {"viet": "Chiến dịch về đạo đức tình dục đang biến thành một cuộc khủng bố tư tưởng.", "eng": "The crusade for sexual morality is turning into a witch-hunt."}, {"viet": "Mối nguy hiểm nhắc nhở ông ấy về ý thức nghĩa vụ.", "eng": "The danger recalled him to a sense of duty."}, {"viet": "Các đội bảo vệ tranh chấp từng tấc đất.", "eng": "The defending troops dispute every inch of ground."}, {"viet": "Sự phát triển tài năng ngôn ngữ ở trẻ em.", "eng": "The development of language skills in young children."}, {"viet": "Viên chức bị thất sủng đã bị tước hết quyền hành.", "eng": "The disgraced official was divested of all authority."}, {"viet": "Bác sĩ nói rằng tôi không bị rối loạn cơ quan nào cả.", "eng": "The doctor said there was nothing organically wrong with me."}, {"viet": "Sự hành hạ con chó bởi chủ của nó.", "eng": "The dog's maltreatment by his owner."}, {"viet": "Tài xế phanh gấp khi đứa bé vọt ra đường trước mặt ông.", "eng": "The driver braked hard as the child ran onto the road in front of him."}, {"viet": "Trận động đất làm tất cả đồng hồ đứng lại hết.", "eng": "The earthquake stopped all the clocks."}, {"viet": "Kỳ nghỉ chấm dứt quá sớm.", "eng": "The end of the holiday came all too soon."}, {"viet": "Sự xói mòn bờ do nước biển gây ra.", "eng": "The erosion of the coastline by the sea."}, {"viet": "Sự giãn nở của khí đốt khi bị đốt nóng.", "eng": "The expansion of the gases when heated."}, {"viet": "Sự sụp đổ của chính phủ đã dẫn đến nội chiến.", "eng": "The fall of the Government resulted in civil war."}, {"viet": "Hàng rào chắn mất tầm nhìn ra biển của chúng tôi.", "eng": "The fence cuts off our view of the sea."}, {"viet": "Cuốn phim diễn tiến chậm chạp.", "eng": "The film was lacking in pace."}, {"viet": "Hãng này liên kết với một công ty phân phối nhỏ để giảm bớt các chi phí.", "eng": "The firm joined up with a small delivery company to reduce costs."}, {"viet": "Ông ngư dân đã đánh bắt được một con cá quá to.", "eng": "The fisherman has caught a whopper."}, {"viet": "Đội bóng đó đã được nâng lên hàng đầu.", "eng": "The football team was promoted to the first division."}, {"viet": "Phong cảnh phía trước rất đẹp.", "eng": "The front view is very beautiful."}, {"viet": "Khu vườn ở cạnh sân gôn.", "eng": "The garden neighbours on a golf-course."}, {"viet": "Cái cốc vỡ tan khi nó rơi xuống đất.", "eng": "The glass slivered when it fell."}, {"viet": "Thông báo của chính phủ đưa những chi tiết của việc tăng thuế chút ít.", "eng": "The Government announcement gave details of small increasea in taxes."}, {"viet": "Chính phủ có trách nhiệm với an ninh của đất nước.", "eng": "The Government is responsible for the security of the country."}, {"viet": "Cuộc chạy đua toàn quốc vẫn sẽ được tiến hành mặc dầu thời tiết xấu.", "eng": "The Grand National will be run in spite of the bad weather."}, {"viet": "Cảnh tượng khiếp đảm đó làm cho tôi ớn xương sống.", "eng": "The gruesome sight sent a shiver down my spine."}, {"viet": "Quai của chiếc ấm trà này hình dáng thô kệch.", "eng": "The handle of this teapot has an awkward shape."}, {"viet": "Hàng rào cao giúp chúng tôi tránh gió được phần nào.", "eng": "The high fence affords us some shelter from the wind."}, {"viet": "Các phòng bệnh viện đã được xông khói sau khi xuất hiện sốt phát ban.", "eng": "The hospital wards were fumigated after the outbreak of typhus."}, {"viet": "Ngôi nhà đó ở trên sườn đồi.", "eng": "The house is on the side of a hill."}, {"viet": "Ý nghĩ nhận hối lộ thật tởm lợm đối với tôi.", "eng": "The idea of accepting a bribe was repugnant to me."}, {"viet": "Tính trì trệ của một bộ máy quan liêu đã bám rễ.", "eng": "The inertia of a an entrenched bureaucracy."}, {"viet": "Người phỏng vấn dồn chính khách ấy vào thế bí bằng một câu hỏi hết sức lắt léo.", "eng": "The interviewer cornered the politician with a particularly tricky question."}, {"viet": "Toàn thể gia đình nhà Jones sẽ cùng nhau đến ăn bữa trưa-cả thảy mười hai người!", "eng": "The Joneses are coming for lunch en masse-all twelve of them!"}, {"viet": "Trận đấu lùi lại vì mưa.", "eng": "The kick-off was delayed because of rain."}, {"viet": "Phong cảnh ở Mỹ cực kỳ phong phú và ngoạn mục.", "eng": "The landscape in the U. S. is enormously varied and spectacular."}, {"viet": "Vụ ám sát nhà lãnh đạo đã dẫn đến những sự hỗn loạn về chính trị.", "eng": "The leader's assassination led to political convulsions."}, {"viet": "Cuộc sống nhộn nhịp trong một thành phố lớn.", "eng": "The life pulsing through a great city."}, {"viet": "Xe buýt đi London mỗi giờ có một chuyến vào đúng giờ chẵn.", "eng": "The London bus departs every hour on the hour."}, {"viet": "Máy sẽ dừng lại khi nó đến điểm dừng của nó.", "eng": "The machine will stop when it reaches its cutoff point."}, {"viet": "Ban giám đốc báo trước về sự cần thiết phải tiết kiệm hơn nữa.", "eng": "The management warned of the need for further belt-tightening."}, {"viet": "Vấn đề này đã được giải quyết theo sắc lệnh của tổng thống.", "eng": "The matter was settled by presidential fiat."}, {"viet": "Các hội viên rất bực mình về lời đề nghị của bạn.", "eng": "The membership are very annoyed at your suggestion."}, {"viet": "Bộ trưởng quốc phòng đi thăm mặt trận phía tây.", "eng": "The minister of Defence paid a visit to the Western Front."}, {"viet": "Ánh trăng toả sáng trên đồng bằng.", "eng": "The moon cast a brilliant light over the plain."}, {"viet": "Con chuột chạy vội vào lỗ khi con mèo xuất hiện.", "eng": "The mouse scurried into its hole when the cat appeared."}, {"viet": "Các hạ sĩ quan cung cấp đồng phục xanh lá cây cho các tân binh.", "eng": "The NCOs suited the recruits in green uniforms."}, {"viet": "Những dân nhập cư mới vào xứ này chưa thích nghi hoàn toàn với xã hội.", "eng": "The new immigrants to the country who are not fully socialized."}, {"viet": "Người sinh viên mới đó khởi đầu quan hệ không hay đối với thầy giáo vì đã trả lời thầy một cách vô lễ.", "eng": "The new student started off on the wrong foot with the teacher by answering back rudely."}, {"viet": "Sáng hôm sau, B nhận được một bức điện tín của Paul: ĐẾN NGÀY HAI MƯƠI LĂM THÁNG TƯ CHUYẾN BAY SỐ MỘT PAA.", "eng": "The next morning, B receives a cable from Paul: ARRIVING APRIL TWENTY-FIFTH PAA FLT ONE."}, {"viet": "Con số đã tăng lên cao vào đầu năm sau.", "eng": "The number had increased by the beginning of the following year."}, {"viet": "Viên sĩ quan ra lệnh cho binh lính dừng lại để nghỉ.", "eng": "The officer halted his troops for a rest."}, {"viet": "Những tiếng rao cũ ở phố Luân Đôn, thí dụ cá trích tươi đây!", "eng": "The old street cries of London, eg Fresh herrings!"}, {"viet": "Tổ chức này hoạt động để thúc đẩy tình hữu nghị giữa các dân tộc.", "eng": "The organization works to promote friendship between nations."}, {"viet": "Hoàng cung vừa mới đưa ra một tuyên bố.", "eng": "The palace has just issued a statement."}, {"viet": "Động tính từ quá khứ của sing là sung và động tính từ hiện tại là singing.", "eng": "The past participle of sing is sung and the present participle is singing."}, {"viet": "Con người cổ xưa rất sung sướng khi thấy ngày bắt đầu dài hơn.", "eng": "The people of long ago were very happy when the days began getting longer."}, {"viet": "Năng khiếu về nhạc của nhạc sĩ dương cầm.", "eng": "The pianist's sensitive musicianship."}, {"viet": "Nơi họ sống, mất khoảng 30 phút đi xe lửa từ ga thị trấn Sendai.", "eng": "The place where they live is about 30 minutes by trainf from downtown Sendai station."}, {"viet": "Những cái đĩa có viền xanh ở vành.", "eng": "The plates have a blue stripe round the edge."}, {"viet": "Nhà thơ đã hình tượng hóa người tình của mình bằng một bông hoa.", "eng": "The poet has symbolized his lover with a flower."}, {"viet": "Cảnh sát đã loại hai đối tượng nghi vấn ( ra khỏi cuộc điều tra ).", "eng": "The police have eliminated two suspects ( from their enquiry )."}, {"viet": "Cảnh sát đã đến tại hiện trường trong vòng vài phút sau khi tôi gọi điện thoại đến.", "eng": "The police were on the spot within a few minutes of my telephone call."}, {"viet": "Người ta nói bóng gió đến khả năng có một cuộc bầu cử sớm.", "eng": "The possibility of an early election has been hinted at."}, {"viet": "Việc Tổng thống tới là tín hiệu làm bùng nổ một sự hoan hô ầm ĩ.", "eng": "The President's arrival was the signal for an outburst of cheering."}, {"viet": "Những người thuê trước đây đã để lại ngôi nhà trong một trình trạng lộn xộn, bẩn thỉu ghê gớm.", "eng": "The previous occupants had left the house in a terrible mess."}, {"viet": "Trước hết phải cầm máu lại đã.", "eng": "The priority is always to stop the bleeding."}, {"viet": "Vị giáo sư đó chỉ trích các đề nghị của phe bảo thủ cũng như các giải pháp quá đơn giản của phe tự do.", "eng": "The professor trashes conservative proposals as well as liberal nostrums."}, {"viet": "Những người phản đối là một thiểu số nhỏ bé nhưng to mồm.", "eng": "The protesters are a small but vocal minority."}, {"viet": "Nữ hoàng ăn mặc lộng lẫy lên ngôi.", "eng": "The Queen attired in magnificent robes, ascended the throne."}, {"viet": "Trận mưa làm cho mọi người chạy nhốn nháo tìm nơi trú ẩn.", "eng": "The rain sent everyone scurrying for shelter."}, {"viet": "Sự sắp xếp lại nhân viên, lao động, nhân lực, v. v.", "eng": "The redeployment of staff, labour, manpower, etc."}, {"viet": "Phóng viên đó có một tin sốt dẻo.", "eng": "The reporter had a red-hot story."}, {"viet": "Những người giàu càng giàu thêm và những người nghèo càng nghèo thêm.", "eng": "The rich get richer and the poor get poorer."}, {"viet": "Con đường vồng hẳn lên ở chỗ này.", "eng": "The road is quite cambered at this point."}, {"viet": "Căn phòng được trang trí bằng những cái cần thiết tối thiểu: một cái giường, một cái ghế và một cái bàn.", "eng": "The room was furnished with the bare essentials: a bed, a chair, and a table."}, {"viet": "Sa mạc Sahara là một vật chướng ngại tự nhiên giữa miền Bắc và miền Trung của châu Phi.", "eng": "The Sahara Desert is a natural barrier between North and Central Africa."}, {"viet": "Tôi thấy kế hoạch này có vẻ hơi hão huyền.", "eng": "The scheme seems a bit airy-fairy to me."}, {"viet": "Vụ phóng tên lửa lần thứ hai trong năm nay.", "eng": "The second space shot this year."}, {"viet": "Hình đồng tiền in vào lòng bàn tay anh ta.", "eng": "The shape of the coin was imprinted on the palm of his hand."}, {"viet": "Con tàu đập vào tảng đá vỡ tan thành từng mảnh.", "eng": "The ship was pounded to pieces against the rocks."}, {"viet": "Cảnh tượng đó làm cho tôi muốn rớt nước mắt.", "eng": "The sight made me want to weep."}, {"viet": "Bầu trời sáng rực với hàng triệu vì sao.", "eng": "The sky was alight with millions of stars."}, {"viet": "Người lính đó bị thương nặng ngã gục xuống đất.", "eng": "The soldier sank to the ground badly wounded."}, {"viet": "Cảnh sát Tây Ban Nha đã từ chối dẫn độ một người bị truy nã vì tội cướp ngân hàng ở Pháp.", "eng": "The Spanish police have refused to extradite a man wanted for a bank robbery in France."}, {"viet": "Nhân viên trong cửa hiệu này rất đắc lực.", "eng": "The staff in this shop are very helpful."}, {"viet": "Cửa hàng này thật là một nơi quá ồn ào đông đúc vào thời kỳ trước Giáng sinh.", "eng": "The store is an absolute madhouse during the pre-Christmas period."}, {"viet": "Tại cuộc liên hoan hết học kỳ, sinh viên đã có những trò nhại các giáo viên rất giỏi.", "eng": "The students did some marvellous impressions of the teachers at the end-of-term party."}, {"viet": "Phần phụ lục của quyển từ điển tiếng Anh Oxford.", "eng": "The supplement to Oxford English Dictionary."}, {"viet": "Thầy giáo điểm danh các em, thí dụ để kiểm tra xem tất cả có mặt không.", "eng": "The teacher called out the children's names."}, {"viet": "Kỹ thuật này đang còn ở giai đoạn thực nghiệm, nó chưa được phát triển đầy đủ.", "eng": "The technique is still at the experimental stage, It hasn't been fully developed yet."}, {"viet": "Tên trộm bỏ chạy theo đường cái, cho nên tôi đã ráng sức đuổi theo.", "eng": "The thief ran off down the road, so I chased him for all I was worth."}, {"viet": "Các mô đã bị huỷ hoại và sẹo đã hình thành.", "eng": "The tissues have been destroyed and a scar has formed."}, {"viet": "Xe lửa sắp sửa đi Niu Yooc.", "eng": "The train is about to leave for New York."}, {"viet": "Quân đội nhận được lệnh động viên.", "eng": "The troops received orders to mobilize."}, {"viet": "Hai mảnh gắn với nhau khéo đến mức hầu như không nhìn thấy chỗ nối.", "eng": "The two pieces were stuck together so well that you could hardly see the join."}, {"viet": "Các thủ tục hành chính phiền hà của trường đại học.", "eng": "The university's cumbersome administrative procedures."}, {"viet": "Băng từ vi deo được cài sẵn để thâu lại trận đấu.", "eng": "The video was preset to record the match."}, {"viet": "Sự nồng nhiệt và chân thành trong cách đón tiếp của ông ta.", "eng": "The warmth and sincerity of his welcome."}, {"viet": "Bánh xe ô tô kẹt vào bùn và chúng tôi không thể chuyển bánh.", "eng": "The wheels of the car stuck in the mud and we could not go on."}, {"viet": "Cửa sổ đóng vì trời mưa.", "eng": "The windows was closed because it was raining."}, {"viet": "Công nhân ở nhà máy tham gia đình công.", "eng": "The worker in the factory joined the strike."}, {"viet": "Các thầy giáo trẻ được coi như là những người có thể trêu chọc được.", "eng": "The younger teachers were fair game for playing tricks on."}, {"viet": "Ý tưởng của họ thì tốt nhưng hành động của họ để thực hiện thì thật thảm bại.", "eng": "Their idea was good but their follow through was abysmal."}, {"viet": "Con cái họ là những đứa trẻ có tóc rất vàng.", "eng": "Theirs are the children with very fair hair."}, {"viet": "Có cái chuông trong tầm tay của bệnh nhân.", "eng": "There's a bell within the patients reach."}, {"viet": "Có một sự tiến bộ dễ thấy trong chữ viết của cô ấy.", "eng": "There's been a noticeable improvement in her handwriting."}, {"viet": "Đây là chủ nhà của chúng ta, tốt hơn là anh tự giới thiệu với ông ấy.", "eng": "There's our host, you'd better make yourself known to him."}, {"viet": "Trong chuyện này có rất nhiều khả năng.", "eng": "There are lots of maybes in this matter."}, {"viet": "Có những lý lẽ mạnh mẽ chống lại những biện pháp này.", "eng": "There are strong arguments against these measures."}, {"viet": "Mới đây tại cơ quan tôi có một số người về hưu.", "eng": "There have been several retirements in my office recently."}, {"viet": "Có cả một ngôi làng đằng kia.", "eng": "There is a whole village over there."}, {"viet": "Máy nước nóng bị trục trặc rồi.", "eng": "There is something wrong with the heater."}, {"viet": "Có một hàng người ở bên ngoài nhà hát.", "eng": "There was a long queue outside the theatre."}, {"viet": "Có quá nhiều thủ tục hành chính quan liêu mà ông phải trải qua.", "eng": "There was so much red tape to go through."}, {"viet": "Sẽ có một bữa tiệc chiêu đãi ở khách sạn Thiên Nga Trắng lúc 10 giờ sáng mai.", "eng": "There will be a reception at the White Swan Hotel tomorrow morning at 10 a. m."}, {"viet": "Các minh hoạ về hoa này chứng tỏ sự quan tâm làm ra vẻ thật của hoạ sĩ.", "eng": "These flower illustrations show the artist's concern for verisimilitude."}, {"viet": "Những chiếc áo sơ mi này có đủ màu.", "eng": "These shirts come in a variety of colours."}, {"viet": "Họ đang cố gắng khơi dậy lòng nhiệt tình ủng hộ cho ứng cử viên của họ.", "eng": "They're trying to whip up support for their candidate."}, {"viet": "Họ đang tranh cãi xem ai ngồi ở trước.", "eng": "They are arguing about who should sit in front."}, {"viet": "Họ vật lộn với sóng gió.", "eng": "They battled with the wind and the waves."}, {"viet": "Họ đã đóng góp đáng kể vào thành công của chúng tôi.", "eng": "They contributed substantially to our success."}, {"viet": "Họ chịu đựng nỗi gian truân khủng khiếp trên đường tới Nam Cực.", "eng": "They endured tremendous hardship on their journey to the South Pole."}, {"viet": "Họ mặc quần áo lính thuỷ cho đứa bé.", "eng": "They had rigged the little boy out in a sailor suit."}, {"viet": "Họ nuôi gà trong một cái nhà chái ở cuối vườn.", "eng": "They keep hens in a lean-to at the end of the garden."}, {"viet": "Họ nói đến cậu như là một nguồn thông tin đáng tin cậy.", "eng": "They mentioned you as a good source of information."}, {"viet": "Chúng còn bảo vệ những bộ phận bên trong cơ thể chúng ta nữa.", "eng": "They protect the inner parts of our bodies, too."}, {"viet": "Họ bán chứng khoán với giá thấp.", "eng": "They sell the securities at a low price."}, {"viet": "Họ đi xe lửa ra bờ biển rồi từ đó đi tàu thuỷ sang Mỹ.", "eng": "They travelled by rail to the coast and thence by boat to America."}, {"viet": "Cả hai người cùng sinh ra đúng một ngày đó.", "eng": "They were both born on that selfsame day."}, {"viet": "Họ đã bị kiệt lực vì một chế độ ăn có ít chất đạm.", "eng": "They were weakened by a diet that was low in protein."}, {"viet": "Vùng này sinh lợi được là nhờ công nghiệp mỏ.", "eng": "This area depends on the mining industry."}, {"viet": "Công ty này cần một dòng máu mới.", "eng": "This company needs an infusion of new blood."}, {"viet": "Chất béo này, hay là bơ ca-cao, không bị bỏ đi.", "eng": "This fat, or cocoa butter, it not thrown away."}, {"viet": "Đây là ước tính giá tối đa.", "eng": "This is an outside estimate of the price."}, {"viet": "Đây không phải là câu chuyện duy nhất về trẻ em chết đói, ngày nào cũng có báo cáo về nhiều trường hợp như thế.", "eng": "This isn't the only story of starving children, many such cases are reported every day."}, {"viet": "Chương trình thời sự này chỉ thông tin về các sự kiện nước ngoài.", "eng": "This news programme only covers external events."}, {"viet": "Loài chim hiếm này đã trở thành loài có nguy cơ bị diệt chủng.", "eng": "This race bird has become an endangered species."}, {"viet": "Chủ đề này nằm ngoài phạm vi điều tra của chúng tôi.", "eng": "This subject is outside the scope of our inquiry."}, {"viet": "Năm nay các con số bán ra vượt quá mọi mong đợi của chúng ta.", "eng": "This year's sales figures go beyond all our expectations."}, {"viet": "Đối với những tộc người khác thì tục ăn thịt người là một yếu tố tôn giáo.", "eng": "To others cannibalism was a part of their religion."}, {"viet": "Những biểu tượng có tính truyền thống ngăn người ta tránh những lực lượng độc hại.", "eng": "Traditional symbols to ward off evil eye."}, {"viet": "Các loại hoa hồng có thể lai tạo để làm phong phú màu sắc của chúng.", "eng": "Varieties of roses can be crossed to vary their colour."}, {"viet": "Nước gồm có hyđrô và ôxy.", "eng": "Water is composed of hydrogen and oxygen."}, {"viet": "Chúng tôi sẽ mang bữa điểm tâm đến phòng của ông ngay và giảm 20% cho ông.", "eng": "We'll send it to your room right away and give you 20% discount."}, {"viet": "Chúng tôi không được phép tiếp trẻ em dưới 18 tuổi, đây là quy định của quán rượu.", "eng": "We're not allowed to receive children under eighteen and it's the bar's policy."}, {"viet": "Chúng tôi nhận được điện thoại của nhiều người gọi từ khắp nơi trên thế giới tới.", "eng": "We've got people phoning up from all over the world."}, {"viet": "Tất cả chúng tôi ra sân bay để tiễn cô ta.", "eng": "We all went to the airport to see her off."}, {"viet": "Chúng tôi tích cực ủng hộ đội bóng chày của trường đại học.", "eng": "We are rooting for the college baseball team."}, {"viet": "Chúng ta không thể trách nó: nó đã cố gắng hết sức theo khả năng của nó.", "eng": "We can't blame him: he did his best according to his lights."}, {"viet": "Chúng tôi tiến hành một cuộc trò chuyện ngập ngừng bằng một thứ tiếng Đức không hoàn hảo.", "eng": "We carried on a halting conversation in our imperfect German."}, {"viet": "Chúng tôi lao đi tìm chỗ trú khi cơn bão bắt đầu.", "eng": "We dived for cover when the storm started."}, {"viet": "Chúng tôi tình cờ phát hiện được nhà hàng thật sự ngon.", "eng": "We found a really good restaurant."}, {"viet": "Chúng tôi đã có cảm giác lạ lùng là chúng tôi không được hoan nghênh tại buổi họp.", "eng": "We had the feeling that we were not welcome at the meeting."}, {"viet": "Chúng tôi đã nghe những lời phàn nàn của anh đến phát chán.", "eng": "We have heard your complaints ad nauseam."}, {"viet": "Chúng tôi hy vọng thu được lợi nhuận từ vốn đầu tư.", "eng": "We hope for some gain from our investment."}, {"viet": "Chúng tôi sẽ viết thư thông báo cho ông về điều này.", "eng": "We'll write to advise you of this."}, {"viet": "Chúng tôi dọn đến đây có đến hai mươi ba năm về trước.", "eng": "We must have moved in twenty-three years ago."}, {"viet": "Hiện nay chúng tôi có mối quan hệ không thân thiết như xưa.", "eng": "We now have an arm's length relationship."}, {"viet": "Chúng tôi đã dựng lại con khủng long từ vài chiếc xương của nó.", "eng": "We reconstructed what the dinosaur looked like from a few of its bones."}, {"viet": "Chúng ta không nên coi thường những người cấp dưới có tri thức.", "eng": "We should not despise our intellectual inferiors."}, {"viet": "Chúng tôi dùng nguyên liệu chất lượng cao cho hàng của chúng tôi.", "eng": "We use high-quality raw material for our goods."}, {"viet": "Trong dịp nghỉ, chúng tôi đã bị mất trộm.", "eng": "We were burgled while we were on holiday."}, {"viet": "Chúng tôi cũng sẽ giải quyết vấn đề đó.", "eng": "We will deal with that, too."}, {"viet": "À ông có thể cho tôi biết chuyện xảy ra như thế nào không?", "eng": "Well, could you tell me how it happened?"}, {"viet": "Thật quá quắt, anh ta lại làm cái trò đó nữa!", "eng": "Well, stone the crows, he's done it again!"}, {"viet": "Sao vậy, Mick, tối qua cậu uống quá nhiều rượu à?", "eng": "What's the matter, Mick, you had a touch of the brewer's droop last night?"}, {"viet": "Các môn thể thao chủ yếu ở Bắc Mỹ là những môn nào?", "eng": "What are the major sports in North America?"}, {"viet": "Bạn làm gì vào thời gian rỗi?", "eng": "What do you do in your spare time?"}, {"viet": "Điều tôi nói với anh là hoàn toàn đúng sự thực.", "eng": "What I'm telling you is the gospel truth."}, {"viet": "Khả năng thành công là thế nào?", "eng": "What is the probability of its success?"}, {"viet": "Cái gì làm anh cho rằng tôi chống lại điều đó?", "eng": "What makes you suppose I'm against it?"}, {"viet": "Bạn thường làm gì để giữ an toàn cho bản thân?", "eng": "What things do you do to keep yourself safe?"}, {"viet": "Khi nào thì anh chị thông báo ngày đính hôn?", "eng": "When are you two going to announce your engagement?"}, {"viet": "Khi tôi gọi đến công ty ABC, thì họ nói phần mềm của tôi có gì đó trục trặc.", "eng": "When I called ABC company, they told me that there is something wrong with the software."}, {"viet": "Khi cô ấy còn học ở trường cô ấy đã có cuộc phỏng vấn đầu tiên cho một công việc ở cửa hiệu giày.", "eng": "When she was still at school, she had her first interview for a job in a shoe shop."}, {"viet": "Khi chúng tôi lên được tới đỉnh đồi, chúng tôi nhìn thấy quang cảnh rất đẹp.", "eng": "When we finally topped the hill we had a fine view."}, {"viet": "Bà ấy có thể mướn hộp ký gửi an toàn ở đâu?", "eng": "Where can she rent a safe deposit box?"}, {"viet": "Bạn thích uống thứ nào, trà hay cà phê?", "eng": "Which do you like, tea or coffee?"}, {"viet": "Khi tôi đang dùng bữa ở nhà hàng.", "eng": "While I was dining at a restaurant."}, {"viet": "Ai mà biết được điều nó nói là không thật, Chúng ta không có bằng chứng gì là nó nói dối.", "eng": "Who knows but that what he says is true, We have no proof that he is lying."}, {"viet": "Tại sao anh không đến trượt băng ( cùng với chúng tôi ) tối nay?", "eng": "Why don't you come ice-skating ( with us ) tonight?"}, {"viet": "Anh quên không gọi điện liệu cô ấy có bực mình không?", "eng": "Will she be annoyed that you forgot to phone?"}, {"viet": "Anh sẽ ủng hộ cuộc vận động tranh cử của tôi chứ?", "eng": "Will you support me in my campaign for election?"}, {"viet": "Không có ai để giữ trật tự, tình hình trong lớp học hỗn loạn.", "eng": "With no one to keep order the situation in the classroom was chaotic."}, {"viet": "Những sự kiện đáng lo ngại có lẽ báo trước một thời kỳ suy thoái kinh tế.", "eng": "Worrying events that may prefigure a period of economic recession."}, {"viet": "Bạn có muốn uống một tách trà không?", "eng": "Would you like to have a cup of tea?"}, {"viet": "Xin ông hãy suy nghĩ về những lợi ích mà các ông sẽ có được?", "eng": "Would you please think about benefit you will get?"}, {"viet": "Phải, xét cho cùng, tốc độ của cô ấy hoàn toàn tốt.", "eng": "Yes, her speed was quite good, considering."}, {"viet": "Vâng, bà sẽ phải cởi nó ra, tôi e là vậy.", "eng": "Yes, you'll have to, I'm afraid."}, {"viet": "Phải làm cho lí của anh hoà hợp với hoàn cảnh cuộc sống hiện tại.", "eng": "You'll have to tune your theories to the new conditions of life."}, {"viet": "Anh trình bày cẩu thả quá.", "eng": "You're too slipshod about your presentation."}, {"viet": "Anh vẫn đúng, dù có ý kiến nào đi nữa của những người khác.", "eng": "You are right, whatever opinions may be held by others."}, {"viet": "Anh không thể lúc nào cũng làm việc được-anh phải có chút giải trí.", "eng": "You can't work all the time-you must have some recreation."}, {"viet": "Các bạn có thể xem phần hai của phim vào tuần tới.", "eng": "You can see the second part of the film next week."}, {"viet": "Anh không cần tìm kiếm việc khác-công việc của anh bây giờ cũng khá đấy chứ.", "eng": "You don't need to look for another job-you're well off where you are."}, {"viet": "Anh phải xuống số khi lên đồi dốc.", "eng": "You have to shift down to climb steep hills."}, {"viet": "Bây giờ ông có thể quyết định kỳ hạn.", "eng": "You may now determine the maturity."}, {"viet": "Anh phải đăng ký với cảnh sát, đại sứ quán, v. v.", "eng": "You must register with the police, the embassy, etc."}, {"viet": "Anh đã nói rằng lễ hội powwow này dành cho các bộ lạc khác nhau.", "eng": "You said this powwow was for different tribes."}, {"viet": "Chị nên mặc một chiếc sơ mi bình thường với chiếc váy kẻ ô này.", "eng": "You should wear a plain blouse with this checked skirt."}, {"viet": "Ngài sẽ được thông báo chi tiết vào thời gian thích hợp.", "eng": "You will be informed of the details at the appropriate time."}, {"viet": "Hành vi của cậu sẽ làm nhục cả gia đình.", "eng": "Your behaviour will disparage the whole family."}, {"viet": "Lời đề nghị của anh sẽ được đệ trình lên các giám đốc.", "eng": "Your proposal will be put to the board of directors."}]