[{"viet": "Một vở ba-lê thường kể lại một câu chuyện mà không một lời nói nào.", "eng": "A ballet tells a story without any words to help."}, {"viet": "Một lò sưởi trung tâm, nồi súp de đốt bằng dầu.", "eng": "A central heating, boiler that burns oil."}, {"viet": "Một công ty ở vị trí hàng đầu về công nghệ máy công cụ.", "eng": "A company on the leading edge of machine-tool technology."}, {"viet": "Một đám thiếu niên say mê bóng đá.", "eng": "A crowd of football-mad little boys."}, {"viet": "Một căn bệnh làm hư tổn bộ óc.", "eng": "A disease that attacks the brain."}, {"viet": "Một vài kẻ ngoan cố đang cố gắng ngăn trở các cuộc cải tổ.", "eng": "A few die-hards are trying to stop the reforms."}, {"viet": "Động cơ đốt trong bốn thì.", "eng": "A four-cycle internal-combustion engine."}, {"viet": "Một hộp đồ nghề tốt là vật hữu ích cần có trong nhà.", "eng": "A good tool-box is a handy thing to have in the house."}, {"viet": "Một tình trạng cân đối thanh toán khả quan.", "eng": "A healthy balance of payments position."}, {"viet": "Một cái áo khoác được vá ở ngay khuỷu tay áo.", "eng": "A jacket patched at the elbows."}, {"viet": "Quyền uy cứng rắn của một nhà lãnh đạo bớt khắt khe trong giai đoạn thoải mái về chính trị, kinh tế.", "eng": "A leader's strong authority that was loosed by easy times."}, {"viet": "Nhiều người ở đây như John chẳng hạn thích uống cà phê.", "eng": "A lot of people here for example John prefer coffee."}, {"viet": "Một đám đông cảnh sát có mặt tại cuộc mit-tinh.", "eng": "A massive police presence at the meeting."}, {"viet": "Một đường mòn bùn lầy xuyên qua cánh rừng.", "eng": "A muddy track through the forest."}, {"viet": "Một cuốn tiểu thuyết phản ánh xã hội hiện đại.", "eng": "A novel that mirrors modern society."}, {"viet": "Một giai đoạn huy hoàng trong nghệ thuật.", "eng": "A period of great efflorescence in the arts."}, {"viet": "Một hồ sơ cảnh sát về những người mất tích.", "eng": "A police file on missing persons."}, {"viet": "Một dự án vừa đúng kế hoạch.", "eng": "A project that is on schedule."}, {"viet": "Một bản báo cáo về tình trạng đường sá.", "eng": "A report on the state of the roads."}, {"viet": "Một cơn bão cát thổi dữ dội hơn trong lúc chúng tôi lái xe qua sa mạc.", "eng": "A sandstorm kicked up while we drove through the desert."}, {"viet": "Một chiếc tàu hiện ra ở chân trời.", "eng": "A ship appeared on the horizon."}, {"viet": "Một báo cáo vụn vặt về vụ rắc rối đó.", "eng": "A snippy account of the incident."}, {"viet": "Một bức tượng để tưởng nhớ một vị anh hùng dân tộc.", "eng": "A statue in commemoration of a national hero."}, {"viet": "Một cuộc hành trình trên những đoạn đường ngoằn ngoèo lên lên xuống xuống qua các rặng núi.", "eng": "A switchback journey through the mountains with many ups and downs."}, {"viet": "Một thành phố gợi lại quá khứ.", "eng": "A town redolent of the past."}, {"viet": "Tiếng la ó phản đối thảm thiết nổi lên khi những quy định hạn chế mới về việc đỗ xe được thông báo.", "eng": "A wail of misery went up when new parking restrictions were announced."}, {"viet": "Một bài tập với những chỗ sửa bằng mực đỏ.", "eng": "A written exercise with corrections in red ink."}, {"viet": "Hành động theo nguồn tin báo, cảnh sát đã bắt những tên buôn lậu ma túy.", "eng": "Acting on a tip-off, the police arrested the drug smugglers."}, {"viet": "Sau một tháng, số thực phẩm của họ đã hết sạch.", "eng": "After a month their food supplies gave out."}, {"viet": "Sau nhiều tháng làm việc cật lực, kế hoạch của chúng tôi đã có kết quả.", "eng": "After months of hard work, our plans came to fruition."}, {"viet": "Sau chiến tranh có một sự tăng trưởng đột biến về mức sinh đẻ.", "eng": "After the war there was a bulge in the birth-rate."}, {"viet": "Mọi lời khẩn cầu giúp đỡ của cô ta đều bị bỏ lơ.", "eng": "All her appeals for help fell on deaf ears."}, {"viet": "Tất cả những món nợ được gom lại thành một.", "eng": "All the debts have been consolidated."}, {"viet": "Mặc dầu là người rất sùng đạo, anh ta đôi lúc vẫn cứ bị những mối ngờ vực làm cho hoang mang.", "eng": "Although a very religious man, he is still troubled by occasional doubts."}, {"viet": "Một thành tựu đáng được ca tụng đặc biệt.", "eng": "An achievement worthy of great praise."}, {"viet": "Một sự cố gắng nhớ lại thời quá khứ.", "eng": "An attempt to recapture the past."}, {"viet": "Một bản tường trình của nhân chứng mục kích tội ác.", "eng": "An eyewitness account of a crime."}, {"viet": "Một động cơ cũ vẫn còn rất mạnh.", "eng": "An old engine that still has lots of kick."}, {"viet": "Phân tích một câu thành những thành phần tạo câu.", "eng": "Analyze the sentence into its constituent parts."}, {"viet": "Người ta cũng nói là có 40 triệu người khác đã thử qua.", "eng": "Another 40 million tried it, so they say."}, {"viet": "Gây sức ép thái quá để bắt ai phải đổi ý.", "eng": "Apply undue pressure to make somebody change his mind."}, {"viet": "Anh là người ăn lương ngày hay được trả lương tháng?", "eng": "Are you a wage-earner or salaried?"}, {"viet": "Bố có đau khổ vì tin tức đó không?", "eng": "Are you sorrowful about the news, daddy?"}, {"viet": "Là một họa sĩ chuyên nghiệp, cô ta xem thường những cố gắng của các tay nghiệp dư.", "eng": "As a professional painter, she scorns the efforts of amateurs."}, {"viet": "Vì là người làm ra kế hoạch nên thực sự tôi không thể bình luận nó được.", "eng": "As the author of the scheme I can't really comment."}, {"viet": "Vào lúc hừng đông họ lên bờ.", "eng": "At daybreak they landed."}, {"viet": "Vận động viên của vài nước tẩy chay Thế Vận Hội Olympic.", "eng": "Athletes from several countries boycotted the Olympic Games."}, {"viet": "Barolo là vua rượu vang đỏ Ý.", "eng": "Barolo is the King of Italian red wines."}, {"viet": "Xúc động trước đau khổ của ai.", "eng": "Be moved to pity by somebody's suffering."}, {"viet": "Trước khi mua chiếc xe ôtô đó tôi đã kiểm tra nó nhanh chóng.", "eng": "Before buying the car I gave it the once-over."}, {"viet": "Bill thường xuyên bị các con của anh ta nhại lại.", "eng": "Bill is constantly being sent up by his children."}, {"viet": "Chà, tắm nước nóng một cái cho đã nào!", "eng": "Boy, could I use a hot bath!"}, {"viet": "Gây dựng tiếng tăm cho chính mình.", "eng": "Build up a reputation for oneself."}, {"viet": "Nhưng tớ còn phải làm tất cả công việc này đã.", "eng": "But I've got do all these jobs."}, {"viet": "Nhưng bạn biết đấy, hút thuốc sẽ làm bạn không khỏe.", "eng": "But you know, smoking is going to make you unfit."}, {"viet": "À này, món bắp cải muối kho cá là một trong những món đặc sản của nhà hàng này.", "eng": "By the way, the Fish with Chinese Sauerkraut is one of the specialties of the house."}, {"viet": "Xin mời người xếp hàng kế tiếp?", "eng": "Can I help the next person in line, please?"}, {"viet": "Anh có thể giải thích ý anh muốn nói gì không?", "eng": "Can you demonstrate what you mean by that?"}, {"viet": "Cô có thể giới thiệu một khách sạn tốt ở lân cận được không?", "eng": "Can you recommend a good hotel in the neighborhood?"}, {"viet": "Chụp hình được một nụ cười trẻ thơ.", "eng": "Capture a baby's smile in a photograph."}, {"viet": "Những chuyến bay thuê bao là rẻ nhất so với số tiền của bạn bỏ ra.", "eng": "Charter flights offer the best value for your money."}, {"viet": "Thuốc lá chứa hàm lượng nicotine thấp.", "eng": "Cigarettes with a low nicotine content."}, {"viet": "Tạt ngang qua văn phòng tôi trưa nay nhé.", "eng": "Come across to my office this afternoon."}, {"viet": "Bị kết tội dựa trên bằng chứng nhỏ nhoi nhất.", "eng": "Condemned on the slimmest of evidence."}, {"viet": "San hô dưới nước được hình thành từ các loại pôlip.", "eng": "Coral is formed by certain types of polyp."}, {"viet": "Cô vui lòng chuyển cuộc gọi của tôi đến phòng tài chính nhé?", "eng": "Could you please transfer my call to your finance department?"}, {"viet": "Những đám đông người xem kéo dồn đến trố mắt nhìn đống mảnh vụn của chiếc máy bay bị rơi.", "eng": "Crowds of onlookers coming to gawp at the wreckage of the aircraft."}, {"viet": "Bác sĩ nói cái chết đã xảy ra khoảng nửa đêm.", "eng": "Death occurred about midnight, the doctor says."}, {"viet": "Mặc dù có vẻ lóng ngóng, chắc chắn một ngày nào đó cô bé sẽ trở thành một mỹ nhân.", "eng": "Despite her gawkiness she was clearly going to be a beautiful woman one day."}, {"viet": "Anh có lên đỉnh tháp không?", "eng": "Did you go to the top of the tower?"}, {"viet": "Nỗi thất vọng lộ rõ trên gương mặt của người thua cuộc.", "eng": "Disappointment was writ large on the face of the loser."}, {"viet": "Đừng làm gì xúc phạm đến tính dễ phật ý của cô ta.", "eng": "Do nothing to offend her susceptibilities."}, {"viet": "Bạn có tự nghĩ là bạn có hoài bão không?", "eng": "Do you consider yourself to be ambitious?"}, {"viet": "Cô có thuốc say sóng không?", "eng": "Do you have any motion sickness medicine?"}, {"viet": "Bạn thích côca-côla hay Pepsi?", "eng": "Do you like Coke or Pepsi?"}, {"viet": "Anh có bán bộ nào không?", "eng": "Do you sell any of them?"}, {"viet": "Ông muốn đổi loại tiền mệnh giá lớn hay mệnh giá nhỏ?", "eng": "Do you want large or small bills?"}, {"viet": "Nước bạn có động vật hay bông hoa quốc gia nào không?", "eng": "Does your country have a national animal or flower?"}, {"viet": "Đừng có nhầm nước Áo với nước Úc.", "eng": "Don't confuse Austria with Australia."}, {"viet": "Đừng để phân chó ở đó.", "eng": "Don't leave dog droppings there."}, {"viet": "Đừng để các thùng xăng gần lửa.", "eng": "Don't stand cans of petrol near the fire."}, {"viet": "Bạn không có thú tiêu khiển nào, như sưu tập tem hoặc những thứ như thế sao?", "eng": "Don't you have any hobbies, like stamp collecting or things like that?"}, {"viet": "Củi khô làm ngọn lửa cháy rực.", "eng": "Dry wood makes a good blaze."}, {"viet": "Quan điểm về vật lý của Einstein vẫn đứng vững trong nhiều năm qua.", "eng": "Einstein's ideas on physics have held the field for years."}, {"viet": "Đặc biệt là học thuộc những chữ cái thường thì rất khó.", "eng": "Especially, memorizing small letters was hard."}, {"viet": "Ai cũng giận bạn cả, tôi không thể che chở cho bạn khỏi bị họ giận.", "eng": "Everyone's angry with you, and I can't screen you from their anger."}, {"viet": "Thể hiện khả năng tự chủ cao trong những lúc căng thẳng.", "eng": "Exercise great self-control in moments of stress."}, {"viet": "Các trường đại học danh tiếng như Yale và Harvard.", "eng": "Famous schools like Yale and Harvard."}, {"viet": "Những cánh đồng bị quân xâm lược tàn phá.", "eng": "Fields laid waste by the invading army."}, {"viet": "Món cá được điểm thêm những lát chanh.", "eng": "Fish garnished with slices of lemon."}, {"viet": "Thức ăn đánh cắp từ trong nhà bếp của người chủ cô ấy.", "eng": "Food purloined from her employer's kitchen."}, {"viet": "Các học sinh cũ của trường này hiện nay làm việc ở khắp nơi trên thế giới.", "eng": "Former students of this school are now working in the four corners of the earth."}, {"viet": "Cung cấp trang thiết bị cho một cuộc thám hiểm quan trọng.", "eng": "Furnish all the equipment for a major expedition."}, {"viet": "Này ông bạn chậm chạp, phải nhanh lên chứ!", "eng": "Get on with it, you old slowcoach!"}, {"viet": "Cho ai điểm thấp về cái gì.", "eng": "Give somebody low marks for something."}, {"viet": "Thế nào bạn cũng gặp rắc rối nếu mà thầy giáo phát hiện được!", "eng": "God help you if the teacher finds out!"}, {"viet": "Tội lỗi cắn rứt lương tâm mình.", "eng": "Guilt gnawing away at one's conscience."}, {"viet": "Chiếc máy cắt cỏ này có được sửa chữa và bảo trì thường xuyên không?", "eng": "Has this mower been regularly serviced?"}, {"viet": "Bạn có bao giờ đến Đại Thung Lũng chưa?", "eng": "Have you ever been to the Grand Canyon?"}, {"viet": "Bạn có nhận thấy anh ấy gắng giữ vẻ thân thiện với sếp không?", "eng": "Have you noticed how he tries to keeps in with the boss?"}, {"viet": "Anh ta sẽ làm bất cứ cái gì đã lấy lại đứa con từ người vợ trước.", "eng": "He'll go to any lengths to get his child back from his ex-wife."}, {"viet": "Cứ xét tất cả những gì anh ta đã phải chịu đựng thì anh ta vui vẻ một cách thật đáng kinh ngạc.", "eng": "He's amazingly cheerful considering all that he's been through."}, {"viet": "Anh ta đã đi cùng với vợ của sếp để thoả mãn tình dục ở Brighton.", "eng": "He's gone off with the boss's wife for a dirty weekend in Brighton."}, {"viet": "Bây giờ anh ấy đã bình phục hẳn sau cơn đột quỵ.", "eng": "He's now fully recovered from his stroke."}, {"viet": "Anh ấy hết sức thất vọng với chính phủ hiện tại.", "eng": "He's very disillusioned with the present government."}, {"viet": "Anh ta đã trả lời những câu hỏi một cách tự tin.", "eng": "He answered the questions with confidence."}, {"viet": "Hắn khoe khoang rằng hắn là cầu thủ giỏi nhất đội.", "eng": "He boasted that he was the best player in the team."}, {"viet": "Ông ta không thể xoay sở được nếu không có một người thư ký.", "eng": "He can't do without the services of a secretary."}, {"viet": "Nó có thể làm việc xuất sắc nhưng thường nó ngại làm.", "eng": "He could produce excellent work but usually he can't be bothered."}, {"viet": "Anh ta chẳng hài lòng khi bị gọi là người nghèo.", "eng": "He did not take kindly to the tag of pauper."}, {"viet": "Anh ấy phác thảo bản đồ nước Ý.", "eng": "He drew an outline map of Italy."}, {"viet": "Anh ấy ngã xuống cầu thang và nằm một đống dưới chân cầu thang.", "eng": "He fell down the stairs, landing in a heap at the bottom."}, {"viet": "Anh ta đánh cá tất cả số tiền thắng cuộc của mình vào đợt đua chót.", "eng": "He gambled all his winnings on the last race."}, {"viet": "Hắn đã chịu hậu quả nặng nề do học đòi tham gia vào thị trường chứng khoán.", "eng": "He got his fingers badly burnt dabbling in the stock-market."}, {"viet": "Nó không đóng vai trò nào trong quyết định đó cả.", "eng": "He had no part in the decision."}, {"viet": "Anh ấy xuất thân từ giới lao động.", "eng": "He has a working-class background."}, {"viet": "Ông ấy đã hứa là sẽ điều tra cẩn thận vụ việc đó.", "eng": "He has promised a thorough investigation into the affair."}, {"viet": "Anh ta lao vào công việc của mình.", "eng": "He hurled himself into his work."}, {"viet": "Ông ta đang điều khiển và quản lý những công việc chuẩn bị cho cuộc hội nghị thượng đỉnh sắp tới về kinh tế.", "eng": "He is honchoing preparations for the forthcoming economic summit."}, {"viet": "Anh ta rất nhạy bén về mặt này.", "eng": "He is very sensitive in this regard."}, {"viet": "Ông ta để cho nhân viên của mình tự giải quyết-miễn sao công việc chạy là ông ta vui rồi!", "eng": "He leaves his staff to their own devices-as long as the work gets done he's happy!"}, {"viet": "Trông nó như là hiện thân của sự nghèo khổ.", "eng": "He looked the personification of misery."}, {"viet": "Anh ta lấy bà vợ góa của anh mình.", "eng": "He married his brother's widow."}, {"viet": "Anh ta nhận xét tinh tường nhưng nói ít.", "eng": "He observes keenly, but says little."}, {"viet": "Ông ta viện cớ nghèo khổ để giảm nhẹ tội cho tên kẻ cắp.", "eng": "He pleaded poverty in extenuation of the thief."}, {"viet": "Nó đấm vỡ tấm kính cửa ra vào.", "eng": "He put his fist through a plate-glass door."}, {"viet": "Anh ta đã nhìn nhận là mình không có đủ khả năng cho công việc đó.", "eng": "He recognized that he was not qualified for the post."}, {"viet": "Anh ta chèo đua ở vị trí số 5 cho đội Oxford.", "eng": "He rows at No. 5 for Oxford."}, {"viet": "Hắn là một người làm cho gia đình xấu hổ.", "eng": "He's an embarrassment to his family."}, {"viet": "Hắn ta không thích kể chuyện đùa.", "eng": "He's in mood to tell jokes."}, {"viet": "Anh ta vẫn còn bần thần vì thuốc mê.", "eng": "He's still groggy from the anesthetic."}, {"viet": "Ông ta ngồi đó diễn thuyết về hệ thống pháp lí mặc dù rõ rằng là ông ta chẳng biết gì về điều đó.", "eng": "He sat there pontificating about the legal system although it was clear that he knew very little about it."}, {"viet": "Ông ta bán hàng trong một hiệu giày.", "eng": "He serves in a shoe shop."}, {"viet": "Anh ấy trượt băng và bị gãy xương chân.", "eng": "He slipped on the ice and broke the bone in his leg."}, {"viet": "Anh ta nhuộm khúc gỗ màu nâu sẫm.", "eng": "He stained the wood dark brown."}, {"viet": "Nó nhét cái súng cao su vào túi.", "eng": "He stuffed the catapult into his pocket."}, {"viet": "Nó nghĩ rằng uống nhiều rượu và lao vào đánh nhau mới là đàn ông.", "eng": "He thinks it's macho to drink a lot and get into fights."}, {"viet": "Anh ấy dẫn đầu và duy trì cho đến cuối cuộc đua.", "eng": "He took the lead, and maintained it until the end of the race."}, {"viet": "Anh ta quay lại để chia tay, và lúc đó nàng oà lên khóc.", "eng": "He turned to leave, whereat she began to weep."}, {"viet": "Anh ta muốn biết ai sẽ có thể giúp anh ta.", "eng": "He wanted to know who'd be able to help him."}, {"viet": "Hắn quay quắt như con lươn.", "eng": "He was as slippery as an eel."}, {"viet": "Anh ta tin chắc là toàn bộ vấn đề đó do tôi gây ra.", "eng": "He was convinced that the whole problem was my doing."}, {"viet": "Anh ta được truyền máu vì anh ta mất máu nhiều.", "eng": "He was given a blood transfusion as he was bleeding excessively."}, {"viet": "Ông ta bị người La Mã hành hạ.", "eng": "He was martyred by the Romans."}, {"viet": "Ông ta được đón với nghi lễ quan trọng.", "eng": "He was received with great circumstance."}, {"viet": "Anh ta đang nói chuyện với một người bạn.", "eng": "He was talking with a friend."}, {"viet": "Nó không còn như nó thường ngày nữa.", "eng": "He wasn't his usual self."}, {"viet": "Ông ta viết di chúc để lại phần lớn tiền bạc của mình cho các cơ quan từ thiện.", "eng": "He willed most of his money to charities."}, {"viet": "Chàng đã viết một bài thơ cho người yêu.", "eng": "He wrote a sonnet to his beloved."}, {"viet": "Báo cáo của bà ta là một sự bóp méo sự thật.", "eng": "Her account was a perversion of the truth."}, {"viet": "Sự mô tả tỷ mỉ của bà ta khiến chúng tôi mường tượng được một hình ảnh chính xác về những gì đã xảy ra.", "eng": "Her careful description enabled us to form an accurate picture of what had happened."}, {"viet": "Cái áo dài của cô ta cao trên đầu gối đúng ba insơ.", "eng": "Her dress was a full three inches above the knee."}, {"viet": "Trang phục kỳ lạ của bà ta đã gây nhiều tiếng cười trong đám khách mời.", "eng": "Her funny costume caused much mirth among the guests."}, {"viet": "Sự xấc xược của cô ta làm vị thẩm phán rất tức giận.", "eng": "Her insolence greatly displeased the judge."}, {"viet": "Mẹ cô ấy chết vì một căn bệnh nghiêm trọng.", "eng": "Her mother died from a very bad disease."}, {"viet": "Bà ta có vị trí vững chắc trong các sách về lịch sử.", "eng": "Her place in the history books is secure."}, {"viet": "Viên đạn của cô ta trượt xa mục tiêu.", "eng": "Her shot was wide of the target."}, {"viet": "Ứng xử, hạnh kiểm, v. v. của cô ta không chê vào đâu được.", "eng": "Her unexceptionable behaviour, conduct, etc."}, {"viet": "Thi hài của George Chapman được yên nghỉ nơi đây.", "eng": "Here lie the mortal remains of George Chapman."}, {"viet": "Những câu trả lời của anh ta về các câu hỏi của tôi chẳng qua chỉ là những lời thoái thác khôn khéo.", "eng": "His answers to my questions were nothing but clever evasions."}, {"viet": "Cái chân gãy bắt anh ta phải ngồi trên chiếc ghế có bánh xe.", "eng": "His broken leg condemns him to a wheel chair."}, {"viet": "Tội ác của anh ta không đem lại cho anh ta được gì.", "eng": "His crime has gained him naught."}, {"viet": "Mặt anh ta đã bị một lưỡi dao cạo rạch.", "eng": "His face has been slashed with a razor blade."}, {"viet": "Những sự tiên đoán buồn thảm của hắn hoá ra là sai hết.", "eng": "His gloomy prognostication proved to be false."}, {"viet": "Việc anh ta dính líu vào vụ bê bối là một vết nhơ đối với thanh danh của anh ta.", "eng": "His involvement in the scandal was a blot on his reputation."}, {"viet": "Đầu óc của anh ta chập chờn ý tưởng đi nghỉ mát ở xa.", "eng": "His mind played on the idea of going away for holiday."}, {"viet": "Sự không ưa thích rành rành của hắn đối với kế hoạch đó.", "eng": "His patent dislike of the plan."}, {"viet": "Lời nhận xét của hắn là định nhắm vào tôi.", "eng": "His remark was meant as a shot at me."}, {"viet": "Lời tuyên bố của ông gây nên một cuộc cãi lộn giữa họ.", "eng": "His statement sparks a quarrel between them."}, {"viet": "Cách sử dụng ngôn ngữ đã làm cho ông ta nổi bật lên trên phần đông các nhà văn hiện đại khác.", "eng": "His use of language sets him apart from most other modern writers."}, {"viet": "Tổ chức một cuộc trưng cầu ý dân về việc chấm dứt cưỡng bách nhập ngũ.", "eng": "Hold a referendum on ending conscription."}, {"viet": "Nóng và lạnh là hai từ trái nghĩa nhau.", "eng": "Hot and cold are contrary terms."}, {"viet": "Làm thế nào để bữa tiệc vui nhộn lên đây?", "eng": "How can we enliven this party?"}, {"viet": "Tôi thu xếp một cuộc gọi đánh thức như thế nào?", "eng": "How do I arrange for a wake-up call?"}, {"viet": "Thằng em vô tích sự của cậu thế nào rồi?", "eng": "How is that ne'er-do-well brother of yours?"}, {"viet": "Ông có bao nhiêu người con, ông Bishop?", "eng": "How many children do you have, Mr. Bishop?"}, {"viet": "Ở Canada, giáo dục bắt buộc là bao nhiêu năm?", "eng": "How many years of school are compulsory in Canada?"}, {"viet": "Cách bao lâu bạn nhận được tin tức của gia đình bạn?", "eng": "How often do you hear from your family?"}, {"viet": "Hàng trăm con chim đột nhiên bay lên không trung.", "eng": "Hundreds of birds suddenly rose in to the air."}, {"viet": "Tôi muốn làm việc đó nhưng tôi không biết cách làm ra sao.", "eng": "I'd like to do it but I don't know how to."}, {"viet": "Chỉ trong chốc lát thôi tôi sẽ đến với anh.", "eng": "I'll be with you in a couple of jiffies."}, {"viet": "Tôi sẽ ghi nhanh số điện thoại của họ trước khi tôi quên nó.", "eng": "I'll just jot down their phone number before I forget it."}, {"viet": "Tôi sẽ cố tìm hiểu thông tin đó ngay.", "eng": "I'll try to get the information immediately."}, {"viet": "Tôi bận, anh để ý cho tôi việc đó được không?", "eng": "I'm busy, would you attend to that matter for me?"}, {"viet": "Cháu sẽ đến ở với một gia đình người Mỹ tại Oakland.", "eng": "I'm going to stay with an American family in Oakland."}, {"viet": "Tôi không biết chắc ai cùng kiểu người với tôi cả.", "eng": "I'm not exactly sure who is my type of person."}, {"viet": "Tôi dần dần hồi phục được sức khỏe của mình sau một trận cúm.", "eng": "I'm slowly recovering my strength after a bout of flu."}, {"viet": "Tôi bảo đảm chúng ta có thể giải quyết vấn đề này nếu tất cả chúng ta trao đổi ý kiến với nhau.", "eng": "I'm sure we can solve the problem if we all put our heads together."}, {"viet": "Tôi đã xem phim này rồi nên tôi thích xem phim khác hơn.", "eng": "I've already seen that film, so I'd rather see another one."}, {"viet": "Tôi đã mang những cuốn sách này khắp trường.", "eng": "I've carted these books all round the school."}, {"viet": "Mình có nghe tin đồn là công ty có thể bị vỡ nợ.", "eng": "I've heard whispers that the firm is likely to go bankrupt."}, {"viet": "Tôi đã quyết tâm hoàn thành công việc vào cuối tháng.", "eng": "I've set myself to finish the job by the end of the month."}, {"viet": "Tôi luôn cảm thấy thích thú được ở nhà vào những buổi tối mùa đông.", "eng": "I always enjoy winter evenings spent en famille."}, {"viet": "Tôi chưa sẵn sàng cung cấp những hàng hoá mà anh yêu cầu.", "eng": "I am not prepared to supply the goods you asked for."}, {"viet": "Tôi hỏi anh ấy có phải anh ấy đã tự làm lấy tất cả mọi việc hay anh ấy có sự giúp đỡ nào chăng.", "eng": "I asked him whether he had done all the work himself or whether he had had any assistance."}, {"viet": "Tôi mua cái đồng hồ này ( của một người bạn ) 10 pao.", "eng": "I bought this watch ( from a friend ) for 10 pounds."}, {"viet": "Tôi không thể nào rút chiếc đinh vít này ra khỏi tường.", "eng": "I can't get this crew to come out of the wall."}, {"viet": "Tôi không hiểu sao đồng yên cứ lên giá mãi.", "eng": "I can't understand why the yen keeps getting stronger."}, {"viet": "Tôi có thể viết bài báo cho báo địa phương trong nửa tiếng đồng hồ.", "eng": "I can toss off my article for the local newspaper in half an hour."}, {"viet": "Tôi đã cẩn thận đặt cái bánh ngọt lên bàn.", "eng": "I carefully placed the cake on the table."}, {"viet": "Tôi đã không tập trung được nhiều nhiệt tình cho việc đó.", "eng": "I couldn't muster up much enthusiasm for it."}, {"viet": "Tôi thích diễn xuất hơn là làm đạo diễn.", "eng": "I'd rather act than direct."}, {"viet": "Tôi chả làm gì cả, Kei à.", "eng": "I didn't do anything, Kei."}, {"viet": "Tôi không biết tôi có thể tin anh ta đến đâu?", "eng": "I don't know how far I should believe him?"}, {"viet": "Tôi không đọc tiểu thuyết nên không thích ai cả.", "eng": "I don't read novels, so I don't have any favorites."}, {"viet": "Tôi không muốn đi sâu vào những chi tiết nhỏ nhặt lúc này.", "eng": "I don't want to go into the minor details now."}, {"viet": "Tôi không đánh giá vở kịch này đâu.", "eng": "I don't rate this play at all."}, {"viet": "Tôi sợ rằng sự ngừng bắn này có thể lại chỉ là điều mong mỏi.", "eng": "I fear that this ceasefire may be yet another false dawn."}, {"viet": "Tôi cảm thấy ngột ngạt khủng khiếp trong văn phòng đó.", "eng": "I felt terribly caged in that office."}, {"viet": "Tôi suy ra từ cách cô ta trả lời là cô ta không nhiệt tình lắm.", "eng": "I gathered from the way she replied that she wasn't very enthusiastic."}, {"viet": "Tôi thừa nhận là hắn bị ốm, nhưng điều đó không bào chữa cho hắn được.", "eng": "I grant he's been ill, but that doesn't excuse him."}, {"viet": "Tôi đã nhìn thấy trong giấc mơ ngày tận thế.", "eng": "I had saw a vision of the end of the world."}, {"viet": "Tôi bị nhức đầu và đau họng.", "eng": "I have a headache and a sore throat."}, {"viet": "Tôi không bao giờ tham dự vào chủ nghĩa cực đoan chính trị cả.", "eng": "I have never associated myself with political extremism."}, {"viet": "Tôi phải về nhà để lo bữa ăn tối cho bọn trẻ con.", "eng": "I have to go home and get the children their supper."}, {"viet": "Tôi đã không nghe tin của bạn lâu lắm rồi.", "eng": "I haven't heard from you in ages."}, {"viet": "Tôi hy vọng anh ta không chơi bời với những kẻ nghiện ngập.", "eng": "I hope he's not associating with drug addicts."}, {"viet": "Tôi cho rằng chúng tôi giống nhau, nhưng tôi đã già khi Troy ra đời.", "eng": "I imagine we looked alike, but I was old when Troy was born."}, {"viet": "Tôi quen biết ông ta qua công việc làm ăn, chứ không qua giao thiệp.", "eng": "I know him through work, but not socially."}, {"viet": "Tôi thích anh ta dù cho anh ta có những khuyết điểm.", "eng": "I like him despite his faults."}, {"viet": "Tôi sẽ tới đỉnh đồi trước bạn.", "eng": "I'll beat you to the top of the hill."}, {"viet": "Tôi sẽ gọi một vại bia tươi.", "eng": "I'll order a pitcher of draft beer."}, {"viet": "Lúc này, tôi e rằng ông ấy đi vắng rồi.", "eng": "I'm afraid he's out, at the moment."}, {"viet": "Tôi sẽ đánh bóng xe hơi của tôi.", "eng": "I'm going to wax my car."}, {"viet": "Tôi đã ly thân với vợ tôi.", "eng": "I'm separated from my wife."}, {"viet": "Tôi đã nói cho nó hiểu rõ là tôi bác bỏ đề nghị của nó.", "eng": "I make it clear to him that I rejected his proposal."}, {"viet": "Bây giờ tôi phải đi, tôi không thể đợi lâu hơn nữa.", "eng": "I must go now, I can't wait any longer."}, {"viet": "Tôi cần ngồi xuống cho dãn tay chân đã rã rời.", "eng": "I need to sit down and rest my weary limbs."}, {"viet": "Gần đây tôi mới tham gia công ty cho nên tôi hãy còn phải làm quen với mọi thứ.", "eng": "I only recently joined the firm so I'm still finding my feet."}, {"viet": "Tôi coi như tất cả là do việc làm cần mẫn và sáng kiến của cô ta.", "eng": "I put it all down to her hard work and initiative."}, {"viet": "Tôi nhận ra cô ấy nhờ chiếc mũ đỏ của cô ấy.", "eng": "I recognized her by her red hat."}, {"viet": "Tôi ngồi thụp xuống chiếc ghế bành.", "eng": "I sank down into an armchair."}, {"viet": "Đêm nay tôi sẽ về nhà muộn, vậy đừng có thức chờ ( tôi ).", "eng": "I shall be home very late tonight, so don't wait up ( for me )."}, {"viet": "Tôi đã sơ suất về ngày tháng.", "eng": "I slipped up on the date."}, {"viet": "Tôi cho là vậy, nhưng khi anh giải quyết những vấn đề đó, anh sẽ tạo thêm tiến bộ.", "eng": "I suppose so, but when you solve those problems you bring about more progress."}, {"viet": "Tôi nghĩ tôi sẽ không tham gia vào môn chơi này.", "eng": "I think I'll opt out of this game."}, {"viet": "Tôi nghĩ họ đang dỡ thép xuống.", "eng": "I think they're unloading steel."}, {"viet": "Tôi nói thẳng với ông ta những điều tôi suy nghĩ về thái độ của ông.", "eng": "I told him outright what I thought of his behaviour."}, {"viet": "Tôi quấn băng quanh đầu gối cô ấy.", "eng": "I twisted the bandage round her knee."}, {"viet": "Tôi đã đi dọc sông Senie và ngắm cảnh hai bên bờ.", "eng": "I walked along the Seine River and enjoyed the views on both banks."}, {"viet": "Tôi muốn gửi tiền bằng thư chuyển tiền.", "eng": "I want to send the money by mail transfer."}, {"viet": "Tôi bị chiếc xe ô tô chạy ngang qua làm bắn bùn lên đầy người.", "eng": "I was covered in mud by a passing car."}, {"viet": "Tôi đã định là phải làm việc ngày Chủ Nhật, nhưng rồi tôi lại nhởn nhơ cả ngày.", "eng": "I was meant to be working on Sunday, but I just fooled around all day."}, {"viet": "Tôi ngạc nhiên thấy ông ta có mặt ở câu lạc bộ nhạc jazz, tôi vẫn cứ tưởng ông ta là một ông già khá ù lì.", "eng": "I was surprised to see him at the jazz club, I always thought of him as a rather staid old gentleman."}, {"viet": "Tôi sẽ cẩn thận khi hút thuốc.", "eng": "I will be careful when I smoke."}, {"viet": "Tôi mong anh phát đạt hơn trong tương lai.", "eng": "I wish you further prosperity in the future."}, {"viet": "Tôi sẽ không dám quấy rầy anh.", "eng": "I won't presume to disturb you."}, {"viet": "Tôi muốn bày tỏ quan điểm của mình.", "eng": "I would like to make a point."}, {"viet": "Chắc tôi chẳng bao giờ từ chối món pizza Ý cả.", "eng": "I wouldn't say no to a pizza."}, {"viet": "Nếu cậu ấy cứ mong đi nhờ xe về nhà, tôi e rằng cậu ấy sẽ không đạt được.", "eng": "If he was hoping for a lift home I'm afraid he's had it."}, {"viet": "Nếu kinh nghiệm cũ là có thể dựa vào được để xét, thì máy bay sẽ đến chậm.", "eng": "If past experience is anything to go by, the plane will be late."}, {"viet": "Nếu hôm nay là thứ Tư thì ngày hôm kia là ngày thứ Hai.", "eng": "If today is Wednesday, the day before yesterday was Monday."}, {"viet": "Nếu mày thổi quả bóng ấy nữa nó sẽ nổ tung đấy.", "eng": "If you blow that balloon up any more it will burst."}, {"viet": "Nếu anh làm mất thiện cảm của ông chủ, anh sẽ gặp rắc rối đấy.", "eng": "If you get in bad with the boss, you'll have problems."}, {"viet": "Nếu anh lấy mười trừ đi bốn thì còn lại sáu.", "eng": "If you take four away from ten, that leaves six."}, {"viet": "Ngâm cây ( vào nước ) trong vài phút.", "eng": "Immerse the plant ( in water ) for a few minutes."}, {"viet": "Phù hợp với yêu cầu, chỉ thị, nguyện vọng, v. v. của anh.", "eng": "In conformity with your request, instructions, wishes, etc."}, {"viet": "Trong việc xét xử, ông nên chiếu cố đến tuổi trẻ của nó.", "eng": "In judging him you should consider his youth."}, {"viet": "Vào mùa hè, tôi thích bơi lội nhất.", "eng": "In summer, I like swimming best."}, {"viet": "In the red house, red là thuộc từ của house.", "eng": "In the red house, red is attribute of house."}, {"viet": "Thuế thu nhập thường được khấu trừ trong tiền lương của một người.", "eng": "Income tax is normally deducted from a person's wages."}, {"viet": "Tiếng Đức có trong chương trình giảng dạy của trường anh không?", "eng": "Is German on your school's curriculum?"}, {"viet": "Liệu dòng sông đó có đủ độ sâu để bơi lội không?", "eng": "Is the river deep enough for swimming in?"}, {"viet": "Đây có phải là hướng đi đúng cho chuyến bay chuyển tiếp của tôi đến Chicago không?", "eng": "Is this the right direction for my connection to Chicago?"}, {"viet": "Thật đáng tiếc là hai buổi hoà nhạc diễn cùng một lúc, tôi muốn đi dự cả hai.", "eng": "It's a pity the two concerts clash, I wanted to go to both of them."}, {"viet": "Chủ yếu các bậc cha mẹ khó đồng hoá.", "eng": "It's chiefly the parents that have difficulty assimilating."}, {"viet": "Người ta hi vọng rằng sự cắt giảm thuế sẽ như một tác nhân thúc đẩy sự phát triển nền kinh tế hơn nữa.", "eng": "It's hoped that the tax cuts will act as a stimulant to further economic growth."}, {"viet": "Cái ấy không rẻ, tuy thế tôi nghĩ rằng chúng ta nên mua.", "eng": "It's not cheap but I think we should buy it none the less."}, {"viet": "Nếu không phải đi mà lại đi ra ngoài vào lúc mưa thì thật là ngu ngốc.", "eng": "It's silly to go out in the rain if you don't have to."}, {"viet": "Đối với chúng tôi lúc này là lúc rất bận rộn.", "eng": "It's very busy time with us at the moment."}, {"viet": "Điều đó không nêu lên một tôn giáo đặc biệt nào cả mà chỉ nói đến Thượng Đế mà thôi.", "eng": "It doesn't mention any particular religion, only God."}, {"viet": "Thật khó mà giữ được vẻ tự nhiên khi người ta bị căng thẳng.", "eng": "It is difficult to be natural when one is tense."}, {"viet": "Quan điểm của họ về những vấn đề chính trị hoàn toàn khác nhau.", "eng": "It is on political questions that their views part company."}, {"viet": "Anh ta thấy hổ thẹn khi nghĩ đến việc đã làm hỏng cuộc phỏng vấn như thế nào.", "eng": "It made him squirm to think how he'd messed up the interview."}, {"viet": "Nó bị cong như một cái cung vậy.", "eng": "It's bent like a bow."}, {"viet": "Trên chai có ghi sản phẩm của Pháp.", "eng": "It says on the bottle produce of France."}, {"viet": "Sau khi thợ làm xong, tôi phải mất không biết bao nhiêu thì giờ để sắp đặt lại mọi thứ cho có trật tự.", "eng": "It took me ages to put things to rights after the workmen had finished."}, {"viet": "Chúng tôi gặp nhau ở Paris là hoàn toàn ngẫu nhiên.", "eng": "It was chance our meeting in Paris."}, {"viet": "Trời mưa nhưng mà bất chấp họ vẫn chơi.", "eng": "It was raining but they played the game anyway."}, {"viet": "Khoảng cuối tháng nó sẽ trống.", "eng": "It will be vacant by the end of the month."}, {"viet": "Sáng nay Jane bẳn tính lắm, hãy cẩn thận khi nói với cô ấy.", "eng": "Jane's a bit tetchy this morning, watch what you say to her."}, {"viet": "Jôn đã đánh Bob để trả thù.", "eng": "John settled an old score with Bob by beating him."}, {"viet": "Tôi để một cuốn từ điển bên cạnh khi chơi ô chữ.", "eng": "Keep a dictionary by me when I'm doing crosswords."}, {"viet": "Chúng ta phải cấp tốc rời khỏi chỗ này trước buổi trưa.", "eng": "Let's blow this city no later than noon."}, {"viet": "Fred, ta hiểu câu chuyện như thế này nhé.", "eng": "Let's put it this way, Fred."}, {"viet": "Nhiều thành ngữ lỗi thời đã bị loại ra ngoài cuốn từ điển mới.", "eng": "Many dated expressions are being dropped from the new dictionary."}, {"viet": "Nhiều thành phố đã bị những cuộc oanh tạc chớp nhoáng tàn phá trong chiến tranh.", "eng": "Many towns were badly blitzed during the war."}, {"viet": "Tôi có thể trải giường cho ông được không?", "eng": "May I do the turn down service for you?"}, {"viet": "Có lẽ có chương trình hay nào đó đang phát.", "eng": "Maybe there is something good showing."}, {"viet": "Hầu hết nhân viên đều rất trẻ.", "eng": "Most of the men are very young."}, {"viet": "Dù cô ấy cần công việc đến thế nào, cô ấy đã phải từ chối nó.", "eng": "Much as she needed the job, she had to refuse."}, {"viet": "Tôi bị giới nghiêm từ 10 giờ.", "eng": "My curfew is 10 o'clock."}, {"viet": "Ngựa của tôi về áp chót trong cuộc đua.", "eng": "My horse came next to last in the race."}, {"viet": "Nhận thức của tôi về vấn đề này là.", "eng": "My perception of the matter is that..."}, {"viet": "Nao có giọng nói rất dễ thương.", "eng": "Nao has a really pretty voice."}, {"viet": "Lần tới ông đi, ông phải đến thăm tôi đấy.", "eng": "Next time you go, you mustn't fail to look me up."}, {"viet": "Không còn chỗ để thở trên máy bay chật ních người.", "eng": "No breathing room on the crowded airplane."}, {"viet": "Chẳng có vấn đề gì với cô ấy đâu.", "eng": "Nothing's ever the matter with her."}, {"viet": "Sồi là một loại gỗ tốt dễ đóng đồ đạc.", "eng": "Oak is a good type of wood for making furniture."}, {"viet": "Ồ, chúng tôi thành thật xin lỗi ông.", "eng": "Oh, we are very sorry, sir."}, {"viet": "Về các vấn đề kỹ thuật, tôi phục tùng các chuyên gia.", "eng": "On technical matters, I defer to the experts."}, {"viet": "Người ta phải than phiền về hành vi bạo lực của họ.", "eng": "One must deplore their violent behaviour."}, {"viet": "Những ngân hàng bán công khác xuất hiện trong 100 năm sau.", "eng": "Other semi-public banks appeared during the next 100 years."}, {"viet": "Năm nay, chúng tôi không đủ tiền để đi nghỉ ở nước ngoài.", "eng": "Our funds won't run to a holiday abroad this year."}, {"viet": "Kế hoạch của chúng ta dường như trôi nổi đi đâu ấy.", "eng": "Our plans seem to have gone adrift somewhere."}, {"viet": "Chương trình phát thanh thế giới của đài BBC có giúp mang lại quan niệm thuận lợi cho liên hiệp Anh không?", "eng": "Over the BBC world service project a favourable view of Great Britain?"}, {"viet": "Chi tiền mua tấm thảm mới đó đã lẹm vào khoản tiết kiệm của tôi.", "eng": "Paying for that new carpet has eaten into my savings."}, {"viet": "Có lẽ tôi thích xem biểu diễn nhào lộn của Trung Quốc hơn.", "eng": "Perhaps I like the Chinese acrobatic show better."}, {"viet": "Cảnh sát đã vây chặn không cho vào các khu vực bị nhiễm độc của vùng.", "eng": "Police have sealed off infected areas of the country."}, {"viet": "Request là một cách nói trang trọng hơn của ask for.", "eng": "Request is a more formal way of saying ask for."}, {"viet": "Việc xa cách bạn bè khiến anh ấy buồn thiu.", "eng": "Separation from his friends made him sad."}, {"viet": "Cầu trời, một ngày nào đó cô ta sẽ đỡ!", "eng": "She'll get better one day, please god!"}, {"viet": "Cô ấy đâm ra chán nản từ khi cắt đứt với người yêu.", "eng": "She's been depressed since the break with her boy-friend."}, {"viet": "Cô ta đi làm tóc để dự tiệc tối nay.", "eng": "She's having her hair set for the party this evening."}, {"viet": "Cô ta đùa giỡn với cái ý nghĩ mình ra làm ăn riêng.", "eng": "She's playing with the idea of starting her own business."}, {"viet": "Cô ấy rất cầu kỳ về những thứ cô ấy mặc.", "eng": "She's very particular about what she wears."}, {"viet": "Cô ấy giả vờ ốm để nghỉ phép ba ngày.", "eng": "She assumed to be sick to have a leave of three days."}, {"viet": "Cô ta đưa mắt nhìn thèm muốn chiếc áo dài của chị cô.", "eng": "She cast envious glances at her sister's dress."}, {"viet": "Cô ta toạc đầu gối rất đau, vậy mà vẫn không khóc.", "eng": "She cut her knee badly, but didn't cry."}, {"viet": "Cô ấy chẳng đếm xỉa đến bất cứ ai khác.", "eng": "She doesn't give a shit about anybody else."}, {"viet": "Cô ta hoàn toàn tin chắc rằng mình sẽ thành công.", "eng": "She felt in her bones that she would succeed."}, {"viet": "Trong công việc mới, cô ta được nghỉ thứ bảy, trái với công việc trước của cô ta cứ nghỉ một thứ bảy phải đi làm thứ bảy hôm sau.", "eng": "She gets Saturdays off in her new job as against working alternate weekends in her last one."}, {"viet": "Cô ta gặp khó khăn trong việc học cách phát âm tiếng Anh.", "eng": "She had difficulty learning English pronunciation."}, {"viet": "Cô ta trở nên rất sành ăn từ ngày cô đi nghỉ ở Pháp về.", "eng": "She has become very food-minded since her holiday in France."}, {"viet": "Cô ấy nghe thấy sáu tiếng tuýt tuýt báo giờ trên rađiô.", "eng": "She heard the six pips of the time-signal on the radio."}, {"viet": "Cô ta háo hức với ý nghĩ được tiêu hết số tiền ấy.", "eng": "She is licking her chops at the thought of spending all that money."}, {"viet": "Bà ta không ngừng xen ngang vào câu chuyện của chúng tôi.", "eng": "She kept cutting into our conversation."}, {"viet": "Cô ấy nhìn anh ta với vẻ kinh ngạc.", "eng": "She looked at him with an amazed expression."}, {"viet": "Cô ta đã đề cập trong phần tái bút rằng bưu kiện đã đến nơi.", "eng": "She mentioned in a postscript to her letter that the parcel had arrived."}, {"viet": "Bà ta mua chúng với giá 82 pao, bán lại 84 pao và đút túi chỗ chênh lệch.", "eng": "She pays 82 pounds for them, sells them for 84 pounds and pocket the difference."}, {"viet": "Bà ta đứng đầu trong các nhạc trưởng hàng đầu của đất nước.", "eng": "She ranks foremost among the country's leading conductors."}, {"viet": "Cô ta là mẫu người đầy nghị lực.", "eng": "She's a very vital sort of person."}, {"viet": "Cô ta đang trên đường về nhà.", "eng": "She's on her way home."}, {"viet": "Cô ấy nói nó là của thật nhưng chúng tôi nghĩ khác.", "eng": "She says it's genuine-but me think otherwise."}, {"viet": "Cô ta cho thấy một trình độ kỹ năng cao trong công việc.", "eng": "She shows a high degree of skill in her work."}, {"viet": "Cô ta nhìn trừng trừng vào con sư tử mà đứng như trời trồng.", "eng": "She stared at the lion, transfixed with terror."}, {"viet": "Bà ta nói nhiều đến nỗi không tài nào xen được một lời.", "eng": "She talks so much that it's impossible to get a word in."}, {"viet": "Cô ta bối rối ngoảnh mặt đi.", "eng": "She turned away in embarrassment."}, {"viet": "Khi còn trẻ cô ta nổi tiếng là một giai nhân.", "eng": "She was a famous beauty in her youth."}, {"viet": "Cô ấy hoan hỉ vì được tăng lương.", "eng": "She was chuffed about getting a pay rise."}, {"viet": "Cô ta ác cảm đối với việc hôn nhân của họ.", "eng": "She was ill disposed to wards the idea of their marriage."}, {"viet": "Cô ta đùng đùng kể cho chúng tôi nghe tin.", "eng": "She was positively bursting to tell us the news."}, {"viet": "Cô ta đi đứng loạng choạng với đôi giày rất cao gót.", "eng": "She was teetering around in very high-heeled shoes."}, {"viet": "Cô ta mặc những bộ quần áo lạ lùng nhất.", "eng": "She wears the most extraordinary get-ups."}, {"viet": "Cô ta đoạt giải nhất mặc dù không ai trong chúng tôi đã mong đợi chuyện đó.", "eng": "She won first prize, though none of us had expected it."}, {"viet": "Loài giáp xác không nằm trong số loài cá chính.", "eng": "Shellfish are not among the fishes proper."}, {"viet": "Câm miệng lại là lối nói bất lịch sự.", "eng": "Shut up is not a polite expression."}, {"viet": "Ngài Gawain đã hạ người hiệp sĩ lạ mặt ngã ngựa.", "eng": "Sir Gawain unhorsed the strange knight."}, {"viet": "Giới đầu tư kinh nghiệm và có thế lực đang hậu thuẫn ứng cử viên đó.", "eng": "Smart money is supporting that candidate."}, {"viet": "Vì vậy, để tôi chuyển đổi 650 ¥ sang đô la Mỹ.", "eng": "So let me convert ¥ 650 into US dollars."}, {"viet": "Một anh chàng cảnh sát giao thông định giữ tôi vì phóng nhanh nhưng tôi đã lừa được anh ta.", "eng": "Some baby bear tried to arrest me for speeding, but I conned him out of it."}, {"viet": "Một số cầu thủ đòi một quả phạt đền nhưng trọng tài bảo họ cứ tiếp tục chơi.", "eng": "Some of the players claimed a penalty, but the referee told them to play on."}, {"viet": "Một số bộ lạc di chuyển cùng với gia súc của họ để đi tìm cỏ tươi.", "eng": "Some tribes migrate with their cattle in search of fresh grass."}, {"viet": "Đau buồn vì cái chết của đứa con mình.", "eng": "Sorrowing over his child's death."}, {"viet": "Tiêu quá nhiều bây giờ sẽ đưa tới thiếu hụt tiền mặt sang năm.", "eng": "Spending too much now will mean a shortage of cash next year."}, {"viet": "Xe lửa chạy bằng hơi nước có thời vàng son của nó ở thế kỷ 19.", "eng": "Steam railways had their heyday in the 19th century."}, {"viet": "Đừng có ầm ĩ nữa ông ta bực bội hét lên.", "eng": "Stop that noise, he cried out in exasperation."}, {"viet": "Dùng sức mạnh tinh thần thay cho sức mạnh về thể xác.", "eng": "Substituting moral power for physical force."}, {"viet": "Chịu thua lỗ trên thị trường hàng xuất khẩu.", "eng": "Suffer loss in the export market."}, {"viet": "Lau vết thương bằng bông gòn.", "eng": "Swab the wound with cotton wool."}, {"viet": "Nhấc cánh cửa ra khỏi bản lề và gắn trở lại.", "eng": "Take the door off its hinges and rehang it."}, {"viet": "Những thanh thiếu niên đang cố được tự do thoát khỏi sự kiểm soát của bố mẹ.", "eng": "Teenagers straining at the leash to escape parental control."}, {"viet": "Cám ơn bạn về tất cả những công việc khó nhọc mà bạn đã đóng góp.", "eng": "Thank you for all the hard work you've put in."}, {"viet": "Có thể không phải là quan điểm dứt khoát của cô ta về vấn đề đó.", "eng": "That's unlikely to be her last word on the subject."}, {"viet": "Đơn giản là cớ đó không làm tôi tin được.", "eng": "That excuse simply won't wash with me."}, {"viet": "Sai lầm đó anh ta đã phải trả giá đắt: vì nó mà anh ta đã thua cuộc.", "eng": "That mistake cost him dear: he lost the game because of it."}, {"viet": "Đó mới chỉ là một cách làm.", "eng": "That's one way of doing it."}, {"viet": "Lần đầu thử như vậy là được đấy.", "eng": "That was not bad for a first attempt."}, {"viet": "Tôi e rằng chỗ ăn ở chỉ được tàm tạm thôi.", "eng": "The accommodation is rather rough and ready, I'm afraid."}, {"viet": "Cơ quan dịch vụ hàng năm tìm việc cho khoảng 2000 thư ký.", "eng": "The agency places about 2000 secretaries per annum."}, {"viet": "Khứu giác rất thính của con vật bù đắp cho thị lực kém của nó Cô ta đã được công ty bảo hiểm bồi thường về những thương tổn của cô.", "eng": "The animal's good sense of smell compensates for its poor eyesight She was compensated by the insurance company for her injuries."}, {"viet": "Cuộc tranh luận phát triển thành một cuộc cãi nhau gay gắt.", "eng": "The argument developed into a bitter quarrel."}, {"viet": "Không khí trong văn phòng vốn đã căng thẳng ít lâu nay nhưng vụ sa thải mới đây đã đẩy các vấn đề tới đỉnh điểm.", "eng": "The atmosphere in the office had been tense for some time but this latest dismissal brought matters to a head."}, {"viet": "Bộ lạc Aztecs chinh phục các bộ lạc lân cận.", "eng": "The Aztecs subjected the neighbouring tribes."}, {"viet": "Cả bọn đi nhún nhảy xuôi đường phố.", "eng": "The band swung lightly down the street."}, {"viet": "Đài BBC được nối sóng với truyền hình Úc bằng vệ tinh.", "eng": "The BBC is hooked up with Australian television by satellite."}, {"viet": "Dự luật đã được thông qua với số phiếu 340 trên 210.", "eng": "The bill was carried by 340 votes to 210."}, {"viet": "Thuyền này hoạt động trên quãng đường Dover-Calais.", "eng": "The boat operates on the Dover-Calais run."}, {"viet": "Anh ta biên soạn lại và xuất bản quyển sách.", "eng": "The book was arranged and edited by him."}, {"viet": "Bọn trẻ rất mệt như thế ắt chúng đã phải đi bộ một quãng đường dài.", "eng": "The boys are very tired so they must have walked a long way."}, {"viet": "Tước đoạt tài sản một người.", "eng": "The brothers planned to rob a person of his property."}, {"viet": "Xe buýt mỗi giờ chạy hai chuyến, trước giờ mười lăm phút và sau giờ mười lăm phút, thí dụ 10 giờ 15 và 10 giờ 45.", "eng": "The buses leave twice every hour on the quarter."}, {"viet": "Hiệu suất của chiếc ôtô tăng gấp đôi từ khi máy được điều chỉnh.", "eng": "The car's performance is twice as good since the engine's been tuned."}, {"viet": "Chiếc xe ôtô đang lăn bon bon trên con đường đó.", "eng": "The car was spinning merrily along the road."}, {"viet": "Trâu bò đã giẫm thành một con đường mòn đi ra ao.", "eng": "The cattle had trodden a path to the pond."}, {"viet": "Thánh đường này được hiến dâng vào năm 1880.", "eng": "The chapel was dedicated in 1880."}, {"viet": "Đứa bé dí sát mũi vào cửa sổ.", "eng": "The child pressed her nose against the window."}, {"viet": "Bọn trẻ đi thình thịch vào nhà như một bầy voi.", "eng": "The children came galumphing into the house like a herd of elephants."}, {"viet": "Khi chúng tôi về nhà thì bọn trẻ đã ngủ rồi.", "eng": "The children were already asleep when we got home."}, {"viet": "Thành phố này thuận lợi vì chung quanh nó có nhiều trường và viện bảo tàng đẹp.", "eng": "The city is advantaged because of its proximity to many fine school and museums."}, {"viet": "Quần áo đóng băng trên dây phơi.", "eng": "The clothes were frozen on the washing-line."}, {"viet": "Mới sau hai lần giặt mà màu đã phai rồi.", "eng": "The colour had faded after only two washes."}, {"viet": "Công ty này độc quyền cung cấp điện.", "eng": "The company had a monopoly in supplying electricity."}, {"viet": "Máy điện toán đã được lập trình ( để tính mức lãi gộp cho tất cá các mặt hàng bán buôn ).", "eng": "The computer has been programed ( to calculate the gross profit margin on all sales )."}, {"viet": "Hợp đồng qui định rõ mái nhà bằng ngói đỏ chứ không phải đá phiến đen.", "eng": "The contract specifies red tiles, not slates, for the roof."}, {"viet": "Quân đội của nước đó bị thua kém về quân số và về lực lượng.", "eng": "The country army was outmanned and outgunned."}, {"viet": "Anh chàng chăn bò đó cảm thấy thích thú khi họ đọc cho anh ta nghe một lá thư ngọt ngào của vợ mình.", "eng": "The cowboy mellowed out when they read him a sweet letter from his wife."}, {"viet": "Đám đông đứng yên lặng kính cẩn khi đám tang đi qua.", "eng": "The crowd stood in respectful silence as the funeral procession went by."}, {"viet": "Những đốm màu trong các bức tranh của anh ta đôi khi gần như là do tính lập dị về trang trí.", "eng": "The dabs of colour in his paintings sometimes verge on decorative whimsy."}, {"viet": "Khe nứt sâu há toác miệng dưới chân họ.", "eng": "The deep crevasse yawned at their feet."}, {"viet": "Sức tàn phá của cơn bão.", "eng": "The destructive force of the storm."}, {"viet": "Việc ngừng sản xuất những sản phẩm bán không có lời.", "eng": "The discontinuation of our loss-making products."}, {"viet": "Sáng nay, bác sĩ phải đi thăm bệnh cho năm nơi.", "eng": "The doctor has five calls to make this morning."}, {"viet": "Con chó giữ nhà khi chúng tôi đi vắng.", "eng": "The dog guards the house when we go out."}, {"viet": "Sang năm Hội sân khấu sẽ diễn Hamlet.", "eng": "The Dramatic Society are doing Hamlet next year."}, {"viet": "Những cuộc nổi dậy trước đó đúng là những cuộc tập dượt cho cuộc cách mạng đại quy mô.", "eng": "The earlier revolts had just been dress rehearsals for full-scale revolution."}, {"viet": "Con voi nghiền nát thức ăn giữa những cái răng hàm khoẻ của nó.", "eng": "The elephant grinds its food between its powerful molars."}, {"viet": "Toàn bộ vùng đó đã bị xa lộ mới động chạm đến.", "eng": "The entire locality has been affected by the new motorway."}, {"viet": "Cuộc tham quan đó là một sự kiện nổi bật trong kỳ nghỉ của chúng tôi.", "eng": "The excursion was the high spot of our holiday."}, {"viet": "Nhà máy nuôi sống hàng ngàn lao động.", "eng": "The factory occupies thousands of hands."}, {"viet": "Con ngựa cưng đó chỉ vượt được tốp đằng sau có một đoạn ngắn.", "eng": "The favourite had a narrow lead over the rest."}, {"viet": "Cuốn phim đó đánh dấu bước đầu làm giám đốc của cô ta.", "eng": "The film marks her directorial debut."}, {"viet": "Công ty đó có doanh thu hàng năm là 75 triệu bảng Anh.", "eng": "The firm has an annual turnover of £ 75 million."}, {"viet": "Chiếc máy điện thoại đầu tiên là tiền thân của những hệ thống thông tin hiện đại sau này.", "eng": "The first telephone was the precursor of modern communications networks."}, {"viet": "Thức ăn của nhà hàng đó rất tệ.", "eng": "The food in that restaurant is third-rate."}, {"viet": "Cuộc cách mạng Pháp đã là một cuộc nổi dậy chấn động trong lịch sử châu Âu.", "eng": "The French Revolution was a volcanic upheaval in European history."}, {"viet": "Ga-ra chỉ bớt cho tôi có 500 bảng Anh cho chiếc xe hơi cũ của tôi.", "eng": "The garage allowed me £ 500 on my old car."}, {"viet": "Thế hệ trẻ giàu có của thời đại Edward.", "eng": "The gilded youth of the Edwardian era."}, {"viet": "Chính sách tiền tệ mới của nhà nước thúc đẩy nền thương nghiệp.", "eng": "The government's new money policy gives an impulse to trade."}, {"viet": "Chính phủ quan tâm trước nhất đến việc kiểm soát lạm phát.", "eng": "The Government is chiefly concerned with controlling inflation."}, {"viet": "Thống đốc còn chưa thực hiện đạo luật.", "eng": "The governor has not yet acted on the bill."}, {"viet": "Các đất đai được rào lại để ngăn chặn sự xâm phạm.", "eng": "The grounds are fenced in to prevent trespassing."}, {"viet": "Mãi cho tới tận thời kỳ vừa rồi gã mới ăn nằm được với cô gái.", "eng": "The guy doesn't make the girl until the last chapter."}, {"viet": "Chiếc trực thăng bay lượn trên toà nhà.", "eng": "The helicopter hovered over the building."}, {"viet": "Con ngựa đó không được xếp vào một trong ba hạng đấu trong bốn cuộc đua đầu tiên.", "eng": "The horse was unplaced in its first four races."}, {"viet": "Ngôi nhà này có một bãi cỏ rộng nửa mẫu Anh.", "eng": "The house has half an acre of lawn."}, {"viet": "Những người thợ săn mang thú giết được về trại.", "eng": "The hunters brought their kill back to camp."}, {"viet": "Việc tăng thuế đã được báo trước trong bài phát biểu của ông bộ trưởng.", "eng": "The increase in taxes had been foreshadowed in the minister's speech."}, {"viet": "Hợp đồng bảo hiểm này không bao gồm những hư hao bình thường.", "eng": "The insurance policy does not cover damage caused by normal wear and tear."}, {"viet": "Công việc không có vẻ hấp dẫn nhưng tôi sẽ thử xem.", "eng": "The job doesn't sound very exciting, but I'll give it a whirl."}, {"viet": "Hội thẩm đoàn quyết định lời tuyên án.", "eng": "The jury returned in their verdict."}, {"viet": "Hồ bị ô nhiễm bởi hoá chất nhà máy.", "eng": "The lake was polluted by chemicals from factories."}, {"viet": "Luật pháp cấm những người bán thuốc lá bán thuốc hút cho trẻ em.", "eng": "The law prohibits tobacconists from selling cigarettes to children."}, {"viet": "Trang thư bạn đọc là một diễn đàn có ích cho việc trao đổi các quan điểm của người đọc.", "eng": "The letters page serves as a useful forum for the exchange of readers'views."}, {"viet": "Rạp chiếu bóng địa phương được biến thành một phòng chơi binh-gô.", "eng": "The local cinema has been made into a bingo hall."}, {"viet": "Ánh lửa rực hồng của căn nhà kho đang cháy.", "eng": "The lurid glow of the blazing warehouse."}, {"viet": "Người đàn ông trong tranh là thổ dân châu úc.", "eng": "The man in the pictures is an Australian native."}, {"viet": "Trận đấu đã hoàn toàn phải hủy.", "eng": "The match was completely washed out."}, {"viet": "Buổi họp được tổ chức tuyệt mật.", "eng": "The meeting was arranged with the most secrecy."}, {"viet": "Việc khai thác quặng đồng ở Trung Phi.", "eng": "The mining of copper in central Africa."}, {"viet": "Chẳng tìm thấy món tiền đó ở đâu cả.", "eng": "The money was nowhere to be found."}, {"viet": "Sự uốn nắn tính tình của thanh niên.", "eng": "The moulding of young people's characters."}, {"viet": "Những ranh giới hạn hẹp của cuộc sống tỉnh lẻ.", "eng": "The narrow confines of small-town life."}, {"viet": "Dược phẩm mới đó đã trải qua nhiều cuộc thử nghiệm y khoa rộng rãi.", "eng": "The new drug has undergone extensive medical trials."}, {"viet": "Con đường mới đã hoàn toàn phá hỏng tính cách của ngôi làng.", "eng": "The new road has completely spoiled the character of the village."}, {"viet": "Tờ báo thấy việc công bố bức thư của tôi là không thích hợp.", "eng": "The newspaper did not see fit to publish my letter."}, {"viet": "Quyển tiểu thuyết có nhiều phần kể chuyện hơn là đối thoại.", "eng": "The novel contains more narrative than dialogue."}, {"viet": "Cuộc sống của diễn viên ở phía sau hậu trường chẳng huy hoàng.", "eng": "The off stage life of the actor is not glamorous."}, {"viet": "Ông lão hì hục leo lên sườn đồi.", "eng": "The old man laboured up the hillside."}, {"viet": "Phe đối lập chế giễu các đề nghị của chính phủ, nói rằng không có gì mới.", "eng": "The opposition ridiculed the government's proposals, saying they offered nothing new."}, {"viet": "Sơn bị tróc ở chỗ cái bàn chạm vào tường.", "eng": "The paint has chipped off where the table touches the wall."}, {"viet": "Bữa tiệc đó đúng là một bữa nhậu bí tỉ.", "eng": "The party was a real booze-up."}, {"viet": "Quãng chuyển động của quả lắc là 12 insơ.", "eng": "The pendulum's swing is 12 inches."}, {"viet": "Nhà triết học Diogenes sống ở Hy Lạp cổ xưa hơn 2000 năm trước đây.", "eng": "The philosopher Diogenes lived in ancient Greece more than 2,000 years ago."}, {"viet": "Cái tẩu thuốc loe ra ở một đầu.", "eng": "The pipe splays out at one end."}, {"viet": "Các kế hoạch đó đã được ông Bộ trưởng đích thân xét duyệt.", "eng": "The plans were personally inspected by the minister."}, {"viet": "Hoàn cảnh khó khăn của những người tị nạn đã gợi lên lòng thương xót của chúng tôi.", "eng": "The plight of the refugees arouses our compassion."}, {"viet": "Lực lượng cảnh sát còn một nửa biên chế từ khi có những vụ cắt giảm ngân sách.", "eng": "The police force has been at half strength since the budget cuts."}, {"viet": "Cảnh sát đã hành động nhanh để chống bọn cướp có súng.", "eng": "The police swung into action against the gunmen."}, {"viet": "Dân số đã tăng từ 1, 2 triệu 10 năm trước đây lên 1, 8 triệu hiện nay.", "eng": "The population has increased from 1.2 million 10 years ago to 1.8 million now."}, {"viet": "Sự có mặt của quân đội sẽ có tác dụng ngăn chăn tình trạng bất ổn trong dân chúng.", "eng": "The presence of the army should act as a check on civil unrest."}, {"viet": "Báo chí thổi phồng toàn bộ sự việc một cách tuỳ tiện.", "eng": "The press exaggerated the whole affair wildly."}, {"viet": "Hoàng tử làm vua khi vua cha mất.", "eng": "The prince became King when his father died."}, {"viet": "Những vấn đề đòi hỏi Chính phủ phải quan tâm.", "eng": "The problems that face the Government."}, {"viet": "Những sự thay đổi được đề nghị đã làm cho quần chúng lên tiếng la hét phản đối.", "eng": "The proposed changes caused howls of protest from the public."}, {"viet": "Mát tít gắn chung quanh kính cửa sổ rất kín.", "eng": "The putty gives a good seal round the window."}, {"viet": "Tuyến đường sắt đó đang có nguy cơ ngưng hoạt động.", "eng": "The railway is under threat of closure."}, {"viet": "Sự gia tăng gần đây về các tội ác tàn bạo.", "eng": "The recent growth of violent crime."}, {"viet": "Tờ trình mâu thuẫn với điều chúng ta nghe hôm qua.", "eng": "The report contradicts what we heard yesterday."}, {"viet": "Việc trả lại sách của thư viện, các chai sữa, các hàng hoá kém phẩm chất.", "eng": "The return of library books, milk bottles, faulty goods."}, {"viet": "Con sông vẫn trông thấy được qua làn sương mù mỏng.", "eng": "The river was visible through a light mist."}, {"viet": "Phòng đã bị khoá bên trong.", "eng": "The room had been locked on the inside."}, {"viet": "Người Nga đã giành sạch các huy chương trong các môn thi đấu thể dục.", "eng": "The Russians made a clean sweep of the gymnastics events."}, {"viet": "Bức tranh mô tả chúa Hài Đồng nằm trong máng.", "eng": "The scene shows the baby Jesus cradled in a manger."}, {"viet": "Việc tìm kiếm một vắc xin mới chiếm vị trí ưu tiên trên tất cả các cuộc nghiên cứu y học khác.", "eng": "The search for a new vaccine took priority over all other medical research."}, {"viet": "Sự phục vụ trong tiệm ăn đó rất chậm.", "eng": "The service in that new restaurant are very slow."}, {"viet": "Con tàu đã đậu trong cảng bốn ngày.", "eng": "The ship spent four days in port."}, {"viet": "Buổi diễn được công nhận là thành công.", "eng": "The show was voted a success."}, {"viet": "Người trượt băng thực hiện một loạt động tác tuyệt vời.", "eng": "The skater executed a perfect set of figures."}, {"viet": "Nhân viên công tác xã hội khuyên họ đưa con vào nơi chăm sóc đặc biệt.", "eng": "The social worker advised them to put their handicapped child into care."}, {"viet": "Tiếng sôi ục ục trong bụng của mình.", "eng": "The sound of one's stomach grumbling."}, {"viet": "Cái vỏ của mụ gián điệp là kỹ sư cố vấn.", "eng": "The spy's cover was that she was a consultant engineer."}, {"viet": "Cái gậy làm xước sườn xe ô tô.", "eng": "The stick scratched the side of the car."}, {"viet": "Những người đình công đã điều hành ngang qua trung tâm thành phố.", "eng": "The strikers paraded through the city centre."}, {"viet": "Mặt trời từ trong đám mây nhô ra.", "eng": "The sun emerged from behind the clouds."}, {"viet": "Việc cắt giảm thuế được công chúng hoan nghênh.", "eng": "The tax cuts produced a favourable response from the public."}, {"viet": "Đội đã bị loại khỏi cuộc thi đấu.", "eng": "The team has been disqualified from the competition."}, {"viet": "Nhà hát được đặt dưới sự đỡ đầu của Hội đồng nghệ thuật.", "eng": "The theatre is under the patronage of the Arts Council."}, {"viet": "Khoảng thời gian giữa nghiên cứu và phát triển.", "eng": "The time-lag between research and development."}, {"viet": "Thành phố được phòng thủ cẩn thận nên có ít khả năng đánh chiếm bất ngờ.", "eng": "The town was well defended so there was little chance of taking it by surprise."}, {"viet": "Cây bây giờ đã rụng lá.", "eng": "The trees were now denuded of their leaves."}, {"viet": "Hai con ngựa chạy ngang nhau khi vào tới đoạn thẳng cuối cùng.", "eng": "The two horses were level as they entered the final straight."}, {"viet": "Liên bang cộng hoà xã hội chủ nghĩa Xô viết.", "eng": "The Union of Soviet Socialist Republics."}, {"viet": "Những sự khác biệt đã chứng tỏ chúng ta đoạn tuyệt với truyền thống xa xưa.", "eng": "The very difference underscores, our break with pass traditions."}, {"viet": "Bức tường hơi lệch hướng thẳng đứng.", "eng": "The wall is a little out of the perpendicular."}, {"viet": "Tầm gửi xoắn lại với nhau quanh cành cây.", "eng": "The weed had twined itself round the branches."}, {"viet": "Gió đang nổi lên-tôi cho rằng sắp có bão.", "eng": "The wind is rising-I think there's a storm coming."}, {"viet": "Những lời lẽ... còn gây nhức nhối những điều hồi tưởng về sự căng thẳng không thể giải quyết được giữa những người Mĩ gốc Châu Phi.", "eng": "The words... are stinging reminders of the unresolved tension among African-Americans."}, {"viet": "Chú bé đánh đổ nước quả xuống ngực áo.", "eng": "The young boy split some juice down his front."}, {"viet": "Lần đầu tiên họ nhìn thấy đất liền sau mười ngày đi biển.", "eng": "Their first sight of land came after ten days at sea."}, {"viet": "Con trai của họ rất thích công việc nhà và thường nấu ăn.", "eng": "Their son is very domesticated and often does working."}, {"viet": "Rồi ông sẽ đến một giao lộ lớn.", "eng": "Then you'll come to the large intersection."}, {"viet": "Có chỗ trống ở kia chúng ta có thể đỗ xe.", "eng": "There's a vacant place over there where we can park."}, {"viet": "Không có nhiều sự hoạt động chống lại kế hoạch.", "eng": "There's not much opposition to the scheme."}, {"viet": "Có ít vấn đề hai bên hoàn toàn đồng ý với nhau.", "eng": "There are few issues on which the two are in perfect accord."}, {"viet": "Có rất nhiều diễn viên mới, giỏi xuất hiện khiến các diễn viên lớn tuổi hơn chẳng bao lâu sẽ phải lưu tâm bảo vệ địa vị của mình.", "eng": "There are so many good new actors around that the older ones will soon have to look to their laurels."}, {"viet": "Đã chẳng có tin tức gì suốt một tuần nay và anh ta bắt đầu thắc mắc.", "eng": "There has been no news for a week and he is beginning to wonder."}, {"viet": "Có thủ tục định sẵn để làm đơn khiếu nại đúng phép.", "eng": "There is a set procedure for making formal complaints."}, {"viet": "Hiện nay có một số lượng sách rất lớn về vấn đề này.", "eng": "There is now a vast literature on the subject."}, {"viet": "Có một đám đông người đang đợi ở ga.", "eng": "There was a crowd of people waiting at the station."}, {"viet": "Không có cuộc sống động vật ở những vùng nước mặn.", "eng": "There was no animal life in the saline waters."}, {"viet": "Có một vài điểm không đúng quy cách trong bản kê khai, thí dụ con số không đúng.", "eng": "There were some irregularities in the accounts."}, {"viet": "Những sự phát triển này được củng cố bằng tiến bộ vững chắc trong công nghiệp nặng.", "eng": "These developments are underpinned by solid progress in heavy industry."}, {"viet": "Những chính sách này sẽ ảnh hưởng đặc biệt đến những người không thuộc chủng tộc da trắng.", "eng": "These policies will affect nonwhite especially."}, {"viet": "Họ đang gây nhiều khó dễ cho cô ấy.", "eng": "They're making things very hot for her."}, {"viet": "Họ hát để làm giảm bớt nỗi buồn chán của sự chờ đợi.", "eng": "They alleviated the boredom of waiting by singing songs."}, {"viet": "Tuổi chúng nó kém nhau vài tháng.", "eng": "They are within a few months of the same age."}, {"viet": "Chúng chuồn khi thấy cảnh sát đến.", "eng": "They cleared off when they saw the police coming."}, {"viet": "Họ thường không bỏ tù những người phạm tội lần đầu.", "eng": "They don't usually imprison first offenders."}, {"viet": "Họ chặt cây mở một con đường qua cánh rừng.", "eng": "They hacked their way through the jungle."}, {"viet": "Họ thực hiện rút thăm để quyết định ai phải đi.", "eng": "They held a lottery to decide who should go."}, {"viet": "Họ đã thoát được ngọn lửa và chạy đến nơi an toàn.", "eng": "They managed to escape the fire and run to safety."}, {"viet": "Họ góp chung tiền tiết kiệm để mua một ngôi nhà ở nông thôn.", "eng": "They pooled their savings and bought a house in the country."}, {"viet": "Họ nói rằng ông là một trong những người chơi gôn giỏi nhất ở đây.", "eng": "They say you're one of the best golfers here."}, {"viet": "Họ phân vân giữa lạc quan và bi quan.", "eng": "They swing between optimism to pessimism."}, {"viet": "Tất cả bọn họ đều chiến đấu cho một sự nghiệp chung.", "eng": "They were all fighting for the same cause."}, {"viet": "Đôi khi họ bị ép buộc phải đánh nhau với sư tử và các thú dữ khác, trong khi người La Mã thì ngắm xem họ biểu diễn.", "eng": "They were sometimes forced to fight lions and other wild animals while Romans watched the sport."}, {"viet": "Ba mươi người đã đến-một số đã ở lại đến cuối cùng còn nhiều người đã về sớm.", "eng": "Thirty people came-some stayed until the end but many left early."}, {"viet": "Nhà thờ này là một mẫu cổ điển của kiến trúc thời Trung cổ.", "eng": "This church is a classic example of medieval architecture."}, {"viet": "Quả trứng này luộc chín quá-anh đã không tính giờ đúng.", "eng": "This egg is hard-you didn't time it properly."}, {"viet": "Tôi nghĩ đây là một cửa hàng tốt để mua sắm.", "eng": "This is a good store to shop in, I think."}, {"viet": "Đây là sự thay đổi chính phủ lần thứ ba của đất nước này trong hai năm.", "eng": "This is the third change of government the country has seen in two years."}, {"viet": "Điều này là chắc chắn, anh sẽ không bao giờ đi bộ được nữa.", "eng": "This much is certain, you will never walk again."}, {"viet": "Chính sách này dẫn đến chỗ làm tăng sự thu hút quần chúng của đảng.", "eng": "This policy led to an upswing in the party's popularity."}, {"viet": "Loài này đã đạt đến trình độ phát triển cao hơn.", "eng": "This species has reached a higher plane of development."}, {"viet": "Nền đất ẩm này không đủ chắc để bước lên trên.", "eng": "This wet ground is not firm enough to walk on."}, {"viet": "Vui lòng cho tôi 3,5 mét", "eng": "Three and a half meters, please."}, {"viet": "Ngày mai chúng ta sẽ làm bài kiểm tra.", "eng": "Tomorrow we're going to have an exam."}, {"viet": "Trừ phi có ai chợt có ý kiến gì hay chúng mình chẳng bao giờ giải quyết được vấn đề này.", "eng": "Unless someone has a brainwave we'll never solve this problem."}, {"viet": "Hãy rửa tay trước khi cầm vào thức ăn.", "eng": "Wash your hands before you handle food."}, {"viet": "Với hai nhân viên của cơ quan nghỉ ốm, chúng tôi sẽ càng phải làm việc vất vả hơn.", "eng": "We'll have to work all the harder with two members of staff away ill."}, {"viet": "Chúng tôi ở trong một tình trạng khó khăn thực sự không có ai trông nom đứa bé.", "eng": "We're in a real fix-there's nobody to look after the baby."}, {"viet": "Chúng tôi đã quyết định chuyển nhưng vẫn còn đang cân nhắc xem đi đâu.", "eng": "We've decided to move but are still considering where to go to."}, {"viet": "Chúng tôi nhằm quay vòng nhanh hàng hoá trong kho của cửa hàng chúng tôi.", "eng": "We aim for a quick turnover of stock in our stores."}, {"viet": "Chúng ta chưa có bước tiến nào hơn đối với dự án đó.", "eng": "We are not getting any further forward with the project."}, {"viet": "Chúng tôi đưa thuyền của chúng tôi lên cùng với thuyền của họ.", "eng": "We brought our boat alongside ( their boat )."}, {"viet": "Chúng ta có thể nói: wash up the dishes, nhưng chúng ta không thể nói: wash up the baby-Trong trường hợp này, wash up là cách dùng từ đặc biệt.", "eng": "We can say: wash up the dishes, but we can not say: wash up the baby-In these cases, wash up is an idiom."}, {"viet": "Chúng tôi đòi hỏi khôi phục ngay quyền bầu cử của chúng tôi.", "eng": "We demand an immediate restoration of our right to vote."}, {"viet": "Chúng ta đứng trước một triển vọng chán chường về tình trạng thất nghiệp còn cao hơn nữa.", "eng": "We face the grim prospect of still higher unemployment."}, {"viet": "Chúng tôi đã đi được chừng 50 dặm thì xe bị pan.", "eng": "We had gone about fifty miles when the car broke down."}, {"viet": "Chúng ta sản xuất bơ sữa không phải chỉ để lấy sữa mà còn làm kem, phó mát, bơ và kem lạnh nữa.", "eng": "We have dairying to thank not only milk itself, but also for cream, cheese, butter, and ice cream."}, {"viet": "Chúng tôi chưa tìm ra giải pháp nhưng tôi chắc là chúng tôi đang đi đúng hướng.", "eng": "We haven't found the solution yet, but I'm sure we're on the right track."}, {"viet": "Chúng tôi đã sống ở châu Phi năm năm, nhưng thực sự chúng tôi không bao giờ thích nghi với khí hậu nóng bức ở đó.", "eng": "We lived in Africa for five years, but we never really got acclimatized to the hot weather there."}, {"viet": "Hơn thế nữa, chúng ta cần phải quan tâm giờ giấc trong năm.", "eng": "We must consider, too, the time of year."}, {"viet": "Chúng tôi cần gấp bốn lần số người chơi để làm thành một ban nhạc đầy đủ.", "eng": "We need quadruple the number of players we've got for a full orchestra."}, {"viet": "Hiện nay chúng tôi đang bán quần áo thể thao của công ty ông.", "eng": "We're now working on your sports wear."}, {"viet": "Chúng tôi bắt tay nhau để biểu hiện tình bằng hữu.", "eng": "We shook hands as a token of our friendship."}, {"viet": "Chúng tôi lang thang khắp phố phường để tìm một cuốn sách.", "eng": "We traipsed an over town looking for a copy of book."}, {"viet": "Chúng tôi ngạc nhiên một cách thú vị thấy họ sẵn lòng thương lượng.", "eng": "We were agreeably surprised their willingness to negotiate."}, {"viet": "Chúng tôi không thể nhận thấy vấn đề ở chỗ nào.", "eng": "We were unable to perceive where the problem lays."}, {"viet": "Hàng tuần buổi quảng cáo rùm beng trước buổi diễn đầu tiên.", "eng": "Weeks of ballyhoo preceded the play's first night."}, {"viet": "À, dường như vấn đề phổ biến hơn là chúng ta đã nghĩ.", "eng": "Well, it seems the problem is more general than we realized."}, {"viet": "Weymouth là một nơi nghỉ mát chủ yếu.", "eng": "Weymouth is principally a holiday resort."}, {"viet": "Một số công ty liên doanh nổi tiếng ở Nhật Bản là những công ty nào?", "eng": "What are some famous joint ventures in Japan?"}, {"viet": "Ông muốn có loại đơn vị tiền tệ nào?", "eng": "What denominations do you like to have?"}, {"viet": "Thằng điên nào đã để cái bút sơn ướt lên trên ghế của tôi ấy nhỉ?", "eng": "What fool has put that wet paint brush on my chair?"}, {"viet": "Điều mạo hiểm nhất bạn từng làm là gì?", "eng": "What is the most adventurous thing you have ever done?"}, {"viet": "Bạn đã chơi xỏ Marry trò gì mà làm cô ấy phát khùng lên vậy?", "eng": "What kind of trick did you play on Mary that made her so mad?"}, {"viet": "Tôi có thể dùng phần mềm nào cho máy tính này?", "eng": "What software can I use with this computer?"}, {"viet": "Dù anh có làm điều gì tôi cũng sẽ không tiết lộ bí mật của mình cho anh đâu.", "eng": "Whatever you do I won't tell you my secret."}, {"viet": "Khi cười, anh ta phô bày một hàm răng trắng muốt.", "eng": "When he smiled he exposed a set of perfect white teeth."}, {"viet": "Khi người ta nói rằng bạn xinh đẹp.", "eng": "When people say you are pretty."}, {"viet": "Khi họ có đợt bán hạ giá, chỗ đó luôn luôn chật ních người.", "eng": "When they have a sale, the piece is always packed."}, {"viet": "Anh sẽ đi đâu nghỉ cuối tuần?.", "eng": "Where are you going at the weekend?."}, {"viet": "Ngài thích chọn kem đánh răng nhãn hiệu gì?", "eng": "Which brand of toothpaste do you prefer?"}, {"viet": "Trọng âm của từ này rơi vào âm nào?", "eng": "Which stress does the stress of this word fall on?"}, {"viet": "Ai đã lấy sôcôla của tôi để trong tủ lạnh?", "eng": "Who has taken my chocolate from the fridge?"}, {"viet": "Tại sao người Nhật thích đọc truyện tranh?", "eng": "Why do Japanese men read comic books?"}, {"viet": "Nạn lụt lội tràn lan đang ảnh hưởng đến những vùng rộng lớn ở Devon.", "eng": "Widespread flooding is affecting large areas of Devon."}, {"viet": "Ông muốn trả bằng tiền mặt hay là tôi sẽ trừ vào tài khoản của ông?", "eng": "Will you pay cash or shall I charge it to your account?"}, {"viet": "Cứ mỗi bước đi, túi đựng sữa lắc qua lắc lại.", "eng": "With each step the pouch of milk swung from side to side."}, {"viet": "Thu nhập của công nhân không tăng kịp với nạn lạm phát.", "eng": "Worker's incomes are not keeping up with inflation."}, {"viet": "Anh dùng thêm trứng và bơ nhé?", "eng": "Would you like some more eggs and butter?"}, {"viet": "Ông làm ơn cho xem số gửi tiền được không?", "eng": "Would you please present your deposit book?"}, {"viet": "Có, người láng giềng kế bên nhà tôi là một người bạn tốt của tôi.", "eng": "Yes, and the next door neighbor is a good friend of mine."}, {"viet": "Vâng, chúng cũng hợp tác với nhau.", "eng": "Yes, they also cooperate with each other."}, {"viet": "Anh phải tuân theo quyết định của quan toà.", "eng": "You'll have to abide by the judge's decision."}, {"viet": "Các em không được phép đá bóng trong lớp học.", "eng": "You're not supposed to play football in the class-room."}, {"viet": "Cậu không phải là người có tư cách để lải nhải giảng cho tôi về tính hiệu quả!", "eng": "You are in no position to preach to me about efficiency!"}, {"viet": "Bà không thể che giấu mãi không cho con cái tiếp xúc với cuộc sống thực tế.", "eng": "You can't screen your children from real life for ever."}, {"viet": "Anh có thể vá lốp xe bằng một miếng vá cao su.", "eng": "You can patch a bicycle tyre with a piece of rubber."}, {"viet": "Anh không đậy lại chai soda bây giờ tất cả ga hết rồi.", "eng": "You didn't put the top back on the soda and now all the fizz has gone out of it."}, {"viet": "Bạn gọi đúng số nhưng nhầm người rồi.", "eng": "You have the right number but the wrong party."}, {"viet": "Sau chuyến đi dài, trông anh có vẻ mệt lử.", "eng": "You look worn-out after your long journey."}, {"viet": "Trong công viên ông phải giữ dây dắt chó.", "eng": "You must keep your dog on a lead in the park."}, {"viet": "Ông phải ở lại lâu ở đường Louis thôi.", "eng": "You ought to layover in St. Louis."}, {"viet": "Em nên gọi điện báo cho bố mẹ biết là em sẽ về muộn.", "eng": "You should ring your parents to let them know you will be late."}, {"viet": "Cô là người có lòng tốt giúp đỡ ở cửa hàng.", "eng": "You were a good girl to help in the shop."}, {"viet": "Người trẻ thường có nhiều sinh lực hơn người già.", "eng": "Young people usually have more energy than the old."}, {"viet": "Các phản đối của anh không liên quan tới vấn đề đang bàn cãi.", "eng": "Your objections do not touch the point at issue."}]