[{"viet": "Mức chiết khấu 5% là mức cao nhất mà chúng tôi có thể dành cho các ông bởi vì chi phí nhân công đang gia tăng.", "eng": "A 5% discount is the best we can offer you because of a rise in the labor cost."}, {"viet": "Các móng vuốt của mèo có thể co vào.", "eng": "A cat's claws are retractile."}, {"viet": "Một sự cam kết cho hội từ thiện 100 bảng Anh.", "eng": "A commitment to pay £ 100 to charity."}, {"viet": "Một tội ác có thể bị trừng phạt bằng việc treo cổ.", "eng": "A crime punishable by the gallows."}, {"viet": "Một chỉ thị từ trụ sở văn phòng trung ương yêu cầu gia tăng năng suất.", "eng": "A directive from headquarters calling for increased output."}, {"viet": "Một luận chứng khả thi đang được thực hiện trước khi chúng tôi đầu tư vào công ty liên doanh này.", "eng": "A feasibility study is being carried out before we invest in the joint venture company."}, {"viet": "Một vầng trán nhăn vì tuổi tác và lo âu.", "eng": "A forehead furrowed by old age and anxiety."}, {"viet": "Một cuộc hôn nhân tốt đẹp dựa vào lòng tin cậy.", "eng": "A good marriage is based on trust."}, {"viet": "Một cuộc chuyển giao việc theo dõi chiếc máy bay từ đài kiểm soát này qua đài khác.", "eng": "A handoff of the aircraft from one control tower to another."}, {"viet": "Một trăm xu bằng một bảng Anh.", "eng": "A hundred pence make one pound."}, {"viet": "Một đám côn đồ xem thường luật cướp bóc và phá các cửa tiệm.", "eng": "A lawless mob looting and destroying shops."}, {"viet": "Một vòng ruybăng để xách gói hàng.", "eng": "A loop of ribbon to carry the package by."}, {"viet": "Cuộc thi những người giống Marilyn Monroe.", "eng": "A Marilyn Monroe look-alike contest."}, {"viet": "Một sự dọn nhà từ tỉnh về quê.", "eng": "A move from the town into the country."}, {"viet": "Một vẻ hơi bồn chồn trong giọng nói của cô ta.", "eng": "A note of subdued excitement in her voice."}, {"viet": "Một dân tộc nô lệ cho những điều kỳ diệu của thương mại.", "eng": "A people in thrall to the miracles of commerce."}, {"viet": "Một vụ lộn xộn nhỏ tại Hạ Viện.", "eng": "A pocket-sized riot in the Lower House."}, {"viet": "Một buổi trình diễn vở Hamlet cho những khán giả hâm mộ.", "eng": "A production of Hamlet playing to enthusiastic audiences."}, {"viet": "Một người kể chuyện cho trẻ con nghe.", "eng": "A relator of stories for children."}, {"viet": "Một vị trí an toàn ở sân sau phòng tuyến.", "eng": "A safe position well behind the lines."}, {"viet": "Một viên cảnh sát tinh mắt nhận ra được chiếc ôtô bị mất cắp.", "eng": "A sharp-eyed police officer spotted the stolen car."}, {"viet": "Sự hiểu biết sơ sơ mọi điều và sự chẳng am hiểu một điều gì.", "eng": "A smattering of everything, and a knowledge of nothing."}, {"viet": "Cách sử dụng kỳ lạ đường nét và màu sắc là nét đặc trưng của họa sĩ này.", "eng": "A startling use of line and colour that is this artist's special trade mark."}, {"viet": "Một ít ỏi trong món thịt hầm.", "eng": "A suspicion of garlic in the stew."}, {"viet": "Một máy quay video xách tay có bộ phận ghi âm đắt tiền nhất.", "eng": "A top-of-the-range camcorder."}, {"viet": "Một giọng nói không có chút giọng nước ngoài.", "eng": "A voice without a trace of accent."}, {"viet": "Một bản tóm tắt tin buổi tối.", "eng": "A wrap-up of the evening news."}, {"viet": "Hành động theo đúng phong tục, những điều lệ, luật pháp.", "eng": "Act in accordance with custom, the regulations, the law."}, {"viet": "Sau một đợt phi nước đại, con ngựa mệt đừ.", "eng": "After a hard gallop, the horse was played out."}, {"viet": "Sau bữa ăn trưa anh ta lui về phòng làm việc của mình.", "eng": "After lunch he retired to his study."}, {"viet": "Sau vụ đánh cướp bọn bất lương đã chia chác với nhau tiền lấy trộm được.", "eng": "After the robbery the crooks had a share-out of the stolen money."}, {"viet": "Mọi cặp mắt đều hướng về phía trước khi chúng tôi vượt qua các đấu thủ khác.", "eng": "All eyes to the front as we pass the other competitors!"}, {"viet": "Những cuốn sách được in vào thời kỳ sơ khai của ngành in, từ năm 1455 đến 1500, được gọi là sách sơ khai.", "eng": "All the books that were printed when printing was in its babyhood-from the year 1455 to 1500-are called cradle books."}, {"viet": "Hầu hết mỗi gia đình trong làng đều có một ti vi.", "eng": "Almost every family in the village owns a television."}, {"viet": "Một thanh niên giỏi lý thuyết nhưng hoàn toàn thiếu khả năng thực hành.", "eng": "An academically clever but totally impractical young man."}, {"viet": "Một vận động viên được một ngân hàng bảo trợ.", "eng": "An athlete sponsored by a bank."}, {"viet": "Một khoảng thời gian kéo dài thêm của một kỳ nghỉ hè của ai.", "eng": "An extension of one's summer holidays."}, {"viet": "Một lời bác bỏ chính thức về tin sẽ có một cuộc bầu cử vào tháng Năm.", "eng": "An official denial that there would be an election in May."}, {"viet": "Một tin mới nhất về tình hình chính trị.", "eng": "An update on the political situation."}, {"viet": "Ann lúc đó đã nhảy vào cuộc tranh cãi bằng sự công kích dữ dội vị chủ tịch.", "eng": "Ann then sailed in with a furious attack on the chairman."}, {"viet": "Các đơn xin việc cứ gởi tới lẻ tẻ từng đôi ba lá một.", "eng": "Applications for the job are coming in slowly in twos and threes."}, {"viet": "Ở nước bạn, người ta có muốn phụ nữ nghỉ việc một khi họ lập gia đình không?", "eng": "Are women expected to quit their jobs once they become married in your country?"}, {"viet": "Anh có hoàn toàn hiểu rõ công việc anh phải làm không?", "eng": "Are you quite clear in your own mind what you ought to do?"}, {"viet": "Với tư cách là một ký giả, tôi đứng ngoài trong cuộc khủng hoảng chính trị.", "eng": "As a journalist, I was on the sidelines during the political crisis."}, {"viet": "Ngay khi vụ lộn xộn xảy ra, các vệ sĩ của ông ta đã đưa ông ta đi đâu mất.", "eng": "As soon as the trouble began, his body-guards magicked him away."}, {"viet": "Ở độ sâu một dặm, đại dương rất lạnh và tối tăm.", "eng": "At a depth of one mile the ocean is very cold and dark."}, {"viet": "Lâm chiến với một nước láng giềng.", "eng": "At war with a neighbouring country."}, {"viet": "Sự phá sản là điều rõ ràng có thể xảy ra nếu doanh số bán không tăng lên.", "eng": "Bankruptcy is a distinct possibility if sales don't improve."}, {"viet": "Được giữ ở nhiệt độ không thay đổi.", "eng": "Be kept at a uniform temperature."}, {"viet": "Bia chảy tràn ra quanh đáy thùng.", "eng": "Beer swilled around the bottom of the barrel."}, {"viet": "Những công ty lớn không bị ảnh hưởng của sự suy thoái.", "eng": "Big corporations were untouched by the recession."}, {"viet": "Nước chanh đóng chai không ngon-bạn phải dùng nước chanh tươi cơ.", "eng": "Bottled lemon juice is no good-you must use the real thing."}, {"viet": "Xây một phần mở rộng cho một bệnh viện.", "eng": "Build an extension to a hospital."}, {"viet": "Nhưng tôi thích đi du lịch với hành lý gọn nhẹ hơn.", "eng": "But I prefer to travel light."}, {"viet": "Nhưng ông có thể kinh doanh tốt hơn nữa nếu ông phát triển được hình thức mạng lưới bán hàng nào đó ở đó.", "eng": "But you could be doing better if you developed some kind of sales network there."}, {"viet": "Nhân tiện, ông ấy đã yêu cầu tôi chuyển đến ông lời chào hỏi của ông ấy.", "eng": "By the way, he asked me to pass on his greetings to you."}, {"viet": "Tôi giữ cái đó luôn được không hay anh muốn lấy lại?", "eng": "Can I have it for keeps or do you want it back?"}, {"viet": "Cô có thể đổi phòng cho tôi được không?", "eng": "Can you change my room for me?"}, {"viet": "Anh có thể kể cho tôi một thí dụ về điều anh muốn nói không?", "eng": "Can you quote me an example of what you mean?"}, {"viet": "Anh không thể ngăn được thằng con của mình khỏi bị rắc rối sao?", "eng": "Can't you stop your son from getting into trouble?"}, {"viet": "Buổi lễ ở nhà nguyện diễn ra lúc 8 giờ.", "eng": "Chapel is at 8 o'clock."}, {"viet": "Giáng Sinh là thời gian của hạnh phúc và hy vọng.", "eng": "Christmas should be time of great cheer."}, {"viet": "Các viên chức thực dân được lệnh ban hành những sắc luật mất lòng dân, đã có khuynh hướng dùng kế hoãn binh, kiếm cớ để tránh né.", "eng": "Colonial officials ordered to enforce unpopular enactments, tended to temporize, to find excuses for evasion."}, {"viet": "Quan tâm đến hạnh phúc về tinh thần của ai.", "eng": "Concerned about somebody's spiritual welfare."}, {"viet": "Những nhà quan sát lạnh lùng có những thái độ điên khùng bất thường.", "eng": "Cool observers of nutty goings-on."}, {"viet": "Anh có thể đưa cho tôi giấy chứng nhận có gửi tiền được không?", "eng": "Could you pass me the deposit certificate?"}, {"viet": "Kiểm tra chéo đáp án của bạn bằng cách sử dụng máy tính.", "eng": "Cross-check your answer by using a calculator."}, {"viet": "Thảo luận về những biến cố theo trình tự lịch sử.", "eng": "Deal with events in historical sequence."}, {"viet": "Ghét cay ghét đắng thời tiết giá lạnh về mùa đông.", "eng": "Despised the frigid weather in winter."}, {"viet": "Bạn đã tìm thấy đôi giày của bạn chưa, John?", "eng": "Did you find your shoes, John?"}, {"viet": "Thuế trực thu thường căn cứ vào thu nhập.", "eng": "Direct taxation is usually based on income."}, {"viet": "Hầu như mọi người đều tự giặt quần áo của mình phải không?", "eng": "Do most people wash their own clothes?"}, {"viet": "Ở New Zealand, bạn có tổ chức ăn mừng lễ Halloween không?", "eng": "Do you celebrate Halloween in New Zealand?"}, {"viet": "Cô có trái cây tươi không?", "eng": "Do you have any fresh fruit?"}, {"viet": "Anh có biết hướng nào là hướng bắc không?", "eng": "Do you know which way is north?"}, {"viet": "Bạn có để dành tiền cho lúc nghỉ hưu không?", "eng": "Do you save for your retirement?"}, {"viet": "Anh có quý cô ta như là một người bạn thân không?", "eng": "Do you value her as a friend?"}, {"viet": "Con sông này chạy ra ngoài thành phố chứ?", "eng": "Does this river go beyond the town?"}, {"viet": "Đừng đổi kế hoạch của bạn vì tôi.", "eng": "Don't change your plans on my account."}, {"viet": "Đừng đi lông nhông nữa: làm việc gì đi chứ!", "eng": "Don't just maunder about: do some work!"}, {"viet": "Đừng ngủ giữa những tấm khăn trải giường ẩm.", "eng": "Don't sleep between damp sheets."}, {"viet": "Đừng có mà cả gan hỗn láo với tôi!", "eng": "Don't you dare sass me!"}, {"viet": "Sự sử dụng ma túy trong giới trẻ không giảm đi tí nào.", "eng": "Drug use among young people is in no wise decreasing."}, {"viet": "Các nỗ lực để duy trì hòa bình đã thất bại.", "eng": "Efforts to preserve the peace have failed."}, {"viet": "Các nhóm thuộc về môi trường đã thành công trong việc đặt nền công nghiệp hạt nhân vào tình trạng chờ đợi.", "eng": "Environmental groups succeeded in putting the nuclear industry into a holding pattern."}, {"viet": "Mọi người đều tỏ ra bí mật: chắc có cái gì đó gian dối đây.", "eng": "Everyone is being secretive: there's something cooking."}, {"viet": "Xin lỗi, có phải sẽ mất nhiều thời gian hơn cho bữa ăn của chúng tôi không?", "eng": "Excuse me, will it take much longer for our meal?"}, {"viet": "Tập làm quen với luật của một trò chơi.", "eng": "Familiarizing oneself with the rules of a game."}, {"viet": "Ít người trong chúng ta sẽ còn sống cho đến năm 2050.", "eng": "Few of us will still be alive in the year 2050."}, {"viet": "Khả năng tấn công trước mang tính bất ngờ trong chiến tranh hạt nhân.", "eng": "First strike capacity in a nuclear war."}, {"viet": "Theo những trào lưu mới nhất về thời trang.", "eng": "Following the latest trends in fashion."}, {"viet": "Hãy quên các nỗi ưu phiền của anh và cứ vui đi!", "eng": "Forget your worries and enjoy yourself!"}, {"viet": "Đáp ứng những điều kiện vào đại học.", "eng": "Fulfill the conditions of entry to a university."}, {"viet": "Chậm trễ trong công việc của mình.", "eng": "Get behindhand in one's work."}, {"viet": "Đấm một cú vào mũi ai.", "eng": "Give somebody a punch in the nose."}, {"viet": "Đi cứu trợ những nạn nhân trận động đất.", "eng": "Go to the relief of earthquake victims."}, {"viet": "Hãy đoán xem nhân vật lừng danh nào nói điều này?", "eng": "Guess what famous person said this?"}, {"viet": "Cô ta đã trả giá cho chiếc xe ô tô của anh chưa?", "eng": "Has she made you an offer for your car?"}, {"viet": "Bạn có bao giờ xem một trận đấu bóng chày chuyên nghiệp chưa?", "eng": "Have you ever attended a professional baseball game?"}, {"viet": "Bạn đã pha một tách trà cho bà Watson chưa?", "eng": "Have you made a cup of tea for Mrs. Watson?"}, {"viet": "Ông không đủ kiên nhẫn với những nhà trí thức.", "eng": "He'd no patience with the airy fairies."}, {"viet": "Ông ta luôn luôn chê cách nấu ăn của vợ.", "eng": "He's always running down his wife's cooking."}, {"viet": "Ông ta béo ra đến nỗi quần của ông ta phải nới rộng cạp.", "eng": "He's getting so fat that his trousers have to be let out round the waist."}, {"viet": "Nó không gầy đâu-có thể nó lại còn hơi béo nữa là khác.", "eng": "He's not thin-if anything he's rather on the plump side."}, {"viet": "Hắn thường lẩn quất đâu đó gần quán rượu.", "eng": "He's usually lurking somewhere near the bar."}, {"viet": "Ông ấy và vợ cùng làm chủ doanh nghiệp đó.", "eng": "He and his wife own the business in tandem."}, {"viet": "Anh ấy thổi một hơi tắt hết những ngọn nến trên chiếc bánh sinh nhật.", "eng": "He blew out all the candles on his birthday cake at one go."}, {"viet": "Anh ta chủ yếu dựa vào cuộc đời của anh ta và bạn bè để làm đề tài cho các cuốn tiểu thuyết xoàng của anh.", "eng": "He cannibalizes the lives of his wife and friends for his second-rate novel."}, {"viet": "Ông ta khó có thể che giấu được sự khinh rẻ của ông ta đối với sự dốt nát của tôi.", "eng": "He could hardly veil his contempt at my ignorance."}, {"viet": "Anh ta làm công việc đó hết sức thuần thục.", "eng": "He did a very workmanlike job on it."}, {"viet": "Hắn chẳng muốn có sự nghiệp, hắn chỉ muốn buông xuôi.", "eng": "He doesn't want a career, he's just drifting."}, {"viet": "Anh ta cảm thấy hơi chán sau khi bạn bè đi cả.", "eng": "He fell a bit flat after his friends had gone."}, {"viet": "Nó thấy chẳng có ai nói được tiếng Anh.", "eng": "He found that nobody could speak English."}, {"viet": "Thầy giáo khiển trách nó vì nó không làm bài đầy đủ.", "eng": "He got a rap over the knuckles from the teacher for not doing enough work."}, {"viet": "Anh ấy bị đau chân trái nên phải nhảy lò cò mà đi.", "eng": "He had hurt his left foot and had to hop along."}, {"viet": "Anh ta có tính hơi ngang tàng trong người của anh ta.", "eng": "He has a touch of madness in his composition."}, {"viet": "Anh ta cảm thấy chỗ này không thích hợp với mình.", "eng": "He has no sense of belonging here."}, {"viet": "Hắn đấm tôi, thế là tôi đấm lại-đó là ăn miếng trả miếng.", "eng": "He hit me so I hit him back-it was tit for tat."}, {"viet": "Anh ấy nhận biết đầy đủ những nguy hiểm có thể xảy ra.", "eng": "He is fully alive to the possible dangers."}, {"viet": "Ông ta không đồng ý về bất cứ loại chính sách phóng khoáng nào.", "eng": "He is unsympathetic towards any kind of liberal policy."}, {"viet": "Anh ta nằm ngửa và nhìn lên trời.", "eng": "He lay on his back and looked up at the sky."}, {"viet": "Anh đã tìm kiếm nàng nhưng không thể thấy nàng trong đám đông.", "eng": "He looked for her but couldn't see her in the crowd."}, {"viet": "Anh ta đã cố lái được cuộc thảo luận khỏi vấn đề tiền bạc.", "eng": "He managed to steer the discussion away from the subject of money."}, {"viet": "Anh ta gật đầu ra hiệu cho tôi rời khỏi phòng.", "eng": "He nodded to me to leave the room."}, {"viet": "Anh ta đóng vai ông vua già trong vở kịch của trường chúng tôi.", "eng": "He played the role of the old king in our school play."}, {"viet": "Nó lấy vai huých mạnh cửa.", "eng": "He pushed hard against the door with his shoulder."}, {"viet": "Ông ta đã được các đồng nghiệp tỏ lời ca ngợi vì đã giành được giải thưởng.", "eng": "He received praise from his colleagues for winning the prize."}, {"viet": "Nó đảo con mắt một cách kỳ quặc.", "eng": "He rolled his eyes strangely."}, {"viet": "Hắn ta luôn luôn đóng kịch.", "eng": "He's always playing a part."}, {"viet": "Anh ta đang hy vọng sẽ được tạm tha theo cam kết.", "eng": "He's hoping to get parole."}, {"viet": "Hắn bị một cái đinh làm xước tay.", "eng": "He's scratched his hand on a nail."}, {"viet": "Anh ta ngả mình trên chiếc ghế võng tắm nắng.", "eng": "He sat in a deck-chair sunning himself."}, {"viet": "Ông ta nhìn những sự việc đúng như bối cảnh của chúng.", "eng": "He sees things in their right perspective."}, {"viet": "Nó đập mạnh cuốn sách ( lên bàn ).", "eng": "He slapped the book down ( on the table )."}, {"viet": "Ông ta tự sửa soạn cho tươm tất để dự cuộc phỏng vấn.", "eng": "He spruced himself up for the interview."}, {"viet": "Ông ta nắm bàn tay đấm mạnh xuống bàn.", "eng": "He struck the table a heavy blow with his fist."}, {"viet": "Ông ta nghĩ áo quần đẹp là dấu hiệu của địa vị cao sang.", "eng": "He thinks fine clothes are a mark of gentility."}, {"viet": "Anh ta vội vàng chạy nhanh ra ga.", "eng": "He took off for the station at a run."}, {"viet": "Nó lật ngược các túi ra để tìm các chìa khoá.", "eng": "He turned his pockets inside out in search of his keys."}, {"viet": "Anh ta muốn trả thù cho cái chết của em trai.", "eng": "He wanted to avenge his brother's death."}, {"viet": "Anh ta được chỉ định vào vị trí còn trống.", "eng": "He was appointed to the vacant post."}, {"viet": "Ông ta hoàn toàn kiệt sức sau chuyến đi dài ngày.", "eng": "He was completely shattered after the long journey."}, {"viet": "Ông ấy được mọi người thừa nhận là nhà thơ tinh tế nhất của xứ sở.", "eng": "He was generally acknowledged to be the finest poet in the land."}, {"viet": "Anh ấy được làm đội trưởng đội bóng trong thời hạn một năm.", "eng": "He was made captain of the football team for a term of one year."}, {"viet": "Ông ta hoàn toàn hết hơi khi ông ta lên tới đỉnh.", "eng": "He was quite puffed by the time he reached the top."}, {"viet": "Ông ta nhanh chóng lên án bạo lực.", "eng": "He was swift to condemn the violence."}, {"viet": "Anh ta cắt đứt với tất cả cái sự đê tiện ấy.", "eng": "He washed his hand of the whole despicable affair."}, {"viet": "Ông ấy sẽ không sống qua nổi đêm nay.", "eng": "He will not live through the night."}, {"viet": "Anh ta vật đối thủ của mình xuống đất.", "eng": "He wrestled his opponent to the ground."}, {"viet": "Giúp đảo ngược một trong những đêm kém thành công trong tuần của hệ thống đó.", "eng": "Help turn around one of the network's losingest nights of the week."}, {"viet": "Sự tò mò náo nức của cô ta muốn biết những gì đang diễn ra.", "eng": "Her burning curiosity to know what's going on."}, {"viet": "Cái vay bị sai khớp của cô ấy được nắn lại cẩn thận vào chỗ.", "eng": "Her dislocated shoulder was carefully manipulated back into place."}, {"viet": "Rõ ràng là cô ta phù hợp với công việc đó.", "eng": "Her fitness for the job cannot be questioned."}, {"viet": "Cô ấy bị ốm nên không làm việc được mấy tuần lễ.", "eng": "Her illness kept her away from work for several weeks."}, {"viet": "Tâm trí cô ấy đang bị dao động.", "eng": "Her mind was in a tumult."}, {"viet": "Buổi trình diễn của cô ta rất tệ trong các cuộc tranh tài.", "eng": "Her performance didn't rate very high in the competition."}, {"viet": "Quyển tiểu thuyết thứ hai của bà ta đã bị giới phê bình chỉ trích gay gắt.", "eng": "Her second novel was taken apart by the critics."}, {"viet": "Câu chuyện thương tâm của cô ấy đã làm cho tất cả chúng tôi xúc động sâu xa.", "eng": "Her tragic story touched us all deeply."}, {"viet": "Đơn xin phép đã được điền rồi đây.", "eng": "Here is the filled out application form."}, {"viet": "Tổ tiên ông ta xưa kia đã đến nước Anh để tị nạn.", "eng": "His ancestors had come to England as refugees."}, {"viet": "Đầu óc anh ta dường như đang hoạt động bình thường.", "eng": "His brain seems to be functioning normally."}, {"viet": "Lòng can đảm đã không còn trong con người anh ấy.", "eng": "His courage of mind deserted him."}, {"viet": "Mắt anh ta nhắm lại và hắn ta ngủ thiếp đi.", "eng": "His eyes shut and he fell asleep."}, {"viet": "Tương lai của anh ấy phụ thuộc vào thành công trong kỳ thi này.", "eng": "His future is contingent on success in this exam."}, {"viet": "Tính liêm chính của anh ta làm cho những người chủ anh mến.", "eng": "His integrity recommended him to his employers."}, {"viet": "Chúng tôi lúc nào cũng tưởng nhớ tới ông ấy.", "eng": "His memory will always remain with us."}, {"viet": "Cha mẹ anh ta không còn quyền lực thực sự đối với anh ta nữa.", "eng": "His parents no longer have any real influence over him."}, {"viet": "Kỷ lục của anh ta khó có ai vượt qua được.", "eng": "His record will take a lot of beating."}, {"viet": "Bài nói chuyện của ông ta không gì khác hơn là một thứ sữa pha loãng.", "eng": "His speech was nothing but milk and water."}, {"viet": "Điều anh ấy quan tâm nhất là hãy tự an ủi mình.", "eng": "His unique concern was his own comfort."}, {"viet": "Đi nhờ xe tải đến Luân Đôn.", "eng": "Hitch a ride to London on a lorry."}, {"viet": "Ngựa sẽ trở nên béo và lười nếu không được tập luyện.", "eng": "Horses get fat and lazy if they are not exercised."}, {"viet": "Làm sao có thể có chuyện mối thiện cảm giữa hai người như chính chúng ta lại phải chấm dứt ngày một ngày hai không khác gì một thứ tình cảm lãng mạn thoáng qua.", "eng": "How can it be that the sympathy between two people like ourselves should end from one day to another like a mere passade."}, {"viet": "Mẹ anh phản ứng lại với tin đó như thế nào?", "eng": "How did your mother react to the news?"}, {"viet": "Anh thật là hào phóng cho chúng tôi mượn ô tô.", "eng": "How generous of you to lend us your car."}, {"viet": "Bạn có bao nhiêu anh chị em?", "eng": "How many brothers and sisters do you have?"}, {"viet": "Bạn đã đến thăm Kamakura bao nhiêu lần?", "eng": "How many times have you visited Kamakura?"}, {"viet": "Gửi bằng máy bay mất bao nhiêu tiền?", "eng": "How much would it cost to send it airmail?"}, {"viet": "Những sinh vật giống người từ một hành tinh xa tít nào đó.", "eng": "Humanoids from some far-flung planet."}, {"viet": "Tôi muốn đăng kí 3 ghế trong buổi hòa nhạc tối nay.", "eng": "I'd like to book three seats for tonight's concert."}, {"viet": "Tôi sẽ yêu cầu Tessa khai mạc ( cuộc tranh luận ).", "eng": "I'll asked Tessa to kick off ( the discussion )."}, {"viet": "Tôi phải xét lại ý kiến của tôi về Tâm, xét cho cùng nó thực sự khôn ngoan.", "eng": "I'll have to revise my ideas about Tam, he's really quite clever after all."}, {"viet": "Tôi sẽ xem xét chuyện đó và cho anh biết vào ngày mai.", "eng": "I'll think about it and let you know tomorrow."}, {"viet": "Tôi đang đấu tranh với ông chủ đòi tăng lương.", "eng": "I'm battling with my employers for a pay-rise."}, {"viet": "Tôi sắp đi gặp thủ tướng đây-Sao?", "eng": "I'm going to meet the prime Minister-Oh yeah?"}, {"viet": "Tôi sẽ không đến đâu, và đó là dứt khoát!", "eng": "I'm not coming, and that's final!"}, {"viet": "Tôi thận trọng về việc mua cổ phần, vì e rằng mình mất tiền.", "eng": "I'm shy of buying shares, in case I lose money."}, {"viet": "Tôi chắc là huấn luyện viên sẽ cho anh ấy thi đấu.", "eng": "I'm sure the coach will play him at the games."}, {"viet": "Tôi lo lắng về sự an toàn của bọn trẻ.", "eng": "I'm worried about the safety of the children."}, {"viet": "Tôi đã làm việc ở đó được 5 năm.", "eng": "I've been working there for five years."}, {"viet": "Tôi nghe nói cô ta chơi tuyệt diệu song tôi chưa bao giờ được trông thấy cô chơi cả.", "eng": "I've heard she's a marvellous player but I've never seen her in action."}, {"viet": "Mình đã thấy những cái gọi là tranh của cô ta rồi, chúng rất xấu, mình có thể nói với cậu như vậy!", "eng": "I've seen her so-called paintings, they're fairly grim, I can tell you!"}, {"viet": "Cứ nghĩ đến anh ta là tôi nghĩ đến những chiếc xe chạy cực nhanh.", "eng": "I always associate him with fast cars."}, {"viet": "Tôi không được quyền chấp thuận việc trả tiền.", "eng": "I am not authorized to approve payments."}, {"viet": "Tôi bảo con nhỏ đó đi đánh răng, vậy mà nó cãi lại tôi.", "eng": "I asked her to go and brush her teeth and she just sassed me back."}, {"viet": "Tôi mua ngôi nhà đó chẳng qua là vì nó rộng lớn.", "eng": "I bought the house simply because it was large."}, {"viet": "Tôi không vào được-Tôi đã đánh mất cái chìa khoá chết tiệt ấy rồi!", "eng": "I can't get in-I've lost the perishing key!"}, {"viet": "Lúc này tôi không nhớ ra tên nó.", "eng": "I can't think of his name at the moment."}, {"viet": "Tôi ngửi thấy mùi ga-lò có mở không?", "eng": "I can smell gas-is the oven on?"}, {"viet": "Tôi không thể cởi dây giày của tôi.", "eng": "I can't undo my shoelaces."}, {"viet": "Tôi không nghe được từng lời từng chữ trong bài nói của ông ấy.", "eng": "I couldn't hear every word of his speech."}, {"viet": "Tôi muốn thử sử dụng vi tính lần đầu tiên.", "eng": "I'd like to try my hand at computing."}, {"viet": "Tôi đã không ngủ lấy được một lần trong suốt cuộc hành trình.", "eng": "I didn't sleep once during the entire course of the journey."}, {"viet": "Tôi không biết, anh làm tôi lúng túng đấy!", "eng": "I don't know, you've got me there!"}, {"viet": "Tôi chẳng cần phải nghe lý do lý trấu gì cả, tôi chỉ muốn biết chuyện gì đã xảy ra thôi.", "eng": "I don't need to hear all the whys and the wherefores, I just want to know what happened."}, {"viet": "Tôi không muốn là người tàn nhẫn', anh ta nói giọng cương quyết.", "eng": "I don't want to be unkind', he said in a firm voice."}, {"viet": "Tôi không thích mang ngân phiếu du lịch theo.", "eng": "I don't like to bring traveler's cheques with me."}, {"viet": "Tôi cực kỳ khó chịu cái lối ông ta nhìn chằm chằm vào tôi trong văn phòng.", "eng": "I extremely annoyed at the way he always stares at me in the office."}, {"viet": "Tôi cảm thấy hoàn toàn nản lòng vì nhận xét ác của anh.", "eng": "I felt quite deflated by your nasty remark."}, {"viet": "Tôi hiểu rõ tại sao anh đã làm điều đó.", "eng": "I fully realize why you did it."}, {"viet": "Tôi để mấy cái vé đó lẫn lộn và đã đưa anh vé của tôi.", "eng": "I got the tickets mixed up and gave you mine."}, {"viet": "Tôi không có cơ hội nào để thảo luận việc đó với bà ta.", "eng": "I had no opportunity to discuss it with her."}, {"viet": "Tôi có số dư trong tài khoản là 250 bảng Anh.", "eng": "I have a credit balance of £ 250."}, {"viet": "Tôi đã khao khát được gặp họ từ lâu.", "eng": "I have long desire to meet them."}, {"viet": "Tôi phải hủy bỏ việc đặt trước này.", "eng": "I have to cancel the reservation."}, {"viet": "Tôi không có việc gì cả.", "eng": "I haven't got a job."}, {"viet": "Tôi cho rằng các chính sách kinh tế của chính phủ là sai lầm.", "eng": "I hold that the government's economic policies are mistaken."}, {"viet": "Tôi hy vọng bạn sẽ đến thăm chúng tôi lần nữa.", "eng": "I hope you will visit us again."}, {"viet": "Tôi biết một nhà hàng Italia ngon, nó cũng không xa đây lắm.", "eng": "I know a good Italian restaurant, it's not far from here, either."}, {"viet": "Tôi thích đi đến hội chợ, nhưng chỗ đó lúc nào cũng chật ních người.", "eng": "I like going to the fair, but it is always packed."}, {"viet": "Tôi sẽ đi vào tuần sau nữa.", "eng": "I'll be leaving the week after next."}, {"viet": "Bác sẽ làm cho cháu một cái săn-uýt.", "eng": "I'll make you a sandwich."}, {"viet": "Tôi là người ủng hộ bạn hết mình.", "eng": "I'm a huge fan of yours."}, {"viet": "Tôi định đi xem phim hay làm gì đó.", "eng": "I'm going to see a movie or something."}, {"viet": "Tôi khẳng định là cô ấy thích bạn.", "eng": "I'm positive she likes you."}, {"viet": "Tôi nhìn thấy hai bóng người lờ mờ trong bóng tối.", "eng": "I made out two dim shapes in the gloom."}, {"viet": "Tôi phải liên lạc với các bạn cũ để xem bây giờ họ làm gì.", "eng": "I must get in touch with my old school friends to see what they are doing now."}, {"viet": "Tôi muốn biết giờ làm việc của quý vị vào thứ bảy này.", "eng": "I need to find out your hours for this Saturday."}, {"viet": "Tôi chỉ nghe thấy đoạn chót cuộc trò chuyện của họ.", "eng": "I only heard the tail-end of their conversation."}, {"viet": "Tôi đã mua chúng ở ngân hàng Hoàng Gia Canada.", "eng": "I purchased them at the Royal Bank of Canada."}, {"viet": "Tôi đoán cái đó giá khoảng 100 pao Chúng tôi tính là đến Delhi vào buổi trưa.", "eng": "I reckon it will cost about 100 pounds We reckon to arrive in Delhi at noon."}, {"viet": "Tôi đã nói là điều đó sẽ xảy ra và quả nhiên nó đã xảy ra.", "eng": "I said it would happen, and sure enough it did."}, {"viet": "Tôi sẽ luôn trân trọng gìn giữ kỉ niệm về các cuộc gặp gỡ của chúng ta.", "eng": "I shall always treasure the memory of our meetings."}, {"viet": "Tối qua tôi đã ngủ say như chết.", "eng": "I slept like a log last night."}, {"viet": "Tôi ủng hộ biện pháp này không chút dè dặt.", "eng": "I support this measure without reservation."}, {"viet": "Tôi nghĩ tôi nên tắm một cái.", "eng": "I think I'd like a bath."}, {"viet": "Tôi nghĩ ngày nay có quá nhiều phim bạo lực.", "eng": "I think there are too many violent movies these days."}, {"viet": "Tôi ném áo quần đi rồi lăn ra giường.", "eng": "I threw off my clothes and tumbled into bed."}, {"viet": "Tôi hiểu được con người thực của hắn khi tôi bắt gặp vài lá thư hắn viết cho Jane.", "eng": "I tumbled to him when I found some of his letters to Jane."}, {"viet": "Tôi lưu lại để xem chuyện gì đã xảy ra.", "eng": "I waited behind to see what had happened."}, {"viet": "Tôi muốn tìm ra một người bạn học cũ.", "eng": "I want to search out an old school friend."}, {"viet": "Tôi suýt bị ngã vì cơn gió bất ngờ thổi qua làm mất thăng bằng.", "eng": "I was caught off balance by the sudden wind and nearly fell."}, {"viet": "Tôi đến muộn vì tôi không tìm được chỗ xe đỗ nào còn trống.", "eng": "I was late because I couldn't find a free packing space."}, {"viet": "Tôi đã bị xét hỏi dông dài về tình trạng hôn nhân của tôi và khoản tiền dư trong ngân hàng.", "eng": "I was subjected to a lengthy inquisition into the state of my marriage, and the size of my bank balance."}, {"viet": "Tôi đến khách sạn mới theo sự tiến cử của anh.", "eng": "I went to the new hotel on your recommendation."}, {"viet": "Tôi ước gì chúng tôi có thêm một phòng.", "eng": "I wish we had a spare room."}, {"viet": "Tôi cứ thắc mắc không biết tại sao mình lại bị ướt!", "eng": "I wondered why I was getting wet!"}, {"viet": "Tôi muốn nhờ giặt thảm trước khi tôi dọn vào ở.", "eng": "I would like to have the carpet shampooed before I move in."}, {"viet": "Không, tôi chưa lúc nào ám chỉ như vậy cả.", "eng": "I wouldn't suggest such a thing for a moment."}, {"viet": "Nếu hắn đá tôi, tôi sẽ đá lại.", "eng": "If he kicks me, I'll kick him back."}, {"viet": "Nếu cuộc đàm phán thất bại, chúng ta vẫn còn một lá bài khác để chơi.", "eng": "If negotiation fails, we still have another card to play."}, {"viet": "Nếu điều này không được giải quyết một cách hợp lí thì có thể cần thiết phải dùng đến sức mạnh.", "eng": "If this can't be settled reasonably, it may be necessary to have resort to force."}, {"viet": "Nếu bạn dưới 26 tuổi, bạn có thể mua vé xe lửa rẻ.", "eng": "If you are under 26 you can buy cheap rail tickets."}, {"viet": "Nếu có dịp đến thăm Luân đôn, anh phải đến ở với chúng tôi đấy.", "eng": "If you ever visit London, you must come and stay with us."}, {"viet": "Nếu bạn nói được tiếng Anh, dường như bạn sẽ thiên về sự nghiệp đó.", "eng": "If you speak English, you will seem career-oriented."}, {"viet": "Anh hãy tưởng tượng anh giàu có và nổi tiếng.", "eng": "Imagine yourself to be rich and famous."}, {"viet": "Trong trường hợp ho lao, người ta khạc ra máu.", "eng": "In cases of tuberculosis blood is expectorated."}, {"viet": "Trong sách đó ghi lại tất cả những lời giảng dạy của đức Chúa mà các tín đồ Cơ Đốc cố tuân theo.", "eng": "In it are the teachings of Christ which Christians try to follow."}, {"viet": "Mặc dù bị nhiều thất bại, họ vẫn còn nhiều ý chí chiến đấu.", "eng": "In spite of many defeats, they still had plenty of fight left in them."}, {"viet": "Trong bức tranh, cây là biểu tượng của cuộc sống và con rắn là biểu tượng của cái ác.", "eng": "In the picture, the tree is the symbol of life and the snake is the symbol of evil."}, {"viet": "Trong cả cuộc đời của anh, hẳn anh đã thấy nhiều thay đổi.", "eng": "In your lifetime you must have seen many changes."}, {"viet": "Ở nước bạn, trình độ học vấn có quan trọng không?", "eng": "Is educational background important in your country?"}, {"viet": "Có thể có được thông tin trên máy tính không?", "eng": "Is the information available on the computer?"}, {"viet": "Đây có phải là nhà của gia đình ông Brown?", "eng": "Is this the Brown's residence?"}, {"viet": "Đó là một lỗi mà hầu như lúc nào họ cũng mắc.", "eng": "It's a mistake they almost always make."}, {"viet": "Tôi không hiểu được vì sao cô ấy lại muốn lấy John.", "eng": "It's beyond me why she wants to marry John."}, {"viet": "Thật khó khăn để tự thích nghi lại với cuộc sống ở Anh sau khi đã làm việc ở nước ngoài.", "eng": "It's hard to readjust to life in Britain after working abroad."}, {"viet": "Cảm thấy mệt mỏi sau khi làm việc căng thẳng là chuyện bình thường.", "eng": "It's normal to feel tired after working so hard."}, {"viet": "Rất buồn là họ đã li dị, song họ không thể sống chung với nhau hơn được nữa.", "eng": "It's sad that they got divorced but they had reached the end of the line together."}, {"viet": "Giặt áo quần trắng với quần áo màu là dại dột.", "eng": "It's unwise to wash whites with coloureds."}, {"viet": "Cứ suy nghĩ liên miên về sai lầm của mình chẳng có ích gì cả.", "eng": "It doesn't help to brood on your mistakes."}, {"viet": "Cái đó vượt quá phạm vi hiểu biết của con người.", "eng": "It is beyond the bound of human knowledge."}, {"viet": "Còn chưa rõ ai sẽ phụ trách chính sách ngoại giao trong tân chính phủ.", "eng": "It is not yet clear who will be in charge of foreign policy in the new government."}, {"viet": "Trông như thể cô ấy đã giảm được một trăm cân anh đấy!", "eng": "It looks like she lost a hundred pounds!"}, {"viet": "Nó dọc theo bức tường đằng kia.", "eng": "It's along the wall over there."}, {"viet": "Rất vui vì cháu đã đến đây.", "eng": "It's very nice to have you here."}, {"viet": "Việc đó bứt anh ta hoàn toàn ra khỏi giới của mình.", "eng": "It took him completely out of his sphere."}, {"viet": "Tôi thấy càng ngày càng trở nên rõ ràng là anh ta không thích tôi.", "eng": "It was becoming increasingly apparent to me that he disliked me."}, {"viet": "Đã xảy ra tình trạng hoảng hốt khi cảnh sát đến lục soát toà nhà.", "eng": "It was panic stations when the police arrived to search the building."}, {"viet": "Sẽ khó mà vượt qua được số điểm rất cao này.", "eng": "It will be hard to surpass this very high score."}, {"viet": "Jackie đã vượt qua bài kiểm tra lái xe của cô ấy.", "eng": "Jackie's passed her driving test."}, {"viet": "John là người chắc chắn phải được mời.", "eng": "John is one who must certainly be invited."}, {"viet": "Công lý là một yếu tố quan trọng của việc cai trị tốt.", "eng": "Justice is an important element of good government."}, {"viet": "Những cuộc đàm phán rất dài sẽ diễn ra trước khi đạt được một thoả thuận nào.", "eng": "Lengthy negotiations must take place before any agreement can be reached."}, {"viet": "Chúng ta hãy xem thực đơn đi.", "eng": "Let's have a look at the menu."}, {"viet": "Nhiều doanh nghiệp đã phải đóng cửa vì suy thoái.", "eng": "Many businesses have closed down because of the recession."}, {"viet": "Nhiều môn thể thao thu hút đông khán giả nay đã được truyền hình.", "eng": "Many spectator sports are now televised."}, {"viet": "Bác Freeman, cháu có thể hỏi bác một câu được không?", "eng": "May I ask you a question, Mr. Freeman?"}, {"viet": "Có lẽ là do vi-rút máy vi tính.", "eng": "Maybe it's because of a computer virus."}, {"viet": "Hầu hết các công trình xây dựng trong thị trấn này đều khá tẻ nhạt, song toà nhà thờ này là một ngoại lệ.", "eng": "Most of the buildings in this town are rather unattractive, but this church is an exception."}, {"viet": "Bà Hill rất thiết tha về việc Tôm lấy Susan.", "eng": "Mrs Hill is keen on Tom's marrying Susan."}, {"viet": "Con cái tôi có quyền trước tiên đối với thời giờ của tôi.", "eng": "My children have a prior claim on my time."}, {"viet": "Túi xách của tôi nằm trên ghế.", "eng": "My handbag was on a chair."}, {"viet": "Cuối tuần ba mẹ vợ của tôi sẽ đến thăm chúng tôi.", "eng": "My parents in-law will be visiting us this weekend."}, {"viet": "Những lời của tôi phải làm nó hết sức khó chịu.", "eng": "My words must be gall and worm wood to him."}, {"viet": "Báo chí chạy theo thị hiếu của công chúng về những chuyện bê bối.", "eng": "Newspapers pandering to the public love of scandal."}, {"viet": "Không, anh vẫn có thể mang nó được mà.", "eng": "No, you can still wear it."}, {"viet": "Không có nhiều phụ nữ muốn làm công việc xây dựng.", "eng": "Not many women want to work in construction."}, {"viet": "Số lớn những người tẻ nhạt tụ tập lại quanh cô ta.", "eng": "Numbers of dull people conglomerated round her."}, {"viet": "Ồ, ông chủ bảo tôi luôn đi làm trễ.", "eng": "Oh, the boss told me that I'm always late for work."}, {"viet": "Ở phần lớn các trại ở Anh, anh sẽ chỉ thấy có ba thứ động vật tức là cừu, bò và lợn.", "eng": "On most English farms, you'll find only three kinds of animal viz sheep, cattle and pigs."}, {"viet": "Người ta thích nghe những lời khen dáng vẻ của mình.", "eng": "One likes to hear compliments on one's appearance."}, {"viet": "Hay vì đến giờ đi ngủ?", "eng": "Or because it's bed time?"}, {"viet": "Giờ bay của chúng ta sẽ khoảng một tiếng và chúng ta sẽ lên đến độ cao 8000 bộ và bay với vận tốc 260 dặm một giờ.", "eng": "Our flight time will be ap-proximately one hour and we shall be climbing to an alti-tude of 8,000 fett and cruising at a speed of 260 miles per hour."}, {"viet": "Đảng của chúng ta có lực lượng ủng hộ lớn ở miền Nam.", "eng": "Our party has a large following in the south."}, {"viet": "Ngoài giờ làm việc bình thường, xin hãy liên hệ với tôi tại nhà.", "eng": "Outwith normal working hours, please contact me at home."}, {"viet": "Paul không muốn đi học tốt nghiệp ở trường, nhưng có lẽ nó nên đi.", "eng": "Paul doesn't to do graduate school, but maybe he should."}, {"viet": "Những người nói rằng chúng ta sẽ lên mặt trăng đã từng bị gọi là những kẻ mơ mộng hão huyền.", "eng": "People who said we would go to the moon used to be called dreamers."}, {"viet": "Vui lòng nhắn với Smith là Brown mời ông ấy đi ăn tối tại nhà hàng Đông Lai Thuận.", "eng": "Please tell Smith that Brown invites him to dinner at the Donglaishun Restaurant."}, {"viet": "Tôn giáo đã có ảnh hưởng suốt đời đối với cuộc sống của cô ấy.", "eng": "Religion has been an influence for good in her life."}, {"viet": "Xin ai tha lỗi về điều gì.", "eng": "Seek somebody's pardon for something."}, {"viet": "Cô ta chẳng bao giờ nghĩ tới việc ép người khác để cho cô ta cùng đi.", "eng": "She'd never think of imposing herself."}, {"viet": "Cô ta mời anh ta đến dự tiệc.", "eng": "She's asked him to come to the party."}, {"viet": "Cô ta rất sành việc mua quà biếu tặng sinh nhật.", "eng": "She's got the business of buying birthday presents down to a fine art."}, {"viet": "Cô bé mới có 5 tuổi-nó chưa biết xem giờ đâu.", "eng": "She's only five-she can't tell the time yet."}, {"viet": "Cô ấy rất phung phí-cô ấy tiêu quá nhiều tiền vào quần áo.", "eng": "She's very extravagant-she spends all her money on clothes."}, {"viet": "Cô ấy bảo tôi đưa cô ấy đi nhà thờ.", "eng": "She asked me to accomapany her to the church."}, {"viet": "Cô ta sửa lại cẩn thận quần áo và đầu tóc trước khi đi ra ngoài.", "eng": "She carefully adjusted her clothes and her hair before going out."}, {"viet": "Cô ấy đã khum bàn tay quanh miệng và gọi to.", "eng": "She cupped her hands round her mouth and shout."}, {"viet": "Cô ta nhào xuống nước rồi trồi lên sặc sụa và thổi phì phì.", "eng": "She dived into the water and came up coughing and spluttering."}, {"viet": "Cô ấy cảm thấy sạch hết tội lỗi của cô ta sau khi xưng tội.", "eng": "She felt cleansed of her sins after confession."}, {"viet": "Bà ta hơ ấm chăn bên lò sưởi trước khi trải lên giường.", "eng": "She gave the sheets a warm by the fire before putting them on the bed."}, {"viet": "Cô ta quen sống với lối sống giàu có.", "eng": "She had been used to an affluent lifestyle."}, {"viet": "Cô ấy luôn luôn dễ chịu.", "eng": "She has always been easy to get along with."}, {"viet": "Cô ta chưa có đủ kinh nghiệm cần thiết cho công việc đó.", "eng": "She hasn't the experience necessary for the job."}, {"viet": "Cô ấy thông thạo 5 thứ tiếng.", "eng": "She is fluent in five languages."}, {"viet": "Bà ấy chăm lo tất cả con cái mình như nâng trứng.", "eng": "She keeps all her children wrapped up in cotton wool."}, {"viet": "Cô ấy rất trông đợi anh ta mời mình khiêu vũ.", "eng": "She longed for him to ask her to dance."}, {"viet": "Bà ta xăm xăm bước vào và yêu cầu người ta phải xin lỗi.", "eng": "She marched in and demanded an apology."}, {"viet": "Bà ấy đã nộp tiền theo đơn đòi bồi thường để an ủi lương tâm mình.", "eng": "She paid repair bill as a salve to her conscience."}, {"viet": "Cô ta căn vặn anh ta suốt đêm về những người mà anh ta đã gặp.", "eng": "She quizzed him all night about the people he'd seen."}, {"viet": "Cô ta là một người thực sự độc đáo!", "eng": "She's a real a character!"}, {"viet": "Cô ấy chơi quần vợt rất hay.", "eng": "She's no slouch at tennis."}, {"viet": "Cô ta ngồi cố gắng tập trung suy nghĩ trước khi phát biểu ý kiến.", "eng": "She sat trying to gather her thoughts before making her speech."}, {"viet": "Cô ấy tỏ ra có sức chịu đựng rất lớn trong suất thời gian đau yếu cuối đời của người chồng.", "eng": "She showed great stoicism during her husband's final illness."}, {"viet": "Cô ấy nén chặt quần áo vào vali.", "eng": "She squashed her clothes down into the suitcase."}, {"viet": "Bà ấy làm chủ toạ tất cả các cuộc họp của chúng tôi.", "eng": "She takes the chair in all our meetings."}, {"viet": "Cô ta cố dành ra mỗi ngày hai tiếng đồng hồ để học tiếng Anh.", "eng": "She tries to set aside two hours each day to study English."}, {"viet": "Cô ta khuyên chúng nên cẩn thận.", "eng": "She warned them to be careful."}, {"viet": "Cô ta đã bị bắt khi đang ăn cắp đồ son phấn ở siêu thị.", "eng": "She was caught lifting make-up from the supermarket."}, {"viet": "Cô ta sung sướng, yên tâm khi biết rằng gia đình mình yêu thương và tôn trọng mình.", "eng": "She was happy, secure in the knowledge that her family loved and respected her."}, {"viet": "Cô ta đã được chọn trong số hàng ngàn người nộp đơn xin chỗ làm đó.", "eng": "She was picked out from thousands of applicants for the job."}, {"viet": "Cô ấy đổ mồ hôi khi cô ấy lên tới đỉnh đồi.", "eng": "She was sweating as she reached the top of the hill."}, {"viet": "Cô ta theo dõi lũ trẻ đi ngang qua đường.", "eng": "She watched the children cross the road."}, {"viet": "Cô ấy sẽ không phải gánh chịu tất cả trách nhiệm đối với sai lầm đó.", "eng": "She won't shoulder all the blame for the mistake."}, {"viet": "Cô ta không chống lại được sự cám dỗ và ăn thêm một cái sôcôla nữa.", "eng": "She yielded to temptation and had another chocolate."}, {"viet": "Đóng cửa lại-có một ngọn gió lùa cực mạnh ở đây!", "eng": "Shut the door-there's a howling draught in here!"}, {"viet": "Đào một đường hầm vào trong sườn núi.", "eng": "Sink a tunnel into the side of the mountain."}, {"viet": "Những nhà đầu tư nhỏ mua những trái phiếu mới phát hành bị lỗ nặng.", "eng": "Small investors who latched on to hot new issues took a bath."}, {"viet": "Vì vậy, nếu bạn đến New York, đến thăm Broadway sẽ là phần hấp dẫn nhất trong chương trình ở thành phố của bạn.", "eng": "So if you go to New York, your visit to Broadway will be the highlights of your programme in the city."}, {"viet": "Một vài loại axít làm thủng gỗ.", "eng": "Some acids burn holes in wood."}, {"viet": "Vài chỗ tráng men trên chiếc xoong này bị bong ra.", "eng": "Some of the enamel on this pan is chipped off."}, {"viet": "Một số giáo viên thấy rằng khó mà có thể giữ được trật tự trong lớp của họ.", "eng": "Some teachers find it difficult to keep their classes in order."}, {"viet": "Hãng SONY sẽ phát một đài giải trí mới.", "eng": "SONY will come out with a new play staion."}, {"viet": "Qua một buổi tối với nhóm bạn bè của mình.", "eng": "Spend an evening in the society of one's friends."}, {"viet": "Ngủ qua đêm ở nhà một người bạn.", "eng": "Stay overnight at a friend's house."}, {"viet": "Đừng có uốn éo trước gương nữa mà nghe tôi nói đây!", "eng": "Stop posturing in front of that mirror and listen to me!"}, {"viet": "Nộp một bài luận cho thầy giáo dạy kèm của mình.", "eng": "Submit an essay to one's tutor."}, {"viet": "Sue đã qua nhà dì Mathilda để chuyện vãn, vì bà là người mà cô có thể bộc bạch tâm sự.", "eng": "Sue has gone to aunt Mathilda for a chat, she is her security blanket."}, {"viet": "Các cuộc điều tra cho thấy 75% dân chúng tán thành đạo luật mới.", "eng": "Surveys show that 75% of people approve of the new law."}, {"viet": "Theo lời khuyên đó với sự dè dặt.", "eng": "Take that advice with a grain of salt."}, {"viet": "Về phương diện kỹ thuật, cả hai đấu thủ có cùng trình độ.", "eng": "Technically, both players are on a level."}, {"viet": "Cám ơn ông, tôi không thể nào ăn thêm được nữa.", "eng": "Thank you, I couldn't possibly eat many more."}, {"viet": "Thật là một điều khủng khiếp khi anh nổi điên lên, Không ai biết được những điều ghê gớm nào đang diễn ra trong đầu anh.", "eng": "That's the horrible thing when you're bananas, Nobody can know the awful things that are going on in your head."}, {"viet": "Chắc con chó kia bị thương-nó đi khập khiễng kìa.", "eng": "That dog must be hurt-he's limping."}, {"viet": "Người đàn ông đó làm tôi nhớ đến Charlie Chaplin.", "eng": "That man reminds me of Charlie Chaplin."}, {"viet": "Như vậy là quá quắt rồi!", "eng": "That's just about the limit!"}, {"viet": "Thật là một cú sốc-tôi cần một ly rượu mạnh! một ly rượu rum không pha.", "eng": "That was a shock-I need a stiff drink! a stiff glass of rum."}, {"viet": "Tai nạn đó là một chuyện cô ấy sẽ không bao giờ có thể quên được.", "eng": "The accident was an experience she will never forget."}, {"viet": "Vụ này đặt ra những vấn đề rộng lớn hơn về lợi ích quốc gia.", "eng": "The affair raises wider issues of national interest."}, {"viet": "Người câu cá từ từ cuộn dây kéo con cá hồi vào.", "eng": "The angler reeled the trout in slowly."}, {"viet": "Mã số vùng là 45, và số điện thoại là 241-5280.", "eng": "The area code is 45, and the number is 241-5280."}, {"viet": "Các nhà du hành vũ trụ lái con tàu đổ bộ xuống bề mặt của mặt trăng.", "eng": "The astronauts piloted their craft to the lunar surface."}, {"viet": "Cân nặng trung bình của đàn ông Nhật đang tăng dần.", "eng": "The average weight for men in Japan is increasing."}, {"viet": "Quả bóng xẹp xuống từ từ khi hơi bị xì ra.", "eng": "The balloon descended gradually as the air came out."}, {"viet": "Trận đánh thắng với cái giá của nhiều sinh mạng.", "eng": "The battle was won at a great cost in human lives."}, {"viet": "Đạo Luật Nhân Quyền, bộ phận bảo vệ các quyền tự do của công dân.", "eng": "The Bill of Rights, palladium of civil liberties."}, {"viet": "Con thuyền bập bềnh lên xuống trên mặt nước.", "eng": "The boat bobbed up and down on the water."}, {"viet": "Cuốn sách đó vọt lên hàng đầu danh mục các sách bán chạy nhất.", "eng": "The book rocketed to the top of the bestseller list."}, {"viet": "Cậu đó thì mỉm cười nhưng cô đó có vẻ tức giận.", "eng": "The boy was smiling but the girl looked angry."}, {"viet": "Nét đại cương của một kế hoạch, đề nghị, v. v.", "eng": "The broad outline of a plan, proposal, etc."}, {"viet": "Chiếc xe buýt ì ạch leo lên đồi dốc.", "eng": "The bus toiled up the steep hill."}, {"viet": "Bọn phiến loạn bị bắt tống vào ngục.", "eng": "The captured rebels were consigned to the dungeons."}, {"viet": "Chiếc xe quay ngoắt qua đường và đâm vào cây.", "eng": "The car veered across the road and hit a tree."}, {"viet": "Con mèo kéo lê cái chân bị gãy của nó.", "eng": "The cat was dragging its broken leg."}, {"viet": "Những thay đổi đó trong một chừng mực nào đấy là một sự cải thiện.", "eng": "The changes are an improvement in one way."}, {"viet": "Đứa bé đó không hề bẽn lẽn với người lớn.", "eng": "The child isn't at all shy with adults."}, {"viet": "Bọn trẻ lại giở trò tinh nghịch gì đấy, tôi tin chắc là như vậy!", "eng": "The children are up to some mischief, I'll be bound!"}, {"viet": "Bọn trẻ tự nguyện đi ngủ vì chúng quá mệt.", "eng": "The children went to bed of their own accord, because they were so tired."}, {"viet": "Tình huống không thuận lợi cho sự khuếch trương xa hơn của công ti.", "eng": "The circumstances were not propitious for further expansion of the company."}, {"viet": "Việc đóng cửa nhà máy đã đánh một đòn chí mạng vào thị trấn này.", "eng": "The closure of the factory dealt a lethal blow to the town."}, {"viet": "Trường cao đẳng đó không hơn gì một cái lò sản xuất bằng cấp.", "eng": "The college was nothing more than a diploma mill."}, {"viet": "Giám đốc công ty tiến hành một sự thay đổi toàn diện và đã thay thế toàn bộ ban điều hành.", "eng": "The company chairman has made a clean sweep and replaced his entire management team."}, {"viet": "Tình trạng tê liệt của ngành công nghiệp do cuộc đình công của những người thợ điện gây ra.", "eng": "The complete paralysis of industry caused by the electricians'strike."}, {"viet": "Phương pháp giảng nghĩa một từ trong một ngữ cảnh.", "eng": "The contextual method of showing the meaning of a word."}, {"viet": "Hãng nhập khẩu thuốc lá sợi lớn nhất nước.", "eng": "The country's largest importer of tobacco."}, {"viet": "Toà án đã công nhận lời của ông ta rằng bản hợp đồng là hợp pháp.", "eng": "The court sustained his claim that the contract was legal."}, {"viet": "Đám đông hốt hoảng khi nghe tiếng súng nổ.", "eng": "The crowd panicked at the sound of guns."}, {"viet": "Vết cắt đó mau lành nhưng nó để lại một cái sẹo.", "eng": "The cut soon healed up but it left a scar."}, {"viet": "Quyết định đó đã khiến cho tác giả hoảng hốt này trở thành một nhân vật trọng tâm của một sự kiện hấp dẫn.", "eng": "The decision turned the startled author into a media event."}, {"viet": "Thiết kế của toà nhà này được mô phỏng theo các hình dáng Hy Lạp cổ điển.", "eng": "The design of the building is modelled on classical Greek forms."}, {"viet": "Các phong cảnh hai bên đường đơn điệu đến phát chán.", "eng": "The disagreeable oneness of roadside landscapes."}, {"viet": "Bác sĩ đã tiêm cho bà ta một mũi để giảm đau.", "eng": "The doctor gave her an injection to alleviate the pain."}, {"viet": "Con chó lao nhanh xuống đường đuổi theo con mèo.", "eng": "The dog flew down the road after the cat."}, {"viet": "Chim bồ câu là một biểu tượng hòa bình.", "eng": "The dove is an emblem of peace."}, {"viet": "Con cừu con sắp chết ngã xuống, bốn chân cựa quậy tuyệt vọng.", "eng": "The dying lamb fell, its legs flailing helplessly."}, {"viet": "Dòng điện thay đổi không theo kịp điện thế.", "eng": "The electric current lags behind the voltage."}, {"viet": "Xí nghiệp bị suy sụp vì thiếu sự giúp đỡ.", "eng": "The enterprise collapsed through lack of support."}, {"viet": "Việc trao đổi tù binh trong lúc chiến tranh là chuyện lạ lùng.", "eng": "The exchange of prisoners during a war is unusual."}, {"viet": "Việc mình không thích cô vợ chưa cưới của cậu có quan trọng gì đâu-vấn đề là ở chỗ cậu cảm thấy thế nào.", "eng": "The fact that I don't like your fiancé is neither here nor there-what matters is what you feel."}, {"viet": "Người cha để lại tài sản cho đứa con trai.", "eng": "The father passed on the family's wealth to his son."}, {"viet": "Bộ phim vừa vui lại vừa cảm động.", "eng": "The film is at once humorous and moving."}, {"viet": "Thanh danh của công ty đã bị nhơ nhuốc nặng vì vụ bê bối đó.", "eng": "The firm's good name was badly tarnished by the scandal."}, {"viet": "Vấn đề thứ nhất đã được giải quyết.", "eng": "The first question has been disposed of."}, {"viet": "Phần tiếp theo là những trích đoạn từ một bài báo gốc.", "eng": "The following are extracts from the original article."}, {"viet": "Sự thông cảm tự nhiên giữa các phóng viên truyền hình, các nhà nhiếp ảnh chuyên nghiệp, v. v.", "eng": "The freemasonry of TV reporters, professional photographers, etc."}, {"viet": "Tên cướp lấy trộm một khẩu súng và bắn mở đường chạy ra khỏi trại giam.", "eng": "The gangster stole a gun and shot his way in prison."}, {"viet": "Hình thù ma quái của con tàu.", "eng": "The ghostliness of the ship's outline."}, {"viet": "Sự thiếu kiên nhẫn ngày càng tăng của chính phủ đối với các công đoàn.", "eng": "The government's growing impatience with the unions."}, {"viet": "Chính phủ ỉm đi chuyện đó để khỏi bị công chúng công kích.", "eng": "The government hushed the affair up to avoid a public outcry."}, {"viet": "Chính phủ sẽ chẳng bao giờ dám tăng thuế sớm như vậy trước cuộc bầu cử.", "eng": "The government would never dare increase taxes so soon before the election."}, {"viet": "Sau vụ hạn, đất rắn như đá.", "eng": "The ground is as hard as stone after the drought."}, {"viet": "Nòng súng có một góc nâng lên 45 độ.", "eng": "The gun has an elevation of 45 degree."}, {"viet": "Những cánh cửa thép nặng nề xem khinh những cố gắng của chúng tôi để mở chúng ra.", "eng": "The heavy steel doors mocked our attempts to open them."}, {"viet": "Con ngựa chồm lên vì khiếp sợ.", "eng": "The horse reared up in fright."}, {"viet": "Ngôi nhà có tất cả những tiện nghi hiện đại.", "eng": "The house has all the modern conveniences."}, {"viet": "Lễ kỷ niệm lần thứ một trăm ngày mất của nhà soạn nhạc.", "eng": "The hundredth anniversary of the composer's death."}, {"viet": "Sự việc xảy ra làm sống lại những hồi ức về các đau khổ đã qua của nó.", "eng": "The incident woke memories of his past sufferings."}, {"viet": "Các chỉ dẫn đó không thể hiểu được dễ dàng.", "eng": "The instructions were not easily understandable."}, {"viet": "Chiếc phản lực cơ bay vút thấp ngay trên đầu chúng tôi.", "eng": "The jet zoomed low over our heads."}, {"viet": "Bội thẩm đoàn tuyên án bị cáo vô tội.", "eng": "The jury found for the defendant."}, {"viet": "Lake District là một vùng rất thơ mộng.", "eng": "The Lake District is a very romantic area."}, {"viet": "Luật pháp không còn hiệu lực nữa.", "eng": "The law is no longer effective."}, {"viet": "Lá thư gửi nhầm đến tay ông.", "eng": "The letter was sent to you in error."}, {"viet": "Cô gái nhỏ đó sống ở miền quê.", "eng": "The little girl lived in the country."}, {"viet": "Quãng âm thấp của kèn clarinét, giọng nam cao, v. v.", "eng": "The lower register of a clarinet, tenor, etc."}, {"viet": "Loài động vật hữu nhũ đầu tiên xuất hiện vào Thời kỳ của loài bò sát và chúng có thể ăn trứng của khủng long.", "eng": "The mammals first appeared in the Age of Reptiles and they may have eaten dinosaur eggs."}, {"viet": "Trận đấu kết thúc hòa 2-2.", "eng": "The match ended in a draw 2-2."}, {"viet": "Cuộc gặp gỡ đúng là một bước ngoặt trong cuộc đời của cô ta.", "eng": "The meeting proved to be a turning-point in her life."}, {"viet": "Thợ mỏ đã tiếp tục bãi công suốt cả một năm.", "eng": "The miners stayed out for a whole year."}, {"viet": "Tiền tôi kiếm được từ việc dạy pianô là một một phần bổ sung hữu dụng cho thu nhập bình thường của tôi.", "eng": "The money I get from teaching the piano is a useful supplement to my ordinary income."}, {"viet": "Kiến nghị được đưa ra hội nghị.", "eng": "The motion was put to the assembly."}, {"viet": "Tên tuổi của Mozart gắn liền với thành phố Salzburg.", "eng": "The name of Mozart is coupled with the city of Salzburg."}, {"viet": "Chủ nghĩa bảo thủ mới trong giới trẻ.", "eng": "The new conformism among the young."}, {"viet": "Đường chạy đua mới có chiều dài gần 6 dặm.", "eng": "The new race track is nearly six miles in extent."}, {"viet": "Tin tức đó được đón nhận thiếu nhiệt tình trong Thành phố.", "eng": "The news was greeted with lack of enthusiasm in the City."}, {"viet": "Tờ cáo thị này được viết hết sức lủng củng.", "eng": "The notice is most unfortunately phrased."}, {"viet": "Đại dương thì trong xanh như lục ngọc.", "eng": "The ocean was crystal clear emerald green."}, {"viet": "Mặt cụ già đầy những nét hằn và nếp nhăn.", "eng": "The old man's face was covered in lines and wrinkles."}, {"viet": "Phương pháp ngược lại là sử dụng từ điển song ngữ.", "eng": "The opposite approach is to use a bilingual dictionary."}, {"viet": "Cơn đau sẽ dần dần tan biến.", "eng": "The pain is slowly wearing off."}, {"viet": "Bữa tiệc không bao giờ đạt được mức cần thiết để tạo phản ứng, mọi người ngồi trông không có vẻ thoải mái suốt cả buổi tối.", "eng": "The party never reached the critical mass, everyone sat around the whole evening looking uncomfortable."}, {"viet": "Cảnh hoàng hôn yên tịnh làm giảm đi tâm trạng chán chường của nàng.", "eng": "The peaceful sunset gentled her dreadful mood."}, {"viet": "Cái tay ăn bánh như ma ấy lại đã đến đây rồi!", "eng": "The phantom cake-eater has been here again!"}, {"viet": "Cây thông, cây tuyết tùng và cây vân sam là những loại cây xanh bốn mùa.", "eng": "The pine, cedar and spruce are evergreens."}, {"viet": "Các kế hoạch về một nhà hát mới đã phải gác lại vì thiếu kinh phí.", "eng": "The plans for a new theatre have had to be shelved because of lack of money."}, {"viet": "Hân hạnh này là của tôi, bà Anderson.", "eng": "The pleasure is all mine, Mrs. Anderson."}, {"viet": "Cảnh sát dùng vũ lực để mở cửa.", "eng": "The police employed force to open the door."}, {"viet": "Cảnh sát bám sát nghi phạm trong ba ngày.", "eng": "The police shadowed the suspect for three days."}, {"viet": "Ngôi sao nhạc pop đó được một đoàn người hâm mộ theo sau.", "eng": "The pop star was followed by a train of admirers."}, {"viet": "Tâm trạng nổi bật của các nhà chính trị là một tâm trạng thất vọng.", "eng": "The predominant mood among policy makers is one of despair."}, {"viet": "Tổng thống đã bị buộc phải từ chức.", "eng": "The president was forced into resigning."}, {"viet": "Vị thủ tướng đó chỉ là một công cụ trong tay tổng thống của nước đó.", "eng": "The prime minister was a mere tool in the hands of the country's president."}, {"viet": "Vấn đề là tìm được một nơi thích hợp, địa điểm tốt.", "eng": "The problem was finding a site that was well located, appropriately zoned and buildable."}, {"viet": "Lời đề nghị không gây được nhiều quan tâm trong nhóm.", "eng": "The proposal aroused little enthusiasm in the group."}, {"viet": "Tác giả được coi như là của chuyện đó.", "eng": "The purported author of the story."}, {"viet": "Chất phóng xạ được đóng vào một thùng chứa đặc biệt chống nhiễm phóng xạ.", "eng": "The radioactive material is stored in special radiation-proof container."}, {"viet": "Bọn phiến loạn buộc phải đầu hàng.", "eng": "The rebels were forced to give in."}, {"viet": "Việc sửa chữa lại nhà trường sẽ do bộ giáo dục cấp tiền.", "eng": "The repairs to the school will be financed by the education department."}, {"viet": "Kết quả của hàng năm lao động đã tiêu ma.", "eng": "The results of years of work went down the drain."}, {"viet": "Con sông này bất ngờ cạn đi ở đây từ 8 xuống còn 12 feet.", "eng": "The river shoals suddenly here from eight to two fathoms."}, {"viet": "Mái nhà sẽ cần phải chống đỡ khi tiến hành sửa chữa.", "eng": "The roof will have to be propped up while repairs are carried out."}, {"viet": "Những người chạy đã đứng vào vị trí ở vạch xuất phát.", "eng": "The runners got into position on the starting line."}, {"viet": "Vụ xì căng đan này rồi sẽ chóng qua đi.", "eng": "The scandal will soon blow over."}, {"viet": "Biển cách xa khách sạn 2 dặm.", "eng": "The sea is 2 miles away from the hotel."}, {"viet": "Tình trạng sống chen chúc nghiêm trọng trong những khu vực nghèo nàn của thành phố.", "eng": "The serious overcrowding in the poorer areas of the city."}, {"viet": "Chiếc tàu chìm cách mũi Horn một khoảng.", "eng": "The ship sank off Cape Horn."}, {"viet": "Tiếng la hét của đám đông làm anh ta quên mất điều anh ta định nói.", "eng": "The shouts of the crowd flustered the speaker and he forgot what he was going to say."}, {"viet": "Tình huống thật đáng sợ, nhưng cứ tiếp tục bàn luận về nó thì chỉ làm cho nó bi đát hơn.", "eng": "The situation is frightful, but it's just piling on the agony to keep discussing it."}, {"viet": "Cơn bão tuyết đó đã làm cuộc họp hàng tuần của họ không thành.", "eng": "The snowstorm ruled out their weekly meeting."}, {"viet": "Phần hiệu ứng âm thanh đã được thâu trước và được thêm đoạn đối thoại.", "eng": "The sound effects had been prerecorded and were added to the dialogue."}, {"viet": "Vẻ rực rỡ của những cửa sổ kính màu.", "eng": "The splendour of the stained glass window."}, {"viet": "Công nghiệp thép là một trong những ngành dùng nhiều than nhất ở Anh quốc.", "eng": "The steel industry is one of Britain's greatest users of coal."}, {"viet": "Sự gắn bó thật sự với tôn giáo của họ.", "eng": "The strict adherence to their riligion."}, {"viet": "Nghỉ hè cho chúng ta một thời gian xả hơi thú vị.", "eng": "The summer holidays gave us a welcome breathing-space."}, {"viet": "Những toà nhà cao nhất ở London lại là nhỏ khi so sánh với các toà nhà ở New York.", "eng": "The tallest buildings in London are small in comparison with those in New York."}, {"viet": "Chính các giáo viên cũng quá kinh ngạc không bình luận gì được cả.", "eng": "The teachers were themselves too surprised to comment."}, {"viet": "Bọn khủng bố phải miễn cưỡng giao hai trong số các con tin của chúng cho cảnh sát.", "eng": "The terrorists have yielded two of their hostages to the police."}, {"viet": "Nước triều đã cuốn hàng hoá từ con tàu đắm lên bờ.", "eng": "The tide had washed up cargo from the wrecked ship."}, {"viet": "Thành phố này buộc phải đầu hàng sau một cuộc bao vây dài ngày.", "eng": "The town was forced to yield after a long siege."}, {"viet": "Cây cối cho bóng mát dễ chịu chống cái nắng nóng.", "eng": "The trees give some welcome shade from the sun."}, {"viet": "Hai người bạn nói tạm biệt rồi ai về nhà nấy.", "eng": "The two friends said goodbye and went to their respective homes."}, {"viet": "Công đoàn đã buộc phải thay đổi lập trường của mình.", "eng": "The union has been forced to modify its position."}, {"viet": "Rau đã nấu thành một chất nhão đặc sệt, hoàn toàn không thể ăn được.", "eng": "The vegetables had been boiled to a mush, and were quite uneatable."}, {"viet": "Chị hầu bàn đã phục vụ hai mươi tách trà từ lúc 4 giờ.", "eng": "The waitress has served twenty teas since 4 o'clock."}, {"viet": "Thời tiết đẹp có dấu hiệu kết thúc.", "eng": "The weather shows signs of breaking up."}, {"viet": "Gió thổi bay mọi thứ khỏi bàn, khăn bàn và tất cả mọi thứ khác.", "eng": "The wind blew everything off the table, tablecloth and all."}, {"viet": "Từ hack có nghĩa là nhà báo nhưng có hàm ý nói xấu.", "eng": "The word hack means journalist but has derogatory connotations."}, {"viet": "Các năm được tính số từ năm giả định là năm Chúa được sinh ra.", "eng": "The years are numbered from the year that was supposed to be the one in which Christ was born."}, {"viet": "Lối sống phung phí của chúng nó đẩy chúng nó ngập sâu vào nợ nần.", "eng": "Their extravagant life-style plunged them into debt."}, {"viet": "Những bài giảng đạo của họ đủ để các công nhân ngoan ngoãn dễ bảo.", "eng": "Their sermons were intended to bamboozle the workers in to obedience."}, {"viet": "Sau đó chúng tôi đến phim trường Universal và Disneyland.", "eng": "Then we went to Universal Studios and Disneyland."}, {"viet": "Có lớp đặc biệt cho bà mẹ tổ chức từ 11 giờ đến 13 giờ.", "eng": "There's a special mother's course offered from eleven to one."}, {"viet": "Sâu vào trong đất liền 100 dặm, không có nhiều rừng rậm.", "eng": "There's not much jungle 100 miles inland."}, {"viet": "Có những hạn chế về số tiền được phép mang khi đi ra nước ngoài.", "eng": "There are currency restrictions on the sums allowed for foreign travel."}, {"viet": "Có vài cảnh tình dục lộ liễu trong phim.", "eng": "There are several sexually explicit scenes in the film."}, {"viet": "Gần đây trên truyền hình có quá nhiều vở kịch về ly hôn.", "eng": "There has been a surfeit of plays about divorce on the television recently."}, {"viet": "Cần phải bảo tồn cây cối nếu không chẳng bao lâu sẽ không còn rừng nữa.", "eng": "There is a need of the conservation of trees, or there will soon not be forests."}, {"viet": "Không có nhiều sôi nổi trong nền kinh tế, nhưng cũng không có gì thực sự kéo nó xuống.", "eng": "There is not much oomph in the economy, but there is nothing seriously pushing it down."}, {"viet": "Có cửa hàng thịt ở bên cạnh nhà hát.", "eng": "There was a butcher's shop alongside the theatre."}, {"viet": "Khi con trai của nhà vua ra đời thì cả nước vui chơi nhảy múa.", "eng": "There was joy and merrymaking in the whole country when the King's son was born."}, {"viet": "Có mấy chặng về đích bám sát nhau trong cuộc thi.", "eng": "There were several close finishes during the competition."}, {"viet": "Các máy tính này chưa thấy bán.", "eng": "These computers are not yet on the market."}, {"viet": "Những cột này đỡ cả mái nhà.", "eng": "These pillars carry the weight of the roof."}, {"viet": "Họ trừ tiền lương tôi để trả tiền cấp dưỡng cho vợ tôi.", "eng": "They're garnishing my wages to pay may wife alimony."}, {"viet": "Tất cả họ đều bật cười trước vẻ mặt của cô ấy.", "eng": "They all burst out laughing at the expression on her face."}, {"viet": "Họ đang cố gắng giành được sự ủng hộ cho đề nghị của họ.", "eng": "They are trying to win support for their proposal."}, {"viet": "Họ quyết định chia một năm làm 12 tháng với độ dài gần bằng nhau.", "eng": "They chose to divide the year into 12 months of about the same length."}, {"viet": "Chúng nó chẳng ăn ý gì với nhau đâu.", "eng": "They don't get on at all well together."}, {"viet": "Họ quen nhau ngay khi vừa gặp.", "eng": "They got on like a house on fire as soon as they met."}, {"viet": "Chúng phải giữ cho xi măng chuyển động nếu không xi măng sẽ bị cứng lại.", "eng": "They have to keep the cement moving or it will get hard."}, {"viet": "Họ tự làm ra quần áo để mặc.", "eng": "They made their own clothes."}, {"viet": "Họ chơi nhạc rất cuồng nhiệt và giá vào cửa lại không mắc.", "eng": "They play will music and is not expensive."}, {"viet": "Họ nói anh ấy có tội nhưng tôi tin ngược lại.", "eng": "They say he is guilty but I believe the contrary."}, {"viet": "Họ ủng hộ các chị em trong cuộc tranh chấp.", "eng": "They supported their sisters in the dispute."}, {"viet": "Họ có thể xác định vị trí chiếc du thuyền bằng ra đa.", "eng": "They were able to position the yacht by the means of radar."}, {"viet": "Chúng bị trừng phạt vì hành vi xấu xa của chúng.", "eng": "They were punished for their bad behaviour."}, {"viet": "Tôi nghĩ là đã nhớ tắt bếp lò rồi, nhưng anh cũng cứ nên kiểm tra lại xem tôi đã tắt chưa.", "eng": "Think I remembered to switch the oven off but you'd better check up."}, {"viet": "Cái hang này được những người buôn lậu sử dụng ở thế kỷ 18.", "eng": "This cave was used by smugglers in the eighteenth century."}, {"viet": "Chiếc váy này vẫn còn tốt, nó đã mặc được ba năm mà trông vẫn còn mới.", "eng": "This dress has worn well, it is three years old and it still looks new."}, {"viet": "Đây là cái máy vi tính mới toanh.", "eng": "This is a brand-new computer."}, {"viet": "Đây là nơi tôi đã nói cho anh biết rồi đó.", "eng": "This is the place I was telling you about."}, {"viet": "Mẫu này bán được nhiều hơn các mẫu khác trên thị trường.", "eng": "This model outsells all others on the market."}, {"viet": "Vở kịch chia ra làm ba hồi và mỗi hồi có ba cảnh.", "eng": "This play is divided into three acts, and each act has three scenes."}, {"viet": "Xà phòng này một gói có 3 cục.", "eng": "This soap comes in a pack of three."}, {"viet": "Điều này đã được thực hiện qua nhiều sự gián đoạn.", "eng": "This was performed amid many interruptions."}, {"viet": "Hàng ngàn người chết trong trận động đất.", "eng": "Thousands of people perished in the earthquake."}, {"viet": "Tom đã đi dự liên hoan, còn em anh ta thì không.", "eng": "Tom went to the party, but his brother didn't."}, {"viet": "Không tử tế là nói chưa đúng! Hắn đã đối xử với súc vật thật kinh khủng.", "eng": "Unkind isn't the word for it! He treats the animals appallingly."}, {"viet": "Có sự phản ứng gì đối với đề nghị của anh không?", "eng": "Was there any backlash aimed at your suggestion?"}, {"viet": "Chúng ta sẽ phải gọi thợ hàn chì đến sửa cái ống dẫn nước vỡ.", "eng": "We'll have to get a plumber in to mend that burst pipe."}, {"viet": "Tháng Sáu mà thời tiết vẫn còn khá rét.", "eng": "We're having rather cold weather for June."}, {"viet": "Chúng tôi đã bớt đi được nhiều khoản chi tiêu bằng cách tự làm lấy việc.", "eng": "We've been saved a lot of expense by doing the work ourselves."}, {"viet": "Chúng tôi đã đăng quảng cáo tìm người làm và bị tràn ngập đơn xin việc.", "eng": "We advertised the job and were deluged with applications."}, {"viet": "Chúng tôi được thân chủ của chúng tôi cho biết là anh nợ họ 300 pao.", "eng": "We are instructed by our clients that you owe them 300 pounds."}, {"viet": "Cả hai chúng ta cùng chia sẻ công lao đối với sự thành công này.", "eng": "We both share the credit for this success."}, {"viet": "Chúng ta có thể lấy vé một tiếng đồng hồ trước khi vở kịch bắt đầu.", "eng": "We can pick up the tickets an hour before the play begins."}, {"viet": "Chúng tôi làm căn phòng tối đi bằng cách đóng các cửa lại.", "eng": "We darken the room by shutting the doors."}, {"viet": "Chúng tôi nghĩ sẽ gặp phải nhiều ý kiến phản đối kế hoạch này.", "eng": "We expect to come up against a lot of opposition to the scheme."}, {"viet": "Chúng tôi đã rất vui vẻ trong bữa tiệc của anh.", "eng": "We had an all right time at your party."}, {"viet": "Gần đây thời tiết rất xấu.", "eng": "We have been having such bad weather recently."}, {"viet": "Sáng nay chúng tôi học hai tiết, nhưng có nghỉ giải lao giữa giờ.", "eng": "We have two lessons this morning, but there's some free time in between."}, {"viet": "Chúng tôi lắng nghe rất chăm chú nhưng chẳng nghe thấy gì cả.", "eng": "We listened carefully but heard nothing."}, {"viet": "Chúng ta phải chuẩn bị cho tất cả những biến cố bất thình lình.", "eng": "We must be prepared for all eventualities."}, {"viet": "Chúng tôi cần hai mươi điểm nữa để đánh xong ván.", "eng": "We need another twenty points to make game."}, {"viet": "Chúng ta gần hết ga rồi.", "eng": "We're almost out of gas."}, {"viet": "Chúng tôi sẽ thi đấu ngày mai, nếu thời tiết cho phép.", "eng": "We shall play the match tomorrow, weather permitting."}, {"viet": "Chúng tôi đã quần quật suốt buổi chiều để chuẩn bị nhà cửa đón khách.", "eng": "We toiled away all afternoon to get the house ready for our guests."}, {"viet": "Chúng tôi đến dự buổi lễ ra mắt vở kịch mới của họ.", "eng": "We went to the premiere of their new presentation."}, {"viet": "Chúng tôi rộn ràng lên khi nghe tin tức kỳ diệu của anh.", "eng": "We were thrilled to hear your wonderful news."}, {"viet": "Đội chiếc mũ bảo hộ khi đi xe mô tô.", "eng": "Wearing protective headgear on a motor cycle."}, {"viet": "À, vì chưa tới ngày lĩnh lương nên tiền chi tiêu của tôi còn khoảng dưới 500 yên.", "eng": "Well, it's before payday so my budget is ¥ 500 or less."}, {"viet": "Lúc bé anh được nuôi bằng sữa ngoài hay sữa mẹ?", "eng": "Were you bottle-fed or breast-fed as a child?"}, {"viet": "Tôi thật là ngu ngốc đã bỏ quên cái va li trên tàu!", "eng": "What an idiot I was to leave my suitcase on the train!"}, {"viet": "Có thể làm gì trong một cảnh tương tự?", "eng": "What could be done in such a conjuncture?"}, {"viet": "Lí do gì đi nữa, ba mẹ cũng lo.", "eng": "What ever the reason, we were worried."}, {"viet": "Ý định thầm kín của những người thuộc đảng Dân chủ là gì?", "eng": "What is the hidden agenda of the Democrats?"}, {"viet": "Đây sẽ là một bữa tiệc gì vậy?", "eng": "What kind of party will this be?"}, {"viet": "Những cái cô ấy đã làm thật kinh tởm đến mức tôi khó có thể tả được.", "eng": "What she did was so shocking that I can hardly describe it."}, {"viet": "Điều anh nói làm cho tôi thêm tò mò, hãy kể cho tôi nghe nữa đi.", "eng": "What you say intrigues me, tell me more."}, {"viet": "Khi anh ta bế đứa con nhỏ lên, nó đấm thùm thụp vào ngực anh ta một cách giận dữ.", "eng": "When he picked up his small daughter's, she pummelled him angrily on the chest."}, {"viet": "Khi gặp ai đó thuộc các nhóm sau, tên có thể không được sử dụng ngoại trừ có yêu cầu đặc biệt:.", "eng": "When meeting someone in the following categories, first names may not be used except by specific request:."}, {"viet": "Khi bác sĩ đi nghỉ, công việc của họ thường do những người thay thế thực hiện.", "eng": "When they are on holiday the work of doctors is often done by locums."}, {"viet": "Núm khoá để tắt lò sưởi ở đâu?", "eng": "Where's the key for turning off the radiator?"}, {"viet": "Dù trời mưa hay không, chúng ta sẽ vẫn chơi bóng đá vào thứ bảy.", "eng": "Whether it rains or not, we're playing football on Saturday."}, {"viet": "Thằng quỷ ngu ngốc nào để lửa cháy suốt ngày thế này?", "eng": "Which silly devil left the fire on all day?"}, {"viet": "Chúng ta phải xem ai là người chịu trách nhiệm về thất bại này?", "eng": "Who do we have to thank for this fiasco?"}, {"viet": "Sao cậu lại quay lưng vào ống kính?", "eng": "Why did you have your back to the camera?"}, {"viet": "Tại sao chúng tôi phải đối xử đặc biệt với anh?", "eng": "Why should we give you special treatment?"}, {"viet": "Có giữ vững ý kiến của mình trong cuộc mặc cả này không?", "eng": "Will you keep your side of the bargain?"}, {"viet": "Vì tất cả những người đến và đi liên miên, tôi hoàn toàn không làm được một việc gì.", "eng": "With all the comings and goings I haven't been able to do any work at all."}, {"viet": "Làm việc trên một con tàu mới thì thật quá tốt.", "eng": "Work on the new ship is quite far along."}, {"viet": "Anh thích nước cam hay nước táo?", "eng": "Would you like orange juice or apple juice?"}, {"viet": "Xin ông vui lòng điền vào mẫu đơn và ký tên ở đây?", "eng": "Would you please fill in a form and sign your name here?"}, {"viet": "Vâng, một vụ cháy lớn có thể rất nguy hiểm.", "eng": "Yes, a big fire could be dangerous."}, {"viet": "Vâng, nhân viên giặt quần áo đã giao nhầm một số quần áo đã giặt ủi đến phòng tôi, nhưng đó không phải là quần áo của tôi.", "eng": "Yes, the valet delivered some laundry to my room, but it's not mine."}, {"viet": "Từ trên đỉnh đồi, anh sẽ nhìn thấy pháo đài rất rõ.", "eng": "You'll get a very clear view of the fortress on top of the hill."}, {"viet": "Anh phải biết là anh được trả lương không phải để ngồi chơi không suốt ngày!", "eng": "You're not being paid to twiddle your thumbs all day, you know!"}, {"viet": "Cậu thua rồi, mặt mẹt! Rebecca hét lên khi vượt qua Martha trong cuộc chạy nước rút 100 mét.", "eng": "You are aced, sucker! shouted Rebecca as she passed Martha in the 100 yard sprint."}, {"viet": "Tôi không tin họ lại thích công việc pha trà ở cơ quan, xin kể ra một sự coi thường.", "eng": "You can't make me believe that they enjoy making tea in the office, to name one indignity."}, {"viet": "Bạn có thể kiếm được nhiều tiền.", "eng": "You can make a lot of money."}, {"viet": "Anh chỉ rõ sự thật là đã giúp tôi một việc rất lớn.", "eng": "You did me a great service by showing me the truth."}, {"viet": "Anh cứ tưởng ra rằng trong thư của cô ta có một cảm tình nào đó mà thực ra là cô ta có thể không có.", "eng": "You have read into her letter a sympathy that she cannot possibly feel."}, {"viet": "Có vẻ như bạn đã sụt cân.", "eng": "You look like you've lost weight."}, {"viet": "Anh cũng phải có thợ máy sửa tàu nữa.", "eng": "You must have mechanics for the ship, too."}, {"viet": "Anh phải ăn kiêng và tập thể dục nhiều hơn.", "eng": "You ought to diet and take more exercise."}, {"viet": "Anh chỉ nên sử dụng cửa này trong tình trạng khẩn cấp.", "eng": "You should only use this door in an emergency."}, {"viet": "Bạn muốn lái xe không có bằng lái sao?", "eng": "You want to drive without a license?"}, {"viet": "Những con chim non rất dễ bị thú ăn thịt làm hại.", "eng": "Young birds are very vulnerable to predators."}, {"viet": "Mẹ anh sẽ rất sung sướng nghe nói anh an toàn.", "eng": "Your mother will be very relieved to hear that you are safe."}]