[{"viet": "Một lưỡi dao thuôn dần thành mũi nhọn.", "eng": "A blade that tapers off to a fine point."}, {"viet": "Một đứa bé ngã từ tầng bảy của một chung cư.", "eng": "A child fell from the seventh floor of a block of flats."}, {"viet": "Một vụ hư hư thực thực.", "eng": "A confusing intermixture of fact and fiction."}, {"viet": "Một cuộc bàn cãi mà đời sau còn ghi nhớ là một bước ngoặt trong chiến dịch đó.", "eng": "A debate that will go down as a turning point in the campaign."}, {"viet": "Một người trúng tuyển nghĩa vụ quân sự đang chờ được tiếp nhận vào quân đội.", "eng": "A draftee waiting to be inducted into the army."}, {"viet": "Một bóng người đứng trong cảnh tranh tối tranh sáng.", "eng": "A figure standing in the shadows."}, {"viet": "Một vụ tăng giá đồng Yên thêm nữa.", "eng": "A further revaluation of the Yen."}, {"viet": "Một tia chớp mạnh lóe lên làm sáng bầu trời ban đêm.", "eng": "A great flash of lightning lit the night sky."}, {"viet": "Một bức tường cao xung quanh khu đất bảo vệ sự sống cách biệt của họ.", "eng": "A high wall round the estate protected their privacy."}, {"viet": "Một cái ấm bị đóng cáu bên trong.", "eng": "A kettle that is scaly inside."}, {"viet": "Một cuộc đấu tranh quyết liệt giữa công đoàn và ban giám đốc.", "eng": "A life-and-death struggle between union and management."}, {"viet": "Một máy có một cái cần di động để nhặt đồ vật.", "eng": "A machine with a movable arm for picking up objects."}, {"viet": "Một thể thơ có sáu nhịp một dòng.", "eng": "A metre with six beats to a line."}, {"viet": "Một nhóm tân binh cho quân đội.", "eng": "A new batch of recruits for the army."}, {"viet": "Một quả thụi đau điếng vào bụng.", "eng": "A painful punch in the solar plexus."}, {"viet": "Một kiến nghị phản đối việc đóng cửa hồ bơi do hàng trăm dân địa phương ký tên.", "eng": "A petition against closing the swimming pool signed by hundreds of local residents."}, {"viet": "Một nhóm nhạc pop ký hợp đồng với một trong những công ty đĩa hát lớn.", "eng": "A pop group that is be under contract to one of the big record companies."}, {"viet": "Một việc tuân thủ tỉ mỉ các nghi thức.", "eng": "A punctilious observance of the formalities."}, {"viet": "Một vụ chống đối của nhóm nghị sĩ mới do một chiến dịch vận động rầm rộ khích động.", "eng": "A revolt of the back-bench fueled by a powerful lobbying campaign."}, {"viet": "Một tiếng kêu thét đủ làm máu của ai đông lại.", "eng": "A scream which was enough to make one's blood curdle."}, {"viet": "Một người nhút nhát thường tránh mọi sự giao tiếp với người khác.", "eng": "A shy person who avoids all human intercourse."}, {"viet": "Một bóng người đơn độc đứng ngoài đường.", "eng": "A solitary figure stood in the road."}, {"viet": "Một nghi lễ kỳ lạ đã diễn ra trước mắt của chúng tôi.", "eng": "A strange ritual was enacted before our eyes."}, {"viet": "Một đội bóng khét tiếng về lối chơi thô bạo.", "eng": "A team that is notorious for playing rough."}, {"viet": "Bầu trời đêm của một vùng nhiệt đới có màu chàm thẫm.", "eng": "A tropical night sky of deepest indigo."}, {"viet": "Một nhân vật kỳ lạ xuất hiện trong một bộ đồ dị kỳ.", "eng": "A weird apparition in fancy dress."}, {"viet": "Khoảng một tiếng rưỡi, hơn kém vài phút đồng hồ.", "eng": "About an hour and a half, give and take a few minutes."}, {"viet": "Thêm muối để nêm cho vừa.", "eng": "Add salt to correct the seasoning."}, {"viet": "Rốt cuộc, ông không thể tham quan được đất nước này kĩ với đôi mắt buồn ngủ như thế đâu!", "eng": "After all, you can't see this country very well with your eyes closed!"}, {"viet": "Sau vài cuộc cải tổ lại công ty, chỉ còn hai phóng viên ở lại cơ quan.", "eng": "After several corporate meltdowns, only two reporters remain in the bureau."}, {"viet": "Sau thái độ vừa rồi của anh, anh còn mong lại được mời nữa hay sao?", "eng": "After your conduct last time, did you expect to be invited again?"}, {"viet": "Mọi kỷ niệm thời thơ ấu đã phai nhoà trong tâm trí của nàng.", "eng": "All memory of her childhood had faded from her mind."}, {"viet": "Tất cả những người khác bỏ chạy, nhưng tôi vẫn bám trụ.", "eng": "All the others ran away, but I sat tight."}, {"viet": "Mặc dù nội dung khá tẻ nhạt, nhưng sự truyền đạt dí dỏm của cô ta đã làm cho khán giả chú ý.", "eng": "Although the subject-matter was rather dull her witty delivery kept the audience interested."}, {"viet": "Một thỏa hiệp với giới chủ cuối cùng đã đạt được.", "eng": "An agreement with the employers was finally worked out."}, {"viet": "Một cuộc vận động chính trị của nhóm tinh hoa trong xã hội đã chẳng bao giờ được chấp nhận ở miền trung Illinois.", "eng": "An elitist political campaign that could never play in Peoria."}, {"viet": "Một hoá chất trung tính trong một phản ứng.", "eng": "An indifferent chemical in a reaction."}, {"viet": "Một sự lựa chọn vừa bất lợi lại vừa có lợi.", "eng": "An option with a downside as well as benefits."}, {"viet": "Và ở đó tuôn ra những từ chán ngắt và những cụm từ trống rỗng vô ích.", "eng": "And there pour forth jejune words and useless empty phrases."}, {"viet": "Những chương trình phần mềm chống vi-rút rất hữu ích.", "eng": "Anti-virus software programs are useful."}, {"viet": "Có phải Kevin và Tracy dan díu với nhau không?", "eng": "Are Kevin and Tracy going together?"}, {"viet": "Anh định lái xe đi hay đi xe lửa?", "eng": "Are you driving or taking a train?"}, {"viet": "Anh có đồng ý thề trước tòa rằng anh đã thấy nó làm điều đó không?", "eng": "Are you willing to swear in court that you saw him do it?"}, {"viet": "Thật ngẫu nhiên là anh ta cũng đi Luân Đôn và cho tôi đi nhờ xe.", "eng": "As chance would have it he was going to London as well and was able to give me a lift."}, {"viet": "Như thường lệ phần lớn nhất của ngân sách là dành cho quốc phòng.", "eng": "As usual, the lion's share of the budget is for defence."}, {"viet": "Cuối cùng thì chúng tôi cũng moi ra được sự thật ở hắn ta.", "eng": "At last we've elicited the truth from him."}, {"viet": "Cả hai phía đều có thái độ cứng rắn hơn đối với cuộc đình công.", "eng": "Attitudes to the strike have hardened on both sides."}, {"viet": "Hãy cẩn thận, nếu anh gây tai nạn tôi phải chịu trách nhiệm đấy.", "eng": "Be careful-if you have an accident I'll be liable."}, {"viet": "Là thư ký của tổng giám đốc.", "eng": "Be secretary to the managing director."}, {"viet": "Người Bắc Kinh rất thích loại trà này.", "eng": "Beijing people like it very much."}, {"viet": "Con ngựa Black Widow chắc chắn thắng trong cuộc đua tới đây.", "eng": "Black Widow is a deal cert for the next race."}, {"viet": "Chiến lược xuất sắc về phía lực lượng Liên minh đã bảo đảm chiến thắng của họ tại Chancellorsville.", "eng": "Brilliant strategy on the part of Confederate forces ensured their victory at Chancellorsville."}, {"viet": "Việc kinh doanh trở nên phát đạt hơn.", "eng": "Business is on the up grade."}, {"viet": "Nhưng hiện nay tôi chỉ chăm sóc nó một đôi lần trong tuần thôi.", "eng": "But now I just work on it a couple of times a week to maintain it."}, {"viet": "Do sự ngẫu nhiên của định mệnh họ đã đăng ký phòng trong cùng một khách sạn.", "eng": "By a quirk of fate they had booked into the same hotel."}, {"viet": "Tính toán giá cả cái gì là bao nhiêu.", "eng": "Calculate how much something will cost."}, {"viet": "Tôi có thể xem những gì các ông đang có được không?", "eng": "Can I see what you have?"}, {"viet": "Bạn có thể làm quen với môi trường mới một cách khá dễ dàng và nhanh chóng không?", "eng": "Can you get used to a new environment rather easily and quickly?"}, {"viet": "Anh có thể cụ thể hóa được lời buộc tội của mình về anh ta không?", "eng": "Can you substantiate your accusations against him?"}, {"viet": "Xe ôtô được kiểm tra khi ra khỏi dây chuyền sản xuất.", "eng": "Cars are checked as they come off the production line."}, {"viet": "Trẻ con sống dựa vào cha mẹ về cơm áo.", "eng": "Children depend on their parents for food and clothing."}, {"viet": "Hãy lau sạch chỗ rượu đó đi trước khi nó thấm vào tấm thảm.", "eng": "Clean up that wine before it soaks in to the carpet."}, {"viet": "Lên nắm chính quyền nhờ một chính sách cải tổ kinh tế.", "eng": "Come to power on a platform of economic reform."}, {"viet": "Xin chúc mừng, tôi nghe nói bạn đã thắng cuộc đấu.", "eng": "Congratulations, I heard you won the tournament."}, {"viet": "Chúng ta có thể trở lại vấn đề ngân quỹ lúc đầu chứ?", "eng": "Could we get back to the original question of funding?"}, {"viet": "Anh có thể cho tôi biết sự khác biệt giữa chúng không?", "eng": "Could you tell me the difference between them?"}, {"viet": "Khắc chữ đầu tên họ của mình lên một thân cây.", "eng": "Cut one's initials on a tree."}, {"viet": "Các định nghĩa không nên khó hiểu hơn những từ mà chúng định nghĩa.", "eng": "Definitions should not be more difficult to understand than the words they define."}, {"viet": "Những chi tiết về vụ tai nạn đó lộn xộn trong tâm trí của anh ta.", "eng": "Details of the accident were all jumbled up in his mind."}, {"viet": "Bạn có biết là ở Hokkaido không có mùa mưa không?", "eng": "Did you know that there is no rainy season in Hokkaido?"}, {"viet": "Cho thấy những thái độ hẹp hòi về nghệ thuật sân khấu.", "eng": "Display provincial attitudes to the theatre."}, {"viet": "Làm một việc để giữ thể diện bằng cách từ chức.", "eng": "Do the honourable thing by resigning."}, {"viet": "Bạn có cảm thấy là giá sinh hoạt ở Nhật Bản đắt hơn ở các nước phát triển khác không?", "eng": "Do you feel that the cost of living in Japan is more expensive than in other developed countries?"}, {"viet": "Ông có một vài giấy chứng nhận nào khác không?", "eng": "Do you have some other identification?"}, {"viet": "Ý bạn nói là buồn cười hay quái gở?", "eng": "Do you mean funny ha-ha or funny peculiar?"}, {"viet": "Bạn nghĩ mặc như thế tại bữa tiệc là được phải không?", "eng": "Do you think it will be presentable at the party?"}, {"viet": "Bác sĩ ạ, sao lúc nào tôi cũng thấy bồn chồn cả?", "eng": "Doctor, why is it that I'm always nervy?"}, {"viet": "Các cán bộ giảng dạy sống trong bầu không khí học đường cao quý.", "eng": "Dons living in a rarefied academic atmosphere."}, {"viet": "Đừng có nói úp mở với tôi nữa-Tôi muốn có một câu trả lời thẳng thắn cho một câu hỏi thẳng thắn!", "eng": "Don't equivocate with me-I want a straight answer to a straight question!"}, {"viet": "Đừng buồn như thế-cười đi nào!", "eng": "Don't look so blue-smile!"}, {"viet": "Đừng nói với tao như thế, mụ ác độc!", "eng": "Don't talk to me like that, you bitch!"}, {"viet": "Hàng tá vết bẩn trên quần áo đã giặt sạch của tôi.", "eng": "Dozens of smuts on my clean washing."}, {"viet": "Bụi bám trên ngưỡng cửa sổ.", "eng": "Dust had collected on the window-sill."}, {"viet": "Sơn nước có thể trộn với nước cho loãng hơn.", "eng": "Emulsion can be mixed with water to make it thinner."}, {"viet": "Thậm chí đến bây giờ một người phụ nữ khả kính cũng không nên vào quán rượu một mình, cô ấy phải có một người đàn ông hộ tống và bảo vệ cô ấy.", "eng": "Even now it is still not quite respectable for a woman to go into a pub alone, she must have a man to escort and protect her."}, {"viet": "Rõ ràng một số phụ nữ địa phương tổ chức hội đó mà.", "eng": "Evidently it was organized by some local women."}, {"viet": "Thám hiểm bề mặt của mặt trăng.", "eng": "Explore the surface of the moon."}, {"viet": "Số phận đã an bài rằng họ sẽ gặp nhau.", "eng": "Fate had pre-ordained that they should meet."}, {"viet": "Cuối cùng hãy ký tờ đơn giống như ký ngân phiếu du lịch vậy.", "eng": "Finally sign the application in the same manner as the traveler's cheques were signed."}, {"viet": "Những ngọn lửa bắt đầu bén qua đồ gỗ.", "eng": "Flames beginning to lick the furniture."}, {"viet": "Muốn biết thêm chi tiết, hãy viết thư xin bản tài liệu của chúng tôi.", "eng": "For further details, write in for our free fact-sheet."}, {"viet": "Nói thật đấy, tôi đâu có hỏi mua đâu.", "eng": "Frankly, I don't have to."}, {"viet": "Hơi khí sâu trong lòng đất phụt lên ùng ục qua mặt hồ.", "eng": "Gases from deep in the earth bubble up through the lake."}, {"viet": "Việc giành được hợp đồng này quyết định tương lai của công ty chúng tôi.", "eng": "Getting this contract is crucial to the future of our company."}, {"viet": "Cứ xét đến việc cô ta quan tâm tới trẻ con, tôi tin rằng việc dạy học là nghề thích hợp với cô ta.", "eng": "Given that she is interested in children, I am sure teaching is the right career for her."}, {"viet": "Sắp đến hồi thái lai rồi.", "eng": "Good times are just round the corner."}, {"viet": "Phân nửa số tiền của tôi đã đi tiêu mất rồi-anh lại giở ngón ra phải không?", "eng": "Half my money's gone-you've been up to your tricks again, haven't you?"}, {"viet": "Có số vốn cần thiết để bắt đầu một cuộc kinh doanh.", "eng": "Have the requisite capital to start a business."}, {"viet": "Bạn có bao giờ học tiếng Pháp hoặc tiếng Đức chưa?", "eng": "Have you ever studied French or German?"}, {"viet": "Anh đã xem báo hôm nay chưa?", "eng": "Have you seen today's paper?"}, {"viet": "Anh ta là một sinh viên tốt, nhưng anh ta chẳng bao giờ làm được việc gì đáng kể.", "eng": "He's a good student, but he won't ever set the Thames on fire."}, {"viet": "Ông ấy bị ốm và chưa được khoẻ để đi làm.", "eng": "He's been ill and isn't fit for work yet."}, {"viet": "Anh ấy là một người tự chủ, nhưng anh ấy không bỏ qua lời khuyên.", "eng": "He's his own man, but he doesn't ignore advice."}, {"viet": "Nó hối tiếc cái ngày nó nhập ngũ!", "eng": "He's rueing the day he joined the army!"}, {"viet": "Ông ta tố cáo chính phủ đã hủy bỏ thỏa hiệp thương lượng.", "eng": "He accused the government of tearing up the negotiated agreement."}, {"viet": "Anh ta xin được từ chức.", "eng": "He asked to be relieved of his post."}, {"viet": "Anh ta bị gãy chân trong trận đấu và đã được khiêng đi.", "eng": "He broke his leg during the match and had to be carried off."}, {"viet": "Khi cần phê bình tác phẩm ấy ông ta chắc chắn đã không dè dặt giữ kẽ.", "eng": "He certainly didn't pull any punches when it came to criticizing the work."}, {"viet": "Anh ta đâm chiếc xe ôtô vào tường.", "eng": "He crashed his car into a wall."}, {"viet": "Anh ấy chết một cái chết anh hùng.", "eng": "He died a hero's death."}, {"viet": "Anh ta nhấn mạnh tầm quan trọng của việc lái xe cẩn thận.", "eng": "He emphasized the importance of careful driving."}, {"viet": "Anh ta cảm thấy nhục vì những nhận xét khinh bỉ của cô ta.", "eng": "He felt humiliated by her scornful remarks."}, {"viet": "Anh ấy không cưỡng được sự tò mò và đã mở bức thư gởi cho chị mình.", "eng": "He gave in to curiosity and opened the letter addressed to his sister."}, {"viet": "Chàng nắm chặt cánh tay nàng.", "eng": "He grasped her firmly by the arm."}, {"viet": "Anh ta phải đổi xe nhanh chóng ở Crewe.", "eng": "He had to made a quick change at Crewe."}, {"viet": "Anh ta cứ tìm cách lấy lòng ông đạo diễn với hy vọng được đóng vai chính trong vở kịch đó.", "eng": "He has been courting the director, hoping to get the leading role in the play."}, {"viet": "Hôm nay anh ta phải rời cơ quan sớm.", "eng": "He has to leave work early today."}, {"viet": "Ông ấy 90 tuổi nhưng vẫn còn sử dụng được mọi khả năng của mình.", "eng": "He is 90 but still retains the use of all his faculties."}, {"viet": "Ông ta không có cùng tín ngưỡng với họ.", "eng": "He is not of their religious persuasion."}, {"viet": "Anh ấy chạy bộ dọc theo bãi biển.", "eng": "He jogged the length of the beach."}, {"viet": "Nó thốt ra một tràng những lời nguyền rủa.", "eng": "He let out a volley of oaths."}, {"viet": "Anh ấy tuột tay khỏi sợi dây thừng.", "eng": "He lost his hold on the rope."}, {"viet": "Anh ta không hiểu ý câu nói đùa của tôi.", "eng": "He missed the point of my joke."}, {"viet": "Anh ta đã mất thăng bằng và ngã xuống nước.", "eng": "He overbalanced and fell into the water."}, {"viet": "Anh ta thích ăn món bít tết thật chín.", "eng": "He prefers his steak well-done."}, {"viet": "Anh ta vội nở một nụ cười đón chào khi khách của anh ta đến.", "eng": "He quickly donned a welcoming smile as his guests arrived."}, {"viet": "Anh ta miễn cưỡng chấp nhận những điều họ muốn.", "eng": "He reluctantly complied with their wishes."}, {"viet": "Ông ta là lão già nghiện rượu phát sợ.", "eng": "He's a dreadful old soak."}, {"viet": "Anh ta đang được chữa bệnh bạch cầu bằng các xtêroi.", "eng": "He's being treated with steroids for leukemia."}, {"viet": "Ông ta ngăn nắp tới mức cực đoan.", "eng": "He's methodical to the nth degree."}, {"viet": "Anh ấy quá dễ dãi với học sinh của mình.", "eng": "He's too lax with his pupils."}, {"viet": "Anh ta nói anh ta bị nhức đầu.", "eng": "He says he has a headache."}, {"viet": "Anh ấy đã bắn mấy viên mới trúng mục tiêu.", "eng": "He shot several bullets before hitting the target."}, {"viet": "Ông ta đã bán ngôi nhà được giá.", "eng": "He sold the house for a good price."}, {"viet": "Anh ấy lặn dưới nước 24 giờ.", "eng": "He stayed underwater for twenty-four hours."}, {"viet": "Nó ủng hộ đội nhà nồng nhiệt gần như là tôn sùng.", "eng": "He supports his local team with a fervour that borders on idolatry."}, {"viet": "Anh vạch rõ lỗi lầm cho cô ta tới khi cô ấy không chịu được nữa.", "eng": "He threw up her mistakes to her until she couldn't stand it any longer."}, {"viet": "Ông đã đi qua nhiều quốc gia và lập nên nhiều nhà thờ ở khắp nơi.", "eng": "He traveled over many lands and founded churches in many places."}, {"viet": "Anh ta cố thuyết phục chúng tôi đi.", "eng": "He urged that we should go."}, {"viet": "Ông ta là người Thiên Chúa giáo nhưng không tích cực hành lễ ( tôn giáo của ông ).", "eng": "He was a Catholic but didn't practise ( his religion )."}, {"viet": "Anh ta nổi cơn thịnh nộ tam bành khi nhìn thấy cảnh hỗn độn.", "eng": "He was beside himself with rage when he saw the mess."}, {"viet": "Anh ấy bị tàn tật trong chiến tranh, anh ấy mất cánh tay trái.", "eng": "He was disabled in the war, he lost his left arm."}, {"viet": "Hắn ta bị giữ với hai cánh tay bị trói lại với nhau.", "eng": "He was held with his arms pinioned together."}, {"viet": "Anh ta sung sướng cùng cực khi vợ anh ta sinh con.", "eng": "He was on cloud nine after his wife had the baby."}, {"viet": "Anh ta bị tù ba năm lao động khổ sai.", "eng": "He was sentenced to three years hard labour."}, {"viet": "Anh ấy quá say không thể đi thẳng được.", "eng": "He was too drunk to walk straight."}, {"viet": "Ông ta đùng đùng nổi giận.", "eng": "He went into a paroxysm of rage."}, {"viet": "Anh ấy thắng ở cuộc chạy đua vượt rào cự ly 400 mét.", "eng": "He won the 400 metres hurdles."}, {"viet": "Chất đá thành đống để làm thành một cái đập.", "eng": "Heap up stones to form a dam."}, {"viet": "Phương pháp giải quyết công việc đó của cô ấy thiếu kiên quyết.", "eng": "Her approach to the job lacks purpose."}, {"viet": "Văn xuôi trong sáng và tao nhã của cô ta làm cô ta nổi bật hơn hầu hết các ký giả khác.", "eng": "Her clear and elegant prose sets her apart from most other journalists."}, {"viet": "Những lời giải thích của cô ta không làm ai hiểu gì cả.", "eng": "Her explanations were met with blank incomprehension."}, {"viet": "Kiểu tóc và son phấn của ả trông thật tởm!", "eng": "Her hairdo and make-up look positively ghastly!"}, {"viet": "Bộ phim mới đây của bà ấy tổng thu một triệu pao.", "eng": "Her last film grossed a million pounds."}, {"viet": "Nhà mới của bà ta chắc hẳn là khác thường.", "eng": "Her new house is certainly out of the ordinary."}, {"viet": "Ví tay để trong túi xách của bà ấy bị đánh cắp.", "eng": "Her purse was stolen from her handbag."}, {"viet": "Bài diễn văn của bà ta đã tác động mạnh mẽ đến nhiều người.", "eng": "Her speech made a tremendous impact on everyone."}, {"viet": "Toàn bộ y phục của nàng trông rất giàu có sang trọng.", "eng": "Her whole attire was rich in appearance."}, {"viet": "Này, nhà hàng này có phục vụ thức ăn tuỳ chọn với số tiền đặc biệt chỉ 10 đô la.", "eng": "Hey, this restaurant has an all-you-can-eat special for $ 10."}, {"viet": "Sự đánh giá tình hình của anh ta là chính xác.", "eng": "His assessments of the situation was spot-on."}, {"viet": "Các cá tính của anh ta được một ngòi bút sắc bén mô tả rõ rệt.", "eng": "His characters are drawn with a strong pencil."}, {"viet": "Sự mất tích của hắn đang được cảnh sát điều tra.", "eng": "His disappearance is being looked into by the police."}, {"viet": "Sự nổi tiếng của ông ta đã phải trả giá bằng sự tổn thương sức khoẻ và hạnh phúc.", "eng": "His fame was bought at the expense of health and happiness."}, {"viet": "Hạnh phúc của anh ấy trọn vẹn khi cô ấy đồng ý ở với anh ấy một ngày.", "eng": "His happiness was consummated when she agreed to spend the day with him."}, {"viet": "Lá thư cuối cùng của anh ấy đề ngày 24 tháng 5.", "eng": "His last letter was dated 24 May."}, {"viet": "Nàng thơ đã bỏ hắn và hắn không còn viết được nữa.", "eng": "His muse had deserted him, and he could no longer write."}, {"viet": "Kế hoạch giảm số công nhân của anh ta đã đập lại chính anh ta và anh ta mất việc làm.", "eng": "His plan to reduce the number of workers boomeranged and he lost his own job."}, {"viet": "Phòng anh ấy lúc nào cũng bề bộn.", "eng": "His room is always in a clutter."}, {"viet": "Phong cách hát của anh ta rất khoẻ nhưng anh ta không để nhiều tình cảm vào cách diễn đạt lời.", "eng": "His style of singing is very virile but he doesn't have much feelings for the expressiveness of the words."}, {"viet": "Cái chết đột ngột của vợ anh ấy đã làm cho anh ấy rối trí.", "eng": "His wife's sudden death upset the balance of his mind."}, {"viet": "Giữ một chức vụ cần có tài ứng biến trong Bộ ngoại giao.", "eng": "Holds a sensitive position in the Foreign Office."}, {"viet": "Fred à, dạo này công việc ở công ty Surise ra sao?", "eng": "How's business at Sunrise these day, Fred?"}, {"viet": "Sao anh có thể ủng hộ việc tiếp tục quan hệ buôn bán vời một nước như vậy?", "eng": "How can you support the continuation of trade relations with such a country?"}, {"viet": "Bạn nghĩ sao về phụ nữ đi làm?", "eng": "How do you feel about career women?"}, {"viet": "Bạn nghĩ tôi phải mất bao lâu để lái xe tới đó?", "eng": "How long do you think it would take me to drive there?"}, {"viet": "Bạn nghĩ bạn có bao nhiêu người bạn tốt?", "eng": "How many good friends do you think you have?"}, {"viet": "Ông tính tiền nhờ thu bao nhiêu?", "eng": "How much do you charge for collection?"}, {"viet": "Tôi thật là ngốc quá! Tôi đã để quên chìa khoá ở nhà rồi.", "eng": "How silly of me! I've left my key at home."}, {"viet": "Bị chạm tự ái vì những thái độ khinh thường của các đứa trẻ khác.", "eng": "Hurt by the snubs of the other children."}, {"viet": "Tôi muốn đặt chỗ trên chuyến tàu quốc tế đi Paris.", "eng": "I'd like to reserve a seat on the international train to Paris."}, {"viet": "Tôi sẽ thu xếp hành lý vào đêm trước khi chúng tôi đi.", "eng": "I'll do my packing the night before we leave."}, {"viet": "Tôi sẽ không bao giờ làm lại điều đó nữa, tôi đã học được bài học cho bản thân.", "eng": "I'll never do that again, I've learned my lesson!"}, {"viet": "Tôi hoạt động với tư cách là người được ủy nhiệm cho tới khi ông hiệu trưởng trở về.", "eng": "I'm acting as deputy till the headmaster returns."}, {"viet": "Tôi đã chán ngán chờ điện thoại cho nàng.", "eng": "I'm fed up with waiting for her to telephone."}, {"viet": "Tôi đang được điều trị chứng đau lưng.", "eng": "I'm having a treatment for my lumbago."}, {"viet": "Tôi không hài lòng với kiểu ông ta cắt tóc của tôi.", "eng": "I'm not really satisfied with the way he cut my hair."}, {"viet": "Tôi xin lỗi, số máy đúng là 2929311.", "eng": "I'm sorry, the right number is 2929311."}, {"viet": "Tôi đang nghĩ đến việc sớm tổ chức một buổi tiệc “ Họp mặt hàng xóm ” vào lúc nào đó.", "eng": "I'm thinking of having a Nabe party sometime soon."}, {"viet": "Tôi đã làm công việc này nhiều năm nhưng tôi không thể nào chịu nổi nó nữa.", "eng": "I've been doing this job for years but I just can't hack it any more."}, {"viet": "Lúc này tôi đang có khách.", "eng": "I've got a client with me at the moment."}, {"viet": "Tôi vừa đánh mất chiếc nhẫn-anh làm ơn để ý nó hộ tôi khi anh lau nhà được không?", "eng": "I've lost my ring-could you keep an eye out for it when you clean the house?"}, {"viet": "Tôi đã đi dạo chơi để tiêu cơm sau bữa ăn tối.", "eng": "I've walked off the effects of my dinner."}, {"viet": "Tôi vẫn nói là cuối cùng thế nào hắn cũng vào tù mà.", "eng": "I always said he would wind up in jail."}, {"viet": "Xin lỗi nếu tôi quấy rầy anh.", "eng": "I am sorry if I'm disturbing you."}, {"viet": "Tôi đặt hy vọng vào những tin tức tốt lành chúng tôi nhận được hôm qua.", "eng": "I base my hopes on the good news we had yesterday."}, {"viet": "Tôi trở lại đầu học kỳ.", "eng": "I came back at the beginning of the term."}, {"viet": "Tôi không thể hiểu liệu cô ấy có hứng thú với công việc của mình không.", "eng": "I can't make out if she enjoys her job or not."}, {"viet": "Tôi có thể làm xong chuyện đó dễ dàng tối nay.", "eng": "I can easily finish it tonight."}, {"viet": "Tôi không biết nói thế nào để cảm ơn bạn.", "eng": "I can't begin to thank you."}, {"viet": "Tôi lẫn lộn hai đứa bé với nhau vì chúng giống nhau quá.", "eng": "I confused the two boys, because they look so alike."}, {"viet": "Tôi phóng xe đạp ra đường với con chó chạy đằng sau.", "eng": "I cycled off down the road with the dog running behind."}, {"viet": "Tôi phát hiện một chuyển động nhỏ trong bụi rậm.", "eng": "I detected a slight movement in the undergrowth."}, {"viet": "Tôi nhận ra tiếng piano trong dàn nhạc.", "eng": "I distinguish the sound of a piano in an orchestra."}, {"viet": "Tôi không biết mình sẽ mặc đồ gì để đi dự tiệc nữa.", "eng": "I don't know what I'm going to wear to the party."}, {"viet": "Tôi không nghĩ ngợi gì nhiều về thời tiết nước Anh của chị.", "eng": "I don't think much of your English weather."}, {"viet": "Tôi không muốn ám chỉ là anh sai.", "eng": "I don't wish to imply that you are wrong."}, {"viet": "Tôi nghi ngờ không biết đó có phải là cái anh ấy muốn không.", "eng": "I doubt if that was what he wanted."}, {"viet": "Tôi cảm thấy có tội khi ít đến thăm cô ta.", "eng": "I feel guilty about visiting her so rarely."}, {"viet": "Tôi thấy tác phẩm của anh ta rất thú vị.", "eng": "I find his work very stimulating."}, {"viet": "Lưỡi tôi cứ cứng đơ khi đi cùng cô ấy.", "eng": "I get tongue-tied whenever I'm with her."}, {"viet": "Tôi có lời qua tiếng lại một chút với một thân chủ.", "eng": "I had a brief encounter with an angry client."}, {"viet": "Tôi đã phải sống kham khổ bằng bánh mì và nước lã thời tôi là sinh viên.", "eng": "I had to live on bread and water when I was a student."}, {"viet": "Tôi luôn ghen tị với sự may mắn của anh.", "eng": "I have always envied your good luck."}, {"viet": "Tôi không có ân hận gì về việc ra đi.", "eng": "I have no regrets about leaving."}, {"viet": "Tôi có hai cậu con trai và 1 gái.", "eng": "I have two sons and a daughter."}, {"viet": "Tôi nghe nói khá nhiều người New Zealand làm việc ở Úc.", "eng": "I hear that quite a few New Zealanders work in Australia."}, {"viet": "Tôi hy vọng rằng ý kiến về sự bình đẳng về cơ hội cho nam nữ đã được công nhận mãi mãi.", "eng": "I hope that the idea of equality of opportunity for men and women has come to stay."}, {"viet": "Tôi đúng là chẳng thể nào xoay sở được với 50 pao một tuần.", "eng": "I just can't manage on 50 pounds a week."}, {"viet": "Tôi biết anh đã nói dối về điều đó.", "eng": "I know that you lied about it."}, {"viet": "Tôi thích những chiếc áo sơ mi này, tôi sẽ lấy cả hai.", "eng": "I like these shirts, I'll take both of them."}, {"viet": "Anh sẽ làm bất cứ điều gì em muốn.", "eng": "I'll do anything you want."}, {"viet": "Để bác chỉ cháu phòng tắm ở đâu.", "eng": "I'll show you where it is."}, {"viet": "Tôi cứ bấn cả lên không biết phải làm gì sau đó.", "eng": "I'm at a loss what to do next."}, {"viet": "Tôi chỉ là một người lính tầm thường.", "eng": "I'm just a simple soldier."}, {"viet": "Rất tiếc là tôi không biết.", "eng": "I'm sorry I have no idea."}, {"viet": "Tôi có thể sẽ tạt vào buổi tiệc trên đường về nhà.", "eng": "I may look in at the party on my way home."}, {"viet": "Tôi phải nhớ lục lại cho anh cuốn sách đó.", "eng": "I must remember to dig out that book for you."}, {"viet": "Tôi không hề biết hắn là kẻ đồng tính luyến ái kín đáo.", "eng": "I never knew he was a closet queen."}, {"viet": "Tôi đưa cho anh sợi dây thừng và anh ta nắm lấy nó.", "eng": "I passed him the rope and he took it."}, {"viet": "Tôi xếp hạng thành tích cô ta rất cao.", "eng": "I rank her achievement very highly."}, {"viet": "Tôi coi ý kiến đề xuất của anh là đáng suy xét.", "eng": "I regard your suggestion as worthy considering."}, {"viet": "Tôi gặp Jane và Alison-họ đang mua sắm quần áo.", "eng": "I saw Jane and Alison-they were shopping for clothes."}, {"viet": "Tôi sẽ tự hạn chế vào ba khía cạnh của vấn đề.", "eng": "I shall limit myself to three aspects of the subject."}, {"viet": "Tôi mất gần một tiếng đồng hồ cố tìm cho được chùm chìa khóa xe ôtô của tôi.", "eng": "I spent the best part of an hour trying to find my car keys."}, {"viet": "Tôi đã bám sát anh ta đến một ngôi nhà cô ở khu ngoại ô thành phố.", "eng": "I tagged him to an old house at the outskirt of town."}, {"viet": "Em cho là nằm xuống có hiệu quả hơn.", "eng": "I think it's much more effective lying down."}, {"viet": "Tôi nghĩ là ít nhất bạn cũng hứa giúp đỡ chứ!", "eng": "I think you might at least offer to help!"}, {"viet": "Khi anh đi vắng, tôi đã tự tiện mượn cái máy cắt cỏ của anh.", "eng": "I took the liberty of borrowing your lawn-mower while you were away."}, {"viet": "Tôi dùng xe đạp để đi mua sắm.", "eng": "I use my bike for going shopping."}, {"viet": "Tôi muốn đống rác này được dọn ngay lập tức.", "eng": "I want this rubbish cleaned away pronto."}, {"viet": "Tôi muốn một ít dây nhưng không có sợi nào ở trong nhà cả.", "eng": "I wanted some string but there was none in the house."}, {"viet": "Tôi rất quyết tâm đi gặp hắn.", "eng": "I was firmly resolved to see him."}, {"viet": "Tôi đang đi dọc phố High Street về hướng Bắc thì...", "eng": "I was proceeding along the High Street in a northerly direction when..."}, {"viet": "Tôi có ấn tượng rằng anh ốm.", "eng": "I was under the impression that you were ill."}, {"viet": "Tôi sẽ gửi nó ngay bây giờ.", "eng": "I will mail it right now."}, {"viet": "Tôi không uống thêm một uýt-ki nào nữa đâu, tôi đã uống hai ly rồi.", "eng": "I won't have any more whiskies, I've had a couple already."}, {"viet": "Tôi sẽ vui lòng làm điều đó tiếc là tôi quá bận.", "eng": "I would do it with pleasure only I am too busy."}, {"viet": "Tôi cần 2 vé cho suất diễn 7 giờ tối.", "eng": "I would like two tickets for the 7 p. m. performance."}, {"viet": "Nếu a = b và b = c, chúng ta có thể suy ra rằng a = c.", "eng": "If a = b and b = c, we can deduce that a = c."}, {"viet": "Giá như trông thấy tờ quảng cáo thì tôi đã nộp đơn xin việc rồi.", "eng": "If I had seen the advertisement I would have applied for the job."}, {"viet": "Nếu tất cả những lời buộc tội chống lại anh ta có cơ sở thì anh ta sẽ bị mất việc.", "eng": "If the allegations against him prove to be well-founded, he will lose his job."}, {"viet": "Nếu chúng ta đánh thuế nhập khẩu, các nước khác có thể trả đũa lại chúng ta.", "eng": "If we impose import duties, other countries may retaliate against us."}, {"viet": "Nếu các ông xác nhận đã được thanh toán, xin vui lòng gửi cho chúng tôi biên nhận của các ông.", "eng": "If you confirm the payment, please send us your receipt."}, {"viet": "Nếu anh cứ chà xát mãi, sơn sẽ bong ra.", "eng": "If you keep rubbing, the paint will come of."}, {"viet": "Nếu anh muốn thư đến ngày mai hãy gửi bằng dịch vụ đặc biệt.", "eng": "If you want the letter to arrive tomorrow send it special delivery."}, {"viet": "Trong cơn hối hận, cô ấy đã đốt hết các lá thư của người yêu.", "eng": "In a fit of remorse she burnt all her lover's letters."}, {"viet": "Thực ra, các trường hợp như ông rất bình thường đến độ chúng tôi gọi bệnh này là \"Turista\".", "eng": "In fact, cases like your are so common that we call this disease \"Turista\"."}, {"viet": "Trong công việc của tôi, tôi giao thiệp với đủ hạng người.", "eng": "In my job, I mix with all sorts of people."}, {"viet": "Ở góc phòng có một cái ghế cũ to.", "eng": "In the corner of the room stood a big old chair."}, {"viet": "Năm 1993 sau công nguyên.", "eng": "In the year of Our Lord one thousand nine hundred and ninety-three."}, {"viet": "Các ảnh hưởng tác đối đến sự phát triển nhân cách của một đứa trẻ.", "eng": "Influences which affect development of a child's personality."}, {"viet": "Ở nước bạn là một người mẹ đi làm có khó không?", "eng": "Is it difficult to be a working mom in your country?"}, {"viet": "Có một siêu thị ở gần nhà bạn không?", "eng": "Is there a supermarket near your home?"}, {"viet": "Ở Thuỵ sĩ có gì khác ngoài núi không?", "eng": "Isn't there anything in Switzerland but mountains?"}, {"viet": "Đó chỉ là vấn đề nhỏ nhặt không đáng tranh cãi.", "eng": "It's a trivial matter and not worth fighting about."}, {"viet": "Khó biết được phản ứng của dân thường sẽ ra sao.", "eng": "It's difficult to know what the grass-roots reaction will be."}, {"viet": "Đó chỉ là một giai đoạn cô ta đang trải qua.", "eng": "It's just a phase she's going through."}, {"viet": "Không có cái gì thích thú cả, tôi làm việc này thuần tuý chỉ vì ý thức trách nhiệm.", "eng": "It's not something I enjoy, i do it purely out of a sense of duty."}, {"viet": "Dự đoán là ngày mai vào lúc nào đó tuyết sẽ ngừng rơi.", "eng": "It's supposed to stop snowing sometime tomorrow."}, {"viet": "Đến lượt cậu hát rồi, cậu không thể thoái thác lúc này.", "eng": "It's your turn to sing, you can't cop out now."}, {"viet": "Nó xảy ra vào ngày hai tháng Sáu.", "eng": "It happened on June the second."}, {"viet": "Thật đáng hài lòng thấy sự đáp lại rộng khắp đối với lời kêu gọi từ thiện của chúng tôi.", "eng": "It is gratifying to see the widespread response to our charity appeal."}, {"viet": "Thật là có thành kiến giới tính khi nói rằng đàn bà kém thông minh hơn đàn ông.", "eng": "It is sexist to say that women are less intelligent than men."}, {"viet": "Nghĩa là mùa xuân đang đến, phải không?", "eng": "It means spring is coming, doesn't it?"}, {"viet": "Đây là lần đầu tiên tôi làm việc này.", "eng": "It's my first time doing this."}, {"viet": "Dường như nhân viên phục vụ đã quên mang món tráng miệng cho chúng ta.", "eng": "It seems that the waiter forgot to bring our dessert."}, {"viet": "Tôi để ô ở nhà là một sai lầm lớn.", "eng": "It was a big mistake to leave my umbrella at home."}, {"viet": "Nói chung người ta giả định là điều đó sẽ không xảy ra nữa.", "eng": "It was generally supposed that it would not happen again."}, {"viet": "Rõ ràng là quá nhiều khi đưa lên màn hình ba cuộc phỏng vấn về cùng một chủ đề trong một tối.", "eng": "It was surely overkill to screen three interviews on the same subject in one evening."}, {"viet": "Có lẽ hay hơn cả là nên gọi điện thoại và nói chúng ta sẽ đến muộn.", "eng": "It would be as well to phone and say we will be late."}, {"viet": "Món ăn Nhật Bản nói chung là tuyệt vời, một trong những vật trang điểm cho nền văn hoá.", "eng": "Japanese food is on the whole super, one of the adornments of the culture."}, {"viet": "Các nhà báo thóc mách những chuyện tai tiếng về các ngôi sao màn ảnh nhỏ.", "eng": "Journalists who dish the dirt about television stars."}, {"viet": "Biết cách đọc và viết thông thạo.", "eng": "Know how to read and write well."}, {"viet": "Chúng ta hãy xem cái gì có sẵn trong suốt thời gian đó nhé.", "eng": "Let's see what is available during that time period."}, {"viet": "Cuộc sống ở một trang trại rất khác với những gì tôi đã quen thuộc.", "eng": "Life on a farm is a far cry from what I've been used to."}, {"viet": "Nhiều người đàn ông ở miền Tây đeo những vật đó.", "eng": "Many men in the West wear those."}, {"viet": "Đánh dấu các tờ giấy thi thật là một việc buồn tẻ.", "eng": "Marking examination papers is a real grind."}, {"viet": "Cho phép tôi được giới thiệu với ông, ông Vương, tài xế của chúng ta?", "eng": "May I introduce Mr. Wang, our chauffeur, to you?"}, {"viet": "Người ta luôn luôn ôm lấy tôi hoặc vỗ vào lưng tôi.", "eng": "Men are always putting their arms around me or slap ping me on the back."}, {"viet": "Hầu hết các thức ăn ngọt không có nhiều giá trị dinh dưỡng.", "eng": "Most sweet things don't have much food value."}, {"viet": "Đơn của tôi sẽ được đưa ra trước uỷ ban kế hoạch vào tuần tới.", "eng": "My application goes before the planning committee next week."}, {"viet": "Gia đình tôi rất ủng hộ tham vọng trở thành bác sĩ của tôi.", "eng": "My family is right behind me in my ambition to become a doctor."}, {"viet": "Cuộc đời của tôi dường như đã mất hết tất cả ý nghĩa.", "eng": "My life seems to have lost all meaning."}, {"viet": "Em gái tôi có một vết bớt nhỏ màu đỏ trên cánh trái.", "eng": "My sister has a strawberry mark on the left arm."}, {"viet": "Không ai trong hai người ngồi trong xe bị thương cả.", "eng": "Neither of the car's two occupants was injured."}, {"viet": "Không, hiện giờ anh ấy không có ở đây, nhưng tôi nghĩ lát nữa anh ấy sẽ trở lại.", "eng": "No, he's not here now, but I expect him back in a few minutes."}, {"viet": "Cám ơn, thôi đừng cho uống trà nữa, tôi đã quá đủ rồi.", "eng": "No more tea, thank you, I've had my fill."}, {"viet": "Bây giờ tôi thấy không còn ai có ý kiến gì phản đối nữa-vậy là cho đến trước bữa điểm tâm sáng mai, mọi người đều có thể đi tắm rửa cho mát.", "eng": "Now I'm not having any ifs and buts-it's cold showers for everyone before breakfast tomorrow."}, {"viet": "Dĩ nhiên, ông có thể gia hạn cho nó nếu ông muốn.", "eng": "Of course, you may renew it if you wish."}, {"viet": "Được rồi, em sẽ kiểm tra giá cả trong hiệu sách mà không mua gì cả.", "eng": "OK, I'll check the price in the bookstore without buying anything."}, {"viet": "Ở bên trái ngọn Tháp Trống và Chuông và bên phải là Điện Thiên Vương.", "eng": "On your left are the Drum and Bell Towers and on the right is the Hall of Heavenly Kings."}, {"viet": "Một trong những điều kiện để có việc làm là tôi phải học tiếng Anh.", "eng": "One of the conditions of having the job was that I had to learn English."}, {"viet": "Công việc kinh doanh của chúng ta đang đến bước ngoặt: nếu việc mua bán này thành công, tương lai của chúng ta được đảm bảo, nếu không, chúng ta sẽ phá sản.", "eng": "Our business is at the crossroads: if this deal succeeds, our future is assured, if not, we shall be bankrupt."}, {"viet": "Khách sạn của chúng tôi là cái nằm gần bãi biển nhất.", "eng": "Our hotel is the one nearest the beach."}, {"viet": "Con trai tôi vừa mới chuyển từ xe đạp ba bánh sang xe đạp hai bánh thực sự.", "eng": "Our son has just graduated from a tricycle to a proper bicycle."}, {"viet": "Những gói bích qui có thời hạn sử dụng hai ba tuần.", "eng": "Packets of biscuits with a shelf-life of two or three weeks."}, {"viet": "Người ta thở chậm hơn khi ngủ.", "eng": "People breathe more slowly when they are asleep."}, {"viet": "Thỉnh cầu Nghị viện cho phép các cửa hàng mở cửa ngày Chủ nhật.", "eng": "Petition Parliament to allow shops to open on Sunday."}, {"viet": "Ngày bầu cử kết cục hơi thất vọng.", "eng": "Polling day was a bit of an anticlimax."}, {"viet": "Sự trừng phạt đối với nước đó bao gồm việc từ chối buôn bán với nước đó.", "eng": "Sanctions against that country include refusing to trade with it."}, {"viet": "Cô ta cặp kè với một số người dị hợm.", "eng": "Sh'e picked up with some peculiar people."}, {"viet": "Cô ta là một vận động viên hiếu thắng, cô không bao giờ chịu thua.", "eng": "She's a gutsy player, she never gives in."}, {"viet": "Cô ấy nên đi khám bác sĩ nếu tình hình trở nên xấu hơn.", "eng": "She's better see a doctor if it gets worse."}, {"viet": "Cô ta chỉ mới bắt đầu làm-phải mất một hoặc hai tuần cô ta sẽ quen với công việc.", "eng": "She's just started-it'll take her a week of two to know the ropes."}, {"viet": "Cô ta quá thô lỗ, la hét lên như thế để cho tất cả hàng xóm láng giềng đều nghe thấy.", "eng": "She's so common, shouting like that so all the neighbours can hear!"}, {"viet": "Cô ấy là diễn viên cho một đoàn sân khấu chuyên diễn một số tiết mục tủ, đã ba năm nay.", "eng": "She acted with a repertory company for three years."}, {"viet": "Cô ấy xin anh ta đừng để lộ điều bí mật của cô ấy cho ai biết.", "eng": "She begged him not to give away her secret to anyone."}, {"viet": "Cô ấy ứng cử vào cuộc bầu lại năm sau.", "eng": "She comes up for re-election next year."}, {"viet": "Bà ta đào sâu nghiên cứu nguồn gốc của phong tục đó.", "eng": "She delved into the origins of the custom."}, {"viet": "Cô ta đã lái xe bạt mạng để đến đấy cho kịp giờ.", "eng": "She drove neck or nothing to get there on time."}, {"viet": "Cô ấy hi vọng một cách ngớ ngẩn là có thể thi đỗ mà không cần học.", "eng": "She fondly imagined that she could pass the exam without working."}, {"viet": "Tôi hôm qua cô ta say lúy túy.", "eng": "She got completely paralytic last night."}, {"viet": "Cô ta có vé xổ số trúng giải.", "eng": "She had the prize-winning lottery ticket."}, {"viet": "Bà ấy để quên thẻ tín dụng ở quầy của tôi.", "eng": "She has left her credit card on our counter."}, {"viet": "Cô ấy lập tức viết một lá thư chấp nhận.", "eng": "She immediately wrote a letter of acceptance."}, {"viet": "Em bé gái ấy được coi là em học sinh thông minh nhất lớp.", "eng": "She is reckoned the cleverest pupil in the class."}, {"viet": "Cô ta nằm ở đó không động đậy, tôi nghĩ cô ta chắc đã chết.", "eng": "She lay there inert, I thought she must be dead."}, {"viet": "Cô ấy mất bố mẹ từ khi cô ấy còn nhỏ.", "eng": "She lost her parents when she was very young."}, {"viet": "Chị ấy cần cải tiến cách trình bày các luận cứ của mình.", "eng": "She needs to improve her presentation of the arguments."}, {"viet": "Cô ấy đã thổi phồng thành tích của mình trong quá khứ chỉ để gây ấn tượng đối với chúng tôi.", "eng": "She played up her past achievements just to impress us."}, {"viet": "Cô ấy tìm được ở Nam một người chung quan điểm.", "eng": "She recognized a kindred spirit in Nam."}, {"viet": "Cô ta sẽ dạy kèm suốt mùa hè.", "eng": "She's be coaching all summer."}, {"viet": "Nhan sắc của cô ấy đang bắt đầu tàn phai.", "eng": "She's starting to lose her looks."}, {"viet": "Cô ta có vẻ khá hài lòng về kết quả.", "eng": "She seemed pretty satisfied with the result."}, {"viet": "Cô ta kín đáo rời khỏi cuộc liên hoan.", "eng": "She slipped away from the party unobtrusively."}, {"viet": "Cô tay phải làm việc vất vả, cực lực để nuôi cả gia đình.", "eng": "She stretched herself to provide for the family."}, {"viet": "Cô ấy đưa mắt nhìn tôi một cách giận dữ.", "eng": "She threw me an angry look."}, {"viet": "Ta sử dụng tất cả vẻ quyến rũ của mình để lôi cuốn sự chú ý của anh ấy.", "eng": "She used all her lures to attract his attention."}, {"viet": "Bác sĩ khuyên cô ấy cắt giảm trọng lượng calo để giảm cân.", "eng": "She was advised to cut down on calories by her doctor, in order to reduce her weight."}, {"viet": "Cô ta quyết tâm thắng trong cuộc đua.", "eng": "She was determined to win the race."}, {"viet": "Cô ta bị giam vào tù vì tội xúc phạm quan toà.", "eng": "She was jailed for contempt of court."}, {"viet": "Cô ấy tức tối vì bị loại ra khỏi đội.", "eng": "She was resentful at having been left out of the team."}, {"viet": "Cô ta đang cố hết sức khạc cái xương cá ra.", "eng": "She was trying hard to disgorge a fish bone."}, {"viet": "Cô ấy vừa đi lên gác vừa khóc nức nở.", "eng": "She went sobbing up the stairs."}, {"viet": "Bà ấy đã làm việc chăm chỉ và chẳng bao lâu đã được thăng chức.", "eng": "She worked hard and was soon promoted."}, {"viet": "Khách mua hàng với những chiếc giỏ đầy ắp.", "eng": "Shoppers with their baskets fully laden."}, {"viet": "Việc ký vào mẫu này buộc anh phải mua các món hàng đó.", "eng": "Signing this form commits you to buying the goods."}, {"viet": "Sáu cốc uýtki làm anh ta đứng không vững.", "eng": "Six whiskies made him unsteady on his feet."}, {"viet": "Hút thuốc lá là một thói quen cô ta không thể bỏ được.", "eng": "Smoking is a habit she can't get out of."}, {"viet": "Thế bạn thích loại con trai như thế nào?", "eng": "So what kind of guy do you like?"}, {"viet": "Một vài người làm từ điển dùng các câu trích dẫn để cho thấy các từ có nghĩa gì.", "eng": "Some dictionary writers use citations to show what words mean."}, {"viet": "Một số người cho rằng sự nghèo đói gây ra tội ác.", "eng": "Some people believe that poverty engenders crime."}, {"viet": "Vì một lí do nào đó, hình như tôi có hai con dao và không có dĩa!", "eng": "Somehow I seem to have two knives and no fork!"}, {"viet": "Những công việc nhàm chán trong nhà máy.", "eng": "Soul-destroying jobs in the factory."}, {"viet": "Bóp kem đánh răng ra khỏi ống.", "eng": "Squeeze toothpaste out of a tube."}, {"viet": "Tuy vậy, vẫn có quán rượu cho mọi loại đàn ông, từ thành phố thời thượng đến miền quê đơn sơ, và vẫn có đàn ông cho mọi loại kiểu quán rượu.", "eng": "Still, there's a pub for every type of man, from the city sophisticate to the rural primitive, and a man for every type of pub."}, {"viet": "Những tiếng xì xào kì lạ vẳng nghe quanh khu trại.", "eng": "Strange whispers wandered about the camp."}, {"viet": "Một vụ vi phạm như thế sẽ bị phạt lập tức.", "eng": "Such an offence will lead to a summary fine."}, {"viet": "Ánh sáng mặt trời rọi vào phòng qua một khe hở nơi những màn cửa.", "eng": "Sunlight entered the room through a chink in the curtains."}, {"viet": "Những triệu chứng có ít giá trị chẩn đoán.", "eng": "Symptoms that were of little diagnostic value."}, {"viet": "Đưa bạn gái về nhà để gặp cha mẹ mình.", "eng": "Taking his girl home to meet his parents."}, {"viet": "Kể tin tức của anh đi; tôi đang lắng nghe đây.", "eng": "Tell me your news; I'm all ears."}, {"viet": "Xin cám ơn sự giúp đỡ của anh, anh thật là một chiến hữu.", "eng": "Thanks for helping, you're a real trouper."}, {"viet": "Cuốn sách đó là nguồn thông tin tốt.", "eng": "That book is a good source of information."}, {"viet": "Cái điện thoại quỷ đó không ngừng reo suốt cả ngày!", "eng": "That infernal telephone hasn't stopped ringing all day!"}, {"viet": "Tiếng ồn ấy khiến tôi phát điên lên.", "eng": "That noise is making me go crazy."}, {"viet": "Cửa hàng đó có nhiều mặt hàng hấp dẫn.", "eng": "That shop has a lot of interesting items."}, {"viet": "Thằng nhóc ấy thật là bất trị.", "eng": "That young lad is quite a handful."}, {"viet": "Bị cáo được tạm tự do để chờ xét xử sau khi đã nộp bảo lãnh ( 1000 pao ).", "eng": "The accused was released on bail ( of 1000 pounds ) pending trial."}, {"viet": "Chiếc máy bay hạ cánh êm nhẹ.", "eng": "The aircraft made a smooth landing."}, {"viet": "Những vết hình vòng trên thân cây cho biết tuổi của nó.", "eng": "The annular markings on a tree indicate its age."}, {"viet": "Quân đội tuần tra khu vực đó từng giờ.", "eng": "The army make hourly patrols of the area."}, {"viet": "Khán giả nồng nhiệt vỗ tay tán thưởng bài diễn văn của bà ấy.", "eng": "The audience clapped her speech enthusiastically."}, {"viet": "Đứa bé bú cạn hết chai sữa một cách thỏa mãn.", "eng": "The baby sucked at its bottle contentedly."}, {"viet": "Ngân hàng từ chối không giúp đỡ công ty do đó công ty bị phá sản.", "eng": "The bank refused to help the company consequently, it was bankrupt."}, {"viet": "Vẻ đẹp của sơ đồ đó chủ yếu là sự giản dị của nó.", "eng": "The beauty of the plan consists in its simplicity."}, {"viet": "Những con chim chuyền từ cành này sang cành khác.", "eng": "The birds flitted from branch to branch."}, {"viet": "Đường nét rõ ràng sắc cạnh của ngọn núi in lên nền trời.", "eng": "The bold outline of a mountain against the sky."}, {"viet": "Trạng thái chập chờn nửa ngủ nửa thức.", "eng": "The borderland between sleeping and waking."}, {"viet": "Phanh bị kẹt, làm cho chiếc xe ô tô bị trượt.", "eng": "The brakes locked, causing the car to skid."}, {"viet": "Tòa nhà đó đã bị một quả đạn pháo phá hủy.", "eng": "The building was destroyed by an artillery shell."}, {"viet": "Tiếng lạo xạo nhịp nhàng của những đôi ủng trên than.", "eng": "The cadenced crunch of boots on cinder."}, {"viet": "Chiếc xe có dấu hiệu bị gỉ.", "eng": "The car has developed signs of rust."}, {"viet": "Toa xe hành khách lật và những hành khách bị văng ra ngoài.", "eng": "The carriage overturned and the passengers were pitched out."}, {"viet": "Đơn vị xử lý trung tâm trong một máy tính.", "eng": "The central processing unit in a computer."}, {"viet": "Tấm séc đã đưa để thanh toán ngày 21 tháng 3.", "eng": "The cheque was presented for payment on 21 March."}, {"viet": "Đứa trẻ bị nôn sau khi ăn phải thịt ôi.", "eng": "The child vomited after eating the bad meat."}, {"viet": "Bọn trẻ con được tự do quyết định sơn phòng chúng màu gì.", "eng": "The children have free swing in deciding what colour to paint their room."}, {"viet": "Bọn trẻ con đang chơi trò bán hàng.", "eng": "The children were playing at keeping shop."}, {"viet": "Tiếng lách cách của que đan.", "eng": "The clack of the knitting needles."}, {"viet": "Sự phối hợp công việc của nhiều người.", "eng": "The co-ordination of the work of several people."}, {"viet": "Sĩ quan chỉ huy trông đợi một sự phục tùng tuyệt đối của binh sĩ.", "eng": "The commanding officer expected unquestioning obedience from his men."}, {"viet": "Công ty từ nay sẽ được gọi là Johnson và Brown.", "eng": "The company henceforth be known as Johnson and Brown."}, {"viet": "Người ta đã phải dỗ dành mãi nó mới thú nhận.", "eng": "The confession had to be cajoled out of him."}, {"viet": "Cái nồi nấu đang toả ra một mùi kỳ lạ.", "eng": "The cooker is giving off a funny smell."}, {"viet": "Quốc gia đó là cường quốc hải quân hùng mạnh trong nhiều thế kỉ qua.", "eng": "The country was a great naval power in past century."}, {"viet": "Những con dế không ngừng phát ra tiếng gáy inh ỏi đều đều đầy ý nghĩa của chúng.", "eng": "The crickets stridulated their everlasting monotonous meaningful."}, {"viet": "Chim cu cu là dấu hiệu mùa xuân.", "eng": "The cuckoo is a harbinger of spring."}, {"viet": "Những tấm màn sẫm màu có nét tương phản rất hay với những bức tường màu sáng hơn.", "eng": "The dark curtains make an interesting counterpoint to the lighter walls."}, {"viet": "Các đại biểu phải được ngồi theo nghi thức lễ tân.", "eng": "The delegates have to be seated according to protocol."}, {"viet": "Anh ta chơi piano với tài khéo léo.", "eng": "The dexterity with which he plays the piano."}, {"viet": "Máy rửa bát đã làm mất dần nước men đồ sứ.", "eng": "The dishwasher has worn the glaze off the china."}, {"viet": "Bác sĩ bảo nó phải rửa mắt hai lần một ngày.", "eng": "The doctor told him to bathe his eyes twice a day."}, {"viet": "Con chó đớp thức ăn ngay ở tay anh ta.", "eng": "The dog snaps the food right out of his hand."}, {"viet": "Người lái xe bấm còi inh ỏi để tôi tránh đường.", "eng": "The driver honked at me to get out of the way."}, {"viet": "Thủy triều lên xuống cửa biển.", "eng": "The ebb and flow of the sea."}, {"viet": "Quân địch đã bỏ qua phòng tuyến của chúng tôi.", "eng": "The enemy brushed aside our defenses."}, {"viet": "Tên tù vượt ngục cuối cùng đã bị vây chặt.", "eng": "The escaped prisoner was cornered at last."}, {"viet": "Kinh nghiệm đó đã biến anh ấy thành một người buồn bã và cay đắng.", "eng": "The experience has turned him into a sad and embittered man."}, {"viet": "Một chứng cớ ngoại phạm giả đã đánh lạc hướng cảnh sát.", "eng": "The false alibi threw the police off the scent."}, {"viet": "Phà khởi hành đi Pháp lúc một giờ.", "eng": "The ferry leaves for France at one o'clock."}, {"viet": "Cuốn phim đó được quay bằng phim trắng đen.", "eng": "The film was shot in black and white."}, {"viet": "Công ty đã tặng bà ta một món tiền thưởng hậu hỉđể mua chuộc bà ta.", "eng": "The firm offered her a generous bonus as a sweetener."}, {"viet": "Năm phạm trù của Trung Quốc là kim, mộc, thuỷ, hoả, thổ.", "eng": "The five categories of China are metal wood, water, fire, and earth."}, {"viet": "Con đường mòn bắt đầu ở cuối một con đường hẹp không trải đá.", "eng": "The footpath begins at the end of a narrow unmade road."}, {"viet": "Những cây ăn quả mọc dựa vào bức tường của khu vườn.", "eng": "The fruit trees grew against the garden wall."}, {"viet": "Khu vườn nằm trong tình trạng hoàn toàn bị bỏ bê.", "eng": "The garden was in a state of total neglect."}, {"viet": "Ánh sáng phản chiếu của đồ đồng đánh bóng trong ánh lửa.", "eng": "The gleam of polished brassware in the firelight."}, {"viet": "Chính phủ đang tìm cách làm giảm sự dính líu của họ trong vụ đó.", "eng": "The government are trying to play down their involvement in the affair."}, {"viet": "Chính phủ đang tìm cách bưng bít vụ tai tiếng đó.", "eng": "The government is trying to cover up the scandal."}, {"viet": "Đồ thị biểu diễn ngang dần dần sau khi tụt xuống hẳn.", "eng": "The graph flatten out gradually after a steep fall."}, {"viet": "Người bảo vệ bị thương ở chân.", "eng": "The guard was wounded in the leg."}, {"viet": "Vụ mùa đã được thu hoạch an toàn.", "eng": "The harvest has been safely gathered in."}, {"viet": "Tiền lương cao làm cho tôi cam chịu sống ở nước ngoài.", "eng": "The high salary reconciled me to living abroad."}, {"viet": "Con tin đó bị súng nhắm ngay vào đầu.", "eng": "The hostage had a rifle levelled at his head."}, {"viet": "Căn nhà được đem ra bán.", "eng": "The house is up to sale."}, {"viet": "Ý tưởng về các món quà tặng trong lễ Giáng Sinh có lẽ xuất phát từ câu chuyện về ba nhà thông thái.", "eng": "The idea of gifts at Christmas time may have come from the story of the tree Wise Men."}, {"viet": "Sự tiêm nhiễm những hệ tư tưởng nguy hiểm vào giới trẻ.", "eng": "The infection of young people with dangerous ideologies."}, {"viet": "Những đường ngoằn ngoèo phức tạp trong một mê lộ.", "eng": "The intricate windings of a labyrinth."}, {"viet": "Nhà báo không chịu tiết lộ người đã cung cấp tin tức cho mình là ai.", "eng": "The journalist did not want to reveal the identity of his informant."}, {"viet": "Bọn bắt cóc đòi một số tiền chuộc là 10.000 pao để thả người bị bắt.", "eng": "The kidnappers demanded a ransom of 10000 pounds for his release."}, {"viet": "Đề cương giảng dạy ngôn ngữ cần phải được tu chỉnh kỹ càng và đầy đủ.", "eng": "The language syllabus needs to be completely overhauled."}, {"viet": "Vị lãnh đạo này ít khi xuất hiện trước công chúng.", "eng": "The leader rarely shows herself in public."}, {"viet": "Thang máy bị pan, thế là chúng tôi bị kẹt ở bên trong.", "eng": "The lift broke down and we were trapped inside."}, {"viet": "Cuộc leo trèo lâu đó đã làm chúng tôi vã mồ hôi.", "eng": "The long climb made us sweat."}, {"viet": "Tạp chí trở nên quá liên quan tới chính trị.", "eng": "The magazine had become too politically oriented."}, {"viet": "Ông bầu đã cổ vũ đội của mình lúc nghỉ giải lao.", "eng": "The manager gave his team a peptalk at half time."}, {"viet": "Nhiệt độ, điện thế, âm lượng tối đa.", "eng": "The maximum temperature, voltage, volume."}, {"viet": "Kỷ niệm đó vẫn sống mãi trong tâm hồn tôi.", "eng": "The memory will live in my heart forever."}, {"viet": "Ông bộ trưởng được trao toàn quyền trong các cuộc đàm phán về mậu dịch.", "eng": "The minister was given plenipotentiary powers in the trade negotiations."}, {"viet": "Mặt trăng là vệ tinh của trái đất.", "eng": "The moon is the satellite of the earth."}, {"viet": "Sự chuyển động của lồng ngực khi ông ta thở.", "eng": "The movement of his chest as he breathes."}, {"viet": "Nhu cầu về các thương nhân và chủ ngân hàng chỉ là một lý do giải thích cho sự phát triển của các thành phố tại châu Âu.", "eng": "The need for merchants and bankers was one reason for the growth of cities in Europe."}, {"viet": "Đạo luật mới có phần nào không công bằng đối với những người sinh ở nước ngoài.", "eng": "The new law is a bit hard on those who were born abroad."}, {"viet": "Các định thuế mới đã đặt một thòng lọng vào thương nghiệp của chúng ta.", "eng": "The new tariffs have put a stranglehold on our trade."}, {"viet": "Người kế sau mà nói thì sẽ bị phạt.", "eng": "The next person to speak will be punished."}, {"viet": "Số vụ trộm trong khu vực hình như có chiều hướng tăng lên.", "eng": "The number of burglaries in the area seems to be on the increase."}, {"viet": "Viên sĩ quan ra lệnh cho binh sĩ tiến lên.", "eng": "The officer ordered the men to advance."}, {"viet": "Bà lão sang đường chậm rãi từng bước.", "eng": "The old woman crossed the road at a snail's pace."}, {"viet": "Những đĩa gốc được cất ở chỗ an toàn.", "eng": "The original disks are locked away safely."}, {"viet": "Lâu đài trang hoàng lộng lẫy.", "eng": "The palace was rich in ornament."}, {"viet": "Con đường đó đi xuyên qua cây cối đến dòng sông.", "eng": "The path led through the trees to the river."}, {"viet": "Dân làng anh hiếu khách đối với tôi.", "eng": "The people of your village showed me great hospitality."}, {"viet": "Bản sonat dương cầm được trình diễn quá tồi.", "eng": "The piano sonata was badly executed."}, {"viet": "Kế hoạch này, xuất sắc về quan niệm, song đã thất bại vì chuẩn bị không chu đáo.", "eng": "The plan, brilliant in its conception, failed because of inadequate preparation."}, {"viet": "Trung đội được cử đi trinh sát ngôi làng trước khi tấn công.", "eng": "The platoon was sent to reconnoitre the village before the attack."}, {"viet": "Thuốc độc đã ngấm vào cơ thể của ông ta.", "eng": "The poison has passed into his system."}, {"viet": "Cảnh sát đã buộc bà ta phải thú nhận.", "eng": "The police have got a confession out of her."}, {"viet": "Viên cảnh sát quật ngã tên trộm xuống đất bằng một thế gạt.", "eng": "The policeman brought the thief to the ground with a flying tackle."}, {"viet": "Thời kỳ mở rộng kinh tế sau chiến tranh.", "eng": "The post-war period of economic expansion."}, {"viet": "Hai bên xe ô tô của tổng thống có những người đi mô-tô hộ tống.", "eng": "The President's car was flanked by motor-cycle outriders."}, {"viet": "Giá cả tăng tương ứng với chi phí sản xuất tăng.", "eng": "The price increases are proportionate to the increases in the costs of production."}, {"viet": "Tên tù khẩn nài viên chánh án khoan hồng.", "eng": "The prisoner besought the judge for mercy."}, {"viet": "Lợi nhuận được chia ra đều giữa những người có cổ phần.", "eng": "The profits are shared out equally among the partners."}, {"viet": "Bác sĩ tâm thần đã nghiên cứu nhiều người mắc chứng ám ảnh.", "eng": "The psychiatrist has done a lot of work with obsessives."}, {"viet": "Nữ hoàng đã phê chuẩn đạo dự luật.", "eng": "The Queen has given her assent to the bill."}, {"viet": "Mùi tanh tưởi của cống rãnh dơ bẩn.", "eng": "The rancid stench of dirty drains."}, {"viet": "Trọng tài tuyên bố anh ấy đã bị thua đo ván ở hiệp thứ nhất.", "eng": "The referee counted him out in the first round."}, {"viet": "Sự yêu cầu được diễn đạt bằng lời lẽ lịch sự.", "eng": "The request was couched in polite terms."}, {"viet": "Người giàu nên giúp người nghèo.", "eng": "The rich should help the poor."}, {"viet": "Con đường đó đi ngoằn ngoèo qua dãy núi.", "eng": "The road snakes its way through the mountains."}, {"viet": "Những căn phòng ở bên này khách sạn có quang cảnh rất đẹp.", "eng": "The rooms on this side of the hotel have a lovely view."}, {"viet": "Các thủy thủ leo lên giàn dây.", "eng": "The sailors climbed up into the rigging."}, {"viet": "Hàng năm trường thu nhận sáu mươi học viên nam nữ.", "eng": "The school admits sixty new boys and girls every year."}, {"viet": "Người thư kí dẫn anh ta vào phòng.", "eng": "The secretary brought him into the room."}, {"viet": "Ngân hàng Anh bao mua hết các cổ phần.", "eng": "The shares were underwritten by the Bank of England."}, {"viet": "Chiếc tàu bị đắm trên rặng san hô ngầm.", "eng": "The ship was wrecked on a coral reef."}, {"viet": "Cảnh đau đớn về thể xác luôn luôn làm tôi lo lắng.", "eng": "The sight of physical suffering always upsets me."}, {"viet": "Người nô lệ phủ phục trước chủ.", "eng": "The slave prostrated himself before his master."}, {"viet": "Binh lính tiến lên trong đội hình dày đặc.", "eng": "The soldiers advanced in close formation."}, {"viet": "Những phẩm chất về không gian của phòng hoà nhạc mới.", "eng": "The spatial qualities of the new concert hall."}, {"viet": "Sân khấu được thiết kế để mô phỏng một phòng giam trong nhà tù.", "eng": "The stage was designed to imitate a prison cell."}, {"viet": "Cơn bão gây ra sự trục trặc đang kể trong giao thông đường không.", "eng": "The storm caused considerable dislocation of air traffic."}, {"viet": "Khi kết quả kỳ thi được thông báo, các sinh viên xúm xít lại.", "eng": "The students thronged forward as the exam results were announced."}, {"viet": "Bề mặt của một hình cầu, quả bóng, trái đất.", "eng": "The surface of a sphere, a ball, the earth."}, {"viet": "Thầy giáo phát sách cho học sinh.", "eng": "The teacher distributed the books to the children."}, {"viet": "Máy điện thoại ở dưới chân cầu thang.", "eng": "The telephone is at the bottom of the stairs."}, {"viet": "Tên trộm đã bị thám tử của khách sạn tóm được.", "eng": "The thief was caught by the hotel dick."}, {"viet": "Đứa bé chập chững định đi nhưng cứ ngã mãi.", "eng": "The toddler tried to walk but kept falling down."}, {"viet": "Sự làm việc căng thẳng mấy ngày qua khiến anh tỏ vẻ bực dọc.", "eng": "The train of the past. few days has mad you mentally unbalanced."}, {"viet": "Quân lính hoàn toàn mất tinh thần vì thất bại này.", "eng": "The troops were thoroughly demoralized by this set-back."}, {"viet": "Hai đảng đối lập không có chung những điểm tương đồng.", "eng": "The two rival parties have no common ground between them."}, {"viet": "Sự chịu đựng nỗi đau đớn khổ sở không cần thiết.", "eng": "The unnecessary infliction of pain and suffering."}, {"viet": "Quang cảnh đập vào mắt chúng tôi ở trên đỉnh đồi.", "eng": "The view that greeted us at the top of the hill."}, {"viet": "Số quần áo đã được giặt mà nhân viên giặt quần áo mang đến cho tôi tối qua không sạch.", "eng": "The washed clothes the valet sent me last night are not clean."}, {"viet": "Ở đây người da trắng không hoà nhập về mặt xã hội với người bản xứ.", "eng": "The white people here don't mix socially with the natives."}, {"viet": "Rượu tại buổi liên hoan chảy như suối.", "eng": "The wine flowed like water at the party."}, {"viet": "Những người thợ đã đe doạ đình công.", "eng": "The workers have threatened to withdraw their labour."}, {"viet": "Cây củi Giáng Sinh vẫn còn quan trọng tại nhiều nơi", "eng": "The Yule log is still important in many places."}, {"viet": "Công việc của họ là bảo vệ tài sản của công ty.", "eng": "Their job is to protect the property of the company."}, {"viet": "Vậy thì cháu sẽ làm món sukiyaki cho bác.", "eng": "Then, I'll make sukiyaki for you."}, {"viet": "Cứ mỗi giờ 20 phút là có một chuyến xe buýt.", "eng": "There's a bus at twenty minutes past the hour."}, {"viet": "Mưa nhiều quá cây trồng thối rữa trên cánh đồng.", "eng": "There's been so much rain the crops are rotting in the fields."}, {"viet": "Có một số cảnh vật đẹp trong vùng chúng tôi.", "eng": "There's some beautiful scenery in our neighbourhood."}, {"viet": "Vàng và bạc có nhiều giá trị khác nhau.", "eng": "There are many different qualities of gold and silver."}, {"viet": "Phải nhặt rau, hâm xúp, lại còn phải bày bàn và ướp lạnh rượu nữa.", "eng": "There are the vegetables to peel and the soup to heat, then there's the table to lay and the wine to cool."}, {"viet": "Năm nay đã có 3 trường hợp học sinh bị đuổi học.", "eng": "There have been three expulsions from the school."}, {"viet": "Có sự ác cảm giữa hai người này.", "eng": "There is an antipathy between these two persons."}, {"viet": "Vẫn còn một khả năng mỏng manh là thời tiết sẽ tốt lên.", "eng": "There is still an off chance that the weather will improve."}, {"viet": "Có một sự lộn xộn ở nhà ga và một số người chúng tôi lên lầm tàu.", "eng": "There was a mix-up at the station and some of us got on the wrong train."}, {"viet": "Khi chúng tôi đến thì thực phẩm vẫn còn dồi dào.", "eng": "There was still an abundance of food when we arrived."}, {"viet": "Chẳng bao lâu nữa sẽ có khoai tây mới ở các cửa hàng.", "eng": "There will be new potatoes around in the shops soon."}, {"viet": "Những công sự này được xây dựng trong cuộc chiến tranh vừa qua.", "eng": "These fortifications were all built during the last war."}, {"viet": "Những túp nhà ổ chuột này là một ô nhục đối với thành phố.", "eng": "These slums are a disgrace to the city."}, {"viet": "Họ đã chỉ định một hội đồng để phân xử giữa ban điều hành và nghiệp đoàn.", "eng": "They've appointed a committee to arbitrate between the management and unions."}, {"viet": "Họ đang đấu tranh với các ông chủ để đòi tăng tiền lương.", "eng": "They are battling with their employers for a pay-rise."}, {"viet": "Họ van nài anh ta giải thích nhưng anh ấy cứ im thin thít.", "eng": "They begged him to explain, but he remained dumb."}, {"viet": "Chúng có thể giúp họ đi săn.", "eng": "They could help hunt."}, {"viet": "Họ tiếp đãi bạn bè trên một qui mô lớn.", "eng": "They entertain friends on a the large scale."}, {"viet": "Họ phải đục băng thành bậc khi leo lên.", "eng": "They had to cut steps in the ice as they climbed."}, {"viet": "Họ hôn nhau một cách thích thú không biết ngượng.", "eng": "They kissed each other with unashamed delight."}, {"viet": "Họ có thể để chúng ta vay một ít tiền nhưng một triệu bảng thì dứt khoát là không.", "eng": "They might consider lending us borrow a little money, but a million pounds is a definite no-no."}, {"viet": "Chúng tôi len lỏi qua tầng cây thấp.", "eng": "They pushed their way through the undergrowth."}, {"viet": "Họ phục vụ thịt gà làm món chính.", "eng": "They served chicken as the main course."}, {"viet": "Chúng nó định rời khỏi cửa hàng ăn mà không thanh toán ( bữa ăn của chúng ).", "eng": "They tried to leave the restaurant without paying ( for their meal )."}, {"viet": "Chúng bị đuổi ra khỏi quán rượu vì làm ầm ĩ quá đáng.", "eng": "They were chucked out of the pub for being too rowdy."}, {"viet": "Họ đưa nó đi nhanh tới Luân Đôn trên một chiếc máy bay.", "eng": "They whisked him off to London in an aeroplane."}, {"viet": "Sự sắp xếp ấy sẽ phải thực hiện trong lúc này.", "eng": "This arrangement will have to do pro tem."}, {"viet": "Ông cho rằng, lục địa này đã từng nằm ở phía tây của những cây cột trụ của Hercules, cổng đi vào biển Địa Trung Hải.", "eng": "This continent, he said, had been west of the Pillars of Hercules, the gateway into the Mediterranean Sea."}, {"viet": "Phim này có liên quan tới điều chúng ta học về kim loại tuần trước.", "eng": "This film relates to what we were learning about metals last week."}, {"viet": "Tôi là Phương Cương, bạn học cũ của anh ấy.", "eng": "This is Feng Gang, his former classmate."}, {"viet": "Công việc này xứng với năng lực ông ta.", "eng": "This job is commensurate with his abilities."}, {"viet": "Tờ giấy bạc này là giả, nhưng tờ kia là thật.", "eng": "This note is counterfeit, but that one's good."}, {"viet": "Công thức này đủ dùng cho năm khẩu phần.", "eng": "This recipe will be enough for five servings."}, {"viet": "Va-li này nên để lên giá.", "eng": "This suitcase should go on the rack."}, {"viet": "Đó là chỗ tốt nhất nhưng đắt kinh khủng.", "eng": "Those are the very best seats, but awfully expensive."}, {"viet": "Thuốc lá cùng với rượu đều bị đánh thuế ở hầu hết các nước.", "eng": "Tobacco is taxed in most countries, along with alcohol."}, {"viet": "Giao thông ở các thành phố lớn do đèn chỉ huy.", "eng": "Traffic in large towns is controlled by lights."}, {"viet": "Các kim loại khác nhau được dùng để chế tạo các bộ phận của cỗ máy này.", "eng": "Various metals are used to make the parts of this machine."}, {"viet": "Nước rỉ ra qua trần hầm.", "eng": "Water seeping through the roof of the tunnel."}, {"viet": "Chúng tôi sẽ gửi ngay đến cho các ông một số khăn ăn khác.", "eng": "We'll send you up some other napkins immediately."}, {"viet": "Chúng ta rơi vào tình thế nan giải trong các cuộc thương lượng này-rất có thể chúng không đạt kết quả gì.", "eng": "We're on a sticky wicket with these negotiations-they could very well fail."}, {"viet": "Chúng ta phải thực tế và chỉ mua những gì có thể làm được thôi.", "eng": "We've got to be practical and buy only what we can afford."}, {"viet": "Chúng ta cũng có một vài cơ không dính vào xương.", "eng": "We also have some muscles that are not fastened to bones."}, {"viet": "Chúng tôi xin lỗi, nhưng vì có một lỗi đánh máy trong hóa đơn số Cc777 đề ngày 8 tháng ba của chúng tôi.", "eng": "We are sorry, but there is a typing mistake in our invoice No. Cc777 of March 8."}, {"viet": "Chúng tôi không thể có đủ chỗ để đặt thêm một chiếc ghế nào vào trong phòng cả.", "eng": "We can't fit any more chairs into the room."}, {"viet": "Chúng tôi tổ chức lễ kỉ niệm ngày sinh của anh ta.", "eng": "We celebrate the anniversary of his birth."}, {"viet": "Chúng ta không cảm thấy áp suất của không khí trên thân thể của chúng ta bởi vì áp suất từ bên trong đẩy ra lớn bằng áp suất ở bên ngoài.", "eng": "We do not feel the pressure of the air on our bodies because the pressure from the inside outward is as great as the pressure on the outside."}, {"viet": "Chúng tôi thấy mình bị kẻ thù áp đảo với quân số đông hơn hẳn.", "eng": "We found ourselves hopelessly outnumbered by the enemy."}, {"viet": "Chúng tôi phải vạch lối qua những cành cây ngổn ngang.", "eng": "We had to cut our way through a tangle of branches."}, {"viet": "Hai mươi năm trời chúng tôi sống trong cùng ngôi nhà ấy.", "eng": "We have lived in the same house for twenty years."}, {"viet": "Chúng tôi hy vọng quý vị có thể giảm giá cho chúng tôi 3% trên bất cứ đơn đặt hàng nào hơn 100 kiện.", "eng": "We hope you can grant us a 3% discount for any order of more than 100 bales."}, {"viet": "Chúng tôi nhìn vào hình phản chiếu trong hồ.", "eng": "We looked at our reflections in the lake."}, {"viet": "Chúng ta cần đưa trật tự gọn gàng vào lề lối làm việc văn phòng của chúng ta.", "eng": "We must introduce some system into your office routine."}, {"viet": "Chúng tôi gợi ý cô ấy làm một việc nhưng cô ấy từ chối.", "eng": "We offered her a job but she turned it down."}, {"viet": "Chúng tôi coi anh ta là sinh viên thông minh nhất.", "eng": "We regard him as our cleverest student."}, {"viet": "Chúng ta không nên kéo dài cuộc tranh luận vô bổ của chúng ta nếu không chúng ta sẽ phí thời giờ.", "eng": "We shouldn't last our barren discussion or waste our time."}, {"viet": "Trước đây chúng tôi sống ở một làng nhưng hiện nay chúng tôi sống ở một thành phố.", "eng": "We used to live in a village, but now we live in a city."}, {"viet": "Chúng tôi bị ngắt ( điện thoại ) khi đang dở câu chuyện.", "eng": "We were cut off in the middle of our conversation."}, {"viet": "Chúng tôi sẽ đi hoặc không đi còn tuỳ theo hoàn cảnh.", "eng": "We will go or we won't, according to circumstances."}, {"viet": "Thế đấy, quan trọng nhất là chúng ta không còn thì giờ rỗi nữa.", "eng": "Well, first of all we can't possibly spare the time."}, {"viet": "À, kiểu của nó hay hơn và màu sắc sáng hơn.", "eng": "Well, the design is more interesting and the colours are brighter."}, {"viet": "Jun, thành phố nơi bạn sinh ra tên gì?", "eng": "What's the name of the city where you were born, Jun?"}, {"viet": "Những lí lẽ thuận và chống của thư điện tử là gì?", "eng": "What are the pros and cons of e-mail?"}, {"viet": "Bạn cảm thấy thích ăn gì?", "eng": "What do you feel like having?"}, {"viet": "Những điều tôi đã nói về Smith cũng thích hợp cả với anh nữa đấy.", "eng": "What I said about Smith goes for you, too."}, {"viet": "Ở Nhật Bản, ý nghĩa của các độ tuổi 3,5 và 7 là gì?", "eng": "What is the significance of the ages 3, 5, and 7 in Japan?"}, {"viet": "Bạn thích nhất kiểu xe hơi nào?", "eng": "What model of car is your favorite?"}, {"viet": "Buổi sáng cậu đến xưởng lúc mấy giờ?", "eng": "What time do you get to work in the morning?"}, {"viet": "Khi nào tôi có thể nhận lại quần áo giặt ủi của tôi?", "eng": "When can I have my laundry back?"}, {"viet": "Khi tôi ngừng ma tuý tôi thấy nôn nao.", "eng": "When I gave up smoking, I went cold turkey."}, {"viet": "Khi nói về buổi trình diễn, bà ta không nhịn được nói cạnh khoé đến ban nhạc.", "eng": "When talking about the performance, she couldn't resist talking a side-swipe at the orchestra."}, {"viet": "Khi chúng ta thắng lợi.", "eng": "When we shall achieve success, When success shall be achieved."}, {"viet": "Bạn đã đi đâu trong kì nghỉ vừa rồi?", "eng": "Where did you go for your last vacation?"}, {"viet": "Bạn thích loài nào hơn, chó hay mèo?", "eng": "Which do you prefer, dogs or cats?"}, {"viet": "Trong khi một trong những tên cướp trò chuyện với người bảo vệ thì một tên khác bò vào nhà máy.", "eng": "While one of the robbers engaged the guard in conversation, the other crept into the factory."}, {"viet": "Ai ngủ muộn sáng nay thế?", "eng": "Who overslept this morning?"}, {"viet": "Tại sao sau khi tắm xong anh không bao giờ tháo nước đi?", "eng": "Why don't you ever run the water off after you've had a bath?"}, {"viet": "Kế hoạch mới này sẽ được chấp nhận hơn những kế hoạch trước không nhỉ?", "eng": "Will the new plan be anymore acceptable than its predecessor?"}, {"viet": "Xin cho tôi biết bạn không thích khía cạnh nào của Nhật?", "eng": "Will you tell me what aspects of Japan you do not like?"}, {"viet": "Với một quả tim yếu như thế cô ta may mà qua được ( ca mổ ).", "eng": "With such a weak heart she was lucky to come through ( the operation )."}, {"viet": "Cô có thể cho thêm hai cái ghế và hai cái tách được không?", "eng": "Would it be possible to have two chairs and two cups?"}, {"viet": "Bà có muốn dùng trà ngay bây giờ không, thưa bà?", "eng": "Would you like to have your tea now, madam?"}, {"viet": "Đề nghị ông tính đôi giầy này vào tài khoản riêng của tôi, được chứ?", "eng": "Would you put these shoes down to my account, please?"}, {"viet": "Vâng, tôi sắp rời đây đi Mỹ và tôi vẫn còn một ít nhân dân tệ.", "eng": "Yes, I'm leaving for America and still have some RMB with me."}, {"viet": "Vâng, thưa ngài cảnh sát, tôi trông thấy người đàn ông lại gần cô gái'.", "eng": "Yes officer, I saw the man approach the girl'."}, {"viet": "Anh phải vất vả mới đến đấy được vào lúc chín giờ.", "eng": "You'll have your work cut out getting there by nine o'clock."}, {"viet": "Tôi phải nói là hôm nay anh tự phụ, tự mãn lắm.", "eng": "You're very full of yourself today, I must say."}, {"viet": "Anh cần phải có mặt ngay ở phòng giám đốc.", "eng": "You are wanted immediately in the director's office."}, {"viet": "Ông luôn luôn có thể hỏi người bán vé.", "eng": "You can always ask the man who sells the tickets."}, {"viet": "Ông có thể đi du lịch vòng quanh Trung Quốc nếu ông thích.", "eng": "You can take a tour around China, if you like."}, {"viet": "Anh không đọc một cuốn tiểu thuyết nào hết sao?", "eng": "You don't read any novels at all?"}, {"viet": "Anh có ý kiến của anh và tôi có ý kiến của tôi.", "eng": "You have your opinion and I have mine."}, {"viet": "Ông có thể rút tiền bất cứ lúc nào và ông chỉ cần đưa ra sổ gửi tiền và phiếu rút tiền mà thôi.", "eng": "You may withdraw the money at any time and you just need to present your deposit book and a withdrawal slip."}, {"viet": "Anh phải xuất trình vé tại cửa chắn.", "eng": "You must show your ticket at the barrier."}, {"viet": "Anh biết không, tôi chỉ mới đến đây vài ngày thôi.", "eng": "You see, i've been here just a few days."}, {"viet": "Anh không nên tìm cách tự thanh minh cho mình.", "eng": "You shouldn't attempt to justify yourself."}, {"viet": "Quý vị sẽ tìm thấy lời hướng dẫn về quy tắc an toàn trên máy bay, trong cái túi để trước mặt quý vị.", "eng": "You will find information about safety procedures in the pocket in front of you."}, {"viet": "Những số liệu của anh về ngân sách năm nay là rất đúng.", "eng": "Your budget figures were spot-on this year."}, {"viet": "Câu trả lời hôm nay của anh hoàn toàn mâu thuẫn với những điều anh đã nói tuần trước.", "eng": "Your reply today is in direct contradiction to what you said last week."}]