[{"viet": "Một đứa bé bị cái gối làm ngộp thở.", "eng": "A baby stifled by a pillow."}, {"viet": "Sâu là ấu trùng của con bướm.", "eng": "A caterpillar is the larva of a butterfly."}, {"viet": "Một cộng đồng thể hiện những lý tưởng của các vị sáng lập của nó.", "eng": "A community that incarnates its founders'ideals."}, {"viet": "Một cơn bệnh tê liệt đã cột chặt cả cuộc đời ông ta trên một chiếc xe lăn.", "eng": "A crippling disease which sentenced him to a life time in a wheel-chair."}, {"viet": "Một nhóm bất mãn trong quân đội.", "eng": "A discontented section of the army."}, {"viet": "Một hàng rào chạy bao quanh cả cánh đồng.", "eng": "A fence runs round the whole field."}, {"viet": "Một pháo đài không thể bị tấn công.", "eng": "A fortification that is invulnerable to attack."}, {"viet": "Con đường tốt từ London đến Brighton.", "eng": "A good road between London and Brighton."}, {"viet": "Một hải cảng bị các tàu địch phong tỏa.", "eng": "A harbour blockaded by the enemy ships."}, {"viet": "Một túp lều được dựng lên bằng những cành cây.", "eng": "A hut constructed out of branches."}, {"viet": "Một luật sư phải trình bày vụ án mình liên hệ cho rõ ràng tại tòa án.", "eng": "A lawyer must put his case quite clearly in court."}, {"viet": "Nhiều khách hàng tỏ ý không hài lòng bằng cách bước chân của họ ra ngoài vì họ rõ ràng không thích các mặt hàng của chúng tôi.", "eng": "A lot of customers are voting with their feet because they clearly don't like our goods."}, {"viet": "Một người đàn bà có gia đình thường mang tên họ chồng của bà ta.", "eng": "A married woman usually bears her husband's surname."}, {"viet": "Một sự trình diễn cảm động một bài ca Brahms.", "eng": "A moving rendering of a Brahms song."}, {"viet": "Một danh từ làm chức năng của một động từ.", "eng": "A noun performing a verbal function."}, {"viet": "Một tờ tem bưu điện đã được châm lỗ răng cưa để dễ xé ra.", "eng": "A perforated sheet of postage stamps."}, {"viet": "Một bài thơ hoàn toàn truyền đạt được cảm xúc của nhà thơ.", "eng": "A poem that perfectly conveys the poet's feeling."}, {"viet": "Một chương trình về các nhạc sĩ thuộc thế kỷ hai mươi.", "eng": "A programme on twentieth-century musicians."}, {"viet": "Một tổ chức tôn giáo truyền bá cho thanh niên tư tưởng chống lại cha mẹ.", "eng": "A religious organization which indoctrinates young people against their parents."}, {"viet": "Một cuộc vận động bán hàng nhắm vào thị trường thanh niên.", "eng": "A sales campaign targeted at the youth market."}, {"viet": "Một tờ giấy có dấu bút chì vạch chéo nhau.", "eng": "A sheet crisscrossed with pencil marks."}, {"viet": "Một con rắn trườn trên mặt đất.", "eng": "A snake gliding along the ground."}, {"viet": "Một lời tuyên bố hầu như không thể tin được của ai.", "eng": "A statement which stretches one's credulity to the limit."}, {"viet": "Một luống hoa thủy tiên rộng nằm ngang bãi cỏ.", "eng": "A swath of daffodil across the lawn."}, {"viet": "Một khách du lịch với cái máy ảnh quen thuộc của anh ta.", "eng": "A tourist with his inevitable camera."}, {"viet": "Một điểm yếu trong phòng tuyến của NATO.", "eng": "A vulnerable point in NATO's defences."}, {"viet": "Một nhà văn rất sâu sắc và thông thái.", "eng": "A writer of great depth and wisdom."}, {"viet": "Diễn xuất và sự đạo diễn đã tiến được vài nấc theo bảng tiêu chuẩn quen dùng của chúng ta.", "eng": "Acting and direction are several notches up on the standards we are used to."}, {"viet": "Sau một thời gian dài trì hoãn, buổi trình diễn rốt cuộc cũng đã bắt đầu.", "eng": "After a long delay the performance finally started."}, {"viet": "Sau khi loài người học được cách làm nam châm từ thép, họ có thể chế tạo ra được các la bàn tốt hơn.", "eng": "After men learned to make magnets of steel, they could make better compasses."}, {"viet": "Sau trận bão trời trở nên êm ả.", "eng": "After the storm came a calm."}, {"viet": "Mọi chuyến bay đã bị bãi bỏ vì sương mù.", "eng": "All flights have been cancelled because of fog."}, {"viet": "Tất cả các cuộc trò chuyện đều bằng tiếng Anh toàn bộ mục hổ lốn này được đậm đà thêm nhờ chuyện tầm phào mới nhất.", "eng": "All the conversations were in English the whole olla podridas spiced with the latest gossip."}, {"viet": "Bọn trẻ đã ăn khá nhiều số thực phẩm đó rồi.", "eng": "Already the children had made considerable inroads on the food."}, {"viet": "Tai nạn đã cướp mất vợ và con anh ta.", "eng": "An accident which bereaved him of his wife and his child."}, {"viet": "Một sự chỉ trích nặng nề những chủ trương của chính phủ.", "eng": "An attack on the government's policy."}, {"viet": "Một quá trình khai thác ở một mỏ kim cương.", "eng": "An extraction process at a diamond mine."}, {"viet": "Một quả táo héo có vỏ nhăn nheo.", "eng": "An old apple with a wrinkly skin."}, {"viet": "Phân tích các thành phần của một câu.", "eng": "Analysing the component parts of a sentence."}, {"viet": "Anne dễ bị bối rối bởi những câu hỏi lắt léo.", "eng": "Anne is easily ruffled by awkward questions."}, {"viet": "Áp dụng những biện pháp trừng phạt kinh tế đối với một chế độ áp bức.", "eng": "Apply economic sanctions against a repressive regime."}, {"viet": "Anh là người đàn ông hay là con thỏ đế hả?", "eng": "Are you a man or a mouse?"}, {"viet": "Thật sự cô có cảm tình với ông ta không?", "eng": "Are you really serious about him?"}, {"viet": "Hết một đêm thật là hoàn toàn khó chịu.", "eng": "As a night out it was a complete bummer."}, {"viet": "Ngay khi thấy chúng tôi đến chúng nó quay đầu tháo chạy.", "eng": "As soon as they saw us coming they turned tail and ran."}, {"viet": "Vào thời kỳ đầu trong lịch sử của chúng ta.", "eng": "At an early stage in our history."}, {"viet": "Chuyến bay 228 đến tại cổng số mấy?", "eng": "At which gate does flight 228 arrive?"}, {"viet": "Barbados đã từng là thuộc địa của Anh, nhưng bây giờ đã được độc lập.", "eng": "Barbados was once a British colony, but now it's independent."}, {"viet": "Khiêm tốn về những thành quả của ai.", "eng": "Be modest about one's achievements."}, {"viet": "Bản thảo của Beethoven trông giống như một bản ghi chép đẫm máu về một cuộc vật lộn dữ dội trong nội tâm.", "eng": "Beethoven's manuscript looks like a bloody record of a tremendous inner battle."}, {"viet": "Bill, anh có thể cho chúng tôi ý kiến về việc đầu tư cần phải có không?", "eng": "Bill, can you give us some idea of the investment required?"}, {"viet": "Chấp nhận kinh nghiệm nhiều hơn của ai.", "eng": "Bow to somebody's greater experience."}, {"viet": "Đặt hy vọng của ai vào sức mạnh kinh tế của đất nước.", "eng": "Build one's hopes on the economic strength of the country."}, {"viet": "Nhưng tôi nghĩ anh ấy sẽ về ngay thôi.", "eng": "But I think he'll be back soon."}, {"viet": "Nhưng ông không muốn nghe nói về tôi đâu.", "eng": "But you don't want to hear about me."}, {"viet": "À này, có cà phê Trung Quốc không?", "eng": "By the way, is there Chinese coffee?"}, {"viet": "Xin cho cháu uống chút gì đó?", "eng": "Can I have something to drink?"}, {"viet": "Cô có thể đến phòng của tôi được không?", "eng": "Can you come to my room?"}, {"viet": "Anh thực sự có khả năng trả số tiền này không?", "eng": "Can you really afford this amount?"}, {"viet": "Tử hình là một vấn đề gây xúc động.", "eng": "Capital punishment is an emotive issue."}, {"viet": "Những lời buộc tội và những lời phản tố tuôn ra ồn ào tại tòa án.", "eng": "Charges and counter charges volleyed through the courtroom."}, {"viet": "Thảy cho tao tờ báo nếu mày đọc xong rồi.", "eng": "Chuck me over the newspaper if you've finished reading it."}, {"viet": "Kết hợp những tinh hoa của chủ nghĩa xã hội và chủ nghĩa tư bản.", "eng": "Combine the best features of socialism and capitalism."}, {"viet": "Pha thức uống từ rượu seri và nước chanh.", "eng": "Concoct a drink out of sherry and lemon juice."}, {"viet": "Đồng dẫn điện tốt hơn những vật liệu khác.", "eng": "Copper conducts electricity better than other materials do."}, {"viet": "Anh có thể cho tôi biết tôi có thể chuyển đổi tiền của tôi lấy nhân dân tệ Trung Quốc ở đâu được không?", "eng": "Could you please tell me where I can convert my money for Chinese Yuan?"}, {"viet": "Những cửa hiệu đông đúc là nơi thuận lợi cho bọn móc túi.", "eng": "Crowded shops are a happy hunting ground for pick-pockets."}, {"viet": "Cái chết không phải là mối lo sợ đối với tôi.", "eng": "Death holds no terrors for me."}, {"viet": "Mặc cho tất cả những điều làm nản lòng ấy, cô ta nhất định không bỏ cuộc.", "eng": "Despite all these discouragements, she refused to give up."}, {"viet": "Anh có được dịp nào ghé thăm điện Louvre khi ở Paris không?", "eng": "Did you get to see the Louvre while you were in Paris?"}, {"viet": "Các thành viên bất mãn đã bỏ đi lập một đảng mới.", "eng": "Disaffected members have left to form a new party."}, {"viet": "Đừng gấp khăn ăn như lúc ban đầu trừ khi bạn được mời nán lại dùng thêm một bữa ăn nữa.", "eng": "Do not fold your napkin in the original folds unless you are asked to stay for another meal."}, {"viet": "Nhớ đến thăm chúng tôi nếu bạn có dịp đến xứ chúng tôi nhé.", "eng": "Do you come and visit us if you're ever in our part of the world."}, {"viet": "Cháu có trái cây, rau củ, hay cây trồng không?", "eng": "Do you have any fruits, vegetables, or plants?"}, {"viet": "Anh có biết vì sao cửa bị khóa không?", "eng": "Do you know why the door is locked?"}, {"viet": "Cháu có nhìn thấy ngôi nhà có mái màu xanh dương ở đằng kia không, Asami?", "eng": "Do you see the house with the blue roof over there, Asami?"}, {"viet": "Ông muốn loại tài khoản vãng lai hay tài khoản định kỳ?", "eng": "Do you want a current account or a deposit account?"}, {"viet": "Chuyến xe lửa này có đến Boston không?", "eng": "Does this train go to Boston?"}, {"viet": "Đừng bày bừa bộn trên bàn tôi-tôi vừa dọn dẹp xong đó.", "eng": "Don't clutter up my desk-I've just tidied it."}, {"viet": "Đừng tự dối mình-điều đó không dễ đâu nhé!", "eng": "Don't kid yourself-it won't be easy!"}, {"viet": "Đừng có làm cho bạn ăn mất ngon do ăn kẹo giữa các bữa cơm.", "eng": "Don't spoil your appetite by eating sweets between meals."}, {"viet": "Bố có bao giờ thấy bất hạnh không?", "eng": "Don't you ever feel unhappy?"}, {"viet": "Những loại thuốc giúp sống lâu.", "eng": "Drugs that help to prolong life."}, {"viet": "Trứng hiện nay thì có rất nhiều.", "eng": "Eggs are plentiful at the moment."}, {"viet": "Dựng tượng ông vua đó cưỡi ngựa.", "eng": "Erect a statue of the king on a horse."}, {"viet": "Tất cả mọi người đều được đón tiếp, bất luận tuổi tác hoặc nam nữ.", "eng": "Everyone is welcome, regardless of age or sex."}, {"viet": "Xin lỗi vì tôi mạn phép tự giới thiệu.", "eng": "Excuse me for taking the liberty of introducing myself."}, {"viet": "Những sự khác biệt về gia đình, những dòng dõi về xã hội khác nhau, và những điều tương tự.", "eng": "Family differences, differing social origins, and what not."}, {"viet": "Người viết thuận tay trái ít hơn người thuận tay phải.", "eng": "Fewer people write with their left hand than with their right."}, {"viet": "Thứ nhất, ước tính sơ bộ số khách hàng trong khu vực họ phụ trách có quan tâm tới sản phẩm này và thứ hai là thăm dò một hoặc hai giám đốc này-tất nhiên là có tính cách ngoại giao rồi-và tìm hiểu phản ứng của họ.", "eng": "Firstly, to make a rough estimate of the number of customers in their territory who might be interested and secondly, to sound out one or two of these-very diplomatically of course-and find out their reactions."}, {"viet": "Thực phẩm, quần áo và chỗ ở là tất cả những nhu cầu cơ bản của cuộc sống.", "eng": "Food, clothing and shelter are all basic necessities of life."}, {"viet": "Chính thức hóa các công việc chuẩn bị cho cuộc hội nghị.", "eng": "Formalize the arrangements for the conference."}, {"viet": "Những ngân khoản đã được phân bổ cho việc nghiên cứu.", "eng": "Funds that have been ticketed for research."}, {"viet": "Có sự tranh cãi với trọng tài về quyết định của ông ta.", "eng": "Get into an argument with the referee about his decision."}, {"viet": "Phát vào mông ai một cái.", "eng": "Give somebody a smack on the tail."}, {"viet": "Đã vơ vét hết số vé ít ỏi còn lại.", "eng": "Gobbled up the few remaining tickets."}, {"viet": "Khách được mời đến dự tiệc.", "eng": "Guests bidden to attend the feast."}, {"viet": "Có phải con ma xuất hiện hồi gần đây không?", "eng": "Has the ghost manifested itself recently?"}, {"viet": "Ông có bao giờ đến một phòng trưng bày nghệ thuật chưa?", "eng": "Have you ever been to an art gallery?"}, {"viet": "Anh đã quyết định đi nghỉ ở đâu chưa?", "eng": "Have you made up your mind where to go for your holiday?"}, {"viet": "Vậy thì ông ta sẽ phải tìm một thư ký mới ư?", "eng": "He'll be looking for a new secretary then?"}, {"viet": "Anh ta luôn luôn khoác lác về việc anh ta sẽ quản lý xí nghiệp như thế nào.", "eng": "He's always sounding off about how he would manage the firm."}, {"viet": "Ông ta đi khắp các công ty làm rùm beng để thu hút sự quan tâm tới đề án.", "eng": "He's going round firms drumming up interest in the project."}, {"viet": "Anh ấy viết đối thoại không giỏi.", "eng": "He's not very good at writing dialogue."}, {"viet": "Anh ta rất khoác lác về số tiền anh ta kiếm được.", "eng": "He's very boastful about the money he earns."}, {"viet": "Anh ấy và tôi từng là bạn thủy thủ trên một chiếc tàu lưới cá.", "eng": "He and I were shipmates on a trawler once."}, {"viet": "Anh ta mò mẫm quanh phòng để tìm công tắc đèn.", "eng": "He blundered about the room feeling for the light switch."}, {"viet": "Anh ta không thể chạy được vì anh ta bị yếu tim.", "eng": "He cannot run because he has a weak heart."}, {"viet": "Anh ấy không thể nào xóa đi sự kiện đó khỏi ký ức của anh ấy.", "eng": "He could not expunge the incident from his memory."}, {"viet": "Ông ấy làm điều đó hoàn toàn vì lòng tốt chứ không phải vì tiền.", "eng": "He did it entirely out of kindness, not for the money."}, {"viet": "Đêm qua hắn uống quá nhiều.", "eng": "He drank far too much last night."}, {"viet": "Hắn thiếp ngủ trong lúc thuyết giảng.", "eng": "He fell asleep during the sermon."}, {"viet": "Anh ta vụng về cầm lấy trái banh và rồi đánh rơi nó.", "eng": "He fumbled the ball and then dropped it."}, {"viet": "Anh ấy đã chậm trả tiền cho chiếc xe ôtô đó.", "eng": "He got behind with his payments for the car."}, {"viet": "Anh ta không có hứng đánh lộn.", "eng": "He had no appetite for the fight."}, {"viet": "Ông ta có tính rất nóng nảy.", "eng": "He has a very short temper."}, {"viet": "Suốt cả cánh tay của anh ấy đầy những vết trầy trụa.", "eng": "He has open sores all over his arms."}, {"viet": "Anh ta hy vọng sẽ giành lại được tình yêu của cô ấy.", "eng": "He hoped to win her love back."}, {"viet": "Ông ta sẽ nghỉ hưu vào mùa đông tới.", "eng": "He is going to retire next winter."}, {"viet": "Anh ta có phong thái rất Anh.", "eng": "He is very English in his attitudes."}, {"viet": "Hắn nhảy chồm chồm lên chỉ vì giận dữ.", "eng": "He leapt up and down in sheer outrage."}, {"viet": "Anh ta trông giống như một người bị bất tỉnh vì điện 1000 vôn.", "eng": "He looked like a man zapped with 1000 volts."}, {"viet": "Nó đánh dấu buổi ra mắt đầu tiên bằng sự chiến thắng nhà vô địch.", "eng": "He marked his début by beating the champion."}, {"viet": "Ông ta không những chỉ viết các vở kịch của mình mà ông ta còn sắm vai trong những vở đó.", "eng": "He not only writes his own plays, he also acts in them."}, {"viet": "Anh ấy đánh đàn ống trong nhà thờ.", "eng": "He plays the organ in church."}, {"viet": "Ông ta choàng tay ôm bà ta tỏ cử chỉ che chở.", "eng": "He put his arm round her in a protective gesture."}, {"viet": "Anh ấy đáp lại bằng cách chúc cô ta may mắn.", "eng": "He reciprocated by wishing her good luck."}, {"viet": "Ông ta phác hoạ sơ một vài ý kiến để xây những toà nhà.", "eng": "He roughed out some ideas for the buildings."}, {"viet": "Anh ta là người thông thạo nghề mộc.", "eng": "He's an adept in carpentry."}, {"viet": "Anh ta nợ đến 200 bảng Anh.", "eng": "He's in debt to the extent of £ 200."}, {"viet": "Anh ta giàu đến nỗi mất 100 bảng Anh vẫn không biết.", "eng": "He's so rich that he wouldn't miss £ 100."}, {"viet": "Nó đang ngồi ghi chép tất cả mọi điều được nói đến.", "eng": "He sat taking notes of everything that was said."}, {"viet": "Hắn gửi hoa đến cho cô ta để tạ lỗi về sự thô lỗ trước kia của hắn.", "eng": "He sent her some flowers in atonement for his earlier rudeness."}, {"viet": "Anh ta trượt chân và gãy chân trong đợt rét lớn mùa đông năm ngoái.", "eng": "He slipped and broke his leg during the big freeze last winter."}, {"viet": "Anh ấy vắt cam lấy nước.", "eng": "He squeezed an orange to get the juice out."}, {"viet": "Nó học tích cực hơn để nâng cao trình độ tiếng Pháp.", "eng": "He studied harder to improve his French."}, {"viet": "Nó nghĩ rằng nó biết hết mọi giải pháp.", "eng": "He thinks he knows all the answers."}, {"viet": "Anh ta nhận phần thưởng và vênh váo về chỗ ngồi.", "eng": "He took prize and swaggered back to his seat."}, {"viet": "Hắn ta lật chiếc bánh bằng một động tác giật mạnh cổ tay.", "eng": "He turned the pancake over with a strong flick of his wrist."}, {"viet": "Ông ta đã muốn thoát khỏi những quan điểm lỗi thời hẹp hòi của cái đại học nhỏ bé nơi ông ta giảng dạy.", "eng": "He wanted to escape from the provincialism of the small university where he taught."}, {"viet": "Anh ấy bị cảnh sát bắt.", "eng": "He was arrested by the police."}, {"viet": "Anh ta bị kết án dựa trên bằng chứng kém giá trị nhất.", "eng": "He was condemned upon the slimmest of evidence."}, {"viet": "Anh ta tức giận-cũng có lý do của nó.", "eng": "He was getting angry-and with some justification."}, {"viet": "Anh ấy đang can đảm phấn đấu tỏ ra vui tươi.", "eng": "He was making a brave fist of appearing cheerful."}, {"viet": "Ông ta đã bị đưa ra khỏi ban bí thư sau vụ rắc rối đó.", "eng": "He was read out of the secretariat after the embarrassing incident."}, {"viet": "Nó đã bị quân địch bắt làm tù binh.", "eng": "He was taken prisoner by the enemy."}, {"viet": "Nó không phải chỉ là vô tâm mà là hết sức thô lỗ.", "eng": "He wasn't just inconsiderate, he was downright rude."}, {"viet": "Ông ta sẽ rời khỏi quân đội vào năm tới.", "eng": "He will retire from the army next year."}, {"viet": "Ông ta có lối viết rất độc đáo.", "eng": "He writes in a very individual way."}, {"viet": "Từ nay trở đi tôi mong anh đến họp đúng giờ.", "eng": "Henceforth I expect you to be punctual for meetings."}, {"viet": "Sự nghiệp của cô ấy bị làm hỏng vì va chạm với cấp trên.", "eng": "Her career has been blighted by classes with the authorities."}, {"viet": "Nét vẽ của cô ta thì khá nhưng bố cục thì yếu.", "eng": "Her drawing is competent, but her composition is poor."}, {"viet": "Sự thân thiện của cô ấy làm tiêu tan những nỗi ngờ vực trong họ.", "eng": "Her friendliness disarmed their suspicions."}, {"viet": "Thu nhập của cô ta lên đến sáu con số.", "eng": "Her income runs into six figures."}, {"viet": "Tính khí cô ta cứ thay đổi luôn, lúc thì vui sướng lúc thì đầy thất vọng.", "eng": "Her moods kept changing-now happy, now filled with despair."}, {"viet": "Cuộc trình diễn của cô ta đã mang lại cho mình sự đánh giá tán thưởng nhiệt liệt.", "eng": "Her performance won her much critical acclaim."}, {"viet": "Sự hy sinh của cô ấy đã cứu sinh mạng của chúng ta.", "eng": "Her self-sacrifice saved our lives."}, {"viet": "Thầy phụ đạo của cô ta nói rằng cô ta có tiến bộ.", "eng": "Her tutor says she is making good progress."}, {"viet": "Đây là bảng kê những yêu cầu của chúng tôi.", "eng": "Here is the list of our requirements."}, {"viet": "Sự phiền muộn của anh ta hiện ra trên khuôn mặt.", "eng": "His annoyance showed itself in his face."}, {"viet": "Lòng dũng cảm của anh ta xứng đáng là tấm gương cho tất cả chúng ta.", "eng": "His bravery should be an example to all of us."}, {"viet": "Nỗi khát khao được nổi tiếng của ông ta hầu như đã trở thành một sở thích lệch lạc.", "eng": "His craving for publicity has become almost a perversion."}, {"viet": "Khuôn mặt anh ta có nét đau khổ.", "eng": "His face bears the stamp of suffering."}, {"viet": "Rắc rối về vấn đề phân biệt nam nữ của ông ta tăng lên sau bài nói quan trọng về vị trí của phụ nữ.", "eng": "His gender-gap troubles multiplied after an important speech about women's place."}, {"viet": "Các sở thích của anh ta thì từ việc chơi cờ cho đến chèo xuồng.", "eng": "His interests ranged from chess to canoeing."}, {"viet": "Đầu óc ông ta trở nên trì độn từ lúc về hưu.", "eng": "His mind has stagnated since his retirement."}, {"viet": "Cha mẹ anh ta muốn anh ấy trở thành một mục sư.", "eng": "His parents were intent on him for the ministry."}, {"viet": "Sự từ chối của anh ta được nói lên quá lịch sự đến nỗi chúng tôi không thể phật lòng được.", "eng": "His refusal was worded in such a graceful way that we could not be offended."}, {"viet": "Tốc độ và kỹ thuật điêu luyện của anh ta làm cho các cầu thủ khác trông vụng về lúng túng.", "eng": "His speed and skill makes other players look flat-footed."}, {"viet": "Quần áo nó lôi thôi lếch thếch khiến người ta có một ấn tượng sai lầm về nó.", "eng": "His untidy clothes give one a misguided impression of him."}, {"viet": "Khúc côn cầu, bóng chuyền, bóng đá và quần vợt đều là các môn thể thao.", "eng": "Hockey, volleyball, football and tennis are all sports."}, {"viet": "Chiến sự giữa hai bên kết thúc vào lúc nửa đêm.", "eng": "Hostilities between the two sides ceased at midnight."}, {"viet": "Làm sao chúng có thể học được tí gì khi mà chúng dành tất cả thời gian rỗi để xem ti vi?", "eng": "How can they learn anything when they spent all their spare time watching television?"}, {"viet": "Các cửa hàng bách hóa ở nước bạn khác với các cửa hàng ở Nhật Bản như thế nào?", "eng": "How do department stores in your country differ from those in Japan?"}, {"viet": "Tôi mong ước có thể đến đất nước của ông vào một ngày nào đó biết bao!", "eng": "How I wish I could go there some day!"}, {"viet": "Tôi nên mua bao nhiêu lon sô-đa cho bữa tiệc?", "eng": "How many cans of soda should I get for the party?"}, {"viet": "Anh có bao nhiêu năm kinh nghiệm dạy tiếng Anh rồi?", "eng": "How many years experience do you have of teaching English?"}, {"viet": "Bao lâu bạn làm từ thiện một lần?", "eng": "How often do you give to charity?"}, {"viet": "Mỗi tuần có hàng trăm người mất tích được báo cáo cho cảnh sát.", "eng": "Hundred of missing persons are reported to the police every week."}, {"viet": "Tôi muốn kiểm tra kết số hiện giờ trong tài khoản chi phiếu của tôi.", "eng": "I'd like to check the present balance in my checking account."}, {"viet": "Tôi sẽ liên lạc lại vào khoảng cuối tuần.", "eng": "I'll be in touch again towards the end of the week."}, {"viet": "Tôi sẽ báo cho bộ phận bảo trì biết ngay.", "eng": "I'll inform the Maintenance Department at once."}, {"viet": "Tôi sẽ cố gắng gọi lại cho anh khi tôi rảnh tay.", "eng": "I'll try and phone you back when I've got my hands free."}, {"viet": "Tôi bắt đầu nhận thấy các tiểu thuyết của bà ấy hơi lỗi thời.", "eng": "I'm beginning to find her novels rather passé."}, {"viet": "Tôi định mua một cuốn kim từ điển.", "eng": "I'm going to purchase an electronic dictionary."}, {"viet": "Tôi không tin ý kiến anh sẽ thực hiện được nhưng trong lúc này tôi vẫn sẵn sàng tiếp nhận ý kiến mới.", "eng": "I'm not convinced your idea will work, but I'll keep an open mind for the moment."}, {"viet": "Tôi chán cái chuyện hai cậu cãi vã nhau mãi-thôi đi được rồi đấy!", "eng": "I'm sick of you two squabbling-just cut in out!"}, {"viet": "Tôi tin chắc là lần sau sẽ không có sai sót nào nữa.", "eng": "I'm sure there won't be any mistake next time."}, {"viet": "Tôi là Trương Nham, thư ký của công ty xuất nhập khẩu dệt Quảng Châu.", "eng": "I'm Zhang Yan, the secretary of Guangzhou Textile Import and Export Corporation."}, {"viet": "Tôi có mang theo một loạt các cuốn danh mục những sản phẩm mới nhất của chúng tôi.", "eng": "I've brought a series of catalogues on our latest products."}, {"viet": "Tôi nghe nói ăn uống ở Nhật mà ồn ào cũng được.", "eng": "I've heard that it's acceptable to make noise when you eat in Japan."}, {"viet": "Trong đời tôi đã từng thấy một số người làm việc chậm chạp nhưng cái đám này là loại chậm nhất.", "eng": "I've seen some slow workers in my time but this lot are the slowest by far."}, {"viet": "Tôi luôn luôn tẩm áo sơ mi cho ẩm trước khi là.", "eng": "I always dampen shirts before ironing them."}, {"viet": "Tôi không hoàn toàn tin ở chứng cớ ấy.", "eng": "I am not fully persuaded by the evidence."}, {"viet": "Tôi hỏi anh ta một câu nhưng anh ta không đáp lại.", "eng": "I asked him a question but he gave no response."}, {"viet": "Hôm nay tôi đã mua chúng ở chợ nông sản đấy.", "eng": "I bought them today from the farmer's market."}, {"viet": "Tôi vẫn không hết kinh ngạc thấy các con bà lớn nhanh thế.", "eng": "I can't get over how much your children have grown."}, {"viet": "Tôi không nghĩ ra được tại sao tôi đã bỏ quên cái ví của tôi ở đó.", "eng": "I can't think why I would have left my purse there."}, {"viet": "Tôi có thể sử dụng xe hơi nếu cần.", "eng": "I can take the car if necessary."}, {"viet": "Tôi rất nóng lòng muốn xem khu Disneyland.", "eng": "I can't wait to see Disneyland."}, {"viet": "Tôi không thể sống ở London được, tôi rất thích sống xa thành phố.", "eng": "I couldn't live in London, I enjoy the great outdoors too much."}, {"viet": "Trước đây tôi chưa từng thấy thái độ nào thô lỗ như thế.", "eng": "I'd never met such crudity before."}, {"viet": "Tôi không nghĩ là anh có nhà, nhưng tôi vẫn cứ tạt qua, may ra biết đâu đấy.", "eng": "I didn't think you'd be at home, but I just called on the off chance."}, {"viet": "Tôi không biết cô ta nhiều lắm để có thể đưa ra một sự đánh giá về năng lực của cô ta.", "eng": "I don't know her well enough to form an estimate of her abilities."}, {"viet": "Tôi không có ý dám cho rằng mình hiểu biết bằng anh ta về việc đó.", "eng": "I don't pretend to know as much as he does about it."}, {"viet": "Em không muốn đến với anh hôm nay.", "eng": "I don't want to come with you today."}, {"viet": "Tôi không thấy phiền nếu nói chuyện về cô dâu.", "eng": "I don't mind talking about the bride."}, {"viet": "Tôi đính các trang lại bằng cái kẹp giấy.", "eng": "I fastened the pages together with a paperclip."}, {"viet": "Tôi cảm thấy rất là xa lạ trong những giờ đầu tiên ở đất nước đó.", "eng": "I felt so very alien during my first hours in that country."}, {"viet": "Tôi cho là đã có nhiều vụ đấu đá chính trị quyết liệt diễn ra trước khi ông ta giành được địa vị chóp bu.", "eng": "I gather a lot of political infighting went on before he got the top of job."}, {"viet": "Tôi có cái vé này không tốn tiền do người không cần nó cho tôi.", "eng": "I got this ticket for free from somebody who didn't want it."}, {"viet": "Tôi không có thời gian để chuẩn bị.", "eng": "I had no time in which to prepare."}, {"viet": "Tôi tin anh, tôi chắc anh sẽ làm tốt.", "eng": "I have a faith in you, I am sure you'll do well."}, {"viet": "Tôi rất vui mừng giới thiệu diễn giả của chúng ta.", "eng": "I have much pleasure in introducing our speaker."}, {"viet": "Cháu phải làm xong bài tập về nhà.", "eng": "I have to finish my homework."}, {"viet": "Tôi không có khả năng đi lại vững vàng trên boong tàu chạy.", "eng": "I haven't got my sea-legs yet."}, {"viet": "Thành thực mà nói tôi không ngại làm việc khuya đêm nay.", "eng": "I honestly don't mind working late tonight."}, {"viet": "Tôi bị đau ở chân và phải đi cà nhắc về.", "eng": "I hurt my foot, and had to hobble home."}, {"viet": "Qua kinh nghiệm tôi biết rằng nó sẽ đến muộn.", "eng": "I know from experience that he'll arrive late."}, {"viet": "Tôi thích cô ta dù rằng cô ta có thể trái tính trái nết.", "eng": "I like her even though she can be annoying."}, {"viet": "Tôi sẽ ở đó khoảng 3 giờ rưỡi.", "eng": "I'll be there about half past three."}, {"viet": "Tôi sẽ không ăn món ngọt trong bữa.", "eng": "I'll miss out the sweet course."}, {"viet": "Tôi cũng là người lạ ở đây.", "eng": "I'm a stranger here, too."}, {"viet": "Tôi sắp đi ra bãi biển.", "eng": "I'm going to the beach."}, {"viet": "Tôi thật sự trong đến dịp đó.", "eng": "I'm really looking forward to this."}, {"viet": "Tôi đã làm điều mà tôi hi vọng là một đề nghị hấp dẫn.", "eng": "I made what I hoped were an attractive proposition."}, {"viet": "Tôi phải đi thôi, đó là vấn đề của lương tâm.", "eng": "I must go, it's a matter of conscience."}, {"viet": "Tôi cần phải luyện môn tiếng Ý của tôi trước chuyến đi làm ăn của tôi.", "eng": "I need to practise my Italian before my business trip."}, {"viet": "Tôi chỉ thích ăn khi chúng chín thôi.", "eng": "I only like them when they are ripe."}, {"viet": "Năm ngoái tôi đã trữ được một hai két rượu vang đỏ.", "eng": "I put down a couple of cases of claret last year."}, {"viet": "Tôi nhận ra nét chữ của cô ấy trên phong bì.", "eng": "I recognised her handwriting on the envelope."}, {"viet": "Tôi tự nhủ:'Điều đó không thể đúng được!'!", "eng": "I said to myself,'That can't be right'!"}, {"viet": "Tôi sẽ trở lại lúc hoàng hôn yên tĩnh.", "eng": "I shall be back towards the quiet evenfall."}, {"viet": "Tôi lê trên chiếc ghế dài đến bên cạnh cô ấy.", "eng": "I slipped along the bench next to her."}, {"viet": "Tôi cho rằng sự lười biếng là một trong những điểm yếu của con người.", "eng": "I suppose laziness is one of the frailties of human nature."}, {"viet": "Bố nghĩ bố sẽ lau giày cho sạch.", "eng": "I think I'll clean my shoes."}, {"viet": "Em nghĩ họ sắp bắt đầu rồi.", "eng": "I think they are going to begin now."}, {"viet": "Tôi đã nói thẳng với cô ta điều tôi nghĩ về cô ta.", "eng": "I told her right off what I thought of her."}, {"viet": "Hoá ra cô ta là bạn của em gái tôi.", "eng": "I turned out that she was a friend of my sister."}, {"viet": "Tôi chờ đợi sự trở về của nàng trong nỗi lo lắng ngày càng tăng.", "eng": "I waited with growing unease her return."}, {"viet": "Cháu muốn tham quan Cầu Kim Môn ạ.", "eng": "I want to see the Golden Gate Bridge."}, {"viet": "Tôi hoàn toàn không chuẩn bị đối với phản ứng của anh ta.", "eng": "I was completely unprepared for his reaction."}, {"viet": "Tôi thực sự chán đến chết đi được!", "eng": "I was literally bored to death!"}, {"viet": "Tôi nói không quá, chứ tôi lấy làm ngạc nhiên về điều anh ta nói.", "eng": "I was surprised at what he said, to say the least."}, {"viet": "Tôi sẽ đồng ý đi với điều kiện là người ta trả mọi chi phí của tôi.", "eng": "I will agree to go provided my expenses are paid."}, {"viet": "Tôi mong anh sẽ ngừng chơi cái thứ âm nhạc buồn bã ấy đi.", "eng": "I wish you'd stop playing that mournful music."}, {"viet": "Tôi sẽ không để bị cám dỗ bỏ bê nhiệm vụ của mình.", "eng": "I won't be seduced from my duty."}, {"viet": "Tôi muốn mời bạn dự tiệc kỉ niệm ngày cưới đầu tiên của chúng tôi.", "eng": "I would like to invite you to our first wedding anniversary party."}, {"viet": "Tôi không chú ý đến cái đó, đó chỉ là lời đồn.", "eng": "I wouldn't take any notice of it, it's just hearsay."}, {"viet": "Nếu ông ta quên đến sân bay thì không ai sẽ ở đó để đón cô ta.", "eng": "If he should have forgotten to go to the airport, nobody will be there to meet her."}, {"viet": "Giá như nó không quên mua ít trái cây.", "eng": "If only he'd remembered to buy some fruit."}, {"viet": "Nếu đây không phải là sách của Susan thì cuốn sách kia hẳn phải là của cô ấy.", "eng": "If this isn't Susan's book that one must be hers."}, {"viet": "Nếu như anh hỏi ý kiến tôi thì cô ta nhát quá không làm được chuyện đó đâu.", "eng": "If you ask me, she's too scared to do it."}, {"viet": "Nếu bạn thấy bữa ăn không đủ no thì hãy nói “ Ồ, ngon quá!", "eng": "If you find the meal not square enough, say Oh, it's delicious!"}, {"viet": "Nếu mày bước ra trước mũi xe một lần nữa là đi tong đời đấy.", "eng": "If you step out in front of a car like that again, it's adios muchachos."}, {"viet": "Rời bỏ ngay ngôi nhà này là điều cần thiết.", "eng": "Immediate vacation of the house is essential."}, {"viet": "Ở các câu lạc bộ và các lớp học họ có thể bầu người đứng đầu của mình.", "eng": "In clubs and classes they can elect their officers."}, {"viet": "Ở Nhật Bản, doanh nhân bình thường chỉ có thể nghỉ 8 ngày vào giữa mùa hè.", "eng": "In Japan, the average businessman can take only 8 days off in mid-summer."}, {"viet": "Mặc dù có cuộc cãi nhau giữa họ, họ vẫn là những người bạn thân nhất của nhau.", "eng": "In spite of their quarrel, they remained the best of friends."}, {"viet": "Trong quá trình thực hiện nhiệm vụ của mình, ông ta đã gặp phải nhiều sự chống cự.", "eng": "In the prosecution of his duties, he had men with a good deal of resistance."}, {"viet": "Trong nhà của bạn, bạn có thể thích làm gì thì làm.", "eng": "In your own home you can act how you like."}, {"viet": "Gia đình rất quan trọng đối với ông ấy phải không?", "eng": "Is family very important to him?"}, {"viet": "Có phải bản họ đang chơi là bản giao hưởng “ Số Phận ” nổi tiếng do Beethoven sáng tác không?", "eng": "Is the piece they are playing the famous Fate Symphony composed by Beethoven?"}, {"viet": "Đây là bản vẽ gốc hay là bản sao?", "eng": "Is this the original drawing or is it a copy?"}, {"viet": "Thật là một điều khó hiểu đối với tôi là tại sao họ không chọn anh ta.", "eng": "It's a mystery to me why they didn't choose him."}, {"viet": "Nhất định đó là một bữa tiệc chán ngắt-chúng ta hãy rút êm thôi.", "eng": "It's bound to be a boring party-Let's try to wangle out of it."}, {"viet": "Đã đến lúc cậu đi cắt tóc đi, dài quá rồi đấy.", "eng": "It's high time you had your hair cut, it's getting much too long."}, {"viet": "Đó không phải là một phương pháp sưởi tiết kiệm cho lắm.", "eng": "It's not a very economical method of heating."}, {"viet": "Người ta nói rằng có ba hầm mộ các chiến binh đất nung trong lăng mộ Hoàng đế Tần Thuỷ Hoàng, phải vậy không?", "eng": "It's said that there are three vaults of Terracotta Warriors in Emperor Qin Shihuang's tomb, isn't it?"}, {"viet": "Thật có ít khi biết tỉ giá hối đoái hàng ngày.", "eng": "It's useful to know the exchange rate every day."}, {"viet": "Nếu anh không thắng cuộc cũng không sao-miễn anh cố hết sức là được rồi.", "eng": "It doesn't matter if you don't win-just do your best."}, {"viet": "Bưu điện đóng cửa lúc 11 giờ tối.", "eng": "It is closed at 11 p. m."}, {"viet": "Trước khi vào bắt buộc phải bỏ giày ra.", "eng": "It is obligatory to remove your shoes before entering."}, {"viet": "Trông nó thật nguy nga và tuyệt vời!", "eng": "It looks so magnificent and sublime!"}, {"viet": "Hôm nay là một ngày vui.", "eng": "It's been a good day."}, {"viet": "Đọc cuốn sách đó cũng đáng.", "eng": "It's worth reading the book."}, {"viet": "Đã phải mất nhiều giờ mới cứu thoát được các nạn nhân ( ra khỏi toà nhà sụp đổ ).", "eng": "It took hours to free the victims ( from the collapsed building )."}, {"viet": "Chị ấy dũng cảm xông vào ngôi nhà đang cháy.", "eng": "It was brave of her to go into the burning building."}, {"viet": "Tổng thống đã tới ngày hôm qua.", "eng": "It was President who arrived yesterday."}, {"viet": "Trong trường hợp trời mưa nó sẽ bị hoãn lại.", "eng": "It will be postponed in the event of rain."}, {"viet": "James có thể bắt chước y hệt lời nói của cha mình.", "eng": "James can imitate his father's speech perfectly."}, {"viet": "John tự mình loay hoay chữa lấy xe của mình.", "eng": "John managed to repair his car by himself."}, {"viet": "Karl gần đạt tới sự nghiệp diễn viên rực rỡ.", "eng": "Karl is on the brink of a brilliant acting career."}, {"viet": "Ít cà phê hơn là chè Tôi lĩnh ít tiền hơn những người khác.", "eng": "Less coffee than tea I received less money than the others did."}, {"viet": "Chúng ta hãy đọc cuốn hướng dẫn chương trình tivi xem.", "eng": "Let's look in the TV guide and see."}, {"viet": "Nhiều trẻ em dưới 5 tuổi đến trường mẫu giáo.", "eng": "Many children under 5 go to nursery school."}, {"viet": "Nhiều trường hợp như thế được báo cáo hàng ngày.", "eng": "Many such cases are reported every day."}, {"viet": "Xin quý vị chú ý tới mục số bảy trong chương trình nghị sự.", "eng": "May I call your call attention to item seven on the agenda."}, {"viet": "Có lẽ năm tới tôi sẽ có chút.", "eng": "Maybe next year I'll have a great-great-grandson."}, {"viet": "Hầu hết các gia đình trong đường phố chúng tôi đều đang hưởng phúc lợi xã hội.", "eng": "Most of the families in our road are on social security."}, {"viet": "Ông Smith người có nhiều kinh nghiệm giảng dạy sẽ đến với chúng ta vào mùa xuân.", "eng": "Mrs Smith, who has a lot of teaching experience, will be joining us in the spring."}, {"viet": "Tôi có cảm giác là cơn cảm lạnh đã đỡ.", "eng": "My cold feels as though it's getting better."}, {"viet": "Buổi họp mặt bạn bè thời cấp 3 của tôi là vào tháng tới.", "eng": "My high school reunion is next month."}, {"viet": "Bố mẹ tôi thả lỏng cho tôi và để tôi tự mắc lấy lỗi lầm.", "eng": "My parents were permissive and let me make my own mistakes."}, {"viet": "Nam giết thì giờ bằng cách ném những cành củi vào lửa.", "eng": "Nam amused himself by throwing branches into the fire."}, {"viet": "Trong căn hộ sát nách chúng tôi có một đôi vợ chồng từ Mỹ đến.", "eng": "Next door to us there's a couple from the USA."}, {"viet": "Không, tôi không gọi nó là trung tâm.", "eng": "No. I wouldn't call it the center."}, {"viet": "Không trừ phi không ghi rõ vào trong bức điện.", "eng": "Not unless you include it in the message."}, {"viet": "Nung nấu ý nghĩ trả thù, ôm ấp hy vọng thăng chức, v. v.", "eng": "Nurse feelings of revenge, hopes of promotion, etc."}, {"viet": "Ồ, họ rất khỏe, cám ơn.", "eng": "Oh, they're very well, thank you."}, {"viet": "Sau khi tính kĩ, tôi nghĩ là tôi sẽ không đi.", "eng": "On second thought, I don't think I'll go."}, {"viet": "Một ngày như thế nữa là tôi sẽ bỏ đi liền.", "eng": "One more day like this, and I'm gonna ankle."}, {"viet": "Những thuận lợi khác của chi phiếu du lịch là chúng thường được các nhân viên bán hàng hoan nghênh hơn tiền mặt và thậm chí đôi khi còn có giá trị hơn tiền mặt một chút khi bạn chuyển đổi nó từ loại tiền tệ này sang loại tiền tệ khác.", "eng": "Other advantages of traveller's checks are that they are often more welcome to the shopkeepers than cash and sometimes are even worth slightly more than cash when you convert it from one currency to another."}, {"viet": "Ngành ngoại thương của chúng ta đã phát triển mạnh trong những năm gần đây.", "eng": "Our foreign trade has expanded greatly in recent years."}, {"viet": "Cái máy photocopi của chúng tôi luôn luôn phải sửa chữa vặt.", "eng": "Our photocopier is in continual need of running repairs."}, {"viet": "Hơn 100 vụ trộm được báo cáo hàng tháng và đó mới chỉ là phần nổi thôi.", "eng": "Over 100 burglaries are reported every month, and that's just the tip of the iceberg."}, {"viet": "Người được trả tiền được yêu cầu xuất trình hộ chiếu của họ để xác minh.", "eng": "Payees of travellers cheques are requested to show their passports for verification."}, {"viet": "Người ta thường phỏng đoán một cách sai lầm là ông ấy thuộc đảng Bảo thủ.", "eng": "People wrongly assume that he's a Tory."}, {"viet": "Cảnh sát đang tuần tra những lối chính vào sân vận động.", "eng": "Police are patrolling the major approach roads to the stadium."}, {"viet": "Những nhận xét bộc lộ một sự coi thường sự thật không thể tưởng tượng được.", "eng": "Remarks which betray a staggering contempt for the truth."}, {"viet": "Gởi ai thực hiện nhiệm vụ thẩm tra.", "eng": "Send somebody on a mission of inquiry."}, {"viet": "Cô ta sẽ đi xa trong một khoảng thời gian chưa rõ là bao lâu.", "eng": "She'll be away for an indefinite period."}, {"viet": "Gần đây cô ấy hơi mệt.", "eng": "She's been a bit under the weather recently."}, {"viet": "Cô ta gặp rất nhiều khó khăn trong cuộc đời của cô ta nhưng cô ta lúc nào cũng đứng vững trở lại được.", "eng": "She's had many misfortunes in her life but she always bounces back."}, {"viet": "Cô ấy không tham gia vào đời sống xã hội lúc này bởi vì cô ấy đang học thi.", "eng": "She's out of circulation at the moment because she's working for her exams."}, {"viet": "Cô ấy rất am hiểu về vấn đề này.", "eng": "She's very knowledgeable about that subject."}, {"viet": "Cô ấy hỏi có chuyện gì xảy ra, nhưng anh ấy không trả lời.", "eng": "She asked what had happened, but he didn't answer."}, {"viet": "Cô ta lén lút lục lọi những vật dụng của ông ấy.", "eng": "She carried out a surreptitious search of his belongings."}, {"viet": "Bà ta cắt một lát thịt bò ở súc thịt.", "eng": "She cut a slice of beef from the joint."}, {"viet": "Cô ta làm việc được nhưng chẳng phải là chấn động thế giới đâu!", "eng": "She does the job adequately but she's not going to set the world on fire!"}, {"viet": "Cô ta cảm thấy sức sáng tạo của mình bị kìm hãm.", "eng": "She felt her creativity was being strangled."}, {"viet": "Cô ấy kiếm được 10 pao hoa hồng mỗi lần bán hàng.", "eng": "She gets 10 pounds commission on each sale."}, {"viet": "Cô ấy mắc tội ngắt lời anh ta trong khi anh ta đang nói.", "eng": "She had committed the cardinal sin of interrupting him while he was talking."}, {"viet": "Cô ta có rất nhiều khả năng làm công việc khó nhọc.", "eng": "She has an enormous capacity for hard work."}, {"viet": "Cô ấy vẫn chưa về nhà.", "eng": "She hasn't come home yet."}, {"viet": "Bà ấy gặp rắc rối khi nhấn nút.", "eng": "She is having trouble when pushing the button."}, {"viet": "Cô ấy đã nắm chặt tay đứa con trai nhỏ khi họ qua đường.", "eng": "She kept a firm hold of her little boy's hand as they crossed the road."}, {"viet": "Cô ấy trông hộ chó cho tôi khi tôi đi nghỉ.", "eng": "She looked after my dog while I was on holiday."}, {"viet": "Cô ta có thể không phải là ứng cử viên thông minh nhất, nhưng chắc chắn cô ta là người táo bạo nhất.", "eng": "She may not have been the cleverest candidate but she was certainly the most enterprising."}, {"viet": "Cô ta đưa tay quệt trán.", "eng": "She passed her hand across her forehead."}, {"viet": "Cô ta bồn chồn đưa ngón tay vuốt mái tóc.", "eng": "She ran her fingers nervously through her hair."}, {"viet": "Cô ấy là một bà cụ non hay mỉa mai.", "eng": "She's a sarky little madam."}, {"viet": "Cô ta không thích ý tưởng đó lắm.", "eng": "She's not very keen on the idea."}, {"viet": "Cô ta trông thấy một cái áo trong tủ kính bày hàng và lập tức cô ta thích nó ngay.", "eng": "She saw a dress in the shop window and it caught her fancy immediately."}, {"viet": "Cô ấy đã tỏ ra không có khả năng giải quyết vấn đề tiền bạc.", "eng": "She showed herself unable to deal with money."}, {"viet": "Cô ấy giậm ( bẹp ) đất xung quanh cái cây.", "eng": "She stamped the soil ( flat ) round the plant."}, {"viet": "Cô ta nói liền hai tiếng đồng hồ không nghỉ.", "eng": "She talked on for two hours without stopping."}, {"viet": "Mặt của cô ta trở nên trắng bệch như người chết khi cô nghe tin đó.", "eng": "She turned a deathly shade of white when she heard the news."}, {"viet": "Cô ta hơi bồn chồn cho đến khi biết tin anh ta an toàn.", "eng": "She was a bit on edge till she heard he was safe."}, {"viet": "Cô ta được giao một công tác quan trọng.", "eng": "She was charged with an important mission."}, {"viet": "Bà ấy tỏ ý hết sức khen ngợi các bức tranh của tôi.", "eng": "She was highly complimentary about my paintings."}, {"viet": "Cô ấy bị kẹt cứng dưới đống sắt vụn của chiếc xe.", "eng": "She was pinned under the wreckage or the car."}, {"viet": "Cô ta đang học một khóa võ tự vệ.", "eng": "She was taking a course of self-defense."}, {"viet": "Cô ấy vẫy tôi khi cô ta rẽ ở góc phố.", "eng": "She waved to me as she turned the corner."}, {"viet": "Cô ta thắng một cuộc thi ở một tờ báo gì gì đó.", "eng": "She won a competition in some newspaper or other."}, {"viet": "Các bản đồ rời dùng thước tỷ lệ lớn hơn nhiều.", "eng": "Sheet maps use a much large scale."}, {"viet": "Cất đồ nữ trang vào trong tủ sắt.", "eng": "Shut the jewels up in the safe."}, {"viet": "Cắm hai cây cột xuống chỗ mặt đất này.", "eng": "Sink two posts into the ground here."}, {"viet": "Những cửa hiệu nhỏ đã bị những siêu thị lớn loại ra khỏi thị trường.", "eng": "Small shops are being frozen out by the big supermarkets."}, {"viet": "Vậy là dường như tất cả các món ăn Tứ Xuyên đều cay và có nhiều gia vị.", "eng": "So it seems all Sichuan dishes are hot and spicy."}, {"viet": "Một số động vật không hoạt động vào ban ngày.", "eng": "Some animals are inactive during the day time."}, {"viet": "Một số điều trong bức thư không thể đọc được.", "eng": "Some of the letter is illegible."}, {"viet": "Có vài điều quan trọng hơn những điều khác.", "eng": "Some things matter more than others."}, {"viet": "Thấm nước bằng miếng khăn giấy.", "eng": "Sop up the water with a paper towel."}, {"viet": "Bỏ ngày nghỉ cuối tuần để dán giấy hoa lên tường phòng ngủ.", "eng": "Spend the weekend wall papering the bedroom."}, {"viet": "Ăn cắp trong một giây phút lầm lạc.", "eng": "Steal something in a moment of aberration."}, {"viet": "Đừng có chần chừ nữa, hãy trả lời tôi đi!", "eng": "Stop stalling and give me an answer!"}, {"viet": "Ký tên mình vào một bản kiến nghị.", "eng": "Subscribe one's name to a petition."}, {"viet": "Kiện ai vi phạm hợp đồng.", "eng": "Sue somebody for breach of contract."}, {"viet": "Những người sống sót trong thảm hoạ đã mất hết cả họ hàng thật đáng thương vô cùng.", "eng": "Survivors of the disaster who lost their relatives are much to be pitied."}, {"viet": "Dắt bọn trẻ đi xem nhà trưng bày tượng sáp.", "eng": "Take the children to the waxworks."}, {"viet": "Khoa học kỹ thuật không có đạo đức thì man rợ, đạo đức không có khoa học kỹ thuật thì vô hiệu quả.", "eng": "Technology without morality is barbarous, morality without technology is impotent."}, {"viet": "Cám ơn, chuyện không gấp đâu.", "eng": "Thank you, it's not that urgent."}, {"viet": "Đó là cái nhếch mép gần giống với nụ cười nhất mà anh ta từng có.", "eng": "That's the nearest approach to a smile he ever makes."}, {"viet": "Cái áo đầm đó làm tăng vẻ đẹp thân hình của cô ta.", "eng": "That dress sets of the beauty of her frame."}, {"viet": "Có lẽ vậy, nhưng một ngày nào đó, tôi sẽ có các mỹ nữ và bài bạc.", "eng": "That may be, but I'll take the girl and the gambling any day."}, {"viet": "Đó là việc của tôi, không phải của bạn.", "eng": "That's my funeral not yours."}, {"viet": "Bài diễn văn tuyệt lắm, ông Lương à.", "eng": "That was an excellent speech, Mr. Liang."}, {"viet": "Vụ tai nạn được thông báo trên đài.", "eng": "The accident was reported on the radio."}, {"viet": "Tuổi trưởng thành là 18 tuổi.", "eng": "The age of majority is eighteen."}, {"viet": "Lời qua tiếng lại giận dữ để lại một cảm giác không vui.", "eng": "The angry exchange of words left an unpleasant aftertaste."}, {"viet": "Khu vực đó được ủi để lấy chỗ làm một con đường mới.", "eng": "The area was bulldozed to make way for a new road."}, {"viet": "Các vận động viên điền kinh chờ đợi, với tất cả các cơ bắp của họ căng lên.", "eng": "The athletes waited, with all their sinews tensed."}, {"viet": "Tình yêu đối với một người.", "eng": "The awakeing of love for another person."}, {"viet": "Băng nhạc đã chơi nhiều bài kể cả một vài bài mà tôi rất ưa thích.", "eng": "The band played many songs, including some of my favourites."}, {"viet": "Dãy cửa hàng đó là một loạt cảnh trí và ấn tượng kỳ lạ biến đổi liên tục.", "eng": "The bazaar was a kaleidoscope of strange sights and impressions."}, {"viet": "Hóa đơn đó tính tổng cộng tới gần 40 bảng Anh.", "eng": "The bill totted up to almost £ 40."}, {"viet": "Chiếc thuyền trôi xuôi theo dòng sông.", "eng": "The boat drifted down the river."}, {"viet": "Cuốn sách vẫn hợp thời do liên tục chỉnh lí.", "eng": "The book stays au courant by constant revision."}, {"viet": "Đứa bé ném đá là đứa tóc quăn.", "eng": "The boy who threw the stone is the one with curly hair."}, {"viet": "Các xương gãy đã liền chặt lại với nhau.", "eng": "The broken bones have knit together well."}, {"viet": "Xe buýt sắp đến rồi mà.", "eng": "The bus will be here soon."}, {"viet": "Thân xe ô tô chắc không còn nguyên vẹn nữa vẫn đoàn kết.", "eng": "The car's bodywork scarcely holds together."}, {"viet": "Chiếc xe ôtô giờ đây chỉ là một đống kim loại méo mó.", "eng": "The car was now just a pile of twisted metal."}, {"viet": "Cái móc ở túi xách tay của tôi bị gãy.", "eng": "The catch on my handbag is broken."}, {"viet": "Những thay đổi đó được mọi người hoan nghênh.", "eng": "The changes were welcomed by everybody."}, {"viet": "Người hành hạ đứa bé tàn tật bị tù năm năm.", "eng": "The child molester was imprisoned for five years."}, {"viet": "Trẻ con học ở tu viện gần đó.", "eng": "The children attended the nearby convent for their education."}, {"viet": "Những đứa trẻ mặc quần áo đẹp trông thật xinh xắn.", "eng": "The children were a picture in their pretty dresses."}, {"viet": "Tinh thần lạc quan bất khuất và dám làm của thành phố.", "eng": "The city's indomitable optimism and can-do spirit."}, {"viet": "Quần áo mà một số giới trẻ mặc bây giờ thực sự làm người ta kinh ngạc.", "eng": "The clothes some young people wear nowadays really make your hair curl."}, {"viet": "Vị đại tá ra lệnh cho quân lính quay đằng sau.", "eng": "The colonel ordered the troops to turn about."}, {"viet": "Đặc trưng của công ti là sự hợp tác giữa các thành viên với nhau.", "eng": "The company ethos is one of cooperation between all members of the firm."}, {"viet": "Cuộc hòa giải là một điều cứu vãn thể diện cho tất cả những người có liên quan.", "eng": "The compromise was a face-saver for all concerned."}, {"viet": "Cuộc tranh cãi ồn ào liên tục về chính sách quốc phòng của chính phủ.", "eng": "The continuing row over the Government's defense policy."}, {"viet": "Việc chinh phục nước láng giềng của một nước.", "eng": "The country's subjection of its neighbour."}, {"viet": "Vua và quần thần chuyển đến vùng quê trong mùa hè.", "eng": "The courts moves to the country in the summer."}, {"viet": "Đám đông đó đã tụ tập trở lại trước tòa nhà quốc hội.", "eng": "The crowd reassembled in front of the state house."}, {"viet": "Tính cách chu kỳ của hoạt động kinh tế.", "eng": "The cyclic nature of economic activity."}, {"viet": "Hình trang trí trên chiếc bánh ngọt quả là một tác phẩm nghệ thuật.", "eng": "The decoration on the cake was a work of art."}, {"viet": "Cảnh tiêu điều của một đất nước bị quân đội xâm lăng.", "eng": "The desolation of country by an invading army."}, {"viet": "Tai hoạ được coi như là một sự phán quyết từ trên trời.", "eng": "The disaster was seen as a judgement from on high."}, {"viet": "Bác sĩ buộc phải phá thai.", "eng": "The doctor had to abort the baby."}, {"viet": "Con chó sủa khi con chồn chui qua hàng rào.", "eng": "The dog gave tongue when the fox came through the hedge."}, {"viet": "Các ống cống bị tắc lá khô.", "eng": "The drains are bunged up with death leaves."}, {"viet": "Con đại bàng lơ lửng trên không trung chực sẵn để nhào xuống con mồi.", "eng": "The eagle poised in mid-air ready to swoop on its prey."}, {"viet": "Những đường nét trang nhã rõ rệt của một chiếc xe ô tô mới.", "eng": "The elegantly contoured lines of a new car."}, {"viet": "Cảnh vui chơi ở ngoại ô phía Tây của London.", "eng": "The entertainment scene in the West End of London."}, {"viet": "Những đoạn bị cắt xén đã phá hoại giá trị văn học của văn bản.", "eng": "The excisions have destroyed the literary value of the text."}, {"viet": "Nhà máy đã thôi sản xuất xe đạp.", "eng": "The factory has ceased making bicycles."}, {"viet": "Lỗi lầm đã không được lưu ý hàng tháng nay.", "eng": "The fault escaped observation for months."}, {"viet": "Bộ phim đó được phát hành rộng rãi.", "eng": "The film is on general release."}, {"viet": "Hãng đó đã đồng ý đền bù mà không có gì phiền phức.", "eng": "The firm agreed to pay compensation without prejudice."}, {"viet": "Ván đầu tiên đã thắng được bằng một hiệp phụ.", "eng": "The first set was won on the tie-breaker."}, {"viet": "Tuần tiếp theo lạnh hơn rõ rệt.", "eng": "The following week it was appreciably colder."}, {"viet": "Người Pháp nổi tiếng về nấu ăn.", "eng": "The French are famous for their cooking."}, {"viet": "Hố ngăn cách giữa những người giàu và những kẻ nghèo vẫn bộc lộ rõ rệt trong các cuộc bầu cử.", "eng": "The gap between the haves and the have-nots still shows up clearly at the polls."}, {"viet": "Mặt trăng khuyết, với ánh sáng phản chiếu nhợt nhạt.", "eng": "The gibbous moon, its reflecting whitey light."}, {"viet": "Chính sách tiền tệ của chính phủ đang từ từ kiềm hãm nền kinh tế.", "eng": "The government's monetary policy is slowly strangling the economy."}, {"viet": "Chính phủ dự định ngăn chặn tệ côn đồ trong bóng đá.", "eng": "The Government intends to clamp down on soccer hooliganism."}, {"viet": "Chính sách của chính phủ cũng na ná như lấy ngón tay ấn vào con đê khi mà lỗ thủng đã quá to.", "eng": "The governments policy is a bit like sticking your finger in the dike when the hole's already quite big."}, {"viet": "Đất đầy vết nứt sau mùa hè nóng bỏng và khô cằn.", "eng": "The ground was full of cracks after the hot dry summer."}, {"viet": "Tên mang súng đang bắt giữ hai đứa trẻ làm con tin ở trong toà nhà.", "eng": "The gunman is holding two children hostage in the building."}, {"viet": "Kiểu đi với những bước dài là bắt buộc đối với môn đi bộ thi.", "eng": "The heel-and-toe walking is prescribed for race walking."}, {"viet": "Con ngựa vượt qua hàng rào thứ nhất một cách đẹp mắt.", "eng": "The horse took the first fence beautifully."}, {"viet": "Ngôi nhà suốt ngày náo nhiệt.", "eng": "The house has been full of activity all day."}, {"viet": "Súng của người đi săn nổ đoàng và con hươu ngã xuống chết.", "eng": "The hunter's rifle cracked and the deer fell dead."}, {"viet": "Khoản thu nhập từ việc bán các vật dụng và quần áo cũ trong nhà của họ là một khoản tiền phụ ngẫu nhiên do thói quen của họ là không vứt bỏ bất cứ cái gì.", "eng": "The income from their garage sale was a spillover from their habit of not throwing anything away."}, {"viet": "Nhận xét lăng mạ của anh ta là lí do gây một cuộc tranh luận gay gắt.", "eng": "The insulting remark was the occasion of a bitter quarrel."}, {"viet": "Công việc đã làm xong suôn sẻ cả-nhưng còn tiền thưởng mà chúng ta đã được hứa hẹn thì sao?", "eng": "The job's done-that's all well and good-but what about the bonus we were promised?"}, {"viet": "Bồi thẩm đoàn đang đà cân nhắc để tuyên án và chúng tôi chờ xem họ sẽ chọn mức án nào.", "eng": "The jury is considering its verdict and we're waiting to see which side of the fence they'll come down on."}, {"viet": "Hồ này được nhiều dòng suối nhỏ cung cấp nước.", "eng": "The lake is fed by several small streams."}, {"viet": "Luật về quyền của phụ nữ vẫn còn chưa thoả đáng nhưng sự thay đổi mới này là một bước của phương hướng đúng đắn.", "eng": "The law on women's rights is still unsatisfactory but this new change is a step in the right direction."}, {"viet": "Thư sẽ đến tay anh ta vào thứ hai là sớm nhất.", "eng": "The letter will reach him on Monday at the very earliest."}, {"viet": "Cuộc thảo luận sôi nổi đã khiến chúng tôi thực sự thấy hào hứng.", "eng": "The lively debate really pumped us up."}, {"viet": "Nhóm cực đoan bị hầu hết các đảng viên không thèm quan tâm đến.", "eng": "The lunatic fringe is ignored by most members of the party."}, {"viet": "Tác giả của ý đồ xây dựng một bệnh viện mới.", "eng": "The man behind the scheme to build a new hospital."}, {"viet": "Trận đấu đã đến lúc sôi nổi.", "eng": "The match has reached boiling-point."}, {"viet": "Cuộc họp đã bắt đầu lúc hai giờ kém mười lăm, chứ không phải hai giờ mười lăm.", "eng": "The meeting started at a quarter to two, not a quarter past two."}, {"viet": "Thợ mỏ làm việc trong 38 tiếng đồng hồ một tuần.", "eng": "The miners work for 38 hours per week."}, {"viet": "Tiền còn đủ cho đến tận cuối tháng.", "eng": "The money lasted until the end of the month."}, {"viet": "Ôtô đã tồn tại với chúng ta gần một thế kỷ rồi.", "eng": "The motor car has been with us for almost a century."}, {"viet": "Hàng nghìn người vô danh đã xây dựng kim tự tháp.", "eng": "The nameless thousands who built the pyramids."}, {"viet": "Quyển từ điển mới đã thành công.", "eng": "The new dictionary has really taken off."}, {"viet": "Những người lính mới sẽ tốt một khi họ đã được huấn luyện.", "eng": "The new recruits will be fine once they've been licked into shape."}, {"viet": "Những lời buộc tội của báo chí về việc làm sai trái của viên chức nhà nước chỉ là những lời khẳng định vu vơ.", "eng": "The newspaper's charge of official wrong doing were mere allegations."}, {"viet": "Bảng thông báo viết Chương ( theo đúng nguyên văn ) bắt đầu lúc 9h sáng.", "eng": "The notice read skool ( sic ) starts at 9 am."}, {"viet": "Tiền đánh cuộc trúng về con ngựa đó là 5 ăn 1.", "eng": "The odds are five to one on that horse."}, {"viet": "Ông già lang thang từ tỉnh này sang tỉnh khác chẳng biết tới đâu, chẳng biết làm gì.", "eng": "The old man floats from town to town with nowhere to go and nothing to do."}, {"viet": "Phe đối lập đã đưa ra nhiều đề nghị bổ sung vào bản dự luật.", "eng": "The Opposition have tabled several amendments to the bill."}, {"viet": "Cái công việc cạo sơn ở tường chán ngắt.", "eng": "The painful process of stripping the paint off the wall."}, {"viet": "Dưới sự lãnh đạo của bà ấy, đảng chẳng mấy chốc đã được phục hưng.", "eng": "The party soon regenerated under her leadership."}, {"viet": "Nông dân đã phải phục vụ và phục tùng lãnh chúa của họ.", "eng": "The peasants owed service and obedience to their overlord."}, {"viet": "Sự thành công vượt bậc của cuốn phim.", "eng": "The phenomenal success of the film."}, {"viet": "Ống nước vỡ và nước tràn cả lên sàn.", "eng": "The pipe broke and water streamed into the floor."}, {"viet": "Các kế hoạch đã được thảo luận đến một năm nay rồi, song vẫn chưa đạt đến một quyết định nào.", "eng": "The plans have been under discussion for a year now, but no decision has been reached."}, {"viet": "Những lớp dạng đám rối của võng mạc.", "eng": "The plexiform layers of the retting."}, {"viet": "Cảnh sát gặp phải một tình thế khó khăn.", "eng": "The police faced a difficult situation."}, {"viet": "Cảnh sát đã thành công trong việc trấn áp cuộc bạo động.", "eng": "The police succeeded in quelling the riot."}, {"viet": "Quần chúng nói chung phản đối sự thay đổi bất ngờ.", "eng": "The populace at large is opposed to sudden change."}, {"viet": "Quá trình chuẩn bị khá phức tạp.", "eng": "The preparation is a bit complicated."}, {"viet": "Tổng thống sẽ đặt con tàu đất nước lên đôi chân của nó.", "eng": "The president will put the ship of state on its feet."}, {"viet": "Vị thủ tướng được đón rước trọng thể qua các đường phố.", "eng": "The Prime Minister was received in state through the streets."}, {"viet": "Những vấn đề nói trên đã dẫn tới một số những gợi ý để cải cách.", "eng": "The problems cited above have led to a number of suggestions for reforms."}, {"viet": "Lời đề nghị được chấp thuận ngay.", "eng": "The proposal went through on the nod."}, {"viet": "Sự theo đuổi lợi nhuận là nguyên nhân chính của những sự thay đổi này.", "eng": "The pursuit of profit was the main reason for the changes."}, {"viet": "Nếu nhẹ hơn thì chiếc bè có lẽ nổi hơn.", "eng": "The raft would be more buoyant if it was less heavy."}, {"viet": "Sự chỉ trích gần đây đối với bà ta hình như chẳng tác động gì.", "eng": "The recent criticism she's had seems to have washed right over her."}, {"viet": "Cuộc đấu lại giữa Liverpool và Arsenal.", "eng": "The replay between Liverpool and Arsenal."}, {"viet": "Trẻ em trí óc chậm phát triển được đưa vào một lớp học đặc biệt.", "eng": "The retarded children were put into special class."}, {"viet": "Con sông uốn khúc về hướng Bắc ở điểm này.", "eng": "The river turns north at this point."}, {"viet": "Căn phòng có dấu của một cuộc vật lộn.", "eng": "The room bore evidence of a struggle."}, {"viet": "Những vận động viên chạy về thứ hai mỗi người nhận được một cái áo phông làm giải an ủi.", "eng": "The runners up each received a T-shirt as a consolation prize."}, {"viet": "Cảnh kết thúc khi đôi tình nhân ôm chặt nhau.", "eng": "The scene ended as the lovers clinched."}, {"viet": "Biển nổi sóng trên con tàu bị đắm.", "eng": "The sea was breaking over the wrecked ship."}, {"viet": "Huyết thanh này bị mất tác dụng do để ngoài không khí.", "eng": "The serum is vitiated by exposure to the air."}, {"viet": "Chiếc tàu đó đã gởi tín hiệu xin cứu cấp.", "eng": "The ship sent a radio message asking for help."}, {"viet": "Cuộc biểu diễn phục vụ số khán giả đông nghẹt.", "eng": "The show played to packed houses."}, {"viet": "Tình hình đưa đến sự đe doạ nghiêm trọng đối với hoà bình.", "eng": "The situation poses a grave threat to peace."}, {"viet": "Những vấn đề tiêu cực xã hội của sự nghèo đói và thất nghiệp.", "eng": "The social ills of poverty and unemployment."}, {"viet": "Tiếng chân nện thình thịch trên cầu thang.", "eng": "The sound of feet pounding on the stairs."}, {"viet": "Sự lan truyền bệnh tật, sự truyền bá kiến thức, sự phổ cập giáo dục.", "eng": "The spread of disease, knowledge, education."}, {"viet": "Những bậc thềm đã mòn do bước chân của hàng nghìn du khách.", "eng": "The steps had been worn away by the feet of thousands of visitors."}, {"viet": "Cuộc bãi công đã ngăn trở sản xuất mất một tuần.", "eng": "The strike tied up production for a week."}, {"viet": "Mặt trời chiếu ánh nắng nóng rực xuống sa mạc.", "eng": "The sun beat down on the desert sand."}, {"viet": "Công việc tỏ ra là khó khăn hơn chúng ta tưởng.", "eng": "The task proved more difficult than we'd thought."}, {"viet": "Thành công của đội phần lớn là do sự nỗ lực của cô ta.", "eng": "The team's success was largely due to her efforts."}, {"viet": "Sông Thames bắt nguồn từ Cotswold Hills.", "eng": "The Thames rises in the Cotswold Hills."}, {"viet": "Con hổ đã xổng ra khỏi vườn thú và chạy lồng lên như điên hàng mấy tiếng đồng hồ.", "eng": "The tiger escaped from the zoo and ran amok for hours."}, {"viet": "Thị xã chỉ trông thấy lờ mờ ở phía chân trời.", "eng": "The town was just a blur on the horizon."}, {"viet": "Cây ra lộc mới về mùa xuân.", "eng": "The trees send out new leaves in spring."}, {"viet": "Hai chính phủ tranh cãi về vấn đề chủ quyền lãnh thổ.", "eng": "The two governments disputed the ownership of the territory."}, {"viet": "Công đoàn đã bỏ phiếu đề nghị bãi công đòi tăng lương 10%.", "eng": "The union has voted to strike for a pay increase of 10%."}, {"viet": "Động từ có thể hoặc được thể hiện hoặc được hiểu ngầm.", "eng": "The verb may be either expressed of understood."}, {"viet": "Những người đi bộ chậm chạp tiến lên trên con đường lổn nhổn đá.", "eng": "The walkers were making slow progress up the rocky path."}, {"viet": "Nhân viên dự báo thời tiết nói rằng tối nay có thể tuyết rơi.", "eng": "The weatherman said it might snow tonight."}, {"viet": "Gió đã thổi bật tung mấy viên ngói ( bay khỏi mái ).", "eng": "The wind dislodged some tiles ( from the roof )."}, {"viet": "Từ sư tử nói lên một loại thú rừng.", "eng": "The word lion denotes a certain kind of wild animal."}, {"viet": "Người diễn viên trẻ được chọn không hợp với vai vua Lear.", "eng": "The young actor was badly miscast as Lear."}, {"viet": "Bố của chúng thích chúng về nhà sớm.", "eng": "Their father prefers them to be home early."}, {"viet": "Kiểu áo váy đơn giản của họ và sự hoàn toàn không khoa trương đã khiến tôi thích họ hơn.", "eng": "Their simple style of dress and complete lack of ostentation made me like them even more."}, {"viet": "Vậy quý vị muốn dùng món chính gì ạ?", "eng": "Then what would you like for your main course?"}, {"viet": "Khoảng 7 giờ tối nhu cầu về điện tăng lên đột ngột.", "eng": "There's a surge in electricity demand at around 7 pm."}, {"viet": "Bản nhạc này không được du dương lắm, phải không?", "eng": "There's not much melody in this piece, is there?"}, {"viet": "Có “ những cửa hàng giảm giá ” bán hàng với giá thấp và “ các cửa hàng mười xu ” chuyên bán rất nhiều loại hàng rẻ tiền.", "eng": "There are discount houses offering goods at low prices and dime stores specializing in a wide range of inexpensive items."}, {"viet": "Ở hai bên đường phố đều có cửa hàng.", "eng": "There are shops on both sides of the street."}, {"viet": "Có một sự cải tiến trong thương nghiệp.", "eng": "There has been an improvement in trade."}, {"viet": "Có dấu hiệu hứa hẹn ngày mai trời sẽ đẹp hơn.", "eng": "There is a promise of better weather tomorrow."}, {"viet": "Không có cái gì mà phải giấu giếm không biểu lộ được.", "eng": "There is nothing hid which shall be manifested."}, {"viet": "Tiếng kêu keng khi anh ta đánh rơi dụng cụ.", "eng": "There was a clang as he dropped the tools."}, {"viet": "Rất nhiều sự phản đối đối với con đường mới.", "eng": "There was lots of opposition to the new road."}, {"viet": "Người ta đưa ra nhiều thứ để lôi kéo làm cho tôi không thể nào từ chối công việc ấy được.", "eng": "There were so many enticements offered that I could not refuse the job."}, {"viet": "Những tàu đi biển này có thể bốc dỡ hàng trong hai ngày.", "eng": "These cruise ships can turn round in two days."}, {"viet": "Các viên thuốc này sẽ làm cho anh thư giãn và ngủ được.", "eng": "These pills will relax you and make you sleep."}, {"viet": "Hiện nay lễ hội powwow được tổ chức mọi nơi, từ đại Tây Dương đến Thái Bình Dương.", "eng": "They're held everywhere now, from the Atlantic to the Pacific Oceans."}, {"viet": "Tất cả đều tham gia hát những bài hát mừng Nô-en.", "eng": "They all joined in singing the Christmas carols."}, {"viet": "Rất khoa học trong cách tiếp cận.", "eng": "They are very scientific in their approach."}, {"viet": "Họ tuyên bố họ là những người tị nạn chính trị không phải là những người đi vì lý do kinh tế.", "eng": "They claimed they were political refugees and not economic migrants."}, {"viet": "Họ không biết họ đang tới hoặc đang đi.", "eng": "They don't know whether they are coming or going."}, {"viet": "Họ chào mừng tổng thống với nhiều sự biểu lộ niềm vui thích.", "eng": "They greeted the president with many expressions of pleasure."}, {"viet": "Họ phải làm việc chăm chỉ để lo cơm ăn áo mặc cho một gia đình lớn.", "eng": "They have to work hard to feed and clothe their large family."}, {"viet": "Họ xác nhận rằng ma không có thật.", "eng": "They maintained that ghosts had no substance."}, {"viet": "Họ tiếp thức ăn liên tục cho cô ấy hoặc hỏi dồn dập.", "eng": "They plied her with food or with questions."}, {"viet": "Họ nói rằng những kẻ giết người luôn quay trở lại nơi diễn ra tội ác.", "eng": "They say that murderers always return to the scene of the Crime."}, {"viet": "Họ phát hiện ra hắn và thấy hắn nói dối.", "eng": "They sussed him out and found he was lying."}, {"viet": "Họ bị buộc tội là có tham gia âm mưu chống lại nhà vua.", "eng": "They were accused of being privy to the plot against the king."}, {"viet": "Họ được thả không bị kết tội.", "eng": "They were released from detention without being charged."}, {"viet": "Hãy nghĩ ra câu trả lời trước khi bắt đầu viết.", "eng": "Think out your answer before you start writing."}, {"viet": "Chương này tiếp tục ở chỗ chương trước dừng lại.", "eng": "This chapter takes up where the last one left off."}, {"viet": "Thuốc này đã gây nên một tác động xấu.", "eng": "This drug has produced very bad effects."}, {"viet": "Đây là một tình trạng khá lộn xộn mà anh đẩy chúng tôi vào!", "eng": "This is a fine mess you've landed us in!"}, {"viet": "Đây là lần xuất bản thứ hai của cuốn từ điển này.", "eng": "This is the second edition of the dictionary."}, {"viet": "Số tiền này sẽ nuôi sống chúng ta độ chừng một tuần lễ.", "eng": "This money will carry us for about a week."}, {"viet": "Bài thơ này truyền đạt nỗi tuyệt vọng của tác giả.", "eng": "This poem communicates the author's despair."}, {"viet": "Giải pháp này có thể được tất cả các bên liên quan chấp nhận không?", "eng": "This solution acceptable to all parties concerned?"}, {"viet": "Cái đồng hồ này lúc nào cũng chạy sai giờ, tôi mong giá như mua được một cái tốt hơn.", "eng": "This watch keeps going wrong, I wish I'd bought a better make."}, {"viet": "Hàng ngàn công nhân đã mất việc khi nhà máy đóng cửa.", "eng": "Thousands of workers lost their jobs when the factory closed."}, {"viet": "Chiều mai, chúng ta sẽ phải bắt tay vào công việc, có nghĩa là tổ chức vào cuộc thảo luận về công việc làm ăn.", "eng": "Tomorrow afternoon, we'll have to get down to business, that is, to hold some talks on business affairs."}, {"viet": "Trừ khi nó ngừng làm việc quần quật như thế này không thì nó sẽ bị gục mất.", "eng": "Unless he stops driving himself like this he'll have a breakdown."}, {"viet": "Vốn kiến thức của anh có chuẩn bị tốt cho nghề của anh không?", "eng": "Was your education a good preparation for your career?"}, {"viet": "Tôi sợ rằng chúng ta sẽ phải đẩy cho xe nổ máy.", "eng": "We'll have to give it a push-start, I'm afraid."}, {"viet": "Chúng tôi hi vọng sự trở lại bình thường trong quan hệ quốc tế của chúng tôi.", "eng": "We're hoping for a return to normality in our international relations."}, {"viet": "Chúng tôi đã triệu tập một cuộc họp khẩn cấp các thống đốc bang.", "eng": "We've called an emergency meeting of the governors."}, {"viet": "Chúng tôi đồng ý với phần chủ yếu của bản báo cáo của anh nhưng không đồng ý với những chi tiết của nó.", "eng": "We agree with the substance of your report but not with its details."}, {"viet": "Chúng ta đạt được ít tiến triển trong các cuộc đàm phán.", "eng": "We are making little headway with the negotiations."}, {"viet": "Chúng tôi mua cái nhà này vì sự tiện lợi của nó, nó ở gần các cửa hàng và dịch vụ đi lại rất tốt.", "eng": "We bought this house for its convenience, it's very near the shops and there is a good transport service."}, {"viet": "Chúng ta có thể trang trí lại căn phòng không tốn kém bao nhiêu, nếu chúng ta dùng chỗ sơn cũ này.", "eng": "We can redecorate the room at little expense, if we use this old paint."}, {"viet": "Chúng tôi quyết định hoãn kì nghỉ của chúng tôi đến tháng sau.", "eng": "We decided to delay our holiday until next month."}, {"viet": "Chúng tôi đã thí nghiệm cho đến khi thành công trong việc pha được đúng màu.", "eng": "We experimented until we succeeded in mixing the right colour."}, {"viet": "Chúng tôi đã đi được hơn một tuần rồi.", "eng": "We had been travelling over a week."}, {"viet": "Chúng tôi có thịt gà, thịt bò hoặc một phần ăn kiểu Trung Quốc.", "eng": "We have chicken, beef or a Chinese meal."}, {"viet": "Chúng tôi chưa quyết định giá nhưng sẵn sàng xem xét các giá đề nghị.", "eng": "We haven't decided on a price but we're open to offers."}, {"viet": "Chúng tôi sống giữa một xóm giềng khá giàu.", "eng": "We live in a rather rich neighbourhood."}, {"viet": "Ta phải đưa lực lượng cảnh sát lên con số cần thiết.", "eng": "We must bring the police force up to strength."}, {"viet": "Chúng tôi cần thêm nhiều người hành động và bớt người tổ chức.", "eng": "We need more doers and fewer organizers."}, {"viet": "Chúng tôi đến làm thủ tục trả phòng.", "eng": "We're here to check out."}, {"viet": "Phải đến tuần sau chúng ta mới biết được kết quả.", "eng": "We shan't know the results until next week."}, {"viet": "Chúng tôi đã ghi chú toàn bộ chương 3 đấy?", "eng": "We took notes on all of Chapter Three?"}, {"viet": "Chúng tôi đã hơi lo lắng về khối lượng được bảo đảm, nhưng mọi chuyện đã được giải quyết thỏa đáng.", "eng": "We were a little worried about a guaranteed volume, but everything was settled satisfactorily."}, {"viet": "Chúng tôi được bảo là cứ tự do dùng thức ăn.", "eng": "We were told to help ourselves to the food ad lib."}, {"viet": "Quà cưới, Noel, sinh nhật, v. v.", "eng": "Wedding, Christmas, birthday, etc presents."}, {"viet": "Ờ, trông có vẻ như lại quay lại từ đầu.", "eng": "Well, it looks like it's back to square one."}, {"viet": "Câu chuyện phía tây, vở nhạc kịch âm nhạc của Leonard Berstein.", "eng": "Westside Story's, a musical with music by Leonard Berstein."}, {"viet": "Theo bạn con vật nào làm thú cưng tốt nhất?", "eng": "What animal do you think makes the best pet?"}, {"viet": "Người ta dùng tiêu chuẩn nào để xét rượu ngon?", "eng": "What criteria do you use to judge a good wine?"}, {"viet": "Điện thoại di động của bạn có những đặc điểm gì?", "eng": "What features does your cellular phone have?"}, {"viet": "Ở nước bạn, tuổi được đi bầu cử theo luật định là bao nhiêu?", "eng": "What is the legal voting age in your country?"}, {"viet": "Bạn thích hát loại bài hát nào?", "eng": "What kind of songs do you like to sing?"}, {"viet": "Tôi phải làm gì nếu tôi không thể đọc được bản đồ đó?", "eng": "What should I do if I can't read the map?"}, {"viet": "Cái mà anh thấy dưới đó là trại powwow chính.", "eng": "What you see down there is the main powwow camp."}, {"viet": "Khi anh ta nhận ra là chúng tôi đã biết sự thật, toàn bộ câu chuyện đã được tuôn ra hết.", "eng": "When he realized we knew the truth, the whole story came pouring out."}, {"viet": "Khi bạn tôi tới chơi, chúng tôi thường chơi đá bóng.", "eng": "When my friend comes to see me, we play football."}, {"viet": "Khi không được tin gì về cô ta, họ đã lo sợ điều tệ hại nhất.", "eng": "When they did not hear from her, they feared the worst."}, {"viet": "Hôm nay chúng ta sẽ đi ăn trưa ở đâu?", "eng": "Where are we going to eat lunch today?"}, {"viet": "Chúng ta có đi picnic được hay không là tuỳ thuộc vào thời tiết.", "eng": "Whether we can picnic depends on the weather."}, {"viet": "Nhà ga nào nhộn nhịp nhất ở Tokyo?", "eng": "Which station is the busiest in Tokyo?"}, {"viet": "Ai là người đầu tiên người đó sẽ được giải.", "eng": "Who ever is the first to finish will get the prize."}, {"viet": "Tại sao mẹ lại xem câu chuyện đó?", "eng": "Why did you watch that story?"}, {"viet": "Tại sao anh không chú ý khi tôi giải thích?", "eng": "Why weren't you attending when I explained before?"}, {"viet": "Xin bác vui lòng hẹn với nha sĩ giúp cháu nhé?", "eng": "Will you make me an appointment with the dentist, please?"}, {"viet": "Với bóng bay và bánh mì xúc xích... và rất nhiều pháo hoa.", "eng": "With balloons and hot dogs... and, fireworks, galore."}, {"viet": "Công việc tiến bộ vững chắc, nhanh chóng, v. v.", "eng": "Work which moves steadily, quickly, etc."}, {"viet": "Ông thích ăn đùi hay ngực?", "eng": "Would you like some leg or some breast?"}, {"viet": "Cô vui lòng cho tôi một ly nước lạnh được không?", "eng": "Would you please give me a glass of water?"}, {"viet": "Phải, có vẻ như trời sẽ lạnh hơn vào ngày mai.", "eng": "Yes, and it's supposed to get even colder tomorrow."}, {"viet": "Có, có một chai rượu uýt-ki.", "eng": "Yes, there is one bottle of whiskey."}, {"viet": "Anh mà bị bắt gặp đang làm điều đó anh sẽ bị mắng nhiếc đấy.", "eng": "You'll get told off if you're caught doing that."}, {"viet": "Chưa chi anh đã ra về rồi sao?", "eng": "You're not leaving us already, are you?"}, {"viet": "Anh ho nhiều quá, tôi nghĩ là anh hút thuốc quá nhiều.", "eng": "You are coughing a lot, I think you smoke too much."}, {"viet": "Chúng ta đành phải đồng ý là có sự khác biệt vậy.", "eng": "You can't persuade me to change my mind about what I differ from you."}, {"viet": "Sau bữa ăn, các anh có thể tặng một ít trái cây miễn phí.", "eng": "You can offer some fruit free of charge after the meal."}, {"viet": "Anh không nhận được tặng phẩm thôi việc à?", "eng": "You didn't get a leaving present??"}, {"viet": "Khu vườn ở sân sau của bạn thật là đẹp!", "eng": "You have such a beautiful garden in your backyard!"}, {"viet": "Trông ông có vẻ hơi mệt, phải không?", "eng": "You look rather tired, are you?"}, {"viet": "Anh phải đầu tư vào nếu anh muốn doanh nghiệp của anh phát triển.", "eng": "You must invest if you want your business to grow."}, {"viet": "Anh nên làm từ từ thôi cho đến khi anh cảm thấy thật sự khoẻ lại.", "eng": "You ought to go slow until you feel really well again."}, {"viet": "Để được yên tâm, bạn nên mua bảo hiểm y tế.", "eng": "You should purchase health insurance just to be on the safe side."}, {"viet": "Anh muốn đi thử con đường mới này chứ không phải tôi, vì vậy anh phải chịu trách nhiệm lấy.", "eng": "You wanted to try this new route, not me, so on your head be it."}, {"viet": "Những thanh niên tốt nghiệp đại học đang mưu cầu thành công trong cuộc sống.", "eng": "Young graduates seeking after success in life."}, {"viet": "Tên anh có trong giấy xe, nhưng ai mới thật sự là người chủ của chiếc xe ấy?", "eng": "Your name is on the car's documents, but who really owns it?"}]