[{"viet": "Lòng đố kỵ gay gắt đã làm giảm dần tình bạn của họ.", "eng": "A bitter envy that has corroded their friendship."}, {"viet": "Một đứa trẻ đi xe đạp lảo đảo dọc theo vỉa hè.", "eng": "A child came wobbling along the pavement on a bicycle."}, {"viet": "Một bản báo cáo lộn xộn về những gì đã xảy ra.", "eng": "A confused account of what happened."}, {"viet": "Một bà cụ nhỏ bé đáng yêu đã chỉ đường giúp tôi.", "eng": "A dear little old lady helped me find my way."}, {"viet": "Một hối phiếu do một ngân hàng Mỹ thanh toán.", "eng": "A draft on an American bank."}, {"viet": "Một vụ tăng giá năm mươi phần trăm.", "eng": "A fifty percent increase in price."}, {"viet": "Một việc rắc rối nữa là Fred không chịu đi bằng máy bay.", "eng": "A further complication was Fred's refusal to travel by air."}, {"viet": "Cậu còn nợ một khoản tiền lớn.", "eng": "A great deal of money is due you."}, {"viet": "Bức tường cao làm con phố đó thành một phố cụt.", "eng": "A high wall made the street a cul-de-sac."}, {"viet": "Quyết định của ban bồi thẩm trong một vụ xử án ở tòa phải tuyệt đối công bình.", "eng": "A jury's decision in a court case must be absolutely objective."}, {"viet": "Một giấy phép thăm dò vùng đất phía Bắc.", "eng": "A license to prospect in the northern territory."}, {"viet": "Máy sẽ phết hồ lên gáy sách và ghép vào bìa.", "eng": "A machine puts paste on the end papers of the book and puts it into the case."}, {"viet": "Một dây cáp kim loại bên trong ống nhựa.", "eng": "A metal cable inside a plastic sleeve."}, {"viet": "Một trẻ sơ sinh và một việc làm mới cả hai đều cần nhiều quan tâm đấy.", "eng": "A new baby and a new job can both be very demanding."}, {"viet": "Một chỗ đau ở giữa lưng của anh ta.", "eng": "A pain in the middle of his back."}, {"viet": "Một bản dịch sai lệch của một thiên anh hùng ca.", "eng": "A perverted translation of an epic poem."}, {"viet": "Một cuộc hưởng ứng yếu ớt đối với lời kêu gọi gây quỹ.", "eng": "A poor response to the appeal for funds."}, {"viet": "Một máy bơm trong nồi hơi đưa nước nóng đi quanh hệ thống trung tâm sưởi nóng.", "eng": "A pump in the boiler sends hot water round the central heating system."}, {"viet": "Một sự sống lại của chủ nghĩa quân phiệt hung hãn và bạo ngược thuộc thập kỷ ba mươi và bốn mươi.", "eng": "A revival of the aggressive, jackbooted militarism of the thirties and forties."}, {"viet": "Một quyển sách chắp vá gồm những bài báo đã được đăng ở nơi nào khác.", "eng": "A scrappy book consisting of articles published elsewhere."}, {"viet": "Một cơn rùng mình sợ hãi chạy khắp người hắn.", "eng": "A shudder of fear ran through him."}, {"viet": "Một người lính với những tấm huy chương gắn trên ngực áo khoác của anh ta.", "eng": "A soldier with medals pinned to the breast of his coast."}, {"viet": "Một người lạ có tên là Fred đã đến gặp tôi.", "eng": "A strange man, fred by name came to see me."}, {"viet": "Một đội ngũ các nhà thiết kế từ Mỹ và Châu Âu làm việc với một tập thể nhân viên được ủy thác đặc biệt ở đây để tạo ra một kết quả ngoạn mục với các đài phun nước, các khối đá và các khu vườn.", "eng": "A team of designers from America and Europe worked with a specially commissioned staff here to create a spectacular effect with fountains, rocks and gardens."}, {"viet": "Một chuyến đi thăm viện bảo tàng được xếp vào chương trình cho thứ ba tới.", "eng": "A trip to the museum is programmed for next Tuesday."}, {"viet": "Một tuần hầu như mưa liên tục.", "eng": "A week of almost incessant rain."}, {"viet": "Cách đây khoảng 500 năm người ta đã chế tạo ra những chiếc đồng hồ đeo tay đầu tiên.", "eng": "About 500 years ago the first watches were made."}, {"viet": "Cho thêm sơn màu cam để tạo sắc thái ấm hơn.", "eng": "Add oranges paint to get a warmer hue."}, {"viet": "Cuối cùng thì cái đó có nghĩa lý gì?", "eng": "After all, what does it matter?"}, {"viet": "Sau khi gặp gỡ tất cả những ứng viên, chúng tôi quyết định chọn người này.", "eng": "After seeing all the candidates we've decided on this one."}, {"viet": "Sau khi cháu sử dụng phòng tắm, vui lòng để cửa mở nhé.", "eng": "After you use the bathroom, please leave the door open."}, {"viet": "Cơ bản nhất là tất cả vật chất đều bao gồm các nguyên tử.", "eng": "All matter ultimately consists of atoms."}, {"viet": "Tất cả những vấn đề khác đều là thứ yếu đối với vấn đề này.", "eng": "All the other issues are subordinate to this one."}, {"viet": "Mặc dù nội dung bài nói chuyện của cô ta khá tẻ nhạt, nhưng sự truyền đạt dí dỏm của cô ta đã làm cho khán giả chú ý.", "eng": "Although the subject-matter of her talk was rather dull her witty delivery kept the audience interested."}, {"viet": "Một ngôi sao nhạc pop lớn tuổi cố lấy lại phong độ trước đây.", "eng": "An aging pop star trying to stage a come-back."}, {"viet": "Một cái khoan điện với một bộ phụ kiện khác nhau.", "eng": "An electric drill with a range of different attachments."}, {"viet": "Một người đấu tranh không mệt mỏi cho quyền công dân.", "eng": "An indefatigable campaigner for civil rights."}, {"viet": "Một cơ hội để giao thiệp với các đồng nghiệp mới.", "eng": "An opportunity to socialize with new colleagues."}, {"viet": "Còn các ngôi sao trong một chòm sao không thường xuyên chuyển động cùng một hướng.", "eng": "And the stars of constellation are not always moving in the same direction."}, {"viet": "Dư luận chống Mỹ đang là cao trào tại một số nước.", "eng": "Anti-American sentiment is running high in some countries."}, {"viet": "Quan điểm cô ta nghiêng về cánh tả hay hữu?", "eng": "Are her views to the left or right of centre?"}, {"viet": "Ngày mai bạn có định đi dự tiệc không?", "eng": "Are you doing to the party tomorrow?"}, {"viet": "Anh có sẵn sàng đứng ra bảo đảm về hạnh kiểm tốt của bạn anh hay không?", "eng": "Are you willing to be a guarantee of your friend's good behaviour?"}, {"viet": "Cô ta vừa là tiểu thuyết gia vừa là giảng viên đại học, như vậy là vẹn cả đôi đàng.", "eng": "As both a novelist and a university lecturer, she has two strings to her bow."}, {"viet": "Về các kế hoạch của ông ta, hoàn toàn là không thể biết được.", "eng": "As to his plans, there is simply no telling."}, {"viet": "Cuối cùng họ lại thân thiện với nhau!", "eng": "At last they're on speaking terms again!"}, {"viet": "Những thái độ đã ăn sâu trong tâm trí của người Anh.", "eng": "Attitudes that are deeply ingrained in the English consciousness."}, {"viet": "Đầy vẻ mạnh khoẻ và tràn trề sinh lực.", "eng": "Be bursting with health and vitality."}, {"viet": "Được tặng thưởng về các việc tốt của ai.", "eng": "Be rewarded for one's good deeds."}, {"viet": "Bắc Đới Hà là nơi nghỉ mát mùa hè nổi tiếng nhất ở Trung Quốc nhờ phong cảnh đẹp và khí hậu dễ chịu.", "eng": "Beidaihe is the most famous summer resort in China profits beautiful landscape and pleasant climate."}, {"viet": "Nhớt đen đã rỉ ra máy.", "eng": "Black oil was oozing out of the engine."}, {"viet": "Brighton là trung tâm nghỉ mát hàng đầu ở bờ biển phía nam.", "eng": "Brighton is a leading south coast resort."}, {"viet": "Doanh số luôn luôn tăng mạnh trước Giáng sinh.", "eng": "Business is always brisk before Christmas."}, {"viet": "Nhưng bây giờ mọi thứ ở đây đều thật thanh bình và tĩnh lặng.", "eng": "But now everything here is so peaceful and tranquil."}, {"viet": "Thật may mắn khi tôi bị tấn công thì có một cảnh sát đi qua.", "eng": "By a happy chance, a policeman was passing as I was attacked."}, {"viet": "Cai-rô là thủ đô Ai Cập.", "eng": "Cairo is the capital of Egypt."}, {"viet": "Vui lòng cho tôi xem những món đồ cổ Trung Quốc này?", "eng": "Can I see these Chinese antiques, please?"}, {"viet": "Cậu có thể loại bỏ tiếng lạo xạo trên radio của tôi được không?", "eng": "Can you get rid of the crackle on my radio?"}, {"viet": "Bạn còn có thể mua vải theo thước ở Anh không?", "eng": "Can you still buy cloth by the yard in Britain?"}, {"viet": "Xách túi này-nó nhẹ nhất đấy.", "eng": "Carry this bag-it's the lightest."}, {"viet": "Bọn trẻ con phá phách trong các luống hoa.", "eng": "Children committing mayhem in the flower beds."}, {"viet": "Rửa sạch khu vực nhiễm trùng bằng thuốc sát trùng.", "eng": "Clean the infected area with disinfectant."}, {"viet": "Thứ bảy đến dự tiệc nhớ mang theo một chai rượu nhé!", "eng": "Come to my party on Saturday-and remember to bring a bottle!"}, {"viet": "Xin chúc mừng, tôi nghe nói bạn đã bỏ hút thuốc!", "eng": "Congratulations, I heard you stopped smoking!"}, {"viet": "Chúng ta có thể tập trung vào việc cần xử lý trước mắt này được không?", "eng": "Could we concentrate on the matter in hand, please?"}, {"viet": "Anh có thể cho tôi biết vài điều về việc mướn hộp ký gửi an toàn ở đây được không?", "eng": "Could you tell me something about renting a safe deposit box here?"}, {"viet": "Chân của ai bị đứt vì một mảnh thủy tinh vỡ.", "eng": "Cut one's foot on a small shiver of glass."}, {"viet": "Hoãn ngày đi lại của ai.", "eng": "Defer one's departure to a later date."}, {"viet": "Những lời chỉ dẫn chi tiết đều được đưa vào trong cuốn sách nhỏ này.", "eng": "Detailed instructions are included in the booklet."}, {"viet": "Bạn có biết là có một số người Nhật chơi bóng chày cho các đội lớn thuộc liên đoàn không?", "eng": "Did you know that there are some Japanese who play major league baseball?"}, {"viet": "Tỏ thái độ khiếm nhã trước xúc cảm của người khác.", "eng": "Display a cavalier attitude towards the feelings of others."}, {"viet": "Sổ sách kế toán của xí nghiệp có cân đối không?", "eng": "Do the firm's accounts balance?"}, {"viet": "Bạn có cảm thấy cuộc sống ở Nhật Bản căng thẳng không?", "eng": "Do you feel that life in Japan is stressful?"}, {"viet": "Ở nước bạn có một số truyện thiếu nhi nổi tiếng phải không?", "eng": "Do you have some famous children's stories in your country?"}, {"viet": "Ông có may các bộ vét theo số đo không?", "eng": "Do you make suits to measure?"}, {"viet": "Bạn nghĩ có đáng du lịch vòng quanh nước này trước khi tôi trở về hay không?", "eng": "Do you think it's worth making a trip around the country before I go back?"}, {"viet": "Bác sĩ ạ, mỗi khi tôi ho tôi thấy nóng rát trong cổ họng và ngực tôi đau.", "eng": "Doctor, whenever I cough I have a burning sensation in my throat and my chest hurts."}, {"viet": "Tặng tiền ủng hộ việc từ thiện.", "eng": "Donate money to support a charity."}, {"viet": "Đừng có khuyến khích những tật xấu của đứa trẻ.", "eng": "Don't encourage bad habits in a child."}, {"viet": "Đừng nhìn ra sau kẻo bị ngã đấy.", "eng": "Don't look behind or you may fall."}, {"viet": "Đừng có nói với hắn, hắn ngu ơi là ngu.", "eng": "Don't talk to him, he's so crass."}, {"viet": "Phía hạ lưu con sông đó có nhiều chỗ ngoằn ngoèo và uốn khúc.", "eng": "Downstream the river twists and turns a lot."}, {"viet": "Bụi bặm dơ dáy ngày càng tích tụ lại nếu nhà cửa không được lau chùi thường xuyên.", "eng": "Dust and dirt soon accumulate if a house is not cleaned regularly."}, {"viet": "Thi đua với chị cô ta về những thành tích thể thao.", "eng": "Emulate her sister's sporting achievements."}, {"viet": "Thậm chí bây giờ tôi vẫn bị khó khăn khi viết chữ liền nhau.", "eng": "Even now I have difficulty writing in cursive."}, {"viet": "Rõ ràng ông ta đã quyết định ra đi.", "eng": "Evidently he has decided to leave."}, {"viet": "Cuộc thám hiểm nhằm khám phá các bí mật dưới đáy đại dương.", "eng": "Exploration to unlock the secrets of the ocean bed."}, {"viet": "Số mệnh đã an bài là ông ấy phải chết trong cảnh nghèo khổ.", "eng": "Fate had ordained that he should die in poverty."}, {"viet": "Cuối cùng cô ấy chơi lá bài quyết định của mình và đe dọa sẽ từ chức.", "eng": "Finally she played her trump-card and threatened to resign."}, {"viet": "Vẫy bàn tay trên đầu của ai.", "eng": "Flail hands above one's head."}, {"viet": "Muốn biết thêm chi tiết, bạn hãy gửi một phong bì dán sẵn tem và ghi địa chỉ của mình tới địa chỉ sau đây.", "eng": "For further details, send a stamped addressed envelope to the following address."}, {"viet": "Thật tình, tôi không thể bớt lo lắng.", "eng": "Frankly, I couldn't care less."}, {"viet": "Tích trữ thóc lúa cho mùa đông.", "eng": "Garner up the grain for the winter."}, {"viet": "Đoạt giải ba là sự an ủi không tương xứng với cả quá trình làm việc chăm chỉ của họ.", "eng": "Getting third prize was poor consolation for all their hard work."}, {"viet": "Căn cứ vào thiện chí của cả hai bên, tôi tin chắc chúng ta có thể đạt đến thoả thuận.", "eng": "Given goodwill on both sides I'm sure we can reach agreement."}, {"viet": "Thư ký giỏi luôn luôn được nhiều nơi cần đến.", "eng": "Good secretaries are always in demand."}, {"viet": "Đợi một chút, tôi chưa hoàn toàn chuẩn bị xong.", "eng": "Half a mo, I'm not quite ready."}, {"viet": "Cảnh sát có bắt được người làm việc đó không?", "eng": "Have the police nailed the man who did it?"}, {"viet": "Bạn có bao giờ ở trong một quán trọ kiểu Nhật chưa?", "eng": "Have you ever stayed in a Japanese style inn?"}, {"viet": "Trước đây anh đã xem vở ba lê này chưa?", "eng": "Have you seen this ballet before?"}, {"viet": "Anh ta là một người bán hàng giỏi nhưng cung cách xuồng xã của anh ta có chiều hướng làm mọi người không bằng lòng.", "eng": "He's a good salesman, but his offhand manner does tend to put people off."}, {"viet": "Nó bị một viên đạn bắn tỉa bắn đúng vào chân.", "eng": "He's been hit in the leg by a sniper's bullet."}, {"viet": "Anh ta thì ở đây còn những người khác thì đã về nhà.", "eng": "He's here, everyone else has gone home."}, {"viet": "Anh ta chịu trách nhiệm về toàn bộ công việc chuẩn bị cho chuyến đi.", "eng": "He's responsible for all the travel arrangements."}, {"viet": "Ông ta đã kết tội tôi xâm phạm đất đai của ông ta.", "eng": "He accused me of trespassing on his estate."}, {"viet": "Ông ta yêu cầu được thông báo sát sao cho ông về số sách bán được của ông ta.", "eng": "He asked them to keep him posted about the sales of his book."}, {"viet": "Năm ngoái anh ta bị gãy tay nhưng anh vẫn chơi dương cầm điêu luyện như trước.", "eng": "He broke his arms last year but he plays the piano as skillful as ever."}, {"viet": "Chắc chắn là anh ta đã làm bẽ mặt những đồng nghiệp khi anh ta được sự chấp thuận của ông chủ.", "eng": "He certainly did his colleagues in the eye when he got the boss's approval."}, {"viet": "Anh ta bị ngã quỵ xuống sàn vì một cú đánh mạnh.", "eng": "He crashed down on the floor with a wallop."}, {"viet": "Anh ta không muốn bị nhận diện nên anh ta cải trang để đi lại.", "eng": "He didn't want to be recognized, so he traveled incognito."}, {"viet": "Ông nổi bật với tư cách là một lãnh tụ vào năm 30 tuổi.", "eng": "He emerges as leader at the age of thirty."}, {"viet": "Anh ta cảm thấy bị tập quán ràng buộc.", "eng": "He felt hemmed in by convention."}, {"viet": "Hắn giật mạnh cái răng một cái và nó long ra.", "eng": "He gave his tooth a sharp jerk and it came out."}, {"viet": "Hắn ta tóm lấy cổ áo tôi và kéo tôi về phía hắn.", "eng": "He grabbed my collar and pulled me towards him."}, {"viet": "Hắn phải vào tù một tháng, đó là chưa nói tới số tiền bị phạt.", "eng": "He had to go to prison for a month, to say nothing of the fine."}, {"viet": "Anh ấy được đưa vào để tăng cường hàng hậu vệ.", "eng": "He has been brought in to strengthen the defense."}, {"viet": "Ông ấy phải về nhà trước 5 giờ.", "eng": "He has to be home by five."}, {"viet": "Nó cao 6 bộ 2 in.", "eng": "He is 6 ft 2 in tall."}, {"viet": "Hiện giờ ông ấy không có ở đây.", "eng": "He is not here at the moment."}, {"viet": "Cứ năm giây là anh ta quay nhanh để né, và bây giờ lại lái chiếc xe tăng của mình qua trái.", "eng": "He jinked every five seconds, and now brought his tank left again."}, {"viet": "Anh ấy bỏ đi mà không nói với bất cứ ai cả.", "eng": "He left without any speaking to anyone else."}, {"viet": "Anh ta mất thăng bằng trên sàn nhà ướt và ngã.", "eng": "He lost his footing on the wet floor and fell."}, {"viet": "Anh ấy nhỡ chuyến xe lửa 9 giờ rưỡi.", "eng": "He missed the 9.30 train."}, {"viet": "Anh ta diễn quá cường điệu vai người chồng dễ thương.", "eng": "He overacts the part of the loving husband."}, {"viet": "Anh ta thích làm công việc tự do hơn vì anh ta thích làm chủ bản thân mình.", "eng": "He prefers freelance work because he enjoys being his own master."}, {"viet": "Ông ấy nhanh chóng quen với thức ăn địa phương.", "eng": "He quickly became accustomed to the local food."}, {"viet": "Nó cãi lại rằng điều này hoàn toàn đúng.", "eng": "He rejoined that this was quite right."}, {"viet": "Cậu ta động một tý là khóc.", "eng": "He's a dreadful cry-baby."}, {"viet": "Cậu ta nộp bài làm muộn.", "eng": "He's behind in handing in homework."}, {"viet": "Anh ta kết hôn với một nữ văn sĩ nổi tiếng.", "eng": "He's married to a famous writer."}, {"viet": "Ông ta đang nghĩ về việc bước vào chính trường.", "eng": "He's thinking of going into politics."}, {"viet": "Nó nói là dù sao chăng nữa thì nó đã không muốn cưới cô ta, nhưng đó chỉ là kiểu nói nho xanh chẳng đáng miệng người phong lưu mà thôi.", "eng": "He says he didn't want to marry her anyway, but that's just sour grapes."}, {"viet": "Anh ta phóng nhanh ra cửa đuổi theo cô ấy.", "eng": "He shot out of the door after her."}, {"viet": "Hắn bán xe mà không cho vợ hắn biết.", "eng": "He sold the car without his wife've knowledge."}, {"viet": "Anh ta lưu lại khách sạn ba đêm.", "eng": "He stayed three nights at the hotel."}, {"viet": "Ông ta công khai ủng hộ chính sách của chính phủ nhưng trong riêng tư, ông biết chính sách đó sẽ thất bại.", "eng": "He supported the official policy in public, but privately he knew it would fail."}, {"viet": "Anh ấy thảy được ba con sáu liền một lúc.", "eng": "He threw three sixes in a row."}, {"viet": "Anh ta dịch bài diễn văn từ tiếng Tây Ban Nha sang tiếng Anh.", "eng": "He translated the speech from Spanish into English."}, {"viet": "Ông ta chơi trội hơn các diễn giả khác bằng cách minh họa cuộc nói chuyện của mình bằng ảnh đèn chiếu.", "eng": "He upstaged the other speakers by illustrating his talk with slides."}, {"viet": "Ông ta là người hậu thuẫn việc chống lại chủ nghĩa cực đoan trong đảng.", "eng": "He was a buttress against extremism in the party."}, {"viet": "Nó đánh con lừa một cách tàn nhẫn.", "eng": "He was belaboured the donkey mercilessly."}, {"viet": "Anh ấy quyết ép bọn trùm băng đảng phải lộ diện.", "eng": "He was determined to smoke out the leaders of the gang."}, {"viet": "Ông ấy bị bắt làm tù binh trong suốt cuộc chiến tranh.", "eng": "He was held prisoner throughout the war."}, {"viet": "Anh ta lên tới chín tầng mây sau chiến thắng.", "eng": "He was on cloud nine after his victory."}, {"viet": "Anh ta bị tù ba năm lao động khổ sai.", "eng": "He was sentenced to three year hard labour."}, {"viet": "Nó quá khôn khéo đối với chúng tôi.", "eng": "He was too clever for us."}, {"viet": "Ông ta bắt đầu giãi bày dài dòng chuyện đó.", "eng": "He went into a long explanation of the affair."}, {"viet": "Nó được giải 20.000 pao trong cuộc cá độ bóng đá.", "eng": "He won the 20000 pounds prize on the football pools."}, {"viet": "Như thế Heany hẳn là cứ tiếp tục làm một thi sĩ phong phú về ngôn ngữ xác thực.", "eng": "Heany must thus continue to be a poet rich in tactile language."}, {"viet": "Cuộc hẹn gặp của cô ấy là 10 giờ sáng nhưng mãi đến 10g30 cô ấy mới xuất hiện.", "eng": "Her appointment was for 10 a. m, but she didn't appeal till 10: 30."}, {"viet": "Việc đòi bồi thường của cô ta bị bác bỏ với lý do cô ta chưa đóng bảo hiểm.", "eng": "Her claim was disallowed on the grounds that she had not paid her premium."}, {"viet": "Kinh nghiệm của cô ta trong nhiều trường hợp giống kinh nghiệm của tôi.", "eng": "Her experiences parallel mine in many instances."}, {"viet": "Tóc cô ta được buộc túm lại phía sau bằng một cái ruy băng đen.", "eng": "Her hair was tied back with a black ribbon."}, {"viet": "Cách ăn nói của cô ta giản dị và không trau chuốt.", "eng": "Her language is simple and unadorned."}, {"viet": "Cái nón mới hẳn là thích hợp với cô ấy.", "eng": "Her new hat certainly becomes her."}, {"viet": "Học sinh của cô ta thường bị cô mắng nhiếc thậm tệ khi chúng không nghe lời.", "eng": "Her pupils often got the rough edge of her tongue when they disobeyed."}, {"viet": "Lời nói của bà ta chỉ là lời hăm dọa suông.", "eng": "Her speech is mere sabre-rattling."}, {"viet": "Bộ quần áo ướt ôm khít lấy thân hình cô ta.", "eng": "Her wet clothes moulded round her body."}, {"viet": "Này ông, ông nghĩ thế nào về việc ông đang làm?", "eng": "Hey, mac! What do you think you're doing?"}, {"viet": "Việc đánh giá tình hình của ông ta rất chính xác.", "eng": "His assessment of the situation was spot-on."}, {"viet": "Tính nết của anh ta dường như đã trải qua một cuộc biến đổi hoàn toàn kể từ khi anh ấy lập gia đình.", "eng": "His character seems to have undergone a complete transformation since his marriage."}, {"viet": "Quyển nhật ký của hắn cho thấy rõ hắn là một kẻ tham lam, kiêu ngạo.", "eng": "His diary shows him up to have been a greedy, arrogant man."}, {"viet": "Tên tuổi của ông ta là nhờ các vở kịch hơn là các cuốn tiểu thuyết của ông.", "eng": "His fame rests more on his plays than on his novels."}, {"viet": "Chữ anh ta nghiêng từ phải sang trái.", "eng": "His handwriting slants from right to left."}, {"viet": "Nơi ở cuối cùng của ông ta mà người ta biết được là 11 Park Road, London, NB.", "eng": "His last known domicile was 11 Park Road, London, NB."}, {"viet": "Chứng cứ lộn xộn của hắn bao phủ mối nghi ngờ lên sự đáng tin cậy của hắn với tư cách là một nhân chứng.", "eng": "His muddled evidence casts doubt on his reliability as a witness."}, {"viet": "Kế hoạch trốn thoát của hắn thất bại nặng nề.", "eng": "His plan to escape came badly unstuck."}, {"viet": "Sự thăng tiến tới quyền lực của ông ta rất nhanh.", "eng": "His rise to power was very rapid."}, {"viet": "Phong cách nói chuyện trước công chúng của ông ta theo khuôn mẫu của người thủ tướng.", "eng": "His style of public speaking is imitative of the prime minister."}, {"viet": "Cái chết của vợ anh ta là một đòn giáng mạnh vào anh ta.", "eng": "His wife's death was a great blow to him."}, {"viet": "Chìa bàn tay ra xa hết cỡ.", "eng": "Holding one's hand out at arm's length."}, {"viet": "Công việc nội trợ ở vị trí thứ yếu trên danh sách các việc ưu tiên của cô ấy.", "eng": "Housework is low on her list of priorities."}, {"viet": "Làm sao anh có thể chịu nổi sự hỗn xược như thế?", "eng": "How can you suffer such insolence?"}, {"viet": "Buổi chiều anh bận làm gì?", "eng": "How do you employ yourself of an evening?"}, {"viet": "Những người nhảy múa sẽ nhảy múa trong bao lâu?", "eng": "How long do the dancers dance?"}, {"viet": "Tôi nên gọi bao nhiêu ly bia?", "eng": "How many glasses of beer should I order?"}, {"viet": "Tôi phải trả anh bao nhiêu?", "eng": "How much do I owe you?"}, {"viet": "Tôi đi xin việc bằng cách nào đây?", "eng": "How should I go about finding the job?"}, {"viet": "Hurrying'và'hurried'là phân từ hiện tại và phân từ quá khứ của'hurry'.", "eng": "Hurrying'and'hurried'are the present and past participles of'hurry'."}, {"viet": "Tôi muốn giới thiệu cho ông vài món đồ thủ công mỹ nghệ tiêu biểu của Trung Quốc.", "eng": "I'd like to recommend some typical Chinese arts and crafts to you."}, {"viet": "Tôi sẽ làm bất cứ điều gì hợp lý để kiếm sống.", "eng": "I'll do anything within reason to earn my living."}, {"viet": "Tôi sẽ chẳng bao giờ làm khác đi những gì tôi tin là đúng.", "eng": "I'll never deviate from what I believed to be right."}, {"viet": "Tôi là một thành viên không có gì quan trọng trong tổ chức đó.", "eng": "I'm a very unimportant member of the organization."}, {"viet": "Tôi chán ngấy việc ngồi ở nhà cả ngày rồi.", "eng": "I'm fed up with staying at home all day."}, {"viet": "Tôi sẽ mở tiệc khi tôi được bằng lái.", "eng": "I'm having a party when i pass my driving test."}, {"viet": "Thật sự thì tôi không thể tự tiện loan báo thông tin đó.", "eng": "I'm not really free to give out that information."}, {"viet": "Tôi xin lỗi, cái tách tự nhiên vỡ từng mảnh trên tay tôi.", "eng": "I'm sorry, the cup just fell apart in my hands."}, {"viet": "Tôi đang nghĩ đến việc đi Châu Âu vào kỳ nghỉ hè của tôi năm nay.", "eng": "I'm thinking of going to Europe for my summer vacation this year."}, {"viet": "Tôi đã bị lừa! Nửa số cà chua này bị hỏng!", "eng": "I've been diddled! Half of these tomatoes are bad!"}, {"viet": "Tôi có vấn đề cần phải hỏi cậu Tiền tôi cho cậu mượn tuần trước đâu cả rồi?", "eng": "I've got a bone to pick you Where's the money I lent you last week?"}, {"viet": "Tôi bị mất chùm chìa khoá-anh có thấy nó ở đâu không?", "eng": "I've lost my keys-Have you seen them anywhere?"}, {"viet": "Tôi đã chờ đợi khoảnh khắc này suốt cả đời tôi.", "eng": "I've waited for this moment my whole life long."}, {"viet": "Tôi luôn luôn xem lại lời thoại của mình trước khi lên sân khấu.", "eng": "I always run over my lines before going on stage."}, {"viet": "Tôi xin lỗi vì đã nhầm lẫn.", "eng": "I am sorry for making a mistake."}, {"viet": "Tôi ném cái hộp xuống nền nhà.", "eng": "I banged the box down on the floor."}, {"viet": "Tôi rời buổi họp hiểu rằng chúng tôi đã giải quyết được tất cả những vấn đề tồn tại.", "eng": "I came away from the meeting with the sense that we had resolved all outstanding issues."}, {"viet": "Tôi không hiểu đầu cua tai nheo gì những lời chỉ dẫn này cả.", "eng": "I can't make head or tail of these instructions."}, {"viet": "Làm bồi bàn tôi có thể kiếm được trên dưới 20 pao một đêm.", "eng": "I can earn 20 pounds a night, more or less, as a waiter."}, {"viet": "Tôi không thể nào ở hai nơi cùng một lúc.", "eng": "I can't be in two places at once."}, {"viet": "Tôi lên án chủ nghĩa phát xít và tất cả những gì nó đại diện.", "eng": "I condemn fascism and all it stands for."}, {"viet": "Tôi đứt tay vì một con dao.", "eng": "I cut myself with a knife."}, {"viet": "Tôi nhận thấy một vẻ khẩn nài trong giọng nói của cô ta.", "eng": "I detected a note of urgency in her voice."}, {"viet": "Tôi bị trật khớp vai trong khi chơi quần vợt.", "eng": "I dislocated my shoulder when I was playing tennis."}, {"viet": "Tôi không biết sở thích của cô ấy là gì vì chúng tôi nói chuyện chủ yếu về công việc khi chúng tôi gặp nhau.", "eng": "I don't know what her interests are, because we talk mainly about work when we meet."}, {"viet": "Tôi nghĩ để trẻ con ăn nhiều đồ ngọt như vậy là không đúng.", "eng": "I don't think it's right to let children eat too many sweets."}, {"viet": "Tôi không muốn bất cứ ai trong các anh phải chịu một phần sự khiển trách.", "eng": "I don't wish to apportion blame to any of you."}, {"viet": "Tôi chẳng biết liệu có còn đồng nào sau một tuần ở thành phố đắt đỏ này không.", "eng": "I doubt if I'll have any left after a week in this expensive town."}, {"viet": "Tôi cảm thấy thương hại cho người không nhà cửa.", "eng": "I feel great pity for people with nowhere to live."}, {"viet": "Tôi thấy quan điểm phân biệt chủng tộc của anh ta thật ghê tởm.", "eng": "I find his racist views totally repugnant."}, {"viet": "Tôi trở thành thuyền trưởng đấy!", "eng": "I get to be the Captain!"}, {"viet": "Hôm nay tôi đã ra tay dọn bếp, bây giờ thì bếp sạch thật sự.", "eng": "I had a blitz on the kitchen today, and now it's really clean."}, {"viet": "Tôi phải lắng nghe một chuỗi dài tất cả những lời phàn nàn của hắn.", "eng": "I had to listen to a long recital of all his complaints."}, {"viet": "Tôi đã luôn quan tâm đến lịch sử từ khi còn bé.", "eng": "I have always been interested in history ever since I was little."}, {"viet": "Tôi không còn nhớ lại gì về ngày ấy.", "eng": "I have no recollection of that day."}, {"viet": "Tôi có 2 chị và 1 anh.", "eng": "I have two sisters and a brother."}, {"viet": "Tôi nghe nói ở Mỹ đi học cao học là chuyện thường.", "eng": "I hear that in the U. S. going to graduate school is common."}, {"viet": "Tôi hi vọng sự chậm trễ không gây bất lợi cho anh.", "eng": "I hope that the delay won't cause you any inconvenience."}, {"viet": "Ở trong căn hộ này tôi không thể tập trung được.", "eng": "I just can't concentrate here in the flat."}, {"viet": "Tôi biết rằng ông đã ở nước Mỹ này gần một năm rồi.", "eng": "I know that you have been here in America for nearly a year."}, {"viet": "Anh thích em để kiểu tóc này.", "eng": "I like the way you've done your hair."}, {"viet": "Tôi sẽ ra hiệu cho anh vào bằng cái gật đầu.", "eng": "I'll cue you in by nodding my head."}, {"viet": "Để tôi dẫn cháu đi tham quan ngôi nhà.", "eng": "I'll show you around the house."}, {"viet": "Tôi không biết phải dùng lời lẽ như thế nào nữa.", "eng": "I'm at a loss for words."}, {"viet": "Chính tôi cũng chỉ là một đứa trẻ to con mà thôi.", "eng": "I'm just a big child myself."}, {"viet": "Tôi lấy làm tiếc là tôi không thể đồng ý với anh.", "eng": "I'm sorry I can't agree with you."}, {"viet": "Có thể là tôi đoán liều, nhưng tôi nghĩ là anh ấy sẽ thắng.", "eng": "I may be sticking my neck out, but I think he's going to win."}, {"viet": "Tôi phải học kỹ về Nelson để chuẩn bị thi môn lịch sử.", "eng": "I must read up on Nelson for the history exam."}, {"viet": "Tôi không bao giờ xía vào chuyện vợ chồng người khác.", "eng": "I never interfere between husband and wife."}, {"viet": "Tôi đi ngang qua cô ta trên cầu thang.", "eng": "I passed her on the stairs."}, {"viet": "Tôi đã bấm chuông cửa nhiều lần nhưng không thể làm cho ai nghe thấy.", "eng": "I rang the doorbell several times but couldn't make anyone hear."}, {"viet": "Tôi xem đề nghị của anh đáng quan tâm.", "eng": "I regard your suggestion as worth considering."}, {"viet": "Chính mắt tôi trông thấy cái đó.", "eng": "I saw it with my own eyes."}, {"viet": "Em sẽ bắt anh giữ lời hứa.", "eng": "I shall keep you to your promise."}, {"viet": "Tôi nhổ cỏ cả buổi chiều trong vườn.", "eng": "I spent the afternoon weeding the garden."}, {"viet": "Tôi công nhận anh ta là người thua.", "eng": "I tagged him as a loser."}, {"viet": "Tôi nghĩ bắt chúng học nhiều thứ khác nhau là tốt đấy.", "eng": "I think it's good to make them learn different things."}, {"viet": "Tôi nghĩ cô sẽ tìm được ông Wilson đang dự hội nghị ở đó.", "eng": "I think you'll find Mr. Wilson in conference there."}, {"viet": "Tôi lên gấu mấy cái áo của tôi cho ngắn lại.", "eng": "I took the hems of my dresses up to make them shorter."}, {"viet": "Tôi dùng địa chỉ của tôi làm số mật.", "eng": "I use my address as my secret number."}, {"viet": "Tôi muốn thông báo nội bộ này được chuyển đến các trưởng phòng.", "eng": "I want this memo to go to all departmental managers."}, {"viet": "Tôi muốn Tổng thống Bush tái đắc cử, nhưng ông ấy đã nhất cử.", "eng": "I wanted President Bush to win again, but he lost the election."}, {"viet": "Tôi hết sức khâm phục lòng dũng cảm của cô ấy.", "eng": "I was filled with admiration for her courage."}, {"viet": "Tôi đã chuẩn bị tinh thần cho điều tồi tệ nhất khi nhìn thấy chiếc ô tô vỡ tan.", "eng": "I was prepared for the worst when I saw the wrecked car."}, {"viet": "Tôi cứ tưởng rằng ngày mai anh mới tới.", "eng": "I was under the impression that you were coming tomorrow."}, {"viet": "Tôi sẽ cho anh mượn cuốn sách với điều kiện anh phải giữ nó sạch sẽ.", "eng": "I will lend you the book as long as you keep it clean."}, {"viet": "Tôi sẽ không ăn món put-đinh-ăn hết được món thứ nhất rất nhiều là hết sức tôi rồi.", "eng": "I won't have a pudding-it was as much as I could do to finish the very large first course."}, {"viet": "Tôi sẽ làm điều đó cho ông ngay.", "eng": "I would do it for you now."}, {"viet": "Xin cho 2 vé hàng \"S\".", "eng": "I would like two \"S\" tickets, please."}, {"viet": "Nếu a bằng b và b bằng c, kết luận tất yếu phải là a bằng c.", "eng": "If a = b, and b = c, then the necessary conclusion is that a = c."}, {"viet": "Nếu tôi mà biết cô ta ốm, tôi đã đến thăm cô ta.", "eng": "If I had but known she was ill, I would have visited."}, {"viet": "Nếu chiếc bánh xăng uých đó bị chê, tôi sẽ ăn luôn.", "eng": "If that sandwich is going begging, I'll have it."}, {"viet": "Nếu cứ nghe các nhà tiên tri bi quan thì chúng ta sẽ chẳng bao giờ khởi sự đề án này.", "eng": "If we had listened to the prophets of doom, we would never have started the project."}, {"viet": "Nếu bạn so sánh tác phẩm của họ, bạn sẽ thấy tác phẩm của bà ta hay hơn nhiều.", "eng": "If you compare their work, you'll find hers is much better."}, {"viet": "Nếu mày cứ nhắng nhít lên, thì chúng ta chắc chắn bị muộn mất.", "eng": "If you keep fussing about, we're sure to be late."}, {"viet": "Nếu như anh muốn tôi ra đi anh chỉ cần ra hiệu.", "eng": "If you want me to leave, you only have to say the word."}, {"viet": "Trong một cuốn từ điển, từ được xếp theo thứ tự bảng chữ cái.", "eng": "In a dictionary, the words are arranged in alphabetical order."}, {"viet": "Trong tiếng Anh you là đại từ ngôi thứ hai.", "eng": "In English you is a second person pronoun."}, {"viet": "Trong trí tưởng tượng của tôi, tôi đã tưởng nghe thấy cô ta gọi tôi.", "eng": "In my imagination, I thought I heard her calling me."}, {"viet": "Trong bối cảnh khủng hoảng kinh tế hiện nay, việc giảm thuế xem ra là không khôn ngoan.", "eng": "In the context of the present economic crisis it seems unwise to lower taxes."}, {"viet": "Trong từ thunder trọng âm ở âm tiết thứ nhất.", "eng": "In the word thunder the accent is on the first syllable."}, {"viet": "Giáng cho quân thù một đòn thất bại liểng xiểng.", "eng": "Inflict a crushing defeat on the enemy."}, {"viet": "Ở Nhật Bản, trở thành người ăn chay có khó không?", "eng": "Is it difficult to be a vegetarian in Japan?"}, {"viet": "Có nhà ga ở gần đây không?", "eng": "Is there a station near here?"}, {"viet": "Có phải đó là điều đáng kinh ngạc nhất mà bạn từng nghe thấy không?", "eng": "Isn't that the damnedest thing you've ever heard?"}, {"viet": "Điều bất hạnh cho quốc gia này là ông ấy đã không bao giờ trở thành thủ tướng.", "eng": "It's a tragedy for this country that he never became prime minister."}, {"viet": "Khó kiếm được phụ tùng thay thế cho các máy giặt cũ.", "eng": "It's difficult to get spare parts for old washing-machines."}, {"viet": "Nó thoát khỏi tai nạn thật đúng là kỳ diệu!", "eng": "It's just a miracle that he survived the accident!"}, {"viet": "Say ở ngoài phố là không đứng đắn.", "eng": "It's not respectable to be drunk in the street."}, {"viet": "Người ta cho rằng tuyết sẽ rơi vào những ngày còn lại trong tuần đấy.", "eng": "It's supposed to snow the rest of the week."}, {"viet": "Xếp anh ta vào cùng những phần tử cực đoan trong đảng là sai-quan điểm của anh ta rất ôn hoà.", "eng": "It's wrong to bracket him with the extremists in his party-his views are very moderate."}, {"viet": "Chuyện này xảy ra vào cuối thế kỷ trước-đích xác là năm 1895.", "eng": "It happened late last century-in 1895, to be exact."}, {"viet": "Thật là hài lòng khi thấy những cố gắng của mình đã được thưởng công.", "eng": "It is gratifying to see one's efforts rewarded."}, {"viet": "Người ta nói rằng trên thế giới này, có ba người trông giống bạn như đúc.", "eng": "It is said that in this world, there are three people that look exactly like you."}, {"viet": "Điều đó có nghĩa là hoặc cho chúng một cây kẹo hoặc chúng sẽ chơi xỏ bạn.", "eng": "It means either give them a piece of candy or they will play a trick on you."}, {"viet": "Tôi đây, vui lòng cho biết ai đang nói vậy?", "eng": "It's me, who is speaking, please?"}, {"viet": "HÌNH NHƯ TÔI ĐÃ HỎI MỘT CÂU KHÔNG ĐÚNG LÚC.", "eng": "IT SEEMS THAT I ASKED THE WRONG QUESTION."}, {"viet": "Đó là một điều không thú vị gì, tôi sẽ không bao giờ quên.", "eng": "It was a baptism of fire I'll never forget."}, {"viet": "Thật là bực mình phải xin lỗi người đàn ông mà cô ta ghét.", "eng": "It was galling to have to apologize to a man she detested."}, {"viet": "Bài diễn văn buồn tẻ quá đến nỗi tôi ngủ thiếp đi.", "eng": "It was such a boring speech that I fell asleep."}, {"viet": "Tả nữ hoàng Victoria ngồi xem truyền hình là một sai lầm về niên đại.", "eng": "It would be an anachronism to talk of Queen Victoria watching television."}, {"viet": "Ô tô Nhật bản đã tràn ngập thị trường Hoa kỳ.", "eng": "Japanese cars have flooded the American market."}, {"viet": "Các nhà báo không được phép vào phòng xử án.", "eng": "Journalists were unable to gain admittance to the court-room."}, {"viet": "Tính ăn cắp vặt là một chứng bệnh lấy cắp đồ đạc.", "eng": "Kleptomania is a mania for stealing things."}, {"viet": "Để xem, anh nghĩ sáng nay anh sẽ ăn bánh mì nướng.", "eng": "Let's see, I think I'll have toast this morning."}, {"viet": "Anh biết đấy, đời không phải chỉ toàn là vui thú.", "eng": "Life isn't all cakes and ale, you know."}, {"viet": "Nhiều thành viên vắng mặt, đặc biệt là phó chủ tịch.", "eng": "Many members were absent, notably the vice chairman."}, {"viet": "Tiếp thị không nằm trong phạm vi của cơ quan anh ta.", "eng": "Marketing does not come within the orbit of his department."}, {"viet": "Cho phép tôi giúp ông bà mang hành lý nhé?", "eng": "May I help you with your luggage?"}, {"viet": "Những người tốt nghiệp đại học cả nam và nữ đều được trả lương ngang nhau.", "eng": "Men and women college graduates are pair the same."}, {"viet": "Hầu hết các món ăn Tứ Xuyên đều có nhiều gia vị và cay, nhưng chúng có nhiều vị khác nhau.", "eng": "Most Sichuan dishes are spicy and hot, but they have different tastes."}, {"viet": "Mùa đông này, chiếc áo khoác có mũ trùm rất có ích cho tôi.", "eng": "My anorak has stood me in good stead this winter."}, {"viet": "Gia đình tôi phải dọn đến một căn hộ mới ở khu Harlem.", "eng": "My family has to remove to a new apartment in Harlem."}, {"viet": "Cuộc đời của tôi đã bị bó khuôn trong những qui định lặt vặt.", "eng": "My life is hedged about with petty regulations."}, {"viet": "Chị tôi không thể đem cái bàn của chị về nhà mới, cho nên nó thành của tôi.", "eng": "My sister couldn't take her desk with her to the new house, that's how I came to acquire it."}, {"viet": "Cả hai đều không biết bơi nhưng cả hai đều muốn học.", "eng": "Neither boy could swim, but they both wanted to learn."}, {"viet": "Không đâu, con muốn quyết định ngay bây giờ.", "eng": "No, have to make a decision right now."}, {"viet": "Không phải các nhà xe lưu động thì quá đắt.", "eng": "No mobile homes are too expensive."}, {"viet": "Vậy tôi sẽ đặt trước một bàn vào lúc 8 giờ tối mai.", "eng": "Now I'll book one for tomorrow evening at 8: 00."}, {"viet": "Tất nhiên, tất cả chúng tôi sẽ phải ra sức để thúc đẩy việc bán hàng.", "eng": "Of course, we'll have to go all out to promote the sale."}, {"viet": "Đúng, anh có muốn đi đến hiệu sách để xem họ có bán cuốn sách đó không?", "eng": "OK, do you want to go to the bookstore and see if they have it?"}, {"viet": "Nhân sinh nhật của ông, ngày Tết, ngày Nôen, v. v.", "eng": "On your birthday, New Year's day, Christmas day, etc."}, {"viet": "Một cành cây chạm mặt nước.", "eng": "One of the branches was just touching the water."}, {"viet": "Công việc kinh doanh của chúng tôi là một trách nhiệm liên kết.", "eng": "Our business is a joint shared responsibility."}, {"viet": "Cuốn danh bạ của khách sạn chúng tôi để trên bàn.", "eng": "Our Hotel Directory is on the desk."}, {"viet": "Con trai chúng tôi đang học ở trường nội trú-chúng tôi chỉ gặp cháu vào ngày nghỉ.", "eng": "Our son's at boarding-school-we only see him during the holidays."}, {"viet": "Độn vải này quanh những chiếc tách để chúng khỏi vỡ.", "eng": "Pack this cloth round the picnic cups so they won't break."}, {"viet": "Người ta hét to: lương hưu thì sao?", "eng": "People bawling out what about pensions?"}, {"viet": "Kiến nghị xin xử lại theo những bằng chứng mới.", "eng": "Petition for a retrial in the light of new evidence."}, {"viet": "Chính trị là điều duy nhất ngăn cách chúng tôi.", "eng": "Politics is the only thing which separates us."}, {"viet": "Sự trừng phạt nước đó bao gồm từ chối giao thương.", "eng": "Sanctions against that country include refusing to trade."}, {"viet": "Tổn thương nặng nề về não đã biến anh ta thành một người mất trí.", "eng": "Severe brain damage turned him into a vegetable."}, {"viet": "Cô ta là một người rất thiện nghệ về việc giải những câu đố.", "eng": "She's a great one for solving puzzles."}, {"viet": "Cô ta sẽ được thuyên chuyển sang chi nhánh Pari của chúng tôi.", "eng": "She's being transferred to our Paris branch."}, {"viet": "Cô ta vừa trở về sau một chuyến đi Paris được tài trợ hết.", "eng": "She's just returned from an all expenses-paid trip to Paris."}, {"viet": "Cô ta vụng về lắm, cô ta đúng là người hậu đậu.", "eng": "She's so clumsy, she's a real liability."}, {"viet": "Cô ta giả vờ đóng vai người tình bị phụ bạc để làm cho anh ta cảm thấy có tội.", "eng": "She acted out the role of wronged lover to make him feel guilty."}, {"viet": "Bà ấy bắt đầu mong sao mọi sự được hoàn tất.", "eng": "She began to wish the whole business finished."}, {"viet": "Cô ta xuất thân từ một dòng họ các nữ nghệ sĩ.", "eng": "She comes from a long line of actresses."}, {"viet": "Bà ta lục lọi trong túi xách, lấy ra một cái bút.", "eng": "She delved in her bag and pulled out a pen."}, {"viet": "Bà ta nhảy ra khỏi toà nhà đang cháy rơi xuống an toàn.", "eng": "She dropped to safety from the burning building."}, {"viet": "Cô ấy gập lá thư để vừa với túi cô ấy.", "eng": "She folded the letter so that it would fit into her bag."}, {"viet": "Cô ta bị ông chủ mắng vì đến muộn.", "eng": "She got blown up by her boss for being late."}, {"viet": "Cô ta đã dám cả gan nói tôi gian lận.", "eng": "She had the nerve to say I was cheating."}, {"viet": "Cô ta vừa viết xong bản tự truyện của mình.", "eng": "She has just written her autobiography."}, {"viet": "Bà ấy lập tức bảo trợ cho những người mới đến.", "eng": "She immediately took the new arrivals under her wing."}, {"viet": "Bà ta khá bực mình vì có thêm ba vị khách đột nhiên không mời mà đến.", "eng": "She is rather annoyed at having three extra guests suddenly thrust on her."}, {"viet": "Cô ta nằm ngửa duỗi thẳng người dưới ánh nắng ấm.", "eng": "She lay flat on her back in the warm sunshine."}, {"viet": "Cô ta trông phờ phạc sau trận ốm.", "eng": "She looks washed out after her illness."}, {"viet": "Cô ta cần phải lánh xa một số những người ủng hộ cực đoan hơn.", "eng": "She needs to distance herself from some of her more extreme supporters."}, {"viet": "Cô ấy đả kích hai đối thủ của mình chống nhau và giành được việc làm đó cho mình.", "eng": "She played her two rivals off against each other and got the job herself."}, {"viet": "Cô ấy chỉ đọc hai khổ đầu của bài thơ.", "eng": "She recited only the first two stanzas of the poem."}, {"viet": "Cô ấy bình phục trở lại.", "eng": "She's back to her former self again."}, {"viet": "Cô ta đã tiêu hết tiền của cô ấy.", "eng": "She's spent all her money."}, {"viet": "Cô ta dường như bận tâm đến chuyện gì khác trong suốt thời gian tôi nói chuyện với cô ấy.", "eng": "She seemed preoccupied all the time I was talking to her."}, {"viet": "Cô ấy đã bị trượt và ngã nhưng lại rơi xuống nhẹ nhàng trên mấy tấm đệm.", "eng": "She slipped and fell, but had a soft landing on some cushions."}, {"viet": "Cô ta vươn tay qua bàn để lấy bơ.", "eng": "She stretched across the table for the butter."}, {"viet": "Cô ta ném nó xuống dòng sông sâu nước đục ngầu.", "eng": "She threw it into the river's murky depths."}, {"viet": "Bà ta dùng một cái đục để bẩy cái nắp.", "eng": "She used a chisel to prise off the lid."}, {"viet": "Cô ta rất giỏi nịnh người khác.", "eng": "She was adroit at flattering others."}, {"viet": "Bà ta quyết định là chúng tôi phải hoàn tất đúng thời gian.", "eng": "She was determined that we should finish on time."}, {"viet": "Bà ta là quần áo suốt cả buổi chiều.", "eng": "She was ironing away all evening."}, {"viet": "Bà ta liên tục phải chịu tra tấn.", "eng": "She was repeatedly subjected to torture."}, {"viet": "Cô ta được xử trong phiên tòa công khai.", "eng": "She was tried in open court."}, {"viet": "Cô ta hoàn tất trận đấu thấp hơn tỷ số là 3.", "eng": "She went round the course in three below par."}, {"viet": "Cô ta làm việc liên tục trong sáu giờ đồng hồ.", "eng": "She worked for six hours at a stretch."}, {"viet": "Những người mua sắm ẩu đả quanh quầy hàng hạ giá.", "eng": "Shoppers got into a scrum around the bargain counter."}, {"viet": "Chứng tỏ là mình đồng ý bằng cách gật đầu.", "eng": "Signify that one agrees by nodding."}, {"viet": "Sáu ăn một là tỉ số chấp nhận được đối với con ngựa đó.", "eng": "Six to one is a good price for that horse."}, {"viet": "Hút thuốc có hại cho sức khoẻ.", "eng": "Smoking is a danger to health."}, {"viet": "Vì vậy chúng tôi muốn có một đại lý để đẩy mạnh sản phẩm của chúng tôi ở đất nước của ông.", "eng": "So we want to have an agent to push our products in your country."}, {"viet": "Tỉ lệ lạm phát giảm 37.", "eng": "Some decrease of 37 in the rate of inflation."}, {"viet": "Một số người tin rằng nghèo đói gây ra tội phạm.", "eng": "Some people believe poverty engenders crime."}, {"viet": "Chẳng hiểu sao tôi cảm thấy tôi không thể tin hắn được.", "eng": "Somehow, I don't feel I can trust him."}, {"viet": "Tìm cách tiến thân trong phạm vi hệ thống quản lý của công ty.", "eng": "Sought to advance within the company's power structure."}, {"viet": "Bóp kem đánh răng từ ống kem lên một bàn chải đánh răng.", "eng": "Squeeze toothpaste from the tube onto a toothbrush."}, {"viet": "Bị bêu xấu là một kẻ hèn nhát và dối trá.", "eng": "Stigmatized as a coward and a liar."}, {"viet": "Những loại muỗi lờn với thuốc diệt côn trùng.", "eng": "Strains of mosquitoes that are resistant to insecticide."}, {"viet": "Một hành động như vậy hẳn là không phù hợp với chính sách của chúng ta.", "eng": "Such an act would not be in accord with our policy."}, {"viet": "Ánh sáng mặt trời tràn qua cửa sổ.", "eng": "Sunlight came streaming through the window."}, {"viet": "Thuỵ Sĩ là một vùng đất hòa bình nằm ở châu Âu bị chiến tranh xâu xé.", "eng": "Switzerland was an enclave of peace in war-torn Europe."}, {"viet": "Theo học lại một khoá ôn luyện lại để nâng cao khả năng lái xe của tôi.", "eng": "Taking a refresher course to improve my driving."}, {"viet": "Hãy nói cho tôi biết nên mua những cái nào?", "eng": "Tell me which are worth buying?"}, {"viet": "Cám ơn anh đã mua vé cho tôi-tôi sẽ hoàn lại tiền cho anh sau.", "eng": "Thanks for buying my ticket-I'll make it up to you later."}, {"viet": "Chim đó rất hiếm ở nước này.", "eng": "That bird is very rare in this country."}, {"viet": "Ý tưởng ấy nhắc đi nhắc lại đến nhàm chán.", "eng": "That idea's been done to death."}, {"viet": "Tiếng ồn ấy đủ làm người chết phải sống lại!", "eng": "That noise is enough to resurrect the dead!"}, {"viet": "Không bao lâu ai cũng biết việc nỗ lực của bà ta đã bị thất bại.", "eng": "That she attempt to save her had failed soon become widely known."}, {"viet": "Hơn ai hết chính anh là người nên làm điều đó!", "eng": "That you of all men should do such a thing!"}, {"viet": "Bị cáo ngồi không có vẻ gì là xúc động khi quan toà tuyên án anh ta mười năm tù giam.", "eng": "The accused sat impassively as the judge sentenced him to ten years in prison."}, {"viet": "Chiếc máy bay đã không đủ sức rời khỏi mặt đất.", "eng": "The aircraft hadn't enough power to get off the ground."}, {"viet": "Khung nhiệt độ năm là từ-100C đến 400C.", "eng": "The annual range of temperature is from-100C to 400C."}, {"viet": "Quân đội được đặt dưới quyền chỉ huy của tướng Smith.", "eng": "The army is under the command of General Smith."}, {"viet": "Khán giả la ó một số diễn.", "eng": "The audience booed some of the performers."}, {"viet": "Đứa bé nhổ thức ăn ra bàn.", "eng": "The baby spat its food onto the table."}, {"viet": "Ngân hàng từ chối không cho công ty vay tín dụng nhiều hơn nữa.", "eng": "The bank refused further credits to the company."}, {"viet": "Cái hay trong ý kiến của tôi là ở chỗ nó tốn kém ít.", "eng": "The beauty of my idea is that it costs so little."}, {"viet": "Con chim rúc đầu vào cánh.", "eng": "The bird tucked its head into its wings."}, {"viet": "Xúp hết sôi khi nồi bắc ra khỏi bếp.", "eng": "The boiling soup subsided when the pot was taken off the heat."}, {"viet": "Ranh giới mập mờ giữa sự lành mạnh và không lành mạnh.", "eng": "The borderland between sanity and insanity."}, {"viet": "Cái phanh không ăn và chiếc xe đâm vào tường.", "eng": "The brakes failed to grip and the car ran into a wall."}, {"viet": "Tòa nhà được trang hoàng đầy cờ.", "eng": "The building was decorated with flags."}, {"viet": "Cải bắp nảy mầm trong vòng một tuần.", "eng": "The cabbages germinated within a week."}, {"viet": "Xe ôtô thường hay chết máy vào các buổi sáng lạnh.", "eng": "The car has an inclination to stall on cold mornings."}, {"viet": "Toa xe khách lật đổ và hành khách bị hất ra ngoài.", "eng": "The carriage overturned and the passengers pitched out."}, {"viet": "Điểm chính yếu của một cuộc tranh luận.", "eng": "The central point of an argument."}, {"viet": "Tờ séc này mới được gửi từ hôm qua, vì vậy nó chưa thanh toán được.", "eng": "The cheque was only deposited yesterday, so it hasn't been cleared yet."}, {"viet": "Đứa trẻ quay sang mẹ nó để được dỗ dành.", "eng": "The child turned to its mother for comfort."}, {"viet": "Bọn trẻ con đang nghịch ngợm chiếc mũ của tôi-chúng đã làm cho nó không còn ra hình thù gì nữa.", "eng": "The children have been playing with my hat-they've knocked it out of shape."}, {"viet": "Lũ trẻ về đến nhà lạnh tưởng chết.", "eng": "The children were perished when they arrived home."}, {"viet": "Tiếng lách cách của que đan, của máy chữ.", "eng": "The clack of knitting needles, a typewriter."}, {"viet": "Phong trào hợp tác xã bắt đầu vào thế kỷ 19: hợp tác xã lập ra các cửa hàng với giá hạ bán cho người nghèo.", "eng": "The co-operative movement started in the 19th century: co-operative societies set up shops to sell low-priced goods to poor people."}, {"viet": "Sĩ quan chỉ huy và những thuộc cấp của mình.", "eng": "The commanding officer and his Subordinates."}, {"viet": "Công ty không còn đủ tiền mặt để trả lãi cho các khoản nợ.", "eng": "The company hasn't enough cash to service its debts."}, {"viet": "Hội nghị này sẽ mở rộng mối quan hệ hợp tác quốc tế.", "eng": "The conference will enable greater international cooperation."}, {"viet": "Cái bếp có vài độ nóng khác nhau.", "eng": "The cooker has several temperature settings."}, {"viet": "Xứ sở đó đã là một đại cường quốc hải quân trong nhiều thế kỷ qua.", "eng": "The country was a great naval power in past centuries."}, {"viet": "Đội crickê được nhiều uy tín vì chơi thành công.", "eng": "The cricket team won much prestige with their successful performance."}, {"viet": "Những con thú con ốm yếu và còi cọc.", "eng": "The cubs were sickly and undersized."}, {"viet": "Sự mạo hiểm của người leo núi.", "eng": "The daring of the mountain climber."}, {"viet": "Các vị đại biểu vang lên những tiếng hoan hô rầm rộ.", "eng": "The delegates burst into loud applause."}, {"viet": "Quỷ Sa-tăng đã cám dỗ ông A-đam và bà E-vơ.", "eng": "The Devil tempted Adam and Eve."}, {"viet": "Những cái đĩa rơi vỡ loảng xoảng trên nền nhà.", "eng": "The dishes crashed to the floor."}, {"viet": "Bác sỹ nói với bà ấy là bà ấy quá béo và nên tập thể dục nhiều hơn.", "eng": "The doctor told her she was overweight and should do more exercise."}, {"viet": "Con chó ngửi thấy con thỏ cách một quãng rất xa.", "eng": "The dog smelt the rabbit a long way off."}, {"viet": "Người lái xe đã chết vì các vết thương của ông ta.", "eng": "The driver has succumbed to his injuries."}, {"viet": "Cuộc trò chuyện lúc sôi nổi, lúc tẻ nhạt.", "eng": "The ebb and flow of conversation."}, {"viet": "Quân địch cuối cùng đang tiến lên.", "eng": "The enemy are on the march at last."}, {"viet": "Tên tù vượt ngục bị đưa lại dưới sự canh phòng nghiêm ngặt.", "eng": "The escaped prisoner was brought back under close guard."}, {"viet": "Kinh nghiệm đó hoàn toàn có ảnh hưởng đến cô ta.", "eng": "The experience had quite an effect on her."}, {"viet": "Những thác nước đầu nguồn có nhiều cá hồi.", "eng": "The falls upstream are full of salmon."}, {"viet": "Sự lên men của sữa làm cho nó đông lại.", "eng": "The fermentation of milk causes it to curdle."}, {"viet": "Cuốn phim đó đã bị các nhà phê bình chỉ trích thậm tệ.", "eng": "The film was rubbished by the critics."}, {"viet": "Xí nghiệp cần có thêm nhiều đại diện ở Trung Quốc.", "eng": "The firm needs more representation in China."}, {"viet": "Loại cá chòm sao năm lằn có thân hình mỏng dẹt như cá bướm.", "eng": "The five-lined constellation fish has a body which is flattened like that of a butterfly fish."}, {"viet": "Chiếc cầu cho người đi bộ chao đảo khi tôi chạy qua.", "eng": "The footbridge swayed when I ran across."}, {"viet": "Người bán hoa quả kiếm được một penni tiền lãi từ mỗi quả cam.", "eng": "The fruit seller made a penny profit on each orange."}, {"viet": "Một khu vườn rực rỡ hoa.", "eng": "The garden was ablaze with flowers."}, {"viet": "Ánh trăng dịu loang loáng trên mặt nước.", "eng": "The gleam of moonlight on the water."}, {"viet": "Chính phủ cương quyết chống đối ý kiến tăng thuế.", "eng": "The government are set against the idea of raising taxes."}, {"viet": "Chính phủ đang áp dụng những biện pháp cần thiết để kiềm chế mức độ tội ác đang gia tăng.", "eng": "The government is taking steps to control the rising crime rate."}, {"viet": "Nho thì ngon nhưng có rất nhiều hạt.", "eng": "The grapes are delicious but very seedy."}, {"viet": "Người bảo vệ đã bị giết chết bằng một khẩu súng trường rất mạnh.", "eng": "The guard was killed with a high-powered rifle."}, {"viet": "Những điều kiện khắc nghiệt của đời sống ở sa mạc.", "eng": "The harsh severities of life in the desert."}, {"viet": "Nguy cơ nhiễm trùng cao khiến cho việc sử dụng các mũi kim vô trùng là điều quan trọng.", "eng": "The high risk of infection puts a premium on the use of sterile needles."}, {"viet": "Vợ chồng chủ nhà đi đi lại lại giữa những vị khách.", "eng": "The host and hostess circulated among the guest."}, {"viet": "Căn nhà được bán đấu giá.", "eng": "The house is up for auction."}, {"viet": "Cứ nghĩ tới ăn sò sống là tôi buồn nôn rồi.", "eng": "The idea of eating raw shellfish nauseates me."}, {"viet": "Sự nhiễm khuẩn của cơ thể.", "eng": "The infection of the body with bacteria."}, {"viet": "Khối đồ sộ kinh khiếp của ngọn Everest vươn lên sừng sững trước mặt các nhà leo núi.", "eng": "The intimidating bulk of Mt Everest rose up before the climbers."}, {"viet": "Nhà báo viết về những điểm nóng trên thế giới.", "eng": "The journalist covering the word's trouble spots."}, {"viet": "Bọn bắt cóc đòi một khoản tiền chuộc 10.000 bảng Anh mới thả nó ra.", "eng": "The kidnappers demanded a ransom of £ 10,000 for his release."}, {"viet": "Ngôn ngữ trên sân khấu đó tục tĩu hơn bất cứ điều gì tôi đã nghe trong suốt cuộc đời làm báo.", "eng": "The language on the stage was riper than anything I have heard in a lifetime of newspaper work."}, {"viet": "Vị chỉ huy đã tập hợp người của ông lại xung quanh mình.", "eng": "The leader rallied his men round him."}, {"viet": "Tính chất giống đời thật trong những bức họa của ông ta.", "eng": "The lifelike reality of his paintings."}, {"viet": "Cuộc đình công lâu dài và tổn hại chứng tỏ bước cáo chung của công ty.", "eng": "The long and costly strike proved to be the last nail in the company's coffin."}, {"viet": "Tờ tạp chí có tranh con ngựa ở ngoài bìa.", "eng": "The magazine had a picture of a horse on the cover."}, {"viet": "Ông giám đốc chỉ có thể tiếp anh trong năm phút.", "eng": "The manager can only see you for five minutes."}, {"viet": "Hình phạt tối đa cho tội này là 10 năm tù.", "eng": "The maximum penalty for this crime is 10 years'imprisonment."}, {"viet": "Kỷ niệm sẽ còn sống mãi trong tim tôi.", "eng": "The memory will live in my heart for ever."}, {"viet": "Ông bộ trưởng đã bị chỉ trích trên báo chí về việc xử lý vụ đó.", "eng": "The minister was crucified in the press for his handling of the affair."}, {"viet": "Mặt trăng là vệ tinh của quả đất.", "eng": "The moon is the Earth's satellite."}, {"viet": "Phong trào thu hút càng ngày càng nhiều người ủng hộ.", "eng": "The movement is gaining more and more adherents."}, {"viet": "Những cuộc thảo luận sơ bộ cần thiết mở đầu cho một hội nghị hòa bình.", "eng": "The necessary preliminaries to a peace conference."}, {"viet": "Luật mới cho phép cảnh sát quyền khám nhà tư.", "eng": "The new law empowered the police to search private houses."}, {"viet": "Hệ thống mới sẽ được áp dụng sớm.", "eng": "The new system will soon be put on effect."}, {"viet": "Toà nhà cổ nhất tiếp theo là nhà thờ.", "eng": "The next oldest building is the church."}, {"viet": "Số sách bị lấy cắp ở thư viện rất lớn.", "eng": "The number of books stolen from the library is large."}, {"viet": "Viên sĩ quan ra lệnh cho binh lính của mình xuống ngựa.", "eng": "The officer ordered his troops to dismount."}, {"viet": "Cái giếng cổ trong làng có tường bao quanh và có thể thả gầu xuống kín nước.", "eng": "The old well in the village a wall round it and a bucket that could be lowered for water."}, {"viet": "Ủy ban tổ chức đang kêu gọi những người tình nguyện hãy đến giúp đỡ.", "eng": "The organizing committee is appealing for volunteers to step forward."}, {"viet": "Tòa lâu đài sáng rực ánh đèn.", "eng": "The palace was ablaze with lights."}, {"viet": "Con đường được lát bằng những tấm bê tông.", "eng": "The path is paved with concrete slabs."}, {"viet": "Dân Hoa Kỳ bỏ ra hàng triệu đô la trong một năm để dùng kẹo cao su.", "eng": "The people of the United States spend millions of dollars a year for chewing gum."}, {"viet": "Bản độc tấu pianô đã được biểu diễn hay.", "eng": "The piano solo was well rendered."}, {"viet": "Vùng đồng bằng đã bị lũ người Tartar giày xéo.", "eng": "The plains were overrun by Tartar hordes."}, {"viet": "Trung đội bộ binh đó được phái đi trinh sát ngôi làng trước cuộc tấn công.", "eng": "The platoon was sent to reconnoiter the village before the attack."}, {"viet": "Những điểm sẽ thảo luận có thể đưa vào ba tiêu đề chính.", "eng": "The points to be discussed can be brought under three main headings."}, {"viet": "Cảnh sát đã đi rồi, thế là chúng ta thoát.", "eng": "The police have gone so we're in the clear."}, {"viet": "Viên cảnh sát yêu cầu tôi thổi vào một túi nhựa.", "eng": "The policeman asked me to blow into a plastic bag."}, {"viet": "Khám nghiệm tử thi đã cho thấy có chút thuốc độc trong dạ dày của anh ta.", "eng": "The post-mortem revealed traces of poison in his stomach."}, {"viet": "Xe vị Tổng thống đến, đám đông bật lên hoan hô ầm ĩ.", "eng": "The President's car arrived, the crowd broke into loud applause."}, {"viet": "Giá cả trong cửa tiệm này thật là cắt cổ.", "eng": "The price in this shop are extortionate."}, {"viet": "Người tù viện lẽ rằng anh ta ở nhà vào cái đêm xảy ra án mạng.", "eng": "The prisoner alleges that he was at home on the night of the crime."}, {"viet": "Lợi nhuận được chia đều cho các bên.", "eng": "The profits are shared equally among the partners."}, {"viet": "Số lượng giáo viên chuyên khoa được cung cấp đang gia tăng.", "eng": "The provision of specialist teachers is being increased."}, {"viet": "Nữ hoàng cởi bỏ lễ phục sau buổi lễ.", "eng": "The Queen disrobed after the ceremony."}, {"viet": "Chủ nghĩa vật chất lây lan trong xã hội hiện đại.", "eng": "The rampant materialism of modern society."}, {"viet": "Trọng tài cho đội nhà hưởng trái phạt đền.", "eng": "The referee awarded a penalty to the home team."}, {"viet": "Các đại biểu bày tỏ một cách ồn ào sự không tán thành của họ.", "eng": "The representatives clamoured their disapproval."}, {"viet": "Bữa ăn thịnh soạn đó làm cho bụng tôi khó chịu.", "eng": "The rich meal lay heavy on my stomach."}, {"viet": "Đường đó chạy song song với đường xe lửa.", "eng": "The road runs parallel with the railway."}, {"viet": "Căn phòng được treo những tấm thảm thêu.", "eng": "The room were hung with tapestries."}, {"viet": "Người thuỷ thủ trườn lên đây buồm phía trên để nhìn rõ bến bờ xa xăm.", "eng": "The sailor scrambled aloft to get a better view of the distant shore."}, {"viet": "Thủ tục lặt vặt của nhà trường về việc tốt nghiệp.", "eng": "The school's Mickey Mouse requirements for graduation."}, {"viet": "Người thư ký ở quầy lễ tân không thật sẵn sàng giúp đỡ.", "eng": "The secretary at the reception desk was not very forthcoming."}, {"viet": "Những cổ phần này kiếm lãi hàng năm đáng kể.", "eng": "The shares earn a handsome annual dividend."}, {"viet": "Con tàu bị sóng đánh tròng trành.", "eng": "The ship was tossed back and forth by the waves."}, {"viet": "Cảnh đau khổ thể xác luôn luôn làm tôi đau lòng.", "eng": "The sight of physical suffering always upset me."}, {"viet": "Trò diễu vui nhộn của phim câm.", "eng": "The slapstick comedy of silent films."}, {"viet": "Những người lính, đầy tự hào với thành công của mình, đã tiếp tục giành thắng lợi mới.", "eng": "The soldiers, flushed with their first success, went on to gain the victory."}, {"viet": "Người Xpác-tơ là một dân tộc hiếu chiến.", "eng": "The Spartans were a warlike people."}, {"viet": "Ánh sáng sân khấu mờ dần và màn đầu của vở kịch kết thúc.", "eng": "The stage lights were dimmed, and the play's first act was over."}, {"viet": "Cơn bão đã di chuyển qua hồi đêm mà không gây thiệt hại gì.", "eng": "The storm blew over in the night."}, {"viet": "Các sinh viên hăm hở học sau khi nghỉ hè.", "eng": "The students settled down to work after the vacation, with great zest."}, {"viet": "Uy quyền tối cao thuộc về tổng thống.", "eng": "The supreme authority resides in the President."}, {"viet": "Thầy giáo thi hành kỷ luật cả lớp bằng cách ra thêm bài tập làm ở nhà.", "eng": "The teacher disciplined the class by giving them extra homework."}, {"viet": "Người gọi điện nói có bom đặt trong khách sạn, nhưng sau này mới biết là trò đánh lừa.", "eng": "The telephone caller said there was a bomb in the hotel but it later turned out to be a hoax."}, {"viet": "Tên trộm bị bắt quả tang ( bởi cảnh sát ) khi đang đánh cắp một chiếc xe hơi.", "eng": "The thief was apprehended ( by the police ) in the act of stealing a car."}, {"viet": "Người nâng cốc chúc mừng say bí tỉ, là một lời nói thông tục.", "eng": "The toaster's on the blink is a colloquialism."}, {"viet": "Năm phút nữa tàu rời ga-chúng ta sẽ không thể đến kịp.", "eng": "The train leaves in five minutes-we'll never make it."}, {"viet": "Quân đội đã được dàn thành trận thế.", "eng": "The troops were formed in battle array."}, {"viet": "Hai đảng đối địch không có một quyền lợi chung nào cả.", "eng": "The two rival partics have no common ground."}, {"viet": "Vụ giết cha cực kỳ ghê tởm.", "eng": "The unnatural murder of his own father."}, {"viet": "Quang cảnh trước mặt chúng tôi lộ ra khi sương mù tan.", "eng": "The view opened out in front of us as the fog cleared."}, {"viet": "Quần áo được giặt không sạch.", "eng": "The washed clothes are not clean."}, {"viet": "Nhà Trắng nhận được tới tấp những cú điện thoại.", "eng": "The White House received a blizzard of phone calls."}, {"viet": "Thời tiết gió rét làm cho đường phố hỗn loạn.", "eng": "The windy weather has caused chaos on the roads."}, {"viet": "Các công nhân đang biểu tình ngồi để phản đối việc đóng cửa nhà máy.", "eng": "The workers are sitting in against the factory closures."}, {"viet": "Bọn trẻ rõ ràng đang muốn gây sự đánh nhau.", "eng": "The youths were clearly looking for a fight."}, {"viet": "Công việc của họ là khuyên mọi người làm thế nào để tránh căn bệnh này.", "eng": "Their job involves advising people how to avoid this disease."}, {"viet": "Vậy thì, tôi sẽ rút món tiền 1500 đô la Mỹ.", "eng": "Then, I'll draw a sum of US $ 1,500."}, {"viet": "Có một cái cầu ở phía dưới dòng sông cách đây một dặm.", "eng": "There's a bridge a mile down the river from here."}, {"viet": "Gần đây đã có được sự cải thiện toàn bộ.", "eng": "There's been an overall improvement recently."}, {"viet": "Xoong nước đang sôi trên lò.", "eng": "There's saucepan boiling away on the stove."}, {"viet": "Có nhiều loại san hô khác nhau.", "eng": "There are many different kinds of coral."}, {"viet": "Có mười cầu thủ mới trong danh sách của tôi.", "eng": "There are ten new players on the team's roster."}, {"viet": "Mùa hè này đã có mười người chết đuối.", "eng": "There have been ten swimming fatalities this summer."}, {"viet": "Khi trời sấm bao giờ cũng có chớp.", "eng": "There is always some lightning when it thunders."}, {"viet": "Cái áo cũ này còn mặc được chán.", "eng": "There is still a lot of wear left in that old coat."}, {"viet": "Có tiếng phựt lớn khi dây chun đứt.", "eng": "There was a loud ping as the elastic broke."}, {"viet": "Có hơi nước bốc lên từ máy giặt.", "eng": "There was steam coming from the washing machine."}, {"viet": "Ngày mai sẽ có một đợt không khí lạnh thổi từ miền Bắc.", "eng": "There will be frigid air coming from the north tomorrow."}, {"viet": "Những bông hoa này sẽ làm cho mảnh vườn của anh tươi vui lên.", "eng": "These flowers will brighten up your garden."}, {"viet": "Những đôi giày này sẽ làm đau chân người mang.", "eng": "These shoes will damage the wearer's feet."}, {"viet": "Họ đã được tăng 10% thế sao họ còn phàn nàn?", "eng": "They've already been given a 10% raise so why are they complaining?"}, {"viet": "Chúng được viết dựa trên các ký tự của Trung Quốc.", "eng": "They are based on Chinese characters."}, {"viet": "Họ bắt đầu hối tiếc việc tậu một toà nhà to như thế.", "eng": "They began to regret the purchase of such a large house."}, {"viet": "Họ có thể nghe thấy tiếng kêu đau đớn của người bị đè dưới đống gạch đổ.", "eng": "They could hear the anguished cries of people trapped under the rubble."}, {"viet": "Họ tiếp đãi bạn bè trên một quy mô lớn.", "eng": "They entertain friends on a large scale."}, {"viet": "Họ phải nhượng một ít lãnh thổ của họ.", "eng": "They had to cede some of their territory."}, {"viet": "Chúng giết đàn ông nhưng tha cho trẻ con.", "eng": "They killed the men but spared the children."}, {"viet": "Họ gặp nhau vào ngày thứ Hai và lấy nhau ngày thứ Sáu.", "eng": "They met on the Monday and were married on the Friday."}, {"viet": "Họ đẩy con thuyền xa hơn trong nước.", "eng": "They pushed the boat farther into the water."}, {"viet": "Họ gửi các con đi Mỹ học.", "eng": "They sent their children to school in America."}, {"viet": "Họ tìm cách bắt tôi phải kể với họ, nhưng tôi từ chối.", "eng": "They tried to bludgeon me into telling them, but I refused."}, {"viet": "Chúng đang tán gẫu trong góc phòng.", "eng": "They were chatting in the corner."}, {"viet": "Họ mệt lử sau một ngày dài làm việc trên các cánh đồng.", "eng": "They were worn out after a long day spent working in the fields."}, {"viet": "Chiếc ô tô cũ này là thoải mái nhất tôi chưa hề có, tôi sẽ lái nó cho đến khi nó long ra.", "eng": "This ark is the most comfortable car I've ever had, i'll drive in till it falls apart."}, {"viet": "Không nên nhầm cấu trúc câu này với thể bị động thông thường.", "eng": "This construction should not be confused with the regular passive."}, {"viet": "Phim hoặc tấm kẽm này được phủ một lớp hóa học cản quang.", "eng": "This film or plate is coated with a chemical sensitive to light."}, {"viet": "Đấy là một công việc mệt nhọc, nhưng tôi cố bằng mọi cách cứ tiến hành.", "eng": "This is exhausting work, but I manage to keep going somehow."}, {"viet": "Công việc này cho anh một cơ hội để phát triển tài năng âm nhạc của anh.", "eng": "This job gives scope for your musical abilities."}, {"viet": "Cái câu không nhất quán này làm cho lý lẽ của ông ta thành mất căn cứ.", "eng": "This non sequitur invalidates his argument."}, {"viet": "Tấn thảm kịch vừa qua đã đặt những tên sản xuất ma tuý lên ghế bị cáo một cách thích đáng.", "eng": "This recent tragedy has put the manufacturers of the drug squarely in the dock."}, {"viet": "Chiếc vali này đã bị quăng quật khá mạnh.", "eng": "This suitcase has had some rough handling."}, {"viet": "Những người đó hầu hết là thương nhân bán hàng.", "eng": "Those are mostly traders selling things."}, {"viet": "Thú thật, tình cờ bánh nướng nhân táo là món tráng miệng tôi ưa thích nhất, đặc biệt là khi nó được rưới kem trứng lên trên.", "eng": "To tell the truth, apple pie happens to be my favorite dessert, especially when it's topped with whipped cream."}, {"viet": "Giao thông bị ùn tắc ở trung tâm thành phố.", "eng": "Traffic has snarled up the city centre."}, {"viet": "Nhiều hoạt động phi pháp của các sĩ quan cảnh sát đã bị cuộc điều tra đưa ra ánh sáng.", "eng": "Various malpractices by police officers were brought to light by the enquiry."}, {"viet": "Nước chuyển từ thể lỏng sang thể rắn khi nó đông lạnh.", "eng": "Water passes from a liquid to a solid state when it freezes."}, {"viet": "Chúng tôi sẽ gởi cho các ông mẫu đơn đặt hàng chính thức của chúng tôi vào ngày mai.", "eng": "We'll send you our official order form tomorrow."}, {"viet": "Lúc này chúng tôi hoàn toàn tin chắc rằng vụ giết người xảy ra vào 5g30 chiều.", "eng": "We're now quite happy that the murder occurred at about 5: 30 pm."}, {"viet": "Cuối cùng thì chúng tôi cũng được hội đồng tán thành.", "eng": "We've got the OK from the council at last."}, {"viet": "Ngoài ra, chúng tôi còn có một hộp đêm karaoke, trung tâm thương mại, khu mua sắm có mái vòm, mỹ viện và trung tâm thể dục thể hình.", "eng": "We also have a Karaoke Night Club, Business Center, Shopping Arcade, Beauty Salon and Fitness Center."}, {"viet": "Chúng tôi nhận biết được điều vinh dự anh đã đưa lại cho chúng tôi.", "eng": "We are sensible of the honour you have done us."}, {"viet": "Chúng ta không thể lãng phí thời gian ở đây suốt ngày được, chúng ta phải làm một cái gì đó.", "eng": "We can't fiddle about here all day, we've got to get going."}, {"viet": "Chúng tôi bắt được xe buýt chỉ sớm hơn được mấy phút.", "eng": "We caught the bus with only minutes to spare."}, {"viet": "Chúng tôi không xem xét đến vấn đề phân phối lại của cải và quyền lực.", "eng": "We do not envisage nay distribution of wealth and power."}, {"viet": "Khi dọn đến London, chúng tôi thấy thay đổi nhiều quá.", "eng": "We found it quite a change when we moved to London."}, {"viet": "Chúng tôi phải huỷ bỏ trận đấu vì quá nhiều người ốm.", "eng": "We had to cancel the match, because so many people were ill."}, {"viet": "Chúng tôi chỉ có số tiền eo hẹp mà lại có nhiều đơn thỉnh cầu ganh đua nhau cho nên rất khó chọn.", "eng": "We have limited funds and several competing claims, so it is hard to choose between them."}, {"viet": "Chúng tôi hy vọng giải quyết vụ tranh chấp một cách thân mật.", "eng": "We hope to settle the dispute in an amicable way."}, {"viet": "Chúng tôi đã tìm cả thị trấn một phòng trống cho thuê.", "eng": "We looked all over town for a vacant room."}, {"viet": "Chúng ta cần đưa trật tự gọn gàng vào lề lối làm việc văn phòng của chúng ta.", "eng": "We must introduce some system into our office routine."}, {"viet": "Chúng tôi có giấy chứng nhận gửi tiền kỳ hạn trả tiền lãi suất cao hơn gửi tiền bình thường.", "eng": "We offer Time Certificates of Deposit which pay a higher rate of interest than regular deposits do."}, {"viet": "Chúng tôi xem xét hành vi của cô ấy với lòng hồ nghi.", "eng": "We regard her behaviour with suspicion."}, {"viet": "Chúng ta không nên than phiền về chuyện nghèo khổ-nhiều gia đình còn khốn khổ ( hơn chúng ta ) nhiều.", "eng": "We shouldn't complain about being poor-many families are much worse off ( than we are )."}, {"viet": "Trước đây chúng tôi thường nghe radio nhiều, nhưng ngày nay chúng tôi chủ yếu xem vô tuyến.", "eng": "We used to listen to the radio a lot, but nowadays we mostly watch television."}, {"viet": "Kẻ thù đông hơn chúng tôi gấp bội.", "eng": "We were completely outnumbered by the enemy."}, {"viet": "Chúng tôi sẽ gửi hàng hoá khi chúng tôi nhận được ngân phiếu của anh.", "eng": "We will forward the goods when we receive your cheque."}, {"viet": "À mọi thứ dường như đều hợp lệ.", "eng": "Well, everything seems to be in order."}, {"viet": "À, màu thì được, nhưng kiểu của nó không hay lắm.", "eng": "Well, the colour is all right, but the design is not that good."}, {"viet": "Cầu thủ ở đằng kia tên gì ạ?", "eng": "What's the name of that player over there?"}, {"viet": "Ngày nay các bậc cha mẹ dạy con cái mình những gì?", "eng": "What are the parents teaching their children these days?"}, {"viet": "Bạn làm gì với những người kém cỏi trong công việc?", "eng": "What do you do with people who are incompetent at their job?"}, {"viet": "Điều tôi phải nói có liên quan đến tất cả các bạn.", "eng": "What I have to say refers to all of you."}, {"viet": "Thành phố lớn thứ hai ở vương quốc Anh là thành phố nào?", "eng": "What is the second largest city in the United Kingdom?"}, {"viet": "Tôi nên sử dụng loại phương tiện nào?", "eng": "What mode of transportation should I use?"}, {"viet": "Quý vị đóng cửa vào lúc mấy giờ vào ngày chủ nhật?", "eng": "What time do you close on Sunday?"}, {"viet": "Ở Mỹ khi mua rượu, bạn phải xuất trình giấy chứng minh của bạn.", "eng": "When buying alcohol in America, you have to show your ID."}, {"viet": "Khi tôi cho hắn một dịp may, hắn liền chộp ngay lấy.", "eng": "When I gave him the chance, he grabbed it at once."}, {"viet": "Lúc ánh sáng mặt trời chiếu xuống bức tranh hoa hồng, thì bông hoa không phản chiếu tất cả ánh sáng đó.", "eng": "When sunlight falls on the picture of the rose, the flower does not reflect all the sunlight."}, {"viet": "Khi chúng tôi chuyển nhà chúng tôi yêu cầu những người ở nhà cũ của chúng tôi chuyển tiếp tất cả thư từ hàng hoá của chúng tôi tới địa chỉ mới.", "eng": "When we moved, we asked the people who took our old house to forward all our mail to our new address."}, {"viet": "Anh lấy đâu ra cảm tưởng rằng cô ấy không thích anh?", "eng": "Where did you get the idea that she doesn't like you?"}, {"viet": "Bạn thích loại nào hơn, quần áo thời trang hay quần áo rẻ tiền?", "eng": "Which do you prefer, designer clothes or cheap clothes?"}, {"viet": "Khi Mary đang viết thư thì bọn trẻ con đang chơi ngoài trời.", "eng": "While Mary was writing a letter, the children were playing outside."}, {"viet": "Ai là người đã sáng tạo khái niệm âm thanh nổi?", "eng": "Who originated the concept of stereo sound?"}, {"viet": "Sao anh không lên Scốtlen nghỉ ít ngày?", "eng": "Why don't you come up to Scotland for a few days?"}, {"viet": "Liệu kế hoạch mới có dễ chấp nhận hơn tí nào so với những kế hoạch trước đây không?", "eng": "Will the new plan be any more acceptable than its predecessors?"}, {"viet": "Vui lòng chỉ cho mình cách dọn giường nhé?", "eng": "Will you tell me how to make my bed?"}, {"viet": "Chỉ có hai ngày để đi, chúng ta không đủ thời gian nghỉ ngơi.", "eng": "With only two days to go we can't afford to relax."}, {"viet": "Tôi nghĩ anh là Jenkins, không biết có đúng không?", "eng": "Would I be correct in thinking that you are Jenkins?"}, {"viet": "Vậy ông có muốn uống thứ gì khác thay thế không, hồng trà Anh chẳng hạn?", "eng": "Would you like to have something else, say, English black tea instead?"}, {"viet": "Bạn thích làm việc bán thời gian hay làm việc toàn thời gian hơn?", "eng": "Would you prefer to have a part-time job or a full-time job?"}, {"viet": "Có, mỗi ngày tôi học được điều gì đó mới mẻ.", "eng": "Yes, I'm learning something new every day."}, {"viet": "Phải, nhưng cả du lịch rồi cũng chán, nếu không có gì khác để làm.", "eng": "Yes but even traveling gets boring If you have nothing else to do."}, {"viet": "Anh sẽ sớm có văn phòng riêng của anh nhưng lúc này anh phải ngồi chung với người khác.", "eng": "You'll have your own office soon but for the time being you'll have to share one."}, {"viet": "Cậu rất lạnh lùng với anh cậu, nhưng với bạn bè thì cậu lại trở nên thật là sôi nổi.", "eng": "You're very cool with your brother, but with your friends you really come to life."}, {"viet": "Anh về muộn thế, anh đi đâu vậy?", "eng": "You are very late, wherever have you been?"}, {"viet": "Bạn cũng có thảo luận về kế hoạch làm việc của ông ấy.", "eng": "You can also discuss his schedule."}, {"viet": "Bạn có thể nghỉ ngơi ở Plaza of Water trong khi đang ngắm nhìn tám bể nuôi cá hiếm.", "eng": "You can take a rest in the Plaza of Water while gazing at eight tanks of rare fish."}, {"viet": "Bạn đâu cần hết các thứ đó.", "eng": "You don't need all of that."}, {"viet": "Con có ý thức rất nhiều mà.", "eng": "You have too much common sense."}, {"viet": "Các anh nên cúi đầu xấu hổ, làm một việc như vậy thì thật là khủng khiếp.", "eng": "You may well hang your heads in shame, it was a terrible thing to do."}, {"viet": "Anh phải thể hiện sự ủng hộ của anh bằng việc làm, chứ không phải bằng lời nói.", "eng": "You must show your support by deeds, not words."}, {"viet": "Anh bảo anh không tin ở hôn nhân, nhưng tôi đánh cuộc là anh sẽ thay đổi ý kiến khi đã dứt khoát yêu ai.", "eng": "You say you don't believe in marriage, but I bet you sing a different song when you finally in love."}, {"viet": "Anh không nên cho phép nó vô lễ với anh như vậy.", "eng": "You shouldn't allow him to be disrespectful to you."}, {"viet": "Anh phải thực hiện những chỉ thị đó và chiều nay báo cáo lại.", "eng": "You will carry out these instructions and report back this afternoon."}, {"viet": "Những số liệu về ngân sách anh đưa ra năm nay là hoàn toàn chính xác.", "eng": "Your budget figures were bang on this year."}, {"viet": "Việc anh từ chối đặt tôi vào một tình thế khó xử vô cùng.", "eng": "Your refusal puts me in an awkward predicament."}]