[{"viet": "20 độ C nghĩa là 20 độ bách phân.", "eng": "20 độ C means twenty degrees centigrade."}, {"viet": "Đại úy Hải quân xếp cao hơn Đại úy bộ binh.", "eng": "A captain in the Navy ranks above a captain in the Army."}, {"viet": "Một nhân viên khách sạn gặp Tom và Mary, họ vừa mới đi nghỉ trở về.", "eng": "A clerk meets Tom and Mary who have just returned from their vacation."}, {"viet": "Một nước không coi trọng những người thông minh của nó.", "eng": "A country that doesn't value its brainpower."}, {"viet": "Một mô hình chi tiết của chiếc tàu Titanic.", "eng": "A detailed miniature of the Titanic."}, {"viet": "Sự sút giảm số lượng người tham dự.", "eng": "A fall in the numbers attending."}, {"viet": "Một miếng xương cá mắc kẹt trong họng tôi.", "eng": "A fish bone has stuck in my throat."}, {"viet": "Trang sử vẻ vang của nước Anh.", "eng": "A glorious page of English history."}, {"viet": "Một khách trọ đã trượt chân ngã trên nước trong phòng tắm.", "eng": "A guest slipped in some water in the bathroom."}, {"viet": "Một ngôi nhà đang được xây dựng.", "eng": "A house in course of instruction."}, {"viet": "Một đám đông người ùa vào trong phòng.", "eng": "A large flock of people crowded into the hall."}, {"viet": "Cuộc chạy tung tăng một chút quanh vườn.", "eng": "A little scamper round the garden."}, {"viet": "Một người chẳng bao giờ làm trọn vẹn một việc gì.", "eng": "A man who will never accomplish anything."}, {"viet": "Một tháng mang tên một của hoàng đế không thể chỉ có 30 ngày!", "eng": "A month named for an emperor could not have just 30 days!"}, {"viet": "Một doanh nhân ở New York đã mua toàn bộ công ty.", "eng": "A New York businessman has bought up the entire company."}, {"viet": "Một tấm trải giường làm bằng vải vụn.", "eng": "A patchwork quilt made out of oddments."}, {"viet": "Một văn phòng tìm việc làm cho các nhân viên thư ký.", "eng": "A placement agency for secretarial staff."}, {"viet": "Tài siêu phàm biết được những gì người khác đang suy nghĩ.", "eng": "A preternatural gift for knowing what others are thinking."}, {"viet": "Một bài tường thuật hơi thiếu vô tư về buổi họp đó.", "eng": "A rather slanted account of the meeting."}, {"viet": "Một căn phòng được trang trí rất có thẩm mỹ.", "eng": "A room furnished with perfect taste."}, {"viet": "Viên trung sĩ mau chóng đưa các tân binh đi vào khuôn phép.", "eng": "A sergeant soon knocks new recruits into shape."}, {"viet": "Một sơ suất trong lời nói đã khiến tôi nói Robert thay vì Richard.", "eng": "A slip of the tongue made me say Robert instead of Richard."}, {"viet": "Một bài phát biểu trong đó bà ta mô tả tổng quát tình hình thế giới.", "eng": "A speech in which she surveyed the international situation."}, {"viet": "Một sự cố bất ngờ của động cơ buộc phi công phải đáp khẩn cấp xuống biển Ai-len.", "eng": "A sudden engine failure forced to pilot to ditch in the Irish Sea."}, {"viet": "Một loại sơn đặc hơn tạo một lớp bao phủ tốt.", "eng": "A thicker paint which gives a good coverage."}, {"viet": "Một cuộc trình diễn hết sức tẻ nhạt của ca sĩ hát giọng nam cao.", "eng": "A very flat-footed performance from the tenor."}, {"viet": "Một phụ nữ được chọn để thăng chức sớm.", "eng": "A woman marked out for early promotion."}, {"viet": "Người ta đã buộc tội tham nhũng cho ông ta.", "eng": "Accusations of corruption have been brought against him."}, {"viet": "Các hãng quảng cáo liên tục điều chỉnh từng ly từng tí bộ máy quảng cáo rầm rộ đã được tổ chức tốn kém để đẩy mạnh việc bán hàng.", "eng": "Advertising agencies kept fine-tuning the costly calculated machinery of merchandising and hype."}, {"viet": "Sau cái chết của người vợ, ông ấy dường như đắm mình trong tuyệt vọng.", "eng": "After his wife's death, he seemed to give himself over to despair."}, {"viet": "Sau khi những người hang động đầu tiên sống trong hang đá hàng ngàn năm, băng bắt đầu tan trở lại.", "eng": "After the early cave men had lived in the caves for thousands of years, the ice began to melt back."}, {"viet": "Rượu có hại cho cơ thể của bạn.", "eng": "Alcohol is bad for your system."}, {"viet": "Được, tôi sẽ dùng hai món này.", "eng": "All right, I'll have them."}, {"viet": "Tất cả những kiểu mới của năm nay đều được trưng bày tại cuộc triển lãm xe ôtô.", "eng": "All this year's new models are displayed at the motor show."}, {"viet": "Điện ảnh Mỹ do các nhà sản xuất nước ngọt tài trợ.", "eng": "American movies bankrolled by soft drinks manufacturers."}, {"viet": "Một đường lối kiến trúc đòi hỏi những đường nét đơn giản.", "eng": "An architectural creed that demanded simple lines."}, {"viet": "Một điển hình kịch nghệ vào giai đoạn gay go nhất của nó.", "eng": "An exemplar of theatre at its most challenging."}, {"viet": "Một hòn đảo có nắng quanh năm.", "eng": "An island with year-round sunshine."}, {"viet": "Môi trường gia đình không hạnh phúc có thể ảnh hưởng đến hạnh kiểm của đứa trẻ.", "eng": "An unhappy home environment can affect a child's behaviour."}, {"viet": "Và chắc hẳn ông là ông K.", "eng": "And you must be Mr. K."}, {"viet": "Dù sao bố mẹ tôi cũng rất vui vì thành công của tôi.", "eng": "Anyway, my father and mother are very happy about my success."}, {"viet": "Ở nuớc bạn có nhiều tòa nhà cổ xưa rất đẹp phải không?", "eng": "Are there many nice old buildings in your country?"}, {"viet": "Bây giờ bạn đã hiểu rõ chưa?", "eng": "Are you in the picture now?"}, {"viet": "Bị bắt vì tội vu cáo.", "eng": "Arrested on a trumped-up charge."}, {"viet": "Miễn sao anh sống với anh, anh sẽ làm cho em hạnh phúc.", "eng": "As long as you stay with me, I'll make you happy."}, {"viet": "Thuốc aspirin có thể làm loét màng dạ dày.", "eng": "Aspirin can ulcerate the stomach lining."}, {"viet": "Tại hội chợ, một bà Gips đã đoán số mệnh của tôi.", "eng": "At the fair a gypsy told me my fortune."}, {"viet": "Kế hoạch tồi sẽ gặp khó khăn về sau.", "eng": "Bad planning will lead difficulty later."}, {"viet": "Chán nản về thất bại của ai.", "eng": "Be disappointed at somebody's failure."}, {"viet": "Vì công việc của bà là điều quan trọng nhất trong cuộc đời bà nên việc nghỉ hưu là điều rất khó khăn.", "eng": "Because her job had been the pivot of her life, retirement was very difficult."}, {"viet": "Ngoài ra, nước không đủ ấm nên không tắm được.", "eng": "Besides, the water is not warm enough to have a shower."}, {"viet": "Hãy giữ chỗ bây giờ cho kỳ nghỉ cả đời mới có!", "eng": "Book now for a holiday of a lifetime!"}, {"viet": "Những hy vọng của đội Anh có được một huy chương dựa vào Ovett.", "eng": "British hopes of a medal rested on Ovett."}, {"viet": "Nhưng tôi không biết bạn nên làm gì.", "eng": "But I don't know what you should do."}, {"viet": "Nhưng hôm nay các bạn của con và con có cuộc hẹn xem mặt nhau.", "eng": "But today my friends and I have blind dates."}, {"viet": "Lúc tôi đến, mọi sự đều đã xong xuôi.", "eng": "By the time I came on the scene, it was all over."}, {"viet": "Tôi có thể giao các cháu cho chị chăm sóc được không?", "eng": "Can I confide my children to your care?"}, {"viet": "Chúng tôi ngồi bàn cạnh của sổ được không?", "eng": "Can we have a table by the window?"}, {"viet": "Anh có thể làm cho người ta hiểu được anh bằng tiếng Anh không?", "eng": "Can you make yourself understood in English?"}, {"viet": "Anh có thể viết những bài đặc biệt về họ không?", "eng": "Can you write feature stories about them?"}, {"viet": "Trà đen Ceylon nổi tiếng thế giới mà.", "eng": "Ceylon black tea is world-famous."}, {"viet": "Bọn trẻ với bộ mặt háo hức mong chờ màn kịch câm bắt đầu.", "eng": "Children with expectant faces waiting for the pantomime to start."}, {"viet": "Cà phê và trà là các thức uống kích thích nhẹ.", "eng": "Coffee and tea are mild stimulants."}, {"viet": "So sánh các tuổi thọ của hai dân tộc.", "eng": "Comparing the longevities of the two peoples."}, {"viet": "Người tiêu thụ được động viên khiếu nại về những mặt hàng bị khuyết điểm.", "eng": "Consumers are encouraged to complain about faulty goods."}, {"viet": "Ông có thể kiểm tra lốp xe không?", "eng": "Could you give the tires a check, please?"}, {"viet": "Các thùng cam được đóng dấu nhãn hiệu của nhà xuất khẩu.", "eng": "Crates of oranges stamped with the exporter's trademark."}, {"viet": "Gầu tróc ra khỏi da đầu của mình.", "eng": "Dandruff flaking off one's scalp."}, {"viet": "Chất khử mùi hôi có bán sẵn ở dạng bình xịt và dạng lăn.", "eng": "Deodorants are available as aerosols or roll-ons."}, {"viet": "Cô ta có nói tên của cô ta cho anh biết chưa?", "eng": "Did she tell you her name?"}, {"viet": "Bạn không nghe dự báo thời tiết sáng nay sao?", "eng": "Didn't you listen to the weather forecast this morning?"}, {"viet": "Liệu tôi có nhận ra được ảnh hưởng tác hại của anh trong việc này không?", "eng": "Do I detect your hand in this?"}, {"viet": "Ông có xin giấy chứng nhận của giấy phép xuất khẩu không?", "eng": "Do you apply for the certified?"}, {"viet": "Bạn có cái dập ghim ở ngay bên cạnh không?", "eng": "Do you have a stapler handy?"}, {"viet": "Bạn có biết nó có ấn bản bìa thường chưa?", "eng": "Do you know if it's out in paperback yet?"}, {"viet": "Bạn thích tiểu thuyết hư cấu hay chuyện người thật việc thật hơn?", "eng": "Do you prefer fiction or non-fiction?"}, {"viet": "Anh có nghĩ rằng chúng ta sẽ tới được Huế vào buổi trưa không?", "eng": "Do you think we'll make Hue by midday?"}, {"viet": "Bà ta có bực tức về sự có mặt của tôi ở đây không?", "eng": "Does she resent my being here?"}, {"viet": "Đừng e dè như thế-bạn nhún nhường quá đấy!", "eng": "Don't be such a prude-you can carry modesty too far!"}, {"viet": "Chớ có nhập với bọn ấy bằng không mày sẽ chẳng ra gì đâu!", "eng": "Don't go around with that gang or you'll come to no good!"}, {"viet": "Đừng làm cho anh ta hy vọng quá nhiều.", "eng": "Don't raise his hope too much."}, {"viet": "Đừng bước lên xi măng chưa khô.", "eng": "Don't walk on the wet cement."}, {"viet": "Để số nhỏ nhất lái xe lên đồi dốc.", "eng": "Drive up a steep hill in bottom."}, {"viet": "Thiết bị ủi đất đi xuyên qua khu rừng rậm.", "eng": "Earth-moving equipment pierced through the jungle."}, {"viet": "Tận hưởng những lạc thú trên đời khi mình hãy còn trẻ.", "eng": "Enjoy the sweets of life while one is young."}, {"viet": "Mọi nhà điều khiển cuộc vận động chính trị đều thủ một hành động sấm sét cho tuần cuối trước Ngày Bầu Cử.", "eng": "Every political campaign manager saves a thunderbolt for the last week before Election Day."}, {"viet": "Xin lỗi, tôi muốn ăn sáng tại phòng của tôi vào sáng mai.", "eng": "Excuse me, I'd like to have breakfast in my room tomorrow morning."}, {"viet": "Những yếu tố ảnh hưởng đến tính cách dễ bị tổn thương của con người gây ra bệnh tim.", "eng": "Factors affecting people's vulnerability to heart disease."}, {"viet": "Cảm thấy bị hạn chế vì thiếu sự tài trợ của chính phủ.", "eng": "Feel strait-jacketed by the lack of government subsidy."}, {"viet": "Lính cứu hỏa cố gắng chế ngự ngọn lửa.", "eng": "Firemen managed to keep the fire under."}, {"viet": "Bay lướt nhanh trên các đỉnh các tòa nhà.", "eng": "Flying swiftly over the roof-tops."}, {"viet": "Với cuộc hành quân này chúng ta cần có nhiều yểm trợ của không quân.", "eng": "For this operation we need plenty of air cover."}, {"viet": "Từ giờ trở đi, nếu con đi về trễ như thế, hãy gọi và báo cho mẹ biết.", "eng": "From now on, if you're going to be out so late, call us and tell us."}, {"viet": "George Eliot là bút danh của Mary Ann Evans.", "eng": "George Eliot was the pseudonym of Mary Ann Evans."}, {"viet": "Hãy gọi điện cho tôi khi bạn rảnh.", "eng": "Give me call when you're free."}, {"viet": "Đột kích vào lãnh thổ của địch.", "eng": "Go on a foray into enemy territory."}, {"viet": "Nghiền hạt nhục đậu khấu rắc lên bánh pút-đinh.", "eng": "Grate the nutmeg over the pudding."}, {"viet": "Làm việc chăm chỉ là điều chính yếu nếu như bạn muốn thành công trong kinh doanh.", "eng": "Hard work is the name of the game if you want to succeed in business."}, {"viet": "Mày đã vẽ lên tường phải không?", "eng": "Have you been drawing on the walls?"}, {"viet": "Bạn có tiền lẻ đổi cho tôi tờ năm bảng Anh được không?", "eng": "Have you got change for a five-pound note?"}, {"viet": "Phải nói chuyện với một cử toạ luôn làm cho tôi lo lắng.", "eng": "Having to address an audience always give me the horrors."}, {"viet": "Ông ta luôn luôn chờ đợi tác phẩm của mình bị chỉ trích cho nên ông ta luôn luôn ở thế tấn công.", "eng": "He's always expecting criticism of his work, so he's always on the offensive."}, {"viet": "Anh ấy đang làm tiến sĩ toán ứng dụng.", "eng": "He's doing a PhD in applied mathematics."}, {"viet": "Nó đã đem đi phần lớn đồ đạc của nó rồi, chỉ còn lại vài thứ lặt vặt thôi.", "eng": "He's moved most of his stuff, there are just a few odds and ends left."}, {"viet": "Lúc này anh ta là người rất được ưa thích của các phương tiện truyền thông.", "eng": "He's the darling of the media just now."}, {"viet": "Hắn ta luôn thổi phồng các câu chuyện của mình cho buồn cười hơn.", "eng": "He always exaggerates to make his stories more amusing."}, {"viet": "Anh ta xin Đức Vua ân xá.", "eng": "He begged mercy of the king."}, {"viet": "Ông ta đã đến cùng với bà vợ, sáu đứa con, bốn con chó và nhiều thứ đồ đạc lỉnh kỉnh khác.", "eng": "He came with his wife, six children, four dogs and various other impedimenta."}, {"viet": "Nó hoàn toàn không quan tâm đến quan điểm của tôi.", "eng": "He completely disregarded my point of view."}, {"viet": "Ông ấy đòi hỏi, cũng khá hợp lý, là cần phải cho ông ta một cơ hội bày tỏ quan điểm của mình.", "eng": "He demanded, with some justice, that he should be given an opportunity to express his views."}, {"viet": "Anh ta không nói tốt về nước Anh.", "eng": "He doesn't have a good word to say for Britain."}, {"viet": "Anh ta trông mong một ai đó giải quyết khó khăn một cách tuyệt diệu và tìm ra cho anh một việc làm.", "eng": "He expects someone to wave a magic wand and find him a job."}, {"viet": "Hắn trốn sang Brazil để tránh lưới pháp luật.", "eng": "He fled to Brazil trying to escape the long arm of the law."}, {"viet": "Cứ có dịp là hắn ta trổ tài thao thao bất tuyệt ở nơi công cộng.", "eng": "He gets on his soap-box at the first opportunity."}, {"viet": "Anh ta đã được hướng nghiệp vào làm ở ngành Dân chính.", "eng": "He had been groomed for a career in the Civil Service."}, {"viet": "Tối nay nó phải làm nhiều bài tập ở nhà.", "eng": "He has a lot of homework to do tonight."}, {"viet": "Anh ta ít có hy vọng đoạt giải thưởng.", "eng": "He has little expectation of winning the prize."}, {"viet": "Anh ta đi thẳng đến quán rượu.", "eng": "He headed straight for the bar."}, {"viet": "Ông ấy bị mù một con mắt.", "eng": "He is blind in one eye."}, {"viet": "Ông ta là nhà chính trị lão thành ưu tú.", "eng": "He is the elder statesman par excellence."}, {"viet": "Anh ta biết mình chắc chắn sẽ thất bại sau khi anh ta thấy khu Hoa Kiều bị thu hẹp thô bạo.", "eng": "He knew he had it knocked after he saw a rough cut of Chinatown."}, {"viet": "Nó sẽ có ở đây khoảng 5 giờ.", "eng": "He'll be here around five."}, {"viet": "Ông ta đã đưa ra những lời ám chỉ rõ rệt vụ bê bối mới đây.", "eng": "He made pointed references to the recent scandal."}, {"viet": "Thậm chí anh ta chẳng hề bóc thư.", "eng": "He never even opened the letter."}, {"viet": "Hắn là hiện thân của sự tôn thờ tiền bạc.", "eng": "He personifies the worship of money."}, {"viet": "Anh ấy đề nghị công ty nên chuyển đến một nhà máy khác.", "eng": "He proposed that the company should move to another factory."}, {"viet": "Cậu đọc tài liệu về những con khủng long trong bách khoa toàn thư này và cậu quyết định sao chép những điều đó đưa vào báo của cậu.", "eng": "He reads the material about dinosaurs in this encyclopedia and decides to copy it in his paper."}, {"viet": "Anh ta phản công lại quả vô-lê của tôi bằng một cú rơ-ve, thí dụ trong chơi quần vợt.", "eng": "He responded to my volley with a backhand."}, {"viet": "Ông ta là người dễ xúc động.", "eng": "He's a very tense person."}, {"viet": "Anh ta hơn tôi một bậc.", "eng": "He's gone me one better."}, {"viet": "Anh ta bây giờ đã chết và được chôn cất hẳn hoi rồi.", "eng": "He's now safely dead and buried."}, {"viet": "Anh ta nói Tôi đã bảo anh nói vừng ơi hãy mở ra khi anh muốn vào hang.", "eng": "He said I told you to say open sesame when you want to enter the mountain."}, {"viet": "Anh ta có vẻ kín đáo quá đáng về quá khứ của mình.", "eng": "He seemed unduly reticent on the subject of his past."}, {"viet": "Ông ấy tỏ ra quan tâm đến độ người ta tưởng ông ta là một người trong họ.", "eng": "He showed such concern that people took him to be a relative."}, {"viet": "Hắn đã qua hai năm làm tù nhân của bọn binh sĩ nổi loạn trên núi.", "eng": "He spent two years as the prisoner of rebel soldiers in the mountains."}, {"viet": "Anh ta đứng sựng lại khi anh ta nghe thấy gọi tên mình.", "eng": "He stopped short when he heard his name called."}, {"viet": "Ông ta đã nói nào là chúng ta mang ơn cha mẹ biết bao nhiêu, nào là bổn phận của chúng ta đối với đất nước, vân vân và vân vân.", "eng": "He talked about how much we owed to our parents, our duty to our country and so on and so forth."}, {"viet": "Anh ấy lấy đi mọi thứ mà tôi có.", "eng": "He took all that I had."}, {"viet": "Anh ta cố gắng nghĩ một cách nào đó để chuộc lỗi lầm.", "eng": "He tried to think of some means of atonement."}, {"viet": "Nó bước vào, trơ tráo yêu cầu tôi đưa cho nó mượn 50 pao!", "eng": "He walked in, as bold as brass, and asked me to lend him 50 pounds!"}, {"viet": "Anh ta đã lên tàu rồi.", "eng": "He was already aboard the ship."}, {"viet": "Hắn giận dữ nóng ruột vì sự chậm trễ.", "eng": "He was champing with rage at the delay."}, {"viet": "Nó đã bị đuổi học vì cố ý húc đầu vào một học sinh nam khác.", "eng": "He was expelled for head-butting another boy."}, {"viet": "Anh ta bị một đòn choáng váng do bị thải hồi đột ngột.", "eng": "He was knocked completely for six by his sudden dismissal."}, {"viet": "Anh ta lúng túng trước hành vi trái ngược của cô ấy.", "eng": "He was perplexed by her contradictory behaviour."}, {"viet": "Anh ta bị tham vọng thôi thúc.", "eng": "He was spurred on by ambition."}, {"viet": "Anh ta rất béo nên bụng anh ta lắc lư khi anh ta chạy.", "eng": "He was very fat and his stomach wobbled as he ran."}, {"viet": "Nó huýt sáo, và con chó ngoan ngoãn chạy lại.", "eng": "He whistled, and the dog came obediently."}, {"viet": "Anh ta sẽ không chấp nhận ai can thiệp vào kế hoạch của mình.", "eng": "He would brook no interference with his plan."}, {"viet": "Hell for leather là một thành ngữ của tiếng Anh có nghĩa là tốc độ cao.", "eng": "Hell for leather is an English idiom which means to be high speed."}, {"viet": "Cách xử sự của bà ta là một sự xúc phạm hoàn toàn.", "eng": "Her behaviour was a positive outrage."}, {"viet": "Cái chết của cô ta đã làm Joe lao đao.", "eng": "Her death had an unbalancing effect on Joe."}, {"viet": "Bố cô ta có một cửa hàng tạp hoá đã nhiều năm.", "eng": "Her father kept a grocer's shop for a number of years."}, {"viet": "Chắc chắn ngôi nhà mới của cô ta không thuộc loại thường.", "eng": "Her house is certainly out of the ordinary."}, {"viet": "Mái tóc dài của nàng bị vướng vào bụi hồng.", "eng": "Her long hair entangled itself in the rose bush."}, {"viet": "Bức hoạ của cô ấy đầy màu sắc sinh động.", "eng": "Her painting is full of vibrant colours."}, {"viet": "Sự từ chức của bà ta chính là sự thú nhận thất bại.", "eng": "Her resignation amounts to an admission of failure."}, {"viet": "Sự ủng hộ của cô ta đã làm tăng thêm sức mạnh cho chúng tôi trong cuộc đấu tranh.", "eng": "Her support helped nerve us for the fight."}, {"viet": "Tiền giấy và ngân phiếu du lịch của tôi đây.", "eng": "Here are my notes and traveller's cheques."}, {"viet": "Lời tường thuật của nó về vụ tai nạn khớp với lời tường thuật của anh.", "eng": "His account of the accident tallies with yours."}, {"viet": "Thái độ của anh ta không có gì là bất thường cả.", "eng": "His behaviour is nothing out of the ordinary."}, {"viet": "Những kết luận của ông ấy thuần tuý là tư biện.", "eng": "His conclusions are purely speculative."}, {"viet": "Tính lịch sự vốn có của anh ta khiến không ai có thể ghét anh ta.", "eng": "His essential decency makes it impossible to dislike him."}, {"viet": "Bài diễn văn đầu tiên của ông với tư cách là Tổng thống đã gây một ấn tượng mạnh mẽ đối với người nghe.", "eng": "His first speech as President made a strong impression on his audience."}, {"viet": "Những việc thông đồng ám muội của hắn ta đã bòn rút đều đều lợi nhuận của doanh nghiệp.", "eng": "His illegal deals were steadily milking the profits from the business."}, {"viet": "Sự yêu thích ngôn ngữ đã đưa anh ta đến với nghề phiên dịch.", "eng": "His love of languages inclined him towards a career as a translator."}, {"viet": "Mục đích duy nhất trong đời hắn là kiếm càng nhiều tiền càng tốt.", "eng": "His one object in life is to earn as much money as possible."}, {"viet": "Việc lên chức giám đốc của anh ấy là sự bổ nhiệm được nhiều người hoan nghênh.", "eng": "His promotion to manager was a popular appointment."}, {"viet": "Lính của ông ta được dàn trận dọc theo bờ sông.", "eng": "His soldiers were arrayed along the river bank."}, {"viet": "Sự nhờ cậy hoàn toàn, tuyệt đối, trọn vẹn của anh ta vào các đồng nghiệp.", "eng": "His total, absolute, complete reliance on his colleagues."}, {"viet": "Anh ta thiếu sự năng nổ trong công việc.", "eng": "His work seemed to lack energy."}, {"viet": "Bọn côn đồ là những kẻ gây kinh hoàng cho cả thành phố.", "eng": "Hooligans who are a terror to the entire town."}, {"viet": "Về thiết bị, tình hình thế nào rồi?", "eng": "How are you situated with regard to equipment?"}, {"viet": "Làm sao lại có vết cào trên má của cậu thế?", "eng": "How did you come by that scratch on your cheek?"}, {"viet": "Chiếc áo đầm rũ ở phía sau thế nào?", "eng": "How does the dress hang at the back?"}, {"viet": "Chúng ta phải mất bao nhiêu lâu để đến Oxford?", "eng": "How long will it take us to get to Oxford?"}, {"viet": "Trong nhà bạn có bao nhiêu phòng?", "eng": "How many rooms are there in your home?"}, {"viet": "Một kẻ nghiện ma tuý phải cần bao nhiêu tiền để dùng một ngày?", "eng": "How much money does a C-head need to get through the day?"}, {"viet": "Tuy nhiên, chúng tôi đã phát hiện một số lỗi ở cột cân đối và muốn các ông kiểm tra lại giúp cho chúng tôi.", "eng": "However, we found some errors in the balance and would like you to check it for us."}, {"viet": "Tôi muốn gọi một cái bánh hamburger, một phần khoai tây chiên cỡ vừa, một phần bánh mì kẹp thịt big Mac và một cái bánh burger phômai đúp.", "eng": "I'd like a hamburger, a medium French fries, a big Mac meal and a double cheeseburger, please."}, {"viet": "Tôi thích một nữ bác sĩ khám bệnh cho tôi hơn.", "eng": "I'd prefer a woman doctor to examine me."}, {"viet": "Tôi sẽ đi với cô ta để biết chắc không có gì xảy ra cho cô ta.", "eng": "I'll go with her to make sure she comes to no harm."}, {"viet": "Tôi sẽ nằm trên giường bao lâu tùy thích-chẳng có luật nào cấm cả.", "eng": "I'll stay in bed as long as I like-there's no law against it."}, {"viet": "Tôi sợ là chỗ đó đã có người làm rồi.", "eng": "I'm afraid the post has already been filled."}, {"viet": "Tôi sẽ đi thăm nhà cha mẹ tôi sau.", "eng": "I'm going round to my parents'house later."}, {"viet": "Tôi hết sức cám ơn lòng độ lượng của anh.", "eng": "I'm most appreciative of your generosity."}, {"viet": "Cảm ơn ông, tôi toàn toàn có khả năng diễn đạt quan điểm của mình!", "eng": "I'm quite capable of speaking for myself, thank you!"}, {"viet": "Tôi vẫn còn dao động về tai nạn đó.", "eng": "I'm still screwed-up about the accident."}, {"viet": "Tôi rất tò mò về những người hàng xóm mới của chúng tôi.", "eng": "I'm very curious about our new neighbours."}, {"viet": "Mình đã đi khắp nơi trong thành phố để tìm một ngôi nhà tốt hơn.", "eng": "I've been scouting around town for a better house."}, {"viet": "Tôi bị cảm lạnh hoặc cái gì đó ở phổi được ba ngày nay rồi.", "eng": "I've had a cold or something in my air-bags for about three days now."}, {"viet": "Mình chỉ có 10 pao để sống cho đến ngày phát lương!", "eng": "I've only got 10 pounds to see me through until pay-day!"}, {"viet": "Cô nên dấu mình, Tôi sợ hãi khuyên cô ấy.", "eng": "I advised her out of my own nervousness, you'd better lie doggo."}, {"viet": "Tối nay tôi sẽ đến lớp thể dục nhịp điệu của tôi.", "eng": "I am going to my aerobics class tonight."}, {"viet": "Tôi đồng ý cho cậu cố kiếm ít tiền, nhưng đừng sao nhãng việc học tập.", "eng": "I approve of your trying to earn some money, but please don't neglect your studies."}, {"viet": "Tôi đánh cuộc là họ kiếm được khối tiền ở vụ buôn bán đó.", "eng": "I bet they are making a pile out of the deal."}, {"viet": "Tôi không thể làm bây giờ, nhưng tôi sẽ làm sau.", "eng": "I can't do it now, but I'll do it later."}, {"viet": "Tôi không thể không cần đến anh cho công việc đó, anh phải làm cho xong việc này trước đi.", "eng": "I can't spare you for that job, you must finish this one first."}, {"viet": "Tôi chỉ có thể nói chuyện một vài phút.", "eng": "I can only talk for a few minutes."}, {"viet": "Tôi chẳng thấy cái cửa nào trong phòng này.", "eng": "I can't see any door in this room."}, {"viet": "Tôi đã không thể thành công nếu không có sự giúp đỡ của các đồng nghiệp.", "eng": "I could not have succeeded without the assistance of my colleagues."}, {"viet": "Tôi muốn gửi một ít tiền.", "eng": "I'd like to deposit some money."}, {"viet": "Tôi không có ý nói như vậy: chẳng qua là lỡ lời thôi.", "eng": "I didn't mean to say that: it just slipped out."}, {"viet": "Tôi chẳng thích thú gì cái việc khiêng vác đồ đạc nặng mãi suốt ngày.", "eng": "I don't enjoy humping heavy furniture around all day."}, {"viet": "Tôi không muốn làm phiền anh đến thế.", "eng": "I don't like putting you to so much trouble."}, {"viet": "Tôi không hiểu tại sao nó đến.", "eng": "I don't understand why he came."}, {"viet": "Tôi không biết làm cách nào để đến nhà bạn.", "eng": "I don't know how to get to your house."}, {"viet": "Cháu rất thích những ngày sống ở đây.", "eng": "I enjoyed my stay here very much."}, {"viet": "Tôi thấy tay áo mình bị giật và quay lại.", "eng": "I felt a pull at my sleeve and turned round."}, {"viet": "Tôi thấy tư cách của hắn hết sức khó chịu.", "eng": "I found his manner extremely unpleasant."}, {"viet": "Tôi bị cúm và không làm ăn gì được trong một tuần.", "eng": "I got flu and was out of commission for a week."}, {"viet": "Tôi đã ngờ ngợ một cách kỳ lạ ngay khi anh nói điều đó.", "eng": "I had an odd sense of déjà vu just as you said that."}, {"viet": "Tôi không thích giao dịch buôn bán với các công ty lớn không có tình người.", "eng": "I hate dealing with large impersonal companies."}, {"viet": "Tôi rất khâm phục sự can đảm của anh ta.", "eng": "I have great admiration for his courage."}, {"viet": "Tôi có một số đĩa nhạc cổ điển nhưng không nhiều lắm.", "eng": "I have some classical records but not very many."}, {"viet": "Tôi chưa trả tiền sửa chữa chiếc xe đạp của tôi.", "eng": "I haven't paid for repairs to my bicycle."}, {"viet": "Tôi nghe nói rằng để xây đền Taj Mahal cho vợ mình, Shah Jehan đã bắt 20.000 người làm công việc xây dựng đó và họ đã mất 17 năm để hoàn thành.", "eng": "I heard that in order to build Taj Mahal for his wife, Shah Jehan made 20,000 men work on the building and took them 17 years to complete it."}, {"viet": "Tôi hy vọng là bạn vừa lòng với kết quả việc làm của bạn-bạn đã phá hỏng mọi thứ rồi!", "eng": "I hope you are pleased with your work-you've ruined everything!"}, {"viet": "Tôi đá con chó đó, nó đáp lại bằng tiếng gầm gừ.", "eng": "I kicked the dog, which responded by growling."}, {"viet": "Tôi đã bỏ không làm việc với họ sau một cuộc tranh cãi.", "eng": "I left their employ after an argument."}, {"viet": "Tôi chuẩn bị có ở nhà khi ông gọi.", "eng": "I'll arrange to be in when you call."}, {"viet": "Tôi không hệ với bọn quá khích.", "eng": "I'll have no truck with extremists."}, {"viet": "Tôi tìm cái bút của tôi khắp nơi mà suốt từ đó giờ nó vẫn ở ngay trước mặt tôi.", "eng": "I looked for my pen everywhere and it was under my nose all the time."}, {"viet": "Tôi mừng vì trên tàu có nhân viên cứu hỏa.", "eng": "I'm glad firemen are on the ship."}, {"viet": "Không chắc, nhưng tôi có thể một lần thưởng.", "eng": "I'm not sure, but I could use one."}, {"viet": "Cháu rất biết ơn hai bác.", "eng": "I'm very grateful to you."}, {"viet": "Tôi phải xin lỗi đã bất lịch sự khi đến trễ.", "eng": "I must apologize for my discourtesy in arriving late."}, {"viet": "Tôi cần một ngăn hồ sơ khác để đựng thư từ của tôi.", "eng": "I need another file for my letters."}, {"viet": "Tôi thường cảm thấy buồn ngủ sau bữa trưa, rồi sau đó tôi hồi sức lại vào buổi tối.", "eng": "I often feel sleepy after supper and then I get my second wind later in the evening."}, {"viet": "Khi đi du lịch tôi thích ăn qua loa hơn là một bữa đầy đủ.", "eng": "I prefer to snack when I'm travelling rather than have a full meal."}, {"viet": "Thật sự thì tôi chưa đi xem triển lãm mỹ thuật nhiều lắm.", "eng": "I really haven't had much exposure to art."}, {"viet": "Tôi bực mình về việc xâm phạm thời gian của tôi.", "eng": "I resent the encroachment on my time."}, {"viet": "Tôi thấy ít hy vọng tình trạng sức khỏe ông ta sẽ khá hơn.", "eng": "I see little prospect of an improvement in his condition."}, {"viet": "Đáng lẽ tôi không bao giờ được nói một lời như vậy.", "eng": "I should never have dreamt of saying such a thing."}, {"viet": "Tôi rất nghi rằng họ đang tìm cách gạt tôi ra.", "eng": "I strongly suspect that they're trying to get rid of me."}, {"viet": "Tôi cho anh ấy là người rất lịch sự đấy.", "eng": "I think he's most polite."}, {"viet": "Tôi nghĩ quyển sách đó là của tôi.", "eng": "I think that book is mine."}, {"viet": "Tôi nghĩ nàng đang muốn ám chỉ điều gì đó nhưng tôi mặc kệ.", "eng": "I thought she was hinting at something but I let it go."}, {"viet": "Tôi cố chận không cho anh ta qua cửa nhưng anh ta cứ chen vào.", "eng": "I tried to stop him coming through the door but he just barged his way in."}, {"viet": "Tôi đã sống ở đây suốt đời tôi.", "eng": "I've lived here all my life."}, {"viet": "Tôi muốn nhìn lên tường-anh có thể đẩy tôi lên được không?", "eng": "I want to have a look over the wall-can you give me a bunk-up?"}, {"viet": "Tôi rất giận bản thân mình vì đã phạm một sai lầm ngu ngốc như thế.", "eng": "I was angry with myself for making such a stupid mistake."}, {"viet": "Tôi đang rối trí vô cùng.", "eng": "I was in a complete haze."}, {"viet": "Tôi khiếp sợ đến nỗi hai chân run lẩy bẩy.", "eng": "I was so terrified my legs were wobbling."}, {"viet": "Tôi đã xem phim trên TV.", "eng": "I watched a movie on TV."}, {"viet": "Tôi muốn phải rõ ràng rằng quyết định đó là cuối cùng.", "eng": "I wish it to be clear that the decision is final."}, {"viet": "Tôi không biết khách sạn cô có hai phòng đơn trong 2 đêm nay không?", "eng": "I wonder if you have two single rooms for two nights?"}, {"viet": "Tôi muốn mua một số chi phiếu du lịch.", "eng": "I would like to buy some traveler's checks."}, {"viet": "Tôi sẽ không sẵn lòng chịu đựng cái chuyện khó chịu ấy một lần nữa.", "eng": "I wouldn't gladly go through that unpleasant experience again."}, {"viet": "Nếu mọi người góp tiền vào thì chúng mình sẽ có thể mua được một món quà chia tay thật đẹp tặng bà ấy.", "eng": "If everyone chips in we'll be able to buy her a really nice leaving present."}, {"viet": "Nếu nó không ở trong mục thể thao, thử tìm ở trong mục tiểu sử.", "eng": "If it's not under sport, try looking under biography."}, {"viet": "Nếu còn thừa thức ăn thì bỏ vào tủ lạnh.", "eng": "If there's any food over, put it in the fridge."}, {"viet": "Nếu gia đình đông người thì đi ôtô tiết kiệm hơn là đi tàu.", "eng": "If you've a large family, it's more economical to travel by car than by train."}, {"viet": "Nếu cậu không nhanh tay lên, cậu sẽ không bao giờ làm xong việc.", "eng": "If you don't pull your finger out, you'll never get the job finished."}, {"viet": "Nếu ông đẩy mạnh việc bán hàng của chúng tôi, chúng tôi sẽ cho ông một khoản chiết khấu cao, coi đó như là khoản giao kèo của chúng tôi.", "eng": "If you promote our goods, we will give you a good discount as our part of the bargain."}, {"viet": "Nếu bố cậu mà biết chuyện này ông sẽ nện cho cậu một trận nên thân!", "eng": "If your father hears about this he'll give you such a licking!"}, {"viet": "Dù gì đi nữa thì chúng tôi cũng sẽ báo cho anh biết trong vòng một tuần.", "eng": "In any case, we'll let you know in a week."}, {"viet": "Trong bài nói của mình bà ấy đã so sánh những lời hứa đầy lạc quan của chính phủ với những thành tích đáng buồn của nó.", "eng": "In her speech she contrasted the government's optimistic promises with its dismal achievement."}, {"viet": "Nói ra điều đó, anh đã nói oan cho cô ta.", "eng": "In saying this you do her an injustice."}, {"viet": "Dưới ánh mặt trời nóng bức, mặt đường có vẻ như ướt, nhưng đó chỉ là một ảo giác.", "eng": "In the hot sun the surface of the road seems wet, but that is only an illusion."}, {"viet": "Mặc quân phục, đồ tang, nguỵ trang, áo giáp.", "eng": "In uniform, mourning, disguise, armour."}, {"viet": "Vào thời đó một trong số các nhà lãnh đạo vĩ đại của Trung Quốc đã ra đời.", "eng": "Into these times one China's great leaders was born."}, {"viet": "Cô ấy cũng thất nghiệp luôn à?", "eng": "Is she out of work, too?"}, {"viet": "Bây giờ trong làng có nhiều bệnh tật không?", "eng": "Is there much sickness in the village now?"}, {"viet": "Cách đối xử của họ đối với con cái thật là cực kỳ đáng xấu hổ.", "eng": "It's a crying shame, the way they treat their children."}, {"viet": "Tranh cãi với trọng tài là hành vi không chấp nhận được.", "eng": "It's bad form to argue with the umpire."}, {"viet": "Tôi cho là trời sắp mưa'.'Ồ, tôi không nghĩ vậy!'!", "eng": "It's going to rain, I think.''Oh, I don't think so!"}, {"viet": "Ông Vương thật tốt khi mời tôi, tôi rất vui.", "eng": "It's nice of Mr. Wang to invite me, I'd be delighted."}, {"viet": "Anh ta làm một điều như vậy thật là bình tĩnh.", "eng": "It's pretty calm of him to do such a thing."}, {"viet": "Đã đến lúc anh cần nhận ra là anh không được mọi người ưa thích lắm.", "eng": "It's time you woke up to the fact that you're not very popular."}, {"viet": "Nó chảy xuống ngọn núi đó đổ vào con sông này.", "eng": "It comes down that mountain into this river."}, {"viet": "Đó là món salad tôm tươi, dưa chuột xắt lát, trứng và khoai tây xắt hạt lựu.", "eng": "It is a salad with fresh shrimps, cucumber slices, eggs, and diced potato."}, {"viet": "Tôi tin chắc rằng nó vô tội.", "eng": "It is my conviction that he is innocent."}, {"viet": "Không có mảy may khả năng anh sẽ được lựa chọn để đi.", "eng": "It isn't remotely possible that you will be chosen to go."}, {"viet": "Đó là món ưa thích của gia đình bác.", "eng": "It's a favorite of my family."}, {"viet": "Rất vui được gặp thưa ông Wilson.", "eng": "It's so nice to meet you, Mr. Wilson."}, {"viet": "Nếu tôi không bao giờ phải đến đấy nữa thì hợp ý tôi quá.", "eng": "It suits my book if I never have to go there again."}, {"viet": "Hôm nay là một ngày hết sức bình thường-không có gì xảy ra cả.", "eng": "It was a very ordinary day today-nothing special happened."}, {"viet": "Điều đó quá sức chịu đựng của con người.", "eng": "It was more than flesh and blood could bear."}, {"viet": "Anh thật rộng lượng đã bỏ qua cho hành vi thô lỗ của anh ta.", "eng": "It was very magnanimous of you to overlook his rude behaviour."}, {"viet": "Trời có lẽ sẽ mưa vào cái ngày chúng ta chọn để đi picnic!", "eng": "It would rain on the day we chose for a picnic!"}, {"viet": "Biệt hiệu của John là Tiny vì anh ấy rất nhỏ con.", "eng": "John's nickname is Tiny because he is very small."}, {"viet": "Cứ để tôi tóm được hắn thì biết!", "eng": "Just let me get my hands on him!"}, {"viet": "Năm ngoái họ kiếm lãi 22,000,00 bảng Anh.", "eng": "Last year they made a profit of £ 22,000,000."}, {"viet": "Để con ngủ thêm 10 phút nữa nhé?", "eng": "Let me sleep for another 10 min?"}, {"viet": "Mất độc lập là một giá đắt phải trả để được hòa bình.", "eng": "Loss of independence was high price to pay for peace."}, {"viet": "Nhiều người thường xuyên góp tiền vào công việc từ thiện.", "eng": "Many people regularly give money to charity."}, {"viet": "Nghiền trái cây nhừ ra ( bằng cái dĩa ) để cho đứa bé có thể ăn được.", "eng": "Mash the fruit up ( with a fork ) so that the baby can eat it."}, {"viet": "Tôi có thể dọn dẹp những thứ ở trên giường của ông được không?", "eng": "May I tidy up these things on your bed?"}, {"viet": "Phần lớn trẻ em ở Anh được học tập do nhà nước trả tiền.", "eng": "Most children in Britain are educated at public expense."}, {"viet": "Thưa ông Smith, ông có điện thoại.", "eng": "Mr. Smith, there is a call for you."}, {"viet": "Anh tôi là con chiên ghẻ trong gia đình.", "eng": "My brother is the black sheep of the family."}, {"viet": "Dây câu của tôi đã bị mắc vào chiếc lưới cũ.", "eng": "My fishing-line got fouled in an old net."}, {"viet": "Tên tôi là Lý Đại Minh.", "eng": "My name is Li Da-ming."}, {"viet": "Tầm nhìn lên sâu khấu của tôi bị cái mũ của một bà ngồi ở trước tôi chắn mất.", "eng": "My view of the stage was blocked by the hat of the woman sitting in front of me."}, {"viet": "Thuế mới nhằm tăng thêm thu nhập của nhà nước.", "eng": "New taxes intended to augment government income."}, {"viet": "Không, với tôi không sao cả.", "eng": "No, it's fine with me."}, {"viet": "Không ai tin lời tuyên bố của nó rằng nó vô tội.", "eng": "Nobody believed his claim that he was innocent."}, {"viet": "Bây giờ khu vực bán hàng là gồm những nơi nào?", "eng": "Now what is the territory to be covered?"}, {"viet": "Ồ, tôi nghĩ họ đang thông báo chuyến bay của tôi trên hệ thống truyền thanh đấy.", "eng": "Oh, I think they're announcing my flight over the public address system."}, {"viet": "Nào, đi nào! Một tối ở rạp hát không làm cháy túi đâu.", "eng": "On! One evening at the theatre won't break the bank."}, {"viet": "Thấm nhẹ một cái bằng giấy thấm, thế là mực khô ngay.", "eng": "One dab with blotting-paper and the ink was dry."}, {"viet": "Mới chỉ có vài mẩu tin vụn vặt được tiết lộ về tai họa đó.", "eng": "Only a few scraps of news about the disaster have emerged."}, {"viet": "Những cố gắng của chúng tôi nhằm thuyết phục bà ta đã thất bại-thậm chí bà ta còn không thèm nghe.", "eng": "Our efforts to persuade her were fruitless-she didn't even listen."}, {"viet": "Hàng xóm của chúng tôi trông nom khu vườn trong khi chúng tôi đi vắng.", "eng": "Our neighbours are looking after the garden while we are away."}, {"viet": "Quân đội ta sớm chiếm lại được thị trấn.", "eng": "Our troops soon regained possession of the town."}, {"viet": "Từ trần là uyển ngữ của chết.", "eng": "Pass away is a euphemism of die."}, {"viet": "Những người không thuộc một tổ chức chính trị nào.", "eng": "People unattached to any political organization."}, {"viet": "Xin gửi cho chúng tôi mẫu vải không thấm nước mà cửa hàng các ông có thể cung cấp.", "eng": "Please send us samples of the waterproof cloth that you can supply from stock."}, {"viet": "Run lên vì giận, cô ta đóng sầm cánh cửa.", "eng": "Quivering with rage, she slammed the door shut."}, {"viet": "Các nhà khoa học nói rằng họ đã bắt đầu có những phát hiện mới trong cuộc chiến chống ung thư.", "eng": "Scientists say they are beginning to break through in the fight against cancer."}, {"viet": "Chúng ta hẹn nhau lúc 7 giờ nhé?", "eng": "Shall we say seven o'clock?"}, {"viet": "Bà ta luôn luôn than vãn vì phải làm bao nhiêu việc.", "eng": "She's always groaning on about how much work she has to do."}, {"viet": "Rất may mắn là bà ấy có sức khoẻ rất tốt.", "eng": "She's fortunate enough to have very good health."}, {"viet": "Cô ta hoàn toàn không phải là người đứng đắn để anh quen.", "eng": "She's not at all a proper person for you to know."}, {"viet": "Cô ta đã chán ngấy những chuyện khôi hài nhàm tai của ông chồng.", "eng": "She's tired of her husband's stock jokes."}, {"viet": "Khi nghe một câu chuyện như vậy bao giờ cô ta cũng khóc.", "eng": "She always weeps when she hears such a story."}, {"viet": "Cô ấy nảy ra một ý nghĩ mới để tăng thêm việc bán ra.", "eng": "She came up with a new idea for increasing sales."}, {"viet": "Bà ấy không thể tham dự cuộc họp nên trợ lý của bà đã đến thay.", "eng": "She couldn't attend the meeting so her assistant took her place."}, {"viet": "Bà đã chết như một người hy sinh vì sự nghiệp tiến bộ.", "eng": "She died a martyr in the cause of progress."}, {"viet": "Cô ta mơ màng viển vông cho mình là giàu có.", "eng": "She fantasizes herself as very wealthy."}, {"viet": "Cô ta hồ hởi kể lại cuộc liên hoan.", "eng": "She gave an exuberant account of the party."}, {"viet": "Bà ấy có số phiếu hơn đối thủ của mình là 25 phiếu.", "eng": "She had a majority of 25 over her opponent."}, {"viet": "Cô ấy quan tâm sốt sắng đến mọi việc xung quanh.", "eng": "She has a lively interest in everything around her."}, {"viet": "Cô ta có thói quen kì lạ là béo tai mình trong khi nói.", "eng": "She has this strange mannerism of pinching her ear when she talks."}, {"viet": "Bà ta hành động như một nhà độc tài-và tôi dùng thuật ngữ đó sau khi đã suy nghĩ kỹ.", "eng": "She is behaving like a dictator-and I use the term advisedly."}, {"viet": "Bà ấy là người nổi tiếng ủng hộ quyền của phụ nữ.", "eng": "She is well-known for her advocacy of women's rights."}, {"viet": "Cô ta nghe với một vẻ bối rối trên gương mặt.", "eng": "She listened with a puzzled expression on her face."}, {"viet": "Cô ấy đã gửi hai khoản tiền 500 pao vào tháng trước.", "eng": "She made two deposits of 500 pounds last month."}, {"viet": "Cô ấy có những quyển sách đó chỉ để trưng bày-cô ấy chẳng bao giờ đọc chúng.", "eng": "She only has those books for show-she never reads them."}, {"viet": "Cô ta dựng xe dựa vào tường.", "eng": "She propped her bicycle against the wall."}, {"viet": "Cô ta thả lại con chim vào lồng của nó.", "eng": "She returned the bird to its cage."}, {"viet": "Bà ta đã phục hồi bình thường.", "eng": "She's her old self again."}, {"viet": "Cô ta nói cô không xứng đáng nhận vinh dự mà họ đã dành cho cô.", "eng": "She said she was not worthy to accept the honour they had offered her."}, {"viet": "Cô ấy ngả người thoải mái xuống ghế bành để đọc sách.", "eng": "She settled down in an armchair to read her book."}, {"viet": "Cô ta nói tiếng Pháp và tiếng Đức, ngoài ra còn nói được chút ít tiếng Nga.", "eng": "She speaks French and German and also a little Russian."}, {"viet": "Bà ấy ngờ là bọn trẻ giở trò nghịch ngợm và bà ấy thấy chúng đang đào hoa ở trong vườn.", "eng": "She suspected the children were up to some mischief and she found them in the garden digging up the flowers."}, {"viet": "Cô ấy đổi pa-tanh của cô ấy lấy chiếc đài xách tay của Billy.", "eng": "She traded her roller-skates for Billy's portable radio."}, {"viet": "Cô ta muốn anh ấy ở lại, nhưng anh vẫn bỏ về không đếm xỉa gì đến mong muốn của cô.", "eng": "She wanted him to stay, but he left in defiance of her wishes."}, {"viet": "Cô ấy được dành cho một cơ hội học tại trường Cao đẳng âm nhạc Hoàng gia.", "eng": "She was awarded a place at the Royal College of music."}, {"viet": "Người ta thấy cô ta nằm sấp trên sàn phòng giam.", "eng": "She was found prostrate on the floor of the cell."}, {"viet": "Nàng không hề có ý muốn trở thành một cô giáo.", "eng": "She was never meant to be a teacher."}, {"viet": "Bà ấy yếu đến nỗi cái bút của bà ấy cứ nguệch ngoạc trên trang giấy khi bà viết.", "eng": "She was so weak that her pen kept wandering over the page as she wrote."}, {"viet": "Cô ta mặc quần bò và áo phông lụng thụng.", "eng": "She was wearing jeans and a baggy T-shirt."}, {"viet": "Cô ấy lau bàn tay đầy bột của mình bằng một miếng giẻ ướt.", "eng": "She wiped her floury hands with a damp cloth."}, {"viet": "Em bé gái đó không muốn đến vườn bách thú-em sợ các thú vật.", "eng": "She wouldn't come to the zoo-she was frightened of the animals."}, {"viet": "Thái độ rất khoan dung đối với một đối thủ.", "eng": "Show great magnanimity towards an opponent."}, {"viet": "Từ ngày có vụ bê bối, nhà trường đã phần nào bị mang tai mang tiếng.", "eng": "Since the scandal, the school has rather fallen into disrepute."}, {"viet": "Mắc võng giữa hai thân cây.", "eng": "Sling a hammock between two tree-trunks."}, {"viet": "Những người được gọi là theo Thiên Chúa giáo không yêu thương ai hết.", "eng": "So-called Christians who show no love to anyone."}, {"viet": "Soho là một trong những vùng mang tiếng xấu nhiều ở London.", "eng": "Soho is one of London's more disreputable areas."}, {"viet": "Ngoài cửa có một người đàn ông nào đó đang xin được gặp ông.", "eng": "Some man at the door is asking to see you."}, {"viet": "Một số nhà chính trị đã thuyết phục không nên để phụ nữ đi bầu.", "eng": "Some politicians argued against giving women the vote."}, {"viet": "Hình như có cái gì không ổn-tôi có thể giúp gì được không?", "eng": "Something seems to be amiss-can I help?"}, {"viet": "Nói với cô ấy hả? Tôi không bao giờ hạ mình đâu.", "eng": "Speak to her? I'd never lower myself."}, {"viet": "Đã khởi đầu sự nghiệp của mình với thế lực trong xã hội hơn hẳn cha hồi trước.", "eng": "Started his career with far more social leverage than his father had enjoyed."}, {"viet": "Đừng có nhởn nhơ nữa, đến giúp tao một tay này.", "eng": "Stop fucking around and come and give me a hand."}, {"viet": "Số lượng sinh viên giảm đi mất 500.", "eng": "Student numbers have decreased by 500."}, {"viet": "Những người như thế là cột trụ của quốc gia.", "eng": "Such people are the backbone of the country."}, {"viet": "Được ạ, vài phút nữa chúng tôi sẽ mang mì đến phòng của ông.", "eng": "Sure, we'll send it to your room in a few minutes."}, {"viet": "Nhớ cẩn thận đừng uống rượu nhiều quá.", "eng": "Take care that you don't drink too much."}, {"viet": "Thầy giáo phải luôn luôn cảnh giác đề phòng sự lẫn lộn và hiểu lầm trong học sinh.", "eng": "Teachers have to be constantly on the alert for signs of confusion and misunderstanding in their pupils."}, {"viet": "Chủ nghĩa khủng bố lại ngóc cái đầu ghê sợ của nó dậy.", "eng": "Terrorism rearing its ugly head again."}, {"viet": "Cái đó như là tục ngữ có câu “ gậy ông đập lưng ông ”.", "eng": "That's like cutting off the hand that feeds you, as the old saying goes."}, {"viet": "Công ty đó muốn gia hạn tín dụng.", "eng": "That company wants to renew the credit."}, {"viet": "Bàn thắng cuối cùng là một bàn tuyệt vời.", "eng": "That last goal was a beauty."}, {"viet": "Cuộc chạy đó đã làm cho tôi hết hơi.", "eng": "That run has puffed me out."}, {"viet": "Người đàn ông buôn bán ô tô cũ đó là một tên lừa đảo thực sự.", "eng": "That used car salesman is a real crook."}, {"viet": "Tai nạn làm tắc nghẽn giao thông trên đường.", "eng": "The accident caused an obstruction on the road."}, {"viet": "Những tay thành thạo ở Washington có ý định cho hơn là lấy.", "eng": "The adepts in Washington mean to give rather than to take."}, {"viet": "Thị trường chứng khoán Mỹ chuyển hướng đột ngột cách đây một tuần.", "eng": "The American market turned round sharply a week ago."}, {"viet": "Việc bắt kẻ cướp, tù nhân vượt ngục v. v.", "eng": "The apprehension of the robbers, escaped prisoners, etc."}, {"viet": "Bài báo là đòn độc ác đối với hoạt động trước đây của bà ta.", "eng": "The article was a savage attack on her past actions."}, {"viet": "Cảnh sát được phép bắt giữ ăn mày.", "eng": "The authorisation of policemen to arrest beggars."}, {"viet": "Sức mạnh của bằng chứng ở bên bị cáo.", "eng": "The balance of the evidence lay on the side of the defendant."}, {"viet": "Từ vựng cơ bản của một ngôn ngữ.", "eng": "The basic vocabulary of a language."}, {"viet": "Điểm xuất sắc nhất trong buổi liên hoan là bữa ăn.", "eng": "The best thing about the party was the food."}, {"viet": "Máu đã đông lại quanh vết đứt trên đầu gối cô ta.", "eng": "The blood had congealed round the cut on her knee."}, {"viet": "Cuốn sách đó là một lời biện minh xuất sắc cho những chính sách của chúng ta.", "eng": "The book is a brilliant defense of our policies."}, {"viet": "Các võ sĩ quyền Anh đấm nhau khủng khiếp.", "eng": "The boxers gave each other a terrific pummelling."}, {"viet": "Chú rể nhận được của hồi môn trước ngày cưới.", "eng": "The bridegroom received the dowry before his wedding day."}, {"viet": "Than âm ỉ bắt đầu bùng cháy thành ngọn màu vàng và cam.", "eng": "The burning coals started to flames yellow and orange."}, {"viet": "Hôm nay căng tin đông hơn thường lệ.", "eng": "The canteen is more than usually busy today."}, {"viet": "Cái xe lại cà giựt nữa rồi đấy.", "eng": "The car's acting up again."}, {"viet": "Toà lâu đài sẽ được khôi phục lại trong tháng này.", "eng": "The castle will be renovated this month."}, {"viet": "Ghế ngồi được sắp xếp lại để đối diện với sân khấu.", "eng": "The chairs were realigned to face the stage."}, {"viet": "Đứa trẻ leo lên ngồi trên vai bố nó.", "eng": "The child climbed up onto his father's shoulders."}, {"viet": "Bọn trẻ luôn mè nheo đòi tôi mua đồ chơi mới.", "eng": "The children always nagging me for new toys."}, {"viet": "Trẻ em dường như hoàn toàn không có khả năng tự mình làm việc một cách yên lặng.", "eng": "The children seem to be totally incapable of working quietly by themselves."}, {"viet": "Sự mâu thuẫn tình cảm mọi người đều biết của giáo hội về vấn đề tình dục.", "eng": "The Church's well-known ambivalence on sexual matters."}, {"viet": "Những người leo núi gặp khó khăn trong việc tìm được chỗ bám chắc trên mặt đá.", "eng": "The climbers had difficulty getting any purchase on the rock face."}, {"viet": "Sự suy sụp của sức khoẻ của ai đó.", "eng": "The collapse of somebody's health."}, {"viet": "Khối thịnh vượng chung bao gồm Anh và nhiều nước khác kể cả Canada, Ôxtralia và Niu Zilân.", "eng": "The commonwealth consists of Britain and various other countries including Canada, Australia, and New Zealand."}, {"viet": "Công ty đó cho các sinh viên thuê lại những căn hộ.", "eng": "The company subleases flats to students."}, {"viet": "Những hòn gạch và chai lọ không ngừng ném vào các tấm khiên chống bạo động của cảnh sát.", "eng": "The constant ricochet of bricks and bottles off police riot shields."}, {"viet": "Thuốc ho có chứa một chất long đờm.", "eng": "The cough medicine contains an expectorant."}, {"viet": "Phiên toà xét xử là cô ấy phạm tội.", "eng": "The court adjudged that she was guilty."}, {"viet": "Thập tự giá tượng trưng cho Thiên Chúa giáo.", "eng": "The cross is symbolic of Christianity."}, {"viet": "Các màn cửa phần phật tới lui trong gió.", "eng": "The curtains were flapping backwards and forwards in the wind."}, {"viet": "Cái chết của vợ ông ta đã làm ông ta suy sụp hoàn toàn.", "eng": "The death of his wife broke him completely."}, {"viet": "Nha sĩ không khám thấy được răng nào của cô ấy bị sâu.", "eng": "The dentist could detect no decay in her teeth."}, {"viet": "Có thể nhìn thấy được hình dáng lờ mờ của căn nhà.", "eng": "The dim outline of a house could be made out."}, {"viet": "Cuộc đời của bác sĩ là để xoa dịu nỗi đau đớn.", "eng": "The doctor's life is consecrated do the relief of suffering."}, {"viet": "Văn kiện này có ý làm như một tuyên bố chính thức.", "eng": "The document purports to be an official statement."}, {"viet": "Con lừa bị chất quá nặng, nó khó lòng leo nổi lên đồi.", "eng": "The donkey was so overloaded, it could hardly climb the hill."}, {"viet": "Người say rượu nặng chịch trong tay tôi.", "eng": "The drunken man was a dead weight in my arms."}, {"viet": "Người con cả thừa kế phần lớn tài sản.", "eng": "The eldest son inherited the bulk of the estate."}, {"viet": "Các kỹ sư đã hăng hái bắt tay vào việc sửa chữa cây cầu đó.", "eng": "The engineers set to on repair work to the bridge."}, {"viet": "Điều ác các anh làm có thể ảnh hưởng ngược lại tới các anh.", "eng": "The evil you do may rebound upon yourselves."}, {"viet": "Khoảng rộng của Bắc Cực chưa được biết một cách đầy đủ.", "eng": "The extent of the North Pole is not fully known."}, {"viet": "Người nông dân thắng bò vào xe.", "eng": "The farmer hitched his bull to the cart."}, {"viet": "Quyền làm phim, quyền dịch, quyền bán ra nước ngoài ( một quyển sách ).", "eng": "The film, translation, foreign rights ( of a book )."}, {"viet": "Ngọn lửa bắt đầu khi hai sợi dây điện chạm vào nhau.", "eng": "The fire started when two wires came into contact."}, {"viet": "Gia đình của vị nguyên thủ quốc gia được đưa tin rất nhiều trong các tờ báo khổ nhỏ.", "eng": "The First Family gets a lot of coverage in the tabloids."}, {"viet": "Quần thực vật của vùng Himalaya, kỷ đại cổ sinh.", "eng": "The flora of the Himalayas, the Palaeozoic era."}, {"viet": "Nền nhà đã lún xuống hai bộ sau trận lụt.", "eng": "The foundations sank two feet after the flood."}, {"viet": "Phòng trưng bày tranh tượng là một kho tàng nghệ thuật Trung cổ.", "eng": "The gallery is a treasure trove of medieval art."}, {"viet": "Phần đông người Thụy Điển đều có tóc vàng hoe.", "eng": "The generalities of Swedes are blond."}, {"viet": "Một địa vị khá với tư cách ông bí thư giám đốc.", "eng": "The good spot as the director's secretary."}, {"viet": "Chính phủ đã tăng giá thuốc lá mỗi bao 10 xu.", "eng": "The Government has clapped an extra ten pence on a packet of cigarettes."}, {"viet": "Chính phủ đã lập ra một nhóm công tác để xem xét vấn đề.", "eng": "The Government set up a working party to look into the problem."}, {"viet": "Chùa Ngỗng Trời lớn hơn đã được xây dựng theo đề nghị của Huyền Trang, một vị sư nổi tiếng ở triều đại nhà Đường.", "eng": "The Greater Wild Goose Pagoda was built at the suggestion of Xuan Zhuang, the famous monk in the Tang Dynasty."}, {"viet": "Người khách trọ lại ngủ tiếp.", "eng": "The guest went back to sleep."}, {"viet": "Tấm kim loại chống nhiệt trên một khoang rời của con tàu vũ trụ.", "eng": "The heat-shield on a space capsule."}, {"viet": "Những ngày nghỉ đã trôi qua nhanh quá.", "eng": "The holidays passed far too quickly."}, {"viet": "Nhân viên khách sạn đã không tiếc công sức để bảo đảm cho chúng tôi được thú vị nhất trong thời gian chúng tôi ở khách sạn.", "eng": "The hotel staff spared no pains to ensure that our stay was as enjoyable as possible."}, {"viet": "Ngôi nhà có vẻ bị bỏ bê.", "eng": "The house wore a neglected look."}, {"viet": "Tầm quan trọng trong nhận định của anh ta được phóng to lên hết cỡ.", "eng": "The importance of his remark has been magnified out of all proportion."}, {"viet": "Người cùng ở tù đó đã mất thời gian sáu năm làm khổ sai.", "eng": "The inmate had put in six years at hard labour."}, {"viet": "Hòn đảo chỉ như một dấu chấm ở chân trời.", "eng": "The island was just a dot on the horizon."}, {"viet": "Ý kiến của thẩm phán đưa ra cho bồi thẩm đoàn.", "eng": "The judge's charge to the jury."}, {"viet": "Cái nút đã được thắt theo một cách không thể nào cởi ra được.", "eng": "The knot was fastened in such a way that it was impossible to undo."}, {"viet": "Tin tức mới nhất không làm giảm nỗi lo ngại của anh ấy.", "eng": "The latest news had done nothing to allay his anxiety."}, {"viet": "Truyền thuyết về nàng Mạnh Khương là một truyền thuyết quen thuộc ở Trung Quốc.", "eng": "The legend about Meng Jiangnu is a household one in China."}, {"viet": "Chiếc tàu khách đâm vào chiếc thuyền đánh cá trong sương mù dày đặc.", "eng": "The liner ran down a fishing-boat in thick fog."}, {"viet": "Chiếc xe tải bỗng quay tròn trên một vạt băng.", "eng": "The lorry went into a spin on a patch of ice."}, {"viet": "Những chính đảng chính ở Hoa Kỳ là Đảng Dân chủ và Đảng Cộng hòa.", "eng": "The main political parties in the United States are the Democrats and the Republicans."}, {"viet": "Sự khác nhau rõ rệt giữa hai cậu bé.", "eng": "The marked differences between the two children."}, {"viet": "Ngày nay phương tiện uyên thông có rất nhiều sức mạnh.", "eng": "The media has a lot of power today."}, {"viet": "Cuộc đảo chính quân sự đó đã mang lại hậu quả thảm khốc trong tiến trình của nó.", "eng": "The military coup brought dire consequences in its train."}, {"viet": "Mô hình này là một kiểu kết hợp những hình cầu với các thanh thẳng trông thật lạ lùng.", "eng": "The model is an odd-looking structure of balls and robs."}, {"viet": "Chương vẻ vang nhất trong lịch sử đất nước chúng ta.", "eng": "The most glorious chapter in our country's history."}, {"viet": "Nhạc đó gợi lại những ký ức về thời thanh xuân của bà ta.", "eng": "The music evoked memories of her youth."}, {"viet": "Thuốc tẩy mới diệt mầm bệnh mạnh gấp đôi.", "eng": "The new bleach with double strength for killing germs."}, {"viet": "Khu nhà cơ quan mới xây không ăn nhập với bối cảnh xung quanh.", "eng": "The new office block doesn't blend in with it's surroundings."}, {"viet": "Tin về cái chết của anh ta làm mọi người bàng hoàng.", "eng": "The news of his death was a bombshell."}, {"viet": "Những kệ sách về các tác phẩm văn xuôi dựa theo sự thực trong thư viện.", "eng": "The non-fiction shelves in the library."}, {"viet": "Các y tá đã được đề nghị trả thêm 5%, nhưng họ vẫn tiếp tục đòi tăng tiền lương 7%.", "eng": "The nurses have been offered an extra 5%, but they're standing out for a 7% pay rise."}, {"viet": "Tiền cũ sẽ được thu hồi dần dần trước năm 1990.", "eng": "The old currency will have been phased out by 1990."}, {"viet": "Trở ngại duy nhất là tôi không có tiền.", "eng": "The only snag is that I have no money."}, {"viet": "Cái lò nướng bánh có bộ phận định giờ tự động và các bộ phận tinh xảo khác.", "eng": "The oven has an automatic timer and other refinements."}, {"viet": "Các bên trong vụ kiện đã dàn xếp với nhau ổn thỏa không phải ra tòa.", "eng": "The parties in the lawsuit settled with each other out of court."}, {"viet": "Tình trạng của bệnh nhân ấy ổn định.", "eng": "The patient's condition is stable."}, {"viet": "Tuyết thường xuyên ở vùng bắc cực.", "eng": "The perpetual snow of the Arctic."}, {"viet": "Những con chim bồ câu này bạo đến nỗi chúng đậu cả trên vai anh.", "eng": "The pigeons are so tame they will sit on your shoulder."}, {"viet": "Máy bay lao vào một quả núi, và vỡ tan tành khi đâm vào nó.", "eng": "The plane flew into a mountain and disintegrated on impact."}, {"viet": "Vở này đã được trình diễn lần đầu tiên tháng Sáu năm 1923.", "eng": "The play was given its first performance in June 1923."}, {"viet": "Cảnh sát yêu cầu người đó làm một bản khai.", "eng": "The police asked the man to make a statement."}, {"viet": "Cảnh sát ngăn ngừa và phát hiện tội phạm Nó đã đi theo con đường tội phạm.", "eng": "The police prevent and detect crime He took to a life of crime."}, {"viet": "Các chính trị gia nhường quyền cho quân đội.", "eng": "The politicians yielded power to the army."}, {"viet": "Trong thời kỳ này quyền lực của những địa chủ đã suy yếu.", "eng": "The power of the landowners waned during this period."}, {"viet": "Tuần trước Tổng Thống đã phủ quyết việc cắt giảm giá mặt hàng ngũ cốc.", "eng": "The President last week vetoed a cereal price cut."}, {"viet": "Lý do quan trọng nhất của quảng cáo là để bán được thêm nhiều hàng.", "eng": "The primary reason for advertising is to sell more goods."}, {"viet": "Những người tù bị buộc nằm phủ phục trước những người bắt họ.", "eng": "The prisoners were forced to lie prostrate in front of their captors."}, {"viet": "Dự án sẽ mất khoảng từ tám đến mười triệu đô la.", "eng": "The project will cost between eight and ten million dollars."}, {"viet": "Cú đấm đó làm cho tôi bất tỉnh một lúc.", "eng": "The punch stunned me for a moment."}, {"viet": "Sự yên tĩnh và mát mẻ đã làm cho nàng tươi tắn trở lại.", "eng": "The quiet and the cool laved her."}, {"viet": "Tên thật của Augustus là Octavius.", "eng": "The real name of Augustus was Octavius."}, {"viet": "Thánh tích là những vật được tôn kính.", "eng": "The relics were objects of veneration."}, {"viet": "Khả năng phục hồi sức khỏe của gió biển.", "eng": "The restorative powers of sea air."}, {"viet": "Nguy cơ cắt đứt quan hệ Đông-Tây.", "eng": "The risk of rupturing East-West relations."}, {"viet": "Khối đá được đào lên, nghiền nát và trộn lẫn với bùn.", "eng": "The rock is dug out, crushed, and mixed with mud."}, {"viet": "Nguyên tắc là phải có người trực vào bất cứ lúc nào.", "eng": "The rule is that someone must be on duty at all times."}, {"viet": "Chất nhựa dâng lên trong cây cối vào mùa xuân.", "eng": "The sap rises in trees in springtime."}, {"viet": "Tỉ số lúc nghỉ giữa hai hiệp là 2-2.", "eng": "The score at half-time was 2-2."}, {"viet": "Câu là đơn vị lớn nhất của sự phân tích ngữ pháp.", "eng": "The sentence is the maximal unit of grammatical analysis."}, {"viet": "Con tàu ra khỏi sương mù hiện ra trong tầm nhìn.", "eng": "The ship came into sight out of the fog."}, {"viet": "Cửa hiệu thu được 50.000 bảng Anh tuần trước.", "eng": "The shop took £ 50.000 last week."}, {"viet": "Người ca sĩ bị phê bình vì lối phân phách.", "eng": "The singer was criticized for her poor phrasing."}, {"viet": "Khói làm tôi chảy nước mắt.", "eng": "The smoke makes my eyes run."}, {"viet": "Nghệ sĩ độc tấu biểu diễn tuyệt vời.", "eng": "The soloist gave a brilliant performance."}, {"viet": "Các khán giả bị kích động mạnh bởi cơn sợ hãi.", "eng": "The spectators were carried away by the fear."}, {"viet": "Nhà ga đóng cửa vì có cảnh báo bị đặt bom.", "eng": "The station was closed because of a bomb scare."}, {"viet": "Chiến lược là nhằm tiêu hao dần sức kháng cự của quân địch.", "eng": "The strategy was designed to wear down the enemy's resistance."}, {"viet": "Tiếng nổ lớn bất thình lình làm chúng tôi sững bước.", "eng": "The sudden bang froze us in our tracks."}, {"viet": "Các triệu chứng đã xuất hiện sau đó mười ngày.", "eng": "The symptoms manifested themselves ten days later."}, {"viet": "Cô giáo nói một giọng lên xuống rất dễ nghe.", "eng": "The teacher spoke with a pleasant cadence."}, {"viet": "Mái lều bắt đầu trũng xuống khi vải bạt bị ướt.", "eng": "The tent began to sag as the canoes become wet."}, {"viet": "Mối đe doạ của sự huỷ diệt bằng vũ khí hạt nhân.", "eng": "The threat of annihilation by nuclear weapons."}, {"viet": "Cuộc thi đấu được tổ chức cho những người chơi nghiệp dư cũng như các đấu thủ chuyên nghiệp.", "eng": "The tournament is open to amateurs as well as professionals."}, {"viet": "Sự di chuyển của trái đất quanh mặt trời tạo nên chu kỳ các mùa.", "eng": "The traveling of the earth around the sun causes the circle of the seasons."}, {"viet": "Hai chiếc ô tô đâm nhau nhưng may thay không ai bị thương nặng.", "eng": "The two cars collided, but luckily no one was seriously hurt."}, {"viet": "Trọng tài đã gọi cú đánh bóng chạy vòng là hỏng và chúng tôi đã thua trận đấu, chúng tôi đã bị bóc lột.", "eng": "The umpire called the home run a foul ball and we lost the game, we were robbed."}, {"viet": "Nhân viên giặt quần áo giao nhầm quần áo đã giặt ủi.", "eng": "The valet delivered the wrong laundry."}, {"viet": "Du khách thường mua ngân phiếu du lịch để thanh toán cho những chi phí đi lại ở nước ngoài.", "eng": "The visitors usually purchase traveller's cheques for the payment of travel expenses abroad."}, {"viet": "Cái Cách anh ta lăng mạ bạn bè sau lưng làm tôi bực mình.", "eng": "The way he insults his friend behind their backs really pisses me."}, {"viet": "Toàn đội sung sướng ngây ngất vì thắng trong cuộc thi đấu.", "eng": "The whole team were over the moon at winning the competition."}, {"viet": "Người đàn bà đó mặc bộ đồ đẹp nhất của mình.", "eng": "The woman dressed herself in her best clothes."}, {"viet": "Mảnh vụn máy bay sau vụ tai nạn.", "eng": "The wreckage of the plane after the crash."}, {"viet": "Cuộc nói chuyện của họ đầy những lời phỉ báng.", "eng": "Their conversation was full of profanities."}, {"viet": "Cái lý do nguỵ trang của họ về chuyện đi là để thăm bạn bè.", "eng": "Their ostensible reason for travelling was to visit friends."}, {"viet": "Vậy có lẽ phải nói rằng người Nhật thật thà hơn.", "eng": "Then maybe we should say Japanese men are more honest."}, {"viet": "Có nhiều việc phải làm cho nên ta phải cương quyết bắt tay vào ngay.", "eng": "There's a lot to be done, so let's get cracking."}, {"viet": "Quanh đây chẳng có quán rượu nào, hoặc ít ra là theo như tôi biết.", "eng": "There's no pub round here, leastways not that I know of."}, {"viet": "Trong phòng của người khách trọ có vài con muỗi.", "eng": "There are a few mosquitoes in the guest's room."}, {"viet": "Chỉ còn hai ngày nữa là đến tuyển cử.", "eng": "There are only two days to go before the election."}, {"viet": "Rồi có những vị lãnh chúa lớn sống trong các lâu đài.", "eng": "There came to be great lords who lived in castles."}, {"viet": "Có một sự ganh đua giữa hai chị em.", "eng": "There is a great rivalry between the two sisters."}, {"viet": "Giữa bạn bè với nhau không cần phải khách sáo.", "eng": "There is no need for ceremony between friends."}, {"viet": "Nên có thêm nhiều xe buýt trong giờ cao điểm.", "eng": "There ought to be more buses during the rush hours."}, {"viet": "Khi con bò xông vào, phòng họp của làng liền xảy ra một sự hỗn loạn ghê gớm.", "eng": "There was absolute mayhem when the cow got into the village hall."}, {"viet": "Có hàng đám người tại nơi bán đồ cũ.", "eng": "There were hordes of people at the jumble sale."}, {"viet": "Những con chim này có khả năng sống sót qua những hiểm nguy của mùa đông Bắc cực.", "eng": "These birds are able to survive the perils of the Arctic winter."}, {"viet": "Xâu chuỗi và nhẫn này là những món quà lưu niệm quyến rũ và là những món quà tặng đáng yêu.", "eng": "These necklaces and rings make attractive souvenirs and lovely gifts."}, {"viet": "Chúng sẽ cho ông biết rõ về những sản phẩm chúng tôi đang kinh doanh.", "eng": "They'll give you a good idea of the products we handle."}, {"viet": "Người ta đã gửi cho chúng tôi một bản kê khai nữa để điền vào.", "eng": "They've sent us another form to fill in."}, {"viet": "Họ đang dự định bắt đầu các buổi thử giọng lúc ba giờ đúng.", "eng": "They are planning to start the auditions at three o'clock sharp."}, {"viet": "Họ cắm trại ở trong rừng một tuần lễ.", "eng": "They camped out in the woods for a week."}, {"viet": "Họ làm hết sức để ngăn chặn sự lây lan của căn bệnh.", "eng": "They did their utmost to prevent the disease spreading."}, {"viet": "Cách đây hàng nghìn năm, con người đã khám phá ra cách chế tạo vải lanh.", "eng": "They found out how to make linen thousands of years ago."}, {"viet": "Chúng có nhà bếp, phòng tắm, máy điều hòa.", "eng": "They have kitchen and bathroom and air conditioning and such."}, {"viet": "Họ đã sống với nhau như vợ chồng trong nhiều năm.", "eng": "They lived together as husband and wife for years."}, {"viet": "Họ nhét càng nhiều người lên xe buýt càng tốt.", "eng": "They packed as many people as possible onto the bus."}, {"viet": "Họ trở về vào ban đêm theo như chúng tôi biết.", "eng": "They returned at night, as far as we know."}, {"viet": "Họ nhảy chồm lên cao vung giáo mác.", "eng": "They sprang high into the air brandishing their spears."}, {"viet": "Họ muốn có vải lụa, các thứ gia vị và nước hoa từ phương Đông.", "eng": "They wanted silks and spices and perfumes from the East."}, {"viet": "Họ đang làm ồn ào rất khó chịu.", "eng": "They were making enough noise to wake the dead."}, {"viet": "Họ sẽ không thể tiếp cận máy fax và máy điện báo được.", "eng": "They wouldn't have access to the fax and the telex machines."}, {"viet": "Cuốn sách này nói về từ và ý nghĩa của nó.", "eng": "This books deal with words and meanings."}, {"viet": "Cuốn từ điển này không cung cấp từ nguyên.", "eng": "This dictionary does not give etymologies."}, {"viet": "Con ngựa này có những cơ bắp rắn chắc.", "eng": "This horse has good solid muscle on him."}, {"viet": "Cho đến nay, đây là sự quyên góp lớn nhất mà chúng tôi có được.", "eng": "This is the biggest donation we've had to date."}, {"viet": "Máy chạy không được trơn.", "eng": "This machine is not running smoothly."}, {"viet": "Hộ chiếu này đã quá hạn và không còn giá trị nữa.", "eng": "This passport is out of date and not valid."}, {"viet": "Trường này có số lượng học sinh được tuyển là 800.", "eng": "This school has an enrolment of 800 pupils."}, {"viet": "Cái kiểu canh tác này dù gì thì cũng nhanh chóng chấm dứt.", "eng": "This type of farming is, for better or worse, rapidly dying out."}, {"viet": "Mặc dầu bị đau ốm một cách tuyệt vọng, ông ấy vẫn còn có thể sống lay lứt hàng tháng.", "eng": "Though desperately ill he could linger on for months."}, {"viet": "Tom, anh có thể nói gì về điều đó?", "eng": "Tom, what can you say about that?"}, {"viet": "Ư, dạ có, ông nói đúng đấy, bác sĩ ạ.", "eng": "Uh, yes, you're right, doctor."}, {"viet": "Đó là một công việc liều lĩnh nhưng không thể không khâm phục sự dũng cảm của cô ta.", "eng": "Was a rash thing to do, yet one cannot but admire her courage."}, {"viet": "Chúng ta sẽ quyết định đội hình khi chúng ta được chấp nhận dự cuộc thi.", "eng": "We'll decide on our team as and when we qualify for the competition."}, {"viet": "Chúng tôi ra quán làm ít vại bia.", "eng": "We're going down to the pub for a few jars."}, {"viet": "Chúng tôi đang đợi xem các đối thủ làm gì trước khi chúng tôi hành động.", "eng": "We're waiting to see what our competitors do before we make a move."}, {"viet": "Chúng tôi đã chứng kiến hai cuộc hợp nhất trong vòng một tuần.", "eng": "We've seen two amalgamations in one week."}, {"viet": "Chúng tôi rất vui được gặp lại ông.", "eng": "We are delighted to see you again."}, {"viet": "Chúng tôi đã yêu cầu người xây dựng lập bảng báo giá cho việc sửa chữa trần nhà.", "eng": "We asked our builder to estimate for the repair of the ceiling."}, {"viet": "Chúng ta có thể xếp 6 người xung quanh cái bàn này nếu có thể được.", "eng": "We can get six people round this table at a pinch."}, {"viet": "Chúng tôi có thể thấy ánh hoả đang nhấp nháy ở xa xa.", "eng": "We could see the lighthouse winking in the distance."}, {"viet": "Chúng tôi đã uống ( hết cả ) một chai rượu vang với nhau.", "eng": "We drank a ( whole ) bottle of wine between us."}, {"viet": "Chúng tôi có một khoảng thời gian thật là tuyệt vời tại bữa tiệc ngoài vườn.", "eng": "We had a fantabulous time at the garden party."}, {"viet": "Chúng tôi có để dành cho ông một bàn tốt nhìn ra phố.", "eng": "We have a nice table overlooking the street for you."}, {"viet": "Chúng tôi có nối máy tính với văn phòng Pari.", "eng": "We have the computer link-up with the Paris office."}, {"viet": "Chúng ta biết là một số người khác cũng gặp vấn đề tương tự nhưng họ nghĩ về nó như là một điều phiền phức hơn là một vấn đề.", "eng": "We know that some other people have the same problem but that they think of it as an inconvenience rather than a problem."}, {"viet": "Chúng tôi gặp nhau trong dịp nghỉ và lập tức thân nhau.", "eng": "We met on holiday and just clicked immediately."}, {"viet": "Chúng ta phải thay thế ghế mới cho cái ghế đã gãy.", "eng": "We must substitute a new chair for the broken one."}, {"viet": "Chúng tôi trồng đỗ đậu trong vườn.", "eng": "We planted beans and peas in the garden."}, {"viet": "Chúng tôi bán xe cho người trong ngành, không bán cho công chúng rộng rãi.", "eng": "We sell cars to the trade, not to the general public."}, {"viet": "Trên đường về nhà chúng tôi dừng chân ở quán rượu.", "eng": "We stopped off at the pub on the way home."}, {"viet": "Chúng tôi muốn đặt hàng kiểu điện thoại di động số 789 với nhiều màu khác nhau của các ông.", "eng": "We want to place an order for your mobile phone No.789 in various colors."}, {"viet": "Chúng tôi ngạc nhiên một cách thú vị trước lợi tức chúng tôi đã kiếm được.", "eng": "We were pleasantly surprised at the profit we made."}, {"viet": "Chúng tôi sẽ phải tính tiền bà về việc khoan mở cái hộp.", "eng": "We would have to charge you for drilling open the box."}, {"viet": "À, vậy thì tôi sẽ đi xe điện ngầm.", "eng": "Well, I'll take the subway then."}, {"viet": "À, ông nên nghỉ ngơi trong 2 hoặc 3 ngày.", "eng": "Well, you should rest for two or three days."}, {"viet": "Bữa ăn thật là tuyệt vời Jim ạ Hôm nay cậu thật phi thường.", "eng": "What a marvelous meal, Jim You're really excelled yourself."}, {"viet": "Bạn đã đọc những sách gì hồi học trung học?", "eng": "What books did you read in high school?"}, {"viet": "Cháu muốn ăn món gì, Asami?", "eng": "What do you want to eat, Asami?"}, {"viet": "Điều gì tuyệt nhất ở quê bạn?", "eng": "What is the best thing about your hometown?"}, {"viet": "Bạn nghĩ gì về nạn bạo lực xảy ra ở một số trận bóng đá ở châu Âu?", "eng": "What is your opinion of the violence that occurs at some European football games?"}, {"viet": "Bây giờ giờ địa phương ở Los Angeles là mấy giờ?", "eng": "What's the local time in Los Angeles?"}, {"viet": "Theo học khoá học này anh được gì?", "eng": "What will you gain from doing the course?"}, {"viet": "Khi bà cụ chết họ để tang.", "eng": "When grandmother died they went into mourning."}, {"viet": "Ở nước bạn mùa đẹp nhất là khi nào?", "eng": "When is the best reason in your home country?"}, {"viet": "Khi dòng sông làm vỡ đê, những cánh đồng bị ngập nước.", "eng": "When the river burst its banks the fields were inundated."}, {"viet": "Khi đi du lịch, bạn có gửi bưu ảnh cho bạn bè và gia đình của bạn không?", "eng": "When you travel, do you send postcards to your friends and family?"}, {"viet": "Nơi thơ mộng nhất bạn từng đến thăm là ở đâu?", "eng": "Where is the most romantic place you have ever visited?"}, {"viet": "Anh muốn nói tới ông Smith nào-người dạy lịch sử hay người dạy nhạc?", "eng": "Which Mr Smith do you mean-the one who teaches history or the one who teaches music?"}, {"viet": "Ai, cái gì, cái nào v. v.. là các đại từ nghi vấn.", "eng": "Who, what, which v. v.. are interrogative pronouns."}, {"viet": "Có rất nhiều sách dành hết nội dung để viết về đề tài này.", "eng": "Whole books are written on the subject."}, {"viet": "Tại sao bữa ăn sáng của tôi vẫn chưa được mang đến?", "eng": "Why hasn't my breakfast been delivered yet?"}, {"viet": "Làm ơn nối dây vào vô tuyến!", "eng": "Will you connect this wire to the television?"}, {"viet": "Gật đầu một cái cụt ngủn, anh ta quay đi và ngồi xuống.", "eng": "With a curt nod, he turned away and sat down."}, {"viet": "30 Phụ nữ thường nghĩ rằng họ đã lỡ thời ở cái tuổi 30.", "eng": "Women used to think they were on the shelf at."}, {"viet": "Xin cô cho biết khi nào xe đến trạm dừng của tôi nhé?", "eng": "Would you let me know when it's my stop?"}, {"viet": "Ông có phiền nếu tôi dừng xe một lát tại trạm xăng không?", "eng": "Would you mind if I made a quick stop at the gas station?"}, {"viet": "Thỉnh thoảng viết thư cho chúng tôi nhé.", "eng": "Write us a letter now and then."}, {"viet": "Có, nó bao gồm bảo hiểm tai nạn và trách nhiệm dân sự.", "eng": "Yes, it includes collision and liability insurance."}, {"viet": "Anh sẽ được thử thách lòng dũng cảm của mình trong thời kỳ huấn luyện.", "eng": "You'll be on your mettle during the training period."}, {"viet": "Rõ ràng anh khá bị lúng túng về các thủ tục của văn phòng nhưng tôi sẽ làm cho anh hiểu ra ngay thôi.", "eng": "You're clearly rather muddled about office procedures but I'll soon straighten you out."}, {"viet": "Anh mất chìa khoá, tôi có thể cho anh một chìa khoá phụ.", "eng": "You've lost your key I can give you a duplicate."}, {"viet": "Anh không thể mong đợi việc thăng chức là của trời cho sẽ đến với anh.", "eng": "You can't expect promotion to be handed to you on a plate."}, {"viet": "Cô có thể liên lạc với ông ấy tại Khách sạn Grand.", "eng": "You can get him at the Grand Hotel."}, {"viet": "Rút cục rồi anh có thể điều hành được công ty này nếu như anh chơi nước bài hay.", "eng": "You could end up running this company if you play your cards right."}, {"viet": "Anh là nguyên nhân của nhiều nỗi lo lắng.", "eng": "You have been the cause of much anxiety."}, {"viet": "Ông biết đấy, chúng tôi là Renbimbi.", "eng": "You know we call our currency'Renminbi'."}, {"viet": "Chắc là anh mệt-Trái lại, tôi cảm thấy rất tỉnh táo.", "eng": "You must be tired-On the contrary, I feel wide awake."}, {"viet": "Anh không cần quyền quyết định của tôi để thay đổi mọi thứ.", "eng": "You need not my say so to change things."}, {"viet": "Anh nên làm quen với luật chơi trước khi bắt đầu chơi.", "eng": "You should familiarize yourself with the rules before you start to play with the game."}, {"viet": "Ông uống mỗi lần một gói, một ngày bốn lần.", "eng": "You take a packet each time, four times a day."}, {"viet": "Anh sẽ không lừa gạt được bà ta đâu-bà ta là một người từng trải, anh biết đấy.", "eng": "You won't fool her-she's been around, you know."}, {"viet": "Trong con mắt của bố anh thì anh vẫn còn là một đứa bé.", "eng": "Your father's eyes you're still a child."}, {"viet": "Lời nói của anh ta dễ làm người ta hiểu nhầm.", "eng": "Your words were open to misconstruction."}]