[{"viet": "Hôm qua ở sân bay Heathrow người ta đã tịch thu được 20 kilô hêrôin.", "eng": "20 kilos of heroin were seized yesterday at Heathrow."}, {"viet": "Không có xăng thì chiếc ô tô vô dụng.", "eng": "A car is useless without petrol."}, {"viet": "Một nhân viên khách sạn dẫn khách đến phòng và giới thiệu ngắn gọn với ông ấy về khách sạn.", "eng": "A clerk shows the guest to his room and gives him a brief introduction of the hotel."}, {"viet": "Một xứ sở có nhiều sông chảy qua.", "eng": "A country watered by numerous rivers."}, {"viet": "Một sự phát triển hoàn toàn phù hợp với điều chúng tôi mong đợi.", "eng": "A development wholly in keeping with what we expected."}, {"viet": "Một cuộc cãi cọ, giữa những người trong gia đình.", "eng": "A falling-out among family members."}, {"viet": "Một con cá bị cái chĩa đâm xuyên qua.", "eng": "A fish transfixed with a harpoon."}, {"viet": "Một vương miện bằng vàng nạm kim cương.", "eng": "A gold crown encrusted with diamonds."}, {"viet": "Một khách trọ muốn nhờ giặt cái áo vét và cái áo kiểu bằng lụa của bà ấy.", "eng": "A guest wants to have her jacket and a silk blouse cleaned."}, {"viet": "Một căn nhà ở giữa rừng.", "eng": "A house in the middle of a wood."}, {"viet": "Một con thú lớn đã đi qua cánh rừng này.", "eng": "A large heavy beast was moving though the forest."}, {"viet": "Nếu sau khi dùng thuốc mà cảm thấy hơi mệt thì cũng không sao cả.", "eng": "A little tiredness after taking these drugs is to be expected."}, {"viet": "Một người giống như thế chúng ta sẽ không gặp lại.", "eng": "A man whose like we shall not see again."}, {"viet": "Một vé tháng thì kinh tế hơn là 4 vé tuần.", "eng": "A monthly is more economical than 4 weeklies."}, {"viet": "Một đứa bé mới chào đời thường được gọi là một thành viên thêm vào của gia đình.", "eng": "A newly born child is often called an addition to the family."}, {"viet": "Một lối đi đã hằn lên cỏ vì ở đó người ta hay đi tắt ngang.", "eng": "A path had been worn in the grass where people had cut the corner."}, {"viet": "Một đồ án của hoàng cung và khu vực xung quanh của nó.", "eng": "A plan of the royal palace and its surroundings."}, {"viet": "Một cô gái xinh đẹp đi ngang qua họ ở phía sau nhưng viên sĩ quan đã bảo các binh sĩ nhìn về phía trước.", "eng": "A pretty girl was walking past behind them but the officer told the soldiers to look to the front."}, {"viet": "Rắn chuông là một con vật rất độc.", "eng": "A rattlesnake is a really mean creature."}, {"viet": "Một căn phòng có hai giường chiếc.", "eng": "A room with two single beds."}, {"viet": "Một loạt các buổi họp riêng.", "eng": "A series of closed-door meetings."}, {"viet": "Một đường rãnh trên bảng đồng hồ ôtô để gắn rađiô.", "eng": "A slot on a dashboard for a car radio."}, {"viet": "Một bài diễn văn kích động đám đông tới cơn thịnh nộ cao.", "eng": "A speech that inflamed the crowd to a high pitch of fury."}, {"viet": "Một sự trở lại thình lình mối quan tâm đến nghệ thuật thời Victoria.", "eng": "A sudden resurgence of interest in Victorian art."}, {"viet": "Một vỏ giả tạo mong manh của nền văn minh Tây phương.", "eng": "A thin veneer of Western civilization."}, {"viet": "Một thanh niên rất điềm đạm và siêng năng.", "eng": "A very sober and hard working young man."}, {"viet": "Một phụ nữ có địa vị trong cộng đồng.", "eng": "A woman of some standing in the community."}, {"viet": "Người ta đã buộc tội tham nhũng cho ông ta.", "eng": "Accusations of corruption have been made against him."}, {"viet": "Quảng cáo thường là phương pháp khuyến mại có hiệu quả nhất.", "eng": "Advertising is often the most effective method of promotion."}, {"viet": "Sau nhiều giờ đào đắp, chúng tôi bắt đầu làm chậm lại một chút.", "eng": "After hours of digging, we began to slacken up a little."}, {"viet": "Sau cuộc bầu cử một số nghị sĩ mới trở thành những người nổi bật.", "eng": "After the election several new Members of Parliament came to the fore."}, {"viet": "Rượu mạnh không được phép uống ngay tại cửa hàng.", "eng": "Alcohol may not be consumed on the premises."}, {"viet": "Được thôi, con trai, hãy ăn tùy thích.", "eng": "All right, Son, get what you want."}, {"viet": "Qua tất cả những năm lao động cật lực đó mà vẫn chẳng được kết quả gì!", "eng": "All those years of hard work, and nothing to show for it!"}, {"viet": "Các tàu chiến Mỹ đã được gửi đến khu vực.", "eng": "American warships have been dispatched to the area."}, {"viet": "Một vùng đất đá lồi lõm.", "eng": "An area of broken, rocky ground."}, {"viet": "Một cuộc triển lãm y phục của tất cả các thời đại.", "eng": "An exhibition of costumes down the ages."}, {"viet": "Đó là một vấn đề hóc búa đối với những chuyên gia.", "eng": "An issue that is a real conundrum for the experts."}, {"viet": "Một sự liên minh nguy hại giữa các kiến trúc sư và các nhà qui hoạch đô thị.", "eng": "An unholy alliance between architects and planners."}, {"viet": "Bố cho rằng con muốn học nghề.", "eng": "And you want to take shop, I suppose."}, {"viet": "Dầu sao, chúng tôi cũng sẽ không để ông phải chờ lâu đâu.", "eng": "Anyway, we wouldn't let you wait for a long time."}, {"viet": "Ở Úc có nhiều viện dưỡng lão không?", "eng": "Are there many senior citizen homes in Australia?"}, {"viet": "Anh có bảo hiểm về tất cả các rủi ro có thể xảy ra không?", "eng": "Are you insured against all possible risks?"}, {"viet": "Đến Paris lúc 12h30, dự tính khởi hành đi Lyons lúc 14h00.", "eng": "Arrive Paris 12.30, etd for Lyons 14.00."}, {"viet": "Trần truồng như nhộng như ngày nó mới sinh.", "eng": "As naked as the day he was born."}, {"viet": "Aspirin là một loại thuốc dự phòng tốt cho chứng nhức đầu.", "eng": "Aspirin is a good standby for headaches."}, {"viet": "Ở đầu cuốn sách này là bảng mục lục cho biết chi tiết những gì chứa trong cuốn sách.", "eng": "At the front of this book is a table of contents, giving details of what is in the book."}, {"viet": "Những con lửng đã đào hang dưới nền móng của ngôi nhà thờ.", "eng": "Badgers had undermined the foundations of the church."}, {"viet": "Bị phân biệt vì lý do màu da.", "eng": "Be discriminated against on grounds of colour."}, {"viet": "Bởi vì đây là lần phạm tội đầu tiên của hắn, nên hình phạt không quá khắt khe.", "eng": "Because it was his first offence, the punishment wasn't too severe."}, {"viet": "Ngoài ra, vòi hoa sen phun ra không đủ lượng nước.", "eng": "Besides, there is not enough water coming out from the shower-head."}, {"viet": "Những cuốn sách chất bừa bãi trên các giá.", "eng": "Books piled on shelves in a haphazard fashion."}, {"viet": "Ngành hỏa xa Anh sẽ tăng thêm các chuyến tàu trong thời gian nghỉ lễ.", "eng": "British Rail are putting on extra trains during the holiday period."}, {"viet": "Nhưng tôi thấy rằng giá này cao hơn giá các ông đưa ra cách đây vài tháng.", "eng": "But I find that these prices are higher than the ones you quoted a few months ago."}, {"viet": "Nhưng chúng tôi đến trễ hơn dự định.", "eng": "But we are later than expected."}, {"viet": "Trước lúc xe cứu thương tới, một đám người xem đã xúm lại.", "eng": "By the time the ambulance had arrived, a crowd of onlookers had gathered."}, {"viet": "Tôi có thể rút 50 bảng Anh từ tài khoản của tôi được không?", "eng": "Can I draw £ 50 from my account?"}, {"viet": "Chúng ta có thể hy vọng thời tiết đẹp thế này còn kéo dài lâu không?", "eng": "Can we hope for a continuance of this fine weather?"}, {"viet": "Bạn có thể quản lí nhân viên rất giỏi phải không?", "eng": "Can you manage staff very well?"}, {"viet": "Ông có thể ghi nó ra cho tôi không?", "eng": "Can you write that down for me?"}, {"viet": "Chủ tịch Hội đồng Quản Trị của một trường học.", "eng": "Chairman of the board of governors of a school."}, {"viet": "Đồ thủ công mỹ nghệ của Trung Quốc có nhiều loại khác nhau, như quạt gỗ đàn hương, các món hàng tráng men, các tác phẩm chạm khắc, hàng dệt đan, tranh truyền thống Trung Quốc, nghiên mực, bút lông ….", "eng": "Chinese arts and crafts include various kinds, like sandal-wood fans, cloisonné articles, carved works, woven wares, traditional Chinese paintings, ink slabs, ink brushes and so on."}, {"viet": "Cà phê được pha bằng cách để cho nước sôi ngấm qua bột cà phê.", "eng": "Coffee made by percolating boiling water through ground coffee beans."}, {"viet": "Cuộc cạnh tranh của các người mua đấu giá bức họa quí giá này diễn ra sôi nổi.", "eng": "Competition between bidders for this valuable painting has been keen."}, {"viet": "Yếu tố ngữ cảnh có thể giúp ra hiểu được nghĩa.", "eng": "Contextual clues can help one to find the meaning."}, {"viet": "Anh có thể đi xem đứa bé ngủ chưa?", "eng": "Could you go and check if the baby's asleep?"}, {"viet": "Tính sáng tạo bị giảm xuống chỉ còn là thói hình thức rỗng tuếch.", "eng": "Creativity reduced to an empty formalism."}, {"viet": "Lái xe ẩu có thể làm anh mất mạng.", "eng": "Dangerous driving could cost you your life."}, {"viet": "Cứ tin đi: chúng tôi sẽ không bao giờ bỏ cuộc đâu.", "eng": "Depend on it: we won't give up."}, {"viet": "Bọn trộm có lấy đi bất cứ cái gì đáng giá không?", "eng": "Did the burglars take anything of value?"}, {"viet": "Ăn kiêng và tập thể dục là bí quyết giữ sức khỏe tốt.", "eng": "Diet and exercise are the key to good health."}, {"viet": "Tôi có phải trả tiền trước không?", "eng": "Do I have to pay in advance?"}, {"viet": "Bạn có tin vào bùa may mắn không?", "eng": "Do you believe in good luck charms?"}, {"viet": "Cô có bàn cho hai người không?", "eng": "Do you have a table for two?"}, {"viet": "Bạn có biết Nhật Bản có trợ cấp cho những người vô gia cư không?", "eng": "Do you know if Japan provides assistance to homeless people?"}, {"viet": "Bạn thích sống ở thành phố lớn hay ở thị trấn nhỏ hơn?", "eng": "Do you prefer living in a big city or a small town?"}, {"viet": "Bạn có nghĩ bạn là một người đáng tin cậy không?", "eng": "Do you think you are a reliable person?"}, {"viet": "Nó có hợp khi ăn với thịt rau rán kiểu Pháp không?", "eng": "Does that come with French fries?"}, {"viet": "Đừng có là một kẻ nhu nhược như thế!", "eng": "Don't be such a wimp!"}, {"viet": "Đừng đi ra ngoài mà không mang áo khoác, bạn sẽ bị cảm chết đó.", "eng": "Don't go out without a coat, you'll catch your death."}, {"viet": "Đừng tin vào bất cứ điều gì hắn làm-hắn chỉ là kẻ nói suông.", "eng": "Don't rely on him to do anything-he's just a talker."}, {"viet": "Đừng phí thì giờ về những chi tiết nhỏ nhặt.", "eng": "Don't waste time on niggling details."}, {"viet": "Gần như mất trí vì quá đau buồn về cái chết của ông ấy.", "eng": "Driven almost insane by grief over his death."}, {"viet": "Hãy giảm tốc độ, có một khúc cua gắt phía trước.", "eng": "Ease down, there's a sharp bend ahead."}, {"viet": "Hãy tận hưởng ngày nay và đừng lo nghĩ gì về ngày mai-đó là triết lý sống của tôi!", "eng": "Enjoy yourself today and don't worry about tomorrow-that's my philosophy!"}, {"viet": "Vào mỗi chủ nhật, mọi người ở cách đây nhiều dặm đều đến nơi này để mua hoặc bán cái gì đó.", "eng": "Every Sunday people come from miles around buy or sell."}, {"viet": "Xin lỗi, tôi muốn gửi tiền đi Mỹ.", "eng": "Excuse me, I'd like to send money to the United States."}, {"viet": "Ống khói nhà máy phun khói lên trời.", "eng": "Factory chimneys belching smoke into the sky."}, {"viet": "Cảm nhận ơn kêu gọi để trở thành linh mục.", "eng": "Feel the call of the priesthood."}, {"viet": "Sa thải viên chức thâm niên mà không hỏi ý kiến chủ thì cũng gần như là bất kính đối với thượng cấp.", "eng": "Firing senior staff without reference to the boss comes pretty close to the lèse-majesté."}, {"viet": "Sương mù làm trở ngại sân bay.", "eng": "Fog that socked in the airport."}, {"viet": "Bao năm trời anh ta sống bị ảnh hưởng nhiều của người mẹ nổi tiếng.", "eng": "For years he lived in the shadow of his famous mother."}, {"viet": "Căn cứ vào những bằng chứng chúng tôi đã được nghe cho đến bây giờ.", "eng": "From the evidence we have heard so far."}, {"viet": "George không bao giờ chịu nhận là mình sai.", "eng": "George would never admit to be wrong."}, {"viet": "Đưa tao xâu chìa khóa, thằng nhóc con quỉ sứ!", "eng": "Give me my keys back, you little rascal!"}, {"viet": "Du hành một chuyến từ Mombasa tới Goa.", "eng": "Go on a voyage from Mombasa to Goa."}, {"viet": "Các đốm và vết mỡ có thể gột đi được bằng thuốc giặt.", "eng": "Grease marks or spots can be removed with liquid detergent."}, {"viet": "Chúng tôi vừa bắt đầu đi thì trời bắt đầu đổ mưa.", "eng": "Hardly had we begun our walk when it began to rain."}, {"viet": "Bạn có theo dõi các trận bóng rổ tranh giải kỳ này không?", "eng": "Have you been following the basketball tournament?"}, {"viet": "Anh có ghi thêm tên tôi vào đội không?", "eng": "Have you got me down for the team?"}, {"viet": "Khi phải phát biểu tôi luôn luôn run sợ.", "eng": "Having to make a speech always gives me the shivers."}, {"viet": "Anh ta luôn luôn dăng dện với những những người đàn bà có chồng.", "eng": "He's always fooling around with other men's wives."}, {"viet": "Nó đã làm tốt đấy chứ, có phải không?''Chứ sao!'.", "eng": "He's done very well, hasn't he?''And how!'."}, {"viet": "Anh ta trước đây chưa làm loại công việc này bao giờ, tôi không biết chắc là làm thế nào mà anh ta phối hợp khớp ( với những người làm công khác ).", "eng": "He's never done this type of work before, I'm not sure how he'll in ( with the other employees )."}, {"viet": "Anh ấy là con người hoà nhã nhất mà anh có thể mong ước được gặp.", "eng": "He's the mildest man you could wish to meet."}, {"viet": "Anh ấy luôn luôn súc miệng bằng nước muối trước khi đi ngủ.", "eng": "He always gargles with salt water before going to bed."}, {"viet": "Anh ta cư xử y như thể không có gì xảy ra.", "eng": "He behaved as if nothing had happened."}, {"viet": "Ông ấy chỉ vừa đủ nuôi ăn mặc cho gia đình ông ta.", "eng": "He can barely feed and clothe his family."}, {"viet": "Anh ta ước tính các khoản thua lỗ của mình ở mức 5.000 bảng Anh.", "eng": "He computed his losses at £ 5,000."}, {"viet": "Anh ấy đòi phải được biết về mọi chuyện.", "eng": "He demands to be told everything."}, {"viet": "Hiện nay anh ta không có một cô bồ chăn gối nào chính thức cả.", "eng": "He doesn't have a regular sexual partner at the moment."}, {"viet": "Anh ta thanh minh rằng chuyến xe lửa của anh ta đã bị chậm.", "eng": "He explained that his train had been delayed."}, {"viet": "Anh ta hết sờ đến việc này lại mó đến việc khác.", "eng": "He flits from one thing to another."}, {"viet": "Anh ta trở nên sôi nổi khi anh ta tranh luận.", "eng": "He gets so wound up when he's arguing."}, {"viet": "Anh ta rất lo lắng, nhưng tôi đã làm được cho anh ta an tâm.", "eng": "He had been quite anxious, but I managed to settle his mind."}, {"viet": "Ông ta có nhiều ảnh hưởng với ông tổng giám đốc.", "eng": "He has a lot of pull with the managing director."}, {"viet": "Anh ta không có năng khiếu về dạy học.", "eng": "He has little vocation for teaching."}, {"viet": "Ông ta đã nghe tin ấy bằng một nụ cười thản nhiên.", "eng": "He heard the news with a philosophical smile."}, {"viet": "Anh ta có khả năng chạy một dặm trong bốn phút.", "eng": "He is capable of running a mile in four minutes."}, {"viet": "Anh ấy là ngoại lệ chứng minh quy tắc.", "eng": "He is the exception which proves the rule."}, {"viet": "Hắn biết là nguy hiểm khi hắn lộ diện-Đầu hắn đang bị treo giá.", "eng": "He knew it was dangerous to be seen-there was a price on his head."}, {"viet": "Ông ấy sẽ vui mừng khôn xiết khi nhận được tin anh.", "eng": "He'll be overjoyed at your news."}, {"viet": "Anh ta đưa ra một số yêu sách gây tranh cãi về kỷ lục của mình.", "eng": "He made some very disputable claims about his record."}, {"viet": "Anh ta không hề thấy đói và chỉ nhấm nháp chút thức ăn của mình.", "eng": "He never feels hungry and just picks at his food."}, {"viet": "Anh ấy cứ nằng nặc xin bà ta giúp đỡ.", "eng": "He pestered her with requests for help."}, {"viet": "Nó phản kháng rằng không bao giờ nó ở gần nơi diễn ra tội ác.", "eng": "He protested that he had never been near the scene of the crime."}, {"viet": "Anh ta nhận ra là anh ta đã mắc bẫy như một tên ngốc.", "eng": "He realised that he'd fallen for the bait like a fool."}, {"viet": "Ông ấy kết thúc thời kì làm việc ( nghỉ hưu ).", "eng": "He retired at the expiration of him term ( of office )."}, {"viet": "Anh ta là một người sẵn sàng làm công việc nặng nhọc.", "eng": "He's a willing work-horse."}, {"viet": "Gần đây anh ấy đã trải qua một giai đoạn khó khăn.", "eng": "He's gone through a bad patch recently."}, {"viet": "Hắn có tên trong danh sách đội Everton.", "eng": "He's on Everton's book."}, {"viet": "Anh ta nói điều gì đó tôi nghe được.", "eng": "He said so in my hearing."}, {"viet": "Anh ta có vẻ hùng hổ nhưng thực tế anh ta là người tử tế và tết bụng.", "eng": "He seems aggressive but at bottom he is kind and natured."}, {"viet": "Ông ta cho chúng tôi xem cái lốp tốt để so với cái cũ.", "eng": "He showed us a good tire for comparison with the worn one."}, {"viet": "Anh ta làm hỏng bài thơ bằng cách độc nó đều đều.", "eng": "He spoils the poem by reading it in a monotonous voice."}, {"viet": "Nó chạy lao vào cơ quan, tay huơ lên lá thư khiếu nại.", "eng": "He stormed into the office, flourishing a letter of complaint."}, {"viet": "Ông ta đã nói chuyện với chúng tôi một tiếng đồng hồ sau đó rút lui.", "eng": "He talked to us for an hour and then withdrew."}, {"viet": "Anh ta liều lĩnh ngu xuẩn đối với sức khoẻ của mình.", "eng": "He took foolish liberties with his health."}, {"viet": "Nó kèo nài tôi một đôi giầy.", "eng": "He tried to touch me for a pair of shoes."}, {"viet": "Nó đi những bước dài thô kệch.", "eng": "He walked in long ungainly strides."}, {"viet": "Anh ta đã say rượu trước khi anh ta đến.", "eng": "He was already well-oiled before he arrived."}, {"viet": "Nó bị buộc tội là tòng phạm với kẻ giết người.", "eng": "He was charged with being an accessory to murder."}, {"viet": "Số anh ta phải chết trong cảnh nghèo khổ.", "eng": "He was fated to die in poverty."}, {"viet": "Anh ấy bị đấm đo ván trong hiệp ba.", "eng": "He was knocked out in the third round."}, {"viet": "Anh ta đã bị chụp ảnh trong những tình huống bê bối với một gái điếm.", "eng": "He was photographed in compromising situations with a call-girl."}, {"viet": "Hắn đang quằn quại trên sàn trong cơn hấp hối.", "eng": "He was squirming on the floor in agony."}, {"viet": "Anh ấy rất tử tế với tôi khi tôi bị ốm.", "eng": "He was very good to me when I was ill."}, {"viet": "Nó huýt sáo ra hiệu cho bạn mình cứ nấp kín.", "eng": "He whistled to his friend to keep hidden."}, {"viet": "Anh ta lẽ ra phản đối trừ phi anh ta sợ.", "eng": "He would have protested but that he was afraid."}, {"viet": "Chào cô, cô là cô Barrett phải không?", "eng": "Hello, aren't you Miss Barrett?"}, {"viet": "Cách cư xử của cô ta nói lên sự dũng cảm chịu đựng đau khổ.", "eng": "Her behaviours speak of suffering bravely borne."}, {"viet": "Cái chết của bà ta là niềm thương tiếc lớn lao đối với tất cả mọi người.", "eng": "Her death was a great sorrow to everyone."}, {"viet": "Cha cô ta đã giúp vốn cho cô ta kinh doanh.", "eng": "Her father set her up in business."}, {"viet": "Tính hài hước của cô ấy làm mặn mà câu chuyện của mình.", "eng": "Her humour adds salt to her conversation."}, {"viet": "Váy dài của cô lê trên sàn.", "eng": "Her long skirt was trailing on the floor."}, {"viet": "Những bức tranh của cô ta đang được trưng bày tại phòng triển lãm ở Luân Đôn.", "eng": "Her paintings are being shown at a gallery in London."}, {"viet": "Việc bà ta từ chức gây ra dư luận xôn xao.", "eng": "Her resignation caused much public debate."}, {"viet": "Cuộc nói chuyện của bà ta xoay quanh sự phát triển về phần mềm của máy tính.", "eng": "Her talk ran on developments in computer software."}, {"viet": "Đây là một ít đậu phộng, chúng tôi không tính tiền.", "eng": "Here are some peanuts, and they are free."}, {"viet": "Câu chuyện kể của anh ta hoàn toàn không đúng sự thật.", "eng": "His account of the incident was totally fictitious."}, {"viet": "Hành vi của nó thì phải kiên nhẫn ghê gớm mới chịu nổi.", "eng": "His behaviour would try the patience of Job."}, {"viet": "Thái độ của anh ta không tha thứ được.", "eng": "His conduct admits of no excuse."}, {"viet": "Chứng cớ của anh ta là bằng chứng cho lời cung khai của tôi.", "eng": "His evidence bore witness to my testimony."}, {"viet": "Tính cách xấc láo của nó làm cho khó mà có được cuộc nói chuyện đứng đắn với nó.", "eng": "His flippancy makes it difficult to have a decent conversation with him."}, {"viet": "Bệnh tật ông ta làm chúng tôi rất quan tâm.", "eng": "His illness causes us considerable concern."}, {"viet": "Vận may của hắn sắp thay đổi.", "eng": "His luck is on the turn."}, {"viet": "Câu trả lời duy nhất của hắn là một tiếng làu bàu.", "eng": "His only answer was a grunt."}, {"viet": "Đề nghị của anh ta trái với những kế hoạch của chính phủ giảm bớt chi tiêu cho giáo dục.", "eng": "His proposal runs afoul of government plans to curb expenditure on education."}, {"viet": "Giải pháp của ông ta đối với vấn đề này là phản trực giác.", "eng": "His solution to the problem is counter-intuitive."}, {"viet": "Việc học tập của anh ta cho thấy anh ta có tư cách của một thày giáo dạy tiếng Anh.", "eng": "His training qualifies him as a teacher of English."}, {"viet": "Tác phẩm của ông ta bị phê bình vì sự nghèo nàn về trí tưởng tượng.", "eng": "His work was criticized for its poverty of imagination."}, {"viet": "Hút bụi tấm thảm, sàn nhà, phòng lớn, toàn bộ ngôi nhà.", "eng": "Hoover the rug, floor, hall, whole house."}, {"viet": "Bà nhà và các cháu khỏe không?", "eng": "How are your wife and kids?"}, {"viet": "Làm sao mà bạn lại dám nói cho cô ta biết?", "eng": "How did you dare to tell her?"}, {"viet": "Công nhân cảm thấy thế nào về những thay đổi này?", "eng": "How does the shop-floor feel about these changes?"}, {"viet": "Neo tàu đứng yên trong bao lâu?", "eng": "How long will the anchor hold?"}, {"viet": "Bạn cần bao nhiêu gáo kem trên cây bánh đựng kem?", "eng": "How many scoops of ice cream do you want on your cone?"}, {"viet": "Anh ta có bao nhiêu tiền ở ngân hàng?", "eng": "How much money has he got in the bank?"}, {"viet": "Nhưng chúng tôi đã gửi điện chuyển tiền vào tài khoản của ông ở Ngân hàng Úc rồi cơ mà.", "eng": "However, we made a telegraphic transfer to your account at Australia Bank."}, {"viet": "Tôi thích một máy xtêrêô mới, nhưng tôi không có tiền để mua nó.", "eng": "I'd like a new stereo, but I haven't got the wherewithal to buy it."}, {"viet": "Tôi hơi ngờ vực về nỗi thương cảm mà họ thể hiện đối với người nghèo.", "eng": "I'd rather skeptic about their professed sympathy for the poor."}, {"viet": "Tôi sẽ dùng món bò tái và món súp cá khai vị.", "eng": "I'll have a medium steak and a fish soup to start."}, {"viet": "Tôi sẽ lấy lòng cô ta một tí bằng cách mời cô ta dự tiệc.", "eng": "I'll sweeten her by inviting her to the party."}, {"viet": "Tôi e rằng sự ngăn nắp không phải là ưu điểm của anh ta.", "eng": "I'm afraid tidiness is not his strong point."}, {"viet": "Ngày mai việc đầu tiên của tôi là đi mua sắm.", "eng": "I'm going shopping first thing tomorrow."}, {"viet": "Tôi là Green, giám đốc công ty Special Electric.", "eng": "I'm Mr. Green, the president of Special Electric."}, {"viet": "Tôi hoàn toàn phóng khoáng đối với vấn đề này.", "eng": "I'm quite open-minded about this subject."}, {"viet": "Tôi chỉ là khán giả thôi-bóng đá, bóng chày, bóng rổ, đánh gôn. Tôi xem tất cả.", "eng": "I'm strictly a spectator-football, baseball, basketball, golf. I watch them all."}, {"viet": "Tôi rất vui vì được dạy các em môn tiếng Anh.", "eng": "I'm very glad to be able to teach you English."}, {"viet": "Tôi đã ngồi lên chân tôi nên bây giờ chân bị tê.", "eng": "I've been sitting on my leg and now it's asleep."}, {"viet": "Tôi đã lục soát kĩ nhưng không thấy nó đâu cả.", "eng": "I've had a good look for it but I can't find it anywhere."}, {"viet": "Tôi chỉ nhận được từng phần báo cáo về những gì đã xảy ra.", "eng": "I've only had a piecemeal account of what happened."}, {"viet": "Tôi đồng ý, nhưng loại bài gì?", "eng": "I agree, but what kind of stories?"}, {"viet": "Tôi sẽ bắt đầu ôn tập cho kỳ thi lúc ba giờ đúng.", "eng": "I am going to start review for the exam at three o'clock sharp."}, {"viet": "Tôi đã thu xếp với cô ấy là ai đến trước sẽ mua vé.", "eng": "I arranged with her that whoever arrived first should buy the tickets."}, {"viet": "Tôi đánh cuộc ba pao vào một con ngựa với tỉ lệ một ăn hai mươi và được sáu mươi pao!", "eng": "I bet three pounds on a horse running at twenty to one and won sixty pounds!"}, {"viet": "Tôi không làm được câu hỏi thứ tư và thứ năm nhưng tôi làm được hết những câu hỏi khác.", "eng": "I can't do the fourth and fifth question but I've done an the others."}, {"viet": "Tôi không thể làm bẩn tay bằng cách nhận của hối lộ.", "eng": "I can't spot my hand by accepting a bribe."}, {"viet": "Tôi cũng biết sử dụng máy vi tính cá nhân.", "eng": "I can operate a personal computer, too."}, {"viet": "Tôi không tưởng tượng được là cô ấy đổi ý.", "eng": "I can't see her changing her mind."}, {"viet": "Tôi có thể chạy rất nhanh khi tôi là nữ sinh.", "eng": "I could run very fast when I was a schoolgirl."}, {"viet": "Tôi muốn nhuộm mái tóc bạc của tôi.", "eng": "I'd like to dye my gray hair."}, {"viet": "Tôi đã không đề cập vấn đề đó bởi vì tôi sợ tôi làm anh ta đau buồn.", "eng": "I didn't mention it because I was afraid that I might upset him."}, {"viet": "Tôi không cảm thấy chuyến đi thăm của chúng ta thực sự đạt được điều gì.", "eng": "I don't feel our visit really accomplished anything."}, {"viet": "Tôi không thích ý tưởng đó chút nào cả.", "eng": "I don't like that idea one little bit."}, {"viet": "Em không hiểu tại sao phụ nữ lại tự hạ phẩm giá mình theo cách đó.", "eng": "I don't understand why women degrade themself in that way."}, {"viet": "Tôi không biết cách điều khiển nó.", "eng": "I don't know how to operate it."}, {"viet": "Tôi vui thích với buổi nghỉ sau một ngày trượt băng hơn chính việc trượt băng.", "eng": "I enjoyed the après-ski more than the skiing itself."}, {"viet": "Tôi cảm thấy một cái chạm nhẹ vào cánh tay mình.", "eng": "I felt a touch on my arm."}, {"viet": "Tôi thấy mình đã làm một việc vô ích, cái ông người ta bảo tôi đến tiếp xúc hiện không có ở trong nước.", "eng": "I found I'd been sent on a fool's errand, the man I'd been told to contact was out of country."}, {"viet": "Tôi đi làm về và ngủ gục trên sofa.", "eng": "I got home from work and I just conked out on the sofa."}, {"viet": "Tôi có cảm giác khó chịu ai đó đang nhìn tôi.", "eng": "I had an uneasy feeling that someone was watching me."}, {"viet": "Em ghét đến quán ăn lúc chật ních người.", "eng": "I hate going to diners when they are packed."}, {"viet": "Tôi đã có đủ điều tai tiếng trong đời mình rồi.", "eng": "I have had enough obloquy for one life time."}, {"viet": "Tôi có vài thứ đồ muốn mua ở thành phố.", "eng": "I have some purchases to make in town."}, {"viet": "Tôi chưa đọc cuốn sách này, cả em trai tôi cũng thế.", "eng": "I haven't read this book and my brother hasn't either."}, {"viet": "Tôi nghe nói trời sẽ quang đãng và có nắng.", "eng": "I heard that it will be clear and sunny."}, {"viet": "Tôi mong ông thấy vui khi ở Trung Quốc.", "eng": "I hope you can enjoy your stay in China."}, {"viet": "Tôi hiểu qua nụ cười của cô ta là cô ta đã đoán được tôi đang nghĩ gì.", "eng": "I knew by her smile that she had guessed what I was thinking."}, {"viet": "Tôi đã cho John mượn cái đĩa hát đó, nhưng chẳng bao giờ lấy lại được.", "eng": "I lend that record to John but never got it back."}, {"viet": "Tôi sẽ kêu hầu bàn đưa hóa đơn tính tiền.", "eng": "I'll ask the waiter for the check."}, {"viet": "Tôi muốn dùng món rau trộn dầu giấm có cua loại đặc biệt.", "eng": "I'll have the crab salad special."}, {"viet": "Tôi nới lỏng ca vát nhưng không cởi ra.", "eng": "I loosened my tie but I didn't take it off."}, {"viet": "Tôi vui mừng là ông ta đã bình thường trở lại.", "eng": "I'm glad he's his old self again."}, {"viet": "Tôi không chắc là ngày mai tôi có đi được không.", "eng": "I'm not sure I can be going tomorrow."}, {"viet": "Tôi rất nhẹ nhõm khi nghe điều đó.", "eng": "I'm very relieved to hear it."}, {"viet": "Tôi phải xin lỗi vì đã bất lịch sự đến muộn.", "eng": "I must apologize my discourtesy in arriving late."}, {"viet": "Tôi cần kinh nghiệm để tìm được việc làm nhưng không có việc làm tôi không thể có được kinh nghiệm.", "eng": "I need experience to get a job but without a job I can't get experience."}, {"viet": "Tôi thường đi câu cá vào các dịp cuối tuần.", "eng": "I often go fishing at weekends."}, {"viet": "Tôi thích ngồi ở đằng trước khi đi ô tô.", "eng": "I prefer to travel in the front of the car."}, {"viet": "Tôi thật sự thích giọng Anh.", "eng": "I really love your British accent."}, {"viet": "Tôi không bằng lòng về những sự xâm phạm vào thời gian rỗi của tôi.", "eng": "I resent these incursions into my leisure time."}, {"viet": "Tôi thấy cô ta gia nhập nhóm du lịch bằng phản lực!", "eng": "I see she's joining the jet set!"}, {"viet": "Giá như em không đi tới đó một mình thì anh thích hơn.", "eng": "I should prefer that if you did not go there alone."}, {"viet": "Tôi dán hai mảnh giấy vào làm một.", "eng": "I stuck the two pieces of paper together."}, {"viet": "Tôi cho rằng cô ấy đau đầu là do căng thẳng.", "eng": "I think her headaches are caused by stress."}, {"viet": "Tôi nghĩ là khúc côn cầu trên băng là một môn thể thao rất bạo lực và nguy hiểm.", "eng": "I think that ice hockey is a very violent and dangerous sport."}, {"viet": "Tôi nghĩ rằng ngày 13 tháng Năm sẽ là ngày bầu cử.", "eng": "I thought that 13 May would be the date of the election."}, {"viet": "Tôi cố can cô ta đừng đến.", "eng": "I tried to talk her out of coming."}, {"viet": "Tôi chưa bao giờ dự lễ hội powwow.", "eng": "I've never been to a powwow."}, {"viet": "Tôi muốn nhờ giặt cái áo vét của tôi.", "eng": "I want to have my jacket cleaned."}, {"viet": "Tôi bực vì lỡ chuyến xe buýt và đi làm muộn.", "eng": "I was annoyed because I missed the bus and was late for work."}, {"viet": "Tôi ở trong một cảnh ngộ đáng sợ-tôi đã mất hết tiền và lỡ chuyến tàu cuối cùng về nhà.", "eng": "I was in a dreadful plight-I had lost my money and missed the last train home."}, {"viet": "Tôi bị kẹp chặt vào giữa hai hành khách khác đến nỗi không ra được khỏi xe buýt.", "eng": "I was so tightly wedged between two other passengers, I couldn't get off the bus."}, {"viet": "Tôi kinh hoàng nhìn hai chiếc ô tô đâm vào nhau.", "eng": "I watched in horror as the car crashed into each other."}, {"viet": "Tôi mong Mary đừng luôn chen ngang vào cuộc nói chuyện của chúng tôi.", "eng": "I wish Mary would stop cutting in on our conversation all the time."}, {"viet": "Tôi không biết là ông có quan tâm đến một số mặt hàng áo len của công ty chúng tôi hay không.", "eng": "I wonder if you might be interested in some of our company's sweaters."}, {"viet": "Tôi muốn gọi điện sang Nhật.", "eng": "I would like to call Japan."}, {"viet": "Nếu tôi là bạn tôi sẽ không ăn ở nhà hàng đó.", "eng": "I wouldn't go to that restaurant if I were you."}, {"viet": "Nếu mọi việc không theo một trật tự nhất định ông ấy sẽ nổi giận.", "eng": "If everything isn't just so, he gets angry."}, {"viet": "Nếu đến lúc phải quyết định, liệu anh có hy sinh việc làm của anh để giữ các nguyên tắc của mình không?", "eng": "If it came to the point, would you sacrifice your job for your principles?"}, {"viet": "Nếu không có đường chúng ta sẽ phải đành xoay xở theo kiểu không đường.", "eng": "If there's no sugar we'll have to manage without."}, {"viet": "Nếu anh có điều gì phàn nàn, anh nên nói cho tôi biết.", "eng": "If you've got any grouses, you'd better tell me about them."}, {"viet": "Nếu anh không tự trọng, thì sao có thể trông chờ người khác tôn trọng anh?", "eng": "If you don't respect yourself, how can you expect others to respect you?"}, {"viet": "Nếu anh kéo quá mạnh anh sẽ làm đứt sợi thừng.", "eng": "If you pull too hard you will break the rope."}, {"viet": "Xin mời quý phu nhân bước theo lối này.", "eng": "If your ladyship will step this way, please."}, {"viet": "Trong bất kỳ tình huống nào, điều tệ nhất mà cô ta có thể làm là nói không.", "eng": "In any event, the worst that she can do is say no."}, {"viet": "Trong khi vội vã đi, anh ta đã bỏ quên hộ chiếu.", "eng": "In his hurry to leave, he forgot his passport."}, {"viet": "Về diện tích, trung quốc lớn bằng cả châu âu.", "eng": "In size, China is as big as all Europe."}, {"viet": "Vì vệ sinh, xin đừng hút thuốc lá trong cửa hàng này.", "eng": "In the interest of hygiene, please do not smoke in this shop."}, {"viet": "Ở thời kỳ tiền sử, không có sách vì con người chưa biết viết như thế nào.", "eng": "In very early times there were no books, because people did not know how to write."}, {"viet": "Các điều tra viên đang tìm kiếm các mảnh vụn của chiếc máy bay rơi để cố gắng tìm hiểu nguyên nhân của sự kiện bi thảm đó.", "eng": "Investigators are searching the wreckage of the plane to try and find the cause of the tragedy."}, {"viet": "Cô ta thật tâm muốn đi học làm phi công đấy à?", "eng": "Is she serious about learning to be a pilot?"}, {"viet": "Phải chăng sau cái chết chỉ là hư không?", "eng": "Is there only nothingness after death?"}, {"viet": "Cho rằng giàu có sẽ đem lại hạnh phúc là ảo tưởng.", "eng": "It's a fallacy to suppose that wealth brings happiness."}, {"viet": "Nói thầm trước mặt những người khác là không lịch sự.", "eng": "It's bad manners to whisper in company."}, {"viet": "Lại sắp được nhận tiền lương tháng thật là tốt.", "eng": "It's good to be drawing a monthly salary again."}, {"viet": "Cảm thấy gió trên mặt.", "eng": "It's nice to feel the wind on your face."}, {"viet": "Có thể không đến nỗi tồi tệ như cô ấy nói-cô ấy có ý định cường điệu nó lên.", "eng": "It's probably not as bad as she says-she does tend to pile it on."}, {"viet": "Đáng tiếc là anh đã không đến dự tiệc được.", "eng": "It's too bad you can't come to the party."}, {"viet": "Thật tiện lợi khi có một nhà hàng tự phục vụ trong tòa nhà.", "eng": "It comes in handy to have a cafeteria in the building."}, {"viet": "Đây là một vấn đề tế nhị nên chúng ta phải ăn nói cẩn thận.", "eng": "It is a sensitive issue so we must tread carefully."}, {"viet": "Tôi thật vinh dự được nói lời chúc mừng ông Hà nhân dịp ông ấy được thăng chức.", "eng": "It is my great privilege to say a word of congratulation to Mr. Ho on the occasion of his promotion."}, {"viet": "Không được vậy nếu ông đi bộ lên ngọn đồi đó.", "eng": "It isn't if you walk over the hill."}, {"viet": "Đó là trận bóng đá, Kenji à.", "eng": "It's a football game, Kenji."}, {"viet": "Nó chắc chắn lôi cuốn mấy con ong bò vẽ đó.", "eng": "It's sure to invite the wasps."}, {"viet": "Tuy vậy, chắc chắn nó có vị giống như cam mới vắt.", "eng": "It sure does taste like it, though."}, {"viet": "Phim nói về một cô gái có nhiều bạn trai, hết người này có ngay người khác.", "eng": "It was about a girl who had lots of boyfriends one right after another."}, {"viet": "Mẹ tôi mong tôi sẽ đi.", "eng": "It was my mother's wish that I should go."}, {"viet": "Thật buồn khi người mẹ trong câu chuyện chết.", "eng": "It was very sad when the mother died in the story."}, {"viet": "Phải một người khoẻ mới nâng được trọng lượng này.", "eng": "It would take a strong man to lift that weight."}, {"viet": "Bữa tiệc của John thật sự cuồng nhiệt-mọi người đều đê mê ( vì ma tuý ).", "eng": "John's party was really wild-everyone freaked out ( on drugs )."}, {"viet": "Suýt trượt đích, suýt trượt một cuộc sát hạch, suýt lên tới đỉnh.", "eng": "Just miss a target, fail a test, reach the top."}, {"viet": "Cuối cùng tôi xin cảm ơn tất cả mọi người đã cùng làm việc để cho mái trường mới này được thành công như hôm nay.", "eng": "Lastly, I would like to thanks everyone who has worked to make the new school such a success."}, {"viet": "Cho anh xem bóng đá đi rồi anh sẽ rửa bát đĩa cho em.", "eng": "Let me watch the game and I'll wash the dishes."}, {"viet": "Loving trong a loving mother và polished trong polished wood là những động tính từ.", "eng": "Loving in a loving mother and polished in polished wood are participial adjectives."}, {"viet": "Nhiều người nói rằng hệ thống bầu cử ở nước này nên thay đổi.", "eng": "Many people say the electoral system in this country should be changed."}, {"viet": "Những kẻ đeo mặt nạ đã chặn đường cướp chiếc xe chở tiền ở Nam London ngày hôm qua.", "eng": "Masked men held up a security van in South London yesterday."}, {"viet": "Ông cảm phiền đưa tôi cây viết bi đó được không?", "eng": "May I trouble you to pass the ball pen?"}, {"viet": "Hầu hết nhạc cổ điển làm tôi buồn ngủ.", "eng": "Most classical music sends me to sleep."}, {"viet": "Ông Smith đóng vai trò luật sư cho bên nguyên.", "eng": "Mr. Smith acted as counsel for the prosecution."}, {"viet": "Anh tôi lớn tuổi và thông minh hơn tôi nhiều cho nên tôi luôn luôn kính sợ anh ấy.", "eng": "My brother was much older and cleverer than me so I always held him in awe."}, {"viet": "Chuyến bay của tôi đến 8 giờ tối mới khởi hành.", "eng": "My flight doesn't leave until 8 p. m."}, {"viet": "Hàng xóm nhà tôi đã đổ lá khô qua tường vào vườn nhà tôi.", "eng": "My neighbour has been tipping dead leaves over the wall into my garden."}, {"viet": "Lời cảnh cáo của tôi rõ ràng là đã không thấm vào cái đầu óc đần độn của anh.", "eng": "My warning obviously hasn't sunk into your thick skull."}, {"viet": "Những phương pháp mới để khai thác tài năng của thanh niên.", "eng": "New ways of tapping the skills of young people."}, {"viet": "Không, không phải thế cho đến giữa thế kỷ thứ 19 khi những ngân hàng trung ương với những chức năng quy định cụ thể được tạo ra.", "eng": "No, it wasn't until the middle of the 19th century that central banks with specific regulatory functions were created."}, {"viet": "Chẳng ai dám ngước mắt nhìn lên.", "eng": "Nobody dared lift their eyes from the ground."}, {"viet": "Bây giờ cả bố và mẹ đều sống một mình và cô đơn lúc tuổi già.", "eng": "Now you'll both be alone and lonely in your old age."}, {"viet": "Ồ, ở đó là 2 giờ 30 sáng hả?", "eng": "Oh, is it 2: 30 in the morning there?"}, {"viet": "Vào một ngày mùa hè nóng bức uống một hơi cốc nước mát thì giống như uống nước tiên.", "eng": "On a hot summer day a long cool drink is like nectar."}, {"viet": "Một ngày nào đó hai chúng ta sẽ có cơ hội thăm New York.", "eng": "One day we'll both get to see New York."}, {"viet": "Chỉ khi nào đèn đỏ bật mới có sự nguy hiểm đối với các nhân viên.", "eng": "Only if the red light comes on is there any danger to employees."}, {"viet": "Chiếc xe chạy bằng điện của chúng tôi là một phát triển mới rất thú vị.", "eng": "Our electrically-powered car is an exciting new development."}, {"viet": "Ông giám đốc mới của chúng ta là người rất dễ hoà hợp.", "eng": "Our new manager is very easy to get on with."}, {"viet": "Quan điểm của chúng ta khác nhau nhiều đến mức không thể đồng ý được với nhau.", "eng": "Our views diverged so greatly that it was impossible to agree."}, {"viet": "Tiểu tiện là một uyển ngữ của đi đái.", "eng": "Pass water is a euphemism of urinate."}, {"viet": "Người ta dùng giòi làm mồi khi đi câu.", "eng": "People use maggots as bait when they go fishing."}, {"viet": "Làm ơn chỉ cho tôi cách sử dụng điện thoại này.", "eng": "Please show me how to use this telephone."}, {"viet": "Radio là cách gửi điện tín quan trọng nhất của chúng tôi.", "eng": "Radio is the most important way we send messages."}, {"viet": "Tôi đã làm cháy sém chiếc sơ mi của tôi khi tôi là nó.", "eng": "Scorched my shirt when I was ironing it."}, {"viet": "Trước hết chúng ta hãy tham quan khuôn viên trường đại học nhé?", "eng": "Shall we tour the campus first?"}, {"viet": "Cô ấy luôn luôn loanh quanh nơi đó quấy rầy mọi người.", "eng": "She's always hovering around the place annoying people."}, {"viet": "Người ta thường xem bà ta là một kẻ hay làm phiền.", "eng": "She's generally regarded as a nuisance."}, {"viet": "Cô ta không có nhiều dịp nói tiếng Pháp.", "eng": "She's not had much occasion to speak French."}, {"viet": "Lúc này cô ta ốm nặng không thể tiếp bất kỳ ai.", "eng": "She's too ill to see anyone at present."}, {"viet": "Hai chị em cô ta chẳng bao giờ hoà thuận với nhau.", "eng": "She and her sister have never really got on."}, {"viet": "Cô ta xuất hiện trong vai Anne Boleyn ở bộ phim Một người đàn ông của mọi mùa.", "eng": "She cameoed as Anne Boleyn in a Man for All Seasons."}, {"viet": "Cô ta không thể che giấu được niềm vui sướng của mình trước sự lúng túng của bọn họ.", "eng": "She couldn't disguise her glee at their discomfiture."}, {"viet": "Bà ta chết trước khi hoàn thành cuốn sách, than ôi.", "eng": "She died before she completed the book, alas."}, {"viet": "Cô ta say mê ngắm cảnh đẹp của thung lũng.", "eng": "She feasted her eyes on the beauty of the valley."}, {"viet": "Đêm qua, cô ấy đã sinh ra ( một đứa trẻ khoẻ mạnh ).", "eng": "She gave birth ( to a healthy baby ) last night."}, {"viet": "Sáng nay cô ta có một cuộc cãi nhau giận dữ với ông chủ của cô.", "eng": "She had a nasty brush with her boss this morning."}, {"viet": "Bà ấy có nhiều bạn bè ở đây.", "eng": "She has a lot of friends here."}, {"viet": "Cô ấy phải phụ giúp mẹ của cô ấy.", "eng": "She has to help her mother."}, {"viet": "Không còn nghi ngờ gì nữa, chị ấy là nhà hoá học giỏi nhất của công ti.", "eng": "She is beyond all without dispute the best chemist in the firm."}, {"viet": "Cô ấy không phải là người diễn thuyết có kinh nghiệm trước công chúng, nhưng cô ấy đứng trước cử toạ cứ tự nhiên như ở nhà vậy.", "eng": "She isn't a practised public speaker, but she faced her audience as to the manner born."}, {"viet": "Bà ấy sống đơn độc trong ngôi nhà suốt cả mùa đông.", "eng": "She lived alone in the house for a whole winter."}, {"viet": "Cô ta cúi gập xuống nghe đứa bé nói.", "eng": "She make a low stoop to listen to the child."}, {"viet": "Cô ta đã mở mang ra nhiều trong khi ở với chúng tôi.", "eng": "She opened out a lot while she was staying with us."}, {"viet": "Cô ấy phản đối mạnh mẽ khi bị gọi là kẻ đua đòi.", "eng": "She protested strongly at being called a snob."}, {"viet": "Cô ta đi trên pa tanh có phần không được vững lắm.", "eng": "She roller-skated across rather unsteadily."}, {"viet": "Hôm nay cô ta đang ở trong tâm trạng vui vẻ.", "eng": "She's in a good mood today."}, {"viet": "Cô ta nói cô ta lấy làm tiếc, nhưng ánh mắt của cô ta lại để lộ niềm vui sướng thầm kín.", "eng": "She said she was sorry, but her eyes betrayed secret delight."}, {"viet": "Cô ta ăn ở không chính thức với người bạn trai.", "eng": "She shared the apartment with her live-in boyfriend."}, {"viet": "Tối nào cô ấy cũng ngồi chiếu bạc.", "eng": "She spends every evening at the game tables."}, {"viet": "Cô ta cứ nén cơn giận và tiếp tục công việc.", "eng": "She swallowed her anger and carried on."}, {"viet": "Cô ta thay đổi hoàn toàn căn phòng bằng cách sơn lại nó.", "eng": "She transformed the room by painting it."}, {"viet": "Cô ấy làm một cái gì đó hơn là một thư ký tầm thường.", "eng": "She wanted to be more than just a two-bit secretary."}, {"viet": "Cô ấy vắng ba tuần nhưng bây giờ đã trở lại làm việc.", "eng": "She was away for three weeks but she's back at work now."}, {"viet": "Cô ấy hết sức xấu hổ vì hành vi tệ hại của mình.", "eng": "She was full of shame at her bad behaviour."}, {"viet": "Cô ta rất lo về chi phí.", "eng": "She was not a little worried about the expense."}, {"viet": "Cô ấy khóc nức nở, nước mắt chảy xuống hai má.", "eng": "She was sobbing, with tears running down her cheeks."}, {"viet": "Cô ta phải vác các gói hàng nặng.", "eng": "She was weighted down with parcels."}, {"viet": "Bà ấy đã đánh điện cho chúng tôi biết là bà có thể bị trễ.", "eng": "She wired that she would be delayed."}, {"viet": "Cô ta không nói dối-cô ta không phải loại đó.", "eng": "She wouldn't lie-she's above that."}, {"viet": "Tỏ ra rất có tài chơi bi-a.", "eng": "Show great skill at playing billiards."}, {"viet": "Do hai đảng chính chiếm một số ghế ngang nhau, đảng thiểu số nắm được cán cân lực lượng.", "eng": "Since the two main parties each won the same number of seats, the minority party holds the balance of power."}, {"viet": "Khoác vội một chiếc khăn quàng lên vai mình.", "eng": "Slip a shawl round one's shoulders."}, {"viet": "Ủa! Rốt cuộc anh đã làm xong công việc của mình!", "eng": "So! You've finished your work at last!"}, {"viet": "Chất đất và khí hậu thích ứng với sự phát triển của nho.", "eng": "Soil and climate adaptable to the growth of grapes."}, {"viet": "Một số thành viên trong chính phủ đã bắt đầu càu nhàu về thủ tướng.", "eng": "Some members of the government are beginning to mutter about the prime minister."}, {"viet": "Một số máy bơm và tất cả những máy hút bụi hoạt động bằng sự hút.", "eng": "Some pumps and all vacuum cleaners work by suction."}, {"viet": "Có điều gì đó đang làm bận tâm cô ta.", "eng": "Something seems to preoccupying her at the moment."}, {"viet": "Nói mà không có một mảy may sự khiêm tốn giả tạo.", "eng": "Speak without a trace of false modesty."}, {"viet": "Bắt đầu lấy cắp ở cửa hàng vào năm mười lăm tuổi.", "eng": "Started to shoplift as a fifteen-year-old."}, {"viet": "Đừng cười khúc khích nữa, các con, đây là một vấn đề nghiêm túc.", "eng": "Stop giggling, children, this is a serious matter."}, {"viet": "Các sinh viên được vào thư viện trường đại học.", "eng": "Students have access to the University."}, {"viet": "Những nhà thơ như Keats và Shelly đã viết loại thơ lãng mạn.", "eng": "Such poets as Keats and Shelly wrote Romantic poetry."}, {"viet": "Chắc chắn 15 phút là đủ thời gian cho anh uống cà phê.", "eng": "Surely 15 minutes is enough time for you to have a coffee."}, {"viet": "Lấy của người giàu cho người nghèo.", "eng": "Take from the rich and give to the poor."}, {"viet": "Các giáo viên thường khuyến khích sự tham gia của cả lớp.", "eng": "Teachers often encourage class participation."}, {"viet": "Các cuộc tấn công của bọn khủng bố đã làm cho vị trí của chúng tôi rất nguy hiểm.", "eng": "Terrorist attacks made our position very unhealthy."}, {"viet": "Tôi ở phía tay trái của tấm ảnh đấy.", "eng": "That's me on the left of the photograph."}, {"viet": "Nền công nghiệp xe hơi của quốc gia ấy được bảo hộ mậu dịch vững chắc đến nỗi khó tìm những chiếc xe ngoại ở đó.", "eng": "That country's car industry is so strongly protected that foreign car me rarely seen there."}, {"viet": "Bức thư mà tôi tìm kiếm vẫn cứ nằm trong túi tôi suốt thời gian đó.", "eng": "That letter I was searching for was in my pocket all the time."}, {"viet": "Đó là một điều may mắn.", "eng": "That's a bit of luck."}, {"viet": "Thật là một bữa ăn ngon quá chừng!", "eng": "That was a bloody good meal!"}, {"viet": "Tai nạn đó đã làm biến dạng thân hình anh ấy suốt đời.", "eng": "The accident disfigured him for a life."}, {"viet": "Lập trường của chính quyền là không thay đổi mặc dù phản ứng của quần chúng không thuận lợi.", "eng": "The administration's condition on taxes was set in cement despite the unfavorable public response."}, {"viet": "Các trường công ở Hoa Kì trong khoảng vài năm nay đã đi từ chỗ lơ là với máy tính đến chỗ biến nó thành bái vật.", "eng": "The American public schools have in the space of a few years gone from neglecting computers to fetishizing them."}, {"viet": "Con số áng chừng là 40 trong khi con số chính xác là 38.", "eng": "The approximate figure is 40, while the exact number is 38."}, {"viet": "Những vật dụng tìm thấy trên xe giúp cảnh sát tìm ra tung tích người chết.", "eng": "The articles found in the car helped the police identify the body."}, {"viet": "Các nhà chức trách thậm chí cũng chưa thể đánh giá được sự thiệt hại.", "eng": "The authorities couldn't even begin to assess the damage."}, {"viet": "Lan can nhô ra phía trên đường phố.", "eng": "The balcony just out over the street."}, {"viet": "Đền thờ Thánh Peter ở Rome.", "eng": "The Basilica of St Peter's in Rome."}, {"viet": "Cách tốt nhất để học tiếng Anh là phương pháp thính thị.", "eng": "The best way to learn English is the audio-visual."}, {"viet": "Máu thấm ướt qua áo sơ mi và làm ố áo vét của anh ấy.", "eng": "The blood soaked through his shirt and stained his jacket."}, {"viet": "Cuốn sách đó là một cuốn rất hấp dẫn.", "eng": "The book is a page-turner."}, {"viet": "Trái tim cậu bé bồi hồi xúc động.", "eng": "The boy's heart fluttered with excitement."}, {"viet": "Chiếc cầu đã sụp đổ dưới sức nặng của chiếc xe tải.", "eng": "The bridge gave way under the weight of the lorry."}, {"viet": "Xe buýt và xe tải đụng nhau.", "eng": "The bus and the van collided."}, {"viet": "Ở đỉnh hẻm núi rộng từ 4 đến 18 dặm bề ngang, và chiếm diện tích 1.000 dặm vuông.", "eng": "The canyon is from 4 to 18 miles across at the top, and covers an area of 1,000 square miles."}, {"viet": "Ô tô rít lên ở góc đường vì nó quặt quá nhanh.", "eng": "The car screeched round the corner as it turned too fast."}, {"viet": "Kĩ thuật rình đợi để thuận tiện tấn công một đối thủ.", "eng": "The cat-and-mouse technique of handling an opponent."}, {"viet": "Công việc khó khăn là làm cho những hệ thống máy tính khác biệt nhau hoạt động cùng nhau.", "eng": "The challenge is to make disparate computer system work together."}, {"viet": "Cô bé ôm con búp bê vào ngực.", "eng": "The child cuddled her doll to her chest."}, {"viet": "Những đứa trẻ hay cãi nhau để giành đồ chơi.", "eng": "The children are always bickering with each other over their toys."}, {"viet": "Bọn trẻ ngủ trong những cái giường riêng biệt.", "eng": "The children sleep in separate beds."}, {"viet": "Đồng hồ nhà thờ điểm nửa đêm.", "eng": "The church clock chimed at midnight."}, {"viet": "Những người trèo núi leo mỗi lúc một cao hơn.", "eng": "The climbers mounted higher and higher."}, {"viet": "Sự đổ sập của toà nhà, mái nhà, chiếc cầu, v. v.", "eng": "The collapse of the building, roof, bridge, etc."}, {"viet": "Sự lan truyền của bệnh tật Bị điếc và câm làm cho việc giao tiếp rất khó khăn.", "eng": "The communication of disease Being deaf and dumb makes communication very difficult."}, {"viet": "Công ty đó đạt doanh thu trên 150 triệu bảng Anh một năm.", "eng": "The company turns over £ 150 million a year."}, {"viet": "Mối đe doạ nguy hiểm thường xuyên đã buộc tất cả chúng tôi cảnh giác.", "eng": "The constant threat of danger kept us all on our toes."}, {"viet": "Sự thất bại của hội đồng trong hoạt động là một sự nhục nhã.", "eng": "The council's failure to act is a scandal."}, {"viet": "Tòa án đã quyết định bồi thường 5.000 bảng Anh cho người bị thương.", "eng": "The court awarded £ 5,000 in damages to the injured man."}, {"viet": "Thánh giá là biểu trưng cho đạo Thiên chúa.", "eng": "The Cross is the symbol of Christianity."}, {"viet": "Đường cong của bề mặt trái đất.", "eng": "The curvature of the earth's surface."}, {"viet": "Việc kết tội tử hình kẻ sát nhân là dựa vào nguyên tắc mạng đền mạng.", "eng": "The death penalty for murder works on the principle of an eye for an eye."}, {"viet": "Sở đó được coi như là một cơ quan vững mạnh và năng động về những ý kiến mới mẻ.", "eng": "The department is seen as a powerhouse of new ideas."}, {"viet": "Hình dáng lờ mờ của toà nhà lớn trong sương.", "eng": "The dim shape of a large building in the mist."}, {"viet": "Báo cáo của bác sĩ đã xua tan mọi nỗi lo lắng của họ.", "eng": "The doctor's report removed all their anxieties."}, {"viet": "Tài liệu đó cần kiểm tra cẩn thận trước khi chúng ta phán quyết.", "eng": "The document will need a careful going-over before we make a decision."}, {"viet": "Cửa mở tung ra và lũ trẻ ùa vào.", "eng": "The door burst open and the children rushed in."}, {"viet": "Không khí khô làm nhăn miếng da thuộc.", "eng": "The dry air shrivels the leather."}, {"viet": "Các cuộc bầu cử tuy vậy rốt cuộc như gáo nước lạnh tạt vào nhà cầm quyền.", "eng": "The election, however, amounted to a cold shower for the authorities."}, {"viet": "Người Anh đôi khi bị kết án là lãnh đạm.", "eng": "The English are sometimes accused of being unemotional."}, {"viet": "Sự phát triển của bông hoa từ nụ.", "eng": "The evolution of the flower from the bud."}, {"viet": "Mặt ngoài của tòa nhà trông không có gì lôi cuốn.", "eng": "The exterior of the building is very unattractive."}, {"viet": "Người nông dân vãi thóc ra sân cho gà ăn.", "eng": "The farmer scattered the corn in the yard for the hens."}, {"viet": "Cuốn phim về các ca mổ mắt làm cho tôi kinh sợ.", "eng": "The film about eye operations turned my stomach."}, {"viet": "Lửa vẫn còn đang cháy khi chúng tôi về đến nhà.", "eng": "The fire was still in when we got home."}, {"viet": "Vài tháng đầu của cuộc hôn nhân.", "eng": "The first few months of marriage."}, {"viet": "Tinh hoa trong giới trẻ của đất nước.", "eng": "The flower of the nation's youth."}, {"viet": "Vòi phun ở thành La Mã là những công trình kiến trúc đẹp nổi tiếng.", "eng": "The fountains of Rome are famed for their architectural beauty."}, {"viet": "Trận đấu lúc nào cũng căng thẳng.", "eng": "The game is getting tense all the time."}, {"viet": "Sự tạo ra nhiệt do ma sát.", "eng": "The generation of heat by friction."}, {"viet": "Hàng hóa đã được gởi đến cho ông bằng đường xe lửa.", "eng": "The goods have been consigned to you by rail."}, {"viet": "Chính phủ đã tuyên bố tình trạng khẩn cấp.", "eng": "The government has declared a state of emergency."}, {"viet": "Chính phủ không nên lãng phí tiền ủng hộ những tổ chức yếu kém.", "eng": "The government should not waste money supporting lame ducks."}, {"viet": "Phần thưởng lớn nhất trong mọi giải thưởng-hoà bình thế giới-lúc này đang trong tầm tay chúng ta.", "eng": "The greatest prize of all-world peace-is now within our grasp."}, {"viet": "Người khách trọ muốn đặt trước một bàn để ăn tối.", "eng": "The guest would like to book a table for dinner."}, {"viet": "Cuộc tranh luận đã hết sôi nổi.", "eng": "The heat has gone out of the argument."}, {"viet": "Đội nhà còn phải ghi điểm nữa.", "eng": "The home team has yet to score."}, {"viet": "Khách sạn đầy cảnh sát.", "eng": "The hotel was bristling with policemen."}, {"viet": "Những ngôi nhà phía sau nhà thờ.", "eng": "The houses back of the church."}, {"viet": "Sự quan trọng của vấn đề làm cho trẻ con giỏi toán.", "eng": "The importance of making children numerate."}, {"viet": "Động lực bên trong của phong trào xã hội.", "eng": "The inner dynamic of social movement."}, {"viet": "Có hòn đảo dần dần được những người từ châu Âu đến định cư.", "eng": "The islands were gradually populated by settlers from Europe."}, {"viet": "Thẩm phán xử chị ta 12 tháng tù giam.", "eng": "The judge sentenced her to 12 month's imprisonment."}, {"viet": "Cái nhãn sẽ tróc ra nếu anh đem ngâm nó vào nước.", "eng": "The label will peel off if you soak it in water."}, {"viet": "Nhạc pop mới nhất du nhập từ Mỹ.", "eng": "The latest pop music imported from America."}, {"viet": "Pháp luật có hiệu lực trở về trước.", "eng": "The legislation was made retrospective."}, {"viet": "Các đường AB và CD cắt nhau ở điểm E.", "eng": "The lines AB and CD intersect at E."}, {"viet": "Việc mất người bạn trai thân nhất của chị ấy đã lấy đi niềm vui trong cuộc sống của chị.", "eng": "The loss of her closest friend which took the sunshine out of her life."}, {"viet": "Những tuyến đường hàng hải chủ yếu băng qua Đại Tây Dương.", "eng": "The main shipping routes across the Atlantic."}, {"viet": "Thị trường quyết định phải sản xuất mặt hàng nào.", "eng": "The market determines what goods are made."}, {"viet": "Giới y khoa chia rẽ về vấn đề này.", "eng": "The medical world is divided on this issue."}, {"viet": "Chính quyền quân sự giải tán quốc hội của đất nước và ngừng mọi hoạt động chính trị.", "eng": "The military government dissolved the country's parliament and suspended all political activity."}, {"viet": "Chủ tịch cuộc họp viện dẫn một luật khiến cuộc tranh luận phải chấm dứt.", "eng": "The moderator invoked a rule causing the debate to be ended."}, {"viet": "Những chương trình quan trọng nhất nằm trong bộ nhớ ROM chỉ đọc thôi.", "eng": "The most important programs are in the read only memory."}, {"viet": "Âm nhạc giúp nhắc nhở chúng tôi rằng chúng tôi là người Mỹ bản địa.", "eng": "The music helps remind us we are Native Americans."}, {"viet": "Cha chủ mới là một gã bần tiện!", "eng": "The new boss is a mean sod!"}, {"viet": "Nhân viên văn phòng mới đang thích nghi với công việc.", "eng": "The new office staff are shaking down well."}, {"viet": "Tin về vụ ông ta từ chức thật là vui đối với tôi.", "eng": "The news of his resignation was music to my ears."}, {"viet": "Thời gian, địa điểm, phương pháp, tư thế thông thường.", "eng": "The normal time, place, method, position."}, {"viet": "Cái đai ốc chưa chặt mấy, vặn thêm một ít nữa.", "eng": "The nut isn't tight enough yet, give it another screw."}, {"viet": "Động cơ cũ kỹ kêu ken két và rung lên.", "eng": "The old engine ground and shuddered."}, {"viet": "Điều duy nhất để cứu công ti là cải tổ diện lề lối điều hành.", "eng": "The only thing that will save the company is a through shake-up of the way it is run."}, {"viet": "Giá tổng cộng tấm thảm bao gồm thuế kinh doanh và công lắp đặt.", "eng": "The overall cost of the carpet including sales tax and fitting."}, {"viet": "Buổi liên hoan bắt đầu lúc 8 giờ, nhưng anh đừng cất công tới đúng giờ làm chi!", "eng": "The party's at eight, but don't kill yourself to get here on time!"}, {"viet": "Bệnh nhân dường như khởi sắc hơn một ít sáng nay.", "eng": "The patient seems more lively this morning."}, {"viet": "Độc quyền của hiệu trưởng đại học là nhà và ô tô.", "eng": "The perquisites of college president include a home and car."}, {"viet": "Chồng sách lung lay rồi đổ xuống sàn.", "eng": "The pile of books toppled onto the floor."}, {"viet": "Máy bay bay trên những đỉnh núi phủ tuyết.", "eng": "The plane flew over the snow-covered peaks."}, {"viet": "Vở kịch đó không có gì đặc sắc.", "eng": "The play was nothing much to write home about."}, {"viet": "Cảnh sát đã dựng hàng rào chặn lối đi vào quảng trường.", "eng": "The police barricaded off the entrance to the square."}, {"viet": "Cảnh sát đã đuổi bắt tên tội phạm một cách ráo riết Ma tuý đã đẩy anh ta đến cái chết sớm một cách không thương xót.", "eng": "The police pursued the criminal remorselessly Drugs drove him remorselessly to an early death."}, {"viet": "Cuộc thăm dò cho biết là Công đảng đang dẫn đầu.", "eng": "The poll reported Labour to be leading."}, {"viet": "Quyền của cảnh sát được phép ngăn người nào đó ở đường phố.", "eng": "The power of the police to stop someone in the street."}, {"viet": "Vị tổng thống đã rời giường bệnh của mình để đến tham dự buổi lễ.", "eng": "The President left his sickbed to attend the ceremony."}, {"viet": "Những bạn đồng nghiệp trong nội các của Thủ tướng.", "eng": "The Prime Minister's Cabinet colleagues."}, {"viet": "Đám tù nhân bị dồn cả lên tàu hoả.", "eng": "The prisoners were herded on to the train."}, {"viet": "Kế hoạch này sẽ tiến hành như dự định.", "eng": "The project will go forwards as planned."}, {"viet": "Nước quả được pha thêm rượu rum.", "eng": "The punch was spiked with rum."}, {"viet": "Sự thỏa mãn im lặng của đứa bé được cho ăn uống no nê.", "eng": "The quiet content of a well-fed child."}, {"viet": "Các lý do thực sự về việc bà ta từ chức cuối cùng sẽ được tiết lộ thôi.", "eng": "The real reason for her resignation will come out in the wash."}, {"viet": "Những kẻ tin tôn giáo mù quáng đưa anh ta ra xử.", "eng": "The religious bigots who put him on trial."}, {"viet": "Kết quả không quan trọng lắm đối với chúng ta, nhưng nếu chúng ta chiến thắng thì càng tốt.", "eng": "The result is not very important to us, but if we do win, so much the better."}, {"viet": "Những nguy hiểm có thể xảy ra khi thám hiểm.", "eng": "The risks that are incidental to exploration."}, {"viet": "Vách đá ở Gibraltar lỗ rỗ những hang hóc.", "eng": "The Rock of Gibraltar is honeycombed with caves."}, {"viet": "Thường thường lối sống trong giới luật sư bào chữa là gió chiều nào theo chiều nấy.", "eng": "The rule of life in the defense bar ordinarily is to go along and get along."}, {"viet": "Vệ tinh nhân đạo sẽ được phóng lên không trung.", "eng": "The satellite will be thrown into space."}, {"viet": "Số điểm trong trận chung kết quần vợt là 6-4, 3-6, 7-5.", "eng": "The score in the tennis final was 6-4, 3-6, 7-5."}, {"viet": "Câu Chúng tôi chạy như gió là một sự so sánh.", "eng": "The sentence We ran like the wind is a simile."}, {"viet": "Con tàu tiếp nhận hành khách và bốc hàng hóa tại một cảng của Ý.", "eng": "The ship embarked passengers and cargo at an Italian port."}, {"viet": "Cửa hàng dùng quà biếu như cái mồi nhử khách hàng.", "eng": "The shop use free gifts as a bait to attract new customers."}, {"viet": "Người ca sĩ bị vây quanh bởi đám đông tay chân và bợ đỡ thường thấy.", "eng": "The singer was surrounded by the usual crowd of lackeys and hangers-on."}, {"viet": "Đám khói đã làm chuông báo động reo.", "eng": "The smoke triggered off the alarm."}, {"viet": "Lời giải cho một ô chữ.", "eng": "The solution to a crossword puzzle."}, {"viet": "Bài nói có giọng điệu thiếu nghiêm túc không thích hợp với chủ đề.", "eng": "The speech had a lightness of tone which hardly fitted its subject."}, {"viet": "Những con số thống kê được viết trong ngoặc đơn.", "eng": "The statistics were given in parenthesis."}, {"viet": "Dòng suối tạo thành ranh giới giữ đất của anh và của tôi.", "eng": "The stream forms a boundary stone between your land and mines."}, {"viet": "Giá trị đồng đô-la đột ngột giảm làm nhiều chuyên gia tài chính bối rối.", "eng": "The sudden fall in the value of the dollar has puzzled financial experts."}, {"viet": "Hệ thống này nhằm giúp đỡ những người học tiếng Anh.", "eng": "The system tends to favor those who have studied English."}, {"viet": "Thầy giáo coi thi chúng tôi.", "eng": "The teacher supervised our examination."}, {"viet": "Sau cơn giông tố, các lều trông rất bẩn thỉu.", "eng": "The tents looked very bedraggled after the storm."}, {"viet": "Nguy cơ sắp phá sản là điều rất không vui nhưng chắc chắn là nó làm cho đầu óc ta phải tập trung suy nghĩ cẩn thận.", "eng": "The threat of going bankrupt is very unpleasant but it certainly concentrates the mind."}, {"viet": "Các toà tháp của Trung tâm Thương mại thế giới cao 405m, và mỗi toà tháp có 110 tầng.", "eng": "The towers of the World Trade Centre are 405 meters high, and each has 110 floors."}, {"viet": "Người khách du lịch phải giết con voi tấn công mình.", "eng": "The traveller had to slay the charging elephant."}, {"viet": "Hai bánh răng ăn vào khớp với nhau và cỗ máy chuyển động.", "eng": "The two cog-wheels engaged and the machine started."}, {"viet": "Trọng tài tung đồng tiền và nó rơi ngửa.", "eng": "The umpire gave the coin a flip, and it landed heads."}, {"viet": "Thung lũng tận cùng bằng một gờ đá granite thẳng đứng.", "eng": "The valley ended in a perpendicular rim of granite."}, {"viet": "Sức sống của phong trào bị đe doạ.", "eng": "The vitality of the movement is threatened."}, {"viet": "Cung cách anh ta đối xử với con cái làm tôi tức điên lên.", "eng": "The way he treats his children makes my blood boil."}, {"viet": "Cả thị trấn đổ ra đường chào đón đội bóng trở về.", "eng": "The whole town turned out to welcome the team home."}, {"viet": "Người phụ nữ đang được nói đến ngồi ở đằng kia.", "eng": "The woman in question is sitting over there."}, {"viet": "Chiếc ô tô bị phá hỏng được sửa chữa qua loa và đã bán lại rồi.", "eng": "The wrecked car was patched up and resold."}, {"viet": "Việc ra đời của đứa con gái là một dịp tốt lành.", "eng": "Their daughter's birth is a happy occasion."}, {"viet": "Ôtô của chúng nó đang sửa chữa-chiếc xe này là đi thuê.", "eng": "Their own car is being mended-this one is hired."}, {"viet": "Sau đó những người khác đổ xi măng vào khuôn.", "eng": "Then others pour the cement into the forms."}, {"viet": "Có chiếu phim trên kênh 10 lúc 9 giờ tối nay.", "eng": "There's a movie on Channel 10 at nine tonight."}, {"viet": "Không thể có chỗ cho sự tự mãn, chúng ta phải tiếp tục cố gắng cải tiến.", "eng": "There's no room for complacency, we must continue to try to improve."}, {"viet": "Có nhiều huyền thoại về sao.", "eng": "There are a great many star myths."}, {"viet": "Có hoang mạc có nước, nhưng nó quá mặn đối với các loài cây cỏ.", "eng": "There are other deserts that have water, but it is too salty for plants to use."}, {"viet": "Không thể có bất cứ một nghi ngờ gì về điều đó.", "eng": "There can be no doubt whatever about it."}, {"viet": "Có sự xung đột quyền lợi ngày càng tăng giữa vị trí một chính trị gia và những hoạt động kinh doanh của bà ấy.", "eng": "There is a growing conflict of interest between her position as a politician and her business activities."}, {"viet": "Không cần phải căm phẫn với một câu chuyện vặt như thế.", "eng": "There is no need to get up in arms over such a trifle."}, {"viet": "Có chiếu phim hoạt hình trên kênh.", "eng": "There's a cartoon on Channel."}, {"viet": "Có một cuộc toan tính đảo chính trong khi Tổng thống đi vắng đã thất bại.", "eng": "There was an abortive attempt at a coup during the President's absence."}, {"viet": "Có rất nhiều điều hứa hẹn ở quảng trường thành phố hôm nay khi bốn nhà chính trị cố gắng tập hợp sự quan tâm của dân chúng trong cuộc bầu cử sắp tới.", "eng": "There were lots of promises at the town square today when four local baby-kissers tried to rally interest in the upcoming election."}, {"viet": "Những trái bom này hình dạng ngày một trở thành có đầu tròn.", "eng": "These bombs are becoming increasingly aerodynamic in shape."}, {"viet": "Những sự thực mới này, cùng với các chứng cứ khác, chứng minh sự vô tội của tù nhân đó.", "eng": "These new facts, together with the other evidence, prove the prisoner's innocence."}, {"viet": "Chúng là một đội quân nhỏ ô hợp gồm những kẻ kiếm tiền gian lận, lũ ăn cướp, giết người.", "eng": "They're a small ragtag army of racketeers, bandits, and murders."}, {"viet": "Họ đã cộng thêm mười xu vào giá thuốc lá.", "eng": "They've slapped 10p on the price of cigarette."}, {"viet": "Họ đang thúc chúng tôi có quyết định nhanh chóng.", "eng": "They are pressing us to make a quick decision."}, {"viet": "Họ không tìm được một giải pháp tài chính nào cho công ty.", "eng": "They can't find any financial solution to the company."}, {"viet": "Thậm chí chúng bất lịch sự đến mức không buồn xin lỗi.", "eng": "They didn't even have the courtesy to apologize."}, {"viet": "Họ phát hiện ra các tia đó xuất phát từ phía xa bên ngoài Quả Đất.", "eng": "They found that these rays came from far outside the Earth."}, {"viet": "Họ ít tiếp xúc với mọi người.", "eng": "They have little contact with other people."}, {"viet": "Họ đưa mắt nhìn theo tàu hoả khi nó rời khỏi ga.", "eng": "They look after the train as it leaves the station."}, {"viet": "Họ đã trả tiền mặt, do đó tránh được phải trả tiền lãi.", "eng": "They paid cash, thereby avoiding interest charges."}, {"viet": "Chúng cướp của bà ấy mọi thứ mà bà ấy có.", "eng": "They robbed her of everything she possessed."}, {"viet": "Họ tung đồng tiền để quyết định xem ai sẽ phải bắt đầu,.", "eng": "They spun a coin to decide who should start."}, {"viet": "Họ muốn chắc là được một phần trong lợi nhuận.", "eng": "They wanted to make sure they got a slice of profits."}, {"viet": "Chúng được để trên lòng của một quí bà nhằm làm ấm bụng bà ta.", "eng": "They were meant to be held in a lady's lap to help keep her stomach warm."}, {"viet": "Họ đã viết thư ( cho đài BBC ) hỏi xin cuốn sách nhỏ đặc biệt.", "eng": "They wrote off ( to the BBC ) for the special booklet."}, {"viet": "Cầu này được xây dựng xong năm 1883.", "eng": "This bridge was finished in 1883."}, {"viet": "Cuốn từ điển này có nhiều thí dụ về cách dùng các từ.", "eng": "This dictionary has many examples of how words are used."}, {"viet": "Khách sạn này có chỗ ở cho 500 khách.", "eng": "This hotel has accommodation for 500 guests."}, {"viet": "Đây là tiền boa cho anh.", "eng": "This is the fee for you."}, {"viet": "Cái máy này không chạy, hãy tìm một thợ máy đến giải quyết.", "eng": "This machine isn't working, get a mechanic to see to it."}, {"viet": "Đường này chỉ cho người đi bộ, không phải cho ô tô.", "eng": "This path is only for pedestrians and not cars."}, {"viet": "Trường này được một hội từ thiện cưu mang.", "eng": "This school is maintained by a charity."}, {"viet": "Loại vinyl này là thứ tồi để thay thế da.", "eng": "This type of vinyl is a poor substitute for leather."}, {"viet": "Tuy còn trẻ, sự nghiệp chính trị của anh ta đã vươn lên cao.", "eng": "Though he is still a young man his political career is already in the ascendant."}, {"viet": "Tom đã không dự tính là vợ mình trở về sớm như thế.", "eng": "Tom didn't bargain on his wife returning so soon."}, {"viet": "Không đứng dậy được vì các vết thương của nó.", "eng": "Unable to rise because of his injuries."}, {"viet": "Tích cực trong những giai đoạn đầu của chương trình vũ trụ.", "eng": "Was active in the germinal stages of the space program."}, {"viet": "Chúng tôi sẽ bay một chuyến bay ngắn cuối cùng từ Cairo tới Luxor ngày hôm sau.", "eng": "We'll do the final hop from Cairo to Luxor the following day."}, {"viet": "Chúng ta đi dự lễ cưới vào chủ nhật.", "eng": "We're going to a wedding party on Sunday."}, {"viet": "Chúng ta có nhiều chỗ chứa đồ trong căn hộ mới.", "eng": "We're well off for storage space in the new flat."}, {"viet": "Chúng tôi ở đến cuối bữa tiệc.", "eng": "We've stayed till the fag-end of the party."}, {"viet": "Chúng tôi sẽ làm tất cả những cái chúng tôi có thể để xúc tiến cuộc đàm phán.", "eng": "We are doing all we can to forward the progress of the talks."}, {"viet": "Chúng tôi đã dự một buổi duyệt kín bộ sưu tầm thời trang mùa đông.", "eng": "We attended a sneak preview of the winter fashion collection."}, {"viet": "Chúng tôi có thể giảm giá 10% cho ông.", "eng": "We can give you a 10% discount."}, {"viet": "Chúng ta có thể đi bằng tàu hoả hoặc bằng ô tô.", "eng": "We could take the train or alternatively go by car."}, {"viet": "Chúng tôi thu hút được độc giả từ mọi tầng lớp xã hội.", "eng": "We draw our readers from all classes of society."}, {"viet": "Chúng ta đã khóc nhiều, và bây giờ chúng ta thấy đỡ hơn, phải vậy không?", "eng": "We had a good cry, and now we feel better, don't we?"}, {"viet": "Chúng tôi có một phòng trưng bày ở ngay trung tâm khu thương mại.", "eng": "We have a showroom in the centre of downtown area."}, {"viet": "Chúng tôi có cái này màu nâu sậm và màu xanh nước biển.", "eng": "We have this in dark brown and navy blue."}, {"viet": "Chúng tôi trải túi ngủ của mình xuống những khoảng đã được phân.", "eng": "We laid our sleeping bags down in our allotted spaces."}, {"viet": "Giữa chúng ta với nhau thì có thể tranh cãi, nhưng đối với ban giám đốc chúng ta phải tỏ ra là thống nhất.", "eng": "We might argue ourselves, but against the management we must present a united front."}, {"viet": "Chúng ta cần phải gọi điện chúc mừng ( cặp vợ chồng mới ).", "eng": "We must telephone our congratulations ( to the happy couple )."}, {"viet": "Chúng tôi trồng hoa tu-líp dọc theo mép bãi cỏ.", "eng": "We planted tulips along the side of the lawn."}, {"viet": "Chúng tôi phục vụ các món ăn Quảng Đông, Tứ Xuyên, Thượng Hải và Bắc Kinh.", "eng": "We serve Cantonese, Sichuan, shanghai and Beijing cuisine."}, {"viet": "Chúng ta học tiếng Anh từ lúc học ở trường cấp 2 nhưng sao chúng ta không nói được?", "eng": "We study English from junior high school but why is it can't we speak it?"}, {"viet": "Chúng tôi muốn đoàn kết tất cả những con chiên của mọi tôn giáo.", "eng": "We want to unite believers of all religions."}, {"viet": "Chúng tôi khá đau khổ vì đã thua trận đấu đó.", "eng": "We were pretty sick about losing the match."}, {"viet": "Chúng tôi muốn hỏi là liệu ông có thể cho chúng tôi các ca-ta-lô của bất cứ các mẫu đồ tắm mới nào không.", "eng": "We would like to ask whether you could give us the cata-logues of any new models of swim-suit."}, {"viet": "À, tôi rất vui là bạn đã đến.", "eng": "Well, I'm glad you've come."}, {"viet": "Tốt, thầy giáo nói khi tôi làm tính đúng.", "eng": "Well done the teacher said when I did my sums correctly."}, {"viet": "Thật là táo tợn! Cô ta vừa mới chuồn đi với cái rađiô của tôi!", "eng": "What a nerve! She just walked off with my radio!"}, {"viet": "Anh đã có những cuốn sách gì để đọc về đề tài đó rồi?", "eng": "What books have you got to read on the subject?"}, {"viet": "Bạn muốn giỏi về lĩnh vực gì?", "eng": "What do you wish you were good at?"}, {"viet": "Ngành công nghiệp quan trọng nhất ở nước bạn là gì?", "eng": "What is the biggest industry in your country?"}, {"viet": "Lý do chính để anh ở đây là gì?", "eng": "What is your principal reason for staying here?"}, {"viet": "Nghĩa của từ này là gì ạ?", "eng": "What's the meaning of this word?"}, {"viet": "Nào là do thời tiết rồi do cái chân tồi tệ của tôi nên tôi đã không ra khỏi nhà hàng tuần nay rồi.", "eng": "What with the weather and my bad leg, I haven't been out for weeks."}, {"viet": "Khi ăn xúp, người ta phải đưa muỗng ra xa để múc xúp.", "eng": "When having soup, the diner should move the spoon away from him to spoon out the soup."}, {"viet": "Mấy giờ làm thủ tục nhận phòng vậy?", "eng": "When is the check-in time?"}, {"viet": "Khi các qui định về thủ tục của cảnh sát đã được đề ra, vẫn còn nhiều chỗ nhập nhằng.", "eng": "When the rules for police procedure were laid down, a lot of grey areas remained."}, {"viet": "Khi còn nhỏ, bạn có thường chơi ngoài trời không?", "eng": "When you were young, did you often play outside?"}, {"viet": "Trạm xe điện ngầm gần nhất nằm ở đâu?", "eng": "Where is the nearest subway station?"}, {"viet": "Ông thích thể loại giải trí nghệ thuật nào nhất?", "eng": "Which of the artistic entertainment do you like best?"}, {"viet": "Một số diễn viên hài nổi tiếng ở Canada là những ai?", "eng": "Who are some famous comedians from Canada?"}, {"viet": "Toàn bộ các đoạn văn của tác phẩm đã bị ăn cắp.", "eng": "Whole passages of the work are plagiarized."}, {"viet": "Tại sao người ta lại hoãn việc khai trường?", "eng": "Why have they delayed opening the school?"}, {"viet": "Các anh đưa đến hay là tôi phải đến cửa hiệu để lấy hàng?", "eng": "Will you deliver or do I have to come to the shop to collect the goods?"}, {"viet": "Với vài sải tay mạnh anh ấy đã tới chỗ đứa trẻ.", "eng": "With a few strong strokes he reached the child."}, {"viet": "Những người phụ nữ đã chán chờ đợi hoàng tử đẹp trai của họ.", "eng": "Women who are tired of waiting for their handsome prince."}, {"viet": "Cô có muốn lên xe cùng tôi vào thành phố không?'.", "eng": "Would you like a lift into town?'."}, {"viet": "Bạn cảm phiền để nước trái cây lại đây một lát nhé?", "eng": "Would you mind leaving out the juice?"}, {"viet": "Hãy viết câu trả lời của anh vào một tờ giấy mới.", "eng": "Write your answer on a fresh sheet of paper."}, {"viet": "Phải rồi, thật đáng nghĩ như thế.", "eng": "Yes, it's worth thinking about that."}, {"viet": "Anh sẽ lấy làm tiếc khi tôi không chơi với anh nữa.", "eng": "You'll be sorry by the time I've finished with you."}, {"viet": "Cậu đã học nhiều như thế chắc chắn cậu sẽ thi đỗ.", "eng": "You're done so much work that you're bound to pass the exam."}, {"viet": "Anh không có quyền vào đây-đây là tài sản tư nhân.", "eng": "You've no business to be here-this is private property."}, {"viet": "Anh không thể mong đợi học được một ngoại ngữ trong một tuần.", "eng": "You can't expect to learn a foreign language in a week."}, {"viet": "Ông có thể đón một chiếc ngay bên ngoài cửa kia.", "eng": "You can get one right outside that door."}, {"viet": "Bạn có thể học được cách đánh cờ, có thể là trong ba tháng.", "eng": "You could learn to play chess in, let's say, three months."}, {"viet": "Anh đã làm hổ thẹn, ô nhục bản thân và gia đình anh.", "eng": "You have brought shame and disgrace on yourself and your family."}, {"viet": "Ông biết là chúng tôi phải phấn đấu kiếm từng đồng đô la.", "eng": "You know we have to fight for every dollar we make."}, {"viet": "Anh phải làm thủ tục tại sân bay một giờ trước khi máy bay cất cánh.", "eng": "You must check in at the airport an hour before the plane leaves."}, {"viet": "Cần phải có lòng kiên trì để chiến thắng trong hoạt động chính trị và tôi sợ rằng không biết anh ta có vượt qua nổi chặng đường đó không.", "eng": "You need perseverance to win in politics and I doubt if he can go the distance."}, {"viet": "Anh phải gọi điên thoại tiếp, sau khi gửi thư.", "eng": "You should follow up your letter with phone call."}, {"viet": "Khi thấy đau, ông uống một viên nhưng không được uống quá một lần trong vòng bốn tiếng đồng hồ.", "eng": "You take one tablet when you feel a pain, but not more than once within four hours."}, {"viet": "Anh sẽ không còn cơ may nào khác để đi tới đó đâu.", "eng": "You won't get another chance of going there."}, {"viet": "Tóc của bà dường như bị hư do lần uốn quăn lần trước.", "eng": "Your hair seems damaged from your last perm."}, {"viet": "Công việc của anh còn xa mới đạt mức hoàn mĩ.", "eng": "Your work is still a long way of perfection."}]