[{"viet": "Khi tôi trang điểm thì 60 oát sẽ thích hợp hơn.", "eng": "60 watts will be better when I put on my make-up."}, {"viet": "Một món thịt hầm nấu với đỗ tương.", "eng": "A casserole made with soya beans."}, {"viet": "Một sự kết hợp giữa phát quang và đối lưu nhiệt.", "eng": "A combination of radiation and convection."}, {"viet": "Một thủy thủ đoàn nổi loạn chống lại điều kiện sinh hoạt tồi tệ.", "eng": "A crew that mutinies against bad living conditions."}, {"viet": "Một từ khó cần phải được giải nghĩa ngắn gọn.", "eng": "A difficult word that needs to be glossed."}, {"viet": "Một mớ kiến thức lộn xộn vô dụng.", "eng": "A farrago of useless bits of knowledge."}, {"viet": "Một trận bóng đá giữa học sinh tiểu học và trung học.", "eng": "A football match between the juniors and the seniors."}, {"viet": "Một bà chủ khéo léo luôn để ý tới những nhu cầu của khách khứa.", "eng": "A good hostess is always attentive to the needs of her guests."}, {"viet": "Một hội trường chứa được 500 chỗ ngồi.", "eng": "A hall with a seating capacity of 500."}, {"viet": "Một nỗ lực lớn lao về việc điều tra và truy tố.", "eng": "A huge investigative and prosecutorial effort."}, {"viet": "Một suất phim khuya ở rạp chiếu bóng.", "eng": "A late night show at the cinema."}, {"viet": "Một thời gian dài từ lúc khởi đầu cho tới khi có kết quả về việc sản xuất dầu khí vì cần có việc thăm dò mới.", "eng": "A long lead-time in oil production because of the need for new exploration."}, {"viet": "Một bản sao viết tay của một bức thư đánh máy.", "eng": "A manuscript copy of a typed letter."}, {"viet": "Một chiếc môtô đã vượt qua chúng tôi ngay chỗ khúc rẽ.", "eng": "A motor cycle overtook us on the crown of the bend."}, {"viet": "Một khu vực không được hút thuốc ở trong rạp chiếu bóng.", "eng": "A non-smoking section in the cinema."}, {"viet": "Một lá cờ đuôi nheo phất phơ trên cột buồm.", "eng": "A pennant lolling from the mast."}, {"viet": "Một cuộc trưng cầu ý dân được tổ chức để quyết định vận mệnh đất nước.", "eng": "A plebiscite was held to decide the fate of the country."}, {"viet": "Một tình huống phức tạp trong gia đình.", "eng": "A problematic situation in the home."}, {"viet": "Đèn đỏ thường là một tín hiệu báo nguy hiểm.", "eng": "A red light is usually a signal of danger."}, {"viet": "Một câu chuyện trinh thám tầm thường.", "eng": "A run-of-the-mill detective story."}, {"viet": "Một đứa trẻ bảy tuổi là phải biết đọc rồi.", "eng": "A seven-year-old should be able to read."}, {"viet": "Một dòng suối nhỏ chảy qua khu rừng.", "eng": "A small stream running through the woods."}, {"viet": "Một cầu thang dẫn lên đỉnh một tòa nhà.", "eng": "A staircase that mounts to the top of a building."}, {"viet": "Người ủng hộ phe cực hữu.", "eng": "A supporter of the extreme right."}, {"viet": "Một ngôi làng bé tí hẻo lánh ở Cornwall.", "eng": "A tiny out-of-the-way village in Cornwall."}, {"viet": "Một tình trạng gần như chiến tranh tồn tại giữa hai quốc gia.", "eng": "A virtual state of war exists between the two countries."}, {"viet": "Một mô hình động cơ hơi nước có thể hoạt động được.", "eng": "A working model of a steam engine."}, {"viet": "Bên kia đường đối diện bưu điện.", "eng": "Across the street from the post office."}, {"viet": "Sau vài lần thử đoán xem ai đã làm việc đó, tôi đành chịu thua.", "eng": "After a few shots at guessing who did it, I gave up."}, {"viet": "Sau khi sống nhiều năm ở nước ngoài, cô ta đột ngột xuất hiện lại ở Luân Đôn.", "eng": "After living abroad for years, she suddenly surfaced again in London."}, {"viet": "Sau bảng Anh bắt đầu thả nổi những quốc gia khác cũng thả nổi tiền của họ.", "eng": "After the pound started floating other states let their monies float as well."}, {"viet": "Tất cả chứng từ phải phù hợp với những điều khoản và điều kiện của thư tín dụng.", "eng": "All documents must be in accordance with the terms and conditions of the credit."}, {"viet": "Tất cả đồ linh tinh trong ngăn chứa hành lý của xe.", "eng": "All that junk in the boot of the car."}, {"viet": "Các khoản trợ cấp được phát một cách bất đắc dĩ cho những người lớn tuổi.", "eng": "Allowances grudgingly doled out to the elderly."}, {"viet": "Khuếch đại âm thanh, điện thế, tín hiệu.", "eng": "Amplify the sound, electric current, signal."}, {"viet": "Một họa sĩ trội về vẽ các sắc da.", "eng": "An artist who excels at flesh tints."}, {"viet": "Một bản phân tích tỉ mỉ các lợi ích của năng lượng hạt nhân.", "eng": "An exposition of the advantages of nuclear power."}, {"viet": "Một lời hứa giúp đỡ của cộng đồng.", "eng": "An offer of help from the community."}, {"viet": "Một mực nước mưa cao khác thường đối với tháng giêng.", "eng": "An unusually high rainfall for January."}, {"viet": "Ann và Robert có vẻ rất hợp nhau.", "eng": "Ann and Robert seem to be made for each other."}, {"viet": "Những người xin việc phải có kinh nghiệm trong nghề.", "eng": "Applicants for the job must have previous experience."}, {"viet": "Chúng ta có đi đúng đường không?", "eng": "Are we on the right road?"}, {"viet": "Anh trả bằng tiền mặt hay séc?", "eng": "Are you paying in cash or by cheque?"}, {"viet": "Là một người Trung Quốc, tôi thích nhạc Trung Quốc của chúng tôi hơn.", "eng": "As a Chinese, I like our Chinese music better."}, {"viet": "Ngay khi tôi gặp Hương, rõ ràng chúng tôi tâm đầu ý hợp với nhau.", "eng": "As soon as I met Huong, it was obvious we spoke the same language."}, {"viet": "Đo được 6'4 thì cô ta quá cao, không nói ngoa đâu.", "eng": "At 6'4, she's tall, to put it mildly."}, {"viet": "Lên tới đỉnh dốc họ ngừng lại nghỉ một chút.", "eng": "At the top of the rise they paused for a rest."}, {"viet": "Đứa bé la lớn Pằng! Pằng! Mày chết rồi.", "eng": "Bang! bang! you're dead shouted the small boy."}, {"viet": "Có cơ may giành được một chiếc xe ôtô của công ty.", "eng": "Be in the running for a company car."}, {"viet": "Trở nên thông thạo một ngoại ngữ không phải là một công việc dễ dàng.", "eng": "Becoming fluent in a foreign language is no easy task."}, {"viet": "Vượt khỏi tầm hiểu biết của con người.", "eng": "Beyond the compass of the human mind."}, {"viet": "Cả hai đấu thủ đều giỏi như nhau nên cơ hội ai thắng sẽ đồng đều.", "eng": "Both players are equally good so it a toss-up who will win."}, {"viet": "Chồi non nhú ra trên cây vào mùa xuân.", "eng": "Buds appear on the trees in spring."}, {"viet": "Nhưng thỉnh thoảng tôi nhớ về tài nấu ăn của mẹ tôi.", "eng": "But I miss my mother's cooking from time to time."}, {"viet": "Các vị có thể đi đến tiệm cà phê ở đằng kia.", "eng": "But you can go to the coffee shop over there."}, {"viet": "À này, tối nay anh có món ăn tối đặc biệt nào không?", "eng": "By the way, do you have any dinner specials this evening?"}, {"viet": "Tôi có thể đọc bảng thời khóa biểu đó được không?", "eng": "Can I have a read of that timetable?"}, {"viet": "Bạn có tin là lúc này chúng ta đang phải chịu thời tiết như thế nào không?", "eng": "Can you believe the weather we've been having recently?"}, {"viet": "Bạn có thể kiếm cho tôi một vài mẫu không?", "eng": "Can you procure some specimens for me?"}, {"viet": "Bạn không thể chạy nhanh hơn được sao?", "eng": "Can't you run any faster than that?"}, {"viet": "Việc đổi văn phòng làm cho giấy tờ của tôi rối tung cả lên.", "eng": "Changing offices has left my papers in complete disarray."}, {"viet": "Tín đồ Thiên Chúa giáo tuyên xưng đức tin khi họ đọc kinh Tin Kính.", "eng": "Christians profess their faith when they say the Creed."}, {"viet": "Tập trung tư tưởng của mình trước một cuộc phỏng vấn.", "eng": "Collect one's thoughts before an interview."}, {"viet": "Một máy điện toán có rất nhiều cách sử dụng.", "eng": "Computer with a multiplicity of many uses."}, {"viet": "Được cải đạo theo đạo Thiên Chúa giáo bởi một nhà truyền giảng Phúc âm Mỹ nhiệt thành.", "eng": "Converted to Christianity by a fervent American evangelist."}, {"viet": "Bạn có thể xích sát vô một chút không?", "eng": "Could you move a fraction closer?"}, {"viet": "Các nhà bình luận e rằng dự luật đó sẽ mất hiệu lực trước khi trở thành luật.", "eng": "Critics fear the bill will have its teeth drawn before it becomes law."}, {"viet": "Ngày nào cùng vậy, dù thời tiết thế nào cô ta cũng đi bộ 10 dặm.", "eng": "Day in, day out, no matter what the weather is like, she walks ten miles."}, {"viet": "Đã thiết kế căn nhà đó từ đầu đến cuối.", "eng": "Designed the house from the ground up."}, {"viet": "Ông có bao giờ đến tiệm giặt tự động chưa?", "eng": "Did you ever use a Laundromat?"}, {"viet": "Hãy nhúng ngón tay của anh vào để xem nước nóng thế nào chứ.", "eng": "Dip your fingers in to see how hot the water is."}, {"viet": "Ở Xcốt-len nhiều học sinh trung học hút thuốc phải không?", "eng": "Do many high school students smoke in Scotland?"}, {"viet": "Anh gọi cái thứ này là bia sao?", "eng": "Do you call this stuff beer?"}, {"viet": "Bạn có hẹn bác sĩ hay nha sĩ nào theo lịch không?", "eng": "Do you have any dental or doctor appointments on your calendar?"}, {"viet": "Anh có biết chỗ nào tôi tìm được một cái máy hút bụi thảm cũ không?", "eng": "Do you know where I can get hold of a second-hand carpet cleaner?"}, {"viet": "Bà còn nhớ đêm đó khi tôi cầu hôn với bà không?", "eng": "Do you remember that night when I proposed?"}, {"viet": "Bạn có đến nhờ bạn bè cho lời khuyên không?", "eng": "Do you turn to your friends for advice?"}, {"viet": "Xe buýt này có đi tới đường Hungtington không?", "eng": "Does this bus go to Huntington Street?"}, {"viet": "Đừng nói xen vào như thế khi tôi đang nói.", "eng": "Don't butt in like that when I'm speaking."}, {"viet": "Đừng có đùa giỡn với những chuyện quan trọng như thế!", "eng": "Don't jest about such important matters!"}, {"viet": "Đừng có bi lụy quá đáng khi anh nói về thú vật.", "eng": "Don't sentimentalize when you talk about animals."}, {"viet": "Đừng có quấy rầy anh ta với nhiều câu hỏi ngớ ngẩn.", "eng": "Don't worry him with a lot of silly questions."}, {"viet": "Lái xe đâm qua rào cản rầm rầm.", "eng": "Drove slam-bang through the barricade."}, {"viet": "Sự đại diện hữu hiệu quyền lợi của các cử tri.", "eng": "Effective representation of voter's interests."}, {"viet": "Những người nhiệt thành hâm mộ từ khắp nơi trên thế giới kéo về Le Mans để xem cuộc đua xe ô tô diễn ra hàng năm.", "eng": "Enthusiasts from around the world converge on Le Mans for the annual car race."}, {"viet": "Những người khác đều nghĩ điều đó là vui, tất nhiên ngoại trừ Marry.", "eng": "Everyone else thought it was funny, except for Mary, of course."}, {"viet": "Xin lỗi, tôi có thể dùng một tách cà phê ở đâu?", "eng": "Excuse me, where can I get a cup of coffee?"}, {"viet": "Rơi vào sự kiềm chế cái gì.", "eng": "Fall into the clutches of something."}, {"viet": "Ít nhà cửa còn nguyên vẹn sau những cuộc dội bom.", "eng": "Few buildings survived the bombing raids intact."}, {"viet": "Thoạt tiên cô ta chỉ cười mỉm, sau đó cô ta bật cười thành tiếng.", "eng": "First of all she just smiled, then she started to laugh."}, {"viet": "Theo dõi tất cả các ghi chú hướng dẫn tham khảo.", "eng": "Follow up all the cross-references."}, {"viet": "Du lịch ra nước ngoài làm cho ông ta lần đầu tiên nhận thức được sự nghèo khó.", "eng": "Foreign travel opened his eyes to poverty for the first time."}, {"viet": "Cái đồ chết tiệt-nó không chạy.", "eng": "Fuck the bloody thing-It won't work."}, {"viet": "Bị ướt trong cơn mưa to.", "eng": "Get a wetting in the heavy rain."}, {"viet": "Chải răng của mình sạch sẽ.", "eng": "Give one's teeth a good brush."}, {"viet": "Hoàn tất toàn bộ những thủ tục phiền toái của việc điền vào các mẫu khai.", "eng": "Go through the whole rigmarole of filling out forms."}, {"viet": "Cam đoan rằng các món nợ sẽ được trả.", "eng": "Guarantee that the debts will be paid."}, {"viet": "Anh ta đã lấy lại được tài nghệ vốn có của mình chưa?", "eng": "Has he regained his old touch?"}, {"viet": "Bạn đã quyết định nộp đơn vào trường đại học nào chưa?", "eng": "Have you decided which university you're going to apply for?"}, {"viet": "Anh đã mua bảo hiểm hoả hoạn cho nhà mình hay chưa?", "eng": "Have you insured your house against fire?"}, {"viet": "Nó nên giữ kín mồm miệng nếu không...!", "eng": "He'd better keep his mouth shut, or else...!"}, {"viet": "Hắn luôn luôn đối xử tệ những đứa bé trẻ hơn.", "eng": "He's always picking on the smaller children."}, {"viet": "Nhìn chung anh ta được coi là người có giọng nam cao hay nhất ở nước này.", "eng": "He's generally considered to have the finest tenor voice in the country."}, {"viet": "Nó không phải là con đẻ của chúng tôi-chúng tôi nuôi nó khi nó lên ba.", "eng": "He's not our natural son-we adopted him when he was three."}, {"viet": "Khi anh ta cáu kỉnh thì thật không thể chịu nổi.", "eng": "He's unbearable when he's in a bad temper."}, {"viet": "Ông ấy và người đại diện đã đường ai nấy đi.", "eng": "He and his agent have parted company."}, {"viet": "Ông ấy làm chúc thư để lại 1000 bảng Anh cho việc từ thiện.", "eng": "He bequeathed £ 1000 to charity."}, {"viet": "Ông ta vẫn còn hấp dẫn đối với thiếu nữ.", "eng": "He can still pull the girls."}, {"viet": "Ông ấy đã chuyển đổi tiền franc của ông ấy sang đô la.", "eng": "He converted his francs into dollars."}, {"viet": "Ông ấy đáng được vỗ tay khen ngợi vì những thành tựu to lớn của mình.", "eng": "He deserves some applause for his great achievements."}, {"viet": "Anh ta không hát hay lắm.", "eng": "He doesn't sing all that well."}, {"viet": "Ông ta xòe bài trong tay trước khi chơi.", "eng": "He fanned out the cards in his hand before playing."}, {"viet": "Anh ta đã tìm mãi mới thấy cái đó.", "eng": "He found it after a long hunt."}, {"viet": "Chàng trố mắt ngạc nhiên nhìn nàng.", "eng": "He goggled at her in surprise."}, {"viet": "Anh ấy đã cố gắng nhảy cao thử nhiều lần trước khi anh vượt qua được độ cao ấy.", "eng": "He had had several goes at the high jump before he succeeded in clearing it."}, {"viet": "Anh ấy có mức thu nhập đến 6 con số.", "eng": "He has a six-figure income."}, {"viet": "Ông ta không có nguồn an ủi nội tâm nào và ghét bị cô độc.", "eng": "He has no inner resources and hates being alone."}, {"viet": "Ông ta đã đánh bà ta sau khi khiêu khích nhiều lần.", "eng": "He hit her after repeated provocations."}, {"viet": "Ông ta nổi tiếng về tính ngắn gọn trong những bài diễn văn của ông ta.", "eng": "He is famous or the brevity of his speeches."}, {"viet": "Anh ta cố bảo vệ ông chủ của mình khỏi bị chỉ trích.", "eng": "He is trying to shelter his boss from criticism."}, {"viet": "Anh ta cười để giấu nỗi lo lắng của mình.", "eng": "He laughed to cover his nervousness."}, {"viet": "Anh ta nhìn mặt trời qua tấm kính ám khói.", "eng": "He looked at the sun through a sheet of smoked glass."}, {"viet": "Nó tìm cách chạm vào quả bóng.", "eng": "He managed to get a touch to the ball."}, {"viet": "Lẽ ra ông ta đã không bao giờ để chúng tôi đi sâu không hề hấn gì vào tình trạng mất hết đạo đức và luân lý do lòng tham cá nhân.", "eng": "He never would have let us go untroubled into the night of private greed."}, {"viet": "Ông ấy dự định sẽ quản lý một quán rượu khi về hưu.", "eng": "He plans to keep a pub when he retires."}, {"viet": "Anh ta bắt tay tôi lắc lên lắc xuống thật mạnh.", "eng": "He pumped my hand up and down vigorously."}, {"viet": "Ông ta đã nhận được huy chương khen thưởng lòng dũng cảm của mình.", "eng": "He received a medal in reward for his bravery."}, {"viet": "Anh ta cướp ngân hàng và bị giam 10 năm.", "eng": "He robbed a bank and got done for ten years."}, {"viet": "Lúc nào hắn ta cũng có chuyện để kêu ca.", "eng": "He's always having a grouch about something."}, {"viet": "Ông ta đã cho cạo râu đi.", "eng": "He's had his beard shaved off."}, {"viet": "Anh ta thật sự si người bạn gái mới của mình.", "eng": "He's really stuck on his new girl-friend."}, {"viet": "Anh ta ngồi ở bàn suốt buổi sáng nhưng chẳng viết được gì nhiều.", "eng": "He sat at his desk all morning but he didn't write much."}, {"viet": "Dường như anh ta rất bận việc.", "eng": "He seems very bound up in his work."}, {"viet": "Anh ta bị một cái đinh xuyên vào bàn chân.", "eng": "He skewered his foot on a nail."}, {"viet": "Anh ta phết ít mứt dâu lên lát bánh mì nướng.", "eng": "He spread some strawberry jam on his toast."}, {"viet": "Ông ta chém nó thật mạnh bằng thanh gươm của mình.", "eng": "He struck it mightily with his sword."}, {"viet": "Hắn ra chiều say mê khi xem đấu vật trên ti vi.", "eng": "He tends to get carried away when watching wrestling on TV."}, {"viet": "Anh ta kéo tôi ra một bên để nói cho tôi biết bệnh tình của vợ anh.", "eng": "He took me aside to tell me of his wife's illness."}, {"viet": "Ông ta quay lưng lại với gia đình từ khi nổi tiếng.", "eng": "He turned his back on his family when he became famous."}, {"viet": "Anh ta đòi trả 800 bảng Anh cho chiếc xe ô tô đó nhưng tôi đòi anh ta giảm giá xuống còn 600 bảng Anh.", "eng": "He wanted £ 800 for the car but I beat him down to £ 600."}, {"viet": "Anh ta rất lo cho gia đình đang đi du lịch ở nước ngoài.", "eng": "He was anxious for his family who were traveling abroad."}, {"viet": "Anh ta kiên quyết là họ sẽ đi.", "eng": "He was completely adamant that they should go."}, {"viet": "Nó đã bị kết tội quấy rối tình dục một cô gái trẻ.", "eng": "He was found guilty of molesting a young girl."}, {"viet": "Anh ta bị xem khinh vì nguồn gốc hèn mọn của mình.", "eng": "He was looked down on because of his humble background."}, {"viet": "Nó bị phạt vì đã gian lận trong kỳ thi.", "eng": "He was punished for copying during the examination."}, {"viet": "Anh ta ngạc nhiên thấy lời đối thoại của anh ta được ghi trên giấy trắng mực đen.", "eng": "He was surprised to see his conversation in black and white."}, {"viet": "Cả cuộc đời ông ta đã làm việc cho công ti này.", "eng": "He was worked for this company, man and boy."}, {"viet": "Ông ta sẽ đi vào lịch sử như một chính khách vĩ đại.", "eng": "He will go down in history as a great statesman."}, {"viet": "Anh ta dệt nên một câu chuyện đầy hấp dẫn từ một vài sự kiện đã quên lãng.", "eng": "He wove a fascinating story from a few forgotten incidents."}, {"viet": "Sự giúp đỡ đến quả đúng lúc.", "eng": "Help came not an instant too soon."}, {"viet": "Bạn trai của cô ấy là điều quan trọng nhất của cuộc đời cô ấy.", "eng": "Her boy-friend is the be-all and end-all of her existence."}, {"viet": "Thái độ đường hoàng của bà ta trong suốt buổi xét xử.", "eng": "Her dignified bearing throughout the trial."}, {"viet": "Hôn nhân lần đầu của cô ta chấm dứt sau năm năm.", "eng": "Her first marriage ended after five years."}, {"viet": "Bệnh của cô ta không cung cấp nguyên nhân gì để quan tâm.", "eng": "Her illness gives no occasion for concerns."}, {"viet": "Việc hôn nhân của cô ta do cha mẹ xếp đặt.", "eng": "Her marriage was arranged by her parents."}, {"viet": "Bữa tiệc của cô ấy rất thành công.", "eng": "Her party went like a bomb."}, {"viet": "Học bạ cô ấy chứng tỏ cô ta kém số học và sinh vật học.", "eng": "Her school report shows that she is weak in arithmetic and biology."}, {"viet": "Ý nghĩ của cô ta đang bối rối xáo động.", "eng": "Her thoughts were in a tumult."}, {"viet": "Đây là bản tóm lược tin tức.", "eng": "Here is a summary of the news."}, {"viet": "Sự đồng ý của anh ta mua nhà chúng tôi là với điều kiện để lại tất cả đồ đạc trong đó.", "eng": "His agreement to buy our house conditional on our leaving all the furniture in it."}, {"viet": "Giày của anh ta bị bùn đóng.", "eng": "His boots were encrusted in mud."}, {"viet": "Sự mong mỏi của đất nước anh ta về việc thiết lập những mối quan hệ hữu nghị.", "eng": "His country's desire to establish friendly relations."}, {"viet": "Mắt anh ta nhìn vào mục quảng cáo trong tờ tạp chí.", "eng": "His eyes fell upon an advertisement in the magazine."}, {"viet": "Các bạn bè của anh ta cố gắng lay anh ta khỏi sự thờ ơ.", "eng": "His friends try everything to shake him out of his apathy."}, {"viet": "Ảnh hưởng của ông ta đối với đảng đó đang liên tục suy yếu.", "eng": "His influence on the party is steadily weakening."}, {"viet": "Khả năng có một không hai của anh ta về mặt mê hoặc, lừa gạt, hoặc ve vãn hầu hết những người cộng tác với mình về chính trị.", "eng": "His matchless ability to charm, bamboozle, or canoodle most of his political associates."}, {"viet": "Bố mẹ nó ngần ngại về số tiền phải trả cho cây đàn ghi ta nó muốn mua.", "eng": "His parents balked at the cost of the guitar he wanted."}, {"viet": "Thảm kịch mới đây đã đưa thẳng các nhà bào chế thuốc đó ra tòa.", "eng": "His recent tragedy has put the manufacturer of the drug squarely in the dock."}, {"viet": "Bài diễn văn của ông ta nhằm kích động quần chúng.", "eng": "His speech was calculated to stir up the crowd."}, {"viet": "Kiến thức tiếng anh của anh ấy rất tốt.", "eng": "His understanding of English is very good."}, {"viet": "Đập vật gì mạnh bằng búa.", "eng": "Hit something smartly with a hammer."}, {"viet": "Hy vọng thuế được giảm bớt một ít.", "eng": "Hoping for a small diminution in taxes."}, {"viet": "Làm cách nào để tôi có thể thưởng cho anh về tất cả sự giúp đỡ của anh?", "eng": "How can I reward you for all your help?"}, {"viet": "Làm thế nào không dùng cái khui chai mà anh mở được chai?", "eng": "How did you open the bottle without a bottle-opener?"}, {"viet": "Đến trạm xăng tiếp sau còn bao xa?", "eng": "How far is it to the next petrol station?"}, {"viet": "Anh đã ăn mấy bát cơm bữa sáng?", "eng": "How many bowls of rice did you have at breakfast?"}, {"viet": "Em đã khóc hết bao nhiêu nước mắt vì anh rồi?", "eng": "How many tears have I cried over you?"}, {"viet": "Khi em còn học ở trường tiểu học tiền trợ cấp của em là bao nhiêu?", "eng": "How much was your allowance when you were in elementary school?"}, {"viet": "Hugles đã ghi được hai bàn trước khi hết hiệp nhất.", "eng": "Hugles scored two goals before half-time."}, {"viet": "Tôi muốn mua ba dao cạo râu.", "eng": "I'd like three straight razors, please."}, {"viet": "Tôi sẽ chấp nhận chiếc xe ôtô giá 350 bảng Anh hoặc trả cao hơn những người khác.", "eng": "I'll accept £ 350 for the car, or nearest offer."}, {"viet": "Tôi sẽ phải tập thể dục để làm tan mỡ bụng.", "eng": "I'll have to exercise to get rid of my spare tyre."}, {"viet": "Tôi sẽ bảo thợ điện đến thay bóng đèn ngay.", "eng": "I'll tell the electrician to replace it right away."}, {"viet": "Tôi lấy làm xấu hổ mà nói rằng tôi đã không đi khám răng trong ba năm.", "eng": "I'm ashamed to say I haven't been to a dentist for three years."}, {"viet": "Anh sẽ ăn thịt thăn bò nướng với các loại rau củ có ướp gia vị.", "eng": "I'm going to have the steak fillet with seasoned vegetables."}, {"viet": "Anh biết đấy, tôi chẳng còn trẻ như trước nữa.", "eng": "I'm not as young as I was, you know!"}, {"viet": "Tôi gọi điện đến là để nói với các cô về các dịch vụ tồi tệ mà tôi nhận được tại khách sạn của các cô.", "eng": "I'm ringing to tell you about the terrible services I received at your hotel."}, {"viet": "Tôi chắc cô ấy sẽ làm như cô ấy đã hứa, tôi hết sức tin tưởng ở cô ấy.", "eng": "I'm sure she'll do as she promised, i've got great faith in her."}, {"viet": "Tuần tới tôi sẽ làm việc suốt từ thứ hai đến thứ sáu.", "eng": "I'm working Monday through Friday next week."}, {"viet": "Tôi đã cố gắng liên lạc với bạn.", "eng": "I've been trying to get in touch with you."}, {"viet": "Tôi phải tiêu một khoản tiền lớn cho ô tô của tôi.", "eng": "I've had to spend a large sum of money on my car."}, {"viet": "Tôi đã nói là tôi xin lỗi Tôi còn có thể nói được gì khác nữa?", "eng": "I've said I'm sorry What else can I say?"}, {"viet": "Tôi cũng có một cái áo kiểu bằng lụa nữa.", "eng": "I also have a silk blouse."}, {"viet": "Tôi là người chỉ trích nghiêm khắc nhất đối với bản thân mình.", "eng": "I am my own severest critic."}, {"viet": "Tôi yêu cầu họ nộp bài tập làm văn vào thứ sáu.", "eng": "I asked for their essays to be handed in by Friday."}, {"viet": "Tôi mua thứ đó ở cửa hàng bánh kẹo.", "eng": "I bought it at the confectioner's shop."}, {"viet": "Tôi không tìm thấy đôi giày, bạn có thấy chúng không?", "eng": "I can't find my shoes, have you seen them?"}, {"viet": "Tôi không thể nói được anh ta hay là cô ta đáng trách-bên tám lạng thì bên kia cũng nửa cân.", "eng": "I can't tell whether he or she is to blame-it's six of one and half a dozen of the other."}, {"viet": "Tôi có thể nhìn thấy đáy sông: những hòn sỏi, cát và rong.", "eng": "I can see the bottom: the pebbles, sand and weeds."}, {"viet": "Tôi không thể hình dung được anh muốn nói gì.", "eng": "I can't think what you mean."}, {"viet": "Tôi không thể nào theo dõi được toàn bộ các chi tiết phức tạp của âm mưu này.", "eng": "I couldn't follow all the ramifications of the plot."}, {"viet": "Tôi muốn gặp ông Peter Wilson.", "eng": "I'd like to see Mr. Peter Wilson."}, {"viet": "Tôi không nhận ra anh ta: anh ấy cải trang.", "eng": "I didn't recognize him: he was in disguise."}, {"viet": "Tôi không chấp nệ việc anh ta bầu cho Đảng Bảo thủ.", "eng": "I don't hold it against him that he votes Conservative."}, {"viet": "Tôi cũng chẳng bận tâm, thật ra là tôi thích giúp đỡ.", "eng": "I don't mind, indeed, I am delighted to help."}, {"viet": "Tôi không muốn gây phiền hà cho ông.", "eng": "I don't want to be any trouble to you."}, {"viet": "Tôi không thích ăn món thịt bò bít-tết quá sống.", "eng": "I don't like my steak too underdone."}, {"viet": "Tôi đã giảng giải nhưng mặc dù vậy anh ta vẫn không hiểu.", "eng": "I explained, but even then he didn't understand."}, {"viet": "Tôi cảm thấy bắt buộc phải điều tra vấn đề này kỹ càng hơn.", "eng": "I felt impelled to investigate the matter further."}, {"viet": "Tôi tìm thấy tấm bản đồ cũ này trong bộ gia phả.", "eng": "I found this old map in the family archives."}, {"viet": "Tôi bị mưa ướt sũng.''Đáng đời anh-Tôi đã bảo mang ô đi kia mà'.", "eng": "I got soaked in the rain.''It serves you right-I told you to take an umbrella'."}, {"viet": "Tôi đánh mất chiếc bút máy, nhưng cô ta đã làm hiện ra một chiếc khác cho tôi từ một nơi nào đó.", "eng": "I had lost my pen, but she conjured up another one for me from somewhere."}, {"viet": "Tôi có 200 bảng Anh trong tài khoản.", "eng": "I have £ 200 in my account."}, {"viet": "Tôi có rất ít thông tin liên quan tới quá khứ của hắn.", "eng": "I have little information as regards his past."}, {"viet": "Tôi còn ba kiểu nữa của phim này.", "eng": "I have three exposures left on this film."}, {"viet": "Tôi chưa đọc được bản báo cẩn thận-tôi chỉ mới lướt qua.", "eng": "I haven't read the report properly-I've only dipped into it."}, {"viet": "Tôi nấp sau cánh cửa để không ai nhìn thấy tôi.", "eng": "I hid behind the door so that no one could see me."}, {"viet": "Tôi hy vọng anh hãy kiên nhẫn nghe tôi giải thích.", "eng": "I hope you will bear with me as I explain."}, {"viet": "Tôi va phải xô và nước đổ tràn ra khắp cả sàn nhà.", "eng": "I knocked over the bucket and the water poured all over the floor."}, {"viet": "Tôi thích xem môn bóng chày.", "eng": "I like baseball as a spectator sport."}, {"viet": "Tôi sẽ rất vui được làm bất cứ điều gì tôi có thể.", "eng": "I'll be happy to do whatever I can."}, {"viet": "Tôi sẽ để ghế trống trong chuyến khứ hồi.", "eng": "I'll leave the return flight open."}, {"viet": "Tuần này tôi hơi túng tiền.", "eng": "I'm a bit short this week."}, {"viet": "Tôi định đem làm quà tặng.", "eng": "I'm going to give it as a gift."}, {"viet": "Tôi đang trên đường trở về Nhật Bản.", "eng": "I'm on my way back to Japan."}, {"viet": "Tôi ngỏ lời cáo lỗi với chủ nhà và ra đi sớm.", "eng": "I made my apologies to my host and left early."}, {"viet": "Tôi phải tìm chỗ để cất tất cả các đồ hộp này.", "eng": "I must find a home for all these tins."}, {"viet": "Tôi cần mua một đôi vớ.", "eng": "I need to buy a pair of socks."}, {"viet": "Tôi tình cờ tìm thấy nó thôi.", "eng": "I only found it by accident."}, {"viet": "Tôi đề nghị không nói gì hết về những sự kiện kinh khủng tiếp theo sau đó.", "eng": "I propose to draw a veil over the appalling events that followed."}, {"viet": "Tôi lĩnh ít tiền hơn những người khác.", "eng": "I received less money than the others did."}, {"viet": "Tôi nói lời từ biệt với những người tôi vốn quý mến.", "eng": "I said farewell to those I hold dear."}, {"viet": "Tôi đã phái Joe đi điều tra kỹ khả năng giao dịch với họ.", "eng": "I sent Joe along to sus out the possibility of doing a deal with them."}, {"viet": "Tôi va vào tường bị trầy khuỷu tay.", "eng": "I skinned my elbow against the wall."}, {"viet": "Tôi đã gợi ý cho ông ấy nên giải quyết vấn đề một cách khác.", "eng": "I suggested to him that we should tackle the problem another way."}, {"viet": "Tôi nghĩ tôi có thể xin được việc làm đó nhưng nếu Bob cũng xin chỗ đó thì anh ta có thể làm hỏng kế hoạch của tôi.", "eng": "I think I'm likely to get the job but if Bob applies for it too he could queer my pitch."}, {"viet": "Tôi nghĩ bản báo cáo này quá dài.", "eng": "I think the report is too long."}, {"viet": "Tôi cứ nghĩ là anh đã tới từ hôm qua.", "eng": "I thought you were coming yesterday."}, {"viet": "Tôi đã cố gắng nhưng tôi không tài nào theo kịp anh.", "eng": "I try, but I couldn't catch up with you."}, {"viet": "Tôi đến thăm họ mỗi năm một lần.", "eng": "I visit them once a year."}, {"viet": "Tôi muốn chỉ cho anh rõ một vài vấn đề.", "eng": "I want to put you right on one or two matters."}, {"viet": "Tôi sinh ra tại Hà Nội, nhưng thành phố Hồ Chí Minh là quê hương thứ hai của tôi.", "eng": "I was born in Hanoi, but HoChiMinh City is my second home."}, {"viet": "Tôi chỉ nghĩ rằng đường sao mà xa quá.", "eng": "I was just thinking to myself what a long way it is."}, {"viet": "Tôi gặp khó khăn khi ở nước ngoài, không một xu dính túi.", "eng": "I was stranded in a foreign country with no money."}, {"viet": "Tôi đã học ở trường Trung học Nữ.", "eng": "I went to Girls'High School."}, {"viet": "Tôi muốn nói chuyện với ông Hopkins, trưởng phòng kinh doanh.", "eng": "I wish to speak to Mr. Hopkins, the manager of the Sales Department."}, {"viet": "Tôi tự hỏi tại sao James luôn đi học muộn.", "eng": "I wonder why James is always late for school."}, {"viet": "Tôi muốn đi đến cửa hàng bách hóa.", "eng": "I would like to go to a department store."}, {"viet": "Tôi không xếp ông ta vào trong số những nhà soạn nhạc vĩ đại nhất.", "eng": "I wouldn't put him among the greatest composers."}, {"viet": "Nếu tình trạng sức khỏe của anh ta trở nên xấu hơn thì chúng ta phải điện thoại gọi xe cứu thương đến.", "eng": "If he gets any worse, we must phone for an ambulance."}, {"viet": "Nếu đồng hồ của tôi không chạy nhanh.", "eng": "If may watch wasn't fast."}, {"viet": "Nếu họ giao cho tôi một việc ở Mỹ, tôi sẽ chớp cơ may đó liền.", "eng": "If they offer me a job in the USA, I'd jump up at the chance."}, {"viet": "Nếu bạn không đói lắm, hãy gọi gì đó ăn dễ tiêu đi.", "eng": "If you are not very hungry, order something light to eat."}, {"viet": "Nếu bạn ăn nhiều thế, bạn sẽ bị mập đấy.", "eng": "If you eat that much, you will get fat."}, {"viet": "Nếu bạn có gặp John trong chuyến đi của bạn, bảo hắn gọi điện thoại cho tôi.", "eng": "If you see John on your travels, tell him to ring me."}, {"viet": "Làm sáng tỏ một đoạn khó trong một cuốn sách.", "eng": "Illuminate a difficult passage in a book."}, {"viet": "Ở Anh, phụ nữ được hưởng quyền đi bầu từ năm 1918.", "eng": "In Britain women were enfranchised in 1918."}, {"viet": "Trong câu I saw Mary, Mary là bổ ngữ trực tiếp.", "eng": "In I saw Mary, Mary is the direct object."}, {"viet": "Mặc dù tất cả những lời đoan chắc của anh ta, anh ta vẫn không quay lại.", "eng": "In spite of all his assurances, he did not come back."}, {"viet": "Trong mười lăm năm qua, lễ hội powwow đã trở nên rất quan trọng.", "eng": "In the past fifteen years, the powwow has grown to be very important."}, {"viet": "Ở nước bạn, các học sinh trung học có làm việc tình nguyện không?", "eng": "In your country, do high-school students do volunteer work?"}, {"viet": "Ở trường có dạy về thư tín thương mại không?", "eng": "Is commercial correspondence taught at the school?"}, {"viet": "Ngày nay, đất nước có được thế tục hoá hơn không?", "eng": "Is the country more secularized nowadays?"}, {"viet": "Bức tranh này có thể coi là của Michelangelo được không?", "eng": "Is this painting attributable to Michelangelo?"}, {"viet": "Chỉ độ vài dặm nữa thôi, không hơn.", "eng": "It's a matter of a few more miles, that's all."}, {"viet": "Tin nhà máy đóng cửa được lan đi.", "eng": "It's being noised around that the factory is going to close."}, {"viet": "Những thứ mà bạn đã học khi còn nhỏ thì khó quên.", "eng": "It's hard to forget things you learnt when you were small."}, {"viet": "Anh biết không, cho rằng anh xứng đáng có quyền được đãi ngộ là chẳng ích lợi gì cả.", "eng": "It's no use thinking the world owes you a living, you know."}, {"viet": "Ông thật tử tế khi mời tôi dùng bữa tối.", "eng": "It's really very kind of you to invite me to dinner."}, {"viet": "Chuyện anh ta từ chối không trong một cốc rượu là lạ đấy.", "eng": "It's unusual for him to refuse a drink."}, {"viet": "Việc bà ấy kiềm chế không nổi giận thật đáng khen.", "eng": "It does her credit that she managed not to get angry."}, {"viet": "Trời vào thu và lá cây bắt đầu ngả màu.", "eng": "It is autumn and the leaves beginning color."}, {"viet": "Tính tôi không phải là bỏ mặc kẻ khác trong hoạn nạn.", "eng": "It is not my way to desert people in misfortune."}, {"viet": "Anh không đi dự đám cưới của em trai anh là không phải đạo.", "eng": "It looks bad not going to your own brother's wedding."}, {"viet": "Giá khoảng 7 đôla một ngày.", "eng": "It's about $ 7 per day."}, {"viet": "Tổng cộng là 289 nhân dân tệ 60 xu.", "eng": "It's two hundred eighty-nine Yuan and sixty fen altogether."}, {"viet": "Phải mất tám ngày chặn không cho tiếp tế lương thực mới buộc được chúng ra ( khỏi toà nhà ).", "eng": "It took 8 days to starve them out ( of the building )."}, {"viet": "Tin được thông báo là Thủ tướng sẽ nói trên vô tuyến.", "eng": "It was announced that the Prime minister would speak on television."}, {"viet": "Đó là một trong những buổi biểu diễn tốt hơn của nhà hát Broadway tôi được xem.", "eng": "It was one of the better Broadway shows I've seen."}, {"viet": "Rồi sẽ tốt cả thôi, cô dịu dàng thì thầm.", "eng": "It will be all right, she cooed soothingly."}, {"viet": "Jack có một vài câu hỏi khó nhưng anh ta vẫn mày mò qua được.", "eng": "Jack got some difficult questions but he managed to muddle through."}, {"viet": "John Glent nguyên là thị trưởng của thành phố này.", "eng": "John Glent sometime mayor of this city."}, {"viet": "Cách đây chỉ hai tuần, khi tôi đổi đô la Mỹ của tôi ở Bắc Kinh, tôi nhận được ít hơn từ cùng một số lượng đô la Mỹ.", "eng": "Just two weeks ago, when I exchanged my US dollars in Beijing I got less from the same amount of US dollars."}, {"viet": "Đội Leeds ăn mừng trận thắng đậm đội Chelsea 6-1.", "eng": "Leeds celebrated their 6-1 thrashing of Chelsea."}, {"viet": "Chúng ta hãy đến gặp vài người đi.", "eng": "Let's go over to meet some of them."}, {"viet": "Nhiều lợi ích sẽ bắt nguồn từ sự phát hiện này.", "eng": "Many benefits will flow from this discovery."}, {"viet": "Nhiều gia đình giàu có đã sa sút vì cuộc khủng hoảng tài chính.", "eng": "Many rich families were brought low by the financial crisis."}, {"viet": "Tôi hỏi về một vài nhân viên trong số này được không?", "eng": "May I ask about some of these men?"}, {"viet": "Có thể lương tôi không cao nhưng vẫn còn hơn là thất nghiệp.", "eng": "Maybe I'm not well-paid, but it's better than being out of a job."}, {"viet": "Phần lớn tiền của nó bị nằm im trong bất động sản.", "eng": "Most of his money's tied up in property."}, {"viet": "Thưa bà Hope, tiền của bà đây, 1500 đô la Mỹ ngân phiếu du lịch và bốn trăm tám mươi lăm tiền mặt.", "eng": "Mrs. Hope, here is your money US $ 1,500 in traveller's cheques and four hundred eighty five in cash."}, {"viet": "Con chó và con mèo của tôi không bao giờ đánh nhau-chúng sống hoàn toàn hoà thuận.", "eng": "My cat and dog never fight-they live together in perfect harmony."}, {"viet": "Ông tôi không tán thành việc cưới vợ của bố tôi.", "eng": "My grandfather did not approve of my father's marriage."}, {"viet": "Bố mẹ tôi luôn luôn không bằng lòng tôi đi chơi đêm đến tận khuya.", "eng": "My parents always frown on late nights out."}, {"viet": "Vợ tôi cho rằng tôi quá béo-anh thấy thế nào?", "eng": "My wife thinks I'm too fat-what do you say?"}, {"viet": "Báo chí thường không tôn trọng đời tư cá nhân.", "eng": "Newspaper often don't respect the individuals right to privacy."}, {"viet": "Thưa không, chúng tôi có hàng trăm mặt hàng, nhưng đây chỉ là những danh mục các mặt hàng được biết đến nhiều nhất.", "eng": "No, we have hundreds of items, but these are the lists of the most popular ones."}, {"viet": "Không một vai nào diễn được hết-họ đang làm hỏng vở kịch.", "eng": "None of the cast can act at all-they're butchering the play."}, {"viet": "Vật lý hạt nhân là một môn phần lớn chúng ta không biết gì.", "eng": "Nuclear physics is a closed book to most of us."}, {"viet": "Ồ, cám ơn, nhưng tôi chỉ là người mới học nhảy thôi.", "eng": "Oh, thank you, but I am only a beginner."}, {"viet": "Xét qua trận đấu tuần trước, đội đó khó có thể thắng lợi ngày hôm nay.", "eng": "On last week's showing, the team is unlikely to win today."}, {"viet": "Một khách sạn có thể có tất cả các dịch vụ đã đề cập ở trên.", "eng": "One hotel may offer all kinds of services mentioned all above."}, {"viet": "Chỉ nhìn những dụng cụ giải phẫu tôi đã sợ toát mồ hôi.", "eng": "Only to look at surgical instruments makes me sweat."}, {"viet": "Đại diện của hãng chúng tôi ở Ấn Độ là ông Hall.", "eng": "Our firm is represented in India by Mr Hall."}, {"viet": "Những mục đích ban đầu của chúng ta đã bị bỏ qua.", "eng": "Our original aims have been lost sight of."}, {"viet": "Vì thương cảm các trẻ em vô gia cư, ông ta đã cho chúng trú ngụ qua đêm.", "eng": "Out of sympathy for the homeless children he gave them shelter for the night."}, {"viet": "Kiên nhẫn là một trong những phẩm chất quan trọng nhất của một thầy giáo.", "eng": "Patience is one of the most important attributes in a teacher."}, {"viet": "Người phạm những tội ác như vậy là không bình thường.", "eng": "People who commit crimes like that aren't normal."}, {"viet": "Xin cho tôi biết đường đến nhà bạn.", "eng": "Please tell me directions to your house."}, {"viet": "Dạo gần đây, em không vận động gì cả nên em đang nghĩ đến việc tham gia một câu lạc bộ thể dục dụng cụ.", "eng": "Recently, I haven't been getting any exercise so I'm thinking of joining a gym."}, {"viet": "Thấy người đàn ông có mái tóc vàng đó không?", "eng": "See that man with the blond hair?"}, {"viet": "Cô ấy đã bịa ra một câu chuyện khó tin về chuyến xe lửa bị hủy bỏ.", "eng": "She'd concocted some unlikely tale about the train being cancelled."}, {"viet": "Cô ấy là một nhạc sĩ trẻ rất giỏi, cô ấy còn tiến xa.", "eng": "She's an excellent young musician, she should go far."}, {"viet": "Cô ta ổn định chỗ ở trong một căn hộ ấm cúng.", "eng": "She's got herself fixed up with a cosy flat."}, {"viet": "Cô ấy là một trong những người mà ta hoặc là yêu hoặc là ghét.", "eng": "She's one of those people that you either love or hate."}, {"viet": "Cô ta lo che giấu vai trò của cô ấy trong vụ đó.", "eng": "She's very defensive about her part in the affair."}, {"viet": "Cô ta đến nơi phỏng vấn với các bản danh sách thống kê.", "eng": "She arrived at the interview armed with lists of statistics."}, {"viet": "Cô ta có thể ngồi đọc sách trong nhiều giờ liền.", "eng": "She can sit reading for hours together."}, {"viet": "Cô ấy bò lên bờ sông và nằm ở đó hít thở khí trời.", "eng": "She crawled onto the river bank and lay there gulping in air."}, {"viet": "Cô ta đã thắng nhà vô địch với những séc đầy hào hứng.", "eng": "She disposed of the champion in straight sets."}, {"viet": "Cô ta cảm thấy đau nhói trong tim của cô khi anh ấy ra đi.", "eng": "She felt a sharp tug at her heart strings as he left."}, {"viet": "Bà ta đọc bài diễn văn cảm ơn ông chủ tịch theo thông lệ.", "eng": "She gave the customary speech of thanks to the chairman."}, {"viet": "Bà ta đã ở cương vị đó trong suốt 20 năm.", "eng": "She had been in the same post for 20 years."}, {"viet": "Cô ấy có dáng đi phân biệt với người khác.", "eng": "She has a very distinctive way of walking."}, {"viet": "Gần đây cô ấy không khoẻ.", "eng": "She hasn't been feeling very well latterly."}, {"viet": "Cô ấy gốc người Anh nhưng lấy chồng người Pháp.", "eng": "She is English by birth but French by marriage."}, {"viet": "Cô ta cứ ngồi đó, chìm ngập trong phiền muộn.", "eng": "She just sat there, sunk in depression."}, {"viet": "Đến lúc đó bà ta đã về hưu rồi.", "eng": "She'll have retired by then."}, {"viet": "Cô ấy tìm được cách lẩn tránh không trả lời tất cả các câu hỏi.", "eng": "She managed to wriggle out of answering all the questions."}, {"viet": "Cô ta xếp sách của mình vào những hộp bìa cứng.", "eng": "She packed her books in cardboard boxes."}, {"viet": "Cô ta đã cãi nhau với anh trai mình về các điều khoản trong chúc thư của ông bố.", "eng": "She quarrelled with her brother about the terms of their father's will."}, {"viet": "Cô ta có bằng cao học khoa học.", "eng": "She's a Master of Sciences."}, {"viet": "Cô ta đang tìm một công việc làm bán thời gian.", "eng": "She's looking for a part-time job."}, {"viet": "Cô ta ngồi ở góc phòng, quan sát từng chuyển động của tôi.", "eng": "She sat in the corner, watching my every move."}, {"viet": "Cô ta đã bộc lộ một niềm tin đáng thương vào khả năng vô địch của cô ta.", "eng": "She showed a touching faith in her own invincibility."}, {"viet": "Bà ta lên tiếng bênh vực các tín ngưỡng tôn giáo của mình.", "eng": "She spoke in defence of her religious beliefs."}, {"viet": "Tuần tới cô ta thi, vì thế mà cô ta học rất khuya.", "eng": "She takes her exam next week, so she's burning up the midnight oil."}, {"viet": "Bà ta cố gắng nhồi nhét một số điều cần biết vào đầu nó trước kỳ thi.", "eng": "She tried to pump some facts into his head before the examination."}, {"viet": "Bà ấy muốn gả con gái cho một người nhà giàu.", "eng": "She wants to marry her daughter to a rich man."}, {"viet": "Cô ta nóng lòng muốn kể lại cho anh ta tin vui đó.", "eng": "She was bursting to tell him the good news."}, {"viet": "Bà ấy càu nhàu về giá cả của thực phẩm.", "eng": "She was grumbling about the cost of the food."}, {"viet": "Cô ta ra khỏi giường, mặc áo quần, rồi đến bàn ăn điểm tâm mà chỉ mất có 50 giây.", "eng": "She was out of bed, dressed and at the breakfast table in 50 seconds flat."}, {"viet": "Cô ta đang vật lộn dưới sức nặng của ba cái vali.", "eng": "She was struggling under the weight of three suitcases."}, {"viet": "Cô ta không ngủ say đến nỗi không nghe tôi.", "eng": "She wasn't so sound asleep but that she wouldn't hear me."}, {"viet": "Cô ấy không dễ dàng bỏ cuộc: cô ta là một con người can trường thực sự.", "eng": "She won't give up easily: she's a real fighter."}, {"viet": "Chị ấy cộng tác với em gái viết cuốn sách.", "eng": "She wrote the book in collaboration with her sister."}, {"viet": "Được phủ kín từ đầu đến chân bằng đồ liệm.", "eng": "Shrouded from head to foot in the habiliments of the grave."}, {"viet": "Hát những lời ru cho các em bé.", "eng": "Sing nursery rhymes to the children."}, {"viet": "Những náo động nho nhỏ, điềm báo trước của cuộc cách mạng sắp nổ ra.", "eng": "Small disturbances that were precursors of the revolution to come."}, {"viet": "Vậy ra là anh ta nghĩ điều đó dễ dàng?", "eng": "So he thinks it's easy, does he?"}, {"viet": "Khi nghỉ phép, binh sĩ mặc quần áo thường, không mặc quân phục.", "eng": "Soldiers wear mufti on leave, not uniform."}, {"viet": "Một số ghế đã bị gãy.", "eng": "Some of the chairs are broken."}, {"viet": "Chim sẻ dài sáu inh, nhưng trung bình chúng nhỏ hơn.", "eng": "Some sparrows are six inches long, but they average smaller."}, {"viet": "Đôi khi chúng ta thực hiện việc nghiên cứu riêng.", "eng": "Sometimes we carry out our own research."}, {"viet": "Khi xử lý một tình huống cấp bách, điều rất quan trọng là phải nhanh chóng.", "eng": "Speed is of the essence in dealing with an emergency."}, {"viet": "Ở Luân Đôn từ thứ Ba cho đến hết thứ Sáu.", "eng": "Stay in London Tuesday thru Friday."}, {"viet": "Đừng rề rà nữa, tiếp tục làm việc của cậu đi.", "eng": "Stop pissing about and get on with your work."}, {"viet": "Chủ ngữ và vị ngữ là những thành tố trực tiếp của câu.", "eng": "Subject and predicate are the immediate constituent constituents of the sentence."}, {"viet": "Đột nhiên tôi nhìn thấy có cái gì chuyển động sau rèm.", "eng": "Suddenly I saw a movement behind the curtain."}, {"viet": "Quan sát tổng quát cảnh đồng quê từ trên đỉnh đồi.", "eng": "Survey the countryside from the top of a hill."}, {"viet": "Chiếm vị trí hàng đầu của ai.", "eng": "Take over the lead from somebody."}, {"viet": "Tuôn ra cho nhanh lẹ hết bài báo này đến bài tin tức kia.", "eng": "Tearing off article after news article."}, {"viet": "Việc phân tích văn bản đã làm cho ta nhận biết tác giả là Shakespeare.", "eng": "Textual analysis identified the author as Shakespeare."}, {"viet": "Rác rưởi đó mà-em có thể vất nó đi.", "eng": "That's rubbish-you can throw it away."}, {"viet": "Điều đó không phù hợp với lời nói trước đây của anh.", "eng": "That does not accord with your previous statement."}, {"viet": "Ông ta cư xử như một đứa bé lớn quá nhanh.", "eng": "That man behaves like an overgrown child."}, {"viet": "Nó được miễn thuế, phải vậy không?", "eng": "That's duty-free, isn't it?"}, {"viet": "Đó là một thủ đoạn khá hèn mạt!", "eng": "That was a pretty low-down trick to play!"}, {"viet": "Tai nạn đó làm bà ta cạch lái xe đến già.", "eng": "The accident put her off driving for life."}, {"viet": "Lời khuyên của chúng tôi nhận chẳng có ích gì.", "eng": "The advice we got was of no avail."}, {"viet": "Những người La Mã cổ đã thiết lập các thuộc địa ở khắp châu Âu.", "eng": "The ancient Romans founded colonies throughout Europe."}, {"viet": "Những kiểu kiến trúc Hy Lạp cổ.", "eng": "The architectural styles of ancient Greece."}, {"viet": "Sự đánh giá tiến bộ trong học tập của anh ta.", "eng": "The assessment of his academic progress."}, {"viet": "Sản lượng trung bình của nhà máy là 20 chiếc xe ôtô một ngày.", "eng": "The average output of the factory is 20 cars a day."}, {"viet": "Cuộc khiêu vũ là điểm nổi bật nhất trong mùa hoạt động của giới thượng lưu London.", "eng": "The ball was the highlight of the London season."}, {"viet": "Vận động viên đập bóng bất ngờ được hưởng một cơ may khi đạt tới điểm 24.", "eng": "The batsman was given a life when his score was 24."}, {"viet": "Tường lớn che cho khu vườn khỏi gió.", "eng": "The big wall sheltered the garden from the wind."}, {"viet": "Hội đồng đã chỉ định bà ta làm giám đốc mới.", "eng": "The board nominated her as the new director."}, {"viet": "Cuốn sách đó giới thiệu một bài phê bình các chính sách của Chính phủ.", "eng": "The book presents a critique of the Government's policies."}, {"viet": "Cậu bé cố gắng làm một người lớn không khóc, nhưng cơn đau làm cậu chảy nước mắt.", "eng": "The boy tried to be a man and not cry, but the pain brought out tears to his eyes."}, {"viet": "Kĩ nghệ phim Anh từ lâu là nàng lọ lem của thế giới điện ảnh.", "eng": "The British film industry for so long the Cinderella of the cinema world."}, {"viet": "Xe buýt dừng lại để cho một số hành khách xuống.", "eng": "The bus stopped to put down some passengers."}, {"viet": "Viên đại úy bị kết tội xúi giục các sĩ quan khác nổi loạn.", "eng": "The captain was accused of inciting other officers to mutiny."}, {"viet": "Chiếc xe ôtô dừng tại đèn giao thông một lát rồi chạy đi.", "eng": "The car stood at the traffic lights for a few moments, then moved off."}, {"viet": "Con mèo mẹ ngoạm cổ mèo con tha đi.", "eng": "The cat picked up the kitten by the scruff of its neck."}, {"viet": "Ngọn đèn nhiều ngọn rơi xuống sàn đánh rầm.", "eng": "The chandelier landed crash on the floor."}, {"viet": "Đứa bé đó bị dính đầy bùn.", "eng": "The child is covered in mud."}, {"viet": "Bọn trẻ quá suồng sã với thầy giáo của chúng.", "eng": "The children are too familiar with their teacher."}, {"viet": "Bọn trẻ đi thơ thẩn trong khu rừng.", "eng": "The children wandered about in the woods."}, {"viet": "Rạp chiếu bóng ở tận cuối đường xa hơn tôi tưởng.", "eng": "The cinema was farther down the road than I thought."}, {"viet": "Mối liên hệ mật thiết của công nghiệp với thương mại.", "eng": "The close relationship between of industry to trade."}, {"viet": "Trường này được đặt tên George Washington.", "eng": "The college is named for George Washington."}, {"viet": "Kế toán công ty bị buộc tội thay đổi con số để ăn cắp tiền.", "eng": "The company accountant was charged with cooking the book."}, {"viet": "Những người tranh tài bị mệt lả vì nóng bức.", "eng": "The competitors were prostrated by the heat."}, {"viet": "Những thứ chứa trong phòng, những cái đựng trong hộp, chai, túi.", "eng": "The contents of a room, box, bottle, pocket."}, {"viet": "Nền kinh tế đất nước phụ thuộc vào số hàng hoá nó bán ở nước ngoài.", "eng": "The country's economy depends on amount of goods it sells abroad."}, {"viet": "Toà án lệnh cho hắn phải trả đầy đủ số tiền hắn đã ăn cắp.", "eng": "The court ordered him to make full restitution of the money to the people he had stolen it from."}, {"viet": "Đám đông rất lớn, nhưng tôi không thể biết con số là bao nhiêu.", "eng": "The crowd is very big, but I couldn't put a figure on it."}, {"viet": "Nhân viên hải quan kiểm tra hộ chiếu của tôi một cách ngờ vực.", "eng": "The customs officers inspected my passport suspiciously."}, {"viet": "Quyết định này tùy thuộc vào việc gieo đồng tiền.", "eng": "The decision depended on the toss of a coin."}, {"viet": "Gốc của những từ có từ tiếng La tinh.", "eng": "The derivation of words from Latin."}, {"viet": "Các giám đốc đang hi vọng sự trợ giúp của chính phủ để cứu công ty.", "eng": "The directors were hoping for a government bailout to save the company."}, {"viet": "Vị bác sĩ không tiết lộ sự thật cho hắn biết.", "eng": "The doctor did not reveal the truth to him."}, {"viet": "Con chó chui xuống dưới gầm bàn.", "eng": "The dog cowered under the table."}, {"viet": "Các cửa này được đánh số 2, 4, 6 và 8.", "eng": "The doors were numbered 2, 4, 6 and 8."}, {"viet": "Sĩ quan trực cấp cho chúng tôi một căn nhà gỗ nhỏ để qua đêm.", "eng": "The duty officer allocated us a cabin for the night."}, {"viet": "Cuộc bầu cử diễn ra xấu đối với những ứng viên đảng Bảo thủ.", "eng": "The election went badly for the conservatives."}, {"viet": "Phóng đại làm rõ các chi tiết trong bức ảnh.", "eng": "The enlargement brings out the details in the photograph."}, {"viet": "Các vị giám khảo đặc biệt coi trọng cách lập luận có lý lẽ.", "eng": "The examiners put a premium on rational argument."}, {"viet": "Sự thật vẫn là cô ta đã nói dối.", "eng": "The fact remains that she was lying."}, {"viet": "Cách gửi tiền nhanh nhất là gửi bằng điện chuyển tiền.", "eng": "The fastest way to send money is to send by telegraphic transfer."}, {"viet": "Bộ phim thật sự được khán giả trẻ ưa thích.", "eng": "The film has really clicked with young audiences."}, {"viet": "Quả pháo nổ đùng một tiếng.", "eng": "The firework exploded with a loud bang."}, {"viet": "Vật đầu tiên đập vào mắt ai.", "eng": "The first object that struck one's eye."}, {"viet": "Đường rẽ nước sủi bọt trắng xóa của chiếc tàu khách.", "eng": "The foaming white wake of the liner."}, {"viet": "Phần cuối buông lỏng của lá cờ đã bị gió làm rách.", "eng": "The free end of the flag has been torn by the wind."}, {"viet": "Băng đó đã dọa dần cho ông ấy một trận nếu ông ấy còn gây thêm rắc rối.", "eng": "The gang threatened to beat him to a pulp if he gave any more trouble."}, {"viet": "Con ma đã bị xua đuổi và sẽ không trở lại quấy nhiễu bà nữa.", "eng": "The ghost has been laid and will not return to haunt you again."}, {"viet": "Lý lẽ của chính phủ là trước hết họ phải nhằm đẩy lùi lạm phát.", "eng": "The Government's argument is that they must first aim to beat inflation."}, {"viet": "Chính phủ phải tiến hành một số cuộc bầu cử phụ trong những tháng sắp đến.", "eng": "The government has to fight several by-elections in the coming months."}, {"viet": "Chính phủ sẽ giúp đỡ tài chính để xây dựng những con đường mới.", "eng": "The government will finance the building of the new roads."}, {"viet": "Cảnh chướng mắt của một lão già cố tán tỉnh một thiếu nữ.", "eng": "The grotesque sight of an old man trying to flirt with a young girl."}, {"viet": "Vực thẳm ngăn cách người giàu và người nghèo.", "eng": "The gulf between the rich and the poor."}, {"viet": "Cơn mưa to đã biến sân bóng thành chỗ lầy lội.", "eng": "The heavy rain had turned the pitch into a quagmire."}, {"viet": "Con ngựa cụp hai tai lại.", "eng": "The horse laid back its ears."}, {"viet": "Ngôi nhà có một tầm nhìn quang cảnh đẹp.", "eng": "The house commands a fire view."}, {"viet": "Tiếng trò chuyện rì rầm ở phòng bên.", "eng": "The hum of conversation in the next room."}, {"viet": "Sự việc xảy ra làm tăng thêm tình trạng căng thẳng giữa hai nước.", "eng": "The incident has further increased the tension between the two countries."}, {"viet": "Trong phần thứ ba của bản hoà tấu, tiếng kèn nổi bật liên tục.", "eng": "The insistent horn phrase in the third movement of the symphony."}, {"viet": "Những cái bình này chứa các dung tích chất lỏng khác nhau.", "eng": "The jars hold different volumes of liquid."}, {"viet": "Tiệc mừng Giáng Sinh của học sinh phổ thông cấp I vào thứ Ba.", "eng": "The juniors'Christmas party is on Tuesday."}, {"viet": "Sự thiếu riêng tư trong một văn phòng không vách ngăn.", "eng": "The lack of privacy in an open-plan office."}, {"viet": "Luật pháp phân định rõ giữa giết người cố ý và vô ý.", "eng": "The law discriminate between accidental and intentional killing."}, {"viet": "Bức thư gửi cho người chiếm cứ căn nhà này.", "eng": "The letter was addressed to the occupier of the house."}, {"viet": "Danh mục dưới đây mới là câu trả lời đúng.", "eng": "The list below gives the right answer."}, {"viet": "Cặp tình nhân đang nhìn nhau say đắm qua cái bàn.", "eng": "The lovers were making sheep's eyes at each other over the table."}, {"viet": "Cái mỏ màu cam của con đực là điểm phân biệt với con cái.", "eng": "The male's orange beak differentiates it from female."}, {"viet": "Các đội kèn sáo và ban nhạc của vài trung đoàn tập trung lại.", "eng": "The massed pipes and bands of several regiments."}, {"viet": "Cuộc họp vào ngày thứ năm 23 tháng 4.", "eng": "The meeting is on Thursday the twenty-third of April."}, {"viet": "Trí óc của trẻ em thì hoàn toàn dễ uốn nắn.", "eng": "The mind of a young child is quite plastic."}, {"viet": "Đơn vị tiền tệ của Anh là đồng pao.", "eng": "The monetary unit of Great Britain is the pound."}, {"viet": "Bản kiến nghị đã được thông qua bằng một đa số 6 phiếu.", "eng": "The motion was carried by a majority of six votes."}, {"viet": "Sự chờ đợi một cách lo lắng để nhận bản án.", "eng": "The nail bitting waits for the verdict."}, {"viet": "Chiếc máy tính mới gây ( cho chúng tôi ) lắm chuyện rắc rối.", "eng": "The new computer's been giving ( us ) a lot of trouble."}, {"viet": "Quá trình mới nên đặc biệt có lợi cho những công ty nhỏ.", "eng": "The new process should be particularly advantageous to small companies."}, {"viet": "Tin tức vẫn buồn thảm như trước.", "eng": "The news was as dismal as ever."}, {"viet": "Mũi, lưỡi và tay là những bộ phận của cơ thể.", "eng": "The nose, tongue and arms are members of the body."}, {"viet": "Biển ở Okinawa thật trong suốt.", "eng": "The ocean in Okinawa is crystal clear."}, {"viet": "Bà cụ ngồi ngủ gà ngủ gật bên lò sưởi.", "eng": "The old lady sat nodding by the fire."}, {"viet": "Sự nghiện xem tivi suốt ngày.", "eng": "The opiate of all-day television."}, {"viet": "Gói hàng đó đã bị người phát hàng cẩu thả dằn lên dằn xuống.", "eng": "The package was mauled by the careless messenger."}, {"viet": "Đảng đó có thể đứng vào hàng ngũ với đảng Lao Động trong một liên minh mới.", "eng": "The party may realign itself with Labour in the new coalition."}, {"viet": "Ở đây ngày lĩnh lương luôn là ngày đầu tiên của tháng.", "eng": "The payday here is always every 1st of the month."}, {"viet": "Sự tiêu thụ xăng của một chiếc ô tô lớn là rất nhiều.", "eng": "The petrol consumption of the big car was very high."}, {"viet": "Viên phi công đã tái liên lạc được với đài kiểm soát.", "eng": "The pilot renewed contact with the control tower."}, {"viet": "Chiếc máy bay đó chạy dọc theo đường băng.", "eng": "The plane was taxiing along the runway."}, {"viet": "Phần sân chơi được phân ranh bằng một vạch trắng.", "eng": "The playing area is demarcated by a white line."}, {"viet": "Cảnh sát không đến gần chiếc xe bỏ lại, sợ có đặt bẫy mìn ở trong đó.", "eng": "The police did not go near the abandoned car, fearing it was a booby trap."}, {"viet": "Cảnh sát lùng sục khắp làng để tìm tên tội phạm vượt ngục.", "eng": "The police scoured the village for the escaped criminal."}, {"viet": "Buổi hòa nhạc pop đã được tổ chức ở sân vận động.", "eng": "The pop concert was mounted in a sports stadium."}, {"viet": "Cánh đồng Bắc Mỹ là một vùng trồng lúa mì quan trọng.", "eng": "The prairie of North American is an important region."}, {"viet": "Tổng thống đã phủ quyết những vụ cắt giảm thuế.", "eng": "The President vetoed the tax cuts."}, {"viet": "Vị Thủ tướng đích thân đến tham dự phiên họp.", "eng": "The Prime Minister made a personal appearance at the meeting."}, {"viet": "Vấn đề không có kiến thức cơ bản về toán và mù chữ trong giới trẻ.", "eng": "The problem of innumeracy and illiteracy among young people."}, {"viet": "Các Tông đồ trong kinh Cựu ước.", "eng": "The Prophets of the Old Testament."}, {"viet": "Việc mua hàng phải trả bằng tiền mặt.", "eng": "The purchases were paid for with cash."}, {"viet": "Những người cấp tiến có thể chiếm ưu thế hơn trong chính phủ.", "eng": "The radicals might predominate in the government."}, {"viet": "Cuộc nổi loạn đã bị quân chính phủ đập tan.", "eng": "The rebellion was crushed by government forces."}, {"viet": "Tiền thuê phải được trả trước.", "eng": "The rent is payable in advance."}, {"viet": "Các kết quả của cuộc khảo sát và những quyết định tiếp theo dựa trên cơ sở đó.", "eng": "The results of the survey and subsequent decisions based thereon."}, {"viet": "Sông tràn nước cho đến khi các phố phường ngập lụt.", "eng": "The river overflowed until the streets were awash."}, {"viet": "Mái nhà thờ được đỡ bằng những cột đá.", "eng": "The roof of the church was supported by stone pillars."}, {"viet": "Vận động viên chạy phải dừng lại để thở lấy hơi.", "eng": "The runner had to stop and regain her wind."}, {"viet": "Vụ bê bối đó dẫn tới sự sụp đổ của gia đình.", "eng": "The scandal led to the family's downfall."}, {"viet": "Tiếng chân chạy vội vàng ở căn phòng trên.", "eng": "The scurry of feet in the room above."}, {"viet": "Viên trung sĩ yêu cầu cấp dưới tuân lệnh.", "eng": "The sergeant expects that his men will obey him."}, {"viet": "Con tàu lấy lại đúng hướng sau khi con sóng to đã đi qua.", "eng": "The ship righted itself after the big wave had passed."}, {"viet": "Bờ biển thoai thoải dần ra tới biển.", "eng": "The shore shelves down to the sea."}, {"viet": "Tình hình đó không thể cứu vãn nổi.", "eng": "The situation could not be remedied."}, {"viet": "Tuyết đã đóng thành đống bên cạnh chuồng gia súc.", "eng": "The snow has banked up against the shed."}, {"viet": "Sự bẩn thỉu của những khu sinh sống của những người ấy.", "eng": "The sordidness of the men's living quarters."}, {"viet": "Sự quay tròn của trái đất làm cho mặt trời mọc và lặn.", "eng": "The spinning of the earth makes the sun rise and set."}, {"viet": "Bánh nhân thịt hôm nay hết rồi.", "eng": "The steak pie is off today."}, {"viet": "Sức mạnh của đồng đô la đang gây ra mối lo lắng lớn lao trên thị trường chứng khoán.", "eng": "The strength of the dollar is causing considerable disquiet on the Stock Exchange."}, {"viet": "Cái va li sẽ mang đầy đủ quần áo cho một tuần.", "eng": "The suitcase will carry enough clothes for a week."}, {"viet": "Các cuộc thương lượng đã đi đến chỗ cắt giảm khối lượng tên lửa.", "eng": "The talks resulted in reducing missile reduction."}, {"viet": "Các thầy giáo cho phép một học sinh tham dự cuộc họp của họ.", "eng": "The teachers allowed a pupil to sit in on their meeting."}, {"viet": "Bọn khủng bố đã đào tẩu qua biên giới.", "eng": "The terrorists escaped over the border."}, {"viet": "Tiếng tích tắc của một đồng hồ to để đứng phát ra khi cánh tay móc vào một bánh xe rồi sau đó nhả ra một cách đều đặn.", "eng": "The ticktock of the grandfather clock is made as the arm catches one wheel time after time and then lets it go."}, {"viet": "Thành phố cách chúng ta hai dặm về phía đông.", "eng": "The town lies about two miles to the east of us."}, {"viet": "Các cây ở đằng kia cao vút lên bầu trời.", "eng": "The tree over there is scraping the sky."}, {"viet": "Hai cô gái gầm gừ nhau rồi bắt đầu đánh nhau.", "eng": "The two dolls snarled at each other and then started to fighting."}, {"viet": "Sự thảo luận chính trị dốt nát mà anh nghe thấy ở các quán rượu.", "eng": "The uninformed political discussion you hear in pubs."}, {"viet": "Tầm rộng rãi của tài năng thi ca của ông ấy.", "eng": "The vast diapason of his poetic talent."}, {"viet": "Cung cách của những người hầu bàn bao giờ cũng xun xoe, nịnh nọt.", "eng": "The waiters'manners are always so smarmy."}, {"viet": "Chắc chắn ngày mai thời tiết sẽ khá hơn.", "eng": "The weather is bound to get better tomorrow."}, {"viet": "Người quả phụ và những đứa con sống thật là khốn khổ.", "eng": "The widow and children are very poorly off."}, {"viet": "Từ clock trong tiếng Anh xuất phát từ tiếng Pháp cloche, có nghĩa là chuông.", "eng": "The word clock comes from the French word cloche, which means bell."}, {"viet": "Chiếc du thuyền không kéo buồm vì gió không đủ mạnh.", "eng": "The yacht wasn't under sail because the wind wasn't strong enough."}, {"viet": "Sự đính hôn của họ là chuyện bàn tán của cả thành phố.", "eng": "Their engagement is the talk of the town."}, {"viet": "Tiền tiết kiệm của họ bị hao mòn dần đến không còn gì.", "eng": "Their savings have dwindled to nothing."}, {"viet": "Sau đó họ sẽ thấy một cột nước nhỏ, dần dần mỗi lúc mỗi cao hơn.", "eng": "Then they will see a little sprout of water, which gradually rises higher and higher."}, {"viet": "Đang chuẩn bị một kế hoạch để đặt một xa lộ chạy qua công viên.", "eng": "There's a scheme afoot to put a motorway through the park."}, {"viet": "Không có đủ nhân sự chuyên môn để bố trí làm việc ở tất cả các bệnh viện.", "eng": "There's not enough qualified manpower to staff all the hospitals."}, {"viet": "Trong ngăn kéo của tủ cạnh giường có bàn chải nhỏ đánh bóng giày.", "eng": "There are compact shoe shiners in the drawer of the night stand."}, {"viet": "Có nhiều ngôn ngữ khác biệt ở mỗi nước Châu Phi.", "eng": "There are several distinct languages in every African country."}, {"viet": "Có một sự lộn xộn ngoài đường phố.", "eng": "There has been a disturbance in the street."}, {"viet": "Ngày nay trên tivi chiếu nhiều cảnh bạo lực.", "eng": "There is a lot of violence on television these days."}, {"viet": "Máy điều hoà nhiệt độ không toả ra hơi ấm.", "eng": "There is no warm air coming out of the air-conditioner."}, {"viet": "Than ôi, thật không thiếu những vụ ám sát.", "eng": "There was, alas, no shortage of assassinations."}, {"viet": "Có một cuộc tổ chức ăn mừng lớn khi đứa bé ra đời.", "eng": "There was great celebration when baby was born."}, {"viet": "Có nhiều người tại bữa tiệc.", "eng": "There were quite a few people at the party."}, {"viet": "Các hóa chất hòa tan trong nước trong cơ thể của chúng.", "eng": "These chemicals are dissolved in some of the water in their bodies."}, {"viet": "Những người này chỉ quan tâm đến việc kiếm tiền.", "eng": "These people are just interested in making money."}, {"viet": "Người ta đang khoan một đường hầm mới dưới sông Thames.", "eng": "They're drilling a new tunnel under the Thames."}, {"viet": "Người ta khâm phục cách bà ấy giải quyết cuộc khủng hoảng.", "eng": "They admired the way she dealt with the crisis."}, {"viet": "Họ là những người chính thức cung cấp quần áo trẻ em cho trường học.", "eng": "They are the official school outfitters."}, {"viet": "Họ tiến hành nhiều nghiên cứu về ung thư.", "eng": "They carry out much research on cancer."}, {"viet": "Họ nói thiên tài gắn chặt với sự điên rồ.", "eng": "They do say genius is closely allied to madness."}, {"viet": "Họ đã đón tiếp ông Thủ tướng lạnh nhạt.", "eng": "They gave the Prime Minister a cool reception."}, {"viet": "Họ đã thề trung thành với nhà vua.", "eng": "They have sworn allegiance to the crown."}, {"viet": "Họ bắt anh ấy thanh toán số tiền anh ta đã nợ.", "eng": "They made him pony up the money he owed."}, {"viet": "Họ đặt đứa bé vào trong lồng oxy khi nó khó thở.", "eng": "They placed the child in an oxygen tent when he had difficulty in breathing."}, {"viet": "Họ tiết kiệm tiền dần dần cho tới khi đủ tiền mua một ngôi nhà mới.", "eng": "They saved money bit by bit until they had enough money to buy a new house."}, {"viet": "Sau đó, họ được tin là nó đã rời khỏi đất nước.", "eng": "They subsequently heard he had left the country."}, {"viet": "Chúng nó đã làm mọi điều phi lý để giữ bí mật sự việc.", "eng": "They went to absurd lengths to keep the affair secret."}, {"viet": "Họ đang mưu tính lật đổ chính phủ.", "eng": "They were plotting the overthrow of the government."}, {"viet": "Hãy suy nghĩ cẩn thận trước khi từ chức, nếu làm thế, anh sẽ không quay lại được nữa đâu.", "eng": "Think carefully before you resign-if you do that you will have burnt your boats."}, {"viet": "Cái danh thiếp này vừa vặn với chiếc phong bì kia.", "eng": "This card just fits nicely into that envelope."}, {"viet": "Bác sĩ này làm thay đột xuất cho đồng nghiệp bị ốm bảo hiểm ( cho trường hợp tổn thất, tai nạn, v. v. ).", "eng": "This doctor provides emergency cover ( for sick colleagues ) cover ( against sth )."}, {"viet": "Khoá học dẫn luận này sẽ có giá trị đối với những người không có kinh nghiệm trước đây về máy tính như một sự chuẩn bị làm tăng sự tin tưởng cho khoá học sau này.", "eng": "This introduction course will be of value to anyone without prior experience of computing, serving as a confidence-building preparation prior to further training."}, {"viet": "Đây là bức tranh duy nhất theo phong cách này mà chúng tôi có.", "eng": "This is the only painting in this style that we have."}, {"viet": "Thứ thuốc này sẽ giúp cô ấy chóng bình phục.", "eng": "This medicine will help speed her recovery."}, {"viet": "Nơi này dường như thân quen với tôi-tôi nghĩ trước kia tôi đã từng đến đây.", "eng": "This place seems familiar to me-I think I've been here before."}, {"viet": "Chiếc váy này cần chiết lại ở eo.", "eng": "This skirt needs letting in at the waist."}, {"viet": "Đây là một thủ đoạn láu cá nhằm đánh lừa những người theo đuổi anh ta.", "eng": "This was a crafty manoeuvre to outwit his pursuers."}, {"viet": "Hàng ngàn từ tiếng Anh bắt nguồn từ tiếng Latinh.", "eng": "Thousands of English words derive from Latin."}, {"viet": "Tom hình dung ngôi nhà như một cảnh điêu tàn thơ mộng.", "eng": "Tom visualized the house as a romantic ruin."}, {"viet": "Những người lãnh đạo công đoàn đã tuyên bố là một số đoàn viên đã bị trừng phạt do tham gia vào cuộc đình công.", "eng": "Union leaders claimed that some members had been victimized for taking part in the strike."}, {"viet": "Thật là một việc bối rối cho tôi khi phải nói với anh ấy là anh ấy sắp chết.", "eng": "Was my painful duty to tell him he was dying."}, {"viet": "Chúng ta phải sửa sang ngôi nhà cho tử tế trước khi bán.", "eng": "We'll have to bring the house up to scratch before we sell it."}, {"viet": "Chúng tôi đang có những khó khăn bước đầu với máy tính.", "eng": "We're having a few teething troubles with the new computer."}, {"viet": "Chúng tôi đã sống cùng cực nhiều tuần nay rồi.", "eng": "We've been living on the breadline for weeks."}, {"viet": "Chúng tôi hoàn toàn nhất trí với tuyên bố của ngài.", "eng": "We accept your statement without reserve."}, {"viet": "Gần như suốt năm chúng tôi là hướng dẫn viên.", "eng": "We are guides most of the year."}, {"viet": "Chúng tôi cho rằng nhu cầu sút kém ở hải ngoại là nguyên nhân thất bại của xe ô tô này.", "eng": "We blame poor overseas demand for the car's failure."}, {"viet": "Chúng tôi không thể ủng hộ ông Tổng thống tiếp tục ở lại chức vụ được nữa.", "eng": "We can no longer support the President's continuance in office."}, {"viet": "Chúng tôi rất sẵn lòng đổi tiền mặt cho ông.", "eng": "We'd be glad to cash it for you."}, {"viet": "Chúng tôi ước tính thu nhập của ông ta vào khoảng 8000 pao một năm.", "eng": "We estimated his income to be about 8000 pounds a year."}, {"viet": "Chúng tôi đã có một chương trình đầy ắp cho chuyến đi.", "eng": "We had a very crowded schedule on the trip."}, {"viet": "Chúng tôi hầu như không đủ tiền để sống.", "eng": "We have barely enough money to live on."}, {"viet": "Chúng ta phải sàng lọc kỹ các đơn xin việc để phân biệt được vàng thau.", "eng": "We have to sift through the application forms very carefully to separate the wheat from the chaff."}, {"viet": "Mẹ con em thích khóc vì những câu chuyện buồn.", "eng": "We like to cry about sad stories."}, {"viet": "Bằng bất cứ giá nào, chúng ta phải ngăn chặn không để cho họ biết gì về kế hoạch.", "eng": "We must at all costs prevent them from finding out about the plan."}, {"viet": "Chúng ta cần một giám đốc mới để sắp xếp công việc kinh doanh vào nền nếp.", "eng": "We need a new manager to get the business into shape."}, {"viet": "Chúng tôi quyên góp được 100 pao, nhưng chúng tôi cần 250 pao, như thế là thiếu hụt 150 pao.", "eng": "We raised 100 pounds, and we need 250 pounds, that's a deficit of 150 pounds."}, {"viet": "Chúng ta đúng là phải chờ xem, không có việc gì có thể làm vào lúc này.", "eng": "We shall just have to wait and see, there's nothing we can do at the moment."}, {"viet": "Chúng tôi hoàn toàn hiểu nhau ngay dù không phải lúc nào chúng tôi cũng đồng ý với nhau.", "eng": "We thoroughly understand each other, even if we don't always agree."}, {"viet": "Chúng tôi đã đến Ely, một thị trấn gần Cambridge.", "eng": "We went to Ely, which is a town near Cambridge."}, {"viet": "Chúng tôi đang ngột ngạt trong căn phòng nóng nực đóng kín các cửa sổ đó.", "eng": "We were stifling in that hot room with all the windows closed."}, {"viet": "Những người giàu có khả năng thuê gia sư để dạy con cái họ ở nhà.", "eng": "Wealthy people can afford to engage a governess to teach their children at home."}, {"viet": "À, tôi tự hỏi sự khác nhau giữa tranh mực Tàu và tranh sơn dầu phương Tây là gì nhỉ?", "eng": "Well, I wonder what is the difference between the Chinese ink painting and Western oil painting?"}, {"viet": "Khi tôi đi vắng, có ai gọi điện cho tôi không?", "eng": "Were there any calls for me while I was out?"}, {"viet": "Còn cái máy dùng để cộng những con số là gì?", "eng": "What about that thing for adding numbers?"}, {"viet": "Anh đi tới kết luận như thế nào?", "eng": "What conclusions did you come to draw?"}, {"viet": "Dù sao đi nữa bạn còn biết sài tiền vào việc khác nữa?", "eng": "What else would you spend your money on anyway?"}, {"viet": "Độ dài cho áo khoác là bao nhiêu?", "eng": "What is the fashionable length for coats?"}, {"viet": "Anh muốn em mua loại trái cây và rau gì?", "eng": "What kind of fruit and vegetables do you want me to get?"}, {"viet": "Ở nước bạn, những người bị khuyết tật và có bệnh tâm thần được cung cấp những dịch vụ gì?", "eng": "What services are provided for people with physical and mental disabilities in your country?"}, {"viet": "Điều anh vừa nói không nhất quán với cách anh nói với chúng tôi hôm qua.", "eng": "What you have just said does not accord with what you told us yesterday."}, {"viet": "Khi không còn tiền, ông chủ trại đôi khi trả công tôi bằng hiện vật, thí dụ bằng một bao tải khoai tây.", "eng": "When he had no money, the farmer sometimes used to pay me in kind."}, {"viet": "Khi trời mưa vào ngày cưới của họ, cô ấy cho rằng đó là một điềm xấu.", "eng": "When it rained on their wedding day she tool it as a bad omen."}, {"viet": "Khi mẹ chúng đau, tất cá con cái tập hợp chung quanh bà.", "eng": "When their mother was ill, the children all rallied around."}, {"viet": "Thằng con vô tích sự ấy của ông đâu rồi?", "eng": "Where's that good-for-nothing son of yours?"}, {"viet": "Ở mọi nơi cô ấy đến, đều có các đám đông chờ đón để gặp cô.", "eng": "Wherever she goes, there are crowds of people waiting to see her."}, {"viet": "Cô đã học ở trường nào?", "eng": "Which school did you go to?"}, {"viet": "Tôi có thể nói là ai đang gọi vậy?", "eng": "Who can I say is calling?"}, {"viet": "Tại sao bạn chọn màu hồng nhạt?", "eng": "Why did you choose the light pink?"}, {"viet": "Tại sao tôi phải thức dậy vào cái giờ kì quái này?", "eng": "Why should I get up at this unearthly hour?"}, {"viet": "Vui lòng tự lấy bánh dùng nhé?", "eng": "Will you help yourself to some cake?"}, {"viet": "Anh ấy vặn một cái mạnh làm long chiếc quai.", "eng": "With a violent twist, he wrenched off the handle."}, {"viet": "Đích thân ông giám đốc giám sát công việc làm.", "eng": "Work done under the personal superintendency of the manager."}, {"viet": "Ông có muốn tôi cho ông xem món hàng nào không ạ?", "eng": "Would you like me to show you anything?"}, {"viet": "Xin mời ông đi lối này?", "eng": "Would you please come this way?"}, {"viet": "Những năm phóng đãng đã huỷ hoại sức khoẻ của hắn.", "eng": "Years of dissipation had ruined his health."}, {"viet": "Vâng, giá vé tương tự như giá vé hạng thường.", "eng": "Yes, the fare is the same as economy."}, {"viet": "Anh sẽ thấy giám đốc là một người rất dễ tiếp xúc.", "eng": "You'll find the director a very approachable person."}, {"viet": "Anh càng có nhiều nhược điểm thì anh càng dễ bị xúc phạm.", "eng": "You're more vulnerable, more easily hurt."}, {"viet": "Anh lúc nào cũng tìm thức ăn, phải vậy không?", "eng": "You always look for the food, don't you?"}, {"viet": "Anh không thể bào chữa được việc anh lơ là vợ con anh.", "eng": "You can't justify neglecting your wife and children."}, {"viet": "Ông có thể giữ số tiền này làm tiền túi.", "eng": "You can keep this for pocket money."}, {"viet": "Bạn sẽ nhớ ra nếu bạn gặp cô ta.", "eng": "You'd remember if you met her."}, {"viet": "Anh đã không hiểu, cho phép tôi được giải thích.", "eng": "You have not understood, allow me to elucidate."}, {"viet": "Trông bạn như vừa thấy ma hiện hình hay sao ấy.", "eng": "You look as though you've seen an apparition."}, {"viet": "Anh phải chú ý hết sức đến việc anh đang làm.", "eng": "You must give your full attention to what you are doing."}, {"viet": "Anh không bao giờ có thể biết được cô ta sẽ phản ứng ra sao: cô ta là con người không thể đoán trước.", "eng": "You never know how she'll react: She's so unpredictable."}, {"viet": "Anh đừng có bao giờ mua xe hơi mà lại không xem kỹ trước.", "eng": "You should never buy a car sight unseen."}, {"viet": "Ông hãy đi trên đại lộ Sherman cho đến khi gặp một bến xe buýt.", "eng": "You walk up Sherman Avenue until you come to bus stop."}, {"viet": "Ranh con! Mày đã lấy cuốn sách tao cần dùng.", "eng": "You wretch! You've taken the book I wanted."}, {"viet": "Số tiền của anh sẽ giúp tôi cho đến thứ sáu.", "eng": "Your money will tide me over until Friday."}]