[{"viet": "Một đứa bé không hiểu biết về thiện và ác.", "eng": "A baby has no knowledge of good and evil."}, {"viet": "Da mới của sâu bướm có thể hơi khác với màu của da cũ lúc nó vừa mới bò ra.", "eng": "A caterpillar's new skin may be quite different in color from the old skin it just crawled out of."}, {"viet": "Một ủy ban giám sát việc thi hành các điều lệ mới.", "eng": "A committee to police the new regulations."}, {"viet": "Sự phung phí vô lương tâm tiền của công.", "eng": "A criminal waste of public money."}, {"viet": "Sự bất đồng ý kiến về cách tốt nhất để tiến hành công việc.", "eng": "A disagreement over the best way to proceed."}, {"viet": "Một hàng rào chia cắt hai khu nhà đất.", "eng": "A fence divides the two properties."}, {"viet": "Một đứa trẻ cầu bơ cầu bất ngồi ở góc phố.", "eng": "A forlorn child sitting on the street corner."}, {"viet": "Một băng thu hình rõ về nhạc kịch.", "eng": "A good recording of the opera on video."}, {"viet": "Một cuộc hôn nhân hạnh phúc, trời cho sáu đứa con.", "eng": "A happy union, blessed with six children."}, {"viet": "Một miếng bánh mì, phó mát, thịt to.", "eng": "A hunk of bread, cheese, meat."}, {"viet": "Một luật sư đã cam đoan sẽ đảm nhận việc bán ngôi nhà đó ngay tức khắc.", "eng": "A lawyer engaged to undertake the sale of the house immediately."}, {"viet": "Nhiều người làm việc trong quân đội sống ở thành phố này.", "eng": "A lot of army personnel live in the town."}, {"viet": "Một người cố vấn về hôn nhân cố gắng không phán đoán về mặt đạo đức.", "eng": "A marriage counsellor who tries not to be judgmental."}, {"viet": "Một phim với các nhân vật mà khán giả rất dễ quên.", "eng": "A movie with very forgettable characters."}, {"viet": "Một cuộc trình diễn đáng chú ý bởi một ca sĩ đơn ca trẻ.", "eng": "A noteworthy performance by a young soloist."}, {"viet": "Một cuộc trình diễn xuất sắc vở kịch.", "eng": "A perfect performance of the play."}, {"viet": "Một bài thơ ca tụng công chúa.", "eng": "A poem of eulogy to the princess."}, {"viet": "Một chương trình Tổng thống tìm cách loại bỏ.", "eng": "A program the President sought to scuttle."}, {"viet": "Một dịch vụ xe buýt phụ được cung cấp để chuyên chở thêm hành khách.", "eng": "A relief coach service was provides to carry the extra passengers."}, {"viet": "Một vụ bán những hàng hóa bị bám bụi với giá giảm một nửa.", "eng": "A sale of shop-soiled goods at half price."}, {"viet": "Một lưỡi dao lam sắc cạo nhẵn thín.", "eng": "A sharp razor gives a close shave."}, {"viet": "Một cái vỏ ốc sên có hình xoáy ốc.", "eng": "A snail's shell is spiral in form."}, {"viet": "Một tình trạng uể oải vì cái nóng nhiệt đới.", "eng": "A state of torpor induced by the tropical heat."}, {"viet": "Một câu chuyện về cuộc phiêu lưu giang hồ trên biển cả.", "eng": "A swashbuckling tale of adventure on the high seas."}, {"viet": "Một chuyến công tác ba năm với tư cách diễn giả ở Nigeria.", "eng": "A tour of three years as a lecturer in Nigeria."}, {"viet": "Một sự xem xét tỉ mỉ một vấn đề.", "eng": "A voyage of exploration of a subject."}, {"viet": "Một nhà văn không được quá tự ái với những lời phê bình.", "eng": "A writer mustn't be too sensitive to criticism."}, {"viet": "Hành động vi phạm hiệp ước lộ liễu.", "eng": "Act in open violation of a treaty."}, {"viet": "Sau một cuộc thảo luận dài, nghị viện đã biểu quyết.", "eng": "After a long debate the House divided."}, {"viet": "Sau nhiều khó khăn và đình hoãn, cuối cùng con tàu cũng đã sẵn sàng hạ thủy.", "eng": "After many difficulties and postponements, the ship was ready for launching."}, {"viet": "Sau cơn bão mọi con sông đều ngập lũ.", "eng": "After the storm all the rivers were in spate."}, {"viet": "Tất cả năm người đàn ông kia là những công nhân cần mẫn.", "eng": "All five men are hard workers."}, {"viet": "Tất cả các màu từ đỏ đến tím.", "eng": "All the colours from red to violet."}, {"viet": "Các thung lũng dãy núi Alps vang rền các tiếng chuông giáo đường.", "eng": "Alpine valleys resonant with the sound of church bells."}, {"viet": "Một giọng nói đặc biệt của phía bắc miền đó.", "eng": "An accent peculiar to the north of the region."}, {"viet": "Một cuộc tấn công của ba trung đoàn xe tăng.", "eng": "An attack by three tank regiments."}, {"viet": "Một trích đoạn từ một bài thơ dài.", "eng": "An extract from a long poem."}, {"viet": "Một máy hát kiểu cổ vặn dây cót để cho chạy.", "eng": "An old-fashioned wind-up gram-phone."}, {"viet": "Phân tích một câu thành những thành phần tạo câu.", "eng": "Analyse the sentence into its constituent parts."}, {"viet": "Anne Boleyn bị chém đầu vào năm 1536.", "eng": "Anne Boleyn was beheaded in 1536."}, {"viet": "Đã phủ một chất bảo vệ lên gỗ tươi.", "eng": "Applied a protestant to the raw wood."}, {"viet": "Cô là người yêu thích khiêu vũ phải không?", "eng": "Are you a lover of dancing?"}, {"viet": "Thưa ông, bây giờ ông sẵn sàng gọi món ăn chưa ạ?", "eng": "Are you ready to order now, sir?"}, {"viet": "Thật ra là tôi vừa nhận được một đơn đặt hàng khá lớn, và chính vì việc đó mà hôm nay tôi đến đây.", "eng": "As a matter of fact I've just received quite a big order, and it's about this work that I'm here today."}, {"viet": "Ngay khi họ vừa gặp lại nhau, tình yêu ngủ yên trong anh ta lại trỗi dậy.", "eng": "As soon as they met again his dormant love for her rekindled."}, {"viet": "Với vận tốc 50km một giờ.", "eng": "At a speed of fifty kilometres an hour."}, {"viet": "Chuyến bay 109 khởi hành tại cổng số mấy?", "eng": "At which gate does flight 109 leave?"}, {"viet": "Ngân hàng không mở cửa ngày Chủ Nhật.", "eng": "Banks don't open on Sundays."}, {"viet": "Gặp khó khăn ở một nước ngoài mà không có hộ chiếu trong người của mình.", "eng": "Be left stranded in a foreign country without one's passport."}, {"viet": "Beethoven được coi như là một trong những danh nhân bất tử về nhạc cổ điển.", "eng": "Beethoven is regarded as one of the immortals of classical music."}, {"viet": "Mấy thằng lớn xúm lại hiếp đáp bọn nhỏ hơn.", "eng": "Bigger boys ganging up on smaller."}, {"viet": "Đã mua một số hàng chế tạo tại cửa hàng địa phương.", "eng": "Bought some made goods at the local store."}, {"viet": "Xây nhà mới để giãn dân ở Luân Đôn.", "eng": "Build new houses for London's overspill."}, {"viet": "Nhưng tôi nghĩ bóng đá là một môn chơi quá căng thẳng đối với phụ nữ.", "eng": "But I think football is much too tough a game for women."}, {"viet": "Nhưng con không buồn lâu đâu.", "eng": "But you don't stay unhappy for a long time."}, {"viet": "À này, ở Trung Quốc có hồng trà không?", "eng": "By the way, is there any black tea in China?"}, {"viet": "Tôi có thể nhờ đổi một ít tiền của tôi ra nhân dân tệ được không?", "eng": "Can I have some of my money exchanged into Renminbi Yuan?"}, {"viet": "Tối mai bạn có thể đến ăn tối ở nhà chúng tôi được không.", "eng": "Can you come to dinner at our house tomorrow night."}, {"viet": "Bạn đọc được chữ hiragana hay katakana không?", "eng": "Can you read hiragana or katakana?"}, {"viet": "Anh không thể nghĩ ra cái cớ hay hơn thế sao?", "eng": "Can't you think up a better excuse than that?"}, {"viet": "Bị buộc tội phạm vi phạm an ninh công cộng.", "eng": "Charged with committing a public nuisance."}, {"viet": "Chép lại các sự kiện chiến tranh theo thứ tự thời gian.", "eng": "Chronicling the events of a war."}, {"viet": "Chải một nùi rối khỏi tóc mình.", "eng": "Comb a knot out of one's hair."}, {"viet": "Giảng hòa hai bên trong cuộc tranh cãi.", "eng": "Conciliate between the parties in a dispute."}, {"viet": "Copernicus đưa ra giả thuyết là trái đất và các hành tinh khác xoay quanh mặt trời.", "eng": "Copernicus hypothesized that the earth and the other planets went round the sun."}, {"viet": "Cô cho tôi xem bảng giá được không?", "eng": "Could you please show me the price list?"}, {"viet": "Băng qua đường từng người một-đừng có dồn lại.", "eng": "Cross the road one at a time-don't bunch up."}, {"viet": "Giải quyết những vấn đề này hoàn toàn tùy thuộc vào kinh nghiệm.", "eng": "Dealing with these problems is all a matter of experience."}, {"viet": "Dù cho được quảng cáo đủ cách, quyển tiểu thuyết mới nhất của bà ấy cũng thất bại hoàn toàn.", "eng": "Despite all the publicity, her latest novel was a complete flop."}, {"viet": "Anh có tìm ra câu trả lời đúng không?", "eng": "Did you get the answer right?"}, {"viet": "Đất đã được cán bằng phẳng.", "eng": "Dirt that had become ground into the surface."}, {"viet": "Không được dùng quá liều chỉ định.", "eng": "Do not exceed the recommended dosage."}, {"viet": "Cô kẹp đôi tai đó chưa?", "eng": "Do you clip those ear-rings on?"}, {"viet": "Bạn có bạn bè sống ở nước ngoài không?", "eng": "Do you have any friends that live overseas?"}, {"viet": "Anh có biết Napoleon là ai không?", "eng": "Do you know who Napoleon was?"}, {"viet": "Anh có thấy chỗ dưới đó không?", "eng": "Do you see that place down there?"}, {"viet": "Anh muốn ăn cơm hay bánh mì?", "eng": "Do you want a bowl of rice or bread?"}, {"viet": "Cuốn này giới thiệu đầy đủ các mặt hàng phải không?", "eng": "Does this show the full range?"}, {"viet": "Đừng chứa đầy trong tâm trí của bạn những sự kiện vô ích.", "eng": "Don't clog up your memory with useless facts."}, {"viet": "Đừng bắt chúng tôi hồi hộp thêm nữa.", "eng": "Don't keep us in suspense any longer."}, {"viet": "Đừng có tiêu xài nhiều quá như vậy-con cũng biết là tiền không dễ kiếm đâu.", "eng": "Don't spend so much-money doesn't grow on trees, you know."}, {"viet": "Đừng có hòng tránh né việc rửa chén bát nghe mày!", "eng": "Don't you dare try and get out of the washing-up!"}, {"viet": "Các loại thuốc kích thích hệ thần kinh.", "eng": "Drugs that excite the nervous system."}, {"viet": "Trứng được phân loại từ nhỏ đến cực lớn.", "eng": "Eggs are graded from small to extra-large."}, {"viet": "Những cuộc đua ngựa ở Thế vận hội Olympic.", "eng": "Equestrian events at the Olympic Games."}, {"viet": "Thời buổi này mọi người đều cố làm giàu một cách nhanh chóng.", "eng": "Everyone is trying to get rich quick nowadays."}, {"viet": "Xin lỗi vì đã giẫm lên chân ông.", "eng": "Excuse me for stepping on your foot."}, {"viet": "Nhiều gia đình bị ly tán do chiến tranh.", "eng": "Families torn asunder by the war."}, {"viet": "Năm nay đánh bắt được ít cá trích hơn thường lệ.", "eng": "Fewer herring than usual have been landed this year."}, {"viet": "Thứ nhất là nó quá đắt; thứ hai nữa là nó rất xấu.", "eng": "Firstly, it's too expensive; and secondly, it's very ugly."}, {"viet": "Fonteyn tượng trưng cho những truyền thống tốt đẹp nhất của môn múa ba lê.", "eng": "Fonteyn represents the best traditions of ballet."}, {"viet": "Thành lập số nhiều của danh từ bằng cách thêm s.", "eng": "Form the plural of a noun by adding s."}, {"viet": "Mò trong túi của ai để tìm vài đồng tiền.", "eng": "Fumble in one's pocket for some coins."}, {"viet": "Bị lôi cuốn vào một cuộc đánh nhau với ai.", "eng": "Get into a fight with somebody."}, {"viet": "Vỗ vào lưng người nào đó.", "eng": "Give somebody a slap on the back."}, {"viet": "Ăn ngấu nghiến thức ăn của mình một cách vội vã.", "eng": "Gobble one's food down in a hurry."}, {"viet": "Những vị khách không hài lòng với cách phục vụ.", "eng": "Guests are not satisfied with the service."}, {"viet": "Có phải xi nê đã thua kém truyền hình không?", "eng": "Has the cinema lost out to TV?"}, {"viet": "Bạn có bao giờ đến dự một lễ hội truyền thống nổi tiếng của Nhật chưa?", "eng": "Have you ever been to a famous Japanese traditional festival?"}, {"viet": "Bạn có kết bạn với nhiều người Nhật không?", "eng": "Have you made many Japanese friends?"}, {"viet": "Nó đang cười rồi sẽ phải mếu khi đọc bức thư này.", "eng": "He'll be laughing on the other side of his face when he reads this letter."}, {"viet": "Ông ấy luôn rất là gọn gàng, sạch sẽ, ông thấy đấy còn đẹp trai nữa.", "eng": "He's always so neat and clean and, well. handsome."}, {"viet": "Anh ấy dạy tiếng Pháp cho cô ta để cô dạy lại tiếng Anh.", "eng": "He's giving her French lessons in exchange for his teaching her English."}, {"viet": "Anh ta không giỏi lắm trong việc làm cho mọi người hiểu ý kiến của mình.", "eng": "He's not very good at getting his ideas across."}, {"viet": "Anh ta rất vụng về, lóng ngóng, anh ta liên tục đánh rơi mọi thứ.", "eng": "He's very awkward, he keeps dropping things."}, {"viet": "Anh ta và tôi là bạn thân ở trường.", "eng": "He and I were buddies at school."}, {"viet": "Hắn hay thay đổi ý kiến về chuyện lập gia đình.", "eng": "He blows hot and cold about getting married."}, {"viet": "Ông ấy không thể nắm được những thực tế của hoàn cảnh đó.", "eng": "He cannot grasp the realities of the situation."}, {"viet": "Anh ấy không thể bày tỏ những nỗi buồn của mình với bà mẹ.", "eng": "He could not express his feelings of sadness to his mother."}, {"viet": "Hắn đã làm chuyện đó bởi vì hắn không có sự lựa chọn nào khác.", "eng": "He did it because he had no other option."}, {"viet": "Nó uống một hơi hết một panh sữa.", "eng": "He drank a pint of milk in one go."}, {"viet": "Cậu ấy ngã và bị va đầu.", "eng": "He fell and hit his head."}, {"viet": "Anh ấy thấy rằng sự ồn ào của các nhà nhiếp ảnh làm anh không sao tập trung được.", "eng": "He found the noise of the photographers a distraction."}, {"viet": "Ông ta hưởng hết công trạng về vụ phát hiện đó.", "eng": "He got all the credit for the discovery."}, {"viet": "Ông ấy cần năm trăm Francs.", "eng": "He had need of five hundred francs."}, {"viet": "Nó có thái độ rất tiêu cực đối với công việc của nó.", "eng": "He has a very negative attitude to his work."}, {"viet": "Nó chỉ có một mục đích duy nhất trên đời-là trở nên giàu có.", "eng": "He has only one aim in life-to become rich."}, {"viet": "Ông ta giữ chức Giáo sư triết học ở trường Đại học Oxford.", "eng": "He holds the chair of philosophy at Oxford."}, {"viet": "Ông ấy sẽ cần được giúp một tay chuyển cái xô-pha mới đó vào nhà.", "eng": "He is going to need a hand moving in the new couch."}, {"viet": "Anh ấy là một con người rất thẳng thắn, thế nên bạn luôn luôn biết được những quan điểm thực sự của anh ấy.", "eng": "He is very direct, so you always know what his real views are."}, {"viet": "Trong các tác phẩm sau này của mình, anh ấy thiên về các chủ đề nhẹ nhàng hơn.", "eng": "He leans towards more lighthearted subjects in his later works."}, {"viet": "Anh ấy soi gương để xem chiếc cà vạt đã ngay ngắn chưa.", "eng": "He looked in the glass to check that his tie was straight."}, {"viet": "Ông ta sản xuất giấy chỉ để xuất khẩu.", "eng": "He manufactures paper for exportation only."}, {"viet": "Anh ta chẳng những đọc quyển sách đó, mà còn nhớ những gì anh ta đọc.", "eng": "He not only read the book, but also remembered what he read."}, {"viet": "Anh ta chơi ghita và cũng hát nữa.", "eng": "He plays the guitar and sings too."}, {"viet": "Anh ta bỏ giấy tờ sang bên, sau khi xem lướt qua.", "eng": "He put aside the papers after a cursory study."}, {"viet": "Nó đã nhận được tin đó bằng miệng.", "eng": "He received the news by word of mouth."}, {"viet": "Ông ta đứng lên để đón tiếp tôi.", "eng": "He rose in order to welcome me."}, {"viet": "Căn cứ vào những điều ông ấy đã chịu đựng thì ông ta đã vui vẻ một cách đáng kinh ngạc.", "eng": "He's amazingly cheerful considering all that he's gone through."}, {"viet": "Anh ấy phụ trách các xe tải chở xi măng.", "eng": "He's in charge of the cement trucks."}, {"viet": "Ông ta thật là bủn xỉn về tiền bạc.", "eng": "He's so mingy with his money."}, {"viet": "Ông ta ngồi đu đưa trong cái ghế của mình.", "eng": "He sat rocking himself in his chair."}, {"viet": "Nó cảm thấy các đề nghị của nó được hoan nghênh.", "eng": "He sensed that his proposals are welcome."}, {"viet": "Mặc cho sấm chớp hắn vẫn ngủ say như chết.", "eng": "He slept right through the thunderstorm."}, {"viet": "Hắn kể huyên thiên với chúng tôi cái câu chuyện không chắc có thực về vụ bị mắc kẹt hàng tiếng trong một cái thang máy hỏng.", "eng": "He spun us this unlikely yarn about being trapped for hours in a broken lift."}, {"viet": "Cậu ta gài vội cái bút sau tai.", "eng": "He stuck the pen behind his ear."}, {"viet": "Anh ta nghĩ rằng có thể thu phục được bạn bè mình bằng cách vung tiền bừa bãi.", "eng": "He thinks he can win friends by splashing his money about."}, {"viet": "Anh ấy tham gia nhiều môn thể thao ở trường.", "eng": "He took part in lots of sport at school."}, {"viet": "Anh ấy xoay chìa khóa trong ổ khóa.", "eng": "He turned the key in the lock."}, {"viet": "Anh ta đã muốn mua một cái đồng hồ đeo tay đắt tiền nhưng sau khi anh ta mất việc anh ta đã đổi ý.", "eng": "He wanted to buy an expensive watch but after he lost his job, he had a change of heart."}, {"viet": "Anh ta đang ngủ trưa thì bị chuông cửa đánh thức dậy.", "eng": "He was aroused from his nap by the doorbell."}, {"viet": "Nó dính líu vào tội ác.", "eng": "He was concerned in the crime."}, {"viet": "Anh ta lo lắng về bài nói của mình.", "eng": "He was getting all het-up over his speech."}, {"viet": "Ông ta đã bị thương tật trong một trận đánh thời chiến tranh thế giới thứ I.", "eng": "He was maimed in a First World War battle."}, {"viet": "Anh chàng đã hơi sàm sỡ với tôi.", "eng": "He was rather offhand with me."}, {"viet": "Nó đã bị gọi đến trước ông hiệu trưởng và buộc phải thú tội.", "eng": "He was taken before the headmaster and made to confess."}, {"viet": "Gặp chúng ta ông ấy chẳng vui lòng chút nào, thực tế là ông ta từ chối mở cửa.", "eng": "He wasn't exactly pleased to see us, in fact he refused to open the door."}, {"viet": "Sang năm ông ta sẽ rời khỏi chức vụ giám đốc.", "eng": "He will retire from his directorship next year."}, {"viet": "Ông ta viết báo cáo thay vì đọc ứng khẩu.", "eng": "He writes his report instead of dictating ad-lib."}, {"viet": "Hemingway thường sáng tác theo lối tự thuật.", "eng": "Hemingway often writes in the first person."}, {"viet": "Sự nghiệp của cô ấy cuối cùng đã dẫn đến việc bổ nhiệm cô ấy làm giám đốc.", "eng": "Her career culminated in her appointment as director."}, {"viet": "Quyết tâm kiên trì học tiếng Anh của cô ấy.", "eng": "Her dogged determination to learn English."}, {"viet": "Việc cô ta được nuôi dạy ở Pháp đã tạo ra một số lợi thế so với những sinh viên học cùng lớp.", "eng": "Her French upbringing gives her certain advantages over other students in her class."}, {"viet": "Động tác buồn tẻ của cô ấy trên sân khấu.", "eng": "Her inanimate movement when on the stage."}, {"viet": "Tâm trạng của cô ta thay đổi từ lạc quan đến chỗ cực kỳ chán nản.", "eng": "Her mood varied from optimism to extreme depression."}, {"viet": "Buổi trình diễn của cô ấy được hoan hô vang dội.", "eng": "Her performance was cheered to the echo."}, {"viet": "Thư ký của bà ta giải quyết tất cả các cuộc hẹn gặp.", "eng": "Her secretary took care of all her appointments."}, {"viet": "Thời thơ ấu xáo động của cô ta là một sự học hỏi duy nhất trong trường đời.", "eng": "Her tumultuous childhood was a unique schooling."}, {"viet": "Đây là thẻ chìa khoá của phòng 50.", "eng": "Here is the key card for 50."}, {"viet": "Lời thông báo của anh ta bị át trong tiếng ồn ào.", "eng": "His announcement was drowned in the tumult."}, {"viet": "Những câu trả lời xấc láo của nó làm những người phỏng vấn khó chịu.", "eng": "His brash answers annoyed the interviewers."}, {"viet": "Lòng dũng cảm của anh ấy đã được thử thách khắc nghiệt qua sự chịu đựng gian khổ của anh.", "eng": "His courage was severely tried by his ordeal."}, {"viet": "Thị lực của nó trở nên ngày càng tồi tệ.", "eng": "His eyesight is becoming progressively worse."}, {"viet": "Với cách dùng từ khá thoải mái, nhà để dụng cụ làm vườn của ông ta được gọi là biệt thự mùa hè.", "eng": "His garden shed which, with a certain amount of poetic license, he calls his summer-house."}, {"viet": "Sự quan tâm của ông ta được kích thích bởi một bài báo ông ta đã đọc.", "eng": "His interest was quickened by an article he had read."}, {"viet": "Những nhiệm vụ đơn giản do ông ta giao chẳng mấy lúc làm cho đám sinh viên chán ngán.", "eng": "His Mickey Mouse assignments soon bored the students."}, {"viet": "Bố mẹ của anh ta tỏ ra xét đoán quá vội vàng về bạn bè của anh ta.", "eng": "His parents tend to be quite judgmental about his friends."}, {"viet": "Lời từ chối của anh ta được diễn đạt bằng những lời lẽ hết sức lịch sự.", "eng": "His refusal was couched in very polite words."}, {"viet": "Tiếng nói của anh ấy líu nhíu: rõ ràng là anh ta đã quá chén.", "eng": "His speech was slurred: he'd clearly been drinking."}, {"viet": "Những cuộc gặp không có diễn văn soạn trước của ông ấy với báo chí.", "eng": "His unscripted encounters with the press."}, {"viet": "Kết thân với những người giàu có danh tiếng.", "eng": "Hobnob with the rich and famous."}, {"viet": "Khu nhà ở cho một người thường là được đặt nhiều hơn mức có thể.", "eng": "Hostels for single people are normally oversubscribed."}, {"viet": "Làm sao chúng có thể học được cái gì khi mà chúng bỏ cả thời gian rỗi để xem truyền hình?", "eng": "How can they learn anything when they spend all their spare time watching television?"}, {"viet": "Tạp chí của Mỹ và tạp chí của Nhật khác nhau như thế nào?", "eng": "How do American magazines and Japanese magazines differ?"}, {"viet": "Tỷ lệ thất nghiệp ở đất nước bạn là bao nhiêu?", "eng": "How high is the unemployment rate in your country?"}, {"viet": "Đảng Tự do đưa ra bao nhiêu ứng cử viên trong cuộc Tổng tuyển cử?", "eng": "How many candidates is the Liberal Party running in the General Election?"}, {"viet": "Có bao nhiêu người ở đó? Một trăm Thật ư? Ờ, gần số đó.", "eng": "How many were there? A hundred Really? Well, as near as dammit."}, {"viet": "Bao lâu bạn đi cắt tóc một lần?", "eng": "How often do you get your hair cut?"}, {"viet": "Sự khôi hài là vũ khí duy nhất của anh ta chống lại thái độ thù địch của họ.", "eng": "Humour was his only weapon against their hostility."}, {"viet": "Tôi muốn đổi yêu cầu đặt phòng vào thứ ba tuần tới.", "eng": "I'd like to change my reservation for next Tuesday."}, {"viet": "Tôi sẽ về nhà lúc 8 giờ hoặc khoảng đó.", "eng": "I'll be home at 8 o'clock or thereabouts."}, {"viet": "Vì em gái anh, tôi sẽ giúp anh.", "eng": "I'll help you for your sister's sake."}, {"viet": "Phiền ông chú ý đến cách xử sự của ông.", "eng": "I'll trouble you to watch your manners."}, {"viet": "Tôi bắt đầu thấy hết kiên nhẫn.", "eng": "I'm beginning to feel out of patience."}, {"viet": "Tôi sẽ chứng minh rằng anh sai, cho dù tốn kém đến mấy đi nữa.", "eng": "I'm going to prove you are wrong, no matter what it costs."}, {"viet": "Tôi không quan tâm tới những chuyện anh làm ngoài giờ làm việc.", "eng": "I'm not concerned with what you do outside working hours."}, {"viet": "Tôi chán cách đối xử tồi tệ của công ty.", "eng": "I'm sick of being buggered about by the company."}, {"viet": "Anh biết chắc là có mật ông trong tủ đựng thức ăn.", "eng": "I'm sure there's honey in the cupboard."}, {"viet": "Tôi đang viết một bài báo về cuốn phim này cho tờ báo ở địa phương.", "eng": "I'm writing up the film for the local paper."}, {"viet": "Tôi đã mua hai chiếc bánh-anh có thể lấy một trong hai chiếc đó.", "eng": "I've bought two cakes-you can have either."}, {"viet": "Tôi nghe nói đó là một nơi rất sang trọng.", "eng": "I've heard that it's a really luxurious place."}, {"viet": "Tôi rất ít gặp cô ta trong mấy tuần vừa qua.", "eng": "I've seen little of her in the past few weeks."}, {"viet": "Tôi luôn nhầm lẫn giữa hai chị em: họ trông giống nhau quá.", "eng": "I always confuse the sisters: they look so alike."}, {"viet": "Tôi không dễ bị khiêu khích, nhưng cách cư xử ấy không thể tha thứ được!", "eng": "I am not easily provoked, but this behaviour is intolerable!"}, {"viet": "Tôi hỏi cô ấy anh ở đâu, nhưng cô ấy nói cô ấy không biết.", "eng": "I asked her where you were, but she said she didn't know."}, {"viet": "Tôi đã mua chúng ở ngân hàng Đài Loan vào ngày 18 tháng 6.", "eng": "I bought them at the Taiwan Bank on June 18."}, {"viet": "Tôi không thể bỏ được thói quen thức giấc lúc sáu giờ sáng.", "eng": "I can't get out of the habit of waking at six in the morning."}, {"viet": "Tôi không nghĩ ra được nhà hàng đó bây giờ nằm ở đâu.", "eng": "I can't think where that restaurant was now."}, {"viet": "Tôi có thể chở Peter và Mary nhưng tất cả những người khác sẽ phải đi xe buýt.", "eng": "I can take Peter and Mary but the others will have to go by bus."}, {"viet": "Tôi không thể chờ lâu hơn nữa.", "eng": "I can't wait much longer."}, {"viet": "Tôi không có lòng nào để nó ở ngoài vào một đêm mưa thế này.", "eng": "I couldn't in all conscience shut him out o such a wet night."}, {"viet": "Tôi muốn sử dụng một két ký gởi an toàn.", "eng": "I'd like to use a safe deposit box."}, {"viet": "Tôi chẳng bận tâm nhiều đến bài diễn văn ấy, đó chẳng qua chỉ là trò hô hào suông.", "eng": "I didn't think much of that speech-it was just a flag-waving exercise."}, {"viet": "Thậm chí tôi cũng chẳng biết anh ta ở đâu.", "eng": "I don't know even whereabouts to look for him."}, {"viet": "Tôi không trung thành với một đảng phái chính trị nào.", "eng": "I don't owe allegiance to any political party."}, {"viet": "Tôi không muốn đến với anh hôm nay'.'Ồ, vậy thì tuỳ em thôi!'!", "eng": "I don't want to come with you today'.'Oh, please yourself then!"}, {"viet": "Tôi chẳng ngại trời lạnh đến cỡ nào.", "eng": "I don't mind how cold it is."}, {"viet": "Tôi nghĩ rằng hôm nay trời sẽ mưa.", "eng": "I fancy that it's going to rain today."}, {"viet": "Tôi cảm thấy rất buồn ngủ, tôi không thể ngừng ngáp được.", "eng": "I felt so sleepy I couldn't stop yawning."}, {"viet": "Tôi há hốc mồm vì ngạc nhiên trước tài khéo của nhà ảo thuật.", "eng": "I gasped with astonishment at the magician's skill."}, {"viet": "Tôi đã có chiếc vé này không mất tiền do một người không muốn dùng nó.", "eng": "I got this ticket for free from sb who didn't want it."}, {"viet": "Tôi không hề có ý định xúc phạm đến tình cảm của anh.", "eng": "I had no thought of hurting your feelings."}, {"viet": "Tôi có cái hẹn chữa răng lúc 3 giờ chiều.", "eng": "I have a dental appointment at 3 p. m."}, {"viet": "Tôi mất cái đồng hồ của tôi Anh có nhìn thấy nó không?", "eng": "I have lost my watch Have you seen it?"}, {"viet": "Tôi phải cắt móng chân của tôi.", "eng": "I have to cut my toe nails."}, {"viet": "Tôi không có đủ tiền mặt.", "eng": "I haven't got enough cash."}, {"viet": "Cháu hết sức tôn kính ông.", "eng": "I hold you in the greatest respect."}, {"viet": "Tôi hy vọng đứa em trai cô sẽ không ở đây quá lâu nữa, nó đang ăn đến mức làm chúng ta khuynh gia bại sản!", "eng": "I hope your brother won't stay much longer, he's eating us out of house and home!"}, {"viet": "Tôi biết chắc chắn là bố tôi sẽ đến.", "eng": "I know for a certainty that my father will come."}, {"viet": "Tôi thích sự giải quyết bằng kinh nghiệm của nó đối với các vấn đề hàng ngày.", "eng": "I like her common sense approach to everyday problems."}, {"viet": "Tôi sẽ trở lại trong vòng một giờ.", "eng": "I'll be round in an hour."}, {"viet": "Tôi sẽ gặp lại anh ở chỗ làm hạt cườm.", "eng": "I'll meet you where the bead work is."}, {"viet": "Tôi là nhân viên tập sự quản lý.", "eng": "I'm a new management trainee."}, {"viet": "Tôi sắp kể cho các bạn một câu chuyện.", "eng": "I'm going to tell you a story."}, {"viet": "Phải thú thật là tôi hơi chán.", "eng": "I'm rather bored, I must confess."}, {"viet": "Tôi đã đưa ra điều mà tôi hy vọng là một đề nghị hấp dẫn.", "eng": "I made what I hoped was an attractive proposition."}, {"viet": "Tôi phải đi thôi-Tôi cần phải đón xe buýt.", "eng": "I must go-I have a bus to catch."}, {"viet": "Tôi cần luyện tiếng Ý của mình trước chuyến đi kinh doanh.", "eng": "I need to practice my Italian before my business trip."}, {"viet": "Tôi chỉ thích những phim có nhiều hành động.", "eng": "I only like films that have got plenty of action."}, {"viet": "Tôi đã bỏ mọi thứ nặng nề trong ấy.", "eng": "I put all the heavy stuff in it."}, {"viet": "Tôi cho là tuần tới chúng tôi sẽ đi.", "eng": "I reckon we'll go next week."}, {"viet": "Chính tôi đã nói thế chỉ mới tuần trước.", "eng": "I said so myself only last week."}, {"viet": "Tôi sẽ trở lại trong giây lát.", "eng": "I shall be back in an instant."}, {"viet": "Tôi đã chêm vài câu bông đùa vào bài diễn văn.", "eng": "I slipped a few jokes into the speech."}, {"viet": "Tôi cho rằng việc đó tất phải xảy ra cô ấy nói một cách cam chịu.", "eng": "I suppose it was bound to happen she said resignedly."}, {"viet": "Tôi nghĩ tôi sẽ ôn vào ngày mai.", "eng": "I think I'll be all right by tomorrow."}, {"viet": "Tôi nghĩ là họ đã quá lạm dụng màu đỏ trong phòng này.", "eng": "I think they've rather overdone the red in this room."}, {"viet": "Tôi dựa vào bàn và cốc đổ xuống đất.", "eng": "I tipped the table and the glasses fell off it."}, {"viet": "Tôi quay lại và thấy diễn giả ở cuối phòng.", "eng": "I turned and saw the speaker at the back of the room."}, {"viet": "Tôi đợi cô ta trở về với nỗi lo lắng mỗi lúc một tăng.", "eng": "I waited with growing unease for her return."}, {"viet": "Tôi muốn xem bộ phim này, người ta bảo rằng bỏ qua đi sẽ là tội lỗi.", "eng": "I want to see the film, they say it's a must."}, {"viet": "Tôi hoàn toàn bị lúng túng vì cô ta từ chối giúp đỡ.", "eng": "I was completely stymied by her refusal to help."}, {"viet": "Tôi bằng bạn tôi trong kì thi-chúng tôi bằng điểm nhau.", "eng": "I was leveled with my friend in the examination-we got the same number of marks."}, {"viet": "Tôi đáng lẽ phải gặp cô ta, nhưng mụ người đi nên quên mất.", "eng": "I was supposed to meet her, but spaced out and forgot."}, {"viet": "Tôi sẽ thay đổi kế hoạch của tôi cho phù hợp với bạn.", "eng": "I will accommodate my plans to yours."}, {"viet": "Tôi mong cậu thôi không huýt sáo như thế nữa.", "eng": "I wish you'd leave whistling like that."}, {"viet": "Tôi không có để cho hắn bịp nữa đâu.", "eng": "I won't be his dupe any longer."}, {"viet": "Xin mời bạn đến ăn tối vào tối thứ sáu tới.", "eng": "I would like to invite you to dinner next Friday evening."}, {"viet": "Tôi chẳng đời nào muốn đổi chỗ cho nó.", "eng": "I wouldn't swap places with him for anything."}, {"viet": "Nếu ông ta cạo bộ râu đi thì trông ông ta trẻ hơn nhiều.", "eng": "If he shaved his beard he would look much younger."}, {"viet": "Nếu hỏi thích ( vang ) đổ hay trắng, tôi sẽ chọn cái thứ hai.", "eng": "If offered red or white, I'd choose the latter ( wine )."}, {"viet": "Nếu cái này là của anh, thì cái này là của tôi.", "eng": "If this is yours, then this must be mine."}, {"viet": "Nếu bạn hỏi tôi thì tôi muốn ăn món cà-ri Ấn được dọn trên lá chuối.", "eng": "If you ask me, I want to have Indian curry served on a banana leaf."}, {"viet": "Nếu anh cảm thấy được, chúng ta có thể đi bộ vào thành phố sau bữa ăn trưa.", "eng": "If you feel up to it, we could walk into town after lunch."}, {"viet": "Nếu anh ăn cắp, anh có thể bị buộc tội trộm cắp.", "eng": "If you steal, you are chargeable with theft."}, {"viet": "Sự trả đũa tức khắc các thợ mỏ bãi công.", "eng": "Immediate retaliation against the striking miners."}, {"viet": "Khi chọn chiếc ô tô anh ta chỉ chú ý độc đến màu thôi.", "eng": "In choosing a car he has respect to the colour alone."}, {"viet": "Ở Nhật Bản, các hình xăm có liên quan đến băng đảng tội phạm có tổ chức.", "eng": "In Japan, tattoos are associated with the mob."}, {"viet": "Mặc dù hoảng sợ, cô ấy vẫn giữ vẻ bình thản và tự chủ.", "eng": "In spite of the panic, she remained serene and in control."}, {"viet": "Trước mặt các vị khách lớn tuổi, con trai chúng ta là một mẫu mực về sự chững chạc.", "eng": "In the presence of elderly visitors our son was a model of decorum."}, {"viet": "Theo ý bạn, điều gì tệ nhất ở quê bạn?", "eng": "In your opinion, what is the worst thing about your hometown?"}, {"viet": "Việc tập luyện rất phổ biến ở Anh phải không?", "eng": "Is exercising very popular in England?"}, {"viet": "Đề nghị mới có gì tốt hơn đề nghị trước đây không.", "eng": "Is the new proposal any better than its predecessor."}, {"viet": "Đây có phải là Hội đồng nghệ thuật Văn hóa của người Mỹ bản địa không?", "eng": "Is this the Native American Cultural Arts Council?"}, {"viet": "Đó là một thiết kế chất lượng tốt hơn nhiều so với thiết kế trước.", "eng": "It's a much better quality design than the previous model."}, {"viet": "Chắc chắn đó là một bữa tiệc buồn chán-chúng ta hãy cố tìm cách tránh.", "eng": "It's bound to be a boring party-let's try to wangle out of it."}, {"viet": "Chính sự vô ơn của cô ta đã làm cho tôi khó chịu.", "eng": "It's her ingratitude that grates on me."}, {"viet": "Đó không phải là một ý kiến hay khi can thiệp vào công việc của vợ chồng người ta.", "eng": "It's not a good idea to come between a man and his wife."}, {"viet": "Người ta nói rằng ban nhạc Spice Girls sẽ đến thành phố này.", "eng": "It's said that the Spice Girls will come to this city."}, {"viet": "Có được một siêu thị gần nhà quả là tiện.", "eng": "It's useful to have a convenient supermarket."}, {"viet": "Tôi lỡ xe buýt, điều đó không quan trọng, tôi có thể đi bộ.", "eng": "It doesn't matter if I miss this bus, I can walk."}, {"viet": "Rõ ràng là cô ấy có một cái nhìn lạc quan về cuộc sống.", "eng": "It is clear that she has a positive outlook on life."}, {"viet": "Ngày nay đã có thể đưa người lên mặt trăng.", "eng": "It is now possible to put a man on the moon."}, {"viet": "Tuy trông cũ nhưng máy móc còn rất tốt.", "eng": "It looks rather old but it's in perfect condition."}, {"viet": "Nó ở đầu kia của con tàu.", "eng": "It's at the other end of the ship."}, {"viet": "Đó là công việc lúc rảnh rỗi của tôi.", "eng": "It's what I do in my free time."}, {"viet": "Hắn đã mất một ít lâu để thích ứng trong ngôi trường mới.", "eng": "It took him sometimes to orient himself in his new school."}, {"viet": "Đó là một thời kì phát triển kinh tế rầm rộ, có nhiều công việc cho mọi người.", "eng": "It was boom time and there was work in plenty for everyone."}, {"viet": "Rõ ràng là nóng quá không thể làm việc ngoài nắng được.", "eng": "It was plainly too hot to be working in the sun."}, {"viet": "Mỗi buổi sáng sẽ có người đến lấy nó.", "eng": "It will be picked up every morning."}, {"viet": "James này, tôi nghe nói là bạn có một bộ sưu tập tem lớn lắm.", "eng": "James, I hear you have a large collection of stamps."}, {"viet": "John không có mặt ở đây hôm nay.''Điều đó có thể hiểu được, hôm qua anh ta trông đã không được khoẻ lắm.'.", "eng": "John isn't here today''That figures, he looked very unwell yesterday'."}, {"viet": "Đặt kề phong cách kiến trúc cổ điển cạnh phong cách hiện đại.", "eng": "Juxtapose the classical style of architecture with the modern."}, {"viet": "Trừ ¥ 30 để thanh toán cho năm bộ tiền, đây là số dư.", "eng": "Less ¥ 30 for the payment of the five sets, this is the balance."}, {"viet": "Chúng ta hãy nhanh tìm chỗ ngồi đi.", "eng": "Let's hurry and find our seats."}, {"viet": "Nhiều tổ chức cứu tế đã gửi tiền giúp các nạn nhân của nạn đói.", "eng": "Many charities sent money to help the victims of the famine."}, {"viet": "Nhiều sinh viên phải ở trọ trong thành phố.", "eng": "Many students have to be boarded out in the town."}, {"viet": "Tôi có thể mượn cây viết của bạn một lúc chứ?", "eng": "May I borrow your pen for a moment?"}, {"viet": "Có lẽ hay nhất là học môn luật.", "eng": "Maybe law would be a good idea."}, {"viet": "Hầu hết bề mặt trái đất bị biển bao phủ.", "eng": "Most of the earth's surface is covered by the sea."}, {"viet": "Bà Oliver có quen biết sơ với mẹ tôi.", "eng": "Mrs Oliver is acquainted with my mother."}, {"viet": "Bệnh cảm lạnh của tôi đã khá hơn nhiều, nhưng tôi vẫn còn khò khè một chút.", "eng": "My cold's a lot better but I'm still a bit wheezy."}, {"viet": "Tim tôi chùng lại khi tôi nghĩ đến việc tôi phải trở về làm việc vào ngày mai.", "eng": "My heart will sink when it occurs to me that I have to go back to work tomorrow."}, {"viet": "Trong chiến tranh bố mẹ tôi hai lần bị mất nhà cửa vì bom đạn.", "eng": "My parents were bombed out twice during the war."}, {"viet": "Tính khí của Nam lại thình lình trở nên cáu bẳn.", "eng": "Nam's temper promptly boiled over again."}, {"viet": "Kế đến, đặt hành lá vào chính giữa cái bánh hỏi, dùng đũa gắp thêm vài miếng da vịt.", "eng": "Next, place the scallion in the center of the pancake, and with your chopsticks add a few pieces of duck skin."}, {"viet": "Không, đồng hồ của bạn chạy đúng rồi, và họ đến trễ đấy.", "eng": "No, your watch is correct, and they are late."}, {"viet": "Rất ít tương ứng giữa hai bản quảng cáo.", "eng": "Not much correspondence between the two accounts."}, {"viet": "Các nữ tu sĩ sống theo lời nguyện chịu nghèo khó, trong sạch và phục tùng.", "eng": "Nuns are under vows of poverty, chastity and obedience."}, {"viet": "Ồ, họ cũng không có thực đơn.", "eng": "Oh, they haven't got one either."}, {"viet": "Trên màn ảnh, John Wayne là một anh chàng ăn nói cộc lốc và một tay súng trúng đích.", "eng": "On screen, John Wayne was a blunt talker and straight shooter."}, {"viet": "Phút trước em muốn đi, phút sau lại không-Anh mong em đừng thay đổi như chong chóng.", "eng": "One minute you want to go, the next you don't-I wish you'd stop chopping about."}, {"viet": "Osaka rất nóng và ẩm ướt vào mùa hè.", "eng": "Osaka is very hot and humid in summer."}, {"viet": "Các lực lượng của ta rút về những vị trí đã được chuẩn bị sẵn.", "eng": "Our forces retired to prepared positions."}, {"viet": "Nhận thức của chúng ta về thực tế thường bị ảnh hưởng bởi những nhân tố chủ quan, như sự mệt mỏi chẳng hạn.", "eng": "Our perception of things is often influenced by subjective factors, such as tiredness."}, {"viet": "Sản xuất thừa làm cho kinh tế của Cộng đồng châu Âu mất cân đối nghiêm trọng.", "eng": "Over-production is seriously unbalancing the EEC economy."}, {"viet": "Người được trả tiền được yêu cầu xuất trình hộ chiếu của họ để xác minh.", "eng": "Payees of travelers cheques are requested to show their passports for verification."}, {"viet": "Mọi người mặc trang phục lịch sử để đi diễu hành.", "eng": "People wore historical costumes for the parade."}, {"viet": "Hân hạnh được gặp ông, xin lỗi tôi không nghe kịp tên của ông.", "eng": "Pleased to meet you, Mr., I'm sorry I don't quite catch your name."}, {"viet": "Những nhận xét rất xác đáng.", "eng": "Remarks that were very much to the point."}, {"viet": "Hãy gởi cho tôi một bản ghi chép về anh sẽ bắt đầu thế nào tính toán tiền bạc, thời gian ra sao, nghiên cứu bao lâu, đại loại như thế.", "eng": "Send me a note about how you would start, how you would work out prices and times-how long it would take instudies and so on."}, {"viet": "Cô ta đã bán rẻ danh dự của cô ta để giành việc làm đó.", "eng": "She'd sell her soul to get the job."}, {"viet": "Cô ấy đã trở nên rất thân mật với ông chủ.", "eng": "She's become very pally with the boss."}, {"viet": "Cô ta định chơi xỏ anh ta kể từ khi anh ta gọi cô là đồ ngốc trước mặt mọi người.", "eng": "She's had it in for him ever since he called her a fool in public."}, {"viet": "Cô ấy đang xén cỏ ở ngoài vườn.", "eng": "She's out in the garden, mowing the lawn."}, {"viet": "Cô ta rất không thân thiện với hàng xóm.", "eng": "She's very ill-disposed towards her neighbours."}, {"viet": "Bà ấy đề nghị không thảo luận vấn đề khi có mặt bà.", "eng": "She asked them not to discuss the matter in her presence."}, {"viet": "Bà ta tiếp tục công việc y như thể không có chuyện gì xảy ra!", "eng": "She carried on with her work for all the world as if nothing had happened!"}, {"viet": "Cô ấy cắt bức tranh từ tờ báo.", "eng": "She cut a picture out of the newspaper."}, {"viet": "Cô ấy làm công việc dịch thuật cho nhiều tổ chức.", "eng": "She does freelance translation work for several agencies."}, {"viet": "Cô ta cảm thấy phải biết ơn anh ấy suốt đời vì đã cứu cô ta thoát chết.", "eng": "She felt eternal gratitude to him for saving her life."}, {"viet": "Cô ấy nhẹ nhàng thoát ra khỏi vòng tay của anh ta.", "eng": "She gently released herself from his arms."}, {"viet": "Cô ta đã nhìn rõ vấn đề dưới một ánh sáng mới.", "eng": "She had come to see the problem in a new light."}, {"viet": "Cô ta có con mắt sành sỏi của một nghệ sĩ.", "eng": "She has an artist's discriminating eye."}, {"viet": "Cô ấy chưa viết thư cho tôi-mặc dù cô ta không hề nói là cô sẽ viết.", "eng": "She hasn't written to me yet-not that she ever said she would."}, {"viet": "Cô ta ăn ở với một người bạn trai.", "eng": "She is having an affair with her boy friend."}, {"viet": "Bà ấy đã ghi nhật ký suốt 20 năm nay.", "eng": "She kept a diary for over twenty years."}, {"viet": "Cô ta đã trông nom bà mẹ ốm trong 10 năm và tất cả điều mà cô được đền đáp là sự vô ơn.", "eng": "She looked after her sick mother for 10 years and all she got for her pains was ingratitude."}, {"viet": "Cô ta có thể chậm chạp nhưng dẫu sao thì cô ta cũng là người có thể tin cậy được.", "eng": "She may be slow but at least she's reliable."}, {"viet": "Cô ta lấy dao sắc gọt lớp vỏ dày đi.", "eng": "She pared off the thick peel with a sharp knife."}, {"viet": "Cô ta lướt những ngón tay nhẹ nhàng trên những phím đàn dương cầm.", "eng": "She ran her fingers lightly over the keys of the piano."}, {"viet": "Bà ta đúng là một mụ phù thủy già!", "eng": "She's a right old witch!"}, {"viet": "Cô ấy không phải hạng người nói dối.", "eng": "She's not the kind of person to lie."}, {"viet": "Chị ấy đã cứu nó khỏi chết đuối, nhưng chỉ với cái giá chị phải hy sinh tính mạng mình.", "eng": "She saved him from drowning, but only at the cost of her own life."}, {"viet": "Cô ấy đã biểu lộ nhuệ khí của mình bằng thắng lợi mặc dầu cô ta ở thế bất lợi.", "eng": "She showed her mettle by winning in spite of her handicap."}, {"viet": "Cô ta đâm anh ta vào chân bằng con dao làm bếp.", "eng": "She stabbed him in the leg with a kitchen knife."}, {"viet": "Cô ta nói chuyện về việc xin một việc làm khác.", "eng": "She talked of applying for another job."}, {"viet": "Cô ta đã không chịu nghe những lời cảnh cáo của chúng tôi và đã bị lạc.", "eng": "She turned a deaf ear to our warnings and got lost."}, {"viet": "Cô ta hơi phật lòng một chút là anh ấy đã quên tên của cô ta.", "eng": "She was a bit miffed that he's forgotten her name."}, {"viet": "Cô ta phải trả thêm 4 pao dôi hơn số tiền ghi trên hoá đơn.", "eng": "She was charged an excess of 4 pounds over the amount stated on the bill."}, {"viet": "Chị ta bị giam ở đồn cảnh sát sáu tiếng.", "eng": "She was held in police custody for six hours."}, {"viet": "Cô ấy đã bị kẹt cứng dưới chiếc xe ô tô đổ nát.", "eng": "She was pinned under the wreckage of the car."}, {"viet": "Cô ta đang học một khóa võ tự vệ.", "eng": "She was taking a course of self-defence."}, {"viet": "Cô ấy vẫy tôi khi đi ngang qua nhà tôi.", "eng": "She waved at me as she passed my house."}, {"viet": "Cô ta thắng được 100 pao và thế là đem phung phí tất cả để sắm áo quần mới.", "eng": "She won 100 pounds and then splurged it all on new clothes."}, {"viet": "Đàn cừu túm tụm lại một chỗ cho ấm.", "eng": "Sheep huddling up together for warmth."}, {"viet": "Đóng cửa ra vào và cửa sổ vào ban đêm.", "eng": "Shut the doors and windows at night."}, {"viet": "Đánh quả bóng đỏ vào lỗ trên.", "eng": "Sink the red into the top pocket."}, {"viet": "Các cửa hàng nhỏ đang bị các siêu thị lớn hút hết khách.", "eng": "Small shops are being crowded out by the big supermarkets."}, {"viet": "Vậy ông Jackson đặt trước một bàn dành cho 8 người vào lúc 7 giờ tối mai, dùng món ăn Trung Quốc.", "eng": "So it's Mr. Jackson for a table of eight tomorrow evening at 7."}, {"viet": "Một số người lớn không thể thông cảm trẻ con.", "eng": "Some adults can't relate to children."}, {"viet": "Một số máy bay quân sự mới nhất bay nhanh hơn máy bay Concorde, và tất nhiên phi thuyền bay với tốc độ hơn 24000 dặm Anh một giờ, hay khoảng 40000 km một giờ khi chúng thoát khỏi lực hút của trái đất.", "eng": "Some of the latest military aircraft fly faster than the Concorde, and of course spaceships fly at more than 24,000 miles an hour, or about 40,000 kilometers an hour when they escape the earth's gravity."}, {"viet": "Một số việc vượt quá khả năng của con người.", "eng": "Some things are beyond human contrivance."}, {"viet": "Chẳng bao lâu khi bà rời khỏi ngân hàng chúng tôi, chúng tôi đã tìm thấy thẻ tín dụng của bà trên quầy.", "eng": "Soon after you left our bank we found your credit card on the counter."}, {"viet": "Cả buổi chiều nhởn nhơ ở nhà.", "eng": "Spend the afternoon lazing around the house."}, {"viet": "Nhìn trộm ai trong gương.", "eng": "Steal a glance at somebody in the mirror."}, {"viet": "Đừng có lười biếng nữa, tiếp tục đào đi!", "eng": "Stop slacking and get on with that digging!"}, {"viet": "Chịu tuân theo sự áp đặt của giờ hành chính bất di bất dịch.", "eng": "Submit to the tyranny of inflexible office hours."}, {"viet": "Sue có vẻ trầm lặng, nhưng đường tưởng nhầm, cô ta có tính nóng khủng khiếp!", "eng": "Sue seems very quiet, but make no mistake about it, she has a terrible temper!"}, {"viet": "Sống sót trong tai nạn đâm ôtô nhưng đã làm xe tan nát hoàn toàn.", "eng": "Survived the crash but totalled the car."}, {"viet": "Đem xe ra để đi một chuyến về miền quê.", "eng": "Take the car out for a run in the country."}, {"viet": "Công nghệ là động lực chính của phát triển kinh tế.", "eng": "Technology was the mainspring of economic growth."}, {"viet": "Cám ơn, tôi sẽ rất hân hạnh được đến.", "eng": "Thank you, I'll come with pleasure."}, {"viet": "Đó là một ý nghĩ phi lí nhất tôi chưa bao giờ nghe thấy.", "eng": "That's the most absurd I never have heard."}, {"viet": "Bộ đồ đó chắc đã làm cô ta tốn khối tiền!", "eng": "That dress must cost her a bomb!"}, {"viet": "Thị trường đó, theo tôi thấy là có tiềm năng rất lớn.", "eng": "That market, as I see it, has got a lot of potential."}, {"viet": "Đó là Lucy-tôi nhận ra bước chân của cô ta.", "eng": "That's Lucy-I recognize her step."}, {"viet": "Thật là một bữa ăn tuyệt vời-xin gửi lời chúc tốt đẹp của tôi đến đầu bếp.", "eng": "That was an excellent dinner-my complements to the chief."}, {"viet": "Biến cố khắc sâu vào trí nhớ nó.", "eng": "The accident was engraved in his memory."}, {"viet": "Những người kể trên đang hành động một cách đáng ngờ.", "eng": "The aforementioned persons were acting suspiciously."}, {"viet": "Những con voi giận dữ nổi điên phá hoại hoa màu.", "eng": "The angry elephants went on the rampage, damaging the crops."}, {"viet": "Diện tích văn phòng này là 35 mét vuông.", "eng": "The area of the office is 35 square metres."}, {"viet": "Vận động viên ấy đột ngột thay đổi tốc độ và vọt lên bỏ xa những người khác.", "eng": "The athlete changed gear and shot ahead of the others."}, {"viet": "Mục tiêu được tuyên bố công khai của chính phủ này là giảm thuế.", "eng": "The avowed aim of this Government is to reduce taxation."}, {"viet": "Ban nhạc đã chơi nhiều bài hát, trong đó có cả một số bài tôi thích.", "eng": "The band played many songs, including some of favourites."}, {"viet": "Thằng bé thò đầu ra ngoài cửa sổ.", "eng": "The bay pokes his head out of the window."}, {"viet": "Dự luật đã được thông qua và trở thành luật.", "eng": "The bill passed and became law."}, {"viet": "Chiếc thuyền chạy bành bạch dọc theo con kênh.", "eng": "The boat chugged along the canal."}, {"viet": "Cuốn sách được bán hơn một triệu bản bìa cứng.", "eng": "The book sold more than a million copies in hardback."}, {"viet": "Chàng trai mặc áo sơ mi màu xanh da trời phải không?", "eng": "The boy who is wearing the blue shirt?"}, {"viet": "Dải vách đá trắng rộng quanh vịnh.", "eng": "The broad sweep of white cliffs round the bay."}, {"viet": "Chiếc xe buýt không điều khiển được đã đâm vào mặt trước của một cửa hiệu.", "eng": "The bus went out of control and ran into a shop front."}, {"viet": "Chiếc xe ôtô bị va chạm một chút nhưng vẫn chạy được.", "eng": "The car's been knocked about a bit, but it still goes."}, {"viet": "Chiếc xe ô tô đó bị ném một trái lựu đạn.", "eng": "The car was hit by a grenade."}, {"viet": "Các biến cố dữ dội trong những năm 1939-1945.", "eng": "The cataclysmic events of 1939-1945."}, {"viet": "Những thay đổi không tạo ra những quan hệ lao động tốt đẹp hơn.", "eng": "The changes were not productive of better labour relations."}, {"viet": "Đứa trẻ ngước mắt nhìn cha.", "eng": "The child looked at her father with upcast eyes."}, {"viet": "Bọn trẻ được ủ ấm cạnh lò sưởi.", "eng": "The children are wrapped up snug by the fire."}, {"viet": "Sau khi ném bùn vào nhau lũ trẻ trông thật đáng sợ.", "eng": "The children were a fearsome sight after their mud fight."}, {"viet": "Những hình trang trí Nôen trong thành phố được thắp sáng rực rỡ, đổi màu liên tục.", "eng": "The city's brightly-lit Christmas decorations, with their constantly interchanging colours."}, {"viet": "Quần áo chất thành một đống lộn xộn ở góc phòng.", "eng": "The clothes lay huddled up in a pile in the corner."}, {"viet": "Sự va chạm đã làm thủng phía trước của con tàu.", "eng": "The collision stove in the front of the ship."}, {"viet": "Công ty đó làm ăn không dở.", "eng": "The company doesn't do badly."}, {"viet": "Những bộ phận của một động cơ, một máy ảnh, v. v.", "eng": "The components of an engine, a camera, etc."}, {"viet": "Cuộc tranh cãi liên tiếp về chính sách quốc phòng của chính phủ.", "eng": "The continuing row over the Government's defence policy."}, {"viet": "Tài nguyên thiên nhiên của đất nước gồm rừng, than và dầu.", "eng": "The country's natural resources include forests, coal, and oil."}, {"viet": "Toà án sẽ xử phạt nặng những tội phạm trẻ.", "eng": "The courts are coming down heavily on young offenders."}, {"viet": "Đám đông ùa lên trên sân bóng.", "eng": "The crowd ran onto the pitch."}, {"viet": "Chu kỳ nhảy vọt và đình trệ về kinh tế.", "eng": "The cycle of economic booms and slumps."}, {"viet": "Vai trò sút giảm của ngành đường sắt trong hệ thống vận chuyển.", "eng": "The declining role of the railways in the transport system."}, {"viet": "Lòng mong muốn hoà bình vượt lên trên nhưng sự bất đồng về chính trị.", "eng": "The desire for peace transcended political differences."}, {"viet": "Tai nạn đã chấm dứt cuộc đời hàng trăm người.", "eng": "The disaster claimed hundreds of lives."}, {"viet": "Bác sĩ cho tôi đơn thuốc giảm đau.", "eng": "The doctor gave me a prescription for pain-killers."}, {"viet": "Con chó cắn đùa tôi một cái.", "eng": "The dog gave me a playful bite."}, {"viet": "Ống dẫn bị tắc và cần được thông.", "eng": "The drain is blocked and needs unplugging."}, {"viet": "Con diều hâu quặp một con chuột trong những móng vuốt của nó.", "eng": "The eagle held a mouse in its claws."}, {"viet": "Sự cung cấp điện đã bị ngắt khỏi nguồn.", "eng": "The electricity supply has been disconnected at the mains."}, {"viet": "Buổi chiêu đãi được tổ chức đó thuộc loại xuất sắc.", "eng": "The entertainment provided was first class."}, {"viet": "Tỉ giá hối đoái dường như lại giảm xuống.", "eng": "The exchange rates seem to drop again."}, {"viet": "Nhà máy ứng phó rất có hiệu quả với nhu cầu tăng đột ngột.", "eng": "The factory coped very well with the sudden increase in demand."}, {"viet": "Vòi nước bị rỉ và vòi hoa sen phun ra không đủ lượng nước.", "eng": "The faucet is leaking and there is not enough water coming out from the showerhead."}, {"viet": "Cuốn phim chỉ có vài đoạn hay.", "eng": "The film is good in parts."}, {"viet": "Bảng lương của hãng có một mành thông tin về tổng quỹ lương và một mành về số tiền trả thực.", "eng": "The firm's payroll has one field gross pay and one for net pay."}, {"viet": "Cảnh thứ nhất trong vở kịch là lâu đài nhà vua.", "eng": "The first scene of the play is the king's palace."}, {"viet": "Những quy tắc đặc biệt sau đây có thể áp dụng đối với sinh viên ở hải ngoại.", "eng": "The following special regulations are applicable to overseas students."}, {"viet": "Quốc hội Pháp, Tây Đức, Tây Ban Nha, v. v.", "eng": "The French, West German, Spanish, etc parliament."}, {"viet": "Những tên cướp xông vào quán rượu và bắt đầu nổ súng đe dọa.", "eng": "The gangsters ran into the bar and started shooting it up."}, {"viet": "Gấu trúc khổng lồ là một loài vật đang có nguy cơ tuyệt chủng.", "eng": "The giant panda is an endangered species."}, {"viet": "Mục đích chính của Chính phủ là đẩy lùi lạm phát.", "eng": "The Government's main aim is to beat inflation."}, {"viet": "Chính phủ dự định trừng trị thẳng tay bọn hu-li-gân bóng đá.", "eng": "The government intends to clamp down on soccer hooliganism."}, {"viet": "Kế hoạch của Chính phủ Châu Phi hoá dịch vụ.", "eng": "The Governments plan to Africanize the service."}, {"viet": "Mặt đất được một lớp tuyết mới phủ lên.", "eng": "The ground was covered in a pristine layer of snow."}, {"viet": "Khẩu súng tự nhiên phát nổ.", "eng": "The gun went off by accident."}, {"viet": "Con nhím đã cuộn tròn mình lại thành một quả cầu tua tủa mũi nhọn.", "eng": "The hedgehog rolled up into a spiky ball."}, {"viet": "Con ngựa quất đuôi vùn vụt xung quanh.", "eng": "The horse swished its tail about."}, {"viet": "Căn nhà đã được thay dây điện mới toàn bộ.", "eng": "The house has been completely rewired."}, {"viet": "Cuộc săn lùng tên tội phạm đang tiến hành.", "eng": "The hunt is on for the culprit."}, {"viet": "Sự bao gồm điều khoản ấy trong hợp đồng.", "eng": "The inclusion of the clause in the contract."}, {"viet": "Sự lăng nhục ấy vẫn còn giày vò tâm trí anh ta.", "eng": "The insult still rankled in his mind."}, {"viet": "Tiếng leng keng của các đồng tiền trong túi nó.", "eng": "The jingle of coins in his pocket."}, {"viet": "Ban giám khảo sắp công bố những người thắng cuộc.", "eng": "The jury is about to announce the winners."}, {"viet": "Hồ nước đóng băng toàn bộ.", "eng": "The lake is completely frozen over."}, {"viet": "Qui luật cung cầu ảnh hưởng đến giá cả hàng hoá.", "eng": "The law of supply and demand governs the prices of goods."}, {"viet": "Thư đó được viết bằng một lối văn xuôi thường lệ quá dở của anh ta ai mà quên được.", "eng": "The letter was written in his usual deathless prose."}, {"viet": "Một ít công việc của anh ta mà tôi đã trông thấy là đáng hài lòng.", "eng": "The little that I have seen of his work is satisfactory."}, {"viet": "Nhóm cực đoan bị hầu hết các đảng viên không thèm quan tâm đến.", "eng": "The lunatic fringe are ignored by most members of the party."}, {"viet": "Người đàn ông trả lời bằng một âm thanh lạ lùng không rõ.", "eng": "The man answered with a strange inarticulate sound."}, {"viet": "Trận đấu đã phải hủy bỏ vì thời tiết xấu.", "eng": "The match had to be cancelled because of bad weather."}, {"viet": "Cuộc họp đông chật ních hội trường tràn cả ra hành lang.", "eng": "The meeting spilt over from the hall into the corridor."}, {"viet": "Các thợ mỏ nhất trí về vấn đề này.", "eng": "The miners were solid on this issue."}, {"viet": "Tiền chỉ được dùng cho một mục đích riêng là xây nhà hát mới.", "eng": "The money is to be used for one specific purpose, the building of the new theatre."}, {"viet": "Người đi xe gắn máy nâng kính che mắt.", "eng": "The motor-cyclist raised his visor."}, {"viet": "Những nỗi khủng khiếp không thể nào tả xiết được của trại tù.", "eng": "The nameless horrors of the prison camp."}, {"viet": "Chính sách phát triển mới đã trang bị cho nền kinh tế những yếu tố ổn định thường xuyên.", "eng": "The New Deal equipped the economy with built-in stabilizers."}, {"viet": "Những người mới tuyển dụng đã được kiểm tra năng lực.", "eng": "The new recruits were put through their paces."}, {"viet": "Tôi nghĩ rằng tin đó sẽ không làm cô ấy lo lắng.", "eng": "The news won't worry her, I reckon."}, {"viet": "Tờ thông báo viết là:'Chường ( nguyên văn thế đấy ) bắt đầu học lúc 9 giờ sáng'.", "eng": "The notice read:'Skool ( sic ) starts at 9 am'."}, {"viet": "Anh ta đến chậm hay không thì cũng thế.", "eng": "The odds are even that he'll be late."}, {"viet": "Ông già cảm thấy như sống lại trong con cháu của mình.", "eng": "The old man felt reborn in his children."}, {"viet": "Phe chống đối phòng thủ vững chắc.", "eng": "The opposition have a strong defense."}, {"viet": "Nỗi đau gần như quá sức chịu đựng của anh ấy.", "eng": "The pain was almost more than he could bear."}, {"viet": "Đảng gửi lời chào thân ái tới hội nghị công đoàn.", "eng": "The party sent its fraternal greetings to the trade union meeting."}, {"viet": "Người nông dân lệ thuộc vào được mùa chỉ để mà sống được.", "eng": "The peasants depend on a good harvest for their very existence."}, {"viet": "Tuần trăng rất có ý nghĩa đối với những người theo đạo phật.", "eng": "The phases of the moon are significant to buddhist worshippers."}, {"viet": "Đỉnh cao nhất trong sự nghiệp, danh vọng, thành công, v. v. của mình.", "eng": "The pinnacle of one's career, fame, success, etc."}, {"viet": "Các kế hoạch này đã được một chuyên gia lập ra.", "eng": "The plans had been drawn professionally."}, {"viet": "Thú tắm nắng bắt đầu nhàm đối với chúng tôi sau một tuần ở bãi biển.", "eng": "The pleasures of sunbathing began to pall on us after a week on the beach."}, {"viet": "Cảnh sát đã khám xét từng ngóc ngách của ngôi nhà để tìm ra đầu mối.", "eng": "The police examined every inch of the house for clues."}, {"viet": "Đồn cảnh sát bị bọn khủng bố phá nổ tung.", "eng": "The police station was blown up by terrorists."}, {"viet": "Quần chúng nói chung phản đối sự thay đổi bất ngờ.", "eng": "The populace at large are opposed to sudden change."}, {"viet": "Những con vật tiền sử của ngựa.", "eng": "The prehistoric antecedents of the horse."}, {"viet": "Tổng thống được những kẻ nịnh bợ và những người đi theo vây quanh.", "eng": "The President was surrounded by flatterers and camp followers."}, {"viet": "Ngài Thủ tướng không sẵn sàng bình luận.", "eng": "The Prime Minister was not available for comment."}, {"viet": "Vấn đề đó sẽ không tự nhiên mà biến đi.", "eng": "The problem won't just disappear."}, {"viet": "Ý kiến đề xuất được mọi người đồng thanh tán thành.", "eng": "The proposal was greeted with a chorus of approval."}, {"viet": "Cái ví trong xách tay của bà ta là một miếng mồi ngon cho bất kỳ tên ăn cắp nào.", "eng": "The purse in her handbag was a sitter for any thief."}, {"viet": "Chiếc bè trôi lềnh bềnh xuôi dòng sông.", "eng": "The raft was floating gently down the river."}, {"viet": "Biên lai là bằng chứng về việc mua của bà.", "eng": "The receipt is your proof of purchase."}, {"viet": "Tiếng vọng lại của sóng từ các tảng đá.", "eng": "The repercussion of the waves from the rocks."}, {"viet": "Người bán lẻ phải chịu phí tổn về hao hụt.", "eng": "The retailer has to absorb the cost of wastage."}, {"viet": "Sông Thames có nhiều chiếc cầu bắc qua.", "eng": "The river Thames is spanned by many bridges."}, {"viet": "Cách bố trí ánh sáng của căn phòng đem lại một ấn tượng rộng rãi.", "eng": "The room's lighting conveys an impression of spaciousness."}, {"viet": "Những vận động viên chạy lần lượt xuất phát cách nhau năm phút.", "eng": "The runners started at 5-minute intervals."}, {"viet": "Cảnh chuyển từ cửa hàng sang cảnh đường phố.", "eng": "The scene cuts from the shop to the street."}, {"viet": "Biển xói mòn các vách đá ở bờ phía nam.", "eng": "The sea is undermining the cliffs of the south coast."}, {"viet": "Đường nét nhấp nhô của những ngọn đồi xa xa.", "eng": "The serried outline of the distant hill."}, {"viet": "Chiếc tàu đó đã chìm xuống đáy đại dương.", "eng": "The ship sank to the bottom of the ocean."}, {"viet": "Vở kịch đó nơi qui tụ thật sự của tài năng mới.", "eng": "The show is veritable reservoir of new talent."}, {"viet": "Tình thế bây giờ xấu đến nổi bất cứ sự thay đổi nào cũng có thể làm cho nó tốt hơn.", "eng": "The situation is now so bad that any change is likely to be a change for the better."}, {"viet": "Những chóp tháp cao vút của nhà thờ đó.", "eng": "The soaring spires of the cathedral."}, {"viet": "Tiếng cành cây rơi cái bịch trên mái lều.", "eng": "The sound of branches thudding against the walls of the hut."}, {"viet": "Vòi bị sứt nên rót không được thật là tốt.", "eng": "The spout is chipped so it doesn't pour very well."}, {"viet": "Nhà máy thép đóng cửa nghỉ lễ.", "eng": "The steel works is closed for the holidays."}, {"viet": "Cho đến nay cuộc bãi công đã được sáu tuần rồi.", "eng": "The strike has been on now for six weeks."}, {"viet": "Mặt trời và mặt trăng thường được nhân cách hoá trong thơ ca.", "eng": "The sun and the moon are often personified in poetry."}, {"viet": "Nhiệm vụ chứng tỏ khó hơn một cách không thể tưởng tượng được so với điều chúng ta đã hình dung.", "eng": "The task proved inconceivably more difficult than we had imagined."}, {"viet": "Việc tiến lên hạng nhất của đội bóng.", "eng": "The team's progression to the first division."}, {"viet": "Chuyến bay thử nghiệm là để khám phá những sai phạm kĩ thuật ở chiếc máy bay mới.", "eng": "The test night was to discover the bugs in the new plane."}, {"viet": "Thuỷ triều phụ thuộc vào sức hút của mặt trăng.", "eng": "The tides depend on the pull of the moon."}, {"viet": "Thành phố ở trong tình trạng nhốn nháo trong cuộc bầu cử.", "eng": "The town was in a turmoil during the elections."}, {"viet": "Cây cối che nhà tôi không cho mọi người nhìn thấy.", "eng": "The trees screen our house from public view."}, {"viet": "Hai cô gái cùng cưỡi trên lưng con ngựa.", "eng": "The two girls went riding together aboard a horse's back."}, {"viet": "Công đoàn đã bỏ phiếu tuyên bố đình công đòi tăng lương 10%.", "eng": "The Union has voted to strike for a bay increase of 10%."}, {"viet": "Động từ phù hợp với chủ ngữ của nó về số và ngôi.", "eng": "The verb agrees with its subject in number and person."}, {"viet": "Những người lữ hành vẫn kiên trì tiến bước dù thời tiết rất xấu.", "eng": "The walkers soldiered on although the weather was terrible."}, {"viet": "Thời tiết rất xấu trong dịp đi nghỉ phép, giá chúng tôi ở nhà thì có lẽ tốt hơn.", "eng": "The weather was so bad on holiday we might just as well have stayed at home."}, {"viet": "Gió làm tung những tờ giấy trên bàn.", "eng": "The wind disheveled the papers on the desk."}, {"viet": "Có tin đồn là nó đã rời khỏi đất nước.", "eng": "The word is that he's left the country."}, {"viet": "Lòng đỏ trứng có giá trị dinh dưỡng hơn lòng trắng.", "eng": "The yolk of the egg has more food value than the white."}, {"viet": "Quyết định quan trọng của họ tuyên bố chiến tranh đã thay đổi quá trình lịch sử.", "eng": "Their fateful decision to declare war changed the course of history."}, {"viet": "Tiếng kêu của họ vang dội khắp thung lũng.", "eng": "Their shouts re-echoed through the valley."}, {"viet": "Vậy thì đơn vị tiền tệ như thế nào?", "eng": "Then what's the unit of the currency?"}, {"viet": "Trong gia đình này có một chiều hướng điên khùng.", "eng": "There's a strain of madness in the family."}, {"viet": "Những thứ hàng này không có nhiều nhu cầu mua.", "eng": "There's not much market for these goods."}, {"viet": "Có những trường phái khác nhau về cách thức trồng cà chua tốt nhất.", "eng": "There are different schools of thought on the best methods of growing tomatoes."}, {"viet": "Có vài ba điểm yếu trong lập luận của anh.", "eng": "There are several weak spots in your argument."}, {"viet": "Có một vụ mưu sát tổng thống.", "eng": "There has been an assassination attempt on the President."}, {"viet": "Có một trạm cảnh sát ở phía trên con đường này một tí.", "eng": "There is a police box further up this street."}, {"viet": "Không có gì giải khát tốt bằng chè uống với chanh.", "eng": "There is nothing as refreshing as lemon tea."}, {"viet": "Có một rạp chiếu bóng ở tay trái và một nhà thờ ở tay phải.", "eng": "There was a cinema on the left and a church on the right."}, {"viet": "Giữa các thành thị nhỏ này có diễn ra chút ít sự mua bán.", "eng": "There was little trade between these small towns."}, {"viet": "Tuần qua có sáu lễ rửa tội ở nhà thờ này.", "eng": "There were six baptisms at this church last week."}, {"viet": "Những sự chỉ trích đó đã làm tổn thương lòng tự hào của nó một cách sâu sắc.", "eng": "These criticisms have hurt his pride deeply."}, {"viet": "Những viên thuốc này chắc chắn sẽ đem lại giấc ngủ ngon cho anh.", "eng": "These pills should ensure you a good night's sleep."}, {"viet": "Họ sắp cho quét vôi lại nhà của họ.", "eng": "They're going to have their house painted."}, {"viet": "Chúng đều có thành bao và một chất nhầy ở trong, chất nhầy này được gọi là chất nguyên sinh.", "eng": "They all have a wall around them and a jelly like substance inside, this jelly like substance is called protoplasm."}, {"viet": "Giá cả của chúng rất phải chăng.", "eng": "They are very good for the price."}, {"viet": "Họ kêu nài rằng đạo luật mới không hợp hiến.", "eng": "They claimed that the new law was not constitutional."}, {"viet": "Họ không giấu nhau bất cứ điều gì.", "eng": "They don't keep anything from each other."}, {"viet": "Họ chào đón nhau thân mật đến nỗi chúng tôi nghĩ họ hẳn phải là anh chị em.", "eng": "They greeted each other with such familiarity that we thought they must be brother and sister."}, {"viet": "Họ phải đổ nó vào khuôn cho đến khi nó cứng lại.", "eng": "They have to put it into forms until it gets hard."}, {"viet": "Họ vẫn giữ được sự bình tĩnh đáng kính nể qua suốt cuộc thử thách nặng nề.", "eng": "They maintained an admirable composure throughout the ordeal."}, {"viet": "Họ rọi đèn pha dọc theo con đường.", "eng": "They played the searchlights along the road."}, {"viet": "Họ nói những điều bỉ ổi về anh ta ở sau lưng.", "eng": "They say nasty things about him behind his back."}, {"viet": "Họ đã sống sót được qua một cuộc tiến công dữ dội của những thổ dân bộ lạc.", "eng": "They survived an onslaught by tribesmen."}, {"viet": "Họ được trang bị cho trận đánh ( chuyến đi ).", "eng": "They were accoutered for battle ( the trip )."}, {"viet": "Chúng nó bị từ chối không được gia nhập câu lạc bộ.", "eng": "They were refused entrance to the club."}, {"viet": "Hãy nghĩ về hộp đêm, các ngôi sao, các cô gái đẹp …?", "eng": "Think of the night clubs, the stars, the beautiful girl. Can't you picture me there?"}, {"viet": "Chương này chứa phần lý lẽ chủ yếu của tác giả.", "eng": "This chapter contains the meat of the writer's argument."}, {"viet": "Cái áo này cần khâu hẹp lại ở eo.", "eng": "This dress needs to be taken in at the waist."}, {"viet": "Đây là cửa hàng miễn thuế.", "eng": "This is a Duty-free Shop."}, {"viet": "Đây là cách nhanh nhất tới trường.", "eng": "This is the quickest way to get to school."}, {"viet": "Tiền này là để trả cho công việc của anh.", "eng": "This money is in payment for your work."}, {"viet": "Chiếc máy tính bỏ túi này cần hai cục pin.", "eng": "This pocket calculator needs two batteries."}, {"viet": "Chương trình phần mềm này đòi hỏi có phần mềm văn phòng Windowns 2000 hoặc cao hơn.", "eng": "This software program requires an OS of Windows 2000 or above."}, {"viet": "Đây là Torvill và Dean ở thời kỳ tốt đẹp nhất của họ.", "eng": "This was Torvill and Dean at their best."}, {"viet": "Hàng ngàn cây cối bị thiêu huỷ trong đám cháy rừng.", "eng": "Thousands of trees were lost in the forest fire."}, {"viet": "Thời tiết ngày mai sẽ có nhiều mây, có lúc hửng sáng.", "eng": "Tomorrow's weather will be cloudy with bright periods."}, {"viet": "Nó mà không rút lời buộc tội thì chúng ta sẽ phải đấm mõm nó.", "eng": "Unless he drops the charge we'll have to buy him off."}, {"viet": "Cái anh thấy là cái có thật hay chỉ là con ma?", "eng": "Was what you saw something substantial or only a ghost?"}, {"viet": "Chúng tôi sẽ phải đưa bà đến bệnh viện để chụp X quang.", "eng": "We'll have to get you to a hospital for an X-ray."}, {"viet": "Chúng tôi là những nhà kinh doanh có trụ sở tại Hồng Kong, mua bán các sản phẩm dệt đa dạng và chúng tôi quen với thị trường Trung Quốc.", "eng": "We're Hong Kong-based traders dealing with various textile products and we are familiar with the China market."}, {"viet": "Chúng tôi đã làm việc suốt cả tuần không có lấy một lúc rỗi.", "eng": "We've been working all week without a moment's leisure."}, {"viet": "Chúng tôi đã băn khoăn suy nghĩ mãi hàng giờ về chuyện nên mua thứ giấy dán tường nào.", "eng": "We agonized for hours about which wallpaper to buy."}, {"viet": "Chúng tôi đang thực hiện một vài sự thay đổi cho ngôi nhà.", "eng": "We are making a few alterations to the house."}, {"viet": "Chúng tôi mua máy rửa bát đĩa trả dần.", "eng": "We bought the dishwasher on easy terms."}, {"viet": "Chúng tôi có thể cho các ông mức giá 70 đô la mỗi tá.", "eng": "We can quote you a price of 70 dollars per dozen."}, {"viet": "Chúng tôi quyết định đến theo đường vòng để xem phong cảnh miền quê.", "eng": "We decided to come the long way round in order to see the countryside."}, {"viet": "Chúng tôi làm thử nghiệm bằng cách cho dầu vào với nước và chúng tôi thấy là nó không hoà tan.", "eng": "We experimented by putting oil and water together, and we saw that they did not mix."}, {"viet": "Chúng tôi đã được báo trước về nguy cơ hoả hoạn.", "eng": "We had been forewarned of the risk of fire."}, {"viet": "Chúng ta có mứt việt quất và mức dâu tây.", "eng": "We have blueberry and strawberry jam."}, {"viet": "Ta hầu như không có cơ may thắng.", "eng": "We haven't a chance in a million of winning."}, {"viet": "Chúng tôi sống cách đây một quãng ném.", "eng": "We live a stone's throw within a stone's throw of here."}, {"viet": "Chúng ta cần phải mang hết năng lực để gánh vác nhiệm vụ.", "eng": "We must bring all our energies to bear upon the task."}, {"viet": "Chúng tôi cần hàng trăm vai phụ cho các cảnh chiến trận.", "eng": "We need hundreds of extras for the battle scenes."}, {"viet": "Chúng ta đang trên đường đến West Point.", "eng": "We're heading for West Point."}, {"viet": "Chúng ta sẽ không mua ngôi nhà này: vì chủ nhà lại lên giá.", "eng": "We shan't be buying the house: we've been gazumped."}, {"viet": "Chúng tôi đi tất cả các chuyến xe, một số chuyến đi hai lần.", "eng": "We took all the rides, some of them twice."}, {"viet": "Chúng tôi phẫn nộ khi thấy số tiền trên hoá đơn.", "eng": "We were ( absolutely ) disgusted at the size of the bill."}, {"viet": "Nhiều năm sau chúng tôi đã phải nhận ra rằng vào dịp ấy anh ta đã nói những lời lẽ tiên tri như thế nào.", "eng": "We were to realize years later how prophetically he spoke on that occasion."}, {"viet": "Dự báo thời tiết của Nha Khí tượng Trung ương.", "eng": "Weather forecasts from the Central Meteorological Office."}, {"viet": "À, thẳng rồi, nhưng nó bị ngược đầu, tôi e là vậy.", "eng": "Well, it is straight, but it's upside down, I'm afraid."}, {"viet": "Đội Tây Đức đã thắng cho đến ngay trước khi trận đấu kết thúc, đội kia đã san bằng tỷ số.", "eng": "West Germany were winning the match until just before the end when the other team equalized."}, {"viet": "Một hỗn hợp mùi vị thật tuyệt vời!", "eng": "What an unusual combination of flavours!"}, {"viet": "Ở nước bạn, các tội phạm nào đang nổi cộm?", "eng": "What crimes are prevalent in your country?"}, {"viet": "Gia đình và các bạn bè mà tôi còn thì hiện đang sống ở nước ngoài.", "eng": "What family and friends I still have live abroad."}, {"viet": "Tuổi hợp pháp để được phép mua thuốc lá ở nước bạn là bao nhiêu?", "eng": "What is the legal age for buying cigarettes in your country?"}, {"viet": "Cháu muốn ăn loại săn-uýt nào?", "eng": "What kind of sandwich would you like?"}, {"viet": "Điều bà ta nói là một sự đơn giản hoá hữu ích của lý thuyết đó.", "eng": "What she said was a useful simplification of the theory."}, {"viet": "Điều anh nói bây giờ không phù hợp với những gì anh đã nói tuần trước.", "eng": "What you say now is not consistent with what you said last week."}, {"viet": "Khi anh ta nhận ra rằng chẳng có ai lắng nghe mình, anh ấy đã rời căn phòng trong cơn tức giận.", "eng": "When he realized nobody was listening to him, he left the room in a fit of pique."}, {"viet": "Khi tất cả các anh em trai của tôi học xong, gia đình tôi đã chuyển đến đây, bên cạnh hồ.", "eng": "When my brothers all finished school, the family moved here beside the lake."}, {"viet": "Khi họ làm thế, họ gặp khó khăn.", "eng": "When they did, they ran into trouble."}, {"viet": "Bà xã nhà anh tối nay ở đâu vậy?", "eng": "Where's your trouble and strife tonight then?"}, {"viet": "Không biết thượng nghị viện có phản đối một trong nhưng thành viên của mình vì xung đột quyền lợi hay không.", "eng": "Whether the Senate will censure on of its members for conflict interest."}, {"viet": "Ông thích súp xào, nước dùng, hay súp thịt hầm?", "eng": "Which soup would you like, consomme or pottage?"}, {"viet": "Anh nghĩ ai sẽ được cái cương vị đó?", "eng": "Who do you think will get the post?"}, {"viet": "Tại sao anh lại lừa tôi như thế?", "eng": "Why did you trick me like that?"}, {"viet": "Tại sao anh lại khúm núm như vậy trong văn phòng của giám đốc?", "eng": "Why were you so humble in the manager's office?"}, {"viet": "Bạn sẽ chỉnh nó đúng giờ được chứ?", "eng": "Will you make it on time?"}, {"viet": "Nhờ những dụng cụ bổ sung, kính viễn vọng đã có được khả năng lớn hơn.", "eng": "With auxiliary instruments the new telescope gained more power."}, {"viet": "Công việc tạm ngừng lại khi máy bị hỏng.", "eng": "Work was came to a halt when the machine broke down."}, {"viet": "Anh có thích dùng quả gì không táo hay cam?", "eng": "Would you like some fruit-an apple or an orange?"}, {"viet": "Xin cô vui lòng lấy cho tôi chút nước nóng?", "eng": "Would you please get me some hot water?"}, {"viet": "Vâng, và tôi muốn cái áo len cổ chui này được giặt tay bằng nước lạnh.", "eng": "Yes, and I'd like this sweater washed by hand in cold water."}, {"viet": "Ừ, có, phòng tập thể dục dụng cụ nằm ở phía trước trạm kế tiếp.", "eng": "Yes, there is, the gym is located in front of the next station."}, {"viet": "Anh sẽ bị nghiêm trị nếu anh bị bắt quả tang đang ăn cắp.", "eng": "You'll get it in the neck if you're caught stealing."}, {"viet": "Bạn đừng có phủ tấm khăn cũ rích đó lên cái ghế sofa cũ.", "eng": "You're not going to wear that moth-eaten sweater a moth-eaten old sofa."}, {"viet": "Anh có đủ tài năng để làm công việc tốt hơn thế này.", "eng": "You are capable of better work than this."}, {"viet": "Mày không thể thi đỗ được nếu không học, cho nên đừng có tự lừa dối mình ( là có thể đỗ mà không cần học ).", "eng": "You can't pass exams without working, so don't deceive yourself ( into thinking you can )."}, {"viet": "Anh đừng bao giờ trông mong rằng anh ta đến đúng giờ.", "eng": "You can never depend on his arriving on time."}, {"viet": "Thậm chí đến 3 giờ con vẫn chưa về nhà.", "eng": "You didn't even come home until three o'clock."}, {"viet": "Bạn bị chảy nước mũi kìa.", "eng": "You have snot in your nose."}, {"viet": "Trông anh khá xoàng xĩnh trong bộ quần áo đó.", "eng": "You look rather shabby in those clothes."}, {"viet": "Ắt hẳn bạn đã làm việc rất chăm chỉ.", "eng": "You must have worked very hard."}, {"viet": "Anh nên ngừng hút thuốc, tôi đã bỏ hút thuốc từ năm ngoái.", "eng": "You ought to give up smoking, I gave it up last year."}, {"viet": "Ông phải trả tiền mướn hàng tháng.", "eng": "You should pay the rent by month."}, {"viet": "Anh muốn nói với tôi cái gì phải không?.", "eng": "You want to tell me something?."}, {"viet": "Những đôi trẻ sờ nắn nhau ở sau xe.", "eng": "Young couples groping in the back of cars."}, {"viet": "Tên anh đứng trước tên tôi trong danh sách.", "eng": "Your name comes before mine on the list."}]