[{"viet": "Một cuốn sách kết tội những giá trị hiện đại.", "eng": "A book that indicts modern values."}, {"viet": "Một đứa bé vẽ bậy lung tung khắp quyển sách.", "eng": "A child scribbling all over a book."}, {"viet": "Liên hợp các công ty xây dựng sẽ xây nhà máy phát điện.", "eng": "A consortium of construction companies will build the power-station."}, {"viet": "Một quyết định ngoài ý muốn của ai.", "eng": "A decision beyond one's control."}, {"viet": "Tình trạng mơ mơ màng màng giữa ngủ và thức.", "eng": "A dream-like state between sleeping and waking."}, {"viet": "Một cuốn phim đầy xảo thuật quay phim khiến cho không che đậy nổi một cốt truyện yếu kém.", "eng": "A film full of tricksy camera work that fails to disguise a weak story."}, {"viet": "Một con ngựa cái nhỏ lì lợm cứ thích chạy.", "eng": "A gamy little mare that loved to run."}, {"viet": "Tiếng chép môi háu ăn khi hắn cắt miếng bít tết.", "eng": "A greedy smack of the slips as he cut into the steak."}, {"viet": "Một hệ thống nông nghiệp phát triển cao.", "eng": "A highly developed system of agriculture."}, {"viet": "Một ông vua khét tiếng tàn bạo.", "eng": "A king infamous for his cruelty."}, {"viet": "Một cuộc đời đầy đổi thay và muôn màu muôn vẻ.", "eng": "A life full of change and variety."}, {"viet": "Một tên điên hủy hoại bức tranh bằng cách cắt thủng nhiều lỗ.", "eng": "A madman mutilated the painting by cutting holes in it."}, {"viet": "Chính quyền quân sự đã nắm quyền kiểm soát đất nước.", "eng": "A military government took control of the country."}, {"viet": "Một chiếc xe ô tô mới đi cùng với một công việc.", "eng": "A new car goes with a job."}, {"viet": "Một bức tranh do Nữ hoàng có nhã ý cho mượn.", "eng": "A painting graciously loaned by Her Majesty the Queen."}, {"viet": "Một bài luận thuyết triết học đầy những điều khó hiểu.", "eng": "A philosophical essay full of obscurities."}, {"viet": "Dân số vào khoảng 100.000 người.", "eng": "A population in the vicinity of 100.000."}, {"viet": "Một tập đoàn đầu sỏ chính trị u tối cứ nhất định không chịu thấy rằng lịch sử đang muốn loại họ vào thùng rác.", "eng": "A purblind oligarchy that flatly refused to see that history was condemning it to the dustbin."}, {"viet": "Một phản ứng tình cảm của công chúng thuận lợi cho bị cáo.", "eng": "A revulsion of public feeling in favour of the accused."}, {"viet": "Một sự chế giễu thoái hóa, ác nghiệt và khôi hài một cách nham hiểm về nghệ thuật, nhân vật danh tiếng và tình yêu.", "eng": "A scrofulous, grim, darkly funny burlesque on art, celebrity, and love."}, {"viet": "Một bảng hướng dẫn đi cho đúng đường.", "eng": "A sign indicating a right road to follow."}, {"viet": "Một bản xô-nát theo khóa Mi giáng trưởng.", "eng": "A sonata in the key of E flat major."}, {"viet": "Một người lạ đi tới tôi và bắt tay của tôi.", "eng": "A stranger walked up to me and shook my hand."}, {"viet": "Một cậu thiếu niên lo sợ về những mụn trứng cá của cậu ta.", "eng": "A teenage boy worried about his spots."}, {"viet": "Một người Luân Đôn chính gốc thì sinh ra trong tầm âm thanh của chuông nhà thờ Bow Bells.", "eng": "A true Cockney is born within the sound of Bow Bells."}, {"viet": "Một người có tài dí dỏm và tài kể chuyện nổi tiếng.", "eng": "A well-known wit and raconteur."}, {"viet": "Abraham Lincoln đã nói rõ dân chủ là gì trong cuốn sách Gettysburg Address nổi tiếng của ông.", "eng": "Abraham Lincoln told clearly what democracy means in his famous Gettysburg Address."}, {"viet": "Hãy cộng tất cả các khoản tiền tôi nợ anh.", "eng": "Add up all the money I owe you."}, {"viet": "Sau tất cả những gì đã được nói và làm, các nhà cạnh tranh của chúng tôi rốt cuộc đã thành công.", "eng": "After all was said and done, our competitors had the last laugh."}, {"viet": "Sau vài lần bơm, nước bắt đầu chảy.", "eng": "After several pumps, the water began to flow."}, {"viet": "Bất chấp mọi nghịch cảnh nàng đã đạt ước mơ trở thành một vũ công ba lê.", "eng": "Against all the odds she achieved her dream of becoming a ballerina."}, {"viet": "Tất cả các con tôi đều có nét giống nhau rõ rệt của gia đình.", "eng": "All my children share a strong family likeness."}, {"viet": "Các bộ phận của tòa nhà hoàn toàn cân đối.", "eng": "All the parts of the building are in perfect balance."}, {"viet": "Những cây này trông thì giống nhau nhưng thật ra chúng khác hẳn nhau.", "eng": "Although they look similar, these plants are actually quite distinct."}, {"viet": "Một máy bay khó điều khiển được ở những tốc độ cao.", "eng": "An aircraft which is hard to control at high speeds."}, {"viet": "Một bộ bách khoa được xuất bản trong 25 tuần.", "eng": "An encyclopaedia published in 25 weekly parts."}, {"viet": "Một nền công nghiệp tăng tốc độ sản xuất để cạnh tranh trực tiếp với một đối thủ.", "eng": "An industry gearing up to go mano a mano with a rival."}, {"viet": "Một bản chuyển thể khúc nhạc giao hưởng cho đàn dây.", "eng": "An orchestral version of a suite for strings."}, {"viet": "Và chúng là một phương tiện chuyên chở quan trọng ở những vùng hoang mạc.", "eng": "And they are a very important means of transportation in desert regions."}, {"viet": "Khát khao mong cho anh của bạn ấy gặp anh.", "eng": "Anxious for his brother to meet you."}, {"viet": "Ở nước bạn, những người trưởng thành có còn phụ thuộc vào cha mẹ của họ không?", "eng": "Are many young adults dependent on their parents in your country?"}, {"viet": "Bạn ủng hộ hay chống lại sự thay đổi?", "eng": "Are you for or against change?"}, {"viet": "Giờ làm việc của quý vị có khác vào ngày trước lễ giáng sinh không?", "eng": "Are your hours different for Christmas Eve?"}, {"viet": "Chiều xuống bờ biển nhoà vào bóng đêm.", "eng": "As evening came, the coastline faded into darkness."}, {"viet": "Vì không có vật liệu thích hợp chúng tôi chỉ còn biết tuỳ cơ ứng biến.", "eng": "As we've not got the proper materials, we'll just have to improvise."}, {"viet": "Ít nhất là đồ gốm đã được phát hiện trong các tàn tích của những ngôi làng cổ ở nhiều nơi khác nhau trên thế giới.", "eng": "At least pottery has been found in the ruins of ancient villages in many different parts of the world."}, {"viet": "Tăng thêm thu nhập của ai bằng cách viết các bài điểm sách báo.", "eng": "Augment one's income by writing reviews."}, {"viet": "Hãy cẩn thận trong cách diễn đạt câu trả lời của mình.", "eng": "Be careful how you word your answer."}, {"viet": "Làm người bảo lãnh cho ai vay tiền của ngân hàng.", "eng": "Be somebody's guarantee for a loan from the bank."}, {"viet": "Anh ấy cho rằng điều hạnh phúc nhất là được sống một mình.", "eng": "Being alone is his idea of paradise."}, {"viet": "Thời gian phóng con tàu vũ trụ còn 30 giây nữa.", "eng": "Blast-off is in 30 seconds."}, {"viet": "Mang lại sự giảng hòa giữa các kẻ thù xưa.", "eng": "Bring about a reconciliation between former enemies."}, {"viet": "À, còn chuyện làm ăn của chị ra sao?", "eng": "But, well, how's business with you?"}, {"viet": "Nhưng vào những ngày cuối tuần ông dẫn tôi đi xem phim hay làm gì đó.", "eng": "But on weekends he takes me to the movies or something."}, {"viet": "Vì không có bằng chứng nên quan tòa đã trả tự do cho cô ấy.", "eng": "By allowing her to go free the judge gave the accused the benefit of the doubt."}, {"viet": "Tiểu bang California đang ở vị trí hàng đầu về các trào lưu trên toàn quốc.", "eng": "California is on the cutting edge of trends that spread nation wide."}, {"viet": "Tôi có thể ký một giấy nợ cho những thức uống tôi đã gọi không?", "eng": "Can I sign a chit for the drinks I've ordered?"}, {"viet": "Ông có thể tả lại cho tôi biết hình dạng của tên trộm được không?", "eng": "Can you give me a description of the thief?"}, {"viet": "Anh có thể khiến họ quay sang quan điểm của tôi được không?", "eng": "Can you swing them round to my point of view?"}, {"viet": "Những chiếc xe ôtô có 5 số tiến và một số lùi.", "eng": "Cars with five forward gears and a reverse."}, {"viet": "Trẻ con hớn hở tung tăng trong bộ quần áo dự tiệc.", "eng": "Children flouncing around in their party clothes."}, {"viet": "Phát quang bụi rậm và cày đất.", "eng": "Clear the scrub and plough the land."}, {"viet": "Những diễn viên hài nhại các thành viên trong chính phủ.", "eng": "Comedians who send up members of the government."}, {"viet": "Chúc mừng em trai anh đã lập gia đình!", "eng": "Congratulations on the marriage of your brother!"}, {"viet": "Chúng ta có thể nói chuyện riêng trước khi anh đi họp được không?", "eng": "Could we have a word before you go to the meeting?"}, {"viet": "Vui lòng cho tôi biết chúng tôi có thể xem gì đây?", "eng": "Could you tell me what we can see here?"}, {"viet": "Chặt các cành để đỡ các cây đậu trong vườn.", "eng": "Cut sticks to support peas in the garden."}, {"viet": "Những người đi cắm trại trông thiểu não dưới trời mưa.", "eng": "Dejected-looking campers in the rain."}, {"viet": "Các thám tử ập vào ngôi nhà đó lúc rạng đông.", "eng": "Detectives swooped on the house at dawn."}, {"viet": "Ông đã gặp người bạn đó của anh ta không?", "eng": "Did you meet that friend of his?"}, {"viet": "Tranh chấp chủ quyền quốc gia về các hòn đảo này.", "eng": "Disputing the country's title to the islands."}, {"viet": "Các quy tắc đó áp dụng cho trường hợp này được không?", "eng": "Do the rules cover a case like this?"}, {"viet": "Ông có thấy đau giống như vậy khi ăn cái gì đó chua không?", "eng": "Do you feel the same pain when you eat something sour?"}, {"viet": "Cô có cái áo khoác này cỡ lớn hơn không?", "eng": "Do you have this coat in a larger size?"}, {"viet": "Đừng có làm vậy chứ! cô ta nói, khi anh ấy chen vào đứng trước cô ta trong hàng người xếp hàng chờ đợi.", "eng": "Do you mind! she said, as he pushed into the queue in front of her."}, {"viet": "Bạn có nghĩ rằng phương tiện truyền thông đại chúng xâm phạm sự riêng tư của con người không?", "eng": "Do you think mass media invades people's privacy?"}, {"viet": "Các bác sĩ phải cung cấp loại dịch vụ suốt ngày đêm.", "eng": "Doctors must provide a round-the-clock service."}, {"viet": "Đừng có cố chen tất cả vào trong thang máy.", "eng": "Don't all try to squash into the lift together."}, {"viet": "Đừng mong đợi tôi kéo anh ra khỏi thế kẹt.", "eng": "Don't expect me to get you out of your scrapes."}, {"viet": "Đừng làm anh ta giống như thằng ngốc.", "eng": "Don't make him appear a fool."}, {"viet": "Đừng nói với anh ta ngoài những cái cần phải nói.", "eng": "Don't tell him more than you can help."}, {"viet": "Bác sĩ Green có thái độ ân cần và niềm nở khi khám bệnh bên giường bệnh nhân.", "eng": "Dr Green has a good bedside manner."}, {"viet": "Các thùng rác dùng để chứa rác rưởi trong nhà.", "eng": "Dustbins are used for household waste."}, {"viet": "Khích lệ cô ta bày tỏ những tình cảm sâu kín của cô ấy.", "eng": "Encouraging her to express her innermost feelings."}, {"viet": "Dù là vậy tôi cũng muốn nói chuyện với cô ta.", "eng": "Even so I have a mind to speak to her."}, {"viet": "Nghiên cứu từng chứng cớ riêng biệt.", "eng": "Examine each piece of evidence in isolation."}, {"viet": "Những nhà thám hiểm đi xa quê hương để khám phá ra những vùng đất mới.", "eng": "Explorers who ventured forth to discover new lands."}, {"viet": "Chiếc ghế riêng của cha, cái mà không ai khác được phép sử dụng.", "eng": "Father's own private chair, which no one else is allowed to use."}, {"viet": "Tìm một công dụng mới cho cái gì.", "eng": "Find a new use for something."}, {"viet": "Quần dài ống loe không còn là mốt thịnh hành nữa.", "eng": "Flared trousers have gone out of fashion."}, {"viet": "Vì lợi ích riêng của cô ta, cậu phải tỏ ra cứng rắn.", "eng": "For her own good, you must harden your heart."}, {"viet": "Lời chào hỏi thân mật từ các đoàn viên công đoàn anh em.", "eng": "Fraternal greetings from fellow trade-unionists."}, {"viet": "Đưa ra một câu trả lời tẻ nhạt và vô nghĩa cho một câu hỏi khó.", "eng": "Gave a vapid and unmeaning response to a difficult query."}, {"viet": "Choáng ngợp về sự thành công bước đầu trong việc kinh doanh của họ.", "eng": "Giddy with their first business success."}, {"viet": "Cho mọi người có thời gian tìm hiểu nhau sẽ làm cho buổi họp đỡ lạnh nhạt.", "eng": "Giving people time to get to know one another will make the meeting less impersonal."}, {"viet": "Hàng hóa bán với giá hấp dẫn.", "eng": "Goods for sale at attractive prices."}, {"viet": "Một nửa trung đoàn đã gục ngã trước cuộc tấn công của quân địch.", "eng": "Half the regiment fell before the enemy onslaught."}, {"viet": "Cầu thang đã được quét sạch sẽ chưa?", "eng": "Have the stairs been swept clean?"}, {"viet": "Trước đây bạn đã bao giờ học đàn pianô hay đàn ghi-ta chưa?", "eng": "Have you ever taken piano or guitar lessons before?"}, {"viet": "Ông đã chọn lựa xong loại giấy dán tường ông thích chưa?", "eng": "Have you settled on the wallpaper you prefer?"}, {"viet": "Ông ta là một người hầu như cố vấn không chính thức, nhưng tôi không biết chính xác ông ấy làm gì.", "eng": "He's a kind of unofficial adviser, but I'm not sure exactly what he does."}, {"viet": "Anh ta gặp may suốt đời và chẳng bao giờ phải tìm hiểu xem người khác sống thế nào.", "eng": "He's been lucky all his life and has never had to find out how the other half lives."}, {"viet": "Nó mắc nợ tới 200 pao.", "eng": "He's in debt to the extent of 200 pounds."}, {"viet": "Anh ta hay quấy rầy đến nỗi tôi phải luôn luôn giữ một khoảng cách với anh trong các buổi liên hoan.", "eng": "He's so boring that I always try to give him a wide berth at parties."}, {"viet": "Anh ấy đã hành động dũng cảm trong trận đánh.", "eng": "He acquitted himself bravely in the battle."}, {"viet": "Anh ấy ráp từng miếng của mô hình máy bay lại.", "eng": "He assembled the model aircraft bit by bit."}, {"viet": "Anh ta đưa tôi về bằng xe hơi của anh ta.", "eng": "He brought me back in his car."}, {"viet": "Hắn ấp ủ ảo tưởng là cô ta yêu hắn.", "eng": "He cherishes the illusion that she's in love with him."}, {"viet": "Ông ta chỉ trích các bác sĩ cấp trên, và luôn cả các vị quản trị bệnh viện, về việc chống đối các thay đổi.", "eng": "He criticized senior doctors, and by extension hospital administrators, for opposing the changes."}, {"viet": "Ông ấy chết một cách khủng khiếp và vô cùng đau đớn.", "eng": "He died horribly and in great pain."}, {"viet": "Ông ta chấm dứt bài diễn văn với lời nhận xét vui nhộn đầy dí dỏm.", "eng": "He ended his speech with a merry quip."}, {"viet": "Hắn té ngã thang và rơi phịch xuống đất.", "eng": "He felt off the ladder and landed bump on the ground."}, {"viet": "Anh ta nói loanh quanh mãi với tôi nhưng tôi vẫn chẳng biết câu trả lời cho câu hỏi của tôi ra sao.", "eng": "He gave me a lot of flannel but I still don't know the answer to my question."}, {"viet": "Anh ta giang rộng cánh tay với nụ cười hớn hở đón chào chúng tôi.", "eng": "He greeted us with an expansive gesture and a wide smile."}, {"viet": "Anh ta phải chạy rút để bắt kịp chiếc xe buýt.", "eng": "He had to sprint to catch the bus."}, {"viet": "Anh ấy đã được thu nhận vào Giáo Hội.", "eng": "He has been received into the Church."}, {"viet": "Ông ấy phải uống sáu viên thuốc một ngày cho đến khi ông bình phục.", "eng": "He has to take six pills a day until he recovers."}, {"viet": "Chính hắn thú nhận hắn là người hèn nhát.", "eng": "He is a coward by his own admission."}, {"viet": "Anh ta chưa đủ khoẻ để dẹp bỏ các viên thuốc đó đâu.", "eng": "He is not yet well enough to dispense with the pills."}, {"viet": "Anh ta nhảy qua xà cao hơn ba insơ.", "eng": "He jumped three inches clear of the bar."}, {"viet": "Ông ta thích được bà chủ nhà chăm lo quá đáng.", "eng": "He likes being mothered by his landlady."}, {"viet": "Ông ta đã mất điểm vì đánh quả bóng ra ngoài sân.", "eng": "He lost the point because the ball was out."}, {"viet": "Anh ta dời nhà đi mà không để lại địa chỉ mới.", "eng": "He moved house without leaving a forwarding address."}, {"viet": "Anh ấy dán tường bằng vải bao bố.", "eng": "He overlaid the walls with hessian."}, {"viet": "Ông ta đã tự làm hại yêu sách của mình bằng việc đòi hỏi bồi thường quá nhiều.", "eng": "He prejudiced his claim by demanding too much compensation."}, {"viet": "Ông ấy la lên om sòm khi ông ấy thấy mình đã bị lừa.", "eng": "He raised Cain when he found he had been cheated."}, {"viet": "Anh ta vẫn trơ trơ trước những lời lẽ ngọt ngào của Nell.", "eng": "He remained impervious to all Nell's blandishments."}, {"viet": "Trong môn crickê anh ta đánh gậy giỏi nhưng đánh bóng lăn tồi.", "eng": "He's a good batsman but a poor bowler."}, {"viet": "Anh ấy chán nản về công việc.", "eng": "He's cheesed off with his job."}, {"viet": "Anh ấy là người có sức mạnh ngang tôi.", "eng": "He's my equal in strength."}, {"viet": "Ông ta đã đi khắp thế giới.", "eng": "He's travelled the whole world."}, {"viet": "Nó bảo là nó sẽ không hợp tác phải không?", "eng": "He says he won't co-operate, does he?"}, {"viet": "Chỉ vài phút nữa ông ấy sẽ rảnh.", "eng": "He should be free in just a few minutes."}, {"viet": "Chẳng mấy chốc anh ta lái tàu thành thạo.", "eng": "He soon became adroit at steering the boat."}, {"viet": "Anh ta trang bị cho mình một kiến thức đầy đủ về văn học của Hy lạp và La Mã cổ đại.", "eng": "He steeped himself in the literature of ancient Greece and Rome."}, {"viet": "Anh ta bị nỗi thất vọng chế ngự và rốt cuộc phải tự tử.", "eng": "He surrenders himself to despair and eventually committed suicide."}, {"viet": "Anh ta chơi một điệu nhạc ầm ĩ bằng pianô.", "eng": "He thumped out a tune on the piano."}, {"viet": "Anh ta đi du lịch khắp mọi nơi trên trái đất.", "eng": "He travels in every quarter of the globe."}, {"viet": "Anh ta dùng tiền tiết kiệm cả đời để mua công việc kinh doanh đó.", "eng": "He used his life savings to buy the business."}, {"viet": "Ông ta trước đây là một diễn viên cừ, nhưng bây giờ thì có phần hết thời rồi.", "eng": "He was a fine actor but he's a bit passé now."}, {"viet": "Anh ấy bị ánh nắng làm chói mắt.", "eng": "He was blinded by the sunlight."}, {"viet": "Anh ta bị biến dạng suốt đời vì những vết bỏng trong một tai nạn.", "eng": "He was disfigured for life by the burns he received in the accident."}, {"viet": "Anh ta bị một cây đổ đập vào và chết ngay tại chỗ.", "eng": "He was hit by a falling tree and killed on the spot."}, {"viet": "Nó đã chạy trốn một tuần lễ trước khi bị cảnh sát bắt.", "eng": "He was on the run for a week before the police got him."}, {"viet": "Ông ta nói vắn tắt và đi ngay vào vấn đề.", "eng": "He was short-dated and went to the point."}, {"viet": "Hắn quá lười biếng, thậm chí không nhắc nổi người lên để trả lời điện thoại.", "eng": "He was too lazy to bestir himself even to answer the telephone."}, {"viet": "Mặc dù chúng tôi ngăn cản nó cũng cứ đi.", "eng": "He went not with standing our remonstrances."}, {"viet": "Anh ta giành giải nhất trong cuộc thi đó.", "eng": "He won the first prize in the competition."}, {"viet": "Nghe những khúc nhạc oóc gan nhà thờ.", "eng": "Hear the strains of the church organ."}, {"viet": "Sau vụ tai nạn cánh tay cô ấy thâm tím.", "eng": "Her arm was black and blue after the accident."}, {"viet": "Quần áo cô ấy dính đầy bùn.", "eng": "Her clothes were bespattered with mud."}, {"viet": "Mắt cô ta sáng ngời với niềm vui.", "eng": "Her eyes lit up with joy."}, {"viet": "Tay cô ấy run lên vì lo lắng.", "eng": "Her hands are shaky because she's nervous."}, {"viet": "Cuốn sách mới nhất của bà ta viết về các vấn đề của những người tàn tật.", "eng": "Her latest book discussed the problems of the disabled."}, {"viet": "Vở kịch mới của cô ấy đã thất bại chỉ sau ba đêm biểu diễn.", "eng": "Her new play bombed after only three nights."}, {"viet": "Sự ứng xử nhanh nhẹn của nàng đã cứu được mạng chàng.", "eng": "Her quick action saved his life."}, {"viet": "Bài diễn văn của bà ta từ đầu đến cuối chỉ có một điệu.", "eng": "Her speech was all in the same key."}, {"viet": "Hành vi bừa bãi của cô ta chỉ thổi bùng thêm ngọn lửa ghen tuông của hắn.", "eng": "Her wild behaviour merely fanned the flames of his jealousy."}, {"viet": "Hãy giấu nó vào chỗ những con mắt tò mò không thể thấy được.", "eng": "Hide it where curious eyes won't see it."}, {"viet": "Kẻ tấn công đã rạch anh ta bằng dao cạo.", "eng": "His attacker cut at him with a razor."}, {"viet": "Sức hấp dẫn của anh ta là không thể phủ nhận được, nhưng tôi vẫn còn chưa tin anh ta.", "eng": "His charm is undeniable, but I still mistrust him."}, {"viet": "Những trò đùa ghê tởm của anh ta đã làm cho mọi người bực bội.", "eng": "His disgusting jokes gave everybody the pip."}, {"viet": "Gia đình ông ta phải đóng vai trò thứ yếu đối với sự nghiệp chính trị của ông.", "eng": "His family has had to play second fiddle to his political career."}, {"viet": "Đầu của anh ta nhét đầy những điều vô bổ.", "eng": "His head is cluttered up useless facts."}, {"viet": "Nơi yên nghỉ cuối cùng của ông ta là trên ngọn đồi kia.", "eng": "His last resting-place is on that hill."}, {"viet": "Tên tuổi của ông ta đã trở thành một điển hình của sự tàn bạo.", "eng": "His name has become a byword for cruelty."}, {"viet": "Những vở kịch của ông ta đã bị thất bại ở Mỹ.", "eng": "His plays went down badly in America."}, {"viet": "Quy tắc của ông về năm nhuận vẫn đúng.", "eng": "His rule for leap years works well."}, {"viet": "Thành công của ông ta đạt được nhờ làm việc chăm chỉ.", "eng": "His success was achieved by hard work."}, {"viet": "Vợ ông ta đã đẻ sinh ba.", "eng": "His wife gave birth to triplets."}, {"viet": "Các công việc vào ngày nghỉ thì nhiều và khác nhau.", "eng": "Holiday jobs are many and varied."}, {"viet": "Vợ anh có khoẻ không? Nhà tôi khoẻ, cảm ơn anh.", "eng": "How's your wife? She's fine, thank you."}, {"viet": "Em làm việc đó thật là khéo!", "eng": "How clever of you to do that!"}, {"viet": "Bạn làm việc với đồng nghiệp như thế nào?", "eng": "How do you get along with your co-workers?"}, {"viet": "Kim phút của đồng hồ chạy vòng quanh một lần hết bao lâu?", "eng": "How long does it take the minute hand of the clock to go round once?"}, {"viet": "Bạn xem tivi một tuần mấy tiếng?", "eng": "How many hours a week do you watch T. V.?"}, {"viet": "Bây giờ mua một cái computer cơ bản bình thường mất bao nhiêu tiền?", "eng": "How much do you have to pay for a basic, boy standard computer these days?"}, {"viet": "Đồng Yên Nhật mạnh thế nào?", "eng": "How strong is the Japanese yen?"}, {"viet": "Vợ chồng lạnh lùng buộc tội nhau.", "eng": "Husband and wife turned coldly accusing backs toward each other."}, {"viet": "Tôi muốn xem anh ta tránh né cách nào để thoát khỏi vụ rắc rối này.", "eng": "I'd like to see him talk his way out of this one."}, {"viet": "Nếu anh ta thi qua kỳ thi lái xe thì tôi cứ đi đằng đầu.", "eng": "I'll eat my hat if he ever passed his driving test."}, {"viet": "Tôi sẽ báo cho ông biết nếu có trường hợp hủy vé.", "eng": "I'll notify you if there's a cancellation."}, {"viet": "Tôi e rằng ông ta không có bản tính giết người.", "eng": "I'm afraid he lacks the killer instinct."}, {"viet": "Tôi cảm thấy rất khổ sở, tôi mệt, lạnh và đói.", "eng": "I'm feeling miserable, I'm tired, cold and very hungry."}, {"viet": "Tôi chán ngấy cái thời tiết ẩm ướt này.", "eng": "I'm heartily sick of this wet weather."}, {"viet": "Tôi không chắc, nhưng tôi nghĩ đồng hồ treo tường đó chạy chậm.", "eng": "I'm not sure, but I think that clock is slow."}, {"viet": "Tôi rất tiếc, ông đã hút thuốc làm cháy thủng một lỗ trên tấm trải giường.", "eng": "I'm sorry but you burnt a hole in the bed sheet with a cigarette."}, {"viet": "Tôi đang nghĩ đến việc đưa vấn đề này ra với vị nghị sĩ của tôi.", "eng": "I'm thinking of taking the matter up with my MP."}, {"viet": "Kể từ cách đây rất lâu, tôi thường đến đó mỗi mùa hè.", "eng": "I've been going there every summer since the year dot."}, {"viet": "Mình bị thủng lốp và bánh xe dự phòng cũng bị bẹp nốt!", "eng": "I've got a puncture and my spare is flat too!"}, {"viet": "Tôi đã có hẹn để sửa sắc đẹp cho mặt tuần tới.", "eng": "I've made an appointment for a facial next week."}, {"viet": "Mình vừa rửa cái xe cho cậu May quá nhỉ!", "eng": "I've washed the car for you wonders will never cease!"}, {"viet": "Tôi luôn luôn nghỉ lễ Giáng sinh với gia đình.", "eng": "I always spend Christmas with my nearest and dearest."}, {"viet": "Tôi chắc là tôi đã cho tiền vào hộp.", "eng": "I am sure that I put the money in the box."}, {"viet": "Tôi kết bạn với một đứa bé cô đơn ở trong làng.", "eng": "I befriended a lonely little boy in the village."}, {"viet": "Tôi đã đến gặp John, nhưng anh ấy không có mặt.", "eng": "I came to meet John, but he never showed up."}, {"viet": "Tôi không thể mở được hộp này, để tôi thử một cái.", "eng": "I can't open that jar, let me have a go."}, {"viet": "Tôi có thể đổi tiền giấy cho ông nhưng chúng tôi không thể nhận tiền kim loại.", "eng": "I can exchange the notes for you but we cannot take the coins."}, {"viet": "Tôi không thể ăn thêm chút nào nữa.", "eng": "I can't eat any more."}, {"viet": "Khi đi làm về tôi ngủ liền ba tiếng đồng hồ.", "eng": "I conked out for three hours when I got home from work."}, {"viet": "Tôi vui mừng được anh giúp đỡ.", "eng": "I'd be glad of your help."}, {"viet": "Tôi đã gọi cho họ nhưng họ nói với tôi là máy tính của tôi bị hư.", "eng": "I did but they told me that my computer is broken."}, {"viet": "Tôi rất đồng ý với bạn về điểm đó.", "eng": "I do agree with you there."}, {"viet": "Tôi không biết là anh ta có đến hay không?", "eng": "I don't know whether he'll come or not?"}, {"viet": "Tôi không nghĩ là cô ta nắm được cái chốt của câu chuyện.", "eng": "I don't think she saw the point of the story."}, {"viet": "Tôi nghi ngờ ông ta là một nhà khoa học xuất sắc, nhưng mà ông ấy có dạy học được không?", "eng": "I don't doubt that he is a brilliant scientist, but can he teach?"}, {"viet": "Hôm qua tôi đã uống quá nhiều, vì thế hôm nay tôi vẫn còn thấy khó chịu.", "eng": "I drank too much yesterday so I'm hungover today."}, {"viet": "Tôi cảm thấy tôi đã được đền bù xứng đáng với công sức bỏ ra và giờ tôi đã sung sướng để được nghỉ ngơi.", "eng": "I feel I've had an excellent run for my money and now I'm happy to retire."}, {"viet": "Tôi lấy làm bực mình không nói được ngoại ngữ.", "eng": "I find it frustrating that I can't speak other languages."}, {"viet": "Tôi trợ cấp cho các con tôi mỗi tháng 10 đô la.", "eng": "I give my children $ 10 per month as allowance."}, {"viet": "Tôi có cảm giác rõ ràng là mình đang bị theo dõi.", "eng": "I had a distinct impression that I was being watched."}, {"viet": "Tôi phải tốn hết 200 bảng Anh để sửa chiếc xe của tôi.", "eng": "I had to pay out £ 200 to get my car repaired."}, {"viet": "Tôi có hẹn với ông Vương Lý.", "eng": "I have an appointment with Mr. Wang Li."}, {"viet": "Tôi không có lời nào đủ để bày tỏ lòng biết ơn của tôi.", "eng": "I have no words to express my gratitude."}, {"viet": "Tôi đi đôi bít tất cho đến khi thủng nhiều lỗ.", "eng": "I have worn my socks into holes."}, {"viet": "Tôi nghe nói có nhiều luật sư ở Mỹ.", "eng": "I hear there are many lawyers in the U. S."}, {"viet": "Tôi hy vọng lũ trẻ đều mạnh cả.", "eng": "I hope the children are okay."}, {"viet": "Tôi thật sự không thể cảm thụ được loại nhạc rốc mạnh.", "eng": "I just can't relate to punk music."}, {"viet": "Tôi biết thuốc này có vị khó chịu, nhưng hãy uống hết đi.", "eng": "I know the medicine tastes nasty, but drink it down."}, {"viet": "Tôi thích để lại những miếng ngon nhất vào lúc cuối cùng.", "eng": "I like to leave the best bits till last."}, {"viet": "Tôi sẽ vui lòng làm điều đó.", "eng": "I'll do it with pleasure."}, {"viet": "Tôi sẽ ủng hộ anh dù bất cứ điều gì xảy ra.", "eng": "I'll stand by you whatever happens."}, {"viet": "Tôi đang trông đợi sự giúp đỡ của anh.", "eng": "I'm banking on you to help me."}, {"viet": "Tôi chỉ xem thôi cám ơn.", "eng": "I'm just looking, thank you."}, {"viet": "Tôi rất tiếc là không thể đồng ý với anh về vấn đề đó.", "eng": "I'm sorry to differ with you on that."}, {"viet": "Tôi có ý muốn nó là một cuộc thảo luận không chính thức, nhưng hoá ra nó đã không như tôi dự định.", "eng": "I meant it to be an informal discussion, but it didn't turn out as I intended it should."}, {"viet": "Phải nói rằng tôi đánh giá cao tối đa về tài ứng xử khéo léo của anh trong hoàn cảnh khó khăn.", "eng": "I must say I give you full marks for your tactful handling of a difficult situation."}, {"viet": "Tôi không hề muốn bạn phải đến một mình.", "eng": "I never meant that you should come alone."}, {"viet": "Tôi liếc nhìn qua cửa sổ xem cô ấy có ở đó không.", "eng": "I peeped through the window to see if she was there."}, {"viet": "Tôi với tay qua bàn lấy món mứt.", "eng": "I reached across the table for the jam."}, {"viet": "Tôi lấy làm tiếc anh ta cứ luôn nêu lên vấn đề đó.", "eng": "I regret his ever having raised the matter."}, {"viet": "Tôi đã không thấy cả ông lẫn bà Smith ở nhà thờ.", "eng": "I saw neither Mr or Mrs Smith at church."}, {"viet": "Chỉ trong chốc lát là tôi gặp anh thôi.", "eng": "I shall only be a moment."}, {"viet": "Tôi để cả buổi sáng cố thu thập các tài liệu mà tôi đang cần.", "eng": "I spent the morning trying to round up the documents I needed."}, {"viet": "Tôi dám chắc là anh đã đọc cuốn sách này rồi.", "eng": "I take it for granted you have read this book."}, {"viet": "Tôi nghĩ đó là màu dịu hơn nhiều.", "eng": "I think it is a much softer color."}, {"viet": "Em nghĩ là anh có thể mua hết mọi thứ ở siêu thị.", "eng": "I think you should be able to get all of it at the supermarket."}, {"viet": "Tôi coi anh là người thật thà.", "eng": "I took you to be an honest man."}, {"viet": "Anh đã từng thích nhất môn giáo dục thể chất.", "eng": "I used to like physical education best."}, {"viet": "Tôi muốn tích luỹ đủ dặm để được vé miễn phí.", "eng": "I want to accumulate enough miles for free tickets."}, {"viet": "Tôi muốn đi Ấn Độ vào tháng Sáu nhưng định mệnh đã quyết định khác đi.", "eng": "I wanted to go to India in June, but fate decided otherwise."}, {"viet": "Tôi buộc phải thừa nhận rằng có thể cô ta đúng Chắc chắn rằng đây là chuyện quan trọng, tôi thừa nhận với anh điều đó.", "eng": "I was forced to concede that she might be right It's certainly big, I'll concede you that."}, {"viet": "Tôi bị cảnh sát hỏi cung trong sáu tiếng đồng hồ.", "eng": "I was questioned by the police for six hours."}, {"viet": "Tôi đã thức suốt đêm vì nôn mửa đấy.", "eng": "I was up all night vomiting."}, {"viet": "Tôi sẽ cần nó vào sáng mai.", "eng": "I will need it tomorrow morning."}, {"viet": "Tôi sẽ không bỏ qua dịp được dùng thử những món ăn ngon như thế này đâu.", "eng": "I won't miss a chance of trying such nice things."}, {"viet": "Tôi sẽ dậy sớm và ăn sáng.", "eng": "I would get up early and eat my breakfast."}, {"viet": "Tôi sẽ rất cảm kích nếu anh giúp tôi đòi tiên hoàn lại.", "eng": "I would much appreciate it if you would help me to claim for the refund."}, {"viet": "Nếu có khách hàng đến trước khi tôi trở về thì bảo họ đợi nhé.", "eng": "If a customer comes in before I get back ask them to wait."}, {"viet": "Nếu không nhìn thấy nó làm thì không bao giờ tôi tin nó lại có thể làm được việc đó.", "eng": "If I hadn't seen him doing it I would never have believed it of him."}, {"viet": "Nếu lạc đà mang nặng, nó sử dụng thức ăn nhanh.", "eng": "If the camel is carrying a heavy load, it uses food fast."}, {"viet": "Nếu ta nâng điểm cho nó một chút thì nó sẽ vừa đủ để đỗ.", "eng": "If we mark him up a tiny bit, he'll just get through."}, {"viet": "Nếu anh cứ tiếp tục cư xử thế này họ sẽ có cớ sa thải anh.", "eng": "If you continue to behave like this you will provide them with grounds for dismissing you."}, {"viet": "Nếu bạn biết tiếng Anh bạn có thể giao dịch với nhiều người.", "eng": "If you know English, you can communicate with a lot of people."}, {"viet": "Nếu anh muốn đi kịp chuyến xe lửa đó, chúng ta phải đi ngay ra nhà ga.", "eng": "If you want to catch that train we'd better set off for the station immediately."}, {"viet": "Trong một đồng hồ to để đứng, một quả nặng làm quay các bánh xe y như các đồng hồ cổ xưa.", "eng": "In a grandfather clock a weight turns the wheels just as in earlier clocks."}, {"viet": "Thật ra, tôi đã được vài công ty lớn hơn đề nghị những việc làm hấp dẫn.", "eng": "In fact, I have received attractive job offers from a few larger corporations."}, {"viet": "Theo ý kiến của tôi và ý kiến của nhiều người, đây là một sự đầu tư rất chắc chắn.", "eng": "In my opinion and in the opinion of most people, it is a very sound investment."}, {"viet": "Khi chiếc xe bị đâm, người lái xe bị hất mạnh qua cửa kính che gió.", "eng": "In the crash the driver catapulted through the windscreen."}, {"viet": "Ở thời buổi người ta có ý thức bảo tồn này, các khu vực đồng cỏ không còn có thể bị tàn phá nữa.", "eng": "In these conservation-conscious times, areas of grassland are no longer expendable."}, {"viet": "Những thông tin về sao Kim do các tàu thăm dò vũ trụ của Nga thu được.", "eng": "Information about Venus obtained by Russian probes."}, {"viet": "Nó giống như một lời cầu nguyện trời mưa phải không?", "eng": "Is it like a prayer for rain?"}, {"viet": "Có lý do ( đặc biệt ) gì mà anh không thể đến được?", "eng": "Is there any ( particular ) reason why you can't come?"}, {"viet": "Hôm nay trời lạnh quá nhỉ?", "eng": "Isn't it too cold today?"}, {"viet": "Nó nói về một phụ nữ trẻ rất ham thích bạn trai.", "eng": "It's about a young woman who is very interested in boys."}, {"viet": "Khó mà tìm ra sự dung hoà hai đòi hỏi trái ngược đó.", "eng": "It's difficult to strike a balance between these two demands."}, {"viet": "Chúng ta đã không đi chơi lúc trời mưa thế này thật đúng là một điều tốt.", "eng": "It's just as well that we didn't go out in this rain."}, {"viet": "Không phải hạ giá mà là chất lượng tốt giúp chúng tôi bán được hàng hoá.", "eng": "It's not their low price but their quality which sells our goods."}, {"viet": "Thật đáng ngạc nhiên nhiều người lớn không biết đọc hoặc viết.", "eng": "It's surprising how many adults can't read or write."}, {"viet": "Nó, ở một mặt nào đó, trở thành biểu tượng của thành phố.", "eng": "It, in a way, becomes the symbol of the city."}, {"viet": "Nó có mùi rất nồng nặc.", "eng": "It has a very strong smell."}, {"viet": "Thật khó làm việc trong một không gian bị hạn chế như thế này.", "eng": "It is hard to work efficiently in such a confined space."}, {"viet": "Đôi khi đi bộ mà mang giày gót cao thì khó đi.", "eng": "It is sometimes difficult to walk with high heels."}, {"viet": "Khước từ đề nghị của nó có thể là không khôn ngoan.", "eng": "It might be impolitic to refuse his offer."}, {"viet": "Rất vui khi gặp lại bạn.", "eng": "It's nice to see you again."}, {"viet": "Dường như ông rất thích đồ thủ công mỹ nghệ Trung Quốc.", "eng": "It seems that you like Chinese arts and handicrafts very much."}, {"viet": "Đó là một ca sinh nở khó: chị ta phải mổ để lấy con ra.", "eng": "It was a difficult birth: she had to have a Caesarean."}, {"viet": "Có thông báo rằng Tổng thống đã bị bắn chết.", "eng": "It was given out that the President had been shot."}, {"viet": "Đó là cơ hội mà cô ta đã chờ đợi.", "eng": "It was the chance she had been waiting for."}, {"viet": "Chống đối với nó sẽ là nguy hiểm.", "eng": "It would be dangerous to antagonize him."}, {"viet": "Máy thu hình của Nhật hầu hết là có chất lượng tuyệt hảo.", "eng": "Japanese TV sets are, for the most part, of excellent quality."}, {"viet": "Giu-đa đã phản bội nộp Giê-su ( cho nhà chức trách ).", "eng": "Judas betrayed Jesus ( to the authorities )."}, {"viet": "Krishma là hoá thân của thần Vishnu.", "eng": "Krishma was an avatar of the god Vishnu."}, {"viet": "Chúng ta hãy ngừng lại ở hiệu thuốc để mua thịt băm đi.", "eng": "Let's stop off at drugstore for a hamburger."}, {"viet": "Cuộc sống lúc đó là một loạt thành công rực rỡ nhất thời.", "eng": "Life then was a succession of giddy triumphs."}, {"viet": "Nhiều bạn của tôi dùng máy tính xử lý văn bản, nhưng tôi thì vẫn tin dùng cái máy chữ cũ của tôi.", "eng": "Many of my friends are using word progressors but I still swear by my old typewriter."}, {"viet": "Những kết luận của Marsden phù hợp hoàn toàn với lý thuyết của chúng tôi.", "eng": "Marsden's conclusions tie in with our theory perfectly."}, {"viet": "Cho phép tôi được biết ông xuất khẩu những mặt hàng chủ yếu nào?", "eng": "May I know the main items you export?"}, {"viet": "Của cháu số 7789 và 779.", "eng": "Mine are numbers 7789 and 779.0."}, {"viet": "Hầu hết cây đều rụng lá vào mùa đông.", "eng": "Most trees lose their foliage in winter."}, {"viet": "Người phụ tá của tôi sẽ điều khiển máy ghi âm.", "eng": "My assistant will operate the tape-recorder."}, {"viet": "Cha tôi thường bao giờ cũng kể truyện cho chúng tôi nghe lúc đi ngủ.", "eng": "My father always used to tell us bedtime stories."}, {"viet": "Mối quan tâm chủ yếu của tôi là sự chăm nom trẻ em.", "eng": "My main concern is the welfare of the children."}, {"viet": "Chị tôi trông nom lũ trẻ trong khi chúng tôi đi vắng.", "eng": "My sister is taking care of the children while we're away."}, {"viet": "Cột trụ Nelson là một đài kỷ niệm nổi tiếng ở London.", "eng": "Nelson's Column is a famous monument in London."}, {"viet": "Không, tôi đang nghĩ đến tìm một công việc khác.", "eng": "No, I'm thinking of getting another job."}, {"viet": "Không doanh nghiệp mới nào có thể phát đạt trong thời buổi kinh tế hiện nay.", "eng": "No new business can flourish in the present economic climate."}, {"viet": "Bây giờ tôi mới biết hắn khùng, lần này hắn đã đánh cắp xe của cảnh sát.", "eng": "Now I know he has a screw loose, he stole a police car this time."}, {"viet": "Tất nhiên là không, anh ta bĩu môi nói bệnh làm xoăn lá cây.", "eng": "Of course not, he said, with a curl of his lip."}, {"viet": "Tôi nghĩ là cũng tốt, nhưng có một điều tôi không tài nào quen được.", "eng": "Ok, I guess, but there's one thing I can't quite get use to."}, {"viet": "Một khi có chén rượu trong tay thì cậu ta ngồi lỳ đây mãi mãi.", "eng": "Once he gets a drink in his hand he's here for ever and ever."}, {"viet": "Một trong những cách dễ dàng nhất để có một sự tin tưởng khi làm việc là luôn luôn có mặt đúng giờ.", "eng": "One of the easiest ways to earn trust at a job is always show up on time."}, {"viet": "Trại của chúng ta đêm qua ở ngay trên ngọn đồi đó.", "eng": "Our camp last night was just over that hill."}, {"viet": "Nhà tôi ở cách xa hai quán rượu trong làng như nhau.", "eng": "Our house is equidistant from the two pubs in the village."}, {"viet": "Phi đội của chúng tôi tách ra để tiến công máy bay ném bom của địch.", "eng": "Our squadron peeled off to attack enemy bombers."}, {"viet": "Bố mẹ nào cũng mong muốn con cái mình thành đạt.", "eng": "Parents are always keen for their children to get on."}, {"viet": "Người ta có thể có phản ứng xấu với một số thức phụ gia nào đó.", "eng": "People can react badly to certain food additives."}, {"viet": "Nhấc điện thoại lên và quay số, nhưng nhận được tín hiệu bận máy và gác máy.", "eng": "Picks up phone and dials, but gets a busy signal and hangs up."}, {"viet": "Sự ô nhiễm trong cung cấp nước đã đạt tới mức độ nguy hại cho sức khoẻ của dân cư.", "eng": "Pollution of the water supply reached a level pernicious to the health of the population."}, {"viet": "Sarah đang tô màu bức tranh trong sách của nó.", "eng": "Sarah is colouring the picture in her book."}, {"viet": "Các bóng kéo dài hơn khi mặt trời xuống thấp.", "eng": "Shadows are longer when the sun is low in the sky."}, {"viet": "Bà ấy là một đảng viên Cộng sản.", "eng": "She's a member of the Communist Party."}, {"viet": "Chắc chắn cô ta được tôi đánh giá cao vì cô ta dám nói thẳng với ông chủ những gì cô suy nghĩ về ông ta.", "eng": "She's certainly gone up in my estimation since she told the boss what she thought of him."}, {"viet": "Bà ấy rất thích tiến xa hơn nữa trong sự nghiệp của cô ấy.", "eng": "She's keen to get ahead in her career."}, {"viet": "Cô ta quá khinh người, chẳng bao giờ nói chuyện với láng giềng.", "eng": "She's so snooty, she never speaks to the neighbours."}, {"viet": "Cô ta viết thêm phần tái bút xin tôi gửi cho cô ta ít tiền.", "eng": "She added a PS asking me to send her some money."}, {"viet": "Cô ta chớp mắt khi ánh sáng chiếu vào.", "eng": "She blinked as the bright light shone on her."}, {"viet": "Bà ta phàn nàn ầm ĩ với người bán hàng mà người này lại trả lời bà ta một cách nhẹ nhàng.", "eng": "She complained loudly to the shopkeeper who answered her mildly."}, {"viet": "Cô ta phủ nhận mọi sự dính líu vào vụ trộm.", "eng": "She denies any involvement in the robbery."}, {"viet": "Cô ta kiếm sống bằng cách hát ở một hộp đêm.", "eng": "She earned her living by singing in a nightclub."}, {"viet": "Cô đã tha thứ cho anh ta về những lời nhận xét thiếu suy nghĩ của anh.", "eng": "She forgave him his thoughtless remark."}, {"viet": "Cô ấy đã chán ngấy anh bạn trai, vì vậy cô ấy cắt đứt quan hệ với anh ta.", "eng": "She got fed up with her boyfriend, so she gave him the elbow."}, {"viet": "Cô ta phải sửa lại áo quần sau khi đã sút cân.", "eng": "She had to alter her clothes after losing weight."}, {"viet": "Bà ta bận rộn nhiều việc, kể cả làm vườn và nấu rượu.", "eng": "She has many occupations including gardening and wine-making."}, {"viet": "Cố ấy làm cả lớp cùng cười theo.", "eng": "She infected the whole class with her laughter."}, {"viet": "Cô ta chịu trách nhiệm về việc quảng cáo giới thiệu các mặt hàng.", "eng": "She is responsible for sales promotion."}, {"viet": "Cô ấy biết chấp nhận phê bình không hằn thù.", "eng": "She learned to accept criticism without rancour."}, {"viet": "Cô ấy thích âm nhạc dịu dàng của những bài hát cổ.", "eng": "She loved the dreamy music of those old songs."}, {"viet": "Cô ấy không bao giờ đến dự các cuộc họp mặt của lớp.", "eng": "She never came to our class reunion."}, {"viet": "Cô ấy chơi dường như không trổ hết tài.", "eng": "She plays with seemingly effortless skill."}, {"viet": "Cô ta từ chối không chịu làm hoà với người anh của cô.", "eng": "She refused to be reconciled with her brother."}, {"viet": "Nàng đã đi được một giờ.", "eng": "She's been going an hour."}, {"viet": "Cô ấy đã có người tình mới.", "eng": "She's taken a new lover."}, {"viet": "Cô ta dường như tươi tỉnh lên một chút trước điều đó.", "eng": "She seemed to brighten up a bit at this."}, {"viet": "Cô ta lừ đừ đi qua tôi, hai tay đút túi.", "eng": "She slouched past me with her hands in her pockets."}, {"viet": "Cô ấy đánh diêm để châm nến.", "eng": "She struck a match, to light the candles."}, {"viet": "Cô ấy kể cho anh ấy nghe những giai thoại về bệnh viện và bệnh nhân.", "eng": "She told him anecdotes about the hospital and the patients."}, {"viet": "Cô ta vốn trầm mặc, nhưng nay cô đã thực sự ra khỏi cái vỏ của mình và trò chuyện với mọi người.", "eng": "She used to be so quiet, but now she's really coming out of her shell and chatting to everyone."}, {"viet": "Cô ta lấy làm phẫn uất khi biết rằng hắn đã nói dối cô.", "eng": "She was aggrieved to find that he lied to her."}, {"viet": "Cô ta đã bị loại ngay vòng đầu.", "eng": "She was disqualified in the first round."}, {"viet": "Cô bé bị phạt giữ lại lớp một tiếng vì nói chuyện trong giờ học.", "eng": "She was kept in for an hour for talking in class."}, {"viet": "Cô ta nhay mãi ổ bánh mì bằng một con dao cùn.", "eng": "She was sawing away at the bread with a blunt knife."}, {"viet": "Cô ta lưỡng lự về chuyện có nên nhận lời cầu hôn của anh ta hay không.", "eng": "She was undecided about whether she should accept his offer."}, {"viet": "Khi tôi nói cho bà ấy biết là tôi đã đâm hỏng xe của bà, bà ta rất tức giận.", "eng": "She went through the roof when I told her I'd crashed her car."}, {"viet": "Cô ta đã làm việc ở ngân hàng một thời gian trước khi học luật.", "eng": "She worked in a bank for a while before studying law."}, {"viet": "Chống đà bên trái ngôi nhà cũ lên cho nó khỏi sập xuống.", "eng": "Shore up the side of an old house to stop it falling down."}, {"viet": "Silly là thể thường, còn Sillier là thể so sánh bậc hơn.", "eng": "Silly is the positive and sillier the comparative."}, {"viet": "Mức lương hưu tùy thuộc thâm niên công vụ tại công ty đó.", "eng": "Size of pension depends on length of service with the company."}, {"viet": "Hút thuốc lá có hại cho sức khoẻ của bạn.", "eng": "Smoking is harmful to your health."}, {"viet": "Như thế là mày đã làm vỡ ba cửa kính ngày hôm nay-mày giỏi thật đấy.", "eng": "So you've broken three windows today-you've really excelled yourself."}, {"viet": "Một số bài tập tiếng Anh sơ đẳng cho học viên.", "eng": "Some elementary English exercises for the learner."}, {"viet": "Tôi nghe nói một số người ăn cá nhám đấy.", "eng": "Some people eat them, I hear."}, {"viet": "Có ai đã gây ra sự xúi quẩy cho chiếc ô tô này: nó luôn luôn gây ra rắc rối cho tôi.", "eng": "Someone's put a jinx in this car: it's always giving me trouble."}, {"viet": "Âm thanh truyền qua môi trường không khí.", "eng": "Sound travels through the medium of air."}, {"viet": "Thánh Christopher là thánh che chở cho các khách du lịch.", "eng": "St Christopher is the patron saint of travellers."}, {"viet": "Kích động các đảng viên quá khích nổi dậy.", "eng": "Stir militant party members to revolt."}, {"viet": "Khi vào đúng vụ, dâu tây rẻ hơn.", "eng": "Strawberries are cheaper when they're in season."}, {"viet": "Mọi cái còn lại sau khi đóng thuế sẽ là của con khi bố chết.", "eng": "Such as remains after tax will be yours when I died."}, {"viet": "Mặt trời mọc-và thế là trang trại lại náo nhiệt.", "eng": "Sunrise-and the farm comes to life again."}, {"viet": "Những cái bàn được sắp xếp song song với bức tường.", "eng": "Tables arranged square with the wall."}, {"viet": "Cô ấy luôn dè dặt khi nói về những người bạn trai.", "eng": "Talk about boyfriends always puts her on the defensive."}, {"viet": "Bảo đứa bé đừng chẩu mỏ nữa!", "eng": "Tell that child to stop pouting!"}, {"viet": "Xin cám ơn về lời mời, song tôi xin hẹn lần sau sẽ đến.", "eng": "Thanks for the invitation, but I'll have to take a rain-check on it."}, {"viet": "Thằng bé đó không có trí khôn trong đầu.", "eng": "That boy hasn't a thought in his head."}, {"viet": "Giọng hát của cô ta có nét phảng phất của mẹ cô ta.", "eng": "That is a reminiscence of her mother in the way she sings."}, {"viet": "Ông lão mới vừa bước vào quán rượu đã 90 tuổi rồi đấy!", "eng": "That old gaffer going into the pub is 90 years old!"}, {"viet": "Vở kịch đó đã lôi cuốn họ trong nhiều tháng trời.", "eng": "That show has been packing them in for months."}, {"viet": "Những suất diễn 10 giờ sáng, 1 giờ 30 chiều và 7 giờ tối.", "eng": "The 10 a. m., 1: 30 p. m. and 7 p. m. performances."}, {"viet": "Các bị cáo được trắng án.", "eng": "The accused were acquitted of the charge."}, {"viet": "Máy bay đã bị các đám mây che kín.", "eng": "The aircraft was swallowed in the clouds."}, {"viet": "Câu trả lời nó đưa ra thật đáng kinh ngạc.", "eng": "The answer he gave was quite surprising."}, {"viet": "Quân đội diễn hành với một số quân lớn.", "eng": "The army paraded in full strength."}, {"viet": "Khán giả nín thở theo dõi người biểu diễn nhào lộn đi trên sợi dây thừng căng trên cao.", "eng": "The audience held their breath as the acrobat walked along the tightrope."}, {"viet": "Đứa bé bị bỏ mặt ngoài mưa gió.", "eng": "The baby was left exposed to the wind and rain."}, {"viet": "Ngân hàng sẽ dùng sức ép đối với anh nếu anh không chi trả.", "eng": "The bank will bring pressure to bear on you if you don't pay."}, {"viet": "Vẻ đẹp vùng này đã bị làm hỏng bởi những bảng quảng cáo thương mại.", "eng": "The beauty of this region is marred by commercial signs."}, {"viet": "Các con chim bay lên lượn xuống.", "eng": "The birds rose and dipped in flight."}, {"viet": "Cái chốt cửa được đẩy nhẹ vào khe.", "eng": "The bolt slotted smoothly into the place."}, {"viet": "Sếp đã gọi tôi trình diện để khiển trách việc tôi đòi hỏi các chi phí.", "eng": "The boss had me on the carpet over my expenses claim."}, {"viet": "Nhánh cây đã tách khỏi thân cây.", "eng": "The branch has separated from the trunk of the tree."}, {"viet": "Tòa nhà đó đông nghẹt phóng viên.", "eng": "The building was thick with reporters."}, {"viet": "Chiếc bánh chúng ta làm có phần bị hỏng.", "eng": "The cake we made was somewhat a failure."}, {"viet": "Chiếc xe ô-tô này có bộ phận phanh rất tốt.", "eng": "The car has very good brakes."}, {"viet": "Các chiếc xe ôtô lao nhanh vòng theo đường đua.", "eng": "The cars raced round the track."}, {"viet": "Cử chỉ lịch sự bắt tay khi được giới thiệu.", "eng": "The ceremony of shaking hands when introduced."}, {"viet": "Người đánh cờ nhận thua ( ván đó ) khi anh ta thấy tình thế của mình là tuyệt vọng.", "eng": "The chess-player conceded ( the game ) when he saw that his position was hopeless."}, {"viet": "Đứa bé khóc vì có ai đó đã véo nó.", "eng": "The child was crying because somebody had pinched her."}, {"viet": "Những đứa trẻ này chưa biết đánh dấu ngắt câu đúng.", "eng": "The children have not yet learned to punctuate correctly."}, {"viet": "Bọn trẻ được hai giáo viên hướng dẫn đi chơi.", "eng": "The children were shepherded around by two teachers."}, {"viet": "Cả lớp cùng hát Mừng Sinh nhật chúc mừng thầy giáo.", "eng": "The class all joined together to sing Happy Birthday to the teacher."}, {"viet": "Chiếc xe ngựa chạy theo con đường khá quanh co tới địa điểm.", "eng": "The coach followed a rather devious course to its destination."}, {"viet": "Các nhà bình luận làm nhiều phỏng đoán về kết quả của cuộc bầu cử tới.", "eng": "The commentators made various conjectures about the outcome of the next election."}, {"viet": "Công ty đang sản xuất một loại xe thể thao mới.", "eng": "The company is bringing out a new sports car."}, {"viet": "Hình dạng của cơ quan phát âm.", "eng": "The configuration of the vocal tract."}, {"viet": "Sự kết hợp công việc của vài người.", "eng": "The coordination of the work of several people."}, {"viet": "Đất nước đang ( trong tình trạng ) sôi sục.", "eng": "The country was in a ( state of ) ferment."}, {"viet": "Tên tội phạm Mick Clark có vài bí danh.", "eng": "The criminal Mick Clark has several aliases."}, {"viet": "Tính đa dạng văn hoá của Hoa Kì.", "eng": "The cultural diversity of the United States."}, {"viet": "Ngày tháng ấy sẽ mãi mãi khắc sâu trong trí ức cô ta.", "eng": "The date is stamped on her memory forever."}, {"viet": "Sự khéo léo trong lối chơi, tay nghề, nghệ thuật khắc của cô ta.", "eng": "The delicacy of her playing, workmanship, carving."}, {"viet": "Biểu đồ trên trang 5 trong đoạn kế tiếp.", "eng": "The diagram on page 5 in the next paragraph."}, {"viet": "Món đồ trưng bày được bao quanh bằng vòng nguyệt quế.", "eng": "The display was wreathed in laurel."}, {"viet": "Bác sĩ bảo tôi thư thư một chút và ngừng làm việc quá căng thẳng.", "eng": "The doctor told me to ease up a bit and stop working so hard."}, {"viet": "Con chó phóng rất nhanh theo con thỏ.", "eng": "The dog was after the rabbit like a shot."}, {"viet": "Người tài xế lạc tay lái và chiếc xe ô tô chạy loạn xạ xuống đồi.", "eng": "The driver lost control and the car careened down the hill."}, {"viet": "Tầm quan trọng về kinh tế của kế hoạch đó cần phải được xem xét kĩ lưỡng.", "eng": "The economics of the scheme need to be looked at very carefully."}, {"viet": "Lực lượng địch đông hơn.", "eng": "The enemy forces were superior in numbers."}, {"viet": "Bài viết không cần phải quá dài, vì là một bài hướng dẫn sơ qua, anh chỉ cần viết khoảng ba trang.", "eng": "The essay needn't be too long, as a rough guide, you should write about three pages."}, {"viet": "Kinh nghiệm ấy chẳng lấy gì làm phấn chấn lắm.", "eng": "The experience wasn't terribly elevating."}, {"viet": "Những giọng nói quen thuộc của bạn bè mình.", "eng": "The familiar voices of one's friends."}, {"viet": "Người tổ chức lễ hội và đám tùy tùng hỗ trợ của bà ta.", "eng": "The fête organizer and her retinue of helpers."}, {"viet": "Cuốn phim chúng ta đã xem thật là hoàn toàn dở!", "eng": "The film we saw was absolutely dire!"}, {"viet": "Hãng ấy công bố sổ sách kế toán của hãng trong tháng 8.", "eng": "The firm published its accounts in August."}, {"viet": "Trong số năm con ngựa dự cuộc đua từ đầu chỉ có ba con về tới đích.", "eng": "The five starters in the race only three finished."}, {"viet": "Trọng lực kéo mọi vật hướng về tâm trái đất.", "eng": "The force of gravity pulls things towards the earth's centre."}, {"viet": "Chẳng hạn, giá trị nhiên liệu của một miếng dưa hấu chỉ vào khoảng 100 ca-lo.", "eng": "The fuel value of a slice of watermelon, for instance, is only about 100 calories."}, {"viet": "Ống dẫn khí đốt ga chính bị nổ và làm căn nhà bốc cháy.", "eng": "The gas main exploded and set fire to the house."}, {"viet": "Mọi người trên thế giới đều đã hiểu được rằng không có một xã hội nào tìm kiếm sự tôn trọng mà lại có thể hỗ trợ hoặc dung thứ tình trạng man rợ.", "eng": "The global village has come to understand that no society that seeks respect can support or tolerate savagery."}, {"viet": "Chính phủ không thể chỉ vung chiếc đũa thần và xua tan được vấn đề nan giải đó.", "eng": "The government can't just wave a magic wand and make this problem go away."}, {"viet": "Chính phủ bị áp lực liên tục cải tạo hệ thống quốc hội.", "eng": "The government is under continuous to reform the parliamentary system."}, {"viet": "Bóng cây lốm đốm ánh mặt trời.", "eng": "The grass under the tree was flecked with sunlight."}, {"viet": "Những người lính gác được lệnh không rời bỏ các chất gác của họ.", "eng": "The guards were ordered not to leave their posts."}, {"viet": "Không khí ngột ngạt khó tả của buổi chiều mùa hè.", "eng": "The hazy languor of a summer's afternoon."}, {"viet": "Ngọn núi cao nhất trên thế giới.", "eng": "The highest mountain in the world."}, {"viet": "Những con tin bị trói bằng dây thừng và bị bịt miệng.", "eng": "The hostages were bound and gagged."}, {"viet": "Ngôi nhà này nằm trong khả năng mua của chúng tôi.", "eng": "The house is within our budget."}, {"viet": "Ý kiến ấy chẳng bao lâu gặp khó khăn.", "eng": "The idea soon ran into trouble."}, {"viet": "Sự tung quân lính vào một vùng.", "eng": "The infiltration of troops into an area."}, {"viet": "Chữ'r'xen vào vẫn thường nghe thấy giữa các âm nguyên âm, thí dụ trong'law và order'.", "eng": "The intrusive'r'often heard between vowel sounds."}, {"viet": "Cuộc hành trình trở về xa hơn bình thường, vì máy bay không thể bay qua khu vực chiến sự.", "eng": "The journey back took longer than normal, because the plane could not overfly the war zone."}, {"viet": "Quân bắt cóc đã đòi một triệu bảng Anh đổi lấy việc phóng thích ông ấy an toàn.", "eng": "The kidnappers have demanded £ 1 million for his safe release."}, {"viet": "Một công ty lớn hơn sáp nhập một công ty nhỏ hơn.", "eng": "The larger firm absorbed the smaller one."}, {"viet": "Chiếc ô tô dẫn đầu đâm sầm giữa đường ở vòng đua thứ mười.", "eng": "The leading car crashed midway through the tenth lap."}, {"viet": "Thiết bị nâng là một hệ thống dây và ròng rọc.", "eng": "The lifting device is a system of ropes and pulleys."}, {"viet": "Chuyến bay dài qua Đại Tây Dương, sau đó chặn ngắn cuối cùng từ New York tới Boston.", "eng": "The long flight across the Atlantic, then the final hop from New York to Boston."}, {"viet": "Các tạp chí đó có thể để tới tận Chủ Nhật mới nhét các truyện vào và vẫn có thể quẳng ra ngoài vào Thứ Hai.", "eng": "The magazines can crowbar stories in as late as Sunday and still be out on Monday."}, {"viet": "Giám đốc vừa sa thải hai công nhân vô trách nhiệm.", "eng": "The manager have just shelved two irresponsibility workers."}, {"viet": "Ông thị trưởng quyết tâm truy quét các tội phạm trong thành phố.", "eng": "The mayor is determined to clean up the city."}, {"viet": "Họ đồng ý thành lập một uỷ ban vì mục đích trước mắt.", "eng": "The men agreed to set up an ad hoc committee."}, {"viet": "Ông Bộ trưởng không có mặt ở đây để bình luận.", "eng": "The Minister was unavailable for comment."}, {"viet": "Mặt trăng di chuyển quanh trái đất khoảng chừng 12 đến 13 lần trong một năm.", "eng": "The moon travels around the earth between 12 and 13 times in a year."}, {"viet": "Con nghe nói bộ phim có tựa đề là Tôi là Sam rất cảm động.", "eng": "The movie called I am Sam is very moving I've heard."}, {"viet": "Sự cần thiết phải phát biểu rõ ràng về một điều gì đó.", "eng": "The need to speak out about something."}, {"viet": "Luật mới được cho có hiệu lực từ 1 tháng giêng.", "eng": "The new law was made retroactive to 1 January."}, {"viet": "Thầy giáo mới thiếu thuyết phục trước lớp.", "eng": "The new teacher lacked assurance in front of his class."}, {"viet": "Năm phút nữa chương trình tiếp theo sẽ bắt đầu: trong lúc chờ đợi xin mời nghe mấy bản nhạc.", "eng": "The next programme starts in five minutes: in the meantime, here's some music."}, {"viet": "Con số tử vong trên đường được tiên đoán cho năm đó chứng tỏ là một vụ ước lượng quá thấp.", "eng": "The number of deaths on the roads predicted for the year proved to be a serious underestimate."}, {"viet": "Vị sĩ quan báo cáo binh sĩ của ông ta đã vào vị trí của họ.", "eng": "The officer reported his men in position."}, {"viet": "Bà già đó rất giàu và hoàn toàn dở hơi.", "eng": "The old women's very rich and quite barmy."}, {"viet": "Văn bản gốc có ở đây để cho dễ tham khảo.", "eng": "The original text is here for ease of reference."}, {"viet": "Tờ báo nhăn ở những chỗ bị ướt.", "eng": "The paper has wrinkled where it got wet."}, {"viet": "Khi anh leo lên đồi con đường này sẽ dốc hơn.", "eng": "The path steepens as you climb the hillside."}, {"viet": "Nhân dân nổi lên chống chính quyền quân sự.", "eng": "The people revolted against the military government."}, {"viet": "Tên móc túi đã bỏ chạy, bị cảnh sát đuổi theo sát nút.", "eng": "The pickpocket ran off, hotly pursued by the police."}, {"viet": "Kế hoạch này không thể cải tiến được.", "eng": "The plan does not admit of improvement."}, {"viet": "Vở kịch đó tạo ra một cảm giác như ở Hoa Kỳ.", "eng": "The play created a sensation Stateside."}, {"viet": "Cảnh sát kêu gọi đám đông đừng hốt hoảng.", "eng": "The police appealed to the crowd not to panic."}, {"viet": "Cảnh sát không cho biết chi tiết gì thêm về tội ác này.", "eng": "The police have released no further details about the crime."}, {"viet": "Viên cảnh sát ra lệnh cho chúng tôi lui lại.", "eng": "The policeman ordered us to stand back."}, {"viet": "Sở bưu điện nhằm cải tiến chất lượng dịch vụ của nó.", "eng": "The Post Office aims to improve its quality of service."}, {"viet": "Sức khoẻ của tổng thống yếu đi nhanh.", "eng": "The President's health is failing fast."}, {"viet": "Giá là 50 xu một tá.", "eng": "The price is 50p the dozen."}, {"viet": "Tù nhân đã trốn thoát qua một lỗ thủng ở tường.", "eng": "The prisoner escaped through a hole in the wall."}, {"viet": "Chương trình sẽ được tiếp tục phát đi trong vài giây.", "eng": "The program will be going on the air in a few seconds."}, {"viet": "Quán rượu đầy các nông dân mặc quần áo vải tuýt.", "eng": "The pub was full of tweedy farmers."}, {"viet": "Nữ hoàng sẽ hạ thủy chiến hạm mới hôm nay.", "eng": "The queen is to launch a new warship today."}, {"viet": "Sự tiếp thu nhanh chóng công nghiệp máy tính của lực lượng lao động.", "eng": "The rapid assimilation of computer technology by the workforce."}, {"viet": "Sự giới thiệu những ca bệnh như vậy đến một bác sĩ.", "eng": "The referral of such cases to a doctor."}, {"viet": "Lĩnh vực kỹ thuật sinh vật tốn kém kinh phí về nghiên cứu và triển khai.", "eng": "The research-intensive field of biotechnology."}, {"viet": "Công ty giàu nhất hiện nay.", "eng": "The richest company in being today."}, {"viet": "Con đường đó chạy một mạch vòng quanh cái hồ.", "eng": "The road sweeps round the lake."}, {"viet": "Sợi dây thừng đứt do căng quá.", "eng": "The rope severed under the strain."}, {"viet": "Những cánh buồm bay phần phật trong gió.", "eng": "The sails were flapping gently in the wind."}, {"viet": "Xe buýt nhà trường luôn luôn đến lúc 8 giờ.", "eng": "The school bus always comes at 8 o'clock without fail."}, {"viet": "Nền an ninh của đất nước đã bị lâm nguy.", "eng": "The security of the country had been imperilled."}, {"viet": "Chiếc máy xén không đủ sắc để cắt cỏ.", "eng": "The shears aren't sharp enough to cut the grass."}, {"viet": "Sự Chuyên chở dầu hoả từ vùng Trung Đông đến các nước khác.", "eng": "The shipping of oil from the Middle East to other countries."}, {"viet": "Cảnh chuột chết làm cô ấy sởn da gà.", "eng": "The sight of the dead rats made her flesh creep."}, {"viet": "Người phi công khéo léo hạ chiếc máy bay đang bốc cháy một cách thành công.", "eng": "The slick pilot lowered the burning plane to a successful landing."}, {"viet": "Các binh sĩ tự nguỵ trang bằng lá và cành cây.", "eng": "The soldiers camouflaged themselves with leaves and branches."}, {"viet": "Diễn giả lôi cuốn tình cảm của cử toạ nhiều hơn là lý trí của họ.", "eng": "The speaker appealed more to the feelings of her audience than to their reason."}, {"viet": "Máy bay dân dụng phản lực tiêu chuẩn bay mất khoảng bảy tiếng đồng hồ.", "eng": "The standard jetliner takes about seven hours."}, {"viet": "Cơn bão quăng con tàu vào đá.", "eng": "The storm dashed the ship against the rocks."}, {"viet": "Các sinh viên sắp thi tiếng Anh.", "eng": "The students will be examine in English."}, {"viet": "Làn gió nhẹ làm mặt nước gợn lăn tăn.", "eng": "The surface of the water was dimpled by the breeze."}, {"viet": "Thầy giáo thấy lớp học là cả một cảnh tượng hỗn độn.", "eng": "The teacher found the classroom a babel."}, {"viet": "Tổng số khán giả truyền hình lên đến 30 triệu.", "eng": "The television audience aggregated 30 millions."}, {"viet": "Tên ăn trộm được trao cho cảnh sát.", "eng": "The thief was turned over to the police."}, {"viet": "Giọng điệu trong những bức thư của ông ấy gần đây đốp chát hơn.", "eng": "The tone of his letters has sharpened recently."}, {"viet": "Đoàn tàu ầm ầm chạy qua ga.", "eng": "The train thundered through the station."}, {"viet": "Tôi cam đoan với anh là chưa hết rắc rối đâu.", "eng": "The trouble isn't over yet, I'll warrant you."}, {"viet": "Hai bộ đèn giao thông bị lệch pha và nhiều tai nạn đã xảy ra.", "eng": "The two sets of traffic lights were out of phase and several accidents occurred."}, {"viet": "Việc sử dụng lực lượng quân sự không kiểm soát.", "eng": "The unrestrained use of military force."}, {"viet": "Người ta vội vã rời bỏ làng có lẽ vì bọn khủng bố đã có mặt ở vùng này.", "eng": "The village had been hurriedly deserted, perhaps because terrorists were in the area."}, {"viet": "Chất thải của nhà máy được chở đi bằng xe tải.", "eng": "The waste from the factory was taken away in lorries."}, {"viet": "Toàn bộ việc kinh doanh đó đã gây ra một chuyện thật là phiền toái.", "eng": "The whole business caused quite a stink."}, {"viet": "Người thắng cuộc rút ngắn kỷ lục thế giới được mười giây.", "eng": "The winner cut ten seconds off the world record."}, {"viet": "Những người thợ nắm quyền kiểm soát xí nghiệp để chặn trước việc các ông chủ bán nó đi.", "eng": "The workers took control of the factory in order to pre-empt its sale by the owners."}, {"viet": "Cảnh trí, những cuộc trình diễn, những tạp chí sân khấu.", "eng": "Theatrical scenery, performances, reviews."}, {"viet": "Mẫu mới nhất của họ chắc chắn sẽ là một thành công.", "eng": "Their latest model is certain to be a winner."}, {"viet": "Vậy thì, hãy cho tôi biết tên bà và cho tôi xem hộ chiếu của bà.", "eng": "Then, please tell me your name and show me your passport."}, {"viet": "Có một uy tín có thể nhận thấy về việc học ở một trường tư.", "eng": "There's a certain prestige about going to a private school."}, {"viet": "Có khí ga rò rỉ đâu đây-cậu có ngửi thấy không?", "eng": "There's gas escaping somewhere-can you smell it?"}, {"viet": "Có thứ gì đó trăng trắng trên đĩa này.", "eng": "There's some white stuff on this plate."}, {"viet": "Có nhiều khía cạnh về vấn đề này.", "eng": "There are many facets to this question."}, {"viet": "Có ba giống trong tiếng Đức: giống đực, giống cái và giống trung.", "eng": "There are three genders in German: masculine, feminine and neuter."}, {"viet": "Kìa anh ta đến, bô lô ba la nói những chuyện nhảm nhí như thường lệ.", "eng": "There he goes, blah blah blah, talking nonsense as usual."}, {"viet": "Có một chút sự thật trong những điều anh nói.", "eng": "There is an element of truth in what you say."}, {"viet": "Có một quầy bán kẹo bông kìa.", "eng": "There is the cotton candy stand."}, {"viet": "Có một giọng tự mãn trong bài nói của anh ta.", "eng": "There was a note of self-satisfaction in his speech."}, {"viet": "Có một anh chàng kỳ quặc ngồi đối diện với tôi trên xe lửa.", "eng": "There was this peculiar man sitting opposite me in the train."}, {"viet": "Sẽ có những sự chậm trễ kéo dài đối với các hành khách đi xe lửa.", "eng": "There will be prolonged delays for rail travellers."}, {"viet": "Những hạch ở cổ của anh nổi lên là phản ứng tự vệ chống lại sự nhiễm trùng ở miệng anh.", "eng": "These glands in your neck have come up as a defence mechanism to fight the infection in your mouth."}, {"viet": "Những nỗi buồn này quá sức con người có thể chịu đựng nổi.", "eng": "These sorrows are more then flesh and blood can bear."}, {"viet": "Họ đã trở nên thân tình với nhau.", "eng": "They've become very pally with each other."}, {"viet": "Họ hoàn toàn chỉ nghĩ đến con cái.", "eng": "They are completely wrapped up in their children."}, {"viet": "Họ thuộc những phe chính trị khác nhau.", "eng": "They belong to different political camps."}, {"viet": "Họ chỉ có thể biết được phương hướng khi nhìn thấy mặt trời và các vì sao.", "eng": "They could only tell directions when they could see the sun or the stars."}, {"viet": "Thậm chí họ còn thâm nhập vào những nơi khác thường như là trong họng súng đại bác hoặc là chui xuống dưới những đống muối lớn.", "eng": "They even went into such out-of-the-way places as the mouth of a big cannon and under great piles of salt."}, {"viet": "Họ phải xử lý hàng tấn đá như thế.", "eng": "They had to handle tons of it."}, {"viet": "Họ giảm giá xuống một pound để làm cho giá hấp dẫn.", "eng": "They knocked off a pound to make the price more attractive."}, {"viet": "Họ pha trộn với những người da đỏ khác, đặc biệt là ở các thị trấn và các thành phố.", "eng": "They mixed with other Indians, especially in the towns and cities."}, {"viet": "Họ để sữa vào thùng quay bơ để làm bơ.", "eng": "They put the milk into the churn to make butter."}, {"viet": "Họ lên đường đi tiếp chặng cuối cùng của cuộc hành trình.", "eng": "They set out on the last stage of their journey."}, {"viet": "Họ cố gắng đối xử lịch sự với các khách hàng nóng nảy.", "eng": "They try to deal politely with angry customers."}, {"viet": "Chúng nó khiêu vũ đến tận gần sáng.", "eng": "They were dancing till the early hours."}, {"viet": "Họ sẽ hoàn thành công việc nhanh hơn nhiều nếu tất cả bọn họ đều cộng tác.", "eng": "They will get the job finished much more quickly if they all cooperate."}, {"viet": "Phần thưởng này là đỉnh cao của một sự nghiệp sân khấu thành công.", "eng": "This award has set the seal on a successful stage career."}, {"viet": "Chiếc máy sao chụp này có thể chụp lại các bức ảnh màu.", "eng": "This copier can reproduce colour photographs."}, {"viet": "Công ty này không có khả năng chứa những người làm việc phất phơ.", "eng": "This firm can't afford passengers."}, {"viet": "Đây là Jean Parks từ Luân Đôn tới.", "eng": "This is Jean Parks, from London."}, {"viet": "Ông thẩm phán này là người không dung tha đối với bất cứ ai bị phát hiện phạm tội giết người.", "eng": "This judge is merciless towards anyone found guilty of murder."}, {"viet": "Tiểu thuyết này là phần tiếp quyển tiểu thuyết vừa ra của tác giả.", "eng": "This novel is the sequel to the authors'last novel."}, {"viet": "Quy định này làm cho việc đổi tiền trở nên dễ dàng.", "eng": "This regulation makes the exchange easy."}, {"viet": "Còn nữa, cái áo len này sẽ không phai màu, đúng không?", "eng": "This sweater won't fade, right?"}, {"viet": "Những đứa trẻ này luôn cãi nhau về những chuyện lặt vặt.", "eng": "Those children are always quarrelling over litle things."}, {"viet": "Báo chí hôm nay đăng tin tức đầy đủ về cuộc viếng thăm của tổng thống.", "eng": "Today's papers carry full reports of the President's visit."}, {"viet": "Các dịch vụ trên tàu bị cắt giảm rất nhiều.", "eng": "Train services have been cut to the bone."}, {"viet": "Những sự sắp xếp lại khác nhau trong các đảng phái chính trị.", "eng": "Various realignments in political parties."}, {"viet": "Sóng vỗ vào bờ biển, vào mạn tàu, v. v.", "eng": "Waves lapping on a beach, against the side of a boat, etc."}, {"viet": "Chúng tôi sẽ mở một quầy hàng ở Hội chợ Quốc tế sắp tới để quảng bá thương hiệu của công ty ông trong giới kinh doanh.", "eng": "We'll take a stand at the coming International Fair to make your brands known in the trade."}, {"viet": "Chúng tôi chỉ vừa mới đi nghỉ về cho nên anh phải coi chúng tôi như là mới về và đừng trông chờ cái gì đặc biệt cả.", "eng": "We're only just returned from holiday so you must take us as you find us."}, {"viet": "Chúng ta phải thức tỉnh tất cả những người có tư tưởng cổ hủ này.", "eng": "We've got to shake up all these people with old-fashioned ideas."}, {"viet": "Chúng tôi cũng đưa người ta đi câu cá ở các hồ lớn hơn và các con sông.", "eng": "We also take people fishing to the larger lakes and the rivers."}, {"viet": "Chúng tôi vẫn đang xem xét kỹ việc đó và những điều cần phải làm cho nó.", "eng": "We are still looking over the matter and what to do about it."}, {"viet": "Chúng ta không thể đi xa hơn được nữa nếu không nghỉ.", "eng": "We can't go any farther without resting."}, {"viet": "Chúng tôi đã kiểm tra và thấy rằng tất cả những con số này đều đúng.", "eng": "We checked up and found all the figures are correct."}, {"viet": "Chúng tôi yêu cầu quý khách đọc tờ bướm này.", "eng": "We do require that you read this."}, {"viet": "Chúng tôi nhận thấy chất lượng của hàng mẫu rất tốt.", "eng": "We found the quality of the sample very satisfactory."}, {"viet": "Chúng tôi phải len lỏi qua các đường phố đông người.", "eng": "We had to fight hrough the crowded streets."}, {"viet": "Chúng tôi phân cách khu vực chơi bằng một đường vạch trắng.", "eng": "We have marked the playing area off with a white line."}, {"viet": "Những con người chúng ta chỉ đơn thuần là công cụ của số phận.", "eng": "We humans are merely the instruments of fate."}, {"viet": "Chúng tôi đã tìm chùm chìa khoá ở khắp mà không tìm thấy nó đâu cả.", "eng": "We looked everywhere for the keys, but they were nowhere to be found."}, {"viet": "Chúng ta phải học để phân biệt sự kiện và quan niệm.", "eng": "We must learn to discriminate between facts and opinions."}, {"viet": "Chúng tôi thường chỉ trích Chính phủ, nhưng chưa bao giờ chúng tôi thiếu kính trọng đối với Hoàng gia.", "eng": "We often criticize the Government, but we're never disrespectful towards the Royal Family."}, {"viet": "Chúng tôi khiển trách anh ta vì hành vi của anh ta.", "eng": "We remonstrated with him about his behavior."}, {"viet": "Đôi khi chúng tôi ăn cơm thay cho khoai tây.", "eng": "We sometimes eat rice instead of potatoes."}, {"viet": "Chúng tôi thường đi dự lễ powwow mỗi năm.", "eng": "We usually go to several powwows each year."}, {"viet": "Chúng tôi đau buồn vì lũ trẻ không trở về.", "eng": "We were distressed to find that the children had not returned."}, {"viet": "Chúng ta sẽ phải lấy biểu quyết về vấn đề này.", "eng": "We will have to put the matter to the vote."}, {"viet": "À, thành thật mà nói, tôi nghĩ đã đến lúc chúng ta cần gom tất cả nhân viên bán hàng lại ở một tầng.", "eng": "Well, frankly, I think it's about time we got all the sales staff together on one floor."}, {"viet": "À, giá cả rất hợp lý.", "eng": "Well, the price is quite reasonable."}, {"viet": "Thủ tục mở tài khoản ở ngân hàng là như thế nào?", "eng": "What's the procedure for opening a bank account?"}, {"viet": "Những phẩm chất nào để phân biệt một nhà lãnh đạo tài giỏi?", "eng": "What are the qualities that mark great leader?"}, {"viet": "Bạn thích làm gì vào thời gian rảnh?", "eng": "What do you like to do in your free time?"}, {"viet": "Ngộ trời mưa mà chúng ta không kiếm được chỗ trú thì sẽ thế nào?", "eng": "What if it rains when we can't get under shelter?"}, {"viet": "Giá trị chuyển nhượng của những cổ phần này là bao nhiêu?", "eng": "What is the surrender value of these shares?"}, {"viet": "Dân tộc nào trên thế giới có thể có được một thành tựu như vậy?", "eng": "What nation in the world can boast such an achievement?"}, {"viet": "Buổi sáng anh thường thức dậy lúc mấy giờ?", "eng": "What time do you usually wake in the morning?"}, {"viet": "Khi trường cao đẳng bắt đầu vào mùa thu, tôi đã không quay lại học.", "eng": "When college started in the fall, I didn't go back."}, {"viet": "Khi tôi từ sân bay về đến nhà, tôi đã gục xuống ngủ thiếp đi trong chiếc ghế bành gần nhất.", "eng": "When I got home from the airport, I flaked out in the nearest armchair."}, {"viet": "Khi nồi hơi nổ nhiều người đã bị thương.", "eng": "When the boiler exploded many people were injured."}, {"viet": "Khi chúng ta viết số một nghìn ( 1000 ), chúng ta viết ba số không sau số một.", "eng": "When we write a thousand ( 1000 ), we write three noughts after the one."}, {"viet": "Tôi bỏ các đồng xu vào chỗ nào?", "eng": "Where do I put the coins?"}, {"viet": "Bạn thích thứ nào hơn, thơ ca hay nghệ thuật hiện đại?", "eng": "Which do you prefer, poetry or modern art?"}, {"viet": "Trong khi Tổng thõng ốm, công việc của ông sẽ giao cho phó tổng thống.", "eng": "While the President is ill, his work will devolve on his deputy."}, {"viet": "Ai đã giới thiệu cô đến công ty này?", "eng": "Who referred you to this company?"}, {"viet": "Sao anh không nói chuyện tình cảm với anh ấy và giải quyết vấn đề của anh?", "eng": "Why don't you have a heart-to-heart with him and sort out your problem?"}, {"viet": "Nếu các ông mua bảo hiểm thì chuyến hàng có bị trễ không?", "eng": "Will the shipment be delayed if you apply for insurance?"}, {"viet": "Nơi ăn chốn ở của anh ta có thể có được vào tháng mười tới không?", "eng": "Will your accommodation be available next October?"}, {"viet": "Khi chiến tranh lạnh kết thúc, một số tầu chiến đã ngừng hoạt động.", "eng": "With the end of the Cold War several Warships were put into mothballs."}, {"viet": "Bây giờ đã là lúc thích hợp để cho xem phim đèn chiếu chưa?", "eng": "Would now be a suitable moment to show the slides?"}, {"viet": "Anh có muốn cùng nhảy múa không, Martin?", "eng": "Would you like to join the dance, Martin?"}, {"viet": "Bạn cho rằng bạn là người hướng ngoại hay hướng nội?", "eng": "Would you say you are an extrovert or an introvert?"}, {"viet": "Phải rồi, tôi có nghe nói dân Nhật hút thuốc lá nhiều lắm.", "eng": "Yes, I've heard that Japanese men smoke a lot."}, {"viet": "Hôm qua, tình cờ tôi được nhìn thấy tổng thống.", "eng": "Yesterday, I saw the president by chance."}, {"viet": "Đến tuổi tôi, anh sẽ hiểu rõ hơn.", "eng": "You'll know better when you reach my age."}, {"viet": "Bà cứ tự nhiên đổi chúng lấy cỡ khác nếu cậu ấy mặc không vừa.", "eng": "You're welcome to exchange them for another size if they don't fit."}, {"viet": "Anh cứ việc dùng xe ôtô của tôi bất cứ lúc nào.", "eng": "You are welcome to the use of my car any time."}, {"viet": "Ông có thể tin chắc về điều ấy.", "eng": "You can be sure of that."}, {"viet": "Dựa vào chữ viết, có thể biết được nhiều điều.", "eng": "You can tell quite a lot from the handwriting."}, {"viet": "Bạn ăn quá nhiều quà vặt.", "eng": "You eat too much junk food."}, {"viet": "Anh chưa trả món tiền anh nợ tôi.", "eng": "You haven't paid me the money you owe me."}, {"viet": "Ý ông là khóa huấn luyện hải quân nào đó phải không?", "eng": "You mean navy training of some kind?"}, {"viet": "Anh phải bắt đầu bằng việc quên đi tất cả những thói quen xấu mà ông thầy pianô trước kia đã dạy anh!", "eng": "You must start by unlearning all the bad habits your previous piano teacher taught you!"}, {"viet": "Ông hiểu cho, thưa ông yamamoto, người được trả tiền từ ngân phiếu du lịch được yêu cầu xuất trình hộ chiếu hoặc những giấy tờ khác của họ để xác minh việc chuyển đổi ngoại tệ của họ.", "eng": "You see, Mr. Yamamoto, payees of traveller's cheques are requested to show their passports or other papers for verification in converting their foreign monies."}, {"viet": "Anh không nên phơi nắng.", "eng": "You shouldn't expose your skin to the sun."}, {"viet": "Tôi tin chắc là các vị sẽ thấy hài lòng về nơi đó.", "eng": "You will find it satisfactory, I'm sure."}, {"viet": "Bọn trẻ nhà anh quấy rầy vợ tôi quá, làm ơn mắng chúng nó giùm!", "eng": "Your children are disturbing my wife, can you speak to them, please?"}, {"viet": "Phòng của ông là 645, còn giờ đánh thức là 6 giờ sáng mai, tôi nói đúng không ạ?", "eng": "Your room is 645 and the wake-up time is 6 o'clock tomorrow morning, am I right?"}]