[{"viet": "Một ít dầu và tí sơn có thể làm cho chiếc xe đạp cũ ấy khá hơn.", "eng": "A bit of oil and some paint could give that old bike a new lease of life."}, {"viet": "Thẻ séc không phải là một bằng chứng căn cước có giá trị.", "eng": "A cheque card is not a valid proof of identity."}, {"viet": "Một buổi hòa nhạc được tiếp âm trực tiếp từ phòng hòa nhạc Royal Albert.", "eng": "A concert relayed live from the Royal Albert Hall."}, {"viet": "Một ngày náo động chớp nhoáng do những nhóm sinh viên chống đối gây ra.", "eng": "A day of hit-and-run disturbances by bands of dissident students."}, {"viet": "Con búp bê kêu chít chít khi bạn bóp nó.", "eng": "A doll that squeaks when you squeeze it."}, {"viet": "Một cầu thủ chặn bóng đứng thẳng góc với cầu thủ đánh gậy ở phần sân đối diện.", "eng": "A fielder standing square on the off side."}, {"viet": "Một sự dung hòa căn bản giữa nền thịnh vượng tư bản và sự an toàn kinh tế.", "eng": "A fundamental trade off between capitalist prosperity and economic security."}, {"viet": "Tên cụ súc vũ phu đã đánh cô ấy.", "eng": "A great brute of a man attacked her."}, {"viet": "Mức độ dư thừa cao ở các công nhân không có tay nghề.", "eng": "A high level of redundancy among unskilled workers."}, {"viet": "Một mớ sách báo lộn xộn trên bàn.", "eng": "A jumble of books and papers on the table."}, {"viet": "Một thư viện được xếp đặt thuận tiện cho người sử dụng.", "eng": "A library planned for the users convenience."}, {"viet": "Một kiểu nói nhanh ngắt quãng.", "eng": "A machine-gun style of speaking."}, {"viet": "Một mức tăng giá dầu có giới hạn.", "eng": "A mensurable increase in the cost of oil."}, {"viet": "Chiếc máy bay mới được vận hành các động cơ Rolls Royce.", "eng": "A new aircraft powered by Rolls Royce engines."}, {"viet": "Một cỗ bài với sợi chun buộc chung quanh.", "eng": "A pack of cards with a rubber band round them."}, {"viet": "Một người với tham vọng như của anh ấy sẽ không ở lâu trong một xí nghiệp nhỏ như xí nghiệp này.", "eng": "A person with his ambition won't stay long in a potty little firm like this."}, {"viet": "Một nhóm bác sĩ trực cấp cứu.", "eng": "A pool of doctors available for emergency work."}, {"viet": "Một chiến dịch quảng cáo để giới thiệu cuốn sách mới của bà ta.", "eng": "A publicity campaign to promote her new book."}, {"viet": "Một sự đoàn tụ giữa hai chị em.", "eng": "A reunion between the two sisters."}, {"viet": "Một nhà khoa học nổi tiếng trong lĩnh vực của ông ta.", "eng": "A scientist pre-eminent in his field."}, {"viet": "Một khoản thâm thủng ngân sách hàng năm.", "eng": "A shortfall in the annual budget."}, {"viet": "Một quân nhân không thực hiện các lệnh trừng phạt nghiêm khắc.", "eng": "A soldier who doesn't follow his orders will be in serious trouble."}, {"viet": "Một sự trình bày chân thật không màu mè.", "eng": "A straightforward presentation with no frills."}, {"viet": "Một thầy giáo ngoài việc đứng lớp cũng cần biết vui chơi, giải trí.", "eng": "A teacher should entertain as well as teach."}, {"viet": "Một bồn cỏ hình tam giác bên cạnh lối đi.", "eng": "A triangle of grass beside the path."}, {"viet": "Một cái bánh cưới ba tầng.", "eng": "A wedding cake with three-tiers."}, {"viet": "Có thể phục vụ khoảng 100 người ăn cùng một lượt.", "eng": "About 100 people can be served at one sitting."}, {"viet": "Thêm một chút hứng thú cho hôn nhân của họ.", "eng": "Add a bit of spice to their marriage."}, {"viet": "Sau một năm không hề thất bại, đội đó nắm vị trí tối cao trong nước như là đội hay nhất, vĩ đại nhất.", "eng": "After a year without defeat, the team now reigns supreme as the finest in the country."}, {"viet": "Sau khi đi nó, có lẽ dạ dày của bạn sẽ thấy rất nôn nao.", "eng": "After riding it, your stomach will probably feel queasy."}, {"viet": "Sau nhiều năm du lịch, chúng tôi quyết định định cư ở đây.", "eng": "After years of travel, we decided to settle here."}, {"viet": "Nói chung đó là một thành công lớn.", "eng": "All in all it had been a great success."}, {"viet": "Tất cả sản phẩm mới đều đang trưng bày ở cuộc triển lãm.", "eng": "All the new products were on show at the exhibition."}, {"viet": "Mặc dầu những cuộc đàm phán bị đổ vỡ nhưng cánh cửa vẫn để ngỏ.", "eng": "Although talks have broken down the door has been left open."}, {"viet": "Một chiến dịch quảng cáo để phổ biến dịch vụ xe lửa mới.", "eng": "An advertising campaign to publicize the new train service."}, {"viet": "Một cuộc khủng hoảng kinh tế chưa từng có trong thời đại ngày nay.", "eng": "An economic crisis unparalleled in modern times."}, {"viet": "Tăng thêm 50 xu hay là 10 silinh tiền cũ.", "eng": "An increase of 50p or 10 shillings in old money."}, {"viet": "Một cuộc giải phẫu được Sở y tế quốc gia tài trợ.", "eng": "An operation on the National Health Service."}, {"viet": "Và có tế bào, vì thức ăn chứa trong ấy, cũng khá lớn.", "eng": "And some, because of the food stored in them, are rather large."}, {"viet": "Trả lời các điều buộc tội với một lối biện hộ thản nhiên.", "eng": "Answered the charges with an unimpassioned defence."}, {"viet": "Điện thoại di động có phổ biến ở đất nước bạn không?", "eng": "Are cellular phones popular in your country?"}, {"viet": "Có phải anh cố tình trêu tức tôi không?", "eng": "Are you deliberately winding me up?"}, {"viet": "Bạn rất giỏi về hòa giải phải không?", "eng": "Are you very good at mediating?"}, {"viet": "Để chứng tỏ thiện ý của tôi, tôi sẽ làm việc thêm giờ tuần này.", "eng": "As an earnest of my good intentions I will work overtime this week."}, {"viet": "Tuy nhiên, qua hàng ngàn năm, chúng quả có thay đổi.", "eng": "As thousands of years go by, however, they do change."}, {"viet": "Cuối cùng mệt mỏi vì phải nghe mãi về sự may mắn của mình, Dionysius quyết định dạy cho Damocles một bài học.", "eng": "At last Dionysius grew tired of hearing about his good fortune, he decided he would teach Damocles a lesson."}, {"viet": "Số khách tới xem tăng lên kể từ khi chúng tôi giảm giá vé.", "eng": "Attendance have increased since we reduced the price of tickets."}, {"viet": "Đứng hàng đầu trong nghề nghiệp của ai.", "eng": "Be at the head of one's profession."}, {"viet": "Cam chịu số phận của mình.", "eng": "Be resigned to one's fate."}, {"viet": "Cách cư xử thường bị khinh khi.", "eng": "Behaviour which is generally held in contempt."}, {"viet": "Những đám mây đen xuất hiện từ phía tây.", "eng": "Black clouds appearing from the west."}, {"viet": "Màu sáng làm ông trông trẻ hơn đấy.", "eng": "Bright colours make you look younger."}, {"viet": "Họa hoằn mới có vài chiếc xe buýt chạy tới làng chúng tôi.", "eng": "Buses to our village are few and far between."}, {"viet": "Nhưng quan trọng hơn, tôi có quan hệ rất tốt với chính quyền, và tôi nghĩ tôi cần biết về anh.", "eng": "But more important, I have some very good government contacts, and I think I need to know about you."}, {"viet": "Mua thêm gia súc về nuôi.", "eng": "Buy some more stock for breeding."}, {"viet": "Bằng cách làm việc chuyên cần, anh ấy được thăng cấp nhanh.", "eng": "By working hard he gained rapid promotion."}, {"viet": "Tôi có thể tin vào sự ủng hộ của ông trong cuộc bầu cử này không?", "eng": "Can I reply on your support in this election?"}, {"viet": "Cô có thể nộp cho chúng tôi một thư giới thiệu của họ được không?", "eng": "Can you furnish a letter of recommendation from them?"}, {"viet": "Anh có thể để cho tôi vài lít xăng được không?", "eng": "Can you spare me a few litres of petrol?"}, {"viet": "Thực hiện lời hăm dọa làm gì.", "eng": "Carry out a threat to do something."}, {"viet": "Trẻ con chơi ném tuyết trong công viên.", "eng": "Children are snowballing in the park."}, {"viet": "Cạo sạch hết vết gỉ trước khi sơn.", "eng": "Clean off any corrosion before applying the paint."}, {"viet": "Nhanh lên, hai bạn si tình!", "eng": "Come on, you two love-birds!"}, {"viet": "Xin chúc mừng, tôi nghe nói bạn đã đứng hạng.", "eng": "Congratulations, I heard you came in third."}, {"viet": "Vui lòng cho tôi nói chuyện với ông giám đốc?", "eng": "Could I talk to the manager, please?"}, {"viet": "Các vị ngồi ở đằng kia được không ạ?", "eng": "Could you take a seat over there?"}, {"viet": "Cắt một miếng gỗ dọc theo thớ.", "eng": "Cut a piece of wood along the grain."}, {"viet": "Thất bại đã rành rành trước mắt họ.", "eng": "Defeat was staring them in the face."}, {"viet": "Các món tráng miệng từ nước cốt dừa cực kỳ ngon.", "eng": "Desserts with coconut milk are extremely good."}, {"viet": "Ở trường bạn có biết anh ấy không?", "eng": "Did you know him in school?"}, {"viet": "Tháo gỡ một chiếc mô tơ động cơ để sửa chữa.", "eng": "Dismantle a faulty motor for repairs."}, {"viet": "Thảm và rèm có tính trong giá căn nhà không?", "eng": "Do the carpet and the curtain go with the house?"}, {"viet": "Bạn có cảm thấy rằng các công ty lớn gây ra quá nhiều ô nhiễm không?", "eng": "Do you feel that big companies produce too much pollution?"}, {"viet": "Bạn có lịch năm tới không?", "eng": "Do you have next year's calendar?"}, {"viet": "Anh sống trong thành phố đó hả?", "eng": "Do you live in the town?"}, {"viet": "Bạn nghĩ bằng tiếng Anh hay phải dịch trong óc từ ngôn ngữ của bạn?", "eng": "Do you think in English or translate mentally from your own language?"}, {"viet": "Anh có muốn em dọn cơm bây giờ không?", "eng": "Do you wish me to serve dinner now?"}, {"viet": "Học một khóa cơ khí ở trường kỹ thuật địa phương.", "eng": "Doing an engineering course at the local tech."}, {"viet": "Đừng lái cái ôtô mới của anh quá nhanh cho đến khi nào anh đã chạy rô đa nó xong.", "eng": "Don't drive your new car too fast until you've run it in."}, {"viet": "Đừng để sự tức giận chi phối bạn.", "eng": "Don't let your temper run away with you."}, {"viet": "Đừng có giở cái giọng ấy ra với tôi!", "eng": "Don't take that tone of voice with me!"}, {"viet": "Những mối nghi ngờ bắt đầu nảy sinh trong trí tôi.", "eng": "Doubts have begun to spring up in my mind."}, {"viet": "Trong giai đoạn dẫn đến tuyển cử.", "eng": "During the run-in to the election."}, {"viet": "Các ông chủ sợ cuộc đình công thắng lợi sẽ gây hậu quả dây chuyền.", "eng": "Employers fear a domino effect if the strike is successful."}, {"viet": "Cho dù em có phơi đồ giặt trong nhà thì nó cũng không có mùi ẩm mốc.", "eng": "Even if you hang your laundry up inside, it won't smell moldy."}, {"viet": "Trục xuất những người thuê nhà không trả tiền thuê.", "eng": "Evict tenants for nonpayment of rent."}, {"viet": "Những điều chú thích ở phía sau cuốn sách.", "eng": "Explanatory notes at the back of a book."}, {"viet": "Buộc yên cương lên lưng ngựa.", "eng": "Fasten the saddle on the horse's back."}, {"viet": "Phim lưu trữ trong những thùng chứa chống ánh sáng.", "eng": "Film stored in light proof containers."}, {"viet": "Gắn ổ khoá ngay dưới tay nắm.", "eng": "Fix the lock immediately below the handle."}, {"viet": "Vì một số lý do nhất định tôi, sẽ không dự cuộc họp được.", "eng": "For certain reasons I will be unable to attend the meeting."}, {"viet": "Đội Pháp dẫn trước sớm nhưng đội Wales đã san bằng tỉ số trước hiệp một.", "eng": "France took an early lead but Wales drew level before halftime."}, {"viet": "Làm vườn là một hình thức giải trí.", "eng": "Gardening is a form of recreation."}, {"viet": "Việc làm giàu không đáng để hy sinh những nguyên tắc của bạn.", "eng": "Getting rich isn't worth the sacrifice of your principles."}, {"viet": "Hãy ra lệnh bằng một giọng to và tự nhiên.", "eng": "Give your commands in a loud, confident voice."}, {"viet": "Chào ông, bây giờ tôi có thể dọn dẹp phòng của ông được không?", "eng": "Good morning, may I clean your room now?"}, {"viet": "Một nửa lực lượng đồn trú đang trực.", "eng": "Haft the garrison is on duty."}, {"viet": "Có chứng chỉ quốc gia cấp cao về kỹ thuật điện.", "eng": "Have the HNC in electrical engineering."}, {"viet": "Bạn đã bao giờ nhìn thấy vật thể bay không xác định chưa?", "eng": "Have you ever seen a UFO?"}, {"viet": "Anh đã thấy số liệu thống kê mới nhất về tội ác chưa?", "eng": "Have you seen the latest statistics on crime?"}, {"viet": "Nó là một thằng cha láu cá-tôi không tin nó một tí nào.", "eng": "He's a dodgy bloke-I wouldn't trust him an inch."}, {"viet": "Nó lại giở những cái trò chơi khăm cũ của nó!", "eng": "He's been getting up to his old tricks again!"}, {"viet": "Anh ấy có tin buồn: bố anh ấy đã qua đời đột ngột.", "eng": "He's had some bad news: his father has died suddenly."}, {"viet": "Anh ta thực sự sung sướng khi qua được kì thi.", "eng": "He's really chuffed about passing the exam."}, {"viet": "Anh ta nhận lỗi đã gây ra tai nạn đó.", "eng": "He accepts blame for the accident."}, {"viet": "Anh ấy cầu hôn Jane nhưng cô ấy từ chối anh ta.", "eng": "He asked Jane to marry him but she turned him down."}, {"viet": "Ở độ tuổi hai mươi thân hình anh ấy đã to con rồi.", "eng": "He broadened out in his twenties."}, {"viet": "Thằng bé làm cho bố mẹ hết sức lo lắng vì đạp xe đi xa có một mình.", "eng": "He caused his parents great anxiety by cycling long distances alone."}, {"viet": "Nó co rúm người khi bà ta giơ tay đánh nó.", "eng": "He cowered back as she raised her hand to hit him."}, {"viet": "Anh ta không hiểu được trò đùa đó.", "eng": "He didn't see the joke."}, {"viet": "Ông ấy trốn đi với một trong những nữ sinh viên của ông ta.", "eng": "He eloped with one of his students."}, {"viet": "Nó cảm thấy phấn khởi vì tiến bộ nó đạt được.", "eng": "He felt encouraged by the progress he'd made."}, {"viet": "Ông ấy đã chấp thuận cho dự án được thực hiện.", "eng": "He gave his consent for the project to get under way."}, {"viet": "Anh ta bắt đầu nghĩ rằng có lẽ nàng rốt cuộc sẽ không đến.", "eng": "He got to thinking that she perhaps wouldn't come after all."}, {"viet": "Anh ấy phải nói ứng khẩu bởi vì anh đã quên mang theo các tờ ghi chú của mình.", "eng": "He had to extemporize because he had forgotten to bring his notes."}, {"viet": "Anh ta được khuyên kiêng rượu.", "eng": "He has been advised to abstain from alcohol."}, {"viet": "Anh ta có quyền hành, nhưng anh ta không muốn chi phối những người khác.", "eng": "He has the authority, but he doesn't try to dominate others."}, {"viet": "Chàng đan các ngón tay của mình với các ngón tay của nàng.", "eng": "He intertwined his fingers with hers."}, {"viet": "Hiện giờ anh ấy không thể nhận điện thoại của ông được.", "eng": "He is not able to take your phone at the moment."}, {"viet": "Lưng nó bị đau điếng khi nó bị ngã.", "eng": "He jarred his back badly when he fell."}, {"viet": "Anh ấy đã ra đi hôm kia.", "eng": "He left the day before yesterday."}, {"viet": "Ông ta không còn biết phải trái và bắt đầu chửi bới đối thủ của mình.", "eng": "He lost all reason and started abusing his opponent."}, {"viet": "Anh ta đã điều khiển cuộc họp rất tồi và đã thất bại trong cuộc bầu cử.", "eng": "He mishandled the meeting badly and lost the vote."}, {"viet": "Ông ta đã ra lệnh cho quân đội xâm chiếm vào lúc rạng đông.", "eng": "He ordered the army to invade at dawn."}, {"viet": "Ông ấy mở đầu các tập hồi kí bằng một bản tường thuật ngắn về việc chúng đã được khám phá như thế nào.", "eng": "He prefaced the diaries with a short account of how they were discovered."}, {"viet": "Anh ta chịu đựng tất cả mọi thứ với một cách nhẫn nhục cố hữu.", "eng": "He puts up with everything in the same uncomplaining way."}, {"viet": "Ông ta coi thành phố đó như là nơi mà tất cả những hình thức của sự độc ác bất công đang được áp dụng.", "eng": "He regards the city as a place where all forms of iniquity are practiced."}, {"viet": "Anh ta nắm chắc phần thắng ở cự li 100m.", "eng": "He's a dead cert for the 100 metres."}, {"viet": "Anh ấy thất nghiệp đã sáu tháng nay.", "eng": "He's been out of work for six months."}, {"viet": "Anh ta hoàn toàn đoạn tuyệt với quá khứ.", "eng": "He's made a clean break with the past."}, {"viet": "Ông ta là đối tượng duy nhất của báo chí để phê bình.", "eng": "He's the only game in town for the press to write about."}, {"viet": "Nó nói là nó sẽ rửa bát.''Cái đó thì khó xảy ra lắm!'.", "eng": "He says he'll do the washing-up.''That'll be the day!'."}, {"viet": "Anh ta bắn con chim nhưng trượt.", "eng": "He shot at the bird but missed."}, {"viet": "Anh ta lưu lại nhà một người bạn ở Wales trong hai tuần.", "eng": "He sojourned with a friend in Wales for two weeks."}, {"viet": "Ông ấy ở nhà với lý do đau đầu.", "eng": "He stayed at home on the plea of a headache."}, {"viet": "Anh ấy đề nghị đưa bọn trẻ đi vườn thú.", "eng": "He suggested taking the children to the zoo."}, {"viet": "Anh ta quẳng nó đi với một cử chỉ coi thường.", "eng": "He threw it away with a contemptuous gesture."}, {"viet": "Cậu ta đang lợi dụng danh tiếng của cha mình.", "eng": "He trades on his father's reputation."}, {"viet": "Nó tuôn ra một tràng lời chửi rủa đối với những người bán hàng khốn khổ.", "eng": "He unleashed a torrent of abuse against the unfortunate shop assistant."}, {"viet": "Sáng nay nó hơi thiếu thân mật với tôi.", "eng": "He was a bit off with me this morning."}, {"viet": "Anh ta được đãi tiệc ở bất cứ nơi dừng chân nào trong chuyến đi thăm Trung Quốc.", "eng": "He was banqueted at every stop of his China tour."}, {"viet": "Nó đang khẩn thiết cần được giúp đỡ nhưng dường như ai cũng lảng tránh.", "eng": "He was desperately in need of help but nobody seemed to want to know."}, {"viet": "Nó cảm thấy khó có thể giải thích được sự mất tích của cô ta.", "eng": "He was hard put to explain her disappearance."}, {"viet": "Nó rõ ràng đang mong được tán dương.", "eng": "He was obviously expecting to be praised."}, {"viet": "Anh ta bị bỏ tù vì làm tiền giả.", "eng": "He was sent to prison for forging money."}, {"viet": "Cậu ta mệt nhoài vì phải chạy việc vặt cho người chị của cậu.", "eng": "He was tired of running errands for his sister."}, {"viet": "Nó phóng xuôi xa lộ với tốc độ 90 dặm một giờ.", "eng": "He went belting down the motorway at 90 mph."}, {"viet": "Hắn thắng được 500 bảng Anh và sau đó xài hết trong ba ngày.", "eng": "He won £ 500 and then blued the lot in three days."}, {"viet": "Sức khoẻ là một điều hạnh phúc mà tiền không thể nào mua được.", "eng": "Health is a blessing that money cannot buy."}, {"viet": "Câu trả lời của cô ta là một tiếng không rõ ràng.", "eng": "Her answer was an equivocal no."}, {"viet": "Việc chọn nhạc của cô ấy rất khéo.", "eng": "Her choice of music is felicitous."}, {"viet": "Kết quả bài thi của cô ta không xuất sắc mấy.", "eng": "Her exam results aren't too hot."}, {"viet": "Tóc nàng xõa ra tung bay trong gió.", "eng": "Her hair streamed out in the wind."}, {"viet": "Kiến thức về tiếng Pháp của cô ta là một lợi thế trong công việc của cô ta.", "eng": "Her knowledge of French is a plus in her job."}, {"viet": "Bộ áo mới của cô đẹp hết ý.", "eng": "Her new dress is an absolute dream."}, {"viet": "Cuộc sống làm nội trợ tẻ nhạt của cô ta.", "eng": "Her prosaic life as a housewife."}, {"viet": "Chuyên môn của cô ấy là thơ ca Hi Lạp cổ.", "eng": "Her speciality is ancient Greek poetry."}, {"viet": "Lối nói của cô ấy làm tôi nhớ lại mẹ cô ta.", "eng": "Her way of speaking put me in mind of her mother."}, {"viet": "Này, thằng ngốc kia, đưa cho tao cái cờ lê mỏ lết kia, nếu mày biết nó là cái gì.", "eng": "Hey, ace, hang me that monkey wrench if you know that one is."}, {"viet": "Bộ sưu tầm nghệ thuật của ông ấy là niềm tự hào của gia đình.", "eng": "His art collection was the pride of the family."}, {"viet": "Tính cách của anh ta là sự kết hợp giữa sức mạnh và lòng nhân ái.", "eng": "His character is a combination of strength and kindness."}, {"viet": "Nỗi tuyệt vọng của anh ta về việc gặp lại gia đình.", "eng": "His despair of ever seeing his family again."}, {"viet": "Gương mặt anh ta chau lại với vẻ bối rối.", "eng": "His face wore a puzzled frown."}, {"viet": "Việc điều khiển cuộc họp của ông ta quả là một cuộc diễn xuất tuyệt vời.", "eng": "His handling of the meeting was quite a virtuoso performance."}, {"viet": "Đất đai của ông ta đều được rào bằng dây thép gai.", "eng": "His land was fenced with barbed wire."}, {"viet": "Mẹ cậu ấy sai cậu ta ra cửa hiệu mua bánh mì.", "eng": "His mother sent him to the shop to get some bread."}, {"viet": "Sự một mực từ chối đi bác sĩ của anh ta.", "eng": "His perverse refusal to see a doctor."}, {"viet": "Trách nhiệm đè nặng lên anh ta.", "eng": "His responsibilities press heavily on him."}, {"viet": "Văn phong của ông ấy hơi quá văn hoa đối với sở thích của tôi.", "eng": "His style is a bit too literary for my taste."}, {"viet": "Của cải của anh chứng tỏ là một tai họa cho anh ta.", "eng": "His wealth proved a curse to him."}, {"viet": "Giữ lấy xô nước này và khi hắn đến góc đường, té cho hắn cả xô.", "eng": "Hold this bucket of water, and when he comes round the corner let him have it."}, {"viet": "Những ngôi nhà tậu bằng tiền vay của các công ty xây dựng.", "eng": "Houses purchased with loans from building societies."}, {"viet": "Làm sao cậu lại có thể đọc được cái thứ văn chương thô tục đó?", "eng": "How can you read such filth?"}, {"viet": "Anh chứng minh như thế nào rằng áp lực không hề thay đổi?", "eng": "How do you demonstrate that the pressure remains constant?"}, {"viet": "Anh có thể bảo quản cá trong máy ướp lạnh được bao lâu?", "eng": "How long can you keep fish in a freezer?"}, {"viet": "Anh còn bao nhiêu kiểu chưa chụp?", "eng": "How many exposures have you got left?"}, {"viet": "Anh đã bán những bức tranh đó được bao nhiêu?", "eng": "How much did you realize on those pain-tings?"}, {"viet": "Thời tiết ở Tô-ky-ô vào mùa hè thế nào?", "eng": "How's the weather in Tokyo in summer?"}, {"viet": "Nhanh lên, bố cậu bắt đầu bồn chồn lo lắng rồi đấy.", "eng": "Hurry up, your father is beginning to fidget."}, {"viet": "Tôi muốn thực hiện một cuộc gọi tìm người cho ông Giang.", "eng": "I'd like to place a person-to-person call to Mr. Jiang."}, {"viet": "Tôi sẽ bao công việc của Jane trong khi cô ấy đi nghỉ.", "eng": "I'll cover for Jane while she's on holiday."}, {"viet": "Tôi sẽ gặp anh bên ngoài phòng thí nghiệm khoa học.", "eng": "I'll meet you outside the science lab."}, {"viet": "Tôi là người mua báo dài hạn và tôi nhận được thứ này qua đường bưu điện.", "eng": "I'm a subscriber and I get them through the mail."}, {"viet": "Tôi có quyền được nghỉ 20 ngày mỗi năm.", "eng": "I'm entitled to 20 days'holiday a year."}, {"viet": "Tôi khó mà làm việc được nếu không ngủ tám tiếng.", "eng": "I'm hardly functional if I don't get eight hours'sleep."}, {"viet": "Tôi không muốn nghe những chuyện phiêu lưu tình ái của Bill.", "eng": "I'm not interested in hearing about Bill's amorous exploits."}, {"viet": "Xin lỗi, ắt hẳn tôi gọi nhầm số.", "eng": "I'm sorry, I must have the wrong number."}, {"viet": "Tôi là người đầu tiên trong gia đình học đại học.", "eng": "I'm the first in my family to go to university."}, {"viet": "Tôi đã xách mấy cái va li này đi đây đó suốt cả ngày.", "eng": "I've been carting these case around all day."}, {"viet": "Tôi đã tìm được một cái lọ giống hệt cái lọ chúng tôi đã có.", "eng": "I've found a vase that's an exact match of the one we already have."}, {"viet": "Tôi đã tìm và tìm chiếc áo đầm hoàn hảo, nhưng đây là tất cả những gì tôi có thể tìm thấy.", "eng": "I've looked and looked for the perfect dress, but this was all I could find."}, {"viet": "Tôi đã cố gọi điện thoại cho cô ấy sáu lần trong ngày hôm nay, tôi còn có thể làm gì được nữa?", "eng": "I've tried to phone her six times today, what else can I do?"}, {"viet": "Tôi luôn luôn tin những điều cô ấy nói.", "eng": "I always put a lot of dependence on what she says."}, {"viet": "Tôi giận đến mức nói thẳng vào mặt hắn những điều tôi nghĩ về hắn.", "eng": "I am so angry that I'll tell him to his face what I think of him."}, {"viet": "Tôi cố gắng đọc một mạch cuốn tiểu thuyết.", "eng": "I attempted to read the entire novel in one sitting."}, {"viet": "Tôi gọi điện để hỏi xem tối mai anh có bận không.", "eng": "I called to ask if you are busy tomorrow evening."}, {"viet": "Tôi chưa đi được, tôi còn mấy lá thư phải viết.", "eng": "I can't leave just yet, I've still got a couple of letters to write."}, {"viet": "Tôi có thể bác bỏ lập luận của anh hoàn toàn dễ dàng.", "eng": "I can dispose of your argument quite easily."}, {"viet": "Tôi không lần ra được lá thư mà anh đề cập tới.", "eng": "I cannot trace the letter to which you refer."}, {"viet": "Tôi thương cảm với cô ta về chuyện cô ta mất việc.", "eng": "I commiserated with her on the loss of her job."}, {"viet": "Mẹ cũng khóc vì chuyện này.", "eng": "I cried over this story, too."}, {"viet": "Trong những vấn đề như vậy, tôi xin làm theo những kinh nghiệm dày dặn hơn của anh.", "eng": "I defer to your greater experience in such things."}, {"viet": "Tôi chợt bắt gặp anh ta hôn vợ tôi.", "eng": "I discovered him kissing my wife."}, {"viet": "Tôi không biết cái gì đang diễn ra-anh có thể cung cấp tin cho tôi không?", "eng": "I don't know what's been going on-could you clue me in?"}, {"viet": "Tôi không nghĩ là tôi có thể làm được, nhưng để tôi thử xem.", "eng": "I don't think I can do it but I'll try."}, {"viet": "Tôi không muốn anh theo gương tôi và vội lao vào chuyện hôn nhân.", "eng": "I don't want you follow my example and rush into marriage."}, {"viet": "Tôi không muốn anh đến muộn.", "eng": "I don't want you arriving late."}, {"viet": "Tôi thấy chóng mặt khi tôi nhìn ra từ cửa sổ cao.", "eng": "I feel dizzy when I look out of a high window."}, {"viet": "Tôi thấy rất khó chấp nhận thái độ của anh ta.", "eng": "I find his attitude very hard to take."}, {"viet": "Anh thấy lẻ loi khi không có em ở đây.", "eng": "I get lonesome when you're not here."}, {"viet": "Hôm qua tôi bị nhức đầu kinh khủng.", "eng": "I had a bad headache yesterday."}, {"viet": "Tôi phải đi dò là để tìm địa chỉ của anh.", "eng": "I had to go out sleuthing to find your address."}, {"viet": "Tôi còn phải nuôi vợ và một con nhỏ.", "eng": "I have a wife and a kid to support."}, {"viet": "Tôi không hề kỳ vọng trở thành một chuyên gia về vấn đề này.", "eng": "I have no pretence to being an expert on the subject."}, {"viet": "Tôi có hai điều phê bình về kế hoạch của anh.", "eng": "I have two criticisms of your plan."}, {"viet": "Tôi nghe nói bóng bầu dục Mỹ là một ngành kinh doanh đồ sộ.", "eng": "I hear that American football is a huge business."}, {"viet": "Tôi hy vọng rằng sự thành công sẽ gắn liền với những nỗ lực của anh.", "eng": "I hope success will attend on your efforts."}, {"viet": "Tôi chỉ vừa mới tìm được cách leo lên cầu thang.", "eng": "I just about managed to get up the stairs."}, {"viet": "Tôi biết rõ chiếc tàu đó-tôi thường đi nó mà.", "eng": "I know that ship well-I've often sailed in her."}, {"viet": "Tôi thích màu xanh da trời nhạt hơn màu xanh da trời đậm nhiều.", "eng": "I like the light blue much better than the dark one."}, {"viet": "Tôi sẽ chọn cái tốt nhất cho ông.", "eng": "I'll choose the best one for you."}, {"viet": "Tôi sẽ gửi cho họ thẻ gửi địa chỉ.", "eng": "I'll send their change-of-address card."}, {"viet": "Tôi đã bị trễ mất một tiếng.", "eng": "I'm already late by an hour."}, {"viet": "Tôi có ý tin tưởng anh ta.", "eng": "I'm inclined to trust him."}, {"viet": "Tôi xin lỗi, số máy đúng là 292931.", "eng": "I'm sorry, the right number is 292931."}, {"viet": "Tôi ngạc nhiên trước vẻ đẹp của cảnh vật đó.", "eng": "I marvelled at the beauty of the landscape."}, {"viet": "Tôi phải sắp xếp các băng nhạc của tôi, tôi không bao giờ tìm được cái tôi cần.", "eng": "I must organize my records, I can never find the one I want."}, {"viet": "Tôi chưa bao giờ thấy thoải mái khi có mặt ông ấy.", "eng": "I never feel at ease in his company."}, {"viet": "Tôi chỉ trả có 3000 pao cho chiếc ôtô cũ này nhưng nó đáng giá hơn thế nhiều.", "eng": "I paid only 3000 pounds for this used car but it's worth a lot more."}, {"viet": "Con tình cờ gặp người bạn dưới phố.", "eng": "I ran into the friend downtown."}, {"viet": "Tôi từ chối không cho nó vay tiền nữa và bảo nó hãy xéo đi.", "eng": "I refused to lend him any more money and told him to take a running jump."}, {"viet": "Tôi đã thấy anh ta tích cực tập tại phòng thể thao.", "eng": "I saw him pumping up at the gym."}, {"viet": "Tôi sẽ phải thúc hắn trả tôi số tiền hắn nợ.", "eng": "I shall have to prod him to pay me what he owes."}, {"viet": "Tôi đã trải qua cả một ngày trong đó mà vẫn không thể xem hết tất cả các bộ sưu tập báu vật nổi tiếng thế giới của nó.", "eng": "I spent a whole day inside and still couldn't finish seeing all its collections of world-famous treasures."}, {"viet": "Tôi bắt cô ta thề giữ bí mật những gì tôi đã nói với cô ta.", "eng": "I swore her to secrecy about what I had told her."}, {"viet": "Tôi nghĩ nấu thêm mười phút nữa sẽ tốt hơn.", "eng": "I think it's all the better for that extra ten minutes cooking."}, {"viet": "Tôi nghĩ là người ta đối xử với anh quá tồi tệ.", "eng": "I think you have been shabbily treated."}, {"viet": "Tôi nhìn chiếc áo khoác một cái và quyết định mua nó.", "eng": "I took one look at the coat and decided I would have to buy it."}, {"viet": "Tôi dựng đứng cái thùng gỗ lên và ngồi lên trên đó.", "eng": "I up-ended the crate and sat on it."}, {"viet": "Tôi muốn có bản hợp đồng giấy trắng mực đen.", "eng": "I want the contract in black and white."}, {"viet": "Tôi muốn cô lột tả được tình cảm hơn khi hát.", "eng": "I want you to put your heart into your singing."}, {"viet": "Tôi rất phấn khởi khi nghe tin anh sẽ ủng hộ chúng tôi.", "eng": "I was encouraged to hear you'll be giving us your support."}, {"viet": "Tôi ra ngoài để phê bình gắt gao về mọi sai lệch và thiếu thận trọng được tiến hành trong buổi trình diễn này.", "eng": "I was out to trounce on every digression and indiscretion conducted in this performance."}, {"viet": "Tôi cố giảm bớt vật nặng ở cái túi kia để tránh phí tổn hành lí phụ trội!", "eng": "I was trying to keep the weight down in the other one to avoid excess baggage charges!"}, {"viet": "Tôi sẽ giúp anh tất cả những gì trong khả năng của tôi.", "eng": "I will give you all the help I can."}, {"viet": "Tôi sẽ không đi xa tới chỗ nói rằng nó bất lương.", "eng": "I won't go so far as to say that he is dishonest."}, {"viet": "Tôi khẳng định rằng thất nghiệp là tệ nạn xã hội nghiêm trọng nhất của chúng ta.", "eng": "I would contend that unemployment is our most serious social evil."}, {"viet": "Tôi muốn nói chuyện với người dân.", "eng": "I would like to talk to the people."}, {"viet": "Tìm ra những điểm yếu trong một lập luận.", "eng": "Identify the weak points in an argument."}, {"viet": "Nếu tôi mà bắt được thằng vô lại đó, tôi sẽ đập cho hắn nhừ tử.", "eng": "If I ever catch the rascal, I'll really wallop him."}, {"viet": "Nếu vậy thì em nên sử dụng bột giặt có công thức pha chế mới được bán trong các cửa hàng.", "eng": "If that's the case, you should use the new formula that's available in stores."}, {"viet": "Nếu chúng ta không cho cô ấy cái cô ta muốn thì không bao giờ chúng ta được yên đâu.", "eng": "If we don't give her what she wants we'll never hear the end of it."}, {"viet": "Nếu gian lận trong thi cử, anh sẽ không bao giờ thoát khỏi bị phạt.", "eng": "If you cheat in the exam you'll never get away with it."}, {"viet": "Nếu trước đây ông đã bị đánh thuế quá nặng, ông sẽ nhận được số tiền giảm thuế.", "eng": "If you have been overtaxed you will get a tax rebate."}, {"viet": "Nếu anh chịu khó lau chùi một chút anh có thể làm sạch đôi ủng của mình.", "eng": "If you used a bit of elbow-grease you could get those boots clean."}, {"viet": "Trong hợp tác xã, lợi nhuận được phân phối trong nội bộ lực lượng lao động.", "eng": "In a co-operative profits are distributed among the work-force."}, {"viet": "Trong tiếng Anh có nhiều từ vay mượn của nhiều ngôn ngữ khác nhau.", "eng": "In English, there are many loan-words from many other languages."}, {"viet": "Với tư cách là người hướng dẫn của anh, tôi chịu trách nhiệm đối với anh.", "eng": "In my capacity as your guardian, I am responsible for you."}, {"viet": "Ở thành phố những người nghèo cũng túng thiếu như ở làng.", "eng": "In the cities, the poor are as badly off as they were in villager."}, {"viet": "Trong chẩn hoang vu, tôi thấy một cái gì thân thương và hoà hợp hơn là ở phố phường và làng quê.", "eng": "In the wilderness, I find something more dear and connate than in streets and villages."}, {"viet": "Nạn lạm phát đang lan tràn và giá cả không kiểm soát được.", "eng": "Inflation is running riot and prices are out of control."}, {"viet": "Nhốt chim trong lồng có phải là độc ác không?", "eng": "Is it cruel to confine a bird in a cage?"}, {"viet": "Mọi người có được quyền đi qua các cánh đồng này không?", "eng": "Is there a right of way across these fields?"}, {"viet": "Thật đáng tiếc là mưa đã làm hỏng cuộc chơi ngoài trời của chúng ta, phải không nhỉ?", "eng": "Isn't it a shame that the rain spoiled our picnic?"}, {"viet": "Nó là vật biểu hiện sự cảm kích của chúng tôi về tất cả những gì ông đã làm cho chúng tôi trong thời gian chúng tôi ở đây.", "eng": "It's a token of appreciation for all you've done for us during our stay here."}, {"viet": "Thật là khó mà tập trung tư tưởng khi có nhiều trò giải trí đến vậy.", "eng": "It's difficult to concentrate when there are so many diversions."}, {"viet": "Nó ở trong cùng một hộp với chai xịt mùi.", "eng": "It's in the same box as the odor spray."}, {"viet": "Chúng tôi không thể giao hàng cho các ông vào ngày mà các ông đã đề nghị.", "eng": "It's not possible to deliver the goods to you on the date you suggested."}, {"viet": "Khai những mẫu thuế thật là buồn chán.", "eng": "It's such a chore filling in tax forms."}, {"viet": "Nó vô giá trị-nó chỉ là một miếng nhựa.", "eng": "It's worthless it's only a piece of plastic."}, {"viet": "Thật là thích thú đối với tôi khi nghe nói về thành công của anh.", "eng": "It gratified me to hear of your success."}, {"viet": "Cái đó thường hay được nhắc đến trong các tác phẩm thơ của thời kỳ này.", "eng": "It is frequently mentioned in the poetic writings of the period."}, {"viet": "Thật thô lỗ khi lừa gạt người ta để họ sẽ làm những điều bạn muốn.", "eng": "It is rude to trick people so they will do what you want."}, {"viet": "Trời có thể mưa có thể không, thật khó mà biết chắc.", "eng": "It may rain or it may not, It's hard to tell."}, {"viet": "Giống như một hội chợ hay một dịp lễ hội.", "eng": "It's like a fair or a festival."}, {"viet": "Hình như với tôi, chúng tôi đã cưới nhau khoảng 5 năm, thế là lâu lắm rồi.", "eng": "It seems like we've been married about five years to me, that's quite a long time."}, {"viet": "Thường thì không đến nỗi nào.", "eng": "It usually isn't that bad."}, {"viet": "Anh thật là ngốc nghếch mới gây gổ đánh nhau với nhà vô địch quyền Anh hạng nặng!", "eng": "It was foolish of you to pick a fight with a heavyweight boxing champion!"}, {"viet": "Phải mất một thời gian chúng tôi mới tới con đường hẻm.", "eng": "It was some time before we struck the track."}, {"viet": "Học hành chăm chỉ hơn sẽ có lợi cho cô ấy.", "eng": "It would advantage her to study harder."}, {"viet": "Nhật là thị trường chính cho sản phẩm của chúng ta, thị trường lớn tiếp sau là Đức.", "eng": "Japan is the main market for our products, and the next biggest market is Germany."}, {"viet": "Các nhà báo được đào tạo để biết quan sát.", "eng": "Journalists are trained to be observant."}, {"viet": "Ai cần đáp án xin hỏi ông hiệu trưởng.", "eng": "Keys are available on application to the principal."}, {"viet": "Hôm nay chúng ta chỉ xem vài cảnh trong vùng này thôi.", "eng": "Let's just take in some of the local sights today."}, {"viet": "Cuộc sống ở đảo Aran luôn luôn lạnh lẽo và khó khăn.", "eng": "Life in the Aran Islands has always been bleak and difficult."}, {"viet": "Nhiều thứ dùng hàng ngày được chế tạo từ nhựa.", "eng": "Many items in daily use are made out of plastic."}, {"viet": "Mark, chúng mình đưa cậu vào đội crikê nhé?", "eng": "Mark, can we count you in for the cricket team?"}, {"viet": "Vui lòng cho tôi biết tên và số điện thoại của ông?", "eng": "May I have your name and telephone number, please?"}, {"viet": "Trong khi đó giây phút cứ trôi qua.", "eng": "Meanwhile the minutes kept ticking away."}, {"viet": "Đa số các chính khách sẽ có mặt tại cuộc vận động bầu cử vào tuần tới.", "eng": "Most politicians will be on the hustings in the coming week."}, {"viet": "Những phương pháp nhiều ý nghĩa để dạy học.", "eng": "Multisensory methods of reading instruction."}, {"viet": "Yêu cầu chi tiêu của tôi gồm 15 pao để mua những thứ lặt vặt.", "eng": "My expenses claim includes 15 pounds for sundries."}, {"viet": "Đến cuối tháng, chủ cho thuê nhà sẽ đuổi tôi ra.", "eng": "My landlord is turning me out at the end of the month."}, {"viet": "Tên em gái tôi là Mary, nó lên chín và có mái tóc dài màu nâu.", "eng": "My sister's name is Mary, she is nine and she has got long brown hair."}, {"viet": "Thương lượng về vấn đề tiền lương không đi đến kết quả nào.", "eng": "Negotiations on the issue of pay were inconclusive."}, {"viet": "Thôi, đừng bận tâm, lát nữa tự tôi làm được mà.", "eng": "No, don't bother, I can do it myself later."}, {"viet": "Bất kể có việc gì thì lần này tôi cũng sẽ phải đi, bởi vì chúng ta có thể đi mà không tốn kém nhiều.", "eng": "No matter what I'm going this time, because we can go cheaply."}, {"viet": "Bây giờ để khai hoá cho các bạn, giáo sư Spinks sẽ nói về đồ gốm Mêhicô.", "eng": "Now here, for your edification is professor Spinks to talk about Mexican pottery."}, {"viet": "Dĩ nhiên rồi, tôi sẽ làm ngay.", "eng": "Of course, I'll do it right now."}, {"viet": "Dầu rỉ ra qua một kẽ nứt nơi bể chứa.", "eng": "Oil is seeping out through a crack in the tank."}, {"viet": "Vào ba ngày liền nhau, thứ hai, thứ ba và thứ tư.", "eng": "On three consecutive days, Monday, Tuesday and Wednesday."}, {"viet": "Một trong những giường của phòng bệnh viện được ngăn rèm.", "eng": "One of the beds in the hospital ward was curtained off."}, {"viet": "Doanh nghiệp cửa chúng tôi bao gầm việc ký gửi và ngoại hối.", "eng": "Our business contains deposit and money-exchange."}, {"viet": "Hy vọng của chúng ta về thời tiết đẹp đã không đến nỗi bị hẫng.", "eng": "Our hopes for fine weather were not disappointed."}, {"viet": "Cửa hàng chúng tôi chỉ buôn bán các sản phẩm nhãn hiệu này.", "eng": "Our shop deals only in products of this brand."}, {"viet": "Đèn cácbuya, ống hàn xì, thiết bị hàn xì.", "eng": "Oxy-acetylene torches, blowpipes, equipment."}, {"viet": "Nhân dân đang đòi hỏi có các cuộc bầu cử tự do.", "eng": "People are crying out for free elections."}, {"viet": "Lúc rảnh rỗi, Peter rất mê chơi bóng đá.", "eng": "Peter is a keen footballer in his spare time."}, {"viet": "Các chính trị gia ở trong số những diễn giả của cuộc họp.", "eng": "Politicians were among the speakers at the meeting."}, {"viet": "Trong lúc đứng đợi, Sam giở lướt xem qua một tờ tạp chí.", "eng": "Sam flicked through a magazine while he waited."}, {"viet": "Rõ ràng nhiều nhân chứng tại vụ xét xử đã được chuẩn bị để khai man trước toà nhằm bảo vệ bị cáo.", "eng": "Several witnesses at the trial were clearly prepared to perjure themselves in order to protect the accused."}, {"viet": "Cô ta là người Đức đã nhập quốc tịch ở Canada.", "eng": "She's a German who was naturalized in Canada."}, {"viet": "Cô ấy đã rất thành công, xét trên nhiều khía cạnh.", "eng": "She's been very successful, one-way and another."}, {"viet": "Cô ấy vừa được nhận vào làm ở một công ty xuất bản.", "eng": "She's just got a job with a publishing company."}, {"viet": "Cô ta chạy để bảo vệ danh hiệu vô địch 400 mét.", "eng": "She's running to defend her 400 metres title."}, {"viet": "Bà ấy tố cáo nhà báo đã đặt điều là bà đã nói.", "eng": "She accused the journalist of putting words into her mouth."}, {"viet": "Cô ấy tằng tịu với một người đàn ông đã có vợ.", "eng": "She became involved with a married man."}, {"viet": "Cô ấy đi lại thình thịch trong đôi ủng nặng chích.", "eng": "She clumps about in her heavy boots."}, {"viet": "Cô ta lần chần mất hai tiếng đồng hồ và nhỡ tàu.", "eng": "She delayed two hours and missed the train."}, {"viet": "Cô ta lái xe có phần nhanh hơn mức cần thiết.", "eng": "She drives rather faster than she ought."}, {"viet": "Cô ta kết thúc cuộc đua bỏ rất xa các tay đua khác.", "eng": "She finished the race way ahead of the other runners."}, {"viet": "Cô ta được một học bổng ở Cambridge nhưng một năm sau đã bỏ học.", "eng": "She got a scholarship to Cambridge but dropped out a year later."}, {"viet": "Cô ta nổi tiếng là người phụ nữ đầu tiên bơi qua biển Măng sơ.", "eng": "She had the distinction of being the first woman to swim the Channel."}, {"viet": "Cô ta làm mãi một công việc đó trong nhiều năm và hết sức chán ngấy nó.", "eng": "She has had the same job for years and is heartily sick of it."}, {"viet": "Cô ta đã nhận ra người đó là người đã tấn công mình.", "eng": "She identified the man as her attacker."}, {"viet": "Cô ấy hoàn toàn chấp nhận không phê phán hành vi của anh ta.", "eng": "She is quite uncritical of his behaviour."}, {"viet": "Bà ta sỉ vả nó, gọi nó là kẻ nói dối và đồ lừa bịp.", "eng": "She laid about him, calling him a liar and a cheat."}, {"viet": "Để tóc dài trông cô ấy đẹp hơn để tóc ngắn nhiều.", "eng": "She looks much prettier with long hair than with short."}, {"viet": "Nàng làm tình làm tội bắt anh ta thực hiện những điều nàng muốn.", "eng": "She nagged him into doing what she wanted."}, {"viet": "Cô ấy trồng hạt xuống đất ẩm.", "eng": "She planted the seeds in the wet earth."}, {"viet": "Cô ấy nhận được một khoản tiền để mua những thứ lặt vặt.", "eng": "She received a cash float to buy sundry items."}, {"viet": "Cô ta là cái thứ hạ cấp.", "eng": "She's as common as dirt."}, {"viet": "Bà ấy rất bảo thủ trong quan điểm của cô ấy.", "eng": "She's so conventional in her views."}, {"viet": "Cô ta lánh vào phòng học để làm việc.", "eng": "She secludes herself in her study to work."}, {"viet": "Cô ta đã trình bày sai lệch bản báo cáo để làm cho tôi tỏ ra là không đủ trình độ.", "eng": "She slanted the report so that I was made to appear incompetent."}, {"viet": "Cô ta đứng bên cánh gà xem biểu diễn.", "eng": "She stood watching the performance from the wings."}, {"viet": "Cô doạ bọn trẻ là sẽ cho chúng ăn đòn.", "eng": "She threatened the children with a walloping."}, {"viet": "Cô ấy cởi nút một cách khéo léo.", "eng": "She untied the knots with dexterous fingers."}, {"viet": "Cô ta bị kết tội làm gián điệp cho địch.", "eng": "She was accused of spying for the enemy."}, {"viet": "Cô ta được chỉ định làm nữ vận động viên của năm.", "eng": "She was designated as sportsman of the year."}, {"viet": "Cô ta được phỏng vấn trên đài nhưng cách làm hơi tồi.", "eng": "She was interviewed on the radio but acquitted herself rather badly."}, {"viet": "Cô ta đã được bổ nhiệm làm huấn luyện viên quốc gia thêm hai năm nữa.", "eng": "She was reappointed as national coach for a further two years."}, {"viet": "Cô ta hoàn toàn không tin cậy được, nên đã bị đuổi.", "eng": "She was totally unreliable, so she was given her marching orders."}, {"viet": "Cô ta đã bị loại từ vòng đầu của cuộc thi đấu.", "eng": "She went out of the tournament in the first round."}, {"viet": "Cô ấy đeo nữ trang có đá quí quanh cổ.", "eng": "She wore beautiful jewell round her neck."}, {"viet": "Đôi giày chịu đựng được sự dày dạn.", "eng": "Shoes that will withstand hard wear."}, {"viet": "Ra hiệu cho trung đoàn bắt đầu cuộc tấn công.", "eng": "Signal to the regiment for the attack to begin."}, {"viet": "Sáu giờ đúng là thời điểm muộn nhất.", "eng": "Six o'clock at the very latest."}, {"viet": "Hút thuốc lá là có hại cho cậu, cậu nên bỏ hút đi.", "eng": "Smoking's bad for you, you ought to pack it in."}, {"viet": "Vì vậy, chúng ta thật sự có thể nói rằng ngành ngân hàng đã tái bắt đầu trong thời Phục Hưng.", "eng": "So we can really say that banking'restarted'during the Renaissance."}, {"viet": "Một số bản in rônêô bài diễn văn của ông ấy.", "eng": "Some cyclostyled copies of his speech."}, {"viet": "Có những người dễ biểu lộ tình cảm hơn những người khác.", "eng": "Some people are more demonstrative than others."}, {"viet": "Ai đó đã mở cửa và ngọn nến bị thổi tắt.", "eng": "Somebody opened the door and the candle blew out."}, {"viet": "Xin lỗi, chúng tôi đến muộn-chúng tôi đã ghé vào một quán rượu trên đường đi.", "eng": "Sorry we're late-we dropped into a pub on the way."}, {"viet": "Sự bẩn thỉu và nghèo nàn nấp sau vẻ hào nhoáng của thành phố.", "eng": "Squalor and poverty lay behind the city's glittering facade."}, {"viet": "Dán vội một yết thị lên bảng thông báo.", "eng": "Stick up a notice on the notice-board."}, {"viet": "Cố vểnh tai nghe cuộc nói chuyện của mình.", "eng": "Strain one's ears to hear a conversation."}, {"viet": "Một luật lệ nghiêm ngặt như vậy không phải dễ thi hành.", "eng": "Such a strict law is not easily enforceable."}, {"viet": "Chủ nhật là ngày nghỉ ở các nước theo đạo Cơ Đốc.", "eng": "Sunday is a holiday in Christian countries."}, {"viet": "Thụy Sĩ hoàn toàn nằm trong đất liền.", "eng": "Switzerland is completely land-locked."}, {"viet": "Đừng có đụng tay vào người tôi, đồ tục tĩu!", "eng": "Take your hand off me, you filthy swine!"}, {"viet": "Hãy nói thật cho tôi hay điều bạn suy nghĩ.", "eng": "Tell me truly what you think."}, {"viet": "Cám ơn, nhưng thật sự nó không tuyệt lắm đâu.", "eng": "Thanks, but it's really nothing great."}, {"viet": "Cái túi to kia có lẽ quá trọng lượng giới hạn.", "eng": "That big one may be over the weight limit."}, {"viet": "Giá mà tôi tôi thấy được một đứa con của mình bị bắt vì bán ma túy!", "eng": "That I should see a child of mine arrested for selling drugs!"}, {"viet": "Câu chuyện đăng trên tờ báo là hoàn toàn bịa đặt.", "eng": "That newspaper story's a complete swindle."}, {"viet": "Việc buôn bán đó cản trở việc phát triển thêm nữa trên địa điểm này.", "eng": "That sale precludes further development on this site."}, {"viet": "Từ đó viết đúng là PH chứ không phải F.", "eng": "That word is spelt with a PH, not an F."}, {"viet": "Bị cáo nói rằng anh ta bị ghép tội oan.", "eng": "The accused man said he had been framed."}, {"viet": "Không khí dày đặc khói thuốc xì gà.", "eng": "The air was thick with cigar fumes."}, {"viet": "Sự thanh toán hàng năm vượt quá thu nhập.", "eng": "The annual disbursement exceed the income."}, {"viet": "Quân đội bán đấu giá nhiều đồ trang bị cũ.", "eng": "The army is auctioning off a lot of old equipment."}, {"viet": "Một cái cớ không có sức thuyết phục.", "eng": "The audience against him is rather flimsy."}, {"viet": "Đứa bé nôn ra hết trên người tôi.", "eng": "The baby puked up all over me."}, {"viet": "Ngân hàng đó đã sát nhập với đối thủ chính của nó.", "eng": "The bank merged with its major rival."}, {"viet": "Buổi sáng đẹp trời có nắng làm tâm trạng tôi thật là sung sướng.", "eng": "The beautiful sunny morning put me in a happy mood."}, {"viet": "Người ta đã phải thả con chim khỏi lưới.", "eng": "The bird had to be extricated from the netting."}, {"viet": "Cái xác bị đưa vào lò thiêu bị thiêu.", "eng": "The body was committed to the flames."}, {"viet": "Cây sào căng buồm quay vòng trên boong tàu.", "eng": "The boom swung over the deck."}, {"viet": "Não là trung tâm của hệ thần kinh.", "eng": "The brain is the centre of the nervous system."}, {"viet": "Nhà đó cho thuê với giá 3.000 bảng Anh một năm.", "eng": "The building rents at £ 3,000 a year."}, {"viet": "Tiếng xì xào trong căn phòng đông đúc.", "eng": "The buzz of voices in the crowded room."}, {"viet": "Chiếc xe hơi đã bị bọn khủng bố gài bẫy mìn.", "eng": "The car had been booby trapped by terrorists."}, {"viet": "Tấm thảm bị bẩn tệ hại đến độ chị không thể nhận ra được màu sắc ban đầu của nó.", "eng": "The carpet was badly stained, to such an extent that you couldn't tell its original colour."}, {"viet": "Hình ở giữa bức tranh là con gái nghệ sĩ.", "eng": "The central figure in the painting is the artist's daughter."}, {"viet": "Người bán thuốc đã có sai sót khi bốc thuốc theo đơn.", "eng": "The chemist made a mistake when making up the prescription."}, {"viet": "Đứa trẻ nhấn chìm tất cả đồ chơi của nó xuống bồn tắm.", "eng": "The child submerged all her toys in the bath."}, {"viet": "Bọn trẻ phải cố gắng nhiều trong khi mẹ chúng nằm bệnh viện.", "eng": "The children had to buckle to while their mother was in hospital."}, {"viet": "Bọn trẻ háo hức trước bữa tiệc sinh nhật.", "eng": "The children were on tiptoe before the birthday party."}, {"viet": "Sự khai hoá nhân loại đã mất hàng ngàn năm.", "eng": "The civilization of mankind has taken thousands of years."}, {"viet": "Ông chủ tịch câu lạc bộ được bầu lên từ năm 1979.", "eng": "The club president has been in since 1979."}, {"viet": "Sự xuất hiện của kỷ nguyên không gian.", "eng": "The coming of the space age."}, {"viet": "Công ty có văn phòng khắp thế giới, nhưng cơ sở chính thì ở London.", "eng": "The company has offices all over the world, but their base is in London."}, {"viet": "Hội nghị đã kết thúc một cách êm xuôi hơn là ồn ào.", "eng": "The conference ended less with a bang than with a whimper."}, {"viet": "Những người tù được xá tội và trả lại tự do.", "eng": "The convicts were pardoned and set free."}, {"viet": "Đất nước cần phải có một lãnh tụ làm cho đất nước đoàn kết lại.", "eng": "The country needs a leader who will hold the nation together."}, {"viet": "Thuỷ thủ đoàn được lệnh thực hiện biện pháp an toàn để ra khơi.", "eng": "The crew was ordered to secure for sea."}, {"viet": "Tiếng báo hiệu của người bảo vệ ban đêm.", "eng": "The cry of the night-watch man."}, {"viet": "Những tác động nguy hiểm về sinh thái của ngành công nghiệp, ví dụ ô nhiễm bầu khí quyển, sông, v. v.", "eng": "The dangerous ecological effects of industry."}, {"viet": "Bên luật sư của bị cáo tranh cãi rằng chứng cớ đó thiếu tính thuyết phục.", "eng": "The defense argues that the evidence is weak."}, {"viet": "Sự triển khai dự án đã bị cản trở nghiêm trọng do ngân quỹ bị giảm bớt.", "eng": "The development of the project was seriously impeded by a reduction in funds."}, {"viet": "Món trên bàn đó dường như ngon đấy.", "eng": "The dish on that table seems delicious."}, {"viet": "Bác sĩ nói tôi phải thực hiện chế độ ăn kiêng.", "eng": "The doctor says I've got to go on a diet."}, {"viet": "Cái lưỡi con chó thè ra.", "eng": "The dog's tongue was hanging out."}, {"viet": "Người lái xe đâm vào lề trong lúc lùi xe.", "eng": "The driver bumped the kerb while reversing."}, {"viet": "Trận động đất là một thảm họa khủng khiếp.", "eng": "The earthquake was a terrible catastrophe."}, {"viet": "Sự kết thúc của dự án sắp nhìn thấy rồi.", "eng": "The end of the project is almost in sight."}, {"viet": "Những lầm lẫn đã vì sơ suất lọt vào văn bản.", "eng": "The errors that have slipped into the text."}, {"viet": "Sự phát triển hệ thống trường học.", "eng": "The expansion of the school system."}, {"viet": "Chiếc lá rụng xoáy vòng xuống đất.", "eng": "The falling leaf spiralled to the ground."}, {"viet": "Hàng rào là để bảo vệ cho gia súc của nông dân.", "eng": "The fence is to protect the farmer's cattle."}, {"viet": "Cuốn phim được dựng trước và sau mới đưa thêm âm nhạc vào.", "eng": "The film was made first and the music was added as an afterthought."}, {"viet": "Hãng đó cho thuê một văn phòng nhìn ra sông.", "eng": "The firm leases an office with views over the river."}, {"viet": "Các ngư dân đã đánh được một mẻ cá lớn.", "eng": "The fishermen had a good haul."}, {"viet": "Người cầu thủ đốn ngã đối phương bằng một lối chơi xấu đầy ích kỷ.", "eng": "The footballer brought down his opponent with a cynical foul."}, {"viet": "Biên giới giữa Áo và Hungari.", "eng": "The frontier between Austria and Hungary."}, {"viet": "Ghế ngồi trong vườn làm bằng sắt rèn.", "eng": "The garden seat was made of wrought iron."}, {"viet": "Những chiếc cốc chạm vào nhau kêu leng keng khi anh ta mang chúng đi.", "eng": "The glasses tinkled as he carried them."}, {"viet": "Chính phủ đang đi ngược lại các lời hứa của họ khi bầu cử.", "eng": "The Government are back-pedaling on their election promises."}, {"viet": "Chính phủ đang xem xét lại tình hình.", "eng": "The government is reviewing the situation."}, {"viet": "Tại khách sạn cũ có một khách hàng trung thành nhưng hay đòi hỏi.", "eng": "The grand old hotel has a loyal but demanding patronage."}, {"viet": "Người gác khuyên những người leo núi đi theo anh ta một cách thận trọng.", "eng": "The guard admonished the mountain climbers to follow him carefully."}, {"viet": "Cán những đồ dùng bằng xương được đẽo hình thú.", "eng": "The handles of many bone tools were carved into animal shapes."}, {"viet": "Hàng rào cao giúp chúng tôi tránh gió được phần nào.", "eng": "The high fence gives some shelter from the wind."}, {"viet": "Bệnh viện đầy những người ốm đau và bị thương.", "eng": "The hospital was full of the sick and wounded."}, {"viet": "Ngôi nhà chỉ có thể đến được từ phía nam.", "eng": "The house is only approachable from the south."}, {"viet": "Cái ý của toàn bộ câu chuyện sướt mướt đó là cốt làm cho tôi cho cô ta mượn tiền.", "eng": "The idea of all that sob-stuff was to get me to lend her money."}, {"viet": "Những sự thay đổi quen thuộc của các mùa.", "eng": "The inevitable changes of the seasons."}, {"viet": "Người phỏng vấn đã dồn nhà chính trị với nhiều câu hỏi.", "eng": "The interviewer cornered the politician with many questions."}, {"viet": "Gia đình Jones có hai trai và một gái.", "eng": "The Joneses have two boys and a girl."}, {"viet": "Sự mở màn một chiến dịch từ thiện.", "eng": "The kickoff of a charity campaign."}, {"viet": "Phong cảnh trơ trụi trừ vài cây xương rồng lác đác.", "eng": "The landscape was bare except for the odd cactus."}, {"viet": "Sự ra đi vội vã của vị lãnh tụ đó làm cho các vấn đề này phức tạp hơn.", "eng": "The leader's hasty departure thickens the problems."}, {"viet": "Tàu cứu đắm đã vớt tất cả những người sống sót.", "eng": "The lifeboat picked up all the survivors."}, {"viet": "Lực lượng cảnh sát Luân Đôn được một viên chức cấp cao lãnh đạo.", "eng": "The London police force is headed by a commissioner."}, {"viet": "Người điên hung tợn và phải bị nhốt lại.", "eng": "The madman was violent and had to be locked up."}, {"viet": "Ban quản trị sẽ cung cấp thức ăn và nước uống.", "eng": "The management will provide food and drink."}, {"viet": "Vấn đề sẽ được đem ra trước uỷ ban.", "eng": "The matter will be brought before the committee."}, {"viet": "Các hội viên rất bực mình về lời đề nghị của bạn.", "eng": "The membership is very annoyed at your suggestion."}, {"viet": "Ông bộ trưởng trước mắt công chúng đã tự cứu mình bằng cách xin từ chức.", "eng": "The minister redeemed himself in the eyes of the public by resigning."}, {"viet": "Mặt trăng xoay quanh trái đất mỗi vòng 28 ngày.", "eng": "The moon circles the earth every 28 days."}, {"viet": "Con chuột nhanh chóng thoát ra khỏi móng vuốt của con mèo.", "eng": "The mouse slipped quickly from the cat's claws."}, {"viet": "Chân trái phía trước của một con ngựa.", "eng": "The near foreleg of a horse."}, {"viet": "Công việc mới là một vụ thăng chức đối với cô ta.", "eng": "The new job is a promotion for her."}, {"viet": "Cái tàu ngầm mới chắc chắn là điều mơ ước của ông đô đốc.", "eng": "The new submarine was sure to be on the admiral's wish list."}, {"viet": "Sáng hôm sau, sau bữa tiệc mọi người vẫn còn chuếnh choáng.", "eng": "The next morning after the party everybody was hung-over."}, {"viet": "Lúc này, số máy đó bị bận.", "eng": "The number is engaged at the moment."}, {"viet": "Sĩ quan phụ trách hành quân.", "eng": "The officer in charge of operation."}, {"viet": "Quyển Cựu Ước và của tín đồ Thiên chúa giáo và quyển Cựu Ước và Tân Ước là hai quyển Thánh kinh nổi tiếng.", "eng": "The Old Testament and the Old and New Testament are the two famous Bible."}, {"viet": "Người tổ chức cuộc thi đấu, buổi lễ, một cuộc liên hoan, v. v.", "eng": "The organizer of the event, function, party, etc."}, {"viet": "Cung điện đóng cửa để trùng tu.", "eng": "The palace is closed during restorations."}, {"viet": "Thì quá khứ của take là took.", "eng": "The past tense of take is took."}, {"viet": "Dân tộc các nước thường có những điệu múa dân gian của riêng mình.", "eng": "The people of many countries have their own folk dances."}, {"viet": "Nghệ sĩ dương cầm quên mất bản nhạc của mình và phải ứng tác khúc nhạc đệm.", "eng": "The pianist forgot his music and had to improvise the accompaniment."}, {"viet": "Nơi mà anh nhìn thấy nó lần cuối.", "eng": "The place where you last saw it."}, {"viet": "Sự tranh luật diễn đàn biến thành một cuộc ẩu đả.", "eng": "The platform discussion would turn into a brawl."}, {"viet": "Nhà thơ đó đả kích kịch liệt các nhà phê bình.", "eng": "The poet whaled away at the critics."}, {"viet": "Cảnh sát đã loại ra hai kẻ tình nghi.", "eng": "The police have eliminated two suspects."}, {"viet": "Cảnh sát đã có mặt tại cuộc biểu tình với số lượng lớn.", "eng": "The police were present at the demonstration in force."}, {"viet": "Khả năng phá vỡ kỷ lục thế giới không bao giờ xảy ra đối với anh ấy.", "eng": "The possibility of breaking the world record never occurred to him."}, {"viet": "Vụ ám sát tổng thống là một sự kiện có tầm quan trọng rung chuyển thế giới.", "eng": "The president's assassination was an event of earth shattering importance."}, {"viet": "Giá thành của máy bay chiến đấu mới quá cao đối với chính phủ.", "eng": "The price-tag on the new fighter plane was too high for the government."}, {"viet": "Lăng kính hoạt động như các giọt nước li ti để tạo ra cầu vồng.", "eng": "The prism acts like the tiny drops of water that cause rainbows."}, {"viet": "Vị giáo sư hài lòng có một thính giả chăm chú như vậy.", "eng": "The professor was pleased to have such an attentive audience."}, {"viet": "Những người phản đối đốt hình nộm của thủ tướng.", "eng": "The protesters burnt an effigy of the Prim Minister."}, {"viet": "Ong chúa không bao giờ rời tổ.", "eng": "The queen bee never leaves the hive."}, {"viet": "Mưa rơi rả rích suốt cả ngày.", "eng": "The rain splashed down all day."}, {"viet": "Những màu đỏ và nâu của rừng vào thu.", "eng": "The reds and browns of the woods in autumn."}, {"viet": "Người phóng viên đã moi được một số sự kiện hay.", "eng": "The reporter had raked out some interesting facts."}, {"viet": "Người giàu giàu thêm, người nghèo càng nghèo đói.", "eng": "The rich get richer the poor get poorer."}, {"viet": "Con đường này nhập vào xa lộ ở Newton.", "eng": "The road joins the motor way at Newton."}, {"viet": "Phòng được chiếu sáng bởi một ngọn đèn.", "eng": "The room was illuminated by a single lamp."}, {"viet": "Hoang mạc Sa-ha-ra ở châu Phi là hoang mạc nóng, khô và rộng nhất trên thế giới.", "eng": "The Sahara in Africa is the world's largest hot, dry desert."}, {"viet": "Nhìn bề ngoài, kế hoạch có vẻ hết sức thiết thực.", "eng": "The scheme seems on the surface to be quite practical."}, {"viet": "Chỗ đỗ thứ hai từ Oxford trên tuyến đi Worcester.", "eng": "The second stop from Oxford on the Worcester line."}, {"viet": "Hình dáng của cơ thể họ thay đổi với tốc độ ngạc nhiên.", "eng": "The shape of their bodies changes with astonishing speed."}, {"viet": "Con tàu tròng trành mạnh.", "eng": "The ship was rolling heavily to and fro."}, {"viet": "Nhìn thấy máu luôn làm anh ấy thấy hơi buồn nôn.", "eng": "The sight of blood always made him feel a bit queasy."}, {"viet": "Bầu trời đỏ rực ánh chiều tà.", "eng": "The sky was all aglow with the setting sun."}, {"viet": "Người lính tỏ ra rất dũng cảm trong trận đánh.", "eng": "The soldier showed great courage in the battle."}, {"viet": "Vận động viên chạy người Tây Ban Nha dẫn đầu 50m.", "eng": "The Spanish runner now has a lead of om."}, {"viet": "Toàn thể nhân viên phát biểu nhất trí về vấn đề này.", "eng": "The staff speak as one man on this issue."}, {"viet": "Cửa hàng chỉ là bức bình phong cho hoạt động cờ bạc của chúng.", "eng": "The store was just a blind for their gambling operation."}, {"viet": "Đến cuối học kỳ tất cả các sinh viên đều kết thành từng đôi.", "eng": "The students had all paired off by the end of term."}, {"viet": "Bản phụ lục của cuốn Từ điển tiếng Anh Oxford.", "eng": "The supplement to the Oxford English Dictionary."}, {"viet": "Thầy giáo phàn nàn rằng đứa bé không nhớ được lời hướng dẫn nào hết.", "eng": "The teacher complained that the child could not retain any of the instructions given."}, {"viet": "Sự đơn điệu chán ngắt của những ngày mùa đông ở trong nhà.", "eng": "The tedious sameness of winter days indoors."}, {"viet": "Tên trộm tháo chạy, theo sát là một đám người giận dữ.", "eng": "The thief ran off with an angry crowd at his heels."}, {"viet": "Con tàu Titanic chìm xuống đáy biển.", "eng": "The Titanic went to the bottom."}, {"viet": "Xe lửa chưa vào thềm ga.", "eng": "The train is not in yet."}, {"viet": "Quân đội tiếp tục kháng cự lại quân địch cho đến khi hết đạn dược.", "eng": "The troops stood out against the enemy until ammunition was exhausted."}, {"viet": "Hai chiếc máy bay đâm vào nhau ở giữa trời.", "eng": "The two planes collided ( with each other in mid air )."}, {"viet": "Trường đại học này nghiêng về những môn khoa học.", "eng": "The university is biased towards the sciences."}, {"viet": "Phong cảnh nhìn từ đỉnh đồi thật hùng vĩ.", "eng": "The view from the hill top is really magnificent."}, {"viet": "Tín hiệu đề phòng đã được đặt ở đó để hướng dẫn công chúng.", "eng": "The warning sign was put there for the benefit of the public."}, {"viet": "Bánh xe ô tô quay nhanh.", "eng": "The wheels of the car were spinning round."}, {"viet": "Những cái cửa sổ được làm bằng các tấm ván xếp cạnh nhau.", "eng": "The windows were covered with boarding."}, {"viet": "Những yêu sách đòi tăng lương của công nhân đã bị giới chủ từ chối.", "eng": "The workers'demands for higher pay were refused by the employers."}, {"viet": "Trẻ em ít tuổi nhất là ở lớp một, trẻ em lớn tuổi nhất ở lớp sáu.", "eng": "The youngest children are in the first form, the oldest in the sixth form."}, {"viet": "Các ý tưởng của họ về cải tổ hệ thống nhà tù chỉ là chuyện trời ơi đất hỡi.", "eng": "Their ideas about reforming the prison system are just pie in the sky."}, {"viet": "Vậy thì ông có đem theo chứng minh nhân dân hay bằng lái xe không?", "eng": "Then, do you have your Identity Card or driving licence with you?"}, {"viet": "Có rất nhiều sản phẩm dưỡng da khó đường lựa chọn.", "eng": "There's a bewildering range of skin care products to choose from."}, {"viet": "Đã có hơi trục trặc trong hệ thống chuyển gửi thư từ của chúng tôi.", "eng": "There's been a slight hiccup in our mailing system."}, {"viet": "Còn vô khối giấy, nếu anh cần.", "eng": "There's plenty more paper if you need it."}, {"viet": "Có nhiều sự giống nhau giữa hai ngôn ngữ này.", "eng": "There are many affinities between the two languages."}, {"viet": "Có những lý lẽ mạnh mẽ ủng hộ và phản đối án tử hình.", "eng": "There are strong arguments for and against capital punishment."}, {"viet": "Gần đây đã có nhiều vụ khởi tố thành công về buôn lậu ma tuý.", "eng": "There have been several successful prosecutions for drug smuggling recently."}, {"viet": "Có chiều hướng thay đổi trong thái độ của cử tri.", "eng": "There is a wind of change in the attitude of voters."}, {"viet": "Hiện giờ máy pha cà phê bị trục trặc.", "eng": "There is something wrong with the machine at the moment."}, {"viet": "Có nhiều thức ăn nhưng tôi chỉ ăn một tí thôi.", "eng": "There was a lot of food but I only ate a little."}, {"viet": "Xe cộ đông quá chúng tôi phải đứng lại mất nửa giờ.", "eng": "There was so much traffic that we were stationary for half an hour."}, {"viet": "Tối nay sẽ có một cuộc diễn tập toàn bộ vở kịch.", "eng": "There will be a run-through of the whole play tonight."}, {"viet": "Những bông hoa này là vật nhỏ mọn gọi là đền đáp lòng nhân hậu to lớn của quý ngài.", "eng": "These flowers are a small acknowledgement of your great kindness."}, {"viet": "Đôi giầy này hơi quá to đối với tôi.", "eng": "These shoes are a little too big for me."}, {"viet": "Họ đã bán cho chúng tôi mỗi bao rẻ 20 penni.", "eng": "They're undercutting us by 20p a packet."}, {"viet": "Họ đang đòi một cái giá phi lí so với công việc.", "eng": "They are asking a preposterous price for the work."}, {"viet": "Họ lừa anh ấy hàng trăm đô la trong vụ mua bán đó.", "eng": "They beat him out of hundreds of dollars on that deal."}, {"viet": "Họ dồn những người phản đối lại và đẩy họ lùi xa khỏi xe của Tổng thống.", "eng": "They corralled the protesters and kept them away from the President's car."}, {"viet": "Họ có mức sống cao Mức sống ở nước chúng tôi thấp hơn ở nước anh.", "eng": "They enjoy a high standard of living The standard of living in our country is lower than in yours."}, {"viet": "Họ đã bất hạnh gặp phải một cơn bão dữ dội.", "eng": "They had the misfortune to be hit by a violent storm."}, {"viet": "Họ cứ hút thuốc mặc những điều cảnh báo.", "eng": "They kept on smoking in spite of warnings."}, {"viet": "Họ gặp, mê nhau và sáu tuần sau đã lấy nhau.", "eng": "They met, fell for each other and got married six weeks later."}, {"viet": "Họ cung cấp đồ ăn thức uống ở giữa trận đấu.", "eng": "They provided refreshments in the middle of the match."}, {"viet": "Họ cho con gái vào một trường học tốt nhất trong nước.", "eng": "They send their daughter to one of the best schools in the country."}, {"viet": "Họ đi làm bằng xe buýt.", "eng": "They travelled to office in an omnibus."}, {"viet": "Cả hai đều trong tâm trạng vui vẻ tại bữa ăn tối.", "eng": "They were both in good form at dinner."}, {"viet": "Họ đeo phù hiệu đề Năng lượng hạt nhân-không, cảm ơn!", "eng": "They were wearing badges that said Nuclear Power-No thanks!"}, {"viet": "Khu vực này có tỉ lệ tội phạm, bệnh tật, nạn thất nghiệp, v. v. cao.", "eng": "This area has a high incidence of crime, disease, unemployment, etc."}, {"viet": "Công ty này xuất bản sách cho trẻ em.", "eng": "This company publishes children's books."}, {"viet": "Lễ hội này bắt nguồn từ lễ nghi tôn giáo.", "eng": "This festival descends from a druidic rite."}, {"viet": "Mì này tốt hơn cái tôi mua hôm qua.", "eng": "This is better bread than the one I bought yesterday."}, {"viet": "Điều này chẳng quan trọng gì-tôi không muốn nêu lên thành một vấn đề.", "eng": "This isn't very important-I don't want to make an issue of it."}, {"viet": "Quan điểm của tờ báo này rất hữu.", "eng": "This newspaper's views are very right-wing."}, {"viet": "Cái radio này không chạy, tôi sẽ thay cái khác.", "eng": "This radio does not work, i am going to get a replacement."}, {"viet": "Vấn đề này là lĩnh vực tôi hoàn toàn không biết.", "eng": "This subject is quite unknown country to me."}, {"viet": "Vụ mùa năm nay thật là một thất bại thảm hại.", "eng": "This year's harvest was a dismal failure."}, {"viet": "Để ngày tháng trở lại chỗ của chúng trong các mùa, Giáo hoàng Gregory chuyển ngày lên 10 ngày.", "eng": "To put the dates back in their proper places in the seasons, Pope Gregory moved the date up 10 days."}, {"viet": "Theo truyền thống, đàn tế này chỉ dành cho hoàng đế sử dụng.", "eng": "Traditionally, this temple was for imperial use only."}, {"viet": "Các nhóm chống lãnh đạo trong đảng.", "eng": "Various anti-leadership groupings within the party."}, {"viet": "Nước bao gồm các nguyên tố hyđrô và ô-xy.", "eng": "Water is composed of the elements hydrogen and oxygen."}, {"viet": "Chúng tôi sẽ cử người lên phòng của ông ngay.", "eng": "We'll send someone up to your room at once."}, {"viet": "Chúng tôi không hẳn là thân nhau, nhưng chúng tôi gặp nhau khá thường xuyên.", "eng": "We're not exactly on intimate terms, but we see each other fairly often."}, {"viet": "Chúng tôi có cốm, đậu phụng và kem.", "eng": "We've got puffed rice, peanuts and ice-cream."}, {"viet": "Chúng tôi đeo mặt nạ tại buổi tiệc và không ai biết chúng tôi là ai.", "eng": "We all wore masks at the party and no one knew who we were."}, {"viet": "Chúng ta sắp hết bột và đường.", "eng": "We are running low on flour and sugar."}, {"viet": "Chúng ta không thể trông mong có được thời tiết tốt cho cuộc liên hoan ngoài trời.", "eng": "We can't calculate on ( having ) good weather for the barbecue."}, {"viet": "Chúng tôi đã thi hành các mệnh lệnh của thuyền trưởng với tất cả sự khẩn trương có thể được.", "eng": "We carried out the captain's orders with all possible expedition."}, {"viet": "Chúng tôi thành thật xin lỗi vì đã gây ra bất tiện này.", "eng": "We do apologize for the inconvenience."}, {"viet": "Chúng tôi thấy Doug trong quán rượu đang tán tỉnh một cô hầu bàn.", "eng": "We found Doug in the bar trying to chat up a waitress."}, {"viet": "Chúng tôi đã gặp phải khó khăn lớn nhất có thể tưởng tượng được mới đến được đây đúng giờ.", "eng": "We had the greatest difficulty imaginable getting here in time."}, {"viet": "Chúng tôi đã mắc điện thoại ở văn phòng.", "eng": "We have installed a telephone in the office."}, {"viet": "Chúng tôi mong nó sẽ nhắc ông nhớ đến thời gian chúng ta đã cùng làm việc với nhau.", "eng": "We hope it'll remind you of the time we've had together."}, {"viet": "Chúng tôi không ưa nhau, nhưng hình như số phận bắt chúng tôi phải luôn luôn gặp nhau.", "eng": "We loathe each other, yet we seem doomed constantly to meet."}, {"viet": "Chúng ta phải giúp đỡ những người khác ít may mắn hơn chúng ta.", "eng": "We must help others less fortunate than ourselves."}, {"viet": "Ngày nay chúng ta du lịch vòng quanh thế giới bằng phương tiện mà trước đây không ai tưởng tượng nổi.", "eng": "We now travel round the world in a way previously undreamt-of."}, {"viet": "Chúng tôi đã lấy lại được chi phí biểu diễn bằng tiền bán vé.", "eng": "We recouped the show's expenses from ticket sales."}, {"viet": "Chúng ta nên chăm sóc tốt hơn tới những người cao tuổi.", "eng": "We should provide better care for the elderly."}, {"viet": "Chúng ta cũng dùng đất sét để làm ra đĩa, tách, nồi chảo.", "eng": "We use it for plates and cups and saucers."}, {"viet": "Chúng tôi bị phục kích ở đèo.", "eng": "We were caught in an ambush in the pass."}, {"viet": "Chúng tôi sẽ giảm 20% tại quầy tính tiền.", "eng": "We will deduct 20% at the register."}, {"viet": "À anh có thể cho tôi biết tỉ giá hối đoái hôm nay không?", "eng": "Well, could you tell me the exchange rate today?"}, {"viet": "À, “ dãy Y ” nghe như ở tuốt trên tầng bình lưu đấy.", "eng": "Well, that row Y sounds like it's in the stratosphere."}, {"viet": "Nào, có việc gì thế, con?'bác sĩ hỏi.", "eng": "What's the matter with you, son?'asked the doctor."}, {"viet": "Cho đến nay, những bộ phim nào bạn đã xem là ấn tượng nhất?", "eng": "What are the most impressive movies that you have seen so far?"}, {"viet": "Bạn làm gì để hết căng thẳng?", "eng": "What do you do to get rid of your stress?"}, {"viet": "Tôi làm gì trong lúc rỗi là chuyện riêng của tôi.", "eng": "What I do in my free time is my own affair."}, {"viet": "Tỷ lệ nam giới so với nữ giới trong dân số là bao nhiêu?", "eng": "What is the proportion of men to women in the population?"}, {"viet": "Điều gì khiến bạn muốn làm vậy?", "eng": "What makes you want to do so?"}, {"viet": "Ở đây các bữa ăn được phục vụ lúc mấy giờ?", "eng": "What time are meals served here?"}, {"viet": "Khi được hỏi, bà ta khẳng định rằng bà ta sẽ nghỉ hưu.", "eng": "When asked, she confirmed that she was going to retire."}, {"viet": "Khi tỉnh lại, tôi thấy mình đang nằm trên sàn.", "eng": "When I came to my senses, I was lying on the floor."}, {"viet": "Bao giờ thì tôi nên hỏi anh ta?''Càng sớm càng tốt'.", "eng": "When should I ask him?''The sooner the better'."}, {"viet": "Sau khi đã làm xong dự toán về công trình, mới thấy rõ là cứ tiếp tục làm sẽ không kinh tế.", "eng": "When we had done the costings on the project, it was clear it would not be economical to go ahead with it."}, {"viet": "Bài dài thế này chúng ta cắt bỏ chỗ nào được?", "eng": "Where can we make a cut in this long article?"}, {"viet": "Bạn thích điều nào hơn, hệ thống dựa vào công trạng hay hệ thống dựa vào thâm niên để thăng chức?", "eng": "Which do you prefer, a merit-based system or a seniority-based system for promotions?"}, {"viet": "Trong thời gian tôi ở Madrid, đã có một lễ hội.", "eng": "While I was in Madrid there was a carnival."}, {"viet": "Ai biết được ngày mai có thể mang lại những thay đổi gì?", "eng": "Who knows what changes tomorrow may bring?"}, {"viet": "Sao ông không đến nước Anh để nghỉ hè?", "eng": "Why don't you come over to England for a holiday?"}, {"viet": "Liệu Spurs có bị xuống hạng ba không?", "eng": "Will Spurs be relegated to the third division?"}, {"viet": "Bạn vui lòng chụp cho tôi một tấm hình được không?", "eng": "Will you take a picture of me?"}, {"viet": "Với giấy tờ, suy nghĩ, công việc tài chính trong tình trạng ( hoàn toàn ) lộn xộn.", "eng": "With one's papers, thoughts, financial affairs in ( complete ) disorder."}, {"viet": "10 giờ 30 được không ạ?", "eng": "Would 10: 30 be all right?"}, {"viet": "Các ông có muốn xem ca-ta-lô giới thiệu đầy đủ các mặt hàng của chúng tôi không?", "eng": "Would you like to have a look at our catalog covering the complete line of our goods?"}, {"viet": "Xin anh dịch lá thư này giúp tôi được không?", "eng": "Would you please translate this letter for me?"}, {"viet": "Vâng, cho tôi món cá hun khói, thịt nấu đông, dưa chuột ngâm tỏi ăn nguội, và rong biển tẩm nước xốt.", "eng": "Yes, I'd like a Smoked Fish, Aspic, Cold Cucumber with Garlic, and Marinated Seaweed."}, {"viet": "Vâng, ông có thể rút tiền bằng cách đổi tiền mặt giấy chứng nhận trước ngày đáo hạn.", "eng": "Yes, you may withdraw your funds by cashing in the certificate before the maturity date."}, {"viet": "Anh sẽ phải đợi cho đến cuối tháng tôi mới có thể trả tiền anh được.", "eng": "You'll have to wait until the end of the month before I can pay you."}, {"viet": "Anh quá hời hợt không thể thưởng thức được loại văn học lớn như thế này.", "eng": "You're too superficial to appreciate great literature like this."}, {"viet": "Ông phải chú ý đến việc ăn uống và tránh xa quà vặt.", "eng": "You are supposed to watch what you eat, and stay from junk food."}, {"viet": "Cậu không thể thi đậu mà không có sự chuẩn bị.", "eng": "You can't pass an exam without preparation."}, {"viet": "Khi đọc sách của ông ta, anh có thể thấy được cách ông ấy suy nghĩ như thế nào.", "eng": "You can see the way his mind works when you read his books."}, {"viet": "Hình như bạn không thông cảm tôi bận như thế nào.", "eng": "You don't seem to appreciate how busy I am."}, {"viet": "Anh phải bảo quản đồ của anh chứ.", "eng": "You have to take care of your stuff."}, {"viet": "Bà có thể trả tiền cho hơn một năm trong một lần nếu bà muốn.", "eng": "You may pay for more than one year at a time if you wish."}, {"viet": "Anh phải thoả mãn các điều kiện bắt buộc mới có được phiếu mua hàng.", "eng": "You must satisfy the required conditions to get your voucher."}, {"viet": "Em cũng đã nói là phải chăm sóc cho bố em nữa đấy.", "eng": "You said you had to take care of him, too."}, {"viet": "Bạn nên mặc màu đó thường xuyên hơn.", "eng": "You should wear it more often."}, {"viet": "Khi nào có sách anh sẽ được thông báo.", "eng": "You will be informed when the book becomes available."}, {"viet": "Tốt nhất là ngày mai anh lại gọi đến.", "eng": "Your best bet would be to call again tomorrow."}, {"viet": "Đề nghị của anh sẽ đòi hỏi phải vay thêm tiền.", "eng": "Your proposal will necessitate borrowing more money."}]