[{"viet": "9 là một phần tử của tập hợp các số lớn hơn.", "eng": "9 is a member of the set of all numbers greater than."}, {"viet": "Một vòng tản bộ thảnh thơi quanh các cửa hiệu.", "eng": "A casual saunter around the shops."}, {"viet": "Sao chổi trông giống như một ngôi sao có mái tóc tỏa sáng chảy dài như dòng suối.", "eng": "A comet looks like a star that has shining hair streaming out from it."}, {"viet": "Một tội ác được thực hiện với sự thông đồng của cảnh sát.", "eng": "A crime carried out with the connivance in connivance with the police."}, {"viet": "Một tay tập tò, học đòi theo nghệ thuật.", "eng": "A dilettantish follower of the arts."}, {"viet": "Một người chơi bóng lăn nhanh nhẹn với động tác khéo léo.", "eng": "A fast bowler with a fine action."}, {"viet": "Một lực lượng, sự kiện, con người cần được coi trọng.", "eng": "A force, fact, person to be reckoned with."}, {"viet": "Một luật sư giỏi có thể luôn tìm ra được một cách né tránh pháp luật.", "eng": "A good lawyer can always find a loophole."}, {"viet": "Xin cho một hăm-bơ-gơ và khoai tây chiên.", "eng": "A hamburger and French fries, please."}, {"viet": "Một hình bóng to lớn lù lù hiện ra khỏi màn sương.", "eng": "A huge shape loomed up out of the fog."}, {"viet": "Một toan tính nực cười nhằm làm giảm uy tín của chính phủ.", "eng": "A laughable attempt to discredit the Government."}, {"viet": "Một đoạn kéo dài của con đường thênh thang.", "eng": "A long stretch of open road."}, {"viet": "Một cuộc diễu hành của khinh binh.", "eng": "A march past by the light infantry."}, {"viet": "Một người lái xe ôtô bị thương do xe trượt bánh.", "eng": "A motorist who was injured in a spinout."}, {"viet": "Ngữ pháp tiêu chuẩn của một ngôn ngữ diễn đạt cách nói hoặc viết ngôn ngữ mà tác giả của nó cho là cần phải theo.", "eng": "A normative grammar of a language describes how its authors think the language should be spoken or written."}, {"viet": "Một quán trọ có những thứ phục vụ ít hơn một khách sạn phần nào, nó luôn luôn nhỏ và không bao giờ thanh lịch, đôi khi có phục vụ bữa ăn sáng, đôi khi không.", "eng": "A pension had somewhat less to offer than a hotel, it was always smaller, and never elegant, it sometimes offered breakfast, and sometimes not."}, {"viet": "Một âm mưu lật đổ chính phủ.", "eng": "A plot to overthrow the government."}, {"viet": "Một khuynh hướng thiên về sự bộc phát bạo lực bất ngờ.", "eng": "A proclivity towards sudden violent outbursts."}, {"viet": "Sự không chịu tuân thủ ý muốn của chính phủ về vấn đề này.", "eng": "A refusal to kowtow to the government's wishes on this issue."}, {"viet": "Một cuộc chiến liên tục để giành quyền kiểm soát đảng.", "eng": "A running battle for control of the party."}, {"viet": "Một kẻ dâm loạn chuyên hãm hiếp trẻ em.", "eng": "A sexual deviant who assaults children."}, {"viet": "Một thị trấn nhỏ cách quá xa hoạt động của thủ đô.", "eng": "A small town light-years away from the action of the capital."}, {"viet": "Một người lãnh đạo lỗi lạc trong phong trào bênh vực cho các quyền lợi của phụ nữ.", "eng": "A standard-bearer for women's rights."}, {"viet": "Một vụ gia tăng đột ngột về số người thất nghiệp.", "eng": "A surge in the number of people out of work."}, {"viet": "Một vết cắt nhỏ trên tấm vải may áo.", "eng": "A tiny snick in the dress material."}, {"viet": "Một đầu mối quan trọng cho việc tìm ra căn cước kẻ giết người.", "eng": "A vital clue to the killer's identity."}, {"viet": "Một cuốn sổ tay của phân xưởng cung cấp những sơ đồ và các hướng dẫn để sửa chữa ôtô của bạn.", "eng": "A workshop manual gives diagram and instructions for repairing your car."}, {"viet": "Đứng ra làm người bảo lãnh cho ai khi họ thăm viếng đất nước của bạn.", "eng": "Act as somebody's sponsor when they visit your country."}, {"viet": "Sau một vài năm ở ý, Copernicus trở về Ba Lan.", "eng": "After a few years in Italy, Copernicus went back to Poland."}, {"viet": "Sau khi cân nhắc kỹ lưỡng, họ quyết định không mua.", "eng": "After long deliberation, they decided not to buy."}, {"viet": "Sau cơn mưa giông có nhiều vũng nước trên mặt lộ.", "eng": "After the rainstorm there were pools on the roads."}, {"viet": "Tất cả ma túy đều có hại, nhưng côcain thì rất hại.", "eng": "All drugs are bad, but crack is wacky."}, {"viet": "Các nhân vật nổi tiếng trong giới nhạc pop đều đã có mặt ở bữa tiệc.", "eng": "All the big names in the pop music world were at the party."}, {"viet": "Hầu hết tất cả những ngân hàng ở đây đều quản lý tín dụng.", "eng": "Almost all banks here handle credit."}, {"viet": "Một sinh viên có năng lực nhưng thiếu tự tin.", "eng": "An able but diffident young student."}, {"viet": "Một họa sĩ thích thui thủi một mình thậm chí trong cuộc sống hàng ngày.", "eng": "An artist who was farouche even in everyday life."}, {"viet": "Một nét mặt biểu lộ sự sửng sốt và hoàn toàn không tin.", "eng": "An expression of shock and utter incredulity."}, {"viet": "Một sĩ quan nổi danh về tài năng và xông xáo.", "eng": "An officer famous for his skill and dash."}, {"viet": "Một diễn viên trẻ có triển vọng thành công.", "eng": "An up-and-coming young actor."}, {"viet": "Ann không biết bơi và bị bỏ chới với ở tận phía nước sâu của hồ bơi.", "eng": "Ann couldn't swim and was left floundering around in the deep end of the swimming-pool."}, {"viet": "Các ứng viên phải có những phẩm chất và khả năng tiên quyết cho chức năng điều hành.", "eng": "Applicants must have the right stuff for the executive position."}, {"viet": "Ở đây chúng tôi có được an toàn khi bị tấn công không?", "eng": "Are we secure from attack here?"}, {"viet": "Bạn có tin chắc rằng anh ấy sẽ không trở lại chăng?", "eng": "Are you positively convinced that he is not coming back?"}, {"viet": "Là một vũ công thì nó không thua ai cả.", "eng": "As a dancer, he is second to none."}, {"viet": "Vừa thấy cậu bé trên đường cô ta phanh gấp.", "eng": "As soon as she saw the child in the road, she jammed on the brakes."}, {"viet": "Lúc chín giờ tối những tù nhân bị nhốt suốt đêm.", "eng": "At 9 pm the prisoners are locked in for the night."}, {"viet": "Ở giai đoạn này không thể biết được kế hoạch của chúng ta có thành công hay không.", "eng": "At this stage it's impossible to know whether our plan will succeed."}, {"viet": "Ngân hàng Thông tin là một ngân hàng tổng hợp trên toàn quốc.", "eng": "Bank of Communications is a nationwide universal bank."}, {"viet": "Mang ơn ai về sự động viên của anh ta.", "eng": "Be indebted to somebody for his encouragement."}, {"viet": "Chỗ ngủ và bữa điểm tâm giá 15 bảng Anh một đêm.", "eng": "Bed and breakfast costs £ 15 a night."}, {"viet": "Bên kia ranh giới vùng đất có người ở có rất nhiều nguy hiểm thực sự.", "eng": "Beyond the frontier lay very real dangers."}, {"viet": "Cả hai đội đều ghi bàn thắng như nhau, như vậy là ngang tài ngang sức.", "eng": "Both teams have won the same number of games so honours are even between them."}, {"viet": "Xây một cái đập để nâng mực nước lên.", "eng": "Build a dam to raise the water-level."}, {"viet": "Nhưng tôi phải nói với ông rằng vợ tôi nói tiếng Anh không được nhiều lắm.", "eng": "But I must tell you that my wife speaks very little English."}, {"viet": "Nhưng ông không thể nhận tiền lãi đã định.", "eng": "But you cannot receive the stated interest."}, {"viet": "À này, bạn đã đến cửa hàng Bách hóa Venus chưa?", "eng": "By the way, have you been to the Venus Department Store yet?"}, {"viet": "Cho tôi một ly nước cam không đá nhé?", "eng": "Can I have an orange juice without ice?"}, {"viet": "Bạn có thể mua rượu ở các cửa hàng phục vụ 24/24 giờ ở Canada không?", "eng": "Can you buy alcohol in convenience stores in Canada?"}, {"viet": "Anh có thể chứng minh được là tôi nhầm không?", "eng": "Can you prove that I am wrong?"}, {"viet": "Bạn không thấy rằng bạn đang làm khổ cô ta đó sao?", "eng": "Can't you see you're upsetting her?"}, {"viet": "Niệm thần chú để gọi các hồn ma.", "eng": "Chant incantation to the evil spirits."}, {"viet": "Lễ Giáng Sinh lại tới đến nơi rồi.", "eng": "Christmas is almost upon us again."}, {"viet": "Thu lượm những cái cốc không, đĩa bẩn, giấy bỏ.", "eng": "Collect up the empty glasses, dirty plates, waste paper."}, {"viet": "Thừa nhận một quan điểm đối với ai trong cuộc tranh luận.", "eng": "Concede a point to somebody in an argument."}, {"viet": "Những phạm nhân bị kết án đã bị tước quyền bầu cử.", "eng": "Convicted criminals are debarred from voting elections."}, {"viet": "Anh thậm chí không thể tìm được lý do tại sao anh đến trễ à?", "eng": "Could you not even find an excuse to why you are late?"}, {"viet": "Các nhà phê bình đã khen ngợi tác phẩm đó là rất độc đáo.", "eng": "Critics praised the work as highly original."}, {"viet": "Tật điếc và mờ mắt là ở trong số những bệnh của tuổi già.", "eng": "Deafness and failing eyesight are among the infirmity of old age."}, {"viet": "Ước mong phục hồi các mối quan hệ.", "eng": "Desirous of restoring relations between our two countries."}, {"viet": "Anh đã tìm hiểu lễ powwow chưa?", "eng": "Did you find out about powwows?"}, {"viet": "Các nhà ngoại giao gặp gỡ các vị nguyên thủ quốc gia.", "eng": "Diplomats rubbing elbows with heads of state."}, {"viet": "Làm ơn vặn nhỏ máy phát thanh khi tôi đang gọi điện thoại, được không?", "eng": "Do me a favour and turn the radio down while I'm on the phone, will you?"}, {"viet": "Ông có bán sakê ở đây à?", "eng": "Do you carry sake in this place?"}, {"viet": "Ở Canada có khu rừng nguyên sinh nào không?", "eng": "Do you have any first growth forests in Canada?"}, {"viet": "Bạn có biết tôi có thể học chơi ở đâu không?", "eng": "Do you know where I can take lessons?"}, {"viet": "Bạn có nhớ những lúc trước đây chúng ta thường trốn học không?", "eng": "Do you remember when we used to cut school?"}, {"viet": "Ông có hiểu điều tôi đang cố gắng nói không?", "eng": "Do you understand what I am trying to say?"}, {"viet": "Điệu nhảy này có tên không?", "eng": "Does this dance have a name?"}, {"viet": "Đừng có mua ngay chiếc ôtô đầu tiên anh gặp, hãy đi khảo giá kỹ một chút.", "eng": "Don't buy the first car you see: shop around a bit."}, {"viet": "Đừng đánh giá bề ngoài-vì bề ngoài có thể làm sai lệch.", "eng": "Don't judge by appearances-appearances can be misleading."}, {"viet": "Đừng lắc cái chai hoặc anh sẽ làm vẩn cặn lên đó.", "eng": "Don't shake the bottle or you will disturb the lees."}, {"viet": "Đừng lo lắng nếu như anh không thể hoàn tất việc đó.", "eng": "Don't worry if you can't finish it."}, {"viet": "Lái xe thẳng tuốt tới trạm cuối cùng của họ.", "eng": "Drove through to their final destination."}, {"viet": "Những nỗ lực trong việc thám hiểm hành tinh hoàn thành được bằng sự cộng tác với các nước khác có chương trình vũ trụ.", "eng": "Efforts in planetary exploration achieved in cooperation with other spacefaring nations."}, {"viet": "Giao một công việc cho người phụ tá.", "eng": "Entrust an assistant with a task."}, {"viet": "Ai cũng có một dịp trong lịch sử thuộc về cá nhân mình.", "eng": "Everyone has a moment in history which belongs particularly to him."}, {"viet": "Xin lỗi, tôi có thể nhận hành lý của tôi ở đâu?", "eng": "Excuse me, where can I get my luggage?"}, {"viet": "Lãi suất đang tụt xuống đưa ra cho hãng một vấn đề mới.", "eng": "Falling interest rates present the firm with a new problem."}, {"viet": "Ít chất liệu nấu nướng có nhiều công dụng như trứng.", "eng": "Few cooking ingredients are as versatile as eggs."}, {"viet": "Người đoạt giả thưởng sẽ được 10.000 $, một số tiền học bổng bốn năm, một chiếc xe hơi thể thao và được mời đóng phim thử.", "eng": "First place winner gets $ 10,000, a four-year scholarship, a sport car and a screen test."}, {"viet": "Sau điểm cuối cùng 3-1, đội United đứng đầu liên đoàn.", "eng": "Following a 3-1 scoreline, united stay top of the league."}, {"viet": "Những người nước ngoài chưa quen lối sống của người Anh.", "eng": "Foreigners unversed in the British way of life."}, {"viet": "Làm sai các yêu cầu về qui phạm xây dựng.", "eng": "Fudged on a building code requirement."}, {"viet": "Được bớt tiền cho một tủ lạnh.", "eng": "Get an allowance for your fridge."}, {"viet": "Thúc vào sườn người nào đó.", "eng": "Give somebody a dig in the ribs."}, {"viet": "Hãy đi đến nhà thờ và hỏi thăm tiếp-nó ở gần đó.", "eng": "Go to the church and ask again-it's near there."}, {"viet": "Lính gác đã được bố trí tại nhiều điểm quanh vòng đai.", "eng": "Guards had been posted at several points around the perimeter."}, {"viet": "Y tá đã cho cô uống thuốc chưa?", "eng": "Has nurse given you your medicine?"}, {"viet": "Mày đã đổ hết thùng rác chưa?", "eng": "Have you emptied out the rubbish bin?"}, {"viet": "Cô đã học lời thoại của mình chưa?", "eng": "Have you learnt your part yet?"}, {"viet": "Anh ta rất muốn có một chiếc ô tô như thế.", "eng": "He'd give his eye-teeth to own a car like that."}, {"viet": "Nó luôn luôn truyền bá những tin đồn ác ý.", "eng": "He's always putting about malicious rumours."}, {"viet": "Sau tai nạn, ông ta đã đi lại được rồi.", "eng": "He's getting about again after his accident."}, {"viet": "Bác ấy không thực sự giận dữ đâu-bác chỉ sắm vai ông bố nghiêm khắc thôi.", "eng": "He's not really angry-he's just acting."}, {"viet": "Hiện giờ nó đang thất nghiệp và đã thất nghiệp hơn sáu tháng rồi.", "eng": "He's unemployed at the moment and has been for over six months."}, {"viet": "Anh ấy và người cộng tác không ưa gì nhau.", "eng": "He and his partner are at daggers drawn."}, {"viet": "Anh ta sợ tái mặt khi nhìn thấy con rắn.", "eng": "He blanched with fear at the sight of the snake."}, {"viet": "Anh ta có thể làm việc một mạch mà không cần giải lao.", "eng": "He can work on without a break."}, {"viet": "Hắn có thể làm được điều đó nếu hắn muốn.", "eng": "He could do it if he were so minded."}, {"viet": "Hắn nhìn như muốn nuốt lấy cô ta.", "eng": "He devoured her with his eyes."}, {"viet": "Nó không dành đủ thời gian chơi với những bạn cùng lứa tuổi.", "eng": "He doesn't spend enough time with his peers."}, {"viet": "Sống trong căn hộ nhỏ tí ấy anh ta cảm thấy bị tù túng.", "eng": "He feels boxed in, living in that tiny flat."}, {"viet": "Anh ta thấy khó mà thông cảm với một người mẹ của ba đứa con nhỏ đang có công ăn việc làm.", "eng": "He found it difficult to empathize with a working mother of three small children."}, {"viet": "Ông ta có nhiều lợi thế ban đầu trong việc kinh doanh.", "eng": "He got a good start in business."}, {"viet": "Anh đã bị cái cưa điện xén cụt cánh tay.", "eng": "He had his arm looped off by an electric saw."}, {"viet": "Anh ta có một thân hình cường tráng, nhưng chân thì lẻo khoẻo.", "eng": "He has a strong body, but rather thin legs."}, {"viet": "Anh ta chẳng lịch sự chút nào cả?", "eng": "He has no manners at all?"}, {"viet": "Cậu bé ngã va trán vào tường.", "eng": "He hit his forehead against the wall as he fell."}, {"viet": "Ông ấy thích sưu tầm tiền tệ của đất nước khác.", "eng": "He is fond of collecting currencies of different countries."}, {"viet": "Ông ta bị thất nghiệp và trước mắt chẳng có hy vọng nào.", "eng": "He is unemployed and has nothing in prospect at the moment."}, {"viet": "Ông ta tuôn ra một tràng những lời bào chữa cho hành vi của ông ấy.", "eng": "He launched into a long series of excuses for his behaviour."}, {"viet": "Anh ấy trông có vẻ đang hoàn toàn thất cơ lỡ vận.", "eng": "He looked completely down and out."}, {"viet": "Anh ta đã tìm cách nhảy ra khỏi chiếc xe hơi đang cháy.", "eng": "He managed to leap clear of the burning car."}, {"viet": "Hắn ăn cắp 5 bảng Anh của bạn hắn.", "eng": "He nicked £ 5 from his friend."}, {"viet": "Anh ta chơi bản sô nát soạn cho pianô do chính anh ta sáng tác.", "eng": "He played a piano sonata of his own composition."}, {"viet": "Ông ta ngắt quãng những nhận xét của mình bằng những cú đấm lên bàn.", "eng": "He punctuated his remarks with thumps on the table."}, {"viet": "Anh ta bị một cú đấm mạnh vào đầu.", "eng": "He received a severe blow on the head."}, {"viet": "Nó khinh thường mọi sự chống lại các ý kiến của nó.", "eng": "He rode roughshod over all opposition to his ideas."}, {"viet": "Thứ hai nào ông ta cũng cau có.", "eng": "He's always in a bad mood on Mondays."}, {"viet": "Anh ấy rất khéo tay về việc nhà.", "eng": "He's handy about the house."}, {"viet": "Anh ta đang trở về doanh trại của mình.", "eng": "He's returning to his army station."}, {"viet": "Anh ta ngồi xuống trong tiếng vỗ tay tán thưởng điếc tai.", "eng": "He sat down amid deafening applause."}, {"viet": "Nó có vẻ rất chân thành nhưng tất cả chỉ là giả vờ thôi.", "eng": "He seems very sincere, but it's all put on."}, {"viet": "Anh ta đóng sầm cửa để tỏ sự không đồng ý của mình.", "eng": "He slammed the door to registered his disapproval."}, {"viet": "Nó phết một ít mứt dâu lên bánh mì nướng của nó.", "eng": "He spreads some strawberry jam on his toast."}, {"viet": "Ông ấy chặt đứt những cành cây mục bằng một cái rìu.", "eng": "He struck off the rotten branches with an axe."}, {"viet": "Ông ta thề khi khai rằng ông ta đã không có mặt tại hiện trường của vụ án.", "eng": "He testified under oath that he had not been at the scene of the crime."}, {"viet": "Anh ta ăn quân tượng của tôi bằng quân hậu của anh ta.", "eng": "He took my bishop with his queen."}, {"viet": "Anh ta xoay lưng vào bức tường.", "eng": "He turned his back to the wall."}, {"viet": "Columbus đòi hỏi một phần mười số của cải mà ông mang về.", "eng": "He wanted a tenth of all the riches he brought back."}, {"viet": "Ông ta được chỉ định làm thẩm phán hoà giải của toàn đảo.", "eng": "He was appointed an all island Justice of the Peace."}, {"viet": "Anh ta hoàn toàn suy sụp về tinh thần sau tai nạn đó.", "eng": "He was completely haywire after the accident."}, {"viet": "Ông ta giận dữ nhưng lại tự kìm chế thái độ của mình.", "eng": "He was furious, but his manner was very restrained."}, {"viet": "Nó đang tìm người để buộc tội và tóm lấy tôi.", "eng": "He was looking for someone to blame and fastened on me."}, {"viet": "Nó đã bị mười năm tù vì tội ăn cướp có vũ khí.", "eng": "He was put away for ten years for armed robbery."}, {"viet": "Nó bị nghi ngờ là đồng loã trong vụ giết cô ta.", "eng": "He was suspected of complicity in her murder."}, {"viet": "Anh ta lo lắng vì tất cả những mối quan tâm của gia đình.", "eng": "He was worried by all the cares of the family."}, {"viet": "Ông ta sẽ bắt anh chịu những hậu quả không hay vì sự hỗn xược này.", "eng": "He will make you smart for this impudence."}, {"viet": "Anh làm hư hại nặng chiếc ôtô trên con đường bờ sông.", "eng": "He wracked the car up on the river road."}, {"viet": "Hãy giúp tôi giải quyết những khó khăn về tài chính.", "eng": "Help me to solve my financial troubles."}, {"viet": "Sự dồi dào về kinh nghiệm khiến cô ta trở thành người lý tưởng nhất để làm việc đó.", "eng": "Her breadth of experience makes her ideal for the job."}, {"viet": "Sự vắng mặt của cô ta đã tạo nên những lời đồn đại bừa bãi nhất.", "eng": "Her disappearance gave rise to the wildest rumours."}, {"viet": "Tiểu thuyết đầu tay của bà ta được xuất bản cách đây ba năm và từ đó bà ta tiếp tục thành công.", "eng": "Her first novel was published three years ago and since then she hasn't looked back."}, {"viet": "Bệnh tật đã khiến cô ta hoàn toàn không cử động được.", "eng": "Her illness has made her completely immobile."}, {"viet": "Đầu óc cô ấy đầy những giấc mơ được nổi tiếng.", "eng": "Her mind is full of dreams about becoming famous."}, {"viet": "Những thành tựu trong quá khứ của bà ta đã có ảnh hưởng thuận lợi cho bà ta trong tư cách ứng cử viên.", "eng": "Her past achievements weighed in her favour as a candidate."}, {"viet": "Những tiếng kêu la của cô ta đã lôi cuốn người qua đường đến hiện trường.", "eng": "Her screams drew passers-by to the scene."}, {"viet": "Thời giờ của cô ta được dành trọn vẹn cho ba đứa con.", "eng": "Her time is fully occupied with her three children."}, {"viet": "Đây là chương trình tivi nội bộ của khách sạn chúng tôi.", "eng": "Here is our in-house television schedule."}, {"viet": "Ham muốn của anh ấy là sánh với mẹ và trở thành nghị sĩ quốc hội.", "eng": "His ambition was to emulate his mother and become a member of Parliament."}, {"viet": "Ông chủ của anh ta đã yêu cầu anh ta giải thích tại sao đã không đúng hạn cuối cùng.", "eng": "His boss called him to account for failing to meet the deadline."}, {"viet": "Lòng dũng cảm của anh ấy đã mang lại danh tiếng cho trung đoàn của anh.", "eng": "His courage has brought great credit on his regiment."}, {"viet": "Đôi mắt anh ta trở nên mơ màng khi anh nghĩ về chị ấy.", "eng": "His eyes hazed over when he thought of her."}, {"viet": "Răng cửa của anh ta bị gẫy trong một cuộc ẩu đả.", "eng": "His front teeth were knocked out in a brawl."}, {"viet": "Cánh tay bị thương của nó đã được băng chặt.", "eng": "His injured arm was tightly strapped up."}, {"viet": "Đài kỉ niệm của ông ấy được khắc vào đá.", "eng": "His memorial was engraved on the stone."}, {"viet": "Cha mẹ anh ấy đã bỏ anh ấy coi như không dạy dỗ được.", "eng": "His parents have given him up as a bad job."}, {"viet": "Anh ta lái xe liều lĩnh đã gây tai nạn nghiêm trọng.", "eng": "His reckless driving caused a serious accident."}, {"viet": "Diễn văn của ông ta đầy lời hoa mĩ chẳng có nghĩa gì.", "eng": "His speech was full of fine words which meant nothing."}, {"viet": "Sự bén nhạy về một món hời của anh ta không thể ai được.", "eng": "His unerring good taste for a bargain."}, {"viet": "Tấn công quân địch lúc chúng không ngờ nhất.", "eng": "Hit the enemy when they least expect it."}, {"viet": "Xe ngựa kéo được xếp thành từng khối đều đặn.", "eng": "Horse-drawn chariots are arranged at regular intervals."}, {"viet": "Làm sao con có thể nói với cô ấy là con không có ở đây được?", "eng": "How can I tell her I'm not here?"}, {"viet": "Cháu đã nghĩ ông sẽ như thế nào?", "eng": "How did you think I'd be?"}, {"viet": "Cơ quan của bạn cách nhà bạn bao xa?", "eng": "How far is your office from your home?"}, {"viet": "Tôi nên mua bao nhiêu hộp sô-cô-la?", "eng": "How many boxes of chocolate should I buy?"}, {"viet": "Trong nhà bạn có mấy cái điện thoại?", "eng": "How many telephones do you have in your house?"}, {"viet": "Gửi bức thư này đi Luân Đôn sẽ tốn bao nhiêu?", "eng": "How much will it cost to send this letter to London?"}, {"viet": "Hãy ngân nga nho nhỏ vài nhịp dạo đầu của điệu nhạc mà bạn ưa thích.", "eng": "Hum the opening bars of your favourite tune."}, {"viet": "Tôi muốn được trút bỏ trách nhiệm này.", "eng": "I'd like to be quit of the responsibility."}, {"viet": "Bố cũng sẽ giảm việc đi chơi và ăn nhậu.", "eng": "I'll also cut down on going out and drinking."}, {"viet": "Tôi e rằng phải đi thôi-nhiệm vụ mà.", "eng": "I'll have to go, I'm afraid-duty calls."}, {"viet": "Tôi sẽ chỉ dẫn cách làm cho bạn một lần nữa.", "eng": "I'll tell you how to do it once again."}, {"viet": "Tôi đang mụ người vì lo lắng không biết làm cách nào để thanh toán các hóa đơn.", "eng": "I'm at my wits'end worrying about how to pay the bills."}, {"viet": "Tôi sẽ học cách làm trò ảo thuật.", "eng": "I'm going to learn how to do magic tricks."}, {"viet": "Tôi không phản đối việc uống tí whisky sau bữa ăn tối.", "eng": "I'm not averse to a drop of whisky after dinner."}, {"viet": "Tôi đang tạm ở với anh họ của tôi cho tới khi tôi tìm được một chỗ riêng của mình.", "eng": "I'm shacking up with my cousin till I find a place of my own."}, {"viet": "Tôi chắc rằng cô ấy chỉ giả vờ ốm để người ta thông cảm, thành thật mà nói Sue ạ, cô thật là người ác ý.", "eng": "I'm sure she's only pretending to be ill to get people's sympathy, honestly, Sue, you're such a cynic."}, {"viet": "Tôi đang hoàn chỉnh các ghi chép của tôi để viết thành một bài nghị luận.", "eng": "I'm working my notes up into a dissertation."}, {"viet": "Tôi đã ( liên tục ) làm việc ( với bài luận văn của tôi ) suốt ngày.", "eng": "I've been working ( away ) ( at my essay ) all day."}, {"viet": "Tôi đã nghe tất cả những câu chuyện của anh ta trước đây rồi: chúng làm tôi phát ngán.", "eng": "I've heard all his stories before: they bore me."}, {"viet": "Tôi đã tìm khắp mọi ngóc ngách mà vẫn không thể thấy chùm chìa khoá.", "eng": "I've searched every nook and cranny but I still can't find the keys."}, {"viet": "Tôi cũng nghĩ là chúng ta có thể gửi điện tín ra nước ngoài ở đây.", "eng": "I also thought we could send overseas cables from here."}, {"viet": "Tôi không phải là người thán phục công việc của bà ta.", "eng": "I am not a great admirer of her work."}, {"viet": "Tôi hỏi cô ta xem cô ta có muốn đến không và cô đã gật đầu.", "eng": "I asked her if she wanted to come and she nodded."}, {"viet": "Tôi đã mua cái đó qua lời giới thiệu của anh?", "eng": "I bought it on your recommendation?"}, {"viet": "Tôi không tìm thấy giấy tờ''Ồ, cứ tìm đi!'.", "eng": "I can't find the papers''Well, keep looking!'."}, {"viet": "Tôi không thể nói sao cho ông biết rằng điều này có ý nghĩa đối với tôi biết bao.", "eng": "I can't tell you how much this means to me."}, {"viet": "Tôi có thể thừa biết cái trò nhỏ mọn của anh.", "eng": "I can see through your little game."}, {"viet": "Tôi không nghĩ ra được ai đã gọi điện cho bạn hôm nay.", "eng": "I can't think who called for you today."}, {"viet": "Tôi không tài nào làm cho chiếc xe ô-tô nổ máy vào sáng này.", "eng": "I couldn't get the car started this morning."}, {"viet": "Tôi muốn gửi bưu kiện này tới Nhật.", "eng": "I'd like to send this parcel to Japan."}, {"viet": "Tôi không thấy nhiều căn nhà dưới giá 50.000 bảng Anh.", "eng": "I didn't see many houses under £ 50,000."}, {"viet": "Tôi không muốn nghe điều vớ vẩn này thêm tí nào nữa!", "eng": "I don't intend to listen to this rubbish any longer!"}, {"viet": "Anh thỉnh thoảng hút thuốc không làm phiền gì tôi đâu, cần gì phải lén lén lút lút như vậy!", "eng": "I don't mind you smoking occasionally-there's no need to be so surreptitious about it!"}, {"viet": "Tôi không muốn dính líu vào chuyện này.", "eng": "I don't want to be mixed up in the affair."}, {"viet": "Tôi không thích kiểu cắt bộ comlê mới của ông ấy.", "eng": "I don't like the cut of his new suit."}, {"viet": "Tôi đã giải thích vấn đề cho nó nhiều lần nhưng hình như nó không thấu hiểu.", "eng": "I explained the problem to him several times but it didn't seem to penetrate."}, {"viet": "Tôi nghĩ rằng không nên làm gì hết.", "eng": "I felt it advisable to do nothing."}, {"viet": "Tôi sẵn sàng thừa nhận là đã phạm một sai lầm.", "eng": "I freely admit that I made a mistake."}, {"viet": "Tôi có cảm tưởng là ông ấy chán công việc của mình.", "eng": "I got the impression that he was bored with his job."}, {"viet": "Tôi rất ngờ ở sự thành công của dự án và tôi đã được chứng minh là đúng với sự thất bại của nó.", "eng": "I had much misgiving on the success of the project, and have been proved correct with its failure."}, {"viet": "Hôm nay tôi ăn rất ngon miệng.", "eng": "I have a big appetite today."}, {"viet": "Tôi không có quyền lựa chọn nào khác hơn là phải ra đi.", "eng": "I have little option but to go."}, {"viet": "Tôi phải ra tòa vì tội lái xe trong khi say rượu.", "eng": "I have to appear in court on a charge of drunken driving."}, {"viet": "Tôi chẳng có chỗ nào để ở.", "eng": "I haven't anywhere to stay."}, {"viet": "Tôi đã thuê một người đến sửa lò sưởi, nhưng anh ta không đến.", "eng": "I hired someone to fix the fireplace, but he never showed up."}, {"viet": "Tôi hy vọng ông sẽ thích nó.", "eng": "I hope you will like it."}, {"viet": "Tôi biết, nhưng chẳng có gì cả, chúng ta chẳng thể làm gì để thay đổi.", "eng": "I know, but there's nothing we can do about it."}, {"viet": "Tôi thích mèo nhưng ghét chó.", "eng": "I like cats but dislike dogs."}, {"viet": "Tôi sẽ lưu lại đây hai tuần.", "eng": "I'll be here for two weeks."}, {"viet": "Anh yêu em cho đến ngày giã từ cuộc đời.", "eng": "I'll love you to my dying day."}, {"viet": "Tôi đích thực là gái quê.", "eng": "I'm a country girl at heart."}, {"viet": "Tôi sắp yết kiến Thủ tướng.", "eng": "I'm going to meet the Prime Minister."}, {"viet": "Tôi có 500 bảng Anh rút trội ở ngân hàng.", "eng": "I'm overdrawn by £ 500."}, {"viet": "Tôi pha cho mình một tách trà.", "eng": "I made myself a cup of tea."}, {"viet": "Tôi phải hoàn tất chiếc áo tôi đang may, tôi vừa khâu những mũi cuối.", "eng": "I must finish this dress I'm making, i'm just giving it the last finishing touches."}, {"viet": "Tôi cần tham khảo từ điển.", "eng": "I need to consult a dictionary."}, {"viet": "Tôi chỉ có khoảng 50 cuốn sách, tôi muốn mua thêm nhưng trên kệ sách của tôi không còn nhiều chỗ trống.", "eng": "I only have about 50 books, I would like to get more but I don't have much space left on my bookshelf."}, {"viet": "Tôi đã phản đối, thế nhưng cô ta cứ tiếp tục không thèm để ý tới.", "eng": "I protested, but she carried on regardless."}, {"viet": "Tôi cho ( là ) ông ta quá già so với công việc Giá cả được coi là đắt.", "eng": "I reckon ( that ) he is too old for the job The price was reckoned high."}, {"viet": "Tôi chỉ nói là tôi sẽ làm điều đó, và trời ơi, tôi làm thiệt!", "eng": "I said I'd do it and, by gosh, I did!"}, {"viet": "Tôi thực sự nghi ngờ một số điều khẳng định của anh.", "eng": "I seriously question a number of your assertions."}, {"viet": "Tôi ngủ ở phòng này còn em trai tôi ở phòng khác.", "eng": "I sleep in this room, and my brother sleep in the other room."}, {"viet": "Tôi tập trung hết can đảm để xin cầu hôn với cô ấy.", "eng": "I summoned up my courage and asked her to marry me."}, {"viet": "Tôi nghĩ rằng tôi đã gặp hắn trước đây, nhưng tôi không dám khẳng định là đúng.", "eng": "I think I've met him before, but I wouldn't swear to it."}, {"viet": "Về vấn đề này, tôi cũng nghĩ như anh.", "eng": "I think the same as you do about the matter."}, {"viet": "Tôi doạ sẽ phơi bày họ trước công chúng.", "eng": "I threatened them with public exposure."}, {"viet": "Tôi cố tránh cái hố đó trên đường và đụng xe này.", "eng": "I try to miss that hole in the road and hit this car."}, {"viet": "Tôi đề nghị là chúng ta ở lại đây.", "eng": "I vote that we stay here."}, {"viet": "Tôi muốn thuê nhà ở trong một tuần.", "eng": "I want to rent a fiat for a week."}, {"viet": "Tôi sinh ra ở miền Đông, nhưng nay tôi sống ở Los Angeles.", "eng": "I was born in the East, but now live in Los Angeles."}, {"viet": "Chính tôi cũng vừa tự hỏi về điều đó.", "eng": "I was just wondering about that myself."}, {"viet": "Tôi ngạc nhiên vì nhiệt tình làm việc của họ.", "eng": "I was struck by their enthusiasm for work."}, {"viet": "Tối qua tôi đi xem phim với Denise.", "eng": "I went to the cinema with Denise last night."}, {"viet": "Tôi xin cám ơn ông về sự chào đón nồng nhiệt trong chuyến đến thăm Trung Quốc lần đầu của tôi.", "eng": "I wish to thank you for your warm welcome on my first visit in China."}, {"viet": "Anh không biết tại sao trước đây bọn anh lại thích ăn kẹo như thế?", "eng": "I wonder why we used to like sweets that much?"}, {"viet": "Tôi muốn đi đến đại lộ số.", "eng": "I would like to go to Fifth Avenue."}, {"viet": "Lẽ ra tôi không nên khuyên anh đi đến đó một mình.", "eng": "I wouldn't recommend you to go there alone."}, {"viet": "Ví thử nó đã đọc một trong số sách kia thì nó ắt biết câu trả lời.", "eng": "If he had read any of those books he would have known the answer."}, {"viet": "Nếu bố tôi biết chúng tôi lấy xe của ông ấy thì chúng tôi gặp rắc rối to.", "eng": "If my dad finds out we took his car, we're screwed."}, {"viet": "Nếu họ dùng thuốc tê, con sẽ không thấy gì cả.", "eng": "If they use anesthesia, you won't feel anything."}, {"viet": "Nếu anh thô lỗ với anh ấy, anh nghĩ sẽ nhận lại cái gì?", "eng": "If you are rude to him, what did you expect to get back?"}, {"viet": "Mày sẽ phải hối tiếc nếu dám gọi tao bằng cái tên ấy một lần nữa.", "eng": "If you ever dare call me that name again, you'll be sorry."}, {"viet": "Nếu anh hét to, anh sẽ nghe thấy tiếng vang lại.", "eng": "If you shout loudly, you'll hear the echo."}, {"viet": "Hãy tưởng tượng sự kinh ngạc của tôi khi Peter bước vào!", "eng": "Imagine my astonishment when Peter walked in!"}, {"viet": "Trong công việc kinh doanh, bảo hiểm, máy tính, nghề làm báo, v. v.", "eng": "In business, insurance, computers, journalism, etc."}, {"viet": "Trong if this be treason, be ở giả định cách.", "eng": "In if this be treason be is the subjunctive."}, {"viet": "Mặc dù ít tuổi nhất, nhưng cô ấy là đứa bé thông minh nhất lớp.", "eng": "In spite of being the youngest, she was the cleverest child in the class."}, {"viet": "Trong câu'if I were you','were'là thuộc thể giả định.", "eng": "In the phrase'if I were you','were'is subjunctive."}, {"viet": "Ở nước bạn, bao nhiêu phần trăm dân số hút thuốc?", "eng": "In your country, what percentage of the population smokes?"}, {"viet": "Việc đi lại quả là khó khăn khi bạn bị vướng víu bởi hai đứa trẻ nhỏ và một chiếc vali nặng.", "eng": "Is difficult when you're encumbered with two small children and a heavy suitcase."}, {"viet": "Phim màu hay đen trắng?", "eng": "Is the film in colour or black and white?"}, {"viet": "Phát triển nông nghiệp ở một vùng sa mạc liệu có thực hiện được không?", "eng": "Is this practicable to try to develop agriculture in desert regions?"}, {"viet": "Thật may là bà ta đã không bị thương trong tai nạn.", "eng": "It's a mercy she wasn't hurt in the accident."}, {"viet": "Công việc đó còn tốt hơn là pha trà và rửa tách.", "eng": "It's better than making tea and washing tea cups."}, {"viet": "Thật khó có thể biết chính xác phải làm gì-chúng ta đành phải cầu may thôi.", "eng": "It's hard to know exactly what to do-we'll just have to take a shot in the dark."}, {"viet": "Ước ao những cái mà anh không thể có thật vô ích.", "eng": "It's no use wishing for things you can't have."}, {"viet": "Nói không thích món ăn đó là thô lỗ.", "eng": "It's rude to say you don't like the food."}, {"viet": "Thật là kém thông minh khi đi ra ngoài trong thời tiết lạnh như thế này.", "eng": "It's unwise to go out in this cold weather."}, {"viet": "Thấy con cái vui chơi thích thú, tôi thật hởi lòng hởi dạ.", "eng": "It does my heart good to see the children enjoying themselves."}, {"viet": "Có tin là cậu ấy đã bị bắt.", "eng": "It is being noised abroad that he has been arrested."}, {"viet": "Giải quyết việc thải người làm không phải là nhiệm vụ của uỷ ban này.", "eng": "It is not the function of this committee to deal with dismissal."}, {"viet": "Có vẻ như trời sẽ mưa bất cứ lúc nào.", "eng": "It looks like it's going to start any minute."}, {"viet": "Nó khoảng một phút đi bộ.", "eng": "It's about a minute walk."}, {"viet": "Điều quan trọng là bạn phải có mặt ở đó.", "eng": "It's very important that you be there."}, {"viet": "Khi nghe nói anh ốm chúng tôi mất hết cả vui thú trong dịp lễ.", "eng": "It took all the fun of the occasion when we heard that you were ill."}, {"viet": "Rõ ràng là tất cả họ đều đã hiểu.", "eng": "It was apparent that they an understood."}, {"viet": "Đây là một tình huống đáng sợ khiến ađrênalin chảy mạnh.", "eng": "It was one of those scary situations that really gets the adrenalin going."}, {"viet": "Chỉ đơn độc một người thôi thì sẽ khó khăn lắm.", "eng": "It will be difficult for one person alone."}, {"viet": "Jack không mặc vừa chiếc áo khoác vì thế tôi cần mua cho nó 1 cái to hơn.", "eng": "Jack outgrows his coat so i need to buy him a bigger one."}, {"viet": "John đã thuê năm người, nhưng một người vắng mặt.", "eng": "John hired five, but one was a no-show."}, {"viet": "Đó chính là điều mà nữ nghệ sĩ muốn nói trong tác phẩm của bà ta phải không?", "eng": "Just what is the artist trying to say in her work?"}, {"viet": "Làm luật chống lại sự phân biệt chủng tộc.", "eng": "Legislate against racial discrimination."}, {"viet": "Chúng ta hãy đi chơi gôn đi.", "eng": "Let's go to play golf."}, {"viet": "Nhiều người da đen đã di cư sang Anh vào những năm 50.", "eng": "Many black people emigrated to Britain in the 1950's."}, {"viet": "Gần đây, nhiều cơ sở kinh doanh nhỏ đã phá sản.", "eng": "Many small businesses have gone bankrupt recently."}, {"viet": "Tôi có thể hỏi họ về công việc của họ được không?", "eng": "May I ask them about their work?"}, {"viet": "Có lẽ tôi nên bạo dạn hơn.", "eng": "Maybe I should be more daring."}, {"viet": "Phần lớn những người trong gia đình tôi là nhạc sĩ: nó có sẵn dòng máu ấy.", "eng": "Most of my family are musicians: it runs in the blood."}, {"viet": "Bà Murphy được ơn phước có đến 12 đứa con.", "eng": "Mrs. Murphy is blessed with twelve children."}, {"viet": "Điện thoại di động của tôi có ích nếu ai đó cần nói chuyện với tôi.", "eng": "My cellular phone comes in handy if someone needs to talk to me."}, {"viet": "Ông tôi vẫn cứ nói đi nói lại mãi về bệnh tật của ông trước chiến tranh.", "eng": "My grandfather still harps on his prewar illness."}, {"viet": "Ba mẹ cháu nhờ cháu gởi lời chào hai bác.", "eng": "My parents asked me to say Hello."}, {"viet": "Vợ tôi muốn nhà bếp phải được quét vôi trắng, và ý của bà phải được thực hiện.", "eng": "My wife wants the kitchen painted white, and what she says goes."}, {"viet": "Các bài báo đã lan truyền vụ bê bối này.", "eng": "Newspaper stories gave currency to this scandal."}, {"viet": "Không, chúng tôi chỉ xử lý việc thư tín thôi.", "eng": "No, we only deal with the postal business."}, {"viet": "Cô ta không hé môi của cô ấy nói một lời nào cả.", "eng": "Not a word passed her lips."}, {"viet": "Con ngựa số 18 trong cuộc đua 2.30 tại Lingfield không tham dự đua.", "eng": "Number 18 in the 2.30 at Lingfield is a non-starter."}, {"viet": "Ồ, đó là Vi Đà-Hộ pháp đạo phật.", "eng": "Oh, that's Wei Tuo-the Guard of Buddhism."}, {"viet": "Trên các bản đồ, chữ thập là ký hiệu về một nhà thờ.", "eng": "On maps, a cross is the symbol for a church."}, {"viet": "Trong mười người có một người nói rằng họ chuộng loại mỡ thực vật nhãn hiệu cũ hơn.", "eng": "One in ten said they preferred their old brand of margarine."}, {"viet": "Mở cửa ra! viên cảnh sát quát lên.", "eng": "Open up! shouted the police officer."}, {"viet": "Cuộc nhảy dù lần đầu tiên của chúng tôi là một kinh nghiệm rất phấn chấn.", "eng": "Our first parachute jump was an exhilarating experience."}, {"viet": "Cuộc chiến tranh cách mạng của chúng tôi hầu như đã chết trong khi đang thành hình vì thiếu sự ủng hộ của quần chúng.", "eng": "Our own revolutionary war almost died aborning through lack of popular support."}, {"viet": "Sửa chữa, đo lường bên ngoài, vẻ ngoài.", "eng": "Outside repairs, measurements, appearance."}, {"viet": "Sự ngạo mạn, tính hiếu kỳ, vẻ đẹp quí tộc.", "eng": "Patrician arrogance, haughtiness, good looks."}, {"viet": "Những người lái xe khi đang say rượu cần phải bị phạt thật nặng.", "eng": "People who drive when they are drunk should be heavily penalized."}, {"viet": "Vui lòng chỉ cho cháu cách đi tới trạm xe buýt.", "eng": "Please tell me how to get to the bus stop."}, {"viet": "Gần đây, một số danh mục đặt hàng qua thư điện tử có rất nhiều mặt hàng.", "eng": "Recently, some of the mail order catalogs have a good selection."}, {"viet": "Có thấy những người lớn tuổi đứng ở trước không?", "eng": "See the older people in front?"}, {"viet": "Nàng có nhiều vấn đề phải đối phó.", "eng": "She'd had a lot of problems to contend with."}, {"viet": "Cô ta là một nữ ca sĩ rất độc đáo, cô ấy có thể diễn tuyệt vời!", "eng": "She's an opera singer with a difference, She can act well!"}, {"viet": "Cô ta thật là rất sung sức-dường như không bao giờ cô ta tỏ vẻ mệt mỏi.", "eng": "She's got so much energy-she never seems to tire."}, {"viet": "Cô ta làm điều đó chỉ vì lòng tốt-không hề có một động cơ cá nhân nào cả.", "eng": "She's only doing it out of kindness-She's got no axe to grind."}, {"viet": "Cô ấy đan rất khéo tay.", "eng": "She's very dextrous with the knitting needles."}, {"viet": "Bà ta đến sớm để có được chỗ ngồi tốt.", "eng": "She arrived early in order to get a good seat."}, {"viet": "Không thể tin cô ấy lại nói sự thật.", "eng": "She cannot be relied on to tell the truth."}, {"viet": "Cô ấy phê bình mẹ vì can thiệp quá sâu vào đời tư của cô ấy.", "eng": "She criticized her mother for meddling in her personal life."}, {"viet": "Cô ấy nổi bật vì tính trầm tĩnh và lòng can đảm của mình.", "eng": "She distinguished herself by her coolness and bravery."}, {"viet": "Cô ấy cảm thấy mình bị anh ta hấp dẫn ngay từ đầu.", "eng": "She felt an immediate attraction to him."}, {"viet": "Cô ta đập đập nhẹ vào cái nắp để cho nó lỏng ra.", "eng": "She gave the lid a few gentle taps to loosen it."}, {"viet": "Cô ta đã ăn cắp những khoản tiền tiêu vặt ở quỹ trong nhiều tháng.", "eng": "She had been pilfering from the petty cash for months."}, {"viet": "Cô ấy có đầy đủ cơ sở để ly hôn.", "eng": "She has adequate grounds for a divorce."}, {"viet": "Tội nghiệp người phụ nữ đó, bà ta chẳng có gì mấy để mà vui cười cả.", "eng": "She hasn't got much to laugh about, poor woman."}, {"viet": "Bà ta bám chặt vào những quan điểm cánh hữu của bà.", "eng": "She is entrenched in her right-wing views."}, {"viet": "Cô ta rút ví ra trả ngay một nghìn tiền mặt, thật là một con người ngông nghênh!", "eng": "She just took out her purse and paid a thousand in cash What a cool customer!"}, {"viet": "Cô ta sẽ chẳng bao giờ chiếm được một chỗ trong đội đó.", "eng": "She'll never make the team."}, {"viet": "Cô ấy đã vận động để các bạn bè của mình được vào các vị trí quyền lực.", "eng": "She manoeuvred her friends into positions of power."}, {"viet": "Bà ta đã trả người bán 82000 pao lấy cái xe này.", "eng": "She paid a dealer 82000 pounds for that car."}, {"viet": "Cô ta đút nhanh mảnh giấy vào túi mà không đọc.", "eng": "She quickly pocketed the note without reading it."}, {"viet": "Bà ta là một người quí tộc chính gốc.", "eng": "She's a peeress in her own right."}, {"viet": "Cô ấy rất ham mê môn khúc côn cầu.", "eng": "She's mad keen on hockey."}, {"viet": "Bà ta ngồi lắng nghe, đầu hơi nghiêng sang một bên.", "eng": "She sat listening, with her head tilted slightly to one side."}, {"viet": "Cô ta rất mưu mẹo trong cách né tránh trả lời câu hỏi.", "eng": "She showed considerable cunning in the way she avoided answering the question."}, {"viet": "Cô ấy nói về sự mất mát gần đây của chúng tôi rất tế nhị.", "eng": "She spoke with delicacy of our recent loss."}, {"viet": "Cô ta nhại bà Thủ tướng cứ y như thật.", "eng": "She takes off the Prime Minister to perfection."}, {"viet": "Cô ấy cố gắng giãy anh ta ra nhưng anh vẫn tiếp tục quấy rầy cô.", "eng": "She tried to shake him off but he continued to pester her."}, {"viet": "Cô ta đòi đi vé hạng nhất: hẳn là cô ta mắc chứng hoang tưởng tự đại.", "eng": "She wants to travel first-class: she must have delusions of grandeur."}, {"viet": "Chị ấy đang cắp một quyển sách dưới cánh tay.", "eng": "She was carrying a book under her arm."}, {"viet": "Cô ta đã được đền bù hậu hỉ cho những nỗ lực của mình.", "eng": "She was handsomely rewarded for her efforts."}, {"viet": "Cô ta quá vui sướng khi nghe tin cháu bé mới sinh.", "eng": "She was overjoyed to hear about the arrival of the baby."}, {"viet": "Cô ta là người quá đoan trang đến nỗi bị bẽn lẽn ngay cả khi nhìn thấy trẻ con trần truồng.", "eng": "She was such a prude that she was even embarrassed by the sight of naked children."}, {"viet": "Cô ấy không cùng kiểu người với John.", "eng": "She wasn't John's type."}, {"viet": "Cô ta sẽ không kéo dài được lâu trong công việc này-hắc búa quá.", "eng": "She won't last long in that job-it's too tough."}, {"viet": "Cô ấy khao khát trở về quê hương của cô ấy.", "eng": "She yearned to return to her native country."}, {"viet": "Run sợ khi nhìn thấy máu.", "eng": "Shudder with horror at the sight of blood."}, {"viet": "Hãng hàng không Singapore có danh tiếng về việc phục vụ chu đáo.", "eng": "Singapore airlines has a good reputation for good service."}, {"viet": "Những doanh nghiệp nhỏ cỡ gia đình thường bị các công ty lớn nuốt chửng.", "eng": "Small family businesses are often gobbled up by larger firms."}, {"viet": "Vậy thì tôi đến đó lúc 7 giờ.", "eng": "So I get there at seven o'clock."}, {"viet": "Những người lính kết thân với kẻ địch sẽ bị trừng phạt.", "eng": "Soldiers who fraternize with the enemy will be punished."}, {"viet": "Một số đứa trẻ thì da trắng, còn đứa khác thì da đen.", "eng": "Some of the children were white, the others were black."}, {"viet": "Một vài quốc gia yêu cầu lùi những giấy tờ thuộc luật pháp lên ngày thứ bảy nếu chúng được ký vào chủ nhật.", "eng": "Some states require a person to antedate legal papers to Saturday if they are signed on Sunday."}, {"viet": "Đôi khi bạn phải đụng vào đầu người ta thì mới làm cho họ chú ý.", "eng": "Sometimes you have to hit people upside the head to get their attention."}, {"viet": "Lỗi chính tả được khoanh bằng mực đỏ.", "eng": "Spelling mistakes circled in red ink."}, {"viet": "Hãy ở trong bóng râm-như vậy mát hơn.", "eng": "Stay in the shade-it's cooler."}, {"viet": "Thôi, đừng có đùa giỡn với tình cảm của cô ta nữa.", "eng": "Stop playing fast and loose with that girl's feelings."}, {"viet": "Thêm phần tái bút vào cuối một bức thư.", "eng": "Subjoin a postscript to a letter."}, {"viet": "Bất thình lình cành cây mà hắn đang đứng gẫy rắc một cái.", "eng": "Suddenly the branch that he was standing one snapped off."}, {"viet": "Quan sát tổng quát những đám đông từ một ban công.", "eng": "Surveying the crowds from a balcony."}, {"viet": "Hãy uống aspirin để bạn hết nhức đầu.", "eng": "Take some aspirin for your headache."}, {"viet": "Nước mắt trào dâng trong đôi mắt cô ta.", "eng": "Tears welled up in her eyes."}, {"viet": "Cám ơn, nhưng tôi nghĩ tôi sẽ không cần bất thứ cái gì.", "eng": "Thank you, but I don't think I will need anything."}, {"viet": "Đó là loại rượu vang ngon nhất mà tôi từng được uống.", "eng": "That's the best wine I've ever tasted."}, {"viet": "Con chó đó tận tụy với chủ.", "eng": "That dog is devoted to his master."}, {"viet": "Gã đó là một con quái vật tàn ác!", "eng": "That man is an inhuman monster!"}, {"viet": "Đó đúng là điều tôi mong đợi.", "eng": "That's exactly what I expected."}, {"viet": "Đó là một sự trùng hợp thật kỳ quái.", "eng": "That was a really creepy coincidence."}, {"viet": "Vụ tai nạn xảy ra đêm thứ bảy.", "eng": "The accident took place on Saturday night."}, {"viet": "Chiếc máy bay chao đảo trong bầu trời bão táp.", "eng": "The aeroplane was tossed in the stormy sky."}, {"viet": "Những khúc nhạc thần tiên của ca đoàn nam hát.", "eng": "The angelic strains of choirboys singing."}, {"viet": "Phong cách kiến trúc của thế kỷ thứ mười tám.", "eng": "The architecture of the eighteenth century."}, {"viet": "Người đồng chủ nhiệm một bộ phim.", "eng": "The associate producer of a film."}, {"viet": "Lượng tuyết rơi trung bình ở đây là 10cm một năm.", "eng": "The average snowfall here is 10cm a year."}, {"viet": "Nữ diễn viên múa ba-lê khẽ cúi chào khán giả trước khi rời sân khấu.", "eng": "The ballerina bobbed a curtsy to the audience before leaving the stage."}, {"viet": "Trận đánh này cuối cùng đã dẫn đến việc kết thúc chiến tranh.", "eng": "The battle finally brought the war to an end."}, {"viet": "Tội ác càng nghiêm trọng, càng ở tù lâu hơn.", "eng": "The bigger the crime, the longer the goal sentence."}, {"viet": "Ban giám hiệu của một nhà trường, đại học, ban giám đốc bệnh viện, v. v.", "eng": "The board of governors of a school, college, hospital, etc."}, {"viet": "Quyển sách nêu ra nhiều vấn đề quan trọng để chúng ta suy nghĩ.", "eng": "The book raises many important issues for our consideration."}, {"viet": "Thằng bé ấy bị đánh đòn tàn bạo vì tội ăn cắp.", "eng": "The boy was cruelly flogged for stealing."}, {"viet": "Hệ thống chuyển tiền trực tiếp của Bưu cục Anh quốc được gọi là hệ thống chuyển tiền trực tiếp quốc gia.", "eng": "The British Post Office giro system is called the National Girobank."}, {"viet": "Xe buýt dừng lại để lấy thêm hành khách.", "eng": "The bus stopped to take on more passengers."}, {"viet": "Những đội trưởng của những đội thi đấu.", "eng": "The captains of the contending teams."}, {"viet": "Đột nhiên chiếc ôtô chạy lệch hướng ra khỏi đường.", "eng": "The car suddenly veered off the road."}, {"viet": "Con mèo nôn ra tấm thảm.", "eng": "The cat's been sick on the carpet."}, {"viet": "Việc thay đổi lãnh tụ đã dẫn đến sự thay đổi hoàn toàn may mắn cho Công Đảng.", "eng": "The change of leader led to a turn-around in the fortunes of the Labour Party."}, {"viet": "Cậu bé đó hơi dễ bị tai nạn.", "eng": "The child is rather accident-prone."}, {"viet": "Lũ trẻ quẩn chân tôi suốt ngày.", "eng": "The children are under my feet all day."}, {"viet": "Đám trẻ con chăm chú nhìn nhà ảo thuật với vẻ thán phục thầm lặng.", "eng": "The children watched the conjuror in silent wonder."}, {"viet": "Chu vi các tường bao quanh thành phố dài ba dặm.", "eng": "The circuit of the city walls is three miles."}, {"viet": "Ngày hết hạn nộp đơn là ngày 1 tháng Năm.", "eng": "The closing day for applications is 1 May."}, {"viet": "Trường đại học đó mở nhiều khóa học về các ngành nghề khác nhau.", "eng": "The college offers courses in a variety of trades."}, {"viet": "Công ty thông báo những chuyến tàu hàng tuần đến Ấn Độ.", "eng": "The company announces weekly sailing to India."}, {"viet": "Những lời phàn nàn cho thấy những công ty này giải quyết vấn đề đó không nghĩ đến tình cảm của người khác.", "eng": "The complaints show these companies have been treating the issue a cavalier way."}, {"viet": "Nội dung của cái hộp phải phù hợp với sự miêu tả của nhãn.", "eng": "The contents of the box must correspond to the description of the label."}, {"viet": "Nền kinh tế của đất nước đang đứng trên bờ vực thẳm.", "eng": "The country's economy was on the edge of the precipice."}, {"viet": "Toà phán quyết hành động này là bất hợp pháp.", "eng": "The court ruled the action to be illegal."}, {"viet": "Đám đông nối tay nhau tạo thành một hàng rào.", "eng": "The crowd linked arms to form a barrier."}, {"viet": "Vết đứt ở tay tôi cần phải khâu năm mũi.", "eng": "The cut in my hand needed five stitches."}, {"viet": "Quyết định tiến hành hay không là trách nhiệm của ông Bộ trưởng.", "eng": "The decision on whether to proceed lies with the Minister."}, {"viet": "Sự mô tả là chính xác trong từng chi tiết.", "eng": "The description is correct in every detail."}, {"viet": "Cuốn danh bạ để bên cạnh cái điện thoại, ông sẽ tìm thấy số điện thoại và thông tin về dịch vụ phục vụ văn phòng, dịch vụ giặt ủi, các nhà hàng và các quán cà phê của chúng tôi.", "eng": "The directory is next to your telephone and you'll find telephone numbers and information about Room Service, Laundry Service, our restaurants and coffee bars."}, {"viet": "Bác sĩ không nghĩ rằng tôi bị gãy một cái xương, nhưng ông ta đang đợi xem hình chụp tia X đã.", "eng": "The doctor doesn't think I've broken a bone but he's waiting to see the X-rays."}, {"viet": "Con chó thu mình khi thấy cái roi.", "eng": "The dog cringed at the sight of the whip."}, {"viet": "Thật là tồi tệ, vừa thêm thuế vừa giá cao.", "eng": "The double whammy of more taxes and higher prices."}, {"viet": "Người ta thấy con vật đang hấp hối sùi bọt mép.", "eng": "The dying animal was found foaming at the mouth."}, {"viet": "Toàn bộ cử tri dần dần trở nên mệt mỏi với những lời lẽ giả tạo của ông ta.", "eng": "The electorate is growing tired of his posturing."}, {"viet": "Tầm vóc lớn lao của công việc nuôi ăn cho tất cả nạn nhân đói kém.", "eng": "The enormity of the task of feeding all the famine victims."}, {"viet": "Sự đào bới thành phố bị chôn vùi mất một thời gian dài.", "eng": "The excavation of the buried city took a long time."}, {"viet": "Anh ta đỏ bừng mặt mỗi lần anh nhắc đến tên cô ấy là sự để lộ rõ ràng.", "eng": "The fact that he blushed whenever you mention her name is a dead give-away."}, {"viet": "Nhân danh cha, con và thánh thần.", "eng": "The father, the son, and the Holy spirit."}, {"viet": "Bộ phim đã làm cho tất cả chúng tôi phải ngồi trườn ra tận mép ghế vì say sưa.", "eng": "The film has us all sitting on the edges of our seats with excitement."}, {"viet": "Sổ sách kế toán của công ty cần được sắp xếp lại cho có ngăn nắp.", "eng": "The firm's accounts need to be set in order."}, {"viet": "Các nhà chế tạo gốm đầu tiên phần lớn chỉ quan tâm đến việc chế tạo đồ gốm hữu dụng.", "eng": "The first potters were interested mostly in making their pottery useful."}, {"viet": "Sương mù bắt máy bay nằm ở sân bay N.", "eng": "The fog grounded the plane at N aerodrome."}, {"viet": "Tự do báo chí cần phải được bảo vệ.", "eng": "The freedom of the press must be protected."}, {"viet": "Tên cướp đã ẩn náu ở một chỗ nào đó trên núi.", "eng": "The gang was holed up in the mountains somewhere."}, {"viet": "Hồn ma của phu nhân Margaret được cho là hay lui tới nhà nguyện này.", "eng": "The ghost of lady Margaret is supposed to haunt this chapel."}, {"viet": "Quyết định của chính phủ thực là một hành động bất ngờ cho các công đoàn.", "eng": "The Government's decision is a real kick in the teeth for the unions."}, {"viet": "Chính phủ đã trì hoãn việc công bố những số liệu về mậu dịch.", "eng": "The government have delayed publication of the trade figures."}, {"viet": "Chính phủ sẽ bổ sung tất cả các khoản tiền do tư nhân tặng cho viện bảo tàng.", "eng": "The government will match all private do-nations to the museum."}, {"viet": "Đất đặc biệt rung chuyển và một khoảng trống mở ra dưới chân anh ta.", "eng": "The ground began to shake and a sudden void opened under his feet."}, {"viet": "Chiến tranh vùng vịnh đã được đề cập tới rất nhiều.", "eng": "The Gulf war got massive media coverage."}, {"viet": "Mưa lớn đã bỏ qua toàn bộ miền bắc của đất nước, còn miền nam hứng chịu tất cả.", "eng": "The heavy rain missed the north of the country altogether, and the south copped the lot."}, {"viet": "Con ngựa đã vượt qua rào một cách dễ dàng.", "eng": "The horse negotiated the fence with ease."}, {"viet": "Ngôi nhà này thể hiện ý tưởng của chúng tôi về ngôi nhà hiện đại.", "eng": "The house embodies our idea of morden home."}, {"viet": "Bộ óc của con người là trung tâm hoạt động của hệ thần kinh cao cấp.", "eng": "The human brain is the center of higher nervous activity."}, {"viet": "Sự cố đó đã đặt cô ta vào một tâm trạng bực bội.", "eng": "The incident put her in a bad mood."}, {"viet": "Sự bổ nhiệm vị phó thủ tướng mới.", "eng": "The installation of the new vice-chancellor."}, {"viet": "Cái xương hàm đó là vật khám phá có ích nhất của chúng tôi.", "eng": "The jawbone was our most valuable find."}, {"viet": "Bồi thẩm đoàn tha bổng hắn khỏi tội sát nhân.", "eng": "The jury acquitted him of the charge of murder."}, {"viet": "Chiếc thang dựng sát vào tường.", "eng": "The ladder is leaning up against the wall."}, {"viet": "Luật pháp cấm xây dựng trên khu đất này.", "eng": "The law forbids building on this land."}, {"viet": "Thư đề ngày 17 tháng năm nhưng tôi đã đọc nhầm là ngày 11.", "eng": "The letter was dated May 17th but I misread it as the 11th."}, {"viet": "Bảng liệt kê các vật liệu nấu ăn có vẻ hấp dẫn.", "eng": "The list of ingredients sounds very appetizing."}, {"viet": "Lương thấp là lý do chủ yếu khiến cô ta thôi việc.", "eng": "The low salary is her principal reason for leaving the job."}, {"viet": "Con chim trống nhảy múa ve vãn trước khi đạp con mái.", "eng": "The male bird performs a sort of mating dance before copulating with the female."}, {"viet": "Hiệu trưởng trường cao đẳng Balliol, Oxford.", "eng": "The Master of Balliol College, Oxford."}, {"viet": "Cuộc họp phải được tổ chức vào thời gian thích hợp cho các bà mẹ đang đi làm.", "eng": "The meeting must be held at a time convenient for working mothers."}, {"viet": "Cuộc đình công của thợ mỏ không xảy ra.", "eng": "The miner's strike is off."}, {"viet": "Tiền này không phải của anh, đó là của John.", "eng": "The money's not yours, it's John's."}, {"viet": "Đề nghị đó được tán thành với 10 phiếu thuận, 6 phiếu chống.", "eng": "The motion was carriedby ten votes to six."}, {"viet": "Cái tên Bosporus xuất phát từ tiếng Hy Lạp có nghĩa là bò và chỗ cạn.", "eng": "The name Bosporus comes from the Greek words meaning ox and ford."}, {"viet": "Hệ thống máy tính mới sẽ loại bỏ sự cần thiết phải lưu giữ hồ sơ.", "eng": "The new computer system will dispense with the need for keeping files."}, {"viet": "Chương trình mời sẽ được phát vào lúc bảy giờ.", "eng": "The new programme will be broadcast at seven o'clock."}, {"viet": "Tin tức được loan truyền trên tất cả tờ nhật báo.", "eng": "The news was blazed all over the daily papers."}, {"viet": "Nốt nhạc đó đối với anh ấy là cao quá.", "eng": "The note was too high for him."}, {"viet": "Các tuyến đường biển luôn luôn đông đúc.", "eng": "The ocean lanes are always busy."}, {"viet": "Bà già ngồi hàng giờ nghĩ một cách buồn bã những điều có thể xảy ra trong quá khứ.", "eng": "The old lady would sit for hours, thinking sadly of all the might-have-beens."}, {"viet": "Ý kiến của sinh viên, người đầu phiếu, đoàn thể v.v... nói chung.", "eng": "The opinions of students, voters, society, etc at large."}, {"viet": "Tờ báo nhận được trung bình 100 bài báo mỗi ngày.", "eng": "The pager receives an average of 100 articles a day."}, {"viet": "Đảng phải cố giành lại cho được sự ủng hộ đã bị mất đi.", "eng": "The party must try to win back the support it has lose."}, {"viet": "Việc thanh toán hàng hóa sẽ được thực hiện bằng cách trả góp.", "eng": "The payment of the goods will be made by installments."}, {"viet": "Sự nhỏ nhen trong những lời chỉ trích của họ làm anh ta nổi khùng.", "eng": "The pettiness of their criticisms enraged him."}, {"viet": "Viên phi công loay hoay với các núm điều khiển.", "eng": "The pilot was wrestling with the controls."}, {"viet": "Những hành tinh thuộc thái dương hệ là sao Thủy, sao Kim, Quả đất, sao Hỏa, sao Mộc, sao Thổ, sao Thiên vương, Hải vương và sao Diêm vương.", "eng": "The planets of our solar system are Mercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus, Neptune and Pluto."}, {"viet": "Nhà viết kịch Oscar Wilde nổi tiếng nhờ những bài thơ trào phúng của ông ta.", "eng": "The playwright Oscar Wilde was noted for his epigrams."}, {"viet": "Cảnh sát không biết thân nhân của người xấu số.", "eng": "The police do not know the identity of the dead man."}, {"viet": "Cảnh sát đã khám xét kẻ tình nghi để tìm những viên ngọc bị mất.", "eng": "The police searched the suspected for the missing gems."}, {"viet": "Đại hội liên hoan nhạc pop được tiếp âm trên toàn thế giới.", "eng": "The pop festival was relayed all round the world."}, {"viet": "Kết quả dự đoán và kết quả thực sự rất khác nhau.", "eng": "The predicted results and the actual results are very different."}, {"viet": "Tổng thống được hoan nghênh vì sự ủng hộ mạnh mẽ của ông đối với dự luật.", "eng": "The President was applauded for his strong support of the bill."}, {"viet": "Thủ tướng chủ tọa các cuộc họp nội các.", "eng": "The Prime Minister presides at meetings of the Cabinet."}, {"viet": "Vấn đề tiêu chuẩn hóa cách dùng dấu gạch nối trong các từ ghép.", "eng": "The problem of the standardisation of the use of hyphens in compounds."}, {"viet": "Tỷ lệ hàng nhập khẩu so với xuất khẩu đang làm chính phủ lo lắng.", "eng": "The proportion of imports to exports is worrying the government."}, {"viet": "Những người quá khắt khe về đạo đức muốn trong sạch hóa TV.", "eng": "The puritans who wish to clean up television."}, {"viet": "Bản phóng tác truyền thanh, phim của tiểu thuyết Jane Eyre.", "eng": "The radio, film, etc version of Jane Eyre."}, {"viet": "Những người nổi dậy chịu phục tùng quân đội.", "eng": "The rebels made their submission to the army."}, {"viet": "Tiền thuê phải trả trước thời hạn.", "eng": "The rent must be paid in advance."}, {"viet": "Kết quả của thí nghiệm này không tương quan với kết quả của các thí nghiệm trước.", "eng": "The results of this experiment do not correlate with the results of earlier ones."}, {"viet": "Sông Rhine chảy vào Biển Bắc.", "eng": "The River Rhine runs into the North Sea."}, {"viet": "Vòm trần của đường hầm sụp xuống đầu các công nhân.", "eng": "The roof of the tunnel caved in on the workmen."}, {"viet": "Vận động viên đó chạy vụt lên vượt tốp còn lại.", "eng": "The runner shot ahead of the rest."}, {"viet": "Vụ bê bối có nghĩa là ông ta đã bị phá sản về chính trị.", "eng": "The scandal means he's finished in politics."}, {"viet": "Trời và biển dường như hòa quyện với nhau.", "eng": "The sea and the sky seemed to blend into each other."}, {"viet": "Viên trung sĩ quát to ra lệnh.", "eng": "The sergeant snapped out an order."}, {"viet": "Con tàu nhổ neo khỏi bến cảng khi thuỷ triều xuống và trở lại khi thuỷ triều lên.", "eng": "The ship sailed out of harbor on the ebb tide and came back on the flood tide."}, {"viet": "Nguyên âm ngắn trong từ'pull'và nguyên âm dài trong từ'pool'.", "eng": "The short vowel in'pull'and the long vowel in'pool'."}, {"viet": "Tình hình trên các đường phố đang dần dần trở thành xấu đi.", "eng": "The situation in the streets was growing ugly."}, {"viet": "Nhiều nơi tuyết lên đến đầu gối.", "eng": "The snow was knee deep in places."}, {"viet": "Phương pháp lựa chọn đó đã để nhiều mẫu vật có giá trị lẫn lộn với các thứ loại bỏ.", "eng": "The sorting process leaves many valuable specimens undistinguished from the rejects."}, {"viet": "Ngọn tháp đó được gắn một chong chóng gió.", "eng": "The spire is surmounted by a weather-vane."}, {"viet": "Hơi nước thoát ra với tiếng xì xì lớn.", "eng": "The steam escaped with a loud hissing noise."}, {"viet": "Sự căng thẳng chuyển nhà làm cho bà ấy lúng túng.", "eng": "The stress of moving house is discombobulating her."}, {"viet": "Các bà vợ và các tì thiếp của nhà vua sống ở hậu cung.", "eng": "The sultan's wives and concubines live in the harem."}, {"viet": "Một hình bóng cao duyên dáng của một phụ nữ xuất hiện ở đầu cầu thang.", "eng": "The tall graceful form of a woman appeared at the top of the stairs."}, {"viet": "Thầy giáo trực ban đang kiểm tra các toà nhà của trường học trong giờ ăn trưa.", "eng": "The teachers on duty are policing the school buildings during the lunch hour."}, {"viet": "Bọn khủng bố cảnh báo quân đội không được đến gần toà nhà.", "eng": "The terrorists gave the army a warning not to go near the building."}, {"viet": "Thuỷ triều bắt đầu dâng và dấu chân của chúng tôi đều bị nước phủ kín.", "eng": "The tide began to flow and our footprints were covered."}, {"viet": "Thị trấn sống sót sau sự cướp phá của những toán cướp.", "eng": "The town survived the depredations of marauding gangs."}, {"viet": "Cây gỗ cứng đến mức những nhát rìu bổ chỉ sượt qua.", "eng": "The tree was so hard that the blows of the axe simply glanced off."}, {"viet": "Hai đầu dây thép phải được uốn ra ngoài.", "eng": "The two ends of the wire must be bent outward."}, {"viet": "Công đoàn quyết định đưa ra trọng tài vấn đề tiền lương.", "eng": "The union decided to go to arbitration over the wages issue."}, {"viet": "Cái thùng trong đó pha trộn các hoá chất.", "eng": "The vat in which the chemicals are compounded."}, {"viet": "Những người hầu bàn còn được tiền'boa'hậu hỉngoài tiền lương của họ.", "eng": "The waiters get good tips over and above their wages."}, {"viet": "Thời tiết làm cho cô ấy uể oải và thẫn thờ.", "eng": "The weather made her listless and lethargic."}, {"viet": "Chúc thư phải được chứng thực trước khi chúng ta được hưởng thừa kế.", "eng": "The will has to be proved before we can inherit."}, {"viet": "Từ khủng long có nghĩa là con thằn lằn khủng khiếp.", "eng": "The word dinosaur means terrible lizard."}, {"viet": "Trước khi Columbus khám phá ra châu Mỹ một năm, Nickels Koppernigk vào trường Đại học Cracow ở Ba Lan.", "eng": "The year before Columbus discovered America, Nickels Koppernigk entered the University of Krakow in Poland."}, {"viet": "Cách phát âm tiếng Anh của họ không tốt lắm nhưng đang có tiến bộ dần.", "eng": "Their English pronunciation is not good, but it is improving."}, {"viet": "Chuyện tình bê bối của họ đã thực sự gây ra chuyện ngồi lê đôi mách.", "eng": "Their scandalous affair has really set tongues wagging."}, {"viet": "Sau đó mở nó ra, và gấp mỗi góc vào chính giữa.", "eng": "Then unfold it, and fold each corner to the center."}, {"viet": "Có một con sông nhỏ hơn quanh khúc cong kế tiếp.", "eng": "There's a smaller river around the next bend."}, {"viet": "Không có nhu cầu nhiều về nhà cửa loại này.", "eng": "There's not much demand for houses of this sort."}, {"viet": "Có những lập luận đầy sức thuyết phục cả ủng hộ lẫn phản đối việc kê đơn có ma tuý.", "eng": "There are convincing arguments both for and against giving addicts drugs on prescription."}, {"viet": "Có một số sai sót trong trang số liệu.", "eng": "There are several faults in that page of figures."}, {"viet": "Có nhiều người thất nghiệp ở thị trấn này từ khi nhà máy đóng cửa.", "eng": "There has been a lot of unemployment in this town since the factory closed."}, {"viet": "Có một cửa hàng bán thức ăn nhanh McDonald ở trước nhà ga.", "eng": "There is a McDonald's in front of the station."}, {"viet": "Khoảng trống phía trên không đủ để xe buýt có thể đi qua cầu này.", "eng": "There is not enough headroom for buses to go under this bridge."}, {"viet": "Mặt nó ngây ra vì nó không biết câu trả lời.", "eng": "There was a blank look on his face because he did not know the answer."}, {"viet": "Có băng trên đường sáng nay.", "eng": "There was ice on the road this morning."}, {"viet": "Có bảy người, không kể trẻ con.", "eng": "There were seven, the children unincluded."}, {"viet": "Các loại đồng hồ này báo giờ bằng cách gõ chuông.", "eng": "These clocks told time simply by striking the hour."}, {"viet": "Những người này sống trong những điều kiện khủng khiếp.", "eng": "These people live in appalling conditions."}, {"viet": "Họ đang tuyển chọn một đội rất mạnh vào mùa bóng này.", "eng": "They're fielding a very strong side this season."}, {"viet": "Họ thỏa thuận rằng nếu tìm ra được chất nguyên tố mới mẻ này họ sẽ gọi tên là ra-đi-um.", "eng": "They agreed that if they found the new element they would call it radium."}, {"viet": "Chúng bị chật ở phía trước.", "eng": "They are tight in the front."}, {"viet": "Chúng gây ra căn bệnh gọi là ung thư.", "eng": "They cause the disease with is called cancer."}, {"viet": "Họ đã pha vốtca vào nước quả ép của cô ta và cô đã bị say lử.", "eng": "They doctored her fruit juice with vodka and she got very drunk."}, {"viet": "Chúng lấy nước bằng cách nghiền nát trái cây.", "eng": "They get the juice out of the fruit by treading it."}, {"viet": "Họ phải nhảy múa để học các điều đó.", "eng": "They have to dance them to learn them."}, {"viet": "Chúng làm ầm ĩ quá mình không thể nào nghe thấy cậu nói gì.", "eng": "They made so much din that I couldn't hear you."}, {"viet": "Họ có kế hoạch đào một hố rộng trước khi đổ móng.", "eng": "They plan to excavate a large hole before putting in the foundation."}, {"viet": "Họ đã xem nhiều tác phẩm của Nhà hát Quốc gia.", "eng": "They saw several National Theatre productions."}, {"viet": "Họ hết sức đau đớn nhìn anh ta bị thiêu chết.", "eng": "They suffered the agony of watching him burn to death."}, {"viet": "Họ làm tất cả những gì có thể để làm chúng tôi thoải mái.", "eng": "They went to the great lengths to make us comfortable."}, {"viet": "Sau vụ tai nạn, ai cũng bàng hoàng xôn xao.", "eng": "They were pretty all shook up after the accident."}, {"viet": "Tôi cho rằng ông ta sẽ từ chức, nhưng tôi xin ông, đừng dẫn lời tôi nói.", "eng": "Think he's going to resign, but please don't quote me."}, {"viet": "Trường hợp này biểu lộ một vài nét thú vị.", "eng": "This case presents some interesting features."}, {"viet": "Điều này không phù hợp với lời nói trước đây của anh ta.", "eng": "This does not assort with his earlier statement."}, {"viet": "Phát minh này được cho là của một người Nga.", "eng": "This invention is attributed to a Russian."}, {"viet": "Đây là bức tranh nguyên gốc, những cái khác là bản sao.", "eng": "This is the original painting, and these others are copies."}, {"viet": "Tình trạng lộn xộn này phản ánh năng lực yếu kém của cô ấy.", "eng": "This mess is a poor reflection on her competence."}, {"viet": "Loại cây này chỉ mọc trên đất xốp.", "eng": "This plant will only grow in light soil."}, {"viet": "Bức ảnh chụp nhanh này in không được rõ lắm.", "eng": "This snapshot hasn't printed very well."}, {"viet": "Đây là một cuộc họp thật thú vị, marc ạ.", "eng": "This was a very good meeting, Marc."}, {"viet": "Hàng nghìn hình nhân đất nung bằng cỡ người thật được phát hiện vào năm 1974.", "eng": "Thousands of life-size terracotta figures were discovered in 1974."}, {"viet": "Tom đã hoàn toàn bị rối trí bởi hai trong các câu hỏi ở kỳ thi.", "eng": "Tom was completely floored by two of the questions in the exam."}, {"viet": "Các quan chức của công đoàn lên án hành động này là một sự vi phạm thoả ước.", "eng": "Union officials denounced the action as a breach of the agreement."}, {"viet": "Liệu vụ hoả hoạn này là một tai nạn hay ( một hành động ) phá hoại?", "eng": "Was the fire an accident or ( an act of ) sabotage?"}, {"viet": "Chúng tôi phải dọn chỗ cho một chiếc xôfa mới.", "eng": "We'll have to clear some space to make room for the new sofa."}, {"viet": "Chúng tôi đang hưởng một thời gian, một kỳ nghỉ, một buổi liên hoan tuyệt vời.", "eng": "We're having a wonderful time, holiday, party."}, {"viet": "Chúng tôi đi tìm anh khắp nơi.", "eng": "We've been looking for you everywhere."}, {"viet": "Chúng tôi thực hiện được kinh tế đại trà trong sản xuất.", "eng": "We achieve economies of scale in production."}, {"viet": "Chúng tôi rất hân hạnh giới thiệu với quý vị các sản phẩm mới của chúng tôi.", "eng": "We are honored to introduce our new products to you."}, {"viet": "Cả hai chúng tôi rất vui.", "eng": "We both enjoyed ourselves very much."}, {"viet": "Chúng tôi chỉ có thể nhân nhượng ít thôi, nhưng nó có thể phá vỡ được sự bế tắc.", "eng": "We can only make minor concessions, but it might break the deadlock."}, {"viet": "Bây giờ chúng tôi muốn đi mua sắm một chút.", "eng": "We'd like to do some shopping now."}, {"viet": "Cuối cùng chúng tôi đã tới ( nghỉ ) được ở một khách sạn nhỏ sang trọng gần biển.", "eng": "We eventually wound up ( staying ) in a super little hotel by the sea."}, {"viet": "Chúng tôi đã ở Rome một tuần rồi sau đó đi Vienna.", "eng": "We had a week in Rome and then went to Vienna."}, {"viet": "Chúng tôi đã hoạt động sáu năm trong lĩnh vực sản xuất các linh kiện vi điện tử.", "eng": "We have been engaged in producing micro-electronic components for six years."}, {"viet": "Chúng ta phải hoạt động trong giới hạn của thời gian và ngân sách.", "eng": "We have to work within the parameters of time and budget."}, {"viet": "Chúng tôi thích những người chúng tôi đã gặp vào ngày nghỉ.", "eng": "We liked the people that we met on holiday."}, {"viet": "Chúng mình phải hết sức kín đáo, ông chồng em có điều nghi ngờ đấy.", "eng": "We must be extremely discreet, my husband suspects something."}, {"viet": "Chúng ta cần có một mưu mẹo để vượt qua các lính canh.", "eng": "We need a trick to get past the guards."}, {"viet": "Chúng tôi đã tìm kỹ trong hồ sơ mà không thể nào tìm thấy lá thư.", "eng": "We raked around in the files, but couldn't find the letter."}, {"viet": "Dù có xảy ra chuyện gì, chúng tôi cũng không bao giờ bỏ anh.", "eng": "We shall never leave you, whatever befalls."}, {"viet": "Chúng tôi nghĩ rằng ở tại nhà của ông cố thì ông cố sẽ thấy dễ chịu hơn.", "eng": "We thought it would be easier for him in his own house."}, {"viet": "Chúng tôi đi xem điệu múa flamenco tối qua.", "eng": "We went to see some flamenco dancing last night."}, {"viet": "Chúng tôi đã bị kẹt trong một vụ ùn tắc giao thông mất một tiếng đồng hồ.", "eng": "We were stuck in a traffic jam for an hour."}, {"viet": "Đến liên hoan cậu mặc gì cũng được-đó là một nơi hoàn toàn thoải mái.", "eng": "Wear what you like for the party-it's Liberty Hall."}, {"viet": "À, nếu người ta nghiên cứu kĩ và lấy sự kiện có thật làm cơ sở chính thì tôi mới thích.", "eng": "Well, if they're well-researched and based mainly on fact, I like them."}, {"viet": "Bị chết khi người lái xe ôm say đập thành xe vào?", "eng": "Were they killed when the intoxicated driver broadsided their car?"}, {"viet": "Còn hai đỉnh kia thì sao?", "eng": "What about the other two peaks?"}, {"viet": "Vậy việc chúng ta nhìn thấy các chòm sao nào khi nhìn lên bầu trời, tùy thuộc một phần vào vị trí của chúng ta trên quả đất.", "eng": "What constellations we see when we look up at the sky depends partly, then, on where we are on the earth."}, {"viet": "Ở nước bạn có những chính sách gì về môi trường?", "eng": "What environmental policies are there in your country?"}, {"viet": "Bạn làm điều gì trước tiên sau khi thức dậy?", "eng": "What is the first thing you do after you get up?"}, {"viet": "Bạn đang chơi kiều trò chơi gì vậy?", "eng": "What kind of game are you playing?"}, {"viet": "Tối nay chúng mình thưởng thức gì đây, Helen?", "eng": "What shall we enjoy tonight, Helen?"}, {"viet": "Cái mà anh cần là một trận cười sảng khoái.", "eng": "What you need is a good dose of laughter."}, {"viet": "Khi nó nghe âm nhạc nó không còn biết gì đến chung quanh nữa.", "eng": "When he listens to music he's lost to the world."}, {"viet": "Khi Julius Caesar trị vì Đế quốc La Mã, lịch bị xáo trộn rất trầm trọng.", "eng": "When Julius Caesar became the ruler of the Roman Empire, the calender was very badly mixed up."}, {"viet": "Có chiến tranh, sự bất ổn xã hội là hậu quả tất yếu.", "eng": "When there is war, social unrest often follows."}, {"viet": "Chỗ tốt nhất để đi qua con đường đó là chỗ nào?", "eng": "Where's the best place to cross the road?"}, {"viet": "Bất cứ chỗ nào bạn đi, bạn gần như lúc nào cũng có thể tìm được những chỗ đi picnic cộng với những cái bàn và ghế dài bằng gỗ, thùng rác và phòng vệ sinh.", "eng": "Wherever you go, you can nearly always find picnic places complete with wooden tables and benches, garbage cans, restrooms."}, {"viet": "Em đi đôi giày nào, đôi đỏ hay đôi nâu?", "eng": "Which shoes shall I wear, the red ones or the brown ones?"}, {"viet": "Ai đã cung cấp lương thực, thực phẩm cho đám cưới con trai anh?", "eng": "Who did the catering for your son's wedding?"}, {"viet": "Tại sao anh không trèo lên mái nhà?'.", "eng": "Why did you climb onto the roof?'."}, {"viet": "Sao tôi lại phải bận tâm giải thích tất cả điều đó nhỉ?", "eng": "Why should I trouble to explain it all?"}, {"viet": "Anh vui lòng thoả mãn tính tò mò của tôi và cho tôi biết nó giá bao nhiêu chứ?", "eng": "Will you indulge my curiosity and tell me how much it cost?"}, {"viet": "Với tất cả lòng kính trọng cần thiết, báo cáo này phải viết lại mới có thể cho xuất bản được.", "eng": "With all due respect, this report needs to be rewritten before it an be published."}, {"viet": "Hãy cố gắng học tập rồi anh sẽ thi đỗ.", "eng": "Work hard and you will pass your examinations."}, {"viet": "Ông có muốn tôi thay ông ( lái xe ) một lát không?", "eng": "Would you like me to take over ( the driving ) for a while?"}, {"viet": "Ông làm ơn ký duyệt chúng ở đây được không?", "eng": "Would you please countersign them here?"}, {"viet": "Những năm bất ổn trong quan hệ công nghiệp.", "eng": "Years of malaise in industrial relations."}, {"viet": "Vâng, ngân hàng Nhân dân Trung Quốc, như ông biết, là ngân hàng trung ương.", "eng": "Yes, the People's Bank of China, as you know, is the central bank."}, {"viet": "Anh sẽ thấy không khí ở đây rất tốt, Henry nói khi họ đi vào trong phòng.", "eng": "You'll find this a nice ambiance, says Henry, as they go into the room."}, {"viet": "Anh cũng chẳng hơn gì họ: anh là ai mà đi chỉ trích người khác?", "eng": "You're no better than they are: who are you to judge other people?"}, {"viet": "Cưng ơi, em đã nhớ được ngày sinh của anh.", "eng": "You angel, you've remembered my birthday."}, {"viet": "Anh không thể để buồng anh dơ bẩn như thế được.", "eng": "You can't leave your room in a muck like that."}, {"viet": "Các bạn có thể để ô dù ở ngoài cổng vào.", "eng": "You can leave your umbrella in the entry."}, {"viet": "Anh nói những điều dối trá như thế là đã tự hạ thấp phẩm giá của mình.", "eng": "You debase yourself by telling such lies."}, {"viet": "Bạn có phi công lái máy bay.", "eng": "You have pilots for the planes."}, {"viet": "Trông bạn có vẻ khác so với trong ảnh.", "eng": "You look different than in the picture."}, {"viet": "Anh phải đi làm nếu không anh sẽ mất việc.", "eng": "You must go to work or else you'll lose your job."}, {"viet": "Bạn không bao giờ biết được khi nào thì nó có ích đâu.", "eng": "You never know when it might come in handy."}, {"viet": "Các anh không nên nói năng với thầy giáo một cách suồng sã như thế.", "eng": "You should not address your teacher with such familiarity."}, {"viet": "Cậu muốn làm giàu nhanh, cậu hãy buôn bán ma tuý ở Phố Fourth.", "eng": "You want a fast buck you get in on that action over on Fourth Street."}, {"viet": "Chính anh là một trong những người phạm tội chủ yếu.", "eng": "You yourself are one of the chief offenders."}, {"viet": "Mẹ anh rất đau buồn vì anh đã từ chối không quay về nhà nữa.", "eng": "Your mother is very grieved by your refusal to return home."}]