[{"viet": "Xin cám ơn ông đã cho chúng tôi xem bộ sưu tập hoạ phẩm của ông, \"Đó là đặc ân của tôi\".", "eng": "Thank you for showing us your collection of painting, \"It's my privilege\"."}, {"viet": "Bu-mê-răng đơn giản là cây gậy cong.", "eng": "A boomerang is simply a curved club."}, {"viet": "Một hợp âm C đô trưởng với nốt mi E thấp là sự đảo ngược hợp âm lần thứ nhất.", "eng": "A chord of C major with E in the bass is in the 1st inversion."}, {"viet": "Một nhà văn viết nhiều về truyện trinh thám.", "eng": "A copious writer of detective stories."}, {"viet": "Hệ thống vũ khí phòng thủ để phá hủy các tên lửa tới gần đất nước.", "eng": "A defensive weapon system to destroy missiles approaching the country."}, {"viet": "Sự xuống giá, sự hạ nhiệt.", "eng": "A drop in prices, in temperatures."}, {"viet": "Một trận chung kết giữa đấu thủ hạt giống số 1 và số 2.", "eng": "A final between the first and second seeds."}, {"viet": "Quan điểm xem trái đất là trung tâm vũ trụ.", "eng": "A geocentric view of the universe."}, {"viet": "Một nhóm đã ép Quốc hội thông qua dự luật đó.", "eng": "A group that ramroded the bill through congress."}, {"viet": "Một ngày nghỉ sẽ giúp bạn thư giãn sau các kỳ thi của bạn.", "eng": "A holiday will help you relax after your exams."}, {"viet": "Khoảng cách vài giây giữa chớp và sấm.", "eng": "A lag of several seconds between the lightning and the thunder."}, {"viet": "Một hàng người đi qua để nhận diện.", "eng": "A line-up of men in an identification parade."}, {"viet": "Một nhân tài kiệt xuất mới đã bất ngờ xuất hiện trên văn đàn.", "eng": "A major new talent has burst on the literary scene."}, {"viet": "Một tên lửa bay quá thấp đến nỗi suýt chạm vào hàng rào cây.", "eng": "A missile which flies so low that it almost grazes the tops of the hedgerows."}, {"viet": "Một phương pháp mới là kết quả tổng hợp những điểm hay nhất của các phương pháp cũ.", "eng": "A new method that is a synthesis of the best features of the old methods."}, {"viet": "Một cuộc diễu hành của các cầu thủ trước một trận đấu bóng đá.", "eng": "A parade of players before a football match."}, {"viet": "Một hình đĩa màu đỏ có tia phát ra tượng trưng cho mặt trời.", "eng": "A picture of a red disc with rays coming from it, symbolizing the sun."}, {"viet": "Một lời kêu gọi có hiệu quả về ý thức công bằng của quần chúng.", "eng": "A powerful appeal to the public's sense of justice."}, {"viet": "Một tòa nhà làm sẵn bằng tôn có mái vòng cung đã từng chứa thóc lúa.", "eng": "A Quonset building that once stored grain."}, {"viet": "Một con sông có chiều dài 300 dặm Anh.", "eng": "A river 300 miles in length."}, {"viet": "Một nhân viên bảo vệ bị giết trong vụ cướp ngân hàng.", "eng": "A security guard was killed in the bank raid."}, {"viet": "Chỉ một sơ suất nhỏ thôi và thế là tất cả thời gian, tiền của đều bị đổ xuống sông.", "eng": "A single mistake and all that time and money would go down the drain."}, {"viet": "Một cuộc cãi nhau vặt giữa chị em.", "eng": "A spat between brother and sister."}, {"viet": "Một sự ghét thậm tệ thơ mới.", "eng": "A strong dislike of modern poetry."}, {"viet": "Một báo cáo có dụng ý về những cuộc bầu cử vừa qua.", "eng": "A tendentious account of the recent elections."}, {"viet": "Một loại nhựa dẻo trong suốt như thủy tinh nhưng bền hơn.", "eng": "A type of plastic that is as transparent as glass but stronger."}, {"viet": "Phần nguyên thì lớn hơn bất cứ thành phần nào của nó.", "eng": "A whole is greater than any of its parts."}, {"viet": "Chấp nhận sự đối xử thiên vị với sự phục tùng miễn cưỡng.", "eng": "Accept unfair treatment in supine submission."}, {"viet": "Làm lễ ban phúc lần cuối cho ai lúc hấp hối.", "eng": "Administer the last sacrament to somebody in extremis."}, {"viet": "Mặc dù tôi đã làm mọi thứ cho hắn, hắn vẫn phớt lờ tôi.", "eng": "After everything I've done for him, he still ignores me."}, {"viet": "Sau khi uống thuốc, ông hãy đi ngủ ngay.", "eng": "After taking it, go to bed right away."}, {"viet": "Nông nghiệp là một chỗ dựa chính của nền kinh tế.", "eng": "Agriculture is the mainstay of the economy."}, {"viet": "Tất cả những sản phẩm đó đều đáp ứng các nhu cầu này.", "eng": "All of them meet these requirements."}, {"viet": "Tất cả các miếng thạch dâu đều được ăn sạch.", "eng": "All the strawberry jellies had been eaten."}, {"viet": "Luôn luôn tạ sự nghèo khi được yêu cầu làm phúc.", "eng": "Always poor-mouths when asked to donate to charity."}, {"viet": "Một nhân viên cấp cứu đem đến một cái băng ca để khiêng người đàn bà bị thương.", "eng": "An ambulance officer brought a stretcher for the injured woman."}, {"viet": "Một mùi hấp dẫn toả ra từ lò bánh.", "eng": "An enticing smell came from the bakery."}, {"viet": "Một giải pháp không thực tế cho một vấn đề.", "eng": "An inoperable solution to a problem."}, {"viet": "Một tên lừa đảo chính cống.", "eng": "An out-and-out crook, professional."}, {"viet": "Bữa ăn sẽ là món gì, món ăn Trung Quốc phải không ạ?", "eng": "And what is it going to be, Chinese food?"}, {"viet": "Bất cứ việc nối lại cuộc thương nghị nào cũng sẽ được hoan nghênh.", "eng": "Any renewal of negotiations will be welcomed."}, {"viet": "Khung của tất cả các tòa cao ốc văn phòng rộng lớn này đều được làm bằng xi măng phải không?", "eng": "Are the skeletons of all these large office buildings made of cement?"}, {"viet": "Anh có định trải thảm lên sàn gỗ ván không?", "eng": "Are you going to cover the planking with carpet?"}, {"viet": "Cô không bỏ miếng đường nào vào trà của cô à?", "eng": "Aren't you putting any sugar in yours?"}, {"viet": "Vì George đã giới thiệu Peter và Sarah với nhau, việc anh ta sẽ là phụ rể tại đám cưới của họ là điều hợp lý thôi.", "eng": "As George introduced Peter and Sarah it is only fit and proper that he should be best man at their wedding."}, {"viet": "Bởi vì anh không có ở đó tôi đã nhắn tin lại.", "eng": "As you weren't there I left a message."}, {"viet": "Ở một số hiệu thuốc, người ta có thể mua được bất cứ món gì, từ một viên aspirin đến một cái áo khoác ngoài.", "eng": "At some drugstore you can buy anything from an aspirin to an overcoat."}, {"viet": "Tránh khỏi bị giao vai một tên găng tơ.", "eng": "Avoid being typecast as a gangster."}, {"viet": "Nói gì cũng phải cẩn thận đấy; cuộc nói chuyện của chúng ta có thể đang bị nghe trộm.", "eng": "Be careful what you say; our conversation may be being bugged."}, {"viet": "Quá phóng túng với ai trong quan hệ tình dục.", "eng": "Be too free with one's favours."}, {"viet": "Bỉ được gọi là chiến trường ở Âu châu.", "eng": "Belgium has been called the cockpit of Europe."}, {"viet": "Máu từ vết thương đã khô cứng lại trên mặt anh ấy.", "eng": "Blood from the wound had caked on his face."}, {"viet": "Britol nằm về hướng tây nước Anh.", "eng": "Bristol is in the west of England."}, {"viet": "Nhưng trước hết, hãy cho tôi biết tất cả về những người và vật bên ngoài những người nhảy múa và khán giả đi.", "eng": "But first, tell me about all the people and things outside the dancers and spectators."}, {"viet": "Nhưng ngành công nghiệp hàng không đang cố gắng giảm các chất gây ô nhiễm của khí thải càng nhiều càng tốt, bằng cách cải thiện hiệu quả của các động cơ phản lực và bằng cách sử dụng các hệ thống đốt khí dư để tăng tốc.", "eng": "But the aviation industry is trying to reduce exhaust pollutants as mush as possible, by improving the efficiency of jet engines and by using after-burners."}, {"viet": "Bằng cách lên xuống giọng nhiều hơn người ta có thể thu hút sự chú ý của khán giả.", "eng": "By inflecting the voice more one can hold the attention of an audience."}, {"viet": "Việc quảng cáo cho cuộc vận động chỉ dựa vào những lời chỉ trích người khác.", "eng": "Campaign advertising that was based solely on negatives."}, {"viet": "Ghi âm tiếng vỗ tay tán thưởng của khán giả để lồng tiếng vào một vở kịch hài trên tivi.", "eng": "Can the audience's applause for a TV comedy show."}, {"viet": "Bạn đưa cho tôi tờ báo đó nhé.", "eng": "Can you hand me the newspaper."}, {"viet": "Xin hãy chỉ cho tôi đường đi đến nhà thờ?", "eng": "Can you tell me the way to the church?"}, {"viet": "Linh mục Thiên Chúa giáo thề nguyện sống độc thân.", "eng": "Catholic priests take a vow of celibacy."}, {"viet": "Trẻ con phải học cách ăn uống cho đàng hoàng.", "eng": "Children must learn to behave at table."}, {"viet": "Sự phân tích kỹ lưỡng những doanh số bán ra cho thấy rõ những sự khác biệt theo khu vực.", "eng": "Close analysis of sales figures shows clear regional variations."}, {"viet": "Tung lực lượng dự bị của mình vào trận đánh.", "eng": "Commit one's reserves to the battle."}, {"viet": "Chủ nghĩa bảo thủ là một vấn đề thuộc cảm tính ở phương Tây.", "eng": "Conservatism is a gut issue in the West."}, {"viet": "Anh có thể đổi giùm tôi được không?", "eng": "Could you do it for me?"}, {"viet": "Paula, chị vui lòng sao chụp lá thư này được không?", "eng": "Could you xerox this letter please, Paula?"}, {"viet": "Bố nó ơi, ở Mỹ họ không có cà phê đá đâu.", "eng": "Dad, they don't have iced coffee in America."}, {"viet": "Nhu cầu điện đạt tới mức tối đa vào lúc chạng vạng tối.", "eng": "Demand for electricity peaks in the early evening."}, {"viet": "Cống hiến hết năng lực của ai vào một công việc.", "eng": "Devote all one's energies to a task."}, {"viet": "Có phải anh nói họ sắp dọn đi không?", "eng": "Did you say they're moving?"}, {"viet": "Chia cái bánh ngọt thành những phần bằng nhau.", "eng": "Divide the cake into equal parts."}, {"viet": "Ở châu Âu người ta có chơi bóng chày không?", "eng": "Do they play baseball in Europe?"}, {"viet": "Cô có trâm cài áo hợp với áo đầm này không?", "eng": "Do you have a brooch that goes well with this dress?"}, {"viet": "Bạn có giữ căn phòng của bạn gọn gàng và ngăn nắp không?", "eng": "Do you keep your room neat and tidy?"}, {"viet": "Ông cảm phiền mở cửa sổ giùm được không?", "eng": "Do you mind opening the window?"}, {"viet": "Bạn có nghĩ là người Nhật làm việc quá vất vả không?", "eng": "Do you think that Japanese people work too hard?"}, {"viet": "Hắn có chứng cớ gì để bênh vực cho việc này không?", "eng": "Does he have evidence to support this?"}, {"viet": "Cậu đừng có đấu khẩu với tôi!", "eng": "Don't bandy words with me, young man!"}, {"viet": "Đừng quên mời gia đình Jordan.", "eng": "Don't forget to invite the Jordans."}, {"viet": "Đừng có nhúc nhích-đây là một vụ tống tiền!", "eng": "Don't move-this is a stick-up!"}, {"viet": "Đừng tin nó-nó là một thằng giỏi bẻm mép!", "eng": "Don't trust him-he's a real smoothy!"}, {"viet": "Thảo một Hiến pháp phỏng theo kiểu Hoa Kỳ.", "eng": "Draw up a constitution after the American model."}, {"viet": "Mỗi một ngân hàng chuyên ngành đều có chức năng chủ chốt và lĩnh vực kinh doanh riêng của nó.", "eng": "Each of the specialized banks has its own key function and scope of business."}, {"viet": "Nước Anh đã đánh bại những đối thủ chính của mình trong vòng thi đấu đầu tiên.", "eng": "England conquered their main rivals in the first round of the competition."}, {"viet": "Ngay cả khi mọi người xung quanh hoảng hốt, bà ta vẫn giữ được vẻ bình tĩnh của kẻ cả.", "eng": "Even when those around her are panic she always maintains an Olympian calm."}, {"viet": "Xin lỗi, cố định dọn dẹp phòng của tôi phải không?", "eng": "Excuse me, are you going to clean my room?"}, {"viet": "Họ đã tiến hành những cuộc khám nghiệm kỹ càng cho bệnh nhân này.", "eng": "Extensive tests have been carried out on the patient."}, {"viet": "Những nỗi lo ngại là các yếu tố cần xét tới về an toàn đã bị xem nhẹ hơn các lợi ích thương mại.", "eng": "Fears that safety considerations were being subordinated to commercial interests."}, {"viet": "Tìm câu trả lời cho một câu đố.", "eng": "Find the answer to a puzzle."}, {"viet": "Máy bay số BA4793 sẽ đến Luân Đôn lúc 16h50.", "eng": "Flight number BA 4793 will arrive in London at 16.50."}, {"viet": "Để khởi sự chúng tôi sẽ tống khứ đám đồ đạc cũ này đi.", "eng": "For openers we'll get rid of this old furniture."}, {"viet": "Không khí trong lành có lợi cho sức khỏe.", "eng": "Fresh air is beneficial to one's health."}, {"viet": "Chà, tôi thích cái mũ mới của cậu quá!", "eng": "Gee, I like your new hat!"}, {"viet": "Giải thích và phân tích dài dòng một lý thuyết.", "eng": "Give a long explication of a theory."}, {"viet": "Cút! Và đừng bao giờ bén mảng tới nhà tao nữa!", "eng": "Go! And never darken my door again!"}, {"viet": "Đứng ra làm kiến nghị chống lại việc quy hoạch lại khu vực.", "eng": "Got up a petition against rezoning."}, {"viet": "Tay và mặt bị nứt nẻ vì trời lạnh.", "eng": "Hands and face chapped by the cold."}, {"viet": "Ở nhà chúng ta còn đủ thức ăn không?", "eng": "Have we got enough food in?"}, {"viet": "Bạn có bao giờ làm việc cho một nhà hàng bán thức ăn nhanh như McDonald's hay Kentucky Fried Chicken chưa?", "eng": "Have you ever worked for a fast food restaurant such as McDonald's or Kentucky Fried Chicken?"}, {"viet": "Đem chó của anh đi tiêm ngừa bệnh dại.", "eng": "Have your dog vaccinated against rabies."}, {"viet": "Nó là một thằng bé hỗn láo luôn luôn cãi lại mẹ nó.", "eng": "He's a rude little boy, always answering his mother back."}, {"viet": "Anh ta bị tống cổ ra khỏi câu lạc bộ vì không trả các hoá đơn tiền.", "eng": "He's been turfed out of the club for not paying his bill."}, {"viet": "Không thể phân biệt nó với anh nó.", "eng": "He's indistinguishable from his brother."}, {"viet": "Hắn đã phung phí tất cả tiền dành dụm được vào rượu chè.", "eng": "He's squandered an his savings on drink."}, {"viet": "Anh ấy rất mực yêu mến vợ và các con.", "eng": "He adores his wife and children."}, {"viet": "Anh ta hét gọi tôi bên kia đường.", "eng": "He bawled at me across the street."}, {"viet": "Anh ấy đến đúng giờ như đã hẹn.", "eng": "He came at the agreed hour."}, {"viet": "Chàng ôm ghì nàng sát vào ngực.", "eng": "He clasped her to his chest."}, {"viet": "Anh ta thích có một chiếc xe ôtô của riêng mình.", "eng": "He'd like a car of his own."}, {"viet": "Ông ta không ưa những kẻ chểnh mảng trong công việc.", "eng": "He disliked loafers on the job."}, {"viet": "Anh ta tham dự vào các kế hoạch của chúng ta với sự say mê khủng khiếp.", "eng": "He entered into our plans with terrific zest."}, {"viet": "Cuối cùng chàng ta đâm ra chán theo đuổi cô nàng.", "eng": "He finally became tired of running after her."}, {"viet": "Hắn đẩy nhẹ một cái vào chồng hộp thiếc và tất cả đều đổ xuống.", "eng": "He gave the pile of tins a jog and they all fell down."}, {"viet": "Anh ta có linh cảm là cô ta nói dối.", "eng": "He had a hunch that she was lying."}, {"viet": "Anh ấy có một thể lực rất cường tráng.", "eng": "He has a cast-iron constitution."}, {"viet": "Anh ta chưa làm điều gì khác thường cả.", "eng": "He has done nothing out of the way yet."}, {"viet": "Ông ta đã làm việc từ một chân thư kí thường được thăng cấp dần dần lên tới tổng giám đốc.", "eng": "He has worked his way up from junior clerk to managing director."}, {"viet": "Anh ấy có giọng hát trầm rất hay.", "eng": "He is a very fine bass."}, {"viet": "Anh ta bị ám ảnh với ý nghĩ là mình bị theo dõi.", "eng": "He is possessed with the idea that he is being followed."}, {"viet": "Anh ta giữ sức khoẻ bằng cách chạy 5 dặm Anh mỗi ngày.", "eng": "He keeps himself fit by running 5 miles every day."}, {"viet": "Nó lắng nghe một cách hoài nghi câu chuyện kỳ lạ này.", "eng": "He listened in disbelief to this extraordinary story."}, {"viet": "Anh ấy đưa ra những nhận xét thông thường về thời tiết.", "eng": "He made a few conventional remarks about the weather."}, {"viet": "Anh ta phải học cách kiềm chế tính nóng của mình.", "eng": "He must learn to moderate his temper."}, {"viet": "Anh ta trả tiền phí tổn phụ trội mà chẳng phàn nàn gì cả.", "eng": "He paid the extra cost without a murmur."}, {"viet": "Anh ta châm vào chỗ sưng phồng trên gót chân của mình bằng một cây kim đã khử trùng.", "eng": "He pricked the blister on his heel with a sterilized."}, {"viet": "Nó chạy lao xuống phố.", "eng": "He ran hen-for-leather down the street."}, {"viet": "Nó đã nhắc lại nguyên văn lời anh nói.", "eng": "He repeated what you said word for word."}, {"viet": "Anh ta là thành viên của vài câu lạc bộ ở Luân Đôn.", "eng": "He's a member of several London clubs."}, {"viet": "Anh ta có năng lực làm việc.", "eng": "He's efficient at his job."}, {"viet": "Ông ta không phải là một người khỏe mạnh.", "eng": "He's not a well man."}, {"viet": "Tất nhiên là ông ấy rất già.", "eng": "He's very old, of course."}, {"viet": "Vì quá thô lỗ hắn làm mọi người xa lánh.", "eng": "He scares people away by being so brash."}, {"viet": "Anh ta la lớn một loạt khẩu lệnh rõ ràng dứt khoát.", "eng": "He shouted a series of staccato orders."}, {"viet": "Nó nói tiếng Pháp rất giỏi, chả là nó đã sống ba năm ở Paris rồi mà.", "eng": "He speaks very good French-but then he did live in Paris for three years."}, {"viet": "Cậu ấy hãy còn bị khó chịu khá nhiều vì chỗ bị thương.", "eng": "He still suffers considerable discomfort from his injury."}, {"viet": "Ông ta cầm ba toong vụt đứt ngọn các cây tầm ma.", "eng": "He swished off the tops of the nettles with his cane."}, {"viet": "Anh ta bảo tôi xéo đi, hay là những lời lẽ đại loại như thế.", "eng": "He told me to get out, or words to that effect."}, {"viet": "Nó tán tỉnh cô ấy nhiều lần nhưng cô không chịu lấy.", "eng": "He tried to court many times, but she didn't agree to marry him yet."}, {"viet": "Anh ta đã từng làm việc ở Sở ngoại vụ.", "eng": "He used to work at the FO."}, {"viet": "Anh ấy được gột sạch tội lỗi sau cuộc điều tra.", "eng": "He was absolved from all blame after the inquiry."}, {"viet": "Anh ta đang suy sụp vì căng thẳng.", "eng": "He was breaking up under the strain."}, {"viet": "Nó hăm hở muốn thoát ra khỏi địa vị tầm thường và nổi bật lên bằng cách nào đó.", "eng": "He was eager to get out of the ruck and distinguish himself in some way."}, {"viet": "Hắn lúc đó đang nổi cơn thịnh nộ không sao kìm chế nổi.", "eng": "He was in one of his uncontrollable furies."}, {"viet": "Ông ta chỉ có kiến thức rải rác về những lĩnh vực ngoài nghề nghiệp của mình.", "eng": "He was only sparsely read in fields outside his profession."}, {"viet": "Hắn đang xì xụp ăn xúp.", "eng": "He was slurping down his soup."}, {"viet": "Anh ta đang định bán trại chăn nuôi với giá quá cao.", "eng": "He was trying to sell the ranch at an astronomical price."}, {"viet": "Ông ta đi thẳng đến Lagos, không dừng lại ở Nairobi.", "eng": "He went straight to Lagos, without stopping in Nairobi."}, {"viet": "Anh ấy làm với kĩ thuật hết sức hoàn hảo.", "eng": "He worked hard at the perfection of his technique."}, {"viet": "Lạy trời đừng có bất cứ điều gì khủng khiếp xảy ra với cô ấy.", "eng": "Heaven forbid that anything awful should have happened to her."}, {"viet": "Sự vui vẻ giả tạo của cô ta che giấu một nỗi buồn trong lòng.", "eng": "Her artificial gaiety disguised an inner sadness."}, {"viet": "Sự cằn nhằn liên tục của bà ta bắt đầu làm ông khó chịu.", "eng": "Her constant nagging is beginning to get to him."}, {"viet": "Gương mặt cô ta biểu lộ rõ rệt tâm tính.", "eng": "Her face was a fair index to her disposition."}, {"viet": "Nàng chúi đầu vào cuốn sách đang đọc.", "eng": "Her head was buried in the book she was reading."}, {"viet": "Trò xiếc nguy hiểm mới nhất của cô ta là chạy xe mô tô qua vòng lửa.", "eng": "Her latest stunt is riding a motorcycle through a ring of flames."}, {"viet": "Tiểu thuyết của chị viết theo thị hiếu quảng đại quần chúng.", "eng": "Her novel is tailored to popular tastes."}, {"viet": "Sự từ chối của bà ta khiến tôi hoàn toàn sửng sốt.", "eng": "Her refusal shocked us to the core."}, {"viet": "Cái nhìn chằm chằm của cô ta không dao động.", "eng": "Her steady gaze did not waver."}, {"viet": "Nàng làm việc một ngày bảy tiếng.", "eng": "Her working day is seven hours."}, {"viet": "Đồng lương cao đang cám dỗ nhiều giáo viên nhảy vào ngành công nghiệp.", "eng": "Higher salaries are seducing many teachers into industry."}, {"viet": "Ít ra thì thân thế của anh ta còn hơi đáng ngờ.", "eng": "His background is a trifle dubious, to say the least."}, {"viet": "Sự vận dụng khôn khéo thị trường chứng khoán đã đem đến cho anh ta nhiều tiền.", "eng": "His clever manipulation of the stock markets makes him lots of money."}, {"viet": "Với tư cách một nhà chính trị, nhiệm vụ của ông ta là đại diện cho quyền lợi của giai cấp công nhân.", "eng": "His duty as a politician was to represent the interests of the working class."}, {"viet": "Cha anh ta là một kẻ nát rượu vũ phu.", "eng": "His father was a drunken brute."}, {"viet": "Tim anh ta xốn xang khi nhìn thấy cảnh đó.", "eng": "His heart went aflutter when he saw the sight."}, {"viet": "Chân anh ta bị tê dại đi vì cơn đau dữ dội.", "eng": "His leg was numbed by the intense pain."}, {"viet": "Chiếc xe ô tô mới của anh ta làm cho họ ghen ghét.", "eng": "His new car excited their envy."}, {"viet": "Sức khoẻ của ông ta tồi đã buộc ông ta xa nước Anh.", "eng": "His poor health forced him away from England."}, {"viet": "Bề ngoài bệ rạc của anh ta gây ra một ấn tượng xấu.", "eng": "His shabby appearance created a bad impression."}, {"viet": "Nhận xét thiếu tế nhị của anh ta làm tê liệt cuộc nói chuyện.", "eng": "His tactless remark killed the conversation."}, {"viet": "Lời anh ta nói có ẩn ý.", "eng": "His words had a hidden meaning."}, {"viet": "Tác phẩm Iliad của Homer là một thiên anh hùng ca nổi tiếng.", "eng": "Homer's Iliad is a famous epic."}, {"viet": "Tối nay ăn trưa với tôi được không?", "eng": "How about having lunch with me this afternoon?"}, {"viet": "Sao hắn lại dám đem xe đạp của tôi đi mà không hỏi trước!", "eng": "How dare he take my bicycle without even asking!"}, {"viet": "Làm sao chị có thể trông nom chu đáo một ngôi nhà lớn như vậy?", "eng": "How do you manage to keep up such a big house?"}, {"viet": "Ông bị như thế này bao lâu rồi, ông Lý?", "eng": "How long have you been like this, Mr. Li?"}, {"viet": "Ở nước bạn có bao nhiêu ngày quốc lễ?", "eng": "How many national holidays are there in your country?"}, {"viet": "Một lon cola ở nước bạn bao nhiêu tiền?", "eng": "How much is a can of cola in your country?"}, {"viet": "Làm sao mà chúng ta tìm được nhà nếu chúng ta không biết địa chỉ?", "eng": "How will we find the house if we don't know the address?"}, {"viet": "Khi cô ấy đến tôi đã đi rồi.", "eng": "I'd already left by the time she arrived."}, {"viet": "Tôi muốn thảo luận với anh những điều anh nói về vấn đề thất nghiệp.", "eng": "I'd like to take you up on what you said about unemployment."}, {"viet": "Tao sẽ cho mày biết tay tao về chuyện đó, đồ con hoang!", "eng": "I'll get you for that, you bastard!"}, {"viet": "Tôi sẽ nhớ cái cảnh tượng khủng khiếp đó cho đến lúc chết.", "eng": "I'll remember that awful sight to my dying day."}, {"viet": "Tôi e là tôi đã không kiềm chế được những bản tính xấu của mình và đánh ông ta.", "eng": "I'm afraid I gave way to my worst instincts and hit him."}, {"viet": "Tôi là người Đức, người Đức rất thích cà phê nhưng tôi chưa bao giờ nghe nói đến cà phê Trung Quốc.", "eng": "I'm from Germany, German people love coffee very much but I have never heard of Chinese coffee."}, {"viet": "Tôi liên lạc trực tiếp với bọn không tặc.", "eng": "I'm in direct contact with the hijackers."}, {"viet": "Tôi không đói lắm-tôi chỉ cần ăn sơ sơ là đủ rồi.", "eng": "I'm not very hungry-a small snack is fine for me."}, {"viet": "Tôi rất tiếc bức họa này không phải để bán.", "eng": "I'm sorry this painting's not for sale."}, {"viet": "Tôi bận quá không thể nhận công việc mới này lúc này.", "eng": "I'm too busy to take this new job on board at the moment."}, {"viet": "Mình đã tìm nó khắp nơi-thế cậu tìm thấy nó ở đâu thế?", "eng": "I've been looking for it left right and centre-where did you find it?"}, {"viet": "Tôi có đủ tiền để trả tắc xi.", "eng": "I've got enough money to pay for a taxi."}, {"viet": "Tôi không bao giờ sống ở một chỗ lâu, chắc hẳn là có dòng máu Digan trong người tôi.", "eng": "I've never lived in one place for long, it must be the Gypsy in me."}, {"viet": "Chính tôi cũng chẳng ưa măng tây nhiều đâu.", "eng": "I'm not much of an asparagus lover myself."}, {"viet": "Tôi đang làm việc dưới quyền bà ta.", "eng": "I am acting under her authority."}, {"viet": "Tôi không thể dự được vì tôi đã có một cái hẹn trước.", "eng": "I am unable to attend because of a previous engagement."}, {"viet": "Tôi bắt đầu thấy chán ngấy cảnh bạo lực liên miên được chiếu trên tivi.", "eng": "I began to sicken of the endless violence shown on television."}, {"viet": "Tôi không thể dự được cuộc họp nhưng tôi sẽ cử trợ lý của tôi thay mặt cho tôi.", "eng": "I can't attend the meeting but I'll send my assistant in my stead."}, {"viet": "Mình không thể nào xác định được cụ thể sai lầm trong lý lẽ của cô ta.", "eng": "I can't quite put my finger on the flaw in her argument."}, {"viet": "Tôi có thể hình dung anh cảm thấy ra sao rồi, bởi vì tôi cũng cảm thấy bất tiện khi chỉ đơn thuần cúi đầu chào.", "eng": "I can imagine how you feel, because I feel uncomfortable when we merely bow."}, {"viet": "Tôi không thể cho bạn bất cứ cái nào cả.", "eng": "I can't give you any."}, {"viet": "Tôi có thể thu xếp chuyện đó với Greoffrey.", "eng": "I could fix it up with Greoffrey."}, {"viet": "Tôi để quên tập nhạc của tôi ở nhà.", "eng": "I'd left my music at home."}, {"viet": "Tôi không nghĩ là anh ta đúng vì vậy tôi kiểm tra anh ta.", "eng": "I did not think he was right, so I challenged him."}, {"viet": "Tôi rất mong họ thôi không cằn nhằn về chuyện tờ hoá đơn.", "eng": "I do wish they'd stop yammering on about the size of the bill."}, {"viet": "Tôi không biết làm sao mà cô ta chịu đựng được hắn.", "eng": "I don't known how she puts up with him."}, {"viet": "Tôi không nghĩ là chúng ta đã được giới thiệu với nhau.", "eng": "I don't think we've been introduced."}, {"viet": "Tôi tin chắc là anh ta sẽ đến.", "eng": "I don't doubt that he'll come."}, {"viet": "Tôi đưa ra vài lời ám chỉ nhưng anh ta không hiểu.", "eng": "I dropped some hints but he hasn't twigged yet."}, {"viet": "Tự thấy xấu hổ vì không giúp được nhiều hơn.", "eng": "I feel rather mean for not helping more."}, {"viet": "Tôi thấy thành phố này quá trì trệ.", "eng": "I find this town too much of a backwater."}, {"viet": "Em học trường Trung học Asahikawa ở Hokkaido.", "eng": "I go to Asahikawa High School in Hokkaido."}, {"viet": "Tôi nghĩ rằng nàng xuất thân từ Ba Lan.", "eng": "I had a notion that she originally came from Poland."}, {"viet": "Tôi phải ở lại sau khi tan trường.", "eng": "I had to stay behind after school."}, {"viet": "Tôi đã nghĩ đến việc đi trượt tuyết.", "eng": "I have been thinking about going skiing."}, {"viet": "Tôi chỉ có kiến thức giới hạn về máy tính.", "eng": "I have only a limited knowledge of computers."}, {"viet": "Tôi vẫn chưa quyết định, vui lòng cho tôi thêm một vài phút nhé.", "eng": "I haven't decided yet, please give me a few more minutes."}, {"viet": "Tôi nghe nhiều tiếng la hét.", "eng": "I heard a lot of shouting."}, {"viet": "Tôi hi vọng kế hoạch này không làm thiệt hại cho tôi.", "eng": "I hope this plan doesn't backfire on me."}, {"viet": "Anh chỉ thích em để tóc kiểu đó.", "eng": "I just love your hair that way."}, {"viet": "Tôi để cuốn sách sang một bên, tắt đèn và đi ngủ.", "eng": "I laid my book aside, turned off the light and went to sleep."}, {"viet": "Tôi thích nó hơn là tôi đã nghĩ.", "eng": "I liked it better than I thought I would."}, {"viet": "Tôi sẽ tạm ứng cho anh 20 bảng Anh.", "eng": "I'll give you £ 20 on account."}, {"viet": "Tôi sẽ nói với anh tất cả những điều tôi biết.", "eng": "I'll tell you everything I know."}, {"viet": "Tôi cần uống muốn chết đi được.", "eng": "I'm desperate for a drink."}, {"viet": "Dẫu sao thì tôi cũng vừa mới ra trường.", "eng": "I'm more or less straight from school."}, {"viet": "Tôi chắc nó sẽ làm ông vừa lòng.", "eng": "I'm sure it please you."}, {"viet": "Tôi có thể và mặt khác cũng có thể không.", "eng": "I might, and then again I might not."}, {"viet": "Tôi phải học để trau dồi tiếng Anh.", "eng": "I must work to improve my English."}, {"viet": "Tôi thường đi chuyến xe lửa 7 giờ 15 tới Luân Đôn.", "eng": "I normally catch the 7.15 train to London."}, {"viet": "Tôi coi khinh anh nếu anh nghĩ đây là lối ứng xử có thể chấp nhận được.", "eng": "I pity you if you think this is an acceptable way to behave."}, {"viet": "Tôi đọc những hướng dẫn trên nhãn hiệu trước khi quyết định mua loại mứt nào.", "eng": "I read the information on the label before deciding which jam to buy."}, {"viet": "Tôi nhớ anh ấy đã nói khi lần trước anh ấy ở đây, rằng năm nay anh ấy dự định đi nghỉ một tháng.", "eng": "I remember he said when he was here last time, that he was due1 for a month's holiday this year."}, {"viet": "Tôi nhìn thấy chúng qua cửa sổ.", "eng": "I saw them through the window."}, {"viet": "Tôi phải để ra một giờ đồng hồ để đi tới Luân Đôn.", "eng": "I should allow an hour to get to London."}, {"viet": "Em bắt đầu chữa bệnh chỉ đơn giản là em thấy bất hạnh.", "eng": "I started therapy because I simply felt unhappy."}, {"viet": "Tôi đi dạy năm ngày một tuần và tôi cũng dạy thêm lớp tối nữa.", "eng": "I teach five days a week and I also teach evening classes."}, {"viet": "Tôi nghĩ mình sẽ quá kiêu căng nếu tôi định đưa ra bất cứ một lời khuyên nào.", "eng": "I think it would be arrogant if i tried to give any advice."}, {"viet": "Tôi đã nghĩ lần này anh ấy sẽ đậu.", "eng": "I thought he would pass it this time."}, {"viet": "Tôi cố hết sức nhịn cười.", "eng": "I tried hard not to laugh."}, {"viet": "Tôi đã yêu cầu Đại úy Lucas dẫn anh đi xem quanh.", "eng": "I've asked Lieutenant Lucas to show you around."}, {"viet": "Tôi muốn mua căn hộ ở Hawaii.", "eng": "I want to buy condos in Hawaii."}, {"viet": "Tôi đã có thể nghe anh trên làn sóng vô tuyến ngắn.", "eng": "I was able to pick you up on the short wave radio."}, {"viet": "Tôi mừng vì trời mưa và nước mưa đã che giấu nước mắt của tôi.", "eng": "I was glad it was raining and the rain camouflaged my tears."}, {"viet": "Tôi đã được đền bù đầy đủ cho nỗi vất vả của mình.", "eng": "I was richly rewarded for my trouble."}, {"viet": "Tôi thực sự lấy làm buồn khi được tin đó.", "eng": "I was very sad indeed to hear about it."}, {"viet": "Tôi sẽ đưa ông đến bàn của ông.", "eng": "I will show you to your table."}, {"viet": "Mình không biết năm nay ba có được nhận tiền thưởng hay không.", "eng": "I wonder if dad will receive a bonus this year."}, {"viet": "Tôi thích xe đạp nhất là xe màu xanh.", "eng": "I would like a bicycle, especially a blue one."}, {"viet": "Tôi thích một căn hộ có một nhà bếp nhỏ hơn.", "eng": "I would prefer an apartment with a smaller kitchen."}, {"viet": "Nếu như lúc nào đó chúng ta gặp lại nhau, tôi hy vọng hắn sẽ nhớ cám ơn tôi.", "eng": "If and when we ever meet again I hope he remembers to thank me."}, {"viet": "Nếu tôi mà trả tất cả các khoản nợ thì tôi hết tiền.", "eng": "If I pay all my debts I'll have no money left."}, {"viet": "Nếu ông bầu không chấp nhận vài yêu sách của đội, ông ta có thể đã phải đối phó với một cuộc nổi loạn.", "eng": "If the manager hadn't accepted some of the team's demands he could have had a mutiny on his hands."}, {"viet": "Nếu cô giữ máy chờ một lát, tôi sẽ lấy số điện thoại đó cho cô.", "eng": "If you'll hold on for a moment, I'll get the number for you."}, {"viet": "Nếu bố hít đất, nó sẽ giúp bố khỏi bị tê cứng vai.", "eng": "If you do push-ups, it will prevent you from getting stiff shoulders."}, {"viet": "Nếu bạn thích một chuyện hay thì cứ đọc tiếp.", "eng": "If you like a good story, ready on."}, {"viet": "Nếu anh muốn bán chiếc ghế bành cũ của mình, sao không đăng quảng cáo trên báo địa phương?", "eng": "If you want to sell your old sofa, why not put an advertisement in the local paper?"}, {"viet": "Họ lấy nhau trong khoảng thời gian một năm.", "eng": "In a year's time they're getting married."}, {"viet": "Trong bóng đá anh phải làm quen với các va chạm mạnh.", "eng": "In football you have to get used to hard knocks."}, {"viet": "Ở đây muốn thành công thì bạn cần khắc phục những định kiến của bạn.", "eng": "In order to succeed here you will need to overcome your prejudices."}, {"viet": "Đứng về mặt pháp luật cô ta là có tội mặc dù một số dân thường cũng nghĩ vậy.", "eng": "In the eyes of the law she is guilty though few ordinary people would think so."}, {"viet": "Trong cuộc giải phẫu này, các bác sĩ phẫu thuật gắn một thấu kính mới ( vào mắt ).", "eng": "In this operation the surgeons implant a new lens ( in the eye )."}, {"viet": "Hỏi cách chuyển tiền ra nước ngoài.", "eng": "INQUIRING ABOUT HOW TO MAKE A REMITTANCE FROM ABROAD."}, {"viet": "Đặt vị trí nhà máy điện ở đây có an toàn không?", "eng": "Is it safe to site the power-station here?"}, {"viet": "Liệu có nguy cơ quả bom nổ không?", "eng": "Is there any risk of the bomb exploding?"}, {"viet": "Đi nghỉ ở đó phải tốn khối tiền đấy!", "eng": "It'll cost a fortune to go on holiday there!"}, {"viet": "Thỉnh thoảng vay tiền thì cũng được, nhưng đừng để thành thói quen.", "eng": "It's all right to borrow money occasionally, but don't let it become a habit."}, {"viet": "Rất dễ phân biệt bơ và macgarin.", "eng": "It's easy to tell the difference between butter and margarine."}, {"viet": "Thật là may mà bố mẹ của nó lại điềm tĩnh đến thế.", "eng": "It's lucky that his parents are so equable."}, {"viet": "Nó ở trên dòng suối đổ vào con sông này ở bên ngoài thành phố.", "eng": "It's on a stream that runs into this river beyond the town."}, {"viet": "Đó là dịp dùng thức ăn của mọi người trong xóm ” khi nấu nướng.", "eng": "It's the season for using Nabe when cooking."}, {"viet": "Té ra đã có sự nhầm lẫn.", "eng": "It appears that there has been a mistake."}, {"viet": "Nó có đặc tính là trở nên mềm khi đun nóng.", "eng": "It has the property of becoming soft when heated."}, {"viet": "Điều quan trọng là bạn phải bắt đầu dự án càng sớm càng tốt.", "eng": "It is important you start the project as soon as possible."}, {"viet": "Đã đến lúc tạm ngừng cuộc tranh luận.", "eng": "It is time to call a halt to these arguments."}, {"viet": "Chưa bao giờ tôi mảy may nghĩ rằng cô ta có thể thua cuộc.", "eng": "It never crossed my mind that she might lose."}, {"viet": "Đó là một trong các kỳ quan của thế giới.", "eng": "It's one of the wonders of the world."}, {"viet": "Đi đường vòng đai sẽ nhanh hơn.", "eng": "It should be quicker if we tale the ring road."}, {"viet": "Đó là một câu hỏi hoàn toàn không có ác ý Sao lại tức tối về chuyện đó như thế?", "eng": "It was a perfectly innocent question Why get so worked up about it?"}, {"viet": "Đó là lần đầu tiên anh ấy đến thăm bố mẹ vợ.", "eng": "It was his first visit to his wife's parents."}, {"viet": "Đó là một đêm mà ma quỉ có thể hiện ra.", "eng": "It was the sort of night when phantoms might walk."}, {"viet": "Có lẽ để sau lễ tang rồi nói với bà ta sẽ thích hợp hơn.", "eng": "It would be more seemly to tell her after the funeral."}, {"viet": "Jerry Lee Lewis là một ca sĩ nhạc rốc-en-rôn.", "eng": "Jerry Lee Lewis was a rock n roll singer."}, {"viet": "Ngày ba tháng sáu là hạn cuối cùng để nộp đơn dự thi.", "eng": "June the third is the last date for submission of entries for the competition."}, {"viet": "Đổ bộ lên mặt trăng lần đầu tiên là một thành tựu xuất sắc.", "eng": "Landing on the moon for the first time was a remarkable achievement."}, {"viet": "Để tôi giải thích cho cô.", "eng": "Let me explain them to you."}, {"viet": "Luân Đôn, Pari và La Mã là các thành phố thủ đô.", "eng": "London, Paris, and Rome are capital cities."}, {"viet": "Nhiều người tán thành việc quốc hữu hoá.", "eng": "Many people agree with nationalization."}, {"viet": "Mẹ Mary đã chết, nhưng bố cô còn sống.", "eng": "Mary's mother is dead but her father is still alive."}, {"viet": "Tôi có thể xác nhận lại ngày đi của ông được không ạ?", "eng": "May I reconfirm your departure time?"}, {"viet": "Mẹ ơi, mẹ có nhiều tóc bạc rồi đấy.", "eng": "Mom, you have a lot of gray hair."}, {"viet": "Ông Brown, đây là cô Lưu.", "eng": "Mr. Brown, this is Miss Liu."}, {"viet": "Ngân hàng tôi bây giờ buôn bán cổ phiếu và cổ phần.", "eng": "My bank deals in stocks and shares now."}, {"viet": "Bố tôi đã làm áp lực với một số bạn bè để đưa tôi vào ngành Dân sự.", "eng": "My father pulled a few strings to get me into the Civil Service."}, {"viet": "Mẹ tôi đã quá già để sống một mình, vì vậy chúng tôi sửa cho thích hợp căn phòng bỏ không để bà ở.", "eng": "My mother's getting too old to live on her own, so we're fixing up the spare room for her."}, {"viet": "Người buôn bán chứng khoán của tôi quản lý danh mục vốn đầu tư của tôi.", "eng": "My stockbroker manages my portfolio for me."}, {"viet": "Đừng nản: chúng ta vẫn có thể đến đấy kịp giờ.", "eng": "Never say die: we might still get there on time."}, {"viet": "Thôi, tôi không muốn ăn nữa.", "eng": "No, I don't want it any more."}, {"viet": "Không ai dưới cấp đại uý được vào phòng.", "eng": "No one under the rank of captain may enter the room."}, {"viet": "Giờ đây anh ta đã nổi tiếng, anh ta quay lưng lại với bạn bè.", "eng": "Now that he's famous he's turned his back on his friends."}, {"viet": "Dãy đá ngầm Qreat Barrier nằm ngoài khơi bờ biển nào?", "eng": "Off which coast is the Great Barrier Reef located?"}, {"viet": "Được, đầu tiên tôi làm gì vậy?", "eng": "OK, what shall I do first?"}, {"viet": "Một khi bố mẹ chúng mất đi, chúng phải tự lo liệu lấy.", "eng": "Once their parents died, the children had to fend for themselves."}, {"viet": "Một trong những cách John mua đĩa CD mới là anh ấy đổi những cái đĩa cũ của anh ấy.", "eng": "One of the ways John buys new CDs is he trades in his old ones."}, {"viet": "Công ty chúng tôi có đại lý trên khắp thế giới.", "eng": "Our company has agencies all over the world."}, {"viet": "Cuộc sống của chúng ta bị những kẻ quan liêu giấy tờ khống chế.", "eng": "Our life is controlled by faceless bureaucrats."}, {"viet": "Thầy giáo của chúng tôi đưa một nhóm học sinh đi thư viện.", "eng": "Our teacher is talking a party of children to the library."}, {"viet": "Công viên có một lợi ích to lớn đối với người dân ở các thành phố lớn.", "eng": "Parks are a great boon to people in big cities."}, {"viet": "Người ta đóng góp một cách hào phóng vào quỹ cho nạn nhân lũ lụt.", "eng": "People have given very freely to the fund for the victims of the floods."}, {"viet": "Vui lòng bán cho tôi 5 con tem giá 60 xu.", "eng": "Please give me 5 sixty-cent stamps."}, {"viet": "Các nhà chuyên môn cung cấp dịch vụ của họ.", "eng": "Professional people offering their services."}, {"viet": "Những người nghi ngờ cho rằng những bức ảnh bí hiểm là trò bịp.", "eng": "Sceptics claimed that the mysterious photos were a hoax."}, {"viet": "Tôi để bản ghi nhớ đổi tiền ở đây nhé?", "eng": "Shall I leave the exchange memo here?"}, {"viet": "Bà ấy khó tính lắm, tôi không nghĩ bà ấy sẽ cho phép chúng ta đâu.", "eng": "She's a tough nut to crack, I don't think she'll give us permission."}, {"viet": "Cô ta nói chung là đã vỡ mộng trước cuộc đời.", "eng": "She's disillusioned with life in general."}, {"viet": "Chị ấy đang tìm một việc làm, nhưng chưa thấy được công việc nào lý tưởng.", "eng": "She's looking for a job, but hasn't found her ideal yet."}, {"viet": "Cô ấy chắc chắn là cô gái thông minh nhất lớp.", "eng": "She's surely the cleverest in the class."}, {"viet": "Cô ấy cứ để cho đầu óc của cô ấy nghĩ lan man.", "eng": "She allowed her mind to wander."}, {"viet": "Cô ta giấu mặt trong đôi bàn tay và khóc.", "eng": "She buried her face in her hands and wept."}, {"viet": "Cô ấy nghĩ tới những kế hoạch cho cho buổi tối với sự chờ đợi háo hức.", "eng": "She contemplated the plant for the evening with eager anticipation."}, {"viet": "Bà ta giặt giũ trong một nhà phụ.", "eng": "She did her washing in one of the outhouses."}, {"viet": "Chị ấy liệt kê các thứ chúng tôi phải mua: đường, chè, xà phòng, v. v.", "eng": "She enumerated the items we had to buy: sugar, tea, soap, etc."}, {"viet": "Cô ấy thấy khó đứng được trên bề mặt trơn.", "eng": "She found it difficult to keep the slippery surface."}, {"viet": "Cô ấy đã tốt nghiệp một trường đại học Pháp.", "eng": "She graduated from a French university."}, {"viet": "Cô ta có quan điểm rất cực đoan về tình yêu và hôn nhân.", "eng": "She had very black and white views on love and marriage."}, {"viet": "Cô ta cũng chẳng có gì mà phấn khởi.", "eng": "She has precious little to be cheerful about."}, {"viet": "Cô ta 16 tuổi nhưng khả năng trí tuệ chỉ ở lứa tuổi lên 5.", "eng": "She is 16 years old but has mental age of 5."}, {"viet": "Cô ta đang uống thuốc để kích thích sự rụng trứng.", "eng": "She is taking a drug to stimulate ovulation."}, {"viet": "Bà ấy để tôi nói với họ là họ bị đuổi-Bà ấy luôn luôn để tôi làm cái công việc khó chịu ấy cho bà ấy.", "eng": "She left it to me to tell them they were sacked-She always get me to do her dirty work for her."}, {"viet": "Cô ấy đã làm om sòm lên về việc anh quên ngày sinh nhật của cô ấy.", "eng": "She made a great to-do about his forgetting her birthday."}, {"viet": "Chị ấy không chỉ chơi hay mà cũng còn soạn nhạc nữa.", "eng": "She not only plays well, but also writes music."}, {"viet": "Cô ta đổ nước lên khắp bức hoạ của tôi và làm hỏng nó.", "eng": "She poured water all over my painting, and ruined it."}, {"viet": "Cô ấy nhả côn và xe bắt đầu chuyển bánh.", "eng": "She released the clutch and the car began to move."}, {"viet": "Nàng phải đến vào thứ Năm.", "eng": "She's due to arrive on Thursday."}, {"viet": "Cô ta rất chán ngán các bữa tiệc.", "eng": "She's very blasé about parties."}, {"viet": "Cô ấy dường như đã được những người đứng đắn trung thực coi như là bạn thân.", "eng": "She seems to be well in with the right people."}, {"viet": "Con bé đã mách lẻo với thầy giáo về đứa bạn tốt nhất của nó.", "eng": "She sneaked on her best friend to the teacher."}, {"viet": "Đột nhiên cô ta nói toạc ra: Tôi không đi đâu.", "eng": "She suddenly blurted out, I am not going."}, {"viet": "Cô ta uống một viên atxpirin để khỏi đau đầu.", "eng": "She took an aspirin to help her headache."}, {"viet": "Cô ấy thường để nó ở đây Hãy nghĩ xem chỗ nào đó.", "eng": "She usually keeps it in here think somewhere."}, {"viet": "Cô ta luôn luôn lạc quan, ngay cả khi tình hình tồi tệ nhất.", "eng": "She was always optimistic, even when things were at their worst."}, {"viet": "Bà ấy được bầu làm chủ tịch hội đồng.", "eng": "She was elected as chairman of the committee."}, {"viet": "Cô ta may mắn thoát tù và được hưởng án treo.", "eng": "She was lucky to get off with a suspended sentence."}, {"viet": "Cô ấy được cử đi Paris, mọi chi phí đều được thanh toán.", "eng": "She was sent to Paris, all expenses paid."}, {"viet": "Cô ấy ốm rất nặng mất mấy ngày nhưng các bác sĩ nói rằng giờ thì không còn gì đáng sợ nữa.", "eng": "She was very ill for a few days but doctors say she's now in the clear."}, {"viet": "Cô ta đã rớt nước mắt thấy anh ta ở trong tình trạng như thế.", "eng": "She wept to see him in such a state."}, {"viet": "Cô ấy làm việc ở cấp bậc cao trong ngành dân chính.", "eng": "She works in the higher echelons of the Civil Service."}, {"viet": "Vấn đề thăng cấp nên dựa vào công trạng hay là thâm niên?", "eng": "Should promotion be through merit or seniority?"}, {"viet": "Từ khi trốn thoát khỏi nhà tù, tom sống trong nơm nớp lo sợ bị bắt lại.", "eng": "Since he escaped from goal, tom has been living on a razor's edge, terrified of recapture."}, {"viet": "Hãy bỏ chương thứ nhất và bắt đầu từ trang 25.", "eng": "Skip the first chapter and start on page 25."}, {"viet": "Một tập sưu tầm linh tinh các tín ngưỡng kỳ lạ hợp thời trang.", "eng": "Smorgasbord of fashionable paranormal beliefs."}, {"viet": "Nhân loại xã hội học là một trong những khoa học xã hội.", "eng": "Social anthropology is one of the social sciences."}, {"viet": "Một số đồ ăn dễ hấp thụ hơn những đồ ăn khác.", "eng": "Some foods assimilated more easily than others."}, {"viet": "Một số người hình như thích gây rắc rối.", "eng": "Some people seem to enjoy making waves."}, {"viet": "Một số người phản đối tập tục ban phép lành của thầy tư tế Shinto cho việc xây dựng một công trình công cộng mới nào đó.", "eng": "Someone protested the custom of having Shinto priest bless the construction of a new public building."}, {"viet": "Các tên lửa không gian đang được phóng lên liên tục.", "eng": "Space rockets are being sent up all the time."}, {"viet": "Giậm giậm chân xuống đất cho ấm.", "eng": "Stamping the ground to keep warm."}, {"viet": "Các cục đá bị mòn tròn do tác động của nước.", "eng": "Stones rounded by the action of water."}, {"viet": "Kiểm duyệt khắt khe được thi hành tại một số nước.", "eng": "Strict censorship is enforced in some countries."}, {"viet": "Những tính cách như vậy tượng trưng cho một khía cạnh lố bịch được thổi phồng lên của một con người lý tưởng, nếu ta không thể nhận thức rõ được thì ta có thể tưởng tượng ra.", "eng": "Such characters represent a grotesquely blown up aspect of an ideal man, if not realizable, capable of being ideated."}, {"viet": "Sự hợp nhất đảng của chúng tôi với đảng của các bạn.", "eng": "Support the union of our party with yours."}, {"viet": "Nắm chặt cái tay cầm và kéo.", "eng": "Take a firm grasp of the handle and pull."}, {"viet": "Hãy nán lại một thời gian ở cái quán trọ đồng quê hấp dẫn này.", "eng": "Tarry a while at this charming country inn."}, {"viet": "Mười người bị chết cháy trong vụ hoả hoạn ở khách sạn.", "eng": "Ten people burnt to death in the hotel fire."}, {"viet": "Đó là một cuốn từ điển tốt, nhưng nó không thể so sánh được với cuốn này.", "eng": "That's a good dictionary, but it doesn't bear comparison with this one."}, {"viet": "Cái cô gái ở quầy trả tiền đó đúng là ngớ ngẩn-thậm chí cô ta không trả lại tiền của đồng năm đô.", "eng": "That check-out girl was a real airhead-she couldn't even make change from five dollars."}, {"viet": "Đó đúng là điều tôi muốn nói.", "eng": "That is precisely what I mean."}, {"viet": "Bức hình đó giống hệt David.", "eng": "That photo is a good likeness of David."}, {"viet": "Cửa hàng đó giảm giá tất cả những hàng không bán được.", "eng": "That store discounts all its unsold merchandise."}, {"viet": "Chuyến tàu tốc hành 7 giờ sáng đi Bristol sang tháng sau sẽ bãi bỏ.", "eng": "The 7 am express to Bristol will be taken off next month."}, {"viet": "Tác dụng của ánh sáng đối với phim ảnh.", "eng": "The action of light on photographic film."}, {"viet": "Sự thường xuyên sai lầm đến mức báo động của máy vi tính.", "eng": "The alarming frequency of computer errors."}, {"viet": "Đối loga của 2 là 100 bởi vì 10² = 10.", "eng": "The antilogarithm of 2 is 100 because 10² = 10."}, {"viet": "Sự sắp xếp chi tiết đã được hoàn tất nhanh chóng.", "eng": "The arrangement of the details was quickly accomplished."}, {"viet": "Khán giả bị say mê trong vở kịch.", "eng": "The audience were caught up in the play."}, {"viet": "Thịt muối rán già lửa bị cháy hết!", "eng": "The bacon is all frizzled up!"}, {"viet": "Thanh sắt rơi vào máy làm gãy thanh truyền lực.", "eng": "The bar fell into the machinery and sheared a connecting-rod."}, {"viet": "Người ăn mày dùng ngôn ngữ tục tĩu với lũ trẻ vì chúng đã làm anh ta bực mình.", "eng": "The beggar used obscene language on the boys who annoyed him."}, {"viet": "Cuộc tranh luận gay gắt đã làm cảm xúc của cô ta khuấy lên bên trong.", "eng": "The bitter argument left her feeling churned up inside."}, {"viet": "Cuộc ném bom đã biến trại lính thành một nơi hết sức đau đớn về xác thịt.", "eng": "The bombing turned the barracks into a charnel house."}, {"viet": "Cái miệng chai bị ren lệch.", "eng": "The bottle-top has been screwed on squint."}, {"viet": "Tiếng lừa kêu cho biết đoàn lữ hành đang tới gần.", "eng": "The bray of donkeys announced the approach of the caravan."}, {"viet": "Viên đạn xuyên suốt vai anh ta.", "eng": "The bullet went clean through his shoulder."}, {"viet": "Chiến dịch ủng hộ một Ailen thống nhất.", "eng": "The campaign for a united Ireland."}, {"viet": "Xe hơi ở trong bãi đậu xe.", "eng": "The car is in the parking lot."}, {"viet": "Những lý lẽ tán thành việc huỷ bỏ án tử hình.", "eng": "The case for the abolition of the death penalty."}, {"viet": "Trước đây ông chủ tịch và tôi đã tranh luận với nhau về vấn đề này.", "eng": "The chairman and I have crossed swords before over this issue."}, {"viet": "Cá tính của đứa bé chưa phát triển đầy đủ.", "eng": "The child's character is as yet unformed."}, {"viet": "Đứa nhỏ vừa la hét vừa chà đạp.", "eng": "The child was screaming and kicking."}, {"viet": "Tôi tin chắc là bọn trẻ lại giở trò nghịch ngợm gì đây!", "eng": "The children me up to so me mischief, I'll be bound!"}, {"viet": "Vượn là một loài đang có nguy cơ.", "eng": "The chimpanzee is an endangered species."}, {"viet": "Bóng dáng rõ ràng của những ngọn núi nổi bật trên bầu trời.", "eng": "The clear-cut outline of the mountains against the sky."}, {"viet": "Nách áo khoác cần được nới ra thêm.", "eng": "The coat needs to be eased under the armpits."}, {"viet": "Ủy ban đã quyết định vấn đề đó nằm trong phạm vi cứu xét của mình.", "eng": "The committee decided that the matter lay within its terms of reference."}, {"viet": "Công ty đang làm ăn phát đạt trong năm nay.", "eng": "The company is riding high this year."}, {"viet": "Bà nghị sĩ quốc hội bàn bạc với cố vấn của mình về vấn đề này.", "eng": "The congresswoman is conferring with her advisors on the matter."}, {"viet": "Các cuộc hội họp quốc tế ở Đại hội đồng Liên hiệp quốc.", "eng": "The cosmopolitan gatherings at the United National Assembly."}, {"viet": "Đôi vợ chồng đó đã từ bỏ tự do riêng để giúp đỡ những người kém may mắn.", "eng": "The couple forfeited their independence in order to help those less fortunate."}, {"viet": "Sự phê bình làm tổn thương tính đa cảm của người nghệ sĩ.", "eng": "The criticism hurt the artist's sensibilities."}, {"viet": "Giá trị chữa bệnh của ánh nắng mặt trời và không khí ở biển.", "eng": "The curative value of sunshine and sea air."}, {"viet": "Ngày mà chiến tranh bùng nổ.", "eng": "The day that war broke out."}, {"viet": "Dân giang hồ ở các sòng bạc và các quán rượu nhếch nhác.", "eng": "The demi-monde of gambling clubs and sleazy bars."}, {"viet": "Nhà độc tài đó cố gắng bưng bít tất cả những sự chỉ trích về ông ta.", "eng": "The dictator tried to suppress all criticism of him."}, {"viet": "Sự phân biệt giữa Bà với Cô và những đặc tính biểu lộ nhiều ý nghĩa của nó.", "eng": "The distinction between Mrs and Miss and its concomitant revelatory features."}, {"viet": "Bác sĩ làm việc ở khu truyền giáo.", "eng": "The doctor works at the mission."}, {"viet": "Con chó quá già yếu nên phải giết chết.", "eng": "The dog was so old and weak that he had to be put away."}, {"viet": "Người tài xế đã bị văng ra khỏi chiếc xe mui trần khi nó đâm.", "eng": "The driver was shot out of the open car as it crashed."}, {"viet": "Người chủ biên đã gạch bỏ toàn bộ đoạn văn đó.", "eng": "The editor struck out the whole paragraph."}, {"viet": "Quân thù đã bị đánh bại trong một trận quyết định.", "eng": "The enemy was defeated in a decisive battle."}, {"viet": "Giải vô địch châu Âu hiện đang được tổ chức ở Rome.", "eng": "The European championships are being held in Rome."}, {"viet": "Vụ nổ ở xưởng lọc dầu là do phá hoại.", "eng": "The explosion at the oil refinery was caused by the sabotage."}, {"viet": "Nạn đói quá trầm trọng nên viện trợ chỉ có thể giải quyết được phần nào thôi.", "eng": "The famine is so bad, aid can only scratch the surface."}, {"viet": "Người chận bóng đã hụt một cú rất dễ.", "eng": "The fielder muffed an easy catch."}, {"viet": "Mục tài chính của tờ báo.", "eng": "The financial section of the newspaper."}, {"viet": "Vị nữ phó chủ tịch chưa từng có.", "eng": "The first-ever woman vice-president."}, {"viet": "Những hình ảnh dập dờn trên màn ảnh.", "eng": "The flicker of pictures on the cinema screen."}, {"viet": "Vị ngoại trưởng đó trình bày quan điểm của chính phủ với một lối nói giảm nhẹ điển hình.", "eng": "The Foreign Secretary expressed the government view with typical understatement."}, {"viet": "Chức năng của dao là để cắt.", "eng": "The function of a knife is to cut things."}, {"viet": "Điều phổ thông, thông thường, thường thấy, đã được xác lập, v. v. là..", "eng": "The general, common, usual, established, etc thing is to..."}, {"viet": "Thủ môn đã đạt một quả cứu nguy tuyệt vời.", "eng": "The goalkeeper brought off a superb save."}, {"viet": "Chính phủ sợ cuộc đình công sẽ tạo ra phản ứng dây truyền trong các ngành công nghiệp khác.", "eng": "The government fear the strike may produce a chain reaction in other industries."}, {"viet": "Chính phủ phải hành động để giúp đỡ người nghèo.", "eng": "The government must take action to help the poor."}, {"viet": "Sống trên một con đường chính thì trở ngại lớn là tiếng ồn thường xuyên.", "eng": "The great drawback to living on a main road is the constant noise."}, {"viet": "Vị khách danh dự tại một buổi tiệc.", "eng": "The guest of honour at a banquet."}, {"viet": "Ông hiệu trưởng tịch thu cây súng bắn hạt đậu của Tom.", "eng": "The headmaster confiscated Tommy's pea-shooter."}, {"viet": "Ngọn đồi dốc đến nỗi tôi nghĩ rằng chúng tôi sẽ chẳng bao giờ trèo lên tới đỉnh.", "eng": "The hill was so steep that I thought we'd never get to the top."}, {"viet": "Ánh nắng nóng bỏng chiếu xuống cảnh vật.", "eng": "The hot sun shone down on the scene."}, {"viet": "Căn nhà đứng chơ vơ một mình ngoài làng.", "eng": "The house stands by itself outside the village."}, {"viet": "Tình trạng ốm yếu có thể phát triển theo hai cách: thứ nhất trong các ca bị huyết áp cao và thứ hai...", "eng": "The illness can develop in two ways: firstly, in cases of high blood pressure and secondly..."}, {"viet": "Sự thừa hưởng vẻ đẹp của cha mẹ mình.", "eng": "The inheritance of good looks from one's parents."}, {"viet": "Sự phát minh ra bánh xe là một mốc quan trọng trong lịch sử nhân loại.", "eng": "The invention of the wheel was a milestone in human history."}, {"viet": "Vị thẩm phán yêu cầu các phóng viên không công bố tên của nạn nhân bị giết.", "eng": "The judge asked the reporters not to disclose the name of the murder victim."}, {"viet": "Nhà vua đã đạt đến đẳng cấp thần thánh sau cái chết của ông.", "eng": "The king attained deity after his death."}, {"viet": "Chặng cuối chuyến đi của chúng tôi là chặng mệt nhất.", "eng": "The last leg of our trip was the most tiring."}, {"viet": "Những chiếc lá rung rinh trong làn gió nhẹ.", "eng": "The leaves flickered gently in the breeze."}, {"viet": "Ánh sáng làm mù mắt kẻ thù và do đó bảo vệ cho tôm bằng cách tạo cơ hội trốn thoát.", "eng": "The light is believed to blind enemies and thus protect the shrimp by giving them a chance to escape."}, {"viet": "Cái áo dài trắng và rộng thùng thình của người ả rập có tác dụng chống lại ánh nắng và giữ cho anh ta khỏi bị quá nóng lúc đi trên sa mạc.", "eng": "The loose, white robes of the Arab reflect of glaring sunlight and keeping him from getting too hot as he goes about in the desert."}, {"viet": "Quan tòa ra lệnh tạm giam anh ta trong hai tuần.", "eng": "The magistrate remanded him in custody for two weeks."}, {"viet": "Tòa nhà và đất đai thuộc về nó.", "eng": "The manor and the land pertaining to it."}, {"viet": "Người nông dân thấp kém nhất cũng có những quyền như người địa chủ giàu có nhất.", "eng": "The meanest labourer has the same rights as the richest landowner."}, {"viet": "Kim loại đã bị ăn mòn dần do gỉ.", "eng": "The mental has corroded because of rust."}, {"viet": "Tên lửa được phóng đi từ dưới mặt đất.", "eng": "The missile is delivered from underground."}, {"viet": "Buổi sáng trong như kim cương hoặc như ngọc thạch.", "eng": "The morning is as clear as diamond or as hyalin."}, {"viet": "Các dạng sinh vật đa dạng có thể tìm thấy trong bãi san hô ngầm.", "eng": "The multifarious life-forms that can be found in a coral reef."}, {"viet": "Các nhà thương thuyết đạt được sự thoả thuận đại thể về những vấn đề chính.", "eng": "The negotiators reached broad agreement on the main issues."}, {"viet": "Ông giám đốc mới đã truyền sức sống mới cho công ty.", "eng": "The new manager has breathed fresh life into the company."}, {"viet": "Tin tức về việc này được in trên trang nhất ngày hôm sau.", "eng": "The news appeared next day on the front page."}, {"viet": "Sông Nin đổ vào Địa Trung Hải.", "eng": "The Nile discharges into the Mediterranean."}, {"viet": "Cô y tá với tư cách là người an ủi các bệnh nhân.", "eng": "The nurse as comforter of the sick."}, {"viet": "Thị trường dầu lửa đang được thời thịnh vượng.", "eng": "The oil market is enjoying the boom."}, {"viet": "Thế vận hội Olympic đang được truyền hình trực tiếp khắp thế giới.", "eng": "The Olympic is being transmitted all over the world."}, {"viet": "Chiếc còn lại bắc qua sông Firth of Forth ở Scotland.", "eng": "The other is over the Firth of Forth in Scotland."}, {"viet": "Bưu kiện đó bị hư hại ở bưu điện.", "eng": "The parcel was damaged in the post."}, {"viet": "Bệnh nhân dường như tỉnh táo hoàn toàn.", "eng": "The patient appeared to be perfectly rational."}, {"viet": "Những người đến phần lớn là sinh viên.", "eng": "The people who came were mainly students."}, {"viet": "Bức tranh mô tả một cảnh săn bắn.", "eng": "The picture represents a hunting scene."}, {"viet": "Kế hoạch thất bại ngay từ đầu.", "eng": "The plan was doomed from the start."}, {"viet": "Vở kịch là một sự chỉ trích xã hội hiện đại.", "eng": "The play is a comment on modern society."}, {"viet": "Cảnh sát đặt thưởng cho thông tin về vụ cướp.", "eng": "The police are offering a reward for information about the robbery."}, {"viet": "Cảnh sát khám ngôi nhà một cách kỹ lưỡng.", "eng": "The police made a thorough search of the house."}, {"viet": "Viên cảnh sát đã bị đình chỉ công tác khi đơn khiếu nại đang được điều tra.", "eng": "The policeman was suspended while the complaint was investigated."}, {"viet": "Người đưa thư cố gắng nhét gói đó vào thùng thư.", "eng": "The postman tried to crush the packet through the letter-box."}, {"viet": "Việc tổng thống nói chuyện trên ti-vi không phải là một chương trình giáo dục.", "eng": "The President appearing on a T. V chat show was not an edifying spectacle."}, {"viet": "Giá của sản phẩm này sắp được điều chỉnh bởi vì sự gia tăng giá nguyên liệu gần đây.", "eng": "The price of this product will be revised soon because of the recent rise in the cost of materials."}, {"viet": "Tên tù lẻn qua mặt những lính gác ở cổng rồi chuồn mất.", "eng": "The prisoner slipped past the guards on the gate and escaped."}, {"viet": "Dự án đòi hỏi chi phí đáng kể.", "eng": "The project entails considerable expenses."}, {"viet": "Vụ xì căn đan công khai đã để lại một vết nhơ trong sự nghiệp của ông ta.", "eng": "The public scandal left a black mark on his career."}, {"viet": "Nữ hoàng được chào đón tưng bừng ở bất cứ nơi nào bà đến thăm.", "eng": "The queen was fêted wherever she went."}, {"viet": "Tỉ giá ngoại tệ thường biến động theo thị trường tiền tệ quốc tế.", "eng": "The rates for foreign currencies often fluctuate with the international money market."}, {"viet": "Họ từ chối tham dự bất cứ cuộc bạo động nào.", "eng": "The refused to be party to any violence."}, {"viet": "Trách nhiệm thuộc về chủ toạ.", "eng": "The responsibilities appertaining to the chairmanship."}, {"viet": "Các quyền lợi của cá nhân so với các quyền lợi của toàn xã hội.", "eng": "The rights of an individual compared with those of society as a whole."}, {"viet": "Con đường ngoằn ngoèo qua rặng đồi.", "eng": "The road weaves through the range of hills."}, {"viet": "Tuyến đường này được bố trí để giảm bớt sự tắc nghẽn giao thông.", "eng": "The route was designed to relieve traffic congestion."}, {"viet": "Việc bán hàng dự kiến sẽ kéo dài trong một tuần, nhưng trên thực tế nó đã kết thúc rồi.", "eng": "The sale was supposed to last for a week, but for all practical purposes it's over."}, {"viet": "Nhà trường được điều hành theo đường lối độc đoán.", "eng": "The school is run on authoritarian lines."}, {"viet": "Kẻ tự phong là cứu tinh của nhân dân thực tế là một kẻ độc tài.", "eng": "The self-styled saviour of his people is in fact a dictator."}, {"viet": "Sau đó tờ giấy đó được gập lại nhiều lần cho tới khi tạo thành một tập các trang sách.", "eng": "The sheet is then folded over and over so that it makes a bundle of pages."}, {"viet": "Cú sốc đó làm anh ta trông già đi.", "eng": "The shock put years on him."}, {"viet": "Hiệu lệnh đã phát ra và đoàn diễu hành bắt đầu tiến bước.", "eng": "The signal was given, and the procession moved off."}, {"viet": "Ô cửa sổ nhỏ nhận được rất ít ánh sáng.", "eng": "The small window admitted very little light."}, {"viet": "Những người lính lại tấn công vào thành phố.", "eng": "The soldiers renewed their attack on the town."}, {"viet": "Diễn giả nói dông dài thành mất định hướng.", "eng": "The speaker lost himself in verbiage."}, {"viet": "Ngôi sao đó bị đẩy vào một chiếc ôtô loại chạy nhanh và lái đi mất.", "eng": "The star was whipped into a fast car and driven off."}, {"viet": "Câu chuyện trong báo không đúng sự thật, các sự kiện đã bị báo cáo sai lệch.", "eng": "The story in the newspaper isn't true, the facts have been misreported."}, {"viet": "Tiểu ban sẽ đưa ra cấu trúc của việc thành lập kế hoạch.", "eng": "The subcommittee will work out the mechanics of setting up the scheme."}, {"viet": "Những người sống sót đã phải chịu nhiều sự thiếu thốn trước khi được cứu.", "eng": "The survivors suffered many privations before they were rescued."}, {"viet": "Giáo viên đang chỉ cho chúng cách làm dải vải quấn đầu và sau đó ông sẽ chỉ cho chúng cách gắn lông chim vào.", "eng": "The teacher is showing them how to make the headband and then he will show them how to put on the feathers."}, {"viet": "Gần đây nhiệt độ đã lên cao hơn mức trung bình.", "eng": "The temperature has been above the average recently."}, {"viet": "Bọn trộm đã lấy mất đồ kim hoàn trị giá một triệu pao.", "eng": "The thieves stole 1 million pounds worth of jewellery."}, {"viet": "Nỗi thống khổ của sự hồi hộp chờ đợi, sợ hãi, ghen tuông, v. v.", "eng": "The tortures of suspense, fear, jealousy, etc."}, {"viet": "Người phi công thực tập hôm nay bay chuyến bay một mình đầu tiên.", "eng": "The trainee pilot flew his first solo today."}, {"viet": "Đi vào sâu hơn, đường hầm thu lại thành một lối đi hẹp.", "eng": "The tunnel contracts to a narrow passageway as you go deeper."}, {"viet": "Hai câu chuyện mâu thuẫn với nhau, vì thế tôi không biết tin thế nào.", "eng": "The two stories conflicted, so I did not know what to believe."}, {"viet": "Hoa Kỳ và Liên Xô là hai bên cùng ký hiệp ước.", "eng": "The US and the Soviet Union were co-signatories to the treaty."}, {"viet": "Cả làng ồn ào náo động khi được tin nữ hoàng sẽ tới thăm.", "eng": "The village was buzzing with excitement at the news of the Queen's visit."}, {"viet": "Nước chảy mòn đá thành rãnh.", "eng": "The water had worn a channel in the rock."}, {"viet": "Toàn bộ tương lai của công ty bị đe doạ.", "eng": "The whole future of the company is at risk."}, {"viet": "Các dây điện nối với nhau ở dưới mặt sàn.", "eng": "The wires connect under the floor."}, {"viet": "Phân xưởng đó đã phải đóng cửa và công nhân thất nghiệp.", "eng": "The workshop has shut down and the workers are unemployed."}, {"viet": "Hội nghị của họ giống như quốc hội của chúng ta.", "eng": "Their assembly correspond to our parliament."}, {"viet": "Cuộc hôn nhân của họ trải qua một thời kỳ khó khăn.", "eng": "Their marriage is going through a sticky patch."}, {"viet": "Vậy còn tài khoản vãng lai thì sao?", "eng": "Then how about the current account?"}, {"viet": "Có một cửa hàng miễn thuế ở bến phà.", "eng": "There's a good duty-free shop on the ferry."}, {"viet": "Không thấy mục nhập trong sổ nhật ký của anh ấy hôm đó.", "eng": "There's no entry in his diary for that day."}, {"viet": "Vẫn còn một chút ngờ vực day dứt tâm hồn tôi.", "eng": "There's still a doubt niggling at my brain."}, {"viet": "Có nhiều sách báo xuất bản về vấn đề này.", "eng": "There are many publications on the subject."}, {"viet": "Có hai lần lấy thư mỗi ngày ở hòm thư này.", "eng": "There are two collections a day from this letter-box."}, {"viet": "Việc ăn sò có một điều lí thú kì diệu nào đó.", "eng": "There is a certain mystique about eating oysters."}, {"viet": "Chỉ có 3 người chúng tôi là tôi, vợ và đứa con gái.", "eng": "There is just the three of us, myself, my wife and daughter."}, {"viet": "Không có đủ chỗ để ghi địa chỉ của tôi.", "eng": "There isn't enough space for my address."}, {"viet": "Có một toà nhà bị tàn phá trên đỉnh đồi.", "eng": "There was a ruin on the top of the hill."}, {"viet": "Có 200 người có mặt tại buổi họp.", "eng": "There were 200 people present at the meeting."}, {"viet": "Những hành động này nêu bật ông là người có những nguyên tắc cao.", "eng": "These actions stamp him as a man of high principles."}, {"viet": "Những con côn trùng này được nhìn rõ nhất là qua kính hiển vi.", "eng": "These insects are best seen through a microscope."}, {"viet": "Đôi giày chật này làm giộp mắt cá chân tôi.", "eng": "These tight shoes have given me blisters on my ankles."}, {"viet": "Họ đã quyết định về chung sống với nhau ở căn hộ của cô ta.", "eng": "They've decided to shack up together in her flat."}, {"viet": "Họ đang tổ chức một cuộc tập hợp lớn để phản đối chính sách phòng thủ của chính phủ.", "eng": "They are holding a rally to protest against the government's defence policy."}, {"viet": "Chúng cùng nhau mang đến vẻ đẹp của thiên nhiên, kiến trúc và hội hoạ.", "eng": "They bring together the beauties of nature, architecture and painting."}, {"viet": "Họ nhảy múa để cử hành lễ chiến thắng trong chiến tranh.", "eng": "They danced to celebrate a victory in war."}, {"viet": "Họ không làm được những thay đổi cần thiết trong hệ thống do sự trì trệ hoàn toàn.", "eng": "They failed to make a needed change in the system through sheer inertia."}, {"viet": "Họ lôi cái thuyền lên bờ.", "eng": "They hauled the boat up onto the shore."}, {"viet": "Họ đi Tây Ban Nha sáng sớm nay.", "eng": "They left for Spain early this morning."}, {"viet": "Chúng cần rất nhiều khí hậu nóng ẩm.", "eng": "They need much warmth."}, {"viet": "Ở đàng kia họ bán mấy cái ca vát kìa.", "eng": "They're selling neckties over there."}, {"viet": "Tối qua họ đã chiếu nó trên tivi.", "eng": "They showed it on TV last night."}, {"viet": "Đã có dấu hiệu báo trước mùa hát kịch sắp đến.", "eng": "They ushered in the new theatre season."}, {"viet": "Họ tràn đầy kinh ngạc trước cảnh tượng đó.", "eng": "They were filled with wonder at the sight."}, {"viet": "Họ thắng trận đầu nhưng sau đó sự việc trở nên tồi tệ hơn.", "eng": "They won the first game but after that things went downhill."}, {"viet": "Cuốn sách này rất hay, chỉ phải cái là hơi đắt.", "eng": "This book's very good, only it's rather expensive."}, {"viet": "Giáo trình này được soạn làm phần mở đầu cho môn học.", "eng": "This course is designed as an introduction to the subject."}, {"viet": "Cái máy đo này cho anh biết lượng xăng của anh còn lại.", "eng": "This gauge tells you the amount of petrol you have left."}, {"viet": "Đây là lần đầu tiên tôi đi thăm nước ngoài.", "eng": "This is my first visit abroad."}, {"viet": "Luật này áp dụng cho nhà hát, rạp chiếu bóng và những nơi hoạt động giải trí công cộng khác.", "eng": "This law applies to theatres, cinemas, and other places of public entertainment."}, {"viet": "Gã thường ngày lặng lẽ này vừa mới khùng lên và bắn mười người.", "eng": "This ordinary quiet guy just freaked out and shot ten people."}, {"viet": "Cuộc nổi loạn này chỉ là một sự biểu thị nỗi bất bình của quần chúng.", "eng": "This riot is only one manifestation of people's discontent."}, {"viet": "Quyển sách giáo khoa này đã được nhiều nước chấp nhận.", "eng": "This textbook has had adoptions in many countries."}, {"viet": "Những công nhân nam nữ trên đỉnh đó đang ở trên tầng mười.", "eng": "Those men and women on the top are on the tenth floor."}, {"viet": "Bà biết bây giờ là kỷ nguyên giải phóng phụ nữ mà.", "eng": "Today is the era of women's lib, you know."}, {"viet": "Lật nó qua, và gấp mỗi góc vào chính giữa thêm lần nữa.", "eng": "Turn it over, and fold each corner to the center again."}, {"viet": "Các vụ tội phạm bạo lực đang gia tăng ở Nhật Bản.", "eng": "Violent crimes are on the increase in Japan."}, {"viet": "Chúng ta phải năng nổ nhiều hơn nữa nếu chúng ta muốn hoàn thành đúng thời hạn.", "eng": "We'd better look lively if we're to finish in time."}, {"viet": "Chúng tôi đã sử dụng tất cả khoảng không gian có thể có được.", "eng": "We're already used up all the available space."}, {"viet": "Trong cuộc thi tiếp theo, chúng tôi sẽ chèo thuyền đua với Cambridge.", "eng": "We're rowing Cambridge in the next race."}, {"viet": "Chúng tôi đã quen biết nhau từ khi còn nhỏ tuổi.", "eng": "We've known each other since we were children."}, {"viet": "Chúng tôi xin lỗi vì máy bay đến chậm.", "eng": "We apologize for the late arrival of the aircraft."}, {"viet": "Chúng ta hết sức quan tâm đến việc giành lấy sự ủng hộ của quần chúng.", "eng": "We are vitally concerned to win public support."}, {"viet": "Hai chúng tôi cùng góp chung mua một căn nhà.", "eng": "We can afford to buy a house between us."}, {"viet": "Chúng tôi tham khảo những giáo sư uyên bác nhất.", "eng": "We consulted the most learned professors."}, {"viet": "Chúng tôi không có quan hệ gì nhiều với các láng giềng.", "eng": "We don't have very much to do with our neighbours."}, {"viet": "TV của chúng tôi có hình rõ nhưng âm thanh lại quá tệ.", "eng": "We get good vision but poor sound on this set."}, {"viet": "Chúng tôi phải nói như hét lên vì nhạc chơi quá to.", "eng": "We had to shout because the music was so loud."}, {"viet": "Chúng ta còn chưa ước lượng giá thích hợp của hợp đồng.", "eng": "We have not estimated the proper price for the contract yet."}, {"viet": "Chúng tôi nhảy lên ôtô và lao tới bến phà.", "eng": "We jumped into the car and made a dash for the ferry."}, {"viet": "Chúng tôi đã chuẩn bị giường trong buồng trống cho khách.", "eng": "We made up the bed in the spare room for our guest."}, {"viet": "Chúng ta không được quên những thường.", "eng": "We must not forget about the grassroots."}, {"viet": "Chúng tôi chỉ bán loại vải chất lượng tốt nhất.", "eng": "We only sell cloth of the finest quality."}, {"viet": "Trong lúc tắc đường xe chúng tôi dừng lại cái nọ sát đuôi cái kia.", "eng": "We sat bumper-to-bumper in the traffic jam."}, {"viet": "Chúng tôi nhận ra được ba người từ xa.", "eng": "We spied three figures in the distance."}, {"viet": "Chúng tôi đợi nước thuỷ triều để đẩy con thuyền nổi lên khỏi bãi cát.", "eng": "We waited for the tide to float the boat off the sandbank."}, {"viet": "Chúng tôi được biết là chỗ trọ không phải trả tiền.", "eng": "We were given to understand that the accommodation was free."}, {"viet": "Chúng tôi được 500 pao, không ít hơn, trong một cuộc thi đấu.", "eng": "We won 500 pounds, no less, in a competition."}, {"viet": "À, tôi là sinh viên năm thứ nhất ở trường Đại học ABC.", "eng": "Well, I'm a freshman at ABC University."}, {"viet": "À, chúng tôi có thể trả một món tiền nào đó trước cho thẻ tín dụng của ông.", "eng": "Well, we can advance a certain sum of money against your credit card."}, {"viet": "Tôi nghe nói anh bị mất việc làm, có chuyện gì vậy?", "eng": "What's this business I hear about you losing your job?"}, {"viet": "Bạn sẽ làm gì vào thứ bảy?", "eng": "What are you doing on Saturday?"}, {"viet": "Ông nghĩ gì về hội nghị này?", "eng": "What do you thing of the Convention, then?"}, {"viet": "Suy nghĩ của anh ấy về cuộc đời tác giả của anh ấy là thế nào?", "eng": "What is his reflection on his own auctorial life?"}, {"viet": "Bạn thích nhất ngày nào trong tuần?", "eng": "What is your favorite day of the week?"}, {"viet": "Ở nước bạn, đảng chính trị nào đang nắm quyền?", "eng": "What political party is in power in your country?"}, {"viet": "Thưa ông, ông muốn chúng tôi trở lại vào lúc mấy giờ?", "eng": "What time would you like us to come back, sir?"}, {"viet": "Tôi cần phải trả lại xe vào lúc nào?", "eng": "When do I need to return the car?"}, {"viet": "Khi tôi thấy hắn có súng, tôi biết đời tôi thế là hết.", "eng": "When I saw he had a gun, I knew it was curtains for me."}, {"viet": "Khi vị khách nước ngoài đến, bạn đích thân đi đón ông ấy là cách cư xử tốt hay ít nhất, cử một đại diện ra đón ông ấy tại sân bay.", "eng": "When the foreign guest arrives, it's good manners for you to meet him in person, or at least, to send a representative to meet him at the airport."}, {"viet": "Khi bạn ở một mình thì mùa Giáng sinh thật buồn tẻ.", "eng": "When you're alone, Christmas is the pits."}, {"viet": "Sự thất bại của chúng ta quy lỗi về đâu?", "eng": "Where does the blame for our failure lie?"}, {"viet": "Ông thích thể loại nào hơn, hoà nhạc pop hay hoà nhạc cổ điển?", "eng": "Which form do you like better, a pop concert or a classical concert?"}, {"viet": "Những vạch trắng chia khu vực chơi thành nhiều khu.", "eng": "White lines divide the playing area into sections."}, {"viet": "Cái cô gái xinh đẹp mà cậu tán tỉnh tối hôm qua là ai vậy?", "eng": "Who was that pretty girl you were chatting up last night?"}, {"viet": "Tại sao chúng ta không ăn trưa nhỉ?", "eng": "Why don't we have lunch?"}, {"viet": "Mối bất hoà giữa Tom và Sue có nghĩa là họ sẽ ly dị nhau không?", "eng": "Will Tom and Sue's quarrel mean divorce??"}, {"viet": "Thứ rượu để lại một dư vị khó chịu ( trong mồm ).", "eng": "Wine which leaves an unpleasant aftertaste ( in the mouth )."}, {"viet": "Không có chất nguyên sinh thì tế bào không thể nào sống được.", "eng": "Without protoplasm, cells would not be alive."}, {"viet": "Mời ông uống một tách trà trong lúc chờ nhé?", "eng": "Would you care for a cup of tea while you're waiting?"}, {"viet": "Bạn có thích xem kịch không?", "eng": "Would you like to see a play?"}, {"viet": "Quấn trong những nếp lùng thùng của một cái chăn.", "eng": "Wrapped in the voluminous folds of a blanket."}, {"viet": "Phải tôi biết có nhiều nơi đáng thăm, nhưng đôi khi cũng khó đến nơi mình muốn.", "eng": "Yes, I know there are many places worth seeing, but it's sometime to hard to go just where you want."}, {"viet": "Bạn nên phóng lên máy bay thật lẹ, trước khi bà ta bắn bạn đấy!", "eng": "You'd better get on the plane as fast as you can, before she shoots you!"}, {"viet": "Anh sẽ chẳng bao giờ lấy lại được quả bóng đó-nó mất tiêu rồi.", "eng": "You'll never get that ball back-it's lost forever."}, {"viet": "Kể từ lần trước gặp anh, anh đã thay đổi nhiều.", "eng": "You've changed a lot since I last saw you."}, {"viet": "Anh không thể bỏ em được-đấy là một cơn ác mộng em không thể tin được!", "eng": "You can't be leaving me-this is a bad dream!"}, {"viet": "Ông có thể đòi tiền lại nếu hàng hoá bị hư hỏng.", "eng": "You can claim your money back if the goods are damaged."}, {"viet": "Anh không thể vào một căn cứ quân sự nếu không có giấy phép.", "eng": "You cannot enter a military base without a permit."}, {"viet": "Anh đi qua hai dãy phố rồi quẹo phải.", "eng": "You go two blocks, then turn right."}, {"viet": "John, Anh biết đây chỉ là lần thứ nhì tôi xem đấu bóng đá của Mỹ.", "eng": "You know, John, this is only the second American football match."}, {"viet": "Có lẽ lần tới anh nên nghĩ đến việc thuê một chiếc thuyền và thử vận may ngoài khơi xem sao.", "eng": "You might think about renting a boat next time and trying your luck further out."}, {"viet": "Anh không được để hắn đối xử tệ bạc với anh như vậy.", "eng": "You mustn't let him walk over you like that."}, {"viet": "Em phải tránh không được đi học muộn.", "eng": "You should avoid being late for your class."}, {"viet": "Anh đừng nên coi báo chí như là Kinh Thánh.", "eng": "You shouldn't treat the newspapers as if they were Holy Writ."}, {"viet": "Anh sẽ phải quảng cáo sản phẩm mới để bán được hàng vì có rất nhiều đối thủ cạnh tranh.", "eng": "You will have to push the new product to win sales-there's lots of competition."}, {"viet": "Cuốn từ điển của anh trông có vẻ hơi cũ rồi.", "eng": "Your copy of the dictionary is looking a bit the worse for wear."}, {"viet": "Cử chỉ của con trai anh khá là sàm sỡ trước mặt các thầy giáo của nó.", "eng": "Your son's manner is rather free in the presence of his teachers."}]