[{"viet": "Ở đây người ta nói ban hợp xướng \"Chorus Line\" đang biểu diễn ở rạp Hartford.", "eng": "\"Chorus Line\" is at the Hartford Theater, it says here."}, {"viet": "Một cuộc tranh chấp biên giới có thể dễ biến thành một cuộc chiến tranh.", "eng": "A border dispute that could easily become a war."}, {"viet": "Một cây Giáng Sinh được trang hoàng bằng dây kim tuyến.", "eng": "A Christmas tree ornamented with tinsel."}, {"viet": "Một cái khay đồng mạ bạc.", "eng": "A copper tray plated with silver."}, {"viet": "Một bằng cấp về môn lịch sử và địa lý.", "eng": "A degree in history and geography."}, {"viet": "Một giọt sữa hòa tan vào nước và nó trở nên mờ đục.", "eng": "A drop of milk diffused in the water, and it became cloudy."}, {"viet": "Tỷ số cuối cùng là hai phát trúng, sáu phát trượt.", "eng": "A final score of two hits and six misses."}, {"viet": "Một bộ phim Đức lồng tiếng Anh.", "eng": "A German film dubbed into English."}, {"viet": "Một đứa trẻ đang lớn cần được ngủ nhiều.", "eng": "A growing child needs plenty of sleep."}, {"viet": "Một kỳ nghỉ có thể sẽ tuyệt vời nhưng thực tế là chúng ta không có đủ điều kiện để thực hiện.", "eng": "A holiday would be wonderful but the fact of the matter is that we can't afford one."}, {"viet": "Một cái hồ nước mặn lúc nhúc cá nhiệt đới.", "eng": "A lagoon that pullulated with tropical fish."}, {"viet": "Một đường thẳng vẽ vuông góc với một đường khác.", "eng": "A line drawn perpendicular to another."}, {"viet": "Một thiếu tá có cấp bậc cao hơn một đại úy.", "eng": "A major ranks above a captain."}, {"viet": "Một nơi truyền giáo hẻo lánh tận trong rừng rậm.", "eng": "A missionary outpost in the jungle."}, {"viet": "Một lộ trình mới trên mặt đất qua Kent.", "eng": "A new overground route through Kent."}, {"viet": "Cuộc diễu hành của các cầu thủ đã diễn ra trước trận bóng đá.", "eng": "A parade of players took place before the football match."}, {"viet": "Một bức hình của vị tướng được vẽ theo phong cách một anh hùng Hy Lạp.", "eng": "A picture of the general portraying him as a Greek hero."}, {"viet": "Một nguồn ánh sáng chan hòa sân bãi.", "eng": "A powerful light flooded into the grounds."}, {"viet": "Những chiếc tai to của thỏ giúp cho nó nghe được âm thanh nhỏ nhất.", "eng": "A rabbit's large ears enable it to hear the slightest sound."}, {"viet": "Một con sông lững lờ bên cạnh đồng cỏ.", "eng": "A river flowing lazily beside the meadow."}, {"viet": "Một giả thuyết xem ra có giá trị nhưng không thể chứng minh được.", "eng": "A seemingly valid but indemonstrable hypothesis."}, {"viet": "Chỉ riêng một tế bào thôi thì nó sẽ quá nhỏ để có thể nhìn thấy mà không cần kính hiển vi.", "eng": "A single one of these cells is too small to be seen without a microscope."}, {"viet": "Sự tràn ngập những ca bệnh cúm trong mùa đông.", "eng": "A spate of cases of influenza in the winter."}, {"viet": "Một người kiên quyết đã luôn luôn bình tĩnh được ngay cả trong những giai đoạn thử thách cam go.", "eng": "A strong person who was able to remain possessed even in times of great trial."}, {"viet": "Một vận động viên quần vợt biểu lộ sự tiên đoán đúng bằng cách di chuyển vào vị trí một cách nhanh nhẹn.", "eng": "A tennis player shows good anticipation by moving quickly into position."}, {"viet": "Một mánh khóe điển hình là giả vờ ốm, xin thuốc, rồi đem bán chợ đen.", "eng": "A typical ploy is to feign illness, procure medicine, then sell it on the black market."}, {"viet": "Cả một đống lý do để không làm việc đó.", "eng": "A whole lot of reasons for not doing it."}, {"viet": "Chấp nhận một chức năng tư vấn trong ba năm ở nước ngoài.", "eng": "Accepted a three-year consultancy abroad."}, {"viet": "Dùng một loại thuốc làm co thắt mạch máu.", "eng": "Administering a drug that constricts the blood vessels."}, {"viet": "Sau mười lăm năm làm luật sư, bà ấy đã trở thành luật sư hoàng gia.", "eng": "After fifteen years as a barrister, she took silk."}, {"viet": "Sau mười phút hãy trở miếng thịt lại.", "eng": "After ten minutes, turn the meat over."}, {"viet": "A, tốt! Xe buýt đây rồi.", "eng": "Ah! Good, here's the bus."}, {"viet": "Mọi đề nghị trung gian hòa giải đều bị khước từ.", "eng": "All offers of mediation were rejected."}, {"viet": "Tất cả những người dễ bị lừa đã mua những cổ phần chẳng có giá trị này.", "eng": "All the suckers who bought these worthless shares."}, {"viet": "Bao giờ bắt đầu một lá đơn cũng nói anh xin một công việc như thế.", "eng": "Always say at the start of an application that you're applying for such-and-such a job."}, {"viet": "Một chiếc xe cứu thương chạy qua hú còi ầm ĩ.", "eng": "An ambulance racing along with its sirens wailing."}, {"viet": "Một công việc phù hợp với người chưa kinh nghiệm về quảng cáo.", "eng": "An entry-level job in advertising."}, {"viet": "Hiện giờ một cuộc thẩm tra đang được tiến hành.", "eng": "An inquiry is now in progress."}, {"viet": "Một sự phụt ra hơi nước từ nồi áp suất.", "eng": "An outburst of steam from the pressure-cooker."}, {"viet": "Ông dùng món súp loại nào?", "eng": "And what kind of soup would you like?"}, {"viet": "Bất cứ một gợi ý nào cho rằng tôi đã nhận hối lộ thì đó là một sự vu khống ghê tởm.", "eng": "Any suggestion that I accepted bribes would be a monstrous slur."}, {"viet": "Những đồ chơi này có an toàn đối với trẻ con không?", "eng": "Are the toys safe for small children?"}, {"viet": "Hè này anh lại định đi châu Âu nữa phải không?", "eng": "Are you going to Europe again this summer?"}, {"viet": "Achentia là một nước xuất khẩu lớn các sản phẩm thịt bò.", "eng": "Argentina is a big exporter of beef products."}, {"viet": "Chúa chứng giám cho tôi, đó là sự thật!", "eng": "As God is my witness, that's the truth!"}, {"viet": "Xác định bản báo cáo là chính xác.", "eng": "Ascertain that the report is accurate."}, {"viet": "Những lúc như thế bạn phải trông cậy vào bản năng.", "eng": "At such times you have to trust to instinct."}, {"viet": "Tránh lái xe trong trung tâm thành phố.", "eng": "Avoid driving in the centre of town."}, {"viet": "Nhớ cẩn thận khi cô thử áo nhé-nó chỉ ghim sơ thôi.", "eng": "Be careful when you try on the dress-It's only pinned."}, {"viet": "Không sợ đưa ra ý kiến thành thật.", "eng": "Be unafraid to give an honest opinion."}, {"viet": "Lòng tin vào kiếp sau là nguyên tắc cơ bản trong tín ngưỡng của bà ấy.", "eng": "Belief in a life after death is the keystone of her religious faith."}, {"viet": "Máu bắn ra từ một động mạch bị đứt.", "eng": "Blood spouting from a severed artery."}, {"viet": "Đội Anh và đội Ý đồng hạng nhì.", "eng": "Britain are tied with Italy for second place."}, {"viet": "Giá trời không mưa chúng ta đã có một kỳ nghỉ tốt đẹp.", "eng": "But for the rain we would have had a nice holiday."}, {"viet": "Nhưng dịch vụ xe buýt rất tệ.", "eng": "But the bus service there is very bad."}, {"viet": "Khi tố giác băng tội phạm đó, anh ta đã ký tên vào bản án tử hình của chính mình.", "eng": "By informing on the gang, he was signing his own death-warrant."}, {"viet": "Những người cắm trại pha trà bên ngoài lều của họ.", "eng": "Campers brewing up outside their tents."}, {"viet": "Cái ghế ôtô có thể đẩy trượt lên phía trước một chút không?", "eng": "Can the car seat be slid forward a little?"}, {"viet": "Con có thể đưa cho mẹ cái xúc để trên bàn chứ?", "eng": "Can you hand me the scoop on top of the table?"}, {"viet": "Cô có thể cho tôi biết nhà hàng mở cửa vào giờ nào không?", "eng": "Can you tell me what your hours are?"}, {"viet": "Người Thiên Chúa giáo đi xưng tội để được tha tội.", "eng": "Catholics go to confession to be purged of sin."}, {"viet": "Trẻ em cần một phương tiện giải tỏa sinh lực của chúng.", "eng": "Children need an outlet for their energy."}, {"viet": "Việc quan sát kỹ cho thấy có một vết nứt trên chiếc lọ đó.", "eng": "Close examination revealed a crack in the vase."}, {"viet": "Tự ai cam kết theo một tiến trình hành động.", "eng": "Commit oneself to a course of action."}, {"viet": "Các chính phủ Bảo hiểm của Anh bênh vực hoạt động doanh thương tư nhân hơn là việc quốc hữu hoá.", "eng": "Conservative governments in Britain favour private enterprise rather than nationalization."}, {"viet": "Tom ạ, bạn có thể giúp tôi một việc không?", "eng": "Could you do me a favour, Tom?"}, {"viet": "Không sao thoát khỏi được gã đàn ông cứ theo sau chúng tôi.", "eng": "Couldn't shake the man who was following us."}, {"viet": "Bố nó này, có phải anh đã là một vận động viên chạy nhanh không?", "eng": "Dad, were you a fast runner?"}, {"viet": "Nhu cầu về cá trong tháng này vượt quá lượng cung cấp.", "eng": "Demand for fish this month exceeds supply."}, {"viet": "Tự mình làm việc của mình tận tâm tận lực.", "eng": "Devote oneself heart and soul to one's work."}, {"viet": "Có phải anh đã mắng cô ta vì đã đánh vỡ nó không?", "eng": "Did you scold her for breaking it?"}, {"viet": "Chia lớp thành từng nhóm nhỏ.", "eng": "Divide the class up into small groups."}, {"viet": "Em cho là điều đó đáng giá 75 $ 1 giờ sao?", "eng": "Do think it's been worth it?"}, {"viet": "Bạn có xe hơi hay xe máy không?", "eng": "Do you have a car or a motorcycle?"}, {"viet": "Bà có biết nơi nào ăn ngon không?", "eng": "Do you know a good place?"}, {"viet": "Ông có phiền khi ký ngay hợp đồng không ạ?", "eng": "Do you mind signing a contract right now?"}, {"viet": "Bạn có nghĩ rằng các kì thi tuyển sinh đại học ở Nhật là quá căng thẳng không?", "eng": "Do you think that Japanese university entrance exams are too stressful?"}, {"viet": "Anh ta có biết là phải đến đây trước tiên không?", "eng": "Does he know to come here first?"}, {"viet": "Đừng chen ngang vào cuộc nói chuyện.", "eng": "Don't barge into the conversation."}, {"viet": "Khi đi bạn đừng quên khóa cửa nhé.", "eng": "Don't forget to lock the door behind you."}, {"viet": "Đừng có nhúc nhích; cứ giữ hoàn toàn bất động.", "eng": "Don't move; stay perfectly still."}, {"viet": "Nó nói gì cũng mặc, đừng tin nó.", "eng": "Don't trust him, no matter what he says."}, {"viet": "Lập một hợp đồng thỏa thuận về dầu thô trong tương lai.", "eng": "Draw up a crude oil futures contract."}, {"viet": "Mỗi vị trong số họ đều là một vị phật đã thành chánh quả.", "eng": "Each of them is a Buddhist who has already reach enlightenment."}, {"viet": "Đội Anh sẽ không có cơ may thắng trận này đâu.", "eng": "England don't have a chance of winning the match."}, {"viet": "Vào sòng bạc Casino người ta phải mặc trang phục dạ hội.", "eng": "Evening dress is de rigueur at the Casino."}, {"viet": "Xin lỗi, ông là ông Wilson từ Canada đến phải không?", "eng": "Excuse me, but are you Mr. Wilson from Canada?"}, {"viet": "Giết sạch tất cả dân làng đó.", "eng": "Exterminate all the inhabitants of the village."}, {"viet": "Trong văn hóa của người da đỏ, lông chim thì quan trọng.", "eng": "Feathers are important in Indian culture."}, {"viet": "Tìm sự dung hoà giữa việc nghiện rượu và việc kiêng cữ hoàn toàn.", "eng": "Find the gold mean between drunkenness and total abstinence."}, {"viet": "Các chuyến bay bị gián đoạn vì sương mù.", "eng": "Flights have been dislocated by the fog."}, {"viet": "Chỉ có hắn mới hiểu nổi lý do vì sao hắn lại uống trà bằng cốc dùng để uống bia.", "eng": "For reasons best known to himself, he drinks tea from a beer glass."}, {"viet": "Những màu tươi sáng trên những tấm vải hoa cũ.", "eng": "Fresh colours in these old prints."}, {"viet": "Gelignite là một chất sờ vào nguy hiểm.", "eng": "Gelignite is dangerous stuff to handle."}, {"viet": "Quét dọn sạch bóng một nơi nào.", "eng": "Give a place a good spring-cleaning."}, {"viet": "Go! là động từ ở thể mệnh lệnh.", "eng": "Go! is in the imperative mood."}, {"viet": "Móc một cục đá ra khỏi chiếc móng ngựa.", "eng": "Gouge out a stone from a horseshoe."}, {"viet": "Sự lo lắng quá đáng do báo chí đại chúng nêu ra về tình trạng của nền kinh tế.", "eng": "Handwringing by the popular press over the state of the economy."}, {"viet": "Anh có đủ than dự trữ dùng không?", "eng": "Have we got enough supplies of coal?"}, {"viet": "Bạn có bao giờ làm việc cho một trường dạy tiếng Anh chưa?", "eng": "Have you ever worked for an English school?"}, {"viet": "Hãy cho định giá lại căn nhà của bạn theo thời giá.", "eng": "Have your house revalued at today's prices."}, {"viet": "Ông ta là một nhà doanh nghiệp tàn nhẫn và ông ta có nhiều kẻ thù.", "eng": "He's a ruthless businessman and he's made a lot of enemies."}, {"viet": "Về đọc thì nó đứng sau các bạn khác, còn về số học thì nó vượt xa họ.", "eng": "He's behind the others in reading but a long way ahead in arithmetic."}, {"viet": "Anh ấy kiên quyết phấn đấu để được đề bạt và không ai ngăn được anh ấy!", "eng": "He's intent on getting promotion, and no one's going to stop him!"}, {"viet": "Hắn đã xí phần này của ngôi nhà làm của riêng hắn.", "eng": "He's staked out this part of the house as his own."}, {"viet": "Anh ta đưa con hậu lên để đe dọa tướng của đối phương.", "eng": "He advanced his queen to threaten his opponent's king."}, {"viet": "Anh ta cư xử như một người lính.", "eng": "He bears himself like a soldier."}, {"viet": "Anh ta từ cuộc chiến trở về, mất một chân.", "eng": "He came back from the war minus a leg."}, {"viet": "Anh ta rửa xe ôtô một tuần một lần.", "eng": "He cleans the car once a week."}, {"viet": "Hắn đã khắc tên mình trên vỏ cây.", "eng": "He'd scratched his name in the bark of the tree."}, {"viet": "Hắn không ưa nhiều giáo viên của mình và cô Smith là người hắn ưa ít nhất.", "eng": "He disliked many of his teachers and Miss Smith he liked the least."}, {"viet": "Anh ta đi vào cuộc họp với một tâm trạng hung hăng.", "eng": "He entered the meeting in a warlike frame of mind."}, {"viet": "Anh ta cuối cùng đã trở thành nổi tiếng là kẻ chiến thắng sau một trận thi đấu sát nút.", "eng": "He finally emerged as the victor after a close fought contest."}, {"viet": "Nó đã cho con lừa khốn khổ một trận roi khủng khiếp.", "eng": "He gave the poor donkey a terrible lashing."}, {"viet": "Hắn có mặt dài khá giống mặt ngựa.", "eng": "He had a long rather horsy face."}, {"viet": "Nó lúc nào cũng lo sợ mình nặng cân.", "eng": "He has a complex about his weight."}, {"viet": "Ông ấy quản lý những ngân quỹ khổng lồ.", "eng": "He has enormous funds at his command."}, {"viet": "Anh ta đã viết 50 đơn xin việc.", "eng": "He has written out 50 job applications."}, {"viet": "Anh ta là một người phê bình rất là mạnh mẽ chính sách vận chuyển của chính phủ.", "eng": "He is a very vocal critic of the government's transport policy."}, {"viet": "Ông ấy là giáo sư môn Triết học đạo đức ở Việt Nam.", "eng": "He is Professor of Moral Philosophy in Vietnam."}, {"viet": "Anh ấy giữ kín những ý nghĩ của mình.", "eng": "He keeps his thoughts to himself."}, {"viet": "Anh ta lắng nghe những lời chế nhạo của đám đông mà không một chút nao núng.", "eng": "He listened to the jeers of the crowd without flinching."}, {"viet": "Anh ta đã làm giàu trên thị trường chứng khoán.", "eng": "He made a fortune on the stock market."}, {"viet": "Nó gây ra chuyện thật là rắc rối ngay trước khi chúng ta đi nghỉ.", "eng": "He must needs break a leg just before we go on holiday."}, {"viet": "Anh ta bị ép phải trả tiền.", "eng": "He paid the money under coercion."}, {"viet": "Ông ta tự hào là đã giữ được bình tĩnh trong một trường hợp khẩn cấp.", "eng": "He prides himself on remaining calm in an emergency."}, {"viet": "Anh ấy lướt mắt trên trang giấy.", "eng": "He ran his eyes over the page."}, {"viet": "Ông ta vẫn cứ cố buộc người khác xem xét yêu sách riêng của mình.", "eng": "He repeatedly pushed forward his own claim."}, {"viet": "Ông ta là một người lý tưởng cho vai vua Lia.", "eng": "He's a natural for the role of Lear."}, {"viet": "Ít nhất ông ta cũng 80 tuổi rồi đấy!", "eng": "He's eighty if he's a day!"}, {"viet": "Anh ta không thông minh bằng chị của mình.", "eng": "He's not as quick as his sister."}, {"viet": "Ông ta rất bủn xỉn trong việc cho mượn tiền.", "eng": "He's very stingy about lending money."}, {"viet": "Hắn đã vớ được món bở 1.000 bảng Anh trong cuộc xổ số.", "eng": "He scooped £ 1,000 in the lottery."}, {"viet": "Anh ta quát cô bé nhưng anh ta nguôi giận khi thấy cô bé khóc.", "eng": "He shouted at the little girl, but his heart melted when he saw her crying."}, {"viet": "Nó xài hết tiền vào việc đánh cá ngựa.", "eng": "He spends all his money betting on horses."}, {"viet": "Nó đã lấy trộm một chiếc bánh bao ngọt của cửa hàng.", "eng": "He stole a bun from the shop."}, {"viet": "Anh ấy mở vô tuyến và có một buổi tối thoải mái.", "eng": "He switched on the television and settled down in the evening."}, {"viet": "Nó đã nói cho cả làng biết tin đó.", "eng": "He told the news to everybody in the village."}, {"viet": "Anh ta cố thoát ra khỏi bụi rậm mà anh ta đã ngã vào.", "eng": "He tried to disentangle himself from the bushes into which he had fallen."}, {"viet": "Ông ấy dùng vợ mình như một chỗ tựa bởi vì ông ấy thiếu tự tin.", "eng": "He uses his wife as a kind of crutch because of his lack of confidence."}, {"viet": "Anh ta giúp đỡ cho tôi đi nhờ xe không lấy tiền.", "eng": "He was accommodating enough to give me a free ride."}, {"viet": "Nó đang thở một cách nặng nhọc sau khi chạy theo xe lửa.", "eng": "He was breathing heavily after racing for the train."}, {"viet": "Anh ta bận lau chùi giày của mình.", "eng": "He was easily employed in cleaning his shoes."}, {"viet": "Hắn bị tù ba năm vì tội gây thương tích trầm trọng.", "eng": "He was in prison for three years for GBH."}, {"viet": "Nó công khai khinh miệt anh nó.", "eng": "He was openly contemptuous of his elder brother."}, {"viet": "Anh ta miệt mài đọc sách đến nỗi anh ấy không nghe tôi vào.", "eng": "He was so absorbed in his reading that he did not hear me enter."}, {"viet": "Hắn đang cố xoay xở để vào được uỷ ban.", "eng": "He was trying to wangle his way onto the committee."}, {"viet": "Ông ta chào đón chiếu lệ những người bạn của bà ta và nhanh chóng rời khỏi phòng.", "eng": "He went through the motions of welcoming her friends but then quickly left the room."}, {"viet": "Ông ta đã cần cù làm việc để có các vụ thu hoạch cao từ mảnh đất khô cằn.", "eng": "He worked hard to produce good crops from poor soil."}, {"viet": "Được cho liều thuốc mạnh về giảm đau.", "eng": "Heavily dosed with pain-killing drugs."}, {"viet": "Sự cố gắng phá kỷ lục thế giới của cô ta suýt đạt được.", "eng": "Her attempt to break the world record nearly came off."}, {"viet": "Sự mỉa mai cay độc dai dẳng của bà ấy về công việc tồi tệ của ông ta.", "eng": "Her constant sarcasm about his poor work."}, {"viet": "Mặt nàng lộ vẻ lo âu và phiền muộn.", "eng": "Her face was anxious and sorrowful."}, {"viet": "Sức khoẻ của cô ta bị suy sụp do sức ép của công việc.", "eng": "Her health broke down under the pressure of work."}, {"viet": "Tiếng cười của cô ấy thật là lôi cuốn chưa từng thấy.", "eng": "Her laughter was the most catching I have ever heard."}, {"viet": "Tiểu thuyết của bà ta chỉ là một cuốn độc nhất-bà ta đã không bao giờ viết được cuốn nào khác hay như thế nữa.", "eng": "Her novel was just a one-off-she never wrote anything as good as that again."}, {"viet": "Việc cô ta từ chối tuân theo những tục lệ xã hội thông thường.", "eng": "Her refusal to conform to the normal social conventions."}, {"viet": "Bà mẹ kế, người căm ghét cô ấy, quả là một người đàn bà độc ác.", "eng": "Her step-mother, who hated her, was an absolute gorgon."}, {"viet": "Những năm ngục tù của cô ta đã để lại một dấu ấn đau buồn.", "eng": "Her years in prison left a scar."}, {"viet": "Nhân dân buộc phải chịu thuế cao.", "eng": "Higher taxes were forced on the people."}, {"viet": "Nguồn gốc xã hội của anh ấy được giấu kín trong bí mật.", "eng": "His background is enshrouded in mystery."}, {"viet": "Quần áo của ông ta nằm bừa bộn khắp nơi.", "eng": "His clothes lay all over the shop."}, {"viet": "Việc huấn luyện anh ta từ ban đầu đã dẫn dắt anh ta đến cuộc sống phiêu lưu.", "eng": "His early training predisposed him to a life of adventure."}, {"viet": "Cha ông là một vị vua.", "eng": "His father was a king."}, {"viet": "Việc anh ta uống rượu nhiều đã làm cho gia đình anh ta tan nát.", "eng": "His heavy drinking wreaked havoc on his family."}, {"viet": "Thư của anh ta đem lại nhiều đề nghị giúp đỡ.", "eng": "His letter brought many offers of help."}, {"viet": "Những toà nhà trang trại mới của ông ta lấn vào đất của hàng xóm.", "eng": "His new farm buildings encroach on his neighbours land."}, {"viet": "Lòng yêu mến của nhân dân lao động đối với ông ta vẫn giữ được mạnh mẽ từ trước đến nay.", "eng": "His popularity among working people remains as strong as ever."}, {"viet": "Vẻ xộc xệch của hắn tạo một ấn tượng xấu.", "eng": "His shabby appearance creates a bad impression."}, {"viet": "Những nhận xét bất lịch sự của anh ta làm cô ấy rất thất vọng.", "eng": "His tactless remarks upset her very much."}, {"viet": "Những lời nói của ông ta đã ghi sâu vào trí nhớ của tôi.", "eng": "His words impressed themselves on my memory."}, {"viet": "Những căn nhà bị hư hại do nước lụt chảy ào ào.", "eng": "Homes damaged by the incursion of flood water."}, {"viet": "Vậy hãy dùng một ít thức ăn nhẹ trong quán cà phê này nhé?", "eng": "How about having some refreshment in this coffee parlor?"}, {"viet": "Sao anh lại dám trách tôi một khi mà chính anh cũng đáng khiển trách không kém?", "eng": "How dare you blame me when you are just as much to blame?"}, {"viet": "Anh phát âm p-h-l-e-g-m thế nào? Nếu anh không biết thì tra'phlegm'trong từ điển.", "eng": "How do you pronounce p-h-l-e-g-m? Look up'phlegm'in the dictionary if you don't know."}, {"viet": "Anh đã làm công việc xây dựng bao nhiêu rồi.", "eng": "How long have you been working in construction."}, {"viet": "Ông sẽ ở lại bao nhiêu đêm?", "eng": "How many nights will you be staying?"}, {"viet": "Giường xếp cho thuê mỗi ngày giá bao nhiêu?", "eng": "How much is a folding bed a day?"}, {"viet": "Chúng ta sẽ đối phó như thế nào một khi tiền đã hết?", "eng": "How would we cope once the money had gone?"}, {"viet": "Tôi đánh giá các cơ may của ông rất mỏng manh.", "eng": "I'd assess your chances as extremely low."}, {"viet": "Tôi muốn kể cho anh nghe về sự thành công của tôi nhưng tính khiêm tốn không cho phép.", "eng": "I'd like to tell you all about my success but modesty forbids."}, {"viet": "Tôi sẽ phạt cô ta thật nặng nếu cô ta tái phạm.", "eng": "I'll give her what for if she does that again."}, {"viet": "Tôi sẽ gọi cho bà ngay khi thu chuyển tiền đến.", "eng": "I'll ring you up as soon as the money order arrives."}, {"viet": "Tôi sợ là tôi bị một tai nạn trong bếp và làm vỡ tất cả cốc.", "eng": "I'm afraid I had an accident in the kitchen and broke all the glasses."}, {"viet": "Tôi từ công ty Alan, California tới.", "eng": "I'm from the Alan Corporation, in California."}, {"viet": "Tôi đang mắc nợ tất cả đến 5000 pao.", "eng": "I'm in hock to the tune of 5000 pounds."}, {"viet": "Hiện giờ tôi không được lòng ông chủ lắm.", "eng": "I'm not very popular with the boss at the moment."}, {"viet": "Tôi xin lỗi phải làm phiền ông, ông có thể cho tôi biết đường đến nhà ga được không?", "eng": "I'm sorry to bother you, but could you tell me the way to the station?"}, {"viet": "Tôi mệt quá không thể nấu nướng được-chúng mình hãy mua cái gì ở hiệu bán thức ăn mang về của người Hoa.", "eng": "I'm too tired to cook-let's get something from the Chinese take-away."}, {"viet": "Tôi đã tìm anh ta một tiếng đồng hồ rồi đấy!", "eng": "I've been looking for you for an hour!"}, {"viet": "Tôi đạt được mọi kỷ lục mà cô ấy đã lập từ trước đến nay.", "eng": "I've got every record she has ever made."}, {"viet": "Tôi thật sự không tài nào hiểu được cái gì đã khiến cô ta làm như thế.", "eng": "I've never really understood what makes her tick."}, {"viet": "Tôi xin lỗi làm anh thất vọng, nhưng tôi không thể tới được.", "eng": "I'm sorry to disappoint you, but I can't come after all."}, {"viet": "Tôi nhận thức sâu sắc nỗi khó khăn mà chúng ta đương đầu.", "eng": "I am acutely aware of the difficulty we face."}, {"viet": "Tôi không cứ phải chờ đợi.", "eng": "I am unaccustomed to being kept waiting."}, {"viet": "Tôi cầu xin cô ấy giúp đỡ nhưng cô ấy không chịu nghe lời yêu cầu của tôi.", "eng": "I begged her for help but she shut her ears to all my appeals."}, {"viet": "Tôi không thể chịu được ( có ) mèo ở trong nhà.", "eng": "I can't bear ( having ) cats in the house."}, {"viet": "Tôi không thể trích dẫn chính xác đoạn nào, câu nào, nhưng tôi có thể nêu ra với anh những điểm chính của tác giả.", "eng": "I can't quote chapter and verse but I can give you the main points the author was making."}, {"viet": "Tôi vừa mới với tới được mấy trái táo ở cành trên cùng.", "eng": "I can just about reach the apples on the top branch."}, {"viet": "Tôi không thể tiếp tục cho anh mượn tiền được nữa.", "eng": "I can't go on lending you money."}, {"viet": "Tôi có thể đưa ra cho anh một trăm lý do để không đi.", "eng": "I could give you a hundred reasons for not going."}, {"viet": "Vui lòng cho tôi hai cái vé.", "eng": "I'd like 2 tickets, please."}, {"viet": "Trong nửa tiếng tôi đã giải xong ô chữ-đơn giản thôi.", "eng": "I did the crossword in haft an hour-there was nothing to it."}, {"viet": "Tôi mong rằng anh sẽ không tiếp tục ngắt lời tôi!", "eng": "I do wish you wouldn't keep interrupting me!"}, {"viet": "Tôi không ưa tất cả các thứ máy móc mới lạ này.", "eng": "I don't like all these newfangled gadgets."}, {"viet": "Tôi nghĩ là chúng ta chưa nghiên cứu đầy đủ.", "eng": "I don't think we've done enough research."}, {"viet": "Tôi không nghi ngờ thiện chí của anh.", "eng": "I don't doubt your good faith."}, {"viet": "Tôi đã bỏ một ít tiền lẻ vào thùng quyên tiền.", "eng": "I dropped some small change into the collecting tin."}, {"viet": "Tôi cảm thấy hơi quá diện với bộ áo quần này-mọi người khác đều mặc quần bò cả!", "eng": "I feel rather overdressed in this suit-everyone else is wearing jeans!"}, {"viet": "Tôi thấy thái độ của bạn rất chướng.", "eng": "I find your attitude most offensive."}, {"viet": "Tôi đi ngủ vào khoảng nửa đêm.", "eng": "I go to bed around midnight."}, {"viet": "Tôi nhận một cú điện thoại của Mary.", "eng": "I had a phone call from Mary."}, {"viet": "Tôi phải thức đến nửa đêm mới hoàn thành xong nó.", "eng": "I had to stay up half the night in order to have it ready this morning."}, {"viet": "Tôi đang cố tìm món phụ tùng này khắp nơi.", "eng": "I have been trying to raise this spare part everywhere."}, {"viet": "Tôi chỉ hiểu biết giới hạn về tiếng Pháp.", "eng": "I have only a limited understanding of French."}, {"viet": "Đã lâu tôi không được hưởng nhiều thú vui như thế này.", "eng": "I haven't enjoyed myself so much for a long time."}, {"viet": "Tôi nghe một tiếng vỗ to ở phía sau tôi.", "eng": "I heard a loud slap behind me."}, {"viet": "Tôi hy vọng sẽ công bố người nào thắng cuộc trong chốc lát.", "eng": "I hope to announce the winner shortly."}, {"viet": "Em vừa mới làm những cái bánh này sáng hôm qua đấy.", "eng": "I just made these yesterday morning."}, {"viet": "Tôi gặp nó lần cuối cùng ở New York cách đây hai năm.", "eng": "I last saw him in New York two years ago."}, {"viet": "Tôi suýt nữa đã giết hắn khi hắn nói điều đó.", "eng": "I liked to have killed him when he said that."}, {"viet": "Tôi sẽ trả anh 500 bảng Anh cho chiếc xe này.", "eng": "I'll give you £ 500 for the car."}, {"viet": "Tôi sẽ nói với anh nhiều hơn khi có thể.", "eng": "I'll tell you more as and when."}, {"viet": "Tôi hết sức muốn gặp cô ấy.", "eng": "I'm desperate to see her."}, {"viet": "Tôi e rằng tôi không vẽ giỏi lắm.", "eng": "I'm no draughtsman, I'm afraid."}, {"viet": "Tôi chắc đó là sơ suất thật tình.", "eng": "I'm sure it was an honest mistake."}, {"viet": "Tôi có thể và mặt khác lại không có thể.", "eng": "I might, and there again I might not."}, {"viet": "Tôi không được làm trái ý ông chủ vì tôi không thể để mất việc.", "eng": "I mustn't annoy my boss because I can't afford to lose my job."}, {"viet": "Thường thì tôi nghỉ làm lúc 5 giờ 30.", "eng": "I normally get off work at 5.30."}, {"viet": "Tôi dự định thức dậy vào lúc sáu giờ sáng mai.", "eng": "I plan to waken at six o'clock tomorrow."}, {"viet": "Tôi đọc hết cuốn sách không bỏ một trang nào.", "eng": "I read the whole book without skipping a page."}, {"viet": "Tôi nhớ cô ta là một thiếu nữ mảnh mai.", "eng": "I remember her as a slim young girl."}, {"viet": "Tôi đã thấy rõ ý đồ của họ ngay từ đầu.", "eng": "I saw through their game from the beginning."}, {"viet": "Tôi sẽ rất biết ơn nếu anh trả lời sớm giúp tôi.", "eng": "I should be grateful if you would favour me with an early reply."}, {"viet": "Tôi nhấn mạnh ga, thế là đít chiếc xe tải lắc qua lắc lại trên con đường đóng băng.", "eng": "I stepped hard on the gas, and the truck fishtailed on the icy road."}, {"viet": "Tôi gọi điện đến văn phòng nhưng không ai nhấc máy.", "eng": "I telephoned the office but there was no reply."}, {"viet": "Tôi nghĩ John nói dối, nhưng anh hãy tự phán xét lấy.", "eng": "I think John is lying, but you have to make your own judgement."}, {"viet": "Tôi cho rằng cuốn sách cuối cùng của bà ấy là một trong những cuốn hay nhất của bà ta.", "eng": "I thought her last books was one of her best."}, {"viet": "Tôi đã cố tìm nó trong danh bạ điện thoại nhưng không ăn thua gì.", "eng": "I tried looking him up in the directory but I drew a blank."}, {"viet": "Tôi đã ở đây 2 tuần.", "eng": "I've been here for two weeks."}, {"viet": "Tôi muốn mua ngôi nhà đó, nhưng đây là một vấn đề về tiền-tôi không có đủ.", "eng": "I want to buy the house, but it's a question of money-I haven't got enough."}, {"viet": "Tôi được con trai hỗ trợ đắc lực trong việc nghiên cứu này.", "eng": "I was ably seconded in this research by my son."}, {"viet": "Tôi vui sướng về sự giúp đỡ này dù nó ít ỏi.", "eng": "I was glad of this help, slight as it was."}, {"viet": "Tôi đã đúng trong những điều phỏng đoán của tôi.", "eng": "I was right in my conjectures."}, {"viet": "Tôi rất biết ơn về bức thơ ân cần của bạn.", "eng": "I was very touched by receive your kind letter."}, {"viet": "Tôi sẽ bắt đầu đi học vào ngày 3 tháng.", "eng": "I will start school on September."}, {"viet": "Không biết anh ấy sẽ đến hay không.", "eng": "I wonder if he'll come."}, {"viet": "Tôi cần một cái mền và gối.", "eng": "I would like a blanket and pillow, please."}, {"viet": "Tôi sẽ đặt một dấu chấm hỏi cho sự khôn ngoan của một hành động như vậy.", "eng": "I would question the advisability of such a course of action."}, {"viet": "Nếu a xít rò ra nó có thể gây nên sự ăn mòn.", "eng": "If any of the acid leaks, it may cause corrosion."}, {"viet": "Nếu tôi nhớ không lầm thì hai đội này thường xuyên đấu với nhau trong các cuộc thi đấu quốc tế.", "eng": "If I remember correctly, the two teams have played against each other quite often in international games."}, {"viet": "Nếu tin này lọt ra ngoài thì sẽ có chuyện rắc rối đấy.", "eng": "If the news get out there'll be trouble."}, {"viet": "Nếu các bạn sẵn sàng đồng ý về đề nghị của chúng tôi, chúng ta sẽ tiến hành.", "eng": "If you're agreeable to our proposal, we'll go ahead."}, {"viet": "Nếu anh còn làm như thế nữa, tôi sẽ cho anh cái bạt tai đấy.", "eng": "If you do that again, I'll clock you one."}, {"viet": "Nếu anh muốn, tôi có thể bảo em trai tôi xem hộ cái xe cho anh.", "eng": "If you liked I could ask my brother to look at your car."}, {"viet": "Nếu con muốn học y, bố mẹ sẽ không ngăn cản con.", "eng": "If you want to study medicine, we won't stand in your way."}, {"viet": "Ngoài tiếng Anh, bọn trẻ còn học tiếng Đức và Tây Ban Nha.", "eng": "In addition to English, the children also learn German and Spanish."}, {"viet": "Thông tin về kim tinh do các vệ tinh của Nga nhận được.", "eng": "In formation about Venus obtained by Russian probes."}, {"viet": "Để mở rộng đường, họ phải thu hẹp lề đường lại.", "eng": "In order to widen the road they had to narrow the pavement."}, {"viet": "Trong ánh sáng yếu ớt hầu như tôi không nhìn thấy con đường phía trước.", "eng": "In the failing light, I could hardly see the road in front of me."}, {"viet": "Ở đoạn này, các đàn viôlông hoà theo bè soprano.", "eng": "In this passage the violins double the sopranos."}, {"viet": "Những côn trùng đã trở nên chịu đựng được DDT.", "eng": "Insects that have become resistant to DDT."}, {"viet": "Có phải thật sự là doanh số của công ty đã sụt giảm?", "eng": "Is it the case that the company's sales have dropped?"}, {"viet": "Có cách nào để tôi liên lạc với ông ấy không?", "eng": "Is there any way I can contact him?"}, {"viet": "Có khả năng là chiều nay sẽ mưa.", "eng": "It'll rain this afternoon, as like as not."}, {"viet": "Anh ở hay đi đối với tôi cũng thế thôi.", "eng": "It's all the same to me whether you stay or go."}, {"viet": "Bỏ ra mấy tiếng đồng hồ ở một viện bảo tàng thật dễ chịu.", "eng": "It's easy to while a few hours away in a museum."}, {"viet": "Đây là thời điểm quyết định về sự thành công hay thất bại của nhà hát địa phương.", "eng": "It's make-or-break time for the local theatre."}, {"viet": "Tôi thấy áy náy đã không trả anh tiền vé tuần trước.", "eng": "It's on my conscience that I didn't pay you for the tickets last week."}, {"viet": "Đó là Đồi Vòi Voi nổi tiếng.", "eng": "It's the well-known Elephant Trunk Hill."}, {"viet": "Hình như điều tôi đã nói là không đúng, nhưng tôi không cố ý nói dối anh.", "eng": "It appears that what I said was untrue, but I did not knowingly lie to you."}, {"viet": "Nó chưa được phát triển hoàn toàn.", "eng": "It hasn't been fully developed yet."}, {"viet": "Không tài nào thuyết phục anh ta vứt bỏ ý kiến.", "eng": "It is impossible to argue him out of his resolution."}, {"viet": "Bây giờ xin giới thiệu lần lượt tất cả.", "eng": "It is time to make introductions all round."}, {"viet": "Cô ta chẳng bao giờ nảy ra ý hỏi ai.", "eng": "It never occurred to her to ask anyone."}, {"viet": "Chỉ vài phút đi bộ thôi mà.", "eng": "It's only a few minutes'walk."}, {"viet": "Cái đó phải bán đấu giá 100000 pao.", "eng": "It should fetch 100000 pounds at auction."}, {"viet": "Đó là một buổi biểu diễn xứng đáng với một bậc thầy.", "eng": "It was a performance worthy of a master."}, {"viet": "Chính cái chớp mắt tội lỗi đã tiết lộ anh ta.", "eng": "It was his guilty blink that gave him away."}, {"viet": "Đó là tháng mười mưa nhiều nhất trong nhiều năm nay.", "eng": "It was the wettest October for many years."}, {"viet": "Thật là thích khi được nhìn thấy ánh mặt trời.", "eng": "It would be nice to see some sunshine."}, {"viet": "Chúa Giê-su giáng thế để cứu vớt chúng ta khỏi tội lỗi.", "eng": "Jesus Christ came into the world to save us from our sins."}, {"viet": "Hãy cứ cố gắng bền bỉ rồi anh sẽ qua được kỳ thi một cách dễ dàng.", "eng": "Just, stick at it and you'll pass your exams easily."}, {"viet": "Người ta đã nghĩ sai lầm rằng các lớp học ngôn ngữ là dễ xơi.", "eng": "Language courses are wrongly thought to be soft options."}, {"viet": "Để tôi điền vào trước đã.", "eng": "Let me fill it in first."}, {"viet": "Luân Đôn có số dân hay thay đổi chỗ ở rất lớn.", "eng": "London has a large floating population."}, {"viet": "Nhiều người chống lại việc đem những thứ thuốc mới thử nghiệm vào súc vật.", "eng": "Many people are against new drugs being tested on animals."}, {"viet": "Người bạn trai mới của Mary quả là một anh chàng đẹp trai, có phải không?", "eng": "Mary's new boy-friend's quite a dish, isn't he?"}, {"viet": "Vui lòng cho tôi gặp ông Lý?", "eng": "May I see Mr. Li, please?"}, {"viet": "Mẹ bị cảm, vì thế tối nay bố sẽ nấu bữa ăn tối.", "eng": "Mom caught a cold, so daddy is going to cook dinner tonight."}, {"viet": "Ông Brown đến gặp ông Smith, nhưng ông Smith đi vắng.", "eng": "Mr. Brown has come to see Mr. Smith but Mr. Smith isn't in."}, {"viet": "Thắt lưng tôi lỏng, tôi đã không cài khoá chặt.", "eng": "My belt is loose, I didn't buckle it up tightly enough."}, {"viet": "Cha tôi nện cho tôi một trận ra trò vì đã đánh hỏng xe của ông ấy.", "eng": "My father really lammed into me for damaging his car."}, {"viet": "Mẹ tôi luôn cho phép tôi ngủ muộn vào những sáng thứ bảy.", "eng": "My mother always allowed me to sleep on Saturday morning."}, {"viet": "Nãy giờ bụng tôi thấy buồn nôn thật sự đấy.", "eng": "My stomach has been feeling real queasy."}, {"viet": "Đừng có hỏi làm sao tôi tìm ra được-cái đó là có thật, đúng không?", "eng": "Never you mind how I found out-it's true, isn't it?"}, {"viet": "Không, tôi không có dự định gì cho tối mai cả.", "eng": "No, I have nothing on then."}, {"viet": "Không một người nào coi thường pháp luật lại tự cho mình là một công dân tốt.", "eng": "No one who ignores the law can call themselves a good citizen."}, {"viet": "Giờ đây anh ta bị tàn tật, ngôi nhà trở thành nơi giam hãm đối với anh.", "eng": "Now that he was disabled, his house had become a prison to him."}, {"viet": "Ồ, sau bữa ăn tối tôi còn phải làm cho xong bài tập về nhà nữa.", "eng": "Oh, after supper I have to finish my homework."}, {"viet": "Đúng, ý của bạn đã thuyết phục tôi.", "eng": "OK, you're soft me on the idea."}, {"viet": "Ngày xửa ngày xưa có một nàng công chúa xinh đẹp.", "eng": "Once upon a time there was a beautiful princess."}, {"viet": "Một ly Scotch pha nước thường nhé.", "eng": "One scotch and water coming up."}, {"viet": "Công ty của chúng tôi là một công ty kinh doanh đầy kinh nghiệm về các mặt hàng tiêu dung ở Hồng Kong và chúng tôi có những mối quan hệ tốt với các đại lý bán sỉ ở địa phương.", "eng": "Our company is an experienced trader of consumer products in Hong Kong and we have good connections with the local wholesalers."}, {"viet": "Thầy giáo dạy văn của chúng ta là một người cổ hủ.", "eng": "Our literature teacher is an old fossil."}, {"viet": "Cô giáo của chúng tôi rất dễ tính, chúng tôi đi muộn bà ấy cũng không để ý.", "eng": "Our teacher is very easygoing, she doesn't mind if we turn up late."}, {"viet": "Quốc hội lên án các biện pháp đàn áp của cảnh sát.", "eng": "Parliament condemned the repressive measure taken by the police."}, {"viet": "Nhiều người xô đẩy, hối hả chung quanh chúng tôi.", "eng": "People hustling and bustling all around us."}, {"viet": "Vui lòng cho tôi một cuốn sách hướng dẫn tham quan.", "eng": "Please give me a sightseeing guide book."}, {"viet": "Các chương trình tối nay đều diễn ra chậm vài phút so với thời gian biểu đã định.", "eng": "Programmes are running a few minutes behind schedule this evening."}, {"viet": "Nạn bắt nạt trong trường học là một vấn nạn ở Nhật Bản.", "eng": "School bullying is a problem in Japan."}, {"viet": "Tôi đặt một chỗ vào lúc khác cho ông nhé?", "eng": "Shall I make another reservation for you?"}, {"viet": "Cô ấy bơi rất giỏi và thường chạy thi.", "eng": "She's a very good swimmer and often races."}, {"viet": "Bà ta đang nghiên cứu về cách nói của trẻ con.", "eng": "She's doing a study of children's speech."}, {"viet": "Cô ta đang tìm một việc làm, nhưng chưa kiếm ra được việc đắc ý.", "eng": "She's looking for a job, but hasn't found the ideal yet."}, {"viet": "Cô ấy vênh váo chỉ vì người ta bảo rằng bài luận của cô ấy là bài hay nhất.", "eng": "She's swanking just because they said her essay was the best."}, {"viet": "Cô ta đã giắt lưng những bằng cấp khoa học cao.", "eng": "She already has good academic qualifications under her belt."}, {"viet": "Cô ta đốt thư từ để chồng mình không bao giờ được đọc chúng.", "eng": "She burned the letters so that her husband would never read them."}, {"viet": "Cô ấy khăng khăng tiếp tục đi đôi giày đã làm đau chân cô.", "eng": "She continued, perversely, to wear shoes that damaged her feet."}, {"viet": "Cô ấy làm điều đó với sự hoàn toàn đồng ý của bố mẹ cô ấy.", "eng": "She did it with the full blessing of her parents."}, {"viet": "Bà ấy đọc thong thả rõ ràng từng từ cho các sinh viên.", "eng": "She enunciated each word slowly for her students."}, {"viet": "Lúc đầu cô ta thấy công việc khó khăn nhưng bây giờ thì cô ta đã thật sự đi vào nền nếp ổn định.", "eng": "She found the job difficult at first, but now she's really getting into her stride."}, {"viet": "Cô ta tốt nghiệp Đại học Cambridge với bằng cử nhân luật.", "eng": "She graduated from Cambridge with a degree in law."}, {"viet": "Bà ta đã làm việc cho nhà máy trong hai mươi năm và giữ một cương vị có trách nhiệm.", "eng": "She had worked for the firm for twenty years and was in a position of trust."}, {"viet": "Gần đây bà ta sản xuất rất ít.", "eng": "She has produced very little recently."}, {"viet": "Cô ấy là người bạn cũ thân thiết của tôi.", "eng": "She is a close and old friend."}, {"viet": "Cô ấy học tiếng Pháp như một môn tự chọn vào năm tới.", "eng": "She is taking French as an elective next year."}, {"viet": "Cô ấy bỏ sót ba chữ khi cô ấy chép câu và kết quả là vô nghĩa.", "eng": "She left out three words when she copied the sentence and the result was nonsense."}, {"viet": "Cô ấy đã làm ồn lên về thức ăn tồi.", "eng": "She made a lot of noise about the poor food."}, {"viet": "Cô ấy nhận ra hắn ngay trong đám đông.", "eng": "She notes him right away among the crowd."}, {"viet": "Cô ta trề môi ra để khoe loại sáp bôi môi mới.", "eng": "She pouted to show off her new lipstick."}, {"viet": "Cô ấy đã nhường quyền sở hữu ngôi nhà cho em gái.", "eng": "She relinquished possession of the house to her sister."}, {"viet": "Cô ta được thuê vào làm tài xế tắc xi.", "eng": "She's employed as a taxi driver."}, {"viet": "Cô ấy rất ưa thích đồ ngọt.", "eng": "She's very fond of sweet things."}, {"viet": "Cô ấy hình như có vẻ lo lắng về công việc của mình.", "eng": "She seems to be worried about her work."}, {"viet": "Con bé mách với thầy về đứa bạn tốt nhất của nó.", "eng": "She sneaked one her best friend to the teacher."}, {"viet": "Đột nhiên cô ấy ao ước muốn trở về New York.", "eng": "She suddenly had an urge to go back to New York."}, {"viet": "Cô ta bực tức vì phải đợi ngoài trời mưa.", "eng": "She took exception to having to wait outside in the rain."}, {"viet": "Cô ta thường tránh né những công việc khó khăn.", "eng": "She usually shirks the difficult tasks."}, {"viet": "Cô ấy luôn luôn nắm lấy bất cứ cơ hội nào để tiến lên.", "eng": "She was always ready to snatch at any opportunity for advancement."}, {"viet": "Cô ta được bầu với đa số phiếu là 3.749.", "eng": "She was elected by a majority of 3,749."}, {"viet": "Cô ta may mắn tránh được tai nạn và chỉ bị có vài ba vết bầm.", "eng": "She was lucky to get off with just a few bruises."}, {"viet": "Chị ta bị tù vì tội bán ma tuý.", "eng": "She was sent to prison for peddling drugs."}, {"viet": "Cô ta rất bơ phờ sau trận ốm.", "eng": "She was very listless after her illness."}, {"viet": "Cô ấy vòi khéo tiền của cha cô ấy.", "eng": "She wheedled the money out of her father."}, {"viet": "Cô ấy theo nghề diễn viên sân khấu, nối nghiệp cha cô.", "eng": "She works in theatre, following in her father's footsteps."}, {"viet": "Liệu cô ta có nên bỏ việc khi cô ta có con không?", "eng": "Should she give up her job when she has a baby?"}, {"viet": "Từ khi anh ta bỏ đi, cô ấy đã ngồi nhà âm thầm chịu đựng.", "eng": "Since he left, she's been sitting at home eating her heart out."}, {"viet": "Hãy giảm bớt tốc độ khi anh sắp đến giao lộ.", "eng": "Slack off as you approach the junction."}, {"viet": "Hãy dập tắt lửa cháy trên xoong bằng khăn ướt.", "eng": "Smother the flames from the burning pan with a wet towel."}, {"viet": "Phong tục của xã hội khác nhau rất nhiều từ nước này đến nước khác.", "eng": "Social customs vary greatly from country to country."}, {"viet": "Có những thức ăn gây chứng táo bón.", "eng": "Some foods bind the bowels."}, {"viet": "Một số người ca lời cầu nguyện, nhưng anh không cần phải ca.", "eng": "Some people sing the prayer, but you don't need to sing."}, {"viet": "Có người kêu cháy! Nhưng đó chỉ là báo động giả.", "eng": "Someone shouted Fire! but it was a false alarm."}, {"viet": "Khi trở lại khí quyển trái đất, phi thuyền chịu tác dụng của trọng lực.", "eng": "Spacecraft re-entering the earth's atmosphere are affected by forces."}, {"viet": "Ứng cử với tư cách ứng cử viên đảng Lao động trong cuộc bầu cử quốc hội.", "eng": "Stand as Labour candidate in a parliamentary election."}, {"viet": "Dùng kế hoãn binh để có thời gian cải tổ Nội Các.", "eng": "Stonewalling for time in order to reshuffle the Cabinet."}, {"viet": "Kỷ luật nghiêm ngặt được áp đặt với các tân binh.", "eng": "Strict discipline is imposed on army recruits."}, {"viet": "Những thư khiếu nại như thế phải được chuyển theo đúng hệ thống.", "eng": "Such complaints must go through the proper channels."}, {"viet": "Hãy mua vé thường xuyên để ủng hộ nhà hát địa phương của anh!", "eng": "Support your local theatre, buy tickets regularly!"}, {"viet": "Liếc sơ qua các tít của tờ báo.", "eng": "Take a glance at the newspaper headlines."}, {"viet": "Cô ta ăn mặc lòe loẹt để đi khiêu vũ.", "eng": "Tarting herself up for the disco."}, {"viet": "Mười người đã đến nhưng những người còn lại vẫn ở xa.", "eng": "Ten people came but the remainder stayed away."}, {"viet": "Đó là chuyện vui!', cô ấy nói và cười toáng lên.", "eng": "That's a good one!'she said, laughing loudly."}, {"viet": "Đứa trẻ đó làm theo ý muốn của nó.", "eng": "That child behaves just as he pleases."}, {"viet": "Cũng còn cách xa sự thật.", "eng": "That is several removes from the truth."}, {"viet": "Bức ảnh này chẳng giống cô ta chút nào.", "eng": "That photograph doesn't look like her at all."}, {"viet": "Kẻ khai man đó bị phạt nộp 1, 000 bảng Anh.", "eng": "That strawman has been sentenced to bay a fine of 1, 000."}, {"viet": "Môn 800 mét là môn thi thứ tư của buổi chiều.", "eng": "The 800m is the fourth event of the afternoon."}, {"viet": "Tác động của muối lên nước đá làm cho nước đá tan.", "eng": "The action of salt on ice causes it to melt."}, {"viet": "Người nghe tỉnh táo có thể đã nhận ra chỗ sai.", "eng": "The alert listener will have noticed the error."}, {"viet": "Chiếc bàn cổ được bán cho bà đội mũ màu hồng.", "eng": "The antique table went to the lady in the pink hat."}, {"viet": "Sự sắp xếp đồ đạc trong nhà tạo thành một tổng thể dễ chịu.", "eng": "The arrangement of the furniture formed a pleasing ensemble."}, {"viet": "Khán giả hứng thú vào đêm khai mạc vở kịch.", "eng": "The audience were enthusiastic on the opening night of the play."}, {"viet": "Ánh sáng yếu, cộng với mặt sân ướt, khiến cho trận đấu rất khó khăn.", "eng": "The bad light, coupled with the wet ground, made play very difficult."}, {"viet": "Tiệm rượu đóng cửa cho tới khi có thông báo mới.", "eng": "The bar is closed until further notice."}, {"viet": "Giai đoạn đầu của hệ thống tư bản chủ nghĩa.", "eng": "The beginnings of the capitalist system."}, {"viet": "Những ngoắt ngoéo kỳ lạ trong cốt truyện đó.", "eng": "The bizarre convolutions of the plot."}, {"viet": "Sự khăng khít giữa thằng bé và con chó của nó.", "eng": "The bond between the boy and his dog."}, {"viet": "Những chai uýtki trưng bày đều là những chai giả cả.", "eng": "The bottles of whisky on display are all dummies."}, {"viet": "Những tiếng kèn trumpet chói tai.", "eng": "The brazen notes of a trumpet."}, {"viet": "Viên đạn đó đã xuyên thẳng qua người hắn.", "eng": "The bullet went straight through him."}, {"viet": "Cuộc vận động cần một người điều phối có hiệu lực.", "eng": "The campaign needs an effective co-ordinator."}, {"viet": "Khi trời bên ngoài lạnh thì xe ôtô dễ chết máy.", "eng": "The car is inclined to stall when it's cold outside."}, {"viet": "Vụ án đó đã được chuyển giao từ toà Thượng thẩm xuống toà dưới.", "eng": "The case has been remitted from the appeal court to a lesser tribunal."}, {"viet": "Chủ tịch tuyên bố khai mạc hội nghị.", "eng": "The chairman declared the meeting open."}, {"viet": "Đứa bé mếu máo và bắt đầu khóc.", "eng": "The child's face crumpled up and he began to cry."}, {"viet": "Đứa bé thẹn thùng nấp sau mẹ.", "eng": "The child was shy and hid behind his mother."}, {"viet": "Không được để trẻ con thiếu ăn.", "eng": "The children must not go short of food."}, {"viet": "Ngân hàng Đầu tư Trung Quốc được sang lập vào tháng mười hai năm 1981 kinh doanh riêng việc tái cho vay những nguồn vốn tài chính mượn ngân hàng thế giới và những nguồn khác.", "eng": "The China Investment Bank was founded in December in 1981 dealing exclusively in the re-lending of funds borrowed from the world bank and other sources."}, {"viet": "Nước trong trẻo của một cái hồ trên núi.", "eng": "The clear water of a mountain lake."}, {"viet": "Chiếc áo choàng này quá chật ngang vai.", "eng": "The coat sits badly across the shoulders."}, {"viet": "Uỷ ban đã quyết định tự tăng lương cho mình.", "eng": "The committee decided to award itself a pay increase."}, {"viet": "Công ty này được một trong ba giám đốc cùng điều hành.", "eng": "The company is run jointly by a triumvirate of directors."}, {"viet": "Sự kết hợp của tay nghề và tính nghệ thuật trong việc làm đồ kim hoàn.", "eng": "The conjunction of workmanship and artistry in making jewellery."}, {"viet": "Những phiên họp của đại diện nhiều quốc gia tại đại hội đồng Liên Hợp Quốc.", "eng": "The cosmopolitan gatherings at the United Nations Assembly."}, {"viet": "Đôi vợ chồng đã lo trước kế hoạch nghỉ hưu của mình một cách khôn ngoan.", "eng": "The couple had the foresight to plan their retirement wisely."}, {"viet": "Sự phê bình làm tổn thương tính đa cảm của nhà nghệ sĩ.", "eng": "The criticism hurt the artist's sensibility."}, {"viet": "Việc chữa trị chứng căng thẳng thần kinh nằm trong cách học thư giãn.", "eng": "The cure for stress lies in learning to relax."}, {"viet": "Hôm đó lạnh lẽo và gió bão.", "eng": "The day was cold and stormy."}, {"viet": "Phe Dân Chủ hy vọng sẽ nắm quyền trở lại trong cuộc tuyển cử sắp tới.", "eng": "The Democrats hope to get back in at the next election."}, {"viet": "Tên độc tài đang bị chứng hoang tưởng tự đại.", "eng": "The dictator was suffering from megalomania."}, {"viet": "Những người bảo vệ đầy lo âu của một thành phố bị bao vây.", "eng": "The distressed defenders of a beleaguered city."}, {"viet": "Bác sĩ viết cho tôi một đơn thuốc để chữa bệnh ho.", "eng": "The doctor wrote me a prescription for medicine for my cough."}, {"viet": "Con chó ngủ say trước lò sưởi.", "eng": "The dog was sound asleep in front of the fire."}, {"viet": "Người tài xế mắng chửi một người đi bộ làm cản trở lối đi của ông ta.", "eng": "The driver was slanging a pedestrian who had got in his way."}, {"viet": "Biên tập phản đối việc cho mục nhàn đàm vào tờ báo.", "eng": "The editor was against the inclusion of a gossip column in the newspaper."}, {"viet": "Quân địch buộc phải tháo chạy trước đạo quân tiến lên.", "eng": "The enemy was put to flight by the advancing army."}, {"viet": "Khối cộng đồng kinh tế châu Âu được nhiều người biết như là khối thị trường chung.", "eng": "The European Economic Community, popularly known as the Common Market."}, {"viet": "Tiếng nổ làm cánh cửa bung ra.", "eng": "The explosion blasted the door open."}, {"viet": "Nạn đói là một sự trừng phạt của Chúa đối với tội lỗi của họ.", "eng": "The famine was a visitation of God for their sins."}, {"viet": "Các bãi có những bức tường đá chia cắt.", "eng": "The fields were divided by stone walls."}, {"viet": "Chỉ số cổ phần trong tờ Thời báo Tài chính đã lên năm điểm ngày hôm qua.", "eng": "The Financial Times share index went up five points yesterday."}, {"viet": "Tầng thứ nhất được dùng để phóng tên lửa rồi sau đó được vứt bỏ trong khí quyển trên cao.", "eng": "The first-stage vehicle is used to launch the rocket and is then jettisoned in the upper atmosphere."}, {"viet": "Những tiếp viên hàng không hãng này rất thân thiện.", "eng": "The flight attendants are really friendly."}, {"viet": "Viên đốc công luôn luôn chửi rủa các công nhân.", "eng": "The foreman is always swearing at the workers."}, {"viet": "Chức năng của dao là để cắt.", "eng": "The function of knife is to cut things."}, {"viet": "Vị tướng điều quân lên phía trước vào ban đêm.", "eng": "The general advanced his troops at night."}, {"viet": "Thủ môn đã đẩy được quả bóng qua xà ngang.", "eng": "The goalkeeper just managed to palm the ball over the crossbar."}, {"viet": "Chính phủ sợ rằng cuộc bãi công có thể gây ra một phản ứng dây chuyền trong các ngành công nghiệp khác.", "eng": "The Government fear the strike may produce a chain reaction in other industries."}, {"viet": "Chính phủ có được tiền cho chiến tranh bằng cách trả lãi 5%.", "eng": "The Government obtained money for the war by means of 5% bonds."}, {"viet": "Đế chế hùng mạnh đó bắt đầu suy tàn.", "eng": "The great empire began to crumble."}, {"viet": "Người khách trọ đã gọi bữa điểm tâm nhẹ nhưng nhân viên khách sạn lại mang đến bữa điểm tâm kiểu Anh.", "eng": "The guest ordered a continental breakfast but the clerk sent an English breakfast."}, {"viet": "Ông hiệu trưởng quyết định phạt cậu học sinh đó để làm gương và đuổi cậu ta ra khỏi trường.", "eng": "The headmaster decided to make an example of the pupil and expel him from the school."}, {"viet": "Những quả đồi vọng lại tiếng cười của họ.", "eng": "The hills echoed to the sound of their laughter."}, {"viet": "Sức nóng mặt trời chẳng mấy chốc làm tan băng.", "eng": "The hot sun soon melted the ice."}, {"viet": "Ngôi nhà nằm trong một bãi đất nhấp nhô rộng 500 mẫu Anh.", "eng": "The house stands in 500 acres of rolling parkland."}, {"viet": "Trận ốm đã để lại cho anh ta một thể trạng khá tiều tuỵ.", "eng": "The illness has left him in rather poor shape."}, {"viet": "Bản dự toán ban đầu hoàn toàn sai lệch.", "eng": "The initial estimate was way out."}, {"viet": "Khi ấy nhà phát minh đang chế tạo thử kim cương.", "eng": "The inventor was trying to make diamonds."}, {"viet": "Vị quan tòa gọi đem đến một bình nước, một điều ám chỉ là phiên tòa sẽ kéo dài.", "eng": "The judge called for a pitcher of water, a tip-off that the session would be long."}, {"viet": "Vị vua bao giờ cũng có các bầy tôi túc trực làm theo lệnh của ngài.", "eng": "The king has always had servants at his beck and call."}, {"viet": "Dặm cuối cùng toàn là dốc.", "eng": "The last mile is all uphill."}, {"viet": "Các lá cây lóng lánh nước trong mưa.", "eng": "The leaves glistened wetly in the rain."}, {"viet": "Ánh sáng quá yếu khiến tôi không đọc được một cách dễ dàng.", "eng": "The light is too dim for me to read easily."}, {"viet": "Ngài thị trưởng và Hội đồng thành phố Luân Đôn.", "eng": "The Lord Mayor and Corporation of the City of London."}, {"viet": "Các quan toà đã chuyển nó cho toà án Old Bailey xét xử.", "eng": "The magistrates committed him for trial at the Old Bailey."}, {"viet": "Cuộc triển lãm lần đầu tiên chiếc máy bay phản lực mới của nhà chế tạo được ấn định vào tháng tới.", "eng": "The manufacture's rollout of the new jet is scheduled for next month."}, {"viet": "Ý nghĩa bài thơ không thực sự thể hiện trong lời giải thích của anh ấy.", "eng": "The meaning of the poem doesn't really come out in his interpretation."}, {"viet": "Hàng hoá trưng bày ở tủ kính của cửa hàng.", "eng": "The merchandise on display in the shop window."}, {"viet": "Tên lửa đó đã rơi cách mục tiêu.", "eng": "The missile landed short of its target."}, {"viet": "Ánh sáng ban mai lọt qua cửa chớp.", "eng": "The morning light was stealing through the shutters."}, {"viet": "Rất nhiều qui tắc và luật lệ đủ loại của bộ máy quan liêu.", "eng": "The multifarious rules and regulations of the bureaucracy."}, {"viet": "Các nhà thương lượng có vẻ mệt phờ cả người sau một phiên họp khác suốt đêm.", "eng": "The negotiators seemed punch-drunk after another all-night session."}, {"viet": "Ông giám đốc mới rất được lòng mọi người.", "eng": "The new manager has created a very favorable impression."}, {"viet": "Tin tức đã đem lại nguồn an ủi cho tất cả chúng tôi.", "eng": "The news brought comfort to all of us."}, {"viet": "Sông Nin đã làm ngập lụt các cánh đồng và làm lắng đọng một lớp bùn trên bề mặt chúng.", "eng": "The Nile floods the fields and deposits mud on them."}, {"viet": "Cô y tá băng bó mắt cá chân bị sai khớp của anh ta.", "eng": "The nurse bandaged up his sprained ankle."}, {"viet": "Giàn khoan dầu hiện giờ đang hoạt động hết mức.", "eng": "The oil rig is now fully operative."}, {"viet": "Các quan chức, viên chức, cảnh sát bang, v. v, có quyền rất lớn.", "eng": "The omnipotent officials, bureaucrats, state police, etc."}, {"viet": "Những sinh viên khác trong lớp là người Ý.", "eng": "The other students in my class are from Italy."}, {"viet": "Gói hàng đề Cẩn thận, dễ vỡ.", "eng": "The parcel was labelled Fragile, handle with care."}, {"viet": "Bệnh nhân đó bắt đầu nói lảm nhảm với các y tá.", "eng": "The patient began to rave incoherently at the nurses."}, {"viet": "Những dân tộc đã từng do La Mã thống trị.", "eng": "The people who were under the sway of Rome."}, {"viet": "Bức tranh phải bán được 2.000 bảng Anh tại cuộc đấu giá.", "eng": "The picture should fetch £ 2,000 at auction."}, {"viet": "Kế hoạch bị hội đồng bác bỏ.", "eng": "The plan was negatived by the committee."}, {"viet": "Vở kịch này là một sự hỗn hợp thực tại và hư cấu.", "eng": "The play is a composite of reality and fiction."}, {"viet": "Cảnh sát đang theo dấu vết của người tù vượt ngục.", "eng": "The police are on the escaped convict's trail."}, {"viet": "Cảnh sát đã rà soát kỹ khắp cánh đồng, nơi tìm thấy xác đứa bé.", "eng": "The police made a thorough sweep of the field where the dead child's body was found."}, {"viet": "Cảnh sát đuổi theo tên trộm.", "eng": "The policemen made after the burglar."}, {"viet": "Những người phát thư lấy thư mỗi buổi sáng.", "eng": "The postmen collect letters every morning."}, {"viet": "Việc Tổng thống xuất hiện trong chương trình chuyện phiếm trên TV không phải là một cảnh mang tính giáo dục.", "eng": "The President appearing on a TV chat show was not edifying spectacle."}, {"viet": "Giá có phần nào cao hơn điều tôi mong đợi.", "eng": "The price was somewhat higher than I'd expected."}, {"viet": "Tên tù vùng vẫy chống lại người bắt giữ nhưng không thể thoát được.", "eng": "The prisoner struggled against his captors but couldn't escape."}, {"viet": "Kế hoạch thất bại là do thiếu kinh phí.", "eng": "The project foundered as a result of lack of finance."}, {"viet": "Dân chúng phải được chỉ dẫn sử dụng năng lượng thế nào cho hữu hiệu hơn.", "eng": "The public should be educated in how to use energy more effectively."}, {"viet": "Nữ hoàng được một đoàn cận vệ và cảnh sát bảo vệ hai bên.", "eng": "The Queen was flanked by a retinue of bodyguards and policemen."}, {"viet": "Vấn đề khá khó giải quyết về quan hệ giữa các chủng tộc.", "eng": "The rather slippery subject of race relations."}, {"viet": "Chế độ đã được hà hơi tiếp sức bằng viện trợ của nước ngoài.", "eng": "The regime had been propped up by foreign aid."}, {"viet": "Cương vị làm bố có nhiều trách nhiệm.", "eng": "The responsibilities of fatherhood are many."}, {"viet": "Quyền lợi của công dân bao hàm một số nghĩa vụ.", "eng": "The rights of citizenship imply certain obligations."}, {"viet": "Con đường chạy dài hàng dặm.", "eng": "The road went on for miles and miles."}, {"viet": "Tuyến đường đó đã từng được nhiều người qua lại nhưng giờ đây rơi vào tình trạng không còn được sử dụng nữa.", "eng": "The route was once much travelled but has fallen into disuse."}, {"viet": "Giám đốc kinh doanh và vị phó của bà ta.", "eng": "The sales director and her second in command."}, {"viet": "Nhân viên của trường toàn là người đã tốt nghiệp đại học.", "eng": "The school is staffed entirely by graduates."}, {"viet": "Người bán miêu tả nó như một chiếc xe hơi kiểu c63 nhưng tôi gọi nó là một cái xe tòng tọc.", "eng": "The seller described it as a vintage car, but I'd call it an old wreck."}, {"viet": "Những tấm trải giương đã mòn mỏng ở giữa.", "eng": "The sheets have worn thin in the middle."}, {"viet": "Phản ứng kích động của các trường đối với việc cắt giảm ngân sách giáo dục.", "eng": "The shock reaction of schools to education cuts."}, {"viet": "Các nước kí hiệp định Giơnevơ.", "eng": "The signatories to the Geneva Agreements."}, {"viet": "Những cậu bé nhỏ hơn đó rất muốn ăn miếng trả miếng với kẻ bắt nạt mình.", "eng": "The smaller boys badly wanted to give the bully a dose of his own medicine."}, {"viet": "Binh lính đã nổi lên chống lại những người chỉ huy của họ.", "eng": "The soldiers revolted against their officers."}, {"viet": "Người phát ngôn viên đã tận dụng vũ khí công kích của anh ta.", "eng": "The speaker made full use of his arsenal of invective."}, {"viet": "Sự khắc nghiệt trong các điều kiện sống của họ làm anh ta sửng sốt.", "eng": "The starkness of their living conditions shocked him."}, {"viet": "Câu chuyện còn tiếp ở số báo sau.", "eng": "The story is continued in the next issue of the magazine."}, {"viet": "Đề tài đó đã được nghiên cứu một cách đầy đủ.", "eng": "The subject has already been fully researched."}, {"viet": "Những người sống sót lênh đênh sáu ngày trên một chiếc bè.", "eng": "The survivors were adrift on a raft for six days."}, {"viet": "Thầy giáo bắt chúng tôi làm việc liên tục suốt cả buổi sáng.", "eng": "The teacher kept us at our work all morning."}, {"viet": "Nhiệt độ trong lò phải hơn 3500 độ F mới tạo ra được tinh thể.", "eng": "The temperature inside the furnace has to be more than 3,500 F, to make the crystals form."}, {"viet": "Bọn trộm đã lấy cắp một triệu pao vàng nén.", "eng": "The thieves stole 1.000.000 pounds in gold bullion."}, {"viet": "Ứng cử viên Đảng bảo thủ vẫn giữ được ghế nhưng số phiếu ủng hộ đã giảm đi rất nhiều.", "eng": "The Tory candidate held the seat but with a greatly reduced majority."}, {"viet": "Việc đào tạo dưới hình thức hội thảo và bài giảng.", "eng": "The training took the form of seminars and lectures."}, {"viet": "Diễn biến của sự việc chứng minh những chờ đợi của anh ta là sai lầm.", "eng": "The turn of events falsifies his expectations."}, {"viet": "Hai sinh viên thông đồng với nhau quay cóp trong kỳ thi.", "eng": "The two students connived to cheat in the examination."}, {"viet": "Đồng tiền Hoa Kỳ hạng thấp nhất là đồng'cent'.", "eng": "The US coin of the lowest denomination is the cent."}, {"viet": "Làng bị biệt lập ( với bên ngoài ) vì tuyết rơi nhiều cả tháng trời.", "eng": "The village was cut off ( from the outside world ) by heavy snow for a month."}, {"viet": "Nước sông Li trong như pha lê.", "eng": "The water in Lijiang River is crystal clear."}, {"viet": "Toàn bộ cung bậc xúc cảm của con người từ niềm vui đến thất vọng.", "eng": "The whole gamut of human emotions from joy to despair."}, {"viet": "Mạng điện bị hỏng cần được thay thế.", "eng": "The wiring is faulty and needs to be replaced."}, {"viet": "Nền kinh tế thế giới hình như phụ thuộc vào sự cung cấp đầy đủ đôla.", "eng": "The world's economy seems to depend on an adequate supply of the almighty dollar."}, {"viet": "Hội nghị của họ giống như quốc hội của chúng ta.", "eng": "Their assembly corresponds to our parliament."}, {"viet": "Cuộc hôn nhân của họ bắt đầu xấu đi khi anh ta có việc làm ở nước ngoài.", "eng": "Their marriage started to go wrong when he got a job abroad."}, {"viet": "Vậy ông muốn bao nhiêu tiền cho mỗi bàn?", "eng": "Then how much would you like to spend for each table?"}, {"viet": "Tại rạp hát địa phương đang diễn một vở kịch hay.", "eng": "There's a good play on at the local theatre."}, {"viet": "Phải thừa nhận là chính phủ đó trở nên rất mất lòng dân.", "eng": "There's no escaping the fact that the government has become very unpopular."}, {"viet": "Hãy còn lại một ít bánh ngọt-có ai muốn ăn không?", "eng": "There's still some cake left-any takers?"}, {"viet": "Ở nước bạn có nhiều cừu, phải không?", "eng": "There are many sheep in your country, aren't there?"}, {"viet": "Có hai loại lạc đà.", "eng": "There are two kinds of camels."}, {"viet": "Có thể có cơ hội tôi được chọn vào đội.", "eng": "There is a chance that I will be chosen for the team."}, {"viet": "Ngày nay, việc đẻ con hoang ít bị ô nhục hơn trước đây.", "eng": "There is less stigma attached to illegitimacy, now than there used to be."}, {"viet": "Trong phòng không có đủ diện tích cho 30 bàn học.", "eng": "There isn't enough space in the classroom for thirty desks."}, {"viet": "Người ta đã chen lấn nhau để giành những chỗ ngồi tốt nhất.", "eng": "There was a scramble for the best seats."}, {"viet": "Ở đó có 50 người, không hơn.", "eng": "There were 50 people there, at the very most."}, {"viet": "Những toà nhà cổ này là một phần di sản quốc gia.", "eng": "These ancient buildings are part of the national heritage."}, {"viet": "Những vấn đề này đã được công bố rất rộng rãi để bàn luận.", "eng": "These issues have been very well ventilated."}, {"viet": "Những thứ đồ chơi này sẽ giúp cho đứa trẻ vui.", "eng": "These toys will help to keep the baby amused."}, {"viet": "Họ đã làm tốt công việc may các rèm này.", "eng": "They've done a fine job sewing these curtains."}, {"viet": "Họ bị cấm không được vay tiền của công ti.", "eng": "They are inhibited from lending the company money."}, {"viet": "Họ phá vỡ điều bí mật bao quanh sự phát triển của tên lửa mới.", "eng": "They broke the silence surrounding the development of the new rocket."}, {"viet": "Họ nhảy múa để biểu lộ niềm vui khi được mùa.", "eng": "They danced to show that they were happy about a big harvest."}, {"viet": "Họ thết khách những món cao lương mỹ vị.", "eng": "They feasted their guests with delicacies."}, {"viet": "Họ có một căn hộ ở thành phố và cả một ngôi nhà ở nông thôn.", "eng": "They have a flat in town as well as a place in the country."}, {"viet": "Họ đã làm mọi điều có thể làm được để tìm kiếm mẹ đứa bé.", "eng": "They left no stone unturned in their search for the child's mother."}, {"viet": "Họ cần sự giúp đỡ của một luật sư giỏi.", "eng": "They need the services of a good lawyer."}, {"viet": "Họ tới đất liền sau sáu tuần ở biển.", "eng": "They reached land after six weeks at sea."}, {"viet": "Họ chẳng thể hiện gì khác ngoài sự khinh bỉ đối với hắn ta.", "eng": "They showed nothing but contempt for him."}, {"viet": "Thường giá khoảng 50 đô, nhưng nếu anh có thể mua rẻ hơn thì càng hay.", "eng": "They usually cost about $ 50, but if you can get one for less, then so much the better."}, {"viet": "Họ kinh ngạc khi nhìn thấy chiếc tàu vũ trụ.", "eng": "They were filled with wonder when they saw the spaceship."}, {"viet": "Họ tự hỏi ngày hôm sau sẽ dành cho họ cái gì.", "eng": "They wondered what the morrow had in store for them."}, {"viet": "Cuốn sách này chứa tất cả những thông tin anh cần.", "eng": "This book contains all the information you need."}, {"viet": "Phương thức hoạt động này sẽ làm lợi cho chúng ta.", "eng": "This course of action will redound to our advantage."}, {"viet": "Loại gin tonic này thật là giảm nỗi đau đớn.", "eng": "This gin and tonic's a real life-saver."}, {"viet": "Đây là chuyến thăm đầu tiên của tôi đến nước ông.", "eng": "This is my first visit to your country."}, {"viet": "Đạo luật này tạm thời đình chỉ áp dụng khi nền an ninh quốc gia bị đe doạ.", "eng": "This law falls into abeyance when the country's security is threatened."}, {"viet": "Tổ chức này chết cứng rồi.", "eng": "This organization is as dead as a dodo."}, {"viet": "Con đường này là phần kéo dài thêm xa lộ.", "eng": "This road is a continuation of the motorway."}, {"viet": "Chủ đề này trở đi trở lại luôn luôn trong suốt vở nhạc kịch.", "eng": "This theme recurs constantly throughout the opera."}, {"viet": "Những cái đinh này thật là đáng ghét, khó nhổ quá!", "eng": "Those nails were real swines to get out!"}, {"viet": "Hôm nay là thứ ba, ngày 10 tháng 10, phải vậy không?", "eng": "Today is Tuesday, October tenth, isn't it?"}, {"viet": "Rẽ phải và đi bộ thêm một khu nhà nữa, sau đó rẽ trái.", "eng": "Turn right and walk for one more block, then make a left."}, {"viet": "Những kẻ tội phạm hung bạo như vậy là một mối đe doạ cho xã hội.", "eng": "Violent criminals like that are a danger to society."}, {"viet": "Tốt hơn là chúng ta nên bắt đầu tìm tiếm một người thư ký mới.", "eng": "We'd better start scouting about for a new secretary."}, {"viet": "Chúng tôi cũng đang nghĩ đến việc tìm cách tiếp cận tất cả các khách hàng tiềm năng của chúng tôi.", "eng": "We're also thinking of getting a way to reach all our potential customers."}, {"viet": "Chúng ta hết phân bón rồi, vì thế chúng ta phải đi đến cửa hàng bán đồ tự làm lấy.", "eng": "We're running out of fertilizer so we have to go to the do-it-yourself store."}, {"viet": "Chúng tôi đã để thức ăn vào kho dự trữ sợ sau này khan hiếm.", "eng": "We've laid in stocks of food in case there are shortages later."}, {"viet": "Chúng tôi đánh giá cao chất lượng tốt của sản phẩm quý vị, nhưng không may là dường như giá cả của quý vị khá cao, ngay cả với chất lượng này.", "eng": "We appreciate the good quality of your products, but unfortunately, your prices appear to be on the high side even for this quality."}, {"viet": "Chúng tôi đang đợi để được xác nhận về việc đặt chỗ tiếp của chúng tôi.", "eng": "We are waiting for confirmation of our onward reservations."}, {"viet": "Chúng ta có thể bỏ qua những chuyện làm mếch lòng nho nhỏ.", "eng": "We can afford to overlook minor offences."}, {"viet": "Chúng tôi lại cho ban đồng ca tập tiếp sau giờ giải lao.", "eng": "We continued rehearsing the chorus after the break."}, {"viet": "Chúng ta không biết mọi hoàn cảnh, vì vậy xét đoán ( về những điều đã xảy ra ) là phi lí.", "eng": "We don't know all the circumstances, so it would be pointless to speculate ( on what happened )."}, {"viet": "Chúng tôi gặp sương mù dày đặc trên bờ biển này vào mùa đông.", "eng": "We get heavy fogs on this coast in winter."}, {"viet": "Chúng tôi đã phải ngồi nghe suốt nhiều bài diễn văn nhạt nhẽo.", "eng": "We had to sit through several tedious speeches."}, {"viet": "Chúng ta không có gì phải ân hận.", "eng": "We have nothing to reproach ourselves with."}, {"viet": "Chúng tôi vừa mua 10 đôla quần áo còn dùng được.", "eng": "We just bought $ 10 worth of funky clothes."}, {"viet": "Chúng tôi ăn một bữa sáng ngon lành trước khi ra đi.", "eng": "We make a good breakfast before leaving."}, {"viet": "Không được để họ túng thiếu trong cảnh tuổi già.", "eng": "We must not let them want for in their old age."}, {"viet": "Chúng tôi chỉ nhận lại hàng đã bán nếu khách hàng có biên lai.", "eng": "We only take goods back if customers can produce the receipt."}, {"viet": "Chúng tôi ngồi yên lặng kinh hoàng sau khi cuối cùng nghe sự thật.", "eng": "We sat in awestruck silence after hearing the truth at last."}, {"viet": "Chúng tôi lội lõm bõm ( theo đường ) ngang dòng suối.", "eng": "We splashed ( our way ) across the stream."}, {"viet": "Chúng tôi chờ đợi quyết định trong sự hồi hộp lo lắng.", "eng": "We waited for their decision with a great deal of apprehension."}, {"viet": "Chúng tôi chơi bóng đá nhưng trời nóng quá chúng tôi đã quyết định chơi cái khác.", "eng": "We were going to play football, but it was so hot that we decided to do otherwise."}, {"viet": "Chúng tôi được không ít hơn 500 pao trong một cuộc thi đấu.", "eng": "We won no less than 500 pounds in a competition."}, {"viet": "À, tôi đã 30 tuổi rồi và tôi sẽ không còn cơ hội khác khi tôi lớn tuổi hơn.", "eng": "Well, I'm already 30 and I won't have another opportunity when I'm older."}, {"viet": "À, ta có thể tới chỗ xem phim lúc 7 giờ rồi ăn gì sau đó hoặc ăn trước đã rồi đi lúc 9 giờ 30.", "eng": "Well, We can go to the showing at 7: 00 and eat afterwards or eat first and go at 9: 30."}, {"viet": "Thứ bùn khủng khiếp ở đáy gầu này là cái gì thế?", "eng": "What's this horrible gunge in the bottom of the bucket?"}, {"viet": "Anh làm cái gì mà lục tung bàn làm việc của tôi thế?", "eng": "What are you doing rooting around in my desk?"}, {"viet": "Bạn nghĩ gì về việc sinh sản vô tính?", "eng": "What do you think about cloning?"}, {"viet": "Nó được làm bằng gì vậy, vàng khối hay cái gì hả?", "eng": "What is it made of, solid gold or something?"}, {"viet": "Nhạc khí nào bạn yêu thích?", "eng": "What is your favorite musical instrument?"}, {"viet": "Cậu ấy chơi vị trí nào?'.", "eng": "What position does he play?'."}, {"viet": "Ông muốn có bàn lúc mấy giờ?", "eng": "What time would you like your table?"}, {"viet": "Khi nào thì những điều lệ mới về an toàn có hiệu lực?", "eng": "When do the new safety rules come into force?"}, {"viet": "Khi trông thấy cô ấy và cô em sinh đôi của cô ấy, tôi tưởng mình nhìn một thành hai.", "eng": "When I saw her and her twin sister I thought I was seeing double."}, {"viet": "Khi trận đấu kết thúc tất cả các cầu thủ bắt tay nhau.", "eng": "When the game was over all the players shook hands."}, {"viet": "Khi anh hoàn toàn khỏi bệnh, chúng ta có thể đi một chuyến.", "eng": "When you're better we can see about planning a trip."}, {"viet": "Xe buýt khởi hành từ đâu?", "eng": "Where does the bus leave from?"}, {"viet": "Con nào có đốm ở lông, báo hay hổ?", "eng": "Which has spots, the leopard or the tiger?"}, {"viet": "Những dấu trắng được quét lên các cây để chỉ lối đi.", "eng": "White marks painted on the trees show the route."}, {"viet": "Ai là kiến trúc sư của nhà thờ St Paul?", "eng": "Who was the architect of St Paul's Cathedral?"}, {"viet": "Sao anh không làm đơn bây giờ?", "eng": "Why don't you apply now?"}, {"viet": "Tom sẽ còn sưu tầm tem nữa không hay đó chỉ là một thích thú nhất thời?", "eng": "Will Tom continue to collect stamps or is it only a passing fad?"}, {"viet": "Việc thắng được toàn bộ số tiền trong cá cược đã đủ cho cô sống suốt đời.", "eng": "Winning all that money on the pools set her up for life."}, {"viet": "Uỷ ban đã bất lực nếu không có sự ủng hộ của ông chủ tịch.", "eng": "Without the chairman's support, the committee is impotent."}, {"viet": "Bạn có muốn uống một ly rượu sau bữa ăn tối không?", "eng": "Would you care for an after dinner drink?"}, {"viet": "Ông có muốn thăm nhà máy của chúng tôi luôn không?", "eng": "Would you like to see our factory, too?"}, {"viet": "Bọc một tảng thịt vào một lá nhôm làm cho thịt được nấu trong chính nước của nó.", "eng": "Wrapping aluminium foil round a joint allows the meat to cook in its own juices."}, {"viet": "Biết, tôi đã học cách đây chỉ hai năm.", "eng": "Yes, I learnt only two years ago."}, {"viet": "Anh nên đưa cho tôi cuốn sách đó-nếu không thì liệu đấy!", "eng": "You'd better give me that book-or else!"}, {"viet": "Anh sẽ không bao giờ sửa được xe hơi của anh kiểu ấy-để mình thử xem.", "eng": "You'll never mend your car like that-let me have a stab at it."}, {"viet": "Anh đã ăn sạch cả bánh, thật là phàm ăn!", "eng": "You've eaten the whole pie, you glutton!"}, {"viet": "Anh đừng quá ngây thơ nếu anh muốn thành công.", "eng": "You can't be too dewy-eyed if you want to succeed."}, {"viet": "Bây giờ ông có thể đóng các túi xách của ông lại.", "eng": "You can close up your bags, now."}, {"viet": "Anh không thể khái quát hoá về những tác dụng của ma tuý từ một hoặc hai trường hợp được.", "eng": "You cannot generalize about the effects of the drug from one or two cases."}, {"viet": "Ông đã nhận một cuộc gọi đánh thức sáng nay, phải không?", "eng": "You got a wake-up call this morning, didn't you?"}, {"viet": "Cô biết đấy, Mary, tôi cảm thấy tội nghiệp cho các cô gái bởi vì họ phải đi theo dõi chế độ ăn uống của họ thật sát sao để tránh bị béo phì.", "eng": "You know, Mary, I feel sorry for girls because they must watch their."}, {"viet": "Anh đã vắng mặt một số buổi trong học kỳ này.", "eng": "You missed several attendances this term."}, {"viet": "Không nên để tâm đến những điều mà một người ốm nói.", "eng": "You mustn't mind what a sick person says."}, {"viet": "Đáng lẽ anh phải là một diễn viên-anh đã bỏ lỡ mất nghề của mình.", "eng": "You should be an actor-you've missed your vocation."}, {"viet": "Anh không nên đánh giá thấp những rủi ro của công cuộc này.", "eng": "You shouldn't underestimate the risks of the enterprise."}, {"viet": "Ông sẽ phải hút điếu xì gà của ông ở bên ngoài.", "eng": "You will have to smoke your cigar outside."}, {"viet": "Giá các ông trả thì quá thấp và không có cơ sở, vì vậy nó không thể làm cơ sở cho việc thương lượng thêm các với các nhà sản xuất của chúng tôi của chúng tôi.", "eng": "Your counter-offer is too low and groundless, so it cannot serve as a basis for further negotiation with our manufacturers."}, {"viet": "Cậu con trai nhà anh là nỗi thất vọng của tất cả thầy giáo dạy nó.", "eng": "Your son is the despair of all his teachers."}]