[{"viet": "Một quyển sách chỉ đề cập sơ lược đến một đề tài.", "eng": "A book that only glances at a topic."}, {"viet": "Một đứa trẻ tỏ ra có trí thông minh tuyệt vời.", "eng": "A child who evinces great intelligence."}, {"viet": "Một kế hoạch xây dựng bị trở ngại do thời tiết xấu.", "eng": "A construction schedule plagued by bad weather."}, {"viet": "Một quyết định được ban hành ở cấp bộ trưởng.", "eng": "A decision taken at ministerial level."}, {"viet": "Một bộ đồ đầm được thêu hoa kim tuyến.", "eng": "A dress brocaded with floral designs."}, {"viet": "Cuốn phim được chiếu cho số khán giả chọn lọc.", "eng": "A film shown to a select audience."}, {"viet": "Ga-ra xe thì hữu ích nhưng không thiết yếu lắm.", "eng": "A garage is useful but dispensable."}, {"viet": "Một sự miêu tả những sự kiện sai một cách trắng trợn.", "eng": "A gross misrepresentation of the facts."}, {"viet": "Một cái đồi có độ dốc 1 trong 4 hoặc là 25%.", "eng": "A hill with a gradient of 1 in 4 or 25%."}, {"viet": "Một nhà bếp đầy đủ dụng cụ điện.", "eng": "A kitchen full of electrical appliances."}, {"viet": "Một cuộc sống được nổi bật qua những thành tích xuất sắc.", "eng": "A life signalized by high accomplishments."}, {"viet": "Cảnh quyến rũ trên mặt nước phẳng lặng của vùng vịnh.", "eng": "A magical view over the calm waters of the bay."}, {"viet": "Một đầu óc chất chứa những điều vô bổ.", "eng": "A mind lumbered with useless facts."}, {"viet": "Một ấn bản mới của cuốn Hamlet có phần chú giải phong phú.", "eng": "A new edition of Hamlet with copious notes."}, {"viet": "Một hoạ phẩm được phục hồi hết sức kỹ càng.", "eng": "A painting restored with infinite care."}, {"viet": "Một bức ảnh được chụp với tốc độ 1/250 giây.", "eng": "A photograph taken at a speed of 1/250 of a second."}, {"viet": "Một giải pháp cho cuộc tranh chấp có thể chấp nhận được.", "eng": "A possible solution to the dispute."}, {"viet": "Một bộ tiểu thuyết bốn tập với một đề tài xuyên suốt.", "eng": "A quartet of novels with a linking theme."}, {"viet": "Một dải đất vươn dài ra tận biển.", "eng": "A ribbon of land stretching out into the sea."}, {"viet": "Một người thợ chạm trổ nữ trở lại nghề cũ của mình sau những kinh nghiệm cuộc thử nghiệm về hội hoạ.", "eng": "A sculptor back on her own ground after experiments with painting."}, {"viet": "Sau những lời ông ấy nói là sự im lặng.", "eng": "A silence succeeded his works."}, {"viet": "Một cuộc đi chơi ngắn trong trung tâm thành phố để mua sắm.", "eng": "A sortie into the city centre to do some shopping."}, {"viet": "Một dòng người vào, ra căn nhà đó.", "eng": "A stream of people into and out of the house."}, {"viet": "Một cảnh phim truyền hình quay gần.", "eng": "A television scene filmed in close-up."}, {"viet": "Một cuộc đấu tranh giữa lòng trung thành và dục vọng.", "eng": "A tug between loyalty and desire."}, {"viet": "Một mớ báo và tạp chí hỗn tạp.", "eng": "A welter of papers and magazines."}, {"viet": "Hội họa trừu tượng là một môn mà chúng ta phải học thì mới biết thưởng thức.", "eng": "Abstract art is an acquired taste."}, {"viet": "Cộng và chia là những phép tính.", "eng": "Addition and division are forms of computation."}, {"viet": "Sau vài câu lịch sự với nhau, các nhà lãnh đạo bắt đầu cuộc thương lượng của họ.", "eng": "After an exchange of pleasantries, the leaders started their negotiations."}, {"viet": "Sau nhiều năm ở núi, Đức Phật xuống vùng đồng bằng đông đúc.", "eng": "After several years in the mountains Buddha came down to the crowded plains."}, {"viet": "Các điệp viên đã khám phá ra một âm mưu chống Tổng thống.", "eng": "Agents have uncovered a plot against the President."}, {"viet": "Tất cả các chuyện cười của tôi trở nên hết sức vô duyên.", "eng": "All my funny stories fell completely flat."}, {"viet": "Nơi chốn và nhân vật trong tiểu thuyết của tôi hoàn toàn là hư cấu.", "eng": "All the places and characters in my novel are entirely fictitious."}, {"viet": "Mặc dù chúng tôi không biết nó là cái gì, song sự cố này là một kinh nghiệm sơ khởi cho những điều sắp tới.", "eng": "Although we didn't know it, this incident was a taste of things to come."}, {"viet": "Một sự gia tăng đáng báo động về con số trộm cắp.", "eng": "An alarming increase in the number of burglaries."}, {"viet": "Một cuộc tấn công của địch trong mặt trận phía Nam.", "eng": "An enemy attack in the Southern sector."}, {"viet": "Một nhà bình luận am tường những sự kiện chính trị.", "eng": "An informed commentator on political events."}, {"viet": "Một cuộc rút lui có trật tự ra khỏi trại.", "eng": "An orderly retreat from the camp."}, {"viet": "Và mặc dù có nhiều con khủng long đáng sợ, nhưng không phải tất cả đều như vậy.", "eng": "And though many of the dinosaurs were terrible, not all of them were."}, {"viet": "Bất cứ sự thay đổi nào cũng đều khó thực hiện, vậy tốt hơn là cứ để nguyên như vậy.", "eng": "Any changes would be very difficult to make so it's better to leave well alone."}, {"viet": "Ở Quảng Châu mùa hè lúc nào cũng nóng như thế này phải không?", "eng": "Are summers always this hot in Guangzhou?"}, {"viet": "Tối thứ bảy tới bạn có rảnh không?", "eng": "Are you free next Saturday evening?"}, {"viet": "Vui lòng cho biết mã số vùng và số điện thoại.", "eng": "Area code and telephone number, please."}, {"viet": "Theo tôi biết thì chuyện đó đã chấm dứt rồi.", "eng": "As far as I am concerned the matter is closed."}, {"viet": "Vì chúng tôi không mua nổi một căn nhà lớn cho nên chúng tôi đành phải chấp nhận ở đây.", "eng": "As we can't afford a bigger house we must make up our minds to staying here."}, {"viet": "Ít ra bạn nghĩ được như vậy, nhưng còn ông chủ?", "eng": "At least you think so, but what about the boss?"}, {"viet": "Dì Jill lúc nào cũng nhớ cho quà vào ngày sinh nhật của tôi.", "eng": "Auntie Jill always remembers my birthday."}, {"viet": "Cẩn thận đừng chạm tự ái cô ta nhé.", "eng": "Be careful not to hurt her feelings."}, {"viet": "Dễ buồn nôn khi thấy xác chết.", "eng": "Be squeamish about seeing dead bodies."}, {"viet": "Bị một người mới đến đánh bại đã thật sự làm anh ta nhụt chí.", "eng": "Being beaten by a newcomer has really taken the wind out of his sails."}, {"viet": "Blenkisop, một người kỳ cựu đáng kính của trường chúng tôi.", "eng": "Blekinsop, a respected denizen of our school."}, {"viet": "Làm mất danh dự gia đình của ai.", "eng": "Bring dishonor on one's family."}, {"viet": "Nhưng tất cả ngân hàng trên khắp Trung Quốc đều có tỉ giá giống nhau khi giải quyết những giao dịch hối đoái.", "eng": "But all banks throughout China have the same rate in dealing in exchange transactions."}, {"viet": "Nhưng những ngân hàng khác như Ngân Hàng Công Thương, chi nhánh Thượng Hải và Ngân hàng Thông tin có hầm két và hộp ký gửi an toàn cho mướn.", "eng": "But other banks as The Industrial and Commercial Bank, Shanghai Branch and The Communication Bank have vaults and safe deposit boxes to rent."}, {"viet": "Do vi phạm quy luật giữ bí mật tuyệt đối, hắn trở thành kẻ bị gạt bỏ.", "eng": "By breaking the rule of absolute secrecy, he became a marked man."}, {"viet": "Khi nào cần cứ gọi tôi, tôi không ở xa đâu.", "eng": "Call me if you need me; I won't be far off."}, {"viet": "Tôi có thể nhắn cho anh ấy điều gì giúp ông không?", "eng": "Can I tell him something for you?"}, {"viet": "Anh có thể cho tôi đi nhờ xe nếu anh đi ôtô không?", "eng": "Can you give me a lift if you're mobile?"}, {"viet": "Bạn có thể cho tôi biết về gia đình của bạn được không?", "eng": "Can you tell me about your family?"}, {"viet": "Cart horse là sự sắp xếp lại chữ của từ orchestra.", "eng": "Cart horse is an anagram of orchestra."}, {"viet": "Người ta mong học sinh ở trường tiếp thu được những gì dạy cho chúng.", "eng": "Children in school are expected to assimilate what they have been taught."}, {"viet": "Chém vỡ đầu một người bằng một thanh kiếm.", "eng": "Cleave a man's head open with a sword."}, {"viet": "Xuất thân từ một gia đình nghệ sĩ, nghề nghiệp tương lai của tôi đã được định sẵn là trên sân khấu.", "eng": "Coming from a theatrical family, I was destined for a career on the stage."}, {"viet": "Chúc mừng anh đã có được một công việc tốt.", "eng": "Congratulations on your getting a nice job."}, {"viet": "Bạn có thể lo vấn đề này ngay được không?", "eng": "Could you attend to this matter immediately?"}, {"viet": "Cô vui lòng cho tôi biết văn phòng của ông Smith ở đâu?", "eng": "Could you tell me where Mr. Smith's office is, please?"}, {"viet": "Cắt thịt, đậu hũ và rau củ thành những miếng cỡ vừa.", "eng": "Cut the meat, tofu, and vegetables into medium-sized pieces."}, {"viet": "Cân nhắc kỹ xem có nên đi hay không.", "eng": "Deliberate whether to leave or not."}, {"viet": "Quyết định chứng minh sự vô tội của ai.", "eng": "Determine to prove somebody's innocence."}, {"viet": "Anh có để ý thấy nó tới không?", "eng": "Did you notice him coming in?"}, {"viet": "Những ngôi sao ở xa không thể nhìn thấy được bằng mắt thường.", "eng": "Distant stars that are invisible to the naked eye."}, {"viet": "Những màu này có hợp nhau không?", "eng": "Do these colours go well together?"}, {"viet": "Anh có thấy rằng hành vẫn có mùi trong anh không?", "eng": "Do you find that onions repeat on you?"}, {"viet": "Ở nước bạn, bạn có phải thi tuyển sinh đại học không?", "eng": "Do you have to take university entrance exams in your country?"}, {"viet": "Bạn cảm phiền làm việc thay cho tôi một vài ngày được không?", "eng": "Do you mind covering for me for a few days?"}, {"viet": "Bạn có nghĩ rằng các phí dịch vụ ngân hàng ở Nhật Bản là quá đắt không?", "eng": "Do you think that bank service charges are too expensive in Japan?"}, {"viet": "Bác sĩ thường trích máu những người bị bệnh.", "eng": "Doctors used to bleed people when they were ill."}, {"viet": "Đừng có để cho mấy thằng lớn đó bắt nạt em; hãy tự vệ!", "eng": "Don't allow those big boys to bully you; stick up for yourself!"}, {"viet": "Đừng quên sự tế nhị trong địa vị của chúng ta đấy.", "eng": "Don't forget the delicacy of our position."}, {"viet": "Đừng có làm như mày là người chịu cực hình.", "eng": "Don't make such a martyr of yourself."}, {"viet": "Đừng có nghĩ là anh có thể học các quy tắc ngữ pháp như là anh học các bảng cửu chương.", "eng": "Don't think you can learn grammatical rules like you learn multiplication tables."}, {"viet": "Con ma hút máu người xuất hiện, mình trùm trong một chiếc áo khoác khổng lồ.", "eng": "Dracula appeared, draped in a huge cloak."}, {"viet": "Mỗi lá đơn phải kèm theo một phong bì có dán tem và ghi địa chỉ.", "eng": "Each application should be accompanied by a stamped addressed envelope."}, {"viet": "Máy bay địch thả bom trên thành phố.", "eng": "Enemy aircraft dropped bombs on the city."}, {"viet": "Thậm chí sự hùng vĩ trơ trụi của Thung lũng Tử thần cũng lôi cuốn nhiều du khách mùa đông.", "eng": "Even the bleak splendor of Death Valley attracts many winter visitors."}, {"viet": "Các ví dụ trong cuốn tự điển này đều bằng chữ in nghiêng.", "eng": "Examples in this dictionary are in italics."}, {"viet": "Hàng xuất khẩu đã đạt vượt mức 80 triệu đồng Mác.", "eng": "Exports have topped the £ 80 million mark."}, {"viet": "Lô-gích sai đã làm lý lẽ bà ta vô giá trị.", "eng": "Faulty logic which invalidated her argument."}, {"viet": "Tìm một chỗ trống trong buổi phát sóng cho một bài nói chuyện về kinh tế.", "eng": "Find a slot for a talk on the economy."}, {"viet": "Rọi đèn pin vào mắt ai.", "eng": "Flash a torch in somebody's eyes."}, {"viet": "Đối với tôi, khi đứng trước cửa đền lúc mặt trời mọc tôi thấy nể sợ.", "eng": "For me, standing before the temple door as the sun rose was a mystical experience."}, {"viet": "Fred, con là người học giỏi.", "eng": "Fred, you're a good man."}, {"viet": "Đã la rầy tôi vì tôi tới muộn.", "eng": "Gave me the business for being late."}, {"viet": "Cười khúc khích về một trong những câu bông đùa ngớ ngẩn của cô ta.", "eng": "Giggling at one of her silly jokes."}, {"viet": "Đánh lệch trái bóng xuống vùng cấm địa.", "eng": "Glance the ball down to fine leg."}, {"viet": "Đã bị bầm tím mắt vì trượt chân đập mặt vào cửa ra vào.", "eng": "Got a real shiner from stumbling into the door."}, {"viet": "Kịch Hamlet là một vở kịch trong chương trình cho cấp A năm nay.", "eng": "Hamlet is a set text for A level this year."}, {"viet": "Các phiếu bầu đã được đếm hết chưa?", "eng": "Have the votes been counted up yet?"}, {"viet": "Bạn có bao giờ nghĩ đến việc giảm bớt không?", "eng": "Have you ever thought of just cutting down?"}, {"viet": "Ông đã bắt tay vào viết cuốn sách kế tiếp của ông chưa?", "eng": "Have you started on your next book yet?"}, {"viet": "Anh ta là một người có tính chính xác và thật sự ngăn nắp.", "eng": "He's a man of accuracy and strict method."}, {"viet": "Anh ta đã được trả một khoản lương rất lớn.", "eng": "He's been offered an astronomical salary."}, {"viet": "Ông ta vào khoảng giữa 50 và 60, vâng, đúng ra là 56 tuổi.", "eng": "He's in his mid-fifties, well, fifty-six to be exact."}, {"viet": "Anh ta mê sảng đến nỗi không còn biết mình đang ở đâu.", "eng": "He's so delirious he doesn't know where he is."}, {"viet": "Anh ta hành động theo thời cơ chứ không theo nguyên tắc.", "eng": "He acted from expediency, not from principle."}, {"viet": "Nó ăn hết nguyên một hộp thịt hầm.", "eng": "He ate a whole tin of stew."}, {"viet": "Anh ta phủi con ruồi ở trên mặt anh ta đi.", "eng": "He brushed the fly away from his face."}, {"viet": "Nó chặt một cành rời khỏi cái cây.", "eng": "He chopped a branch off the tree."}, {"viet": "Hắn băng qua cầu để sang bờ sông bên này.", "eng": "He crossed the bridge to this side of the river."}, {"viet": "Ông ta đã chết vào những giờ phút sáng sớm Chủ Nhật.", "eng": "He died in the early hours of Sunday morning."}, {"viet": "Anh ta cam chịu ba năm tù vì tín ngưỡng của mình.", "eng": "He endured three years in prison for his religious beliefs."}, {"viet": "Ông ta đã cảm thấy mình đang bị ép buộc từ chức.", "eng": "He felt that he was being pressurized to resign."}, {"viet": "Anh ta bảo đảm với tôi việc đó sẽ xong vào thứ sáu.", "eng": "He gave me an assurance that it would be ready by Friday."}, {"viet": "Anh ta cười toe toét với tôi, như thể cùng san sẻ một trò đùa bí mật.", "eng": "He grinned at me, as if sharing a secret joke."}, {"viet": "Hắn phải đi bộ hay nói cho đúng hơn là phải chạy tới văn phòng.", "eng": "He had to walk-or rather run-to the office."}, {"viet": "Hắn đã ăn cắp tiền của công ty bao năm nay trước khi bị cảnh sát phát hiện.", "eng": "He has been stealing money from the company for years before the police got on to him."}, {"viet": "Anh ta đã đi du lịch khắp châu Âu.", "eng": "He has travelled extensively in Europe."}, {"viet": "Bà Jones à, ông ấy là một công dân tốt và còn là một người nghiện rượu tiêu biểu đấy.", "eng": "He is a good citizen, Mrs Jones, and a typical alcoholic."}, {"viet": "Ông ta là một trong những huấn luận viên bóng chày giỏi nhất.", "eng": "He is one of the best managers in baseball."}, {"viet": "Nó đứng bật dậy khỏi cái ghế.", "eng": "He jumped up from his chair."}, {"viet": "Anh ấy thích khách của mình đến đúng giờ.", "eng": "He likes his guests to be punctual."}, {"viet": "Anh ấy thích nói khoác lác liên tu bất tận về bất kỳ đề tài nào một khi có người nghe.", "eng": "He loves holding forth on any subject once he has an audience."}, {"viet": "Nó nói lẩm bẩm cái gì đó với tôi mà tôi nghe không rõ.", "eng": "He mumbled something to me which I didn't quite catch."}, {"viet": "Ông ấy phản ứng quá mạnh đối với tin tức xấu đó.", "eng": "He overreacted to the bad news."}, {"viet": "Anh ta có mặt ở nhà một người bạn.", "eng": "He presents himself at a friend's house."}, {"viet": "Anh ta trả giá lên 500 bảng Anh.", "eng": "He raised his offer to £ 500."}, {"viet": "Ông ta vẫn điềm tĩnh trước các lời tố cáo của họ.", "eng": "He remained unruffled by their accusations."}, {"viet": "Hắn là kẻ chúa kêu ca.", "eng": "He's a great one of complaining."}, {"viet": "Anh ta bị điên; anh ta cần phải được nhốt lại.", "eng": "He's crazy; he ought to be locked up."}, {"viet": "Ông ta không hề là mẫu người hòa đồng.", "eng": "He's never been an outgoing type."}, {"viet": "Cậu ta lại tính giở trò tinh nghịch gì nữa đây!", "eng": "He's up to some mischief again!"}, {"viet": "Anh ấy nói cô ta hài lòng, nhưng tôi tin là trái lại mới đúng: cô ấy rất bất mãn.", "eng": "He says she is satisfied, but I believed the converse to be true: she is very dissatisfied."}, {"viet": "Lúc này đáng lẽ nó đã đến rồi.", "eng": "He should have arrived by now."}, {"viet": "Trước khi lập gia đình anh ta đã chơi bời rất phóng túng.", "eng": "He sowed all his wild oats before he married."}, {"viet": "Anh ta tránh sang một bên cho tôi đi qua.", "eng": "He stepped aside to let me pass."}, {"viet": "Anh ta bị thương ở xương sống khi anh ta ngã ngựa.", "eng": "He sustained an injury to his spine when he fell off his horse."}, {"viet": "Ông ta đã kể một câu chuyện buồn cười mở đầu cho phần nghiêm túc của bài diễn văn của ông.", "eng": "He told an amusing story as a lead-in to the serious part of his speech."}, {"viet": "Ông ta tiếp đãi nhiều vị có chức sắc ở những vùng phụ cận nơi có ruộng đất của ông ta.", "eng": "He treats visiting dignitaries in the lavish surroundings of his country estate."}, {"viet": "Ông ta đã nhân dịp này để nói lên tất cả những điều bất mãn trước đây của ông ta đối với ông chủ tịch.", "eng": "He used the occasion to express all his old grievances against the chairman."}, {"viet": "Anh ta đã từng là một ca sĩ lớn nhưng bây giờ thì hết thời rồi.", "eng": "He was a great singer once but now he's had his day."}, {"viet": "Nó bị trọng tài phạt thẻ vì tội chơi xấu.", "eng": "He was booked by the referee for foul play."}, {"viet": "Rõ ràng là hắn không thân thiện với tôi.", "eng": "He was distinctly unfriendly towards me."}, {"viet": "Anh ấy một tay cầm dao một tay cầm nĩa.", "eng": "He was holding a knife in one hand and a fork in the other."}, {"viet": "Ông ta từng là nhân vật hàng đầu trong cộng đồng đó, nhưng bây giờ ông ta trở nên một con người lố bịch.", "eng": "He was once a leading figure in the community, but now he has become a figure of fun."}, {"viet": "Anh ta bị đẩy xuống ca nô vẫn bị bịt mắt.", "eng": "He was shoved down into a canoe, still blindfolded."}, {"viet": "Anh ta hoàn toàn bối rối vì hệ thống giao thông trong thành phố.", "eng": "He was totally bemused by the traffic system in the city."}, {"viet": "Nó đã bỏ vợ để đi với vợ người bạn tốt nhất của nó.", "eng": "He went off with his best friend's wife."}, {"viet": "Anh ta tự hỏi một cách chán nản sao mà giữa suy nghĩ và hành động của mình lại có khoảng cách xa như vậy.", "eng": "He wondered darkly at how great a lag there was between his thinking and his actions."}, {"viet": "Tôi nghe chỉ được một phần cuộc nói chuyện của họ.", "eng": "Heard only a fragment of their conversation."}, {"viet": "Việc bà ấy đến tạo nên một không khí ảm đạm trong buổi tiệc.", "eng": "Her arrival cast a cloud of gloom over the party."}, {"viet": "Thái độ lạnh lùng của chị ấy biểu lộ sự ác cảm kiềm chế đối với người bạn mới.", "eng": "Her cold manner evinced a restrained dislike for her new friend."}, {"viet": "Cô ta nhìn dán mắt vào cây súng.", "eng": "Her eyes were fixed on the gun."}, {"viet": "Chữ viết của cô ta nghiêng từ trái sang phải.", "eng": "Her handwriting slants from left to right."}, {"viet": "Quyển sách mới nhất của bà ta là một truyện giết người bí ẩn.", "eng": "Her latest book's a murder mystery."}, {"viet": "Chiếc áo dài đỏ của cô ấy gây tác động đối với một người.", "eng": "Her new red dress produced quite an effect on everyone."}, {"viet": "Các cơn thịnh nộ của bà ta không kéo dài.", "eng": "Her rages don't last long."}, {"viet": "Bài diễn văn của bà ta hôm qua là dấu hiệu cho thấy quan điểm của bà đã thay đổi.", "eng": "Her speech yesterday was a signal that her views have changed."}, {"viet": "Hoạt động từ thiện của bà ta hết sức đáng ca ngợi.", "eng": "Her work for charity is highly laudable."}, {"viet": "Sự vắng mặt nhiều lần thường là dấu hiệu của sự bất mãn về công việc.", "eng": "High absenteeism often symphonizes job dissatisfaction."}, {"viet": "Sự cố gắng của anh ta nhằm làm mất uy tín đối thủ của mình đã đập lại chính mình khi anh ấy bị buộc tội phỉ báng.", "eng": "His attempt to discredit his opponent boomeranged when he was charged with libel."}, {"viet": "Thái độ vui vẻ của anh ta làm người ta có ấn tượng sai lầm về tình cảm thật của anh.", "eng": "His cheerful manner belied his real feelings."}, {"viet": "Việc sa thải ông ấy không có liên quan gì đến chất lượng công việc của ông ta.", "eng": "His dismissal has no connection with the quality of his work."}, {"viet": "Bản di chúc của bố anh ta đã đẩy anh ta vào mối bất hoà với người em.", "eng": "His father's will has set him at loggerheads with his brother."}, {"viet": "Đầu anh ta kẹt cứng trong hàng rào chấn song.", "eng": "His head was stuck fast in the railings."}, {"viet": "Vở kịch mới nhất của ông ta đã nhận được sự phê bình sôi nổi trên báo chí địa phương.", "eng": "His latest play got an enthusiastic write-up in the local press."}, {"viet": "Tên nó là Richard nhưng chúng tôi gọi nó là Dick.", "eng": "His name is Richard but we call him Dick."}, {"viet": "Tác phong nhã nhặn của anh ta chứng tỏ anh ta là một con người lịch sự.", "eng": "His polite manners bespoke the gentleman."}, {"viet": "Lương của ông ta so với mức lương trung bình của cả nước là cực kỳ cao.", "eng": "His salary vis-à-vis the national average is extremely high."}, {"viet": "Sự ra đi đột ngột của anh ấy cho thấy rằng anh ta không đáng tin cậy đến mức độ nào.", "eng": "His sudden departure demonstrates how unreliable he is."}, {"viet": "Vợ ông ta đã nhắm mắt làm ngơ sự phản bội của ông ta trong nhiều năm nay.", "eng": "His wife has winked at his infidelity for years."}, {"viet": "Hai mắt trũng vì mất ngủ.", "eng": "Hollow-eyed from lack of sleep."}, {"viet": "Chuyến đi ra biển thì như thế nào?", "eng": "How about a trip to the coast?"}, {"viet": "Làm thế nào mà một kẻ vô danh tiểu tốt như lão ta lại thành chủ tịch công ty được?", "eng": "How could such a nonentity become chairman of the company?"}, {"viet": "Làm thế nào mà anh nhớ được tất cả những số điện thoại đó được?", "eng": "How do you keep all those telephone numbers in your head?"}, {"viet": "Quay vịt phải mất bao lâu?", "eng": "How long does it take to roast the duck?"}, {"viet": "Anh cần ngủ bao nhiêu tiếng đồng hồ?", "eng": "How many hours'sleep do you need?"}, {"viet": "Bạn nghĩ chiếc xe này đáng giá bao nhiêu nếu đổi nó cho cửa hang?", "eng": "How much do you think this car is worth as a trade-in?"}, {"viet": "Tòa nhà sẽ cao bao nhiêu?", "eng": "How tall is the building going to be?"}, {"viet": "Hydro, I ốt, sắt, ma nhê, man gan, ni tơ", "eng": "Hydrogen, Iodine, Iron, Magnesium, manganese, Nitrogen"}, {"viet": "Tôi muốn xem tình hình ra sao rồi mới xin việc làm khác.", "eng": "I'd like to see which way the wind is blowing before applying for another job."}, {"viet": "Tôi sẽ điền vào bản ghi nhớ việc chuyển đổi lại này cho bà.", "eng": "I'll fill in this reconversion memo for you."}, {"viet": "Tôi sẽ chuyển lời nhắn khi ông ấy trở lại.", "eng": "I'll pass on the message when he returns."}, {"viet": "Tôi sợ rằng tôi là một kẻ hèn nhát khi nói đến rắn.", "eng": "I'm afraid I'm something of a coward when it comes to snakes."}, {"viet": "Sáng nay tôi thật sự cảm thấy ngầy ngật.", "eng": "I'm feeling really dopey this morning."}, {"viet": "Tôi sẽ tổ chức một bữa tiệc vào tối thứ bảy tới.", "eng": "I'm holding a party next Saturday night."}, {"viet": "Tôi không chắc công việc làm ăn của ông ấy là hoàn toàn hợp pháp.", "eng": "I'm not sure that his business is strictly legitimate."}, {"viet": "Xin lỗi, tôi không thể đến nhà anh vào ngày mai được.", "eng": "I'm sorry I can't come to your house tomorrow."}, {"viet": "Tôi hết sức thích thú là bài tiểu luận của tôi đã chiếm giải.", "eng": "I'm tickled pink that my essay won the prize."}, {"viet": "Tôi bị ông chủ không ưa từ khi ông ấy phát hiện ra tôi phê bình ông ấy.", "eng": "I've been in bad odour with the boss since he discovered that I had criticized him."}, {"viet": "Tôi có một người thợ máy chỉ đâu đánh đó đang bảo dưỡng cho xe của tôi.", "eng": "I've got a tame mechanic who keeps my car in order."}, {"viet": "Tôi chưa bao giờ có thể hiểu được anh ta.", "eng": "I've never been able to figure him out."}, {"viet": "Tôi đã tính phần chi tiêu của anh là 10 pao.", "eng": "I've worked out your share of the expenses at 10 pounds."}, {"viet": "Tôi luôn luôn xét đến sự tiêu thụ nhiên liệu khi mua một chiếc xe ôtô.", "eng": "I always take fuel consumption into consideration when buying a car."}, {"viet": "Tôi nghi ngờ người phụ nữ đó-tôi nghĩ bà ta có thể đã ăn cắp một cái gì đó ở cửa hàng.", "eng": "I am suspicious of that woman-I think she may have stolen something from our shop."}, {"viet": "Xin phép cho tôi có ý kiến khác là không hề có gì gọi tiếng Anh chuẩn.", "eng": "I beg to differ with you, but there is no such thing as standard spoken English."}, {"viet": "Tôi tình cờ gặp một nhóm trẻ em đang chơi trên đường phố.", "eng": "I came upon a group of children playing in the street."}, {"viet": "Tôi chưa trả ngay tiền sách được, anh sẽ làm hoá đơn cho tôi sau.", "eng": "I can't pay for the books now, will you bill me later."}, {"viet": "Tôi chẳng tìm ra điều gì mới mẻ để nói về vấn đề này nữa.", "eng": "I can find nothing new to say on this subject."}, {"viet": "Tôi không thể tìm thấy hành lý của tôi.", "eng": "I can't find my luggage."}, {"viet": "Tôi hiểu lời phát biểu của anh ta là một sự từ chối.", "eng": "I construed his statement as a refusal."}, {"viet": "Tôi sẽ lúng túng nếu không có quý vị.", "eng": "I'd be lost without you."}, {"viet": "Tôi đã làm nhiều điều ngu ngốc khi tôi còn trẻ và dễ siêu lòng.", "eng": "I did many stupid things when I was young and suggestible."}, {"viet": "Tôi rất mong chúng tôi không làm anh phải thức khuya.", "eng": "I do hope we're not keeping you up."}, {"viet": "Tôi không biết có thật hay không.", "eng": "I don't know whether it is true or not."}, {"viet": "Tôi không nghĩ rằng chiếc ô tô đó sẽ chở được tất cả các bạn.", "eng": "I don't think the car will hold you all."}, {"viet": "Tôi không hoàn toàn đồng ý với anh.", "eng": "I don't altogether agree with you."}, {"viet": "Tối qua tôi mơ thấy mình bay.", "eng": "I dreamt about flying last night."}, {"viet": "Tôi cảm thấy khoẻ lên nhiều sau ngày nghỉ.", "eng": "I feel infinitely better after my holiday."}, {"viet": "Tôi thấy lạ là cô ta không muốn đi du lịch.", "eng": "I find it strange that she doesn't want to travel."}, {"viet": "Tôi lấy danh dự ra bảo đảm với anh là tôi đã không làm điều đó.", "eng": "I give you my word of honour I didn't do it."}, {"viet": "Tôi đã may mắn được chọn cho một chuyến đi nước ngoài.", "eng": "I had a good fortune to be chosen for a trip abroad."}, {"viet": "Tôi phải nép sát người vào tường để cho chúng đi qua.", "eng": "I had to press myself against the wall to let them pass."}, {"viet": "Tôi có cảm giác là trời sắp đổ mưa.", "eng": "I have an idea it's going to rain."}, {"viet": "Tôi không có khoản tiền để trả cho họ.", "eng": "I have not the money wherewith to pay them."}, {"viet": "Tôi không còn một xu nào, mua đồ uống cho mọi người đã làm tôi hoàn toàn sạch túi.", "eng": "I haven't a penny left, buying drinks for everyone has cleaned me out completely."}, {"viet": "Tôi nghe nói họ sống chung với nhau.", "eng": "I hear they're living together."}, {"viet": "Tôi hy vọng là các bác sĩ sẽ không phải dùng đến phẫu thuật.", "eng": "I hope the doctors won't have recourse to surgery."}, {"viet": "Tôi cười ngặt nghẽo khi nhìn thấy chị ấy ăn mặc như một tên hề.", "eng": "I just curled up when I saw her dressed as a clown."}, {"viet": "Tôi chỉ biết họ muốn văn phòng này trống.", "eng": "I know they want this room empty."}, {"viet": "Tôi thích đọc vào ban đêm.", "eng": "I like to read at night."}, {"viet": "Tôi sẽ kèm thư của anh vào thư của tôi luôn.", "eng": "I'll enclose your letter with mine."}, {"viet": "Tôi muốn đăng ký một chuyến đi trọn gói.", "eng": "I'll take a package tour."}, {"viet": "Cám ơn ông, bây giờ tôi khỏe hơn rồi.", "eng": "I'm better now, thank you."}, {"viet": "Tôi đang tìm một món quà.", "eng": "I'm looking for a gift."}, {"viet": "Tôi rất tiếc là chúng tôi phải đóng cửa.", "eng": "I'm sorry we are closed."}, {"viet": "Tôi thiền định để thư giãn.", "eng": "I meditate in order to relax."}, {"viet": "Tôi phải nói là tất cả chúng tôi ở đây đều rất có ấn tượng về khả năng của ông.", "eng": "I must say that all of us here are quite impressed with your credentials."}, {"viet": "Cho đến lúc này em mới nhận ra là em yêu anh.", "eng": "I never realized I loved you until now."}, {"viet": "Tôi nhận thấy một sự thay đổi trong ứng xử của nó.", "eng": "I perceived a change in his behaviour."}, {"viet": "Tôi đã tiếp xúc với Hội đồng nghệ thuật Văn hóa của người Mỹ bản địa.", "eng": "I reached the Native American Cultural Arts Council."}, {"viet": "Tôi ân hận không thể giúp được.", "eng": "I regret that I cannot help."}, {"viet": "Hồi nãy tôi nhìn thấy trên xe có bánh nướng nhân bí ngô.", "eng": "I saw some pumpkin pie earlier on."}, {"viet": "Tôi sẽ trở lại điểm này sau.", "eng": "I shall return to this point later."}, {"viet": "Tôi đã ở đó ba tuần vào tháng sáu năm ngoái.", "eng": "I spent three weeks there in June last year."}, {"viet": "Tôi dắt theo con gái tôi cho có bạn.", "eng": "I take my daughter for company."}, {"viet": "Tôi nghĩ nó trông rất hợp với bạn.", "eng": "I think it looks terrific on you."}, {"viet": "Tôi nghĩ ông sẽ thấy rằng chúng đủ chắc chắn để chịu đựng bất cứ sự va đập hay bốc dỡ mạnh tay nào.", "eng": "I think you will find that they are strong enough to withstand any shock or rough handling."}, {"viet": "Tôi đặc biệt chỉ mua sắm ở cửa hàng ông Martin.", "eng": "I trade at Mr Martin's store exclusively."}, {"viet": "Tôi đã từng học đàn piano khi tôi còn bé, nhưng tôi ghét nó bởi vì mẹ tôi lúc nào cũng khăng khăng bắt tôi tập.", "eng": "I used to take piano lessons when I was a little girl, but I hated it because my mother always insisted on practicing."}, {"viet": "Tôi muốn tham dự một hoặc hai buổi lễ.", "eng": "I want to attend one or two."}, {"viet": "Tôi muốn đi nhưng rồi ông chú tôi mất, trong hoàn cảnh đó tôi quyết định ở lại.", "eng": "I wanted to leave but then my uncle died, so under the circumstances I decided to stay."}, {"viet": "Tôi quên mất rằng David đã từng dạy anh học.", "eng": "I was forgetting that David used to teach you."}, {"viet": "Tôi thực sự bực mình khi cô ấy không nghe lời tôi.", "eng": "I was really narked when she wouldn't listen to me."}, {"viet": "Tôi được đưa vào và đứng trước Nữ hoàng.", "eng": "I was ushered in, and stood before the Queen."}, {"viet": "Tôi sẽ không bao giờ đi trệch khỏi điều mà tôi tin là đúng.", "eng": "I will never deviate from what I believe to be right."}, {"viet": "Tôi không thể dung thứ một thái độ như thế.", "eng": "I won't tolerate such behaviour in this way."}, {"viet": "Tôi không muốn cuốn nhật ký của tôi rơi vào tay những kẻ xấu.", "eng": "I would hate my diary to get into the wrong hands."}, {"viet": "Tôi chẳng bao giờ đủ liều lĩnh để tự mình dùng một tước vị như vậy.", "eng": "I would never have been temerarious enough to make use of such a title on my own."}, {"viet": "Nếu quần áo nào mà không giặt được thì phải chải khô.", "eng": "If a garment won't wash, it must be dry-cleaned."}, {"viet": "Nếu tôi đi, ai sẽ trực thay cho tôi?", "eng": "If I leave, who is going to cover for me?"}, {"viet": "Nếu ngày đó mà mưa thì chúng ta có thể phải thay đổi chương trình.", "eng": "If the day turns out wet we may have to change our plans."}, {"viet": "Nếu chúng ta thực sự ra tay thì có thể trong một buổi chiều dọn sạch cả căn nhà.", "eng": "If we really set to we can get the whole house cleaned in an afternoon."}, {"viet": "Nếu bạn có việc làm, việc đó sẽ là việc gì?", "eng": "If you could have any job, what would it be?"}, {"viet": "Nếu anh để cái áo này ngoài nắng, nó sẽ nhạt màu.", "eng": "If you leave that dress in the sun, it will fade."}, {"viet": "Nếu anh muốn đi, tôi không cấm.", "eng": "If you want to go, I can't forbid you."}, {"viet": "Ở một nước nghèo thì có một chiếc xe đạp đã là dấu hiệu của một sự giàu có tương đối.", "eng": "In a poor country, owning a bicycle is a sign of comparative wealth."}, {"viet": "Thực tế, nước của nó mặn đến 4 hay 5 lần so với các đại dương trên thế giới.", "eng": "In fact, its water is four or five times as salty as the water in the oceans of the world."}, {"viet": "Theo ý kiến biện hộ của tôi, thì nhân chứng nói dối.", "eng": "In my submission, the witness is lying."}, {"viet": "Vào ban ngày, đôi khi họ để chúng lại đây.", "eng": "In the day time, they sometimes leave them."}, {"viet": "Trong cuốn sách này tác giả nghiên cứu tổng quát những bước phát triển gần đây trong ngôn ngữ học.", "eng": "In this book, the author surveys recent developments in linguistics."}, {"viet": "Tin tức từ nguồn có thẩm quyền.", "eng": "Information from an authoritative source."}, {"viet": "Ông ấy có thể gặp tôi bây giờ không?", "eng": "Is it possible for him to see me now?"}, {"viet": "Có cần để lại kết số tối thiểu nào không?", "eng": "Is there any minimum balance required?"}, {"viet": "Không có vấn đề khác nữa à-ô nhiễm không khí chẳng hạn?", "eng": "Isn't there another problem also-air pollution?"}, {"viet": "Cùng một việc mà trả công cho đàn ông nhiều hơn đàn bà thì hoàn toàn là phi lý.", "eng": "It's absolutely monstrous to pay men more than women for the same job."}, {"viet": "Lâu lắm rồi chúng ta không gặp nhau.", "eng": "It's donkey's years since we're seen each other."}, {"viet": "Đó chỉ là cách bày tỏ tình thân hữu ở Mỹ thôi.", "eng": "It's just the American way of showing friendliness."}, {"viet": "Cái đó không cấp thiết lắm-chúng ta có thể làm vào tuần tới hoặc bất cứ lúc nào.", "eng": "It's not urgent-we can do it next week or whenever."}, {"viet": "Đây là lần đầu tiên tôi nghe nói điều đó đấy.", "eng": "It's the first time I have heard of that."}, {"viet": "Tất cả rút lại thành vấn đề tiền bạc.", "eng": "It all boils down to a question of money."}, {"viet": "Chê bai các giá trị tinh thần truyền thống đã trở thành mốt.", "eng": "It has become fashionable to do down traditional moral values."}, {"viet": "Hy vọng rằng sáng kiến của chính phủ sẽ chấm dứt được cuộc bãi công.", "eng": "It is hoped that the government's initiative will bring the strike to an end."}, {"viet": "Anh thật dễ mến vì đã nhớ đến chúng tôi.", "eng": "It is sweet of you to have remembered us."}, {"viet": "Nó có thể rách hơn nữa khi giặt.", "eng": "It might tear further while washing."}, {"viet": "Không cần phải dọn vệ sinh phòng.", "eng": "It's not necessary to clean the room."}, {"viet": "Dường như có thể có thị trường cho những mặt hàng này ở quê tôi.", "eng": "It seems there may be a market for these items where I come from."}, {"viet": "Khi mới sản xuất nó là một phim hay, nhưng bây giờ nó cũ rồi.", "eng": "It was a good film when it came out, but it looks rather dated now."}, {"viet": "Dần dần chúng tôi đã nhận thấy thất bại là điều không tránh khỏi.", "eng": "It was gradually borne in on us that defeat was inevitable."}, {"viet": "Đó là lần đầu tiên ông ta được thấy tác phẩm của mình được phát hành.", "eng": "It was the first time he had seen himself his work in print."}, {"viet": "Có lẽ sẽ không thành thực nếu nói rằng chúng ta đã không nghi ngờ họ.", "eng": "It would be disingenuous to claim that we hadn't suspected them."}, {"viet": "Jean rất kén chọn thức ăn.", "eng": "Jean's very choosy about what she eats."}, {"viet": "Nhận xét theo bề ngoài có thể nhầm lẫn.", "eng": "Judging by appearances can be misleading."}, {"viet": "Vì thiếu tiền nên chúng tôi buộc phải hủy bỏ kế hoạch cho một căn nhà mới.", "eng": "Lack of cash forced us to scrap plans for a new house."}, {"viet": "Chúng ta hãy xác nhận số tài khoản của ông nhé, đó là số 768-0-82116.", "eng": "Let's verify your account number, which is 768-0-82116."}, {"viet": "Nâng trục lăn ở phía tên lên và đừng để nó rơi.", "eng": "Lift the top roller and not to let it fall."}, {"viet": "Nhiều túp nhà tranh ở trong làng bây giờ thuộc quyền sở hữu của những người đi nghỉ cuối tuần.", "eng": "Many of the cottages in the village are now owned by weekenders."}, {"viet": "Martin, anh có thể gọi điện cho vài chỗ được không?", "eng": "Martin, could you telephone some places?"}, {"viet": "Tôi đi tham quan chiếc tàu được không?", "eng": "May I look around the ship?"}, {"viet": "Kính thưa ngài bộ trưởng, kính thưa các khách mời đặc biệt, kính thưa quý bà và quý ông: Ngài bộ trưởng tài chính, Ngài J.", "eng": "Minister, distinguished guests, ladies and gentlemen: The Minister of Finance, Mr. J."}, {"viet": "Motel là một từ kết hợp từ hai từ motor và hotel.", "eng": "Motel is a portmanteau word from the two words motor and hotel."}, {"viet": "Những lời bảo đảm của tôi không thuyết phục được anh ta: anh ta vẫn còn hoài nghi.", "eng": "My assurances don't satisfy him: he's still sceptical."}, {"viet": "Bố tôi tức giận nếu tôi đi chơi khuya.", "eng": "My father gets angry if I stay out late."}, {"viet": "Giáo viên dạy toán của chúng tôi quả thật thường chỉ trích chúng tôi gay gắt khi chúng tôi giải đáp sai.", "eng": "My maths teacher really used to jump on us when we got our answers wrong."}, {"viet": "Các chị em gái của tôi không sống ở đó.", "eng": "My sisters don't live there."}, {"viet": "Đừng bao giờ quá khúm núm, cũng đừng quá tự cao trước mặt người nước ngoài.", "eng": "Never be too humble nor too pushy before a foreigner."}, {"viet": "Không, tôi nay tốt hơn tôi nên uống rượu sâm panh.", "eng": "No, I'd better have champagne tonight."}, {"viet": "Không ai có thể phủ nhận được việc lửa bùng cháy.", "eng": "No one can deny the fact that fire burns."}, {"viet": "Bây giờ tôi đã tận mắt thấy được điều đó.", "eng": "Now I've seen it with my own eyes."}, {"viet": "Tất nhiên chúng được tổ chức chủ yếu gần nơi người da đỏ sinh sống.", "eng": "Of course they're held mostly near where Indians live."}, {"viet": "Được, tôi sẽ nhận cuộc gọi trong văn phòng của tôi.", "eng": "OK, I'll take it in my office."}, {"viet": "Trước kia tôi đã giành giải nhất trong cuộc thi khiêu vũ đấy.", "eng": "Once I got the first prize in a dancing contest."}, {"viet": "Một trong nơi nghỉ mát ưa thích của những người sống thời nữ hoàng Victoria.", "eng": "One of the favorite watering places of the Victorians."}, {"viet": "Đến biên giới, xe của chúng tôi phải quay trở lại.", "eng": "Our car was turned back at the frontier."}, {"viet": "Sự hiểu rõ hơn của chúng ta về đời sống của Liên Xô.", "eng": "Our improved understanding of Soviet life."}, {"viet": "Cuộc đấu tranh của chúng ta là do tình yêu đất nước thúc đẩy.", "eng": "Our struggle is actuated by love of our country."}, {"viet": "Phụ huynh phải rèn luyện con em mình vào kỷ luật.", "eng": "Parents have to discipline their children."}, {"viet": "Người ta đến đây để giặt áo quần của họ.", "eng": "People come here to wash their clothes."}, {"viet": "Thềm ga số 3, nhưng tôi nghĩ là bây giờ xe lửa chưa đến.", "eng": "Platform 3, but I don't think the train's in yet."}, {"viet": "Sức khỏe yếu có thể là một trở ngại cho sự thành công.", "eng": "Poor health may be a barrier to success."}, {"viet": "Các hộp cá trích có thể là rất khó mở.", "eng": "Sardine tins can be the very devil to open."}, {"viet": "Tôi chẳng có việc gì phải làm vào ngày nghỉ ngoài việc làm gì mình thích.", "eng": "Shall have nothing to do on holiday but please myself."}, {"viet": "Cô ta là một ca sĩ nổi tiếng nhưng những đĩa hát của cô lại không bao giờ nằm trong mười đĩa hát bán chạy nhất.", "eng": "She's a popular singer, but her records never make the top ten."}, {"viet": "Cô ấy rất hài lòng về chuyện kiếm được việc làm.", "eng": "She's cock-a-hoop about getting the job."}, {"viet": "Cô ta làm ầm lên vì giá tiền thuê cao.", "eng": "She's kicking up an awful fuss about the high rent."}, {"viet": "Cô ta ăn lễ Giáng sinh với những người trong gia đình của cô ta.", "eng": "She's spending Christmas with her people."}, {"viet": "Cô ta ngắm bộ vai rắn chắc của anh ấy.", "eng": "She admired the firm set of his shoulders."}, {"viet": "Cô ta đỏ mặt và nhìn xuống sàn.", "eng": "She blushed and looked down at the floor."}, {"viet": "Cô ta than phiền là các câu hỏi xâm phạm vào đời sống riêng tư của cô ta.", "eng": "She complained that the questions were an invasion of her privacy."}, {"viet": "Bà ta thuộc dòng dõi trực hệ của vị Tổng thống đầu tiên của đất nước.", "eng": "She descends in a direct line from the country's first President."}, {"viet": "Cô ấy kiếm được đủ để cung cấp đều đặn quần áo đẹp cho mình và cả gia đình.", "eng": "She earns enough to keep herself and all the family in good clothes."}, {"viet": "Bà ta đấu tranh trong cuộc bầu cử dưới ngọn cờ bình quyền.", "eng": "She fought the election under the banner of equal rights."}, {"viet": "Cô ta trở nên rất lo lắng trước cuộc phỏng vấn.", "eng": "She got herself into a real state before the interview."}, {"viet": "Cô ta phải lựa chọn giữa thôi việc hoặc thuê một bà vú.", "eng": "She had to choose giving up her job or hiring a nanny."}, {"viet": "Bà ấy không bao giờ coi sự mù loà của mình là một nỗi bất hạnh.", "eng": "She has never regarded her blindness as affliction."}, {"viet": "Cô ta hỏi tôi hết sức lịch sự là tôi có muốn tiếp tục không?", "eng": "She inquired of me most politely whether I wished to continue?"}, {"viet": "Cô ấy có thâm niên cao hơn tôi, vì cô vào làm công ty trước tôi.", "eng": "She is senior to me, since she joined the firm before me."}, {"viet": "Bà ta lên lớp chúng tôi về danh dự của trường và các chuyện đại loại như thế.", "eng": "She lectured us about the honour of the school and all that jazz."}, {"viet": "Bà ta thích nghe lỏm những chuyện ngồi lê đôi mách của người khác.", "eng": "She loves listening in to other people's gossip."}, {"viet": "Cô ta không bao giờ làm nhiều hơn điều cô có thể tránh.", "eng": "She never does more work than she can help."}, {"viet": "Cô ta đã đầu độc chồng mình, hoặc truyện kể như vậy.", "eng": "She poisoned her husband, or so the story runs."}, {"viet": "Chị ta từ chối không tuyên bố gì cả chừng nào chị ta nói với luật sư của mình.", "eng": "She refused to make a statement until she had spoken to her attorney."}, {"viet": "Tinh thần lạc quan của cô ấy đã bị nhụt đi dần.", "eng": "She's been sapped of her optimism."}, {"viet": "Bà ta là hiện thân của lòng tốt.", "eng": "She's the epitome of kindness."}, {"viet": "Bà ta có vẻ rất thoải mái-trong khung cảnh tự nhiên của bà ta, có thể nói như vậy.", "eng": "She seemed very relaxed-in her natural setting as it were."}, {"viet": "Bà ta đã lẩn tránh vấn đề chi phí cao cho kế hoạch của bà ấy.", "eng": "She slurred over the high cost of her plan."}, {"viet": "Cô ấy dụi tắt điếu thuốc lá sau hơi thuốc đầu tiên.", "eng": "She stubbed out the cigarette after the first puff."}, {"viet": "Bà ta la rầy mấy đứa nhỏ vì chúng quậy phá ầm ĩ.", "eng": "She told the children off for making so much noise."}, {"viet": "Trước đây cô ấy vẫn hát hay nhưng bây giờ cô ấy hát hay hơn bao giờ hết.", "eng": "She used to sing well but now she sings better than ever."}, {"viet": "Cô ta run hết cả người.", "eng": "She was all of a tremble."}, {"viet": "Cô ta bị cản trở về việc lên chức.", "eng": "She was done out of her promotion."}, {"viet": "Cô ta ì ạch lên cầu thang với những đồ mua sắm.", "eng": "She was labouring up the stairs with the shopping."}, {"viet": "Chị ấy huấn luyện ngựa của mình để dự thi.", "eng": "She was schooling her horse for the competition."}, {"viet": "Cô ta đã bị bỏ tù một cách bất công mà không được xét xử.", "eng": "She was unjustly imprisoned without trial."}, {"viet": "Cô ta đi Luân Đôn bất chợt.", "eng": "She went to London on the spur of the moment."}, {"viet": "Bà ấy làm việc nhiều tiếng đồng hồ, điều đó có hại cho sức khoẻ.", "eng": "She worked long hours to the detriment of her health."}, {"viet": "Trừ phi có một phép mầu không thì bây giờ thế nào chúng tôi cũng thua.", "eng": "Short of the miracle, we're certain to lose now."}, {"viet": "Simon học hành tốt ở trường.", "eng": "Simon is doing very well at school."}, {"viet": "Phác thảo các đề nghị về con đường mới.", "eng": "Sketch out proposals for a new road."}, {"viet": "Hút thuốc là một trong những điều tôi ghét nhất.", "eng": "Smoking is one of my aversions."}, {"viet": "Thế là anh đã luồn được đoạn dây điện ấy vào cái lỗ nhỏ ở đó: thật là tài!", "eng": "So you fitted that wire through that little hole there: that's very ingenious!"}, {"viet": "Một số đoạn trích từ một mớ tác phẩm thời kỳ Phục Hưng được nhét bừa vào nhạc Don Juan tẻ nhạt của soạn giả Gluck.", "eng": "Some excerpts from a Renaissance mass are spatchcocked into Gluck's pallid Don Juan music."}, {"viet": "Một số người thấy về hưu là khó khăn, nhưng ông ta đã coi việc đó bình thường.", "eng": "Some people find retiring difficult, but he has taken it all in his stride."}, {"viet": "Ai đó đã làm vỡ cái tách: ai là thủ phạm?", "eng": "Someone broke a cup: who was the culprit?"}, {"viet": "Nghe như thể anh xuất thân từ một gia đình có nghề nghiệp chuyên môn.", "eng": "Sounds as if you come from a professional family."}, {"viet": "Nhân viên phải ở lại sau giờ làm việc để làm cho kịp công việc của họ.", "eng": "Staff must stay behind after hours to catch up on their work."}, {"viet": "Khuấy nước sốt để không cho nó vón lại.", "eng": "Stir the sauce to prevent it lumping."}, {"viet": "Dâu tây mà ướp đông lạnh ăn không ngon.", "eng": "Strawberries don't taste nice if they've been frozen."}, {"viet": "Thái độ như vậy sẽ làm anh mất cảm tình của mọi người.", "eng": "Such behavior will lose you every sympathy."}, {"viet": "Những vết xước sơ có thể mất dấu vết dễ dàng.", "eng": "Superficial scratches can be easily removed."}, {"viet": "Tìm cách giải quyết vấn đề nhập cư nan giải.", "eng": "Tackle the vexed question of immigration."}, {"viet": "Nói điện thoại trọn 2 giờ đồng hồ.", "eng": "Talking on the telephone for quite 2 hours."}, {"viet": "Hãy kể với chúng tôi chính xác những gì đã xảy ra và đừng nói quanh co.", "eng": "Tell us exactly what happened and don't prevaricate."}, {"viet": "Vì thời tiết xấu, trận đấu đã bị hủy bỏ.", "eng": "Thanks to the bad weather, the match had been cancelled."}, {"viet": "Cậu bé đó ném một hòn đá vào tôi.", "eng": "That boy threw a rock at me."}, {"viet": "Tất cả đã ở trong quá khứ rồi, Nó không liên quan gì đến việc xảy ra hôm nay.", "eng": "That is all in the past, It has no bearing on what is happening today."}, {"viet": "Chắc là thức ăn đủ dùng cho tất cả chúng ta.", "eng": "That ought to be enough food for all of us."}, {"viet": "Kẻ nham hiểm giấu mặt đó báo cáo tôi với ông chủ.", "eng": "That snake in the grass reported me to the boss."}, {"viet": "Chuyến tàu đi Vinh khởi hành ở sân ga số 4.", "eng": "The 10.15 to Vinh departs from platform 4."}, {"viet": "Chất lượng cách âm của nhà hát rất tốt.", "eng": "The acoustics of the theatre are very good."}, {"viet": "Sân bay có rừng bao quanh tứ phía.", "eng": "The airfield is bounded by woods on all sides."}, {"viet": "Giải pháp cho vấn đề của anh ta sờ sờ trước mắt anh ta.", "eng": "The answer to his problem was staring him in the face."}, {"viet": "Quân đội không nhận anh ta vì lý do thiếu sức khỏe.", "eng": "The army rejected him as medically unfit."}, {"viet": "Toàn thể khán giả đứng lên hoan hô diễn giả.", "eng": "The audience rose bodily to cheer the speaker."}, {"viet": "Đứa bé đang ngọ nguậy các ngón chân của nó.", "eng": "The baby was wriggling its toes."}, {"viet": "Chủ ngân hàng sẽ so sánh chữ ký mẫu trên ngân phiếu du lịch với chữ ký mẫu.", "eng": "The banker will compare the signature on traveller's cheque with the specimen signature."}, {"viet": "Chiếc giường xếp gọn vào tường.", "eng": "The bed folds away into the wall."}, {"viet": "Chim đập vỗ cánh loạn xạ.", "eng": "The birds wings were beating frantically."}, {"viet": "Bom nổ làm gãy chân tay các chiến sĩ.", "eng": "The bomb blast severed the limbs of the soldiers."}, {"viet": "Ông chủ đang huấn luyện một phụ tá mới.", "eng": "The boss is breaking in a new assistant."}, {"viet": "Cành cây quất trở lại và đập vào mặt tôi.", "eng": "The branch whipped back and hit me in the face."}, {"viet": "Các toà nhà rất hoà hợp với cảnh vật.", "eng": "The buildings are well integrated with the landscape."}, {"viet": "Việc tính toán quả thật khó, song cuối cùng chúng tôi đã giải được.", "eng": "The calculation was difficult, but we finally cracked it."}, {"viet": "Chiếc ôtô tông vào đứa bé đánh thịch một cái nghe ghê người.", "eng": "The car hit the child with a sickening thud."}, {"viet": "Chiếc xe ba gác lăn lốc cốc trên con đường rải sỏi.", "eng": "The cart clattered over the cobble-stone."}, {"viet": "Buổi lễ diễn ra không gặp một trở ngại nào.", "eng": "The ceremony went off without a hitch."}, {"viet": "Chiếc xương gà mắc vào trong cổ họng anh ta.", "eng": "The chicken bones lodged in his throat."}, {"viet": "Em bé gái đã được tặng một phần thưởng để làm cho bố mẹ em đỡ bị thất vọng.", "eng": "The child was given a prize as a sop to her disappointed parents."}, {"viet": "Tuần tới trẻ em sẽ phải trở lại trường.", "eng": "The children have to go back to school next week."}, {"viet": "Các em học sinh ngạc nhiên khi thầy giáo của mình đột ngột đi vào.", "eng": "The children were surprised by the sudden entry of their teacher."}, {"viet": "Lớp học cần phải có ít nhất là 6 học sinh thì mới tiếp tục được.", "eng": "The class needs a minimum of 6 pupils to continue."}, {"viet": "Xe ca quá đầy nên một xe tăng cường đã được bổ sung.", "eng": "The coach was full so a relief was put on."}, {"viet": "Sự dành ngân khoản cho thuốc men.", "eng": "The commitment of funds to medicine."}, {"viet": "Công ty nóng lòng mở rộng sang thị trường mới.", "eng": "The company is eager to expand into new markets."}, {"viet": "Cuộc xung đột giữa Hồng Quân và Bạch Vệ.", "eng": "The conflict between Reds and Whites."}, {"viet": "Bản sao giống y hệt nguyên bản.", "eng": "The copy was identical with the original."}, {"viet": "Trước khi có trận động đất xảy đến bất ngờ thì đất nước vẫn phồn vinh.", "eng": "The country was prosperous until an earthquake supervened."}, {"viet": "Tên tội phạm đã bị bắt sau một cuộc săn đuổi bằng xe ô tô.", "eng": "The criminal was caught after a car chase."}, {"viet": "Sự khác nhau về văn hoá giữa Anh và Pháp.", "eng": "The culture gap between Britain and France."}, {"viet": "Tia sáng đầu tiên của hy vọng, tình yêu, trí thông minh, nền văn minh.", "eng": "The dawn of hope, love, intelligence, civilization."}, {"viet": "Sự khéo léo tinh tế của một chiếc đồng hồ đẹp.", "eng": "The delicate craftsmanship of a fine watch."}, {"viet": "Mã số vùng của London là 01.", "eng": "The dialing code for the London area is 01."}, {"viet": "Sự không cân xứng giữa đồng lương và trách nhiệm của cô ta.", "eng": "The disproportion between her salary and her responsibilities."}, {"viet": "Bác sĩ lấy mẫu máu ở cánh tay anh ấy.", "eng": "The doctor took a specimen of blood from his arm."}, {"viet": "Con chó đang nhảy giỡn một cách khỏe khoắn và đầy sinh khí.", "eng": "The dog was bouncing with health and vitality."}, {"viet": "Người tài xế đã bị thiệt mạng trong vụ đụng xe nhưng cả hai hành khách đều thoát nạn không hề hấn gì.", "eng": "The driver of the car was killed in the crash but both passengers escaped unhurt."}, {"viet": "Các nhà kinh tế học tiên đoán tỉ lệ lạm phát sẽ tăng.", "eng": "The economists predicted an increase in the rate of inflation."}, {"viet": "Quân địch mở một cuộc tấn công quy mô.", "eng": "The enemy launched a full-scale offensive."}, {"viet": "Cái bản chất của tình trạng tỉnh nhỏ này là cách thức đối xử nhau thân thiện, tin cậy và khiêm tốn.", "eng": "The essence of this small-town state is a friendly, trusting, just-folks way of dealing with one another."}, {"viet": "Cuộc thí nghiệm đó gặp rắc rối tai hại.", "eng": "The experiment went disastrously wrong."}, {"viet": "Cuộc khủng hoảng trong gia đình thật sự đã bộc lộ ra phẩm chất cao đẹp nhất trong con người chị ấy.", "eng": "The family crisis bought out the best in her."}, {"viet": "Mùi hôi thối của xác chết đang thối rữa.", "eng": "The fetid odour of the decomposing corpses."}, {"viet": "Các nhà làm phim đã chú thích tất cả những bài hát trong phim.", "eng": "The filmmakers have captioned all the songs in the movie."}, {"viet": "Xí nghiệp bố trí cho tôi một thư ký riêng.", "eng": "The firm put a secretary at my disposal."}, {"viet": "Ngọn lửa chiếu sáng những cột khói.", "eng": "The flames illuminated billows of smoke."}, {"viet": "Ảnh hưởng của cái ác vẫn còn hoành hành.", "eng": "The forces of evil still at work today."}, {"viet": "Cú đá bóng của hậu vệ đi xa tới 50 mét rơi vào đám đông.", "eng": "The full-back's kick carried 50 metres into the crowd."}, {"viet": "Cổng ngoài chốt ở bên trong.", "eng": "The gate bolts on the inside."}, {"viet": "Thời huy hoàng đã qua của nhạc pop.", "eng": "The glory days of pop music."}, {"viet": "Chính phủ chấp nhận cho anh ta nhiều đặc quyền.", "eng": "The government concedes him many privileges."}, {"viet": "Chính phủ đang tiếng hành một chiến dịch chống lại sự phân biệt giới tính trong công nghiệp.", "eng": "The government is waging a campaign against sex discrimination in industry."}, {"viet": "Người ta đổ xô về những vùng ngoại ô.", "eng": "The gravitation of people toward the suburbs."}, {"viet": "Con gái và cháu trai của người khách trọ sẽ đến thăm bà ấy.", "eng": "The guest's daughter and grandson are coming to see her."}, {"viet": "Hình đầu Nữ hoàng hiện trên mặt phải của các đồng tiền Anh.", "eng": "The head of the Queen appears on the obverse of British coins."}, {"viet": "Phần thú vị nhất của chuyến du lịch là đi tham quan cung điện.", "eng": "The highlight of your tour was seeing the palace."}, {"viet": "Nữ chủ nhà sẽ rất vui vì bạn tán thưởng tài nấu ăn của cô ấy và sẽ đem cho bạn thêm một phần nữa.", "eng": "The hostess will be glad that you appreciate her cooking and will give you an extra portion."}, {"viet": "Căn nhà cần được làm vệ sinh.", "eng": "The house needs a good clean."}, {"viet": "Ý tưởng Mặt Trời xoay quanh Trái Đất từ lâu đã không được tin nữa.", "eng": "The idea that the sun goes round the Earth has long been discredited."}, {"viet": "Mức lạm phát đã lên tới hai con số.", "eng": "The inflation rate is into double figures."}, {"viet": "Quân xâm lược đã chặt lìa tay chân của tù binh và ném những thân hình bị tùng xẻo của họ xuống hào.", "eng": "The invaders cut off their prisoners'arms and legs and threw their mutilated bodies into the ditch."}, {"viet": "Đi từ London đến Oxford mất khoảng một giờ rưỡi.", "eng": "The journey from London to Oxford takes about an hour and a half."}, {"viet": "Vụ bắt cóc đó xảy ra giữa ban ngày ban mặt.", "eng": "The kidnapping occurred in broad day light."}, {"viet": "Phần lớn của bộ não là não.", "eng": "The largest part of the brain is the cerebrum."}, {"viet": "Vai trò lãnh đạo do một người hoàn toàn không nổi tiếng đảm nhiệm.", "eng": "The leading role is played by a complete unknown."}, {"viet": "Vẻ sáng ngời và tinh anh hiện ra trong đôi mắt của một đứa trẻ.", "eng": "The light and vivacity that laugh in the eyes of a child."}, {"viet": "Sự xa cách nhau lâu dài là một thử thách tình yêu của họ.", "eng": "The long separation was a test of their love."}, {"viet": "Nhà ảo thuật biến một con thỏ từ mũ ra.", "eng": "The magician conjured the rabbit out of the hat."}, {"viet": "Giám đốc chịu trách nhiệm công việc điều hành hàng ngày của khách sạn.", "eng": "The manager is responsible for the day-to-day running of the hotel."}, {"viet": "Những khuôn mặt hốc hác của lũ trẻ đói ăn.", "eng": "The meagre faces of the starving children."}, {"viet": "Quân lính giải tán nhanh chóng sau cuộc diễu binh.", "eng": "The men fell out quickly after their match."}, {"viet": "Biên bản của phiên họp cuối đã được thông qua.", "eng": "The minutes of the last meeting were approved."}, {"viet": "Cuộc sống đạo đức ở nông thôn sẽ chìm vào sự băng hoại.", "eng": "The moral life of country will sink into atrophy."}, {"viet": "Bộ phim nói về một nhà khoa học đã phát minh ra một cái máy để sao mọi vật ở tỉ lệ cực nhỏ.", "eng": "The movie is about a scientist who invents a machine to miniaturize things."}, {"viet": "Kim la bàn chỉ về phương bắc.", "eng": "The needle of a compass points to the north."}, {"viet": "Các đạo luật mới đã được tán thành rộng rãi.", "eng": "The new laws gained widespread acceptace."}, {"viet": "Đường tàu điện ngầm sẽ làm cho đường ra sân bay được dễ dàng.", "eng": "The new underground railway will facilitate the journey to the airport."}, {"viet": "Sáu tháng tiếp sau sẽ là gay go nhất.", "eng": "The next six months will be the hardest."}, {"viet": "Số vụ trộm cắp trong khu vực đang giảm.", "eng": "The number of robberies in the area is on the decline."}, {"viet": "Sĩ quan và thuỷ thủ của tàu chạy hơi nước London.", "eng": "The officers and crew of the SS London."}, {"viet": "Bọn trẻ con cũ chọc ghẹo và chế giễu những đứa mới tới.", "eng": "The older children teased and made game of the newcomers."}, {"viet": "Khu chỉnh hình trong bệnh viện.", "eng": "The orthopaedics department in the hospital."}, {"viet": "Giấy dán tường đã bắt đầu bong.", "eng": "The paper was beginning to peel off the walls."}, {"viet": "Con đường đi tới thành công, thắng lợi, giàu có, quyền lực, thất bại.", "eng": "The path to success, victory, riches, power, ruin."}, {"viet": "Người được bầu có thể làm những việc thiếu khôn ngoan để nổi tiếng.", "eng": "The people that are elected may do unwise things to make themselves popular."}, {"viet": "Bức tranh gồm nhiều chấm màu khác biệt nhau.", "eng": "The picture consisted of a lot of discrete spots of colour."}, {"viet": "Kế hoạch đó có ba mục đích.", "eng": "The plan has a triple purpose."}, {"viet": "Vở kịch đó được các nhà phê bình đón nhận thuận lợi.", "eng": "The play got a favourable reception from the critics."}, {"viet": "Cảnh sát đang lần theo một số đường dây để điều tra.", "eng": "The police are following several lines of inquiry."}, {"viet": "Cảnh sát nhắc nhở các lái xe đừng để ô tô của mình không khóa.", "eng": "The police have warned motorists not to leave their car unlocked."}, {"viet": "Người cảnh sát ra hiệu cho họ ngừng lại.", "eng": "The policeman signed for them to stop."}, {"viet": "Cuộc đình công của công nhân bưu điện vẫn còn tiếp diễn.", "eng": "The postal strike is still on."}, {"viet": "Bài diễn văn của Tổng thống đã thúc đẩy toàn dân có những nỗ lực to lớn hơn.", "eng": "The president's speech impelled the nation to greater efforts."}, {"viet": "Giá này vượt quá xa khả năng của chúng tôi.", "eng": "The price is way above what we can afford."}, {"viet": "Tù nhân hãy còn bị giữ để thẩm tra.", "eng": "The prisoner is still under examination."}, {"viet": "Chương trình gồm có hai bài xô-nát của Mozart.", "eng": "The programme includes two Mozart sonatas."}, {"viet": "Dân chúng lớn tiếng đòi thay đổi chính phủ.", "eng": "The public are clamouring for a change of government."}, {"viet": "Nữ hoàng đã đền đáp công lao của ông ta bằng một tước hiệu hiệp sĩ.", "eng": "The Queen requited his services with a knighthood."}, {"viet": "Sự sinh trưởng nhanh chóng của cây cối, mọc tóc nhanh, tăng nhanh lạm phát, tăng trưởng nhanh của kinh tế.", "eng": "The rapid growth of plants, of hair, of inflation, of the economy."}, {"viet": "Những cải cách đã được công chúng vui vẻ chấp nhận.", "eng": "The reforms have been well received by the public."}, {"viet": "Sự đặt chỗ trước cho tuần đầu tháng Sáu.", "eng": "The reservation for the first week in June."}, {"viet": "Người cưỡi ngựa phi nhanh tới nơi đến của mình.", "eng": "The rider spurred forward to his destination."}, {"viet": "Con đường vòng sang trái sau khi đi qua nhà thờ.", "eng": "The road turns to the left after the church."}, {"viet": "Họ hồng và họ đậu thuộc cùng một bộ.", "eng": "The rose and the bean families belong to the same order."}, {"viet": "Thang lương xếp từ 8.000 đến 20.000 bảng Anh.", "eng": "The salary scale goes from £ 8,000 to £ 20,000."}, {"viet": "Trường học khuyến khích tự do diễn đạt trong nghệ thuật, kịch và sáng tác viết.", "eng": "The school encourages free expression in art, drama and creative writing."}, {"viet": "Tất cả các đấu thủ hạt giống đều thắng trong các trận đấu của họ.", "eng": "The seeded players all won their matches."}, {"viet": "Cái chòi ở bên cạnh căn nhà.", "eng": "The shed is to the side of the house."}, {"viet": "Những chiếc tàu này đang trên một vùng biển chưa có tên trên bản đồ, để tìm ra một con đường mới đi tới Viễn Đông.", "eng": "The ships were on their way over an unmapped sea to find a new route to the Far East."}, {"viet": "Trông thấy một tên cướp mang súng đeo mặt nạ tôi sợ chết khiếp.", "eng": "The sight of the masked gunman made my blood freeze."}, {"viet": "Sự thoái hoá dần dần các năng lực tinh thần của ông ta theo tuổi tác.", "eng": "The slow degeneration of his mental faculties with age."}, {"viet": "Những người lính bò lên dưới màn đêm.", "eng": "The soldiers crept forward under cover of darkness."}, {"viet": "Diễn giả kết thúc buổi họp bằng lời cám ơn vị chủ toạ.", "eng": "The speaker closed the meeting with a word of thanks to the chairman."}, {"viet": "Chất lượng trung bình công việc của cô ta cao.", "eng": "The standard of her work is high."}, {"viet": "Cơn gió dữ dội tối qua đã thổi tung nhiều mái nhà.", "eng": "The storm last night swept away the roofs."}, {"viet": "Giám đốc phòng thu sẽ ra hiệu cho cô khi đến lượt cô hát.", "eng": "The studio manager will cue you in when it's your turn to sing."}, {"viet": "Bác sĩ phẫu thuật tiến hành ca mổ.", "eng": "The surgeon has performed the operation."}, {"viet": "Thầy giáo cho chúng tôi một bài luận ( để làm ) ở nhà.", "eng": "The teacher gave us an essay ( to do ) for our homework."}, {"viet": "Máy truyền hình có thể được trả làm mười tháng, mỗi tháng 850 pao.", "eng": "The television can be paid for in ten monthly payments of 850 pounds."}, {"viet": "Tên trộm đeo râu giả và kính để cải trang.", "eng": "The thief wore a false beard and glasses as a disguise."}, {"viet": "Lán để dụng cụ nằm ở cuối vườn.", "eng": "The tool shed is at the bottom of the garden."}, {"viet": "Giá bưu cước tăng lên.", "eng": "The train travelled at a great rate postage rates went up."}, {"viet": "Chiếc xe tải suýt nữa thì đổ ở lối rẽ ngoặt trên núi.", "eng": "The truck nearly came off the road on a hairpin bend in the mountains."}, {"viet": "Hai bên rút lui sau khi bị thiệt hại nặng nề.", "eng": "The two sides disengaged after suffering heavy loss."}, {"viet": "Lập trường không thể biện hộ được của Hội đoàn cho rằng quả đất bẹt.", "eng": "The untenable position of the Flat Earth Society."}, {"viet": "Trong làng có ba quán rượu mỗi quán cách nhau không quá một trăm mét.", "eng": "The village has three pubs within a hundred metres of each other."}, {"viet": "Chiếc đồng hồ được bảo hành một năm.", "eng": "The watch comes with a year's guarantee."}, {"viet": "Toàn bộ nét đặc sắc của làng này đã thay đổi kể từ lần cuối cùng tôi tới đây.", "eng": "The whole character of the village has changed since I was last here."}, {"viet": "Người thắng đã được tặng cúp.", "eng": "The winner was presented with a trophy."}, {"viet": "Công nhân sẽ không bao giờ chấp nhận một sự cắt giảm tiền lương.", "eng": "The workers would never agree to take a cut in wages."}, {"viet": "Việc họ chấp nhận hợp đồng vẫn còn là không chắc chắn.", "eng": "Their acceptance of the contract is still in doubt."}, {"viet": "Cuộc sống của họ đã bị tan vỡ bởi thảm kịch đó và họ đang cố sức hàn gắn lại.", "eng": "Their lives were shattered by the tragedy and they are still trying to pick up the pieces."}, {"viet": "Thế là một dân tộc mới ở miền nam tràn vào châu Âu.", "eng": "Then a new people pushed into Europe from the south."}, {"viet": "Có một cặp vợ chồng với một con chó sống ở nhà trước mặt.", "eng": "There's a couple with a dog who live opposite."}, {"viet": "Có ít điều để nói với cô ta bây giờ.", "eng": "There's little point in telling her now."}, {"viet": "Có cái gì mắc giữa hai răng của tôi và tôi không thể lấy ra được.", "eng": "There's something between my teeth and I can't dislodge it."}, {"viet": "Có nhiều loại tuyến trong cơ thể.", "eng": "There are many glands of different kinds in our bodies."}, {"viet": "Ở đó có ba cửa hiệu, cửa hiệu bánh mì ở giữa.", "eng": "There are three shops there-the baker's in the middle one."}, {"viet": "Tôi e rằng ở điểm đó tôi không thể đồng ý được với anh.", "eng": "There I have to disagree with you, I'm afraid."}, {"viet": "Có một đường hầm qua núi dẫn tới lâu đài.", "eng": "There is an underground passage from the cliff to the castle."}, {"viet": "Có một sự nhất trí chung về vấn đề này.", "eng": "There is universal agreement on this issue."}, {"viet": "Hôm qua có một cảnh sát đứng trước cửa nhà.", "eng": "There was a policeman outside the house yesterday."}, {"viet": "Nơi đó có rất ít chuyện mua bán.", "eng": "There was very little buying and selling."}, {"viet": "Sẽ có hai lần nghỉ trong buổi trình diễn.", "eng": "There will be two intervals during the performance."}, {"viet": "Đôi tất này sẽ giữ cho tay anh ấm.", "eng": "These gloves will keep your hands warm."}, {"viet": "Bức tường đá này làm chúng ta nghĩ đến những thời cổ xưa.", "eng": "These stone-walls remind us of the old time."}, {"viet": "Họ đã nói huyên thuyên trên điện thoại gần một tiếng đồng hồ.", "eng": "They've been gabbing on the phone for nearly an hour."}, {"viet": "Họ gây thiệt hại cho chính đất nước họ yêu.", "eng": "They are disserving the country they love."}, {"viet": "Cả hai vợ chồng đều đi làm và có chị vú trông nom nhà cửa.", "eng": "They both go out to work and have a nanny living in."}, {"viet": "Họ không thể quyết định đi đâu vào ngày nghỉ.", "eng": "They couldn't make a decision about where to go on holiday."}, {"viet": "Họ trao cho nhau chiếc hôn cuối cùng trước lúc chia tay.", "eng": "They exchanged a final kiss before parting."}, {"viet": "Các thành phố cũng phải tự bảo vệ để chống lại các nhà quí tộc láng giềng có âm mưu thôn tính mình.", "eng": "They had to protect themselves, too, from neighboring nobles who wanted to conquer them."}, {"viet": "Họ không đủ tiền để cho nó vào đại học.", "eng": "They lacked the money to send him to university."}, {"viet": "Chắc là họ sắp tham dự ngày hội thể thao của trường.", "eng": "They must be going to attend their school's sports day."}, {"viet": "Người ta chất vấn ứng cử viên về các quan điểm của ông ta.", "eng": "They question the candidate on his views."}, {"viet": "Họ chia đều với nhau công việc nội trợ.", "eng": "They share the housework equally between them."}, {"viet": "Họ khám phá ra một âm mưu giết vua.", "eng": "They uncovered a plot to kill the king."}, {"viet": "Họ được uỷ quyền nêu quan điểm của chúng tôi trước Quốc hội.", "eng": "They were deputed to put our views to the assembly."}, {"viet": "Họ sẽ gửi vé cho tôi ngay khi họ nhận được séc của tôi.", "eng": "They will post the tickets to me as soon as they receive my cheque."}, {"viet": "Bãi biển này để bơi thì tốt nhưng để lướt sóng thì không thích hợp.", "eng": "This beach is good for swimming but bad for surfing."}, {"viet": "Thuốc ho này có vị dễ chịu nhưng nó không công hiệu lắm.", "eng": "This cough medicine tastes nice but it doesn't do much good."}, {"viet": "Chuyến bay này đi Chicago qua New York.", "eng": "This flight is routed to Chicago via New York."}, {"viet": "Tôi là Mary Smith ở phòng 821.", "eng": "This is Mary Smith in Room 821."}, {"viet": "Các núm vặn này chỉ được gắn bằng băng dính.", "eng": "This knob is only held on by sellotape."}, {"viet": "Việc dạm mời bằng lương cao và một ngôi nhà không mất tiền mua thật là hấp dẫn.", "eng": "This offer of a high salary and a free house is very seductive."}, {"viet": "Báo cáo này phơi bày điều giả tưởng là lương cao gây nên thất nghiệp.", "eng": "This report should explode the myth that hight wages cause unemployment."}, {"viet": "Cái bàn này làm bằng nhiều loại gỗ khác nhau.", "eng": "This table is made out of different kinds of wood."}, {"viet": "Những vách đá này là nơi sinh đẻ tốt nhất cho loài chim ở Bắc Bán Cầu.", "eng": "Those cliffs are the finest bird breeding grounds in Northern Hemisphere."}, {"viet": "Món đặc sản hôm nay rất ngon, món thịt gà thái miếng xào tiêu và đậu dị.", "eng": "Today's special is very good, Diced Chicken with Pepper and Black Beans."}, {"viet": "Dạy những con vật cảnh cũng na ná như dạy trẻ con.", "eng": "Training pet animals is somewhat akin to training children."}, {"viet": "Tĩnh mạch đem máu trở về tim.", "eng": "Veins bring it back to the heart."}, {"viet": "Quần áo, mốt, ý nghĩ, âm nhạc, thơ kỳ cục.", "eng": "Way-out clothes, fashions, ideas, music, poetry."}, {"viet": "Chúng ta sẽ lấy cái này làm điểm khởi đầu cho cuộc thảo luận của chúng ta.", "eng": "We'll take this as the starting-point for our discussion."}, {"viet": "Chúng tôi sẽ làm đơn xin cho anh được quyền có một trường học trong làng.", "eng": "We're petitioning for your right to keep a school in our village."}, {"viet": "Chúng tôi đã dần dần gắn bó khăng khít với ngôi nhà này và chẳng muốn dọn đi chút nào.", "eng": "We've grown very attached to this house and would hate to move."}, {"viet": "Chúng tôi luôn luôn có một số bàn không dành riêng.", "eng": "We always keep a few unreserved tables."}, {"viet": "Chúng tôi thành thật xin lỗi về tất cả sự bê bối này.", "eng": "We are terribly sorry for all this mess."}, {"viet": "Chúng ta không thể xét đoán điều anh ta làm cho đến khi chúng ta biết tất cả mọi tình huống.", "eng": "We can't judge what he did until we know all the circumstances."}, {"viet": "Chúng tôi leo xuống vách núi.", "eng": "We clambered down the side of the cliff."}, {"viet": "Chúng tôi không tính tiền thẻ tín dụng.", "eng": "We don't charge anything for credit card."}, {"viet": "Chúng tôi cho năm đứa trẻ mỗi đứa một phần bằng nhau.", "eng": "We gave each of the five children an equal share."}, {"viet": "Chúng tôi phải cười trước cái vô lý của tình thế.", "eng": "We had to laugh at the absurdity of the situation."}, {"viet": "Ở đây chúng ta có nhiều việc quá không làm xuể-chúng ta có thể thuê thêm người không?", "eng": "We have more work here than we can deal with-can we farm some out?"}, {"viet": "Chúng tôi lập tức nhận ra rằng chúng tôi rất tâm đầu ý hợp.", "eng": "We immediately realized that we were kindred spirits."}, {"viet": "Chúng tôi thất bại trong cuộc bầu cử vì sự lãnh đạm của những người ủng hộ chúng tôi.", "eng": "We lost the election because of the apathy of our supporters."}, {"viet": "Chúng ta phải đi tìm nó, dù có chắc là sẽ không tìm thấy nó.", "eng": "We must look for it, though we probably shan't find it."}, {"viet": "Chúng tôi chỉ thỉnh thoảng mới rửa xe ôtô.", "eng": "We only clean the car once in a blue moon."}, {"viet": "Chúng tôi tôn trọng ước muốn của anh ấy và tôi hi vọng anh cũng làm như vậy.", "eng": "We respect his wishes and we hope you will do likewise."}, {"viet": "Chúng tôi đã tìm vất vả mãi mà vẫn không tìm được câu trả lời.", "eng": "We sought long and hard but found no answer."}, {"viet": "Chúng tôi đã báo giá thấp nhất rồi đấy ạ.", "eng": "We've already quoted our lowest price."}, {"viet": "Chúng ta lái xe với tốc độ chậm nhưng đều đặn khoảng 30 dặm.", "eng": "We were driving along at a slow but steady speed of about 30 mph."}, {"viet": "Chúng tôi mong sẽ nhận được đơn đặt hàng của ông.", "eng": "We will look forward to receiving your order."}, {"viet": "Thưa các vị, như các vị đều biết mục đích cuộc họp lần này là nhằm đánh giá sơ bộ về sản phẩm CP21.", "eng": "Well, gentlemen, as you know the purpose of this meeting is to make a preliminary evaluation of product CP21."}, {"viet": "À, thứ sáu là ngày nghỉ lễ, vì vậy chúng ta hãy đi nhé.", "eng": "Well, there's a public holiday on Friday, so let's go."}, {"viet": "Con đường ngắn nhất từ London đến Edinburgh là đường nào?", "eng": "What's the shortest route from London to Edinburgh?"}, {"viet": "Các ngành công nghiệp hàng đầu ở nước bạn là những ngành nào?", "eng": "What are the top industries of your country?"}, {"viet": "Cậu muốn nói gì với từ \"phải\"?", "eng": "What do you mean \"have to\"?"}, {"viet": "Cái gì ảnh hưởng nhiều nhất đến việc chọn nghề của anh?", "eng": "What influenced you most in your choice of career?"}, {"viet": "Nơi này nổi tiếng về cái gì?", "eng": "What is this place famous for?"}, {"viet": "Những gì các báo chí sẽ làm không bao giờ khiến tôi hết ngạc nhiên.", "eng": "What newspapers will do for a story never fails to astound me."}, {"viet": "Chương trình bắt đầu lúc mấy giờ?", "eng": "What time does the program begin?"}, {"viet": "Khi trời bắt đầu sáng, chúng tôi có thể thấy được những thiệt hại do bão đã gây ra.", "eng": "When day dawned, we could see the damage the storm had caused."}, {"viet": "Khi nghe thấy tiếng trên mái nhà, tôi nhận ra là trời đang mưa.", "eng": "When I heard the noise on the roof, I realized that it was raining."}, {"viet": "Khi đã qua cơn bĩ cực, nó mới lấy lại được can đảm để tiếp tục.", "eng": "When the chips were down he found the courage to carry on."}, {"viet": "Khi nào thì công việc xây cất sẽ hoàn thành?", "eng": "When will the building work be complete?"}, {"viet": "Người da đỏ sống ở đâu nhiều nhất?", "eng": "Where do the most Indians live?"}, {"viet": "Bạn thích cách nào hơn, đi du lịch bằng máy bay hay bằng đường biển?", "eng": "Which do you prefer, traveling by air or by sea?"}, {"viet": "Trong khi chúng tôi chơi quần vợt, thì các anh sẽ làm gì?", "eng": "While we play tennis what will the rest of you do?"}, {"viet": "Ai là người có thể được lợi nhất theo các luật mới về thuế?", "eng": "Who stands to be benefited most by the new tax laws?"}, {"viet": "Sao anh không ghé qua tôi khi anh đến thành phố lần sau?", "eng": "Why don't you look in next time you're in town?"}, {"viet": "Trên chuyến bay này sẽ có phục vụ bữa ăn không?", "eng": "Will there be a meal served on this flight?"}, {"viet": "William Trương ở Công ty Thương mại Phương Đông.", "eng": "William Chang of the Oriental Trading Company."}, {"viet": "Với sự thất bại của chính phủ trong việc giải quyết vấn đề thất nghiệp, cần phải có một cách tiếp cận mới.", "eng": "With the government's failure to solve the problem of unemployment, a fresh approach is indicated."}, {"viet": "Thế thứ ba có tiện cho ông không?", "eng": "Would Tuesday be convenient for you?"}, {"viet": "Ông có muốn xem qua chúng không?", "eng": "Would you like to look over them?"}, {"viet": "Con sẽ đem rác ra nhé?", "eng": "Would you take out the garbage?"}, {"viet": "Có, tôi rất say mê nó đấy.", "eng": "Yes, I am very keen on it."}, {"viet": "Lại thêm một nạn nhân khác của chính sách chính phủ về quỹ y tế quốc gia.", "eng": "Yet another victim of government policy on national health funding."}, {"viet": "Ông sẽ hụt tiền khi đổi lại đồng yên.", "eng": "You'll lose money when you change them back to yen."}, {"viet": "Mày đã bị bắt quả tang gian lận-giờ thì mày phải chấp nhận hậu quả.", "eng": "You've been caught cheating-now you must face the music."}, {"viet": "Anh không thích mặt quần áo thích hợp cho mùa nóng này.", "eng": "You aren't wearing proper clothes for this hot weather."}, {"viet": "Anh có thể mượn máy chữ của tôi, hôm nay tôi không cần đến nó.", "eng": "You can borrow my typewriter, I won't be needing it today."}, {"viet": "Anh có thể tin ở cô ta: cô ấy rất tử tế đúng mực.", "eng": "You can trust her: she's the salt of the earth."}, {"viet": "Cho tiền vào đây và cà phê sẽ ra ở kia.", "eng": "You feed in the money here and the coffee comes out there."}, {"viet": "Các ông đã báo cho chúng tôi biết là hàng đã được gửi đi tuần rồi.", "eng": "You informed us that the goods had been dispatched last week."}, {"viet": "Có phải loại khoa học và kinh tế học hay những cuốn đại loại như thế?", "eng": "You mean science and economics and books like that?"}, {"viet": "Khi chọn mua cái gì, bạn cần phải cân nhắc giá của nó.", "eng": "You must take the price into account when choosing which one to buy."}, {"viet": "Bà biết đấy, nếu bà muốn chuyển đổi lại nhân dân tệ còn lại sang ngoại tệ, trước tiên bà phải trình bản ghi nhớ đổi tiền có liên quan và ngân hàng phải giữ nó.", "eng": "You see if you want to convert the leftover RMB back into foreign currencies first you should present the relevant exchange memo and the bank are to keep it."}, {"viet": "Anh không thể hy vọng tìm được hạnh phúc hoàn mỹ-nó chỉ là ảo ảnh mà thôi.", "eng": "You shouldn't hope to find perfect happiness-it's just a will-o'-the-wisp."}, {"viet": "Bạn sẽ thấy rằng thiết bị dành cho những môn thể thao này thường có thể được cho thuê, để ngay cả du khách cũng có thể tham gia được.", "eng": "You will find that the equipment for these sports can often be rented, so that even visitors are not excluded."}, {"viet": "Những cuốn truyện hài hước của bạn chất chồng cao quá.", "eng": "Your comic books are piled up too high."}, {"viet": "Lương của anh sẽ là 12000 pao một năm cộng thêm tiền tăng hàng năm là 500 pao.", "eng": "Your salary will be 12000 pounds a year, with annual increments of 500 pounds."}]