[{"viet": "20.000 bảng Anh là một số tiền lương rất đáng kể.", "eng": "£ 20.000 is a very respectable salary."}, {"viet": "Một chiếc hộp thu được trong vụ tai nạn với các thứ bên trong của nó còn nguyên vẹn.", "eng": "A box recovered from an accident with its contents intact."}, {"viet": "Cái thú duy nhất của tôi là sau mỗi bữa ăn hút một điếu xì gà.", "eng": "A cigar after dinner is my only indulgence."}, {"viet": "Một cảnh trình diễn âm nhạc công phu rất tốn kém trên truyền hình.", "eng": "A costly musical extravaganza on television."}, {"viet": "Một đề tài tế nhị nhưng được xử lý khéo.", "eng": "A delicate but well-handled subject."}, {"viet": "Một người say rượu không thể bị buộc là có trách nhiệm đầy đủ về hành vi của anh ta.", "eng": "A drunk man cannot be held fully responsible for his actions."}, {"viet": "Phạt vạ đối với sự sai lầm này là đương nhiên.", "eng": "A fine for this offence is automatic."}, {"viet": "Có tài nói chuyện tầm bậy.", "eng": "A gift for saying the wrong thing."}, {"viet": "Một ứng cử viên thống đốc tiểu bang bị mất lòng dân nhanh chóng sau một cuộc tranh luận tai hại.", "eng": "A gubernatorial candidate whose popularity haemorrhaged after a disastrous debate."}, {"viet": "Một con ngựa thích thú lăn mình trên cỏ.", "eng": "A horse enjoying a roll in the grass."}, {"viet": "Một chiếc đèn treo ở trần nhà phía trên đầu chúng tôi.", "eng": "A lamp was suspended from the ceiling above us."}, {"viet": "Một con sư tử đã xổng chuồng.", "eng": "A lion has escaped from its cage."}, {"viet": "Một dấu hiệu của nhà sản xuất in ở mặt sau của cái đĩa.", "eng": "A maker's mark on the reverse of a plate."}, {"viet": "Một sai lầm có thể làm hỏng sự nghiệp của anh ta.", "eng": "A mistake that could mar his career."}, {"viet": "Một kế hoạch mới của cảnh sát nhằm khống chế đám đông.", "eng": "A new police strategy for crowd control."}, {"viet": "Bưu kiện này vừa gửi tới ghi tên người nhận là cậu.", "eng": "A parcel has just come, addressed to you."}, {"viet": "Một món đồ đạc, nữ trang, hành lý, đồ sứ.", "eng": "A piece of furniture, jewellery, luggage, porcelain."}, {"viet": "Buổi cầu nguyện để tưởng nhớ những người đã ngã xuống trong chiến tranh.", "eng": "A prayer was said in memory of these who fell in the war."}, {"viet": "Một sự duyệt xét tận gốc các phương pháp chế tạo.", "eng": "A radical review of manufacturing methods."}, {"viet": "Một con đường được làm trên một nền xà bần.", "eng": "A road built on a foundation of rubble."}, {"viet": "Một cuốn hồi ký tự xuất bản.", "eng": "A self-published volume of memoirs."}, {"viet": "Một tình thế trong đó nền an ninh quốc gia bị ảnh hưởng.", "eng": "A situation in which national security is involved."}, {"viet": "Một cái lao trong tay một người ném thiện nghệ có thể là một vũ khí ném rất nguy hiểm.", "eng": "A spear in the hands of a skillful thrower can be a dangerous missile."}, {"viet": "Một sinh viên nghiên cứu chính trị, nhân bản, thần học.", "eng": "A student of politics, human nature, theology."}, {"viet": "Một sự phản đối hết sức công phẫn đã nổi lên chống lại những đề nghị mới về thuế khoá.", "eng": "A terrific hue and cry was raised against the new tax proposals."}, {"viet": "Một đơn vị bộ đội có trình độ huấn luyện cao.", "eng": "A unit of highly-trained soldiers."}, {"viet": "Một lão già gian ác và hiểm độc.", "eng": "A wicked, evil-minded old man."}, {"viet": "Theo John thì tuần trước anh ở Edinburgh.", "eng": "According to John you were in Edinburgh last week."}, {"viet": "Chỉ dành cho các hội viên được quyền vào câu lạc bộ.", "eng": "Admission to the club is restricted to members only."}, {"viet": "Sau khi được phía công tố thẩm vấn thêm, nhân chứng được phép rời khỏi tòa án.", "eng": "After further examination by the prosecution the witness was allowed to leave the court."}, {"viet": "Sau đó, chúng tôi đã đi đường tắt đến công viên.", "eng": "After that, we took a short cut to the park."}, {"viet": "Viện trợ cho thế giới thứ ba hiện nay chỉ như muối bỏ biển.", "eng": "Aid to the Third World is at present little more than a drop in the ocean."}, {"viet": "Tất cả những người khác tự cho là mình đang nói tiếng Anh đều đang nói những thứ tiếng địa phương.", "eng": "All other who claim to speak the language are speaking dialects."}, {"viet": "Tất cả những rắc rối đó là do một nhóm nhỏ những người bất bình đang gây ra.", "eng": "All the trouble is being caused by a handful of malcontents."}, {"viet": "Tôi có tỏ ra không biết điều khi yêu cầu anh giúp đỡ tôi không?", "eng": "Am I being unreasonable in asking you to help me?"}, {"viet": "Một câu chuyện cổ được thể hiện dưới nhiều hình thức khác nhau trong một số ngôn ngữ châu Âu.", "eng": "An ancient tale which appears in various guises in several European languages."}, {"viet": "Một bài luận văn đề cập đến mối hoài nghi triết học.", "eng": "An essay treating of philosophical doubt."}, {"viet": "Một nét thông minh trên gương mặt của người nào đó.", "eng": "An intelligent expression on somebody's face."}, {"viet": "Một sự giải thích quá đơn giản các lý do về hạnh kiểm của đứa trẻ.", "eng": "An oversimplified interpretation of the reasons for the child's behaviour."}, {"viet": "Thế con không muốn học môn nào?", "eng": "And what you won't you be taking?"}, {"viet": "Bất cứ ai cũng sẽ chỉ cho em trạm xe buýt ở đâu.", "eng": "Anybody will tell you where the bus stop is."}, {"viet": "Tôi có phải hoàn tất thủ tục nào không?", "eng": "Are there any formalities I've to go through?"}, {"viet": "Bạn sẽ làm đơn xin công việc đó chứ?", "eng": "Are you going to put in for that job?"}, {"viet": "Arizona và California cũng trồng bông.", "eng": "Arizona and California raise cotton, too."}, {"viet": "Vì anh ấy luôn luôn tươi vui nên anh có tên giễu là anh Cười.", "eng": "As he was always cheerful he had the nickname Smiler."}, {"viet": "Yêu cầu thợ uốn tóc gội và sấy tóc.", "eng": "Ask a hairdresser for a wash and blow-dry."}, {"viet": "Bán với giá đó thì rẻ như bèo!", "eng": "At that price it's an absolute gift!"}, {"viet": "Chờ đợi sự chấp thuận của tòa án.", "eng": "Awaiting the approbation of the court."}, {"viet": "Hãy cẩn thận về tiền bạc và chi tiêu tùy theo ngân sách.", "eng": "Be careful with the money and work to a budget."}, {"viet": "Hoàn toàn tàn nhẫn trong quyết tâm đạt tới thành công của ai.", "eng": "Be utterly ruthless in one's determination to succeed."}, {"viet": "Anh tin hay không tùy anh, người ta đã để chúng tôi chờ ở ngoài mưa suốt hai giờ đồng hồ.", "eng": "Believe it or not, we were left waiting in the rain for two hours."}, {"viet": "Máu trào ra từ vết thương.", "eng": "Blood was welling out from the wound."}, {"viet": "Nước Anh đã chuyển đổi sang hệ thống tiền tệ thập phân vào năm 1971.", "eng": "Britain converted to a decimal currency system in 1971."}, {"viet": "Tôi cự lại, nhưng anh ta quá trẻ mà.", "eng": "But he's too young, I objected."}, {"viet": "Nhưng lễ hội powwow hiện đại không giống như trong phim.", "eng": "But the modern powwow isn't like the ones in the movies."}, {"viet": "Trời ơi, tôi nghĩ là anh đúng rồi!", "eng": "By Jove, I think you're right!"}, {"viet": "Cậu có thể kể rõ chi tiết cho mình biết chuyện gì đã xảy ra hay không?", "eng": "Can fill me in on what has been happening?"}, {"viet": "Có thể cứu vãn cho ngôi trường khỏi bị đóng cửa được không?", "eng": "Can the school be saved from closure?"}, {"viet": "Xin anh phụ tôi cái thùng này được không?", "eng": "Can you help me with this box?"}, {"viet": "Cô có thể cho tôi biết chỗ ngồi của tôi ở đâu không?", "eng": "Can you tell me where my seat is?"}, {"viet": "Trâu bò được đóng một dấu phân biệt.", "eng": "Cattle branded with a distinctive mark."}, {"viet": "Đám trẻ chạy chân không trên cát.", "eng": "Children running barefooted in the sand."}, {"viet": "Quần áo để chất đống dưới đất.", "eng": "Clothes left in heaps on the ground."}, {"viet": "Óc thực tiễn rốt cuộc đã chiến thắng.", "eng": "Common sense triumphed in the end."}, {"viet": "Xem xét vấn đề theo lý thuyết.", "eng": "Consider the problem in the abstract."}, {"viet": "Anh có thể đùa với bọn trẻ, khoảng một giờ trong khi em làm bữa tối được không?", "eng": "Could you entertain the children for an hour, while I make supper?"}, {"viet": "Hãy tin tôi, tôi sẽ đỡ bạn nếu bạn ngã.", "eng": "Count on me, I'll catch you if you fall."}, {"viet": "Bố đang chợp mắt một lát bên cạnh lò sưởi.", "eng": "Dad was snoozing by the fire."}, {"viet": "Đòi hỏi việc rút quân đội nước ngoài.", "eng": "Demand the withdrawal of foreign troops."}, {"viet": "Đọc một văn thư cho thư ký của ai.", "eng": "Dictate a letter to one's secretary."}, {"viet": "Anh có gặp ngay ông giám đốc không?", "eng": "Did you see the manager himself?"}, {"viet": "Phóng lớn góc âm bản này.", "eng": "Do a blow-up of this corner of the negative."}, {"viet": "Chúng ta có phải đi xa mới đến cổng không?", "eng": "Do we have to go far to the gate?"}, {"viet": "Anh có rượu vang trắng nguyên chất chứ?", "eng": "Do you have a dry white wine?"}, {"viet": "Bạn có biết người nào đã chết vì làm việc quá sức không?", "eng": "Do you know anybody who died from overwork?"}, {"viet": "Cháu có cần thêm một cái chăn nữa không?", "eng": "Do you need an extra blanket?"}, {"viet": "Bạn có nghĩ rằng các tòa nhà công cộng nên là những nơi cấm hút thuốc không?", "eng": "Do you think that public buildings should be non-smoking buildings?"}, {"viet": "Anh ta có nằm trong số những người thất bại không?", "eng": "Does he rank with the failures?"}, {"viet": "Đừng để những lời khen của ông ta đánh lừa-tất cả những lời đó đều là nói đùa.", "eng": "Don't be fooled by all his complimentary remarks-they were all said with tongue in cheek."}, {"viet": "Đừng quên đem theo bên mình cái ô khi anh đi nhé.", "eng": "Don't forget to take your umbrella with you when you go."}, {"viet": "Đừng mở cái đó trước ngày sinh nhật của con.", "eng": "Don't open it till your birthday."}, {"viet": "Đừng thử bất cứ pha biểu diễn nào trong số những pha liều lĩnh ấy.", "eng": "Don't try any of those daredevil stunts."}, {"viet": "Moi móc lại những tình tiết của giai đoạn đó ở Cairo.", "eng": "Dredge up details of that episode in Cairo."}, {"viet": "Mỗi người tham dự sẽ trả tiền phí tổn của mình.", "eng": "Each participant was to pay his own expenses."}, {"viet": "Đội Anh đã bị thua trong trận tái đấu.", "eng": "England were worsted in the replay."}, {"viet": "Các biến cố hẳn đã chứng minh được sự sáng suốt trong quyết định của họ.", "eng": "Events were to prove the wisdom of their decision."}, {"viet": "Xin lỗi, nhưng tôi không nghe rõ tên ông lắm.", "eng": "Excuse me, but I didn't quite get your name."}, {"viet": "Đội cảnh sát đặc biệt đang được biệt phái đến để trấn áp đám đông.", "eng": "Extra police are being drafted in to control the crowds."}, {"viet": "Cảm thấy gần gũi với sự đau khổ của một đứa trẻ.", "eng": "Feel a child's suffering at one remove."}, {"viet": "Có chứ, nhưng tôi nghi bán hết vé rồi.", "eng": "Fine, but I suspect it's sold out."}, {"viet": "Nước lũ bao phủ những cánh đồng gần sông.", "eng": "Flood water covered the fields by the river."}, {"viet": "Giờ đây qua nhiều năm Mỹ đã và đang trải qua một cuộc cải cách kinh tế quan liêu riêng của mình với giá phải trả là nạn thất nghiệp và đủ thứ thay đổi nhức nhối nhưng cuối cùng có lợi.", "eng": "For several years now the U. S has been going through its own perestroika at the cost of unemployment and all kinds of painful but ultimately beneficial change."}, {"viet": "Hàng tươi sống được chở đi bằng xe tải.", "eng": "Fresh supplies were shipped out by lorry."}, {"viet": "Nói chung, món ăn Quảng Đông có phần thanh đạm và loãng, món ăn Tứ Xuyên có vị đậm đà và cay.", "eng": "Generally, Cantonese food is a bit light and clear, Sichuan food has a strong and hot taste."}, {"viet": "Trình diễn sinh động một bản thánh ca của Bach.", "eng": "Give a spirited rendition of a Bach chorale."}, {"viet": "Hãy đi lấy một quyển từ điển và chúng ta sẽ tra từ đó.", "eng": "Go and get a dictionary and we'll look the word up."}, {"viet": "Biện pháp quá mức cần thiết của chính phủ trong việc giải quyết vấn đề bất đồng quan điểm.", "eng": "Government overkill in dealing with dissent."}, {"viet": "Treo quần áo lên dây phơi.", "eng": "Hang out the clothes on the line."}, {"viet": "Có phải tất cả các bạn đã đòi quyền được nghỉ trọn kỳ phép phải không?", "eng": "Have you all claimed your full holiday entitlements?"}, {"viet": "Em đã tính đi nghỉ hè thì tốn hết bao nhiêu chưa?", "eng": "Have you figured out how much the holiday will cost?"}, {"viet": "Việc có thêm một đứa con phải chăm sóc đã cản trở khá nhiều đến sự phấn đấu của cô ấy.", "eng": "Having a new baby to look after has clipped her wings a bit."}, {"viet": "Hắn là một tên ăn cắp và một thằng nói dối, tôi sẽ chẳng dính dáng gì tới hắn cả nếu tôi là anh.", "eng": "He's a thief and a liar, I'd have nothing to do with him, if I were you."}, {"viet": "Anh ấy đang được điều trị bệnh bạch cầu bằng xteroit.", "eng": "He's being treated with steroids for leukaemia."}, {"viet": "Ông ấy sắp kết thúc chuyến đi lưu diễn ở Mỹ.", "eng": "He's just finishing his tour in the United States."}, {"viet": "Nó vẫn cứ hy vọng rồi có một cái gì đó sẽ đến.", "eng": "He's still hoping something will turn up."}, {"viet": "Hắn trêu cô ta chỉ bằng cách cứ nhìn cô ta.", "eng": "He aggravates her just by looking at her."}, {"viet": "Anh ta gõ nhịp bằng ngón tay theo điệu nhạc.", "eng": "He beat time to the music with his fingers."}, {"viet": "Ông ta đến đây không có bạn bè hoặc tài sản và đã làm giàu.", "eng": "He came here without friends or possessions and made his fortune."}, {"viet": "Anh ta leo lên cây và nấp giữa các cành cây.", "eng": "He climbed up the tree and hide among the branches."}, {"viet": "Anh ta đong đưa cái đồng hồ trước mặt đứa bé.", "eng": "He dangled his watch in front of the baby."}, {"viet": "Ông ta chia hết tài sản và cho mỗi đứa con một phần.", "eng": "He divided up his property and gave a portion to each of his children."}, {"viet": "Ông ấy đã phát âm các từ rất chuẩn xác.", "eng": "He enunciated the words very precisely."}, {"viet": "Cuối cùng anh ta đã tìm được đúng cái áo sơ mi mà anh ta thích.", "eng": "He finally spotted just the shirt he wanted."}, {"viet": "Anh ta đã bỏ công việc của mình ở nhà máy để chuyển sang nghề viết lách.", "eng": "He gave up his job in the factory in order to write."}, {"viet": "Hắn đã cãi nhau với chị hắn.", "eng": "He had a scrap with his sister."}, {"viet": "Anh ấy có tài mô phỏng.", "eng": "He has a gift for pastiche."}, {"viet": "Ông ta chẳng nói gì với chúng tôi về những ý định của ông ta.", "eng": "He has given us no intimation of his intentions."}, {"viet": "Hắn không có một nét gì hào hiệp trong con người hắn.", "eng": "He hasn't a spark of generosity in him."}, {"viet": "Ông ta sợ mất khách hàng.", "eng": "He is afraid of losing customers."}, {"viet": "Ông ta có quan điểm hơi quá hẹp hòi.", "eng": "He is rather too parochial in his outlook."}, {"viet": "Nó cứ xen ý kiến riêng của nó vào hoài.", "eng": "He kept chiming in with his own opinions."}, {"viet": "Anh ta sống theo châm ngôn hãy làm những điều ta thuyết giảng.", "eng": "He lived by the precept practice what you preach."}, {"viet": "Ông ta đọc một bài phát biểu sau bữa tiệc rất tẻ nhạt.", "eng": "He made a very boring after-dinner speech."}, {"viet": "Anh ta không được phép uống bia; anh ta đang tập dượt ráo riết chuẩn bị cho trận đấu sắp tới của mình.", "eng": "He mustn't drink beer; he's in strict training for his next fight."}, {"viet": "Anh ta vẽ trong thời gian rảnh rỗi của mình.", "eng": "He paints in his spare time."}, {"viet": "Ông ta tuyên bố mình thỏa mãn với những tiến bộ đạt được.", "eng": "He professed himself satisfied with the progress made."}, {"viet": "Nó bỏ chạy, những lời chế nhạo của họ vẫn còn vang trong tai nó.", "eng": "He ran off, their jeers ringing in his ears."}, {"viet": "Anh ấy đã đặt quá nhiều niềm tin vào cô ấy.", "eng": "He reposed too much confidence in her."}, {"viet": "Ông ấy là một người khá kín đáo.", "eng": "He's a rather private person."}, {"viet": "Anh ấy thực chất là người rất hào phóng.", "eng": "He's essentially a very generous man."}, {"viet": "Anh ta không hẳn là người thích đùa.", "eng": "He's not exactly a bundle of fun."}, {"viet": "Anh ấy được đánh giá cao trong công ty.", "eng": "He's very well-considered within the company."}, {"viet": "Anh ta vét món trộn ra khỏi cái bát bằng con dao nhựa.", "eng": "He scraped the mixture out of the bowl with a plastic spatula."}, {"viet": "Hắn gọi tôi từ phía bên kia phòng.", "eng": "He shouted to me across the room."}, {"viet": "Tối nào hắn cũng đi nhậu trong quán bình dân với các bạn thân của hắn.", "eng": "He spends every evening drinking in the pub with his cronies."}, {"viet": "Anh ta đã ăn cắp tiền khi không có ai bên cạnh.", "eng": "He stole the money when no one was by."}, {"viet": "Anh ta thề lấy thề để là anh ta sẽ không tìm cách trốn.", "eng": "He swore blind he wouldn't try to escape."}, {"viet": "Ông ấy bảo công việc của họ phải được cải tiến nếu không họ sẽ bị sa thải.", "eng": "He told them their work must improve or they would be fired."}, {"viet": "Anh ta cố gia nhập quân đội nhưng đã bị loại thẳng thừng vì sức khỏe kém.", "eng": "He tried to join the army but was turned down flat because of poor health."}, {"viet": "Hắn thốt ra một tràng những lời thô tục.", "eng": "He uttered a stream of profanities."}, {"viet": "Anh ta bị buộc tội hèn nhát trước mặt kẻ thù.", "eng": "He was accused of cowardice in the face of the enemy."}, {"viet": "Anh ta bị chèn ngã trong khu phạt đền 11 mét.", "eng": "He was brought down in the penalty area."}, {"viet": "Ông ta đã được nhất trí bầu lên.", "eng": "He was elected by a unanimous vote."}, {"viet": "Hắn ta đã bị truy tố về tội giết người.", "eng": "He was indicted for murder."}, {"viet": "Ông ta đã bị hất ra khỏi chức chủ tịch.", "eng": "He was ousted from his position as chairman."}, {"viet": "Hắn ta giận đến nỗi gần sùi bọt mép.", "eng": "He was so angry that he was almost frothing at the mouth."}, {"viet": "Nó không biết là tôi có mặt.", "eng": "He was unaware of my presence."}, {"viet": "Anh ta hoàn toàn mất bình tĩnh khi họ báo cho anh ta cái tin bi thảm đó.", "eng": "He went to pieces when they told him the tragic news."}, {"viet": "Nó tiếp tục làm việc, quên cả thời gian.", "eng": "He worked on, unmindful of the time."}, {"viet": "Những bước chân nặng nề báo hiệu là thầy giáo đang đến gần.", "eng": "Heavy footsteps signalled the teacher's approach."}, {"viet": "Bà dì Effie của cô ta rõ ràng là một người lập dị.", "eng": "Her Aunt Effie is certainly an original."}, {"viet": "Sự tiếp thu giáo dục ở nông thôn đã giải thích tình yêu của cô ta đối với thiên nhiên.", "eng": "Her country upbringing explains her love of nature."}, {"viet": "Mặt cô ta đầy các nốt ong vò vẽ đốt.", "eng": "Her face was covered in wasp sting."}, {"viet": "Thái độ hoài nghi hợp lý của cô đối với nhà chức trách.", "eng": "Her healthy scepticism towards authority."}, {"viet": "Những bài giảng của bà ta bao trùm mọi khía cạnh của đề tài.", "eng": "Her lectures covered the subject thoroughly."}, {"viet": "Bác sĩ sản khoa đã không thể có mặt khi đẻ.", "eng": "Her obstetrician could not be present at the birth."}, {"viet": "Việc cô ta khước từ hắn có vẻ đã làm hắn dè dặt hơn.", "eng": "Her rejection of him seems to have made him go back into his shell."}, {"viet": "Các câu chuyện của cô ấy bộc lộ một nét hài hước phong phú.", "eng": "Her stories struck a rich vein of humour."}, {"viet": "Mời anh uống tạm chén trà, lát nữa chúng ta sẽ ăn cái gì đó.", "eng": "Here's a cup of tea to be going on with, we'll have something to eat later."}, {"viet": "Đạo Hinđu và đạo Phật đều là tôn giáo của Phương Đông.", "eng": "Hinduism and Buddhism are Eastern religions."}, {"viet": "Những cách cư xử tệ của hắn làm tôi khó chịu.", "eng": "His bad manners grate on my nerves."}, {"viet": "Người cùng đóng trong phim với anh ấy là Maggie Smith.", "eng": "His co-star in the film was Maggie Smith."}, {"viet": "Giáo dục của anh ấy làm cho anh ấy có thành kiến với người nước ngoài.", "eng": "His education biases him against foreigners."}, {"viet": "Nỗi sợ hãi lộ ra trong ánh mắt anh ta.", "eng": "His fear showed in his eyes."}, {"viet": "Tính thật thà của hắn chưa bao giờ bị nghi ngờ.", "eng": "His honesty has never been called in question."}, {"viet": "Thư của hắn đầy những lời nịnh hót.", "eng": "His letter was dripping with flattery."}, {"viet": "Quan bảo tụi mình phải làm việc đó đấy.", "eng": "His nibs says we must do it."}, {"viet": "Việc thực hành và thuyết giảng của ông ta không đi đôi với nhau.", "eng": "His practice does not consort with his preaching."}, {"viet": "Đôi giày của anh ta luôn luôn được đánh thật bóng.", "eng": "His shoes were always well polished."}, {"viet": "Cuộc nói chuyện của ông ấy đã được hoan nghênh nhiệt liệt.", "eng": "His talk was given a warm reception."}, {"viet": "Công việc của anh ta không đem lại kết quả thực sự.", "eng": "His work did not yield tangible results."}, {"viet": "Thật lòng mà nói, tôi không làm việc đó.", "eng": "Honest to goodness, I didn't do it."}, {"viet": "Còn chuyến xe lửa kế tiếp nữa thì sao?", "eng": "How about the next one after that?"}, {"viet": "Sao anh dám bôi nhọ tính nết vợ tôi!", "eng": "How dare you cast aspersions on my wife's character!"}, {"viet": "Bạn đánh vần tên của bạn như thế nào?", "eng": "How do you spell your name?"}, {"viet": "Bạn đã làm việc ở công ty hiện giờ bao lâu rồi?", "eng": "How long have you worked at your current company?"}, {"viet": "Có bao nhiêu người lằm việc ở công ty ABC?", "eng": "How many people are employed at ABC Corporation?"}, {"viet": "Thuế doanh thu ở nước bạn là bao nhiêu?", "eng": "How much is sales tax in your country?"}, {"viet": "Anh sẽ đối phó thế nào với một tên kẻ trộm có vũ khí?", "eng": "How would you deal with an armed burglar?"}, {"viet": "Tôi rất buồn nếu anh nghĩ rằng tôi không thích anh.", "eng": "I'd be sorry if you were to think that I disliked you."}, {"viet": "Tôi muốn rút ba trăm đô la Mỹ trong tài khoản của tôi.", "eng": "I'd like to withdraw three hundred US dollars from my account."}, {"viet": "Tôi sẽ cho anh vài cái tên để gặp gỡ và làm quen với họ ở đó.", "eng": "I'll give you a few names of people to hook up with them there."}, {"viet": "Tôi sẽ thừa nhận là những cái đó hữu hiệu.", "eng": "I'll say this, they're efficient."}, {"viet": "Tôi e rằng tôi đã ngủ quá giấc và nhỡ chuyến xe buýt thường ngày.", "eng": "I'm afraid I overslept and missed my usual bus."}, {"viet": "Tôi sắp lấy vợ trong tuần tới, nhưng xin anh đừng tiết lộ với ai về chuyện đó nhé.", "eng": "I'm getting married next week, but please don't let on to anyone about it, will you?"}, {"viet": "Tôi có khuynh hướng tin rằng anh ta vô tội.", "eng": "I'm inclined to believe he's innocent."}, {"viet": "Trong cuộc tranh luận này tôi đồng quan điểm với George.", "eng": "I'm on George's side in this debate."}, {"viet": "Xin lỗi đã gây cho bạn quá nhiều phiền toái.", "eng": "I'm sorry to have put you to all this bother."}, {"viet": "Tôi đang cố gắng học cách sử dụng hệ thống điện thoại mới.", "eng": "I'm trying to get the hang of the new telephone system."}, {"viet": "Tôi đã định gọi điện thoại cho anh nhưng tôi bận quá.", "eng": "I've been meaning to call you but I've been too busy."}, {"viet": "Tôi đã nhờ chuyển tiền cho mẹ tôi từ đây.", "eng": "I've got my money transferred to my mother from here."}, {"viet": "Trước đây tôi chưa bao giờ thấy anh tôi say bí tỉ như thế.", "eng": "I've never seen my brother so totally aped before."}, {"viet": "Hiện giờ tôi rất eo hẹp về tiền bạc-Tôi có thể trả anh vào tuần tới được không?", "eng": "I'm very pressed for cash at the moment-Can I pay you next week?"}, {"viet": "Tôi bực mình nghe tin nó không làm việc tốt.", "eng": "I am annoyed to hear that he does not work well."}, {"viet": "Tôi rất lo lắng về sức khoẻ của con trai tôi.", "eng": "I am very anxious about my son's health."}, {"viet": "Tôi nghĩ hôm nay là ngày 5 hoặc ngày 6 tháng 7.", "eng": "I believe it's the fifth or the sixth of July."}, {"viet": "Tôi không thể mua bất cứ thứ gì cho đến khi lĩnh lương.", "eng": "I can't buy anything until I get my wages."}, {"viet": "Tôi không thể đi chiếc xe đạp của tôi vì phanh bị kẹt.", "eng": "I can't ride my bicycle because the brakes have jammed."}, {"viet": "Tôi có thể gắng sức nâng bổng 50 cân.", "eng": "I can lift 50 kilos with an effort."}, {"viet": "Tôi không thể nào hát tới những nốt cao.", "eng": "I can't hit the high notes."}, {"viet": "Tôi có thể thề là tôi nghe thấy có tiếng gõ cửa.", "eng": "I could have sworn I heard a knock at the door."}, {"viet": "Cho cháu một săn-uýt kẹp giăm bông.", "eng": "I'd like a ham sandwich."}, {"viet": "Tôi không đánh vỡ nó! Cái quai tự nó long ra trong tay tôi.", "eng": "I didn't break it! the handle came away in my hand."}, {"viet": "Tôi không tin là nó dám làm như nó doạ-nó chỉ bịp ( chúng mình ) thôi.", "eng": "I don't believe he'd really do what he threatens-he's only bluffing ( us )."}, {"viet": "Tôi chán bị trói chân ở bàn giấy suốt ngày.", "eng": "I don't like being desk bound all day."}, {"viet": "Tôi nghĩ chúng tôi không cần phòng khách hay phòng bếp nhỏ.", "eng": "I don't think we need a living room or a kitchenette."}, {"viet": "Tôi cảm thấy không khỏe chút nào.", "eng": "I don't feel any better."}, {"viet": "Tôi đã làm anh ta hiểu ra rằng anh ta phải có mặt ở đây lúc mười giờ.", "eng": "I drove home to him that he must be here by ten."}, {"viet": "Tôi thấy bối rối khi nghĩ tới cách cư xử của mình.", "eng": "I feel so embarrassed when I think of how I behaved."}, {"viet": "Tôi bay thẳng từ Montreal đến Thượng Hải và đến đây đêm qua.", "eng": "I flew direct from Montreal to Shanghai and arrived here last night."}, {"viet": "Tôi đi đến cửa hàng hầu như mỗi ngày.", "eng": "I go to the shop most every day."}, {"viet": "Tôi đã cãi nhau với Jane.", "eng": "I had a row with Jane."}, {"viet": "Tôi phải đợi xe buýt cả một tiếng đồng hồ.", "eng": "I had to wait a full hour for the bus."}, {"viet": "Tôi đã đặt một phòng đôi ở đây đến thứ hai tuần tới.", "eng": "I have booked a double room here till next Monday."}, {"viet": "Tôi chỉ có một kiến thức hạn chế về máy tính.", "eng": "I have only limited knowledge of computer."}, {"viet": "Tôi không có ôtô riêng, vì vậy tôi phải nhờ vào xe buýt.", "eng": "I haven't got a car, so I have to depend on the buses."}, {"viet": "Tôi nghe thấy một tiếng động lạ ở bên ngoài.", "eng": "I heard a strange sound outside."}, {"viet": "Tôi hy vọng sẽ viết cho anh rất sớm.", "eng": "I hope to write to you before long."}, {"viet": "Tôi chỉ nghĩ rằng anh ta thật khó ưa, có thế thôi.", "eng": "I just think he is very unpleasant, full point."}, {"viet": "Tôi sống một cuộc đời khá nhạt nhẽo, chẳng bao giờ có cái gì thú vị đối với tôi.", "eng": "I lead a pretty mundane life, nothing interesting ever happens to me."}, {"viet": "Tôi châm cái pháo bông thế là-vèo!-nó phóng lên trời.", "eng": "I lit the firework and-whoosh!-it shot up into the air."}, {"viet": "Khi nào tôi rảnh tôi sẽ gọi điện cho bạn.", "eng": "I'll give you a ring when I'm free."}, {"viet": "Tôi sẽ nghĩ tới một nơi nào đó để đến ở.", "eng": "I'll think of somewhere to stay."}, {"viet": "Tôi thèm ăn một cái gì đó.", "eng": "I'm dying for something to eat."}, {"viet": "Tôi đâu có quen biết bà đó.", "eng": "I'm not acquainted with the lady."}, {"viet": "Tôi tin chắc là ông sẽ thích nó.", "eng": "I'm sure you'll like it."}, {"viet": "Tôi có thể phạm phải một sai lầm nghiêm trọng.", "eng": "I might have committed some dreadful blunder."}, {"viet": "Tôi suýt tự tôi va đầu vào cái đà thấp đó.", "eng": "I nearly brained myself on that low beam."}, {"viet": "Tôi nhận thấy mặt ông ta thoáng cau mày có vẻ không tán thành.", "eng": "I noticed a slight frown of disapproval on his face."}, {"viet": "Tôi rất hay chơi quần vợt vào mùa hè.", "eng": "I play tennis quite a lot in the summer."}, {"viet": "Tôi nhận ra là mình đã nói lỡ lời khi tôi nhìn thấy phản ứng của cô ta.", "eng": "I realized that I has said the wrong thing when I saw her reaction."}, {"viet": "Tôi nhớ lại thầy giáo toán của tôi với lòng căm ghét.", "eng": "I remember my maths teacher with loathing."}, {"viet": "Tôi xem quảng cáo của ông trên tờ Times.", "eng": "I saw your newspaper ad in the Times."}, {"viet": "Tôi coi việc được mời là một điều vinh dự.", "eng": "I should count it an honour to be invited."}, {"viet": "Tôi vẫn không thể tìm thấy cái áo len màu xanh da trời của tôi.", "eng": "I still can't find my blue sweater."}, {"viet": "Tôi thường hay đi ngủ sớm hơn vào mùa đông.", "eng": "I tend to go to bed earlier during the winter."}, {"viet": "Tôi nghĩ thính giả của tôi cũng vậy.", "eng": "I think my listeners will, too."}, {"viet": "Tôi đang đi ngang qua chợt nghĩ tạt vào thăm anh.", "eng": "I thought I'd drop in on you while I was passing."}, {"viet": "Tuần rồi tôi đã gọi điện cho bạn nhưng không ai trả lời cả.", "eng": "I tried to call you last week but there was no answer."}, {"viet": "Tôi đến để dọn dẹp phòng của ông.", "eng": "I've come to clean your room."}, {"viet": "Tôi muốn mô tả cuộc sống trên tàu của họ.", "eng": "I want to describe their lives on the ship."}, {"viet": "Tôi đã ghen tức điên lên khi thấy chiếc xe mới lộng lẫy của anh ta.", "eng": "I was absolutely green with envy when I saw his splendid new car."}, {"viet": "Tôi định đi ngày mai nhưng tôi đã thay đổi ý kiến.", "eng": "I was going to leave tomorrow but I've changed my mind."}, {"viet": "Tôi đã bị cạn sức dần vì những tháng điều trị trong bệnh viện.", "eng": "I was sapped by months of hospital treatment."}, {"viet": "Tôi đã chứng kiến một tai nạn khủng khiếp.", "eng": "I was witness to a terrible accident."}, {"viet": "Tôi mong rằng nó sẽ chấm dứt cái trò khoản đãi bạn bè suốt ngày đêm.", "eng": "I wish he'd desist from entertaining his friends at all hours of the day and night."}, {"viet": "Tôi tự hỏi không biết có nên đội nón hay không.", "eng": "I wonder if I should have a hat."}, {"viet": "Tôi muốn một chỗ ngồi ở phía sau máy bay.", "eng": "I would like a seat in the back of the airplane."}, {"viet": "Tôi có lẽ khởi sự từ đầu này.", "eng": "I would start from this end."}, {"viet": "Nếu có ai gọi điện, bảo với anh ta ( họ ) là tôi sẽ trở lại vào lúc bốn giờ.", "eng": "If anyone calls, tell him ( them ) I'll be back about four o'clock."}, {"viet": "Nếu tôi kể cho cảnh sát là tôi đang ở với anh vào hôm đó, anh sẽ làm chứng cho tôi chứ?", "eng": "If I tell the police I was with you that day, will you back me up?"}, {"viet": "Nếu cảnh sát không can thiệp vào khi bọn chúng ra tay thì có lẽ đã có bạo lực nghiêm trọng.", "eng": "If the police had not stepped in when they did there would have been serious violence."}, {"viet": "Nếu bạn bị táo, bạn nên ăn nhiều chất xơ hơn.", "eng": "If you're constipated you should eat more roughage."}, {"viet": "Nếu con không làm bài tập ở nhà con sẽ bị mẹ quở trách đó.", "eng": "If you don't do your homework, you're going to hear from me."}, {"viet": "Nếu con làm cho vai của bố mẹ đỡ hơn, bố sẽ trả tiền cho con với bất cứ giá nào.", "eng": "If you make my shoulders better, I'll pay you any amount."}, {"viet": "Nếu anh quan sát kỹ anh sẽ thấy tôi làm cái đó như thế nào.", "eng": "If you watch carefully you will see how I do it."}, {"viet": "Tất cả các loại đồng hồ đó đều có một quả nặng làm quay các bánh xe.", "eng": "In all of them a falling weight turned the wheels around."}, {"viet": "Trong tiếng Pháp tính từ phải phù hợp với danh từ về số và giống.", "eng": "In French the adjective must agree with the noun in number and gender."}, {"viet": "Ở nhiều nơi trên thế giới có cuộc sống khó khăn, việc giết và ăn thịt người già trở thành một tục lệ ở một vài bộ lạc.", "eng": "In parts of the world where living was difficult it became the custom in some tribes to kill and eat old people."}, {"viet": "Phân tích đến cùng, tôi nghĩ rằng thiện cảm của chúng ta hướng về nhân vật nữ chính của vở kịch.", "eng": "In the final analysis I think our sympathy lies with the heroine of the play."}, {"viet": "Trên tinh thần này, tôi xin mời tất cả những người có mặt cùng tôi nâng ly chúc sức khoẻ của ngài bộ trưởng ngoại giao Đường và phu nhân, chúc sức khoẻ tất cả bạn bè của chúng ta có mặt ở đây tối nay, chúc mừng việc củng cố tình hữu nghị Mỹ-Trung.", "eng": "In this spirit, I ask all those present to join me in a toast, to the health of Foreign Minister Tang and Madame Dang, to the health of all our friends here tonight, to the strengthening of U. S.-China friendship."}, {"viet": "Thay vào đó là một khối đặc cứng có mùi thật khác với bất cứ thứ gì mà ông đã từng ăn.", "eng": "Instead, it was solid mass which tasted quite different from anything the Arab had ever eaten."}, {"viet": "Ở nước bạn, xin thị thực làm việc rất khó phải không?", "eng": "Is it very difficult to get a working visa in your country?"}, {"viet": "Còn việc gì khác tôi có thể làm cho ông bà không ạ?", "eng": "Is there anything else I can do for you?"}, {"viet": "Bây giờ là 5 giờ 30, và xe lửa sẽ đến lúc 5 giờ 42.", "eng": "It's 5: 30, and the train is to arrive at 5: 42."}, {"viet": "Trời lúc nào cũng ấm áp vào tháng 9 và tháng 10.", "eng": "It's always warm in September and October."}, {"viet": "Nhất thiết là anh phải dự tất cả các cuộc họp.", "eng": "It's essential that you attend all the meetings."}, {"viet": "Thật kỳ lạ làm thế nào mà anh ta leo được xa như vậy.", "eng": "It's marvellous how he's managed to climb that far."}, {"viet": "Đó là một trong những món đặc sản của nhà hàng.", "eng": "It's one of the specialities of the house."}, {"viet": "Đã đến lúc tôi phải bắt đầu làm một việc gì nghiêm chỉnh.", "eng": "It's time I got down to some serious work."}, {"viet": "Điều đó khơi dậy những khát khao sơ khai trong lòng nó.", "eng": "It aroused strange primeval yearnings in him."}, {"viet": "Điều đó làm tôi nổi cáu là phải quát lên mọi người mới nghe thấy.", "eng": "It irritates me to have to shout to be heard."}, {"viet": "Không thể nói được chính xác ở bất kỳ mức độ nào có bao nhiêu người bị mắc bệnh.", "eng": "It is impossible to say with any accuracy how many are affected."}, {"viet": "Đến trễ ở các cuộc họp là không phải tay làm ăn nhà nghề.", "eng": "It is unbusinesslike to arrive late for meetings."}, {"viet": "Tôi rất buồn phải đi nhưng đó là điều bắt buộc.", "eng": "It pains me to have to leave, but I must."}, {"viet": "Đó là niềm vinh hạnh của chúng tôi, thưa ông chủ.", "eng": "It's our pleasure, Mr. Chow."}, {"viet": "Chẳng bao lâu, điều trở nên hoàn toàn rõ ràng là...", "eng": "It soon became starkly evident that..."}, {"viet": "Phải tranh thủ thời gian để chấm dứt tình trạng người chết đói.", "eng": "It was a race against time to stop people dying from starvation."}, {"viet": "Trơn quá mọi người trượt và trượt khắp dọc phố.", "eng": "It was icy, and people were slipping and sliding all along the street."}, {"viet": "Phải ba tuần sau anh ta mới nghe được tin.", "eng": "It was three weeks later that he heard the news."}, {"viet": "Bình luận về vẻ ngoài của cô ta sẽ là thô lỗ.", "eng": "It would be rude to remark on her appearance."}, {"viet": "Jill là con lớn trong ba đứa con tôi.", "eng": "Jill is the eldest of my three children."}, {"viet": "Chỉ một miếng sườn cừu và một chút khoai tây.", "eng": "Just a lamp chop and a few measly potatoes."}, {"viet": "Ngôn ngữ không ngừng phát triển qua cách dùng.", "eng": "Languages develop continually through usage."}, {"viet": "Để tôi lấy cho bạn một cái gạt tàn.", "eng": "Let me get you an ashtray."}, {"viet": "Sở vận tải London cho chạy thêm những chuyến xe lửa phụ trong giờ cao điểm.", "eng": "London Transport run extra trains during the rush-hour."}, {"viet": "Nhiều người phản đổi việc bán vũ khí vì những nguyên lý đạo đức.", "eng": "Many people are opposed to the sale of arms on principle."}, {"viet": "Cô Mary người mà chúng tôi nói đến lúc nãy vừa mới bước vào.", "eng": "Mary, who we were talking about earlier, has just walked in."}, {"viet": "Tôi xem phòng radio được không?", "eng": "May I see the radio room?"}, {"viet": "Cần nhiều kinh phí của nhà nước để củng cố nền công nghiệp.", "eng": "More government spending is needed to buttress industry."}, {"viet": "Thưa ông Green, thay mặt cho phái đoàn của tôi, tôi xin tặng ông món quà nhỏ này.", "eng": "Mr. Green, on behalf of my delegation, I'd like to present you with this little gift."}, {"viet": "Tôi đoán rằng họ bị kẹt xe.", "eng": "My bet is they've got held up in the traffic."}, {"viet": "Cha tôi vẫn còn nhớ ngày đầu tiên đi học.", "eng": "My father still remember his first day at school."}, {"viet": "Mẹ tôi có nhiều nón, nên tôi mượn một chiếc của bà.", "eng": "My mother has a lot of hats so I borrowed one of hers."}, {"viet": "Những người ủng hộ tôi lại tập hợp lại quanh tôi.", "eng": "My supporters are rallying around me again."}, {"viet": "Chứng cớ mới đã được đưa ra ánh sáng.", "eng": "New evidence has recently come to light."}, {"viet": "Không, tôi lúc nào cũng chỉ uống bia thôi, cám ơn.", "eng": "No, I'll stick to beer, thanks."}, {"viet": "Không có quyền lực nào trên đời này có thể bắt tôi phải làm điều đó.", "eng": "No power on earth could force me to do it."}, {"viet": "Hiện giờ cô ta là tiếp viên hàng không nên việc đi du lịch nước ngoài không còn là sự hấp dẫn đối với cô ta.", "eng": "Now that she's an air hostess, foreign travel has lost its glamour for her."}, {"viet": "Ồ, xin lỗi, ông có biết Đại úy Lucas không?", "eng": "Oh, excuse me, do you know Lieutenant Lucas?"}, {"viet": "Old'có thể có hai từ trái nghĩa:'young'và'new'.", "eng": "Old'has two possible antonyms:'Young'and'new'."}, {"viet": "Khi anh đã hiểu quy tắc này thì anh sẽ không gặp khó khăn gì nữa?", "eng": "Once you understand this rule, you'll have no further difficulty?"}, {"viet": "Một lò lửa nhỏ trong bếp đã làm cho cả nhà bám đầy bồ hóng.", "eng": "One small fire in the kitchen covered the whole house in soot."}, {"viet": "Chúng ta không được để cho đối thủ biết được gì về kế hoạch của chúng ta.", "eng": "Our competitors must not be allowed to get wind of our plans."}, {"viet": "Nhà máy bia địa phương chúng tôi liên kết với một hãng khác.", "eng": "Our local brewery has amalgamated with another firm."}, {"viet": "Ngày nay đội chúng tôi không còn thật sự được vinh quang bao phủ, thí dụ đã bị thất bại nặng.", "eng": "Our team didn't exactly cover itself with glory today."}, {"viet": "Quốc hội bàn vấn đề nhập cư.", "eng": "Parliament debated the question of immigration."}, {"viet": "Người dân sống ở miền Đông Bắc.", "eng": "People in the Southwest eat different foods from the ones who live in the Northeast."}, {"viet": "Xin vui lòng gia hạn cho chúng tôi hai ngày.", "eng": "Please give us two-day's grace."}, {"viet": "Tiến bộ có chậm chạp nhưng chúng tôi vẫn phải tiếp tục phấn đấu.", "eng": "Progress is slow but we keep battling on."}, {"viet": "Trường học bắt đầu từ 8 giờ 30 sáng.", "eng": "School starts at 8: 30 a. m."}, {"viet": "Tôi múc xúp ra cho các anh hay các anh thích tự múc lấy?", "eng": "Shall I serve out the soup or would you like to help yourselves?"}, {"viet": "Cô ta là một cuốn sách giáo khoa sống về y học.", "eng": "She's a walking textbook of medicine."}, {"viet": "Cô bỏ gần hết bạn bè cũ hay là họ đã bỏ cô ấy!", "eng": "She's dropped most of her old friends-or they're dropped her!"}, {"viet": "Cô ấy đã làm biên tập thay đổi nhiều trong cuốn sách của họ.", "eng": "She's made a lot of editorial changes in their book."}, {"viet": "Bà ấy đang chụp một bức ảnh các con.", "eng": "She's taking a picture of the children."}, {"viet": "Bà ta luôn luôn ăn mặc rất trang nhã.", "eng": "She always dresses in the best possible taste."}, {"viet": "Cô ta lăng xăng trong bếp chuẩn bị cho cuộc liên hoan.", "eng": "She buzzed around the kitchen making preparations for the party."}, {"viet": "Chị ấy khó có thể sống được bằng số tiền trợ cấp ít ỏi dành cho người goá bụa.", "eng": "She could barely survive on the pittance she received as a widow's pension."}, {"viet": "Cô ấy làm đúng nếu anh hỏi ý kiến tôi, Moreau khẳng định.", "eng": "She did right, if you ask me, opined Moreau."}, {"viet": "Cô ấy dám cả gan nói với ông chủ là ông ấy lười biếng.", "eng": "She even had the ball to tell her boss he was lazy."}, {"viet": "Cô ta cau mày, dậm chân để diễn tả cơn giận dữ, thí dụ trong kịch câm.", "eng": "She frowned and stamped her feet to portray anger."}, {"viet": "Cô ta nồng nhiệt chào mừng anh ấy bằng một cái hôn.", "eng": "She greeted him enthusiastically with a kiss."}, {"viet": "Cô ta trao bức thư ngắn cho tôi là có ý đồ.", "eng": "She handed the note to me with a conspiratorial air."}, {"viet": "Bà ta đã nhận được nhiều việc thiết kế các toà nhà công cộng.", "eng": "She has received many commissions to design public buildings."}, {"viet": "Hôm nay cô ấy khoẻ hơn một chút, bác sĩ nói.", "eng": "She is a little better today, the doctor says."}, {"viet": "Nếu phải chọn thì cô ấy là người cuối cùng để tôi chọn.", "eng": "She is the last person I'd have chosen."}, {"viet": "Cô ấy để cát lọt qua những ngón tay mình.", "eng": "She let the sand fall through her fingers."}, {"viet": "Cô ta đã đưa ra một nhận xét độc địa về những đứa trẻ sơ sinh đã chết.", "eng": "She made a sick remark about dead babies."}, {"viet": "Cô ấy chăm nom mẹ khi bà bị ốm.", "eng": "She nursed her mother when she was ill."}, {"viet": "Cô ta dự đoán là sự cải thiện tình hình sẽ còn tiếp tục.", "eng": "She predicted that the improvement would continue."}, {"viet": "Cô ta gỡ miếng vụn giấy thuốc lá còn dính ở môi dưới.", "eng": "She removed a fragment of cigarette paper from her underlip."}, {"viet": "Bây giờ nàng bắt đầu thành một bà già rồi.", "eng": "She's getting to be an old lady now."}, {"viet": "Nàng rất hoạt bát và vui tính.", "eng": "She's very lively and full of fun."}, {"viet": "Cô ta hình như rất phản đối việc anh đi ra nước ngoài.", "eng": "She seems very much opposed to your going abroad."}, {"viet": "Cô ấy nhẹ nhàng thuyết phục anh ta đi đến chỗ đồng ý giúp đỡ cô ấy.", "eng": "She soft-soaped him into agreeing to help her."}, {"viet": "Cô ta đã kiện ông chủ của mình về việc thải hồi không công bằng.", "eng": "She sued her employer for unfair dismissal."}, {"viet": "Cô ta đã xẵng giọng vặn lại tôi khi tôi gợi ý rằng việc này chỉ thích hợp với nam giới.", "eng": "She took me up sharply when I suggested that the job was only suitable for a man."}, {"viet": "Cô ta tình nguyện giúp đỡ nhưng anh ta sợ và chùn lại.", "eng": "She volunteered to help but he was afraid and hung back."}, {"viet": "Nàng sửng sốt khi anh ta bất ngờ công kích nàng và gọi nàng là kẻ nói dối.", "eng": "She was amazed when he rounded on her and called her a liar."}, {"viet": "Cô ấy lúng túng khi họ cứ khen cô ấy thông minh.", "eng": "She was embarrassed When they kept telling her how clever she was."}, {"viet": "Cố ấy trở thành nhà thơ trong trường đại học và đã làm việc với các sinh viên trong một năm.", "eng": "She was made poet-in-residence at the university, and worked with the students for a year."}, {"viet": "Bà ta bị bắn vào chân.", "eng": "She was shot in the leg."}, {"viet": "Cô ta rất miễn cưỡng nhận sự thật.", "eng": "She was very reluctant to admit the truth."}, {"viet": "Cô ta quay tít chiếc thừng ( quanh đầu cô ta ).", "eng": "She whirled the rope round and round ( her head )."}, {"viet": "Cô ấy làm việc hòa hợp với những người cấp cao hơn cô ta trong hãng.", "eng": "She works well with those superior to her in the firm."}, {"viet": "Chúng ta có cần phải sử dụng roi trở lại như một biện pháp trừng phạt không?", "eng": "Should we bring back the birch as a punishment?"}, {"viet": "Từ ngày bà ta được bổ nhiệm, khoa này đã đi từ thành công này sang thành công khác.", "eng": "Since her appointment the department has gone from strength to strength."}, {"viet": "Chặt đứt sợi dây thừng đó bằng một thanh gươm.", "eng": "Slash through the rope with a sword."}, {"viet": "Ô kìa! Bạn có đôi giày giống hệt của tôi.", "eng": "Snap! You've got the same shoes as me."}, {"viet": "Sự bất ổn xã hội báo trước cuộc cách mạng Pháp.", "eng": "Social unrest adumbrated the French Revolution."}, {"viet": "Một vài con ngựa đang uống nước ở một cái máng.", "eng": "Some horses were drinking at a trough."}, {"viet": "Một số người cho rằng học lái xe dễ như bỡn.", "eng": "Some people think learning do drive is a breeze."}, {"viet": "Có kẻ phá cửa kính nhưng chẳng bao lâu chúng tôi đã tóm được tên phạm tội.", "eng": "Someone was breaking windows, but we soon caught the culprit."}, {"viet": "Các tia lửa bay lên ống khói.", "eng": "Sparks from the fire were flying up the chimney."}, {"viet": "Đứng lùi lại để đám rước đi qua.", "eng": "Stand back to allow the procession to pass."}, {"viet": "Thôi đừng tranh luận về các vấn đề thủ tục và ta hãy đi vào việc đi.", "eng": "Stop arguing about questions of procedure and let's get down to business."}, {"viet": "Những kẻ bỏ cuộc đình công thường bị các đồng nghiệp coi khinh.", "eng": "Strike-breakers are often despised by their work-mates."}, {"viet": "Lời phê phán tôi nghe về quyển sách này là quá đáng.", "eng": "Such criticism as I heard concerning this book is exaggerated."}, {"viet": "Cứ coi như chúng ta không nói với bất cứ người nào khác về chuyện này đấy nhé!", "eng": "Suppose we don't tell anybody else about this!"}, {"viet": "Lấy một gói xuống khỏi kệ đi.", "eng": "Take a packet off the shelf."}, {"viet": "Thuế và bảo hiểm được khấu trừ vào lương của chúng tôi.", "eng": "Tax and insurance are deducted from our wages."}, {"viet": "Tờ báo chạy hàng tít lớn: Mười người bị bọn cướp có vũ trang bắn chết.", "eng": "Ten shot dead by gunmen, ran the newspaper headline."}, {"viet": "Chiếc áo dài Ann đang mặc làm tôn vẻ đẹp của cô ta lên rất nhiều.", "eng": "That's a very flattering dress Ann's wearing."}, {"viet": "Thằng bé đó xấc xược quá thể.", "eng": "That child is a damn sight too cheeky."}, {"viet": "Đó là con cá lớn nhất xưa nay tôi chưa từng thấy.", "eng": "That is the biggest fish I've ever seen."}, {"viet": "Áp phích đó ghi “ Thuê 5 cuộn băng được miễn phí 1 cuộn ”.", "eng": "That placard reads Rent five videos and get one free."}, {"viet": "Vấn đề đó nằm ngoài phạm vi hiểu biết của tôi.", "eng": "That subject is outside my range."}, {"viet": "Ngân hàng ABC nằm trên con đường này, cách một dãy nhà ở bên trái.", "eng": "The ABC Bank is one block up this street on the left."}, {"viet": "Người diễn viên đã đạt chức vị ngôi sao điện ảnh dễ dàng nhờ cái nét duyên dáng của anh ta.", "eng": "The actor coasted to stardom on his good looks."}, {"viet": "Lòng trung thành của các công dân với chính phủ.", "eng": "The allegiance of citizens to the government."}, {"viet": "Con khỉ chuyền từ cành này sang cành khác.", "eng": "The ape swung from branch to branch."}, {"viet": "Mũi tên cắm sâu vào bức tường.", "eng": "The arrow embedded itself in the wall."}, {"viet": "Tính khắc khổ trong các biện pháp kinh tế của chính phủ.", "eng": "The austerity of the Government's economic measures."}, {"viet": "Tin buồn đó đã có tác dụng làm cho tất cả chúng tôi phải suy nghĩ.", "eng": "The bad news had a sobering effect on all of us."}, {"viet": "Anh thợ hớt tóc nói anh ta sẽ hớt cho tôi kế tiếp.", "eng": "The barber said he'd do me next."}, {"viet": "Niềm tin của những nhà chiêm tinh là các hành tinh có tác động đến cá tính của con người.", "eng": "The belief of astrologers that planets influence human character."}, {"viet": "Những ngọn núi đá màu đen vươn lên tương phản rõ rệt trên bầu trời.", "eng": "The black rocks stood out starkly against the sky."}, {"viet": "Nhân vật chính trong cuốn sách là chân dung tự họa của tác giả.", "eng": "The book's hero is a self-portrait of the author."}, {"viet": "Những nơi sâu nhất ở biển.", "eng": "The bottommost depths of the sea."}, {"viet": "Bánh mì được cắt quá mỏng.", "eng": "The bread is cut too thin."}, {"viet": "Nôi lo lắng về sự hi sinh kinh tế đè lên những người công nhân của nhà máy.", "eng": "The burden of economic sacrifice rests on the workers of the plant."}, {"viet": "Những người cắm trại đã giẫm đổ lúa mì.", "eng": "The campers had trampled the corn down."}, {"viet": "Chiếc ô tô này đã được ba năm rồi mà vẫn chưa trả hết tiền.", "eng": "The car is three years old and still unpaid for."}, {"viet": "Vụ kiện ấy được giải quyết mà không cần đưa ra tòa xét xử.", "eng": "The case was settled out of court."}, {"viet": "Vị chủ tịch hô hào các cán bộ đảng hành động.", "eng": "The chairman exhorted the party workers to action."}, {"viet": "Tay cậu bé quá nhỏ nên không với tới các phím hòa âm tám của dương cầm cùng một lúc.", "eng": "The child's hands are too small to stretch to an octave on the piano."}, {"viet": "Theo đề nghị của những người làm công tác xã hội, đứa bé đã được tách rời khỏi bố mẹ nó.", "eng": "The child was taken away from its parents on the recommendation of social workers."}, {"viet": "Bọn trẻ chen chúc ầm ĩ lên xe buýt.", "eng": "The children piled noisily into the bus."}, {"viet": "Sự lựa chọn có gia nhập liên bang hay không được quyết định bởi trưng cầu dân.", "eng": "The choice of to join the federation was decided by plebiscite."}, {"viet": "Nhân viên ngân hàng làm theo yêu cầu của khách hàng.", "eng": "The clerk did as the customer asked."}, {"viet": "Mã hiệu trên nhãn chỉ ngày sản xuất.", "eng": "The code on the label shows the date of manufacture."}, {"viet": "Uỷ ban được thành lập không hợp thức, do đó không có quyền hợp pháp.", "eng": "The committee had been improperly constituted and therefore had no legal power."}, {"viet": "Công ty nhận thêm bốn người học việc mới.", "eng": "The company is taking on four new apprentices."}, {"viet": "Mối quan hệ giữa hai sự kiện là rất mơ hồ.", "eng": "The connection between the two events is remote."}, {"viet": "Chi phí điều trị kéo dài tại bệnh viện.", "eng": "The cost of extended hospital treatment."}, {"viet": "Đôi vợ chồng đi nghỉ trên chiếc thuyền buồm nhẹ.", "eng": "The couple spent their holidays cruising around in their yacht."}, {"viet": "Các nhà phê bình thấy cuốn tiểu thuyết mới nhất của bà ta khá nghèo nàn.", "eng": "The critics found her latest novel rather thin."}, {"viet": "Sự đình đốn kinh tế hiện nay là điềm báo trước cho một sự suy thoái lớn sẽ tới.", "eng": "The current economic slump is an earnest of the major recession to come."}, {"viet": "Ngày trở nên ngắn hơn khi mùa đông sắp đến.", "eng": "The days get shorter as winter approaches."}, {"viet": "Cuộc biểu tình đã kết thúc không xảy ra rắc rối.", "eng": "The demonstration passed off without incident."}, {"viet": "Cuốn từ điển đã được xuất bản mười lần.", "eng": "The dictionary has gone through ten editions."}, {"viet": "Những xáo trộn dường như xảy đến từng đợt.", "eng": "The disturbances seem to occur in waves."}, {"viet": "Các bác sĩ đã quyết định giải phẫu cô ấy ngay lập tức.", "eng": "The doctors decided to operate on her immediately."}, {"viet": "Tính chất giáo điều của một số nhà phê bình âm nhạc, một số nhà thuyết pháp trong quần chúng, v. v.", "eng": "The dogmatism of some music critics, popular preachers, etc."}, {"viet": "Nạn hạn hán đã làm cho cơ may sống sót của chúng càng mong manh hơn.", "eng": "The drought had worsened their chances of survival."}, {"viet": "Dự luật giáo dục bị quốc hội phủ quyết.", "eng": "The Education Bill was vetoed in parliament."}, {"viet": "Một người nói năng bốp chát của nền công nghiệp điện ảnh Anh.", "eng": "The enfant terrible of the British film industry."}, {"viet": "Báo Buổi chiều, Báo London, v. v.", "eng": "The Evening Gazette, London Gazette, etc."}, {"viet": "Tiếng nổ làm tất cả các cửa sổ vỡ tan.", "eng": "The explosion shattered all the windows."}, {"viet": "Tất cả cổ động viên đều đeo phù hiệu hình hoa hồng của đội bóng Arsenal.", "eng": "The fans are all wearing Arsenal rosettes."}, {"viet": "Cuộc ẩu đả chẳng mấy chốc phải ngừng nhờ sự xuất hiện nhanh chóng của cảnh sát.", "eng": "The fight was soon stopped thanks to the prompt appearance of the police."}, {"viet": "Chiếc cầu đẹp nhất của cả nước Peru gãy và hất năm người đi trên cầu xuống vịnh phía dưới.", "eng": "The finest bridge in all Peru broke and precipitated five travelers into the gulf below."}, {"viet": "Cuộc viếng thăm đầu tiên và những cuộc viếng thăm kế tiếp đều được giữ bí mật.", "eng": "The first and subsequent visits were kept secret."}, {"viet": "Chuyến bay này đón hành khách lên tại cửa số 16.", "eng": "The flight is now boarding at gate 16."}, {"viet": "Khu rừng bừng sáng bởi ánh chớp.", "eng": "The forest was set ablaze by lightning."}, {"viet": "Những nguyên tắc cơ bản của tôn giáo, triết học, nghệ thuật, v. v.", "eng": "The fundamentals of religion, philosophy, art, etc."}, {"viet": "Viên tướng ra lệnh cho quân đội của mình rút lui.", "eng": "The general directed that his men should retreat."}, {"viet": "Hoang mạc Gô-bi ở châu á là một hoang mạc khác nữa rất rộng lớn.", "eng": "The Gobi Desert in Asia is another very large one."}, {"viet": "Chính quyền buộc Quốc hội thông qua đạo luật đó.", "eng": "The government forced the bill through Parliament."}, {"viet": "Chính phủ dự định những sự sửa đổi quan trọng trong hệ thống thuế.", "eng": "The Government plans to make important changes to the tax system."}, {"viet": "Cuộc duyệt binh lớn là một cảnh tượng hùng vĩ.", "eng": "The great military parade was a magnificent spectacles."}, {"viet": "Người khách trọ cần cuộc gọi đánh thức.", "eng": "The guest wants a wake-up call."}, {"viet": "Ông hiệu trưởng đã khen ngợi cách ăn mặc gọn gàng của các cậu học sinh.", "eng": "The headmaster praised the boys for their neat turn-out."}, {"viet": "Các ngọn đồi bị bao phủ trong sương mù.", "eng": "The hills were wreathed in mist."}, {"viet": "Nhà hàng trích ra 300 bảng Anh hàng năm khấu trừ vật dụng hư hỏng.", "eng": "The hotel allows £ 300 a year for breakages."}, {"viet": "Ngôi nhà này được xây dựng mô phỏng một biệt thự La Mã.", "eng": "The house was built in imitation of a Roman villa."}, {"viet": "Phần minh hoạ có quá nhiều chi tiết thừa.", "eng": "The illustration had too much redundant detail."}, {"viet": "Phải giết con chó bị thương ấy đi.", "eng": "The injured dog had to be destroyed."}, {"viet": "Cuộc điều tra này được tiến hành dưới sự chỉ đạo của một sĩ quan cảnh sát cao cấp.", "eng": "The investigation was carried out under the direction of a senior police officer."}, {"viet": "Vị quan tòa cho chúng tôi hoãn một thời hạn ngắn.", "eng": "The judge granted us a short adjournment."}, {"viet": "Vua đã ký văn kiện thoái vị.", "eng": "The king signed the instrument of abdication."}, {"viet": "Những người chạy lẽo đẽo sau cùng vừa mới hoàn thành cuộc đua.", "eng": "The last stragglers are just finishing the race."}, {"viet": "Những chiếc lá đang lay động trong làn gió nhẹ.", "eng": "The leaves were moving in the breeze."}, {"viet": "Ngay sau ánh chớp là tiếng sấm đùng đùng.", "eng": "The lightening was quickly followed by heavy thunder."}, {"viet": "Hàng chở trên xe tải đã được buộc chằng chắc chắn.", "eng": "The lorry's load had been securely strapped down."}, {"viet": "Các thanh nam châm kéo kim định hướng xoay xung quanh để cho biết phương hướng.", "eng": "The magnets pull the card around and tell the directions."}, {"viet": "Nhà sản xuất gói sản phẩm trong một quả nang chất dẻo.", "eng": "The manufacturer packed the products in a plastic capsule."}, {"viet": "Kích thước phòng này là 10mx15m.", "eng": "The measurements of this room are 10 by 15 metres."}, {"viet": "Những mặt có giá trị của kế hoạch đó hoàn toàn rõ ràng.", "eng": "The merits of the scheme are quite obvious."}, {"viet": "Những tên lửa từ một chiếc tàu được bắn vào chiếc máy bay đó.", "eng": "The missiles were shot at the aircraft from a ship."}, {"viet": "Phiên họp sáng của Toà đại hình.", "eng": "The morning session of the Crown Court."}, {"viet": "Vụ sát nhân được vạch kế hoạch một cách chi tiết, không có gì là tình cờ về chuyện đó cả.", "eng": "The murder was meticulously planned, that was nothing accidental about it."}, {"viet": "Những người hàng xóm láng giềng sống gần gũi nhau.", "eng": "The neighbours lived in close propinquity to each other."}, {"viet": "Ông giám đốc mới đã làm một cuộc chấn chỉnh cơ quan.", "eng": "The new manager made a clean sweep of the department."}, {"viet": "Tin tức đã gây nên một sự xáo động to lớn trong làng.", "eng": "The news caused quite a stir in the village."}, {"viet": "Tiếng ồn dường như không làm họ bực mình.", "eng": "The noise doesn't seem to worry them."}, {"viet": "Cô y tá không biết che giấu tìm cảm của mình.", "eng": "The nurse is not adept at hiding her feelings."}, {"viet": "Người già và người trẻ không phải luôn luôn hiểu nhau.", "eng": "The old and the young do not always understand each other."}, {"viet": "Phương cách duy nhất để thành công là làm việc chăm chỉ và sống một cuộc đời lành mạnh.", "eng": "The one way to succeed is to work hard and live a healthy life."}, {"viet": "Những người khác còn ở phía sau một khoảng xa.", "eng": "The others are a long way behind."}, {"viet": "Tờ giấy da vụn ra từng mảnh trong tay tôi.", "eng": "The parchment fell to bit in my hands."}, {"viet": "Bệnh nhân đã chết sau khi bị tim ngưng hoạt động.", "eng": "The patient died after suffering a cardiac arrest."}, {"viet": "Sự xung đột triền miên giữa tính ích kỷ dân tộc và tình đoàn kết quốc tế ngày càng trở nên rõ rệt.", "eng": "The perennial conflict between national egoism and international solidarity becomes more and more visible."}, {"viet": "Bức tranh cho thấy một vài loại cầu khác nhau.", "eng": "The picture show several different kinds of bridges."}, {"viet": "Máy bay đáp trơn tru với mọi núm điều khiển.", "eng": "The plane answered smoothly to the controls."}, {"viet": "Vở kịch tuyên truyền chính trị.", "eng": "The play is sheer political propaganda."}, {"viet": "Cảnh sát đang theo dõi nó về các bức tranh bị mất trộm.", "eng": "The police are onto him about the stolen paintings."}, {"viet": "Cảnh sát tìm cách khuyên can nó đừng nhảy ra khỏi toà nhà.", "eng": "The police managed to dissuade him from jumping off the building."}, {"viet": "Chính sách đó đã được uỷ ban thông qua, nhưng chỉ với một hình thức có sửa đổi.", "eng": "The policy was agreed by the committee, but only in a modified form."}, {"viet": "Khoai tây được phân loại theo kích cỡ.", "eng": "The potatoes are graded according to size."}, {"viet": "Tổng thống được bầu sẽ làm lễ nhận chức tuần tới.", "eng": "The President elect will be installed next week."}, {"viet": "Giá cả trong tiệm ăn đó thật là cắt cổ.", "eng": "The prices in that restaurant are absolutely ruinous."}, {"viet": "Tên tù bị hai thám tử kè sát hai bên sườn.", "eng": "The prisoner was flanked by the two detectives."}, {"viet": "Dự án đã được một tổ chức uỷ thác từ thiện tài trợ.", "eng": "The project is financed by a charitable trust."}, {"viet": "Sự rùm beng do việc ông ta có mối quan hệ với bọn găngxtơ là cú đòn kết liễu đối với cuộc vận động bầu cử của ông ta.", "eng": "The publicity caused by his connection with gangsters was the coup de grace to his election campaign."}, {"viet": "Nữ hoàng sẽ khai mạc kỳ họp tới của Quốc hội.", "eng": "The Queen will open the next session of Parliament."}, {"viet": "Phương pháp đánh giá đó đang được sắp xếp lại một phần.", "eng": "The rating system is undergoing some restructuring."}, {"viet": "Trung đoàn đã củng cố vị trí trong lúc chờ đợi cuộc tấn công của địch.", "eng": "The regiment secured its position while awaiting the enemy attack."}, {"viet": "Phần còn lại của thế giới, của cuộc đời tôi, số tiền của bà ấy.", "eng": "The rest of the world, my life, her money."}, {"viet": "Tính giòn của kim loại làm cho nó bị nứt.", "eng": "The rigidity of the metal caused it to crack."}, {"viet": "Đường cấm xe cộ lưu thông.", "eng": "The roads is closed to vehicular traffic."}, {"viet": "Thuỷ quân lục chiến Hoàng gia vừa thạo đánh tay vừa thạo sử dụng vũ khí.", "eng": "The Royal Marines are as skilled in unarmed combat as they are in weapon handling."}, {"viet": "Nhà buôn đó là một thanh niên rất lịch lãm.", "eng": "The sales man was a very personable young man."}, {"viet": "Người ta trông mong ban lãnh đạo nhà trường phải giám sát các bữa ăn của trường.", "eng": "The school staff are expected to supervise school meals."}, {"viet": "Vị thượng nghị sĩ theo đuổi một chức vụ với sự ủng hộ của tổng thống.", "eng": "The senator rode into office on the president's coattails."}, {"viet": "Cái giá sách võng xuống ở giữa vì những cuốn sách trên đó quá nặng.", "eng": "The shelf sagged in the middle because the books on it were too heavy."}, {"viet": "Mặt tiền của cửa hàng được lắp các cửa chớp cuốn được.", "eng": "The shop-front is fitted will shutters."}, {"viet": "Sự yên lặng bị phá vỡ bởi một tiếng kêu lớn.", "eng": "The silence was broken by a long noise."}, {"viet": "Giới thạo tin đang đợi ai ( cái gì ) đến.", "eng": "The smart money is on somebody ( something )."}, {"viet": "Những người lính áp giải tù nhân đi bằng vũ lực.", "eng": "The soldiers took the prisoners away by force."}, {"viet": "Diễn giả thực sự đả kích họ!", "eng": "The speaker really socked it to them!"}, {"viet": "Dân số của tiểu bang đã gia tăng gấp nhiều lần.", "eng": "The state's population has increased manyfold."}, {"viet": "Câu chuyện về tấm lịch của chúng ta được bắt đầu từ thời kỳ trước khi con người biết đọc hoặc biết viết.", "eng": "The story of our calendar began back in the days before people could read or write."}, {"viet": "Chủ ngữ của một câu và động từ của nó phải hợp nhau về số.", "eng": "The subject of a sentence and its verb must agree in number."}, {"viet": "Tất cả những người tình nghi đều có chứng cớ ngoại phạm tốt trong ngày xảy ra vụ cướp.", "eng": "The suspects all had good alibis for the day of the robbery."}, {"viet": "Thầy giáo bắt tôi lên ngồi phía trước lớp.", "eng": "The teacher made me move my seat on the front of the classroom."}, {"viet": "Nhiệt độ hôm nay là bảy mươi độ Pha-ren-hai.", "eng": "The temperature today is seventy degrees Fahrenheit."}, {"viet": "Điều quan trọng nhất ở cô ta là cô ta hoàn toàn trung thực.", "eng": "The thing about her is that she is completely honest."}, {"viet": "Đảng Bảo thủ vẫn luôn luôn đoàn kết trong các thời kỳ khủng hoảng.", "eng": "The Tory party always holds together in times of crisis."}, {"viet": "Những trói buộc của lề thói, của tục lệ, của mê tín.", "eng": "The trammels of routine, convention, superstition."}, {"viet": "Chương trình vô tuyến bị thay thế bằng một trận bóng đá.", "eng": "The TV programme was preempted by a football match."}, {"viet": "Hai thành phố đó nối với nhau bằng một đường xe lửa.", "eng": "The two towns are connected by a railway."}, {"viet": "Việc dùng màu sắc gây nên một ấn tượng mạnh mẽ.", "eng": "The use of colours produces a striking effect."}, {"viet": "Dân làng nhất trí chống lại việc xây dựng một đường vòng.", "eng": "The villagers are unanimous in their opposition to the building of a bypass."}, {"viet": "Nước ở đây rất sâu, tôi không thế nào sờ tới đáy.", "eng": "The water is very deep here, I can't touch bottom."}, {"viet": "Cả ngôi nhà rung lên mỗi khi xe tải nặng chạy qua.", "eng": "The whole house vibrated whenever a heavy lorry passes."}, {"viet": "Mụ phù thuỷ đã biến hoàng tử hoá thành con ếch.", "eng": "The witch turned the prince into a frog."}, {"viet": "Trận chung kết Cúp Thế giới được truyền tại chỗ phát đi cho hơn năm mươi nước.", "eng": "The World Cup final is being transmitted live to over fifty countries."}, {"viet": "Thái độ của họ đem lại sự mất tin tưởng đối với bóng đá Anh.", "eng": "Their behaviour has brought discredit on English football."}, {"viet": "Cách xử lý bậc thầy của họ đối với một tình thế khó khăn.", "eng": "Their masterly handling of a difficult situation."}, {"viet": "Rồi thì tôi có thể đổi một ít bảng Anh lấy nhân dân tệ phải không?", "eng": "Then I can exchange some pounds for Chinese Yuan?"}, {"viet": "Có một chỗ nối ở mảnh vải này.", "eng": "There's a join in this piece of material."}, {"viet": "Không có gì phải vội, cho nên cứ thong thả mà làm cẩn thận.", "eng": "There's no hurry, so do it slowly and carefully."}, {"viet": "Có quá nhiều chuyện vu oan giá hoạ do các nhà báo vô trách nhiệm gây ra.", "eng": "There's too much mud-slinging by irresponsible journalists."}, {"viet": "Có nhiều lễ hội ở miền Tây hơn bởi vì có nhiều người Mỹ bản địa ờ miền Tây hơn.", "eng": "There are more in the West because there are more Native Americans in the West."}, {"viet": "Có hai pint trong một quart và bốn quart trong một gallon.", "eng": "There are two pints in a quart and four quart in a gallon."}, {"viet": "Ở trung tâm thị trấn có một cái chợ có mái che.", "eng": "There is a covered market in the town centre."}, {"viet": "Khó lòng nó có thể thành công được.", "eng": "There is little probability of his succeeding."}, {"viet": "Không có nhiều sữa nhưng chú tôi chỉ cần chút ít cho một tách trà thôi.", "eng": "There isn't much milk, but we only need a little for one cup of tea."}, {"viet": "Có một chuyện hơi không may bất ngờ xảy đến khi cả hai cô bạn gái của anh ta cùng đến một lúc.", "eng": "There was a slight contretemps when both his girlfriends arrived together."}, {"viet": "Có khoảng 500 người ở đấy, cũng đúng như tôi có thể phán đoán.", "eng": "There were about 500 people there, as near as I could judge."}, {"viet": "Đó là những đôi giày lý tưởng với thời tiết có mưa lầy lội.", "eng": "These are great shoes for muddy weather."}, {"viet": "Những con mèo này trông giống nhau y hệt-làm thế nào anh phân biệt được con nào với con nào?", "eng": "These kittens look exactly alike-how can you tell which is which?"}, {"viet": "Quần áo bị ướt-tôi sẽ thay cái khác.", "eng": "These trousers are wet-I'll change into may other ones."}, {"viet": "Họ đã xuống Brighton vài ngày.", "eng": "They've gone down to Brighton for a couple of days."}, {"viet": "Chúng đang học ý nghĩa của việc trở thành người da đỏ đấy.", "eng": "They are learning what it means to be Indian."}, {"viet": "Họ đưa con thuyền vào cảng rồi bỏ neo.", "eng": "They brought the boat into the harbour and dropped the anchor."}, {"viet": "Họ quyết định chấm dứt hợp tác.", "eng": "They decided to break up the partnership."}, {"viet": "Họ cãi nhau ngay trước lễ cưới.", "eng": "They fell out with each other just before their marriage."}, {"viet": "Họ tránh không liên kết với một đảng phái chính trị nào hết.", "eng": "They have avoided aligning themselves with any one political party."}, {"viet": "Họ để sách của họ lại trường nhưng chúng tôi mang sách về nhà.", "eng": "They left their books at school but we took ours home."}, {"viet": "Họ nhận xét rằng sự việc không phải như mọi ngày.", "eng": "They observe that things were not what they used to be."}, {"viet": "Họ thật sự đã vặn vẹo anh trong cuộc phỏng vấn.", "eng": "They really put you through it at the interview."}, {"viet": "Họ đã làm trái với các quy tắc bất thành văn của nhà trường.", "eng": "They sinned against the unwritten rules of the school."}, {"viet": "Họ đã bỏ phiếu ủng hộ việc cấm hút thuốc nơi công cộng.", "eng": "They voted in favour of the prohibition of smoking in pulic areas."}, {"viet": "Họ gặp nhiều trở ngại do thiếu thốn tài nguyên.", "eng": "They were handicapped by a poverty of resources."}, {"viet": "Họ làm liên tục trong hai ngày để cho xong việc đó.", "eng": "They worked away for two days to get it finished."}, {"viet": "Quyển sách này làm cho người đọc hiểu thấu đáo xa lộ M15.", "eng": "This book gives readers an inside view of M15."}, {"viet": "Sinh vật này có thể được xếp vào lớp bò sát.", "eng": "This creature can be subsumed in the class of reptiles."}, {"viet": "Chính phủ này tiếp nhận nhiều vấn đề khó khăn của chính phủ tiền nhiệm.", "eng": "This government has inherited many problems from the previous one."}, {"viet": "Đây là vợ tôi, Rose La.", "eng": "This is my wife, Rose Lo."}, {"viet": "Bài học này được chia làm bốn phần-luyện nói, luyện viết, từ mới và trò chơi với từ.", "eng": "This lesson is divided into four units speaking practice, writing practice, new words, and a word game."}, {"viet": "Bức tranh này đã được bán đấu giá tại hãng Christie hôm nay.", "eng": "This painting came under the hammer at Christie's today."}, {"viet": "Căn phòng này được coi một cách đáng tức cười là trung tâm kiểm nghiệm chất lượng.", "eng": "This room laughingly referred to as quality control center."}, {"viet": "Lý thuyết này mâu thuẫn với những sự thật đã biết.", "eng": "This theory is at variance with the known facts."}, {"viet": "Những người sáng mắt trong chúng ta không hiểu được những khó khăn của người mù.", "eng": "Those of us who are sighted don't understand the problems of the blind."}, {"viet": "Tỉ giá mua tiền mặt hôm nay là 860.", "eng": "Today's rate for cash purchases is 860."}, {"viet": "Mười hai cộng ba mươi cộng mười tám mét vuông, tổng cộng.", "eng": "Twelve plus thirty plus eighteen square metres, in all."}, {"viet": "Cử tri luôn luôn bỏ phiếu cho ứng cử viên nào hiểu rõ nhất về những nhu cầu của họ.", "eng": "Voters always elect the candidate most tuned in to their needs."}, {"viet": "Nếu được chúng tôi muốn có một phòng yên tĩnh, đừng quá gần đường.", "eng": "We'd like to have a quiet room if possible, not too near the street."}, {"viet": "Chúng tôi có trụ sở chính ở thành phố nhưng chúng tôi dùng nhiều thời gian ở nông thôn.", "eng": "We're based in the city but we spend a lot of time in the country."}, {"viet": "Chúng tôi lấy làm tiếc là anh đã cảm thấy khó chịu.", "eng": "We're sorry that you should feel uncomfortable."}, {"viet": "Chúng tôi mất nhiều khách hàng từ khi giá tăng lên.", "eng": "We've lots of custom since our prices went up."}, {"viet": "Chúng ta đang ở trên Bắc Cực.", "eng": "We are above the North Pole."}, {"viet": "Chúng ta làm việc có sự liên kết với các bạn hàng của chúng ta ở nước ngoài.", "eng": "We are working in alliance with our foreign partners."}, {"viet": "Ngày mai chúng ta sẽ xử lí vấn đề này.", "eng": "We can attend to this problem tomorrow."}, {"viet": "Chúng ta có thể vào không mất tiền, chẳng có ai thu vé cả.", "eng": "We could have got in for nothing-nobody was collecting tickets."}, {"viet": "Chúng ta không trả tiền cho các nhà phân tích tài chính nói sau!", "eng": "We don't pay our financial analysts to be wise after the event!"}, {"viet": "Về mùa đông chúng tôi dùng hết ba bó củi.", "eng": "We go through about three cords of wood in the winter."}, {"viet": "Chúng ta phải bỏ phiếu để bổ nhiệm ba quan chức: chủ tịch, thư ký và thủ quỹ.", "eng": "We had to vote to appoint all three officers: President, Secretary and Treasurer."}, {"viet": "Chúng tôi đã giảm chi tiêu xuống đến mức tối thiểu.", "eng": "We have pared down our expenses to a bare minimum."}, {"viet": "Năm rồi chúng tôi mới chuyển đến nơi đây.", "eng": "We just moved here last year."}, {"viet": "Chúng tôi đã tìm cách đi theo các phố bên cạnh để tránh khu buôn bán.", "eng": "We managed to bypass the shopping centre by taking side-streets."}, {"viet": "Chúng ta phải đẩy mạnh thương mại với các nước láng giềng.", "eng": "We must promote commerce with neighbouring countries."}, {"viet": "Chúng tôi thích tự mình làm điều đó.", "eng": "We ourselves would never say such a thing."}, {"viet": "Chúng tôi nhìn thấy nó trần truồng như nhộng chạy xuống đường.", "eng": "We saw him running down the road starkers."}, {"viet": "Chúng tôi ủng hộ anh trong cuộc tranh luận này.", "eng": "We stand side by side with you in this dispute."}, {"viet": "Chúng tôi đi bộ hàng giờ nhưng cuối cùng chúng tôi đã thấy ngôi nhà đó.", "eng": "We walked for hours, but in the end we found the house."}, {"viet": "Chúng tôi hy vọng tuần tới có thể đi nghỉ được-chứ cứ như thế này thì có thể chúng tôi không đi nổi.", "eng": "We were hoping to have a holiday next week-as it is we may not be able to get away."}, {"viet": "Chúng tôi sẽ không đến trước thứ năm tuần tới.", "eng": "We won't arrive till next Thursday."}, {"viet": "À, trước nay tôi chưa bao giờ đến đó, vì vậy bạn sẽ phải chỉ tôi cách ăn uống ở đó nhé.", "eng": "Well, i've never been to one before, so you'll have to show me how to get around there."}, {"viet": "À chúng tôi có ngân hàng Công thương Trung Quốc và những ngân hàng chuyển ngành khác.", "eng": "Well, we have the Industrial and Commercial Bank of China and other specialized banks."}, {"viet": "Anh đánh giá thế nào về cơ hội chiến thắng của cô ấy?", "eng": "What's your assessment of her chances of winning?"}, {"viet": "Anh định làm gì với phần thức ăn còn lại của anh?", "eng": "What are you going to do with the rest of your food?"}, {"viet": "Bạn nghĩ những tài năng tiềm ẩn của bạn là gì?", "eng": "What do you think are your hidden talents?"}, {"viet": "Văn hóa quần chúng ở nước bạn là những gì?", "eng": "What is pop culture like in your country?"}, {"viet": "Bạn thích làm gì để thư giãn?", "eng": "What is your favorite thing to do to relax?"}, {"viet": "Anh có bằng chứng gì cho thấy rằng lời khai này là đúng?", "eng": "What proofs have you that the statement is correct?"}, {"viet": "Bạn dùng loại dầu gội đầu nào vậy?", "eng": "What type of shampoo do you use?"}, {"viet": "Bao giờ anh kết thúc khoá học ở trường đại học?", "eng": "When do you finish your college course?"}, {"viet": "Khi tôi bước lên mạn thuyền, nó bị lắc lư.", "eng": "When I stepped onto the side of the boat, it rocked."}, {"viet": "Khi làm xong các thủ tục pháp lý, người mua và người bán nhà có thể trao đổi khế ước.", "eng": "When the legal formalities have been settled, the buyer and seller of a house can exchange contracts."}, {"viet": "Khi đi qua đường phải cẩn thận!", "eng": "When you are crossing the road, take care!"}, {"viet": "Để cái ấm pha trà này ở đâu?''Để trong tủ búp phê kia'.", "eng": "Where does this teapot go?''In that cupboard'."}, {"viet": "Cái nào nhanh hơn xe điện ngầm hoặc xe buýt?", "eng": "Which is faster, subway or taxi?"}, {"viet": "Lấy cành cây vót thành cọc lều.", "eng": "Whittling a tent-peg from a branch."}, {"viet": "Ai là cô gái mà anh tán tỉnh tối qua?", "eng": "Who was the girl you were chatting last night?"}, {"viet": "Tại sao con không đổi kênh?", "eng": "Why don't you change the channel?"}, {"viet": "Mong ông làm chứng cho hợp đồng giữa chúng tôi được không?", "eng": "Will you act as witness to the agreement between us?"}, {"viet": "Mùa đông là mùa trượt tuyết.", "eng": "Winter is the season for skiing."}, {"viet": "Người vợ phải trung trinh cho dù hành vi của chồng có thế nào.", "eng": "Wives are expected to remain chaste, whatever their husbands'behaviour."}, {"viet": "Chị định xếp các tiểu thuyết của cô ấy vào loại văn học nghiêm túc hay là đơn thuần giải trí?", "eng": "Would you classify her novels as serious literature or as mere entertainment?"}, {"viet": "Ông có muốn ghi vào hóa đơn tiền phòng không ạ?", "eng": "Would you like to sign the bill?"}, {"viet": "Vắt nước bộ áo tắm còn ướt của chị đi.", "eng": "Wring the water out of your wet bathing costume."}, {"viet": "Vâng, tôi cần bảng Anh và một ít nhân dân tệ.", "eng": "Yes, I need pounds and some RMB Yuan."}, {"viet": "Anh nên mau lên kẻo muộn đấy.", "eng": "You'd better look sharp or you'll be late."}, {"viet": "Bà sẽ thấy nhà bưu điện ở bên tay phải của bà.", "eng": "You'll see the post office on your right."}, {"viet": "Anh bị một phiếu phạt đỗ xe à, cùng hội cùng thuyền rồi!", "eng": "You've got a parking-ticket, well join the club!"}, {"viet": "Cô không thể bịp được tôi-cô không ốm thật!", "eng": "You can't con me-you're not really ill!"}, {"viet": "Anh có thể làm rạn cái cốc thuỷ tinh rắn này, nhưng anh không thể làm vỡ nó được.", "eng": "You can crack this toughened glass, but you can't break it."}, {"viet": "Người ta không được hút thuốc lá ở một số nhà hàng.", "eng": "You cannot smoke in certain restaurants."}, {"viet": "Tốt hơn là bạn nên dùng dầu ô-liu để nấu món này.", "eng": "You had better cook this using olive oil."}, {"viet": "Anh biết đấy, anh không thể chỉ gọi điện cho nhân viên sửa chữa thôi.", "eng": "You know, you can't just telephone for the repairman."}, {"viet": "Ông cần phải tính đến năm phần trăm hao phí dọc đường.", "eng": "You must allow for five per cent wastage in transit."}, {"viet": "Con hư quá! Mẹ đã bảo không được chơi ở đường cơ mà.", "eng": "You naughty boy! I told you not to play in the road."}, {"viet": "Anh nên nhớ rằng ông ta không còn mạnh như trước nữa.", "eng": "You should bear in mind that he is not as strong as he used to be."}, {"viet": "Anh thiệt là quá bất nhã đã không mời anh ấy ngồi.", "eng": "You showed great discourtesy by not asking him to sit down."}, {"viet": "Nói sự thật anh sẽ chẳng mất mát gì.", "eng": "You will lose nothing by telling the truth."}, {"viet": "Chữ ký duyệt của ông không nhất quán với chữ ký mẫu.", "eng": "Your counterssign is inconsistent with the specimen signature."}, {"viet": "Câu chuyện của anh còn có một vài chỗ xa với sự thật.", "eng": "Your story is several removes from the truth."}]