[{"viet": "Đoàn diễn viên múa đi lưu diễn đã đến tỉnh.", "eng": "A band of wandering dancers came to the town."}, {"viet": "Một nghi lễ còn sót lại từ thời tiền Thiên Chúa giáo.", "eng": "A ceremony which is a survival from pre-Christian times."}, {"viet": "Một công ty mới nhảy vào thị trường trò chơi điện tử video.", "eng": "A company that was a latecomer to the video-game market."}, {"viet": "Một buổi trình diễn nhạc giao hưởng thô thiển, không có chút tinh tế nào.", "eng": "A crude performance of the symphony, quite without polish."}, {"viet": "Một cái nhún vai xua đuổi.", "eng": "A dismissive shrug of the shoulders."}, {"viet": "Một vài người chịu được rét bơi trong nước băng giá.", "eng": "A few hardy people swam in the icy water."}, {"viet": "Những nguyên tắc cơ bản về phương pháp đánh giá.", "eng": "A framework for the evaluation process."}, {"viet": "Mục tin vặt gần xa trên báo được viết với những mẫu tin lượm lặt từ các cuộc nói chuyện trong tiệc rượu.", "eng": "A gossip column put together with a few gleanings from cocktail-party conversations."}, {"viet": "Một chiếc xe tải nặng đã gãy gập trên xa lộ, làm tắc nghẽn giao thông lâu.", "eng": "A heavy lorry has jackknifed on the motorway, causing long delays."}, {"viet": "Xe jeep là lý tưởng để chạy trên vùng đất gồ ghề.", "eng": "A jeep is ideal for driving over rough terrain."}, {"viet": "Một nhân vật ủng hộ tích cực của phong trào phụ nữ.", "eng": "A leading protagonist of the women's movement."}, {"viet": "Nhiều chất thải độc hại từ nhà máy hóa chất đó thải ra.", "eng": "A lot of poisonous wastes come from that chemical factory."}, {"viet": "Một vấn đề tôi biết ít.", "eng": "A matter I know little about."}, {"viet": "Một sự kiện được truyền thông đa dạng, bao gồm âm nhạc, nhảy múa, vidêo, và một cuộc biểu diễn la-de.", "eng": "A multimedia event, including music, dance, video and a laser show."}, {"viet": "Một cuốn tiểu thuyết thiên về miêu tả dài và có ít đối thoại.", "eng": "A novel with long description and little dialogue."}, {"viet": "Sức khỏe của một người thường do gen di truyền định trước.", "eng": "A person's health is often genetically predetermined."}, {"viet": "Một chính sách trở ngại cho kế hoạch của chúng ta.", "eng": "A policy obstructive to our plans."}, {"viet": "Một chuyến đi của tác giả để giới thiệu tác phẩm của mình.", "eng": "A promotional tour by the author."}, {"viet": "Một phóng viên có khả năng phanh phui các vụ bê bối.", "eng": "A reporter with a nose for scandal."}, {"viet": "Một sự tiếp vận qua vệ tinh giữa các mạng lưới thông tin chính ở châu Âu.", "eng": "A satellite hook-up between the major European networks."}, {"viet": "Một cái áo sơ mi phanh ra vì thiếu một cái khuy.", "eng": "A shirt gaping open with a button missing."}, {"viet": "Một cầu thủ bóng đá là một tay đá xuất sắc.", "eng": "A soccer player who was an excellent kicker."}, {"viet": "Một bóng người lén lút di chuyển trong các hàng cây.", "eng": "A stealthy figure moved among the trees."}, {"viet": "Một hệ thống dựa trên quan niệm về bình đẳng và tự do cá nhân.", "eng": "A system based on the notions of personal equality and liberty."}, {"viet": "Một buổi dâng lễ truyền thống như Lễ Đường Thánh Giá.", "eng": "A traditional devotion like the Way of the Cross."}, {"viet": "Một cây gậy chống đầu bịt bằng cao su.", "eng": "A walkingstick with a rubber tip."}, {"viet": "Việc phong tỏa một năm rưỡi đã làm nước Đức khốn đốn.", "eng": "A year and a half of the blockade has pinched Germany."}, {"viet": "Những hành động phương hại đến quan hệ hữu nghị giữa các quốc gia.", "eng": "Actions that are inimical to friendly relations between countries."}, {"viet": "Sau khi khởi đầu đầy hứa hẹn, dự án đó chăng mấy chốc đã xẹp xuống.", "eng": "After a promising start, the project soon fizzled out."}, {"viet": "Sau khi cân nhắc kỹ họ đã giao cho anh ta công việc đó.", "eng": "After much calculation they offered him the job."}, {"viet": "Sau ba tiếng đồng hồ chờ xe lửa, chúng tôi không còn kiên nhẫn được nữa.", "eng": "After three hours of waiting for the train, our patience was finally exhausted."}, {"viet": "Những công việc cực nhọc của bà ta đã trở thành công dã tràng.", "eng": "All her hard work has gone for nothing."}, {"viet": "Tất cả những chiếc áo dạ hội đều đẹp.", "eng": "All the evening dresses were beautiful."}, {"viet": "Mặc dù anh ta chỉ là một tay chơi nghiệp dư nhưng anh ta là một đấu thủ hạng nhất.", "eng": "Although he's only an amateur he's a first-class player."}, {"viet": "Một núi lửa đang hoạt động có thể phun bất cứ lúc nào.", "eng": "An active volcano may erupt at any time."}, {"viet": "Hàng triệu khán giả đã theo dõi lễ cưới hoàng gia trên truyền hình.", "eng": "An audience of millions watched the royal wedding on TV."}, {"viet": "Một ý tưởng còn lởn vởn trong trí óc một thời gian dài.", "eng": "An idea which has been kicking around for some considerable time."}, {"viet": "Một ông già bị một băng thanh niên sinh sự và trấn lột.", "eng": "An old man molested and robbed by a gang of youths."}, {"viet": "La Mã cổ đã chinh phục gần hết Châu Âu dưới sự cai trị của nó.", "eng": "Ancient Rome subjected most of Europe to its rule."}, {"viet": "Một cách khác rất dễ nhìn thấy ánh sáng màu trắng được cấu tạo bởi tất cả các màu sắc của cầu vồng là nhìn qua một lăng kính.", "eng": "Another easy way to see that white light is made up of all the colors of the rainbow is to look through a prism."}, {"viet": "Chỉ định một ủy ban đặc biệt để giải quyết vấn đề.", "eng": "Appoint an ad hoc committee to deal with the affair."}, {"viet": "Bạn có sợ bóng tối không?", "eng": "Are you afraid of the dark?"}, {"viet": "Anh định ám chỉ tôi không nói sự thật phải không?", "eng": "Are you suggesting that I'm not telling the truth?"}, {"viet": "Theo lệ thường lạc đà có thể mang nặng 400 cân Anh, nhưng cũng có con có thể mang tới 1000 cân Anh trong những quãng đường ngắn.", "eng": "As a rule a camel's load is about 400 pounds, but some camels can carry 1,000 pounds for short distances."}, {"viet": "Khi cuộc bầu cử tới gần thì cuộc đấu khẩu giữa các đảng chính trị chính trở nên gay gắt hơn.", "eng": "As the election approaches the war of words between the main political parties becomes more intense."}, {"viet": "Mới nhìn qua thì vấn đề có vẻ dễ dàng.", "eng": "At first glance the problem seemed easy."}, {"viet": "Dán nhãn vào mỗi món hành lý.", "eng": "Attached a label to each piece of luggage."}, {"viet": "Đổi chác quyền lợi, danh dự, tự do của ai.", "eng": "Barter away one's rights, honour, freedom."}, {"viet": "Anh hãy cảnh giác nhé; em thiết tha yêu cầu anh.", "eng": "Be on your guard; I conjure you."}, {"viet": "Trước khi chơi bài, chúng tôi rút thăm chia phe.", "eng": "Before playing cards we drew for partners."}, {"viet": "Bi-a là trò chơi cho đàn bà cũng như đàn ông.", "eng": "Billiards is played by women as well as men."}, {"viet": "Cành cây oằn xuống do tuyết phủ.", "eng": "Branches bowed down by the snow on them."}, {"viet": "Vật liệu xây dựng được chế tạo ra để chịu đựng được những nhiệt độ quá cao.", "eng": "Building materials made to withstand extremes of temperature."}, {"viet": "Nhưng nếu bạn định theo học một khoá nào đó thì nên chọn khoá học giúp bạn kiểm tra tiền sau khi học xong.", "eng": "But if you are going to take a course, it should help you to make money after you finish."}, {"viet": "Nhưng có thể cô phải đợi một chút mới đến lượt cô.", "eng": "But you may have to wait a bit for your turn."}, {"viet": "Nhân tiện xin hỏi, bà có biết nó bị làm sao không ạ?", "eng": "By the way, what is the problem, do you know?"}, {"viet": "Tôi có thể giúp anh mang những gói hàng đó được không?", "eng": "Can I help you with those packages?"}, {"viet": "Ông có thể cho tôi xuống xe gần bưu điện được không?", "eng": "Can you drop me off near the post office?"}, {"viet": "Cô có thể giới thiệu một số thắng cảnh để tham quan được không?", "eng": "Can you recommend some scenic spots for sightseeing?"}, {"viet": "Những người phụ nữ thiên về sự nghiệp có đầu óc tân thời.", "eng": "Career-oriented women are fashion-minded."}, {"viet": "Kiểm tra để biết chắc rằng những chỗ nối của các ống được gắn kín đúng qui cách.", "eng": "Check that the joints of the pipes are sealed properly."}, {"viet": "Hoàn cảnh đã buộc phải thay đổi kế hoạch.", "eng": "Circumstances have compelled a change of plan."}, {"viet": "Hãy đến mà xem những thắng cảnh ở Luân Đôn.", "eng": "Come and see the sights of London."}, {"viet": "Tình hình thị trường chứng khoán không ổn định.", "eng": "Conditions on the stock-market were unsettled."}, {"viet": "Nếu tôi sai, thì hãy sửa tôi nhé nhưng đó có phải là con lạc đà không bướu hay không?", "eng": "Correct me if I'm wrong, but isn't that a llama?"}, {"viet": "Làm ơn chuyển đường dây điện thoại cho tôi liên hệ với ông giám đốc.", "eng": "Could you put me through to the manager, please."}, {"viet": "Các đám đông đang đợi ở bờ cảng để chào đón họ.", "eng": "Crowds waiting at the quayside to welcome them."}, {"viet": "Những mảnh vụn bị cuốn theo cơn lũ.", "eng": "Debris washed along by the flood."}, {"viet": "Mặc dầu cô ta vừa bị một cơn đột quỵ, nhưng cô ta vẫn còn rất sáng suốt.", "eng": "Despite her recent stroke, she is quite rational."}, {"viet": "Bạn có nuôi một thú cưng khi còn nhỏ không?", "eng": "Did you have a pet when you were a child?"}, {"viet": "Ngắt tivi ra khỏi nguồn điện.", "eng": "Disconnect a TV from the power supply."}, {"viet": "Các bậc cha mẹ ở Bắc Mỹ có thường đóng học phí đại học cho con cái của họ không?", "eng": "Do parents in North America usually pay for their children's university tuition?"}, {"viet": "Bạn có làm gì để giúp bảo vệ môi trường không?", "eng": "Do you do anything to help the environment?"}, {"viet": "Bạn có kế hoạch nào cho kỳ nghỉ đông của bạn không?", "eng": "Do you have any plans for your winter vacation?"}, {"viet": "Anh thích rượu xêri ngọt hay nguyên chất?", "eng": "Do you like sweet or dry sherry?"}, {"viet": "Thỉnh thoảng bạn có đi đến các viện bảo tàng nghệ thuật không?", "eng": "Do you sometimes go to art museums?"}, {"viet": "Ông có cần tôi gửi nó đi cho ông không?", "eng": "Do you want me to post it for you?"}, {"viet": "Nước bạn nhập khẩu nhiều sản phẩm công nghệ cao của Nhật phải không?", "eng": "Does your country import a lot of Japanese high-tech products?"}, {"viet": "Đừng thúc giục tôi: hãy cho tôi thời gian suy nghĩ!", "eng": "Don't crowd me: give me time to think!"}, {"viet": "Đừng để cây kem đánh răng mở nắp.", "eng": "Don't leave the toothpaste with the top off."}, {"viet": "Đừng có đứng đó mà ngáng cổng vào!", "eng": "Don't stand there blocking the gateway!"}, {"viet": "Cậu không biết là không được ăn cắp à?", "eng": "Don't you know you shouldn't steal?"}, {"viet": "Đuyma cha chủ yếu viết tiểu thuyết, trong khi Đuyma con bận rộn với kịch.", "eng": "Dumas père primarily wrote novels, while dramas occupied Dumas fils."}, {"viet": "Hoặc là ông cố gắng hết sức hoặc là không còn cơ hội nào để được khỏe hơn.", "eng": "Either you make a real effort or there's no chance of your feeling better."}, {"viet": "Những thói quen đã ăn sâu khó mà thay đổi.", "eng": "Established practices are difficult to change."}, {"viet": "Mọi người tưởng là ông ta nghèo, nhưng thật ra thì ông ta rất giàu.", "eng": "Everyone supposes him to be poor, but he is really quite wealthy."}, {"viet": "Sự áp dụng quyền lực đối với người khác không phải lúc nào cũng là khôn ngoan; sự thuyết phục có thể hay hơn.", "eng": "Exertion of authority over others is not always wise; persuasion may be better."}, {"viet": "Đám người ủng hộ tràn lên sân khấu sau buổi hòa nhạc.", "eng": "Fans rushed the stage after the concert."}, {"viet": "Năm mươi nguyên thủ quốc gia đã dự lễ đăng quang của Nữ hoàng để tỏ lòng kính trọng người.", "eng": "Fifty heads of state attended the Queen's coronation to do her honour."}, {"viet": "Món cá được dọn lên sau món ăn đầu tiên.", "eng": "Fish was served after the first course."}, {"viet": "Những người ngu ngốc lầm lẫn hình thức nhất thời với sự kiện vĩnh cửu.", "eng": "Foolish men mistake transitory semblance for eternal fact."}, {"viet": "Giữ vững tinh thần bằng cách cầu nguyện và ngồi thiền.", "eng": "Fortify oneself by prayer and meditation."}, {"viet": "Hàn hai đoạn kim loại vào nhau.", "eng": "Fuse two pieces of wire together."}, {"viet": "Cút đi cho khuất mắt của tao! hắn hét lên.", "eng": "Get out of my sight! he boomed."}, {"viet": "Lên giây đồng hồ thêm vài vòng nữa đi.", "eng": "Give the clock another couple of winds."}, {"viet": "Ra trường vào cuối năm học.", "eng": "Going down at the end of the year."}, {"viet": "Việc kiểm soát súng-một vấn đề tranh cãi về chính trị gây hậu quả phức tạp.", "eng": "Gun control-a political hot potato."}, {"viet": "Con mèo của anh đã được cắt buồng trứng chưa?", "eng": "Has your cat been spayed yet?"}, {"viet": "Bạn có bao giờ mua bất kì thứ gì bằng cách đặt hàng bằng thư tín chưa?", "eng": "Have you ever bought anything through mail order?"}, {"viet": "Anh đã trả số tiền đó cho ngân hàng chưa?", "eng": "Have you paid that money to the bank yet?"}, {"viet": "Anh ta sẽ làm một người chồng rất tốt.", "eng": "He'll make someone a very good husband."}, {"viet": "Ông ấy là một con người thú vị, anh có muốn làm quen với ông ấy không?", "eng": "He's an interesting man, would you like to meet him?"}, {"viet": "Anh ta có một chút lệch lạc trong cá tính, nếu anh hỏi tôi.", "eng": "He's got a few kinks in his personality, if you ask me."}, {"viet": "Anh ta như ngồi trên đống lửa về kết quả thi của mình.", "eng": "He's on a knife-edge about his exam results."}, {"viet": "Anh ấy rất say mê cô ta song cô ta luôn luôn phớt lờ anh ấy.", "eng": "He's very keen on her but she's always brushing him off."}, {"viet": "Hắn xin được giảm án tử hình xuống tù chung thân.", "eng": "He appealed for a commutation of the death sentence into life imprisonment."}, {"viet": "Ngay cả lúc khốn cùng anh vẫn giữ được khí tiết của mình.", "eng": "He bore himself with dignity at a difficult time."}, {"viet": "Nó không nghe được mà cũng chẳng nói được bao nhiêu.", "eng": "He can't hear and he can hardly speak either."}, {"viet": "Anh ta có thể thấy là nàng đang khóc.", "eng": "He could see that she had been crying."}, {"viet": "Hắn làm việc đó tệ đến nỗi tự tôi phải làm lại lần nữa.", "eng": "He did the work so badly that I had to do it all over again myself."}, {"viet": "Anh ta dẫn bóng qua khỏi thủ môn để ghi bàn thắng.", "eng": "He dribbled the ball past the goalie to score."}, {"viet": "Chỉ cần một cú anh ta đã đánh gục ba tên tấn công anh ta.", "eng": "He fell his three attackers at a single blow."}, {"viet": "Ông ta đưa ra một câu trả lời hòa nhã, mặc dầu đang bực tức.", "eng": "He gave a mild answer, in spite of his annoyance."}, {"viet": "Anh ta bực bội về các chi tiết.", "eng": "He got hung up on the details."}, {"viet": "Hắn chẳng có gì ngoài sự khinh bỉ đối với những ý kiến của tôi.", "eng": "He had nothing but scorn for my ideas."}, {"viet": "Nó luôn luôn đối xử tốt với tôi.", "eng": "He has always dealt well by me."}, {"viet": "Anh ấy đã hoàn toàn khỏi bệnh?", "eng": "He has quite recovered from his illness?"}, {"viet": "Anh ta sai lầm tưởng rằng cô ta yêu mình.", "eng": "He imagines, wrongly, that she loves him."}, {"viet": "Ông ấy có quan hệ rất tốt với học trò.", "eng": "He is in rapport with his pupils."}, {"viet": "Ông ta là người được mến phục trong giới chính quyền.", "eng": "He is well-thought-of in government circles."}, {"viet": "Anh ta rời khỏi một thành phố bị cách ly và tắc nghẽn bởi những xa lộ và xe ôtô.", "eng": "He left a city ghettoized and strangled by highways and cars."}, {"viet": "Đội cái mũ đó anh ta trông đúng là một thằng ngố.", "eng": "He looks a real Charlie in that hat."}, {"viet": "Có lẽ nó đã lỡ chuyến tàu hỏa.", "eng": "He may have missed the train."}, {"viet": "Ông ấy trả giá 30.000 bảng Anh cho căn nhà.", "eng": "He offered £ 30,000 for the house."}, {"viet": "Nó đánh vật suốt đêm với bản quyết toán mà cũng không xong kịp thời hạn.", "eng": "He plodded away all night at the accounts but didn't finish them in time."}, {"viet": "Anh ta đã dốc tất cả trái tim và tâm hồn vào công việc.", "eng": "He put his heart and soul into the work."}, {"viet": "Anh ấy kể lại chi tiết anh ấy bắn con sư tử ra sao.", "eng": "He recounted how he had shot the lion."}, {"viet": "Anh ta đánh đôi giày cho đến khi chúng bóng lộn lên.", "eng": "He rubbed his shoes until they were shiny."}, {"viet": "Anh ta là một tay điêu luyện trong môn này.", "eng": "He's an old hand at this game."}, {"viet": "Anh ấy ở phòng kế bên.", "eng": "He's in the next room."}, {"viet": "Hắn ta thật là một thằng nhóc đáng yêu!", "eng": "He's such a lovable rascal!"}, {"viet": "Anh ta đi ung dung hai tay đút túi.", "eng": "He sauntered by with his hands in his pockets."}, {"viet": "Anh ta đặt con sang một bên và châm thuốc hút.", "eng": "He set aside his child and lit a cigarette."}, {"viet": "Anh ấy đập mạnh quả bóng qua lưới thẳng vào người đối phương.", "eng": "He smashed the lob straight at his opponent's body."}, {"viet": "Nó có nhiều khả năng thi đỗ.", "eng": "He stands a good chance of passing the examination."}, {"viet": "Anh ta đã góp 100 đô la vào quỹ cứu trợ bão lụt.", "eng": "He subscribed 100 dollars to the flood relief fund."}, {"viet": "Ông ta nghĩ rằng mọi thứ đều tập trung vào ông ta.", "eng": "He thinks that everything revolves around him."}, {"viet": "Anh ấy thận trọng khoá cửa trước khi đi ra ngoài.", "eng": "He took the precaution of locking his door when he went out."}, {"viet": "Anh ta lật cổ áo khoác lên và xông ra ngoài mưa.", "eng": "He turned up the collar of his coat and hurried out into the rain."}, {"viet": "Nó cần một ngôi nhà, trong lúc tôi lại muốn có một căn hộ.", "eng": "He wants a house, where I would prefer a flat."}, {"viet": "Người ta đã yêu cầu anh ta cho biết ý kiến thẳng thắn.", "eng": "He was asked to give his honest opinion."}, {"viet": "Ông ta được phong nam tước xứ Banthorp.", "eng": "He was created Baron of Banthorp."}, {"viet": "Anh ta được tạo nhiều cơ hội để biểu đạt ý kiến của mình.", "eng": "He was given ample opportunity to express his views."}, {"viet": "Anh ta nhất quyết đòi tôi phải đi.", "eng": "He was most emphatic that I should go."}, {"viet": "Ông ta đã bị cách chức chủ tịch.", "eng": "He was removed from his position as chairman."}, {"viet": "Ông ta vô cùng phẫn uất về điều mà ông cho là lời vu khống.", "eng": "He was terribly indignant at what he saw as false accusations."}, {"viet": "Anh ấy quan sát để xem chuyện gì sẽ xảy ra.", "eng": "He watched to see what would happen."}, {"viet": "Nó đánh điện cho anh nó để xin gởi cho nó ít tiền.", "eng": "He wired to his brother to send some money."}, {"viet": "Anh ta viết Ngài Peter Mitchell lên phong bì.", "eng": "He wrote Peter Mitchell, Esq on the envelope."}, {"viet": "Những thành tựu của cô ấy xứng đáng với lời khen ngợi nồng nhiệt nhất.", "eng": "Her achievements are worthy of the highest praise."}, {"viet": "Trường hợp của cô ta không được chính quyền quan tâm tới.", "eng": "Her case went unheard by the authorities."}, {"viet": "Sự thu nhập của cô ấy từ mọi nguồn lên đến100.000 bảng.", "eng": "Her earnings from all sources aggregated £ 100.000."}, {"viet": "Suối tóc vàng của cô xoã xuống lưng.", "eng": "Her golden hair cascaded down her back."}, {"viet": "Mối quan tâm của cô nàng đối với anh ta chủ yếu là tình dục.", "eng": "Her interest in him is primarily sexual."}, {"viet": "Môi nàng nhăn lại và nàng bắt đầu khóc.", "eng": "Her mouth puckered up and she started to cry."}, {"viet": "Thơ của bà ta mang tính bi ai.", "eng": "Her poetry has an elegiac quality."}, {"viet": "Phong cách giản dị của bà dễ làm người ta ngộ nhận: những điều bà nói rất sâu sắc.", "eng": "Her simple style is deceptive: what she has to say is very profound."}, {"viet": "Sự hợp tác, ủng hộ, v. v. chắc chắn của bà ta.", "eng": "Her unfailing cooperation, support, etc."}, {"viet": "Đây là bữa ăn nhẹ mà ông đã gọi.", "eng": "Here's the snack you ordered."}, {"viet": "Vẻ lãnh đạm của anh ta đối với đề nghị đó thật đáng bực mình.", "eng": "His apathy toward the proposal was annoying."}, {"viet": "Em anh ấy cao hơn anh ấy.", "eng": "His brother is taller than he is."}, {"viet": "Hồ sơ tội phạm của anh ta ảnh hưởng rất bất lợi cho anh đối với bồi thẩm đoàn.", "eng": "His criminal record weighed heavily against him with the jury."}, {"viet": "Mặt nó chuyển sang một màu đỏ tía không bình thường.", "eng": "His face turned an unnatural shade of purple."}, {"viet": "Hắn ngắm nhìn chăm chăm vào gương mặt nàng.", "eng": "His graze rested on her face."}, {"viet": "Công việc của anh ta rất bí mật.", "eng": "His job is very hush-hush."}, {"viet": "Lỗi của anh ta qua được mắt vị chủ bút nhưng lại bị người đọc và sửa chữa bản in thử phát hiện.", "eng": "His mistake got by the editor but was caught by the proofreader."}, {"viet": "Giọng nói hống hách của ông ta làm ai cũng tức giận.", "eng": "His peremptory tone of voice irritated everybody."}, {"viet": "Những điều nhận xét của anh ta gần như là thô thiển.", "eng": "His remarks were trenching on poor taste."}, {"viet": "Nhìn thấy thức ăn ấy dạ dày nó buồn nôn.", "eng": "His stomach has turned at the sight of the food."}, {"viet": "Tất cả nạn nhân của hắn đều bị bắn chết một cách tàn nhẫn.", "eng": "His victims were all shot down in cold blood."}, {"viet": "Giữ vững nguyên tắc của mình.", "eng": "Hold firm to one's principles."}, {"viet": "Trời nóng làm cô ta bị phát ban.", "eng": "Hot weather makes her come out in a rash."}, {"viet": "Làm sao chúng ta có thể làm mọi người quên đi được nỗi nhục của gia đình?", "eng": "How can we make people forget the family's shame?"}, {"viet": "Tôi mặc bộ com-lê mới trông như thế nào?", "eng": "How do I look in my new suit?"}, {"viet": "Bộ tiền kim loại như thế nào?", "eng": "How is the set of coins?"}, {"viet": "Mỗi tuần bạn mua bao nhiêu bình sữa?", "eng": "How many containers of milk do you buy every week?"}, {"viet": "Ngày nay một trăm đô la mua được bao nhiêu đạn?", "eng": "How much ammunition will a C-note buy these days?"}, {"viet": "Bao lâu bạn gặp bạn bè một lần?", "eng": "How often do you see your friends?"}, {"viet": "Hàng trăm người phải quay lại không vào được sân vận động, thí dụ vì sân vận động đã đầy rồi.", "eng": "Hundreds of people had to be turned away from the stadium."}, {"viet": "Tôi muốn kiểm tra vài chi tiết.", "eng": "I'd like to go over a few of the details."}, {"viet": "Tôi sẽ mang thức ăn đến phòng của ông ngay.", "eng": "I'll bring them to your room right away."}, {"viet": "Tôi sẽ giữ một vài bộ làm kỷ niệm cho chuyến thăm này của tôi đến Trung Quốc.", "eng": "I'll keep some as souvenirs for this visit of mine to China."}, {"viet": "Mẹ sẽ đọc câu thần chú để làm cho chỗ đó đỡ đau hơn.", "eng": "I'll use a magic spell to make it better."}, {"viet": "Tôi thật sự rất vui vì quý vị nói tiếng Anh lưu loát như vậy.", "eng": "I'm certainly glad you gentlemen speak English so well."}, {"viet": "Tôi sẽ đi cắt tóc ở tiệm.", "eng": "I'm going to the barber's shop to get my hair cut."}, {"viet": "Tôi không thể tiến hành công việc này nhanh được.", "eng": "I'm not getting on very fast with this job."}, {"viet": "Tôi thật may mắn vì hôm nay tôi có thể nếm chúng ở Trung Quốc.", "eng": "I'm so lucky I can taste them in China today."}, {"viet": "Tôi chắc là ông có thể thấy rằng giá cả của chúng tôi rất mang tính cạnh tranh.", "eng": "I'm sure you can find our prices most competitive."}, {"viet": "Tôi xưa nay vẫn học ngoại ngữ dễ dàng, đó là một năng khiếu.", "eng": "I've always been able to learn languages easily, it's a gift."}, {"viet": "Tôi đã quyết định nhận việc làm ở Mĩ.", "eng": "I've decided to accept the job in America."}, {"viet": "Tôi đã mời gia đình Smith đến nhà uống rượu vào thứ Sáu tới.", "eng": "I've invited the Smiths round for drinks next Friday."}, {"viet": "Tôi mất hai năm đi lang thang khắp thế giới.", "eng": "I've spent two years wandering the world."}, {"viet": "Tôi luôn bồn chồn lo lắng trước khi lên sân khấu.", "eng": "I always get the jitters before I go on stage."}, {"viet": "Tôi có trách nhiệm một phần về sự lầm lẫn đó.", "eng": "I am partly responsible for the confusion."}, {"viet": "Tôi bảo người phục vụ đưa ông ta ra cửa.", "eng": "I asked the attendant to conduct him to the door."}, {"viet": "Ta mang đến cho các người tin vui to lớn, thiên sứ báo tin Chúa Jesus ra đời.", "eng": "I bring you glad tidings of great joy, said the angel, announcing the birth of Jesus Christ."}, {"viet": "Tôi không thể đồng ý với ông về điểm này.", "eng": "I can't go along with you on that point."}, {"viet": "Tôi rất nóng lòng đọc quyển tiểu thuyết mới nhất của ông ấy.", "eng": "I can't wait to read his latest novel."}, {"viet": "Tôi có hiểu được ông phải buồn biết bao.", "eng": "I can well understand how sad you must be."}, {"viet": "Tôi bắt gặp cô ta đang thò tay vào trong hộp bánh quy.", "eng": "I caught her with her fingers in the biscuit tin."}, {"viet": "Tôi không thể nói đích xác được khi nào thì ông ta đến.", "eng": "I couldn't say for certain when he'll arrive."}, {"viet": "Tôi thích đi bộ hơn đi xe buýt.", "eng": "I'd rather walk than take a bus."}, {"viet": "Tôi không biết rằng anh ấy ở đây.", "eng": "I didn't know he was here."}, {"viet": "Tôi không biết anh ấy bao nhiêu tuổi, nhưng trông anh ấy phải quá bốn mươi nhiều rồi.", "eng": "I don't know how old he is, but he looks well past forty."}, {"viet": "Tôi không thích thú phải dậy sớm như thế.", "eng": "I don't relish having to get up so early."}, {"viet": "Tôi không muốn nghe tất cả các tầm phào đó!", "eng": "I don't want to hear all the piddling little details!"}, {"viet": "Tôi không xem đó là chuyện nghiêm chỉnh.", "eng": "I don't take it seriously."}, {"viet": "Sáng nay tôi cảm thấy hơi chuếnh choáng.", "eng": "I feel a bit hung-over this morning."}, {"viet": "Tôi cảm thấy hoàn toàn mụ mẫm cả người sau khi phải đối phó với năm đứa trẻ hiếu động suốt ngày.", "eng": "I felt totally shell-shocked after coping with five boisterous children all day."}, {"viet": "Tôi đã mua cái máy đó bằng tiền thật, nhưng nó lại hoá ra là đồ vứt đi.", "eng": "I gave good money for that camera, and it turned out to be worthless."}, {"viet": "Tôi lớn lên trong một hộ đông người.", "eng": "I grew up as part of a large household."}, {"viet": "Tôi bị sung huyết nặng đến nỗi đau cả đầu.", "eng": "I had such bad congestion that my head hurt."}, {"viet": "Tôi có giờ học toán lúc 9 giờ.", "eng": "I have a maths class at 9."}, {"viet": "Trong những cơn ác mộng tôi thấy mình bị rơi khỏi vách núi.", "eng": "I have nightmares about falling off a cliff."}, {"viet": "Tuần nào tôi cũng phải giúp ông cả.", "eng": "I have to help you every week."}, {"viet": "Tôi không tin tưởng lắm vào sự lương thiện của hắn.", "eng": "I haven't much belief in his honesty."}, {"viet": "Tôi hi vọng tôi ở đây không gây bất tiện gì cho anh.", "eng": "I hope I'm not inconveniencing you by staying here."}, {"viet": "Đọc thư anh tôi đoán chừng mọi chuyện đều tốt đẹp.", "eng": "I infer from your letter that all is well."}, {"viet": "Tôi biết cách chữa cầu chì khỏi cần anh xía vào.", "eng": "I know how to mend a fuse and I don't need you shoving your oar in."}, {"viet": "Tôi thích nhạc sống: đối với tôi, đĩa hát dứt khoát là không hay bằng.", "eng": "I like live music: for me, records are definitely second-best."}, {"viet": "Tôi sẽ mang thực đơn đến cho ông.", "eng": "I'll bring you the menu."}, {"viet": "Tôi sẽ đón ông vào lúc 7 giờ.", "eng": "I'll pick up up at 7 o'clock."}, {"viet": "E là tôi hút thuốc, bác sĩ ạ.", "eng": "I'm afraid I do, doctor."}, {"viet": "Trời ơi làm sao tôi biết được phải làm gì.", "eng": "I'm hanged if I know what to do."}, {"viet": "Tôi chán ngấy toàn bộ công việc.", "eng": "I'm sick of the whole business."}, {"viet": "Tôi ước tính tổng cộng khoảng 50 pao.", "eng": "I make the total to be about 50 pounds."}, {"viet": "Tôi hẳn là mù mới không nhận ra nguy hiểm mà chúng ta đã lâm vào.", "eng": "I must have been blind not to realize the danger we were in."}, {"viet": "Tôi cần vặn cái vít này lại, nó quá lỏng.", "eng": "I need to tighten this screw-it's very loose."}, {"viet": "Tối qua tôi đã đặt trước một bữa điểm tâm nhẹ, nhưng thay vào đó các cô lại mang đến một bữa điểm tâm kiểu Anh.", "eng": "I ordered a continental breakfast last night, but you sent an English breakfast instead."}, {"viet": "Tôi đã đặt tờ phiếu tính tiền trước mặt hắn để hắn không thể nào không nhìn thấy.", "eng": "I put the bill right under his nose so that his couldn't miss it."}, {"viet": "Tôi nhận ra anh ấy thông qua giọng cười ồm ồm chói tai.", "eng": "I recognized him by his raucous, penetrating laugh."}, {"viet": "Tôi đã ngồi đối diện với anh ấy trong suốt bữa ăn.", "eng": "I sat opposite to him during the meal."}, {"viet": "Tôi sẵn sàng, hơn nữa, sẽ tích cực giúp đỡ anh.", "eng": "I shall be ready, yes eager do help you."}, {"viet": "Tôi mỉm cười với đứa bé và nói'chào'.", "eng": "I smiled at the child and said'Hello'."}, {"viet": "Tôi nghĩ những thứ ở đây rất rẻ.", "eng": "I suppose things are very cheap."}, {"viet": "Tôi nghĩ tôi sẽ đến đúng giờ.", "eng": "I think I'm going to arrive on time."}, {"viet": "Tôi nghĩ đây là nhà của họ nhưng tôi không dám chắc.", "eng": "I think this is their house but I'm not sure."}, {"viet": "Tôi bảo anh ta cút đi chỗ khác.", "eng": "I told him to eff off."}, {"viet": "Tôi biết cô ta đang ở Pari.", "eng": "I understand she is in Paris."}, {"viet": "Tôi cần một sợi dây thừng dài từ cửa sổ trên cùng xuống đến mặt đất.", "eng": "I want a rope that will go from the top window to the ground."}, {"viet": "Tôi muốn nói với anh những tin tức tôi có.", "eng": "I want to share my news with you."}, {"viet": "Tôi sững sờ vì lời đề nghị bất ngờ của cô ta.", "eng": "I was dazed by her sudden offer."}, {"viet": "Tôi rất biết ơn John vì đã mang sách tới.", "eng": "I was most grateful to John for bringing the books."}, {"viet": "Tôi bị la mắng vì đến muộn.", "eng": "I was taken to task for arriving late."}, {"viet": "Tôi sẽ làm việc ca ngày, nhưng tôi sẽ rảnh sau.", "eng": "I will be working the day shift, but I will be free after."}, {"viet": "Tôi mong anh đừng thay đổi kế hoạch của anh xoành xoạch như vậy.", "eng": "I wish you wouldn't chop and change your plan like this."}, {"viet": "Trong cuộc đi bộ du lịch tôi đã đi rách hai đôi ủng.", "eng": "I wore out two pairs of boots on the walking tour."}, {"viet": "Tôi muốn thanh toán hoá đơn của tôi.", "eng": "I would like to pay my bill."}, {"viet": "Tôi gói quyển sách bằng giấy và gửi đi.", "eng": "I wrapped the book in paper and posted it."}, {"viet": "Nếu anh ta thắng-và đó là một cái nếu rất lớn-anh ta sẽ là người Anh đầu tiên giành được thắng lợi trong hai mươi năm nay.", "eng": "If he wins-and it's a big if-he'll be the first Englishman to win for twenty years."}, {"viet": "Nếu cô ấy không ở nhà, anh thử gọi đến cơ quan xem.", "eng": "If she's not at home, you could try phoning her at the office."}, {"viet": "Nếu chúng ta thêm tiền tố un vào từ happy chúng ta sẽ được từ unhappy.", "eng": "If we add the prefix un to the word happy, we make the word unhappy."}, {"viet": "Nếu anh mua cái bàn, anh sẽ được biếu không cái ghế.", "eng": "If you buy the table, you can have the chairs for nothing."}, {"viet": "Nếu anh đi bây giờ, anh sẽ hối tiếc về chuyện đó.", "eng": "If you go now, you'll regret it."}, {"viet": "Anh hãy nhớ là lũ trẻ ấy lúc này chắc đã lớn khôn rồi.", "eng": "If you think about it, those children must be grown-up by now."}, {"viet": "Những người nhập cư mong nhớ quê hương.", "eng": "Immigrants who repined for their homeland."}, {"viet": "Trong tiếng Anh hội thoại is not thường rút lại thành isn't.", "eng": "In conversational English is not often contracts to isn't."}, {"viet": "Trong việc học ngoại ngữ, con gái lúc nào cũng hơn hẳn con trai.", "eng": "In learning foreign languages, the girls knock spots off the boys every time."}, {"viet": "Nếu vậy thì chúng ta hãy hẹn vào 9 giờ sáng thứ hai tới nhé.", "eng": "In that case, let's make it nine o'clock next Monday morning."}, {"viet": "Trong chỗ trống ghi giới tính, đề M cho nam và F cho nữ.", "eng": "In the space marked sex put on M for male and F for female."}, {"viet": "Đất canh tác ngày càng nhường chỗ cho sự phát triển địa ốc.", "eng": "Increasingly, farm land is yielding to property development."}, {"viet": "Liệu anh ta có đồng ý với lời gợi ý của chúng ta không?", "eng": "Is he going to agree to our suggestion?"}, {"viet": "Nước bị ô nhiễm từ đầu nguồn hay ở giữa dòng?", "eng": "Is the water polluted at source or further downstream?"}, {"viet": "Thưa ông, bàn này có vừa lòng ông không?", "eng": "Is this to your satisfaction, sir?"}, {"viet": "Mỗi tuần tôi không hiểu tiền của tôi đi đằng nào.", "eng": "It's a puzzle where all my money goes each week."}, {"viet": "Hôm nay trời lạnh hơn hôm qua nhiều.", "eng": "It's considerably colder to day than it was yesterday."}, {"viet": "Khi người ta tụ tập và nói chuyện về các vấn đề rắc rối cũng là điều quan trọng.", "eng": "It's important for people to get together and talk about problems, too."}, {"viet": "Không dễ đi lại với đôi giày đóng vụng này.", "eng": "It's not easy walking in these clumsy shoes."}, {"viet": "Ở đây tuyết rơi không thể tưởng tượng nổi.", "eng": "It's snowing like all get out up here."}, {"viet": "Không có cái chảo rán không dính thì rất khó làm bánh rán.", "eng": "It's very difficult to make pancakes without a non-stick frying-pan."}, {"viet": "Cắt tóc ngắn không hợp với anh.", "eng": "It doesn't suit you to have your hair cut short."}, {"viet": "Khi đất đã bị đóng băng, rất khó đào.", "eng": "It is difficult to dig the ground when it is frozen."}, {"viet": "Nó mở cửa 24 giờ mỗi ngày, ông có thể đổi tiền.", "eng": "It is open 24 hours a day for you to change money."}, {"viet": "Tôi rất phẫn nộ khi thấy cô ấy bị đối xử tàn tệ như thế.", "eng": "It makes me sick to see her being treated so badly."}, {"viet": "Nó là bánh mì chiên mỡ.", "eng": "It's bread fried in fat."}, {"viet": "Hình như là cuộc họp sẽ không bao giờ chấm dứt.", "eng": "It seemed as if the meeting would never end."}, {"viet": "Thằng bé mất một giờ để viết cẩn thận một trang tiếng Đức.", "eng": "It took the boy an hour to spell out a page of German."}, {"viet": "Hôm qua trời lạnh nhưng hôm nay thậm chí còn lạnh hơn.", "eng": "It was cold yesterday, but it's even colder today."}, {"viet": "Khi không có tiền mà nói sẽ mua nó thì quả là vội vàng.", "eng": "It was rash to say you'd buy it when you haven't got any money."}, {"viet": "Có thể sẽ mất một thời gian mới hồi phục được tình trạng bình thường cho các lớp học sau cuộc bãi khóa sôi nổi 11 ngày.", "eng": "It will likely be some time before normalcy is restored to classrooms after the Tabasco-tempered 11-day workout."}, {"viet": "Jane à, bạn Susan của con đến đây gặp con này.", "eng": "Jane, your friend Susan is here to see you."}, {"viet": "John sẽ bắt đầu làm việc vào thứ hai này.", "eng": "John will start work this Monday."}, {"viet": "Bắt kịp sự phát triển của khoa học hiện đại.", "eng": "Keep apace of modern scientific developments."}, {"viet": "Chúng ta hãy mua bia và rượu vang ở cửa hàng bán rượu nhé.", "eng": "Let's buy the beer and wine at a liquor shop."}, {"viet": "Chúng ta hãy xem cách gọi món thịt bò bít-tết.", "eng": "Let's see how to order beefsteak."}, {"viet": "Rất nhiều vở kịch thuộc thời Elizabeth được viết theo thể thơ không vần.", "eng": "Many Elizabethan plays are written in blank verse."}, {"viet": "Nhiều khối nhà xấu xí đã được xây dựng trong những năm 1960.", "eng": "Many ugly blocks of flats were put up in the 1960's."}, {"viet": "Tôi khai miệng với ông được không?", "eng": "May I give you an oral declaration?"}, {"viet": "Có lẽ chúng ta trở lại vấn đề này sau vậy.", "eng": "Maybe we can come back to this later."}, {"viet": "Hầu hết tầng lớp quý tộc đều bỏ chạy trong cuộc cách mạng.", "eng": "Most of the nobility fled during the revolution."}, {"viet": "Cảm ơn ông', ông ta nói khi tôi mở cửa cho ông ta.", "eng": "Much obliged', he said as I opened the door for him."}, {"viet": "Con gái tôi đang theo học đàn piano và học tiếng Anh từ lúc cháu còn nhỏ.", "eng": "My daughter has been taking piano lessons and learning English since she was small."}, {"viet": "Nhà của tôi cách khá xa thành phố.", "eng": "My house is set well back from the town."}, {"viet": "Con dao bỏ túi của tôi luôn luôn có ích khi tôi đi cắm trại ngoài trời.", "eng": "My pocket knife always comes in handy when I camp out."}, {"viet": "Công viên Quốc gia ở Mỹ.", "eng": "National parks in the U. S. A."}, {"viet": "Bên cạnh quầy của Hãng Hàng không Singapore ở đằng kia.", "eng": "Next to the Singapore Airlines counter over there."}, {"viet": "Không phải thiếu tôn trọng ( anh ) nhưng tôi nghĩ rằng anh đã sai.", "eng": "No disrespect ( to you ), but I think you are wrong."}, {"viet": "Bây giờ, làm thế nào chúng ta biết là sản phẩm của chúng ta sẽ có ích cho mọi người?", "eng": "Now, how do we know that our product will work for everyone?"}, {"viet": "Bệnh béo phì là một vấn đề đối với nhiều người ở các nước phương Tây.", "eng": "Obesity is a problem for many people in Western countries."}, {"viet": "Ồ, bạn giúp tôi một việc nhé?", "eng": "Oh, would you do me a favour?"}, {"viet": "Khi người được bảo hiểm chết, gia đình anh ta sẽ nhận được một khoản tiền và một nguồn thu nhập hàng năm.", "eng": "On the death of the assured, his family will receive a lump sum and an annual income."}, {"viet": "Một trong những biểu hiện lập dị của anh ta là ngủ dưới gầm giường thay vì ngủ trên giường.", "eng": "One of his eccentricities is sleeping under the bed instead of on it."}, {"viet": "Sao anh không đi gặp bác sĩ?", "eng": "Oughtn't you to see a doctor?"}, {"viet": "Khu vườn của chúng tôi một bên giáp với một con suối.", "eng": "Our garden is bordered on one side by a stream."}, {"viet": "Hợp đồng hiện tại chúng tôi thuê căn hộ này đến tháng sau sẽ hết hạn.", "eng": "Our present lease on the flat expires next month."}, {"viet": "Nói chung, giọng điệu của cuốn sách đầy châm biếm.", "eng": "Overall, the tone of the book is satirical."}, {"viet": "Hôm nay là ngày phải thanh toán, nhưng tôi gia hạn cho bà ta một tuần lễ nữa.", "eng": "Payment is due today, but I gave her a week's grace."}, {"viet": "Có lẽ ống dẫn nhiên liệu bị tắc nghẽn.", "eng": "Perhaps there was a blockage in the fuel line."}, {"viet": "Cảnh sát truy cứu các hoạt động của nạn nhân vụ giết người.", "eng": "Police retraced the movement of the murder victim."}, {"viet": "Làm sống lại một cái áo đầm xưa từ thời thập kỷ sáu mươi.", "eng": "Resurrect an old dress from the sixties."}, {"viet": "Một vài ứng cử viên đã vận động để chiếm ưu thế từ lâu trước khi vị trí lãnh đạo bị bỏ trống.", "eng": "Several candidates had been maneuvering for position long before the leadership became vacant."}, {"viet": "Cô ấy cần may mắn mới thoát khỏi cảnh bế tắc như thế.", "eng": "She'll need luck to get out of the tight corner like that."}, {"viet": "Cô ấy trở nên hơi kênh kiệu từ khi giành được giải thưởng.", "eng": "She's been getting a bit above herself since winning her award."}, {"viet": "Bà ta ở địa vị cao trong cấp quản lý.", "eng": "She's high up in the management hierarchy."}, {"viet": "Bà ta đã để dành một món tiền kha khá cho khi về hưu.", "eng": "She's put aside a tidy sum for her retirement."}, {"viet": "Cô ta rất tự hào về mình-Cô ta luôn soi gương.", "eng": "She's very vain-She's always looking at herself in the mirror."}, {"viet": "Cô ta cho rằng thành công của mình là nhờ làm việc tích cực và có chút ít may mắn.", "eng": "She attributes her success to hard work and a bit of luck."}, {"viet": "Chắc chắn là cô ấy đã chẳng buồn bã héo hon trong khi anh đi xa đâu.", "eng": "She certainly hasn't been pining while you were away."}, {"viet": "Cô ta thường lần lữa trong công việc và hiếm khi hoàn tất được.", "eng": "She dallies over her work and rarely finishes it."}, {"viet": "Cô ấy không biết mình phải làm gì.", "eng": "She doesn't know what to do with herself."}, {"viet": "Bà ấy cảm thấy không có tội lỗi gì khi đánh tên ăn trộm.", "eng": "She felt no compunction about hitting the buglar."}, {"viet": "Cô ta được tiền boa và cả tiền công nên thực sự cô ta kiếm được rất nhiều tiền.", "eng": "She gets tips as well as her wages, so she's really raking it in."}, {"viet": "Cô ấy có những khó khăn lớn để hiểu anh ta.", "eng": "She had great difficulty in understanding him."}, {"viet": "Bà ta đã trông coi việc quản lý hàng ngày.", "eng": "She has been looking after the day-to-day administration."}, {"viet": "Cô ấy ngẩng cao đầu và thẳng lưng.", "eng": "She held her head erect and her back straight."}, {"viet": "Cô ta rất tỉ mỉ trong cách trình bày các sự việc.", "eng": "She is meticulous in her presentation of facts."}, {"viet": "Cô ấy vẫn làm việc mặc dù đã mệt.", "eng": "She kept on working although she was tired."}, {"viet": "Cô ấy nhìn con côn trùng dưới kính hiển vi.", "eng": "She looked at the insect under a microscope."}, {"viet": "Cô ta điệu bộ đi vào phòng trên đôi giày cao gót.", "eng": "She minced into the room wearing very high heels."}, {"viet": "Cô ấy biểu diễn điệu vũ hết các sinh động và dí dỏm.", "eng": "She performed the dance with great esprit."}, {"viet": "Bà ấy cố gắng biện minh cho sự bần tiện của mình bằng cách gọi nó là tiết kiệm.", "eng": "She rationalized her meanness by calling it economy."}, {"viet": "Bà ấy là một người đàn bà có một quá khứ mờ ám.", "eng": "She's a woman with a past."}, {"viet": "Bà ta xuất thân từ tầng lớp thượng lưu.", "eng": "She's out of the top drawer."}, {"viet": "Cô ấy nói bận quá không nói chuyện được với anh Bận, tôi không tin! Cô ấy không muốn thế thôi.", "eng": "She says she's too busy to speak to you Busy, my foot! She just doesn't want to."}, {"viet": "Cô ta tỏ ra rất chuyên cần trong việc học tập.", "eng": "She shows great diligence in her school work."}, {"viet": "Cô ta nhiệt tình bắt tay vào vun xới khu vườn.", "eng": "She started digging the garden with a will."}, {"viet": "Cô ấy gọi điện cho mẹ nói cô ấy đã đến nơi an toàn.", "eng": "She telephoned her mother to say she had arrived safely."}, {"viet": "Cô ta khinh khỉnh cái mặt trước món quà nhỏ của tôi.", "eng": "She turned her nose up at my small donation."}, {"viet": "Cô ta thuộc dòng dõi trâm anh.", "eng": "She was a lady by birth."}, {"viet": "Cô ta được bổ nhiệm làm trung úy trong Đoàn nữ binh.", "eng": "She was commissioned as a lieutenant in the Women's Army Corps."}, {"viet": "Chị ấy ở trong một trạng thái mâu thuẫn về việc sinh con.", "eng": "She was in a state of ambivalence about having children."}, {"viet": "Bà ấy bị buộc phải sát nhập công ti.", "eng": "She was pressured into agreeing to a merger."}, {"viet": "Cô ta có bản chất tốt.", "eng": "She was the essence of kindness."}, {"viet": "Cô ta làm theo kiểu Thatcher, áp đặt quan điểm của mình.", "eng": "She went about it à la Thatcher, putting her views very forcefully."}, {"viet": "Cô ta được đề bạt nhờ sự lừa dối.", "eng": "She won her promotion by deceit."}, {"viet": "Sherlock Holmes cũng không tài giỏi như anh, anh mới là một thám tử thứ thiệt.", "eng": "Sherlock Holmes has nothing on you-you're a real detective."}, {"viet": "Xua chó ra cắn những kẻ đột nhập.", "eng": "Sicced the dogs on the intruders."}, {"viet": "Ngồi trên giường có gối kê.", "eng": "Sit in bed propped up with pillows."}, {"viet": "Hãy ngửi cái này và cho tôi biết nó là cái gì.", "eng": "Smell this and tell me what it is."}, {"viet": "Dân tị nạn đến các trại tạm cư đã đông đến mức tối đa.", "eng": "So many refugees have arrived that the camps have reached saturation point."}, {"viet": "Một số chim bay về hướng nam để tìm chỗ sinh sản tốt.", "eng": "Some birds fly south to find good breeding-grounds."}, {"viet": "Một vài sinh viên đã làm bài tập ở nhà, nhưng phần lớn thì chưa làm.", "eng": "Some of the students had done their homework but most hadn't."}, {"viet": "Một số dân làng không bao giờ đi xa quá thị trấn lân cận.", "eng": "Some villagers have never been further afield than the neighbouring town."}, {"viet": "Xin lỗi, ắt hẳn bạn gọi nhầm số rồi.", "eng": "Sorry, but you must have the wrong number."}, {"viet": "Những nhận xét của người phát ngôn có thể làm thay đổi công luận.", "eng": "Spin-doctors'remarks could change public opinion."}, {"viet": "Bước vào chỗ mát tránh nắng.", "eng": "Step out of the sun into the cool."}, {"viet": "Xin thôi đừng có lo cho cuộc sống của tôi nữa!", "eng": "Stop trying to run my life for me!"}, {"viet": "Nó xem thành công hay thất bại là như nhau.", "eng": "Success and failure is one all the same to him."}, {"viet": "Những phụ nữ đấu tranh đòi quyền bầu cử là những người đầu tiên đòi nam nữ bình quyền ở Anh.", "eng": "Suffragettes were among the first feminists in Britain."}, {"viet": "Hồ Thiên Nga là một trong những tác phẩm nổi tiếng nhất của Traicốpski.", "eng": "Swan Lake is one of Tchaikovsky's best-known compositions."}, {"viet": "Hãy dùng thuốc đó và ông sẽ thấy khá hơn trong vài ngày.", "eng": "Take the medicine, and are you should be better in a few days."}, {"viet": "Những người quảng cáo trên truyền hình có thể lợi dụng số khán giả không thể rời đi được.", "eng": "Television advertisers can exploit a captive audience."}, {"viet": "Xin cám ơn ông đã bỏ bao công sức để tìm thấy cái tôi đang tìm kiếm.", "eng": "Thank you for going to so much trouble to find what I was looking for."}, {"viet": "Đó là chỗ mà lễ nhập trại trọng thể diễn ra.", "eng": "That's where the grand entry takes place."}, {"viet": "Hãng đó luôn luôn tiên phong trong lĩnh vực thiết kế xe ô tô nhiều năm liền.", "eng": "That firm was the pace-setter in car design for many years."}, {"viet": "Âm nhạc to quá, đề nghị vặn nhỏ lại.", "eng": "That music's too loud, please turn it down."}, {"viet": "Đó là điểm thuận lợi nhất của việc có xe hơi.", "eng": "That's the best of having a car."}, {"viet": "Đó chính là bộ quần áo cô ta mặc trong bữa tiệc.", "eng": "That was quite a rig she wrote to the party."}, {"viet": "Việc tính toán là đúng đắn ngoại trừ việc bỏ quên chiếc xe ngựa.", "eng": "The account is correct except for the omission of the carriage."}, {"viet": "Người đại lý đặt giá ngôi nhà đúng với giá thị trường.", "eng": "The agent priced the house at the right level for the market."}, {"viet": "Những con vật gầy và ốm vì người chủ trại sao nhãng chúng.", "eng": "The animals were thin and ill because the farmer had neglected them."}, {"viet": "Lập luận mang tính cách cá nhân quá đáng.", "eng": "The argument was becoming too personal."}, {"viet": "Bầu không khí tràn đầy sự náo động.", "eng": "The atmosphere was charged with excitement."}, {"viet": "Chữ b trong từ dumb không được phát âm.", "eng": "The b in dumb isn't sounded."}, {"viet": "Hệ thống an ninh được khoe khoang rùm beng của ngân hàng đã thất bại hoàn toàn.", "eng": "The bank's much-vaunted security system failed completely."}, {"viet": "Bãi biển hoang vắng, không một bóng người.", "eng": "The beach appeared deserted, not a human being in sight."}, {"viet": "Dự luật được thông qua với đa số rõ rệt.", "eng": "The bill was passed by a clear majority."}, {"viet": "Chiếc thuyền dong buồm ra khơi.", "eng": "The boat sailed off into the blue."}, {"viet": "Cuốn sách không thể tìm được.", "eng": "The book was not to be found."}, {"viet": "Con trai có thể chơi đá bóng nhưng con gái thì phải đến thư viện.", "eng": "The boys could play football but the girls had to go to the library."}, {"viet": "Ngân sách không đem đến những thay đổi quan trọng.", "eng": "The budget brought no significant changes."}, {"viet": "Các bụi cây sẽ che cho chúng ta thay quần áo.", "eng": "The bushes will screen us while we change."}, {"viet": "Chiếc xe ôtô nhất định không chịu nổ máy.", "eng": "The car absolutely refused to start."}, {"viet": "Ô tô rất nhanh nhưng máy bay còn nhanh hơn.", "eng": "The car was very fast, but the plane was faster still."}, {"viet": "Nguyên nhân của sự rối loạn có gốc rễ sâu xa.", "eng": "The causes of the trouble are deep-seated."}, {"viet": "Những nhân vật trong các tiểu thuyết của Charles Dickens.", "eng": "The characters in the novels of Charles Dickens."}, {"viet": "Đứa trẻ chạy đến với mẹ nó để được an ủi.", "eng": "The child ran to its mother to be comforted."}, {"viet": "Lũ trẻ có thể tự lo liệu cho chúng được khoảng hai giờ.", "eng": "The children can look after themselves for a couple of hours."}, {"viet": "Bọn trẻ được rèn cho đến khi biết vâng lời.", "eng": "The children were beaten into submission."}, {"viet": "Thành phố lại yên tĩnh sau những cuộc bạo loạn ngày hôm qua.", "eng": "The city is calm again after yesterday's riots."}, {"viet": "Những đám mây tan ra và mặt trời hiện ra.", "eng": "The clouds broke and the sun came out."}, {"viet": "Dường như màu này quá sáng đối với tôi.", "eng": "The colour seems too bright for me."}, {"viet": "Công ty giành được vị trí hàng đầu trong lĩnh vực điện tử.", "eng": "The company has achieved premier position in the electronics field."}, {"viet": "Vi tính là một trong những điều kì diệu nhất của khoa học hiện đại.", "eng": "The computer is one of the marvels of modern science."}, {"viet": "Hợp đồng đã rơi vào tay một người bạn của kế toán trưởng: đó là ( một trường hợp ) có đi có lại.", "eng": "The contract went to a friend of the chief accountant: it's ( a case of ) you scratch my back and I'll scratch yours."}, {"viet": "Quốc gia đó đã quyết định đổi tiền của học sang hệ thập phân.", "eng": "The country decided to decimalize its coinage."}, {"viet": "Những con bò đang ăn cỏ khô trong chuồng.", "eng": "The cows were feeding on hay in the barn."}, {"viet": "Đám đông ở trong tâm trạng thù địch.", "eng": "The crowd was in an ugly mood."}, {"viet": "Những tờ báo hàng ngày tấn công một cách cay độc vào những hành động của chính phủ.", "eng": "The daily papers carried a scathing attack on the actions of the government."}, {"viet": "Con hoẵng chạy tán loạn khi nghe chúng tôi đến gần.", "eng": "The deer scattered when they heard us approaching."}, {"viet": "Các chi tiết này được xem như là bí mật nhưng không biết làm sao đã lộ ra ngoài.", "eng": "The details were supposed to be secret but somehow leaked out."}, {"viet": "Sự khám phá ra chất ra-đi-um đã làm cho Marie Curie trở thành người phụ nữ khai sáng Thời đại Nguyên tử.", "eng": "The discovery of radium, which made Marie Curie mother to the Atomic Age."}, {"viet": "Bác sĩ kê đơn toa thuốc cho tôi.", "eng": "The doctor has put me on drugs."}, {"viet": "Con chó tru lên khi nó bị nhốt trong nhà.", "eng": "The dog howled when it was shut in the house."}, {"viet": "Cuộc rút thăm xổ số sẽ diễn ra vào ngày thứ Bảy.", "eng": "The draw for the raffle takes place on Saturday."}, {"viet": "Trục quả đất là đường giữa Bắc và Nam cực.", "eng": "The earth's axis is the line between the North and South Poles."}, {"viet": "Triều đại Elizabeth I là thời đại của thám hiểm và khám phá.", "eng": "The Elizabethan age was a time of exploration and discovery."}, {"viet": "Cửa vào dẫn tới phòng khách.", "eng": "The entrance door gives access to a living room."}, {"viet": "Ban quản trị có thành kiến với thư ký của ông ấy vì đã có được những thông tin về quá khứ của cô ấy.", "eng": "The executive has a bias against his secretary, having received information of her past."}, {"viet": "Sự kiện chỉ cho phép có một cách giải thích duy nhất.", "eng": "The facts allow of only one explanation."}, {"viet": "Nỗi sợ chết ám ảnh bà ta suốt tuổi già của bà.", "eng": "The fear of death obsessed her throughout her old age."}, {"viet": "Đám cưới của một ngôi sao màn bạc là một việc hào nhoáng phô trương.", "eng": "The film star's wedding was a glitzy affair."}, {"viet": "Hãng đó đã do một tổng công ty Mỹ nắm quyền điều hành.", "eng": "The firm has been taken over by an American conglomerate."}, {"viet": "Phần đầu của đợt cổ phần do công ty đó bán ra.", "eng": "The first tranche of the company's new share issue."}, {"viet": "Thức ăn đã sẵn sàng, đớp đi!", "eng": "The food's ready, so dig in!"}, {"viet": "Không khí tươi mát làm cho đôi má của cô ấy hồng hào.", "eng": "The fresh air brought colour to her cheeks."}, {"viet": "Mảnh vườn mới đẹp làm sao, tôi nghĩ là tôi sẽ ngồi ngoài trời.", "eng": "The garden's so lovely, I think I'll sit out."}, {"viet": "Cô gái đó chớp mắt mấy cái.", "eng": "The girl blindes her eyes several times."}, {"viet": "Chính sách của chính phủ có vẻ khá rệu rạo.", "eng": "The Government's policy is looking rather creaking."}, {"viet": "Chính phủ quyết định ngăn chặn sự gia tăng chi tiêu của nhà nước.", "eng": "The Government is determined to check the growth of public spending."}, {"viet": "Vị thống đốc đó sẽ tranh luận cho ra lẽ với cơ quan lập pháp về dự luật kinh phí đang gây tranh cãi.", "eng": "The governor will go to the mat with the legislature over the controversial spending bill."}, {"viet": "Nhóm đó kiêu căng tự cho rằng họ nắm quyền chỉ huy.", "eng": "The group had arrogantly assumed themselves to be in command."}, {"viet": "Chữ h câm như trong hour.", "eng": "The h is silent as in hour."}, {"viet": "Gà mái ấp trứng cho nở ra con.", "eng": "The hen hatches out her young by sitting on the eggs."}, {"viet": "Bầy ngựa chạy rầm rầm dọc theo đường đua.", "eng": "The horses are pounding along the track."}, {"viet": "Những ngôi nhà ở Osaka bị phá huỷ hoàn toàn bởi trận động đất đêm hôm qua.", "eng": "The house in Osaka was shent completely by the earthquake last night."}, {"viet": "Đôi vợ chồng xây cho mình một tổ ấm.", "eng": "The husband and wife built themselves a comfortable nest."}, {"viet": "Việc gia tăng tội phạm bạo lực gắn liền với sự gia tăng nạn thất nghiệp.", "eng": "The increase in violent crimes is allied to the rise in unemployment."}, {"viet": "Lãi suất đã phải được điều chỉnh mức cung cho mức cầu hiện tại.", "eng": "The interest rate had to be adjusted due to the inflation."}, {"viet": "Công việc đó chỉ có thể làm đơn xin trong ba tháng.", "eng": "The job in question is available for three months only."}, {"viet": "Bồi thẩm đoàn không tin sự vô tội của anh ta.", "eng": "The jury were unconvinced of his innocence."}, {"viet": "Cái đèn ngã ầm trên bàn.", "eng": "The lamp fell plonk on the table."}, {"viet": "Bãi cỏ trông khô héo sau nhiều ngày nắng.", "eng": "The lawn looked scorched after days of sunshine."}, {"viet": "Mức độ trang trọng xác định cách diễn đạt chính xác.", "eng": "The level of formality determines the precise mode of expression."}, {"viet": "Đoàn kịch địa phương đang diễn'Macbeth'tại Rạp Hát.", "eng": "The local drama group are putting on'Macbeth'at the Playhouse."}, {"viet": "Cây cối um tùm của rừng nhiệt đới có mưa.", "eng": "The luxuriant vegetation of tropical rain forests."}, {"viet": "Người đàn ông ở trạm xe buýt.", "eng": "The man is at the bus-stop."}, {"viet": "Trận đấu sẽ chứng tỏ ai là đấu thủ trội hơn.", "eng": "The match will show who is the superior player."}, {"viet": "Cuộc họp tiến hành tốt đẹp hơn chúng ta tưởng.", "eng": "The meeting went better than we had expected."}, {"viet": "Bài diễn văn của vị bộ trưởng được chào đón bằng những lời lăng mạ.", "eng": "The Minister's speech was greeted with brickbats."}, {"viet": "Số tiền được dành để nuôi dưỡng những đứa con của cô ta.", "eng": "The money will be kept in trust for her children."}, {"viet": "Những con đường núi cho đến cuối xuân mới qua được.", "eng": "The mountain roads are not passable until late spring."}, {"viet": "Quốc gia đó đã đặt những hy vọng của mình vào một người duy nhất.", "eng": "The nation had reposed its hopes in a single man."}, {"viet": "Kỳ thi mới này dài hơn và cũng do vậy khó đỗ hơn.", "eng": "The new exam is longer and correspondingly more difficult to pass."}, {"viet": "Quy luật mới áp dụng từ thứ hai tới.", "eng": "The new rule is applicable from next Monday."}, {"viet": "Mỗi tuần tờ báo đăng tiểu sử sơ lược của một vận động viên thể thao hàng đầu.", "eng": "The newspaper publishes a profile of a leading sportsman every week."}, {"viet": "Quyển tiểu thuyết được viết dưới dạng nhật ký.", "eng": "The novel is cast in the form of a diary."}, {"viet": "Lời đề nghị đi nước ngoài một năm với mọi chi phí được chi trả có vẻ rất hấp dẫn.", "eng": "The offer of a year abroad with all expenses paid seemed too good to miss."}, {"viet": "Ông lão nói lung tung về quá khứ.", "eng": "The old man rambled about the past."}, {"viet": "Chuyên viên kính nói rằng tôi cần có cặp kính mới.", "eng": "The optician said I needed new glasses."}, {"viet": "Người hoạ sĩ đã bắt được một cách thành công tác động lẫn nhau giữa ánh sáng và nước.", "eng": "The painter has successfully captured the interplay between light and water."}, {"viet": "Buổi tiệc là một thất bại hoàn toàn-các vị khách tất cả đều say và bắt đầu đánh nhau lung tung.", "eng": "The party was an absolute disaster the guests all got drunk and started fighting with each other."}, {"viet": "Chiều cao của con người đã tăng lên rõ rệt, dần dần qua từng thế hệ.", "eng": "The people's height has increased sharply, stepwise by generation."}, {"viet": "Đang bữa ăn thì chuông điện thoại reo.", "eng": "The phone rang during the meal."}, {"viet": "Sau cơn mưa lớn, sân bóng như tắm bùn.", "eng": "The pitch was a mud-bath after the heavy rain."}, {"viet": "Nhà máy sản xuất 500 ô tô mới một tuần.", "eng": "The plant puts out 500 new cars a week."}, {"viet": "Tình tiết của cuốn tiểu thuyết dựa quá nhiều vào những sự trùng hợp ngẫu nhiên nên không có tính hiện thực.", "eng": "The plot of the novel relies too much on coincidence to be realistic."}, {"viet": "Cảnh sát quay anh ta liên tục trong hơn một giờ đồng hồ.", "eng": "The police grilled him with non-stop questions for over an hour."}, {"viet": "Cảnh sát ghi lời khai của nhân chứng.", "eng": "The police took down the witness's statement."}, {"viet": "Dân chúng điêu đứng vì bệnh dịch.", "eng": "The population was smitten by the plague."}, {"viet": "Cuộc khủng hoảng hiện tại cũng giống như tình trạng ngay trước hồi chiến tranh.", "eng": "The present crisis is analogous with the situation immediately before the war."}, {"viet": "Báo chí theo kịp các sự kiện phát triển mới nhất.", "eng": "The press kept abreast of each development."}, {"viet": "Công chúa đã tham dự đêm trình diễn ca kịch đầu tiên.", "eng": "The princess attended the opening night of the opera."}, {"viet": "Quá trình sâu biến thành bướm.", "eng": "The process by which caterpillars are transformed into butterflies."}, {"viet": "Cái lợi và cái bất lợi của việc có một ngôi nhà riêng.", "eng": "The pros and cons of owning your own house."}, {"viet": "Những đức tính can đảm và nhìn xa thấy rộng là những thước đo tài năng lãnh đạo.", "eng": "The qualities of courage and vision that are the touchstones of leadership."}, {"viet": "Tín hiệu đường sắt chỉ tàu có thể qua.", "eng": "The railway signal showed that the train could pass."}, {"viet": "Sự suy thoái đã làm cho nhiều công ty nhỏ khánh kiệt.", "eng": "The recession has made many small companies go bankrupt."}, {"viet": "Báo cáo đã làm sáng tỏ tình trạng nghèo đói thật sự trong nội thị.", "eng": "The report has spotlighted real deprivation in the inner cities."}, {"viet": "Tổng thu nhập của Hội Đồng Thành Phố.", "eng": "The revenues of the City Council."}, {"viet": "Công trình làm đường gây ra nhiều lời kêu ca trong dân địa phương.", "eng": "The road-works caused much complaint among local residents."}, {"viet": "Đồ nội thất mang đi, gian phòng trông khác lạ.", "eng": "The room looks different with the furniture gone."}, {"viet": "Các vé hàng S bán hết rồi.", "eng": "The S tickets are all sold out."}, {"viet": "Phong cảnh ở miền núi rất đẹp.", "eng": "The scenery in the mountains is very beautiful."}, {"viet": "Lưng ghế được đặt hơi ngửa ra sau cho thoải mái hơn.", "eng": "The seat back is raked for extra comfort."}, {"viet": "Khung cảnh của câu chuyện là một khách sạn ở Paris trong thời chiến.", "eng": "The setting of the story is a hotel in Paris during the war."}, {"viet": "Tàu thuỷ lấy thêm nhiên liệu ở Freetown.", "eng": "The ship took on more fuel at Freetown."}, {"viet": "Thân hình quắt queo của một đứa trẻ đói ăn.", "eng": "The shrunken body of a starving child."}, {"viet": "Việc tường thuật tin tức tài tình của các ký giả thể thao.", "eng": "The skilful reportage of sports journalists."}, {"viet": "Các đảng viên đảng Xã Hội đã đạt được đa số tuyệt đối về số phiếu.", "eng": "The Socialists gained an absolute majority."}, {"viet": "Tiếng nói của họ thoảng qua mặt hồ đến tai chúng tôi.", "eng": "The sound of their voices wafted across the lake to us."}, {"viet": "Phi đội chưa sẵn sàng hoạt động.", "eng": "The squadron is not yet operational."}, {"viet": "Dây da cột bàn đạp làm trầy trụa mấy chỗ trên đôi chân anh ấy.", "eng": "The stirrup leathers rubbed raw patches on his legs."}, {"viet": "Nhân viên văn phòng bãi công đã chiếm giữ toàn bộ toà nhà.", "eng": "The striking office workers have occupied the whole building."}, {"viet": "Mặt trời bị che khuất một phần ( bởi mặt trăng ).", "eng": "The sun is partly eclipsed ( by the moon )."}, {"viet": "Thuế này là bước cáo chung cho các doanh nghiệp nhỏ.", "eng": "The tax is a death-warrant for small businesses."}, {"viet": "Đội sẽ dốc toàn lực để đoạt chức vô địch.", "eng": "The team is going all out to win the championship."}, {"viet": "Đề tài buổi thảo luận của chúng ta là Nhật Bản ngày nay.", "eng": "The theme of our discussion is Japan today."}, {"viet": "Thời gian nói đã qua, chúng ta phải hành động ngay tức thì.", "eng": "The time for talking is past, we must act at once."}, {"viet": "Chiếc máy kéo đã bị hỏng vì sử dụng ẩu.", "eng": "The tractor had been damaged by rough usage."}, {"viet": "Vụ xét xử dẫn đến kết quả là có nhiều nhân vật quan trọng có dính líu với tổ chức này.", "eng": "The trial resulted in the implication of several major figures in the organization."}, {"viet": "Hai cây cầu nhịp cuốn bằng thép dài nhất nằm ở Bayonne, N. J. và Sydney úc.", "eng": "The two longest steel arch bridges are those at Bayonne, N. J., and Sydney, Australia."}, {"viet": "Công đoàn đã được thành lập để bảo vệ quyền lợi của thợ mỏ.", "eng": "The union was formed to protect the rights and interests of miners."}, {"viet": "Tiền sảnh của nhà hát, khách sạn, v. v..", "eng": "The vestibule of a theatre, hotel, etc."}, {"viet": "Bức tường đã để lộ ra các vết ẩm ở nhiều chỗ.", "eng": "The wall was marked with damp in several places."}, {"viet": "Sức nặng của nước từ ống vỡ tràn ra đã làm sụt trần nhà.", "eng": "The weight of the water from the burst pipe caused the ceiling to collapse."}, {"viet": "Ngọn gió làm sóng nổi lăn tăn trên mặt hồ.", "eng": "The wind ruffled the surface of the lake."}, {"viet": "Những chữ được gạch dưới bằng bút bi đậm nét.", "eng": "The words were heavily underscored by a ballpoint."}, {"viet": "Nữ nghệ sĩ đàn viôlông trẻ đã làm lu mờ mọi đối thủ khác.", "eng": "The young girl violinist outshine all the other competitors."}, {"viet": "Tình bạn của họ đã nở rộ khi họ đang học ở trường cao học.", "eng": "Their friendship flowered while they were at college."}, {"viet": "Sự ương ngạnh của họ làm cho những cuộc thảo luận hoá thành vô nghĩa.", "eng": "Their stubbornness stultified the discussions."}, {"viet": "Lúc đó ông có thể chắc chắn là thư đã được nhận rồi.", "eng": "Then you can be sure it's done."}, {"viet": "Có cả một chồng hoá đơn đang chờ được thanh toán.", "eng": "There's a whole stack of his bills waiting to be paid."}, {"viet": "Đối với ông, không có gì tốt hơn là uống nhiều nước và ngủ thật nhiều.", "eng": "There's nothing better for you than plenty of water and sleep."}, {"viet": "Có những cánh đồng ở cả hai bên sông.", "eng": "There are fields on either side of the river."}, {"viet": "Có biết bao nhiêu điều phải suy xét trước khi chúng ta quyết định.", "eng": "There are so many things to think of before we decide."}, {"viet": "Gần đây trên ti vi có vài chủ đề thật sự là hay.", "eng": "There has been some really good stuff on TV lately."}, {"viet": "Có một chỗ rào đặc biệt bạn có thể xem ngựa trước khi cuộc đua bắt đầu.", "eng": "There is a special enclosure where you can look at the horses before the race starts."}, {"viet": "Có một cái trên bàn của tôi đấy.", "eng": "There is one on my desk."}, {"viet": "Đêm qua có một trận cãi vã dữ dội ở quán rượu.", "eng": "There was a dreadful shindy in the bar last night."}, {"viet": "Người ta không nói gì tới những sự kiện mới đây.", "eng": "There was no reference to recent events."}, {"viet": "Có những mối quan hệ bạn bè thân thiết giữa các thành viên của hội.", "eng": "There were strong ties of friendship between the members of the society."}, {"viet": "Những con chó này có khứu giác tuyệt vời.", "eng": "These dogs have a marvellous sense of smell."}, {"viet": "Anh biết đấy, những rắc rối này không thể cầu mong mà rũ bỏ được.", "eng": "These problems can't be wished away, you know."}, {"viet": "Họ rất có thể không cho anh tiền đâu', hắn lạnh nhạt nhận xét.", "eng": "They're not likely to give you money', he remarked dryly."}, {"viet": "Họ luôn giữ căn bếp của họ ngăn nắp sạch sẽ.", "eng": "They always keep their kitchen spick and span."}, {"viet": "Họ thuyết phục anh ta rút đơn kiện.", "eng": "They argued him into withdrawing his complaint."}, {"viet": "Họ ôm chặt lấy nhau khi từ biệt.", "eng": "They clung together as they said goodbye."}, {"viet": "Họ đã vét đáy sông đào để tìm đứa bé mất tích.", "eng": "They dragged the canal for the missing child."}, {"viet": "Họ tổ chức đám cưới một cách lặng lẽ-chỉ có một ít bạn bè tới dự.", "eng": "They had a quiet wedding-only a few friends attended."}, {"viet": "Họ tách những em cắm trại nhỏ nhất sang phòng khác.", "eng": "They hived off the youngest campers into another room."}, {"viet": "Họ tìm cách moi được một lời hứa của cô ấy.", "eng": "They managed to wring a promise out of her."}, {"viet": "Họ cầu nguyện ( Chúa ) để được chấm dứt nỗi khổ đau.", "eng": "They prayed ( to God ) for an end to their suffering."}, {"viet": "Họ lập mưu để ăn cắp tiền của ngân hàng.", "eng": "They schemed to steal money from the bank."}, {"viet": "Họ dạy anh tiếng Anh theo khoá học cấp tốc chỉ kéo dài trong một tuần, đúng là một vài ngày căng thẳng!", "eng": "They teach you English in an intensive course lasting just a week, it's quite an intensive few days!"}, {"viet": "Tất cả bọn họ cùng nói và tôi không thể hiểu được lời nào cả.", "eng": "They were all talking together and I couldn't understand a word."}, {"viet": "Họ ngạc nhiên về sự cởi mở của cô ta khi nói chuyện về đời tư của cô.", "eng": "They were surprised by her openess when talking about her private life."}, {"viet": "Tài khoản này cung cấp cho ông nguồn thu nhập dễ dàng.", "eng": "This account provides you with a ready source of income."}, {"viet": "Điều khoản này của đạo luật sẽ phải bác bỏ.", "eng": "This clause of the bill will have to go."}, {"viet": "Bài tiểu luận này là một tác phẩm làm rất chu đáo.", "eng": "This essay is a most conscientious piece of work."}, {"viet": "Đây là một việc nghiêm trọng, tôi phải nói chuyện với ông về nó.", "eng": "This is a matter of importance, I have to talk to you about it."}, {"viet": "Đây là Công ty thương mại Hoàn vũ.", "eng": "This is the Universal Trading Company."}, {"viet": "Chiếc cầu hẹp này là một mối đe doạ cho xe cộ.", "eng": "This narrow bridge is a danger to traffic."}, {"viet": "Khả năng đó không bao giờ nằm trong tính toán của chúng tôi.", "eng": "This possibility never entered into our calculations."}, {"viet": "Sân vận động này là nơi đã diễn ra nhiều trận bóng đá sôi nổi.", "eng": "This stadium has seen many thrilling football matches."}, {"viet": "Toàn bộ sự việc này đã làm cho tình hình loạn xạ cả lên.", "eng": "This whole thing has gotten out of hand."}, {"viet": "Ba trong số 102 thang máy trong mỗi toà tháp có thể đưa bạn từ tầng một đến tầng 110 trong một phút.", "eng": "Three of the 102 elevators in each tower can take you from the first to the 110th floor in one minute."}, {"viet": "Những người dự thi may mắn tối nay đã được lựa chọn từ khán giả.", "eng": "Tonight is lucky contestants have been already selected from the audience."}, {"viet": "Công nghiệp thép sẽ bị chết trừ phi chính phủ cấp thêm tiền.", "eng": "Unless the Government provides more cash, the steel industry is done for."}, {"viet": "Máy giặt, máy hút bụi và máy rửa bát tất cả đều là những thiết bị tiết kiệm sức lao động.", "eng": "Washing machines, vacuum cleaners and dish washers are all labour saving devices."}, {"viet": "Chúng tôi sẽ cho anh hay nếu có một chỗ nào khuyết.", "eng": "We'll let you know if any vacancies come up."}, {"viet": "Chúng tôi đã nhận được thư của ông đề ngày 15.", "eng": "We're in receipt of your letter of the 15th."}, {"viet": "Chúng tôi đã phát triển dự án từ một ý nghĩ độc đáo của Stephen.", "eng": "We've developed the project from an original idea by Stephen."}, {"viet": "Tất cả chúng tôi đều ( cười rũ ) ra khi nó bắt chước người phụ nữ hầu trà.", "eng": "We all fell about ( with laughter ) when he did his imitation of the tea-lady."}, {"viet": "Bây giờ chúng tôi xin chuyển sang phần tin tức để có một thông báo quan trọng.", "eng": "We are now going over to the news desk for an important announcement."}, {"viet": "Chúng tôi gọi anh ta là nhà vô địch bóng rổ.", "eng": "We call him the champion in basketball."}, {"viet": "Chúng tôi có thể đến thăm anh vào thứ bảy hoặc chủ nhật.", "eng": "We can visit you flexible on Saturday or Sunday."}, {"viet": "Chúng tôi rất cần phải thắng trận này.", "eng": "We desperately need a result from this match."}, {"viet": "Chúng tôi quạt lửa để làm cho nó cháy sáng hơn.", "eng": "We fanned the fire to make it burn brighter."}, {"viet": "Chúng tôi đã hy vọng là sẽ mua được ngôi nhà, nhưng có một đôi vợ chồng khác đã trả giá cao hơn chúng tôi, nghĩa là mua tranh mất của chúng tôi.", "eng": "We had hoped to get the house but another couple was bidding against us."}, {"viet": "Chúng tôi có món trứng chiên giăm bông, cơm chiên tôm pan-dan vịt quay với rau xanh, chúng đều là những món sở trường của bếp trưởng của chúng tôi.", "eng": "We have Ejggs with Ham, Fried Rice with Prawns Duck with Greens which is our chef's recommendation."}, {"viet": "Mùa hè này không nhiều sấm.", "eng": "We haven't had much thunder this summer."}, {"viet": "Chúng ta sẽ vào ga trong chốc lát nữa.", "eng": "We'll be at the station in a minute."}, {"viet": "Chúng ta phải uốn nắn lại những sự bất công và những chuyện không bình thường.", "eng": "We must correct these injustices and anomalies."}, {"viet": "Chúng ta cần có một người lo bộ phận tiếp thị trong công việc kinh doanh.", "eng": "We need someone to handle the marketing end of the business."}, {"viet": "Chúng tôi đã ra đến ngoại thành và bắt đầu tăng tốc độ.", "eng": "We reached the outskirts of town and began to pick up speed."}, {"viet": "Chúng tôi chắc có thể bán được chiếc xe ( cho ai đó ) với giá hời.", "eng": "We should be able to flog the car ( to someone ) for a good price."}, {"viet": "Chúng tôi tôn trọng đúng mức lời khuyên của cô ấy.", "eng": "We treated her advice with due deference."}, {"viet": "Tất cả chúng tôi đều sửng sốt trước tin đó.", "eng": "We were all dumbfounded by the news."}, {"viet": "Chúng tôi rất cảm động vì món quà chu đáo của anh.", "eng": "We were very touched by your thoughtful gift."}, {"viet": "Rất lo lắng về một công việc đòi hỏi nhiều công sức.", "eng": "Weighed down by the cares of a demanding job."}, {"viet": "Nào, chúng ta hãy nói chuyện trên đường đến thành phố.", "eng": "Well, let's talk on the way to the city."}, {"viet": "Nguyên nhân bộ quần áo diện và nụ cười hớn hở kia là cái gì thế?", "eng": "What's behind the smart suit and eager smile?"}, {"viet": "Một số điều mê tín ở nước bạn là gì?", "eng": "What are some superstitions in your country?"}, {"viet": "Trong khi đang dưỡng bệnh, bà ta làm gì cho qua thì giờ?", "eng": "What did she do to pass the time while she was convalescing?"}, {"viet": "Thật là thích biết bao khi tất cả chúng ta cùng đi nghỉ.", "eng": "What fun it will be when we all go on holiday together."}, {"viet": "Ở đất nước của bạn, chương trình truyền hình nào được yêu thích nhất?", "eng": "What is the most popular television program in your country?"}, {"viet": "Con chó của bạn có thể làm được trò gì?", "eng": "What kind of tricks can your dog do?"}, {"viet": "Ở nước bạn, những môn thể thao nào được ưa chuộng?", "eng": "What sports are popular in your country?"}, {"viet": "Những bánh xe trong cỗ máy được kéo bởi một dây cu roa liên tục.", "eng": "Wheels in a machine driven by an endless belt."}, {"viet": "Khi bị ông chủ từ chối không nghe mình, cô ấy đã vượt qua mặt ông ta lên gặp giám đốc.", "eng": "When her boss refused to listen to her she went over his head to the managing director."}, {"viet": "Khi được vặn hỏi, anh ta nói lên sự thật hoàn toàn.", "eng": "When questioned he came out with the stark truth."}, {"viet": "Khi người ta đi quá xa kinh nghiệm, mĩ học hoá quá nhiều thì những bức vẽ tranh sẽ chỉ đáng thất vọng mà thôi.", "eng": "When they range too far from experience, aestheticize too much, the pictures are disappointing."}, {"viet": "Tôi có thể mua vé cho chuyến đi ở đâu?", "eng": "Where can I buy a ticket for the tour?"}, {"viet": "Băng chuyển nào dành cho hành lý từ Hồng Kông đến?", "eng": "Which carousel is for the baggage from Hong Kong?"}, {"viet": "Xin hỏi phòng 123 đi lối nào?", "eng": "Which way is Room 123, please?"}, {"viet": "Ai ủng hộ đề nghị đó, Tôi có thể được biết qua việc giơ tay biểu quyết không?", "eng": "Who is in favour of the proposal, Can I have a show of hands, please?"}, {"viet": "Tại sao anh lại trình bày vấn đề đó theo cách này?", "eng": "Why do you represent the matter in this way?"}, {"viet": "Những hoa dại như phong lan và hoa anh thảo đang trở nên hiếm.", "eng": "Wild flowers such as orchids and primroses are becoming rare."}, {"viet": "Em vui lòng vá cho anh mảnh này lên quần được không?", "eng": "Will you please put a patch on these trousers?"}, {"viet": "Với sự điều khiển của cô ấy công ti đã bắt đầu phát đạt.", "eng": "With hear at the wheel, the company began to prosper."}, {"viet": "Những người công nhân đã bị sa thải một cách bất công.", "eng": "Workers who have been unfairly dismissed."}, {"viet": "Anh có muốn ăn gì không?", "eng": "Would you like something to eat?"}, {"viet": "Xin ông vui lòng xem bảng giá này?", "eng": "Would you please refer to this price list?"}, {"viet": "Phải, nhưng tốn kém quá-khách sạn là khách sạn đắt tiền nhất mà tôi đã từng ở.", "eng": "Yes, but it was expensive-the hotel was the most expensive one i've stayed in."}, {"viet": "Vâng, chúng tôi sẵn lòng làm điều này cho ông.", "eng": "Yes, we are pleased to do this for you."}, {"viet": "Anh sẽ phải đem việc đó ra ban giám đốc xét duyệt.", "eng": "You'll have to clear it with management."}, {"viet": "Giờ đây anh đã đủ già dặn để mà biết các quy tắc ứng xử.", "eng": "You're old enough now to know what's what."}, {"viet": "Anh chịu trách nhiệm phần lớn tai nạn này.", "eng": "You are largely responsible foe the accident."}, {"viet": "Anh không thể xem phim mà không có vé.", "eng": "You can't see the film without a ticket."}, {"viet": "Ông có thể lấy nó tại quầy tính tiền.", "eng": "You can pick one up at the register."}, {"viet": "Ông chẳng biết tôi nói gì?", "eng": "You didn't know what I'd say?"}, {"viet": "Anh ta phải chịu trách nhiệm về sơ suất của mình.", "eng": "You have to answers for your carelessness."}, {"viet": "Bạn nói tôi nghe ngon quá.", "eng": "You make it sound too good."}, {"viet": "Anh cần phải nghe cả hai quan điểm và cố gắng không thiên lệch.", "eng": "You must listen to both points of view and try not to be partisan."}, {"viet": "Bạn đã thi đậu bởi vì bạn học hành chăm chỉ.", "eng": "You passed because you worked hard."}, {"viet": "Anh nên thu xếp công việc của anh cho ổn thoả trước khi anh đi xa.", "eng": "You should settle your affairs before you leave."}, {"viet": "Cậu thật là may không bị cảnh sát tóm!", "eng": "You were damn lucky the police didn't catch you!"}, {"viet": "Báo cáo của ông rất xa sự thật.", "eng": "Your account is far from being true."}, {"viet": "Bố mẹ anh đang lo lắng về anh, hãy viết thư cho các cụ đi.", "eng": "Your parents are worrying about you, do write to them."}]