[{"viet": "Một chiếc áo cánh được may bằng vải phin nõn trắng.", "eng": "A blouse made of white organdie."}, {"viet": "Một đứa trẻ chưa đủ tuổi đến trường.", "eng": "A child of pre-school age."}, {"viet": "Một khoản kinh phí đáng kể cho công cuộc nghiên cứu cơ bản.", "eng": "A considerable outlay on basic research."}, {"viet": "Một đầu bếp dối trá ăn bớt thực phẩm và lừa gạt khách.", "eng": "A deceitful cook who skimps on ingredients and short changes guests."}, {"viet": "Một vở kịch thể hiện một sự kiện có thật ngoài đời.", "eng": "A dramatic representation of a real event."}, {"viet": "Con ngựa cái nhỏ lấy giống từ một con ngựa đua nổi tiếng.", "eng": "A filly sired by a famous racehorse."}, {"viet": "Một nhóm nhiếp ảnh viên tụ tập trên vỉa hè bên cạnh một đám đông người xem tăng dần.", "eng": "A gaggle of photographers huddled on the sidewalk beside a swelling crowd of onlookers."}, {"viet": "Một cảm giác vô cùng nhẹ nhõm tràn ngập tâm hồn anh ta.", "eng": "A great sense of relief flooded over him."}, {"viet": "Một quan niệm gây nhiều tranh luận về nghệ thuật hiện đại.", "eng": "A highly controversial view of modern art."}, {"viet": "Một giải pháp sinh tử đối với vấn đề đó.", "eng": "A kill-or-cure approach to the problem."}, {"viet": "Sự đặt mua đối với một tờ báo dài hạn.", "eng": "A life-time subscription to a magazine."}, {"viet": "Một chiếc máy với vài công dụng chưa được dùng.", "eng": "A machine with several potential uses."}, {"viet": "Một khiếu vừa phải về âm nhạc.", "eng": "A middle-of-the-road taste in music."}, {"viet": "Một cuốn sách mới cần phải đọc.", "eng": "A new book that is must reading."}, {"viet": "Một bức tranh thuộc về giai đoạn đầu sáng tác của họa sĩ đó.", "eng": "A painting belonging to the artist's early period."}, {"viet": "Một sự đưa dần vào những chính sách cá nhân mới.", "eng": "A phase-in of new personal policies."}, {"viet": "Một câu lạc bộ nổi tiếng với số lượng hội viên ngày càng tăng.", "eng": "A popular club with a growing membership."}, {"viet": "Một lỗ thủng bên hông lốp xe.", "eng": "A puncture in the side of the tyre."}, {"viet": "Một sự thay đổi hoàn toàn trong cách chữa trị bệnh ung thư.", "eng": "A revolution in the treatment of cancer."}, {"viet": "Một cái tua-vít và một cái búa là những đồ nghề duy nhất bạn cần.", "eng": "A screwdriver and a hammer are the only tools you need."}, {"viet": "Một chứng bệnh phổ biến ở các xứ nhiệt đới.", "eng": "A sickness common in the tropics."}, {"viet": "Một người con trai thừa hưởng tước vị từ cha của anh ta.", "eng": "A son inheriting a tittle from his father."}, {"viet": "Một người lạ mặt xuất hiện trong bộ đồ màu đỏ vàng.", "eng": "A stranger appeared in red and yellow garb."}, {"viet": "Một cô gái trẻ đang đứng khóc ở chỗ cửa ra vào.", "eng": "A tearful young girl stood in the door way."}, {"viet": "Một bài diễn văn chống đối dữ dội chính phủ mới.", "eng": "A truculent speech against the new government."}, {"viet": "Một xướng ngôn viên nổi tiếng về thời sự tôn giáo.", "eng": "A well-known broadcaster religious affairs."}, {"viet": "Đằng sau quay! viên thượng sĩ hét vang!", "eng": "About turn! barked the sergeant major!"}, {"viet": "Xin cho thêm xô đa vào rượu uýt-ki.", "eng": "Add some soda to the whisky, please."}, {"viet": "Sau những ồn ào náo nhiệt, rồi ra không sao tránh khỏi sự tái diễn tình trạng ban đầu.", "eng": "After all the excitement there was an inevitable reaction."}, {"viet": "Sau vài lần khởi đầu thất bại, cô ta đã trở thành một nhà báo thành công.", "eng": "After several false starts, she became a successful journalist."}, {"viet": "Hơn nữa, chúng ta phải cân nhắc những hàm ý luật pháp.", "eng": "Again, we have to consider the legal implications."}, {"viet": "Tất cả các loại nhạc đối với anh ấy đều như nhau.", "eng": "All music is alike to him."}, {"viet": "Tất cả các cung nữ và thợ thủ công đều bị chôn sống.", "eng": "All the palace maids and craftsmen were buried alive."}, {"viet": "Mặc dù nhịp tim vẫn còn đập yếu ớt, ông ta hầu như đã chết.", "eng": "Although there was still a faint heartbeat, he was to all intents and purposes dead."}, {"viet": "Một dịch vụ hàng không không hoạt động được.", "eng": "An air service that is inoperative."}, {"viet": "Một cái cầu không vận khẩn cấp để chuyên chở thực phẩm đến các vùng bị nạn đói hoành hành.", "eng": "An emergency airlift of food to the famine-stricken areas."}, {"viet": "Một sự gia tăng nhiệt không cảm thấy được.", "eng": "An indiscernible increase in temperature."}, {"viet": "Một ban nhạc chơi xả láng tạo nên một âm thanh khủng khiếp.", "eng": "An orchestra playing at full blast is a tremendous sound."}, {"viet": "Mỗi phòng là một hình vuông.", "eng": "And they're about three metres square each."}, {"viet": "Các tổ chức chống vũ khí hạt nhân muốn cấm bom nguyên tử.", "eng": "Antinuclear organizations want to ban the bomb."}, {"viet": "Nhiều chương trình nước ngoài như kịch Mỹ hay chương trình giáo dục của đài BBC có được chiếu trên tivi ở Úc không?", "eng": "Are many foreign programs, such as American dramas or BBC educational programs, shown on T. V. in Australia?"}, {"viet": "Bạn có biết nhạc La-tinh không?", "eng": "Are you familiar with Latin music?"}, {"viet": "Anh ít tuổi hay nhiều tuổi hơn tôi?", "eng": "Are you younger or older than me?"}, {"viet": "Khi cái ngày quan trọng đó đã đến chúng tôi vẫn chưa sẵn sàng để dọn nhà.", "eng": "As D-day approached we still weren't ready to move house."}, {"viet": "Thông thường không có nhiều người ở buổi họp.", "eng": "As usual, there weren't many people at the meeting."}, {"viet": "Ít nhất cũng có 15 hành lang của máy bay cũng đã bị hư hỏng.", "eng": "At least 15 jet-ways were damaged as well."}, {"viet": "Tạm biệt, hẹn gặp lại anh năm tới nhé!", "eng": "Au revoir, see you again next year!"}, {"viet": "Cẩn thận, súng đã nạp đạn rồi đấy.", "eng": "Be careful, that's gun loaded."}, {"viet": "Bị kết án mười năm khổ sai.", "eng": "Be sentenced to ten years hard labour."}, {"viet": "Ở một mình trong căn nhà đó làm tôi bồn chồn.", "eng": "Being alone in that gloomy house gave me the willies."}, {"viet": "Bôi nhọ nhân cách của ai bằng sự nói bóng gió.", "eng": "Blacken somebody's character by insinuation."}, {"viet": "Cho ra đời một em bé.", "eng": "Bring a child come into the world."}, {"viet": "Công việc làm ăn xấu tệ-tôi có ngưng cũng chẳng sao.", "eng": "Business is terrible-I might as well pack up."}, {"viet": "Nhưng bây giờ tôi rất tiếc vì tôi đã không tiếp tục học.", "eng": "But now I'm sorry I did not continue."}, {"viet": "Nhờ vận may, hắn thắng trong cuộc tranh tài.", "eng": "By a stroke of good fortune, he won the competition."}, {"viet": "Tính toán sức chịu đựng của chiếc cầu.", "eng": "Calculate the strains and stresses of a bridge."}, {"viet": "Tôi có thể gửi chúng cho ông trước năm giờ được không?", "eng": "Can I send them to you by five?"}, {"viet": "Bạn có thể chuyển cho anh ấy những lời thăm hỏi của tôi không?", "eng": "Can you give him my regards?"}, {"viet": "Anh có thể đề nghị chúng ta nên giải quyết vấn đề này thế nào không?", "eng": "Can you suggest how we might tackle the problem?"}, {"viet": "Xe ôtô không được đỗ trước lối ra vào.", "eng": "Cars must not park in front of the entrance."}, {"viet": "Bọn trẻ nô đùa như những chú chó con trên bãi biển.", "eng": "Children disporting themselves like puppies on the beach."}, {"viet": "Phát quang một con đường qua bụi cây thấp.", "eng": "Clear a path through the undergrowth."}, {"viet": "Hãy đến dự tiệc và nhớ đưa bạn bè cùng đến luôn nhé.", "eng": "Come to the party and bring some friends along."}, {"viet": "Xin chúc mừng và chúc sinh nhật hạnh phúc.", "eng": "Congratulations and many happy returns of the day."}, {"viet": "Chúng ta có thể diễn lại màn 2 một lần nữa không?", "eng": "Could we go through Act 2 once more?"}, {"viet": "Vui lòng cho tôi biết đường đến trạm xe buýt?", "eng": "Could you tell me the way to the bus station?"}, {"viet": "Cắt hai miếng bìa cứng rồi dán keo lại với nhau.", "eng": "Cut out two pieces of cardboard and gum them together."}, {"viet": "Tự làm giảm giá trị của mình qua việc lường gạt và nói dối.", "eng": "Degrade oneself by cheating and telling lies."}, {"viet": "Qua các manh mối đó, các thám tử đã suy đoán ra ai là kẻ đã phạm tội ác này.", "eng": "Detectives deduced from the clues who had committed the crime."}, {"viet": "Có phải chính bạn đã làm cái bánh này không?", "eng": "Did you make this cake yourself?"}, {"viet": "Đã tỏ ra quan tâm một cách gần như thương cảm tới việc cải thiện đời sống của thú vật.", "eng": "Displayed an almost maudlin concern for the welfare of animals."}, {"viet": "Những kế hoạch đó có được sự chấp thuận của anh không?", "eng": "Do the plans meet with your approval?"}, {"viet": "Bạn có thấy làm việc tình nguyện sẽ có ích cho những triển vọng khi xin việc trong tương lai không?", "eng": "Do you feel that volunteering will help future job prospects?"}, {"viet": "Anh có hiểu tí nào về ý nghĩa của sự việc này không?", "eng": "Do you have the slightest notion of what this means?"}, {"viet": "Ý anh muốn nói với tôi là anh không thích tiếng Anh đàm thoại phải không?", "eng": "Do you mean to tell me you are not interested in spoken English?"}, {"viet": "Bạn có nghĩ là người Nhật kín đáo hơn người phương Tây không?", "eng": "Do you think Japanese people are more reserved than Western people?"}, {"viet": "Các bác sĩ tỏ ra ít hi vọng về sự bình phục của bà ấy.", "eng": "Doctors hold out little hope of her recovering."}, {"viet": "Đừng có lên giọng dạy đời kiểu đó nghe!", "eng": "Don't adopt that righteous tone of voice!"}, {"viet": "Đừng nên thổi phồng sự trùng hợp giữa hai vụ.", "eng": "Don't exaggerate the parallelism between the two cases."}, {"viet": "Đừng tự hạ mình để cầu xin hắn giúp đỡ.", "eng": "Don't lower yourself by asking him for help."}, {"viet": "Đừng tác động tình cảm của tôi.", "eng": "Don't tamper with my feelings."}, {"viet": "Bác sĩ Smith có thể khám cho bà vào thứ sáu tới.", "eng": "Dr. Smith can see you next Friday."}, {"viet": "Bụi cuồn cuộn bốc lên khắp các đường phố.", "eng": "Dust swirling around in the streets."}, {"viet": "Say mê giọng hát của bọn trẻ.", "eng": "Enchanted with the singing of the children."}, {"viet": "Cho dù là vậy, tôi nghĩ giá đó không hợp lý.", "eng": "Even so, I think the price is unreasonable."}, {"viet": "Đòi hỏi các nhân viên của ai phải tuân thủ.", "eng": "Exact obedience from one's staff."}, {"viet": "Những nhà thám hiểm chẳng bận tâm về những mối hiểm nguy trong cuộc hành trình của họ.", "eng": "Explorers indifferent to the dangers of their journey."}, {"viet": "Cha và con trai có một mối quan hệ gần gũi.", "eng": "Father and son have a great rapport."}, {"viet": "Các điều hạn chế về tài chính làm cản trở việc phát triển thêm ở khu vực này.", "eng": "Financial constraints preclude further development on this site."}, {"viet": "Ngọn lửa đang phừng phừng bốc lên từ căn nhà đang cháy.", "eng": "Flames were shooting up from the burning house."}, {"viet": "Lạy Chúa, đừng rên rỉ nữa!", "eng": "For God's sake, stop that whining!"}, {"viet": "Thật lòng mà nói, tôi cũng cảm thấy vậy.", "eng": "Frankly speaking, I was feeling the same way."}, {"viet": "Ước lượng sức gió dựa vào sự chuyển động của cây cối.", "eng": "Gauging the strength of the wind from the movement of the trees."}, {"viet": "Những con dơi hình thù ma quái bay lướt lung tung trong đêm tối.", "eng": "Ghostly shapes of bats flitting about in the dark."}, {"viet": "Việc tung tin thất thiệt là một tội có thể bị trừng phạt.", "eng": "Giving false information is a punishable offence."}, {"viet": "Những lời chúc tốt lành trút xuống cô dâu chú rể.", "eng": "Good wishes showered down on the bride and bridegroom."}, {"viet": "Một nửa số tiền là của tôi.", "eng": "Half of the money is mine."}, {"viet": "Được sự yên thân nhờ có lương hưu bảo đảm.", "eng": "Have the security of a guaranteed pension."}, {"viet": "Bạn có bao giờ học chào hàng chưa?", "eng": "Have you ever studied sales talk?"}, {"viet": "Anh đã gửi bức thơ đó đi chưa?", "eng": "Have you sent that letter off yet?"}, {"viet": "Anh ta là một độc giả mê say truyện khoa học viễn tưởng.", "eng": "He's a great reader of science fiction."}, {"viet": "Từ khi cô ta bỏ hắn, hắn rất chán nản.", "eng": "He's been in the doldrums ever since she left him."}, {"viet": "Nó đang ở trong tâm trạng bực bội, nên tớ lánh đi thôi.", "eng": "He's in a bad mood, so I'll make myself scarce."}, {"viet": "Anh ta chỉ nhai lại những thứ nhớ được từ các bài giảng.", "eng": "He's simply regurgitating stuff remembered from lectures."}, {"viet": "Hắn công nhận điều đó là đúng.", "eng": "He acknowledged it to be true."}, {"viet": "Ông yêu cầu nhân viên khách sạn làm thủ tục trả phòng cho ông.", "eng": "He asks the clerk to check out for him."}, {"viet": "Ông ta đã đến đích trước đối thủ của mình nửa giây.", "eng": "He broke the tape half a second ahead of his rival."}, {"viet": "Anh ta đuổi theo tên trộm nhưng không bắt được hắn.", "eng": "He chased after the burglar but couldn't catch him."}, {"viet": "Anh ta leo lên gác không gây một tiếng động.", "eng": "He crept upstairs without a sound."}, {"viet": "Anh ta chết sau khi bị hai vết thương đạn ở đầu.", "eng": "He died after receiving two bullet wounds in the head."}, {"viet": "Nó uống một hơi sạch ly.", "eng": "He emptied his glass at one draught."}, {"viet": "Anh ta cảm thấy bị công ty ngược đãi.", "eng": "He felt misused by the company."}, {"viet": "Anh ta vui vẻ chào tôi.", "eng": "He gave me a cheery hallo."}, {"viet": "Anh ta chào tôi với một nụ cười đưa đẩy.", "eng": "He greeted me with a greasy smile."}, {"viet": "Anh ấy đã phải đứng chụp ảnh mang vòng hoa chiến thắng.", "eng": "He had to pose wearing a laurel wreath."}, {"viet": "Anh ta vẫn nuôi một mối hằn thù đối với tôi.", "eng": "He has been nursing a grudge against me."}, {"viet": "Anh ấy phải thi đỗ rồi mới có thể bắt đầu làm việc.", "eng": "He has to pass an examination before he can start work."}, {"viet": "Anh ấy là một người hơi thích bông đùa.", "eng": "He is a bit of a wag."}, {"viet": "Thực sự mà nói ông ta không phải là thành viên ban giám hiệu.", "eng": "He is not properly speaking a member of the staff."}, {"viet": "Anh ấy xét thấy rằng đã đến lúc phải thưa kiện.", "eng": "He judged that it was time to open the proceedings."}, {"viet": "Anh ta nhắc tấm thảm lên và luồn chiếc chìa khóa dưới đó.", "eng": "He lifted the mat and slid the key under it."}, {"viet": "Anh ta đã đánh mất nó ở đâu đó trong khoảng từ đây đến nhà ga.", "eng": "He lost it somewhere between here an the station."}, {"viet": "Ông ta đã thế chấp căn nhà của mình để bắt đầu kinh doanh.", "eng": "He mortgaged his house in order to start a business."}, {"viet": "Anh ta đã khắc phục những thói xấu của mình chỉ bằng sức mạnh của ý chí.", "eng": "He overcame his bad habits by sheer force of will."}, {"viet": "Ông ta thích những đống lửa lộ thiên hơn là những lò hoặc lò sưởi điện.", "eng": "He prefers open fires to stoves or radiators."}, {"viet": "Ông ta đã trích dẫn những số liệu để chứng minh trường hợp của mình.", "eng": "He quoted figures to prove his case."}, {"viet": "Anh ta xa lánh những sinh viên khác.", "eng": "He remained aloof from the other students."}, {"viet": "Anh ấy là một trong những người bạn của tôi.", "eng": "He's a friend of mine."}, {"viet": "Anh ta lúc nào cũng cảm thấy run sau vụ tai nạn của anh ta.", "eng": "He's bound to feel shaken after his accident."}, {"viet": "Ông ta lớn tuổi hơn cô ta rất nhiều.", "eng": "He's miles older than she is."}, {"viet": "Anh ta quá vụng về không thể chơi quần vợt giỏi được.", "eng": "He's too uncoordinated to play tennis well."}, {"viet": "Anh ấy nói rằng anh ấy sẽ rửa chén đĩa.", "eng": "He says he'll do the washing-up."}, {"viet": "Chắc anh ta sắp tới rồi.", "eng": "He should be arriving just about now."}, {"viet": "Đôi khi anh ấy dường như bẳn tính nhưng thực ra anh ta có một tấm lòng vàng.", "eng": "He sometimes seems bad-tempered but really he's got a heart of gold."}, {"viet": "Anh ta nắm chặt lan can để giữ cho mình đứng vững.", "eng": "He steadied himself by holding on to the rail."}, {"viet": "Anh ấy đã bị khuất phục trước nỗi thất vọng để rồi cuối cùng phải tự sát.", "eng": "He surrendered himself to despair and eventually committed suicide."}, {"viet": "Anh ta chen lấn qua đám đông.", "eng": "He thrust his way through the crowd."}, {"viet": "Anh ta ngược xuôi giữa Luân Đôn và New York.", "eng": "He travels backwards and forwards between London and New York."}, {"viet": "Anh ta dùng đèn pin soi tìm thứ gì đó trong tủ đựng chén dĩa.", "eng": "He used a torch to see into the dark cupboard."}, {"viet": "Chàng thể hiện một sự kết hợp duyên dáng của nỗi buồn và niềm vui.", "eng": "He was a charming mixture of glum and glee."}, {"viet": "Hắn bị ghi vào sổ đen do những quan điểm cực đoan quá khích của hắn.", "eng": "He was blacklisted because of his extremist views."}, {"viet": "Cậu ấy thất vọng khi nghe tin họ sẽ không đến.", "eng": "He was disappointed to hear they were not coming."}, {"viet": "Nó không thể ngăn anh ra đi.", "eng": "He was helpless to prevent your leaving."}, {"viet": "Anh ta hồi hộp lo lắng chờ đợi kết quả chung cuộc.", "eng": "He was on tenterhooks while waiting for the final result."}, {"viet": "Anh ta xấu hổ vì những người khác đã làm hơn biết bao nhiêu là công việc.", "eng": "He was shamed by how much more work the others had done."}, {"viet": "Anh ta ngu quá không hỏi lấy hoá đơn.", "eng": "He was too feather brained to think of asking for a receipt."}, {"viet": "Anh ta lội trong nước băng giá cao tới đầu gối.", "eng": "He went knee-deep in the icy water."}, {"viet": "Ông ta thắng các trận để cuối cùng thất bại.", "eng": "He won the battles only to lose the war."}, {"viet": "Nghe thông báo về một trận bão qua máy vô tuyến trên tàu.", "eng": "Hear a gale warning over a ship's radio."}, {"viet": "Lý lẽ của bà ấy phân xử vấn đề đó có lợi cho anh ta.", "eng": "Her argument decided the issue in his favour."}, {"viet": "Quần áo của cô ta luôn luôn hợp thời trang.", "eng": "Her clothes are always right up to the minute."}, {"viet": "Đôi mắt cô ta long lên tức giận và thách thức với mọi người.", "eng": "Her eyes flashed anger and defiance at everyone."}, {"viet": "Cách xử lý khủng hoảng của bà ấy khiến tôi tràn đầy niềm thán phục.", "eng": "Her handling of the crisis fills me with admiration."}, {"viet": "Cuốn tiểu thuyết cuối cùng của bà ấy thật là dở vô cùng.", "eng": "Her last novel was truly awful."}, {"viet": "Cuốn tiểu thuyết mới của cô ấy đã được vào danh sách những cuốn sách bán chạy nhất.", "eng": "Her new novel has made the best-seller lists."}, {"viet": "Câu hỏi của cô ấy xuất phát từ những lo nghĩ về tương lai của mình.", "eng": "Her question was prompted by worries about her future."}, {"viet": "Bài diễn văn của cô ta kích động mạnh mẽ tâm trạng giận dữ của khán giả.", "eng": "Her speech played heavily on the angry mood of her audience."}, {"viet": "Toàn bộ câu chuyện của cô ấy đều là bịa đặt.", "eng": "Her whole story had been faked."}, {"viet": "Này bà-bà không đỗ xe ở đó được đâu!", "eng": "Hey lady-you can't park there!"}, {"viet": "Viên trợ lý của ông ta đã được thăng chức cao hơn ông.", "eng": "His assistant was promoted over his head."}, {"viet": "Sức quyến rũ của cậu ta không gây ảnh hưởng gì đối với tôi.", "eng": "His charm doesn't work on me."}, {"viet": "Những cổ động viên hết ảo tưởng đã rời bỏ anh ta.", "eng": "His disenchanted supporters abandoned him."}, {"viet": "Dòng họ gia đình ông ấy có từ thời nữ hoàng Elizabeth I.", "eng": "His family goes back to the time of Queen Elizabeth I."}, {"viet": "Những lời nói ác nghiệt của hắn gây cho cô ta nhiều đau khổ.", "eng": "His harsh words caused her much pain."}, {"viet": "Cuốn tiểu thuyết cuối cùng của ông ta tạo ra một dư luận xôn xao trong giới phê bình.", "eng": "His last novel created a furore among the critics."}, {"viet": "Tôi sắp nhớ ra tên anh ta, nhưng vẫn chưa nghĩ ra là gì.", "eng": "His name's on the tip of my tongue, but I just can't think of it."}, {"viet": "Những vở kịch của ông ta chỉ nổi bật vì sự quá tầm thường của chúng.", "eng": "His plays are distinguished only by their stunning mediocrity."}, {"viet": "Cách cư xử thô lỗ của nó có phần nào gây khó chịu.", "eng": "His rough manners were rather off-putting."}, {"viet": "Thành công của ông ta chẳng qua là do lao động tích cực mà được.", "eng": "His success is ascribable simply to hard work."}, {"viet": "Vợ anh ấy là người Thụy Sĩ và làm việc trong một văn phòng.", "eng": "His wife's Swiss and works in an office."}, {"viet": "Các lỗ thủng ở đáy bít tất của anh ta.", "eng": "Holes in the soles of his socks leather soles."}, {"viet": "Giáo viên sử mới của bạn ra sao?-Thầy dễ tính lắm.", "eng": "How's your new history teacher?-He's duck soup."}, {"viet": "Sao anh có thể thốt ra được những lời dối gian như vậy?", "eng": "How can you utter such falsehoods?"}, {"viet": "Anh tuyên án bị cáo ra sao?", "eng": "How do you find the accused?"}, {"viet": "Cô nghĩ chúng tôi sẽ phải chờ trong bao lâu?", "eng": "How long do you think we'll have to wait?"}, {"viet": "Đi từ Hà Nội đến Hải Phòng mất mấy giờ xe lửa?", "eng": "How many hour's run is Hai Phong from Hanoi by train?"}, {"viet": "Ông có sẵn bao nhiêu sơn vậy?", "eng": "How much do you have handy?"}, {"viet": "Cậu có thể chuẩn bị sớm trong bao lâu?", "eng": "How soon can you be ready?"}, {"viet": "Vợ chồng thỉnh thoảng nên thay đổi vai trò cho nhau.", "eng": "Husband and wife should switch roles occasionally."}, {"viet": "Tôi muốn đặt hai chỗ trên chuyến tàu 8 giờ sáng đi San Francisco.", "eng": "I'd like to reserve two seats on the 8 a. m. train to San Francisco."}, {"viet": "Tôi sẽ vẽ cho anh cái sơ đồ đi đến nhà tôi.", "eng": "I'll draw a map of how to get to my house."}, {"viet": "Tôi sẽ không bao giờ tha thứ cho anh những điều anh đã nói với tôi đêm qua.", "eng": "I'll never forgive you for what you said to me last night."}, {"viet": "Tôi e là tất cả các bàn đều có người ngồi, thưa ông.", "eng": "I'm afraid all of our tables are taken, sir."}, {"viet": "Tôi đã chán ngấy với những lời kêu ca bất tận của anh.", "eng": "I'm fed up with your everlasting complaints."}, {"viet": "Hôm nay tôi sẽ đi rút chỉ những mũi khâu của tôi.", "eng": "I'm having my stitches taken out today."}, {"viet": "Tôi không khờ dại đến nỗi cho rằng điều đó sẽ dễ dàng.", "eng": "I'm not so simple as to think it will be easy."}, {"viet": "Tôi lấy làm tiếc về điều rắc rối tôi đã gây ra.", "eng": "I'm sorry about the trouble I've caused."}, {"viet": "Tôi đang suy tính mua một chiếc xe ôtô mới.", "eng": "I'm thinking of investing in a new car."}, {"viet": "Tôi đã lái xe được hai mươi năm và chưa bao giờ gặp nạn.", "eng": "I've been driving for 20 years and never had an accident touch word."}, {"viet": "Tôi có nhiều việc khẩn cấp phải làm ở nhà và vì vậy sẽ phải lánh mặt vài tuần.", "eng": "I've got a lot of urgent work to do at home and will have to go into purdah for a couple of weeks."}, {"viet": "Tôi đã mất liên lạc với tất cả các bạn bè cũ.", "eng": "I've lost touch with all my old friends."}, {"viet": "Tôi đã phủi tay không chịu trách nhiệm gì nữa về toàn bộ cái công việc nhớp nhúa ấy.", "eng": "I've washed my hands of the whole sordid business."}, {"viet": "Tôi hình như lúc nào cũng bị đen trong bài bạc.", "eng": "I always seem to be unlucky at cards."}, {"viet": "Tôi lấy làm buồn nghe tin ông cụ thân sinh mất.", "eng": "I am sorry to hear your father's death."}, {"viet": "Người tôi mềm nhão sau khi tôi ngừng chơi bóng đá đều đặn.", "eng": "I became rather flabby after I stopped playing football regularly."}, {"viet": "Tôi đến đây đặc biệt để thăm anh.", "eng": "I came here specially to see you."}, {"viet": "Tôi không thể di chuyển được chiếc đàn pianô nếu không có sự giúp đỡ.", "eng": "I can't move this piano without assistance."}, {"viet": "Tôi có thể làm nhanh cho anh một ít trứng tráng.", "eng": "I can easily whip you up some scrambled eggs."}, {"viet": "Tôi không thể đến dự buổi tiệc được.", "eng": "I can't come to the party."}, {"viet": "Tôi chúc mừng họ nhân ngày họ sinh con.", "eng": "I congratulated them on the birth of their baby."}, {"viet": "Tao thấy nhẹ nợ nếu mày chịu xéo đi!", "eng": "I'd be glad if you would go away!"}, {"viet": "Tháng rồi bố đã mua sắm rất nhiều nhưng bố không biết thật ra bố đã tiêu hết bao nhiêu tiền.", "eng": "I did a lot of shopping last month but I wonder how much I actually spent."}, {"viet": "Tôi làm việc trong nhiều lĩnh vực ở đó.", "eng": "I do a lot of business there."}, {"viet": "Tôi không biết bài kiểm tra sẽ ra đề nào, vì vậy tôi thật sự không biết chắc phải học cái gì?", "eng": "I don't know what to expect on the test, so I'm not really sure what to study?"}, {"viet": "Tôi cho rằng bà ta không quan tâm đến những gì xảy ra với con cái bà.", "eng": "I don't think she cares what happens to her children."}, {"viet": "Tôi không có ý nhắc đi nhắc lại điều đó, nhưng anh thực sự còn nợ tôi 200 bảng Anh đấy.", "eng": "I don't wish to press the point, but you do owe me £ 200."}, {"viet": "Tôi không chắc là anh ấy có đến hay không.", "eng": "I doubt whether he'll come."}, {"viet": "Tôi cảm thấy vì danh dự mà phải có mặt vì tôi đã hứa như vậy.", "eng": "I feel honour bound to attend because I promised I would."}, {"viet": "Tôi thấy em không biết bơi đó là điều hết sức ngạc nhiên.", "eng": "I find it amazing that you can't swim."}, {"viet": "Tôi rất luyến tiếc dĩ vãng khi xem các vở nhạc kịch cũ trên Tivi.", "eng": "I get very nostalgic when I watch these old musicals on TV."}, {"viet": "Tôi thình lình đối mặt với một con rắn độc.", "eng": "I had a close encounter with a poisonous snake."}, {"viet": "Tôi phải khắc phục nhiều gian khổ trong công việc này.", "eng": "I had to overcome many difficulties in this task."}, {"viet": "Tôi có cuộc hẹn, làm ơn nhanh lên!", "eng": "I have an appointment to make, please hurry!"}, {"viet": "Tôi không có chút thì giờ nào để viết thư cho anh.", "eng": "I have no time at all to write to you."}, {"viet": "Tôi có rất ít thời gian để đọc.", "eng": "I have very little time for reading."}, {"viet": "Tôi nghe nói có nhiều người Canada gốc Hoa ở Vancouver.", "eng": "I hear that there are many Chinese Canadians in Vancouver."}, {"viet": "Tôi hy vọng những gì tôi nói sẽ làm sáng tỏ tình hình.", "eng": "I hope that what I say will clarify the situation."}, {"viet": "Cháu đúng là không quen được chuyện đó.", "eng": "I just can't get used to it."}, {"viet": "Tôi biết gia đình cả ba thế hệ.", "eng": "I know the family for three generations."}, {"viet": "Tôi thích đi hạng vé doanh nhân có thể ngả ra sau để nhìn.", "eng": "I like to fly business class because the seats fully recline."}, {"viet": "Tôi sẽ làm việc đó nếu đó là điều anh muốn.", "eng": "I'll do it if that's what you wish."}, {"viet": "Tôi sẽ đập vỡ đầu của bạn bây giờ!", "eng": "I'll smash your head in!"}, {"viet": "Tôi luôn luôn sẵn sàng phục vụ ngài.", "eng": "I'm at your service at all times."}, {"viet": "Tôi sắp đi vệ sinh đây.", "eng": "I'm just going to spend a penny."}, {"viet": "Tôi lấy làm ân hận đã nói năng thô lỗ với anh lúc nãy.", "eng": "I'm sorry I snapped at you just now."}, {"viet": "Tớ muốn nói, bạn có thể học một khóa về thương mại.", "eng": "I mean, you can do a course in business studies."}, {"viet": "Tôi phải nói là tôi khoái vụ đó.", "eng": "I must say I enjoyed that."}, {"viet": "Tôi không bao giờ cho mượn sách cả, anh chẳng bao giờ lấy lại được đâu.", "eng": "I never lend books, you never got them back."}, {"viet": "Tôi đã đậu kỳ kiểm tra chuyên tiếng Anh, hạng 4.", "eng": "I passed the Test for English Majors, Grade Four."}, {"viet": "Tôi ít khi mua thứ gì dùng rồi.", "eng": "I rarely buy anything second-hand."}, {"viet": "Tôi đã để ý thấy ( việc ) anh ta tới trễ.", "eng": "I registered ( the fact ) that he was late."}, {"viet": "Tôi thấy bạn tôi tuần trước nhưng tuần này tôi không gặp anh ấy.", "eng": "I saw my friend last week, but I haven't seen him this week."}, {"viet": "Tôi cần phải xem xét kỹ lưỡng ngôi nhà trước khi có thể nói giá với ông.", "eng": "I shall need to see over the house before I can make you an offer."}, {"viet": "Tôi lại trải qua một buổi tối đơn độc.", "eng": "I spent the evening on my tod again."}, {"viet": "Tôi tắm vòi sen vào buổi sáng.", "eng": "I take a shower in the morning."}, {"viet": "Tôi nghĩ chắc rằng anh ta sẽ kiếm được việc làm.", "eng": "I think it's pretty safe bet that he'll get the job."}, {"viet": "Tôi nghĩ rằng anh phải đi khám bác sĩ.", "eng": "I think you ought to go to see the doctor."}, {"viet": "Tôi chụp bức ảnh này với kính lọc màu đỏ.", "eng": "I took this picture with a red filter."}, {"viet": "Trước đây tôi nấu bằng điện, nhưng tôi đã đổi sang ga.", "eng": "I used to cook a electricity, but I've switched to gas."}, {"viet": "Tôi muốn cơ sở này phải hoạt động càng trôi chảy càng tốt.", "eng": "I want this shop to run as smoothly as possible."}, {"viet": "Tôi muốn đi chơi nhưng mẹ tôi không cho.", "eng": "I wanted to go out but my mum wouldn't let me."}, {"viet": "Tôi bị lập luận của anh ta đánh bại và phải thừa nhận thất bại.", "eng": "I was floored by his argument and had to admit defeat."}, {"viet": "Tôi được bảo hiểm thích đáng nên gặp may hơn những người khác.", "eng": "I was properly insured so I'm sitting pretty."}, {"viet": "Tôi thật không may, tôi lỡ xe buýt đúng một phút.", "eng": "I was unlucky, i missed the bus by just one minute."}, {"viet": "Tôi sẽ gặp bạn lúc hai giờ đúng.", "eng": "I will meet you at two o'clock sharp."}, {"viet": "Tôi không để cho các con tôi đi học đói bụng đâu.", "eng": "I won't have my children going to school on an empty stomach."}, {"viet": "Có lẽ anh mong rằng sẽ có sự bất đồng ý kiến lớn lao về chuyện này.", "eng": "I would expect that there would be be strong disagreement about this."}, {"viet": "Tôi muốn có những ý tưởng của cô về bài đó.", "eng": "I would like your ideas about the story."}, {"viet": "Nếu một cuốn sách khó nhai, hẳn là nó hay.", "eng": "If a book is hard going, it ought to be good."}, {"viet": "Nếu tôi được quyền lựa chọn, tôi sẽ về hưu lúc ba mươi tuổi.", "eng": "If I had the choice, I would retire at thirty."}, {"viet": "Nếu sách được bọc bìa vải, trước tiên vải được cắt ra thành từng miếng vừa với cuốn sách.", "eng": "If the book is to be bound in cloth covers, the cloth is first cut from a roll into sections that will fit the book."}, {"viet": "Nếu giữ bình tĩnh và đoàn kết với nhau, chúng ta sẽ ổn cả thôi.", "eng": "If we keep calm and stick together, we'll be all right."}, {"viet": "Nếu anh cứ tiếp tục xử sự như thế, anh sẽ bị mang tiếng.", "eng": "If you continue to behave in this way, you'll bring discredit to yourself."}, {"viet": "Nếu em cứ chần chừ thế này chúng ta sẽ trễ mất đấy.", "eng": "If you keep shilly-shallying like this we'll be late."}, {"viet": "Nếu ông muốn triệu tập một cuộc họp hay đại loại như vậy thì hãy đăng thông báo lên.", "eng": "If you want to call a meeting or anything, put up a notice."}, {"viet": "Trong một sự sốt sắng, nhiệt tình, căm thù v. v. điên cuồng.", "eng": "In a frenzy of zeal, enthusiasm, hate, etc."}, {"viet": "Thật ra, tôi tin là hàng sẽ đến chỗ các ông đúng hạn, cho dù chúng được vận chuyển bằng đường biển.", "eng": "In fact, I believe that the goods will reach you on time even if they're transported by sea."}, {"viet": "Theo ý kiến của tôi, sự cơi nới mới của viện bảo tàng là cục u xấu xí.", "eng": "In my opinion, the new museum extension is an excrescence."}, {"viet": "Trong suốt cả cuộc đời tôi, tôi đã biết nhiều thay đổi.", "eng": "In the course of my long life I've known many changes."}, {"viet": "Theo quan niệm của họ, hệ thống lợi nhuận chỉ khuyến khích sự lười nhác.", "eng": "In their view, the benefit system just encourages laziness."}, {"viet": "Thông tin về lí lịch của bị cáo.", "eng": "Information about the accused's background."}, {"viet": "Ở nước bạn, li hôn có khó không?", "eng": "Is it difficult to get a divorce in your country?"}, {"viet": "Có một nhà hàng phục vụ thức ăn tuỳ chọn ở gần đây phải không?", "eng": "Is there an all-you-can-eat restaurant around here?"}, {"viet": "Có còn tí rượu nào ( nữa ) ở hầm rượu không?", "eng": "Isn't there some ( more ) wine in the cellar?"}, {"viet": "Đánh cược con ngựa già đó chỉ tổ phí tiền!", "eng": "It's a waste of money betting on that old nag!"}, {"viet": "Chăn nuôi cừu ở đây khó sinh lợi.", "eng": "It's difficult to make sheep farming pay here."}, {"viet": "Thật là một phong tục mê tín khi anh ta không chịu đi qua dưới cái thang.", "eng": "It's just a superstition that you shouldn't walk under ladders."}, {"viet": "Không lạ gì công ti mang công mắc nợ-nó được quản lí hoàn toàn tồi.", "eng": "It's not surprising the company's in debt-it's been completely mismanaged."}, {"viet": "Chắc chắn là mai mưa.''Ồ, biết đâu đấy, có thể sẽ là một ngày đẹp trời.'.", "eng": "It's sure to rain tomorrow.''Oh, you never know, it could be a lovely day.'."}, {"viet": "Đến lượt cô phải dắt chó đi dạo-đừng có mà tìm cách lẩn tránh.", "eng": "It's your turn to take the dog for a walk-don't try to wriggle out of it."}, {"viet": "Chuyện xảy ra mà tôi không hề biết.", "eng": "It happened without my being aware of it."}, {"viet": "Thật khó tưởng tượng vẻ bề ngoài của nó nếu không thật sự thấy nó.", "eng": "It is hard to imagine the way it looks without actually seeing it."}, {"viet": "Tuy vậy, học cách sử dụng nó rất khó đấy.", "eng": "It is so hard to learn how to use it, though."}, {"viet": "Có nghĩa là báo động đã chấm dứt.", "eng": "It means the alarm is over."}, {"viet": "Thật là hân hạnh được có mặt ở đây.", "eng": "It's nice to be here."}, {"viet": "Dường như chúng ta sắp chiếm lĩnh thị trường.", "eng": "It seems that we're about to take the market by storm."}, {"viet": "Thật không thể tha thứ được khi nó dám bảo tôi là đồ nói dối trước mặt toàn khoa.", "eng": "It was a bit strong of him to call me a liar in front of the whole department."}, {"viet": "Trời bắt đầu tối, vì thế chúng tôi vội về nhà.", "eng": "It was getting dark, so we hurried home."}, {"viet": "Cuối cùng anh ta cũng đã đến vào lúc mười giờ.", "eng": "It was ten o'clock when he finally showed up."}, {"viet": "Nên lắp vòi hoa sen hơn là bồn tắm.", "eng": "It would be better to install a shower rather than a bath."}, {"viet": "Những bà mẹ Nhật Bản địu con trên lưng.", "eng": "Japanese mothers carry babies pick-a-back."}, {"viet": "Chuyến đi lại giữa London và Paris.", "eng": "Journeys to and fro between London and Paris."}, {"viet": "Có kiến thức mà không có lương tri thì cũng không có giá trị mấy.", "eng": "Knowledge without common sense counts for little."}, {"viet": "Chúng ta hãy ở lại đây thêm một lát nữa nhé.", "eng": "Let's stay here for a little while longer."}, {"viet": "Cuộc sống dường như đã mất hầu hết điều thích thú của nó đối với anh ta.", "eng": "Life seems to have lost most of its savor for him."}, {"viet": "Nhiều ngôi sao điện ảnh có biệt thự ở Hawaii.", "eng": "Many movie stars have a villa in Hawaii."}, {"viet": "Những dấu ở đầu thấp hơn cần được nâng lên cho bằng nhau.", "eng": "Marks at the lower end need to be levelled up."}, {"viet": "Tôi xin phép giới thiệu diễn giả của chúng ta buổi tối hôm nay?", "eng": "May I introduce our speaker for this evening?"}, {"viet": "Thuỷ ngân được đổ vào các con mương để mô phỏng các dòng sông đang chảy.", "eng": "Mercury was poured into ditches to simulate flowing rivers."}, {"viet": "Phần lớn những người du lịch đến Luân Đôn đều đi thăm Bảo tàng Anh.", "eng": "Most tourists in London visit the British Museum."}, {"viet": "Cuộc hẹn của tôi là 9 giờ sáng và tôi đã đến đúng giờ.", "eng": "My appointment was for 9 am and I arrived on the hour."}, {"viet": "Bố tôi vừa mới được mổ xong và họ chưa cho tôi vào thăm ông.", "eng": "My father's only just had his operation and they won't let me see him yet."}, {"viet": "Vận may của tôi đã tới-tôi vừa trúng một chiếc xe ô-tô mới trong cuộc xổ số bán hàng.", "eng": "My luck's in-I won a new car in a raffle."}, {"viet": "Chị tôi sắp có thêm một cháu nữa.", "eng": "My sister is going to have another baby."}, {"viet": "Không có ai trong hai chúng tôi hiểu được tiếng Đức cả.", "eng": "Neither one of us could understand German."}, {"viet": "Không, mình có gặp Jane đâu, Cậu nghĩ gì lạ vậy?", "eng": "No, I'm not seeing Jane, where did you get the idea?"}, {"viet": "Không một tên tuổi nào được tiết lộ trước khi người ta báo cho thân nhân họ biết.", "eng": "No names are being released until the relatives have been told."}, {"viet": "Bây giờ em có thể chọn xem em muốn ngồi dậy hay nằm xuống.", "eng": "Now I can choose each time whether I want to sit up or lie down."}, {"viet": "Tất nhiên là sau đó ông sẽ trả giá cho việc đó.", "eng": "Of course he pays for it later."}, {"viet": "Được rồi, tôi sẽ đón chuyến bay đến nơi lúc 2 giờ 30 sáng.", "eng": "OK, I'll try to get a flight that arrives at 2: 30 in the morning."}, {"viet": "Khi anh ấy lấy được can đảm, anh ta đã nói điều anh ta nghĩ về họ.", "eng": "Once he'd found his tongue he told them what he thought of them."}, {"viet": "Một tên trong bọn tội phạm đã khai báo về số còn lại của bè đảng.", "eng": "One of the criminals informed against the rest of the gang."}, {"viet": "Tính toán của chúng tôi cho thấy rằng công ty đã lãi trên 1000000 pao năm ngoái.", "eng": "Our calculations show that the firm made a profit of over 1000000 pounds last year."}, {"viet": "Vào những ngày cuối tuần, giờ làm việc của chúng tôi là từ 10 giờ đến 7 giờ.", "eng": "Our hours are from 10: 00 to 7: 00 on weekends."}, {"viet": "Công việc thăm dò của chúng tôi được trình bày dưới dạng một biểu đồ.", "eng": "Our soundings are displayed in the form of a graph."}, {"viet": "Độn vai áo vét tông để làm cho vai trông vuông vắn.", "eng": "Pad out the shoulders of a jacket to make them look square."}, {"viet": "Người ta từ khắp nơi tới để nghe nghệ sĩ viôlông nổi tiếng đó.", "eng": "People came from far and near to hear the famous violinist."}, {"viet": "Các lý thuyết triết học rất khó hiểu đối với người bình thường.", "eng": "Philosophical theories that are inaccessible to ordinary people."}, {"viet": "Ô nhiễm là một trong những vấn đề quan trọng nhất trong thế giới ngày nay.", "eng": "Pollution is one of the most important issues in the world today."}, {"viet": "Santiago de Compostela là địa điểm hành hương quan trọng trong thời đại Trung cổ.", "eng": "Santiago de Compostela was an important place of pilgrimage in the Middle Ages."}, {"viet": "Đánh bóng khoảng này để biểu hiện cái bóng người đó.", "eng": "Shade in this area to represent the person's shadow."}, {"viet": "Bà ta là một người nội trợ-khi mà bà không dạy tiếng Anh, cụ thể là như vậy.", "eng": "She's a housewife-when she's not teaching English, that is."}, {"viet": "Cô ta đang mua một món quà cho người bạn trai của cô ấy.", "eng": "She's buying a present for her boy-friend."}, {"viet": "Cô ta vừa chạy lên phố mua một ít thức ăn.", "eng": "She's just zipped into town to buy some food."}, {"viet": "Cô ta đầu óc tổ chức kém đến nỗi không bao giờ làm được cái gì đến đầu đến đũa.", "eng": "She's so disorganized she never gets anything done."}, {"viet": "Thực sự hôm nay bà ta đã hạ cố chào tôi ở ngoài phố.", "eng": "She actually condescended to say hello to me in the street today."}, {"viet": "Cô ta cuộc với tôi 20 pao rằng tôi không thể bỏ được thuốc lá.", "eng": "She bet me 20 pounds that I wouldn't be able to give up smoking."}, {"viet": "Mỗi ngày nó đi học bằng xe lửa.", "eng": "She commutes to school by train every day."}, {"viet": "Cô ta phủ nhận lời tố cáo khá sôi nổi.", "eng": "She denied the accusation with some warmth."}, {"viet": "Cô ấy làm cho những người phê bình cô ấy sửng sốt vì giành được tất cả các giải.", "eng": "She dumbfounded her critics by winning all the prizes."}, {"viet": "Cô ấy đã lục tìm trong túi xách, nhưng không tìm thấy chùm chìa khoá.", "eng": "She foraged about in her handbag, but couldn't find her keys."}, {"viet": "Năm ngoái cô ấy có hai quốc tịch và bây giờ cô ấy giữ một hộ chiếu Thuỵ Sĩ và một hộ chiếu Anh.", "eng": "She got dual citizenship last year and now holds a Swiss and a British passport."}, {"viet": "Cô ấy cả gan đòi ông ta tăng lương mới chỉ sau ba ngày làm việc.", "eng": "She had the temerity to ask for a pay increase after only three days'work."}, {"viet": "Chị ấy đã gây ra đúng là một xúc động mạnh trong giới văn học với cuốn sách đầu tay của mình.", "eng": "She has made quite a splash in literary circles with her first book."}, {"viet": "Cô ấy vô ý gọi điện thoại nhầm người.", "eng": "She inadvertently telephoned the wrong person."}, {"viet": "Cô ấy nổi tiếng giàu có.", "eng": "She is reputed to be extremely wealthy."}, {"viet": "Cô ta vồ ngay lấy cơ hội đi Mỹ.", "eng": "She leapt at the chance to go to America."}, {"viet": "Cô ấy không còn thiết sống và cứ mòn mỏi dần đi.", "eng": "She lost interest in living and just pined away."}, {"viet": "Cô ta cần phải thắng điểm này để san bằng tỷ số.", "eng": "She needs to win this point to level the score."}, {"viet": "Cô ấy chơi măng-đô-lin hay tột bậc.", "eng": "She plays the mandolin superlatively well."}, {"viet": "Cô ta kinh hãi lùi lại trước tên cầm súng.", "eng": "She recoiled from the gunman in terror."}, {"viet": "Cô ấy là người bị động kinh bẩm sinh.", "eng": "She's been an epileptic from birth."}, {"viet": "Cô ta đang học để lấy bằng tiến sĩ.", "eng": "She's studying for her doctorate."}, {"viet": "Cô ta dường như bị ( ma ) ám.", "eng": "She seemed to be possessed ( by the devil )."}, {"viet": "Cô ấy lấy dao dọc phong bì thư.", "eng": "She slit an envelope open with a knife."}, {"viet": "Bà ấy sải bước đường bệ đi qua cung điện.", "eng": "She strode majestically through the palace."}, {"viet": "Cô ta kinh hoàng giật cao hai tay lên, trước ý nghĩ đó.", "eng": "She threw up her hands in horror at the idea."}, {"viet": "Cô ta dùng chứng cớ này để hỗ trợ cho lý lẽ của cô ta.", "eng": "She used this evidence to shore up her argument."}, {"viet": "Cô ấy sợ rằng anh ta có thể bị chết đuối.", "eng": "She was afraid lest he might drown."}, {"viet": "Cô ta miễn cưỡng tin hắn.", "eng": "She was disinclined to believe him."}, {"viet": "Cô ấy vui sướng khi thấy con mình mới biết đi chập chững.", "eng": "She was joyful upon seeing her child take his first steps."}, {"viet": "Cô ta chịu trách nhiệm mua đồ trang trí cho loạt phim truyền hình.", "eng": "She was responsible for buying the properties for the television series."}, {"viet": "Cô ta không tài nào túm chặt được kẻ tấn công cô.", "eng": "She was unable to get to grips with her assailant."}, {"viet": "Cô ta đi thẳng tới cửa và gõ to.", "eng": "She went straight up to the door and knocked loudly."}, {"viet": "Cô ấy làm việc chăm chỉ để thi đua với chị mình.", "eng": "She worked hard in emulation of her elder sister."}, {"viet": "Đến những cửa hiệu tìm mua những món rẻ.", "eng": "Shopping the stores looking for bargains."}, {"viet": "Không nên lúc nào cũng coi im lặng là đồng ý.", "eng": "Silence must not always be read as consent."}, {"viet": "Sáu người phụ nữ đã bị hiếp dâm ở khu vực này mới đây.", "eng": "Six women have been sexually assaulted in the area recently."}, {"viet": "Hút thuốc có hại cho sức khỏe của bạn.", "eng": "Smoking is bad for your health."}, {"viet": "Vậy tại sao chúng ta lại nói xấu mình hoài như vậy?", "eng": "So why do we keep badmouthing ourselves all the time?"}, {"viet": "Một số lái xe cố ý tăng tốc độ khi mình được vượt họ.", "eng": "Some drivers accelerate deliberately when you're trying to overtake them."}, {"viet": "Một số người tin rằng họ có thể được đầu thai dưới dạng một con vật.", "eng": "Some people believe they may be reincarnated in the form of an animal."}, {"viet": "Thôi xong có ai đó đã tới đây ăn món cháo đặc của tôi rồi!", "eng": "Someone's been and gone and eaten my porridge!"}, {"viet": "Gõ để kiểm tra một bánh xe lửa.", "eng": "Sound the wheels of a train."}, {"viet": "Xịt dầu từ bình vào máy.", "eng": "Squirt oil out of a can into a machine."}, {"viet": "Vẫn tin là một hàng rào ngăn cách có thể tồn tại giữa lợi ích chung và riêng.", "eng": "Still believe a Chinese wall can exist between public and private selves."}, {"viet": "Rất kỳ lạ là tôi đã nói cũng điều ấy với vợ tôi chỉ mới ngày hôm qua.", "eng": "Strangely enough, I said the same thing to my wife only yesterday."}, {"viet": "Những câu trả lời như thế đã là, có lẽ vẫn còn là một hình thức bác bỏ các câu hỏi của những người da trắng.", "eng": "Such answers were, perhaps still are, a form of put-down to the question of white people."}, {"viet": "Ánh nắng mặt trời lung linh trên mặt hồ.", "eng": "Sunlight playing over the surface of the lake."}, {"viet": "T/T có nghĩa là điện chuyển tiền, M/T có nghĩa là thư chuyển tiền và D/D là hối phiếu trả ngay khi xuất trình.", "eng": "T/T means telegraphic transfer, M/T means mail transfer and D/D means demand draft."}, {"viet": "Uống thuốc viên thật dễ, chỉ việc bỏ vào miệng và nuốt thôi.", "eng": "Taking pills is easy, just put them in your mouth and swallow."}, {"viet": "Bảo ai một điều gì qua điện thoại.", "eng": "Tell somebody something over the phone."}, {"viet": "Cảm ơn ông đã cho tôi mượn cái máy xén cỏ lớn, đúng là thứ cần cho loại cỏ dài.", "eng": "Thanks for lending me your big lawn-mower, it was just the job for the long grass."}, {"viet": "Quyển truyện đó bán được một triệu bản.", "eng": "That book sold a million copies."}, {"viet": "Đó nghĩa là một cuộc kinh doanh không lãi, không lỗ.", "eng": "That is, it's a wash."}, {"viet": "Dải đất mênh mông đó là nước Nga.", "eng": "That ocean of land which is Russia."}, {"viet": "Cái kiểu váy ngắn ấy của cô ta dứt khoát là không đứng đắn rồi.", "eng": "That short skirt of hers is positively indecent."}, {"viet": "Tờ'Người bảo vệ'đang đăng một loạt bài về kinh tế của Thế giới thứ ba.", "eng": "The'Guarian'is running a series of articles on Third World Economics."}, {"viet": "Bị cáo đã bị gửi trả về trại để giam giữ một tuần.", "eng": "The accused was remanded in custody for a week."}, {"viet": "Máy bay đó vẫn ở lại trên mặt đất.", "eng": "The aircraft remained on the ground."}, {"viet": "Chuyện dị thường ở vị trí của ông ấy là ở chỗ ông ấy là Chủ tịch hội đồng mà lại không được bỏ phiếu.", "eng": "The anomaly of his position is that he is the chairman of the committee but isn't allowed to vote."}, {"viet": "Các sĩ quan quân đội làm khởi nghĩa chống lại nhà vua.", "eng": "The army officers led a revolt against the king."}, {"viet": "Khán giả ca thán về những câu pha trò dở tệ của anh ta.", "eng": "The audience groaned at his terrible jokes."}, {"viet": "Đứa bé đang được mẹ cho bú.", "eng": "The baby was being nursed at its mother's breast."}, {"viet": "Ngân hàng đó do nhà nước kiểm soát.", "eng": "The bank was controlled by the state government."}, {"viet": "Cái đẹp của phong cảnh vượt quá sự chờ đợi của tôi.", "eng": "The beauty of the scenery surpasses my expectation."}, {"viet": "Những con chim đậu trên dây điện thoại.", "eng": "The birds perched on the telephone wires."}, {"viet": "Con bu lông bị gãy và bánh xe long ra.", "eng": "The bolt sheared off and the wheel came off."}, {"viet": "Ranh giới bất định giữa yêu và ghét thường rất mong manh.", "eng": "The borderline between love and hate is often thin."}, {"viet": "Nhánh cây trĩu xuống dưới sức nặng của anh ta.", "eng": "The branch began to give under his weight."}, {"viet": "Toà nhà trông giống nhà tù ở vẻ bề ngoài.", "eng": "The building was like a prison in appearance."}, {"viet": "Chiếc bánh ngọt này có mặt xốp đẹp.", "eng": "The cake has a nice light texture."}, {"viet": "Chiếc ôtô đã được hàn một cái chắn bùn mới.", "eng": "The car has had a new wing welded on."}, {"viet": "Chiếc xe ngựa đi qua cổng lâu đài.", "eng": "The carriage passed through the palace gates."}, {"viet": "Ngũ cốc và đường ở trên bàn đấy.", "eng": "The cereal and sugar are on the table."}, {"viet": "Séc phải được kí trước mặt thủ quĩ ở ngân hàng.", "eng": "The cheques must be signed in front of the cashier at the bank."}, {"viet": "Đứa trẻ ngơ ngác trước tiếng ồn và đám đông.", "eng": "The child was bewildered by the noise and the crowds."}, {"viet": "Bọn trẻ đã xáo trộn lung tung trong phòng khách.", "eng": "The children have made an awful mess in the lounge."}, {"viet": "Trẻ em đang chơi gần bờ sông thì một đứa trượt chân và ngã xuống sông.", "eng": "The children were playing by the river when one of them slipped and fell in."}, {"viet": "Rượu vang đỏ này có chất lượng hiếm.", "eng": "The claret was of a rare vintage."}, {"viet": "Chiếc xe ngựa có gắn phù hiệu hoàng gia.", "eng": "The coach bears the royal coat of arms."}, {"viet": "Những khuôn sáo đáng ca ngợi của chính quyền.", "eng": "The commendable incantations of the administration."}, {"viet": "Công ty tổ chức hội nghị người bán hàng mỗi năm.", "eng": "The company hold an annual dealer convention."}, {"viet": "Hình dạng của bề mặt trái đất.", "eng": "The configuration of the earth's surface."}, {"viet": "Cái bếp lò này sẽ không hợp với căn bếp mới của chị.", "eng": "The cooker won't fit in your new kitchen."}, {"viet": "Đất nước chia thành những quận huyện bằng nhau.", "eng": "The country was carved into equal districts."}, {"viet": "Những tội ác xảy ra ở đó đã làm cho nơi này có vẻ bí ẩn và u ám.", "eng": "The crimes committed there invested the place with an air of mystery and gloom."}, {"viet": "Thủ phạm sẽ bị đánh bằng roi khi hắn bị phát hiện.", "eng": "The culprit will be whipped when he is found."}, {"viet": "Những hốc tăm tối bí mật trong một cái hang.", "eng": "The dark recesses of a cave."}, {"viet": "Phái đoàn đó đã hoàn tất, thành công nhiệm vụ của mình.", "eng": "The delegation completed its mission successfully."}, {"viet": "Biểu đồ ở Trang 5 ( ở chương sau, đoạn sau ).", "eng": "The diagram on Page 5 ( in the next chapter, paragraph )."}, {"viet": "Nhân viên thông tin giữ liên lạc với các máy bay trên không và với các sân bay khác phục vụ hàng không.", "eng": "The dispatch staff maintains contact with planes in the air and with other airports that serve the airline."}, {"viet": "Bác sĩ nói rằng tôi nên đi lại để sớm phục hồi.", "eng": "The doctor told me I'd be up and about again very soon."}, {"viet": "Con chó vẫy đuôi mừng rỡ.", "eng": "The dog wagged its tail excitedly."}, {"viet": "Người tài xế bấm còi để xua con cừu trên đường.", "eng": "The driver hooted at the sheep in the road."}, {"viet": "Tình trạng kinh tế của đất nước thật thảm hại.", "eng": "The economic position of the country is disastrous."}, {"viet": "Quân địch đã rút lui khi quân ta tiến lên.", "eng": "The enemy fell back as our troops advanced."}, {"viet": "Bản luận văn này dài quá, anh cần cắt bớt đi.", "eng": "The essay's too long, you need to prune it down."}, {"viet": "Kinh nghiệm đó làm cho tôi ghét cay ghét đắng chó.", "eng": "The experience left me with an abiding hatred of dogs."}, {"viet": "Cái điệp khúc ngáy quen thuộc từ ông chồng của bà ta.", "eng": "The familiar refrain of her husband's snoring."}, {"viet": "Sự màu mỡ của đất đã được cải thiện rất nhiều nhờ việc dùng thuốc trừ sâu.", "eng": "The fertility of the soil has been greatly improved by the use of pesticides."}, {"viet": "Phim đó không đáng xem.", "eng": "The film was undeserving of serious consideration."}, {"viet": "Hãng đã sản xuất một băng viđêô quảng cáo ngắn.", "eng": "The firm produced a short promotional video."}, {"viet": "Năm cuộc thí nghiệm đem lại những kết quả hoàn toàn khác hẳn nhau.", "eng": "The five experiments gave quite disparate results."}, {"viet": "Lực ma sát ảnh hưởng đến tốc độ con tàu vũ trụ khi nó có thể quay trở lại bầu khí quyển trái đất.", "eng": "The force of friction affects the speed of which spacecraft can re-enter the earth's atmosphere."}, {"viet": "Bánh mì chiên giống như bánh cam vòng vậy.", "eng": "The fry bread is like a doughnut."}, {"viet": "Khí thắp được trữ trong thùng chứa.", "eng": "The gas is store under pressure in the tank."}, {"viet": "Ánh sáng lấp lánh của những đồ trang trí trên cây Giáng sinh.", "eng": "The glitter of decorations on Christmas tree."}, {"viet": "Chính phủ tin ở tầm quan trọng của giáo dục.", "eng": "The government believe in the importance of education."}, {"viet": "Chính phủ đang cố gắng chặn dòng người tỵ nạn đổ vào đất nước ngày càng tăng.", "eng": "The government is trying to stop the increasing flow of refugees entering the country."}, {"viet": "Cỏ đã mọc cao đến thắt lưng.", "eng": "The grass had grown waist-high."}, {"viet": "Tờ người bảo vệ đang đăng một loạt các bài về Kinh tế Thế giới Thứ Ba.", "eng": "The Guardian is running a series of articles on Third World Economics."}, {"viet": "Quần đảo Hawai không còn là nước phụ thuộc của Mỹ nữa.", "eng": "The Hawaiian Islands are no longer a dependency of the USA."}, {"viet": "Bức tường cao được xây để làm hàng rào bảo vệ chống lại những kẻ đột nhập.", "eng": "The high wall was built as a defence against intruders."}, {"viet": "Các con tin bị sỉ vả tứ phía trên đường đi tới sân bay.", "eng": "The hostages ran the gauntlet of insult on their way to the airport."}, {"viet": "Căn nhà rất mục nát nhưng có thể sửa sang được.", "eng": "The house is very dilapidated but it has possibilities."}, {"viet": "Mục tiêu của trò chơi là đưa toàn bộ quân cờ của bạn sang phía bên kia của bàn cờ.", "eng": "The idea of the game is to get all your pieces to the other side of the board."}, {"viet": "Sự tung gián điệp vào một vùng.", "eng": "The infiltration of spies into an area."}, {"viet": "Sự áp dụng lần đầu tiên các phương pháp chế tạo mới.", "eng": "The introduction of new manufacturing methods."}, {"viet": "Nhà báo có vẻ ngờ vực khi anh ta nghe câu chuyện của cô ấy.", "eng": "The journalist looked doubtful when he heard her story."}, {"viet": "Bọn bắt cóc ép gia đình đó nộp một số tiền chuộc 10.000 bảng Anh.", "eng": "The kidnappers exacted a ransom of £ 10,000 from the family."}, {"viet": "Đám đông chen nhau qua cổng sau trận đấu bóng.", "eng": "The large crowd funnelled out of the gates after the football match."}, {"viet": "Các nhà lãnh đạo họp nhau ở Paris để họp.", "eng": "The leaders assembled in Paris for a meeting."}, {"viet": "Chiếc thang máy này vận hành không trơn tru.", "eng": "The lift was not operating properly."}, {"viet": "Cuộc đi xe đạp dài làm cô ta kiệt sức.", "eng": "The long cycle ride exhausted her."}, {"viet": "Tờ tạp chí đó đang cố có thêm nhiều bạn đọc đặt mua báo dài hạn.", "eng": "The magazine is trying to get more readers to subscribe."}, {"viet": "Ông giám đốc cho nhân viên nghỉ một ngày.", "eng": "The manager gave the staff the day off."}, {"viet": "Thị Trưởng bước vào, đi trước là các thành viên trong hội đồng.", "eng": "The Mayor entered, preceded by members of the council."}, {"viet": "Các trận đơn nam trong cuộc đấu gôn.", "eng": "The men's singles in the golf tournament."}, {"viet": "Ông bộ trưởng đã bị báo chí đả kích gay gắt về những khoản cắt giảm.", "eng": "The minister was slammed by the press for the cuts."}, {"viet": "Quỹ đạo của mặt trăng quay quanh quả đất.", "eng": "The moon's path round the earth."}, {"viet": "Phong trào đòi thay đổi điều lệ của công đoàn đang dần dần có đà.", "eng": "The movement to change the union's constitution is slowly gathering momentum."}, {"viet": "Sự cần thiết phải tìm ra một giải pháp đã kích thích anh ta tiếp tục.", "eng": "The need to find a solution urged him on."}, {"viet": "Luật mới gây bất lợi cho những người nghèo nhất trong xã hội.", "eng": "The new law penalizes the poorest members of society."}, {"viet": "Những luật thuế mới ảnh hưởng đến phần lớn dân chúng.", "eng": "The new tax laws affect most people."}, {"viet": "Việc phát bưu thư tới sẽ vào lúc 2 giờ.", "eng": "The next postal delivery id at 2 o'clock."}, {"viet": "Số trẻ em ở trường đã giảm năm nay.", "eng": "The number of children in the school has decreased this year."}, {"viet": "Người sĩ quan đi phép đã trở lại đơn vị vào tối chủ nhật.", "eng": "The officer reported back from leave on Sun day night."}, {"viet": "Mụ già đưa ra lời nguyền đối với nàng công chúa xinh đẹp trong chuyện.", "eng": "The old woman put a curse on the beautiful princess in the story."}, {"viet": "Bản thảo gốc đã bị thất lạc, đây là bản sao.", "eng": "The original manuscript has been lost, this is a copy."}, {"viet": "Chiếc chảo phải để khô hoàn toàn trước khi anh đem cất nó đi.", "eng": "The pan must be dried well before you put it away."}, {"viet": "Con đường chạy dốc ngược lên đồi, rồi bằng phẳng trở lại.", "eng": "The path ran steeply up the hill and then evened out."}, {"viet": "Dân chúng đã nổi dậy chống lại nhà độc tài.", "eng": "The people revolted against the military dictator."}, {"viet": "Cần gắn kim máy quay đĩa.", "eng": "The pick-up arm of a record-player."}, {"viet": "Kế hoạch phụ thuộc vào sự phối hợp thời gian thật chính xác.", "eng": "The plan depends on split-second timing."}, {"viet": "Vở kịch đó, đã có thời gian có vẻ rất hợp thời, nay trở nên lỗi thời rồi.", "eng": "The play, which once seemed so modern, has become a period piece."}, {"viet": "Bộ lông trắng của gấu Bắc cực là một thứ nguỵ trang tự nhiên.", "eng": "The polar bear's white fur is a natural camouflage."}, {"viet": "Cảnh sát đã không bắt giữ một ai.", "eng": "The police have not made any arrests."}, {"viet": "Viên cảnh sát đã để tôi đi sau một hồi lên lớp dài dòng về việc chạy quá tốc độ.", "eng": "The policeman let me off with a lecture about speeding."}, {"viet": "Chiếc cột được chôn chặt xuống đất.", "eng": "The post is fast in the ground."}, {"viet": "Những cố vấn về chính sách đối ngoại của Tổng thống được triệu tập trong một cuộc họp khẩn cấp.", "eng": "The President's foreign policy advisers convened for an emergency session."}, {"viet": "Giá là 800 bảng Anh, tính cả thuế.", "eng": "The price is £ 800, inclusive of tax."}, {"viet": "Tù nhân trốn thoát khỏi lính gác.", "eng": "The prisoner broke away from his guards."}, {"viet": "Sự cảm ơn không tiếc lời của anh ấy làm bối rối.", "eng": "The profuseness of his thanks was embarrassing."}, {"viet": "Sự phát triển tâm lý của trẻ em.", "eng": "The psychological development of a child."}, {"viet": "Nữ hoàng đang thăm viếng Canada với tư cách cá nhân.", "eng": "The queen is making a private visit to Canada."}, {"viet": "Những lời chọc cười dồn dập của một nghệ sĩ hài.", "eng": "The rapid-fire jokes of a comedian."}, {"viet": "Trọng tài ra lệnh cho Johnson phải rời sân vào nửa hiệp nhì vì phạm lỗi đá một cầu thủ khác.", "eng": "The referee ordered Johnson off in the second half for kicking another player."}, {"viet": "Nhân viên cấp cứu tới chỗ anh ấy vừa kịp lúc.", "eng": "The rescuers reached him just in time."}, {"viet": "Ông chú giàu có mà nó thường khoe khoang thật ra chỉ là một con người tưởng tượng.", "eng": "The rich uncle of whom he boasts is only a myth."}, {"viet": "Con đường thẳng ra sau một loạt những khúc quanh.", "eng": "The road straightens out after a series of bends."}, {"viet": "Các rễ cây ăn xuống một đoạn sâu.", "eng": "The roots go a long way down."}, {"viet": "Cánh cối xay gió đang quay.", "eng": "The sails of the windmill were wheeling round."}, {"viet": "Chương trình xây dựng trường học mặc nhiên công nhận việc tăng cường đầu tư cho giáo dục.", "eng": "The school building programme postulates an increase in educational investment."}, {"viet": "Ông Bộ trưởng ngoại giao hiện đang cứu xét lời đề xuất đó.", "eng": "The Secretary of State is presently considering the proposal."}, {"viet": "Tiếng nổ đanh của một khẩu súng lục, pháo hoa, v. v.", "eng": "The sharp report of a pistol, firework, etc."}, {"viet": "Con tàu đó đã chìm trong chuyến du hành đầu tiên của nó.", "eng": "The ship went under on its first voyage."}, {"viet": "Cảnh tượng nhiều đứa trẻ đói ăn làm cho anh ấy thấy nghẹn ngào.", "eng": "The sight of so many staving children made his gorge rise."}, {"viet": "Những người nô lệ nổi dậy chống lại chủ của họ.", "eng": "The slaves rebelled against their masters."}, {"viet": "Lính ngăn đường trong thành phố.", "eng": "The soldiers barred the road to the city."}, {"viet": "Những người ủng hộ thuyết trình viên đã được gài vào khán giả và vỗ tay rất to.", "eng": "The speaker's supporters were planted in the audience and applauded loudly."}, {"viet": "Cái cọc đã bị vót thành một mũi nhọn ghê người.", "eng": "The stake had been sharpened to a vicious-looking point."}, {"viet": "Cơn bão đã phá huỷ cả một vạt rừng.", "eng": "The storm cut a swathe through the forest."}, {"viet": "Các sinh viên say mê với những ý tưởng của ông ấy.", "eng": "The students were fascinated by his ideas."}, {"viet": "Bề mặt mặt trăng lỗ chỗ những miệng núi lửa.", "eng": "The surface of the moon is pitted with craters."}, {"viet": "Thầy giáo đã ghi tên cho cậu ấy dự thi.", "eng": "The teacher entered him for the examination."}, {"viet": "Số điện thoại bạn cần đang bận, xin gọi lại vài phút sau.", "eng": "The telephone number you want is engaged, try again in a few minutes."}, {"viet": "Tên trộm bị ngăn không đột nhập được vào nhà.", "eng": "The thief was foiled in his attempt to enter the house."}, {"viet": "Sự tổn thất là 300 người chết hoặc mất tích.", "eng": "The toll was 300 persons dead or missing."}, {"viet": "Đoàn tàu chạy chậm lại ( như bò ra ) khi tới gần ga.", "eng": "The train slowed ( to a crawl ) as it approached the station."}, {"viet": "Chuyện rắc rối bắt nguồn từ sự thiếu cẩn thận.", "eng": "The trouble has sprung from carelessness."}, {"viet": "Hai phòng mở thông nhau.", "eng": "The two rooms open into one another."}, {"viet": "Cái mùi khó chịu làm cô ấy phát ốm đến nỗi cô ấy bắt đầu nôn.", "eng": "The unpleasant smell made her feel so sick that she began to vomit."}, {"viet": "Các quan điểm của các nhà lãnh đạo đảng kết hợp với nhau hình thành một chính sách nhất quán.", "eng": "The views of party leaders coalesced to form a coherent policy."}, {"viet": "Máy giặt lại bị trục trặc rồi.", "eng": "The washing machine's on the blink again."}, {"viet": "Toàn bộ diễn biến của cuốn sách xảy ra trong một ngày.", "eng": "The whole action of the book takes place in one day."}, {"viet": "Rượu vang đã được pha nước cho loãng đi để trẻ con uống.", "eng": "The wine was watered down for the children."}, {"viet": "Công nhân chiếm giữ nhà máy và không chịu đi.", "eng": "The workers occupied the factory and refused to leave."}, {"viet": "Những vở kịch được chuyển thành phim điện ảnh.", "eng": "Theater pieces transferred to celluloid."}, {"viet": "Phòng thí nghiệm của họ là một căn lều dột nát.", "eng": "Their laboratory was a leaky shack."}, {"viet": "Vậy chúng ta hãy kết thúc ở đây nhé.", "eng": "Then, let's call it a day."}, {"viet": "CÓ ĐIỆN THOẠI CHO ANH ĐÂY.", "eng": "THERE'S A CALL FOR YOU."}, {"viet": "Đã từng có giở cái trò khỉ ra ở đây!", "eng": "There's been some monkey business going on here!"}, {"viet": "Có thứ nước gì nhớp nháp trên nền nhà bếp.", "eng": "There's some sort of sticky fluid on the kitchen floor."}, {"viet": "Có nhiều loại khoá học khác nhau.", "eng": "There are many different types of courses."}, {"viet": "Có ba ứng cử viên ra ứng cử trong phường này.", "eng": "There are three candidates standing for election in this ward."}, {"viet": "Trong cuộc tranh cãi này, có quá nhiều lời nói bóng nói gió khó chịu mà chẳng đưa ra được bao nhiêu sự thực.", "eng": "There have been too many unpleasant innuendoes in this debate and not enough facts."}, {"viet": "Có mùi hôi thối kinh khủng bốc lên từ thùng đựng rác.", "eng": "There is an awful whiff coming from the dustbin."}, {"viet": "Chân cô ấy hãy còn yếu, nhưng tình hình chung là tốt.", "eng": "There is still some weakness in the legs, but her general condition is good."}, {"viet": "Có ánh nhìn phản kháng trong mắt Rosie.", "eng": "There was a mutinous look in Rosie's eyes."}, {"viet": "Trên tàu đông nghịt tôi không thể thở được.", "eng": "There was such a crush on the train that I could hardly breathe."}, {"viet": "Sẽ không có vấn đề một ai đó bị dư thừa.", "eng": "There will be no question of anyone being made redundant."}, {"viet": "Dẫu sao những cái máy cải tiến nhỏ này không chạy tốt lắm.", "eng": "These gadgets don't work so well anyway."}, {"viet": "Những chiếc bánh ngọt nhỏ có gia vị này là một đặc sản của địa phương.", "eng": "These small spiced cakes are a peculiarity of the region."}, {"viet": "Họ đã bổ nhiệm người giỏi nhất của họ cho công việc này.", "eng": "They've assigned their best man to the job."}, {"viet": "Họ đang bắt đầu có phát hiện quan trọng trong cuộc chiến chống ung thư.", "eng": "They are beginning to break through in the fight against cancer."}, {"viet": "Họ tin là cái đó được tạo ra hoàn toàn bằng ma thuật.", "eng": "They believe that it was all done by magic."}, {"viet": "Họ đã không thể đoán trước mọi việc sẽ diễn ra như thế nào.", "eng": "They could not have foreseen how things would turn out."}, {"viet": "Họ tự trang bị lấy cho chuyến đi thám sát.", "eng": "They equipped themselves for the expedition."}, {"viet": "Họ phải lọc nước để có thể uống.", "eng": "They had to distill the water to make it suitable for drinking."}, {"viet": "Họ biết rằng họ phải cố gắng lắm mới đạt tới số điểm khó lòng vượt qua đối thủ.", "eng": "They knew that they will have to try hard to reach the formidable score of their opponents."}, {"viet": "Chúng có thể bị đỗ xuống bất cứ lúc nào.", "eng": "They might fall down at anytime."}, {"viet": "Họ ghi tên anh vào đội bóng đá.", "eng": "They put him down for the football team."}, {"viet": "Họ phục vụ dưa muối với cơm và cà ri.", "eng": "They served mixed pickle, with rice and curry."}, {"viet": "Họ cố gắng ngầm phá buổi liên hoan của tôi bằng cách uống say bí tỉ.", "eng": "They tried to sabotage my party by getting drunk."}, {"viet": "Họ đã ăn ở với nhau ba năm trước khi kết hôn.", "eng": "They were cohabiting for three years before their marriage."}, {"viet": "Chúng sẽ giống như hình kim tự tháp kép.", "eng": "They will be like double pyramids."}, {"viet": "Bài viết này thiếu tính liên tục, người viết nhảy từ chủ đề này sang chủ đề khác.", "eng": "This article lacks continuity, the writer keeps jumping from one subject to another."}, {"viet": "Bản hợp đồng này không đáng giá tờ giấy để viết nó.", "eng": "This contract isn't worth the paper it's written on."}, {"viet": "Ngọn lửa này có vẻ không toả ra nhiều nhiệt.", "eng": "This fire doesn't seem to be giving off much heat."}, {"viet": "Thế này thì không thể chịu đựng được: tôi đã phải đợi đến ba tiếng đồng hồ!", "eng": "This is intolerable: I've been kept waiting for three hours!"}, {"viet": "Công việc này đặt ra nhiều khó khăn cho người mới tuyển dụng.", "eng": "This job presents many difficulties to the new recruit."}, {"viet": "Cuốn tiểu thuyết này là cái mốc trong văn học hiện đại.", "eng": "This novel is a landmark in modern literature."}, {"viet": "Buổi biểu diễn hoà nhạc này giống như buổi hoà nhạc năm ngoái của ông ta.", "eng": "This recital compares with the one he gave last year."}, {"viet": "Sự tiến triển đáng ngạc nhiên này đã thực sự làm tôi sửng sốt.", "eng": "This surprising development quite shook me."}, {"viet": "Lũ con trai này lại giở trò nghịch ngợm, chúng đổ nước ra khắp sàn.", "eng": "Those boys have been up to mischief again, they've put water all over the floor."}, {"viet": "Bài học hôm nay là rút ra từ Phúc âm Thánh Mác.", "eng": "Today's lesson is taken from the St Mark's Gospel."}, {"viet": "Trên các con đường vào thành phố, xe cộ qua lại ngày càng nhiều hơn.", "eng": "Traffic is building up on roads into the city."}, {"viet": "Nhiều đề nghị đã được đưa ra để tăng số lượng bán.", "eng": "Various proposals were put forward for increasing sales."}, {"viet": "Nước lõm bõm trong khoang thuyền.", "eng": "Water was slopping around in the bottom of the boat."}, {"viet": "Chúng tôi sẽ xịt chất làm thơm phòng để loại bỏ mùi đó.", "eng": "We'll spray air-freshener to get rid of it."}, {"viet": "Chúng ta đang ở giai đoạn cuối cùng cho nên đừng lơi lỏng!", "eng": "We're on the last lap, so don't slacken!"}, {"viet": "Chúng ta phải lên xe lửa ở thềm ga số 3.", "eng": "We've got to get on board from Platform 3."}, {"viet": "Chúng tôi cũng phục vụ món ngỗng đỏ son, ngỗng quay, thịt gà luộc mềm, thịt gà xắt lát ăn với gan gà và giăm bông, còn có cá trắm cỏ hấp và cá mò hấp nếu ông thích ăn cá.", "eng": "We also serve Carmine Goose, Roast Goose, Soft-Boiled Chicken, Sliced Chicken with Chicken Liver and Ham, Steamed Grass Carp and Steamed Mandarin Fish, if you like fish."}, {"viet": "Chúng tôi xin lỗi vì tàu của quý vị đến muộn.", "eng": "We are sorry for the late arrival of your train."}, {"viet": "Chúng tôi không thể bắt được kênh 4 trên máy thu hình.", "eng": "We can't get Channel 4 on our television."}, {"viet": "Đối với dịch vụ cấp tốc, chúng tôi tính thêm 50%.", "eng": "We charge 50 percent more for the express."}, {"viet": "Chúng ta không cho phép hút thuốc ở cơ quan.", "eng": "We do not permit smoking in the office."}, {"viet": "Chúng tôi thấy mình ở giữa cuộc nội chiến.", "eng": "We found ourselves slap-bang in the middle of civil war."}, {"viet": "Chúng tôi đã phải đào ô tô ra khỏi vùng tuyết.", "eng": "We had to dig the car out of a snow drift."}, {"viet": "Chúng tôi trả trước một phần tiền chiếc máy giặt.", "eng": "We have made a down payment on a washing machine."}, {"viet": "Chúng tôi hy vọng cách cư xử của anh ấy sẽ khác đi.", "eng": "We hopped his behavior would be otherwise."}, {"viet": "Chúng tôi đã tìm khắp nơi những không thể tìm ra nó.", "eng": "We looked everywhere but we couldn't find it."}, {"viet": "Ta phải dự trữ một ít nến trước khi tắt điện.", "eng": "We must lay in some candle before power cuts."}, {"viet": "Chúng tôi đặt giá ngôi nhà ấy với ông ta là 35.000 pao.", "eng": "We offered him the house for 35.000 pounds."}, {"viet": "Chúng tôi rất tiếc là với giá này thì chúng tôi không thể đặt hàng được.", "eng": "We regret that at these prices we cannot place an order."}, {"viet": "Chúng tôi góp ý kiến lẫn nhau ngay cuộc họp đầu tiên.", "eng": "We sized each other up at our first meeting."}, {"viet": "Chúng tôi thường đi mua sắm vào ngày nghỉ cuối tuần.", "eng": "We usually do our shopping at the weekend."}, {"viet": "Chúng tôi xúc động sâu sắc trước tin cô ấy từ trần.", "eng": "We were deeply affected by the news of her death."}, {"viet": "Chúng ta sẽ có một cuộc họp lúc năm giờ đúng, vì vậy mọi người sẽ có mặt ở đây đúng giờ nhé!", "eng": "We will have a meeting at five o'clock sharp, so everyone be here on time!"}, {"viet": "Nào các cậu, chúng ta sẽ làm gì hôm nay đây?", "eng": "Well, folks, what are we going to do today?"}, {"viet": "À ngân hàng đầu tiên một phần được sở hữu và điều khiển bởi một chính quyền nhà nước thiết lập ở Vience vào năm 1587.", "eng": "Well, the first bank that was partially owned and controlled by a state government was established in Venice in 1587."}, {"viet": "Nơi kế tiếp đáng quan tâm mà chúng ta sẽ đến là nơi nào vậy?", "eng": "What's the next place of interest we'll visit?"}, {"viet": "Những lí lẽ ủng hộ và phản đối việc nuôi thú cưng là gì?", "eng": "What are the pros and cons of having a pet?"}, {"viet": "Anh biết gì về tàu sân bay?", "eng": "What do you know about aircraft carriers?"}, {"viet": "Điều gây ấn tượng trong tôi là nhiệt tình của họ đối với công việc.", "eng": "What I was struck by their enthusiasm for the work."}, {"viet": "Thức ăn lạ nhất bạn đã ăn là gì?", "eng": "What is the strangest food you have eaten?"}, {"viet": "Tiền mà tôi có sẽ là của em khi tôi chết.", "eng": "What money I have will be yours when I die."}, {"viet": "Anh đoán thử mấy giờ rồi?", "eng": "What time do you make it?"}, {"viet": "Khi nào tôi có thể ký hợp đồng cho thuê?", "eng": "When can I sign the lease?"}, {"viet": "Khi nào tôi nói, các em có thể bắt đầu làm bài thi.", "eng": "When I give the word, you may start the exam."}, {"viet": "Khi người ả-rập dừng lại để lấy túi sữa ra uống, thì túi sữa không còn ngọt nữa và cũng không còn là chất lỏng.", "eng": "When the Arab stopped to drink from the pouch, the milk was no longer sweet nor was it liquid."}, {"viet": "Khi chúng tôi nói với cô bé là cô ta không thể đi với chúng tôi được thì cô ta bỏ đi và dỗi ở trong phòng.", "eng": "When we told her she couldn't come with us, she went and sulked in her room."}, {"viet": "Vui lòng cho tôi hỏi tôi có thể gửi bức thư này ở đâu?", "eng": "Where do I mail this letter, please?"}, {"viet": "Bạn thích kiểu vườn nào hơn, vườn kiểu Nhật hay vườn kiểu phương Tây?", "eng": "Which do you prefer, Japanese style gardens or Western style gardens?"}, {"viet": "Trong khi cô bé chơi, thì ba mẹ làm việc.", "eng": "While the child played, her mother worked."}, {"viet": "Ai đã phạm vào việc cơi nới tồi tệ ở phía trước toà nhà thế?", "eng": "Who perpetrated that dreadful extension to the front of the building?"}, {"viet": "Tại sao không tống khứ cái xe cũ ấy đi và kiếm cái nào dễ đỗ hơn?", "eng": "Why don't you get rid of that old ark and get something that's easier to park?"}, {"viet": "Liệu có bao giờ nhân dân chống lại tên độc tài đó không?", "eng": "Will the people ever react against this dictator?"}, {"viet": "Anh đợi tôi được chứ Một lát thôi tôi sẽ có mặt.", "eng": "Will you wait for me I shan't be a minute."}, {"viet": "Với sự xuất hiện của đường sắt, những thị trường mới đã mở cửa.", "eng": "With the coming of railways, new market opened up."}, {"viet": "Khi biết rằng tôi đang nghĩ đến chuyện từ chức, anh có ngạc nhiên không?", "eng": "Would it surprise you to know that I'm thinking of resigning?"}, {"viet": "Ông có muốn chờ máy không?", "eng": "Would you like to hold on?"}, {"viet": "Anh đẩy cái xe cút kít hơn hay là kéo nó?", "eng": "Would you rather push the barrow or pull it?"}, {"viet": "Tôi đã đặt trước một bàn dành cho hai người vào lúc 7 giờ 30 tối nay.", "eng": "Yes, I've booked a table for two for 7: 30 this evening."}, {"viet": "Hôm qua, anh gặp lại một người bạn học cùng lớp thời tiểu học.", "eng": "Yesterday, I met one of my elementary school classmates by chance."}, {"viet": "Anh chỉ làm một việc tốn công vô ích nếu anh định làm cô ấy thay đổi ý kiến của mình về vấn đề đó.", "eng": "You'll just be flogging a dead horse if you try to make her change her mind about it."}, {"viet": "Anh rất không đủ sức khoẻ, anh nên tập chạy.", "eng": "You're very unfit, you ought to take up running."}, {"viet": "Anh cứ việc lấy bất cứ cuốn sách nào mà anh muốn mượn.", "eng": "You are welcome to any books you would like to borrow."}, {"viet": "Ông chỉ được phép vào nếu có hộ chiếu và vé.", "eng": "You can be admitted drily with a passport and a ticket."}, {"viet": "Anh có nói mãi cũng không bao giờ làm tôi thay đổi ý kiến.", "eng": "You can talk till the cows come home, you'll never make me change my mind."}, {"viet": "Anh cứ vẽ người còn lũ trẻ sẽ tô màu.", "eng": "You draw the people and the children can fill them in."}, {"viet": "Anh chưa thạo sang số chiếc ô tô này.", "eng": "You haven't got the feel of the gears in this car yet."}, {"viet": "Ý anh là tôi sẽ mất tất cả tiền lãi phải không?", "eng": "You mean I would lose all my interest?"}, {"viet": "Anh phải khoá nguồn cung cấp hơi đốt nếu có chỗ rò rỉ.", "eng": "You must shut the gas supply off if there's a leak."}, {"viet": "Bạn thấy không, tôi có ba bài luận phải làm.", "eng": "You see, I've got three essays to do."}, {"viet": "Anh không nên tin vào điều đó-chỉ là tin đồn thôi.", "eng": "You shouldn't believe that-it's just hearsay."}, {"viet": "Ông sẽ thấy khó mà buộc hắn đưa ra 1 cái giá.", "eng": "You will find it difficult to pin him down to a price."}, {"viet": "Hãng chuyên chở cho ông trong chuyến bay này là công ty Hàng không Anh quốc.", "eng": "Your carrier for this flight is British Airways."}, {"viet": "Phòng đặt trước của ông là cho 3 ngày.", "eng": "Your reservation is for three days."}]