[{"viet": "Một luồng khí áp thấp đang di chuyển qua đất nước.", "eng": "A band of low pressure is moving across the country."}, {"viet": "Một buổi lễ trở nên trang nghiêm do sự hiện diện của vị đại sứ.", "eng": "A ceremony dignified by the presence of the ambassador."}, {"viet": "Một công ty không bao giờ mong đợi là có thể bị thách thức về sở trường của nó trong việc phát triển phần mềm vi tính.", "eng": "A company that never expected to be challenged on its home ground of software development."}, {"viet": "Đám đông nhanh chóng tụ tập lại xung quanh diễn giả.", "eng": "A crowd quickly congregated round the speaker."}, {"viet": "Dĩa thịt có phủ khoai tây nghiền lên trên.", "eng": "A dish of meat topped with mashed potato."}, {"viet": "Một vài cốc rượu đã làm mất đi tính dè dặt của anh ta.", "eng": "A few drinks broke through his reserve."}, {"viet": "Một con cáo phóng ra từ giữa bụi rậm.", "eng": "A fox darted out of the midst of the thicket."}, {"viet": "Rượu ngon có thể làm cho bữa ăn ngon miệng.", "eng": "A good wine can make a meal."}, {"viet": "Một cành non tốt sẽ tạo nên một cành ghép chắc.", "eng": "A healthy shoot should form a strong graft."}, {"viet": "Một sự ách tắc ở bộ phận phân phối.", "eng": "A jam in the dispatch department."}, {"viet": "Một lãnh tụ tỏ ra hào hiệp trong chiến thắng.", "eng": "A leader who was magnanimous in victory."}, {"viet": "Nhiều người thích từ người Mỹ bản địa hơn.", "eng": "A lot of people prefer the term Native American."}, {"viet": "Một cuộc thi đấu giữa Rangers và các đối thủ chính của họ là người Xen-tơ.", "eng": "A match between Rangers and their arch-rivals Celtic."}, {"viet": "Con la là con vật lai giữa lừa đực và ngựa cái.", "eng": "A mule is a hybrid of a male donkey and a female horse."}, {"viet": "Một cuốn tiểu thuyết rất phù hợp để chuyển thành kịch bản cho truyền hình.", "eng": "A novel which lends well to dramatization for television."}, {"viet": "Một chiến dịch hiểm độc bôi nhọ tên tuổi của ông ta.", "eng": "A pernicious campaign to blacken his character."}, {"viet": "Một viên cảnh sát mặc thường phục theo dõi tên tội phạm suốt cả ngày.", "eng": "A policeman in plain clothes shadowed the criminal all day."}, {"viet": "Một mỏm đá nhô ra trên mặt vách đá.", "eng": "A projection of rock on a cliff-face."}, {"viet": "Một bản tường trình về nạn nghiện ma tuý.", "eng": "A report that concerns drug abuse."}, {"viet": "Một viên ngọc saphia được gắn vào chân nhẫn bằng bạch kim.", "eng": "A sapphire in a platinum setting."}, {"viet": "Một chiếc tàu thủy có trọng tải 10.000 tấn.", "eng": "A ship with a displacement of 10,000 tons."}, {"viet": "Một sự hợm hĩnh khinh rẻ người nghèo.", "eng": "A snobbish contempt for the poor."}, {"viet": "Một bức tượng được dựng lên để tưởng niệm Nữ hoàng Victoria.", "eng": "A statue was erected to Queen Victoria."}, {"viet": "Một người đã khiến cho biết bao nhiêu biến cố gây xúc động xảy ra cùng một thời điểm.", "eng": "A synchronizer of a multitude of dramatic events."}, {"viet": "Một sự cân xứng giữa hiệu quả sử dụng và kiểu dáng thanh lịch.", "eng": "A trade-off between efficiency in use and elegance of design."}, {"viet": "Một đêm thức để cầu nguyện.", "eng": "A wakeful night spent in prayer."}, {"viet": "Một hố ngăn cách lớn giữa người giàu và kẻ nghèo trong xã hội của chúng ta.", "eng": "A yawning gap between the rich and poor in our society."}, {"viet": "Nhờ nội gián cung cấp tin, cảnh sát đã bắt được băng nhóm đó trước khi vụ cướp xảy ra.", "eng": "Acting on inside on information, the police were able to arrest the gang before the robbery occurred."}, {"viet": "Sau khi đã chụp bức hình, tấm kẽm hoặc phim được đem rửa.", "eng": "After a picture is taken, the plate or film has to be developed."}, {"viet": "Sau nhiều tháng làm việc, quyển sách mới đang dần dần thành hình.", "eng": "After months of work, the new book is gradually taking shape."}, {"viet": "Sau chiến thắng họ đã ăn mừng ồn ào suốt đêm.", "eng": "After their victory they were whooping it up all night long."}, {"viet": "Những bím tóc xinh đẹp của cô ta đã bị xén mất hết.", "eng": "All her beautiful tresses have been shorn off."}, {"viet": "Tất cả những bất lợi mà không có lợi ích nào bù đắp lại.", "eng": "All the disadvantages without any of the countervailing advantages."}, {"viet": "Mặc dù trong suốt mùa xuân và mùa hạ, ngày dài hơn đêm, nhưng tất cả không có cùng độ dài như nhau.", "eng": "Although during the spring and summer days are longer than nights, they are not all the same length."}, {"viet": "Một đạo luật đã dành cho các công đoàn những đặc quyền pháp lý nhất định.", "eng": "An Act which granted the trade unions certain legal privileges."}, {"viet": "Một luật sư cố gắng mua chuộc quan tòa để có được một phán quyết linh động thuận lợi cho thân chủ của mình.", "eng": "An attorney who tried to oil the judge's hand in order to obtain a directed verdict favourable to his client."}, {"viet": "Một khoá học lấy bằng danh dự về môn văn học Pháp.", "eng": "An honours degree course in French literature."}, {"viet": "Một cao thủ về chính trị quốc tế.", "eng": "An old hand at international politics."}, {"viet": "Các bức tranh cổ cho thấy xe ngựa do lừa kéo.", "eng": "Ancient pictures show chariots drawn by donkeys."}, {"viet": "Một phòng tắm khác cạnh phòng ngủ chính.", "eng": "Another bathroom off the main bedroom."}, {"viet": "Áp dụng những kỹ thuật hiện đại vào một nghề thủ công truyền thống.", "eng": "Applying modern techniques to a traditional craft."}, {"viet": "Anh có hoàn toàn chắc rằng lúc đó là sau nửa đêm không?", "eng": "Are you absolutely positive that it was after midnight?"}, {"viet": "Anh vẫn còn đi chiếc xe đạp cũ kỹ ấy à?", "eng": "Are you still riding that superannuated old bike?"}, {"viet": "Do kết quả của những việc vạch trần này, vài bộ trưởng đã từ chức khỏi chính phủ.", "eng": "As a result of these exposures, several ministers resigned from the government."}, {"viet": "Khi chiếc xe buýt chạy qua nó làm bắn tung tóe bùn lên người chúng tôi.", "eng": "As the bus passed it spattered us with mud."}, {"viet": "Anh ta rời trường năm 15 tuổi.", "eng": "At fifteen years old he left school."}, {"viet": "Nối với cái gì bằng sợi dây dài.", "eng": "Attach something with a length string."}, {"viet": "Những rào cản được dựng lên để ngăn chặn đám đông.", "eng": "Barricades were erected to keep back the crowds."}, {"viet": "Hãy giữ mồm giữ miệng của mình để khỏi nói điều xằng bậy.", "eng": "Be on one's guard against saying the wrong thing."}, {"viet": "Trước khi trưng bằng cứ, nhân chứng phải tuyên thệ.", "eng": "Before giving evidence the witness had to take an oath."}, {"viet": "Bill lĩnh xướng và mọi người cùng hát theo.", "eng": "Bill sang the verses and everyone joined in the chorus."}, {"viet": "Phanh xe đạp bằng cách đạp ngược bàn đạp.", "eng": "Brake by reversing the pedalling action."}, {"viet": "Việc xây dựng một nhà máy mới ở đó sẽ tai hại cho môi trường.", "eng": "Building a new factory there would be environmentally disastrous."}, {"viet": "Nhưng tôi đã đọc rất nhiều tài liệu nói về thành phố này, về Tử Cấm Thành, về Di Hòa Viên, về Thiên Đàng,.", "eng": "But I've read a lot about the city, something about its Forbidden City, its Summer Palace, its Temple of Heaven and so on and so forth."}, {"viet": "Nhưng ông sẽ phải điền vào một phiếu mượn và trả lại cái biến thế trước khi trả phòng.", "eng": "But you'll have to fill in a rental slip and return the transformer before you check out."}, {"viet": "À này, giờ thăm bệnh là lúc nào vậy?", "eng": "By the way, what are the visiting hours?"}, {"viet": "Tôi giúp em tìm chỗ ngồi nhé?", "eng": "Can I help you find your seat?"}, {"viet": "Anh có thể chỉ cho tôi đường đến nhà ga?", "eng": "Can you direct me to the station?"}, {"viet": "Anh có thể giới thiệu cho tôi một quyển tiểu thuyết hay được không?", "eng": "Can you recommend me a good novel?"}, {"viet": "Một đảng viên chính thức của đảng Cộng sản.", "eng": "Card-carrying member of the Communist party."}, {"viet": "Ấp ủ niềm hy vọng hão huyền về sự thành công chóng vánh.", "eng": "Chasing the rainbow of overnight success."}, {"viet": "Hoàn cảnh bắt buộc chúng ta phải thay đổi kế hoạch.", "eng": "Circumstances forced us to change our plans."}, {"viet": "Đến đây và xem kỹ cái này-có một chú hươu cao cổ trong vườn rồi!", "eng": "Come and get an eyeful of this-there's a giraffe in the garden!"}, {"viet": "Tình trạng trong nhà bếp không được vệ sinh lắm.", "eng": "Conditions in the kitchen were not very sanitary."}, {"viet": "Nhục hình là một tàn tích của tình trạng man rợ.", "eng": "Corporal punishment was a relic of barbarism."}, {"viet": "Anh vui lòng đặt nó ở đây nhé?", "eng": "Could you put it here, please?"}, {"viet": "Những đám đông rút lui trước các vòi nước chữa cháy của cảnh sát.", "eng": "Crowds retreating before police fire hoses."}, {"viet": "Ghi nợ 5 bảng Anh trong tài khoản của tôi.", "eng": "Debit £ 5 against my account."}, {"viet": "Mặc dù nhiều thương tật, cô ta vẫn không mất đi khát vọng được sống.", "eng": "Despite her injuries, she hasn't lost the will to live."}, {"viet": "Anh chị đi nghỉ có vui không?", "eng": "Did you have a good time on your vacation?"}, {"viet": "Kỷ luật thường được nới lỏng vào cuối tuần.", "eng": "Discipline is often relaxed at weekends."}, {"viet": "Thế các nhân viên bán hàng của chúng ta có tham gia không?", "eng": "Do our own salesmen take part?"}, {"viet": "Cô làm mọi việc vào ban đêm phải không?", "eng": "Do you do all the work at night?"}, {"viet": "Cô có đặc biệt thích thức ăn nào không?", "eng": "Do you have any particular preference in food?"}, {"viet": "Bạn có thích những khu vườn kiểu Nhật không?", "eng": "Do you like Japanese style gardens?"}, {"viet": "Thỉnh thoảng bạn mua các bữa ăn ở một cửa hàng phục vụ 24/24 giờ phải không?", "eng": "Do you sometimes buy meals from a convenience store?"}, {"viet": "Anh có muốn em mua cho anh một ít không?", "eng": "Do you want me to get you some?"}, {"viet": "Nước bạn có chương trình chăm sóc sức khỏe của chính phủ không?", "eng": "Does your country have national health care?"}, {"viet": "Đừng tin tưởng vào việc tăng lương trong năm nay.", "eng": "Don't count on a salary increase this year."}, {"viet": "Đừng quên tắt lò ga-bạn có thể làm cháy rụi nhà đấy.", "eng": "Don't leave the gas on-you might burn the house down."}, {"viet": "Đừng có quan sát tôi khi tôi đang làm bếp.", "eng": "Don't stand over me while I am cooking."}, {"viet": "Con không biết nói nhỏ là khiếm nhã sao?", "eng": "Don't you know it's rude to whisper?"}, {"viet": "Vì những hoàn cảnh ngoài tầm kiểm soát của chúng tôi, chúng tôi không thể đáp xuống đây được.", "eng": "Due to circumstances outside our control we cannot land here."}, {"viet": "Either và or là các liên từ tương quan.", "eng": "Either and or, are correlative conjunctions."}, {"viet": "Thực phẩm dinh dưỡng thiết yếu cho một đứa trẻ đang lớn.", "eng": "Essential nutriments for a growing child."}, {"viet": "Mọi người nên đóng góp theo khả năng của mình.", "eng": "Everyone should contribute what he or she can afford."}, {"viet": "Sử dụng quyền công dân của ai.", "eng": "Exercise one's rights as a citizen."}, {"viet": "Những người hâm mộ rất sùng bái thần tượng của họ.", "eng": "Fans are quite fanatic for their idols."}, {"viet": "Những cánh đồng đã trở lại thành đồng hoang.", "eng": "Fields that have reverted to moorland."}, {"viet": "Cá là thức ăn rất dễ tiêu hóa khi bạn bị bệnh.", "eng": "Fish is easy to digest when you're ill."}, {"viet": "Thực phẩm được cung cấp với những số lượng khác nhau.", "eng": "Food was provided in various amount."}, {"viet": "Gác bỏ phù hoa trần tục để sống cuộc đời của một tu sĩ.", "eng": "Forsaking worldly pomp for the life of a monk."}, {"viet": "Hơn nữa, tôi nhận thấy rằng.", "eng": "Further, it has come to my attention."}, {"viet": "Ra khỏi giường đi, đồ lười chảy thây!", "eng": "Get out of bed, you idle slob!"}, {"viet": "Sơn cái gì thêm lớp thứ hai.", "eng": "Give something a second coat of paint."}, {"viet": "Chúa luôn mong muốn con người được hạnh phúc.", "eng": "God wills that man should by happy."}, {"viet": "Mang tội xâm phạm vào đời tư ai.", "eng": "Guilty of intrusion upon somebody's privacy."}, {"viet": "Xe ôtô của anh đã được kiểm tra định kỳ chưa?", "eng": "Has your car been MOT'd?"}, {"viet": "Bạn có bao giờ mua thức uống tăng lực chưa?", "eng": "Have you ever bought a sports drink?"}, {"viet": "Bạn đã đóng hành lý của mình cho các cuộc hành trình chưa?", "eng": "Have you packed your things for the journeys?"}, {"viet": "Anh ấy sẽ phải làm tất cả công việc một mình.", "eng": "He'll have to do all the work on his own."}, {"viet": "Ông ta là một người Anh chính cống.", "eng": "He's an Englishman through and through."}, {"viet": "Anh ta có một gia đình đông người-rất nhiều miệng ăn khoẻ phải nuôi.", "eng": "He's got a big family-lost of hungry mouths to feed."}, {"viet": "Nó đã đến tuổi cần phải ổn định cuộc sống.", "eng": "He's of an age when he ought to settle down."}, {"viet": "Ông ta ốm nặng và có thể sẽ không sống được qua đêm nay.", "eng": "He's very ill and probably won't last the night."}, {"viet": "Anh ta xin lỗi không đến dự tiệc được, lấy cớ là công việc quá thúc bách.", "eng": "He apologized for not coming to the party, pleading pressure of work."}, {"viet": "Anh ta mua vé đi nghỉ mà không quan tâm gì tới những ước muốn của tôi.", "eng": "He booked the holiday without regarding my wishes."}, {"viet": "Nó không thể có cả hai thứ cùng một lúc!", "eng": "He can't have his cake and eat it!"}, {"viet": "Ông ấy không sao nén được sự căm phẫn của mình.", "eng": "He could scarcely keep in his indignation."}, {"viet": "Nó lãnh đủ sáu tháng trong tù vì tội ăn trộm.", "eng": "He did six months in prison for burglary."}, {"viet": "Anh ta rít điếu thuốc lá và thổi ra một làn khói.", "eng": "He drew on his cigarette and blew out a stream of smoke."}, {"viet": "Anh ta ngã nặng và bị trật mắt cá chân.", "eng": "He fell heavily and twisted his ankle."}, {"viet": "Anh ấy dùng hết sức lực và lay cái rìu.", "eng": "He gathered all his strength and swung the axe."}, {"viet": "Anh ta đã xin được công việc hiện tại khi anh rời quân ngũ.", "eng": "He got his present job when he quitted."}, {"viet": "Anh ta vừa mới đến thì lại được yêu cầu đi ngay.", "eng": "He had no sooner arrived than he was asked to leave again."}, {"viet": "Ông đã nhờ gửi tất cả tiền bạc vào ngân hàng.", "eng": "He has already had all the money deposited in the bank."}, {"viet": "Hắn đã dốc hết túi vào việc cá cược đội hắn sẽ chiếm giải.", "eng": "He has put his shirt on his team winning the trophy."}, {"viet": "Hắn vội vã vượt qua mặt tôi mà không dừng lại.", "eng": "He hurried past me without stopping."}, {"viet": "Anh ta ở vị trí khác thường vì là công nhân bán thời gian duy nhất ở công ty.", "eng": "He is in an anomalous position as the only part time worker in the firm."}, {"viet": "Cảnh sát đang cần anh ta để thẩm vấn.", "eng": "He is wanted for questioning by the police."}, {"viet": "Ông ta đã sống một cuộc sống phóng túng khi còn trẻ.", "eng": "He led a wild life in his youth."}, {"viet": "Anh ta trông có vẻ rất sợ hãi khi đang nói.", "eng": "He looked very frightened as he spoke."}, {"viet": "Ông ấy có thể là một nhân vật quan trọng ở đất nước ông ta, nhưng ở đây thì ông ta chẳng là gì cả.", "eng": "He may be a man of consequence in his own country, but he's nobody here."}, {"viet": "Anh ta có được vị trí này nhờ sự can thiệp vận động của bạn bè.", "eng": "He obtained his position through the agency of friends."}, {"viet": "Anh ta cầu xin cô ấy nghe lời khuyên của anh ta.", "eng": "He pleaded with her to listen to his advice."}, {"viet": "Anh ta lấy bàn tay bịt miệng cô ta lại ngăn không để cô ta hét lên.", "eng": "He put his hand over her mouth to stop her screaming."}, {"viet": "Anh ta khựng lại khi thấy cái xác.", "eng": "He recoiled at the sight of the corpse."}, {"viet": "Hắn xoay tay khoái chí trước viễn cảnh thất bại của họ.", "eng": "He rubbed his hands with glee at the prospect of their defeat."}, {"viet": "Anh ta là một cầu thủ hết sức quý giá cho đội.", "eng": "He's an enormous asset to the team."}, {"viet": "Anh ta bị biệt giam vào ngày cuối tuần.", "eng": "He's in solitary for the weekend."}, {"viet": "Ông ta còn đang lưỡng lự không biết có nên tham gia cuộc thám hiểm hay không.", "eng": "He's still hesitating over whether to join the expedition."}, {"viet": "Ông ấy ngồi chống hai khuỷu tay lên bàn.", "eng": "He sat with his elbows on the table."}, {"viet": "Ông ta cắm một cây cột xuống đất.", "eng": "He set a post in the ground."}, {"viet": "Anh ta lê bước trong đôi dép đứt quai, tay thọc vào túi, miệng huýt sáo.", "eng": "He slopped along in broken slippers, hands in pockets, whistling."}, {"viet": "Anh ta giận dữ giậm chân.", "eng": "He stamped his foot in anger."}, {"viet": "Anh ta tự ghép mình vào kỷ luật khắc nghiệt.", "eng": "He subjected himself to a strenuous ascetic discipline."}, {"viet": "Nó cho rằng Boston là trung tâm của vũ trụ.", "eng": "He thinks that Boston is the hub of the universe."}, {"viet": "Anh ta đã đóng vai Hamlet.", "eng": "He took the part of Hamlet."}, {"viet": "Anh ta đến phỏng vấn trong bộ comlê tả tơi anh ta đã mặc trong nhiều năm.", "eng": "He turned up for the interview in a really naff suit he'd had for years."}, {"viet": "Nó muốn đi thuyền một mình nhưng chắc bố mẹ nó không chịu.", "eng": "He wanted to sail the boat alone but his parents wouldn't wear it."}, {"viet": "Anh ta được hỏi câu đó nhiều lần quá đến nỗi câu trả lời trở thành máy móc.", "eng": "He was asked the same questions so many times that the answer became mechanical."}, {"viet": "Anh ấy lịch sự thích hợp với một người trẻ tuổi nói với một ông già.", "eng": "He was courteous as befitted a young man speaking to an elder man."}, {"viet": "Ông ta được cho uống thuốc tẩy trước khi mổ.", "eng": "He was given a purgative before the operation."}, {"viet": "Anh ta than vãn liên miên suốt cả đêm.", "eng": "He was moaning away all night long."}, {"viet": "Đối với một đứa bé thì nó lặng lẽ một cách ngạc nhiên.", "eng": "He was remarkably quiet for a young child."}, {"viet": "Anh ta bực mình vì trời mưa suốt cuối tuần.", "eng": "He was teed off because it rained all weekend."}, {"viet": "Anh ta nhìn sự đau đớn của cô ấy với thái độ thờ ơ lạnh lùng.", "eng": "He watched her suffering with clinical detachment."}, {"viet": "Nó nhăn nhó khi cô ta dẫm phải bàn chân bị đau của nó.", "eng": "He winced as she stood on his injured foot."}, {"viet": "Nó viết cho tôi một bức thư ngắn hỏi xem tôi có đến hay không.", "eng": "He wrote me a note asking if I would come."}, {"viet": "Tài khoản của cô ta được ghi chi 50 pao.", "eng": "Her account was debited with 50 pounds."}, {"viet": "Sự thất vọng được giả vờ rất khéo.", "eng": "Her carefully simulated disappointment."}, {"viet": "Áo đầm của cô ta được trang điểm bằng lông chim đà điểu.", "eng": "Her dress was trimmed with ostrich feather."}, {"viet": "Sự ra đi của cô ấy là một tổn thất lớn cho công ty.", "eng": "Her going will be a great loss to the company."}, {"viet": "Sự thông minh và học hành siêng năng đã làm cô nổi bật hơn hầu hết các bạn học cùng lớp khác.", "eng": "Her intelligence and hard study set her apart from most other classmates."}, {"viet": "Hàng tuần mẹ cô ấy gởi một lá thư dài cho cô.", "eng": "Her mother sends her a long epistle every week."}, {"viet": "Các dự định của cô ta về nghề điện ảnh tất cả chỉ là ảo vọng.", "eng": "Her plans for movie career had on been a pipe dream."}, {"viet": "Chữ ký của cô ấy nguệch ngoạc không đọc được.", "eng": "Her signature was an illegible scrawl."}, {"viet": "Sự xuất hiện bất ngờ của cô ta làm đảo lộn các kế hoạch của chúng tôi.", "eng": "Her unexpected arrival confused all our plans."}, {"viet": "Đây là tờ chi phiếu 200 đô la.", "eng": "Here's a check for $ 20."}, {"viet": "Mối ác cảm của anh ta đối với hiện đại hoá khiến anh ta không được người ta thích.", "eng": "His antipathy to modernization might make him unpopular."}, {"viet": "Sự thất bại của em anh ta đã làm lu mờ thành công của anh ta.", "eng": "His brother's failure took the edge off his own success."}, {"viet": "Những hoạt động tội ác của nó đã làm cho gia đình ghét bỏ nó.", "eng": "His criminal activities led to complete alienation from his family."}, {"viet": "Gương mặt anh ta tươi tỉnh lên khi cô ta xin lỗi.", "eng": "His face lightened as she apologized."}, {"viet": "Vẻ đẹp trai đã khiến ông ta thắng cử nhưng ông ta còn phải chứng minh rằng mình không phải chỉ có đẹp mã mà thôi.", "eng": "His good looks won him the election but he has still to prove that he's not just a pretty face."}, {"viet": "Nỗi ghen tuông đang giày vò anh ta.", "eng": "His jealousy was eating him up."}, {"viet": "Tâm trí của ông ta đã hồi tưởng lại thời trai trẻ của ông ta.", "eng": "His mind travelled back to his youth."}, {"viet": "Những người của ông đã làm việc cật lực để ông ta thắng cử.", "eng": "His people worked hard to get him elected."}, {"viet": "Những nhận xét của nó hết sức chướng tai-thật ra không thể nhắc lại được.", "eng": "His remarks were quite shocking-unrepeatable, in fact."}, {"viet": "Vẻ mặt nghiêm nghị của anh ta dần dần biến thành một nụ cười.", "eng": "His stern expression merged into a smile."}, {"viet": "Những ý tưởng mơ hồ của ông ấy trở nên rõ ràng và thành một kế hoạch hẳn hoi.", "eng": "His vague ideas crystallized into a definite plan."}, {"viet": "Tổ chức của thảo luận về lối chơi của đội trong trận đấu.", "eng": "Hold an inquest on the team's performance in the match."}, {"viet": "Các thức uống nóng, tức là trà và cà phê được tính riêng.", "eng": "Hot drinks, ie tea and coffee are charged for separately."}, {"viet": "Làm thế nào chúng ta có thể giúp đỡ được họ trong cảnh cùng quẫn?", "eng": "How can we help them in their extremity?"}, {"viet": "Tôi gọi trạm thông tin ở New York thế nào?", "eng": "How do I get New York information?"}, {"viet": "Chiếc xe ôtô mới ấy chạy ra sao?", "eng": "How is the new car performing?"}, {"viet": "Một năm bạn bị cảm bao nhiêu lần?", "eng": "How many colds do you catch a year?"}, {"viet": "Ông muốn khoản trợ cấp bao nhiêu?", "eng": "How much allowance do you want?"}, {"viet": "Bao lâu bạn gặp bạn bè một lần để đi ăn tối hoặc uống cà phê?", "eng": "How often do you meet your friends for dinner or coffee?"}, {"viet": "Hàng trăm người thiệt mạng trong nạn lụt.", "eng": "Hundreds of lives were lost in the floods."}, {"viet": "Tôi muốn nhấn mạnh rằng chúng tôi sẵn sàng gặp ban giám đốc bất cứ lúc nào.", "eng": "I'd like to emphasize that we are ready to meet the management at anytime."}, {"viet": "Trước tiên tôi sẽ bắt đầu bằng tháp Eiffel.", "eng": "I'll begin with the Eiffel Tower first."}, {"viet": "Tôi sẽ chỉ việc nấu bữa tối cho nhanh thôi.", "eng": "I'll just throw together a quick supper."}, {"viet": "Tôi sẽ thử thăm dò ý kiến của ông giám đốc về vấn đề các ngày nghỉ.", "eng": "I'll try to sound out the manager on the question of holidays."}, {"viet": "Tôi tạm ở trên sàn một căn hộ của người bạn trong hai tuần.", "eng": "I'm camping on the floor in a friend's flat for two weeks."}, {"viet": "Tôi sẽ đi dự buổi sát hạch giọng nhưng tôi chẳng tin rằng mình sẽ nhận được vai diễn.", "eng": "I'm going to the audition but I don't expect I'll get a part."}, {"viet": "Tôi không thể tự tiện nói về các đối tác làm ăn của tôi.", "eng": "I'm not free to speak about my business partners."}, {"viet": "Tôi thấy thật là nhẹ nhõm khi không chịu làm việc ấy, chứ không chắc nó đã gây cho tôi nhiều rắc rối rồi.", "eng": "I'm so glad I didn't agree to do it, it would have got me into serious trouble."}, {"viet": "Tôi chắc rằng cuối cùng anh cũng hoàn thành được nhiệm vụ mà thôi.", "eng": "I'm sure you'll get there in the end."}, {"viet": "Tôi vẫn luôn luôn kính phục bức vẽ ban đầu của Monet.", "eng": "I've always admired Monet's early painting."}, {"viet": "Tôi đã xét đoán anh ấy sai lầm suốt những năm đó.", "eng": "I've clearly been misjudging him at these years."}, {"viet": "Tôi đã chỉ thị cho họ khoá căn phòng lại.", "eng": "I've instructed them to keep the room locked."}, {"viet": "Tôi hút thuốc lá đã nhiều năm nay, nhưng bây giờ thì tôi sẽ bỏ.", "eng": "I've smoked cigarettes for years, but now I'm going to lay off them."}, {"viet": "Tôi luôn thắng anh ta trong môn đánh cờ.", "eng": "I always get the better of him at chess."}, {"viet": "Tôi không thạo những tên thực vật cho lắm.", "eng": "I am not very familiar with botanical names."}, {"viet": "Tôi nhờ James mua dùm một ít bánh mì.", "eng": "I asked James to buy some bread."}, {"viet": "Nếu tôi ăn sô-cô-la tôi sẽ nổi ban.", "eng": "I break out in a rash if I eat chocolate."}, {"viet": "Tôi không thể chấp thuận một đề nghị như vậy.", "eng": "I can't give my blessing to such a proposal."}, {"viet": "Tôi không thể nào tưởng tượng là mình đã từng lập gia đình.", "eng": "I can't visualize myself ever getting married."}, {"viet": "Tôi có thể sử dụng một bộ xử lý văn bản nhưng tôi không hiểu cách hoạt động của nó.", "eng": "I can use a word processor but I don't understand its operation."}, {"viet": "Tôi bắt quả tang một cậu bé đang trộm táo trong vườn.", "eng": "I caught a boy stealing apples from the garden."}, {"viet": "Tôi không thể nhớ được một câu chuyện nào để kể cho bọn trẻ con, nên tôi đã phải bịa ra một câu chuyện khi đi đường.", "eng": "I couldn't remember a story to tell the children, so I made one up as I went along."}, {"viet": "Tôi thích uống nước khoáng của Pháp hơn.", "eng": "I'd rather have French mineral water."}, {"viet": "Tôi không thích cái đó chút nào.", "eng": "I didn't enjoy it at all."}, {"viet": "Tôi không biết làm thế nào mà tôi làm được, tôi nghĩ chắc tôi may mắn.", "eng": "I don't know how I aced in, I guess I was just lucky."}, {"viet": "Thực ra tôi không tin vào án tử hình, tôi chỉ muốn nêu lên để tranh luận.", "eng": "I don't really believe in capital punishment, I'm just playing the devil's advocate."}, {"viet": "Tôi không muốn đến dự tiệc đâu nhưng thôi thì đi cho có mặt.", "eng": "I don't want to go to the party but I'd better put in an appearance."}, {"viet": "Tôi thật sự không cần văn phòng.", "eng": "I don't really need an office."}, {"viet": "Hôm nay tôi cảm thấy không khoẻ lắm-tôi nghĩ là tôi sẽ không đi làm.", "eng": "I feel a bit funny today-I don't think I'll go to work."}, {"viet": "Tôi có cảm thấy sự rung chuyển khi máy bay chạm mặt đất.", "eng": "I felt the shock as the aircraft hit the ground."}, {"viet": "Tôi giáng một cú mạnh vào cái nắp và nó bật tung ra.", "eng": "I gave a smart blow on the lid, and it flew open."}, {"viet": "Nhân danh Tổng thống, tôi xin chào mừng các vị.", "eng": "I greet you in the name of the President."}, {"viet": "Tôi quên khuấy mất là hôm nay anh đến.", "eng": "I had slipped my mind that you were arriving today."}, {"viet": "Tôi có nhiều bạn nhưng Mary tốt nhất.", "eng": "I have a lot of friend but Mary is the tops."}, {"viet": "Trước đây tôi chưa bao giờ bị thua trước một trận khác.", "eng": "I have never lost to another team before."}, {"viet": "Tôi phải đi Luân Đôn về công việc làm ăn vào ngày mai.", "eng": "I have to go to London on business tomorrow."}, {"viet": "Cả tuần tôi không bán được cái gì cả.", "eng": "I haven't made a sale all week."}, {"viet": "Tôi hy vọng anh ấy sẽ không nổi giận khi tôi kể cho anh ấy biết việc tôi đã làm.", "eng": "I hope he doesn't cut up rough when I tell him what I've done."}, {"viet": "Tôi cùng với một nhóm nhiều người khác, cảm thấy quyết định này là sai lầm.", "eng": "I in company with many others, feel this decision was wrong."}, {"viet": "Tôi biết là phải chơi với một người mới bắt đầu thì thật là khó.", "eng": "I know how difficult it is to play with a beginner."}, {"viet": "Tôi rất thích nhạc Jazz và nhạc blues.", "eng": "I like Jazz and the blues very much."}, {"viet": "Tôi sẽ mang chúng đến cho ông ngay.", "eng": "I'll bring them to you right away."}, {"viet": "Ngày mai chị sẽ trả lại em.", "eng": "I'll pay you back tomorrow."}, {"viet": "Tôi e rằng tôi không thể nói hộ cho Minh.", "eng": "I'm afraid I can't speak for Minh."}, {"viet": "Tôi sắp đi đến các cửa hàng.", "eng": "I'm going top the shops."}, {"viet": "Lúc này tôi đang thiếu tiền.", "eng": "I'm short of cash at the moment."}, {"viet": "Tôi ước lượng khoảng cách ấy khoảng 70 dặm.", "eng": "I make the distance about 70 miles."}, {"viet": "Tôi phải đến ngân hàng lấy ít tiền.", "eng": "I must go to the bank to get some money."}, {"viet": "Tôi cần phải ổn định bản thân một tí trước khi tôi bắt đầu tìm một công việc làm mới.", "eng": "I need to sort myself out a bit, before I start looking for a new job."}, {"viet": "Tôi chỉ thắt cà vạt vào dịp đặc biệt.", "eng": "I only wear a tie on special occasions."}, {"viet": "Tôi xin nói với anh rằng anh là người duy nhất có lý do để phạm tội này.", "eng": "I put it to you that you are the only person who had a motive for the crime."}, {"viet": "Tôi nhận ra ngay cô ta khi tôi gặp cô ta.", "eng": "I recognized her the instant that I saw her."}, {"viet": "Tôi ngồi xuống định viết bài tiểu luận song tôi cảm thấy không có cảm hứng chút nào.", "eng": "I sat down to write my essay, but found I was completely without inspiration."}, {"viet": "Tôi sẽ rất vui khi về đến nhà.", "eng": "I shall be only too pleased to get home."}, {"viet": "Tôi lần lần cố làm quen với những người hàng xóm.", "eng": "I slowly scraped up an acquaintance with my neighbours."}, {"viet": "Tôi nghĩ rằng hồi đó tôi phản ứng chống lại tuổi thơ ấu bất hạnh của mình theo tiềm thức.", "eng": "I suppose that, subconsciously, I was reacting against my unhappy childhood."}, {"viet": "Tôi nghĩ tôi sẽ chơi ru-lét để thử vận may của mình.", "eng": "I think I'll try my luck at roulette."}, {"viet": "Tôi cho rằng các máy tính này chắc là đã bị ám rồi-nó luôn luôn trục trặc.", "eng": "I think this computer must be jinxed-it's always breaking down."}, {"viet": "Tôi nói thẳng với nó rằng tôi không ưa nó.", "eng": "I told him straight that I didn't like him."}, {"viet": "Tôi hiểu mọi điều trừ lý do nàng giết chàng.", "eng": "I understand everything except why she killed him."}, {"viet": "Tôi muốn có một câu trả lời dứt khoát'có'hay'không'.", "eng": "I want a definite answer,'yes'or'no'."}, {"viet": "Tôi muốn gửi 1000 đô la Mỹ cho mẹ tôi ở New York.", "eng": "I want to send US $ 1,000 to my mother in New York."}, {"viet": "Tôi đang thèm một chầu rượu.", "eng": "I was craving for a drink."}, {"viet": "Tôi đã lầm khi nói với anh cô ấy là cô giáo, cô ấy là bác sĩ.", "eng": "I was mistaken when I told you she was a teacher, she is a doctor."}, {"viet": "Tôi lấy làm ngạc nhiên vì sự thô lỗ của hắn.", "eng": "I was taken aback by his rudeness."}, {"viet": "Tôi sẽ làm theo ý anh.", "eng": "I will be governed by you."}, {"viet": "Tôi mong anh đừng làm phiền tôi ( về chuyện bỏ thuốc nữa ).", "eng": "I wish you would stop hasseling me ( about stopping smoking )."}, {"viet": "Tôi sẽ không bán cho một người lạ.", "eng": "I won't sell to a stranger."}, {"viet": "Tôi muốn đặt chổ trước cho tối mai, lúc 7 giờ, cho 3 người.", "eng": "I would like to make reservations for tomorrow night, at seven o'clock, for three."}, {"viet": "Tôi không muốn dính líu đến điều gì bất hợp pháp.", "eng": "I wouldn't touch anything illegal."}, {"viet": "Nếu anh ta ở đây thì chính tôi sẽ có thể giải thích cho anh ta.", "eng": "If he were here I could explain to him myself."}, {"viet": "Nếu chi phí sản xuất gia tăng thì giá cả sẽ gia tăng theo tỷ lệ tương ứng.", "eng": "If production costs go up, there will be prices will increase pro rata."}, {"viet": "Nếu chúng mình đến muộn, chắc sẽ có chuyện phiền toái đấy.", "eng": "If we're late, it'll mean trouble."}, {"viet": "Nếu em đã mua thức ăn nấu sẵn thì chúng ta không cần phải nấu nướng nữa.", "eng": "If you buy some prepared food, we do not need to cook."}, {"viet": "Nếu anh đi sớm, anh sẽ tránh được xe cộ đi lại đông đúc.", "eng": "If you go early you'll miss the traffic."}, {"viet": "Nếu nghe lời tôi khuyên, anh hãy đi khám bác sĩ.", "eng": "If you take my advice you'll see a doctor."}, {"viet": "Những người nhập cư sống bằng tiền trợ cấp cho đến khi họ có được việc làm.", "eng": "Immigrants live on the dole, till they are able to secure employment."}, {"viet": "So với hệ thống của họ thì hệ thống của chúng ta xem ra rất cổ lỗ.", "eng": "In contrast with their system, ours seems very old-fashioned."}, {"viet": "Trong tiếng La Tinh, một số động từ đòi hỏi tặng cách.", "eng": "In Latin, several verbs govern the dative."}, {"viet": "Nếu vậy, dưới 10% thì đâu đáng bỏ công.", "eng": "In that case, anything less than 10% is not worth the trouble."}, {"viet": "Trong tình hình này thì những công việc làm ăn nhỏ khó mà thành công.", "eng": "In the scheme of things it is hard for small businesses to succeed."}, {"viet": "Số lượng phân bón thêm vào sẽ làm tăng thêm sản lượng.", "eng": "Increased input of fertilizer may increase crop yield."}, {"viet": "Ở nước bạn, việc có súng có bị nghiêm cấm không?", "eng": "Is having a gun strongly prohibited in your country?"}, {"viet": "Ông thấy bàn này có thích hợp không?", "eng": "Is the table suitable for you?"}, {"viet": "Đây là tổng số tiền của hoá đơn phải không?", "eng": "Is this the total charge of the bill?"}, {"viet": "Tiếc là ông không nói tiếng Anh chuẩn hoàn toàn.", "eng": "It's a pity you don't all speak standard English."}, {"viet": "Biết được các bệnh mình đang mắc phải là bệnh phổ biến thì cũng chẳng an ủi được là bao.", "eng": "It's cold comfort to know that the disease is a common one when you are ill."}, {"viet": "Bạn hút thuốc mà không xin phép là mất lịch sự.", "eng": "It's impolite for you to smoke without asking for permission."}, {"viet": "Đi xe hơi không nguy hiểm lại tiện lợi.", "eng": "It's not dangerous and it's convenient."}, {"viet": "Một ngày đẹp trời thế này mà ru rú ở trong nhà thì thật là đáng tội.", "eng": "It's sin to stay indoors on such a fine day."}, {"viet": "Món này rất ngon, da vịt rất giòn.", "eng": "It's very delicious and its skin is really crispy."}, {"viet": "Đối với tôi nó không có vẻ gì là xấu xí, trái lại, tôi nghĩ là nó lại có phần đẹp nữa.", "eng": "It doesn't seem ugly to me, on the contrary, I think it's rather beautiful."}, {"viet": "Ở các vùng cao này thấy khó thở.", "eng": "It is difficult to breathe at these altitudes."}, {"viet": "Chỉ hoạ hoằn lắm anh mới có một cơ hội như thế.", "eng": "It is only once in a blue moon that you get an opportunity like that."}, {"viet": "Tôi cảm thấy sung sướng được biết là anh thích tôi.", "eng": "It makes me feel good to know you like me."}, {"viet": "Nó ở giữa tiệm bánh và tiệm bán thịt.", "eng": "It's between bakery and butcher shop."}, {"viet": "Thoạt nhìn có thể là một ý kiến hay nhưng khiếm khuyết của nó chẳng bao lâu trở nên rõ ràng.", "eng": "It seemed a good idea at first blush, but its drawbacks soon became apparent."}, {"viet": "Tôi phải mất một thời gian để suy nghĩ và hiểu được điều tôi nghe thấy.", "eng": "It took me sometime to digest what I had heard."}, {"viet": "Rõ ràng là anh ta muốn một mình.", "eng": "It was clear that he wanted to be alone."}, {"viet": "Mưa to quá buộc tôi phải ở nhà.", "eng": "It was raining so hard that i was obliged to stay at home."}, {"viet": "Đi bộ việt dã sẽ có rất ích cho chúng ta.", "eng": "It will do us a lot of good to go on a hiking."}, {"viet": "Bữa tiệc của Jane là sự thử thách sức chịu đựng hơn bất kỳ cái gì khác.", "eng": "Jane's party was more of an endurance test than anything else."}, {"viet": "John Smith ở trường trung học của chúng ta.", "eng": "John Smith from our high school."}, {"viet": "Hãy ghi sổ công việc hàng ngày của anh.", "eng": "Keep an account of your daily activities."}, {"viet": "Cả hai bên chúng ta hãy cùng nhượng bộ thêm đi-6% nhé.", "eng": "Let's both make a further concession-6%."}, {"viet": "Để xem nào, hoặc xe buýt hoặc xe hơi.", "eng": "Let's see, either bus or taxi."}, {"viet": "Nhiều chương trình phát triển được đưa ra trong nhiệm kỳ tổng thống của ông ấy.", "eng": "Many development programmes were introduce during his presidency."}, {"viet": "Nhiều bộ lạc cũng có lễ hội powwow riêng cho cư dân của họ.", "eng": "Many tribes have powwows for their own people, too."}, {"viet": "Tôi lấy cho anh một ly nước giải khát nữa nhé?", "eng": "May I get you another soft drink?"}, {"viet": "Có lẽ họ quá giống nhau chăng?", "eng": "Maybe they are too much alike?"}, {"viet": "Hầu hết số tiền sẽ được chuyển cho nghiên cứu y học.", "eng": "Most of the money will be directed towards medical research."}, {"viet": "Nhiều tiếng than khóc sau cái chết của ông vua già.", "eng": "Much lamentation followed the death of the old king."}, {"viet": "Con gái tôi không mặc vừa tất cả quần áo của nó nữa.", "eng": "My daughter's grown out of all her dresses."}, {"viet": "Nhà tôi ở bên kia sông.", "eng": "My house is on the opposite bank of the river."}, {"viet": "Kế hoạch của tôi đã có tác động và tôi đã được họ đồng ý.", "eng": "My plan worked, and I got them to agree."}, {"viet": "Chất ma tuý là mối đe doạ chủ yếu đến sức khoẻ.", "eng": "Narcotics are a major threat to health."}, {"viet": "Lần sau bạn phải đến nhà chúng tôi ăn tối nhé.", "eng": "Next time you must come to our house for dinner."}, {"viet": "Không có nước nào muốn tiến hành một cuộc chiến tranh hạt nhân.", "eng": "No country wants to wage a nuclear war."}, {"viet": "Nào các em, hãy mở sách trang số 6.", "eng": "Now, children, open your books at page 6."}, {"viet": "Những người béo phị cảm thấy khó mà không ăn quá nhiều được.", "eng": "Obese people find it difficult to stop overeating."}, {"viet": "Ồ, căn phòng đẹp, rộng, được bài trí đẹp, và quyến rũ làm sao!", "eng": "Oh, what a nice room, large, well-furnished and attractive!"}, {"viet": "Trên bờ, có những cây chuối, những rặng liễu rủ bóng và những cây đào.", "eng": "On the bank, there are banana trees, weeping willows and peach trees."}, {"viet": "Một người bạn học cùng lớp của bố sẽ kết hôn vào ngày 10 tháng 10.", "eng": "One of dad's classmates will get married on Oct 10th."}, {"viet": "Úi, ngón chân út của con bị đụng vào bàn trang điểm.", "eng": "Ouch, I banged my little toe against the dresser."}, {"viet": "Kế hoạch tương lai của chúng ta phải phù hợp với những thực tiễn hiện nay.", "eng": "Our future plans must mesh with existing practices."}, {"viet": "Các thể chế chính trị của chúng ta không ngừng tiến triển.", "eng": "Our political institutions are in continuous evolution."}, {"viet": "Qua vài ngày sau, họ đã biết rõ thành phố.", "eng": "Over the next few days they got to know the town well."}, {"viet": "Trả được tiền thế nợ làm cho tôi nhẹ nhõm cả người!", "eng": "Paying my mortgage was an enormous weight off my mind!"}, {"viet": "Có lẽ nếu các sinh viên thờ ơ là do lỗi của thầy giáo.", "eng": "Perhaps it's the teacher's fault if the students are apathetic."}, {"viet": "Cảnh sát thông báo là đường đó cấm.", "eng": "Police reported the closure of the road."}, {"viet": "Cuộc nghiên cứu bao trùm một số lĩnh vực.", "eng": "Research ranging over a number of fields."}, {"viet": "Step là chữ viết tắt của September.", "eng": "Sept is an abbreviation for September."}, {"viet": "Bây giờ cô ta sẽ phải thận trọng-cô ta trực tiếp chịu sự khiển trách của giám đốc mới.", "eng": "She'll have to be careful now-she's directly in the firing-line of the new director."}, {"viet": "Cô ta bị đưa ra khỏi đội hình vì chấn thương.", "eng": "She's been dropped from the team because of injury."}, {"viet": "Cô ấy do dự không muốn kết bạn mới.", "eng": "She's hesitant about making new friends."}, {"viet": "Bà ấy đã hứa không nói và chúng ta không thể làm gì để moi được tin tức đó nơi bà ta.", "eng": "She's promised not to talk, and nothing we could do could prise the information out of her."}, {"viet": "Cô ta khéo miệng lắm, nhưng tôi không tin lời nào cô ấy nói.", "eng": "She's very slick, but I don't believe a word she says."}, {"viet": "Cô ta theo học lớp ngoại thương trong hai năm.", "eng": "She attended the foreign trade course in two years."}, {"viet": "Cô ta đã lây cảm cúm của tôi rồi truyền sang chồng cô ta.", "eng": "She caught my cold and passed it on to her husband."}, {"viet": "Cô ta bị cảm lạnh rất nặng.", "eng": "She'd got a stinking cold."}, {"viet": "Cô ấy chẳng nhìn lâu vào mắt tôi đâu.", "eng": "She doesn't keep still long enough to look in my eyes."}, {"viet": "Cô ta cảm thấy buồn nôn trong khi vượt qua biển.", "eng": "She felt nauseous during the sea crossing."}, {"viet": "Cô ấy đã làm cho họ chấp nhận những thay đổi này bằng sự khéo léo tế nhị.", "eng": "She gets them to accept these changes by tactful management."}, {"viet": "Cô ấy đã ngủ thiếp đi để cuốn sách còn mở ở trong lòng.", "eng": "She had fallen asleep with an open book in her lap."}, {"viet": "Cô ấy bị khó khăn bởi ốm.", "eng": "She has been handicapped by her illness."}, {"viet": "Cô ấy lưỡng lự không biết làm thế nào để thông báo cái tin khủng khiếp đó.", "eng": "She held back, not knowing how to break the terrible news."}, {"viet": "Bà ấy có thể bổ nhiệm ông ta làm bộ trưởng bộ Ngoại giao.", "eng": "She is likely to appoint him Foreign Minister."}, {"viet": "Mặc cho sự la ó, bà ta vẫn giữ được thái độ chững chạc đường hoàng.", "eng": "She kept her dignity despite the booing."}, {"viet": "Cô ta nhìn tôi với ánh mắt căm ghét.", "eng": "She looked at me with hate in her eyes."}, {"viet": "Bà ta gặp nhiều trở ngại trên đường đi.", "eng": "She met with many difficulties when travelling."}, {"viet": "Cô ta dùng bút chì vạch ra hình dáng phác thảo của một ngôi nhà.", "eng": "She pencilled the rough outline of a house."}, {"viet": "Cô ta có phần tự phụ cho mình là một ca sĩ.", "eng": "She rather fancies herself as a singer."}, {"viet": "Bà ta là một người vợ hiếm có.", "eng": "She's a wife in a million."}, {"viet": "Cô ta là một trong những học sinh thông minh nhất của tôi.", "eng": "She's one of my aptest students."}, {"viet": "Bà ta nói rằng chỉ có nước Ý là nơi đáng đi nghỉ nhất.", "eng": "She says Italy is the only place to go for a holiday."}, {"viet": "Cô ta biểu lộ thái độ tích cực của mình đối với công việc.", "eng": "She shows a very positive attitude to her work."}, {"viet": "Cô ấy bắt đầu làm chân thư ký nhưng ngày nay cô ấy đã có một vị trí cao hơn trong công ty.", "eng": "She started as a secretary, but now she has a senior position in the company."}, {"viet": "Cô ấy nếm cà phê rồi thêm đường vào.", "eng": "She tasted her coffee, and then added more sugar."}, {"viet": "Cô ta lật chăn xuống rồi leo lên giường ngủ.", "eng": "She turned down the blankets and climbed into bed."}, {"viet": "Cô ta là một người vợ tốt và một người mẹ hiền.", "eng": "She was a good wife and mother."}, {"viet": "Cô ta được tuyên bố là vô tội.", "eng": "She was cleared of all charges."}, {"viet": "Cô ấy ở trong một tình trạng tiến thoái lưỡng nan không biết nên ở lại trường hay đi kiếm một công việc.", "eng": "She was in a dilemma as to whether to stay at school or get a job."}, {"viet": "Cô ta bước đi vênh váo trong bộ cánh mới của cô.", "eng": "She was prancing along in her new outfit."}, {"viet": "Cô ta là người sáng tạo ra toàn bộ kế hoạch ấy.", "eng": "She was the brains behind the whole scheme."}, {"viet": "Sau cái chết của chồng, cô ấy trở nên gàn dở.", "eng": "She went a bit funny after her husband died."}, {"viet": "Cô ta đứng đầu trong cuộc thi.", "eng": "She won first prize in the competition."}, {"viet": "Chỗ trú ẩn này để chống lại thời tiết khắc nghiệt.", "eng": "Shelter was proof against the bitter weather."}, {"viet": "Câm miệng anh lại, không ai hỏi anh!", "eng": "Shut your mouth, nobody asked you!"}, {"viet": "Ngồi hơ mình trước ngọn lửa nóng.", "eng": "Sit grilling oneself in front of a fire."}, {"viet": "Đập mạnh quả bóng ra khỏi sân.", "eng": "Smash the ball out of the court."}, {"viet": "Rất nhiều điều khủng khiếp đã xảy đến với anh ta gần đây đến nỗi anh ta cảm thấy như ở bên bờ vực thẳm.", "eng": "So many horrible things have happened to him recently that he feels like he's on the ragged edge."}, {"viet": "Một số phân tử sinh học có dạng đường xoắn ốc.", "eng": "Some biological molecules have the form of a helix."}, {"viet": "Một số tem trong bộ sưu tập của tôi có giá trị lắm.", "eng": "Some of the stamps in my collection are quite valuable."}, {"viet": "Một phóng viên tép riu bất tài bất tướng nào đó.", "eng": "Some twopenny-halfpenny little reporter."}, {"viet": "Xin lỗi, chúng tôi bán món vịt quay Bắc Kinh theo gam.", "eng": "Sorry, but we sell the Beijing Roast Duck by the gram."}, {"viet": "Những chi tiết hấp dẫn hơi tục tĩu về cuộc đời tình ái của một ngôi sao điện ảnh.", "eng": "Spicy details of a film star's love life."}, {"viet": "Giá cổ phần ngành thép cuối ngày giao dịch chứng khoán là 15 bảng Anh.", "eng": "Steel shares closed at £ 15."}, {"viet": "Ngăn nước chảy tràn từ bồn chứa.", "eng": "Stop the overflow from the cistern."}, {"viet": "Các vùng ngoại ô trải ra đến tận nông thôn.", "eng": "Suburbs that sprawl out into the countryside."}, {"viet": "Chịu những cú sốc của số phận nghiệt ngã.", "eng": "Suffer the buffets of a cruel fate."}, {"viet": "Đàn én bay vút trên không.", "eng": "Swallows are darting through the air."}, {"viet": "Cho máy chạy thử một tuần.", "eng": "Take the machine on trial for a week."}, {"viet": "Phương tiện liên lạc bằng điện thoại giữa hai thành phố đã được phục hồi.", "eng": "Telephone communications between the two cities have been restored."}, {"viet": "Xin cảm ơn ông đã khoan dung như thế.", "eng": "Thank you for being so forbearing."}, {"viet": "Đó là cái tạo ra bộ khung của tòa nhà.", "eng": "That's what makes the skeleton of the building."}, {"viet": "Cơn sốt ấy làm anh ta suýt đi đứt cuộc đời.", "eng": "That fever nearly finished him off."}, {"viet": "Xe mô tô này sẽ làm cho bạn chết đấy.", "eng": "That motorbike will be the death of you."}, {"viet": "Đó là Peter đứng ở trạm xe buýt.", "eng": "That's Peter at the bus-stop."}, {"viet": "Đó là một trong những nước cờ chính trị tinh khôn hơn của bà ấy.", "eng": "That was one of her more astute political moves."}, {"viet": "Ban cho quyền lợi và đặc quyền.", "eng": "The accordance of rights and privileges."}, {"viet": "Cái vỏ ngoài của điệp viên ấy đã bị vỡ và anh ta phải rời khỏi đất nước đó.", "eng": "The agent's cover had been blown and he had to leave the country."}, {"viet": "Nghe thấy tiếng súng, súc vật hết sức hoảng sợ.", "eng": "The animals took fright at the sound of the gun."}, {"viet": "Cuộc tranh cãi làm anh ta xa lánh anh của mình.", "eng": "The argument estranged him from his brother."}, {"viet": "Không khí ở đây ngột ngạt quá-ta có thể mở cửa sổ ra được không?", "eng": "The atmosphere is very stuffy in here-can we open a window?"}, {"viet": "Chữ b trong từ debt không phát âm.", "eng": "The b in debt is not pronounced."}, {"viet": "Bọn côn đồ đã lột hết quần áo của anh ta.", "eng": "The bandits stripped him of his clothes."}, {"viet": "Đài BBC dự tính truyền hình tất cả các vở kịch của Shakespeare.", "eng": "The BBC plans to televise all Shakespeare's plays."}, {"viet": "Hối phiếu này được viết để rút tiền ở một ngân hàng Mỹ.", "eng": "The bill was drawn on an American bank."}, {"viet": "Tàu vào đậu trong cảng Lagos để sửa chữa.", "eng": "The boat put into Lagos for repairs."}, {"viet": "Cuốn sách được minh hoạ bằng những tấm ảnh màu.", "eng": "The book was illustrated with colour photographs."}, {"viet": "Lũ trẻ vẽ khung thành lên tường của sân chơi.", "eng": "The boys chalked out goal-posts on the playground wall."}, {"viet": "Xô, miếng bọt biển và giẻ thì ở trong nhà kho.", "eng": "The bucket, sponge and rag are in the storage room."}, {"viet": "Xe buýt chạy đến làng chúng tôi thất thường lắm.", "eng": "The buses to our village are few and far between."}, {"viet": "Bánh xe ôtô sượt qua lề đường.", "eng": "The car's tyres grazed against the kerb."}, {"viet": "Chiếc ô tô đỗ khi tai nạn xảy ra.", "eng": "The car was stationary when the accident happened."}, {"viet": "Chủng tộc Caucase, Mông Cổ, da đen.", "eng": "The Caucasian, Mongolian, Negro, etc race."}, {"viet": "Đặc trưng của cảnh vật sa mạc.", "eng": "The character of the desert landscape."}, {"viet": "Đứa bé giận dữ đấm mẹ nó thùm thụp khi mẹ nó bế nó về nhà.", "eng": "The child pummelled his mother angrily as she carried him home."}, {"viet": "Bọn trẻ con hăm hở chạy ùa đến khi chúng nghe thấy bữa trà đã chuẩn bị xong.", "eng": "The children came running hotfoot when they heard tea was ready."}, {"viet": "Bọn trẻ rất ngoan ngoãn khi ông vắng mặt.", "eng": "The children were as good as gold while you were out."}, {"viet": "Thành phố ở độ cao 2.000 mét so với mực nước biển.", "eng": "The city is at an elevation of 2,000 metres."}, {"viet": "Đám mây vây quanh mặt trăng.", "eng": "The cloud rack which aureoled the moon."}, {"viet": "Sắc da hồng hào trở lại trên đôi má cô ta.", "eng": "The colour is coming back to her cheeks."}, {"viet": "Công ty đó đã bị quản lý tồi trong nhiều năm.", "eng": "The company had been mismanaged for years."}, {"viet": "Vi tính đã đưa ra con số thống kê khá là dị thường.", "eng": "The computer has come up with some rather anomalous statistics."}, {"viet": "Hợp đồng được duyệt xét thoả đáng.", "eng": "The contract was ex facie satisfactory."}, {"viet": "Đất nước không thể được bảo vệ chống lại một cuộc tấn công hạt nhân.", "eng": "The country cannot be defended against a nuclear attack."}, {"viet": "Đàn bò rời khỏi cánh đồng và đi ( lang thang ) tung tăng trên đường cái.", "eng": "The cows had got out of the field and were ( roaming ) loose in the road."}, {"viet": "Đám khán giả tràn qua vào sân vận động.", "eng": "The crowd surged past into the stadium."}, {"viet": "Công việc quét dọn, nấu nướng và đi cửa hàng hàng ngày.", "eng": "The daily chores of cleaning cooking and shopping."}, {"viet": "Những màu sắc sẫm dần của trời chiều.", "eng": "The deepening colours of the evening sky."}, {"viet": "Mọi chi tiết của bộ quần áo đó đều hoàn toàn xác thực.", "eng": "The details of the costume were totally authentic."}, {"viet": "Sự khám phá ra vắc xin là một bước quyết định trong việc đấu tranh chống bệnh đậu mùa.", "eng": "The discovery of a vaccine was the turning-point in the fight against smallpox."}, {"viet": "Bác sĩ đã cho cô ta vài viên thuốc để cho hết đau.", "eng": "The doctor has given her some tablets to take away the pain."}, {"viet": "Con chó đào ở góc đó một tiếng đồng hồ.", "eng": "The dog has been digging in that corner for an hour."}, {"viet": "Luật tam duy nhất trong kịch.", "eng": "The dramatic unities of time, place and action."}, {"viet": "Trong thời gian đầu cuộc đời mình nàng đã sống ở Pari.", "eng": "The early part of her life was spent in Paris."}, {"viet": "Con voi hạ thân hình nặng nề của nó xuống nước.", "eng": "The elephant lowered its ponderous body into the water."}, {"viet": "Toàn bộ đề nghị đó thật buồn cười: nó sẽ không bao giờ được chấp nhận.", "eng": "The entire proposal is risible: it will never be accepted."}, {"viet": "Ngành hành pháp của Chính phủ.", "eng": "The executive branch of the Government."}, {"viet": "Nhà máy đó sản xuất ra 900 xe ôtô trong một tuần.", "eng": "The factory turns out 900 cars a week."}, {"viet": "Tay đua được hâm mộ đã thắng cuộc đua dễ dàng.", "eng": "The favourite won the race comfortably."}, {"viet": "Âm thanh của bộ phim không ăn khớp với hình ảnh.", "eng": "The film's sound-track is not in sync with the picture."}, {"viet": "Công ty đó có một tài sản quan trọng là bản thân giám đốc phụ trách nghiên cứu.", "eng": "The firm has an important asset in the person of the director of research."}, {"viet": "Lần đầu tiên khi tôi ăn thịt gà tây, tôi đã cảm thấy khó chịu.", "eng": "The first time I ate turkey, I felt sick."}, {"viet": "Thức ăn tốt và việc phục vụ cũng thế.", "eng": "The food is good and the same is true of the service."}, {"viet": "Những bức tranh tường nhà thờ Sistine đều nổi tiếng thế giới.", "eng": "The fresco in Sistine Chapel are world famous."}, {"viet": "Khu vườn đẹp nhất vào tháng Sáu.", "eng": "The garden's at its most beautiful in June."}, {"viet": "Cột đỡ đó có tiết diện hình vuông.", "eng": "The girder is square in cross-section."}, {"viet": "Kế hoạch của chính phủ là tập trung những ngành công nghiệp mới vào các khu vực có nạn thất nghiệp cao.", "eng": "The Government's plan is to concentrate new industries in areas of high unemployment."}, {"viet": "Chính phủ đang leo thang chiến tranh một cách có cân nhắc vì những lý do chính trị.", "eng": "The Government is deliberately escalating the war for political reasons."}, {"viet": "Thống đốc ngân hàng Anh quốc.", "eng": "The governor of the Bank of England."}, {"viet": "Đĩa nhạc của nhóm đó đã bán được hàng triệu cái.", "eng": "The group's record has sold millions."}, {"viet": "Vận động viên thể dục đu đưa trên xà kép.", "eng": "The gymnast swung on the parallel bars."}, {"viet": "Sáng nay người giúp việc không có đến.", "eng": "The help hasn't come this morning."}, {"viet": "Con ngựa đã về đến đích trước độ hai lần chiều dài của nó.", "eng": "The horse won the race by two lengths."}, {"viet": "Ngôi nhà ấy đã bỏ trống nhiều tháng rồi.", "eng": "The house has stood empty for months."}, {"viet": "Những người đi săn nguỵ trang bằng những cành cây để họ lẫn với cây.", "eng": "The hunters were camouflaged with branches so that they blended with the trees."}, {"viet": "Sự phồn vinh của đất nước tăng lên là nhờ ở việc phát hiện ra dầu lửa.", "eng": "The increase in the country's prosperity was due to the discovery of oil."}, {"viet": "Sự hội nhập của học sinh da đen vào hệ thống giáo dục ở các tiểu bang miền Nam Hoa Kỳ.", "eng": "The integration of black children into the School System in the southern states of America."}, {"viet": "Việc này đã phải uỷ thác cho một trợ lý.", "eng": "The job had to be delegated to an assistant."}, {"viet": "Bồi thẩm đoàn được mời đến để tái cứu xét phán quyết của mình.", "eng": "The jury was called upon to reconsider its verdict."}, {"viet": "Con cừu non đã phải được nuôi bằng sữa bình.", "eng": "The lamb had to be brought up by hand."}, {"viet": "Sự giết hại trái luật những loài được bảo vệ.", "eng": "The lawless slaughter of protected species."}, {"viet": "Các chữ sẽ chẳng xuất hiện nếu như chất giấy chung quanh chúng không phản chiếu ánh sáng lên mắt chúng ta.", "eng": "The letters would not show if the paper around them did not reflect light to our eyes."}, {"viet": "Hội đồng địa phương dự định xây cất nhà ở chỗ này.", "eng": "The local council intends to build on this site."}, {"viet": "Hương vị thơm ngon của những quả đào chín.", "eng": "The luscious taste of ripe peaches."}, {"viet": "Người ở đằng trước che sân bóng khuất mắt tôi.", "eng": "The man infront was obstructing my view of the pitch."}, {"viet": "Trận đấu bị hoãn hai lần vì trời mưa.", "eng": "The match was rained off twice."}, {"viet": "Cuộc họp được tổ chức kín.", "eng": "The meeting was held behind closed doors."}, {"viet": "Diễn văn của ông bộ trưởng được một số giới giải thích như là một sự thừa nhận rằng chính phủ đã sai.", "eng": "The minister's speech is interpreted in some quarters as an admission that the Government was wrong."}, {"viet": "Số tiền mà chúng ta yêu cầu lúc đó chưa có sẵn.", "eng": "The money we asked for was not forthcoming."}, {"viet": "Ngọn núi vươn cao đầu trên những đám mây.", "eng": "The mountain exalts its head above the clouds."}, {"viet": "Hiến pháp của quốc gia này cung cấp một kiểu mẫu cho các nước khác noi theo.", "eng": "The nation's constitution provided a model that other countries followed."}, {"viet": "Những chứng cớ mới đã hậu thuẫn cho trường hợp của họ.", "eng": "The new evidence beefed up their case."}, {"viet": "Hệ thống đường xá mới cho phép xe cộ lưu thông thoải mái bất cứ lúc nào.", "eng": "The new road system permits the free flow of traffic at all times."}, {"viet": "Tờ báo đang có vấn đề về phân phối ở miền Bắc của đất nước.", "eng": "The newspaper is having distribution problems in the north of the country."}, {"viet": "Cuốn tiểu thuyết đó là một bản cáo trạng cực kỳ mạnh mẽ về sự nghèo khổ.", "eng": "The novel is a searing indictment of poverty."}, {"viet": "Lời đề nghị tôi nêu ra với ông tuần trước nay vẫn có giá trị.", "eng": "The offer I made to you last week still holds."}, {"viet": "Ông cụ đó tì lên cái gậy của mình.", "eng": "The old man leant upon his stick."}, {"viet": "Phe đối lập đã lớn tiếng chỉ trích những hành động của chính phủ.", "eng": "The opposition we're shrill in their criticism of the government's action."}, {"viet": "Sơn trên tường bắt đầu bong ra.", "eng": "The paint on the walls is beginning to flake."}, {"viet": "Buổi liên hoan là một cuộc thất bại hoàn toàn.", "eng": "The party was a total wash-out."}, {"viet": "Quỹ lương hưu có cổ phần trong một số công ty quốc doanh hữu hạn.", "eng": "The pension fund owns shares in several major public companies."}, {"viet": "Sự thản nhiên chịu đựng những đau khổ cùng cực của các tù nhân đã gây ấn tượng đến cả những người bắt giữ họ.", "eng": "The philosophy of the prisoners during their worst sufferings impressed even their captors."}, {"viet": "Bọn hải tặc chôn giấu rương hòm trên đảo.", "eng": "The pirates buried the chest on the island."}, {"viet": "Cây này có một bông hoa tím rực rỡ.", "eng": "The plant has a brilliant purple flower."}, {"viet": "Âm mưu đó đã làm cho tên khủng bố chết đứng vì quả bom nổ quá sớm.", "eng": "The plot backfired on the terrorist when the bomb exploded too soon."}, {"viet": "Cảnh sát đã tìm thấy thiết bị đánh bom từ nơi ẩn náu của bọn khủng bố.", "eng": "The police found bomb-making equipment in the terrorists hideout."}, {"viet": "Cảnh sát cho người đàn ông này có thể là tên trộm họ đang tìm, vì vậy họ theo dõi nhất cử nhất động của hắn một cách cẩn thận.", "eng": "The police think this man maybe the thief they're looking for, so they're watching his movements carefully."}, {"viet": "Vùng này trong nước dân cư thưa thớt.", "eng": "The population is thin in this part of the country."}, {"viet": "Các thì hiện tại và quá khứ hoàn thành.", "eng": "The present and past perfect tenses."}, {"viet": "Báo chí đã ca ngợi rùm beng cuộc biểu diễn sắp tới.", "eng": "The press has given the show a tremendous build-up."}, {"viet": "Vị hoàng tử cưỡi một con ngựa trắng.", "eng": "The prince rode a milk-white horse."}, {"viet": "Tiến trình của buổi họp bị gián đoạn vì có tiếng chuông báo cháy.", "eng": "The proceedings were interrupted by the fire alarm."}, {"viet": "Những thay đổi thuế được trù định có thể chứng tỏ một vấn đề gay cấn đối với chính phủ.", "eng": "The proposed tax changes are likely to prove a banana skin for the Government."}, {"viet": "Các kim tự tháp là bằng chứng về tài năng xây dựng của người Ai Cập cổ đại.", "eng": "The pyramids are a testimony to the Ancient Egyptians'engineering skills."}, {"viet": "Tuyến đường xe lửa đó phải ngừng hoạt động vì bị lún.", "eng": "The railway line was closed because of ( a subsidence."}, {"viet": "Những cuộc tranh chấp mới đây ở Nam Phi.", "eng": "The recent troubles in South Africa."}, {"viet": "Bản tường trình đã minh oan hoàn toàn cho các công đoàn.", "eng": "The report fully vindicated the unions."}, {"viet": "Sách Khải huyền của thánh John the Divine.", "eng": "The revelation of St John the Divine."}, {"viet": "Con sông uốn khúc ra biển.", "eng": "The river winds down to the sea."}, {"viet": "Căn phòng thì rộng so với chiều dài của nó.", "eng": "The room is wide in proportion to its height."}, {"viet": "Sự sột soạt của lá khô, giấy gói kẹo.", "eng": "The rustling of dry leaves, sweet-papers."}, {"viet": "Quang cảnh quanh đây hơi buồn tẻ.", "eng": "The scenery around here is a little tame."}, {"viet": "Đèn pha chiếu sáng, soi rọi sân nhà tù.", "eng": "The searchlights glared, illuminating the prison yard."}, {"viet": "Sự phục vụ hoàn toàn chẳng có gì là tầm cỡ thế giới cả, chi phí lại rất cao.", "eng": "The service is anything but world class, the charge is very high."}, {"viet": "Con tàu đã trải qua một cách thắng lợi những cuộc thử thách đi biển ven bờ.", "eng": "The ship successfully underwent sea trials in coastal waters."}, {"viet": "Mưa rào đã làm lắng bụi bặm xuống.", "eng": "The shower of rain has settled the dust."}, {"viet": "Quần áo đỏ của người trượt tuyết nổi bật trên tuyết.", "eng": "The skier's red clothes stood out clearly against the snow."}, {"viet": "Những người theo Đảng xã hội đã tiến gần những người Bảo thủ trong cuộc thăm dò dư luận.", "eng": "The Socialists are gaining on the Conservatives in the opinion polls."}, {"viet": "Tiếng hoan hô lắng dần ở xa xa.", "eng": "The sound of the cheering faded away in the distance."}, {"viet": "Tên gián điệp đã đánh cắp các tài liệu mật của chính phủ.", "eng": "The spy stole secret government documents."}, {"viet": "Vết châm của con sứa rất đau đớn.", "eng": "The sting of a jellyfish is very painful."}, {"viet": "Những người đình công đã khước từ sự mua chuộc trở lại làm việc.", "eng": "The strikers refused to be blackmailed into returning to work."}, {"viet": "Mặt trời có cả một hệ các thiên thể bay xung quanh nó.", "eng": "The sun has a whole family of heavenly bodies traveling around it."}, {"viet": "Việc tăng thuế đã tác động tới tất cả chúng ta.", "eng": "The tax increases have affected us all."}, {"viet": "Đội có nhiều nam hơn nữ, cho nên chúng ta phải khôi phục lại thế cân bằng.", "eng": "The team has more men than women so we must redress the balance."}, {"viet": "Các nhà hát đã đóng cửa trong mùa hè.", "eng": "The theatres have closed for the summer."}, {"viet": "Thời gian họp được ấn định vào mười giờ ba mươi.", "eng": "The time appointed for the meeting was 10.30."}, {"viet": "Chiếc đồ chơi người máy tiến lên bằng những bước nhanh, giật giật.", "eng": "The toy robot moved forward with quick jerky steps."}, {"viet": "Lùm cây dưới đó các con vật có thể tìm nơi ẩn náu.", "eng": "The trees whereunder the animals may find shelter."}, {"viet": "Hai lớp học rộng rãi ấy đã được phân cho chúng tôi.", "eng": "The two large classrooms have been assigned to us."}, {"viet": "Công đoàn quyết nghị bãi công với 36 phiếu thuận và 15 phiếu chống.", "eng": "The union resolved to strike by 36 votes to 15."}, {"viet": "Chỉ riêng ý nghĩ về nước mũi khụt khịt cũng làm tôi ghê tởm.", "eng": "The very idea of sniffing glue is repellent to me."}, {"viet": "Bức tường võng xuống vì đất bên dưới nó lún xuống.", "eng": "The wall sagged as the earth beneath it settled."}, {"viet": "Trọng lượng của viên kim cương được đo bằng cara.", "eng": "The weight of a diamonds is measured in carats."}, {"viet": "Gió lay động không ngừng qua các chòm cây.", "eng": "The wind moved restlessly through the trees."}, {"viet": "Các từ trong cuốn từ điển được xếp sắp theo thứ tự vần chữ cái.", "eng": "The words in the dictionary are arranged in alphabetical order."}, {"viet": "Đôi trai gái trẻ đã trốn đi vì cha mẹ không cho phép chúng cưới nhau.", "eng": "The young couple eloped because their parents wouldn't let them marry."}, {"viet": "Thời gian bốn năm họ ở trong trang trại, chiếm đóng nước đó.", "eng": "Their four-year occupation of the farm, that country."}, {"viet": "Sự gắn bó chặt chẽ với tôn giáo của họ.", "eng": "Their strict adherence to their religion."}, {"viet": "Vậy thì cô không phải trả tiền món này.", "eng": "Then you are free of charge for this course."}, {"viet": "Ở thành phố bên có một thư viện rất tốt.", "eng": "There's a very good library in the next town."}, {"viet": "Không có được sự riêng tư trong những căn hộ này vì những cánh cửa sổ rộng và những bức tường mỏng.", "eng": "There's not much privacy in these flats because of the large windows and thin walls."}, {"viet": "Ở đây ít có biểu hiện sống vào buổi tối.", "eng": "There are few signs of life here in the evenings."}, {"viet": "Có nhiều thứ đẹp tôi thấy khó chọn quá.", "eng": "There are so many nice things that I find it hard to choose."}, {"viet": "Đã có rất nhiều sự tuyên truyền chống hút thuốc lá khiến nhiều người đã bỏ hút.", "eng": "There has been so much propaganda against smoking that many people have given it up."}, {"viet": "Có ít cơ hội tuyết rơi.", "eng": "There is a slight chance of snow."}, {"viet": "Hiện nay có nhiều tài liệu về Điện Biên Phủ.", "eng": "There is now extensive literature on Đien Bien Phu."}, {"viet": "Máy bay cất cánh chậm ( mất hai giờ ).", "eng": "There was a delay ( of two hours ) before the plane took off."}, {"viet": "Không có ai nhắc gì đến sự đóng góp của bà ta.", "eng": "There was no mention of her contribution."}, {"viet": "Đêm qua nhà bên cạnh đã xảy ra những chuyện lạ.", "eng": "There were some strange goings-on next door last night."}, {"viet": "Các khâu khác khâu này bao gồm in, xếp, dán, đóng, vào bìa.", "eng": "These different steps include printing, folding, gluing, sewing, and fitting with covers."}, {"viet": "Sự giảm giá này chắc chắn làm tăng yêu cầu sản phẩm của họ.", "eng": "These price cuts are sure to bolster demand for their products."}, {"viet": "Dạo này, họ tỏ ra quá hợm đối với chúng tôi.", "eng": "They're much too upstage for us these days."}, {"viet": "Não cũng cho phép chúng ta suy nghĩ, nhớ lại và mơ mộng, tưởng tượng.", "eng": "They also let us think and remember and build castles in the air."}, {"viet": "Họ đang làm việc để hoàn chỉnh công thức sơn mới của họ.", "eng": "They are working on the perfection of their new paint formula."}, {"viet": "Họ chung tiền nhau nâng đỡ trường.", "eng": "They club together to support the school."}, {"viet": "Dường như họ không có cuốn sách đó.", "eng": "They don't seem to have it."}, {"viet": "Họ có một hướng dẫn viên đưa họ tham quan thành phố.", "eng": "They had a guide to show them the city."}, {"viet": "Họ ngừng máy in lại để đưa một tin cuối.", "eng": "They held the presses to insert a late story."}, {"viet": "Họ xoay xở để lèn bốn chục người vào trong xe buýt.", "eng": "They managed to squash forty people into the bus."}, {"viet": "Họ có tài sản khắp trên thế giới.", "eng": "They possess property all over the world."}, {"viet": "Bọn chúng uy hiếp anh ta phải giao chìa khoá.", "eng": "They scared him into handing over the keys."}, {"viet": "Họ rất khoái chí nhắc cho chúng tôi nhớ lại về sự nghèo đói của chúng tôi.", "eng": "They take great pleasure in reminding us of our poverty."}, {"viet": "Tất cả bọn họ đều tranh nhau để giành được giao kèo mua bán.", "eng": "They were all scrambling to get the bargains."}, {"viet": "Họ đứng dưới sông đâm cá bằng lao.", "eng": "They were standing in the river spearing fish."}, {"viet": "Bản báo cáo này có nhiều chỗ trình bày đáng ngờ.", "eng": "This account contains many arguable statements."}, {"viet": "Nhà thờ này là đối tượng quan tâm chủ yếu của ông ta.", "eng": "This church is the main object of his interest."}, {"viet": "Công ty kinh doanh này bây giờ đang có cơ sở vững chắc và chẳng bao lâu nữa sẽ cho lợi nhuận.", "eng": "This enterprise is now on a firm footing and should soon show profits."}, {"viet": "Đây là một bức tranh phong cảnh theo phong cách phác họa tự do.", "eng": "This is a landscape painting in the freesketch style."}, {"viet": "Đây là lần thứ ba trong tuần anh đi làm muộn, điều đó thật không ổn, tôi sợ là như vậy.", "eng": "This is the third time you've been late for work this week, it simply won't do, I'm afraid."}, {"viet": "Âm nhạc này nghe sẽ dân tộc hơn nếu anh chơi nó trên trống thiếc.", "eng": "This music would sound more ethnic if you played it on steel drums."}, {"viet": "Nhà chính trị này có nhiều người ủng hộ ở miền Bắc.", "eng": "This politician has quite a large following in the North."}, {"viet": "Mẫu vật này lốm đốm nhiều màu sắc.", "eng": "This specimen is richly variegated in colour."}, {"viet": "Loại đá trắng này là một loại đá vôi mà chúng ta gọi là đá phấn.", "eng": "This white rock is a kind of limestone that we call chalk."}, {"viet": "Tổng cộng là ba trăm đô la Canada.", "eng": "Three hundred Canadian dollars in all."}, {"viet": "Ngày mai sẽ có nắng và gió vừa phải.", "eng": "Tomorrow will be sunny with a moderate breeze."}, {"viet": "Trừ phi hợp đồng được ký ngay tức khắc, tôi rút lại giá chào hàng của tôi.", "eng": "Unless the contract is signed immediately, I shall withdraw my offer."}, {"viet": "Những tiện nghi tắm rửa, bưu vụ, mua hàng, ngân hàng, v. v.", "eng": "Washing, postal, shopping, banking, etc facilities."}, {"viet": "Chúng tôi sẽ tiếp tục lái xe khi trời còn sáng.", "eng": "We'll keep on driving while there's still daylight."}, {"viet": "Chúng tôi bất đồng ý kiến ( với ban giám đốc ) về mức lương cho công việc làm thêm ngoài giờ.", "eng": "We're in dispute ( with the management ) about overtime rates."}, {"viet": "Chúng tôi đã quyết định bãi bỏ giới hạn tuổi đối với người xin việc trong trường hợp của anh.", "eng": "We've decided to waive the age-limit for applicants in your case."}, {"viet": "Tất cả chúng tôi đều góp tiền mua quà cho Richard.", "eng": "We all contributed money to buy Richard's present."}, {"viet": "Chúng ta không được phép đá bóng ở đây.", "eng": "We are not supposed to play football here."}, {"viet": "Chúng tôi bó lại một số quần áo cũ để đem đi bán gây quỹ cứu tế.", "eng": "We bundled up some old clothes for the jumble sale."}, {"viet": "Chúng ta chỉ có thể thành công nếu mỗi người trong đội đảm đương phần việc của mình.", "eng": "We can succeed only if everyone in the team pulls his weight."}, {"viet": "Chúng tôi lấy làm tiếc về tính chất châm chọc của những nhận xét của anh ta.", "eng": "We deplore the vitriolic nature of his remarks."}, {"viet": "Chúng tôi đã thất bại nhưng nhờ nhận thức ra được nên bây giờ tôi mới thấy chúng tôi đã sai lầm chỗ nào.", "eng": "We failed, and with the benefit of hindsight I now see where we went wrong."}, {"viet": "Chúng tôi đã hi vọng họ vẫn còn sống nhưng bây giờ thì hết hi vọng rồi.", "eng": "We had hoped they were still alive but we're losing heart now."}, {"viet": "Chúng tôi ăn tối lúc 7 giờ.", "eng": "We have dinner at seven o'clock."}, {"viet": "Chúng tôi không có đủ tiền, nhưng chúng tôi sẽ xoay.", "eng": "We haven't got enough money, but we'll get it somehow."}, {"viet": "Chúng tôi sẽ thu xếp cho ông dọn sang phòng khác.", "eng": "We'll arrange you to another room."}, {"viet": "Ta phải để ý đến tình cảm của người khác.", "eng": "We must consider the feelings of others."}, {"viet": "Chúng tôi cần vài đối tượng nam giới cho một cuộc thí nghiệm tâm lý học.", "eng": "We need some male subjects for a psychology experiment."}, {"viet": "Chúng tôi đã ra khơi và bờ biển lùi dần vào xa xa.", "eng": "We reached the open sea and the coast receded into the distance."}, {"viet": "Chúng ta nên sắp xếp mọi thứ ngăn nắp trước khi rời đi.", "eng": "We should arrange everything square before we leave."}, {"viet": "Chúng tôi vận chuyển hàng hoá bằng xe tải.", "eng": "We transport our goods by means of lorries."}, {"viet": "Tất cả chúng tôi bị nhược người vì cái nóng cùng cực.", "eng": "We were all debilitated by the extreme heat."}, {"viet": "Chúng tôi không hài lòng với thức ăn ở nhà hàng.", "eng": "We were very dissatisfied with the food at the restaurant."}, {"viet": "Cân các thành phần pha chế trước khi bắt đầu làm bánh ngọt.", "eng": "Weigh out all the ingredients before you start making the cake."}, {"viet": "Vậy thì phải nói rằng ông là người chần chừ.", "eng": "Well, let's just say you're hesitating."}, {"viet": "Trong chậu tắm có cái gì bẩn thế này?", "eng": "What's all that grunge in the bath tub?"}, {"viet": "Một số công ty lớn ở Silicon Valley là những công ty nào?", "eng": "What are some of the big companies in Silicon Valley?"}, {"viet": "Nó nói gì. \"Chặn đứng\", \"Giao bóng\" à?", "eng": "What did he say \"shortstop\", first base?"}, {"viet": "Cách thức thưa gửi mà người ta thường dùng khi viết thư cho ông giám mục là thế nào?", "eng": "What form of address should one use when writing to a bishop?"}, {"viet": "Ở nước bạn, thú tiêu khiển được ưa chuộng nhất là gì?", "eng": "What is the most popular pastime in your country?"}, {"viet": "Bạn đang dự định trò gì để lừa người ta vậy?", "eng": "What kind of tricks are you planning to trick people with?"}, {"viet": "Anh ta nghĩ chúng tôi là hạng người nào?", "eng": "What sort of people does he think we are?"}, {"viet": "Đồ gốm chế tạo bằng bàn xoay có niên đại cách đây 4500 năm đã được tìm thấy trong di chỉ các thành phố cổ thuộc vùng Cận Đông.", "eng": "Wheel made pottery dating back more than 4,500 years has been found in the ruins of ancient cities in the Near East."}, {"viet": "Khi anh ta nói với người dân địa phương, anh ta chuyển sang thổ ngữ.", "eng": "When he talked to the local people, he lapsed into the vernacular."}, {"viet": "Khi những lời yêu cầu lịch sự không ăn thua, Paul chuyển sang đe doạ.", "eng": "When polite request failed, Paul resorted to threats."}, {"viet": "Khi giết được, họ đem về hang và nấu nướng.", "eng": "When they killed an animal, they brought it to the cave and cooked it."}, {"viet": "Cháu sẽ lưu lại ở đâu?", "eng": "Where are you going to stay?"}, {"viet": "Tôi phải bấm nút nào để mở rađiô?", "eng": "Which button do I press to turn the radio on?"}, {"viet": "Anh cho là đội nào đoạt chức vô địch?", "eng": "Which team would you tip to win the championship?"}, {"viet": "Ai là người đầu tiên kế vị ngôi vua?", "eng": "Who is first in succession to the throne?"}, {"viet": "Tại sao một số trẻ em lại cứ thích lội bì bõm trong các vũng nước?", "eng": "Why do some children like slopping around in puddles?"}, {"viet": "Trong tình trạng bị giam cầm, thú vật hoang dã không sinh đẻ tốt được.", "eng": "Wild animals don't breed well in captivity."}, {"viet": "Mời ông lên văn phòng ông Green?", "eng": "Will you please go up to Mr. Green's office?"}, {"viet": "Nếu có đủ rượu thì tôi có thể chịu được cái rét này.", "eng": "With enough antifreeze. I can stand the cold."}, {"viet": "Công nhân đã biểu thị sự phản đối các kế hoạch.", "eng": "Workers have already demonstrated their opposition to the plans."}, {"viet": "Anh dùng rượu vang nhé, Không, tôi vẫn thích dùng bia, cảm ơn.", "eng": "Would you like some wine, No, I'll stick to beer, thanks."}, {"viet": "Xin bà vui lòng để các túi xách lên bàn cân?", "eng": "Would you please put the bags on the scale?"}, {"viet": "Được, nhưng tôi hy vọng là nó hướng ra phía đầu máy.", "eng": "Yes, but I hope it faces the engine."}, {"viet": "Vâng, chúng tôi là một ngân hàng thương mại được uỷ quyền và có thể đổi chúng cho ông.", "eng": "Yes, we are an authorized foreign exchange bank and can change them for you."}, {"viet": "Anh sẽ phải quyết đoán hơn nếu anh muốn làm tốt công việc kinh doanh.", "eng": "You'll have to be more decisive if you want to do well in business."}, {"viet": "Anh không thật nhất quán: ban đầu anh lên án tôi, rồi sau đó anh lại ca ngợi tôi.", "eng": "You're not very consistent: first you condemn me, then you praise me."}, {"viet": "Anh được mời làm một người bảo trợ cho Nhà tế bần Bristol.", "eng": "You are invited to become a Friend of the Bristol Hospice."}, {"viet": "Anh không thể tách mình ra khỏi thế giới được.", "eng": "You can't seclude yourself from the world."}, {"viet": "Chị có thể trả bằng thẻ tín dụng.", "eng": "You can pay by credit card."}, {"viet": "Cậu đã không nhắm mắt trước lúc đọc lời ước, cho nên nó không nghiệm!", "eng": "You didn't shut your eyes before you made the wish, so it doesn't count!"}, {"viet": "Con còn những ba năm nữa mới phải nghĩ đến chuyện đó.", "eng": "You have three more years to think about it."}, {"viet": "Ông khiển trách tôi trước mặt mọi người làm tôi bẽ mặt quá.", "eng": "You made me look so small, correcting me in front of everybody."}, {"viet": "Anh phải biết phân biệt giữa cái phải với cái trái.", "eng": "You must learn the difference between right and wrong."}, {"viet": "Anh mắc nợ nhiều và bây giờ là lúc phải thanh toán ( với các chủ nợ của anh ).", "eng": "You owe a lot and it's now time to settle ( with your creditors )."}, {"viet": "Anh nên xem dụng cụ nó mang theo khi nó đi leo núi!", "eng": "You should see the clobber he takes when he goes climbing!"}, {"viet": "Sáng nay anh ta đến chậm một giờ, sao thế?", "eng": "You were an hour late this morning, how come?"}, {"viet": "Những người trẻ tuổi mà đạo đức đã bị hư hỏng.", "eng": "Young people whose morals have been corrupted."}, {"viet": "Nhược điểm duy nhất của anh ấy là không tập trung.", "eng": "Your only fault is that you won't concentrate."}]