[{"viet": "Một số tiền thưởng 1.000 bảng Anh dành cho việc trả lại bức tranh bị mất cắp.", "eng": "A £ 1,000 reward has been offered for the return of the stolen painting."}, {"viet": "Con mèo đang tận hưởng ánh nắng ấm áp.", "eng": "A cat is luxuriating in the warm sunshine."}, {"viet": "Một bản báo cáo kế tiếp về việc giới hạn vũ khí.", "eng": "A coming report on arms limitation."}, {"viet": "Một tội ác đè nặng lương tâm của ai.", "eng": "A crime lying heavy on one's conscience."}, {"viet": "Một nhà ngoại giao bị thế lực ngoại bang làm biến chất.", "eng": "A diplomat subverted by foreign power."}, {"viet": "Một công tắc đèn bị hỏng phát ra những tia lửa điện.", "eng": "A faulty light switch sending out sparks."}, {"viet": "Một lực lượng tăng lên do được bổ sung quân nhân từ các đạo quân đồng minh.", "eng": "A force swelled by increments from allied armies."}, {"viet": "Một thanh niên trông đẹp trai nhưng vô duyên.", "eng": "A good looking but insipid young man."}, {"viet": "Một tay cầm đã được buộc vào cái hộp.", "eng": "A handle had been wired on to the box."}, {"viet": "Một ngọn sóng lớn tràn nhanh qua boong tàu.", "eng": "A huge wave swept over the deck."}, {"viet": "Một đạo luật được thảo thiên về chủ sở hữu đất.", "eng": "A law weighted towards those owning land."}, {"viet": "Một chặng leo đồi dài cực nhọc trong cuộc đua xe đạp.", "eng": "A long uphill grind in a cycle race."}, {"viet": "Thuốc lá marijuana là một loại \"thuốc pha cần sa\".", "eng": "A marijuana cigarette is a \"joint\"."}, {"viet": "Miếng thức ăn đầy mồm làm sặc rồi.", "eng": "A mouthful of food went down the wrong way."}, {"viet": "Một dấu hiệu bất hòa đã len vào mối quan hệ của họ.", "eng": "A note of discord crept into their relationship."}, {"viet": "Tiền hưu trí thường có thể chuyển qua phương thức trả một lần.", "eng": "A pension is often commutable into a lump sum."}, {"viet": "Một dạng quá khứ xa của ngữ động từ.", "eng": "A pluperfect form of a verb phrase."}, {"viet": "Một sản phẩm gắn liền với sự lỗi thời.", "eng": "A product with built-in obsolescence."}, {"viet": "Sự nhẩm lại những điều nó có lẽ sẽ nói.", "eng": "A rehearsal of what he would say."}, {"viet": "Hạ cánh an toàn về lại Mỹ nhé.", "eng": "A safe landing back in the States."}, {"viet": "Một điều làm lung lay những tín ngưỡng và truyền thống lâu đời.", "eng": "A shaker of longheld beliefs and traditions."}, {"viet": "Một chiếc xe nhỏ là cần có vì giá xăng cao quá.", "eng": "A smaller car is necessitated by the high price of petrol."}, {"viet": "Một công việc nghiên cứu các nguyên nhân về ung thư gây ngạc nhiên.", "eng": "A startling piece of research into the causes on cancer."}, {"viet": "Đoạn kết bất ngờ là đặc tính một truyện ngắn của O. Henry.", "eng": "A surprise ending is the signature of an O. Henry short story."}, {"viet": "Một đứa trẻ mới chập chững biết đi là một người thực sự đi lảo đảo trong các chuyến đi bằng máy bay.", "eng": "A toddler who was a real wriggler on plane trips."}, {"viet": "Một giọng nói oang oang bên tai của tôi.", "eng": "A voice thundered in my ear."}, {"viet": "Một mảng sờn ở khuỷu tay áo len.", "eng": "A worn patch on the elbow of a sweater."}, {"viet": "Hành động xuất phát từ những động cơ lý trí hơn là tình cảm.", "eng": "Act from rational motives rather than sentiment."}, {"viet": "Sau một ngày làm việc vất vả, bà ta cảm thấy có quyền được nghỉ ngơi.", "eng": "After a hard day's work she felt entitled to a rest."}, {"viet": "Sau khi thất cử đảng đó thôi ủng hộ vị lãnh đạo của họ.", "eng": "After losing the election the party threw their leader overboard."}, {"viet": "Sau vụ cướp, cảnh sát tức khắc truy lùng.", "eng": "After the robbery, the police immediately gave chase."}, {"viet": "Mọi chi phí sẽ được hoàn trả cho bạn.", "eng": "All expenses will be reimbursed to you."}, {"viet": "Mặt của hắn cắt không còn chút máu.", "eng": "All the blood drained from his face."}, {"viet": "Hầu như ngay khi con người đếm mặt trời hay đêm tối, thì họ đã nhận ra sự biến đổi của mặt trăng.", "eng": "Almost as soon as people counted suns or darks, they must have noticed the changes in the moon."}, {"viet": "Một sự lạm dụng lòng tin, đặc quyền, quyền hành.", "eng": "An abuse of trust, privilege, authority."}, {"viet": "Người bán hàng hướng dẫn cách vận hành máy giặt cho khách hàng.", "eng": "An assistant demonstrated the washing machine to customers."}, {"viet": "Ấn bản một quyển tiểu thuyết đã được sàng lọc.", "eng": "An expurgated edition of a novel."}, {"viet": "Một sĩ quan được thuyên chuyển từ lực lượng lính thủy đánh bộ sang Bộ Tổng Tham mưu.", "eng": "An officer seconded from the Marines to staff headquarters."}, {"viet": "Một chiếc áo đầm hợp thời trang.", "eng": "An up-to-the-minute dress."}, {"viet": "Ann mê say nghề đóng phim.", "eng": "Ann has stars in her eyes."}, {"viet": "Người ta đã yêu cầu tòa án mở một cuộc điều tra về tài sản của con nợ.", "eng": "Application has been made to the court for an inquiry into the debtor's assets."}, {"viet": "Phải chăng chúng tôi buộc phải coi như là anh từ chối hợp tác?", "eng": "Are we to take it that you refuse to co-operate?"}, {"viet": "Anh có biết chắc là công việc đòi hỏi cái gì không?", "eng": "Are you quite clear about what the job involves?"}, {"viet": "Họ đùa cợt tạt một xô nước vào anh ta.", "eng": "As a joke, they doused him with a bucket of water."}, {"viet": "Khi thiết bị được nối dây xong thì anh có thể sử dụng được nó ngay.", "eng": "As soon as the equipment is wired up, you can use it."}, {"viet": "Ở tuổi chín mươi ba ông cụ mới nhận thức được rằng mình không còn phong độ như trước.", "eng": "At 93 he's finally realized he's getting past it."}, {"viet": "Ở tuổi 22 anh ta chỉ mới bắt đầu thấy rõ năng lực của mình.", "eng": "At twenty-two, he's just beginning to find himself."}, {"viet": "Phá sản là một hiện tượng phổ biến trong một thời kỳ suy thoái kinh tế.", "eng": "Bankruptcy is a common phenomenon in an economic recession."}, {"viet": "Làm ăn sòng phẳng với ai.", "eng": "Be just on one's dealings with somebody."}, {"viet": "Thịt bò bít-tết là một món ăn phổ biến ở phương Tây, phần lớn khách hàng, nhất là người nước ngoài, rất thích ăn món này.", "eng": "Beefsteak is a popular dish in the west, and most customers, especially foreigners, like to eat it."}, {"viet": "Những thay đổi lớn lao sắp xảy ra.", "eng": "Big changes are in the wind."}, {"viet": "Cả nam và nữ diễn viên chính đều diễn như thể họ chán chường nhau lắm.", "eng": "Both the leading man and woman acted as if they were bored to death with each other."}, {"viet": "Xây một bức tường ngăn giữa vườn nhà tôi và vườn người hàng xóm.", "eng": "Build a wall between my garden and my neighbour's."}, {"viet": "Nhưng con cần biết tin tức để cho việc học hành.", "eng": "But I need to know about the news for school."}, {"viet": "Nhưng bố không thể mong đợi công ty Sunrise giải quyết vấn đề đó!", "eng": "But you can't expect Sunrise to solve the problem!"}, {"viet": "À này, gần đây bạn có xem bộ phim nào không?", "eng": "By the way, have you seen any movies recently?"}, {"viet": "Vui lòng bán cho tôi một lon coca-cola không có caphein?", "eng": "Can I have caffeine-free coke please?"}, {"viet": "Anh có thể đổi có sang tiền bảng Anh cho tôi và nhờ đổi một ít sang nhân dân tệ được không?", "eng": "Can you cash it into pounds I changed into Renminbi Yuan?"}, {"viet": "Bạn có thể đọc cái đó có vần được không?", "eng": "Can you put that into rhyme?"}, {"viet": "Ông không thể nán lại nói chuyện thêm một lát nữa à?", "eng": "Can't you stay and talk a little longer?"}, {"viet": "Những ngày nghỉ có thể bị xáo trộn.", "eng": "Chaotic as holidays are wont to be."}, {"viet": "Chỉ còn một tuần lễ nữa là đến lễ Giáng sinh.", "eng": "Christmas is only a week away."}, {"viet": "Nhặt vỏ sò trên bãi biển.", "eng": "Collecting sea-shells on the beach."}, {"viet": "Mối quan tâm về số phận của đoàn thám hiểm mất tích đang tăng lên.", "eng": "Concern is mounting over the fate of the lost expedition."}, {"viet": "Hấp bánh ba tê 20 phút trong cái lò được xông nóng trước.", "eng": "Cook the pie for 20 minutes in a pre-heated oven."}, {"viet": "Cô có thể hát tặng chúng tôi một bài hát không?", "eng": "Could you oblige us with a song?"}, {"viet": "Các nhà phê bình đã chỉ trích hắn vì sự rồ dại của hắn.", "eng": "Critics scored him for his foolishness."}, {"viet": "Giải quyết mối bất đồng trong đảng.", "eng": "Deal with dissension in the party."}, {"viet": "Tuyệt vọng là nguồn gốc của bạo loạn.", "eng": "Despair is the parent of rebellion."}, {"viet": "Cậu có tìm được cây bút đã mất hay không?", "eng": "Did you find the pen you lost?"}, {"viet": "Hướng quảng cáo của mình về phía đông đảo khán giả hơn.", "eng": "Direct one's advertising at a wider audience."}, {"viet": "Ở nước bạn, nam và nữ có nhận lương bằng nhau cho cùng một công việc không?", "eng": "Do men and women receive equal pay for the same job in your country?"}, {"viet": "Ở nước bạn có tổ chức ăn mừng lễ Phục Sinh không?", "eng": "Do you celebrate Easter in your home country?"}, {"viet": "Cô có rảnh giờ nào ở New York không?", "eng": "Do you have any free time in New York?"}, {"viet": "Bạn có biết tờ báo nào có số phát hành nhiều nhất ở Nhật Bản không?", "eng": "Do you know which newspaper has the largest circulation in Japan?"}, {"viet": "Bạn có nhớ là bạn ở đâu vào tháng 5 năm 1970 không?", "eng": "Do you remember where you were in May, nineteen seventy?"}, {"viet": "Bạn có thường đi nhà thờ vào chủ nhật không?", "eng": "Do you usually go to church on Sundays?"}, {"viet": "Có phải cái nắp này vặn để đậy không, hay là ta phải ấn xuống?", "eng": "Does this lid screw on, or does one press it down?"}, {"viet": "Đừng có giận dữ quá mức.", "eng": "Don't carry your anger to excess."}, {"viet": "Đừng có tin ngay vào lời hồ đồ của ông ta: anh hãy tự tìm hiểu.", "eng": "Don't just accept his say-so: find out for yourself."}, {"viet": "Đừng ký bất cứ thứ gì trước khi tham khảo ý kiến một luật sư.", "eng": "Don't sign anything until you've consulted a lawyer."}, {"viet": "Bộ anh không dám rời khỏi phòng sao!", "eng": "Don't you dare leave that room!"}, {"viet": "Nghiện ma tuý là một ảnh hưởng tai hại trong xã hội.", "eng": "Drug addiction is a dangerous canker in society."}, {"viet": "Những nỗ lực nhằm khái niệm hóa lịch sử và cấu trúc của vũ trụ.", "eng": "Efforts to conceptualize history and structure of universe."}, {"viet": "Môi trường quyết định sự phát triển của một con vật.", "eng": "Environment conditions an animal's development."}, {"viet": "Mọi người trong gia đình tôi đều uống rượu được.", "eng": "Everyone in my family can hold their liquor."}, {"viet": "Xin lỗi, tôi nên gửi những món đồ quý của mình ở đâu?", "eng": "Excuse me, where do I check my valuables?"}, {"viet": "Tập làm quen với một ngoại ngữ.", "eng": "Familiarizing oneself with a foreign language."}, {"viet": "Ít có những thành phố lớn nhất của nước này là thủ phủ của tiểu bang; chẳng hạn như cả New York lẫn Chicago đều không phải là nơi tọa lạc của chính quyền tiểu bang của nó.", "eng": "Few of the nation's largest cities are state capitals; thus neither New York nor Chicago is the seat of its state's government."}, {"viet": "Thoạt tiên cô ta đồng ý đi chơi với tôi, sau đó cô ta lại bỏ rơi tôi.", "eng": "First she agreed to come out with me, then she stood me up."}, {"viet": "Theo các báo cáo về việc sử dụng ma túy ở một trường nội trú, vài nam sinh lớp lớn đã bị đuổi học.", "eng": "Following reports of drug-taking at a boarding school, several senior boys have been expelled."}, {"viet": "Những cánh rừng trải rộng cả hàng trăm dặm Anh.", "eng": "Forests stretching for hundreds of miles."}, {"viet": "Dân lánh nạn từ một nước bị chiến tranh tàn phá.", "eng": "Fugitives from a country ravaged by war."}, {"viet": "Có một văn bằng kinh tế hạng nhì bậc cao.", "eng": "Get an upper second in economics."}, {"viet": "Cho ai một cái đá vào mông.", "eng": "Give somebody a kick up the backside."}, {"viet": "Hãy đi dự tiệc trong bộ đồ đẹp nhất của bạn.", "eng": "Go to the party in your Sunday best."}, {"viet": "Lính gác xua chó ra tấn công những người tù tìm đường tẩu thoát.", "eng": "Guards set dogs upon the escaping prisoners."}, {"viet": "Cô ta đi Pari vì công việc hay tiêu khiển?", "eng": "Has she gone to Paris on business or for pleasure?"}, {"viet": "Bạn có bao giờ xem một vở kịch Kabuki chưa?", "eng": "Have you ever attended a Kabuki play?"}, {"viet": "Anh đã nhìn dưới gầm giường chưa?", "eng": "Have you looked under the bed?"}, {"viet": "Nó rất muốn chơi cho đội bóng của trường nhưng chẳng bao giờ có cơ hội được tham gia.", "eng": "He'd love to play for the school team but he never gets a look-in."}, {"viet": "Ông ta luôn luôn trích dẫn các tiết trong Kinh Thánh.", "eng": "He's always quoting verses from the Bible."}, {"viet": "Ông ấy lại sắp lấy vợ lần nữa, sau hai lần li dị, vì thế ông ấy chẳng học hỏi được gì qua kinh nghiệm.", "eng": "He's getting married again, after two divorces, so he obviously hasn't profited by his experience."}, {"viet": "Nó không phải loại người anh có thể thuyết phục được đâu.", "eng": "He's not the sort of man you can put one over on."}, {"viet": "Anh ta dùng sức hấp dẫn của mình để cố lợi dụng cô ấy.", "eng": "He's using his charm to try to take advantage of her."}, {"viet": "Anh ấy và vợ rất xứng đôi với nhau.", "eng": "He and his wife are well suited to each other."}, {"viet": "Hắn đã làm hỏng nó vì đến chậm cuộc phỏng vấn.", "eng": "He blew it by arriving late for the interview."}, {"viet": "Ông ấy có thể sáng tác nhạc thật sự khích động.", "eng": "He can write music that really swings."}, {"viet": "Kết cục anh ta có thể bị chết hoặc bị thương nặng.", "eng": "He could finish up dead or badly injured."}, {"viet": "Anh ta phải ngồi tù lâu vì tội mưu sát.", "eng": "He did a long stretch for attempted murder."}, {"viet": "Ông ta không hiểu tiếng Hy Lạp cho nên tôi ngỏ ý giúp phiên dịch.", "eng": "He doesn't understand Greek, so I offered to translate."}, {"viet": "Anh ấy cảm thấy cần phải có sự chỉ dẫn rõ ràng.", "eng": "He feels the need for firm direction."}, {"viet": "Ông ta nhận thấy cuộc sống ở tỉnh chán ngắt.", "eng": "He found life in the provinces boring."}, {"viet": "Nó tìm được một công việc làm vườn bán thời gian.", "eng": "He got a part-time job as a gardener."}, {"viet": "Nó định lập một kỷ lục thế giới mới nhưng lại bị thời tiết xấu ngăn trở.", "eng": "He had hoped to set a new world record but was frustrated by bad weather."}, {"viet": "Hắn có quan niệm là đội mũ làm cho đàn ông hói đầu.", "eng": "He has a theory that wearing hats makes men go bald."}, {"viet": "Anh ta không có lòng tự trọng nếu anh ta để lũ con nói với anh ta một cách thô lỗ như vậy.", "eng": "He has no pride if he lets the children talk to him so rudely."}, {"viet": "Nó đập cái đó bằng búa.", "eng": "He hit it with a hammer."}, {"viet": "Anh ta thường bị báo chí trích dẫn sai.", "eng": "He is frequently misquoted in the press."}, {"viet": "Anh ta kiên trì đeo đuổi những mục đích của mình.", "eng": "He is unswerving in pursuit of his aims."}, {"viet": "Anh ta nằm ườn ra trên bàn giấy.", "eng": "He lay in a sprawl over the desk."}, {"viet": "Nó trông phiền muộn nhưng khi bạn bè đến thì nó vui hẳn lên.", "eng": "He looked depressed but perked up when his friends arrived."}, {"viet": "Nó tìm cách tránh né rửa bát.", "eng": "He managed to skip the washing-up."}, {"viet": "Anh ta gật đầu chào mừng tôi.", "eng": "He nodded a welcome to me."}, {"viet": "Ông ấy càng về già càng ít chơi dương cầm.", "eng": "He played the piano less and less as he grew older."}, {"viet": "Ông ta trừng phạt lũ trẻ về tội cẩu thả bằng cách bắt chúng trả tiền bồi thường thiệt hại.", "eng": "He punished the children for their carelessness by making them pay for the damage."}, {"viet": "Anh ta đã nhận được một giải Ôxca về diễn xuất.", "eng": "He received an Oscar for his performance."}, {"viet": "Nó xoay xoay cây bút chì giữa các ngón tay.", "eng": "He rolled a pencil between his fingers."}, {"viet": "Ông ta luôn lấy lòng thủ trưởng.", "eng": "He's always making up to the boss."}, {"viet": "Anh ta lệ thuộc quá nhiều vào các khoản tiền vay ngân hàng.", "eng": "He's heavily reliant on bank loans."}, {"viet": "Anh ta hối tiếc cái ngày anh ta đã gia nhập quân đội!", "eng": "He's rueing the day he joined the Army!"}, {"viet": "Hắn ngồi nhìn trừng trừng đối thủ.", "eng": "He sat glowering at his opponent."}, {"viet": "Anh ta nhìn thấy những khách sạn và những nhà hàng đang xây dựng.", "eng": "He sees hotels and restaurants abuilding."}, {"viet": "Nó tát cô em gái, cô em bèn đá lại nó để trả đũa.", "eng": "He slapped his sister, who retaliated by kicking him."}, {"viet": "Anh ta chạy rút vượt qua các vận động viên khác ngay trước khi chạm băng đích.", "eng": "He sprinted past the other runners just before reaching the tape."}, {"viet": "Anh ta bị va đầu vào xà nhà.", "eng": "He struck the beam with his head."}, {"viet": "Rồi anh ta bắt đầu tán tỉnh tôi.", "eng": "He then started to get fresh with me."}, {"viet": "Anh ta không chú ý đến đề nghị của chúng tôi, anh ta gạt chúng tôi sang một bên và nói sang một chuyện khác.", "eng": "He took no notice by our suggestions, he fobbed us off and talked of something else."}, {"viet": "Anh ta biến kiến thức thành điều kiện thuận lợi.", "eng": "He turned his knowledge to good account."}, {"viet": "Ông ta muốn tôi bỏ phiếu cho ông ta nhưng tôi đã nói với ông ấy chẳng mang lại kết quả gì đâu.", "eng": "He wanted me to vote for him, but I told him no soap."}, {"viet": "Ông ta được bổ nhiệm vào chức tổng giám đốc.", "eng": "He was appointed to the post of general manager."}, {"viet": "Ông ta hoàn toàn bị áp đảo trong chiến dịch của mình nhằm tranh thủ sự ủng hộ của các bộ trưởng khác.", "eng": "He was completely outmanoeuvred in his campaign to win the support of other ministers."}, {"viet": "Ông ta đã được bổ nhiệm về một trung đoàn mới.", "eng": "He was gazetted to a new regiment."}, {"viet": "Anh ta nằm trên trường kỷ xem TV.", "eng": "He was lying on the sofa watching TV."}, {"viet": "Ông ấy hoàn toàn cởi mở về những lý do ra đi của mình.", "eng": "He was quite open about his reasons for leaving."}, {"viet": "Ông ta nhanh chóng lên án bạo lực.", "eng": "He was swift in condemning the violence."}, {"viet": "Anh ta bị thương trong khi thực hiện nhiệm vụ.", "eng": "He was wounded in the pursuance of his duty."}, {"viet": "Nó sẽ chẳng bao giờ thành công cho dù nó phấn đấu thế nào đi nữa.", "eng": "He will never succeed however hard he tries."}, {"viet": "Anh ta vật ngã đối thủ xuống sàn.", "eng": "He wrestled his opponent to the floor."}, {"viet": "Đi mà lấy đi, còn một chiếc bánh nữa ở trong tủ lạnh ấy.", "eng": "Help there's a whole nother pie in the fridge."}, {"viet": "Bạn của anh cô ta đã đưa cô ta về nhà.", "eng": "Her brother's friend escorted her home."}, {"viet": "Sự không quan tâm của cố ấy đối với nghệ thuật là do dốt nát.", "eng": "Her disinterest in art was due to ignorance."}, {"viet": "Lần đầu tiên trông thấy kim tự tháp lòng cô đầy sự thán phục.", "eng": "Her first view of the pyramids filled her with awe."}, {"viet": "Bệnh tình của cô ta chỉ là một phương kế để tránh gặp anh ấy.", "eng": "Her illness is merely a device to avoid seeing him."}, {"viet": "Dường như đầu óc cô ta đang vẩn vơ đâu đó và cô ta chẳng nhận ra chúng tôi.", "eng": "Her mind seemed to be wandering, and she didn't recognize us."}, {"viet": "Cuối cùng sự kiên nhẫn của cô ta cũng tan biến.", "eng": "Her patience was at last worn out."}, {"viet": "Lễ cưới lần thứ hai của bà ta được tổ chức ở nhà thờ Thánh Giôn.", "eng": "Her second marriage was took place in St John's Church."}, {"viet": "Những âm cao của cô ấy hơi run.", "eng": "Her top notes quavered a little."}, {"viet": "Đây là đơn xin chuyển tiền.", "eng": "Here is the application form for remittance."}, {"viet": "Sự phân tích vấn đề của ông ta cho thấy một sự hiểu biết rộng.", "eng": "His analysis of the problem showed great perception."}, {"viet": "Khi đi cái mông anh ta núng nính rất buồn cười.", "eng": "His bottom waggles in a funny way when he walks."}, {"viet": "Lòng dũng cảm của anh là bài học cho tất cả chúng ta.", "eng": "His courage is a lesson to us all."}, {"viet": "Mắt hắn gần như nổ tung ra khi hắn thấy số tiền mà hắn đã thắng.", "eng": "His eyes nearly popped out of his head when he saw what he had won."}, {"viet": "Tương lai của anh ta chưa được xác định, nhưng có lẽ anh ta sẽ học ngành y.", "eng": "His future has not been determined, but he may study medicine."}, {"viet": "Những nhận xét có tính thóa mạ của anh ta không phản ánh ý kiến của cả nhóm.", "eng": "His insulting remarks are not reflective of group's opinions."}, {"viet": "Kỉ niệm về ông luôn được ghi nhớ trong lòng nhân dân ông.", "eng": "His memory is embalmed in the hearts of his people."}, {"viet": "Bố mẹ anh ta có ý định đưa anh ta vào giáo đoàn.", "eng": "His parents intended him for the ministry."}, {"viet": "Hồ sơ của anh ta về công vụ không có một dấu vết gì khả nghi hoặc bê bối.", "eng": "His record of public service is untouched by any stain of shadiness or sleaze."}, {"viet": "Bài diễn văn của ông ta nghe như kiểu một lời biện bạch.", "eng": "His speech was in the nature of an apology."}, {"viet": "Sự kiên nhẫn, vui vẻ, tận tuỵ, v. v. bền bỉ của anh ta.", "eng": "His unfailing patience, good humour, devotion, etc."}, {"viet": "Đi nhờ xe qua Pháp tới Tây Ban Nha.", "eng": "Hitch-hike through France to Spain."}, {"viet": "Cưỡi ngựa là một việc được yêu thích nhưng là một môn thể thao đắt tiền hơn, và có những đồng cỏ dành cho người đi nghỉ ở Texas và các tiểu bang khác ở biên giới, ở đó bạn có thể ở lại-phải trả tiền-và sống cuộc sống của một nam hoặc nữ cao bồi.", "eng": "Horseback riding is a favorite but more expensive sport, and there are dude ranches in Texas and other border states where you can stay-at a price-and live the life of a cowboy or cowgirl."}, {"viet": "Làm sao tôi có thể tin anh được nếu anh vẫn nói dối tôi?", "eng": "How can I trust you if you keep lying to me?"}, {"viet": "Mẹ cô đã gặp cha cô như thế nào, Louise?", "eng": "How did your mother meet your father, Louise?"}, {"viet": "Chuyến bay hôm nay có đủ khách không?", "eng": "How full is today's flight?"}, {"viet": "Có bao nhiêu nam học sinh trong lớp bạn ở trường?", "eng": "How many boys are there in your class at school?"}, {"viet": "Anh đến đó mấy lần rồi?", "eng": "How many times have you been there?"}, {"viet": "Bạn sẽ trả cho tôi bao nhiêu vậy?", "eng": "How much will you pay me?"}, {"viet": "Mô người do các tế bào tạo nên.", "eng": "Human tissue is made up of cells."}, {"viet": "Tôi muốn đặt trước một bàn dành cho hai người vào tối nay.", "eng": "I'd like to book a table for two this evening."}, {"viet": "Tôi sẽ nhờ luật sư của tôi soạn thảo một chứng từ sang nhượng.", "eng": "I'll ask my solicitor to make a deed of transfer."}, {"viet": "Tôi sẽ phải bỏ buổi họp ngày mai.", "eng": "I'll have to miss the meeting tomorrow."}, {"viet": "Tôi sẽ nói cho anh biết chúng tôi đang có kế hoạch gì cho ngày sinh của Jane, chừng nào anh hứa không để lộ ra.", "eng": "I'll tell you what we're planning for Jane's birthday as long as you promise not to reveal the game."}, {"viet": "Tôi đang nướng một chiếc bánh mừng sinh nhật cho Alex.", "eng": "I'm baking Alex a birthday cake."}, {"viet": "Tôi sẽ đi gặp Thủ tướng''Thế à? Rất có thể!'.", "eng": "I'm going to meet the Prime Minister''Oh yeah? Very likely!'."}, {"viet": "Tôi sẽ không mua nó-trước tiên là do tôi không đủ tiền mua.", "eng": "I'm not buying it-I can't afford it for a start."}, {"viet": "Tôi đang thiếu tiền cho nên tôi sẽ trả cho anh vào tuần tới.", "eng": "I'm short of funds so I'll pay you next week."}, {"viet": "Tôi chắc ngân hàng sẽ cho anh vay.", "eng": "I'm sure the bank would give you the loan."}, {"viet": "Tôi lo lắng về việc đặt hàng ở nước ngoài.", "eng": "I'm worried about ordering from overseas."}, {"viet": "Tôi đã làm việc như điên để quét vôi căn phòng còn dư kịp để mẹ tôi đến thăm.", "eng": "I've been working like blazes to get the spare room painted in time for Mum's visit."}, {"viet": "Tôi đã từng nghe những lời dối trá trước đây, nhưng điều này thì thật quá tệ không thể tin được!", "eng": "I've heard lies before, but that one was a really doozy!"}, {"viet": "Tôi đã xem một đoạn trích ngắn của bộ phim ở trên vô tuyến truyền hình.", "eng": "I've seen a short excerpt from the film on television."}, {"viet": "Tôi cũng muốn uống cạn một cốc bia Thanh Đảo.", "eng": "I also want to down a Chin Tao beer."}, {"viet": "Tôi không tranh cãi với anh-tôi bảo anh.", "eng": "I am not arguing with you-I am telling you."}, {"viet": "Tôi yêu cầu cô ấy đánh máy nhưng cô ấy có vẻ không nhiệt tình.", "eng": "I asked her to do some typing but she's being a bit bolshy about it."}, {"viet": "Tôi mua một ít xúc xích salami ở cửa hàng thức ăn ngon.", "eng": "I bought some salami from the delicatessen."}, {"viet": "Tôi không thể ngăn cấm được cô không gặp lại người đàn ông đó.", "eng": "I can't forbid your seeing that man again."}, {"viet": "Tôi nghĩ không ra tên của ông ấy, nhưng ông ấy cực kỳ dễ mến đấy.", "eng": "I can't think of his name, but he is awfully nice."}, {"viet": "Tôi có thể gửi cho nó một lá thư ngắn qua hệ thống thư tín trong nước.", "eng": "I can send him a note via the internal mail system."}, {"viet": "Tôi không sao vặn cái nắp ra được.", "eng": "I can't twist the lid off."}, {"viet": "Tôi không thể dự đám cưới vì nó trùng với đợt nghỉ của tôi.", "eng": "I couldn't go to the wedding as it clashed with my holiday."}, {"viet": "Cho tôi nói chuyện với John?", "eng": "I'd like to talk to John, please?"}, {"viet": "Tôi không nhìn thấy chiếc xe đang vượt qua-nó nằm trúng vào điểm mù của tôi.", "eng": "I didn't see the car that was overtaking me-it was in my blind spot."}, {"viet": "Tôi không rõ nữa, chúng ta chỉ có nước chờ xem.", "eng": "I don't know, we'll just have to wait and see."}, {"viet": "Tôi không thích nhạc hiện đại lắm-nói thẳng ra thực tế là tôi ghét nó.", "eng": "I don't much like modern music-in fact, not to put too fine a point on it, I hate it."}, {"viet": "Tôi không muốn tỏ ra khe khắt, nhưng bà ta quả thật không phải là một đầu bếp giỏi ghê gớm gì.", "eng": "I don't want to be uncharitable, but She's not a terribly good cook."}, {"viet": "Anh chẳng thích xem bộ phim này.", "eng": "I don't like this movie."}, {"viet": "Tôi đã bày tỏ lòng thương cảm của tôi về nỗi bất hạnh của ông ta.", "eng": "I expressed my commiserations on his misfortune."}, {"viet": "Tôi cảm thấy bị xúc phạm hết sức khi họ bắt tôi phải ngồi ở một chiếc bàn nhỏ ở phía sau.", "eng": "I felt most insulted when they made me sit at a little table at the back."}, {"viet": "Tôi thường xuyên thay đổi các vật phụ ở trong phòng.", "eng": "I frequently change accessories in my room."}, {"viet": "Tôi đã kiếm được phòng trống cuối cùng.", "eng": "I got the last vacant room."}, {"viet": "Tôi không ủng hộ những ai nói rằng bạo lực có thể được chứng minh là đúng.", "eng": "I had no brief for those who say that violence can be justified."}, {"viet": "Tôi có chứng chỉ kinh doanh.", "eng": "I have a certificate in business studies."}, {"viet": "Tôi đã sống ở đây 2 năm.", "eng": "I have lived here for two years."}, {"viet": "Tôi phải mở đầu bằng một lời xin lỗi.", "eng": "I have to begin with an apology."}, {"viet": "Tôi không có đủ thì giờ để đọc sách.", "eng": "I haven't enough time for reading."}, {"viet": "Tôi không ủng hộ những ai nói rằng bạo lực có thể được biện minh.", "eng": "I hold no brief for those who say that violence can be justified."}, {"viet": "Tôi mong lần sau khi đến thăm Durham anh sẽ lưu lại chỗ chúng tôi.", "eng": "I hope you will stay with us next time you visit Durham."}, {"viet": "Tôi biết anh sẽ lấy vợ và sống ở ngoại ô như tất cả mọi người.", "eng": "I know, you'll just get married and live in the suburb like everybody else."}, {"viet": "Tôi thích những bộ phim trong đó kẻ ác bị trừng phạt!", "eng": "I like films where the villain comes to a sticky end!"}, {"viet": "Tôi sẽ đi vào chủ nhật.", "eng": "I'll be leaving on Sunday."}, {"viet": "Tôi đi về nhà bây giờ.", "eng": "I'll make my way home now."}, {"viet": "Tôi là một người sử dụng nhiều phương tiện giao thông công cộng.", "eng": "I'm a great user of public transport."}, {"viet": "Tôi định cầu hôn cô gái đó.", "eng": "I'm going to propose to that girl."}, {"viet": "Tôi cũng rất hân hạnh được gặp ông, thưa ông Lý.", "eng": "I'm pleased to meet you too, Mr. Lee."}, {"viet": "Tôi đã tự tôi pha một tách trà trong khi chờ đợi.", "eng": "I made myself a cup of tea while I was waiting."}, {"viet": "Tôi phải kiếm một món quà sinh nhật cho mẹ tôi.", "eng": "I must get a birthday present for my mother."}, {"viet": "Tôi cần tìm hiểu xem trung tâm thị trấn ở đâu.", "eng": "I need to find out where the town centre is."}, {"viet": "Tôi chỉ nghe tin đó một cách gián tiếp.", "eng": "I only heard the news at second hand."}, {"viet": "Tôi mua chúng ở văn phòng Montreal của ngân hàng Hoàng Gia Canada trước khi tôi đến Trung Quốc.", "eng": "I purchased them at the Montreal Office of the Royal Bank of Canada before I came to China."}, {"viet": "Tôi đoán cái đó sẽ lên đến giá khoảng 100 bảng Anh.", "eng": "I reckon it will cost about £ 100."}, {"viet": "Tôi nói tôi sẽ đi nhưng cuối cùng tôi đành phải thất hứa.", "eng": "I said I would go, but had to cry off at the last moment."}, {"viet": "Tôi tự đặt cho mình nhiệm vụ chẻ củi.", "eng": "I set myself the task of chopping up the firewood."}, {"viet": "Đêm qua tôi ngủ ở nhà người bạn.", "eng": "I slept at a friend's house last night."}, {"viet": "Tôi phụ thêm vào khoản trợ cấp của tôi bằng cách đi làm buổi tối.", "eng": "I supplement my grant by working in the evenings."}, {"viet": "Tôi nghĩ tôi có thể tới nhưng đừng trông cậy ở điều đó.", "eng": "I think I can come, but don't rely on it."}, {"viet": "Hình như có chuyến tàu 8 giờ 20, nhưng anh phải hỏi xem cho chắc chắn.", "eng": "I think there's a train at 8.20 but you ought to make certain."}, {"viet": "Tôi ném quả bóng cho cô ta và cô ta chụp lấy.", "eng": "I threw a ball to her and she caught it."}, {"viet": "Tôi gắng mỗi ngày dành ít phút để tập thể dục.", "eng": "I try to set aside a few minutes each day to do some exercises."}, {"viet": "Tôi đã đợi một tiếng chỉ để gặp anh thôi.", "eng": "I waited an hour just to see you."}, {"viet": "Tôi muốn tường trình một vụ cướp.", "eng": "I want to report a robbery."}, {"viet": "Tôi bận rộn trang bị căn phòng của tôi với những bức tranh sơn dầu.", "eng": "I was busy accessorizing my bed room with oil paintings."}, {"viet": "Tôi đến muộn, hậu quả là tôi nhỡ chuyến tàu của tôi.", "eng": "I was late, with the result that I missed my train."}, {"viet": "Tôi sửng sốt qua những gì đã đọc được.", "eng": "I was stupefied by what I read."}, {"viet": "Tôi đi nghe hoà nhạc theo cầu may: tôi chưa mua vé trước.", "eng": "I went to the concert on spec: I hadn't booked a seat."}, {"viet": "Tôi ước ao có thể cách âm phòng ngủ của chúng tôi.", "eng": "I wish we could sound proof our bedroom."}, {"viet": "Tôi sửng sốt khi nghe thấy giọng nói của cô ấy ở phòng bên.", "eng": "I wondered to hear her voice in the next room."}, {"viet": "Tôi muốn nhờ giặt ủi một số quần áo.", "eng": "I would like to have some laundry done."}, {"viet": "Tôi sẽ không bôi bẩn thanh danh mình với một kế hoạch bất lương như vậy.", "eng": "I wouldn't soil my hands with such a dishonest scheme."}, {"viet": "Anh ta có tội thì suy ra cô ta cũng thế.", "eng": "If he is guilty then by inference so is she."}, {"viet": "Nếu cần, tôi có thể làm thêm vào ngày nghỉ cuối tuần.", "eng": "If need be, I can do extra work at the weekend."}, {"viet": "Nếu tình hình xấu đi, người bị mất mát thua thiệt là tôi chứ không phải là anh.", "eng": "If things go wrong I'm the one who'll lose out."}, {"viet": "Nếu bạn thành công, bạn có thể hi vọng được thăng chức.", "eng": "If you are successful, you can expect promotion."}, {"viet": "Nếu anh cưới vợ thì việc đó theo tôi cần phải bàn bạc thật kỹ.", "eng": "If you ever get married, it seems to me extremely problematic."}, {"viet": "Nếu anh nhắm mắt anh không thể nhìn được.", "eng": "If you shut your eyes you can't see."}, {"viet": "Hãy tưởng tượng xem, người ta đã khước từ một đề nghị như thế!", "eng": "Imagine passing up an offer like that!"}, {"viet": "Trong trường hợp khẩn cấp, đập vỡ mặt kính và ấn nút.", "eng": "In case of emergency, break the glass and press the button."}, {"viet": "Về trí thông minh, trẻ con hầu như bằng nhau.", "eng": "In intelligence, the children are about equal."}, {"viet": "Mặc dù bệnh hoạn bà ta vẫn khá vui vẻ.", "eng": "In spite of her illness, she is relatively cheerful."}, {"viet": "Trong cụm từ black cat, black là thuộc từ.", "eng": "In the phrase black cat, black is an attributive."}, {"viet": "Ở nước bạn, trường đại học nào phổ biến hơn, trường đại học tư hay trường đại học công lập?", "eng": "In your country, which is more popular, private or public universities?"}, {"viet": "Liệu tệ nghiện ma tuý có phải là một đề tài thích hợp cho một cuộc tranh luận ở nhà trường không?", "eng": "Is drug abuse a suitable topic for a school debate?"}, {"viet": "Chính sách của chính phủ có phải là một chính sách của thái độ thụ động không?", "eng": "Is the Government's policy one of drift?"}, {"viet": "Cái thứ nguệch ngoạc này mà được coi là chữ ký ư?", "eng": "Is this squiggle supposed to be a signature?"}, {"viet": "Thật là điều kỳ diệu sao mà anh lại không bị chết trong vụ đâm xe đó!", "eng": "It's a miracle you weren't killed in that car crash!"}, {"viet": "Tôi không tài nào hiểu được tại sao cô ta lại muốn lấy Geoff.", "eng": "It's beyond me why she wants to marry Geoff."}, {"viet": "Khó mà đoán trước khi nào nó sẽ xảy ra.", "eng": "It's hard to predict when it will happen."}, {"viet": "Cô ấy tiêu tiền như thế nào không phải việc của anh.", "eng": "It's none of your business how she spends her money."}, {"viet": "Có tin đồn là bà ta sắp xin nghỉ việc.", "eng": "It's rumoured that she's going to resign."}, {"viet": "Thật là thiếu khôn ngoan khi cố làm luật sư cho anh.", "eng": "It's unwise to try to be your own lawyer."}, {"viet": "Có vẻ như hơi bị sưng.", "eng": "It does seem a little swollen."}, {"viet": "Người ta tin là ban quản lí và công đoàn đã đi tới một thoả thuận ngầm đối với vân đề này.", "eng": "It is believed the management and the unions have reached a tacit agreement on the matter."}, {"viet": "Nó không tuỳ thuộc ở chất lượng cần thiết.", "eng": "It is not up to the necessary standard."}, {"viet": "Trông có vẻ đội của chúng ta phải tập luyện chăm chỉ hơn.", "eng": "It looks like our team needs to practice harder."}, {"viet": "Trong mục chuyện đời tư trên báo đây nè.", "eng": "It's all here in the gossip columns."}, {"viet": "Tôi cũng rất vui được gặp bà.", "eng": "It's very nice meeting you, too."}, {"viet": "Sau khi vợ anh ấy chết, phải mất một thời gian dài anh ấy mới lấy lại được cân bằng.", "eng": "It took him a long time to get back on an even keel after his wife died."}, {"viet": "Nó dựa theo tiểu thuyết của Margaret Mitchell, đúng không?", "eng": "It was based on the novel by Margaret Mitchell, right?"}, {"viet": "Thật là niềm hân hạnh cho chúng tôi khi cháu đến ở nhà của chúng tôi.", "eng": "It was our pleasure to have you in our home."}, {"viet": "Sẽ rất dễ hiểu theo cách này.", "eng": "It will be easy to understand this way."}, {"viet": "Jackie Kennedy, bà ta lúc bấy giờ, mới còn ở tuổi ngoài hai mươi.", "eng": "Jackie Kennedy, as she then was, was still only in her twenties."}, {"viet": "Hiện giờ John không có ở trong văn phòng.", "eng": "John is not in right now."}, {"viet": "Cậu sẽ thấy ngay sự nổi nóng của bố cậu khi ông tóm được những cậu bé đó!", "eng": "Just you watch the fireworks when your father catches those boys!"}, {"viet": "Chanh tạo cho đồ uống một vị mạnh.", "eng": "Lemon imparts a sharp flavour to drinks."}, {"viet": "Vậy chúng mình xem phim đó đi.", "eng": "Let's go with that then."}, {"viet": "Nhiều cầu đã bị nước lũ cuốn đi.", "eng": "Many bridges were swept away by the floods."}, {"viet": "Bao nhiêu con tàu vũ trụ đã đi vào quỹ đạo quanh mặt trăng?", "eng": "Many spacecraft have orbited the moon?"}, {"viet": "Tôi có được phép yêu cầu bạn giúp đỡ không?", "eng": "May I ask you a favor?"}, {"viet": "Có lẽ tôi bị cảm rồi.", "eng": "Maybe I've got a cold."}, {"viet": "Hầu hết các thanh niên trong những nhà giam tội phạm trẻ xuất thân từ những hoàn cảnh gia đình xấu.", "eng": "Most of the boys in borstals are from bad background."}, {"viet": "Cô Biggs ốm và hôm nay không thể đến dạy các anh được.", "eng": "Mrs Biggs is ill and will be unable to take you today."}, {"viet": "Kỹ năng của bọn trẻ sử dụng máy tính thật sự làm tôi cảm thấy mình già rồi.", "eng": "My children's skill with computers really makes me feel my age."}, {"viet": "Bà của tôi nghĩ rằng tiếng cười là phương thuốc tốt nhất.", "eng": "My grandmother thinks that laughter is the best medicine."}, {"viet": "Bố mẹ tôi thanh toán mọi chi phí cho đám cưới.", "eng": "My parents footed the bill for the wedding."}, {"viet": "Ván cờ thắng làm tôi phấn chấn lên một chút.", "eng": "My win at chess raised my spirits a little."}, {"viet": "Báo chí nhiều khi không tôn trọng quyền riêng tư của cá nhân.", "eng": "Newspapers often don't respect the individual's right to privacy."}, {"viet": "Không, bạn có cần công thức làm bánh không?", "eng": "No, would you like the recipe?"}, {"viet": "Không đúng y như lời đó nhưng rõ ràng là cô ta có nói.", "eng": "Not in so many words but it was obvious that she did."}, {"viet": "Vô số sao, vi khuẩn, cát.", "eng": "Numberless stars, bacteria, grains of sand."}, {"viet": "Ồ, phòng tắm rộng, sạch sẽ và thơm tho.", "eng": "Oh, the bathroom is large, clean and smells fresh."}, {"viet": "Tôi đi mua hàng vào thứ Hai.", "eng": "On Monday I do the shopping."}, {"viet": "Một cái gần nơi chúng ta cắm trại đêm qua.", "eng": "One is near where we camped last night."}, {"viet": "Dư luận dường như chuyển sang hướng chống lại đề nghị đó.", "eng": "Opinion seems to be setting against the proposal."}, {"viet": "Căn hộ của chúng tôi rất thuận tiện để đến các trường học.", "eng": "Our flat is very handy for the schools."}, {"viet": "Trong chiến tranh, bố mẹ tôi đã phải hai lần lâm vào cảnh không cửa không nhà vì bom đạn.", "eng": "Our parents were bombed out twice during the war."}, {"viet": "Cô ta tiêu hơn tất cả họ hàng của cô trong ngày Giáng sinh.", "eng": "Outspend all her relatives at Christmas."}, {"viet": "Paul, đêm qua con biến đi đâu vậy?", "eng": "Paul, where in the world were you last night?"}, {"viet": "Những người lui về ở nông thôn thường thiếu những thú vui của thành phố.", "eng": "People who retire to the country often miss the amenities of a town."}, {"viet": "Vui lòng nói Mike gọi điện cho cháu.", "eng": "Please tell Mike to call me."}, {"viet": "Căn cứ trên bảng báo giá mà chúng tôi đã gửi cho các ông thì giá đó áp dụng cho đơn đặt hàng tối thiểu là 5000 bộ.", "eng": "Referring to the quotation we sent you, the price is for a minimum order of 5,000 sets."}, {"viet": "Tìm kiếm các thành viên mới từ số lao động trẻ thất nghiệp.", "eng": "Seek new recruits from among the young unemployed."}, {"viet": "Cô ta đã nói những lời hứa như vậy trước đấy và chúng đều không đáng tin.", "eng": "She'd made such promises before, and they lacked conviction."}, {"viet": "Cô ta nhanh như chớp trên sân quần vợt.", "eng": "She's as quick as lightning on the tennis court."}, {"viet": "Cô ta có cái vẻ thần bí y như thể vừa ăn sáng với một con ma trong truyện thần tiên.", "eng": "She's got that fey look as though she's had breakfast with a leprechaun."}, {"viet": "Cô ta mới chỉ làm điều đó có một lần, thôi đừng quá giận.", "eng": "She's only done it the once so don't be too angry."}, {"viet": "Nàng rất say mê ca hát.", "eng": "She's very enthusiastic about singing."}, {"viet": "Cô ấy hỏi tôi liệu cô ấy có thể ra đi được không, song tôi không muốn để cho cô ấy đi.", "eng": "She asked me if she could leave but I wouldn't let her."}, {"viet": "Cô ta không thể chịu được cái ý nghĩ để con cái bị đói.", "eng": "She cannot bear the thought of children going hungry."}, {"viet": "Cô ta đấm đùa nhẹ vào đầu anh ấy.", "eng": "She cuffed him playfully on the side of the head."}, {"viet": "Cô ấy lặn xuống nước vài giây sau ngôi lên đột ngột như một cái phao bần.", "eng": "She dived blow the surface, then bobbed up like a cork again a few seconds later."}, {"viet": "Cô cảm thấy dường như mọi xúc cảm đã bị dốc cạn hết trong lòng.", "eng": "She felt as if every drop of emotion had been squeezed out of her."}, {"viet": "Cô ta cung cấp cho cảnh sát một báo cáo đầy đủ về sự việc.", "eng": "She gave the police a full account of the incident."}, {"viet": "Cô ta đã học dệt từ thuở nhỏ.", "eng": "She had been taught to weave as a child."}, {"viet": "Cô ta cũng bị ảnh hưởng, nhưng ở một mức độ ít hơn.", "eng": "She has also been affected, but to a lesser degree."}, {"viet": "Cô ta không có nhiều cảm xúc trước vẻ đẹp của thiên nhiên.", "eng": "She hasn't much feeling for the beauty of nature."}, {"viet": "Cô ấy là nghệ sĩ sáng giá nhất trong nước.", "eng": "She is far and away the best actress in the country."}, {"viet": "Bà ta có cả một kho truyện vui trong đầu.", "eng": "She keeps a store of amusing stories in her head."}, {"viet": "Bà ấy đệ đơn, kêu về tiếng ồn.", "eng": "She lodged a complaint about the noise."}, {"viet": "Cô ấy đã trình bày chi tiết các ý kiến của mình về dự án mới.", "eng": "She mapped out her ideas on the new project."}, {"viet": "Cô ta trả tôi từng món nhỏ một, chứ không trả tất cả một lần.", "eng": "She paid me in dribs and drabs, not all at once."}, {"viet": "Cô ấy khẽ run lên với sự xúc động trước tin đó.", "eng": "She quivered with excitement at the news."}, {"viet": "Cô ta là một người cừ khôi dày kinh nghiệm về môn thể thao lướt sóng.", "eng": "She's a practiced exponent of the sport of water-skiing."}, {"viet": "Cô ta không phải là diễn viên giỏi.", "eng": "She's no great shakes as an actress."}, {"viet": "Bà ta choáng váng ngồi đó mất một lát mới hồi tỉnh.", "eng": "She sat stunned for a while, until she recovered."}, {"viet": "Cô ta tỏ ra rất có năng khiếu học ngoại ngữ.", "eng": "She showed great aptitude for learning languages."}, {"viet": "Bà ấy nói về nhân quyền một cách say mê.", "eng": "She spoke with passion about human rights."}, {"viet": "Bà ta vừa dạy học trò riêng vừa dạy ở trường.", "eng": "She takes private pupils as well as teaching in school."}, {"viet": "Nàng cố xóa bỏ mọi ký ức về cha của nàng.", "eng": "She tried too obliterate all memory of her father."}, {"viet": "Cô ấy đã cảnh báo cho tôi về đoạn đoạn đường nguy hiểm nên tôi qua đường một cách cẩn thận.", "eng": "She warned me about the dangerous road, so I crossed it carefully."}, {"viet": "Cô ta kẹp dưới cánh tay một gói sách.", "eng": "She was carrying a parcel of books under her arm."}, {"viet": "Cô ta đang treo đồ giặt của cô ta lên dây.", "eng": "She was hanging her washing out on the line."}, {"viet": "Bà ấy một phần là người Cheyenne, một phần là người Crow, và một phần là người Blackfeet.", "eng": "She was part Cheyenne, part Crow, and part Blackfeet."}, {"viet": "Cô ta bị đuổi khỏi trường vì tội ăn cắp.", "eng": "She was suspended from school for stealing."}, {"viet": "Cô ta trông chừng trong khi chúng băng qua đường.", "eng": "She watched as they crossed the road."}, {"viet": "Cô ta không muốn kể chuyện bí mật của cô ta với chúng tôi.", "eng": "She won't share her secret with us."}, {"viet": "Bà ấy quát tháo đứa con tinh nghịch của bà ấy.", "eng": "She yelled out at her mischievous child."}, {"viet": "Lái cuộc nói chuyện sang những đề tài vui hơn.", "eng": "Shunt the conversation towards more pleasant topics."}, {"viet": "Hát những bản hợp xướng với vẻ hết sức hứng thú.", "eng": "Singing the choruses with great gusto."}, {"viet": "Các công ty nhỏ sẽ là nạn nhân đầu tiên của chính sách này.", "eng": "Small firms will be the first casualties of this policy."}, {"viet": "Vậy thì cháu nên thức dậy lúc 7 giờ.", "eng": "So I should wake up at seven."}, {"viet": "Nói một mình trước gương trong buồng tắm.", "eng": "Soliloquizing in front of the bathroom mirror."}, {"viet": "Một số trong đám đông cố gắng len qua hàng rào cảnh sát.", "eng": "Some of the crowd attempted to break through police cordons."}, {"viet": "Vài loại vải tổng hợp không dễ bị nhàu.", "eng": "Some synthetic materials do not crush easily."}, {"viet": "Đàn ông của bộ lạc đi săn.", "eng": "Sons of the tribe going out to hunt."}, {"viet": "Tốn nhiều thời gian để giải thích một kế hoạch.", "eng": "Spend a lot of time in explaining a plan."}, {"viet": "Cứ theo đường này chừng hai dặm rồi rẽ trái.", "eng": "Stay on this road for two miles then turn left."}, {"viet": "Thôi đừng làm điệu làm bộ nữa, hãy cho chúng tôi biết bạn thật sự nghĩ gì.", "eng": "Stop posing and tell us what you really think."}, {"viet": "Nộp một bản thảo cho một chủ bút.", "eng": "Submit a manuscript to an editor."}, {"viet": "Sue và tôi lướt sóng ở Honolulu.", "eng": "Sue and I went boogie boarding in Honolulu."}, {"viet": "Các giám định viên đã thực hiện việc định giá ngôi nhà của chúng tôi.", "eng": "Surveyors carried out a valuation on our house."}, {"viet": "Lấy mẫu xét nghiệm từ những đứa bé bị nghi mắc bệnh bạch cầu.", "eng": "Take swabs from children suspected of having diphtheria."}, {"viet": "Những từ ngữ kỹ thuật người thường không thể hiểu được.", "eng": "Technical expressions that are incomprehensible to ordinary people."}, {"viet": "Cám ơn, nhưng thật sự ông không nên làm vậy.", "eng": "Thank you, but you really shouldn't have."}, {"viet": "Đó là điều buồn cười nhất mà đến bây giờ tôi mới được nghe.", "eng": "That's the funniest thing I've ever heard."}, {"viet": "Con chó ấy có vẻ đúng là một con thú dữ đấy.", "eng": "That dog looks a real brute."}, {"viet": "Người đàn ông đó nặng gấp đôi tôi.", "eng": "That man is twice my weight."}, {"viet": "Đó chỉ là lời nói ba hoa.", "eng": "That's just a lot of blah."}, {"viet": "Thật là một cú sốc-tôi cần một cốc rượu mạnh!", "eng": "That was a shock-I need a stiff drink!"}, {"viet": "Những nạn nhân của tai nạn đã được đưa vào khu chăm sóc đặc biệt.", "eng": "The accident victims have been taken into intensive care."}, {"viet": "Việc đó không còn do tôi phụ trách nữa.", "eng": "The affair is no longer in my hands."}, {"viet": "Người câu cá thả dây câu xuống nước.", "eng": "The angler cast his line into the water."}, {"viet": "Mã vùng là 03 và số điện thoại là 123-4567.", "eng": "The area code is 03 and the phone number is 123-4567."}, {"viet": "Các nhà du hành vũ trụ lái con tàu vũ trụ của họ xuống mặt trăng.", "eng": "The astronauts piloted their craft down to the lunar surface."}, {"viet": "Nhiệt độ trung bình ở Oxford tháng vừa rồi là 180C.", "eng": "The average temperature in Oxford last month was 180C."}, {"viet": "Quả bóng nổ và rơi xuống đất.", "eng": "The balloon burst and fell to earth."}, {"viet": "Trận đánh được kể lại rất hùng hồn.", "eng": "The battle was storied with loud and strong voice."}, {"viet": "Tràng hoa hai môi của nhiều cây thuộc họ bạc hà.", "eng": "The bilabiate corolla of many plant of the mint family."}, {"viet": "Con thuyền bập bềnh lên xuống trên mặt nước.", "eng": "The boat bobbed up and down in the water."}, {"viet": "Quyển sách nhận được sự tán thưởng nhiệt liệt.", "eng": "The book received great critical acclaim."}, {"viet": "Người ta ra lệnh cho thằng nhỏ ra khỏi phòng.", "eng": "The boy was ordered out of the room."}, {"viet": "Năm nay mốt là kiểu vai rộng.", "eng": "The broad-shouldered look is in this year."}, {"viet": "Xe buýt đỗ ngay phía trước nhà chúng tôi.", "eng": "The bus stops right in front of our house."}, {"viet": "Những kẻ bị bắt đã bị bắn một cách không thương tiếc.", "eng": "The captives were shot without remorse."}, {"viet": "Xe ô tô này đã tiêu thụ một galông xăng cho cuộc hành trình đó.", "eng": "The car used a gallon of petrol for the journey."}, {"viet": "Con mèo duỗi mình một cách thích thú khoái cảm trong nắng ấm mặt trời.", "eng": "The cat stretched itself with sensuous ease in the warm sun."}, {"viet": "Sự thay đổi hẳn từ hệ thống kế toán này sang hệ thống kế toán khác.", "eng": "The changeover from one accounting system to another."}, {"viet": "Đứa bé đang kéo cái xe trò chơi của nó quanh vườn.", "eng": "The child is tugging his toy car round the garden."}, {"viet": "Lũ trẻ chưa quen sống ở thành thị.", "eng": "The children are unused to living in a city."}, {"viet": "Bọn trẻ đi ra và căn phòng trở nên yên tĩnh.", "eng": "The children went out, and the room was silent."}, {"viet": "Chu vi của trái đất là gần 25000 dặm.", "eng": "The circumference of the earth is almost 25000 miles."}, {"viet": "Đóng cửa nhà máy ôtô có hậu quả gián tiếp đến những nhà sản xuất lốp xe.", "eng": "The closure of the car factory had a knock-on effect on the tyre manufacturers."}, {"viet": "Trường đại học dùng ý kiến phản hồi của sinh viên để chuẩn bị cho những trung tâm huấn luyện.", "eng": "The college uses feedback from students to new training centres."}, {"viet": "Công ty lúc đầu chuyên về radio nhưng bây giờ quyết định chuyển sang ngành máy vi tính.", "eng": "The company began by specializing in radios but has now decided to branch out into computers."}, {"viet": "Tính gộp tất cả các con số thất nghiệp.", "eng": "The complete aggregate of unemployment figures."}, {"viet": "Vật đựng bên trong gói hàng đã xẹp xuống trong khi vận chuyển.", "eng": "The contents of the packet have settled in transit."}, {"viet": "Bước nhảy vọt của đất nước tới một kỷ nguyên công nghệ mới.", "eng": "The country's great jump forward to a new technological era."}, {"viet": "Tòa án đưa lệnh gọi bà ta ra tòa làm nhân chứng.", "eng": "The court subpoenaed her to appear as a witness."}, {"viet": "Đám đông kinh hoàng xô đẩy làm mười người bị giẫm đạp chết.", "eng": "The crowd panicked and ten people were trampled to death."}, {"viet": "Vết đứt sớm lành, nhưng để lại vết sẹo.", "eng": "The cut soon healed over, but it left a scar."}, {"viet": "Quyết định giảm mức tiền lương đã làm cho lực lượng lao động nổi giận.", "eng": "The decision to reduce pay levels incensed the work force."}, {"viet": "Vùng sa mạc cứ trải dài hết tầm mắt.", "eng": "The desert continued as far as the eye could see."}, {"viet": "Chuyện đùa tục tĩu khiến cô ta đỏ mặt.", "eng": "The dirty joke raised a blush on her cheek."}, {"viet": "Bác sĩ khám cho cô gái một cách cẩn thận và thấy cô hoàn toàn khoẻ mạnh.", "eng": "The doctor examined the girl carefully and found her in perfect health."}, {"viet": "Con chó chạy thoát qua cái cổng bỏ ngỏ.", "eng": "The dog escaped through the open gate."}, {"viet": "Bột nhồi dính vào những ngón tay tôi.", "eng": "The dough stuck to my fingers."}, {"viet": "Con cừu sắp chết ngã xuống, chân nó giãy giụa một cách tuyệt vọng.", "eng": "The dying lamb fell, its legs flailing about helplessly."}, {"viet": "Năm 1983 cử tri đã bầu những người bảo thủ lên cầm quyền với một đa số gia tăng.", "eng": "The electorate put the Tories in with an increased majority in 1983."}, {"viet": "Cờ hiệu của Hoa Kì là sao và xọc.", "eng": "The ensign of the United States is the stars and stripes."}, {"viet": "Người ta sẽ không bao giờ quên những hành vi bạo ngược của quân chiếm đóng.", "eng": "The excesses committed by the occupying troops will never be forgotten."}, {"viet": "Việc hắn đã nói dối trước đây làm cho lời nói của hắn mất đi sự tín nhiệm.", "eng": "The fact that he had lied before robbed his words of any credibility."}, {"viet": "Người cha để lại tiếng thơm cho con trai.", "eng": "The father handed on his good reputation to his son."}, {"viet": "Cuốn phim pha tạp đầy đủ các màn phiêu lưu, khiêu dâm và vui nhộn.", "eng": "The film is a rich brew of adventure, sex and comedy."}, {"viet": "Công ty đã vấp phải nhiều sự rắc rối về lao động, thí dụ những cuộc bãi công.", "eng": "The firm's been hit by a lot of labour trouble."}, {"viet": "Buổi công diễn lần đầu của vở kịch đó.", "eng": "The first public performance of the play."}, {"viet": "Phần tiếp sau đây là các đoạn trích từ nguyên bản.", "eng": "The following are extracts from original article."}, {"viet": "Mối thông cảm giữa các phóng viên truyền hình.", "eng": "The freemasonry of T. V reporters."}, {"viet": "Tay cướp và hai tên thân tín của hắn.", "eng": "The gangster and his two sidekicks."}, {"viet": "Thành phố hoang vu cho chúng tôi một cảm giác bất an.", "eng": "The ghost town gave us a clammy feeling."}, {"viet": "Việc chính phủ giảm bớt dần qui mô của ngành than.", "eng": "The government's gradual run-down of the coal industry."}, {"viet": "Chính phủ hy vọng sẽ cải thiện điều kiện sống của công nhân.", "eng": "The government hopes to better the conditions of the workers."}, {"viet": "Chính phủ sẽ không thay đổi thái độ về vấn đề này.", "eng": "The government won't move on this issue."}, {"viet": "Tầng trệt gồm một phòng khách, một gian bếp và một góc phòng ăn.", "eng": "The ground floor consisted of a sitting room and a kitchen with a dining alcove."}, {"viet": "Súng đó có tầm bắn xa năm dặm.", "eng": "The gun has a range of five miles."}, {"viet": "Tuyết rơi nhiều đã cản trở mọi sự liên lạc với vùng cao.", "eng": "The heavy snow has prevented all communication with the highlands."}, {"viet": "Con ngựa lao tới bất ngờ nên cô ta ngã xuống.", "eng": "The horse plunged and she fell off."}, {"viet": "Nhìn qua thung lũng, ngôi nhà có dáng vẻ xinh đẹp.", "eng": "The house has a pleasant outlook over the valley."}, {"viet": "Khí hậu ẩm không thích hợp với anh ấy.", "eng": "The humid climate didn't agree with him."}, {"viet": "Sự cố ấy đã gây ra cả một chuỗi những tai hoạ.", "eng": "The incident sparked off a whole chain of disasters."}, {"viet": "Những lời dẫn trên hộp đó rất khó hiểu.", "eng": "The instructions on the box are very confusing."}, {"viet": "Chiếc máy bay phản lực bay vút lên bầu trời.", "eng": "The jet soared into the air."}, {"viet": "Theo bằng chứng đó, bồi thẩm đoàn kết luận cô ấy có tội.", "eng": "The jury concluded, from the evidence, that she was guilty."}, {"viet": "Quý bà ở văn phòng du lịch đã nói với tôi là văn phòng sẽ mở cửa vào 1 giờ chiều.", "eng": "The lady at the tourist office told me it opened at 1pm."}, {"viet": "Pháp luật cấp cho công dân quyền bầu cử.", "eng": "The law gives the citizens the right to vote."}, {"viet": "Bức thư đó đã được hoàn lại cho chúng tôi với một câu hỏi.", "eng": "The letter was referred back to us with a query."}, {"viet": "Răng cô bé rời ra khi nó cắn quả táo.", "eng": "The little girl's tooth came out when she bit into the apple."}, {"viet": "Phần đuôi của ống tẩu thuốc lá có thể tách ra khỏi phần đầu.", "eng": "The lower part of the pipe is separable from the upper part."}, {"viet": "Óc thích ứng của người thực dụng.", "eng": "The malleable mind of the pragmatist."}, {"viet": "Trận đấu quyết định có sự tham gia giữa các vận động viên hàng đầu được chơi vào ngày mai.", "eng": "The match between the joint leaders will be played off tomorrow."}, {"viet": "Số người dự họp tràn ra tới ngoài phố.", "eng": "The meeting overflowed into the streets."}, {"viet": "Cuộc đình công của những người thợ mỏ đã thật sự bắt đầu có kết quả.", "eng": "The miners'strike is really starting to bite."}, {"viet": "Tiền đó đã giúp cho anh ta đúng cái bước đầu mà anh ta cần.", "eng": "The money gave him just the start he needed."}, {"viet": "Bản kiến nghị do ông X đề xuất và được bà Y ủng hộ.", "eng": "The motion was proposed by Mr X and seconded by Mrs Y."}, {"viet": "Tên của Franklin làm ta liên tưởng tới điện.", "eng": "The name of Franklin is associated with electricity."}, {"viet": "Trung tâm hội nghị mới có thể chứa được tới 400 đại biểu.", "eng": "The new conference centre can accommodate up to 400 delegates."}, {"viet": "Viên giám đốc mới ngành quảng cáo quả thật là người nhạy bén.", "eng": "The new publicity manager is really on the ball."}, {"viet": "Tin ấy được đón nhận bằng tiếng reo mừng.", "eng": "The news was greeted with cheering."}, {"viet": "Những ghi chú đó ngắn và thiếu thông tin.", "eng": "The notes were brief and uninformative."}, {"viet": "Đại dương trải rộng xa hút mắt khắp bốn phía.", "eng": "The ocean stretched as far as they could see on all sides."}, {"viet": "Những lá thư cũ nhắc nhở lại nhiều kỷ niệm vui.", "eng": "The old letters brought back many happy recollections."}, {"viet": "Các luật sư đối lập từ chối hợp tác với chúng tôi.", "eng": "The opposing attorneys refused to play ball with us."}, {"viet": "Chỗ đau ở chân tôi lúc có lúc không.", "eng": "The pain in my leg comes and goes."}, {"viet": "Đảng cần thay đổi người lãnh đạo.", "eng": "The party needs a change of leader."}, {"viet": "Sự thanh bình của một chiều hè, vùng quê.", "eng": "The peace of a summer evening, the countryside."}, {"viet": "Những đòi hỏi nằng nặc của các đứa trẻ hư đốn.", "eng": "The petulant demands of spoilt children."}, {"viet": "Cái nhọt nhú ngòi ra trước khi vỡ mủ.", "eng": "The pimple came to a head before bursting."}, {"viet": "Những nhà quy hoạch chịu trách nhiệm về việc biến đổi bộ mặt miền quê.", "eng": "The planners responsible for the disfigurement of the countryside."}, {"viet": "Niềm thích thú của tôi khi nghe loại nhạc đó không bao giờ trở nên nhàm chán.", "eng": "The pleasure I get from listening to such music never stales."}, {"viet": "Cảnh sát lập sổ đen những tên khủng bố bị truy nã.", "eng": "The police drew up a blacklist of wanted terrorists."}, {"viet": "Cảnh sát đã tịch thu nhiều sách báo và băng từ.", "eng": "The police seized various books and tapes."}, {"viet": "Ca sĩ nhạc pop bị nhóm thiếu niên vây quanh.", "eng": "The pop singer was mobbed by teenagers."}, {"viet": "Nét trội hơn trong tính cách anh ta là lòng kiêu hãnh.", "eng": "The predominant feature of his character was pride."}, {"viet": "Vị Tổng thống được đưa đi long trọng trong ôtô qua các đường phố.", "eng": "The President was driven in state through the streets."}, {"viet": "Ông Thủ tướng nêu ra những mục tiêu của chính phủ của ông trên chương trình truyền hình.", "eng": "The Prime Minister set forth the aims of his government in a television broadcast."}, {"viet": "Vấn đề là ở chỗ điều cô ta nói không tương ứng với cái cô ta làm.", "eng": "The problem that what she says doesn't correspond with what she does."}, {"viet": "Tỷ lệ dân số còn nói tiếng thổ ngữ chiếm rất nhỏ.", "eng": "The proportion of the population still speaking the dialect is very small."}, {"viet": "Ý chung của lời tuyên bố đó là xí nghiệp bị phá sản.", "eng": "The purport of the statement is that the firm is bankrupt."}, {"viet": "Nhân viên điện đài đã phát đi lời kêu gọi cứu viện về bộ chỉ huy.", "eng": "The radio operator sent out an appeal for help to headquarters."}, {"viet": "Những tên nổi loạn đã cố lật đổ chính quyền.", "eng": "The rebels tried to overthrow the government."}, {"viet": "Việc sửa chữa tu bổ đã làm hao hụt ngân quỹ của chúng tôi.", "eng": "The repairs made a dent in our funds."}, {"viet": "Những kết quả của cuộc nghiên cứu này có thể ứng dụng vào sự phát triển mới về kỹ thuật.", "eng": "The results of this research can be applied to new developments in technology."}, {"viet": "Con sông chảy vào hồ, sau đó nó chảy ra phía bên kia bờ hồ.", "eng": "The river runs into the lake, then it runs out the other side of the lake."}, {"viet": "Mái nhà phải được chống đỡ lên trong khi công việc sửa chữa được tiến hành.", "eng": "The roof will have to be prop up while repair are carried out."}, {"viet": "Tay chạy đua rẽ gắt qua bên này khi lẽ ra anh ta phải rẽ gắt qua bên kia.", "eng": "The runner zigged when he should have zagged."}, {"viet": "Vụ bê bối được loan tin khắp thành phố.", "eng": "The scandal was noised all over the town."}, {"viet": "Qua nhiều năm, biển đã xói mòn bề mặt của vách đá.", "eng": "The sea has eroded the cliff face over the years."}, {"viet": "Viên trung sĩ sẽ trang bị cho các anh ( tất cả những gì các anh cần ).", "eng": "The sergeant will rig you out ( with everything you need )."}, {"viet": "Con tàu đắm cách Stốc-khôm 10 dặm Anh.", "eng": "The ship sank 10 miles out of Stockholm."}, {"viet": "Phát đạn lệch quá xa mục tiêu.", "eng": "The shot was way off target."}, {"viet": "Tình hình quá là không chắc chắn cho mọi điều dự đoán.", "eng": "The situation is far too iffy for any predictions."}, {"viet": "Năm đó mưa tuyết đến sớm.", "eng": "The snows came early that year."}, {"viet": "Tiếng động đã đánh thức đứa bé dậy.", "eng": "The sound awakened the baby from slumber."}, {"viet": "Triều đình tráng lệ của vị vua phương Đông.", "eng": "The splendid court of an Eastern potentate."}, {"viet": "Hơi nước mù mịt của phòng tắm hơi Thổ Nhĩ Kỳ.", "eng": "The steamy vapours of a Turkish bath."}, {"viet": "Những sự căng thẳng và khẩn trương của cuộc sống hiện đại.", "eng": "The stresses and strains of modern life."}, {"viet": "Vụ hè năm nay chín sớm.", "eng": "The summer crops were forward this year."}, {"viet": "Bọn con trai cao giễu bọn thấp không chơi được bóng rổ.", "eng": "The taller boys scoffed at the shorter ones, who could not play basketball."}, {"viet": "Chính các thầy giáo cũng nói rằng bài kiểm tra quá khó.", "eng": "The teachers themselves said the test was too hard."}, {"viet": "Bọn khủng bố đã chiếm giữ sứ quán.", "eng": "The terrorists have occupied the Embassy."}, {"viet": "Nước thuỷ triều đã rút để con thuyền mắc cạn trên đá.", "eng": "The tide had gone out, leaving the boat stranded on the rock."}, {"viet": "Thành phố bị tàn phá bởi động đất.", "eng": "The town was destroyed by the earthquake."}, {"viet": "Cây và núi làm cho phong cảnh rất đẹp.", "eng": "The trees and the mountains made the landscape very beautiful."}, {"viet": "Hai công ty hợp lực với nhau để giành lấy một hợp đồng lớn.", "eng": "The two firms joined forces to win a major contract."}, {"viet": "Nghiệp đoàn cuối cùng đồng ý là phải nhờ trọng tài phân xử như là một cách chấm dứt cuộc đình công.", "eng": "The union finally agreed to go to arbitration as a way of ending the strike."}, {"viet": "Ngựa gỗ để tập nhảy là một dụng cụ khó làm chủ.", "eng": "The vaulting horse is a difficult piece of apparatus to master."}, {"viet": "Những người hầu bàn đang dọn dẹp bàn ghế là một điều nhắc nhở rằng đã đến lúc phải ra về!", "eng": "The waiters were clearing the tables, which served as a reminder that it was time to leave!"}, {"viet": "Thời tiết đã làm hỏng phần nào chuyến đi chơi biển của chúng tôi.", "eng": "The weather rather spoiled our trip to the seaside."}, {"viet": "Gió, nhiệt độ, mực nước, v. v. đã giảm nhiều.", "eng": "The wind, temperature, water level, etc has dropped considerably."}, {"viet": "Từ duckling là hậu tố giảm nhẹ được tạo nên bởi duck.", "eng": "The word duckling is a diminutive formed from duck."}, {"viet": "Năm đó đã kết thúc bằng những trận bão tuyết và gió mạnh.", "eng": "The year went out with blizzards and gales."}, {"viet": "Sự đánh giá của họ hoàn toàn gần đúng.", "eng": "Their estimate is definitely in the right ballpark."}, {"viet": "Tiếng thét của họ làm máu tôi đông lại vì kinh hoàng.", "eng": "Their screams made my blood curdle with terror."}, {"viet": "Sau đó chúng ta có thể tham gia với những người nhảy múa.", "eng": "Then we can join the dancers."}, {"viet": "Có một cái chăn bỏ không lay lắt ở một trong những căn phòng này.", "eng": "There's a spare blanket kicking around in one of these rooms."}, {"viet": "Rất có thể sẽ không có cuộc tấn công của địch.", "eng": "There's not much fear of an enemy attack."}, {"viet": "Có những bản sao của tất cả các thư từ trong ngăn hồ sơ.", "eng": "There are copies of all the letters in the files."}, {"viet": "Có mấy cách giải thích có thể chấp nhận được.", "eng": "There are several possible explanations."}, {"viet": "Có sự thay đổi mốt áo dài từ kiểu nghiêm túc sang kiểu phóng túng hơn.", "eng": "There has been a shift in fashion from formal to more informal dress."}, {"viet": "Có một hành động để mở rộng tự do cho văn học và nghệ thuật.", "eng": "There is a move to liberalize literature and the Arts."}, {"viet": "Không có khoảng hở đủ cho các xe cao chạy qua dưới cầu này.", "eng": "There is not much clearance for tall vehicles passing under this bridge."}, {"viet": "Có một sự im lặng ngắn ngủi, tiếp theo là tiếng ồn ào ầm ĩ.", "eng": "There was a brief silence, followed by uproar."}, {"viet": "Không thể tránh được cảm giác thất vọng về chuyến trở về nhà.", "eng": "There was inevitably a feeling of anticlimax about the journey home."}, {"viet": "Đã có nhiều vụ xung đột trước vụ rắc rối gần đây nhất này.", "eng": "There were several clashes before this latest incident."}, {"viet": "Những manh mối này thực sự không nói được gì nhiều lắm.", "eng": "These clues don't really add up to very much."}, {"viet": "Những bức ảnh này hoàn toàn mờ nhạt.", "eng": "These photographs have come out all fuzzy."}, {"viet": "Họ thích tổ chức những cái tức cười gọi là những buổi dạ hội văn chương.", "eng": "They're fond of holding what are laughingly known as literary soirées."}, {"viet": "Tất cả họ đều đoàn kết để chống kẻ thù.", "eng": "They all banded together to fight the enemy."}, {"viet": "Họ đang cố gắng biến văn phòng của chúng ta thành nơi không hút thuốc.", "eng": "They are trying to make our office smoke-free."}, {"viet": "Họ lựa chọn một thiết kế truyền thống cho ngôi nhà của họ.", "eng": "They chose a conventional design for their house."}, {"viet": "Họ không trả lương quá cao cho nhân công của họ.", "eng": "They don't exactly overpay their work-force."}, {"viet": "Lúc nào họ cũng đi đến đó.", "eng": "They go there all the time."}, {"viet": "Muốn an toàn họ phải chạy vậy chứ.", "eng": "They have to for their own protection."}, {"viet": "Chúng chuồn trong một chiếc xe hòm ăn cắp.", "eng": "They made their getaway in a stolen van."}, {"viet": "Họ trồng cây vào khoảng trống giữa các ngôi nhà.", "eng": "They planted trees in the intervals between the houses."}, {"viet": "Người ta nói thức ăn Trung Quốc nhiều màu sắc, thơm, ngon, và bài trí đẹp.", "eng": "They say Chinese dishes are colorful, fragrant, delicious, and presentable."}, {"viet": "Họ yêu cầu anh ta làm nhân chứng.", "eng": "They summon him to appear as a witness."}, {"viet": "Họ có thể đuổi những con vật này vì phần nào họ đã biết cách làm ra lửa.", "eng": "They were able to drive out these animals partly because they knew how to make fire."}, {"viet": "Họ tự hào về những thành công của mình.", "eng": "They were proud of their success."}, {"viet": "Hãy thử xem gặp lại họ vui sướng biết bao.", "eng": "Think how nice it would be to see them again."}, {"viet": "Điều này đã dẫn đến sự chấm dứt mối liên hiệp.", "eng": "This caused the break up of the coalition."}, {"viet": "Giấc mơ này thường lụi tàn khi quét dọn bia bị đổ lúc một giờ sáng.", "eng": "This dream usually dies when cleaning up spilled beer at one o'clock in the morning."}, {"viet": "Đây là một cuốn sách dành cho mọi người già trẻ lớn bé.", "eng": "This is a book for young and old alike."}, {"viet": "Đó là cái sân trong, gọi là như vậy thôi, chứ thật ra nó chỉ là cái sân sau.", "eng": "This is the patio, so-called-it's really just the back yard."}, {"viet": "Mốt này bán được hơn các thứ khác ở ngoài chợ.", "eng": "This model outsell an others on the market."}, {"viet": "Cái đĩa này bị vỡ rồi, anh có thể cho tôi một cái khác không?", "eng": "This plate is broken, can you get me another one?"}, {"viet": "Cái gọi là bản dịch này là hoàn toàn vô nghĩa.", "eng": "This so-called translation is pure nonsense."}, {"viet": "Điều đó ngược lại với mệnh lệnh rõ ràng của tôi.", "eng": "This was done against my express orders."}, {"viet": "Hàng nghìn người đã viết cho chúng tôi để xin một mẫu hàng không mất tiền.", "eng": "Thousands of people have written in to us for a free sample."}, {"viet": "Tom đã về phòng nó sau bữa ăn tối.", "eng": "Tom went to his room after supper."}, {"viet": "Các sinh viên trình bài luận cho giám thị.", "eng": "University students showing essays to their supervisor."}, {"viet": "Thời tiết ở đó tốt chứ?", "eng": "Was the weather all right there?"}, {"viet": "Chúng ta sẽ phải tìm một nguồn thu nhập mới.", "eng": "We'll have to find new source of income."}, {"viet": "Lúc này, chúng tôi đang ăn cơm-lát nữa trở lại nhé.", "eng": "We're having dinner just now, come back later."}, {"viet": "Chúng tôi đã mất liên lạc với Roger nhiều năm nay rồi.", "eng": "We've been out of touch with Roger for years now."}, {"viet": "Chúng tôi thi hành nhiều biện pháp để đối phó với tình hình.", "eng": "We adopted many measures to cope with the situation."}, {"viet": "Chúng tôi hoàn toàn không hay biết gì các kế hoạch của các ông.", "eng": "We are in complete ignorance of your plans."}, {"viet": "Cả hai chúng tôi làm chiếc máy, nhưng James được tán thưởng.", "eng": "We both made the machine, but James was given the credit for it."}, {"viet": "Chúng ta chỉ có thể cứu vãn được tình thế bằng cách giảm bớt chi tiêu.", "eng": "We can only retrieve the situation by reducing our expenses."}, {"viet": "Chúng tôi ủ bếp lửa trước khi đi ngủ.", "eng": "We damped the fire down before we went to bed."}, {"viet": "Chúng tôi chờ đợi những thắng lợi to lớn hơn nữa tiếp theo.", "eng": "We expect even greater successes to follow."}, {"viet": "Chúng tôi đã nhận thấy nhiệt độ lên xuống như thế nào.", "eng": "We had already perceived how the temperature fluctuated."}, {"viet": "Chúng tôi là bạn từ đó đến nay.", "eng": "We have been friends ever since then."}, {"viet": "Chúng tôi đã cố gắng đem lại một sự hoà giải giữa hai phe.", "eng": "We have tried our best to effect a reconciliation between two parties."}, {"viet": "Chúng tôi ngồi nhẩn nha ăn sáng trên sân trường.", "eng": "We lingered over breakfast on the terrace."}, {"viet": "Chúng ta phải có đầu óc thực tế và tính toán giá thành trước khi đưa ra quyết định.", "eng": "We must be practical and work out the cost before we make a decision."}, {"viet": "Chúng ta cần một người thợ điện để chữa cái bàn là.", "eng": "We need an electrician to mend the iron."}, {"viet": "Chúng tôi là công ty xây dựng địa phương.", "eng": "We're a local construction company."}, {"viet": "Chúng ta sẽ chỉ làm hại mình thôi.", "eng": "We shall only harm ourself."}, {"viet": "Chúng tôi buộc chặt cánh tay anh ta để ngăn khỏi chảy máu.", "eng": "We tied his arm up tightly to stop the bleeding."}, {"viet": "Chúng tôi tới văn phòng thất lạc của cải ở nhà ga.", "eng": "We went to the lost property office at the station."}, {"viet": "Chúng tôi bị đội kia đánh cho thua liểng xiểng.", "eng": "We were thoroughly trounced by the opposing team."}, {"viet": "Mặc một loạt quần áo cũ tạp nham.", "eng": "Wearing a motley collection of old clothes."}, {"viet": "À, trong một số trường hợp họ có thể làm như thế!", "eng": "Well, in some cases they may do just that!"}, {"viet": "Bạn sinh năm 1960 phải không?", "eng": "Were you born in nineteen sixty?"}, {"viet": "Vậy chờ cho đến khi nó khô đi nhé?", "eng": "What about waiting until it dries?"}, {"viet": "Anh giải thích như thế nào hành động của cậu ta?", "eng": "What construction do you put on his action?"}, {"viet": "Anh còn nhớ những sự kiện gì trong cuộc đời học sinh của anh?", "eng": "What events do you remember from your schooldays?"}, {"viet": "Thưa các quý vị, ý kiến chung là thế nào?", "eng": "What is the general consensus of opinion. gentlemen?"}, {"viet": "Bạn thích nghe thể loại nhạc nào?", "eng": "What kind of music do you listen to?"}, {"viet": "Anh ấy đã có phần đóng góp gì trong thành công của họ?", "eng": "What share did he have in their success?"}, {"viet": "Những điều anh nói không phù hợp với những chứng cớ trước đó.", "eng": "What you say does not accord with the previous evidence."}, {"viet": "Khi ông ấy đề nghị việc làm thì tôi hoàn toàn bất ngờ.", "eng": "When he offered me the job it took me completely by surprise."}, {"viet": "Khi nói trước công chúng, hãy nói ngắn gọn.", "eng": "When making a speech in public, aim for brevity."}, {"viet": "Khi những con vật này chết đi, vỏ của chúng bị bỏ lại và rơi xuống đáy nước.", "eng": "When these animals die, their shells are left behind and fall to the bottom of the water."}, {"viet": "Cặp đựng các thư tín mới ở đâu?", "eng": "Where's the file of our recent correspondence?"}, {"viet": "Khó có thể nói được cái đó là đúng hay không.", "eng": "Whether it's true or not is hard to tell."}, {"viet": "Ông thích ngồi phía bên nào của nhà hát?", "eng": "Which side of the theatre would you like to sit?"}, {"viet": "Cảnh sát nghi ai ( là thủ phạm tội ác đó )?", "eng": "Who do the police suspect ( of the crime )?"}, {"viet": "Tại sao mày lại làm mẹ mày lo lắng như thế?", "eng": "Why did you go and upset your mother like that?"}, {"viet": "Tại sao cái kẻ tự bổ nhiệm mình là người bảo vệ đạo đức của quần chúng có thể nói cái gì chúng ta có thể và không thể xem trên vô tuyến?", "eng": "Why should this self-appointed guardian of public morals say what we can and cannot watch on television?"}, {"viet": "Anh trông nom cửa hàng trong lúc tôi ra ngoài ăn trưa chứ?", "eng": "Will you keep shop while I go out for lunch?"}, {"viet": "Do bụi mù lên chung quanh, ông ta đã không nhịn được hắt hơi.", "eng": "With all that dust about, he couldn't stop sneezing."}, {"viet": "Việc xây dựng con đường mới sẽ tạo ra nhiều khó khăn cho xe cộ.", "eng": "Work on the new road will create a lot of difficulties for traffic."}, {"viet": "Ông có muốn tôi gói nó cho ông không?", "eng": "Would you like me to wrap it for you?"}, {"viet": "Xin quý khách vui lòng bảo đảm rằng dây an toàn của quý khách đã được cài chặt và bàn ăn của quý khách đang ở vị trí dựng đứng khi chuẩn bị cất cánh?", "eng": "Would you please ensure that your seat – belts are securely fastened and your tables are in the upright position in preparing for take-off?"}, {"viet": "Đã mất nhiều năm làm việc để chuẩn bị cuốn từ điển này.", "eng": "Years of work have gone into the preparation of this dictionary."}, {"viet": "Vâng, tỉ gái ngoại tệ thường biến động theo thị trường tiền tệ quốc tế.", "eng": "Yes, the rates for foreign currencies often fluctuate with the international money market."}, {"viet": "Cậu sẽ được một trận đòn nêu thầy giáo phát hiện ra điều cậu làm.", "eng": "You'll get a real pasting if the teacher finds out what you're done."}, {"viet": "Anh không được phép dừng lại trên xa lộ.", "eng": "You're not allowed to stop on motorways."}, {"viet": "Anh phải chịu trách nhiệm trước ông ấy vì sự tổn thất lớn lao.", "eng": "You are accountable to him for the great loss."}, {"viet": "Ít bột vẫn gột lên hồ.", "eng": "You can't make a silk purse out of a sow's ear."}, {"viet": "Bạn có thể ở tạm với chúng tôi thời gian này.", "eng": "You can live with us for the time being."}, {"viet": "Cậu lẻn vào lặng lẽ như thế làm mình hết hồn!", "eng": "You did give me a scare, creeping up on me like that!"}, {"viet": "Anh đã bắt gia đình anh phải chịu đựng nhiều đau khổ.", "eng": "You have put your family through much suffering."}, {"viet": "Trông bạn có vẻ không được khoẻ.", "eng": "You look like you're under the weather."}, {"viet": "Chắc hẳn anh đã nghe nói đến nàng Mona Lisa chứ?", "eng": "You must have heard about Mona Lisa, haven't you?"}, {"viet": "Anh nên xin lỗi và tỏ ra rằng giữa các anh không có tình cảm xấu với nhau.", "eng": "You ought to apologize and show there is no ill feeling between you."}, {"viet": "Anh không nên dùng thành ngữ đó-nó không lịch sự.", "eng": "You should not use that expression-it's not polite."}, {"viet": "Anh có muốn uống gì không?'.", "eng": "You want something to drink?."}, {"viet": "Tuy còn trẻ, tôi cũng đã biết tôi muốn theo đuổi nghề gì.", "eng": "Young as I am, I already know what career I want to follow."}, {"viet": "Mẹ anh sẽ rất hài lòng về anh.", "eng": "Your mother will be very pleased with you."}]