[{"viet": "Một cuốn sách làm sống lại nền văn minh của dân tộc Maya.", "eng": "A book that reanimates the Mayan civilization."}, {"viet": "Một đứa bé được nâng niu bảo vệ để khỏi bị khổ sở.", "eng": "A child who has been cushioned from unpleasant experiences."}, {"viet": "Một điều khoản gây bất hòa trong hiệp ước.", "eng": "A contentious clause in a treaty."}, {"viet": "Sự giảm sút mãi lực của đồng đô la.", "eng": "A decline in the purchasing power of the dollar."}, {"viet": "Một chiếc áo đầm được trang trí bằng ren và ruy-băng.", "eng": "A dress embellished with lace and ribbons."}, {"viet": "Một cuốn phim hấp dẫn đặc biệt giới trẻ.", "eng": "A film that appeals specially to the young."}, {"viet": "Một miếng gạc đắp lên vết thương của anh ta.", "eng": "A gauze patch applied to his wound."}, {"viet": "Sự xuyên tạc lố bịch sự thật.", "eng": "A grotesque distortion of the truth."}, {"viet": "Lịch sử phe cánh tả ở châu Âu.", "eng": "A history of the Left in Europe."}, {"viet": "Một căn bếp ở phía sau nhà.", "eng": "A kitchen to the rear of the house."}, {"viet": "Một ánh sáng xuất hiện ở cuối đường hầm.", "eng": "A light appeared at the end of the tunnel."}, {"viet": "Một bản báo cáo có uy tín về lịch sử tiếng Anh.", "eng": "A magisterial account of the history of the English language."}, {"viet": "Một tên đồ tể bất lương giết người vô tội như ngóe.", "eng": "A mindless butcher of innocent people."}, {"viet": "Một kỷ nguyên mới trong lịch sử nước của chúng ta.", "eng": "A new era in the history of our country."}, {"viet": "Một cái mũ che tai màu xanh lá cây.", "eng": "A pair of green ear-muffs."}, {"viet": "Một cụm từ đã được chế ra để dùng cho một dịp duy nhất.", "eng": "A phrase that was minted for one occasion."}, {"viet": "Một cuộc khám nghiệm tử thi cho thấy nạn nhân bị đầu độc.", "eng": "A post-mortem showed that the victim had been poisoned."}, {"viet": "Một hàng xe ôtô nối đuôi nhau tại chỗ đèn hiệu giao thông.", "eng": "A queue of cars at the traffic-lights."}, {"viet": "Một bức tranh ghép nhiều màu sắc có đồng cỏ, sông, rừng.", "eng": "A rich mosaic of meadows, rivers and woods."}, {"viet": "Một vùng biển nhiều đảo nhỏ rải rác.", "eng": "A sea studded with small islands."}, {"viet": "Một cách tiếp cận vấn đề không mấy thông minh.", "eng": "A simple-minded approach to the problem."}, {"viet": "Một miếng trùm cách âm để che máy in vi tính.", "eng": "A soundproof hood for the computer printer."}, {"viet": "Một dòng suối chảy quanh co qua khu rừng.", "eng": "A stream twining through the forest."}, {"viet": "Một xêri phát trên truyền hình là một xêri các lần trình chiếu trên truyền hình.", "eng": "A television series is a series of shows on televisions."}, {"viet": "Một bài báo khoa trương về luật pháp Trung cổ.", "eng": "A turgid article on medieval law."}, {"viet": "Cá voi là một loài cá Đúng hay sai?", "eng": "A whale is a fish True or false?"}, {"viet": "Lông rậm rạp mọc trên bộ ngực rộng của anh ta.", "eng": "Abundant hair sprouted from his broad chest."}, {"viet": "Tài liệu thêm được in đè lên bằng màu đỏ.", "eng": "Additional material is overprinted in red."}, {"viet": "Sau mười năm sống tha hương, bác của cô ta đã quay về nước Anh.", "eng": "After an exile of ten years her uncle returned to Britain."}, {"viet": "Sau khi nàng chết, chàng bắt đầu uống nhiều.", "eng": "After she died, he began to hit the bottle."}, {"viet": "Ngôn ngữ chắp dính kết hợp các từ loại thành một chuỗi dài để tạo thành câu.", "eng": "Agglutinative languages combine parts of words into long sequences to form sentences."}, {"viet": "Tất cả những câu hỏi của tôi chỉ được anh ta đáp lại bằng sự im lặng.", "eng": "All my questions were met with silence from him."}, {"viet": "Tất cả tù nhân đang tuyệt thực đều phải bị cưỡng bức ăn uống.", "eng": "All the prisoners on hunger strike had to be force-fed."}, {"viet": "Nói chung kỳ nghỉ thật chán.", "eng": "Altogether the holiday was very disappointing."}, {"viet": "Một diễn biến đáng lo ngại trong quan hệ quốc tế.", "eng": "An alarming turn in international relations."}, {"viet": "Một hình bóng khổng lồ mờ mờ lù lù hiện ra trong bóng tối.", "eng": "An enormous shape looming out of the darkness."}, {"viet": "Một người hiểu biết trong quần chúng.", "eng": "An informed member of the public."}, {"viet": "Một hiệu cắt tóc bình thường là được rồi.", "eng": "An ordinary barber-shop will do."}, {"viet": "Và để mọi chuyện tệ hơn, dịch vụ này chậm hẳn lại.", "eng": "And to make things worse, service has slowed down."}, {"viet": "Bất cứ chi phí nào mà bạn có thể gánh chịu sẽ được tính vào công ty.", "eng": "Any expenses you may incur will be chargeable to the company."}, {"viet": "Những quả táo đó đủ chín để ăn được chưa?", "eng": "Are the apples ripe to eat yet?"}, {"viet": "Anh có nhận thức được mối nguy anh đang gặp không?", "eng": "Are you fully awake to the danger you're in?"}, {"viet": "Những vùng ở Phi châu chịu ảnh hưởng của hạn hán.", "eng": "Areas of Africa affected by drought."}, {"viet": "Theo như tôi có thể xét thì tất cả họ đều đáng trách.", "eng": "As far as I can judge, they are all to blame."}, {"viet": "Khi chúng tôi lên đến đỉnh đồi chúng tôi trông thấy tòa lâu đài đó.", "eng": "As we crested the hill, we saw the castle."}, {"viet": "Ít nhất thì anh cũng đã không bị thương-đó là một điều an ủi.", "eng": "At least you weren't hurt-that's one consolation."}, {"viet": "Đội Úc bắt thăm được và yêu cầu đội Anh ra bóng trước.", "eng": "Australia won the toss and put England in to bat."}, {"viet": "Hãy cẩn thận đừng khai báo sai trường hợp của anh.", "eng": "Be careful not to misstate your case."}, {"viet": "Kiên định về các nguyên tắc của ai.", "eng": "Be steadfast to one's principles."}, {"viet": "Bị điếc và câm gây khó khăn trong việc giao tiếp.", "eng": "Being deaf and dumb makes communication very difficult."}, {"viet": "Trộn trứng và sữa lẫn với nhau.", "eng": "Blend the eggs and milk together."}, {"viet": "Làm mất danh dự trung đoàn của ai.", "eng": "Bring dishonour on one's regiment."}, {"viet": "Nhưng ngành ngân hàng đã mất tính quan trọng trước đó của nó sau khi đế quốc La Mã tan rã.", "eng": "But banking lost its previous importance after the breakup of the Rome Empire."}, {"viet": "Nhưng có lẽ kỳ quan ngầm quyến rũ nhất trong tất cả, và chắc chắn hệ thống phức tạp nhất được xây dựng là trung tâm xe điện ngầm Yaesu ở giữa Tokyo, nơi mà bốn đường xe điện ngầm nối với nhau.", "eng": "But probably the most attractive of the underground wonders, and certainly the most complicated to build, is the Yaesu Subcentre at the heart of Tokyo, where four subway lines link up."}, {"viet": "Nhờ trù tính thận trọng bà ta đã thương lượng được một mức tăng lương đáng kể.", "eng": "By careful strategy she negotiated substantial pay rise."}, {"viet": "Còn gọi tao như thế nữa tao sẽ cho mày một trận đấy!", "eng": "Call me that again and I'll knock your block off!"}, {"viet": "Tôi có thể giao cho anh gửi bức thư này được không?", "eng": "Can I trust you to post this letter?"}, {"viet": "Bạn có thể chở tôi tới đó được không?", "eng": "Can you give me a ride over there?"}, {"viet": "Bạn có thể nói cho tôi biết tai nạn xảy ra như thế nào không?", "eng": "Can you tell me how the accident came about?"}, {"viet": "Vỏ đạn văng ra khỏi nòng súng sau khi bắn.", "eng": "Cartridge are ejected from the gun after firing."}, {"viet": "Trẻ em học viết chữ in khi mới đi học.", "eng": "Children learn to print when they first go to school."}, {"viet": "Rẽ một lối đi qua rừng rậm.", "eng": "Cleave a path through the jungle."}, {"viet": "Xuất thân từ một môi trường xã hội khác, lúc đầu bà ta nhận thấy cuộc đời làm vợ của một diễn viên rất xa lạ.", "eng": "Coming from another milieu, she found life as an actor's wife very strange at first."}, {"viet": "Chúc mừng bạn thi đậu vào kỳ thi tuyển vào trường Đại Học Stanford.", "eng": "Congratulations on your passing the entrance examination to Stanford University."}, {"viet": "Em có thể giữ con cho anh chị vào thứ Sáu được không?", "eng": "Could you baby-sit for us on Friday?"}, {"viet": "Anh có thể cho tôi biết quầy nhận chuyển tiền đến ở đâu được không?", "eng": "Could you tell me where the counter for inward remittance is?"}, {"viet": "Cắt bột nhồi ra thành nhiều khoanh nhỏ.", "eng": "Cut the pastry into small rounds."}, {"viet": "Dải khâu nhún thanh nhã trên áo đầm của một em bé.", "eng": "Delicate smocking on a baby's dress."}, {"viet": "Quyết tâm vượt hơn anh của cô ấy trong công việc và thể thao.", "eng": "Determined to outdo her brother at work and games."}, {"viet": "Các anh có định làm việc trên cùng một tàu không?", "eng": "Did you plan to be on the same ship?"}, {"viet": "Cất nước tinh khiết từ nước biển.", "eng": "Distil fresh water from sea-water."}, {"viet": "Những bức tranh này có lôi cuốn anh không?", "eng": "Do these paintings appealed to you?"}, {"viet": "Bạn có theo dõi bóng chày của các đội lớn thuộc liên đoàn không?", "eng": "Do you follow major league baseball?"}, {"viet": "Ở nước bạn có lốc xoáy không?", "eng": "Do you have tornadoes in your home country?"}, {"viet": "Bạn cảm phiền cho tôi xuống xe nhà bạn John được không?", "eng": "Do you mind dropping me off at John's house?"}, {"viet": "Bạn có nghĩ rằng trở nên giàu có sẽ làm người ta hạnh phúc không?", "eng": "Do you think that becoming very rich will make a person happy?"}, {"viet": "Các bác sĩ làm việc suốt đêm để cứu sinh mạng người bị thương đó.", "eng": "Doctors worked through the night to save the life of the injured man."}, {"viet": "Đừng để tình cảm chi phối chính anh.", "eng": "Don't allow yourself to be ruled by emotion."}, {"viet": "Đừng quên mang theo túi nhựa để hốt phân nhé.", "eng": "Don't forget to bring a plastic bag to pick droppings."}, {"viet": "Đừng táy máy hệ thống dây điện: mày đâu có phải là thợ điện.", "eng": "Don't meddle with the electrical wiring: you are not an electrician."}, {"viet": "Đừng vứt rác bừa bãi như thế.", "eng": "Don't throw litter about like that."}, {"viet": "Ép được ai chịu một sự nhượng bộ.", "eng": "Drag a concession out of somebody."}, {"viet": "Mỗi phòng ngủ trong khách sạn đều có kèm một phòng tắm.", "eng": "Each bedroom in the hotel has an en suite bathroom."}, {"viet": "Quân địch đang nắm quyền kiểm soát thành phố.", "eng": "Enemy forces are in control of the city."}, {"viet": "Ngay cả các tòa nhà làm bằng xi măng cũng có thép bên trong xi măng.", "eng": "Even the cement buildings have steel inside the cement."}, {"viet": "Việc khai quật khu di tích này sẽ bắt đầu ngày mai.", "eng": "Excavation of the site will begin tomorrow."}, {"viet": "Chịu sự cuồng nộ của thiên nhiên tác động.", "eng": "Exposed to the fury of the elements."}, {"viet": "Vì không có đề nghị nào đạt hơn, tôi đã chấp nhận đề nghị của họ.", "eng": "Faute de mieux, I accepted their offer."}, {"viet": "Tìm thêm một hội trường nhỏ hơn để giải tỏa bớt một số quá đông số người dự họp chính.", "eng": "Find a smaller hall for the overflow from the main meeting."}, {"viet": "Ép mình sát vào tường để cho người ta đi qua.", "eng": "Flatten oneself against a wall to let people get by."}, {"viet": "Hàng dặm nối tiếp nhau thấy không cái gì cả chỉ toàn là sa mạc.", "eng": "For miles and miles there's nothing but desert."}, {"viet": "Fred giật tóc con em làm nó khóc.", "eng": "Fred pulled his sister's hair and made her cry."}, {"viet": "Ra mật hiệu cho tôi là đã đến lúc phải đi.", "eng": "Gave me the high sign that it was time to leave."}, {"viet": "Gilray được nhiều người coi là cha đẻ của tranh biếm họa chính trị hiện đại.", "eng": "Gilray is considered by many to be the father of the modern political cartoon."}, {"viet": "Kính, các đà trần, và các đồ cổ, tất cả đều góp phần tạo nên một ấn tượng rõ rệt về trang trí.", "eng": "Glass, exposed beams, and antiques all combine to make a strong decorative statement."}, {"viet": "Bị chơi xấu khi họ mua căn nhà đó.", "eng": "Got a shafting when they bought that house."}, {"viet": "Hamlet ở trong chương trình văn chương Anh năm nay.", "eng": "Hamlet is on this year's English literature syllabus."}, {"viet": "Người ta đã thông báo khi nào cuộc đua bắt đầu chưa?", "eng": "Have they announced when the race will begin?"}, {"viet": "Bạn đã bao giờ thử bấm huyệt hay châm cứu chưa?", "eng": "Have you ever tried acupressure or acupuncture?"}, {"viet": "Anh đã đưa cô ấy đi chơi chưa?", "eng": "Have you taken her out yet?"}, {"viet": "Anh ấy là một người chính trực, anh ấy sẽ không thất hứa.", "eng": "He's a man of integrity, he won't break his promise."}, {"viet": "Ông ta cảm thấy khó chịu kể từ lúc được giải phẫu.", "eng": "He's been out of sorts since the operation."}, {"viet": "Ông ấy trở lại thời kỳ như trẻ con, chơi đồ chơi tàu hoả với cháu.", "eng": "He's in his second childhood, playing with his grandson's toy trains."}, {"viet": "Nó rất khôi hài-nó luôn luôn làm tôi buồn cười.", "eng": "He's so funny-he always makes me laugh."}, {"viet": "Anh ấy hành động theo niềm tin của mình.", "eng": "He acted in accordance with his beliefs."}, {"viet": "Anh ta đến tuổi 25 trước khi lập gia đình.", "eng": "He attained the age of 25 before marrying."}, {"viet": "Ông ta xây một nhà nguyện làm điện thờ để tưởng nhớ đến người vợ quá cố của mình.", "eng": "He built a chapel as a shrine to the memory of his dead wife."}, {"viet": "Anh ta chẻ các khúc gỗ ra làm củi.", "eng": "He chopped the logs up into firewood."}, {"viet": "Anh ấy băng qua khu vườn bằng ba cú nhảy.", "eng": "He crossed the garden in three leaps."}, {"viet": "Ông ấy chết trong Thế chiến thứ hai.", "eng": "He died in the Second World War."}, {"viet": "Ông ta ôm lấy đứa bé trong vòng tay thương yêu.", "eng": "He enfolded the child in an affectionate embrace."}, {"viet": "Anh ta cảm thấy rằng những nỗ lực của mình không được trân trọng.", "eng": "He felt that his efforts were unappreciated."}, {"viet": "Anh ta trả lời tôi bằng một câu lửng lơ.", "eng": "He gave me an indefinite answer."}, {"viet": "Anh ta nghiến răng với nhau kèn kẹt vì thất bại.", "eng": "He ground his teeth together in frustration."}, {"viet": "Nó đã phải len lỏi tìm đường chui ra.", "eng": "He had to wriggle his way out."}, {"viet": "Ông ta được nhiều người đoán là người kế vị Tổng Thống.", "eng": "He has been widely tipped to succeed the President."}, {"viet": "Anh ấy đã cố gắng dùng đủ mọi phương pháp chữa trị nhưng không thành.", "eng": "He has tried all sorts of cures, but without success."}, {"viet": "Nghe anh ta nói chuyện thật là thích thú.", "eng": "He is a great joy to listen to."}, {"viet": "Ông ta là một trong những nhà thông thái lớn nhất của thời đại.", "eng": "He is one of the greatest minds of the age."}, {"viet": "Anh ấy vừa lập gia đình tháng rồi.", "eng": "He just got married last month."}, {"viet": "Anh ta thích khoe mình nói tiếng Pháp giỏi như thế nào.", "eng": "He likes showing off how well he speaks French."}, {"viet": "Anh ta yêu tôi nhiều hơn anh yêu tôi.", "eng": "He loves me more than you do."}, {"viet": "Hắn đã giết vợ mình bằng một con dao.", "eng": "He murdered his wife with a knife."}, {"viet": "Anh ấy nợ cha anh ấy 50 bảng Anh.", "eng": "He owes his father £ 50."}, {"viet": "Ông ta đã nắm quyền điều hành nền kinh tế trong suốt thời gian khủng hoảng và nguy nan lớn nhất của nó.", "eng": "He presided over the economy during the period of its greatest stress and danger."}, {"viet": "Anh ta giơ búa quai tảng đá một cái cực mạnh.", "eng": "He raised the hammer and struck the rock a mighty blow."}, {"viet": "Anh ta nhớ lại một cách cay đắng cha anh ta đã bị lừa như thế nào.", "eng": "He remembered with bitterness how his father was cheated."}, {"viet": "Anh ta là một người khá dễ chịu.", "eng": "He's a harmless enough chap."}, {"viet": "Hiện giờ anh ta đang thất nghiệp và sống nhờ vào trợ cấp xã hội.", "eng": "He's currently out of work and on social security."}, {"viet": "Hắn ta không hơn gì một tên ăn cắp tầm thường.", "eng": "He's no better than a common thief."}, {"viet": "Anh ta đã tăng giá đề nghị lên 300 bảng Anh.", "eng": "He's upped his offer to £ 300."}, {"viet": "Cùng một việc đôi khi ông ta nói thế này rồi lúc khác thế khác.", "eng": "He says sometimes the one thing at other times the exact opposite."}, {"viet": "Đáng lẽ ra là nó phải làm việc nhưng nó lại bận rộn với chuyện khác.", "eng": "He should have been working, but he was otherwise engaged."}, {"viet": "Anh ta tránh xúc phạm cô ta bằng cách không phê bình chồng cô trước mặt cô ta.", "eng": "He spared her feelings by not criticizing her husband in front of her."}, {"viet": "Chàng bám chặt nàng như đỉa.", "eng": "He sticks to her like glue."}, {"viet": "Ông ta chịu đựng tất cả những sự chỉ trích không nói một lời.", "eng": "He swallowed all the criticism without saying a thing."}, {"viet": "Ông ta đã kể cho tôi câu chuyện thật thương tâm về việc vợ mình đã bỏ nhà đi theo người bạn thân nhất của mình ra sao.", "eng": "He told me a real sob-story of how his wife had gone off with his best friend."}, {"viet": "Hắn đã lừa tôi đưa tiền cho hắn.", "eng": "He tricked me into giving him the money."}, {"viet": "Nó vốn là một đứa bé rất gầy nhưng gần đây nó đã mập ra rất nhiều.", "eng": "He used to be a very thin child but he's filled out a lot recently."}, {"viet": "Ông ta hoàn toàn là một người thanh lịch thật sự.", "eng": "He was a real gentleman, first and last."}, {"viet": "Anh ta sinh ở Anh nhưng được học ở Mĩ.", "eng": "He was born in England, but was educated in America."}, {"viet": "Nó bị bọn du côn đánh tơi bời sau một trận bóng đá.", "eng": "He was done over by a gang of thugs after a football match."}, {"viet": "Nó chẳng hy vọng gì trong việc học tiếng Pháp, nhưng thầy giáo kiên trì dạy nó.", "eng": "He was hopeless at French, but his teacher persevered with him."}, {"viet": "Có một thời nó hết sức nhút nhát nhưng bây giờ thì nó lại đi vào thái cực ngược lại.", "eng": "He was once terribly shy but now he's gone to the opposite extreme."}, {"viet": "Buổi chiều anh ta bị ốm nhưng hôm sau anh ta lại hình như hoàn toàn khoẻ mạnh trở lại.", "eng": "He was sick in the evening, but the following day he seemed quite well again."}, {"viet": "Anh ta hết sức bẽ mặt vì lời nói châm chọc của cô ta.", "eng": "He was totally fattened by her sarcasm."}, {"viet": "Anh ta đã chè chén tưng bừng ba ngày rồi.", "eng": "He went on a three-day binge."}, {"viet": "Nó băn khoăn không biết họ có cần gửi một số tiền đặt cọc không.", "eng": "He wondered whether they need send a deposit."}, {"viet": "Nghe những bản nhạc xưa đó làm tôi hơi nhớ đến quá khứ.", "eng": "Hearing those old songs takes me back a bit."}, {"viet": "Cô ấy đến trùng với lúc tôi ra đi.", "eng": "Her arrival coincided with our departure."}, {"viet": "Các người cộng sự của cô ấy đã cố tình bưng bít tin tức.", "eng": "Her Colleague had deliberately keep her uninformed."}, {"viet": "Mắt nàng đỏ hoe và đẫm lệ.", "eng": "Her eyes were red and watery."}, {"viet": "Niềm sung sướng thấy anh ta đã nhận chìm những lo lắng trước đây của nàng.", "eng": "Her happiness at seeing him submerged her former worries."}, {"viet": "Tài liệu mới nhất của bà ta là đề cập đến nạn thất nghiệp trong thanh niên.", "eng": "Her latest documentary is concerned with youth unemployment."}, {"viet": "Băng nhạc mới của cô ấy không được phát nhiều.", "eng": "Her new single hasn't had much airtime."}, {"viet": "Vụ cô ta bị hãm hiếp gây cho cô ta một hậu quả tâm lý xấu xa.", "eng": "Her rape had a profound psychological effect on her."}, {"viet": "Những bài nói chuyện của bà ta hơi thiếu dí dỏm.", "eng": "Her speeches are rather short on wit."}, {"viet": "Tác phẩm của cô ta đã bị quên lãng quá nhiều trong một thời gian quá dài.", "eng": "Her work has been too much ignored for too long."}, {"viet": "Sự vắng mặt nhiều lần thường là dấu hiệu của sự bất mãn về công việc.", "eng": "High absenteeism often symptomizes job dissatisfaction."}, {"viet": "Những nỗ lực của anh ta về nấu ăn hoàn toàn là một trò cười.", "eng": "His attempts at cooking are a complete joke."}, {"viet": "Bộ ngực hắn ta có đầy hình xăm.", "eng": "His chest was covered in tattoos."}, {"viet": "Việc thải hồi anh ta là một việc khá khó chịu đối với tất cả những ai liên quan.", "eng": "His dismissal was rather a sticky business for all concerned."}, {"viet": "Bố nó đã tống cổ nó ra khỏi nhà.", "eng": "His father booted him out of the house."}, {"viet": "Sức khoẻ của ông ấy bị suy sụp vì làm việc quá nhiều.", "eng": "His health collapsed under the pressure of work."}, {"viet": "Vở kịch gần đây nhất của anh ấy đã được tờ báo địa phương viết bài khen ngợi nhiệt liệt.", "eng": "His latest play was given an enthusiastic write-up in the local press."}, {"viet": "Tên anh ta nghe có vẻ quen quen, có lẽ chúng tôi đã gặp nhau ở đâu đó.", "eng": "His name rings a bell, perhaps we've met somewhere."}, {"viet": "Lời cam kết chính trị của ông ta chỉ là lời hứa suông.", "eng": "His political commitment is only skin-deep."}, {"viet": "Hình vẽ của ông ta được đưa vào xưởng vẽ gia công.", "eng": "His sample was worked up in the studio."}, {"viet": "Việc anh ta đột ngột bỏ đi cho thấy rằng anh ta là người không thể tin được.", "eng": "His sudden departure demonstrates that he's unreliable."}, {"viet": "Vợ anh ta là tất cả cái gì mà một người đàn ông có thể mong ước.", "eng": "His wife is everything a man could wish for."}, {"viet": "Khoét thân cây làm một cái tổ.", "eng": "Hollow out a nest in a tree trunk."}, {"viet": "Thế nào, có đi chơi một chuyến ra bờ biển không?''Có chứ!'.", "eng": "How about a trip to the coast?''Rather!'."}, {"viet": "Làm sao bạn có thể chịu đựng được những điều kiện như thế?", "eng": "How could you abide such conditions?"}, {"viet": "Anh làm thế nào mà phân biệt được nguyên bản với bản giả?", "eng": "How do you know a fake from the original?"}, {"viet": "Đi từ nước bạn đến Nhật Bản bằng máy bay mất bao lâu?", "eng": "How long does it take to travel from your country to Japan by plane?"}, {"viet": "Trong một nghìn có bao nhiêu trăm?", "eng": "How many hundreds are there in a thousand?"}, {"viet": "Bạn nghĩ chúng ta có thể ăn được bao nhiêu?", "eng": "How much do you think we can eat?"}, {"viet": "Thầy giáo làm thế nào để giúp lấp khoảng cách thế hệ giữa bố mẹ và con cái vị thành niên của họ?", "eng": "How teachers help to bridge the generation gap between parents and their teenage children?"}, {"viet": "Hydrô và ô-xy kết hợp với nhau và Hydrô kết hợp với ô-xy để tạo thành nước.", "eng": "Hydrogen and oxygen combine and Hydrogen combines with oxygen to form water."}, {"viet": "Tôi muốn gởi lá thư này tới Nhật bằng đường hàng không.", "eng": "I'd like to send this letter to Japan by air mail."}, {"viet": "Tôi sẽ tìm cách trả thù hắn ta!", "eng": "I'll find a way of getting back at him!"}, {"viet": "Tôi sẽ cho hắn biết tay vì cái trò xỏ lá hắn chơi tôi.", "eng": "I'll pay him back for the trick he played on me."}, {"viet": "Tôi e rằng thỉnh thoảng tôi rất đãng trí.", "eng": "I'm afraid I'm sometimes very forgetful."}, {"viet": "Anh đang tính toán xem anh có bao nhiêu chỗ trống để nhét thêm đồ đạc.", "eng": "I'm figuring out how much space I have to pack more things away."}, {"viet": "Tôi hi vọng ngày mai cô ấy sẽ tới.", "eng": "I'm hopeful that she will come tomorrow."}, {"viet": "Tôi không chắc là tôi hiểu hết được ( ý anh ).", "eng": "I'm not sure that I fully understand ( you )."}, {"viet": "Tôi thật tiếc không giúp bạn được, vì trước hết là tôi đang vội và thứ hai là tôi bị đau lưng.", "eng": "I'm sorry I can't help you, for one thing I'm in a hurry, and for another I have a bad back."}, {"viet": "Anh mệt, nhưng chúng ta hãy chờ đến khi bắn xong pháo hoa đã.", "eng": "I'm tired, but let's wait until the fireworks are finished."}, {"viet": "Tôi đã giữ vị trí này được 2 năm.", "eng": "I've been in this position for two years."}, {"viet": "Tôi có kỳ nghỉ 10 ngày bắt đầu vào ngày 25 tháng 7.", "eng": "I've got a ten-day vacation starting July 25."}, {"viet": "Trong đời tôi chưa bao giờ bực bội đến như thế.", "eng": "I've never been so annoyed in all my life."}, {"viet": "I, me, we và us là các đại từ ngôi thứ nhất.", "eng": "I, me, we and us are first-person pronouns."}, {"viet": "Tôi luôn dẫn con chó đi dạo bộ một quãng ngắn vào buổi tối trước khi đi ngủ.", "eng": "I always take the dog for a short walk last thing before going to bed."}, {"viet": "Tôi nói với anh điều này chỉ là để mở mang trí tuệ cho anh mà thôi.", "eng": "I am telling you this simply for your edification."}, {"viet": "Tôi xin có ý kiến khác.", "eng": "I beg to differ with you."}, {"viet": "Tình cờ tôi tìm ra được câu trả lời thích hợp.", "eng": "I came upon the right answer by accident."}, {"viet": "Tôi không thể trả nợ anh 50 xu mà không xé lẻ một tờ 5 bảng Anh.", "eng": "I can't pay the 50p I owe you without breaking into a £ 5 note."}, {"viet": "Tôi có thể ước tính sơ bộ số lượng gạch anh cần đến.", "eng": "I can give you a rough estimate of the number of bricks you will need."}, {"viet": "Tôi không thể tìm ra những tờ giấy đó.", "eng": "I can't find the papers."}, {"viet": "Tôi hiểu những lời nói của ông ta như là một sự từ chối.", "eng": "I construed his statements as a refusal."}, {"viet": "Đơn giản là tôi rất vui lòng giúp đỡ.", "eng": "I'd be only too glad to help."}, {"viet": "Tôi đã cố gắng hết sức ngăn cô ta lại.", "eng": "I did my best to stop her."}, {"viet": "Tôi không tham dự vào những công việc như thế.", "eng": "I do not engage myself in such affairs."}, {"viet": "Tôi không biết cô ta có thật sự đau ốm không hay đó chỉ là một điều ảo tưởng của cô ta mà thôi.", "eng": "I don't know whether she's really ill or whether it's just a figment of her imagination."}, {"viet": "Tôi nghĩ rằng cái giá sẽ không chịu nổi nếu chúng ta chất thêm một thứ gì nữa lên đó.", "eng": "I don't think the shelf will hold if we put anything else on it."}, {"viet": "Tôi không giao du với nhóm người ấy.", "eng": "I don't associate with that crowd."}, {"viet": "Tôi nằm mơ thấy tôi bay lên Mặt Trăng.", "eng": "I dreamt I was flying to the moon."}, {"viet": "Tôi cảm thấy khoẻ hơn bởi không khí trong lành này!", "eng": "I feel invigorated by all this fresh air!"}, {"viet": "Tôi thấy nhiều kiểu kiến trúc hiện đại cực kỳ xấu.", "eng": "I find much modern architecture quite appalling."}, {"viet": "Tôi bảo đảm với anh là chuyện này sẽ không xảy ra nữa.", "eng": "I give you my word that this won't happen again."}, {"viet": "Tôi đã tìm cái chìa khoá đó kĩ lắm.", "eng": "I had a good hunt for that key."}, {"viet": "Tôi phải kìm không nói cho anh ta biết điều tôi nghĩ về anh ta.", "eng": "I had to restrain myself from telling him what I thought him."}, {"viet": "Tôi đã sắp xếp một cuộc họp ngày mai.", "eng": "I have arranged a meeting for tomorrow."}, {"viet": "Tôi không có điểm gì giống Jane cả.", "eng": "I have nothing in common with Jane."}, {"viet": "Tôi không có tiền mặt, tôi sẽ phải viết cho anh một tờ séc.", "eng": "I haven't any cash, i'll have to write you a cheque."}, {"viet": "Tôi nghe nói Tom lại thi hỏng nữa.", "eng": "I hear Tom failed his exam again."}, {"viet": "Tôi hy vọng quan tòa sẽ khoan hồng.", "eng": "I hope the judge will be lenient."}, {"viet": "Tôi chỉ cảm thấy không được khoẻ.", "eng": "I just don't feel good."}, {"viet": "Tôi biết cái này của anh đúng không?", "eng": "I know this one is yours, right?"}, {"viet": "Buổi tối tôi thích nghỉ ngơi không làm gì cả.", "eng": "I like to sit back and rest in the evenings."}, {"viet": "Tôi sẽ tìm ra hắn, bất kỳ hắn ở đâu.", "eng": "I'll find him, wherever he is."}, {"viet": "Vui lòng cho tôi mua cái quần xám đó.", "eng": "I'll take the grey trousers, please."}, {"viet": "Trời ơi tôi đâu có biết!", "eng": "I'm blest if I know!"}, {"viet": "Tôi đang tìm một chỗ ở mới.", "eng": "I'm looking for a new place to live."}, {"viet": "Rất tiếc chúng tôi hết xe hơi tự động rồi.", "eng": "I'm sorry we are out of automatics."}, {"viet": "Tôi đề cập đến điều đó chỉ ngẫu nhiên thôi.", "eng": "I mention it only as an aside."}, {"viet": "Tôi phải lo cho xong bữa ăn trưa sớm.", "eng": "I must see about lunch soon."}, {"viet": "Tôi không bao giờ từ chối việc linh tinh lặt vặt để tăng thêm thu nhập-năng nhặt chặt bị mà.", "eng": "I never refuse odd jobs to supplement my income-it's all grist to the mill."}, {"viet": "Tôi hiểu lời bình luận của ông ta là một thách thức.", "eng": "I perceived his comment as a challenge."}, {"viet": "Tôi với tay lên và lấy một quả táo trên cây.", "eng": "I reached up and took an apple from the tree."}, {"viet": "Tôi lấy làm tiếc nói rằng công việc đó đã có người phụ trách rồi.", "eng": "I regret to say the job has been filled."}, {"viet": "Tôi thấy đứa bé sắp ngã và tôi tóm lấy nó kịp thời.", "eng": "I saw the baby was about to fall off and I caught it just in the nick of time."}, {"viet": "Tôi sẽ gặp Mary vào một vài ngày tới.", "eng": "I shall see Mary in a few days'time."}, {"viet": "Tôi sống cái thời gian ít ỏi mà tôi có với gia đình mình.", "eng": "I spent what little time I had with my family."}, {"viet": "Tôi đưa các con lớn của tôi đến bể bơi một tuần một lần.", "eng": "I take my older children to the baths once a week."}, {"viet": "Tôi nghĩ có lẽ đó là thành phố đẹp nhất ở Mỹ-tất cả những ngọn đồi, vịnh với các con sóng, và những ngôi nhà cổ duyên dáng thời Victoria đó.", "eng": "I think it may be the most beautiful city in the U. S.-all those hills, the bay with waves, and those charming old Victorian houses."}, {"viet": "Tôi nghĩ anh sẽ hói sớm.", "eng": "I think you will suffer from early baldness."}, {"viet": "Tôi thả tay trong nước khi chiếc thuyền trôi đi.", "eng": "I trailed my hand in the water as the boat drifted along."}, {"viet": "Tôi thường đi làm bằng xe buýt vào buổi sáng.", "eng": "I usually bus it to work in the morning."}, {"viet": "Tôi muốn tránh mọi chuyện cãi cọ với hàng xóm láng giềng.", "eng": "I want to avoid any unpleasantness with the neighbours."}, {"viet": "Tôi muốn nói chuyện với ông giám đốc nhưng tôi lại chỉ liên lạc được với cô thư ký của ông ta.", "eng": "I wanted to speak to the manager but I got his secretary instead."}, {"viet": "Tôi đã may mắn có được một thầy giáo giỏi.", "eng": "I was fortunate in having a good teacher."}, {"viet": "Tôi thật sự lúng túng khi mất chìa khoá.", "eng": "I was really up the creek when I loss my keys."}, {"viet": "Tôi rất vui mừng nhận được thư anh.", "eng": "I was v pleased to get your letter."}, {"viet": "Tôi sẽ không đề cập tới công việc tài chính đáng ngờ của địch thủ của tôi.", "eng": "I will not bring up my opponent's questionable financial dealings."}, {"viet": "Tôi không thể dung thứ sự xử sự của anh theo cách này.", "eng": "I won't tolerate such your behaving in this way."}, {"viet": "Tôi sẽ rất tiếc nếu anh nghĩ là tôi đã không quan tâm.", "eng": "I would hate you to think I didn't care."}, {"viet": "Không bao giờ tôi cố ý xúc phạm tình cảm của cô.", "eng": "I would never intentionally hurt your feelings."}, {"viet": "Nếu a giống b và b giống c, tất nhiên a giống c.", "eng": "If a like b and b like c it follows that a like c."}, {"viet": "Nếu tôi mất việc, tôi chẳng có gì bảo vệ cả.", "eng": "If I lose my job, I've got no safety net."}, {"viet": "Nếu muốn giải quyết cuộc tranh chấp này thì cần phải có đôi chút nhân nhượng lẫn nhau.", "eng": "If the dispute is to be resolved there must be some give and take."}, {"viet": "Nếu chúng ta miệt mài làm liên tục, công việc có thể xong ngày hôm nay.", "eng": "If we stick at it, we should finish the job today."}, {"viet": "Nếu bây giờ bạn có thể gặp bất kì người nào trên thế giới, bạn muốn gặp ai?", "eng": "If you could meet anyone in the world, who would you like to meet?"}, {"viet": "Nếu anh cứ để đèn pha sáng thì chẳng bao lâu ắc-quy của xe anh sẽ hết điện.", "eng": "If you leave your headlights on you'll soon run down the battery."}, {"viet": "Nếu anh muốn đi đâu nữa hãy cho tôi biết.", "eng": "If you want to go anywhere else, let's me know."}, {"viet": "Trong bài báo mới đây bà ta đã đả kích mạnh mẽ vào những người chỉ trích của bà ấy.", "eng": "In a recent article she strikes out at her critics."}, {"viet": "Thật ra thì các sản phẩm của chúng tôi là thích hợp nhất cho thị trường của các ông đấy.", "eng": "In fact, our products are the most suitable for your market."}, {"viet": "Theo quan điểm cua tôi, bà ấy là thột trong những tiểu thuyết gia vĩ đại nhất.", "eng": "In my view she's one of the greatest novelists."}, {"viet": "Về lĩnh vực khoa học chính trị.", "eng": "In the domain of political science."}, {"viet": "Trong việc kinh doanh này anh phải tỏ ra cứng rắn và hãy lo cho bản thân mình.", "eng": "In this business you have to be tough, and the devil take the hindmost."}, {"viet": "Tin tức về nơi có thể tìm thấy đứa trẻ.", "eng": "Information respecting the child's whereabouts."}, {"viet": "Liệu tôi có thể rút 1,500 đô la Mỹ không?", "eng": "Is it possible for me to draw US $ 1,500?"}, {"viet": "Chúng ta có thể đi đường khác không?", "eng": "Is there any other route we can take?"}, {"viet": "Không còn giấy ở trong tủ kệ à?", "eng": "Isn't there any in the cabinet?"}, {"viet": "Thật là phi lý thời tiết lạnh thế này mà lại không mặc áo ấm.", "eng": "It's absurd not to wear a coat in such cold weather."}, {"viet": "Không biết là liệu có còn chỗ ở rạp không.", "eng": "It's doubtful whether there'll be any seats left."}, {"viet": "Chỗ đó được coi là nơi nguy hiểm nhất thành phố.", "eng": "It's known as the most dangerous part of the city."}, {"viet": "Đó không phải là ngôi nhà lớn lắm, mà chỉ là túp lều con.", "eng": "It's not very grand house, just a little cottage."}, {"viet": "Đây là lần đầu tiên bức tranh được trưng bày trước công chúng.", "eng": "It's the first time the painting has been displayed to the public."}, {"viet": "Việc này hoàn toàn tùy vào việc anh đi bộ hay bằng xe hơi.", "eng": "It all depends on if you're on foot or by car."}, {"viet": "Đã lâu tôi ấp ủ hi vọng được đến thăm Trung Quốc một ngày nào đó.", "eng": "It has been a long cherished hope of mine to visit China some day."}, {"viet": "Hy vọng là những sự cắt giảm thuế sẽ có tác dụng như tác nhân kích thích sự phát triển kinh tế hơn nữa.", "eng": "It is hoped the tax cuts will act as a stimulant to further economic growth."}, {"viet": "Đó là bản giao hưởng hay nhất xưa nay tôi nghe được.", "eng": "It is the best symphony I've ever heard."}, {"viet": "Chắc là nó ngon như rượu Triều Đại.", "eng": "It must be as good as Dynasty."}, {"viet": "Trời thường lạnh vào tháng 11.", "eng": "It's often cold in November."}, {"viet": "Dường như là nó bị thất lạc.", "eng": "It seems to have gone astray."}, {"viet": "Đó là một kịch bản hay nhưng họ đã làm hỏng nó vì nói năng cường điệu thiếu tự nhiên.", "eng": "It was a good script but they spoiled it by hamming it up."}, {"viet": "Khó lòng mà tìm được lời giải thích.", "eng": "It was hard put to find an explanation."}, {"viet": "Đấy là lần đầu tiên tôi thắng kể từ khi tôi học đánh cờ.", "eng": "It was the first time I'd won since I'd learnt to play chess."}, {"viet": "Từ chức vì một vấn đề nhỏ nhặt như thế thì thật là dại dột và nông nổi.", "eng": "It would be foolish and impetuous to resign over such a small matter."}, {"viet": "Thoạt tiên Jean lo lắng nhưng chẳng bao lâu cô trấn tĩnh lại.", "eng": "Jean was nervous at first but soon composed herself."}, {"viet": "Cứ xem đám đông đứng ngoài cửa chờ đến lượt vào cũng thấy đây là một nơi rất được ưa thích.", "eng": "Judging by the crowds waiting to get in this seems to be where it's at."}, {"viet": "Thiếu số vốn cần thiết để bắt đầu một cuộc kinh doanh.", "eng": "Lack the requisite capital to start a business."}, {"viet": "Chúng ta hãy chờ ở đây trong khi Henry đi lấy xe.", "eng": "Let's wait here while Henry gets the car."}, {"viet": "Như hầu hết những người Mỹ, tôi có nguồn gốc pha trộn.", "eng": "Like most Americans, I'm a mixture."}, {"viet": "Nhiều đồ trang sức bằng vàng đã được nấu chảy để đúc tiền.", "eng": "Many of the gold ornaments were melted down to be made into coins."}, {"viet": "Martin, anh có muốn ăn bánh sandwich không?", "eng": "Martin, would you like a sandwich?"}, {"viet": "Tôi xem những chiếc máy bay được không?", "eng": "May I look at the planes?"}, {"viet": "Thưa cô Collin, tôi đã đặt được bàn tại một nhà hàng Pháp lúc 7 giờ.", "eng": "Miss Collin, I was able to make a reservation at a French restaurant at 7."}, {"viet": "Thôi mẹ, con đã xin lỗi rồi.", "eng": "Mother, I said I'm sorry."}, {"viet": "Cô tôi cho tôi một trong những chiếc trâm của bà làm vật lưu niệm.", "eng": "My aunt gave me one of her brooches as a keepsake."}, {"viet": "Cha tôi là bác sĩ, còn mẹ tôi là luật sư.", "eng": "My father is a doctor, and my mother is a lawyer."}, {"viet": "Những kỷ niệm về thơ ấu của tôi chỉ còn lờ mờ.", "eng": "My memories of childhood are only a blur."}, {"viet": "Bít tất của tôi đã được mạng đi mạng lại.", "eng": "My socks have been darned again and again."}, {"viet": "Chưa bao giờ trong đời tôi được nhìn cảnh đẹp như vậy.", "eng": "Never before in my life have I seen such beautiful sight."}, {"viet": "Không, tôi tự làm tất cả công việc.", "eng": "No, I did it all myself."}, {"viet": "Không ai có thể đoán trước những sự kiện kỳ lạ như vậy.", "eng": "No one could have foretold such strange events."}, {"viet": "Hiện nay ở Trung Quốc, không chỉ có đàn ông, thậm chí cả phụ nữ cũng rất say mê môn chơi này.", "eng": "Now in China, not only men, even women also show great interest in the game."}, {"viet": "Tất nhiên phải ưu tiên việc này-đây là một vấn đề sống còn.", "eng": "Of course this must have priority-it's a matter of life and death."}, {"viet": "Được, tôi sẽ lấy cái này màu đỏ.", "eng": "OK, I'll take this in red."}, {"viet": "Thỉnh thoảng chúng tôi đi ăn nhà hàng-nhưng thường thì chúng tôi ăn ở nhà.", "eng": "Once in a while we go to a restaurant-but usually we eat at home."}, {"viet": "Một trong bãi biển nghỉ mát ưa thích của những người sống thời nữ hoàng Victoria.", "eng": "One of the favourite watering-places of the Victorians."}, {"viet": "Con mèo của chúng tôi già ốm quá nên chúng tôi đã phải giết đi.", "eng": "Our cat was getting so old and sick that we had her put down."}, {"viet": "Thông tin của chúng tôi lượng không nhiều lắm.", "eng": "Our information doesn't amount to much."}, {"viet": "Thành công của chúng tôi tuỳ thuộc vào sự tiếp tục giúp đỡ của các bạn.", "eng": "Our success is contingent upon your continued help."}, {"viet": "Người cha và người mẹ tranh quyền coi sóc con cái.", "eng": "Parents involved in a battle over custody."}, {"viet": "Người ta bình luận về vẻ đẹp của ngôi nhà tranh.", "eng": "People commented on the prettiness of the cottage."}, {"viet": "Chắc cú kiểu đó sẽ làm ta nghèo thôi.", "eng": "Playing safe like that will put us in the poor hour."}, {"viet": "Chắc chắn tivi xách tay có thể có ích đấy.", "eng": "Portable televisions sure can come in handy sometimes."}, {"viet": "Tai nạn của Sasha đã chấm dứt sự nghiệp múa ba lê của nàng.", "eng": "Sasha's accident shut the door on her ballet career."}, {"viet": "Tôi gửi thư theo địa chỉ kinh doanh hay theo địa chỉ nhà riêng của ông ấy?", "eng": "Shall I direct the letter to his business address or to his home address?"}, {"viet": "Cô ta là một người cừ khôi dày kinh nghiệm về môn thể thao lướt sóng.", "eng": "She's a practised exponent of the sport of water-skiing."}, {"viet": "Cô ta đang thu thập tài liệu để viết một bài báo.", "eng": "She's collecting materials for a newspaper article."}, {"viet": "Bà ta đang đan chiếc áo len cho một trong những đứa cháu của bà.", "eng": "She's knitting a jumper for one of her grandchildren."}, {"viet": "Cô ta đang ép chính bản thân cô ta nhịn đói để cố giảm cân.", "eng": "She's starving herself to try to lose weight."}, {"viet": "Bà ấy khuyên nhủ chúng tôi đi tìm sự giúp đỡ về nghiệp vụ.", "eng": "She admonished us to seek professional help."}, {"viet": "Cô ấy mang cho tôi một đôi chim trĩ và hai đôi thỏ.", "eng": "She brought me a brace of pheasants and two braces of rabbits."}, {"viet": "Bà ấy phàn nàn rằng những câu hỏi đã xâm phạm vào đời tư của bà.", "eng": "She complained that the questions were invaded of privacy."}, {"viet": "Cô ta miêu tả nó màu đỏ có diềm hồng.", "eng": "She described it as red with pink frills."}, {"viet": "Cô ta kiếm thêm ít tiền bằng cách trông trẻ.", "eng": "She earns some extra cash from babysitting."}, {"viet": "Cô ta thấy rất nhiều bụi dưới thảm.", "eng": "She found a lot of dust underneath the carpet."}, {"viet": "Cô ta rất lo lắng về kỳ thi.", "eng": "She got herself into a state about the exams."}, {"viet": "Cô ấy phải cúi thấp đầu để đi qua cửa vào.", "eng": "She had to duck her head to get through the low doorway."}, {"viet": "Cô ta chẳng có bạn bè thân thiết nào ngoài hắn.", "eng": "She has no close friends other than him."}, {"viet": "Cô ta nhấn mạnh cô ta không bài xích Do Thái.", "eng": "She insisted that she wasn't anti-Semitic."}, {"viet": "Cô ấy đang quen dần với việc mới của mình một cách êm đẹp.", "eng": "She is settling down well in her new job."}, {"viet": "Cuộc biểu diễn độc tấu của bà ta bắt đầu bằng một bài xonat của Haydn.", "eng": "She led off her recital with a Haydn sonata."}, {"viet": "Cô ta thích hành động giả tạo mỗi khi có đông khán giả.", "eng": "She loves to camp it up whenever she has a large audience."}, {"viet": "Bà chạy chưa bao giờ quá 40 dặm một giờ cả.", "eng": "She never drove it over 40 miles an hour."}, {"viet": "Cô ta chọc chọc vào thức ăn của cô một cách không nhiệt tình.", "eng": "She poked at her meal unenthusiastically."}, {"viet": "Bà ta từ chối gặp đoàn đại biểu của công đoàn.", "eng": "She refused to meet the union delegation."}, {"viet": "Cô ta đã đến đó nhiều lần.", "eng": "She's been there heaps of times."}, {"viet": "Cô ấy là người tôi đã quen biết rồi.", "eng": "She's the one that I know already."}, {"viet": "Bề ngoài cô ấy có vẻ bình tĩnh nhưng tôi biết thực sự cô ấy lo lắng như thế nào.", "eng": "She seems calm on the outside but I know how worried she really is."}, {"viet": "Cô ta đâm sầm chiếc xe mới của mình vì sương mù.", "eng": "She smashed her new car in the fog."}, {"viet": "Cô ấy thò tay ra khỏi ô tô và cầm lấy vé.", "eng": "She stuck her hand out of the car and took the ticket."}, {"viet": "Cô ấy đã bảo bọn trẻ con bớt ồn ào khi cô đang nói chuyện điện thoại.", "eng": "She told the children to pipe down while she was talking on the telephone."}, {"viet": "Bà ta đã tận dụng xương gà để nấu xúp.", "eng": "She used up the chicken bones to make soup."}, {"viet": "Được tin mình đã thắng, trông cô ta rất vui sướng.", "eng": "She was all smiles at the news of her win."}, {"viet": "Cô ấy được chọn để làm ở văn phòng của chúng tôi ở Pari.", "eng": "She was drafted to our office in Paris."}, {"viet": "Bà ta đã được chôn cất bên cạnh ông chồng quá cố.", "eng": "She was laid to rest beside her late husband."}, {"viet": "Bà ta la hét như một mụ hàng tôm hàng cá!", "eng": "She was screaming like a fishwife!"}, {"viet": "Bà ta cố gắng giúp đỡ không tiếc công sức.", "eng": "She was unstinting in her efforts to help."}, {"viet": "Nàng đến gặp mặt chàng với vẻ háo hức.", "eng": "She went to meet him with an air of expectancy."}, {"viet": "Cô ấy làm việc rất vất vả để kiếm tiền.", "eng": "She worked very hard to earn some money."}, {"viet": "Căn nhà có dãy phòng liền nhau suốt từ đằng trước ra đằng sau được gọi là shotgun vì một phát đạn bắn từ cửa trước của những phòng dài và hẹp này, có thể xuyên suốt căn nhà và ra ngoài cửa sau mà chẳng đụng một vật cản nào cả.", "eng": "Shotguns are so named because a shotgun fired through the front door of these long, narrow homes could pass straight through the house and out the back door without hitting any barriers."}, {"viet": "Trên hộp có in lời chỉ dẫn đơn giản cách lắp ráp kiểu mẫu đó.", "eng": "Simple directions for assembling the model are printed on the box."}, {"viet": "Hãy trình bày tổng quát những điều bạn định làm.", "eng": "Sketch out what you intend to do."}, {"viet": "Hút thuốc là một trong những nguyên nhân gây ra bệnh tim.", "eng": "Smoking is one of the causes of heart disease."}, {"viet": "Vậy là con đã thua hết tiền?", "eng": "So you lost all your money?"}, {"viet": "Một vài bài tập giúp nở mông.", "eng": "Some exercises to help you have great buns."}, {"viet": "Vài người nhận thấy rất khó xin phép về hưu, nhưng anh ta không gặp trở ngại.", "eng": "Some people find retiring difficult but he has taken it an in his stride."}, {"viet": "Có ai viết mấy chữ ở lề sách.", "eng": "Someone had scribbled some notes in the margin of the book."}, {"viet": "Nghe có vẻ ngon đấy, em vẫn chưa quyết định.", "eng": "Sounds delicious, I haven't decided yet."}, {"viet": "Đưa lên sân khấu xuất phẩm mới của vở Vua Lia.", "eng": "Stage a new production of King Lear."}, {"viet": "Gây náo động trong công nhân.", "eng": "Stir up unrest among the workers."}, {"viet": "Những quả dâu có điểm kem xoắn bên tên.", "eng": "Strawberries topped with a swirl of cream."}, {"viet": "Hành vi như thế chỉ có thể làm anh ta mang tiếng xấu.", "eng": "Such behaviour can only reflect discredit upon you."}, {"viet": "Thu lời thuyết minh tiếng Anh chồng lên đường ghi âm gốc.", "eng": "Superimpose an English commentary on the original soundtrack."}, {"viet": "Những người có tài lãnh đạo là trung tâm của tất cả hành động.", "eng": "Take-charge people who are the center of all the action."}, {"viet": "Cuộc thương thuyết giữa ban giám đốc và công đoàn bị đổ vỡ.", "eng": "Talks between management and unions have collapsed."}, {"viet": "Cứ kể cho bất cứ ai mà anh thích-đối với tôi điều đó chẳng có gì quan trọng cả.", "eng": "Tell whoever you like-it makes no difference to me."}, {"viet": "Nhờ sự chăm sóc của người vú già.", "eng": "Thanks to the ministrations of the old nurse."}, {"viet": "Toà nhà đó đã được đổi thành một trường học.", "eng": "That building has been converted into a school."}, {"viet": "Chữ was được tỉnh lược trong câu sau Trong vụ tai nạn đứa bé bị thương còn bà mẹ chết.", "eng": "That is an ellipsis of was in the following sentence In the accident, the child was hurt and the mother killed."}, {"viet": "Sự bùng nổ đó là một thí dụ điển hình về sự thiếu tự chủ của anh ta.", "eng": "That outburst was a typical example of his lack of self-control."}, {"viet": "Anh chàng đó biết cách bán ôtô và bán giỏi nữa.", "eng": "That son of a gun knows how to sell cars and sell them well."}, {"viet": "Trên một trăm trang công thức và hằng số chắc chắn là cái toàn diện có thể có được.", "eng": "The 100 odd pages of formulas and constants are surely the most catholic to be found."}, {"viet": "Độ vang âm của phòng hoà nhạc này thật tuyệt.", "eng": "The acoustics of this concert hall are excellent."}, {"viet": "Hãng hàng không đó bị mang tiếng là kém an toàn.", "eng": "The airline has a bad safety record."}, {"viet": "Câu trả lời cho yêu cầu của tôi là một sự từ chối mạnh mẽ.", "eng": "The answer to my request was a strong negative."}, {"viet": "Đạo quân đã dàn thành hàng ngũ chiến đấu.", "eng": "The army was arrayed in order of battle."}, {"viet": "Cử toạ ngừng thở, ngạc nhiên.", "eng": "The audience sat in unbreathing astonishment."}, {"viet": "Đứa bé mới sinh ra cân nặng bảy cân Anh.", "eng": "The baby weighed seven pound at birth."}, {"viet": "Người vỡ nợ cố gắng thoát ra khỏi tình trạng khó khăn nhưng không thể làm được điều đó.", "eng": "The bankrupt tried to get out from under but couldn't make it."}, {"viet": "Giường nhồi bông vì thế nó rất mềm.", "eng": "The bed was stuffed with cotton so it was very soft."}, {"viet": "Sự ra đời của chủ nghĩa tư bản, chủ nghĩa xã hội, một chính đảng, một tư tưởng.", "eng": "The birth of capitalism, socialism, a political party, an idea."}, {"viet": "Quả bom làm nổ tung căn nhà lên rất cao.", "eng": "The bomb blew the house sky-high."}, {"viet": "Ông chủ đang giận điên lên về chuyện đó và điên là từ có nghĩa nhất.", "eng": "The boss is hoping mad about it and mad is the operative word."}, {"viet": "Các cành cây vật vờ trước gió.", "eng": "The branches dipped in the wind."}, {"viet": "Những toà nhà đó phản ánh cái tao nhã của một thời đã qua.", "eng": "The buildings reflect the elegance of a bygone era."}, {"viet": "Tiếng gọi của biển cả, của rừng hoang, của những nơi xa xôi, v. v.", "eng": "The call of the sea, of the wild, of faraway places, etc."}, {"viet": "Ô tô đâm vào cây với một tiếng va đập kinh người.", "eng": "The car hit the tree with a sickening crash."}, {"viet": "Chiếc xe ngựa lăn lọc cọc trên đường rải đá cuội.", "eng": "The cart clattered over the cobble-stones."}, {"viet": "Chuỗi các sự kiện dẫn đến việc từ chức của ông Thủ tướng.", "eng": "The chain of events that led to the Prime Minister's resignation."}, {"viet": "Các con gà đang bới tìm ngoài sân.", "eng": "The chickens were scratching about in the yard."}, {"viet": "Đứa trẻ núp sau ghế sô-pha.", "eng": "The child was hiding behind the sofa."}, {"viet": "Lũ trẻ hàng ngày đi bộ đến trường đã tạo ra một con đường mòn băng qua cánh đồng.", "eng": "The children have worn a path across the field where they walk each day to school."}, {"viet": "Các học sinh được dạy riêng, không theo nhóm.", "eng": "The children were taught individually, not in a group."}, {"viet": "Thầy giáo gọi tên trong danh sách điểm danh.", "eng": "The class teacher called the names on the register."}, {"viet": "Chỗ than này thiếu mất sáu cân Anh.", "eng": "The coal is underweight by six pounds."}, {"viet": "Sự ràng buộc toàn bộ bản thân ta vào một mối quan hệ.", "eng": "The commitment of the whole self to a relationship."}, {"viet": "Công ty đang ở trong tình trạng tài chính khó khăn.", "eng": "The company is in a poor financial situation."}, {"viet": "Mâu thuẫn giữa tôn giáo và khoa học.", "eng": "The conflict between religion and science."}, {"viet": "Chiếc thuyền thúng xoay tròn, theo chiều kim đồng hồ, rồi ngược lại.", "eng": "The coracle whirled round, clockwise, then widdershins."}, {"viet": "Đất nước đầy cả tin đồn về chiến tranh.", "eng": "The country was rife with rumors of war."}, {"viet": "Tên tội phạm cuối cùng đã bị người ta tìm ra ở khu rừng gần nhà hắn.", "eng": "The criminal was eventually run down in the woods near his home."}, {"viet": "Sự trau dồi trí tuệ là tối cần thiết.", "eng": "The culture of the mind is vital."}, {"viet": "Sự điều hành hàng ngày một doanh nghiệp.", "eng": "The day-to-day running of a business."}, {"viet": "Vị cay cay kích thích khẩu vị của món súp.", "eng": "The delicate piquancy of the soup."}, {"viet": "Mã số khu vực Luân Đôn là 01.", "eng": "The dialling code for the London area is 01."}, {"viet": "Cuộc tranh chấp đã được đưa ra trước ban trọng tài.", "eng": "The dispute was referred to arbitration."}, {"viet": "Bác sĩ bắt mạch cho người phụ nữ đó.", "eng": "The doctor took the woman's pulse."}, {"viet": "Con chó đã bị xích, vậy làm sao nó xổng ra được?", "eng": "The dog was chained, so how did it get free?"}, {"viet": "Người lái hoảng hốt khi chiếc ô tô chao đảo hết bên này sang bên kia trên con đường đầy băng.", "eng": "The driver panicked as the car fish tailed on the icy road."}, {"viet": "Nền kinh tế đang trở nên lạm phát trầm trọng.", "eng": "The economy has become seriously overheated."}, {"viet": "Quân địch thực hiện một hành động kiên quyết để chiếm lấy thành phố.", "eng": "The enemy made a push to capture the city."}, {"viet": "Sự thành lập một trường đại học mới.", "eng": "The establishment of a new college."}, {"viet": "Sự thành thạo lái xe của cô ta làm anh ấy ngạc nhiên.", "eng": "The expertness of her driving surprised him."}, {"viet": "Cơn gia biến đã thực sự bộc lộ hết những phẩm chất tốt đẹp của cô ta.", "eng": "The family crisis really brought out the best in her."}, {"viet": "Chế độ phong kiến dần dần rơi vào tình trạng suy sụp.", "eng": "The feudal system slowly fell into decay."}, {"viet": "Vòng chung kết tập hợp bốn người đủ tiêu chuẩn lọt vào của mỗi bảng đấu loại.", "eng": "The final brings together four qualifiers from each heat."}, {"viet": "Mỗi tuần xưởng sản xuất 1000 kiện bông.", "eng": "The firm puts out 1000 bales of cotton every week."}, {"viet": "Nắp phong bì bị bong ra.", "eng": "The flap of the envelop was unstuck."}, {"viet": "Những lực lượng phản động làm cho cuộc cải cách khó khăn.", "eng": "The forces of reaction made reform difficult."}, {"viet": "Người hậu vệ làm anh ta ngã giập xuống đất.", "eng": "The full-back brought him crashing to the ground."}, {"viet": "Bản lề cánh cổng cần được tra dầu-nó cứ kêu ken két.", "eng": "The gate hinges need oiling-they're squeaking."}, {"viet": "Vẻ lộng lẫy lúc mặt trời lặn, của một ngày hè, v. v.", "eng": "The glory of a sunset, a summer's day, etc."}, {"viet": "Cuộc khủng hoảng của Chính phủ sẽ là đề tài tốt cho bài báo.", "eng": "The government crisis will make good copy."}, {"viet": "Chính phủ lo lắng về sự sụt giá của đồng bảng Anh ( đối với các loại tiền tệ khác ).", "eng": "The Government is worried about the weakness of the pound ( against other currencies )."}, {"viet": "Sự đổ xô của các giới trung lưu về ngoại ô.", "eng": "The gravitation of the middle classes to the suburbs."}, {"viet": "Phòng của người khách trọ quá gần thang máy.", "eng": "The guest's room is too close to the elevator."}, {"viet": "Văn phòng chính đã được chuyển từ Luân Đôn đến Cardiff.", "eng": "The head office has been transferred from London to Cardiff."}, {"viet": "Những pha hay nhất của trận đấu sẽ được chiếu trên truyền hình tối nay.", "eng": "The highlights of the match will be shown on TV tonight."}, {"viet": "Cà phê nóng làm tan đường.", "eng": "The hot coffee melts the sugar."}, {"viet": "Hạ viện vẫn còn họp lúc 3 giờ sáng.", "eng": "The House of Commons was still sitting at 3 am."}, {"viet": "Ý tưởng này được đưa ra lần đầu tiên trước chiến tranh.", "eng": "The idea was first floated before the war."}, {"viet": "Sự ảnh hưởng của cha mẹ đối với con cái.", "eng": "The influence of parents on their children."}, {"viet": "Cuộc đột kích của quân xâm lược vào thành phố.", "eng": "The invaders descent on the town."}, {"viet": "Chuyến đi từng nhà một mất khoảng một giờ.", "eng": "The journey takes about an hour, door to door."}, {"viet": "Việc bắt cóc đã xảy ra giữa ban ngày ban mặt.", "eng": "The kidnapping occurred in broad daylight."}, {"viet": "Loài khủng long to lớn nhất lớn hơn bất cứ con vật nào khác sống trên trái đất.", "eng": "The largest were larger than any other animals that ever lived on land."}, {"viet": "Sự tiết lộ các bí mật kỹ thuật đã lên tới mức báo động.", "eng": "The leakage of technological secrets is reaching alarming proportions."}, {"viet": "Ánh sáng lôi cuốn nhiều côn trùng.", "eng": "The light attracted a lot of insects."}, {"viet": "Cách chữa bệnh đã tìm kiếm từ lâu.", "eng": "The long sought-for cure for the disease."}, {"viet": "Nhà ảo thuật trình diễn những thứ bùa chú và mê dược của ông ta.", "eng": "The magician displayed his charms and potion."}, {"viet": "Viên giám đốc chững chạc bước vào phòng.", "eng": "The manager sailed into the room."}, {"viet": "Chúng tôi phải trả tiền bữa ăn 30 bảng Anh.", "eng": "The meal cost us £ 30."}, {"viet": "Binh sĩ đi theo hàng một vào quảng trường và diễu qua vị tướng.", "eng": "The men filed onto the parade ground and past the general."}, {"viet": "Những chi tiết lặt vặt của phương pháp thí nghiệm và toán học.", "eng": "The minutiae of experimental and mathematical procedure."}, {"viet": "Bài học luân lý của câu chuyện là chúng ta nên tử tế với người khác.", "eng": "The moral of the story was that we should be kind to other people."}, {"viet": "Bộ phim Nổi loạn không duyên cớ đột nhiên làm James Dean lừng lẫy tiếng tăm.", "eng": "The movie Rebel without a Cause catapulted James Dean to stardom."}, {"viet": "Kim rung động khi máy chạy.", "eng": "The needle pulsates when the engine is running."}, {"viet": "Các đạo luật mới đã được chấp thuận rộng rãi.", "eng": "The new laws gained widespread acceptance."}, {"viet": "Vị cha sứ mới là một người tiến bộ đúng là đặt con mèo trong đám bồ câu!", "eng": "The new vicar's a progressist that'll set the cat among the pigeons!"}, {"viet": "Bước kế tiếp là chuẩn bị để ghép vỏ cho sách, vỏ là tên gọi những người đóng sách đặt cho bìa cuốn sách.", "eng": "The next step is to get the book ready for its case, which is the name bookbinders give to the cover of a book."}, {"viet": "Số vụ bắn giết trong các cuộc cướp bóc đang gia tăng.", "eng": "The number of shooting during robberies is increasing."}, {"viet": "Các sĩ quan phải ăn ở chung với binh sĩ.", "eng": "The officers had to muck in with their men."}, {"viet": "Phần cũ của thành phố nằm ở bờ biển châu á.", "eng": "The older part of the city is on the Asian shore."}, {"viet": "Sự dao động của cây kim la bàn.", "eng": "The oscillation of the compass needle."}, {"viet": "Báo chí đặt cho họ biệt danh Tứ quái.", "eng": "The papers dubbed them the Fab Four."}, {"viet": "Con đường mòn lượn vòng xuống sườn đồi.", "eng": "The path twisted down the hillside."}, {"viet": "Dân chúng muốn ông ta làm lãnh tụ.", "eng": "The people want him as their leader."}, {"viet": "Bức ảnh một ngôi nhà nhìn từ bên cạnh.", "eng": "The picture is a side-view of the house."}, {"viet": "Cuối cùng kế hoạch đã bị hủy bỏ.", "eng": "The plan has finally got its quietus."}, {"viet": "Vở kịch được nhiều bài phê bình ca ngợi trên báo chí.", "eng": "The play got rave notices in the paper."}, {"viet": "Cảnh sát là những người bảo vệ luật pháp và trật tự.", "eng": "The police are guardians of law and order."}, {"viet": "Cảnh sát đã báo cho các chủ cửa hàng đề phòng giấy bạc giả.", "eng": "The police have warned shopkeepers about the forged banknotes."}, {"viet": "Người cảnh sát ra hiệu cho họ dừng lại.", "eng": "The policeman signed them to stop."}, {"viet": "Tờ áp phích chỉ treo được vài giờ rồi bị ăn cắp mất.", "eng": "The poster only stayed up a few hours, before it was stolen."}, {"viet": "Bài diễn văn của Tổng thống thúc giục toàn dân cố gắng nhiều hơn nữa.", "eng": "The President's speech impelled the nation to greater efforts."}, {"viet": "Giá thực phẩm ở đây quá đắt đỏ.", "eng": "The price of food here is exorbitant."}, {"viet": "Người tù làm một bản cung khai tự nguyện.", "eng": "The prisoner made a voluntary statement."}, {"viet": "Chương trình đó là một sự giới thiệu tài năng trẻ.", "eng": "The programme is a show-case for young talent."}, {"viet": "Dân chúng không được vào phòng tòa án.", "eng": "The public are not allowed to enter the court room."}, {"viet": "Con ngựa của Nữ hoàng thắng hơn một cái đầu.", "eng": "The Queen's horse won by a head."}, {"viet": "Sự chuyển động tới lui nhanh của pít-tông.", "eng": "The rapid to-and-fro movements of a piston."}, {"viet": "Những cải cách ông ta rêu rao đã thực hiện thực tế chỉ mang tính chất trang điểm.", "eng": "The reforms he claims to have made are in fact merely cosmetic."}, {"viet": "Thung lũng ngập nước tạo thành một cái hồ chứa nước.", "eng": "The reservoir was formed by flooding the valley."}, {"viet": "Người cưỡi ngựa phi nhanh tới nơi đến của mình.", "eng": "The rider spurred on to his destination."}, {"viet": "Con đường uốn khúc qua dãy đồi.", "eng": "The road wanders along through the range of hills."}, {"viet": "Những đám mây màu hồng buổi bình minh.", "eng": "The rose colour of clouds at dawn."}, {"viet": "Thang lương từ 8000 pao đến 20000 pao.", "eng": "The salary scale goes from 8000 pounds to 20000 pounds."}, {"viet": "Trường đó có thành tích kém trong thi cử.", "eng": "The school has a poor record for examination passes."}, {"viet": "Các hạt chứa trong quả đều có dạng quả hạnh nhân.", "eng": "The seeds in it are almond-shaped."}, {"viet": "Cừu ra ngoài đồng qua lỗ thủng hàng rào.", "eng": "The sheep got out of the field through a breach in the hedge."}, {"viet": "Những chiếc tàu ở dưới sự che chở của các khẩu pháo.", "eng": "The ships were under the cover of the batteries."}, {"viet": "Thấy con rắn này làm sởn gai ốc.", "eng": "The sight of this snake makes my flesh crawl."}, {"viet": "Những con đường khó đi qua đồi núi.", "eng": "The slow road through the mountains."}, {"viet": "Quân lính rút khỏi vùng đó khi quân địch tiến lên.", "eng": "The soldiers evacuated the area as the enemy advanced."}, {"viet": "Diễn giả thuyết trình rất uyên thâm về nhiều vấn đề.", "eng": "The speaker discoursed knowledgeably on a variety of subjects."}, {"viet": "Trình độ học tập của anh ấy còn thấp hơn nhiều so với mức trung bình của cả lớp.", "eng": "The standard of his work is well below the average of his class."}, {"viet": "Cơn bão đã để lại một vệt tàn phá.", "eng": "The storm left a trail of destruction behind."}, {"viet": "Phòng học là nơi yên tĩnh trong một căn hộ ồn ào.", "eng": "The study was an oasis of calm in a noisy household."}, {"viet": "Bác sĩ phẫu thuật cắt bỏ cơ quan bị nhiễm trùng.", "eng": "The surgeon removed the infected organ."}, {"viet": "Hôm nay thầy giáo cho chúng tôi hai bài chính tả tiếng Pháp.", "eng": "The teacher gave us two French dictation today."}, {"viet": "Buổi truyền hình tường thuật sự kiện đó có phần dàn trải.", "eng": "The television coverage of the event was rather sparse."}, {"viet": "Bọn trộm đi vào cửa sau của toà nhà.", "eng": "The thieves entered the building by the back door."}, {"viet": "Các dụng cụ lăn lung tung trong cốp xe hơi mỗi khi chúng ta rẽ quặt góc đường.", "eng": "The tools shift around in the car boot every time we turn a corner."}, {"viet": "Xe lửa bất thình lình thắng lại.", "eng": "The train was brought to a sudden stop."}, {"viet": "Xe tải chở xi măng đến, và anh ấy chỉ cho tài xế chỗ xếp xi măng.", "eng": "The trucks bring in the cement, and he shows the drivers where to put the cement."}, {"viet": "Hai bên không đồng ý với nhau về mọi điểm song đã đi đến một thoả hiệp.", "eng": "The two sides failed to agree on every point but came to an accommodation."}, {"viet": "Những cái chai không dùng được đem trả lại cửa hàng.", "eng": "The unused bottles were returned to the shop."}, {"viet": "Làng đó từ xa lộ dễ vào.", "eng": "The village is accessible from the motorway."}, {"viet": "Người thợ đồng hồ có một phòng làm việc ở phía trong cửa hàng ông ta.", "eng": "The watch maker has a work-room at the back of his shop."}, {"viet": "Cả lớp đều ở đây, trừ hai người bị ốm.", "eng": "The whole class is here bar two that are ill."}, {"viet": "Người thắng cuộc sẽ đích thân đến đó để lĩnh thưởng.", "eng": "The winner will be there in person to collect the prize."}, {"viet": "Điều kiện làm việc là hàng đầu.", "eng": "The working conditions are first class."}, {"viet": "Họ tường thuật các sự kiện khác với chúng tôi.", "eng": "Their account of events conflicts with ours."}, {"viet": "Cuộc sống của họ bị thảm kịch đó làm cho tan nát và họ đang cố gắng hàn gắn lại.", "eng": "Their lives were shattered by the tragedy and they are trying to pick up the piece."}, {"viet": "Sau đó cộng 30 với 20 và tất cả chia cho 2.", "eng": "Then add 30 plus 20 and divided it by 2."}, {"viet": "Đã tính phục vụ phí trong tổng số rồi.", "eng": "There's a cover charge included in the total."}, {"viet": "Có nhiều cảnh làm tình trắng trợn trong bộ phim, nhưng không có gì ly kỳ cả.", "eng": "There's lots of straight sex in the film, but nothing kinky."}, {"viet": "Ở trang một có chuyện hay đấy.", "eng": "There's something interesting on the front page."}, {"viet": "Vào thời xa xưa có nhiều thành phố lớn.", "eng": "There are many great cities in ancient times."}, {"viet": "Một năm học có ba học kỳ.", "eng": "There are three terms in a school year."}, {"viet": "Tôi bị bỏ rơi xứ người không hộ chiếu không tiền bạc.", "eng": "There I was, stranded in a foreign country with no passport or money."}, {"viet": "Chúng tôi đã có một sự thoả thuận không chính thức với nhau rằng bên này sẽ không bán hàng cho khách của bên kia.", "eng": "There is an understanding between us that we will not sell to each other's customers."}, {"viet": "Người ta không hài lòng nói chung về việc đổ rác trong thành phố.", "eng": "There is widespread dissatisfaction, about the disposal of garbage in the city."}, {"viet": "Mất điện và tất cả các đèn đều tắt.", "eng": "There was a power cut and all the lights went out."}, {"viet": "Phần kinh phí dành cho máy móc mới rất ít.", "eng": "There was very little outlay on new machinery."}, {"viet": "Bây giờ đến 15 phút nghỉ giữa giờ.", "eng": "There will now be a 15-minute interlude."}, {"viet": "Những con dê này được nuôi cốt để lấy len.", "eng": "These goats are specially bred for their wool."}, {"viet": "Những câu chuyện này dường như được xác nhận là đúng.", "eng": "These stories seem to be well authenticated."}, {"viet": "Họ lấy nhau được 20 năm và rõ ràng là họ rất hạnh phúc.", "eng": "They've been married for 20 years, and apparently they're very happy."}, {"viet": "Họ đang diễn vở Hamlet ở rạp hát ABC.", "eng": "They are doing Hamlet at the ABC Theater."}, {"viet": "Cả hai đều muốn sử dụng chiếc ô tô, cho nên họ đã có sự thoả thuận với nhau.", "eng": "They both wanted to use the car, so they did a deal."}, {"viet": "Họ không có khả năng trả học phí ở trường nhạc.", "eng": "They couldn't possibly afford the music-school fees."}, {"viet": "Họ cãi nhau dữ dội trước khi vào họp nhưng rồi cuối cùng được thuyết phục hoà thuận với nhau.", "eng": "They exchanged angry words before the meeting but were finally persuaded to agree."}, {"viet": "Họ phải sống không có tiện nghi khi vào rừng rậm.", "eng": "They had to rough when they got the jungle."}, {"viet": "Họ bố trí một trận phục kích đội tuần tra của địch.", "eng": "They laid an ambush for the enemy patrol."}, {"viet": "Chắc hẳn chúng đã hết mùa rồi.", "eng": "They must be out of season."}, {"viet": "Người ta hỏi cung cô ta ráo riết về quan hệ bạn bè của cô ta với người đã chết.", "eng": "They questioned her closely about her friendship with the dead man."}, {"viet": "Họ chia đều nhau công việc.", "eng": "They shared the work equally between them."}, {"viet": "Người ta không nêu ra được hết tầm quan trọng của vấn đề.", "eng": "They understate the magnitude of the problem."}, {"viet": "Họ thiếu vũ khí đạn dược một cách tuyệt vọng.", "eng": "They were despairingly short of ammunition."}, {"viet": "Họ sẽ cho diễn viên Tom Hill đóng vai Brutus trong vở kịch Julius Caesar.", "eng": "They will present Tom Hill as Brutus in Julius Caesar."}, {"viet": "Chiếc giường này có thể dễ dàng biến thành một chiếc sofa.", "eng": "This bed is easily convertible into a sofa."}, {"viet": "Điều này có thể là lời đáp cho tất cả các vấn đề của chúng ta.", "eng": "This could be the answer to all our problems."}, {"viet": "Đồ ăn này không thích hợp cho con người.", "eng": "This food is not fit for human consumption."}, {"viet": "Đây là ông Caruso ở Công ty thương mại Palaceside.", "eng": "This is Mr. Caruso of the Palaceside Trading Co."}, {"viet": "Hồ này không lớn như Hồ Muối Lớn ở U-ta.", "eng": "This lake is not as big as the Great Salt Lake in Utah."}, {"viet": "Thuốc mỡ này có thể làm tiêu chứng phát ban của anh.", "eng": "This ointment might help to clear up your rash."}, {"viet": "Bản báo cáo này làm nhẹ tầm nghiêm trọng của tình hình.", "eng": "This report understates the seriousness of the situation."}, {"viet": "Cái bàn này không phải là đồ cổ thật, tôi e rằng anh đã bị lừa!", "eng": "This table isn't a genuine antique, I'm afraid you've been done!"}, {"viet": "Những quần áo này không thích hợp để đi làm.", "eng": "Those clothes are inappropriate for work."}, {"viet": "Tuổi trẻ hôm nay là những nhà lãnh đạo của tương lai.", "eng": "Today's youth are the leaders of tomorrow."}, {"viet": "Sự huấn luyện rất phù hợp với các nhu cầu của công việc.", "eng": "Training that marries well with the needs of the job."}, {"viet": "Vellum là một loại da thuộc làm bằng da cừu non hoặc các con thú nhỏ.", "eng": "Vellum, one kind of parchment, came from the skins of young lambs or calves or kids."}, {"viet": "Wayne, tốt hơn anh nên đi gọi chúng đi.", "eng": "Wayne, you'd better get them."}, {"viet": "Chúng tôi sẽ dùng thử món này, tiếp theo là món thịt gà ướp muối nướng, thịt gà luộc mềm và cá mò hấp.", "eng": "We'll try this one, with the Salt-Baked Chicken, the Soft-Boiled Chicken and the Steamed Mandarin Fish to follow."}, {"viet": "Chúng tôi dự định vẫn thuê căn nhà ở nông thôn hết mùa hè.", "eng": "We're planning to keep the cottage on over the summer."}, {"viet": "Gia đình chúng tôi hay đau ốm.", "eng": "We've had a lot of illness in the family."}, {"viet": "Chúng tôi bao giờ cũng để đến giây phút cuối cùng mới đóng gói.", "eng": "We always leave our packing to the last moment."}, {"viet": "Chúng ta vô địch!, những người hâm mộ bóng đá hô vang.", "eng": "We are the champions! chanted the football fans."}, {"viet": "Chúng tôi không thể dọn đến ở được cho đến khi đặt xong đường dây điện.", "eng": "We can't move in until the electricity has been laid on."}, {"viet": "Rõ ràng chúng ta đánh giá thấp anh ta trong vai trò thành viên của đội.", "eng": "We clearly undervalued him as a member of our team."}, {"viet": "Chúng tôi không tính tới khả năng là anh ta phản đối kế hoạch của chúng tôi.", "eng": "We don't contemplate him opposing our plan."}, {"viet": "Chúng tôi đã cho cô ấy ít tiền để cô ấy trả cho những cuốn sách đã mua.", "eng": "We gave her some money to cover the cost of the books she had to buy."}, {"viet": "Chúng tôi đã phải nghe một bài lên lớp dài dòng về cái chuyện không được hoang phí tiền nong.", "eng": "We had to listen to a long sermon about not wasting money."}, {"viet": "Chúng ta có điện ảnh và phim đèn chiếu.", "eng": "We have moving pictures and film-strips."}, {"viet": "Chúng tôi nhập những máy móc chúng tôi không thể tạo được trong nước.", "eng": "We import machinery that we can not make in our country."}, {"viet": "Chúng ta đã mất hai mươi phút để thay lốp.", "eng": "We lost twenty minutes through having to change a tyre."}, {"viet": "Chúng tôi phải xem xét ngôi nhà trước khi quyết định thuê.", "eng": "We must look over the house before we decide to rent it."}, {"viet": "Chúng tôi vừa mới đi nghỉ về hôm qua.", "eng": "We only got back from our holidays yesterday."}, {"viet": "Chúng tôi tôn trọng ước muốn của anh ấy và chúng tôi hi vọng anh cũng làm như vậy.", "eng": "We respected his wishes and we hoped you will do likewise."}, {"viet": "Chúng ta đã tiêu phí nhiều thì giờ về kế hoạch này.", "eng": "We spend a lot of time on this project."}, {"viet": "Lịch trình của chúng tôi rất sát sao.", "eng": "We've got a very tight schedule."}, {"viet": "Có một thời chúng tôi là kẻ thù của nhau, nhưng bây giờ không còn oán hận gì nhau nữa.", "eng": "We were enemies once, but there are no hard feelings between us now."}, {"viet": "Chúng tôi sẽ không bao giờ chịu im lặng trước sự xâm lược.", "eng": "We will never capitulate in the face of aggression."}, {"viet": "À, nó ở giữa hai cỡ hiện đang có ở đây.", "eng": "Well, he's between sizes right now."}, {"viet": "À, có một điều duy nhất tôi cần phải biết.", "eng": "Well, there's only one thing I need to know."}, {"viet": "Đơn vị nhỏ nhất của tiền nhân dân tệ là bao nhiêu?", "eng": "What's the smallest denomination of yuan currency?"}, {"viet": "Các trường đại học hàng đầu ở Canada là những trường nào?", "eng": "What are the top universities in Canada?"}, {"viet": "\"Ừ có, em nghĩ là biết\" là có ý gì?", "eng": "What do you mean, \"Yeah, I guess so\"?"}, {"viet": "Điều gì đã khiến anh cư xử như thế?", "eng": "What influenced you to behave like that?"}, {"viet": "Việc nghiêm trọng mà anh muốn nói đến này là gì vậy?", "eng": "What is this serious matter you wanted to talk about?"}, {"viet": "Ông đang cố quay số nào vậy?", "eng": "What number are you trying to dial?"}, {"viet": "Nhà hàng mở cửa lúc mấy giờ?", "eng": "What time does the restaurant open?"}, {"viet": "Khi những sinh vật ở dưới biển sâu được kéo lên mặt nước, chúng hầu như chết ngay.", "eng": "When deep-sea animals are pulled up to the surface, they are likely to die at once."}, {"viet": "Khi tôi xuất viện tôi hoàn toàn khỏi bệnh.", "eng": "When I left hospital, I was completely cured."}, {"viet": "Khi liên minh được hình thành, thì những phần tử phát xít bị loại ra ngoài.", "eng": "When the coalition was formed, the fascists were left out in the cold."}, {"viet": "Khi nào thì áo quần giặt ủi này xong?", "eng": "When will the laundry be ready?"}, {"viet": "Các xe tải từ đâu đến vậy?", "eng": "Where do the trucks come from?"}, {"viet": "Bạn thích thuốc nào hơn, thuốc tây hay đông dược?", "eng": "Which do you prefer, western medicine or Chinese medicine?"}, {"viet": "Trong khi chúng ta đợi thì chiếc đồng hồ cây số của xe tắc xi cứ tiếp tục tích tắc đều.", "eng": "While we waited the taxi's meter kept ticking away."}, {"viet": "Ai kế tục Churchill ( làm Thủ tướng )?", "eng": "Who succeeded Churchill ( as Prime Minister )?"}, {"viet": "Vậy thì tại sao anh không gọi thịt gà chiên hay sườn chiên nhỉ?", "eng": "Why don't you order a fried chicken or ribs then?"}, {"viet": "Ông sẽ trả bằng tiền mặt hay thẻ tín dụng ạ?", "eng": "Will this be cash or credit?"}, {"viet": "William Morris là một trong những người khởi xướng đầu tiên của chủ nghĩa xã hội.", "eng": "William Morris was on of the prophets of socialism."}, {"viet": "Sau khi băng tan, con người có thể khám phá ra những cách sống tốt hơn.", "eng": "With the retreat of the ice, people could work out better ways of living."}, {"viet": "Anh có chịu nhận 850 pao trả tiền công không?", "eng": "Would you accept 850 pounds as payment for the work?"}, {"viet": "Ông muốn gặp ông Hall giám đốc Kinh doanh và Tiếp thị của chúng tôi phải không ạ?", "eng": "Would you like to meet our Sales and Marketing Director, Mr. Hall?"}, {"viet": "Vui lòng cho tôi biết tôi nên gửi nó như thế nào?", "eng": "Would you tell me how I should send it?"}, {"viet": "Vâng, tôi rất buồn về cách tôi bị đối xử.", "eng": "Yes, I am very upset at the way I have been treated."}, {"viet": "Lại thêm một thí dụ nữa về sự cẩu thả chết người.", "eng": "Yet one more example of criminal negligence."}, {"viet": "Con sẽ bị nôn nao nếu con ăn tất cả những chiếc kẹo này.", "eng": "You'll make yourself sick if you eat all those sweets."}, {"viet": "Mày đã đi đến đấy mà không nói gì với tao, mày là một đứa gian dối!", "eng": "You've been going there without telling me, you deceitful child!"}, {"viet": "Ông yêu cầu gặp tôi phải không, ông Smith?", "eng": "You asked to see me, Mr. Smith?"}, {"viet": "Ông có thể mua xà bông và các thứ khác để giặt giũ từ cái máy đó.", "eng": "You can buy soap and other things for your wash from that machine."}, {"viet": "Bạn có thể thăm toàn bộ lâu đài trừ những căn buồng riêng.", "eng": "You can visit the whole palace except for the private apartments."}, {"viet": "Anh tìm cho ra những điều gì đó về chính bản thân mình, nhớ lại những gì về thời thơ ấu, về cha mẹ mình hoặc về chị em gái và anh em trai thật sự xúc phạm anh.", "eng": "You find out things about yourself, you remember things about your childhood, about your mother and father, or sister and brother that really hurt."}, {"viet": "Anh không thể trốn đi đâu được.", "eng": "You just can't get away from it."}, {"viet": "Ý anh nói là bản sao mà văn phòng Montreal đưa cho tôi phải không?", "eng": "You mean the copy given me by the Montreal Office?"}, {"viet": "Anh phải uống ba thìa thuốc.", "eng": "You must take three spoonfuls of medicine."}, {"viet": "Anh thấy đấy, có cả máy ảnh của tôi trong túi xách tay nữa.", "eng": "You see my camera is in the handbag."}, {"viet": "Cô không nên để đứa bé một mình ở nhà.", "eng": "You shouldn't leave a baby alone in the house."}, {"viet": "Chiếc máy chữ này sẽ giúp đỡ anh rất nhiều.", "eng": "You will get good service from this typewriter."}, {"viet": "Những nhận xét phê bình của anh khá xa rời chủ đề mà chúng ta đang bàn luận.", "eng": "Your comments are rather remote from the subject we are discussing."}, {"viet": "Cậu con trai đãng trí của anh lại bỏ quên chìa khoá rồi.", "eng": "Your scatty son has forgotten his key again."}]