[{"viet": "300 chỉ là con số xấp xỉ so với con số chính xác.", "eng": "300 only approximation of the right number."}, {"viet": "Một sự nghiệp đã sớm kết thúc bi thảm do bệnh hoạn.", "eng": "A career tragically cut short by illness."}, {"viet": "Một cái đồng hồ ở trên tủ búp-phê đó.", "eng": "A clock standing on the sideboard."}, {"viet": "Một phiếu tính tiền phụ trội ở nhà hàng được đính kèm theo hóa đơn.", "eng": "A cover charge tacked onto the bill."}, {"viet": "Một cuốn từ điển được soạn riêng cho các sinh viên Việt Nam học tiếng Anh.", "eng": "A dictionary expressly compiled for Vietnamese students of English."}, {"viet": "Một gia đình luôn luôn ở trong hoàn cảnh sung túc.", "eng": "A family that has always been well situated."}, {"viet": "Một viên kim cương hoàn hảo thì vô hình khi ở dưới nước.", "eng": "A flawless diamond is invisible under water."}, {"viet": "Một số lớn công việc vẫn chưa được giải quyết xong.", "eng": "A good deal of work is still outstanding."}, {"viet": "Một vận động viên thể dục đang nhào lộn trên khung vải nhún.", "eng": "A gymnast on the trampoline was turning somersaults."}, {"viet": "Một ngôi nhà bên ngoài cổ điển và bên trong hiện đại.", "eng": "A house with a classical exterior and a modern interior."}, {"viet": "Một phần lớn bề mặt của quả đất.", "eng": "A large proportion of the earth's surface."}, {"viet": "Một nhà kinh doanh địa phương đã cấp 500.000 bảng Anh cần thiết để cứu câu lạc bộ đó.", "eng": "A local businessman has put up the £ 500,000 needed to save the football club."}, {"viet": "Một người không có triết lý sống.", "eng": "A man without a philosophy of life."}, {"viet": "Râu của bướm đêm giống những sợi chỉ hay có thể giống như những cọng lông vũ nhỏ.", "eng": "A moth's feelers may be like threads, of they may be like tiny feathers."}, {"viet": "Một ca mổ ngắn ngủi tiến hành trong một căn phòng mượn.", "eng": "A nickel-and-dime operation run out of a borrowed room."}, {"viet": "Một dụng cụ kỳ lạ dùng để lấy hột trái cam.", "eng": "A peculiar contraption for removing pips from oranges."}, {"viet": "Một vở kịch toàn những nhân vật theo khuôn sáo.", "eng": "A play full of stereotyped characters."}, {"viet": "Một giám đốc hàng không dân dụng tư nhân.", "eng": "A private operator in civil aviation."}, {"viet": "Một chiếc lốp sau nổ và chiếc ôtô đó chạy vọt đi không còn kềm lại nổi.", "eng": "A rear tire blew out and the car jackrabbited out of control."}, {"viet": "Một cái ba lô có các dây đai đeo trên vai.", "eng": "A rucksack has straps that go over the shoulders."}, {"viet": "Một hành động thách thức nghiêm trọng đối với quyền lực của Thủ Tướng.", "eng": "A serious challenge to the Prime Minister's authority."}, {"viet": "Một dốc ngắn ngay bên kia rặng cây.", "eng": "A small inclination just beyond the trees."}, {"viet": "Một vài tên côn đồ trong đám đông.", "eng": "A sprinkling of hooligans in the crowd."}, {"viet": "Một phép cộng không thể giải được.", "eng": "A sum that won't work out."}, {"viet": "Một truyện trinh thám sinh động cho tới đoạn kết của nó.", "eng": "A thriller that proceeds slam-bang to its conclusion."}, {"viet": "Một quang cảnh ngôi nhà chụp từ phía sau.", "eng": "A view of the house taken from the rear."}, {"viet": "Một cái áo len giá 19, 95 bảng Anh.", "eng": "A woollen sweater, price £ 19. 95."}, {"viet": "Đạt được thành tựu lớn lao trong cuộc đời của ai.", "eng": "Achieve greatness in one's lifetime."}, {"viet": "Sau một hai cốc rượu nó lăn đùng ra sàn nhà.", "eng": "After a couple of drinks he just keeled over on the floor."}, {"viet": "Sau khi làm việc căng vào mùa hè, chúng tôi giờ đây đang giảm bớt hoạt động.", "eng": "After intense work in the summer, we are slacking off now."}, {"viet": "Sau mùa đông giá năm ngoái, chúng tôi bọc chất cách nhiệt quanh ống dẫn.", "eng": "After the last freeze-up we put insulation round the pipes."}, {"viet": "Hôm nay tất cả các máy bay ở phi trường Luân Đôn không được cất cánh vì sương mù.", "eng": "All aircraft at London Airport were grounded by fog today."}, {"viet": "Những khó khăn đủ loại bất ngờ nảy sinh.", "eng": "All sorts of difficulties cropped up."}, {"viet": "Làm giảm bớt rắc rối, sợ hãi, đau khổ, nghi ngờ, sự bất tín.", "eng": "Allay trouble, fears, suffering, doubt, suspicion."}, {"viet": "Trong số các khách quí của trung tâm nghỉ mát đó có các hoàng thân Thụy Điển và Tây Ban Nha.", "eng": "Among the resort's distinguished visitors are Swedish and Spanish royals."}, {"viet": "Một bài báo đầy những ý tưởng độc đáo.", "eng": "An article full of striking thoughts."}, {"viet": "Một chuyên gia về nguồn gốc các địa danh.", "eng": "An expert on the origin of place-names."}, {"viet": "Một mối quan hệ rõ rệt giữa thất nghiệp và tỉ lệ phạm tội.", "eng": "An obvious link between unemployment and the crime rate."}, {"viet": "Một cuốn sách nhỏ khiêm tốn nhưng là một cuốn kể một câu chuyện giản dị rất hay.", "eng": "An unpretentious little book but one that tells a simple story well."}, {"viet": "Các con thú trong vườn bách thú không ở trong môi trường thiên nhiên của chúng.", "eng": "Animals in zoos are not in their natural surroundings."}, {"viet": "Lời kêu gọi cảnh sát bảo vệ.", "eng": "Appeal for protection from the police."}, {"viet": "Họ đang nói chuyện bằng tiếng Tây Ban Nha hay Bồ Đào Nha vậy?", "eng": "Are they talking in Spanish or Portuguese?"}, {"viet": "Ông là ông Green từ Canada đến phải không ạ?", "eng": "Are you Mr. Green from Canada?"}, {"viet": "Động mạch đưa máu ra khỏi tim.", "eng": "Arteries carry the blood away from the heart."}, {"viet": "Trong lúc nàng nói một cách luyến tiếc về những ngày vinh quang của mình thì một cảm nghĩ đau xót ngầm hiện ra.", "eng": "As she talks nostalgically of her days of glory a poignant undertow emerges."}, {"viet": "Phó giáo sư Trường Âm Nhạc Hoàng Gia.", "eng": "Associate of the Royal College of Music."}, {"viet": "Dù có thể phải chịu mang tiếng là vô ơn bạc nghĩa, tôi vẫn phải từ chối đề nghị của anh ta.", "eng": "At the risk of sounding ungrateful, I must refuse your offer."}, {"viet": "Chuối, táo, cam đều là quả cây.", "eng": "Bananas, apples and oranges are all fruit."}, {"viet": "Hãy để khả năng phán đoán của bạn chỉ dẫn điều gì đúng và công bằng.", "eng": "Be guided by your sense of what is right and just."}, {"viet": "Vì thời tiết lạnh, năm nay vụ thu hoạch bị muộn.", "eng": "Because of the cold weather the crops are late this year."}, {"viet": "Ngoài những ngân hàng này ra, chúng tôi còn có những cơ sở tài chính khác nữa.", "eng": "Besides these banks, we have other financial institutions."}, {"viet": "Cả hai ly đều là cốc-tai có cồn, phải không?", "eng": "Both are alcoholic cocktails, aren't they?"}, {"viet": "Công ty Brown và Con Trai, công ty cung ứng rượu vang hảo hạng.", "eng": "Brown and Son, purveyors of fine wines."}, {"viet": "Nhưng tôi thích nhất loại nhung màu xanh da trời.", "eng": "But I like the sky blue one best."}, {"viet": "Nhưng hôm nay chúng ta sẽ không trễ đâu.", "eng": "But we won't be late today."}, {"viet": "Nhân tiện, tôi có thể đổi lại tiền sang đô la Canada không?", "eng": "By the way, can I change the money back into Canadian dollars?"}, {"viet": "Tôi có thể trở lại vấn đề anh nói lúc bắt đầu cuộc họp được không?", "eng": "Can I go back to what you said at the beginning of the meeting?"}, {"viet": "Chúng ta có thể xếp cho cô ấy vào một công việc ở phòng kinh doanh không?", "eng": "Can we slot her into a job in the sales department?"}, {"viet": "Bạn có thể mua một số hàng tạp hoá trên đường về nhà không?", "eng": "Can you pick up some groceries on the way home?"}, {"viet": "Can't là cách viết rút gọn của cannot.", "eng": "Can't is a contraction of cannot."}, {"viet": "Đổi màu cho giống với nền.", "eng": "Change colour to simulate the background."}, {"viet": "Chọn bất cứ cái gì anh thích.", "eng": "Choose what thing soever you please."}, {"viet": "Tuần nay gió bấc lạnh sẽ đem mưa tới cho vùng Tô Cách Lan.", "eng": "Cold northerlies will bring rain to Scotland this week."}, {"viet": "Ngôn từ phức tạp chỉ làm rối rắm thêm những vấn đề.", "eng": "Complicated language that just fogs the real issues."}, {"viet": "Tìm cách xoay xở để sống bằng thu nhập ít ỏi.", "eng": "Contrive to live on a small income."}, {"viet": "Con giữ cho mẹ những gói hàng này trong lúc mẹ tìm chìa khoá nhé?", "eng": "Could you hold these packages while I look for the key?"}, {"viet": "Tội ác bằng bạo lực phải chịu trừng trị nặng nề.", "eng": "Crimes of violence carry heavy penalties."}, {"viet": "Dave có tổ chức bữa tiệc tối nay; anh có đến dự không?", "eng": "Dave's having a party tonight; are you going to it?"}, {"viet": "Phê bình liên tục về những thất bại của chính phủ.", "eng": "Descant endlessly on the Government's failings."}, {"viet": "Bạn đánh cá con ngựa trong hạng hai, ba hay con thắng giải?", "eng": "Did you back the horse for a place or to win?"}, {"viet": "Gọi một bộ sưu tập sách nhỏ là thư viện để tôn giá trị của nó lên.", "eng": "Dignify a small collection of books with the name of library."}, {"viet": "Có làm thì làm cho đàng hoàng còn không thì đừng làm gì cả.", "eng": "Do it properly or don't do it at all."}, {"viet": "Bạn có nghĩ là chế độ ăn uống trung bình của người Nhật đang trở nên ít có lợi cho sức khỏe hơn không?", "eng": "Do you believe that the average Japanese diet is becoming less healthy?"}, {"viet": "Ông có bằng lái xe quốc tế không?", "eng": "Do you have an International Driver's License?"}, {"viet": "Bạn có biết từ head-hunting không?", "eng": "Do you know the word head-hunting?"}, {"viet": "Anh có coi Tom ở trong số các bạn của anh không?", "eng": "Do you rate Tom among your friends?"}, {"viet": "Bạn có nghĩ là bạn có nhiều bạn bè không?", "eng": "Do you think you have many friends?"}, {"viet": "Cái tên trên phong bì có đúng với cái tên trên bức thư bên trong hay không?", "eng": "Does the name on the envelope correspond with the name on the letter inside?"}, {"viet": "Đừng trách bọn trẻ về những sự hỗn láo của chúng-chúng còn thiếu giáo dục nên mới như thế.", "eng": "Don't blame the children for their bad manners-they don't know any better."}, {"viet": "Đừng can thiệp vào những chuyện không liên quan đến bạn.", "eng": "Don't interfere in what doesn't concern you."}, {"viet": "Đừng có xem thường cô ta, cô ta tài ba lắm đấy.", "eng": "Don't run her down, she is very talented."}, {"viet": "Đừng lo, tôi sẽ đến đón bạn ở đây lúc 8 giờ.", "eng": "Don't worry, I'll give you a ride here at 8: 0."}, {"viet": "Lái xe với lốp mòn gai có thể bị nguy hiểm.", "eng": "Driving with worn treads can be dangerous."}, {"viet": "Các chiều hướng kinh tế đang diễn ra trái ngược với những dự đoán.", "eng": "Economic trends are running counter to the forecasts."}, {"viet": "Tìm hiểu về giá cả thuê một căn nhà.", "eng": "Enquire about terms for renting a house."}, {"viet": "Bài toán đó quá khó đối với mọi người.", "eng": "Everybody was stumped by the problem."}, {"viet": "Xin lỗi cho hỏi, đây có phải là trạm hải quan không?", "eng": "Excuse me, is this the Customs?"}, {"viet": "Thi hỏng một lần đâu có cản bạn cố gắng lần nữa.", "eng": "Failure in one examination should not stop you trying again."}, {"viet": "Cảm xúc bị đè nén quá lâu.", "eng": "Feelings that have been pent up for too long."}, {"viet": "Thứ nhất, thứ hai và thứ ba là những số thứ tự.", "eng": "First, second and third are ordinals."}, {"viet": "Cứ noi theo gương bà ta thì một ngày nào đó anh sẽ thành một học giả vĩ đại.", "eng": "Follow her cue and one day you'll be a great scholar."}, {"viet": "Dự đoán kết quả của cuộc bầu cử.", "eng": "Forecast what the outcome of the election will be."}, {"viet": "Nhìn từ góc độ này thì nó trông có vẻ cong.", "eng": "From this angle it looks crooked."}, {"viet": "Lấy viễn cảnh toàn bộ thung lũng.", "eng": "Get a perspective of the whole valley."}, {"viet": "Tối nay không đi thăm bạn trai.", "eng": "Give my boy-friend a miss tonight."}, {"viet": "Hãy đi thẳng theo con đường này cho đến khi ông đến một giao lộ lớn.", "eng": "Go straight along this street until you come to a major intersection."}, {"viet": "Dò dẫm tìm đường của mình dọc theo một hành lang tối om.", "eng": "Grope one's way along a darkened corridor."}, {"viet": "Có một lý lịch về hành vi bất phục tùng.", "eng": "Has a history of insubordinate behaviour."}, {"viet": "Con đã quyết định làm gì cho ngày sinh nhật của mình chưa?", "eng": "Have you chosen what you want for your birthday?"}, {"viet": "Anh đã chủng ngừa dịch tả chưa?", "eng": "Have you had your cholera jabs yet?"}, {"viet": "Anh ta là người không bao giờ muốn nghe phỉnh nịnh.", "eng": "He'd be the last person to fall for flattery."}, {"viet": "Anh ta luôn tìm cách bào chữa cho chuyện đến muộn của mình.", "eng": "He's always making excuses for being late."}, {"viet": "Nó thi trượt rồi, đáng đời là nó đã không học.", "eng": "He's failed this exams, it serves him right for not studying."}, {"viet": "Anh ta không phải là một sĩ quan mà chỉ là lính thường.", "eng": "He's not an officer, but a common soldier."}, {"viet": "Nó quá bủn xỉn, chẳng đóng góp đâu.", "eng": "He's too perishing mean to pay his share."}, {"viet": "Anh ấy luôn bảo là anh ấy sẽ giúp đỡ, nhưng đến lúc quyết định thì anh ta làm không cái gì cả.", "eng": "He always says he'll help, but when it comes to the crunch, he does nothing."}, {"viet": "Nó tin vào việc tập thể dục nhiều.", "eng": "He believes in getting plenty of exercise."}, {"viet": "Anh ta khó lòng đã đến được.", "eng": "He can hardly have arrived yet."}, {"viet": "Anh ấy xem những công việc như thế không xứng đáng với mình.", "eng": "He considers such jobs beneath him."}, {"viet": "Nó đặt những quyển sách đó lên bàn giấy.", "eng": "He deposits the books on the desk."}, {"viet": "Nó không muốn nhờ giúp đỡ.", "eng": "He doesn't like asking for help."}, {"viet": "Hắn đã thi lái xe trượt năm lần.", "eng": "He failed his driving test five times."}, {"viet": "Ông ta quên béng cái điểm hay ho nhất trong phần phát biểu của mình sau bữa ăn.", "eng": "He forgot the punch-line of his after-dinner speech."}, {"viet": "Hắn liếc cô ta rồi tiếp tục đi.", "eng": "He glanced at her and then passed on."}, {"viet": "Khi đó tóc ông ấy màu nâu sẫm.", "eng": "He had dark brown hair then."}, {"viet": "Hắn có một trí nhớ kém về ngày tháng.", "eng": "He has a poor memory for dates."}, {"viet": "Nó không có khiếu mà cũng không muốn học.", "eng": "He has neither talent nor the desire to learn."}, {"viet": "Anh ấy cắn giữ lấy sợi dây thừng khi leo lên cây.", "eng": "He held the rope in his teeth as he climbed the tree."}, {"viet": "Ông ta trang trí ngôi nhà với ý định bán nó đi.", "eng": "He is decorating the house with a view to selling it."}, {"viet": "Anh ấy là điển hình của danh dự.", "eng": "He is the soul of honour."}, {"viet": "Ông ấy biết chuyển ngân phiếu du lịch ở đâu.", "eng": "He knows where to negotiate the traveler's cheques."}, {"viet": "Hắn đóng cửa và cài then lại.", "eng": "He locked the door and pressed the bolt home."}, {"viet": "Anh ta vắt nước cam tươi bằng một cái máy ép chạy điện.", "eng": "He makes fresh orange juice with an electric extractor."}, {"viet": "Anh ta chưa bao giờ thực sự thành công trong nghề làm diễn viên.", "eng": "He never really made it as an actor."}, {"viet": "Anh ấy mường tượng về những gì có thể xảy ra khi sống ở Java.", "eng": "He pictured to himself what it might be like to live in Java."}, {"viet": "Nó rút một cuộn những tờ 10 bảng Anh ra khỏi túi.", "eng": "He pulled a wad of £ 10 notes out of his pocket."}, {"viet": "Nó lập luận là nếu chúng ta xuất phát lúc bình minh, chúng ta sẽ đến đó vào buổi trưa.", "eng": "He reasoned that if we started at dawn, we would be there by noon."}, {"viet": "Nó đã về nhà mà không có một ai khác về theo.", "eng": "He returned home without any of the others."}, {"viet": "Ông ta lúc nào cũng khá là bảo thủ.", "eng": "He's always been rather starchy."}, {"viet": "Ông ta đã kiếm được việc làm rồi à? Bà ta nói vậy.", "eng": "He's got the job? So she said."}, {"viet": "Ông ấy định trả 2.500 bảng Anh để mua chiếc xe ô-tô đó nhưng tôi không nghĩ rằng ông ta sẽ trả thêm nữa.", "eng": "He's prepared to pay £ 2,500 for the car but I don't think he'll go any higher."}, {"viet": "Anh ta nói họ đã lấy nhau, mặc dù tôi chắc họ chưa đâu.", "eng": "He said they were married although I'm sure they're not."}, {"viet": "Hắn dường như trở thành điên thật.", "eng": "He seems to have gone quite potty."}, {"viet": "Anh ta bày giấy tờ khắp trên bàn giấy, làm ra vẻ bận rộn.", "eng": "He shuffled the papers around on the desk, pretending to be busy."}, {"viet": "Nó nói có phần nào quá nhanh đối với tôi để có thể hiểu kịp.", "eng": "He spoke rather too quickly for me to understand."}, {"viet": "Anh ta đã kiên quyết khắc phục tật nói ngọng của mình.", "eng": "He strove manfully to overcome his speech defect."}, {"viet": "Ông ta dạy rằng quả đất quay chung quanh mặt trời.", "eng": "He taught that the earth revolves around the sun."}, {"viet": "Ông ta đưa vợ đi ăn hiệu nhân ngày sinh nhật của bà ấy.", "eng": "He took his wife out for a meal on her birthday."}, {"viet": "Ông ta cố gắng không để nghề nghiệp của mình xen vào cuộc sống gia đình.", "eng": "He tries not to let his business interfere with his home life."}, {"viet": "Nó đi chầm chậm, đôi bàn tay thọc sâu vào túi.", "eng": "He walked slowly, his hands buried in his pockets."}, {"viet": "Ông ta lúc nào cũng biện hộ cho những ưu việt của chủ nghĩa tư bản.", "eng": "He was always preaching the virtues of capitalism."}, {"viet": "Anh ta đã bị khựng lại do thất bại của mình.", "eng": "He was chastened by his failure."}, {"viet": "Anh ta sửng sốt lặng người khi nghe tin bạn mình bị buộc tội giết người.", "eng": "He was flabbergasted when he heard that his friend had been accused of murder."}, {"viet": "Anh ta được trao quyền điều hành cửa hàng khi ông giám đốc đi vắng.", "eng": "He was left in charge of the shop while the manager was away."}, {"viet": "Cậu ấy khá bực bội về việc bị gạt ra khỏi đội.", "eng": "He was pretty choked about being dropped from the team."}, {"viet": "Ông ta đã bị tước đoạt hết tài sản.", "eng": "He was stripped of all his possessions."}, {"viet": "Anh ta đi đi lại lại trước ngôi nhà.", "eng": "He was walking to and fro in front of the house."}, {"viet": "Anh ấy sẽ rất thất vọng nếu anh ấy không dự được bữa tiệc này.", "eng": "He will be terribly disappointed if he misses this party."}, {"viet": "Anh ấy sẽ chia sẻ đồng bảng Anh cuối cùng của mình với tôi.", "eng": "He would share his last pound with me."}, {"viet": "Xin chào đây là phòng nghiệp vụ ngân hàng của Ngân hàng Thương mại.", "eng": "Hello, this is the Banking Department of the Commercial Bank."}, {"viet": "Quyển sách của cô ấy lột tả được tinh hoa của chủ nghĩa nhân bản thời kỳ Phục Hưng.", "eng": "Her book captures the quintessence of Renaissance humanism."}, {"viet": "Sự mô tả của cô ta về vùng đất đó thật là sống động.", "eng": "Her description of the area is full of colour."}, {"viet": "Ngón tay cô ta sưng to đến nỗi không rút được cái nhẫn ra.", "eng": "Her finger was so swollen that she couldn't get her ring off."}, {"viet": "Cô ấy đã đối xử rất tồi tệ với cô trong suốt cuộc đời vợ chồng của họ.", "eng": "Her husband treated her rottenly all their married life."}, {"viet": "Năm tới nữ hoàng sẽ đi thăm Nam Phi.", "eng": "Her Majesty will be visiting South Africa next year."}, {"viet": "Cha mẹ cô ấy chịu phí tổn cho cô đi Mỹ.", "eng": "Her parents paid for her to go to America."}, {"viet": "Vẻ mặt rầu rĩ của cô ấy phản ánh thực chất những ý nghĩ của cô ấy.", "eng": "Her sad looks reflected the nature of her thoughts."}, {"viet": "Những lý thuyết của bà ta đã có ảnh hưởng sau xa tới việc cải tổ giáo dục.", "eng": "Her theories were seminal for educational reform."}, {"viet": "Nơi đây những thân cây ngô băm nhỏ và những thức ăn cây cỏ khác được dự trữ cho bò ăn vào mùa đông.", "eng": "Here chopped green cornstalks and others such plant food are stored for the cows to eat in winter."}, {"viet": "Sự nghiện ngập ma túy của anh ta đã đẩy anh ta vào cuộc đời tội ác.", "eng": "His addiction to drugs propelled him towards a life of crime."}, {"viet": "Thân xác anh ta ốm yếu vì bệnh tật lâu dài.", "eng": "His body was wasted by long illness."}, {"viet": "Những yêu cầu giúp đỡ thường xuyên của hắn, đòi hỏi quá nhiều ở thiện chí của chúng tôi.", "eng": "His constant requests for help taxed our goodwill."}, {"viet": "Nét mặt ông ta chuyển từ hoang mang sang khiếp sợ khi hiểu được điều gì đã xảy ra.", "eng": "His expression changed from bewilderment to horror as he realized what had happened."}, {"viet": "Từ khi nó theo lớp hội thoại, tiếng Pháp của nó tiến bộ nhiều.", "eng": "His French has come on a lot since he joined the conversation class."}, {"viet": "Sự kém cỏi của hắn đã đưa chúng tôi gần đến chỗ suy sụp.", "eng": "His incompetence has brought us to the brink of ruin."}, {"viet": "Thoạt đầu thái độ của anh ta có vẻ khó chịu, nhưng khi hiểu nhau thêm anh ta đã trở nên tốt hơn.", "eng": "His manner seemed unpleasant at first, but he improved on further acquaintance."}, {"viet": "Những cuốn sách khác của anh ta vẫn còn nằm trong kho.", "eng": "His other books are still in storage."}, {"viet": "Quần áo rách rưới là một bằng chứng về sự nghèo khổ của anh ta.", "eng": "His ragged clothes were witness to his poverty."}, {"viet": "Bài diễn văn của ông ta kết thúc bằng một giọng kiên quyết.", "eng": "His speech ended on a note of resolution."}, {"viet": "Sự xuất hiện của ông ta sẽ bảo đảm sự thành công của buổi họp.", "eng": "His turning up will guarantee the success of the meeting."}, {"viet": "Những bài viết của ông ta lấp lánh sự ẩn dụ kinh điển.", "eng": "His writings sparkle with classical allusions."}, {"viet": "Hy vọng là chúng ta sẽ đến trước khi trời tối.", "eng": "Hopefully, we'll arrive before dark."}, {"viet": "Tôi phải làm sao đây để xóa hết những vết bẩn trên tường?", "eng": "How can I get the dirt off the walls?"}, {"viet": "Anh có điên không mà đòi mua hai cuốn này?", "eng": "How did you have the nerve to ask for them?"}, {"viet": "Chúng ta phải đi bao xa?", "eng": "How far do we have to go?"}, {"viet": "Anh định ở lại Paris bao lâu?", "eng": "How long will you be staying in Paris?"}, {"viet": "Chị cần mấy củ khoai tây?", "eng": "How many spuds do you want?"}, {"viet": "Mỗi ngày tôi phải trả bao nhiêu tiền?", "eng": "How much shall I pay each day?"}, {"viet": "Những đống cát khổng lồ ở cửa sông.", "eng": "Huge accumulations of sand at the mouth of a river."}, {"viet": "Tôi muốn uống cà phê có kem và đường.", "eng": "I'd like my coffee with cream and sugar."}, {"viet": "Tôi phải nói là vợ tôi và tôi đồng ý với nhau trong hầu hết mọi điều.", "eng": "I'd say my wife and I were in accord over most things."}, {"viet": "Tôi sẽ dùng 3 cái hăm-bơ-gơ và 1 ly cô-ca lớn.", "eng": "I'll have three hamburgers and a large coke."}, {"viet": "Xin vui lòng cho tôi lấy hai thước vải này.", "eng": "I'll take two yards of this material, please."}, {"viet": "Gần đây tôi cũng đang học tốc ký.", "eng": "I'm also taking stenography lessons these days."}, {"viet": "Ngày mốt tôi sẽ đi Canada.", "eng": "I'm going to Canada the day after tomorrow."}, {"viet": "Tôi không tin lắm vào việc tập thể dục thường xuyên.", "eng": "I'm not a great believer in taking regular physical exercise."}, {"viet": "Tôi thật sự nôn nóng muốn biết thêm về đất nước xinh đẹp này, về lịch sử lâu đời, và về di sản văn hoá phong phú của nó ….", "eng": "I'm really anxious to know more about this beautiful country, about its long history, and about its abundant cultural legacy."}, {"viet": "Tôi chắc hẳn anh ta không có ý xúc phạm bạn.", "eng": "I'm sure he didn't mean to cause offence to you."}, {"viet": "Tôi rất vui được gặp anh! Tôi cũng vậy!", "eng": "I'm very pleased to meet you! Likewise!"}, {"viet": "Tôi đã lên đỉnh tháp Eiffel nhiều lần.", "eng": "I've been to the top of the Eiffel Tower many a time."}, {"viet": "Gần đây tôi đã không có lý do gì để đến thăm nó.", "eng": "I've had no occasion to visit him recently."}, {"viet": "Tôi sắp xong rồi-một chút nữa tôi sẽ tới.", "eng": "I've practically finished-I'll come in a minute."}, {"viet": "Tôi đồng ý với anh ở một mức độ nào đó, nhưng có những nhân tố khác cần cân nhắc.", "eng": "I agree with you to a certain extent but there are other factors to consider."}, {"viet": "Tôi cảm thấy bị xúc phạm vì không được mời.", "eng": "I am hurt not to have been invited."}, {"viet": "Tôi tới nơi khi đoàn tàu cuối cùng đang rời khỏi ga.", "eng": "I arrived as the last train was pulling out."}, {"viet": "Tôi đã mua một chương trình phầm mềm mới.", "eng": "I bought a new software program."}, {"viet": "Tôi không thể chịu đựng nổi khi nhìn thấy trẻ em khổ.", "eng": "I can't endure to see children suffer."}, {"viet": "Tôi không thể lúc nào cũng ở lại và làm việc thay cho anh.", "eng": "I can't stay and cover for you all the time."}, {"viet": "Tôi có thể không dè dặt tiến cử anh ta.", "eng": "I can recommend him without qualification."}, {"viet": "Tôi nói tiếng Anh không giỏi lắm.", "eng": "I can't speak English very well."}, {"viet": "Tôi có thể ngửi thấy là nó đã hút thuốc lá.", "eng": "I could smell he had been smoking."}, {"viet": "Em em muốn sống ở đó?", "eng": "I'd like to live there?"}, {"viet": "Tôi không hiểu rõ lý lẽ của anh ta.", "eng": "I didn't quite get the hang of his argument."}, {"viet": "Tôi không ưa người chồng mới cưới của cô ta chút nào, bạn có thế không?", "eng": "I don't go a bundle on her new husband, do you?"}, {"viet": "Con không thích những cái kẹo này, những cái kia ngon hơn.", "eng": "I don't like these sweets, those are better."}, {"viet": "Tôi không muốn các phóng viên cứ lẩn lút quanh ( nhà tôi ).", "eng": "I don't want reporters skulking around ( my house )."}, {"viet": "Tôi không thích bị nói át như thế.", "eng": "I don't like being talked at."}, {"viet": "Tôi chắc tôi sẽ bị bà chủ đì cho một trận khi bà ấy khám phá ra.", "eng": "I expect I'll get a bollocking from my boss when she finds out."}, {"viet": "Tôi tự cảm thấy đáng khinh vì đã phải hỏi xin tiền.", "eng": "I felt degraded by having to ask for money."}, {"viet": "Tôi thấy một người đàn bà nào đó đang doạ nạt tống tiền chồng tôi.", "eng": "I found that some woman was blackmailing my husband."}, {"viet": "Tôi bị giao cho tổ chức một bữa tiệc Giáng Sinh.", "eng": "I got landed with organizing the Christmas party."}, {"viet": "Tôi bị cúm cả tuần trước mà lại vào đúng kỳ nghỉ của tôi nữa chứ!", "eng": "I had flu last week and I was on holiday too!"}, {"viet": "Tôi ghét thấy sách bị rẻ rúng.", "eng": "I hate to see books being mistreated."}, {"viet": "Tôi có tin quan trọng cho anh-tin tốt lành, tôi phải nói ngay.", "eng": "I have important news for you-good news, I hasten to add."}, {"viet": "Tôi để cháu bé cho mẹ tôi săn sóc mỗi ngày.", "eng": "I have the baby with my mother every day."}, {"viet": "Từ lâu lắm tôi không thấy bóng dáng anh ta đâu.", "eng": "I haven't seen neither hide nor hair of him for ages."}, {"viet": "Tôi nghe nói người ta có thể mua súng khá dễ dàng ở các cửa hàng.", "eng": "I heard you can buy a gun rather easily in the stores."}, {"viet": "Tôi hy vọng là anh cảm thấy tự hãnh diện-anh đã phá hỏng cuộc chơi!", "eng": "I hope you feel proud of yourself-you've ruined the game!"}, {"viet": "Tôi biết có chuyện gì không hay: mọi người đều nhìn tôi một cách kỳ cục.", "eng": "I knew something was wrong: everyone was giving me funny looks."}, {"viet": "Tôi cho khách trọ thuê những buồng dự phòng của tôi.", "eng": "I let out my spare rooms to lodgers."}, {"viet": "Tôi sẽ trở lại trong giây lát!", "eng": "I'll be back in two shakes!"}, {"viet": "Con sẽ ủi nó luôn cho.", "eng": "I'll iron it as well."}, {"viet": "Tôi rất thích anh ấy đọc cho tôi nghe trong lúc tôi nằm trên giường.", "eng": "I love him reading to me in bed."}, {"viet": "Tôi rất vui vì bạn muốn uống thử nó.", "eng": "I'm glad you want to try it."}, {"viet": "Tôi không giỏi môn sử lắm.", "eng": "I'm not very good at history."}, {"viet": "Tôi đã làm bài sai bét trong kỳ thi đó.", "eng": "I made a proper balls-up of that exam."}, {"viet": "Tôi phải kiểm lại bản đối chiếu thu chi tiền gửi ngân hàng của tôi.", "eng": "I must check this bank balance."}, {"viet": "Tôi cần một ít keo, giấy, dây và tất cả những thứ đó để làm một cái diều.", "eng": "I need some glue paper, string and all that jazz, to make a kite."}, {"viet": "Có lần tôi trông thấy một người xé một cuốn danh bạ điện thoại làm đôi.", "eng": "I once saw a man tear a telephone directory in half."}, {"viet": "Tôi đã hứa đem về cho cô ấy một con từ nước Mỹ.", "eng": "I promised I'd bring her on from America."}, {"viet": "Tôi nghĩ anh nên nói với cô ấy là anh đã trao công việc đó cho người khác rồi, đó là phép lịch sự thông thường.", "eng": "I really think you should tell her you've given the job to somebody else, it's a matter of common courtesy."}, {"viet": "Tôi viết lại bài báo bởi vì nó không phù hợp với chính sách của chúng ta.", "eng": "I rewrote the article because it didn't accord with our policy."}, {"viet": "Tôi hiểu ý anh rồi, James ạ, nhưng nếu chúng ta cho tất cả nhân viên bán hàng lên tầng này, thì chúng ta sẽ phải chuyển người khác đi.", "eng": "I see your point, James, but if we bring all the sales staff up this floor, we'll just have to move someone else."}, {"viet": "Tôi hét to bảo hắn đóng cổng lại.", "eng": "I shouted to him to shut the gate."}, {"viet": "Tôi đề nghị chúng ta tỉa mỏng đuôi tóc và cắt bỏ đuôi tóc bị chẻ.", "eng": "I suggest that we trim the ends and cut off the split ends."}, {"viet": "Tôi nghĩ tôi sẽ tới một chi nhánh ngay bây giờ và kiểm tra lại các chi tiết.", "eng": "I think I'll go to an agency right now and check out the details."}, {"viet": "Tôi nghĩ rằng câu trả lời là đúng nhưng tôi không hoàn toàn chắc chắn.", "eng": "I think the answer's right but I'm not absolutely sure about it."}, {"viet": "Tôi nghĩ tiếng cười của họ khá là gượng gạo.", "eng": "I thought their laughter was rather forced."}, {"viet": "Tôi hụt chân, đánh rơi cái mâm đang bê.", "eng": "I tripped over, dropping the tray I was carrying."}, {"viet": "Tôi chỉ xem chúng trong phim.", "eng": "I've only seen them in the movies."}, {"viet": "Tôi muốn biết xem họ có đổi đồng lia Ý không?", "eng": "I want to know if they exchange Italian lira?"}, {"viet": "Tôi nhận thấy có sự gò bó nào đó về phía họ khi họ ở trước mặt tôi.", "eng": "I was aware of a certain constraint on their part when they were in my presence."}, {"viet": "Tôi được thông báo là tiền đã đến.", "eng": "I was informed that the money had arrived."}, {"viet": "Tôi đứng ngay cạnh cô ta, nhưng thậm chí cô ta cũng không nhận thấy sự hiện diện của tôi.", "eng": "I was standing right next to her, but she didn't even acknowledge me."}, {"viet": "Tôi đi ra không mang ô theo và bị ướt như chuột lột.", "eng": "I went out without my umbrella and got drenched to the skin."}, {"viet": "Tôi xin kết thúc bài diễn văn của tôi bằng lời cầu chúc cho đôi vợ chồng mới cưới được mãi mãi hạnh phúc.", "eng": "I wish to conclude my speech with a prayer for the continued happiness of the newly married couple."}, {"viet": "Tôi tự hỏi không biết anh ta dám đứng trước công chúng hay không.", "eng": "I wonder whether he dare stand up in public."}, {"viet": "Tôi muốn đổi một ít tiền.", "eng": "I would like to exchange some currency."}, {"viet": "Tôi không muốn suy đoán về những lý do từ chức của bà ấy.", "eng": "I wouldn't like to speculate on the reasons for her resignation."}, {"viet": "Nếu anh ta cứ tiếp tục thay đổi ý kiến về vấn đề này thì quyết định sẽ được thực hiện đối với anh ta.", "eng": "If he continues to flip-flop on this issue, the decision will be made for him."}, {"viet": "Có phải là ông bạn già Bob Thomson của tôi đó không-thật là một sự trùng hợp ngẫu nhiên!", "eng": "If it isn't my old friend Bob Thomson-what a coincidence!"}, {"viet": "Nếu như có một nét nổi bật nào toát ra từ bản tường thuật này, thì đó là ý chí sắt đá không lay chuyển.", "eng": "If there is one dominant trait that emerges from this account, it is adamantine will power."}, {"viet": "Nếu anh thêm quá nhiều chất lỏng, hỗn hợp sẽ không đủ đặc.", "eng": "If you add too much liquid the mixture will not be thick enough."}, {"viet": "Nếu em không muốn là sơ mi cho anh thì anh sẽ làm lấy.", "eng": "If you don't want to iron my shirt I'll do it."}, {"viet": "Anh nên nhớ là Mary bao giờ cũng yêu súc vật.", "eng": "If you remember, Mary was always fond of animals."}, {"viet": "Mặc kệ những lời nói của hắn là lúc nào cũng không có tiền, đó chỉ là đòn phép thôi.", "eng": "Ignore his constant reference to not having any money, it's just a try-on."}, {"viet": "Ở Anh, nhẫn cưới được đeo ở ngón tay thứ ba bàn tay trái.", "eng": "In Britain, wedding-rings are worn on the third finger of the left hand."}, {"viet": "Nằm bệnh viện để mổ tuyến tiền liệt.", "eng": "In hospital for an operation on his prostate."}, {"viet": "Ở một vài nước thuốc lá là mặt hàng độc quyền của nhà nước.", "eng": "In some countries tobacco is a government monopoly."}, {"viet": "Rút cục là rồi giá cả cũng phải tăng.", "eng": "In the long run prices are bound to rise."}, {"viet": "Tôi có thể tìm mua tạp chí thời trang ở khu vực này?", "eng": "In which section can I find the fashion magazines?"}, {"viet": "Liệu một bảng câu hỏi được 500 người trả lời đã thực sự đại diện cho ý kiến của một quốc gia chưa?", "eng": "Is a questionnaire answered by 500 people truly representative of national opinion?"}, {"viet": "Đó có phải là toàn bộ những gì anh đã làm được trong hai năm qua không?", "eng": "Is that the sum of what you've done in the last two years?"}, {"viet": "Đây là tất cả hành lí ông muốn kiểm tra ư?", "eng": "Is this all the luggage you want to check?"}, {"viet": "Thật vinh dự được quen biết ông, thưa ông Dodd.", "eng": "It's a great pleasure to make your acquaintance, Mr. Dodd."}, {"viet": "Đã có quyết định là kéo dài thêm xa lộ ( đến bờ biển ).", "eng": "It's been decided to continue the motorway ( to the coast )."}, {"viet": "Các y tá thật khó có thể khách quan được với các bệnh nhân của mình nếu họ có tình cảm quá nhiều với các bệnh nhân đó.", "eng": "It's hard for nurses to be objective about their patients, if they become too emotionally involved with them."}, {"viet": "Không phải nhờ anh mà chúng tôi đã đến kịp giờ-những đường tắt của anh chẳng tắt gì hết!", "eng": "It's no thanks to you that we arrived on time-your short cut weren't short cuts at all!"}, {"viet": "Giải thích cũng khá là phức tạp nhưng tôi sẽ cố.", "eng": "It's rather complicated to explain, but I'll try."}, {"viet": "Cô ấy đi đến nay đã tròn hai năm.", "eng": "It's two years to the day since she went."}, {"viet": "Nó chỉ cao hơn 5% so với giá mẫu cũ.", "eng": "It costs only 5% more than the old model."}, {"viet": "Điều hiển nhiên là tổng thể thì lớn hơn bất cứ một bộ phận nào của nó.", "eng": "It is an axiom that a whole is greater than any of its part."}, {"viet": "Thật hay khi cùng ăn tối với anh, John ạ.", "eng": "It is nice to have you for dinner, John."}, {"viet": "Chẳng bao lâu nữa là sẽ đến giờ cao điểm.", "eng": "It'll be the rush hour soon."}, {"viet": "Đó là bức ảnh núi Phú Sĩ.", "eng": "It's a picture of Mt. Fuji."}, {"viet": "Đó là phòng thứ hai bên phải.", "eng": "It's the second door on the right."}, {"viet": "Phải mất nhiều tháng mới làm quen được với cuộc sống ở miền khí hậu nhiệt đới.", "eng": "It takes many months to become acclimatized to life in a tropical climate."}, {"viet": "Bán được ngay trước khi xuống giá là một hành động tinh ranh.", "eng": "It was an astute move to sell just before prices went down."}, {"viet": "Chẳng bao lâu đợt khách tiếp theo đã phá vỡ cảnh yên tĩnh của họ.", "eng": "It was not long before their peace was disturbed by the next wave of visitors."}, {"viet": "Đây không phải lần đầu tiên nó quay cóp trong kỳ thi.", "eng": "It wasn't the first time he'd cheated in an exam."}, {"viet": "Theo truyền thống người ta thường hát bài Auld Lang Syne, vào đêm giao thừa.", "eng": "Its a tradition to sing Auld Lang Syne on new year's Eve."}, {"viet": "John và tôi là hai người duy nhất ở trong phòng.", "eng": "John and I were the only people in the room."}, {"viet": "Hãy nói thẳng sự thật với tôi đừng hoa hoè hoa sói nữa.", "eng": "Just tell me the truth without a lot of embroidery."}, {"viet": "Các danh từ Latin gồm có cách, số và giống.", "eng": "Latin nouns have case, number, and gender."}, {"viet": "Chúng ta hãy sớm họp mặt lại nhé.", "eng": "Let's get together again soon."}, {"viet": "Nam y tá thường được tuyển dụng làm ở các bệnh viện tâm thần.", "eng": "Male nurses are often employed in hospitals for the mentally ill."}, {"viet": "Nhiều cây nếu tỉa chồi đi sẽ cho hoa lớn hơn mặc dù ít hơn.", "eng": "Many plants if they are disbudded will produce larger, though fewer flowers."}, {"viet": "Mathew, đã cắt dây ruy băng chính thức khánh thành tòa nhà văn phòng mới của chúng ta.", "eng": "Mathew, has cut the ribbon to make the official opening of our new office building."}, {"viet": "Cho phép chúng tôi đề nghị ông thử vài mặt hàng nào đó trước đã?", "eng": "May we suggest you try certain articles first?"}, {"viet": "Hầu hết sinh viên năm thứ nhất đều sống ở trong trường.", "eng": "Most first-year students live on campus."}, {"viet": "Ông Wilson, tôi xin giới thiệu bạn tôi, ông Lý?", "eng": "Mr. Wilson, may I introduce my friend Mr. Lee?"}, {"viet": "Ô tô của tôi sáng nay bị hỏng, tôi phải đi làm bằng xe buýt.", "eng": "My car crapped out this morning, I had to take the bus to work."}, {"viet": "My friends who live in London'có chứa một mệnh đề hạn định,'my parents who live in Leeds'thì không.", "eng": "My friends who live in London'contains a restrictive clause,'my parents, who live in Leeds'does not."}, {"viet": "Mũi tôi bị đau vì hỉ mũi quá nhiều.", "eng": "My nose is sore from blowing it so much."}, {"viet": "Vợ tôi, lúc này không có nhà, sẽ gọi dây nói cho chị khi cô ấy trở về.", "eng": "My wife, who is out at the moment, will phone you when she gets back."}, {"viet": "Tin tức có tầm quan trọng đáng kể, đặc biệt, v. v.", "eng": "News of considerable, unusual, etc gravity."}, {"viet": "Không, việc đó không cần đâu.", "eng": "No, that won't be necessary."}, {"viet": "Không ai không bị nghi ngờ, kể từ cô lớp trưởng đến học trò nhỏ tuổi nhất.", "eng": "Nobody was free from suspicion, from the head girl down to the youngest pupil."}, {"viet": "Ngày nay hầu như nhà nhà đều được thắp sáng bằng điện.", "eng": "Nowadays, houses are mostly lighted by electricity."}, {"viet": "Ồ, ông Kemp, có phải không?", "eng": "Oh, Mr. Kemp isn't it?"}, {"viet": "Nghe gọi tên nó, con chó đang ngủ nhảy chồm dậy.", "eng": "On hearing his name called the sleeping dog sprang to life."}, {"viet": "Một người chị học ở Trường Trung học Midorigaoka.", "eng": "One goes to Midorigaoka High School."}, {"viet": "Chỉ có mười sinh viên tham dự lớp, số còn lại nghỉ ốm.", "eng": "Only ten students attended the class because of the rest were off sick."}, {"viet": "Trong xưởng máy của chúng tôi có một điều lệ khắc nghiệt là cấm hút thuốc.", "eng": "Our factory has a hard-and-fast rule against smoking."}, {"viet": "Cái máy giặt mới của chúng tôi cứ hỏng luôn-hoàn toàn là do tay nghề tồi.", "eng": "Our new washing-machine keeps breaking down-it's entirely due to shoddy workmanship."}, {"viet": "Thằng con út nhà tôi lên quai bị.", "eng": "Our youngest boy has gone down with mumps."}, {"viet": "Hành khách bị khám xét hành lí khi lên máy bay.", "eng": "Passengers were screened as they boarded the aircrafts."}, {"viet": "Nhân dân trên các đường phố bắn súng lục lên trời mừng thắng lợi.", "eng": "People were shooting off pistols in the streets to celebrate the victory."}, {"viet": "Làm ơn uống 2 viên trước mỗi bữa ăn.", "eng": "Please take two tablets before each meal."}, {"viet": "Đạt được một thỏa thuận sơ bộ với ban giám đốc về tiền lương.", "eng": "Reach an understanding with management about pay."}, {"viet": "Những cuộc đàm phán bí mật giữa Đức và Ý.", "eng": "Secret negotiations between Germany and Italy."}, {"viet": "Giá cổ phần hôm nay có vẻ lên trong hoạt động buôn bán nhộn nhịp.", "eng": "Share prices were buoyant today in active trading."}, {"viet": "Bà ta luôn than vãn về thời thơ ấu bất hạnh của bà ta.", "eng": "She's always snivelling about her unhappy childhood."}, {"viet": "Cô ta đã vào bệnh viện để cắt ruột thừa.", "eng": "She's gone into hospital to have her appendix taken out."}, {"viet": "Bà ta không được thận trọng lắm trong các phương pháp kinh doanh của bà.", "eng": "She's not too nice in her business methods."}, {"viet": "Cô ta cao một cách khác thường, cũng hệt như cả hai bố mẹ cô.", "eng": "She's usually tall, as are both her parents."}, {"viet": "Bà ta chống án lên toà án tối cao về bản án kết tội bà.", "eng": "She appealed to the high court against her sentence."}, {"viet": "Chắc chắn cô ta có thể giữ vững lập trường của mình chống lại bất cứ người nào trong cuộc tranh cãi.", "eng": "She can certainly hold her own against anybody in an argument."}, {"viet": "Bà ấy không đi được bình thường sau lần đột quỵ.", "eng": "She couldn't walk very well after her stroke."}, {"viet": "Cô ấy không nhận là chủ chiếc xe ấy.", "eng": "She disclaimed ownership of the vehicle."}, {"viet": "Cô ta mơ màng nhớ lại thời thơ ấu.", "eng": "She fell into a reverie about her childhood."}, {"viet": "Bà ta đã cho tôi đi nhờ xe đến tận ga.", "eng": "She gave me a lift as far as the station."}, {"viet": "Cô ta suýt nữa thì thi trượt, nhưng chị cô ta, trái lại, đã thi rất tốt.", "eng": "She had almost failed the exam, but her sister, by contrast, had done very well."}, {"viet": "Cô ta có một lối nói chuyện chậm rãi, thong thả.", "eng": "She has a slow, deliberate way of talking."}, {"viet": "Cô ta có những ý kiến rất rõ ràng về tầm quan trọng của việc đánh vần đúng.", "eng": "She has very pronounced views on the importance of correct spelling."}, {"viet": "Cô ta luôn luôn chịu sức ép căng thẳng và điều đó ảnh hưởng đến sức khoẻ cô ta.", "eng": "She is constantly under pressure and it is affecting her health."}, {"viet": "Cô ta giật mạnh bàn tay ra khi anh ta định nắm lấy.", "eng": "She jerked her hand away when he tried to touch it."}, {"viet": "Bà ta sống tại một làng nhỏ ở Pháp.", "eng": "She lives in a small village in France."}, {"viet": "Cô ta cố gắng để giữ lại được tính khôi hài của mình bất chấp mọi thứ.", "eng": "She managed despite everything to preserve her sense of humour."}, {"viet": "Cô ấy sắp xếp lớp thành bốn tổ.", "eng": "She organized the class into four groups."}, {"viet": "Bà ấy để đồ khâu vá sang một bên để trả lời điện thoại.", "eng": "She put her mending aside to answer the telephone."}, {"viet": "Cô ta hơi khoái uống rượu.", "eng": "She's a bit too fond of the bottle."}, {"viet": "Bà ấy đúng chín chục tuổi.", "eng": "She's just on ninety years old."}, {"viet": "Cô ấy đi lướt qua, hoàn toàn lờ tôi đi.", "eng": "She sailed past, ignoring me completely."}, {"viet": "Cô ta nên chấm dứt quan hệ với nó-nó đối xử quá tồi tệ với cô ta.", "eng": "She should finish with him-he treats her very badly."}, {"viet": "Bà ta đã bỏ ra buổi chiều để nhổ cỏ dại ở các luống hoa.", "eng": "She spent the afternoon pulling up the weeds in the flowerbeds."}, {"viet": "Cô ta thề là chưa bao giờ gặp nó.", "eng": "She swore that she'd never seen him."}, {"viet": "Cô ta cứ muốn can thiệp vào, nhưng tôi đã bảo cô ta cút xéo đi!", "eng": "She tried to interfere, but I sent her packing!"}, {"viet": "Cô ta muốn làm gì lớn lao hơn là một ca sĩ và cô ta đang lao vào điện ảnh.", "eng": "She wants to be more than just a singer and is launching out into films."}, {"viet": "Bà ta đã bị những người tự nhận là bạn bè và người ủng hộ bà phản bội.", "eng": "She was betrayed by her professed friends and supporters."}, {"viet": "Cô ta đã được cấy một quả tim mới trong một cuộc phẫu thuật kéo dài tám tiếng đồng hồ.", "eng": "She was given a new heart in an eight-hour operation."}, {"viet": "Bà ta là một trong những người đầu tiên tán thành phương pháp tránh thụ thai.", "eng": "She was one of the earliest advocates of contraception."}, {"viet": "Khi tới bệnh viện, cô ta hãy còn sống.", "eng": "She was still alive when I reached the hospital."}, {"viet": "Chị ấy lau sạch bụi khỏi sàn bếp.", "eng": "She washed the dirt off the kitchen floor."}, {"viet": "Cô ta giật mình tỉnh dậy khi cánh cửa đóng sầm lại.", "eng": "She woke up with a start when the door slammed."}, {"viet": "Cô ta viết những vở kịch châm biếm ngắn cho một tờ tạp chí.", "eng": "She writes satirical sketches for a magazine."}, {"viet": "Tỏ ra thông thạo trong việc điều khiển một tổng đài điện thoại.", "eng": "Show proficiency in operating a switchboard."}, {"viet": "Từ khi chúng tôi dọn đến khu nhà đó nó bắt đầu chơi bời với một đám trẻ rất ngỗ nghịch.", "eng": "Since we came to live on this housing estate he's been getting mixed-up with a very rough crow of boys."}, {"viet": "Những phương pháp cổ truyền chậm chạp dường như hơi lạc lõng trong thời đại kỹ thuật tiên tiến này.", "eng": "Slow traditional methods that seem rather incongruous in this modern technical age."}, {"viet": "Cho đến nay chưa có người nghiện được cải tạo nào lại tái phạm.", "eng": "So far now of the reformed drinkers has backslid."}, {"viet": "Binh lính phải học kỷ luật trong quân đội.", "eng": "Soldiers have to learn discipline in the army."}, {"viet": "Một vài thói quen của cô ta thật là khó chịu nhưng đừng có để những thói quen đó làm phiền hà anh.", "eng": "Some of her habits are off-putting but don't let them roil you."}, {"viet": "Cánh tay tôi đang có cảm giác trở lại.", "eng": "Some sensation is coming back to my arm."}, {"viet": "Có khi tôi trả, có khi anh ấy trả-đổ đồng dường như cũng đạt được mức trung bình.", "eng": "Sometimes I pay, sometimes he pays-it seems to average out in the end."}, {"viet": "Những quy định đặc biệt đã được đưa ra trong thời chiến.", "eng": "Special regulations were introduced in wartime."}, {"viet": "Sự quản lý giá cả và thu nhập bằng luật.", "eng": "Statutory control of prices and incomes."}, {"viet": "Đừng có phá đám nữa, đồ ngu!", "eng": "Stop messing around, you silly twit!"}, {"viet": "Các căn hộ có phòng làm việc thích hợp cho các nhà chuyên nghiệp trẻ.", "eng": "Studio flats suitable for young professionals."}, {"viet": "Lừa gạt một khách du lịch tin vào một trò lừa bịp.", "eng": "Sucker a tourist into a confidence trick."}, {"viet": "Thời gian khám bệnh kéo dài từ 9 giờ đến 10 giờ sáng.", "eng": "Surgery lasts from 9 am to 10 am."}, {"viet": "Đừng để ý đến nó-anh biết nó là một người huênh hoang thế nào rồi đó.", "eng": "Take no notice of him-you know what a show-off he is."}, {"viet": "Dạy sinh viên cách phê bình thơ.", "eng": "Teaching students how to criticize poetry."}, {"viet": "Terry đã dan díu với Sharon cả sáu tuần rồi.", "eng": "Terry has been going out with Sharon for six weeks."}, {"viet": "Nhà của chúng tôi ở ngay trước mặt anh.", "eng": "That's our house right in front of you."}, {"viet": "Điều đó khiến tôi quyết định thôi việc.", "eng": "That decided me to leave my job."}, {"viet": "Sự kiện đó sẽ thành một bài báo hay.", "eng": "That'll make a good story."}, {"viet": "Đó là món tiền đòi bồi thường lớn!", "eng": "That's a very large claim!"}, {"viet": "Đó là một trận đấu tuyệt vời!", "eng": "That was a game and a half!"}, {"viet": "Tai nạn đó để lại vết sẹo trên chân cô ấy.", "eng": "The accident left a scar on her leg."}, {"viet": "Những điều thuận lợi quan trọng hơn nhiều so với các điều bất lợi.", "eng": "The advantages far outweigh the disadvantages."}, {"viet": "Số tiền chúng tôi quyên góp vượt quá sự mong đợi của chúng tôi.", "eng": "The amount of money we raised exceeded an our expectations."}, {"viet": "Công trình quan trọng nhất của kiến trúc sư đó là nhà hát opêra của thành phố.", "eng": "The architect's pièce de résistance was the City Opera House."}, {"viet": "Họa sĩ đó đã tái tạo nụ cười của cô ta một cách hoàn hảo.", "eng": "The artist has caught her smile perfectly."}, {"viet": "Rừng thu đỏ rực một màu.", "eng": "The autumn woods were aflame with colour."}, {"viet": "Quả bóng vừa chạm vào cạnh vợt của anh ta.", "eng": "The ball just tipped the edge of his racket."}, {"viet": "Sàn phòng tắm lênh láng nước.", "eng": "The bathroom floor was running with water."}, {"viet": "Xe đạp được để dưới mái che.", "eng": "The bicycles are kept under cover."}, {"viet": "Cái khăn quàng xanh phù hợp với áo ngoài của anh.", "eng": "The blue scarf goes well with your coat."}, {"viet": "Cuốn sách này không được lập mục lục rõ.", "eng": "The book is not well indexed."}, {"viet": "Đứa trẻ nhắc lại từng câu mẹ nói.", "eng": "The boy echoed every word of his mother."}, {"viet": "Cậu học sinh xuất sắc này làm rạng danh cho thầy cô của mình.", "eng": "The brilliant pupil is a credit to his teachers."}, {"viet": "Xe buýt rời bến lúc 9 giờ 42 sáng.", "eng": "The bus leaves the bus station at 9.42 am."}, {"viet": "Cơ trưởng thông báo máy bay chuẩn bị hạ cánh.", "eng": "The captain announced that the plane was going to land."}, {"viet": "Chiếc ôtô trượt ngang trên băng.", "eng": "The car skidded on the ice."}, {"viet": "Con mèo theo dõi mọi chuyển động của con chuột.", "eng": "The cat followed every movement of the mouse."}, {"viet": "Nhà vô địch dùng hết sức lực dự trữ của mình để thắng trong 50 thước cuối cùng.", "eng": "The champion drew on his reserve strength to win in the last 50 yards."}, {"viet": "Đứa trẻ đó đã mất tích cả tuần lễ.", "eng": "The child had been missing for a week."}, {"viet": "Trẻ con đang học đọc và học viết.", "eng": "The children are learning to read and write."}, {"viet": "Bọn trẻ con sà xuống đống quà.", "eng": "The children swooped down on the pile of presents."}, {"viet": "Những dòng nước cuồn cuộn của vùng nước xoáy.", "eng": "The churning waters of the whirlpool."}, {"viet": "Chiếc đồng hồ treo chỉ để trang trí thôi, hiện nay nó không chạy.", "eng": "The clock is simply for ornament, it doesn't actually work."}, {"viet": "Khuôn viên trường đại học như thể là một cái lò sản sinh ra những khái niệm mới cấp tiến về xã hội học.", "eng": "The college campus as an incubator of radical new sociological concepts."}, {"viet": "Tương lai của công ty phụ thuộc và kết quả của vụ xử.", "eng": "The company's future is contingent on the outcome of the trial."}, {"viet": "Tính độc tương đối của các loại thuốc trừ sâu khác nhau.", "eng": "The comparative toxicity of different insecticides."}, {"viet": "Việc xây dựng những khách sạn khác tiến hành với một tốc độ hết sức nhanh.", "eng": "The construction of other hotels proceeded at breakneck speed."}, {"viet": "Văn phòng của hội đồng gần bên thư viện.", "eng": "The council offices are adjacent to the library."}, {"viet": "Tòa án đã nhận được một bản đệ trình từ nhóm luật sư biện hộ.", "eng": "The court has received a submission from the defence lawyers."}, {"viet": "Đám đông đồng thanh tán thành quyết định.", "eng": "The crowd chorused their approval of the decision."}, {"viet": "Người khách hàng có ấn tượng tốt về hiệu suất của máy.", "eng": "The customer was impressed by the machine's performance."}, {"viet": "Tác dụng làm yếu đi của một nền kinh tế suy thoái.", "eng": "The debilitating effect of economic decline."}, {"viet": "Vị lãnh tụ bị truất phế đã được phục hồi ngôi báu.", "eng": "The deposed chief was restored to his throne."}, {"viet": "Ông giám đốc đã trao giải thưởng vắng mặt cho anh ấy.", "eng": "The director gave him the award in absentia."}, {"viet": "Bác sĩ bấm chuông gọi bệnh nhân tiếp theo.", "eng": "The doctor buzzed the next patient."}, {"viet": "Con chó nhe răng ra với tôi.", "eng": "The dog bared its gums at me."}, {"viet": "Cánh cửa kẹp ngón tay tôi khi đóng lại.", "eng": "The door pinched my finger as it shut."}, {"viet": "Thùng rác đầy ứ ( rác ).", "eng": "The dustbin is chock-full ( of rubbish )."}, {"viet": "Kết quả bầu cử hợp với ý muốn của chính phủ về vấn đề này.", "eng": "The election result was correspondent with the government's wishes in this matter."}, {"viet": "Danh từ tiếng anh theo sau tính từ.", "eng": "The English noun comes after the adjective."}, {"viet": "Những yêu cầu lớn đối với một chức vụ cao cấp trong chính phủ.", "eng": "The exactions of a senior post in government."}, {"viet": "Mắt là cơ quan thị giác.", "eng": "The eye is the organ of sight."}, {"viet": "Càng đi xa về phía bắc thì càng có nhiều chòm sao không bao giờ biến mất dưới chân trời.", "eng": "The farther north one goes, the more constellations there are that never disappear below the horizon."}, {"viet": "Bộ phim không hay như tôi mong đợi.", "eng": "The film didn't match up to my expectations."}, {"viet": "Nhân viên cứu hoả nhấc đứa bé đưa lên vai.", "eng": "The firemen hoisted the boy up onto his shoulders."}, {"viet": "Bài học đầu tiên trong việc lái xe là làm thế nào để khởi động được xe.", "eng": "The first lesson in driving is how to start the car."}, {"viet": "Những bông hoa tạo nên mầu sắc rực rỡ dưới nền bức tường đá.", "eng": "The flowers made a mass of color against the stone wall."}, {"viet": "Cáo đã đào lối đi dưới hàng rào để đến được chỗ mấy con gà.", "eng": "The fox burrowed its way under the fence to reach the chickens."}, {"viet": "Cả bọn đã chối nhận mọi trách nhiệm về vụ nổ.", "eng": "The gang disclaimed all responsibility for the explosion."}, {"viet": "Hương vị nhẹ nhàng, ngon lành của cá hồi.", "eng": "The gentle, delicate flavour of salmon."}, {"viet": "Con ngỗng tức giận kêu tôi.", "eng": "The goose hissed at me angrily."}, {"viet": "Chính phủ đã giảm kinh phí quốc phòng.", "eng": "The government has reduced defense spending."}, {"viet": "Chính phủ muốn kiểm soát sự nhập cư.", "eng": "The government wants to control immigration."}, {"viet": "Màu xanh của vùng thôn quê nước Anh về mùa xuân.", "eng": "The green of the English countryside in spring."}, {"viet": "Các vị khách đi sang phòng ăn.", "eng": "The guests repaired to the dining room."}, {"viet": "Thiết bị sưởi trong xe tôi bị trục trặc.", "eng": "The heater in my car doesn't work properly."}, {"viet": "Con ngựa chùn bước trước hàng rào cao.", "eng": "The horse balked at the high hedge."}, {"viet": "Những giờ phút chờ đợi tưởng chừng như vô tận.", "eng": "The hours of waiting seemed endless."}, {"viet": "Cỗ máy đồ sộ được chuyển tới vị trí mới trên các con lăn.", "eng": "The huge machine was moved to its new position on rollers."}, {"viet": "Nỗi khao khát mãnh liệt muốn dứt bỏ tất cả và tạo cuộc đời mới.", "eng": "The impulsion to break away and make a new life."}, {"viet": "Chữ in trên đồng tiền đã mòn mất.", "eng": "The inscription on the coin had worn away."}, {"viet": "Vấn đề đó đã được tranh cãi tại Nghị viện.", "eng": "The issue was debated in Parliament."}, {"viet": "Ông chánh án xét xử cho nguyên cáo.", "eng": "The judges decided for the plaintiff."}, {"viet": "Công đảng đang ráng hết sức để giành thắng lợi trong cuộc bầu cử.", "eng": "The Labour Party are going all out for victory in the election."}, {"viet": "Từ Latinh của bàn là mensa.", "eng": "The Latin word for table is Mensa."}, {"viet": "Lá thư đó mang dấu niêm của nhà vua.", "eng": "The letter bears the seal of the king."}, {"viet": "Con sư tử bứt rứt đi đi lại lại trong chuồng.", "eng": "The lion paced restlessly up and down in its cage."}, {"viet": "Tình yêu của bà mẹ dành cho đứa con.", "eng": "The love of a mother for her child."}, {"viet": "Các cường quốc trên thế giới đang lo ngại bị tụt hậu trong cuộc chạy đua vũ trang.", "eng": "The major world powers are afraid of falling behind in the arms race."}, {"viet": "Cuộc hôn nhân đó được coi là hợp lệ.", "eng": "The marriage was held to be valid."}, {"viet": "Cuộc họp mở đầu bằng hát quốc ca.", "eng": "The meeting commenced with the signing of the national anthem."}, {"viet": "Sữa đang nóng lên trên bếp.", "eng": "The milk is warming up on the stove."}, {"viet": "Sự hiện đại hoá hệ thống điện thoại.", "eng": "The modernization of the telephone system."}, {"viet": "Bà mẹ ủ đứa bé trong chăn để giữ cho nó ấm.", "eng": "The mother muffled the baby in a blanket to keep him warm."}, {"viet": "Giới quyền uy về âm nhạc, trí thức, nghệ thuật v. v.", "eng": "The musical, intellectual, artistic, etc Establishment."}, {"viet": "Thiết kế mới của chiếc xe hơi hội được đủ mọi đặc trưng mới nhất về an toàn.", "eng": "The new car design incorporates all the latest safety features."}, {"viet": "Vở kịch mới gây ra nhiều bài phê bình.", "eng": "The new play has attracted a good deal of criticism."}, {"viet": "Chương trình tin tức đã vượt quá thời gian quy định.", "eng": "The news programme overran the allotted time."}, {"viet": "Bắc cực có 6 tháng ngày dài ròng rã.", "eng": "The North Pole has six months of continuous day."}, {"viet": "Sự duy trì Ngày năm mới là ngày nghỉ của mọi người.", "eng": "The observance of New Year's Day as a public holiday."}, {"viet": "Bà cụ đếm ba mươi xu chậm chạp từng đồng một rồi đưa cho người bán hàng.", "eng": "The old lady counted out thirty pence and gave it to the shop assistant."}, {"viet": "Chương mở đầu đưa ra quan điểm khái quát về vấn đề ấy.", "eng": "The opening chapter gives a general overview of the subject."}, {"viet": "Người chủ tiệm rượu đã bị tố cáo là pha nước vào bia.", "eng": "The owner of the pub was accused of watering the beer."}, {"viet": "Đảng hoàn toàn nhất trí về vấn đề này.", "eng": "The party is absolutely together on this issue."}, {"viet": "Đội tuần tra bị tấn công từ tứ phía.", "eng": "The patrol came under attack from all sides."}, {"viet": "Các ngôi của Chúa ba ngôi cùng là một bản chất.", "eng": "The persons of the Trinity are coessential."}, {"viet": "Phi công hoãn lại chuyến bay cho đến khi thời tiết tốt.", "eng": "The pilot delayed the flight until the weather cleared."}, {"viet": "Chiếc máy bay đi chệch đường băng vài thước Anh.", "eng": "The plane missed the runway by several yards."}, {"viet": "Các cầu thủ tạm nghỉ để lau khô mồ hôi giữa các trận đấu.", "eng": "The players paused to rub themselves down between games."}, {"viet": "Cảnh sát trưởng nói với một đám đông qua loa.", "eng": "The police chief addressed the huge crowd through a megaphone."}, {"viet": "Cảnh sát từ chối hành động trong khi chưa có đủ bằng chứng.", "eng": "The police refused to act without more evidence."}, {"viet": "Gia đình nghèo đó mở một kiốt sách gần trường để bán cho sinh viên.", "eng": "The poor family ran a kiosk near the school to cater to the students."}, {"viet": "Quyền hạn của cảnh sát cần phải được xác định rõ ràng.", "eng": "The powers of the police need to be clearly defined."}, {"viet": "Tổng thống của Mỹ, tổng thống Clinton.", "eng": "The President of the United State, President Clinton."}, {"viet": "Bà Thủ tướng tuyên bố bà sẽ từ chức.", "eng": "The Prime Minister announced that she would resign."}, {"viet": "Vấn đề đó đã được xét kỹ hơn trong các cuốn sách khác.", "eng": "The problem has been better treated in other books."}, {"viet": "Việc đề bạt Russell chứ không phải Sarah đã thực sự làm bùng nổ cuộc chiến.", "eng": "The promotion of Russell instead of Sarah really made the sparks fly."}, {"viet": "Khi bạn bước vào một căn phòng tối con ngươi mắt sẽ giãn rộng ra.", "eng": "The pupils of your eyes dilate when you enter a dark room."}, {"viet": "Cuộc đua kết thúc với sự thành công của con ngựa Ailen.", "eng": "The race ended in success for the Irish horse."}, {"viet": "Lý do tại sao tôi đến muộn là vì tôi đã nhỡ xe buýt.", "eng": "The reason why I'm late is because I missed the bus."}, {"viet": "Tiền thuê nhà tăng sẽ tác động mạnh vào túi tiền của người nghèo.", "eng": "The rent increase will hit the pockets of the poor."}, {"viet": "Kết quả được đọc trước sự có mặt của toàn thể các bậc cha mẹ.", "eng": "The result were read out in the presence of all the parents."}, {"viet": "Nước sông đã dâng lên nhiều mét.", "eng": "The river has risen several metres."}, {"viet": "Người La Mã đặt cho ông cái tên Augustus là vì họ quá khâm phục ông.", "eng": "The Romans gave him the name Augustus because they admired him so much."}, {"viet": "Rumba là một điệu nhảy của Mỹ-Latinh.", "eng": "The Rumba is a Latin-American dance."}, {"viet": "Mức chi tiêu của anh ta-50.000 pao một năm-đã làm cho tất cả chúng tôi phải kinh ngạc.", "eng": "The scale of his spending-50000 pounds in a year-amazed us all."}, {"viet": "Tiếng sột soạt của ngòi bút ai cạo trên giấy.", "eng": "The scrape of somebody's pen on paper."}, {"viet": "Việc cách ly các bệnh nhân lây khỏi những bệnh nhân khác.", "eng": "The separation of infectious patients from other patients."}, {"viet": "Con tàu không ở trong tình trạng có thể thực hiện một chuyến đi dài.", "eng": "The ship is not in a condition to make a long voyage."}, {"viet": "Bảng kê mua hàng ở trên tủ lạnh kìa.", "eng": "The shopping list is on the refrigerator."}, {"viet": "Còi vang lên báo máy bay oanh tạc.", "eng": "The sirens sounded an air-raid warning."}, {"viet": "Con rắn cuộn tròn mình quanh cành cây.", "eng": "The snake coiled itself round the branch."}, {"viet": "Anh ra về càng sớm thì sẽ càng sớm đến nhà.", "eng": "The sooner you leave the sooner you'll be home."}, {"viet": "Vé phạt vì phóng xe nhanh đã làm lỡ cơ hội của cậu ta với bố cậu.", "eng": "The speeding ticket cooked his goose with his father."}, {"viet": "Mức độ thất nghiệp leo thang không ngừng.", "eng": "The steadily escalating level of unemployment."}, {"viet": "Đường phố trông có vẻ vui tươi với những lá cờ và những đèn màu rực rỡ.", "eng": "The streets look gay with bright flags and coloured lights."}, {"viet": "Những nỗi bất hạnh của đám người tị nạn đói khát.", "eng": "The suffering of the starving refugees."}, {"viet": "Chiếc bàn rung lên khi cô ta đập nắm tay xuống.", "eng": "The table shook when she banged her fist on it."}, {"viet": "Thầy giáo bị học sinh hỏi dồn dập.", "eng": "The teacher was besieged with questions from his pupils."}, {"viet": "Lãnh thổ đã bị các cường quốc chiếm đóng chia cắt.", "eng": "The territory was carved up by the occupying powers."}, {"viet": "Ba môn thể thao quốc gia là bóng đá Mỹ, chơi vào mùa thu, bóng rổ, chơi vào mùa đông, và bóng chày, chơi vào mùa hè.", "eng": "The three national sports are American football, played in the fall, basketball, played in the winter, and baseball, played in the summer."}, {"viet": "Nhóm mafia ở toà thị chính sẽ ngăn cản không cho kế hoạch này được thông qua.", "eng": "The town hall mafia will prevent his plan going through."}, {"viet": "Người thủ quỹ đã cuỗm đi tất cả vốn của câu lạc bộ.", "eng": "The treasurer has run off with all the club's fund."}, {"viet": "Hai đấu thủ ngang nhau mỗi người được 20 điểm.", "eng": "The two contestants are neck and neck with 20 points each."}, {"viet": "Những người kí tên dưới đây bảo đảm lời khai là đúng.", "eng": "The undersigned names guarantee the good faith of the statement."}, {"viet": "Các bộ phận khác nhau của xe hơi được bắt bù loong vào với nhau.", "eng": "The various parts of the car are bolted together."}, {"viet": "Chiếc xe ngựa chạy lắc lư ( trên một con đường gồ ghề ).", "eng": "The wagon jogged along ( a rough track )."}, {"viet": "Thời tiết cho đến lúc này vẫn nắng và ấm áp đột ngột trở rét.", "eng": "The weather, which had hitherto been sunny and mild, suddenly turned cold."}, {"viet": "Toàn bộ thế giới đã bị đảo lộn.", "eng": "The whole world has turned topsy-turvy."}, {"viet": "Gỗ mục đến nỗi anh có thể chọc ngón tay qua.", "eng": "The wood was so rotten you could put your finger through it."}, {"viet": "Câu lạc bộ bóng đá địa phương sẽ thất bại trông thấy: sự vỡ nợ dường như chắc chắn.", "eng": "The writing is on the wall for the local football club: bankruptcy seems certain."}, {"viet": "Cách đào tạo trước kia của họ đã khiến cho họ trở nên ngoan ngoãn và phục tùng một cách máy móc.", "eng": "Their early training programmes them to be obedient and submissive."}, {"viet": "Sự bất đồng quan điểm công khai của họ đối với đường lối chính thức của đảng.", "eng": "Their public dissent from official party policy."}, {"viet": "Thế rồi mình mới sáng mắt ra là hắn ta trước đây lúc nào cũng nói dối.", "eng": "Then the scales fell from my eyes, he had been lying all the time."}, {"viet": "Có một cơ hội thích hợp cho người có tài năng trong thị trấn này.", "eng": "There's a place in this town for a man of his talents."}, {"viet": "Khóc than trên lỗi lầm trong quá khứ chẳng để làm gì.", "eng": "There's no use wailing over mistakes made in the past."}, {"viet": "Cũng có những chiếc bu-mê-răng không quay trở lại chỗ người ném.", "eng": "There are also boomerangs that do not return to the thrower."}, {"viet": "Có dấu ngoặc đơn ( ) và ngoặc vuông [ ].", "eng": "There are round brackets ( ) and square bracket [ ]."}, {"viet": "Ngay lúc này là một chiếc xe tải đến đấy.", "eng": "There goes a truck right now."}, {"viet": "Có một đạo luật cấm đổ chất thải ra sông.", "eng": "There is a law against dangerous effluent being poured into our river."}, {"viet": "Không có lý do gì để không tin những điều bà ta nói.", "eng": "There is no reason to discredit what she says."}, {"viet": "Hình như không có lời phản đối đề nghị này.", "eng": "There seem to be no objections to the proposal."}, {"viet": "Có thông báo chính thức về sự từ chức của ông ấy trên bản tin hôm nay.", "eng": "There was an official announcement of his resignation an the news today."}, {"viet": "Có một trăm người trong phòng.", "eng": "There were one hundred in the room."}, {"viet": "Nhìn chung, những doanh nhân này là trung thực.", "eng": "These businessmen are in the main honest."}, {"viet": "Những mục tiêu này chắc chắn có thể đạt được.", "eng": "These objectives are certainly attainable."}, {"viet": "Họ đang xây một tuyến đường sắt mới về miền Nam.", "eng": "They're building a new railway to the south."}, {"viet": "Họ đã nói với chúng tôi là họ không đến.", "eng": "They've told us they're not coming."}, {"viet": "Họ không giống nhau đến nỗi không ai tin họ là chị em.", "eng": "They are so unlike nobody would believe they were sisters."}, {"viet": "Họ có thể học cách lựa chọn người lãnh đạo một cách sáng suốt thay vì bầu ngay cho người bạn riêng của họ.", "eng": "They can learn to choose leaders wisely instead of just voting for their personal friends."}, {"viet": "Họ chơi bời suốt đêm và ngủ suốt ngày.", "eng": "They dissipate all night and sleep all day."}, {"viet": "Họ đã đưa ra những lý do rõ ràng để dời đi.", "eng": "They gave explicit reasons for leaving."}, {"viet": "Họ đã đặt hàng cho chúng ta ba chiếc máy bay mới.", "eng": "They have placed an order with us for three new aircraft."}, {"viet": "Chúng trông gầy, giống như trẻ bơ vơ và sắp chết đói.", "eng": "They looked thin, waif-like and half starved."}, {"viet": "Họ chia thành đợt chương trình xây dựng.", "eng": "They phased out the building programme."}, {"viet": "Họ uống với nhau hết cả một chai rượu gin.", "eng": "They sank a bottle of gin between them."}, {"viet": "Họ đứng quanh ngôi mộ cô ấy tôn kính thầm lặng.", "eng": "They stood in silent homage round her grave."}, {"viet": "Họ lặn sâu xuống tận đáy biển và leo tít lên các đỉnh núi cao.", "eng": "They went deep down under the sea and up to the tops of high mountains."}, {"viet": "Họ chỉ quan tâm đến nhau, vì vậy tôi cảm thấy mình hơi thừa.", "eng": "They were only interested in each other, so I felt rather superfluous."}, {"viet": "Tình hình chắc chắn có vẻ thuận lợi cho chúng ta.", "eng": "Things certainly seem to be going our way."}, {"viet": "Tay lái của ô tô này rất khó lái.", "eng": "This car's steering isn't very responsive."}, {"viet": "Phát hiện này làm cho những lý thuyết trước đó thành vô nghĩa.", "eng": "This discovery makes a nonsense of previous theories."}, {"viet": "Ngôi nhà này được xây dựng vào thế kỷ 19.", "eng": "This house was built in the 19th century."}, {"viet": "Đây là việc của ông quản đốc, anh phải hỏi ông ta.", "eng": "This is the manager's show, you must ask him about it."}, {"viet": "Vải này không thấm nước mưa.", "eng": "This material is impervious to rain-water."}, {"viet": "Bức tranh này trưng bày ở triển lãm do Ban sưu tầm Nghệ thuật quốc gia tặng.", "eng": "This picture appears in the exhibition by courtesy of the National Art collection."}, {"viet": "Việc này đủ chứng tỏ anh đã dại dột biết chừng nào.", "eng": "This serves to show how foolish you have been."}, {"viet": "Cái bình này hay đổ quá vì đáy quá nhỏ.", "eng": "This vase falls over a lot because the base is too small."}, {"viet": "Mặc dù cô ấy mất việc, cô ta đã giữ thể diện bằng cách nói cô ấy tự ý bỏ việc.", "eng": "Though she'd lost her job, she saved face by saying she'd left it willingly."}, {"viet": "Tom bắt chước hệt giọng nói và điệu bộ của chú nó.", "eng": "Tom mimicked his uncle's voice and gestures perfectly."}, {"viet": "Dù trong hoàn cảnh nào anh cũng đừng cho anh ta vay tiền.", "eng": "Under no circumstances should you lend him any money."}, {"viet": "Bài diễn văn của bà ta có tính chất phá hoại ( luật pháp và trật tự ) không?", "eng": "Was her speech subversive ( of law and order )?"}, {"viet": "Chúng ta sẽ đi ra sông và mang theo bữa ăn ngoài trời.", "eng": "We'll go to the river and take a picnic with us."}, {"viet": "Chúng tôi sẽ đi nằm dưới ánh mặt trời, tắm nắng trong hai tuần.", "eng": "We're going to lie in the sun and roast for two weeks."}, {"viet": "Trước đây, bao giờ chúng ta cũng kiếm được một chỗ nào đó ở đây để nghỉ lại.''Đúng, nhưng không phải bao giờ chúng ta cũng may mắn như thế'.", "eng": "We've always found somewhere to stay here before.''True, but we may not always be so lucky.'."}, {"viet": "Chúng tôi sẽ gửi ngay cho các ông bản đã sửa lỗi.", "eng": "We'll send you the corrected version immediately."}, {"viet": "Năm nay chúng tôi sẽ đi nghỉ ở Singapore.", "eng": "We are going to go to Singapore this year for vacation."}, {"viet": "Chúng tôi đã băng vết thương của nó nhưng không làm cho máu ngừng chảy được.", "eng": "We bandaged his wound but couldn't stop the bleeding."}, {"viet": "Chúng tôi khó có thể có được thời gian hoặc tiền để đi nghỉ.", "eng": "We can ill afford the time or money for a holiday."}, {"viet": "Chúng ta không thể thấy đường trong đêm tối như mực.", "eng": "We couldn't see over way in the pitch dark."}, {"viet": "Chúng tôi đã thuê một người ở địa phương để làm công việc bắt ống nước.", "eng": "We employed a local man to do the plumbing."}, {"viet": "Chúng tôi đã có dịp xem riêng các đồ kim hoàn trước khi đem ra bán đấu giá.", "eng": "We had a private view of the jewels before the public auction."}, {"viet": "Chúng tôi chẳng giải quyết được cái gì, ngoại trừ đồng ý tiếp tục thảo luận, mỗi người vẫn giữ ý kiến riêng của mình.", "eng": "We have accomplished nothing except that we agree to disagree."}, {"viet": "Chúng ta phải làm nhiều thứ để chăm sóc nó đúng cách.", "eng": "We have to do many things in order to take care of them properly."}, {"viet": "Lúc bé, chúng tôi có một cuộc sống khá sung sướng.", "eng": "We led a happy enough existence as children."}, {"viet": "Chúng ta phải điều chỉnh mức cung cho mức cầu hiện tại.", "eng": "We must adjust the supply to the current demand."}, {"viet": "Chúng ta phải làm việc cật lực mới hoàn thành đúng thời hạn.", "eng": "We must work like anything to finish on time."}, {"viet": "Chúng tôi cung cấp nước nóng suốt ngày đêm.", "eng": "We provide hot water around the clock."}, {"viet": "Chúng tôi sẽ chờ đợi một sự cải thiện công việc của anh trong nhiệm kỳ này.", "eng": "We shall be looking for an improvement in your work this term."}, {"viet": "Chúng tôi nói với anh, cho anh biết những điều phải lựa chọn.", "eng": "We talk to you, tell you the alternatives."}, {"viet": "Chúng ta mặc y phục cũng vì một lý do khác nữa, đó là làm đẹp.", "eng": "We wear clothing for another reason, too-for decoration."}, {"viet": "Chúng tôi bị đắm tàu lưu lạc trên một hòn đảo hoang.", "eng": "We were shipwrecked on a deserted island."}, {"viet": "Chúng tôi muốn đi tham quan New York.", "eng": "We would like to visit New York."}, {"viet": "Thôi, tôi nghĩ thảo luận như thế là đủ rồi.", "eng": "Well, I think that's all for now."}, {"viet": "Anh ta tái nhợt đi vì cái tin ấy tức giận, sợ, bị sốc, v. v. đến tái mặt.", "eng": "Went deathly pale at the news pale with anger, fear, shock, etc."}, {"viet": "Anh mặc cái bộ quần áo cũ này trông mới nhếch nhác làm sao!", "eng": "What a sight you look in those old clothes!"}, {"viet": "Những thay đổi gì đang chờ đợi chúng ta ở năm 2000 và những năm sau đó?", "eng": "What changes await us in the year 2000 and beyond?"}, {"viet": "Mặt cân, đồng hồ, máy đo, v. v. chỉ bao nhiêu?", "eng": "What does the scale, dial, gauge, etc read?"}, {"viet": "Cách điều trị một cách đúng đắn đối với người bị sốc là gì?", "eng": "What is the correct medical treatment for shock?"}, {"viet": "Bạn thích đọc loại sách nào?", "eng": "What kind of books do you like to read?"}, {"viet": "Giờ làm thủ tục trả phòng của khách sạn anh là mấy giờ?", "eng": "What's your check-out time?"}, {"viet": "Ông muốn uống gì, thưa ông Jones?", "eng": "What would you like to have, Mr. Jones?"}, {"viet": "Khi anh ta gãy chân thì không thể tiếp tục đi nghỉ được nữa.", "eng": "When he broke his leg it put the kybosh on his holiday."}, {"viet": "Vào đêm giao thừa, ông Green đến quán rượu.", "eng": "When it's the Eve of Spring Festival, Mr. Green comes to the bar."}, {"viet": "Khi bàn thứ ba được ghi vào lưới của chúng tôi thì chúng tôi biết không còn cứu vãn được trận đấu nữa.", "eng": "When the third goal was scored against us, we knew the match was past redemption."}, {"viet": "Bất cứ khi nào tôi nhìn nó, tôi cũng sẽ nhớ cháu.", "eng": "Whenever I look at it, I'll remember you."}, {"viet": "Tôi nên chuyển xe ở đâu để đến công viên Hyde?", "eng": "Where should I transfer to get to Hyde Park?"}, {"viet": "Anh muốn miếng nào?''Tôi muốn miếng to ấy'.", "eng": "Which piece would you like?''I'd like the bigger one'."}, {"viet": "Những nhân vật trông hung dữ ở hai bên ông ấy là ai vậy?", "eng": "Who are the tough-looking characters on either side of him?"}, {"viet": "Tại sao anh lại gọi điện vào đêm hôm khuya khoắt thế này thật là bất tiện?", "eng": "Why are you phoning at this ungodly hour of the night?"}, {"viet": "Tại sao chúng ta lại không đi chơi nhỉ?", "eng": "Why not go for an outing?"}, {"viet": "Anh có ra ga để tìm ông Hill không?", "eng": "Will you go to the station and look out for Mr Hill?"}, {"viet": "Nếu có vụ cháy thật, họ tắt còi báo động khi vụ cháy đã được dập tắt.", "eng": "With a real fire, they turn off the alarm when the fire is over."}, {"viet": "Những từ hình thức giống nhau nhưng khác nhau về ý nghĩa.", "eng": "Words akin in form but different in meaning."}, {"viet": "Em muốn dùng thịt gà hay thịt bò?", "eng": "Would you like chicken or beef?"}, {"viet": "Cô cảm phiền viết tên của nhà hàng lên mảnh giấy này được không?", "eng": "Would you mind writing down the name of the restaurant on this piece of paper?"}, {"viet": "Ừ, thật là một ý kiến hay khi chúng ta quyết định xếp hàng chờ.", "eng": "Yeah, it's a good idea we decided to wait in line."}, {"viet": "Phải, mỗi người có thể mang vào hai chai được miễn thuế.", "eng": "Yes, one can bring in two bottles duty-free."}, {"viet": "Anh sẽ cảm thấy khá hơn sau một tối ngủ ngon.", "eng": "You'll feel all the better for a good night's sleep."}, {"viet": "Anh sẽ thi trượt nếu không chịu khó học';'Đó là chuyện của tôi, không việc gì đến anh'.", "eng": "You're going to fail your exams if you don't work hard';'That's my funeral, not yours'."}, {"viet": "Trước đây anh cũng từng viết những bài luận tồi, nhưng bài này thì đúng là một điển hình tồi tệ nhất.", "eng": "You've written bad essays before, but this one is a shocker."}, {"viet": "Cô không được đi ra ngoài mà ăn mặc như vậy, thế cũng đủ làm cho bà của cô giá mà sống lại thì có thể sẽ nổi giận lên đấy!", "eng": "You can't go out dressed like that, it's enough to make your grandmother turn in her grave!"}, {"viet": "Anh khó lòng hy vọng tôi sẽ lại cho anh vay tiền nữa.", "eng": "You can hardly expect me to lend you money again."}, {"viet": "Anh có thể viết về văn học Mỹ bản địa.", "eng": "You could write about Native American literature."}, {"viet": "Xin ông nhận cho sự đồng cảm sâu sắc nhất của tôi về cái chết của vợ ông.", "eng": "You have my deepest sympathies on the death of your wife."}, {"viet": "Bạn sẽ nắm được cách chơi.", "eng": "You'll get the hang of it."}, {"viet": "Anh phải hết sức thận trọng khi đi qua con đường này.", "eng": "You must exercise extreme caution what crossing this road."}, {"viet": "Anh cần phải giữ bình tĩnh khi giao thiệp với một người như thế.", "eng": "You need to keep your wits about you when you're dealing with a man like that."}, {"viet": "Anh nên đi bây giờ, nếu không anh sẽ lỡ xe buýt.", "eng": "You should go now, otherwise you'll miss the bus."}, {"viet": "Bạn cố lừa ai đó nghĩ rằng họ thấy cái gì đó không thật sự có ở đó.", "eng": "You try to trick someone into thinking they see something that isn't really there."}, {"viet": "Anh nên cẩn thận xem xét lại quyết định của mình.", "eng": "You would be well advised to reconsider your decision."}, {"viet": "Sáng kiến của anh thật tài tình nhưng không thiết thực lắm.", "eng": "Your inventions is ingenious, but not very practical."}]