[{"viet": "Một chiếc cầu lớn phải được thiết kế rất cẩn thận.", "eng": "A big bridge has to be planned very carefully."}, {"viet": "Một nhân vật xuất hiện trong nhiều cuốn tiểu thuyết của bà ta.", "eng": "A character that figures in many of her novels."}, {"viet": "Một cuộc nghiên cứu bao quát nền âm nhạc hiện đại.", "eng": "A comprehensive survey of modern music."}, {"viet": "Một cụm mây đen có thể không biến mất sau cơn hoặc cơn tuyết.", "eng": "A dark clouds may not disappear after rain or snow has fallen from it."}, {"viet": "Một con chó chảy nước dãi khi nó nhìn thấy một cái xương.", "eng": "A dog salivates when it sees a bone."}, {"viet": "Một cánh đồng lúa mì gợn sóng trong làn gió nhẹ.", "eng": "A field of wheat undulating in the breeze."}, {"viet": "Một người nhiệt tình và hăng say.", "eng": "A full-blooded and passionate person."}, {"viet": "Một cú đập bóng ngoạn mục.", "eng": "A graceful stroke with the bat."}, {"viet": "Một hàng rào cao bảo vệ khỏi những kẻ xâm nhập.", "eng": "A high fence that safeguard against intruders."}, {"viet": "Một cuộc hành trình đến Nam cực.", "eng": "A journey to the South Pole."}, {"viet": "Một thái độ phóng khoáng đối với việc ly dị và tái giá.", "eng": "A liberal attitude to divorce and remarriage."}, {"viet": "Một cuộc nói chuyện ở trình độ thấp đã không gây thích thú cho tôi.", "eng": "A low level of conversation that failed to stimulate me."}, {"viet": "Một giai điệu với nhịp điệu nhẹ nhàng, trong sáng.", "eng": "A melody with a light tripping rhythm."}, {"viet": "Một quốc gia giàu lên nhờ lợi nhuận từ ngành du lịch.", "eng": "A nation enriched by the profits from tourism."}, {"viet": "Một vở kịch một màn do các em thiếu nhi diễn.", "eng": "A one-act drama enacted by children."}, {"viet": "Một người bỗng nhiên lại đi ăn cắp thì có thể cần điều trị về bệnh tâm thần.", "eng": "A person who suddenly begins to steal may be in need of psychiatric treatment."}, {"viet": "Một chính khách rất tham quyền lực.", "eng": "A politician who is insatiable for power."}, {"viet": "Một quán rượu cố gắng tái tạo hương vị của nước Anh xưa.", "eng": "A pub that tries to recreate the flavour of Olde England."}, {"viet": "Không nên làm cho người về hưu cảm thấy mình bị xếp xó.", "eng": "A retired person should not be made to feel he's on the shelf."}, {"viet": "Một ngôi trường có khu trung chuyển lớn.", "eng": "A school with a large catchment area."}, {"viet": "Một sự khan hiếm đất xây dựng sẽ đẩy giá bất động sản lên liên tục.", "eng": "A shortage of building land will push property values up."}, {"viet": "Người lính thường phải đương đầu với nguy hiểm.", "eng": "A soldier often has to confront danger."}, {"viet": "Một câu chuyện nêu rõ một bài học luân lý.", "eng": "A story that points a moral."}, {"viet": "Một máy thu băng giấu trong ngăn kéo.", "eng": "A tape recorder concealed in a drawer."}, {"viet": "Một cối xay guồng chạy bằng sức người hơn là bằng sức nước.", "eng": "A treadmill driven by manpower rather than water-power."}, {"viet": "Mặt trời úa chiếu qua đám mây mưa.", "eng": "A watery sun shone through the rain-clouds."}, {"viet": "Hai đường thẳng AB và CD cắt nhau tại điểm P.", "eng": "AB and CD intersect at the point P."}, {"viet": "Thật ra thì chúng tôi cũng có quan điểm tương tự về việc đó.", "eng": "Actually, we have similar views on it."}, {"viet": "Sau một thời gian nó đi vào một cơ quan khác trong cơ thể người mẹ gọi là tử cung.", "eng": "After a while it enters another organ in the mother's body called the uterus."}, {"viet": "Sau hơn hai mươi năm đóng vai đó, cuối cùng cô ấy đã được rút ra khỏi loạt kịch đó.", "eng": "After playing the part for over for 20 years, she was eventually written out of the series."}, {"viet": "Sau chiến tranh thế giới thứ nhất phe Đồng Minh toan tính tước đoạt cơ sở hạ tầng và tiềm năng công nghiệp của nước Đức.", "eng": "After World War I the Allies attempted to deindustrialize Germany."}, {"viet": "Rối rít trước buổi trình diễn khai mạc.", "eng": "All hot and bothered before the opening performance."}, {"viet": "Tất cả các chất liệu để làm bánh táo.", "eng": "All the makings for an apple pie."}, {"viet": "Mặc dù thi trượt cô ta vẫn còn đủ điều kiện để chờ đợi.", "eng": "Although she failed the exam she has time on her side, she'll still be young enough to take it in her next year."}, {"viet": "Một sự thú nhận là mình nói láo.", "eng": "An admission that one has lied."}, {"viet": "Một cuộc tổng tuyển cử sớm chắc chắn có thể diễn ra.", "eng": "An early general election is certainly on the cards."}, {"viet": "Một chiến thắng không ngờ trong những điều kiện rất bất lợi.", "eng": "An inconceivable victory against all odds."}, {"viet": "Một cửa sổ mở là sự khuyến khích tội ác.", "eng": "An open window is an invitation to crime."}, {"viet": "Và làm cho chảy ra những giọt máu lớn.", "eng": "And makes it bleed great gouts of blood."}, {"viet": "Lại thêm một vụ làm ăn có đặc quyền đặc lợi dựa vào thế lực chính trị.", "eng": "Another sweetheart deal based on political influence."}, {"viet": "Có phải trẻ con vẫn luôn phá phách như thế không?", "eng": "Are all small children so destructive?"}, {"viet": "Bạn có quan tâm đến chính trị thế giới không?", "eng": "Are you concerned with world politics?"}, {"viet": "Bạn định bảo tôi rằng bạn đã xem một bộ phim khiêu dâm?", "eng": "Are you trying to tell me that you saw pornographic film?"}, {"viet": "Là một diễn viên, hắn bị đánh giá rất thấp.", "eng": "As an actor, he's seriously underrated."}, {"viet": "Do tiền lương thấp có ít người xin việc đó.", "eng": "As the wages were low, there were few applicants for the job."}, {"viet": "Theo sự xúi bẩy của ông ta chúng tôi đã che dấu chính quyền các sự kiện.", "eng": "At his instigation we concealed the facts from the authorities."}, {"viet": "Chú ý vào công việc của bạn và đừng nói chuyện nữa.", "eng": "Attend to your work and stop talking."}, {"viet": "Được vào xem triển lãm miễn phí.", "eng": "Be admitted to the exhibition gratis."}, {"viet": "Sẵn sàng nhận những hậu quả về hành động của mình.", "eng": "Be ready to take the consequences of one's action."}, {"viet": "Xử sự với phẩm cách phù hợp với địa vị của ông ấy.", "eng": "Behaving with a dignity consonant with his rank."}, {"viet": "Các con chim lượn vòng trong bầu trời trên đầu chúng tôi.", "eng": "Birds wheeling about in the sky above us."}, {"viet": "Nuôi một loại gia súc có thể sống được khi hạn hán.", "eng": "Breed a race of cattle that can survive drought."}, {"viet": "Các từ Bus conductor, dark haired và policeman là những từ ghép.", "eng": "Bus conductor, dark haired and policeman are compounds."}, {"viet": "Nhưng bây giờ nghĩ tới đồ ăn là tôi thấy bệnh.", "eng": "But just the thought of food now makes me feel sick."}, {"viet": "Mua nhiều vé số để tăng thêm cơ may trúng giải.", "eng": "Buy lots of raffle tickets and multiply your chances of success."}, {"viet": "Nhờ xem tivi, chúng ta có thể hiểu nhiều hơn về lịch sử, nghệ thuật, âm nhạc, văn học, những phát hiện của khoa học hiện đại, … của Mỹ.", "eng": "By watching TV we can have a better understanding of American history, art, music, literature, the discoveries of modern science, etc."}, {"viet": "Tôi có thể đặt món ăn qua điện thoại được không?", "eng": "Can I place an order over the phone?"}, {"viet": "Bạn có thể xong công việc trước năm giờ?", "eng": "Can you finish the work by five o'clock?"}, {"viet": "Anh có thể chỉ cho tôi xem nó đau ở đâu không?", "eng": "Can you show me where it hurts?"}, {"viet": "Bị đẩy về phía trước vì một đám người hỗn độn ùa lên.", "eng": "Carried forward by the welter of surging bodies."}, {"viet": "Cờ, cờ đam và tài xỉu là những môn cờ bàn.", "eng": "Chess, draughts and ludo are board games."}, {"viet": "Sự diễn đạt mạch lạc là điều thiết yếu đối với một diễn giả trước công chúng.", "eng": "Clarity of diction is vital for a public speaker."}, {"viet": "Nào, tiếp tục việc đó đi, em làm gần xong rồi đó!", "eng": "Come on, keep at it, you've nearly finished!"}, {"viet": "Tuân theo các tiêu chuẩn của xã hội.", "eng": "Conform to the standards of society."}, {"viet": "Cho phép tôi nói thêm một điều ở điểm này được không?", "eng": "Could I put in a word at this point?"}, {"viet": "Ông có thể cho tôi xem danh mục liệt kê hoặc tờ rơi quảng cáo được không?", "eng": "Could you show the catalogs or pamphlets?"}, {"viet": "Các nhân viên hải quan đã bắt giữ số ma túy có giá lậu tới trên 1 triệu bảng Anh.", "eng": "Customs officers have seized drugs, with street value of over 1 million."}, {"viet": "Những rãnh sâu ăn mòn đá xốp.", "eng": "Deep grooves channeled the soft rock."}, {"viet": "Mặc dù có nguy cơ chiến tranh, mọi người vẫn tiếp tục công việc của mình như thường lệ.", "eng": "Despite the threat of war, people went about their work as usual."}, {"viet": "Tối qua anh có nghe thấy ồn ào ở nhà bên cạnh không?", "eng": "Did you hear the carryings-on next door last night?"}, {"viet": "Phanh ra sự thật từ một lô những lời dối trá.", "eng": "Disentangle the truth from a mass of lies."}, {"viet": "Đừng có huyên thuyên về thời tiết trong khi tôi cố đọc sách.", "eng": "Do stop chattering on about weather when I'm trying to read."}, {"viet": "Có bao giờ anh mơ ước mình giàu có hay chưa?", "eng": "Do you ever wish you were rich?"}, {"viet": "Bạn có số điện thoại của anh ấy ở ngay bên cạnh không?", "eng": "Do you have his number handy?"}, {"viet": "Anh có thích công việc của mình không?", "eng": "Do you like what you do?"}, {"viet": "Cô nghĩ tôi hút thuốc có được không?", "eng": "Do you think I could have a cigarette?"}, {"viet": "Anh có xem vở kịch nhiều tập nào trên tivi không?", "eng": "Do you watch any of the soaps on TV?"}, {"viet": "Chó có khứu giác rất thính.", "eng": "Dogs have an acute sense of smell."}, {"viet": "Đừng uống hết nhẵn rượu; để phần cho tôi một ít nhé!", "eng": "Don't drink all the wine; save some for me!"}, {"viet": "Đừng cho con của bà nghịch diêm.", "eng": "Don't let your child play with matches."}, {"viet": "Đừng nhận công việc vượt khả năng của bạn.", "eng": "Don't take on more than you can cope with."}, {"viet": "Tăng gấp đôi toán lính canh trong trường hợp cấp bách.", "eng": "Double the guard in an emergency."}, {"viet": "Suốt thời kỳ tại vị của Đức Giáo hoàng John Paul đệ nhị.", "eng": "During the papacy of John Paul II."}, {"viet": "Mướn một đội ngũ đông người giúp việc trong nhà.", "eng": "Employ a large staff of servants."}, {"viet": "Dù phải cuốc bộ suốt quãng đường tôi cũng sẽ đến đó.", "eng": "Even if I have to walk all the way I'll get there."}, {"viet": "Mọi thứ dường như đều hợp lệ.", "eng": "Everything seems to be in order."}, {"viet": "Các chuyên gia định giá bức tranh đó rất cao.", "eng": "Experts set a high valuation on the painting."}, {"viet": "Các thời trang đã lỗi thời.", "eng": "Fashions that have fallen into desuetude."}, {"viet": "Vô cùng tức giận vì kiểu nó bị lừa.", "eng": "Filled with anger at the way he had been tricked."}, {"viet": "Những sợi vân đỏ trong đá cẩm thạch.", "eng": "Five threads of red in the marble."}, {"viet": "Là một người Anh mà anh ta nói tiếng Pháp khá hay.", "eng": "For an Englishman he speaks French rather well."}, {"viet": "Bốn người hầu bàn phục vụ bữa trưa cho chúng tôi.", "eng": "Four waiters served lunch to us."}, {"viet": "Cờ bạc bị một số chức sắc giáo hội lên án.", "eng": "Gambling is frowned upon by some church authorities."}, {"viet": "Kiếm được 100 đô la trong một giờ đồng hồ, đó không phải là số tiền nhỏ nhoi.", "eng": "Gets $ 100 an hour, which isn't hay."}, {"viet": "Diễn đạt quan điểm của ai.", "eng": "Give utterance to one's views."}, {"viet": "Sức khoẻ tốt là một phẩm chất rất quí giá.", "eng": "Good health is a great asset."}, {"viet": "Đành phải chịu nhận một khoản tiền công thấp hơn số tiền yêu cầu.", "eng": "Had to settle for a lower wage than the one requested."}, {"viet": "Cho đại tu động cơ của một chiếc xe ôtô.", "eng": "Have the engine of a car overhauled."}, {"viet": "Bạn có bao giờ đọc tác phẩm nào của Shakespeare chưa?", "eng": "Have you ever read any Shakespeare?"}, {"viet": "Cậu có thấy hắn chạy ào ào quanh thành phố trên chiếc môtô mới không?", "eng": "Have you seen him zapping around town on his new motor bike?"}, {"viet": "Nó hơi chậm nhưng cuối cùng nó cũng hiểu được ý.", "eng": "He's a bit slow but in the end he latches onto."}, {"viet": "Anh ta cứ cố tránh xa tôi như tránh bệnh dịch hạch từ khi chúng tôi xích mích với nhau.", "eng": "He's been avoiding me like the plague since our quarrel."}, {"viet": "Ông ta bị một cơn đau tim nặng, tôi e rằng tình trạng của ông có vẻ xấu.", "eng": "He's had a severe heart attack, things are looking bad for him, I'm afraid."}, {"viet": "Anh ấy đang đúc khuân xi măng.", "eng": "He's putting up the forms for the cement."}, {"viet": "Ông ấy đã viết một số sách về Ấn Độ.", "eng": "He's written several books about India."}, {"viet": "Anh ta đổ cho sự thất bại của anh ta là do vận rủi.", "eng": "He ascribed his failure to bad luck."}, {"viet": "Nó đút lót để đi qua mặt lính gác và trốn thoát.", "eng": "He bribed his way past the guard and escaped."}, {"viet": "Nó nín thở vì ngạc nhiên.", "eng": "He caught his breath in surprise."}, {"viet": "Hắn không thể biết là cô ấy đang cười hay đang khóc.", "eng": "He couldn't tell if she was laughing or crying."}, {"viet": "Anh ta không nhận ra rằng mình đã làm một điều quá lỡ lầm.", "eng": "He didn't realize what a gaffe he'd made."}, {"viet": "Ông ấy sống bằng nghề viết lách.", "eng": "He earns his living by writing."}, {"viet": "Ông ta cảm thấy bị xúc phạm vô cùng bởi tính thô lỗ của cô ta.", "eng": "He felt deeply affronted at her rudeness."}, {"viet": "Nó đưa tay cho bà ấy nắm khi họ băng qua đường.", "eng": "He gave her his arm as they crossed the road."}, {"viet": "Anh ta được việc đó bởi vì anh ta đã tỏ ra có tinh thần mạnh dạn dám làm.", "eng": "He got the job because he showed the spirit of enterprise."}, {"viet": "Nó đã cả gan gọi tôi là tên nói láo.", "eng": "He had the temerity to call me a liar."}, {"viet": "Anh ấy có một loại đầu óc khác thường.", "eng": "He has an unusual cast of mind."}, {"viet": "Anh ấy có giọng nói lạ lùng đến nỗi khó mà nhịn được cười khi nghe anh ấy nói chuyện.", "eng": "He has such a strange voice that it's difficult to keep a straight face when he's talking."}, {"viet": "Anh ta được thừa kế một trang viên và tất cả những quyền lợi của nó.", "eng": "He inherited the manor and all its appurtenances."}, {"viet": "Nó là em họ của tôi hay đúng hơn là em họ của cha tôi.", "eng": "He is my cousin-or rather my father's cousin."}, {"viet": "Fred này, Bill nói không dễ thương lắm nhỉ?", "eng": "He isn't very nice, is he, Fred?"}, {"viet": "Nó thôi học năm 16 tuổi.", "eng": "He left school at the age of 16."}, {"viet": "Anh ta mất nhiều máu trong tai nạn đó.", "eng": "He lost a lot of blood in the accident."}, {"viet": "Có thể hắn sẽ tới mang theo tiền.", "eng": "He might turn up with the cash."}, {"viet": "Anh ấy đã quyết định đi Pari hơn là Luân Đôn.", "eng": "He opted to go to Paris rather than London."}, {"viet": "Ông ta khen ngợi công việc của tôi và liền ngay đó bảo tôi là phải thôi việc.", "eng": "He praised my work and in the same breath told me I would have to leave."}, {"viet": "Ông ta đặt hạnh phúc của con cái lên trên tất cả mọi mối quan tâm khác.", "eng": "He puts his children's welfare before all other considerations."}, {"viet": "Nó không chịu hoà giải với anh nó.", "eng": "He refused to reconcile with his brother."}, {"viet": "Gã chẳng có kinh nghiệm gì về các vấn đề tài chánh.", "eng": "He's a child in financial matters."}, {"viet": "Ông ấy ngã bệnh đã lâu.", "eng": "He's been ill for a long time."}, {"viet": "Anh ta cũng khá dễ ưa, nhưng hơi tẻ nhạt một tí.", "eng": "He's likable enough, but a bit boring."}, {"viet": "Anh ấy là người tôi muốn nói chuyện đấy.", "eng": "He's the one that I want to talk to."}, {"viet": "Anh ấy thấy một vài cảnh tượng lạ lùng trong vườn bách thú.", "eng": "He saw some amazing sights at the zoo."}, {"viet": "Hắn lắc cô ấy dữ dội như con chó lắc con chuột vậy.", "eng": "He shook her violently as a dog shakes a rat."}, {"viet": "Anh ta thu xếp mọi việc cốt để làm cho hợp với tất cả mọi người.", "eng": "He so arranged matters as to suit everyone."}, {"viet": "Anh ta nhảy bắn lên khỏi chỗ ngồi.", "eng": "He started up from his seat."}, {"viet": "Anh ta bị chấn thương sọ não nặng trong vụ đâm xe.", "eng": "He suffered severe brain damage in the crash."}, {"viet": "Nó hất đầu ra sau và cười ha hả.", "eng": "He threw back his head and roared with laughter."}, {"viet": "Anh ấy đã đổi xe cũ của anh ấy lấy một chiếc đời mới.", "eng": "He traded his old car in for a new model."}, {"viet": "Ông ta hứa hoàn thành công việc trước thứ Sáu.", "eng": "He undertook to finish the job by Friday."}, {"viet": "Anh ấy đã lưu ý tôi không được đến chậm Cái khó là không được cười to.", "eng": "He warned me not to be late The difficulty was in not laughing out loud."}, {"viet": "Đấm thình thình vào cánh cửa.", "eng": "He was banging on the door with his fist."}, {"viet": "Ông ta bị xúc phạm nặng vì sự phản bội của chúng.", "eng": "He was deeply wounded by their disloyalty."}, {"viet": "Anh ta bị đưa ra toà vì vượt quá tốc độ giới hạn.", "eng": "He was had up for exceeding the speed limit."}, {"viet": "Anh ta không hề quan tâm một chút nào.", "eng": "He was not in the slightest degree interested."}, {"viet": "Hắn ta bị phạt tù mười năm vì tội ăn cướp có vũ trang.", "eng": "He was sent down for ten years for armed robbery."}, {"viet": "Anh ta bị đẩy vào một chức vụ có trách nhiệm kinh khủng.", "eng": "He was thrust into a position of awesome responsibility."}, {"viet": "Cậu ta mặt đỏ ửng như gấc khi tôi hỏi về người bạn gái của cậu ấy.", "eng": "He went as red as a beetroot when I asked about his new girl-friend."}, {"viet": "Nó không biết đâu, nó mù tịt về toán.", "eng": "He won't know, he's a dead loss at maths."}, {"viet": "Đầu đề được viết bằng chữ in lớn.", "eng": "Headlines are written in large print."}, {"viet": "Tham vọng của cô ấy là trở thành một ca sĩ nổi tiếng.", "eng": "Her ambition was to be a famous singer."}, {"viet": "Tất cả con cái cô ta đều thông minh.", "eng": "Her children are all very brainy."}, {"viet": "Nhiệt tình của nàng đối với chuyến thám hiểm giảm xuống nhanh chóng.", "eng": "Her enthusiasm for the expedition was waning rapidly."}, {"viet": "Tóc cô ta xoã xuống tới ngang lưng.", "eng": "Her hair hung down her back to her waist."}, {"viet": "Lòng tốt của nàng đã khiến anh ta có một tình yêu mới đối với nàng.", "eng": "Her kindness made him regard her with renewed affection."}, {"viet": "Quyển sách mới của bà ta thật là một món hái ra tiền.", "eng": "Her new book is a real money-spinner."}, {"viet": "Tôi dám chắc sự thăng chức của cô ta là do sự sắp xếp gian lận.", "eng": "Her promotion was a fix, I'm sure."}, {"viet": "Thằng con trai của bà ấy đúng là một thằng nhóc tinh nghịch.", "eng": "Her son is a right little horror."}, {"viet": "Giọng nàng the thé nhưng dẫu sao cũng khá hấp dẫn.", "eng": "Her voice was rough but had an appealing quality withal."}, {"viet": "Những người ẩn cư sống trong rừng tập yoga.", "eng": "Hermits living in the forest practice yoga."}, {"viet": "Việc ông ấy đến thủ đô đã chấm dứt tin đồn là ông đã chết.", "eng": "His arrival in the capital scotched reports that he was dead."}, {"viet": "Trường hợp của anh ta không khác những trường hợp trước đây chút nào.", "eng": "His case isn't any different from the previous ones."}, {"viet": "Sự mô tả của anh ấy quá chung chung đến mức không có nhiều tác dụng.", "eng": "His description was too general to be of much use."}, {"viet": "Mặt nó sưng lên vì răng đau.", "eng": "His face was swollen with toothache."}, {"viet": "Bàn tay anh ta đã bị cưa lìa khỏi cánh tay.", "eng": "His hand was severed from his arm."}, {"viet": "Kiến thức âm nhạc của anh ta có ích cho anh ta khi anh ta tham gia dàn đồng ca của trường.", "eng": "His knowledge of music stood him in good stead when he joined the school choir."}, {"viet": "Mẹ cậu ấy cứ liên tục giục giã cậu ấy đi hớt tóc.", "eng": "His mother kept on chivvying him to get his hair cut."}, {"viet": "Cuộc sống riêng tư của anh ta là một bí ẩn đối với các đồng nghiệp của anh ta.", "eng": "His personal life is a mystery to his colleagues."}, {"viet": "Việc ông ta từ chức đặt ra vấn đề là giờ đây liệu chúng ta cần có một phó thủ trưởng không.", "eng": "His resignation poses the question of whether we now need a deputy leader."}, {"viet": "Thần kinh căng thẳng của anh ta khiến anh ta khó lòng thư giãn được.", "eng": "His strung nerves made it difficult for him to relax."}, {"viet": "Giọng anh ta run run vì xúc động khi anh ấy báo tin đó.", "eng": "His voice shook with emotion as he announced the news."}, {"viet": "Xin cầm máy để tôi xem có tìm được giám đốc không.", "eng": "Hold the line, I'll see if I can find the manager."}, {"viet": "Giá nhà có thể bắt đầu tuột xuống.", "eng": "House values may begin to slide."}, {"viet": "Sao anh lại có thể mặt dạn mày dày mà xin thêm tiền khi anh làm việc ít đến thế?", "eng": "How can you have the face to ask for more money when you do so little work?"}, {"viet": "Làm sao mà anh lại đến quá muộn vậy?", "eng": "How do you come to be so late?"}, {"viet": "Ông sẽ lưu lại đây bao lâu?", "eng": "How long are you staying here?"}, {"viet": "Các ông có bao nhiêu đơn vị cho đồng nhân dân tệ?", "eng": "How many denominations do you have for yuan?"}, {"viet": "Chiếc ô tô cũ của anh được bao nhiêu?'.", "eng": "How much did you get for your old car?'."}, {"viet": "Trời đất, anh kiếm được những cái vé này ở đâu vậy?", "eng": "How on earth did you come by these tickets?"}, {"viet": "Cơn bão để lại một vệt tàn phá phía sau nó.", "eng": "Hurricane left a trail of destruction behind it."}, {"viet": "Tôi muốn làm cái bánh cho sinh nhật con gái tôi.", "eng": "I'd like to make it for my daughter's birthday."}, {"viet": "Tôi sẽ đến văn phòng của anh vào sáng thứ tư lúc 9 giờ 30.", "eng": "I'll come over to your office Wednesday morning at 9: 30."}, {"viet": "Tao sẽ làm cho hắn phải trả giá về sự hỗn láo của hắn!", "eng": "I'll make him pay for his insolence!"}, {"viet": "Tôi là một người thực tế, tôi biết anh chẳng thể thay đổi thái độ của con người trong chốc lát.", "eng": "I'm a realist-I know you can't change people's attitudes overnight."}, {"viet": "Năm nay tôi học các lớp tiếng Pháp tối.", "eng": "I'm doing French evening classes this year."}, {"viet": "Bây giờ tôi sẽ để các ông tiếp xúc với phóng viên về các vấn đề trong nước của chúng tôi.", "eng": "I'm handing you over now to our home affairs correspondent."}, {"viet": "Tôi không nghĩ đến việc mua một chiếc xe ô tô to lớn, đắt tiền.", "eng": "I'm not in the market for a big, expensive car."}, {"viet": "Xin lỗi, tôi không hiểu tiếng Anh rõ lắm.", "eng": "I'm sorry, I don't understand English very we."}, {"viet": "Tôi nói cho anh nghe điều này với tính cách bí mật-vậy đừng để lộ ra nhé.", "eng": "I'm telling you this in confidence-so don't breathe a word of it."}, {"viet": "Tôi bị kết tội là đã dùng những phương pháp bất hảo để có được cái gì tôi muốn.", "eng": "I've been accused of using disreputable methods to get what I want."}, {"viet": "Tôi đã quên mọi thứ tôi học ở trường.", "eng": "I've forgotten everything I learnt at school."}, {"viet": "Tôi bỏ quên ví ở nhà rồi Tôi e rằng nếu vậy thì thật vô phương cứu chữa!", "eng": "I've left my purse at home That's just too bad, I'm afraid!"}, {"viet": "Tôi đã thử tất cả mọi người khác rồi và bây giờ anh là người cuối cùng.", "eng": "I've tried everyone else and now you're my last resort."}, {"viet": "Tôi lúc nào cũng thích uống trà nóng.", "eng": "I always like my tea hot."}, {"viet": "Tôi phó thác cho số phận.", "eng": "I am resigned to my fate."}, {"viet": "Tối qua tôi ăn quá nhiều và nôn ra.", "eng": "I ate too much last night and threw up."}, {"viet": "Tôi đã gọi điện thoại cho cô ta nhưng cô ta không trả lời.", "eng": "I called her but she didn't answer."}, {"viet": "Tôi không hề nghĩ rằng lại có thể sống ở đâu đó ngoài nước Anh.", "eng": "I can't imagine living anywhere but England."}, {"viet": "Ngày mai, tôi có thể quay trở lại, không có điều gì phiền phức cả.", "eng": "I can come back tomorrow, it's no trouble."}, {"viet": "Trong trường hợp của anh, tôi không thể áp dụng ngoại lệ được.", "eng": "I cannot make an exception in your case."}, {"viet": "Tôi thu thập tem trên khắp thế giới.", "eng": "I collect stamps from all over the world."}, {"viet": "Tôi cười quá nói không được.", "eng": "I couldn't speak for laughing."}, {"viet": "Tôi quyết định coi lời nhận xét của hắn như câu nói đùa.", "eng": "I decided to treat his remark as a joke."}, {"viet": "Tôi đã nói đi nói lại rằng hắn phải điều hành công việc một cách khác.", "eng": "I dinned it into him that he had to manage things differently."}, {"viet": "Tôi không biết rõ chỗ ấy lắm, tôi chỉ đến đó có một đôi lần.", "eng": "I don't know the place well, I've only been there once or twice."}, {"viet": "Tôi không nghĩ rằng những giọt nước mắt của cô ta là thật.", "eng": "I don't think her tears were for real."}, {"viet": "Tôi không muốn nói mãi mãi về vấn đề này.", "eng": "I don't want to talk about this problem ad infinitum."}, {"viet": "Tôi không cần ăn tối, cảm ơn.", "eng": "I don't want any dinner, thank you."}, {"viet": "Tôi thấy buộc lòng phải viết và phàn nàn bằng những lời mạnh mẽ nhất có thể có.", "eng": "I feel constrained to write and complain in the strongest possible terms."}, {"viet": "Tôi cảm thấy nàng rất xa cách và không thân thiện.", "eng": "I find her very aloof and unfriendly."}, {"viet": "Cuộc đua xe làm tôi rất hồi hộp.", "eng": "I get a big kick from motor racing."}, {"viet": "Tôi đoán được chuyện gì đang xảy ra từ những lời nàng đã nói.", "eng": "I guessed what was happening from a few words she let fall."}, {"viet": "Tôi phải giải thích vấn đề cho cô ta mấy lần cô ta mới hiểu ra.", "eng": "I had to explain the problem to her several times before the penny finally dropped."}, {"viet": "Tôi có cảm giác nghi ngờ là anh ta không nói sự thật.", "eng": "I have a suspicion that he's not telling the truth."}, {"viet": "Tôi không hề có ý định đến cái nơi khủng khiếp này một lần nữa!", "eng": "I have no intention of coming to this terrible place again!"}, {"viet": "Tôi đã đối xử với anh không tốt-liệu tôi có thể chuộc lỗi ( về điều đó ) như thế nào?", "eng": "I have treated you unkindly-how can I atone ( for it )?"}, {"viet": "Tôi nghe nói Peter Brown làm ăn phát đạt lắm.", "eng": "I hear Peter Brown's doing very well."}, {"viet": "Tôi hy vọng thời tiết khô ráo để chúng ta đi picnic.", "eng": "I hope it stays dry for our picnic."}, {"viet": "Sáng nào tôi cũng chạy bộ 30 phút rồi sau đó tôi tập tạ vào buổi chiều.", "eng": "I jog thirty minutes every morning and then I lift weights in the afternoon."}, {"viet": "Tôi biết có chỗ anh có thể ăn món ăn Nhật Bản.", "eng": "I know somewhere where you can eat Japanese food."}, {"viet": "Tôi thích quần vợt nhất, sau đó là bơi.", "eng": "I like tennis best of all and swimming next."}, {"viet": "Tôi sẽ kiểm tra … ông nói đúng.", "eng": "I'll check it you're right."}, {"viet": "Hẹn gặp bạn vào thứ sáu.", "eng": "I'll see you on Friday."}, {"viet": "Hôm nay chị cứ lóng ngóng làm sao ấy.", "eng": "I'm all fingers and thumbs today."}, {"viet": "Tôi quá vui sướng về công việc làm mới của tôi.", "eng": "I'm in raptures about my new job."}, {"viet": "Tôi xin lỗi, tôi đã nhận định sai về các động cơ của anh.", "eng": "I'm sorry, I misjudged your motives."}, {"viet": "Tôi nói ngọt thuyết phục cô ấy lái xe đưa tôi về nhà.", "eng": "I managed to sweet-talk her into driving me home."}, {"viet": "Tôi phải giữ một ít nhân dân tệ vì tôi có thể sử dụng chúng ở sân bay.", "eng": "I must keep some yuan for I may use them at the airport."}, {"viet": "Tôi không bao giờ mơ rằng tôi sẽ gặp lại được anh.", "eng": "I never dreamt that I'd see you again."}, {"viet": "Tôi nợ John 10 pao vì anh ấy trả tiền vé cho tôi.", "eng": "I owed John £ 10 because he paid for me my ticket."}, {"viet": "Tôi vắt óc hàng giờ cố gắng nhớ tên cô ta.", "eng": "I racked my brain for hours trying to recall her name."}, {"viet": "Tôi không bằng lòng để cho một bọn người thiếu kinh nghiệm mắc dây điện cho tôi.", "eng": "I refuse to have the electric wiring done by a bunch of amateurs."}, {"viet": "Tôi nhìn thấy nó gần quảng trường sáng nay.", "eng": "I saw him around the place this morning."}, {"viet": "Tôi phải xin phép ông chủ của tôi đã.", "eng": "I shall have to ask permission from my governor."}, {"viet": "Tôi làm quần quật trong bếp suốt ngày.", "eng": "I spend all day slaving in the kitchen."}, {"viet": "Tôi sợ toát mồ hôi mất một lúc, nghĩ rằng tôi đã đánh vỡ cái ti vi.", "eng": "I sweated blood for a while thinking I'd broken the TV."}, {"viet": "Tôi nghĩ tôi thích một căn hộ lớn hơn.", "eng": "I think I would prefer something larger."}, {"viet": "Tôi nghĩ chúng ta nên thử cô ấy về công việc đó.", "eng": "I think we should try her for the job."}, {"viet": "Tôi kiện bà ta để lấy lại được tiền nợ.", "eng": "I took her to court for repayment of the debt."}, {"viet": "Tôi biết anh sẽ nói rằng anh ta sẽ hợp tác.", "eng": "I understood him to say that he would co-operate."}, {"viet": "Tôi cần một ít vòng bằng chất dẻo cho rèm phòng tắm.", "eng": "I want some plastic curtain rings for the shower curtain."}, {"viet": "Tôi muốn anh có mặt ở đây lúc hai giờ, bằng bất cứ giá nào.", "eng": "I want you here by two o'clock without fail."}, {"viet": "Tôi sững sờ sao cô ta lại có thể nói một điều như vậy.", "eng": "I was dumbfounded that she could say such a thing."}, {"viet": "Anh chỉ định đi mua một tờ báo.", "eng": "I was only going to get a newspaper."}, {"viet": "Người ta bảo tôi nếu công việc của tôi không tiến bộ, tôi sẽ mất việc.", "eng": "I was told that unless my work improves I would lose the job."}, {"viet": "Tôi sẽ lái xe đưa anh đi bất cứ đâu anh muốn.", "eng": "I will drive you wherever you want to go."}, {"viet": "Bây giờ tôi sẽ không bàn luận đến các chi tiết vụn vặt của hợp đồng.", "eng": "I won't discuss the minutiae of the contract now."}, {"viet": "Tôi muốn yêu cầu ông hợp tác với chúng tôi trong công tác này.", "eng": "I would ask you to collaborate with us in this work."}, {"viet": "Tôi muốn nói chuyện với một tiếp viên hàng không người Trung Quốc.", "eng": "I would like to speak with a Chinese flight attendant."}, {"viet": "Nói một cách lý tưởng, mọi người đều được dành cho những cơ hội như nhau.", "eng": "Ideally, everyone would be given equal opportunities."}, {"viet": "Nếu tôi không được tăng lương tôi sẽ thôi việc.", "eng": "If I don't get a pay rise I'll quit."}, {"viet": "Nếu như vậy thì các đỉnh núi lửa cũ này đã bị gió và nước xói mòn.", "eng": "If so, the tops of these old volcanoes have been worn away by wind and water."}, {"viet": "Nếu chúng ta quyết định mua túp nhà lá ấy, chúng ta sẽ phải xây mới lại.", "eng": "If we decide to buy the cottage we'll have to do it up."}, {"viet": "Nếu các ông có thể cho chúng tôi mức chiết khấu 5%, chúng tôi dự tính đặt 1000 tá cho những sản phẩm này.", "eng": "If you can give us a 5% discount, we have in mind an order for 1,000 dozen of these products."}, {"viet": "Nếu các ông có thắc mắc gì về các điều khoản, xin đừng do dự báo cho chúng tôi biết.", "eng": "If you have any question about the terms, please don't hesitate to let us know."}, {"viet": "Nếu anh lựa xoay các cạnh anh sẽ đưa được cái bàn qua cửa.", "eng": "If you turn it edgeways you'll get the desk through the door."}, {"viet": "Năm 1679, hàng trăm người đi theo ông ta đã bị cầm tù một cách man rợ.", "eng": "In 1679 hundreds of his followers were barbarously imprisoned."}, {"viet": "Ở Anh quốc có truyền thống ăn gà tây vào dịp giáng sinh.", "eng": "In England turkey is traditionally eaten on Christmas."}, {"viet": "Trong hầu hết các trường hợp sự đau đớn sớm tan đi.", "eng": "In most instances the pain soon goes away."}, {"viet": "Trong cuốn sách, tác giả so sánh hai cách trồng vườn khác nhau.", "eng": "In the book the writer contrasts two different ways of planning a garden."}, {"viet": "Ở Hoa Kỳ, cử tri đoàn bầu ra tổng thống.", "eng": "In the USA the Electoral College elects the president."}, {"viet": "Tỷ lệ tử vong ở trẻ em trong năm 1986 là 20 em chết trên một nghìn trẻ ra đời.", "eng": "Infant mortality was 20 deaths per thousand live births in 1986."}, {"viet": "Đổi sang chỗ đó có được không?", "eng": "Is it all right to switch to that seat?"}, {"viet": "Ở đây có chỗ cho chúng tôi gửi áo khoác không?", "eng": "Is there a place we can check in our coats?"}, {"viet": "Thưa ngài, kỳ nghỉ của ngài ở đây có đăng ký trước không ạ?", "eng": "Is your holiday a reserved booking, sir?"}, {"viet": "Đó là một khách sạn thật tiện nghi với cảnh nhìn ra biển thật lộng lẫy.", "eng": "It's a so comfortable hotel with a magnificent view of the sea."}, {"viet": "Thật khó để chúng tôi chấp nhận đề nghị làm đại lý của các ông theo những điều khoản các ông đưa ra, bởi vì thị trường cho sản phẩm này đang bị ế ẩm.", "eng": "It's difficult for us to accept your offer of agency on the proposed terms, because the market for this product is flat."}, {"viet": "Khó lòng nhớ tên tất cả mọi người.", "eng": "It's impossible to remember everybody's name."}, {"viet": "Không phải lỗi ở tôi-Tôi không làm gì hại cô ấy cả.", "eng": "It's not my fault-I never laid a finger on her."}, {"viet": "Nó vẫn còn trong thời kỳ bảo hành cho nên nhà sản xuất sẽ sửa chữa nó.", "eng": "It's still under guarantee, so the manufacturer will repair it."}, {"viet": "Anh ta khá là độc đoán đi tới quyết định đó mà không hỏi ý kiến của anh trước.", "eng": "It's was rather highhanded of him to take that decision without consulting you first."}, {"viet": "Tôi rất vui mừng được chào đón diễn giả của chúng ta.", "eng": "It gives me great pleasure to welcome our speaker."}, {"viet": "Con lạc đà đi qua mắt kim còn dễ hơn một anh nhà giàu lên vương quốc của Chúa.", "eng": "It is easier for a camel to go through the eye of a needle than for a rich man to enter into the Kingdom of God."}, {"viet": "Thật là tin tốt lành khi anh đã tốt nghiệp với thành tích xuất sắc.", "eng": "It is really good news that you graduated from school with excellent records."}, {"viet": "Đêm nay có thể cực kỳ lạnh cho nên phải nhớ che đậy các cây.", "eng": "It may freeze tonight, so make sure the plants are covered."}, {"viet": "Nó ở miền Bắc nước Nhật.", "eng": "It's in the northern part of Japan."}, {"viet": "Dường như không thể nào tin được là tai nạn đã có thể xảy ra nhanh như vậy.", "eng": "It seems inconceivable that the accident could have happened so quickly."}, {"viet": "Trước đây nó là trường chỉ con trai hoặc con gái nay nó là trường chung cho cả nam nữ.", "eng": "It used to be a single sex school but it's gone coed."}, {"viet": "Tìm khuyết điểm trong lý lẽ của anh ta là chuyện dễ dàng.", "eng": "It was easy to pick holes in his argument."}, {"viet": "Thật là khôi hài, đến chết cười đi được.", "eng": "It was so funny, I nearly died laughing."}, {"viet": "Không mất nhiều thời gian để pha cà phê.", "eng": "It won't take long to filter the coffee."}, {"viet": "Ưu thế của Nhật trong lĩnh vực vi điện tử.", "eng": "Japan's priority in the field of microelectronics."}, {"viet": "Jones trước đây thường làm nghề trộm cắp, song anh ta đã nhận thấy sai lầm trong lối sống đó và đang cố gắng làm lại cuộc đời.", "eng": "Jones used to be a thief, but now he's seen the error of his ways and is trying to rebuild his life."}, {"viet": "Kenya bị thực dân ( Anh ) cai trị nhiều năm.", "eng": "Kenya was under ( British ) colonial rule for many years."}, {"viet": "Chúng ta hãy đưa vé để đục lỗ ở quầy vé.", "eng": "Let's get the tickets punched at the ticket counter."}, {"viet": "Cuộc sống vẫn tiếp diễn đối với những ai trong chúng ta còn lại dưới trần gian này.", "eng": "Life goes on for those of us who remain here below."}, {"viet": "Nhiều người da đỏ sống ở những nơi khô hạn, vì vậy chúng tôi nhảy múa để cầu mưa.", "eng": "Many Indians live in dry places, so we dance for rain."}, {"viet": "Người đàn ông thấp vừa mới bước vào phải không?", "eng": "Marin: The short one who just came in?"}, {"viet": "Xin vui lòng cho tôi biết địa chỉ của bệnh viện?", "eng": "May I have the address of the hospital, please?"}, {"viet": "Bữa ăn tính trung bình là 5 pao một người.", "eng": "Meals average out at 5 pounds per head."}, {"viet": "Hầu hết mọi người đều thích ngắm núi, sông, cây cối, động vật hoang dã.", "eng": "Most people want to see the mountains, rivers, trees, wild animals."}, {"viet": "Cầy luật giao thông trước một kỳ thi lấy bằng lái xe.", "eng": "Mugging up the Highway Code before a driving test."}, {"viet": "Đứa con gái của tôi vừa lấy chồng năm nay.", "eng": "My eldest daughter just got married this year."}, {"viet": "Tri thức của tôi về vật lý khá sơ đẳng.", "eng": "My knowledge of physics is pretty basic."}, {"viet": "Giầy của tôi nhỏ so với giầy của chị tôi.", "eng": "My shoes are small in comparison with my sister's."}, {"viet": "Gần năm mươi người trưng bày đã cung cấp tranh cho cuộc triển lãm.", "eng": "Nearly fifty exhibitors have provided pictures for the display."}, {"viet": "Không, \"Rộng\" không nhất thiết là \"tốt\".", "eng": "No, \"wide\" is not necessarily \"good\"."}, {"viet": "Cho dù chuyện gì xảy ra đi nữa, tôi cũng sẽ có mặt ở đó trước tám giờ.", "eng": "No matter what, I'll be there by eight."}, {"viet": "Bây giờ nó đã lớn rồi, nó không còn thích thú sưu tập tem nữa, nó đã mất hết hứng thú đối với việc đó.", "eng": "Now he's grown up he no longer takes any interest in his stamp collection, he's lost all interest in it."}, {"viet": "Trong tất cả những nơi bạn đã đi du lịch, bạn thích nơi nào nhất?", "eng": "Of all the places you have traveled, which is your favorite?"}, {"viet": "Dầu mỏ đã thay thế cà phê như là hàng xuất khẩu chính của chúng ta.", "eng": "Oil has supplanted coffee as our main export."}, {"viet": "Tóm lại, tôi ủng hộ đề nghị đó.", "eng": "On the whole, I'm in favour of the proposal."}, {"viet": "Một trong những điều phiền hà khi làm việc ở đây là khó tìm được một chỗ đỗ xe gần cơ quan.", "eng": "One of the annoyances of working here is the difficulty of parking near the office."}, {"viet": "Cơ thể chúng ta sản xuất ra chất kháng thể chống bệnh tật.", "eng": "Our bodies produce anti-bodies to counteract diseases."}, {"viet": "Những ngày nghỉ của chúng ta thật đúng như những gì chúng ta có thể ao ước.", "eng": "Our holiday was all that could be desired."}, {"viet": "Các nhà khoa học của chúng tôi đang đi đầu trong công cuộc nghiên cứu vũ trụ.", "eng": "Our scientists are leading the way in space research."}, {"viet": "Vì bị ốm nên cô ấy không thể đến dự buổi họp.", "eng": "Owning to illness, she was unable to attend the meeting."}, {"viet": "Người ta luôn luôn quay trở lại một thời kì vàng son tưởng tượng.", "eng": "People are always harking back to an imaginary golden age."}, {"viet": "Cần phải quên đi thù hằn cá nhân khi quốc gia khủng hoảng.", "eng": "Personal enmities must be forgotten at a time of national crisis."}, {"viet": "Cảnh sát được gọi đến để giải tán cuộc mít tinh.", "eng": "Police were called in to break up the meeting."}, {"viet": "Muối có tác dụng bảo quản thực phẩm.", "eng": "Salt has a preservative effect on food."}, {"viet": "Nhiều nhà xuất bản đang cạnh tranh trên cùng một thị trường.", "eng": "Several publisher are competing in the same market."}, {"viet": "Cô ta là một người hát hay'.'Đó là một vấn đề còn phải bàn.'.", "eng": "She's a fine singer.''That's a matter of opinion."}, {"viet": "Cô ta bị chuyển xuống một văn phòng trong tòa nhà phụ.", "eng": "She's been shunted off to an office in the annexe."}, {"viet": "Cô ta chỉ là một người mảnh khảnh, nhưng cô ta có thể chạy hơn tất cả chúng ta đó.", "eng": "She's just a slip of a thing, but she can run faster than all of us."}, {"viet": "Cô ta đã tỉnh lại nhưng cũng chưa chắc thoát nạn.", "eng": "She's regained consciousness but she's not out of the woods yet."}, {"viet": "Cô ấy đệm piano cho đội hợp xướng.", "eng": "She accompanied the chorus on the piano."}, {"viet": "Cô ấy trở thành vô địch năm 1982 và chưa ai đánh bại được cô ta.", "eng": "She became champion in 1982 and no one has been able to dislodge her."}, {"viet": "Cô ta xoá đi một mảng nhỏ của bức tranh.", "eng": "She cleaned a small segment of the painting."}, {"viet": "Bà ta đã cống hiến đời mình cho việc giúp đỡ người nghèo.", "eng": "She dedicated her life to helping the poor."}, {"viet": "Bà ta lấy cảm hứng từ những kỷ niệm thời thơ ấu của mình.", "eng": "She drew inspiration from her childhood experiences."}, {"viet": "Bà ta thấy công việc dạy học mới của mình rất căng thẳng.", "eng": "She finds her new teaching job very stressful."}, {"viet": "Chị ta đi làm lúc 8 giờ.", "eng": "She goes to work at 8 o'clock."}, {"viet": "Bà ấy có vài nhận xét thú vị về chính trường hiện nay.", "eng": "She had some interesting observations on the current political scene."}, {"viet": "Cô ta có những giấy chứng nhận rất tốt của các ông chủ trước.", "eng": "She has excellent references from former employers."}, {"viet": "Cô ấy hy vọng kiếm được một chỗ làm trong ngành dân chính.", "eng": "She hopes to get a place in the Civil Service."}, {"viet": "Bà ta đang dàn dựng vở'Romeo và Juliet'tại nhà hát địa phương.", "eng": "She is producing'Romeo and Juliet'at the local theatre."}, {"viet": "Cô ta biết quá nhiều làm cho tôi cảm thấy mình rất dốt nát.", "eng": "She knows so much that she makes me feel very unread."}, {"viet": "Lần cuối cùng tôi gặp cô ta, trông cô ta có vẻ rất mệt mỏi.", "eng": "She looked very strained when I last saw her."}, {"viet": "Cô ta phải tỏ ra biết điều hơn, nhưng vì thế anh cũng phải cố gắng hiểu rõ cô ta.", "eng": "She must be more reasonable, but by the same token you must try to understand her."}, {"viet": "Cô ấy đã dự định cho một người bạn thuê căn hộ.", "eng": "She planned to lease her apartment to a friend."}, {"viet": "Cô ta rầy la nó một trận nên thân.", "eng": "She really rapped him over the knuckles."}, {"viet": "Bà ta là một mụ già bẳn tính khủng khiếp.", "eng": "She's an awful old bag."}, {"viet": "Bà ta thường xuyên được nhờ cho ý kiến.", "eng": "She's regularly looked to for advice."}, {"viet": "Em bé gái lết qua trong đôi dép lê của mẹ em.", "eng": "She scuffed past in her mother's slippers."}, {"viet": "Bà ta đề cập gián tiếp đến phí tổn thật sự của kế hoạch.", "eng": "She skated round the likely cost of the plan."}, {"viet": "Cô ta đứng ngay giữa đường đi, nên tôi không thể qua được.", "eng": "She stood slap in the middle of the path, so I couldn't get past."}, {"viet": "Cô ấy cho là anh ta là một đạo diễn phim nổi tiếng nhưng tôi phải cảnh tỉnh cô ấy.", "eng": "She thought he was a famous film director, but I had to undeceive her."}, {"viet": "Bà ta nhận việc tổ chức toàn bộ kế hoạch.", "eng": "She undertook the organization of the whole scheme."}, {"viet": "Cô ta giận điên lên vì cách cư xử của hắn.", "eng": "She was absolutely furious at his behaviour."}, {"viet": "Cô ấy bị tác động mạnh bởi cái tin anh ấy chết.", "eng": "She was deeply affected by the news of his death."}, {"viet": "Cô ta đã được khai tâm về những lề lối của nghề luật.", "eng": "She was inducted into the ways of the legal profession."}, {"viet": "Cô ta tươi như hoa trong niềm vui ngày cưới.", "eng": "She was radiant with joy at her wedding."}, {"viet": "Cô ta quá xảo quyệt đối với tôi.", "eng": "She was too sharp for me."}, {"viet": "Cô nàng đi vung tay kiểu như thế này này.", "eng": "She went like this with her hand."}, {"viet": "Cô ta cài một bông lan độc nhất trên áo dạ hội của mình.", "eng": "She wore a single orchid on her evening dress."}, {"viet": "Hàng đoàn khách du lịch đến đây vào mùa hè.", "eng": "Shoals of tourists come here in the summer."}, {"viet": "Ký tên anh trên đường chấm chấm đấy.", "eng": "Sign your name on the dotted line."}, {"viet": "Sáu người đàn ông đã được phân công đi nhặt củi đốt.", "eng": "Six men were told off to collect fuel."}, {"viet": "Khói lơ lửng trong không trung yên lặng.", "eng": "Smoke hung suspended in the still air."}, {"viet": "Thế ra bố sống ở đây.", "eng": "So this is where you live."}, {"viet": "Mấy đứa trẻ đang chơi trong công viên.", "eng": "Some children were playing in the park."}, {"viet": "Một vài thú tiêu khiển mất sức lôi cuốn khi người ta già đi.", "eng": "Some pastimes lose their relish when one grows old."}, {"viet": "Có ai đã nghịch vào máy tính của cô ấy.", "eng": "Somebody had been meddling with her computer."}, {"viet": "Tôi xin lỗi đã tới muộn vì phải theo tuyến đường thay thế.", "eng": "Sorry I'm late-there was a diversion."}, {"viet": "Mùa xuân là thời điểm ưa thích của tôi trong năm.", "eng": "Spring is my favourite time of year."}, {"viet": "Viết tên của các em lên danh sách.", "eng": "Stick down your names on the list."}, {"viet": "Thẳng thắn trong việc giao dịch buôn bán của mình.", "eng": "Straightforward in one's business dealings."}, {"viet": "Vấn đề như thế chưa bao giờ nổi lên trong ký ức của tôi.", "eng": "Such a problem has never arisen within my recollection."}, {"viet": "Những người tắm nắng đang nằm dang tay dang chân trên bãi cỏ.", "eng": "Sunbathers lay spread-eagled on the grass."}, {"viet": "Không thể tắm biển được cho đến khi thời tiết ấm hơn.", "eng": "Swimming in the sea is out until the weather gets warmer."}, {"viet": "Lập doanh trại ở làng gần nhất.", "eng": "Take up quarters in the nearest village."}, {"viet": "Hãy kể cho tôi nghe tất cả những chi tiết thú vị đó đi!", "eng": "Tell me all the juicy details!"}, {"viet": "Cám ơn những thông tin của anh rất nhiều.", "eng": "Thank you very much for your information."}, {"viet": "Con ong đó đốt tôi một cú đau điếng.", "eng": "That bee gave me a nasty sting."}, {"viet": "Chuyến nghỉ mát đó làm anh ta khỏe lên nhiều.", "eng": "That holiday did him the world of good."}, {"viet": "Cái đèn mới mà họ mua chỉ là thứ đỏm đáng thôi.", "eng": "That new lamp they've bought is pure kitsch."}, {"viet": "Đó là nơi chúng ta sẽ đi.", "eng": "That's where we're going."}, {"viet": "Người đàn bà đó là một nguy hiểm cho xã hội.", "eng": "That woman is a danger to society."}, {"viet": "Bị cáo thoát khỏi sự trừng phạt vì thiếu bằng chứng.", "eng": "The accused escaped scot-free because of lack of evidence."}, {"viet": "Không khí thật trong lành, không như không khí đầy sương khói ở trung tâm thành phố.", "eng": "The air is so fresh, not like the downtown smog-filled air."}, {"viet": "Lời loan báo bị bóp méo đến mức tôi không thể hiểu được nói cái gì.", "eng": "The announcement was so distorted that I couldn't understand what was said."}, {"viet": "Hôm nay đội quân đó đã di hành 30 dặm Anh.", "eng": "The army has marched thirty miles today."}, {"viet": "Cảm giác thích thú của hai người hầu như bắt đầu ngay lập tức.", "eng": "The attraction between them was almost immediate."}, {"viet": "Đứa bé đang vui vẻ bi bô trong chiếc giường cũi.", "eng": "The baby is prattling happily in her cot."}, {"viet": "Ngân hàng trả trước cho cô ấy 500 pao.", "eng": "The bank made her an advance of 500 pounds."}, {"viet": "Ban nhạc Beatles trước thời của tôi một chút.", "eng": "The Beatles were a bit before my time."}, {"viet": "Con chim xù lông rũ lông.", "eng": "The bird fluffed out its feathers."}, {"viet": "Sức đề kháng tự nhiên của cơ thể đối với bệnh tật.", "eng": "The body's natural resistance to disease."}, {"viet": "Sách nằm bừa bãi trên kệ.", "eng": "The books were lying on the shelves just anyhow."}, {"viet": "Đám con trai đang đốt pháo hoa.", "eng": "The boys were letting off fireworks."}, {"viet": "Kiến trúc này chỉ là một bộ phận chưa hoàn thành của kế hoạch ban đầu.", "eng": "The building is but a fragment of original plan."}, {"viet": "Để ngoài tủ lạnh bơ sẽ mềm đi.", "eng": "The butter will soften out of the fridge."}, {"viet": "Ô tô chạy hết tốc lực 100 dặm một giờ.", "eng": "The car does 100 miles an hour flat out."}, {"viet": "Tấm thảm đó bị sờn nhiều.", "eng": "The carpet gets very heavy wear."}, {"viet": "Điểm quan trọng nhất đối với tiếng Anh không phải là Anh nữa, tiếng Mĩ đang có ảnh hưởng to lớn nhất đối với tiếng Anh ở khắp mọi nơi.", "eng": "The center of gravity for the English language is no longer Britain, American English is the greatest influence on English everywhere."}, {"viet": "Pho mát đang bốc mùi nồng nặc.", "eng": "The cheese was emitting a strong smell."}, {"viet": "Em bé biểu diễn nhào lộn ngang qua phòng tập thể dục.", "eng": "The child somersaulted across the gymnasium."}, {"viet": "Lũ trẻ ngốn hết cả bánh ngọt.", "eng": "The children guzzled down all the cakes."}, {"viet": "Bọn trẻ con đang nhảy cẫng lên.", "eng": "The children were jumping up and down."}, {"viet": "Cuộc nội chiến vẫn còn dai dẳng đến tận những năm 1930.", "eng": "The civil war lingered on well into the 1930s."}, {"viet": "Câu lạc bộ quyết định tăng nguyệt liễm.", "eng": "The club have decided to increase subscriptions."}, {"viet": "Nhà hài kịch có thể bắt chước được hết các chính khách hàng đầu.", "eng": "The comedian could impersonate most leading politicians."}, {"viet": "Công ty vừa tung ra một chiến dịch tiếp thị tích cực để gia tăng lượng hàng bán.", "eng": "The company has launched a strong marketing offensive to try to increase sales."}, {"viet": "Hoàn cảnh đúng là thuộc thời Trung cổ.", "eng": "The conditions were positively medieval."}, {"viet": "Câu chuyện mang giọng điệu hơi buồn.", "eng": "The conversation was pitched in a minor key."}, {"viet": "Đất nước hiện nay đang trong tình trạng nội chiến.", "eng": "The country is now in a state of civil war."}, {"viet": "Thuỷ thủ đang bắt đầu bị những loại bệnh lặt vặt.", "eng": "The crew began suffering a variety of ailments."}, {"viet": "Thành công mỹ mãn trong sự nghiệp của bà ta.", "eng": "The crowning success of her career."}, {"viet": "Các diễn viên múa biểu diễn tuyệt hảo.", "eng": "The dancers gave an absolutely faultless performance."}, {"viet": "Bị cáo nhoài người tới trước và nói thầm với luật sư của mình.", "eng": "The defendant leant forward and spoke to his barrister, sotto voce."}, {"viet": "Những người khai thác đất đai đã trả một giá thật cao cho khu đất đó.", "eng": "The developers made a regal offer for the land."}, {"viet": "Dấu hiệu của những cây bị bệnh là trên vỏ của chúng nổi lên những khối u.", "eng": "The disease trees are marked by protuberance on their bark."}, {"viet": "Bác sĩ cho biết là bệnh nhân đã mạnh khoẻ.", "eng": "The doctor reported the patient fit and well."}, {"viet": "Con chó vẫn trung thành với chủ.", "eng": "The dog remained faithful to his master."}, {"viet": "Sức cuốn của thuỷ triều, dòng nước, gió, v. v.", "eng": "The drift of the tide, current, wind, etc."}, {"viet": "Trận động đất làm nổi bật sự dễ hư hại của những chiếc cầu và các con đường ở trên cao.", "eng": "The earthquake highlighted the vulnerability of elevated bridges and roads."}, {"viet": "Giới chủ không dẹp nổi cuộc đình công của các công nhân bến tàu.", "eng": "The employers have not broken the dockers'strike."}, {"viet": "Tính vô tư trong quyết định của trọng tài đã được mọi người chấp nhận.", "eng": "The equity of the referee's decision was accepted by everyone."}, {"viet": "Những bảng hiệu chỉ lối ra ở các rạp chiếu bóng thường được chiếu sáng.", "eng": "The exit signs in cinemas are usually illuminated."}, {"viet": "Sự sụt giảm năng suất đã làm suy yếu nền kinh tế.", "eng": "The fall in productivity has weakened the economy."}, {"viet": "Con chim mái ấp trứng trong khi con chim đực đem thức ăn về.", "eng": "The female sat on the eggs while the male bird brought food."}, {"viet": "Khi chúng tôi tới thì phim đã chiếu rồi.", "eng": "The film was already on when we arrived."}, {"viet": "Hãng đang kiên quyết tiếp tục kế hoạch hiện đại hoá.", "eng": "The firm is pressing ahead with the modernization plan."}, {"viet": "Con cá chúng tôi câu được giẫy đành đạch ở đáy thuyền.", "eng": "The fish we'd caught flopped around in the bottom of the boat."}, {"viet": "Sân bóng đá úng nước vì thế phải huỷ bỏ trận đấu.", "eng": "The football pitch was waterlogged so the match had to be cancelled."}, {"viet": "Mặt trước của toà nhà phủ kín đầy cây thường xuân.", "eng": "The front of the building was covered with ivy."}, {"viet": "Thửa vườn đó trông đẹp nhất vào mùa xuân.", "eng": "The garden looks its best in the spring."}, {"viet": "Băng tuyết làm mòn đáy thung lũng.", "eng": "The glacier rasps the floor of the valley."}, {"viet": "Chính phủ và phe đối lập bất đồng ý kiến về đề nạn thất nghiệp.", "eng": "The Government and the Opposition clashed on the question of unemployment."}, {"viet": "Chính phủ chơi trò chờ xem với nghiệp đoàn đang đình công.", "eng": "The government is playing a waiting game with the unions that on strike."}, {"viet": "Những hạt nằm trong đồ đựng muối của chúng ta đều là tinh thể.", "eng": "The grains of salt in our saltcellars are crystals."}, {"viet": "Vấn đề nghiện ma tuý trong giới thanh niên ngày càng tăng lên.", "eng": "The growing problem of heroin addiction among young people."}, {"viet": "Bàn tay đu đưa cái nôi đã đi chầu trời.", "eng": "The hand that rocks the cradle has kicked the bucket."}, {"viet": "Giá nguyên liệu cao làm cho giá cả cũng cao.", "eng": "The high cost of raw materials is keeping prices up."}, {"viet": "Bệnh viện ở mãi cuối đường.", "eng": "The hospital is further down the road."}, {"viet": "Ngôi nhà này chẳng có gì đáng chú ý nhiều về mặt kiến trúc.", "eng": "The house is of little interest architecturally."}, {"viet": "Ý kiến này đã gây ra nhiều sự chỉ trích từ cả hai phía.", "eng": "The idea has drawn much criticism from both sides."}, {"viet": "Các ngành công nghiệp cung cấp công việc để củng cố hệ thống.", "eng": "The industries provided the work that bolstered up the system."}, {"viet": "Cuộc phỏng vấn dành riêng cho tạp chí này.", "eng": "The interview is exclusive to this magazine."}, {"viet": "Tay nài ngựa đã bị phạt vì sử dụng roi quá đáng.", "eng": "The jockey was fined for excessive use of the whip."}, {"viet": "Chìa khóa quay được nửa vòng và kẹt luôn.", "eng": "The key turned half way and then jammed."}, {"viet": "Chủ nhà yêu cầu người thuê dọn đi vào cuối tháng.", "eng": "The landlord asked the tenants to vacate the house by the end of the month."}, {"viet": "Diễn viên chính đó đã nói sai lời vai diễn của mình.", "eng": "The lead actor misspoke his lines."}, {"viet": "Thuyền cứu đắm đã vớt tất cả những người sống sót.", "eng": "The life boat picked up all the survivors."}, {"viet": "Người khách trọ đã chuồn mà không thanh toán tiền.", "eng": "The lodger has decamped without paying his bill."}, {"viet": "Chiếc máy đó chỉ cần chạm nhẹ là khởi động hoặc tắt ngay.", "eng": "The machine stops and starts at a touch."}, {"viet": "Ban quản lí tăng cho chúng tôi 3% nhỏ nhoi tiền lương.", "eng": "The management offered us a paltry 3% salary increase."}, {"viet": "Vấn đề đó hầu như không được đả động tới.", "eng": "The matter was hardly touched on."}, {"viet": "Những người trong gia đình đó lần lượt chết cả.", "eng": "The members of the family had all died off."}, {"viet": "Ông bộ trưởng vẫn còn đang trao đổi với các cố vấn của mình.", "eng": "The minister is still conferring with his advisers."}, {"viet": "Toàn thể đài kỷ niệm được dời đến một vị trí mới.", "eng": "The monument was moved bodily to a new site."}, {"viet": "Những người chịu tang mặc đồ đen.", "eng": "The mourners were dressed in black."}, {"viet": "Lực Lượng hải quân bị tiêu diệt trong cuộc tấn công.", "eng": "The naval force was annihilated during the attack."}, {"viet": "Chương trình nhà ở mới chứng tỏ sự năng nổ của Hội đồng.", "eng": "The new housing bears witness to the energy of the Council."}, {"viet": "Kiểu xe thể thao mới đã đạt được vận tốc 100 dặm 1 giờ trong các cuộc chạy thử trên đường.", "eng": "The new sports model achieved 100 miles an hour in road tests."}, {"viet": "Chặng sau của cuộc du ngoạn đưa chúng ta lên núi.", "eng": "The next lap of our trip takes us into the mountains."}, {"viet": "Con số 34 gồm ba số hàng chục và bốn số hàng đơn vị.", "eng": "The number 34 consists of three tens and four units."}, {"viet": "Viên sĩ quan truyền lệnh cho lính của ông ta qua rađiô.", "eng": "The officer communicated his orders to the men by radio."}, {"viet": "Câu tục ngữ xưa Dục tốc bất đạt.", "eng": "The old saw More haste, less speed."}, {"viet": "Cái tổ chức mà ông ta đã gây dựng cuối cùng đã trở thành công cụ đưa ông ta đến sự sụp đổ.", "eng": "The organization he had built up eventually became the instrument of his downfall."}, {"viet": "Lớp sơn bắt đầu bong ra, cần phải sơn lại sớm.", "eng": "The paintwork is beginning to flake, it'll need to be done over soon."}, {"viet": "Những hành khách say sóng thì ở bên dưới.", "eng": "The passengers who felt seasick stayed below."}, {"viet": "Dân ấn Độ trồng bông vải cách đây hơn 3000 năm.", "eng": "The people of India raised cotton more than 3,000 years ago."}, {"viet": "Nghệ thuật trình diễn cao của người nghệ sĩ pianô.", "eng": "The pianist's considerable interpretative skills."}, {"viet": "Chỗ đó tràn ngập ánh sáng.", "eng": "The place was flooded with light."}, {"viet": "Bộ cốc chén bằng vàng bạc được cất giữ trong tủ có khoá.", "eng": "The plate is kept in a locked cupboard."}, {"viet": "Sự giận dữ của nhà thơ được diễn đạt trong dòng cuối của bài thơ.", "eng": "The poet's anger finds expression in the last line of the poem."}, {"viet": "Cảnh sát đã bắt những tên tội phạm đột nhập vào một nhà của những người già.", "eng": "The police have caught the villains who broke into an old people's home."}, {"viet": "Cảnh sát được trang bị đầy đủ dụng cụ chống bạo loạn, với khiên và mũ bảo vệ.", "eng": "The police were in full riot gear, with shields and helmets."}, {"viet": "Việc có hộ chiếu là thiết yếu để đi du lịch ra nước ngoài.", "eng": "The possession of a passport is essential for foreign travel."}, {"viet": "Sự bảo quản tác phẩm nghệ thuật.", "eng": "The preservation of works of art."}, {"viet": "Gió thường xuyên là từ tây nam.", "eng": "The prevailing wind is from the south-west."}, {"viet": "Các nguyên tắc làm cơ sở cho chính sách của chúng ta.", "eng": "The principles which underlie our policy."}, {"viet": "Một cầu thủ bóng đá chuyên nghiệp mà cũng chơi cricket bây giờ rất hiếm.", "eng": "The professional footballer who also plays cricket is a rare bird nowadays."}, {"viet": "Triển vọng thu hoạch rượu nho năm nay là kém.", "eng": "The prospects for this year's wine harvest are poor."}, {"viet": "Người đại diện của Nữ Hoàng tại buổi lễ.", "eng": "The Queen's representative at the ceremony."}, {"viet": "Nước mưa đã chảy trong các rãnh nông dọc theo con đường.", "eng": "The rain ran in shallow runnels alongside the path."}, {"viet": "Chiếc ghế sôfa đỏ không hợp với tường màu tím.", "eng": "The red sofa didn't blend with the purple wall."}, {"viet": "Bản báo cáo phê phán gay gắt về sự thiếu biện pháp an toàn.", "eng": "The report was scathing about the lack of safety precautions."}, {"viet": "Gân lá, gọng ô, rẻ quạt, sườn thuyền.", "eng": "The ribs of a leaf, an umbrella, a fan, a boat."}, {"viet": "Con đường chạy qua khe hở giữa hai quả đồi.", "eng": "The road goes through a gap between the hills."}, {"viet": "Căn phòng được bày biện một cách tầm thường.", "eng": "The room was furnished in austere style."}, {"viet": "Cái tay cầm an toàn bên trên bồn tắm cũng lỏng.", "eng": "The safety handle above the bathtub is loose."}, {"viet": "Kế hoạch đó rất đáng thử nghiệm.", "eng": "The scheme is well worth a try."}, {"viet": "Ca hai kết thúc lúc nửa đêm.", "eng": "The second shift ends at midnight."}, {"viet": "Những cây có bóng mát đã che chở chống lại những tia nắng thiêu đốt của mặt trời.", "eng": "The shady trees provide protection against the burning rays of the sun."}, {"viet": "Chiếc tàu đã đắm với hai trăm người trên tàu.", "eng": "The ship was lost with two hundred souls on board."}, {"viet": "Cạnh của hình tam giác đối diện với góc đối.", "eng": "The side of the triangle subtends the opposite angle."}, {"viet": "Bầu trời một màu xanh sáng trên đầu chúng tôi.", "eng": "The sky was a clear blue over our heads."}, {"viet": "Đất phải được tẩy sạch tất cả các vi khuẩn.", "eng": "The soil has to be purified of all bacteria."}, {"viet": "Ghế sau rộng rãi của chiếc xe ôtô.", "eng": "The spacious back seat of a car."}, {"viet": "Nhân viên cửa hàng được giảm giá mười phần trăm.", "eng": "The staff at the shop get a discount of ten percent."}, {"viet": "Đá lạo xạo dưới bánh xe ô tô.", "eng": "The stones scrunched under the car tyres."}, {"viet": "Các sinh viên mỗi người có một tiếng đồng hồ để viết tóm tắt báo cáo này.", "eng": "The students are allowed to have an hour apiece to write a sumarry of this article."}, {"viet": "Siêu thị ở rất gần nhà ga.", "eng": "The supermarket is very near the station."}, {"viet": "Thầy giáo quở mắng các học sinh vì tính cẩu thả của chúng.", "eng": "The teacher admonished the boys for their carelessness."}, {"viet": "Cái ấm trà từ tay tôi rơi xuống vỡ ra từng mảnh.", "eng": "The teapot just came apart in my hands."}, {"viet": "Tên trộm đã có một mưu toan nhầm lẫn là cướp một nữ cảnh sát viên.", "eng": "The thief made a misguided attempt to rob a policewoman."}, {"viet": "Các con vật bé nhỏ tự bản thân chúng đều rất giống nhau, nhưng các ngôi nhà bằng đá chúng xây thì lại khác hẳn nhau về hình dáng.", "eng": "The tiny animals themselves are all much alike, but the rock houses they built are quite different in shape."}, {"viet": "Xe lửa tới Glasgow lúc 6 giờ sáng.", "eng": "The train gets into Glasgow at 6 o'clock in the morning."}, {"viet": "Các đơn vị quân đội đã phải rút về một vị trí đỡ trống trải hơn.", "eng": "The troops had to withdraw to a less exposed position."}, {"viet": "Hai dân tộc đó có liên quan đến nhau về mặt dân tộc học.", "eng": "The two peoples are ethnically related."}, {"viet": "Vũ trụ đang từ từ để lộ các bí mật của nó cho các nhà khoa học.", "eng": "The universe is slowly yielding up its secrets to scientists."}, {"viet": "Đầu máy vi deo đã được lập trình để tự động mở máy vào lúc mười giờ.", "eng": "The video is programed to switch itself on at ten o'clock."}, {"viet": "Cuộc chiến tranh này đã thua vì thiếu đạn dược.", "eng": "The war was lost because of a shortage of munitions."}, {"viet": "Bánh xe khó bám vào đường khi đường phủ băng.", "eng": "The wheels have difficulty in biting the road when it's icy."}, {"viet": "Cửa sổ đã bị bẩn hết sau cơn mưa.", "eng": "The window was all smeared after the rain."}, {"viet": "Công việc sẽ hoàn thành sau một tháng.", "eng": "The work will be complete after a month."}, {"viet": "Cô ca sĩ trẻ tuổi giọng nữ cao được một nhạc trưởng nổi tiếng dìu dắt.", "eng": "The young soprano was taken up by a famous conductor."}, {"viet": "Nhà họ giống như nhà của chúng tôi, nhưng nhà của chúng tôi có vườn lớn hơn.", "eng": "Their house is similar to ours, but ours has a bigger garden."}, {"viet": "Công việc của họ là sự khởi đầu của Đế quốc Anh, đế quốc lớn nhất trên thế giới.", "eng": "Their work was the beginning of the British Empire, the biggest empire the world has ever seen."}, {"viet": "Có ( một ấm ) trà đang pha trong bếp.", "eng": "There's ( a pot of ) tea brewing in the kitchen."}, {"viet": "Còn một việc nữa tôi muốn hỏi anh.", "eng": "There's another thing I want to ask you about."}, {"viet": "Chỉ còn một phòng ngủ, vậy chúng ta sẽ phải dùng chung.", "eng": "There's only one bedroom, so we'll have to share."}, {"viet": "Có những dấu hiệu là tình hình có lẽ đang được cải thiện.", "eng": "There are indications that the situation may be improving."}, {"viet": "Có một số đàn ông vẫn cảm thấy hèn yếu nếu họ làm việc cho một người phụ nữ.", "eng": "There are still some men who feel emasculated if they work for a woman."}, {"viet": "Có vô số bản án dành cho kẻ vi phạm luật mới.", "eng": "There have been numerous convictions for offences against the new law."}, {"viet": "Có một nhà hàng Ấn Độ rất ngon nằm ngay xe điện ngầm.", "eng": "There is a very good Indian restaurant near the subway station."}, {"viet": "Có một sự nghi ngờ nào đó về sự trung thực của anh ta.", "eng": "There is some question about his honesty."}, {"viet": "Có một tai nạn khủng khiếp ở đây hôm qua.", "eng": "There was a horrible accident here yesterday."}, {"viet": "Đã xảy ra cả một cuộc đấu khẩu khi cô ta từ chối không chịu trả tiền.", "eng": "There was quite a scene when she refused to pay."}, {"viet": "Sẽ có một bữa đại tiệc tổ chức để chào mừng ông vào tối mai.", "eng": "There will be a banquet in honour of you tomorrow night."}, {"viet": "Những phát hiện này hình như trái với các định luật vật lý.", "eng": "These findings appear to violate the laws of physics."}, {"viet": "Những hạt này đã nảy mầm-bạn có thể thấy những chiếc lá xanh nhỏ trên mặt đất.", "eng": "These seeds have sprouted-you can see little green leaves above the earth."}, {"viet": "Người ta đang tính đánh thuế sách giáo khoa-tôi xin hỏi anh, rồi ra chúng ta đi ngủ cũng phải đóng thuế chắc!", "eng": "They're thinking of taxing textbooks-I ask you, we'll have to pay to go to bed next!"}, {"viet": "Chúng nó luôn luôn trêu chọc thầy giáo về giọng của thầy.", "eng": "They are always ragging the teacher about his accent."}, {"viet": "Họ chẳng săn được gì ngoài hai con thỏ.", "eng": "They bagged nothing except a couple of rabbits."}, {"viet": "Họ chỉ định anh ta làm chủ toạ buổi họp.", "eng": "They constitute him chairman of the meeting."}, {"viet": "Họ bầu anh ta làm chủ tịch, trong câu này president là bổ ngữ của bổ ngữ.", "eng": "They elected him president, president is an objective complement in this sentence."}, {"viet": "Phải tính toán đến nhiều khó khăn.", "eng": "They had many difficulties to reckon with."}, {"viet": "Họ đã dùng thủ đoạn đẩy Fred ra khỏi địa vị của anh ta trong ban giám đốc.", "eng": "They jockeyed Fred out of his position on the board."}, {"viet": "Chúng cứ hay chế nhạo giọng nói của ông ta.", "eng": "They me always ragging about his accent."}, {"viet": "Họ hứa rằng đảng sẽ thanh trừng những tên phân biệt chủng tộc ra khỏi đảng.", "eng": "They promised that the party would be purged of racists."}, {"viet": "Họ dường như bực bội vì sự có mặt của chúng tôi ở đây.", "eng": "They seemed to be resentful of our presence here."}, {"viet": "Họ đã tận dụng những điều kiện thuận lợi của khách sạn.", "eng": "They took full advantage of the hotel's facilities."}, {"viet": "Họ đã bị đánh lừa đến chỗ giao cho nó những món tiền lớn.", "eng": "They were beguiled into giving him large sums of money."}, {"viet": "Họ rất ngạc nhiên thấy tình trạng phổ biến các tình cảm chống chính phủ.", "eng": "They were very surprised by the prevalence of anti-government sentiments."}, {"viet": "Đồ cổ này đáng giá mấy trăm pao.", "eng": "This antique is worth several hundred pounds."}, {"viet": "Công ty này quan tâm đến chất lượng hơn là đến số lượng.", "eng": "This company is more concerned with quality than with quantity."}, {"viet": "Sự thất bại này là điểm sa sút tột cùng của sự nghiệp của bà ta.", "eng": "This failure was the nadir of her career."}, {"viet": "Con dao này không dùng được-cán dao đã gãy.", "eng": "This is a useless knife-the handle's broken."}, {"viet": "Đây không phải là trận đấu tập luyện, chúng tôi đang thi đấu thật sự.", "eng": "This isn't a practice game, we're playing for real."}, {"viet": "Kỹ thuật mới này sẽ làm tăng sản xuất lương thực.", "eng": "This new technology will boost food production."}, {"viet": "Bản nhạc dành cho bộ tứ này tiêu biểu cho xu hướng mới, chủ đạo trong âm nhạc hiện đại.", "eng": "This quartet represents a major new trend in modern music."}, {"viet": "Sợi dây này quá mỏng, tôi cần một sợi dây khác dày hơn.", "eng": "This string is too thin, I need a thicker piece."}, {"viet": "Lãi năm nay sẽ bù lại những thua lỗ của chúng ta trước đây.", "eng": "This year's profits will balance our previous losses."}, {"viet": "Để cho các tháng không sai lệch quá xa với các mùa, các thầy tu cứ cách hai hoặc ba năm lại phải thêm một tháng ngoại lệ vào trong năm.", "eng": "To keep the months from slipping too far out of place in the seasons, the priests put an extra month in the year every two or three years."}, {"viet": "Giao dịch buôn bán với các nước khác rất quan trọng.", "eng": "Trade with their countries is important."}, {"viet": "Thông thường chúng tôi có tài khoản vãng lai và tài khoản tiết kiệm có kỳ hạn dành cho cá nhân.", "eng": "Usually we offer current account and fixed account for individuals."}, {"viet": "Nước là thành phần tạo thành của mọi thứ rau.", "eng": "Water enters into the composition of all vegetables."}, {"viet": "Chúng tôi sẽ hoàn lại chi phí giặt ủi và tiền mua cái áo mới.", "eng": "We'll refund the cost of the laundry and the new shirt."}, {"viet": "Chúng tôi sẽ biến cái gác xép của mình thành một buồng ngủ phụ.", "eng": "We're making our attic into an extra bedroom."}, {"viet": "Chúng tôi có bia Bắc Kinh và bia Thanh Đảo, cả hai loại đó đề có vị rất thơm ngon.", "eng": "We've got Beijing beer and Tsing Tao beer and both of them taste good."}, {"viet": "Tất cả chúng tôi gửi lời chúc tốt đẹp nhất ( về sự bình phục của bạn ).", "eng": "We all send our best wishes ( for your recovery )."}, {"viet": "Bây giờ chúng tôi sẵn sàng gọi món rồi.", "eng": "We are ready to order now."}, {"viet": "Chúng tôi ghé qua đây nên đến chào.", "eng": "We came to say hello as we were passing through."}, {"viet": "Chúng tôi không thể tính nhiều như thế.", "eng": "We can't go as far as that."}, {"viet": "Chúng tôi nhận ra là hành lý của chúng tôi đã bị đánh cắp.", "eng": "We discovered that our luggage had been stolen."}, {"viet": "Chúng ta quên khởi động máy.", "eng": "We forgot to start the engine."}, {"viet": "Đêm qua trời lạnh 10 độ dưới O.", "eng": "We had ten degrees of frost last night."}, {"viet": "Chúng tôi có trà Long Tỉnh của Hàng Châu và trà Bích La của Giang Tô.", "eng": "We have got Dragon Well tea, which is from Hangzhou and Bi Luo Chun from Jiangsu."}, {"viet": "Chúng tôi tổ chức tổng tuyển cử bốn hoặc năm năm một lần.", "eng": "We hold a general election every four or five years."}, {"viet": "Chúng tôi sẽ trông chừng hành lý miễn phí.", "eng": "We'll take care of it free of charge."}, {"viet": "Chúng ta phải tìm ngọn nguồn của điều bí ẩn đó.", "eng": "We must get to the bottom of this mystery."}, {"viet": "Chúng tôi không bao giờ dùng những thành phần thức ăn loại hai.", "eng": "We never use second quality ingredients."}, {"viet": "Chúng tôi đã nhận được bảng thông báo công nợ của các ông về đơn đặt hàng của chúng tôi.", "eng": "We received your statement of our order."}, {"viet": "Chúng ta nên mời Robert và Ann tới dự tiệc.", "eng": "We should invite Robert and Ann to the party."}, {"viet": "Chúng tôi nghiêng cái bàn để lọt được vào phòng.", "eng": "We turned the table sideways to get it into the room."}, {"viet": "Chúng tôi đã biết vấn đề này từ trước.", "eng": "We were aware of the problem beforehand."}, {"viet": "Chúng ta sẽ hạ cánh xuống sân bay trong giây lát.", "eng": "We will be landing at the airport momentarily."}, {"viet": "À, Ông có thể cho chúng tôi biết mức đặt hàng tối thiểu là bao nhiêu được không?", "eng": "Well, Can you tell me what is the minimum order we should place?"}, {"viet": "Này, chúng ta hãy lấy hành lý xuống trước khi xe lửa dừng nhé?", "eng": "Well, shall we get the luggage down before it stops?"}, {"viet": "Tin tức mới nhất về bầu cử là thế nào?", "eng": "What's the latest news about the election?"}, {"viet": "Những nguy cơ sức khỏe nào có liên quan tới việc hút thuốc?", "eng": "What are the health risks associated with smoking?"}, {"viet": "Búp bê Hina tượng trưng cho cái gì?", "eng": "What do the Hina dolls symbolize?"}, {"viet": "Những sở thích nào được ưa chuộng ở đất nước bạn?", "eng": "What hobbies are popular in your country?"}, {"viet": "Vậy nếu chúng tôi đặt 1000 bộ thì giá là bao nhiêu?", "eng": "What is the price if we order 1,000 sets?"}, {"viet": "Bạn biết trò ảo thuật gì?", "eng": "What magic tricks do you know?"}, {"viet": "Ở Canada, những điều gì được xem là biểu tượng của sự xui xẻo?", "eng": "What things are considered to be a symbol of bad luck in Canada?"}, {"viet": "Anh định khi nào đi nghỉ?", "eng": "When are you going to take your vacation?"}, {"viet": "Khi tôi mua cái điện thoại di động mới này, nó đã bị hư rồi.", "eng": "When I bought my new cellular phone, it came damaged."}, {"viet": "Khi doạ tố cáo chúng ta, cô ta hoàn toàn nghiêm túc.", "eng": "When she threatened to report us, she was in dead earnest."}, {"viet": "Khi chúng tôi nghỉ ở Hy Lạp, chúng tôi sống như người dân địa phương.", "eng": "When we're on holiday in Greece, we live like the natives."}, {"viet": "Tôi có thể ghi tên khoá học tiếng A rập ở đâu?", "eng": "Where can I register for the Arabic course?"}, {"viet": "Anh đi hướng nào, bắc hay nam?", "eng": "Which direction are you going, north or south?"}, {"viet": "Trong khi bị kết án tử hình, hắn ta không được trò chuyện với những người tù khác.", "eng": "While he was under the sentence of death, he was not allowed to speak to other prisoners."}, {"viet": "Nghệ sĩ bạn yêu thích là ai?", "eng": "Who is your favorite music artist?"}, {"viet": "Anh hãy bắt đầu bằng cách giới thiệu cho tôi biết điều gì đó về anh đi?", "eng": "Why don't you begin by telling me something about yourself?"}, {"viet": "Sẽ mất nhiều thời gian để đổi một it ngoại tệ ở đây phải không?", "eng": "Will it take long to exchange some foreign currency here?"}, {"viet": "Cô vui lòng cho tôi xem vài loại nhung có màu khác nhau?", "eng": "Will you show me some velour in different colours?"}, {"viet": "Với sự hướng dẫn của thầy giáo tôi, tôi đã hoàn thành công việc.", "eng": "With my teacher's guidance, I finished the work."}, {"viet": "Họ hàng thân thích lo lắng đợi ở sân bay.", "eng": "Worried relatives waited at the airport."}, {"viet": "Bạn có muốn đi câu cá cuối tuần này không?", "eng": "Would you like to go fishing this weekend?"}, {"viet": "Xin ông vui lòng cho tôi biết nó giá bao nhiêu?", "eng": "Would you please tell me the price?"}, {"viet": "Vâng, anh có thể cho tôi biết ký ở đâu được không?", "eng": "Yes, could you tell me where to sign, please?"}, {"viet": "Vâng, ông có thể dùng thẻ tín dụng này ở đây.", "eng": "Yes, you can use this credit card here."}, {"viet": "Anh phải đi nhanh lên nếu muốn đến đó đúng giờ.", "eng": "You'll have to shift if you want to get there on time."}, {"viet": "Ông là phóng viên đến đây để nói chuyện với ông cố Jack.", "eng": "You're the reporter here to talk to great-grandpa Jack."}, {"viet": "Anh hoàn toàn đúng trong quyết định từ chối.", "eng": "You are quite right in your decision to refuse."}, {"viet": "Anh không thể mặc bộ đó đến buổi chiêu đãi này được-không được trang trọng lắm.", "eng": "You can't wear that to the reception-it's not dressy enough."}, {"viet": "Anh có thể trông thấy những lỗ nhỏ ở chỗ các mũi khâu.", "eng": "You can see the pricks where the stitches were."}, {"viet": "Nếu đã đeo thắt lưng thì không cần dây đeo quần nữa.", "eng": "You don't need braces if you're wearing a belt."}, {"viet": "Anh phải nhả cần thắng tay chứ.", "eng": "You have to release the hand brake."}, {"viet": "Ông có thể dọn đến nhà này khi hoàn tất văn tự.", "eng": "You may move into the house on completion."}, {"viet": "Anh nên đọc báo để biết tin tức.", "eng": "You must read the papers to keep well-informed."}, {"viet": "Khi mặc màu đỏ trông bạn thật tuyệt.", "eng": "You really look good in red."}, {"viet": "Anh phải suy nghĩ cẩn thận về việc thuê một người anh chưa bao giờ gặp.", "eng": "You should think twice about employing someone you've never met."}, {"viet": "Ông sẽ được mời trình diện để phỏng vấn.", "eng": "You will be asked to present yourself for interview."}, {"viet": "Hành vi của anh đã gây ra cho chúng tôi rất nhiều điều phiền phức.", "eng": "Your behavior has occasioned us a lot of trouble."}, {"viet": "Đề nghị của anh là phi lý, nó hoàn toàn là chuyện viển vông.", "eng": "Your proposal is absurd, it's an absolute non-starter."}]