[{"viet": "Vé giường nằm đủ cho tôi rồi.", "eng": "A berth is good enough for me."}, {"viet": "Một sự thay đổi không khí sẽ tốt cho bạn đấy.", "eng": "A change of air will do you good."}, {"viet": "Sự kết hợp phức tạp những yếu tố xã hội và chính trị đan vào nhau.", "eng": "A complex jigsaw of interlocking social and economic factors."}, {"viet": "Sự thờ ơ đối với sự an toàn của người khác.", "eng": "A cynical disregard for others'safety."}, {"viet": "Một văn kiện với hai chữ ký trên đó.", "eng": "A document with two signatures on it."}, {"viet": "Một vài lời khen ngợi của cô ấy có lẽ đã làm cho hạnh phúc của anh ta trọn vẹn.", "eng": "A few words of praise from her would have completed his happiness."}, {"viet": "Hỗn hợp trứng sữa đánh cho nổi lên.", "eng": "A frothy mixture of eggs and milk."}, {"viet": "Một chính phủ cải thiện điều kiện sống của quần chúng.", "eng": "A government which improves conditions for the many."}, {"viet": "Một tên phản bội cao cấp đang tìm chỗ tị nạn chính trị.", "eng": "A high-ranking defector seeking political asylum."}, {"viet": "Một lời nói đùa, câu chuyện, một người thực sự khiến cho thiên hạ phải kêu ca.", "eng": "A joke, story, person that is a bit of a groan."}, {"viet": "Một thấu kính có độ phóng to lên tới 20 lần.", "eng": "A lens that magnifies 20 diameters."}, {"viet": "Một tiếng động lớn làm mình không còn chú ý tới việc đang nấu nướng thành ra mọi thứ cháy cả.", "eng": "A loud noise diverted my attention from cooking and everything was burnt."}, {"viet": "Một cuộc khám bệnh do một bác sĩ đảm trách.", "eng": "A medical examination by a doctor."}, {"viet": "Bosporus là một eo biển hẹp nối liền Biển Đen với biển Marmara.", "eng": "A narrow strait called the Bosporus joins the Black Sea and the Sea of Marmara."}, {"viet": "Một số vụ trộm cắp đã được báo cáo gần đây.", "eng": "A number of thefts have been reported recently."}, {"viet": "Một người giàu như bạn mới có khả năng mua được cái đó.", "eng": "A person of your means can afford it."}, {"viet": "Nhà chính trị cần phải có phong cách bình dân.", "eng": "A politician needs the common touch."}, {"viet": "Một tỉnh đã tách ra để thành lập một bang mới.", "eng": "A province has broken away to form a new state."}, {"viet": "Một hiệu ăn có nhiều khách sộp.", "eng": "A restaurant with many well-heeled customers."}, {"viet": "Một kế hoạch dễ bị phê phán.", "eng": "A scheme that is open to criticism."}, {"viet": "Một thời gian tạm nghỉ ngắn giữa một cuốn phim.", "eng": "A short intermission halfway through a film."}, {"viet": "Một sự lưu lại hai hoặc ba tuần ở vùng núi.", "eng": "A sojourn of two or three weeks in the mountains."}, {"viet": "Một khoang chứa hàng trên một chiếc máy bay.", "eng": "A storage compartment on a plane."}, {"viet": "Trước kia có một cây bạch dương cao ở đây.", "eng": "A tall poplar tree once stood here."}, {"viet": "Một kẻ bụi đời bới các thùng rác để tìm thức ăn.", "eng": "A tramp scavenging in dustbins for food."}, {"viet": "Một chiếc tàu chiến được trang bị tháp pháo đôi.", "eng": "A warship armed with twin turrets."}, {"viet": "Một cây con chỉ đo được mười tám insơ theo chu vi.", "eng": "A young tree measuring only 18 inches round."}, {"viet": "Thật ra, món ăn Tứ Xuyên không phải lúc nào cũng cay.", "eng": "Actually, Sichuan food is not always hot."}, {"viet": "Thật là khoan khoái khi được đặt chân lại lên đất liền sau một tuần đi biển.", "eng": "After a week at sea, it was good to feel the earth under our feet again."}, {"viet": "Sau chỉ có một tháng làm công việc đó nó đã cảm thấy bực bội và quyết định bỏ việc.", "eng": "After only a month in the job, he felt restless and decided to leave."}, {"viet": "Sau khi làm xong thủ tục nhận phòng ở khách sạn, sao chúng ta không đi tham quan nhỉ?", "eng": "After we get checked in at the hotel, why don't we do some sightseeing?"}, {"viet": "Tất cả lời hứa của hắn đều là cạm bẫy và lừa gạt.", "eng": "All his promises were snares and delusions."}, {"viet": "Đèn đóm vụt tắt và chúng tôi bị để ngồi trong bóng tối.", "eng": "All the lights went out and we were left in the dark."}, {"viet": "Dù là một giám đốc, cô ta vẫn hỏi ý kiến nhân viên của mình.", "eng": "Although she's the manager, she's not above asking for advice from her staff."}, {"viet": "Sự cải biến một vở kịch của Shakespeare cho thiếu nhi.", "eng": "An adaptation for children of a play by Shakespeare."}, {"viet": "Một câu hỏi hóc búa làm ông bộ trưởng hết chống đỡ nổi.", "eng": "An awkward question which got through the minister's guard."}, {"viet": "Một cú va mạnh làm nảy chiếc thùng thư đến độ lỏng lẻo.", "eng": "An impact that jolted the mailbox loose."}, {"viet": "Đứa con một thường phải thui thủi chơi đùa một mình.", "eng": "An only child is often left to his own resources."}, {"viet": "Và Trung Quốc hiện giờ đã có sân bay, đường sắt, và các nhà máy hiện đại bên cạnh các thứ cổ xưa.", "eng": "And in China there now are airports, railroads and modern factories beside the many very old kinds of things."}, {"viet": "Một điểm khác mà bạn phải chú ý khi mua áo quần và giày dép là kích cỡ được đo ở Mỹ khác với cách chúng được đo ở nước chúng ta vì chúng ta sử dụng hệ thống mét.", "eng": "Another point you should pay attention to in buying clothes and shoes is the sizes are measured differently in the U. S. from the way they are in our country where we use the metric system."}, {"viet": "Bị trừng phạt đích đáng vì hành động xấu xa của ai.", "eng": "Aptly punished for one's misdeeds."}, {"viet": "Sáng mai anh sẽ đến tập thể dục chạy bộ không?", "eng": "Are you coming for a jog tomorrow morning?"}, {"viet": "Bạn có chắc là thật sự bạn không thể đi vào ngày mai không?", "eng": "Are you sure you really can't go tomorrow?"}, {"viet": "Với tư cách một nhà văn bà ta được sánh với các tiểu thuyết gia lớn.", "eng": "As a writer she was on a par with the great novelists."}, {"viet": "Được một người có thế lực nhất trong nước bảo trợ, ông ta cầm chắc sự thành công.", "eng": "As the protégé of the most powerful man in the country his success was guaranteed."}, {"viet": "Vào lúc giữa hiệp, hai đội đổi sân.", "eng": "At half-time, the teams change ends."}, {"viet": "Những nỗ lực nhằm cứu vãn được một cái gì trong sự nghiệp chính trị đã sụp đổ của ông ta.", "eng": "Attempts to save something from the wreckage of his political career."}, {"viet": "Là một hình ảnh lu mờ so với bản thân của ai hồi trước.", "eng": "Be a pale reflection of one's former self."}, {"viet": "Xin yên lặng, tôi có điều muốn nói.", "eng": "Be quiet, I've got something to say."}, {"viet": "Trước khi anh thành hình trong bụng mẹ.", "eng": "Before you were a glint in your father's eye."}, {"viet": "Loài chim biết bay theo bản năng.", "eng": "Birds learn to fly by instinct."}, {"viet": "Chấm dứt quan hệ với bạn gái của ai.", "eng": "Break with one's girl-friend."}, {"viet": "Burgundy nổi tiếng về các thứ rượu vang ngon ở đó.", "eng": "Burgundy is celebrated for its fine wines."}, {"viet": "Nhưng chắc chắn đó là bên ngược chiều đối với tôi!", "eng": "But it's sure the wrong side for me!"}, {"viet": "Mua một tấm kính gắn vào khung cửa sổ.", "eng": "Buy a piece of glass to fit the window frame."}, {"viet": "Vào giờ này, hắn đã say bí tỉ rồi.", "eng": "By this time, he was hopelessly pickled."}, {"viet": "Tôi có thể chuyển tiền đi ở đây không?", "eng": "Can I make an outward remittance here?"}, {"viet": "Em có thể tìm trên mạng xem sẽ tốn bao nhiêu tiền cho một gia đình gồm 4 người được không?", "eng": "Can you find out how much it will cost for a family of 4 on the internet?"}, {"viet": "Ông có thể gửi mẫu cho chúng tôi vào ngày mai không?", "eng": "Can you send us a sample tomorrow?"}, {"viet": "Các con bọ hung ăn thịt có thể ăn một con dơi tới mức chỉ còn bộ xương trong vòng vài tiếng đồng hồ.", "eng": "Carnivorous beetles can skeletonize a bat within hours."}, {"viet": "Các hóa học gia nghiên cứu đặc tính của các loại khí.", "eng": "Chemists study the nature of gases."}, {"viet": "Các thường dân kẹt trong thành phố bị vây đã được chở đến nơi an toàn nhờ cầu không vận.", "eng": "Civilians trapped in the beleaguered city have been airlifted to safety."}, {"viet": "Vào tuần tới là cô ta đã thay đổi ý kiến của cô ta rồi.", "eng": "Come next week she'll have changed her mind."}, {"viet": "Anh nên giới hạn sự phê bình của anh trong những vấn đề anh hiểu biết.", "eng": "Confine your criticism to matters you understand."}, {"viet": "Tuần tới tôi đến được chứ?", "eng": "Could I come round next week?"}, {"viet": "Anh có thể dọn bát đĩa ra bàn để chuẩn bị ăn cơm được không?", "eng": "Could you set the table for supper?"}, {"viet": "Các dòng khí nóng giữ cho tàu lượn ở trên cao.", "eng": "Currents of warm air keep the hang-gliders aloft."}, {"viet": "Dốc toàn lực vào công việc của mình.", "eng": "Dedicate oneself to one's work."}, {"viet": "Mặt dù có một số thất bại, công ty chúng ta tựu chung đã có một năm tốt đẹp.", "eng": "Despite some failure, our firm has had quite a good year on balance."}, {"viet": "Bạn có phải mặc đồng phục trong trường trung học không?", "eng": "Did you have to wear a school uniform in your high school?"}, {"viet": "Bệnh tật và sự đào ngũ vẫn gây ra nhiều tổn hại hơn là chiến trận.", "eng": "Disease and desertion still caused much greater wastage than battle."}, {"viet": "Làm điều gì hoàn toàn chỉ vì tư lợi.", "eng": "Do something purely from self-interest."}, {"viet": "Anh có bao giờ đọc những tác phẩm nghiêm túc không?", "eng": "Do you ever read serious works?"}, {"viet": "Ở Mỹ có đủ các tiện nghi thể thao không?", "eng": "Do you have enough sports facilities in the U. S.?"}, {"viet": "Bạn có thích đọc sách không?", "eng": "Do you like to read books?"}, {"viet": "Anh có thực sự tin vào lời dự đoán của hắn về sự thất bại của chính phủ không?", "eng": "Do you take seriously his prediction of a government defeat?"}, {"viet": "Anh có muốn vào xem bên trong không?", "eng": "Do you want to see inside?"}, {"viet": "Cô ấy trông không giống mẹ của cô ấy sao?", "eng": "Doesn't she look like her mother?"}, {"viet": "Đừng có làm lộn xộn giấy tờ để trên bàn giấy của tôi.", "eng": "Don't disturb the papers on my desk."}, {"viet": "Đừng để sự cố đó làm cho chị quá sa sút tinh thần.", "eng": "Don't let the incident let you down too much."}, {"viet": "Đừng quan tâm tới điều nó nói!", "eng": "Don't take any notice of what he says!"}, {"viet": "Jun, bạn không ước ao giàu có ư?", "eng": "Don't you wish that you were rich, Jun?"}, {"viet": "Suốt trong cuộc khủng hoảng các cố vấn an ninh quốc gia của Tổng thống đã tập họp để hội ý.", "eng": "During the crisis the President's national security advisers huddled."}, {"viet": "Những nạn nhân đói khổ mặt mày hốc hác trên truyền hình khiến cho người ta tập trung sự chú ý theo một quan niệm mới trên lục địa.", "eng": "Emaciated famine victims on television focused a new genre of attention on the continent."}, {"viet": "Ngay cả khi còn nhỏ, anh ta cũng hay sai bảo bạn bè.", "eng": "Even as a boy he was always ordering his friends about."}, {"viet": "Giữa nàng và chàng thế là hết.", "eng": "Everything is finished between her and him."}, {"viet": "Kinh phí về việc tu bổ đường sá đã bị cắt giảm đến mức tối thiểu.", "eng": "Expenditure on road repairs has been cut to an irreducible minimum."}, {"viet": "Làm một con búp bê từ một mẩu gỗ.", "eng": "Fashion a doll from a piece of wood."}, {"viet": "Đổ đầy nước vào ly và hoà tan viên thuốc này trong đó.", "eng": "Fill a glass with water and dissolve this tablet in it."}, {"viet": "Năm người chết trong vụ cháy.", "eng": "Five people died in the blaze."}, {"viet": "Cho dù anh ta có nói về xe ô tô thể thao và hồ bơi gì gì đi nữa thì anh ta cũng chỉ là một nhân viên ngân hàng tầm thường mà thôi.", "eng": "For all his talk about sports cars and swimming-pools he's just an ordinary bank-clerk."}, {"viet": "Bốn bữa ăn với giá 10 bảng Anh mỗi người.", "eng": "Four dinners at £ 10 per person."}, {"viet": "Lấy được nhiều cảm tình của các cử tri.", "eng": "Gain the popularity of the voters."}, {"viet": "Đứng dậy đi và làm việc xem nào!", "eng": "Get up on your hind legs and do some work!"}, {"viet": "Lau kỹ những chiếc thìa cho sạch.", "eng": "Give the spoons a good rub to get them clean."}, {"viet": "Quanh đây những thợ điện lành nghề thì hiếm và khó tìm.", "eng": "Good electricians are like gold-dust round here."}, {"viet": "Phải đối xử một cách mềm mỏng với nhà nghệ sĩ tính nết bất thường đó.", "eng": "Had to handle the temperamental artist with kid gloves."}, {"viet": "Đòi đất của một quốc gia khác.", "eng": "Have territorial claims against another country."}, {"viet": "Bạn có bao giờ kiếm được tiền nhờ vào thị trường chứng khoán chưa?", "eng": "Have you ever made any money on the stock market?"}, {"viet": "Anh có nhớ mua cho mẹ anh một món quà nhân ngày sinh nhật không?", "eng": "Have you remembered to get your mother a birthday present?"}, {"viet": "Anh ta là con người kín đáo: anh ta kiếm được cả một tài sản lớn mà chẳng ai biết.", "eng": "He's a bit of a dark horse: he was earning a fortune, but nobody knew."}, {"viet": "Anh ta ăn nằm với nhiều cô gái quá nên không nhớ xuể.", "eng": "He's bedded more girls than he can remember."}, {"viet": "Bây giờ anh ta để kiểu tóc theo kiểu da đen, tôi không nhận ra anh ta nữa.", "eng": "He's got his hair in a fro now, I hardly recognized him."}, {"viet": "Anh ấy đã đem cầm chiếc nhẫn cưới của mẹ anh ấy.", "eng": "He's pledged his mother's wedding ring."}, {"viet": "Ông ấy được thông báo đầy đủ về các phát triển mới nhất trong ngành công nghiệp.", "eng": "He's well up in all the latest developments in the industry."}, {"viet": "Anh ta đã biên soạn lại nhiều bài dân ca cổ truyền cho đàn piano.", "eng": "He arranged many traditional folk songs for the piano."}, {"viet": "Hắn chống chân vào tường và nhảy qua.", "eng": "He braced his foot against the wall and jumped."}, {"viet": "Hắn đưa mắt liếc trộm cô ta.", "eng": "He cast a furtive glance at her."}, {"viet": "Hắn không trả nổi tiền nhà nên hắn phải dọn đi.", "eng": "He couldn't pay his rent, so he had to move out."}, {"viet": "Anh ta đã không có bạn gái cho tới khi 18 tuổi, nhưng bây giờ anh ta đang tranh thủ để bù vào thời gian đã mất.", "eng": "He didn't have a girl-friend till was 18, but now he's making up for lost time."}, {"viet": "Anh ta kiếm được 10.000 bảng Anh một năm.", "eng": "He earns £ 10,000 a year."}, {"viet": "Anh ấy cảm thấy một cảm giác đau ở hốc bụng.", "eng": "He felt an aching feeling in the pit of his stomach."}, {"viet": "Ông ta trả lời cô ấy một câu cộc lốc.", "eng": "He gave her a short answer."}, {"viet": "Anh ấy giận đến nỗi không còn tự chủ được.", "eng": "He got so angry that he lost control of himself."}, {"viet": "Hắn trơ trẽn yêu cầu tôi làm việc của hắn.", "eng": "He had the cheek to ask me to do his work."}, {"viet": "Anh ta có chiều hướng phát phì.", "eng": "He has an inclination to stoutness."}, {"viet": "Anh ấy có khái niệm mơ hồ là muốn thay đổi thế giới.", "eng": "He has some abstract notion of wanting to change the world."}, {"viet": "Ông ta phải chịu sự ác cảm của mọi người vì đã đuổi ông già quản gia.", "eng": "He incurred the odium of everyone by sacking the old caretaker."}, {"viet": "Ông ấy ít được người ta biết là một nghệ sĩ.", "eng": "He is little known as an artist."}, {"viet": "Ông ta không giống ông chủ đầu tiên của tôi chút nào.", "eng": "He isn't anything like my first boss."}, {"viet": "Ông ta bỏ công việc văn phòng để thử kiếm sống bằng nghề nông.", "eng": "He left his office job to try to make a living on the land."}, {"viet": "Nó trông có vẻ khả nghi đấy-anh có nghĩ là hắn dò xét tụi mình.", "eng": "He looks suspicious-do you think he's rumbled us."}, {"viet": "Nhân tiện anh ấy có nói rằng anh ấy sắp đi xa.", "eng": "He mentioned en passant that he was going away."}, {"viet": "Ông ấy khai mạc hội nghị bằng một bài diễn văn.", "eng": "He opened the conference with a speech."}, {"viet": "Nó vớ ngay cơ hội đầu tiên để thông báo.", "eng": "He pounced at the first opportunity to inform."}, {"viet": "Anh ta gửi tất cả tiền bạc vào ngân hàng.", "eng": "He put the whole of his money into the bank."}, {"viet": "Ông ấy từ chối xem xét đề nghị của chúng tôi.", "eng": "He refused to entertain our proposal."}, {"viet": "Ông ta 94 tuổi và đầu óc bắt đầu lẫn.", "eng": "He's 94 and his mind is going."}, {"viet": "Anh ta lúc nào cũng khoe khoang cái xe mới của mình.", "eng": "He's been bragging about his new car."}, {"viet": "Anh ta vừa bắt đầu một công việc mới.", "eng": "He's just started a new job."}, {"viet": "Ông ấy là một người chồng lý tưởng đối với bà ta.", "eng": "He's the ideal husband for her."}, {"viet": "Anh ta đã đưa tiễn nàng ra cửa.", "eng": "He saw her to the door."}, {"viet": "Anh ta đã thay đổi khỏi tư thế nằm ngang.", "eng": "He shifted his position from the horizontal."}, {"viet": "Nó vồ quả bóng nhưng không bắt được.", "eng": "He snatched at the ball but did not catch it."}, {"viet": "Anh ta khởi nghiệp với một nhà máy nhỏ và bây giờ anh ta là chủ của một thế lực công nghiệp khổng lồ.", "eng": "He started off with the small factory, and now he's the head of a huge industrial empire."}, {"viet": "Ông ta đã mất uy tín, khi vụ bê bối được công bố.", "eng": "He suffered a loss of prestige when the scandal was publicized."}, {"viet": "Anh ta nghĩ cẩn thận về quyết định đó vì anh ta biết tương lai của anh ta đang gặp nguy hiểm.", "eng": "He thought very carefully about the decision because he knew his future was at stake."}, {"viet": "Anh ta làm hư hỏng toàn bộ chiếc xe hơi mới của mình trong một tai nạn.", "eng": "He totaled his new car in the accident."}, {"viet": "Anh ta gạch dưới chữ kí một đường nét hoa văn nho nhỏ.", "eng": "He underlined his signature with a little flourish."}, {"viet": "Anh ta muốn mở rộng kiến thức của mình về công nghiệp.", "eng": "He wants to widen his knowledge of the industry."}, {"viet": "Ông ta bị chấn thương nặng trong vụ đụng xe.", "eng": "He was badly concussed in the collision."}, {"viet": "Anh ta tỏ ra hết sức hối lỗi về việc đến muộn của mình.", "eng": "He was deeply apologetic about his late arrival."}, {"viet": "Tin đó làm hắn mừng khôn xiết.", "eng": "He was greatly cheered by the news."}, {"viet": "Anh ấy sẽ không bao giờ gặp lại vợ.", "eng": "He was never to see his wife again."}, {"viet": "Nó chạy băng qua các đường phố.", "eng": "He was running through the streets."}, {"viet": "Anh ấy được huy chương bạc chạy 800m.", "eng": "He was the silver medallist in the 800 metres."}, {"viet": "Ông ấy tiếp đón chúng tôi nhiệt thành.", "eng": "He welcomed us with open arms."}, {"viet": "Anh ta giật mình thức dậy.", "eng": "He woke up with a start."}, {"viet": "Các giáo viên chủ nhiệm làm nhiều công việc hành chính hơn là việc giảng dạy.", "eng": "Head teachers are more involved in administration than in teaching."}, {"viet": "Lời khuyên của cô ấy thật là hữu ích.", "eng": "Her advice was a great help."}, {"viet": "Hành động hư đốn của đứa con làm cô ấy lo lắng.", "eng": "Her child's bad behaviour troubled her."}, {"viet": "Sự khuyến khích của cô ta cho tôi một cảm giác lên tinh thần mạnh mẽ.", "eng": "Her encouragement gave me a great sense of uplift."}, {"viet": "Mái tóc của cô ấy buông xoã trên vai.", "eng": "Her hair flopped over her shoulders."}, {"viet": "Trò chọc cười của cô ta mà tái lại lần nữa thì thật là vô duyên.", "eng": "Her joke doesn't bear repeating."}, {"viet": "Tên tuổi của cô ta sẽ giúp cuốn phim ăn khách.", "eng": "Her name will help to sell the film."}, {"viet": "Sự hãnh diện của cô ta về các thành tựu của mình là chính đáng.", "eng": "Her pride in her achievements is justified."}, {"viet": "Niềm tin vào chủ nghĩa xã hội của cô ta bắt nguồn từ sự căm ghét bất công.", "eng": "Her socialist beliefs were born of a hatred of injustice."}, {"viet": "Tiếng cô ta làm chói tai tôi.", "eng": "Her voice jangles on my ear."}, {"viet": "Của ông đây, hai bản ghi nhớ đổi tiền này cho việc đổi tiền này cho việc giao dịch vừa được thự hiện: một dành cho việc chuyển đổi tiền giấy yên và cái kia dành cho ngân phiếu tiền yên.", "eng": "Here you are, these two exchange memos for the transactions just made: one is for the conversion of yen notes and the other for yen cheques."}, {"viet": "Những lý lẽ của anh ấy dựa trên một cơ sở kinh tế học vững vàng.", "eng": "His arguments had a sound economic base."}, {"viet": "Sự nghiệp của anh ta là một sự thất bại hoàn toàn.", "eng": "His career is a story of utter disaster."}, {"viet": "Những thành tích của ông đã trở thành huyền thoại.", "eng": "His deeds have passed into legend."}, {"viet": "Mặt anh ấy trang nghiêm khi kể cho họ nghe về tai nạn.", "eng": "His face was grave as he told them about the accident."}, {"viet": "Tóc của anh ấy vàng như gừng.", "eng": "His hair was a bright shade of ginger."}, {"viet": "Hai đầu gối của hắn lại làm thủng quần bò của hắn nữa rồi.", "eng": "His knees have gone through his jeans again."}, {"viet": "Cả hai bố mẹ anh ấy đều là bác sĩ.", "eng": "His mother and father are both doctors."}, {"viet": "Sự kiên trì của nó đã được đền đáp khi cuối cùng xe ô tô nổ máy được.", "eng": "His persistence was rewarded when the car finally started."}, {"viet": "Việc nghiên cứu về tên lửa của ông ta đã mở đường cho du hành vũ trụ.", "eng": "His research in rocketry blazed the way for space travel."}, {"viet": "Cái mạnh của anh ta khi làm phát thanh viên là do anh đã được đào tạo làm một nhà báo.", "eng": "His strength as a news-reader lies in his training as a journalist."}, {"viet": "Khi anh ta cố gắng nói, giọng anh ta ấp úng.", "eng": "His voice faltered as he tried to speak."}, {"viet": "Duỗi thẳng tay cầm lấy cái gì.", "eng": "Hold something at arm's length."}, {"viet": "Giá nhà cửa cứ liên tục tăng và giảm nhưng cuối cùng cũng sẽ ổn định.", "eng": "House prices keep rising and falling but they will eventually even out."}, {"viet": "Làm sao anh có thể đánh lừa gia đình mình như vậy? Anh không có những tiêu chuẩn đạo đức nào cả hay sao?", "eng": "How can you cheat your own family like that? Haven't you got any morals at all?"}, {"viet": "Làm thế nào chúng ta ngăn chặn các vụ hỏng máy liên tục này?", "eng": "How do we prevent these continual break-downs?"}, {"viet": "Lần cuối cùng anh gặp cô ta cách đây bao lâu?", "eng": "How long ago is it that you last saw her?"}, {"viet": "Hải trình từ Hull đến Olso mất bao nhiêu ngày?", "eng": "How many days'sail is it from Hull to Olso?"}, {"viet": "Mỗi ngày bạn uống bao nhiêu cà phê?", "eng": "How much coffee do you drink every day?"}, {"viet": "Đứa con lớn nhất của bạn bao nhiêu tuổi?", "eng": "How old is your eldest child?"}, {"viet": "Tìm kiếm các tài liệu tham khảo trong thư viện.", "eng": "Hunt up references in the library."}, {"viet": "Tôi muốn gọi cuộc gọi người nghe trả tiền đến Tokyo, Nhật Bản.", "eng": "I'd like to make a collect call to Tokyo, Japan."}, {"viet": "Tôi sẽ đón bạn lúc 6 giờ hơn.", "eng": "I'll come and pick you up a little after six."}, {"viet": "Tôi sẽ ngâm tôm mọi việc một tuần lễ để xem điều gì xảy ra.", "eng": "I'll let things ride for a week and see what happens."}, {"viet": "Tôi hơi nghễnh ngãng-xin ông phát âm thật rõ ràng rành mạch cho.", "eng": "I'm a little deaf-please articulate carefully."}, {"viet": "Tôi rất vui được gặp ông thưa ông Goodman.", "eng": "I'm delighted to meet you, Mr. Goodman."}, {"viet": "Tôi đi cùng đường với anh vì thế tôi có thể cho anh đi nhờ xe.", "eng": "I'm going your way so I can give you a lift."}, {"viet": "Tôi sẽ không đi đến phòng disco, đơn giản là nó không đúng sở thích của tôi.", "eng": "I'm not going to the disco: it's just not my scene."}, {"viet": "Tôi lấy làm tiếc, công việc đó vừa có người làm rồi.", "eng": "I'm sorry, but the position has just been filled."}, {"viet": "Chốc nữa tôi sẽ đưa bọn trẻ đi bơi.", "eng": "I'm taking the children swimming later."}, {"viet": "Tôi đã thu xếp cho xe hơi ( đón anh ở sân bay ).", "eng": "I've arranged for a car ( to meet you at the airport )."}, {"viet": "Tôi đã chậm trả lời thư từ.", "eng": "I've fallen behind with my correspondence."}, {"viet": "Tôi đã biết anh ta nhiều năm nay, nhưng anh ta vẫn là điều gì đó bí hiểm đối với tôi.", "eng": "I've known him for many years, but he remains something of an enigma to me."}, {"viet": "Tôi đã bảo cậu bao nhiêu lần rồi là đến muộn thì gọi điện cho tôi.", "eng": "I've told you umpteen times to call me if you are going to be late."}, {"viet": "Tôi luôn có rượu trong nhà nhưng hoàn toàn là vì lí do y học.", "eng": "I always keep brandy in the house, but purely for medicinal purpose."}, {"viet": "Tôi rất khó xử về việc nó không trả lời thư tôi.", "eng": "I am puzzled by his failure to reply."}, {"viet": "Tôi cam đoan với anh rằng đi với chúng tôi họ sẽ an toàn tuyệt đối.", "eng": "I assure you they'll be perfectly safe with us."}, {"viet": "Tôi tới nhà nhưng không có ai ở nhà.", "eng": "I called at your house but there was no one around."}, {"viet": "Tôi không thể giúp anh vào lúc này-tôi đã có quá nhiều việc phải giải quyết.", "eng": "I can't help you at the moment-I've far too much on my plate already."}, {"viet": "Tôi có thể đảm bảo với anh là chúng tôi sẽ rất công bằng với anh nếu đơn xin của anh được chấp nhận.", "eng": "I can assure you that we'll be fair to you if your application is accepted."}, {"viet": "Tôi không tài nào nhớ nổi tên cô ta.", "eng": "I cannot for the life of me remember her name."}, {"viet": "Tôi đã kiểm tra mọi chi tiết trong công trình nghiên cứu của cô ấy.", "eng": "I checked every detail of her research."}, {"viet": "Tôi không thể dùng loại tái được.", "eng": "I couldn't eat it rare."}, {"viet": "Tôi suy nghĩ một lúc rồi quyết định không đi.", "eng": "I debated it for a while, then decided not to go."}, {"viet": "Tôi không nghĩ là chúng ta đã đi xa được thế này.", "eng": "I didn't think we'd get this far."}, {"viet": "Tôi không biết nhiều về khả năng của bác sĩ nhưng ông ấy có thái độ đối với bệnh nhân rất tốt ( dịu dàng ).", "eng": "I don't know much about the doctor's ability but he's got a very good ( sweet ) bedside manner."}, {"viet": "Tôi cho rằng anh ta không có đủ sự tận tuỵ để tiếp tục đi đến cùng.", "eng": "I don't think he's sufficiently dedicated to stay the course."}, {"viet": "Tôi không muốn nói điều đó qua điện thoại.", "eng": "I don't want to say it over the telephone."}, {"viet": "Tôi không hiểu tiếng Anh tốt lắm.", "eng": "I don't understand English very well."}, {"viet": "Tôi cảm thấy ngượng vì đã lâu không viết thư.", "eng": "I feel ashamed that I haven't written for so long."}, {"viet": "Rốt cuộc tôi chợt hiểu được sự thật là tôi đã bị lường gạt.", "eng": "I finally tumbled to the reality that I was being cheated."}, {"viet": "Tôi đã cho con chó mấy miếng thịt ngon mà nó lại chẳng thèm ngó ngàng đến!", "eng": "I gave the dog some lovely steak, and he just looked down his nose at it!"}, {"viet": "Tôi cho là chúng tôi sẽ đem cho.", "eng": "I guess we just give them away."}, {"viet": "Tôi phải hỏi thầy giáo sau đó phải làm gì.", "eng": "I had to ask the teacher what to do next."}, {"viet": "Tôi có một lợi tức nhỏ từ những cổ phần là chỗ dựa của tôi nếu công việc kinh doanh của tôi bị thất bại.", "eng": "I have a small income from shares, which is my sheet anchor if my business should fail."}, {"viet": "Tôi không biết gì về tiền vay và chiết khấu.", "eng": "I have no idea of loan and discount."}, {"viet": "Bố cũng phải nghĩ đến những chuyện tốt đẹp xảy ra nữa.", "eng": "I have to think about the good things that happen, too."}, {"viet": "Tôi nghe nói điều đó thật sự thú vị đấy.", "eng": "I hear it's really terrific."}, {"viet": "Tôi hy vọng rằng đây chẳng phải là lợi dụng anh, nhưng tôi có thể ở lại dùng bữa cơm được chăng?", "eng": "I hope it's not imposing on you, but could I stay to dinner?"}, {"viet": "Tôi đã nhân danh bà ấy can thiệp để tìm cách làm thay đổi quyết định đó.", "eng": "I intervened on her behalf to try and get the decision changed."}, {"viet": "Tôi biết nhiều phụ nữ được cả sự nghiệp lẫn gia đình-Alison chẳng hạn.", "eng": "I know many women who have a career and a family-Alison for example."}, {"viet": "Tôi thích đi dạo loanh quanh ở nông thôn.", "eng": "I like rambling about in the country."}, {"viet": "Chiều nay tôi sẽ gọi lại.", "eng": "I'll call up again this afternoon."}, {"viet": "Tôi sẽ kiểm tra để việc đó được hoàn tất.", "eng": "I'll see that it's done."}, {"viet": "Tôi e rằng chúng ta sắp gặp bão.", "eng": "I'm afraid we're in for a storm."}, {"viet": "Tôi hơi kẹt về tài chính.", "eng": "I'm in a bit of a spot financially."}, {"viet": "Tôi lấy làm tiếc, hiện giờ ông ấy không có ở đây.", "eng": "I'm sorry, he's not in right now."}, {"viet": "Tôi đã trù liệu buộc anh ta phải gặp chúng ta sau giờ làm việc.", "eng": "I managed to pin him down to meeting us after work."}, {"viet": "Tôi phải giúp họ-họ là những người cùng máu mủ với tôi.", "eng": "I must help them-they're my own flesh and blood."}, {"viet": "Tôi không hề nghĩ tới chuyện có thể thất bại.", "eng": "I never consider the possibility of defeat."}, {"viet": "Tôi nghe lỏm được vài nhận xét độc địa về chồng tôi.", "eng": "I overheard some cruel remarks about my husband."}, {"viet": "Tôi khá thích loại nhạc ôpêra.", "eng": "I quite like some opera music."}, {"viet": "Tôi xem đồng hồ để biết giờ chính xác.", "eng": "I referred to my watch for the exact time."}, {"viet": "Đêm qua tôi đã coi một cuốn phim thật tuyệt.", "eng": "I saw great movie last night."}, {"viet": "Tôi sẽ tắm nước nóng rồi đi ngủ.", "eng": "I shall have a hot bath and go to bed."}, {"viet": "Tôi nhanh chóng hiểu ra ai đã kể cho chúng biết.", "eng": "I soon twigged who had told them."}, {"viet": "Tôi thề có Chúa rằng chứng cớ tôi sẽ đưa ra...", "eng": "I swear by Almighty God that the evidence I shall give..."}, {"viet": "Tôi nghĩ là tôi mắc bệnh truyền nhiễm.", "eng": "I think I've caught a bug."}, {"viet": "Tôi nghĩ chúng ta nên đi thôi.", "eng": "I think we should be toddling along."}, {"viet": "Con đã nói với mẹ là những thứ này nặng lắm.", "eng": "I told you these things are heavy."}, {"viet": "Tôi hiểu điều ông đang cố gắng nói.", "eng": "I understand what you are trying to say."}, {"viet": "Tao không muốn nghe một lời láo xược nào của mày!", "eng": "I want none of your cheek!"}, {"viet": "Tôi muốn mặc thử một vài cái.", "eng": "I want to try some of them on."}, {"viet": "Điều đó được thực hiện với những ý định tốt nhất.", "eng": "I was done with the best of intentions."}, {"viet": "Vừa lúc mình sắp đi ngủ thì cậu gọi điện đến.", "eng": "I was on the point of going to bed when you rang."}, {"viet": "Tôi rung động trước vẻ đẹp của cô ấy.", "eng": "I was thrilled by her beauty."}, {"viet": "Tôi sẽ làm tất cả những gì trong quyền hạn của tôi để giúp bạn.", "eng": "I will do everything in my power to help you."}, {"viet": "Tôi sẽ không để bị hăm doạ mà chấp nhận đề nghị của anh.", "eng": "I won't be browbeaten into accepting your proposals."}, {"viet": "Tôi làm thư ký, hay nói cho đúng hơn làm một nhân viên đánh máy.", "eng": "I worked as a secretary, or rather, a typist."}, {"viet": "Tôi muốn gửi lá thư này đến Hồng Kông.", "eng": "I would like to send this letter to Hong Kong."}, {"viet": "Băng đã khiến cho con đường này trở nên trơn trượt khó đi.", "eng": "Ice made the path slippery underfoot."}, {"viet": "Nếu tôi chộp được anh đang lừa gạt nữa thì anh sẽ bị rắc rối đấy nhé.", "eng": "If I cop you cheating again you'll be in trouble."}, {"viet": "Nếu cô ta thắng cô ta rất sung sướng.", "eng": "If she wins, it'll make her day."}, {"viet": "Nếu chúng ta đến quá sớm chúng ta sẽ phải đợi.", "eng": "If we come too soon, we'll have to wait."}, {"viet": "Nếu anh đủ khả năng sắm xe hơi thì hẳn là anh có thể mua xe đạp.", "eng": "If you can afford a car then, afortiori, you can afford a bicycle."}, {"viet": "Nếu anh có vấn đề khó khăn gì về tài chính, hãy nói cho cơ quan biết.", "eng": "If you have any financial problems, please tell the staff."}, {"viet": "Nếu anh tập luyện chăm chỉ, anh sẽ trở thành một cầu thủ bóng đá giỏi.", "eng": "If you train hard, you'll make a good footballer."}, {"viet": "Trong'the open door','open'là một tính từ hạn định mô tả'door'.", "eng": "In'the open door','open'is an adjective qualifying'door'."}, {"viet": "Trong những cuộc trưng bày chó ngày nay, hàng trăm loài chó, hoặc giống chó, được triển lãm.", "eng": "In dog shows today dogs of more than a hundred kinds, or breeds, are shown."}, {"viet": "Trong nhiều gia đình Việt Nam, tài chính do người vợ quản lí.", "eng": "In many Vietnamese homes, the funds are administered by the wife."}, {"viet": "Khi cúi người xuống, anh ta bị trượt và bị thương ở lưng.", "eng": "In the act of bending down, he slipped and hurt his back."}, {"viet": "Ở Hoa Kỳ những con chó sau đây đã được nổi tiếng vào những thời kỳ khác nhau kể từ năm 1900: chó Bernard, chó săn lông xù Anh, chó Cô-li, chó sục Boston; Airedale, chó chăn cừu Đức và chó cốc Span-hơn.", "eng": "In the United States these dogs have been the most popular at one time or another since 1900: St. Bernard, English setter, collie, Boston terrier, Airedale, German shepherd, and cocker spaniel."}, {"viet": "Công nghiệp phải được hướng vào việc phục vụ các nhu cầu thời chiến.", "eng": "Industry must be geared to wartime needs."}, {"viet": "Đến đường Park có lâu không?", "eng": "Is it a long ride to Park Street?"}, {"viet": "Có một cách lựa chọn nào đáng tin cậy trước sự đe doạ hạt nhân không?", "eng": "Is there a credible alternative to the nuclear deterrent?"}, {"viet": "Cô ấy chẳng có một nguồn sinh sống nào rõ ràng.", "eng": "Is without any visible means of support."}, {"viet": "Thị trường khan hiếm về loại xe hơi kiểu xưa.", "eng": "It's a seller's market for Vintage cars."}, {"viet": "Thời tiết khác hơn ở Nhật, nó không ẩm ướt.", "eng": "It's different than in Japan, it's not humid."}, {"viet": "Không thể biết trước chuyện gì sẽ xảy ra.", "eng": "It's impossible to know in advance what will happen."}, {"viet": "Làm cho nó nói không khó, vấn đề là làm thế nào cho nó đừng nói!", "eng": "It's not hard to get him talking, the problem is stopping him!"}, {"viet": "Kiểm tra hành lý ở sân bay là chuyện bình thường.", "eng": "It's standard practice to check luggage at airports."}, {"viet": "Rất hoan nghênh tinh thần tương thân tương ái của anh khi anh tình nguyện dẫn người già đi cửa hàng mỗi tuần.", "eng": "It's very public-spirited of you to offer to take the old people to the shops each week."}, {"viet": "Cuối cùng ( tôi đã thấy ) rõ ràng là nó đã nói dối.", "eng": "It finally dawned ( on me ) that he had been lying."}, {"viet": "Thật khó mà hiểu nghĩa một từ khi tách nó ra khỏi mạch văn.", "eng": "It is difficult to say what the meaning of a word when it's out of the context."}, {"viet": "Có thể hiểu sai những từ này.", "eng": "It is possible to put a misconstruction on these words."}, {"viet": "Có lẽ đã nhiều năm rồi chúng ta mới gặp lại nhau.", "eng": "It may be many years before we meet again."}, {"viet": "Thật khó để chúng tôi quyết định.", "eng": "It's hard for us to decide."}, {"viet": "Không đồng ý ly hôn với Ann thì thật là ngu ngốc, nếu đó là điều cô ta thật sự muốn.", "eng": "It seems foolish not to give Ann her freedom, if that's what she really wants."}, {"viet": "Điều khá kỳ lạ là hoá ra chúng tôi đã cùng học với nhau.", "eng": "It turned out we'd been at school together, strangely enough."}, {"viet": "Anh thật là bất lịch sự đã không cảm ơn anh ấy.", "eng": "It was discourteous of you not to thank him."}, {"viet": "Chính cô ấy là người đầu tiên đã đưa tôi tới những thích thú của việc thưởng thức rượu.", "eng": "It was she who first introduced me to the pleasures of wine-tasting."}, {"viet": "Không thể có cái gì được nghiền mịn hơn cái này.", "eng": "It won't grind down any finer than this."}, {"viet": "Jane đã viết một bức thư cho một tờ báo, bức thư này có một số luận điệu gây sửng sốt.", "eng": "Jane wrote a letter to a newspaper, this letter contained some startling allegations."}, {"viet": "Quyền sở hữu, trách nhiệm, bàn bạc chung.", "eng": "Joint ownership, responsibility, consultation."}, {"viet": "Kei đã đạt được điểm tối đa trong bài kiểm tra toán.", "eng": "Kei got a 100% on the math test."}, {"viet": "Chúng ta cần phải thừa nhận rằng dù làm bất cứ cái gì đi nữa chúng ta cũng sẽ không thắng.", "eng": "Let's face it, we won't win whatever we do."}, {"viet": "Chúng ta hãy trò chuyện thêm một lát nữa đi.", "eng": "Let's talk for a little while longer."}, {"viet": "Nhiều sinh viên tốt nghiệp nôn nóng muốn trở thành giám đốc.", "eng": "Many graduates are impatient to become managers."}, {"viet": "Marianne Welch, con gái của tiểu thuyết gia lừng danh Henry Welch.", "eng": "Marianne Welch, daughter of famed novelist Henry Welch."}, {"viet": "Xin vui lòng cho tôi biết số điện thoại của ông ấy?", "eng": "May I have his telephone number, please?"}, {"viet": "Có lẽ bạn sẽ muốn đi cùng với chúng tôi vào ngày mai.", "eng": "Maybe you would like to join us tomorrow."}, {"viet": "Hầu hết mọi người đều đi nghỉ vào tháng bảy và tháng tám.", "eng": "Most people go on holiday in July and August."}, {"viet": "Nhẹ nhõm cho tôi biết bao, tôi đã không đến muộn.", "eng": "Much to my relief, I wasn't late."}, {"viet": "Các ngăn kéo của tôi là nơi cất giữ mọi giấy tờ.", "eng": "My drawers are repositories for all papers."}, {"viet": "Công việc của tôi vất vả nhưng cũng có những cái bù đắp lại.", "eng": "My job is hard, but it has its compensations."}, {"viet": "Da đầu tôi có cảm giác đau nhói khi tôi nhận ra sự thật khủng khiếp.", "eng": "My scalp began to prickle as I realized the horrible truth."}, {"viet": "Tất nhiên anh phải nói chuyện với bố mẹ anh trước khi anh quyết định.", "eng": "Naturally you must talk to your parents before you decide."}, {"viet": "Việc hộ lí trực đêm đã làm cô ta quen ngủ ban ngày.", "eng": "Night nursing habituated her to sleeping in daylight."}, {"viet": "Chẳng sao, chính tôi sẽ tự làm lấy.", "eng": "No matter, I'll do it myself."}, {"viet": "Thỉnh thoảng anh ta trở nên lơ đãng và rơi vào yên lặng.", "eng": "Now and then he would become absent-minded and lapse into silence."}, {"viet": "Từ tháng Mười đến tháng Hai là mùa săn gà lôi ở Anh.", "eng": "October to February is the open season for pheasants in Britain."}, {"viet": "Ôi, thôi rồi, có một vết bẩn trên áo của bạn.", "eng": "Oh no, there is a stain on your blouse."}, {"viet": "Ngày cuối học kì một không khí say sưa và nhẹ nhõm.", "eng": "On the last day of term there was a heady atmosphere of excitement and relief."}, {"viet": "Một trong những thuận lợi của phương pháp này là ở chỗ nó tiết kiệm được nhiều nhiên liệu.", "eng": "One of the advantages of this method is that it saves a lot of fuel."}, {"viet": "Cầu thủ hay nhất của chúng tôi đã phải ra ngoài vì bị thương.", "eng": "Our best player has been sidelined by injury."}, {"viet": "Trái tim của chúng tôi hướng về những người thân của nạn nhân.", "eng": "Our hearts go out to relatives of the victims."}, {"viet": "Nghiên cứu của chúng ta cho thấy có một thị trường lớn đầy tiềm năng cho các sản phẩm mới của chúng ta.", "eng": "Our research shows there's a great potential market for our new products."}, {"viet": "Hàng hóa mang nhãn của cửa hàng thường rẻ.", "eng": "Own brand goods are often cheaper."}, {"viet": "Việc trả lương có thể rải đều theo hàng tháng trong suốt năm.", "eng": "Payments can be evened out on a monthly basis over the year."}, {"viet": "Tưới nước đẫm cho cây tươi tốt lên.", "eng": "Perk up the plants with a good watering."}, {"viet": "Tinh thần cảnh giác của cảnh sát cuối cùng đã được đền bù, thí dụ sau khi đã bắt được một vụ.", "eng": "Police vigilance was eventually rewarded."}, {"viet": "Trong tiếng Nhật, sachiko có nghĩa là \"đứa trẻ hạnh phúc\".", "eng": "Sachiko means \"happy child\" in Japanese."}, {"viet": "Do uống rượu nhiều, giọng nói của nó trở nên lè nhè.", "eng": "Several drinks had thickened his voice."}, {"viet": "Cô ta thật là người khó hiểu hoàn toàn, ngay cả đối với cha mẹ của nàng.", "eng": "She's a complete riddle, even to her parents."}, {"viet": "Bà ấy được chọn để lãnh đạo uỷ ban kế hoạch.", "eng": "She's been picked to head the planning committee."}, {"viet": "Cô ta ngồi trước ngọn lửa.", "eng": "She's installing herself in front of the fire."}, {"viet": "Cô ấy thực sự bắt tay vào công việc mới của cô ấy.", "eng": "She's really buckling down to her new job."}, {"viet": "Cô ấy chấp nhận hợp đồng với điều khoản là nó sẽ được xét lại sau một năm.", "eng": "She accepted the contract with the provision that it would be revised after a year."}, {"viet": "Trong kì thi kiểm tra cô ta đã nỗ lực hết sức.", "eng": "She bears her brains out during the examination."}, {"viet": "Bà ấy tự nhận là dòng dõi hoàng tộc.", "eng": "She claims to be descended from royalty."}, {"viet": "Sau khi giành được học vị thứ nhất, cô ta quyết định tiếp tục học tập.", "eng": "She decided to pursue her studies after obtaining her first degree."}, {"viet": "Cô ta cứ mơ mộng vẩn vơ hết cả đời, chẳng bao giờ thật sự làm được cái gì.", "eng": "She dreamt her life away, never really achieving anything."}, {"viet": "Cô ta cứ nghịch mãi cái đồng hồ thành ra đánh vỡ nó.", "eng": "She fiddled with her watch so much that it broke."}, {"viet": "Bà ta luôn luôn than phiền chồng.", "eng": "She goes on at her husband continually."}, {"viet": "Cô ta căng thẳng quá vì chuyến đi cắm trại đến nỗi quên cả túi ngủ.", "eng": "She had psyched herself up so much for the camping trip that she forget her sleeping bag."}, {"viet": "Cô ấy đem lại chút vui tươi cho cuộc đời tôi.", "eng": "She has brought some sunshine into my life."}, {"viet": "Cô ấy vẫn giữ kỷ lục thế giới về nhảy xa.", "eng": "She holds the world record for the long jump."}, {"viet": "Bà ta hãnh diện một cách dễ hiểu về tài nấu ăn tuyệt vời của bà.", "eng": "She is pardonably proud of her wonderful cooking."}, {"viet": "Cô ấy bẻ gãy lý lẽ của chúng tôi.", "eng": "She knocked the bottom out of our argument."}, {"viet": "Cô ấy nhìn qua quyển sách cho tới khi cô ấy tìm thấy trang mình cần tìm.", "eng": "She looked through the book until she found the page she wanted."}, {"viet": "Cô ấy phải là thiên tài, hệ số thông minh của cô ấy là 160.", "eng": "She must be a genius, her intelligence quotient is 160."}, {"viet": "Cô ấy chất các hộp cái nọ lên trên cái kia.", "eng": "She piled the boxes on top of each other."}, {"viet": "Cô ấy thực hiện được hoài bão của mình trở thành người lái xe đua.", "eng": "She realized her ambition to become a racing driver."}, {"viet": "Cô ta luôn trang điểm lòe loẹt.", "eng": "She's always very heavily made up."}, {"viet": "Cô ấy được cho biết rõ về chính trị.", "eng": "She's really clued up on politics."}, {"viet": "Cô ấy đã thắng anh ta bằng cách trích dẫn lại lời phát biểu lúc trước của anh.", "eng": "She scored against him by quoting his earlier statement."}, {"viet": "Cô ta giận sôi sùng sục một hai phút rồi không nhịn được và bắt đầu hét ầm lên.", "eng": "She simmered for a minute or two, then began shouting uncontrollably."}, {"viet": "Cô ta đứng ngay giữa đường.", "eng": "She stood bang in the middle of the road."}, {"viet": "Cô ta xem việc đi bộ ba mươi dặm một ngày là chuyện bình thường.", "eng": "She thinks of nothing of walking thirty miles a day."}, {"viet": "Cô ấy xoắn một lọn tóc quanh ngón tay mình.", "eng": "She twirled a strand of hair round her finger."}, {"viet": "Cô ấy có thể để dành vì cách thức căn cơ của cô ấy.", "eng": "She was able to save because of her frugal ways."}, {"viet": "Những lời nhục mạ của hắn làm cô ta tê điếng cả người.", "eng": "She was cut to the quick by his insults."}, {"viet": "Cô ta không có lỗi gì hết.", "eng": "She was in no way to blame."}, {"viet": "Nàng rất kiên quyết là sẽ không đến.", "eng": "She was quite adamant that she would not come."}, {"viet": "Người ta cho cô ấy biết là cô ấy không thể có thai.", "eng": "She was told she couldn't conceive."}, {"viet": "Cô ấy để tang chồng vừa mất.", "eng": "She went into mourning upon her husband's death."}, {"viet": "Cô ta mặc một chiếc áo đầm có in hoa hồng.", "eng": "She wore a dress with a pattern of roses on it."}, {"viet": "Tàu thủy qua lại đều đặn vùng biển Nam Hải.", "eng": "Ships that ply across the South China Sea."}, {"viet": "Ra dấu cho người nào đi đến chỗ nào.", "eng": "Sign to somebody where to go."}, {"viet": "Situation là một từ quá sáo mòn.", "eng": "Situation is a word that is greatly overworked."}, {"viet": "Khói sương lơ lửng trên bầu trời thành phố.", "eng": "Smog hung in the sky over the city."}, {"viet": "Vì vậy nghĩa của Renbimbi là ‘ tiền tệ của nhân dân'.", "eng": "So the meaning of ‘ Renminbi'means people's currency'."}, {"viet": "Một số gia súc bị một người cưỡi ngựa lùa đi.", "eng": "Some cattle being driven by a man on a horse."}, {"viet": "Thôi nào tôi sẽ giới thiệu bạn với cô gái đẹp nhất ở bữa tiệc.", "eng": "Some on, I'll introduce you to the most beautiful girl at the party."}, {"viet": "Một vài thanh niên ngông cuồng đã phá phách trạm xe buýt.", "eng": "Some young heathen has vandalized the bus shelter."}, {"viet": "Xin lỗi, đó là sai lầm của tôi.", "eng": "Sorry, that was a bit of a goof on my part."}, {"viet": "Phết vẹc ni mỏng thôi, nếu bạn không muốn nó nhăn.", "eng": "Spread the varnish thin if you don't want it to wrinkle."}, {"viet": "Steven, tôi đã quá no vì thức ăn ngon như vậy và tôi cảm thấy thích nghe vài bản nhạc jazz hơn là nhạc cổ điển.", "eng": "Steven, I'm so full with such good food and I feel like listening to some jazz music rather than classical music."}, {"viet": "Những câu chuyện được truyền miệng từ đời này sang đời sau.", "eng": "Stories passed on by oral tradition."}, {"viet": "Một tai họa như vụ ôtô của cô ta bị đánh cắp chưa từng xảy ra trước đây.", "eng": "Such a disaster as her car being stolen had never happened before."}, {"viet": "Cố thu hết can đảm của mình vào cuộc chiến đấu.", "eng": "Summon up one's courage for the battle."}, {"viet": "Hạt giống đậu hoa có thể gieo vào tháng Năm.", "eng": "Sweet pea seed can be sewn in May."}, {"viet": "Hãy uống hai viên aspirin cho khỏi nhức đầu.", "eng": "Take two aspirins for your headache."}, {"viet": "Nói với cô ấy tới dự tiệc cứ ăn mặc bình thường thôi.", "eng": "Tell her to come to the party dressed just as she is."}, {"viet": "Rất cám ơn anh về việc mời chúng tôi ăn tối.", "eng": "Thank you very much for inviting us to dinner."}, {"viet": "Khu vực đó của thành phố thì khá nguy hiểm sau khi trời tối.", "eng": "That area of the city is quite rough after dark."}, {"viet": "Việc anh ta nói với anh như thế thật là đáng kinh ngạc.", "eng": "That he should speak to you like that is quite astonishing."}, {"viet": "Chiếc áo dài mới phô ra một khoảng rộng trên ngực ( bà ta )!", "eng": "That new gown shows a large amount of ( her ) cleavage!"}, {"viet": "Đó là nội dung của cuộc điện thoại này đấy.", "eng": "That's what the phone call is about."}, {"viet": "Việc đó cần bắt đầu sớm vào sáng mai.", "eng": "That will entail an early start tomorrow morning."}, {"viet": "Sổ sách kế toán cho thấy số lời là 9000 pao.", "eng": "The accounts show a profit of 9000 pounds."}, {"viet": "Máy điều hoà nhiệt độ dường như bị hỏng.", "eng": "The air-conditioner seems to be out of order."}, {"viet": "Lời tuyên bố được đáp lại bằng những tiếng cười ầm ĩ hân hoan.", "eng": "The announcement was greeted with much hilarity and mirth."}, {"viet": "Từ trong núi, quân đội đổ ra một cánh đồng rộng.", "eng": "The army debouched from the mountains into a wide plain."}, {"viet": "Sự cố gắng này không dẫn tới kết quả nào hết.", "eng": "The attempt was attended with no results."}, {"viet": "Đứa bé tè ra tã rồi-em thay tã đi?", "eng": "The baby has a wet nappy-will you change it?"}, {"viet": "Ngân hàng đó nằm đối diện với siêu thị.", "eng": "The bank is opposite the supermarket."}, {"viet": "Cần phải nghiền đậu thành bột nhuyễn.", "eng": "The beans need to be mashed into pulp."}, {"viet": "Con chim sải cánh lượn bay.", "eng": "The bird extended its wings in flight."}, {"viet": "Tất cả các thuyền bè đều ở ngoài khơi.", "eng": "The boats are all out at sea."}, {"viet": "Sách trong thư viện được theo chủ đề.", "eng": "The books in the library are classified by subject."}, {"viet": "Bọn con trai tất cả đều ngớ ngẩn trước bức tranh một cô gái mặc bikini.", "eng": "The boys were all drooling over a picture of a girl in a bikini."}, {"viet": "Toà nhà đã làm thay đổi diện mạo của cả khu vực.", "eng": "The building has changed the appearance of the whole area."}, {"viet": "Lúc này công việc làm ăn có vẻ thuận buồm xuôi gió.", "eng": "The business seems to be in smooth waters these days."}, {"viet": "Chiếc xe ôtô giá đến hai mươi nghìn cơ đấy.", "eng": "The car cost a cool twenty thousand."}, {"viet": "Những nghề chăm nom như y tá và công tác xã hội.", "eng": "The caring professions such as nursing and social work."}, {"viet": "Nên trát xi măng cao hơn bề mặt đó rồi láng cho bằng.", "eng": "The cement should stand proud of the surface and then be smoothed down later."}, {"viet": "Tình bạn vui vẻ giữa những người leo núi.", "eng": "The cheerful camaraderie among mountain climbers."}, {"viet": "Đứa trẻ bộc lộ tính hiếu kỳ lành mạnh.", "eng": "The child showed a healthy curiosity."}, {"viet": "Bọn trẻ thích ngắm những con hà mã dầm mình trong bùn.", "eng": "The children enjoyed watching the hippopotamus wallowing in the mud."}, {"viet": "Bọn trẻ nhìn chằm chằm một cách ham muốn vào các đồ chơi bày trong tủ kính hàng.", "eng": "The children were gazing longingly at the toys in the shop window."}, {"viet": "Thành phố là một sự hỗn hợp các toà nhà cũ và mới.", "eng": "The city was a mixture of old and new buildings."}, {"viet": "Câu lạc bộ quyết định tăng nguyệt liễm.", "eng": "The club has decided to increase subscriptions."}, {"viet": "Những cây cột chịu sức nặng của mái nhà.", "eng": "The columns bear the weight of the roof."}, {"viet": "Công ty lâm vào tình trạng thanh lý để trả nợ.", "eng": "The company has gone into liquidation."}, {"viet": "Dịch vụ hoà giải không giải quyết được sự tranh cãi giữa ban giám đốc và nghiệp đoàn.", "eng": "The conciliation service failed to resolve the dispute between management and the union."}, {"viet": "Các thông lệ chi phối việc giao dịch ở thị trường chứng khoán.", "eng": "The conventions which govern stock-market dealing."}, {"viet": "Đất nước này phụ thuộc nặng nề vào viện trợ của nước ngoài.", "eng": "The country is heavily dependent on foreign aid."}, {"viet": "Sự sáng tạo thế giới trong bảy ngày.", "eng": "The creation of the world in seven days."}, {"viet": "Đám đông xúm xít chen lấn sau các hàng rào chắn.", "eng": "The crowds were pressing against the barriers."}, {"viet": "Nàng vũ nữ được trang điểm bằng những bông hoa.", "eng": "The dancer was adorned with flowers."}, {"viet": "Bị cáo và luật sư của anh ta phải có mặt tại tòa án.", "eng": "The defendant and his attorney must appear in court."}, {"viet": "Sự tính toán vị trí của một con tàu.", "eng": "The determination of a ship's position."}, {"viet": "Bệnh tật có thể để lại vết tích trên mặt anh ta.", "eng": "The disease may leave blemishes on his face."}, {"viet": "Bác sĩ cho tôi uống các viên thuốc nầy.", "eng": "The doctor put me on these tablets."}, {"viet": "Con chó đó chỉ có một mẩu đuôi.", "eng": "The dog only has a stub of a tail."}, {"viet": "Chiếc áo một phần may bằng len, một phần bằng lụa.", "eng": "The dress is part silk, part wool."}, {"viet": "Trái đất được hình thành cách đây lâu lắm rồi.", "eng": "The earth was formed aeons ago."}, {"viet": "Những người chủ không dẹp được cuộc đình công của các phu bến tàu.", "eng": "The employer have not broken the docket's strike."}, {"viet": "Việc trang bị cho xưởng nhiếp ảnh tốn rất nhiều tiền.", "eng": "The equipment of the photographic studio was expensive."}, {"viet": "Nhịp độ căng thẳng của đời sống đô thị.", "eng": "The exhausting tempo of city life."}, {"viet": "Thất bại đó là do sự quản lý tồi.", "eng": "The failure was caused by bad management."}, {"viet": "Những cảm nghĩ của nạn nhân một vụ cưỡng hiếp đối với kẻ hãm hiếp cô ta.", "eng": "The feelings of a rape victim towards her attacker."}, {"viet": "Phim đó đạt doanh thu cao.", "eng": "The film was a box-office success."}, {"viet": "Nhà máy là nơi sản xuất chính về thiết bị điện tử của Anh quốc.", "eng": "The firm is Britain's main producer of electronic equipment."}, {"viet": "Con cá tuột ra khỏi bàn tay tôi.", "eng": "The fish slipped out of my hand."}, {"viet": "Trận đấu bóng đã phải huỷ bỏ vì trời mưa.", "eng": "The football game had been cancelled due to rain."}, {"viet": "Con nhái không phải loài bò sát đích thực.", "eng": "The frog is not a true reptile."}, {"viet": "Ngôi vườn bề ngang 30 bộ.", "eng": "The garden is thirty feet wide."}, {"viet": "Các cô gái trò chuyện ồn ào trong bữa ăn trưa.", "eng": "The girls clattered away at their luncheon."}, {"viet": "Chính phủ, vẫn nhanh nhảu như mọi khi, đã nhượng bộ những yêu sách của họ.", "eng": "The Government, compliant as ever, gave in to their demands."}, {"viet": "Hiện thời chính phủ có vẻ rất lung lay.", "eng": "The government is looking very shaky at the moment."}, {"viet": "Sự định cư dần dần ở miền Tây Hoa Kỳ.", "eng": "The gradual settlement of the American West."}, {"viet": "Sự mâu thuẫn ngày càng tăng giữa lời nói và sự thật làm suy yếu ngôi vị tổng thống của Níchxơn.", "eng": "The growing credibility gap that crippled Nixon's presidency."}, {"viet": "Cái búa để trong nhà kho chung với các dụng cụ khác.", "eng": "The hammer belongs in the shed with the rest of the tools."}, {"viet": "Con diệc vỗ cánh thong thả bay qua hồ.", "eng": "The heron flapped slowly off across the lake."}, {"viet": "Bệnh viện sử dụng hàng trăm người.", "eng": "The hospital employs hundreds of people."}, {"viet": "Ngôi nhà này cần sửa chữa.", "eng": "The house is in want of repair."}, {"viet": "Ý kiến đó đã ăn sâu trong trí của anh ta.", "eng": "The idea became embedded in his mind."}, {"viet": "Sự bố trí các công nhân mới vào công việc của họ.", "eng": "The induction of new employees into their jobs."}, {"viet": "Các khe hở nhỏ giữa những viên gạch đã để cho khí lạnh lọt vào.", "eng": "The interstices between the bricks let in cold air."}, {"viet": "Công việc đã làm tổn hại đến sức khoẻ của anh ta nên anh ta đã thôi không làm nữa.", "eng": "The job was damaging his health so he had to turn it in."}, {"viet": "Chiếc chìa khoá treo ở sợi dây cạnh cửa Cô ta đeo tấm huy chương bằng một sợi dây quàng ở cổ.", "eng": "The key is hanging on a string by the door She wore the medal on a string round her neck."}, {"viet": "Vùng này bằng phẳng và không cây cối làm cho quân lính không có chỗ ẩn nấp.", "eng": "The land was flat and treeless and gave no cover to the troops."}, {"viet": "Vị luật sư đang cố gắng gài bẫy các nhân chứng.", "eng": "The lawyer was trying to trip the witnesses up."}, {"viet": "Thư viện chỉ mở cửa những ngày thường.", "eng": "The library is open on weekdays only."}, {"viet": "Người dân địa phương có khuynh hướng nghi ngờ người lạ mặt.", "eng": "The locals tend to be suspicious of strangers."}, {"viet": "Cái máy này không cần chăm sóc nhiều-đó là sự hấp dẫn của nó.", "eng": "The machine needs very little attention-that's the beauty of it."}, {"viet": "Người bán cho tôi chiếc rađiô nói anh ta sẽ đổi cho tôi cái khác nếu cái này nghe không tốt.", "eng": "The man who sold me the radio said he'd replace it if it didn't work."}, {"viet": "Vấn đề bây giờ được xếp vào hàng thứ yếu.", "eng": "The matter is now put on the back burner."}, {"viet": "Nghị sĩ khu đông bắc Leeds.", "eng": "The Member for Leeds North-East."}, {"viet": "Ông bộ trưởng nói vắn tắt là năm tới có thể ông sẽ từ chức.", "eng": "The minister has indicated that he may resign next year."}, {"viet": "Tháng tám cũng mang tên của một Xê-da nổi tiếng-Augustus.", "eng": "The month of August was named for another famous Caesar-Augustus."}, {"viet": "Những ngọn núi âm u che thung lũng.", "eng": "The mountains scowl over the valley."}, {"viet": "Những chiến binh bản xứ đã tẩm thuốc độc mũi giáo của họ.", "eng": "The native warriors tipped their spears with poison."}, {"viet": "Chính phủ mới cai trị đất nước một cách cứng rắn.", "eng": "The new government rules the country firmly."}, {"viet": "Cửa hàng mới này kinh doanh phát đạt quần áo hạ giá.", "eng": "The new shop has been doing brisk trade in cut-price clothes."}, {"viet": "Giải pháp tốt thứ nhì là từ bỏ luôn cả dự án.", "eng": "The next-best solution is to abandon the project altogether."}, {"viet": "Nhà máy hạt nhân đang được xây dựng có thể sẽ được đưa vào hoạt động trong khoảng thời gian năm năm tới.", "eng": "The nuclear plant now being built is expected to be commissioned in five years'time."}, {"viet": "Văn phòng sáng sủa và thoáng mát.", "eng": "The office was light and airy."}, {"viet": "Máy in cũ sẽ bị phế thải.", "eng": "The old printing press will have to be pensioned off."}, {"viet": "Nghi lễ như trong sách Kinh đã đề ra.", "eng": "The order of service as laid down in the Prayer Book."}, {"viet": "Những bức hoạ của Paul Cezanne báo trước sự ra đời của trường phái lập thể.", "eng": "The paintings of Paul Cezanne prefigured the rise of cubism."}, {"viet": "Hành khách cảm thấy một cú xốc mạnh khi máy bay hạ cánh.", "eng": "The passengers felt a violent bump as the plane landed."}, {"viet": "Những người trong vụ tai nạn bị thương nặng.", "eng": "The people in the accident had serious injury."}, {"viet": "Những tấm ảnh được chuyển từ người này qua người khác xem.", "eng": "The photos were passed around for everyone to see."}, {"viet": "Chỗ đó vẫn là một nơi lạc hậu về kinh tế đã hơn một thế hệ.", "eng": "The place remained an economic backwater for more than a generation."}, {"viet": "Vữa trát tường phải sửa chữa trước khi anh sơn.", "eng": "The plaster will have to be made good before you paint it."}, {"viet": "Bài thơ này vẫn còn bản quyền, vì thế anh phải trả tiền để trích dẫn nó.", "eng": "The poem is still under copyright, so you have to pay to quote it."}, {"viet": "Cảnh sát đã theo dõi sát các động thái của bọn bị tình nghi.", "eng": "The police have been keeping a close watch on the suspects'movements."}, {"viet": "Cảnh sát đã thất bại và Sherlock Holmes đã được mời đến để điều tra.", "eng": "The police were baffled, and Sherlock Holmes was called in to investigate."}, {"viet": "Bức chân dung được hoàn thành sau sáu buổi ngồi làm mẫu.", "eng": "The portrait was completed after six sittings."}, {"viet": "Cách trình bày tài liệu không được gọn gàng.", "eng": "The presentation of the material was untidy."}, {"viet": "Giá trị uy thế của việc sở hữu một chiếc xe ôtô Rolls-Royce.", "eng": "The prestige value of owning a Rolls Royce."}, {"viet": "Ông hiệu trưởng trách mắng hành vi của các học sinh.", "eng": "The principal reproved the behavior of the students."}, {"viet": "Viên giám đốc sản xuất đi vòng kiểm tra thường xuyên.", "eng": "The production manager making his rounds."}, {"viet": "Viễn tượng phải học trong năm năm rõ ràng là không hấp dẫn.", "eng": "The prospect of studying for five years was distinctly unappealing."}, {"viet": "Sự nhồi đảo của một chiếc máy bay trong cơn bão làm cho buồn nôn.", "eng": "The queasy lurch of an aero plane during a storm."}, {"viet": "Mưa gây cản trở cho kế hoạch đi chơi của chúng tôi.", "eng": "The rain interfered with our plans to go out."}, {"viet": "Sự tái phát một bệnh, sự tái phạm lỗi lầm, sự trở lại của một vấn đề, chủ đề.", "eng": "The recurrence of an illness, error, problem, theme."}, {"viet": "Bài báo cáo đã lướt qua sự đóng góp của ông ta cho công ti.", "eng": "The report slurred over his contribution to the company."}, {"viet": "Tấm biển quay xoay tròn mãi trong gió.", "eng": "The revolving sign was spinning round and round in the wind."}, {"viet": "Con đường sẽ còn tiếp năm dặm nữa.", "eng": "The road continues of another five miles."}, {"viet": "Gian phòng ấy được trang hoàng với sự sang trọng giả tạo.", "eng": "The room was decorated with stagy opulence."}, {"viet": "Việc loại bỏ an toàn các chất thải hạt nhân là một vấn đề lớn.", "eng": "The safe disposal of nuclear waste is a major problem."}, {"viet": "Kế hoạch này được tài trợ một phần bằng tiền trợ cấp của nhà nước.", "eng": "The scheme is partly financed by a government grant."}, {"viet": "Xuất diễn thứ hai bắt đầu lúc 8 giờ.", "eng": "The second house starts at 8 o'clock."}, {"viet": "Bóng cây dài ra khi chiều xuống.", "eng": "The shadow of the trees grew longer as the afternoon went on."}, {"viet": "Con tàu đã bị một tảng băng trôi đâm thủng.", "eng": "The ship was holed by an iceberg."}, {"viet": "Những tác dụng phụ của thuốc vẫn còn chưa được biết ( đối với các nhà khoa học ).", "eng": "The side-effects of the drug are as yet unknown ( to scientists )."}, {"viet": "Bầu trời trong xanh, và không khí thật trong lành.", "eng": "The sky is so blue, and the air is so clean."}, {"viet": "Ghế sôfa tệ quá rồi nhưng những chiếc ghế thì còn được.", "eng": "The sofa has seen better days but the chairs are still okay."}, {"viet": "Phía Liên Xô đòi hỏi một vài sự bảo đảm về việc rà soát trước khi ký hiệp ước.", "eng": "The Soviets are demanding certain guarantees about verification before signing the treaty."}, {"viet": "Sông St Lawrence tàu bè có thể đi lại được từ Đại Hồ đến Đại Tây Dương.", "eng": "The St Lawrence River is navigable from the Great lakes to the Atlantic Ocean."}, {"viet": "Hòn đá đó trúng tôi vào trán.", "eng": "The stone struck me on the forehead."}, {"viet": "Cha mẹ của học sinh tặng cô giáo quà để tỏ lòng biết ơn cô.", "eng": "The student's parents showered the teacher with presents, in order to gratify her."}, {"viet": "Giây phút mặt trời mọc nhìn từ trên núi cao là một cảnh tượng kỳ vĩ.", "eng": "The sunrise seen from high in the mountains was a tremendous spectacle."}, {"viet": "Đôi mắt cú vọ của cô giáo luôn luôn nhìn chúng tôi.", "eng": "The teacher's eagle eye was always on us."}, {"viet": "Đội được giải thương cao nhất năm 1980 và 1982.", "eng": "The team won the big enchilada in 1980 and 1982."}, {"viet": "Mặt tuyết dày của chiếc khăn tắm sang trọng.", "eng": "The thick pile of a luxurious bath towel."}, {"viet": "Thời gian biểu có thể bị sửa đổi.", "eng": "The timetable is subject to alteration."}, {"viet": "Bi kịch đã có thể tránh được nếu như thuỷ thủ đoàn tuân theo thủ tục an toàn.", "eng": "The tragedy could have been averted if the crew had followed safety procedure."}, {"viet": "Binh sĩ xông lên tấn công phòng tuyến địch.", "eng": "The troops charged at the enemy lines."}, {"viet": "Hai đảng mâu thuẫn nhau từ ngày bầu cử.", "eng": "The two parties have been in conflict since the election."}, {"viet": "Vương quốc Anh là một nước theo chế độ quân chủ lập hiến.", "eng": "The United Kingdom is a constitutional monarchy."}, {"viet": "Đội quân chiến thắng chất nặng chiến lợi phẩm của kẻ thù.", "eng": "The victorious forces were laden with enemy booty."}, {"viet": "Cuộc chiến tranh dường như vẫn còn rõ rệt trong ký ức những người đã tham gia.", "eng": "The war still bulks large in the memories of those who fought in it."}, {"viet": "Con cá voi vẫy đuôi đập nước liên tục.", "eng": "The whale thrashed the water with its tail."}, {"viet": "Gió rít qua kẽ nứt ở cửa ra vào.", "eng": "The wind whistled through a crack in the door."}, {"viet": "Công việc của nhà soạn nhạc rất khó khăn.", "eng": "The work of a composer is difficult."}, {"viet": "Người nhạc sĩ trẻ được coi là một tài năng.", "eng": "The young musician was considered a genius."}, {"viet": "Ngôi nhà của họ có tất cả những tiện nghi hiện đại nhất.", "eng": "Their home boasts all the newest conveniences."}, {"viet": "Đám cưới của họ tốn một khoản tiền rất lớn.", "eng": "Their wedding cost a fantastic amount of money."}, {"viet": "Nếu anh làm xước sơn xe của tôi thì sẽ phiền phức đấy!", "eng": "There'll be the devil to pay if you scratch my car!"}, {"viet": "Có yếu tố chân thực trong câu chuyện của anh ta.", "eng": "There's an element of truth in his story."}, {"viet": "Cứ trong ba quả táo ngon, có một quả hỏng.", "eng": "There's one bad apple for every three good ones."}, {"viet": "Có hàng trăm người đang xin ăn trên đường phố.", "eng": "There are hundreds begging in the streets."}, {"viet": "Có những cái đèn đặc biệt không tỏa ra ánh sáng trắng giống như ánh sáng mặt trời.", "eng": "There are special lamps that do not give off white light like sunlight."}, {"viet": "Đã có nhiều thay đổi từ khi chiến tranh.", "eng": "There have been many change since the war."}, {"viet": "Có một mẹo để làm cho nó hoạt động, bởi vì nó là cái máy cũ mà.", "eng": "There is a tricky way of getting it to work, because it's an old machine."}, {"viet": "Không biết chắc thủ tục chính xác phải như thế nào.", "eng": "There is some confusion about what the right procedure should be."}, {"viet": "Có một vụ bê bối lớn khi chúng tôi phát hiện ra là tay bác sĩ bị tống giam vì tội ăn cắp.", "eng": "There was a great scandal when we found out that the doctor had been sent to prison for stealing."}, {"viet": "Không có chỗ nào chúng ta có thể trú ẩn được để tránh cơn bão.", "eng": "There was nowhere we could take cover from the storm."}, {"viet": "Không đủ ghế ngồi, nên tôi phải ngồi trên sàn nhà.", "eng": "There weren't enough chairs so I had to sit on the floor."}, {"viet": "Vài món ( đồ gỗ ) này là tất cả những gì anh ta bỏ lại.", "eng": "These few sticks ( of furniture ) are all he has left."}, {"viet": "Đôi giày chạy này rất nhẹ.", "eng": "These running shoes are very light."}, {"viet": "Họ vẫn còn thấy nhức nhối vì thua trận chung kết.", "eng": "They're still smarting from their defeat in the final."}, {"viet": "Họ phủ nhận trách nhiệm đối với mọi thứ.", "eng": "They are abnegating responsibility for everything."}, {"viet": "Họ rất coi trọng dự án này.", "eng": "They attached very great importance to the project."}, {"viet": "Họ coi hành vi của bà ta là một thứ màu mè hợm hĩnh đáng xấu hổ.", "eng": "They considered her behaviour a shameful of snobbery."}, {"viet": "Họ thắng sát nút đội đối địch bằng một điểm.", "eng": "They edge out the opposing team by one point."}, {"viet": "Thoạt nhìn thấy họ có điều phàn nàn chính đáng.", "eng": "They had before prima facie a legitimate complain."}, {"viet": "Họ phỏng vấn 30 người, trong đó năm người là có thể tuyển chọn được.", "eng": "They interviewed 30 people of whom five were possibles."}, {"viet": "Họ có thể không phải là triệu phú nhưng chắc chắn rất sung túc.", "eng": "They may not be millionaires but they're certainly very comfortable."}, {"viet": "Họ bày tỏ sự lạc quan về kết quả.", "eng": "They professed optimism about the outcome."}, {"viet": "Họ dường như sẵn sàng chiều theo mọi ý thích chợt nảy ra của nó.", "eng": "They seem ready to indulge his every whim."}, {"viet": "Chúng nó ném chị ta ra khỏi nhà với tất cả đồ đạc của chị.", "eng": "They threw her out of the house bag and baggage."}, {"viet": "Họ ắng đi bởi những toà nhà cổ khổng lồ.", "eng": "They were awed into silence by the enormous ancient buildings."}, {"viet": "Lúc đó họ đã di chuyển bằng xe hai bánh, viết bằng những ký hiệu tượng hình, và xây dựng các thành phố.", "eng": "They were traveling in two-wheeled carts, writing with picture like signs, and building cities."}, {"viet": "Câu trả lời này chắc hẳn là quay cóp: nó giống y hệt như câu trả lời của Jones.", "eng": "This answer must be a crib: it's exactly the same as Jones's."}, {"viet": "Công ty này không phân biệt nam và nữ-mọi người đều được trả lương ngang nhau.", "eng": "This company does not differentiate between men and women-everyone is paid at the same rate."}, {"viet": "Thí nghiệm này không liên quan với thí nghiệm trước.", "eng": "This experiment doesn't correlate with the earlier one."}, {"viet": "Đây là một cách chắc chắn thành công để làm cho thiên hạ biết đến.", "eng": "This is a sure-fire way to get publicity."}, {"viet": "Đây là hộ chiếu của bà và nó là bản ghi nhớ việc chuyển đổi lại.", "eng": "This is your passport and it is the reconversion memo."}, {"viet": "Cái môđen mới này là vị thế tiên tiến nhất trong công nghệ máy tính.", "eng": "This new model is at the cutting edge of computer technology."}, {"viet": "Đề nghị của cô ta không thể thoả mãn được.", "eng": "This proposal of hers can't meet the case."}, {"viet": "Đây là một câu chuyện tưởng tượng ra.", "eng": "This story is made up."}, {"viet": "Từ này viết không đúng, anh đã để sót một chữ.", "eng": "This word is wrongly spelt, you've left out a letter."}, {"viet": "Để có thêm một tháng 31 ngày nữa họ lấy một ngày từ một tháng 30 ngày-tháng hai.", "eng": "To get an extra 31-day month, they took a day from a 30 day month-from February."}, {"viet": "Thương mại giữa hai nước đã bị gián đoạn do chiến tranh.", "eng": "Trade between the two countries was interrupted by the war."}, {"viet": "Thường khoảng 5 hoặc 6 lần một năm.", "eng": "Usually around five or six times a year."}, {"viet": "Đồng hồ đeo tay có lò xo là một thành công lớn đến nỗi người ta cũng bắt đầu chế tạo đồng hồ treo tường bằng lò xo.", "eng": "Watches with springs were such a success that clocks began to be made with springs."}, {"viet": "Chúng ta sẽ tìm cách vượt qua khó khăn đó khi chúng ta gặp phải.", "eng": "We'll overcome that difficulty when we get to it."}, {"viet": "Chúng tôi đang đi tìm một người có thành tích đã được thử thách để bán quảng cáo.", "eng": "We're looking for someone with a proven track record in selling advertising."}, {"viet": "Xe chúng ta có vấn đề rồi-nó không nổ máy!", "eng": "We've got a problem with the car-it won't start!"}, {"viet": "Tất cả chúng tôi nắm tay nhau và nhảy thành vòng tròn.", "eng": "We all joined hands and danced round in a circle."}, {"viet": "Chúng tôi rất lấy làm tự hào và vinh dự đón tiếp được đón tiếp một đoàn các vị khách quý tận Canada đến thăm.", "eng": "We are proud and honored to have such a distinguished group of guests come all the way from Canada to visit our group."}, {"viet": "Chúng tôi đã mượn nó khoảng giữa trưa.", "eng": "We came for it around noon."}, {"viet": "Chúng ta không thể giả định trước rằng những lời tuyên bố của ông ta là sự thật.", "eng": "We cannot presuppose the truth of his statements."}, {"viet": "Chúng tôi không nghĩ mất nhiều tiền vào việc sửa chữa như vậy.", "eng": "We didn't reckon on spending so much on repairs."}, {"viet": "Chúng tôi bay trên mây hầu hết đoạn đường.", "eng": "We flew above the clouds most of the way."}, {"viet": "Chúng tôi có vịt quay với tất cả các thức trang trí.", "eng": "We had roast duck with all the trimming."}, {"viet": "Chúng tôi có dịch vụ đánh bóng giày miễn phí cho khách trọ.", "eng": "We have free shoe shinning service for our guests."}, {"viet": "Chúng tôi nấp sau bụi sẵn sàng chộp tên xâm nhập.", "eng": "We hid behind the bushes, ready to pounce upon the intruder."}, {"viet": "Chúng tôi sẽ cử người đến giải quyết việc này.", "eng": "We'll send someone to take care of it."}, {"viet": "Chúng ta phải hoàn tất những tài liệu này cho Cairo.", "eng": "We must finish these documents for Cairo."}, {"viet": "Chúng tôi cần những người tự nguyện giúp dựng và vẽ phông cảnh.", "eng": "We need volunteers to help build and paint the set."}, {"viet": "Chúng tôi nhận được những cái nhìn chằm chằm tò mò của người qua đường.", "eng": "We received a number of curious stares from passers-by."}, {"viet": "Lí ra chúng ta phải nhìn thấy điều rắc rối này hàng tháng trước mới phải.", "eng": "We should have foreseen the trouble months ago."}, {"viet": "Chúng tôi cố gắng xếp những người xin việc vào những chỗ trống thích hợp.", "eng": "We try to match the applicants with appropriate vacancies."}, {"viet": "Chúng tôi hết sức lạ lùng vì sự thay đổi vẻ bề ngoài của anh ta.", "eng": "We were amazed by the change in his appearance."}, {"viet": "Trong trường hợp hết sức cần thiết thì bao giờ chúng tôi cũng đến.", "eng": "We will always come in cases of extreme necessity."}, {"viet": "À, tính đến hôm nay thì tài khoản của ông còn 500 nhân dân tệ.", "eng": "Well, as of today you have 500 yuan in your account."}, {"viet": "À, ông Vương, trưởng phòng kinh doanh của chúng tôi đã nhờ tôi mời ông dùng bữa tối lúc 6 giờ tối nay ở phòng ăn lớn dưới lầu.", "eng": "Well, our Sales Manager, Mr. Wang, has asked me to invite you to dinner at 6 o'clock this evening in the dining hall downstairs."}, {"viet": "Xin hỏi loại rượu Trung Quốc nào được ưa thích nhất?", "eng": "What's the favorite Chinese wine, please?"}, {"viet": "Những khác biệt giữa rau củ Nhật Bản và rau củ có ở đất nước bạn là gì?", "eng": "What are the differences between Japanese vegetables and vegetables you get in your country?"}, {"viet": "Bạn nghĩ sao về cảnh yêu đương trong phim?", "eng": "What did you think of the love scene?"}, {"viet": "Cái nó thiếu về kinh nghiệm, nó lấy nhiệt tình bù vào.", "eng": "What he lacks in experience he makes up for in enthusiasm."}, {"viet": "Sự phân bố dân cư của Nhật Bản như thế nào?", "eng": "What is the population distribution of Japan?"}, {"viet": "Cái gì đã làm cho anh đến làm việc ở cơ quan này?", "eng": "What made you come and work in this establishment?"}, {"viet": "Cái mà đứa bé ấy cần là phết vào đít một cái nên thân.", "eng": "What that child needs is a good spanking."}, {"viet": "Khi nào bạn rảnh để ăn trưa?", "eng": "When are you free for lunch?"}, {"viet": "Khi con trai ông ấy từ nước ngoài về, ông ấy nhận thấy cậu ta khôn ngoan hơn.", "eng": "When his son returned from abroad he noticed that he had mellowed."}, {"viet": "Khi chị ấy hôn đứa bé, đứa trẻ lớn hơn ghen tức.", "eng": "When she kisses the baby, it makes the older child jealous."}, {"viet": "Trong cuộc tham quan Luân Đôn, tôi thích đi lại bằng xe buýt.", "eng": "When visiting London I like to travel by bus."}, {"viet": "Tôi có thể nhờ đổi tiền mặt thư chuyển tiền này ở đâu?", "eng": "Where can I get this postal order cashed?"}, {"viet": "Bạn muốn sống ở nước nào?", "eng": "Which country would you like to live in?"}, {"viet": "Trong khi bị thẩm vấn, kẻ đào ngũ đã khai ra tên của hai điệp viên hai mang.", "eng": "While being debriefed the defector named two double agents."}, {"viet": "Ai lãnh đạo đảng trong cuộc bầu cử tới?", "eng": "Who is to lead the party into the next election?"}, {"viet": "Sao công ty của ông lại thay thế nhân viên xoành xoạch thế?", "eng": "Why does your company have such a rapid turnover of staff?"}, {"viet": "Liệu anh có thể mua mọi thứ trong bảng kê này ở siêu thị không hay anh còn cần phải ghé cửa hàng dược phẩm nữa?", "eng": "Will I be able to get everything on this list at the supermarket or do I need to go to the drugstore, too?"}, {"viet": "Xin thầy vui lòng nói lại câu đó ạ?", "eng": "Will you say that again, please?"}, {"viet": "Miệng há to đợi thức ăn.", "eng": "With mouth agape in expectation of food."}, {"viet": "Hoạt động với độ dung sai 0, 0001 inxơ.", "eng": "Working to a tolerance of 0.0001 of an inch."}, {"viet": "Bạn đến nhà tôi ăn tối nhé?", "eng": "Would you like to come to my house for dinner?"}, {"viet": "Xin mời ông ngồi, thưa ông Smith?", "eng": "Would you please take a seat, Mr. Smith?"}, {"viet": "Vâng, nhưng phải trả thêm đấy.", "eng": "Yes, but you pay for it."}, {"viet": "Vâng, khi bạn của ông nhận được thư này, ông ấy sẽ ký vào một tờ biên nhận, biên nhận này sẽ được gửi đến ông qua đường bưu điện.", "eng": "Yes, when your friend gets it, he'll sign a receipt, which will be sent to you by mail."}, {"viet": "Anh phải đóng thuế nhập khẩu cho chiếc máy đó.", "eng": "You'll have to pay import duty on that machinery."}, {"viet": "Việc của mày là phải dọn dẹp, cho nên đừng có chuồn nữa mà phải làm đi!", "eng": "You're supposed to tidy up, so stop shirking and do it!"}, {"viet": "Anh hơi thiếu cân so với chiều cao.", "eng": "You are only slightly underweight for your height."}, {"viet": "Anh không thể nói chuyện đùa như thế với bà ta được đâu-bà ta đoan trang và nghiêm nghị lắm.", "eng": "You can't tell that joke to her-she's much too prim and proper."}, {"viet": "Chắc chắn là anh không thể mong tôi tin vào điều đó.", "eng": "You can scarcely expect me to believe that."}, {"viet": "Anh không cần phải làm gì hết-chỉ việc ngả mình và tận hưởng cuộc hành trình.", "eng": "You don't have to do anything-just lie back and enjoy the journey."}, {"viet": "Bạn phải nhìn cẩn thận trước khi đưa tiền cho ai đó, hoặc khi nhận tiền thối lại.", "eng": "You have to look carefully before handing someone the money, or when receiving change."}, {"viet": "Anh có thể tìm thấy cô ấy ở quán ăn tự động, nếu không có thì thử ra thư viện xem.", "eng": "You may find her in the cafeteria or, failing that, try the library."}, {"viet": "Cậu tuyệt đối không được kể cho anh ta những gì đã xảy ra.", "eng": "You must on no condition tell him what happened."}, {"viet": "Ông khá thông minh, phải không nào?", "eng": "You're pretty clever, aren't you?"}, {"viet": "Bà nên đi xe điện ngầm số.", "eng": "You should take the number 1 subway."}, {"viet": "Tất cả các em đều sẽ bị phạt, tôi không thể miễn trừ cho ai hết.", "eng": "You will all be punished, I can except no one."}, {"viet": "Người bình thường vô văn hoá các anh không biết đi nghe ôpêra.", "eng": "Your average punter does not go to the opera."}, {"viet": "Ông cần có mặt trong cuộc họp các cổ đông.", "eng": "Your presence is requested at the shareholder's meeting."}]