[{"viet": "Nồi hơi là một loại thiết bị tiết kiệm nhiên liệu tốt.", "eng": "A boiler that is a good fuel-saver."}, {"viet": "Một đứa trẻ hấp thụ nền giáo dục ban đầu ở gia đình của nó.", "eng": "A child receives its early education at home."}, {"viet": "Một chuyến hàng lúa mì được gởi đến Châu Âu.", "eng": "A consignment of wheat bound for Europe."}, {"viet": "Một quyết tâm nâng doanh số bán.", "eng": "A decided effort to improve sales."}, {"viet": "Một sự đảo ngược bất ngờ quyết định trước đây của bà ta.", "eng": "A dramatic reversal of her earlier decision."}, {"viet": "Bộ phim kết thúc chương trình TV buổi chiều này.", "eng": "A film completes this evening's TV line-up."}, {"viet": "Một phòng trưng bày nghệ thuật chứa đầy những bức tranh đẹp.", "eng": "A gallery stored with fine paintings."}, {"viet": "Khi tính tới việc sẽ phải làm, cậu ấy thấy chắc phải mệt lắm.", "eng": "A great weariness settled over him when he considered what must be done."}, {"viet": "Một xúc giác phát triển cao.", "eng": "A highly developed sense of touch."}, {"viet": "Một kilô oát là một ngàn oát.", "eng": "A kilowatt is a thousand watts."}, {"viet": "Một cuộc sống hoàn toàn trác táng.", "eng": "A life devoted entirely to sensual pleasure."}, {"viet": "Cái máy có khả năng chịu những trọng tải lớn.", "eng": "A machine with the ability to cope with large loads."}, {"viet": "Một cuộc rung chuyển mạnh có những chấn động nhẹ theo sau.", "eng": "A mighty tremor followed by minor concussions."}, {"viet": "Một cuốn sách mới đạt được thành công ngay.", "eng": "A new book that was an instant success."}, {"viet": "Bức tranh của Goya, một vật quý giá nhất trong bộ sưu tập kho tàng nghệ thuật của ông ta.", "eng": "A painting by Goya, the brightest jewel in his collection of art treasures."}, {"viet": "Một hiện tượng mới nảy sinh gần đây.", "eng": "A phenomenon of comparatively recent growth."}, {"viet": "Cuộc phổ thông đầu phiếu cho thấy mọi người đều muốn có sự thay đổi chính phủ.", "eng": "A popular vote has shown that everyone wants a change of government."}, {"viet": "Một học sinh giỏi vật lý nhưng yếu tiếng Anh.", "eng": "A pupil who is strong in physics but weak in English."}, {"viet": "Một cuộc cách mạng thúc giục quần chúng nhân dân lật đổ chính quyền.", "eng": "A revolutionary who urged the masses to overthrow the government."}, {"viet": "Cuộc xô xát hỗn loạn quanh quầy bán hạ giá trong cửa hàng đó.", "eng": "A scrimmage round the bargain counter in the store."}, {"viet": "Một cảnh tượng làm bạn dựng tóc gáy.", "eng": "A sight that makes you feel creepy."}, {"viet": "Một cậu con trai bốn tuổi và một cô gái 2 tuổi.", "eng": "A son who is four years old and a daughter who is two years old."}, {"viet": "Một người lạ níu tay áo tôi khi tôi bỏ đi.", "eng": "A stranger plucked at my sleeve as I was leaving."}, {"viet": "Một lỗi kỹ thuật nhỏ đã làm tắt đèn khi đang làm việc.", "eng": "A technical hitch prevented the lights from working."}, {"viet": "Một người đảng Bảo thủ trung kiên với trường phái cổ.", "eng": "A true-blue Tory of the old school."}, {"viet": "Một gương mặt quen thuộc nổi tiếng, được giấu tên.", "eng": "A well-known public figure, who shall remain nameless."}, {"viet": "Um ba la-úm ba la nhà ảo thuật vừa nói vừa lôi con thỏ từ trong mũ ra.", "eng": "Abracadabra said the conjuror as he pulled the rabbit from the hat."}, {"viet": "Cộng hết một cột số dài.", "eng": "Add up a long column of figures."}, {"viet": "Sau tất cả vụ xáo động gần đây tình hình đã bắt đầu lắng dịu trở lại.", "eng": "After all the recent excitement things have begun to settle down again."}, {"viet": "Sau vài cuộc bàn luận rất lâu, họ quyết định chấp thuận đề nghị của chúng tôi.", "eng": "After several lengthy discussions, they decided to accept our offer."}, {"viet": "Một lần nữa, xin thật lòng chúc mừng ông.", "eng": "Again, you have my heartiest congratulations."}, {"viet": "Mọi cố gắng của tôi để làm đám trẻ vui lên chỉ gặp phải những gương mặt cau có sưng sỉa.", "eng": "All my attempts to amuse the children were met with sullen scowls."}, {"viet": "Tất cả những người tham dự cuộc tranh cãi đều đã có cơ hội để phát biểu.", "eng": "All the participants in the debate had an opportunity to speak."}, {"viet": "Mặc dù chúng là cặp sinh đôi, nhưng trông chúng khác nhau hoàn toàn.", "eng": "Although they are twins, they look entirely different."}, {"viet": "Một máy bay trong phi đội của Nữ hoàng.", "eng": "An aircraft of the Queen's flight."}, {"viet": "Một lịch sử nghề nghiệp đã chứng minh sự đáng tin cậy của cô ta.", "eng": "An employment history that was proof of her dependability."}, {"viet": "Một nhà máy công nghiệp được lắp thiết bị hiện đại để đáp ứng các qui định mới về an toàn.", "eng": "An industrial plant that was retrofitting to meet new safety regulations."}, {"viet": "Một dàn nhạc chơi trong các rạp chật kín người.", "eng": "An orchestra playing to packed houses."}, {"viet": "Rồi tất cả họ chung sống với nhau hạnh phúc mãi về sau-có vẻ đó là lúc thích hợp để ca hát.", "eng": "And they all lived happily ever afterwards-which sounds like the cue for a song."}, {"viet": "Đồ đạc cổ có nguồn gốc đáng nghi ngờ.", "eng": "Antique furniture of doubtful provenance."}, {"viet": "Ở nước bạn nhiều người bị dị ứng với hải sản phải không?", "eng": "Are many people allergic to seafood in your country?"}, {"viet": "Bạn có rành khu vực này không?", "eng": "Are you familiar with this neighborhood?"}, {"viet": "Hoa tai của chị có phải là loại hoa tai kẹp không?", "eng": "Are your ear-rings clip-ons?"}, {"viet": "Chóng tàn như bông tuyết trên sông.", "eng": "As evanescent as snowflakes on a river."}, {"viet": "Khi nước ùa vào, mang lấy ô-xy từ không khí hòa tan trong nước.", "eng": "As water flows past them, the gills take in oxygen from the air dissolved in the water."}, {"viet": "Ít ra thì cũng khen anh ta vì đã cố gắng.", "eng": "At least give him credit for trying."}, {"viet": "Trợ cụ nghe nhìn cho lớp học.", "eng": "Audio-visual aids for the classroom."}, {"viet": "Hãy cẩn thận khi băng qua đường chính đó.", "eng": "Be careful crossing that main road."}, {"viet": "Bị thương nhẹ trong vụ đụng xe.", "eng": "Be slightly injured in the crash."}, {"viet": "Ở một mình trong bóng đêm làm cho tôi có cảm giác sợ hãi.", "eng": "Being alone in the dark gives me the heebie-jeebies."}, {"viet": "Rau sống thường được ăn chung với nước sốt có vị hơi cay.", "eng": "Bland vegetables are often served with a piquant sauce."}, {"viet": "Tạo ra mối quan hệ hữu nghị giữa các quốc gia thù địch.", "eng": "Bring about a rapprochement between warning states."}, {"viet": "Việc kinh doanh ở Nhật Bản tốt chứ.", "eng": "Business much be good in Japan."}, {"viet": "Nhưng giờ đã quá giờ khởi hành theo lịch trình 15 phút rồi.", "eng": "But now it's 15 minutes past the scheduled departure time."}, {"viet": "Anh ấy được hưởng quyền công dân Anh nhờ ngẫu nhiên sinh ra ở nước Anh.", "eng": "By accident of birth he is entitled to British citizenship."}, {"viet": "California nổi tiếng về rượu vang đúng không?", "eng": "California is famous for its wines, right?"}, {"viet": "Tôi cho bạn xem một vài trò trên máy vi tính nhé?", "eng": "Can I show you some tricks on the computer?"}, {"viet": "Anh có thể cho tôi tá túc đêm nay không?", "eng": "Can you give me a bed for the night?"}, {"viet": "Anh có thể chạy chọt cho tôi để tôi có được việc làm đó không?", "eng": "Can you swing it for me so that I get the job?"}, {"viet": "Ôtô nối đuôi sát nhau trên xa lộ.", "eng": "Cars queueing bumper to bumper on the motorway."}, {"viet": "Con cái thực sự ràng buộc chị, phải không?", "eng": "Children do tie you down, don't they?"}, {"viet": "Lập thủ tục hải quan để lấy hành lý của ai ra.", "eng": "Clear one's luggage through customs."}, {"viet": "Cứ thử nghĩ xem, chính con đường ở phía sau mới là con đường chúng tôi đã phải đi.", "eng": "Come to think of it, that road back there was the one we were supposed to take."}, {"viet": "Chúc mừng và thật lòng cầu mong những điều tốt lành đến với sinh nhật của ông.", "eng": "Congratulations and sincere good wishes on your birthday."}, {"viet": "Chúng ta có thể tóm tắt các điểm chính đã thảo luận được không?", "eng": "Could we have a run-through of the main points discussed?"}, {"viet": "Ông Smith, ông có thể nói cho tôi biết có chuyện gì không?", "eng": "Could you tell me what the matter is, Mr. Smith?"}, {"viet": "Cắt cho chị bạn một ít dứa.", "eng": "Cut some pineapple for your sister."}, {"viet": "Déjà vu là một đặc ngữ Pháp thường được dùng trong tiếng Anh.", "eng": "Déjà vu is a Gallicism often used in English."}, {"viet": "Các thám tử đang săn bắt băng cướp đã được một cú điện thoại nặc danh chỉ điểm chúng.", "eng": "Detectives hunting the gang were put on to them by an anonymous telephone call."}, {"viet": "Anh có xoay sở mua được vé đi xem buổi hoà nhạc chưa?", "eng": "Did you manage to get tickets for the concert?"}, {"viet": "Xếp các ca sĩ theo hình vòng cung.", "eng": "Dispose the singers in a semi-circle."}, {"viet": "Cảnh sát có quyền bắt giữ trong trường hợp này không?", "eng": "Do the police have the right of arrest in this situation?"}, {"viet": "Bạn có thấy là người phương Tây nói chuyện thẳng thắn hơn người Nhật không?", "eng": "Do you feel that Westerners are more direct in their speech than Japanese people?"}, {"viet": "Anh có đeo đồng hồ ở tay anh không?", "eng": "Do you have the time on you?"}, {"viet": "Có phải ý anh nói với tôi là anh đã bỏ ra 1.500 bảng Anh để mua đống sắt vụn đó phải không!", "eng": "Do you mean to tell me you gave £ 1,500 for that pile of scrap metal!"}, {"viet": "Bạn có cho rằng nhiều người bị xét đoán qua dáng vẻ bên ngoài của họ không?", "eng": "Do you think many people are judged by their appearance?"}, {"viet": "Bác sĩ phải giải đoán đúng được các triệu chứng.", "eng": "Doctors must be able to read symptoms correctly."}, {"viet": "Đừng có ngồi tụm tất cả lại, hãy ngồi dãn ra.", "eng": "Don't all sit together, spread yourselves out."}, {"viet": "Đừng có mong tôi thông cảm.", "eng": "Don't expect any sympathy from me."}, {"viet": "Đừng di chuyển cái gì cả nếu không đứa bé sẽ không thức giấc.", "eng": "Don't make any quick movements or the baby will wake up."}, {"viet": "Đừng nói với cô ta bất cứ điều gì bí mật; cô ta là chúa hay bép xép.", "eng": "Don't tell her any secrets; she's so indiscreet."}, {"viet": "Bác sĩ Brown nhận một số bệnh nhân tư.", "eng": "Dr Brown takes some private patients."}, {"viet": "Anh giũ bụi đi-người anh đầy phấn.", "eng": "Dust yourself down-you're covered in chalk."}, {"viet": "Khuyến khích sự phát triển của các doanh nghiệp nhỏ.", "eng": "Encourage the development of small business."}, {"viet": "Tuy nhiên, tôi ước gì tôi có cơ hội đi du lịch thường hơn.", "eng": "Even so, I wish I had the opportunity to travel more often."}, {"viet": "Thẩm vấn một nhân chứng tại tòa án.", "eng": "Examine a witness in a court of law."}, {"viet": "Các nhà thám hiểm đã tiến sâu vào nội địa.", "eng": "Explorers who penetrated deep into the interior."}, {"viet": "Người cha ôm chặt đứa con bé bỏng vào lòng.", "eng": "Father folded the tiny child in his arms."}, {"viet": "Những vấn đề tài chánh đã gây trở ngại đến chương trình xây dựng của chúng tôi.", "eng": "Financial problems have set back our building programme."}, {"viet": "Quần ống loe năm nay không còn hợp thời trang.", "eng": "Flared trousers are out this year."}, {"viet": "Đối với nàng, thi ca là nơi thoát ly trần thế.", "eng": "For her, poetry is a refuge from the world."}, {"viet": "Thành thật mà nói, chúng tôi cần người thông thạo tiếng Anh, vì công ty của chúng tôi là một công ty Anh.", "eng": "Frankly speaking, we need someone with a good command of English, because ours is an English firm."}, {"viet": "Đưa ra một lý do hiệu quả để lẩn tránh.", "eng": "Gave a slick excuse for staying away."}, {"viet": "Người ta nói rằng các hồn ma lẩn quất ở các bức tường của lâu đài.", "eng": "Ghosts are said to stalk the castle walls."}, {"viet": "Dành cho cô ta sự ngưỡng mộ mà cô ta hằng khao khát.", "eng": "Giving her the admiration she craves."}, {"viet": "Hàng hóa bị chậm trễ hoặc thất thoát trong lúc chuyên chở.", "eng": "Goods delayed or lost in transit."}, {"viet": "Một nửa số thanh niên ở quanh đây đều bị thất nghiệp.", "eng": "Half the kids round here are unemployed."}, {"viet": "Khôn ngoan biết chạy vào tránh mưa.", "eng": "Have the sense to come in out of the rain."}, {"viet": "Bạn có bao giờ bị bệnh nặng chưa?", "eng": "Have you ever suffered from a serious illness?"}, {"viet": "Anh đã sắp xếp làm công việc đó thế nào chưa?", "eng": "Have you settled how it will be done?"}, {"viet": "Anh ta là nhà báo của tờ Điện tín hàng ngày.", "eng": "He's a journalist on the Daily Telegraph."}, {"viet": "Anh ấy theo con đường nhạc dân gian đã hai mươi năm.", "eng": "He's been in tin-pan alley for twenty years."}, {"viet": "Anh ta đang bị hôn mê và đang được cứu sống bằng một máy trợ sinh.", "eng": "He's in a coma and is being kept alive by a life-support machine."}, {"viet": "Ông ấy đang giận dữ đến mức không đủ bình tĩnh để gặp bất kỳ ai.", "eng": "He's so angry that he's in no fit state to see anyone."}, {"viet": "Hắn công nhận điều đó là đúng.", "eng": "He acknowledged that it was true."}, {"viet": "Ông ấy yêu cầu họ ngừng trả tiền cho những ngân phiếu bị mất.", "eng": "He asks them to stop payment against the lost cheques."}, {"viet": "Hắn ta không chịu đựng nổi sự hỏi cung nên đành phải thú nhận tất cả các tội lỗi.", "eng": "He broke under questioning and confessed to everything."}, {"viet": "Nó nói huyên thuyên suốt cả đoạn đường.", "eng": "He chattered non-stop all the way."}, {"viet": "Cậu bé khóc bởi vì cậu ta bị đụng đầu gối.", "eng": "He cried because he had hurt his knee."}, {"viet": "Ông ta chết vì đã dùng thuốc an thần quá liều.", "eng": "He died from an overdose of barbiturates."}, {"viet": "Anh ta đã dốc hết mọi thứ trong các túi của mình ra.", "eng": "He emptied his pockets of their contents."}, {"viet": "Anh ta không cảm thấy sự căm ghét nào đối với những người phê bình mình.", "eng": "He felt no animosity towards his critics."}, {"viet": "Anh ta nêu ra với tôi một lý do vớ vẩn tại sao anh ta không đi.", "eng": "He gave me a cockamamy reason for not going."}, {"viet": "Ông ấy vẫy tay chào họ.", "eng": "He greeted them with a wave."}, {"viet": "Anh ấy đã phải chạy ra ngoài một lát rồi.", "eng": "He had to run out for a few minutes."}, {"viet": "Hắn ta bị biệt giam vì đã tấn công một tù nhân khác.", "eng": "He has been put in solitary confinement."}, {"viet": "Anh ta phải trả tiền cấp dưỡng cho người vợ cũ.", "eng": "He has to pay maintenance to his ex-wife."}, {"viet": "Ông ấy là một người tất bật với nhiều công việc đòi hỏi thời gian của ông ta.", "eng": "He is a busy man with many calls on his time."}, {"viet": "Ông ta chẳng băn khoăn về việc mô tả sự bạo động của quần chúng, trong một vài hoàn cảnh, là một phương tiện chính đáng để cải tạo xã hội.", "eng": "He is not queasy about depicting mass violence, in some circumstances, as a legitimate instrument of social transformation."}, {"viet": "Ông ta đã xét xử vô tư vụ đó.", "eng": "He judged the case without partiality."}, {"viet": "Anh ấy thích mơ tưởng mình đã đoạt được một huy chương vàng.", "eng": "He liked to fantasize that he had won a gold medal."}, {"viet": "Anh ấy mất một trong những bộ phận của mô hình động cơ.", "eng": "He lost one of the pieces of his model engine."}, {"viet": "Ông ta đặt đứa con trai trên lưng ngựa.", "eng": "He mounted the boy on the horse."}, {"viet": "Anh ta uống thuốc ngủ quá liều và đã chết.", "eng": "He overdosed on sleeping-pills and died."}, {"viet": "Anh ta thích ngồi ghế bên cửa sổ khi đi xe.", "eng": "He prefers to travel in a seat near the window."}, {"viet": "Anh ấy giận tôi điên lên vì tôi không đồng ý.", "eng": "He raged against me for disagreeing."}, {"viet": "Ông ta vẫn tha thiết với chủ nghĩa tự do, mặc dù sự hăng hái của ông đã nguội đi qua năm tháng.", "eng": "He remained devoted to liberalism, though his ardour cooled over the years."}, {"viet": "Ông ta là một ông già kỳ quặc buồn cười.", "eng": "He's a funny old codger."}, {"viet": "Anh ấy không có khả năng tự kiềm chế.", "eng": "He's capable of holding himself in."}, {"viet": "Cậu ta là con trai của người anh họ tôi vì vậy nó là cháu họ tôi.", "eng": "He's my cousin's son so he's my first cousin once removed."}, {"viet": "Ông ta quá nhu nhược nên không làm một nhà lãnh đạo được.", "eng": "He's too weak to be a leader."}, {"viet": "Hắn nói là lúc đó hắn ở rạp xinê nhưng tôi biết không phải vậy.", "eng": "He says he was at the cinema, but I know different."}, {"viet": "Thế nào nó cũng sẽ về ngày thứ Sáu, do ý Chúa.", "eng": "He should be back by Friday, DV."}, {"viet": "Thỉnh thoảng anh ấy ghé thăm chúng tôi.", "eng": "He sometimes stops by to see us."}, {"viet": "Anh ta lén nhìn cô ta qua gương.", "eng": "He steals a glance to her in the mirror."}, {"viet": "Anh ta đã để cho sự thất vọng chi phối và cuối cùng đã tự sát.", "eng": "He surrendered to despair and eventually committed suicide."}, {"viet": "Nó nén chặt thuốc vào tẩu.", "eng": "He thumbed down the tobacco in his pipe."}, {"viet": "Ông ta đi chào bán thảm cho một hãng lớn ở Luân Đôn.", "eng": "He travels in carpets for a big London firm."}, {"viet": "Hắn nhờ những người bạn có thế lực giúp hắn vào làm việc trong cơ quan nhà nước theo cửa hậu.", "eng": "He used his influential friends to help him get into the civil service by the back door."}, {"viet": "Ông ta là một người nhỏ thó, mập mạp, quan trọng hoá và bẳn tính.", "eng": "He was a corpulent pompous, and short-tempered little man."}, {"viet": "Hắn bị một gián điệp địch mua chuộc để đưa tài liệu bí mật quốc gia.", "eng": "He was blackmailed by an enemy agent into passing on state secrets."}, {"viet": "Ông ta lúng túng khi thấy các vị khách khác ăn mặc trịnh trọng.", "eng": "He was disconcerted to find the other guests formally dressed."}, {"viet": "Anh ta đang bổ rìu vào thân cây.", "eng": "He was hewing away at the trunk of the tree."}, {"viet": "Anh ta nghiện rượu suốt năm năm.", "eng": "He was on the bottle for five years."}, {"viet": "Ông ta sửng sốt khi nghe thằng con của mình chửi thề.", "eng": "He was shocked to hear his child swearing."}, {"viet": "Anh ấy bệnh đến nỗi không ăn gì được.", "eng": "He was too ill to eat."}, {"viet": "Anh ta bị điên và phải vào bệnh viện tâm thần.", "eng": "He went mad and had to be put into a mental hospital."}, {"viet": "Anh ấy thắng ván đầu, tôi thắng ván thứ hai, vậy là chúng tôi hoà.", "eng": "He won the first game and I won the second, so we're even."}, {"viet": "Nghe tiếng xì xồ của nhiều giọng nói.", "eng": "Hear the babble of many voices."}, {"viet": "Cánh tay bà ấy bị thương trầm trọng đến nỗi người ta sẽ phải cắt bỏ nó.", "eng": "Her arm is so badly injured that they will have to amputate it."}, {"viet": "Quần áo cô ta mặc trông tơi tả.", "eng": "Her clothes hung in ribbons about her."}, {"viet": "Mắt cô ta có cái nhìn khẩn cầu thầm lặng.", "eng": "Her eyes held a look of silent appeal."}, {"viet": "Đôi bàn tay cô ta bị đau khắp.", "eng": "Her hands are covered in sores."}, {"viet": "Anbum mới nhất của cô ta là sự gom góp của các đĩa hát đơn hay nhất của cô ấy.", "eng": "Her latest album is a compilation of all her best singles."}, {"viet": "Cuốn tiểu thuyết mới của cô ta được giới phê bình nhiệt liệt tán thưởng.", "eng": "Her new novel was greeted by reviewers with rapturous applause."}, {"viet": "Những câu hỏi của cô ấy làm mọi người nhìn nhau ngơ ngác.", "eng": "Her questions drew blank looks all round."}, {"viet": "Bài diễn văn của bà ấy khiến cả Hạ viện nhao nhao phản đối.", "eng": "Her speech threw the House into a tumult of protest."}, {"viet": "Hành vi buông thả của cô ta chỉ càng làm tăng thêm lòng ghen tuông của anh ta.", "eng": "Her wild behaviour merely fanned the flames of his jealously."}, {"viet": "Chào, tôi là John đến từ New York.", "eng": "Hi, I'm John from New York."}, {"viet": "Sự công kích chính quyền của ông ta là những lời hoàn toàn hằn học.", "eng": "His attack on the government was pure vitriol."}, {"viet": "Sức quyến rũ của anh ta thì không thể chối cãi được, nhưng tôi vẫn không tin anh ta.", "eng": "His charm is undeniable, but I still don't trust him."}, {"viet": "Sự ghê tởm của ông ấy khi nhìn thấy thức ăn thiu thối.", "eng": "His disgust at the sight of the rotting food."}, {"viet": "Dòng họ ông ta đã có từ thời nữ hoàng Elizabeth đệ nhất.", "eng": "His family goes to the time of Queen Elizabeth 1."}, {"viet": "Cái mũ của anh ấy đội không thẳng.", "eng": "His hat isn't on straight."}, {"viet": "Cuốn tiểu thuyết cuối cùng của ông ta tiêu biểu cho sự hoàn tất một thành quả văn chương của ông ta.", "eng": "His last novel represented the completion of his literary achievement."}, {"viet": "Tên của anh ta không có trong danh sách những người được giải.", "eng": "His name did not figure in the list of those who had received awards."}, {"viet": "Những vở kịch của ông ta đã không được hoan nghênh ở Mỹ.", "eng": "His plays have gone down badly in America."}, {"viet": "Bệ hạ, hoàng tử xứ Wales.", "eng": "His Royal High-ness, the Prince of Wales."}, {"viet": "Thành công của anh ta ở một mức độ nào đó cũng là thành công của chúng ta.", "eng": "His success is in a manner of speaking our success, too."}, {"viet": "Vợ ông ta, một người e thẹn lạ lùng, chẳng bao giờ nói gì cả.", "eng": "His wife, a strange little mouse, never said anything."}, {"viet": "Những người đi nghỉ đang tắm nắng ở bờ biển.", "eng": "Holiday-makers sunbathing on the beach."}, {"viet": "Thằng con trai của chị học tiếng Pháp tiến bộ ra sao?", "eng": "How's your son getting on with his French?"}, {"viet": "Làm sao anh có thể làm việc được với bấy nhiêu thứ bừa bãi trên bàn?", "eng": "How can you work with so much clutter on your desk?"}, {"viet": "Anh nhận thấy công việc mới ra ra sao?", "eng": "How do you find your new job?"}, {"viet": "Gửi thư băng đường biển phải mất bao lâu?", "eng": "How long does it take by sea mail?"}, {"viet": "Ở trường cấp hai, bạn học môn toán bao nhiêu tiếng một tuần?", "eng": "How many hours a week did you study math in your junior high school?"}, {"viet": "Bây giờ bao nhiêu tiền một cái máy tính bình thường?", "eng": "How much do you have to pay for a basic, bog-standard computer these days?"}, {"viet": "Chừng nào anh sẽ nói xong?", "eng": "How soon will you be through?"}, {"viet": "Đôi lúc vợ chồng nên hoán đổi vai trò cho nhau.", "eng": "Husband and wife should switch roles with each other occasionally."}, {"viet": "Tôi muốn xem vở ba lê “ Giselle ” do đoàn vũ ba lê Úc trình diễn tại nhà hát Poly Bắc Kinh.", "eng": "I'd like to see ballet Giselle performed by the Australian Ballet at the Beijing Poly Theatre."}, {"viet": "Tôi sẽ lái xe đưa anh ra ga, không vấn đề gì hết.", "eng": "I'll drive you to the station, it's no trouble."}, {"viet": "Tôi sẽ chẳng bao giờ lập gia đình-điều đó giống như ký giấy từ bỏ cuộc đời của mình!", "eng": "I'll never get married-it's like signing your life away!"}, {"viet": "Tôi e rằng hắn phạm tội bịa đặt nhiều.", "eng": "I'm afraid he is guilty of a good deal invention."}, {"viet": "Chiều nay tôi cảm thấy hơi buồn ngủ.", "eng": "I'm feeling a bit dozy this afternoon."}, {"viet": "Tôi gặp khó khăn khi diễn tả rõ ràng ý tưởng của mình trong bài luận văn này.", "eng": "I'm having trouble giving shape to my ideas in this essay."}, {"viet": "Tôi không biết, nhưng tôi sẽ cho cô ấy biết là cô đã gọi.", "eng": "I'm not sure, but I'll tell her you called."}, {"viet": "Tôi lấy làm tiếc nhưng tôi không tới dự tiệc của anh được.", "eng": "I'm sorry but I can't come to your party."}, {"viet": "Tôi đang nghĩ đến việc tận dụng việc giảm giá đặc biệt mà hãng hàng không ABC đang đưa ra để đi Hawaiivào tháng tới.", "eng": "I'm thinking of taking advantage of the special discount ABC Airlines is offering to Hawaii next month."}, {"viet": "Mình bị mệt suốt hai tuần nay.''Thật không may cho cậu!'.", "eng": "I've been feeling ill for two weeks'.'Poor you!'."}, {"viet": "Tôi có một món ăn mới mà tôi muốn anh đến dùng thử.", "eng": "I've got a new dish that I want to try out on you."}, {"viet": "Tôi có điều chỉnh chút ít sơ đồ đặt ghế.", "eng": "I've made a few minor adjustments to the seating plan."}, {"viet": "Mình vừa rửa cái xe cho cậu.''Hay quá nhỉ!'.", "eng": "I've washed the car for you.''Wonders will never cease!'."}, {"viet": "Tôi luôn luôn chỉnh lại đồng hồ vào lúc có tín hiệu báo giờ trên rađiô.", "eng": "I always set my watch by the time-signal on the radio."}, {"viet": "Tôi kiên quyết phản đối đề nghị của anh.", "eng": "I am strongly opposed to your suggestion."}, {"viet": "Tôi rất mệt khi chuyến đi tiếp tục.", "eng": "I became very tired as the trip progressed."}, {"viet": "Tôi đi ra khỏi đền và đi giầy vào.", "eng": "I came out of the mosque and put my shoes back on."}, {"viet": "Tôi không thể đưa anh thêm tiền được nữa vì tôi không nắm quyền kiểm soát chi tiêu.", "eng": "I can't offer you any more money because I don't hold the purse-strings."}, {"viet": "Tôi có thể thưởng thức chuyện khôi hài cũng như bao nhiêu người khác nhưng câu chuyện đùa này đi quá trớn.", "eng": "I can enjoy a joke as well as the next man, but this is going too far."}, {"viet": "Tôi không giải được bài toán này.", "eng": "I can't do this sum."}, {"viet": "Tôi khẩn thiết yêu cầu anh hãy xem xét lại lập trường của mình.", "eng": "I conjure you most earnestly to reconsider your position."}, {"viet": "Tôi vui mừng được uống một tách chè.", "eng": "I'd be glad of a cup of tea."}, {"viet": "Tôi thêu hoa dại và chim.", "eng": "I did an embroidery of wild flowers and birds."}, {"viet": "Tôi gửi kèm theo bản chụp bức thư tôi nhận được ( John Fowles ).", "eng": "I do adjoin a copy of the letter I have received ( John Fowles )."}, {"viet": "Tôi không biết anh ta ở đâu nhưng tôi có thể đánh bạo đưa ra một lời phỏng đoán.", "eng": "I don't know where he is but I could hazard a guess."}, {"viet": "Tôi không nghĩ là cô ta thích tôi-hay chỉ tại tôi hoang tưởng?", "eng": "I don't think she likes me-or am I just being paranoid?"}, {"viet": "Tôi không muốn thúc bách gì nhưng quả thật anh còn nợ tôi 8200 pao.", "eng": "I don't wish to press the point, but you do owe me 8200 pounds."}, {"viet": "Tôi ngủ thiếp đi trong suốt buổi chiếu phim.", "eng": "I dozed off during the film."}, {"viet": "Tôi hy vọng rằng chúng tôi sẽ thành công.", "eng": "I feel hopeful that we shall succeed."}, {"viet": "Tôi thấy mình bị giảm giá trị khi một người nào đó trẻ hơn tôi nhiều lại dám phê bình tôi.", "eng": "I find it belittling to be criticized by someone so much younger than me."}, {"viet": "Tôi rất hồi hộp trước một kỳ thi.", "eng": "I get very strung up before an exam."}, {"viet": "Tôi bị cảm lạnh, vì vậy hôm qua tôi đã không đến trường.", "eng": "I had a cold, so I didn't come to school yesterday."}, {"viet": "Tôi phải trả 500 pao tiền ký quỹ cho chủ nhà trước khi tôi được dọn đến ngôi nhà.", "eng": "I had to pay a 500 pounds deposit to the landlord before I could move into the house."}, {"viet": "Tôi có hẹn với ông Vương, trưởng phòng kinh doanh, lúc 10 giờ 30.", "eng": "I have an appointment with Mr. Wang, the Sales Manager, at 10: 30."}, {"viet": "Tôi không có thời gian rảnh để mà tham gia vào những chuyện ngồi lê đôi mách đâu.", "eng": "I have no time to engage in gossip."}, {"viet": "Tôi cứ thắc mắc suốt từ đó là liệu việc đối đầu trực tiếp với vấn đề ấy có phải là khôn ngoan hơn không.", "eng": "I have wondered since whether it would have been wiser to meet the issue head-on."}, {"viet": "Tôi nghe nói là nhà Newton mở tiệc lớn tối nay.", "eng": "I hear the Newtons are having a big do tonight."}, {"viet": "Tôi hy vọng các cháu đều mạnh khoẻ.", "eng": "I hope the children are all right."}, {"viet": "Tôi đúng là không thể nào xoay sở nổi với 50 bảng anh một tuần.", "eng": "I just can't manage on £ 50 a week."}, {"viet": "Tôi biết là lãi suất của tài khoản ký thác cao hơn lãi suất của tài khoản tiết kiệm nhiều.", "eng": "I know the interest rate is much higher for time deposits than regular savings accounts."}, {"viet": "Thỉnh thoảng tôi cũng thích đi xem opêra.", "eng": "I like to go to the opera now and then."}, {"viet": "Tôi sẽ làm điều đó khi nào có hứng.", "eng": "I'll do it when the humour takes me."}, {"viet": "Chẳng bao lâu nữa tôi sẽ cho hắn biết tay.", "eng": "I'll soon sort him out."}, {"viet": "Tôi đang nướng một cái bánh sinh nhật cho Alex.", "eng": "I'm baking birthday cake for Alex."}, {"viet": "Tôi chỉ chợp mắt một lát thôi.", "eng": "I'm just going to take a nap."}, {"viet": "Tôi rất tiếc hiện giờ ông Hopkis đã đi vắng rồi.", "eng": "I'm sorry Mr. Hopkins is out now."}, {"viet": "Tôi chỉ định nói đùa thôi.", "eng": "I meant it merely as a joke."}, {"viet": "Có thể nói là tôi rất thích cái đó Mà này, sau đó là cái gì?", "eng": "I must say I enjoyed that Now then, what's next?"}, {"viet": "Tôi chẳng bao giờ tin lời những người chào hàng nói với tôi.", "eng": "I never listen to what salesmen tell me."}, {"viet": "Tôi trả tiền thuê nhà cho một người thứ ba, chứ không trả trực tiếp cho chủ nhà.", "eng": "I pay rent to a third party, not directly to the landlord."}, {"viet": "Tôi có phần ngờ là chúng ta đang phạm một sai lầm lớn.", "eng": "I rather suspect we're making a big mistake."}, {"viet": "Tôi lấy làm hối hận là đã trọ tại khách sạn của các cô.", "eng": "I regret having stayed in your hotel."}, {"viet": "Tôi không thấy cả ông Smith lẫn bà Smith ở nhà thờ.", "eng": "I saw neither Mr nor Mrs Smith at church."}, {"viet": "Tôi sẽ không bao giờ đến ở tại khách sạn đó nữa.", "eng": "I shall never ever stay at that hotel again."}, {"viet": "Cả buổi sáng tôi vơ vẩn ngoài vườn.", "eng": "I spent the morning pottering about in the garden."}, {"viet": "Tôi rút lại điều tôi đã nói ( rằng anh ích kỷ ).", "eng": "I take back what I said ( about you being selfish )."}, {"viet": "Tôi nghĩ cái cách chính phủ cứ tiếp tục tăng thuế lên thật là khó chịu.", "eng": "I think it's disgusting the way the government keeps putting up taxes."}, {"viet": "Tôi nghĩ anh rất can đảm.", "eng": "I think you're very brave."}, {"viet": "Tôi đã mến nàng ngay lúc tôi gặp nàng.", "eng": "I took to her the moment I met her."}, {"viet": "Tôi đã từng làm việc trong thành phố.", "eng": "I used to Huong don vim work in the city."}, {"viet": "Tôi muốn những viên gạch này được rời đi, nào mau lên.", "eng": "I want those bricks moved, come on, snap to it."}, {"viet": "Tôi muốn đi Hy Lạp, vợ tôi muốn đi Tây Ban Nha, vì vậy chúng tôi thỏa thuận đi Ý.", "eng": "I wanted to go to Greece, and my wife wanted to go to Spain, so we compromised on Italy."}, {"viet": "Tôi bắt buộc thừa nhận rằng cô ấy có thể đúng.", "eng": "I was forced to concede that she might be right."}, {"viet": "Tôi bối rối vì hành vi lạ lùng của cô ta.", "eng": "I was puzzled by the oddity of her behaviour."}, {"viet": "Tôi không muốn hợp tác nếu không có thêm thông tin.", "eng": "I was unwilling to co-operate without having more information."}, {"viet": "Tôi sẽ sửa cái đèn, chỉ xin đừng cáu gắt với chọc tôi về chuyện đó nữa!", "eng": "I will mend the lamp-just don't keep on at me about it!"}, {"viet": "Tôi sẽ nói toạc móng heo ( với anh ): tôi cho rằng kế hoạch của anh là ngu xuẩn.", "eng": "I won't mince words ( with you ): I think your plan is stupid."}, {"viet": "Tôi sẽ hân hoan tận dụng mọi cơ hội.", "eng": "I would fain improve every opportunity."}, {"viet": "Tôi muốn có ý kiến của anh về bài này.", "eng": "I would like your opinion on this article."}, {"viet": "Nếu một người hang động trông thấy một con chó xù, một con chó sục Skye hay một con Chihuahua, anh ta không thể ngờ rằng đó là một con chó.", "eng": "If a cave man could see a poodle or a Skye terrier or a Chihuahua, he might not even guess that it was a dog."}, {"viet": "Nếu tôi phải lựa chọn giữa món cá và gà, tôi thích món đầu tiên.", "eng": "If I had to choose between fish and chicken I'd prefer the former."}, {"viet": "Sách qua khâu kiểm tra sẽ được đóng gói và gửi đi.", "eng": "If the book passes inspection, it is ready to be packaged and shipped out."}, {"viet": "Nếu chúng ta theo đúng kế hoạch thì công việc sẽ được hoàn thành trong hai tuần.", "eng": "If we keep to the plan, the work should be completed in two weeks."}, {"viet": "Nếu anh cứ tiếp tục cư xử thế này họ sẽ có cớ sa thải anh.", "eng": "If you continue to behave like this you will give them."}, {"viet": "Nếu cậu giữ mình trong sạch, ông chủ có thể đề bạt cậu đấy.", "eng": "If you keep your nose clean, the boss might promote you."}, {"viet": "Nếu anh muốn cắm trại trên cánh đồng này, anh phải xin phép người chủ trại.", "eng": "If you want to camp in this field you must ask the farmer's permission."}, {"viet": "Trong biểu thuế thang bậc, người càng thu nhập nhiều càng phải nộp thuế nhiều.", "eng": "In a graduated tax scheme the more one earns, the more one pays."}, {"viet": "Thực sự, riết rồi con cũng chẳng hiểu nổi mình nữa.", "eng": "In fact, I don't know myself from day to day."}, {"viet": "Theo ý tôi, ông không còn cách lựa chọn nào khác.", "eng": "In my opinion, you have no choice."}, {"viet": "Trong vụ rơi máy bay, anh ta bị nhiều vết thương nặng ở đầu và tay.", "eng": "In the crash he suffered severe injuries to the head and arms."}, {"viet": "Trong những hoàn cảnh đó, ai cũng muốn được một mình.", "eng": "In these circumstances one prefers to be alone."}, {"viet": "Tin tức về cuộc khủng hoảng thật không đầy đủ và khó nắm bắt.", "eng": "Information about the crisis was sketchy and hard to get."}, {"viet": "Một nhà doanh nghiệp bắt đầu đầu tư ở Mỹ có dễ không?", "eng": "Is it easy for an entrepreneur to get start-up funding in the U. S.?"}, {"viet": "Còn chuyến thư nào khác vào buổi chiều không?", "eng": "Is there another mail in the afternoon?"}, {"viet": "Đây có phải là bức tranh một cô gái đẹp đang đuổi bắt bướm vẽ bằng các nét thanh và tinh tế không?", "eng": "Isn't this painting of a pretty girl chasing a butterfly done with fine and delicate strokes?"}, {"viet": "Điều kỳ lạ là hắn vẫn tiếp tục đánh bạc trong khi hắn cứ thua liên miên!", "eng": "It's a wonder he continues to gamble when he always loses!"}, {"viet": "Thật là khó bán một ngôi nhà hiện có người đang ở thuê.", "eng": "It's difficult to sell a house with a sitting tenant."}, {"viet": "Vừa may tôi đã mua áo mưa-trời đang mưa phùn.", "eng": "It's just as well I bought my coat-It's sneezing."}, {"viet": "Không có lệ mặc cả tại những cửa hiệu ở Anh và Mĩ.", "eng": "It's not the custom to haggle in British and American shops."}, {"viet": "Rõ ràng là quá trớn khi cậu đối xử bất lịch sự với khách khứa như vậy.", "eng": "It's surely overstepping the mark to behave so rudely to your guests."}, {"viet": "Đến lượt anh đưa con chó đi dạo.", "eng": "It's your turn to take the dog for a walk."}, {"viet": "Nó có hoa cam đẹp nở vào tháng mười một.", "eng": "It has a beautiful orange flower which blooms in November."}, {"viet": "Thật khó mà tán thành tư cách đạo đức của anh ta được.", "eng": "It is hard to view his conduct in a favourable light."}, {"viet": "Đôi khi việc hút thuốc trong lúc đổi món tại bữa ăn được xem là cách cư xử không lịch sự.", "eng": "It is sometimes considered bad form to smoke between courses at a meal."}, {"viet": "Có lẽ sẽ là một ý kiến hay nếu tôi gặp người buôn bán bất động sản của bạn để xem họ có những căn hộ nào.", "eng": "It might be a good idea to meet your realtor to see what they have listed."}, {"viet": "Rất vui được gặp lại ông, ông Green.", "eng": "It's nice to see you again, Mr. Green."}, {"viet": "Dường như bất cứ khi nào tôi đi đúng hàng hạ giá thì tôi cũng không bao giờ tìm được thứ hàng tôi thích mà vừa cỡ tôi cả.", "eng": "It seems that whenever I go bargain hunting I can never find anything I like in my size."}, {"viet": "Đó là một chiến dịch hoàn hảo của cảnh sát, tất cả bọn phạm tội đã bị bắt và các tài sản bị đánh cắp đã được thu hồi nhanh chóng.", "eng": "It was a copy-book operation by the police, all the criminals were arrested and all the stolen property quickly recovered."}, {"viet": "Trời bắt đầu tối nên tôi chẳng trông thấy gì mà đọc.", "eng": "It was getting dark and I couldn't see to read."}, {"viet": "Chính thời tiết đẹp đã thực sự làm cho ngày nghỉ thú vị.", "eng": "It was the beautiful weather that really made the holiday."}, {"viet": "Từ chối một lời đề nghị tử tế như vậy thật là thô lỗ quá.", "eng": "It would be churlish to refuse such a kind offer."}, {"viet": "Người Nhật thường đến bệnh viện khi họ bị cảm.", "eng": "Japanese people often go to the hospital when they have a cold."}, {"viet": "Joy cứ ba hoa mãi về đám cưới đó.", "eng": "Joy kept yacking about the wedding."}, {"viet": "Nổi tiếng vì tài nghệ điêu luyện trong mọi loại hình thể thao.", "eng": "Known for excellence at all forms of sport."}, {"viet": "Chúng ta hãy nán lại đây một lát để ngắm cảnh đi.", "eng": "Let's stay here for a while and enjoy the sight here."}, {"viet": "Cuộc sống dường như đã mất đi ít nhiều hương vị của nó.", "eng": "Life seems to have lost some of its savour."}, {"viet": "Nhiều ý của anh ta là lấy của các tác giả khác.", "eng": "Many of his ideas were lifted from other authors."}, {"viet": "Hôn nhân không phải là việc làm một cách nông nổi.", "eng": "Marriage is not something to be undertaken lightly."}, {"viet": "Tôi có thể biết các ông có hầm két trong ngân hàng không?", "eng": "May I know if you have a vault in your bank?"}, {"viet": "Này Michael, anh có biết nơi nào cho thuê nhà không?", "eng": "Michael, do you know where the house for rent is?"}, {"viet": "Đa số những người du lịch không lo lắng gì về thời tiết xấu.", "eng": "Most tourists were unconcerned at the poor weather."}, {"viet": "Lời bình luận chân thật của tôi đã bị hiểu lầm là lỗ mãng.", "eng": "My artless comment was mistaken for rudeness."}, {"viet": "Cha tôi luôn luôn giữ thái độ cách biệt đối với tôi.", "eng": "My father always kept me at a distance."}, {"viet": "Ý cô nói là hành lý của tôi quá cân phải không?", "eng": "My luggage is overweight, you mean?"}, {"viet": "Chị tôi đang suy tính một cách nghiêm chỉnh đến việc mua một căn nhà ở thành phố Hồ Chí Minh.", "eng": "My sister is seriously considering buying a house in Ho Chi Minh city."}, {"viet": "Không nơi nào muốn nhận trách nhiệm cả.", "eng": "Neither one wants to accept responsibility."}, {"viet": "Không, tôi không nghĩ đến chuyện lấy chồng không ý nghĩ nào xa hơn thế trong đầu tôi.", "eng": "No, I'm not thinking of getting married-nothing could be further from my mind."}, {"viet": "Không cần đâu, chúng ta sẽ dừng ngay ở cổng.", "eng": "No need, we'll stop right at the gate."}, {"viet": "Bây giờ tôi đã có một ý tưởng chung về hệ thống ngân hàng ở Trung Quốc.", "eng": "Now I have a general idea of the banking system in China."}, {"viet": "Tất nhiên là những cuộc đi bộ dài làm anh mệt đứt hơi-anh biết đấy, đã có tuổi rồi.", "eng": "Of course long walks tire you out-you're not getting any younger, you know."}, {"viet": "Được, thỉnh thoảng em sẽ rửa buồn tắm.", "eng": "OK, I'll wash the bathtub from time to time."}, {"viet": "Một khi ông ta đã quyết định, anh không bao giờ lay chuyển được ông ta ( thay đổi ý kiến của mình ).", "eng": "Once he's made up his mind, you can never budge him ( from his opinion )."}, {"viet": "Một trong những khó khăn kèm theo việc làm ca là sự thiếu ngủ.", "eng": "One of the difficulties attendant on shift work is lack of sleep."}, {"viet": "Trại của chúng tôi chỉ cách đây một quãng đường ngắn.", "eng": "Our camp is only a short haul from here."}, {"viet": "Giờ làm việc của chúng tôi vào ngày chủ nhật là từ 12 giờ đến 6 giờ.", "eng": "Our hours on Sunday are from 12: 00 to 6: 00."}, {"viet": "Chúng tôi đạt tới tốc độ 70 dặm một giờ.", "eng": "Our speed worked up to 70 miles an hour."}, {"viet": "Hằng bao nhiêu trang bằng văn xuôi quan cách.", "eng": "Pages and pages of mandarin prose."}, {"viet": "Dân chúng kéo từng đám đông đến xem đám rước hoàng gia.", "eng": "People came in flocks to see the royal procession."}, {"viet": "Những tấm ảnh là những vật kỉ niệm tốt nhất về kì nghỉ.", "eng": "Photographs make the best holiday souvenirs."}, {"viet": "Ô nhiễm môi trường vẫn còn là một vấn đề hết sức nóng hổi.", "eng": "Pollution is still very much a live issue."}, {"viet": "Sarah đã được trưng dụng để tổ chức bữa tiệc.", "eng": "Sarah has been enlisted to organize the party."}, {"viet": "Bóng dáng của Hitler!'tôi nghĩ, khi tôi nghe tên độc tài đang hô hào đám đông.", "eng": "Shades of Hitler!'I thought, as I listened to the dictator haranguing the crowd."}, {"viet": "Cô bé là một đứa trẻ hiếu động và được mọi người mến.", "eng": "She's a lively child and popular with everyone."}, {"viet": "Cô ta đã bỏ rơi ba bạn trai trong một tháng.", "eng": "She's cast off three boy-friends in a month."}, {"viet": "Cô ta sắc sảo và tôi chắc là cô ta sẽ thành công nếu được tạo cơ hội.", "eng": "She's keen and I'm sure she'll succeed given half a chance."}, {"viet": "Cô ấy ốm đến nỗi không có thứ gì còn ở được trong bụng, kể cả nước.", "eng": "She's so ill that nothing will stay down, not even water."}, {"viet": "Ngay trước lúc qua đời, bà ấy đã bổ sung thêm một khoản vào trong di chúc của bà ấy.", "eng": "She added a codicil to her will just before she died."}, {"viet": "Cô ta dùng bơm xe đạp bơm cái lốp bị xẹp.", "eng": "She blew up the flat tyre with a bicycle pump."}, {"viet": "Bà ấy phàn nàn ở nơi giữ hành lý về những cái túi bị mất của bà ấy.", "eng": "She complained at the luggage counter, about her missing bags."}, {"viet": "Cô ta phủ nhận sự thật.", "eng": "She denied this to be the case."}, {"viet": "Cô ta để con ở nhà mẹ đẻ và đi xem hát.", "eng": "She dumped the kids at her mother's and went to the theatre."}, {"viet": "Cô ấy lục lọi trong túi xách nhưng không tìm thấy vé.", "eng": "She foraged about in her handbag but she couldn't find her ticket."}, {"viet": "Cô ta đã được đề bạt sớm do tiếp quản công việc của một người chết đột ngột.", "eng": "She got early promotion by stepping into dead men's shoes."}, {"viet": "Bà ấy mang thai đến ba lần trong bốn năm.", "eng": "She had three pregnancies in four years."}, {"viet": "Cô ta có nhiều khuyết tật nhưng tất cả chúng tôi đều rất thích cô ấy.", "eng": "She has many faults but we're all very fond of her."}, {"viet": "Bà dạy dỗ tinh thần trách nhiệm xã hội cho con cái.", "eng": "She inculcated a sense of social responsibility in her children."}, {"viet": "Bà ấy được cả nước nói chung kính trọng.", "eng": "She is respected by the country at large."}, {"viet": "Cô ta nhảy lên thuyền và nắm lấy mái chèo.", "eng": "She leapt into a boat and grabbed the oars."}, {"viet": "Bà ấy bị thua trong cuộc bầu cử chỉ với 20 phiếu.", "eng": "She lost the election by a mere 20 votes."}, {"viet": "Cô ta không bao giờ vay mượn cái gì, cô ta thừa khả năng tự lập, không cần phải làm điều đó.", "eng": "She never borrows anything, she's far too independent for that."}, {"viet": "Cô ấy chơi piano giỏi nhưng không có lòng tự tin để chơi trước người khác.", "eng": "She plays the piano well but doesn't have the confidence to play to others."}, {"viet": "Bà ấy không chịu ngã lòng vì tình trạng bệnh tật kéo dài của mình.", "eng": "She refused to be dispirited by her long illness."}, {"viet": "Cô ta được bên an ninh chấp thuận.", "eng": "She's been cleared by security."}, {"viet": "Cô ta đang bị bệnh mất trí nhớ.", "eng": "She's suffering from loss memory."}, {"viet": "Cô ấy dường như vẫn đắm chìm trong đau khổ, mà không cố bình tĩnh lại sau điều bất hạnh.", "eng": "She seemed to be wallowing in her grief, instead of trying to recover from the disaster."}, {"viet": "Cô ta đánh đổ nước bẩn ra bãi cỏ.", "eng": "She slopped the dirty water onto the grass."}, {"viet": "Bà ta đã mạnh mẽ lên án sự đạo đức giả của chính phủ.", "eng": "She strongly denounced the Government's hypocrisy."}, {"viet": "Cô ấy nhón chân đi tới chiếc giường nơi đứa bé đang ngủ.", "eng": "She tiptoed to the bed where the child lay asleep."}, {"viet": "Cô ấy đã từng là một cầu thủ nổi tiếng, nhưng nay cô ấy chỉ còn là hình bóng của mình trước đây.", "eng": "She used to be a great player, but now she's only a shadow of her former self."}, {"viet": "Nàng ngại nhìn thẳng vào mắt của tôi.", "eng": "She was afraid to meet my eye."}, {"viet": "Cô ấy được ra viện khi thấy đã khỏi bệnh máu trắng.", "eng": "She was dismissed from the hospital when found free from leukaemia."}, {"viet": "Con bé ăn uống chểnh mảng, như thể nó không thực sự đói.", "eng": "She was just toying with her food, as if she wasn't really hungry."}, {"viet": "Cô ta bị khiển trách nghiêm khắc về việc cô ta đã làm.", "eng": "She was roundly rebuked for what she had done."}, {"viet": "Cô ấy không cầm được nước mắt.", "eng": "She was unable to keep back her tears."}, {"viet": "Bà ta xem xét kỹ sổ sách kế toán của công ty, tìm kiếm chứng cớ gian lận.", "eng": "She went through the company's accounts, looking for evidence of fraud."}, {"viet": "Cô ta làm việc hết sức để cho mọi thứ xong xuôi vào lúc 6 giờ.", "eng": "She worked hard so that everything would be ready by 6 o'clock."}, {"viet": "Các cửa hàng rất đông người trước lễ Nô-en.", "eng": "Shops are very overcrowded before Christmas."}, {"viet": "Quần áo lụa nhuộm đủ màu sắc cầu vồng.", "eng": "Silks dyed in all the colours of the rainbow."}, {"viet": "Mười sáu thứ xi-rô trong một chút xíu sô-đa thấy mà chán ngắt.", "eng": "Sixteen godoxious syrups is a thimble of soda."}, {"viet": "Cấm hút thuốc lá cho đến khi máy bay ở trên không.", "eng": "Smoking is forbidden until the plane is airborne."}, {"viet": "Vậy ra ông là nhân vật quan trọng ở đây, phải không ạ?", "eng": "So you're the big cheese around here are you?"}, {"viet": "Một vài loại thuốc có thể ảnh hưởng đến thị giác của bạn.", "eng": "Some drugs can affect your sight."}, {"viet": "Một số người đi xe ôtô đến, những người khác đã đi bộ.", "eng": "Some people came by car, others came on foot."}, {"viet": "Có ai đã kể xấu về tôi, có phải không?", "eng": "Someone's been telling tales about me, haven't they?"}, {"viet": "Âm thanh di chuyển chậm hơn ánh sáng.", "eng": "Sound travels more slowly than light."}, {"viet": "Xịt xô đa vào một cái cốc.", "eng": "Squirt soda-water into a glass."}, {"viet": "Cho vỏ chanh và gia vị vào khuấy lên.", "eng": "Stir in the lemon rind and seasoning."}, {"viet": "Stratford-on-Avon, địa điểm thu hút khách du lịch tại Anh.", "eng": "Stratford-on-Avon, the Mecca of tourists in Britain."}, {"viet": "Những ai hôm nay cười mai có thể khóc.", "eng": "Such as laugh to day may weep tomorrow."}, {"viet": "Ánh nắng chiếu qua khung cửa.", "eng": "Sunlight streamed in through the windows."}, {"viet": "Bàn thường được làm bằng gỗ.", "eng": "Tables are usually made of wood."}, {"viet": "Dẫu có tài như vậy anh ta chưa sẵn sàng trở thành người chuyên nghiệp.", "eng": "Talented as he is, he is not yet ready to turn professional."}, {"viet": "Bảo cái thằng vô tích sự ấy dẫn xác đến đây, mà mau lên.", "eng": "Tell that abbreviated piece of nothing to get his tail over here, but fast."}, {"viet": "Cám ơn anh đã cho mượn cái máy xén cỏ lớn.", "eng": "Thanks for lending me your big lawn-mower."}, {"viet": "Cái hộp đó lớn hơn cái này.", "eng": "That box is bigger than this."}, {"viet": "Đó là một cái giá cao một cách phi lý!", "eng": "That is a preposterously high price!"}, {"viet": "Khu căn hộ cũ đó thực là một điều chướng mắt!", "eng": "That old block of flats is a real eyesore!"}, {"viet": "Phát đạn đó là hoàn toàn do may mắn tình cờ.", "eng": "That shot was a sheer fluke."}, {"viet": "Sự thật ( đơn giản ) là tôi đã quên điều đó.", "eng": "The ( plain ) truth is, I forgot about it."}, {"viet": "Bị cáo được đưa đi trong một chiếc xe của cảnh sát.", "eng": "The accused was taken away in a police van."}, {"viet": "Máy bay đang bay về hướng Bắc.", "eng": "The aircraft was flying in a northerly direction."}, {"viet": "Sự thiếu đặc tính của những đường phố song song nhau, xám xịt.", "eng": "The anonymity of the long grey parallel streets."}, {"viet": "Các sĩ quan quân đội lãnh đạo cuộc cách mạng chống lại nhà vua.", "eng": "The army officers led a revolution against the king."}, {"viet": "Khán giả nín thở theo dõi người biểu diễn nhào lộn đi trên sợi dây thừng căng trên cao.", "eng": "The audience held its breath as the acrobat walked along the tightrope."}, {"viet": "Đứa bé sinh non đến năm tuần.", "eng": "The baby was five weeks premature."}, {"viet": "Ngân hàng sẽ cho bạn vay một số tiền.", "eng": "The bank will accommodate you with a loan."}, {"viet": "Vẻ đẹp của chiều tà, của tiếng hát cô ta, của thơ ca.", "eng": "The beauty of the sunset, of her singing, of poetry."}, {"viet": "Lũ chim đậu trên ănten ti vi.", "eng": "The birds perched on the television aerial."}, {"viet": "Cái chốt cửa trượt nhẹ nhàng vào đúng chỗ.", "eng": "The bolt slotted smooth into the place."}, {"viet": "Ông chủ miễn cưỡng tăng lương cho tôi.", "eng": "The boss grudgingly raised my salary."}, {"viet": "Cành cây khi đứa bé leo lên cong xuống nhưng không gẫy.", "eng": "The branch bent but didn't break when the boy climbed along it."}, {"viet": "Toà nhà trở thành một đống gạch vụn.", "eng": "The building was reduced to a heap of rubble."}, {"viet": "Chiếc bánh ngọt được trang trí bằng con số một trăm lớn.", "eng": "The cake was decorated with a large one hundred."}, {"viet": "Chiếc xe ôtô có những tiếng kêu lạch cạch khó chịu ở phía sau.", "eng": "The car has several irritating rattles at the back."}, {"viet": "Những chiếc ô tô bịt các lối ra có thể biến chỗ này thành một cái lò thiêu.", "eng": "The cars blocking the exits could turn this place into a death-trap."}, {"viet": "Nghi lễ khai mạc của Quốc hội là một quang cảnh đẹp mắt.", "eng": "The ceremonial opening of Parliament was a fine spectacle."}, {"viet": "Những cây anh đào đã ra hoa sớm năm nay.", "eng": "The cherry trees blossomed early this year."}, {"viet": "Đứa trẻ đã được thụ thai trong đêm tân hôn của họ.", "eng": "The child was conceived on the night of their wedding."}, {"viet": "Lũ trẻ đó không hề được dạy phép ngắt câu.", "eng": "The children have never been taught punctuation."}, {"viet": "Bọn trẻ con được phân ra thành nhóm để chơi trò chơi đó.", "eng": "The children were separated into groups for the game."}, {"viet": "Cái móc cài trâm của tôi bị gãy.", "eng": "The clasp of my brooch is broken."}, {"viet": "Huấn luyện viên giải thích rõ ràng cuộc chơi trước khi bắt đầu huấn luyện.", "eng": "The coach clarified the rules of the game before commencing training."}, {"viet": "Người bình luận quyết định ứng khẩu báo cáo.", "eng": "The commentator decided to ad lib his way into the report."}, {"viet": "Công ty đang buộc phải giảm bớt nhân viên và tôi e rằng rất có thể tôi là một người bị liệt vào số dư thừa.", "eng": "The company is being forced to reduce staff and I fear I'm a likely candidate."}, {"viet": "Hình dạng của hệ mặt trời.", "eng": "The configuration of the solar system."}, {"viet": "Cái bếp không vừa cỡ với nhà bếp mới của bà.", "eng": "The cooker won't fit into your new kitchen."}, {"viet": "Đất nước bị suy yếu vì chiến tranh, hạn hán và bệnh tật.", "eng": "The country was enfeebled by war, drought, and disease."}, {"viet": "Tên tội phạm đã từng có bốn tiền án.", "eng": "The criminal had had four previous convictions."}, {"viet": "Sự sùng bái bản thân đã trở nên thịnh hành vào thập kỷ 1960.", "eng": "The cult of selfhood that became fashionable in the 1960s."}, {"viet": "Dấu ghi ngày tháng trên bình trà này chỉ ra rằng nó đã một trăm năm.", "eng": "The date-mark on this teapot shows it to be about a hundred years ago."}, {"viet": "Sự mềm mại của làn da đứa bé.", "eng": "The delicacy of a child's skin."}, {"viet": "Biểu đồ trên trang 5 trong chương tiếp.", "eng": "The diagram on page 5 in the next chapter."}, {"viet": "Màn hình đang yêu cầu ông nhập lại số mật.", "eng": "The display board is asking you to enter your secret number again."}, {"viet": "Bác sĩ bảo tôi hít vào rồi thở ra từ từ.", "eng": "The doctor told me to breathe in and then breathe out slowly."}, {"viet": "Con chó đợi một cách đầy hy vọng bên bàn thức ăn.", "eng": "The dog waited hopefully beside the table for some food."}, {"viet": "Người tài xế nhấn còi ra hiệu cho chúng tôi.", "eng": "The driver hooted his horn at us."}, {"viet": "Tình hình kinh tế dường như đều bình thường đối với tôi.", "eng": "The economic situation seemed to me quite normal."}, {"viet": "Lực lượng địch mạnh hơn về quân số.", "eng": "The enemy forces were superior in number."}, {"viet": "Bài tiểu luận thậm chí không mảy may liên quan với chủ đề đó.", "eng": "The essay isn't even remotely relevant to the topic."}, {"viet": "Kinh nghiệm đó làm cho tất cả chúng tôi vô cùng hổ thẹn.", "eng": "The experience was deeply shaming for us all."}, {"viet": "Những cảnh quen thuộc của thời thơ ấu.", "eng": "The familiar scenes of one's childhood."}, {"viet": "Các nhà tổ chức đại hội liên hoan chủ yếu quan tâm đến việc sắp xếp chỗ cho những người xem có trả tiền.", "eng": "The festival organizers were chiefly concerned with putting bums on seats."}, {"viet": "Bộ phim không có gì hay như chương trình truyền hình về giáo dục.", "eng": "The film wasn't anything like as good as ET."}, {"viet": "Hãng đó đã hứa tăng lương cho công nhân.", "eng": "The firm promised to the workers a wage increase."}, {"viet": "Chuyến xe lửa năm giờ luôn luôn chật ních người đi làm.", "eng": "The five o'clock train is always packed with commuters."}, {"viet": "Lực hấp dẫn làm mọi vật rơi xuống đất.", "eng": "The force of gravity makes things fall to earth."}, {"viet": "Giá trị nhiên liệu của một món ăn được tính bằng ca-lo.", "eng": "The fuel value of a food is measured in calories."}, {"viet": "Khí đựng trong bồn được nén lại.", "eng": "The gas is stored under pressure in the tank."}, {"viet": "Ánh sáng lấp lánh của mặt trời trên sóng.", "eng": "The glitter of the sun on the waves."}, {"viet": "Chính phủ vay tiền để thúc đẩy nền kinh tế.", "eng": "The government borrowed money to bolster up the economy."}, {"viet": "Chính quyền đang cố gắng truy quét tận gốc nạn buôn lậu ma túy.", "eng": "The government is trying to wipe out drug trafficking."}, {"viet": "Cỏ cần phải cắt đấy nhưng hôm nay tôi ngại làm lắm.", "eng": "The grass needs cutting but I can't be bothered to it today."}, {"viet": "Những lính gác đã phản bội lại nhà vua và để cho quân địch vào lâu đài.", "eng": "The guards betrayed their King and let the enemy into the castle."}, {"viet": "Con diều hâu sà xuống con mồi và cắp nó đi.", "eng": "The hawk pounced on its prey and carried it off."}, {"viet": "Đập nước cao nhất thế giới là đập Mau-voi-sin ở Thụy Sĩ.", "eng": "The highest dam in the world is Mauvoisin Dam in Switzerland."}, {"viet": "Các con tin đã trải qua một tình cảnh thử thách hãi hùng.", "eng": "The hostages went through a dreadful ordeal."}, {"viet": "Khắp nhà đều có đầy đủ đồ đạc.", "eng": "The house is well furnished throughout."}, {"viet": "Ý tưởng đó xuất phát từ người anh của hắn.", "eng": "The idea originally emanated from his brother."}, {"viet": "Sự tung gián điệp vào một tổ chức.", "eng": "The infiltration of spies into an organization."}, {"viet": "Kẻ đột nhập rút nhanh ra một con dao từ trong túi hắn.", "eng": "The intruder whipped out a knife from his pocket."}, {"viet": "Phóng viên đó đang điều tra vài vụ tai tiếng về tài chính.", "eng": "The journalist was probing into several financial scandals."}, {"viet": "Bọn bắt cóc ép gia đình trả số tiền chuộc là 10000 pao.", "eng": "The kidnappers exacted a ransom of 10000 pounds from the family."}, {"viet": "Chữ in to làm cho việc đọc dễ dàng hơn.", "eng": "The large print makes for easier reading."}, {"viet": "Các vị lãnh đạo đó đã bán rẻ sự tự do của nhân dân.", "eng": "The leaders bargained away the freedom of their people."}, {"viet": "Thang máy nhỏ đến mức chỉ vừa cho ba người đứng ở trong.", "eng": "The lift was so small that only three people could fit in."}, {"viet": "Sau vụ hạn hán dai dẳng là nạn đói kéo dài hàng tháng trời.", "eng": "The long drought was followed by months of famine."}, {"viet": "Sự tiết lộ của tạp chí đó về các bí mật quốc phòng.", "eng": "The magazine's disclosure of defense secrets."}, {"viet": "Viên quản lý đã giải thích với khách hàng tại sao hàng lại về chậm.", "eng": "The manager has explained to customers why the goods were late."}, {"viet": "Ông thị trưởng trao tặng các giải thưởng tại ngày hội thể thao của trường.", "eng": "The mayor gave away the prizes at the school sports day."}, {"viet": "Những người đó, mặc dù làm việc chăm chỉ, là một toán không có kinh nghiệm.", "eng": "The men, although working hard, were an unseasoned crew."}, {"viet": "Ông bộ trưởng đã bị báo chí đả kích kịch liệt về các vụ cắt xén.", "eng": "The minister was slammed by the press of the cuts."}, {"viet": "Mặt trăng chiếu sáng bằng ánh sáng phản chiếu.", "eng": "The moon shines with reflected light."}, {"viet": "Xu hướng tiến tới sự thoải mái nhiều hơn trong các kiểu thời trang.", "eng": "The movement towards greater freedom in fashion styles."}, {"viet": "Sự cần thiết chuyển nhà cho những người ở các khu phố cũ tồi tàn.", "eng": "The need to rehouse people in the inner cities."}, {"viet": "Luật mới sẽ có hiệu lực từ ngày mai.", "eng": "The new law takes effect from tomorrow."}, {"viet": "Luật thuế mới sẽ nhằm đánh vào các doanh nghiệp nhỏ.", "eng": "The new tax laws will clobber small businesses."}, {"viet": "Chương trình tiếp theo sẽ được Mary Davidson giới thiệu.", "eng": "The next programme is introduced by Mary Davidson."}, {"viet": "Số lượng báo bán ra có vẻ như là tỷ lệ nghịch với lượng tin tức nó đăng tải.", "eng": "The number of copies the paper sells seems to be in inverse ratio proportion to the amount of news it contains."}, {"viet": "Vị sĩ quan đó đã về phép vào đêm Chủ Nhật.", "eng": "The officer reported back from leave on Sunday night."}, {"viet": "Bà già run rẩy bước xuống gác.", "eng": "The old woman walked unsteadily down the stairs."}, {"viet": "Bản viết tay gốc nằm trong viện bảo tàng.", "eng": "The original manuscript rests in the museum."}, {"viet": "Báo cáo trong số những vấn đề khác còn đề cập tới những vấn đề chính trị, kinh tế và toà án.", "eng": "The paper discussed, inter alia political, economic and judicial issues."}, {"viet": "Tại điểm này con đường mòn bắt đầu lên dốc nhiều hơn.", "eng": "The path started to ascend more steeply at this point."}, {"viet": "Nhân dân đã nổi lên chống lại chế độ độc tài quân sự.", "eng": "The people revolted against the military dictatorship."}, {"viet": "Mẫu đẹp nhất trong mùa thời trang mới.", "eng": "The pick of the new season's fashions."}, {"viet": "Kế hoạch đó không thành công tốt đẹp lắm.", "eng": "The plan didn't work out very well."}, {"viet": "Vở kịch đó có một số cảnh được bố trí theo kiểu điển hình của Stoppard.", "eng": "The play contains a number of typical Stoppard set pieces."}, {"viet": "Cảnh sát thật mất thể diện vì đến quá muộn.", "eng": "The police, to their discredit, arrived too late."}, {"viet": "Cảnh sát không có gì cụ thể để tiếp tục.", "eng": "The police have nothing concrete to go on."}, {"viet": "Viên cảnh sát ghi chép từng lời chị nói.", "eng": "The policeman noted down every word she said."}, {"viet": "Chức vụ chủ tịch luân phiên trong số các hội viên của ủy ban.", "eng": "The post of chairman rotates among members of the committee."}, {"viet": "Vận mệnh của tổng thống cuối cùng hình hư đã tốt đẹp hơn.", "eng": "The President's fortune seem, at last, to have taken a turn for the better."}, {"viet": "Giá tiền là 20 pao tiền phòng và bữa điểm tâm, 25 pao tiền phòng và các bữa ăn.", "eng": "The price is 20 pounds for bed and breakfast, 25 pounds full board."}, {"viet": "Người tù cào vào cửa xà lim với nỗi tuyệt vọng.", "eng": "The prisoner clawed at the cell door in desperation."}, {"viet": "Sự dự đoán về việc phát triển trong tương lai của nền công nghiệp điện tử rất đáng phấn khởi.", "eng": "The prognosis for the future of the electronics industry is encouraging."}, {"viet": "Phép chữa bệnh bằng tâm lý được tiến hành trong những nhóm nhỏ có quan hệ tác động lẫn nhau.", "eng": "The psychotherapy is carried out in small interactive groups."}, {"viet": "Nữ hoàng đi thăm Canada với tư cách cá nhân.", "eng": "The Queen is making a private visit to Canada."}, {"viet": "Những thay đổi nhanh chóng trên nét mặt của ai đó.", "eng": "The rapid alterations in somebody's facial expression."}, {"viet": "Trọng tài đã bị kết tội thiên vị đội nhà.", "eng": "The referee was accused of being partial towards the home team."}, {"viet": "Những người cứu nạn đã đào xuyên một đường hầm đến chỗ những người thám hiểm hang động.", "eng": "The rescuers tunnelled their way to the pot-holers."}, {"viet": "Gã thanh niên giàu có chán ngấy sự lạc thú.", "eng": "The rich young man was satiated with pleasure."}, {"viet": "Con đường đó kéo dài qua sa mạc đến tận đằng xa.", "eng": "The road stretched across the desert into the distance."}, {"viet": "Rễ của cây này ăn sâu xuống đất.", "eng": "The roots of this plant go deep."}, {"viet": "Những cánh buồm căng phồng trong gió.", "eng": "The sails swelled out in the wind."}, {"viet": "Toà nhà của trường học có hình dáng của một quảng trường lòng chảo với sân chơi ở giữa.", "eng": "The school buildings formed a hollow square, with a playground in the middle."}, {"viet": "An ninh của đất nước đã lâm nguy.", "eng": "The security of the country had been imperiled."}, {"viet": "Các hòn đá sắc cạnh đã cứa rách đôi bàn chân anh ta.", "eng": "The sharp stones lacerated his feet."}, {"viet": "Việc vận chuyển dầu từ Trung Đông.", "eng": "The shipping of oil from the Middle East."}, {"viet": "Trông thấy cái xác chết, nó lạnh ớn cả người.", "eng": "The sight of the dead body made his blood run cold."}, {"viet": "Xe trượt tuyết tăng động lượng khi nó chạy xuống đồi.", "eng": "The sledge gained momentum as it ran down the hill."}, {"viet": "Những người lính ngủ qua đêm trong kho lúa.", "eng": "The soldiers bedded down in a barn."}, {"viet": "Giọng nói của diễn giả vang lên giữa đám đông.", "eng": "The speaker's voice thrilled the crowd."}, {"viet": "Hình thức bên ngoài chuẩn mực của tiểu thuyết lịch sử.", "eng": "The standard accouterments of the historical novel."}, {"viet": "Cơn bão quăng con tàu vào đá.", "eng": "The storm dashed the ship against the rock."}, {"viet": "Các học sinh bị cấm ra khỏi trường trong giờ học.", "eng": "The students were forbidden to be out of the school boundary during school hours."}, {"viet": "Mặt đường lung linh dưới ánh nắng gắt.", "eng": "The surface of the road shimmered in the heat of the sun."}, {"viet": "Thầy giáo đoán trước mười lăm học sinh của ông sẽ trúng tuyển.", "eng": "The teacher forecast that fifteen of his pupils would pass the exam."}, {"viet": "Điện thoại reo lúc nửa đêm làm tôi hơi giật mình.", "eng": "The telephone rang in the middle of the night and gave me a bit of a jolt."}, {"viet": "Tên trộm bị tù một năm.", "eng": "The thief was sent to prison for a year."}, {"viet": "Lăng mộ của hoàng đế nằm không xa Tây An.", "eng": "The Tomb of the Yellow Emperor is located not far from Xi'an."}, {"viet": "Chiếc tàu hoả dừng đột ngột, suýt nữa thì hất tôi ra khỏi giường.", "eng": "The train stopped abruptly, nearly tipping me out of my bunk."}, {"viet": "Rắc rối là do ông không ấn đúng nút.", "eng": "The trouble is you didn't push the correct buttons."}, {"viet": "Hai vận động viên chạy tranh đua sít sao-suốt quãng đường cứ bám sát nhau từng bước.", "eng": "The two runners contested the race closely-it was nip and tuck all the way."}, {"viet": "Những hậu quả không lường trước được của một cuộc chiến tranh lớn.", "eng": "The unpredictable consequences of a major war."}, {"viet": "Đứa bé nhà quê chưa quen với đời sống thành phố.", "eng": "The village boy was strange to city life."}, {"viet": "Máy giặt và máy sấy khô ở đằng kia.", "eng": "The washing machine and drier are over there."}, {"viet": "Toàn bộ sự việc đã được phóng đại quá mức.", "eng": "The whole affair was blown up out of all proportion."}, {"viet": "Cánh con chim hãy còn vẫy sau khi bị bắn rơi.", "eng": "The wings of the bird still fluttered after it had been shot down."}, {"viet": "Các công nhân làm việc vất vả cả ngày để sửa chữa mái nhà.", "eng": "The workers toiled a way all day to repair to roof."}, {"viet": "Tôi thấy những người hoạt động sân khấu là một nhóm có phần nội giao.", "eng": "Theatre people are a rather incestuous group, I find."}, {"viet": "Ngôn ngữ của họ là một sự pha tạp hỗn độn giữa tiếng Anh va tiếng Pháp.", "eng": "Their language is an indiscriminate mixture of French and English."}, {"viet": "Vậy, một săn-uýt bò và một ít cốm.", "eng": "Then, one beef sandwich and some puffed rice."}, {"viet": "Có một bà tên là bà Myles đang gọi cho ông.", "eng": "There's a certain Mrs. Myles on the phone for you."}, {"viet": "Ở đây không có việc gì để làm cả.", "eng": "There's bugger-all to do in this place."}, {"viet": "Có bệnh nhiễm vi rút đang lây lan trong cơ quan.", "eng": "There's some virus going round the office."}, {"viet": "Có nhiều chỗ bắt chước Shakespeare trong tác phẩm của anh ta.", "eng": "There are many echoes of Shakespeare in his work."}, {"viet": "Có ba căn nhà trống ở phố chúng ta.", "eng": "There are three empty houses in our street."}, {"viet": "Anh ta thường vẫn ngồi đấy hàng giờ.", "eng": "There he'll sit hour after hour."}, {"viet": "Có một cách có thể chứng minh dễ dàng rằng ánh sáng trắng được cấu tạo bởi tất cả các màu sắc của cầu vồng.", "eng": "There is an easy way of showing that white light is made up of all the colors of the rainbow."}, {"viet": "Và cả Khải Hoàn Môn nữa.", "eng": "There is the Arch of Triumph."}, {"viet": "Một kỷ nguyên mới của sự dồi dào vật chất trong những năm 50 và mức sống nâng cao.", "eng": "There was a new era of material affluence in the fifties and living standards rose."}, {"viet": "Có một gã tựa vào ô tô của tôi.", "eng": "There was this fella leaning on my car."}, {"viet": "Trong ngày hôm nay thỉnh thoảng sẽ có mưa rào.", "eng": "There will be occasional showers during the day."}, {"viet": "Những kẻ có những sở thích kỳ cục này đến ngắm nhìn chằm chằm những tai nạn giao thông.", "eng": "These ghouls who come and stare at road accidents."}, {"viet": "Bít tất này bán 1 pao một đôi.", "eng": "These socks are going at 1 pound a pair."}, {"viet": "Từ khi lấy nhau họ rất trưởng giả.", "eng": "They've become very bourgeois since they got married."}, {"viet": "Ở tòa nhà này thì chúng làm bằng xi măng.", "eng": "They are cement in this building."}, {"viet": "Họ tin rằng án tử hình nên được huỷ bỏ.", "eng": "They believed the death penalty should be abolished."}, {"viet": "Họ không thể chịu đựng được thời tiết lạnh.", "eng": "They could not withstand the cold weather."}, {"viet": "Họ đánh giá ngôi nhà đó 2 triệu đô la.", "eng": "They estimated that the house costs $ 2 million."}, {"viet": "Họ phải kiếm một người thay thế chỗ của người lái xe đang nghỉ phép.", "eng": "They had to engage a substitute to take the place of the driver, who was on leave."}, {"viet": "Họ đã biết bức tranh đó là của rởm, hơn nữa, họ còn biết ai đã vẽ nó.", "eng": "They knew the painting was a forgery, moreover, they knew who had painted it."}, {"viet": "Họ trộn xi măng và sau đó xếp lên xe tải.", "eng": "They mix the cement and then put it in the truck."}, {"viet": "Họ để nhiều yêu cầu vào hệ thống đó với niềm tin là nó không thể phá huỷ được.", "eng": "They put more and more demand on the system in the belief that it was indestructible."}, {"viet": "Họ giương một cái bẫy và anh ta sa ngay vào đó.", "eng": "They set a trap for him and he walked right into it."}, {"viet": "Họ tìm cách lôi kéo cô ta ( ở lại ) bằng những đề nghị đề bạt.", "eng": "They tried to tempt her ( into staying ) with offers of promotion."}, {"viet": "Chúng nó hoàn toàn bị âm nhạc mê hoặc.", "eng": "They were completely entranced by the music."}, {"viet": "Họ sẽ khấu trừ phí bảo hiểm trong tổng số tiền.", "eng": "They will deduct insurance premium from the total amount."}, {"viet": "Nhà văn này lôi cuốn bạn đọc.", "eng": "This author takes his readers With him."}, {"viet": "Quyển sách hướng dẫn nấu ăn này do một tay hưởng lạc thật sự viết.", "eng": "This cookery book has been written by a real epicure."}, {"viet": "Từ khi anh tiếp nhận cái hãng này, nó đã xuống dốc!", "eng": "This firm's gone to the dogs since you took over!"}, {"viet": "Tôi là Jason Stone ở Công ty APL.", "eng": "This is Jason Stone from the APL Corporation."}, {"viet": "Câu chuyện đùa này không thích hợp để kể khi có cả phụ nữ.", "eng": "This joke isn't suitable to be told in a mixed company."}, {"viet": "Cuốn tiểu thuyết này dựa vào những sự kiện lịch sử.", "eng": "This novel is based on historical facts."}, {"viet": "Trung đoàn này đã được thoả thuận giao cho mặt trận phía đông.", "eng": "This regiment is already committed to the eastern front."}, {"viet": "Cuộc khảo sát này đúng là công việc của một tay nhà nghề thực thụ.", "eng": "This survey is the work of a real professional."}, {"viet": "Mấy con mèo đó đã gào hàng giờ liền.", "eng": "Those cats have been screaming for hours."}, {"viet": "Món sườn cừu hôm nay rất ngon, quý khách có muốn dùng món này làm món chính không ạ?", "eng": "Today's mutton chop is very good, would you like to have it as the main course?"}, {"viet": "Giao thông đạt tới cao điểm giữa 8 giờ và 9 giờ sáng.", "eng": "Traffic reaches a peak between 8 and 9 in the morning."}, {"viet": "Nhiều đề nghị khác nhau được đưa ra để gia tăng doanh số bán hàng hoá.", "eng": "Various proposals were put forward to increasing sales."}, {"viet": "Nước chảy xối xả qua các cửa cống.", "eng": "Water went rushing through the lock gates."}, {"viet": "Chúng tôi sẽ bắt đầu lúc 9 giờ sáng mai.", "eng": "We'll start at 9 o'clock tomorrow morning."}, {"viet": "Chúng ta chỉ đi hai ngày, anh không cần mang nhiều đồ dùng như thế!", "eng": "We're only going for two days, you don't need to bring so much gear!"}, {"viet": "Chúng ta phải tiến hành công việc chứ không quay lại từ đầu.", "eng": "We've got to get this done without going back to square."}, {"viet": "Nhà hàng chúng tôi cũng phục vụ món sườn heo nướng với hành tây, sườn heo ôm đậu trắng, thịt cừu hầm, cật hầm rượu vang đỏ, và nhiều món ăn khác nữa.", "eng": "We also serve Grilled Pork Chop with Onion, Braised Pork Chop with White Beans, Stewed Mutton, Kidney in Red Wine, and many other dishes."}, {"viet": "Chúng tôi vẫn còn thấm thía bài học của tai hoạ đó!", "eng": "We are still absorbing the lessons of this disaster!"}, {"viet": "Chúng ta không thể đi tiếp theo đường này vì đã có biển ghi Cấm vào.", "eng": "We can't go along that road because the sign says No Entry."}, {"viet": "Chúng tôi tính mười đô la Mỹ tiền sử dụng.", "eng": "We charge ten US dollars for use."}, {"viet": "Chúng ta không nhìn thấy hoặc sờ thấy được.", "eng": "We do not see them or feel them."}, {"viet": "Chúng tôi thấy những đứa trẻ bị bắt sợ run lại ở một góc.", "eng": "We found the kidnapped children cowering in a corner."}, {"viet": "Chúng tôi phải loại trừ John khỏi đội vì anh ấy bị đau chân.", "eng": "We had to exclude john from the team because he hurt his leg."}, {"viet": "Chúng tôi đã có được một vài tiến bộ hướng tới việc đạt được một hiệp định.", "eng": "We have made some progress towards reaching an agreement."}, {"viet": "Chúng tôi túm tụm quanh ngọn lửa cho ấm.", "eng": "We huddled round the fire to keep warm."}, {"viet": "Chúng tôi đã tìm khắp nơi những không thể tìm ra nó.", "eng": "We looked everywhere but we couldn't find it."}, {"viet": "Chúng ta phải đoàn kết chống lại sự đe doạ đó.", "eng": "We must league together against this threat."}, {"viet": "Chúng tôi đã trả vượt giá cho ngôi nhà đó để có thể chắc chắn mua được nó.", "eng": "We offered over the odds for the house to make sure we got it."}, {"viet": "Chúng tôi gạt bỏ ý kiến thành lập câu lạc bộ âm nhạc và quyết định có một câu lạc bộ nghệ thuật thay vào đó.", "eng": "We rejected his idea for a music club, and decided to have an art club instead."}, {"viet": "Chúng tôi chuồn đi Paris nghỉ cuối tuần.", "eng": "We slipped away to Paris for the weekend."}, {"viet": "Chúng tôi thường sang Pháp vào mùa hè, nhưng năm nay chúng tôi sẽ đi Tây Ban Nha để thay đổi.", "eng": "We usually go to France in the summer, but this year we're going to Spain for a change."}, {"viet": "Chúng bị chậm mất hai tiếng đồng hồ vì công việc sửa đường.", "eng": "We were delayed by road-works for two hours."}, {"viet": "Chúng ta sẽ phải triển khai mọi biện pháp để thắng cuộc bầu cử này.", "eng": "We will have to deploy all our resource to win this election."}, {"viet": "À, về áo vét bà không có nhiều kiểu để chọn đâu.", "eng": "Well, for a vest you don't have much choice in design."}, {"viet": "À, bí quyết mua sắm thành công là đến đó sớm trước mọi người.", "eng": "Well, the key to successful shopping is to get there early before the crowd."}, {"viet": "Vui lòng cho biết bưu phí gửi một bức thư đi Trung Quốc là bao nhiêu ạ?", "eng": "What's the postage for a letter to China, please?"}, {"viet": "Những phẩm chất gì cấu thành nên tính cách của cô ấy?", "eng": "What are the qualities that make up her character?"}, {"viet": "Bạn thích điều gì nhất về đất nước của bạn?", "eng": "What do you like best about your home country?"}, {"viet": "Chuyện gì sẽ xảy ra nếu tôi làm mất chìa khoá của tôi?", "eng": "What if I lose my key?"}, {"viet": "Lực lượng lao động đầy đủ nhất có được bao nhiêu?", "eng": "What is the strength of the work-force?"}, {"viet": "Những tên gọi nào được ưa chuộng ở nước bạn?", "eng": "What names are popular in your country?"}, {"viet": "Bác thường ăn sáng lúc mấy giờ?", "eng": "What time do you usually have breakfast?"}, {"viet": "Khi nào chúng tôi có thể đón anh đến ăn tối được?", "eng": "When can we expect you for dinner?"}, {"viet": "Khi tôi đến cửa hàng, tôi sẽ tìm xem họ có thứ bánh quy mà bạn ưa thích không.", "eng": "When I go to the store, I'll look and see if they have your favorite cookies."}, {"viet": "Khi cây to đổ xuống nó làm đổ theo hai cây nhỏ hơn ở bên cạnh.", "eng": "When the big tree fell, it brought down two of its smaller neighbours."}, {"viet": "Khi đi du lịch ở Ý, chúng tôi dừng lâu nhất ở Rôm.", "eng": "When we toured Italy we spent most time in Rome."}, {"viet": "Tôi thanh toán tiền ở đâu?", "eng": "Where do I pay for it?"}, {"viet": "Bạn thích nhạc nào, nhạc jazz hay nhạc pop?", "eng": "Which do you prefer, jazz or pop music?"}, {"viet": "Trong thời gian một con bướm đêm hay bướm thường còn là một nhộng thì có nhiều biến đổi lớn diễn ra.", "eng": "While the moth or butterfly is a pupa, great changes take place."}, {"viet": "Ai mách cho anh biết hiệu ăn này thế?", "eng": "Who put you on to this restaurant??"}, {"viet": "Sao anh không đi dạo một lát, như thế anh ăn bữa trưa sẽ ngon miệng.", "eng": "Why don't you go for a walk, it'll give you an appetite for your lunch."}, {"viet": "Liệu có đủ xăng cho chúng ta đến London không?", "eng": "Will the petrol last out till we reach London?"}, {"viet": "Bác sẽ đánh thức cháu dậy lúc 6 giờ 30 nhé?", "eng": "Will you wake me up at six thirty?"}, {"viet": "Với công việc bầu cử chỉ cách có ba ngày, chính phủ đã tính sai thời gian về việc công bố tăng thuế.", "eng": "With the election only three days away, the government badly mistimed its announcement of tax increases."}, {"viet": "Tôi muốn một ít Chivas Regal.", "eng": "Would like some Chivas Regal, please."}, {"viet": "Mời cô đi với tôi nhé?", "eng": "Would you like to join me?"}, {"viet": "Bạn nhắc lại điều đó một lần nữa cho tôi nhé?", "eng": "Would you repeat that again for me?"}, {"viet": "Có, tôi có hai chai rượu uýt-ky và một tút thuốc điếu.", "eng": "Yes, i've got two bottles of whisky and a carton of cigarettes."}, {"viet": "Hôm qua, tôi nhìn thấy một người trông giống bạn.", "eng": "Yesterday, I saw someone who looks like you."}, {"viet": "Anh chỉ phải tin vào lời tôi là đủ.", "eng": "You'll just have to take what I say on trust."}, {"viet": "Chị mặc áo len nhầm đằng trước ra đằng sau rồi.", "eng": "You're wearing your jumper the wrong way round."}, {"viet": "Xin mời anh đến ăn cơm với chúng tôi, chỉ có gì ăn nấy thôi.", "eng": "You are welcome to eat with us, but you'll have to take pot luck."}, {"viet": "Anh có thể tự hào một cách chính đáng về thành tựu của mình.", "eng": "You can be justly proud of your achievement."}, {"viet": "Anh có thể biết được nó đang tức giận khi nó bắt đầu la hét ầm ĩ.", "eng": "You can tell he's angry when he starts shouting a lot."}, {"viet": "Anh lái trước rồi chúng ta sẽ đổi phiên cho nhau.", "eng": "You drive first and then we'll switch round."}, {"viet": "Anh không được lấy hoa, tuy có nhiều người cũng lấy.", "eng": "You haven't got to take flowers but many people do."}, {"viet": "Anh muốn nói cô Ann Smith hay là cô Mary Smith?", "eng": "You mean Miss Anne Smith or Miss Mary Smith?"}, {"viet": "Khi khách vào câu lạc bộ, anh phải ghi tên của họ.", "eng": "You must sign guests in when they enter the club."}, {"viet": "Bạn biết không, đó là loại cửa hàng tự phục vụ.", "eng": "You see, it's a kind of help-yourself service."}, {"viet": "Đừng có hình dung làm một việc như thế.", "eng": "You shouldn't dream of doing sth such a thing."}, {"viet": "Ông sẽ tìm thấy bên phải của ông.", "eng": "You will find it on your right."}, {"viet": "Vụ án của anh sẽ được xét lại vào tháng năm.", "eng": "Your case is coming up for review in May."}, {"viet": "Phòng của ông số 928 ở tầng chín.", "eng": "Your room is # 928 on the 9th floor."}]