[{"viet": "Một quyển sách đề cao sự khủng khiếp của chiến tranh.", "eng": "A book which glorifies the horrors of war."}, {"viet": "Một hội từ thiện giúp trẻ con không nhằm mục đích kiếm lãi.", "eng": "A children's charity that is non-profit-making."}, {"viet": "Một hợp đồng có thể kết thúc trong vòng một tháng từ ngày thông báo.", "eng": "A contract terminable at a month's notice."}, {"viet": "Một hẻm núi sâu ngăn đôi thành phố đó.", "eng": "A deep gorge separates the two halves of the city."}, {"viet": "Cái áo đầm gài móc sau lưng.", "eng": "A dress that is hooked at the back."}, {"viet": "Một cuốn phim được phụ đề cho các khán giả nói tiếng Anh.", "eng": "A film that was subtitled for English-speaking audiences."}, {"viet": "Một học bổng dồi dào để cho những người thụ hưởng được tự do hành động.", "eng": "A generous scholarship that lets recipients write their own ticket."}, {"viet": "Một nhóm bạn của tôi sẽ họp mặt nhau để uống rượu và nghe nhạc.", "eng": "A group of my friends are getting together to have some drinks and listen to some music."}, {"viet": "Một lỗ thủng ở đũng quần của anh ta.", "eng": "A hole in the seat of his trousers."}, {"viet": "Một nhóm người cãi nhau ngoài quán rượu.", "eng": "A knot of people arguing outside the pub."}, {"viet": "Một cái vỗ nhẹ trên vai.", "eng": "A light tap on the shoulder."}, {"viet": "Một tai nạn nghiêm trọng trên đường cao tốc.", "eng": "A major accident on the expressway."}, {"viet": "Một sự xúc phạm nhỏ làm cái cớ cho sự tấn công của họ.", "eng": "A minor offence which provided a peg to hang their attack on."}, {"viet": "Chính phủ mới đã được lựa chọn.", "eng": "A new government was chosen."}, {"viet": "Một màn khói dày đặc bao trùm cả thành phố.", "eng": "A pall of smoke hung over the town."}, {"viet": "Một tên móc túi chạm trán với pháp luật.", "eng": "A pick pocket who ran foul of the law."}, {"viet": "Một bàn xoay làm đồ gốm cho phép người thợ gốm xoay tròn đất sét lúc anh ta tạo dáng cho nó.", "eng": "A potter's wheel lets the potter turn the clay round and round as he shapes it."}, {"viet": "Một sự liếc mắt nhanh qua những đầu đề của tờ báo.", "eng": "A quick glimpse at the newspaper headlines."}, {"viet": "Một nhóm con buôn thao túng giá cả ở cuộc bán đấu giá đồ cổ.", "eng": "A ring of dealers controlling prices at an antiques auction."}, {"viet": "Một toa hạng hai trên xe lửa.", "eng": "A second-class carriage on the train."}, {"viet": "Một tội phạm pháp hơn là một thiếu sót.", "eng": "A sin of commission rather than omission."}, {"viet": "Một kỷ niệm để cho bạn và thân bằng quyến thuộc nâng niu.", "eng": "A souvenir for you and yours to cherish."}, {"viet": "Một cô giáo nghiêm khắc không dung túng học sinh mình nói bậy bạ.", "eng": "A strict teacher who brooks no nonsense from her pupils."}, {"viet": "Nhiệt độ 10 độ C âm.", "eng": "A temperature of 10 degrees of frost."}, {"viet": "Một cái nháy mắt làm mất hết vẻ trang nghiêm trong cách cư xử của ông ta.", "eng": "A twinkle in his eye which belied the gravity of his demeanour."}, {"viet": "Một cuộc quyên góp cho các nhân viên vệ sinh văn phòng.", "eng": "A whip-round for the office cleaners."}, {"viet": "Nhận, bác bỏ, đưa ra, chuyển giao một tối hậu thư.", "eng": "Accept, reject, issue, deliver an ultimatum."}, {"viet": "Điều chỉnh độ căng của vợt tennis.", "eng": "Adjust the tension of a tennis racket."}, {"viet": "Sau khi được đưa lùi về hai trăm năm trước, chúng tôi bất ngờ được quay trở lại ở thời điểm hiện tại.", "eng": "After being taken back 200 years, we were suddenly returned to the present day."}, {"viet": "Sau sáu tháng thực hiện đề án, cuối cùng tôi cảm thấy tôi có tiến bộ.", "eng": "After six months'work on the project, at last I feel I'm getting somewhere."}, {"viet": "Những kẻ quấy rối đang kích động nhân dân nổi loạn.", "eng": "Agitators were exciting the people to rebel."}, {"viet": "Đột nhiên lốp xe nổ tung.", "eng": "All of a sudden, the tyre burst."}, {"viet": "Tất cả các phòng đều đã được đặt trước cho tối nay.", "eng": "All the rooms have been booked for tonight."}, {"viet": "Nên có sẵn dụng cụ sơ cứu.", "eng": "Always keep a first-aid kit handy."}, {"viet": "Một sự thay đổi quan điểm khó nhận ra.", "eng": "An almost imperceptible shift of opinion."}, {"viet": "Một diễn viên nhại giọng các chính khách một cách hài hước.", "eng": "An entertainer who does hilarious imitations of politicians'voices."}, {"viet": "Một vụ vi phạm luật giao thông.", "eng": "An infringement of the highway code."}, {"viet": "Một sự phức tạp, rắc rối của tổ chức bí hiểm.", "eng": "An organization of Byzantine complexity."}, {"viet": "Và chúng tôi sẽ gửi cho ông một bộ bản sao nội bộ chứng từ gửi hàng để ông có thể chuẩn bị mọi thứ để nhận hàng đúng thời gian sắp xếp, khi hàng đến cảng của ông.", "eng": "And we are sending you under cover one set of duplicate shipping documents so that you can make all the preparations to take the delivery of the goods in due time, when they arrive at your port."}, {"viet": "Bất kỳ người nào bị bắt gặp đổ rác bừa bãi sẽ bị truy tố.", "eng": "Any person found leaving litter will be prosecuted."}, {"viet": "Người Nhật tử tế và lịch sự phải không?", "eng": "Are the Japanese kind and polite?"}, {"viet": "Các cuộc điều tra của anh có tiến triển thêm được gì không?", "eng": "Are you getting anywhere with your investigations?"}, {"viet": "Không phải anh hơi hấp tấp khi cho rằng tôi sẽ trả tiền đấy chứ?", "eng": "Aren't you rather previous in assuming I am going to pay?"}, {"viet": "Còn về món tráng miệng, chúng tôi sẽ dùng bánh nướng nhân táo.", "eng": "As for dessert, we'll have apple pie."}, {"viet": "Khi bạn đến gần thị trấn, tòa nhà đầu tiên bạn thấy là cái nhà thờ.", "eng": "As you approach the town the first building you see is the church."}, {"viet": "Có lúc tôi nghĩ rằng nàng sẽ từ chối, thế mà cuối cùng nàng cũng đồng ý.", "eng": "At one point I thought she was going to refuse, but in the end she agreed."}, {"viet": "Sự tự động hóa có nghĩa là mất đi nhiều việc làm trong nhà máy này.", "eng": "Automation will mean the loss of many jobs in this factory."}, {"viet": "Thận trọng về những điều bạn nói với hắn ta.", "eng": "Be careful of what you say to him."}, {"viet": "Bảo đảm phải mang bản ghi nhớ đổi tiền của ông theo.", "eng": "Be sure to bring your exchange memo with you."}, {"viet": "Đi đâu cũng bị nhận ra ngay là cái giá anh phải trả cho sự nổi tiếng.", "eng": "Being recognized wherever you go is the price you pay for being famous."}, {"viet": "Những người mù nhờ cậy nhiều vào xúc giác.", "eng": "Blind people rely a lot on touch."}, {"viet": "Mang lại cho buổi họp một cái vẻ trật tự nào đấy.", "eng": "Bring the meeting to some semblance of order."}, {"viet": "Nhưng ông nhớ cái đêm khi ông hôn tôi lần đầu chứ?", "eng": "But do you remember the night when you kissed me for the first time?"}, {"viet": "Nhưng trong vài ngày nữa sẽ có vài kiểu mới.", "eng": "But some new ones will be coming in within a few days."}, {"viet": "Nhờ cứ làm thêm bài tập ở nhà, cậu bé đã tiến bộ hơn hẳn đám bạn cùng lớp.", "eng": "By doing extra homework, he soon got ahead of his class-mates."}, {"viet": "Hãy gọi số này để biết thêm chi tiết, với cước phí điện thoại do người nghe trả.", "eng": "Call this number toll-free for further information."}, {"viet": "Việc đó có thể được thực hiện vào khoảng chiều nay không?", "eng": "Can it be done by this afternoon?"}, {"viet": "Bạn có thể cho tôi biết sơ về việc đang xảy ra không?", "eng": "Can you give me some inkling of what is going on?"}, {"viet": "Cô có thể cho tôi biết đôi điều về dịch vụ giặt ủi ở khách sạn có được không?", "eng": "Can you tell me something about your laundry service?"}, {"viet": "Chụp bóng đang nẩy lên lần đầu.", "eng": "Catch a ball on the first bounce."}, {"viet": "Lũ trẻ mất hết tính thơ ngây khi chúng lớn lên.", "eng": "Children lose their innocence as they grow older."}, {"viet": "Leo lên hết những nấc thang này quả là một việc cần cố gắng thực sự.", "eng": "Climbing all these stairs is a real sweat."}, {"viet": "Một khu thương mại mới mở mang ở vùng ngoại ô thị trấn.", "eng": "Commercial development on the outskirts of the town."}, {"viet": "Các nhà sành điệu được theo sát với diễn tiến của sân khấu nghệ thuật hiện nay.", "eng": "Connoisseurs who are plugged into the current art scene."}, {"viet": "Anh xách va li giùm tôi được không?", "eng": "Could you carry my case for me?"}, {"viet": "Con vặn nước vào bồn tắm giúp ba khi con đang ở trên gác được không?", "eng": "Could you turn on the bath for me while you're upstairs?"}, {"viet": "Bố ơi, bố có rảnh một chút không?", "eng": "Dad, have you got a minute?"}, {"viet": "Cung cấp vật liệu đến một vị trí xây dựng.", "eng": "Deliver the materials to a building site."}, {"viet": "Phát triển một lý thuyết mới bằng cách tổng hợp một số lý thuyết trước đó.", "eng": "Develop a new theory by the synthesis of several earlier theories."}, {"viet": "Ông đã nhấn đúng nút số mật của ông rồi phải không?", "eng": "Did you push the correct buttons for your secret number?"}, {"viet": "Những ý nghĩ lo lắng cứ len vào tâm trí của tôi.", "eng": "Disturbing thoughts crowded into my mind."}, {"viet": "Họ cũng có thu báo cũ phải không?", "eng": "Do they collect old newspapers as well?"}, {"viet": "Anh có đi biển hàng ngày không?", "eng": "Do you go in the sea every day?"}, {"viet": "Ông có đen hộ chiếu theo không?", "eng": "Do you have your passport with you?"}, {"viet": "Ông có phiền gì nếu tôi hút thuốc không?", "eng": "Do you mind if I smoke?"}, {"viet": "Bạn có nghĩ là những sự trùng hợp ngẫu nhiên có ý nghĩa nào đó không?", "eng": "Do you think that coincidences have meaning?"}, {"viet": "Công việc mới có chiếm vị trí quan trọng trong dự tính tương lai của anh không?", "eng": "Does a new job feature in your future plans?"}, {"viet": "Đừng đòi hỏi ở tôi quá nhiều.", "eng": "Don't ask a lot from me."}, {"viet": "Đừng quên chải đầu trước khi bạn đi ra đường!", "eng": "Don't forget to comb your hair before you go out!"}, {"viet": "Đừng bỏ lỡ cơ hội này; nó có thể không bao giờ tới nữa.", "eng": "Don't miss this opportunity; it may never come again."}, {"viet": "Đừng đụng vào các đồ nghề đó-Chúng không phải là đồ của mày.", "eng": "Don't touch those tools-they are not your property."}, {"viet": "Hãy vẽ hình ngôi nhà để chúng tôi biết nó trông ra sao.", "eng": "Draw a picture of the house so we know what it looks like."}, {"viet": "Mỗi ngân hà có chứa hằng hà sa số các tinh tú.", "eng": "Each galaxy contains myriads of stars."}, {"viet": "Quân địch đột kích ngay trước rạng đông.", "eng": "Enemy troops struck just before dawn."}, {"viet": "Chỉ cần nghĩ tới cô ấy thôi anh ấy cũng thấy khó chịu.", "eng": "Even the thought of her was distasteful to him."}, {"viet": "Trừ chuyện cậu bé bị ngã ngựa.", "eng": "Except the boy fell off his horse."}, {"viet": "Tỏ ra hối tiếc vì đã làm điều sai trái.", "eng": "Express sorrow for having done wrong."}, {"viet": "Nỗi khiếp sợ lan tràn trong đám đông như một bệnh dịch lây lan.", "eng": "Fear spread through the crowd like a contagion."}, {"viet": "Ở trong hoàn cảnh khó xử.", "eng": "Find oneself in an embarrassing situation."}, {"viet": "Có những chỗ lỗi trên mặt trái của tấm lụa.", "eng": "Flaws on the reverse of the silk."}, {"viet": "Đối với tôi, chúng ta ăn đâu cũng được cả.", "eng": "For my part, I don't mind where we eat."}, {"viet": "Tự do cho tất cả mọi người, bất luận thuộc chủng tộc hoặc tín ngưỡng nào.", "eng": "Freedom for all, regardless of race or creed."}, {"viet": "Ngắm bức tranh lộng lẫy đó đối với tôi là một kinh nghiệm hầu như huyền bí.", "eng": "Gazing at that majestic painting was for me an almost transcendental experience."}, {"viet": "Phát vào mông đứa bé một cái bốp.", "eng": "Give a child a smack on the bottom."}, {"viet": "Tự hào về sự tự do, thành công của mình.", "eng": "Glory in one's freedom, success, etc."}, {"viet": "Đã xoay sở giao được sáu chuyến hàng trước buổi trưa.", "eng": "Got in six deliveries before noon."}, {"viet": "Trao quyền lực cho một chính phủ đã được bầu ra.", "eng": "Hand over power to an elected government."}, {"viet": "Có muôn vàn lý do cho việc đi muộn.", "eng": "Have umpteen reasons for being late."}, {"viet": "Bạn có bao giờ thử dự cuộc kiểm tra trình độ thông thạo tiếng Nhật chưa?", "eng": "Have you ever tried to take the Japanese Proficiency Test?"}, {"viet": "Bạn có thử tìm ở những trang vàng chưa?", "eng": "Have you tried the yellow pages?"}, {"viet": "Nó là kẻ khả nghi hàng đầu trong vụ giết người.", "eng": "He's a prime suspect in the murder case."}, {"viet": "Suốt ngày nó cứ hỏi tôi những câu hỏi ngớ ngẩn.", "eng": "He's been plaguing me with silly questions on day."}, {"viet": "Nó đang được nhà chức trách địa phương chăm sóc.", "eng": "He's in the care of the local authority."}, {"viet": "Anh ta hay nghi ngờ đến mức không tin cả mẹ mình.", "eng": "He's so suspicious he would distrust his own mother."}, {"viet": "Ông ấy trộn thêm cát vào đất để nó dễ ngấm nước hơn.", "eng": "He added sand to the soil to make it more porous."}, {"viet": "Hắn gạt tôi tin là hắn đánh mất hết tiền của hắn.", "eng": "He bamboozled me into believing that he'd lost all his money."}, {"viet": "Anh ta đột nhiên xông vào cuộc họp của chúng tôi và bị đuổi ra với lời khiển trách nặng nề.", "eng": "He burst into our meeting and got sent away with a flea in his ear."}, {"viet": "Nó nhận là nó có thể khiến ma hiện ra.", "eng": "He claimed that he could make ghosts materialize."}, {"viet": "Anh ta cắt một mét ở cuộn vải đó ra.", "eng": "He cut off a mere of cloth from the roll."}, {"viet": "Anh ta chẳng bao lâu thì chết chỉ vì hận thù và bực tức mà thôi.", "eng": "He died soon after of pure despite and vexation."}, {"viet": "Anh ta vui thích trong buổi tiệc.", "eng": "He enjoyed himself at the party."}, {"viet": "Ông ta lại cảm thấy sức thu hút của biển cả.", "eng": "He felt the pull of the sea again."}, {"viet": "Ông ấy ra lệnh công tác phải khởi sự ngay.", "eng": "He gave orders that the work should be started immediately."}, {"viet": "Anh ta rên rỉ khi bị trúng đạn.", "eng": "He grunted as the bullet hit him."}, {"viet": "Ông ta đấm mạnh tay lên bàn.", "eng": "He hammered on the table with his fist."}, {"viet": "Anh ta xử tệ với vợ của mình.", "eng": "He has behaved shamefully towards his wife."}, {"viet": "Ông ta nổi tiếng là một viên chức xuất sắc.", "eng": "He has won a reputation as a pluperfect bureaucrat."}, {"viet": "Anh ta làm nghề thợ sơn và trang trí.", "eng": "He is a painter and decorator."}, {"viet": "Anh ta là một trong những người ăn mặc tệ nhất mà tôi biết.", "eng": "He is one of the worst dressed men I know."}, {"viet": "Anh ta chỉ ngồi nhìn chăm chăm qua cửa sổ.", "eng": "He just sat gazing through the window."}, {"viet": "Thỉnh thoảng anh ta lại thích kiếm chuyện than phiền đủ điều.", "eng": "He likes to have to good gripe from time to time."}, {"viet": "Nó đã nốc hết bốn panh bia trong vòng một tiếng đồng hồ.", "eng": "He lowered four pints of beer in an hour."}, {"viet": "Hắn phải kiểm tra lại bài làm của mình cẩn thận hơn-nó đầy rẫy lỗi đó.", "eng": "He must check his work more carefully-it's full of mistakes."}, {"viet": "Ông ta sở hữu một bất động sản to lớn ở Tô Cách Lan.", "eng": "He owns a large estate in Scotland."}, {"viet": "Nó làm ra bộ không biết cô ta nhưng trong thực tế hai người cấu kết với nhau.", "eng": "He pretended not to know her but in fact they were in leagues together."}, {"viet": "Hắn cầm dao chạy sấn sổ tới tôi.", "eng": "He ran at me with a knife."}, {"viet": "Anh ấy đổi mới bằng lái xe.", "eng": "He renewed his driving licence."}, {"viet": "Anh ấy là một loại siêu nhân về trí tuệ.", "eng": "He's a kind of intellectual superman."}, {"viet": "Trước kia hắn đã làm nhiều điều ngu ngốc, nhưng đây là điều ngu xuẩn nhất.", "eng": "He's done stupid things before, but this really takes the biscuit."}, {"viet": "Anh ấy chẳng xa lạ gì với chuyện bất hạnh.", "eng": "He's no stranger to misfortune."}, {"viet": "Hắn rất chặt chẽ về tiền bạc.", "eng": "He's very close with his money."}, {"viet": "Anh ta liếc nhìn giấy tờ trước khi rời văn phòng.", "eng": "He scans the papers before leaving for office."}, {"viet": "Ông ta không nên được trao quyền chỉ huy binh lính.", "eng": "He should not be given command of troops."}, {"viet": "Anh ta nói tiếng Anh giọng Đức rất nặng.", "eng": "He speaks English with a strong German accent."}, {"viet": "Anh ấy còn phải thực hiện nghĩa vụ quân sự.", "eng": "He still has to do his military service."}, {"viet": "Anh ấy bơi ở ngoài biển quanh năm.", "eng": "He swim in the sea all year round."}, {"viet": "Anh ta nói với tôi là anh ta đã không làm gì sai trái cả.", "eng": "He told me he had done nothing wrong."}, {"viet": "Hắn thử thách lòng kiên nhẫn của tôi hết mức giới hạn của nó.", "eng": "He tried my patience to its limits."}, {"viet": "Trước đây anh ta sống phong lưu thuộc giai cấp trung lưu lớp trên.", "eng": "He used to live in upper middle-class affluence."}, {"viet": "Anh ta là một nạn nhân của hoàn cảnh.", "eng": "He was a victim of circumstances."}, {"viet": "Anh ta sinh ra với một bàn chân dị dạng làm cho anh ta đi khập khiễng.", "eng": "He was born with a slight deformity of the foot which made him limp."}, {"viet": "Hắn uống thứ sâm banh rẻ tiền với vẻ ăn chơi.", "eng": "He was drinking cheap champagne with a raffish air."}, {"viet": "Vào dịp này hắn đã được phục sức một cách chỉnh tề không chê vào đâu được.", "eng": "He was impeccably dressed for the occasion."}, {"viet": "Ông ta là một trong những người lãnh đạo của phong trào cải cách.", "eng": "He was one of the leading spirits of the reform movement."}, {"viet": "Nó bị tách riêng ra để chịu hình phạt.", "eng": "He was singled out for punishment."}, {"viet": "Ông ta đã được huấn luyện thành một kỹ sư.", "eng": "He was trained as an engineer."}, {"viet": "Ông ta đã cất công tiếp xúc với đủ loại cư dân.", "eng": "He went out of his way to touch base with a broad cross section of residents."}, {"viet": "Ông ấy đội một chiếc mũ, đi đôi găng tay và mặc một cái áo khoác.", "eng": "He wore a hat, gloves and and overcoat."}, {"viet": "Đun nóng bơ cho đến khi nó ngả màu nâu.", "eng": "Heat the butter until it browns."}, {"viet": "Thái độ kiêu ngạo của bà ta ở tòa án hoàn toàn gây bối rối cho đối thủ.", "eng": "Her arrogant behaviour on court psyched her opponent out completely."}, {"viet": "Sự gắn bó của bà ta với một sự nghiệp lớn đã chuyển từ một cuộc tham gia vận động thành một nỗi ám ảnh.", "eng": "Her commitment to a great cause degenerated from a crusade into an obsession."}, {"viet": "Khuôn mặt cô ta hằn sâu vẻ đau khổ.", "eng": "Her face bore the deep imprint of suffering."}, {"viet": "Chiếc nón của cô ấy bay đi và rơi xuống tận sông.", "eng": "Her hat flew off and landed up in the river."}, {"viet": "Tiểu thuyết mới nhất của bà ta hoàn toàn khác tác phẩm trước của bà.", "eng": "Her latest novel is quite unlike her earlier work."}, {"viet": "Những ghi chú của bà ta chỉ cho chúng tôi một bản phác thảo về lý thuyết của bà.", "eng": "Her notes give us just the bare skeleton of her theory."}, {"viet": "Những lời nói làm yên lòng cô ấy đã xua tan nỗi sợ hãi của chúng tôi.", "eng": "Her reassuring words dispelled our fears."}, {"viet": "Tinh thần bà ấy phấn khởi trở lại khi nghe tin vui.", "eng": "Her spirits rallied on hearing the good news."}, {"viet": "Tác phẩm của cô ấy là một hỗn hợp lạ lùng của các phong cách âm nhạc.", "eng": "Her work is a stranger amalgam of musical styles."}, {"viet": "Lãi suất cao làm người ta gửi nhiều tiền hơn vào ngân hàng.", "eng": "High interest rates make people deposit more money in the bank."}, {"viet": "Quan điểm của ông ta đối với ngành sân khấu là phải đạt hiệu quả kinh tế.", "eng": "His attitude toward the theatre is very commercial."}, {"viet": "Con hắn là một nỗi thất vọng đối với hắn với.", "eng": "His children are a disappointment to him."}, {"viet": "Việc rượu chè của ông bắt đầu trở thành một vấn đề.", "eng": "His drinking is getting to be a problem."}, {"viet": "Cha của anh ấy rất ốm và sắp vào bệnh viện để kiểm tra.", "eng": "HIs father is very ill and is going into hospital for observation."}, {"viet": "Thời tiết đã ảnh hưởng bất lợi cho sức khoẻ của anh ấy.", "eng": "His health was adversely affected by the climate."}, {"viet": "Sự tiêu xài hào phóng của anh ta khiến anh ta có nhiều bạn.", "eng": "His lavish spending won him many friends."}, {"viet": "Sự mất bình tĩnh của hắn thấy thấy rõ ngay từ đầu.", "eng": "His nervousness was obvious right from the start."}, {"viet": "Quyền lực chính trị của ông ta đã đến hồi mạt vận.", "eng": "His political power plunged to its lowest ebb."}, {"viet": "Viên thư ký phải chịu đựng tính khí hung hãn của ông ta.", "eng": "His secretary has to bear the brunt of his temper."}, {"viet": "Đề nghị của anh ta ngu ngốc đến phát buồn cười.", "eng": "His suggestion was so stupid as to be risible."}, {"viet": "Vợ ông ta thì rất đẹp, nhưng dường như không lịch thiệp.", "eng": "His wife was very beautiful, but seemed to have no personality."}, {"viet": "Kem nhà làm lấy là một trong các đặc sản của chúng tôi.", "eng": "Home-made ice-cream is one of our specialities."}, {"viet": "Đi chơi vào ngày chủ nhật nhé.", "eng": "How about going out on Sunday."}, {"viet": "Sao anh có thể ủng hộ một hành vi như thế?", "eng": "How could you countenance such behaviour?"}, {"viet": "Bạn thấy thời tiết thế nào?", "eng": "How do you like the weather?"}, {"viet": "Cô ta đã làm cho anh bao lâu?", "eng": "How long has she been in your employ?"}, {"viet": "Anh muốn dùng bao nhiêu viên đường, hai hay ba?", "eng": "How many lumps of sugar do you want, two or three?"}, {"viet": "Gửi một bưu thiếp tới Nhật mất bao nhiêu tiền?", "eng": "How much does it cost to send a postcard to Japan?"}, {"viet": "Thứ bột giặt này so với thứ anh thường dùng thì anh thấy tốt như thế nào?", "eng": "How well do you think this washing powder stacks up against your usual brand?"}, {"viet": "Thói đạo đức giả là nguyên nhân gây thối nát trong linh hồn một người.", "eng": "Hypocrisy is the canker in the soul of a man."}, {"viet": "Tôi muốn ở đây cho tới tận lễ Giáng Sinh.", "eng": "I'd like to stay here up until Christmas."}, {"viet": "Tôi sẽ liên hệ với bạn để cho biết chi tiết cụ thể.", "eng": "I'll get back to you with the particulars."}, {"viet": "Tôi sẽ mua thứ gì cho bữa tối trên đường về nhà.", "eng": "I'll pick up something for dinner on my way home."}, {"viet": "Tôi e rằng tôi không thể nhớ được-chuyện ấy lâu quá rồi.", "eng": "I'm afraid I can't remember-it was such a long time ago."}, {"viet": "Tôi thấy bữa tiệc này vô cùng buồn tẻ.''Hai ta nghĩ như nhau!'.", "eng": "I'm finding this party extremely dull.''That makes two of us!'."}, {"viet": "Tôi hoàn toàn mù tịt về kỹ thuật máy tính-Tôi chẳng hiểu mô tê gì về nó cả.", "eng": "I'm in a complete fog about computer technology-I don't understand it at all."}, {"viet": "Tôi không nhạc nhiên thấy anh ta bị phá sản, xét tới những việc liều lĩnh anh ta làm.", "eng": "I'm not surprised he went bust, considering the risks he was taking."}, {"viet": "Tôi rất tiếc là đã làm hỏng những chuẩn bị.", "eng": "I'm sorry I hashed up the arrangements."}, {"viet": "Tôi chán ngấy nghe những lời chỉ trích của anh rồi.", "eng": "I'm tired of listening to your criticism."}, {"viet": "Tôi vẫn sống quanh quẩn ở châu Âu từ khi gặp anh lần cuối cùng.", "eng": "I've been kicking around Europe since I saw you last."}, {"viet": "Tuần này tôi có một thời gian biểu rất bận rộn.", "eng": "I've got a very busy timetable this week."}, {"viet": "Tôi chưa bao giờ bị đau lưng, nhưng tôi nghe nói nó kinh khủng lắm.", "eng": "I've never had back pain, but I heard it's awful."}, {"viet": "Tôi sẽ cử một thợ ống nước đến siết chặt nó ngay.", "eng": "I'll send a plumber to tighten it right away."}, {"viet": "Tôi vẫn cứ tưởng chị là y tá, tôi thắc mắc tại sao anh lại có cảm tưởng ấy?", "eng": "I always thought you were a nurse, I wonder how you got that impression?"}, {"viet": "Tôi mệt mỏi với việc bị dùng làm kẻ giơ đầu chịu báng cho tất cả các lỗi lầm ở cơ quan.", "eng": "I am tired of being used as the whipping-boy for all the mistakes that are made in the office."}, {"viet": "Tôi bắt đầu dùng khuỷu tay huých để len qua đám đông.", "eng": "I began elbowing my way through the crowd."}, {"viet": "Tôi không thể giải thích hành vi lạ lùng của cô ấy.", "eng": "I can't account for her strange behaviour."}, {"viet": "Tôi không thể đưa ra bất cứ một lý do đặc biệt nào cho việc đó.", "eng": "I can't point to any one particular reason for it."}, {"viet": "Tôi chỉ vừa đủ sống bằng đồng lương tôi hiện có, không có tiền cho các thứ xa xỉ.", "eng": "I can hardly exist on the wage I'm getting, there is no money for luxuries."}, {"viet": "Tôi không thể cạy miệng cô ta được đâu.", "eng": "I can't get her to talk at all."}, {"viet": "Tôi chỉnh lại đồng hồ theo tín hiệu giờ.", "eng": "I corrected my watch by the time signal."}, {"viet": "Tốt hơn tôi nên đi thang máy vậy.", "eng": "I'd better take the elevator."}, {"viet": "Tôi đã cố gắng hết sức để chặn đứng chúng.", "eng": "I did my utmost to stop them."}, {"viet": "Tôi không có tham vọng hiểu được lí thuyết.", "eng": "I do not pretend to understand the theory."}, {"viet": "Tôi không biết tại sao, nhưng ngay khi mới gặp nó tôi đã ghét cay ghét đắng.", "eng": "I don't know why, but I took a strong dislike to him as soon as I saw him."}, {"viet": "Tôi nghĩ chúng không có vị nhiều lắm.", "eng": "I don't think they have much taste to them."}, {"viet": "Tớ cóc cần, nó nói tỉnh bơ.", "eng": "I don't care, he said airily."}, {"viet": "Thỉnh thoảng tôi cũng uống một tách cà phê, nhưng thường thì tôi uống trà.", "eng": "I drink an occasional cup of coffee, but usually I take tea."}, {"viet": "Tôi không có cảm xúc gì khác ngoài sự khinh miệt đối với những người đối xử với trẻ em độc ác như thế.", "eng": "I feel nothing but contempt for people who treat children so cruelly."}, {"viet": "Tôi thấy âm nhạc trong quán rượu rất khó chịu.", "eng": "I find the music in the bar very obtrusive."}, {"viet": "Tôi đi ngang nhà thờ mỗi sáng trên đường đi làm.", "eng": "I go by the church every morning on my way to work."}, {"viet": "Sáng nay tôi nhận được thư của anh tôi.", "eng": "I had a letter from my brother this morning."}, {"viet": "Tôi phải chạy để bắt kịp xe buýt.", "eng": "I had to run to catch the bus."}, {"viet": "Tôi đã từng ở tù, vì thế tôi có nhiều sự thông cảm với những người khác trong tù.", "eng": "I have been a prisoner, so I have a lot of sympathy with other people in prison."}, {"viet": "Tôi không có gì để nói về những lời than phiền của ông.", "eng": "I have nothing to say with regard to your complaints."}, {"viet": "Tôi cảm thấy không không khỏe khoảng 2 ngày rồi.", "eng": "I haven't been feeling well for about two days."}, {"viet": "Tôi nghe nói các bạn uống nhiều trà.", "eng": "I hear you drink a lot of tea."}, {"viet": "Tôi hy vọng sự bất đồng này không làm tổn hại tình bạn chúng ta.", "eng": "I hope this agreement won't cloud our friendship."}, {"viet": "Tôi chỉ cần hỏi số điện thoại từ người nhà của ông.", "eng": "I just got the number from your family."}, {"viet": "Tôi biết anh đã có một ngày tồi tệ-nhưng không cần phải trút cả lên đầu tôi!", "eng": "I know you've had a bad day-but there's no need to take it out on me!"}, {"viet": "Tôi thích cây cối vì chúng hình như chịu đựng được môi trường phải sống hơn các vật khác.", "eng": "I like trees because they seem more resigned to the way they have to live than other things do."}, {"viet": "Tôi sẽ bố trí một cuộc họp.", "eng": "I'll fix up a meeting."}, {"viet": "Tao sẽ dạy cho mày bài học khi dám gọi tao là kẻ nói láo!", "eng": "I'll teach you to call me a liar!"}, {"viet": "Tôi là David Brown ở phòng 722.", "eng": "I'm David Brown in Room 722."}, {"viet": "Tôi đang tìm người quản lý.", "eng": "I'm looking for the manager."}, {"viet": "Tôi vẫn giữ ý kiến ban đầu của tôi.", "eng": "I'm sticking with my original idea."}, {"viet": "Tôi gặp Janet hôm qua và tự nhiên thấy mến cô ta.", "eng": "I met Janet yesterday, and I'm rather smitten with her."}, {"viet": "Tôi phải bắt đầu làm bản báo cáo đó tối nay.", "eng": "I must tackle that report this evening."}, {"viet": "Trước đây tôi chưa hề nghĩ anh có thể vào đội hàng đầu.", "eng": "I never thought he would get into the first team."}, {"viet": "Tôi chọn một chỗ kín đáo để dựng lều bạt.", "eng": "I picked a sheltered site for the tent."}, {"viet": "Tôi đã đọc tin đó trong một tờ báo lá cải địa phương.", "eng": "I read it in the local rag."}, {"viet": "Tôi đã mong anh đến sớm.", "eng": "I relied on your coming early."}, {"viet": "Tôi đã đưa bà già ấy qua đường.", "eng": "I saw the old lady across the road."}, {"viet": "Tôi sẽ không mua hàng thường xuyên ở cửa hàng đó nữa.", "eng": "I shall withdraw my custom from that shop."}, {"viet": "Tôi thấy có người đi tới trên lối đi ngoài vườn.", "eng": "I spy someone coming up the garden path."}, {"viet": "Tôi nói chuyện với mọi người và viết bài về họ.", "eng": "I talk to people and write stories about them."}, {"viet": "Tôi nghĩ đã đến lúc ăn trưa rồi.", "eng": "I think it's time for lunch."}, {"viet": "Tôi cho là những chuyện đùa của hắn rất vô duyên.", "eng": "I though his jokes were in very poor taste."}, {"viet": "Tôi run sợ khi nghĩ đến điều mà lẽ ra đã xảy đến với con trai tôi.", "eng": "I trembled to think what might have happened to my son."}, {"viet": "Bữa trưa tôi thường ăn một cái bánh xăng-uých.", "eng": "I usually have a sandwich for lunch."}, {"viet": "Tôi muốn đặt một bàn dùng bữa kiểu Nhật vào bữa trưa.", "eng": "I want to book a table for a Japanese dinner at noon."}, {"viet": "Tôi muốn ông gặp ông nội tôi cùng với gia đình.", "eng": "I wanted you to see my grandfather with Bo wife the family."}, {"viet": "Tôi đang thèm hút một điếu thuốc.", "eng": "I was gasping for a cigarette."}, {"viet": "Người ta từ chối không cho tôi vào nhà.", "eng": "I was refused admittance to the house."}, {"viet": "Trái với nhiều sinh viên, tôi rất thích thú bài thuyết trình.", "eng": "I was very interested in the lecture, unlike many of the students."}, {"viet": "Tôi sẽ không làm mất thêm thời gian của anh nữa.", "eng": "I will not taken up any more of your time."}, {"viet": "Tôi lấy làm lạ ở chỗ là anh đã không bị giết.", "eng": "I wonder at the fact that you weren't killed."}, {"viet": "Tôi cho rằng anh ta đã quên.", "eng": "I would imagine he's forgotten."}, {"viet": "Tôi sẽ không tán thành một kế hoạch như thế.", "eng": "I would not give countenance to such a plan."}, {"viet": "Nếu một hội viên muốn đưa khách vào câu lạc bộ, người đó phải kí vào sổ tiếp khách.", "eng": "If a member wishes to bring a guest into the club, he must sign the visitors book."}, {"viet": "Nếu như tôi có thể xen vào một lời bình luận trước khi ngài tiếp tục nói.", "eng": "If I may interpolate a comment, before you continue your speech."}, {"viet": "Nếu khi gọi món ăn mà khách không gọi món salad, tốt hơn nhân viên phục vụ nên đề nghị khách chọn một món ăn thích hợp và món salad.", "eng": "If the guest doesn't mention a salad while ordering, it is very good for a waiter to suggest an appropriate choice of dish and a salad."}, {"viet": "Nếu chúng ta muốn cai nghiện, mà dùng biện pháp nửa vời thì chẳng có ích gì.", "eng": "If we want to stop drug addiction it's no use trying half measures."}, {"viet": "Nếu anh không thích điều đó, anh không nói ra là sai lầm.", "eng": "If you didn't like it you were wrong not to say so."}, {"viet": "Nếu anh cho tôi vay 2 pao, tôi sẽ trả lại anh ngày mai.", "eng": "If you lend me 2 pounds, I'll repay it tomorrow."}, {"viet": "Nếu anh muốn biết cách dùng một từ, hãy tra Từ điển của người học cấp cao.", "eng": "If you want to know how a word is used, look the word up in the Advanced Learner's Dictionary."}, {"viet": "Trong đoạn kết gây kinh ngạc, cô ta đã trở thành nữ tu.", "eng": "In a surprising denouement, she becomes a nun."}, {"viet": "Thật ra, chúng tôi đang đưa ra mức giá thấp nhất khả dĩ cho các sản phẩm của chúng tôi đấy.", "eng": "In fact, we are offering our products at the lowest possible price."}, {"viet": "Cuối cùng thì về già ông ấy đã mãn nguyện khi nhìn thấy giá trị tác phẩm của mình được công nhận.", "eng": "In old age, he finally had the satisfaction of seeing the quality of his work recognized."}, {"viet": "Buổi tối đài này chuyển tần số và phát sóng trên một băng tần khác.", "eng": "In the evening this station changes frequency and broadcasts on another band."}, {"viet": "Trong khoá này, sinh viên nhận được kiến thức về kỹ thuật cơ bản.", "eng": "In this course, students receive instruction in basic engineering."}, {"viet": "Khai tâm cho các tân binh làm quen với những lề lối sống trong quân đội.", "eng": "Initiating the new recruit into the mysteries of army life."}, {"viet": "Có thể quét một lớp sơn mới trong phòng khách không?", "eng": "Is it possible to have a new coat of paint in the living-room?"}, {"viet": "Có nơi nào cháu đặc biệt muốn tham quan không?", "eng": "Is there any place you especially want to see?"}, {"viet": "Sẽ phải chen một tý, nhưng tôi chắc rằng sẽ đưa được tất cả các anh lên xe.", "eng": "It'll be a bit of a squash, but I think I can get you all in the car."}, {"viet": "Cầm bóng lên là trái luật.", "eng": "It's against the rules to pick up the ball."}, {"viet": "Những người ở độ tuổi của mẹ dễ mắc chứng đó lắm.", "eng": "It's easy for people your age to get it."}, {"viet": "Ở đây lúc nào cũng ầm ĩ.", "eng": "It's like a madhouse in here most of the time."}, {"viet": "Hiện nay nó là cung điện bằng gỗ lớn nhất và được bảo tồn tốt nhất ở Trung Quốc.", "eng": "It's now the largest, best preserved wooden hall in China."}, {"viet": "Đó là điều tối thiểu tôi có thể làm cho một người bạn Mỹ thân thiết.", "eng": "It's the least I can do for a close American friend."}, {"viet": "Tôi kinh ngạc khi phát hiện ra khủng long sống lâu như vậy.", "eng": "It amazed me to discover how long the dinosaur age lasted."}, {"viet": "Tôi đã nhìn thấy anh ăn trộm.", "eng": "It has come to my notice that you have been stealing."}, {"viet": "Anh ấy đi hay ở cũng chẳng có gì quan trọng.", "eng": "It is immaterial whether he goes or stays."}, {"viet": "Nhiệm vụ của Nghị viện là lập pháp.", "eng": "It is the job of Parliament to legislate."}, {"viet": "Ăn ở ngoài trời mỗi ngày thật là tuyệt vời.", "eng": "It must be wonderful to take your meals in the open everyday."}, {"viet": "Nó ở phía bên kia cung điện Buckingham.", "eng": "It's on the other side of the Palace."}, {"viet": "Đáng đời mày-Tao đã bảo mày mang theo ô rồi mà.", "eng": "It serves you right-I told you to take an umbrella."}, {"viet": "Trèo lên được túp lều trên núi là cả một sự gắng sức lớn.", "eng": "It was a hard pull up to the mountain hut."}, {"viet": "Tham vọng ám ảnh của bà ấy là trở thành lãnh tụ Đảng.", "eng": "It was her consuming ambition to become party leader."}, {"viet": "Đó là một kinh nghiệm giáo dục nhiều nhất mà tôi từng có được.", "eng": "It was the most educational experience I have ever had."}, {"viet": "Chấp nhận là có lợi cho anh.", "eng": "It would be in your interests to accept."}, {"viet": "Những từ tẻ nhạt và những câu trống rỗng vô tích sự.", "eng": "Jejune words and useless empty phrases."}, {"viet": "Julie sẽ không đi xem phim được đâu Thật đáng thất vọng.", "eng": "Julie won't be able to come to the cinema What a shame."}, {"viet": "Thưa quý bà, quý ông, đây là một món hời giá có 50 pao'.", "eng": "Ladies and gentlemen, it's a steal at only 50 pounds'."}, {"viet": "Cứ để anh ta đợi một lát, điều đó sẽ dạy cho anh ta biết khi vô lễ thì sẽ thế nào.", "eng": "Let him cool his heels for a while that'll teach him to be impolite."}, {"viet": "Này tôi không muốn xen vô chuyện hai bạn.", "eng": "Listen, I don't want to get into the middle of this."}, {"viet": "Nhiều người trong số những người trình diễn đã đạt được trình độ chuyên môn chuẩn mực.", "eng": "Many of the performers were of professional standard."}, {"viet": "Marx và những người theo ông tin rằng chủ nghĩa tư bản sẽ tự chôn nó.", "eng": "Marx and his followers were convinced that Capitalism would destroy itself."}, {"viet": "Tôi xin được giới thiệu ( với ngài ) ông trợ lý mới của tôi.", "eng": "May I present my new assistant ( to you )."}, {"viet": "Ừm lần này thì có cớ gì đây?", "eng": "Mm What's the excuse this time?"}, {"viet": "Mẹ tôi để sơ mi trong tủ quần áo của tôi.", "eng": "Mother put the shirts in my clothes chest."}, {"viet": "Bồ của tôi tặng tôi một cái áo ngủ mỏng manh nhân ngày sinh nhật.", "eng": "My babycakes gave me a flimsy nighwear for my birthday."}, {"viet": "Cha tôi không bao giờ hài lòng với kết quả thi của tôi.", "eng": "My father is never satisfied with my exam results."}, {"viet": "Tâm trí tôi hồi tưởng cuộc gặp gỡ trước đây của chúng tôi.", "eng": "My mind flashed back to our previous meeting."}, {"viet": "Con trai tôi làm việc ở công ty CDE.", "eng": "My son works at CDE Corporation."}, {"viet": "Không sao, tôi sẽ quay số lại.", "eng": "Never mind, I'll dial again."}, {"viet": "Không, tôi nghĩ tôi chưa có dự định gì cả.", "eng": "No, I don't think i've got anything planned."}, {"viet": "Từ lúc tôi gọi điện cho cô hôm qua đến giờ chưa có ai đến cả.", "eng": "No one has come since I called you yesterday."}, {"viet": "Bây giờ ông vui lòng cho tôi biết số hộ chiếu của ông?", "eng": "Now may I have your passport number?"}, {"viet": "Trong giăm bông và thịt bò, loại thịt sau rẻ hơn.", "eng": "Of ham and beef, the latter meat is cheaper today."}, {"viet": "OK, bây giờ xin hãy cho tôi xem hộ chiếu của ông và \"bản sao của người mua\".", "eng": "OK, now show me your passport and the \"Purchaser's Copy\", please."}, {"viet": "Một khi cô ấy bàn đến vấn đề chính trị thì không sao kiềm được cô ấy.", "eng": "Once she gets onto the subject of politics there's no holding her."}, {"viet": "Một trong những chân lý cơ bản của khoa học hiện đại.", "eng": "One of the fundamental truths of modern science."}, {"viet": "Lớp chúng tôi đi thực địa để nghiên cứu động vật và thực vật ở vùng nông thôn địa phương.", "eng": "Our class is doing a field trip to study animals and plants in the local countryside."}, {"viet": "Hiểu biết của chúng ta về vấn đề này không đầy đủ.", "eng": "Our knowledge of the matter is deficient."}, {"viet": "Thầy giáo của chúng tôi lúc nào cũng để ý đến cách chấm câu.", "eng": "Our teacher has a bee in one's bonnet about punctuation."}, {"viet": "Cha mẹ cần giáo dục con cái có hạnh kiểm tốt.", "eng": "Parents should educate their children to behave well."}, {"viet": "Người dân từ khắp nơi trên thế giới sống ở thành phố và làm việc ở Liên Hiệp Quốc.", "eng": "People from all over the world live in the city and work at the United Nations."}, {"viet": "Xin hãy trả lời tất cả những câu hỏi liệt kê trong đó.", "eng": "Please answer all the questions listed therein."}, {"viet": "Tiền thuê bị tính thêm tại trung tâm thành phố.", "eng": "Premium rents are charged in the city centre."}, {"viet": "Ấy, đó là nơi tôi rất muốn đến thăm!", "eng": "Say, that's a place I've always wanted to see!"}, {"viet": "Anh có cần tôi giúp một tay mang vật nặng đó không? Vâng.", "eng": "Shall I help you carry that load? Please."}, {"viet": "Cô ta là một người tham dự thường xuyên các lớp đêm.", "eng": "She's a regular attender at evening classes."}, {"viet": "Bà ta mê sảng nhưng có những lúc tỉnh táo.", "eng": "She's delirious, but has lucid intervals."}, {"viet": "Cô ấy sống ở miền tây nước Mỹ ( thí dụ California ) đã được mười năm.", "eng": "She's lived in the West for ten years now."}, {"viet": "Cô ta đã bỏ hút thuốc lá, và thế cũng là tốt!", "eng": "She's stopped smoking and a good job too!"}, {"viet": "Cô ấy lại khẳng định một lần nữa cô ấy đã trông thấy anh ấy trước khi tai nạn xảy ra.", "eng": "She again affirmed that she had seen him just before the accident."}, {"viet": "Bà ta nài ép Ủy ban của bà chấp nhận thông qua kế hoạch của bà.", "eng": "She bulldozed her plans past her committee."}, {"viet": "Cô ấy hoàn toàn không đếm xỉa đến tất cả sự phản đối của chúng tôi.", "eng": "She completely disregarded all our objections."}, {"viet": "Cô ta xứng đáng được khen về tất cả công việc vất vả cô ta đã làm.", "eng": "She deserves a pat on the back for all the hard work she's done."}, {"viet": "Cô ấy đã thêu những bông hoa ( bằng chỉ vàng ) trên cái đệm.", "eng": "She embroidered flowers on the cushion ( in gold thread )."}, {"viet": "Cô ta tự cảm thấy mình cũng có đôi chút danh tiếng nào đó.", "eng": "She found herself something of a celebrity."}, {"viet": "Bà ta bị gạt bỏ sau mười năm làm việc với công ty.", "eng": "She got the chop after ten years with the company."}, {"viet": "Cô ta đã phải chen lấn qua đám đông để tới sân khấu.", "eng": "She had to press through the throng to reach the stage."}, {"viet": "Cô ta không thể kiên nhẫn được với những người lúc nào cũng cằn nhằn.", "eng": "She has no patience with people who are always grumbling."}, {"viet": "Cô ta đã dụ anh ta vào trong nhà và lấy trộm khi anh ta ngủ.", "eng": "She inveigled him into the house and robbed him while he slept."}, {"viet": "Cô ta lập dị đến nỗi bị coi là một thứ của lạ.", "eng": "She is so eccentric that she is regarded as a bit of a curiosity."}, {"viet": "Cô ấy để đồ trang sức của mình cho chị gái giữ.", "eng": "She left her jewellery in her sister's keeping."}, {"viet": "Cô ta để làm rối tung sự sắp xếp.", "eng": "She made a complete cock-up of the arrangements."}, {"viet": "Từ hôm đó trở đi cô ta không bao giờ nói với nó nữa.", "eng": "She never spoke to him again from that day on."}, {"viet": "Bà ta ngồi vào vị trí gần bên lò sưởi ấm.", "eng": "She positioned herself near the warm fire."}, {"viet": "Cô ta nhìn anh ấy một cách thân tình, chằm chằm, tò mò, v. v.", "eng": "She regarded him closely, intently, curiously, etc."}, {"viet": "Cô ta đang dan díu với sếp của cô ấy.", "eng": "She's carrying on with her boss."}, {"viet": "Bà ta quá keo kiệt nên không đóng góp.", "eng": "She's too mean to make a donation."}, {"viet": "Cô ta có vẻ thành thật nhưng liệu tôi có thể tin cô ta được không?", "eng": "She seems genuine but can I trust her?"}, {"viet": "Cô ta lén gửi một khẩu súng được nhét vào cái bánh vào nhà tù.", "eng": "She smuggled the gun into the jail inside a cake."}, {"viet": "Cô ta nút bông vào tai để tránh tiếng ồn.", "eng": "She stuffed wads of cotton in her ears to keep out the noise."}, {"viet": "Bà ta báo tin đó cho chúng tôi một cách rất thản nhiên.", "eng": "She told us the news in a very matter-of-fact way."}, {"viet": "Cô ta dùng những từ và thành ngữ có phần xưa rồi.", "eng": "She uses rather dated words and phrases."}, {"viet": "Cô ta phá phách như đứa trẻ con.", "eng": "She was always full of aggression as a child."}, {"viet": "Do hoàn cảnh bắt buộc, cô ta phải ăn trộm thực phẩm cho các con đang đói.", "eng": "She was driven by necessity to steal food for her starving children."}, {"viet": "Cô ta bị bỏ mặc cho cảm thấy mình dễ bị chỉ trích và xúc phạm.", "eng": "She was left feeling exposed and vulnerable."}, {"viet": "Người ta thấy cô ta đi vào tòa nhà vào khoảng thời gian tội ác xảy ra.", "eng": "She was seen to enter the building about the time the crime was committed."}, {"viet": "Cô ta thật hoàn toàn khiếm nhã không một chút biết ơn đối với tất cả những gì chúng tôi đã làm.", "eng": "She was utterly graceless, showing no gratitude for all we had done."}, {"viet": "Cô ấy đi nghỉ ở bờ biển để hồi phục sức khoẻ sau khi nằm ở bệnh viện ra.", "eng": "She went to the seaside to convalesce after her stay in hospital."}, {"viet": "Cô ấy làm việc từ 2 giờ đến 10 giờ.", "eng": "She works from two o'clock to ten o'clock."}, {"viet": "Con có cần buộc giấy báo cũ lại không?", "eng": "Should I bundle up the old papers?"}, {"viet": "Những cuộc biểu tình cùng lúc diễn ra ở Luân Đôn và New York.", "eng": "Simultaneous demonstrations in London and New York."}, {"viet": "Tiết kiệm vải khi may cái áo đầm.", "eng": "Skimp material when making a dress."}, {"viet": "Hút thuốc là nguyên nhân gây ra nhiều trường hợp ung thư phổi.", "eng": "Smoking is responsible for many cases of lung cancer."}, {"viet": "Nhúng sơ mi trong thuốc tẩy để tẩy sạch những vết bẩn.", "eng": "Soak shirts in bleach to remove the stains."}, {"viet": "Một ít rượu mạnh ngon mà chúng tôi đã tước đoạt từ các người Đức trong chiến tranh thế giới thứ 2.", "eng": "Some fine brandy we had liberated from the Germans during World War II."}, {"viet": "Một số người toàn đổ rác xuống sông.", "eng": "Some people just dump their rubbish in the river."}, {"viet": "Sẽ có người đến mở cửa giúp ông.", "eng": "Someone is going to open the door for you."}, {"viet": "Súp hơi có mùi vị tỏi.", "eng": "Soup with a slight savour of garlic."}, {"viet": "Các phòng thay quần áo ở hồ bơi.", "eng": "Stalls for changing in at the swimming-pool."}, {"viet": "Tích trữ nhiên liệu cho mùa đông.", "eng": "Stock up on fuel for winter."}, {"viet": "Các đường phố đầy người bận rộn công việc hằng ngày.", "eng": "Streets filled with people going about their daily business."}, {"viet": "Hành vi như vậy không phải là đặc tính của cô ta.", "eng": "Such behaviour is uncharacteristic of her."}, {"viet": "Cung cấp hơi đốt, điện, v. v. cho người tiêu dùng.", "eng": "Supply consumers with gas, electricity, etc."}, {"viet": "Lấy hướng địa bàn căn cứ vào hải đăng.", "eng": "Take a compass bearing on the lighthouse."}, {"viet": "Nhồi chặt thuốc lá vào tẩu.", "eng": "Tamp down the tobacco in the pipe."}, {"viet": "Nhiệt độ là một con số thay đổi trong cuộc thí nghiệm.", "eng": "Temperature was a variable in the experiment."}, {"viet": "Thôi đi, hai anh, các anh làm ầm ĩ quá rồi đấy.", "eng": "That'll do, you two, you're getting far too noisy."}, {"viet": "Chiếc xe ô tô đó chạy nhanh quá.", "eng": "That car is going too fast."}, {"viet": "Hiện nay tình hình như thế.", "eng": "That is how the situation stands at present."}, {"viet": "Chiếc áo khoác đó sẽ giúp mình qua được mùa đông.", "eng": "That overcoat should see me through the winter."}, {"viet": "Ý kiến nghe hay đấy, nhưng tôi nên đi đâu?", "eng": "That sounds like good ideas, but where should I go?"}, {"viet": "Tiểu đoàn 1 thuộc trung đoàn quận Lancashire.", "eng": "The 1st battalion of the Lancashire Regiment."}, {"viet": "Vệ thành được chiếu đèn pha vào buổi tối.", "eng": "The Acropolis is floodlit in the evenings."}, {"viet": "Sân bay ở cách xa thành phố khoảng mười dặm.", "eng": "The airport is about ten miles distant from the city."}, {"viet": "Sự tuyên truyền chống nước Anh đã gây xúc phạm lớn.", "eng": "The anti-British propaganda gave much offence."}, {"viet": "Quân đội được đặt trong tư thế sẵn sàng chiến đấu.", "eng": "The army were put on a war footing."}, {"viet": "Khán giả say mê từng phút cuộc biểu diễn.", "eng": "The audience was enjoying every minute of the show."}, {"viet": "Các cổ động viên của tay lái xe đua.", "eng": "The back-up team of a racing driver."}, {"viet": "Các ngân hàng đã nhất trí thoả thuận với các nhà thầu xây dựng về việc giảm nhẹ lãi suất.", "eng": "The banks have acted in unison with the building societies in lowering interest rates."}, {"viet": "Thịt bò quá mặn không thể ăn được.", "eng": "The beef is too salty to eat."}, {"viet": "Tỷ lệ sinh đang giảm dần ở Nhật Bản.", "eng": "The birthrate is decreasing in Japan."}, {"viet": "Quả bom được gài ngòi nổ và định thời gian nổ sau khi chiếc máy bay đó cất cánh.", "eng": "The bomb was fused and timed to explode after the aircraft had taken off."}, {"viet": "Ông chủ giao tất cả các khách hàng khó tính nhất cho cô ấy.", "eng": "The boss saddled her with all the most difficult customers."}, {"viet": "Loại rượu mạnh đó tác dụng như một loại thuốc bổ.", "eng": "The brandy acted as a restorative."}, {"viet": "Viên đạn ghim chặt trong tường.", "eng": "The bullet bedded itself in the wall."}, {"viet": "Đội Cambridge được yêu cầu phải giỏi hơn đội Oxford trong cuộc thi đố.", "eng": "The Cambridge team were too much for the Oxford team in the quiz."}, {"viet": "Đột nhiên chiếc xe phía trước chúng tôi ngoặt sang phải.", "eng": "The car in front of us suddenly branched off to the right."}, {"viet": "Lý lẽ chống lại sự hủy án tử hình.", "eng": "The case against the abolition of the death penalty."}, {"viet": "Ghế ở trong vườn, anh làm ơn đi lấy đem về đây.", "eng": "The chair is in the garden, please fetch it in."}, {"viet": "Viên sĩ quan trên tàu bị giáng cấp vì tội say rượu.", "eng": "The chief mate was disrated for drunkenness."}, {"viet": "Đứa bé đang kéo đồ chơi theo sau nó.", "eng": "The child was pulling the toy along behind her."}, {"viet": "Bọn trẻ cười vui sướng vì những trò vui của anh hề.", "eng": "The children laughed with glee at the clown's antics."}, {"viet": "Bọn trẻ tán tỉnh tôi cho phép chúng đi xem phim.", "eng": "The children wheedled me into letting them go to the film."}, {"viet": "Sự cân đối hài hòa của căn phòng.", "eng": "The classical proportions of the room."}, {"viet": "Bờ biển trải ra về phía bắc thành một vòng cung rộng.", "eng": "The coast sweeps northwards in a wide curve."}, {"viet": "Uỷ ban tán thành ý kiến này.", "eng": "The committee are well-disposed towards the idea."}, {"viet": "Công ty tin tưởng nhìn về năm năm tới.", "eng": "The company is looking forward with confidence to the next five years."}, {"viet": "Ngã ba sông Nin xanh và sông Nin trắng.", "eng": "The confluence of the Blue Nile and the White Nile."}, {"viet": "Mối tương quan giữa chiều cao và cân nặng của ai.", "eng": "The correlation between sb's height and weight."}, {"viet": "Vùng quê ở đây rất bằng phẳng.", "eng": "The countryside is very flat here."}, {"viet": "Bọn tội phạm âm mưu ( với nhau ) cướp nhà băng.", "eng": "The criminals conspired ( with each other ) to rob the bank."}, {"viet": "Cái cốc vỡ thành nhiều mảnh trên sàn.", "eng": "The cup lay in pieces on the floor."}, {"viet": "Sự điều hành hàng ngày một cửa hiệu.", "eng": "The day-to-day running of a shop."}, {"viet": "Mùi thơm từ trong bếp bay ra làm chúng tôi thèm chảy nước dãi.", "eng": "The delicious smell from the kitchen made our mouths water."}, {"viet": "Những tội ác kinh khủng của tên độc tài sẽ bị tất cả các quốc gia văn minh lên án.", "eng": "The dictator's terrible crimes will be condemned by all civilized nations."}, {"viet": "Lãnh thổ tranh chấp của Nagorno Karabakh.", "eng": "The disputed territory of Nagorno Karabakh."}, {"viet": "Bác sĩ này khiêm tốn đối với công việc của mình, mặc dù ông ấy đã chữa khỏi cho nhiều người.", "eng": "The doctor was humble about his work, although he cured many people."}, {"viet": "Con chó đang tru lên-chân nó bị đau.", "eng": "The dog was howling-its paw was hurt."}, {"viet": "Người lái điều khiển cần trục xoay vòng thật nhanh.", "eng": "The driver slewed the crane round."}, {"viet": "Gờ của cái đĩa đó đã được làm phẳng bằng máy.", "eng": "The edge of the disk had been machined flat."}, {"viet": "Quân địch lại tập hợp lực lượng để mở một cuộc tấn công mới.", "eng": "The enemy regrouped their forces for a new attack."}, {"viet": "Sản nghiệp đó đã được chuyển nhượng cho người con cả.", "eng": "The estate was made over to the eldest son."}, {"viet": "Lời giải thích chẳng phải tìm đâu xa xôi.", "eng": "The explanation is not far to seek."}, {"viet": "Anh thật sự có nét rất giống những người trong gia đình.", "eng": "The family likeness really hits you."}, {"viet": "Vài gói thực phẩm đó hình như là một điều nhạo báng trước sự thiếu thốn trầm trọng như thế.", "eng": "The few packages of food seemed a mockery in the face of such enormous destitution."}, {"viet": "Hậu quả cuối cùng tùy thuộc vào các kết quả của cuộc bầu cử.", "eng": "The final outcome rides on the results of the election."}, {"viet": "Xí nghiệp đó đã đi đến chỗ tự ý thanh lý tài sản.", "eng": "The firm went into voluntary liquidation."}, {"viet": "Căn hộ sẽ được tân trang lại cho những người thuê mới.", "eng": "The flat will be refurbished for the new tenant."}, {"viet": "Tất cả mọi ý kiến vừa nêu đều gồm chung trong những đề nghị này.", "eng": "The foregoing have all been included in the proposals."}, {"viet": "Việc sử dụng đầy đủ các năng lực ( tinh thần ) của mình.", "eng": "The full retention of one's ( mental ) faculties."}, {"viet": "Cánh cổng được quay từ từ đóng lại.", "eng": "The gate was swung slowly to."}, {"viet": "Những đôi găng tay này nhằm dùng cho khí hậu cực kỳ lạnh.", "eng": "The gloves were designed for extremely cold climates."}, {"viet": "Chính phủ quyết định chống chính sách khủng bố quốc tế.", "eng": "The government determined to combat international terrorism."}, {"viet": "Có thể chính phủ sẽ phải đưa ra chế độ phân phối xăng.", "eng": "The Government may have to introduce petrol rationing."}, {"viet": "Vây quanh người diễn viên lớn vẫn là đám đông thường thấy của những kẻ theo đóm ăn tàn.", "eng": "The great actor was surrounded by his usual crowd of hangers-on."}, {"viet": "Người khách trọ không biết cách thu xếp một cuộc gọi đánh thức.", "eng": "The guest doesn't know bow to arrange for a wake-up call."}, {"viet": "Thi thể không có đầu của một người đàn ông được tìm thấy trong rừng.", "eng": "The headless body of a man was found in the woods."}, {"viet": "Bọn không tặc giữ phi công đang lái máy bay làm một con tin.", "eng": "The hijackers kept the pilot on board the plane as a hostage."}, {"viet": "Sự ham muốn điên cuồng của tôi.", "eng": "The hot rampageous horses of my will."}, {"viet": "Ngôi nhà rung lên khi chiếc xe tải nặng nề qua.", "eng": "The house shook as the heavy lorry went past."}, {"viet": "Ý kiến của các ứng viên giống nhau đến nỗi anh ấy không thấy một sự khác nhau nào hết.", "eng": "The ideas of the candidates are so much alike that he could see no difference between them."}, {"viet": "Phòng thông tin được đặt ở trung tâm thành phố.", "eng": "The information office is located in the city centre."}, {"viet": "Sự xâm lăng Ba Lan của Đức năm 1939.", "eng": "The invasion of Poland by Germany in 1939."}, {"viet": "Chuyến đi mất cả thảy hai giờ.", "eng": "The journey will take fully two hours."}, {"viet": "Khi ngôi sao xuất hiện, đám trẻ phát cuồng lên.", "eng": "The kids went crazy when the film star appeared."}, {"viet": "Viên đạn cuối cùng đã kết liễu đời con vật bị thương.", "eng": "The last bullet finished off the wounded animal."}, {"viet": "Hợp đồng cho thuê nhà nêu rõ rằng những người thuê phải giữ gìn nhà cửa ở tình trạng tốt.", "eng": "The lease stated that tenants should maintain the property in good condition."}, {"viet": "Cái áo sơ mi màu xanh lá cây nhạt thật sự làm nổi bật đôi mắt của bạn.", "eng": "The light green shirt really brings out your eyes."}, {"viet": "Chuyến đi bộ dài là một sự căng thẳng đối với sức khoẻ của anh ấy.", "eng": "The long walk was a tax on his strength."}, {"viet": "Thầy phù thuỷ hoá phép con ếch thành một vị hoàng tử.", "eng": "The magician metamorphosed the frog into a prince."}, {"viet": "Ông giám đốc thúc giục nhân viên của mình cố gắng hơn.", "eng": "The manager urged his staff on to greater efforts."}, {"viet": "Bữa ăn kể cả rượu lên tới 12 bảng Anh một bữa.", "eng": "The meal with wine came to £ 12 each."}, {"viet": "Những người này bị phát hiện có âm mưu giết người.", "eng": "The men were found guilty of conspiracy to murder."}, {"viet": "Anh hà tiện phát xu cho những ăn mày.", "eng": "The miser doled out his coins to the beggar."}, {"viet": "Càng nản chí anh ấy càng mượn rượu giải sầu.", "eng": "The more depressed he got, the more he turned to drink."}, {"viet": "Dây cu-roa chuyển động đưa nguyên liêu vào máy.", "eng": "The moving belt feeds raw material into the machine."}, {"viet": "Những cuộc thương thuyết sẽ đòi hỏi một tài ngoại giao khéo léo đáng kể.", "eng": "The negotiation will call for considerable dexterity."}, {"viet": "Việc ban hành luật pháp mới đã không giúp ích gì nhiều cho việc giải quyết vấn đề.", "eng": "The new legislation does not go far enough towards solving the problem."}, {"viet": "Lợi nhuận năm này sẽ bù đắp lại thua lỗ của chúng tôi trước đây.", "eng": "The new year's profits will balance our previous losses."}, {"viet": "Toán làm ca đêm ra về lúc tảng sáng.", "eng": "The night shift come off at dawn."}, {"viet": "Lượng du khách bắt đầu giảm vào tháng 10.", "eng": "The number tourist start to tail off in October."}, {"viet": "Các cán bộ của một chính đảng.", "eng": "The officials of a political party."}, {"viet": "Thế vận hội luôn luôn được phát trên truyền hình.", "eng": "The Olympic games are always televised."}, {"viet": "Những đứa con trai khác thường chọc ghẹo nó vì giọng nói của nó.", "eng": "The other boys used to tease him because of his accent."}, {"viet": "Báo chí bóp méo tất cả những gì tôi nói.", "eng": "The papers twisted everything I said."}, {"viet": "Bệnh nhân cố đứng vững mặc dù cô ấy còn quá yếu.", "eng": "The patience is holding her own although she is still very ill."}, {"viet": "Dân tộc đó phải chịu lệ thuộc.", "eng": "The people were kept in subjection."}, {"viet": "Bức tranh bị nghiêng về bên trái.", "eng": "The picture is slanted to the left."}, {"viet": "Kế hoạch tuỳ thuộc vào sự chấp thuận của giám đốc.", "eng": "The plan is subject to the director's approval."}, {"viet": "Vở kịch đó nhận được những bài khen ngợi.", "eng": "The play got splendid excellent reviews."}, {"viet": "Cảnh sát đang điều tra vụ giết người.", "eng": "The police are investigating the murder."}, {"viet": "Cảnh sát đang điều tra phát hiện một manh mối quan trọng mới.", "eng": "The police investigating an important new lead."}, {"viet": "Viên cảnh sát ghi tên và địa chỉ của tôi.", "eng": "The policeman took my name and address."}, {"viet": "Người phát thư bảo tôi ký nhận gói hàng.", "eng": "The postman asked me to sign for the parcel."}, {"viet": "Chuyến viếng thăm của Tổng thống đã được hoãn lại vào giờ chót.", "eng": "The president's visit was called off at the eleventh hour."}, {"viet": "Tiền mua các món hàng có thể trả góp.", "eng": "The price of the goods is payable in installments."}, {"viet": "Tên tù không chịu thú nhận tội ác của hắn.", "eng": "The prisoner refused to confess his crime."}, {"viet": "Chương trình đó đã được diễn thử để thăm dò phản ứng của người xem.", "eng": "The programme was given a trial run to gauge viewers reactions."}, {"viet": "Công chúng cuối cùng đã phát chán với những điệu bộ hài hước của anh ta trên sân quần vợt.", "eng": "The public eventually grew tired of his antics on the tennis court."}, {"viet": "Nữ hoàng được đăng quang với tất cả các nghi thức thích hợp.", "eng": "The Queen was crowned with all the proper solemnities."}, {"viet": "Lãi suất tăng lên nếu ông giữ giấy chứng nhận lâu hơn.", "eng": "The rate goes up if you keep the certificate longer."}, {"viet": "Những người tị nạn đang phải chịu thiếu thốn thực phẩm và thuốc men.", "eng": "The refugees are suffering for want of food and medical supplies."}, {"viet": "Quyết định đã được thông qua với 340 phiếu thuận và 210 phiếu chống.", "eng": "The resolution was carried by 340 votes to 210."}, {"viet": "Đức cha Richard Harries, giám mục Oxford.", "eng": "The Right Reverend Richard Harries, Bishop of Oxford."}, {"viet": "Con đường vắng không trừ vài chiếc ô tô.", "eng": "The road was empty except for a few cars."}, {"viet": "Tình trạng mục nát lan nhanh làm cho chiếc cầu đó không an toàn ngay cả cho những người đi bộ.", "eng": "The rot spread quickly, rendering the bridge unsafe even for pedestrians."}, {"viet": "Việc bán hàng được sắp xếp vào ngày mai.", "eng": "The sale is scheduled for tomorrow."}, {"viet": "Viên thanh tra trường học sẽ đến kiểm tra vào tuần tới.", "eng": "The school inspector is visiting next week."}, {"viet": "Việc tuyển chọn một đội bóng đá.", "eng": "The selection of a football team."}, {"viet": "Sự khó khăn thực sự của công việc.", "eng": "The sheer difficulty of the task."}, {"viet": "Cú sốc làm cô ta ngập ngừng một lát nhưng rồi cô nhanh chóng tĩnh trí lại.", "eng": "The shock made her hesitate for a moment but she quickly came to herself again."}, {"viet": "Biển đề'Bộ Quốc phòng-Nguy hiểm-Không vào!'.", "eng": "The sign said'Ministry of Defence-Danger-Keep Out!'."}, {"viet": "Một chiếc thuyền nhỏ bập bềnh trên mặt hồ.", "eng": "The small boat bobbed up and down on the lake."}, {"viet": "Các người lính đó có giấy nghỉ phép trong túi trước ngực.", "eng": "The soldiers had their furlough in their breast pockets."}, {"viet": "Người diễn thuyết rất có tài nói năng.", "eng": "The speaker had great powers of utterance."}, {"viet": "Theo như người ta nói thì diễn viên nổi tiếng đó bị bệnh nặng.", "eng": "The star is reportedly very ill."}, {"viet": "Câu chuyện này về một người đàn ông sống ở Nga cách đây đã lâu.", "eng": "The story concerns a man who lived in Russia a long time ago."}, {"viet": "Kiểu kiến trúc đó bắt nguồn từ người Hi Lạp cổ.", "eng": "The style of architecture originated with the ancient Greeks."}, {"viet": "Những xóm làng xung quanh đã bị thu hút vào thành phố đang phát triển.", "eng": "The surrounding villages have been absorbed into the growing city."}, {"viet": "Thầy giáo có quyền phạt bất cứ học sinh nào.", "eng": "The teacher has authority to punish any pupil."}, {"viet": "Mùi khói thuốc lá làm lộ tẩy.", "eng": "The tell-tale smell of cigarette smoke."}, {"viet": "Bọn trộm trói cô ta bằng thừng, bỏ cô ta lại nhưng cô ấy đã cựa quậy gỡ được ra.", "eng": "The thieves left her tied up with rope but she wriggled free."}, {"viet": "Tài liệu tuyệt mật được ghi chỉ trình riêng Tổng thống.", "eng": "The top secret file was marked For the President's eyes only."}, {"viet": "Chắc chắn là tàu đã bị chậm do tai nạn.", "eng": "The train was inevitably delayed by the accident."}, {"viet": "Sự thật không phải luôn luôn dễ chịu.", "eng": "The truth is not always very palatable."}, {"viet": "Hai người lính đã tìm cách thoát không bị bắt.", "eng": "The two soldiers somehow managed to avoid capture."}, {"viet": "Những cấp bậc cao trong ngành dân sự.", "eng": "The upper echelons of the Civil Service."}, {"viet": "Làng nép mình dưới chân đồi.", "eng": "The village nestled at the foot of the hill."}, {"viet": "Nước và nước đá trong mây xuất phát từ hơi nước ở trong không khí.", "eng": "The water and ice in clouds come from the water vapor in the air."}, {"viet": "Toàn bộ cuộc thảo luận xoay quanh một điểm này.", "eng": "The whole discussion pivots on this one point."}, {"viet": "Đội thắng đã công kênh đội trưởng của họ rời khỏi sân.", "eng": "The winning team chaired their captain off the field."}, {"viet": "Công nhân dọn sạch ( các thứ bừa bãi ) trước khi ra về.", "eng": "The workmen cleaned up ( the mess ) before they left."}, {"viet": "Sự giàu có của họ là bề ngoài hơn là thật.", "eng": "Their affluence is more apparent than real."}, {"viet": "Đức vua và hoàng hậu sẽ khánh thành chiếc cầu mới.", "eng": "Their majesties will open the new bridge."}, {"viet": "Sau đó, Columbus đến gặp Vua Ferdinand và Hoàng hâu Isabella của nước Tây Ban Nha.", "eng": "Then Columbus went to King Ferdinand and Queen Isabella of Spain."}, {"viet": "Chúng ta có thể có cơ may khá nhiều để thắng lần này.", "eng": "There's a fair chance that we might win this time."}, {"viet": "Cô ta và chị cô ta chẳng bao giờ ưa nhau lắm.", "eng": "There's never been much love lost between her and her sister."}, {"viet": "Mắt tôi có gì không ổn rồi-Tôi không nhìn rõ nữa.", "eng": "There's something wrong with my eyes-I can't see properly."}, {"viet": "Ở Nhật có nhiều nhóm đua xe gắn máy.", "eng": "There are many motorcycle gangs in Japan."}, {"viet": "Có quá nhiều lỗi trong tiểu luận này.", "eng": "There are too many mistakes in this essay."}, {"viet": "Có cái chuông trong tầm tay của bệnh nhân.", "eng": "There is a bell within the patient's reach."}, {"viet": "Có sự đồng lòng rộng rãi trong cả nước về vấn đề này.", "eng": "There is broad consensus in the country on this issue."}, {"viet": "Không có lấy một mảy may sự thực nào trong tin đồn ấy cả.", "eng": "There isn't an atom of truth in the rumour."}, {"viet": "Dân chúng đã la ó khi vụ bê bối bị lộ.", "eng": "There was a public outcry when the scandal broke."}, {"viet": "Không có đủ bằng chứng để chứng tỏ là nó có tội.", "eng": "There wasn't enough evidence to prove him guilty."}, {"viet": "Các bạn đây rồi! Chúng tôi đã tưởng các bạn không đến.", "eng": "There you are at last! We'd given you up."}, {"viet": "Những chiếc cặp tóc này không giống như những mẫu trên giấy.", "eng": "These hairpins do not assort with the samples on the card."}, {"viet": "Những viên thuốc này làm tôi thấy lờ đờ.", "eng": "These tablets make me feel rather sluggish."}, {"viet": "Họ đã đi bộ suốt ngày, vậy thì ắt là họ phải đói'.", "eng": "They've been walking all day so they must be hungry'."}, {"viet": "Nó kỳ diệu hơn bất cứ thứ máy móc nào mà con người đã từng tạo ra.", "eng": "They are far more wonderful than any machines that men have ever built."}, {"viet": "Họ mua ngôi nhà đó với cái giá đồn đại là 200.000 pao.", "eng": "They bought the house at a rumoured price of 200000 pounds."}, {"viet": "Họ xúm quanh cửa sổ hết sức tò mò.", "eng": "They crowded round the window agog with curiosity."}, {"viet": "Họ đã tranh luận với anh ta về những rủi ro trong kế hoạch của anh.", "eng": "They expostulated with him about the risks involved in his plan."}, {"viet": "Họ không có một nhận xét có lợi nào cho cô ấy cả.", "eng": "They hadn't a good word for her."}, {"viet": "Họ cười nhạo những cố gắng leo núi đáng thương của tôi.", "eng": "They laughed at my puny efforts at rock-climbing."}, {"viet": "Họ không được phản ứng lại sự khiêu khích này.", "eng": "They must not react to this provocation."}, {"viet": "Họ đã chạy cuống cuồng như điên về phía cửa.", "eng": "They ran in a mad, helter-skelter fashion for the door."}, {"viet": "Họ sẽ phải chịu trách nhiệm cho những hành động của họ.", "eng": "They should be held accountable for their acts."}, {"viet": "Họ đã phải dùng lực rất mạnh để phá tung cánh cửa.", "eng": "They used brute force to break open the door."}, {"viet": "Họ ăn mặc cải trang theo quần áo thời Victoria.", "eng": "They were dressed up in Victorian clothes."}, {"viet": "Chúng nó sẽ không nghe đâu, cho nên anh đừng có phí lời với chúng.", "eng": "They won't listen, so don't waste your breath telling them."}, {"viet": "Khu chung cư này có một người quản gia không sống ở trong khu.", "eng": "This block of flats has a non-resident caretaker."}, {"viet": "Đất nước này có một truyền thống vĩ đại về nhạc Jazz, anh biết đấy.", "eng": "This country has a great tradition of Jazz music, you know."}, {"viet": "Vật hoá thạch này có thể trên hai triệu năm.", "eng": "This fossil may be over 2 million years old."}, {"viet": "Đây là ông Prescott ở Ngân hàng Hoa kỳ.", "eng": "This is Mr. Prescott of the Bank of America."}, {"viet": "Con đường mòn này gặp đường cái ở cách xa đây.", "eng": "This lane rejoins the main road further on."}, {"viet": "Con tàu có một thời đẹp đẽ này nay ở trong một tình trạng thảm thương.", "eng": "This once beautiful ship is in a sad condition now."}, {"viet": "Nhà hàng này có ba sao trong sách hướng dẫn du lịch.", "eng": "This restaurant gets three stars in the guidebook."}, {"viet": "Trà này trộn lẫn các loại khác nhau vào nhau.", "eng": "This tea is a mixture of different types."}, {"viet": "Những hình ảnh đó chả là gì so với những hình ảnh khiêu dâm trên các tạp chí Mỹ.", "eng": "Those drawings are nothing compared to the pornographic-photographs in American magazines."}, {"viet": "Hôm nay, tôi đã được ba mươi lăm tuổi rồi.", "eng": "Today, I have become thirty-five years old."}, {"viet": "Cây cối được trồng ở hai bên đường.", "eng": "Trees are planted on either side of the streets."}, {"viet": "Bạo lực là biểu hiện của yếu đuối hay sợ hãi.", "eng": "Violence is a sign of weakness or fear."}, {"viet": "Chúng tôi sẽ cảm thấy dễ chịu hơn nếu không có những người hàng xóm như họ.", "eng": "We'd be better off without them as neighbours."}, {"viet": "Tất cả chúng tôi đều mong cho dự án thành công.", "eng": "We're all anxious for the project to succeed."}, {"viet": "Chúng tôi đã bỏ rất nhiều thì giờ và công sức vào dự án này.", "eng": "We're put a great deal of time and effort into this project."}, {"viet": "Trước đây chúng tôi chưa hề giao dịch với công ty này.", "eng": "We've had no previous dealings with this company."}, {"viet": "Chúng tôi buộc ghế đảy của ông ấy vào một tảng đá lớn.", "eng": "We anchored his wheelchair to huge stone."}, {"viet": "Chúng tôi rất vui khi nghe điều đó.", "eng": "We are very glad to hear that."}, {"viet": "Hiện nay, chúng tôi không thể xem vô tuyến, máy của chúng tôi bị hỏng.", "eng": "We can't watch television at the moment, our set's broken."}, {"viet": "Chúng ta kỷ niệm việc thành lập quốc gia bằng một ngày lễ chung.", "eng": "We commemorate the founding of our nation with a public holiday."}, {"viet": "Chúng ta không có đủ nhân công để hoàn thành công việc.", "eng": "We don't have enough labour to finish the job."}, {"viet": "Chúng tôi cho bọn trẻ mười phút chuẩn bị.", "eng": "We gave the young ones ten minutes'start."}, {"viet": "Chúng tôi phải đánh thuế để vào trung tâm mua bán bằng ô tô.", "eng": "We had to pay a toll to enter the shopping complex by car."}, {"viet": "Chúng ta không có bộ máy để giải quyết các đơn khiếu nại.", "eng": "We have no machinery for dealing with complaints."}, {"viet": "Chúng tôi tạm ngừng chương trình này để mang tới cho các bạn một tin ngắn.", "eng": "We interrupt this programme to bring you a news flash."}, {"viet": "Chúng tôi điều chỉnh đôi chút nho nhỏ vào kế hoạch.", "eng": "We made a few minor adjustments to the plan."}, {"viet": "Chúng ta phải đưa thêm cầu thủ vào tấn công.", "eng": "We must move more players into the attack."}, {"viet": "Chúng tôi chỉ có rượu vang và bia.", "eng": "We only have wine and beer."}, {"viet": "Chúng tôi theo sát các đối thủ của mình về giá cả và chất lượng.", "eng": "We run our competitors close for price and quality."}, {"viet": "Chúng tôi chẳng làm gì cả trong nhiều giờ, chỉ ngồi phơi nắng.", "eng": "We spent many idle hours just sitting in the sun."}, {"viet": "Chúng tôi đã ở đây được mười năm rồi.", "eng": "We've lived here for ten years."}, {"viet": "Chúng ta đang bay ở độ cao 12000 mét.", "eng": "We were flying at an altitude of 12000 metres."}, {"viet": "Lúc đó chúng ta có thể gặp nhau ta sẽ xem chúng ta làm được tới đâu.", "eng": "We will see where we are then."}, {"viet": "À, bạn thấy chuyến đi biển của bạn thế nào?", "eng": "Well, how did you enjoy your seaside trip?"}, {"viet": "À, cuộc triển lãm này dành cho các hoạ sĩ đương thời.", "eng": "Well, this exhibition is for contemporary artists."}, {"viet": "Toà tuyên án như thế nào Anh ta có tội hay vô tội?", "eng": "What's the verdict Is he guilty or not guilty?"}, {"viet": "Bạn sẽ làm gì cho ngày lễ Tạ Ơn?", "eng": "What are you doing for Thanksgiving?"}, {"viet": "Cậu cần phải mang theo những gì trong kỳ đi nghỉ?", "eng": "What do you need to take with you on holiday?"}, {"viet": "Món ăn điển hình của Mỹ là món gì?", "eng": "What is a typical American dish?"}, {"viet": "Điểm bô-ling cao nhất của bạn là bao nhiêu?", "eng": "What is your best bowling score?"}, {"viet": "Xin hỏi còn loại rượu Trung Quốc nào khác?", "eng": "What other f Chinese wine, please?"}, {"viet": "Đồng hồ của anh mấy giờ rồi?", "eng": "What time is it by your watch?"}, {"viet": "Từ này bắt đầu được dùng phổ biến từ bao giờ?", "eng": "When did this word come into common use?"}, {"viet": "Đọc tin tức những ngày gần đây đôi khi tôi tự hỏi cái thế giới này rồi sẽ đi đến đâu?", "eng": "When I read the news these days I sometimes wonder what the world is coming to?"}, {"viet": "Khi nhà máy đóng cửa máy móc được bán đi bằng một phần nhỏ giá trị thực của nó.", "eng": "When the factory closed, the machinery was sold off for only a fraction of its true value."}, {"viet": "Khi nào anh sẽ trả lại tôi quyển sách tôi đã cho anh mượn?", "eng": "When will you return the book I have lent you?"}, {"viet": "Anh muốn tôi để những thứ này ở đâu?", "eng": "Where do you want me to put these?"}, {"viet": "Tôi vào chỗ ngồi này bằng cửa nào?", "eng": "Which door do I enter for this seat?"}, {"viet": "Uytki, branđi, gin và rum đều là rượu mạnh.", "eng": "Whisky, brandy, gin and rum are all spirits."}, {"viet": "Ai lái xe khi chiếc xe đâm?", "eng": "Who was at the wheel when the car crashed?"}, {"viet": "Tại sao anh không ghi lại các ý kiến của anh lên giấy?", "eng": "Why don't you set your ideas down on paper?"}, {"viet": "Sơn này khi khô sẽ bóng láng hay xỉn?", "eng": "Will this paint give a gloss or a matt finish?"}, {"viet": "Wimbledon là thánh địa của giới yêu thích môn quần vợt.", "eng": "Wimbledon is a shrine for all lovers of tennis."}, {"viet": "Với ba con nhỏ chị ấy không thể xoay xở được một mình.", "eng": "With three small children, she just couldn't cope on her own."}, {"viet": "Xin ông vui lòng cho chúng ta biết ngày đến của ông?", "eng": "Would you be kind enough to let us know the date of your arrival?"}, {"viet": "Bạn có thích chơi bóng chày với chúng tôi không?", "eng": "Would you like to play baseball with us?"}, {"viet": "Không thể chuyển phòng nhân viên và phòng họp xuống dưới lầu à?", "eng": "Wouldn't it be possible to move the staff lounge and the meeting room downstairs?"}, {"viet": "Phải, tôi nghĩ anh nói đúng.", "eng": "Yes, I guess you're right."}, {"viet": "Anh rất sáng suốt là đã không đi chơi ngày hôm nay.", "eng": "You'd be well-advised not to travel today."}, {"viet": "Anh cần phải kiên trì nếu anh muốn việc kinh doanh thành công.", "eng": "You'll need to persevere if you want the business to succeed."}, {"viet": "Đến giờ con đã học được bao lâu?", "eng": "You've been studying for how long now?"}, {"viet": "Anh không thể lúc nào cũng trông cậy vào ( có ) thời tiết tốt.", "eng": "You can't always reckon on ( having ) good weather."}, {"viet": "Bà có thể trả phòng vào buổi trưa và gửi lại hành lý ở đây.", "eng": "You can check out by noon and leave your luggage here."}, {"viet": "Ông có thể rút tiền bất cứ lúc nào ông muốn.", "eng": "You can withdraw money any time you like."}, {"viet": "Cứ 3 ga lông xăng dầu là anh được một phiếu.", "eng": "You get a coupon for every 3 gallons of petrol."}, {"viet": "Nếu các bạn cứ chần chừ như thế thì chúng ta sẽ bị muộn mất.", "eng": "You keep shilly-shallying like this we'll be late."}, {"viet": "Anh nên quan tâm đến người khác hơn một chút nữa.", "eng": "You might be a thought more considerate of other people."}, {"viet": "Bạn phải nộp lại quân trang của bạn trước khi bạn xuất ngũ.", "eng": "You must turn in your kit before you leave the army."}, {"viet": "Anh bạn trẻ, anh có vẻ rất tự tin đấy!", "eng": "You seem very sure of yourself, young man!"}, {"viet": "Cô không nên léng phéng với chồng người khác.", "eng": "You shouldn't play around with another woman's husband."}, {"viet": "Anh sẽ có thời gian tham quan các nơi khác ngoài những nơi đã ghi trong lịch trình.", "eng": "You will have time to visit other places than those on the timetable."}, {"viet": "Hành vi của anh còn nhiều điều đáng chê trách.", "eng": "Your conduct leaves a lot to be desired."}, {"viet": "Cái áo sơ mi của ông đã bị hỏng khi chúng tôi giặt nó.", "eng": "Your shirt was damaged when we washed it."}]