[{"viet": "Một người lái xe ẩu đã phải chịu trách nhiệm về cái chết của họ.", "eng": "A bad driver was responsible for their deaths."}, {"viet": "Một cuộc tranh cãi gay gắt giữa các trại chủ với chính phủ về những khoản tài trợ.", "eng": "A catfight between farmers and the government over subsidies."}, {"viet": "Một cuốn tự điển rút gọn để sử dụng hằng ngày.", "eng": "A compact dictionary for everyday use."}, {"viet": "Một cuộc khủng hoảng đe dọa lật đổ chính phủ khỏi vị trí cầm quyền.", "eng": "A crisis which threatens to topple the government from power."}, {"viet": "Một khám phá có tầm quan trọng bậc nhất.", "eng": "A discovery of the first magnitude."}, {"viet": "Một chiến dịch ác liệt chống lại chúng ta qua báo chí.", "eng": "A ferocious campaign against us in the press."}, {"viet": "Một nửa tháng ở lại chơi với chú tôi.", "eng": "A fortnight's stay with my uncle."}, {"viet": "Một người chào hàng giỏi phải mạnh dạn, xông xáo nếu muốn thành công.", "eng": "A good salesman must be aggressive if he wants to succeed."}, {"viet": "Một cái mũ đội lệch trông ngông nghênh.", "eng": "A hat set at a rakish angle."}, {"viet": "Một túp lều được lợp mái sơ sài bằng mảnh vỏ cây.", "eng": "A hut crudely roofed with strips of bark."}, {"viet": "Một luật sư cần có một bộ óc tinh tường.", "eng": "A lawyer needs a precise mind."}, {"viet": "Nhiều sự ồn ào đã được làm ra bởi vở kịch, nhưng nó vẫn không thành công.", "eng": "A lot of fuss was made of the play, but it wasn't a success."}, {"viet": "Một cuộc biểu tình rầm rộ ủng hộ chính quyền.", "eng": "A mass demonstration in support of the regime."}, {"viet": "Một mục tiêu di động không bắn trúng.", "eng": "A moving target is difficult to hit."}, {"viet": "Một danh từ không thay đổi ở số nhiều.", "eng": "A noun with an invariable plural."}, {"viet": "Một buổi trình diễn được ghi âm vào đĩa compắc.", "eng": "A performance now transcribed onto compacts disc."}, {"viet": "Một bài thơ hoàn toàn truyền đạt được tới độc giả những gì nhà thơ cảm nhận.", "eng": "A poem that perfectly conveys to the reader what the poet feels."}, {"viet": "Một lệnh cấm bán vũ khí.", "eng": "A prohibition against the sale of firearms."}, {"viet": "Một tổ chức tôn giáo truyền bá cho thanh niên tư tưởng không vâng lời cha mẹ.", "eng": "A religious organization which indoctrinates young people to disobey their parents."}, {"viet": "Một nhân viên bán hàng chào hàng một cách quá hăng say.", "eng": "A salesperson who comes on too strong."}, {"viet": "Một vỏ ốc xoắn hình chóp.", "eng": "A shell with a spiral twist."}, {"viet": "Một con rắn da của nó lột ra.", "eng": "A snake sloughing off its skin."}, {"viet": "Một chính trị gia có tầm nhìn rất rộng.", "eng": "A statesman of great breadth of vision."}, {"viet": "Một vòng bay tìm kiếm trên vịnh của chiếc máy bay lên thẳng cứu nạn.", "eng": "A sweep over the bay by a rescue helicopter."}, {"viet": "Một thị trấn bị san bằng do một trận động đất.", "eng": "A town levelled by an earthquake."}, {"viet": "Một người lập dị nói với chính anh ta bằng tiếng Pháp.", "eng": "A wacko who talks to himself in French."}, {"viet": "Một nhà văn có tài tường thuật.", "eng": "A writer of great narrative power."}, {"viet": "Làm theo sự chỉ đạo của giám đốc.", "eng": "Acting in consultation with the director."}, {"viet": "Sau một nỗ lực lâu dài, bà ta đã nắm được quyền kiểm soát doanh nghiệp đó.", "eng": "After a long struggle, she gained control of the business."}, {"viet": "Sau khi bỏ lỡ một học kỳ vì đau ốm, nó đã phải học cật lực để theo kịp những người khác.", "eng": "After missing a term through illness he had to work hard to catch up with the others."}, {"viet": "Sau khi tắm nắng da tôi bắt đầu tróc từng mảng.", "eng": "After the sunbathing, my skin began to peel."}, {"viet": "Tất cả hàng hóa được giao miễn cước phí.", "eng": "All goods are delivered free of charge."}, {"viet": "Tất cả chất nhầy ở đáy chảo.", "eng": "All the crud in the bottom of the saucepan."}, {"viet": "Tờ báo mới đã giành được nhiều độc giả của các báo khác.", "eng": "Already the newspaper is gaining converts."}, {"viet": "Sự tình cờ gặp một người bạn.", "eng": "An accidental meeting with a friend."}, {"viet": "Một toan tính phế bỏ chính phủ Vichi.", "eng": "An attempt to delegitimise the Vichy government."}, {"viet": "Một bộ phim đáng chú ý nói về một đứa trẻ có năng khiếu xuất chúng.", "eng": "An extraordinary film about a highly gifted child."}, {"viet": "Một cái ghế cũ đã bị bỏ trên gác mái.", "eng": "An old chair that had been consigned to the attic."}, {"viet": "Sự phân tích đã cho thấy rằng chất côcain có trong hợp chất đó.", "eng": "Analysis showed that cocaine was present in the mixture."}, {"viet": "Annie không có ở nhà, nàng đã đi dạo.", "eng": "Annie's not in, she's gone for a walk."}, {"viet": "Xin làm hội viên của hiệp hội.", "eng": "Apply for membership of the association."}, {"viet": "Bạn là một người làm việc ban đêm hay làm việc ban ngày?", "eng": "Are you a night person or a morning person?"}, {"viet": "Anh đã được nghỉ đủ để tiếp tục lại chưa?", "eng": "Are you rested enough to go on?"}, {"viet": "Cô ta rất chán nản khi làm y tá, nhưng dường như làm người quản lý thì hợp với cô ta.", "eng": "As a nurse she got very frustrated, but being an administrator seems to suit her."}, {"viet": "Khi chúng tôi vừa ra khỏi nhà thì lạ thật, trời lại bắt đầu đổ mưa.", "eng": "As soon as we went out, lo and behold, it began to rain."}, {"viet": "Tại cuộc họp ban giám đốc, anh phải làm quen với cách nói năng theo nghi thức.", "eng": "At board meetings you have to get used to the formality of the language."}, {"viet": "Tôi nên đi chuyến xe lửa nhà ga nào?", "eng": "At which station should I change trains?"}, {"viet": "Barbara, tôi muốn bạn gặp Harry.", "eng": "Barbara, I'd like you to meet Harry."}, {"viet": "Phải kín đáo hơn nữa nếu không anh sẽ bị mọi người dị nghị đấy.", "eng": "Be more discreet or you'll get yourself talked about."}, {"viet": "Bản Sonat số 30 cung mi trưởng dành cho pianô, tác phẩm thứ 109 của Beethoven.", "eng": "Beethoven's Piano Sonata No 30 in E major, Op 109."}, {"viet": "Bill và Bod là bạn bè tâm giao.", "eng": "Bill and Bod are boon companions."}, {"viet": "Ngày nay người ta không còn hay đội mũ quả dưa nữa.", "eng": "Bowler hats are not often worn nowadays."}, {"viet": "Xây lâu đài cát bằng xô và xẻng.", "eng": "Build sand-castles with a bucket and spade."}, {"viet": "Nhưng tôi nghĩ huấn luyện viên chỉ muốn anh ấy ở ngay bên cạnh nếu một cầu thủ khác bị thương.", "eng": "But I think the coach just wants him to be handy if another player gets hurt."}, {"viet": "Nhưng nếu bạn chạy 55 dặm trên xa lộ Santa Ana người ta sẽ tông vào bạn phía sau.", "eng": "But you go 55, on the Santa Ana and they'll hit you from behind."}, {"viet": "Nhân tiện, giờ nghiệp vụ của chúng tôi là 9 giờ đến 11 giờ buổi sáng và 1 giờ 30 đến 4 giờ bốn ) buổi chiều.", "eng": "By the way, our banking hours are 9: 00 to 11: 00 in the morning and 1: 30 to 4: 00 in the afternoon."}, {"viet": "Vui lòng cho tôi xem hóa đơn?", "eng": "Can I have the bill, please?"}, {"viet": "Bạn có biết nấu các món ăn Nhật không?", "eng": "Can you cook any Japanese dishes?"}, {"viet": "Anh có thể thực sự làm cho chiếc xe ô-tô cũ ấy chạy lại được không?", "eng": "Can you really get that old car going again?"}, {"viet": "Lợi dụng những lỗi lầm của một xí nghiệp cạnh tranh.", "eng": "Capitalize on the mistakes made by a rival firm."}, {"viet": "Vua Charles đệ nhất bị chặt đầu.", "eng": "Charles I had his head cut off."}, {"viet": "Lễ nhà thờ bắt đầu lúc 9 giờ.", "eng": "Church is at 9 o'clock."}, {"viet": "Trộn trứng với một ít bột rồi đun lửa nhỏ riu riu hỗn hợp này.", "eng": "Combine the eggs with a little flour and heat the mixture gently."}, {"viet": "Máy bay Concorde mở đầu cho một kỷ nguyên mới trong du lịch hàng không.", "eng": "Concorde inaugurated a new era in aeroplane travel."}, {"viet": "Chép một công thức từ một cuốn sách ra.", "eng": "Copy a recipe out of a book."}, {"viet": "Ông có thể vui lòng cho tôi biết nhà ga Khởi Hành Quốc Tế ở đâu được không ạ?", "eng": "Could you please tell me where the International Departure is?"}, {"viet": "Những đám đông từ nhà hát túa ra đường phố tối tăm.", "eng": "Crowds disgorged from the theatre into the dark street."}, {"viet": "Thần chết không kiêng nể ai.", "eng": "Death is no respecter of persons."}, {"viet": "Mặc dù có sự diễn xuất tuyệt vời của nhiều ngôi sao nổi tiếng, chính một diễn viên trẻ mới vào nghề được chú ý tán thưởng nhiều nhất.", "eng": "Despite fine acting by several well-known stars it was a young newcomer who stole the show."}, {"viet": "Anh có viết xong bài báo kịp không?", "eng": "Did you get your article done in time?"}, {"viet": "Sự bất đồng ý kiến trong phe đối lập đã cho chính phủ một cơ hội thuận tiện để tiến hành nhanh luật mới.", "eng": "Disagreement in the Opposition has given the government a window of opportunity to press ahead with new legislation."}, {"viet": "Đừng có xâm phạm đời tư của tôi.", "eng": "Do not impinge on my privacy."}, {"viet": "Anh có cho rằng can thiệp vào là khôn ngoan không?", "eng": "Do you consider it wise to interfere?"}, {"viet": "Cậu có biết gì về chỗ anh ta ở không?", "eng": "Do you have any idea where he lives?"}, {"viet": "Anh có thuộc bảng cửu chương 6 không?", "eng": "Do you know you six times table?"}, {"viet": "Anh có thấy bọn trẻ nhỏ đang nhảy múa đó không?", "eng": "Do you see the little children dancing?"}, {"viet": "Ông muốn lấy vé đi một lượt hay vé khứ hồi?", "eng": "Do you want a single or a return ticket?"}, {"viet": "Tàu này có toa nằm không?", "eng": "Does this train have sleeping cars?"}, {"viet": "Đừng có mắng cô ta gay gắt quá.", "eng": "Don't come down too hard on her."}, {"viet": "Đừng cười nhé, tôi đã quyết định tự học tiếng Trung Quốc đấy.", "eng": "Don't laugh, but I've decided to teach myself Chinese."}, {"viet": "Đừng có phí tình cảm của bạn cho anh ta-anh ta sẽ chẳng bao giờ yêu bạn đâu.", "eng": "Don't squander your affection on him-he'll never love you."}, {"viet": "Anh không rung động trước vẻ đẹp của thôn quê sao?", "eng": "Don't you feel the beauty of the countryside?"}, {"viet": "Gõ lên bàn bằng ngón tay của ai.", "eng": "Drum on the table with one's fingers."}, {"viet": "Sao cơ? Tôi nói là tôi muốn về nhà.", "eng": "Eh? I said I want to go home."}, {"viet": "Có những lỗi lầm trong cuốn sách này.", "eng": "Errors have slipped into the book."}, {"viet": "Mọi người đều chơi hay, từ đội trưởng trở xuống.", "eng": "Everyone played well, from the captain down."}, {"viet": "Nói xin lỗi chứ nó là một thằng cực kỳ quấy rầy.", "eng": "Excuse my French, but he's a bloody nuisance."}, {"viet": "Gia đình rất quan trọng đối với ông ấy, và ông ấy rất quan trọng đối với gia đình.", "eng": "Family is very important to him, and he is very important to the family."}, {"viet": "Ngày nay số sinh viên chọn theo học các ngành khoa học ít hơn trước.", "eng": "Fewer students are opting for science courses nowadays."}, {"viet": "Bây giờ món cá lăn bột rán ăn với khoai tây rán rất đắt.", "eng": "Fish and chips is getting very expensive now."}, {"viet": "Thức ăn cho em bé nên ấm, chứ không nên nóng.", "eng": "Food for a baby should be warm, not hot."}, {"viet": "Những ảnh hưởng đến sự hình thành nhân cách trong cuộc đời của ai.", "eng": "Formative influences in one's life."}, {"viet": "Các phương tiện tài chính để trao đổi đã được một số công ty đa quốc gia phát hành để gây quỹ từ các thị trường khác nhau vào cùng một thời điểm.", "eng": "Fungibles have been issued by several multi-national companies to raise funds from different markets at the same time."}, {"viet": "Đưa cho tôi một bản tài liệu thống kê in ra từ máy vi tính.", "eng": "Get me a printout of the statistics."}, {"viet": "Trách mắng người nào về điều gì.", "eng": "Give somebody a telling-off for something."}, {"viet": "Những nước dãi chảy xuống cằm cậu bé.", "eng": "Gobs of spittle ran down his chin."}, {"viet": "Những người khách muốn chọn bàn theo ý của họ.", "eng": "Guests like to have their own favorite table."}, {"viet": "Vấn đề đó có được xem xét theo quan điểm của người đóng thuế không?", "eng": "Has the matter been viewed from the taxpayers'standpoint?"}, {"viet": "Em có bao giờ đến vũ trường Jack chưa?", "eng": "Have you ever been to Jack's?"}, {"viet": "Bạn có bao giờ gặp người nào thú vị trong những chuyến du lịch của bạn chưa?", "eng": "Have you met any interesting people during your travels?"}, {"viet": "Anh ta đang cố gắng phá kỷ lục thế giới.", "eng": "He'll be trying to beat the world record."}, {"viet": "Anh ta luôn luôn bô bô những ý kiến riêng của mình.", "eng": "He's always trumpeting his own opinions."}, {"viet": "Anh ấy sẽ là người dẫn đầu trèo lên núi Everest.", "eng": "He's going to lead the climb up Mount Everest."}, {"viet": "Anh ấy không phải là thật giỏi lắm nhưng lại là một người luôn luôn nỗ lực làm việc.", "eng": "He's not very good but he's a real trier."}, {"viet": "Anh ấy sạm nắng sau kỳ nghỉ hè.", "eng": "He's very brown after his summer holiday."}, {"viet": "Giám đốc và anh ấy nói chuyện riêng với nhau trong phòng khoảng ba giờ đồng hồ.", "eng": "He and the manager were closeted together for three hours."}, {"viet": "Hắn ta đã buột miệng thốt ra tin xấu đó trước khi tôi có thể ngăn hắn.", "eng": "He blurted out the bad news before I could stop him."}, {"viet": "Cậu ấy không thể nào trên 15 tuổi.", "eng": "He can't be more than fifteen."}, {"viet": "Anh ấy không thể không bộc lộ sự bất đồng của mình.", "eng": "He could not forbear from expressing his disagreement."}, {"viet": "Anh ta làm điều đó chỉ cốt là thử anh thôi.", "eng": "He did it simply to test you."}, {"viet": "Ông ấy đã uống bốn lon bia.", "eng": "He drank four cans of beer."}, {"viet": "Nó ngủ gật trong khi nó đang làm bài tập.", "eng": "He fell asleep while he was doing his homework."}, {"viet": "Hắn tránh né không kể cho nàng nghe rằng hắn đã mất việc.", "eng": "He funked telling her he had lost his job."}, {"viet": "Vào phút cuối anh ta lại chùn bước.", "eng": "He got cold feet at the last minute."}, {"viet": "Anh ta không có cách nào khác ngoài việc phải từ chức.", "eng": "He had no choice but to resign."}, {"viet": "Anh ta có cuộc sống thật thảnh thơi.", "eng": "He has a very soft life really."}, {"viet": "Anh ấy đã qua tuổi đam mê nhạc pop.", "eng": "He has outgrown his passion for pop music."}, {"viet": "Anh ta hy vọng kiếm được tiền để sản xuất một cuốn phim về nước Nhật.", "eng": "He hopes to find the money to produce a film about Japan."}, {"viet": "Anh ấy hạnh phúc nhưng không giàu có là lời nói đảo của Anh ấy giàu có nhưng không hạnh phúc.", "eng": "He is happy but not rich is the converse of He is rich but not happy."}, {"viet": "Anh ta có nhiều thời gian rảnh rỗi.", "eng": "He is very free with his time."}, {"viet": "Anh ta đã học viôlông khi còn nhỏ.", "eng": "He learned to fiddle as a young boy."}, {"viet": "Trông hắn giống một bưu tá nhưng thật ra thì hắn chỉ là người giả dạng.", "eng": "He looked like a postman but he was really a fake."}, {"viet": "Anh ta lại lấy vợ sau sáu tháng đã ly dị.", "eng": "He married again six months after the divorce."}, {"viet": "Ông ta lưu ý đến sự bất hòa giữa hai vợ chồng.", "eng": "He noted the disharmony between husband and wife."}, {"viet": "Anh ta chơi đàn dương cầm khá hay.", "eng": "He plays the piano tolerably well."}, {"viet": "Anh ấy quàng tay quanh người tôi và tiễn tôi đi.", "eng": "He put his arm round me and walked me away."}, {"viet": "Nó đã đọc bài thơ trong chừng mực nó nhớ được.", "eng": "He recited as much of the poem as he could remember."}, {"viet": "Ông ta nêu sơ một số ý kiến về các tòa nhà mới.", "eng": "He roughed out some ideas for the new buildings."}, {"viet": "Anh ta đúng là một thằng nhãi ngu xuẩn kiêu căng!", "eng": "He's an arrogant little twit!"}, {"viet": "Anh ta bị cha ghét bỏ bởi vì anh ta nói dối.", "eng": "He's in disgrace with his father because he told a lie."}, {"viet": "Anh ta là cái gì trong ngành ngân hàng.", "eng": "He's something in the banking line."}, {"viet": "Ông ta ngồi đó chìm đắm trong suy tưởng.", "eng": "He sat there deep in contemplation."}, {"viet": "Ông ta đã gửi cho chúng tôi một vật kỷ niệm nhỏ để nhớ về chuyến thăm của ông ta.", "eng": "He sent us a small remembrance of his visit."}, {"viet": "Anh ấy trượt chân ngã xuống mười bộ.", "eng": "He slipped and fell ten feet."}, {"viet": "Anh ta thọc xuống đất bằng chiếc gậy.", "eng": "He stabbed at the earth with his stick."}, {"viet": "Ông ta nghiên cứu thị trường Đức để tìm ra tiềm năng cho việc đầu tư có lợi.", "eng": "He studied the German market do find the potential there for profitable investment."}, {"viet": "Anh ta nghĩ mình là một Churchill thứ hai!", "eng": "He thinks he's a second Churchill!"}, {"viet": "Hắn lãnh ngay một cú đấm vào ngực.", "eng": "He took the blow on the chest."}, {"viet": "Bằng phép lạ anh ta đã biến sợi chỉ thành vàng.", "eng": "He turned the thread into gold by magic."}, {"viet": "Anh ấy muốn bày tỏ lòng biết ơn của mình nhưng anh ấy không tìm ra những lời tốt đẹp nhất.", "eng": "He wanted to express his thanks but he could not think of the best words."}, {"viet": "Anh ta bị bắt giữ vì say rượu và việc mọi người biết chuyện đã phá hỏng sự nghiệp của anh ta.", "eng": "He was arrested for drunkenness and the resultant publicity ruined his career."}, {"viet": "Ông ta đã được thụ chức Tổng giám mục năm ngoái.", "eng": "He was consecrated Archbishop last year."}, {"viet": "Nó làm bài tập về nhà chẳng được mấy cho đến khi chị nó giúp nó.", "eng": "He was getting nowhere with his homework until his sister helped him."}, {"viet": "Anh ta đang ra sức tán tỉnh cô gái xinh nhất của trường cao đẳng.", "eng": "He was making a play for the prettiest girl in the college."}, {"viet": "Ông ấy là người khởi xưởng thực sự của nền độc lập của đất nước.", "eng": "He was real architect of country's independence."}, {"viet": "Hắn bị ra toà vì không trả tiền thuê.", "eng": "He was taken to court for non-payment of rent."}, {"viet": "Anh ta không thiết tha với kế hoạch, song chúng tôi đã tìm cách thuyết phục được anh ta.", "eng": "He wasn't keen on the plan, but we managed to bring him round."}, {"viet": "Hắn sẽ nói bất kỳ điều gì, chỉ để buộc người ta làm những gì hắn muốn.", "eng": "He will say anything, just to get people to do what he wants."}, {"viet": "Hắn viết mục cáo phó cho tờ báo địa phương.", "eng": "He writes obits for the local newspaper."}, {"viet": "Bà ta cũng đề nghị giúp đỡ à? Thật buồn cười!", "eng": "Her, offer to help? That's a laugh!"}, {"viet": "Sự nghiệp của cô ấy lẫy lừng khi cô ấy chuyển sang điện ảnh.", "eng": "Her career took off when she transferred her talents to the big screen."}, {"viet": "Áo bà ta đã bốc cháy trong lò sưởi đốt bằng khí.", "eng": "Her dress caught alight in the gas fire."}, {"viet": "Sự thân mật của bà ấy khiến bà ấy nhanh chóng khắc phục được thành kiến của mấy đứa con chồng.", "eng": "Her friendliness soon overcame the prejudice of her stepchildren."}, {"viet": "Ảnh hưởng của bà ta giảm đi sau khi bà ta thất bại trong cuộc bầu cử.", "eng": "Her influence declined after she lost the election."}, {"viet": "Tính cách dịu dàng và kiên nhẫn của mẹ cô ấy.", "eng": "Her mother's gentle and forbearing character."}, {"viet": "Những lời than phiền lặt vặt của bà ta thực sự làm tôi bực mình.", "eng": "Her petty complaints really gripe me."}, {"viet": "Tính hài hước của cô ta làm anh chàng rất thích thú.", "eng": "Her sense of humour appealed to him enormously."}, {"viet": "Đứa con trai hai tuổi của cô ấy đi chập chững vào trong phòng.", "eng": "Her two-year-old son toddled into the room."}, {"viet": "Đây là bữa ăn sáng của ông, còn đây là hoá đơn.", "eng": "Here is your breakfast and this is the bill."}, {"viet": "Câu trả lời của nó đã chứng tỏ một lương tâm tội lỗi.", "eng": "His answer evidenced a guilty conscience."}, {"viet": "Lồng ngực anh ấy muốn vỡ tung vì niềm tự hào về thành tựu của mình.", "eng": "His breast swelled with pride at his achievement."}, {"viet": "Khả năng tài chánh của anh ta có thể vay khoản tiền 5.000 bảng Anh.", "eng": "His credit is good for £ 5,000."}, {"viet": "Vẻ mặt ông ta sầm lại khi ông ta nghe tin đó.", "eng": "His face clouded when he heard the news."}, {"viet": "Đề nghị hào hiệp của ông ta không bỏ qua được.", "eng": "His generous offer is not to be sniffed at."}, {"viet": "Sự lột tả ý nghĩa bản nhạc ấy của anh ta hơi quá tầm thường.", "eng": "His interpretation of the music was rather too literal."}, {"viet": "Anh ta là người ruột để ngoài da.", "eng": "His mind is an open book."}, {"viet": "Sự ham muốn cô ta làm cho hắn mù quáng không còn biết gì đến mọi chuyện khác.", "eng": "His passion for her made him blind to everything else."}, {"viet": "Sự nuôi dạy theo lối tu hành lúc còn nhỏ là để chuẩn bị cho anh ta trở thành nhà truyền giáo.", "eng": "His religious upbringing fitted him to be a missionary."}, {"viet": "Về chính tả nó kém nhưng nó rất nhanh trí về các con số.", "eng": "His spelling's poor but he's very quick at figures."}, {"viet": "Cung cách không bình thường của anh ta nhằm hấp dẫn.", "eng": "His unusual manners were intended to attract."}, {"viet": "Giữ 500 cổ phần trong công ty vận tải biển.", "eng": "Hold 500 shares in a shipping company."}, {"viet": "Chiến sự chấm dứt theo sự dàn xếp của bản hòa ước.", "eng": "Hostilities ended with the conclusion of peace treaty."}, {"viet": "Làm sao quyết định này có thể nhất trí với công luận được?", "eng": "How can this decision be reconciled with justice?"}, {"viet": "Những khu vườn ở đất nước bạn khác với những khu vườn ở Nhật Bản như thế nào?", "eng": "How do gardens in your country differ from gardens in Japan?"}, {"viet": "Mọi người trong gia đình bạn có khỏe không?", "eng": "How is everyone in your family?"}, {"viet": "Viên kim cương này bao nhiêu cara?", "eng": "How many carats is this diamond?"}, {"viet": "Đã mấy năm không gặp nhau rồi?", "eng": "How many years has it been?"}, {"viet": "Bao lâu bạn đi dạo một lần?", "eng": "How often do you go for a walk?"}, {"viet": "Hàng trăm người đã tới dự lễ tang vị Tổng thống quá cố.", "eng": "Hundreds came to pay their last respects to the dead president."}, {"viet": "Nếu bạn không phản đối thì tôi cũng muốn tới.", "eng": "I'd like to come too, if you've no objection."}, {"viet": "Tôi sẽ là hàng xóm của anh chừng một tuần.", "eng": "I'll be in your neighbourhood for around a week."}, {"viet": "Tôi sẽ báo cho ông biết kết quả khi ông quay lại.", "eng": "I'll inform you of the result when you come back."}, {"viet": "Lần tới khi đến một nhà hàng Trung Quốc, tôi sẽ uống thử nó.", "eng": "I'll try it next time when I go to a Chinese restaurant."}, {"viet": "Thề cho trời đánh tôi nếu tôi còn để hắn đối xử với anh như thế.", "eng": "I'm blowed if I'm going to let him treat you like that."}, {"viet": "Tôi sẽ cất một ít chứng khoán và đồ vật hiếm ở một nơi an toàn.", "eng": "I'm going to put some securities and curios in a safe place."}, {"viet": "Tôi chưa sẵn sàng gặp họ bây giờ.", "eng": "I'm not disposed to meet them at the moment."}, {"viet": "Tôi chán ngấy chuyện than phiền của anh-thôi anh im đi, có được không?", "eng": "I'm sick of your complaining-just pack it in, will you?"}, {"viet": "Tôi chắc là chúng ở đâu đó quanh đây thôi.", "eng": "I'm sure they are around here somewhere."}, {"viet": "Khó mà nuôi sống gia đình với thu nhập ít ỏi.", "eng": "I'ts difficult raising a family on a small income."}, {"viet": "Tôi thôi không đặt mua tạp chí đó nữa.", "eng": "I've cancelled my subscription to the magazine."}, {"viet": "Tôi nghe nói là giá xăng đã giảm đi mười xu một galông.", "eng": "I've heard that ten pence a gallon is coming off the price of petrol."}, {"viet": "Tôi đã gửi thiếp cho tất cả gia đình tôi, rồi lại còn gia đình anh và hàng xóm nữa.", "eng": "I've sent cards to all my family, then there's your family and the neighbours."}, {"viet": "Tôi luôn luôn làm vài động tác thể dục giản đơn để khởi động trước trận đấu.", "eng": "I always do a few easy exercises to limber up before a match."}, {"viet": "Tôi cảm thấy không hứng thú để trò chuyện tối nay.", "eng": "I am not in tune for a talk this evening."}, {"viet": "Tôi đã yêu cầu anh ta nếu không có gì phiền thì lát nữa cứ gọi lại.", "eng": "I asked him if he wouldn't mind calling later."}, {"viet": "Tôi mua chiếc áo khoác này với giá 50%.", "eng": "I bought this coat at 50% discount."}, {"viet": "Tôi ngớ người ra về chiếc sơ mi nó đang mặc.", "eng": "I can't get over that shirt he was wearing."}, {"viet": "Không thể để mặc thằng bé mà không trông nom ngó ngàng gì đến.", "eng": "I can't trust that boy out of my sight."}, {"viet": "Tôi có thể nhận được tối đa là bốn người lên ôtô của tôi.", "eng": "I can take up to four people in my car."}, {"viet": "Tôi không thể đi bộ xa đến mức đó.", "eng": "I can't walk that far."}, {"viet": "Tôi không thể hiểu được nhiều về bài nói của ông ta-tất cả đều bằng tiếng Nga.", "eng": "I couldn't make much of his speech-it was all in Russian."}, {"viet": "Tôi thích một cốc nước ngọt.", "eng": "I'd prefer a soft drink."}, {"viet": "Tôi không muốn làm việc đó nhưng Peter vẫn cứ thúc giục tôi.", "eng": "I didn't want to do it but Peter kept egging me on."}, {"viet": "Tôi không biết bản thân anh ấy nhưng đã đọc sách của anh ta.", "eng": "I don't know him personally, but I've read his books."}, {"viet": "Tôi không tự cho là người hiểu biết thành thạo về đề tài này.", "eng": "I don't profess expert knowledge of this subject."}, {"viet": "Tôi không muốn bị lôi kéo vào cuộc cãi lộn về cải cách nhà trường.", "eng": "I don't want to get sucked into the row about school reform."}, {"viet": "Tôi không thích cái trò xếp hàng nối đuôi chán nản này.", "eng": "I don't much like this queuing lark."}, {"viet": "Tôi ủng hộ sự thống nhất Châu âu nhưng tôi không cam kết là nó sẽ theo hình thức nào.", "eng": "I favored European unity, but I was agnostic about the form it should take."}, {"viet": "Tôi cảm thấy có cái gì bò trên cánh tay.", "eng": "I felt something crawl up my arm."}, {"viet": "Tôi nắm được là quá khứ của anh ta không hoàn toàn trong sạch.", "eng": "I gather his past life was not altogether savoury."}, {"viet": "Tôi thức dậy sớm nhưng anh ấy vẫn ngủ tiếp.", "eng": "I got up early, but he slept on."}, {"viet": "Tôi chẳng có cái gì uống mạnh hơn là nước cam.", "eng": "I had nothing stronger than orange juice to drink."}, {"viet": "Tôi thích uống rượu tối nay.", "eng": "I have a fancy for some wine tonight."}, {"viet": "Tôi ăn sáng lúc 8 giờ ngày thứ ba.", "eng": "I have my breakfast at 8 o'clock on Tuesday."}, {"viet": "Tôi phải lấy sổ gửi tiền ngân hàng để ở bàn làm việc đã.", "eng": "I have to get my bank-book out of the desk."}, {"viet": "Tôi không có nhiều tiền mặt như thế.", "eng": "I haven't got that much cash."}, {"viet": "Tôi hy vọng mọi sự diễn ra tốt đẹp với anh.", "eng": "I hope all turns out well for you."}, {"viet": "Tôi bị thương ở đầu gối khi tôi ngã xe đạp.", "eng": "I hurt my knee when I fell off my bicycle."}, {"viet": "Tôi biết anh ta nói anh ta thích, nhưng đó chỉ là lịch sự thôi.", "eng": "I know he said he liked it, but he was only being polite."}, {"viet": "Tôi thích bà ta hơn là ông chồng bà.", "eng": "I like her more than her husband."}, {"viet": "Tôi sẽ đến đó chỉ một lát thôi.", "eng": "I'll be there in just a few minutes."}, {"viet": "Con sẽ không bao giờ quên câu chuyện này.", "eng": "I'll never forget this story."}, {"viet": "Tôi là người xa lạ trong thành phố này.", "eng": "I'm a stranger in this town."}, {"viet": "Tôi cũng định đi xem phim.", "eng": "I'm going to the movies, too."}, {"viet": "Bố buồn cho những người hay sợ hãy.", "eng": "I'm sad about people that are afraid."}, {"viet": "Tôi gửi bưu thiếp cho chi tôi ở Los Angeles mất cả hai tuần.", "eng": "I mailed a postcard to my sister in Los Angeles and it took two weeks."}, {"viet": "Tôi phải đi mua vé vào thềm ga ở quầy đằng kia.", "eng": "I must go and get a platform ticket at that window."}, {"viet": "Tôi cần để dành bụng cho món tráng miệng chứ.", "eng": "I need to save room for dessert."}, {"viet": "Tôi chỉ cần một cuốn thôi là có trọn bộ các tiểu thuyết của Dickens.", "eng": "I only need one volume to complete my set of Dickens's novels."}, {"viet": "Tôi xếp bà ta vào hàng ngũ các tiểu thuyết gia hiện đại hàng đầu.", "eng": "I put her in the top rank of modern novelists."}, {"viet": "Tôi nhận ra khuôn mặt cô ấy nhưng không sao nhớ được tên.", "eng": "I recognize her face, but her name eludes me."}, {"viet": "Tôi tự nhủ không biết ý cô ấy là thế nào.", "eng": "I said to myself I wonder what she means."}, {"viet": "Người ta trông tôi phải xùy tiền ra cho bữa nhậu.", "eng": "I shall be expected to shell out the money for the party."}, {"viet": "Tôi lẻn ra khỏi phòng mà không ai thấy.", "eng": "I slipped from the room unseen."}, {"viet": "Tôi nghĩ lá đơn của tôi đã bị mất do một viên chức quan liêu bất tài nào đó.", "eng": "I suppose my application has been lost by some incompetent bureaucrat."}, {"viet": "Tôi định tôi sẽ đi bơi.", "eng": "I think I'll go for a swim."}, {"viet": "Tôi nghĩ chúng rất rất hay.", "eng": "I think they are very good."}, {"viet": "Tôi đã nói thẳng với cô ta điều tôi nghĩ về cô ta.", "eng": "I told her right what I thought of her."}, {"viet": "Tôi quay lại nhìn quanh trong xe buýt và người đang ngồi sau tôi không ai khác ngoài vợ cũ của tôi.", "eng": "I turned round on the bus and who should be sitting behind me but my ex-wife."}, {"viet": "Tôi dẫn nó đến đó mỗi ngày.", "eng": "I walk him there every day."}, {"viet": "Tôi muốn tham quan thành phố.", "eng": "I want to see the town."}, {"viet": "Tôi bị lừa mua phải chiếc ô tô không dùng được.", "eng": "I was conned into buying a useless car."}, {"viet": "Tôi đang nhìn chỗ khác thì có một cú ghi bàn.", "eng": "I was looking the other way when the goal was scored."}, {"viet": "Tôi ngạc nhiên nghe mẹ chồng tôi kể một câu chuyện chớt nhả như vậy.", "eng": "I was surprised to hear my mother-in-law telling such a fruity story."}, {"viet": "Tôi sẽ đồng ý đi với điều kiện miễn là được trả các chi phí.", "eng": "I will agree to go providing my expenses are paid."}, {"viet": "Tôi mong anh sẽ viết đủ rõ cho chúng tôi đọc được.", "eng": "I wish you'd write clearly enough for us to read it."}, {"viet": "Con sẽ không thay đổi ý định đâu.", "eng": "I won't change my mind."}, {"viet": "Tôi muốn biết là các ông đã nhận được số tiền mà chúng tôi gửi cho các ông vào tuần rồi hay chưa.", "eng": "I would like to know whether you received the remittance we sent you last week."}, {"viet": "Dù hoàn cảnh nào đi nữa, tôi sẽ không cho mấy đứa cháu của tôi ở lại.", "eng": "I wouldn't have my sister's children to stay again not at any price."}, {"viet": "Nếu nó đi lúc chín giờ thì bây giờ hẳn là nó phải ở đây rồi.", "eng": "If he started at nine, he ought to be here by now."}, {"viet": "Hắn nói một cách nuối tiếc, giá mà hồi đó tôi biết anh.", "eng": "If only I had known you then, he said wistfully."}, {"viet": "Nếu tin này mà đến tai cô ta thì cô sẽ nổi khùng lên.", "eng": "If this news ever reaches her ears, she'll be furious."}, {"viet": "Nếu anh đã hỏi thì tôi xin nói, tất cả chỉ là trò bịp bợm.", "eng": "If you ask me, the whole thing's a do."}, {"viet": "Nếu anh sửa chữa lại mấy cái phanh thì ôtô sẽ rất an toàn.", "eng": "If you fix the brakes the car will be as safe as houses."}, {"viet": "Nếu anh lấy 8 trừ 3 sẽ còn lại 5.", "eng": "If you take 3 from 8, 5 remains."}, {"viet": "Ngay sau khi đơn của anh được chấp nhận, anh sẽ nhận được thông báo.", "eng": "Immediately your application is accepted, you will be informed."}, {"viet": "Cùng với nhiều người khác, cô đã xin một chân huấn luyện.", "eng": "In common with many others, she applied for a training place."}, {"viet": "Ở Nhật, buổi chiếu cuối thường vào lúc 7: 00.", "eng": "In Japan the last show is usually at 7: 00."}, {"viet": "Mặc dầu có những lời xúc phạm này, cô ấy đã kiềm chế để không tức giận.", "eng": "In spite of these insults, she managed not to get angry."}, {"viet": "Trong việc tiến hành nhiệm vụ, nó đã vấp phải nhiều sự kháng cự.", "eng": "In the prosecution of his duties he had met with a good deal of resistance."}, {"viet": "Trong bài thơ của anh có vài câu hay.", "eng": "In your poem there are some beautiful lines."}, {"viet": "Năm quả táo lấy năm quả trứng có phải là một sự trao đổi công bằng không?", "eng": "Is five apples for five eggs a fair exchange?"}, {"viet": "Lúc này đồng pao mạnh hay yếu ( so với đồng yên )?", "eng": "Is the pound strong or weak ( against the yen ) at the moment?"}, {"viet": "Vui lòng cho biết đây có đúng là chuyến xe buýt đi đến đó không?", "eng": "Is this the right bus, please?"}, {"viet": "Đó là cuốn sách mới nên có lẽ nó được chất lên bàn ở đâu đó.", "eng": "It's a new book so it should be piled up on a table somewhere."}, {"viet": "Không hề chắc chắn là họ có đến hay không.", "eng": "It's by no means certain that they will come."}, {"viet": "Đã đến lúc con dùng việc rong chơi và bắt tay tìm một công việc.", "eng": "It's high time you stopped fooling a round and stared looking for a job."}, {"viet": "Dựa vào bề ngoài mà xét không phải bao giờ cũng là khôn ngoan.", "eng": "It's not always wise to go by appearances."}, {"viet": "Hạn chế đặc quyền cho những người trong ban điều hành đơn thuần chỉ là chuyện tin có tầng lớp ưu tú.", "eng": "It's sheer elitism to restrict these privileges to the management staff."}, {"viet": "Trời thường ấm áp vào tháng 4 và tháng 5, nhưng đôi khi cũng có mưa.", "eng": "It's usually warm in April and May, but it rains sometimes."}, {"viet": "Anh đến chậm một chút cũng không sao hết.", "eng": "It doesn't matter in the least if you're a bit late."}, {"viet": "Có thể tin được là sứ mệnh hoà bình sẽ thành công.", "eng": "It is conceivable that the peace mission will succeed."}, {"viet": "Hoàn tất công trình tuần này là điều quan trọng hơn cả.", "eng": "It is of overriding importance to finish the project this week."}, {"viet": "Ngôi nhà này thật kinh khủng, cứ như cái ổ chuột.", "eng": "It looks terribly slummy in this house."}, {"viet": "Đã Iâu Iắm rồi từ khi tôi gặp bạn Iần cuối.", "eng": "It's been ages since I last saw you."}, {"viet": "Người ta nói là sẽ có bão vào buổi chiều đấy.", "eng": "It said there would be a storm in the afternoon."}, {"viet": "Đã mất hàng tiếng đồng hồ mới làm cho nhà cửa sạch sẽ, ngăn nắp.", "eng": "It took hours to get the house straight."}, {"viet": "Con bé thật là dũng cảm dám chống cự lại những kẻ bắt nạt đó.", "eng": "It was brave of her to stand up to those bullies."}, {"viet": "Chính sự thèm khát đủ làm tôi ăn hết cả chỗ sôcôla này.", "eng": "It was pure greed that made me finish an those chocolates."}, {"viet": "Nó sẽ xong vào tối ngày mốt.", "eng": "It will be ready the day after tomorrow in the evening."}, {"viet": "James cao hơn Paul, còn Richard thì cao nhất.", "eng": "James is taller than Paul, but Richard is the tallest James."}, {"viet": "John không bao giờ tiếc các con những gì chúng thực sự cần.", "eng": "John never begrudged his children what they really needed."}, {"viet": "Katakana được dùng để viết đa số các từ vay mượn.", "eng": "Katakana is used to write many loanwords."}, {"viet": "Sợ có người nào sẽ cho điều đó là kỳ quặc, tôi xin đảm bảo rằng điều đó là hoàn toàn có thật.", "eng": "Lest anyone should think it strange, let me assure you that it is quite true."}, {"viet": "Ta hãy gặp nhau dưới cái đồng hồ.", "eng": "Let's meet under the clock."}, {"viet": "Nhiều dân thường đã bị chết trong các cuộc oanh tạc London bằng máy bay.", "eng": "Many civilians were killed in the air raids on London."}, {"viet": "Nhiều người ủng hộ phương án trên, nhưng cá nhân tôi tán thành phương án sau.", "eng": "Many support the former alternative, but personally I favour the latter one."}, {"viet": "Cho phép tôi đi cùng với bạn nhé?", "eng": "May I come along with you?"}, {"viet": "Có lẽ cô ấy cùng kiểu người với John, không cùng kiểu người với anh.", "eng": "Maybe she is John's type, and not yours."}, {"viet": "Hầu hết những nhà trong phố này do chủ nhà ở.", "eng": "Most of the houses in this street are owner-occupied."}, {"viet": "Bà Smith đề nghị mọi người hưởng ứng và Ông Jones đã tán thành.", "eng": "Mrs Smith proposed the vote of thanks, and Mr Jones seconded."}, {"viet": "Công ty của tôi đang thương lượng việc phân phối một loạt máy tính để bàn được chế tạo ở đây, và tôi đã được phái đến để kiểm tra khả năng sản xuất của công ty đó.", "eng": "My company was negotiating the distribution of a line of desk calculators made here, and I was sent to check out the firm's production capabilities."}, {"viet": "Thú tiêu khiển riêng của tôi là một cách xả hơi tốt đối với sự căng thẳng do công việc tích lại.", "eng": "My hobby is a good safety-valve for the tension that builds up at work."}, {"viet": "Bố mẹ tôi lo lắng cho tôi nếu tôi về trễ.", "eng": "My parents worry about me if I come home late."}, {"viet": "Nam mãi mới đồng ý để gọi cảnh sát.", "eng": "Nam belatedly agreed to call in the police."}, {"viet": "Hè sang năm anh ta hy vọng đưa gia đình từ Mỹ sang.", "eng": "Next summer he hopes to bring his family over from the States."}, {"viet": "Khuyến khích nhiều đến đâu cũng không làm cho nó nhảy.", "eng": "No amount of encouragement would make him jump."}, {"viet": "Chưa, trên thực đơn có quá nhiều món ăn.", "eng": "Not yet, there are so many dishes on the menu."}, {"viet": "Nuôi dạy trẻ là một thiên hướng cũng như một nghề nghiệp.", "eng": "Nursing is a vocation as well as a profession."}, {"viet": "Ôi, đôi vớ ngắn này không phải là của tôi.", "eng": "Oh, this pair of socks isn't mine."}, {"viet": "Suy đi tính lại tôi nghĩ là bây giờ tôi nên đi thì hơn.", "eng": "On second thoughts I think I'd better go now."}, {"viet": "Chỉ uống một li nữa là anh sẽ say đấy.", "eng": "One more of those and you'll be around the bend."}, {"viet": "Những nhân viên khác của hãng hàng không gồm có một trưởng trạm hàng không, giám sát các dịch vụ hành khách, và các nhân viên phụ trách việc đặt trước, ghi chép các yêu cầu đặt chỗ trên chuyến bay.", "eng": "Other airline workers include an airline station manager, who oversees passenger services, and reservations agents, who keep records of flight reservations."}, {"viet": "Bây giờ người bạn của chúng ta từ Trung Quốc tới sẽ nói chuyện với chúng ta về công cuộc nghiên cứu của bà ấy.", "eng": "Our friend from China will now tell us about her research."}, {"viet": "Kế hoạch của ta đã thất bại ta nên quay trở lại điểm xuất phát.", "eng": "Our plan failed, so we were back to square one."}, {"viet": "Trên 2000 người tham gia trong cuộc biểu tình ngày hôm qua.", "eng": "Over 2000 people were in attendance at yesterday's demonstration."}, {"viet": "Thanh toán tất cả các hoá đơn là một sự đòi hỏi quá căng đối với nguồn tài chính của tôi.", "eng": "Paying all the bills is a strain on my resources."}, {"viet": "Trong một chiếc ô tô, chạy nhanh không quan trọng bằng độ tin cậy.", "eng": "Performance is less important than reliability in a car."}, {"viet": "Cảnh sát đã triển khai một cuộc truy lùng rộng rãi những tên cướp vàng thoi.", "eng": "Police have launched a man-hunt for the bullion robbers."}, {"viet": "Những bức tranh của Rembrandt cho thấy dấu ấn của thiên tài.", "eng": "Rembrandt's paintings show the cachet of genius."}, {"viet": "Các tờ báo chuyên khai thác tin giật gân đã cố kiếm lợi trên nỗi khổ đau của bà ấy.", "eng": "Sensation-seeking newspapers tried to cash in on her misery."}, {"viet": "Nàng sẽ vui vẻ khi thi xong.", "eng": "She'll be glad to get the exam over and done with."}, {"viet": "Cô ta là một đạo diễn phim xuất sắc từ thập niên 1960.", "eng": "She's been around as a film director since the 1960s."}, {"viet": "Bà ta đã nắm quyền cai quản tất cả chúng ta quá lâu rồi.", "eng": "She's had us all on a string for too long."}, {"viet": "Chiều nào bà ta cũng ra làm vườn.", "eng": "She's outdoors gardening every afternoon."}, {"viet": "Cô ta rất hào phóng trong lời hứa hẹn nhưng với tiền bạc thì không nhiều như thế.", "eng": "She's very liberal with promises but much less so with money."}, {"viet": "Cô ta hỏi anh ấy đã đi những đâu, nhưng anh ta không trả lời.", "eng": "She asked where he'd been, but he didn't respond."}, {"viet": "Cô ấy mang bát nước một cách cẩn thận.", "eng": "She carried the bowl of water carefully."}, {"viet": "Cô ấy cố cắt dây tìm cách tự giải thoát.", "eng": "She cut at the rope in an attempt to free herself."}, {"viet": "Chị ấy không kiếm được nhiều tiền từ việc viết lách của mình.", "eng": "She doesn't earn much from her writing."}, {"viet": "Bà ấy cảm thấy con trai của mình đã được xếp vào loại đứa trẻ có vấn đề.", "eng": "She felt her son had been pigeon holed as a problem child."}, {"viet": "Cô ấy được chính phủ cho tiền trợ cấp.", "eng": "She gets a disability pension from the government."}, {"viet": "Cô ta đã có một cuộc đính hôn rất là không xứng đôi.", "eng": "She had contracted a most unsuitable marriage."}, {"viet": "Bà ta có máy điện thoại nhánh ở trong bếp và trong buồng ngủ.", "eng": "She has an extension in the kitchen and in the bedroom."}, {"viet": "Cô ta rất ghét bất kỳ ai cứ lắng nghe khi cô ta gọi điện thoại.", "eng": "She hates anyone listening when she's telephoning."}, {"viet": "Bà ấy quan tâm đến việc bảo vệ môi trường.", "eng": "She is interested in the conservation of environment."}, {"viet": "Cô ấy thức suốt đêm bên giường bệnh của người đàn bà ốm.", "eng": "She kept an all-night vigil by the sick woman's bedside."}, {"viet": "Trông cô ấy như thể vừa khóc.", "eng": "She looked as though she had been crying."}, {"viet": "Cô ta có thể giống bố về khuôn mặt nhưng về các khía cạnh khác thì cô ta hoàn toàn chẳng giống ông ấy tí nào.", "eng": "She may resemble her father facially, but in other respects she's not at all like him."}, {"viet": "Cô ta đi ngang qua tôi ngoài phố mà cũng chẳng chào hỏi gì cả.", "eng": "She passed me in the street without even saying hello."}, {"viet": "Bà ta lướt qua những phần ghi chép của mình trước khi thuyết trình.", "eng": "She ran over her notes before giving the lecture."}, {"viet": "Cô ta là người cư xử rất dịu dàng.", "eng": "She's a very mild-mannered person."}, {"viet": "Cô bé đó đi đứng không vững lắm.", "eng": "She's not very steady on her pins."}, {"viet": "Cô ta nhìn thấy ông ta qua cặp mắt mờ lệ.", "eng": "She saw his face through a mist of tears."}, {"viet": "Cô ấy tỏ rõ một sự dũng cảm khác thường khi cô ấy nghe thấy tin xấu.", "eng": "She showed remarkable courage when she heard the bad news."}, {"viet": "Cô ấy đứng vượt hẳn trong nhóm những nhà điêu khắc hiện đại.", "eng": "She stands alone among modern sculptors."}, {"viet": "Cô ấy nói một cách hoàn toàn bình thường mặc dù cô ấy hết sức sợ.", "eng": "She talked quite naturally even though she was frightened."}, {"viet": "Cô ta đã lộn ngược tất cả túi của cô để tìm chùm chìa khoá.", "eng": "She turned all her pockets inside out looking for her keys."}, {"viet": "Cô ấy làm giám đốc một công ty trước lúc 25 tuổi, đó không phải là một tốc độ tồi!", "eng": "She was a company director before she was 25, that's not bad going!"}, {"viet": "Mọi người đều đồng ý chọn cô ta làm người lãnh đạo.", "eng": "She was chosen as leader by common consent."}, {"viet": "Cô ta đang bồng đứa bé trong tay.", "eng": "She was holding the baby in her arms."}, {"viet": "Cô ta đã chuẩn bị rất kém cỏi cho kỳ thi.", "eng": "She was poorly prepared for the examination."}, {"viet": "Cô ta đã bị kết tội là đã chểnh mảng.", "eng": "She was taxed with having been negligent."}, {"viet": "Cô ta diện quần áo rất đúng mốt.", "eng": "She wears clothes that are right up to date."}, {"viet": "Cô ấy được một khoản tiền kếch xù ở sòng bạc.", "eng": "She won a fantastic sum of money in the casino."}, {"viet": "Sheila rất thông minh nhưng có phần ngại ngùng trong việc bày tỏ ý nghĩ của cô ấy.", "eng": "Sheila is very clever but rather backward in expressing her ideas."}, {"viet": "Giấu những lá thư vào nơi không ai tìm được.", "eng": "Shut the letters away where no one will find them."}, {"viet": "Hút xăng từ xe ôtô vào thùng chứa bằng vòi hút.", "eng": "Siphon petrol out of a car into a can."}, {"viet": "Những hòn đá nhỏ lăn xuống sườn đồi khi họ chạy lên.", "eng": "Small stones rolled down the hillside as they ran up."}, {"viet": "Vậy dường như anh thích nó hơn là L. A.", "eng": "So it seems that you liked it better than L. A."}, {"viet": "Một vài động vật không hoạt động vào ban ngày.", "eng": "Some animals are inactive during the daytime."}, {"viet": "Một số thành viên đang vận động ngầm để làm cho người thư ký bị thải hồi.", "eng": "Some of the members had been intriguing to get the secretary dismissed."}, {"viet": "Độ ba mươi người đã dự lễ tang.", "eng": "Some thirty people attended the funeral."}, {"viet": "Những thiết bị phức tạp dùng trên con tàu vũ trụ.", "eng": "Sophisticated devices used in spacecraft."}, {"viet": "Sống những ngày cuối tuần ở nơi biệt lập miền quê của tôi.", "eng": "Spend weekends at my country retreat."}, {"viet": "Việc trộm cắp mang lại ô danh cho gia đình anh.", "eng": "Stealing reflects dishonour on your family."}, {"viet": "Đừng trêu chọc cô Suzan đáng thương nữa!", "eng": "Stop taking the mickey out of poor Susan!"}, {"viet": "Những sự kiện tiếp theo đã chứng minh các nghi ngờ của ông ta là đúng.", "eng": "Subsequent events vindicated his suspicions."}, {"viet": "Đau khổ trong tay của một kẻ áp bức.", "eng": "Suffer at the hands of an oppressor."}, {"viet": "Susan vừa mới dọn đến ở nhà kế bên.", "eng": "Susan just moved in next door."}, {"viet": "Con hãy học khóa dự bị đại học ở trường ban ngày rồi học khóa học nghề ở trường ban đêm.", "eng": "Take the college prep course in the day school, and the shop courses at the night school."}, {"viet": "Những thanh thiếu niên lén chạy xe vui chơi quanh thành phố.", "eng": "Teenagers going for joy-rides round town."}, {"viet": "Cám ơn, anh thật đáng mến.", "eng": "Thank you, you are a dear."}, {"viet": "Đó là nơi người ta đọc diễn văn vào những ngày chủ nhật, phải vậy không?", "eng": "That's the place where people make speeches on Sundays, isn't it?"}, {"viet": "Đồ uống đó đã làm tôi cảm thấy khó chịu.", "eng": "That drink has made me feel quite funny."}, {"viet": "Điều đó có lẽ tiện cho ông hơn.", "eng": "That may be more convenient for you."}, {"viet": "Thật ra đó không phải là một ý kiến không hay.", "eng": "That's not a bad idea, actually."}, {"viet": "Đây là một bữa ăn đắt tiền-chúng ta hãy chia đôi tiền ăn.", "eng": "That was an expensive meal-let's go halves."}, {"viet": "Tai nạn xảy ra là kết quả sai lầm của con người.", "eng": "The accident was the result of human error."}, {"viet": "Bí mật muôn đời của vũ trụ.", "eng": "The ageless mystery of the universe."}, {"viet": "Người nông dân nổi giận đang xông vào chúng tôi.", "eng": "The angry farmer was bearing down on us."}, {"viet": "Vùng đó đầy rẫy cảnh sát.", "eng": "The area was crawling with police."}, {"viet": "Dường như máy rút tiền hôm qua chạy êm.", "eng": "The ATM appeared in good working order yesterday."}, {"viet": "Việc trao tặng phần thưởng này đã hoàn thành một cách vinh quang sự nghiệp của anh ta.", "eng": "The award of this prize crowned his career."}, {"viet": "Ban nhạc đã trỗi nhạc khi các diễn viên lên trên sân khấu.", "eng": "The band played the performers onto the stage."}, {"viet": "Đài BBC đang mô tả sơ lược ngành công nghiệp hạt nhân của Anh.", "eng": "The BBC are working on a profile of the British nuclear industry."}, {"viet": "Hoá đơn lên tới gần 40 pao.", "eng": "The bill totted up to almost 40 pounds."}, {"viet": "Chiếc thuyền đã đắm ở chỗ các mỏm đá gần cảng.", "eng": "The boat foundered on rocks near the harbour."}, {"viet": "Cuốn sách bị quá nhiều chi tiết lộn xộn.", "eng": "The book suffers an excess of unfocused detail."}, {"viet": "Cậu bé mà cha của nó đang ở tù.", "eng": "The boy whose father is in prison."}, {"viet": "Chiếc xe tải bị hỏng chặn mất đường.", "eng": "The broken down truck obstructed the road."}, {"viet": "Nào nhanh lên! Xe buýt chỉ còn năm phút là chạy.", "eng": "The bus will be leaving in five minutes, so jump to it!"}, {"viet": "Các nhà thiết kế ô tô đã hy sinh sự tiện nghi để đổi lấy lợi ích kinh tế.", "eng": "The car's designers have sacrificed comfort to economy."}, {"viet": "Chiếc xe ôtô bị kẹt cứng dưới một thân cây đổ.", "eng": "The car was pinned under a fallen tree."}, {"viet": "Người bắt bóng là người đánh gậy hạng nhì trong toàn đội hình ngày hôm nay.", "eng": "The catcher is batting second in today's line up."}, {"viet": "Đường vượt qua biển Măng-sơ rất êm ả.", "eng": "The Channel crossing was very calm."}, {"viet": "Thằng bé đó cần phải đét đít cho đau.", "eng": "The child needs a good smacking."}, {"viet": "Tụi trẻ mè nheo bố chúng cho chúng đi xem chiếu bóng.", "eng": "The children badgered their father into taking them to the cinema."}, {"viet": "Bọn trẻ há hốc mồm ( thích thú ) khi xem chương trình đó.", "eng": "The children were agape ( with excitement ) as they watched the programme."}, {"viet": "Nguồn cung cấp nước của thành phố không đủ ( cho nhu cầu của nó ).", "eng": "The city's water supply is no longer adequate ( for its needs )."}, {"viet": "Quần áo trên sàn nhà là quần áo bẩn.", "eng": "The clothes that are on the floor are dirty."}, {"viet": "Sự biến Bắc Mỹ thành thuộc địa bởi người Anh và người Pháp.", "eng": "The colonisation of North America by the British and French."}, {"viet": "Tuần rồi công ty này ngưng hoạt động.", "eng": "The company folded up last week."}, {"viet": "Những đặc trưng của máy vi tính được ghi đầy đủ trong cuốn sách nhỏ của chúng tôi.", "eng": "The computer's features are detailed in our brochure."}, {"viet": "Những động tác uốn vặn của chuyên viên yo-ga.", "eng": "The contortions of a yoga expert."}, {"viet": "Sự giàu có của đất nước là dựa trên thương mại.", "eng": "The country's wealth is based on trade."}, {"viet": "Con bò ngoe nguẩy cái đuôi từ bên nọ sang bên kia.", "eng": "The cow's tail flicked from side to side."}, {"viet": "Đám đông tản đi khi trời bắt đầu mưa.", "eng": "The crowd scattered when it began to rain."}, {"viet": "Tính chất chu kỳ của hoạt động kinh tế.", "eng": "The cyclical nature of economic activity."}, {"viet": "Các văn tự về khu đất ấy qui định là không được trồng cây trên đó.", "eng": "The deeds to the land stipulate that no trees may be planted thereon."}, {"viet": "Bọn liều mạng đã cướp chuyến tàu chở thư.", "eng": "The desperadoes who robbed the mail-train."}, {"viet": "Sự tháo nước từ bể chứa.", "eng": "The discharge of water from the reservoir."}, {"viet": "Bác sĩ đó đã vượt qua nhiều cạnh tranh để mở phòng mạch trong thành phố.", "eng": "The doctor had to surmount much competition, to establish his practice in the city."}, {"viet": "Con chó gầm gừ và nhe răng ra.", "eng": "The dog growled and showed its fangs."}, {"viet": "Các cống thoát nước bị tắc vì lá rụng.", "eng": "The drains are choked with dead leaves."}, {"viet": "Con đại bàng tóm lấy con mồi, siết chặt trong vuốt của nó.", "eng": "The eagle seized its prey in a tenacious grip."}, {"viet": "Yếu tố rủi ro làm cho cuộc phiêu lưu tăng thêm phần thích thú.", "eng": "The element of risk gave an added zest to the adventure."}, {"viet": "Sự dụ dỗ đứa bé vào trong xe ô tô.", "eng": "The enticement of a child into a car."}, {"viet": "Những đứa trẻ háo hức đã quên mang quà đến dự tiệc.", "eng": "The excited children forgot to take the presents to the party."}, {"viet": "Nhà máy ở Leeds hoặc một nơi nào gần đó.", "eng": "The factory is in Leeds or somewhere thereabouts."}, {"viet": "Sự sai sót đó sẽ tự chỉnh đốn lại nếu anh để cho nó có thời gian.", "eng": "The fault will right itself if you give it time."}, {"viet": "Cuốn phim này rất giống như ngoài đời.", "eng": "The film is very true to life."}, {"viet": "Hãng đó chỉ vừa đủ trang trải các chi phí, đã nhiều năm rồi hãng không làm ăn có lãi.", "eng": "The firm barely covers its costs, it hasn't made a profit for years."}, {"viet": "Sự nhìn thấy lần đầu tiên một ngôi sao mới.", "eng": "The first sighting of a new star."}, {"viet": "Thức ăn ở đây khá ngon.", "eng": "The food here is fairly good."}, {"viet": "Người Pháp nổi tiếng về nấu ăn.", "eng": "The French are renowned for their cooking."}, {"viet": "Khoảng cách giữa hai phía đã thu hẹp lại đáng kể.", "eng": "The gap between the two parties has narrowed considerably."}, {"viet": "Món quà đến là một sự ngạc nhiên hoàn toàn đối với tôi.", "eng": "The gift came as a complete surprise to me."}, {"viet": "Chính sách cứng rắn mới của chính phủ đối với tội phạm có chức.", "eng": "The government's new get-tough policy on organized crime."}, {"viet": "Chính phủ dự định dành thêm kinh phí cho mục đích giáo dục.", "eng": "The government intends to free more resources for educational purposes."}, {"viet": "Điều vị thống đốc tiết lộ đầy đủ cho công chúng chỉ làm cho thêm nhiều người đồng thanh phản đối.", "eng": "The governor's full public disclosure only swelled the chorus of protests."}, {"viet": "Đất thì lầy bùn, cô ấy điều hành cũng chưa được một tháng, tốc độ như vậy, xét về mọi mặt là tốt.", "eng": "The ground was muddy, and she hadn't run for a month, so her speed was really quite good, all things considered."}, {"viet": "Tay súng đó đã bắn thủng một lỗ trên cửa.", "eng": "The gunman shot a hole in the door."}, {"viet": "Gót giày của tôi cứ cọ vào gót chân.", "eng": "The heel of my shoe keeps rubbing."}, {"viet": "Con ngựa đã bị tận dụng hết mức trong cuộc leo núi lâu dài này.", "eng": "The horse was fully extended by the long ride up the mountain."}, {"viet": "Ngôi nhà bị biến đổi thành một trường học.", "eng": "The house has been made over into a school."}, {"viet": "Người thợ săn lần theo dấu chân con mồi.", "eng": "The hunter followed the animal's tracks."}, {"viet": "Những chức năng biện lý và thẩm phán không thể do một người kiêm nhiệm.", "eng": "The incompatible offices of prosecutor and judge."}, {"viet": "Công ty bảo hiểm đã thanh toán việc đòi bồi thường của bà ta.", "eng": "The insurance company has settled her claim."}, {"viet": "Công việc như vậy không lôi cuốn được anh ta.", "eng": "The job, as such, does not appeal to him."}, {"viet": "Hội đồng xét xử ra khỏi phòng xử án để cân nhắc về bản án.", "eng": "The jury retired from the courtroom to consider their verdict."}, {"viet": "Cái hồ này là nhân tạo, trước đây ở đó là một thung lũng.", "eng": "The lake is man-made, there used to be a valley here."}, {"viet": "Luật pháp đã qui định những hình phạt nặng cho sự vi phạm này.", "eng": "The law prescribed heavy penalties for this offence."}, {"viet": "Chữ trên bia mộ đã mòn nhiều và gần như không đọc được.", "eng": "The lettering on the gravestone was badly worn and almost illegible."}, {"viet": "Toà nhà Lloyds chẳng là cái gì cả mà chỉ là rất lạ.", "eng": "The Lloyds building is nothing if not unusual."}, {"viet": "Nghỉ ăn trưa kéo dài 45 phút.", "eng": "The lunch recess lasts forty five minutes."}, {"viet": "Người đàn ông ù té chạy khi anh ta trông thấy cảnh sát.", "eng": "The man broke into a run when he saw the police."}, {"viet": "Trận đấu đó là một chiến thang dễ dàng cho đội khách.", "eng": "The match was a walk-over for the visiting team."}, {"viet": "Cuộc họp bắt đấu đúng 3 giờ, đừng đến muộn.", "eng": "The meeting starts at 3 o'clock sharp, don't be late."}, {"viet": "Mỏ kim cương sâu đến nỗi ở dưới đó rất nóng.", "eng": "The mines are so deep that it is very hot in them."}, {"viet": "Tiền quyên góp được đó có thể được sử dụng hữu ích hơn về thiết bị mới.", "eng": "The money raised could more usefully be spent on new equipment."}, {"viet": "Cuộc triển lãm xe ô-tô thường được tổ chức vào tháng Mười.", "eng": "The Motor Show is usually held in October."}, {"viet": "Tên của những cơ quan chính phủ chỉ là những chữ đầu.", "eng": "The names of these government offices are just alphabet soup."}, {"viet": "Quyển từ điển mới đó đang bán chạy.", "eng": "The new dictionary is going well."}, {"viet": "Những qui định mới sẽ có lợi rất nhiều cho chúng ta.", "eng": "The new regulations will be of great benefit to us all."}, {"viet": "Số báo phát hành đã tăng gấp ba kể từ năm ngoái.", "eng": "The newspaper's circulation has trebled since last year."}, {"viet": "Bảng thông báo đó đọc là Buổi học bắt đầu lúc 9 giờ sáng.", "eng": "The notice read Skool starts at 9 am."}, {"viet": "Thời cơ đang thuận lợi cho bạn vì bạn có kinh nghiệm.", "eng": "The odds are in your favour because you have more experience."}, {"viet": "Ông già trồng rau ở mảnh đất sau nhà.", "eng": "The old man grew vegetables in his backyard."}, {"viet": "Số nghị sĩ thuộc đảng đối lập rất ít.", "eng": "The Opposition MPs are few in number."}, {"viet": "Sơn đó đã khô cứng lại trong hộp.", "eng": "The paint had solidified in the tin."}, {"viet": "Buổi tiệc là một thất vọng lớn.", "eng": "The party was a big let-down."}, {"viet": "Các bàn đạp của xe đạp được gắn với một tay quay.", "eng": "The pedals of a cycle are attached to a crank."}, {"viet": "Sự phi thường của việc họ lên nắm quyền nhanh chóng.", "eng": "The phenomenon of their rapid rise to power."}, {"viet": "Ống nước vỡ và các tia nước bắn ngang qua bếp.", "eng": "The pipe burst and jets of water shot across the kitchen."}, {"viet": "Các họa đồ về dự án phát triển mới được trưng bày ở tòa thị sảnh.", "eng": "The plans of the new development are on show at the Town Hall."}, {"viet": "Những cành dễ uốn của cây non.", "eng": "The pliant branches of young trees."}, {"viet": "Cuối cùng cảnh sát đã moi được thông tin sau nhiều giờ tra hỏi.", "eng": "The police finally extracted the information after hours of questioning."}, {"viet": "Cảnh sát nghi ngờ đây là một hành động bạo lực sát nhân hơn là tự tử.", "eng": "The police suspect foul play rather than suicide."}, {"viet": "Những tờ báo phổ thông dường như chỉ chuyên về những chuyện tình dục và ma tuý.", "eng": "The popular newspapers seem to be fixated on stories about sex and drugs."}, {"viet": "Việc chuẩn bị các bữa ăn là công việc của bà.", "eng": "The preparation of the meals is your job."}, {"viet": "Đoàn chủ tịch Xô viết tối cao.", "eng": "The presidium of the Supreme Soviet."}, {"viet": "Ông thủ tướng ấy đã bị đối thủ lật đổ và thay thế.", "eng": "The Prime Minister was supplanted by his rival."}, {"viet": "Những vấn đề chính phủ phải đương đầu rất đa dạng.", "eng": "The problems facing the government are manifold."}, {"viet": "Những đề nghị đó hiện vẫn còn đang được xem xét.", "eng": "The proposals are still under consideration."}, {"viet": "Bộ phận đóng cửa xe điện ngầm.", "eng": "The push-back on a subway door."}, {"viet": "Đường nét vách đá gồ ghề.", "eng": "The ragged profile of the cliffs."}, {"viet": "Sự bất đồng mới đây chứng tỏ rõ rệt sự khác biệt giữa hai bên.", "eng": "The recent disagreement points up the differences between the two sides."}, {"viet": "Cuối cùng thì câu trả lời là không.", "eng": "The reply when it finally came, was in the negative."}, {"viet": "Lời đốp chát lại dấy lên một sự cổ vũ cho diễn giả.", "eng": "The retort raised a cheer in support of the speaker."}, {"viet": "Dòng sông chảy xiết hơn sau cơn bão.", "eng": "The river was a torrent after the storm."}, {"viet": "Căn phòng trở nên lạnh hơn vì lửa lụi dần.", "eng": "The room grew colder as the fire burn down."}, {"viet": "Sự đứt một mạch máu, vỡ vỏ hạt, thủng màng.", "eng": "The rupture of a blood-vessel, seed-pod, membrane."}, {"viet": "Cảnh trong bệnh viện rất là cảm động.", "eng": "The scene in the hospital was very moving."}, {"viet": "Sóng biển vỗ vào chân vách đá.", "eng": "The sea washes the base of the cliffs."}, {"viet": "Người hầu gái sưng mặt sau khi bị bà chủ mắng.", "eng": "The servant was sullen after the mistress scolded her."}, {"viet": "Con tàu chấn động khi va vào đá.", "eng": "The ship shuddered as it hit the rocks."}, {"viet": "Cuộc trình diễn là một sự pha tạp gồm hát và múa.", "eng": "The show was a miscellany of song and dance."}, {"viet": "Tình hình ở đấy đòi hỏi tôi phải có mặt.", "eng": "The situation requires that I should be present."}, {"viet": "Sinh hoạt xã hội của ngôi làng này xoay quanh các câu lạc bộ thể thao địa phương.", "eng": "The social life of the village centres round the local sports club."}, {"viet": "Tiếng cười vang vui vẻ gợi lại những kỷ niệm thời thơ ấu của anh ta.", "eng": "The sound of happy laughter called up memories of his childhood."}, {"viet": "Mùa xuân năm nay thật xấu trời,-rét và ẩm ướt hàng tuần.", "eng": "The spring was foul this year-it was cold and wet for weeks."}, {"viet": "Tính cách đã được chuẩn hoá một anh hùng là một người cao, khoẻ, dũng cảm và đẹp trai.", "eng": "The stereotype of a hero is one who tall, strong, brave and good-looking."}, {"viet": "Cuộc đình công sẽ gây ra một số trục trặc trong giao thông đường sắt.", "eng": "The strike will cause some dislocation of rail traffic."}, {"viet": "Cuối cùng mặt trời cũng ló ra vào buổi chiều.", "eng": "The sun broke through at last in the afternoon."}, {"viet": "Công việc được hoàn thành trong một thời gian ít hơn cho phép.", "eng": "The task was accomplished in less than the time allowed."}, {"viet": "Các cổ động viên của đội đã hô vang những lời ca chiến thắng.", "eng": "The team's supporters sang a victory chant."}, {"viet": "Nhà hát đã phải đóng cửa vì thiếu người ủng hộ.", "eng": "The theatre has had to close for lack of support."}, {"viet": "Chiếc áo choàng chật chỉ làm rõ thêm cái bụng phệ của ông ta.", "eng": "The tight jumper only accentuated his fat stomach."}, {"viet": "Thành phố bị quân xâm lược cướp bóc.", "eng": "The town was pillaged by the invading army."}, {"viet": "Hàng cây hắt những bóng dài trên vạt cỏ.", "eng": "The trees threw long shadows across the lawn."}, {"viet": "Hai nhóm người hâm mộ phải được bố trí cách xa nhau ở sân vận động.", "eng": "The two groups of fans must be segregated in the stadium."}, {"viet": "Đoàn là cánh tay đắc lực của Đảng.", "eng": "The union is a special arm of the party."}, {"viet": "Các mẫu động từ được trình bày trong cuốn từ điển này bằng những mã giúp cho trí nhớ.", "eng": "The verb patterns are shown in this dictionary by mnemonic codes."}, {"viet": "Bức tường đã bị bắn lỗ chỗ đầy vết đạn.", "eng": "The wall had been peppered with bullets."}, {"viet": "Nhân viên dự báo thời tiết nói rằng trời sẽ nóng.", "eng": "The weatherman said it would be hot."}, {"viet": "Gió đã dồn tuyết thành một cái ụ cao, làm tắc đường.", "eng": "The wind drifted the snow into a high bank, blocking the road."}, {"viet": "Từ ướt là trái nghĩa của từ khô.", "eng": "The word wet is an antonym of the word dry."}, {"viet": "Nữ nghệ sĩ trẻ đó rất khiêm tốn về sự thành công của mình, cô ấy nói nó vừa kết quả của sự may mắn cũng như của tài năng của cô ấy.", "eng": "The young actress is very modest about her success, she says it's as much the result of good luck as of her own talent."}, {"viet": "Những vấn đề tài chính của họ hiện nay là điều mọi người đều biết.", "eng": "Their financial problems are public property now."}, {"viet": "Tình thế của họ bây giờ đã đảo ngược vì người làm công đã trở thành ông chủ.", "eng": "Their situations are now reversed as employee has become employer."}, {"viet": "Vậy thì ý tưởng ngân hàng trung ương được bắt đầu khi nào?", "eng": "Then when did the idea of central banks get started?"}, {"viet": "Trong văn phòng này có sự nhất trí không hút thuốc lá.", "eng": "There's a taboo on smoking in this office."}, {"viet": "Sau khi trừ đi các khoản vào tiền lương, chẳng còn lại bao nhiêu tiền.", "eng": "There's not much money left after stoppages."}, {"viet": "Có tám con ngựa chạy trong cuộc đua cuối cùng.", "eng": "There are eight runners in the final race."}, {"viet": "Có sáu lớp được tổ chức theo tuổi.", "eng": "There are six classes organized according to age."}, {"viet": "Số tàu thuyền qua lại trên kênh đã tăng lên.", "eng": "There has been an increase in navigation through the canal."}, {"viet": "Có một nhà vệ sinh công cộng ở góc phố.", "eng": "There is a public convenience on the corner of the street."}, {"viet": "Máy này chẳng gặp rắc rối gì hết.", "eng": "There is nothing the matter with the machine."}, {"viet": "Có sự xung đột về các quyết định giữa các thành viên của uỷ ban.", "eng": "There was a clash of wills among committee members."}, {"viet": "Có dấu hiệu buồn trông thấy trong giọng nói của nó.", "eng": "There was more than a hint of sadness in his voice."}, {"viet": "Có quá nhiều lỗi chính tả, tôi phải viết lại bức thư từ đầu.", "eng": "There were so many spelling mistakes, I had to write the letter out again from scratch."}, {"viet": "Các thứ tinh thể này trông như có người nào đó gọt cắt thành hình dạng.", "eng": "These crystals look as if someone had cut them into their shapes."}, {"viet": "Những cây thông và cây bách này hàng trăm năm tuổi rồi đấy.", "eng": "These pines and cypresses are hundreds of years old."}, {"viet": "Họ đã mời chúng tôi về thăm nhà riêng của họ ở thôn quê vào cuối tuần.", "eng": "They're invited us down to their country cottage for the weekend."}, {"viet": "Tất cả họ đều sống ở vùng phụ cận Li-vơ-pun.", "eng": "They all lived in the environs of Liverpool."}, {"viet": "Họ rất nghiêm khắc với con cái.", "eng": "They are very strict with their children."}, {"viet": "Họ tuyên bố là đã khám phá ra một cách chữa trị cho căn bệnh đó nhưng điều này còn chưa được chứng minh.", "eng": "They claimed to have claim that they have discovered a cure for the disease, but this has not yet been proved."}, {"viet": "Họ không sống ở ngôi nhà này, họ sống ở trong ngôi nhà đằng kia.", "eng": "They don't live in this house, they live in that one over there."}, {"viet": "Chúng lớn nhanh đến nỗi vượt quá lốt da của chúng.", "eng": "They grow so fast that they actually grow out of their kins."}, {"viet": "Họ đã không qua lại với nhau 10 năm.", "eng": "They haven't been on speaking terms for ten years."}, {"viet": "Mỗi bản bán được, họ lãi mười penni.", "eng": "They make a profit of ten pence on every copy they sell."}, {"viet": "Họ cướp đoạt các cung điện của kẻ thống trị La Mã.", "eng": "They plundered the palaces of the rulers of Rome."}, {"viet": "Người ta nói rằng lời mỉa mai là hình thức thấp nhất của sự hài hước.", "eng": "They say that sarcasm is the lowest form of humor."}, {"viet": "Họ trao đổi với nhau những chuyện về thời họ còn ở trong quân đội.", "eng": "They swapped stories about their army days."}, {"viet": "Họ bị kết tội âm mưu đặt kế hoạch chống lại nhà vua.", "eng": "They were accused of being privy to the plot against the King."}, {"viet": "Lúc đầu họ do dự nhưng dần dần chúng tôi thuyết phục họ kí hiệp ước.", "eng": "They were reluctant at first, but we managed to jockey them into signing the agreement."}, {"viet": "Nghĩ ra một mưu mẹo để vào được rạp chiếu bóng mà không phải trả tiền.", "eng": "Think up a ruse for getting into the cinema without paying."}, {"viet": "Sự cứu tế này nhằm giúp cho người ta tự giúp nhau.", "eng": "This charity aims to help people to help themselves."}, {"viet": "Thuốc này cấm dùng khi có thai.", "eng": "This drug is contraindicated in pregnancy."}, {"viet": "Đây là một nước tự do, tôi có thể nói bất cứ gì tôi muốn.", "eng": "This is a free country-I can say what I like."}, {"viet": "Đây là lần thứ hai tôi gặp anh ấy.", "eng": "This is the second time I have met him."}, {"viet": "Tất nhiên tháng này có 31 ngày.", "eng": "This month, of course, was given 31 days."}, {"viet": "Điểm này đã được bàn đến trong đoạn trước.", "eng": "This point has been dealt with in the preceding paragraph."}, {"viet": "Loại công việc làm ăn này chỉ có thể giao dịch riêng tư.", "eng": "This sort of business can only be transacted in private."}, {"viet": "Chúng tôi cầu xin nhân danh con trai của người Jesus Christ, Amen.", "eng": "This we ask in the name of Thy son Jesus Christh, Amen."}, {"viet": "Hàng ngàn người bị đội quân xâm lăng tàn sát.", "eng": "Thousands slaughtered by the invading army."}, {"viet": "Theo dự báo thời tiết, ngày mai sẽ đẹp trời.", "eng": "Tomorrow is going to be fine according to the forecast."}, {"viet": "Nếu tôi không theo dõi anh ta cẩn thận, anh ta sẽ phạm mọi thứ lỗi lầm.", "eng": "Unless I stand over him, he makes all sorts of mistakes."}, {"viet": "Rửa, sắp sửa, lau khô, dọn dẹp, v. v. bát đĩa.", "eng": "Wash, do, dry, put away, etc the dishes."}, {"viet": "Chúng ta sẽ phải đành chịu không có ti-vi cho đến khi ấy.", "eng": "We'll have to manage without a TV until then."}, {"viet": "Chúng tôi hy vọng đi nghỉ đâu vài ngày vào dịp lễ Phục Sinh.", "eng": "We're hoping to get away for a few days at Easter."}, {"viet": "Chúng tôi đã đạt nhiều tiến bộ ngay từ những ngày đầu của dự án.", "eng": "We've come a long way since those early days of the project."}, {"viet": "Chúng tôi hẹn gặp nhau lúc 7 giờ nhưng tôi đến sớm, tôi đến lúc sáu rưỡi.", "eng": "We agreed to meet at seven o'clock but I was early, I arrived at half past six."}, {"viet": "Chúng tôi sẽ gặp ban giám đốc ngày mai.", "eng": "We are meeting the management tomorrow."}, {"viet": "Chúng tôi chuẩn bị tinh thần cho cuộc hạ cánh trên vùng đất gồ ghề.", "eng": "We braced ourselves for a bumpy landing."}, {"viet": "Chúng ta có thể qui các phân số ra thành cùng một hạng, thí dụ 1/2, 5/8 = 8/16, 10/16.", "eng": "We can reduce fractions to the same denomination, eg 1/2, 5/8 = 8/16, 10/16."}, {"viet": "Chúng tôi quyết định cùng nhau đi gặp ông chủ, có đông người cũng yên tâm hơn.", "eng": "We decided to go to see the boss together, there's safety in numbers."}, {"viet": "Chúng tôi đã khảo sát kỹ một số giải pháp cho vấn đề này.", "eng": "We explored several solutions to the problem."}, {"viet": "Chúng tôi dùng cà phê và bánh xăng-đuýt ở snach ba.", "eng": "We had coffee and sandwiches at the snack-bar."}, {"viet": "Chúng tôi có Chivas Regal, Old Par và Suntory Royal.", "eng": "We have Chivas Regal, Old Par and Suntory Royal."}, {"viet": "Chúng tôi không có đủ tài liệu để xử lý yêu cầu của ông.", "eng": "We haven't enough documentation to process your claim."}, {"viet": "Chúng tôi sống ở tầng ba.", "eng": "We live on third floor."}, {"viet": "Chúng ta phải phối hợp cố gắng để giúp đỡ các nạn nhân lũ lụt.", "eng": "We must co-ordinate our efforts to help the flood victims."}, {"viet": "Chúng ta cần có thêm thông tin phản hồi từ phía người tiêu dùng để cải tiến hàng hoá.", "eng": "We need more feedback from the consumer in order to improve our goods."}, {"viet": "Chúng ta đang ở trong một xứ sở thần tiên, phải vậy không?", "eng": "We're in a wonderland, aren't we?"}, {"viet": "Chúng tôi sẽ không bán ngôi nhà của chúng tôi dưới 50000 pao.", "eng": "We shan't let our house go for less than 50000 pounds."}, {"viet": "Chúng tôi đã có quyết định khó khăn là ra đi.", "eng": "We took the difficult decision to leave."}, {"viet": "Chúng tôi sắp sửa khởi hành thì trời mưa.", "eng": "We were about to start, when it rained."}, {"viet": "Chúng tôi túng quá không mua được quần áo mới.", "eng": "We were too hard up to afford new clothes."}, {"viet": "Lèn chặt vật liệu đệm vào các chỗ trống chung quanh chiếc lọ.", "eng": "Wedge packing material into the spaces round the vase."}, {"viet": "À, đến giờ thức dậy rồi đây.", "eng": "Well, it's time to get up now."}, {"viet": "Thấm thêm một chút nước vào cục đất sét trước khi anh bắt đầu nặn.", "eng": "Wet the clay a bit more before you start to mould it."}, {"viet": "Các cậu con trai và các cô gái được hình thành từ chất liệu gì?", "eng": "What are boys and girls made of?"}, {"viet": "Cô sẽ gửi loại tiền gì?", "eng": "What currency are you going to send?"}, {"viet": "Thức ăn nào nổi tiếng ở Nhật Bản vì có lợi cho sức khỏe?", "eng": "What food is famous in Japan for being healthy?"}, {"viet": "Rạp xinê địa phương sẽ chiếu phim gì tuần này?", "eng": "What is the local theater showing this week?"}, {"viet": "Trường trung học của bạn đã có những đội thể thao nào?", "eng": "What kind of sports teams did your high school have?"}, {"viet": "Tôi phải làm gì để nhờ chuyển tiền từ đây đến Luôn Đôn?", "eng": "What should I do to have money transferred to me here from London?"}, {"viet": "Bất cứ anh ta làm điều gì anh ta đều làm theo lệnh của cha.", "eng": "Whatever hw did he did at the bidding of his father."}, {"viet": "Nó nói nó không bao giờ muốn gặp lại cậu nữa, mình tin chắc là ý nó không muốn nói đúng như vậy.", "eng": "When he said he never wanted to see you again I'm sure he didn't mean it literally."}, {"viet": "Khi cha mẹ tôi mất, tôi đã phải xoay xở một cách khó khăn.", "eng": "When my parents died, I had to shift for myself difficultly."}, {"viet": "Khi nửa đêm không thấy họ về, tôi đã có linh cảm chẳng lành.", "eng": "When they didn't get back by midnight, I got that sinking feeling."}, {"viet": "Chúng ta sẽ tổ chức buổi tiệc tất niên ở đâu?", "eng": "Where are we going to have the end of the year party?"}, {"viet": "Chúng ta có thắng được hay không còn là điều đáng nghi ngờ.", "eng": "Whether we shall win is open to question."}, {"viet": "Tôi phải đi xe điện ngầm nào để đến Manhattan?", "eng": "Which subway should I take to get to Mahattan?"}, {"viet": "Ai đã quên sắp xếp thư từ của ngày hôm nay vậy?", "eng": "Who forgot to file today's correspondence?"}, {"viet": "Tại sao anh không mua bánh mì Xin lỗi, tôi quên'.", "eng": "Why didn't you buy any bread Sorry, I forgot'."}, {"viet": "Sao bạn lại muốn giàu, hả Fred?", "eng": "Why would you like to be rich, Fred?"}, {"viet": "Em vui lòng làm một ít bánh quy mới nhé?", "eng": "Will you make some fresh biscuits?"}, {"viet": "Với Giáng sinh sắp đến, mấy đứa trẻ mong ngóng chờ đợi.", "eng": "With Christmas coming, the children were on tiptoe."}, {"viet": "Làm việc với sức mạnh và nhiệt tình đã được đổi mới.", "eng": "Work with renewed vigour and enthusiasm."}, {"viet": "Anh có dùng thêm không, Thôi, cám ơn anh.", "eng": "Would you like some more, Not for me, thank you."}, {"viet": "Xin ông bà vui lòng xem qua?", "eng": "Would you please have a look at it?"}, {"viet": "Vâng, vui lòng mang 2 tách cà phê đến phòng chúng tôi nhé.", "eng": "Yes, and please send two cups of coffee to our room."}, {"viet": "Vâng, còn một vé ở toa số.", "eng": "Yes, there's one available in Coach."}, {"viet": "Anh sẽ bị ướt nếu anh đi ra mưa mà không có ô.", "eng": "You'll get wet if you go out in the rain without an umbrella."}, {"viet": "Anh chẳng lắng nghe điều tôi đang nói!", "eng": "You're not listening to what I'm saying!"}, {"viet": "Anh được tự do đi lại theo ý muốn.", "eng": "You are free to come and go as you please."}, {"viet": "Cậu không thể nào mà đem theo hết tất cả số hành lý đó đâu.", "eng": "You can't possibly take all that luggage with you."}, {"viet": "Cậu có thể thường xuyên kiếm được những mẩu đồ gỗ cũ xinh xinh trong thùng chứa vật phế thải.", "eng": "You can often scavenge nice bits of old furniture from skips."}, {"viet": "Lần trước mày đã thoát nhưng đừng có trông cậy vào sự may mắn nữa.", "eng": "You didn't get caught last time, but don't push your luck."}, {"viet": "Anh có thể lựa chọn giữa hai cách: hoặc lấy vợ, hoặc sống độc thân như cũ.", "eng": "You have the alternative of marrying or remaining a bachelor."}, {"viet": "Trông anh rầu rĩ quá, tôi vừa mất tất cả tiền.", "eng": "You look very glum, I've just lost all my money."}, {"viet": "Phải xét người qua hành động của họ, chứ không phải qua lời nói.", "eng": "You must judge a person by his actions, not by what he says."}, {"viet": "Anh nên trau dồi thêm tiếng Anh trước khi đi làm việc ở Mỹ.", "eng": "You ought to improve your English before going to work in America."}, {"viet": "Bạn phải đọc báo để nắm vững thời sự.", "eng": "You should read the newspapers to keep abreast of current affairs."}, {"viet": "Anh đắp miếng băng này lên cánh tay và thuốc sẽ ngấm vào da.", "eng": "You wear this patch on your arm and the drug is absorbed through the skin."}, {"viet": "Các thiếu nữ thường phải học cách đi đứng.", "eng": "Young ladies used to have lessons in deportment."}, {"viet": "Cái ô tô mới của anh là một sản phẩm xinh xắn gọn gàng, có phải không?", "eng": "Your new car is a neat little job, isn't it?"}]