[{"viet": "Một con ong đốt vào má tôi.", "eng": "A bee stung me on the cheek."}, {"viet": "Một chiếc ghế được xếp lại để dễ cất.", "eng": "A chair that collapses for easy storage."}, {"viet": "Cây kim la bàn chỉ về hướng Bắc.", "eng": "A compass needle points to the north."}, {"viet": "Màn mưa bao phủ thung lũng.", "eng": "A curtain of rain swept over the valley."}, {"viet": "Một vị bác sĩ có mức thâm niên cao hơn đồng nghiệp của ông ta năm năm.", "eng": "A doctor with five years seniority over his colleague."}, {"viet": "Một vài phút yên lặng giữa trưa để ngồi suy tư.", "eng": "A few quiet minutes in the middle of the day to sit and contemplate."}, {"viet": "Một quả trứng rán và vài lát mỏng giăm-bông cho bữa ăn sáng.", "eng": "A fried egg and a couple of rashers of bacon for breakfast."}, {"viet": "Lời hứa của chính phủ cắt giảm mạnh các loại thuế.", "eng": "A government promise to slash taxes."}, {"viet": "Người giúp việc đến hai tuần mỗi lần để lau chùi nhà cửa.", "eng": "A help comes in twice a week to clean the house."}, {"viet": "Một công việc có nhiều cơ hội để phát huy mọi khả năng của mình.", "eng": "A job with a lot of scope for self-fulfillment."}, {"viet": "Một người nào đó đã trở thành huyền thoại ngay khi còn sống.", "eng": "A legend in one's own life time."}, {"viet": "Bao nhiêu thứ phải nghĩ tới, phải hoạch định và phải tiên liệu.", "eng": "A lot to think about and strategies about and anticipate."}, {"viet": "Một bữa ăn có lẽ không thể làm chúng tôi cảm thấy no thực sự, trừ phi nó để lại một lớp hạt mỡ trong miệng và dạ dày của chúng tôi.", "eng": "A meal couldn't leave us feeling really full unless it laid down a rime of fat globules in our mouths and stomach."}, {"viet": "Một người lạ trông bí ẩn đã đến thành phố.", "eng": "A mysterious stranger came to the town."}, {"viet": "Một nhóm quân được biệt phái làm nhiệm vụ canh gác cánh phải.", "eng": "A number of men were detached to guard the right flank."}, {"viet": "Một người đứng dưới ánh sáng ngọn đèn hơi thủy ngân, trông rất bệnh hoạn.", "eng": "A person looks very unhealthy in the light of a mercury vapor lamp."}, {"viet": "Một văn phòng chính trị ở khu mặt tiền.", "eng": "A political office in a storefront."}, {"viet": "Một đề nghị hợp nhất hai hãng.", "eng": "A proposition to merge the two firms."}, {"viet": "Một nhà hàng ăn uống có cách nấu ăn tuyệt diệu.", "eng": "A restaurant where the cuisine is excellent."}, {"viet": "Một khăn quàng cổ bằng một miếng lụa xanh hình tam giác.", "eng": "A scarf made of a triangle of blue silk."}, {"viet": "Một cửa tiệm có rất nhiều sách bìa giấy để chọn.", "eng": "A shop with a huge selection of paperbacks."}, {"viet": "Một chiếc đi-văng có thể đổi thành giường nằm.", "eng": "A sofa that is convertible into a bed."}, {"viet": "Một bản nhạc trong phim của William Walton làm cảm động.", "eng": "A stirring film score by William Walton."}, {"viet": "Một dấu vết bệnh điên trong gia đình đó.", "eng": "A taint of insanity in the family."}, {"viet": "Xe lửa hụ còi ở đằng xa.", "eng": "A train whistled in the distance."}, {"viet": "Một sự tiếp đón niềm nở lúc nào cũng chờ sẵn tất cả các khách hàng của chúng tôi.", "eng": "A warm welcome awaits all our customers."}, {"viet": "Người trẻ tuổi luôn được giới thiệu với người lớn tuổi hơn.", "eng": "A young person is always introduced to an older person."}, {"viet": "Thật ra tôi nghĩ anh ấy rất vui tính khi giao tiếp với mọi người đấy.", "eng": "Actually, I think he is lots of fun to be around."}, {"viet": "Sau khi mở đầu chậm chạp, vở kịch chuyển khá nhanh sang màn hai.", "eng": "After a slow beginning, the play fairly zips along in the second act."}, {"viet": "Sau khi đã tự tìm hiểu nhiều họ quyết định chia tay nhau.", "eng": "After much heart-searching they decided to separate."}, {"viet": "Sau khi lên tới 143, giá cổ phần lại hạ xuống 108 trước lúc đóng cửa.", "eng": "After touching 143, the price feel back to 108 by the close of trading."}, {"viet": "Tất cả mọi hy vọng của nó tiêu tan trước tin khủng khiếp đó.", "eng": "All his hopes dissolved at the terrible news."}, {"viet": "Tất cả các nữ sinh đều mê ông thầy dạy toán mới.", "eng": "All the girls are swooning over the new maths teacher."}, {"viet": "Mặc dầu tôi đã rót thật cẩn thận, tôi vẫn làm đổ ra ngoài một ít dầu.", "eng": "Although I poured it carefully, I spilt some of the oil."}, {"viet": "Một diễn viên đeo mặt nạ bi kịch.", "eng": "An actor wearing the mask of tragedy."}, {"viet": "Một phần thưởng để công nhận các công tác của ai.", "eng": "An award in recognition of one's services."}, {"viet": "Một chữ khắc khó đọc trên cột cửa.", "eng": "An illegible inscription carved on the door post."}, {"viet": "Một phụ nữ lớn tuổi hơn đã khai tâm cho anh ta về những bí ẩn của tình yêu.", "eng": "An older woman who had initiated him into the mysteries of love."}, {"viet": "Sao, hôm nay ta cảm thấy thế nào?", "eng": "And how are we feeling today?"}, {"viet": "Một tên gọi khác cho đồ sứ là porcelain.", "eng": "Another name china is porcelain."}, {"viet": "Tiếp cận vấn đề từ một khía cạnh khác.", "eng": "Approach the problem from a different side."}, {"viet": "Tối nay bạn có rảnh để đi ăn tối không?", "eng": "Are you available for dinner tonight?"}, {"viet": "Ông có chắc là ông đang dùng đúng số mật không?", "eng": "Are you sure you're using the correct secret number?"}, {"viet": "Bằng một phương cách tạm bợ, ông ta đã lấy bao ny-lông bịt chỗ bị rò rỉ.", "eng": "As a temporary shift, he covered up the leak with a plastic bag."}, {"viet": "Khi con lắc trong đồng hồ lắc qua lắc lại, nó làm di động một cánh tay điều khiển sự khởi động và sự dừng lại khiến cho các bánh xe quay đúng vận tốc.", "eng": "As the pendulum in the clock swings back and forth, it moves an arm which does the starting and stopping that make the wheels turn at the right speed."}, {"viet": "Lúc đầu, người ta dùng nhựa của cây vân sam đen.", "eng": "At first the gum from black spruce trees was used."}, {"viet": "Mọi nỗ lực đang được thực hiện để chặn lại sự lan tràn của căn bệnh.", "eng": "Attempts are being made to arrest the spread of the disease."}, {"viet": "Đan rổ rá là một nghề đang tàn.", "eng": "Basket weaving is a dying trade."}, {"viet": "Hãy sẵn sàng đối phó với mọi bất trắc có thể xảy ra.", "eng": "Be prepared for all possible contingencies."}, {"viet": "Trước khi làm việc đó, chúng ta phải đổi tiền yên sang đồng đô la đã.", "eng": "Before we do that, we have to change yen to dollars."}, {"viet": "Chim xây tổ bằng những cành cây.", "eng": "Birds build their nest out of twigs."}, {"viet": "Khui ra dùng những lương thực dự trữ cho lúc cần kíp.", "eng": "Break into emergency supplies of food."}, {"viet": "Các vị quan có lẽ thấy được điều này hạn chế quyền lực của mình và sẽ hết sức chống lại nó.", "eng": "Bureaucrats would correctly see this as a curb on their power and would fight tooth and nail against it."}, {"viet": "Nhưng nó vẫn chưa được dọn ra.", "eng": "But it hasn't come yet."}, {"viet": "Những người bán thịt đã cung ứng thịt cho các gia đình hoàng tộc trong nhiều thế hệ.", "eng": "Butchers who have purveyed meat to the royal household for generations."}, {"viet": "À này, nhà hàng Ý ở đâu trong khách sạn này?", "eng": "By the way, where is the Italian restaurant at the hotel?"}, {"viet": "Anh có thể để công việc sắp xếp những cái bàn cho em được chứ?", "eng": "Can I leave the arrangement of the tables to you?"}, {"viet": "Anh có cảm thấy được không khí căng thẳng trong phòng này không?", "eng": "Can you feel the tension in this room?"}, {"viet": "Em có thể thấy con chó trong tranh không?", "eng": "Can you see the dog in the picture?"}, {"viet": "Sự nghiên cứu kỹ lưỡng thị trường là điều kiện tiên quyết để thành công.", "eng": "Careful study of the market is a prerequisite for success."}, {"viet": "Những hóa chất tan ra trong một dung dịch nước.", "eng": "Chemicals dissolved in an aqueous solution."}, {"viet": "Các công chức được yêu cầu ký tên vào Đạo Luật Bảo Mật.", "eng": "Civil Servants are required to sign the Official Secrets Act."}, {"viet": "Lại đây ngay, đồ khỉ con!", "eng": "Come here at once, you little monkey!"}, {"viet": "Đánh dấu những nơi đậu xe không được dùng.", "eng": "Cone off parking spaces that must not be used."}, {"viet": "Tôi có thể hỏi cô vài câu được không?", "eng": "Could I ask you some questions?"}, {"viet": "Bạn có thể cho máy chạy một lúc được không?", "eng": "Could you run the engine for a moment?"}, {"viet": "Về mặt văn hóa nước Nhật là con cháu của nền văn minh Trung Quốc.", "eng": "Culturally Japan is a daughter of Chinese civilization."}, {"viet": "Tuyên bố một nơi là khu vực bị thiên tai.", "eng": "Declare a place a disaster area."}, {"viet": "Dẫu mất việc ông ấy vẫn có hưu bổng của mình.", "eng": "Despite losing his job he retains his pension."}, {"viet": "Anh được đắp hơi gây tê hay tiêm thuốc tê vào?", "eng": "Did you have gas or an injection?"}, {"viet": "Thảo luận các kế hoạch về công ty liên quan đến khả năng hợp nhất.", "eng": "Discuss plans for the company vis-à-vis a possible merger."}, {"viet": "Làm việc gì vì lợi ích của gia đình mình.", "eng": "Do something for the sake of one's family."}, {"viet": "Bạn có thích làm việc cùng các đồng nghiệp của bạn không?", "eng": "Do you enjoy working with your co-workers?"}, {"viet": "Cô có thứ gì để trẻ con có thể chơi được không?", "eng": "Do you have anything that children can play with?"}, {"viet": "Ông có thích loại trà này không ạ?", "eng": "Do you like this type of tea?"}, {"viet": "Bạn có đặt mua dài hạn báo hay tạp chí nào không?", "eng": "Do you subscribe to any newspapers or magazines?"}, {"viet": "Bố có muốn ăn thử ở đó không?", "eng": "Do you want to give it a try?"}, {"viet": "Nhà bạn có tấm đệm lót sàn không?", "eng": "Does your house have tatami mats?"}, {"viet": "Đừng có lạc đề khi lên thuyết trình nhé.", "eng": "Don't digress from the subject when lecturing."}, {"viet": "Đừng để những lời phê bình của hắn quấy rối bạn.", "eng": "Don't let his criticisms bother you."}, {"viet": "Đừng ngừng lại khi đang băng ngang qua ngã tư.", "eng": "Don't stop while crossing the intersection."}, {"viet": "Bạn không nghĩ như vậy là đẹp sao?", "eng": "Don't you think it's cool?"}, {"viet": "Ở tuổi dậy thì, thanh thiếu niên trở nên quan tâm nhiều hơn tới tình dục.", "eng": "During puberty, young people become more interested in sex."}, {"viet": "Voi có thời kỳ thai nghén khoảng 624 ngày.", "eng": "Elephants have a gestation period of about 624 days."}, {"viet": "Ngay cả sau khi ông ấy giải thích tôi cũng không biết gì hơn.", "eng": "Even after listening to his explanation I'm none the wiser."}, {"viet": "Tình hình tại thủ đô bây giờ yên tĩnh.", "eng": "Everything in the capital is now quiet."}, {"viet": "Bị trục xuất vì tình nghi làm gián điệp cho địch.", "eng": "Expatriated on suspicion of spying for the enemy."}, {"viet": "Nông dân chỉ tạo thành một nhóm nhỏ của dân cư.", "eng": "Farm workers made up only a small section of the population."}, {"viet": "Chống lại cảm giác mệt mỏi.", "eng": "Fight off a feeling of tiredness."}, {"viet": "Nối ghép những mảnh của bộ mô hình với nhau.", "eng": "Fit the pieces of a model kit together."}, {"viet": "Tôi thoáng nghĩ là chiếc xe ôtô sắp đụng đến nơi.", "eng": "For a fleeting moment I thought the car was going to crash."}, {"viet": "Tự cô ta cảm thấy mình không phải là ở tòa nhà nghị viện tiểu bang mà bị đày qua Sở Đăng Ký Xe-nơi hẻo lánh của chính phủ tiểu bang.", "eng": "Found herself not at the State House but exiled to the Registry of Motor Vehicles-the Siberia of state government."}, {"viet": "Giành được một chiến thắng trước đối thủ.", "eng": "Gain a victory over one's rivals."}, {"viet": "Hãy sắp xếp căn nhà này cho ngăn nắp trước khi khách tới.", "eng": "Get this house right-side up before any guests arrive."}, {"viet": "Xoắn sợi dây thừng thêm vài vòng nữa.", "eng": "Give the rope a few more twists."}, {"viet": "Dạ được, nhóm của ông sẽ có bao nhiêu người?", "eng": "Good, how many people will there be in your party?"}, {"viet": "Anh ta có nói gì để giải thích cho hành vi của mình không?", "eng": "Had he anything to say in explanation of his behaviour?"}, {"viet": "Tất cả quý vị đã nghe các ý tưởng đó chưa?", "eng": "Have all of you heard the ideas?"}, {"viet": "Bạn có bao giờ đến thăm bạn bè sống ở nước ngoài chưa?", "eng": "Have you ever gone to visit your friends who live in foreign countries?"}, {"viet": "Gần đây bạn có đọc cuốn sách nào hay không?", "eng": "Have you read any good books recently?"}, {"viet": "Hắn ta sẽ dùng đủ mọi phương sách để chặn cậu lại.", "eng": "He'll use any trick in the book to stop you."}, {"viet": "Anh ấy đủ sức để đương đầu với tất cả những nỗi bất hạnh của mình.", "eng": "He's bearing up well against all his misfortunes."}, {"viet": "Anh ta có cả chục bộ quần áo nhưng chẳng bộ nào là coi được cả.", "eng": "He's got dozens of suits but not one of them is presentable."}, {"viet": "Anh ấy chỉ vừa xẹt ra ngoài vài phút thôi.", "eng": "He's only popped out for a few minutes."}, {"viet": "Anh ấy rất nhút nhát và cần phải khuyến khích anh ta nói.", "eng": "He's very shy and needs to be drawn out."}, {"viet": "Ông ấy biện hộ cho việc tiếp tục cuộc tìm kiếm.", "eng": "He argued for a continuation of the search."}, {"viet": "Ông ấy mua bức tranh đó với thiện ý.", "eng": "He bought the painting in good faith."}, {"viet": "Anh ta không thể chịu nổi cứ bị phải chờ đợi.", "eng": "He can't stand being kept waiting."}, {"viet": "Anh ấy không thể che đậy nỗi lòng ghen tỵ với sự thành đạt của tôi.", "eng": "He couldn't conceal his envy at my success."}, {"viet": "Anh ta cũng chưa chịu hiểu.", "eng": "He didn't even begin to understand."}, {"viet": "Nó đã lái xe vượt đèn đỏ và một viên cảnh sát đã thấy nó.", "eng": "He drove through a red light and a policeman saw him."}, {"viet": "Ông ấy cảm thấy yêu cô ta mãnh liệt.", "eng": "He fell violently in love with her."}, {"viet": "Anh ta tặng nàng một hộp sôcôla làm một món quà giảng hòa.", "eng": "He gave her a box of chocolates as a peace offering."}, {"viet": "Anh ta không bị kết án và chỉ phải nộp một số tiền phạt nhỏ.", "eng": "He got off with a small fine."}, {"viet": "Anh ta bị nhiều vết thương, gồm cả ba chỗ gãy xương.", "eng": "He had several injuries, including three fractures."}, {"viet": "Ông ta có tài cường điệu về tầm quan trọng của mình.", "eng": "He has an exaggerated sense of his own importance."}, {"viet": "Anh ta thực sự có nhiều khát vọng đối với sự nghiệp chính trị.", "eng": "He has serious aspirations to a career in politics."}, {"viet": "Hắn qui cuộc hôn nhân đổ vỡ của mình cho những thiếu sót của vợ hắn.", "eng": "He imputed the failure of his marriage to his wife's shortcomings."}, {"viet": "Anh ta bị chụp mũ là một tên phản động.", "eng": "He is labelled as a reactionary."}, {"viet": "Ông ta đang viết một lịch sử về những cảnh ngược đãi mà giống nòi ông ta phải chịu đựng.", "eng": "He is writing a history of the persecutions endured by his race."}, {"viet": "Anh ta rời sớm cốt để có thể tới đúng giờ.", "eng": "He left early in order that he would arrive on time."}, {"viet": "Trông anh ấy có vẻ xấp xỉ 20 tuổi.", "eng": "He looks like he is roughly 20."}, {"viet": "Anh ta tính trò chuyện bông phèng nhưng giọng nói anh ta lại dở mới khổ chứ.", "eng": "He meant to be conversationally playful but his voice had no tone."}, {"viet": "Nó chỉ nghe được đoạn cuối vô ích trong cuộc nói chuyện của họ.", "eng": "He only heard the fag-end of their conversation."}, {"viet": "Nó thò đầu để chào tạm biệt.", "eng": "He popped his head round the door to say goodbye."}, {"viet": "Anh ta úp bài xuống bàn.", "eng": "He put the cards face down on the table."}, {"viet": "Nó khước từ sự giúp đỡ vì một ý thức tự trọng giả tạo.", "eng": "He refused to accept help out of a false sense of pride."}, {"viet": "Anh ta sao ra một trăm bản sao trên máy sao.", "eng": "He runs off a hundred copies on the duplicating machine."}, {"viet": "Ngay bây giờ ông đã rời khỏi bàn làm việc.", "eng": "He's away from his desk right now."}, {"viet": "Anh ta đã gia nhập đội ngũ các nhà kinh doanh, thường đội mũ quả dưa hoạt động tại thành phố.", "eng": "He's joined the bowler-hated brigade working in the City."}, {"viet": "Hắn ta là kẻ nói dối nhiều nhất mà tôi biết.", "eng": "He's the biggest liar I know."}, {"viet": "Anh ta nhìn thấy một loạt những mũi tên trắng vẽ trên đường.", "eng": "He saw a series of white arrows painted on the road."}, {"viet": "Ông ta đã chỉ trích nghiêm khắc những tác phẩm khiêu dâm.", "eng": "He severely criticised the pornographic work."}, {"viet": "Nó đã làm vướng rách chiếc áo ấm vào hàng rào dây thép.", "eng": "He snagged his sweater on the wire fence."}, {"viet": "Ông ta cho con gái mình bắt đầu vào ngành thương mại.", "eng": "He started his daughter up in the trade."}, {"viet": "Nó thành công nhờ chuyên tâm vào những sự nghiên cứu.", "eng": "He succeeds by application to his studies."}, {"viet": "Anh ta nghĩ rằng anh ta bị đối xử không công bằng.", "eng": "He thought he had been treated unfairly."}, {"viet": "Anh ta xé bức thư thành từng mảnh.", "eng": "He tore the letter to pieces."}, {"viet": "Anh ta mở đĩa và cho chúng tôi xem món ăn.", "eng": "He uncovered the disk and showed us the food."}, {"viet": "Ông ta muốn được hoả thiêu, chứ không muốn được chôn.", "eng": "He wants to be cremated, not buried."}, {"viet": "Anh ta cố công nhấn mạnh về sự diễn đạt khúc chiết những điều anh ta đã viết.", "eng": "He was at pains to insist on the perspicuity of what he wrote."}, {"viet": "Ông ta được thông báo chính thức là không đủ tư cách để được chấp nhận và buộc phải rời nước đó.", "eng": "He was declared persona non grata and forced to leave the country."}, {"viet": "Anh ta vui mừng lại được trở về nhà.", "eng": "He was glad to be home again."}, {"viet": "Trước đây cậu ấy chẳng bao giờ quan tâm đến công việc bếp núc, nhưng giờ thì cậu ta lại mê rồi.", "eng": "He was never interested in cooking before, but now he's been bitten by."}, {"viet": "Ông ta được bầu vào quốc hội với đa số giảm đi.", "eng": "He was returned to Parliament with a decreased majority."}, {"viet": "Anh ta là người duy nhất thẳng thắn phản đối việc đóng cửa bệnh viện đó.", "eng": "He was the only one to speak out against the closure of the hospital."}, {"viet": "Nó mặc quần áo thừa của anh nó.", "eng": "He wears his brother's cast-offs."}, {"viet": "Nó tỉnh dậy thấy mình có một mình trong căn nhà.", "eng": "He woke to find himself alone in the house."}, {"viet": "Anh ấy khao khát được về nhà với gia đình.", "eng": "He yearned for his home and family."}, {"viet": "Những hành động của cô ta là tiếng kêu cứu không thành lời.", "eng": "Her actions were an inarticulate cry for help."}, {"viet": "Đôi má cô ta có sắc tái bệnh hoạn.", "eng": "Her cheeks have a sickly pallor."}, {"viet": "Tiền lương giáo viên của bà ta tính tổng cộng là 8.500 bảng Anh mỗi năm.", "eng": "Her emoluments as a teacher amounted to £ 8,500 a year."}, {"viet": "Kiểu tóc và cách trang điểm của bà ta trông thật sự là kinh khủng!", "eng": "Her hair-do and make-up look positively ghastly!"}, {"viet": "Công việc của cô ấy có liên quan tới việc trông nom người già.", "eng": "Her job's to do with looking after old people."}, {"viet": "Tên bà ta đang được nhiều người bàn tán là sẽ trở thành vị chủ tịch tiếp sau.", "eng": "Her name is being bandied about as the next chairperson."}, {"viet": "Quyền lực của bà ta bị giới hạn bởi nhiều quy định.", "eng": "Her powers are circumscribed my many regulations."}, {"viet": "Tông màu da của cô ấy trông nhạt hơn tông màu da của Marry.", "eng": "Her skin tone is much lighter than Mary's."}, {"viet": "Cuộc thăm viếng Ấn Độ của bà ta chứng tỏ là một bước ngoặt trong cuộc đời bà ấy.", "eng": "Her visit to India proved to be a watershed in her life."}, {"viet": "Đến đây diễn giả ngừng một chút để nhấp uống.", "eng": "Here the speaker paused to have a drink."}, {"viet": "Sự khao khát của anh ta về việc làm phim kỳ dị, chẳng có kèm theo chút nghệ thuật nào.", "eng": "His appetite for kinky film making, unmitigated by any artistry."}, {"viet": "Tài năng kinh doanh của ông ấy bổ sung cho sự tinh nhạy của bà ta về kiểu mẫu.", "eng": "His business skill complements her flair for design."}, {"viet": "Cái chết của hắn mang lại cho câu chuyện đó một sự trái khoáy đầy khôi hài.", "eng": "His death gave an ironic twist to the story."}, {"viet": "Mặt anh ấy đầy sẹo sau tai nạn ô tô.", "eng": "His face was badly scarred after the car accident."}, {"viet": "Thói quen anh ta là thuộc loại ta ít gặp.", "eng": "His habits are such that we rarely meet."}, {"viet": "Sự phán đoán của ông ấy đã bị lệch lạc vì tư lợi.", "eng": "His judgment was warped by self-interest."}, {"viet": "Thi hài của ông ta được chôn cất trong nghĩa địa.", "eng": "His mortal remains are buried in the churchyard."}, {"viet": "Sự trình diễn của anh ta hơi đáng thất vọng sau tất cả những gì người ta quảng cáo.", "eng": "His performance was a bit of all anticlimaxes after all that publicity."}, {"viet": "Tiếng tăm của ông ta với tư cách một nhà văn dựa vào số lượng nhiều hơn vào chất lượng.", "eng": "His reputation as a writer depends more on quantity than quality."}, {"viet": "Câu chuyện của anh ta nghe chẳng có lý chút nào-hẳn là anh ta nói dối.", "eng": "His story just doesn't add up-he must be lying."}, {"viet": "Nghề nghiệp của anh ta trùng khớp với chí hướng của anh ta.", "eng": "His vocation coincides with his avocation."}, {"viet": "Giữ chặt mũ của ai vào một ngày lộng gió.", "eng": "Hold on to one's hat on a windy day."}, {"viet": "Giá nhà đứng lại trong nhiều tháng, bây giờ lại đang lên.", "eng": "House prices, which have been static for several months, are now rising again."}, {"viet": "Sao mày có thể ngốc như thế?", "eng": "How can you be so stupid?"}, {"viet": "Mọi người nói chung xem cô ấy thế nào?", "eng": "How do people in general look on her?"}, {"viet": "Anh ước lượng khán giả đông bao nhiêu?", "eng": "How large do you make the audience?"}, {"viet": "Có bao nhiêu nước tham dự ( giải Cúp Thế giới )?", "eng": "How many countries will be taking part ( in the World Cup )?"}, {"viet": "Mỗi người sẽ uống hết bao nhiêu bia?", "eng": "How much beer will they drink per head?"}, {"viet": "Ông bao nhiêu tuổi?''Tôi bốn mươi''Thôi đi, đừng nói vớ vẩn-trông ông không ngoài ba mươi'.", "eng": "How old are you?''I'm forty''Go on with you-you don't look a day over thirty'."}, {"viet": "Các khách du lịch đói rét và thiếu tiền.", "eng": "Hungry, cold, and out-of-pocket travellers."}, {"viet": "Tôi muốn biết chính xác khi nào anh ấy đến.", "eng": "I'd like to know the exact time of his arrival."}, {"viet": "Tôi sẽ gọi cho cô ngay khi quyết định xong.", "eng": "I'll call you as soon as I have made a decision."}, {"viet": "Tôi để chìa khoá ở trên bàn nhé?", "eng": "I'll leave the keys on the table, OK?"}, {"viet": "Những chỉ dẫn này làm tôi hơi lúng túng.", "eng": "I'm a bit fogged by these instructions."}, {"viet": "Tôi cầu mong cho những lời đề nghị của tôi được chấp nhận.", "eng": "I'm crossing my fingers that my proposals will be accepted."}, {"viet": "Tôi sẽ vào đại học nếu như tôi thi đậu.", "eng": "I'm going to university, always supposing I pass my exams."}, {"viet": "Tôi sẽ không ăn thứ thức ăn kinh tởm này.", "eng": "I'm not going to eat this shitty food."}, {"viet": "Tôi rất tiếc, tôi không có cùng quan điểm với ông được.", "eng": "I'm sorry, but I don't share your opinion."}, {"viet": "Tôi ngạc nhiên là cô vẫn chưa chán anh ta-tôi thấy anh ta rất hay quấy rầy.", "eng": "I'm surprised you haven't had enough of him yet-I found him very boring."}, {"viet": "Tôi luôn luôn tránh những tình bạn quá thân thiết.", "eng": "I've always shied away from close friendships."}, {"viet": "Tôi ăn no quá muốn bục thắt lưng.", "eng": "I've eaten so much I'm bursting at the seams."}, {"viet": "Tôi vừa mới pha cà phê-anh có thì giờ uống vội một tách không?", "eng": "I've just made some coffee-have you time for a quickie?"}, {"viet": "Tôi đã nói đi nói lại với anh nhiều lần là đừng có làm thế.", "eng": "I've told you again and again not to do that."}, {"viet": "Tôi luôn luôn cảm thấy hồi hộp trước một kỳ thi.", "eng": "I always have butterflies in my stomach before an exam."}, {"viet": "Tôi không có khả năng can thiệp vào vấn đề đó.", "eng": "I am powerless to intervene in the matter."}, {"viet": "Tôi cho rằng sự im lặng của em ngụ ý ưng thuận.", "eng": "I assume that your silence implies consent."}, {"viet": "Tôi ước tính rằng chúng ta sẽ đến Hà Nội vào khoảng 3 giờ chiều.", "eng": "I calculate that we will reach Hanoi at about 3 pm."}, {"viet": "Tôi không thể nào không nghĩ rằng anh ta vẫn còn sống.", "eng": "I can't help thinking he's still alive."}, {"viet": "Tôi không thấy sự khác nhau gì giữa hai trường hợp này.", "eng": "I can't see any distinction between these two cases."}, {"viet": "Tôi không thể tha thứ cho việc dùng bạo lực trong bất cứ tình huống nào.", "eng": "I cannot condo the use of violence under any circumstances."}, {"viet": "Tôi bắt gặp họ hôn mút lưỡi nhau sau phòng thay quần áo.", "eng": "I caught them frenching behind the lockers."}, {"viet": "Tôi không thể nào từ chối giúp đỡ họ, đúng không?", "eng": "I couldn't very well refuse to help them, could I?"}, {"viet": "Tôi không dám mở đầu câu chuyện với anh ta.", "eng": "I dared not enter into conversation with him."}, {"viet": "Tôi không nghe hết được những gì anh đã nói.", "eng": "I didn't quite get what you said."}, {"viet": "Tôi không biết tôi có thể đến được không, nhưng tôi sẽ cố gắng.", "eng": "I don't know if I can come, but I'll try."}, {"viet": "Tôi không coi những dự báo thời tiết có giá trị gì nhiều lắm.", "eng": "I don't set store by weather forecasts."}, {"viet": "Em không muốn mất anh ta cho người nào khác.", "eng": "I don't want to lose him to anyone else."}, {"viet": "Tôi không nghĩ rằng cô ta hiểu ý của tôi.", "eng": "I don't think she took my meaning."}, {"viet": "Ngày hôm nay tôi cảm thấy khỏe hơn một chút xíu thôi.", "eng": "I feel a tiny bit better today."}, {"viet": "Cuối cùng tôi đã gặp được nàng ở Paris.", "eng": "I finally made contact with her in Paris."}, {"viet": "Tôi đã cho nó quyền tự do sử dụng ngôi nhà của tôi và các đồ dùng trong đó.", "eng": "I gave him the freedom of my house and belongings."}, {"viet": "Tôi nghĩ là từng gốc cây này có lẽ đã chứng kiến những bước thăng trầm của nhiều triều đại.", "eng": "I guess that one may have witnessed the ups and downs of many dynasties."}, {"viet": "Tôi có linh cảm là mình đang bị theo dõi.", "eng": "I had the sensation that I was being watched."}, {"viet": "Tôi có một giấc mơ cứ trở đi trở lại nhiều lần trong đó tôi biến thành con voi.", "eng": "I have a recurrent dream that I've turned into an elephant."}, {"viet": "Tôi chưa có kinh nghiệm và cần phải học hỏi nhiều.", "eng": "I have no experience and have to learn a lot."}, {"viet": "Cháu phải đọc 20 trang trước thứ hai.", "eng": "I have to read 20 pages by Monday."}, {"viet": "Đã lâu rồi không gặp ông.", "eng": "I haven't seen you for some time."}, {"viet": "Tôi hy vọng sẽ không làm mất quá nhiều thời gian.", "eng": "I hope I'm not taking too much time."}, {"viet": "Tôi định giao anh đảm trách.", "eng": "I intend you to take over."}, {"viet": "Tôi biết nó giống như một thành phố.", "eng": "I know it's like a city."}, {"viet": "Tôi thích quần áo của tôi giản dị nhưng lịch sự.", "eng": "I like my clothes to be simple but elegant."}, {"viet": "Tôi sẽ ghé đón bạn lúc 7 giờ.", "eng": "I'll call for you at 7 o'clock."}, {"viet": "Tôi sẽ gặp hắn sáng ngày mai.", "eng": "I'll see him tomorrow morning."}, {"viet": "Tôi e rằng như thế thì chậm quá.", "eng": "I'm afraid that's much too slow."}, {"viet": "Cháu đến đây để gặp Jane.", "eng": "I'm here to see Jane."}, {"viet": "Xin lỗi, tôi không biết khu vực này.", "eng": "I'm sorry, but I don't know this area."}, {"viet": "Tôi đã cố gắng kiềm chế sự tức giận của tôi cho đến khi bà ta đi khỏi.", "eng": "I managed to hold my anger in leash until she had gone."}, {"viet": "Chắc là tôi đã làm tróc ít sơn khi tôi lái xe vào bãi đỗ.", "eng": "I must have scraped some of the paint off when I was parking the car."}, {"viet": "Tôi cần thời gian để lấy lại bình tĩnh trước khi gặp lại ông ấy.", "eng": "I needed time to gather my wits before seeing him again."}, {"viet": "Tôi đã đánh giá quá cao khả năng của anh ta-anh ta đang tìm việc làm rất khó khăn.", "eng": "I overestimated his abilities-he's finding the job very difficult."}, {"viet": "Tôi ngờ vực không biết đề nghị của anh ta có được thông qua không.", "eng": "I question whether his proposal will be approved."}, {"viet": "Tôi đã chuộc lại đồng hồ của tôi ở hiệu cầm đồ.", "eng": "I redeemed my watch from the pawn shop."}, {"viet": "Tôi thấy có một dáng người tiến lại gần trong bóng tối.", "eng": "I saw a figure approaching in the darkness."}, {"viet": "Hôm nay tôi sẽ thôi không ăn kiêng nữa, tôi sắp ăn uống thoả thích đây.", "eng": "I shall forget about dieting today, I'm just going to indulge."}, {"viet": "Chẳng mấy chốc tôi quen với kiểu cách kỳ lạ của anh ta.", "eng": "I soon got accustomed to his strange ways."}, {"viet": "Tôi nghi ngờ sự thật về lời khai của cô ta.", "eng": "I suspect the truth of her statement."}, {"viet": "Tôi nghĩ mình đã đánh giá quá cao anh ta, anh ta không thể giải quyết công việc quan trọng được.", "eng": "I think I overrated him, he can't handle a serious job."}, {"viet": "Tôi nghĩ chúng ta có thể nói kết quả cuộc bầu cử này là không thể thay đổi.", "eng": "I think we can say that the result of the election is now cut and dried."}, {"viet": "Tôi đã nói rõ ràng với anh ta là phải báo cáo với tôi hàng ngày.", "eng": "I told you expressly to report to me everyday."}, {"viet": "Tôi biết là cửa hàng bách hóa Venus sẽ mở cửa lúc 10 giờ sáng.", "eng": "I understand the Venus Department Store will open at 10 o'clock in the morning."}, {"viet": "Tôi muốn nó ở ngay bên cạnh và với nó dễ dàng.", "eng": "I want it to be handy and easily reached."}, {"viet": "Tôi muốn nói chuyện với ông.", "eng": "I want to talk to you."}, {"viet": "Tôi lấy làm thất vọng khi gọi điện thoại đến thì thấy anh đã đi khỏi.", "eng": "I was disappointed to find you out when I called."}, {"viet": "Tôi chưa bao giờ trong nhóm những người được thán phục ở trường học.", "eng": "I was never one of the in-crowd at school."}, {"viet": "Tôi đang nghĩ đến việc đi thăm John thì lúc đó không ai khác ngoài John lại xuất hiện.", "eng": "I was thinking of going to see John when who should appear but John himself."}, {"viet": "Tôi sẽ tiếp tục tin điều đó cho đến khi tôi tìm được bằng chứng ngược lại.", "eng": "I will continue to believe it until I get proof to the contrary."}, {"viet": "Sáng nay thức dậy tôi bị đau bụng ghê gớm.", "eng": "I woke up this morning with terrible pains in my stomach."}, {"viet": "Tôi cố tập thể dục đều đặn để giữ cho khỏe mạnh.", "eng": "I work out regularly to keep fit."}, {"viet": "Nhân tiện tôi muốn nói tôi thấy bản báo cáo của anh rất có ích.", "eng": "I would like to say en passant how useful I found your report."}, {"viet": "Tôi thán phục tác phẩm của bà ta nhất.", "eng": "I yield to no one in my admiration for her work."}, {"viet": "Nếu tôi không kiếm được tiền một cách lương thiện, tôi sẽ phải nghĩ tới cái gì khác.", "eng": "If I can't get the money honestly, I'll have to think of something else."}, {"viet": "Nếu cô ta mất việc chỉ vì đến chậm có một lần thì cô ta đã bị đối xử không công bằng.", "eng": "If she lost her job for being late once, she got a pretty raw deal."}, {"viet": "Nếu chúng ta không có khả năng mua ôtô, chúng ta đành phải xoay xở công việc mà không có xe.", "eng": "If we can't afford a car, we'll just have to do without."}, {"viet": "Nếu cậu không mở được để tôi thử một cái xem sao.", "eng": "If you can't open it, let me have a whack at it."}, {"viet": "Nếu bít tất của em có vết xước thì em đi mua đôi mới.", "eng": "If you have a run in your stockings, you go out and buy a new pair."}, {"viet": "Nếu anh nghĩ là giá cao quá, anh nên hỏi xem.", "eng": "If you think the price is too high, you should query it."}, {"viet": "Trong câu'I wish you were here','were'là thuộc thể giả định.", "eng": "In'I wish you were here','were'is in the subjunctive."}, {"viet": "Trong tình thế tuyệt vọng họ phải dùng tới bạo lực.", "eng": "In desperation they resorted to violence."}, {"viet": "Ở nhiều nước Hồi giáo, phụ nữ đeo mạng che mặt.", "eng": "In many Muslim countries, the women wear veils."}, {"viet": "Trong khi chỉ huy của tôi vắng mặt, tôi đã hành động theo sự chủ động của mình.", "eng": "In the absence of my commanding officer, I acted on my own initiative."}, {"viet": "Có sự hiểu biết xác thực và chắc chắn về tội lỗi của cô ta.", "eng": "In the sure and certain knowledge of her guilt."}, {"viet": "Sự phát triển công nghiệp ở ngoại biên thành phố.", "eng": "Industrial development on the periphery of the town."}, {"viet": "Môn trượt băng được ưa chuộng ở Anh phải không?", "eng": "Is ice-skating popular in England?"}, {"viet": "Ở nước bạn có đảng cộng sản không?", "eng": "Is there a communist party in your country?"}, {"viet": "Du lịch là một ngành công nghiệp rất quan trọng ở New Zealand phải không?", "eng": "Is tourism a very big industry in New Zealand?"}, {"viet": "Cõi đời có những đau khổ như thế này là một cõi đời buồn.", "eng": "It's a sad world where there is such suffering."}, {"viet": "Đi quá gần mép vách đá rất nguy hiểm.", "eng": "It's dangerous to go too near the edge of the cliff."}, {"viet": "Không thể có bất cứ nhà cung cấp khác và thấy rằng các điều khoản của ông ấy thuận lợi hơn.", "eng": "It's impossible that any other supplier can underquote us if their goods are as good as ours in quality."}, {"viet": "Đó không phải là thông tin gốc, vì thế tôi không biết là anh có thể tin được nó hay không.", "eng": "It's not first hand information, so I don't know if you can completely believe it."}, {"viet": "Khi mình cần xe nhất thì nó lại hỏng.", "eng": "It's Sod's Law that the car breaks down when you need it most."}, {"viet": "Ông thật tử tế khi nói vậy, ông Vương ạ.", "eng": "It's very kind of you to say so, Mr. Wang."}, {"viet": "Nó có vẻ giống nhau, nhưng tình yêu có nền tảng vững chắc.", "eng": "It feels the same, but love has a stronger foundation."}, {"viet": "Rất khó để sống tuân theo nguyên tắc của Đạo Thiên Chúa.", "eng": "It is difficult to live up to the principles of Christian religion."}, {"viet": "Có xe hơi mà lại không biết lái thì thật là vô dụng!", "eng": "It is pointless to have a car if you cannot drive it!"}, {"viet": "Dù ta đi hay ở thì cũng chẳng có gì là quan trọng.", "eng": "It matters little whether we go or stay."}, {"viet": "Thật là vui khi lên kế hoạch cho kỳ nghỉ của gia đình.", "eng": "It's fun to plan family vacation."}, {"viet": "Dường như thể cháu chỉ vừa mới đến đây.", "eng": "It seems as if you just arrived."}, {"viet": "Chứng tỏ là anh ta không biết gì về việc đó.", "eng": "It transpired he knew nothing about it."}, {"viet": "Thật khó mà quyết định nước nào phạm tội xâm lược.", "eng": "It was difficult to decide which country was guilty of aggression."}, {"viet": "Nó đã được tổ chức lại và được dời từ Bắc Kinh đến Thượng hải vào năm 1987.", "eng": "It was restructured and removed from Beijing to Shanghai in 1987."}, {"viet": "Sẽ mất khoảng 10 ngày để gom số tiền thu được.", "eng": "It will take about ten days to collect the proceeds."}, {"viet": "Jane có thể bắt bố mẹ mình luôn luôn chiều mình hết ý.", "eng": "Jane has always been able to twist her parents round her little finger."}, {"viet": "Gia nhập đội quân thất nghiệp.", "eng": "Join the ranks of the unemployed."}, {"viet": "Cứ đi thẳng cho tới khi anh đến nhà thờ.", "eng": "Keep straight on until you get to the church."}, {"viet": "Hãy uống rượu mừng công việc mới của anh!", "eng": "Let's drink to your success in your new job!"}, {"viet": "Hãy để chúng tôi đo huyết áp cho ông.", "eng": "Let's take your blood pressure."}, {"viet": "Nhiều nông dân đang rời bỏ ruộng đất để làm trong ngành công nghiệp.", "eng": "Many farmers are leaving the land to work in industry."}, {"viet": "Cổng tò vò cẩm thạch là một cái mốc nổi tiếng của Luân Đôn.", "eng": "Marble Arch is a famous London landmark."}, {"viet": "Tôi có được phép dùng thêm một chén xúp không?", "eng": "May I have another bowl of soup?"}, {"viet": "Có lẽ anh có thể giới thiệu món gì đó cho chúng tôi nhé?", "eng": "Maybe you recommend something for us?"}, {"viet": "Hầu hết mọi người đều không lựa chọn làm việc quá tuổi về hưu bình thường.", "eng": "Most people do not choose to work beyond the normal retirement age."}, {"viet": "Cô ta rất ngạc nhiên thấy ngày hôm sau anh ta đã về.", "eng": "Much to her surprise he came back next day."}, {"viet": "Nợ nần của tôi như đá đeo vào cổ.", "eng": "My debts were like a millstone round my neck."}, {"viet": "Mối quan tâm của tôi về nghệ thuật Ấn Độ đã nảy sinh ra từ hồi tôi ở bên đó trong thời chiến.", "eng": "My interest in the art of India grew out of the time I spent there during the war."}, {"viet": "Nhận xét của tôi không hề có ý xúc phạm ông.", "eng": "My remark was not meant as a slight on you."}, {"viet": "Các quốc gia phải bảo vệ rừng để giảm thiểu những tác dụng có hại cho thời tiết.", "eng": "Nations must conserve their forests, to reduce the harmful effects on climate."}, {"viet": "Năm tới sẽ là lễ kỷ niệm một trăm năm ngày thành lập hãng này.", "eng": "Next year will be the centenary of this firm."}, {"viet": "Đâu có chính phủ nào muốn đầu độc dân mình.", "eng": "No government is going to poison its own people."}, {"viet": "Có một cô gái đẹp trước đây tôi chưa từng gặp ở đây.", "eng": "Now, there's some ankle I've seen around here."}, {"viet": "Cản trở cảnh sát thi hành nhiệm vụ.", "eng": "Obstruct the police in the course of their duty."}, {"viet": "À, phòng của ông cách thang máy không xa.", "eng": "Oh, your room is not far from the elevators."}, {"viet": "Khi ném lên lần đầu, mặt đồng tiền lật ngửa.", "eng": "On the first toss, the coin came up heads."}, {"viet": "Một trong các cầu thủ tấn công của chúng tôi đã bị hậu vệ xông vào xô ngã.", "eng": "One of our strikers was violently charged by a defender."}, {"viet": "Công việc sắp xếp đi nghỉ cuối tuần của chúng tôi đã bị đảo lộn do chuyến đến thăm của bà ta.", "eng": "Our arrangements for the weekend were upset by her visit."}, {"viet": "Súng của chúng tôi khống chế mọi lối vào thành phố.", "eng": "Our guns covered every approach to the town."}, {"viet": "Cuộc đi thăm dự kiến của chúng ta đã phải huỷ bỏ.", "eng": "Our projected visit had to be cancelled."}, {"viet": "Làm việc quá sức đã đưa anh ta đến một tình trạng suy nhược thể chất.", "eng": "Overwork has reduced him to a physical wreck."}, {"viet": "Việc thanh toán sẽ được thực hiện khi ông nộp cho chúng tôi biên lai thu tiền tạm cấp liên quan.", "eng": "Payment will be made upon your surrendering to us the relative Provisional Receipt for Collection."}, {"viet": "Các thầy giáo dạy nhạc lưu động đến trường đều đặn.", "eng": "Peripatetic music teachers visit the school regularly."}, {"viet": "Cảnh sát nghi là có thể có mối liên kết giữa hai vụ giết người những mối liên hệ về thương mại, văn hoá, ngoại giao, v. v. ( giữa hai nước ).", "eng": "Police suspect there may be a link between the two murders commercial, cultural, diplomatic, etc links ( between two countries )."}, {"viet": "Các tay chính khách đối nghịch giải quyết hơn thua bằng một cuộc tranh luận trên ti vi.", "eng": "Rival politicians shooting it out in a television debate."}, {"viet": "Một vài lý do đã ảnh hưởng tới quyết định của tôi.", "eng": "Several considerations have influenced my decision."}, {"viet": "Cô ta hơi quá tinh khôn đến nỗi tôi không thấy thoải mái khi gần cô ta được.", "eng": "She's a bit too knowing for me to feel relaxed with her."}, {"viet": "Cô ta tỏ ra vui sướng hơn nhiều từ khi tuyên bố công khai mình là đồng tính luyến ái.", "eng": "She's been much happier since she came out."}, {"viet": "Bà ấy có sức khỏe khá tốt đối với một người ở tuổi 70.", "eng": "She's in pretty good nick for a 70 year-old."}, {"viet": "Trong việc làm mới của cô ta cô ta kiếm được khối tiền.", "eng": "She's raking in the shekels in her new job."}, {"viet": "Cô ấy là một thiên tài trong trò chơi ô chữ.", "eng": "She's a genius at doing crossword puzzles."}, {"viet": "Cô ta làm thất bại mọi cố gắng của chúng tôi để tìm cô ta.", "eng": "She baffled all our attempts to find her."}, {"viet": "Cô ấy viện dẫn những con số thất nghiệp cao để làm bằng chứng cho sự thất bại của chính sách của chính phủ.", "eng": "She cited the high unemployment figures as evidence of the failure of government policy."}, {"viet": "Sau khi cân nhắc kỹ, cô ấy quyết định chấp nhận lời đề nghị.", "eng": "She decided, on reflection, to accept the offer."}, {"viet": "Cô ta miễn cưỡng rời khỏi giường, vẫn còn ngái ngủ.", "eng": "She dragged herself out of bed, still half asleep."}, {"viet": "Cô ta cảm thấy thiên hạ đều chống lại mình.", "eng": "She felt that the whole world was against her."}, {"viet": "Cô ta hờ hững liếc qua cuốn sách.", "eng": "She glanced through the book apathetically."}, {"viet": "Cô ta có nhiều bạn trai trước khi lấy chồng.", "eng": "She had lots of boy-friends before she got married."}, {"viet": "Bà ấy để di chúc lại cho tôi số nữ trang của bà.", "eng": "She has bequeathed me her jewellery."}, {"viet": "Cô ấy đã vén váy lên để không bị ướt.", "eng": "She hitched up her skirt so as not to get it wet."}, {"viet": "Bà ta đang yếu đi và có thể chẳng bao lâu sẽ chết.", "eng": "She is on the decline, and may die soon."}, {"viet": "Cô ấy biết cô ấy không bao giờ làm sao hết.", "eng": "She knew no harm would ever befall her."}, {"viet": "Trông cô ta hoàn toàn đoan trang trong bộ áo choàng vào lúc ăn sáng.", "eng": "She looked perfectly respectable in her bathrobe at breakfast."}, {"viet": "Bà ta than khóc đứa con đã mất trong nhiều năm qua.", "eng": "She mourned for her dead child for many years."}, {"viet": "Cô ấy đã vớ bở mua được bản in đầu tiên có giá trị tại cuộc bán sách ở làng.", "eng": "She picked up a valuable first edition at a village book sale."}, {"viet": "Lần thứ hai cô ta đọc bức thư cẩn thận hơn.", "eng": "She read the letter more carefully the second time."}, {"viet": "Cô ta luôn luôn khúm núm trước ông chủ.", "eng": "She's always cringing to the boss."}, {"viet": "Có lẽ bà bị dị ứng với lông chó.", "eng": "She's probably allergic to dog's hair."}, {"viet": "Bà ấy mắng con trai vì tội hỗn láo.", "eng": "She scolded her son for being impertinent."}, {"viet": "Cô ta rụt rè đi tới chỗ tôi và hỏi tôi có nhận ra cô ta không.", "eng": "She sidled over to me and asked if I recognized her."}, {"viet": "Cô ấy còn phải mua mấy món quà giáng sinh phút chót.", "eng": "She still had some last-minute christmas present to buy."}, {"viet": "Bà đã sát hạch cả lớp về các động từ bất qui tắc.", "eng": "She tested the whole class on irregular verbs."}, {"viet": "Bà ta vặn to máy thu thanh để át tiếng ồn của xe cộ đi lại.", "eng": "She turned up the radio to drown the noise of the traffic."}, {"viet": "Cô ta có một vẻ đẹp đáng yêu lạ thường.", "eng": "She was a vision of loveliness."}, {"viet": "Cô ta tỏ ra hối hận sau khi cơn giận của mình bùng nổ ra lúc buổi sáng.", "eng": "She was contrite the morning after her angry outburst."}, {"viet": "Bà ấy đau buồn vì đứa con mất tích của mình.", "eng": "She was in anguish over her missing child."}, {"viet": "Cô ta đã bị cha mẹ thúc ép học lên đại học.", "eng": "She was pushed into going to university by her parents."}, {"viet": "Cô ta ở đó cả ngày nhưng, thật là lạ, tôi không trông thấy cô ấy.", "eng": "She was there all day but, curiously, I didn't see her."}, {"viet": "Cứ sau bữa điểm tâm là bà đi bách bộ, đó là thói quen của bà.", "eng": "She went for a walk after breakfast, as was her wont."}, {"viet": "Cô ấy đã giành được huy chương vàng trong cuộc chạy đua maratông phụ nữ tại Đại hội thể thao Olimpíc năm nay.", "eng": "She won the gold medal in the women's marathon at this year's Olympic Games."}, {"viet": "Di chuyển cái tủ quần áo đó chắc khó đấy!", "eng": "Shifting that wardrobe must have taken some doing!"}, {"viet": "Xem xét rất kỹ lưỡng, cẩn thận những chồng văn thư.", "eng": "Sift through the piles of correspondence."}, {"viet": "Ngồi quanh lò sưởi theo hình bán nguyệt.", "eng": "Sitting in a semi-circle round the fire."}, {"viet": "Tên của Smith đứng đầu danh sách.", "eng": "Smith's name headed the list."}, {"viet": "Vì vậy mười xu là một hào, hai mươi xu là hai hào.", "eng": "So ten fen is one Jiao, twenty fen is two Jiao."}, {"viet": "Một ít đô la Canada bằng ngân phiếu du lịch do ngân hàng Hoàng Gia Canada phát hành.", "eng": "Some Canadian dollars in traveler's cheques issued by Royal Bank of Canada."}, {"viet": "Một vài người trong số những người bị xã hội ruồng bỏ hồi trước đã từng giống như Tom bây giờ đấy.", "eng": "Some of those derelicts were once like the way Tom is now."}, {"viet": "Một số công nhân đã tỏ ra hoài nghi phương pháp của công đoàn trong việc kêu gọi một cuộc đình công tức thời.", "eng": "Some workers questioned the union's tactics in calling for an immediate strike."}, {"viet": "Xin lỗi, tôi có biết mô tê gì đâu.", "eng": "Sorry, I haven't the faintest."}, {"viet": "Quần áo thể thao không thích hợp để đi dự một đám cưới trang trọng.", "eng": "Sports clothes are not appropriate for a formal wedding."}, {"viet": "Những bậc thang được đục vào đá khối.", "eng": "Steps cut in the solid rock."}, {"viet": "Việc dự trữ hàng hoá dạo này rất tấn kém.", "eng": "Storage so far has proved rather expensive."}, {"viet": "Các chính quyền kế tiếp nhau thất bại trong việc giải quyết các vấn đề kinh tế quốc gia.", "eng": "Successive administrations had failed to solve the country's economic problems."}, {"viet": "Lưu huỳnh được dùng làm thuốc súng và diêm.", "eng": "Sulphur is used to make gunpowder, and matches."}, {"viet": "Che dấu bằng chứng có thể gây lúng túng.", "eng": "Sweep embarrassing evidence under the carpet."}, {"viet": "Hãy mang cốc nước này lên cho bố con.", "eng": "Take this glass of water up to your father."}, {"viet": "Cho một đứa trẻ biết những điều căn bản về tình dục.", "eng": "Tell a child about the birds and the bees."}, {"viet": "Cám ơn hai bác rất nhiều vì tất cả những gì hai bác đã làm cho cháu.", "eng": "Thank you very much for all you've done for me."}, {"viet": "Đó có phải là một kết luận đúng đắn ( rút ra ) từ lời tuyên bố của anh ta không?", "eng": "That a fair inference ( to draw ) from his statement?"}, {"viet": "Thằng cha đó đòi 100 đô để sửa bộ tiêu âm của tôi.", "eng": "That guy wanted a C-note to fix my muffler."}, {"viet": "Ô tô mới đó chắc hẳn làm bà ta lao đao một chút.", "eng": "That new car must have knocked her back a bit."}, {"viet": "Thế mới là phục vụ lẹ chứ!", "eng": "That's what I call fast service!"}, {"viet": "Bằng cách đó, anh sẽ không đụng chạm gì đến ai cả.", "eng": "That way, you wouldn't disrupt anyone."}, {"viet": "Các cách tính toán không phù hợp với nhau.", "eng": "The accounts do not agree with one another."}, {"viet": "Sĩ quan tùy viên đó, sau khi được chính thức thông báo là không được chấp nhận, đã bị trục xuất khỏi nước này.", "eng": "The aide, having been declared non grata, was expelled from the country."}, {"viet": "Việc thông báo những con số thương mại sẽ hoãn lại sau bầu cử.", "eng": "The announcement of the trade figures was delayed until after the election."}, {"viet": "Sự tiến quân bị đình lại vì thiếu lương thực.", "eng": "The army's advance was halted by shortages of food."}, {"viet": "Cuộc tấn công đã thành công, và công sự đã bị chiếm.", "eng": "The attack succeeded, and the fort was taken."}, {"viet": "Em bé bò ở giữa hai chân của bố nó.", "eng": "The baby crawled between her father's legs."}, {"viet": "Nửa tiếng nữa ngân hàng đóng cửa rồi, tôi cần rút một ít tiền.", "eng": "The bank closes in half an hour and I need to draw some money."}, {"viet": "Tia sáng của đèn pin, đèn pha, v. v.", "eng": "The beam of the torch, searchlight, etc."}, {"viet": "Bài thi sinh vật thật sự là một bài khó.", "eng": "The biology paper was a real stinker."}, {"viet": "Chiếc thuyền lún sâu dưới bùn.", "eng": "The boat was stuck fast in the mud."}, {"viet": "Dân đánh cuộc đề nghị 3 ăn 1, nhưng chẳng có người nào chấp nhận.", "eng": "The bookies were offering odds of 3 to 1, but there were no takers."}, {"viet": "Bọn trẻ bắt đầu đánh lộn và thầy giáo đã phải can chúng ra.", "eng": "The boys set to and had to be separated by a teacher."}, {"viet": "Việc xây cất không theo đúng với các qui định an toàn.", "eng": "The building does not conform to the safety regulations."}, {"viet": "Công việc kinh doanh vẫn đang phải chịu những vấn đề phát sinh trong quá trình phát triển một doanh nghiệp.", "eng": "The business is still suffering from growing pains."}, {"viet": "Chiếc xe hơi lao ra khỏi đường đâm xuống một cái hào.", "eng": "The car careered off the road into the ditch."}, {"viet": "Tấm thiệp gởi cho chúng tôi ghi sai địa chỉ nhà cũ của chúng tôi.", "eng": "The card was wrongly addressed to us at our old home."}, {"viet": "Hễ mưa to là hầm rượu ngập nước.", "eng": "The cellar floods whenever it rains heavily."}, {"viet": "Người ta đã giành mua hết mấy món hàng rẻ nhất vào dịp bán hạ giá.", "eng": "The cheapest articles at the sale were quickly snapped up."}, {"viet": "Đứa bé hát trong trẻo ngọt ngào như một con chim hoạ mi.", "eng": "The child sang as sweetly as a nightingale."}, {"viet": "Vừa qua mấy đứa trẻ chẳng ngoan gì lắm.", "eng": "The children didn't behave any too well."}, {"viet": "Bọn trẻ thèm thuồng nhìn mớ kẹo.", "eng": "The children were eyeing the sweets."}, {"viet": "Trung tâm tài chính-thương mại phản ứng rất nhanh với việc giảm giá dầu.", "eng": "The City reacted sharply to the fall in oil prices."}, {"viet": "Người thủ môn của câu lạc bộ này thấy ở đây không dễ chịu, và đã xin chuyển ( sang câu lạc bộ khác ).", "eng": "The club's goalkeeper isn't happy here, and has asked for a transfer ( to another club )."}, {"viet": "Nhìn dưới ánh sáng ban ngày màu sắc sẽ khác đi.", "eng": "The colours look different when viewed in daylight."}, {"viet": "Công ty tuyên bố tiền lãi tăng.", "eng": "The company has declared an increase in profits."}, {"viet": "Cái anh chàng mới tự cao tự đại chứ-dám so sánh tác phẩm của mình với tác phẩm của Picasso!", "eng": "The conceit of the man-comparing his own work with Picasso's!"}, {"viet": "Kiểm soát giao thông là phận sự của cảnh sát.", "eng": "The control of traffic appertains to the police."}, {"viet": "Đất nước ta đã thay đổi từ quân sự sang quân chủ.", "eng": "The country has changed over from military to monarchy rule."}, {"viet": "Chiếc bút chì đã mòn chỉ còn lại một mẩu.", "eng": "The crayon had been worn down to a stub."}, {"viet": "Đám đông gào thét cổ vũ các đấu thủ.", "eng": "The crowd yelled encouragement at the players."}, {"viet": "Chiếc máy bay hỏng bay bằng một động cơ.", "eng": "The damaged aircraft was flying on only one engine."}, {"viet": "Luật sư của bị cáo lập luận rằng bằng chứng trên là yếu.", "eng": "The defence argues that the evidence is weak."}, {"viet": "Nhà thám tử đã cố gắng suy ra cách tên trộm đã trốn thoát như thế nào.", "eng": "The detective tried to reason out how the thief had escaped."}, {"viet": "Cuộc thảo luận đột ngột xoay từ đề tài tôn giáo sang đề tài chính trị.", "eng": "The discussion veered away from religion and round to politics."}, {"viet": "Bác sĩ đã gõ ngực bệnh nhân để chẩn đoán.", "eng": "The doctor percussed the patient's chest."}, {"viet": "Con chó định đớp miếng thịt nhưng không được.", "eng": "The dog made an unsuccessful snap at the meat."}, {"viet": "Cặn đã lắng đọng xuống đáy chai.", "eng": "The dregs have settled at the bottom of the bottle."}, {"viet": "Quả đất xoay quanh mặt trời trên trục của nó.", "eng": "The earth revolves round the sun on its axis."}, {"viet": "Sự nhấn mạnh ở đây là vào công việc nặng nhọc, chứ không phải vào hưởng thụ.", "eng": "The emphasis here is on hard work, not enjoyment."}, {"viet": "Thư của Thánh Phaolô gửi cho dân La Mã.", "eng": "The Epistle of St Paul to the Romans."}, {"viet": "Việc sử dụng quyền công dân của mình.", "eng": "The exercise of one's civil rights."}, {"viet": "Sự thất bại làm cho chuyên gia đó trông như một anh ngớ ngẩn không có kinh nghiệm.", "eng": "The failure made the expert look like an amateur."}, {"viet": "Cảm giác về địa điểm, cuộc họp, cơ hội.", "eng": "The feel of the place, the meeting, the occasion."}, {"viet": "Đột nhiên phim nhảy từ những biến cố của năm 1945 sang biến cố 1975.", "eng": "The film suddenly jumped from the events of 1945 to those of 1975."}, {"viet": "Hãng đã cấp cho tôi một chiếc xe ôtô.", "eng": "The firm have provided me with a car."}, {"viet": "Con cá đó giật cần câu của tôi một cái.", "eng": "The fish gave my line a twitch."}, {"viet": "Thực phẩm mà chúng tôi mua thì không phong phú, đa dạng.", "eng": "The food we get here is terribly samey."}, {"viet": "Đứa trẻ sợ hãi lao ra khỏi phòng.", "eng": "The frightened child bolted from the room."}, {"viet": "Khu vườn nằm sát bên cánh đồng.", "eng": "The garden is contiguous to the field."}, {"viet": "Cô gái dẫn tôi đi theo lối giữa các hàng ghế tới chỗ của tôi.", "eng": "The girl ushered me along the aisle to my seat."}, {"viet": "Những người ủng hộ chính phủ hoan nghênh đạo luật mới.", "eng": "The government's supporters welcomed the new law."}, {"viet": "Chính phủ đang tài trợ một kế hoạch khác để trợ cấp những người thất nghiệp.", "eng": "The government is funding another unemployment scheme."}, {"viet": "Sự tan rã dần dần những giá trị truyền thống.", "eng": "The gradual disintegration of traditional values."}, {"viet": "Nhóm đó đã dùng chiến thuật gây sửng sốt để lôi cuốn sự chú ý của công chúng: một người trong số họ đã cởi bỏ hết quần áo trên ti vi.", "eng": "The group used shock tactics to get publicity: one of them took his clothes off on TV."}, {"viet": "Hội trường trông có vẻ vui tươi hơn với những tràng lá trang trí các chậu cây.", "eng": "The hall looks more festive with all that greenery in pots."}, {"viet": "Nhân vật nam chính chết trong hồi 4, cảnh 3.", "eng": "The hero dies in Act 4, Scene 3."}, {"viet": "Những con ngựa đang lặng lẽ ăn trong chuồng.", "eng": "The horses were feeding quietly in the stable."}, {"viet": "Ngôi nhà dần dần bị phân huỷ vì năm tháng.", "eng": "The house is gradually disintegrating with age."}, {"viet": "Băng nứt ra khi tôi giẫm lên nó.", "eng": "The ice cracked as I stepped onto it."}, {"viet": "Dân da đỏ là những cư dân đầu tiên ở Bắc Mĩ.", "eng": "The Indians were the original inhabitants of North American."}, {"viet": "Sự vận hành bên trong của một cái máy.", "eng": "The internal workings of a machine."}, {"viet": "Công việc tạo cơ hội tốt để thăng chức.", "eng": "The job offers good opportunities for advancement."}, {"viet": "Cái ấm nước đang bốc hơi trên bếp.", "eng": "The kettle was steaming away on the stove."}, {"viet": "Đất nghiêng về hướng bờ biển.", "eng": "The land inclines towards the shore."}, {"viet": "Vị luật sư đưa ra một lời bào chữa khôn khéo cho thân chủ.", "eng": "The lawyer produced a clever defense of his client."}, {"viet": "Khu sách báo về sinh học rất nhiều sách của thư viện.", "eng": "The library's extensive biology section."}, {"viet": "Dịch vụ hỏa xa địa phương đã bị gián đoạn vào năm 1958.", "eng": "The local rail service was discontinued in 1958."}, {"viet": "Cái máy này không còn vận hành được.", "eng": "The machine is out of action."}, {"viet": "Người đàn ông mà tôi nói chuyện lúc nãy vừa từ Canada đến.", "eng": "The man that I was talking to had just arrived from Canada."}, {"viet": "Vấn đề đó không còn là chuyện đùa nữa.", "eng": "The matter has gone beyond the joke."}, {"viet": "Cuộc họp của những nhà lãnh đạo xảy ra sau sân khấu.", "eng": "The meetings between the leaders took place off stage."}, {"viet": "Vị bộ trưởng đã trả lời dễ dàng tất cả các câu hỏi hắc búa của nhà báo.", "eng": "The minister easily fielded all the journalist's awkward questions."}, {"viet": "Đám khỉ kêu chí choé trong bụi cây.", "eng": "The monkeys were screeching in the tree."}, {"viet": "Núi in rõ hình lên nền trời phía đông.", "eng": "The mountain was sharply defined against the eastern sky."}, {"viet": "Nhà hát quốc gia trình diễn vở'Hamlet'theo một cách dàn dựng mới.", "eng": "The National Theatre presents'Hamlet'in a new production."}, {"viet": "Thế hệ mới của những chiếc máy bay chở khách siêu âm.", "eng": "The new generation of supersonic airliners."}, {"viet": "Các qui định mới về dây an toàn của ghế đã có hiệu lực từ tuần trước.", "eng": "The new seat-belt regulations came into effect last week."}, {"viet": "Báo chí rất thích chỉ trích gay gắt đội Anh.", "eng": "The newspapers are too fond of knocking the England team."}, {"viet": "Tác giả mô tả nhân vật nữ đầy ngẫu hứng và đam mê.", "eng": "The novelist characterizes his heroine as capricious and passionate."}, {"viet": "Văn phòng thiếu người kể từ khi cô thư kí cuối cùng đi.", "eng": "The office is understaffed since the last secretary."}, {"viet": "Ông lão keo kiệt lòng đầy lòng ham muốn khi nhìn thấy đồ nữ trang bằng vàng.", "eng": "The old miser was filled with lust, when he saw the gold jewelry."}, {"viet": "Ban nhạc lên dây đàn khi chúng tôi bước vào phòng hoà nhạc.", "eng": "The orchestra was tuning up when we entered the concert-hall."}, {"viet": "Hội hoạ cung cấp cho chúng ta một trong những thí dụ sớm nhất về cách ứng dụng luật xa gần.", "eng": "The painting provides us with one of the earliest examples of the use of perspective."}, {"viet": "Buổi tiệc diễn ra một cách nhộn nhịp.", "eng": "The party went with a swing."}, {"viet": "Nhân dân phải chấp nhận những đòi hỏi cấp bách khắc nghiệt của chiến tranh.", "eng": "The people had to accept the harsh exigencies of war."}, {"viet": "Bức hình được bọc một tấm bìa cứng phía sau.", "eng": "The photograph was backed with cardboard."}, {"viet": "Nơi đó đã được gỡ bỏ hoàn toàn máy nghe trộm.", "eng": "The place has been completely debugged."}, {"viet": "Những cái cây bị hơi nóng làm cho héo.", "eng": "The plants were wilted by the heat."}, {"viet": "Dạng số nhiều của goose là geese.", "eng": "The plural form of goose is geese."}, {"viet": "Cảnh sát được sự hỗ trợ của quân đội.", "eng": "The police had military back-up."}, {"viet": "Cảnh sát thường bắt giữ nhiều lái xe uống rượu vào đêm giao thừa.", "eng": "The police usually have a large number of DUI arrests on New Year's Eve."}, {"viet": "Người mang hành lý sẽ đưa ông đến phòng.", "eng": "The porter will show you to your room."}, {"viet": "Sang năm các phòng điện thoại này sẽ không sử dụng nữa.", "eng": "The present phone boxes will go out of use next year."}, {"viet": "Áp lực của nước làm cho tường của con đập rạn nứt.", "eng": "The pressure of the water caused the wall of the dam to crack."}, {"viet": "Ông hiệu trưởng cho anh ta một giấy chứng nhận khi anh ta rời trường.", "eng": "The principal gave him a testimonial, when he left school."}, {"viet": "Các nhà sản xuất radio đã không tìm được thị trường cho họ.", "eng": "The producers of the radios could not find a market for them."}, {"viet": "Viễn ảnh phá sản nay đã lùi xa.", "eng": "The prospect of bankruptcy has now receded."}, {"viet": "Giai đoạn cách ly kiểm dịch cho bệnh sởi là 14 ngày.", "eng": "The quarantine period for measles is fourteen days."}, {"viet": "Mưa không ảnh hưởng nhiều ( đến trận đấu ).", "eng": "The rain didn't make much difference ( to the game )."}, {"viet": "Các biên bản cuộc họp đã bị sửa bậy.", "eng": "The records of the meeting had been tampered with."}, {"viet": "Bản tường trình nêu mối liên hệ các mức lương cao với những thiếu hụt lao động.", "eng": "The report relates high wages to labour shortages."}, {"viet": "Sự huỷ bỏ các đạo luật, hợp đồng, v. v.", "eng": "The revocation of laws, contracts, etc."}, {"viet": "Con đường rộng ra sau chỗ quanh này.", "eng": "The road broadens after this bend."}, {"viet": "Căn phòng quay cuồng trước anh ta.", "eng": "The room swam before around him."}, {"viet": "Sự từ bỏ thời gian nhàn rỗi để kiếm tiền.", "eng": "The sacrifice of one's leisure time to money making."}, {"viet": "Mùi hương của hoa thoảng đưa theo gió.", "eng": "The scent of the flowers was wafted along by the breeze."}, {"viet": "Cuộc biểu diễn hay thứ hai của cuộc thi.", "eng": "The second-best performance of the tournament."}, {"viet": "Căn nhà tồi tàn cắt dọc theo con đường.", "eng": "The shabby houses ranged along the road."}, {"viet": "Chuyến tàu bị chậm vì ngược gió.", "eng": "The ship was delayed by contrary winds."}, {"viet": "Người đàn ông bệnh hoạn đó tìm niềm khuây khỏa trong âm nhạc.", "eng": "The sick man found solace in music."}, {"viet": "Chiếc váy đã xong, bây giờ tôi sẽ may túi vào.", "eng": "The skirt is finished-I'm now going to sew a pocket on."}, {"viet": "Luật lệ của hội được sửa đổi cho phép phụ nữ làm chủ tịch.", "eng": "The Society's constitution has been amended to allow women to become president."}, {"viet": "Cánh ngang đằng nam nhà thờ.", "eng": "The south transept of the cathedral."}, {"viet": "Những người chiếm đất công được lệnh phải bỏ dinh cơ vườn tược.", "eng": "The squatters were ordered to vacate the premises."}, {"viet": "Hòn đá rơi đánh tõm trong nước.", "eng": "The stone fell plop into the water."}, {"viet": "Ánh nắng gắt đã làm bạc màu các rèm cửa.", "eng": "The strong sunlight had faded the curtains."}, {"viet": "Mặt trời chiếu qua kẽ hở trong những đám mây.", "eng": "The sun shone through a rent in the clouds."}, {"viet": "Chiếc taxi dừng lại cho ông lão xuống.", "eng": "The taxi stopped to set down an old man."}, {"viet": "Cả đội đã bị dồn vào thế phòng ngự khi đối phương tập hợp lại.", "eng": "The team was thrown on the defensive as their opponents rallied."}, {"viet": "Sau đó có năm giai đoạn: pha chế, tạo hình, nung đốt, tráng men, và trang trí.", "eng": "The there are five steps: mixing, shaping, firing, glazing, and decorating."}, {"viet": "Thời gian đã chín muồi cho một chính sách đối ngoại mới.", "eng": "The time is ripe for a new foreign policy."}, {"viet": "Đèn giao thông đã đổi ( từ đỏ sang xanh ).", "eng": "The traffic lights have changed ( from red to green )."}, {"viet": "Chiếc tàu điện bánh hơi lấy điện từ đường dây phía trên nóc xe.", "eng": "The trolley-bus picks up current from an overhead wire."}, {"viet": "Lực lượng hạt nhân của hai nước ở thế cân bằng hoàn toàn.", "eng": "The two nations'nuclear forces are in perfect counterpoise."}, {"viet": "Nghiệp đoàn đã huy động hàng nghìn công nhân phải đổi việc cắt giảm.", "eng": "The unions mobilized thousands of workers in a protest against the cut."}, {"viet": "Mặt nạn nhân bị đánh nát bét.", "eng": "The victim's face was battered to a pulp."}, {"viet": "Tên bị truy nã cho đến nay vẫn chưa sa vào lưới của cảnh sát.", "eng": "The wanted man has so far escaped the police net."}, {"viet": "Tuyến đường xa lộ chạy về phía tây.", "eng": "The westbound carriageway of the motorway."}, {"viet": "Cơn gió quét mạnh trên sân và vòng qua vòng lại.", "eng": "The wind was whipping the playground swings to and fro."}, {"viet": "Việc đó đang được giải quyết và chẳng bao lâu nữa sẽ hoàn tất.", "eng": "The work is in hand and will soon be completed."}, {"viet": "Anh chàng thanh niên đỏ bừng mặt bối rối khi anh ta đánh rắm rất to ở giữa cuộc họp.", "eng": "The young man flushed with embarrassment when his stomach rumbled loudly in the middle of the meeting."}, {"viet": "Sức khoẻ của họ suy sụp vì những năm nghèo túng.", "eng": "Their health had suffered from years of want."}, {"viet": "Vũ khí cuối cùng của họ là đe doạ tổng bãi công.", "eng": "Their ultimate weapon was the threat of an all-out strike."}, {"viet": "Về lý thuyết chúng ta vẫn có thể thắng, nhưng điều đó quả thật rất không chắc chắn.", "eng": "Theoretically we could still win, but it's very unlikely."}, {"viet": "Nếu cần thì luôn luôn có thức ăn trong tủ lạnh.", "eng": "There's always the food in the freezer if need be."}, {"viet": "Không có vấn đề gì với kiểu tóc của bạn đâu.", "eng": "There's nothing the matter with your haircut."}, {"viet": "Có bốn cảnh sát gác bên ngoài nhà tù.", "eng": "There are four police on patrol outside the prison."}, {"viet": "Một dấu hiệu cho thấy rằng, trước đây từng có một hòn đảo lớn ở Đại Tây Dương, nơi bây giờ gọi là hòn đảo Azores.", "eng": "There are some signs that there was once a large island in the Atlantic where the small Azores are now."}, {"viet": "Ít có trường hợp vượt ngục nhà tù này mà thành công.", "eng": "There have been few successful escapes from this prison."}, {"viet": "Giọng nói ông đượm đôi chút buồn.", "eng": "There is a suspicion of sadness in his voice."}, {"viet": "Trong câu lạc bộ đàn ông chiếm số đông.", "eng": "There is predominance of men in the club."}, {"viet": "Mọi người đều ùa ra phía cửa.", "eng": "There was a general movement toward the door."}, {"viet": "Không còn cách gì khác ngoài từ chức.", "eng": "There was nothing else for it but to resign."}, {"viet": "Bữa tối, chúng ta có cả thảy mười hai người.", "eng": "There were twelve of us in all for dinner."}, {"viet": "Những tiện nghi này đã làm lợi cho cả thành phố.", "eng": "These facilities have benefited the whole town."}, {"viet": "Những kết quả này chỉ xuất hiện trong những điều kiện hết sức giả tạo.", "eng": "These results appear only in very artificial conditions."}, {"viet": "Họ đang chơi bản nhạc'Con cá hồi'của Schubert soạn cho bộ năm.", "eng": "They're playing Schubert's'Trout'Quintet."}, {"viet": "Họ thi hành các nguyên tắc chỉ riêng cho những thành viên mới.", "eng": "They applied the rules to new members only."}, {"viet": "Họ đã đòi anh ta đền bù thiệt hại nhưng anh ta đã tạ sự là rất nghèo.", "eng": "They asked him to pay for the damage but he pleaded poverty."}, {"viet": "Họ cho chúng tôi đi qua đất của họ.", "eng": "They conceded us the right to cross their land."}, {"viet": "Họ đặt phịch những túi của họ xuống sàn của tôi và đi.", "eng": "They dumped their bags on my floor and left."}, {"viet": "Họ lúc nào cũng lo ngại, không yên tâm rằng mọi việc sẽ không ổn.", "eng": "They had an uneasy suspicion that all was not well."}, {"viet": "Họ hỏi về những lí do thực tế.", "eng": "They inquired as to the actual reasons."}, {"viet": "Họ có thể xây đập ngăn một con sông nhỏ không cho nó chảy vào một con mương, làm cho mương rộng hơn, sâu hơn và làm hỏng nhiều đất đai màu mỡ.", "eng": "They may dam a tiny stream flowing in a gully to keep the stream from making the gully wider and deeper and spoiling much good land."}, {"viet": "Họ tặng một số tiền cho trường cao học để tưởng nhớ con trai họ.", "eng": "They presented a sum of money to the college in memory of their son."}, {"viet": "Họ lục soát khắp nơi để tìm đứa bé mất tích.", "eng": "They searched far and wide for the missing child."}, {"viet": "Họ nghĩ rằng đó là một sự việc hơi thổi phồng khi anh ta cho mình là thiên tài.", "eng": "They thought it a bit thick when he called himself a genius."}, {"viet": "Họ bị bắt vì trong người có hai khẩu súng và một cây gậy đầu bịt cao su.", "eng": "They were arrested for possession of two guns and a cosh."}, {"viet": "Chúng là những loài bò sát khủng khiếp.", "eng": "They were the terrible reptiles."}, {"viet": "Cuộc họp chiều nay sẽ phải hoãn lại.", "eng": "This afternoon's meeting will have to be put off."}, {"viet": "Cái máy pha cà phê này có hai bộ phận có thể tháo rời.", "eng": "This coffee-maker has two removable parts."}, {"viet": "Chứng cứ này xác nhận lý lẽ của tôi là cô ấy có tội.", "eng": "This evidence supports my argument that she is guilty."}, {"viet": "Đây là một sự lăng mạ nghiêm trọng đối với số đông công dân.", "eng": "This is a serious affront to large numbers of citizens."}, {"viet": "Theo quan điểm của tôi, điều đó không thể chấp nhận được.", "eng": "This is unacceptable from my point of view."}, {"viet": "Bộ phim mới này sẽ làm hài lòng đông đảo những người hâm mộ anh ta.", "eng": "This new film will please his legions of admirers."}, {"viet": "Chương trình này có được là nhờ sự giúp đỡ của một công ty ở địa phương.", "eng": "This programme comes by courtesy of a local company."}, {"viet": "Biện pháp này làm cho việc lạm phát tồi tệ hơn.", "eng": "This step made the inflation worse."}, {"viet": "Vang này có nồng độ rượu cao.", "eng": "This wine has a high alcoholic content."}, {"viet": "Để trả lời những câu hỏi này chúng ta phải xem lịch.", "eng": "To answer questions like these we look at a calendar."}, {"viet": "Các khách du lịch chen chân trên vỉa hè làm chật ních một hiệu ăn, nhà hát, bãi biển, v. v..", "eng": "Tourists crowded the pavement crowd a restaurant, theatre, beach, etc."}, {"viet": "Khi đến nơi người nước ngoài thường thích đến phòng khách sạn của họ ngay.", "eng": "Upon arrival, foreigners usually like to go to their hotel rooms right away."}, {"viet": "Coi chừng! Hắn ta là một kẻ xảo quyệt đó.", "eng": "Watch out! He's a bit of a foxy character."}, {"viet": "Chúng ta sẽ không bao giờ đồng ý được với nhau, cho nên thôi, đừng nói gì nữa.", "eng": "We'll never agree so let's just leave it at that."}, {"viet": "Chúng tôi ra đi với rất ít ảo tưởng về đồng minh của chúng tôi.", "eng": "We're left with few illusions about our ally."}, {"viet": "Chúng ta có 500 pao, nó có đủ để làm tiền ký quỹ không?", "eng": "We've got 500 pounds, will it be enough for a deposit?"}, {"viet": "Tất cả chúng tôi đều phải tham gia vào cuộc tập chạy, không trừ ai.", "eng": "We all had to take part in the training run, with nobody excepted."}, {"viet": "Chúng tôi hân hạnh gửi đến ông ca-ta-lô mới nhất giới thiệu những sản phẩm của chúng tôi cùng với bảng báo giá và chiết khấu.", "eng": "We are pleased to send you the latest catalogue of our products with their quotations and discounts."}, {"viet": "Chúng tôi gọi điều này là tỉ giá hối đoái biến động hay tỉ giá hối đoái thả nổi.", "eng": "We call this as fluctuating exchange rate or floating exchange rate."}, {"viet": "Chúng ta không thể nhường một tấc lãnh thổ nào.", "eng": "We cannot concede any of our territory."}, {"viet": "Thực sự chúng tôi chưa đâm vào chiếc ô tô đó, nhưng cũng suýt nữa thì xảy ra tai nạn.", "eng": "We didn't actually hit the other car, but it was a close call."}, {"viet": "Chúng ta chiến đấu hoặc đầu hàng-phải chọn một trong hai khả năng đó.", "eng": "We fight, or we surrender-it's an either-or situation."}, {"viet": "Chúng ta đã không có thì giờ cân nhắc kỹ ( vấn đề ).", "eng": "We had no time to deliberate ( on the problem )."}, {"viet": "Chúng ta đã thất bại, do đó phải chịu hậu quả.", "eng": "We have failed, thus we have to take the consequences."}, {"viet": "Chúng tôi nghe tiếng cười ở căn phòng kề bên.", "eng": "We heard laughter in the adjoining room."}, {"viet": "Chúng tôi sẽ để dành bàn cho ông.", "eng": "We'll make a reservation for you."}, {"viet": "Chúng ta cần xem xét vấn đề trong tính toàn vẹn của nó.", "eng": "We must examine the problem in its entirety."}, {"viet": "Chúng ta cần cung cấp cho công nghiệp loại năng lượng mà nó có khả năng dùng được.", "eng": "We need to provide industry with power it can afford."}, {"viet": "Chúng tôi dùng vài bộ phận mới lắp lại cỗ máy.", "eng": "We rebuilt the engine using some new parts."}, {"viet": "Chúng ta phải xếp đặt mọi thứ ngăn nắp trước khi rời đi.", "eng": "We should get everything square before we leave."}, {"viet": "Chúng tôi cố gắng hết sức để san phẳng những khó khăn.", "eng": "We tried to smooth over the difficulties as best we could."}, {"viet": "Chúng ta bị cho là đã đưa hàng hoá vào trong nước một cách bất hợp pháp.", "eng": "We were alleged to have brought goods into the country illegally."}, {"viet": "Chúng tôi đang phân vân không biết nên đi hôm nay hay ngày mai.", "eng": "We were wondering whether to go today or tomorrow."}, {"viet": "À, theo hợp đồng ký kết giữa hai ngân hàng, chúng tôi sẽ hoàn lại tiền nhân danh họ cho những ngân phiếu du lịch bị mất với số tiền 1,000 đô la Mỹ đầy đủ để thay thế những ngân phiếu du lịch", "eng": "Well, according to the agreement made between the two banks, we'll refund on their behalf the lost traveler's cheques in full amount of US $ 1,000 in replacement traveler's cheques"}, {"viet": "À, cho dù anh xem nó như thế nào đi nữa thì tiến bộ cũng mang đến nhiều vấn đề.", "eng": "Well, no matter how you look at it, progress brings problems."}, {"viet": "Cách nào tốt nhất để đến Khách Sạn Đại Dương từ sân bay?", "eng": "What's the best way to get to the Ocean Hotel from the airport?"}, {"viet": "Ở nước bạn, những cửa hàng bách hóa nào có danh tiếng?", "eng": "What are the big-name department stores in your country?"}, {"viet": "Anh đã mong đợi nhận được cái gì?", "eng": "What did you expect to get?"}, {"viet": "Ở nước bạn có các đạo luật gì về súng?", "eng": "What gun laws are there in your country?"}, {"viet": "Ở nước bạn, nguyên nhân gây tử vong hàng đầu là gì?", "eng": "What is the number one cause of death in your country?"}, {"viet": "Gần nhà bạn có những gì?", "eng": "What kinds of things are near your house?"}, {"viet": "Anh đang làm nghiên cứu về những chủ đề gì vậy?", "eng": "What subject matters are you doing your research paper on?"}, {"viet": "Tôi nên gặp bạn lúc nào và ở đâu?", "eng": "When and where should I meet you?"}, {"viet": "Khi gia đình anh ta rời Luân Đôn, Tom đã dọn đến căn phòng cho thuê.", "eng": "When his family left London, Tom moved into digs."}, {"viet": "Khi bà ta ốm thì con gái bà thay mẹ đứng ra điều khiển doanh nghiệp.", "eng": "When she fell ill her daughter took over the business from her."}, {"viet": "Khi ném đi, đầu tiên chiếc bu-mê-răng sẽ bay về phía trước, quay vòng tròn trong khi bay.", "eng": "When thrown, the boomerang will first fly forward, spinning as it goes."}, {"viet": "Tôi có thể đổi đô la để lấy đồng bảng ở đâu?", "eng": "Where can I exchange my dollars for pounds?"}, {"viet": "Quốc gia nào có ảnh hưởng đến New Zealand nhiều hơn, Mỹ hay Anh quốc?", "eng": "Which country influences New Zealand more, the U. S. or the U. K.?"}, {"viet": "Anh ta quay về phía nào cũng chỉ thấy toàn là cát.", "eng": "Whichever way he turned he saw nothing but sand."}, {"viet": "Nhà văn Úc nổi tiếng nhất là ai?", "eng": "Who is the most famous Australian writer?"}, {"viet": "Theo bạn tại sao điều này có thật?", "eng": "Why do you think this is true?"}, {"viet": "Những quả phúc bồn tử dại đã giúp bọn trẻ lạc nhiều ngày trong rừng.", "eng": "Will berries sustained the children, who were lost for days in the forest."}, {"viet": "Anh bỏ hộ tôi lá thư này nhé?", "eng": "Will you post this letter for me??"}, {"viet": "Với vở kịch mới của mình, ông ta đã củng cố được địa vị nhà soạn kịch hàng đầu của đất nước.", "eng": "With his new play he has consolidated his position as the country's leading dramatist."}, {"viet": "Làm việc ở những khu nhà ổ chuột đã làm cho cô ta giáp mặt với những thực tế của cảnh nghèo khổ.", "eng": "Working in the slums brought her up against the realities of poverty."}, {"viet": "Ông muốn đổi ngoại tệ sang tiền Trung Quốc phải không?", "eng": "Would you like to change your foreign currency into Chinese money?"}, {"viet": "Thưa ông, ông vui lòng ký tên vào hóa đơn?", "eng": "Would you please sign the bill, sir?"}, {"viet": "Đồng ý, nhưng đội nào đấu với đội nào vậy?", "eng": "Yes, but which teams are playing?"}, {"viet": "Vâng, chúng tôi sẽ giữ chúng cho các vị.", "eng": "Yes, we'll hold them for you."}, {"viet": "Tôi e rằng anh sẽ phải học cách chấp nhận điều đó.", "eng": "You'll have to learn to live with it, I'm afraid."}, {"viet": "Bạn nói đúng, và tôi để ý thấy tỉ số rất sít sao, dù đội của chúng ta thường bị thua.", "eng": "You're right, and I have noticed that the scores have been very close, though our team is often defeated."}, {"viet": "Bạn sẽ không lập gia đình, đúng không?", "eng": "You are not going to get married, RIGHT?"}, {"viet": "Anh không thể nịnh tôi để tôi giúp anh được đâu!", "eng": "You can't sweet-talk me into helping you!"}, {"viet": "Anh có thể tin là trời sẽ mưa vào ngày nghỉ cuối tuần này.", "eng": "You can rely upon it that it will rain this weekend."}, {"viet": "Anh thì chẳng quan tâm đến cái gì khác ngoài đôla.", "eng": "You don't care about anything but the almighty dollar."}, {"viet": "Phải có thần kinh vững vàng mới có thể đứng nhìn các con vật bị mổ thịt.", "eng": "You have to have a strong stomach to watch animals being slaughtered."}, {"viet": "Ông có thể đổi tiền mặt giấy chứng nhận này trước đáo hạn.", "eng": "You may cash in the certificate before the maturity date."}, {"viet": "Không được ra khỏi tàu khi nó đang chạy.", "eng": "You must not get off the train when it is in motion."}, {"viet": "Chị là một đầu bếp tuyệt vời, phải vậy không?", "eng": "You're a wonderful cook, aren't you?"}, {"viet": "Anh nên nhân lúc thời tiết tốt mà sơn hàng rào đi.", "eng": "You should take advantage of the fine weather to paint the fence."}, {"viet": "Tối qua anh trằn trọc mãi trên giường.", "eng": "You were very restless in bed last night."}, {"viet": "Lý lẽ của anh không làm cô ta thay đổi ý kiến đâu: cô ta quyết tâm ra đi rồi.", "eng": "Your arguments won't sway her: she's determined to leave."}, {"viet": "Những trò đùa ác ý sẽ giáng trả lại chính anh.", "eng": "Your practical jokes will redound on you."}]