[{"viet": "Năm năm trong tù chẳng cải tạo được gì nó.", "eng": "5 years in prison had not chastened him."}, {"viet": "Một tấm thảm có những sắc nâu và cam.", "eng": "A carpet in tones of brown and orange."}, {"viet": "Một cụm mây có thể biến mất vì nước hoặc nước đá trong nó đã rơi xuống đất dưới dạng mưa hoặc tuyết.", "eng": "A clouds may disappear because the water or ice in it has fallen to the ground as rain or snow."}, {"viet": "Cú sút bóng cực mạnh dội ngay vào trụ khung thành.", "eng": "A cracking shot which hits the goal-post."}, {"viet": "Một cuốn từ điển ít có các từ Mỹ.", "eng": "A dictionary with poor coverage of American words."}, {"viet": "Một câu nói nổi tiếng của Trung Quốc đại ý như thế này ” bạn không thể được gọi là một người đàn ông thực sự nếu bạn chưa đến Vạn Lý Trường Thành ”.", "eng": "A famous Chinese saying goes like this You cannot be called a true man unless you have got on the Great Wall."}, {"viet": "Một dịch cúm lan rộng khắp trường trong nhiều tuần lễ.", "eng": "A flu epidemic raged through the school for weeks."}, {"viet": "Học vấn cao có thể là con đường dẫn đến thành công.", "eng": "A good education can be the gateway to success."}, {"viet": "Máu của người có hội chứng xuất huyết không đông lại bình thường.", "eng": "A haemophiliac's blood will not clot properly."}, {"viet": "Một căn nhà chỉ có hai mặt tường hướng ra ngoài.", "eng": "A house with only two outside walls."}, {"viet": "Con ấu trùng biến hình thành con nhộng rồi thành con bướm.", "eng": "A larva metamorphoses into a chrysalis and then into the butterfly."}, {"viet": "Mục tìm bạn bốn phương trên báo.", "eng": "A lonely hearts column in the newspaper."}, {"viet": "Một vẻ cuồng nộ trên khuôn mặt của anh ta.", "eng": "A maniacal expression on his face."}, {"viet": "Một tình yêu thương sâu sắc của người mẹ đối với các con của cô ta.", "eng": "A mother's devotion to her children."}, {"viet": "Một cảnh đêm của các đường phố đen bóng loáng và ánh đèn rực rỡ.", "eng": "A nightscape of black shiny streets and glistening light."}, {"viet": "Một sự nhấn mạnh có tính cách câu nệ mô phạm về các điều lệ.", "eng": "A pedantic insistence on the rules."}, {"viet": "Một vở kịch là một sự pha trộn giữa hài kịch và bi kịch.", "eng": "A play that is a cross between farce and tragedy."}, {"viet": "Một giải thưởng 50 bảng Anh thì không coi thường được.", "eng": "A prize of £ 50 is not to be sneezed at."}, {"viet": "Một hậu quả gây sút giảm đối với nền kinh tế.", "eng": "A recessionary effect on the economy."}, {"viet": "Một từ thô lỗ không được dùng trong xã hội thượng lưu.", "eng": "A rude word not mentioned in polite society."}, {"viet": "Một buổi lễ để tưởng nhớ những người đã chết trong chiến tranh.", "eng": "A service in remembrance of those killed in the war."}, {"viet": "Một khách sạn ở dọc xa lộ-một chỗ cho ở ghép xe hơi đậu gần phòng khách-có thể có phòng đãi tiệc cũng như là phòng ở.", "eng": "A small motel-an accommodation which permits automobile parking near the guests'rooms-may have banquet rooms as well as its accommodations."}, {"viet": "Một câu chuyện đáng ghê tởm về lòng tham và sự tham nhũng.", "eng": "A squalid tale of greed and corruption."}, {"viet": "Một khóa hè dành cho những người yêu thích âm nhạc.", "eng": "A summer school for music lovers."}, {"viet": "Một số tiền bỏ ống nhỏ nhoi 5.000 bảng Anh.", "eng": "A tidy little nest egg of £ 5,000."}, {"viet": "Một ngôi làng có những cánh đồng xanh bao quanh.", "eng": "A village girdled with green fields."}, {"viet": "Một từ có nhiều nghĩa khác biệt.", "eng": "A word with many distinct meanings."}, {"viet": "Đạt được bằng mánh khóe và lừa lọc điều mà ông ta không thể xoay xở bằng những cách trung thực.", "eng": "Achieving by craft and guile what he could not manage by honest means."}, {"viet": "Sau hiệp đầu tồi tệ, đội bóng đã phản công san bằng tỷ số trận đấu.", "eng": "After a disastrous first half the team fought back to level the match."}, {"viet": "Sau khi độc lập Ấn Độ đã được tuyên bố là một nước cộng hòa.", "eng": "After its independence Indian was proclaimed a republic."}, {"viet": "Sau buổi liên hoan không có một cái cốc nào còn lại nguyên vẹn.", "eng": "After the party, there wasn't a glass left whole."}, {"viet": "Mọi động vật, khi thở đều thải ra khí các-bô-nát đi-ô-xít ra ngoài.", "eng": "All animals, as they breathe out, throw carbon dioxide away."}, {"viet": "Tất cả các sinh viên không loại trừ một ai phải thi môn Anh văn.", "eng": "All students without exception must take the English examination."}, {"viet": "Allosaurus là một loài ăn thịt sống.", "eng": "Allosaurus was a flesh eaters."}, {"viet": "Trong những loài động vật này có con voi ma-mút và bò rừng bi-son.", "eng": "Among these animals are mammoths and bison."}, {"viet": "Một bài báo tiết lộ bí mật của giới cờ bạc chuyên nghiệp.", "eng": "An article that lifts the lid off the world of professional gambling."}, {"viet": "Một bộ phim tả chân và bạo lực, chắc chắn là không phải để cho người quá đạo đức xem.", "eng": "An explicit and violent film, definitely not for the squeamish."}, {"viet": "Một đống mảnh đồ đạc bị gãy.", "eng": "An odd assemblage of broken bits of furniture."}, {"viet": "Một niềm tin vững chắc vào tính tốt của con người.", "eng": "An unshakeable belief in the goodness of humanity."}, {"viet": "Những con vật mắc bệnh dại hay sùi bọt mép.", "eng": "Animals with rabies often froth at the mouth."}, {"viet": "Thêm một điều khoản phụ vào hợp đồng.", "eng": "Append an extra clause to the contract."}, {"viet": "Đồng lương có theo kịp lạm phát không?", "eng": "Are wages keeping pace with inflation?"}, {"viet": "Bạn có chơi ván này không?", "eng": "Are you on for this game?"}, {"viet": "Pháo binh bắn yểm trợ trong khi bộ binh tiến lên.", "eng": "Artillery gave cover while the infantry advanced."}, {"viet": "Ngay khi cầu nguyện xong, hay nếu không đọc lời cầu nguyện, khi nữ chủ nhà lấy khăn ăn thì mỗi người ngồi tại bàn mở khăn của mình ra một nửa và đặt nó ngang đùi.", "eng": "As soon as Grace is finished, or if Grace is not said, when the hostess takes her napkin, each one at the table opens his napkin in half and lays it across his lap."}, {"viet": "Các chiêm gia nói là họ có thể đoán được các ngôi sao có liên quan gì với chúng ta.", "eng": "Astrologers claim to be able to divine what the star hold in store for us."}, {"viet": "Đồng thời, ngày 1 tháng 1 được xem là của ngày năm mới.", "eng": "At the same time January 1 was made New Year's Day."}, {"viet": "Băng vết đứt để cầm máu.", "eng": "Bandage a cut to stem the bleeding."}, {"viet": "Sợ toát mồ hôi lạnh về một việc gì.", "eng": "Be in a cold sweat about something."}, {"viet": "Nhiều phụ nữ phải lo toan sự nghiệp và nuôi nấng con cái nên đã sống một cuộc đời khổ cực.", "eng": "Because they are involved in careers and mothering, many women lead exhausting lives."}, {"viet": "Hiến thân của mình cho ai.", "eng": "Bestow one's favours on somebody."}, {"viet": "Anh chị nó đều đã lập gia đình.", "eng": "Both his brother and sister are married."}, {"viet": "Rán miếng thịt vàng một mặt rồi lật nó lại rán vàng mặt bên kia.", "eng": "Brown the meat on one side, the turn it over and brown the other side."}, {"viet": "Nhưng tôi là một người bận rộn, và có cuộc hẹn lúc sáu giờ.", "eng": "But I'm a busy man, and have an appointment at six."}, {"viet": "Nhưng tôi phải đi tàu nào?", "eng": "But what train should I take?"}, {"viet": "À này, cô có thể trông chừng hành lý của tôi được không?", "eng": "By the way, can you keep an eye on my luggage?"}, {"viet": "Tôi có thể mua vé giường nằm hạng nhất trên chuyến xe lửa tốc hành đặc biệt đi Paris hôm nay không?", "eng": "Can I have a first-class berth on today's special express to Paris?"}, {"viet": "Chúng tôi có thể sử dụng sân tennis của quý vị bây giờ được không?", "eng": "Can we use your tennis court now?"}, {"viet": "Bạn có thể vặn đĩa hát mới nhất của cô ta cho tôi nghe được không?", "eng": "Can you play me her latest record?"}, {"viet": "Anh không thể làm nó sau này à?", "eng": "Can't you do it later?"}, {"viet": "Những sự thay đổi về việc ghi tên học của sinh viên đã làm biến đổi hệ thống giáo dục.", "eng": "Changes in students enrollment that have catalyzed the educational system."}, {"viet": "Chúa ơi! Chúng ta cạn sạch cả xăng rồi!", "eng": "Christ! we're running out of petrol!"}, {"viet": "So sánh ấn bản mới với ấn bản trước đây.", "eng": "Collate a new edition with an earlier one."}, {"viet": "Các nhà soạn nhạc khắp thế giới trong thế kỷ 20 đã tìm thấy cảm hứng ở nhạc Jazz xưa của Mỹ, anh biết đấy.", "eng": "Composers around the world during the 20th century found inspiration in early American Jazz, you know."}, {"viet": "Cuộc đàm luận diễn ra liên tục khi diễn giả mời mọi người thảo luận.", "eng": "Conversation flowed freely when the speaker invited discussion."}, {"viet": "Ông có thể giữ nguyên mức giá đó trong ba ngày không?", "eng": "Could you keep the offer firm for three days?"}, {"viet": "Bọn tội phạm lùng các trạm xe buýt để kiếm những thanh niên trốn tránh.", "eng": "Criminals troll bus stations for young runaways."}, {"viet": "David đá cánh cửa một cái và nó bật mở ra.", "eng": "David gave the door a kick and it flew open."}, {"viet": "Mô tả những đặc điểm chính bao quát của một kế hoạch.", "eng": "Describe a plan in broad outline."}, {"viet": "Hôm nay chị có giặt là không?", "eng": "Did you do the laundry today?"}, {"viet": "Dùng bữa ăn riêng với một người nào.", "eng": "Dine tête-à-tête with somebody."}, {"viet": "Nhớ đừng ra mưa khi con không mặc áo mưa.", "eng": "Do keep out of the rain if you haven't a coat."}, {"viet": "Anh đóng chai trái cây hay ướp lạnh?", "eng": "Do you bottle your fruit or freeze it?"}, {"viet": "Ông có rượu, thuốc lá hay nước hoa không?", "eng": "Do you have any alcoholic beverages, tobacco or perfume?"}, {"viet": "Bạn có biết karate là gì không?", "eng": "Do you know what karate is?"}, {"viet": "Thực ra có phải là em lại nằm trên chiếc giường không?", "eng": "Do you really lie on a couch?"}, {"viet": "Anh có nghĩ rằng anh sẽ gạ gẫm được cô nào ở buổi liên hoan không?", "eng": "Do you think you'll score at the party?"}, {"viet": "Giá đó tính luôn cả tiền vé máy bay, chỗ ở khách sạn và các bữa ăn phải không?", "eng": "Does the price include air fare, hotel accommodations and meals?"}, {"viet": "Đừng lo cho bọn này làm gì-chút nữa chúng tôi sẽ nhập bọn với các anh.", "eng": "Don't bother about us-We'll join you later."}, {"viet": "Đừng quấy rầy tôi trong khi tôi đang bận đây!", "eng": "Don't interrupt me while I'm busy!"}, {"viet": "Đừng nói ngay bây giờ là bạn có nhận công việc này hay không: cứ để tới ngày mai hãy quyết định.", "eng": "Don't say now if you'll take the job: sleep on it first."}, {"viet": "Đừng lo, cô ấy nói và quàng tay qua vai của anh ta.", "eng": "Don't worry, she said, putting an arm round his shoulder."}, {"viet": "Viết ít dòng cho tôi biết khi nào bạn đến.", "eng": "Drop me a line to say when you're coming."}, {"viet": "Biên tập một vở kịch Shakespeare để sử dụng trong nhà trường.", "eng": "Edit a Shakespeare play for use in schools."}, {"viet": "Nhớ hạ tấm che an toàn trước khi vận hành máy.", "eng": "Ensure the guard is in place before operating the machine."}, {"viet": "Tất cả mọi người, bất kể giàu nghèo, đều bị ảnh hưởng bởi những chuyển đổi này.", "eng": "Everyone, great and small, is affected by these changes."}, {"viet": "Xin lỗi, làm ơn đua cho tôi hoá đơn đi?", "eng": "Excuse me, may I have the bill?"}, {"viet": "Việc không chịu đóng thuế sẽ làm anh có khả năng bị truy tố.", "eng": "Failure to pay your taxes will make you liable to prosecution."}, {"viet": "Thành viên trong ban giám hiệu của Viện Đại Học Âm Nhạc Hoàng gia.", "eng": "Fellow of the Royal College of Music."}, {"viet": "Trước tiên tôi phải quyết định nên mặc quần áo gì.", "eng": "First I had to decide what to wear."}, {"viet": "Theo những điều chỉ dẫn trong cẩm nang sửa chữa xe ô tô.", "eng": "Follow the instructions in a car repair manual."}, {"viet": "Các chính phủ nước ngoài cung cấp vũ khí cho quân phiến loạn.", "eng": "Foreign governments supplying arms to the rebels."}, {"viet": "Qua những gì người ta nói mà tôi thu thập được, tôi được biết là ông ấy sẽ không đến.", "eng": "From what people said, I managed to glean that he wasn't coming."}, {"viet": "Lấy biên nhận về các khoản chi tiêu của anh.", "eng": "Get a receipt for your expenses."}, {"viet": "Chấp thuận của ai về một đề nghị.", "eng": "Give one's assent to a proposal."}, {"viet": "Hãy đi thẳng đường này và rẽ ở giao lộ.", "eng": "Go straight on this road and turn right at the intersection."}, {"viet": "Các nhóm người hâm mộ đang đi loanh quanh ở ngoài đường phố sau trận đấu đó.", "eng": "Groups of fans were milling about in the streets after the match."}, {"viet": "Nền văn minh có tiến bộ trong suốt thế kỷ này không?", "eng": "Has civilization advanced during this century?"}, {"viet": "Ông đến đây công tác phải không?", "eng": "Have you come here on business?"}, {"viet": "Các bạn có nghe chuyện ly dị của họ hay chưa?", "eng": "Have you heard about their divorce?"}, {"viet": "Anh ta đã ở trong quán rượu suốt đêm và đã bị say mềm.", "eng": "He'd been in the bar all night and was thoroughly intoxicated."}, {"viet": "Nó luôn luôn có những bình luận cạnh khoé về bề ngoài của cô ta.", "eng": "He's always making snide comments about her appearance."}, {"viet": "Anh ấy kém tôi mười lăm tuổi.,.", "eng": "He's fifteen years younger than me,."}, {"viet": "Nó không hợp với việc dạy học.", "eng": "He's not cut out for teaching."}, {"viet": "Anh ta quá nhút nhát không dám hỏi giờ một người lạ, lại càng không dám nói với một phòng đông người.", "eng": "He's too shy to ask a stranger the time, still less speak to a room full of people."}, {"viet": "Ông ta luôn đi vé hạng nhất-phí tổn không thành vấn đề.", "eng": "He always travels first class-expense is no object."}, {"viet": "Ông ta tin rằng thế giới đầy những tên ngu xuẩn.", "eng": "He believes the world is peopled with idiots."}, {"viet": "Bây giờ nó có thể đi xe đạp mà không cần đôi bánh xe chống.", "eng": "He can now ride his bike without stabilizers."}, {"viet": "Ông ấy suy nghĩ xem tương lai sẽ ra sao nếu như không có con cái.", "eng": "He contemplated what the future would be like without the children."}, {"viet": "Anh ta có được sức mạnh nhờ vào đức tin Cơ Đốc giáo của mình.", "eng": "He derives strength from his Christianity."}, {"viet": "Anh ta không thích công việc đó, nhưng lương thì hậu.", "eng": "He doesn't like the job, but the pay is good."}, {"viet": "Ông ta không phá được quả giao bóng của đối thủ.", "eng": "He failed the break his opponent's service."}, {"viet": "Trong cuộc nội chiến anh ấy đã chiến đấu vì sự nghiệp của nền cộng hoà.", "eng": "He fought for the republican cause in the civil war."}, {"viet": "Hắn quá nhiệt tình với mọi phụ nữ trẻ mà hắn gặp.", "eng": "He goes overboard about every young woman he meets."}, {"viet": "Anh ta đã gây chia rẽ giới lãnh đạo đảng.", "eng": "He had estranged the party leadership."}, {"viet": "Anh ta có kiểu cách hơi giống phụ nữ.", "eng": "He has a rather womanish manner."}, {"viet": "Ông ấy chẳng khi nào tỏ ra quan tâm đến những nhu cầu của vợ mình.", "eng": "He has never shown much consideration for his wife's needs."}, {"viet": "Anh ta lưỡng lự về chuyện nên lái xe hay là đi xe lửa.", "eng": "He hesitated about whether to drive or take the train."}, {"viet": "Anh ta nổi tiếng vừa là một nhà điêu khắc vừa là một họa sĩ vẽ chân dung.", "eng": "He is eminent as a sculptor and as a portrait painter."}, {"viet": "Hiện giờ anh ấy đang bận.", "eng": "He is tied up at the moment."}, {"viet": "Ông ta hy sinh cuộc đời mình vì sự nghiệp tự do.", "eng": "He laid down his life for the cause of freedom."}, {"viet": "Anh ta trông như thể vừa gặp ma vậy.", "eng": "He looked as if he had seen ghost."}, {"viet": "Anh ta không dám nhận mình là một chuyên gia về môn đó.", "eng": "He makes no pretensions to being a expert on the subject."}, {"viet": "Nó chẳng bao giờ nói chuyện với tôi trừ lúc cầu xin một cái gì đó.", "eng": "He never speaks to me other than to ask for something."}, {"viet": "Anh ấy chơi một điệu nhạc giựt để chúng ta có thể nhảy.", "eng": "He piped a jig so that we could dance."}, {"viet": "Nó đã kéo cháu ra khỏi nước.", "eng": "He pulled him out of the water."}, {"viet": "Anh cầm lấy bản đánh máy chính của biên nhận còn chúng tôi giữ bản đánh giấy than.", "eng": "He receive the top copy of the receipt, and we keep carbon."}, {"viet": "Hắn lùi xe đâm vào một cái cây.", "eng": "He reversed the car into a tree."}, {"viet": "Nó luôn chỉ trích bạn nó.", "eng": "He's always doing his friends down."}, {"viet": "Ngày nào anh ta sẽ trở thành người đàn ông thực thụ.", "eng": "He's got to become a man someday."}, {"viet": "Hắn ta đang giở trò lừa gạt gì đấy.", "eng": "He's pulling some sort of trick."}, {"viet": "Anh ấy lái chiếc thuyền đi giữa các hòn đảo.", "eng": "He sailed the boat between the islands."}, {"viet": "Anh ta hình như biết được khi nào thì vợ anh ấy vắng nhà bằng một khả năng ngoại cảm nào đó.", "eng": "He seems to know when his wife is away home by some kind of extra-sensory perception."}, {"viet": "Ông ấy lảng tránh vấn đề, nói rằng cái đó không thuộc trách nhiệm của mình.", "eng": "He side-stepped the issue by saying it was not part of his responsibilities."}, {"viet": "Nó nói với một thái độ khinh thị thính giả mà không khéo che đậy.", "eng": "He spoke with ill-concealed contempt for his audience."}, {"viet": "Nó lấy điệu bộ ra vẻ thách thức bằng lời nói rất xúc phạm.", "eng": "He struck an attitude of defiance with a typically hard-hitting speech."}, {"viet": "Anh ta đánh điện cho biết sẽ đến vào buổi trưa.", "eng": "He telegraphed that he would arrive about midday."}, {"viet": "Nó quan sát mọi chi tiết diện mạo của cô ta.", "eng": "He took in every detail of her appearance."}, {"viet": "Anh ấy ăn ngấu nghiến món giăm bông ngon lành.", "eng": "He tucked into the ham hungrily."}, {"viet": "Anh ta đi cùng với chúng tôi từng bước chân suốt con đường đó.", "eng": "He walked with us every step of the way."}, {"viet": "Nó là một đứa bé vụng về, lúc nào cũng lóng ngóng làm đổ vỡ mọi thứ.", "eng": "He was an awkward child, always falling over himself and breaking things."}, {"viet": "Anh ta bị chặn lại giữa bài diễn văn.", "eng": "He was choked off in the middle of his speech."}, {"viet": "Hắn ta bị cấm chuyện trò với cô ấy.", "eng": "He was forbidden to talk to her."}, {"viet": "Trước kỳ thi lấy bằng lái xe hắn ta nhấp nha nhấp nhổm cứ như ngồi trên lửa vậy.", "eng": "He was like a cat on hot bricks before his driving test."}, {"viet": "Ông ta đã nói nhiều hơn dự định vì bị khích bởi lời chế giễu của họ.", "eng": "He was provoked by their mockery to say more than he had intended."}, {"viet": "Anh ta bị bán cắt cổ với giá 5 bảng Anh.", "eng": "He was stung for £ 5."}, {"viet": "Nó thắt một chiếc cà vạt hơi loè loẹt.", "eng": "He was wearing a rather brash tie."}, {"viet": "Anh ta cứ ngồi ở bàn mà chải tóc mặc dầu anh ta biết là tôi không thích như thế.", "eng": "He will comb his hair at the table, even though he knows I don't like it."}, {"viet": "Ông giúp con người chịu đựng những nỗi đau khổ.", "eng": "He would try to help people bear their sorrows."}, {"viet": "Chào và Thưa quý ngài là những lời chào hỏi.", "eng": "Hello and Dear Sir are greetings."}, {"viet": "Quyển sách của cô ta là một sự nhại lại hài hước loại chuyện gián điệp thông thường.", "eng": "Her book is a hilarious send-up of a conventional spy story."}, {"viet": "Sự thất vọng của cô ta vì không có việc làm.", "eng": "Her despondency about having no job."}, {"viet": "Ngón tay cô lướt trên phím đàn pianô.", "eng": "Her fingers swept the keys of the piano."}, {"viet": "Ý kiến của cô ấy về cơ bản là đúng dù đôi khi cô ấy nói những điều ngớ ngẩn.", "eng": "Her ideas are fundamentally sound, even if she says silly things sometimes."}, {"viet": "Thái độ của cô ta che giấu một mối oán hận thầm kín.", "eng": "Her manner concealed a quiet resentment."}, {"viet": "Cha mẹ nàng từ chối chấp thuận việc hôn nhân đó.", "eng": "Her parents refused their consent to the marriage."}, {"viet": "Sự mỉa mai của cô ấy xúc phạm đến tự ái của anh ta.", "eng": "Her sarcasm touched his self-esteem."}, {"viet": "Lý thuyết của bà ấy đã bị trích dẫn mà không có lấy một lời cảm ơn.", "eng": "Her theory was quoted without an acknowledgement."}, {"viet": "Ở đây lịch sử và văn hoá kết hợp thật hài hoà với thiên nhiên.", "eng": "Here history and culture are so well-blended with nature."}, {"viet": "Sự thú nhận của hắn là đã ăn trộm đã giải quyết được điều bí mật.", "eng": "His admission of the theft solved the mystery."}, {"viet": "Sách của anh ta toàn là chuyện nhảm nhí.", "eng": "His book is a load of rubbish."}, {"viet": "Cuộc chuyện trò của anh ta cực kỳ vô vị.", "eng": "His conversation was vapid in the extreme."}, {"viet": "Mắt nó bắt gặp ánh phản chiếu của một khẩu súng ngắn trong bụi cây.", "eng": "His eye caught the glint of a revolver among the bushes."}, {"viet": "Thái độ thân mật của anh ta là một sự che đậy cho ý định xấu xa của anh ta.", "eng": "His friendly behaviour was a cloak for his evil intentions."}, {"viet": "Sự không kín đáo của nó đã tiếp tay cho kẻ thù để có thể lợi dụng chống lại nó.", "eng": "His indiscretions gave his enemies a handle to use against him."}, {"viet": "Cung cách của anh ấy rất giống bố.", "eng": "His mannerisms bear a strong likeness to those of his father."}, {"viet": "Những bức tranh của ông ta là một loạt biến ảo màu sắc rực rỡ.", "eng": "His paintings are a kaleidoscope of gorgeous colours."}, {"viet": "Anh ta hấp tấp nổi nóng nên đã phải gánh chịu sự tức giận của quan toà.", "eng": "His rash outburst incurred the displeasure of the judge."}, {"viet": "Bài diễn văn của ông ta đã có một hậu quả đáng tiếc vì nó đã gây ra một cuộc náo loạn.", "eng": "His speech had an unfortunate sequel, in that it caused a riot."}, {"viet": "Chi họ của gia đình chú anh ta đã di cư sang Úc.", "eng": "His uncle's branch of the family emigrated to Australia."}, {"viet": "Những chuyện tình lịch sử giúp con người thoát khỏi thực tại.", "eng": "Historical romances offer an escape from the present."}, {"viet": "Hi vọng về sự an toàn của họ đã giảm đi một cách nhanh chóng.", "eng": "Hopes for their safety are receding fast."}, {"viet": "Làm sao tôi có thể nuôi được cả một gia đình với tiền lương ít ỏi thế này?", "eng": "How can I keep a family on such a miserable wage?"}, {"viet": "Làm thế nào mà anh biết được tôi đang nghĩ cái gì? Chắc anh phải có khả năng ngoại cảm.", "eng": "How did you know what I was thinking? You must be telepathic."}, {"viet": "Đất của anh trải dài tới đâu?", "eng": "How far does your land extend?"}, {"viet": "Ông sẽ ở Trung Quốc bao lâu?", "eng": "How long will you stay in China?"}, {"viet": "Các anh đã làm xong bao nhiêu tầng rồi?", "eng": "How many stories have you finished?"}, {"viet": "Tôi phải lên lai cho nó bao nhiêu?", "eng": "How much should I shorten it?"}, {"viet": "Những số tiền khổng lồ đã được đầu tư vào dự án này.", "eng": "Huge sums have been invested in this project."}, {"viet": "Tôi muốn một ít bắp mới hái.", "eng": "I'd like some corn that's freshly picked."}, {"viet": "Tôi thà tự sát còn hơn xin lỗi hắn ta.", "eng": "I'd shoot myself before I apologized to him."}, {"viet": "Tôi có thể kiểm tra xem tôi có thể nghỉ làm không.", "eng": "I'll have to check and see if I can get time off from work."}, {"viet": "Thưa cô, tôi sẽ mang hành lý tới phòng của cô.", "eng": "I'll take your luggage to your room, Miss."}, {"viet": "Tôi luôn bị bối rối vì hạn chót đã đến gần.", "eng": "I'm always in a flurry as deadlines get nearer."}, {"viet": "Tôi định ăn ít vào buổi sáng và ăn hải sản vào buổi tối.", "eng": "I'm going to eat dim sum in the morning and eat seafood in the evening."}, {"viet": "Tôi không sẵn sàng cho cậu vay thêm tiền nữa đâu.", "eng": "I'm not about to lend you any more money."}, {"viet": "Thật là bực mình quá, tôi để quên áo khoác trên xe buýt rồi.", "eng": "I'm really hacked-off, I left my coat on the bus."}, {"viet": "Tôi dám chắc anh ta chiếm chỗ đỗ xe của tôi cất để trêu tức tôi.", "eng": "I'm sure he took my parking space just to spite me."}, {"viet": "Tôi hết sức xin lỗi đã làm anh phật ý-xin anh tha lỗi cho.", "eng": "I'm very sorry I offended you-no hard feelings."}, {"viet": "Tôi đang suy nghĩ vớ vẩn về ý tưởng dọn ra ở nước ngoài.", "eng": "I've been toying with idea of moving abroad."}, {"viet": "Tôi đã có một ngày đặc biệt đen đủi: tàu đến muộn và tôi lại đánh mất ví.", "eng": "I've had one of those days: my train was late, and I lost my wallet."}, {"viet": "Tôi đã đọc tất cả các tài liệu có trong tay về vấn đề chăn nuôi gà vịt.", "eng": "I've read all the available literature on poultry-farming."}, {"viet": "Tôi đồng ý với anh phần nào.", "eng": "I agree with you up to a point."}, {"viet": "I am là ngôi thứ nhất số ít ở thì hiện tại của động từ to be.", "eng": "I am is the first person singular of the present tense of the verb to be."}, {"viet": "Tôi xin mời tất cả quý vị có mặt cùng tôi nâng ly chúc mừng cho tình hữu nghị và sự hợp tác giữa chúng ta.", "eng": "I ask all of you present to join me in raising your glasses to the friendship and cooperation between us."}, {"viet": "Tôi đã mua một bản khắc của chiếc cầu Luân Đôn cổ.", "eng": "I bought an old engraving of London Bridge."}, {"viet": "Tôi không thể đánh giá khả năng của anh ta mà không xem việc làm của anh ta.", "eng": "I can't evaluate his ability without seeing his work."}, {"viet": "Tôi không biết bơi! Tôi cũng vậy!", "eng": "I can't swim! I can't swim either! Neither can I!"}, {"viet": "Tôi nhớ được ai làm đạo diễn phim đó, nhưng không nhớ được ai là các diễn viên nổi tiếng.", "eng": "I can remember who directed the film but not who the stars were."}, {"viet": "Tôi không thể sống nổi với 30 bảng Anh một tuần.", "eng": "I can't survive on £ 30 a week."}, {"viet": "Tôi có thể đoán được là có chuyện không hay khi nhìn vẻ mặt của họ.", "eng": "I could tell something was up by the look on their faces."}, {"viet": "Tôi muốn thuê một chiếc xe hơi.", "eng": "I'd like to rent a car."}, {"viet": "Tôi quả thực không muốn điều đó, anh ta nói với tiếng thở dài cam chịu.", "eng": "I didn't really want it anyway, he said with a resigned sigh."}, {"viet": "Tôi không có lịch nên tôi không biết ngày tháng.", "eng": "I don't have a calendar, so I don't know the date."}, {"viet": "Tôi không thích mang ngân phiếu du lịch theo.", "eng": "I don't like to bring traveller's cheques with me."}, {"viet": "Tôi không muốn họ dính mũi vào các công việc của tôi.", "eng": "I don't want them prying into my affairs."}, {"viet": "Tôi không thích thái độ của cô ta.", "eng": "I don't like her manner."}, {"viet": "Tôi hy vọng là anh nói đúng, thế nhưng tôi sẽ hỏi nó.", "eng": "I expect you're right-I'll ask him, though."}, {"viet": "Tôi cảm thấy rét buốt thấu xương.", "eng": "I felt frozen to the marrow."}, {"viet": "Tôi thấy cuốn phim đó ủy mị quá đáng.", "eng": "I found the film far too saccharine."}, {"viet": "Chân tôi vướng phải cái ghế.", "eng": "I got my fucking foot caught in the fucking chair."}, {"viet": "Tôi đã uống một ít bia và hoàn toàn mất khả năng suy nghĩ rõ ràng.", "eng": "I had had a few beers and was completely non compos mentis."}, {"viet": "Tôi không muốn làm một kẻ thuyết phục nhưng tôi quả là cần sự giúp đỡ của anh đối với dự án này.", "eng": "I hate to seem like an arm-twister, but I really need your help on this project."}, {"viet": "Tôi chỉ còn một câu hỏi nữa thôi.", "eng": "I have just one more question."}, {"viet": "Tuần này tôi có quyền sử dụng chiếc ô tô.", "eng": "I have the use of the car this week."}, {"viet": "Tôi không hề có một tí ý kiến nào về việc ai đã làm điều đó.", "eng": "I haven't the remotest idea who did it."}, {"viet": "Tôi đã giúp nó do ngộ nhận là nó cần tôi.", "eng": "I helped him in the mistaken belief that he needed me."}, {"viet": "Tôi hi vọng các ông sẽ thích.", "eng": "I hope you'll enjoy it."}, {"viet": "Tôi đã biết có vấn đề rắc rối, nhưng tôi không ngờ có điều này.", "eng": "I knew there were problems, but I was not prepared for this."}, {"viet": "Tôi thích uống một cốc sữa nóng trước khi đi ngủ.", "eng": "I like a hot milky drink at bed-time."}, {"viet": "Tôi sẽ đi cùng với Keith.", "eng": "I'll be coming with Keith."}, {"viet": "Tôi sẽ ghi nhớ điều đó.", "eng": "I'll keep that in mind."}, {"viet": "Tôi yêu miền quê, nhất là về mùa xuân.", "eng": "I love the country, especially in spring."}, {"viet": "Tôi sẽ đi xa vài ngày.", "eng": "I'm going away for a few days."}, {"viet": "Tôi ra ngoài uống một cốc với mấy người bạn.", "eng": "I'm off for a drink with my mates."}, {"viet": "Tôi thật sự đã làm hỏng kỳ thi đó.", "eng": "I made a real muck of that exam."}, {"viet": "Tôi phải mạng lại lỗ rách trong túi của tôi.", "eng": "I must darn the hole in my pocket."}, {"viet": "Tôi cần tiền có việc gấp.", "eng": "I need the money for an emergency."}, {"viet": "Tôi chỉ tình cờ đến thành phố Hồ Chí Minh.", "eng": "I only came to Ho Chi Minh City by accident."}, {"viet": "Tôi đề nghị giảm giá 4%.", "eng": "I propose a reduction of 4%."}, {"viet": "Tôi nhớ lại nhiều cử chỉ trang nhã của anh ta qua nhiều năm.", "eng": "I recall his many politenesses over the years."}, {"viet": "Tôi từ từ tỉnh dậy sau một giấc ngủ say.", "eng": "I roused slowly from a deep sleep."}, {"viet": "Hình như tôi hết thuốc rồi.", "eng": "I seem to have run out of them."}, {"viet": "Tôi đưa hộ chiếu cho người đàn ông ở cổng nhà máy và được phép vào.", "eng": "I showed my pass to the man at the factory gate, and was allowed in."}, {"viet": "Tôi đề nghị bạn tìm một căn hộ nhỏ cho riêng mình vậy.", "eng": "I suggest you look for a small flat of your own."}, {"viet": "Tôi nghĩ tôi sẽ ăn món cá phi-lê hỗn hợp.", "eng": "I think I'll have the Fillet-o-Fish combo."}, {"viet": "Hình như con chó muốn vào-tôi nghe thấy tiếng nó cào cánh cửa.", "eng": "I think the dog wants in-I can hear it scratching at the door."}, {"viet": "Tôi tưởng rằng những con số đó là đúng, song mới đây tôi nghe nói là không phải vậy.", "eng": "I thought those figures were correct, however, I have recently heard they were not."}, {"viet": "Tôi tin tưởng cô ta sẽ không thất hứa.", "eng": "I trust her not to go back on her word."}, {"viet": "Tôi vừa mới rửa ôtô cho anh.", "eng": "I've washed the car for you."}, {"viet": "Tôi muốn sống ở nơi nào đó mà không ai biết tới.", "eng": "I want to live somewhere where nobody knows me."}, {"viet": "Tôi hy vọng xe lửa sẽ đúng giờ.", "eng": "I was banking on the train being on time."}, {"viet": "Tôi đã được giới thiệu với ông chủ tịch tại bữa tiệc.", "eng": "I was introduced to the president at the party."}, {"viet": "Tôi giật mình nghe thấy tin về nó.", "eng": "I was startled to hear his news."}, {"viet": "Cách đây 2 năm tôi đã đi đến đó.", "eng": "I went there two years ago."}, {"viet": "Tôi muốn tách tôi ra khỏi những quan điểm đó.", "eng": "I wish to dissociate myself from those views."}, {"viet": "Tôi tự hỏi không biết họ có đến kịp không.", "eng": "I wonder whether they will arrive on time."}, {"viet": "Xin cho tôi đổi đồng yên lấy đồng đô la.", "eng": "I would like to exchange yen for dollars, please."}, {"viet": "Vô luận được cái gì tôi cũng không lấy anh ta.", "eng": "I wouldn't marry him for all the tea in China."}, {"viet": "Nếu ông ấy đi, ông ấy sẽ đưa má tôi theo.", "eng": "If he does, he'll take my mother."}, {"viet": "Nếu nó là loại sơn thông thường thì bạn nên quét hai lớp.", "eng": "If it were any ordinary paint you would need two coats."}, {"viet": "Nếu chúng thành công thì các vở kịch đó có thể đến nhiều thành phố khác ở khắp đất nước.", "eng": "If they are successful, they can go to many other cities throughout the country."}, {"viet": "Nếu cậu bị bắt vì tàng trữ chúng dù ít hay nhiều, cậu cũng sẽ bị phạt nặng đấy.", "eng": "If you are caught with any in your possession, you receive a huge fine."}, {"viet": "Nếu ông không thấy đỡ hơn vào ngày mốt, hãy quay lại đây.", "eng": "If you don't feel better by the day after tomorrow, come back again."}, {"viet": "Nếu mỗi tuần em để dành một ít tiền, chúng ta có thể đi nghỉ mát.", "eng": "If you save some money each week, we can go on holiday."}, {"viet": "Sức khoẻ kém cỏi đã giới hạn sức mạnh của những dự định của ông ấy.", "eng": "Ill-health conscribed the force of his intentions."}, {"viet": "Ở Anh việc giáo dục là bắt buộc giữa 5 và 16 tuổi.", "eng": "In Britain education is compulsory between the ages of 5 and 16."}, {"viet": "Vào thời tiết nóng, quần áo may bằng loại vải thoáng như cô-tôn là tốt nhất.", "eng": "In hot weather, clothes made of porous material like cotton are best."}, {"viet": "Đứng về một số phương diện, anh ta giống bố.", "eng": "In some respects, he is like his father."}, {"viet": "Ở miền Bắc Chi Lê nhiều năm trôi qua không có một giọt nước mưa.", "eng": "In the northern part of Chile several years may go by without a single drop of rain."}, {"viet": "Khi viết, danh hiệu'Doctor'được viết tắt thành'Dr'.", "eng": "In writing, the title'Doctor'is abbreviated to'Dr'."}, {"viet": "Nếu các anh có gặp cô ấy, xin chuyển cho cô ấy lời nhắn này?", "eng": "Is any of you see her, please give her the message?"}, {"viet": "Có phải cái giếng đó là nguồn gốc của tất cả các ca nhiễm trùng?", "eng": "Is that well the source of all the cases of infection?"}, {"viet": "Hành vi này có phải là điển hình của nam tính không?", "eng": "Is this behaviour typical of the male sex?"}, {"viet": "Được đi xem balê là một điều rất thú vị đối với cô ấy.", "eng": "It's a great treat for her to go to the ballet."}, {"viet": "Đó là một trong những mùa thu lạnh nhất trong nhiều năm nay.", "eng": "It's been one of coldest autumns for years."}, {"viet": "Thật khó có thể nói hết sự ghê tởm của cuộc sống trong trại tù.", "eng": "It's hard to appreciate the full horror of life in a prison camp."}, {"viet": "Cứ ân hận mãi với những sai lầm đã qua thì cũng chẳng được cái gì.", "eng": "It's no use grieving about past errors."}, {"viet": "Thật là đen đủi cho anh ta, ốm ngay khi sắp đi nghỉ.", "eng": "It's rather tough on him falling ill just as he's about to go on holiday."}, {"viet": "Từ đây đến bưu điện chưa đến một dặm.", "eng": "It's under a mile from here to the post office."}, {"viet": "Còn tuỳ theo đường nào chúng ta sẽ đi.", "eng": "It depends on which way we will take."}, {"viet": "Vứt rác nơi công cộng là phản xã hội.", "eng": "It is antisocial to leave one's litter in public places."}, {"viet": "Không phải lúc nào cũng luôn luôn có lời cho các xe buýt chạy vào Chủ nhật.", "eng": "It is not always economic for buses to run on Sundays."}, {"viet": "Có thể là chúng ta đã lỡ máy bay.", "eng": "It looks as if we're going to miss the plane."}, {"viet": "Nó là một khu vườn điển hình của Trung Quốc.", "eng": "It's a typical Chinese garden."}, {"viet": "Đó là lúc gia đình đoàn tụ.", "eng": "It's time for family reunions."}, {"viet": "Đi bất cứ đường nào anh cũng phải mất ba tiếng đồng hồ.", "eng": "It takes three hours, whichever route you take."}, {"viet": "Gọi Nữ hoàng là'dear'là một sai lầm tai hại.", "eng": "It was an egregious error to address the Queen as'dear'."}, {"viet": "Bố không cố ý mà, tha lỗi cho bố nhé.", "eng": "It was not on purpose, forgive me."}, {"viet": "Cháu rất thiếu lễ độ, tự ý ăn mà không xin phép.", "eng": "It wasn't very polite of you to serve yourself without asking."}, {"viet": "Màu sắc con sâu bướm làm cho người ta không phân biệt được nó với cành cây nó bám vào.", "eng": "Its colour makes the moth indistinguishable from the branch it rests on."}, {"viet": "John và Peter cãi nhau nhưng Mary từ chối không bị lôi kéo vào cuộc tranh luận.", "eng": "John and Peter were quarrelling bit Mary refused to get embroiled in the argument."}, {"viet": "Chỉ là những thứ chúng ta cần cho buổi đi chơi ngoài trời ngày mai thôi.", "eng": "Just things we need for the picnic tomorrow."}, {"viet": "Rời nhà ra đi là một nỗi đau chia ly khủng khiếp đối với anh ấy.", "eng": "Leaving home was a terrible wrench for him."}, {"viet": "Chúng ta hãy đi nhanh lên.", "eng": "Let's go at the double."}, {"viet": "Con người là một sinh vật tương đối mới trên mặt đất.", "eng": "Man is a comparatively new creative on the face of the Earth."}, {"viet": "Nhiều công việc trên dây chuyền sản xuất ở các nhà máy ô tô bây giờ là do người máy thực hiện.", "eng": "Many production-line tasks in car factories are now performed by robots."}, {"viet": "Sự việc không được giải quyết vì không có đối thoại giữa hai bên.", "eng": "Matters could not be solved, as there was no dialogue between two parties."}, {"viet": "Có lẽ, cô ấy sẽ quyết định không nhận công việc đó.", "eng": "Maybe, she will decide not to accept the appointment."}, {"viet": "Hầu hết những người nhập cư nói họ quen với việc bị chửi mắng.", "eng": "Most immigrants say they're used to having abuse shouted after them."}, {"viet": "Đến 3 giờ 40 ông Chu mới rảnh.", "eng": "Mr. Zhou won't be free until 3: 4."}, {"viet": "Chiếc ôtô của tôi thường hay trở chứng.", "eng": "My car is a bit temperamental."}, {"viet": "Cảm tưởng chung của tôi là anh ta có vẻ là một con người dễ chịu.", "eng": "My general impression was that he seemed a pleasant man."}, {"viet": "Cảm giác tổng thể của tôi về công việc của anh ấy là tốt.", "eng": "My overall impression of his work is good."}, {"viet": "Vợ chồng tôi rất muốn đến thăm bà ấy.", "eng": "My wife and I would very much like to visit her."}, {"viet": "Tin tức về chuyến đến thăm của Nữ hoàng làm cả thị xã xôn xao.", "eng": "News of the Queen's visit set the whole town astir."}, {"viet": "Chưa, đây là chuyến đến thăm đầu tiên của tôi.", "eng": "No, this is my first visit."}, {"viet": "Sự ồn ào của chung quanh không ngăn cản công việc.", "eng": "Noisy surroundings are not conducive to work."}, {"viet": "Ngày nay, số phụ nữ hút thuốc lá đang gia tăng.", "eng": "Nowadays, the number of female smokers is increasing."}, {"viet": "À, vui lòng quay số 3389 để liên hệ với bào lễ tân.", "eng": "Oh, please dial 3389 and contact the Front Desk."}, {"viet": "Khi ông ta chết, tước hiệu của ông ta đã được truyền cho người con trai cả.", "eng": "On his death, the title passed to his eldest son."}, {"viet": "Một nhóm được điều trị bằng loại thuốc mới, còn nhóm thứ hai thì được điều trị bằng loại thuốc cũ để làm đối chứng.", "eng": "One group was treated with the new drug, and a second group was treated with the old one as a control."}, {"viet": "Chỉ có niềm hy vọng rằng những người cứu hộ đang đến gần là cứu sống được những người thợ mỏ bị mắc kẹt.", "eng": "Only the hope that the rescuers were getting nearer sustained the trapped miners."}, {"viet": "Nhà hàng mà chúng tôi ưa thích đã chật cứng nên chúng tôi đã phải đi nơi khác.", "eng": "Our favourite restaurant was full, so we had to go elsewhere."}, {"viet": "Giờ làm việc của cơ quan chúng tôi từ 9 giờ sáng đến 5 giờ chiều.", "eng": "Our office hours are from nine to five."}, {"viet": "Ngân hàng của chúng tôi có cùng khu vực nghiệp vụ ngân hàng với Ngân hàng Nhân Dân Trung Quốc làm ngân hàng trung ương, những ngân hàng chuyên ngành và ngân hàng Thông tin làm bộ phận chính và những cơ sở tài chính khác làm những thành phần phụ.", "eng": "Ours is a banking sector with the People's Bank of China as the central bank, specialized banks and the Bank of Communications as the main body, and other financial institutions as supplements."}, {"viet": "Những người qua đường chỉ đứng nhìn khi một người bị tiến công một cách độc ác.", "eng": "Passers-by just looked on as a man was viciously attacked."}, {"viet": "So với tiêu chuẩn, mức sống ngày nay thì dân tình lúc đó rất nghèo.", "eng": "People were very poor then, by today's standard."}, {"viet": "Làm ơn cho anh ấy biết là tôi đã gọi điện.", "eng": "Please tell him that I called."}, {"viet": "Cuộc đời là chất liệu của tất cả những tiểu thuyết hay.", "eng": "Real life is the stuff of all good novels."}, {"viet": "Cần tuyển thư ký, có kinh nghiệm rất cần thiết.", "eng": "Secretary wanted, previous experience essential."}, {"viet": "Chung tham vọng là mối liên kết sinh tử giữa họ với nhau.", "eng": "Shared ambition is the vital nexus between them."}, {"viet": "Cô ta luôn luôn rất dễ phật lòng.", "eng": "She's always very quick to take offence."}, {"viet": "Cô ta có mặc cảm tự ti vì đã không học đại học.", "eng": "She's got a chip on her shoulder about not having gone to university."}, {"viet": "Cô ấy bị ám ảnh bởi một cuộc chiến tranh nữa.", "eng": "She's obsesses by the thought of another war."}, {"viet": "Cô ấy rất bận chuẩn bị cho lễ cưới.", "eng": "She's very busy with preparations for the wedding."}, {"viet": "Bà ấy giải quyết vấn đề kỉ luật với quyết tâm vốn có của mình.", "eng": "She approached the matter of discipline with her usual determination."}, {"viet": "Bà ấy có thể rất hài lòng nhìn lại sự nghiệp của mình.", "eng": "She can look back on her career with great satisfaction."}, {"viet": "Bà ấy thuộc trong số những người có tài nhất của thế hệ những nhà soạn nhạc hiện nay.", "eng": "She counts among the most gifted of the current generation of composers."}, {"viet": "Bà ta thảo luận về việc bán hàng, nhưng lướt qua vấn đề làm thế nào để tăng sản lượng.", "eng": "She discussed sales, but slid over the problem of how to increase production."}, {"viet": "Cô ta ngã ngựa và trật khớp vai.", "eng": "She fell off her horse and put her shoulder out."}, {"viet": "Bà ấy cho tôi một ít tiền mặc dù bản thân bà ấy cũng không có nhiều tiền.", "eng": "She gave me some money, although she herself didn't have much money."}, {"viet": "Cô ấy có những tình cảm trái ngược nhau về hôn nhân.", "eng": "She had ambivalent feelings about marriage."}, {"viet": "Bà ta có phần lợi tức trong sự phát triển nay mai của doanh nghiệp.", "eng": "She has a stake in the future success of the business."}, {"viet": "Trước đây bà ta đã viết nhiều tiểu luận tốt, nhưng bài này thì dưới mức bình thường.", "eng": "She has written good essays before, but this one is substandard."}, {"viet": "Cô ấy buồn chán vì bị mất việc.", "eng": "She is disconsolate over the loss of her job."}, {"viet": "Cô ấy nhảy lên bắt quả bóng trên không.", "eng": "She jumped to catch the ball in the mid-air."}, {"viet": "Bà ấy sống ở Pháp nhưng có quốc tịch Anh.", "eng": "She lives in France but has British nationality."}, {"viet": "Cô ta xoay xở giữ vững được tay lái trên băng.", "eng": "She managed to keep control of her car on the ice."}, {"viet": "Cô ấy chắc chắn thành công, rõ ràng là cô ấy cố gắng hết sức.", "eng": "She ought to succeed, goodness knows she tries hard enough."}, {"viet": "Cô ta gia tăng bất ngờ tốc độ để vượt lên những người khác.", "eng": "She put on an impressive turn of speed to overtake the others."}, {"viet": "Cô ấy là một phụ nữ có ngoại hình đẹp.", "eng": "She's a fine figure of a woman."}, {"viet": "Cô ta rất mong chúng tôi đi.", "eng": "She's keen that we should go."}, {"viet": "Cô ta ngồi co ro bên đống lửa nhỏ.", "eng": "She sat all hunched up over the small fire."}, {"viet": "Cô ấy thét to tiếng'hello'và nghe tiếng dội lại của nó.", "eng": "She shouted'hello'and listened for the echo."}, {"viet": "Suốt cả mùa hè cô ta chỉ quanh quẩn ở nhà.", "eng": "She spent the whole summer mooning about at home."}, {"viet": "Cô ta có một quan điểm có phần hẹp hòi đối với vấn đề.", "eng": "She takes a rather narrow view of the subject."}, {"viet": "Cô ta cố gắng làm cho mọi thứ nghe có vẻ cực kì quan trọng.", "eng": "She tried to make everything sound like a big deal."}, {"viet": "Cô ấy muốn làm công tác xã hội khi học xong trường cao đẳng.", "eng": "She wants to do social work when she finishes college."}, {"viet": "Cô ấy phát chán với những công việc nhà tầm thường ngày lại ngày.", "eng": "She was bored doing the trivial household tasks, day in day out."}, {"viet": "Cô ta thử bơi qua eo biển Măngsơ.", "eng": "She was going to have a bash at swimming the channel."}, {"viet": "Cô ta chỉ chịu trách nhiệm một phần về tai nạn đó.", "eng": "She was only partly responsible for the accident."}, {"viet": "Cô ấy vẫn đang quằn quại vì đau.", "eng": "She was still twisting about in pain."}, {"viet": "Cô ấy chẳng là cái thá gì trước khi kiếm được công việc ấy.", "eng": "She wasn't anybody before she got that job."}, {"viet": "Cô ấy không biết ơn những cố gắng của anh ấy.", "eng": "She won't be appreciative of his efforts."}, {"viet": "Chị ấy viết một bài trên báo nói lên cảnh khổ của những người di tản.", "eng": "She wrote an article in the newspaper highlighting the plight of the refugees."}, {"viet": "Chỉ Đại Tây Dương trên quả địa cầu.", "eng": "Show the Atlantic ocean on the globe."}, {"viet": "Từ khi chúng tôi gửi giấy mời, chúng tôi đã nhận được năm giấy nhận lời mời và một giấy từ chối.", "eng": "Since we sent out the invitation we've received five acceptance and one refusal."}, {"viet": "Những công việc làm ăn nhỏ là việc làm bấp bênh.", "eng": "Small businesses are a risky undertaking."}, {"viet": "Vậy George, hãy nói cho chúng tôi biết các cầu thủ đã chuẩn bị thế nào cho trận đấu lớn.", "eng": "So George, tell us how the players psych themselves up for the big game."}, {"viet": "Những binh lính làm nhiệm vụ canh gác trên lâu đài.", "eng": "Soldiers mounting guard over the palace."}, {"viet": "Theo nhận thức của tôi thì một vài câu nói đùa của anh ấy hơi quá, gần đi đến chỗ bất lịch sự.", "eng": "Some of his jokes are a bit too near the knuckle for my taste."}, {"viet": "Một ít cặn nhầy ở đáy thùng.", "eng": "Some sludge in the bottom of the tank."}, {"viet": "Đôi khi, nếu đủ may mắn, người ta có thể thấy một vòng rất đẹp ánh sáng màu tím và đỏ khúc xạ quanh mặt trời ở trên biển mây.", "eng": "Sometimes if lucky enough, people can see a beautiful ring of purple and red light refracted around the sun above the sea of clouds."}, {"viet": "Các nhân viên đặc biệt được đưa vào để giúp đỡ lực lượng cảnh sát chính quy.", "eng": "Specials were brought in to help the regular police force."}, {"viet": "Hãy bình tĩnh, cần gì phải tỏ vẻ hốt hoảng như vậy.", "eng": "Stay calm, there's no need to hit the panic button."}, {"viet": "Đừng phất phơ nữa, làm cho xong việc này đi!", "eng": "Stop mucking about and finish you work!"}, {"viet": "Nghiên cứu cách sinh hoạt của ong.", "eng": "Study the behaviour of infants bees."}, {"viet": "Bất thình lình, mọi người bắt đầu la hét và hát.", "eng": "Suddenly, everyone started shouting and singing."}, {"viet": "Bất ngờ là một yếu tố chính trong kế hoạch của tôi.", "eng": "Surprise is an essential component of my plan."}, {"viet": "Đảm nhận trọng trách của quyền lực tối cao.", "eng": "Take on the mantle of supreme power."}, {"viet": "Dạy dỗ trẻ nhỏ là một công việc đầy thách thức và đáng được tưởng thưởng.", "eng": "Teaching young children is a challenging and rewarding job."}, {"viet": "Lời cung khai buộc tội bị cáo.", "eng": "Testimony that incriminated the defendant."}, {"viet": "Đó có lẽ là lý do chính tại sao đạo Lạt ma đến được Bắc Kinh.", "eng": "That's probably the main reason why Lamaism reached Beijing."}, {"viet": "Câu chuyện trinh thám đó cực kì hấp dẫn mãi đến cuối chuyện chúng tôi mới biết ai là kẻ sát nhân.", "eng": "That detective story was a real nail biter-we never knew till the end who the murderer was."}, {"viet": "Âm nhạc mở to quả thực làm tôi khó chịu.", "eng": "That loud music is really getting on my nerves."}, {"viet": "Trên đỉnh tòa nhà là một phụ nữ đấy.", "eng": "That's a woman on top of the building."}, {"viet": "Chuyện đó cách đây đã lâu lắm rồi.", "eng": "That was a great while ago."}, {"viet": "Vụ tai nạn đó đã làm anh ta bị què ở chân trái.", "eng": "The accident made him lame in the left leg."}, {"viet": "Tờ quảng cáo ghi'Cần người trẻ năng động làm người bán hàng'.", "eng": "The advertisement read'Young self-starter wanted as salesperson'."}, {"viet": "Sự phân tích cho thấy trong dung dịch đó có vài grên chất thạch tín.", "eng": "The analysis showed a few grains of arsenic in the solution."}, {"viet": "Viên kiến trúc sư đã nộp đồ án xin phê duyệt.", "eng": "The architect submitted the plans for approval."}, {"viet": "Cuộc sống khổ hạnh của những thầy tu và người ẩn dật.", "eng": "The ascetic existence of monks and hermits."}, {"viet": "Số tiền bán đều dành cho công việc từ thiện.", "eng": "The avails of the sale were devoted to charity."}, {"viet": "Quả bóng đập vào tường nẩy lại rơi xuống ao.", "eng": "The ball rebounded from the wall into the pond."}, {"viet": "Đi bách bộ trong phòng.", "eng": "The bathroom is down those stairs and down the room."}, {"viet": "Chiếc ôtô lớn lướt nhẹ nhàng theo con đường đến trước cửa nhà.", "eng": "The big car swept up the drive to the front of the house."}, {"viet": "Ban giám đốc còn đang đọc cho hết các đơn xin việc.", "eng": "The board are still working their way through the applications forms."}, {"viet": "Cuốn sách được Nhà xuất bản trường Đại học in liên kết với Hội khảo cổ học.", "eng": "The book is published by the University Press in association with the Council for Archaeology."}, {"viet": "Thằng bé kêu thét lên khi cái răng của nó được nhổ ra.", "eng": "The boy let out a screech when his tooth was pulled out."}, {"viet": "Hội đồng kiểm duyệt phim ảnh Anh quốc.", "eng": "The British Board of Film Censors."}, {"viet": "Chiếc xe buýt tạt về phía lề đường.", "eng": "The bus pulled in to the side of the road."}, {"viet": "Thuyền trưởng hoàn toàn không có lỗi và trách nhiệm đối với vụ đắm tàu.", "eng": "The captain is absolved from all blame and responsibility for the shipwreck."}, {"viet": "Một chiếc xe ô tô từ từ leo lên đồi.", "eng": "The car slowly climbed the hill."}, {"viet": "Con mèo bị chiếc xe tải chẹt bẹp gí.", "eng": "The cat got run over by the lorry and squashed."}, {"viet": "Các nhà vô địch đã bị đánh bại hoàn toàn ở trận chung kết.", "eng": "The champions were completely smashed in the final."}, {"viet": "Thằng bé dán các nhãn dính có hình lên khắp các sách học của nó.", "eng": "The child had stickers all over his school books."}, {"viet": "Bọn trẻ em gây ra nhiều lộn xộn ầm ĩ.", "eng": "The children are making a lot of commotion."}, {"viet": "Lũ trẻ ùa vào xe ôtô.", "eng": "The children tumbled into the car."}, {"viet": "Chiếu bóng đã được thay thế bởi vô tuyến như một hình thức giải trí phổ biến nhất.", "eng": "The cinema has been superseded by television as the most popular form of entertainment."}, {"viet": "Chiếc đồng hồ này đánh chuông giờ, nửa giờ và mười lăm phút.", "eng": "The clock strikes the hours, the half-hours and the quarters."}, {"viet": "Ban kịch của trường đại học sắp trình diễn một vở.", "eng": "The college drama are going to put on a play."}, {"viet": "Viễn cảnh của công ty trông rõ ràng là u tối.", "eng": "The company's prospects look decidedly gloomy."}, {"viet": "Các khoang đều được điều áp hoàn toàn.", "eng": "The compartments are fully pressurized."}, {"viet": "Hoàn thành hoài bão của mình.", "eng": "The consummation of one's ambitions."}, {"viet": "Giây phút sau cùng trước cuộc bầu cử địa phương.", "eng": "The countdown to the local election."}, {"viet": "Hiện tòa án vẫn còn phải đưa ra phán quyết về vụ kiện này.", "eng": "The court has still to pass judgment in this case."}, {"viet": "Đám đông la ó phản đối vị chính khách đang đến thăm.", "eng": "The crowd gave the visiting politician quite a barracking."}, {"viet": "Phong tục và văn hoá của nước này rất khác với phong tục và văn hoá của nước ta.", "eng": "The customs and culture of the country are very different from ours."}, {"viet": "Sự sa sút của các nước giàu có phương Tây.", "eng": "The decadence of the rich Western countries."}, {"viet": "Những hành động suy đồi của nhà cầm quyền thối nát.", "eng": "The depravities of a corrupt ruler."}, {"viet": "Ông Giám đốc bây giờ đang họp.", "eng": "The Director is in conference now."}, {"viet": "Bác sĩ đã tiến hành mổ khám nghiệm thi thể.", "eng": "The doctor carried out a post-mortem on the body."}, {"viet": "Con chó đã cắn tôi nhưng không làm trầy da chảy máu.", "eng": "The dog bit me but didn't break the skin."}, {"viet": "Chiếc cửa dập một cái rầm khủng khiếp vào mặt anh ấy.", "eng": "The door struck him in the face with a terrific wham."}, {"viet": "Người hốt rác chưa thu dọn rác rưởi.", "eng": "The dustmen haven't collected the rubbish yet."}, {"viet": "Cuộc bầu cử là cuộc chạy đua sát nút.", "eng": "The election was a close-run thing."}, {"viet": "Đội Braxin chơi hay hơn hẳn đội Anh.", "eng": "The English team were totally out played by the Brazilians."}, {"viet": "Kỳ thi đó khó hơn là tôi đã dự kiến.", "eng": "The exam was more difficult than I had bargained for."}, {"viet": "Vải được bày lên giá chằng dây kim loại.", "eng": "The fabric was displayed on a wired stand."}, {"viet": "Mục thời trang, xe máy, tài chính, v. v.", "eng": "The fashion, motoring, financial, etc column."}, {"viet": "Cuốn phim làm cho tất cả chúng tôi nhấp nhỏm trên mép ghế vì hào hứng.", "eng": "The film had us all sitting on the edges of our seats with excitement."}, {"viet": "Những người lính cứu hoả được thuyết phục là ngọn lửa đã được dập tắt.", "eng": "The firemen were satisfied that the fire was out."}, {"viet": "Mục đầu tiên trong danh bạ điện thoại.", "eng": "The first listing in the telephone book."}, {"viet": "Những bông hoa được một người dấu tên gửi tặng.", "eng": "The flowers were sent by an anonymous admirer."}, {"viet": "Con cáo đã đánh lừa được người đi săn bằng cách chạy ngược trở lại.", "eng": "The fox succeeded in eluding the hunters by running back in the opposite direction."}, {"viet": "Tên thủ lĩnh nhóm tội phạm đã quyết định giết chết người điềm chỉ viên.", "eng": "The gang leader decided that informer must be taken for a ride."}, {"viet": "Mặt dịu dàng trong tính tình của cô ấy.", "eng": "The gentle side of her character."}, {"viet": "Sách Phúc Âm theo Thánh Gioan chương 9 tiết 4.", "eng": "The Gospel of St. John ch 9 v 4."}, {"viet": "Chính phủ đã giảm kinh phí phúc lợi.", "eng": "The government has reduced welfare spending."}, {"viet": "Chính phủ bị tai tiếng vì vụ bê bối đó.", "eng": "The Government was discredited by the scandal."}, {"viet": "Họ chào đón nhau như những người anh em xa nhau từ lâu.", "eng": "The greeted each other like long-lost brother."}, {"viet": "Khách trầm trồ về thức ăn.", "eng": "The guests went into rhapsodies over the food."}, {"viet": "Tuyết rơi nhiều đã cản mọi con đường tới các vùng cao nguyên.", "eng": "The heave snow has prevented all communication with the highlands."}, {"viet": "Con ngựa phóng qua hàng rào dễ dàng.", "eng": "The horse cleared the fence easily."}, {"viet": "Ngôi nhà và tất cả các tài sản trong đó.", "eng": "The house and all the possessions therein."}, {"viet": "Những đường nét của đám cây lớn in nổi bật trên bầu trời đêm.", "eng": "The huge trees were profiled against the night sky."}, {"viet": "Lề lối không thay đổi được của một người thầy thuốc.", "eng": "The inalterable routine of a physician."}, {"viet": "Sự nhét một đồng tiền vào một cái khe.", "eng": "The insertion of a coin into a slot."}, {"viet": "Cái áo khoác này ông mặc trông hợp lắm.", "eng": "The jacket looks good on you."}, {"viet": "Nước trái cây thêm hương vị cho các thức uống và tráng miệng.", "eng": "The juice adds zing to drinks and desserts."}, {"viet": "Đảng Lao động không cầm quyền vào năm 1980.", "eng": "The Labour party went out in 1980."}, {"viet": "Còn cái túi đựng quần áo cần giặt ủi thì ở ngay đằng sau cánh cửa phòng tắm.", "eng": "The laundry bag is just behind the bathroom door."}, {"viet": "Bức thư để ngỏ trên bàn giấy của anh ta.", "eng": "The letter lay open on his desk."}, {"viet": "Chất lỏng này động lại nhanh ở thời tiết lạnh.", "eng": "The liquid gels faster in cold weather."}, {"viet": "Những cảnh yêu đương trong phim hơi làm quá một chút.", "eng": "The love scenes in the film were a bit overdone."}, {"viet": "Phần đông người ta có vẻ thích xem ti-vi hơn nghe đài.", "eng": "The majority of people seem to prefer TV to radio."}, {"viet": "Sự di cư ồ ạt của những người tỵ nạn trong thời gian chiến tranh.", "eng": "The mass emigration of refugees in wartime."}, {"viet": "Cuộc họp chấm dứt nhưng câu hỏi quan trọng nhất vẫn còn chưa được đặt ra.", "eng": "The meeting ended but the all-important question remained unasked."}, {"viet": "Công việc vắt sữa được thực hiện ở đây.", "eng": "The milking is done there."}, {"viet": "Cái thời điểm mà tôi khiếp sợ đã đến.", "eng": "The moment I had been dreading had arrived."}, {"viet": "Người mẹ ôm chặt con vào lòng.", "eng": "The mother strained her child close to her breast."}, {"viet": "Những điều ghi lại huyền bí của thánh John Thánh Giá.", "eng": "The mystical writings of St John of the Cross."}, {"viet": "Luật kiểm duyệt mới là một nỗ lực nhằm bịt miệng báo chí.", "eng": "The new censorship laws are an attempt to gag the press."}, {"viet": "Chính sách mới được thông qua mặc dù bị chỉ trích dữ dội.", "eng": "The new policy was adopted in the teeth of fierce criticism."}, {"viet": "Tin tức làm cho Sở giao dịch chứng khoán bàng hoàng.", "eng": "The news sent the Stock Exchange into a panic."}, {"viet": "Tuyến xe chạy về hướng bắc của xa lộ M6.", "eng": "The northbound carriageway of the M6."}, {"viet": "Ông già ương bướng không chịu đi bệnh viện.", "eng": "The obstinate old man refused to go to hospital."}, {"viet": "Bà cụ tìm cách mở đầu máy video bối rối đến mụ cả đầu óc.", "eng": "The old lady gets in a muddle trying to work the video."}, {"viet": "Việc mở cửa gian hàng trong chợ do giấy phép của chính quyền thành phố chi phối.", "eng": "The opening of the market stall is governed by municipal fiat."}, {"viet": "Quyền sở hữu lô đất đó bị tranh chấp.", "eng": "The ownership of the land is disputed."}, {"viet": "Đảng đang tìm cách tạo ra cho công chúng một hình ảnh mới về mình trong việc chăm lo đến các tầng lớp lao động.", "eng": "The party is trying to project a new image of itself as caring for the working classes."}, {"viet": "Khuôn mẫu của các sự kiện dẫn tới chiến tranh.", "eng": "The pattern of events which led up to the war."}, {"viet": "Tiếng ồn rất khó chịu của các máy bay đang sắp hạ cánh.", "eng": "The pestilential noise of aeroplanes coming in to land."}, {"viet": "Người phi công mất khả năng điều khiển chiếc máy bay.", "eng": "The pilot lost control of the plane."}, {"viet": "Máy bay đó cất cánh mặc dù có sương mù.", "eng": "The plane took off despite the fog."}, {"viet": "Các cầu thủ được chỉ đạo phải dàn ra ngang sân.", "eng": "The players were told to string out across the field."}, {"viet": "Cảnh sát liên lạc với nhau bằng máy vô tuyến.", "eng": "The police communicate with each other by radio."}, {"viet": "Cảnh sát giữ bằng lái xe của anh ta cho đến khi điều tra xong vụ tai nạn.", "eng": "The police retained his driving license till the inquiry of the accident was over."}, {"viet": "Ông già tội nghiệp ấy đã bị sa thải hôm qua.", "eng": "The poor old sod got the sack yesterday."}, {"viet": "Những phần thực hành của khóa học.", "eng": "The practical sections of the course."}, {"viet": "Vị Tổng thống lặng lẽ nhậm chức trong lúc quần chúng đang bất mãn.", "eng": "The President rode into office on a tide of discontent."}, {"viet": "Đích thân Bà Thủ tướng đến dự hội nghị.", "eng": "The Prime Minister herself was at the meeting."}, {"viet": "Vấn đề này đã bắt đầu mang một tầm cỡ lớn.", "eng": "The problem is beginning to assume massive proportions."}, {"viet": "Sự nhân giống cây từ những cành chiết.", "eng": "The propagation of plants from cuttings."}, {"viet": "Mấy con chó con đang lăn lộn trên sàn nhà.", "eng": "The puppies were tumbling about on the floor."}, {"viet": "Cuộc chạy thi là một thắng lợi hoàn toàn đối với nước Đức-họ về nhất nhì, và ba.", "eng": "The race was a clean sweep for Germany-They finished first, second, and third."}, {"viet": "Những nguyên nhân để gây giống một vài loài chó cũng kỳ cục.", "eng": "The reasons for developing some kinds of dogs are rather odd."}, {"viet": "Tiền thuê là 80 pao kể cả tiền sưởi.", "eng": "The rent is 80 inclusive of heating charges."}, {"viet": "Những kết quả mà Công ty Điện tử Jones thu được rất ấn tượng.", "eng": "The results obtained by Jones Electronics are quite impressive."}, {"viet": "Con sông rộng có bề rộng nửa dặm.", "eng": "The river is half a mile across."}, {"viet": "Những lời nói vớ vẩn luôn luôn bán được mỹ phẩm của phụ nữ.", "eng": "The romantic hooey that always sold women's cosmetics."}, {"viet": "Tin đồn về vụ tấn công sau đó đã được khẳng định.", "eng": "The rumours of an attack were later confirmed."}, {"viet": "Lớp da đầy vảy của con rắn.", "eng": "The scaly skin of the snake."}, {"viet": "Chữ viết trên giấy trả lời không rõ ràng.", "eng": "The script on the answer paper was not legible."}, {"viet": "Viên trung sĩ quát lớn một mệnh lệnh ( cho binh sĩ của anh ta ).", "eng": "The sergeant bawled a command ( to his men )."}, {"viet": "Con tàu nặng nhọc trườn trên biển động.", "eng": "The ship laboured through the rough seas."}, {"viet": "Các cửa hàng đang lợi dụng tình trạng thiếu tạm thời để nâng giá lên.", "eng": "The shops are cashing in on temporary shortages by raising prices."}, {"viet": "Nơi xây khách sạn mới là bên bờ biển.", "eng": "The site of the new hotel is by the sea."}, {"viet": "Khi chúng tôi đến con rắn trườn đi mất vào đám cỏ.", "eng": "The snake slithered off into the grass as we approached."}, {"viet": "Những thuộc tính làm dịu đau của thuốc mỡ.", "eng": "The soothing properties of an ointment."}, {"viet": "Từ điển chính tả là một thứ sách tham khảo đối với mọi người thư ký.", "eng": "The spelling dictionary is a vade-mecum for all secretaries."}, {"viet": "Tiếng mưa lộp độp không ngớt trên các mái tôn.", "eng": "The steady drumming of the rain on the tin roofs."}, {"viet": "Phố xá được treo cờ để kỷ niệm đám cưới nhà vua.", "eng": "The streets were flagged to celebrate the royal wedding."}, {"viet": "Đường ở trong lọ đường của chúng ta được cấu tạo bởi các tinh thể nhỏ hơn.", "eng": "The sugar in our bowls is made of smaller crystals."}, {"viet": "Những chiếc bàn này được cố định vững chắc trên sàn.", "eng": "The tables are firmly fixed to the floor."}, {"viet": "Thầy giáo bị làm gián đoạn giữa buổi học.", "eng": "The teacher was interrupted in the midst of a lesson."}, {"viet": "Bọn khủng bố đang giữ ba người làm con tin.", "eng": "The terrorists are holding three men hostage."}, {"viet": "Ngai vàng đã chuyển sang cho con gái nhà vua.", "eng": "The throne passed to the king'daughter."}, {"viet": "Thị xã này được chọn làm khu vực phát triển.", "eng": "The town has been designated as a development area."}, {"viet": "Viên thủ quỹ đã làm rối beng sổ sách kế toán của hội quá nhiều đến nỗi phải bị sa thải.", "eng": "The treasurer screwed up the accounts of the society so badly that he had to be fired."}, {"viet": "Hai tên tội phạm đã cấu kết với nhau.", "eng": "The two criminals were in cahoots."}, {"viet": "Tin thất bại bất ngờ đã tới như tiếng sét đánh.", "eng": "The unexpected defeat came as a thunderbolt."}, {"viet": "Lớp véc-ni phải mất một vài phút mới cứng lại.", "eng": "The varnish takes a few minutes to harden."}, {"viet": "Nhân viên phục vụ yêu cầu thực khách xếp hàng đợi.", "eng": "The waiter asks the diners to wait in line."}, {"viet": "Buổi dự báo thời tiết được tiếp nối bằng những tiếng píp, píp vào lúc 6 giờ.", "eng": "The weather forecast is followed by the pips at 6 o'clock."}, {"viet": "Sự tàn sát hàng loạt những người vô tội.", "eng": "The wholesale slaughter of innocent people."}, {"viet": "Từ đồ chó đẻ thường được dùng như một lời xỉ vả.", "eng": "The word'bastard'is often used as a term of abuse."}, {"viet": "Bản ghi chép viết tay về cuộc nói chuyện của chúng ta không khớp với những điều thực tế đã nói.", "eng": "The written record of our conversation doesn't correspond with what was actually said."}, {"viet": "Chính sách kinh tế của họ là hướng vào việc giảm bớt chi phí.", "eng": "Their economic policy is moving in the direction of retrenchment."}, {"viet": "Lời chối từ của họ đặt chúng ta vào tình thế khó khăn.", "eng": "Their refusal puts us in a difficult position."}, {"viet": "Cũng có hai phòng để làm việc.", "eng": "Then there are two rooms for working."}, {"viet": "Có một quán rượu ở cuối đường.", "eng": "There's a pub at the bottom of the road."}, {"viet": "Không có mảy may sự thật nào trong câu chuyện của cô ta.", "eng": "There's not a particle of truth in her story."}, {"viet": "Trong cơ thể con người có hàng tỷ tế bào.", "eng": "There are billions of cells in a person's body."}, {"viet": "Có những phòng riêng biệt giành cho các sĩ quan cấp cao và cấp thấp.", "eng": "There are separate rooms for senior officers."}, {"viet": "Tình cờ tối nay có một trận bóng rổ giữa đội New York Knicks và Los Angeles Lakers.", "eng": "There happen to be a basketball match between New York Knicks and Los Angeles Lakers tonight."}, {"viet": "Còn nhiều chỗ ở khoang hạng nhất.", "eng": "There is a lot more space in first class."}, {"viet": "Không ai biết lúc nào thì chiến tranh chấm dứt.", "eng": "There is no saying when the war will end."}, {"viet": "Hình như lúc này thiếu những cầu thủ trẻ giỏi.", "eng": "There seems to be a dearth of good young players at the moment."}, {"viet": "Có sự bất mãn chống đối ngấm ngầm không chấp thuận kế hoạch đề xuất.", "eng": "There was an undercurrent resentment their acceptance of the plan."}, {"viet": "Có hơn 100 cảnh sát làm nhiệm vụ ở chỗ biểu tình.", "eng": "There were over 100 police on duty at the demonstration."}, {"viet": "Những cái hòm này nặng như cối đá-anh để cái gì ở trong thế?", "eng": "These cases weigh a ton-what have you got in them?"}, {"viet": "Mấy trang giấy này dính vào nhau-tôi không sao tách ra được.", "eng": "These pages are stuck together-I can't pull them apart."}, {"viet": "Họ cho là nó không có tội nhưng đó chỉ là chuyện phỉnh phờ thôi.", "eng": "They're claiming that he's not guilty but that's just a snow job."}, {"viet": "Họ bỏ lại đất đai, tài sản cho quân xâm lược.", "eng": "They abandoned their lands and property to the invading forces."}, {"viet": "Họ vẫn đợi mặc dù ngày càng sốt ruột.", "eng": "They are still waiting, albeit with growing impatience."}, {"viet": "Họ không thể chịu trách nhiệm đối với cái họ làm.", "eng": "They cannot be held accountable for what they did."}, {"viet": "Họ tập thể dục để phát triển cơ bắp.", "eng": "They do exercises to develop then muscles."}, {"viet": "Họ cho tôi một tuần để quyết định.", "eng": "They gave me a week to make up my mind."}, {"viet": "Họ đã trình bày yêu sách đòi bồi thường.", "eng": "They have put in a claim for compensation."}, {"viet": "Họ bắn súng máy vào những toán quân đang tiến lên.", "eng": "They machine-gunned the advancing troops."}, {"viet": "Họ đã thấy chiếc du thuyền trên màn ra đa.", "eng": "They picked up the yacht on their radar screen."}, {"viet": "Họ ngồi uống rượu và nói những chuyện đùa nhảm nhí.", "eng": "They sat drinking and telling dirty jokes."}, {"viet": "Họ buộc trang bị của họ ( vào lưng ).", "eng": "They strapped their equipment on ( to their backs )."}, {"viet": "Họ vào các hang động và các khe nứt lớn của các sông băng.", "eng": "They went into caves and into the great cracks is glaciers."}, {"viet": "Họ đứng sát bờ vực một cách nguy hiểm.", "eng": "They were perilously close to the edge of the precipice."}, {"viet": "Tình hình đã đến chỗ khá buồn khi bọn trẻ con phải tự làm lấy các bữa ăn của chúng.", "eng": "Things have come to a pretty pass when the children have to prepare their own meals."}, {"viet": "Lớp nước bóng ở xe hơi này là lớp sơn bảo vệ có hiệu quả chống gỉ.", "eng": "This car of polish is an effective shield against rust."}, {"viet": "Phát minh hẳn có tác dụng trong việc điều trị bệnh tim.", "eng": "This discovery was to have a major effect on the treatment of heart disease."}, {"viet": "Vụ này đã làm cho người ta có ý thức rõ hơn về cuộc khủng hoảng kinh tế.", "eng": "This incident has sharpened public awareness of the economic crisis."}, {"viet": "Đoạn này là đoạn hay nhất mà lại.", "eng": "This is the most interesting part."}, {"viet": "Vấn đề này hết sức quan trọng.", "eng": "This matter is of paramount importance."}, {"viet": "Bức tranh này là vật quý giá nhất trong bộ sưu tập.", "eng": "This picture is the gem of the collection."}, {"viet": "Cửa hàng này có thể cung cấp mọi nhu cầu của bạn.", "eng": "This shop can supply all your requirements."}, {"viet": "Chiếc lọ này hẳn là sẽ hoàn hảo nếu không vì một vài vết rạn nhỏ ở dưới đáy.", "eng": "This vase would be perfect but for a few small flaws in its base."}, {"viet": "Tuy bề ngoài trông không dễ thương, nhưng anh ta cực kỳ thông minh.", "eng": "Though unprepossessing to look at he is highly intelligent."}, {"viet": "Tom hiếm khi được mẹ hoàn toàn chăm lo riêng cho nó.", "eng": "Tom seldom got his mother's undivided attention."}, {"viet": "Do ảnh hưởng của ma tuý, đầu óc tôi đầy những hình ảnh kỳ quái.", "eng": "Under the influence of the drug my mind was filled with surreal images."}, {"viet": "Tìm việc làm ở Nhật Bản có khó không?", "eng": "Was it difficult to find a job in Japan?"}, {"viet": "Để thay đổi, hôm nay chúng tôi sẽ dùng món ăn Trung Quốc.", "eng": "We'll have Chinese food for a change today."}, {"viet": "Chúng tôi định năm nay đi nghỉ ở xứ Wales.", "eng": "We're going to spend our holidays in Wales this year."}, {"viet": "Chúng tôi đã đếm từng ngày để được gặp ông.", "eng": "We've been counting the days to seeing you."}, {"viet": "Chúng tôi đã mở một thư tín dụng để trả cho ông.", "eng": "We've already opened a letter of credit in your favour."}, {"viet": "Chúng tôi sắp giảm bớt số cây phải chặt hạ.", "eng": "We are going to scale down the number of trees being felled."}, {"viet": "Chúng tôi bắt đầu thấy hé mở về một giải pháp cho vấn đề.", "eng": "We begin to see the glimmerings of a solution to the problem."}, {"viet": "Chúng ta có thể nghe dự báo có bão thông qua đài.", "eng": "We can listen to storm warning by radio."}, {"viet": "Chúng ta liên tưởng tên Oxford với những ý nghĩ uyên bác.", "eng": "We couple the name of Oxford with the idea of learning."}, {"viet": "Chúng tôi kết thúc bữa ăn bằng cà phê và rượu mạnh.", "eng": "We ended off the meal with coffee and brandy."}, {"viet": "Chúng tôi phải chạy đua để sửa nhà trước mùa đông.", "eng": "We had a race to repair the house before winter."}, {"viet": "Tất cả chúng ta đều chịu tác động của việc nuôi dạy.", "eng": "We have all been conditioned by our upbringing."}, {"viet": "Chúng tôi phải có mọi thứ chúng tôi cần trên con tàu này.", "eng": "We have to have everything we need on board the ship."}, {"viet": "Chúng tôi để con chó ở ngoài đêm qua nhưng nó không sao hết.", "eng": "We left the dog outside last night but she came to no harm."}, {"viet": "Chúng ta phải cử người nào đó làm thư ký.", "eng": "We must appoint sb to act as secretary."}, {"viet": "Chúng tôi gần như chết cóng trên núi lạnh.", "eng": "We nearly died of exposure on the cold mountain."}, {"viet": "Chúng tôi nhốt chó vào cũi khi đi nghỉ lễ.", "eng": "We put the dog into kennels when we go on holiday."}, {"viet": "Chúng ta sẽ phải lập chương trình giảng dạy mới cho năm thứ ba.", "eng": "We shall have to design a new curriculum for the third year."}, {"viet": "Chúng tôi nói với anh khả năng nào có thể thực hiện được.", "eng": "We tell you what possibilities there are."}, {"viet": "Chúng tôi xin chào mừng quý khách đã lên chuyến bay đi Southampton.", "eng": "We welcome you on board this flight to Southampton."}, {"viet": "Chúng tôi ngồi ở chỗ gió lùa gần cửa ra.", "eng": "We were sitting in a draughty position near the door."}, {"viet": "Chính quyền yếu, bất lực, tham nhũng, v. v.", "eng": "Weak, ineffectual, corrupt, etc government."}, {"viet": "À, tôi muốn đổi một số chi phiếu du lịch thành tiền mặt.", "eng": "Well, I want to cash some traveler's cheques."}, {"viet": "Chúng tôi đang tiến hành một cuộc thăm dò giữa những người vừa ra trường.", "eng": "Were conducting a poll among school leavers."}, {"viet": "Con chó con xinh quá! Nó là đực hay cái đấy?", "eng": "What a sweet puppy! Is it a he or a she?"}, {"viet": "Những thành phố nào trên thế giới khét tiếng về tỉ lệ tội phạm cao?", "eng": "What cities in the world are notorious for having a high crime rate?"}, {"viet": "Phần tiền thưởng của anh tổng cộng là bao nhiêu.", "eng": "What does your share of the bonus work out."}, {"viet": "Khoảng cách từ London đến Glasgow là bao nhiêu?", "eng": "What is the distance between London and Glasgow?"}, {"viet": "Ông có loại tiền tệ gì?", "eng": "What kind of currency have you got?"}, {"viet": "Loại phim yêu thích của bạn là gì?", "eng": "What's your favourite type of movie?"}, {"viet": "Anh bảo phải làm gì để tẩy sạch các vết mực?", "eng": "What would you recommend for removing ink stains?"}, {"viet": "Khi anh ta bị đụng xe, tất cả dự định đi du lịch tiêu tan thành mây khói.", "eng": "When he crashed his car, all his travel plans went up in smoke."}, {"viet": "Khi nói tới việc thết tiệc thì không ai có thể sánh với nhà Anderson.", "eng": "When it came to giving a good party, no one could hold a candle to Andersons."}, {"viet": "Khi ống nước bị vỡ, cô ấy đã thông minh biết khoá nước đường ống chính lại.", "eng": "When the water pipe burst, she had the intelligence to turn off the water at the main."}, {"viet": "Mỗi lần cô ấy đến, cô ấy đều đưa theo một người bạn.", "eng": "Whenever she comes, she brings a friend."}, {"viet": "Ông sẽ ở lại nơi đâu?", "eng": "Where will you be staying at?"}, {"viet": "Tôi sẽ lên tàu ở sân ga nào vậy?", "eng": "Which platform shall I get on board, please?"}, {"viet": "Anh đi đại tiệc với ai vậy?", "eng": "Who are you going to the party with??"}, {"viet": "Sao anh lại lục lọi giấy tờ của tôi?", "eng": "Why are you poking about among my papers?"}, {"viet": "Sao ông không đặt hàng thử để thăm dò tiềm năng thị trường?", "eng": "Why not place a trial order to sound out the market potential?"}, {"viet": "Anh làm một cốc chứ Vâng, xin phép ông'( Tôi không có lý do gì để phản đối nếu tôi uống ).", "eng": "Will you have a drink I don't mind if I do ( ie: Yes, please )."}, {"viet": "Một tiếng thở dài nhẹ nhõm, buồn rầu, khoan khoái.", "eng": "With a sigh of relief, sadness, pleasure."}, {"viet": "Lời nói không thể mô tả được vẻ đẹp của cảnh vật.", "eng": "Words cannot describe the beauty of the scene."}, {"viet": "Ông có muốn dùng đường không ạ?", "eng": "Would you like it with sugar?"}, {"viet": "Cô vui lòng hỏi xem khi nào thì ông ấy rảnh?", "eng": "Would you please ask when he'll be free?"}, {"viet": "Dạ phải, đúng vậy nhưng có khi cháu cũng đạp xe đi học.", "eng": "Yeah, that's right but there are times when I ride my bicycle to school."}, {"viet": "Vâng, không phải lúc nào cô ấy cũng nhẹ cân như vậy.", "eng": "Yes, she wasn't always this light."}, {"viet": "Anh sẽ thấy là rất khó có thể buộc anh ta đồng ý với ( việc phát ) giá.", "eng": "You'll find it difficult to pin him down to ( naming ) a price."}, {"viet": "Anh đang tự đánh lừa mình nếu anh cứ tiếp tục tin rằng cô ấy yêu anh.", "eng": "You're just deceiving yourself if you carry on believing that she loves you."}, {"viet": "Trong bài nói của ông có ám chỉ đến một vài diễn biến-chính xác ý ông muốn nói gì?", "eng": "You alluded to certain developments in your speech-what exactly did you mean?"}, {"viet": "Anh không thể độc chiếm hoàn toàn chiếc xe-tôi thỉnh thoảng cũng cần dùng nó.", "eng": "You can't have a complete monopoly of the car-I need to use it occasionally."}, {"viet": "Anh có thể nhận lại hồ sơ của anh sau khi chúng tôi đã kiểm tra.", "eng": "You can have your files back after we've checked them."}, {"viet": "Tốt hơn là con nên đi đến nha sĩ khám.", "eng": "You'd better go to the dentist."}, {"viet": "Bạn chẳng có lý do gì để phàn nàn cả.", "eng": "You have no cause for complaint."}, {"viet": "Lúc nào đó anh sẽ phải đến đây chơi nhé.", "eng": "You'll have to come over sometime."}, {"viet": "Ông nên tha thứ cho sự thiếu kinh nghiệm của tôi trong những chuyện này.", "eng": "You must forgive my inexperience in these matters."}, {"viet": "Anh cần phải hăng hái hơn trong khi chơi.", "eng": "You need to put more zing into your playing."}, {"viet": "Giá mà anh nhìn thấy Julia và Dan trong bữa tiệc nhỉ-họ hôn hít sờ mó nhau suốt.", "eng": "You should have seen Julia and Dan at the party-they were all over each other."}, {"viet": "Anh đã hiểu tình hình rồi, tôi không cần nói thêm chi tiết nữa.", "eng": "You understand the situation, I needn't elaborate any further."}, {"viet": "Anh nên chờ đợi sẽ có sự bất đồng ý kiến mạnh mẽ về vấn đề này.", "eng": "You would expect that there to be strong disagreement about this."}, {"viet": "Tất cả hành lý của các vị sẽ được mang xuống lúc 7 giờ.", "eng": "Your luggage will be collected0'at 7: 00."}]