[{"viet": "Một ít cỏ dại thì cũng chẳng hại gì cho khu vườn này.", "eng": "A bit of weeding wouldn't hurt this garden."}, {"viet": "Một tấm séc được tiếp ký ở mặt sau.", "eng": "A cheque countersigned on the back."}, {"viet": "Ban hòa giải giúp dàn xếp mối bất hòa giữa giới chủ và công nhân.", "eng": "A conciliation service helps to settle disputes between employers and workers."}, {"viet": "Một ngày nắng đôi lúc có mưa rào rải rác.", "eng": "A day of sunshine interspersed with occasional showers."}, {"viet": "Một liều của thứ thuốc này sẽ xổ ruột mày đấy!", "eng": "A dose of this stuff will purge you!"}, {"viet": "Một người chống đối kịch liệt vũ khí hạt nhân.", "eng": "A fierce opponent of nuclear arms."}, {"viet": "Một đám tang là một nghi lễ sầu thảm.", "eng": "A funeral is a melancholy occasion."}, {"viet": "Một đám rất đông người đã đến.", "eng": "A great crowded had turned up."}, {"viet": "Một ngọn núi cao nhô lên giữa hai thung lũng.", "eng": "A high mountain rises between the two valleys."}, {"viet": "Áo chui cổ toàn len mới nguyên.", "eng": "A jumper of pure new virgin wool."}, {"viet": "Một thư viện được phân thành khu theo chủ đề.", "eng": "A library sectioned into subject areas."}, {"viet": "Một cái máy dán nhãn vào các chai rượu vang.", "eng": "A machine for labelling wine bottles."}, {"viet": "Một cái đèn sử dụng hơi thủy ngân chẳng hạn, tỏa ra loại ánh sáng trong đó không có các tia màu đỏ.", "eng": "A mercury vapor lamp, for instance, gives off light with no red rays in it."}, {"viet": "Một cách giải quyết vấn đề mới và độc đáo.", "eng": "A new and refreshing approach to a problem."}, {"viet": "Bán cho một gói ống hút đi!", "eng": "A packet of drinking straws, please!"}, {"viet": "Một người không có khả năng định hướng.", "eng": "A person with no sense of direction."}, {"viet": "Một mối nối kém làm cho thỉnh thoảng mất điện.", "eng": "A poor contact causes power to fail occasionally."}, {"viet": "Một catalô của nhà xuất bản với các trang mẫu của một cuốn sách.", "eng": "A publisher's catalogue with specimen pages of a book."}, {"viet": "Một sự lỡ lời, sự tiết lộ, lời phê bình làm lộ bí mật.", "eng": "A revealing slip of the tongue, disclosure, comment."}, {"viet": "Khả năng quan sát của một nhà khoa học phải rất tinh tường.", "eng": "A scientist's observation should be very good."}, {"viet": "Ảnh chụp một chính khách đang đọc diễn văn.", "eng": "A shot of the politician making a speech."}, {"viet": "Một quân nhân không tuân lệnh các lệnh trừng phạt nghiêm khắc.", "eng": "A soldier who doesn't obey his orders will be in serious trouble."}, {"viet": "Một nét huyền diệu xuyên suốt những áng thơ của ông ta.", "eng": "A strain of mysticism runs through his poetry."}, {"viet": "Một giáo viên có thể khuyến khích học trò của mình học tập siêng năng hơn.", "eng": "A teacher who can motivate her pupils to work harder."}, {"viet": "Một cuộc chạy đua tay ba trong một kỳ bầu cử.", "eng": "A triangular contest in an election."}, {"viet": "Một tuần sau sự gia nhập vào quân đội của anh ta, anh ta đã bị ốm.", "eng": "A week after his admission into the army, he fell ill."}, {"viet": "Cách đây khoảng 250 năm, các nhà chế tạo đồng hồ bắt đầu dùng đá quí để làm chúng chạy tốt hơn.", "eng": "About 250 years ago watchmakers began using jewels inside watches to make them run better."}, {"viet": "Rắc thêm một ít lá ngải dấm khô.", "eng": "Add a sprinkling of dried tarragon."}, {"viet": "Sau một năm bạn có bằng cấp.", "eng": "After a year you get a certificate."}, {"viet": "Sau khi rang chín, phần da mỏng của hột nứt ra và bị thổi bay đi.", "eng": "After roasting, the thin skins of the beans are cracked off and blown away."}, {"viet": "Sau khi con ủi xong, hãy treo những cái áo sơ-mi đó lên để nó không bị nhăn.", "eng": "After you're done, hang the shins up so they don't get wrinkled."}, {"viet": "Tất cả các loài sinh vật-sư tử, bướm, cỏ, cây, chó và con người cùng tất cả mọi sự sống khác-đều do tế bào cấu thành.", "eng": "All living things-lions, butterflies, grass, elm trees, dogs, people and everything else alive-are built of cells."}, {"viet": "Mọi viên chức đều phải được bầu.", "eng": "All the office bearers have to be elected."}, {"viet": "Nếu nói đúng nghĩa về pháp lý thì có thể là anh không nói dối, nhưng chắc chắc anh đã không cho chúng tôi biết sự thật.", "eng": "Although technically speaking you may not have lied, you certainly haven't told us the whole truth."}, {"viet": "Một cuộc trình diễn nhào lộn máy bay ngoạn mục tại cuộc triển lãm hàng không.", "eng": "An aerobatic spectacular at the air show."}, {"viet": "Một cách xử lý có hiệu quả đối với bệnh gỗ khô mục.", "eng": "An effective treatment for dry rot."}, {"viet": "Một sự gia tăng gần 50% so với năm ngoái.", "eng": "An increase of nearly 50% on last year."}, {"viet": "Một cuộc giải phẫu cắt hai buồng trứng hư.", "eng": "An operation to remove diseased ovaries."}, {"viet": "Và đó vẫn là ý kiến của tôi, dù có giá trị hay không.", "eng": "And that's my opinion, for what it's worth."}, {"viet": "Trả lời các điều buộc tội với một lối biện hộ thản nhiên.", "eng": "Answered the charges with an unimpassioned defense."}, {"viet": "Các công ty phải cung cấp các lợi ích về y tế cho nhân viên của họ phải không?", "eng": "Are companies required to provide medical benefits to their employees?"}, {"viet": "Anh định bỏ rơi chúng tôi sao?", "eng": "Are you depriving us of your company?"}, {"viet": "Bạn giải toán rất tài phải không?", "eng": "Are you very good at solving math problems?"}, {"viet": "Vì là một người trong cuộc tôi không được phép bỏ phiếu.", "eng": "As an interested party, I was not allowed to vote."}, {"viet": "Trí nhớ của tôi dường như kém dần theo thời gian.", "eng": "As time goes by my memory seems to get worse."}, {"viet": "Cuối cùng ông rời gia đình và bắt đầu dạy dỗ người khác cách sống tốt đẹp hơn.", "eng": "At last he left his family and started out to teach others how to live better lives."}, {"viet": "Sự tham dự mọi cuộc họp điều bắt buộc.", "eng": "Attendance is mandatory at all meetings."}, {"viet": "Bị sa lầy trong những thủ tục quan liêu rắc rối.", "eng": "Be bogged down in a morass of bureaucratic procedures."}, {"viet": "Quyết tâm trong những đòi hỏi của mình cho nền hòa bình.", "eng": "Be resolute in one's demands for peace."}, {"viet": "Thuyết hành vi và tất cả các học thuyết khác của thế kỉ 20.", "eng": "Behaviourism and all the other isms of the twentieth century."}, {"viet": "Cà phê đen để lại vị đắng ở miệng.", "eng": "Black coffee leaves a bitter taste in the mouth."}, {"viet": "Kiểu vẽ hình học rực rỡ làm tấm vải đó trông nổi bật hẳn lên.", "eng": "Bright geometrics enhance the appearance of the cloth."}, {"viet": "Các xe buýt đi Oxford nửa giờ chạy một chuyến.", "eng": "Buses to Oxford run every half hour."}, {"viet": "Nhưng phần lớn các gia đình ở Mỹ đều có mái sấy khô, vì vậy không cần loại bột giặt đó.", "eng": "But most homes in America have a dryer, so there is no need for it."}, {"viet": "Mua cái gì trên thị trường chợ đen.", "eng": "Buy something on the black market."}, {"viet": "Trong vần chữ cái C liền sau B.", "eng": "C comes after B in the alphabet."}, {"viet": "Tôi có thể chở bạn ra ga được không?", "eng": "Can I run you to the station?"}, {"viet": "Bạn có thể mua cho tôi một vé được không?", "eng": "Can you get a ticket for me?"}, {"viet": "Anh có thể dành cho tôi vài phút được không?", "eng": "Can you spare me a few minutes of your time?"}, {"viet": "Thi hành triệt để một mệnh lệnh.", "eng": "Carry out an order to the letter."}, {"viet": "Trẻ con ưa đòi hỏi chúng cần luôn cần quan tâm.", "eng": "Children are so demanding, they need constant attention."}, {"viet": "Hãy lau chùi khu vực quanh cái bếp.", "eng": "Clean the area round the cooker."}, {"viet": "Ra khỏi con đường lạnh lẽo để bước vào nơi ấm áp.", "eng": "Come out of the cold street into the warm."}, {"viet": "Xin chúc mừng, tôi nghe nói bạn đã tìm được việc làm ở công ty ABC rồi!", "eng": "Congratulations, I heard you got a job with ABC Company!"}, {"viet": "Tôi có thể nói chuyện với vợ anh về thức ăn được không?", "eng": "Could I talk to your wife about food?"}, {"viet": "Bố hãy nói với cô ấy là con không có ở đây nhé?", "eng": "Could you tell her I'm not here?"}, {"viet": "Phát quang một lối đi xuyên qua bụi cây.", "eng": "Cut a way through the undergrowth."}, {"viet": "Tôi đã chấp nhận vì phải chịu thua sức thuyết phục của cô ta.", "eng": "Defeated by her powers of persuasion, I accepted."}, {"viet": "Phá hủy hoàn toàn một tổ chức.", "eng": "Destroy an organization root and branch."}, {"viet": "Anh có biết nhiều người trong số họ không?", "eng": "Did you know many of them?"}, {"viet": "Đuổi người ta đi với một cử chỉ khinh mạn.", "eng": "Dismiss people with a lordly gesture."}, {"viet": "Ở nước bạn, người lớn tuổi có thường chuyển đến ở với gia đình của họ không?", "eng": "Do the elderly often move in with their families in your home country?"}, {"viet": "Bạn có thấy là các máy bán thuốc lá là an toàn đối với trẻ em không?", "eng": "Do you feel that cigarette vending machines are safe for children?"}, {"viet": "Có một tập sách hướng dẫn bằng tiếng Trung Quốc không?", "eng": "Do you have one in Chinese?"}, {"viet": "Anh sống ở thành thị hay ở nông thôn?", "eng": "Do you live in town or in the country?"}, {"viet": "Anh nghĩ mình nên chờ không?", "eng": "Do you think it advisable to wait?"}, {"viet": "Anh có điều ước gì khi nhìn thấy sao băng không?", "eng": "Do you wish when you see a shooting star?"}, {"viet": "Giải ô chữ cũng rèn luyện được phần nào trí óc.", "eng": "Doing crosswords gives the mind some exercise."}, {"viet": "Đừng có làm rớt kẻo nó vỡ đấy!", "eng": "Don't drop that or it'll break!"}, {"viet": "Bạn đừng để mình rơi vào tuyệt vọng.", "eng": "Don't let yourself sink into despair."}, {"viet": "Đừng nhận việc đó bây giờ-chừng nào anh tốt nghiệp đại học rồi hãy quyết định.", "eng": "Don't take the job now-keep your options open until you leave university."}, {"viet": "Qua bao năm thành phố này chứng kiến nhiều thay đổi.", "eng": "Down through the years this town has seen many changes."}, {"viet": "Trong chiến tranh, chúng tôi đã chịu nhiều cảnh gian khổ.", "eng": "During the war, we suffered many hardships."}, {"viet": "Những chai sữa không đặt trên ngưỡng cửa.", "eng": "Empty milk bottles on the doorstep."}, {"viet": "Nếu bạn làm mất vé, bạn có thể nhờ họ thay vé khác.", "eng": "Even if you lose your tickets, you can get them replaced."}, {"viet": "Bằng chứng gợi ý là viên chức ấy có thể bị truy tố về tội ác đó.", "eng": "Evidence suggested that the official was indictable for the crime."}, {"viet": "Những cảnh tình dục lộ liễu trong bộ phim.", "eng": "Explicit sex scenes in the film."}, {"viet": "Kẹp hai tờ giấy lại với nhau bằng một cây đinh ghim.", "eng": "Fasten two sheets of paper together with a pin."}, {"viet": "Bộ phim được quay bằng một chiếc máy quay phim cầm tay.", "eng": "Film taken with a hand-held camera."}, {"viet": "Đồng lương cố định và không có hy vọng thăng tiến là điều làm nản lòng các người làm công.", "eng": "Fixed wages and lack of promotion act as a disincentive to employees."}, {"viet": "Trong tám năm, cô ta thực sự làm gián điệp cho địch.", "eng": "For eight years she was in fact spying for the enemy."}, {"viet": "Đã có một thời nước Pháp là một cường quốc có nhiều thuộc địa.", "eng": "France was once a colonial power."}, {"viet": "Làm vườn là một sự giải trí rất thích thú.", "eng": "Gardening is a very rewarding pastime."}, {"viet": "Làm giàu dường như là mục đích duy nhất trên đời của bà ấy.", "eng": "Getting rich seems to be her only purpose in life."}, {"viet": "Hãy hoàn chỉnh đồ đạc của bạn về mặt chuyên môn.", "eng": "Give your furniture a professional finish."}, {"viet": "Bắp thịt rắn chắc là một trong các điều kiện tiên quyết cho sức khỏe.", "eng": "Good muscles are one of the prerequisites of physical fitness."}, {"viet": "Đội Hải Quan gặp đội Sài Gòn trong trận chung kết năm ngoái, và đội Hải Quan thắng.", "eng": "Hai Quan met Saigon in the final last year, and Hai Quan won."}, {"viet": "Thiếp mời đã được gửi đi chưa?", "eng": "Have the invitations gone out yet?"}, {"viet": "Bạn có bao giờ gặp một ngôi sao điện ảnh rất nổi tiếng hoặc một ngôi sao nhạc rock chưa?", "eng": "Have you ever seen a very famous movie star or a rock star?"}, {"viet": "Bạn đã xem bộ phim ABC chưa?", "eng": "Have you seen the movie ABC yet?"}, {"viet": "Anh ta là người đi theo trung thành của đội bóng nhà.", "eng": "He's a faithful follower of his home football team."}, {"viet": "Hắn ta đã lừa dối vợ, thí dụ ngủ với phụ nữ khác.", "eng": "He's been giving his wife the run-around."}, {"viet": "Anh ta đẹp trai nhưng không phải là hết sức đẹp trai.", "eng": "He's handsome, but not drop-dead handsome."}, {"viet": "Lần này anh ta đã thực sự tự dấn mình vào vụ đó.", "eng": "He's really landed himself in it this time."}, {"viet": "Anh ta vô tình đập trúng bóng từ Jones chuyền qua.", "eng": "He accidentally knocked on the pass from Jones."}, {"viet": "Anh ấy hỏi tôi đường tới Luân Đôn.", "eng": "He asked me the way to London."}, {"viet": "Anh ta bẻ một miếng bánh mì từ ổ bánh.", "eng": "He broke a piece of bread from the loaf."}, {"viet": "Nó đã tạo ra nhiều bất hạnh cho bố mẹ của nó.", "eng": "He caused his parents much unhappiness."}, {"viet": "Cậu bé ngồi co rúm trong góc, tiếng nói lắp bắp kinh hoàng.", "eng": "He cowered in the corner, gibbering with terror."}, {"viet": "Hắn không la hét hoặc chửi rủa mà chỉ lặng nhìn tôi giận dữ.", "eng": "He didn't shout or swear, but just glared silently at me."}, {"viet": "Nó đã trốn tránh cho khỏi bị bắt hàng mấy tuần bằng cách ẩn núp bí mật.", "eng": "He eluded capture for weeks by hiding underground."}, {"viet": "Nó cảm thấy một tình thương vô biên đối với chị nó.", "eng": "He felt great affection for his sister."}, {"viet": "Anh ấy đã chấm dứt quan hệ với cô bạn gái.", "eng": "He gave his girl-friend the push."}, {"viet": "Hắn lãnh hai năm tù về tội hành hung một nhân viên cảnh sát.", "eng": "He got two year's imprisonment for assaulting a police officer."}, {"viet": "Nó đã phải đương đầu với sự chế giễu của các bạn học cùng lớp.", "eng": "He had to face the jeering of his classmates."}, {"viet": "Ông ta là người bệnh tật suốt đời.", "eng": "He has been an invalid all his life."}, {"viet": "Thằng đó thật xấc xược khi lấy đồ sau lưng tôi!", "eng": "He has the impudence to take things behind my back!"}, {"viet": "Anh ta dè dặt bày tỏ những ước muốn của mình bằng một cái khẽ gật đầu.", "eng": "He intimated his wishes with a slight nod of his head."}, {"viet": "Không phải chỉ riêng anh ấy nghĩ rằng điều đó có thể dẫn đến chiến tranh.", "eng": "He is not alone in believing that it may lead to war."}, {"viet": "Anh ta hất đầu hướng về cửa ra vào.", "eng": "He jerked his head towards the door."}, {"viet": "Ông ấy gác ống nghe qua một bên để khỏi bị quấy rầy.", "eng": "He left the phone off the hook so that he wouldn't be disturbed."}, {"viet": "Ông ấy bị mù một con mắt trong chiến tranh.", "eng": "He lost an eye in the war."}, {"viet": "Anh ta suy diễn sai sự im lặng của cô ta như là biểu lộ sự đồng ý.", "eng": "He misinterpreted her silence as indicating agreement."}, {"viet": "Chắc giờ này anh ấy đã đến nơi.", "eng": "He ought to have arrived by this time."}, {"viet": "Anh ta thà chịu bị tính giá đắt còn hơn là mặc cả.", "eng": "He preferred to be overcharged than to haggle."}, {"viet": "Nó suy nghĩ rất lung để tìm câu trả lời.", "eng": "He puzzled his brains to find the answer."}, {"viet": "Ông ta coi thành phố đó như là nơi mà tất cả những hình thức của sự độc ác bất công đang được áp dụng.", "eng": "He regards the city as a place where all forms of iniquity are practised."}, {"viet": "Hắn là con quỷ đội lốt người.", "eng": "He's a devil in human shape."}, {"viet": "Gần đây anh ấy rất bận.", "eng": "He's been very busy recently."}, {"viet": "Anh ta tự thú với cảnh sát về tội của mình.", "eng": "He's made clean breast of his crime to the police."}, {"viet": "Ông ta là hạng người tôi thực sự không ưa.", "eng": "He's the sort of people I really dislike."}, {"viet": "Anh ta nói anh ta sẽ tự sát nhưng đó chỉ là cách nói cho lâm li thôi.", "eng": "He says he's going to kill himself, but he's just being melodramatic."}, {"viet": "Nó đã bắn cô ta trong phút mất trí ngắn ngủi.", "eng": "He shot her while temporarily unbalanced."}, {"viet": "Anh tự an ủi mình bằng những giấc mơ về danh tiếng.", "eng": "He solaces himself with dreams of fame."}, {"viet": "Nó ở lại đây hai tuần, trong thời gian đó nó không bao giờ ra khỏi nhà.", "eng": "He stayed here two weeks, during which time he never left the house."}, {"viet": "Anh ta nhận ngay ra tình hình trong một cái liếc mắt.", "eng": "He summed up the situation at a glance."}, {"viet": "Anh ta ném quả bóng cho tôi và tôi bắt lấy nó.", "eng": "He threw the ball to me, and I caught it."}, {"viet": "Ông ta chĩa ống nhòm vào những hình ảnh ở xa.", "eng": "He trained his binoculars on the distant figures."}, {"viet": "Ông ta bỏ tấm màn che bức tranh với một cử chỉ trịnh trọng.", "eng": "He unveiled the picture with a ceremonious gesture."}, {"viet": "Nó là một thằng cha hay quấy rầy rất khó chịu! Tôi lấy làm mừng đã tống khứ được nó.", "eng": "He was a boring nuisance! I'm glad to be rid of him."}, {"viet": "Trong sân chơi mấy thằng lớn hơn đối xử với nó rất thô bạo.", "eng": "He was bashed up in the playground by some older boys."}, {"viet": "Anh ta chủ định không bao giờ cho nó thấy lại quê nhà nữa.", "eng": "He was destined never to see his native land again."}, {"viet": "Anh ta bị đưa ra xử trước toà án địa phương vì hành vi quấy rối.", "eng": "He was hauled up before the local magistrates for disorderly conduct."}, {"viet": "Rõ ràng là nó nói láo-liệu có phải thế không nhỉ?", "eng": "He was obviously lying-or was he?"}, {"viet": "Người ta đưa anh ta đến nhà thương để theo dõi.", "eng": "He was sent to the hospital for observation."}, {"viet": "Nó mệt nhừ vì thế chúng tôi cho nó đi ngủ.", "eng": "He was tired out, accordingly we sent him to bed."}, {"viet": "Nó phóng nhanh ngược xa lộ với tốc độ 90 dặm một giờ.", "eng": "He went belting up the motorway at 90 mph."}, {"viet": "Anh ta thắng được 500 pao rồi tiêu hết sạch trong ba ngày.", "eng": "He won 500 pounds and then blued the lot in three days."}, {"viet": "Đối với tôi sức khoẻ quý hơn tiền bạc.", "eng": "Health is more important to me than money."}, {"viet": "Những câu trả lời của cô ta cho thấy cô vô tội.", "eng": "Her answers revealed her to be innocent."}, {"viet": "Việc cô ta tuyên bố là một nhà báo chỉ là một trò bịp.", "eng": "Her claim to be a journalist was simply a subterfuge."}, {"viet": "Kết quả thi của cô ấy đáng thất vọng, nhưng cô ta cố làm ra vẻ tốt đẹp cả.", "eng": "Her exam results were disappointing but she tried to put a brave face on it."}, {"viet": "Mái tóc cô ấy tung bay ( trong gió ).", "eng": "Her hair was flying about ( in the wind )."}, {"viet": "Hiểu biết của bà ta về vấn đề này rất rộng.", "eng": "Her knowledge of the subject is extensive."}, {"viet": "Bộ phim mới của cô ta gần đây được quảng cáo rất nhiều trên truyền hình.", "eng": "Her new film has had a lot of exposure on television recently."}, {"viet": "Bài văn xuôi của cô ấy quá kiểu cách không được tự nhiên.", "eng": "Her prose is far too mannered and self-conscious."}, {"viet": "Bài phát biểu của chị ấy chung quy là yêu cầu thêm tiền.", "eng": "Her speech boiled down to a plea for more money."}, {"viet": "Sự giàu có và danh tiếng của bà ta khiến cho bà ta được quyền nhập vào tầng lớp thượng lưu.", "eng": "Her wealth and reputation gave her entrée into upper-class."}, {"viet": "Này, anh bạn ơi, mình đi nhậu đi.", "eng": "Hey, amigo, let's go some where for a drink."}, {"viet": "Đôi lúc bệnh viêm khớp làm cho anh ta kiệt sức.", "eng": "His arthritis get the best of him from time to time."}, {"viet": "Tính nết ông ra rất khác với vợ ông ta.", "eng": "His character is very different from his wife's."}, {"viet": "Sự quyết tâm đã giúp anh ấy vượt qua sự thử thách.", "eng": "His determination carried him through the ordeal."}, {"viet": "Việc thi trượt đã đánh quỵ anh ta hoàn toàn.", "eng": "His failure in the exam has knocked all the stuffing out of him."}, {"viet": "Việc điều hành các cuộc đàm phán của ông ta thật là vụng về.", "eng": "His handling of the negotiations was maladroit."}, {"viet": "Lối ăn nói của anh ta càng ngày càng lỗ mãng, đến độ nghe chói tai.", "eng": "His language has become increasingly stark, to the point of sounding strident."}, {"viet": "Mẹ ông là con gái một ông vua.", "eng": "His mother was a daughter of a king."}, {"viet": "Tính bi quan của anh ta có tác động làm nản lòng mọi người.", "eng": "His pessimism has the effect of the depressing everyone."}, {"viet": "Người vợ giàu của hắn là nguồn cung cấp chính yếu của hắn.", "eng": "His rich wife is his meal ticket."}, {"viet": "Phong cách của nó là sự bắt chước mù quáng phong cách của ông thầy nó.", "eng": "His style is a slavish imitation of his teacher's."}, {"viet": "Mái tóc trắng của ông ta tương phản hẳn với nước da đen của mình.", "eng": "His white hair was in sharp contrast to his dark skin."}, {"viet": "Hãy đứng yên một lát để tôi chụp ảnh cho các bạn.", "eng": "Hold yourself still for a moment while I take your photograph."}, {"viet": "Những căn nhà không thích hợp cho người ở.", "eng": "Houses unfit for people to live in."}, {"viet": "Ý kiến của anh thế nào về sự tách biệt giữa giáo hội và nhà nước Mỹ trong khi chính phủ lại sử dụng quá nhiều từ Thượng đế?", "eng": "How can you say there's separation of church and state in American when the government uses the word G so much?"}, {"viet": "Xin chào'và'Xin lỗi'là những câu thể thức giao tiếp.", "eng": "How do you do'and'Excuse me'are social formulae."}, {"viet": "Anh ấy có thể nhìn chằm chằm bao lâu mà không chớp mắt?", "eng": "How long can you stare without blinking your eyes?"}, {"viet": "Đứa bé ăn mấy bữa một ngày?", "eng": "How many feeds a day does the baby get?"}, {"viet": "Anh đã bán các bức họa đó được bao nhiêu?", "eng": "How much did you realize on those paintings?"}, {"viet": "Chiếc xe mới của bạn chạy tốt không?", "eng": "How's your new car behaving?"}, {"viet": "Nhanh lên và chuẩn bị sẵn sàng đi-chúng tôi đang đợi đây này!", "eng": "Hurry up and get ready-we're waiting!"}, {"viet": "Tôi muốn đặt một câu hỏi với diễn giả.", "eng": "I'd like to put a question to the speaker."}, {"viet": "Tôi sẽ đề cập đến phân số thập phân trong bài sau.", "eng": "I'll deal with decimals in the next lesson."}, {"viet": "Tôi cần một cái mỏ lết để thay bánh xe sau.", "eng": "I'll need a spanner to change the back wheel."}, {"viet": "Thật ra tôi là thầy giáo, viết văn chỉ là nghề tay trái.", "eng": "I'm a teacher really, my writing is just a sideline."}, {"viet": "Tôi mệt lử lả vì cuộc đi bộ, chúng ta bắt tàu thôi.", "eng": "I'm fagged out with that walk, let's take the train."}, {"viet": "Tôi lúng túng xoay sở sửa chiếc xe.", "eng": "I'm having a devil of a job fixing my car."}, {"viet": "Tôi không quan tâm tới những lời chê bai đối với hàng xóm.", "eng": "I'm not interested in scandal about the neighbours."}, {"viet": "Tôi xin lỗi, tôi cứ nghĩ là họ đã gửi đi rồi, chắc tôi là được thông báo sai.", "eng": "I'm sorry, I thought they had already been sent, I must have been misinformed."}, {"viet": "Tôi nghĩ có lẽ tôi đang bị cúm.", "eng": "I'm thinking I may be coming down with the flu."}, {"viet": "Tôi đã ôm những cái hòm này đi khắp nơi suốt cả ngày.", "eng": "I've been carting these cases around all day."}, {"viet": "Tôi đã suy nghĩ nhiều về vấn đề này.", "eng": "I've given the matter a lot of given a lot of thought to the matter."}, {"viet": "Bà ấy nói rên rỉ Tôi đã mất hết sạch tiền của tôi rồi.", "eng": "I've lost all my money!, she wailed."}, {"viet": "Tôi đã cố gắng giải quyết vấn đề này nhưng tôi đã chịu thua!", "eng": "I've tried to solve the problem, but it defeats me!"}, {"viet": "Tôi luôn đi giày bên trái trước, tôi mê tín ( về chuyện đó ).", "eng": "I always put my left shoe on first, I'm superstitious ( about it )."}, {"viet": "Hôm nay thật tôi thật may mắn khi có một cơ hội tốt như thế.", "eng": "I am so fortunate to have such a good chance today."}, {"viet": "Tôi đi học 2 lần một tuần.", "eng": "I attend classes twice a week."}, {"viet": "Tôi tình cờ gặp lại một người bạn cũ nhiều năm tôi không gặp.", "eng": "I came across an old friend I hadn't seen for years."}, {"viet": "Tôi không thể cho anh vay toàn bộ số tiền bây giờ, nhưng tôi có thể đưa anh tạm một ít cho qua lúc này.", "eng": "I can't lend you the whole amount now, but I can give you something to be going on with."}, {"viet": "Tôi có thể làm bất cứ cái gì trong nhà trừ nấu ăn.", "eng": "I can do everything around the house except cook."}, {"viet": "Tôi không hiểu tại sao cô ấy giận dữ như vậy.", "eng": "I cannot understand why she is so angry."}, {"viet": "Tôi hoàn toàn quên mất hôm qua là ngày sinh nhật của anh ấy.", "eng": "I completely forgot that it was his birthday yesterday."}, {"viet": "Tôi cảm thấy vô cùng thẹn thùng khi đọc lại những truyện đầu tiên tôi viết.", "eng": "I cringe with embarrassment when I reread those first stories I wrote."}, {"viet": "Tao đố mày chứng được là tao đã gian lận.", "eng": "I defy you to prove I have cheated."}, {"viet": "Tôi che giấu các nốt trên mặt bằng son phấn.", "eng": "I disguised the spots on my face with make-up."}, {"viet": "Tôi không biết cái gì đã ảnh hưởng đến nó gần đây, nó trở nên rất hay cáu kỉnh.", "eng": "I don't know what's got into him recently, he's become very bad-tempered."}, {"viet": "Tôi không nghĩ tôi có thể trụ được lâu nữa đâu.", "eng": "I don't think I can hold on much longer."}, {"viet": "Tôi không muốn cậu sờ vào cái xe đạp của tôi-để yên nó đấy.", "eng": "I don't want you to fiddle with my bicycle-leave it alone."}, {"viet": "Tao không muốn mày ở đây; vậy mày cút đi!", "eng": "I don't want you here, so scat!"}, {"viet": "Tôi cảm thấy hơi lố với bộ complê này.", "eng": "I feel father overdressed in this suit."}, {"viet": "Tôi thấy những của ông ta bắt đầu trở thành nhạt nhẽo đối với tôi-tất cả chúng đều giống nhau.", "eng": "I find his books begin to pall after a while-they're all very similar."}, {"viet": "Nếu tôi chạy nhanh quá tim tôi sẽ đập nhanh dồn dập.", "eng": "I get palpitations if I run too fast."}, {"viet": "Tôi đã bị dị ứng tệ hại sau mũi thuốc tiêm thương hàn.", "eng": "I had a bad reaction after my typhoid injection."}, {"viet": "Tôi phải nhịn bữa ăn sáng nay để đi làm vì vội quá.", "eng": "I had to go without breakfast this morning as I was in a hurry."}, {"viet": "Tôi có kiến thức thực hành về xe ô tô và làm được phần lớn việc sửa chữa xe.", "eng": "I have a working knowledge of cars and can do most repairs."}, {"viet": "Tôi không có kì vọng trở thành chuyên gia về môn ấy.", "eng": "I have no pretense being an expert on the subject."}, {"viet": "Tôi có 2 chị và 1 em trai.", "eng": "I have two older sisters and one younger brother."}, {"viet": "Tôi nghe nói là ở nước bạn có máy rút tiền tự động ở một số cửa hàng phục vụ 24/24 giờ.", "eng": "I hear that ATMs are available at some convenience stores in your country."}, {"viet": "Tôi hy vọng đây không phải là quyết định cuối cùng của anh về vấn đề này.", "eng": "I hope that's not your last word on the subject."}, {"viet": "Tôi vừa vặn tránh khỏi cán phải con mèo.", "eng": "I just avoided running over the cat."}, {"viet": "Tôi biết có một cái lý do khác là lý do cho mối quan tâm đột ngột đến bóng đá của anh ta.", "eng": "I know that something else lay behind his sudden interest in football."}, {"viet": "Tôi có ấn tượng tốt đẹp về người trợ lý mới của anh-cô ta rồi sẽ làm việc rất tốt.", "eng": "I like the look of your new assistant-she should do very well."}, {"viet": "Anh sẽ đến thăm em sớm.", "eng": "I'll come and see you soon."}, {"viet": "Cháu sẽ chỉnh đồng hồ báo thức.", "eng": "I'll set my alarm clock."}, {"viet": "Tôi cũng rất vui được gặp bạn, Alice à.", "eng": "I'm also delighted to see you, Alice."}, {"viet": "Tôi vô tội, xin hãy tin tôi.", "eng": "I'm innocent, please believe me."}, {"viet": "Tôi xin lỗi, không còn cái nào cả.", "eng": "I'm sorry, there isn't any left."}, {"viet": "Tôi thán phục tính chín chắn của một cậu bé như thế.", "eng": "I marvelled at the maturity of such a young child."}, {"viet": "Tôi phải nói rõ rằng việc trì hoãn thêm sẽ là không khôn ngoan.", "eng": "I must point out that further delay would be unwise."}, {"viet": "Tôi không được một dịp nào để chơi trò chơi điện tử.", "eng": "I never get a look-in when it comes to playing with the computer games."}, {"viet": "Em đặc biệt muốn xem phim đó.", "eng": "I particularly want to see that film."}, {"viet": "Tối qua tôi chẹt phải một con mèo.", "eng": "I ran over a cat last night."}, {"viet": "Tôi từ chối nghe những nhận xét thô bỉ này.", "eng": "I refused to listen to these scurrilities."}, {"viet": "Tôi thấy anh ta cho chìa khoá vào ổ khoá, vặn chìa và mở cửa ra.", "eng": "I saw him put the key in the lock, turn it and open the door."}, {"viet": "Tôi sẽ phải từ chối lời mời của ông bởi vì đã có một cuộc hẹn trước.", "eng": "I shall have to refuse your invitation because of a prior engagement."}, {"viet": "Tôi đã mất nhiều ngày kén chọn trước khi quyết định loại giấy dán tường và các tấm rèm.", "eng": "I spent days picking and choosing before deciding on the wallpaper and curtains."}, {"viet": "Tôi đã thề không nói cho bất cứ ai về điều đó.", "eng": "I swore not to tell anybody about it."}, {"viet": "Tôi nghĩ là gửi hàng bằng đường hàng không thì tốt hơn.", "eng": "I think it's better to dispatch them by air."}, {"viet": "Tôi nghĩ cậu cầm vali của tôi.", "eng": "I think you have my suitcase."}, {"viet": "Tôi đã rút tiền trội ở ngân hàng để trả tiền mua xe ôtô mới.", "eng": "I took out an overdraft to pay for my new car."}, {"viet": "Tôi đã cung cấp cho uỷ ban những tin mới nhất về tiến bộ của chúng ta.", "eng": "I update the committee on our progress."}, {"viet": "Tôi muốn có tin riêng về những mối quan hệ phạm tội của nó.", "eng": "I want the dope on his criminal connections."}, {"viet": "Mẹ muốn con nói “ chúc ngủ ngon ” và đi ngủ!", "eng": "I want you to say good night and go to bed!"}, {"viet": "Tôi bị kèm ra cửa sổ một cách thô bạo.", "eng": "I was escorted unceremoniously to the door."}, {"viet": "Tôi đã bị vượt xa ngay từ đầu cuộc đua.", "eng": "I was outclassed from the start of the race."}, {"viet": "Tôi không thể dự cuộc họp vì tôi có một cuộc hẹn trước đó.", "eng": "I was unable to attend the meeting because of a prior engagement."}, {"viet": "Tôi sẽ đi, nếu như anh cũng đi.", "eng": "I will go, provided, providing that you go too."}, {"viet": "Con sẽ không đến đó nữa, con hứa chắc với cha mà!", "eng": "I won't go there again, I promised you that!"}, {"viet": "Tôi muốn khuyên hãy cẩn thận trong trường hợp như thế.", "eng": "I would counsel caution in such a case."}, {"viet": "Tôi muốn cho ông biết rằng hối phiếu của ông đã được thu đúng hẹn.", "eng": "I would like to tell you that your draft has duly been collected."}, {"viet": "Nếu các công nhân đồng ý mua công ty thì công ty của họ sẽ trở thành một xí nghiệp của người làm công lớn nhất nước.", "eng": "Idiom the workers do approve the buyout, then company will become the nation's largest employee owned enterprise."}, {"viet": "Tôi mà tóm được thằng kẻ trộm, nó sẽ phải khổ với tôi.", "eng": "If I ever lay my hands on the thief, he'll be sorry."}, {"viet": "Nếu cứ cái cách anh ta đối xử bạn bè như thế là trời giúp cho kẻ thù của anh ta!", "eng": "If that's the way he treats his friends, heaven help his enemies!"}, {"viet": "Nếu chúng ta không trả một giá cao cho ngôi nhà này bây giờ thì có thể chúng ta sẽ để lỡ cơ hội.", "eng": "If we don't offer a good price for the house now, we'll probably miss the boat altogether."}, {"viet": "Nếu bạn nhắm mắt lại, bạn không nhìn thấy gì hết.", "eng": "If you close your eyes, you can't see anything."}, {"viet": "Nếu con đã ăn xong rồi, con có thể rời bàn.", "eng": "If you have finished eating you may leave the table."}, {"viet": "Nếu anh đi tiếp, anh sẽ tới nhà thờ.", "eng": "If you walk on, you'll come to the church."}, {"viet": "Trên một cánh đồng bông ta có thể nhìn thấy cùng một lúc có cả quả chín, quả xanh và hoa trắng lẫn với hoa đỏ.", "eng": "In a cotton fields ripe bolls, green bolls, white flowers and red flowers can all be seen at the same time."}, {"viet": "Trong Anh ngữ chữ b, p, m và w là những âm môi.", "eng": "In English b, p, m, and w are bilabials."}, {"viet": "Trong trường hợp của tôi, thường là khi đi công tác, hiếm khi đi chơi.", "eng": "In my case, it is usually on business, seldom for pleasure."}, {"viet": "Ở những thành phố châu á ngày nay có hàng ngàn đền chùa thờ Phật.", "eng": "In the cities of Asia today there are thousands of Buddhism temples."}, {"viet": "Trong từ'sympathetic'trọng âm chính (') là ở âm thứ ba, và trọng âm phụ (, ) là ở âm thứ nhất.", "eng": "In the word'sympathetic'the primary stress (') is on the third syllable, and the secondary stress (, ) is on the first syllable."}, {"viet": "Lạm phát là con ngoáo ộp của nhiều chính phủ.", "eng": "Inflation is the bogy of many governments."}, {"viet": "Ở nước anh, người ta có thường cho hầu bàn tiền boa không?", "eng": "Is it customary to tip waiters in your country?"}, {"viet": "Có phương thuốc thần hiệu trong hoàn cảnh này không?", "eng": "Is there a sovereign remedy for this condition?"}, {"viet": "Một cửa hàng rượu mà không bán bia có phải là một điều khác thường không?", "eng": "Isn't it anomalous for a liquor store not to sell beer?"}, {"viet": "Không chắc nó sẽ đến đây đúng giờ.", "eng": "It's a tossup whether he will get here in time."}, {"viet": "Khó nói chuyện một cách có lí lẽ vời những người có quan điểm quá khích.", "eng": "It's difficult to converse rationally with people who hold extremist views."}, {"viet": "Thật khó hiểu là nó được hoàn thành bằng cách nào khi không có máy móc hiện đại của chúng ta.", "eng": "It's inconceivable how it was completed without our modern machines."}, {"viet": "Đây không được như Lake District, nhưng vùng nông thôn này cũng rất đẹp.", "eng": "It's not quite the Lake District but the countryside's very pretty."}, {"viet": "Đi qua Luân Đôn thật là khó khăn.", "eng": "It's such a hassle getting across London."}, {"viet": "Bỏ công sức ra giải thích công việc cặn kẽ cho các nhân viên mới là việc đáng làm.", "eng": "It's worthwhile taking the trouble to explain a job fully to new employees."}, {"viet": "Tôi lấy làm khổ tâm phải nói điều đó, nhưng anh phải tự trách chính anh thôi.", "eng": "It grieves me to have to say it, but you have only yourself to blame."}, {"viet": "Chỉ nghĩ đến những sự khủng khiếp của chiến tranh hạt nhân cũng đã làm người ta hoảng sợ rồi.", "eng": "It is frightening even to think of the horrors of nuclear war."}, {"viet": "Việc đánh cắp thánh giá trên bàn thờ là hành động phạm thánh.", "eng": "It is sacrilege to steal a crucifix from an altar."}, {"viet": "Điều đó đòi hỏi phải có can đảm mới nói thẳng ra được.", "eng": "It may require courage to speak freely."}, {"viet": "Giống như một câu chuyện trên tivi vậy.", "eng": "It's like a story on television."}, {"viet": "Có thể anh ấy sẽ đến trước khi trời tối.", "eng": "It seems probable that he will arrive before dark."}, {"viet": "Kết thúc hiệp một hai bên cùng 10 điểm.", "eng": "It was 10 up at the end of the first half."}, {"viet": "Số trời đã định là công ty sẽ bị sụp đổ một cách trông thấy.", "eng": "It was foreordained that the company would suffer a spectacular collapse."}, {"viet": "Theo như quy định thì hàng hoá sẽ được chuyển giao trong ba ngày.", "eng": "It was stipulated that the goods should be delivered within three days."}, {"viet": "Sẽ thật đáng tiếc nếu chúng bị thất lạc.", "eng": "It would be a great pity if they were lost."}, {"viet": "Nhật đã sử dụng quyền phủ quyết để ngăn cản nghị quyết đó.", "eng": "Japan used her veto to block the resolution."}, {"viet": "Các nhà báo phải làm việc theo những thời gian giới hạn eo hẹp.", "eng": "Journalists have to work to tight deadlines."}, {"viet": "Các cách thức nhẹ nhàng không có tác dụng-đã đến lúc phải cứng rắn.", "eng": "Kid-glove methods haven't worked-it's time to get tough."}, {"viet": "Chúng ta hãy xem một số đồ thủ công mỹ nghệ.", "eng": "Let's look at some of the arts and crafts."}, {"viet": "Cuộc sống ở nông thôn có thể là buồn tẻ-London là nơi có đủ mọi hoạt động nhộn nhịp.", "eng": "Life in the country can be dull-London is where all the action is."}, {"viet": "Nhiều loại phong lan rừng đã trở nên hiếm.", "eng": "Many kinds of wild orchid are becoming rare."}, {"viet": "Mark Smith nằm ở phòng 123.", "eng": "Mark Smith is in Room 123."}, {"viet": "Xin cho tôi biết tên ông và số phòng của ông?", "eng": "May I have your name and your room number?"}, {"viet": "Được đáp ứng đúng với công sức ai bỏ ra.", "eng": "Meet with one's just deserts."}, {"viet": "Hầu hết các giáo sư đều cảm thấy thoải mái khi rời giảng đường.", "eng": "Most professors unbend out-side the lecture theater."}, {"viet": "Mẹ tôi luôn chợp mắt sau bữa trưa.", "eng": "Mum always has forty winks after lunch."}, {"viet": "Kinh nghiệm của tôi chưa đủ phong phú.", "eng": "My experience is not sufficiently varied."}, {"viet": "Công việc sau cùng của tôi là ở ngành bảo hiểm.", "eng": "My last job was in insurance."}, {"viet": "Chị tôi là người có uy tín về các vấn đề chăm sóc sắc đẹp.", "eng": "My sister's the oracle on beauty matters."}, {"viet": "Những cuộc thương lượng được tiến hành một cách có hiệu quả.", "eng": "Negotiations were conducted in a businesslike manner."}, {"viet": "Ồ không, xin đừng bận tâm về điều đó, cám ơn anh?", "eng": "No, don't trouble about it, thank you?"}, {"viet": "Cho dù thời tiết như thế nào đi nữa, việc tập luyện vẫn sẽ diễn ra.", "eng": "No matter what weather, practice will still be on."}, {"viet": "Nào, phiếu rút tiền đã được điền rồi đây.", "eng": "Now here is the filled out withdrawal slip."}, {"viet": "Dĩ nhiên là mẹ sẽ không để con một mình, ngốc ạ.", "eng": "Of course, I won't leave you alone, you silly."}, {"viet": "Dầu của hoa anh thảo được dùng như một dược thảo.", "eng": "Oil of evening primrose is used as a herbal medicine."}, {"viet": "Ngoài việc vay 50 pao, anh ta còn hỏi mượn tôi xe ô tô.", "eng": "On top of borrowing 50 pounds, he asked me to lend him my car."}, {"viet": "Một trong những nhân vật nổi tiếng trong giới quần vợt.", "eng": "One of the best-known personalities in the world of tennis."}, {"viet": "Công việc kinh doanh của chúng tôi lúc này mở rộng sang máy tính.", "eng": "Our business has branched out into computers now."}, {"viet": "Hy vọng chiến thắng của chúng ta bị tiêu tan.", "eng": "Our hopes of victory were extinguished."}, {"viet": "Đội quân nhỏ bé của chúng tôi bị thất bại vì bên kia đông hơn hẳn.", "eng": "Our small army was defeated by sheer weight of numbers."}, {"viet": "Mặt nạ dưỡng khí được sử dụng trên máy bay chỉ trong những trường hợp khẩn cấp.", "eng": "Oxygen mask are used in aircraft only in emergencies."}, {"viet": "Với sự ra đời của vô tuyến người ta biết nhiều thông tin hơn.", "eng": "People are much better informed since the advent of television."}, {"viet": "Peter là cháu nhỏ nhất của chúng tôi, và ngoài ra chúng tôi còn có ba cháu nữa.", "eng": "Peter is our youngest child, and we have three others besides."}, {"viet": "Những chính khách thường hay đi máy bay phản lực quanh thế giới.", "eng": "Politicians who constantly jet around the world."}, {"viet": "Sam mời chúng tôi đi dự cuộc vui suốt đêm, nhưng chúng tôi đã bắt đầu già cho những chuyện như vậy.", "eng": "Sam invited us to an all-nighters, but we're getting a little old for that kind of thing."}, {"viet": "Nhiều chữ trong thư đã bị xoá đi.", "eng": "Several words in the letter had been blotted out."}, {"viet": "Nàng là người nên được mời đến dự tiệc vì nàng vốn là một người hoạt bát.", "eng": "She's a good person to invite to a party because she's such an extrovert."}, {"viet": "Vừa qua bà ta không được khỏe lắm nhưng bây giờ bà ta đã khá hơn.", "eng": "She's been very unwell, but she's on the mend now."}, {"viet": "Cô ta chẳng có cái gì trong đầu vấn đề rắc rối đối với cô ta là ở chỗ đó.", "eng": "She's just got nothing in the attic that's what's wrong with her."}, {"viet": "Cô ấy làm trầy da ở khuỷu tay của cô ta.", "eng": "She's scraped the skin off her elbow."}, {"viet": "Cô ta lên án chúng tôi là hoang toàng-đúng là lươn ngắn lại chê chạch dài!", "eng": "She accused us of being extravagant-talk about the pot calling the kettle black!"}, {"viet": "Suốt buổi tối hôm ấy, bà ta nói mỗi lúc một nhiều hơn.", "eng": "She became more and more talkative as the evening went on."}, {"viet": "Cô ấy vẫn bám lấy hy vọng rằng anh ta còn sống.", "eng": "She clung to the hope that he was still alive."}, {"viet": "Cô ta làm khán giả thích thú bằng những câu chuyện hài về tổng thống.", "eng": "She delighted the audience with her jokes about the president."}, {"viet": "Cô ấy đưa ra một cú sốc lớn Em có mang.", "eng": "She dropped her bombshell, I am pregnant."}, {"viet": "Cô ta đầu tiên nổi danh là một diễn viên.", "eng": "She first made a name for herself as an actress."}, {"viet": "Bà ta bị choáng váng khi nhìn thấy hoá đơn điện thoại.", "eng": "She got a shock when she saw the telephone bill."}, {"viet": "Bà ta có cái vinh dự là người phụ nữ cuối cùng bị treo cổ ở nước Anh.", "eng": "She had the dubious honour of being the last woman to be hanged in England."}, {"viet": "Bà ấy đã khiến cho cử toạ phải chăm chú lắng nghe.", "eng": "She has her audience listening attentively."}, {"viet": "Cô ta phớt lờ những lời chế giễu của các bạn cùng làm việc.", "eng": "She ignored the scoffs of her workmates."}, {"viet": "Cô ta được nhắc lại là đã nói rằng cô không đồng ý với quyết định đó.", "eng": "She is quoted as saying she disagree with the decision."}, {"viet": "Cô ấy đặt hoa dưới chân mộ của bạn.", "eng": "She laid some flowers at the foot of her friend's grave."}, {"viet": "Trông cô ta khá kỳ lạ với bộ tóc màu xanh lá cây.", "eng": "She looks rather curious with green hair."}, {"viet": "Cô ấy cần có một người để nghe cô ấy kể nỗi sầu muộn của mình.", "eng": "She needed someone to listen to her tale of woe."}, {"viet": "Chị ấy có phần đóng góp lớn cho thành công của kế hoạch.", "eng": "She played a major part in the success of the scheme."}, {"viet": "Bà nhận được từ cử toạ một sự hoan hô nhiệt liệt.", "eng": "She received an enthusiastic ovation from the audience."}, {"viet": "Cô ta lắt léo như con lươn vậy.", "eng": "She's as slippery as an eel."}, {"viet": "Bà ta đã thay đổi lập trường và rời bỏ đảng.", "eng": "She's sold out and left the party."}, {"viet": "Cô ta dường như có phần sợ hãi khi bước vào bên trong.", "eng": "She seemed a little afraid of going inside."}, {"viet": "Cô ấy ngủ trên một chiếc đệm cao su xốp.", "eng": "She slept on a mattress of foam rubber."}, {"viet": "Cô ấy chỉnh lại bức tranh trên tường.", "eng": "She straightened the picture on the wall."}, {"viet": "Bà ta doạ đuổi nếu chúng tôi không đồng ý, nhưng tất cả không chịu nhượng bộ.", "eng": "She threatened us with dismissal if we didn't agree, but we all sat tight."}, {"viet": "Cô ấy tháo nút gói bưu phẩm và nhìn vào bên trong.", "eng": "She untied the parcel and looked inside."}, {"viet": "Bà ta bị kết tội nhận hối lộ.", "eng": "She was accused of taking bribes."}, {"viet": "Chị ấy đã được chọn là nhà nữ thể thao của năm nay.", "eng": "She was designated as sportswoman of the year."}, {"viet": "Cô ta đang có mưu đồ cùng với người chị gái chống lại mẹ cô ta.", "eng": "She was intriguing with her sister against her mother."}, {"viet": "Cô ta đã được thuyết phục để có một hướng hành động hợp lý.", "eng": "She was reasoned into a sensible course of action."}, {"viet": "Bà ấy xúc động bởi sự tiếp đón nồng nhiệt của họ.", "eng": "She was touched by the warmth of their welcome."}, {"viet": "Sau bữa ăn trưa, bà ta ra ngoài đi bộ cho giãn gân cốt.", "eng": "She went out to stretch her legs after lunch."}, {"viet": "Cô ấy mặc chiếc áo dài chấm gót.", "eng": "She wore long dress reaching down to her feet."}, {"viet": "Xuỵt! tất cả đi chỗ khác chơi, tao đang bận.", "eng": "Shoo, all of you, I'm busy."}, {"viet": "Ra hiệu cho người bồi bàn mang thực đơn đến.", "eng": "Signal to the waiter to bring the menu."}, {"viet": "Sáu hành khách có thể ngủ ở boong dưới.", "eng": "Six passengers can be berthed on the lower deck."}, {"viet": "Hút thuốc lá khi chờ món ăn là không thể chấp nhận được.", "eng": "Smoking between courses simply isn't done."}, {"viet": "Vì vậy tốt hơn chúng ta nên đến đó khoảng 8 giờ.", "eng": "So we'd better be there about 8: 00."}, {"viet": "Khiêu vũ một lát sẽ làm cho cuộc liên hoan sôi nổi lên.", "eng": "Some dancing would ginger up the party."}, {"viet": "Có một số người hay giãi bày tâm sự của mình hơn những người khác.", "eng": "Some people are more demonstrative then others."}, {"viet": "Người có quan điểm rất tích cực về chính trị.", "eng": "Somebody who is very political in outlook."}, {"viet": "Lọc những cây nhỏ ra để vứt đi.", "eng": "Sort out the smaller plants and throw them away."}, {"viet": "Rít lên vài tiếng hoảng hốt.", "eng": "Squeak out a few frightened words."}, {"viet": "Bảo vệ những quyền lợi của mình.", "eng": "Stick up for one's rights."}, {"viet": "Lạm dụng tính cả tin của thính giả.", "eng": "Strain the credulity of one's listeners."}, {"viet": "Một hệ thống như vậy sẽ có ích lợi cho xã hội.", "eng": "Such a system will be beneficial to society."}, {"viet": "Chủ nhật là ngày rất ít người đi làm.", "eng": "Sunday is the day when very few people go to work."}, {"viet": "Thụy Sĩ nằm giữa Pháp, Đức, áo và Ý.", "eng": "Switzerland lies between France, Germany, austria and Italy."}, {"viet": "Chọn những người cùng nhảy với bạn điệu nhảy sắp tới nhé.", "eng": "Take your partners for the next dance."}, {"viet": "Hãy kể cho tôi biết bạn nghỉ ngày Chủ nhật ra sao.", "eng": "Tell me what you did with yourself on Sunday."}, {"viet": "Cám ơn, tôi vừa mới mua nó hôm qua.", "eng": "Thanks, I just got it yesterday."}, {"viet": "Cuộc đạp xe này đã làm cho tôi kiệt sức hoàn toàn.", "eng": "That bike ride absolutely finished me."}, {"viet": "Lớp băng đó quá mỏng không đứng lên được đâu.", "eng": "That ice is too thin to stand on."}, {"viet": "Tối hôm đó anh ta say và trở nên khá tục tằn.", "eng": "That night he was drunk and grew pretty abusive."}, {"viet": "Dường như không có nhân tố chính nào trong cách cư xử của hắn.", "eng": "That seems to be no rationale to his behavior."}, {"viet": "Điều đó có lẽ sẽ mở rộng tổng thể kinh tế mà mọi người có thể tham gia bằng cách sử dụng hiệu quả từng đồng đô la đầu tư.", "eng": "That would enlarge the economic pie by making the most productive use of every investment dollar."}, {"viet": "Người bị buộc tội được yêu cầu khai tên mình.", "eng": "The accused man was asked to give his name."}, {"viet": "Không khí sực nức hương thơm hoa hồng.", "eng": "The air was tinged with the smell of roses."}, {"viet": "Hội hè vui vẻ đêm giao thừa hàng năm.", "eng": "The annual New Year's Eve whoop-de-do."}, {"viet": "Quân đội đem bán đấu giá nhiều đồ trang bị cũ.", "eng": "The Army is auctioning off a lot of old equipment."}, {"viet": "Khán giả hoan hô cuộc biểu diễn trong ba phút.", "eng": "The audience applauds the performance for three minutes."}, {"viet": "Những bước đi chập chững đầu tiên của em bé.", "eng": "The baby's first uncertain steps."}, {"viet": "Ngân hàng phải trả tiền cho những trái phiếu đến hạn.", "eng": "The bank must pay the matured bonds."}, {"viet": "Những cảnh hoàng hôn đẹp trên sa mạc.", "eng": "The beautiful sunsets in the desert."}, {"viet": "Người ta đã phải gỡ con chim ra khỏi lưới.", "eng": "The bird had to extricated from the netting."}, {"viet": "Thi thể đang nằm trên vũng máu.", "eng": "The body was lying on a pool of blood."}, {"viet": "Biên giới xưa nay vẫn là một nguyên nhân bất hoà giữa hai nước này.", "eng": "The border has always been a bone of contention between these two countries."}, {"viet": "Óc cần sự cung cấp máu liên tục.", "eng": "The brain needs a continuous supply of blood."}, {"viet": "Toà nhà đó cho thuê với giá 3000 pao một năm.", "eng": "The building rents at 3000 pounds a year."}, {"viet": "Chuông reo khi bữa ăn đã sẵn sàng.", "eng": "The buzzer rang when the meal was ready."}, {"viet": "Chiếc xe ô tô đã đưa anh đi 500 dặm rồi mới bị pan.", "eng": "The car had carried him 500 miles before it broke down."}, {"viet": "Các tấm thảm bắt đầu sờn.", "eng": "The carpets are starting to wear."}, {"viet": "Hệ thống sưởi trung tâm đã được vặn định giờ.", "eng": "The central heating is on a time-switch."}, {"viet": "Người bán dược phẩm pha thuốc cho tôi.", "eng": "The chemist mixed some medicine for me."}, {"viet": "Đứa bé chập chững đi ngang qua căn phòng.", "eng": "The child tottered across the room."}, {"viet": "Bọn trẻ có một bữa ăn nhẹ giữa buổi sáng gồm có sữa và bánh quy.", "eng": "The children have a mid-morning snack of milk and biscuits."}, {"viet": "Bọn trẻ đang ở ngoài sân chơi đùa xả hơi.", "eng": "The children were out in the playground letting off steam."}, {"viet": "Những nền văn minh cổ Ai Cập và Babilon.", "eng": "The civilizations of ancient Egypt and Babylon."}, {"viet": "Câu lạc bộ này dường như đầy những người lập dị.", "eng": "The club seemed to be full of eccentrics."}, {"viet": "Sự trông xuống thung lũng từ ngọn đồi.", "eng": "The command of the valley from the hill."}, {"viet": "Công ty đó có trên 300 cửa hàng khắp nước.", "eng": "The company has over 300 stores nationwide."}, {"viet": "Hội nghị đó kết thúc với nét lạc quan rõ rệt.", "eng": "The conference ended on a distinctly upbeat note."}, {"viet": "Đoàn tàu có hộ tống bị tàu ngầm tấn công.", "eng": "The convoy was attacked by submarines."}, {"viet": "Nước Myanma ( trước đây là Miến Điện ).", "eng": "The country of Myanmar ( formerly Burma )."}, {"viet": "Thủy thủ đoàn ở trong một tình trạng thiểu não khi họ tới được bờ.", "eng": "The crew were in a sorry plight by the time they reached shore."}, {"viet": "Luỹ thừa ba của 5 ( 53 ) là 125 ( 5 x 5 x 5 = 125 ).", "eng": "The cube of 5 ( 53 ) is 125 ( 5 x 5 x 5 = 125 )."}, {"viet": "Quan niệm nguy hiểm về tính cách ưu việt của giống da trắng.", "eng": "The dangerous notion of white supremacy."}, {"viet": "Các luật sư biện hộ triệu tập một buổi họp để thảo luận về phương pháp đối phó.", "eng": "The defense lawyers held a meeting to discuss tactics."}, {"viet": "Thiết bị đó sẽ được sản xuất vào khoảng cuối năm.", "eng": "The device will be in production by the end of the year."}, {"viet": "Món ăn kèm theo nhiều thứ rau quả dầm.", "eng": "The dish was accompanied by a variety of pickles."}, {"viet": "Bác sĩ nói tôi cần một kỳ nghỉ.", "eng": "The doctor says I am in need of a holiday."}, {"viet": "Con chó ngồi ngoài cửa tru lên đòi vào.", "eng": "The dog sat outside the door whining to be let in."}, {"viet": "Người lái xe thoát được với vài vết thương nhẹ nhưng chiếc xe thì hoàn toàn hư hại.", "eng": "The driver escaped with completely written off."}, {"viet": "Trận động đất là tai hoạ tệ hại nhất trong lịch sử đất nước.", "eng": "The earthquake was the worst calamity in the country's history."}, {"viet": "Bài giảng lê thê bất tận làm buồn chán không sao chịu nổi.", "eng": "The endless lecture produced an unbearable ennui."}, {"viet": "Những con khỉ xổng chuồng tạo nên tình trạng cực kì lộn xộn trong sở thú.", "eng": "The escape of the monkeys from their cage created mayhem in the zoo."}, {"viet": "Chuyến hải hành sắp sửa bắt đầu.", "eng": "The expedition is nearly ready to put to sea."}, {"viet": "Tấm đá phiến rơi cắt ngọt cánh tay ông ta.", "eng": "The falling slate sliced into his arm."}, {"viet": "Hàng rào này vạch ranh giới giữa vùng đất của tôi và vùng đất của cô ta.", "eng": "The fence marks the boundary between my land and hers."}, {"viet": "Bộ phim được chiếu lần đầu tiên tại cuộc liên hoan điện ảnh ở Cannes.", "eng": "The film was premiered at the Cannes festival."}, {"viet": "Công ty đó đạt tổng số lợi nhuận là 200.000 bảng Anh.", "eng": "The firm made a total profit of £ 200,000."}, {"viet": "Những người đánh cá sẽ không ra khơi vào một đêm xấu trời như thế này.", "eng": "The fishermen won't go out on such a dirty night."}, {"viet": "Cầu thủ bóng đá nhảy sang bên tránh cú đá chặn.", "eng": "The footballer side-stepped the tackle."}, {"viet": "Biên giới kéo dài từ đồi núi phía bắc đến bờ biển phía nam.", "eng": "The frontier ranges from the northern hills to the southern coast."}, {"viet": "Khu vườn dốc thoai thoải xuống phía sông.", "eng": "The garden sloped gently downwards towards the river."}, {"viet": "Dòng nước xanh nhẵn như gương của sông Hudson.", "eng": "The glassy green waters of the Hudson River."}, {"viet": "Chính phủ đang đi ngược lại những lời hứa hẹn trong bầu cử.", "eng": "The Government are back-pedalling on their election promises."}, {"viet": "Chính phủ đang vấp phải một sự chống đối lớn về các kế hoạch tư nhân hoá.", "eng": "The government is running up against considerable opposition to its privatization plans."}, {"viet": "Một bậc lão thành trong nền sân khấu của Anh.", "eng": "The grand old man of the English theatre."}, {"viet": "Toán lính canh sẽ được kiểm tra hôm nay.", "eng": "The guard are being inspected today."}, {"viet": "Các kim đồng hồ treo tường xoay rất chậm chạp.", "eng": "The hands of a clock turn every slowly."}, {"viet": "Đức linh mục tối cao xức dầu phong ông ấy là vua.", "eng": "The high priest anointed him king."}, {"viet": "Bệnh viện được biểu quyết thuận cho 100.000 bảng Anh cho nghiên cứu.", "eng": "The hospital was voted £ 100,000 for research."}, {"viet": "Căn nhà được quét vôi màu xanh lá cây bên ngoài.", "eng": "The house is painted green outside."}, {"viet": "Ý nghĩ đi cắm trại chẳng bao giờ hấp dẫn được tôi.", "eng": "The idea of camping has never appealed to me."}, {"viet": "Bộ binh bắt đầu dàn quân vào lúc mờ sáng.", "eng": "The infantry began to deploy at dawn."}, {"viet": "Người phỏng vấn ngắt lời vị khách của mình giữa câu.", "eng": "The interviewer cut short his guest in mid-sentence."}, {"viet": "Viên kim cương Jonker được tìm thấy vào năm 1934 nổi tiếng về độ tinh khiết của nó.", "eng": "The Jonker diamond, found in 1934, was famous for its purity."}, {"viet": "Tên bắt cóc chắc hẳn đã có một tòng phạm.", "eng": "The kidnapper must have had an accomplice."}, {"viet": "Quang cảnh này trông u ám và ảm đạm.", "eng": "The landscape was grey and stark."}, {"viet": "Vị lãnh đạo ra lệnh là phải chấp hành các luật lệ.", "eng": "The leader enjoined that the rules should be obeyed."}, {"viet": "Chiếc xuồng cấp cứu được hạ thủy tức khắc để cứu bốn người đó.", "eng": "The lifeboat was launched immediately to rescue four men."}, {"viet": "Thị trường chứng khoán Luân Đôn hôm nay rất xôn xao.", "eng": "The London stock Exchange is in turmoil today."}, {"viet": "Các bậc thầy về âm nhạc của thế kỷ 17.", "eng": "The maestri of the seventeenth century."}, {"viet": "Ban điều hành xin cảm ơn tất cả mọi người trong cơ quan đã có tinh thần hợp tác.", "eng": "The management would like to thank the staff for bring so co-operative."}, {"viet": "Tấm nệm đó cứng và không êm.", "eng": "The mattress was hard and unyielding."}, {"viet": "Hồi ký của một chính khách về hưu.", "eng": "The memoirs of a retired politician."}, {"viet": "Ông bộ trưởng đã từ chức để phản đối quyết định đó.", "eng": "The minister resigned in protest against the decision."}, {"viet": "Mặt trăng đã nhô ra khỏi đám mây.", "eng": "The moon emerged from behind the clouds."}, {"viet": "Mùi một chiếc bánh nướng làm thèm rỏ dãi.", "eng": "The mouthwatering aroma of a baking pie."}, {"viet": "Người họ hàng gần nhất của gia đình tôi còn sống là một người con ông bác khá xa.", "eng": "The nearest member of my family still alive is a rather distant cousin."}, {"viet": "Việc làm mới không phải là một sự đề bạt theo đúng nghĩa của từ này nhưng nó đem lại nhiều triển vọng tốt đẹp cho tương lai.", "eng": "The new job is not a promotion as such but it brings good prospects for the future."}, {"viet": "Hệ thống mới có ảnh hưởng tai hại đối với sức sản xuất.", "eng": "The new system has had a disastrous effect on productivity."}, {"viet": "Sáng hôm sau anh ta có cảm giác ngây ngất.", "eng": "The next morning he had a hangover."}, {"viet": "Số lượng người lớn không biết đọc là dấu hiệu chất lượng tồi của trường học chúng ta.", "eng": "The number of adults who cannot read is a comment on the quality of our schools."}, {"viet": "Viên chức cầm đầu cuộc điều tra đã bị bãi nhiệm.", "eng": "The officer leading the inquiry has been taken off the case."}, {"viet": "Thành cổ ở trên ngọn đồi có một bức tường xung quanh ngay nó.", "eng": "The old town on the hill had a wall right round it."}, {"viet": "Người tổ chức một cuộc thi, nghi thức, một buổi tiệc.", "eng": "The organizer of the event, function, party."}, {"viet": "Cung điện đó đóng cửa để trùng tu.", "eng": "The palace is closed for restoration."}, {"viet": "Những đồng cỏ ở trang trại sản xuất bơ sữa rất quan trọng.", "eng": "The pastures on a dairy farm are important."}, {"viet": "Người dân của nhiều bộ lạc bán khai vẫn ít mặc y phục hoặc không mặc gì cả, nhưng họ quả có trang điểm cho thân thể họ.", "eng": "The people of many savage tribes still wear little or no clothing, but they do decorate their bodies."}, {"viet": "Nhạc sĩ dương cầm đó biểu diễn một bản độc tấu dài với nhiều biến tấu, và thêm vài lần khán giả yêu cầu được nghe lại.", "eng": "The pianist gave a long and varied recital, with a couple of encores for good measure."}, {"viet": "Thời trung cổ, người ta rất sợ dịch hạch.", "eng": "The plague was greatly feared in the Middle Ages."}, {"viet": "Lớp mạ đang bắt đầu mòn đi.", "eng": "The plating is beginning to wear."}, {"viet": "Mấu chốt của vấn đề đang bàn là điểm này.", "eng": "The point at issue is this."}, {"viet": "Cảnh sát loại trừ vụ cướp là một lý do đưa đến vụ án mạng.", "eng": "The police have excluded robbery as a motive for the murder."}, {"viet": "Cảnh sát đang chờ bọn côn đồ khi chúng ùa ra khỏi tàu.", "eng": "The police were waiting for the hooligans as they piled out of the train."}, {"viet": "Khả năng mất việc lơ lửng trên đầu cô ta suốt năm ngoái như thanh gươm Damocles.", "eng": "The possibility of losing her job hung over her like a sword of Damocles all last year."}, {"viet": "Vụ ám sát tổng thống là sự kiện có tầm quan trọng long trời lở đất.", "eng": "The President's assassination was an event of earth shattering importance."}, {"viet": "Giá cả lên xuống theo thời tiết.", "eng": "The price fluctuate according to the weather."}, {"viet": "Hai bàn tay tên tù đã bị trói chắc.", "eng": "The prisoner's hands were securely tied."}, {"viet": "Vị giáo sư được kính trọng vì học vấn uyên bác của ông ta.", "eng": "The professor was revered for his immense learning."}, {"viet": "Tất cả những người phản đối cùng nhau diễn hành đến toà thị sảnh.", "eng": "The protesters marched in a body to the town hall."}, {"viet": "Nữ hoàng đã phong hầu tước cho ông ta.", "eng": "The Queen conferred a knighthood on him."}, {"viet": "Trời mưa đã làm cho ngày nghỉ của chúng tôi trở thành một thảm hoạ thực sự.", "eng": "The rain turned our holiday into a veritable disaster."}, {"viet": "Sắc đỏ và vàng trên những cây vào thu.", "eng": "The reds and golds of the autumn trees."}, {"viet": "Người phóng viên làm cho chính khách lúng túng vì câu hỏi bất ngờ.", "eng": "The reporter threw the politician a curve by asking him an unexpected question."}, {"viet": "Đứa con trai của ông nhà giàu đã nhanh chóng tiêu hết tiền của ông ta.", "eng": "The rich man's son quickly ran through his money."}, {"viet": "Con đường giao nhau với xa lộ ở Newtown.", "eng": "The road joins the motorway at Newtown."}, {"viet": "Căn phòng hoàn toàn chìm trong bóng tối.", "eng": "The room was in complete darkness."}, {"viet": "Tờ Saigon Time có số lượng độc giả trên 10 triệu.", "eng": "The Saigon Time has a readership of over ten million."}, {"viet": "Kế hoạch đó đã bị xếp xó sau một cuộc trao đổi ngắn gọn.", "eng": "The scheme was pigeon-holed after a brief discussion."}, {"viet": "Sự bí mật vẫn còn bao trùm quanh vụ tai nạn.", "eng": "The secrecy that still surrounds the accident."}, {"viet": "Những hình bóng tan vào trong đêm.", "eng": "The shapes faded away into the night."}, {"viet": "Chiếc tàu ấy trực chỉ hướng nam.", "eng": "The ship was sailing due south."}, {"viet": "Cảnh tượng của xác chết làm nó sợ lạnh tóc gáy.", "eng": "The sight of death body made his blood run cold."}, {"viet": "Bầu trời lác đác những vì sao.", "eng": "The sky was dotted with stars."}, {"viet": "Người lính đó được tuyên bố là thích hợp về thể trạng để nhập ngũ.", "eng": "The soldier war pronounced medically fit for active duty."}, {"viet": "Tia lửa đã làm cháy đám cỏ khô.", "eng": "The sparks kindled the dry grass."}, {"viet": "Nhân viên muốn được tăng lương.", "eng": "The staff want a pay rise."}, {"viet": "Cửa hàng nơi tôi đã mua cái tivi thật sự cho bạn đổi cái tivi cũ của bạn đấy.", "eng": "The store which I bought my TV at actually lets you trade in your old one."}, {"viet": "Các sinh viên trong lớp kể cho nhau nghe về đất nước của họ.", "eng": "The students in the class told each other about their own country."}, {"viet": "Giá đỡ quá yếu so với trọng lượng của hàng chở.", "eng": "The supports were too weak for the weight of the load."}, {"viet": "Thầy giáo tịch thu radio của tôi vì tôi mở nó trong giờ học.", "eng": "The teacher confiscated my radio because I was playing it in the classroom."}, {"viet": "Giọng nói ê a chán ngắt của người thuyết giáo.", "eng": "The tedious singsong of the preacher's voice."}, {"viet": "Tên ăn cắp chạy thoát khỏi những người đuổi theo.", "eng": "The thief shakes himself off the pursuers."}, {"viet": "Tước hiệu này truyền từ cha tôi sang tôi.", "eng": "The title descends to me from my father."}, {"viet": "Xe lửa đang chạy chậm lại, vậy chúng ta hãy đi ra hành lang đi.", "eng": "The train is slowing down, so let's walk down the corridor."}, {"viet": "Những đội quân đã được chuẩn bị cho trận đánh.", "eng": "The troops were being prepared for battle."}, {"viet": "Hai trung đội sẽ gặp nhau trong khu rừng theo như kế hoạch.", "eng": "The two platoons will rendezvous in the woods as planned."}, {"viet": "Trường đại học đang cố gắng làm thêm nhiều nơi ăn chốn ở cho sinh viên.", "eng": "The university is trying to make more accommodation available for students."}, {"viet": "Quang cảnh nhìn từ trên đỉnh đồi xuống thật là đẹp.", "eng": "The view from the top of the hill was lovely."}, {"viet": "Các cuộc chiến tranh gọi là Thánh Chiến đã giúp cho các thành phố của châu Âu phát triển.", "eng": "The wars called the Crusades helped make the cities of Europe grow."}, {"viet": "Tiếng còi nổi lên vào cuối trận đấu.", "eng": "The whistle goes at the end of the match."}, {"viet": "Gió thổi mạnh và đẩy họ về phía trước.", "eng": "The winds blew steadily and pushed them on their way."}, {"viet": "Công nhân đồng ý không nhận tiền tăng lương để được bảo đảm công ăn việc làm chắc chắn hơn.", "eng": "The workers agreed to forgo a pay increase for the sake of greater job security."}, {"viet": "Thế hệ trẻ của đất nước này đã đấu tranh gian khổ để có được tự do hơn.", "eng": "The youth of this country have fought hard for greater freedom."}, {"viet": "Mối quan tâm của họ trong dự án mới đã mất dần.", "eng": "Their interest in the new project phased out."}, {"viet": "Vậy thì ông có đem theo chứng minh nhân dân hay bằng lái xe không?", "eng": "Then, do you have your Identity Card or driving license with you?"}, {"viet": "Có một con chim đang làm tổ trong nhà xe.''Ừ có đấy'.", "eng": "There's a bird nesting in the garage.''So there is'."}, {"viet": "Có một chút hiểu lầm, tôi không cho đó là lỗi của anh.", "eng": "There's been a slight misunderstanding, I wasn't suggesting it was your fault."}, {"viet": "Sáng nay không khí thật lạnh lẽo.", "eng": "There's quite a chill in the air this morning."}, {"viet": "Có nhiều bài hát hay.", "eng": "There are many beautiful carols."}, {"viet": "Có thợ may, thợ sửa đồng hồ, người bán hàng lông thú, người bán hoa, và người bán sách.", "eng": "There are tailors, watch repairers, furriers, florists, and booksellers."}, {"viet": "Ở ngoài biển có hàng tỷ con san hô, nhiều đến nỗi tại nhiều nơi trên Thái Bình Dương đá ngầm san hô đã mọc lên thành các vòng trên mặt nước biển.", "eng": "There have been so many billions of billions of corals that in many places in the Pacific Ocean coral reefs rise in circles above the surface of the sea."}, {"viet": "Có rất nhiều thác nước, những dòng sông dịu êm, những hồ nhỏ và hiền hoà hay rộng lớn như Hồ Lớn.", "eng": "There is abundance of waterfalls, gentle rivers, lakes that are small and intimate or vast like the Great Lakes."}, {"viet": "Có cái gì đó hỏng hóc trong hệ thống ống nước.", "eng": "There is something wrong with the plumbing."}, {"viet": "Ngày ấy có rất nhiều tiền được lưu hành.", "eng": "There was a lot of money around in those days."}, {"viet": "Có một vài lối chơi tuyệt diệu trong trận đấu hôm qua.", "eng": "There was some excellent play in yesterday's match."}, {"viet": "Thứ bảy sẽ có một lễ cưới ở nhà thờ của làng.", "eng": "There will be a wedding in the village church on Saturday."}, {"viet": "Bó hoa này là một sự đền đáp nhỏ đối với lòng tốt của bà.", "eng": "These flowers are a small return for your kindness."}, {"viet": "Những chiếc giày này thoải mái hơn những chiếc giày kia.", "eng": "These shoes are more comfortable than those."}, {"viet": "Họ rất cần cù ghi chép sổ sách.", "eng": "They're very diligent in keeping records."}, {"viet": "Họ đòi một số tiền quá cao về cái nhà của họ.", "eng": "They are asking an extortionate amount of money for their house."}, {"viet": "Họ nhận thấy một mùi đặc biệt trong phòng.", "eng": "They became aware of a peculiar smell in the room."}, {"viet": "Họ sửa lại bất cứ chỗ không giống nhau nào giữa các mẻ sản phẩm.", "eng": "They correct any dissimilarity between batches of work."}, {"viet": "Họ đã tuyển được bốn trăm tân binh cho hải quân.", "eng": "They enlisted four hundred recruits for the navy."}, {"viet": "Họ đã được chánh án toà kháng án huỷ bỏ bản án kết tội.", "eng": "They had their sentence quashed by the appeal court judge."}, {"viet": "Họ không cho công chúng hay biết gì về tên lửa mới.", "eng": "They kept the public in the dark about the new missiles."}, {"viet": "Họ gặp nhau trực tiếp lần đầu.", "eng": "They met face-to-face for the first time."}, {"viet": "Họ phá nhiều nhà để xây con đường mới.", "eng": "They pulled down a lot of houses to build the new road."}, {"viet": "Họ cảm thấy là có cái gì đó sắp xảy ra.", "eng": "They sensed that there was something in the wind."}, {"viet": "Họ đi lên mặt trăng bằng con tàu vũ trụ.", "eng": "They travelled to the moon in a spaceship."}, {"viet": "Chúng đã được du nhập vào Nhật từ Trung Quốc.", "eng": "They were brought to Japan from China."}, {"viet": "Họ mặc quần áo cắt theo kiểu vừa xưa vừa kì.", "eng": "They were wearing clothes of strange and ancient cut."}, {"viet": "Khu này nổi tiếng vì vẻ đẹp thiên nhiên của nó.", "eng": "This area is famed for its natural beauty."}, {"viet": "Công ty này cắt quần áo theo yêu cầu của khách hàng.", "eng": "This company will tailor a suit to order."}, {"viet": "Bộ phim này đã đảm bảo cho anh ta một vị trí trong lịch sử điện ảnh.", "eng": "This film had assured him a place in movie history."}, {"viet": "Tôi là Trần ở công ty ABC đang gọi đây.", "eng": "This is Chen of ABC Company calling."}, {"viet": "Cái này không phải là thuốc lá, nó là \"thuốc tẩm cần sa\".", "eng": "This isn't a cigarette, it's a \"joint\"."}, {"viet": "Bài báo này là một sự xâm phạm xấu xa vào đời tư của tôi.", "eng": "This newspaper article is a disgraceful intrusion into my private life."}, {"viet": "Cái rađiô này không chạy, tôi sẽ phải đổi nó.", "eng": "This radio doesn't work, i'm going to get a replacement."}, {"viet": "Đề tài này rất gắn bó đối với tôi.", "eng": "This subject is very close to my heart."}, {"viet": "Năm nay chúng tôi bận bù đầu bù óc-tôi cần đi nghỉ để thư giãn đôi chút.", "eng": "This year has been frantically busy for us-I need a holiday just to wind down."}, {"viet": "Để đạt được một hợp đồng mới là một trong những nhiệm vụ của tôi lần này.", "eng": "To reach a new contract is one of my missions this time."}, {"viet": "Các truyền thống được các bô lão trong bộ lạc truyền lại.", "eng": "Traditions were passed on by the elders of the tribe."}, {"viet": "Những hoàn cảnh khác nhau đã phối hợp làm cho ông thành một vĩ nhân.", "eng": "Various circumstances cooperated to make him a great man."}, {"viet": "Nước đã được lọc sạch do chảy qua đá.", "eng": "Water is purified by passing through rock."}, {"viet": "Chúng tôi sẽ mang bữa điểm tâm nhẹ đến phòng của ông ngay.", "eng": "We'll send the continental breakfast to your room right away."}, {"viet": "Chúng tôi không giàu nhưng chúng tôi hoàn toàn thoải mái.", "eng": "We're not rich but we are quite comfortable."}, {"viet": "Chúng tôi có rượu Xcot, rượu Xcot hảo hạng, rượu uýt-xki Ailen, rượu uýt-xki Canada và rượu uýt-xki Nhật Bản.", "eng": "We've got Scotch, Premium Scotch, Irish Whiskey, Canadian Whiskey and Japanese Whiskey."}, {"viet": "Chúng tôi cho phép bọn trẻ xem phim để chúng khỏi nghịch.", "eng": "We allowed the children to watch a film on television to keep them out of mischief."}, {"viet": "Chúng tôi yên ổn khi ông ta còn sống.", "eng": "We are safe when he is to be to the fore."}, {"viet": "Chúng tôi không thể thu tiền nhà ngoài cách thưa kiện người thuê nhà.", "eng": "We can't collect the rent other than by swing the tenant."}, {"viet": "Chúng tôi khiêng những người chết và ( những người ) bị thương rời khỏi chiến trường.", "eng": "We carried the dead and ( the ) wounded off the battlefield."}, {"viet": "Chúng tôi có sẵn một chiếc xe sang số tiêu chuẩn.", "eng": "We do have a standard transmission available."}, {"viet": "Chúng tôi nhìn thấy anh ta ở quầy Sư tử đỏ.", "eng": "We found him in the Red Lion, propping up the bar."}, {"viet": "Chúng tôi đã có lúc ba con mèo, nay không còn con nào ( trong số đó ) còn sống.", "eng": "We had three cats once-none ( of them ) are alive now."}, {"viet": "Chúng tôi đã can thiệp với các quan chức nhân danh những người đang bị tù oan ở đó.", "eng": "We have interceded with the authorities on behalf of people unfairly imprisoned there."}, {"viet": "Chúng tôi hy vọng sẽ chuyển đến London tuần sau.", "eng": "We hope to come down to London next week."}, {"viet": "Chúng tôi nhìn bóng mình trong hồ.", "eng": "We look at our reflections in the lake."}, {"viet": "Chúng ta phải giúp đỡ mọi người tìm nhà ở ngoài thành phố nhưng đồng thời cũng phải nhớ rằng một số người thành phố muốn ở đâu cứ ở yên đấy.", "eng": "We must help people to find houses outside the city, but equally, we must remember that some city people want to remain where they are."}, {"viet": "Chúng tôi dành một dịch vụ riêng cho các khách hàng.", "eng": "We offer a personal service to our customers."}, {"viet": "Chúng tôi được trang trải những chi phí cho buổi trình diễn nhờ tiền bán vé.", "eng": "We recouped the shows'expense from ticket sales."}, {"viet": "Chúng ta phải làm cho hành động phù hợp với các nguyên lí của mình.", "eng": "We should square actions with our principles."}, {"viet": "Chúng ta dùng đất sét để làm bình hoa và các hình thể xinh đẹp khác.", "eng": "We use it for vases and beautiful figures."}, {"viet": "Chúng tôi được báo trước đừng lái xe quá nhanh.", "eng": "We were cautioned not to drive too fast."}, {"viet": "Chúng tôi sẽ làm theo lời đề nghị của ông.", "eng": "We will do as you suggest it."}, {"viet": "Ồ, bố ơi, nếu đã không ăn thứ gì bị cấm, bố sẽ thật sự phải thôi ăn tất cả.", "eng": "Well, Dad, if you didn't eat everything you ever warned against, you'd pratically have to stop eating altogether."}, {"viet": "Tôi chỉ có bấy nhiêu thôi.", "eng": "Well, that's all I have."}, {"viet": "Thầy giáo hỏi: Việc gì xảy ra với con thế, cậu bé?", "eng": "What's the matter with you, son?, asked the teacher?"}, {"viet": "Những địa điểm nghỉ mát được ưa chuộng nhất đối với người Anh là những nơi nào?", "eng": "What are the most popular holiday destinations for British people?"}, {"viet": "Bạn làm gì khi bạn bị cảm?", "eng": "What do you do when you have a cold?"}, {"viet": "Tôi kiếm được bao nhiêu chỉ là vấn đề phụ, cái thật sự quan trọng là tôi không thích công việc của tôi.", "eng": "What I earn is a side-issue, What really matters is that I don't like my work."}, {"viet": "Chất lượng không khí ở Osaka như thế nào?", "eng": "What is the quality of air like in Osaka?"}, {"viet": "Nếu ta gặp khó khăn thì có gì trở ngại không?", "eng": "What matters if we meet with some difficulties?"}, {"viet": "Anh định mấy giờ ngày mai thì khởi hành?", "eng": "What time are you planning to set off tomorrow?"}, {"viet": "Khi được yêu cầu giải thích hành vi của mình, bà ta đã đưa ra một câu trả lời có tính cách tự vệ.", "eng": "When asked to explain her behaviour, she gave a very defensive answer."}, {"viet": "Khi tôi phàn nàn với bộ phận phục vụ tận phòng thì họ đã phớt lờ tôi.", "eng": "When I complained to Room Service, they ignored me."}, {"viet": "Tôi sẽ đón cô lúc mấy giờ?", "eng": "When should I pick you up?"}, {"viet": "Khi chúng tôi dùng bữa, loại được ưa chuộng nhất là rượu trắng.", "eng": "When we have dinner, the most popular one is white spirit."}, {"viet": "Tôi làm sai chỗ nào trong tính toán của tôi?", "eng": "Where did I go wrong in my calculation?"}, {"viet": "Bạn thích loại nào hơn, bia Mỹ hay bia Nhật?", "eng": "Which do you prefer, American or Japanese beer?"}, {"viet": "Khi ở Trung Quốc, tốt hơn tôi nên nhập gia tùy tục.", "eng": "While in China, I'd better do as the Chinese do."}, {"viet": "Ai biết điều gì sẽ xảy ra trong tương lai?", "eng": "Who knows what will happen in the future?"}, {"viet": "Sao anh không tạt lại ( nhà tôi ) chơi tối nay?", "eng": "Why don't you come round ( to my flat ) this evening?"}, {"viet": "Liệu bọn trẻ có quên bữa ăn trưa không nhỉ?.", "eng": "Will the children forget about lunch?."}, {"viet": "Anh có mang bức thư này cho anh tôi không?", "eng": "Will you take this message to my brother?"}, {"viet": "Họ nhất tề đứng dậy và hoan hô.", "eng": "With one accord they all stood up and cheered."}, {"viet": "Tôi sẽ mô tả cô ấy là thanh tú hơn là đẹp.", "eng": "Would describe her as handsome rather than beautiful."}, {"viet": "Tối nay cô có muốn ăn lại món này không?", "eng": "Would you like to have it again tonight?"}, {"viet": "Cô vui lòng cân bức thư này xem bưu phí là bao nhiêu?", "eng": "Would you please weigh this letter to see what the postage is?"}, {"viet": "Vâng, tôi muốn mua một bố tiền kim loại để sưu tầm.", "eng": "Yes, I'd like to buy some sets of coins for collection purposes."}, {"viet": "Vâng, anh phải cầm chúng khi nhảy một số điệu.", "eng": "Yes, you must have them for some dances."}, {"viet": "Anh sẽ phải chờ đúng lúc mới được.", "eng": "You'll have to watch for the right moment."}, {"viet": "Anh nhút nhát quá, anh cần phải cố khẳng định mình nhiều hơn nữa.", "eng": "You're too timid-you must try to assert yourself more."}, {"viet": "Năm nay anh ba mươi rồi, đã tới lúc phải nghĩ đến việc lập gia đình đi thôi.", "eng": "You are thirty years old now, and it is high time you get married."}, {"viet": "Anh không thể kể câu chuyện đùa ấy với cô ta đâu-Cô ta quá nghiêm nghị và đứng đắn.", "eng": "You can't tell that joke to her-She's much too prim and proper."}, {"viet": "Ông có thể dùng nó để điều chỉnh nhiệt độ, ngoài ra, ông cũng có thể dùng nó để điều chỉnh tivi.", "eng": "You can set the temperature with it In addition, you can control the TV with it."}, {"viet": "Bạn không cần phải đặt cọc.", "eng": "You don't have to make a down-payment."}, {"viet": "Anh cần phải đợi tại một tiền sảnh lớn ngoài cửa trước khi được đưa vào trình diện tại nơi đích thực là toà án.", "eng": "You have to wait in a large entrance hall before being shown into the court proper."}, {"viet": "Ông có thể treo tấm bảng “ Xin đừng quấy rầy ” lên tay nắm cửa.", "eng": "You may put the Do not disturb sign on your door-knob."}, {"viet": "Anh phải xin phép giám đốc.", "eng": "You must seek permission from the manager."}, {"viet": "Chị nói chị sẽ đi siêu thị, chị có thay đổi ý kiến và sẽ ở đây không?", "eng": "You said you were going to the supermarket, won't you change your mind and stay here?"}, {"viet": "Bạn nên mặc màu đó thường hơn.", "eng": "You should wear that colour more often."}, {"viet": "Anh sẽ được khen ngợi hoặc phê bình đúng như công việc của anh tốt hay xấu.", "eng": "You will be praised or criticized according as your work is good or bad."}, {"viet": "Giấy khai sinh của bạn cho mọi người biết bạn sinh bao giờ.", "eng": "Your birth certificate tells people when you were born."}, {"viet": "Đề nghị của anh cực kì lạ lùng, chúng tôi không thể theo được.", "eng": "Your proposals are utterly fantastic, we couldn't possibly afford them."}]