[{"viet": "250g hoặc một lượng tương đương tính bằng aoxơ.", "eng": "250 grams or an equivalent amount in ounces."}, {"viet": "Một chiếc xe ô tô có một chiếc xe rờ moóc móc ở phía sau.", "eng": "A car with a trailer hitch on to it at the back."}, {"viet": "Một vách đá nhô lên thẳng đứng từ bãi biển.", "eng": "A cliff that rises sheer from the beach."}, {"viet": "Một người đưa thư giao những gói hàng đến văn phòng của chúng tôi.", "eng": "A courier delivered the parcels to our office."}, {"viet": "Một bài công kích nhà nước cảnh quyền độc tài.", "eng": "A diatribe against the police state."}, {"viet": "Một gia đình nổi tiếng về tuổi thọ.", "eng": "A family noted for its longevity."}, {"viet": "Đuốc là thứ vũ khí lợi hại chống lại thú vật.", "eng": "A flaming torch was a very good weapon against an animal."}, {"viet": "Một ví dụ rõ ràng về điểm này là vị trí của Sảnh Đường Sứ giả Mùa Xuân trên bờ hồ Côn Minh ở Cung Điện Mùa Hè.", "eng": "A good case in point is the site of the Herald of Spring Pavilion on the bank of Kunming lake in the Summer Palace."}, {"viet": "Một hướng dẫn viên đưa khách du lịch lên xe ca.", "eng": "A guide shepherded the tourists into the coach."}, {"viet": "Một ngôi nhà ở gần các cửa hàng.", "eng": "A house that is convenient for the shops."}, {"viet": "Một số lượng lớn người đã xin việc.", "eng": "A large number of people have applied."}, {"viet": "Một số đồ dùng trong nhà vừa được chở tới.", "eng": "A load of furniture has just come."}, {"viet": "Một người có tính nghệ sĩ.", "eng": "A man with an artistic temperament."}, {"viet": "Một đạo lý dựa trên những nguyên tắc tôn giáo.", "eng": "A morality founded on religious principles."}, {"viet": "Bài tường thuật vô tư của báo chí về một phiên xử gây xúc động.", "eng": "A newspaper's passionless account of a sensational trial."}, {"viet": "Một vụ tăng lương được quyết định trong tháng Sáu và có hiệu lực từ ngày 1 tháng Năm.", "eng": "A pay increase awarded in June and backdated to 1 May."}, {"viet": "Một kế hoạch có một vài điều làm cho nó hấp dẫn.", "eng": "A plan with something to recommend it."}, {"viet": "Một vụ vi phạm hiệp ước rành rành.", "eng": "A prima facie violation of the treaty."}, {"viet": "Một bài đọc to phúc âm của Thánh John.", "eng": "A reading from St John's gospel."}, {"viet": "Một hàng cây thẳng hàng với vệ đường.", "eng": "A row of trees alighted with the edge of the road."}, {"viet": "Một dãy luống đất trên cánh đồng đã được cày lên.", "eng": "A series of ridges in a ploughed field."}, {"viet": "Một chiếc xe hơi nhỏ dùng kinh tế hơn là một chiếc lớn vì nó tốn ít xăng hơn.", "eng": "A small car is more economical to drive than a big one, because it used less petrol."}, {"viet": "Một người phát ngôn đã nói lên sự bất mãn của công nhân.", "eng": "A spokesman voiced the workers'dissatisfaction."}, {"viet": "Một vị trí thích hợp cho những ngôi nhà mới.", "eng": "A suitable location for new houses."}, {"viet": "Một tia sáng thoát ra từ lỗ khóa đó.", "eng": "A thread of light emerged from the keyhole."}, {"viet": "Một bác sĩ thú y đã giết con ngựa bị thương.", "eng": "A vet dispatched the injured horse."}, {"viet": "Người phụ nữ có nét mặt được cấu tạo đẹp.", "eng": "A woman with finely chiselled features."}, {"viet": "Bị buộc tội đã cướp ngân hàng lấy 1 triệu bảng Anh.", "eng": "Accused of robbing a bank of one million pounds."}, {"viet": "Sau 10 năm bị cầm tù, hắn được trả lại tự do của hắn ta.", "eng": "After 10 years in prison, he was given his freedom."}, {"viet": "Sau khi tôi nghỉ việc, tôi sẽ đi du lịch khắp thế giới.", "eng": "After I quit my job, I'm going to travel around the world."}, {"viet": "Sau vụ hỏa hoạn, rất ít thứ còn lại trong ngôi nhà tôi.", "eng": "After the fire, very little remained of my house."}, {"viet": "Alexander nói rằng ông ta sẽ ban cho Diogenes tất cả những gì ông ta đòi hỏi.", "eng": "Alexander said that he would grant any favor Diogenes asked of him."}, {"viet": "Tất cả các trường học đều cấm dung rượu và cấm dung ma túy.", "eng": "All schools are alcohol-free and drug-free schools."}, {"viet": "Anh chỉ cần mua vài tấm ván và đinh, rồi đóng mọi thứ lại với nhau.", "eng": "All you have to do is buy some boards and nails, and hammer everything together."}, {"viet": "Trong số những thành viên của ủy ban thì những người ủng hộ các thay đổi được đề nghị chiếm đa số.", "eng": "Among the members of the committee those who favour the proposed changes are in the majority."}, {"viet": "Một hương thơm làm liên tưởng đến hoa xuân.", "eng": "An aroma suggestive of spring flowers."}, {"viet": "Một sự tốn kém thời gian, công sức và tiền bạc.", "eng": "An expense of time, energy and cash."}, {"viet": "Một người bán hàng tinh ý đã nhớ rõ người đàn ông ăn mặc ra sao.", "eng": "An observant shop assistant had remembered exactly what the man was wearing."}, {"viet": "Một chuyến đi làm bực bội trên một chiếc xe lửa chật ních.", "eng": "An unlovely ride to work on a crowded train."}, {"viet": "Anh giáo là tôn giáo chính thức ở nước Anh.", "eng": "Anglicanism is the established religion in England."}, {"viet": "Ngoài các vết thương ở mặt và tay anh ấy còn bị gãy cả hai chân nữa.", "eng": "Apart from the injuries to his face and hands, he broke both legs."}, {"viet": "Bộ không có sự giới hạn nào đối với các tham vọng của hắn à?", "eng": "Are there no bounds to his ambitions?"}, {"viet": "Bạn có quan tâm đến trà đạo hay cắm hoa kiểu Nhật Bản không?", "eng": "Are you interested in tea ceremony or Japanese flower arrangement?"}, {"viet": "Arsenal vừa ký hợp đồng với một cầu thủ tiền đạo mới.", "eng": "Arsenal have just signed a new striker."}, {"viet": "Những người lính bị phạt cấm trại.", "eng": "As punishment, the men were confined to barracks."}, {"viet": "Bị tấn công bằng những cú đánh dữ dội vào đầu.", "eng": "Assailed with fierce blows to the head."}, {"viet": "Tối đa tôi có thể kiếm được là 250 bảng Anh mỗi tối.", "eng": "At the most I might earn £ 250 a night."}, {"viet": "Việc bảo lãnh tại ngoại bị bác dựa trên giả định là hắn phạm tội.", "eng": "Bail was refused on the presupposition of his guilt."}, {"viet": "Buộc phải đi đến kết luận tất yếu rằng hắn là kẻ nói dối.", "eng": "Be forced to the inescapable conclusion that he is a liar."}, {"viet": "Vì bà vợ ông ấy có mặt ở đó, tôi đã không nói gì về chuyện ấy cả.", "eng": "Because of his wife's being there, I said nothing about it."}, {"viet": "Ngoài việc gửi tiền, chúng tôi cũng cho vay nữa.", "eng": "Besides deposit we also make loans."}, {"viet": "Border bị Botham loại một cách xuất sắc bằng 41 điểm.", "eng": "Border was brilliantly run out by Botham for 41."}, {"viet": "Broadway là sức sống của thế giới sân khấu thành phố New York.", "eng": "Broadway is the heartbeat of the New York City theater world."}, {"viet": "Nhưng tôi chưa thấy cái nào đáng quan tâm cả.", "eng": "But I haven't seen anything that interests me yet."}, {"viet": "Nhưng mẹ con em thích thấy buồn vì những chuyện bất hạnh.", "eng": "But we like to feel bad about unhappy events."}, {"viet": "Hắn vừa xong vào lúc anh tới.", "eng": "By the time you arrive, he will have just finished."}, {"viet": "Tôi có thể ngồi bàn bên cửa sổ được không?", "eng": "Can I get a table by the window?"}, {"viet": "Chúng ta có thể sai con Udon lấy rác được không?", "eng": "Can we order Udon for take out?"}, {"viet": "Bạn có thể nêu tên một vài công viên quốc gia nổi tiếng ở Mỹ không?", "eng": "Can you name some famous national parks in the U. S.?"}, {"viet": "Các ứng viên sẽ được mời phỏng vấn vào đầu tháng tới.", "eng": "Candidates will be invited for interview early next month."}, {"viet": "Rượu sâm banh, có thời là một loại rượu tầm thường đối với các nhà quý phái và các đám cưới.", "eng": "Champagne, once a raffish drink suitable for toffs and weddings."}, {"viet": "Đẽo dần tảng hoa cương bằng cái đục.", "eng": "Chipping away at a block of marble with a chisel."}, {"viet": "Than cốc là một chất đốt có tính kinh tế nhưng nó để lại nhiều tro.", "eng": "Coke is an economical fuel but it leaves a lot of ash."}, {"viet": "Những lời phàn nàn là các bệnh viện của chúng ta thiếu nhân viên trầm trọng.", "eng": "Complaints that our hospitals are seriously undermanned."}, {"viet": "Ký hợp đồng với một công ty về việc cung cấp nhiên liệu.", "eng": "Contract with a firm for the supply of fuel."}, {"viet": "Ông có thể đến Nam Dakota, hoặc Montana, hay Wyoming được không?", "eng": "Could you go to South Dakota, or Montana, or Wyoming?"}, {"viet": "Sự lạm phát dần dần trong thị trường nhà ở.", "eng": "Creeping inflation in the housing market."}, {"viet": "Emyêu, anh yêu là một từ ngữ biểu lộ lòng yêu thương.", "eng": "Darling is a term of endearment."}, {"viet": "Những chỗ lõm trên bề mặt của mặt trăng.", "eng": "Depressions on the face of the moon."}, {"viet": "Anh đã trả lời thư của cô ta chưa? Đương nhiên!", "eng": "Did you answer her letter? Naturally!"}, {"viet": "Những từ khác nhau có cùng chính tả được phân biệt trong cuốn từ điển này bằng những con số in bên trên.", "eng": "Different words with the same spelling are distinguished in this dictionary by superscript numbers."}, {"viet": "Tôi có cần chuyển xe lửa không?", "eng": "Do I need to change trains?"}, {"viet": "Bạn có tin là có con quái vật ở Hồ Loch Ness không?", "eng": "Do you believe in the Loch Ness monster?"}, {"viet": "Bạn có máy trả lời điện thoại không?", "eng": "Do you have an answering machine?"}, {"viet": "Bạn có biết Marc là một nhà ảo thuật không?", "eng": "Do you know that Marc is a magician?"}, {"viet": "Bạn thích có nhiều bạn bè chỉ quan hệ xã giao hay có vài người bạn thân mà thôi?", "eng": "Do you prefer to have many superficial friends or a few close friends?"}, {"viet": "Anh có nghĩ là anh có thể hỏi những người ở bàn kế bên xem chúng ta có thể xem thực đơn của họ không?", "eng": "Do you think you could ask the people at the next table if we could look at their menu?"}, {"viet": "Đứa bé này có phản ứng đối với các âm xung quanh của nó không?", "eng": "Does the child respond to auditory stimuli?"}, {"viet": "Đừng có tin hết mọi thứ cô ta nói với anh; cô ấy hay quan trọng hóa đấy.", "eng": "Don't believe everything she tells you; she tends to dramatize."}, {"viet": "Đừng ngại nói cho chúng tôi biết nếu anh gặp khó khăn.", "eng": "Don't hesitate to tell us if you have a problem."}, {"viet": "Đừng có thi vị hóa-hãy theo sát với sự thật.", "eng": "Don't romanticize-stick to the facts."}, {"viet": "Đừng có lo-còn có luật này luật khác chứ.", "eng": "Don't worried-there are rules and rules."}, {"viet": "Lái xe về hướng mặt trời, chúng tôi phải che mắt lại.", "eng": "Driving into the sun, we had to shade our eyes."}, {"viet": "Ăn uống từ từ và đừng ngấu nghiến như vậy!", "eng": "Eat slowly and don't gobble!"}, {"viet": "Thức ăn đầy đủ để bảo vệ sức khỏe của mình.", "eng": "Enough food to maintain one's strength."}, {"viet": "Ai ai cũng muốn thỉnh thoảng được chiều chuộng.", "eng": "Everybody enjoys being spoiled from time to time."}, {"viet": "Xin lỗi, tôi muốn thử cái áo khoác này.", "eng": "Excuse me, I would like to try this coat on."}, {"viet": "Thi rớt là một sự thất vọng đau xót đối với anh ta.", "eng": "Failing the exam was a bitter disappointment to him."}, {"viet": "Cảm thấy thương hại ai rất ít.", "eng": "Feel very little pity for somebody."}, {"viet": "Trước tiên, phải xẻ vịt ra, làm sạch, nhúng nước sôi và phơi khô.", "eng": "First, ducks must be split open, dressed, scalded and dried."}, {"viet": "Hãy gấp bức thư sao cho địa chỉ có thể được nhìn thấy qua ô giấy trong trên phong bì.", "eng": "Fold the letter so the address can be seen through the window of the envelope."}, {"viet": "Bắt ai chú ý tới người nào đó.", "eng": "Force one's attention on somebody."}, {"viet": "Từ thời điểm của thế kỷ thứ 20, chiến tranh hình như không đạt được bao nhiêu.", "eng": "From the vantage-point of the 20th century the war seems to have achieved little."}, {"viet": "Hỏi ý kiến luật sư về vấn đề đó.", "eng": "Get a lawyer's opinion on the question."}, {"viet": "Cho tôi biết anh hiểu tình huống đó thế nào.", "eng": "Give me your reading of the situation."}, {"viet": "Đi về phía bên kia của căn phòng.", "eng": "Go over to the other of the room."}, {"viet": "Hy Lạp là cái nôi của nền dân chủ.", "eng": "Greece is a home of democracy."}, {"viet": "Harry đã quyết định chiến thuật hay nhất là cầm chừng.", "eng": "Harry decided the best game plan was to stay loose."}, {"viet": "Gần đây bạn có nghe hoà nhạc không?", "eng": "Have you been to any concerts recently?"}, {"viet": "Ông có mang theo hộ chiếu không?", "eng": "Have you got your passport, please?"}, {"viet": "Kênh HBO đang phát một buổi trình diễn đặc biệt.", "eng": "HBO is showing a special presentation."}, {"viet": "Cậu ta luôn luôn cho cô ấy vay tiền, cậu ta quá dễ xiêu lòng.", "eng": "He's always lending her money, he's too soft-hearted."}, {"viet": "Ông ta di cư đến Mỹ và hoàn toàn mất hết chất quê hương.", "eng": "He's emigrated to the USA and gone completely native."}, {"viet": "Con ngựa đó chạy không nhanh nhưng chắc chắn đó là một con ngựa dai sức.", "eng": "He's not a fast horse but he's certainly a stayer."}, {"viet": "Anh ta thuộc loại người tôi rất ghét.", "eng": "He's the strain of person I really dislike."}, {"viet": "Anh ta luôn luôn quan trọng hóa cái dòng dõi thấp hèn của mình.", "eng": "He always makes much of his humble origins."}, {"viet": "Anh ta xử sự như thể là cứ có chức vụ cao thì đương nhiên có quyền buộc người khác phải tuân lệnh mình.", "eng": "He behaves as if high rank automatically confers the right to be obeyed."}, {"viet": "Anh ta có thể làm được những món kỳ diệu với vài thứ thừa lại của nhà bếp.", "eng": "He can do miracles with a few kitchen leftovers."}, {"viet": "Anh ấy thú nhận là đã giết cô ta.", "eng": "He confessed that he had murdered her."}, {"viet": "Anh ta từ chối tư cách làm cha đối với đứa trẻ.", "eng": "He denied paternity of the child."}, {"viet": "Ông ấy không biết cách điều khiển máy sấy.", "eng": "He doesn't know how to operate the dryer."}, {"viet": "Hắn đã chiếm đoạt các đá quý trong két sắt ngân hàng.", "eng": "He expropriated the jewels from the bank's safe."}, {"viet": "Anh ấy kiên nhẫn không nhắc lại vấn đề đó.", "eng": "He forbore to mention the matter again."}, {"viet": "Anh ta để hết tâm trí vào chiếc xe hơi của anh ta.", "eng": "He gives all his attention to his car."}, {"viet": "Ông ta vốn là người được nhà vua ưu ái, nên sự thất sủng của ông làm mọi người ngạc nhiên.", "eng": "He had been the king's favourite and his sudden fall from grace surprised everyone."}, {"viet": "Hắn có cái nhìn dâm dật khó ưa vô cùng.", "eng": "He has a most unpleasant leer."}, {"viet": "Anh ta đã chuyển nhượng toàn bộ tài sản đó cho Hội bảo tồn di tích lịch sử ở Anh.", "eng": "He has made over the whole property to the National Trust."}, {"viet": "Nó sống chết bám chặt cái cành cây.", "eng": "He held on to the branch like grim death."}, {"viet": "Anh ta hoàn toàn mù đối với lỗi lầm của cô ta.", "eng": "He is completely blind to her faults."}, {"viet": "Nói theo tục ngữ thì anh ta ở trong hoàn cảnh râu ông nọ cắm cằm bà kia.", "eng": "He is the proverbial square peg in a round hole."}, {"viet": "Nó đấm tôi một cú nằm thẳng cẳng.", "eng": "He knocked me flat with one punch."}, {"viet": "Anh ta sẽ không bao giờ trở thành diễn viên được.", "eng": "He'll never make an actor."}, {"viet": "Anh ta giữ vững một lập trường chính trị thiên hữu cứng nhắc.", "eng": "He maintains a rigidly right-wing political stance."}, {"viet": "Anh ta không bao giờ để bất cứ cái gì cản được chầu bia buổi chiều của anh ta.", "eng": "He never lets anything come between him and his evening pint of beer."}, {"viet": "Anh ấy đã nhặt quyển sách trên sàn nhà lên.", "eng": "He picked up the book from the floor."}, {"viet": "Anh ấy đã chứng minh là mình đúng và những người phê phán anh ta phải nhượng bộ.", "eng": "He proved that he was right and his critics had to back down."}, {"viet": "Anh ta ghét cay ghét đắng việc đi phố mua hàng nhưng rồi cũng phải đành ngậm đắng mà đi.", "eng": "He really hates shopping but he goes anyway, and takes his medicine like a man."}, {"viet": "Ông ta đáp lại ngay là tôi cũng có lỗi như ông ấy.", "eng": "He retorted that it was my fault as much as his."}, {"viet": "Ông ta chỉ nói thôi chứ không làm.", "eng": "He's all mouth and no action."}, {"viet": "Giọng anh ta chẳng khác nào tiếng còi.", "eng": "He's got a voice like fog-horn."}, {"viet": "Anh ta đi ra ngoài dắt theo con chó.", "eng": "He's out walking the dog."}, {"viet": "Anh ấy nói tôi không có kinh nghiệm vì thế ý kiến của tôi không có giá trị.", "eng": "He said that I had no experience so my opinion doesn't count."}, {"viet": "Dường như anh ta khá hài lòng về điều đó.", "eng": "He seems reasonably satisfied with it."}, {"viet": "Anh ấy tỏ ra hoàn toàn nắm vững chủ đề mà anh ta đã lựa chọn.", "eng": "He shows complete mastery of his chosen subject."}, {"viet": "Anh ta nói một giọng đều đều ngắn ngủi không xúc động đặc biệt của lời khai nhân chứng cảnh sát tại toà.", "eng": "He spoke in the clipped, clinical monotones typical of police testimony in court."}, {"viet": "Nó căng sợi dây cao su cho đến khi đứt phựt.", "eng": "He stretched the rubber band till it snapped."}, {"viet": "Anh ta dạy tiếng Anh như cha anh trước kia.", "eng": "He taught English as his father had before him."}, {"viet": "Ông ta ngồi ở cái ghế thường lệ bên lò sưởi.", "eng": "He took his accustomed seat by the fire."}, {"viet": "Ông ấy cố gắng không nghĩ đến cô ta mà không được.", "eng": "He tried without success to dismiss her memory from his thoughts."}, {"viet": "Nó bước ra đi trong tuyết rơi, người ủ trong một chiếc áo khoác ấm, cổ quấn khăn quàng dày.", "eng": "He walked out into the snow, heavily muffed in a thick scarf and warm overcoat."}, {"viet": "Anh ta luôn luôn tỏ ra trầm tĩnh trước hiểm nguy.", "eng": "He was always cool in the face of danger."}, {"viet": "Ông ta bị kết tội chống cự khi bị bắt.", "eng": "He was charged with resisting arrest."}, {"viet": "Anh ta bị phạt vì vượt quá giới hạn tốc độ quy định.", "eng": "He was fined for exceeding the speed limit."}, {"viet": "Anh ta hết lời ca ngợi đề án.", "eng": "He was lavish in praising the project."}, {"viet": "Anh ta rõ ràng là đang hồi hộp kích động.", "eng": "He was positively palpitating with excitement."}, {"viet": "Khi bị bắt, hắn ta vẫn đang mang hàng hoá trộm được.", "eng": "He was still carrying the stolen goods when he was pinched."}, {"viet": "Ông ta chán nản vì sự thất bại của mình.", "eng": "He was vexed at his failure."}, {"viet": "Anh ta sẽ đóng tại Rome.", "eng": "He will be based in Rome."}, {"viet": "Anh ta không thèm thảo luận vấn đề với chúng tôi.", "eng": "He would not deign to discus the matter with us."}, {"viet": "Alô, xin vui lòng cho tôi nói chuyện với Lưu Phương?", "eng": "Hello, May I speak to Liu Fang?"}, {"viet": "Cái áo cánh và cái váy của cô ta không hợp nhau.", "eng": "Her blouse and her skirt don't go together."}, {"viet": "Tham vọng công khai của cô ta là trở thành một chính khách.", "eng": "Her declared ambition is to become a politician."}, {"viet": "Cô ta đi chân vòng kiềng.", "eng": "Her feet turn in as she walks."}, {"viet": "Chồng của cô ấy là tất cả đối với cuộc đời cô ấy.", "eng": "Her husband is the be-all and end all of her existence."}, {"viet": "Vận may của cô ta hình như có khuynh hướng tăng lên.", "eng": "Her luck seems to be on the upturn."}, {"viet": "Cha mẹ cô ta đã khuyến khích cô ta trong học tập.", "eng": "Her parents encouraged her in her studies."}, {"viet": "Cú đánh trả quả giao bóng của cô ta rất nhanh.", "eng": "Her return of service was very fast."}, {"viet": "Nước mắt liên tục nhỏ xuống đôi má cô ta.", "eng": "Her tears strained continuously down her cheeks."}, {"viet": "Đây là những kết quả bóng đá tối nay.", "eng": "Here are tonight's football results."}, {"viet": "Hành động của anh ta không ăn khớp với những lời hứa của anh ta.", "eng": "His actions do not assort with his promises."}, {"viet": "Tiểu sử ông ta bị thêm thắt quá nhiều.", "eng": "His biography has been heavily embellished."}, {"viet": "Vẻ tự tin của ông ta nói lên ông là là một người lãnh đạo.", "eng": "His confident air hallmarked him as a leader."}, {"viet": "Những lời bào chữa của hắn không thuyết phục được tôi.", "eng": "His excuses cut no ice with me."}, {"viet": "Ở câu lạc bộ, quần áo sang trọng của anh ta khiến anh ta thành lạc lõng.", "eng": "His formal clothes made him the odd one out in the club."}, {"viet": "Thành tích tiến bộ của anh ấy làm vẻ vang cho huấn luyện viên.", "eng": "His improved performance does credit to his trainer."}, {"viet": "Các tác phẩm chính của ông ta gần như là sinh động tuyệt vời.", "eng": "His major writings have a proximity that is splendidly invigorating."}, {"viet": "Tính lạc quan của anh ta không hề bị những khó khăn làm mờ đi.", "eng": "His optimism was not at all adumbrated by difficulties."}, {"viet": "Mạch nó đập nhanh lên khi nó đứng trước kẻ đột nhập có vũ khí.", "eng": "His pulse raced as he faced the armed intruder."}, {"viet": "Chân đau của anh ấy sẽ là một điều trở ngại trong cuộc đua.", "eng": "His sore leg will be a handicap in the race."}, {"viet": "Những chầu rượu khủng khiếp của anh ta đã tàn phá sức khoẻ của anh ta.", "eng": "His tremendous bouts of drinking had wrecked his health."}, {"viet": "Nghề viết văn đem lại cho anh ấy 10.000 bảng Anh một năm.", "eng": "His writing brings him £ 10,000 a year."}, {"viet": "Hi vọng anh chị vui vẻ khi ở khách sạn của chúng tôi!", "eng": "Hope you enjoy your stay at our hotel!"}, {"viet": "Làm sao tôi có thể đền đáp lại bạn đây?", "eng": "How can I ever repay you?"}, {"viet": "Bạn đã tìm căn hộ của bạn như thế nào vậy?", "eng": "How did you find your apartment?"}, {"viet": "Còn có cách nào khác để làm việc đó không anh?", "eng": "How else would you do it?"}, {"viet": "Những vé này sẽ có giá trị trong bao lâu?", "eng": "How long will these tickets be valid?"}, {"viet": "Anh có thể nhảy dây được bao nhiêu cái mà không ngừng?", "eng": "How many skips can you do without stopping?"}, {"viet": "Bạn sẽ nhận được bao nhiêu tiền từ chiếc xe bạn đổi cho cửa hang John?", "eng": "How much money will you get from your trade-in, John?"}, {"viet": "Cho dù tôi tiếp cận vấn đề cách nào, tôi cũng không tìm ra được một giải pháp.", "eng": "However I approached the problem, I couldn't find a solution."}, {"viet": "Tôi muốn đích thân mời một giáo sư nữa dạy ở nhà.", "eng": "I'd like another professor in the house myself."}, {"viet": "Tháng đó tôi làm việc căng thẳng đến tột cùng vì vậy tôi ngủ ba ngày khi tôi được nghỉ.", "eng": "I'd really maxed out that month at work, so I just slept for three days when I had time off."}, {"viet": "Tôi sẽ chẳng làm ăn với anh ta nữa.", "eng": "I'll have no further dealings with him."}, {"viet": "Tôi sẽ nghe điện thoại trong văn phòng của tôi.", "eng": "I'll take the call in my office."}, {"viet": "Tôi sợ đề nghị của ông khó lòng phù hợp với trường hợp này.", "eng": "I'm afraid your proposal hardly meets the case."}, {"viet": "Tôi sẽ trở thành một ngôi sao nhạc pop như Michael Jackson.", "eng": "I'm going to be a pop star like Michael Jackson."}, {"viet": "Tôi mới làm công việc này và chưa hoàn toàn thông thạo với các thủ tục.", "eng": "I'm new to the job and not quiet au fait with all the procedures yet."}, {"viet": "Tôi hơi túng tiền-anh cho tôi mượn một ít được không?", "eng": "I'm rather short of LSD-can you land me some?"}, {"viet": "Ở trong này tôi cảm thấy khó thở quá, chúng ta không thể mở vài cửa sổ ra sao?", "eng": "I'm suffocating in here, can't we open a few windows?"}, {"viet": "Tôi rất vui được gặp ông, ông Miller.", "eng": "I'm very happy to meet you, Mr. Miller."}, {"viet": "Ngày xưa tôi đã đến đó nhiều lần.", "eng": "I've been their many times in the past."}, {"viet": "Tôi đã chán ngấy sự ăn nói huyên thiên không ngớt của cô ta.", "eng": "I've had enough of her continual chatter."}, {"viet": "Tôi đã đỗ tất cả các môn-Mừng cho cậu.", "eng": "I've passed all my exams-Good for you."}, {"viet": "Tôi tán thành cách phân tích tình hình của anh ta.", "eng": "I agree with his analysis of the situation."}, {"viet": "Tôi ở đây theo lệnh nhà vua.", "eng": "I am here at the King's command."}, {"viet": "Tôi đã đến sớm vài phút.", "eng": "I arrived a couple of minutes early."}, {"viet": "Tôi mua vé đi nghỉ qua người đại lý du lịch ở địa phương tôi.", "eng": "I booked my holiday through my local travel agent."}, {"viet": "Tôi không thể ăn thêm được nữa, bụng tôi căng phồng lên rồi.", "eng": "I can't eat any more, my stomach's bulging."}, {"viet": "Tôi không chịu được âm nhạc hiện đại, hãy cho tôi nghe Bach và Mozart bất cứ lúc nào!", "eng": "I can't stand modern music, give me Bach and Mozart every time!"}, {"viet": "Tôi có thể đọc khá rõ mà không cần đeo kính.", "eng": "I can read well enough without glasses."}, {"viet": "Hình như tôi không thể chặn được cơn ho.", "eng": "I can't seem to stop coughing."}, {"viet": "Tôi có thể thấy cô ta bị xúc động vì những điều anh ta nói.", "eng": "I could see she was touched by what he said."}, {"viet": "Tôi muốn dùng thịt gà nướng vỉ.", "eng": "I'd like to have the grilled chicken."}, {"viet": "Tôi không cần phải đến ngân hàng nữa-tôi đã mượn Mary một ít tiền.", "eng": "I didn't need to go to the bank-I borrowed some money from Mary."}, {"viet": "Tôi không hiểu, tại sao cô ấy lại làm một chuyện như thế?", "eng": "I don't get it, why would she do a thing like that?"}, {"viet": "Tôi không thích chiếc áo sơ mi đỏ mà cũng không thích cả chiếc màu xanh.", "eng": "I don't like the red shirt and I don't like the green one either."}, {"viet": "Tôi không muốn anh có bất kỳ sự can thiệp nào!", "eng": "I don't want any interference from you!"}, {"viet": "Tôi không biết phải nói như thế nào với cô ấy.", "eng": "I don't know to tell her."}, {"viet": "Tôi coi đây là một vinh dự đặc biệt được phát biểu trước một cửa tọa ưu tú như thế.", "eng": "I esteem it a privilege to address such a distinguished audience."}, {"viet": "Tôi cảm thấy khoẻ như vâm sau cuộc đi bộ vào ngày nghỉ.", "eng": "I felt as fit as a fiddle after my walking holiday."}, {"viet": "Tôi tìm được căn hộ của tôi qua một người buôn bán bất động sản.", "eng": "I found mine through a realtor."}, {"viet": "Tôi đã mua nó với giá bán xôn ở cửa hàng bách hoá ABC.", "eng": "I got it at a bargain sale at ABC Department Store."}, {"viet": "Tôi nghĩ tốt hơn là nên bắt đầu tự giới thiệu mình.", "eng": "I had better begin by introducing myself."}, {"viet": "Tôi ghét bà già bên cạnh-bà ta là một người thật nhếch nhác.", "eng": "I hate the old lady next door-she's a real flea-bag."}, {"viet": "Tôi vẫn thường nghe nhắc đến tên ông và những công trình tuyệt vời của ông.", "eng": "I have heard your name and of your splendid work quite often."}, {"viet": "Tôi có một ít việc cho anh làm.", "eng": "I have some work for you to do."}, {"viet": "Tôi chưa nhận được lá thư nào của anh ta.", "eng": "I haven't received a letter from him yet."}, {"viet": "Tôi nghe nói Yoshiko sắp bắt đầu học ngoại ngữ.", "eng": "I heard that Yoshiko is going to take up a foreign language."}, {"viet": "Tôi hy vọng anh sẽ vui thích buổi tối hôm nay.", "eng": "I hope you enjoy yourself this evening."}, {"viet": "Tôi đã biết tôi là một người gây trở ngại cho họ.", "eng": "I knew I was an encumbrance to them."}, {"viet": "Mình đã cho John mượn đĩa hát đó nhưng không bao giờ lấy lại được.", "eng": "I lent that record to John but never got it back."}, {"viet": "Khoảng 8 giờ tôi sẽ trở lại.", "eng": "I'll be back around eight o'clock."}, {"viet": "Tôi sẽ phải thử ăn xem.", "eng": "I'll have to try it and see."}, {"viet": "Tôi đã bị mất bóp trong đó có thẻ tín dụng của tôi.", "eng": "I lost my wallet which contains my credit cards."}, {"viet": "Tôi rất vui là bạn có thể đến.", "eng": "I'm glad you could make it."}, {"viet": "Tôi không thích nghe nhạc Jazz lắm.", "eng": "I'm not too keen on jazz."}, {"viet": "Tôi sẽ làm việc với một hãng điện tử.", "eng": "I'm wish an electronics firm."}, {"viet": "Tôi phải gạo môn tiếng Pháp của tôi trước khi đi Paris.", "eng": "I must bone up on my French before we go to Paris."}, {"viet": "Tôi cần vài mét vải để may một cái áo dài.", "eng": "I need several metres of cloth to make a long dress."}, {"viet": "Tôi thường hay ngủ thiếp đi một tí sau bữa ăn trưa.", "eng": "I often nod off for a little while after lunch."}, {"viet": "Tôi coi như là cuối cùng sẽ đạt được một thỏa hiệp.", "eng": "I presume that an agreement will eventually be reached."}, {"viet": "Tôi thực là xổng mồm khi hỏi thăm vợ anh ấy, cô ta đã bỏ anh ấy theo một người đàn ông khác rồi.", "eng": "I really put my foot in it when I asked him how his wife was, she's left him for another man."}, {"viet": "Tôi kính trọng anh về sự thật thà của anh.", "eng": "I respect you for your honesty."}, {"viet": "Tôi thấy ông dùng đũa thật thành thạo.", "eng": "I see you're quite expert with chopsticks."}, {"viet": "Giá phải tôi thì tôi không tuyển dụng họ-họ chỉ là một lũ tài tử.", "eng": "I shouldn't employ them-they're just a bunch of amateurs."}, {"viet": "Tôi đột nhiên cảm thấy hơi khó ở nên phải nằm xuống.", "eng": "I suddenly came over all queer and had to lie down."}, {"viet": "Tôi nghĩ tôi sẽ ghé lại chỗ anh xem anh có khoẻ không.", "eng": "I think I'd call by and see how you were."}, {"viet": "Tôi nghĩ rằng việc nghiên cứu não người là rất quan trọng trong thế kỉ 21.", "eng": "I think that studying the human brain is very important for the 21st century."}, {"viet": "Tôi nghĩ cuốn phim đó hơi xa rời thực tế.", "eng": "I thought the film was rather unrealistic."}, {"viet": "Tôi đã cố báo trước cho nó biết, nhưng nó không chịu nghe.", "eng": "I tried to warn him, but he wouldn't listen."}, {"viet": "Tôi chưa từng nếm qua bất cứ thứ gì như thế này cả.", "eng": "I've never tasted anything like it."}, {"viet": "Tôi muốn phỏng vấn cô về chỗ này.", "eng": "I want to interview you about this place."}, {"viet": "Tôi ngạc nhiên vì sự xuất hiện đột ngột của anh ta.", "eng": "I was astonished at his sudden appearance."}, {"viet": "Đầu óc tôi như một mớ bòng bong đến nỗi tôi không còn biết hôm nay là thứ mấy nữa.", "eng": "I was in such a muddle that I didn't even know what day it was."}, {"viet": "Câu I was speaking là ở thời quá khứ tiếp diễn.", "eng": "I was speaking is in the imperfect."}, {"viet": "Tôi đi từ Luân Đôn đến Birmingham qua Oxford.", "eng": "I went from London to Birmingham via Oxford."}, {"viet": "Tôi xin chúc hội nghị thành công tốt đẹp.", "eng": "I wish the conference a great success."}, {"viet": "Em không biết tối nay chúng ta nên ăn tối với món gì?", "eng": "I wonder what we should have for dinner this evening?"}, {"viet": "Tôi muốn đổi chỗ ngồi của tôi.", "eng": "I would like to change my seat."}, {"viet": "Tôi đã không xung phong đi tưới cây nếu tôi biết có nhiều như thế này.", "eng": "I wouldn't have offered to water the plants if I'd known there were so many."}, {"viet": "Nếu nó lại quấy rầy anh, tôi sẽ rầy la cho nó một trận.", "eng": "If he bothers you again I'll give him an earful."}, {"viet": "Nếu người ta phát hiện ra nó đúng lúc thì có thể có những cơ may chữa trị nó.", "eng": "If it is discovered in time, the chances of curing it are very good."}, {"viet": "Tâm Phật thì khẩu Phật.", "eng": "If there is goodness in your heart, it will come to your tongue."}, {"viet": "Nếu chị vô tình đánh rơi chiếc nhẫn kim cương xuống chậu rửa bát.", "eng": "If you absentmindedly drop a diamondring down the sink."}, {"viet": "Nếu bạn không hiểu một từ nào thì hãy tra nghĩa ở cuốn sách này.", "eng": "If you don't understand a word look up its meaning in this book."}, {"viet": "Nếu anh đọc bản chỉ dẫn thì anh sẽ thấy chỗ nào anh đã sai.", "eng": "If you read the instructions, you'll see where you went wrong."}, {"viet": "Nếu công việc làm của anh không khá lên thì đó là sự kết thúc của anh đấy.", "eng": "If your work doesn't improve it will be curtains for you."}, {"viet": "Trong hệ thống chữ B-ray mỗi chữ cái là những chấm nhỏ nổi lên trên trang giấy.", "eng": "In Braille each letter is made of dots which are raises from the page."}, {"viet": "Trong trạng thái buồn ngủ của nó, tiếng ô tô chạy tới gần ngôi nhà hầu như không có tác động gì đến ý thức của nó.", "eng": "In his sleepy state, the sound of a car driving up to the house scarcely impinged on his consciousness."}, {"viet": "Ở một số nước những người không đồng ý với chính phủ bị xếp vào loại tội phạm.", "eng": "In some countries, people who disagree with the government are classes as criminals."}, {"viet": "Trong các vòng bầu cử cuối cùng, đảng chúng ta đã nắm được quyền kiểm soát ( hội đồng ).", "eng": "In the latest elections our party has got control ( of the council )."}, {"viet": "Anh nghĩ là bộ phim đã thiên về khía cạnh nào?", "eng": "In what respect do you think the film is biased?"}, {"viet": "Liệu 100 pao có đủ cho tất cả các chi tiêu của anh không?", "eng": "Is 100 pounds enough for all your expenses?"}, {"viet": "Bức hoạ đó là nguyên bản hay là phiên bản?", "eng": "Is that painting an original or a reproduction?"}, {"viet": "Đây là chuyến bay thẳng hay là chúng ta phải đỗ nghỉ ở đâu đó?", "eng": "Is this a continuous flight, or do we stop off anywhere?"}, {"viet": "Thật may là chúng ta đã đem dù theo.", "eng": "It's a good thing we brought the umbrella."}, {"viet": "Tìm công ăn việc làm ngày một khó khăn hơn.", "eng": "It's becoming increasingly difficult to find work."}, {"viet": "Thật mừng khi thấy cụ Jerkins đã bình phục.", "eng": "It's good to see old Mr. Jerkins out and about again."}, {"viet": "Mời anh ta tham gia nghiệp đoàn là điều vô ích-anh ta thực sự là một kẻ bảo thủ.", "eng": "It's no good asking to join the union, he's a real die-hard."}, {"viet": "Thật đáng hổ thẹn là xã hội ta ít chăm sóc người nghèo.", "eng": "It's quite shaming that our society cares so little for the poor."}, {"viet": "Chuyến đi đó quá dài không thể thực hiện trong một ngày.", "eng": "It's too long a journey to make in one day."}, {"viet": "Cái đó phải trả một số tiền rất lớn.", "eng": "It cost a prodigious amount of money."}, {"viet": "Nên thắt dây lưng an toàn trong khi lái xe.", "eng": "It is advisable to wear a safety belt when you're driving."}, {"viet": "Theo tôi tin chắc thì nó điên.", "eng": "It is my private persuasion that he is mad."}, {"viet": "Nó nằm đó, mắt nhắm nghiền, chết đứ đừ.", "eng": "It lay there with its eyes closed, dead as a doornail."}, {"viet": "Đó là một khối văn phòng hiện đại.", "eng": "It's a modem office block."}, {"viet": "Đây là phiếu yêu cầu đổi ngoại tệ.", "eng": "It's the foreign exchange request."}, {"viet": "Mỗi người mỗi tính mỗi tài.", "eng": "It takes all sorts to make the world."}, {"viet": "Mọi thứ đó là một mánh khoé nhằm làm người ta xao lãng không chú ý tới mục tiêu thực của hắn.", "eng": "It was all a ploy to distract attention from his real aims."}, {"viet": "Ngài thật là cao thượng khi nhận một mức lương thấp để giúp đỡ công ty.", "eng": "It was noble of you to accept a lower salary to help the company."}, {"viet": "May mà không ai thấy nó.", "eng": "It was well for him that nobody saw him."}, {"viet": "Nước Ý dưới thời Mussolini có một chính phủ độc tài.", "eng": "Italy under Mussolini, had a totalitarian government."}, {"viet": "Lá thăm của John đã nghiêng về phía chúng tôi, và chúng tôi đã thắng cử.", "eng": "John's vote tipped the scales in our favor, and we won the election."}, {"viet": "Chỉ cần anh nói một lời là tôi sẽ yêu cầu hắn ta đi ngay.", "eng": "Just say the word, and I'll ask him to leave."}, {"viet": "Sau đó xuất hiện các sảnh đường hình đa giác, hình tròn, hình chữ thập và các hình dáng khác.", "eng": "Later, there appeared polygonal shaped, circular shaped, cross shaped and other shaped pavilions."}, {"viet": "Chúng ta hãy lái xe đến thăm chỗ đó đi.", "eng": "Let's drive to visit it."}, {"viet": "Xếp đặt một cuộc hẹn với Bill ở quán rượu vào lúc hai giờ.", "eng": "Make a rendezvous with Bill at the pub at two o'clock."}, {"viet": "Nhiều người đã bị chôn vùi trong đống gạch vụn của những toà nhà bị trúng bom.", "eng": "Many people were entombed in the rubble of the bombed buildings."}, {"viet": "Mẹ hãy mát-xa chân và uống nhiều nước.", "eng": "Massage your feet and drink plenty of liquids."}, {"viet": "Xin cho phép chúng tôi được tự giới thiệu là một nhà sản xuất giày và găng tay da?", "eng": "May we introduce ourselves as a manufacturer of leather shoes and gloves?"}, {"viet": "Hầu hết người Anh đều có quán rượu ở địa phương họ, ở đó họ có thể thoát khỏi áp lực của cuộc sống gia đình hay công việc, và nếu họ may mắn thì kể những rắc rối của họ cho một cô bán rượu xinh đẹp.", "eng": "Most Englishmen have their local pubs, where they can escape from the pressures of family life or work, and if they are lucky, tell their troubles to a pretty barmaid."}, {"viet": "Ông Vương là thư ký của câu lạc bộ Nhạc sĩ.", "eng": "Mr. Wang is the secretary of the Musicians'club."}, {"viet": "Xe của tôi bị sa lầy và nó chẳng nhúc nhích.", "eng": "My car's stuck in the mud and it won't budge."}, {"viet": "Bạn tôi đã thành công mĩ mãn trong công việc làm ăn và bây giờ rất giàu.", "eng": "My friend was very successful in his business and is now in the money."}, {"viet": "Ô tô mới của tôi thật quả xài xăng quá nhiều.", "eng": "My new car really runs away with the petrol."}, {"viet": "Đồng hồ của tôi không chạy kể từ khi nó rơi vào bồn tắm.", "eng": "My watch won't go since it fell in the bathtub."}, {"viet": "New York được bố trí theo hình bàn cờ.", "eng": "New York is laid out on a grid pattern."}, {"viet": "Chưa, chưa đo thân nhiệt, nhưng tôi thấy hơi sốt.", "eng": "No, not yet, but I do feel a little feverish."}, {"viet": "Mãi đến tám giờ mới có người xuất hiện, vì vậy họ đã bắt đầu sau tám giờ ba mươi một phút.", "eng": "Nobody showed up until eight, so they started a little after eight-thirty."}, {"viet": "Bây giờ anh đã biết công việc đó liên quan tới những gì, đây là cái mà anh phải tập trung giải quyết.", "eng": "Now you know what the job involves, here's something to get your teeth into."}, {"viet": "Ồ, hãy nhìn cần câu của người đàn ông kia kìa.", "eng": "Oh, look at that man's pole."}, {"viet": "Bản báo cáo đã làm thinh một cách kỳ quặc về một số chi tiết quan trọng.", "eng": "On certain important details the report remains strangely silent."}, {"viet": "Chỉ một động tác cựa quậy là mày chết ngay', tên cướp gầm gừ.", "eng": "One false move and you're a dead man', snarled the robber."}, {"viet": "Chỉ những người ở độ tuổi 20-30 là cần nộp đơn.", "eng": "Only people in the age group 20-30 need apply."}, {"viet": "Toàn bộ các loại xe hơi của chúng tôi hiện đang được trưng bày tại gian hàng mẫu ở địa phương của các ông.", "eng": "Our entire range of cars is now on view at your local showroom."}, {"viet": "Thư ký mới của chúng ta là một người rất đáng giá.", "eng": "Our new secretary is a perfect treasure."}, {"viet": "Máy giặt của chúng tôi bị hỏng, tôi sẽ gọi thợ điện.", "eng": "Our washing machine has broken, I'll ring the electrician."}, {"viet": "Hành khách không bao giờ nên xuống khi xe buýt đang chạy.", "eng": "Passengers should never alight from a moving bus."}, {"viet": "Người đi dạo đi qua đi lại.", "eng": "People walking to and fro on the promenade."}, {"viet": "Xin mời ông ngồi và cứ tự nhiên như ở nhà ông vậy.", "eng": "Please sit down and make yourself at home."}, {"viet": "Nâng mức thuế quan đánh vào hàng ngoại.", "eng": "Raise tariff barriers against foreign goods."}, {"viet": "Ghế ngồi ở rạp chiếu bóng thường được đánh số.", "eng": "Seats in a cinema are usually numbered."}, {"viet": "Hôm nay giá cổ phần ở Phố Uôn tụt xuống.", "eng": "Share prices fell on Wall Street today."}, {"viet": "Bà ta luôn luôn chỉ trích con cái của bà ta trước mặt mọi người.", "eng": "She's always running her children down in public."}, {"viet": "Cô ta đang cố gắng đạt kỷ lục thế giới về môn nhảy cao.", "eng": "She's going for world record in the high jump."}, {"viet": "Cô ta không ngồi một mình chỉ để hóng mát.", "eng": "She's not sitting on that bench alone just to get fresh air."}, {"viet": "Cô ta chịu ơn hắn bởi vì hắn cho cô ta mượn tiền.", "eng": "She's under an obligation to him because he lent her money."}, {"viet": "Cô ấy trả lời không với một cái lắc đầu.", "eng": "She answered no with a shake of the head."}, {"viet": "Nó chưa biết xem giờ, nó mới chỉ 2 tuổi!", "eng": "She can't tell the time yet, she's only two!"}, {"viet": "Cô ấy không thể nào làm mọi người nghe thấy được tiếng nói của mình trong tiếng ồn ào của xe cộ.", "eng": "She couldn't make her voice heard above the noise of the traffic."}, {"viet": "Cô ta biến mất và không ai biết gì về cô nữa.", "eng": "She disappeared and was never heard of again."}, {"viet": "Cô ta cảm thấy tức vì không được mời dự liên hoan.", "eng": "She feels sore about not being invited to the party."}, {"viet": "Cô ấy đã kể cho bố mẹ của cô ấy nghe đại khái những sự việc đã xảy ra đêm đó còn giấu giếm.", "eng": "She gave her parents a potted version of the night's events."}, {"viet": "Cô ấy bị một tai nạn khủng khiếp nhưng ít nhất thì cô ấy cũng không chết.", "eng": "She had a terrible accident, but at all events she wasn't killed."}, {"viet": "Cô ta thích phomat Pháp.", "eng": "She has a partiality for French cheese."}, {"viet": "Bà ta có hai đứa con và đang có mang đứa thứ ba.", "eng": "She has two children with another one on the way."}, {"viet": "Bà ta đang lãnh đạo chiến dịch đòi nâng cao chất lượng phục vụ của xe buýt-mong cho bà thành công!", "eng": "She is campaigning for an improved bus service-more power to her elbow!"}, {"viet": "Ngay bây giờ cô ấy không có nhà.", "eng": "She isn't at home right now."}, {"viet": "Cô ta sống một cuộc sống thoải mái vô tư lự và chẳng bao giờ lo lắng nhiều tới điều gì.", "eng": "She lives a free and easy sort of life and never trouble about anything."}, {"viet": "Cô ta say mê giữ nhà sạch sẽ, ngăn nắp.", "eng": "She makes a religion of keeping her house clean and tidy."}, {"viet": "Cô ta mở rộng thêm cửa để nhìn cho rõ hơn.", "eng": "She opened the door wider to get a better look."}, {"viet": "Cô ta nhét tất cả tóc vào bên dưới chiếc khăn bịt đầu.", "eng": "She pushed all her hair under a headscarf."}, {"viet": "Cô ta xông lên bất chấp nguy hiểm.", "eng": "She rushed forward in complete contempt of danger."}, {"viet": "Nàng quan tâm đến điện ảnh.", "eng": "She's interested in the cinema."}, {"viet": "Bà ta nói rằng cuốn sách là dựa trên một chuyện có thật.", "eng": "She said that the book was based on a true story."}, {"viet": "Cô ta rùng mình trước ý nghĩ đi vào ngôi nhà tối tăm đó một mình.", "eng": "She shivered at the thought of going into the dark house alone."}, {"viet": "Cô ấy đã bỏ ra một giờ để trang điểm trước buổi liên hoan.", "eng": "She spent an hour making up before the party."}, {"viet": "Mặc dầu có tật, cô ta bơi vẫn giỏi.", "eng": "She swims well despite her disabilities."}, {"viet": "Cô ta làm vẻ lãnh đạm.", "eng": "She tried to assume an air of indifference."}, {"viet": "Cô ta muốn có một công việc có nhiều trách nhiệm hơn.", "eng": "She wants a job that gives her more responsibility."}, {"viet": "Cô ta đã bị ngăn lại không cho dự thi vì tuổi tác.", "eng": "She was barred from the competition because of her age."}, {"viet": "Cô ta hơi ngớ ngẩn, nên không bao giờ được để ngồi một mình.", "eng": "She was getting a bit dotty and could never be let alone."}, {"viet": "Bà ta được đề nghị một chức vụ trong chính phủ mới.", "eng": "She was offered a post in the new government."}, {"viet": "Cô ấy đứng bên cửa sổ, vẻ như rất bình tĩnh và thư thái.", "eng": "She was standing by the window, apparently quite calm and relaxed."}, {"viet": "Cô ta đã kiệt sức vì làm việc.", "eng": "She was worn out with work."}, {"viet": "Cô ta rút hết tiền tiết kiệm và bỏ ra nước ngoài.", "eng": "She withdrew all her savings and left the country."}, {"viet": "Bà ấy viết những cuốn tiểu thuyết thuộc phái vị lai về những chuyến đi tới những thiên hà xa.", "eng": "She writes futuristic novels about voyages to distant galaxies."}, {"viet": "Chỉ cho tôi cách làm món đó đi.", "eng": "Show me how it's made."}, {"viet": "Vì sắp có cuộc tổng tuyển cử, thủ tướng quyết định rằng sự thay đổi chính sách có lợi về mặt chính trị.", "eng": "Since there was soon to be an general election, the Prime Minister decided that a change policy was politically expedient."}, {"viet": "Làm sóng sánh nước trong xô.", "eng": "Sloshing the water around in the pail."}, {"viet": "Người ta còn làm nhiều chuyện phạm pháp nữa kìa.", "eng": "So are a lot of things that people do all the time."}, {"viet": "Quân lính được huấn luyện tuân lệnh triệt để.", "eng": "Soldiers are trained to obey without question."}, {"viet": "Vài nghị sĩ tuân thủ đường lối của đảng về quốc phòng.", "eng": "Some MPs refused to toe the party line on defence."}, {"viet": "Một số trường học hiện nay quyên tiền của các phụ huynh để mua sách mới.", "eng": "Some schools are now going to parents with a begging bowl to raise money for new books."}, {"viet": "Đôi khi chuyện đó giúp anh hiểu được nguyên nhân anh hành động theo cách nào đó, hoặc là tại sao anh lại yêu loại người luôn làm cho anh đau khổ vân vân.", "eng": "Sometime it helps you see why you act a certain way, or why you fall in love with the kind of person who makes you unhappy and so forth."}, {"viet": "Những khó khăn trở ngại của riêng những người mù.", "eng": "Special difficulties unique to blind people."}, {"viet": "Trình bày ý kiến của mình với giọng quả quyết.", "eng": "State one's opinions in an assertive tone of voice."}, {"viet": "Ngưng đùa cợt và đứng đắn một lát đi!", "eng": "Stop jesting and be serious for a moment!"}, {"viet": "Sinh viên đã dính líu đến những vụ xô xát dữ dội với cảnh sát.", "eng": "Students were involved in violent clashes with the police."}, {"viet": "Những chuyện như thế không thể cho phép được.", "eng": "Such things ought not to be allowed."}, {"viet": "Chắc chắn một người nào đó hoặc vài người khác nữa sẽ giúp tôi.", "eng": "Surely some friend of others will help me."}, {"viet": "Tính đến yếu tố lạnh và gió đối với cơ thể.", "eng": "Take into account the wind chill factor."}, {"viet": "Dạy cho hắn tiếng Hy lạp là một quá trình vất vả.", "eng": "Teaching him Greek was a painful process."}, {"viet": "Bọn khủng bố đánh bom đồn cảnh sát để trả thù các vụ bắt bớ.", "eng": "Terrorists bombed the police station in revenge for the arrests."}, {"viet": "Đây không phải là một bức tranh gốc của Rembrandt mà chỉ là một bản sao chép.", "eng": "That's not an original Rembrandt, it's an imitation."}, {"viet": "Món cari đó đang làm rối loạn bụng mình!", "eng": "That curry is playing hell with my insides!"}, {"viet": "Tất cả là 2,20 đô la", "eng": "That'll be $ 2,20 altogether"}, {"viet": "Nói như vậy thật là hay ho dữ đấy!", "eng": "That's a nice thing a say!"}, {"viet": "Có một ánh sáng đỏ mờ đục trong bầu trời đêm trên xưởng luyện thép.", "eng": "That was a dull red glow in the night sky above the steelworks."}, {"viet": "Tai nạn xảy ra không phải do lỗi của tôi.", "eng": "The accident happened through no fault of mine."}, {"viet": "Viên đô đốc đi thăm các tàu thuộc quyền chỉ huy của mình bằng trực thăng.", "eng": "The admiral visits the ships under his command by helicopter."}, {"viet": "Người Mỹ nhìn cuộc đời khác người Anh.", "eng": "The Americans look at life differently from the British."}, {"viet": "Các nhà khảo cổ học đã phát hiện được một số di vật quan trọng.", "eng": "The archaeologists have made a number of important discoveries."}, {"viet": "Nhà họa sĩ yêu cầu người mẫu giữ tư thế nằm nghiêng.", "eng": "The artist asked his model to take a reclining posture."}, {"viet": "Các nhà chức trách không tỏ ra có dấu hiệu nhượng bộ những yêu sách của bọn bắt cóc.", "eng": "The authorities showed no signs of giving in to the kidnapper's demands."}, {"viet": "Quả bóng đụng trúng đầu cô ta.", "eng": "The ball hit her on the head."}, {"viet": "Người ta đơn ca giọng trầm có tiếng hát rất hay.", "eng": "The bass soloist was in excellent voice."}, {"viet": "Càng biết rõ cô ta, tôi càng khâm phục cô ta.", "eng": "The better I know her, the more I admire her."}, {"viet": "Cú đánh vào đầu đã làm tổn thương thị lực của anh ấy.", "eng": "The blow on the head impaired his vision."}, {"viet": "Cuốn Sách được cho là quyển sách bán chạy nhất.", "eng": "The book is arguably a potential best seller."}, {"viet": "Cậu bé đã van nài để được phép đi với chúng tôi.", "eng": "The boy begged that he might be begged to be allowed to come with us."}, {"viet": "Ánh đèn chói làm cô nhìn chỗ khác.", "eng": "The bright light made her look away."}, {"viet": "Tiền vé xe buýt tăng từ 35 xu lên 40 xu.", "eng": "The bus fare has gone up from 35p to 40p."}, {"viet": "Khoang tàu mang phi hành đoàn của tàu vũ trụ bốc cháy.", "eng": "The capsule carrying the crew of the space craft caught fire."}, {"viet": "Chiếc xe ôtô bị trượt bánh, lật úp và bốc cháy.", "eng": "The car skidded, turned over and burst into flames."}, {"viet": "Con mèo xù lông khi nhìn thấy con chó lớn.", "eng": "The cat bristled at the sight of the large dog."}, {"viet": "Con tắc kè hoa có thể đổi màu theo khung cảnh.", "eng": "The chameleon can take on the colours of its background."}, {"viet": "Đứa trẻ nhìn chằm chằm vào những đồ chơi trong cửa kính.", "eng": "The child gazed at the toys in the shop window."}, {"viet": "Bọn trẻ con đang làm thần kinh tôi căng thẳng-Tối nay tôi đã quá sức chịu đựng chúng!", "eng": "The children are getting on my nerves-I've had my fill of them for this evening!"}, {"viet": "Bọn trẻ sống tuổi thơ ở đó.", "eng": "The children spent their childhood there."}, {"viet": "Giáo hội phải làm gương nhiều hơn về các vấn đề đạo đức cơ bản.", "eng": "The Church should give more of a lead on basic moral issues."}, {"viet": "Màu trắng trơn của căn phòng.", "eng": "The clinical whiteness of the room."}, {"viet": "Cuộc quyên tiền sẽ được thực hiện sau bài thuyết pháp.", "eng": "The collection will be made after the sermon."}, {"viet": "Tập cùng bộ sẽ sớm được xuất bản.", "eng": "The companion volume will soon be published."}, {"viet": "Công ty này bị mất vốn nhiều và nhanh chóng khi được một hãng khác mua.", "eng": "The company was haemorrhaging capital when it was bought by another firm."}, {"viet": "Hiến pháp của một nước là linh hoạt ở chỗ nó có thể tu chỉnh một cách dễ dàng.", "eng": "The constitution of the country is flexible, in that it can be amended easily."}, {"viet": "Hội đồng lại sử dụng quá mức ngân sách của mình.", "eng": "The council has overspent its budget again."}, {"viet": "Tòa án đã phán quyết có lợi cho hắn.", "eng": "The court decided in his favour."}, {"viet": "Dân chúng tung hô ầm ĩ khi Nữ hoàng xuất hiện.", "eng": "The crowd cheered loudly as the Queen appeared."}, {"viet": "Phong tục này được phục hồi sau vài thế kế kỷ ngưng.", "eng": "The custom was revived after an abeyance of several centuries."}, {"viet": "Con số chết người trên xa lộ Santa Ana thật kinh hãi.", "eng": "The death toll on the Santa Ana is terrible."}, {"viet": "Gian hàng đó được tân trang lại để cố cải thiện hoạt động của mình.", "eng": "The department was revamped to try to improve its performance."}, {"viet": "Món ăn đêm nay là điều tôi ít lo nhất.", "eng": "The dinner menu is the least important of my worries."}, {"viet": "Ông bác sĩ khuyên tôi ở trong nhà vài ngày.", "eng": "The doctor advised me to stay in for a few days."}, {"viet": "Lông con chó dựng đứng lên vì nó đánh hơi thấy nguy hiểm.", "eng": "The dog's fur bristled as it sensed danger."}, {"viet": "Cái cửa nhìn thẳng ra vườn.", "eng": "The door gives directly upon the garden."}, {"viet": "Chú vịt con theo vịt mẹ đi khắp nơi.", "eng": "The duckling followed its mother everywhere."}, {"viet": "Cuộc tuyển cử đã đưa Đảng vào tình trạng còn lại một số rất nhỏ.", "eng": "The election reduced the party to a rump."}, {"viet": "Đội tuyển bóng đá của Anh đã vô địch thế giới năm 1966.", "eng": "The English football team were world champions in 1966."}, {"viet": "Nguyên nhân chính xác gây ra tai nạn vẫn còn đang được tranh cãi.", "eng": "The exact cause of the accident is still in dispute."}, {"viet": "Khoa mở cho những người không phải sinh viên của trường đại học.", "eng": "The extramural department of a university."}, {"viet": "Những người nông dân ra đồng thu hoạch ngũ cốc.", "eng": "The farmers are out harvesting the corn."}, {"viet": "Phim do Robert Redford ( và Paul Newman ) cùng đóng.", "eng": "The film co-starred Robert Redford ( and Paul Newman )."}, {"viet": "Người lính cứu hoả được ca ngợi vì lòng dũng cảm.", "eng": "The fireman was praised for his bravery."}, {"viet": "Loại đầu tiên là khách sạn thương mại, cung cấp chỗ ở cho những người chủ yếu đi công tác.", "eng": "The first is the commercial hotel, which accommodates people who mainly travel on business."}, {"viet": "Những bông hoa kèm theo những lời chúc mừng của ban giám đốc.", "eng": "The flowers are with the compliments of the management."}, {"viet": "Loại thứ tư là khách sạn cư trú, phục vụ cho những người mà bản thân họ không thuê nhà và cho thuê chỗ ở theo mùa hoặc thậm chí ở lâu dài.", "eng": "The fourth is the resident hotel, which caters to people who do not keep house themselves and rent accommodations on a seasonal basis or even permanently."}, {"viet": "Trận đấu ngang sức hơn nhiều so với tỷ số ghi được.", "eng": "The game was closer than the score suggests."}, {"viet": "Các hình thái sở hữu của các đại từ'I','we'và'she'là'my/mine','our/ours'và'her/hers'.", "eng": "The genitive forms of the pronouns'I','we'and'she'are'my/mine','our/ours'and'her/hers'."}, {"viet": "Hàng hoá được vận chuyển bằng tàu.", "eng": "The goods were transported by train."}, {"viet": "Chính phủ không chịu nhượng bộ công luận.", "eng": "The government has not yielded to public opinion."}, {"viet": "Chính phủ đảm bảo tài trợ các chi phí ban đầu của hoạt động này.", "eng": "The government underwrote the initial costs of the operation."}, {"viet": "Người Hy Lạp tính năm của họ từ khi có Đại hội Thể thao Ô-lim-pic đầu tiên.", "eng": "The Greeks counted their years from the date of the First Olympic Games."}, {"viet": "Khách khứa trở nên cởi mở hơn khi đã uống một hai cốc rượu.", "eng": "The guests expanded a little when they'd had a glass or two of wine."}, {"viet": "Sự nóng bức đã làm cho anh ấy khó chịu và phát ốm.", "eng": "The heat oppressed him and made him ill."}, {"viet": "Lá số tử vi của cung Hổ Cáp tháng này là ” Đừng quá thẳng thắn bởi vì bạn có thể làm tổn thương người khác ”.", "eng": "The horoscope for Scorpio this month is Don't be too forward because you might hurt someone's feelings."}, {"viet": "Khách sạn nằm trong khu vườn đẹp đẽ.", "eng": "The hotel was set in magnificent grounds."}, {"viet": "Những ngôi nhà vun vút lướt qua chúng tôi khi con tàu tăng tốc độ.", "eng": "The houses whirled past us as the train gathered speed."}, {"viet": "Tầm mức sâu sắc của một tiểu thuyết lịch sử.", "eng": "The impressive sweep of a historical novel."}, {"viet": "Sự điều tra đã kết luận là tai nạn là do sai lầm của con người gây ra.", "eng": "The inquiry concluded that the accident had been caused by human error."}, {"viet": "Sự cấp phát súng ống và đạn dược cho quân đội.", "eng": "The issue of rifles and ammunition to troops."}, {"viet": "Quan toà sẽ xử ( vụ án này ) vào ngày mai.", "eng": "The judge will decide ( the case ) tomorrow."}, {"viet": "Ứng cử viên Đảng Lao động vận động cử tri vào tháng tới.", "eng": "The labour candidate will canvass the constituency next month."}, {"viet": "Nơi xảy ra cuộc xung đột nội bộ mới nhất.", "eng": "The latest theatre of internal conflict."}, {"viet": "Thấu kính chiếu hình ảnh của tất cả những gì đằng trước máy lên một tấm phim hay một tấm kẽm ảnh chụp ở phía sau hộp.", "eng": "The lens throws a picture of what is in front of it on a film or plate at the back of box."}, {"viet": "Sư tử là một thú vật oai vệ.", "eng": "The lion is a superb animal."}, {"viet": "Vụ mất hợp đồng này có thể sẽ rất nghiêm trọng.", "eng": "The loss of this contract would be very serious."}, {"viet": "Sự duy trì quan hệ tốt đẹp giữa các nước.", "eng": "The maintenance of good relations between countries."}, {"viet": "Những dấu hiệu dọc theo con đường là hoàn toàn rõ ràng.", "eng": "The markings along the route are quite plain."}, {"viet": "Cuộc gặp gỡ giữa hai gia đình là một buổi họp mặt vui vẻ.", "eng": "The meeting between the two families was a joyful one."}, {"viet": "Chế độ quân sự quyết định áp đặt lệnh giới nghiêm.", "eng": "The military regime decided to impose curfew."}, {"viet": "Phần hiện đại của Istanbul nằm ở bờ biển châu âu.", "eng": "The modern part of Istanbul lies on the European shore."}, {"viet": "Các vở kịch thành công nhất ở nhà hát Luân Đôn thường là các vở ca vũ hài.", "eng": "The most successful shows in the London theatres are often musicals."}, {"viet": "Nhạc quá to, cả ngôi nhà đang rung lên.", "eng": "The music was so loud, the whole house was vibrating."}, {"viet": "Toà nhà mới hài hoà với cảnh vật xung quanh.", "eng": "The new building blends in with its Surroundings."}, {"viet": "Giống thực vật mới đã được đưa vào quá trình lai tạo tháng trước rồi.", "eng": "The new plant went on-stream last month."}, {"viet": "Tin tức về đám cưới sắp được tổ chức đã được đồn đi.", "eng": "The news of the impending marriage was bruited abroad."}, {"viet": "Sống ở miền Bắc đỡ đắt đỏ hơn ở miền Nam.", "eng": "The north is less expensive to live in than the south."}, {"viet": "Cái mái chèo gãy một cái rắc.", "eng": "The oar broke with a snap."}, {"viet": "Phong thái lịch sự của nhà quý phái cao niên.", "eng": "The old gentleman's courtly manners."}, {"viet": "Trách nhiệm hoàn thành báo cáo này là thuộc về anh.", "eng": "The onus is on you to complete this report."}, {"viet": "Lằn đường vượt trên xa lộ.", "eng": "The overtaking lane of a motorway."}, {"viet": "Đảng hy vọng sẽ trở lại cầm quyền sau cuộc bầu cử.", "eng": "The party expects to be back in power after the election."}, {"viet": "Bệnh nhân ở trong tình trạng bị đánh thuốc mê trong khi mổ.", "eng": "The patient was under an anaesthetic during the operation."}, {"viet": "Người nhận phải kí là nhận thư và biên lai được thu hồi lại cho ông.", "eng": "The person who receives it must sign for it, and the receipt is returned to you."}, {"viet": "Những chiếc cột trông chắc chắn, nhưng sự thật chúng rỗng.", "eng": "The pillars look firmly, but in fact they're hollow."}, {"viet": "Máy bay dĩ nhiên nhanh hơn.", "eng": "The plane is faster, of course."}, {"viet": "Vở kịch rất dở, may mà cũng ngắn!", "eng": "The play was very bad, but mercifully it was also short!"}, {"viet": "Cảnh sát gọi anh ta qua loa phóng thanh.", "eng": "The police called to him through a loudspeaker."}, {"viet": "Cảnh sát bắt anh ta chịu một sự kiểm soát nghiêm ngặt.", "eng": "The police put him through a severe examination."}, {"viet": "Cái ao bị băng phủ trong một đợt lạnh.", "eng": "The pond was iced over during the cold spell."}, {"viet": "Công tắc điện chưa được bật lên.", "eng": "The power switch is not turned on."}, {"viet": "Tổng thống không còn được sự ủng hộ của nhân dân nữa.", "eng": "The President no longer has the support of the people."}, {"viet": "Thủ tướng kiêm Bộ trưởng Ngoại giao.", "eng": "The Prime Minister, concurrently Minister of Foreign Affairs."}, {"viet": "Sự tư nhân hoá ngành công nghiệp thép.", "eng": "The privatization of the steel industry."}, {"viet": "Nét nổi bật trong phong cảnh.", "eng": "The prominent feature in the landscape."}, {"viet": "Hình phạt phải tương xứng với tội trạng.", "eng": "The punishment should fit the crime."}, {"viet": "Thỏ là loài được du nhập vào Úc trong thời gian tương đối gần đây.", "eng": "The rabbit is a relatively recent introduction in Australia."}, {"viet": "Nguyên nhân của sự thay đổi chỉ là không có tiền, có thế thôi.", "eng": "The reason for the change is lack of money, pure and simple."}, {"viet": "Cách điều trị đó dường như còn tệ hơn cả bệnh tật.", "eng": "The remedy seems worse than the disease."}, {"viet": "Kết quả của trận đấu đó là hòa.", "eng": "The result of the match was a draw."}, {"viet": "Con sông đó có thể cho nhiều tàu bè sử dụng vì chiều rộng của nó.", "eng": "The river can be used by many ships because of its width."}, {"viet": "Nhà thờ Thiên chúa La Mã coi hôn nhân là vĩnh viễn ràng buộc.", "eng": "The Roman Catholic Church regards marriage as indissoluble."}, {"viet": "Những quy tắc đó dường như không thể áp dụng được cho trường hợp này.", "eng": "The rules seem to be inapplicable to this situation."}, {"viet": "Nước sốt ấy cay quá, quả thực là tê.", "eng": "The sauce is bit too sharp, it really bites."}, {"viet": "Từ bao thế kỷ nay người Xcốtlen đã chưng cất rượu uýtki.", "eng": "The Scots have distilled whisky for centuries."}, {"viet": "Người lính gác hô: Ai?", "eng": "The sentry gave the challenge, Who goes there?"}, {"viet": "Con tàu đã chạm đáy-cửa sông này chắc là nông hơn chúng ta tưởng.", "eng": "The ship has touched bottom-the estuary must be shallower than we thought."}, {"viet": "Cửa hiệu chấp nhận séc, thẻ tín dụng và tất nhiên cả tiền mặt nữa.", "eng": "The shop will accept cheques and credit cards, not forgetting cash, of course."}, {"viet": "Chậu rửa bát tràn nước và sàn nhà bếp bị ngập.", "eng": "The sink had overflowed and the kitchen floor was awash."}, {"viet": "Xe cháy âm ỉ bốc khói nhiều ngày.", "eng": "The smouldering wreck fumed for days."}, {"viet": "Bài hát có một nhịp biến tấu theo nhạc jazz.", "eng": "The song has syncopated rhythm in the jazz version."}, {"viet": "Tốc độ và sự chính xác cô ấy đánh máy.", "eng": "The speed and accuracy with which she typed."}, {"viet": "Bức tượng đứng một mình trên quảng trường.", "eng": "The statue stands by itself in the square."}, {"viet": "Đèn đường phố được bật lên lúc chạng vạng và tắt đi lúc rạng đông.", "eng": "The street lights come on at dusk and go off at dawn."}, {"viet": "Tiếng động bất thần trong bụi làm mấy chú cừu non nhảy dựng.", "eng": "The sudden noise in the bushes startled the lambs."}, {"viet": "Âm t trong từ postman có thể được bỏ đi.", "eng": "The t in postman may be elided."}, {"viet": "Thầy giáo tranh thủ lấy lòng học sinh bằng cách giao cho họ rất ít bài tập.", "eng": "The teacher tried to court popularity by giving his students very little work."}, {"viet": "Các điều khoản của hợp đồng đã cố ý không rành mạch.", "eng": "The terms of the agreement were deliberately vague."}, {"viet": "Sự đe doạ của chiến tranh hiện ra lờ mờ trên đất nước.", "eng": "The threat of war loomed over the country."}, {"viet": "Trung tâm thành phố chắc chắn cần phải đổi mới.", "eng": "The town centre certainly needs a face-lift."}, {"viet": "Người bán hàng rong bán nhiều loại hàng cho dân làng.", "eng": "The travelling salesman sells a variety of merchandise to the villagers."}, {"viet": "Hai công ti liên doanh với nhau để sản xuất ô tô ở Mĩ.", "eng": "The two companies have embarked on a joint venture to produce cars in America."}, {"viet": "Người được nêu tên dưới đây là nhân chứng cho bản hợp đồng này.", "eng": "The undermentioned is witness to this contract."}, {"viet": "Giá trị đồ nữ trang bị đánh cắp ước tính là 20.000 đôla.", "eng": "The value of the stolen jewellery was assessed at $ 20, 000."}, {"viet": "Danh sách cử'tri có cho mọi người tại thư viện địa phương.", "eng": "The voters'lists are accessible to everyone at the local library."}, {"viet": "Những cách vi tính có thể ảnh hưởng đến cuộc sống của chúng ta.", "eng": "The ways in which computers can affect our lives."}, {"viet": "Cả làng đã biết về vụ bê bối.", "eng": "The whole village knew about the scandal."}, {"viet": "Các bà rất hung hăng về tự do không sinh con của họ.", "eng": "The women were belligerent about their freedom not to have babies."}, {"viet": "Những người sống sót bất hạnh sau trận động đất.", "eng": "The wretched survivors of the earthquake."}, {"viet": "Sự ra đi của họ ngay trước nạn lụt quả là may mắn.", "eng": "Their departure just before the floods was providential."}, {"viet": "Cả giá lẫn chất lượng của chúng đều rất thuyết phục.", "eng": "Their price and quality are both competitive."}, {"viet": "Vậy thì tốc độ đó làm cho nó trở thành phương tiện đi lại nhanh nhất ngày nay rồi.", "eng": "Then that makes it the fastest means of travel today."}, {"viet": "Có một mẩu tin trên báo địa phương về vụ tai nạn.", "eng": "There's a paragraph on the accident in the local paper."}, {"viet": "Không hề có cái gì gợi ý là bà ta sẽ từ chức.", "eng": "There's no suggestion that she should resign."}, {"viet": "Có nhiều cây cối trong vườn ông ta.", "eng": "There are a lot of trees in his garden."}, {"viet": "Có những dự kiến thay đổi cơ cấu của uỷ ban.", "eng": "There are plans to change the make-up of the committee."}, {"viet": "Hình như không có lối thoát khỏi tình cảnh bế tắc này.", "eng": "There doesn't seem to be a way out of this impasse."}, {"viet": "Còn nhiều vụ việc phải nghe.", "eng": "There is a lager backlog of cases to hear."}, {"viet": "Không thể có sự riêng tư gì khi các ngôi nhà được xây dựng san sát nhau thế này.", "eng": "There is no privacy when houses are built on top of each other like that."}, {"viet": "Không còn nhiều xe lửa hoạt động nữa.", "eng": "There's not much train travel anymore."}, {"viet": "Có sự trao đổi tù chính trị giữa hai nước.", "eng": "There was an exchange of political prisoners between the two countries."}, {"viet": "Có những đám mây đen trên bầu trời.", "eng": "There were masses of dark clouds in the sky."}, {"viet": "Những sách này không được đem ra khỏi thư viện.", "eng": "These books must not be taken away from the library."}, {"viet": "Cái quần mới này có phần hơi rộng.", "eng": "These new trousers are a bit on the large side."}, {"viet": "Chúng cứ gạch bỏ lịch từng ngày.", "eng": "They're already crossing out the days on the calendar."}, {"viet": "Anh biết đấy, họ đã chia tay''Tôi hoàn toàn có thể tin điều đó'.", "eng": "They've split up, you know''I can well believe it'."}, {"viet": "Nếu bạn mua dâu tây không vào đúng vụ thì chúng rất đắt đấy.", "eng": "They are so expensive if you don't buy strawberries in season."}, {"viet": "Chúng có thể thở cả trong nước lẫn trên cạn.", "eng": "They can breathe either in or out of water."}, {"viet": "Họ đã khám phá ra rằng hắn là một cảnh sát do thám.", "eng": "They discovered that he was a police plant."}, {"viet": "Họ tổ chức một cuộc hoà nhạc và tặng tiền thu được cho hội từ thiện.", "eng": "They gave a concert and donated the proceeds to charity."}, {"viet": "Họ không có mối quan tâm nào ngoài nhu cầu của cơ thể họ.", "eng": "They have no interests beyond their bodily needs."}, {"viet": "Họ nhìn từ trên xuống làn nước.", "eng": "They looked down from the bridge at the water underneath."}, {"viet": "Họ đã đi qua Paris trên đường đến Rome.", "eng": "They passed through Paris en route for Rome."}, {"viet": "Họ nói cuộc phỏng vấn chỉ là hình thức, bởi họ đã quyết định tuyển tôi vào việc đó.", "eng": "They said the interview was just a formality, as they've already given me the job."}, {"viet": "Chúng chỉ đánh cắp chiếc xe để đùa nghịch thôi, nhưng bây giờ lại gặp rắc rối thật.", "eng": "They stole the car for the lark but now they're in trouble."}, {"viet": "Chúng vẩy thức ăn vào trong miệng chúng bằng một vành cấu tạo bởi nhiều vòi li ti.", "eng": "They wave food into their mouths with a circle of tiny feelers."}, {"viet": "Thậm chí chúng cũng không phải là họ hàng gần gũi của thằn lằn.", "eng": "They were not even very close relatives of the lizards."}, {"viet": "Công việc ở đây tiến hành chậm như sên, nhưng chúng tôi sẽ hoàn thành kịp thời-đừng sợ.", "eng": "Things are moving along at a snail's pace here, but we'll finish on time-have no fear."}, {"viet": "Việc đi lên xuống cầu thang hoàn toàn là phí thì giờ.", "eng": "This business of going up and down the stairs is a complete waste of time."}, {"viet": "Cuốn từ điển này dùng phiên âm để chỉ cho ta cách phát âm các từ.", "eng": "This dictionary uses a phonetic alphabet to show you how to pronounce words."}, {"viet": "Ngôi nhà này hoàn toàn thiếu đồ đạc.", "eng": "This house is totally devoid of furniture."}, {"viet": "Đây là điều ngược lại với đề nghị của anh ta trước đó.", "eng": "This is the inverse of his earlier proposition."}, {"viet": "Bản viết tay này có từ thế kỉ X.", "eng": "This manuscript dates from the X century."}, {"viet": "Mặt tượng song hỷ này là món hàng bán chạy nhất của chúng tôi.", "eng": "This pendant with a double happiness is our best-seller."}, {"viet": "Loại ghế này có ưu điểm là điều chỉnh được.", "eng": "This seat has the virtue of being adjustable."}, {"viet": "Chỗ này vốn là quán rượu nhưng người chủ quán đã mất giấy phép.", "eng": "This used to be a pub but the landlord has lost his licence."}, {"viet": "Mặc dù không phải lỗi của cô ấy, cô ấy đã mất việc.", "eng": "Though no fault of her own, she lost her job."}, {"viet": "Tom đã cao, nhưng Mary còn cao hơn nữa.", "eng": "Tom is tall, but Mary is taller still."}, {"viet": "Đang xây dựng, đang làm.", "eng": "Under construction in course of construction."}, {"viet": "Bà ta bị trục xuất ra khỏi đất nước vì có tham gia trong âm mưu chống chính phủ.", "eng": "Was exiled from her country because of her part in the plot against the government."}, {"viet": "Chúng tôi sẽ gửi cho ông thông báo gửi hàng một khi chúng tôi hoàn tất việc gửi hàng theo qui định được nêu rõ trong thư tín dụng.", "eng": "We'll give you shipping advice once we have completed the shipment in accordance with the stipulations set forth in the Letter of Credit."}, {"viet": "Chúng tôi sẽ đi Pháp trong một chuyến đi thực địa chất sang năm.", "eng": "We're going to France on a geology field trip next year."}, {"viet": "Chúng tôi đã thảo luận rất lâu về chủ đề này trong buổi họp trước.", "eng": "We've already discussed the subject at great length in previous meetings."}, {"viet": "Chúng tôi đã cố tìm cách tạo ra không khí của một quán rượu Pháp.", "eng": "We've tried to create the ambience of a French bistro."}, {"viet": "Chúng tôi đang chiến đấu để bảo vệ khu rừng này.", "eng": "We are fighting for the preservation of this forest."}, {"viet": "Chúng tôi thức dậy thì thấy bọn họ đã đi rồi.", "eng": "We awakened to find the others had gone."}, {"viet": "Chúng ta có thể tiếp tục ở đó.", "eng": "We can go on from there."}, {"viet": "Chúng tôi không có cách nào tìm được một phòng ở khách sạn.", "eng": "We couldn't find a hotel room for love or money."}, {"viet": "Mỗi người chúng tôi đều trả một tuần rượu sau đó ông chủ quán cho biết tuần rượu tới sẽ do nhà hàng thết.", "eng": "We each bought a round of drinks, and then the bartender announced that the next drink was on the house."}, {"viet": "Chúng tôi có một cuộc họp bàn bạc vấn đề đó một cách thoải mái.", "eng": "We had a meeting and gave the subject a good airing."}, {"viet": "Chúng tôi có thặng dư mậu dịch là 400 triệu đô la.", "eng": "We have a trade surplus of 400 million dollars."}, {"viet": "Chúng ta cần phải thu hút các khách hàng trẻ'.'Đúng, anh phải giải quyết ngay vấn đề đó!'.", "eng": "We have to attract younger customers.''Exactly, you've got it in one!'."}, {"viet": "Chúng tôi rời Dover lúc mười giờ và sẽ sang đến đất Pháp vào nửa đêm.", "eng": "We leave Dover at ten and we should be across in France by midnight."}, {"viet": "Chúng tôi lái xe đi Cambridge để thăm vài người bạn.", "eng": "We motored over to Cambridge to see some friends."}, {"viet": "Chúng ta phải thử đoán trước xem hắn ta sẽ làm gì kế tiếp.", "eng": "We must try to second-guess what he'll do next."}, {"viet": "Chúng tôi hoãn trận đấu từ 5 tháng 3 đến 19 tháng ba.", "eng": "We postponed the match from March 5th to March 19th."}, {"viet": "Khi chúng tôi chuyển về Luân Đôn, chúng tôi đã thu xếp cho bọn trẻ ổn định vào trường mới.", "eng": "We settled the children into new schools when we moved to London."}, {"viet": "Chúng tôi ủng hộ các hoạt động nghệ thuật địa phương, điều đó có lợi cho mối liên hệ với quần chúng.", "eng": "We support local artistic events, it's good for public relations."}, {"viet": "Chúng tôi xem phim và sau đó đi ăn.", "eng": "We watched a film and then went for a meal."}, {"viet": "Chúng tôi bị lôi dậy vào lúc 4 giờ sáng.", "eng": "We were routed out of our beds at 4 a. m."}, {"viet": "Chúng tôi muốn biết là liệu các ông có thể cho chúng tôi hưởng mức chiết khấu 5% trên bảng giá không.", "eng": "We would like to know if you could offer us a 5% discount on the list price."}, {"viet": "À, bây giờ tôi phải đi.", "eng": "Well, I should be going now."}, {"viet": "Dạ của cháu làm tại Nhật.", "eng": "Well mine was made in Japan."}, {"viet": "Thật đáng tiếc khi nhìn thấy tất cả chỗ thực phẩm đó bị uổng phí.", "eng": "What a pity to see all that food go to waste."}, {"viet": "Tôi có thể lấy món gì cho quý vị tối nay ạ?", "eng": "What can I get for you this evening?"}, {"viet": "Vào lễ Halloween khi bọn trẻ nói “ trick or treat ” thì nó có nghĩa gì vậy?", "eng": "What does it mean on Halloween when the kids say trick or treat?"}, {"viet": "Một kilômét phải trả bao nhiêu?", "eng": "What is the charge by the kilometer?"}, {"viet": "Các món ăn Nhật nào bạn không thích?", "eng": "What Japanese dishes do you dislike?"}, {"viet": "Bây giờ mấy giờ rồi, thưa ông Blake?", "eng": "What's the time now Mr Blake?"}, {"viet": "Công ty sẽ ra sao nếu không có con?", "eng": "What would the company do without you?"}, {"viet": "Khi anh ta hỏi lấy cô ấy, cô ấy từ chối thẳng thừng.", "eng": "When he asked her to marry him she turned him down cold."}, {"viet": "Khi nào máy bay của bạn khởi hành đi San Francisco?", "eng": "When is your plane departing for San Francisco?"}, {"viet": "Khi tuyết tan thì con suối trên núi sẽ trở thành một dòng lũ lớn.", "eng": "When the snow melts, the mountain stream becomes a deluge."}, {"viet": "Cứ khi nào anh ấy về muộn, vợ anh ấy lại lục vấn xem anh ấy buổi tối ở đâu.", "eng": "Whenever he comes in late his wife cross-examines him about where he's spent the evening."}, {"viet": "Tôi sẽ để chiếc va li vào đâu đây?''Quẳng nó lên nóc xe ô tô ấy.'.", "eng": "Where shall I put the case?''Shove it on top of the car.'."}, {"viet": "Anh thích gói nào?''Tôi lấy gói bé'.", "eng": "Which packet would you prefer?''I'll take the little one'."}, {"viet": "Các ngân hàng lớn ở nước bạn là những ngân hàng nào?", "eng": "Who are the big banks in your country?"}, {"viet": "Tại sao tôi phải luôn luôn dính tới chuyện rửa bát?", "eng": "Why am I always stuck with the washing-up?"}, {"viet": "Tại sao bỗng dưng anh lại ghét cô ta?", "eng": "Why have you suddenly taken against her?"}, {"viet": "Anh vui lòng tìm xem rạp xine nào đang chiếu bộ phim đó?", "eng": "Will you find out what theater is showing that movie?"}, {"viet": "Chỉ cần tâng bốc vài lời, mình có thể thuyết phục nó làm việc đó ngay.", "eng": "With a little flattery I might persuade him to do the job."}, {"viet": "Sẽ không có hại gì cho cuộn phim của tôi chứ?", "eng": "Won't it hurt my film?"}, {"viet": "Bà có muốn lấy thêm một cái chăn nữa không?", "eng": "Would you like an extra blanket?"}, {"viet": "Cảm phiền ông nói chậm lại một chút?", "eng": "Would you mind speaking a little slower?"}, {"viet": "Xeros là tên độc quyền và những hãng sản xuất máy photocopy khác không được phép sử dụng.", "eng": "Xeros is a proprietary name and may not be used by other makers of photocopies."}, {"viet": "Vâng, hầu hết khách hàng của chúng tôi sử dụng kế hoạch sáu hoặc mười hai tháng.", "eng": "Yes, most of our customers use six-or twelve-month plans."}, {"viet": "Anh sẽ làm như đã được dặn, rõ chưa?", "eng": "You'll do as you're told, is that clear?"}, {"viet": "Dứt khoát là mày phải đến dù mày muốn hay không.", "eng": "You're fucking well coming whether you want to or not."}, {"viet": "Lần này quả là anh đã chọn đúng.", "eng": "You've really picked a winner this time."}, {"viet": "Anh không thể thưởng thức đầy đủ văn học nước ngoài qua bản dịch.", "eng": "You can't fully appreciate foreign literature in translation."}, {"viet": "Con có thể đi chơi với điều kiện là trở về trước 9 giờ.", "eng": "You can go out as long as you promise to be back before 9."}, {"viet": "Vậy bạn có thể mất hai ngày đi đến đó, hai ngày tham quan và một ngày trở về.", "eng": "You could spent three days getting three, two days sightseeing, and one day getting back."}, {"viet": "Ông đã lăng nhục vợ tôi, tôi yêu cầu ông đấu rửa hận!", "eng": "You have insulted my wife, I demand satisfaction!"}, {"viet": "Mày là đồ nói dối! anh ta nói giọng căm ghét.", "eng": "You liar! he said, with venom in his voice."}, {"viet": "Anh phải ký quỹ 500 pao và khoản tiền thuê tháng đầu.", "eng": "You must deposit 500 pounds as well as the first month's rent."}, {"viet": "Anh cần phải cứng cỏi để có thể tồn tại trong rừng.", "eng": "You need to be tough to survive in the jungle."}, {"viet": "Anh nên đi xem phim này nếu anh có điều kiện.", "eng": "You should go and see this film if you get the opportunity."}, {"viet": "Anh đã lấy chăn của em, phải không?", "eng": "You took my blanket, didn't you?"}, {"viet": "Chừng nào tôi còn sống, anh sẽ không cần một người bạn.", "eng": "You won't want for a friend as long as I draw breath."}, {"viet": "Chồng chị chưa tỉnh sau khi gây mê.", "eng": "Your husband hasn't yet come round after the anaesthetic."}]