[{"viet": "Một quyển sách được đề cập tới qua những phương tiện thông tin đại chúng.", "eng": "A book that is often mentioned in the media."}, {"viet": "Một đứa bé mút ngón cái của nó.", "eng": "A child that sucks its thumb."}, {"viet": "Bản chất không thể nói sự thật.", "eng": "A constitutional inability to tell the truth."}, {"viet": "Sắp có một quyết định về vấn đề này.", "eng": "A decision on this matter is pending."}, {"viet": "Một bãi biển hoang vắng, đìu hiu vào mùa đông.", "eng": "A dreary forsaken beach in winter."}, {"viet": "Một phim do một tiểu thuyết gia nổi tiếng viết kịch bản.", "eng": "A film scripted by a famous novelist."}, {"viet": "Một tên găngx-tơ được những tay vệ sĩ to lớn của hắn bảo vệ.", "eng": "A gangster protected by his heavies."}, {"viet": "Một bản tường thuật hấp dẫn về chiến tranh.", "eng": "A gripping narrative about the war."}, {"viet": "Một câu chuyện kể cực kỳ lý thú về kỳ nghỉ đi cắm trại của họ.", "eng": "A hilarious account of their camping holiday."}, {"viet": "Bếp và phòng ăn kết hợp.", "eng": "A kitchen and dining-room combined."}, {"viet": "Một cuộc sống phóng túng trụy lạc.", "eng": "A life of gross self-indulgence."}, {"viet": "Một cuộc trình diễn vũ ba lê hấp dẫn.", "eng": "A magical performance of the ballet."}, {"viet": "Một đầu óc nhiễm thành kiến chủng tộc.", "eng": "A mind infected with racial prejudice."}, {"viet": "Một cái áo đầm mới là một tặng phẩm thích hợp dành cho sinh nhật Mary.", "eng": "A new dress would be a possible gift for Mary's birthday."}, {"viet": "Bức tranh trước đây bị coi là vô giá trị, nhưng bây giờ nó lại hóa ra rất quí giá.", "eng": "A painting previously considered as worthless, but which now turns out to be very valuable."}, {"viet": "Một tấm hình chụp một thiếu nữ khiêu gợi.", "eng": "A photograph of a nubile young woman."}, {"viet": "Một bức chân dung thể hiện mọi chi tiết của gương mặt người mẫu.", "eng": "A portrait that reproduces every detail of the sitter's face."}, {"viet": "Một chồng hộp xếp theo hình chóp trong tủ kính.", "eng": "A pyramid of tins in the shop-window."}, {"viet": "Một sự sửa đổi kịch Hamlet của Xếchxpia cho phù hợp hơn.", "eng": "A reworking of Shakespeare's Hamlet."}, {"viet": "Một cuộc kiểm tra tỉ mỉ sổ sách kế toán của hãng đó.", "eng": "A scrupulous inspection of the firm's accounts."}, {"viet": "Sự im lặng ập xuống căn phòng.", "eng": "A silence fell on the room."}, {"viet": "Một loại màu khó xác định, nửa chừng giữa xám và nâu.", "eng": "A sort of indeterminate colour, half-way between grey and brown."}, {"viet": "Một nét ghen tị, kiêu ngạo, độc ác.", "eng": "A streak of jealously, vanity, cruelty."}, {"viet": "Điện thoại thuận tiện cho mọi nhà.", "eng": "A telephone belongs in every home."}, {"viet": "Một nhân viên đáng tin cậy của công ty.", "eng": "A trusted servant of the company."}, {"viet": "Một nỗ lực muốn phá kỷ lục thế giới về tốc độ được phổ biến cho nhiều người biết.", "eng": "A well-publicized attempt to break the world speed record."}, {"viet": "Vải thấm nước hút hơi ẩm ra khỏi da.", "eng": "Absorbent cloth that wicks moisture away from the skin."}, {"viet": "Cho thêm xì dầu vào rau xào.", "eng": "Adding soy sauce to the stir-fried vegetables."}, {"viet": "Sau kỳ vắng mặt 3 tháng.", "eng": "After an absence of three months."}, {"viet": "Sau vài năm ở Luân Đôn, ông ta được bổ nhiệm làm đại sứ ở Mátxcơva.", "eng": "After several years in London, he was posted to the embassy in Moscow."}, {"viet": "Tuổi đời đã tôi luyện cho anh ta có thái độ chín chắn đối với một số việc.", "eng": "Age has mellowed his attitude to some things."}, {"viet": "Tất cả áo đầm của tôi đều để mặc vào mùa hè.", "eng": "All my frocks are for the summer."}, {"viet": "Tất cả những người anh mời sẽ tới.", "eng": "All the people you invited are coming."}, {"viet": "Mặt dù chúng tôi hết sức cố gắng làm vui lòng vị giám đốc mới, bà ta vẫn còn hay chê bai công việc của chúng tôi.", "eng": "Although we bent over backwards to please her, our new manager was still very critical of our work."}, {"viet": "Một sự gia tăng đáng báo động về các vụ hiếp dâm.", "eng": "An alarming increase in cases of indecent assault."}, {"viet": "Một sự chọn lựa vô số việc để mà làm.", "eng": "An endless choice of things to do."}, {"viet": "Một bữa ăn thân mật được dùng làm phần mở đầu cho cuộc hội nghị ba ngày đó.", "eng": "An informal brunch served as a preface to the three-day conference."}, {"viet": "Một lệnh phóng thích ai khỏi nhà tù.", "eng": "An order for somebody's release from prison."}, {"viet": "Và mặc dầu Grainger là một người già, tháo vát, nhưng các biện pháp như thế không thể nào là của ông ta.", "eng": "And though Grainger was a spry old party, such steps couldn't be his."}, {"viet": "Bất kỳ quyển sách nào cũng có thể có bản quyền.", "eng": "Any book can be copyrighted."}, {"viet": "Các linh mục có quỵ lụy các giám mục của họ không?", "eng": "Are priests too subservient to their bishops?"}, {"viet": "Tối thứ sáu bạn có rảnh không?", "eng": "Are you free next Friday night?"}, {"viet": "Những vết muỗi đốt anh còn ngứa không?", "eng": "Are your mosquito bites still itching?"}, {"viet": "Đối với tôi anh muốn làm gì tuỳ ý.", "eng": "As far as I'm concerned you can do what you like."}, {"viet": "Khi chúng tôi đến gần ngôi nhà đó, tôi có linh cảm là có điều gì khủng khiếp đã xảy ra.", "eng": "As we approached the house, I had a premonition that something terrible had happened."}, {"viet": "Ít nhất chúng ta cũng có thể dùng đỡ nến nếu mất điện.", "eng": "At least we can fall back on candles if the electricity fails."}, {"viet": "Bà Mary là chị của má tôi.", "eng": "Aunt Mary is my mother's sister."}, {"viet": "Hãy cẩn thận đừng làm phiền hắn-hắn dễ nổi nóng lắm.", "eng": "Be careful not to annoy him-he's got a quick temper."}, {"viet": "Hối tiếc về các hành vi sai trái của ai.", "eng": "Be sorry for one's wrongdoings."}, {"viet": "Là một ngôi sao ôpêra không phải là hoàn toàn màu hồng.", "eng": "Being an opera star is not all roses by any means."}, {"viet": "Tiên phong trong lãnh vực giải phẫu bằng tia laze.", "eng": "Blazing a trail in the field of laser surgery."}, {"viet": "Kiện ai về tội vu khống.", "eng": "Bring an action against somebody for slander."}, {"viet": "Nhưng trước đó rất nhiều việc đã được làm theo hướng phát triển sản phẩm, nghiên cứu thị trường, tiếp thị thể nghiệm, v..v.", "eng": "But a great deal of work has been done beforehand in the way of product development, market research, test marketing and so on."}, {"viet": "Nhưng một vấn đề nghiêm trọng đối với tất cả những phương tiện vận chuyển siêu thanh mà chúng ta gọi là SST, là tiếng ồn.", "eng": "But one serious problem with all the supersonic transport, we call SST, is the noise."}, {"viet": "Nói chung công ty khá tốt đối với tôi.", "eng": "By and large, the company's been pretty good to me."}, {"viet": "Anh muốn gọi nó là gì thì gọi, nó vẫn cứ là một vấn đề.", "eng": "Call it what you will, it's still a problem."}, {"viet": "Tôi có thể chọn bàn bên phải được không?", "eng": "Can I take the table on the right?"}, {"viet": "Vui lòng giúp tôi một tay chỉ một lát thôi?", "eng": "Can you give me a hand for just a second?"}, {"viet": "Anh có nghe mùi vị tỏi trong món thịt hầm này không?", "eng": "Can you taste the garlic in this stew?"}, {"viet": "Carson cất đi các giấy tờ mà anh dùng làm cơ sở lập một biểu đồ phát triển cho một hệ thống của một hãng chế tạo nhỏ đang làm ăn thịnh vượng.", "eng": "Carson put away the papers on which he had been flow charting a system for a prospering little manufacturer."}, {"viet": "Bọn trẻ thích chí vọc nước cho tung tóe trong bồn tắm.", "eng": "Children happily splashing about in the bath."}, {"viet": "Sự diễn đạt trong sáng thì quan trọng hơn sự hoa mỹ của ngôn từ.", "eng": "Clearness of statement is more important than beauty of language."}, {"viet": "Ngồi gọn lỏn thoải mái trong một chiếc ghế bành to.", "eng": "Comfortably ensconced in a big armchair."}, {"viet": "Chúc mừng sinh nhật ông, thưa ông Hà!", "eng": "Congratulations on your birthday, Mr. Ho!"}, {"viet": "Chúng tôi có thể vặn lại đoạn đó được không?", "eng": "Could we run that sequence through again?"}, {"viet": "Cô có thể cho tôi biết tôi nên đi đâu không?", "eng": "Could you tell me where I should go?"}, {"viet": "Hãy bỏ lớp vỏ bánh mì cứng khi bạn làm bánh xăng uýt.", "eng": "Cut the crusts off when you make sandwiches."}, {"viet": "Cử ai làm đại biểu tham dự một hội nghị.", "eng": "Delegate somebody to attend a conference."}, {"viet": "Quyết định chứng minh sự vô tội của ai.", "eng": "Determine on proving somebody's innocence."}, {"viet": "Anh có thấy sự khác biệt nơi cô ấy không?", "eng": "Did you notice a difference in her?"}, {"viet": "Những khoảng cách trong vũ trụ thật đáng kinh ngạc.", "eng": "Distances in space are quite mind-boggling."}, {"viet": "Làm công việc đó để thỏa mãn khách hàng.", "eng": "Do the work to the satisfaction of the client."}, {"viet": "Bạn thấy có dễ dàng bày tỏ ý kiến của mình không?", "eng": "Do you find it easy to express your opinion?"}, {"viet": "Cô có vé cho buổi diễn hôm nay không?", "eng": "Do you have tickets available for today's performance?"}, {"viet": "Phiền bạn khoảng 30 phút sau gọi điện lại cho tôi nhé?", "eng": "Do you mind calling back in about 30 minutes?"}, {"viet": "Anh có nghĩ là cô ta có khả năng thành một diễn viên múa hay không?", "eng": "Do you think she's got it in her to be a dancer?"}, {"viet": "Bác sĩ nên cố gắng thuyết phục dân hút bỏ thói nghiện.", "eng": "Doctors should try do persuade smokers to kick the habit."}, {"viet": "Đừng để sự vui chơi cản trở nhiệm vụ.", "eng": "Don't allow pleasure to interfere with duty."}, {"viet": "Đừng có trễ tiền nhà nếu không anh sẽ bị trục xuất ra khỏi nhà.", "eng": "Don't fall behind with the rent or you'll be evicted."}, {"viet": "Đừng làm ồn ào nhiều thế.", "eng": "Don't make so much noises."}, {"viet": "Những bông hồng này mà không thơm sao!", "eng": "Don't the roses smell sweet!"}, {"viet": "Bác sĩ Smith săn sóc cô ấy ở bệnh viện.", "eng": "Dr Smith attended her in hospital."}, {"viet": "Each, every, either, neither là các đại từ phân biệt.", "eng": "Each, every either and neither are distributive pronouns."}, {"viet": "Những kẻ thù mà bề trong lại thực sự là anh em.", "eng": "Enemies who are really brothers under the skin."}, {"viet": "Thậm chí người Mỹ cũng thích sự khéo léo tuyệt vời của nó.", "eng": "Even the Americans like its exquisite dexterity."}, {"viet": "Quan sát mặt cắt ngang của quả thận bằng kính hiển vi.", "eng": "Examining a cross-section of the kidney under the microscope."}, {"viet": "Các vụ nổ, dù không thường xuyên, là một tai nạn nghề nghiệp của thợ mỏ.", "eng": "Explosions, though infrequent, are an occupational hazard for coal-miners."}, {"viet": "Cha tôi đã viết chúc thư để lại cho tôi căn nhà và cho chị tôi phần thu nhập từ các khoản đầu tư.", "eng": "Father willed me the house and my sister the income from the investments."}, {"viet": "Tìm được một chỗ khuất để cắm trại.", "eng": "Find a sheltered spot for a picnic."}, {"viet": "Chớp đèn pha xe ô tô của mình báo hiệu cho ai.", "eng": "Flash a signal to somebody with one's car headlights."}, {"viet": "Đối với những sản phẩm chủ lực mà chi phí cho việc phát triển có thể là cao thì chúng ta thuê chuyên gia.", "eng": "For major products where development costs are likely to be high, we employ specialists."}, {"viet": "Fred này, tôi thấy bạn lạ lùng quá rồi đấy.", "eng": "Fred, I'm surprised at you."}, {"viet": "Đã giúp cô ta mang những gói hàng nặng của cô ta.", "eng": "Gave her a lift with her heavy packages."}, {"viet": "Làm nhạc công dương cầm tại các tụ điểm ski vào các kỳ nghỉ cuối tuần.", "eng": "Gigging weekends as a piano layer in the ski joints."}, {"viet": "Vui mừng được trở về trên đất liền.", "eng": "Glad to be on terra firma again."}, {"viet": "Bị một con bò đực giận dữ húc chết.", "eng": "Gored to death by an angry bull."}, {"viet": "Chạy được nửa cuộc đua thì con ngựa bị khập khiễng.", "eng": "Halfway through the race, the horse went lame."}, {"viet": "Hai đội trưởng đã gieo đồng tiền chưa?", "eng": "Have the two captains tossed yet?"}, {"viet": "Bạn có bao giờ nghĩ đến nghề dạy học không?", "eng": "Have you ever thought of going for teaching?"}, {"viet": "Anh đã thăm dò anh ta về việc nhận công việc này chưa?", "eng": "Have you sounded him out yet about taking the job?"}, {"viet": "Ông ta là một nhà cầm quyền địa phương, tức là một viên chức Nhà nước.", "eng": "He's a local government administrator, that is to say a Civil Servant."}, {"viet": "Anh ta quanh quẩn thẫn thờ suốt ngày ( ở nhà ).", "eng": "He's been moping around ( the house ) all day."}, {"viet": "Ông ta có sức khoẻ tuyệt vời ở vào tuổi ấy.", "eng": "He's in excellent condition for a man of his age."}, {"viet": "Anh ấy tự cao tự đại đến nỗi khi cô ta từ chối lời mời thì điều đó thực sự làm anh ta bực bội.", "eng": "He's so conceited that when she refused his invitation, it really put his nose out of joint."}, {"viet": "Ông ta hoạt động với tư cách một người trung gian trong các cuộc thảo luận giữa hai công ty.", "eng": "He acted as a middleman in discussions between the two companies."}, {"viet": "Anh ta nhận lãnh trách nhiệm mới vào tháng tới.", "eng": "He assumes his new responsibilities next month."}, {"viet": "Ông ta đã không quan tâm tới những lời phản đối của tôi về kế hoạch của ông ấy.", "eng": "He brushed aside my objections to his plan."}, {"viet": "Hắn ngộp thở vì một mẩu thức ăn.", "eng": "He choked on the particle of food."}, {"viet": "Anh ta làm dấu thánh giá khi đi qua nhà thờ.", "eng": "He crossed himself as he passed the church."}, {"viet": "Ông ấy mất vào năm sáu mươi tuổi.", "eng": "He died in his sixtieth year."}, {"viet": "Nó rốt cuộc về sống ở khu của bọn lưu manh.", "eng": "He ended up on skid row."}, {"viet": "Nó cảm thấy Thiên Chúa đang che chở nó.", "eng": "He felt that God was watching over him."}, {"viet": "Anh ta nhìn tôi một cách bí hiểm rồi đi qua luôn.", "eng": "He gave me a searchless look and then passed by."}, {"viet": "Anh ta sinh trưởng ở miền quê nhưng sau đó thấy thích cuộc sống thành thị hơn.", "eng": "He grew up in the country, but then found he preferred the bright lights."}, {"viet": "Ông ta đã phải vận dụng hết khả năng thuyết phục.", "eng": "He had to use all his powers of persuasion."}, {"viet": "Ông ta đã được hối lộ để không nói điều gì.", "eng": "He has been squared to say nothing."}, {"viet": "Theo truyền thống ông ta đã là người đứng mũi chịu sào của chính quyền về những vấn đề áp dụng các biện pháp nâng đỡ những người bị thiệt thòi, đồng thời thường xuyên ra mắt công chúng để trình bày và làm sáng tỏ các quan điểm của chính quyền.", "eng": "He has traditionally been the administration's point man on affirmative action issues, making frequent public appearances to present and clarify the administration's views."}, {"viet": "Anh ta là một đứa cháu cưng của ông bác.", "eng": "He is a favourite with his uncle."}, {"viet": "Anh ta là một trong nhiều bồ cũ của cô ta.", "eng": "He is one of her many exes."}, {"viet": "Anh ấy đứng phắt dậy khi ông chủ bước vào.", "eng": "He jumped up as the boss came in."}, {"viet": "Anh ta cũng thích rượu vang ngon-rõ ràng anh ta là người tâm đầu ý hợp với tôi.", "eng": "He likes good wine too-he's obviously a man after my own heart."}, {"viet": "Anh ta ưa khoe tài về nhiều mặt.", "eng": "He loved to show off his protean talent."}, {"viet": "Nó bồn chồn nhấp nhổm trên ghế.", "eng": "He moved uneasily in his chair."}, {"viet": "Anh ấy đánh giá quá cao khả năng của mình làm một người bán hàng.", "eng": "He overrated his abilities as a salesman."}, {"viet": "Anh ta đại diện những người phản đối chiến tranh... những người ngu ngốc thậm chí không biết Đông Nam Á ở đâu.", "eng": "He presents antiwar protesters … as bubbleheads who didn't even know where Southeast Asia was."}, {"viet": "Đang làm anh ấy ngước mắt nhìn lên.", "eng": "He raised his eyes from his work."}, {"viet": "Nó cứ một mực từ chối thay đổi quyết định của mình.", "eng": "He remained obdurate, refusing to alter his decision."}, {"viet": "Anh ấy là người khéo giải quyết khó khăn.", "eng": "He's a good problem-solver."}, {"viet": "Anh ta nấu bữa ăn đó thường đến độ là có nhắm mắt lại anh ta cũng làm được.", "eng": "He's cooked that meat so often that he can do it with his eyes closed."}, {"viet": "Anh ta không bao giờ bước xuống giường trước 10 giờ.", "eng": "He's never astir before 10 o'clock."}, {"viet": "Hắn ta đang tính chuyện làm bậy.", "eng": "He's up to no good."}, {"viet": "Anh ta nói đời anh ta đã mất tầm quan trọng của nó từ khi vợ anh ta chết.", "eng": "He says his life has lost its meaning since his wife died."}, {"viet": "Anh ấy phải tự bảo vệ mình chống những lời buộc tội dối trá.", "eng": "He should defend himself against false accusations."}, {"viet": "Chẳng mấy chốc anh ta lắng dịu và trở thành một bệnh nhân ngoan ngoãn.", "eng": "He soon settled down and became a compliant patient."}, {"viet": "Anh ta lái con tàu rất cẩn thận giữa những tảng đá.", "eng": "He steered the ship carefully between the rocks."}, {"viet": "Nó bị một đòn nặng vào đầu.", "eng": "He sustained a severe blow on the head."}, {"viet": "Anh ấy nắm chặt cánh tay cô ta.", "eng": "He tightened his grip on her arm."}, {"viet": "Ông ta nghiên cứu yêu cầu của tôi một cách thờ ơ.", "eng": "He treated my request with indifference."}, {"viet": "Nó lợi dụng thời tiết xấu làm cái cớ để không đến.", "eng": "He used the bad weather as an excuse for not coming."}, {"viet": "Anh ấy là một nhân vật có ích lớn cho hội đồng.", "eng": "He was a great assess to the committee."}, {"viet": "Hắn nói khoác là mình rất gan dạ vào lúc đầu, nhưng lại không dám làm điều đó vào phút chót.", "eng": "He was boasting about how brave he was at the start, but copped out of it at the finish."}, {"viet": "Ông ấy điềm tĩnh khi được phong giáo sư.", "eng": "He was dispassionate about his promotion to professorship."}, {"viet": "Nó bị đánh một loạt cú đấm tay phải.", "eng": "He was hit with a succession of rights."}, {"viet": "Anh đang ở điểm khởi đầu trong sự nghiệp của mình.", "eng": "He was on the threshold of his career."}, {"viet": "Nó đã bị bắn từ phía sau khi nó bỏ chạy.", "eng": "He was shot from behind as he ran away."}, {"viet": "Anh ta quá nhút nhát chẳng dám nói chuyện với cô ấy.", "eng": "He was too shy to speak to her."}, {"viet": "Nó đã chuồn mất mang theo 10000 pao của công ty.", "eng": "He went off with 10000 pounds of the company's money."}, {"viet": "Anh ta ngạc nhiên tự hỏi không biết có phải là ma lực làm biến đổi mà một giờ trước anh ta còn nôn nao ốm thế mà một giờ sau lại đói như cào như cấu.", "eng": "He wondered by what alchemy it was changed to that sickened him an hour, maddened him with hunger the next."}, {"viet": "Nghe thấy những tiếng còi inh tai trong lúc tắt nghẽn giao thông.", "eng": "Heard a cacophony of horns during the traffic jam."}, {"viet": "Việc bà ta bị bắt gây ra một vụ phản ứng ngay lập tức trong giới báo chí.", "eng": "Her arrest produced an immediate reaction from the press."}, {"viet": "Cái áo khoác của cô ta giá hàng trăm bảng Anh.", "eng": "Her coat cost hundreds of pounds."}, {"viet": "Đôi mắt cô ta lộ vẻ đau đớn.", "eng": "Her eyes took on a hurt expression."}, {"viet": "Bàn tay của cô ta đầy vết gai cào.", "eng": "Her hands were covered with scratches from the thorns."}, {"viet": "Quyển sách gần đây nhất của bà ta khác hẳn với quyển sách trước đó của bà.", "eng": "Her latest book is quite dissimilar from her previous one."}, {"viet": "Băng nhạc mới của cô ấy được nhiều người ca ngợi.", "eng": "Her new record has received a lot of praise."}, {"viet": "Những câu chuyện sỗ sàng cô ta kể có thể làm cho người ta chướng tai.", "eng": "Her racy stories can be rather shocking."}, {"viet": "Bài diễn văn của bà được toàn hội nghị hoan nghênh.", "eng": "Her speech went down with the conference."}, {"viet": "Công việc của cô ta cần phải có sự thận trọng và chú ý cao độ đến chi tiết.", "eng": "Her work exacts great care and attention to detail."}, {"viet": "Những kế hoạch đầy tham vọng đã nhường chỗ cho những cân nhắc thiết thực về tài chính.", "eng": "High-flown plans have given way to hardheaded financial considerations."}, {"viet": "Âm mưu của anh ta nhằm lừa đảo chúng tôi đã bị ngăn chặn.", "eng": "His attempt to deceive us was foiled."}, {"viet": "Đôi má của nó bắt đầu trở nên tròn trĩnh.", "eng": "His cheeks are beginning to plump out."}, {"viet": "Sự miễn cưỡng của ông ta trong việc tìm cách giải quyết nguyên nhân của vấn đề.", "eng": "His disinclination to tackle the causes of the problem."}, {"viet": "Số mệnh của anh ta đã báo trước cái chết yểu của anh ta.", "eng": "His fatality predestined his early death."}, {"viet": "Anh ta chúi đầu trên một quyển sách.", "eng": "His head was bent over a book."}, {"viet": "Cuốn tiểu thuyết mới nhất của ông ấy đã không cho thấy hết tài năng của ông ấy.", "eng": "His latest novel does him an injustice."}, {"viet": "Tên ông ấy là John Smith vì vậy chữ cái đầu của ông ấy là J. S.", "eng": "His name is John Smith so his initials are J. S."}, {"viet": "Phong cách nhã nhặn cho thấy anh ta là một người lịch sự.", "eng": "His polite manner bespoke the gentleman."}, {"viet": "Lương ông ấy bị cắt bớt 10%.", "eng": "His salary has been cut by ten percent."}, {"viet": "Cuộc thương lượng thành công của ông ấy với Mĩ đã giúp ông ấy củng cố địa vị của mình trong chính phủ.", "eng": "His successful negotiations with the American helped him to consolidate his position in the government."}, {"viet": "Vợ ông ta đã vượt xa ông ta trong sự nghiệp của bà ấy.", "eng": "His wife has outdistanced him in her career."}, {"viet": "Những người đi nghỉ đang tắm nắng trên bãi biển.", "eng": "Holidaymakers are sunbathing on the beach."}, {"viet": "Còn đôi vòng đeo tay thì sao?", "eng": "How about a pair of bracelets?"}, {"viet": "Sao cô ta lại có thể trở mặt nói thế được sau tất cả mọi việc tôi đã làm cho cô ta.", "eng": "How could she turn round and say that, after all I've done for her."}, {"viet": "Anh đi làm bằng phương tiện gì?''Tôi đi xe buýt'.", "eng": "How do you get to work?''I take the bus'."}, {"viet": "Đến Boston phải mất bao lâu?", "eng": "How long does it take to get to Boston?"}, {"viet": "Chúng ta cần bao nhiêu tiếng để lên đỉnh?", "eng": "How many hours do we need to get to the summit?"}, {"viet": "Anh có khả năng kiếm được bao nhiêu?", "eng": "How much do you stand to make?"}, {"viet": "Nó cao bao nhiêu vậy, cô có thể ước tính được không?", "eng": "How tall is it, can you estimate?"}, {"viet": "Huxley là người dẫn giải và ủng hộ thuyết tiến hoá của Darwin.", "eng": "Huxley was an exponent of Darwin's theory of evolution."}, {"viet": "Tôi muốn xem vài phim Mỹ trong khi tôi ở Mỹ.", "eng": "I'd like to see some American movies while I'm in the United States."}, {"viet": "Tôi sẽ phắc thực đơn cho anh vào buổi sáng.", "eng": "I'll fax the menu to you in the morning."}, {"viet": "Tôi chỉ sẽ ở lại nếu anh cho tôi thêm tiền.", "eng": "I'll only stay if you offer me more money."}, {"viet": "Tôi e là món ăn cay hay nhiều dầu mỡ đều không thích hợp với chúng tôi.", "eng": "I'm afraid hot food or oily food does not agree with us."}, {"viet": "Tôi cảm thấy hơi khó chịu-tôi nghĩ mình nên nằm nghỉ một chút.", "eng": "I'm feeling rather peculiar-I think I'll lie down for a while."}, {"viet": "Tôi đến đây để gặp ông Brown đến từ Mỹ.", "eng": "I'm here to see Mr. Brown from the States."}, {"viet": "Tôi không chắc là cuốn sách của chúng ta có thành công không vì còn quá sớm để kết luận.", "eng": "I'm not sure if our book will be a success-it's early days yet."}, {"viet": "Tôi xin lỗi đã đánh vỡ cái tách, đó là điều chẳng may.", "eng": "I'm sorry I broke the cup, it was an accident."}, {"viet": "Tôi hết sức buồn cười là bài luận của tôi lại được giải.", "eng": "I'm ticked pink that my essay won the prize."}, {"viet": "Từ khi nghe tin buồn đó, tôi ở trong tình trạng hoàn toàn bối rối.", "eng": "I've been in a complete daze since hearing the sad news."}, {"viet": "Cổ họng tôi đau và ngực tôi cũng đau nữa.", "eng": "I've got a sore throat and my chest hurts."}, {"viet": "Tôi hầu như đã đọc xong cuốn sách.", "eng": "I've more or less finished reading the book."}, {"viet": "Tôi đã làm việc ở nhiều dự án và các tòa cao ốc.", "eng": "I've worked on many projects and buildings."}, {"viet": "Tôi luôn nghi ngờ hắn hèn nhát.", "eng": "I always suspected he was yellow."}, {"viet": "Tôi ngạc nhiên khi biết nó đã không đến.", "eng": "I am surprised to learn that he did not come."}, {"viet": "Tôi xin anh đừng có liều lĩnh.", "eng": "I beg of you not to take any risks."}, {"viet": "Tôi đã đi tới kết luận rằng hắn ta đã nói dối.", "eng": "I came to the conclusion he's been lying."}, {"viet": "Tôi không thể mở cửa được nữa, chắc có ai đó khoá nó.", "eng": "I can't open the door-somebody must have locked it."}, {"viet": "Tớ có thể lưu chúng hộ bạn.", "eng": "I can file them for you."}, {"viet": "Tôi không tìm được bảo tàng quốc gia ABC.", "eng": "I can't find ABC National Museum."}, {"viet": "Tôi cho là tôi đã hoàn toàn được minh oan.", "eng": "I consider that I've been completely vindicated."}, {"viet": "Tôi sẵn lòng cho bạn mượn tiền.", "eng": "I'd be glad to lend you the money."}, {"viet": "Tôi tự nguyện làm điều đó.", "eng": "I did it of my own free will."}, {"viet": "Tôi thật sự mong rằng chúng tôi không làm cho anh chịu nhiều phiền phức.", "eng": "I do hope we're not putting you to too much trouble."}, {"viet": "Tôi không biết tôi sẽ có thể đến được không.", "eng": "I don't know whether I will be able to come."}, {"viet": "Tôi nghĩ là cho đến bây giờ hắn cũng không nhận ra sự tàn ác của tội lỗi mà hắn làm.", "eng": "I don't think that even now he realizes the full enormity of his crime."}, {"viet": "Tôi không có ý hỏi anh điều đó, nhưng anh còn nợ tôi 200 đô.", "eng": "I don't wish to press the point but you do owe me $ 200."}, {"viet": "Tôi rất lo sợ khi nghĩ tới điều gì sẽ xảy ra nếu như cô ấy biết được.", "eng": "I dread to think what will happen if she finds out."}, {"viet": "Tôi cảm thấy là phải nói rõ lại những nhận định của tôi trước đây nếu chúng bị hiểu sai.", "eng": "I feel I must qualify my earlier remarks in case they are misinterpreted."}, {"viet": "Tôi rất lấy làm ngạc nhiên rằng không ai trong các bạn thích vở kịch ấy.", "eng": "I find it quite astonishing that none of you liked the play."}, {"viet": "Tôi chịu thua, cho tôi biết câu giải đáp đi.", "eng": "I give up; tell me what the answer is."}, {"viet": "Thời trai trẻ tôi đã có đôi lúc ăn chơi tưng bừng.", "eng": "I had a few flings in my younger days."}, {"viet": "Tôi tự nhéo mình xem đó có phải hoàn toàn chỉ là một giấc mơ.", "eng": "I had to pinch myself in case it was all a dream."}, {"viet": "Tôi còn trong tay ngôi nhà để không.", "eng": "I have an empty house on my hands."}, {"viet": "Tôi không tìm thấy bài thơ mới nào hay như những bài thơ cũ mà tôi thích.", "eng": "I have not any new poems as good as my our favorites."}, {"viet": "Tôi đã gói xong các gói hàng và chúng sẵn sàng để gửi đi qua bưu điện.", "eng": "I have wrapped up the parcels and they're read to be posted."}, {"viet": "Tôi nghe nói họ dự định kết hôn.", "eng": "I hear they intend to marry."}, {"viet": "Tôi hi vọng bác sĩ có thể chữa chỗ đau ở vai tôi.", "eng": "I hope the doctor can cure the pain in my shoulder."}, {"viet": "Tôi thật không thể hiểu nổi anh ấy.", "eng": "I just can't understand him."}, {"viet": "Tôi biết là họ chỉ có ý giúp thôi, song tôi e rằng đây là một trường hợp lắm sãi không ai đóng cửa chùa.", "eng": "I know they only meant to help, but it was a case of too many cooks, I'm afraid."}, {"viet": "Tôi thích chơi quần vợt đều, cốt để tập luyện giữ vững kỹ năng của mình.", "eng": "I like to play tennis regularly, just to keep my hand in."}, {"viet": "Con sẽ lau tay bằng khăn giấy vậy.", "eng": "I'll dry my hands with the tissues."}, {"viet": "Tôi sẽ ủng hộ anh hết mình.", "eng": "I'll support you to the hilt."}, {"viet": "Về cơ bản tôi là người hơi lạc hậu.", "eng": "I'm basically a bit of a square."}, {"viet": "Tôi tản bộ loanh quanh tới quán rượu thôi.", "eng": "I'm just trotting round to the pub."}, {"viet": "Tôi rất tiếc phải làm phiền ông.", "eng": "I'm sorry to trouble you."}, {"viet": "Tôi định đổi một vài đô la Canada ở ngân hàng nhưng tôi quên mất.", "eng": "I meant to change some Canadian dollars in the bank but forgot."}, {"viet": "Phải nói rằng tôi rất thán phục anh ta.", "eng": "I must say I take my hat off to him."}, {"viet": "Tôi chưa bao giờ hứa cho anh mượn ô tô cả: hẳn là anh nằm mơ đấy thôi!", "eng": "I never promised to lend you my car: you must be dreaming!"}, {"viet": "Tôi đã buộc nó phải nhận một cái giá cho công việc đó.", "eng": "I pegged him down to a price for the work."}, {"viet": "Tôi đi đến kết luận rằng hắn đã nói dối.", "eng": "I reached the conclusion that he'd been lying."}, {"viet": "Tôi tiếc đã tiêu quá nhiều tiền mua kẹo.", "eng": "I regret spending so much money on sweets."}, {"viet": "Trong dịp nghỉ hè, tôi đã nhiều lần gặp cô ta.", "eng": "I saw quite a lot of her during the holidays."}, {"viet": "Tôi sẽ chứng minh cho anh rằng người làm chứng không nói sự thật.", "eng": "I shall prove to you that the witness is not speaking the truth."}, {"viet": "Tôi mất cả ngày trời nai lưng ra làm công việc giấy tờ trên bàn giấy của tôi.", "eng": "I spent the whole day wading through the paperwork on my desk."}, {"viet": "Tôi cho rằng anh sẽ không đến dự cuộc liên hoan của Sophie.", "eng": "I take it you won't be coming to Sophie's party."}, {"viet": "Tôi nghĩ đó là thức ăn của lễ hội powwow.", "eng": "I think it is powwow food."}, {"viet": "Tôi nghĩ cậu thật là ngu đã không nhận đề nghị của ông ấy.", "eng": "I think you were stupid not to accept his offer."}, {"viet": "Tôi rất buồn về lời phê bình của anh.", "eng": "I took your criticism very much to heart."}, {"viet": "Thỉnh thoảng tôi đọc tiểu thuyết nhưng dạo này thì không.", "eng": "I used to read an occasional novel, but not these days."}, {"viet": "Tôi muốn hỏi cô các câu hỏi về chỗ này, chuyện gì diễn ra ở đây, cô làm gì.", "eng": "I want to ask you questions about the place, what goes on in here, what you do."}, {"viet": "Tôi muốn biết về những thay đổi có thể xảy ra, nhưng đã không moi được ở họ ( về điều đó ).", "eng": "I wanted to hear about possible changes, but I couldn't draw them ( on that )."}, {"viet": "Tôi đành phải gạt bỏ tự ái của mình mà đi hỏi vay tiền.", "eng": "I was forced to swallow my pride and ask for a loan."}, {"viet": "Tôi hơi ngán khi nghĩ đến việc đọc diễn văn trước một cử toạ như vậy.", "eng": "I was rather daunted by the thought of addressing such an audience."}, {"viet": "Tôi ở trên gác khi việc đó xảy ra.", "eng": "I was upstairs when it happened."}, {"viet": "Tôi sẽ không bao giờ đi làm trễ nữa.", "eng": "I will never be late again."}, {"viet": "Tôi sẽ không ngừng hét cho đến khi anh để cho tôi đi.", "eng": "I won't stop shouting until you let me go."}, {"viet": "Tôi sẽ đi với bạn, nhưng tối nay tôi phải thu xếp hành lý để đi nghỉ.", "eng": "I would go with you, but I have to pack tonight for my vacation."}, {"viet": "Tôi sẽ không đời nào chọn việc xem môn cricket làm trò giải trí.", "eng": "I would never choose to watch cricket as an amusement."}, {"viet": "Đừng ra biển nếu sắp có bão.", "eng": "If a gale threatens, do not go to sea."}, {"viet": "Nếu tôi có xúc phạm đến tình cảm của cô, điều đó không phải là cố ý.", "eng": "If I hurt your feelings, it was not intentional."}, {"viet": "Nếu ngày hôm đó mưa có lẽ chúng ta phải thay đổi các kế hoạch của mình.", "eng": "If the day turned out wet we may have to change our plans."}, {"viet": "Nếu chúng ta cùng góp ý kiến, chúng ta có thể tìm ra một giải pháp.", "eng": "If we pool our ideas, we may find a solution."}, {"viet": "Nếu phản bác lại tôi một lần nữa, anh sẽ bị đuổi.", "eng": "If you contradict me once more you're fired."}, {"viet": "Nếu anh đã học đánh máy thì anh sẽ dễ dàng tìm được việc làm.", "eng": "If you learned to type you would easily find a job."}, {"viet": "Nếu anh muốn tham gia vào kế hoạch, anh phải quyết định ngay bây giờ.", "eng": "If you want to come in on the scheme, you must decide now."}, {"viet": "Trong một biện pháp hạn chế nhập khẩu, chính phủ đã tăng thuế quan.", "eng": "In a move to restrict imports, the government raised custom duties."}, {"viet": "Thực ra đó là một thông báo khá bất ngờ.", "eng": "In fact, it's very short notice."}, {"viet": "Trong bài diễn văn của tôi, tôi dự định nói về một số vấn đề rất nghiêm trọng.", "eng": "In my speech, I plan to address some very serious matters."}, {"viet": "Trong bóng tối, anh ta đã va phải cái bàn dài.", "eng": "In the darkness, he blundered into the hall table."}, {"viet": "Trong câu They were glad when I finished, when là liên từ giới thiệu mệnh đề phụ.", "eng": "In They were glad when I finished, when is subordinate conjunction."}, {"viet": "Thông tin không thuộc bản chất của tình hình.", "eng": "Information extrinsic to the situation."}, {"viet": "Nuôi chó hoặc mèo có phổ biến ở New Zealand không?", "eng": "Is it popular to own a dog or a cat in New Zealand?"}, {"viet": "Có cách nào khác ngoài việc mổ không?", "eng": "Is there any alternative to surgery?"}, {"viet": "Đó không phải cũng là môn thể thao yêu thích của bạn à?", "eng": "Isn't that your favorite sport, too?"}, {"viet": "Đã đến lúc nó được biết là mọi người đều cho cách cư xử của nó là lố bịch.", "eng": "It's about time he wised up to the fact that people think his behaviour is ridiculous."}, {"viet": "Đã lâu lắm tôi không đi xem phim.", "eng": "It's donkey's years since I went to the pictures."}, {"viet": "Thật đúng là tính cách của cô ta, đem chuyện đó kể cho mọi người.", "eng": "It's just like her to tell everyone about it."}, {"viet": "Anh không phải dạy tôi làm công việc như thế nào.", "eng": "It's not up to you to tell me how to do my job."}, {"viet": "Uống sâm banh ngày cưới là rất hợp.", "eng": "It's the done thing to serve champagne at weddings."}, {"viet": "Cần phải phân biệt rõ ràng chính sách của những người lãnh đạo và quan điểm của những người ủng hộ họ.", "eng": "It's important to draw a distinction between the policies of leaders and the view of their support."}, {"viet": "Đã trở thành cái lệ là chúng tôi ca hát khi nghỉ giải lao uống trà.", "eng": "It has become a rule that we sing during our tea-break."}, {"viet": "Thật là khó hiểu ( đối với tôi ) làm sao cô ta lại làm một điều như thế.", "eng": "It is hardly conceivable ( to me ) that she should do such a thing."}, {"viet": "Nó thích hợp cho chứng khoán và những vật nhỏ có giá trị khác.", "eng": "It is suitable for securities and other small valuable things."}, {"viet": "Có lẽ cần đến hai người trong số các bạn để chuyển cái bàn đi, nó không nhẹ lắm.", "eng": "It might take two of you to move the desk, it isn't very light."}, {"viet": "Nó không phải để mặc hàng ngày.", "eng": "It's not for everyday wear."}, {"viet": "Dường như tối nay có rất nhiều người đến dự.", "eng": "It seems there's quite a crowd present tonight."}, {"viet": "Một khi sương mù tan thì là một ngày đẹp.", "eng": "It was a fine day once the mist had cleared."}, {"viet": "Nữ hoàng ân cần nói chuyện với những người bệnh có tuổi.", "eng": "It was gracious of the Queen to speak to the elderly patients."}, {"viet": "Đó là điều kì lạ nhất tôi từng thấy.", "eng": "It was the damnedest thing I have ever seen."}, {"viet": "Khó mà đưa ra được một dự đoán chính xác.", "eng": "It would be difficult to make an accurate forecast."}, {"viet": "Jean rất cáu kỉnh vì cô ấy lỡ xe buýt và phải đi bộ đi làm.", "eng": "Jean's in a bad temper because she missed the bus and had to walk to work."}, {"viet": "Đánh giá vật gì theo chất lượng của chính nó.", "eng": "Judge something on its own merits."}, {"viet": "Người nông dân nặng nhọc lê bước qua đám ruộng lầy lội trở về nhà.", "eng": "Labourers plodded home through the muddy fields."}, {"viet": "Dù sao chúng ta cũng cố hết sức để đạt kết quả.", "eng": "Let's try our best to arrive at a result, anyway."}, {"viet": "Cuộc sống lúc đó khó khăn, song mọi việc càng ngày càng tốt hơn qua năm tháng.", "eng": "Life was difficult then but things have got better and better over the years."}, {"viet": "Nhiều khán giả bỏ ra về vì quá chán.", "eng": "Many of the andience walked out through sheer boredom."}, {"viet": "Martha đã thắng Rebecca và giành chiến lợi phẩm đầu.", "eng": "Martha aced out Rebecca to win the first place trophy."}, {"viet": "Xin cho tôi biết số phòng của bà?", "eng": "May I know your room number?"}, {"viet": "Bộ quần áo của tôi trong tủ đây này.", "eng": "Mine is right here in the closet."}, {"viet": "Chủ yếu là tôi muốn nói chuyện với các công nhân của anh.", "eng": "Mostly, I want to talk to your workers."}, {"viet": "Những liên tưởng của tôi với bức hoạ đó giống như những ngày mùa xuân.", "eng": "My associations with that painting are of springlike days."}, {"viet": "Trước kia bố tôi không hay hút thuốc nhưng bây giờ ông ấy hút.", "eng": "My father didn't use to smoke, but now he does."}, {"viet": "Lý do phản đối chủ yếu của tôi đối với kế hoạch này là do nó sẽ quá tốn kém.", "eng": "My main objection to the plan is that it would be too expensive."}, {"viet": "Chị tôi giữ một địa vị quan trọng trong Bộ môi trường.", "eng": "My sister occupies an important position in the Department of the Environment."}, {"viet": "Không bao giờ cô đứng thẳng người lên trả lời.", "eng": "Never! She replied, drawing her self up to her full height."}, {"viet": "Không, Em đã xuống sức vì tối qua em bị tiêu chảy nên em không thấy thèm ăn.", "eng": "No, I came down with diarrhea last night, so I don't have an appetite."}, {"viet": "Không có cái tin nào có thể cho tôi vui thích hơn.", "eng": "No news could be more delightful to me."}, {"viet": "Bây giờ tôi trả lại cái biến thế cho các cô.", "eng": "Now I return the transformer to you."}, {"viet": "Tất nhiên là không có chiếc xe hơi nào.", "eng": "Of course there are no cars."}, {"viet": "Được rồi, vậy thì anh sẽ dùng bơ.", "eng": "OK, I'll have butter then."}, {"viet": "Khi con gái ông ta bị bắt làm con tin, ông ta tuân theo nhiều hơn những đòi hỏi của chúng.", "eng": "Once his daughter was taken hostage, he would be more amenable to their demands."}, {"viet": "Một trong những câu hỏi thi làm tôi bối rối hoàn toàn.", "eng": "One of the exam questions baffled me completely."}, {"viet": "Xe chúng tôi chết máy ở đỉnh một ngọn đồi dốc đứng.", "eng": "Our car stalled on the brow of a steep hill."}, {"viet": "Nhu cầu tức thời của chúng tôi là nhân sự bổ sung.", "eng": "Our immediate requirement is extra staff."}, {"viet": "Dân phố chúng tôi năm nào cũng tổ chức hội hoá trang.", "eng": "Our street puts on a carnival every year."}, {"viet": "Cha mẹ phàn nàn về chất lượng chương trình nhưng không cấm bọn trẻ xem vô tuyến.", "eng": "Parents complain about the quality of the shows but don't prevent their children from gluing themselves to the boob tube."}, {"viet": "Người ta mắc đủ loại bệnh lây nhiễm về mùa đông.", "eng": "People catch all kinds of infections in the winter."}, {"viet": "Các kế hoạch đã đến giai đoạn cần phải được chi tiết hóa tỉ mỉ.", "eng": "Plans have reached the blueprint stage."}, {"viet": "Các kết quả thi cử kém là đòn kết liễu hy vọng của anh ta được học tiếp đại học.", "eng": "Poor exam results dealt the coup de grâce to his hopes of staying on at university."}, {"viet": "Khi rửa bát đĩa, Sarah lẩm bẩm một mình.", "eng": "Sarah was muttering away to herself as she did the washing-up."}, {"viet": "Hôm nay tớ sẽ quên chế độ ăn kiêng đi, tớ sắp được ăn uống thoả thích.", "eng": "Shall forget about dieting today, i'm just going to indulge."}, {"viet": "Bà ta là một tay lão luyện trong nghệ thuật đạt cho được bất cứ thứ gì bà ta muốn.", "eng": "She's a past master at the art of getting what she wants."}, {"viet": "Cô ấy chơi thân với cô gái phòng bên.", "eng": "She's chummed up with the girl in the next room."}, {"viet": "Cô ta vẫn giữ kín những ý định của cô ta.", "eng": "She's keeping her intentions to herself."}, {"viet": "Cô ta ở đâu đây thôi, tôi đã gặp cô ta cách đây mấy phút.", "eng": "She's somewhere about, I saw her a few minutes ago."}, {"viet": "Cô ta bắt anh ta viện niềm tin Chúa của anh ta mà thề nói sự thật.", "eng": "She adjured him by his belief in God to tell the truth."}, {"viet": "Cô ta đã làm mất đi tiếng tốt vì đi muộn một tiếng đồng hồ.", "eng": "She blotted her copybook by being an hour late."}, {"viet": "Bà ta phàn nàn rằng tờ tạp chí có một bài báo thiên vị.", "eng": "She complained that the magazine had published an unbalanced report."}, {"viet": "Bà ta uống thuốc chẳng ăn thua gì.", "eng": "She derived no benefit from the course of drugs."}, {"viet": "Cô ta kiếm sống bằng nghề làm người mẫu trưng bày ( quần áo, áo tắm, v. v. ).", "eng": "She earns a living by modelling ( dresses, swim-suits, etc )."}, {"viet": "Cô ta tấn công hung hãn như con hổ để có được điều cô ta muốn.", "eng": "She fought like a tiger to get what she wanted."}, {"viet": "Cô ta bị kẹp ngón tay vào cửa.", "eng": "She got her fingers caught in the door."}, {"viet": "Cô ta buộc lòng phải đến gặp nha sĩ.", "eng": "She had to be dragged into seeing the dentist."}, {"viet": "Bà ta chẳng bao giờ thực sự là một trong loại người thích giao du.", "eng": "She has never really been the sociable type."}, {"viet": "Cô ta thừa kế của mẹ nhan sắc đẹp và của bố cái tính cáu kỉnh.", "eng": "She inherited her mother's good looks and her father's bad temper."}, {"viet": "Bà ấy đang dọn sạch tuyết trên lối đi.", "eng": "She is scraping the path clear of snow."}, {"viet": "Dù trời lạnh đến đâu, cô ta vẫn để ngỏ cửa sổ buồng ngủ.", "eng": "She leaves her bedroom window open, however cold it is."}, {"viet": "Cô ta yêu gia đình, nhưng gia đình cản trở sự nghiệp của cô.", "eng": "She loves her family, but they're a drag on her career."}, {"viet": "Cô ấy chưa bao giờ thích anh ấy lắm.", "eng": "She never did like him very much."}, {"viet": "Câu chuyện kể là bà ấy đầu độc chồng.", "eng": "She poisoned her husband, or so the story goes."}, {"viet": "Cô ta từ chối khai báo với cảnh sát nếu cô ta tự thấy mình có tội.", "eng": "She refused to make a statement to the police in case she incriminated herself."}, {"viet": "Cô ta đã bị đuổi việc, và như vậy là đúng.", "eng": "She's been sacked, and rightly so."}, {"viet": "Cô ta là người trội nhất trong đám.", "eng": "She's the best of the lot."}, {"viet": "Bà ta có vẻ không biết đến khái niệm cho rằng mọi người cần phải có được cơ may bình đẳng.", "eng": "She seemed unfamiliar with the concept that everyone should have an equal opportunity."}, {"viet": "Cô ta giận dữ quăng cái áo vào trong ô tô.", "eng": "She slung her coat angrily into the car."}, {"viet": "Cô ta vênh váo đi qua, phớt lờ lời chào hỏi của chúng tôi.", "eng": "She strutted past us, ignoring our greeting."}, {"viet": "Bà ta nói cho khách khứa đang tụ tập biết cái gì đã xảy ra.", "eng": "She told the assembled company what had happened."}, {"viet": "Cô ta thường chạy khi còn đi học ở cao đẳng.", "eng": "She used to run when she was at college."}, {"viet": "Cô ta hết sức lo lắng trước cuộc phỏng vấn.", "eng": "She was all hung-up before the interview."}, {"viet": "Cô ta quá đỗi đau buồn và không chịu để ai an ủi.", "eng": "She was distracted with grief and refused to be solaced."}, {"viet": "Cô ta bị xe buýt đụng ngã gục.", "eng": "She was knocked down by a bus."}, {"viet": "Cô ta bị bỏng chết khi nồi hơi nổ.", "eng": "She was scalded to death when the boiler exploded."}, {"viet": "Cô ấy lo lắng vì lũ trẻ ra ngoài một mình.", "eng": "She was unhappy about the children going out alone."}, {"viet": "Chị ấy đi đón con ở trường.", "eng": "She went to get the children from school."}, {"viet": "Bà ấy làm việc nhiều tiếng đồng hồ, điều đó có hại cho sức khoẻ.", "eng": "She worked long hours to the detriment of her death."}, {"viet": "Mốt tóc ngắn đã thịnh hành trở lại cách đây mười năm.", "eng": "Short hair came back into vogue about ten years ago."}, {"viet": "Ninh món hầm khoảng một giờ.", "eng": "Simmer the stew for an hour."}, {"viet": "Trượt theo hình số tám trên băng.", "eng": "Skating figures of eight on the ice."}, {"viet": "Không được phép hút thuốc trong toa hạng nhất.", "eng": "Smoking is not allowed in first class."}, {"viet": "Vậy là anh sẽ tới vào thứ ba, sau cùng như vậy là dứt khoát, có phải không?", "eng": "So you're coming on Tuesday, after all, that's definite now, is it?"}, {"viet": "Một số từ tiếng Anh bắt nguồn từ tiếng Latin.", "eng": "Some English words are derived from Latin words."}, {"viet": "Một số người thậm chí còn thích hâm nóng nó trước khi uống.", "eng": "Some people even like to warm it before drinking."}, {"viet": "Người thông minh như bạn phải tiến xa hơn.", "eng": "Someone as intelligent as you should go far."}, {"viet": "Nêu ra ý kiến chung của giới cử tri về hình phạt tử hình.", "eng": "Sounding out the sense of the electorate on capital punishment."}, {"viet": "Nhân viên được chuyển từ phòng này sang phòng khác do ý muốn thất thường của ông chủ.", "eng": "Staff are moved from one department to another at the whim of the boss."}, {"viet": "Hãy khuấy bột và sữa cho đặc quánh lại.", "eng": "Stir the flour and milk to a stiff paste."}, {"viet": "Vào thời điểm này trong năm dâu phát triển rất tốt.", "eng": "Strawberries are well growing this time of the year."}, {"viet": "Những bản chào giá rẻ như vậy không thể có được lần nữa.", "eng": "Such bargain offers can't be repeated."}, {"viet": "Ánh nắng mặt trời có lợi cho cây của bạn.", "eng": "Sunshine is good for your plants."}, {"viet": "Tìm cách giải quyết vấn đề nhập cư nan giải.", "eng": "Tackle the vexed issue of immigration."}, {"viet": "Nhân tiện nói đến Jim, chị có nghe nói anh ấy sắp cưới vợ chưa?", "eng": "Talking of Jim, have you heard that he's getting married?"}, {"viet": "Hãy nói chính xác cái gì đã xảy ra cho chúng tôi biết và đừng có quanh co.", "eng": "Tell us exactly what happened and don't prevaricate."}, {"viet": "Nhờ phản ứng nhanh mà hắn luôn trốn thoát được những kẻ truy nã hắn.", "eng": "Thanks to agile footwork he always managed to escape his pursuers."}, {"viet": "Cậu bé này cần có sự kiểm soát chặt chẽ để giúp cho nó trưởng thành.", "eng": "That boy needs a firm hand to help him grow up."}, {"viet": "Một chiếc xe rất oách-cậu kiếm nó ở đâu vậy?", "eng": "That is a very flash car-where did you get it?"}, {"viet": "Cái áo len màu cam đó cực kỳ chói mắt.", "eng": "That orange sweater is awfully loud."}, {"viet": "Cái khói đó gây ra những vấn đề về sức khoẻ là điều không còn nghi ngờ gì nữa.", "eng": "That smoking causes, health problems is an accomplished fact."}, {"viet": "Chuyến 10 giờ 15 đi Leeds xuất phát từ sân ga số 4.", "eng": "The 10.15 to Leeds departs from platform 4."}, {"viet": "Sự kiểm tra một tài xế giỏi là xem ông ta có giữ được bình tĩnh vào lúc nguy cấp hay không.", "eng": "The acid test of a good driver is whether he remains calm in an emergency."}, {"viet": "Các cánh cửa chiếc máy bay cho thấy dấu hiệu về độ mỏi của kim loại.", "eng": "The aircraft wings were showing signs of metal fatigue."}, {"viet": "Lời giải đáp đã đến với hắn khi hắn xem lại bài toán.", "eng": "The answer presented itself to him when he looked at the problem again."}, {"viet": "Quân đội thường xuyên tuần tra dọc biên giới.", "eng": "The army regularly patrol along the border."}, {"viet": "Khán giả phải ngồi vào ghế trước khúc nhạc mở màn.", "eng": "The audience must be in their seats before the overture."}, {"viet": "Đứa bé la hét đến đỏ cả mặt.", "eng": "The baby was screaming himself red in the face."}, {"viet": "Chủ ngân hàng sẽ so sánh chữ ký mẫu trên ngân phiếu du lịch với chữ ký mẫu.", "eng": "The banker will compare the signature on traveler's cheque with the specimen signature."}, {"viet": "Cái giường đặt vừa vặn trong hốc tường.", "eng": "The bed fits neatly into the alcove."}, {"viet": "Chim bay tan tác trước tiếng súng.", "eng": "The birds scattered at the sound of gun."}, {"viet": "Bom nổ đã giết chết nhiều người qua đường vô tội.", "eng": "The bomb blast killed several harmless passers-by."}, {"viet": "Ông chủ lúc nào cũng phê bình công việc của tôi.", "eng": "The boss is always crabbing about my work."}, {"viet": "Cành cây nhô lên khỏi mặt nước.", "eng": "The branch was sticking up out of the water."}, {"viet": "Các toà nhà và phong cảnh hoà nhập thành một thể thống nhất.", "eng": "The buildings and the landscape are well integrated."}, {"viet": "Bài toán khó quá nhưng chúng tôi cũng giải được.", "eng": "The calculation is difficult but we finally crack it."}, {"viet": "Chiếc xe ôtô đụng đứa bé và làm cho nó ngã ngửa về phía sau.", "eng": "The car hit the child, and she pitched over backwards."}, {"viet": "Ô tô nối đuôi nhau trong đường hầm.", "eng": "The cars were bumper-to-bumper in the tunnel."}, {"viet": "Buổi lễ gần giống như là một buổi lễ rửa tội.", "eng": "The ceremony was something like a christening."}, {"viet": "Chú gà con cuối cùng cũng làm vỡ vỏ trứng và chui ra khỏi vỏ.", "eng": "The chick finally broke through the shell and struggled out of it."}, {"viet": "Đứa bé hoảng sợ chết khiếp vì cơn bão tố sấm sét dữ dội.", "eng": "The child was frightened to death by the violent thunderstorm."}, {"viet": "Trẻ em có ba lần ra chơi trong ngày.", "eng": "The children have three playtimes during the day."}, {"viet": "Bọn trẻ con đứng lộn đầu.", "eng": "The children were standing on their head."}, {"viet": "Cả lớp đứng dậy khi thầy giáo vào.", "eng": "The class got up when the teacher came in."}, {"viet": "Huấn luyện viên chuẩn bị tinh thần cho đội đó trước trận đấu.", "eng": "The coach psyched the team before the game."}, {"viet": "Việc giao một bệnh nhân vào bệnh viện tâm thần.", "eng": "The commitment of a patient to a mental hospital."}, {"viet": "Công ty quan tâm đến hình ảnh của cả công ty.", "eng": "The company is concerned about its corporate image."}, {"viet": "Mâu thuẫn giữa trách nhiệm và dục vọng của một người.", "eng": "The conflict between one's duty and one's desires."}, {"viet": "Bản sao không giống mấy với nguyên bản.", "eng": "The copy does not come near the original."}, {"viet": "Đất nước bị lâm vào cảnh nội chiến sau cái chết của Tổng thống.", "eng": "The country was plunged into civil war after the death of the President."}, {"viet": "Khuynh hướng phạm tội trong nhân cách của hắn.", "eng": "The criminal twist in his personality."}, {"viet": "Đời sống văn hóa của quốc gia sẽ bị rơi vào chỗ suy đồi trừ phi có thêm nhiều văn nghệ sĩ xuất hiện.", "eng": "The cultural life of the country will sink into atrophy unless more writers and artists emerge."}, {"viet": "Ngày họp được chuyển từ mồng 10 lên mồng 3 tháng Sáu.", "eng": "The date of the meeting was advanced from 10 to 3 June."}, {"viet": "Vẻ đẹp tinh tế của một bông tuyết.", "eng": "The delicate beauty of a snowflake."}, {"viet": "Thổ ngữ này chủ yếu được dùng ở các vùng nông thôn.", "eng": "The dialect is spoken principally in the rural areas."}, {"viet": "Những đồ vật trưng bày ở Harrods là một trong những cảnh đẹp ở London.", "eng": "The displays in Harrods are one of the sights in London."}, {"viet": "Bác sĩ bảo anh phải nằm trên giường, ông ấy biết rõ hơn ai hết.", "eng": "The doctor told you to stay in bed, and he knows best."}, {"viet": "Con chó bị đánh đến chết.", "eng": "The dog was beaten to death."}, {"viet": "Người lái xe bị chấn thương nặng.", "eng": "The driver of the car was badly concussed."}, {"viet": "Nhà kinh tế học do dự không muốn bình luận về chính sách của nhà nước.", "eng": "The economist was hesitant to comment on government policy."}, {"viet": "Quân địch tiếp tục cuộc ném bom của họ cả ngày ngày lẫn đêm.", "eng": "The enemy kept up their bombardment day and night."}, {"viet": "Thực chất lý lẽ của ông ta là chủ nghĩa tư bản không thể nào thành công.", "eng": "The essence of his argument is that capitalism cannot succeed."}, {"viet": "Những nỗi bất hạnh của thời thơ ấu hằn trong tâm trí anh ta.", "eng": "The experiences of his unhappy childhood I branded on his memory."}, {"viet": "Gia đình như là đơn vị của xã hội.", "eng": "The family as the unit of society."}, {"viet": "Dù mưa hay nắng, lễ hội sẽ diễn ra vào ngày Chủ Nhật.", "eng": "The fête will take place on Sunday, rain or shine."}, {"viet": "Bộ phim nhận được những lời ca ngợi của tất cả các nhà phê bình.", "eng": "The film won accolades from all the critics."}, {"viet": "Hãng đã dồn tiền vào sự phát triển sản phẩm mới.", "eng": "The firm pumped money into the development of the new product."}, {"viet": "Có lẽ lửa để quá lớn.", "eng": "The flame was probably too high."}, {"viet": "Lực rơi của anh ta đã giảm bớt đi nhờ những tấm nệm rơm.", "eng": "The force of his fall was broken by the straw mats."}, {"viet": "Cảnh sát bao quanh những người tị nạn.", "eng": "The fugitives were encompassed by the police."}, {"viet": "Hốc lưỡng năng trong con đỉa biển.", "eng": "The gastrovascular cavity of a sea anemone."}, {"viet": "Những năm vẻ vang của Nữ hoàng Elizabeth I.", "eng": "The glorious years of Elizabeth I."}, {"viet": "Chính phủ xung đột với phe đối lập.", "eng": "The Government clashed with the Opposition."}, {"viet": "Chính phủ không chắc đã được Nghị viện thông qua dự luật trong nhiệm kỳ này.", "eng": "The government is unlikely to get the bill through within the lifetime of this Parliament."}, {"viet": "Sự mãn nguyện được biết kế hoạch của mình đã thành công.", "eng": "The gratification of knowing one's plans have succeeded."}, {"viet": "Những người bảo vệ vật lộn với bọn đột nhập.", "eng": "The guards wrestled with the intruders."}, {"viet": "Đầu của sao chổi rất to-to hơn trái đất rất nhiều-nhưng nó không phải là một quả cầu cứng.", "eng": "The head of a comet is very big-much large than the earth-but it is not a solid ball."}, {"viet": "Điều thú vị nhất trong chuyến đi du lịch của chúng tôi là được xem cung điện.", "eng": "The highlight of our tour was seeing the palace."}, {"viet": "Các con tin được những người bắt đối xử tốt.", "eng": "The hostages were well treated by their captors."}, {"viet": "Ngôi nhà trông rất cổ, song thực ra nó hoàn toàn mới.", "eng": "The house looks very old, but in reality it's quite new."}, {"viet": "Tư tưởng cho rằng mỗi con người đều quan trọng là tư tưởng làm cơ sở cho việc để con người tự cai trị chính mình.", "eng": "The idea that every human being is important is the idea back of letting people rule themselves."}, {"viet": "Ốm yếu là những sự kiện đồng hành với tuổi già.", "eng": "The infirmities that are the concomitants of old age."}, {"viet": "Quân xâm lược đã chặt tay chân tù binh rồi quăng những xác không toàn thây của họ xuống hào.", "eng": "The invaders cut of their prisoner's arms and legs and threw their mutilated bodies into the ditch."}, {"viet": "Cuộc hành trình từ Hà Nội đến Hải Phòng.", "eng": "The journey from Ha Noi to Hai Phong."}, {"viet": "Những tên bắt cóc trói ông ta lại và đánh thuốc mê ông ta.", "eng": "The kidnappers tied him up and then chloroformed him."}, {"viet": "Viên kim cương lớn nhất thế giới được tìm thấy có tên là Cullinan.", "eng": "The largest diamond ever found was named the Cullinan diamond."}, {"viet": "Tay đua dẫn đầu sẽ quành vào góc kia ngay bây giờ!", "eng": "The leading cyclist will be coming round that corner any minute now!"}, {"viet": "Vẻ sáng ngời và tinh anh hiện ra trong đôi mắt của một đứa trẻ.", "eng": "The light and vivaciousness that laugh in the eyes of a child."}, {"viet": "Chiếc mũi dài ở những con chó này là một đặc tính của việc lai cùng dòng.", "eng": "The long nose on these dogs is an inbred characteristic."}, {"viet": "Cái hòm của nhà ảo thuật có vẻ lơ lửng trên không, được nâng đỡ bằng các sợi dây không trông thấy được trên nền tấm màn đen sau sân khấu.", "eng": "The magician's trunk appeared to float midair, its supporting wires undistinguished against the black backdrop."}, {"viet": "Viên giám đốc hiện đang đi vắng.", "eng": "The manager is out at the moment."}, {"viet": "Cánh đồng cỏ đã được cày lên.", "eng": "The meadow's been ploughed up."}, {"viet": "Sau cuộc hành quân, binh sĩ nhanh chóng rời khỏi hàng ngũ.", "eng": "The men fell out quickly after their march."}, {"viet": "Bộ Nông nghiệp, ngư nghiệp và Thực phẩm.", "eng": "The Ministry of Agriculture, fisheries and Food."}, {"viet": "Mặt trăng đang lơ lửng trên cao trên bầu trời.", "eng": "The moon was riding high in the sky."}, {"viet": "Bộ phim ấy đã được quảng cáo phóng đại quá xa vời giá trị của nó.", "eng": "The movie has been hyped up for beyond its worth."}, {"viet": "Cây kim chạy không đúng rãnh trên đĩa hát này.", "eng": "The needle jumps on this record."}, {"viet": "Luật mới cho quyền cảnh sát chặn bất cứ ai trên phố.", "eng": "The new laws empower the police to stop anybody in the street."}, {"viet": "Đạo luật giao thông mới sẽ được đệ trình trước hạ nghị viện.", "eng": "The new transport bill will get its first reading in the house of common tomorrow."}, {"viet": "Phiên họp tới của những cuộc đàm phán về cắt giảm vũ khí.", "eng": "The next session of arms negotiations."}, {"viet": "Số người sống trên đảo đã giảm đi một cách nhanh chóng.", "eng": "The number of people who live on the island is rapidly dwindling."}, {"viet": "Viên cảnh sát nói anh ta sẽ mang lại trật tự đối với đám đông bằng cái dùi cui của mình.", "eng": "The officer said he would bring order to the gathering with his attitude-adjuster."}, {"viet": "Bọn trẻ lớn hơn kéo bè kết đảng chống lại lũ nhỏ hơn.", "eng": "The older children ganged up against the younger ones."}, {"viet": "Đứa trẻ mồ côi thèm khát tình thương.", "eng": "The orphan was hungry for affection."}, {"viet": "Tờ giấy đó đã chuyển sang màu xanh như thể có phép màu.", "eng": "The paper turned green as if by magic."}, {"viet": "Con đường dẫn đến thành công chiến thắng, quyền lực, huỷ diệt.", "eng": "The path to success, victory, power, ruin."}, {"viet": "Những người cô ta đã mời là một nhóm khá hỗn tạp.", "eng": "The people she'd invited were a pretty motley crew."}, {"viet": "Hình vẽ ở đầu trang sau cho thấy một trang trại sản xuất bơ sữa.", "eng": "The picture at the top of the next page shows a dairy farm."}, {"viet": "Kế hoạch xây dựng bệnh viện mới có triển vọng.", "eng": "The plan for new hospital bids fair to succeed."}, {"viet": "Vở kịch ngưng diễn trong hai tuần.", "eng": "The play folded within a fortnight."}, {"viet": "Cảnh sát quyết tâm tìm cho ra nơi ẩn nấp của bọn cầm đầu nhóm đó.", "eng": "The police are determined to smoke out the leaders of the gang."}, {"viet": "Cảnh sát đưa kẻ tình nghi về đồn.", "eng": "The police have taken the suspect to the police station."}, {"viet": "Cảnh sát đã bắt giam người bán hàng rong vì không có giấy phép.", "eng": "The policeman ran the man in for peddling without a license."}, {"viet": "Bưu phí cho gói hàng này rất đắt.", "eng": "The postage for this parcel is very expensive."}, {"viet": "Bài diễn văn của Tổng thống được dự kiến vào ngày thứ năm tới.", "eng": "The President's speech's scheduled for next Thursday."}, {"viet": "Giá cả là vấn đề thương lượng.", "eng": "The price is a matter for negotiation."}, {"viet": "Người tù đã thú nhận tội.", "eng": "The prisoner has admitted his guilt."}, {"viet": "Chương trình đó gây ra một số lời phàn nàn từ phía khán giả.", "eng": "The programme bought quite a crop of complaints from viewers."}, {"viet": "Niềm tin của công chúng đối với cảnh sát bị giảm sút.", "eng": "The public's trust in the police has been undermined."}, {"viet": "Hoàng thái hậu vẫy tay chào đám đông.", "eng": "The queen mother waved to the crowd."}, {"viet": "Tình trạng cạn kiệt nhanh chóng tài nguyên thiên nhiên của trái đất.", "eng": "The rapid exhaustion of the earth's natural resources."}, {"viet": "Cuộc cải tổ đã hạ chúng ta xuống thành những công bộc của Nhà nước.", "eng": "The reform has reduced us to servants of the State."}, {"viet": "Sự phẫn nộ nung nấu trong đầu ông ta.", "eng": "The resentment festered in his mind."}, {"viet": "Người kỵ sĩ thúc đinh ngựa vào bụng ngựa.", "eng": "The rider dug his spurs into the horse's flank."}, {"viet": "Con đường xuyên qua một vùng hoang dã và núi non.", "eng": "The road traverses a wild and mountainous region."}, {"viet": "Sợi dây thừng này bị mòn ở một chỗ.", "eng": "The rope was wearing thin in one place."}, {"viet": "Lương tối đa cho chức vụ này là 45.000 đô la.", "eng": "The salary for this position maxes at 45,000 dollars."}, {"viet": "Trường đó không nhận học sinh nữ.", "eng": "The school doesn't take girls."}, {"viet": "Tình trạng dịu bớt của một bệnh nhân co giật.", "eng": "The sedation of a hysterical patient."}, {"viet": "Lều gồm có các bộ phận rời để bạn tự mình ghép lấy.", "eng": "The shed comes in sections that you assemble yourself."}, {"viet": "Những con thuyền cột lại với nhau ở cảng.", "eng": "The ships were cabled together in the harbour."}, {"viet": "Cảnh đứa bé trai bơ vơ đã gợi lên bản tính làm mẹ của cô ta.", "eng": "The sight of the helpless little boy aroused her maternal instincts."}, {"viet": "Sự lắc lư đều đặn và chậm rãi của con tàu làm cho chúng tôi muốn mửa.", "eng": "The slow, steady roll of the ship made us feel sick."}, {"viet": "Những người lính ca thán rằng họ thiếu khẩu phần ăn.", "eng": "The soldiers complained that they were getting short rations."}, {"viet": "Diễn giả làm cho đám đông cuồng nhiệt.", "eng": "The speaker brought the crowd to fever pitch."}, {"viet": "Tiêu chuẩn chiều cao đòi hỏi đối với tân binh vào lực lượng cảnh sát.", "eng": "The standard of height required for recruits to the police force."}, {"viet": "Cơn bão đã làm gãy lìa cái cành khỏi thân cây lớn.", "eng": "The storm has split the branch off from the main tree trunk."}, {"viet": "Nhưng bổn phận của Copernicus với chức vụ giáo sĩ không chiếm tất cả thời giờ của ông.", "eng": "The studies of Copernicus as canon did not take all his time."}, {"viet": "Bác sĩ phẫu thuật cắt bỏ khối u trên ngực cô ta.", "eng": "The surgeon excised the lump from her breast."}, {"viet": "Thầy giáo phát các đề thi.", "eng": "The teacher gave out the examination papers."}, {"viet": "Máy thu hình hỏng, chúng tôi đành phải để mặc ai nấy lo.", "eng": "The television broke down so we were thrown back on our own resources."}, {"viet": "Tên trộm lao qua góc đường và biến mất.", "eng": "The thief whipped round the corner and out of sight."}, {"viet": "Bộ đồ nghề ở trong ga-ra đấy.", "eng": "The tool set is in the garage."}, {"viet": "Tàu đi Edinburgh sẽ khởi hành trong năm phút nữa.", "eng": "The train to Edinburgh will depart from platform in five minutes."}, {"viet": "Quần này không vừa với anh ta, chúng quá nhỏ.", "eng": "The trousers don't fit him, they are too small."}, {"viet": "Cả hai phía đều kêu gọi ngừng bắn để tránh đổ máu thêm.", "eng": "The two sides called a truce to avoid further bloodshed."}, {"viet": "Ứng viên thất bại yêu cầu kiểm phiếu lại.", "eng": "The unsuccessful candidate demanded a recount."}, {"viet": "Từ khi tôi sống ở đây, làng này nhà cửa mọc lên san sát.", "eng": "The village has been built up since I lived here."}, {"viet": "Chiếc đồng hồ ( mà ) anh cho tôi chạy rất đúng giờ.", "eng": "The watch ( that ) you gave me keeps perfect time."}, {"viet": "Toàn bộ buổi lễ diễn ra trong sự im lặng hoàn toàn.", "eng": "The whole ceremony took place in complete silence."}, {"viet": "Người đoạt giải thưởng Nobel năm nay về hoá học.", "eng": "The winner of this year's Nobel Prize for chemistry."}, {"viet": "Những người công nhân muốn có quan hệ bình đẳng với các quản đốc.", "eng": "The workers want to be on an equal footing on the same footing as the managers."}, {"viet": "Thee trong prithee và not trong cannot đều là từ ghép sau.", "eng": "Thee in prithee and not in cannot are enclitic."}, {"viet": "Việc chung sống của họ là cực kì hạnh phúc.", "eng": "Their life together has been wonderfully happy."}, {"viet": "Vậy, sau một giờ nữa ông vui lòng trả lại cho tôi thẻ chìa khoá cửa phòng 515 được không ạ?", "eng": "Then, would you please give me back the key card of 515 in an hour?"}, {"viet": "Có một lối vào khuất kín ngay chỗ quanh góc phố.", "eng": "There's a concealed entrance just round the corner."}, {"viet": "Ít có tin tức nước ngoài được đưa ra trên báo.", "eng": "There's little coverage of foreign news in the newspaper."}, {"viet": "Có ai ở bên ngoài-ai thế nhỉ?", "eng": "There's someone outside-who can it be?"}, {"viet": "Nó có nhiều vết nhăn ở vỏ xám.", "eng": "There are many folds in the gray covering."}, {"viet": "Có ba đơn âm t khác nhau trong sự phát âm từ titillate và hai đơn âm khác nhau trong từ tattletale.", "eng": "There are three phonetically different t phones in an utterance of'titillate'and two in an utterance of tattletale."}, {"viet": "Những lời sai chỉ của họ về hạnh kiểm của nó thật như nước đổ đầu vịt.", "eng": "There hints about his behavior were water off a duck's back."}, {"viet": "Tối nay trên tivi có một chương trình hay.", "eng": "There is an interesting programme on television tonight."}, {"viet": "Có quá nhiều người không cần thiết trong bộ phận giảng dạy.", "eng": "There is too much dead wood among the teaching staff."}, {"viet": "Có một cảnh sát đứng gác ở bên ngoài.", "eng": "There was a policeman on guard outside."}, {"viet": "Có quá nhiều việc, máy tính của chúng tôi khó mà đảm đương được.", "eng": "There was too much work for our computer to cope with."}, {"viet": "Có mấy chỗ trong công viên từ ngày 6 tháng bảy cho trẻ em từ 6 đến 16 tuổi chơi.", "eng": "There will be several day camps in the park from July 6 for children aged 6 to 16."}, {"viet": "Đồ thuỷ tinh này rất đắt vậy xin cẩn thận khi sử dụng chúng.", "eng": "These glasses are very expensive so please be careful with them."}, {"viet": "Những thống kê này cho thấy dân số đã tăng gấp đôi.", "eng": "These statistics show that the population has doubled."}, {"viet": "Họ đang làm việc rất tốt, nhưng họ phải coi chừng sự quá tự tin.", "eng": "They've been doing very well, but they should guard against over-confidence."}, {"viet": "Họ đang đào xuyên qua đồi để làm một đường hầm.", "eng": "They are digging through the hill to make a tunnel."}, {"viet": "Cả hai người đều cảm thấy rằng họ có duyên nợ phải chung sống với nhau.", "eng": "They both felt that they were predestined to spend their lives together."}, {"viet": "Họ có thể nhìn thấy đám lửa chập chờn ở xa.", "eng": "They could see the flicker of lights in the distance."}, {"viet": "Cuối cùng họ đã trở lại sau khi còi báo an vang lên.", "eng": "They eventually went back in after the all clear was sounded."}, {"viet": "Họ phải chống lại cuộc tấn công với rất ít đạn dược.", "eng": "They had to meet the attack with very little ammunition."}, {"viet": "Họ biết là không được phép đỗ xe ở đó, nhưng họ vẫn cứ ngang ngược làm.", "eng": "They know they're not allowed to park there, but, contrariwise, they always do."}, {"viet": "Thế nào họ cũng đến, nếu không họ đã gọi điện thoại.", "eng": "They must be coming, they'd have phoned else."}, {"viet": "Họ đặt chúng lên cái quầy đó, và có người viết phiếu cho họ.", "eng": "They put them on that counter, and someone writes a ticket for them."}, {"viet": "Họ dựng lên một sự lưỡng phân giả tạo giữa sự lao động và việc nuôi gia đình.", "eng": "They set up a false dichotomy between working and raising a family."}, {"viet": "Họ quay lại và bỏ chạy khi trông thấy nó có một khẩu súng.", "eng": "They turned and ran when they saw he had a gun."}, {"viet": "Họ bị từ chối không được phép đi qua vùng bị chiếm đóng.", "eng": "They were denied passage through the occupied territory."}, {"viet": "Họ sẽ không đồng ý với bất kể chính sách nào bao gồm việc sử dụng vũ khí hạt nhân.", "eng": "They will naysay any policy that includes the use of number weapons."}, {"viet": "Ngân hang này có mười hai phòng ban.", "eng": "This bank consists of twelve departments."}, {"viet": "Hãng mỹ phẩm này có 34 đại lý ở Anh.", "eng": "This cosmetics firm has 34 outlets in Britain."}, {"viet": "Cuốn tiểu thuyết đầu tiên này là tác phẩm của một nhà văn có triển vọng.", "eng": "This first novel is the work of a writer in the making."}, {"viet": "Đây là chuyện riêng của anh và tôi.", "eng": "This is just between you and me."}, {"viet": "Nút máy điều chỉnh âm lượng máy thu thanh.", "eng": "This knob controls the volume of radio."}, {"viet": "Vật này được chụp ảnh với độ phóng đại x 3.", "eng": "This object has been photographed at a magnification of x 3."}, {"viet": "Báo cáo này không nói tới những điều không cần thiết, nó đi thẳng vào những điểm chính.", "eng": "This report does not concern itself with inessentials, it gets directly to the main points."}, {"viet": "Hệ thống này được ghép từ tháng Mười 1990.", "eng": "This system was genned in October 1990."}, {"viet": "Những miếng thịt này hơi to, anh có thể chặt nó nhỏ hơn được không?", "eng": "Those chunks of meat are rather large, could you chop them up a bit smaller?"}, {"viet": "Tỉ giá mua tiền mặt hôm nay là 865.", "eng": "Today's rate for cash purchases is 865."}, {"viet": "Các y tá tập sự phải làm việc vài tuần ở phòng sản khoa.", "eng": "Trainee nurses have to work for some weeks in maternity."}, {"viet": "Nhiều chuyện bất hạnh đã làm cô ấy chua chát với cuộc đời.", "eng": "Various unhappy experiences have soured her view of life."}, {"viet": "Trở nên hùng hồn, lâm ly, v. v. về vấn đề đó.", "eng": "Wax eloquent, lyrical, etc on the subject."}, {"viet": "Chúng tôi sẽ dùng món này, và cả món sườn heo xào chua ngọt và món thịt heo xé xốt tỏi.", "eng": "We'll take this, as well as the Sweet and Sour Pork Chops, and the Shredded Pork with Garlic Sauce."}, {"viet": "Chúng tôi phải bỏ ra mỗi tháng 8300 pao để trả khoản thế chấp của chúng tôi.", "eng": "We're paying out 8300 pounds a month on our mortgage."}, {"viet": "Chúng ta có quá nhiều ghế-chắc là tôi đã đếm nhầm.", "eng": "We've got too many chairs-I must have miscounted."}, {"viet": "Chúng tôi bao giờ cũng có một đĩa thức ăn rán cho bữa trưa thứ bảy.", "eng": "We always have a fry-up for Saturday lunch."}, {"viet": "Chúng tôi vẫn tự hỏi không biết phải làm gì tiếp theo.", "eng": "We are still wondering what to do next."}, {"viet": "Chúng tôi không thể không nghĩ là nó vẫn còn sống.", "eng": "We can't help thinking he's still alive."}, {"viet": "Chúng tôi đập vữa cũ ra khỏi tường.", "eng": "We chipped the old plaster from the wall."}, {"viet": "Ở cửa hàng này chúng tôi không bán hàng hiệu đó.", "eng": "We don't carry that brand in this store."}, {"viet": "Chúng tôi nhận thấy hàng mẫu mà các ông đã gửi cho chúng tôi rất tốt và chúng tôi muốn đặt hàng thử.", "eng": "We found the sample you sent us very satisfactory and we are pleased to place a trial order."}, {"viet": "Vì lý do thuế, chúng tôi phải chính thức thành lập công ty.", "eng": "We had to incorporate the company for tax reasons."}, {"viet": "Chúng ta có những đường dây cáp điện vượt đại dương.", "eng": "We have message cables which cross oceans."}, {"viet": "Chúng tôi đợi khoảng hai tiếng đồng hồ trước khi máy bay tới.", "eng": "We hung about for two hours before the plane arrived."}, {"viet": "Chúng ta mất 24 tiếng khi băng qua đường Chia Ngày Quốc Tế.", "eng": "We lose 24 hours when we cross the International Date Line."}, {"viet": "Chúng ta phải tìm xa hơn nữa để thấy được những dấu hiệu thay đổi.", "eng": "We must look beyond for signs of change."}, {"viet": "Chúng tôi chỉ bán trái cây đang mùa thôi.", "eng": "We only carry fruits that are in season."}, {"viet": "Chúng tôi đã thuê một chiếc limo chi dip đó.", "eng": "We rented a limo for the occasion."}, {"viet": "Chẳng bao lâu chúng tôi bỏ xa những người chạy chậm hơn.", "eng": "We soon outstripped the slower runners."}, {"viet": "Sau bữa tối chúng tôi thường lang thang tới quán rượu.", "eng": "We usually meander down to the pub after dinner."}, {"viet": "Chúng tôi thì đã ăn mặc chỉnh tề để đi dự liên hoan rồi song cô ta vẫn còn mặc bộ quần áo thường.", "eng": "We were dressed up for the party but she was still in her ordinary clothes."}, {"viet": "Chúng tôi sẽ đưa ra các biện pháp bảo vệ hợp pháp chống lừa đảo.", "eng": "We will introduce legal safeguards against fraud."}, {"viet": "Này Fred, bạn rất ít khi đúng giờ mà.", "eng": "Well, Fred, you're seldom on time."}, {"viet": "À, kế đến là món thịt nướng kiểu Mông Cổ nhé?", "eng": "Well, then, how about a Mongolian Barbecue?"}, {"viet": "Tỉ giá đổi đô la là bao nhiêu?", "eng": "What's the rate of exchange against the dollar?"}, {"viet": "Các công ty hàng đầu ở Canada là những công ty nào?", "eng": "What are the top companies in Canada?"}, {"viet": "Bạn thích làm gì vào những ngày chủ nhật nắng gắt?", "eng": "What do you like to do on very sunny Sundays?"}, {"viet": "Cái gì đã xui khiến bạn làm một việc ngu ngốc như vậy?", "eng": "What induced you to do such a stupid thing?"}, {"viet": "Thời tiết ở Tokyo như thế nào?", "eng": "What is the weather like in Tokyo?"}, {"viet": "Bạn không thích xu hướng thời trang mới nào?", "eng": "What new fashion trends do you dislike?"}, {"viet": "Mấy giờ xe buýt khởi hành?", "eng": "What time does the bus leave?"}, {"viet": "Trước những bằng chứng về tội lỗi của mình, bà ta phải thú tội.", "eng": "When confronted with the evidence of her guilt, she confessed."}, {"viet": "Khi tôi nghe xong câu chuyện, tôi kết luận anh ta nói với tôi sự thật.", "eng": "When I had heard the story, I concluded that he told me the truth."}, {"viet": "Khi bọn trẻ nghịch ngợm, cô ấy đã giải quyết với chúng một cách ngắn gọn: cho chúng đi ngủ.", "eng": "When the children are naughty she deals with them in very short order: they're sent straight to bed."}, {"viet": "Ông nghĩ khi nào nó sẽ đến?", "eng": "When will it arrive, do you think?"}, {"viet": "Các công nhân nam nữ ăn trưa ở đâu?", "eng": "Where do the men and women eat their lunch?"}, {"viet": "Bạn thích môn nào hơn, trượt tuyết hay trượt ván tuyết?", "eng": "Which do you prefer, skiing or snowboarding?"}, {"viet": "Trong lúc họ lang thang khắp thế giới thì lũ con họ bị bỏ lơi ở nhà.", "eng": "While they gad about the world, their children are neglected at home."}, {"viet": "Chúng ta sẽ chọn ai chơi trung phong đây?", "eng": "Who shall we play at centre-forward?"}, {"viet": "Sao cậu không học cách viết đúng tên tôi?", "eng": "Why don't you learn to spell my name correctly?"}, {"viet": "Sẽ có hướng dẫn viên người Trung Quốc trên xe buýt chứ?", "eng": "Will there be a Chinese guide on the bus?"}, {"viet": "William Trương ở Công ty Thương mại Phương Đông là một người kinh doanh giỏi.", "eng": "William Chang of the Oriental Trading Co. is a good businessman."}, {"viet": "Với thất bại của các cuộc đàm phán hoà bình, mọi hy vọng kết thúc nhanh chóng cuộc chiến tranh đã tan biến.", "eng": "With the failure of the peace talks all hopes of a swift end to the war have flown out of the window."}, {"viet": "Nếu chúng ta hỏi liệu bà ta có nói cho chúng ta biết sự thật không?", "eng": "Would she tell us the truth if we asked her?"}, {"viet": "Bạn có muốn sống đến 100 tuổi không?", "eng": "Would you like to live to be 100 years old?"}, {"viet": "Anh hãy ngừng làm vớ vẩn nữa, hãy giúp tôi một chút được không?", "eng": "Would you stop frigging about and help me for a while?"}, {"viet": "Vâng, tôi là giám đốc ở đây.", "eng": "Yes, I am the manager here."}, {"viet": "Còn một thiên sử thi nữa về Đế quốc La Mã.", "eng": "Yet another epic about the Roman empire."}, {"viet": "Cậu sẽ thích nó hơn khi cậu hiểu nó hơn.", "eng": "You'll like it better when you understand it more."}, {"viet": "Cô trẻ, thông minh, hấp dẫn, cô có nhiều lợi thế!", "eng": "You're young, intelligent, attractive: you've got a lot going for you!"}, {"viet": "Em không định kể hết câu chuyện buồn đó chứ?", "eng": "You aren't going to tell the whole sad story, are you?"}, {"viet": "Anh có thể mượn ô tô của tôi bất cứ lúc nào anh muốn.", "eng": "You can borrow my car whenever you want."}, {"viet": "Anh có thể lấy làm may mắn là không phải đi đến cái buổi chiêu đãi buồn bã ấy.", "eng": "You can thank your lucky stars you don't have to go to this dreary reception."}, {"viet": "Tôi nghe nói anh thi lấy bằng lái xe bị trượt, thật là số không may!", "eng": "You failed your driving test, I hear-hard lines!"}, {"viet": "Anh có thể hoãn quyết định của anh đến tuần sau được không?", "eng": "You hold off your decision until next week?"}, {"viet": "Ý ông là những người chỉ muốn ngắm nhìn sự hoang dã thôi phải không?", "eng": "You mean people who just want to see the wilderness?"}, {"viet": "Cậu phải thôi làm việc đó một cách quá sức-cậu sẽ lăn ra ốm đấy.", "eng": "You must stop overdoing it-you'll make yourself ill."}, {"viet": "Anh hiểu cho, tôi phải giữa một ít nhân dân tệ vì tôi có thể sử dụng chúng ở sân bay trước khi tôi rời khỏi.", "eng": "You see I must keep some yuan for I may use them at the airport before I leave."}, {"viet": "Đáng lẽ anh không nên nói với anh ta như thế-anh đã thực sự gây ra chuyện rắc rối rồi đấy.", "eng": "You shouldn't have spoken to him like that-you've really started something now."}, {"viet": "Anh sẽ thấy nhiều cửa hàng ở vùng lân cận này.", "eng": "You will find several shops in the neighbourhood."}, {"viet": "Trang phục của anh phản ánh nhân cách của anh.", "eng": "Your clothes are a reflection of your personality."}, {"viet": "Đồng lương của anh thật là nhỏ nhoi so với những gì anh có thể kiếm được ở Mỹ.", "eng": "Your salary is chicken feed compared to what you could earn in America."}]