[{"viet": "Phải là 50 bảng Anh mới vừa đủ.", "eng": "50 should be enough to be going on with."}, {"viet": "Một cái vali có những ngăn riêng biệt đựng giày, đồ trang sức.", "eng": "A case with separate compartments for shoes, jewellery, etc."}, {"viet": "Một màu chuyển dần từ xanh dương sang xanh lá cây.", "eng": "A colour that shades from blue into green."}, {"viet": "Một tai nạn hai xe ôtô đâm nhau.", "eng": "A crash in which two cars collided."}, {"viet": "Một cách diễn khác có thể làm cho nghĩa đó rõ hơn.", "eng": "A different wording might make the meaning clearer."}, {"viet": "Một khúc nhạc kèn trổi lên khi Nữ hoàng bước vào.", "eng": "A fanfare was played as the queen entered."}, {"viet": "Một quán rượu tồi tàn ở ngoại ô thị xã.", "eng": "A fly-blown bar on the edge of town."}, {"viet": "Một nền giáo dục tốt không nên là độc quyền của giới nhà giàu.", "eng": "A good education should not be the monopoly of the rich."}, {"viet": "Cho nữa pint bia đắng.", "eng": "A half of bitter, please."}, {"viet": "Một ngôi nhà cách ga không quá một dặm.", "eng": "A house within a mile of the station."}, {"viet": "Một cuộc chạy rút vào phút chót cho kịp tàu.", "eng": "A last-minute dash for the train."}, {"viet": "Uống một hơi nước lạnh sẽ làm cho tất cả chúng ta tỉnh táo lại!", "eng": "A long cool drink would do us all a power of good!"}, {"viet": "Một cuộc đối đầu giữa các ứng cử viên tổng thống.", "eng": "A mano-a-mano between the presidential candidates."}, {"viet": "Tình yêu của người mẹ đối với các con của cô ta.", "eng": "A mother's love for her children."}, {"viet": "Một cuộc quờ quạng loạt soạt để tìm các đồng tiền trên nền nhà.", "eng": "A noisy scrabble for coins on the floor."}, {"viet": "Một cây bút thò ra khỏi túi của ai.", "eng": "A pen poking out of somebody's pocket."}, {"viet": "Một đối thủ có tỷ lệ hy vọng thắng cao.", "eng": "A player with a high strike-rate."}, {"viet": "Một vấn đề vượt quá khả năng hiểu biết của ai.", "eng": "A problem beyond somebody's comprehension."}, {"viet": "Một khuyến cáo là đề nghị 5% nên được bác bỏ.", "eng": "A recommendation that the offer of 5% be rejected."}, {"viet": "Một cây thước được chia độ theo cả in-sơ lẫn centimet.", "eng": "A ruler graduated in both inches and centimetres."}, {"viet": "Một tập nhạc piano do nhà soạn nhạc biên soạn hòa âm.", "eng": "A set of piano pieces orchestrated by the composer."}, {"viet": "Một mẫu bánh nhỏ thôi là quá đủ rồi, cám ơn.", "eng": "A small piece of cake will be ample, thank you."}, {"viet": "Hình vuông là hình có hai chiều và hình lập phương có ba chiều.", "eng": "A square is two-dimension and a cube is three-dimensional."}, {"viet": "Một siêu thị quay vòng hàng hóa của mình rất nhanh.", "eng": "A supermarket turns over its stock very rapidly."}, {"viet": "Một cổ áo chật bó chặt cổ lại.", "eng": "A tight collar that constricts the neck."}, {"viet": "Một sự xâm phạm không phận Anh quốc do máy bay lạ.", "eng": "A violation of British airspace by foreign aircraft."}, {"viet": "Một tác phẩm nghệ thuật mang lại niềm vui cho hàng triệu người.", "eng": "A work of art that has given pleasure to millions of people."}, {"viet": "Có hiểu biết về Anh ngữ.", "eng": "Acquire a good knowledge of English."}, {"viet": "Sau ít chén rượu anh ta bắt đầu hơi huyên thuyên.", "eng": "After a few drinks he began to open up a bit."}, {"viet": "Sau khi chúa Jesus từ cõi chết trở về, các môn đệ của Người tin vào Người mạnh đến nỗi họ trở nên những nhà thuyết giáo không biết sợ, và họ truyền bá các lời giảng của Người.", "eng": "After Jesus rose from the dead, his disciples had such faith in him that they became fearless preachers and spread his teachings."}, {"viet": "Sau những tiên đoán bi quan về thị trường tiêu thụ, mức sản xuất đã bị sụt một nửa.", "eng": "After the pessimistic sales forecasts, production was halved."}, {"viet": "Mọi cố gắng vực dậy ngành ngư nghiệp đều thất bại như do định mệnh an bài.", "eng": "All attempts to revive the fishing industry were foredoomed to failure."}, {"viet": "Tất cả việc đó đã xảy ra cách nay lâu rồi.", "eng": "All that happened many moons ago."}, {"viet": "Cho phép tôi kết thúc bài diễn văn ngắn của tôi bằng lời chúc cô dâu và chú rể luôn luôn hạnh phúc và gặp những điều may mắn tốt lành nhất trong tương lai.", "eng": "Allow me to conclude my brief speech by wishing the bride and bridegroom all happiness and the best of luck for the future."}, {"viet": "Trong số tất cả những khiếu tố và lời phản tố, khó mà xác định ai nói sự thật.", "eng": "Amongst all the claims and counterclaims it was hard to say who was telling the truth."}, {"viet": "Một bài báo chỉ đề cập sơ lược đến một câu hỏi.", "eng": "An article that only glances at a question."}, {"viet": "Một đoàn thám hiểm ngược dòng sông Amazon.", "eng": "An exploratory expedition up the Amazon river."}, {"viet": "Một công việc xử lý chất thải ở ngoài công trường.", "eng": "An off-site waste treatment operation."}, {"viet": "Một âm tiết không nhấn mạnh trong một từ.", "eng": "An unstressed syllable in a word."}, {"viet": "Thúc đẩy ai nỗ lực hơn nhiều hơn, với mơ ước thành công.", "eng": "Animate somebody to greater efforts, with a desire to succeed."}, {"viet": "Táo được bán theo cân Anh.", "eng": "Apples are sold by the pound."}, {"viet": "Chúng ta có bị muộn không?", "eng": "Are we going to be late?"}, {"viet": "Có phải bạn đang trên đường đi làm?", "eng": "Are you on your way to work?"}, {"viet": "Là một người mới bắt đầu, mọi việc đều rất mới mẻ đối với anh ta.", "eng": "As a beginner, everything is very new to him."}, {"viet": "Ngay khi ông ấy nhận chứng nhận gửi tiền, ông ấy đã kiểm tra số tiền.", "eng": "As soon as he got the certificate of deposit he checked the amount."}, {"viet": "Mới mười bốn tuổi, em chưa đủ tuổi để mua rượu đâu.", "eng": "At 14 you aren't old enough to buy alcohol."}, {"viet": "Ở điểm khởi đầu của một kỷ nguyên mới về y học.", "eng": "At the threshold of a new area in medicine."}, {"viet": "Băng đảng ngoài vòng pháp luật trú trong khu rừng đó.", "eng": "Bands of outlaws lived in the forest."}, {"viet": "Ở trong tình trạng hốt hoảng về việc gì.", "eng": "Be in a state of panic about something."}, {"viet": "Becker đạt được điểm ưu thế nhiều lần trước khi thua trận đấu.", "eng": "Becker reached advantage point several times before losing the game."}, {"viet": "Họ cùng quyên được 500 bảng Anh.", "eng": "Between them they raised £ 500."}, {"viet": "Cả hai đứa con bà ta đều có mắt xanh.", "eng": "Both of her children have blue eyes."}, {"viet": "Cô gái tóc hung tính tình sôi động và hoạt bát tìm người đàn ông thích vui nhộn.", "eng": "Bubbly and vivacious blonde seeks fun-loving gent."}, {"viet": "Nhưng tôi chỉ e là chúng tôi không lo được cho ông chu đáo.", "eng": "But I'm afraid we didn't take a good care of you."}, {"viet": "Nhưng khi bạn còn nhỏ, chắc bạn cũng làm điều tương tự.", "eng": "But when you were young, you must have done something similar."}, {"viet": "À này, cô có thể mang cho tôi vài cái ly được không?", "eng": "By the way, could you send me a few glasses?"}, {"viet": "Vui lòng giúp tôi một tay khiêng những túi tạp hóa này?", "eng": "Can I have a hand with these grocery bags?"}, {"viet": "Cô cũng có thể đưa tôi vào danh sách chờ trong ngày 3 được không?", "eng": "Can you also put me on the waiting list for the 3rd?"}, {"viet": "Xin cô vui lòng giúp tôi tìm nó nhé?", "eng": "Can you please help me find it?"}, {"viet": "Em không thể giữ mấy đứa nhỏ yên được sao?", "eng": "Can't you keep the children quiet?"}, {"viet": "Những thay đổi được thực hiện theo đường lối quản trị hiện nay.", "eng": "Changes made under the present regime."}, {"viet": "Các tín đồ Cơ Đốc giáo tin rằng linh hồn con người vẫn còn sống sau khi thể xác đã chết.", "eng": "Christians believe that a person's soul survive the death of his body."}, {"viet": "Lấy một bộ quần áo ở tiệm giặt.", "eng": "Collect a suit from the cleaners."}, {"viet": "Nén rơm lại thành khối để đốt.", "eng": "Compressing straw into blocks for burning."}, {"viet": "Việc đổi sang lò sưởi khí đốt sẽ tiết kiệm cho anh được nhiều tiền.", "eng": "Conversion to gas central heating will save you a lot of money."}, {"viet": "Cô vui lòng cho tôi thuê một phòng đôi?", "eng": "Could you let me have a double room?"}, {"viet": "Sự chỉ trích nhằm dè bỉu những thành tựu của cô ta.", "eng": "Criticism that detracts from her achievements."}, {"viet": "Ngày này qua ngày khác nàng đã vô vọng chờ đợi chàng gọi điện thoại cho mình.", "eng": "Day after day she waited in vain for him to telephone her."}, {"viet": "Động vật ở sa mạc buộc phải đấu tranh sinh tồn với sức nóng.", "eng": "Desert animals locked in a life-and-death struggle with the elements."}, {"viet": "Em đã ăn cái gì đó không hợp với bao tử của em phải không?", "eng": "Did you eat something that didn't agree with your stomach?"}, {"viet": "Bữa ăn tối mọi người tự phục vụ chứ không phải dọn ra bàn ăn.", "eng": "Dinner will be a cold buffet, not a sit down meal."}, {"viet": "Lần sau anh tới Luân Đôn nhớ tìm gặp tôi.", "eng": "Do look me up the next time you're in London."}, {"viet": "Bạn có mua nhiều sách không?", "eng": "Do you buy a lot of books?"}, {"viet": "Anh có thức ăn Trung Quốc nào không?", "eng": "Do you have any Chinese food?"}, {"viet": "Bạn có biết chi phí của một đám cưới ở Nhật Bản trung bình là bao nhiêu không?", "eng": "Do you know what the average cost of a wedding is in Japan?"}, {"viet": "Em thật sự nghĩ rằng anh ta thích em hay sao?", "eng": "Do you really think he likes you?"}, {"viet": "Bà cho là bà cần phục vụ cà phê dùng ngay trong quầy rượu của một khách sạn lớn à?", "eng": "Do you think you should serve instant coffee in the bar of a big hotel?"}, {"viet": "Cửa sổ mở vào trong hay ra ngoài?", "eng": "Does the window open inwards or outwards?"}, {"viet": "Đừng có quấy rầy bố về chuyện đó; bây giờ bố con đang rất mệt.", "eng": "Don't bother your father about it now; he's very tired."}, {"viet": "Đừng giới thiệu người khác chỉ bằng tên.", "eng": "Don't introduce people by first name only."}, {"viet": "Đừng có nhạo báng; hắn hoàn toàn đúng đấy.", "eng": "Don't scoff; he's quite right."}, {"viet": "Đừng lo gì về tiền: tôi có vô số tiền.", "eng": "Don't worry about money: I've got bags."}, {"viet": "Những giọt mồ hôi lăn dài trên trán của mình.", "eng": "Drops of perspiration rolling down one's forehead."}, {"viet": "Các biên tập viên nhanh chóng đưa ra một mẩu tin về vụ rơi máy bay cho mục tin giờ chót.", "eng": "Editors rushed out a piece on the crash for the late news."}, {"viet": "Tham gia cuộc chạy đua một dặm và cuộc chạy việt dã.", "eng": "Enter for the mile and the cross-country."}, {"viet": "Mọi người la hét cùng một lúc và thế là cuộc họp trở nên hỗn loạn.", "eng": "Everyone began shouting at once and the meeting broke up in disorder."}, {"viet": "Xin lỗi ông, cho phép tôi dẫn ông đến phòng của ông?", "eng": "Excuse me, sir, may I show you to your room?"}, {"viet": "Trung thực trong việc thi hành các nhiệm vụ của ông ta.", "eng": "Faithful in the performance of his duties."}, {"viet": "Phà qua lại giữa Dover và Calais.", "eng": "Ferries sailing back and forth between Dover and Calais."}, {"viet": "Thoạt tiên xe ôtô của tôi bị pan, kế đến tôi làm mất chìa khóa; đúng là họa vô đơn chí!", "eng": "First my car broken down, then I lost my key; it never rains but it pours!"}, {"viet": "Theo những luật lệ tôn giáo của ai.", "eng": "Follow the precepts of one's religion."}, {"viet": "Các nhà đầu tư nước ngoài cố giành được quyền kiểm soát công ty khỏi gia đình nó.", "eng": "Foreign investors are trying to wrest control of the firm from the family."}, {"viet": "Thường vào lúc này trong năm thì không có sương muối, nhưng vẫn có thể xảy ra.", "eng": "Frost is possible, although unlikely, at this time of year."}, {"viet": "Hãy chọn một khẩu súng trường có thể bắn thẳng được.", "eng": "Get a rifle that shoots straight."}, {"viet": "Đóng góp phần rất nhỏ bé của mình vào một chính nghĩa.", "eng": "Give one's mite to a good cause."}, {"viet": "Qua một hệ thống thủ tục thật rườm rà để có được giấy phép cư trú.", "eng": "Go through a real labyrinth of procedures to get a residence permit."}, {"viet": "Sự săn bắn gà gô ở những vùng đầm lầy của Xcốtlen và miền bắc nước Anh.", "eng": "Grouse shooting on the moors of Scotland and northern England."}, {"viet": "Đã cảm thấy bắt buộc phải đưa hàng trăm trẻ em vào ở những nhà tạm trú thiếu mọi phương tiện.", "eng": "Has felt forced to warehouse hundreds of children in temporary shelters."}, {"viet": "Thưa bà, bà đã quyết định dùng món gì chưa ạ?", "eng": "Have you decided on anything, madam?"}, {"viet": "Cậu đã nghe tin vui về việc mình đoạt giải thưởng hay chưa?", "eng": "Have you heard the good news about my award?"}, {"viet": "Anh ta đã bị đâm bốn lần bằng một con dao làm bếp.", "eng": "He'd been stabbed four times with a kitchen knife."}, {"viet": "Nó luôn luôn than thở về việc nó nghèo quá.", "eng": "He's always moaning about how poor he is."}, {"viet": "Anh ta may mắn có được một công việc tốt.", "eng": "He's fortunate in having a good job."}, {"viet": "Anh ta không quen uống nhiều rượu.", "eng": "He's not in the habit of drinking a lot."}, {"viet": "Anh ấy đã đối xử với anh tồi tệ, mặc dù vậy, anh ấy vẫn là anh của anh và anh nên giúp anh ấy.", "eng": "He's treated you badly, still, he's your brother and you should help him."}, {"viet": "Hắn làm ai cũng hết sức ngạc nhiên khi hắn thi đậu bằng lái xe.", "eng": "He amazed everyone by passing his driving test."}, {"viet": "Ông ta thuộc tầng lớp địa chủ thượng lưu.", "eng": "He belongs to the county set."}, {"viet": "Anh ta có thể chạy một dặm trong 4 phút.", "eng": "He can run a four-minute mile."}, {"viet": "Anh ta tiếp tục nói, chẳng cần biết đến tình cảm của tôi về vấn đề đó.", "eng": "He continued speaking, regardless of my feelings on the matter."}, {"viet": "Anh ta mô tả cuộc tấn công khủng bố đó như là hành động của bọn man rợ.", "eng": "He described the terrorist attack as the work of savages."}, {"viet": "Anh ta chơi hay không bằng một nửa người chị.", "eng": "He doesn't play half as well as his sister."}, {"viet": "Anh ta không nâng được tảng đá dù đã dùng hết sức lực.", "eng": "He failed to lift the rock in spite of all his exertions."}, {"viet": "Hắn đánh nhau dữ dội như bị quỷ ám.", "eng": "He fought like a man possessed."}, {"viet": "Cứ mỗi lần sắp lái xe ông ta lại phải mất công kiểm tra toàn bộ dầu nhớt và nước xe.", "eng": "He goes through the whole performance of checking the oil and water every time he drives the car."}, {"viet": "Anh ấy đã chiến đấu trong hai cuộc chiến tranh.", "eng": "He had fought in two wars."}, {"viet": "Nó chống đối quyết liệt việc tắm nước lạnh.", "eng": "He has a rooted objection to cold baths."}, {"viet": "Anh ấy không kìm chế được xúc cảm của mình.", "eng": "He has no control over his emotions."}, {"viet": "Hắn giấu khẩu súng trong túi.", "eng": "He hid the gun in his pocket."}, {"viet": "Không ai tử tế được như ông ấy cả.", "eng": "He is equaled by no one in kindness."}, {"viet": "Ông ấy vẫn còn là giám đốc.", "eng": "He is to continue as manager."}, {"viet": "Anh ấy đã sống lây lắt trong cảnh nghèo bao năm trời.", "eng": "He languished in poverty for years."}, {"viet": "Ông ta nhìn con cái mình với lòng hãnh diện thấy rõ.", "eng": "He looked at his children with evident pride."}, {"viet": "Anh ấy luôn tìm cách né tránh làm công việc nhà.", "eng": "He managed to dodge doing the housework."}, {"viet": "Anh ta không bao giờ dọn dẹp phòng của mình và mẹ anh ta cũng chẳng bao giờ bắt buộc anh ta làm việc đó.", "eng": "He never tidies his room and his mother never tries to make him do it."}, {"viet": "Ông ta ngã đập đầu về phía trước.", "eng": "He pitched forward on his head."}, {"viet": "Anh ta đã gây ra một sự ngạc nhiên lớn là phỏng vấn đầu tiên ông bộ trưởng mới.", "eng": "He pulled off a real coup by getting the first interview with the new minister."}, {"viet": "Nó đã nhận một phần thưởng lớn, điều đó đâu có quá mức nó có quyền hưởng.", "eng": "He received a large reward, which was no more than his due."}, {"viet": "Nó hoàn toàn xứng đáng bị trừng phạt như nó đã phải chịu.", "eng": "He richly deserved the punishment he received."}, {"viet": "Lúc nào anh ấy cũng hăng hái phiêu lưu.", "eng": "He's always game for adventure."}, {"viet": "Hắn bị lên cơn cúm nặng.", "eng": "He's had a bad go of flu."}, {"viet": "Anh ấy hoàn toàn xem thường sự an toàn của bản thân.", "eng": "He's quite reckless of his own safety."}, {"viet": "Anh ta hát quá tồi khiến khán giả la ó.", "eng": "He sang so badly that the audience booed him."}, {"viet": "Ông ta dường như coi khu phía đầu văn phòng đó như là một lãnh địa riêng của mình.", "eng": "He seems to regard that end of the office as his territory."}, {"viet": "Sau bữa ăn rất ngon ông ta khoan khoái thở dài.", "eng": "He sighed with pleasure after the excellent meal."}, {"viet": "Ông ta nói về thời gian ở tù của mình không một chút e dè.", "eng": "He spoke without reserve of his time in prison."}, {"viet": "Hắn đánh cô ta ngã xuống đất.", "eng": "He struck her to the ground."}, {"viet": "Hắn ta nói với cô ấy toàn chuyện dối trá và cô ấy đều tin hết.", "eng": "He tells her all those lies and she just laps them up."}, {"viet": "Anh ta lấy nó ở kệ trên cùng và đã đặt nó trở lại cũng chỗ đó.", "eng": "He took it off the top shelf and put it back in the same place."}, {"viet": "Anh ta quay đi và đi về phía ngược lại.", "eng": "He turned and walked in the opposite direction."}, {"viet": "Anh ấy nhảy điệu vanxơ với cô ta quanh căn phòng.", "eng": "He waltzed her round the room."}, {"viet": "Nó là một học sinh xuất sắc và chính bởi điều đó, những học sinh khác của lớp không ưa thích nó.", "eng": "He was an outstanding pupil and, ipso facto, disliked by the rest of the class."}, {"viet": "Anh ấy nói chuyện riêng trong phòng với giám đốc.", "eng": "He was closeted with the manager."}, {"viet": "Người ta tìm thấy nó đang ngủ gối đầu trên đống lá và rêu.", "eng": "He was found asleep on a pillow of leaves and moss."}, {"viet": "Anh cáu tiết vì sự không vâng lời của con trai.", "eng": "He was livid at his son's disobedience."}, {"viet": "Ông ta thở hổn hển khi đến ga.", "eng": "He was puffing hard when he reached the station."}, {"viet": "Anh ta thật là một người làm mất vui trong buổi liên hoan đến nỗi họ chẳng bao giờ mời anh ta nữa.", "eng": "He was such a wet blanket at the party that they never invited him again."}, {"viet": "Anh ta suýt bị giết chết.", "eng": "He was within an ace of being killed."}, {"viet": "Anh ta sẽ làm bất cứ điều gì có lợi.", "eng": "He will do everything for sake of gain."}, {"viet": "Ông ta không cho để đồ trang trí cổ đó trong nhà mình.", "eng": "He wouldn't give that old ornament houseroom."}, {"viet": "Cứu tôi với! Tôi bị sa lầy trong bùn!", "eng": "Help! I'm stuck in the mud!"}, {"viet": "Những cuốn sách của bà ấy cho ta một bức tranh khá lí tưởng về cuộc sống của nước Anh thế kỉ 19.", "eng": "Her books give a rather idealized picture of life in 19th century England."}, {"viet": "Các viên kim cương của chị ấy lấp lánh dưới ánh sáng nến.", "eng": "Her diamonds sparkled in the candle-light."}, {"viet": "Những ngón tay cô ta tê cóng vì lạnh.", "eng": "Her fingers were numb with cold."}, {"viet": "Những ý kiến về giáo dục của bà ấy hiện nay hơi lạc hậu.", "eng": "Her ideas on education are rather outdated now."}, {"viet": "Tài năng nhiều mặt của cô ta là lý do thèm muốn của tất cả bạn bè của cô.", "eng": "Her many talents were the envy of all her friends."}, {"viet": "Bố mẹ cô ta sẽ không bao giờ ưng thuận một cuộc hôn nhân như vậy.", "eng": "Her parents will never acquiesce in such a marriage."}, {"viet": "Học phí trong trường là 440 bảng Anh một học kỳ, còn nhạc và khiêu vũ là những phụ phí.", "eng": "Her school fees are £ 440 a term, music and dancing are extras."}, {"viet": "Tâm trí của bà ta thường quay về với nước Ý.", "eng": "Her thoughts often reverted to Italy."}, {"viet": "Đây là cái chăn và nước nóng cho bà.", "eng": "Here is a blanket and hot water for you."}, {"viet": "Năm sau ông được thăng lên cấp tướng.", "eng": "His advancement to general came the following year."}, {"viet": "Sau cuốn của tôi cuốn của anh ta là hay nhất về đề tài này.", "eng": "His book is the best on the subject after mine."}, {"viet": "Nhóm săn sóc khuyên anh hãy bỏ cuộc.", "eng": "His corner advised him to retire."}, {"viet": "Mắt anh ta là nét nổi bật nhất.", "eng": "His eyes are his most striking feature."}, {"viet": "Các bạn bè của anh ta khuyên can anh ta chú ý giữ gìn sức khoẻ hơn.", "eng": "His friends adjured him to take more care of his health."}, {"viet": "Sự không có khả năng xử lý một vấn đề nhỏ của anh ta đã biến nó thành một khủng hoảng lớn.", "eng": "His inept handling of a minor problem turned it into a major crisis."}, {"viet": "Tác phong của anh ta biểu lộ con nhà gia giáo.", "eng": "His manners spoke of good upbringing."}, {"viet": "Tranh của ông ấy có một ảnh hưởng mạnh mẽ đối với tôi, một sinh viên.", "eng": "His paintings had a strong influence on me as a student."}, {"viet": "Sự lập luận của anh ta không thể sai sót.", "eng": "His reasoning can't be flawed."}, {"viet": "Bài phát biểu của ông ấy về nạn thất nghiệp đã được hoan nghênh nhiệt liệt.", "eng": "His speech on unemployment was well received."}, {"viet": "Chú của anh ấy là một nhà ảo thuật chuyên nghiệp.", "eng": "His uncle is a professional magician."}, {"viet": "Môn lịch sử là một trong những môn yếu kém của anh ta.", "eng": "History is one of his blind spots."}, {"viet": "Những hy vọng sớm chấm dứt cuộc đình công đó đã gặp phải một trở ngại nghiêm trọng vào ngày hôm qua.", "eng": "Hopes of an early end to the strike received a severe set-back yesterday."}, {"viet": "Làm thế nào cho anh tin là tôi chân thành.", "eng": "How can I persuade you that I am sincere."}, {"viet": "Anh thấy chuyến đi thế nào?", "eng": "How did you like your travel?"}, {"viet": "Sáng nay chúng ta đã đi bao xa rồi?", "eng": "How far have we come this morning?"}, {"viet": "Ông muốn nấu nó bao lâu?", "eng": "How long would you like it?"}, {"viet": "Trên ống tay áo một trung sĩ có bao nhiêu vạch?", "eng": "How many stripes are there on a sergeant's sleeve?"}, {"viet": "Tôi phải mua bao nhiêu phẩm để nhuộm màu cái bàn?", "eng": "How much stain should I buy for the table?"}, {"viet": "Những đợt sóng lớn đã đánh tan con tàu đắm thành từng mảnh.", "eng": "Huge waves battered the wrecked ship to pieces."}, {"viet": "Cho tôi miếng bít-tếch thăn bò, khoai tây nướng và món rau trộn dầu giấm.", "eng": "I'd like the sirloin steak, baked potatoes and salad."}, {"viet": "Tôi sẽ ở lại nếu họ thăng chức cho tôi nhưng tôi chẳng có thể thấy điều đó xảy ra.", "eng": "I'd stay if they promoted me, but I can't see that happening."}, {"viet": "Tôi sẽ phải chấm dứt những cuộc thăm viếng hàng tuần này.", "eng": "I'll have to discontinue these weekly visits."}, {"viet": "Tôi sẽ bảo nó ngay khi nó đến đây.", "eng": "I'll tell him the minute he gets here."}, {"viet": "Tôi cũng là một đầu bếp giỏi như cô ta, trừ khi phải nhào bột.", "eng": "I'm as good a cook as she is except when it come to pastry."}, {"viet": "Tôi định mua một ít sơn ở cửa hàng bán đồ tự làm lấy.", "eng": "I'm going to get some paint at the do-it-yourself store."}, {"viet": "Tôi không quen với cái loại hành vi này.", "eng": "I'm not accustomed to this sort of behaviour."}, {"viet": "Tôi thật sự xin lỗi, tôi hứa với ông việc này sẽ không xảy ra nữa.", "eng": "I'm really sorry, I promise you it won't happen again."}, {"viet": "Tôi dám chắc rằng những thứ cầu kì của tôi cũng làm nhiều người Mỹ mất hứng thú.", "eng": "I'm sure I have mannerisms that turn off Americans, too."}, {"viet": "Tôi cảnh cáo anh lần cuối cùng-không được nói chuyện!", "eng": "I'm warning you for the last time-stop talking!"}, {"viet": "Tôi đi lòng vòng suốt ngày quanh các cửa hiệu và mệt rũ người.", "eng": "I've been trailing round the shops all day, and I'm absolutely worn to a frazzle."}, {"viet": "Tôi đã phải ăn nhiều thứ đến nỗi cảm thấy như mình béo húp híp.", "eng": "I've had so much to eat I feel absolutely bloated."}, {"viet": "Tôi đã đọc báo cáo nhưng chẳng vì thế mà hiểu thêm được tí nào.", "eng": "I've read the report but I'm no whit the wiser."}, {"viet": "Tôi nhằm cửa ra vào nhưng lại trúng cửa sổ.", "eng": "I aimed at the door but hit the window."}, {"viet": "Tôi mong đợi anh ta viết thư cho tôi.", "eng": "I am longing for him to write me a letter."}, {"viet": "Tôi yêu cầu tăng lương và bà ấy đồng ý.", "eng": "I asked for a pay rise and she agreed."}, {"viet": "Tôi mua hoa tặng cô ấy để làm lành.", "eng": "I bought her some flowers as a peace offering."}, {"viet": "Tôi không thể nào bày tỏ được lòng biết ơn anh đến thế nào về sự giúp đỡ của anh.", "eng": "I can't express to you how grateful I am for your help."}, {"viet": "Tôi không thể nhận lời tán thưởng nào, những người khác làm hết mọi việc.", "eng": "I can't take my credit, the others did all the work."}, {"viet": "Tôi thấy không có sự biện minh nào cho việc phân chia công ty thành những đơn vị nhỏ hơn.", "eng": "I can see no justification for dividing the company into smaller units."}, {"viet": "Tôi không thể nói với ông là tôi áy náy như thế nào đâu.", "eng": "I can't tell you how sorry I am."}, {"viet": "Tôi có thể dựa vào cô ta mà chỉnh đồng hồ của mình.", "eng": "I could time my watch by her."}, {"viet": "Tôi muốn đặt một phòng đơn.", "eng": "I'd like to reserve a single room."}, {"viet": "Tôi không nhận được thư báo là đã nhận được đơn xin của tôi.", "eng": "I didn't receive an acknowledgement of my application."}, {"viet": "Tôi không trả lời được đâu Anh phải hỏi người khác.", "eng": "I don't have the answer You'll have to ask someone else."}, {"viet": "Tôi không sống trong xa hoa song tôi có đủ để thoả mãn những nhu cầu cơ bản của tôi.", "eng": "I don't live in luxury but I have enough to satisfy my needs."}, {"viet": "Tôi không muốn có một sự hiểu lầm nào.", "eng": "I don't want there to be any misunderstanding."}, {"viet": "Tôi không thích thái độ khúm núm của hắn.", "eng": "I don't like his servile manner."}, {"viet": "Tôi yêu cầu anh phải đúng giờ.", "eng": "I expect you to be punctual."}, {"viet": "Tôi thấy nhẹ cả người khi tôi nghe thấy là tôi đã thi đỗ.", "eng": "I felt great relief when I heard I had passed the examination."}, {"viet": "Ngay từ đầu tôi đã thấy ý kiến đó là hấp dẫn, và bây giờ tôi lại càng tin chắc đó là giải pháp duy nhất.", "eng": "I found the idea attractive from the first, and now I'm convinced it's the only solution."}, {"viet": "Tôi đã nhận được máy trợ thính từ Cơ quan Y tế Quốc gia.", "eng": "I got my hearing aid on the National Health service."}, {"viet": "Tôi đã hi vọng được 1000 đôla nhưng tôi đành chấp nhận 500.", "eng": "I had hoped for 1000 dollars but I had to settle down for 500."}, {"viet": "Tôi ghét Yarmouth vào thời gian này trong năm, bạn không thể nhúc nhích được vì dầy đặc những người đi chơi một ngày.", "eng": "I hate Yarmouth at this time of year, you can't move for the day-tripper."}, {"viet": "Tôi có đem theo chứng minh nhân dân.", "eng": "I have l. D. card with me."}, {"viet": "Trong tâm trí tôi anh là một mẫu người luôn vui tươi.", "eng": "I have this image of you as always being cheerful."}, {"viet": "Tôi không biết tí gì về khái niệm mà anh muốn nói.", "eng": "I haven't the vaguest notion what you mean."}, {"viet": "Tôi giúp một người mù qua đường.", "eng": "I helped the blind man across."}, {"viet": "Tôi mong ông sẽ nhận lời của chúng tôi.", "eng": "I hope you'll join us."}, {"viet": "Tôi đã biết thế nào rồi cậu cũng sẽ nói điều đó-trông cậu như thế tôi đã đoán được rồi!", "eng": "I knew you'd say that-you're so predictable!"}, {"viet": "Tôi thích một chiếc xe mới, nhưng tôi không có số tiền cần thiết ( để mua ).", "eng": "I like a new car but I haven't got the wherewithal ( to buy in )."}, {"viet": "Tôi sẽ đến trạm dừng kế tiếp.", "eng": "I'll be getting off the next stop."}, {"viet": "Tôi sẽ để nó y như vậy.", "eng": "I'll leave it as it is."}, {"viet": "Tôi thích tông màu xanh lá cây này.", "eng": "I love this shade of green."}, {"viet": "Tôi sẽ thoa thuốc mỡ lên chân.", "eng": "I'm going to apply ointment to my leg."}, {"viet": "Tôi đang ăn kiêng bằng thuốc đấy.", "eng": "I'm on a medicine diet."}, {"viet": "Tôi đã đặt giá với anh ta về chiếc bàn cổ.", "eng": "I made him a bid for the antique table."}, {"viet": "Tôi phải làm cho anh bỏ cái tính tự cao tự đại của anh đi.", "eng": "I must disabuse you of your feeling of grandeur."}, {"viet": "Tôi cần thời gian để suy nghĩ về đề nghị của anh.", "eng": "I need time to reflect on your offer."}, {"viet": "Tôi làm thế chỉ vì muốn chọc cười thôi.", "eng": "I only did it for a giggle."}, {"viet": "Tôi dự định khởi hành sớm ngày mai.", "eng": "I propose an early start tomorrow."}, {"viet": "Tôi đã nhận chi phiếu sau khi trả vượt quá hoá đơn.", "eng": "I received a credit after overpaying the bill."}, {"viet": "Tôi đã nhanh chóng cung cấp một ít người trợ lực để phân phát những tờ truyền đơn.", "eng": "I rustled up a few helpers to hand out leaflets."}, {"viet": "Tôi hiếm khi uống rượu không có đá lắm.", "eng": "I seldom drink wine without ice."}, {"viet": "Tôi bị kẹp ngón tay khi đóng cửa xe ôtô.", "eng": "I shut my finger in the car door."}, {"viet": "Tôi gợi ý điều đó với anh ta nhưng anh ta hình như chỉ hơi quan tâm.", "eng": "I suggested it to him, but he seemed only mildly interested."}, {"viet": "Tôi nghĩ tôi sẽ dùng ngũ cốc để thay đổi.", "eng": "I think i'll just have cereal for a change."}, {"viet": "Tôi nghĩ là ngài Thủ tướng có thể không nắm được tình hình.", "eng": "I think the Prime Minister may be losing his grip."}, {"viet": "Còn tôi tưởng bà muốn tập thể dục thêm!", "eng": "I thought you wanted to get more exercise!"}, {"viet": "Tôi hy vọng là cô ấy không ốm nặng.", "eng": "I trust that she's not seriously ill."}, {"viet": "Tôi đã làm việc chủ yếu ở thành phố.", "eng": "I've worked mostly here in the city."}, {"viet": "Tôi muốn cưới cô ấy nhưng bố mẹ tôi đã làm khó dễ.", "eng": "I want to marry her, but my parents are creating difficulties."}, {"viet": "Tôi bắt đầu nghĩ rằng anh sẽ không bao giờ đến.", "eng": "I was beginning to think you'd never come."}, {"viet": "Tôi chỉ định mượn một ít tiền thôi mà.", "eng": "I was just going to borrow some money."}, {"viet": "Vào thời ấy, tôi vẫn còn sống với bố mẹ tôi.", "eng": "I was still living with my parents at that time."}, {"viet": "Tôi đi ngủ sớm vì mệt quá.", "eng": "I went to bed early, as I was exhausted."}, {"viet": "Tôi muốn để tài sản lại cho các con tôi.", "eng": "I wish to leave my property to my children."}, {"viet": "Tôi cũng tự hỏi liệu bạn có được tăng lương không.", "eng": "I wonder whether you'll get a raise or not."}, {"viet": "Thay mặt cho công ty chúng tôi và nhân danh cá nhân, tôi muốn dành cho ông và những người khách khác có mặt ở đây sự chào mừng nồng nhiệt.", "eng": "I would like to extend a warm welcome to you and other guests present here on the behalf of our company and on my own behalf."}, {"viet": "Tôi sẽ không phiền mượn một vài cuốn sách để học vào những ngày nghỉ.", "eng": "I wouldn't mind borrowing a few to read over the holidays."}, {"viet": "Nếu anh ấy không đi làm chúng tôi không còn vật dự trữ gì nữa.", "eng": "If he doesn't show up for work we're got no fall back."}, {"viet": "Jeff không tới đây ngay thế nào cũng có chuyện lôi thôi.", "eng": "If Jeff doesn't get back here pdq there's going to be trouble."}, {"viet": "Nếu họ không sớm trả tiền, chúng ta sẽ phải đe doạ họ một chút.", "eng": "If they don't pay soon we'll have to lean on them a little."}, {"viet": "Nếu lúc nào anh cũng kêu ca phàn nàn thì tôi không muốn nghe nữa đâu.", "eng": "If you are going to bag on everyone all the time, I don't want to hear about it."}, {"viet": "Nếu anh tăng gấp đôi tất cả các số lượng trong thực đơn thì sẽ đủ cho tám người.", "eng": "If you double all the quantities in the recipe it'll be enough for eight people."}, {"viet": "Nếu cậu nói cậu có lỗi chúng mình sẽ bỏ qua sự việc đã xảy ra.", "eng": "If you say you're sorry we'll forget the incident."}, {"viet": "Những người nhập cư bất hợp pháp cần thể thức hoá vị thế của họ bằng cách xin cho được giấy phép cư trú cần thiết.", "eng": "Illegal immigrants can regularize their position by obtaining the necessary residence permit."}, {"viet": "Ở nước Anh nữ hoàng trị vì, còn các đại biểu do dân bầu lên thì cai trị đất nước.", "eng": "In Britain the Queen reigns, but elected representatives of the people govern the country."}, {"viet": "Trong xã hội loài người, những ham muốn của chúng ta là có điều kiện.", "eng": "In human society, our passions are conditioned."}, {"viet": "Tuy vậy, về nhiều mặt, tất cả các tế bào đều giống nhau.", "eng": "In some ways, however, all cells are alike."}, {"viet": "Như thường lệ, tôi đến thăm cô ta mỗi tuần một lần.", "eng": "In the ordinary course of events, I visit her once a week."}, {"viet": "Trong những năm dồi dào, mọi người có đủ cái ăn.", "eng": "In years of plenty, everyone has enough to eat."}, {"viet": "Dịch vụ ngân hàng ở nước bạn có tiện lợi không?", "eng": "Is banking convenient in your country?"}, {"viet": "Từ đó có được đề cập đến trong từ điển không?", "eng": "Is that word covered in the dictionary?"}, {"viet": "Đây là nước cam mới vắt phải không?", "eng": "Is this fresh squeezed orange juice?"}, {"viet": "Từ New York tới Boston là một chuyến đi dài.", "eng": "It's a long commute from New York to Boston."}, {"viet": "Trời mưa năm hôm liền.", "eng": "It's been raining for five consecutive days."}, {"viet": "Khó quyết định xem cái nào tốt hơn.", "eng": "It's hard to decide which one's the better."}, {"viet": "Ngồi mà vò đầu bứt tai chẳng ích gì-chúng ta phải làm việc gì đó để giúp đỡ.", "eng": "It's no use just wringing our hands-we must do something to help."}, {"viet": "Thật sự nó là một dịp rất tốt để nhiều khách du lịch cả trong lẫn ngoài nước đến thưởng ngoạn.", "eng": "It's really such a splendid occasion that a lot of tourists both from home and abroad will come to see it."}, {"viet": "Sẽ không bình thường nếu một đứa trẻ ngồi im.", "eng": "It's unnatural for a child to be so quiet."}, {"viet": "Anh ấy không mất nhiều thời gian để quen với khí hậu ẩm ướt của Singapore.", "eng": "It didn't take him long to acclimatize to Singapore's humidity."}, {"viet": "Thiệt hại thật sự có thể đánh giá được sau đó.", "eng": "It is arguable that the real damage will be seen much later."}, {"viet": "Cũng có thể anh ta nói lên sự thật.", "eng": "It is not beyond the bounds of possibility."}, {"viet": "Có vẻ như là chúng ta sẽ phải chịu đựng chú Bill trong suốt dịp nghỉ cuối tuần.", "eng": "It looks as though we're going to be lumbered with Uncle Bill for the whole weekend."}, {"viet": "Đó là một trò chơi rất phổ biến.", "eng": "It's a very popular game."}, {"viet": "Đã đến lúc chúng ta chụp ảnh tạm biệt.", "eng": "It's time for our farewell photos."}, {"viet": "Phải mất hàng tuần mới qua được cái lề thói quan liêu.", "eng": "It takes weeks to get through the red tape."}, {"viet": "Đó là một sự lừa dối vô hại, chỉ định đùa thôi.", "eng": "It was an innocent deception, meant as a joke."}, {"viet": "Đối với mọi người, rõ ràng là đứa trẻ này đã bị ngược đãi.", "eng": "It was obvious to everyone that the child had been badly treated."}, {"viet": "Tôi cảm thấy sốt ruột phải giải thích mọi thứ một cách tỉ mỉ thế này.", "eng": "It wearies me to have to explain everything in such detail."}, {"viet": "Trung tâm mua sắm của nó có diện tích của ba sân bóng đá, có 350 cửa hàng.", "eng": "Its shopping centre, which is the size of three football fields, contains 350 stores."}, {"viet": "John đã bắt quả tang chị nó hút thuốc lá và đã đi mách.", "eng": "John caught his sister smoking and told on her."}, {"viet": "Bà chị cần đánh dấu những món mà bà muốn dùng trong bữa ăn sáng, ghi rõ tờ giờ và treo nó bên ngoài cửa phòng trước khi bà đi ngủ tối nay.", "eng": "Just tick the items you would like for breakfast, mark down the time and hang it outside your door before you go to bed tonight."}, {"viet": "Bỏ chuyện tốn kém sang một bên, có thật hiện nay chúng ta cần có thêm một chiếc ôtô nữa không?", "eng": "Leaving the expense aside, do we actually need a second car?"}, {"viet": "Lần này chúng ta hay chia nhau trả đi.", "eng": "Let's go Dutch this time."}, {"viet": "Con người tiến hành một cuộc đấu tranh không bao giờ dứt với thiên nhiên.", "eng": "Man is engaged in a constant struggle with Nature."}, {"viet": "Nhiều đại diện cho thế hệ già đã có mặt ở đó.", "eng": "Many representatives of the older generation were there."}, {"viet": "Có lẽ vậy, để tôi xem anh ta đáp một cách thờ ơ.", "eng": "May be, he said flatly I'll see."}, {"viet": "Có lẽ bởi vì chúng ta không thể ăn nó bất cứ khi nào chúng ta muốn.", "eng": "Maybe because we couldn't eat it whenever we wanted to."}, {"viet": "Hầu hết các thuộc địa của Anh nay đều độc lập.", "eng": "Most of Britain's possession are now independent."}, {"viet": "Máy của ông Crowther hiện đang bận, ông vui lòng cầm máy chờ được chứ?", "eng": "Mr Crowther's extension is engaged at the moment, will you hold?"}, {"viet": "Chiếc xe ô tô của tôi hình như có điều xúi-nó vẫn cứ tiếp tục hỏng máy.", "eng": "My car seems to have a hoodoo on it-it keeps breaking down."}, {"viet": "Thế hệ của tôi có cách sống khác với thế hệ bố mẹ và thế hệ ông bà tôi.", "eng": "My generation behaves differently from my father's and grandfather's."}, {"viet": "Giấy tờ của tôi đã lộn xộn hết cả rồi.", "eng": "My papers were all muddled up together."}, {"viet": "Vợ tôi định mang theo cả một chồng sách để đọc.", "eng": "My wife is taking a whole bunch of books to read."}, {"viet": "Tin tức lan truyền nhanh trong làng.", "eng": "News quickly went the round of the village."}, {"viet": "Không đâu, đó là những con sâu rượu đã mất tự chủ.", "eng": "No, those are drunk alcoholics who have lost control."}, {"viet": "Các nước không nằm trong khối EEC trả theo một biểu thuế khác cao hơn.", "eng": "Non EEC countries pay a higher differential tariff."}, {"viet": "Ngày nay chúng tôi ăn những món mà người khác ăn.", "eng": "Nowadays we eat what everyone else eats."}, {"viet": "Ồ, có thể ông đã làm việc vất vả quá.", "eng": "Oh, probably you've been working too hard."}, {"viet": "Bất chợt, tôi nhấc điện thoại và gọi cho chị tôi ở Úc.", "eng": "On impulse, I picked up the phone and rang my sister in Australia."}, {"viet": "Phải thúc giục đứa bé nếu không nó chẳng chịu làm gì cả.", "eng": "One has to push the child or she will do no work at all."}, {"viet": "Sau khi dập tắt đám cháy, nhà máy chỉ còn lại lớp tường bên ngoài.", "eng": "Only the shell of the factory was left after the fire had been put out."}, {"viet": "Cuộc đấu tranh của chúng ta chống tội ác phải kiên quyết và không khoan nhượng.", "eng": "Our fight against crime must be determined and relentless."}, {"viet": "Phương sách duy nhất của chúng tôi là báo cảnh sát.", "eng": "Our only resort is to inform the police."}, {"viet": "Lưu ý đến tình cảm của gia đình người quá cố, báo chí đã không đăng câu chuyện đó.", "eng": "Out of consideration for the bereaved family's feelings the papers did not print the story."}, {"viet": "Tại cuộc họp, sự xúc động đã lên tới đỉnh cao.", "eng": "Passion were running high at the meeting."}, {"viet": "Những người không thể đến vào giờ khác.", "eng": "People who can't come at any other time."}, {"viet": "Làm ơn bảo cậu ấy gọi điện cho anh khi về đến nhà nhé.", "eng": "Please tell him to call me when he comes home."}, {"viet": "Nhận được một số thư trả lời cho một mục quảng cáo.", "eng": "Receive several replies to an advertisement."}, {"viet": "Hãy xem liệu có thể tham dự lễ hội powwow hay không.", "eng": "See if it is possible to attend a powwow."}, {"viet": "Cô ta vừa ngồi xuống, anh ta đã hỏi tới tấp.", "eng": "She'd barely sat down before he started firing questions at her."}, {"viet": "Nàng có nhiều tham vọng và ham muốn thành đạt trong đời.", "eng": "She's ambitious and eager to get on in the world."}, {"viet": "Bà ta có vài ngàn bảng Anh để dành khi bà ta về hưu.", "eng": "She's got a few thousand pounds put away for her retirement."}, {"viet": "Cô ta thường bị các đàn ông có râu kích thích.", "eng": "She's often turned on by men with beards."}, {"viet": "Cô ta rất tài moi những bí mật từ dân chúng.", "eng": "She's very clever at winkling secrets out of people."}, {"viet": "Bà ta đã thu xếp mọi công việc xong xuôi trước khi đi nghỉ.", "eng": "She arranged all her business affairs before going on holiday."}, {"viet": "Bà ta chỉ có thể đưa ra một sự mô tả mang máng về kẻ tấn công bà.", "eng": "She can only give a vague description of her attacker."}, {"viet": "Cô ấy phủ lên đĩa thức ăn một tấm kim loại mỏng trước khi nướng.", "eng": "She covered the dish with aluminum foil, before baking."}, {"viet": "Cô ta cải trang với bộ tóc giả màu hung và đôi kính râm.", "eng": "She disguised herself with a blonde wig and dark glasses."}, {"viet": "Cô ta bắt đầu suy nghĩ ủ ê về những gì đã xảy ra với mình.", "eng": "She fell to brooding about what had happened to her."}, {"viet": "Hôm qua cô ta lờ tôi ở ngoài phố.", "eng": "She gave me the go-by in the street yesterday."}, {"viet": "Cô ấy làm đơn xin gia nhập dưới một cái tên giả.", "eng": "She had applied for membership under an assumed name."}, {"viet": "Cô ta hay hét lên khi cô ta nổi giận.", "eng": "She has a tendency to shout when she gets angry."}, {"viet": "Cô ta đã viết thư đòi phải xin lỗi''Tôi mới thích cái trơ tráo của cô ta làm sao!'.", "eng": "She has written to demand an apology.''I like her nerve!'."}, {"viet": "Bà ta ăn mặc không hợp với tuổi tác của mình.", "eng": "She is dressed in a manner hardly becoming to her age."}, {"viet": "Cô ấy đã kịp nén cơn tức giận.", "eng": "She just managed to hold back her anger."}, {"viet": "Hôm nay cô ta sẽ có ở đó, tôi nghĩ thế.", "eng": "She'll be there today, I suppose."}, {"viet": "Cô ấy cố gắng làm cho người phụ nữ cô ấy đã cứu ở dưới sông sống lại.", "eng": "She managed to revive the woman she had saved from the river."}, {"viet": "Bà ấy sống lâu hơn chồng hai mươi năm.", "eng": "She outlived her husband by twenty years."}, {"viet": "Cô ta diễn đạt nhiều tình cảm trong khi chơi viôlông.", "eng": "She puts great expression into her violin playing."}, {"viet": "Cô ấy là bạn của gia đình ông mà.", "eng": "She's a friend of your family."}, {"viet": "Cô ấy đã chạy vượt hơn tất cả các vận động viên khác.", "eng": "She's lapped all the other runners."}, {"viet": "Bà ta ngồi bên cạnh lửa, người quấn một cái chăn.", "eng": "She sat by the fire, swaddled in a blanket."}, {"viet": "Cô ấy hét lên rằng cô ấy không thể nghe rõ.", "eng": "She shouted that she couldn't hear properly."}, {"viet": "Cô ấy nói về nỗi sợ hãi của mình với sự chân thực hoàn toàn.", "eng": "She spoke about her fears with complete frankness."}, {"viet": "Cô ta rất chú ý đến công việc của mình.", "eng": "She takes great pains with her work."}, {"viet": "Bà ta cố phản đối, nhưng ông chủ toạ đã ngắt lời bà ta.", "eng": "She tried to object, but the chairman slapped her down."}, {"viet": "Cô ta muốn đi Hô-li-út.", "eng": "She wants to go to Hollywood."}, {"viet": "Cô ấy sinh ra ở London, nhưng giờ đây, cô ấy coi Paris là quê hương.", "eng": "She was born in London, but she now looks on Paris as her home."}, {"viet": "Nàng được phục chức như là một Công chúa Ấn Độ.", "eng": "She was got up as an Indian princess."}, {"viet": "Cô ấy trở thành mồ côi khi bố mẹ cô ấy chết trong một tai nạn máy bay.", "eng": "She was orphaned when her parents died in a plane crash."}, {"viet": "Cô ta còn đang hăm hở viết tiếp thì chuông reo.", "eng": "She was still writing away furiously when the bell went."}, {"viet": "Cô ta không thật sự nổi bật trong sự sốt sắng giúp đỡ của cô ta.", "eng": "She wasn't exactly conspicuous for her helpfulness."}, {"viet": "Bà ấy sẽ không đồng ý cho ông ấy đi chơi khuya.", "eng": "She won't consent to him staying out late."}, {"viet": "Cô ấy viết tay trước khi đánh máy nó.", "eng": "She wrote it out in longhand before typing it."}, {"viet": "Cho thấy rõ những cố gắng của họ là một sự lãng phí thời gian.", "eng": "Showed their efforts up as a waste of time."}, {"viet": "Nó mất tích từ khi nào?", "eng": "Since when has he been missing?"}, {"viet": "Trẻ con quấn quít bên mẹ.", "eng": "Small children cling to their mothers."}, {"viet": "Vậy ông ta không thể làm việc ở đây nữa.", "eng": "So he can't work here."}, {"viet": "Binh sĩ ghi tên vào sổ đi khi họ rời doanh trại.", "eng": "Soldiers sign out when they leave the barracks."}, {"viet": "Một số họ hàng của tôi, cô và chú của mẹ tôi, sống ở Mỹ.", "eng": "Some of my relations, my mother's aunt and uncle, live in America."}, {"viet": "Một lời tuyên bố nào đó sẽ là cần thiết để làm dịu bớt sự tò mò của công chúng.", "eng": "Some sort of statement will be necessary to appease public curiosity."}, {"viet": "Đôi khi tin tức trên tivi làm bố buồn.", "eng": "Sometimes the news on television makes me unhappy."}, {"viet": "Vẻ đẹp muôn màu muôn sắc ngoạn mục của hoa.", "eng": "Spectacular splotches of colour and beauty in the blossoms."}, {"viet": "Hãy ở đây cho đến khi tôi trở lại.", "eng": "Stay here until I come back."}, {"viet": "Đừng có chi li từng xu ta tiêu.", "eng": "Stop niggling about every penny we spend."}, {"viet": "Nghiên cứu các vi sinh vật trong nước.", "eng": "Study the minute organisms in water."}, {"viet": "Đột nhiên có một sự chấn động lớn ở nhà bên.", "eng": "Suddenly, there was a great commotion next door."}, {"viet": "Sự thay đổi ngược hẳn lại đáng ngạc nhiên của chính phủ.", "eng": "Surprising volte-face on the part of the government."}, {"viet": "Nhắc chân của mình ra khỏi bàn đạp li hợp.", "eng": "Take one's foot off the clutch."}, {"viet": "Các đội đang tranh cúp vô địch thế giới.", "eng": "Teams competing for the World Cup."}, {"viet": "Thử vũ khí hạt nhân dưới biển.", "eng": "Testing nuclear weapons under the sea."}, {"viet": "Thật là đáng yêu!'ông ta nói rất mỉa mai.", "eng": "That's really lovely, that is!'he said with heavy irony."}, {"viet": "Chuyến đi dường như không dài lắm.", "eng": "That didn't seem a long journey."}, {"viet": "Cái nhìn điên dại trong mắt anh ta làm tôi hoảng hốt.", "eng": "That mad looks in his eye give me the jitters."}, {"viet": "Đó là một loại cá trông thật hấp dẫn.", "eng": "That's an interesting looking fish."}, {"viet": "Thật là cú sút tuyệt kỹ!", "eng": "That was a peach of a shot!"}, {"viet": "Vụ tai nạn đó đã khơi ra việc duyệt lại chính sách an toàn của nhà trường.", "eng": "The accident prompted a review of school safety policy."}, {"viet": "Chiến dịch quảng cáo lên tới đỉnh cao vào dịp Nô-en.", "eng": "The advertising campaign reached a crescendo at Christmas."}, {"viet": "Người chủ chốt trong một cuộc chạy đua tiếp sức là người chạy cuối cùng.", "eng": "The anchor man in a relay team runs last."}, {"viet": "Vị kiến trúc sư được giao toàn quyền thiết kế một trung tâm thành phố mới.", "eng": "The architect was given with a blank check to design a new city centre."}, {"viet": "Vụ ám sát vị đại sứ đó đã đẩy đất nước vào chiến tranh.", "eng": "The assassination of the ambassador precipitated the country into war."}, {"viet": "Tuổi trung bình của sinh viên là mười chín tuổi.", "eng": "The average age of the students is nineteen."}, {"viet": "Quả bóng bay ngoặt sang phía trái.", "eng": "The ball swerved to the left."}, {"viet": "Phòng tắm hoàn toàn bừa bộn.", "eng": "The bathroom was a total mess."}, {"viet": "Các câu lạc bộ lớn đã thâu tóm hết cầu thủ giỏi nhất.", "eng": "The big clubs siphon off all the best players."}, {"viet": "Ban giám đốc coi tư cách của bạn rất trái với tiêu chuẩn về nghề nghiệp.", "eng": "The board considers your behaviour highly unprofessional."}, {"viet": "Cuốn sách được viết theo một cách sắp đặt lỏng lẻo.", "eng": "The book is written in an episodic format."}, {"viet": "Thằng bé lè lưỡi ra doạ em gái.", "eng": "The boy sticks his tongue out at his sister."}, {"viet": "Người ta thường nói người Anh có tính phớt.", "eng": "The British character is often said to be phlegmatic."}, {"viet": "Dịch vụ xe buýt là một điều ích lợi lớn đối với người già.", "eng": "The bus service is a great boon to old people."}, {"viet": "Thuyền trưởng cho con tàu đổi hướng.", "eng": "The captain put the ship about."}, {"viet": "Cái ôtô đó chạy qua chúng tôi một cái vù.", "eng": "The car sped past us with a whoosh."}, {"viet": "Con mèo để đầy những sợi lông trắng của nó trên chiếc áo len đen của tôi.", "eng": "The cat has left white hairs all over my black sweater."}, {"viet": "Người ta chờ đợi Bộ trưởng Tài chính công bố giảm thuế trong ngân sách năm nay.", "eng": "The Chancellor of the Exchequer is expected to announce tax cuts in this year's budget."}, {"viet": "Đứa bé bị đau tai vì tắc vòi Ơxtasơ.", "eng": "The child has earache caused by blocked Eustachian tubes."}, {"viet": "Bọn trẻ không còn răn dạy được nữa.", "eng": "The children are out of control."}, {"viet": "Trẻ em chạy lộn xộn ra khỏi lớp học.", "eng": "The children tumbled out of the classroom."}, {"viet": "Ngành công nghiệp điện ảnh có một loạt những năm làm ăn phát đạt.", "eng": "The cinema industry has had a series of fat years."}, {"viet": "Cái đồng hồ kêu tíc tắc, tíc tắc.", "eng": "The clock went tick-tock, tick-tock."}, {"viet": "Trường cao đẳng mà tôi xin vào đã nhận tôi.", "eng": "The college I applied to has accepted me."}, {"viet": "Sự ủng hộ nghiên cứu khoa học của công ty chỉ là loè loẹt bề ngoài thôi.", "eng": "The company's support of scientific research is just window-dressing."}, {"viet": "Những người tham gia thi đấu là cả một đám người ô hợp.", "eng": "The competition entries were a very mixed bag."}, {"viet": "Sự kiềm chế bạo loạn của đám đông tại những trận đấu bóng đá.", "eng": "The containment of crowd violence at soccer matches."}, {"viet": "Ngành công nghiệp xe hơi trong nước được bảo hộ mạnh mẽ đến nỗi ở đây rất hiếm thấy các xe nước ngoài.", "eng": "The country's car industry is so strongly protected that foreign cars are rarely seen there."}, {"viet": "Tòa án ra một án tù ngắn hạn.", "eng": "The court imposed a short custodial sentence."}, {"viet": "Đám đông bùng lên trong nhiệt tình yêu nước.", "eng": "The crowd irrupted in a fervour of patriotism."}, {"viet": "Hải quan đã tìm ra hê-rô-in giấu trong lô hàng.", "eng": "The Customs have found heroin hidden in freight."}, {"viet": "Người quá cố nhưng không để lại tài sản cá nhân gì.", "eng": "The deceased left no personal effects."}, {"viet": "Những vùng sâu thẳm của đại dương, nơi ánh sáng không thể lọt đến.", "eng": "The depths of oceans, where no light can infiltrate."}, {"viet": "Ông giám đốc sẽ lên đường ngày mai để đi kinh lý các chi nhánh ở nước ngoài.", "eng": "The Director leaves tomorrow for a tour of overseas branches."}, {"viet": "Bác sĩ không thể giải thích tại sao cơn sốt cao cứ kéo dài như thế.", "eng": "The doctor couldn't explain the persistence of the high temperature."}, {"viet": "Con chó nhảy một cái qua cổng.", "eng": "The dog cleared the gate in one bound."}, {"viet": "Cánh cửa được để mở nhờ một cái chặn cửa.", "eng": "The door was held open by a doorstop."}, {"viet": "Người Hà Lan đã đến định cư ở Nam Phi.", "eng": "The Dutch settled in South Africa."}, {"viet": "Cuộc bầu cử là một cuộc đấu tranh ba bên giữa những người thuộc đảng Bảo thủ, Công đảng và đảng Dân chủ xã hội tự do.", "eng": "The election was a three-cornered fight between Conservatives, Labour and SLD."}, {"viet": "Nguyên âm/I/và/u/tiếng Anh thì đóng.", "eng": "The English vowels/I/and/u/are close."}, {"viet": "Những người chấm thi đã đánh trượt một nửa số thí sinh.", "eng": "The examiners failed half the candidates."}, {"viet": "Gương mặt đó chuyển thành mặt một con quỷ cười nhe răng lạnh lùng.", "eng": "The face changing to a demon's face with a fixed glassy grin."}, {"viet": "Một khu sang trọng bậc nhất.", "eng": "The fashionable quarter par excellence."}, {"viet": "Công ty đó có một tài sản quan trọng đó chính là ông giám đốc nghiên cứu.", "eng": "The film has an important asset in the person of the director of research."}, {"viet": "Củi được chặt ra và bó lại với nhau.", "eng": "The firewood was cut and bundled together."}, {"viet": "Cuộc gặp gỡ đầu tiên giữa thuyền trưởng Cook và những thổ dân của châu Úc.", "eng": "The first meeting between Captain Cook and the natives of Australia."}, {"viet": "Những bông hoa sẽ héo khô nếu anh không cắm chúng vào nước.", "eng": "The flowers will wither if you don't put them in water."}, {"viet": "Đồng phrăng phải được tăng giá.", "eng": "The franc is to be revalued."}, {"viet": "Toán cướp sống ở nước ngoài, ngoài phạm vi quyền hạn của cảnh sát Anh.", "eng": "The gang live abroad, beyond reach of the British police."}, {"viet": "Cô gái người Đức đã vượt thành tích cao nhất của mình lần thi đấu trước ở cự ly 100 mét.", "eng": "The German girl improved on her previous best performance in the 100 metres."}, {"viet": "Ban điều hành của nhà trường quan tâm đến vấn đề kỷ luật.", "eng": "The Governing Body of the school is concerned about discipline."}, {"viet": "Chính phủ đã thành lập một tổ công tác để nghiên cứu vấn đề lạm dụng ma tuý.", "eng": "The government has set up a working party to look into the problem of drug abuse."}, {"viet": "Chính quyền bị buộc tội đã bóp méo có hệ thống vụ tố tụng của những người phản kháng.", "eng": "The Government were accused of having systematically distorted the protesters'case."}, {"viet": "Sự tham chiếu một nơi theo ô vuông trên bản đồ.", "eng": "The grid reference of a place on a map."}, {"viet": "Người hướng dẫn tập trung khách du lịch và dẫn họ trở lại xe.", "eng": "The guide rounded up the tourists and led them back to the coach."}, {"viet": "Trận mưa lớn đã khiến cho các ngôi nhà gần sông bị ngập lụt.", "eng": "The heavy rain caused floods in the houses by the river."}, {"viet": "Con ngựa đã ngã ở chướng ngại vật cuối cùng.", "eng": "The horse fell at the last jump."}, {"viet": "Ngôi nhà ở cuối phố đứng vào cuối hàng.", "eng": "The house at the end of the street join the end of the queue."}, {"viet": "Những đợt sóng lớn tạo ra một lỗ ở đê biển.", "eng": "The huge waves made a breach in the sea wall."}, {"viet": "Sự khiêu khích liên tục của đám đông thù nghịch.", "eng": "The incessant provocation of the hostile crowd."}, {"viet": "Bề mặt phía trong hộp được lót lụa.", "eng": "The inside of the box was lined with silk."}, {"viet": "Trên thị trường đó người Nhật bán hàng chạy hơn bất cứ nhà cạnh tranh nào khác.", "eng": "The Japanese can outsell any competitor in the market."}, {"viet": "Nhiệt độ cao nhất trong tháng 7 là 30 độ C.", "eng": "The July maximum was 30 ° C."}, {"viet": "Việc thiếu một ngôn ngữ chung đã làm cho rất khó trao đổi thông tin với nhau.", "eng": "The lack of a common language made it very difficult to intercommunicate with each other."}, {"viet": "Bộ phận giặt ủi đã đơm một cái nút mới cho bà.", "eng": "The laundry has sewed on a new button for you."}, {"viet": "Bức thư nói là từ hội đồng.", "eng": "The letter purports to be from the council."}, {"viet": "Phần lỏng của sữa, gọi là nước sữa, thì được tháo bỏ đi.", "eng": "The liquid part, or whey, is drained off."}, {"viet": "Đôi tình nhân đang nhìn nhau âu yếm.", "eng": "The lovers are making sheep's eyes at each other."}, {"viet": "Đa số đã ủng hộ lời đề nghị đó.", "eng": "The majority was in favour of the proposal."}, {"viet": "Đa số công nhân không muốn có cuộc đình công này.", "eng": "The mass of workers do not want this strike."}, {"viet": "Buổi họp đã diễn tiến thành một buổi thu thập các lời khiếu nại lặt vặt.", "eng": "The meeting evolved into a grab bag of petty complaints."}, {"viet": "Nhà máy được tu bổ lại để hoạt động được hết công suất.", "eng": "The mill was restored to full working order."}, {"viet": "Nhà vua có quyền lực nhất định để giải tán chính phủ.", "eng": "The monarch has the theoretical power to dismiss the government."}, {"viet": "Bà mẹ cuống cuồng khi nghe tin con bị lạc.", "eng": "The mother was frantic when she heard that her child was missing."}, {"viet": "Huyền thoại về tính ưu việt của chủng tộc về một xã hội không giai cấp, về khả năng hoàn thiện của con người.", "eng": "The myth of racial superiority, of a classless society of human perfectibility."}, {"viet": "Ngôi nhà thờ mới được Đức Giám mục Chester làm phép.", "eng": "The new church was consecrated by the Bishop of Chester."}, {"viet": "Nhà máy điện mới làm mất vẻ đẹp của vùng nông thôn.", "eng": "The new power station mars the beauty of the countryside."}, {"viet": "Tin ông ta vô sự đã cất một gánh nặng khỏi tâm trí bà ta.", "eng": "The news that he was safe was a weight off her mind."}, {"viet": "Ở phần phía bắc của eo biển có sương mù dầy đặc và các dòng biển rất nguy hiểm.", "eng": "The northern end of the strait has heavy fogs and dangerous currents."}, {"viet": "Sự nói dối trắng trợn làm cho mọi người khó chịu.", "eng": "The obviousness of the lie was embarrassing."}, {"viet": "Bà già không bao giờ thoát khỏi cơn đau.", "eng": "The old lady is never free from pain."}, {"viet": "Cảnh mở đầu của một cuốn phim.", "eng": "The opening scene of a film."}, {"viet": "Đội Oxford đã vượt xa đội Cambridge trong cuộc đua.", "eng": "The Oxford crew walked away from Cambridge."}, {"viet": "Diễn văn sôi nổi của lãnh tụ đảng đã thôi thúc các đảng viên hành động.", "eng": "The party leader's rousing speech fired the members into action."}, {"viet": "Vỉa hè đầy cả phân chó.", "eng": "The pavement was covered in dogs'excrement."}, {"viet": "Những cánh hoa nở ra trong ánh nắng.", "eng": "The petals of the flowers expanded in the sunshine."}, {"viet": "Phi công tìm cách liệng vòng xuống để hạ cánh an toàn.", "eng": "The pilot managed to glide down to a safe landing."}, {"viet": "Chiếc máy bay chở đầy khách đi nghỉ mát.", "eng": "The plane was full of holiday-makers."}, {"viet": "Sân chơi vang tiếng hò hét của trẻ em.", "eng": "The playground rang with children's shouts."}, {"viet": "Cảnh sát không thể tìm ra được một động cơ của vụ sát nhân.", "eng": "The police could not find a motive for the murder."}, {"viet": "Cảnh sát cho biết tên trộm là tay chuyên đột nhập vào nhà qua cửa sổ tầng trên.", "eng": "The police said the thief was a second-story."}, {"viet": "Các nước nghèo trên thế giới.", "eng": "The poorer countries of the world."}, {"viet": "Thói quen đóng cửa hiệu vào những ngày chủ nhật.", "eng": "The practice of closing shop on Sundays."}, {"viet": "Vệ sĩ của Tổng thống được trang bị vũ khí.", "eng": "The President's bodyguard are armed."}, {"viet": "Thủ tướng đang là tiêu điểm của một cuộc cãi vã chính trị về việc tài liệu của Nội Các bị lọt ra ngoài.", "eng": "The Prime Minister is at the centre of a political row over the leaked Cabinet documents."}, {"viet": "Vấn đề cơ bản là ở chỗ anh ta rất lười.", "eng": "The problem is that, au fond, he's very lazy."}, {"viet": "Sự chăm sóc nuôi dạy con trẻ theo đúng chế độ.", "eng": "The proper upbringing of young children."}, {"viet": "Chú chó con đó đã lăn lộn trong bùn.", "eng": "The puppy rolled in the mud."}, {"viet": "Lò sưởi toả ra rất nhiều hơi nóng.", "eng": "The radiator is giving out a lot of heat."}, {"viet": "Các phe phái nổi loạn đoàn kết lại ( với nhau ) để lật đổ chế độ.", "eng": "The rebel factions made common cause ( with each other ) to overthrow the regime."}, {"viet": "Tiền thuê nhà phải trả vào cuối tháng.", "eng": "The rent is due at the end of the month."}, {"viet": "Kết quả cuộc thăm dò ý kiến của chúng tôi, mặc dù phải thừa nhận là lấy từ mẫu nhỏ hơn nhưng hoàn toàn khác của họ.", "eng": "The results of our poll, though admittedly taken from a smaller sample, are quite different from theirs."}, {"viet": "Sông là nguồn của tất cả nước của chúng ta.", "eng": "The river is the source of all our water."}, {"viet": "Mái nhà dột-kiếm cái xô hứng nước nhỏ giọt xuống.", "eng": "The roof is leaking-fetch a bucket to catch the drips."}, {"viet": "Sự hết hạn của một hợp đồng điều hành.", "eng": "The run out of an executive contract."}, {"viet": "Vụ bê bối đã gây ra nhiều lời bàn tán.", "eng": "The scandal caused a lot of comment."}, {"viet": "Nhà điêu khắc đục khối đá hoa cương thành một bức tượng đẹp.", "eng": "The sculptor chiseled the lump of marble into a fine statue."}, {"viet": "Viên thượng sĩ gào lên ra lệnh cho trung đội.", "eng": "The sergeant bellowed orders at the platoon."}, {"viet": "Con tàu tròng trành trong bão tố.", "eng": "The ship lurched in the storm."}, {"viet": "Các cửa hàng đóng cửa lúc 5.30.", "eng": "The shops close at 5.30."}, {"viet": "Tình hình, theo tôi hiểu, là rất nguy hiểm.", "eng": "The situation, as I understand it, is very dangerous."}, {"viet": "Con rắn quấn mình quanh nhánh cây.", "eng": "The snake wreathed itself round the branch."}, {"viet": "Những tay thời lưu ở cơ quan uống nước chè có chanh, còn chúng tôi thì uống cà phê.", "eng": "The sophisticates in the office drink lemon tea, we have coffee."}, {"viet": "Tinh trùng vào trong cơ thể người mẹ và hợp nhất với trứng.", "eng": "The sperm enters the mother's body and unites with the egg."}, {"viet": "Tiếng rít đều đặn của cái cưa máy.", "eng": "The steady whine of a mechanical saw."}, {"viet": "Các đường phố chật ních những người.", "eng": "The streets were thronged."}, {"viet": "Đề nghị đã bị ông chủ tịch từ chối lịch sự nhưng cương quyết.", "eng": "The suggestion was politely but firmly rejected by the chairman."}, {"viet": "Người thợ may đo người tôi để cắt một bộ com-lê mới.", "eng": "The tailor took my measurements for a new suit."}, {"viet": "Thầy giáo kiểm tra sinh viên tất cả những điều trong sách.", "eng": "The teacher will examine the students on everything in their books."}, {"viet": "Bọn khủng bố tấn công đội tàu buôn.", "eng": "The terrorists attacked the merchant shipping."}, {"viet": "Trời sắp giông làm cho sữa bị chua.", "eng": "The thundery weather has turned the milk."}, {"viet": "Giờ đây thành phố đang gánh chịu hậu quả của việc đã không có biện pháp bảo vệ chống lũ lụt đầy đủ.", "eng": "The town is now counting the cost of its failure to provide adequate flood protection."}, {"viet": "Hiệp ước này đem lại một sự thúc đẩy mới cho mậu dịch.", "eng": "The treaty gave fresh impetus to trade."}, {"viet": "Hai bác sĩ đưa ra những chẩn đoán khác nhau về bệnh của tôi.", "eng": "The two doctors gave different diagnoses of my disease."}, {"viet": "Quyết định không công bằng và hấp tấp của toà án đã biến vụ xét xử này thành một trò hề.", "eng": "The unfair and hasty decision of the court made a mockery of the trial."}, {"viet": "Chiếc lọ đã bị đánh vỡ do bất cẩn.", "eng": "The vase was broken through carelessness."}, {"viet": "Người hầu bàn đã có một chỗ nhầm lẫn trong hoá đơn.", "eng": "The waiter made a mistake over the bill."}, {"viet": "Thời tiết đã thực sự làm hỏng các kế hoạch nghỉ ngơi của tôi.", "eng": "The weather has really fouled up my holiday plans."}, {"viet": "Vành rộng của chiếc mũ đã che mặt cho anh ta.", "eng": "The wide brim of his hat shadowed his face."}, {"viet": "Cái từ'lợn'là từ xúc phạm đối với cảnh sát.", "eng": "The word'pig'is a derogatory term for policeman."}, {"viet": "Chiếc du thuyền va phải đá và hư hỏng mũi thuyền.", "eng": "The yacht hit a rock and damaged her bows."}, {"viet": "Những cố gắng của họ để cải tiến nhà trường rất có hiệu quả.", "eng": "Their efforts to improve the school have been very effective."}, {"viet": "Mối quan hệ của họ với nhau đã tan rã và hoàn toàn chấm dứt.", "eng": "Their relationship is over and done with."}, {"viet": "Vậy thì cũng đã có ngân hàng ở Hy Lạp và La mã cổ đại phải không?", "eng": "Then there were banks in ancient Greece and Rome too?"}, {"viet": "Có một đại lí xe Rover ở Riverhead.", "eng": "There's a Rover dealership in Riverhead."}, {"viet": "Không có một chút biện bạch nào cho lối cư xử của anh.", "eng": "There's not a shadow of justification for your behaviour."}, {"viet": "Có những lời kêu gọi xử lại vụ án.", "eng": "There are calls for the case to be retried."}, {"viet": "Có nhiều phương hướng mở ra trước mắt chúng ta.", "eng": "There are several course open before us."}, {"viet": "Giữa hai giới đực cái vốn luôn luôn có một số xung khắc.", "eng": "There has always been some conflict between the sexes."}, {"viet": "Có nhiều thông tin trên bảng thông báo ở dưới lầu.", "eng": "There is a lot of information on the bulletin board downstairs."}, {"viet": "Chưa có dấu hiệu nào cho thấy tình hình suy thoái đã xuống mức thấp nhất.", "eng": "There is no sign that the recession has bottomed out yet."}, {"viet": "Có lẽ còn một ít sáp ở trong cốp xe.", "eng": "There should be some wax in the trunk."}, {"viet": "Có tiếng hoan hô từ các hàng ghế của Công đảng.", "eng": "There was cheering from the Labour benches."}, {"viet": "Giấy vung vãi khắp sàn đầy giương.", "eng": "There were papers strewn an over the strewn on the bed."}, {"viet": "Gạch lát men này là loại cao cấp nhất trong kiểu trang trí nhà bếp hiện đại.", "eng": "These ceramic tiles are the ultimate in modern kitchen design."}, {"viet": "Các bệnh nhân này được bác sĩ Nam chăm sóc.", "eng": "These patients are under the charge of Dr Nam."}, {"viet": "Họ luôn luôn bất hoà với nhau.", "eng": "They're constantly odds with each other."}, {"viet": "Họ tố cáo anh ta đùa bỡn với một vấn đề nghiêm túc.", "eng": "They accuse him of dallying with a serious problem."}, {"viet": "Chúng là ngân hàng Trung Quốc, ngân hàng Nông nghiệp Trung Quốc và ngân hàng Xây dựng Nhân dân Trung Quốc trên toàn quốc.", "eng": "They are the Bank of China, the Agricultural Bank of China and the People's Construction Bank of China."}, {"viet": "Họ không thể học chỉ bằng cách xem.", "eng": "They can't learn just by watching."}, {"viet": "Chẳng hạn như chúng không cho ta nhìn thấy các tuyến.", "eng": "They do not, for instance, show the glands."}, {"viet": "Họ đặt tên cho đứa con đầu lòng của họ là Roland.", "eng": "They gave the name Roland to their first child."}, {"viet": "Họ đã giải quyết cuộc tranh chấp giữa họ với nhau.", "eng": "They have settled the dispute between them."}, {"viet": "Họ đã làm một bữa cơm chiều huyên náo.", "eng": "They made a great to-do over the dinner."}, {"viet": "Họ dựng trại trên đồng hoang qua đêm.", "eng": "They pitched camp on the moor for the night."}, {"viet": "Họ ngồi đó liếc nhìn nhau say đắm.", "eng": "They sat there making goo-goo eyes at each other."}, {"viet": "Họ đi dọc xuống con đường nhỏ trong vườn.", "eng": "They strolled down the garden path."}, {"viet": "Họ đi vào quán ăn để uống cà phê và ăn tráng miệng.", "eng": "They went into the café for coffee and dessert."}, {"viet": "Họ mong muốn nơi quê nhà ở Châu âu.", "eng": "They were pining for their homeland back from Europe."}, {"viet": "Từ sau những vụ náo loạn tuần trước, tình hình đã trở lại yên tĩnh.", "eng": "Things have simmered down since the riots last week."}, {"viet": "Chiếc xe này thực sự xứng đáng với danh tiếng khi chạy trên đất gồ ghề.", "eng": "This car really comes into its own on rough ground."}, {"viet": "Món này thật ngon nhưng chuẩn bị khá phiền phức.", "eng": "This dish is delicious but rather a trouble to prepare."}, {"viet": "Thông tin này tuyệt mật.", "eng": "This information is strictly confidential."}, {"viet": "Đây là kiểu được ưa chuộng nhất trong toàn bộ loạt hàng của chúng tôi.", "eng": "This is the most popular model in our whole range."}, {"viet": "Việc này phải được giải quyết ngay.", "eng": "This matter must be dealt with at once."}, {"viet": "Bản nhạc này được soạn cho piano.", "eng": "This piece of music was composed for piano."}, {"viet": "Điều này hẳn là rõ ràng ngay cả đối với một đầu óc kém thông minh nhất.", "eng": "This should be clear even to the meanest intelligence."}, {"viet": "Chiến thắng này là một sự kiện quan trọng trong lịch sử nước ta.", "eng": "This victory was a milestone in our country's history."}, {"viet": "Hàng ngàn công nhân đã được kết nạp làm đảng viên Công đoàn.", "eng": "Thousand of workers who are just card-carrying union members."}, {"viet": "Tom quét dọn chiếc cốc bị vỡ mà không một lời mắng mỏ con trai mình.", "eng": "Tom swept up the broken glass without a word of reproof to his son."}, {"viet": "Thật không may, tôi đến đây hoàn toàn chỉ vì công việc.", "eng": "Unfortunately, my visit here is strictly for business."}, {"viet": "Cái anh nhìn thấy có phải là thật không hay chỉ là một bóng ma?", "eng": "Was it something substantial that you saw, or was it a ghost?"}, {"viet": "Chúng ta sẽ có một phòng có buồng tắm và một phòng không có.", "eng": "We'll have one room with a bathroom and one room without."}, {"viet": "Chúng tôi đã phải hoãn ngày cưới của chúng tôi lại tới tháng Chín.", "eng": "We're had to put our wedding off until September."}, {"viet": "Chúng tôi là bạn thân của nhau đã lâu nên tôi biết anh rất rõ.", "eng": "We've been friends so long I know you through and through."}, {"viet": "Chúng tôi nhận thẻ tín dụng nhưng tiền mặt thì tốt hơn.", "eng": "We accept credit cards, but cash is preferable."}, {"viet": "Chúng tôi sẽ ở đây một đêm và sẽ trả phòng lúc 8 giờ sáng mai.", "eng": "We are going to stay here for one night and we will check out at eight tomorrow morning."}, {"viet": "Chúng ta tin rằng chúng ta có thể có lý do khi nói rằng đây là một ngày rất tự hào đối với chúng ta chuyển vào các văn phòng lộng lẫy này.", "eng": "We believe that we can say with justification that this is a very proud day for us-moving into these magnificent offices."}, {"viet": "Chúng ta có thể hợp nhất hai cơ sở kinh doanh nhỏ của chúng ta thành một doanh nghiệp lớn hơn.", "eng": "We can merge our two small businesses together into one larger one."}, {"viet": "Chúng tôi vượt sông trên một chiếc thuyền.", "eng": "We crossed the river in a boat."}, {"viet": "Chúng tôi thích những bữa ăn giản dị ở nhà khách.", "eng": "We enjoyed the homely meals at the guest house."}, {"viet": "Chúng tôi đã có một cuộc họp thông báo đặc biệt về những công việc ở phía trước.", "eng": "We had a special briefing on what lies ahead."}, {"viet": "Chúng tôi đã gửi đến quý vị các bảng báo giá của chúng tôi, các bảng này chỉ có giá trị trong một tháng mà thôi.", "eng": "We have already sent you our quotations, which are open for one month only."}, {"viet": "Chúng tôi phải chịu đựng tính tình thay đổi của thầy giáo.", "eng": "We have to put up with our teacher's variable moods."}, {"viet": "Chúng tôi đã bỏ lỡ mất cơ hội trốn thoát cuối cùng.", "eng": "We let the last change of escape slip through our fingers."}, {"viet": "Chúng tôi phải thu xếp thời gian và địa điểm thuận lợi cho cuộc họp.", "eng": "We must arrange a convenient time and place for the meeting."}, {"viet": "Chúng tôi cần tiền đặt cọc cho chiếc xe.", "eng": "We need a deposit for the car."}, {"viet": "Chúng tôi đã thử cái phát minh của anh một cách rất cẩn thận và tôi hết sức lấy làm tiếc nói với anh rằng nó đã thất bại thảm hại.", "eng": "We put your invention through the acid test, and I am extremely sorry to tell you it failed miserably."}, {"viet": "Chúng ta sẽ phải thúc ép họ có quyết định nhanh chóng.", "eng": "We shall have to push them for a quick decision."}, {"viet": "Kế đó, chúng ta đặt chữ B. C sau con số chỉ năm.", "eng": "We then put B. C after the number."}, {"viet": "Chúng tôi đi bơi ở biển.", "eng": "We went for a swim in the sea."}, {"viet": "Mùa đông vừa qua, những trận bão tuyết làm cho chúng tôi không ra khỏi nhà được trong ba ngày.", "eng": "We were snowed in for three days last winter by the blizzards."}, {"viet": "Nền móng yếu khiến ngôi nhà bị lún.", "eng": "Weak foundations caused the house to subside."}, {"viet": "À, tôi muốn cho bà biết rằng thẻ tín dụng của bà bị bỏ quên ở quấy của chúng tôi.", "eng": "Well, I want to tell you that your credit card has been left on our counter."}, {"viet": "Các con của cô ta bú mẹ hay nuôi bằng bình sữa?", "eng": "Were her children breast-fed or bottle-fed?"}, {"viet": "Thật tuyệt vời khi được đắm mình trong sự yên bình và tĩnh lặng của miền quê!", "eng": "What a treat to get into the peace and quiet of the country!"}, {"viet": "Bạn là thành viên của câu lạc bộ nào?", "eng": "What club do you belong to?"}, {"viet": "Tôi sẽ mặc bộ quần áo nào để đi dự liên hoan đây?", "eng": "What dress shall I put on for the party?"}, {"viet": "Chủ đề cơ bản của vở kịch là gì?", "eng": "What is the essential theme of the play?"}, {"viet": "Đây là loại cá gì vậy?", "eng": "What kind of fish is this?"}, {"viet": "Mục đích đến thăm của ông là gì?", "eng": "What's your purpose of your visit?"}, {"viet": "Điều anh nói với tôi đã xác nhận những lo sợ tồi tệ nhất của tôi.", "eng": "What you've told me confirms my worst fears."}, {"viet": "Khi nó biết được ai đã làm hỏng rađiô của nó, cậu chắc chắn sẽ bị phạt!", "eng": "When he finds out who broke his radio, you'll really cop it!"}, {"viet": "Khi nói đến ca hát cô ấy thực sự vượt trội.", "eng": "When it comes to singing, she really excels."}, {"viet": "Khi chiếc bánh xe long ra tôi nghĩ mình kể như đã tới số rồi!", "eng": "When the wheel came off the car I thought my number was up!"}, {"viet": "Mỗi khi các thầy tu không ưa một người nào đó được bầu vào cơ quan quyền lực, họ sẽ làm cho nhiệm kỳ của người đó ngắn đi bằng cách không đặt thêm tháng ngoại lệ trong năm dù rằng nó rất cần thiết.", "eng": "Whenever the priests did not like someone who was elected to an office, they would make his term short by not putting an extra month in the year even if it was needed."}, {"viet": "Cho dù còn khó mà kết luận nhưng một vài biến đổi không khỏi làm người ta ngạc nhiên.", "eng": "Whereas it is dangerous to draw conclusions, one cannot avoid being struck with some changes."}, {"viet": "Which proves I'm right'là không rõ nghĩa trừ khi chúng ta biết nhóm từ đứng trước'which'.", "eng": "Which proves I'm right'is not clear unless we know the antecedent of'which'."}, {"viet": "Ai có thể gọi điện thoại cho chúng ta vào giờ khuya khoắt thế này nhỉ?", "eng": "Who can be ringing us at this late hour?"}, {"viet": "Việc gì phải viết thư Ngày mai chúng ta sẽ gặp anh ấy mà.", "eng": "Why bother to write We'll see him tomorrow."}, {"viet": "Tại sao không thử phát triển truyện ngắn của cậu thành một thiên tiểu thuyết?", "eng": "Why not try to expand your story into a novel?"}, {"viet": "Anh làm ơn giúp tôi tháo những cái rèm này xuống được không?", "eng": "Will you help me take the curtains down?"}, {"viet": "Với một cử động đột ngột, đơn độc, nhắc lên, hạ xuống, v. v. của bàn tay.", "eng": "With a sudden, single, upward, downward, etc motion of the hand."}, {"viet": "Làm việc giữa những người nghèo, người đau ốm, người có tuổi, v. v.", "eng": "Work among the poor, the sick, the elderly, etc."}, {"viet": "Bà có muốn để tôi ẵm đứa bé hộ một lát không?", "eng": "Would you like me to give the baby a carry?"}, {"viet": "Anh kiểm lại giùm tôi những số liệu này?", "eng": "Would you please check these figures for me?"}, {"viet": "Phải, chúng tôi đã nghỉ cả buổi sáng dưới những cây cao.", "eng": "Yeah, we spent the whole morning under the tall trees."}, {"viet": "Vâng, buồn cười thật đấy, nhưng tôi không đùa nữa, anh ta thật sự nói gì chứ?", "eng": "Yes, that's very funny. but joking apart what did he really say?"}, {"viet": "Anh sẽ thấy ông ta ít có tính hệ thống trong phương pháp làm việc.", "eng": "You'll find little system in his method of work."}, {"viet": "Mua cái xe hơi cũ han gỉ này, cậu chỉ tổ chuốc cái khó vào thân.", "eng": "You're letting yourself in for trouble by buying that rusty old car."}, {"viet": "Bạn đã có chồng con rồi.", "eng": "You already have a husband and child."}, {"viet": "Đâu phải là chuyện đùa mà anh ra đường với cái mũ như vậy!", "eng": "You can't in all seriousness go out in a hat like that!"}, {"viet": "Anh có thể nghe thấy tiếng gió rền rĩ trong ống khói.", "eng": "You can hear the wind wailing in the chimney."}, {"viet": "Tốt hơn ông bà nên đi xe taxi.", "eng": "You'd better take a taxi."}, {"viet": "Anh chẳng thông cảm gì với những đau khổ của người khác.", "eng": "You have no feeling for the sufferings of others."}, {"viet": "Trông anh có vẻ hơi xanh-anh cảm thấy bình thường chứ?", "eng": "You look a bit pallid-do you feel all right?"}, {"viet": "Anh phải kiểm soát việc chi tiêu lại.", "eng": "You must get your spending under control."}, {"viet": "Anh không phải lo hết tiền-tôi sẽ luôn luôn bảo đảm cho anh đầy đủ.", "eng": "You needn't worry about running out of money-I'll always see you right."}, {"viet": "Lẽ ra mẹ nên nói cho con biết sớm hơn chứ.", "eng": "You should have told me earlier."}, {"viet": "Gần đây tôi đã nghĩ tới bạn.", "eng": "You've been on my mind recently."}, {"viet": "Anh có thời gian gọi điện thoại cho nó bây giờ, được không?", "eng": "You wouldn't have the time to phone him now, would you?"}, {"viet": "Bản năng người mẹ của bà còn mạnh hơn bà tưởng.", "eng": "Your maternal instincts go deeper than you think."}]