[{"viet": "Ngày 1 tháng chạp dương lịch đã được chính thức chọn là ngày bầu cử.", "eng": "1 December has been nominated as the day of the election."}, {"viet": "Một hải cảng buôn bán sầm uất, nơi mà đủ loại chủng tộc đều hoà đồng với nhau.", "eng": "A busy trading port, where people of all races intermingle with each other."}, {"viet": "Một thành phố bị rơi vào tình trạng đổ nát do chiến tranh.", "eng": "A city reduced to a state of ruin by war."}, {"viet": "Một quốc gia trước đây dưới quyền cai trị của Pháp.", "eng": "A country formerly under French rule."}, {"viet": "Một nha sĩ thường phải trám răng.", "eng": "A dentist often has to fill teeth."}, {"viet": "Một gương mặt biểu lộ cả loạt cảm xúc từ giận dữ tới hài lòng thoải mái.", "eng": "A face that expressed a gamut of emotions, from rage to peaceful contentment."}, {"viet": "Một ngọn lửa cháy lách tách trong lò sưởi.", "eng": "A fire was burning merrily in the grate."}, {"viet": "Một khoảng trống trong rừng có ánh sáng mặt trời xuyên qua.", "eng": "A glade that was transfused with sunlight."}, {"viet": "Một người khách đi vào quán rượu, một nhân viên quán rượu tiến đến chỗ ông ấy.", "eng": "A guest enters the bar and a barman comes up to him."}, {"viet": "Một ly rượu làm ấm bụng trong một ngày lạnh lẽo.", "eng": "A hot drink warms on a cold day."}, {"viet": "Một khóa ngôn ngữ dựa trên những bài đối thoại, đàm thoại không viết ra giấy.", "eng": "A language course based on natural unscripted dialogues, conversations, etc."}, {"viet": "Một chút trì hoãn sẽ cho người ta có thời gian chuẩn bị.", "eng": "A little delay will give one time to prepare."}, {"viet": "Đàn ông luôn luôn được giới thiệu với phụ nữ.", "eng": "A man is always introduced to a woman."}, {"viet": "Một chợ mô hình đường sắt sẽ được tổ chức vào ngày thứ Sáu.", "eng": "A model railway mart will be held on Friday."}, {"viet": "Biểu thuế mới sẽ có hiệu lực từ tháng năm tới.", "eng": "A new system of taxation will be put into effect next May."}, {"viet": "Một bữa tiệc để đánh dấu việc đưa ra trở lại lời kêu gọi đó.", "eng": "A party to mark the relaunch of the appeal."}, {"viet": "Một cuộc thăm viếng nơi sinh của Shakespeare.", "eng": "A pilgrimage to Shakespeare's birthplace."}, {"viet": "Một xã hội tàn nhẫn, xâu xé lẫn nhau trong đó sự chất phác và lịch sự có thể tỏ ra tai hại.", "eng": "A predatory, insensate society in which innocence and decency can prove fatal."}, {"viet": "Một động tác nhanh và khéo léo của tài xế đã ngăn chặn được một tai nạn.", "eng": "A rapid manoeuvre by the driver prevented an accident."}, {"viet": "Một thời biểu đều đặn trong một thời gian về việc sửa chữa đường cao tốc.", "eng": "A rolling schedule of motorway repairs."}, {"viet": "Một óc hài hước là tinh túy của dân Anh.", "eng": "A sense of humour that is quintessentially British."}, {"viet": "Một lớp váng đóng trên sơn trong cái hộp.", "eng": "A skin forming on the paint in the pot."}, {"viet": "Một loài từ lâu đã được xem là bị tuyệt chủng.", "eng": "A species long thought to be extinct."}, {"viet": "Một ngành công nghiệp phụ cung cấp phụ tùng cho các máy vi tính dùng tại nhà.", "eng": "A subindustry supplying accessories for home computers."}, {"viet": "Người ta đã sắp xếp để đi xem hát buổi tối.", "eng": "A theatre evening has been arranged."}, {"viet": "Một vùng đất rộng lớn và gần như là còn lại cuối cùng cho các nhà thám hiểm trên quả đất.", "eng": "A vast and virtually final terra incognita left to terrestrial explorers."}, {"viet": "Một cú móc dữ dội không trúng.", "eng": "A wild swing which failed to connect."}, {"viet": "Theo quy định của CAAC, giờ khởi hành trên vé của ông chỉ giờ đóng cửa máy bay, chứ không phải là giờ cất cánh.", "eng": "According to the regulation of CAAC, the departure time on your ticket refers to the time for closing cabin doors, but not for taking off."}, {"viet": "Mở rộng phạm vi trách nhiệm về pháp lý.", "eng": "Advance the frontiers of legal liability."}, {"viet": "Sau đứa con thứ tư của cô ta, cô ta quyết định đi triệt sản.", "eng": "After her fourth child she decided to be sterilized."}, {"viet": "Sau tai nạn xe, cô ấy dường như bị suy sụp tinh thần.", "eng": "After the car accident, she seemed to go to pieces."}, {"viet": "Áp suất không khí đẩy nước qua ống.", "eng": "Air pressure forces the water through the pipe."}, {"viet": "Tất cả các phi công đều có trách nhiệm về sự an toàn của hành khách.", "eng": "All pilots are responsible for their passengers'safety."}, {"viet": "Tất cả những câu hỏi này bắt đầu làm mệt mỏi lòng kiên nhẫn của tôi.", "eng": "All these questions are beginning to tax my patience."}, {"viet": "Lại một lần nữa Amanda từ trường đại học về nhà.", "eng": "Amanda is home from college once again."}, {"viet": "Một sự bộc lộ đáng lo ngại về sự bất tài, thành kiến, lòng tham.", "eng": "An appalling displays of incompetence, prejudice, greed."}, {"viet": "Một mẫu mã đẹp nhất của nghề thủ công Anh.", "eng": "An example of British craftsmanship at its finest."}, {"viet": "Một sự hiểu biết sâu rộng về các tôn giáo ở châu Phi.", "eng": "An intimate knowledge of African religions."}, {"viet": "Có một giọng điệu ngầm không bằng lòng qua lời khen của ông ta.", "eng": "An undersong of discontent runs through his praise."}, {"viet": "Và xin cảm phiền ông mở túi xách của mình ra?", "eng": "And would you mind opening yo bags, please?"}, {"viet": "Người nào có một chút thông minh chắc cũng đã nhận thức được điều đó!", "eng": "Anyone with even a modicum of intelligence would have realized that!"}, {"viet": "Trong phần việc của anh có vấn đề gì không?", "eng": "Are there any problem at your end?"}, {"viet": "Bạn dạy công nghệ thông tin có giỏi không?", "eng": "Are you good at teaching information to other people?"}, {"viet": "Nội qui quân đội qui định súng phải mang như thế nào.", "eng": "Army regulations prescribe how rifles must be carried."}, {"viet": "Thường thường về trường hợp thời trang gợi lại quá khứ, vấn đề chính xác về mặt lịch sử có phần lạc lõng.", "eng": "As is often the case in retro fashion, historical accuracy is somewhat beside the point."}, {"viet": "Đặt một số câu hỏi dồn dập.", "eng": "Ask several questions in rapid succession."}, {"viet": "Đầu tiên ông ta bảo em phải nằm xuống.", "eng": "At the beginning I was told I must lie on down."}, {"viet": "Si giáng là một bán cung thấp hơn nốt Si.", "eng": "B flat is a semitone below the note B."}, {"viet": "Bị buộc tội lái xe khi đang say rượu.", "eng": "Be charged with driving under the influence."}, {"viet": "Đánh bột và sữa với nhau.", "eng": "Beat the flour and milk together."}, {"viet": "Dưới vẻ lãnh đạm bề ngoài vậy chứ anh ta cũng lo lắng và nôn nóng như toàn bộ chúng tôi.", "eng": "Beneath his apparent nonchalance he is as nervous and excited as the rest of us."}, {"viet": "Tối qua Bob và Liz đã mời chúng tôi ăn cơm.", "eng": "Bob and Liz entertained us to dinner last night."}, {"viet": "Về lĩnh vực này nước Anh đang tụt lại sau các nước cạnh tranh.", "eng": "Britain is increasingly dropping behind her competitors in this field."}, {"viet": "Nhóm ông gồm bao nhiêu người?", "eng": "But how many in your party?"}, {"viet": "Nhưng có đến mấy thư viện công cộng ở thành phố lớn này.", "eng": "But there are quite a few public libraries in this big city."}, {"viet": "Tự anh làm hỏng mục đích của mình do không chịu cố gắng làm việc.", "eng": "By not working hard enough you defeat your own purpose."}, {"viet": "Cho xin một điếu thuốc được không?", "eng": "Can I bum a cigarette off you?"}, {"viet": "Chúng ta có thể ngồi gọn trong taxi không?", "eng": "Can we all fit in the taxi?"}, {"viet": "Cậu có thể cho mình mượn một bảng Anh được không?", "eng": "Can you lend me a pound?"}, {"viet": "Anh có thể phân biệt được Tom với người em sinh đôi của nó không?", "eng": "Can you tell Tom from his twin brother?"}, {"viet": "Ăn mừng sự đạt mục đích của ai.", "eng": "Celebrate the achievement of one's aims."}, {"viet": "Bọn trẻ diện bộ quần áo đẹp nhất của chúng.", "eng": "Children togged out in their Sunday best."}, {"viet": "Hợp tác với bạn bè của mình trong việc gây vốn.", "eng": "Co-operate with one's friends in raising money."}, {"viet": "Các công ty phải có khả năng cạnh tranh trong kinh doanh.", "eng": "Companies must be able to compete in the market-place."}, {"viet": "Âm mưu với những người khác chống lại lãnh tụ của mình.", "eng": "Conspire with others against one's leader."}, {"viet": "Ngày mai anh nghỉ làm sớm được không?", "eng": "Could you get off work early tomorrow?"}, {"viet": "Các quan chức tòa án ăn mặc toàn bộ quần áo trang trọng của mình.", "eng": "Court officials dressed in all their finery."}, {"viet": "Làm hỏng hàng hóa thì bạn buộc phải mua chúng.", "eng": "Damaging the goods puts you under an obligation to buy them."}, {"viet": "Những cuộc biểu tình do hậu quả của vụ ám sát nhà lãnh đạo công đoàn.", "eng": "Demonstrations following the murder of the union leader."}, {"viet": "Ông ấy có được chết trong ân sủng của Thiên Chúa không?", "eng": "Did he die in a state of grace?"}, {"viet": "Anh có thử cái máy bên cạnh máy bán nước giải khát không?", "eng": "Did you try the one by soft drink machine?"}, {"viet": "Nhớ lúc nào ghé thăm chúng tôi nhé.", "eng": "Do come round and see us sometimes."}, {"viet": "Cô có nhận chi phiếu du lịch không?", "eng": "Do you accept traveler's checks?"}, {"viet": "Ông có chỗ đậu xe không?", "eng": "Do you have a parking lot?"}, {"viet": "Anh biết chỗ nào tôi có thể mua được máy đánh chữ cũ không?", "eng": "Do you know anywhere where I can buy a second-hand typewriter?"}, {"viet": "Bạn có thường đọc các bài xã luận không?", "eng": "Do you often read the editorials?"}, {"viet": "Bạn có nghĩ là sử dụng điện thoại di động trên xe lửa là bất lịch sự không?", "eng": "Do you think that using a cellular phone on the train is rude?"}, {"viet": "Tuyết rơi nhiều ở Anh phải không?", "eng": "Does it snow a lot in England?"}, {"viet": "Đừng có đầu óc thô thiển như thế-anh biết tôi định nói gì chứ!", "eng": "Don't be so literal-minded-you know what I meant!"}, {"viet": "Anh đừng có sao lãng về việc làm bài tập của mình.", "eng": "Don't get slack about doing your exercises."}, {"viet": "Đừng đặt quá nhiều tin tưởng vào lời khuyên của ông ta.", "eng": "Don't place too much reliance on his advice."}, {"viet": "Đừng cố đoán trước kết quả.", "eng": "Don't try to second-guess the outcome."}, {"viet": "Gỗ vụn bị nước thủy triều cuốn trôi.", "eng": "Driftwood washed up by the tides."}, {"viet": "Những chiếc phi cơ đầu tiên là các cấu trúc yếu ớt làm bằng gỗ và keo dán.", "eng": "Early aircraft were insubstantial constructions of wood and glue."}, {"viet": "Tiếng Anh được thông hiểu trên toàn thế giới trong khi đó tiếng Thổ Nhĩ Kỳ chỉ có một số ít người nói bên ngoài nước Thổ Nhĩ Kỳ.", "eng": "English is understood all over the world while Turkish is spoken by only a few people outside Turkey itself."}, {"viet": "Con cái thì nên chăm sóc mẹ mình chứ.", "eng": "Every boy should take care of his mother."}, {"viet": "Xin lỗi, tôi có thể xin một cái túi đựng thức ăn thừa không?", "eng": "Excuse me, can I have a doggy bag?"}, {"viet": "Cảm thấy vui sướng khi thấy mình đã thành đạt.", "eng": "Exulting to find that one has succeeded."}, {"viet": "Cứ tự nhiên dùng chúng bất cứ lúc nào cháu thích.", "eng": "Feel free to use them whenever you like."}, {"viet": "Lính cứu hỏa phải liều mạng hàng ngày trong công việc của mình.", "eng": "Fire-fighters risk life and limb every day in their work."}, {"viet": "Hoa rũ cánh xuống vì thiếu nước.", "eng": "Flowers drooping for lack of water."}, {"viet": "Đối với Tâm chuyện mất việc không phải là chuyện đùa.", "eng": "For Tam to loose his job is nothing to joke about."}, {"viet": "Từ phía cửa ra vào vọng lên những âm thanh nỉ non của một cây đàn ghita.", "eng": "From a doorway came the plangent sound of a guitar."}, {"viet": "Giơnevơ đã trở thành nơi diễn ra nhiều cuộc họp của các lãnh tụ trên thế giới.", "eng": "Geneva has become the stage for many meetings of world leaders."}, {"viet": "Không cưỡng lại được nỗi khát khao bất chợt muốn đi du lịch.", "eng": "Give in to a sudden urge to travel."}, {"viet": "Uống sữa vừa phải thôi; tụi tao đứa nào cũng muốn uống một chút đó.", "eng": "Go easy on the milk; we all want some."}, {"viet": "Việc nhập cảng ngũ cốc được kiểm soát bằng hạn ngạch chặt chẽ.", "eng": "Grain imports are controlled by strict quotas."}, {"viet": "Chúc tất cả quý độc giả một lễ Giáng Sinh hạnh phúc!", "eng": "Happy Christmas to all our readers!"}, {"viet": "Anh có ý kiến gì về giá trị của nó không?", "eng": "Have you any idea of its value?"}, {"viet": "Anh có boa cho người hầu bàn chưa?", "eng": "Have you given the waiter a tip?"}, {"viet": "Vì mồ côi cả cha lẫn mẹ từ lúc nhỏ nên anh ta lúc nào cũng cảm thấy mình bị thua thiệt.", "eng": "Having lost both his parents when he was a child he always felt that the dice were loaded against him."}, {"viet": "Ông ta bao giờ cũng đối địch với những ý tưởng mới.", "eng": "He's always antagonistic toward new ideas."}, {"viet": "Ông ấy triệu tập cuộc họp của hội đồng để bàn về chiến dịch.", "eng": "He's convened the council to discuss the campaign."}, {"viet": "Nó đã nói dối mà vớ được một công việc thật sự là béo bở.", "eng": "He's lied his way into a really plum job."}, {"viet": "Anh ta là một con người kì lạ, không ai biết anh ta sẽ làm gì tiếp theo.", "eng": "He's such a strange person, there's no knowing what he'll do next."}, {"viet": "Anh ấy mặc kệ cho trí tưởng tượng của anh ta ngao du tự do.", "eng": "He allows his imagination full play."}, {"viet": "Anh ta sợ hãi đến nỗi anh ta bắt đầu thở gấp.", "eng": "He became so frightened that he began to hyperventilate."}, {"viet": "Anh ta tới phải chạy dọc theo sân ga ngay khi xe lửa vừa chuyển bánh.", "eng": "He came running along the platform just as the train was leaving."}, {"viet": "Anh ta ngã quỵ ở ngoài đường và chết trên đường đến bệnh viện.", "eng": "He collapsed in the street and died on the way to hospital."}, {"viet": "Anh ấy quyết định làm ăn riêng và một mình bắt đầu công việc.", "eng": "He decided to go it alone and start his own business."}, {"viet": "Những công việc phụ đã mang lại cho anh ta lợi tức 30 bảng Anh mỗi tuần.", "eng": "He does odd jobs that bring him in about £ 30 a week."}, {"viet": "Anh ta đổi cái áo pun xanh để lấy cái màu đỏ.", "eng": "He exchanged the blue jumper for a red one."}, {"viet": "Anh ta thấy khó mà nói được điều mình cảm nhận.", "eng": "He finds it hard to say what he feels."}, {"viet": "Ông ấy chẳng chịu cho chúng tôi biết lý do thực, chỉ nói nước đôi theo cái kiểu của mấy tay chính khách thôi.", "eng": "He gave us no real reasons, just the usual politician's double-talk."}, {"viet": "Anh ấy suýt nữa thi trượt nhưng cô em, ngược lại, làm bài rất tốt.", "eng": "He had almost failed the exam, but his sister, by contrast, had done very well."}, {"viet": "Anh ta tỏ ra hằn học với tôi.", "eng": "He has a grudge against me."}, {"viet": "Anh ấy bảo người ta hớt tóc của anh ấy ngắn.", "eng": "He has had his hair cut short."}, {"viet": "Anh ấy không thích trường học mới của mình.", "eng": "He hasn't taken to his new school."}, {"viet": "Anh ta nhận thấy, không ai hơn anh ta.", "eng": "He is aware, none better than he."}, {"viet": "Anh ấy vẫn còn run chân sau trận ốm của anh ấy.", "eng": "He is still a bit wobbly on his legs after his illness."}, {"viet": "Ông ấy mở hai tài khoản tại ngân hàng.", "eng": "He kept two bank accounts open."}, {"viet": "Ông ta sống hưu trí ở Cornwall.", "eng": "He lives in retirement in Cornwall."}, {"viet": "Ông ta ủy quyền cho vợ của ông ta.", "eng": "He made his wife his proxy."}, {"viet": "Ông ấy cần một lối thoát cho cơn giận bị dồn nén của ông.", "eng": "He needs an outlet for all that pent-up anger."}, {"viet": "Ông ta ngừng một chút, và sau đó tiếp tục bài diễn văn của mình.", "eng": "He paused for a moment, and then continued his speech."}, {"viet": "Cậu ấy hứa sẽ có mặt ở đây lúc bốn giờ nhưng mãi sáu giờ mới thấy đến.", "eng": "He promised to be here at four o'clock but didn't appear until six."}, {"viet": "Hắn ta đọc nhanh danh sách.", "eng": "He rattled through the list of names."}, {"viet": "Hắn căm tức cái cách bà ta đối xử trịch thượng với hắn.", "eng": "He resented the way she patronized him."}, {"viet": "Hắn là một thằng nhóc con ngu xuẩn!", "eng": "He's a stupid little tit!"}, {"viet": "Anh ta tự do lấy bất cứ người nào anh ta chọn.", "eng": "He's free to marry whomsoever he chooses."}, {"viet": "Ông ta không phải là một tay chơi giỏi như vợ mình.", "eng": "He's not so good player as his wife."}, {"viet": "Anh ta nói anh ta sẽ yêu cô ấy mãi mãi.", "eng": "He said he'd love her till the end of time."}, {"viet": "Ông ta có vẻ chắc chắn về những gì đã xảy ra.", "eng": "He seemed definite about what had happened."}, {"viet": "Anh ta rất tinh tế sành sỏi trong việc chọn rượu.", "eng": "He showed great discernment in his choice of wine."}, {"viet": "Nó bỏ thì giờ của nó để tán tỉnh những cô gái ở trong làng.", "eng": "He spent his time philandering with the girls in the village."}, {"viet": "Anh ta đứng lên ghế để tới được cái giá cao nhất.", "eng": "He stood on a chair in order to reach the top shelf."}, {"viet": "Anh ấy mặc áo có vòng ngực 42 in.", "eng": "He takes a 42 inch chest."}, {"viet": "Nó lấy một cuốn sách từ giá trên cùng xuống.", "eng": "He took a book from the top shelf."}, {"viet": "Nó cố biện bạch với tôi bằng vài lời bào chữa về việc xe buýt tới trễ.", "eng": "He tried to palm me off with some excuse about the bus being late."}, {"viet": "Nó đánh một quả vô-lê vào lưới.", "eng": "He volleyed the ball into the net."}, {"viet": "Ông ấy được chấp nhận là thành viên chính thức của hàn lâm viện.", "eng": "He was admited to full membership of the academy."}, {"viet": "Anh ta bận rộn với việc lau chùi đôi giày của mình.", "eng": "He was busily employed in cleaning his shoes."}, {"viet": "Anh ta đã mắc vào một mớ những chuyện lừa đảo và dối trá.", "eng": "He was enmeshed in a web of deceit and lies."}, {"viet": "Anh ta tỉnh ngay cơn uể oải và lao vào làm việc khi nhận ra là chỉ còn thời gian ngắn để viết xong bài báo đó.", "eng": "He was jolted out of his lethargy and into action when he realized he had only a short time to finish the article."}, {"viet": "Anh ta đã không được lưu ý đến khi họ bắt đầu chọn một người giám đốc mới.", "eng": "He was overlooked when they set about choosing a new manager."}, {"viet": "Anh ta nghèo đến nỗi phải xin tiền những người qua lại.", "eng": "He was so poor that he had to beg for money from passers-by."}, {"viet": "Nó ra tòa về tội chạy quá tốc độ.", "eng": "He was up before the magistrate for speeding."}, {"viet": "Nó đã tán tỉnh để lọt được vào trong tòa nhà.", "eng": "He wheedled his way into the building."}, {"viet": "Anh ta làm việc từ mờ sáng đến tối mịt.", "eng": "He works from dawn till dusk."}, {"viet": "Tuyết rơi đầy làm tắc nghẽn các ngả đường vào Luân Đôn.", "eng": "Heavy snow is blocking all roads into London."}, {"viet": "Ngôi nhà đẹp đẽ của bà ấy là kết quả của nhiều năm lao động vất vả.", "eng": "Her beautiful home was the result of many years of labour."}, {"viet": "Thành tích phạm tội của cô ấy đã khiến cho cô ấy không đủ tư cách phục vụ trong ban hội thẩm.", "eng": "Her criminal record disqualifies her from serving on a jury."}, {"viet": "Nét mặt nàng vẫn một vẻ lo âu thường lệ.", "eng": "Her face wore its usual harried expression."}, {"viet": "Tim cô ta đập mạnh vì hồi hộp.", "eng": "Her heart was throbbing with excitement."}, {"viet": "Cuộc đời của bà ấy kéo dài qua hầu như toàn bộ thế kỷ thứ 19.", "eng": "Her life spanned almost the whole of the 19th century."}, {"viet": "Đối thủ của cô ta rời sân quần vợt nước mắt đầm đìa.", "eng": "Her opponent left the tennis court in tears."}, {"viet": "Ông ta không thừa nhận đứa con trai của mình là người thừa kế xứng đáng.", "eng": "Her renounced his son as an unworthy heir."}, {"viet": "Thành công trong doanh nghiệp đã đem lại cho bà ta một uy tín nào đó trong xã hội.", "eng": "Her success in business had earned her a certain cachet in society."}, {"viet": "Đây là 10, 15, 16, 17, 18, 19 và 20 đô la.", "eng": "Here's ten, fifteen, sixteen, seventeen, eighteen, nineteen, and twenty."}, {"viet": "Tài năng diễn viên của anh ta được báo chí thổi phồng lên rất nhiều.", "eng": "His abilities as an actor have been greatly blown up by the popular press."}, {"viet": "Hành vi của nó làm cho bố mẹ nó hết sức đau khổ.", "eng": "His behaviour caused his parents a great deal of pain."}, {"viet": "Mục báo của ông ta được đăng trên khắp thế giới qua cơ quan phân phối trung tâm.", "eng": "His column is syndicated throughout the world."}, {"viet": "Những lời nói làm dịu đã làm cho tình thế bình tĩnh trở lại.", "eng": "His emollient words calmed the situation down."}, {"viet": "Lần xuất hiện đầu tiên trên sân khấu của anh ta là vào năm lên ba tuổi.", "eng": "His first appearance on stage was at the age of three."}, {"viet": "Những ý kiến của anh ta là quá cực đoan đối với tôi.", "eng": "His ideas are too extreme for me."}, {"viet": "Cuộc đời anh ta chỉ dành cho những thú vui xác thịt.", "eng": "His life was devoted to the pleasures of the flesh."}, {"viet": "Những tiểu thuyết của ông ấy đã được hâm mộ cách đây mười năm.", "eng": "His novels had a great vogue ten years ago."}, {"viet": "Tuần trước sự có mặt của anh ấy ở nơi làm việc thậm chí không được chú ý tới.", "eng": "His presence was not even noticed at work last week."}, {"viet": "Thị lực của ông ấy bắt đầu suy yếu một cách đáng lo ngại.", "eng": "His sight had begun to deteriorate alarmingly."}, {"viet": "Những lý thuyết của ông ta bị các nhà khoa học làm cho không ai tin nữa.", "eng": "His theories were discredited by scientists."}, {"viet": "Tác phẩm của ông ta được các nhà phê bình đánh giá cao Tôi không đánh giá thầy giáo mới cao lắm.", "eng": "His work is highly thought of by the critics I don't think much of my new teacher."}, {"viet": "Anh yêu, em lại nghe anh ngáy nữa đấy.", "eng": "Honey, I heard you snoring again."}, {"viet": "Cuộc sống dạo này ra sao?", "eng": "How are things going at the moment?"}, {"viet": "Anh ta phản ứng với tin cô ta chết như thế nào?''Anh ta rất đau buồn'.", "eng": "How did he take the news of her death?''He took it badly'."}, {"viet": "Em muốn thịt bò thế nào?", "eng": "How do you want your steak?"}, {"viet": "Bạn đi đến cơ quan hoặc trường học mất bao lâu?", "eng": "How long is your commute to work or school?"}, {"viet": "Bao nhiêu người sẽ mất việc, đó là một vấn đề chưa được giải đáp.", "eng": "How many people will lose their jobs is an open question."}, {"viet": "Chuyện này còn kéo dài bao lâu nữa?", "eng": "How much longer is this going to drag on?"}, {"viet": "Anh dịch bon voyage sang tiếng Anh như thế nào?", "eng": "How would you render bon voyage into English?"}, {"viet": "Tôi sẵn sàng đánh đổi nhiều thứ để có được cơ hội đi đến Ấn Độ.", "eng": "I'd give a lot for the chance to go to India."}, {"viet": "Tôi muốn đi với anh, chỉ có điều tôi phải ở nhà giúp mẹ tôi.", "eng": "I'd love to come with you, only I have to stay at home and help my mother."}, {"viet": "Tuần sau tôi sẽ trả lại băng nhạc cho anh.", "eng": "I'll give you back your records next week."}, {"viet": "Tôi sẽ cho người dẫn bạn đi khắp khu vực.", "eng": "I'll send someone to show you around."}, {"viet": "Tôi e rằng có điều gì khẩn cấp đã xảy ra, tôi sẽ không thể gặp anh tối nay.", "eng": "I'm afraid something urgent has come up, I won't be able to see you tonight."}, {"viet": "Tôi rất vui là chương trình nghị sự được dàn xếp xong.", "eng": "I'm glad that the agenda is about to be settled upon."}, {"viet": "Ngày nào tôi cũng đi làm muộn cho nên tôi không còn cớ để biện minh.", "eng": "I'm late for work everyday, and I'm running short of excuses."}, {"viet": "Tôi không có sở trường về các cuộc thảo luận chính trị.", "eng": "I'm out of my element in political discussions."}, {"viet": "Tôi xin lỗi, trong cửa hàng chỉ có giày đen thôi.", "eng": "I'm sorry we've only got black boots in stock."}, {"viet": "Tôi rất băn khoăn trong đầu về tương lai.", "eng": "I'm uneasy in my mind about the future."}, {"viet": "Gần đây tôi làm việc quá căng.", "eng": "I've been overdoing it lately."}, {"viet": "Tôi bị ngưa ngứa ở cổ họng-có lẽ tôi bị cảm lạnh.", "eng": "I've got this tickle in my throat-I think I may be getting a cold."}, {"viet": "Tôi chưa bao giờ xem một tòa nhà cao mọc lên.", "eng": "I've never watched a tall building going up."}, {"viet": "Tôi nói thêm rằng anh đang cần một người giúp việc.", "eng": "I add that you are in want of an assistant."}, {"viet": "Tôi gọi để báo cho các ông biết là một bức điện chuyển tiền đã được gửi cho các ông.", "eng": "I am calling to inform you that a telegraphic transfer has been made to you."}, {"viet": "Tôi viết thư này theo đề nghị của khách hàng của tôi.", "eng": "I am writing to you at the instance of my client."}, {"viet": "Tôi tin rằng bạn đang nghĩ về ông lý.", "eng": "I believe you are thinking of Mr. Lee."}, {"viet": "Tôi không thể đi dự liên hoan được''Sao, có vấn đề gì thế?'.", "eng": "I can't come to the party''Why, what's the problem?'."}, {"viet": "Tôi không thấy giữa anh ta và bố anh ta có sự giống nhau nhiều.", "eng": "I can't see much likeness between him and his father."}, {"viet": "Giờ đây tôi có khả năng sắm được một chiếc xe ô-tô mới, thực hiện những chuyến đi nghỉ ở nước ngoài và nhiều thứ mong ước khác.", "eng": "I can now afford a new car, holidays abroad and lots of other goodies."}, {"viet": "Tôi không tài nào đặt quyển tiểu thuyết này xuống được.", "eng": "I can't put this novel down."}, {"viet": "Tôi có thể nghe thấy ai đó di động ( đi đi ) ở phòng bên trên.", "eng": "I could hear someone moving ( around ) in the room above."}, {"viet": "Bây giờ tôi muốn dùng món tráng miệng.", "eng": "I'd like our dessert served now."}, {"viet": "Con đã không mời cô ấy và nếu cô ấy đến thì tất cả bọn con trai sẽ tìm cách tán tỉnh cô ấy.", "eng": "I didn't invite her and if she comes, all the guys will try to hit on her."}, {"viet": "Tôi không quan tâm tí nào tới những gì họ nghĩ.", "eng": "I don't care twopence what they think."}, {"viet": "Tôi không thích thái độ của cô ấy-cô ấy rất hằn học.", "eng": "I don't like her manner-she's very hostile."}, {"viet": "Tôi không hiểu, anh ta nói, với một vẻ hoàn toàn ngạc nhiên ( trên gương mặt ).", "eng": "I don't understand, he said, with an expression of complete surprise ( on his face )."}, {"viet": "Tôi không khoái loại nghệ thuật hiện đại cho lắm.", "eng": "I don't go much for modern art."}, {"viet": "Tôi thêu những bông hoa dại và chim lên vải.", "eng": "I embroidered wild flowers and birds on the cloth."}, {"viet": "Tôi cảm thấy rất mệt sau tất cả những cố gắng đó.", "eng": "I feel very tired after all that effort."}, {"viet": "Tôi quên không mang bút đi, anh có thể cho tôi mượn một chiếc không?", "eng": "I forgot to bring a pen, can you lend me one?"}, {"viet": "Tôi bị một cú sốc thật sự khi nghe tin đó.", "eng": "I got a real shock when I heard the news."}, {"viet": "Tôi đã rất khó khăn khi học ở trường cấp 2.", "eng": "I had a tough time in junior high school."}, {"viet": "Tôi nói tiếng Anh, ông bạn già ạ.", "eng": "I happen to be speaking English, old boy."}, {"viet": "Tôi đã nấu một bữa ăn đặc biệt để đãi các vị khách của chúng tôi.", "eng": "I have cooked a special meal in honour of our visitors."}, {"viet": "Tôi đã đọc các ý tưởng để viết bài của quý vị.", "eng": "I have read your ideas for stories."}, {"viet": "Tôi không có thời gian để đọc thư của tôi.", "eng": "I haven't had a chance to read my letter."}, {"viet": "Tôi biết được việc làm này qua một mục quảng cáo trên báo chí.", "eng": "I heard of the job through a newspaper advertisement."}, {"viet": "Tôi mong rằng bạn sẽ xin lỗi: đó là một việc làm rất liều lĩnh.", "eng": "I hope you'll apologize: that was a very forward thing to do."}, {"viet": "Tôi cứ nghe thấy tiếng điện thoại bận liên tục.", "eng": "I keep getting the unobtainable tone."}, {"viet": "Tôi rời khỏi đó sớm theo đúng phép lịch sự.", "eng": "I left as early as was consistent with politeness."}, {"viet": "Mình sống ở nhà cuối cùng của phố này, trừ đi hai nhà.", "eng": "I live in the last house but two in this street."}, {"viet": "Từ giờ trở đi con sẽ đi ngủ sớm.", "eng": "I'll go to sleep early from now on."}, {"viet": "Tôi sẽ dùng thẻ tín dụng.", "eng": "I'll use my credit card."}, {"viet": "Cuối cùng tôi đã bỏ được ma túy.", "eng": "I'm finally through with drugs."}, {"viet": "Tôi không chơi thể thao giỏi.", "eng": "I'm not good at sports."}, {"viet": "Tôi đang được nghỉ hai tuần lễ.", "eng": "I'm taking two weeks'holiday."}, {"viet": "Tôi không nắm được một vài điểm tinh tế trong lập luận.", "eng": "I missed some of the fine points in the argument."}, {"viet": "Tôi cần một chiếc đèn xe đạp mới-cái đèn của tôi rơi và vỡ rồi.", "eng": "I need a new bicycle lamp-my old one fell off and broke."}, {"viet": "Tôi phản đối việc bị đối xử như thế.", "eng": "I object to being treated like this."}, {"viet": "Tôi thích các tác phẩm văn xuôi dựa theo thực tế hơn hư cấu.", "eng": "I prefer non fiction to fiction."}, {"viet": "Thật sự tôi không phiền khi cho bạn bè mượn sách đâu.", "eng": "I really don't mind lending them to friends."}, {"viet": "Tôi nhắc lại lời đề nghị giúp đỡ của tôi.", "eng": "I renewed my offer of help."}, {"viet": "Tôi vo tròn tờ giấy ghi chép và ném vào lò sưởi.", "eng": "I screwed up the note and threw it on the fire."}, {"viet": "Đúng ra tôi phải đọc xong cuốn đó vào thứ sáu.", "eng": "I should have finished reading it by Friday."}, {"viet": "Tôi đặt con bé đứng trên chiếc ghế đẩu để nó có thể với tới cái giá.", "eng": "I stood the child on a stool so that she could reach the shelf."}, {"viet": "Tôi nghĩ anh ta sẽ từ chức nhưng đừng lập lại lời tôi nhé.", "eng": "I think he's going to resign, but please don't quote me."}, {"viet": "Tôi cho rằng đầu óc cô ta hơi kỳ cục.", "eng": "I think she's gone a bit queer in the head."}, {"viet": "Tôi tưởng mình nhìn thấy ma nhưng hoá ra chỉ là một ảo thị.", "eng": "I thought I saw a ghost but it was just an optical illusion."}, {"viet": "Tôi cố gắng thuyết phục ông ấy tăng lương cho tôi nhưng rõ ràng là không thể được.", "eng": "I tried to get him to increase my salary but it was clearly no go."}, {"viet": "Tớ còn phải sắp xếp lại nhà kho.", "eng": "I've got to tidy the stockroom."}, {"viet": "Tôi muốn đổi một vài đô la Mỹ sang nhân dân tệ.", "eng": "I want to exchange some US dollars into RMB."}, {"viet": "Một lần tôi đã được phép vào phòng riêng bên trong của ông ta.", "eng": "I was allowed once into his inner sanctum."}, {"viet": "Tôi đã bị đánh lừa tin vào câu chuyện của họ.", "eng": "I was hoaxed into believing their story."}, {"viet": "Tôi kinh tởm khi nhìn thấy xác chết.", "eng": "I was sickened by the sight of the dead body."}, {"viet": "Trước khi cô ấy đi tôi đã không nói được với cô ấy, tuy nhiên cũng chẳng sao bởi vì tôi có thể điện cho cô ấy tối nay.", "eng": "I wasn't able to speak to her before she left, not that in matters though, because I can phone her tonight."}, {"viet": "Tôi ao ước chuồn được ( không phải đến ) cuộc họp này.", "eng": "I wish I could get out of ( going to ) that meeting."}, {"viet": "Tôi tự hỏi không biết hai anh chàng đó có phải là sinh đôi hay không.", "eng": "I wonder if those two guys are twins."}, {"viet": "Cho tôi nhận lại những đồ có giá trị của tôi.", "eng": "I would like my valuables, please."}, {"viet": "Em chẳng ham gì ở cuộc thi sắc đẹp cả.", "eng": "I wouldn't be caught deal in a beauty contest."}, {"viet": "Nếu như có chỗ khác nhau thì hôm nay sức khoẻ anh ta có khá hơn một chút.", "eng": "If anything he is a little better today."}, {"viet": "Nếu tôi là đàn ông, chắc người ta cho tôi việc làm đó rồi.", "eng": "If I were a man they would have given me a job."}, {"viet": "Nếu váy quá rộng chúng ta có thể thu hẹp phần eo lại.", "eng": "If the skirt is too big, we can take in the waist."}, {"viet": "Nếu ngày mai anh không đỡ tôi sẽ mời bác sĩ.", "eng": "If you're no better by tomorrow I'll call the doctor."}, {"viet": "Nếu anh không biết câu trả lời thì hãy đoán xem.", "eng": "If you don't know the answer, make a guess."}, {"viet": "Nếu ông cần cái gì, cứ việc gọi cho biết.", "eng": "If you need anything, just sing out for it."}, {"viet": "Nếu bạn chịu kiên nhẫn với tôi thêm chút nữa.", "eng": "If you will bear with me a little longer."}, {"viet": "Trong một cuộc phỏng vấn riêng với David Frost, ông cựu chủ tịch đã tiết lộ nhiều điều bí mật.", "eng": "In an exclusive interview with David Frost, the former president made many revelations."}, {"viet": "Ở nước Đức phong cách nghệ thuật barôc có ảnh hưởng rất mạnh trong thế kỷ 17 và 18.", "eng": "In Germany the baroque style of art flourished in the 17th and 18th centuries."}, {"viet": "Trong khi đọc, anh ta phải chú ý đến số lượng chấm nhỏ lẫn cách sắp xếp chúng.", "eng": "In reading, he must notice both the number of dots and how they are arranged."}, {"viet": "Trong việc tài trợ cho nghệ thuật, nước đó nói chung đi trước các nước khác.", "eng": "In the funding of the arts that country generally is in advance of others."}, {"viet": "Lúc nguy hiểm, thời buổi vất vả, thời kỳ phồn vinh.", "eng": "In time of danger, hardship, prosperity, etc."}, {"viet": "Sự thích thú với chủ đề đã tăng lên một cách phi thường.", "eng": "Interest in the subject has increased phenomenal."}, {"viet": "Quân dịch có phải là bắt buộc ở nước anh không?", "eng": "Is military service compulsory in your country?"}, {"viet": "Em thích món gì đặc biệt cho bữa ăn tối?", "eng": "Is there anything in particular you'd like for dinner?"}, {"viet": "Thật là may mắn ngày nghỉ của chúng tôi không bị mưa.", "eng": "It's a blessing the rain's stayed away for our holiday."}, {"viet": "Đó là một toà nhà không hấp dẫn, thậm chí còn xấu nữa.", "eng": "It's an unattractive building, even ugly."}, {"viet": "Chính do thói quen đã làm tôi dậy vào 7.15 mỗi buổi sáng.", "eng": "It's force of habit that gets me out of bed at 7.15 each morning."}, {"viet": "Tôi rất lấy làm vinh dự và vui sướng được phát biểu nhân dịp này, trước những vị khách quý đến từ khắp nơi trên thế giới.", "eng": "It's my great honor and pleasure to speak on this occasion, before the distinguished people from all over the world."}, {"viet": "Chỉ mới đây bà ta mới đủ sức khoẻ để đi ra khỏi nhà được.", "eng": "It's only lately that she's been well enough to go out."}, {"viet": "Đã đến lúc chúng ta phải hướng sự chú ý của chúng ta đến vấn đề tiền bạc.", "eng": "It's time to turn our attention to the question of money."}, {"viet": "Điều làm tôi buồn bực là anh ta lại có thể vô tâm đến như vậy.", "eng": "It bothers me that he can be so insensitive."}, {"viet": "Đó là một loại thức ăn có lợi cho sức khỏe, phải vậy không?", "eng": "It is a kind of healthy food, isn't it?"}, {"viet": "Luật lệ quy định rằng tất cả những người xin việc đều phải qua một kỳ thi viết.", "eng": "It is laid down that all applicants must sit a written exam."}, {"viet": "Có tiếng xì xào là anh ta nợ ngập đầu.", "eng": "It is whispered that he is heavily in debt."}, {"viet": "Tôi thật sự bực mình khi bà ta bắt đầu hạch sách mọi người.", "eng": "It really gets me when she starts bossing people around."}, {"viet": "Thật sự là một nơi để tắm tốt.", "eng": "It's really a good place for bathing."}, {"viet": "Nó đứng trên bờ sông Li, hệt như một con voi đang hút nước bằng cái vòi dài của nó.", "eng": "It stands on the bank of the Lijiang River, just like an elephant sucking water with its long trunk."}, {"viet": "Đó là một trò chơi đi tới đi lui với người dẫn đầu thay đổi tay nhiều lần.", "eng": "It was a seesaw game with the lead changing hands many times."}, {"viet": "Từ chối cho phép anh ấy đi thăm vợ là bất nhân.", "eng": "It was inhuman to refuse him permission to see his wife."}, {"viet": "Kêu ca, phàn nàn đều vô ích không ai nghe.", "eng": "It was unheard-of for anyone to complain."}, {"viet": "Mua một ngôi nhà trước khi có sự đánh giá nó là điều không khôn ngoan.", "eng": "It would be unwise to buy the house before having it appraised."}, {"viet": "Jim không bao giờ uống rượu và chắc chắn là không thích đánh bạc.", "eng": "Jim never drank, and certainly didn't go a bundle on gambling."}, {"viet": "Ngay trước khi đến rặng cây, con đường mòn rẽ ngoặt sang phải.", "eng": "Just before the trees the path turns sharply right."}, {"viet": "Tối qua tôi đi nhà hàng và ăn một bữa thật no.", "eng": "Last night t went out to a restaurant and I ate a really big meal."}, {"viet": "Để tôi gọi điện cho ông ấy. Ông Brown nói rằng ông ấy đang đợi ông ở trong phòng của ông ấy.", "eng": "Let me phone him. Mr. Brown said he's waiting for you in his room."}, {"viet": "Xem kìa, lượt chơi thứ ba bắt đầu rồi, nhưng chưa có tỉ số.", "eng": "Look, the third inning's started, but there's no score yet."}, {"viet": "Nhiều người tới cuộc họp ở hội trường.", "eng": "Many people came to the meeting in the hall."}, {"viet": "Hôm qua trên đường về nhà, Marry đã nôn mửa trong xe.", "eng": "Mary puked in the car on the way home yesterday."}, {"viet": "Vui lòng cho tôi nói chuyện với ông Vương?", "eng": "May I speak to Mr. Wang, please?"}, {"viet": "Xin chào, tối qua bạn ngủ có đủ giấc không?", "eng": "Morning, did you get enough sleep last night?"}, {"viet": "Thưa ông Lý, giám đốc điều hành của chúng tôi rất hân hạnh được mời ông đến dự tiệc cốc-tai.", "eng": "Mr. Li, our Managing Director would like to have the pleasure of inviting you to a cocktail party."}, {"viet": "Ông chủ tôi đã cho tôi toàn quyền quyết định dùng thầu khoán bên ngoài.", "eng": "My boss has given me a free hand in deciding which outside contractor to use."}, {"viet": "Cái tôi thích thường hầu như là cái đắt tiền nhất.", "eng": "My favourite is usually much the most expensive."}, {"viet": "Mẹ tôi mắng tôi khi tôi đánh rơi những cái đĩa.", "eng": "My mother scolded me when I dropped the plates."}, {"viet": "Hai môn tôi thích là những môn khoa học, ấy là hoá và sinh.", "eng": "My two favourite subjects are sciences, namely chemistry and biology."}, {"viet": "Những tư tưởng mới thấm dần dần vào đầu óc dân chúng.", "eng": "New ideas are slowly filtering into people's minds."}, {"viet": "Không, tôi cho rằng bây giờ thế là xong.", "eng": "No, I think that's about it now."}, {"viet": "Không có tiếng động nào làm mất sự yên tĩnh của buổi tối.", "eng": "No sound disturbed the silence of the evening."}, {"viet": "Thế rồi việc tiếp theo mà hắn làm là châm một điếu thuốc.", "eng": "Now the next thing he did was to light a cigarette."}, {"viet": "Ồ, tớ thích gặp nhiều người và thích trả lời điện thoại.", "eng": "Oh, I enjoy meeting people, and answering the phone."}, {"viet": "Những kỷ niệm cũ đã khơi dậy khi cô ấy nhìn vào các bức ảnh.", "eng": "Old memories stirred as she looked at the photographs."}, {"viet": "Người ta không thể trách anh vì đã bồn chồn lo lắng.", "eng": "One can hardly blame you for being upset."}, {"viet": "Một đội bóng đã xây dựng được vị trí đứng đầu.", "eng": "One team has already built up a commanding lead."}, {"viet": "Hàng phòng ngự của chúng tôi kèm chặt anh ta trong suốt hiệp đầu.", "eng": "Our defence had him closely marked throughout the first half."}, {"viet": "Giám đốc mới của chúng tôi đầy năng lực.", "eng": "Our manager is brimful of energy."}, {"viet": "Đội ta đã bị đánh bại hoàn toàn vào tứ kết.", "eng": "Our team was annihilated in the quarterfinals."}, {"viet": "Một phần của địa chỉ trên lá thư đã bị xoá bỏ.", "eng": "Part of the address of the letter has been effaced."}, {"viet": "Những người ngồi hai bên mép bàn.", "eng": "People sitting on both sides of the table."}, {"viet": "Cô vui lòng chuẩn bị giúp tôi một bó hoa hồng tươi nhé.", "eng": "Please prepare a bunch of fresh roses for me."}, {"viet": "Hình phạt quá nghiêm khắc so với tội lỗi đã gây ra.", "eng": "Punishment that was out of all proportion to the off once committed."}, {"viet": "Các nhà khoa học cho rằng vụ mất mùa là không thể giải thích được.", "eng": "Scientists had maintained that the crop failure was not explicable."}, {"viet": "Chúng ta có thể hoãn cuộc thảo luận này đến mai được không?", "eng": "Shall we adjourn this discussion until tomorrow?"}, {"viet": "Cô ta chống lại ý kiến đó, nhưng tôi dám chắc tôi có thể lôi kéo được sự ủng hộ của cô ta.", "eng": "She's against the idea, but I'm sure I can win her over."}, {"viet": "Cô ta tuyệt đối có đủ năng lực cho công việc đó.", "eng": "She's extremely well qualified for the job."}, {"viet": "Cô ấy cùng tên họ với tôi nhưng chúng tôi không phải họ hàng với nhau.", "eng": "She's my namesake but we're not related."}, {"viet": "Cô ta là người không mấy thích hợp để được giao phó việc bí mật.", "eng": "She's the last person to trust with a secret."}, {"viet": "Nàng luôn có nhiều thanh niên ngưỡng mộ bám theo.", "eng": "She always has an entourage of admiring young men."}, {"viet": "Cô ta xuất thân từ giai cấp công nhân.", "eng": "She came from a working class background."}, {"viet": "Cô ta không thể dấu được một tiếng phì cười.", "eng": "She could not conceal a snort of laughter."}, {"viet": "Cô ấy không cần phải học chạy, cô ta như sinh ra đã biết chạy rồi.", "eng": "She didn't have to learn how to run, she's a natural."}, {"viet": "Cô ấy mong đợi tôi lao đến giúp đỡ cô ấy mà không hề phải nhờ vả gì hết.", "eng": "She expects me to rush over and help her at the drop of a hat."}, {"viet": "Bà ta tuôn ra mấy lời chửi rủa rồi lại ngồi lên.", "eng": "She gave a couple of curses and then got up again."}, {"viet": "Cô ta nuốt chửng một cách bực dọc như thể vấn đề đó làm bận tâm cô.", "eng": "She gulped nervously, as if the question bothered her."}, {"viet": "Bà ta có một thái độ ngờ vực sâu sắc đối với bất cứ cái gì mới hoặc lạ.", "eng": "She has a deep mistrust of anything new or strange."}, {"viet": "Cô ấy tỏ ra do dự rõ rệt không muốn làm gì để giúp đỡ chúng tôi.", "eng": "She has shown a marked disinclination to do anything to help us."}, {"viet": "Cô ta hành động trong vấn đề này với tư cách cá nhân.", "eng": "She is acting as a private individual in this matter."}, {"viet": "Cô ta không chịu từ bỏ sự chống đối của cô ấy đối với kế hoạch đó.", "eng": "She is unyielding in her opposition to the plan."}, {"viet": "Cô ta muốn biết những mốt thời trang mới nhất.", "eng": "She likes to keep up with the latest fashions."}, {"viet": "Cô ấy lộ rõ là cô ấy muốn tôi đi.", "eng": "She made it abundantly clear that she wanted me to leave."}, {"viet": "Cô ta thường mang tài liệu ở cơ quan về nhà làm.", "eng": "She often brings work home with her from the office."}, {"viet": "Bà ấy điều chỉnh bếp sẵn để nó khởi động lúc 6 giờ 30.", "eng": "She presets the cooker to come on at 6.30."}, {"viet": "Cô ấy bực bội vì sự theo đuổi dai dẳng của cậu ta.", "eng": "She resented his persistent approaches."}, {"viet": "Cô ấy có hàng tá bạn trai.", "eng": "She's got dozens of boy-friends."}, {"viet": "Cô ta nói thì thầm nên tôi không nghe được.", "eng": "She said it in a whisper, so I couldn't hear."}, {"viet": "Cô ta đánh điện báo rằng cô ấy bình an khoẻ mạnh.", "eng": "She sent to say that she was safe and well."}, {"viet": "Chẳng mấy chốc cô đã vượt qua đối thủ trên đường đua.", "eng": "She soon outpaced the other on the course."}, {"viet": "Cô ấy kiếm thêm tiền tiêu vặt bằng cách làm việc ngày thứ bảy.", "eng": "She supplemented her pocket-money by working on Saturday."}, {"viet": "Cô ấy mang chiếc radio hỏng trở lại cửa hiệu và đòi trả lại tiền.", "eng": "She took the faulty radio back to the shop and demanded a refund."}, {"viet": "Cô ta đi qua làm đổ ly rượu của tôi, làm như vô tình nhưng thực ra là cố ý.", "eng": "She walked past and spilled my drink, accidentally on purpose."}, {"viet": "Cô ta kinh hoàng thấy rằng nước sông đã dâng lên đến bậc cửa.", "eng": "She was appalled to find that the river had risen to the doorstep."}, {"viet": "Bà ấy bị tước đoạt mất đất đai.", "eng": "She was expropriated of her land."}, {"viet": "Cô ta đã vấp phải nhiều sự thù địch, chỉ trích, thụ hưởng lòng tốt, v. v.", "eng": "She was met with much hostility, criticism, kindness, etc."}, {"viet": "Cô ấy quá tức giận trước những lời nhận xét khinh thường phụ nữ của anh ta đến mức cô gọi anh ta là con lợn sô-vanh.", "eng": "She was so angry at his sexist remarks that she called him a male chauvinist pig."}, {"viet": "Bà ta bị bỏ phiếu loại khỏi hội đồng.", "eng": "She was voted out off the board."}, {"viet": "Một tiếng nữa cô ấy sẽ trở lại.", "eng": "She will be back in an hour."}, {"viet": "Cô ta rất thích xin được công việc ấy.", "eng": "She would dearly like to get that job."}, {"viet": "Chứng tỏ một trí nhớ kỳ lạ về các sự kiện.", "eng": "Show an amazing retention of facts."}, {"viet": "Từ khi bỏ hút thuốc tôi đã bắt đầu tăng cân.", "eng": "Since I smoking I've begun gaining weight."}, {"viet": "Slay là từ đồng nghĩa với kill dù nó diễn tả mạnh hơn và hơi lỗi thời.", "eng": "Slay is synonymous with kill though it is more forceful and rather dated."}, {"viet": "Những kẻ trưởng giả học làm sang khinh bỉ đứa con rể của mình thuộc tầng lớp lao động.", "eng": "Snobs who despised their working-class son-in-law."}, {"viet": "Xã hội có quyền được nhìn thấy kẻ phạm pháp phải bị trừng phạt.", "eng": "Society has a right to see law-breakers punished."}, {"viet": "Một số người da đỏ nghĩ rằng loại đá đó phải là ngọc lam.", "eng": "Some Indians think the stone should be turquoise."}, {"viet": "Một số người muốn hợp pháp hóa việc sở hữu ma túy.", "eng": "Some people want to legalize the possession of cannabis."}, {"viet": "Trong phòng này có cái gì đó không ổn nhưng tôi chưa tìm ra được là cái gì.", "eng": "Something's wrong with this room, but I can't quite put my finger on what it is."}, {"viet": "Nói tiếng Anh với giọng xứ Gan.", "eng": "Speak English with a Welsh intonation."}, {"viet": "Đứng thọc tay vào túi.", "eng": "Stand with one's hand in one's pockets."}, {"viet": "Đừng nhảy cẫng lên, hãy ngồi yên, chỉ năm phút thôi!", "eng": "Stop cavorting around and sit still, just for five minutes!"}, {"viet": "Những chuỗi đèn lồng tạo thành vòng giữa các cành cây.", "eng": "Strings of lanterns looping between the branches of the trees."}, {"viet": "Những công việc được trả hậu như thế vượt ra ngoài khả năng của anh ta.", "eng": "Such highly-paid jobs are out of his reach."}, {"viet": "Quyền lực tối cao thuộc về Nhà nước.", "eng": "Supreme authority resides in the State."}, {"viet": "Hãy nghỉ ngơi sau tất cả công việc cực nhọc của anh.", "eng": "Take a rest from all your hard work."}, {"viet": "Đánh thuế ở mức 15 xu cho một cân Anh.", "eng": "Taxed at the rate of 15p in the pound."}, {"viet": "Điều hành một cửa hiệu trong thời gian người chủ hiệu vắng mặt.", "eng": "Tend a store in the owner's absence."}, {"viet": "Thôi, vui chơi thế là đủ rồi! Bắt tay vào việc thôi.", "eng": "That's enough fun and games! Let's get down to work."}, {"viet": "Con bé đó sẽ làm mọi thứ-nó dường như không biết sợ là gì.", "eng": "That child will do anything-she seems totally without fear."}, {"viet": "Điều đó là đúng, đố anh dám phản bác tôi.", "eng": "That is true, and don't you dare contradict me."}, {"viet": "Câu hỏi đó quả là một câu hóc búa!", "eng": "That question is a real puzzler!"}, {"viet": "Việc cố gắng cứu cô ta thất bại chẳng bao lâu đã được biết rộng rãi.", "eng": "That the attempt to save her had failed soon became widely known."}, {"viet": "Ưu thế tuyệt đối của đảng cầm quyền.", "eng": "The absolute dominance of the governing party."}, {"viet": "Các diễn viên thực sự đã quá cường điệu để chọc cười khán giả.", "eng": "The actors were really hamming it up to amuse the audience."}, {"viet": "Sự lựa chọn giữa sống đến già hay chết trẻ.", "eng": "The alternative of growing old and dying young."}, {"viet": "Quỹ quyên góp đã đạt được mục tiêu đề ra là 10000 pao.", "eng": "The appeal fund has reached its target of 10000 pound."}, {"viet": "Nghệ thuật viết thơ dường như đã lỗi thời.", "eng": "The art of writing letters seems to be a thing of the past."}, {"viet": "Tác giả đó có mối quan hệ làm việc tốt với chủ bút của mình.", "eng": "The author had a good working relationship with his editor."}, {"viet": "Thời tiết xấu phá hoại kế hoạch của chúng tôi.", "eng": "The bad weather played havoc with our plans."}, {"viet": "Vùng cao khô cằn của miền trung Tây Ban Nha.", "eng": "The barren uplands of central Spain."}, {"viet": "Eo biển Bê rinh tách Châu Á khỏi Châu Mĩ.", "eng": "The Bering straits part Asia from America."}, {"viet": "Trách nhiệm này rõ ràng đổ cả lên vai tôi.", "eng": "The blame rests fair and square on my shoulders."}, {"viet": "Cuốn sách kết thúc có vẻ lạc quan.", "eng": "The book ended on an optimistic note."}, {"viet": "Đối với tôi, cái hộp nặng quá không nhấc nổi.", "eng": "The box is too heavy for me to lift."}, {"viet": "Các thầy dòng Phúc âm tổ chức hội họp để cầu kinh vào mỗi thứ năm.", "eng": "The Brethren hold a prayer meeting every Thursday."}, {"viet": "Cuộc tẩu thoát của tên đạo chích khỏi tay cảnh sát.", "eng": "The burglar's evasion of the police."}, {"viet": "Ứng viên ra ứng cử dựa vào lá phiếu của tầng lớp tư sản.", "eng": "The candidate coming forward for elections, depended on the votes of the bourgeois in the town."}, {"viet": "Chiếc ô tô đi trên chiếc cầu lung lay một cách thận trọng.", "eng": "The car proceeded over the rickety bridge with caution."}, {"viet": "Tất cả các vai diễn phải có mặt ở diễn trường vào lúc bảy giờ tối.", "eng": "The cast must all be on the set by 7 pm."}, {"viet": "Ông giám đốc từ chối không bàn về tin đồn công ti đang trong tình thế khó khăn.", "eng": "The chairman refused to discuss the rumours that the company was in difficulties."}, {"viet": "Đứa bé được phép vì nó đã làm xong bài tập ở nhà.", "eng": "The child allowed as how he had already done his homework."}, {"viet": "Tương lai lũ trẻ luôn luôn chiếm vị trí quan trọng nhất trong đầu óc tôi.", "eng": "The children's future is always uppermost in my mind."}, {"viet": "Lũ trẻ đã chơi khăm bỏ muối vào bát đường.", "eng": "The children put salt in the sugar bowl as a practical joke."}, {"viet": "Ban đồng ca đứng phía sau người lĩnh xướng.", "eng": "The chorus stood backstage behind the soloist."}, {"viet": "Vách núi chúc xuống biển.", "eng": "The cliff drops sharply away to the sea."}, {"viet": "Đồng tiền lăn xuống dưới chiếc pianô.", "eng": "The coin rolled underneath the piano."}, {"viet": "Ủy ban thấy rằng nên hoãn buổi họp đó lại.", "eng": "The committee judged it advisable to postpone the meeting."}, {"viet": "Công ty đã làm quá mức về tài chính.", "eng": "The company overreached itself financially."}, {"viet": "Lần đầu tiên trong nhiều năm Đảng bảo thủ đứng vào phe đối lập.", "eng": "The Conservative party was in opposition for the first time in years."}, {"viet": "Chi phí của dự án này không tương xứng với kết quả.", "eng": "The cost of this project bears no relation to the results."}, {"viet": "Dòng sông được đánh dấu trên bản đồ.", "eng": "The course of the river was marked on the map."}, {"viet": "Cây nghệ tây và những vật báo hiệu khác về mùa xuân.", "eng": "The crocus and other messengers of spring."}, {"viet": "Tấm rèm rực rỡ làm bừng sáng căn phòng.", "eng": "The curtain is very colourful and brightens up the room."}, {"viet": "Vấn đề này đã có sự hậu thuẫn ngầm của Tổng thống.", "eng": "The deal had the tacit backing of the President."}, {"viet": "Những người thuyết minh bày thiết bị cho cuộc thí nghiệm.", "eng": "The demonstrators set up apparatus for the experiment."}, {"viet": "Sự khác nhau giữa các bức ảnh là không đáng kể.", "eng": "The differences between the pictures are very slight."}, {"viet": "Giải vô địch nhào lặn đối với cô ấy là quá dễ dàng.", "eng": "The diving championship was a cakewalk for her."}, {"viet": "Các bác sĩ nói ca mổ hơi mang tính may rủi có thể là không thành công.", "eng": "The doctors say the operation is a bit of a gamble which may be not succeed."}, {"viet": "Con búp bê có thể xoay được phần cổ và eo.", "eng": "The doll pivots at the waist and neck."}, {"viet": "Thuốc này chưa được thử nghiệm cho người.", "eng": "The drug has not been tried out on humans yet."}, {"viet": "Quả trứng này cứng-em đã không tính đúng thời gian.", "eng": "The egg is hard-you didn't time it properly."}, {"viet": "Động cơ đã thổi tung miếng đệm.", "eng": "The engine had blown a gasket."}, {"viet": "Những biến cố đó được giữ kín trong vòng bí mật.", "eng": "The events are wrapped in mystery."}, {"viet": "Sự phơi sáng phim chụp ảnh.", "eng": "The exposure of photographic film to light."}, {"viet": "Trang trại này đã được truyền lại từ đời cha sang đời con từ năm 1800.", "eng": "The farm has been handed down from father to son since 1800."}, {"viet": "Các số liệu đó có lẽ nêu ra không đúng mức tăng trưởng thực sự.", "eng": "The figures probably understate the real growth rate."}, {"viet": "Lúc đầu ngọn lửa cháy từ từ nhưng chẳng bao lâu bốc lên thành ngọn lửa lớn.", "eng": "The fire burned slowly at first, but soon became a blaze."}, {"viet": "Những chiếc đồng hồ đầu tiên mà chúng ta biết đến được chế tạo ra khoảng cuối thế kỷ 13.", "eng": "The first clocks we know much about were made toward the end of the 13th century."}, {"viet": "Nước lụt ngập toàn thể khu vực.", "eng": "The flood water covered the whole area."}, {"viet": "Công thức đổi galông sang lít.", "eng": "The formula for converting gallons into litres."}, {"viet": "Sự thảo luận kỹ thêm về một lý thuyết.", "eng": "The further elaboration of a theory."}, {"viet": "Viên tướng đã hiểu sai ý định của kẻ thù và không lường trước được cuộc tấn công.", "eng": "The general misread the enemy's intentions, and didn't anticipate the attack."}, {"viet": "Thỏi vàng được chuyển đi dưới sự hộ tống của cảnh sát.", "eng": "The gold bullion was transported under police escort."}, {"viet": "Chính quyền đã chậm trễ trong việc lên án hành động thô bạo.", "eng": "The Government has been dilatory in condemning the outrage."}, {"viet": "Các đại diện chính phủ tiến hành một nhiệm vụ đi tìm sự thật tới Châu Phi để tìm xem nạn đói thực sự tệ hại thế nào.", "eng": "The government representatives went on a fact finding mission to Africa to discover how bad the famine really was."}, {"viet": "Chiếc tàu to lớn chìm xuống dưới những lớp sóng.", "eng": "The great ship sank below the waves."}, {"viet": "Người khách trọ muốn đi tham quan.", "eng": "The guest wants to go sightseeing."}, {"viet": "Các vụ xử án đó được báo chí, truyền hình theo dõi sát.", "eng": "The hearings were conducted in the full glare of publicity."}, {"viet": "Những lỗ thủng trên cái khăn đó là do các con nhậy cắn.", "eng": "The holes in the cloth were made by moths."}, {"viet": "Khách sạn không rộng mà cũng chẳng thoải mái.", "eng": "The hotel is neither spacious nor comfortable."}, {"viet": "Ngôi nhà được quét vôi màu xanh lá cây khắp nơi.", "eng": "The house was painted green throughout."}, {"viet": "Kì thi sắp đến làm cho họ làm việc chăm hơn.", "eng": "The imminence of exams made them work harder."}, {"viet": "Những người bị thương được đưa cấp tốc đến bệnh viện bằng xe cứu thương.", "eng": "The injured were rushed to hospital by an ambulance."}, {"viet": "Sự trớ trêu là ở chỗ tôi vấp ngã trong khi bảo người khác phải cẩn thận.", "eng": "The irony o fit is that I tripped while telling someone else to be careful."}, {"viet": "Quan tòa đề xuất phương án với tòa án.", "eng": "The judge made recommendations to the court."}, {"viet": "Căn bếp có diện tích 12 mét vuông.", "eng": "The kitchen has an area of 12 square metres."}, {"viet": "Dặm cuối cùng mệt mỏi trong chuyến leo núi của họ.", "eng": "The last weary mile of their climb."}, {"viet": "Tất cả bài giảng đều lặp đi lặp lại những điểm ấy.", "eng": "The lectures all hammered away at the same point."}, {"viet": "Đèn tắt và ngôi nhà tối om.", "eng": "The lights were out and The house was dark."}, {"viet": "Chiếc xe tải đâm vào cột đèn đánh rầm.", "eng": "The lorry hit the lamp-post with a crash."}, {"viet": "Sau đó, tiếp theo món khai vị là món chính, kèm với món chính, những vị khách chọn món xúp và thức ăn chính.", "eng": "The main course comes after the appetizers, with which the guests also take soup and main food."}, {"viet": "Nhiều vụ ô-tô đâm nhau trên các con đường đóng băng tự nó đã giải thích tất cả rồi.", "eng": "The many crashes on the icy roads told their own tale."}, {"viet": "Người thợ máy đó cố gắng sửa xe hơi của tôi, nhưng thực tế anh ta chỉ làm hư thêm mà thôi.", "eng": "The mechanic tried to repair my car, but he really botched it up."}, {"viet": "Miếng kim loại đã bị ăn mòn vì rỉ.", "eng": "The metal has corroded because of rust."}, {"viet": "Sự sai lầm thật là rõ ràng đối với những người có mặt.", "eng": "The mistake was obvious to all those present."}, {"viet": "Công trình nghiên cứu toàn diện nhất về thơ của ông ấy cho đến nay.", "eng": "The most comprehensive study yet of his poetry."}, {"viet": "Thớ thịt con vật này có bệnh.", "eng": "The muscle fibre of this animal is diseased."}, {"viet": "Trọng lượng thực, không có hộp là 100g.", "eng": "The net weight without the box is 100 grams."}, {"viet": "Kiểu mới này sẽ tiết giảm nhiên liệu và có tốc độ cao.", "eng": "The new model delivers speed and fuel economy."}, {"viet": "Tin tức đó có lợi cho tinh thần của đội.", "eng": "The news is good for the team's morale."}, {"viet": "Tiếng ồn của xe cộ đang trở thành mối quan tâm.", "eng": "The noise of traffic is becoming cause for concern."}, {"viet": "Cô y tá gom tóc vào trong mũ của mình.", "eng": "The nurse tucked her hair under her cap."}, {"viet": "Toà nhà cũ đó ở tình trạng hoàn toàn hư hỏng do thiếu sửa chữa.", "eng": "The old building was in a general state of disrepair."}, {"viet": "Những củ hành đó bắt đầu đâm chồi.", "eng": "The onions are beginning to sprout up."}, {"viet": "Những quận huyện xa thành phố nhất.", "eng": "The outermost districts of the city."}, {"viet": "Khu công viên là một bức tranh ngoạn mục khi những cánh hoa thuỷ tiên nở rộ.", "eng": "The park is a picture when the daffodils are in bloom."}, {"viet": "Bệnh nhân đang tiến triển khả quan sau khi mổ.", "eng": "The patient is making good progress after her operation."}, {"viet": "Phần trình diễn mới đầu dở nhưng về sau khá hơn.", "eng": "The performance started badly but picked up towards the end."}, {"viet": "Bức tranh những người đang chết đói làm xúc động tim chúng tôi.", "eng": "The pictures of starving people touched our hearts."}, {"viet": "Máy bay bị đâm, 200 người trên máy bay bị thiệt mạng.", "eng": "The plane crashed, killing all 200 people aboard."}, {"viet": "Vở kịch được diễn đều đặn suốt sáu tháng liền ở Broadway.", "eng": "The play ran for six months on Broadway."}, {"viet": "Cảnh sát đang rà soát hồ sơ để tìm những trường hợp tương tự.", "eng": "The police are trawling through their files for similar cases."}, {"viet": "Cô cảnh sát lấy thân mình che chở cho đứa bé.", "eng": "The police officer shielded the child with her body."}, {"viet": "Tình hình chính trị rất không ổn định.", "eng": "The political situation is highly unstable."}, {"viet": "Đồng pao vẫn vững giá so với đồng đô-la song có hạ hơn so với đồng yên.", "eng": "The pound remained firm against the dollar, but fell against the yen."}, {"viet": "Tổng thống vừa mới bắt đầu một nhiệm kỳ mới.", "eng": "The President has just entered upon another term of office."}, {"viet": "Vị linh mục pha nước với rượu nho.", "eng": "The priest mingled the water with the wine."}, {"viet": "Người tù mang khoá tay.", "eng": "The prisoner wore a pair of handcuffs."}, {"viet": "Dự án đó phải ở trong tình trạng chờ đợi cho đến khi hội đồng đưa ra quyết định của mình.", "eng": "The project must remain in limbo until the committee makes its decision."}, {"viet": "Sau đó chất thịt và hạt được lấy ra khỏi quả.", "eng": "The pulp and seeds are than scooped out of the pods."}, {"viet": "Vấn đề lựa chọn một người kế vị đã nảy sinh.", "eng": "The question of choosing a successor has arisen."}, {"viet": "Lưỡi dao cạo trượt và làm đứt má tôi.", "eng": "The razor slipped and cut my cheek."}, {"viet": "Mối quan hệ giữa người mẹ và đứa trẻ mới sinh.", "eng": "The relationship between mother and baby."}, {"viet": "Hàng ăn đó thuộc quyền sở hữu mới.", "eng": "The restaurant is under new ownership."}, {"viet": "Cuộc nổi dậy được chính phủ dùng làm lí do để cấm mọi hoạt động chính trị.", "eng": "The riots were used by the government as a pretext for banning all political activities."}, {"viet": "Tất cả bọn cướp dùng vải trùm đầu để che mặt.", "eng": "The robbers all wore hoods to hide their faces."}, {"viet": "Hôn lễ trong Hoàng gia là một dịp vui lớn.", "eng": "The royal wedding was an occasion of great festivity."}, {"viet": "Nhân viên bán hàng đó là một thanh niên rất bảnh trai.", "eng": "The salesman was a very personable young man."}, {"viet": "Phim khoa học viễn tưởng đó đã có một số ấn tượng đặc biệt kỳ lạ.", "eng": "The science fiction film had some marvellous special effects."}, {"viet": "Ý nghĩ chung của cuộc mít tinh là ông ta nên từ chức.", "eng": "The sense of the meeting was that he should resign."}, {"viet": "Bóng mờ lung linh của chiếc áo váy dài bằng lụa đẹp của cô ta.", "eng": "The shimmering translucency of her fine silk gown."}, {"viet": "Cửa hàng mười giờ mới mở cửa.", "eng": "The shop doesn't open until 10 o'clock."}, {"viet": "Những nét giống nhau giữa họ vẫn thường được bình luận tới.", "eng": "The similarity between them has often been remarked on."}, {"viet": "Mùi rong biển làm ông ấy nhớ lại thời thơ ấu của mình.", "eng": "The smell of seaweed took him back to his childhood."}, {"viet": "Quân lính được trang bị đầy đủ vũ khí và đạn dược.", "eng": "The soldiers were well equipped with weapons and ammunition."}, {"viet": "Diễn giả hơi ngập ngừng và được chủ toạ thỉnh thoảng nhắc nhở.", "eng": "The speaker was rather hesitant and had to be prompted occasionally by the chairman."}, {"viet": "Nhà nước thường tỏ ra là một mối đe doạ cho kiểu sống cá nhân.", "eng": "The state often presents a threat to individuality."}, {"viet": "Câu chuyện phi lý đến nỗi không ai tin được.", "eng": "The story was so absurd that no one believed it."}, {"viet": "Xe điện ngầm sẽ đáng tin cậy hơn taxi.", "eng": "The subway would be more reliable than a taxi."}, {"viet": "Người bơi đã bị dòng nước cuốn đi.", "eng": "The swimmer was swept away by the current."}, {"viet": "Thầy giáo nhìn thấy nó chép bài thi lịch sử.", "eng": "The teacher saw him in copying in the history."}, {"viet": "Những người thuê nhà trả tiền thuê đúng hạn.", "eng": "The tenants are punctual in paying the rent."}, {"viet": "Ý nghĩ tìm được vàng thôi thúc họ.", "eng": "The thought of finding gold excited them."}, {"viet": "Các biện pháp cứng rắn mới về chống lạm dụng ma tuý có lẽ là một tình thế được ăn cả ngã về không.", "eng": "The tough new measures on drug abuse are likely to be a case of kill or cure."}, {"viet": "Sự chuyển nhiệt từ vật thể này sang vật thể kia.", "eng": "The transference of heat from one body to another."}, {"viet": "Đường ngang ngõ tắt trong hang chẳng bao lâu đã làm cho chúng tôi mất phương hướng.", "eng": "The twists and turns in the cave soon bewildered us."}, {"viet": "Lốp xe bẹp rồi-nó bị đinh đâm thủng.", "eng": "The tyre's flat-the nail has gone right through."}, {"viet": "Bà soát vé nhìn ra chỗ khác để cho lũ trẻ lọt được vào rạp chiếu bóng không mất tiền.", "eng": "The usherette looked the other way so that the children could enter the entrance of the cinema without money."}, {"viet": "Chiếc đàn viôlông này không hoàn toàn cùng âm vực với đàn pianô.", "eng": "The violin is not quite in tune with the piano."}, {"viet": "Hơi nước này có khuynh hướng biến thành các giọt nước hoặc biến thành các tinh thể nước đá nếu trong không khí có một vật gì cứng cho phép nước và nước đá kết tụ xung quanh.", "eng": "The water vapor is more likely to change to drops of water or crystals of ice if there is a solid speck of something in the air for the water or ice to form around."}, {"viet": "Khi chúng tôi đến thì toàn bộ nơi đó đang hoạt động nhộn nhịp.", "eng": "The whole place was humming when we arrived."}, {"viet": "Nhân chứng viết bản khai cho cảnh sát.", "eng": "The witness made a statement to the police."}, {"viet": "Sự sụt đất tồi tệ nhất trong lịch sử hầm mỏ.", "eng": "The worst cave-in in the history of mining."}, {"viet": "Chiếc ô tô của họ là một sự thèm muốn của tất cả bọn họ.", "eng": "Their car is the envy of all their friends."}, {"viet": "Ý kiến phản đối của họ dễ dàng bị bác bỏ.", "eng": "Their objections were easily disposed of."}, {"viet": "Rồi thì tôi nghĩ ông nên yêu cầu họ phát hành một ngân phiếu bảng Anh được ký phát ở ngân hàng chúng tôi.", "eng": "Then I think you should ask them to issue a pound cheque drawn on our bank."}, {"viet": "Có rất nhiều điều tôi có thể nói về vở kịch đó nhưng nói tóm lại thì nó tồi ghê gớm.", "eng": "There's a lot I could say about the show but to put it in a nutshell it was terrible."}, {"viet": "Anh không cần bận tâm đến vấn đề này, chúng tôi đang giải quyết.", "eng": "There's no need to concern yourself with this matter, we're dealing with it."}, {"viet": "Nào, nào! Không sao đâu, rồi cháu sẽ cảm thấy dễ chịu ngay thôi!", "eng": "There, there! Never mind, you'll soon feel better!"}, {"viet": "Không có việc gì mà một người nghiện sẽ không làm để có được chất ma tuý.", "eng": "There are no lengths to which an addict will not go to obtain his drug."}, {"viet": "Đoạn văn có nhiều cách đọc.", "eng": "There are various readings of the passage."}, {"viet": "Có một mối quan hệ xa giữa hai lý thuyết.", "eng": "There is a distant connection between the two theories."}, {"viet": "Không có lối tới phố qua cửa đó.", "eng": "There is no access to the street through that door."}, {"viet": "Nước ngọt sẽ không bị tính tiền ạ.", "eng": "There'll be no charge for soft drinks."}, {"viet": "Có một tình bằng hữu rất lớn giữa các thành viên của đội.", "eng": "There was a strong feeling of fellowship among the members of the team."}, {"viet": "Có rất nhiều người đang đợi để vào.", "eng": "There were crowds of people waiting to get in."}, {"viet": "Đây là mười ngân phiếu thay thế, mỗi ngân phiếu 100 đô la Mỹ.", "eng": "These are the ten replacement cheques of US $ 100 each."}, {"viet": "Những cỗ máy này vẫn nằm yên từ ngày nhà máy đóng cửa.", "eng": "These machines have lain idle since the factory closed."}, {"viet": "Tất cả bọn họ đều đã đến đó, ngoại trừ Jim.", "eng": "They'd all been there before with the exception of Jim."}, {"viet": "Họ vừa có thêm một người vào gia đình.", "eng": "They've just had an addition to the family."}, {"viet": "Chúng không cách xa súc vật bao nhiêu.", "eng": "They are not many grades removed from the brute."}, {"viet": "Phần lớn các thành phố đều bị họ đốt cháy rụi.", "eng": "They burned down most of the cities."}, {"viet": "Họ không nghe theo bố mẹ và đã lấy nhau.", "eng": "They defied their parents and got married."}, {"viet": "Cuối cùng họ đã đạt được sự thoả thuận về giá.", "eng": "They finally reached agreement on the price."}, {"viet": "Họ đã quyết định nơi sẽ xây ngôi trường mới.", "eng": "They have determined where the new school will be built."}, {"viet": "Họ ở Luân Đôn trong tuần còn những ngày cuối tuần họ về quê.", "eng": "They live in London during the week and go to the country at the weekend."}, {"viet": "Họ chỉ mất nửa tiếng ăn trưa.", "eng": "They only take half an hour for lunch."}, {"viet": "Họ tập hợp lại và được lệnh khai hoả.", "eng": "They regrouped and were ordered to open fire."}, {"viet": "Họ đã tìm cách đòi công ty bồi thường thiệt hại, hoàn trả phí tổn, chi phí v. v.", "eng": "They sought to recover damages, costs, expenses, etc from the firm."}, {"viet": "Họ thong thả trở lại làm việc một tiếng đồng hồ sau đấy.", "eng": "They wandered back to work an hour later."}, {"viet": "Họ đã mệt lử sau khi leo núi.", "eng": "They were in a state of exhaustion after climbing the mountain."}, {"viet": "Họ nghĩ ra các phương pháp giúp cho các sứ giả đưa tin có thể di chuyển nhanh từ nơi này sang nơi khác.", "eng": "They worked out ways for messengers to travel fast from place to place."}, {"viet": "Quyển sách này đầy những thông tin bổ ích.", "eng": "This book is packed with useful information."}, {"viet": "Điệu nhảy này được giới trẻ thích.", "eng": "This dance is popular with young people."}, {"viet": "Điều này không dính dáng gì tới việc chúng ta đang bàn cả.", "eng": "This has no reference to what we were discussing."}, {"viet": "Đó chỉ là một sự mê say trong chốc lát, đừng quá bận tâm.", "eng": "This is only a passing infatuation, not to be taken too seriously."}, {"viet": "Dụng cụ cải tiến nhỏ này rất thích hợp để mở đồ hộp.", "eng": "This little gadget's great for opening tins."}, {"viet": "Hai đĩa cân này không thăng bằng.", "eng": "This pair of scales is not in equilibrium."}, {"viet": "Quy định này không có hiệu lực cho đến khi có thông tin thêm.", "eng": "This rule is inoperative until further notice."}, {"viet": "Thứ thuốc tăng lực này sẽ rất thần diệu đối với tình trạng suy sụp của anh.", "eng": "This tonic will work miracles for your depression."}, {"viet": "Hai người đã có quan hệ gắn bó từ nhiều năm nay.", "eng": "Those two have been knocking about together for ages."}, {"viet": "Tổng cộng cả hai tòa tháp có 48600 cửa sổ.", "eng": "Together the two towers have 48600 windows."}, {"viet": "Qua hai đêm sau, họ nhìn thấy đất liền.", "eng": "Two nights later they sighted land."}, {"viet": "Chiến tranh gần như đã chắc chắn xảy ra lại tránh được vào phút chót.", "eng": "War, what had seemed almost certain, was averted at the eleventh hour."}, {"viet": "Chúng tôi muốn anh cảm thấy như một người trong gia đình.", "eng": "We'd like you to feel you're part of the family."}, {"viet": "Chúng ta sắp tới một trang trại-tôi cho rằng chúng ta có thể chỉ đi ngang qua đó thôi.", "eng": "We're coming to a farmyard-I suppose we can just walk through."}, {"viet": "Chúng tôi đang định dùng bữa tối như thường lệ.", "eng": "We're thinking of having your regular dinner."}, {"viet": "Chúng tôi chỉ vừa mới dọn tới đây vì vậy vẫn còn cảm thấy hơi lạc lõng.", "eng": "We've only just moved here so we still feel a bit out of it."}, {"viet": "Chúng ta đang ở vào thời kỳ quyết định của lịch sử.", "eng": "We are at a critical time in our history."}, {"viet": "Chúng tôi đã tranh cãi suốt một tiếng đồng hồ mà nó không hề lay chuyển tý nào.", "eng": "We argued for an hour but he wouldn't budge an inch."}, {"viet": "Chúng ta có thể gạch tên anh ta ( ra khỏi danh sách ), vì anh ta không đến.", "eng": "We can cross his name off ( the list ), as he's not coming."}, {"viet": "Chúng ta có thể thuê một chiếc ô tô khi tới đó Ý kiến hay đấy.", "eng": "We could hire a car when we get there. That's an idea."}, {"viet": "Chúng tôi không đổi tiền kim loại, thưa ông.", "eng": "We don't deal in coins, sir."}, {"viet": "Chúng tôi khởi hành ngay sau bữa ăn sáng.", "eng": "We got off immediately after breakfast."}, {"viet": "Chúng tôi mặc cả với người lái xe tắc xi về giá tiền.", "eng": "We haggled with the taxi driver over the fare."}, {"viet": "Chúng tôi có nhiều cỡ hộp khác nhau.", "eng": "We have several different box sizes."}, {"viet": "Chúng ta cũng biết rằng men dịch vị sẽ biến sữa thành phó-mát.", "eng": "We know, too, that rennet will turn milk to cheese."}, {"viet": "Ta còn có thể ngạc nhiên khi đến đó.", "eng": "We may be in for another suprise when we get there."}, {"viet": "Chúng ta phải kiếm một người chữa cái ti vi.", "eng": "We must send for a man to repair the TV."}, {"viet": "Chúng tôi san sẻ vui buồn cùng với những người khác.", "eng": "We participate with others in sorrow and joys."}, {"viet": "Chúng tôi lùng sục khắp cả các cánh đồng tìm cừu lạc.", "eng": "We scoured through the fields, looking for stray sheep."}, {"viet": "Chúng ta vẫn còn hai tiếng mà.", "eng": "We still have over two hours."}, {"viet": "Chúng tôi muốn có một nhà doanh nghiệp nổi tiếng để đứng đầu tổ chức của chúng tôi.", "eng": "We want to get a well-known businessman to front our organization."}, {"viet": "Chúng tôi rất khâm phục hiệu suất làm việc của anh.", "eng": "We were most impressed by your efficiency."}, {"viet": "Chúng tôi sẽ sắp xếp chỗ tốt nhất để trưng bày hàng của công ty ông.", "eng": "We would arrange the best space to display your goods."}, {"viet": "À, tôi không muốn bỏ lỡ bất kỳ cái gì, vì vậy tôi sẽ đến đó sớm.", "eng": "Well, I don't want to miss anything so I'll get there early."}, {"viet": "Thế đấy, tại sao trên thế giới người ta lại hút \"cần sa\" nhỉ?", "eng": "Well, why in the world do you smoke \"pot\"?"}, {"viet": "Sao, anh ta thốt lên, Cô bỏ tôi đi à?", "eng": "What, he exclaimed, Are you leaving without me?"}, {"viet": "Kế hoạch của anh cho tương lai gần nhất là gì?", "eng": "What are your plans for the immediate future?"}, {"viet": "Theo bạn vấn đề nghiêm trọng nhất trên thế giới trong thế kỉ 21 là gì?", "eng": "What do you think the most serious problem in the world in the 21st century is?"}, {"viet": "Ở Úc tuổi trung bình để lập gia đình là bao nhiêu?", "eng": "What is the average age for getting married in Australia?"}, {"viet": "Tài sản có giá trị nhất của bạn là gì?", "eng": "What is your most prized possession?"}, {"viet": "Có gì trong cái hộp vậy, thưa bà?", "eng": "What's in the box, madam?"}, {"viet": "Chủ đề của bộ phim là gì vậy?", "eng": "What was the subject matter in the film?"}, {"viet": "Chiếc xe buýt kế tiếp khởi hành lúc nào?", "eng": "When does the next bus depart?"}, {"viet": "Khi được dẫn đến phòng, tôi thấy là căn phòng không được dọn sạch tử tế.", "eng": "When I was shown to the room I found the room hadn't been properly cleaned."}, {"viet": "Khi cảnh sát đến nó ù té chạy ra phía cửa lớn.", "eng": "When the police arrived he made a bolt for it."}, {"viet": "Chẳng hạn khi ăn súp mì Nhật, ông phải làm cho kêu.", "eng": "When you eat Japanese noodle soup, tor instance, you have to make noise."}, {"viet": "Bạn đã tìm nó ở đâu?", "eng": "Where have you looked for it?"}, {"viet": "Tháng nào nóng nhất ở Texas?", "eng": "Which is the hottest month in Texas?"}, {"viet": "Ai làm bữa tiệc cưới??", "eng": "Who's doing the food at the wedding reception?"}, {"viet": "Ai sẽ giới thiệu buổi biểu diễn của anh ấy trong khi anh ấy đi xa?", "eng": "Who will present his show while he's away?"}, {"viet": "Tại sao bạn không để nó cứ reo?", "eng": "Why don't you just let it ring?"}, {"viet": "Đi du lịch một mình anh có an toàn không?", "eng": "Will you be safe travelling by yourself?"}, {"viet": "Tấm lưới sắt ở phía trước chuồng gà.", "eng": "Wire mesh on the front of the chicken coop."}, {"viet": "Phụ nữ ngày nay đa số ở trong hội đồng, mặc dù trước 1976 không có một thành viên nữ nào.", "eng": "Women are now in a majority on the committee, although previous to 1976 there were no women members at all."}, {"viet": "Vui lòng cho tôi một cái chăn nhé?", "eng": "Would you give me a blanket?"}, {"viet": "Ông muốn tham quan thành phố hay là ngoại ô?", "eng": "Would you like to visit the city or the suburb?"}, {"viet": "Hãy viết ngay cho địa chỉ này và chúng tôi sẽ gửi cho bạn một mẫu hàng miễn phí bằng chuyến thư ngay sau đó.", "eng": "Write now to this address and we will send you a free sample by return."}, {"viet": "Vâng, tôi đã ở nhà hôm Chủ nhật. Anh nghĩ sao về điều đó?", "eng": "Yes, I was at home on Sunday. What about it?"}, {"viet": "Lẽ ra từ đây cậu có thể nhìn thấy cảnh đẹp của biển nếu không vướng khối nhà ở giữa.", "eng": "You'd have a good view of the sea from here except for the block of flats in between."}, {"viet": "Anh ta là người tốt giúp tôi làm công việc đó.", "eng": "You're a dear to help me to do the work."}, {"viet": "Anh cần phải khen cô ấy-cô ta cực kỳ thông minh.", "eng": "You've got to hand it to her-she's damned clever."}, {"viet": "Anh đừng tin rằng tàu đến đúng giờ.", "eng": "You can't depend on the train arriving on time."}, {"viet": "Bạn có thể lái vòng quanh và ngoạn cảnh chút đỉnh.", "eng": "You can drive around and do a little sightseeing."}, {"viet": "Bạn lấn sang luồng khác ở tốc độ 75 dặm 1 giờ và tông vào xe ai đó, bất kể họ có chạy cùng chiều hay không.", "eng": "You change lanes at 70 miles an hours, and hit somebody, it doesn't matter if you're going the same way or not."}, {"viet": "Con có điện thoại của cô Cindy gọi đấy.", "eng": "You have a phone call from Cindy."}, {"viet": "Con biết đã đến lúc con đi ngủ rồi đấy, Sue.", "eng": "You know it's time for you to go to bed, Sue."}, {"viet": "Mặc cái áo len dày ấy chắc cậu phải nóng điên lên mất.", "eng": "You must be boiling in that thick sweater."}, {"viet": "Anh cần có con dao sắc mới cắt đứt được cái nút này.", "eng": "You need a sharp knife to cut through the knot."}, {"viet": "Bạn nên chọn mặt hàng vải nào mặc bền.", "eng": "You should choose a fabric that will wear well."}, {"viet": "Anh làm tôi giật nảy mình-tôi không nghe thấy anh vào.", "eng": "You startled me-I didn't hear you come in."}, {"viet": "Ông sẽ được đón tiếp nồng nhiệt khi ông đến Anh.", "eng": "You will receive a warm welcome when you come to England."}, {"viet": "Ông Chu, giám đốc của anh và tôi định gặp nhau vào lúc 10 giờ sáng mai.", "eng": "Your Director Mr. Zhou and I are supposed to meet at 10: 00 tomorrow morning."}, {"viet": "Vali của ông nặng hơn trọng lượng cho phép là năm kilôgam.", "eng": "Your suitcase is five kilograms overweight."}]