[{"viet": "Bức họa của người mới vào nghề không thể so sánh với bức họa của người chuyên nghiệp.", "eng": "A beginner's painting can't be compared to that of an expert."}, {"viet": "Một cuộc gặp gỡ tình cờ đã quyết định sự nghiệp của tôi.", "eng": "A chance meeting decided my career."}, {"viet": "Một sự phục chế lại hoàn toàn chiếc bình đã bị hư hại.", "eng": "A complete restoration of the damaged vase."}, {"viet": "Sự giảm bớt kinh phí, giá cả, sản xuất.", "eng": "A cut in expenditure, prices, production."}, {"viet": "Một tài liệu đính kèm với lá thư bằng một cái ghim.", "eng": "A document attached to a letter with a pin."}, {"viet": "Một vài lỗi lầm còn sót lại trong chương trình của máy vi tính.", "eng": "A few residual faults in the computer program."}, {"viet": "Một người ủng hộ công lý, hòa bình, v. v.", "eng": "A friend of justice, peace, etc."}, {"viet": "Chính phủ nên cho phép tự do phát biểu ý kiến chính trị.", "eng": "A government should permit the free expression of political opinion."}, {"viet": "Một vị anh hùng rất được đồng bào của anh ta yêu mến.", "eng": "A hero much loved by his countrymen."}, {"viet": "Một anh nài ngựa đã cưỡi sáu con đoạt giải mùa này.", "eng": "A jockey who has ridden six winners this season."}, {"viet": "Sự sẵn sàng mù quáng theo chân các nhà lãnh đạo của họ dẫn đến thảm họa chắc chắn.", "eng": "A lemming-like readiness to follow their leaders into certain disaster."}, {"viet": "Một loại thuốc nước có mức độ bảo vệ cao.", "eng": "A lotion with a high protection factor."}, {"viet": "Một cơ cấu không có bộ phận di động.", "eng": "A mechanism with no moving parts."}, {"viet": "Một tiền đề đơn giản, ngây thơ về nền dân chủ chỉ cần theo nguyên tắc đa số.", "eng": "A naively uncomplicated premise of simple majoritarian democracy."}, {"viet": "Một số vấn đề đã nẩy sinh.", "eng": "A number of problems have arisen."}, {"viet": "Một người có lòng can đảm và lương thiện phi thường.", "eng": "A person of singular courage and honesty."}, {"viet": "Một nhà chính trị nổi tiếng là một người có thói quen hôn các em bé.", "eng": "A politician known as an inveterate kisser of babies."}, {"viet": "Một bộ phận giả được lắp vào sau phẫu thuật cắt bỏ.", "eng": "A prosthesis was fitted after the amputation."}, {"viet": "Một nhà hàng với tiêu chuẩn vệ sinh thấp.", "eng": "A restaurant with a low standard of hygiene."}, {"viet": "Một sự trình bày bằng sơ đồ về cơ cấu tổ chức.", "eng": "A schematic representation of the structure of the organization."}, {"viet": "Một khoảng cách ngắn giữa hai căn nhà.", "eng": "A short distance between the two houses."}, {"viet": "Một màu hồng dịu hơn là màu đỏ gắt.", "eng": "A soft pink rather than a harsh red."}, {"viet": "Một viên đá đã ném vỡ tan kính cửa sổ.", "eng": "A stone shattered the window; the glass shattered."}, {"viet": "Một cuộc nói chuyện tóm lược lại những xu hướng mới đây trong triết học.", "eng": "A talk summarizing recent trends in philosophy."}, {"viet": "Một kẻ bụi đời ăn mặc rách rưới.", "eng": "A tramp dressed in rags and tatters."}, {"viet": "Một phiếu tiền lãi cổ phần.", "eng": "A warrant for dividends on shares."}, {"viet": "Một thanh niên dưới sự bảo hộ của một người nhạc sĩ vĩ cầm nổi tiếng.", "eng": "A young protégé of a famous violinist."}, {"viet": "Thực ra, lúc này bạn đề cập đến nó làm tôi thấy nhớ nhà.", "eng": "Actually, now that you mention it, I am kind of homesick."}, {"viet": "Sau một thời gian anh sẽ nhận ra rằng những điều này chẳng sao cả.", "eng": "After a time you get to realize that these things don't matter."}, {"viet": "Sau một lúc lâu đi đi lại lại, chúng tôi đã đưa tất cả bọn trẻ về nhà của chúng.", "eng": "After much toing and froing we got all the children back to their homes."}, {"viet": "Sau một giờ đợi xe buýt cô ta quyết định không thèm chờ nữa vì chẳng bõ.", "eng": "After waiting an hour for the bus she decided to give it up as a bad job."}, {"viet": "Tất cả những kế hoạch nhỏ nhoi để kiếm tiền của anh ta hình như đã đi đến thất bại.", "eng": "All his little schemes for making money seem to come to grief."}, {"viet": "Tất cả côn trùng trong hình vẽ ở trang 39 là bướm thường.", "eng": "All the insects in the pictures on 39 page are butterflies."}, {"viet": "Mặc dù Marry cũng có vài thời điểm gặp khó khăn nhưng cô ấy đã không sử dụng ma túy được một năm rồi.", "eng": "Although Mary has had some rough times, she's been drug-free for one year."}, {"viet": "Một diễn viên có khuynh hướng cường điệu.", "eng": "An actor who tends to go over the top."}, {"viet": "Một ý nghĩ kinh sợ vừa nảy ra trong đầu tôi.", "eng": "An awful thought has just struck me."}, {"viet": "Một cách dàn dựng mới giàu tưởng tượng của vở Macbeth.", "eng": "An imaginative new staging of Macbeth."}, {"viet": "Thư từ khi có khi không.", "eng": "An on-again, off-again correspondence."}, {"viet": "Và tôi khùng đến nỗi tin vào nó.", "eng": "And I was fool enough to believe him."}, {"viet": "Lại thêm một trong những ý kiến sáng giá của tôi bị phản đối!", "eng": "Another of my great ideas bites the dust!"}, {"viet": "Đã chấp thuận một sự hạn chế mới về việc chi tiêu của công ty.", "eng": "Approved a new lid on corporate spending."}, {"viet": "Ông có mang theo trái cây, cây tươi, hàng hóa phải trả thuế không?", "eng": "Are you bringing in any fruit, any living plants, any items on which you much pay duly?"}, {"viet": "Ông có chắc là ông không quá lạc quan chứ?", "eng": "Are you sure you couldn't be too optimistic?"}, {"viet": "Với tư cách là một nhà văn tôi xếp ông ta ngang hàng với Joyce.", "eng": "As a writer I'd put him level with Joyce."}, {"viet": "Khi xe ô tô của ngài tổng thống đến, đám đông đột nhiên vỗ tay hoan hô ào ào.", "eng": "As the president's car arrived, the crowd break into loud applause."}, {"viet": "Thoạt tiên nơi đó xa lạ đối với tôi.", "eng": "At first the place was strange to me."}, {"viet": "Những nỗ lực thuyết giáo cho thế hệ trẻ vào đạo.", "eng": "Attempts to proselytize the younger generation."}, {"viet": "Chiến đấu với những thăng trầm của cuộc sống.", "eng": "Battling against the vicissitudes of life."}, {"viet": "Không đủ tiền bạc, thời gian v. v.", "eng": "Be pushed for money, time, etc."}, {"viet": "Trước khi ông về lại Canada, chúng tôi dự định sắp xếp một chuyến tham quan Trung Quốc cho ông.", "eng": "Before you go back to Canada, we plan to arrange a tour of China for you."}, {"viet": "Loài chim thường tụ tập ở những nơi thức ăn dồi dào.", "eng": "Birds concentrate in places where food is abundant."}, {"viet": "Đột ngột chấm dứt quan hệ ngoại giao với một nước.", "eng": "Break off diplomatic relations with a country."}, {"viet": "Bọn kẻ trộm đã làm cho căn nhà đảo lộn.", "eng": "Burglars had turned the house upside-down."}, {"viet": "Nhưng đó chỉ là câu chuyện mà thôi.", "eng": "But it's just a story."}, {"viet": "Đôi khi cúc áo được làm bằng xương.", "eng": "Buttons are sometimes made of bone."}, {"viet": "À này, bạn cười nhiều quá đấy.", "eng": "By the way, you laugh too much."}, {"viet": "Tôi có thể để anh thanh toán tiền với người hầu bàn được không?", "eng": "Can I leave you to square up the waiter?"}, {"viet": "Cậu có dám mở miệng xin lỗi hay không?", "eng": "Can you find it in your heart to apologize?"}, {"viet": "Ông có thể phái một trong những đệ tử của ông đến lấy hồ sơ này được không?", "eng": "Can you send one of your minions to collect this file?"}, {"viet": "Sự sử dụng bộ ly hợp không cẩn thận có thể làm hư các bánh răng.", "eng": "Careless use of the clutch may damage the gears."}, {"viet": "Các hoá chất tác dụng vào nhau để tạo thành một hợp chất mới.", "eng": "Chemicals that interact to form a new compound."}, {"viet": "Sự bất ổn trong nước làm lung lay cơ cấu của chế độ cũ.", "eng": "Civil unrest which shook the framework of the old system."}, {"viet": "Vào đây mà ngồi xuống-trông anh có vẻ mệt nhoài.", "eng": "Come in and sit down-you look done in."}, {"viet": "Xưng tội của mình với một linh mục.", "eng": "Confess one's sins to a priest."}, {"viet": "Cho tôi đi nhờ xe ông được không?", "eng": "Could I cadge a lift with you?"}, {"viet": "Anh thấy có thể cho tôi vay 10 bảng Anh trong vài ngày không?", "eng": "Could you see your way to lending me £ 10 for a couple of days?"}, {"viet": "Những lọn tóc xoăn xõa xuống vai cô ta.", "eng": "Curls of hair fall over her shoulder."}, {"viet": "Trang hoàng một cây Nôen bằng kim tuyến.", "eng": "Decorate a Christmas tree with tinsel."}, {"viet": "Mặc cho những lời hứa được lặp lại nhiều lần, nó vẫn không trả được số tiền đã mượn.", "eng": "Despite repeated assurances he failed to repay the money he had borrowed."}, {"viet": "Ông có gặp nhiều rắc rối khi đổi tiền mặt ngân phiếu đó không?", "eng": "Did you have much trouble cashing the cheque?"}, {"viet": "Bàn luận các kế hoạch đó với một chuyên gia.", "eng": "Discuss the plans with an expert."}, {"viet": "Làm việc gì do thương hại ai.", "eng": "Do something out of pity for somebody."}, {"viet": "Bạn có bao giờ đi nghe nhạc giao hưởng không?", "eng": "Do you ever go to the symphony?"}, {"viet": "Ở đất nước bạn có hoa anh đào không?", "eng": "Do you have cherry blossoms in your country?"}, {"viet": "Ông có muốn một ít tiền lẻ không?", "eng": "Do you like to have some small change?"}, {"viet": "Anh có đồng ý với quan điểm bi quan của cô ta về tình trạng kinh tế không?", "eng": "Do you subscribe to her pessimistic view of the state of the economy?"}, {"viet": "Ông có muốn ăn cơm luôn với chúng tôi không?", "eng": "Do you want to join us for dinner?"}, {"viet": "Phong cách sáng tác của ông có đặc tính hoá tác phẩm của ông không?", "eng": "Does your style of writing individualize your work?"}, {"viet": "Đừng làm nản lòng cô ấy; cố ấy đang cố gắng tối đa.", "eng": "Don't discourage her; she's doing her best."}, {"viet": "Đừng để chó chạy ra khỏi phòng.", "eng": "Don't let the dog out of the room."}, {"viet": "Đừng có thái độ vênh váo chỉ vì anh đã tìm được việc làm.", "eng": "Don't swagger around just because you got the job."}, {"viet": "Bạn có nghĩ là chúng ta vứt rác quá nhiều không?", "eng": "Don't you think we throw away too much?"}, {"viet": "Trong hội nghị này, chúng ta sẽ cùng nhau trao đổi kinh nghiệm.", "eng": "During the conference, we shall get together to exchange experience."}, {"viet": "Loại bỏ các lỗi trong bài viết của ai.", "eng": "Eliminate mistakes from one's writing."}, {"viet": "Thậm chí sau khi trả hết các khoản chi tiêu, chúng ta vẫn còn được lãi 100 bảng Anh.", "eng": "Even after paying all the expensive, we'll still be £ 100 in pocket."}, {"viet": "Mọi thứ trong cửa hàng trông hơi bẩn thỉu.", "eng": "Everything in the shop looked rather fly-blown."}, {"viet": "Sử dụng thời gian, nỗ lực và tiền bạc vào một dự án.", "eng": "Expend time, effort and money on a project."}, {"viet": "Những người nông dân rất bận rộn trong mùa gặt.", "eng": "Farmers are very busy during the harvest."}, {"viet": "Nộp một kiến nghị để đưa ra những luận cứ mới về vụ kiện đó.", "eng": "Filed a motion to reargue the case."}, {"viet": "Năm trăm tên nổi loạn đã bị bắt và bị tước vũ khí.", "eng": "Five hundred rebels were captured and disarmed."}, {"viet": "Để cho việc hôn nhân thành công, cả hai người trong cuộc phải biết nhường nhịn nhau.", "eng": "For a marriage to succeed, both partners must learn to give and take."}, {"viet": "Chúng tôi ở trong hoàn cảnh tiến thoái lưỡng nan.", "eng": "Found ourselves in an either-or situation."}, {"viet": "Đạt các chứng chỉ về Toán và Anh văn.", "eng": "Gain credits in Math and English."}, {"viet": "Đi vào trọng tâm của chủ đề.", "eng": "Get to the heart of the subject."}, {"viet": "Hãy giữ đủ trường độ của nốt tròn.", "eng": "Give the semibreve its full value."}, {"viet": "Xin chào, bà muốn làm tóc thế nào?", "eng": "Good afternoon, how would you like your hair done?"}, {"viet": "Đã mất hai tuần mới điều động được sư đoàn này vào tư thế sẵn sàng chiến đấu.", "eng": "Had spent two weeks chivvying this division toward combat readiness."}, {"viet": "Đã bắt đầu phô trương vẻ lộng lẫy của các màn biểu diễn của họ.", "eng": "Have started to glitz up their shows."}, {"viet": "Cậu có bao giờ nghe bài hát đó được hát bằng tiếng Ý chưa?", "eng": "Have you ever heard that song sung in Italian?"}, {"viet": "Em đã đọc những hướng dẫn của tôi có liên quan đến bài làm của em chưa?", "eng": "Have you read my instructions regarding your assignment?"}, {"viet": "Ông ta là một người lớn-lớn theo nhiều nghĩa.", "eng": "He's a big man-in more ways than one."}, {"viet": "Gần đây anh ta đã tốt hơn, tôi nghĩ cô ấy đã đánh thức được cái phần tốt đẹp hơn trong con người anh ta.", "eng": "He's become a lot nicer recently, I think she's brought out his better nature."}, {"viet": "Nó hoàn toàn đứng ngồi không yên về việc thi cử của mình.", "eng": "He's got himself into a complete stew about his exams."}, {"viet": "Anh ta thôi việc chỉ sau ba tháng.", "eng": "He's packed up his job after only three months."}, {"viet": "Anh ấy có thiện chí nhưng lại không thật chuẩn lúc điều hành việc.", "eng": "He's well-intentioned but not very good at getting things done."}, {"viet": "Anh ấy biện luận rất lô-gích để mọi người chấp nhận điều đó.", "eng": "He argued very plausibly for its acceptance."}, {"viet": "Anh ta nhẩy cỡn vào phòng và loan báo là anh ta sẽ cưới vợ.", "eng": "He bounded into the room and announced that he was getting married."}, {"viet": "Ông ta tiếp tục làm việc đến khuya.", "eng": "He carried on working long into the night."}, {"viet": "Không thể nào tin được anh có ý như vậy trong những điều anh ta nói.", "eng": "He couldn't conceivably have meant what he said."}, {"viet": "Anh ta không được bồi hoàn bởi vì hợp đồng bảo hiểm của anh ta đã hết hiệu lực.", "eng": "He didn't get any compensation because his insurance policy had lapsed."}, {"viet": "Anh ta đánh hụt quả phát bóng đầu tiên.", "eng": "He duffed his drive off the first tee."}, {"viet": "Nó cảm thấy hết sức cần thiết phải đề cập đến những vấn đề của nó.", "eng": "He felt a great necessity to talk about his problems."}, {"viet": "Ông ta báo cho cô ta biết trước một tháng là cô ta sẽ phải nghỉ việc.", "eng": "He gave her a month's notice."}, {"viet": "Anh ta bị nhà vô địch thế giới đánh bại hoàn toàn.", "eng": "He got properly beaten by the world champion."}, {"viet": "Anh ta cả gan bảo tôi là béo phì.", "eng": "He had the audacity to tell me I was too fat."}, {"viet": "Ông ấy có một thứ rượu chứa lâu năm trong hầm.", "eng": "He has an excellent wine-cellar."}, {"viet": "Hắn bị lương tâm cắn rứt vì mấy vụ giết người của hắn.", "eng": "He has several murders on his conscience."}, {"viet": "Ông ta nhích từng bước qua hành lang chật hẹp.", "eng": "He inched his way through the narrow passage."}, {"viet": "Ông ấy đang giảng dạy về văn chương Nga.", "eng": "He is lecturing on Russian literature."}, {"viet": "Hắn trẻ, đẹp trai và cũng rất giàu.", "eng": "He is young and good looking and also very rich."}, {"viet": "Nó bỏ đi vì nhiều lý do khác nhau.", "eng": "He left for variety of reasons."}, {"viet": "Anh ta trông có vẻ khá hài lòng về việc mình đã làm.", "eng": "He looks rather pleased with himself."}, {"viet": "Nó ngoan ngoãn làm bất cứ gì người ta bảo.", "eng": "He meekly did everything he was told to."}, {"viet": "Anh ta chỉ nói đùa thôi-thật sự anh ta không có ý như thế.", "eng": "He only said it in fun-he didn't really mean it."}, {"viet": "Ông ta có đặc tính là gây được lòng tin cậy.", "eng": "He possesses the quality of inspiring confidence."}, {"viet": "Anh ấy để con côn trùng trong lòng bàn tay.", "eng": "He put the insect on the palm of his hand."}, {"viet": "Ông ta từ chối không ủng hộ chính đảng mới.", "eng": "He refused to become identified with the new political party."}, {"viet": "Ông ấy điều hành khoa của mình một cách thẳng tay.", "eng": "He runs this department with a heavy hand."}, {"viet": "Ông ta bị kết tội trốn thuế.", "eng": "He's been accused of tax evasion."}, {"viet": "Anh ta đang chuẩn bị một bữa ăn qua loa.", "eng": "He's just fixing a snack."}, {"viet": "Anh ta bị cả phố ghen tị.", "eng": "He's the envy of the whole street."}, {"viet": "Anh ấy tham gia vào trận đánh tại Bắc Phi.", "eng": "He saw action in North Africa."}, {"viet": "Ông ta có chung với tôi những nỗi lo sợ về một cuộc chiến tranh có thể xảy ra.", "eng": "He shares my fears about a possible war."}, {"viet": "Ông ta búng tay kêu tách một cái để gọi người hầu bàn.", "eng": "He snapped his finger to attract the waiter."}, {"viet": "Khởi sự anh ta chạy nhưng rồi sớm thấm mệt và chậm dần thành đi bộ.", "eng": "He started off at a run but soon tired and slowed to a walk."}, {"viet": "Anh ta kiện ông chủ vì bị sa thải vô cớ.", "eng": "He sued his employer for wrongful dismissal."}, {"viet": "Anh ta nghĩ ra được một kế hoạch để kiếm tiền.", "eng": "He thought of a scheme to get some money."}, {"viet": "Anh ta quẳng cho người ăn xin một đồng tiền.", "eng": "He tossed a coin to the beggar."}, {"viet": "Nó chỉ lấy của tôi có 1 pao về quyển sách này.", "eng": "He undercharged me 1 pound for the book by 1 pound."}, {"viet": "Anh ta muốn học đại học, nhưng gia đình anh ta không có đủ phương tiện để giúp đỡ anh ta.", "eng": "He wants to go to the college, but his family haven't the means to help him."}, {"viet": "Anh ta bị nhóm côn đồ đánh nhừ tử.", "eng": "He was badly beaten up by a gang of things."}, {"viet": "Một thông điệp giả đã dụ anh ta đi vào lãnh thổ địch.", "eng": "He was decoyed by a false message into entering enemy territory."}, {"viet": "Hắn ta đi từng nhà một để lừa bịp các bà già.", "eng": "He was going door-to-door flim-flamming old ladies."}, {"viet": "Anh ta chưa bao giờ thích việc bếp núc trước đây, nhưng bây giờ thì lại chúi đầu vào bếp.", "eng": "He was never interested in cooking before, but now he's got the bug."}, {"viet": "Nó đã bị loại khỏi danh sách ứng viên có thể được tuyển chọn.", "eng": "He was ruled out as a possible candidate."}, {"viet": "Sau khi chiếm giải quán quân anh ta trở thành niềm tự hào của dân làng.", "eng": "He was the pride of the village after winning the championship."}, {"viet": "Nó cân dự đấu dưới mức vài pao.", "eng": "He weighed in at several pounds below the limit."}, {"viet": "Anh ta tỉnh dậy và thấy mình tự nhiên ở trong bệnh viện.", "eng": "He woke up and found himself in the hospital."}, {"viet": "Về tính nết và năng lực đứng cao hơn những người khác một cái đầu.", "eng": "Head and shoulders above the rest in character and ability."}, {"viet": "Việc chọn cô ta làm đại biểu Công Đảng cho tỉnh York.", "eng": "Her adoption as Labour candidate for York."}, {"viet": "Những nhận xét láo xược của cô ta làm tôi rất bực!", "eng": "Her cheeky remarks really get up my nose!"}, {"viet": "Sự quyến rũ về mặt tình cảm của cô chẳng làm anh rung động chút nào.", "eng": "Her emotional appeal left him completely cold."}, {"viet": "Tóc nàng từng búp xõa xuống bờ vai.", "eng": "Her hair fell over her shoulders in a mass of curls."}, {"viet": "Công việc của cô ta làm cho cô ta mệt nhoài.", "eng": "Her job takes a lot out of her."}, {"viet": "Tên của cô ấy không quen, trước đây tôi chưa bao giờ nghe thấy cả.", "eng": "Her name is new to me, I've never heard of her before."}, {"viet": "Sự hiện diện của bà ấy trong cuộc khủng hoảng có một tác dụng xoa dịu.", "eng": "Her presence during the crisis had a calming effect."}, {"viet": "Nụ cười của cô ta là một làn gió tươi mát trong cái cơ quan ảm đạm này.", "eng": "Her smile is a breath of fresh air in this gloomy office."}, {"viet": "Cô ta lạc đi khi báo tin khủng khiếp ấy.", "eng": "Her voice broke when she told the dreadful news."}, {"viet": "Ở đây chúng ta có thể nhìn được toàn cảnh thành phố.", "eng": "Here we can get a bird's eye view of the city."}, {"viet": "Nhiệt tình của ông ta đối với sự nghiệp này làm phấn chấn những người theo ông.", "eng": "His ardour for the cause inspired his followers."}, {"viet": "Thời khoá biểu dày đặc của ông ta khiến cho các sinh viên khó lòng tiếp xúc với anh ta.", "eng": "His busy schedule made him completely inaccessible to his students."}, {"viet": "Cái chết của ông ấy được cáo phó trên báo hôm nay.", "eng": "His death was announced in today's paper."}, {"viet": "Mặt anh ta nổi đầy những vệt đỏ trông rất xấu.", "eng": "His face was covered in ugly red blotches."}, {"viet": "Tóc ông ấy đã bạc nhiều.", "eng": "His hair has greyed a lot."}, {"viet": "Sự tử tế của ông ta làm chúng tôi phải mang ơn ông ta.", "eng": "His kindness places us under an obligation to him."}, {"viet": "Cái chết đột ngột của bà mẹ là một cú sốc lớn đối với anh ấy.", "eng": "His mother's sudden death was a great shock to him."}, {"viet": "Việc ông ta truy hại các đối thủ chính trị của mình.", "eng": "His persecution of his political opponents."}, {"viet": "Thanh danh của ông ta đã bị ô uế bởi vụ bê bối.", "eng": "His reputation was tainted by the scandal."}, {"viet": "Kiểu tóc mới lạ lùng của anh ta là nguyên nhân của sự cười đùa vui vẻ.", "eng": "His strange hairstyle was the cause of much merriment."}, {"viet": "Tiếng nói của ông ta sang sảng đầy uy quyền.", "eng": "His voice carries the ring of authority."}, {"viet": "Các bác sĩ tỏ ra ít hy vọng về việc hồi phục của cô ấy.", "eng": "Hold out little hope of her recovering."}, {"viet": "Tiền nhà tăng với một tỷ lệ cao hơn lạm phát.", "eng": "House prices are rising at a higher rate than inflation."}, {"viet": "Làm sao bạn có thể chịu ăn thứ đó?", "eng": "How can you bear to eat that stuff?"}, {"viet": "Làm sao họ có thể xoay sở để sống nổi với đồng lương thấp như thế?", "eng": "How do they manage to subsist on such a low wage?"}, {"viet": "Nhà hàng của anh mở cửa đến mấy giờ tối?", "eng": "How late is your restaurant open?"}, {"viet": "Bạn đang theo học bao nhiêu khóa học?", "eng": "How many courses are you taking?"}, {"viet": "Anh đã bỏ bao nhiêu ớt bột vào món cari?", "eng": "How much chili did you put in the curry?"}, {"viet": "Ở nước bạn, phải bao nhiêu tuổi mới được uống rượu?", "eng": "How old do you have to be to drink alcohol in your country?"}, {"viet": "Hunt đã cưỡi nó nhảy qua được một vòng khá ngoạn mục mặc dù con ngựa của anh ta không đủ sức.", "eng": "Hunt jumped a respectable round although his horse was unfit."}, {"viet": "Cháu muốn học cách làm săn-uýt của Mỹ.", "eng": "I'd like to learn how to make American sandwiches."}, {"viet": "Tôi sẽ kiểm tra lá thư này cho ông nếu ông muốn.", "eng": "I'll check this letter for you, if you want."}, {"viet": "Tôi sẽ cho anh mượn 90 phần trăm số tiền, phần còn lại anh phải tự xoay sở lấy.", "eng": "I'll lend you 90% of the money and you'll have to find the difference."}, {"viet": "Tôi là người dùng phương tiện vận chuyển công cộng rất nhiều Ngành thép là một trong những ngành dùng than nhiều nhất ở nước Anh.", "eng": "I'm a great user of public transport The steel industry is one of Britain's greatest users of coal."}, {"viet": "Tôi vui sướng về việc tôi được chọn làm đội trưởng.", "eng": "I'm delighted about my selection as leader."}, {"viet": "Tôi sẽ dùng thuốc tẩy đó để vết bẩn biến mất.", "eng": "I'm going to use the bleach so that the stain will come out."}, {"viet": "Tôi sẽ không để anh sử dụng xe ôtô của tôi, chỉ có thế thôi.", "eng": "I'm not going to let you use my car, and that's that."}, {"viet": "Tôi lấy làm tiếc, các chuyến bay của hãng chúng tôi vào ngày hôm đó đều đã kín chỗ rồi.", "eng": "I'm sorry, but our flights are fully booked on that day."}, {"viet": "Tôi đem ôtô đến xưởng sửa chữa cho người ta xem.", "eng": "I'm taking my car to the garage to be looked at."}, {"viet": "Tôi vẫn muốn có một cái vườn như của họ.", "eng": "I've always wanted a garden like theirs."}, {"viet": "Tôi đã tranh thủ được sự hợp tác của hầu hết những người láng giềng trong cuộc vận động của tôi.", "eng": "I've enlisted the co-operation of most of my neighbours in my campaign."}, {"viet": "Tôi vừa nhận được bức điện tín của Paul.", "eng": "I've just received a telegram from Paul."}, {"viet": "Mẹ đã nói với con bao nhiêu lần là con không được chơi ở gần đường mà.", "eng": "I've told you over and over again that you mustn't play near the road."}, {"viet": "Tôi luôn luôn dự trữ một chai rượu phòng khi có bạn bè ghé chơi.", "eng": "I always keep a bottle of wine by in case friends call round."}, {"viet": "Tôi đang tiến hành theo giả thuyết là.", "eng": "I am proceeding on the supposition that."}, {"viet": "Tôi cam đoan với ông là việc này sẽ không xảy ra lần nữa.", "eng": "I assure you it won't happen again."}, {"viet": "Tôi tính chúng tôi sẽ đến lúc 6 giờ chiều.", "eng": "I calculated that we would arrive at 6. p. m."}, {"viet": "Tôi không thể giúp anh thêm được nữa, cô ấy nói một cách mệt mỏi.", "eng": "I can't help you any more she said wearily."}, {"viet": "Tôi có thể trả lời mọi câu hỏi trừ câu cuối cùng.", "eng": "I can answer all the questions except for the last."}, {"viet": "Tôi không thể tiết lộ giá cả của nó.", "eng": "I cannot divulge how much it cost."}, {"viet": "Tôi ra lệnh cho anh không được quên những gì tôi đã nói.", "eng": "I charge you not to forget what I have said."}, {"viet": "Tôi không thể làm việc vì có quá nhiều sự gián đoạn.", "eng": "I couldn't work because there were so many interruptions."}, {"viet": "Tôi không dám nói với anh thêm nữa bởi vì nó hết sức riêng tư.", "eng": "I daren't tell you any more because it's highly confidential."}, {"viet": "Tôi có nói với ai đâu, thật đấy!", "eng": "I didn't tell anyone, on my oath!"}, {"viet": "Tôi cũng không biết nó bị mất hay bị đánh cắp, dù sao thì nó cũng không còn nữa.", "eng": "I don't know if it was lost or stolen, anyway, it's gone."}, {"viet": "Xin giúp tôi làm bài tập với.", "eng": "I don't suppose you could help me with my homework."}, {"viet": "Em không muốn nài ép anh, nhưng anh không ra đi đấy chứ?", "eng": "I don't want to press you, but shouldn't you be leaving?"}, {"viet": "Tôi nghĩ kiểu tóc này không hợp với chị đâu.", "eng": "I don't think that hair style is you."}, {"viet": "Tôi có cảm tưởng là mình sắp bệnh.", "eng": "I feel as if I'm going to be sick."}, {"viet": "Cuối cùng tôi đã tìm thấy cuốn sách đó trong thư viện trường đại học.", "eng": "I finally ran the book down in the university library."}, {"viet": "Tôi giũ chiếc ví và đồng xu rơi ra.", "eng": "I gave my purse a shake, and a coin fell out."}, {"viet": "Tôi nghĩ cảnh gây ấn tượng nhất với tôi là cảnh ông già hấp hối.", "eng": "I guess the scene that grabbed me the most was the one in which the old man was dying."}, {"viet": "Tôi hết sức quen thuộc thân thiết với chốn này.", "eng": "I had this tremendous sense of affinity with the place."}, {"viet": "Tôi bị chảy mũi và cứ ho liên tục.", "eng": "I have a runny nose and can't stop coughing."}, {"viet": "Tôi không có quần áo đúng nghi thức cho buổi lễ này, có lẽ mặc bộ đồ màu sẫm cũng được chăng?", "eng": "I have no formal clothes for the occasion, perhaps I can get by in a dark suit?"}, {"viet": "Tôi buộc phải chấn chỉnh lớp học khi học sinh trở nên quá mất trật tự.", "eng": "I have to sit on the class when they get too rowdy."}, {"viet": "Tôi nghe đâu anh ta hiện nay cộng tác với ICI.", "eng": "I hear he's with ICI now."}, {"viet": "Tôi hy vọng tôi không bao giờ gặp lại cô ta.", "eng": "I hope I never cross her path again."}, {"viet": "Tôi định đi nhưng lại quên mất.", "eng": "I intended to go but forgot to."}, {"viet": "Tôi quen thuộc London vì là nơi tôi đã trải qua thời thơ ấu của mình.", "eng": "I know London as the place where I spent my childhood."}, {"viet": "Tôi thích uống trà thật ngọt.", "eng": "I like my tea very sweet."}, {"viet": "Bây giờ tôi sẽ gọi Đại úy Lucas.", "eng": "I'll call Lieutenant Lucas now."}, {"viet": "Tôi sẽ xem ông ấy có ở văn phòng không?", "eng": "I'll see if he's in?"}, {"viet": "Tôi e rằng đây là chỗ của tôi.", "eng": "I'm afraid this is my seat."}, {"viet": "Tôi đến đây để gặp ông Smith đến từ Canada.", "eng": "I'm here to see Mr. Smith from Canada."}, {"viet": "Tôi lấy làm tiếc, ông ấy đang họp.", "eng": "I'm sorry, he's at a meeting."}, {"viet": "Tôi đã tìm được cách buộc giá hàng của anh ta giảm ( từ 500 xuống 450 pao ).", "eng": "I managed to knock his price ( from 500 pounds to 450 pounds )."}, {"viet": "Tôi phải có thời gian để sắp xếp tư tưởng của mình.", "eng": "I must have time to order my thoughts."}, {"viet": "Tôi nhất quyết đối phó với những kẻ buộc tội mình.", "eng": "I nerved myself to face my accusers."}, {"viet": "Tôi đã tình cờ nghe anh ấy nói anh ấy sắp đi Pháp.", "eng": "I overheard him say he was going to France."}, {"viet": "Tôi hoàn toàn đồng ý với ông, ông bạn già ạ.", "eng": "I quite agree with you, old chap."}, {"viet": "Tôi đề cập đặc biệt đến những người thường trú để phân biệt với những khách tạm trú.", "eng": "I refer specially to permanent residents, in contradistinction to temporary visitors."}, {"viet": "Tôi trông thấy một bia mộ có ghi năm 1602.", "eng": "I saw a tombstone bearing the date 1602."}, {"viet": "Tôi sẽ trực tiếp chú ý đến vấn đề.", "eng": "I shall give the matter my personal attention."}, {"viet": "Tôi đã sớm bỏ mọi ý nghĩ về được tới nhà trước khi trời tối.", "eng": "I soon renounced all thought of getting home before dark."}, {"viet": "Tôi xin thề trước Thượng Đế... trước tất cả những gì thân yêu đối với tôi... v. v.", "eng": "I swear by Almighty God... by all that I hold dear... etc."}, {"viet": "Tôi nghĩ là tôi đã nhìn thấy một bưu điện ở quanh đâu đây.", "eng": "I think I saw a post office somewhere hereabouts."}, {"viet": "Tôi nghĩ có lẽ chúng ta đã lên nhầm xe lửa.", "eng": "I think we might have taken the wrong train."}, {"viet": "Tôi đã nói với anh ta là có khoảng sáu ngàn người trên tàu.", "eng": "I told you there are about six thousand people on board."}, {"viet": "Không biết tôi có thể mướn một hướng dẫn viên không?", "eng": "I understand we can rent a guide?"}, {"viet": "Tôi muốn bữa điểm tâm đưa vào lúc 9 giờ.", "eng": "I want my breakfast sent up at 9 o'clock."}, {"viet": "Tôi muốn dạy cho nó một bài học, bà ta nói với một sự hung hăng đột ngột.", "eng": "I want to teach him a lesson, she said with sudden belligerence."}, {"viet": "Tôi ghê tởm thấy nó cư xử như thế.", "eng": "I was disgusted that he should behave in that way."}, {"viet": "Tôi đang trên đường tới đây bằng xe buýt thì còi báo động nổi lên.", "eng": "I was on my way here in the bus when the alarm sounded."}, {"viet": "Tôi cũng đã nghĩ như vậy.", "eng": "I was thinking the same thing."}, {"viet": "Bây giờ tôi sẽ trả lời những câu hỏi của anh.", "eng": "I will deal with your question now."}, {"viet": "Tôi sẽ không trả lời điện thoại nếu cuộc gọi đó là của người tôi không quen biết.", "eng": "I won't answer my phone if the call is from someone I don't know."}, {"viet": "Tôi làm việc bán thời gian, thời gian còn lại tôi trông nom con cái.", "eng": "I work part time and look after my children the rest of the time."}, {"viet": "Tôi muốn gửi một ít hoa.", "eng": "I would like to send some flowers."}, {"viet": "Các tảng băng trôi là mối đe doạ đối với tàu thuyền đi trong vùng này.", "eng": "Ice-floes are a threat to shipping in the area."}, {"viet": "Nếu đổi kênh bây giờ thì em đã bỏ mất phần kết cuộc của bộ phim.", "eng": "If I change the channel now I'll miss the end."}, {"viet": "Nếu chị ấy đã sống 5 năm ở Paris, làm sao lại không nói được một từ tiếng Pháp?", "eng": "If she spent five years in Paris, how come she can't speak a word of French?"}, {"viet": "Nếu chúng ta không thể giữ đúng tiến độ, chúng ta sẽ bị rắc rối to đấy.", "eng": "If we can't keep to the schedule, we'll be in trouble."}, {"viet": "Nếu cậu không biết bơi, đừng ra chỗ nước sâu quá.", "eng": "If you can't swim, don't get out of your depth."}, {"viet": "Nếu cô còn một chỗ trống, làm ơn cho tôi biết.", "eng": "If you have a vacant seat, please let me know."}, {"viet": "Nếu bạn chạm vào cái máy này, bạn sẽ cảm thấy nó rung lên.", "eng": "If you touch the machine, you'll feel the vibration."}, {"viet": "Trong'Nữ hoàng Elizabeth, the Queen Mother'thì'the Queen Mother'là đồng vị ngữ của'Nữ hoàng Elizabeth'.", "eng": "In'Queen Elizabeth, the Queen Mother','the Queen Mother'is in apposition to'Queen Elizabeth'."}, {"viet": "Ở các nơi trên thế giới, nhiều động vật được đánh giá dựa vào việc cung cấp sữa.", "eng": "In different parts of the world different animals are valued for the milk they give."}, {"viet": "Tại nhiều nơi trên thế giới, lễ Giáng Sinh thường là lúc có băng tuyết.", "eng": "In many parts of the world Christmas is likely to be a time of ice and snow."}, {"viet": "Trong khi ông giám đốc vắng mặt, tôi sẽ đảm nhận công việc.", "eng": "In the absence of the manager I shall be in charge."}, {"viet": "Ở Hoa Kỳ một người phải ở một độ tuổi nhất định nào đó ( 21 tuổi ở hầu hết các bang ), mới có quyền đi bầu và như vậy mới được tham gia vào chính quyền.", "eng": "In the United States a person must reach a certain age ( 21 years in most States ) to be able to vote and thus to take part in the government."}, {"viet": "Nền công nghiệp đang thiếu chuyên môn kỹ thuật.", "eng": "Industry is being starved of technical expertise."}, {"viet": "Lạm phát có phải là triệu chứng của suy thoái kinh tế không?", "eng": "Is inflation symptomatic of economic decline?"}, {"viet": "Có một cửa hàng phục vụ 24/24 giờ ở gần đây phải không?", "eng": "Is there a convenience store around here?"}, {"viet": "Làm việc tình nguyện có phổ biến ở nước bạn không?", "eng": "Is volunteering popular in your country?"}, {"viet": "Đó là điều bí mật, nên đừng có ba hoa gì về nó.", "eng": "It's a secret, so don't go shooting your mouth off about it."}, {"viet": "Các cải cách có cải thiện tình thế hay không đó là điều còn phải tranh cãi.", "eng": "It's debatable whether or not the reforms have improved conditions."}, {"viet": "Thật không thể nào trò chuyện với tất cả những tiếng động ở hậu trường như thế này.", "eng": "It's impossible to carry on a conversation with all this noise in the background."}, {"viet": "Ăn quá nhiều thịt là không tốt.", "eng": "It's not good for you to eat too much meat."}, {"viet": "Ở đâu đó trong bếp ấy.", "eng": "It's somewhere or other in the kitchen."}, {"viet": "Rất có thể cô ta sẽ gọi điện thoại cho tôi tối nay.", "eng": "It's very likely that she'll ring me tonight."}, {"viet": "Nó rơi xuống cát ướt rồi chìm ngập trong đó.", "eng": "It fell onto the wet sand, then sank."}, {"viet": "Khó xác định được số lượng giá trị của cuộc thám hiểm vũ trụ.", "eng": "It is difficult to quantify the value of space exploration."}, {"viet": "Có thể suy ra hai kết luận hoàn toàn trái ngược nhau từ loạt sự việc này.", "eng": "It is possible to infer two completely opposite conclusions from this set of facts."}, {"viet": "Có thể trời lạnh nhưng không mưa-thế cũng may chán rồi.", "eng": "It may be cold but it's not raining-let's be thankful for small mercies."}, {"viet": "Tôi cho là trời sắp mưa.", "eng": "It's going to rain, I think."}, {"viet": "Từ chối một đề nghị hào phóng như vậy thì xem ra cũng là xấu tính.", "eng": "It seems churlish to refuse such a generous offer."}, {"viet": "Hoá ra hắn đã bịa toàn bộ câu chuyện.", "eng": "It turned out that he had fabricated the whole story."}, {"viet": "Khó phán đoán được người ta phản ứng ra sao.", "eng": "It was difficult to gauge how people would respond."}, {"viet": "Anh tôi mất như vậy là cách đây bảy năm.", "eng": "It was seven years ago that my brother died."}, {"viet": "Phải nung mấy đợt nữa mới hết tất cả các lọ để trên những giá đó.", "eng": "It will take several firings to clear the shelves of all these pots."}, {"viet": "Jane thì đáng tin cậy, nhưng về Jim thì tôi không chắc chắn.", "eng": "Jane is reliable, but I'm not sure about Jim."}, {"viet": "Hãy tham gia cùng chúng tôi uống mừng trong quán.", "eng": "Join us for a celebratory drink in the bar."}, {"viet": "Để bánh quy trong hộp để được giòn.", "eng": "Keep the biscuit in a tin so that they stay crisp."}, {"viet": "Chúng ta hãy đi ăn ở nhà hàng tối nay, để thay đổi.", "eng": "Let's eat out tonight, by way of a change."}, {"viet": "Chúng ta hãy nói về vị trí của mọi thứ đi.", "eng": "Let's talk about where everything is."}, {"viet": "Nhiều từ nước ngoài đã trở thành từ của tiếng Anh.", "eng": "Many foreign words have passed into the English language."}, {"viet": "Margarine có thể phết được ngay khi lấy ở tủ lạnh ra.", "eng": "Margarine that spreads straight from the fridge."}, {"viet": "Xin cho em một tách trà nữa?", "eng": "May I have another cup of tea?"}, {"viet": "Có lẽ bạn nên thử mặc nó màu sậm hơn.", "eng": "Maybe you should try it in a darker color."}, {"viet": "Hầu hết mọi người không thích whisky lúc đầu-đây là một thứ đồ uống dần dần người ta mới thích.", "eng": "Most people don't like whisky at first-it's an acquired taste."}, {"viet": "Nó đã ngồi vào chỗ của tôi làm cho tôi rất tức giận.", "eng": "Much to my indignation, he sat down in my seat."}, {"viet": "Ông phó của tôi đã xin từ chức, cho nên ngay bây giờ tôi có nhiều việc phải bận tâm đến.", "eng": "My deputy has resigned, so I've got a lot on my mind just now."}, {"viet": "Tôi há hốc mồm khi thấy bữa ăn hết quá nhiều tiền.", "eng": "My jaw dropped when I saw how much the meal had cost."}, {"viet": "Phòng của tôi quá gần thang máy.", "eng": "My room is too close to the elevator."}, {"viet": "Người Mỹ bản địa từ các nơi khác nhau của đất nước tụ họp và thảo luận các hành động hoặc giải pháp khả thi.", "eng": "Native Americans from different parts of the country come together and discuss possible actions or solutions."}, {"viet": "Nick và Alison rất hợp nhau.", "eng": "Nick and Alison are made for each other."}, {"viet": "Không còn bị vướng vào các trách nhiệm là chủ tịch nữa, ông ta có thể nói những gì ông ta muốn nói.", "eng": "No longer trammelled by his responsibilities as chairman, he could say what he wished."}, {"viet": "Bây giờ hãy gài lên phần dẫn động và đạp lên bàn đạp ga.", "eng": "Now, you put the car in drive, and step on the gas pedal."}, {"viet": "Một lệnh của toà án cho phép một người đàn ông ly hôn đến thăm con cái của mình.", "eng": "Obtain a court order to allow a divorced man to visit his children."}, {"viet": "Anh ta nói nịnh Ồ hãy tiếp tục đi nào.", "eng": "Oh go on, please he wheedled."}, {"viet": "Đối với vấn đề thị trường Châu Âu có ít ý kiến bất đồng.", "eng": "On the issue of the single market, there was a little dissension."}, {"viet": "Một trong những bị cáo ở vụ âm mưu nổi tiếng.", "eng": "One of the accused in a notorious conspiracy case."}, {"viet": "Sự chú ý của chúng tôi bị thu hút trong suốt bài nói dài của anh ấy.", "eng": "Our attention was held throughout his long talk."}, {"viet": "Tầm tác xạ súng của chúng ta thua tầm súng của chiến hạm địch.", "eng": "Our guns were outranged by those of the enemy's cruiser."}, {"viet": "Nguyên vật liệu của chúng tôi là dầu và thành phẩm của chúng tôi là tất nylon.", "eng": "Our raw material is oil, and our end product is nylon stockings."}, {"viet": "Do thái độ không khoan nhượng của họ chúng ta đã không thể đạt tới một thoả thuận.", "eng": "Owing to their intransigent attitude we were unable to reach an agreement."}, {"viet": "Việc thanh toán bằng chi phiếu dễ dàng vượt xa sự giao dịch bằng tiền mặt.", "eng": "Payments by check easily outnumber cash transaction."}, {"viet": "Thức ăn dễ hư như bơ, sữa, trái cây và cá.", "eng": "Perishable goods such as butter, milk, fruit, and fish."}, {"viet": "Cảnh sát chĩa súng phun nước vào đám người nổi loạn.", "eng": "Police turned water-cannon on the rioters."}, {"viet": "Roy sẽ chỉ có một mình.", "eng": "Roy will be on his own."}, {"viet": "Nhiều khấu trừ được thực hiện trong thu nhập của bạn.", "eng": "Several deductions were made from your income."}, {"viet": "Bà ta là một người lãnh đạo có khả năng và luôn được các đồng nghiệp coi như vậy.", "eng": "She's a competent leader and has always been regarded as such by her colleagues."}, {"viet": "Bà ấy đã dùng thuốc chống suy nhược thần kinh từ khi đứa con nhỏ của bà ấy chết.", "eng": "She's been on anti-depressants since her baby died."}, {"viet": "Cô ta mê mẩn cái mã hấp dẫn của hắn ta.", "eng": "She's infatuated by his good looks."}, {"viet": "Con nhỏ đó đã phản bội chúng ta-Thầy hiệu trưởng đến rồi kìa!", "eng": "She's ratted on us-here comes the head teacher!"}, {"viet": "Cô ấy được biệt phái về Bộ Quốc Phòng.", "eng": "She's on attachment to the Ministry of Defence."}, {"viet": "Bà ấy một mực từ chối ý định thoả hiệp.", "eng": "She balked at the very idea of compromise."}, {"viet": "Bà ta tuyên bố có khả năng cảm nhận được năng lực siêu nhiên và có thể tiên đoán tương lai.", "eng": "She claimed to be psychic and to be able to foretell the future."}, {"viet": "Cô ta đã quyết định là thôi không làm việc cho những người khác.", "eng": "She decided she was finished with working for others."}, {"viet": "Bà ta lọc hết nước qua một cái rây.", "eng": "She drained the water out through a sieve."}, {"viet": "Cô ta cảm thấy chân yếu.", "eng": "She felt weak in the legs."}, {"viet": "Cô ta ghi nhận liền những tin tức tôi thông báo cho cô.", "eng": "She gobbled up all the news I told her."}, {"viet": "Bà ấy bị bệnh bại liệt từ nhỏ và đã sống cuộc đời còn lại trên chiếc xe lăn.", "eng": "She had polio as a child and spent the rest of her life in a wheelchair."}, {"viet": "Cô ta có bữa sáng và bữa tối nhưng không ăn gì giữa hai bữa đó.", "eng": "She has breakfast and supper but doesn't eat anything in between."}, {"viet": "Bà ấy tiếp dân vào 6 giờ chiều thứ sáu.", "eng": "She holds her surgery on Fridays at 6pm."}, {"viet": "Cô ấy là con gái duy nhất trong gia đình, tất cả những người con khác là con trai.", "eng": "She is only girl in her family, all the other children are boys."}, {"viet": "Ngay từ đầu cô ta đã biết sự thật và đã cười thầm chúng ta.", "eng": "She knew the truth all along and was laughing up her sleeve at us."}, {"viet": "Cô ta quay lại nhìn khi nghe có tiếng động đằng sau.", "eng": "She looked round when she heard the noise behind her."}, {"viet": "Bà ấy dọn về London tháng Năm vừa qua và từ đó đã kiếm được một việc làm tại một toà báo.", "eng": "She moved to London last May and has since got a job on a newspaper."}, {"viet": "Cô ấy nhắc điện thoại và quay số của ông ấy.", "eng": "She picked up the telephone and dialed his number."}, {"viet": "Cô ta xác nhận lại rằng cô ta sẵn sàng giúp đỡ.", "eng": "She reaffirmed that she was prepared to help."}, {"viet": "Cô ta luôn luôn bị rơi vào thế kẹt.", "eng": "She's always getting into scrapes."}, {"viet": "Nàng dễ phật ý lắm đấy.", "eng": "She's quick to take offence."}, {"viet": "Cô ta theo chúng nó chạy nhanh xuống đường.", "eng": "She scooted down the road after them."}, {"viet": "Cô ta đã ký bức thư với thiện ý, mà không nhận thức được những hệ quả của nó.", "eng": "She signed the letter in good faith, not realizing its implications."}, {"viet": "Cô ấy tự hạn chế mình ăn thức ăn để bọn trẻ có đủ ăn.", "eng": "She stinted herself of food in order to let the children have enough."}, {"viet": "Cô ta cho rằng những bộ ngực rậm lông là một thứ kích thích!", "eng": "She thinks hairy chests are a turn-on!"}, {"viet": "Cô ta coi khinh đề nghị.", "eng": "She turns up her nose at the suggestion."}, {"viet": "Nàng là người đàn bà đẹp và duyên dáng đến nỗi nàng dễ dàng xỏ mũi đàn ông.", "eng": "She was a woman of such beauty and charm that men were putty in her hands."}, {"viet": "Cô ta bị tật nói lắp suốt đời.", "eng": "She was cursed with a stammer all her life."}, {"viet": "Nàng hạnh phúc ngất ngây khi chàng hôn nàng.", "eng": "She was in heaven when he kissed her."}, {"viet": "Bà ta đã bị đem ra tòa xử về tội lừa đảo.", "eng": "She was put on trial for fraud."}, {"viet": "Chị ấy mệt mỏi vì phải trả lời các câu hỏi trẻ con ấy.", "eng": "She was tired of answering these puerile questions."}, {"viet": "Cô ta tiến lên mấy thước, đột ngột dừng và quay lại.", "eng": "She went forward a few yards, checked and turned back."}, {"viet": "Cô ấy thắng nhờ bộ thùng cao nhất.", "eng": "She won with a royal flush."}, {"viet": "Làm một tiếp viên trên chiếc tàu khách xuyên Đại Tây Dương.", "eng": "Ship as a steward on an Atlantic liner."}, {"viet": "Ký hợp đồng phục vụ quân đội năm năm.", "eng": "Sign on for five years in the army."}, {"viet": "Ngồi ở ngoài trời dưới ánh nắng ấm áp.", "eng": "Sitting out in the warm sunshine."}, {"viet": "Bị day dứt vì ăn năn về sự độc ác của mình.", "eng": "Smitten with remorse for one's cruelty."}, {"viet": "Té ra mưu mẹo của anh ta là như thế!", "eng": "So that's his little game!"}, {"viet": "Một số bệnh ung thư được chữa trị bằng phóng xạ.", "eng": "Some cancers are treated by radiation therapy."}, {"viet": "Một vài người buồn vì xem một câu chuyện buồn.", "eng": "Some of us are sad because we watched a sad story."}, {"viet": "Một số người nói là anh ta đã viết một cuốn sách cố tình khiêu khích.", "eng": "Some would say he wrote a deliberately provocative book."}, {"viet": "Xin lỗi, bây giờ tôi sẽ đưa ông một cái.", "eng": "Sorry, I will give one to you now."}, {"viet": "Hãy xịt hồ bột lên các cổ áo sơ mi trước khi là chúng.", "eng": "Spray starch on the shirt collars before ironing them."}, {"viet": "Những hình ảnh rập khuôn của phụ nữ trong các mục quảng cáo.", "eng": "Stereotyped images of women in advertisements."}, {"viet": "Các vựa ngũ cốc thường xuyên bị côn trùng chuột bọ làm thiệt hại, nhất là loại chuột.", "eng": "Stores of grain are frequently attacked by pests, especially rats."}, {"viet": "Các chính phủ, thắng lợi, cố gắng liên tiếp.", "eng": "Successive governments, victories, attempts."}, {"viet": "Chăn nuôi trâu bò trong đồng cỏ phía nam vào mùa hè.", "eng": "Summered the herd in the south meadow."}, {"viet": "Quét những mảnh bánh vụn dưới cái thảm vào trong cái hốt rác.", "eng": "Sweep the crumbs under the carpet into the dustpan."}, {"viet": "Đâm ra uống rượu say sưa vì chuyện gia đình.", "eng": "Take to drink because of domestic problems."}, {"viet": "Nói với bà ấy là tôi sẽ gọi lại sau.", "eng": "Tell her I'll call back later."}, {"viet": "Rất cám ơn anh vì đã mời tôi đến thăm nhà.", "eng": "Thank you very much for inviting me over."}, {"viet": "Hãng hàng không đó có độc quyền cho những chuyến bay đi Oslo.", "eng": "That airline has a monopoly on rights to Oslo."}, {"viet": "Phần chủ yếu bền bỉ đó của sự vui tươi không bao giờ tan vỡ.", "eng": "That hard kernel of gaiety that never breaks."}, {"viet": "Nhà máy mới đó làm mất vẻ đẹp của phong cảnh.", "eng": "That new factory is a blot on the landscape."}, {"viet": "Đó chính là điều khiến tôi lo lắng.", "eng": "That's what I'm really worried about."}, {"viet": "Anh phải trả cả thảy 7 bảng 50 xu Anh.", "eng": "That will cost you £ 7.50 in total."}, {"viet": "Phòng kế toán đã hoàn toàn sử dụng máy tính.", "eng": "The accounts section has been completely computerized."}, {"viet": "Mục tiêu của chính sách là bảo vệ hoà bình.", "eng": "The aim of the policy is the preservation of peace."}, {"viet": "Lời công bố đó đến tai chúng tôi do một nguồn gián tiếp.", "eng": "The announcement reached us by a side wind."}, {"viet": "Quân đội đang đe dọa sẽ nắm quyền kiểm soát nếu tình trạng nội loạn còn tiếp diễn.", "eng": "The army are threatening to take over if civil unrest continues."}, {"viet": "Việc đạt được những tham vọng của cô ấy vẫn còn là một ước mơ.", "eng": "The attainment of her ambitions was still a dream."}, {"viet": "Đứa bé đã bị giật ra khỏi xe đẩy.", "eng": "The baby had been snatched from its pram."}, {"viet": "Ngân hàng có chi nhánh khắp nơi trên đất nước.", "eng": "The bank has branches in all parts of the country."}, {"viet": "Các cây đà đó chịu toàn bộ sức nặng của những bức tường và mái nhà.", "eng": "The beams receive the full weight of the walls and roof."}, {"viet": "Người quan sát chim lia ống nhòm qua các cây.", "eng": "The bird-watcher raked the trees with his binoculars."}, {"viet": "Thuyền sẽ bị chìm nếu ta không tát nước ra.", "eng": "The boat will sink unless we bail ( out )."}, {"viet": "Các cuốn sách đó được mã hóa bằng màu dành cho phương pháp tự học.", "eng": "The books are colour-coded for self-access."}, {"viet": "Bọn con trai đi cắm trại nghỉ mát ở Hy Lạp vào năm ngoái.", "eng": "The boys went camping in Greek last year."}, {"viet": "Ngôi nhà có một nền móng bằng sa thạch.", "eng": "The building has a sandstone foundation."}, {"viet": "Các cuộc thương lượng kinh doanh sẽ được tổ chức vào ngày mốt.", "eng": "The business negotiations will be held the day after tomorrow."}, {"viet": "Chiếc xe ô tô tắt máy ngay tại ngã tư.", "eng": "The car conked out at the crossroads."}, {"viet": "Viên quản gia đốt lò sưởi mỗi ngày hai lần.", "eng": "The caretaker stokes up twice a day."}, {"viet": "Các thần tượng phim ảnh thời niên thiếu của ai.", "eng": "The celluloid heroes of one's youth."}, {"viet": "Xe buýt chạy đường dài chỉ có mỗi một điều hấp dẫn là giá rẻ.", "eng": "The cheapness of coach travel is its only recommendation."}, {"viet": "Đứa bé đó gào thét sỉ nhục chúng tôi.", "eng": "The child screeched insults at us."}, {"viet": "Trẻ con thích đi chơi vườn bách thú.", "eng": "The children enjoy going to the zoo."}, {"viet": "Trẻ em mê mẩn với những đồ chơi trong tủ kính cửa hàng.", "eng": "The children were fascinated by the toys in the shop window."}, {"viet": "Thành phố đó đang thiếu đất xây dựng.", "eng": "The city suffers from a shortage of building land."}, {"viet": "Câu lạc bộ đứng trước sự phá sản cho đến khi một thương gia giàu có ở địa phương cứu giúp về tài chính.", "eng": "The club faced bankruptcy until a wealthy local businessman bailed them out."}, {"viet": "Màu sắc dùng trông tẻ và đơn điệu.", "eng": "The colours used are flat and unvaried."}, {"viet": "Công ty thành lập một hệ thống mới để giải quyết những vấn đề khiếu nại.", "eng": "The company has established a new system for dealing with complaints."}, {"viet": "Buổi hoà nhạc gồm có tác phẩm của Mozart và của các nhạc sĩ khác.", "eng": "The concert included works by Mozart et al."}, {"viet": "Qui ước cho phép phụ nữ được quyền hút thuốc lá tại nơi công cộng ở Châu Âu.", "eng": "The convention allows women to smoke in public in Europe."}, {"viet": "Nước này phải nhập khẩu phần lớn nguyên liệu.", "eng": "The country has to import most of its raw materials."}, {"viet": "Loại ưu tú trong số những người tốt nghiệp đại học năm nay sẽ nhận được những công việc có lương cao.", "eng": "The cream of this year's graduates will get high-paid jobs."}, {"viet": "Những đám đông tụ tập quanh lâu đài.", "eng": "The crowds concentrated round the palace."}, {"viet": "Con tàu hỏng nghiêng hẳn sang một bên.", "eng": "The damaged vessel was listing badly."}, {"viet": "Gia đình bị cáo có mặt ở phiên toà.", "eng": "The defendant's family were present at the hearing."}, {"viet": "Các cảnh sát điều tra mặc thường phục.", "eng": "The detectives were in plain clothes."}, {"viet": "Căn bệnh gây ra những đốm màu trên mặt.", "eng": "The disease causes patches of pigmentation on the face."}, {"viet": "Ông bác sĩ len qua đám đông để đến với người bị thương.", "eng": "The doctor pushed through the crowd to get to the injured man."}, {"viet": "Con chó cắn vào chân tôi.", "eng": "The dog nipped me in the leg."}, {"viet": "Chiếc áo dài đắt tiền, nhưng dù sao tôi vẫn mua nó.", "eng": "The dress costs a lot of money, but I bought it anyway."}, {"viet": "Trái đất quay quanh mặt trời mất một năm.", "eng": "The earth takes a year to make a circuit of the sun."}, {"viet": "Tòa nhà Empire State là một điểm mốc nổi tiếng trên đường chân trời New York.", "eng": "The Empire State Building is a famous landmark on the New York skyline."}, {"viet": "Việc coi sự giàu có tương đương với hạnh phúc có thể nguy hiểm.", "eng": "The equation of wealth with happiness can be dangerous."}, {"viet": "Vận động viên chạy kiệt sức đang thở hổn hển để lấy hơi.", "eng": "The exhausted runner was gasping for air."}, {"viet": "Trang trại thất bại đưa họ đến tình trạng cực kỳ nghèo khổ.", "eng": "The failure of their farm reduced them to beggary."}, {"viet": "Thái độ trong buổi họp là chống lại lời đề nghị đó.", "eng": "The feeling of the meeting was against the proposal."}, {"viet": "Phim kể về một câu chuyện quen thuộc về tình yêu tay ba.", "eng": "The film tells a familiar story about an eternal triangle."}, {"viet": "Công ty rất sính việc tổ chức những cuộc vận động quảng cáo độc đáo.", "eng": "The firm is big on extravagant promotion drives."}, {"viet": "Cá bắt đầu có mùi hôi.", "eng": "The fish has begun to smell."}, {"viet": "Mùa bóng đá, sân khấu, nhạc kịch.", "eng": "The football, theatre, opera, etc season."}, {"viet": "Phụ cấp ngoài của công việc này gồm có một chiếc ô tô và bảo hiểm sức khoẻ miễn phí.", "eng": "The fringe benefits of this job include a car and free health insurance."}, {"viet": "Những cây thích to được trồng bên sườn bắc của khu vườn.", "eng": "The garden is flanked to the north with large maple trees."}, {"viet": "Cô gái đang nắm lấy tay cha.", "eng": "The girl was holding her father's hand."}, {"viet": "Vụ bác bỏ của chính phủ về những cuộc hợp nhất các công ty có quy mô lớn.", "eng": "The government's veto on large scale company mergers."}, {"viet": "Chính phủ đang tiến hành các cuộc đàm phán căng thẳng với các công đoàn.", "eng": "The Government is holding crisis talks with the unions."}, {"viet": "Sự tinh tế dần trong sở thích âm nhạc của cô ấy.", "eng": "The gradual refinement of her taste in music."}, {"viet": "Việc tuyển dụng công nhân chui đang tăng dần làm đau đầu chính phủ.", "eng": "The growing black economy is beginning to worry the Government."}, {"viet": "Căn phòng vang dội tiếng cười, tiếng huýt sáo.", "eng": "The hall resounded with laughter and whistles."}, {"viet": "Những nhân vật trong tiểu thuyết lãng mạn được coi là người hùng tài ba xuất chúng.", "eng": "The heroes of'romantic fictions are supposed to be strong and masterful."}, {"viet": "Các con ngựa phi thành một hàng kéo dài về đích cuộc đua.", "eng": "The horses were strung out towards the end of the race."}, {"viet": "Ngôi nhà đó trong tình trạng quá tồi tệ.", "eng": "The house is in a shocking state of repair."}, {"viet": "Lớp băng tan ra khi mặt trời chiếu vào.", "eng": "The ice melted when the sun shone on it."}, {"viet": "Tính đặc trưng trong phong cách của ai.", "eng": "The individuality of somebody's style."}, {"viet": "Tác động qua lại giữa lòng hào hiệp và tính tư lợi ảnh hưởng tới hành động của con người.", "eng": "The interplay between generosity and self-interest which influences people's actions."}, {"viet": "Công việc đòi hỏi phải tỉnh táo và cảnh giác liên tục.", "eng": "The job requires constant alertness and vigilance."}, {"viet": "Chìa khoá này tra không vừa ổ khoá.", "eng": "The key doesn't fit the lock."}, {"viet": "Vùng đất gần biên giới là vùng tranh chấp.", "eng": "The land near the border is disputed ground."}, {"viet": "Vị luật sư đã hết hi vọng thu nhanh số tiền nợ.", "eng": "The lawyer scuttled his hopes of collecting the debt quickly."}, {"viet": "Thư viện đòi trả lại tất cả các sách mượn quá hạn.", "eng": "The library called in all overdue books."}, {"viet": "Các nhà máy thép địa phương đang hoạt động giảm dần và chắc phải đóng cửa trong vòng ba năm.", "eng": "The local steelworks is being run down and is likely to close within three years."}, {"viet": "Cái máy đó vẫn còn trong thời gian bảo hành.", "eng": "The machine is still under warranty."}, {"viet": "Người đàn ông sống ở ngôi nhà kia là bác tôi.", "eng": "The man who lives in that house is my uncle."}, {"viet": "Vấn đề ấy coi như đã được giải quyết.", "eng": "The matter is as good as settled."}, {"viet": "Những màu sắc dìu dịu của bầu trời bình minh.", "eng": "The mellow colours of the dawn sky."}, {"viet": "Ông bộ trưởng đồng ý cho các nhà báo phỏng vấn.", "eng": "The minister granted journalists an interview."}, {"viet": "Cơ cấu bất di bất dịch của nhà nước.", "eng": "The monolithic structure of the state."}, {"viet": "Những người leo núi thấy khó có thể định hướng được trong sương mù.", "eng": "The mountaineers found it difficult to orientate themselves in the fog."}, {"viet": "Cong viên Quốc gia Yellowstone không chỉ nổi tiếng về phong cảnh thu hút và động vật hoang dã, mà còn nổi tiếng về 200 suối nước nóng thu hút hàng ngàn du khách từ các quốc gia khác nhau trên thế giới.", "eng": "The National Yellowstone Park is not only famous for its scenic attraction and wild animals, but also for its 200 geysers which attract thousands of visitors from various countries of the world."}, {"viet": "Chính phủ mới đã sung công bất động sản của ông ta để sử dụng cho những mục đích quân sự.", "eng": "The new government expropriated his estate for military purposes."}, {"viet": "Loại xe du lịch kiểu mới được giới thiệu với công chúng bằng cách quảng cáo thật rùm beng.", "eng": "The new sedan was introduced to the public with much hoopla."}, {"viet": "Báo chí đã liên kết tên ông ta với tên bà ta.", "eng": "The newspapers have linked his name with hers."}, {"viet": "Sự mới lạ của môi trường xung quanh hắn chẳng bao lâu trở thành quen thuộc.", "eng": "The novelty of his surroundings soon wore off."}, {"viet": "Thư từ của văn phòng được mở ra vào buổi sáng.", "eng": "The office mail is opened in the morning."}, {"viet": "Tấm ảnh cũ gợi lại nhiều kỷ niệm.", "eng": "The old photograph brought back many memories."}, {"viet": "Khi chúng tôi bước vào hội trường thì dàn nhạc đang so dây.", "eng": "The orchestra were tuning up as we entered the hall."}, {"viet": "Bức tranh được bán đấu giá cho một nhà buôn Mỹ giá 5.000 bảng Anh.", "eng": "The painting was knocked down to an American dealer for £ 5,000."}, {"viet": "Bản kê khai hành khách trên một tàu thủy.", "eng": "The passenger manifest of a ship."}, {"viet": "Nhân dân đã bị một chế độ tàn bạo áp bức nhiều năm.", "eng": "The people have been kept down for years by a brutal régime."}, {"viet": "Những bức ảnh mà anh đang xem là do anh tôi chụp.", "eng": "The photographs that you're looking at were taken by my brother."}, {"viet": "Nơi đó được đánh một dấu chéo trên bản đồ.", "eng": "The place is marked on the map with a cross."}, {"viet": "Người ta nghe bác thợ cày lội bì bõm trong ruộng lầy.", "eng": "The plashy ploughman was heard in the muddy field."}, {"viet": "Người săn bắn trộm vội vàng tháo chạy khi hắn ta thấy cảnh sát đến.", "eng": "The poacher beat a hasty retreat when he saw the police coming."}, {"viet": "Cảnh sát đã tự bán rẻ mình cho bọn trùm băng.", "eng": "The police had sold themselves to the gang leaders."}, {"viet": "Cảnh sát canh chừng ở các quán rượu nơi được biết là hắn thường hay lui tới.", "eng": "The police watched the bars which he was known to resort."}, {"viet": "Suất ăn này nhiều quá nên anh không thể ăn hết.", "eng": "The portion was very big so I couldn't eat it all."}, {"viet": "Tình trạng hiện nay không thể để như thế mãi được.", "eng": "The present state of affairs cannot be allowed to go on."}, {"viet": "Sự căng thẳng của đời sống thành phố đã buộc ông ta phải dọn về ở nông thôn.", "eng": "The pressures of city life forced him to move to the country."}, {"viet": "Hiệu trưởng trường trung học St James.", "eng": "The Principal of St James'College."}, {"viet": "Tích số của 4 và 10 là 40.", "eng": "The product of 4 and 10 is 40."}, {"viet": "Triển vọng gặp Tổng thống hoàn toàn là không hy vọng.", "eng": "The prospect of meeting the President is quite daunting."}, {"viet": "Vụ cãi lộn xuất phát từ sự kình địch giữa hai gia đình.", "eng": "The quarrel originated in rivalry between the two families."}, {"viet": "Nước mưa đã thấm qua chiếc áo mưa của ông ta.", "eng": "The rain had soaked through his coat."}, {"viet": "Những tập sách về tuyển mộ đang trở nên hấp dẫn hơn.", "eng": "The recruiting brochures are getting sexier."}, {"viet": "Bản báo cáo đã chỉ ra tình trạng rối rắm lớn lao do quan liêu.", "eng": "The report revealed a major bureaucratic muddle."}, {"viet": "Cuộc cách mạng đưa đất nước vào con đường dân chủ.", "eng": "The revolution set the country on the road to democracy."}, {"viet": "Con đường dốc ngược nhiều dặm.", "eng": "The road climbs steeply for several miles."}, {"viet": "Căn phòng được chuyển đổi từ một nhà bếp thành một phòng vệ sinh.", "eng": "The room was converted from a kitchen to a lavatory."}, {"viet": "Hộp ký gửi an toàn đó cho ký gửi với lệ phí 300 nhân dân tệ một năm.", "eng": "The safe deposit box rents at 300 Yuan a year."}, {"viet": "Kế hoạch nói cuốn sách phải mất một năm để hoàn thành.", "eng": "The schedule shows the book will take a year to finish."}, {"viet": "Tầng hai là một vựa cỏ khô.", "eng": "The second floor is a hayloft."}, {"viet": "Bóng mát di chuyển theo mặt trời.", "eng": "The shadow moves with the sun."}, {"viet": "Con tàu đã rời Lisbon được bốn ngày.", "eng": "The ship was four days out from Lisbon."}, {"viet": "Tính uỷ mị bệnh hoạn của một cuốn tiểu thuyết lãng mạn.", "eng": "The sickly sentimentality of a romantic novel."}, {"viet": "Trời tối sầm lại vì cơn dông sắp tới.", "eng": "The sky darkened as the storm approached."}, {"viet": "Ghế trường kỷ cũng có thể dùng làm giường.", "eng": "The sofa can also function as a bed."}, {"viet": "Những bang ở phía Nam đã ly khai Liên bang vào năm 1860-61.", "eng": "The Southern States which seceded from the Union in 1860-61."}, {"viet": "Những phần dưới của con sóc có màu nhạt hơn.", "eng": "The squirrel's underpart are lighter in colour."}, {"viet": "Viên đá đã gây ra một vết lõm trên nóc chiếc xe ô tô của tôi.", "eng": "The stone made a dent in the roof of my car."}, {"viet": "Kết cấu khung đã đổ sụp trong những cơn gió mạnh.", "eng": "The structure had keeled over in the high winds."}, {"viet": "Những khoảng thời gian hứa hẹn có nắng với chúng tôi thật là ít và thất thường.", "eng": "The sunny intervals we were promised have been few and far between."}, {"viet": "Các cố gắng của thầy giáo nhằm làm sáng tỏ hơn đã thất bại, tôi vẫn lơ mơ như trước đây.", "eng": "The teacher's attempts at enlightenment failed, I remained as confused as before."}, {"viet": "Đội đã ở tình trạng sung sức nhất trong suốt cả giải thi đấu.", "eng": "The team were on excellent form throughout the whole competition."}, {"viet": "Sương mù dày đặc đã gây ra nhiều vụ đâm xe tệ hại trên đường cao tốc.", "eng": "The thick fog has caused several bad pile-ups on the motorway."}, {"viet": "Thời kỳ mà chúng ta gọi là Trung Cổ tồn tại khoảng 1000 năm.", "eng": "The time we call the Middle Ages lasted for 1,000 years."}, {"viet": "Xe cộ nối đuôi nhau suốt con đường tới trung tâm thành phố.", "eng": "The traffic was tailing back all the way to the city centre."}, {"viet": "Binh lính ( được ) cho đổ bộ một giờ sau đó.", "eng": "The troops ( were ) deplaned an hour later."}, {"viet": "Hai người đang âu yếm nhau trên ghế đá công viên.", "eng": "The two of them were necking on a park bench."}, {"viet": "Vương quốc Anh gồm Anh, xứ Wales, Scotland và bắc Ailen.", "eng": "The United Kingdom comprises England, Wales, Scotland and Northern Ireland."}, {"viet": "Nạn nhân của trò chơi xỏ, trò đùa ác ý, một âm mưu.", "eng": "The victim of a hoax, practical joke, conspiracy, etc."}, {"viet": "Sự cố tình phá hoại một công trình lịch sử.", "eng": "The wanton destruction of a historic building."}, {"viet": "Westin là một trong số nhiều khách sạn sang trọng ở Las Vegas.", "eng": "The Westin is one of the many luxurious hotels in Las Vegas."}, {"viet": "Gió cuốn lên những lá rụng.", "eng": "The wind whirled the fallen leaves."}, {"viet": "Công việc cần phải được hoàn thành trong thời gian hai tháng.", "eng": "The work must be completed within a two-month period."}, {"viet": "Tất cả thanh niêm đều tham gia cuộc chiến rồi.", "eng": "The young men were all in the war."}, {"viet": "Ngày nghỉ ở Pháp của họ đã không đạt những điều mong muốn.", "eng": "Their holiday in France didn't come up to expectations."}, {"viet": "Sự phản đối không nói ra của họ hầu như là sờ sờ đối với cả nhóm.", "eng": "Their unsaid objections were almost palpable to the rest of the group."}, {"viet": "Nếu anh không làm như người ta đã bảo thì mọi việc sẽ không ổn.", "eng": "There'll be ructions if you don't do as you're told."}, {"viet": "Họ chênh lệch nhau sáu tuổi.", "eng": "There's an age difference of six years between them."}, {"viet": "Có một ranh giới rất mong manh giữa cái thực và cái giả.", "eng": "There's often a very fine line between truth and falsehood."}, {"viet": "Giữa London và Brighton có xe lửa chạy thường xuyên.", "eng": "There are frequent trains running between London and Brighton."}, {"viet": "Có một ít bánh nướng chiên giòn Mêhicô trong tủ lạnh.", "eng": "There are some tacos in the fridge."}, {"viet": "Lại có những yêu cầu mới đòi Thủ tướng từ chức.", "eng": "There have been fresh demands for the Prime Minister to resign."}, {"viet": "Có một sự liên quan giữa hút thuốc và ung thư.", "eng": "There is a tie-in between smoking and cancer."}, {"viet": "Tiếng Anh của cậu còn có chỗ phải được nâng lên.", "eng": "There is room for further improvement in your English."}, {"viet": "Rất nhiều người đã đến dự cuộc họp hôm qua.", "eng": "There was a good turn-out at yesterday's meeting."}, {"viet": "Chúng tôi chẳng thể làm gì thêm được nữa, cho nên phải ngồi đấy mà sốt ruột chờ đợi thông báo kết quả.", "eng": "There was nothing more we could do, so we just had to sit and sweat it out until the result was announced."}, {"viet": "Có sự nhẹ nhõm ngầm khi khách khứa đã ra về.", "eng": "There were undertones of relief as the visitors left."}, {"viet": "Những sự kiện này là cơ sở để hiểu được vụ án.", "eng": "These facts are basic to an understanding of the case."}, {"viet": "Những cảnh hoang tàn này là điều gợi nhớ mãnh liệt tới nỗi kinh hoàng của chiến tranh.", "eng": "These ruins are an eloquent reminder of the horrors of war."}, {"viet": "Sắp chiếu thột chương trình về cách làm rượu nho.", "eng": "They're putting on a program about on wine-making."}, {"viet": "Họ báo cho viên tướng biết quân địch đến gần.", "eng": "They apprised the general of the approach of the enemy."}, {"viet": "Họ đảm bảo với tôi là không có điều gì xảy ra với tôi nếu tôi im lặng.", "eng": "They assured me that no harm would come to me if I kept quiet."}, {"viet": "Họ buộc tên tù phải đối chất với những người tố cáo hắn.", "eng": "They confronted the prisoner with his accusers."}, {"viet": "Bọn họ mỗi người đều xuất sắc trong lĩnh vực của mình.", "eng": "They each excel in their respective fields."}, {"viet": "Họ lấy nhau đã lâu nhưng dần dần cách biệt cho đến khi chia tay nhau.", "eng": "They had been married for a long time but gradually drifted apart until they separated."}, {"viet": "Họ làm cho đa dạng văn bản bằng những hình vẽ.", "eng": "They interspersed the text with drawing."}, {"viet": "Chúng có thể có những lá hay cuốn dày.", "eng": "They may have very thick leaves or stems."}, {"viet": "Họ giả vờ làm như hiểu lầm tôi.", "eng": "They pretended to misunderstand me."}, {"viet": "Họ đóng chặt cửa sổ khi cơn bão bắt đầu.", "eng": "They secured the windows when the storm began."}, {"viet": "Họ cho rằng cô ta đã kết hôn với một người không xứng với cô ta.", "eng": "They thought she had married beneath her."}, {"viet": "Họ kinh ngạc trước vẻ đẹp khác thường của bức tranh.", "eng": "They were astonished at the extraordinary beauty of the picture."}, {"viet": "Họ được lệnh cứ trông thấy bọn cướp phá là bắn.", "eng": "They were told to shoot looters on sight."}, {"viet": "Hợp đồng này ràng buộc cả hai bên.", "eng": "This agreement is binding on both parties."}, {"viet": "Kế hoạch phân chia phúc lợi của công ty này đáng làm gương cho các công ty khác noi theo.", "eng": "This Company's profit-sharing scheme set a patter which others followed."}, {"viet": "Cuộc triển lãm này là thánh địa của những người sưu tập tem.", "eng": "This exhibition is a mecca for stamp collectors."}, {"viet": "Đây là một ngày đặc biệt trong lịch sử của đất nước ta.", "eng": "This is a special day in the history of our country."}, {"viet": "Dù đúng hay sai thì đó cũng là ý kiến của tôi.", "eng": "This is what I think, whether right or wrong."}, {"viet": "Chiếc máy mới này được đặc quyền chế tạo bảo vệ.", "eng": "This new machine is protected by patent."}, {"viet": "Chương trình này là nhằm vào các khán giả trẻ.", "eng": "This programme is angled at young viewers."}, {"viet": "Việc này, tất nhiên, chỉ là một sự phỏng đoán.", "eng": "This story, of course, is only a guess."}, {"viet": "Người đàn bà này là một kẻ lừa đảo-bà ta không hề có tí chuyên môn về y tế nào.", "eng": "This woman is a fraud-she has no medical qualifications at all."}, {"viet": "Để thở, nó phải sống trong đất ẩm.", "eng": "To breathe, it must be in moist soil."}, {"viet": "Du khách để lại một vệt rác rưởi ở mọi nơi họ đến.", "eng": "Tourists who leave a trail of litter everywhere they go."}, {"viet": "Tuy nhiên, thường thường chúng ta không dùng chúng với các hình dạng ban đầu, mà cắt gọt chúng theo hình thể mà chúng ta mong muốn.", "eng": "Usually, however, we do not use them in their own shapes, we cut them to make them the shape we want."}, {"viet": "Hãy thận trọng khi nói về đề án, họ không ưa những lời chỉ trích đâu!", "eng": "Watch what you say about the project, they don't like criticism!"}, {"viet": "Chúng ta sẽ thành công nếu mỗi người trong chúng ta làm việc hết sức chăm chỉ.", "eng": "We'll only succeed if every man jack of us works he's hardest."}, {"viet": "Chúng tôi đang tìm kiếm đối tác ở Hoa Kì.", "eng": "We're looking for new contacts in the States."}, {"viet": "Chúng tôi có rất nhiều thứ phải làm, nhưng đóng gói là công việc quan trọng hơn cả trong danh sách đó.", "eng": "We've got a lot of things to do, but packing is top of the list."}, {"viet": "Tất cả chúng ta đều có cách làm ưa thích của chúng ta với một số việc nào đó.", "eng": "We all have our favourite ways of doing certain things."}, {"viet": "Chúng tôi thấy thương những người tị nạn.", "eng": "We are predisposed to pity the refugees."}, {"viet": "Chúng tôi ra đi với cảm tưởng rõ rệt rằng cuộc hôn nhân của họ không suôn sẻ.", "eng": "We came away with the distinct impression that all was not well with their marriage."}, {"viet": "Chúng tôi không thể đảm bảo tàu hoả đến đúng giờ trong thời tiết có sương mù.", "eng": "We cannot guarantee the punctual arrival of trains in foggy weather."}, {"viet": "Mãi đến khi nó đẻ, chúng tôi mới biết nó là chó cái.", "eng": "We didn't know it was a she until it had puppies."}, {"viet": "Cuối cùng chúng tôi đã được tăng lương-điều mong đợi từ lâu.", "eng": "We finally got our long-awaited pay rise."}, {"viet": "Chúng tôi đã dọn bữa ăn tối cho đội và tất cả bọn họ đều ăn uống rất ngon lành.", "eng": "We had prepared supper for the team and they all pitched in."}, {"viet": "Chúng tôi đã tìm ra một cách bảo vệ tiền của chúng tôi.", "eng": "We have found a way of safeguarding our money."}, {"viet": "Chúng tôi nghe thấy tín hiệu khẩn cấp trên rađiô của xe hơi về việc bố cậu Bill.", "eng": "We heard the SOS about Bill's father on the car radio."}, {"viet": "Có thể một tuần nữa chúng tôi sẽ liên lạc với anh.", "eng": "We'll probably get to you in a week."}, {"viet": "Chúng ta phải tìm thị trường mới ( ở nước ngoài ) cho các sản phẩm của chúng ta.", "eng": "We must find new ( foreign ) markets for our products."}, {"viet": "Chúng tôi cần thay thế thiết bị văn phòng đã cũ này.", "eng": "We need to replace some of this ageing office equipment."}, {"viet": "Trung bình chúng tôi nhận được mỗi ngày hai mươi bức thư.", "eng": "We receive twenty letters a day on average."}, {"viet": "Đáng lẽ chúng ta phải mua một cái khoá mới cho cửa trước.", "eng": "We should have bought a new lock for the front door."}, {"viet": "Chúng tôi hy vọng sẽ nhận được tấm séc vào thời điểm sớm nhất ( vào lúc nào thuận tiện nhất cho ông ).", "eng": "We trust to receive a cheque at your earliest convenience."}, {"viet": "Chỉ mới uống hai ly rượu mà chúng tôi đã ngà ngà rồi.", "eng": "We were already merry after only two glasses of wine."}, {"viet": "Chúng tôi tha thẩn cả buổi chiều trên sông.", "eng": "We whiled away the afternoon on the river."}, {"viet": "À, miễn là tôi có thể giúp.", "eng": "Well, as long as I can help."}, {"viet": "À, bây giờ thì tôi đã hiểu rõ lịch sử ngành ngân hàng rồi.", "eng": "Well, now I've got a clear idea of the history of banking."}, {"viet": "Khoảng cách giữa London và Paris là bao nhiêu?", "eng": "What's the distance between London and Paris?"}, {"viet": "Cái gì là tiêu chuẩn để quyết định ai là người giành giải?", "eng": "What are the criteria for deciding who gets the prize?"}, {"viet": "Bạn thích điều gì nhất về nơi này?", "eng": "What did you like best about this place?"}, {"viet": "Chúng ta phải làm gì đây?", "eng": "What have we got to do?"}, {"viet": "Sự phạt cho lái xe nguy hiểm là gì?", "eng": "What is the penalty for dangerous driving?"}, {"viet": "Ông đã buôn bán mặt hàng gì?", "eng": "What line of business have you been handling?"}, {"viet": "Hệ thống nhà nước của nước anh là thế nào?", "eng": "What system of government do you have in your country?"}, {"viet": "Các nhà hàng trong khách sạn mở cửa lúc mấy giờ?", "eng": "When are the restaurants in the hotel open?"}, {"viet": "Khi dù không mở, anh ta nghĩ rằng mình là người không còn hy vọng gì nữa.", "eng": "When his parachute failed he thought he was a goner."}, {"viet": "Khi tốt nghiệp trung học bà được tặng huy chương vàng vì học giỏi.", "eng": "When she finished high school she was given a gold medal for her good work."}, {"viet": "Khi sử dụng bộ đồ ăn bằng bạc, người ta phải bắt đầu bằng từ cái ở bên ngoài, sau đó đến dao và nĩa kế tiếp cho món thứ hai và vân vân.", "eng": "When using the silverware, one should begin from the outside piece, then the next knife and fork for the second course and so on."}, {"viet": "Tôi có thể hỏi thông tin về những chuyến bay chuyển tiếp ở đâu?", "eng": "Where can I get information on connecting flights?"}, {"viet": "Nước nào là lớn nhất, nếu căn cứ theo diện tích đất liền?", "eng": "Which country is the biggest, based on land area?"}, {"viet": "Cho dù anh lấy cái nào anh cũng sẽ được vừa ý.", "eng": "Whichever you may take you will be satisfied."}, {"viet": "Đội bóng đá số một ở Anh năm nay là đội nào?", "eng": "Who is the number one football team in the U. K. this year?"}, {"viet": "Tại sao anh ta lại phải nói vòng vo bằng cái thứ ngôn ngữ rắc rối như vậy?", "eng": "Why does he have to wrap in all up in such complicated language?"}, {"viet": "Liệu một ngày nào đó máy móc sẽ thay thế toàn bộ công nhân nhà máy?", "eng": "Will factory workers be entirely superseded by machines one day?"}, {"viet": "Cháu cất những tờ báo này nhé?", "eng": "Will you put away the newspapers?"}, {"viet": "Đối với người Ý, cách phát âm đúng là một vấn đề.", "eng": "With Italians it's pronunciation that's the problem."}, {"viet": "Các bà mẹ đi làm thường cố gắng bù lại quá đáng việc mình vắng nhà bằng cách chiều chuộng con cái đến hư.", "eng": "Working mothers often over-compensate for their absences from home by spoiling their children."}, {"viet": "Thưa Thủ tướng, ngài có muốn tham gia ý kiến vào điểm này không ạ?", "eng": "Would you like to come in at this point, Prime Minister?"}, {"viet": "Xin vui lòng cung cấp cho chúng tôi 1000 tá mẫu đó được không?", "eng": "Would you please supply us 1,000 dozen of that model?"}, {"viet": "Vâng, nhưng ông sẽ phải điền vào một phiếu mượn và đặt cọc 100 nhân dân tệ.", "eng": "Yes, but you'll have to fill out a rental slip and put a hundred yuan deposit."}, {"viet": "Rồi, khi tôi còn trẻ và lập gia đình lần đầu.", "eng": "Yes, when I was young and first married."}, {"viet": "Anh sẽ phải hàn lỗ rò đó nếu không nó sẽ gây nhiều vấn đề rắc rối sau này.", "eng": "You'll have to mend that leak or it will cause problems laser."}, {"viet": "Với tuổi ba mươi mà anh vẫn còn trẻ trung.", "eng": "You're still on the sunny side of thirty."}, {"viet": "Ông không bắt buộc phải trả lời những câu hỏi này, nhưng nếu ông trả lời thì nhiệm vụ của chúng tôi dễ dàng hơn.", "eng": "You are not obliged to answer these questions, but it would make our task easier."}, {"viet": "Anh không thể tự ý đưa ra những quyết định quan trọng như thế này mà không hỏi ai.", "eng": "You can't take it upon yourself to make important decisions like that."}, {"viet": "Anh đừng có rỗi hơi chẳng bao giờ anh thuyết phục được cô ta đâu.", "eng": "You can save your breath, you'll never persuade her."}, {"viet": "Tôi dám đánh cuộc với ông là ông không tìm được bất cứ đâu những mặt hàng tốt hơn ở đây đâu.", "eng": "You don't find better goods anywhere else, I'll wager."}, {"viet": "Anh phải học cách cưỡng lại lối nói ba hoa liến thoắng của người bán hàng.", "eng": "You have to learn to resist the sales patter."}, {"viet": "Ông có thể chọn một trong các kỳ hạn ba, sáu, mười hai tháng hoặc hai năm.", "eng": "You may choose one from three-, six-, twelve-month or two-year maturities."}, {"viet": "Anh không được quan trọng hoá vai trò của ông ta trong cuộc đàm phán.", "eng": "You must not overplay his part in the negotiations."}, {"viet": "Ông là Smith ở phòng 345, đúng không ạ?", "eng": "You're John Smith in Room 345, right?"}, {"viet": "Anh cần phải chăm chút nhiều hơn đến bề ngoài của mình.", "eng": "You should take more pride in your appearance."}, {"viet": "Không có ý định để anh nghe thấy lời nhận xét đó.", "eng": "You weren't intended to hear that remark."}, {"viet": "Về căn bản, sự đánh giá của anh là đúng.", "eng": "Your assessment is substantially correct."}, {"viet": "Lời đoán trước của anh về thời tiết là sai-trời không mưa mà lại nắng.", "eng": "Your prediction about the weather was wrong-instead of raining it was sunny."}]