[{"viet": "Một cái ban công nhô ra trên khu vườn.", "eng": "A balcony that juts out over the garden."}, {"viet": "Một người hang động sẽ ngạc nhiên nếu anh ta thấy chúng.", "eng": "A cave man would certainly be surprised if he could see them."}, {"viet": "Một công ty được thành lập ở Mỹ.", "eng": "A company incorporated in the USA."}, {"viet": "Một ý kiến thiểu số chống lại quan điểm đang thịnh hành.", "eng": "A cross-current of opinion against the prevailing view."}, {"viet": "Một khám phá được ghi vào lịch sử y học.", "eng": "A discovery that made medical history."}, {"viet": "Một cái phà đã được chuyển đổi để chở quân lính trong chiến tranh.", "eng": "A ferry that was converted to carry troops during the war."}, {"viet": "Một dòng nước phun lên từ vòi nước cứu hoả bị vỡ.", "eng": "A fountain of water gushed from the broken fire hydrant."}, {"viet": "Một phương pháp dạy ngôn ngữ tốt.", "eng": "A good system of teaching languages."}, {"viet": "Một mũi đất nhô ra biển.", "eng": "A headland that juts out into the sea."}, {"viet": "Một túp lều nằm chênh vênh ở rìa vách đá.", "eng": "A hut perched at the edge of the cliff."}, {"viet": "Một lớp tế bào mỡ dưới da.", "eng": "A layer of adipose tissue under the skin."}, {"viet": "Nhiều máy móc mới đã được trang bị cho nhà máy đó.", "eng": "A lot of new machinery has been put into the factory."}, {"viet": "Một khối các tảng đá vỡ rơi ào ào xuống sườn núi.", "eng": "A mass of broken rocks volleyed down the mountain side."}, {"viet": "Một bà Green nào đó đang chờ gặp anh.", "eng": "A Mrs Green is waiting to see you."}, {"viet": "Một quyển tiểu thuyết rất xứng đáng được ca tụng.", "eng": "A novel richly deserving of praise."}, {"viet": "Một cuộc trình diễn với chất lượng rõ ràng của diễn viên nổi tiếng.", "eng": "A performance with star quality written all over it."}, {"viet": "Một nhà thơ có kỳ vọng thực sự đạt được vị trí cao về văn học.", "eng": "A poet with serious pretensions to literary greatness."}, {"viet": "Một loại thuế rất cao nhằm ngăn chặn việc nhập khẩu các loại xe ôtô.", "eng": "A prohibitive tax on imported cars."}, {"viet": "Sự quan tâm trở lại các thời kỳ trung cổ.", "eng": "A renascent interest in medieval times."}, {"viet": "Một mẫu hàng vải mà tôi muốn mua.", "eng": "A sample of the kind of cloth I want to buy."}, {"viet": "Một miếng che tay cầm của một cái cưa xích.", "eng": "A shield around the grip of a chainsaw."}, {"viet": "Con rắn sẽ không cắn nếu bạn để cho nó yên.", "eng": "A snake will not bite you if you leave it alone."}, {"viet": "Một chính khách hoạt động cho hòa bình.", "eng": "A statesman who works for peace."}, {"viet": "Một viên kẹo tan trên lưỡi.", "eng": "A sweet that melts on the tongue."}, {"viet": "Một thành phố đã qua thời vàng son từ lâu.", "eng": "A town long past its glory days."}, {"viet": "Một vụ lên lương 10 bảng Anh một tuần.", "eng": "A wage rise of £ 10 a week."}, {"viet": "Một nhà văn đã làm lu mờ ranh giới giữa lịch sử và chuyện giả tưởng.", "eng": "A writer who scumbled the line that divides history and fiction."}, {"viet": "Hành động hoàn toàn trái ngược với mong muốn của tôi.", "eng": "Acting in direct contravention of my wishes."}, {"viet": "Sau nhiều lần thuyết phục, ông ta đã đồng ý đến.", "eng": "After a lot of persuasion, he agreed to come."}, {"viet": "Sau nhiều tháng chán nản, sự kiên trì của anh ta cuối cùng đã được đền bù.", "eng": "After months of disappointment, his perseverance was finally rewarded."}, {"viet": "Sau khi ghép, cơ thể anh ta đã không chịu được quả tim mới.", "eng": "After the transplant his body rejected the new heart."}, {"viet": "Tất cả hàng hóa bị giảm giá 15%.", "eng": "All goods have been marked down by 15%."}, {"viet": "Tất cả các tách đều sạch bóng.", "eng": "All the cups are clean and shiny."}, {"viet": "Tờ báo mới đã thu hút được nhiều độc giả của các báo khác.", "eng": "Already the newspaper is winning converts."}, {"viet": "Một lời tố cáo thực sự vô căn cứ.", "eng": "An accusation that is really off the wall."}, {"viet": "Một toan tính phế bỏ chính phủ Vichi.", "eng": "An attempt to delegitimize the Vichy government."}, {"viet": "Một sự sử dụng hoang phí các tài nguyên thiên nhiên.", "eng": "An extravagant use of natural resources."}, {"viet": "Giá trị đổi bù của một cái bếp cũ.", "eng": "An old cooker's trade-in value."}, {"viet": "Phân tích một tuyển tập tiếng địa phương.", "eng": "Analyze a corpus of spoken dialect."}, {"viet": "Công bố kết quả một cuộc bầu cử.", "eng": "Announce the result of an election."}, {"viet": "Giảm mạnh chi phí của chính quyền địa phương.", "eng": "Apply the axe to local government spending."}, {"viet": "Bạn theo Thiên Chúa giáo hay Anh giáo?", "eng": "Are you a Roman Catholic or an Episcopalian?"}, {"viet": "Anh có nhận thấy những nguy hiểm trong vị trí của anh không?", "eng": "Are you sensible of the dangers of your position?"}, {"viet": "Là một ngôi sao nhạc pop từng nổi tiếng một thời cô ta chóng bị lãng quên: cô ta chỉ thực hiện được một đĩa hát thành công thôi!", "eng": "As a pop star she was a nice day's wonder: she only made one successful record!"}, {"viet": "Như vậy, không có tiếng địa phương nào hay hơn tiếng địa phương nào cả.", "eng": "As such, no dialect is any better than another."}, {"viet": "Tại Cracow ông đã bắt đầu chú ý đến thiên văn học.", "eng": "At Cracow he had become interested in astronomy."}, {"viet": "Trong trường hợp tệ hại nhất chúng ta sẽ phải bán nhà để trang trải nợ nần.", "eng": "At worst we'll have to sell the house so as to settle our debts."}, {"viet": "Cô Barbara sẽ điều khiển tổng đài điện thoại cho tới khi chúng ta trở về.", "eng": "Barbara will man the telephone switchboard till we get back."}, {"viet": "Cẩn trọng hơn trong phương cách của mình để giải quyết một vấn đề.", "eng": "Be more scholarly in one's approach to a problem."}, {"viet": "Trước khi các họa sĩ đã nắm được các kỹ xảo phối cảnh.", "eng": "Before artists had mastered the tricks of perspective."}, {"viet": "Bill Brown đã thực hiện chuyến đi công tác của ông ta đến Trung Quốc.", "eng": "Bill Brown made his first business trip to China."}, {"viet": "Lệ phí mướn hộp có thể được trả trước hàng năm.", "eng": "Box rental fees are payable yearly in advance."}, {"viet": "Gắn những mảnh kim loại tạo thành một tác phẩm nghệ thuật.", "eng": "Build scraps of metal into a work of art."}, {"viet": "Nhưng tôi nghĩ cái áo này hơi chật quá.", "eng": "But I think this one is a bit too tight."}, {"viet": "Nhưng ông phải gửi một ít tiền cùng lúc ông mở một tài khoản.", "eng": "But you have to deposit some money at the same time you open the account."}, {"viet": "Này Pete, tiện thể tôi sẽ tính tiền luôn.", "eng": "By the way, Pete, I'll get the check."}, {"viet": "Xin cho tôi xem giấy chứng minh của ông?", "eng": "Can I have your identity card?"}, {"viet": "Anh có thể làm việc thay cho tôi và tôi sẽ làm ca của anh lần tới được không?", "eng": "Can you cover for me and I'll work your shift next time?"}, {"viet": "Ở nước bạn, bạn có được nghỉ hưởng lương từ việc làm bán thời gian không?", "eng": "Can you receive paid holidays from a part-time job in your country?"}, {"viet": "Cứ 30 phút lại tóm tắt các tin tức một lần.", "eng": "Capsulize the news every 30 minutes."}, {"viet": "Vua Charles đệ nhất đã cai trị nước Anh trong 11 năm.", "eng": "Charles I ruled England for eleven years."}, {"viet": "Các nhà thờ và bàn thờ bị ô uế vì các vụ giết người tàn bạo.", "eng": "Churches and altars were polluted by atrocious murders."}, {"viet": "Các hãng liên doanh sản xuất bia chuẩn bị thay thế Công ty Bia Anh.", "eng": "Combined Breweries are poised to take over the British Beer company."}, {"viet": "Lên án việc không thi hành quyền tự do cơ bản của con người.", "eng": "Condemn the denial of basic human freedoms."}, {"viet": "Chép các ghi chú từ một cuốn sách vào một cuốn sổ tay.", "eng": "Copy notes from a book into a notebook."}, {"viet": "Xin cô vui lòng cho biết khu 3 ở đâu ạ?", "eng": "Could you please tell me where Ward 3 is?"}, {"viet": "Các đám đông tụ tập gần quảng trường Trafalgar.", "eng": "Crowds gathering in the vicinity of Trafalgar Square."}, {"viet": "Cái chết thường là sự giải thoát thoải mái khỏi nỗi đau đớn.", "eng": "Death is often a welcome release from pain."}, {"viet": "Dù tuổi của bà ấy cao, bà ấy trông vẫn trẻ măng.", "eng": "Despite her age she had worn well."}, {"viet": "Cuối tuần rồi anh đi câu cá phải không?", "eng": "Did you go fishing last weekend?"}, {"viet": "Những mối bất đồng đe dọa phá vỡ những cuộc đàm phán hòa bình, nhưng sự can thiệp của vị tổng thống đã cứu vãn được tình thế.", "eng": "Disagreements threatened to wreck the peace talks, but the president's intervention saved the situation."}, {"viet": "Đừng chỉ trông bề ngoài mà xét đoán con người.", "eng": "Do not judge people by externals alone."}, {"viet": "Bạn thấy công việc của bạn có khó khăn không?", "eng": "Do you consider your job to be difficult?"}, {"viet": "Bạn có ý kiến gì để khuyên tôi nên dùng thời gian ra sao?", "eng": "Do you have any ideas for a good way to spend my time?"}, {"viet": "Anh có thích đồ thủ công mỹ nghệ không?", "eng": "Do you like arts and crafts?"}, {"viet": "Anh có thấy chỗ xe hơi và xe tải đậu không?", "eng": "Do you see where the cars and trucks are parked?"}, {"viet": "Ông muốn lấy tất cả cùng một thứ, hay lẫn lộn?", "eng": "Do you want all the same kind, or a mixture?"}, {"viet": "Chuyến xe lửa này có dừng lại ở Boston không?", "eng": "Does this train stop at Boston?"}, {"viet": "Đừng đi ủng bám đầy thứ bẩn thỉu vào đây.", "eng": "Don't come in here with your boots all covered in muck."}, {"viet": "Đừng có sơ hở cho người khác đả kích.", "eng": "Don't lay yourself open to attack."}, {"viet": "Đừng có bước chân thình thịch như thế, anh sẽ đánh thức mọi người dậy đấy.", "eng": "Don't stamp, you'll wake everyone up."}, {"viet": "Anh có thấy là hắn rất thô lỗ không?", "eng": "Don't you find him very rude?"}, {"viet": "Giậm chân của ai lên sàn.", "eng": "Drum one's feet on the floor."}, {"viet": "Những người mười tám tuổi được quyền bầu cử.", "eng": "Eighteen-year-olds qualify to vote."}, {"viet": "Chuyện thoát ra khỏi nhà tù Dartmoor thật là khó khăn.", "eng": "Escape from Dartmoor prison is difficult."}, {"viet": "Mọi người công nhận anh ấy đúng là người thừa kế hợp pháp.", "eng": "Everyone recognized him to be the lawful heir."}, {"viet": "Dùng một ảnh hưởng làm cho ai ôn hòa.", "eng": "Exercise a moderating influence on somebody."}, {"viet": "Nạn đói thường là hậu quả của chiến tranh.", "eng": "Famine is often the sequel to war."}, {"viet": "Tiểu thuyết là một dạng thay thế tồi cho kinh nghiệm thật.", "eng": "Fiction is a poor surrogate for real experience."}, {"viet": "Cá chỉ sống thêm được chốc lát khi ở ngoài nước.", "eng": "Fish can survive for only a short time out of water."}, {"viet": "Thức ăn đi từ dạ dày xuống ruột non và từ đó xuống ruột già.", "eng": "Food passes from the stomach to the small intestine and from there to the large intestine."}, {"viet": "Đã thành lập một khối vững chắc để bảo vệ Hiến pháp.", "eng": "Formed a solid phalanx in defense of the Constitution."}, {"viet": "Lạ quá, tôi mới gặp nàng hôm qua.", "eng": "Funnily enough I met her just yesterday."}, {"viet": "Xuống khỏi xe đạp của tao, thằng nhóc đểu cáng!", "eng": "Get off my bike, you little villain!"}, {"viet": "Báo trước cho ai điều gì.", "eng": "Give somebody advance warning of something."}, {"viet": "Lạy Chúa tôi, thật là một việc làm ngu ngốc!", "eng": "God, what a stupid thing to do!"}, {"viet": "Khách khứa bị dồn vào số ít phòng còn lại.", "eng": "Guests were crowded into the few remaining rooms."}, {"viet": "Có phải đảng đã bị những người cực đoan nắm quyền kiểm soát không?", "eng": "Has the party been taken over by extremists?"}, {"viet": "Jun, bạn có bao giờ đến Las Vegas chưa?", "eng": "Have you ever been to Las Vegas, Jun?"}, {"viet": "Ông đã gặp cô dâu và chú rể chưa?", "eng": "Have you met the bride and groom?"}, {"viet": "Một ngày kia, hắn sẽ có một kết cuộc tồi tệ.", "eng": "He'll come to a bad end one of these days."}, {"viet": "Anh ấy lúc nào cũng đỡ đần được cho mẹ rất nhiều.", "eng": "He's always very helpful to his mother."}, {"viet": "Cuối cùng nó đã đi và thế là thoát nợ!", "eng": "He's gone at last, and good riddance!"}, {"viet": "Anh ta không phải là đáng tin cậy lắm, nhưng dẫu sao tôi cũng mến anh ta.", "eng": "He's not very reliable, but I like him just the same."}, {"viet": "Nó rất giỏi làm theo bè bạn của nó.", "eng": "He's very clever at imitating his friends."}, {"viet": "Ông ta trả lời tôi với vẻ khá lơ đãng.", "eng": "He answered me in a rather preoccupied manner."}, {"viet": "Hắn ăn ở trọ nhà tôi cho đến khi hắn tìm được một căn hộ.", "eng": "He boarded at my house until he found a flat."}, {"viet": "Hắn không thể nào gần đàn bà mà không sờ soạng.", "eng": "He can't be near a woman without pawing her."}, {"viet": "Ông ấy không thể không kêu lên khi thấy đứa con trai mình lớn lên biết bao nhiêu.", "eng": "He could not help exclaiming at how much his son had grown."}, {"viet": "Hắn đã làm việc đó mà chẳng cần tôi thúc giục gì hết.", "eng": "He did it without any prompting from me."}, {"viet": "Anh ta cứ mơ tưởng đến cái ngày trở thành một nhạc sĩ vĩ cầm danh tiếng.", "eng": "He dreams of one day becoming a famous violinist."}, {"viet": "Nó bị chết ngay tại chỗ.", "eng": "He fell dead in his tracks."}, {"viet": "Anh ta huyên thuyên nêu ra một số điều hướng dẫn không hiểu nổi về cách thức cho chạy chiếc máy video đó.", "eng": "He gabbled out some incomprehensible instructions about how to work the video."}, {"viet": "Anh ta say rồi tự làm nhục mình tại đám cưới.", "eng": "He got drunk and disgraced himself at the wedding."}, {"viet": "Nó không biết nàng lại như vậy.", "eng": "He had no idea she was like that."}, {"viet": "Hắn có một mối quen biết rộng rãi.", "eng": "He has a wide circle of acquaintances."}, {"viet": "Hắn ta báo cáo có hại cho tôi và mọi người khác để tự cứu mạng.", "eng": "He has peached me and all the others, to save his life."}, {"viet": "Anh ấy lảng vảng bên ngoài, sợ quá không dám vào trong.", "eng": "He hovered about outside, too afraid to go in."}, {"viet": "Anh ta siêng năng và có năng lực, nhưng chẳng phải là một thiên tài.", "eng": "He is hardworking and able, but no genius."}, {"viet": "Anh ấy rất giỏi trò kéo thỏ ra khỏi một cái nón.", "eng": "He is very good at pulling rabbits out of a hat."}, {"viet": "Anh ấy xuống tinh thần khi được biết mình bị mất việc.", "eng": "He learned to his dismay that he had lost his job."}, {"viet": "Anh ta chẳng nhìn phải mà cũng chẳng nhìn trái.", "eng": "He looked neither right nor left."}, {"viet": "Khi cưới cô ấy, anh ta hoàn toàn ý thức được quyết định của mình.", "eng": "He married her with his eyes wide open."}, {"viet": "Nó đã báo cho chúng tôi biết rằng nó sắp sửa ra đi.", "eng": "He notified us that he was going to leave."}, {"viet": "Anh ấy chơi dương cầm với cảm xúc dào dạt.", "eng": "He plays the piano with great feeling."}, {"viet": "Anh ta ôm choàng vai cô ta.", "eng": "He put his arms around her shoulders."}, {"viet": "Anh ta đã nhìn nhận sự thiếu khả năng của mình.", "eng": "He recognized his lack of qualifications."}, {"viet": "Ông ấy hoàn thành sự nghiệp của mình bằng việc lên chức Bộ trưởng Nội vụ.", "eng": "He rounded off his career by becoming Home Secretary."}, {"viet": "Anh ta là người ham ghi chép chi tiết về xe lửa.", "eng": "He's an avid train-spotter."}, {"viet": "Anh ta sẽ bị ngạc nhiên ghê gớm!", "eng": "He's in for a nasty surprise!"}, {"viet": "Anh ta là nhân vật có cái gì đó khác thường trong khu xóm.", "eng": "He's something of an oddity in the neighborhood."}, {"viet": "Anh ta ngồi đó lững lờ lật các trang sách.", "eng": "He sat there idly turning the pages of a book."}, {"viet": "Anh ta là cố vấn quân sự của đoàn đại biểu Nhật Bản.", "eng": "He served as military adviser to the Japanese delegation."}, {"viet": "Anh ta chuồn đi không bị nhìn thấy.", "eng": "He slipped away out without being seen."}, {"viet": "Anh ta xóc miếng thịt bằng cái nĩa.", "eng": "He stabbed the meat with his fork."}, {"viet": "Ông ta đã nghiên cứu thị trường nước Đức để tìm kiếm ở đấy khả năng đầu tư có lãi.", "eng": "He studied the German market to find the potential there for profitable investment."}, {"viet": "Hắn tưởng mình là người nào đó rất quan trọng.", "eng": "He thinks he's really somebody."}, {"viet": "Anh ấy đã tham dự kỳ thi tuyển nhưng đã không đỗ.", "eng": "He took the entrance exam but couldn't get in."}, {"viet": "Anh ta quay lại đối đầu với những kẻ tấn công.", "eng": "He turned to face his attackers."}, {"viet": "Anh ta muốn đi du lịch lâu ngày nhưng anh ta phải tính toán mọi việc cho đâu vào đấy.", "eng": "He wanted to go on a long journey but he had to cut his coat according to his cloth."}, {"viet": "Anh ta bị bắt vì lời buộc tội bịa đặt.", "eng": "He was arrested of some trumped-up charge."}, {"viet": "Anh ta bị bạn lôi kéo liên tục tới những buổi tiệc tùng.", "eng": "He was continually hauled off to parties by his friends."}, {"viet": "Anh ta được cho 20 bảng Anh về chi phí, nhưng anh ta bỏ túi gần hết số tiền đó.", "eng": "He was given £ 20 for expenses, but pocketed most of it."}, {"viet": "Anh ta được tuyển để đào tạo đặc biệt.", "eng": "He was marked out for special training."}, {"viet": "Quả là anh ta nói quá lên.", "eng": "He was really laying it on a bit thick."}, {"viet": "Anh ta đã được đưa tới bệnh viện để điều trị.", "eng": "He was taken to hospital for treatment."}, {"viet": "Anh ta không thích lái xe lắm, vì anh ta đã làm mấy ly rượu.", "eng": "He wasn't that keen to drive, being as he'd had a few drinks."}, {"viet": "Chẳng bao lâu nữa nó sẽ cao hơn bố.", "eng": "He will soon have overtopped his father."}, {"viet": "Ông ấy viết với bút danh Lewis Carroll.", "eng": "He writes under the name of Lewis Carroll."}, {"viet": "Bài tường thuật của cô ấy đúng tất cả các chi tiết.", "eng": "Her account is correct in all particulars."}, {"viet": "Sự nghiệp của cô ta cứ bị vận rủi đeo đẳng.", "eng": "Her career was dogged by misfortune."}, {"viet": "Áo đầm của cô ta bị vướng vào một chiếc đinh.", "eng": "Her dress caught on a nail."}, {"viet": "Các bạn của cô ấy bỏ rơi cô ấy trong khi cô ấy cần sự giúp đỡ nhất.", "eng": "Her friends failed her when she most needed."}, {"viet": "Ảnh hưởng của cô ta là lâu dài nhất so với tất cả.", "eng": "Her influence was the most enduring of all."}, {"viet": "Việc can thiệp của mẹ cô ấy làm trầm trọng thêm những khó khăn trong hôn nhân của họ.", "eng": "Her mother's interference exacerbated the difficulties in their marriage."}, {"viet": "Ảnh của cô ấy được chọn đưa lên lịch vì cô ấy ăn ảnh.", "eng": "Her photograph was selected for the calendar, as she is photogenic."}, {"viet": "Những việc mà bà ta đã làm cho nhà nước là rất to lớn.", "eng": "Her services to the state have been immense."}, {"viet": "Cô ấy đích thực là một vận động viên có tài nghệ và thứ hạng cao.", "eng": "Her undoubted skill, class, ability, etc. as an athlete."}, {"viet": "Sổ tiền gửi và hộ chiếu của ông đây.", "eng": "Here is your deposit book and passport."}, {"viet": "Câu trả lời của ông là: Tôi đang đi tìm một người lương thiện.", "eng": "His answer was, I am hunting for an honest man."}, {"viet": "Bộ quần áo sáng màu của ông ta không phù hợp với một dịp long trọng như vậy.", "eng": "His bright clothes were hardly appropriate for such a solemn occasion."}, {"viet": "Những chủ nợ đang đòi nợ anh ta.", "eng": "His creditors are demanding to be paid."}, {"viet": "Mặt anh ta đỏ bừng lên khi anh ta thấy cô ấy đang ngắm nhìn mình.", "eng": "His face crimsoned when he saw her watching him."}, {"viet": "Cô bạn gái của anh ta đúng là người tuyệt vời.", "eng": "His girl-friend is a real humdinger."}, {"viet": "Sự can thiệp của anh ta làm cuộc cãi cọ của họ lên tột đỉnh.", "eng": "His intervention brought their quarrel to a climax."}, {"viet": "Đầu óc cô ta đầy ý tưởng muốn trở thành một nghệ sĩ vĩ đại.", "eng": "His mind is filled with dreams of being a great actress."}, {"viet": "Dĩ vãng của ông ta được bao phủ trong màn bí mật.", "eng": "His past is shrouded in mystery."}, {"viet": "Nhận định của anh ta làm tôi đỏ bừng mặt.", "eng": "His remark brought a blush to my cheeks."}, {"viet": "Anh ta xuống tinh thần trước tin ấy.", "eng": "His spirits drooped at the news."}, {"viet": "Việc anh ta không muốn chấp nhận sự thật làm tôi khó chịu.", "eng": "His unwillingness to accept the truth annoyed me."}, {"viet": "Thắp nến thức đêm cầu nguyện hòa bình.", "eng": "Hold a candle-light vigil for peace."}, {"viet": "Sau ngừng bắn, xung đột lại tiếp tục.", "eng": "Hostilities resumed after the cease-fire."}, {"viet": "Làm thế nào chúng ta phá tan được các hàng rào sợ hãi và thù địch ngăn cách hai cộng đồng?", "eng": "How can we break down the barriers of fear and hostility which divide the two communities?"}, {"viet": "Tôi làm thế nào để xin được giấy phép này?''Ông cần hỏi nơi hướng dẫn'.", "eng": "How do I apply for this licence?''You want inquiries'."}, {"viet": "Nhật Bản khác với đất nước bạn như thế nào?", "eng": "How is Japan different from your home country?"}, {"viet": "Tôi có thể mua được bao nhiêu túi thuốc lá?", "eng": "How many cartons of cigarettes can I buy?"}, {"viet": "Đã bao nhiêu năm trôi qua từ khi chúng ta gặp nhau lần cuối vậy?", "eng": "How many years has it been since we last saw each other?"}, {"viet": "Cách bao lâu bạn đi xem phim một lần?", "eng": "How often do you go to the movies?"}, {"viet": "Hàng trăm người chết khi chiếc tàu chở khách bị chìm.", "eng": "Hundreds died when the liner went down."}, {"viet": "Tôi muốn chúc mừng đôi vợ chồng trẻ nhân ngày hôn lễ của họ và mong họ sống hạnh phúc bên nhau dài lâu.", "eng": "I'd like to congratulate the young couple on their marriage, and wish them a long life of happiness together."}, {"viet": "Bill, chẳng bao lâu nữa, tôi sẽ trở về Nhật.", "eng": "I'll be returning to Japan pretty soon, Bill."}, {"viet": "Tôi sẽ mời cô ấy nếu bạn sẵn sàng đồng ý cho cô ấy tới.", "eng": "I'll invite her, if you're agreeable to her coming."}, {"viet": "Tôi sẽ cố gắng làm người lớn đối với tình thế.", "eng": "I'll try to be adult about the situation."}, {"viet": "Tôi rất chán môn lịch sử-ngày tháng, trận đánh và tất cả những thứ như vậy.", "eng": "I'm bored by history-dates and battles and all that stuff."}, {"viet": "Tôi định thuê một căn hộ ở Vancouver.", "eng": "I'm going to rent an apartment in Vancouver."}, {"viet": "Tôi không phải là người dễ phẫn nộ, nhưng quyển sách đó thật sự tục tĩu.", "eng": "I'm not easily shocked, but that book really is obscene."}, {"viet": "Tao chán những lời châm chọc của mày lắm rồi, dẹp nó đi được không hả?", "eng": "I'm sick of your sarcastic remarks-just chuck it, will you?"}, {"viet": "Tôi chắc rằng chúng ta sẽ tìm thấy nó, anh ấy nói một cách hy vọng.", "eng": "I'm sure we'll find it, he said hopefully."}, {"viet": "Buổi sáng thì tôi rất bận nhưng tôi có thể sắp xếp chút thì giờ gặp anh lúc 10.15.", "eng": "I've a busy morning but I could squeeze you in at 10.15."}, {"viet": "Tôi đã thực hiện tất cả những chỉ dẫn của anh.", "eng": "I've carried out all your instructions."}, {"viet": "Mình đã nghe giai điệu đó rồi nhưng không thể nào nhớ tên nó là gì.", "eng": "I've heard that tune before but I can't put a name to it."}, {"viet": "Tôi đã gửi giấy đặt mua loại bóng đèn tôi thấy quảng cáo trên báo.", "eng": "I've sent off for those bulbs I saw advertised in the paper."}, {"viet": "Tôi luôn luôn đi mua hàng vào một ngày thứ Hai.", "eng": "I always do the shopping on a Monday."}, {"viet": "Việc làm tác phẩm của anh ấy không gây ấn tượng nhiều đối với tôi.", "eng": "I am not overly impressed by his work."}, {"viet": "Tôi hỏi thẳng thừng anh ta là anh ta đang làm gì ở đó.", "eng": "I asked him point-blank what he was doing there."}, {"viet": "Tôi mua áo khoác này với nửa giá tiền.", "eng": "I bought this coat at half-price discount."}, {"viet": "Tôi không rút được nút chai ra-chặt quá.", "eng": "I can't get the cork out of the bottle-it's too tight."}, {"viet": "Tôi không thể hiểu được sự im lặng của cô ta về vấn đề này.", "eng": "I can't understand her silence on this matter."}, {"viet": "Anh có thể dẫn em đi vào thứ bảy này.", "eng": "I can take you this Saturday."}, {"viet": "Tôi không thể làm việc vào thứ hai.", "eng": "I can't work on Monday."}, {"viet": "Tôi không thể nào làm cho xe ô tô của tôi nổ máy sáng nay.", "eng": "I couldn't make my car start this morning."}, {"viet": "Tôi thích rút bằng ngân phiếu hơn.", "eng": "I'd prefer to draw by cheque."}, {"viet": "Tôi không muốn tỏ vẻ nhỏ mọn vì một lời chỉ trích.", "eng": "I didn't want to seem picayune by a criticizing."}, {"viet": "Bản thân tôi không quen anh ta, tuy vậy tôi biết anh ấy.", "eng": "I don't know him personally, though I know of him."}, {"viet": "Tôi không tự nhận là chuyên viên trong lĩnh vực này.", "eng": "I don't profess to be an expert in this subject."}, {"viet": "Tôi không muốn đi, mà tôi có được mời đâu.", "eng": "I don't want to go, anyway I haven't been invited."}, {"viet": "Tôi không cần nhiều hơn nữa.", "eng": "I don't need many more."}, {"viet": "Tôi lo cho sự an toàn của cô ta trong thời tiết này.", "eng": "I fear for her safety in this weather."}, {"viet": "Tôi cảm thấy có con gì đang bò trên cánh tay tôi.", "eng": "I felt something crawling up my arm."}, {"viet": "Tôi biết là anh muốn gặp giám đốc.", "eng": "I gather you want to see the director."}, {"viet": "Tôi dậy muộn và suốt ngày không làm được gì mấy.", "eng": "I got up late and did nothing much all day."}, {"viet": "Tôi đã trù tính cho 20 khách, nhưng chỉ có 10 người đến.", "eng": "I had planned for 20 guests, but only 10 arrived."}, {"viet": "Tôi có cảm nghĩ là anh ta sẽ đến muộn.", "eng": "I have a fancy that he will be late."}, {"viet": "Tôi có những nghi ngại về khả năng làm công việc đó của anh ta.", "eng": "I have my reservations about his ability to do the job."}, {"viet": "Tôi phải đi đón mẹ tôi ở nhà ga.", "eng": "I have to go and get my mother from the station."}, {"viet": "Tôi đã không có các dụng cụ cần thiết.", "eng": "I haven't got the necessary tools."}, {"viet": "Tôi hy vọng có đủ người trong số các cô vui lòng giúp buổi trình diễn.", "eng": "I hope enough of you are prepared to help with the show."}, {"viet": "Tôi đã viết được một trang trong tiểu luận của tôi: đó không phải là nhiều nhưng đó là một sự mở đầu.", "eng": "I I've written one page of my essay: it's not much but it's a start."}, {"viet": "Tôi biết khuôn mặt của cô ấy song không tài nào nhớ lại được tên cô ta.", "eng": "I know her face but I can't call her name to mind."}, {"viet": "Tôi thích ông ta hơn bà ta.", "eng": "I like him better than her."}, {"viet": "Tôi sẽ chờ điện thoại của bạn.", "eng": "I'll be waiting for your call."}, {"viet": "Tôi sẽ không bao giờ cho phép cô ta quay về.", "eng": "I'll never have her back."}, {"viet": "Tôi hơi lo cho anh ta một chút.", "eng": "I'm a wee bit worried about him."}, {"viet": "Tôi sẽ dung rất nhiều sơn màu trắng.", "eng": "I'm going to use lots of white paint."}, {"viet": "Em buồn vì anh sắp ra đi.", "eng": "I'm sad you're leaving."}, {"viet": "Tôi tập thói quen không bao giờ cho người lạ mượn tiền.", "eng": "I make a habit of never lending money to strangers."}, {"viet": "Tôi phải đi trang điểm cho đàng hoàng trước khi khách đến.", "eng": "I must go and make myself presentable before the guests arrive."}, {"viet": "Tôi cần xem giấy phép lái xe và 2 thẻ tín dụng của chính ông.", "eng": "I need to see your drivers'license and two major credit cards."}, {"viet": "Tôi chỉ cần năm phút để tiếp xúc với cô ta-cuộc gặp gỡ ngắn ngủi nhưng thú vị.", "eng": "I only needed five minutes with her, the meeting was short and sweet."}, {"viet": "Tôi cứ tưởng ông ta là một sĩ quan hải quân về hưu.", "eng": "I put him down as a retired naval officer."}, {"viet": "Tôi nhận thấy anh ta có tính tình hơi giống cha anh ta.", "eng": "I recognize his father in him."}, {"viet": "Tôi nói với cô gái đó một cách hơi tự phụ: chú có một nghề đấy, cháu, chú là một thám tử.", "eng": "I said to the girl, rather snootily: I have a trade, kiddo, i'm a detective."}, {"viet": "Tối nay anh sẽ về nhà muộn, vậy đừng chờ cơm anh.", "eng": "I shall be home late tonight, so don't wait diner for me."}, {"viet": "Tôi đã trượt chân ngã trên nước trong phòng tắm.", "eng": "I slipped in some water in the bathroom."}, {"viet": "Tôi nghĩ là không, trừ một chai uýt-ky.", "eng": "I suppose no, except a bottle of whisky."}, {"viet": "Anh nghĩ anh sẽ uống cà phê đá.", "eng": "I think I'll have iced coffee."}, {"viet": "Tôi nghĩ họ hợp nhau bởi vì họ là kiểu người giống nhau.", "eng": "I think they get along because they are the same type of people."}, {"viet": "Tôi đã nói thẳng với cô ta điều tôi nghĩ về cô ta.", "eng": "I told her straight off what I thought of her."}, {"viet": "Tôi xoay đầu lại để lùi chiếc xe.", "eng": "I twisted my head round to reverse the car."}, {"viet": "Nếu tớ mà đi giày lấm bùn vào nhà, bố lúc nào cũng mắng.", "eng": "I walk in with muddy boots, Dad always scolds."}, {"viet": "Tôi muốn bán căn nhà, nhưng chồng tôi cứ lần lữa mãi.", "eng": "I want to sell the house, but my husband is dragging his feet."}, {"viet": "Tôi tin chắc là đã thấy anh ở đó, song chắc là một người nào khác.", "eng": "I was convinced I saw you there, but it must have been someone else."}, {"viet": "Tôi chỉ là người chịu tội thay, còn mấy người kia mới là những kẻ đã nổ súng.", "eng": "I was made the scapegoat, but it was the others who started the fire."}, {"viet": "Tôi lấy làm ngạc nhiên khi nghe họ được nhắc đến chung với nhau.", "eng": "I was surprised to hear them mentioned together."}, {"viet": "Tôi sẽ đồng ý đi với điều kiện là người ta trả mọi chi phí của tôi.", "eng": "I will agree to providing that my expenses are paid."}, {"viet": "Chúc ông có một chuyến đi vui vẻ!", "eng": "I wish you a nice trip!"}, {"viet": "Tôi sẽ không tính tiền số dư này đâu.", "eng": "I won't charge you for it."}, {"viet": "Tôi muốn nhìn quanh trước đã.", "eng": "I would like to look around first."}, {"viet": "Tôi không ngại uống một cốc.", "eng": "I wouldn't mind a drink."}, {"viet": "Nếu anh ấy muốn có một chiếc xe đạp mới, anh ấy sẽ phải đổi chiếc xe cũ của anh ấy.", "eng": "If he wants a new bike, he is going to have to trade in his old one."}, {"viet": "Giá mà người ta có được nguồn cung cấp tiền bạc vô tận!", "eng": "If only one had an unlimited supply of money!"}, {"viet": "Nếu việc gửi tiền tiết kiệm có kỳ hạn không thích hợp thì hãy mở một tài khoản vãng lai.", "eng": "If time deposit is not suitable, open a current account."}, {"viet": "Nếu ông yêu cầu công ty của ông xin một ngân phiếu ký phát ở tại một ngân hàng Thượng Hải thì chúng tôi có thể đổi tiền cho nó ngay.", "eng": "If you ask your company to apply for a cheque drawn on a bank in Shanghai, we can cash it right away."}, {"viet": "Nếu cậu nịnh mẹ cậu một tí, có thể bà mời tất cả chúng tớ đến ăn cơm.", "eng": "If you flatter your mother a bit she might invite us all to dinner."}, {"viet": "Nếu bạn hít một hơi dài bạn có thể ở dưới nước lâu hơn một phút.", "eng": "If you take a deep breath you can stay under for more than a minute."}, {"viet": "Những khó khăn, vấn đề, khả năng, v. v. hết sức to lớn.", "eng": "Immense difficulties, problems, possibilities, etc."}, {"viet": "Theo đúng những mong muốn của ông, chúng tôi đã rút đề nghị của chúng tôi.", "eng": "In compliance with your wishes we have withdrawn our suggestion."}, {"viet": "Ở Nhật chúng cháu nói gochisousama khi chúng cháu ăn xong.", "eng": "In Japanese we say gochisousama when we finish eating."}, {"viet": "Thay vì vậy, ông viết một quyển sách về thiên văn học.", "eng": "In stead he wrote a book about astronomy."}, {"viet": "Thời suy thoái, hãng chúng tôi đã trải qua một thời kỳ khốn khó.", "eng": "In the recession, our firm went through a bad time."}, {"viet": "Tự dưng tôi cho rằng ở đó thuốc lá là mặt hàng độc quyền của chính phủ.", "eng": "Incidentally, I think tobacco is a government monopoly there."}, {"viet": "Chuyến bay 366 có đến đúng lịch trình không?", "eng": "Is flight 366 arriving on schedule?"}, {"viet": "Báo chí có ảnh hưởng mạnh ở nước của bạn không?", "eng": "Is the press a great power in your country?"}, {"viet": "Đây có đúng là chuyến xe buýt đến Toà thị chính không?", "eng": "Is this the right bus for the Town Hall?"}, {"viet": "Đó là một quán dễ chịu, chỉ trừ có ông chủ quán.", "eng": "It's a nice pub, except for the landlord."}, {"viet": "Sống trong nhà trọ thì rẻ hơn khách sạn.", "eng": "It's cheaper to live in lodgings than in a hotel."}, {"viet": "Đã đến lúc cậu phải thôi rong chơi la cà mà bắt đầu tìm một việc làm đi.", "eng": "It's high time you stopped fooling around and started looking for a job."}, {"viet": "Làm cho hai bên đi tới một sự thoả thuận chẳng phải là một nhiệm vụ đáng ao ước gì.", "eng": "It's not an enviable task, trying to get the two sides to reach an agreement."}, {"viet": "Đi leo núi giữa thời tiết xấu như thế này thật là cực kỳ ngu xuẩn.", "eng": "It's sheer idiocy to go climbing in such bad weather."}, {"viet": "Thật hết sức ngu xuẩn mới đi bơi trong thời tiết lạnh giá thế này.", "eng": "It's utter folly to go swimming in this cold weather."}, {"viet": "Nếu tôi có lỡ tàu cũng không sao, vì có một chuyến khác sau đó.", "eng": "It doesn't matter to me if I miss my train, because there's another one."}, {"viet": "Người ta coi là một hành vi tệ hại nếu đến một bữa tiệc quá sớm.", "eng": "It is considered very bad form to arrive too early at a dinner party."}, {"viet": "Người ta thường nói rằng người Nhật hay e thẹn.", "eng": "It is often said that the Japanese are shy."}, {"viet": "Từ đây trông nó rất, rất nhỏ.", "eng": "It looks very, very small from here."}, {"viet": "Chúng ta đã khởi hành được 5 tiếng rồi.", "eng": "It's been five hours since we departed."}, {"viet": "Có điều rất rõ ở cô ta là cô ấy không bao giờ mất bình tĩnh.", "eng": "It says a lot for her that she never lost her temper."}, {"viet": "Viết thư trả lời xong ngay thôi.", "eng": "It took less than no time to write a reply."}, {"viet": "Anh ta nhảy vào toà nhà đang cháy thật dũng cảm.", "eng": "It was brave of him to enter the burning building."}, {"viet": "Tự anh chuyển được chiếc đàn piano này quả thật là một kì công.", "eng": "It was quite a feat to move that piano by yourself."}, {"viet": "Tôi sẽ trông chừng hành lý an toàn.", "eng": "It will be safe with me."}, {"viet": "Ulysses'của James Joyce đã thách thức các truyền thống văn học thời ông ấy.", "eng": "James Joyce's'Ulysses'challenged the literary traditions of his day."}, {"viet": "John không bao giờ chú ý tới những tình cảm của mẹ anh ta.", "eng": "John never showed any consideration for his mother's feelings."}, {"viet": "Kate hoan hô cùng với những người khác và hô to Hoan hô!", "eng": "Kate applauded with the rest and shouted out Bravo!"}, {"viet": "Chúng ta cũng tổ chức tiệc sinh nhật cho Billy nhé.", "eng": "Let's also have a birthday party for Billy."}, {"viet": "Chúng ta hãy đi qua một sân trong khác đi.", "eng": "Let's move on to another courtyard."}, {"viet": "Nhiều nhà văn đương thời lên án các hành động của hoàng đế.", "eng": "Many contemporary writers condemned the emperor's actions."}, {"viet": "Nhiều thầy giáo mong muốn huỷ bỏ sự trừng phạt bằng roi.", "eng": "Many teachers wish to abolish the cane."}, {"viet": "Một lát nữa tôi quay lại để hỏi thêm vài câu nữa được không?", "eng": "May I come back later for more questions?"}, {"viet": "Có lẽ chính phủ không muốn cho dân chúng đọc các báo cáo về y tế.", "eng": "Maybe the government doesn't want the people to read the reports."}, {"viet": "Phần lớn của núi băng trôi chìm dưới mặt nước.", "eng": "Most of the iceberg is under the water."}, {"viet": "Mặc dù tôi rất mến anh, tôi vẫn không thể sống với anh được.", "eng": "Much as I like you, I couldn't live with you."}, {"viet": "Sự tin cậy hoàn toàn của tôi vào tài khéo léo và kinh nghiệm của cô ấy.", "eng": "My complete dependence on her skill and experience."}, {"viet": "Các kế hoạch đi nghỉ của tôi hoàn toàn tan vỡ.", "eng": "My holiday's plans are completely up the spout."}, {"viet": "Bạn kinh doanh của tôi tuần lễ này đi nghỉ nên tôi tạm thay thế anh ấy.", "eng": "My partner is on holiday this week so I'm filling in."}, {"viet": "Nam hết sức khâm phục tất cả bọn họ.", "eng": "Nam had enormous admiration for them all."}, {"viet": "Lần sau, nếu bạn gặp khó khăn như thế này, hãy cho tôi biết.", "eng": "Next time, if you are ever in a tight spot like this, let me know."}, {"viet": "Bánh lái có chuyển động thế nào cũng sẽ không cân bằng được con thuyền.", "eng": "No amount of helm will straighten the boat."}, {"viet": "Chưa, trên thực đơn có quá nhiều món ăn.", "eng": "Not yet, There are so many dishes on the menu."}, {"viet": "Chất dinh dưỡng trong đất có tác dụng như tác nhân kích thích sự phát triển.", "eng": "Nutrient in the soil acts as a stimulus to growth."}, {"viet": "Ồ, ngày mai sẽ là ngày cuối cùng tôi ở đây.", "eng": "Oh, tomorrow will be my last day here."}, {"viet": "Lại trò chuyện hỏi han sau trận cãi nhau của họ.", "eng": "On speaking terms again after their quarrel."}, {"viet": "Còn việc này nữa, cô vui lòng cho tôi biết gửi một tấm bưu thiếp đi Trung Quốc là bao nhiêu?", "eng": "One more thing, could you tell me how much it is to send a postcard to China?"}, {"viet": "Những cuộc phiêu lưu ngoài trời khác có thể là trượt ván trên tuyết xuyên qua những cánh rừng bằng phẳng ở Michigan, di chuyển trên tuyết khắp nơi, trượt tuyết ở rặng Rockies và ở Alaska, lướt ván trượt nước và săn bắn.", "eng": "Other outdoor adventures can be snowshoeing through the flat forests of Michigan, snow-mobiling anywhere, skiing in the Rockies anh in Alaska, surfing, watering-skiing anh hunting."}, {"viet": "Các bạn chúng tôi sẽ chở chúng tôi tới phi trường.", "eng": "Our friends are talking us to the airport."}, {"viet": "Kế hoạch của chúng ta gặp nhiều khó khăn.", "eng": "Our plan were attended with many difficulties."}, {"viet": "Trên một triệu bảng đã được ủng hộ cho sự nghiệp để đáp lời kêu gọi trên vô tuyến.", "eng": "Over a million pound was donated to the cause in response to the television appeal."}, {"viet": "Nhanh chóng thanh toán các hoá đơn là một thói quen tốt về tài chính.", "eng": "Paying bills promptly is good financial practice."}, {"viet": "Có lẽ tôi mặc bộ đồ sẫm màu được chứ?", "eng": "Perhaps I can get by in dark suit?"}, {"viet": "Cảnh sát đã xác định được một người họ muốn thẩm vấn.", "eng": "Police have named a man they would like to question."}, {"viet": "Hãy nhớ là khi cháu tan học thì bác vẫn ở chỗ làm.", "eng": "Remember I'll be at work when your classes are over."}, {"viet": "Cảm nghĩ trong khu City hiện nay là ủng hộ việc giảm thuế.", "eng": "Sentiment in the City is now in favour of a cut in taxes."}, {"viet": "Bà ta sẽ nổi khùng khi thấy cái cửa sổ vỡ.", "eng": "She'll do her nut when she sees the broken window."}, {"viet": "Cô ấy đã bị cấm không được lái xe trong sáu tháng.", "eng": "She's been banned from driving for six months."}, {"viet": "Bà ấy bị tàn tật nhưng rất độc lập.", "eng": "She's handicapped but very self-sufficient."}, {"viet": "Cô ấy hoàn toàn biết điều trong các yêu cầu của cô ấy.", "eng": "She's perfectly reasonable in her demands."}, {"viet": "Cô ấy rất tốt, nhưng vì cô ấy có vẻ ngoài không thân thiện nên khó kết bạn.", "eng": "She's very nice, but because she has a forbidding manner she's slow in making friends."}, {"viet": "Cô ấy yêu cầu ngân hàng hoàn tiền lại cho cô ấy.", "eng": "She asks the bank to claim refund for her."}, {"viet": "Cô ta đã tạo được danh tiếng cho mình với tư cách là một phóng viên.", "eng": "She carved out a name for herself as a reporter."}, {"viet": "Chị ấy chặt đứt cây con bằng một nhát rìu.", "eng": "She cut down the sapling with one chop."}, {"viet": "Dạo này bà ấy không đi lại nhiều.", "eng": "She doesn't get around much these days."}, {"viet": "Cô ấy cảm thấy đôi cánh tay anh ta siết chặt lấy mình.", "eng": "She felt his arms close tightly around her."}, {"viet": "Cô ấy thấy thích thú môn lướt sóng và trượt tuyết.", "eng": "She gets her kicks from windsurfing and skiing."}, {"viet": "Bà ấy quyết định bán lại ( cổ phần của bà ở công ty ) và rút lui.", "eng": "She had decided to sell out ( her share of the company ) and retire."}, {"viet": "Cô ta có một kỹ thuật không chính thống, nhưng là một người biểu diễn tuyệt vời.", "eng": "She has an unorthodox technique, but is an excellent player."}, {"viet": "Cô ta ghét cái cách bị nhốt suốt ngày trong nhiệm sở.", "eng": "She hates being boxed up in an office all day."}, {"viet": "Bà ấy được mọi người biết đến vì thành tựu của mình trong công việc cải tiến các bệnh viện của đất nước.", "eng": "She is known for her accomplishment in improving the country's hospitals."}, {"viet": "Bà ấy cứ liên tục gọi anh ta để giao nhiệm vụ mới.", "eng": "She kept calling him up to assign some new task to him."}, {"viet": "Cô ta có vẻ rất ngạc nhiên khi nghe tin anh ấy chết.", "eng": "She looked astonished when she heard about his death."}, {"viet": "Bà ta có vẻ như không thân thiện lắm, nhưng trong thâm tâm bà ta rất tốt.", "eng": "She may seem rather unfriendly, but deep down she's very nice."}, {"viet": "Cô ta đã trải qua một thời kỳ khó khăn sau khi cuộc hôn nhân của cô thất bại.", "eng": "She passed through a difficult period after her marriage failed."}, {"viet": "Trong học kỳ đầu tại trường đại học, cô ta đã xài phí rất nhiều tiền.", "eng": "She ran through a lot of money in her first term at university."}, {"viet": "Cô ấy là người rất khó chiều.", "eng": "She's a very particular person."}, {"viet": "Cô ta khởi hành đi Luân Đôn ngày mai.", "eng": "She's off to London tomorrow."}, {"viet": "Cô ta đã nhìn thấy khả năng thành công của kế hoạch từ lúc khởi sự.", "eng": "She saw the possibilities of the scheme from the beginning."}, {"viet": "Cô ấy cho chúng tôi xem ngôi nhà mới của cô ấy với niềm tự hào to lớn.", "eng": "She showed us her new home with great pride."}, {"viet": "Cô ấy được các đồng nghiệp rất quý trọng.", "eng": "She stands high in the esteem of her colleagues."}, {"viet": "Cô ta nói không cái gì cả ngoài chiếc xe cưng của cô ta!", "eng": "She talks about nothing except her precious car!"}, {"viet": "Cô ta quay lại đối mặt với anh ta mắt bừng bừng giận dữ.", "eng": "She turned and faced him, her eyes blazing."}, {"viet": "Cô ta là một người bé xíu bên người chồng cao.", "eng": "She was a diminutive figure beside her tall husband."}, {"viet": "Cô ấy được chọn làm một vận động viên sáng giá cho đội thể thao đi dự Olympic.", "eng": "She was chosen as one of the elite squad for the Olympic Games."}, {"viet": "Cô ta ngân nga nhè nhẹ một mình.", "eng": "She was humming away to herself."}, {"viet": "Cô ấy trố mắt vì kinh ngạc.", "eng": "She was pop-eyed with amazement."}, {"viet": "Cô ta đi đứng loạng choạng với đôi giày rất cao gót.", "eng": "She was teetering about in very high-heeled shoes."}, {"viet": "Bà ta tô son trát phấn cả lớp trên mặt.", "eng": "She wears far too much paint."}, {"viet": "Cô ta đã giành được huy chương vàng vì thành tích xuất sắc trong cuộc thi.", "eng": "She won a gold medal for her fine performance in the contest."}, {"viet": "Sheila là người đến đầu tiên.", "eng": "Sheila was the first to arrive."}, {"viet": "Đóng cửa sổ lại đi-Tôi đang lạnh cóng đây!", "eng": "Shut the window-I'm freezing!"}, {"viet": "Thưa ông, tôi có nhiệm vụ báo để ông rõ rằng.", "eng": "Sir, it is my duty to inform you that."}, {"viet": "Những viên đá dăm từ trên đổ ào xuống chúng tôi.", "eng": "Small stones showered down on us from above."}, {"viet": "Vậy ra là anh ta trông thấy cảnh tuyết rơi lần đầu tiên.", "eng": "So it was that he had his first sight of snow."}, {"viet": "Tàn rơi khỏi đầu thuốc lá của cô ấy.", "eng": "Some ash fell off the end of the cigarette."}, {"viet": "Một ít tiền đã bị lấy cắp.", "eng": "Some of the money was stolen."}, {"viet": "Vài khách du lịch ra hiệu để cho người khác ở nước ngoài hiểu được ý họ.", "eng": "Some tourists make themselves understood abroad by pantomime."}, {"viet": "Thái độ chưa được chín chắn như lái xe quá nhanh để làm ra vẻ ta đây.", "eng": "Sophomoric behaviour such as driving too fast in an attempt to show off."}, {"viet": "Cờ bạc thâu đêm suốt sáng.", "eng": "Spending all night at gaming tables."}, {"viet": "Hơi nước bốc ra từ một ấm nước sôi.", "eng": "Steam coming out of a boiling kettle."}, {"viet": "Thôi đừng nói nữa, nếu không anh làm đầu óc tôi rối tung lên bây giờ.", "eng": "Stop talking or you'll muddle me up completely."}, {"viet": "Tiếp theo sự thành công là một vở kịch, nó được chuyển thể thành phim.", "eng": "Subsequent to its success as a play, it was made into a film."}, {"viet": "Bị tước mất quyền công dân của mình.", "eng": "Suffer deprivation of one's rights as a citizen."}, {"viet": "Hoãn lại việc áp dụng thời biểu mới.", "eng": "Suspend introduction of the new scheme."}, {"viet": "Nghỉ làm một ngày à? Hoan nghênh!", "eng": "Take the day off? Now you are talking!"}, {"viet": "Thanh thiếu niên thường sống ngược đời.", "eng": "Teenagers often go against the stream."}, {"viet": "Bà Atkins, xin cám ơn bà vì một bữa ăn ngon.", "eng": "Thank you for a delicious meal, Mrs. Atkins."}, {"viet": "Đấy là bàn thắng thứ hai mươi mà anh ta đã sút được trong mùa này.", "eng": "That's the twentieth goal he's kicked this season."}, {"viet": "Cốc rượu đó làm cho tôi cảm thấy khó chịu.", "eng": "That drink has made me quite funny."}, {"viet": "Điều đó có thể đúng mà cũng có thể không.", "eng": "That may or may not be true."}, {"viet": "Đó không phải là một lời giải thích thỏa đáng.", "eng": "That's not an adequate explanation."}, {"viet": "Đó là một kinh nghiệm mà tôi không muốn thể nghiệm lần nữa.", "eng": "That was an experience I should not like to relive."}, {"viet": "Tai nạn đó không liên quan gì đến công việc xây dựng đang được thi công tại hiện trường.", "eng": "The accident was unconnected with the building work being carried out on the site."}, {"viet": "Công ty truyền đi lời kêu gọi khẩn cấp cho việc cung cấp thuốc men.", "eng": "The agency broadcast an urgent appeal for medical supplies."}, {"viet": "Người đàn ông giận dữ đã thách đấu đòi rửa nhục nhưng địch thủ của ông ta không chấp nhận.", "eng": "The angry man demanded satisfaction but his enemy refused it."}, {"viet": "Vùng đó đã bị trận bộc phát dịch tả hoành hành.", "eng": "The area was struck by an outbreak of cholera."}, {"viet": "Bầu không khí thay đổi ngay khi cô ta bước vào.", "eng": "The atmosphere changed as soon as she walked in."}, {"viet": "Rìu đó chẻ gỗ dễ dàng.", "eng": "The axe sliced through the wood."}, {"viet": "Ban nhạc đó đưa ra một bản thu trộn nhạc vào đĩa hát đơn đầu tiên của mình.", "eng": "The band released a remix of their first single."}, {"viet": "Đài BBC phát thanh đi khắp thế giới.", "eng": "The BBC broadcasts all over the world."}, {"viet": "Hóa đơn ghi 10 bảng Anh cộng với 1 bảng Anh bưu phí.", "eng": "The bill was £ 10, plus £ 1 for postage."}, {"viet": "Con tàu nghiêng về một bên trong cơn gió lớn.", "eng": "The boat heeled over in the strong wind."}, {"viet": "Cuốn sách bị quá nhiều chi tiết lộn xộn.", "eng": "The book suffers from excess of unfocused detail."}, {"viet": "Trường con trai và trường con gái đã hợp nhất lại thành một trường hỗn hợp mới.", "eng": "The boys'and girls'schools have been amalgamated to form a new comprehensive."}, {"viet": "Màu đồng thiếc của lá mùa thu.", "eng": "The bronze tints of autumn leaves."}, {"viet": "Xe buýt sẽ rời bến trong vòng mười phút.", "eng": "The bus will leave in ten minutes."}, {"viet": "Đèn pha xe hơi sáng hết cỡ.", "eng": "The car's headlights were on full beam."}, {"viet": "Chiếc xe ôtô bị thủng lỗ từ đầu tới cuối.", "eng": "The car was riddle from end to end."}, {"viet": "Ngành kinh doanh cung cấp thực phẩm, khách sạn, du lịch, giải trí, v. v.", "eng": "The catering, hotel, tourist, entertainment, etc industry."}, {"viet": "Con kênh được đánh dấu bằng những chiếc phao.", "eng": "The channel is marked by buoys."}, {"viet": "Đứa bé rúc vào lòng mẹ và ngủ luôn.", "eng": "The child nestled up to its mother and fell asleep."}, {"viet": "Bọn trẻ con đuổi anh ta không cho chơi vì anh ta luôn luôn ăn gian.", "eng": "The children banished him from the game because he always cheated."}, {"viet": "Tất cả lũ trẻ đều nóng lòng muốn biết ai thắng.", "eng": "The children were all agog to know who had won."}, {"viet": "Trung tâm thành phố thật là náo nhiệt.", "eng": "The city centre was bustling with life."}, {"viet": "Quần áo vứt lung tung trong ngăn kéo.", "eng": "The clothes were all jumbled up in the drawer."}, {"viet": "Sự biến Bắc Mỹ thành thuộc địa bởi người Anh và người Pháp.", "eng": "The colonization of North America by the British and French."}, {"viet": "Trước đây công ty đó thuộc về một tập đoàn ngân hàng quốc tế.", "eng": "The company formerly belonged to an international banking group."}, {"viet": "Máy vi tính phát ra tiếng bíp bíp đều đặn.", "eng": "The computer gave a regular bleep."}, {"viet": "Những điều chống chỉ định được kê ra đối với loại thuốc viên này có nghĩa là cô ấy không được dùng các thuốc đó.", "eng": "The contra-indications listed for the pills meant that she could not take them."}, {"viet": "Quốc gia đó, kiệt quệ sau nhiều năm chiến tranh, đã bắt đầu từ từ hồi phục lại.", "eng": "The country, prostrate after years of war, began slowly to recover."}, {"viet": "Con bò quất đuôi xua ruồi.", "eng": "The cow brushed away the flies with a whisk of its tail."}, {"viet": "Đám đông la ó buộc diễn giả phải ngưng nói.", "eng": "The crowd shouted the speaker down."}, {"viet": "Người chạy xe đạp bị một chiếc xe tải đâm ngã.", "eng": "The cyclist was run down by a lorry."}, {"viet": "Những sự phân hoá sâu rộng trong xã hội ngày nay.", "eng": "The deep, widening divisions in society today."}, {"viet": "Kẻ khốn nạn đáng khinh ăn cắp cả tiền của bà già.", "eng": "The despicable wretch who stole the old woman's money."}, {"viet": "Những lời nói không ra đâu vào đâu của một ông lão.", "eng": "The disconnected ramblings of an old man."}, {"viet": "Bác sĩ đã được mời đến một ca cấp cứu.", "eng": "The doctor has been called away to an urgent case."}, {"viet": "Con chó gầm gừ tôi như đe dọa.", "eng": "The dog growled at me threateningly."}, {"viet": "Ống cống bị tắc vì lá rụng.", "eng": "The drains me bunged up with dead leaves."}, {"viet": "Con đại bàng giang rộng cánh bay.", "eng": "The eagle took flight with widespread wings."}, {"viet": "Hai nguyên tố được tổng hợp bằng một quá trình hóa học.", "eng": "The elements are synthesized by a chemical process."}, {"viet": "Toàn tập tác phẩm của Milton.", "eng": "The entire corpus of Milton's works."}, {"viet": "Niềm hân hoan khi nghĩ đến chuyện được đi tàu thuỷ vòng quanh thế giới.", "eng": "The excitements associated with a cruise around the world."}, {"viet": "Máy móc của xí nghiệp nằm không trong thời gian công nhân đình công.", "eng": "The factory machines lay idle during the worker's strike."}, {"viet": "Cái máy cắt cỏ hư hỏng đã nghiền nát cỏ.", "eng": "The faulty lawn mower chewed up the grass."}, {"viet": "Công ty đang hợp tác sản xuất một sản phẩm mới với những đối tác ở nước ngoài.", "eng": "The film is working on a new product in combination with several overseas partners."}, {"viet": "Hãng này xuất sắc trong việc chế tạo các ra-đi-ô bán dẫn rẻ tiền.", "eng": "The firm excels at producing cheap transistor radios."}, {"viet": "Những tín hiệu đầu tiên về mùa đông đang đến gần.", "eng": "The first signs that winter is approaching."}, {"viet": "Thức ăn ở đây thật tuyệt hảo.", "eng": "The food here is first-rate."}, {"viet": "Tiếng Pháp có nhiều từ ngữ đặc Anh, chẳng hạn như'le weekend'.", "eng": "The French language contains many Anglicisms, such as'le weekend'."}, {"viet": "Khoảng cách giữa hai người chạy đua đang thu hẹp lại.", "eng": "The gap between the two runners is beginning to close."}, {"viet": "Có tài làm thân một cách dễ dàng.", "eng": "The gift of making friends easily."}, {"viet": "Chính sách cứng rắn mới của chính phủ đối với tội ác có tổ chức.", "eng": "The government's new get tough policy on organised crime."}, {"viet": "Chính phủ dự định bắt đầu ngay các kế hoạch tư nhân hoá.", "eng": "The government intends to go ahead with its privatization plans."}, {"viet": "Viên toàn quyền đã ra sắc lệnh để tang một ngày.", "eng": "The governor decreed a day of mourning."}, {"viet": "Mặt đất lầy lội và gập ghềnh, nhưng chúng tôi vẫn lặn lội đi.", "eng": "The ground was muddy and uneven, but we toiled on."}, {"viet": "Tiếng óc ách của dòng suối trên những viên đá nhỏ.", "eng": "The gurgle of the brook over the little pebbles."}, {"viet": "Gót những đôi giày này đã mòn vẹt.", "eng": "The heels of these shoes are quite worn down."}, {"viet": "Con ngựa ấy đang kéo một xe nặng lên dốc.", "eng": "The horse was pulling a heavy cart up a steep slope."}, {"viet": "Mới đây mà căn nhà đã đổi chủ nhiều lần.", "eng": "The house has changed hands several times recently."}, {"viet": "Người thợ săn đã bắn chết con nai đực.", "eng": "The hunter shot the stag dead."}, {"viet": "Văn chương rắc rối không thể hiểu nổi của các tài liệu về thuế thu nhập.", "eng": "The incomprehensible officialese of income tax documents."}, {"viet": "Công ty bảo hiểm trả cho anh ta 2.000 đô la tiền bồi thường cho chiếc xe bị mất của anh ta.", "eng": "The insurance company paid him $ 2000 as compensation for the loss of his car."}, {"viet": "Công việc đó không đòi hỏi một sự đào tạo chính qui nào cả.", "eng": "The job does not require any formal training."}, {"viet": "Hội thẩm đoàn đưa ra phán quyết là có tội.", "eng": "The jury returned a verdict of guilty."}, {"viet": "Hồ có thể cung cấp nước cho một thành phố và có thể cho thủy nông.", "eng": "The lake may furnish water for a city, it may furnish for irrigation."}, {"viet": "Luật quy định những hình phạt nặng đối với tội trạng này.", "eng": "The law prescribes heavy penalties for this offence."}, {"viet": "Chữ viết trên tờ quảng cáo trông rất hấp dẫn.", "eng": "The lettering on the poster is very eye-catching."}, {"viet": "Mớ quần áo cần phải cân trước khi bỏ vào máy giặt.", "eng": "The load must be weighed before it is put in the washing-machine."}, {"viet": "Ấn bản buổi trưa của một tờ báo.", "eng": "The lunch time edition of a newspaper."}, {"viet": "Ông ấy làm những công việc vặt trong vườn của cha tôi.", "eng": "The man does odd jobs in my father's garden."}, {"viet": "Trận đấu bị hủy bỏ vì thời tiết xấu.", "eng": "The match was abandoned because of bad weather."}, {"viet": "Cuộc họp diễn ra một cách bí mật.", "eng": "The meeting took place behind closed doors."}, {"viet": "Mức đặt hàng tối thiểu là 500 tá thì quá lớn đối với chúng tôi.", "eng": "The minimum order of 500 dozen is too large for us."}, {"viet": "Số tiền chúng tôi yêu cầu không có sẵn.", "eng": "The money was asked for was not forthcoming."}, {"viet": "Da loang lổ nhiều màu sắc của một con rắn.", "eng": "The mottled skin of a snake."}, {"viet": "Những tên mà họ đặt cho các chòm sao sẽ cho chúng ta biết họ đã thấy những hình gì.", "eng": "The names they gave the constellations tell us what pictures they saw."}, {"viet": "Loại dược phẩm mới này được chào đón như một khám phá quan trọng nhất trong nhiều năm.", "eng": "The new drug has been acclaimed as the most important discovery for years."}, {"viet": "Bản báo cáo mới có những hàm ý sâu xa cho tương lai của phát thanh.", "eng": "The new report has far-reaching implications for the future of broadcasting."}, {"viet": "Báo chí công kích luật thuế mới.", "eng": "The newspaper attacked the new tax."}, {"viet": "Ý định về đường hầm qua eo biển Măngsơ đã được nghĩ đến cách đây hơn một thế kỷ.", "eng": "The notion of a Channel Tunnel first saw the light of day more than a century ago."}, {"viet": "Có lẽ cô ấy sẽ thắng.", "eng": "The odds are that she'll win."}, {"viet": "Ông già đã bị cảnh nghèo nàn làm cho bẳn tính.", "eng": "The old man has been soured by poverty."}, {"viet": "Các đảng đối lập thủ lợi về chính trị từ những bất đồng ý kiến trong Nội các.", "eng": "The Opposition parties made political capital out of the disagreements within the Cabinet."}, {"viet": "Sơn đó có mặt bóng như xa tanh.", "eng": "The paint has a satin finish."}, {"viet": "Buổi tiệc đó đúng là ỉu xìu.", "eng": "The party was a bit of a damp squib."}, {"viet": "Điều khoản phạt nằm khuất trong phần chữ in nhỏ.", "eng": "The penalty clause was hidden in the small print."}, {"viet": "Thái độ thiếu văn hoá của công chúng đưa đến kết quả là tác phẩm bị gạt bỏ.", "eng": "The philistine attitude of the public resulted in the work being abandoned."}, {"viet": "Ống dẫn bị tắc, làm trào nước ra.", "eng": "The pipe is blocked, give it a good flush."}, {"viet": "Các kế hoạch đó đã được văn phòng của chúng tôi tại New York đánh fax cho chúng tôi rồi.", "eng": "The plans were faxed to us by our New York office."}, {"viet": "Hoàn cảnh người bị đói quá khủng khiếp không dám nghĩ tới.", "eng": "The plight of starving people is too awful to think about."}, {"viet": "Cảnh sát bắn vài viên đạn cao su vào đám đông.", "eng": "The police fired several rubber bullets into the crowd."}, {"viet": "Cảnh sát nghi ngờ cô ta cầm đầu một bọn làm giả.", "eng": "The police suspected her of fronting for a gang of forgers."}, {"viet": "Toàn dân nói chung đều ủng hộ việc cải cách.", "eng": "The population as a whole are in favour of the reform."}, {"viet": "Việc chuẩn bị thiếu sót một cách đáng tiếc.", "eng": "The preparations were woefully inadequate."}, {"viet": "Báo chí có thể không bị tác động bởi chuẩn mức của điều được nhiều người chấp nhận.", "eng": "The press can resist the standard of the lowest common denominator."}, {"viet": "Thủ tướng sẽ tổ chức một cuộc họp báo vào sáng mai.", "eng": "The Prime Minister will be giving a press conference tomorrow morning."}, {"viet": "Họ đã quá cường điệu các vấn đề đó.", "eng": "The problems have been greatly overstated."}, {"viet": "Những đề nghị đó vẫn còn đang được xem xét.", "eng": "The proposals are still under examination."}, {"viet": "Cái đẩy xô anh ấy qua cửa sổ.", "eng": "The push precipitated him through the window."}, {"viet": "Bọn cướp cải trang làm người bảo vệ.", "eng": "The raiders disguised themselves as security guards."}, {"viet": "Những phát hiện gần đây đã khuấy động sự quan tâm to lớn trong giới bác sĩ.", "eng": "The recent discoveries have excited great interest among doctors."}, {"viet": "Phát hiện chính của báo cáo là những khoản tiền trợ cấp không thoả đáng.", "eng": "The report's main finding is that pensions are inadequate."}, {"viet": "Sự phục hồi cơ đồ của công ty.", "eng": "The retrieval of the company's fortunes."}, {"viet": "Nước sông lên to vì lũ.", "eng": "The river was swollen with flood water."}, {"viet": "Căn phòng trở nên lạnh hơn khi lò sưởi tàn dần.", "eng": "The room grew colder as the fire burnt down."}, {"viet": "Sự đứt mạch máu, sự vỡ, nứt của quả đậu, sự rách màng cơ bắp.", "eng": "The rupture of a blood vessel, seedpod, membrane."}, {"viet": "Cảnh tượng tội ác, tai nạn v. v..", "eng": "The scene of a crime, an accident, etc."}, {"viet": "Dấu niêm trên chai đã bị nát ra.", "eng": "The seal on the bottle has perished."}, {"viet": "Những người ở cản trở nhiều hơn là giúp ích cho tôi.", "eng": "The servants were more of a hindrance than a help to me."}, {"viet": "Con tàu lướt nhẹ nhàng vào cảng ban đêm.", "eng": "The ship slipped into the harbour at night."}, {"viet": "Cuộc trình diễn kéo dài thêm một tuần nữa do yêu cầu của công chúng.", "eng": "The show was held over for another week popular demand."}, {"viet": "Tình hình đòi hỏi tôi phải ở đó.", "eng": "The situation requires that I should be there."}, {"viet": "Sự thay đổi xã hội đã xảy ra ở Trung Quốc.", "eng": "The social metamorphosis that has occurred in China."}, {"viet": "Tiếng kêu leng keng của các vòng đeo tay và chân.", "eng": "The sound of jingling bracelets and bangles."}, {"viet": "Nước suối có vị tinh khiết.", "eng": "The spring water was sweet to the taste."}, {"viet": "Những thành viên ban tổ chức sẽ kiểm tra đường đua để xem có thể tiến hành được cuộc đua hay không.", "eng": "The stewards will inspect the course to see if racing is possible."}, {"viet": "Những người đình công đồng ý trở lại làm việc với điều kiện là các người lãnh đạo của họ sẽ không bị trù dập.", "eng": "The strikers agreed to return to work provided there would be no victimization of their leaders."}, {"viet": "Mặt trời lặn ( xuống ) dưới đường chân trời.", "eng": "The sun dipped ( down ) below the horizon."}, {"viet": "Cái vị chua của quả chanh làm cô ta phải nhăn mặt lại.", "eng": "The taste of the lemon made her screw up her face."}, {"viet": "Đội bóng biểu lộ lòng tin tưởng trước khi vào trận đấu.", "eng": "The team breathed confidence before the match."}, {"viet": "Kịch không còn có sức lôi cuốn đối với anh ta nữa.", "eng": "The theatre has lost its appeal to him."}, {"viet": "Ngói trên mái nhà gối viên nọ lên viên kia.", "eng": "The tiles on the roof overlap one another."}, {"viet": "Thành phố đã được giành lại từ tay quân địch.", "eng": "The town was recaptured from the enemy."}, {"viet": "Cây đầy những chùm hoa.", "eng": "The trees were full of clusters of flowers."}, {"viet": "Hai nhóm người đi bộ đã họp lại với nhau trong thời gian còn lại của kỳ nghỉ hè.", "eng": "The two groups of walkers joined up for the rest of the holiday."}, {"viet": "Công đoàn đang bị lâm vào vòng nguy hiểm vì quá bạo tay trong cuộc tranh chấp hiện nay.", "eng": "The union is in danger of overplaying its hand in the current dispute."}, {"viet": "Lời phán quyết của hội đồng xét xử là'không có tội'.", "eng": "The verdict of the jury was'not guilty'."}, {"viet": "Tường có một lỗ hổng để cho ánh sáng vào.", "eng": "The wall has an aperture for admitting light."}, {"viet": "Đám cưới được phương tiện truyền thông đưa tin một cách rộng rãi.", "eng": "The wedding got massive media coverage."}, {"viet": "Gió đã làm cho họ có thể ra khơi được lúc bình minh.", "eng": "The wind favoured their sailing at dawn."}, {"viet": "Câu'ký duyệt'ở đây trước mặt của nhân viên trả tiền được in ở đó.", "eng": "The words'countersign here in presence of paying agent are printed there."}, {"viet": "Những con vật nhỏ nhảy nhót ở cánh đồng.", "eng": "The young animals were bounding about the field."}, {"viet": "Hãng của họ trở thành nổi tiếng vì chất lượng.", "eng": "Their firm became a byword for quality."}, {"viet": "Tư thế xã hội của họ không tương xứng với những lời nói của họ.", "eng": "Their social attitudes belie their words."}, {"viet": "Cả cuộc đời họ là sự vật lộn không ngừng với nghèo khó.", "eng": "Then whole life was a constant battle against poverty."}, {"viet": "Có một chỗ rách trên ống tay áo khoác ngoài của tôi.", "eng": "There's a tear in the arm of my jacket."}, {"viet": "Không có nhiều thú vui ban đêm ở thị trấn nhỏ này.", "eng": "There's not much night-life in this small town."}, {"viet": "Có những chuyến tàu đặc biệt đi ra bờ biển trong mùa hè.", "eng": "There are extra trains to the seaside during the summer."}, {"viet": "Có sáu bộ thang quấn phục vụ cho trung tâm mua sắm ở tầng hầm.", "eng": "There are six sets of escalators which service the basement shopping center."}, {"viet": "Có gián đoạn trong công việc học tập của anh ta.", "eng": "There has been discontinuity in his education."}, {"viet": "Có một nhà vệ sinh công cộng tại góc đường.", "eng": "There is a public convenience on the street corner."}, {"viet": "Không có gì cản được gió khi nó thổi trên những dải cát mênh mông.", "eng": "There is nothing to break the wind as it blows over the great stretches of sand."}, {"viet": "Có một lớp mỡ nhờn trên cái chậu chưa rửa.", "eng": "There was a coating of slime on the unwashed sink."}, {"viet": "Có rất nhiều lo lắng cho tương lai của những nhà hát này.", "eng": "There was much anxiety about the future of these theatres."}, {"viet": "Có binh lính đóng ở khắp thành phố.", "eng": "There were soldiers positioned all round the town."}, {"viet": "Những rèm này sẽ không hợp với thảm của anh.", "eng": "These curtains won't match your carpet."}, {"viet": "Các cây này sẽ nở hoa vào mùa xuân.", "eng": "These plants will flower in the spring."}, {"viet": "Họ đi tìm chất lượng chứ không phải vẻ đẹp bề ngoài.", "eng": "They're looking for quality construction, not aesthetics."}, {"viet": "Tất cả bọn họ đều đã hăng say làm việc và chẳng mấy chốc đã xong công việc.", "eng": "They all pitched in and soon finished the job."}, {"viet": "Họ đang đợi tôi ở đây.", "eng": "They are waiting for me here."}, {"viet": "Họ vỗ tay theo nhịp nhạc.", "eng": "They clapped their hands in time to the music."}, {"viet": "Người ta không còn sản xuất loại này nữa đâu.", "eng": "They don't make them like this any more."}, {"viet": "Chúng phát triển rất nhanh, ra hoa và hình thành các hạt.", "eng": "They grow very fast, bloom, and form seeds."}, {"viet": "Họ không hướng dẫn cho chúng tôi phải đi đâu.", "eng": "They haven't instructed us where to go."}, {"viet": "Họ cố gắng từ bỏ thói quen hút thuốc.", "eng": "They managed to break themselves of smoking."}, {"viet": "Họ gạt bỏ kế hoạch quyên góp tiền của chúng tôi.", "eng": "They pooh-poohed our scheme for raising money."}, {"viet": "Họ nói có khả năng mưa vào cuối tuần.", "eng": "They say there's a possibility of rain on the weekend."}, {"viet": "Họ kéo đi từng nhóm khắp cả Tây Âu, nơi người La Mã thống trị.", "eng": "They swarmed over all of western Europe that had been ruled by Rome."}, {"viet": "Họ sợ bị lạc.", "eng": "They were afraid of getting lost."}, {"viet": "Họ đã được chuyển khỏi lớp tiếng Anh, thí dụ để có các bài học dành riêng.", "eng": "They were removed from the English class."}, {"viet": "Có 31 xu cho mỗi ½ ounce.", "eng": "Thirty-one cents per 1/2 ounce."}, {"viet": "Hội từ thiện này là một tổ chức vô vị lợi.", "eng": "This charity is a non-profit-making organization."}, {"viet": "Thuốc này chỉ nên dùng dưới sự giám sát của một bác sĩ.", "eng": "This drug should only be taken under the supervision of a doctor."}, {"viet": "Đây là phòng chơi game và câu lạc bộ của nhân viên.", "eng": "This is a game room and lounge for the men."}, {"viet": "Đó là điều phi lí nhất tôi từng được nghe.", "eng": "This is the silliest banana oil I have ever heard."}, {"viet": "Người ta đến gần công trình này bằng những bậc thềm.", "eng": "This monument is a approached hy steps."}, {"viet": "Công việc của viên sĩ quan cảnh sát này là khám phá các vụ gian lận.", "eng": "This police officer's job is to detect fraud."}, {"viet": "Loại công việc này đòi hỏi phải rất kiên nhẫn.", "eng": "This sort of work demands great patience."}, {"viet": "Vũ khí này bắn vào những tên lửa phòng không.", "eng": "This weapon fires anti-aircraft missiles."}, {"viet": "Hàng ngàn người đã chết hoặc què cụt vì những cuộc ném bom.", "eng": "Thousands suffered death or mutilation as a result of the bomb attacks."}, {"viet": "Sáng mai, tôi nghĩ ông cần nghỉ ngơi sau một chuyến đi dài mệt mỏi như vậy.", "eng": "Tomorrow morning, I think you need a rest after such a long tedious journey."}, {"viet": "Trừ phi mắt tôi đánh lừa tôi, phó tổng thống đang ngồi ở kia kìa.", "eng": "Unless my eyes deceive me, that's the vice-president sitting over there."}, {"viet": "Rửa, lau, cọ, chải, v. v. sạch cái gì.", "eng": "Wash, wipe, scrub, brush, etc sth clean."}, {"viet": "Chúng ta sẽ phải quét vôi đè lên những vết bẩn trên tường.", "eng": "We'll have to paint over the dirty marks on the wall."}, {"viet": "Chúng tôi rất phấn khởi hay tin thành công của anh.", "eng": "We're immensely excited to learn of your success."}, {"viet": "Chúng tôi đã đi tới chỗ bế tắc trong nỗ lực đạt được một thoả thuận.", "eng": "We've come to a dead end in our efforts to reach an agreement."}, {"viet": "Chúng tôi đã đồng ý mà không cần phải tranh luận thêm nhiều.", "eng": "We agreed without much further argument."}, {"viet": "Chúng ta chỉ là những quân tốt đen trong cuộc đấu tranh giành quyền lực.", "eng": "We are mere pawns in the struggle for power."}, {"viet": "Chúng tôi công bố kế hoạch năm mới của chúng tôi.", "eng": "We broached our plans for the new year."}, {"viet": "Chúng tôi sẽ gia hạn hợp đồng nếu cần thiết.", "eng": "We can renew the contract if necessary."}, {"viet": "Chúng tôi đã quyết định không bới chuyện ra làm gì và không kiện ra toà.", "eng": "We decided to let sleeping dogs lie and not take them to court."}, {"viet": "Chúng tôi đã mạnh mẽ bày tỏ quan điểm.", "eng": "We expressed our view with some violence."}, {"viet": "Chúng tôi đã tụt lại đằng sau quá xa, thành thử tiếp tục nữa cũng chẳng ích gì.", "eng": "We had fallen so far behind that it seemed pointless continuing."}, {"viet": "Chúng tôi có cà phê, cà phê nhập từ Ý.", "eng": "We have coffee, coffee from Italy."}, {"viet": "Chúng ta không có đủ bằng chứng để buộc tội.", "eng": "We haven't enough evidence to prefer charges."}, {"viet": "Chúng tôi sống trong một căn hộ nhỏ và tôi đem áo quần của chúng tôi đến tiệm giặt tự động.", "eng": "We lived in a very small apartment, and I took our clothes to the Laundromat."}, {"viet": "Chúng ta cần phải tập trung nỗ lực vào việc cải tiến giáo dục.", "eng": "We must concentrate our efforts on improving education."}, {"viet": "Chúng tôi cần ghi thêm một điểm nữa mới thắng cuộc.", "eng": "We need one more point to win the game."}, {"viet": "Một tuần chúng ta trễ một hoặc hai lần gì đó.", "eng": "We're late once or twice a week."}, {"viet": "Chúng tôi ẩn mình dưới cây dâu tây.", "eng": "We sheltered under the strawberry trees."}, {"viet": "Chúng tôi đã lợi dụng cơ hội đó đi thăm lâu đài.", "eng": "We took the opportunity of visiting the palace."}, {"viet": "Chúng tôi được khuyên đeo găng tay ấm để tránh cái giá lạnh của mùa đông.", "eng": "We were advised to wear mittens to avoid frost bit in winter."}, {"viet": "Sau chuyến đi dài ngày, chúng tôi hoàn toàn kiệt sức.", "eng": "We were totally shattered after the long journey."}, {"viet": "Thứ tư đến sau thứ ba và trước thứ năm.", "eng": "Wednesday comes after Tuesday and before Thursday."}, {"viet": "À, dường như chúng ta đã thảo luận mọi thứ rồi.", "eng": "Well, it seems that we have discussed everything."}, {"viet": "Thời tiết ẩm ướt là một nét đặc trưng của cuộc sống ở Scotland.", "eng": "Wet weather is a feature of life in Scotland."}, {"viet": "Những thú tiêu khiển nào được giới trẻ ở Anh ưa chuộng?", "eng": "What are popular pastimes among young people in Britain?"}, {"viet": "Hôm nay là thứ mấy vậy, ông Lý?", "eng": "What day is it today, Mr. Li?"}, {"viet": "Thức ăn nào được ưa chuộng ở Anh?", "eng": "What food is popular in the U. K.?"}, {"viet": "Dự báo thời tiết dài hạn ra sao?", "eng": "What is the long-term forecast?"}, {"viet": "Loại vết ố gì vậy ạ?", "eng": "What kind of stain is it?"}, {"viet": "Ông đang tìm căn hộ cỡ nào?", "eng": "What size apartment are you looking for?"}, {"viet": "Những tình cảm tức giận giữa họ bây giờ đã tan biến hết.", "eng": "Whatever ill-feeling there had been between them had vanished by now."}, {"viet": "Khi thấy tôi đến, nó quay ngoắt ngược trở lại.", "eng": "When he saw me coming he sheered off in the opposite direction."}, {"viet": "Khi không có hồi âm tôi bắt đầu cảm thấy thất vọng.", "eng": "When no replies came, I began to feel downhearted."}, {"viet": "Khi họ tổ chức các bữa tiệc, họ thực sự làm linh đình.", "eng": "When they give parties they really go to town."}, {"viet": "Chúng tôi hiện ở chỗ nào trên bản đồ này vậy?", "eng": "Where are we on this map?"}, {"viet": "Dù bạn có trễ một tiếng hay hai tiếng thì cũng không sao đâu.", "eng": "Whether you're late by one hour or two hours, it won't matter."}, {"viet": "Tôi phải đi xe điện ngầm nào để đến Manhattan?", "eng": "Which subway should I take to get to Manhattan?"}, {"viet": "Ai đã được chọn để dẫn phái đoàn?", "eng": "Who has been selected to lead the delegation?"}, {"viet": "Tại sao anh không đón chuyến xe buýt cuối cùng như tôi đã bảo anh?", "eng": "Why didn't you catch the last bus as I told you to?"}, {"viet": "Một ngày đẹp trời như thế này mà anh lại ở nhà thật tôi không thể hiểu nổi!", "eng": "Why you stay indoors on a beautiful day like this defeats me!"}, {"viet": "Anh làm ơn chăm nom lũ trẻ khi tôi đi vắng nhé!", "eng": "Will you mind the children while I go out?"}, {"viet": "Với một sự khiêm tốn đáng khen, người biên tập không đưa một bài thơ nào của mình vào tuyển tập.", "eng": "With commendable modesty, the editor has not included any of his own poems in the collection."}, {"viet": "Làm việc với mức độ nhiệt tình thay đổi.", "eng": "Work with varying degrees of enthusiasm."}, {"viet": "Ông có muốn thêm một ít bánh mì phết bơ nữa không?", "eng": "Would you like some more bread and butter?"}, {"viet": "Liệu anh có thể gõ cửa đánh thức tôi dậy lúc 7 giờ được không?", "eng": "Would you please knock me up at 7 o'clock?"}, {"viet": "Vâng, và những con ong đang bay quanh quẩn các bông hoa.", "eng": "Yes, and the bees are flying about up and down the flowers."}, {"viet": "Vâng, có một cái ở ngay cạnh tiền sảnh.", "eng": "Yes, there's one just off the lobby."}, {"viet": "Anh sẽ chết có ngày nếu anh cứ tiếp tục lái xe nhanh như vậy.", "eng": "You'll go out feet first if you keep driving so fast."}, {"viet": "Người ta không trả tiền cho anh để anh ngồi loanh quanh chẳng làm gì cả!", "eng": "You're not paid to sit around doing nothing!"}, {"viet": "Anh có thể tự do đến và đi tuỳ ý.", "eng": "You are free to come and go at your pleasure."}, {"viet": "Anh không thể đánh giá sự trung thành như thế bằng tiền được.", "eng": "You can't put a price on that sort of loyalty."}, {"viet": "Anh có thể đỗ xe ở bên này hay bên kia đường phố.", "eng": "You can park on either side of the street."}, {"viet": "Ông cũng không biết cách điều khiển những cái máy cũ.", "eng": "You didn't know how to operate the old ones, either."}, {"viet": "Anh có khả năng làm tốt việc này.", "eng": "You have the capability of doing this job well."}, {"viet": "Trông anh có vẻ xanh xao lắm, tôi nghĩ anh cần phải bồi dưỡng một chút.", "eng": "You look very pale, I think you need feeding up a bit."}, {"viet": "Ông phải luôn luôn nhớ một điều: mạng sống của ông đang bị đe doạ.", "eng": "You must keep sight of one fact: your life is in danger."}, {"viet": "Trời quá lạnh như thế này thì anh phải ở trong nhà thôi.", "eng": "You ought to keep indoors with that heavy cold."}, {"viet": "Anh nên ngắt bỏ những lá héo đi.", "eng": "You should remove the withered leaves."}, {"viet": "Cậu đã tính sai 5 pao.", "eng": "You were 5 pounds out in your reckoning."}, {"viet": "Những cặp vợ chồng trẻ tuổi thường là những người hay mua đồ trang trí nội thất.", "eng": "Young marrieds are prime buyers of furniture."}, {"viet": "Căn phòng mới của ông nhìn ra hồ.", "eng": "Your new room faces the lake."}]