[{"viet": "Năm 1949 là năm kỷ niệm lần thứ hai trăm ngày sinh của Goethe.", "eng": "1949 was the bicentenary of Goethe's birth."}, {"viet": "Một cái máy ảnh là một hộp sáng kín.", "eng": "A camera is a light-tight box."}, {"viet": "Một nhân viên khách sạn đến dọn dẹp phòng, người khách trọ không muốn cô ấy dọn dẹp phòng vào lúc này.", "eng": "A clerk comes to clean the room and the guest doesn't want her to clean it now."}, {"viet": "Một quốc gia bị chia hai vì nội chiến.", "eng": "A country rent in two by civil war."}, {"viet": "Một bản thiết kế vốn đã có nhược điểm.", "eng": "A design which is inherently weak."}, {"viet": "Sự giảm sút nhu cầu tàu chở dầu đã làm cho hàng ngàn công ăn việc làm trong ngành công nghiệp đóng tàu lâm vào tình trạng nguy ngập.", "eng": "A fall in demand for oil tankers has placed thousands of jobs in the ship-building industry in jeopardy."}, {"viet": "Thư gửi phát chuyển nhanh sẽ đến vào ngày hôm sau.", "eng": "A first-class letter should arrive the following day."}, {"viet": "Người ta đã đoán trước nàng sẽ rất thành công trong ngành Dân Chính.", "eng": "A glittering career had been predicted for her in the Civil Service."}, {"viet": "Một vị khách thích uống trà.", "eng": "A guest likes to drink tea."}, {"viet": "Một ngôi nhà bị tàn phá bởi bom, lửa, vụ nổ.", "eng": "A house destroyed by bombs, fire, explosion."}, {"viet": "Một đám đông người chen lấn qua hàng rào chắn.", "eng": "A large crowd crushed past the barrier."}, {"viet": "Một thời gian ngắn sau đó, người ta lại chế tạo ra một loại đồng hồ rô-nô-mét chỉ chạy chậm 7 giây qua một cuộc du hành 46 ngày.", "eng": "A little later a chronometer was made that lost only 7 seconds on a 46 days voyage."}, {"viet": "Một người đã trải qua cả cảnh nghèo túng lẫn giàu có.", "eng": "A man who has known both poverty and riches."}, {"viet": "Một con khỉ thì chỉ vài năm là trưởng thành nhưng một con người thì tối thiểu thì phải mười sáu năm mới trưởng thành được.", "eng": "A monkey is mature at a few years old, but a human being is not mature till at least sixteen."}, {"viet": "Một tạp chí thời trang mới dành cho thiếu niên.", "eng": "A new with-it magazine for teenagers."}, {"viet": "Một cảnh tượng thanh bình nơi đồng quê và những chú bò đang uống nước bên dòng suối.", "eng": "A pastoral scene of cows drinking from a steam."}, {"viet": "Một nỗ lực đáng khinh để cứu vãn bản thân hắn khỏi điều ô nhục.", "eng": "A pitiable attempt to save himself from disgrace."}, {"viet": "Một đợt sản xuất mấy nghìn đĩa hát.", "eng": "A pressing of several thousand records."}, {"viet": "Một bản tường trình những sự việc khá lan man.", "eng": "A rather discursive account of the events."}, {"viet": "Một căn phòng được trang trí bằng bong bóng và băng giấy.", "eng": "A room decorated with balloons and streamers."}, {"viet": "Một hòn đảo hẻo lánh nằm xa đất liền.", "eng": "A sequestered island far from the mainland."}, {"viet": "Thước tính là một loại máy tính tương tự đơn giản.", "eng": "A slide-rule is a simple analogue computer."}, {"viet": "Một bài diễn văn đầy những quan điểm cao cả.", "eng": "A speech full of noble sentiments."}, {"viet": "Một bản tóm tắt ngắn gọn về cuộc tranh luận đó.", "eng": "A succinct summary of the argument."}, {"viet": "Một luận thuyết giả định rằng có sự tồn tại của những thế giới khác ngoài thế giới của chúng ta.", "eng": "A theory which supposes the existence of other worlds besides our own."}, {"viet": "Bản dịch thơ tác phẩm Iliad của Homer.", "eng": "A verse translation of Homer's Iliad."}, {"viet": "Một cố vấn khôn ngoan trong lúc cấp thiết.", "eng": "A wise counselor in time of need."}, {"viet": "Sự chịu trách nhiệm là từ đang thịnh hành trong giới chính trị.", "eng": "Accountability is the current vogue-word in politics."}, {"viet": "Các nhà quảng cáo và các nhà phát thanh, truyền hình có lẽ sẽ la ó phản đối bất cứ sự áp đặt cứng rắn nào.", "eng": "Advertisers and broadcasters would raise howls of protest against any strong clamp-down."}, {"viet": "Sau kỳ nghỉ của anh ta anh ta thấy khỏe trở lại.", "eng": "After his holiday he left regenerated."}, {"viet": "Sau thảm họa có nhiều người cần có thức ăn và chỗ ở.", "eng": "After the disaster there were many who wanted food and shelter."}, {"viet": "Hoảng sợ vì tiếng động, những con chim bay mất.", "eng": "Alarmed by the noise, the birds flew away."}, {"viet": "Thôi được, anh muốn làm gì thì làm-Tôi đã chán tranh cãi rồi.", "eng": "All right, have it your own way-I'm tired of arguing."}, {"viet": "Tất cả điều này là vòng đầu cho cuộc tranh cử chính.", "eng": "All this is preliminary to the main election struggle."}, {"viet": "Nước Mỹ năm nay sản xuất nhiều xe ôtô hơn năm ngoái.", "eng": "America produced more cars this year than last year."}, {"viet": "Một thuốc xoa để giảm đau cơ bắp.", "eng": "An application to relieve muscle pain."}, {"viet": "Một cán bộ điều hành làm việc không theo qui luật.", "eng": "An executive who is a law unto himself."}, {"viet": "Một hòn đảo có nước xanh biếc bao quanh.", "eng": "An island girdled about by the deep blue water."}, {"viet": "Một chuỗi các tai nạn bất hạnh.", "eng": "An unfortunate concatenation of mishaps."}, {"viet": "Và thậm chí bạn có thể bị một nhân viên cảnh sát ở đồn cảnh sát Yaesu bắt giữ nữa.", "eng": "And you can even get arrested by a police officer from the Yaesu police station."}, {"viet": "Dù sao đi nữa, tốt hơn là tôi nên mặc thêm đồ ấm.", "eng": "Anyway, I'd better put on more warm things."}, {"viet": "Ở nước bạn có nhiều phụ nữ đi làm phải không?", "eng": "Are there many career women in your country?"}, {"viet": "Anh có đồng ý tham gia chơi bài whist không?", "eng": "Are you in for this game of whist?"}, {"viet": "Bắt người nào đi lảng vảng có mưu đồ.", "eng": "Arrest somebody for loitering with intent."}, {"viet": "Bao lâu tôi còn sống, tôi sẽ chẳng bao giờ chán nhìn ngắm miền quê qua cửa xe lửa đâu.", "eng": "As long as live I'll never tire of seeing the countryside from a train window."}, {"viet": "Hãy yêu cầu người giao hàng giao thêm sữa vào dịp giáng sinh.", "eng": "Ask your roundsman for extra milk over Christmas."}, {"viet": "Ở cuối cảnh ba nữ diễn viên rời sân khấu.", "eng": "At the end of the third scene the actress exits."}, {"viet": "Vi khuẩn tăng trưởng trong một môi trường dinh dưỡng.", "eng": "Bacteria growing in a matrix of nutrients."}, {"viet": "Dứt khoát đi-Hãy nói rõ cho họ biết những gì anh cho là cần phải làm!", "eng": "Be decisive-tell them exactly what you think should be done!"}, {"viet": "Những cuộc thi sắc đẹp là một sự xúc phạm nhân phẩm phụ nữ.", "eng": "Beauty contests are insult to women."}, {"viet": "Ngoài ra, phải giữ nhiệt độ trong lò ổn định, và phải xoay vịt để vịt được quay chín đều.", "eng": "Besides, a steady temperature must be maintained in the oven and ducks must be rotated so that they are evenly roasted."}, {"viet": "Xương nối với khớp xương khác.", "eng": "Bones that are articulated with others."}, {"viet": "Nước Anh bị chiếm làm thuộc địa bởi người La Mã.", "eng": "Britain was colonized by the Romans."}, {"viet": "Nhưng trong phòng tôi không có tấm bảng nào cả.", "eng": "But I don't have one in my room."}, {"viet": "Nhưng những tên hư hỏng đó hay đi lang thang xuống khu tụ tập các bọn rượu chè lưu manh, phải không?", "eng": "But those bums down on Skid Row, aren't they?"}, {"viet": "Vào lúc bảy tuổi nó đã có thể viết chữ đẹp.", "eng": "By the age of seven he could write beautifully."}, {"viet": "Tôi có thể thanh toán tiền vé vào thẻ American Express của tôi được không?", "eng": "Can I charge that to my American Express card?"}, {"viet": "Chúng tôi hy vọng gặp ông ở nhà thờ không?", "eng": "Can we expect to see you at church?"}, {"viet": "Anh có thể đọc được bảng hiệu kia nói gì không?", "eng": "Can you make out what that sign says?"}, {"viet": "Xin ông chờ chốc lát được không?", "eng": "Can you wait a moment or two, please?"}, {"viet": "Một số tài nguyên là tối quan trọng vì nền an ninh của chúng ta tùy thuộc vào chúng.", "eng": "Certain resources are unexpendable because our security depends on them."}, {"viet": "Những đứa trẻ được nuôi dạy một cách lơi lỏng.", "eng": "Children who have been brought up permissively."}, {"viet": "Than đá, dầu mỏ và khoáng sản là những nguyên liệu của ngành công nghiệp.", "eng": "Coal, oil and minerals are the raw materials of industry."}, {"viet": "So với tác phẩm trước của ông ấy thì đây là cuốn tiểu thuyết khá tầm thường.", "eng": "Compared to his early work, this is a rather slight novel."}, {"viet": "Căng thẳng thường xuyên sẽ làm ta dễ cáu giận.", "eng": "Constant stress has made our nerves brittle."}, {"viet": "Cô vui lòng gọi điện đánh thức tôi dậy vào lúc 6 giờ sáng mai nhé?", "eng": "Could you give me a wake-up call at six tomorrow morning?"}, {"viet": "Cram đã chạy đua hay nên nhận được huy chương vàng.", "eng": "Cram ran a fine race to take the gold medal."}, {"viet": "Khiêu vũ và ca hát ở trong số nhiều tài năng của cô ấy.", "eng": "Dancing and singing were among her many accomplishments."}, {"viet": "Sương mù dày đặc bao phủ trên đường phố ở phía bắc và tầm nhìn rất hạn chế.", "eng": "Dense fog is covering roads in the north and visibility is very poor."}, {"viet": "Đã có lần nào bà ta tỏ ra thông cảm chưa?", "eng": "Did she once show any sympathy?"}, {"viet": "Anh đã không mượn mấy đĩa hát của tôi sao?", "eng": "Didn't you borrow some records of mine?"}, {"viet": "Liệu tôi có nhận ra vẻ mỉa mai trong giọng nói của anh không?", "eng": "Do I detect a note of irony in your voice?"}, {"viet": "Đất nước của bác luôn có thời tiết như thế này vào mùa hè phải không?", "eng": "Do you always have weather like this in summer?"}, {"viet": "Cô có chỗ ngồi ở tầng trên không?", "eng": "Do you have a seat in the upper level?"}, {"viet": "Anh có biết in xtăng-xin không?", "eng": "Do you know how to stencil?"}, {"viet": "Bạn thích cuộc sống bận rộn hay thư thả, nhàn hạ hơn?", "eng": "Do you prefer a busy life or a relaxed, slow-paced life?"}, {"viet": "Bạn có nghĩ cái váy màu đỏ này chói mắt quá không?", "eng": "Do you think this red skirt is too loud?"}, {"viet": "Cô ta có anh chị em gì không?", "eng": "Does she have any brothers or sisters?"}, {"viet": "Đừng có quá tàn nhẫn với em mày như thế.", "eng": "Don't be so unkind to your brother."}, {"viet": "Đừng có nói với tôi về cái cớ mệt nhọc đó.", "eng": "Don't give me that stuff about being tired."}, {"viet": "Đừng để cái cốc ở mép bàn, nó sẽ rơi đấy.", "eng": "Don't put that glass on the edge of the table, it might fall off."}, {"viet": "Đừng dùng quá nhiều xà phòng bột-nước ở đây rất ít muối khoáng.", "eng": "Don't use much soap powder-the water here is very soft."}, {"viet": "Uống trà vào lúc 4 giờ chiều là một tập quán phổ biến của người Anh.", "eng": "Drinking tea at 4 pm is a popular British institution."}, {"viet": "Kiếm sống bằng cách làm việc nửa buổi.", "eng": "Earn one's living by casual labour."}, {"viet": "Cứ nhảy theo nhạc disco xả láng đi-bạn chỉ có một lần tuổi xuân!", "eng": "Enjoy the disco-you're only young once!"}, {"viet": "Thỉnh thoảng cô ta lên gác để xem nó còn ngủ không.", "eng": "Every now and again she went upstairs to see if he was still asleep."}, {"viet": "Xin lỗi, ông có cái này mà màu sắc khác nhau?", "eng": "Excuse me, do you have this in a different color?"}, {"viet": "Các nhà máy sản xuất một loạt các loại vải dệt.", "eng": "Factories producing a range of textiles."}, {"viet": "Cảm thấy yên tâm về tương lai mình.", "eng": "Feel secure about one's future."}, {"viet": "Lính cứu hỏa đã sớm dập tắt đám cháy.", "eng": "Fireman soon put the fire out."}, {"viet": "Bay ở độ cao 6.000 mét trên mặt biển.", "eng": "Fly at a height of 6,000 metres above sea-level."}, {"viet": "Chiếc ôtô của tôi không nổ máy đến nay là ngày thứ sáu liên tiếp.", "eng": "For the sixth day running, my car wouldn't start."}, {"viet": "Từ vị trí của mình trên đỉnh vách núi, anh ta thấy quang cảnh rõ ràng của hải cảng.", "eng": "From his position on the cliff top, he had a good view of the harbour."}, {"viet": "Các nhà địa chất đã tính toán tuổi của trái đất.", "eng": "Geologists have calculated the age of the earth."}, {"viet": "Cho con cưỡi trên vai của bố đi chơi, bố ơi.", "eng": "Give me a ride on your shoulders, Daddy."}, {"viet": "Sang nhà kế bên mượn sữa.", "eng": "Go next door to borrow some milk."}, {"viet": "Grass là tiếng lóng trong giới tội phạm.", "eng": "Grass is criminal slang for informer."}, {"viet": "Sự làm việc chăm chỉ có thể bù đắp cho sự thiếu thông minh.", "eng": "Hard work can make up for a lack of intelligence."}, {"viet": "Chị có đôi bít tất dài nào không bị dệt sót chỉ không?", "eng": "Have you any tights that won't ladder?"}, {"viet": "Anh có mang theo tiền không?", "eng": "Have you got any money on you?"}, {"viet": "Nhất định anh ta sẽ kiếm nhiều tiền sau khi bán bản quyền làm phim và truyền hình dựa theo tác phẩm mới bán chạy nhất của mình.", "eng": "Having sold the film and TV rights to his new best seller he's absolutely quids in."}, {"viet": "Nó luôn luôn gạ gẫm xin ăn các bạn nó.", "eng": "He's always cadging meals from his friends."}, {"viet": "Anh ta cương quyết cứ kết hôn mặc dầu bố mẹ anh ta phản đối.", "eng": "He's determined to go through with the marriage despite his parents'opposition."}, {"viet": "Sổ sách kế toán này anh ta làm lộn xộn quá.", "eng": "He's made a real dog's breakfast of these accounts."}, {"viet": "Nó đã dạy cho con chó của nó vài trò khôn khéo.", "eng": "He's taught his dog some clever tricks."}, {"viet": "Nó luôn làm trái ngược cái ta đề nghị, phải không?", "eng": "He always does the opposite of what we suggest, right?"}, {"viet": "Ông ta bắt đầu nghi ngờ có âm mưu đen tối nào đó đang diễn ra.", "eng": "He began to suspect that some jiggery-pokery was going on."}, {"viet": "Nó ra tòa về tội chạy quá tốc độ.", "eng": "He came up before the magistrate for speeding."}, {"viet": "Anh ta đặt tạc một bức tượng của vợ mình.", "eng": "He commissioned a statue of his wife."}, {"viet": "Hắn cho rằng hắn có nhiệm vụ giúp đỡ người khác.", "eng": "He deemed that it was his duty to help."}, {"viet": "Ông ta không thích hợp với cá tính của một vị giáo sư đại học.", "eng": "He doesn't fit into the traditional mould of a university professor."}, {"viet": "Anh ta sống nhờ gạo và nước.", "eng": "He exists on rice and water."}, {"viet": "Anh ta sửa sang căn nhà nhỏ đó trước khi họ dọn đến ở.", "eng": "He fixed up the cottage before they moved in."}, {"viet": "Anh ấy hết phấn khởi lại đến chán nản.", "eng": "He gets cheerful and depress by turns."}, {"viet": "Anh ta lo ngại về buổi gặp gỡ với họ, nhưng sự đón tiếp nồng nhiệt của cô ta làm cho anh ta cảm thấy thoải mái.", "eng": "He had been dreading their meeting but her warm welcome soon put him at his ease."}, {"viet": "Gã có cái mặt dài như mặt ngựa.", "eng": "He has a long equine face."}, {"viet": "Hắn tự đưa mình vào thế kẹt không có lối thoát vì nhận tiền của họ.", "eng": "He has irretrievably compromised himself by accepting money from them."}, {"viet": "Anh ấy ghét khói thuốc mù mịt ở các quán rượu và quầy rượu.", "eng": "He hates the smokiness of bubs and bars."}, {"viet": "Ông ta được quảng cáo là sẽ đóng vai Othello.", "eng": "He is billed to appear as Othello."}, {"viet": "Anh ta là người trẻ nhất trong đội đó.", "eng": "He is the baby of the team."}, {"viet": "Ông ấy hôn vào sau gáy cô ta.", "eng": "He kissed her on the nape of her neck."}, {"viet": "Nó sống ở phía bắc nơi đây.", "eng": "He lives to the north of here."}, {"viet": "Ông ấy tỏ ra kính cẩn trước nhà vua.", "eng": "He made obeisance to the king."}, {"viet": "Tối qua hắn đã không đến đón cô ấy.", "eng": "He never came to pick her up last night."}, {"viet": "Hắn biểu diễn các động tác rất máy móc.", "eng": "He performed the movements very mechanically."}, {"viet": "Ông ta tiên đoán những biến cố kỳ lạ sẽ xảy ra.", "eng": "He prophesied the strange events that were to come."}, {"viet": "Anh ấy đọc suốt bài báo đó hai lần.", "eng": "He read the article through twice."}, {"viet": "Anh ta kiên quyết sống một cuộc sống tốt hơn trong tương lai.", "eng": "He resolved to lead a better life in the future."}, {"viet": "Hắn là một người học lõi.", "eng": "He's a very fly character."}, {"viet": "Anh ấy dán mắt vào màn ảnh ti-vi.", "eng": "He's glued to the television."}, {"viet": "Anh ấy diễn tả không giỏi lắm.", "eng": "He's not very good at description."}, {"viet": "Anh ta nhận việc làm đó, vì thế chúng tôi đã yêu cầu anh ta viết lời xác nhận.", "eng": "He said he would accept the job, so we have asked him to confirm it."}, {"viet": "Anh ta dường như tự chỉ định mình làm đại diện cho chúng ta.", "eng": "He seemed to have constituted himself our representative."}, {"viet": "Anh ta làm tôi ngượng vì ngủ gục trong buổi hoà nhạc.", "eng": "He showed me up by falling asleep at the concert."}, {"viet": "Anh ấy để thì giờ qua đi, không làm việc gì cả.", "eng": "He spent the afternoon lazing in the hammock."}, {"viet": "Anh ta đứng xoạc hai chân ra.", "eng": "He stood with his feet planted wide apart."}, {"viet": "Ấy không chịu khó đặc biệt gì đối với công việc của mình.", "eng": "He takes no special trouble with his work."}, {"viet": "Anh ấy liều khi đi qua cái cầu cũ ( nó có thể đổ ).", "eng": "He took a risk when he crossed the old bridge ( there was a chance it might fall down )."}, {"viet": "Anh ta tìm cách trút công việc của mình lên người khác.", "eng": "He tried to shuffle his work off onto others."}, {"viet": "Ông ta đợi cho đến khi tiếng vỗ tay lắng xuống.", "eng": "He waited until the applause had subsided."}, {"viet": "Cậu ta được phép bỏ môn toán trong chương trình học của mình năm thứ hai.", "eng": "He was allowed to drop math from his course in the second year."}, {"viet": "Nó đã bị bắt khi đang tìm cách đóng giả một sĩ quan quân đội.", "eng": "He was caught trying to impersonate a military officer."}, {"viet": "Nó được miễn truy tố vì còn trẻ.", "eng": "He was exempt from charges by virtue of his youth."}, {"viet": "Anh ta đã chết thảm trong một vụ tai nạn.", "eng": "He was killed tragically in an accident."}, {"viet": "Ông ta phải nộp số tiền đút lót cho bọn găngtơ bằng nửa lợi nhuận của mình.", "eng": "He was paying out half his profits as protection."}, {"viet": "Anh ta đang nhổ máu ra sau khi bị đấm vào mồm.", "eng": "He was spitting blood after being hit in the mouth."}, {"viet": "Anh ta đánh giá cao sự ủng hộ của các bạn đồng nghiệp trong thời gian anh ta ốm.", "eng": "He was very appreciative of his colleagues's support during his illness."}, {"viet": "Nó thì thầm một lời vào tai tôi.", "eng": "He whispered a word in my ear."}, {"viet": "Anh ta cũng sẽ kinh ngạc về tất cả sự quan tâm của thành phố ngày nay dành cho việc chống lại sự lây lan của các bệnh tật nguy hiểm.", "eng": "He would be surprised, too, at all the care that cities now take to keep dangerous contagious diseases from spreading."}, {"viet": "Ăn cắp toàn bộ sưu tập nữ trang của viện bảo tàng.", "eng": "Heisted the collection of jewels from the museum."}, {"viet": "Hành vi của cô ấy ngày một trở nên kì quặc đến nỗi tôi nghĩ không biết có phải cô ấy sắp điên không.", "eng": "Her behaviour's becoming so freakish that I wonder if she's going mad."}, {"viet": "Công tác mạo hiểm của cô ấy trong lòng địch giờ đây đã trở thành kỳ tích.", "eng": "Her daring work behind the enemy lines is now legend."}, {"viet": "Cha cô bé đã cõng cô ấy trên đoạn chót của chuyến đi.", "eng": "Her father gave her a pick-a-back for the last bit of the journey."}, {"viet": "Tính chân thật của cô ta nổi bật.", "eng": "Her honesty sticks out a mile."}, {"viet": "Đôi môi nàng hé nở một nụ cười.", "eng": "Her lips parted in a smile."}, {"viet": "Những khả năng xuất chúng của cô ta đã được chứng tỏ rõ ràng bằng sự thăng tiến nhanh chóng của mình.", "eng": "Her outstanding abilities were attested by her rapid promotion."}, {"viet": "Yêu cầu của cô ấy đặt tôi vào một tình thế rất khó khăn.", "eng": "Her request places me in a very difficult position."}, {"viet": "Vụ toan tính tự tử của cô ấy là một cố gắng lẩn tránh thực tế.", "eng": "Her suicide bid was an attempt to run away from reality."}, {"viet": "Sau đây là một vài cách phân biệt:", "eng": "Here are a few helps:"}, {"viet": "Tai nạn của ông ta do cái ống nước đem lại một chút vui tươi thoải mái cho buổi tiệc quá buồn tẻ.", "eng": "His accident with the hose brought some welcome comic relief to a very dull party."}, {"viet": "Cách cư xử của nó làm tôi điên lên.", "eng": "His behaviour is driving me round the bend."}, {"viet": "Những lời bình luận của ông ta pha màu sắc châm biếm.", "eng": "His comments were tinted with sarcasm."}, {"viet": "Tiếng Anh của anh ta rất tồi, anh ta nói nó rất khó nhọc.", "eng": "His English was very bad and he spoke with difficulty."}, {"viet": "Câu trả lời đầu tiên của ông ấy là không.", "eng": "His first response was to say no."}, {"viet": "Bài nói ngu ngốc của anh ta là mục tiêu dễ tấn công cho đối thủ của anh ta.", "eng": "His idiotic speech was fair-game for his opponents."}, {"viet": "Đứa con trai út của ông ta là người đem lại may mắn cho đội bóng đá địa phương.", "eng": "His little son is the mascot for the local football team."}, {"viet": "Văn phòng của ông ấy đóng cửa vào các ngày cuối tuần.", "eng": "His office is closed at weekends."}, {"viet": "Những lời bày tỏ về sự quan tâm của nó có vẻ không thành thật.", "eng": "His professions of concern did not seem sincere."}, {"viet": "Cổ tay áo của hắn rách tả tơi.", "eng": "His sleeves were ragged at the cuffs."}, {"viet": "Tim của anh ta không khỏe lắm.", "eng": "His ticker's not very strong."}, {"viet": "Tác phẩm của anh ấy thiếu phong cách chuyên nghiệp.", "eng": "His work lacks that professional touch."}, {"viet": "Trong công thức này, có thể dùng mật ong thay đường.", "eng": "Honey can substitute for sugar in this recipe."}, {"viet": "Anh với cô Mary tiến triển ra sao rồi?", "eng": "How are you making out with Mary?"}, {"viet": "Buổi liên hoan diễn ra như thế nào?", "eng": "How did the party turn out?"}, {"viet": "Làm thế nào cô ta xoay sở được với tiền lương ít như thế?", "eng": "How does she get by on such a small salary?"}, {"viet": "Mất bao lâu mới tới đó?", "eng": "How long will it take to get there?"}, {"viet": "Qua Nôen, anh nặng thêm được bao nhiêu pao?", "eng": "How many pounds did you put on over Christmas?"}, {"viet": "Anh có bao nhiêu tiền ở tài khoản ngân hàng?", "eng": "How much money do you have in your bank account?"}, {"viet": "Nhưng đèn bàn quá sáng nên rất chói mắt.", "eng": "However, the table lamp is too bright for my eyes."}, {"viet": "Tôi ở nhà cũng được mà đi dạo cũng được.", "eng": "I'd just as soon stay at home as go for walk."}, {"viet": "Tôi không bao giờ dùng từ đọc được cho bất cứ cuốn sách nào của anh ấy.", "eng": "I'd never apply the word readable to any of his books."}, {"viet": "Nếu anh đi thì em cũng đi-nếu không thì em thà ở nhà còn hơn.", "eng": "I'll go if you're going-if not I'd rather stay at home."}, {"viet": "Tôi sẽ cho anh xem một số nghệ thuật có lông chim nữa.", "eng": "I'll show you some more art with feathers."}, {"viet": "Tôi e rằng tôi đã quên sự kiện đó rồi.", "eng": "I'm afraid the fact slipped my memory."}, {"viet": "Tôi sẽ hành nghề tư khi tôi đủ khả năng.", "eng": "I'm going into private practice when I qualify."}, {"viet": "Hôm nay, lần đầu tiên tôi gặp anh ta.", "eng": "I'm meeting him for the first time today."}, {"viet": "Tôi gọi điện thay cho gửi thư.", "eng": "I'm phoning in lieu of sending a letter."}, {"viet": "Tôi vẫn hơi bị choáng vì thuốc gây mê.", "eng": "I'm still a little dopey from the anaesthetic."}, {"viet": "Lúc này tôi rất bận nhưng tôi hy vọng sẽ có thể trả lời thư ông vào tuần sau.", "eng": "I'm very busy at the moment but I hope to get round to answering your letter next week."}, {"viet": "Tôi bị phân công làm việc suốt cả ngày nghỉ cuối tuần!", "eng": "I've been rostered to work all weekend!"}, {"viet": "Tôi có hai đứa, cả hai đứa đều là bác sĩ.", "eng": "I've got two sisters, they're both doctors."}, {"viet": "Tôi chỉ mới đến đây có vài tuần nên thực sự chưa biết gì về cơ cấu tổ chức.", "eng": "I've only been here for a couple of weeks and don't really know the set-up."}, {"viet": "Tôi chấp nhận rằng tôi đã sai.", "eng": "I admit that I was wrong."}, {"viet": "Tôi đang chờ một điện chuyển tiền từ Đài Loan.", "eng": "I am expecting a transfer of money from Taiwan."}, {"viet": "Tôi đánh giá cao sự quan tâm kịp thời của bạn đối với vần đề này.", "eng": "I appreciate your immediate attention to this mater."}, {"viet": "Tôi nghĩ điều xảy ra là như vậy, chỉ có điều anh xấu hổ không dám thừa nhận thôi.", "eng": "I bet that's what happened, only you're ashamed to admit it."}, {"viet": "Tôi không thể giải mã được những gì ghi trên cái cột này.", "eng": "I can't decipher what is inscribed on the pillar."}, {"viet": "Tôi không thể ngồi suốt sáu tiếng đồng hồ nghe nhạc Wagner.", "eng": "I can't sit through six hours of Wagner."}, {"viet": "Tôi chỉ có thể nói được một ít tiếng Pháp.", "eng": "I can only speak a little French."}, {"viet": "Tôi không thể chạy nhanh hơn được tí nào nữa.", "eng": "I can't run any faster."}, {"viet": "Tôi không bao giờ có thể rời khỏi chiếc nhẫn này được.", "eng": "I could never part with this ring."}, {"viet": "Tôi muốn đổi tờ chi phiếu này ra tiền mặt.", "eng": "I'd like to cash this check, please."}, {"viet": "Tôi không có ý nói rằng cô ta ở ngoài không gian-đó chỉ là cách nói bóng bẩy thôi.", "eng": "I didn't mean she was in outer space-it's just a figure of speech."}, {"viet": "Tôi không nghi ngờ rằng anh đang nói thật.", "eng": "I don't doubt but that you're telling the truth."}, {"viet": "Tôi không thích Kevin, anh ta có máu mê trả thù.", "eng": "I don't like Kevin, he's got a nasty vindictive streak in him."}, {"viet": "Tôi không hiểu ngôn ngữ của họ, bạn sẽ phải làm phiên dịch hộ.", "eng": "I don't understand their language, you'll have to act as interpreter."}, {"viet": "Tôi không rõ; để tôi phải xem đã.", "eng": "I don't know; I'll have to see."}, {"viet": "Tôi thích phi ngựa khắp các cánh đồng.", "eng": "I enjoy galloping over the field."}, {"viet": "Tôi ngã xuống tận chân cầu thang.", "eng": "I fell right to the bottom of the stairs."}, {"viet": "Tôi tình cờ lượm được cái ví trên đường phố.", "eng": "I found a purse in the street."}, {"viet": "Tôi đã bị kẹt vào dòng xe cộ giờ cao điểm.", "eng": "I got caught in the rush hour traffic."}, {"viet": "Tôi đã có cuộc trò chuyện thú vị với thầy giáo của anh.", "eng": "I had an interesting conversation with your teacher."}, {"viet": "Tôi chúa ghét các cảnh mua sắm lăng xăng vào ngày thứ Bảy.", "eng": "I hate all the hustle and bustle of Saturday shopping."}, {"viet": "Tôi có năm anh em trai và ba chị em gái.", "eng": "I have five brothers and three sisters."}, {"viet": "Tôi có vài xấp bài luận phải chấm vào cuối tuần này.", "eng": "I have several lots of essays to mark this weekend."}, {"viet": "Tôi chưa từng nghe thành ngữ đó trước đây, có phải nó vừa được sáng tạo ra phải không?", "eng": "I haven't heard that expression before-Is it a recent coinage?"}, {"viet": "Tôi được biết anh ta đã bị ốm.", "eng": "I heard that he was ill."}, {"viet": "Tôi hi vọng anh sẽ không rút lui khỏi cuộc tranh tài vào phút chót.", "eng": "I hope you're not going to scratch at the last moment."}, {"viet": "Tôi vẫn cố gắng thu hút sự chú ý của người hầu bàn.", "eng": "I keep trying to attract the waiter's attention."}, {"viet": "Tôi thôi học lúc 18 tuổi.", "eng": "I left school at the age of 18."}, {"viet": "Tôi sống ở nông thôn hồi tôi còn trẻ.", "eng": "I lived in the country when I was small."}, {"viet": "Tôi sẽ dùng một whisky với nước, vậy nhé.", "eng": "I'll have a whisky and water, please."}, {"viet": "Tôi ngạc nhiên nhìn anh ấy-tôi không ngờ lại gặp anh ấy.", "eng": "I looked at him in surprise-I didn't expect to see him again."}, {"viet": "Tôi sẽ xuống tàu ở ga tiếp theo.", "eng": "I'm getting off at the next station."}, {"viet": "Tôi không mong những lời khen ngợi.", "eng": "I'm not out for compliments."}, {"viet": "Tôi đang cố tìm ông Smith.", "eng": "I'm trying to locate Mr. Smith."}, {"viet": "Tôi phải thú nhận là tôi chưa bao giờ thấy anh ta đặc biệt hấp dẫn cả.", "eng": "I must admit I've never found him particularly attractive."}, {"viet": "Tôi cần một cái áo ngắn hợp với cái quần này.", "eng": "I need a top to go with these slacks."}, {"viet": "Tôi làm phật ý anh ấy vì không trả lời thư của anh.", "eng": "I offended him by not answering his letter."}, {"viet": "Tôi thích lánh xa đô thị trong giờ cao điểm.", "eng": "I prefer to keep clear of town during the rush-hour."}, {"viet": "Tôi thực sự cảm thấy thương bố mẹ của cậu bé bị chết trong vụ tai nạn máy bay.", "eng": "I really feel for the parents of that boy who was killed in the crash."}, {"viet": "Tôi đã lấy lại được phần còn lại của chiếc dép từ con chó.", "eng": "I rescued the remains of my slipper from the dog."}, {"viet": "Tôi thấy trong thư của ông Davidson nói rằng ông là một nhân viên bán hàng có kinh nghiệm.", "eng": "I see in Mr. Davidson's letter that you are an experienced salesman."}, {"viet": "Tôi muốn lặp lại những lời của diễn giả trước.", "eng": "I should like to the echo the words of the previous speaker."}, {"viet": "Tôi bị trẹo lưng khi nâng cái hộp đó.", "eng": "I strained my back when I lifted the box."}, {"viet": "Tôi nghĩ anh ấy sai nhưng nếu tôi nói ra như vậy thì người ta cho rằng tôi kiêu căng.", "eng": "I think he is wrong but it would be thought arrogant of me if I said so."}, {"viet": "Tôi nghĩ một ai khác phải giúp họ một tay.", "eng": "I think someone else should lend a helping hand to them."}, {"viet": "Con cứ nghĩ mới 7 giờ chứ.", "eng": "I thought it was still seven."}, {"viet": "Tôi cố gắng bảo vệ ông ấy khỏi những tay ký giả tọc mạch.", "eng": "I tried to shield him against prying journalists."}, {"viet": "Tôi mới có quá nhiều việc phải làm.", "eng": "I've just had so much work to do."}, {"viet": "Cháu muốn đi đến đường Huntington.", "eng": "I want to go to Huntington Street."}, {"viet": "Tôi đang ở trong số những người ra về cuối cùng.", "eng": "I was among the last to leave."}, {"viet": "Tôi bị thúc ép phải đưa ra một quyết định vội vàng.", "eng": "I was hustled into a hasty decision."}, {"viet": "Tôi quá tức giận, không kìm được mình.", "eng": "I was so furious I couldn't contain myself."}, {"viet": "Tôi không có ở đó nhưng hình như là một bữa tiệc vui.", "eng": "I wasn't there, but apparently it was a good party."}, {"viet": "Tôi mong muốn biết họ thật sự có ý định gì.", "eng": "I wish I knew what they were really driving me at."}, {"viet": "Tôi tự hỏi anh có thể liên hệ với ngân hàng phát hành để đòi hoàn lại tiền cho tôi được không?", "eng": "I wonder if you could get in touch with the issuing bank to claim refund for me?"}, {"viet": "Tôi muốn xin hoàn tiền thuế bán hàng.", "eng": "I would like to apply for a refund on the sales tax."}, {"viet": "Tôi không dám liều đặt cuộc là thời tiết sẽ tốt.", "eng": "I wouldn't gamble on the weather being fine."}, {"viet": "Nếu có một cái đĩa cấu tạo bằng tất cả các màu sắc của cầu vòng được xoay thật nhanh, thì các màu sắc riêng biệt không hiện lên.", "eng": "If disk made up of the rainbow colors is whirled around very fast, the separate colors do not show."}, {"viet": "Nếu thuận tiện tôi có thể gặp anh ngày mai.", "eng": "If it's convenient I can see you tomorrow."}, {"viet": "Nếu vận may của họ còn, họ vẫn có thể giành chức vô địch.", "eng": "If their luck holds, they could still win the championship."}, {"viet": "Nếu anh thật đói bụng, có lẽ ăn hai phần mì này là đủ no rồi.", "eng": "If you're very hungry a double helping of spaghetti should fit the bill."}, {"viet": "Nếu anh ta không trả tiền điện thì nguồn cung cấp điện của anh sẽ bị cắt.", "eng": "If you don't pay your electricity bill, your electricity supply will be cut off."}, {"viet": "Nếu anh cố chấp, anh sẽ làm cho họ bực bội hơn nữa.", "eng": "If you persist, you will annoy them even more."}, {"viet": "Nếu anh không lái xe đưa em đi thì em sẽ phải đi bộ đến đó.", "eng": "If you won't drive me, I'll have to get there on Shanks's pony."}, {"viet": "Để trả lời cho câu hỏi của ông gần đây, quyển sách mà ông nói đến hiện không có sẵn.", "eng": "In answer to your recent inquiry, the book you mention is not in stock."}, {"viet": "Trong quyển tiểu thuyết mới nhất của bà ta bà ta đã phác họa một bức tranh sinh động về cuộc sống tại Anh dưới thời nữ hoàng Victoria.", "eng": "In her latest novel she paints a vivid picture of life in Victorian England."}, {"viet": "Nhìn lại, tôi thấy mình lầm.", "eng": "In retrospect I think that I was wrong."}, {"viet": "Dưới sức mạnh của những xúc động dữ dội, ông ấy không thể nào kiềm chế được.", "eng": "In the grasp of powerful emotions he could not control."}, {"viet": "Trọng tâm của chúng tôi trong chương trình tối nay là về nước Đức.", "eng": "In tonight's programme our focus is on Germany."}, {"viet": "Những vấn đề quốc tế phải được giải quyết bằng ngoại giao chứ không phải bằng chiến tranh.", "eng": "International problems must be solved by diplomacy, not war."}, {"viet": "Nhạc rock vẫn rất được ưa chuộng ở Anh phải không?", "eng": "Is rock music still very popular in the U. K.?"}, {"viet": "Có đủ tiền để chúng ta mua một chai vang không?", "eng": "Is there enough money for us to get a bottle of wine?"}, {"viet": "Đó là một câu hỏi phức tạp và câu trả lời của cô ta lại quá nhanh.", "eng": "It's a complex question and her answer was too pat."}, {"viet": "Nó nằm ở đường Tam Trùng Khánh, gần nhà ga Đài Bắc.", "eng": "It's at Chong Qing South Road near Taibei Station."}, {"viet": "Muộn rồi, chúng ta phải đi thôi.", "eng": "It's getting late, we must be toddling."}, {"viet": "Gần bốn ngàn năm trăm năm tuổi.", "eng": "It's nearly four and a half thousand years old."}, {"viet": "Nó được ưa chuộng ở miền Nam Trung Quốc.", "eng": "It's popular in the south part of China."}, {"viet": "Đã đến lúc anh cần kiếm lấy một việc làm và bắt đầu nuôi lấy thân mình!", "eng": "It's time you got a job and started paying for your keep!"}, {"viet": "Nó có thể tẩy lông mà thậm chí một số máy hút bụi không thể tẩy được.", "eng": "It can remove hair that even some vacuum cleaners can't."}, {"viet": "Thật vui mừng được đón anh ( trở lại ) trong chương trình biểu diễn.", "eng": "It is a pleasure to welcome you ( back ) on the show."}, {"viet": "Điều mong muốn nhất là cả hai cùng đến.", "eng": "It is most desirable that they should both come."}, {"viet": "Nó không đủ lạnh và quá ồn.", "eng": "It isn't cold enough and it's too noisy."}, {"viet": "Cần phải có khả năng chịu đựng thực sự để lái xe qua những đoạn đường dài này.", "eng": "It requires real endurance to drive such long distances."}, {"viet": "Thật hấp dẫn khi lướt ván ngoài biển.", "eng": "It's so exciting to surf at the sea."}, {"viet": "Cô ấy chợt nảy ra ý nghĩ là mình đã sai ngay từ đầu.", "eng": "It suddenly came to her that she had been wrong all along."}, {"viet": "Thật là thích thú khi bọn anh ăn kẹo.", "eng": "It was a treat when we got sweets."}, {"viet": "Ăn hết cả thức ăn như mày thật là xấu hổ.", "eng": "It was mean of you to eat all the food."}, {"viet": "Rất may cho anh ta là tôi đến đúng lúc.", "eng": "It was very fortunate for him that I arrived on time."}, {"viet": "Danh dự của tôi không cho phép tôi.", "eng": "It would not be consistent with my honour to."}, {"viet": "Sự khoác lác của John đã làm cho những cậu con trai khác bực mình.", "eng": "John's bragging rubbed the other boys the wrong way."}, {"viet": "Hãy kể cho tôi nghe sự thật không tô vẽ.", "eng": "Just give me the plain unvarnished truth."}, {"viet": "Năm ngoái ông ta tặng 1000 đôla cho công việc nghiên cứu ung thư.", "eng": "Last year he donated $ 1.000 to cancer research."}, {"viet": "Để tôi cho cô xem thực đơn của chúng tôi.", "eng": "Let me show you our menu."}, {"viet": "Trông như thể cô ấy lại vắng mặt nữa rồi.", "eng": "Looks like she was a no-show again."}, {"viet": "Nhiều người tham gia phản đối kế hoạch của chính phủ.", "eng": "Many people joined the protest against government plans."}, {"viet": "Mary rất nản lòng vì công việc của cô không được đánh giá cao.", "eng": "Mary was frustrated by the lack of appreciation shown of her work."}, {"viet": "Cho phép tôi sao thẻ nhé?", "eng": "May I take a print of the card, please?"}, {"viet": "Hầu hết các cửa xe hơi bây giờ đều được lắp ổ khoá ngăn trẻ con mở.", "eng": "Most car doors are now fitted with child-proof locks."}, {"viet": "Thưa ông Smith, cho phép tôi hỏi ông vài câu nhé?", "eng": "Mr. Smith, may I ask you a few questions, please?"}, {"viet": "Em trai tôi và bạn bè của nó là những người mê bóng đá.", "eng": "My brother and his bunch me basketball fanatics."}, {"viet": "Chiếc bánh sô cô la của tôi làm thử lần đầu nếm thật khủng khiếp.", "eng": "My first attempt at a chocolate cake tasted horrible."}, {"viet": "Tên và địa chỉ của tôi ghi ở đáy va li.", "eng": "My name and address are on the bottom."}, {"viet": "Sự tham gia bất đắc dĩ của tôi vào kế hoạch này.", "eng": "My unwilling participation in the scheme."}, {"viet": "Những phương pháp sản xuất mới đã dẫn tới năng suất cao.", "eng": "New production methods that have led to increased productivity."}, {"viet": "Không, nó không có chức năng đó.", "eng": "No, it doesn't come with that function."}, {"viet": "Không có gì đáng ngạc nhiên là hãng phải bị thua lỗ, văn phòng thừa nhân viên kinh khủng.", "eng": "No wonder the firm makes a loss, the office is terribly overstaffed."}, {"viet": "Bây giờ chúng ta tới điểm then chốt của vấn đề.", "eng": "Now we come to the crux of the problem."}, {"viet": "Ồ, chắc hẳn tôi nhận nhầm số rồi.", "eng": "Oh, I must have the wrong number."}, {"viet": "Người già thường cố gắng tiết kiệm sưởi ấm như vậy rất có hại cho sức khoẻ của họ.", "eng": "Old people often try to economize on heating, thus endangering their health."}, {"viet": "Người ta có thể dễ dàng tự thu xếp lấy chuyện đó được.", "eng": "One could easily arrange it all oneself."}, {"viet": "Đã có một Tina Smith nào đó gọi điện thoại đòi gặp bạn nhưng bạn đi vắng.", "eng": "One Tina Smith called to see you but you were out."}, {"viet": "Những máy mới của chúng tôi có hiệu quả mà lại rẻ hơn nhiều.", "eng": "Our efficient new machines are much cheaper to run."}, {"viet": "Đội Quốc gia đấu với đội Cuba.", "eng": "Our National Team against the Cuban Team."}, {"viet": "Quân ta đã thâm nhập vào lãnh thổ địch.", "eng": "Our troops have penetrated into enemy territory."}, {"viet": "Các nhà tư tưởng của đảng lên án ông ta là đã đi trệch.", "eng": "Party ideologists accused her of deviation."}, {"viet": "Người ta nghĩ cô ấy là một kẻ đồng bóng chỉ bởi vì cô ấy là người tu hành.", "eng": "People think she's a freak just because she's religious."}, {"viet": "Vui lòng đưa tất cả áo quần này đi giặt ủi.", "eng": "Please send all these clothes to the laundry."}, {"viet": "Dịch vụ chất lượng được bảo hành ở cửa hàng quần áo thể thao này.", "eng": "Quality service is guaranteed in this sportswear shop."}, {"viet": "Các nhà khoa học đã tìm ra được bệnh này là do chuột đem lại.", "eng": "Scientists have now discovered that this disease is carried by rats."}, {"viet": "Một ngày nào đó chúng ta sẽ chơi một ván với nhau nhé?", "eng": "Shall we have a game together some day?"}, {"viet": "Bà ta luôn luôn chê bai những người đang làm việc.", "eng": "She's always bitching about the people at work."}, {"viet": "Cô ấy thấy khó can đảm chấp nhận khả năng chết sớm.", "eng": "She's finding it difficult to face up to the possibility of an early death."}, {"viet": "Cô ta không phải là người nội trợ giỏi-cô ta luôn tiêu tiền nhiều hơn số cô ta kiếm được.", "eng": "She's not a very good manager-she always spends more money than she earns."}, {"viet": "Cô ta đang cân nhắc về vấn đề đổi việc làm của cô ta.", "eng": "She's thinking about changing her job."}, {"viet": "Dường như quanh người cô ta lúc nào cũng có một ánh hào quang hạnh phúc.", "eng": "She always seems to have an aura of happiness about her."}, {"viet": "Cô ta thoát không chút sầy da.", "eng": "She came through without even a scratch."}, {"viet": "Cô ấy rất muốn được giúp một tay để trang trí căn nhà mới của cô ấy.", "eng": "She could use a hand decorating her new house."}, {"viet": "Chị ấy không nói gì về chồng mình.", "eng": "She didn't speak of her husband at all."}, {"viet": "Cô ta đã không cân nhắc ảnh hưởng hành động của cô ta đến gia đình của mình.", "eng": "She failed to measure the effect of her actions on her family."}, {"viet": "Cô ấy kể lại những chuyến đi của mình một cách sôi nổi hào hứng.", "eng": "She gave a racy account of her travels."}, {"viet": "Chị ấy điều hành một ban lớn.", "eng": "She had a huge department to administer."}, {"viet": "Cô ta có sự trọng thị đúng mực đối với tài năng của đối thủ.", "eng": "She has a healthy respect for her rival's talents."}, {"viet": "Cô ta có khả năng giữ bình tĩnh trong trường hợp khẩn cấp.", "eng": "She has the ability to keep calm in an emergency."}, {"viet": "Cô ấy có năng khiếu nghệ thuật, nhất là về múa.", "eng": "She is artistically gifted, especially in dance."}, {"viet": "Cô ấy được đào tạo tốt để làm công việc này.", "eng": "She is very well qualified for this job."}, {"viet": "Cô ta chăm chú nghe chuyện.", "eng": "She listened to the story with eager attention."}, {"viet": "Cô ấy may tấm chăn bằng đầu thừa đuôi thẹo.", "eng": "She made the quilt from oddments of material."}, {"viet": "Cô ta thi chỉ tốt vừa phải thôi.", "eng": "She only did moderately well in the exam."}, {"viet": "Sau bữa ăn trưa, bà ấy đưa các con đi dạo dọc theo mé biển.", "eng": "She promenaded the children along the sea front after lunch."}, {"viet": "Sau khi bỏ nhau, cô ấy lại lấy lại tên hồi con gái của mình.", "eng": "She resumed her maiden name after the divorce."}, {"viet": "Nàng được nhận vào trường Durham để học luật.", "eng": "She's got into Durham to read law."}, {"viet": "Cô ta nói rằng chưa lúc nào cô muốn chết cả.", "eng": "She said she had no intention of popping off for some time yet."}, {"viet": "Cô ấy đã lập một kỷ lục thế giới mới về thời gian ở cự ly 100m.", "eng": "She set up a new world record time in the 100 metres."}, {"viet": "Cô ấy nghe như là đã phát điên lên rồi.", "eng": "She sounds like she's around the bend already."}, {"viet": "Bà ta kiêu kỳ quan sát tôi qua bên trên cặp kính.", "eng": "She surveyed me haughtily over the top of her glasses."}, {"viet": "Cô ấy đứng đầu danh sách Nhà hát Palace.", "eng": "She topped the bill at the Palace Theatre."}, {"viet": "Bà ấy đòi 650 bảng chiếc xe ấy nhưng chúng tôi đã hạ được xuống còn 600 bảng.", "eng": "She wanted 650 for the car but we managed to beat her down to 600."}, {"viet": "Cô ta rất cố gắng khi nhấn mạnh đến lợi ích của kế hoạch.", "eng": "She was at pains to stress the benefits of the scheme."}, {"viet": "Cô ấy bị xử là có tội và kết quả là cô ta bị mất việc.", "eng": "She was found guilty, and lost her job in consequence of it."}, {"viet": "Cô ấy có tài về âm nhạc và nghệ thuật.", "eng": "She was musically and artistically talented."}, {"viet": "Cô ấy rất lo lắng trong cuộc phỏng vấn vì thế mà làm rất tồi.", "eng": "She was so nervous at the interview that she completely hashed it up."}, {"viet": "Cô ta mặc một chiếc váy và áo cánh.", "eng": "She was wearing a skirt and blouse."}, {"viet": "Cô ta thường nghe đĩa hát một mình ở trong phòng hàng tiếng đồng hồ.", "eng": "She will listen to records, alone in her room, for hours."}, {"viet": "Cô ta sẽ không bị moi móc về đời tư của mình.", "eng": "She wouldn't be drawn about her private life."}, {"viet": "Tỏ ra sáng suốt trong việc chọn bạn của mình.", "eng": "Show discrimination in one's choice of friends."}, {"viet": "Vì thời gian chúng ta ở đây quá ngắn, một chương trình nghị sự dễ chịu chắc chắn sẽ là một điều cần thiết để đạt được hiệu quả hơn.", "eng": "Since our stay here is so short, an agreeable agenda will surely be an essential thing to achieve more efficiency."}, {"viet": "Họ ăn mặc cho tươm tất để chụp ảnh.", "eng": "Slicked themselves up for the camera."}, {"viet": "Snowdon và những ngọn núi xa có tuyết bao phủ.", "eng": "Snowdon and the mountains beyond were covered in snow."}, {"viet": "Các mảng đất có cỏ mới được xếp lên mộ.", "eng": "Sods newly placed on a grave."}, {"viet": "Một số dụng cụ nhà bếp gây trở ngại nhiều hơn là giúp ích.", "eng": "Some kitchen gadgets are more of a hindrance than a help."}, {"viet": "Một số cầu thủ chơi tốt hơn ở hàng hậu vệ.", "eng": "Some players are better at defending."}, {"viet": "Có gì không được lương thiện cho lắm về cách kiếm tiền của hắn.", "eng": "Something not quite kosher about the way he made his money."}, {"viet": "Nói để làm sáng tỏ cách cư xử của mình.", "eng": "Speak in vindication of one's conduct."}, {"viet": "Bắt đầu một cuộc đi bộ 20 dặm.", "eng": "Start out on a 20 mile walk."}, {"viet": "Đừng có chơi rông nữa, hãy làm việc gì đi chứ.", "eng": "Stop fiddling about and do some work."}, {"viet": "Stuart đã bị ốm cho nên tôi phải đi thay.", "eng": "Stuart was ill so I went instead."}, {"viet": "Những điều luật như vậy đã quy định việc tính lãi tiền vay là bất hợp pháp.", "eng": "Such laws made it illegal to charge interest on loans."}, {"viet": "Được ạ, tôi sẽ mang cho ông một cái.", "eng": "Sure, I'll bring you one."}, {"viet": "Chụp X quang bàn tay của ai.", "eng": "Take an X-ray of somebody's hand."}, {"viet": "Giảng dạy sát với giới hạn của đề tài.", "eng": "Teach near the frontiers of one's subject."}, {"viet": "Làm những đứa trẻ kinh hãi bằng những câu chuyện ma.", "eng": "Terrified his children with ghost stories."}, {"viet": "Đây là vợ anh ta.''Chị anh ta chứ, phải không?'?", "eng": "That's his wife.''His sister, surely?"}, {"viet": "Màu này không hợp với nước da của chị.", "eng": "That colour doesn't suit your complexion."}, {"viet": "Cái thang trông hơi lung lay.", "eng": "That ladder looks a bit dicky."}, {"viet": "Chiếc tàu lượn đó có thể lao xuống hơn 100m.", "eng": "That roller coaster can dive over one hundred meters."}, {"viet": "Nhận xét tai hại đó đã vạch trần sự dốt nát của anh ta về vấn đề này.", "eng": "That unfortunate remark exposed his ignorance of the subject."}, {"viet": "Tai nạn ở nhà máy làm chúng ta thấy rõ là những quy tắc về an toàn phải được tôn trọng.", "eng": "The accident at the factory really drove home the point that safety regulations must be observed."}, {"viet": "Màu sắc biến đổi của con kì nhông.", "eng": "The adaptive coloring of the chameleon."}, {"viet": "Trong cuộc nội chiến Hoa Kì lần đầu tiên người ta thấy xe lửa được dùng để làm phương tiện thêm vào những cuộc hành quân.", "eng": "The American Civil War was the first to see railways used as an adjunct to military operations."}, {"viet": "Cuộc hẹn vào ngày 12 tháng Năm.", "eng": "The appointment is for 12 May."}, {"viet": "Bài báo đưa ra quá nhiều phỏng đoán sai.", "eng": "The article makes too many false presumptions."}, {"viet": "Tác giả đưa ta đến những ngóc ngách của văn học trung cổ.", "eng": "The author takes down the by ways of medieval literature."}, {"viet": "Cái túi sẽ bung ra nếu thêm các thứ vào.", "eng": "The bag will burst if you put any more things in it."}, {"viet": "Yếu tố giới hạn cơ bản của chính sách ngoại giao của họ.", "eng": "The basic parameter of their foreign policy."}, {"viet": "Cái giữ gìn đạo đức tốt nhất chính là lương tâm.", "eng": "The best moral sanction is that of conscience."}, {"viet": "Chung cư này có người trông coi không phải người thường trú ở đây.", "eng": "The block of flats has a non-resident caretaker."}, {"viet": "Quyển sách tôi cần nằm ngay dưới cùng đống sách.", "eng": "The book I want is right at the bottom of the pile."}, {"viet": "Võ sĩ đó đã bị đánh gục ở hiệp thứ năm.", "eng": "The boxer was laid out in the fifth round."}, {"viet": "Cô dâu hiện ra rất đẹp trong ảnh.", "eng": "The bride comes out well in the photographs."}, {"viet": "Bọn trộm đã bị cảnh sát chế ngự dễ dàng.", "eng": "The burglars were easily overpowered by the police."}, {"viet": "Chiếc ca nô bị cuốn trong cơn lốc.", "eng": "The canoe was sucked into the whirlpood."}, {"viet": "Chiếc xe ôtô đó đáp ứng ngay theo các núm điều khiển.", "eng": "The car responds well to the controls."}, {"viet": "Tòa lâu đài ở một vị trí cao nhất trong thành phố.", "eng": "The castle stands in a dominant position above the town."}, {"viet": "Bây giờ vị chủ tịch sẽ nói chuyện với hội nghị.", "eng": "The chairman will now address the meeting."}, {"viet": "Đứa bé òa lên khóc khi bị cha nó mắng nhiếc.", "eng": "The child burst into tears upon receiving an upbraiding from his father."}, {"viet": "Thái độ vô kỷ luật của bọn trẻ đã làm thầy hiệu trưởng phẫn nộ.", "eng": "The children's unruly behaviour incurred the head-teacher's wrath."}, {"viet": "Các cháu phải ở trong lớp học cho đến giờ giải lao.", "eng": "The children sat in class until recess."}, {"viet": "Những món quà Nôen được gói bằng khăn giấy.", "eng": "The Christmas presents were wrapped up in tissue paper."}, {"viet": "Người leo núi phải vượt qua một mặt đá dốc đứng.", "eng": "The climber had to negotiate a steep rock face."}, {"viet": "Vẻ lạnh lẽo của căn nhà trống vắng bao trùm lên cô ta.", "eng": "The coldness of the empty house enwrapped her."}, {"viet": "Thuyền trưởng của hãng tàu Cunard.", "eng": "The commodore of the Cunard Line."}, {"viet": "Công ty từ chối nhận trách nhiệm về tai nạn này, nhưng cho tôi 10.000 bảng gọi là tiền đền bù.", "eng": "The company refused to accept responsibility for the accident, but gave me 10.000 as an ex gratia payment."}, {"viet": "Sự nhàm chán với những vở diễn lòng thòng trên TV.", "eng": "The constant diet of soap operas on TV."}, {"viet": "Ngôi nhà tranh đó là vật bị thiêu hủy trong đám cháy rừng.", "eng": "The cottage was a casualty of the forest fire."}, {"viet": "Tòa án đã miễn trách cho bị cáo khỏi các trách nhiệm về cái chết của cô ấy.", "eng": "The court absolved the accused man from all responsibility for her death."}, {"viet": "Hoa màu hỏng vì thiếu mưa.", "eng": "The crops have failed because of lack of rain."}, {"viet": "Tấm rèm có hoa văn cầu kì.", "eng": "The curtains had an elaborate pattern of flowers."}, {"viet": "Tay nhà buôn đang háo hức trước những viên đá quý.", "eng": "The dealer was slavering over some precious stones."}, {"viet": "Sương mù dày đặc đã gây trở ngại cho việc hạ cánh của máy bay.", "eng": "The dense fog delayed the plane's landing."}, {"viet": "Sự hòa tan của khí và chất lỏng.", "eng": "The diffusion of gases and liquids."}, {"viet": "Công nhân bến tàu tại Liverpool đang đình công.", "eng": "The dockers in Liverpool are out."}, {"viet": "Tài liệu rơi vào tay địch.", "eng": "The document fell into the hands of the enemy."}, {"viet": "Mèo nuôi trong nhà vẫn giữ bản năng săn mồi.", "eng": "The domesticated cat retains its predatory instincts."}, {"viet": "Tên say bị tống cổ ra khỏi quán rượu.", "eng": "The drunk was thrown out of the pub."}, {"viet": "Dây chun quần tôi đứt rồi.", "eng": "The elastic in my pants has gone."}, {"viet": "Cái động cơ đó dường như cần nhiều dầu.", "eng": "The engine seems to need piles of oil."}, {"viet": "Chứng cứ đó đã được xem xét cẩn thận và bàn bạc kĩ lưỡng tại các toà án Mĩ.", "eng": "The evidence has been repeatedly canvassed in American courts."}, {"viet": "Nghĩa rộng của từ mèo là chỉ giống mèo nói chung.", "eng": "The extensional meaning of cat is the group of all cats."}, {"viet": "Người nông dân đó nói khoác là hoa màu của ông ta là tết nhất nước.", "eng": "The farmer bragged that his crops were the best in the country."}, {"viet": "Lần chiếu đầu tiên bộ phim trên đất nước này.", "eng": "The film's first screening in this country."}, {"viet": "Đám cháy nhanh chóng thiêu trụi túp lều gỗ.", "eng": "The fire quickly consumed the wooden hut."}, {"viet": "Tập đầu sẽ được phát sóng vào lúc 8giờ tối thứ sáu tới đây.", "eng": "The first episode goes out next Friday evening at 8.00pm."}, {"viet": "Trên sàn của xưởng mộc đầy vỏ bào.", "eng": "The floor of the carpenter's shop was covered with shavings."}, {"viet": "Người thầy bói tiên đoán cái chết của người đàn ông đó.", "eng": "The fortuneteller foretold the man's death."}, {"viet": "Tương lai của dự án này sẽ được nhà nước quyết định.", "eng": "The future of this project will be decided by the government."}, {"viet": "Vị tướng đó đã bị cất chức chỉ huy.", "eng": "The general was relieved of his command."}, {"viet": "Cái tốt và cái xấu triệt tiêu lẫn nhau.", "eng": "The good and harm cancel each other out."}, {"viet": "Chính phủ đã dự thảo ngân sách cho giáo dục là 10.000.000 bảng Anh.", "eng": "The government has budgeted £ 10,000,000 for education spending."}, {"viet": "Hình như chính phủ phớt lờ cảnh ngộ của những người thất nghiệp.", "eng": "The Government seems to be closing its eyes to the plight of the unemployed."}, {"viet": "Vạn Lý Trường Thành là một dự án quân sự được nhiều vương quốc khác nhau xây dựng để cản đường các bộ lạc du mục.", "eng": "The Great Wall was a military project built by various kingdoms to hold back nomadic tribes."}, {"viet": "Người khách trọ muốn xem vở ba lê \"Giselle\".", "eng": "The guest wants to see ballet \"Giselle\"."}, {"viet": "Tim bơm máu đi khắp cơ thể.", "eng": "The heart pumps blood round the body."}, {"viet": "Ngày nghỉ hết sức phong phú.", "eng": "The holiday was nothing if not varied."}, {"viet": "Nhân viên bảo vệ khách sạn sẽ gọi tắc xi cho ông.", "eng": "The hotel porter will can a taxi for you."}, {"viet": "Ngôi nhà mà cửa ra vào có một panô bằng kính.", "eng": "The house whose door has a glass panel."}, {"viet": "Những nhận xét xấc xược đó đã làm diễn giả tức giận.", "eng": "The impertinent remarks teed the speaker off."}, {"viet": "Một đêm không trăng tối đen như mực.", "eng": "The inky darkness of a moonless night."}, {"viet": "Ông gọi đảo này là Hi-Brazil.", "eng": "The island he called Hi-Brazil."}, {"viet": "Quan tòa đã tuyên bố bản án về người tù đó.", "eng": "The judge pronounced sentence on the prisoner."}, {"viet": "Con dao đã làm xước cái bàn.", "eng": "The knife has scratched the table."}, {"viet": "Những tiến triển mới nhất vừa mới được phát ra cho các cơ quan truyền thông.", "eng": "The latest developments have just been released to the media."}, {"viet": "Giới luật sư luôn luôn chống lại sự thay đổi.", "eng": "The legal profession has always resisted change."}, {"viet": "Chiếc tàu chở khách nằm trong ụ tàu để sửa chữa.", "eng": "The liner is in dock for a refit."}, {"viet": "Chiếc xe tải chất đầy những thùng hoa quả.", "eng": "The lorry was laden with boxes of fruit."}, {"viet": "Đường sắt chính từ Luân Đôn tới Coventry.", "eng": "The main line from London to Coventry."}, {"viet": "Giá tính thêm về thực phẩm ở cửa hàng ăn thường ít nhất là 100%.", "eng": "The mark-up on food in a restaurant is usually at least 100%."}, {"viet": "Bộ phận máy làm quay cái bàn xoay bị hỏng.", "eng": "The mechanism that revolves the turntable is broken."}, {"viet": "Quan điểm trung dung giữa tin tức và vui chơi.", "eng": "The middle ground between news and amusement."}, {"viet": "Đám đông tự vũ trang bằng gậy và đá.", "eng": "The mob armed themselves with sticks and stones."}, {"viet": "Món đắt giá nhất trong số quà tặng.", "eng": "The most expensive of the presents."}, {"viet": "Viện bảo tàng đóng cửa cho tới khi có thông báo mới.", "eng": "The museum is closed until further notice."}, {"viet": "Trung tâm nghệ thuật mới này là sản phẩm trí tuệ của một nhà doanh nghiệp giàu có ở địa phương.", "eng": "The new arts centre is the brain-child of a wealthy local businessman."}, {"viet": "Vở ca kịch mới ở Broadway làm họ say mê.", "eng": "The new musical wowed them on Broadway."}, {"viet": "Tin nàng mất đã thực sự làm tôi bối rối.", "eng": "The news of her death really threw me."}, {"viet": "Những người biểu tình ầm ĩ đã bị cảnh sát giải tán.", "eng": "The noisy demonstrators were dispersed by the police."}, {"viet": "Cuộc đình công của các nữ y tá là tiêu biểu cho sự quan tâm của công chúng đối với các bệnh viện của chúng ta.", "eng": "The nurses'strike typifies public concern about our hospitals."}, {"viet": "Nhà thờ cổ bị những ngôi nhà chọc trời làm cho bé lại.", "eng": "The old cathedral is dwarfed by the skyscrapers."}, {"viet": "Chìa khóa duy nhất của thành công là sự làm việc cần mẫn.", "eng": "The only passport to success is hard work."}, {"viet": "Bên ngoài của ngôi nhà được quét vôi màu trắng.", "eng": "The outside of the house was painted white."}, {"viet": "Parthenon là một công trình kiến trúc hùng vĩ.", "eng": "The Parthenon is a magnificent structure."}, {"viet": "Bệnh nhân bị đụng đập nặng do một cú đấm vào đầu.", "eng": "The patient is suffering from severe concussion following a blow to the head."}, {"viet": "Thời gian tập thể dục được giảm xuống 10 phút một ngày đối với những người trên 60 tuổi.", "eng": "The period of exercise was geared down to ten minutes a day for men over 60."}, {"viet": "Những cái gần dĩa nhất dành cho món cuối cùng.", "eng": "The pieces closest to the plate are for the last course."}, {"viet": "Chiếc phi cơ bay trệch đường bay thường lệ.", "eng": "The plane deviated from its usual route."}, {"viet": "Vở kịch đã bị cấm bởi người kiểm duyệt.", "eng": "The play was banned by the censor."}, {"viet": "Cảnh sát đã bắt anh ta và hai kẻ tòng phạm.", "eng": "The police arrested him and his two accomplices."}, {"viet": "Cảnh sát đã chặn bắt được hắn khi hắn đang cố thoát ra khỏi quốc gia.", "eng": "The police picked him up as he was trying to leave the country."}, {"viet": "Chính khách đó đã có thể xét đoán được thái độ và quan điểm của các người dân thường đi bỏ phiếu mà không bị ảnh hưởng quá đáng.", "eng": "The politician was able to take the pulse of the grassroots voters with out becoming overly absorbed."}, {"viet": "Khả năng phóng đại của kính hiển vi, kính viễn vọng...", "eng": "The power of a microscope, telescope, etc."}, {"viet": "Tổng thống là thành viên đương nhiệm của hội đồng.", "eng": "The President is an ex officio member of the committee."}, {"viet": "Tu sĩ của một số tôn giáo phải thề từ bỏ của cải và hôn nhân.", "eng": "The priests of some religions must forswear possessions and marriage."}, {"viet": "Tù nhân đã đào đường hầm trốn thoát.", "eng": "The prisoners had escaped by tunnelling."}, {"viet": "Dự án kết thúc vào ngày 1 tháng Giêng.", "eng": "The project was terminated as of January 1."}, {"viet": "Cú đấm đánh vỡ quai hàm tay võ sĩ quyền Anh.", "eng": "The punch broke the boxer's jaw."}, {"viet": "Những câu hỏi sơ đẳng đến nỗi anh ấy đậu dễ dàng.", "eng": "The questions were so elementary that he easily passed the test."}, {"viet": "Những số chúng ta đo được là cao hơn số trung bình nhiều.", "eng": "The readings we took were well above average."}, {"viet": "Sức ép thường xuyên trong cuộc đời làm một chính khách của bà ta.", "eng": "The relentless pressure of her life as a politician."}, {"viet": "Sự lập lại trật tự sau những vụ bạo loạn.", "eng": "The restoration of order after the riots."}, {"viet": "Sự vươn lên của giai cấp tư sản vào thế kỷ 19.", "eng": "The rise of the bourgeoisie in the 19th century."}, {"viet": "Mùi vị ngọt ngào của cà phê mới pha.", "eng": "The robust favor of freshly brewed coffee."}, {"viet": "Tấm thảm đã bị cháy sém vì nó nằm quá gần lò sưởi.", "eng": "The rug singed because it was too near the fire."}, {"viet": "Cát đã làm nghẽn cửa sông.", "eng": "The sand has silted up the mouth of the river."}, {"viet": "Các nhà khoa học đến thăm đất nước này là khách mời đặc biệt của chính phủ.", "eng": "The scientists are visiting this country as guests of the government."}, {"viet": "Câu Anh ta khoẻ như ngựa là một sự so sánh.", "eng": "The sentence He is as strong as a horse is a simile."}, {"viet": "Mũi tàu đâm vào đá làm hư hỏng tàu.", "eng": "The ship's prow hit the rocks, damaging it."}, {"viet": "Cửa hàng không mở vào Chủ Nhật.", "eng": "The shop isn't open on Sundays."}, {"viet": "Ca sĩ được người đệm đàn cổ vũ một cách thích đáng.", "eng": "The singer was ably abetted by hers skillful accompanist."}, {"viet": "Khói đám cháy có thể nhìn được từ con đường.", "eng": "The smoke from the fire was visible from the road."}, {"viet": "Bầu trời toàn màu xanh trong bức tranh.", "eng": "The solid blue sky of the painting."}, {"viet": "Những người đi xem tự mình xếp thành dãy dọc đường đi của đám rước.", "eng": "The spectators ranged themselves along the route of the procession."}, {"viet": "Đồng hồ nhà ga chỉ những phút đã trôi qua.", "eng": "The station clock ticked away the minutes."}, {"viet": "Quá trình bí ẩn làm cho hai người phải lòng nhau.", "eng": "The strange chemistry that two people to fall in love."}, {"viet": "Sự thành công của dự án phụ thuộc vào sự cộng tác của anh.", "eng": "The success of the whole project hangs on your cooperation."}, {"viet": "Sự sống cộng sinh giữa một cây và côn trùng làm tươi tốt nó.", "eng": "The symbiosis between a plant and the insect that fertilizes it."}, {"viet": "Thầy giáo xếp dọn những cái ghế ra quanh lớp học.", "eng": "The teacher shifted the chairs around in the classroom."}, {"viet": "Sức căng của dây kim loại, dây thừng, v. v..", "eng": "The tensile strength of wire, rope, etc."}, {"viet": "Cái ý nghĩ nằm ở phía sau sự gợi ý đó.", "eng": "The thought that was behind the suggestion."}, {"viet": "Những khách du lịch dừng lại ngưỡng mộ cảnh đẹp.", "eng": "The tourists paused in admiration of the beautiful view."}, {"viet": "Cuộc đình công của ngành vận tải ảnh hưởng tệ hại tới kế hoạch của mọi người.", "eng": "The transport strike played havoc with everyone's holiday's plans."}, {"viet": "Hai điều khẳng định đó loại trừ nhau.", "eng": "The two assertions are mutually exclusive."}, {"viet": "Sự sang trọng tột bực của chuyến đi là được bay trên máy bay Concorde.", "eng": "The ultimate luxury of the trip was flying in Concorde."}, {"viet": "Sự thất thường của thời trang, thời tiết, dịch vụ bưu điện.", "eng": "The vagaries of fashion, the weather, the postal service."}, {"viet": "Du khách tới Oxford có rất nhiều cảnh đẹp để thăm.", "eng": "The visitor to Oxford has an abundance of sighs to see."}, {"viet": "Sóng đánh dập chiếc thuyền vào đá làm vỡ ra từng mảnh.", "eng": "The waves smashed the boat against the rocks, splintering it to pieces."}, {"viet": "Toàn bộ công nhân viên, kể cả ông hiệu trưởng.", "eng": "The whole staff, not excepting the headmaster."}, {"viet": "Nó có thể đuổi gấu hang và các con vật hoang dại khác.", "eng": "The wolf dog could drive away cave bears and other wild animals."}, {"viet": "Những người bị thương được đặt nằm ở nông trại.", "eng": "The wounded were bedded in the farm house."}, {"viet": "Người chỉ huy của họ là Christopher Columbus.", "eng": "Their commander was Christopher Columbus."}, {"viet": "Quan điểm của họ về nghệ thuật thật tức cười.", "eng": "Their opinions on art are for the birds."}, {"viet": "Sau đó chúng sẽ bay một vòng tròn và trở lại tay người ném.", "eng": "Then it will turn around in the air and come back to the thrower."}, {"viet": "Có nhiều điều chí lý trong những gì bà ta nói.", "eng": "There's a lot of sense in what she says."}, {"viet": "Giữ thể diện cũng là vô ích khi mọi người đều biết chúng ta sắp phá sản đến nơi.", "eng": "There's no point in keeping up appearances when everyone knows we're nearly bankrupt."}, {"viet": "Có 16 ao xơ trong một pao.", "eng": "There are 16 ounces in one pound."}, {"viet": "Có một trăm ‘ xu'trong một ‘ đồng'.", "eng": "There are one hundred'fen'in a'yuan'."}, {"viet": "Không có đủ ghế và tách trong phòng của khách trọ.", "eng": "There aren't enough chairs and cups in the guest's room."}, {"viet": "Có lối vào ở đằng trước và đằng sau nhà.", "eng": "There is a front and a back entrance to the house."}, {"viet": "Không có cách nào để khám phá được điều gì đã xảy ra.", "eng": "There is no means of finding out what happened."}, {"viet": "Phải có đến một nghìn người ở đó, theo sự ước tính dè dặt.", "eng": "There must have been a thousand people there, at a conservative estimate."}, {"viet": "Một phong cảnh đẹp thực sự từ cửa sổ.", "eng": "There was a truly beautiful view from the window."}, {"viet": "Có tới gần năm mươi người tại cuộc liên hoan.", "eng": "There were going on for fifty people at the party."}, {"viet": "Những con chim đẹp này nhanh chóng bị tuyệt diệt.", "eng": "These beautiful birds are fast disappearing."}, {"viet": "Những người này là một phần của thủy thủ đoàn trên tàu.", "eng": "These men are part of the ships crew."}, {"viet": "Nếu cho họ cơ hội, họ sẽ lừa anh lấy hết đồng xu cuối cùng.", "eng": "They'll diddle you out of your last penny if you give them the chance."}, {"viet": "Người ta đã làm nhẹ bớt bài tường thuật của tôi về các hành động tàn bạo của quân lính.", "eng": "They've sanitized my report on army atrocities."}, {"viet": "Họ mở cửa từ 6 giờ 30 sáng đến 2 giờ chiều, và từ 4 giờ chiều đến 11 giờ đêm.", "eng": "They are open from 6: 30 a. m. to 2: 00 p. m. and 4: 00 p. m. to 11: 00 p. m."}, {"viet": "Chúng nó rầm rập đi qua nhà bếp, để lại những dấu chân bẩn thỉu.", "eng": "They came tramping through the kitchen leaving dirty footmarks."}, {"viet": "Họ không biết làm đồ gốm.", "eng": "They did not make pottery."}, {"viet": "Người ta thấy cô gục xuống tay lái.", "eng": "They found her slummed over the steering wheel."}, {"viet": "Họ có năm con, ba trai và hai gái.", "eng": "They have five children, three boys and two girls."}, {"viet": "Họ sống trong hiện tại tức thì mà không quan tâm gì đến tương lai.", "eng": "They lived in the here and now without regard for the future."}, {"viet": "Họ được tài khéo léo của phi công cứu cho toàn mạng.", "eng": "They owed their lives to the pilot's skill."}, {"viet": "Họ đã trình bày những nỗi bất bình của họ lên Thống đốc bang.", "eng": "They represented their grievances to the Governor."}, {"viet": "Họ sống những ngày cuối tuần, mai danh ẩn tích yên ổn, xa lánh giới báo chí và trường quay.", "eng": "They spent the weekend in peaceful anonymity, away from the press and the television studios."}, {"viet": "Họ muốn chúng ta cho xem một số phim đèn chiếu màu của chúng ta.", "eng": "They want us to show some of our colour slides."}, {"viet": "Họ đã may mắn trở về toàn vẹn.", "eng": "They were lucky to get back in one piece."}, {"viet": "Nếu họ đi chuyến tàu sớm, lúc này họ đã ở đây rồi.", "eng": "They would have been here by now if they'd caught the early train."}, {"viet": "Quyển sách này bi thảm hoá sự bất hạnh của người tàn tật.", "eng": "This book sentimentalizes the suffering of the disabled."}, {"viet": "Chiếc máy dò này là một công cụ rất tinh xảo, nếu sử dụng không đúng cách nó sẽ bị hỏng hết.", "eng": "This detector is a very delicate instrument, it'll go wrong if it's mishandled."}, {"viet": "Tôi hoàn toàn không thể hiểu được cuốn lịch sử này.", "eng": "This history book is completely impenetrable to me."}, {"viet": "Đây là cái giá hời nhất tôi có thể đặt ra với ông.", "eng": "This is the best price I can quote you."}, {"viet": "Thua lỗ này đã dẫn đến sự phá sản của doanh nghiệp.", "eng": "This loss led to the demise of the business."}, {"viet": "Khu vực này của thành phố xưa kia vốn rất sang trọng, nhưng bây giờ đã bắt đầu xuống dốc.", "eng": "This part of the town used to be fashionable, but it's starting to go downhill."}, {"viet": "Cái sẹo này là dấu vết nhận dạng chính của bà ta.", "eng": "This scar is her main distinguishing mark."}, {"viet": "Phương pháp điều trị này có thể dẫn đến các cánh tay thành tật.", "eng": "This treatment could result in malformation of the arms."}, {"viet": "Ngươi phải yêu những người gần gũi như thể yêu chính mình.", "eng": "Thou shalt love thy neighbor as thyself."}, {"viet": "Thái độ khoan dung là một trong nhiều mặt mạnh của bà ta.", "eng": "Tolerance is one of her many strengths."}, {"viet": "Hai năm sau, mẹ của bà qua đời.", "eng": "Two years later her mother died."}, {"viet": "Chiến tranh sẽ là một sự thay đổi đột ngột, nó sẽ không bao giờ còn như cũ được nữa.", "eng": "War was going do take a quantum leap, it would never be the same."}, {"viet": "Chúng ta sẽ đưa ngày họp sớm lên từ ngày 20 lên ngày 18.", "eng": "We'll bring the date of the meeting forward from the 20th to the 18th."}, {"viet": "Chúng tôi được tăng lương 40 pao một năm, trước khi thuế tăng.", "eng": "We're getting a wage increase of 40 pounds a year, before a tax."}, {"viet": "Chúng tôi rất thiếu nhân sự ở văn phòng tuần này.", "eng": "We're very short staffed in the this week."}, {"viet": "Chúng tôi nhận được tin không chính thức về vụ nổ ở trung tâm Luân Đôn.", "eng": "We've received unconfirmed reports of an explosion in Central London."}, {"viet": "Chúng tôi tin chắc là sẽ đáp ứng được sự mong đợi của ông để đem lại lợi ích cho cả đôi bên chúng ta.", "eng": "We are confident we will meet your wishes to our mutual."}, {"viet": "Chúng tôi đã đề nghị bà ta ủng hộ trong cuộc bầu cử, nhưng bà ta không tỏ ra tán thành ( yêu cầu của chúng tôi ).", "eng": "We asked for her support in the election but she wasn't sympathetic ( to our request )."}, {"viet": "Chúng ta có thể hoàn thành công việc này đúng thời hạn nếu mỗi người đều làm tốt phần việc của mình.", "eng": "We can finish this job on time if everyone does his bit."}, {"viet": "Chúng tôi có thể tiết kiệm được rất nhiều tiền.", "eng": "We could save a lot of money."}, {"viet": "Chúng tôi không lãng phí chỗ trống nào.", "eng": "We don't waste any space."}, {"viet": "Chúng tôi bảo đảm với ông sẽ giao hàng trong một ngày.", "eng": "We guarantee you delivery within one day."}, {"viet": "Chúng tôi có món xà lách với gà nướng ạ.", "eng": "We have a grilled chicken salad."}, {"viet": "Chúng tôi có mười người nấu ăn với rất nhiều người phụ giúp.", "eng": "We have ten people to do the cooking, with several more in support."}, {"viet": "Chúng ta biết rằng Columbus và các thủy thủ của ông không phải là người da trắng đầu tiên đặt chân tới châu Mỹ.", "eng": "We know now that Columbus and his men were not the first white men to reach America."}, {"viet": "Chúng tôi ăn chung khi chúng tôi còn ở trong Hải quân.", "eng": "We messed together when we were in the Navy."}, {"viet": "Chúng ta phải thôi không gặp nhau như thế này nữa-người ta đã bắt đầu bàn tán rồi đấy!", "eng": "We must stop meeting like this-people are beginning to talk!"}, {"viet": "Chúng tôi dự định leo núi, câu cá, bơi lội và lướt sóng, nhưng hầu hết các môn này đầu làm thư giãn.", "eng": "We plan to climb the mountains, go fishing, swimming, and windsurfing, but most of all relaxing."}, {"viet": "Hình như chúng ta đã đi lầm đường.", "eng": "We seem to have wandered from the path."}, {"viet": "Chúng tôi đã dừng lại Paris trên đường đi từ Rome tới London.", "eng": "We stopped at Paris en route from Rome to London."}, {"viet": "Chúng tôi muốn hỗ trợ dự án mới, chứ không phải muốn phá nó.", "eng": "We want to nurture the new project, not destroy it."}, {"viet": "Chúng tôi lo sợ khi nghe tin anh ta biến mất.", "eng": "We were perturbed to hear of his disappearance."}, {"viet": "Hình thù chúng ta trông sẽ rất kỳ và chẳng đẹp đẽ gì lắm nếu các bộ phận bên trong cơ thể chúng ta lộ ra.", "eng": "We would be very queer looking and certainly not very handsome if the inside parts of our bodies showed."}, {"viet": "Vậy, tôi hy vọng nhiệm vụ của ông ở đây sẽ thành công.", "eng": "Well, I hope your mission here will prove successful."}, {"viet": "Á vậy thì anh đang nói chuyện về luật.", "eng": "Well, you are talking about the laws, then."}, {"viet": "Bức ảnh đẹp thật! Tại sao cậu không phóng to lên?", "eng": "What a lovely photo! Why don't you have it blown up?"}, {"viet": "Cái làm tôi ngạc nhiên nhất là anh ta hoàn toàn không sợ hãi.", "eng": "What astonishes me most is his complete lack of fear."}, {"viet": "Bạn muốn dùng món gì tráng miệng?", "eng": "What do you want for dessert?"}, {"viet": "Món Long Hổ tranh hùng là món gì?", "eng": "What is the Battle between the Dragon and the Tiger?"}, {"viet": "Bạn nghĩ sao về công nghệ Nhật?", "eng": "What is your opinion of Japanese technology?"}, {"viet": "Giá cả chênh lệch thế nào?", "eng": "What's the difference in price?"}, {"viet": "Sẽ có những gì trong các chứng từ gửi hàng này?", "eng": "What will be included in these shipping documents?"}, {"viet": "Rồi khi các thành phố châu Âu bắt đầu phát triển thì không có những quốc gia hùng mạnh giữ vững luật pháp và trật tự trị an.", "eng": "When European cities began to grow, there were no strong nations to keep law and order."}, {"viet": "KHI Ở TOKYO HÃY SỐNG NHƯ NGƯỜI TOKYO.", "eng": "WHEN IN TOKYO, DO AS THE TOKYOITES."}, {"viet": "Khi bắt đầu mưa chúng tôi lao vào một quán cà phê.", "eng": "When the rain started, we dived into a cafe."}, {"viet": "Khi bạn hứa, bạn có luôn giữ lời không?", "eng": "When you make a promise, do you almost always keep your word?"}, {"viet": "Cửa hàng bán hàng miễn thuế ở đâu?", "eng": "Where is the duty-free shop?"}, {"viet": "Tại trường anh đã học những thứ tiếng gì?", "eng": "Which languages did you study at school?"}, {"viet": "Ai đã xoá các con số của tôi trên bảng đen?", "eng": "Who's rubbed my figures off the blackboard?"}, {"viet": "Bất cứ người nào chịu trách nhiệm cũng phải bồi thường thiệt hại.", "eng": "Whoever responsible will have to pay for the damage."}, {"viet": "Sao lại lo lắng chỉ vì một điểm xấu?", "eng": "Why get upset just because you got a bad mark?"}, {"viet": "Xin cô vui lòng đổi tờ séc trị giá 20 đô la sang tiền mặt ạ?", "eng": "Will you change a twenty-dollar's check into cash?"}, {"viet": "Các phù thuỷ lang băm được cho là có những khả năng siêu nhiên.", "eng": "Witch-doctors believed to have supernatural powers."}, {"viet": "Phụ nữ ở nhiều nước có địa vị rất nhỏ bé.", "eng": "Women have very little status in many countries."}, {"viet": "Xin ông vui lòng ký tên ngay đây?", "eng": "Would you just sign here, please?"}, {"viet": "Bà cảm phiền đến một nhà hàng khác nhé?", "eng": "Would you mind going to another restaurant?"}, {"viet": "Hãy viết con số bằng chữ và bằng số.", "eng": "Write the number in words and in figures."}, {"viet": "Vâng, nếu ông vẫn còn nhân dân tệ khi ông rời khỏi Trung Quốc ông có thể đổi nó sang ngoại tệ bằng cách xuất trình bản ghi nhớ đổi tiền đó.", "eng": "Yes, if you have leftover RMB when you leave China you may change it into foreign currency by submitting the exchange memo."}, {"viet": "Anh chắc sẽ vui khi được biết tin rằng Bill vẫn sống, khoẻ mạnh và hoạt động.", "eng": "You'll be glad to hear that Bill is alive and kicking."}, {"viet": "Anh luôn luôn nhầm tôi với cô em sinh đôi của tôi!", "eng": "You're always mixing me up with my twin sister!"}, {"viet": "Tom, cậu đã kiếm được một công việc dễ dàng ở đây!", "eng": "You've landed yourself a cushy little number here, Tom!"}, {"viet": "Anh không thể mong tôi đi hầu dâng anh cả ngày được!", "eng": "You can't expect me to fetch and carry for you all day!"}, {"viet": "Em có thể quên kỳ nghỉ năm nay đi-Anh mất việc rồi.", "eng": "You can forget about a holiday this year-I've lost my job."}, {"viet": "Cậu cũng có thể tới, anh ta gợi ý như một ý nghĩ chợt đến sau.", "eng": "You could come too, he suggested as an afterthought."}, {"viet": "Gần đây, anh kiếm tiền bằng nghề tay trái phải không?", "eng": "You have been making money on the side lately, haven't you?"}, {"viet": "Con biết là có thất nghiệp tăng vọt quanh thành phố khiến nhiều người phải đâm lo.", "eng": "You know there's such an increase in unemployment around town as to cause many people to worry."}, {"viet": "Chắc hẳn ông là ông Smith-người ta đã bảo tôi đón ông.", "eng": "You must be Mr Smith-I was told to expect you."}, {"viet": "Anh cần có thêm thực tế để hỗ trợ cho lý lẽ của anh.", "eng": "You need more facts to buttress up your argument."}, {"viet": "Bạn nên ăn kẹo ít hơn và ăn rau củ nhiều hơn.", "eng": "You should eat less candy and more vegetables."}, {"viet": "Anh chỉ việc xoay cái nút, đợi cho màn hình chuyển sang màu xanh lá cây rồi đẩy cái đĩa vào, thế là xong!", "eng": "You switch on, wait until the screen turns green, push in the disk and there you are!"}, {"viet": "Anh sẽ không thấy tôi làm việc ngày chủ nhật đâu!", "eng": "You won't catch me working on a Sunday!"}, {"viet": "Lời giải thích của anh nghe có vẻ hợp lí nhưng tôi không chắc là tin được.", "eng": "Your explanation sounds plausible but I'm not sure I believe it."}, {"viet": "Vé của anh sẽ đắt hơn nếu anh bay trong thời gian cao điểm.", "eng": "Your ticket will cost more if you fly during the high season."}]