[{"viet": "30 bảng Anh một tháng đóng góp vào tiền hưu trí.", "eng": "£ 30 a month goes towards a pension fund."}, {"viet": "Một cậu bé hay một cô bé đã đến trường học vài năm đều biết bảng cửu chương và hệ thống chữ cái.", "eng": "A boy or girl who has been going to school for a few years knows the multiplication table and the alphabet."}, {"viet": "Điếu thuốc làm bãi cỏ khô bốc cháy.", "eng": "A cigarette set the dry grass alight."}, {"viet": "Một cơn ho đã làm toàn thân của cô ta đau đớn.", "eng": "A coughing fit racked her whole body."}, {"viet": "Một xe tải giao hàng ghé nhiều địa điểm.", "eng": "A delivery van making the rounds."}, {"viet": "Bản song tấu cho vĩ cầm và dương cầm.", "eng": "A duet for violin and piano."}, {"viet": "Sự phô trương đẹp mắt của những bông hoa trên các cây táo.", "eng": "A fine show of blossom on the apple trees."}, {"viet": "Một điệu nhạc khiêu vũ của dân di-gan chơi bằng vĩ cầm.", "eng": "A gipsy dance played on the violin."}, {"viet": "Một sự dự đoán hoàn toàn không chính xác.", "eng": "A guess that's just not in the right ballpark."}, {"viet": "Một con ngựa đã dự thi giải Grand National bốn lần.", "eng": "A horse that has competed in the Grand National four times."}, {"viet": "Một vùng nhiều tài nguyên thiên nhiên.", "eng": "A land flowing with milk and honey."}, {"viet": "Một danh sách những nhà quí tộc Anh theo thứ tự địa vị xã hội.", "eng": "A list of the English aristocracy in order of precedence."}, {"viet": "Một người đàn ông có quan hệ với bọn tội phạm khét tiếng.", "eng": "A man connected with known criminals."}, {"viet": "Một cách nhìn mơ mộng về quá khứ.", "eng": "A misty-eyed view of the past."}, {"viet": "Một sản phẩm mới trở thành một món hàng hấp dẫn mạnh mẽ trong giới tiêu thụ.", "eng": "A new product that is a hot button among consumers."}, {"viet": "Một bài nhại hài hước thơ xonê của Shakespeare.", "eng": "A parody of a Shakespearian sonnet."}, {"viet": "Một miếng thịt có thể được nướng bằng một cái que trên ngọn lửa trại.", "eng": "A piece of meat can be roasted on a stick over a bonfire."}, {"viet": "Một nhà giảng đạo đứng thuyết giảng ở trung tâm thị trấn.", "eng": "A preacher stood declaiming in the town centre."}, {"viet": "Một máy radio có nút bấm điều chỉnh làn sóng.", "eng": "A radio with push-button tuning."}, {"viet": "Một con đường có nhiều chỗ gồ ghề.", "eng": "A road with a lot of bumps in it."}, {"viet": "Một bệnh nhân đã tỉnh lại phần nào khỏi cơn gây mê.", "eng": "A semi-conscious patient recovering from an anaesthetic."}, {"viet": "Một tình huống mà trong đó khó lòng xác định được điều gì là đúng và sai.", "eng": "A situation wherein it is hard to decide what is right and wrong."}, {"viet": "Một phím chức năng đặc biệt trình bày trên màn hình thực đơn hỗ trợ.", "eng": "A special function key that displays the help menu."}, {"viet": "Học sinh nào làm đúng 90% thì được chấm điểm hạng A.", "eng": "A student who gets 90% is graded A."}, {"viet": "Một bài trắc nghiệm khả năng thông thạo tiếng Anh.", "eng": "A test of proficiency in English."}, {"viet": "Một số lượng thời gian và tiền bạc tiết kiệm hữu ích.", "eng": "A useful saving of time and money."}, {"viet": "Một sự sắp xếp lớn các loại quà để lựa chọn.", "eng": "A wide assortment of gifts to choose from."}, {"viet": "Theo các qui định của chúng tôi, ai làm vỡ ly đều phải bồi thường.", "eng": "According to our regulations anyone who breaks a glass will have to pay for it."}, {"viet": "Phải thừa nhận rằng tôi thật sự chưa từng ở đó bao giờ.", "eng": "Admittedly, I've never actually been there."}, {"viet": "Sau khi đọc kinh cầu nguyện chúng tôi bắt đầu dùng bữa.", "eng": "After grace had been said, we commenced eating."}, {"viet": "Sau tai nạn đó, cô ta không còn cảm giác gì ở chân trái nữa.", "eng": "After the accident, she couldn't feel anything in her left leg."}, {"viet": "Nhằm mục đích cung cấp một cuộc huấn luyện hoàn chỉnh về mọi phương diện của công việc đó.", "eng": "Aim to provide a thorough training in all aspects of the work."}, {"viet": "Tất cả những cốc tách và đồ sứ của chúng tôi được cất trong tủ búp-phê.", "eng": "All our glass and china is kept in the cupboard."}, {"viet": "Cả thế giới ca tụng họ.", "eng": "All the world praised them."}, {"viet": "Liệu tôi có phù hợp với vai trò giám đốc hay không?", "eng": "Am I really fitted for the role of director?"}, {"viet": "Một con vật lớn như một người chịu khoảng 6 triệu pao áp suất trên cơ thể ở độ sâu một dặm.", "eng": "An animal as big as a man would have about six million pounds of pressure on its body at a depth of a mile."}, {"viet": "Một sự kiện báo hiệu sự thay đổi trong dư luận quần chúng.", "eng": "An event signaling a change in public opinion."}, {"viet": "Một cuộc lục soát khắp mọi nơi mà không tìm ra manh mối nào.", "eng": "An intensive search failed to reveal any clues."}, {"viet": "Một sự gia tăng không giải thích được về những vụ trẻ sơ sinh chết lúc đang ngủ.", "eng": "An unaccountable increase in cot deaths."}, {"viet": "Và khi mẹ cô ấy chết, cô ấy sợ hãi.", "eng": "And when her mother died she was afraid."}, {"viet": "Bất cứ ai cũng có thể dự thi-không giới hạn tuổi.", "eng": "Anyone can enter the contest-there's no age limit."}, {"viet": "Ở quê bạn có nhà hàng Nhật nào không?", "eng": "Are there any Japanese restaurants in your hometown?"}, {"viet": "Bạn sẽ dạy con chó của bạn làm trò khi nó lớn lên chứ?", "eng": "Are you going to teach your dog tricks when he is older?"}, {"viet": "Sự can thiệp vũ trang của một nước vào công việc của một nước khác.", "eng": "Armed intervention by one country in the affairs of another."}, {"viet": "Vì là thư ký riêng của bà ta, anh chàng được tiếp cận tất cả thư tín của bà ấy.", "eng": "As her private secretary he has access to all her correspondence."}, {"viet": "Hãy hỏi nàng về điều đó khi có dịp thích hợp.", "eng": "Ask her about it when a suitable moment offers itself."}, {"viet": "Vào lúc đó không có ngân hàng nào ở Trung Quốc kinh doanh ngoại hối ngoại trừ Ngân hàng Trung Quốc.", "eng": "At that time none of the banks in China dealt in foreign exchange business except the Bank of China."}, {"viet": "Thức tỉnh xã hội trước những mối nguy của ma tuý.", "eng": "Awaken society to the dangers of drugs."}, {"viet": "Hãy cẩn thận về khoảng cách kẻo không cậu lại viết hàng tít không đủ trên một dòng.", "eng": "Be careful with your spacing or you won't get the heading on one line."}, {"viet": "Lo lắng về chồng của ai.", "eng": "Be worried about one's husband."}, {"viet": "Dưới anh ta chẳng có cái gì ngoài một khoảng không đen xì.", "eng": "Below him there was nothing but a black void."}, {"viet": "Đôi giày hai màu xanh và trắng.", "eng": "Blue and white two-tone shoes."}, {"viet": "Anh và Pháp cùng đánh nhau với Đức trong cuộc chiến tranh vừa qua.", "eng": "Britain fought with France against Germany in the last war."}, {"viet": "Thế còn thằng bé đi với ông thì sao?", "eng": "But how about the little boy with you?"}, {"viet": "Nhưng con sông này chạy quanh ngọn đồi.", "eng": "But the river goes around the hill."}, {"viet": "Do tập trung quân ở biên giới, địch đã vô tình báo trước ý định xâm lược của mình vào nước mục tiêu.", "eng": "By massing troops on the border, the enemy telegraphed its intended invasion to the target country."}, {"viet": "Tôi có thể hỏi anh một câu không?", "eng": "Can I ask you a question?"}, {"viet": "Hai bên có thể đi đến một thỏa hiệp không?", "eng": "Can the two sides reach a compromise?"}, {"viet": "Anh có thể tưởng tượng được sống ra sao nếu không có điện?", "eng": "Can you imagine what it would be like to live without electricity?"}, {"viet": "Anh có thể chỉ cho tôi dãy nhà vệ sinh ở đâu không?", "eng": "Can you tell me where the toilets are?"}, {"viet": "Dạo này cải hoa rất rẻ.", "eng": "Cauliflowers are very cheap at the moment."}, {"viet": "Hình như trẻ con học máy điện toán bằng cách tiếp thu từ từ.", "eng": "Children seem to learn about computers by osmosis."}, {"viet": "Quần áo giặt ở nhiệt độ trung bình.", "eng": "Clothes to be washed at medium temperature."}, {"viet": "Giảm án tử hình thành án chung thân.", "eng": "Commute a death sentence to one of life imprisonment."}, {"viet": "Các yếu tố được cứu xét về an toàn là quan trọng hơn các mối quan tâm khác.", "eng": "Considerations of safety override all other concerns."}, {"viet": "Ông vui lòng điền vào tờ khai giặt ủi này ạ?", "eng": "Could you fill out the laundry form, please?"}, {"viet": "Những quốc gia thù địch với quyền lợi của chúng ta.", "eng": "Countries that are inimical to our interests."}, {"viet": "Bố ơi, khi nào họ sẽ bắt đầu?", "eng": "Daddy, when are they going to begin?"}, {"viet": "Chế độ dân chủ là thành trì bảo vệ tự do.", "eng": "Democracy is a bulwark of freedom."}, {"viet": "Từ điển nên càng dễ dùng càng tốt.", "eng": "Dictionaries should be as user-friendly as possible."}, {"viet": "Ông có thấy ai làm điều đó không?", "eng": "Did you see who did it?"}, {"viet": "Làm một tính cộng nhanh những con số.", "eng": "Do a rapid summation of the figures."}, {"viet": "Chúng ta có biết ai tên Tim Smith không nhỉ?", "eng": "Do we know a Tim Smith?"}, {"viet": "Bạn có hệ thống bảo vệ an ninh nhà ở không?", "eng": "Do you have a home security system?"}, {"viet": "Bạn có biết người nào đang cố bỏ hút thuốc không?", "eng": "Do you know anybody who is trying to quit smoking?"}, {"viet": "Ông có cần chúng ngay không?", "eng": "Do you need them right away?"}, {"viet": "Bạn có nghĩ là một số người có thể dự đoán tương lai không?", "eng": "Do you think that some people can predict the future?"}, {"viet": "Nó có nhiều ánh sáng không?", "eng": "Does it get plenty of sunshine?"}, {"viet": "Đừng bực mình làm gì, đó chỉ là thói quen của anh ta.", "eng": "Don't be offended, it's only his way."}, {"viet": "Đừng lo, chúng tôi sẽ đến đó đúng giờ.", "eng": "Don't fret, we'll get there on time."}, {"viet": "Đừng cho tỏi quá nhiều trong món ăn-không phải ai cũng thích đâu.", "eng": "Don't overdo the garlic in the food-not everyone likes it."}, {"viet": "Đừng tìm cách sinh sự với tôi-tôi có súng đây!", "eng": "Don't try mixing it with me-I've got a gun!"}, {"viet": "Phục sức một cách rất phô trương.", "eng": "Dress in a very ostentatious manner."}, {"viet": "Mỗi hàng ngói gối đầu lên hàng nằm dưới.", "eng": "Each row of tiles laps the one below."}, {"viet": "Tiếng Anh và Hà Lan là những ngôn ngữ có cùng nguồn gốc.", "eng": "English and Dutch are kindred languages."}, {"viet": "Cuối cùng bà ta trở nên dễ dãi và đã cho phép.", "eng": "Eventually she unbent and gave her permission."}, {"viet": "Xin lỗi, xin cho phép tôi được hân hạnh khiêu vũ với cô, thưa cô C?", "eng": "Excuse me, but may I have the pleasure of dancing with you, Miss C?"}, {"viet": "Công việc dôi ra khiến ông ấy cứ phải ở lại muộn tại văn phòng.", "eng": "Extra work kept him late at the office."}, {"viet": "Có cảm giác an toàn trong vòng tay của bà ta.", "eng": "Feel a sense of security in her arms."}, {"viet": "Quần áo đẹp làm tăng thêm vẻ đẹp trai quyến rũ của anh ta.", "eng": "Fine clothes added to his strikingly handsome appearance."}, {"viet": "Vùng vẫy trong những thủ tục quan liêu rắc rối.", "eng": "Floundering in a morass of bureaucratic procedures."}, {"viet": "Có một thời gian người ta xì xầm than phiền về đường lối bà ta điều hành sở này.", "eng": "For some time people had been muttering about the way she ran the department."}, {"viet": "Bồn chồn về chuyện đó có ích gì đâu.", "eng": "Fretting about it won't help."}, {"viet": "Nói chung người Mỹ có vẽ quan tâm hơn về sự làm ồn như thế.", "eng": "Generally it seems Americans are more concerned about such noise."}, {"viet": "Dành hết thời gian rảnh rỗi của mình để học hỏi.", "eng": "Give all one's spare time to study."}, {"viet": "Đi xem xem người phát thư đến chưa?", "eng": "Go and see whether the postman has been yet?"}, {"viet": "Các bản báo cáo của chính phủ thường đọc hơi chán.", "eng": "Government reports tend to make rather dry reading."}, {"viet": "Treo quần áo giặt lên dây phơi cho khô.", "eng": "Hang the washing on the line to dry."}, {"viet": "Bộ tất cả chúng mày mất trí rồi hả?", "eng": "Have you all taken leave of your sense?"}, {"viet": "Anh đã ghép hình xong bức tranh chưa?", "eng": "Have you finished the jigsaw yet?"}, {"viet": "Hôn hít vuốt ve nhau ở hàng ghế sau trong rạp chiếu bóng.", "eng": "Having a smooch in the back row of the cinema."}, {"viet": "Ông ta là người rất khó chiều.", "eng": "He's a very difficult man to please."}, {"viet": "Sau tai nạn đó, chắc chắn là nó phải cảm thấy run sợ''Đúng!'.", "eng": "He's bound to feel shaken after his accident''Quite!'."}, {"viet": "Nó vừa mới lao xuống đường chạy ra cửa hiệu.", "eng": "He's just popped down the road to the shops."}, {"viet": "Ông ta vẫn còn ở bệnh viện nhưng đã qua cơn nguy kịch rồi.", "eng": "He's still in hospital but out of danger."}, {"viet": "Anh ta đã bằng lòng để tôi về sớm.", "eng": "He agreed to let me go home early."}, {"viet": "Mãi vào cuối đời ông ấy mới trở thành một tác giả.", "eng": "He became an author quite late in life."}, {"viet": "Anh ta vội vã đến thăm khi nghe tin cô ấy ốm.", "eng": "He came hurrying to see her as soon as he heard she was ill."}, {"viet": "Anh ấy đạt được 9.6 giây trong cự ly 100 mét.", "eng": "He clocked 9.6 seconds in the 100 metres."}, {"viet": "Nó phóng hết tốc lực khắp nơi.", "eng": "He dashed around like a bat out of hell."}, {"viet": "Anh ấy lách sang trái, sang phải khi tên cướp nổ súng.", "eng": "He dodged to left and right as the gunman opened fire."}, {"viet": "Hắn trốn thoát bằng cách giả dạng lính gác.", "eng": "He escaped by passing himself off as a guard."}, {"viet": "Anh ta nhận thấy công việc mới của mình thật căng thẳng.", "eng": "He finds his new job a real strain."}, {"viet": "Ông ấy bỏ nghề luật để trở thành một nhà văn.", "eng": "He gave up law to become a writer."}, {"viet": "Anh ta có cái vẻ hoảng hốt trên gương mặt của mình.", "eng": "He had a startled look on his face."}, {"viet": "Anh ta cải trang khéo léo, nhưng ngay khi mở miệng nói anh ta đã bị lộ tẩy ngay.", "eng": "He has a good disguise, but as soon as he spoke he betrayed himself."}, {"viet": "Ông ấy đã đi sang Pháp.", "eng": "He has gone over to France."}, {"viet": "Anh ta không đủ quyết tâm để trở thành một nhân viên bán hàng thành công.", "eng": "He hasn't enough push to be a successful salesman."}, {"viet": "Cậu ta sợ đi ra ngoài một mình vào ban đêm.", "eng": "He is afraid to go out alone at night."}, {"viet": "Ông ta được đồn là một nhà phẫu thuật giỏi nhất ở Pari.", "eng": "He is reputed to be the best surgeon in Paris."}, {"viet": "Hắn cứ ngậm cái tẩu giữa hai hàm răng.", "eng": "He kept his pipe clamped between his teeth."}, {"viet": "Ông ấy đã trải qua hai cuộc thế chiến.", "eng": "He lived through both world wars."}, {"viet": "Anh ta đưa ra tất cả những nhận xét đúng đắn có bài bản.", "eng": "He made all the right noises."}, {"viet": "Anh ta nói nhỏ cái gì đó với cô bán hàng.", "eng": "He muttered something to the salesgirl."}, {"viet": "Anh ấy rẽ ngôi tóc ở chính giữa.", "eng": "He parts his hair in the middle."}, {"viet": "Ông ta giả bộ coi thường mọi chuyện xảy ra từ năm 1850.", "eng": "He professed to despise everything that happened since 1850."}, {"viet": "Anh ta đã chạy một dặm trong khoảng thời gian kỷ lục.", "eng": "He ran the mile in record time."}, {"viet": "Ông ta làm như mình là một chuyên gia.", "eng": "He represented himself as an expert."}, {"viet": "Anh ta thật đúng là một kẻ háu ăn.", "eng": "He's a real greedy guts."}, {"viet": "Anh ấy bỏ bê quá nhiều công việc.", "eng": "He's fallen far behind in his work."}, {"viet": "Anh ta không phải là một đấu thủ crickê giỏi.", "eng": "He's not much of a cricketer."}, {"viet": "Anh ấy ba lần được chọn vào đội tuyển Anh.", "eng": "He's won three caps for England."}, {"viet": "Anh ta hô hoán lên là có một đám cháy.", "eng": "He screamed out that there was a fire."}, {"viet": "Hắn xô cô ta ra khỏi lối đi.", "eng": "He shoved her out of the way."}, {"viet": "Hắn bị bỏ tù 5 năm vì tội giả mạo.", "eng": "He spent 5 years in prison for forgery."}, {"viet": "Anh ta đứng sững kinh hoàng trước cảnh tượng khủng khiếp.", "eng": "He stood aghast at the terrible sight."}, {"viet": "Anh ta phóng mình vào ghế lái xe.", "eng": "He swung himself up into the driver's seat."}, {"viet": "Nó kể cho chúng tôi về những cuộc du lịch của nó.", "eng": "He told us of his travels."}, {"viet": "Hắn cố hôn cô nàng nhưng cô nàng đã xô hắn ra.", "eng": "He tried to kiss her but she fended him off."}, {"viet": "Hắn thốt lên những tiếng rủa mạnh mẽ khi đánh rơi thanh sắt vào chân.", "eng": "He uttered several vigorous expletives when he dropped the iron on his foot."}, {"viet": "Nó bị buộc tội là đã cố tình gây ra khó khăn.", "eng": "He was accused of purposely creating difficulties."}, {"viet": "Được giáo dục phải tôn trọng nhà chức trách.", "eng": "He was brought up to respect authority."}, {"viet": "Ông ấy được bầu làm lãnh đạo của Đảng Lao động.", "eng": "He was elected to the leadership of the Labour party."}, {"viet": "Anh ta được kết nạp vào câu lạc bộ Sư tử.", "eng": "He was initiated as a member of the Lions Club."}, {"viet": "Nó đã thất nghiệp sáu tháng.", "eng": "He was out of a job for six months."}, {"viet": "Anh ta mải mê suy nghĩ không hay biết một chiếc ô tô đang tới gần.", "eng": "He was so busy with his thoughts he was unaware of a car approaching."}, {"viet": "Nó đang bị cảnh sát theo dõi.", "eng": "He was under observation by the police."}, {"viet": "Anh ta về nông thôn còn cô ta thì ra thành phố.", "eng": "He went to the country to the town went she."}, {"viet": "Anh ta làm việc căng thẳng quá cuối cùng đã ngã bệnh.", "eng": "He worked so hard that eventually he made himself ill."}, {"viet": "Những vụ tăng vọt được ghi nhận trên thị trường chứng khoán ngày hôm nay.", "eng": "Heavy gains were recorded on the Stock Exchange today."}, {"viet": "Đứa bé của cô ta sẽ ra đời tháng sau, cô ấy hy vọng nó sẽ là một đứa con trai.", "eng": "Her baby's due next month, she hopes it will be a boy."}, {"viet": "Lòng can đảm của cô ta đã quá rõ.", "eng": "Her courage is beyond all dispute."}, {"viet": "Gương mặt của cô ta đờ ra vì khiếp sợ.", "eng": "Her face was rigid with terror."}, {"viet": "Bà ta bắt đầu bị điếc lúc bà bước sang tuổi bảy mươi.", "eng": "Her hearing went in her seventies."}, {"viet": "Chân cô ấy bị hỏng nặng đến nỗi bác sĩ phải cưa.", "eng": "Her leg was so badly damaged that the doctor had to amputate."}, {"viet": "Văn phòng của cô ta ở tầng hai.", "eng": "Her office is on the second floor."}, {"viet": "Những lời nhận xét của cô ta đã làm tổn thương tính tự cao của anh ấy.", "eng": "Her remarks had injured his vanity."}, {"viet": "Hành vi kỳ quặc của cô ta đã khơi gợi mối nghi ngờ của chúng tôi.", "eng": "Her strange behaviour aroused our suspicions."}, {"viet": "Đây là một mẹo vặt để tẩy các vết bẩn trên quần áo.", "eng": "Here's a handy tip for removing stains from clothing."}, {"viet": "Thuê mười hai người để đào một cái hào.", "eng": "Hire a dozen men to dig a ditch."}, {"viet": "Giờ đi ngủ của anh ta là 8 giờ.", "eng": "His bedtime is eight o'clock."}, {"viet": "Các đồng sự của ông ta ở sở ngoại vụ.", "eng": "His colleagues are in the foreign affairs."}, {"viet": "Những nỗ lực của anh ta cuối cùng đã đem lại kết quả và anh đã được cấp giấy phép.", "eng": "His efforts finally bore fruit and permission was granted."}, {"viet": "Kiến nghị của ông ta với các cấp có thẩm quyền cao hơn chưa chắc xuất phát từ nhu cầu thực sự của công chúng.", "eng": "His feedback to the higher authorities could arguably come from the public's true needs."}, {"viet": "Nhà ông ấy ở cách một khoảng đằng kia.", "eng": "His house is over there a piece."}, {"viet": "Đời ông ta không ăn khớp với lời nói của ông ta.", "eng": "His life does not square with his words."}, {"viet": "Tấm gương cao quí của ông ta đã khiến cho tất cả chúng tôi phấn khởi nỗ lực nhiều hơn.", "eng": "His noble example inspired the rest of us to greater efforts."}, {"viet": "Hành động nông nổi của ông ta trong việc bán tài sản.", "eng": "His precipitate action in selling the property."}, {"viet": "Quả sút của anh ấy làm cho thủ môn hoàn toàn bó tay.", "eng": "His shot beat the goalkeeper neck and crop."}, {"viet": "Thầy giáo của nó khiển trách nó vì tội lơ đễnh trong lớp học.", "eng": "His teacher castigated him for his inattentiveness in class."}, {"viet": "Tác phẩm của ông ta đã làm bị chìm vào quên lãng sau khi ông ta chết.", "eng": "His work fell into oblivion after his death."}, {"viet": "Lương thiện và thẳng thắn là đặc tính của anh ấy.", "eng": "Honesty and frankness are traits of his character."}, {"viet": "Còn doanh nhân tiêu biểu ở nước bạn thì sao?", "eng": "How about the typical businessperson in your country?"}, {"viet": "Sao anh dám xét đoán tôi?", "eng": "How dare you sit in judgement on me?"}, {"viet": "Làm sao anh có thể chịu đựng được sự căng thẳng như vậy?", "eng": "How do you stand the strain?"}, {"viet": "Kể từ lần chúng tôi đến thăm mẹ anh, đã bao lâu rồi?", "eng": "How long is it since we visited your mother?"}, {"viet": "Nhóm quý khách có bao nhiêu người?", "eng": "How many people are there in your party?"}, {"viet": "Số lượng đó tính theo đồng yên Nhật là khoảng bao nhiêu?", "eng": "How much is that in yen?"}, {"viet": "Thế ông có muốn một phòng đôi có hai giường rời giống nhau không?", "eng": "How would you like a double room with twin beds?"}, {"viet": "Tôi đã tập dượt bài nói trong nhiều ngày, nhưng tôi vẫn cứ làm rất tồi.", "eng": "I'd been practicing the speech for days, but I made a real pig's ear of it anyway."}, {"viet": "Tôi muốn mua hai vé xem phim “ Vẻ đẹp Mỹ ”.", "eng": "I'd like two tickets for American Beauty, please."}, {"viet": "Tôi sẽ hướng dẫn riêng cho ông một vòng tham quan viện bảo tàng!", "eng": "I'll give you a personally guided tour of the museum!"}, {"viet": "Tôi sẽ viết vội mấy chữ để nói mấy giờ chúng tôi về.", "eng": "I'll scribble a note to say what time we'll come home."}, {"viet": "Tôi sợ đó là tất cả một sai lầm ghê gớm.", "eng": "I'm afraid it's all a dreadful mistake."}, {"viet": "Tôi sẽ thết đãi cơm chiều thứ Sáu tuần tới, anh vui lòng đến dự nhé?", "eng": "I'm giving a dinner party next Friday evening, would you like to come?"}, {"viet": "Tôi muốn mua một cái quần jean cho con trai tôi.", "eng": "I'm interested in a pair of jeans for my son."}, {"viet": "Tôi chỉ ở đây coi như lấp chỗ trống trong khi Robert đi vắng.", "eng": "I'm only here as a fill-in while Robert's away."}, {"viet": "Tôi rất tiếc khi nghe nói hôm nay ông cảm thấy không được khoẻ.", "eng": "I'm sorry to hear you are not feeling well today."}, {"viet": "Tôi đang cố tìm ông Smith ở đâu, Anh có biết ông ấy đâu không?", "eng": "I'm trying to locate Mr Smith, Do you know where he is?"}, {"viet": "Người ta mời tôi làm một công việc tốt hơn nhưng lương thấp hơn-tôi thật bối rối khó xử không biết làm thế nào.", "eng": "I've been offered a better job but at a lower salary-I'm in a quandary about what to do."}, {"viet": "Tôi không hề có hồ sơ về thành tích của con ngựa này.", "eng": "I've got no record of this horse's form."}, {"viet": "Mình chưa bao giờ thấy một đôi vợ chồng nào xung khắc nhau như thế.", "eng": "I've never seen such an incompatible couple."}, {"viet": "Tôi hoàn toàn bác bỏ đường lối của ban quản trị về việc đó.", "eng": "I absolutely reject the management's line on this."}, {"viet": "Tôi chịu trách nhiệm trước chính phủ đối với bất cứ quyết định nào tôi làm.", "eng": "I am answerable to the government for any decision I make."}, {"viet": "Tôi nhận thức rất rõ sự thiếu hụt nguồn tiếp tế thực phẩm.", "eng": "I am very much aware of the lack of food supplies."}, {"viet": "Tôi cho rằng đó là một sai lầm.", "eng": "I believe it to have been a mistake."}, {"viet": "Tôi không thể coi cuốn sách của tôi là ăn khách theo đúng nghĩa của từ này nhưng nó rất được ưa thích.", "eng": "I can't call my book a best seller as such but it's very popular."}, {"viet": "Tôi nghĩ rằng tôi không thể trách cô ta về chuyện từ chức được.", "eng": "I can't say I blame her for resigning."}, {"viet": "Tôi có thể tự lo được.", "eng": "I can manage on my own."}, {"viet": "Tôi không thể nhảy cao hơn tí nào nữa.", "eng": "I can't jump any higher."}, {"viet": "Tôi có thể nghe thấy anh ta cười lặng lẽ một mình khi đọc cuốn sách.", "eng": "I could hear him chuckling to himself as he read his book."}, {"viet": "Tôi muốn nói chuyện riêng với bạn.", "eng": "I'd like a private chat with you."}, {"viet": "I didn't do nothing là một phủ định kép.", "eng": "I didn't do nothing is a double negative."}, {"viet": "Tôi không thuộc về phái ủng hộ sự thay đổi cấp tiến.", "eng": "I don't belong to the school of thought that favours radical change."}, {"viet": "Tôi không thích đi ra ngoài một mình sau khi trời tối.", "eng": "I don't like going out alone after dark."}, {"viet": "Tôi chắc anh không biết điều này có ý nghĩa to lớn như thế nào đối với tôi đâu.", "eng": "I don't think you're aware how much this means to me."}, {"viet": "Tôi chẳng thấy cô ta dễ thương gì cho lắm.", "eng": "I don't find her very sympathetic."}, {"viet": "Tôi kiếm tiền bằng cách bán báo.", "eng": "I earn some money by delivering newspapers."}, {"viet": "Tôi cảm thấy khả năng của tôi rất đáng hồ nghi ở đây.", "eng": "I feel that my competence is being called into question here."}, {"viet": "Tôi cứ ngây thơ ngỡ rằng anh có quan tâm.", "eng": "I fondly imagined that you cared."}, {"viet": "Tôi đạt được 96% anh ta 94% do vậy tôi chỉ hơn anh ta chút xíu.", "eng": "I got 96 percent, he got 94, so I beat him by a short head."}, {"viet": "Tôi đã bị một tai nạn nhẹ ở nhà và đánh vỡ một số đồ sứ.", "eng": "I had a slight accident at home and broke some crockery."}, {"viet": "Tôi đã tưởng tượng ra hình ảnh chúng ta đang đình công.", "eng": "I had visions of us going on strike."}, {"viet": "Tôi có mang theo thư giới thiệu của của ông Davidson ở Singapore.", "eng": "I have brought a letter of introduction from Mr. Davidson of Singapore."}, {"viet": "Tôi có quyền ưu tiên hơn anh về yêu sách của tôi.", "eng": "I have priority over you in my claim."}, {"viet": "Tôi không đủ tiền để mua quyển sách đó.", "eng": "I haven't got nearly enough money to buy that book."}, {"viet": "Hôm nọ tôi nghe một câu chuyện rất lạ.", "eng": "I heard an extraordinary story the other day."}, {"viet": "Tôi mong là chúng ta đã giải quyết được một số vấn đề.", "eng": "I hope we cleared up some problems."}, {"viet": "Tôi chỉ việc ném tất cả mọi thứ vào sau xe ôtô.", "eng": "I just threw the whole caboodle in the back of the car."}, {"viet": "Cháu đã học được nhiều điều trong thời gian lưu lại đây.", "eng": "I learned a lot during my stay here."}, {"viet": "Tôi sống chỉ có một mình nhưng không bao giờ cảm thấy cô độc.", "eng": "I live all alone but I never feel lonely."}, {"viet": "Thầy sẽ cho các em một số bài tập về nhà.", "eng": "I'll give you some homework."}, {"viet": "Tôi sẽ chuyển cuộc gọi của ông ngay.", "eng": "I'll transfer your call immediately."}, {"viet": "Tôi tùy thuộc hoàn toàn vào anh thôi.", "eng": "I'm entirely in your hands."}, {"viet": "Tôi chưa tính tới chuyện nghỉ hưu đâu.", "eng": "I'm not contemplating retiring yet."}, {"viet": "Tôi ngạc nhiên là anh ấy đã không đến.", "eng": "I'm surprised that he didn't come."}, {"viet": "Tôi quan tâm tới những gì người ta nghĩ về tôi.", "eng": "I mind what people think about me."}, {"viet": "Tôi gần như giật thót mình khi một bàn tay nắm chặt lấy tôi trong bóng tối.", "eng": "I nearly jumped out of my skin when a hand grabbed me in the dark."}, {"viet": "Tôi để ý thấy anh ấy đã ra đi sớm.", "eng": "I noticed that he left early."}, {"viet": "Tôi đã dẹp tự ái đi và xin tăng lương.", "eng": "I pocketed my pride and ask for a raise."}, {"viet": "Tôi thực sự may mắn trong kỳ thi tiếng Anh.", "eng": "I really aced out on that test in English."}, {"viet": "Tôi nhớ đã đọc tiểu sử của cô ấy lần đầu tiên được xuất bản vào năm 1977.", "eng": "I remember reading her biography first published in 1977."}, {"viet": "Này, cẩn thận vào! Anh không được nói như vậy về một người mà anh chưa bao giờ gặp.", "eng": "I say, steady on! You can't say things like that about someone you've never met."}, {"viet": "Tôi sẽ dùng thuốc lá điều độ hơn nếu tôi là anh.", "eng": "I should ease up on the cigarettes if I were you."}, {"viet": "Tôi còn 6 ngày nữa để sống ở Mỹ.", "eng": "I still have six more days to spend in America."}, {"viet": "Tôi nghĩ 500 gam đủ cho hai người dùng rồi.", "eng": "I think 500 grams is more than enough for two persons."}, {"viet": "Tôi nghĩ đồng hồ của tôi chạy nhanh.", "eng": "I think my watch is fast."}, {"viet": "Tôi nghĩ rằng tôi ngửi thấy cái gì đang cháy.", "eng": "I thought I could smell something burning."}, {"viet": "Tôi cố chùi sạch cái đồng hồ, nhưng chỉ tổ làm nó vỡ.", "eng": "I tried to clean the watch, but only succeeded in breaking it."}, {"viet": "Tôi muốn hỏi ông vài câu.", "eng": "I've got a couple of questions."}, {"viet": "Tôi muốn ăn những cuốn chả giò giòn tan.", "eng": "I want to eat fresh spring rolls."}, {"viet": "Tôi sợ điếng cả người.", "eng": "I was absolutely petrified."}, {"viet": "May mắn cho tôi là họ không hỏi tôi.", "eng": "I was grateful that they didn't ask me."}, {"viet": "Tôi vừa mở cổng thì bị con chó của họ lao ra cắn.", "eng": "I was set on by their dog as soon as I opened the gate."}, {"viet": "Tôi không biết anh có thể giúp tôi không.", "eng": "I was wondering if you could help me."}, {"viet": "Tôi ước gì anh ấy đừng đi chơi mỗi tối.", "eng": "I wish he wouldn't go out every night."}, {"viet": "Tôi tự hỏi không biết có được hoàn tiền lại hay không?", "eng": "I wonder if refunds are allowed?"}, {"viet": "Tôi muốn một chỗ ngồi ở giữa máy bay.", "eng": "I would like a seat in the middle of the airplane."}, {"viet": "Nếu tôi là bạn, tôi sẽ suy nghĩ rất kỹ về điều đó.", "eng": "I would think about it very carefully, if I were you."}, {"viet": "Nếu có người nào đi báo cho cảnh sát biết về hoạt động của chúng tôi, mạng sống nó sẽ không còn!", "eng": "If anyone grasses on us, his life won't be worth living!"}, {"viet": "Nếu tôi đi giày dính bùn đất vào nhà, thể nào cha tôi cũng mắng.", "eng": "If I walk in with muddy boots, dad always scolds."}, {"viet": "Nếu giá chẳng hạn là 500 bảng Anh, thì có đắt quá không?", "eng": "If the price is £ 500, let us say, is that too much?"}, {"viet": "Nếu anh đi xem phim, anh cho tôi đi theo anh được không?", "eng": "If you're going to the cinema, do you mind if I tag along with you?"}, {"viet": "Nếu ông không thấy đỡ hơn vào ngày mốt, hãy quay lại đây.", "eng": "If you don't feel better by the day affer tomorrow, come back again."}, {"viet": "Nếu trộn màu xanh với màu vàng, bạn sẽ có màu lục.", "eng": "If you mix blue with yellow you get green."}, {"viet": "Nếu anh tưới nó quá nhiều, nó sẽ tàn.", "eng": "If you water them too much, they will die."}, {"viet": "Trong nhóm từ all the boys và''both his parents, những từ all và''both là predeterminer.", "eng": "In all the boys and''both his parents, all and''both are predeterminers."}, {"viet": "Lần sau xin hãy cẩn thận hơn.", "eng": "In future please be more careful."}, {"viet": "Ở vào vị trí của quả lắc là một bánh lắc nhỏ và một lò xo rất tốt.", "eng": "In place of the pendulum there was a little flywheel and a very fine spring."}, {"viet": "Trong lúc đầu vui vẻ, anh ấy gọi đồ uống mừng mọi người.", "eng": "In the first flush of success he ordered drinks for everybody."}, {"viet": "Vào thời kỳ đó, tất cả châu âu hình như đang đi khai phá.", "eng": "In those days all Europe, it seemed, was going exploring."}, {"viet": "Đáng lý cần tranh luận những vấn đề của họ thì họ lại nén tất cả nỗi giận dữ và bực bội lại.", "eng": "Instead of discussing their problems, they bottle up all their anger and resentment."}, {"viet": "Có phải ý anh muốn tôi huỷ bỏ việc chuẩn bị không?", "eng": "Is it your pleasure that I cancel the arrangements?"}, {"viet": "Trên ti-vi tối nay có gì hay không?", "eng": "Is there anything good on television tonight?"}, {"viet": "Ở trong này hơi đông người, anh có đi qua được không?", "eng": "It's a bit crowded in here-can you get through?"}, {"viet": "Đó là một cái cửa thật bất tiện-cứ phải cúi người để đi qua.", "eng": "It's an awkward door-you have to bend down to go through it."}, {"viet": "Thật là bực khi cố chạy cho kịp chuyến tàu mà lại bị trễ mất có nửa phút.", "eng": "It's exasperating to run for a train and then miss it by half a minute."}, {"viet": "Chắc chắn bà ấy sẽ là Bộ trưởng bộ giáo dục tới đây.", "eng": "It's morally certain that she'll be the next Minister of Education."}, {"viet": "Mưa rào ấy mà Chúng ta hãy đợi cho nó tạnh!", "eng": "It's only a shower Let's wait until it stops!"}, {"viet": "Đã đến lúc cần phải nghiêm túc rồi, anh đã đưa câu chuyện đùa này đi quá xa rồi đấy.", "eng": "It's time to be serious, you've carried this joke far enough."}, {"viet": "Tôi lấy làm kinh ngạc là trước đây chưa hề ai nghĩ đến điều ấy.", "eng": "It astonishes me that no one has thought of this before."}, {"viet": "Đây là một ví dụ cổ điển về cách tránh thiết kế một trung tâm đô thị mới như thế nào.", "eng": "It is a classic example of how not to design a new city centre."}, {"viet": "Nó ở trong ngăn kéo gần cửa trước.", "eng": "It is in the drawer by the front door."}, {"viet": "Mọi người đều thừa nhận rằng...", "eng": "It is universally acknowledged that..."}, {"viet": "Tôi rất tức giận vì bị đuổi ra khỏi chính ngôi nhà mình.", "eng": "It peeves me to be ordered out of my own house."}, {"viet": "Đó là một phần của việc giáo dục con người.", "eng": "It's part of the education of people."}, {"viet": "Nghe như điềm cáo chung của toàn bộ hy vọng của cô ta.", "eng": "It sounded the knell of all her hopes."}, {"viet": "Đứng xếp hàng lâu như vậy mà vẫn không được xem hoà nhạc thì quả là một điều đáng buồn.", "eng": "It was a real bummer standing in line for so long and still not getting tickets to the concert."}, {"viet": "Không thể nào phát hiện được sự bí ẩn này.", "eng": "It was impossible to penetrate the mystery."}, {"viet": "Cho tới sáng nay vẫn còn ngon miệng.", "eng": "It was time until this morning."}, {"viet": "Nếu có thể cân đối các kế hoạch của chúng tôi ( với kế hoạch của các ông ) thì có lẽ sẽ là hợp lý.", "eng": "It would be sensible if we could harmonize our plans ( with yours )."}, {"viet": "Bạn gái của Jim đã đưa ra một chứng cớ ngoại phạm có sức thuyết phục bằng cách nói rằng đêm hôm xảy ra vụ cướp anh ta ở với cô.", "eng": "Jim's girlfriend gave him a cast-iron alibi by saying that he was with her on the night of the robbery."}, {"viet": "Đối diện nhà chúng tôi có một trường học.", "eng": "Just across from our house there's a school."}, {"viet": "Những công ty lớn thường thu lợi từ sự giảm giá một nửa.", "eng": "Large companies often benefit from economies of scale."}, {"viet": "Để tôi cho anh danh thiếp của tôi.", "eng": "Let me give you my card."}, {"viet": "London đã bị ném bom nặng nề trong cuộc chiến tranh vừa qua.", "eng": "London was heavily bombed during the last war."}, {"viet": "Nhiều người đang đi bộ ngoài đường mặc dù hôm nay là sáng sớm chủ nhật.", "eng": "Many people are walking outside even though it is an early Sunday morning."}, {"viet": "Mary và Jane hoàn toàn khác nhau.", "eng": "Mary and Jane are quite different from each other."}, {"viet": "Xin ông cho tôi xem giấy ủy nhiệm của ông về việc này?", "eng": "May I see your authorization for this?"}, {"viet": "Nhanh quá hóa chậm là một câu nói nghịch lý nổi tiếng.", "eng": "More haste, less speed is a well-known paradox."}, {"viet": "Ông Hopkins đang nói chuyện trên một đường dây khác.", "eng": "Mr. Hopkins is on another line."}, {"viet": "Toàn thân của mẹ hơi bị tê cứng.", "eng": "My body is kind of stiff."}, {"viet": "Bố tôi ngồi vào phía đầu bàn.", "eng": "My father took his place at the head of the table."}, {"viet": "Mẹ tôi luôn tỏ ra nghiêm khắc mỗi khi tôi về nhà muộn vào ban đêm.", "eng": "My mother is always straight faced when I go home late at night."}, {"viet": "Sở thích của tôi đã thay đổi nhiều qua năm tháng.", "eng": "My tastes have changed enormously over the years."}, {"viet": "Bằng chứng mới đã phơi bày sự đuối lý của việc khởi tố.", "eng": "New evidence revealed the weakness of the prosecution's case."}, {"viet": "Không, tôi thấy được rồi, cám ơn.", "eng": "No, I'm fine, thank you."}, {"viet": "Không có người nào đầu óc lành mạnh mà lại đi làm việc trong bộ áo quần ngủ.", "eng": "No rational person would go to work in his pyjamas."}, {"viet": "Bây giờ cô ta đã xin lỗi rồi, thế là tôi vui lòng.", "eng": "Now that she has apologized, I am content."}, {"viet": "Ồ, quầy bán vé đây rồi.", "eng": "Oh, here's the ticket-counter."}, {"viet": "Tuổi già đã làm khả năng phán đoán của ông ta không còn sáng suốt.", "eng": "Old age has clouded his judgment."}, {"viet": "Các động cơ có ý thức của người ta thường khác với các động cơ tiềm thức.", "eng": "One's conscious motives are often different from one's subconscious ones."}, {"viet": "Chỉ cần hít một hơi cái này là đủ giết chết anh rồi.", "eng": "One sniff of this is enough to kill you."}, {"viet": "Nước chúng tôi là nơi ẩn náu cho những người tị nạn chính trị từ khắp nơi trên thế giới tới.", "eng": "Our country is a sanctuary for political refugees from all over the world."}, {"viet": "Những thua thiệt của chúng ta bắt đầu làm tôi lo lắng.", "eng": "Our losses are beginning to concern me."}, {"viet": "Hôm qua đội chúng tôi đã lĩnh phải thất bại hoàn toàn.", "eng": "Our team got a terrible walloping yesterday."}, {"viet": "Quốc hội đã thông qua một đạo luật cấm những trò thể thao như vậy.", "eng": "Parliament has passed an act which makes such sports illegal."}, {"viet": "Người ta nói rằng sét không bao giờ đánh hai lần cùng một chỗ.", "eng": "People say that lightning never strikes twice in the same place."}, {"viet": "Vui lòng mang hành lý của tôi lên phòng giùm nhé!", "eng": "Please have my luggage sent up to my room!"}, {"viet": "Hướng tư tưởng của ai vào tương lai.", "eng": "Project one's thoughts into the future."}, {"viet": "Các nhà khoa học đang tiến hành cuộc điều tra các nguyên nhân của vụ tai nạn.", "eng": "Scientists are conducting an investigation into the causes of the accident."}, {"viet": "Tôi sẽ nhận lời nhắn hay ông sẽ gọi lại sau?", "eng": "Shall I take a message or will you call later?"}, {"viet": "Cô ta là một phụ nữ đáng tin cậy.", "eng": "She's a woman who can be depended on."}, {"viet": "Cô ấy rất muốn biết anh đã ở đâu.", "eng": "She's dying to know where you've been."}, {"viet": "Trong khi tôi đi vắng cô ấy cứ dùng thuốc lá của tôi một cách thoải mái.", "eng": "She's made free with my cigarettes during my absence."}, {"viet": "Cô ấy cao hơn tôi, nhưng vì tôi lại chỉ cao có năm bộ vậy thì đâu có gì đáng nói.", "eng": "She's taller than me, but as I'm only five foot, that's not saying much."}, {"viet": "Cô ta bao giờ cuối cùng cũng giành được cái mình muốn.", "eng": "She always gets her own way in the end."}, {"viet": "Cô ta tình cờ thấy mấy chiếc ảnh cũ trong ngăn kéo.", "eng": "She came across some old photographs in a drawer."}, {"viet": "Theo ý kiến của các môn đệ trung thành thì bà ta không thể làm điều gì sai trái.", "eng": "She could do no wrong in the opinion of her devoted followers."}, {"viet": "Cô ấy đã đi chặng đường đầu tiên bằng tàu hoả.", "eng": "She did the first stage of the trip by train."}, {"viet": "Cuối cùng cô ta lấy người mê say cô bền bỉ nhất.", "eng": "She eventually married the most persistent of her admirers."}, {"viet": "Cô ấy hớn hở loan báo rằng cô sẽ ra đi vào ngày hôm sau.", "eng": "She gaily announced that she was leaving the next day."}, {"viet": "Cô ta đã chán ngấy những chuyện ghen tuông vụn vặt của anh ta.", "eng": "She grew tired of his petty jealousies."}, {"viet": "Cô ấy lấy một tấm bảng “ Xin đừng quấy rầy ” từ chiếc xe đẩy tay của mình đưa cho người khách trọ.", "eng": "She hands the guest a Do not disturb sign from her trolley."}, {"viet": "Cô ấy đã đáp ứng đầy đủ các điều kiện nhập học trường cao đẳng.", "eng": "She has satisfied the conditions for entry into the college."}, {"viet": "Cô ta giống mẹ như đúc.", "eng": "She is a perfect model of her mother."}, {"viet": "Bà ấy là người bác duy nhất tôi có.", "eng": "She is the only aunt I have."}, {"viet": "Chị ấy san bằng mặt của hỗn hợp bột bánh bằng cái bàn xẻng kim loại.", "eng": "She levelled the surface of the cake mixture with a metal spatula."}, {"viet": "Cô ta cố gắng nói ngôn ngữ của họ.", "eng": "She made an attempt to speak their language."}, {"viet": "Bà ta đã giành được lợi ích tối đa từ cách giải quyết này.", "eng": "She obtained maximal benefit from the course."}, {"viet": "Bà ta đã chuẩn bị cho tất cả các khả năng có thể xảy ra bằng cách mang đi mũ rộng vành tránh nắng, áo mưa và một chiếc khăn quàng bằng len.", "eng": "She prepared for all possibilities by taking a sunhat, a raincoat and a woolly scarf."}, {"viet": "Cô ấy đã chậm rãi nhắc lại các lời hướng dẫn để anh ta có thể hiểu.", "eng": "She repeated the instructions slowly in order that he should understand."}, {"viet": "Nàng sắp sửa có thêm một đứa con nữa.", "eng": "She's going to have another baby."}, {"viet": "Cô ấy chưa được tận dụng hết khả năng trong công việc hiện tại của cô ấy.", "eng": "She's wasted in her present job."}, {"viet": "Cô ta ít đi xem chiếu bóng, nếu có thì cũng hiếm lắm.", "eng": "She seldom, if ever, goes to the cinema."}, {"viet": "Cô ta giải quyết vấn đề một cách thực tế.", "eng": "She solved the problem very practically."}, {"viet": "Bà ta đã phải chịu đựng nhiều sự xúc phạm của các đồng nghiệp.", "eng": "She suffered many slights from colleagues."}, {"viet": "Khi được đề bạt bà ta đảm nhiệm những trách nhiệm lớn hơn.", "eng": "She took on greater responsibilities when she was promoted."}, {"viet": "Chị ấy kịch liệt công kích thẳng những người chỉ trích mình bằng những nhận xét mở đầu.", "eng": "She waded straight into her critics with her opening remarks."}, {"viet": "Cô ta là một tấm gương cho cả lớp.", "eng": "She was an example to the rest of the class."}, {"viet": "Cô ta được tuyển dụng làm thông dịch viên.", "eng": "She was engaged as an interpreter."}, {"viet": "Cô ấy đang nỗ lực lớn để giành lấy vai trò lãnh đạo đảng.", "eng": "She was making a big play for the leadership of the party."}, {"viet": "Cô ta đã im hơi lặng tiếng trong nhiều tháng trước khi tôi nhận được một bức thư của cô.", "eng": "She was silent for months before I got a letter from her."}, {"viet": "Bà ấy không thiện chí chút nào về việc giải quyết nghỉ phép cho tôi.", "eng": "She was very sticky about giving me leave."}, {"viet": "Cô ta thì thầm những lời âu yếm vào tai anh ta.", "eng": "She whispered sweet nothings into his ear."}, {"viet": "Cô ta sùng bái ông ấy và từ chối không chịu nghe những người chỉ trích ông ta.", "eng": "She worshipped him and refused to listen to his critics."}, {"viet": "Lách vai mình đi vào phòng.", "eng": "Shoulder one's way into the room."}, {"viet": "Từ khi được thăng chức, cô ấy lên mặt với mọi người trong văn phòng.", "eng": "Since her promotion she queens it over everyone else in the office."}, {"viet": "Khai quang lối đi của chúng ta xuyên qua rừng rậm bằng những con dao dài.", "eng": "Slashing our way through the jungle with long knives."}, {"viet": "Cười khinh rẻ những người được coi là thấp kém hơn mình.", "eng": "Sneer at one's supposed inferiors."}, {"viet": "Các nhà công tác xã hội đi thăm những người ốm mới ra viện.", "eng": "Social workers visiting people just out of hospital."}, {"viet": "Khoảng một trăm người tham dự buổi họp.", "eng": "Some hundred people attended the meeting."}, {"viet": "Một số người cho rằng phục vụ trong quân đội tạo ra cho người ta có chí khí.", "eng": "Some people think military service is character-building."}, {"viet": "Có ai đập cửa ầm ầm.", "eng": "Someone was thundering at the door."}, {"viet": "Những con chim sẻ hót líu lo trên các nóc nhà.", "eng": "Sparrows twittering in the roof-tops."}, {"viet": "Đứng kiễng chân lên để nhìn qua đám đông.", "eng": "Stand on tiptoe to see over the crowd."}, {"viet": "Đừng có giở trò ngốc nghếch nữa và trả lại đôi giầy cho tao.", "eng": "Stop arsing about and give me back my shoes."}, {"viet": "Quả quyết đi bộ tới những ngọn đồi ở đằng xa.", "eng": "Strike out on foot for the distant hills."}, {"viet": "Những sắc lệnh như vậy không phải là luật lệ và nên huỷ bỏ.", "eng": "Such decrees are not law and should be rescinded."}, {"viet": "Giả sử anh có một triệu pao, anh sẽ tiêu như thế nào?", "eng": "Suppose you had a million pounds-how would you spend it?"}, {"viet": "Liếc qua đứa bé đang ngủ trong nôi.", "eng": "Take a peep at the baby asleep in her cot."}, {"viet": "Mọi khoản thu nhập trên 2.000 bảng Anh đều phải chịu thuế.", "eng": "Tax is payable on all income over £ 2,000."}, {"viet": "Một mạch mười ván thắng liền.", "eng": "Ten straight wins in a row."}, {"viet": "Đây là một giai đoạn trong cuộc đời tôi mà tôi đã phần nào quên đi!", "eng": "That's an episode in my life I'd rather forget!"}, {"viet": "Thằng bé ấy thật là một kẻ quấy rầy, nó cứ bấm chuông ở cửa rồi bỏ chạy!", "eng": "That child is an absolute pest-he keeps ringing the doorbell and then running away!"}, {"viet": "Đó là điều cốt lõi của toàn bộ cuộc tranh luận.", "eng": "That is the pivot of the whole argument."}, {"viet": "Vụ rơi máy bay đó là một chuyện khủng khiếp.", "eng": "That plane crash was an awful business."}, {"viet": "Tổng số tiền đó không có đáng gì.", "eng": "That sum of money is nothing to sneeze at."}, {"viet": "Khả năng bơi là điều kiện tiên quyết để đi biển.", "eng": "The ability to swim is a prerequisite for learning to sail."}, {"viet": "Người diễn viên đó cần được nhắc tuồng thường xuyên.", "eng": "The actor needed to be prompted frequently."}, {"viet": "Mối liên minh đó đã được tôi luyện trong thử thách của chiến tranh.", "eng": "The alliance had been forged in the crucible of war."}, {"viet": "Việc tôn sùng một Hoàng đế La Mã.", "eng": "The apotheosis of a Roman Emperor."}, {"viet": "Mũi tên đó chỉ sai hướng.", "eng": "The arrow is pointing the wrong way."}, {"viet": "Chuyến đi thi đấu sắp tới ở England của đội cricket Úc.", "eng": "The Australian cricket team's forthcoming tour of England."}, {"viet": "Ngày xưa khốn khổ khi cảnh sát không cho rằng bạo hành trong gia đình là một tội ác.", "eng": "The bad old days when the police didn't think that domestic violence counted as a crime."}, {"viet": "Gỗ trần này phải được chà cho nhẵn.", "eng": "The bare wood must be sanded down."}, {"viet": "Tiếng chuông ngân vang trên đồng quê.", "eng": "The bells pealed out over the countryside."}, {"viet": "Tổ sáo có bốn quả trứng.", "eng": "The blackbird's nest contained four eggs."}, {"viet": "Nhược điểm của cuốn sách là tác giả không có khả năng duy trì được một luận điểm.", "eng": "The book's weakness is the author's inability to sustain an argument."}, {"viet": "Đường biên giới giữa Thụy Điển và Na Uy.", "eng": "The boundary between Sweden and Norway."}, {"viet": "Nghỉ ngơi sẽ làm bạn khỏe lên đấy.", "eng": "The break will do you good."}, {"viet": "Thuế má đè nặng trên người nộp thuế.", "eng": "The burden of heavy taxation on the tax-payer."}, {"viet": "Con chim hoàng yến đang hót líu lo trong lồng.", "eng": "The canary was trilling away in its cage."}, {"viet": "Chiếc xe ôtô suýt nữa đã đâm vào tôi.", "eng": "The car missed me by inches."}, {"viet": "Vụ kiện sẽ được xử ở toà tuần tới.", "eng": "The case will be heard in court next week."}, {"viet": "Ông chủ tịch nói tỉ mỉ trong hai tiếng đồng hồ về các kế hoạch của ông đối với công ty.", "eng": "The chairman expatriated for two hours on his plan for the company."}, {"viet": "Đứa trẻ ngạc nhiên há hốc miệng thành hình chữ O lớn.", "eng": "The child's mouth formed a big O in surprise."}, {"viet": "Em bé chạy theo lon ton cạnh bố mẹ.", "eng": "The child was trotting along beside its parents."}, {"viet": "Bọn trẻ con chơi cùng nhau trên đường phố.", "eng": "The children played together in the street."}, {"viet": "Ban hợp xướng biểu diễn loạc choạc.", "eng": "The choir gave a ragged performance."}, {"viet": "Nhân viên khách sạn đó nhấc ống nghe lên.", "eng": "The clerk picks up the receiver."}, {"viet": "Những tách cà phê đó được bày trên chiếc bàn cổ nhỏ dành riêng.", "eng": "The coffee cups were placed on an antique occasional table."}, {"viet": "Ủy ban đã quyết định sa thải ông ta.", "eng": "The committee has decided to dismiss him."}, {"viet": "Công ty đang cố gắng xua tan những tin đồn về một sự bán công ty.", "eng": "The company is trying to dispel rumours about a take-over."}, {"viet": "Sự tận tâm hoàn thành các nhiệm vụ.", "eng": "The conscientious discharge of one's duties."}, {"viet": "Năm ngoái giá sinh hoạt tăng 5% vì thế chúng tôi yêu cầu tăng lương 7%.", "eng": "The cost of living has gone up 5% last year, so we asked for a wage increase of 7%."}, {"viet": "Đôi vợ chồng mà chúng tôi đã gặp vào kỳ nghỉ mát đã gởi thiếp cho chúng ta.", "eng": "The couple who we met on holiday have sent us a card."}, {"viet": "Các nhà phê bình đã ca ngợi nhiệt liệt vở kịch đó.", "eng": "The critics praised the play sky-high."}, {"viet": "Khi chúng tôi xuống tới con sông, dòng chảy càng mạnh hơn.", "eng": "The current strengthened as we moved down the river."}, {"viet": "Ngày bắt đầu dài ra từ tháng Ba.", "eng": "The days start to length in March."}, {"viet": "Cuộc biểu tình đã được sắp đặt cẩn thận để thu hút sự chú ý tối đa của công chúng.", "eng": "The demonstration was carefully orchestrated to attract maximum publicity."}, {"viet": "Quyển từ điển đó đang được in lại với những sửa chữa nhỏ.", "eng": "The dictionary is reprinting with minor corrections."}, {"viet": "Người tài xế đã chết vì những thương tích của mình.", "eng": "The diver has succumbed to his injuries."}, {"viet": "Các bác sĩ không nghĩ là ông ta sẽ còn sống được qua đêm.", "eng": "The doctors don't think he will live through the night."}, {"viet": "Những con chó có thể đánh hơi tìm thấy ma túy.", "eng": "The dogs can find drugs by smell."}, {"viet": "Họ lái xe rất nhanh quanh khúc ngoặt bên trái.", "eng": "The drove too fast round the left-hand bend."}, {"viet": "Con lươn quẫy khỏi tay tôi.", "eng": "The eel wriggled out of my fingers."}, {"viet": "Chiếc nhẫn đính hôn mà cô ta đeo trông có vẻ đắt tiền.", "eng": "The engagement ring she got looks expensive."}, {"viet": "Cuộc biểu diễn tối sẽ bắt đầu lúc tám giờ.", "eng": "The evening performance will commence at eight o'clock."}, {"viet": "Vụ nổ đó làm đổ nhào cái ống khói cũ.", "eng": "The explosion toppled the old chimney."}, {"viet": "Những người hâm mộ như một đám đông náo loạn xông vào sân bóng.", "eng": "The fans rushed onto the pitch in an excited mob."}, {"viet": "Các máy bay chiến đấu nhanh chóng rút ra ( khỏi trận chiến ).", "eng": "The fighter planes quickly disengaged ( from the combat )."}, {"viet": "Các dấu tay giống y hệt những dấy tay lưu trong hồ sơ.", "eng": "The fingerprints checked with the ones on file."}, {"viet": "Theo như người ta biết thì những cuốn sách đầu tiên được làm ra ở ai cập cách đây hơn 5000 năm.", "eng": "The first books, as far as anyone knows, were made in Egypt more than 5,000 years ago."}, {"viet": "Đường bay của các máy bay đan chéo nhau gây hậu quả chết người.", "eng": "The flight paths of the aeroplanes crossed, with fatal results."}, {"viet": "Mẫu in sẵn nêu ra Bạn độc thân, đã kết hôn, ly dị, ly thân?", "eng": "The form read Are you single, married, divorced, separated?"}, {"viet": "Đoàn người đưa tang đi quanh qua các phố.", "eng": "The funeral wounded its may through the streets."}, {"viet": "Viên tướng cổ vũ binh lính của mình chiến đấu dũng cảm.", "eng": "The general exhorted his men to fight bravely."}, {"viet": "Mặt đường đua ở Newmarket hôm nay phẳng phiu.", "eng": "The going at Newmarket is soft today."}, {"viet": "Sau chiến tranh chính phủ dành ưu tiên cho nhà ở.", "eng": "The government gave priority to housing after the war."}, {"viet": "Chính phủ phái một đội vũ trang hộ tống vị nguyên thủ quốc gia đến thăm.", "eng": "The government provided an armed escort for the visiting head of State."}, {"viet": "Vùng đồng bằng rộng lớn miền Trung Tây nước Mỹ.", "eng": "The great plains of the American Midwest."}, {"viet": "Người khách trọ muốn uống nước khoáng và một ít đá cục.", "eng": "The guest wants some mineral water and some ice cubes."}, {"viet": "Bà hiệu trưởng muốn đến sớm để nêu gương tốt cho các giáo viên khác.", "eng": "The headmistress likes to arrive early at school to set the other teachers an example."}, {"viet": "Nhà sử học đó khám phá quá khứ bằng việc sử dụng đúng đắn một phương pháp suy đoán tới mức được coi là loại lý tưởng.", "eng": "The historian discovers the past by the judicious use of such a heuristic device as the ideal type."}, {"viet": "Khách sạn bị tai tiếng sau vụ bắn nhau.", "eng": "The hotel fell into disrepute after the shooting incident."}, {"viet": "Qua một đêm ngôi nhà đã bị cháy ra tro.", "eng": "The house was burnt to ashes overnight."}, {"viet": "Hình ảnh khuôn mặt đứa con bị chết in sâu vào trí nhớ tôi rất lâu.", "eng": "The image of the dead child's face stuck in my mind for ages."}, {"viet": "Cầu thủ bóng đá bị thương khập khiễng lê chân ra khỏi sân bóng.", "eng": "The injured footballer limped slowly off the field."}, {"viet": "Lễ nhậm chức Hoàng tử xứ Gan.", "eng": "The investiture of the prince of Wales."}, {"viet": "Ngài thẩm phán đã không báo riêng cho ban bồi thẩm biết là họ có được phép đưa ra một phán quyết theo đa số không.", "eng": "The judge has not intimated to the jury whether they will be allowed to reach a majority verdict."}, {"viet": "Nhà vua bị chém đầu ở bên ngoài cung điện của mình.", "eng": "The King was beheaded outside his own palace."}, {"viet": "Điều cuối cùng tôi muốn biết là vé khứ hồi.", "eng": "The last thing I'd like to know is the return ticket."}, {"viet": "Bài giảng ấy cao hơn sự hiểu biết của tôi.", "eng": "The lecture went away above my head."}, {"viet": "Ánh sáng được sắp đặt một cách khéo léo để làm tôn mặt của mọi người.", "eng": "The lightning was artfully arranged to flatter people's faces."}, {"viet": "Chiếc xe tải dúm lại khi nó đâm phải bức tường.", "eng": "The lorry concertinaed when it hit the wall."}, {"viet": "Quang cảnh huy hoàng của lễ cưới nhà vua.", "eng": "The magnificent mise-en-scène of the Royal Wedding."}, {"viet": "Các nhà sản xuất từ chối mọi trách nhiệm về hư hại do sử dụng sai.", "eng": "The manufacturers disclaim all responsibility for damage caused by misuse."}, {"viet": "Thịt này nấu lâu chín, loại táo này nấu ngon.", "eng": "The meat cooks slowly, these apples cook well."}, {"viet": "Thông điệp ấy như sau: Veni, vidi, vici.", "eng": "The message was, Veni, vidi, vici."}, {"viet": "Đứa trẻ thất lạc được tìm thấy an toàn và khỏe mạnh.", "eng": "The missing child was found safe and well."}, {"viet": "Món nợ thế chấp là một sự tiêu hao các nguồn tài chính của chúng ta.", "eng": "The mortgage is a drain on our financial resources."}, {"viet": "Tên sát nhân lúc này đã yên ổn trong tù.", "eng": "The murderer is now safely behind bars."}, {"viet": "Bên hàng xóm có tiệc tùng và chúng tôi suốt đêm qua đã không chợp mắt được tí nào.", "eng": "The neighbours were having a party and we didn't get a wink of sleep all night."}, {"viet": "Vị giám đốc mới được giao nhiệm vụ tổ chức lại ban ngành.", "eng": "The new manager was delegated to reorganize the department."}, {"viet": "Tin ấy làm cho tôi giật nảy người.", "eng": "The news gave me quite a start."}, {"viet": "Tiếng ồn của xe nhỏ dần ở đằng xa.", "eng": "The noise of the car died away in the distance."}, {"viet": "Cô y tá lao vào tặc lưỡi bực bội.", "eng": "The nurse rushed in, tutting with irritation."}, {"viet": "Cái kho thóc cũ chúng tôi mua để sửa thành các căn hộ thật ra đã sụp đổ rồi.", "eng": "The old barn we bought to convert into flats was practically tumbling down."}, {"viet": "Người đang ăn món taco đấy.", "eng": "The one who is eating the taco."}, {"viet": "Kết quả trận đấu đó vẫn chưa chắc chắn.", "eng": "The outcome of the match is still undecided."}, {"viet": "Bố mẹ gặp nhiều khó khăn để kiểm soát thằng con trai cứng đầu cứng cổ của họ.", "eng": "The parents had much difficulty, controlling their wayward son."}, {"viet": "Bệnh nhân phải được đưa nhanh đến nhà thương.", "eng": "The patient had to be raced to hospital."}, {"viet": "Sự phối hợp hoàn hảo giữa tay và mắt.", "eng": "The perfect co-ordination of hand and eye."}, {"viet": "Bức tranh miêu tả một người đàn bà khoả thân nằm nghỉ trên chiếc tràng kỷ.", "eng": "The picture shows a nude reposing on a couch."}, {"viet": "Máy bay nghiêng cánh lượn hẳn về bên trái.", "eng": "The plane banked steeply to the left."}, {"viet": "Vở kịch viết hay nhưng diễn xuất không hay.", "eng": "The play is well written but it is not good theatre."}, {"viet": "Cảnh sát thực sự ngăn chặn những người lái xe say rượu.", "eng": "The police are really clamping down on drunk driver."}, {"viet": "Cảnh sát tiến về phía ngôi nhà do bọn khủng bố chiếm giữ.", "eng": "The police moved in on the house occupied by the terrorists."}, {"viet": "Những lời chào lễ phép của người cận thần.", "eng": "The polite salutations of the courtier."}, {"viet": "Các củ khoai tây đã tới thời kỳ đào lên.", "eng": "The potatoes are ready to be dug up."}, {"viet": "Tổng thống rốt cuộc cũng phải tiết lộ cho công chúng biết vụ tai tiếng đó.", "eng": "The president finally had to go public with the scandal."}, {"viet": "Giá cả những hàng hoá này đều đã được ghi rõ.", "eng": "The prices of these goods are an clearly marked on them."}, {"viet": "Tên tù bị cùm chân lại.", "eng": "The prisoner was kept in fetters."}, {"viet": "Dự án đó đang gặp phải những khó khăn về tài chính.", "eng": "The project is running into financial difficulties."}, {"viet": "Nhà xuất bản đã in cuốn sách đó thành mười ngàn bản.", "eng": "The publisher has printed 10,000 copies of the book."}, {"viet": "Câu hỏi về tuổi của cô ấy rất hỗn xược.", "eng": "The question about her age was very impertinent."}, {"viet": "Tiếng kêu quác quác của quạ.", "eng": "The raucous cries of the crows."}, {"viet": "Dân chúng nhanh chóng di tản khỏi vùng gần núi lửa đang hoạt động.", "eng": "The region near the erupting volcano was evacuated rapidly."}, {"viet": "Nhà hàng được lợi vì ở gần nhiều rạp chiếu bóng.", "eng": "The restaurant benefits from its proximity to several cinemas."}, {"viet": "Chiếc nhẫn có viên hồng ngọc đính lên một cái đế bằng bạc.", "eng": "The ring has a ruby in a silver setting."}, {"viet": "Những con đường đó đầy bùn ướt trơn trượt.", "eng": "The roads were slick with wet mud."}, {"viet": "Những biểu tượng của vương vị gồm vương miện, quyền trượng và quả cầu.", "eng": "The royal regalia include the crown, sceptre, and orb."}, {"viet": "Người bán hàng phụ trách phần phía bắc của đất nước.", "eng": "The salesman covering the northern part of the country."}, {"viet": "Nhà trường nhận học sinh sống trong phạm vi mười cây số.", "eng": "The school takes pupils living within a radius of ten kilometres."}, {"viet": "Rõ ràng là thượng nghị sĩ bị lúng túng trước câu hỏi.", "eng": "The senator was clearly blindsided by the question."}, {"viet": "Nơi nương náu cho khỏi bị thời tiết khắc nghiệt.", "eng": "The shelter was proof against bitter weather."}, {"viet": "Số lượng bán của cửa hàng cao hơn bao giờ hết trong năm nay.", "eng": "The shop's sales have reached an all-time high this year."}, {"viet": "Những bóng cây trên nền trời chiều.", "eng": "The silhouettes of the tree against the evening sky."}, {"viet": "Mùi nấu nướng toả ra khắp căn phòng.", "eng": "The smell of cooking permeates the flat."}, {"viet": "Những người lính tạm trú ở nhà một bà già.", "eng": "The soldiers were billeted on an old lady."}, {"viet": "Thật ra diễn giả nói chẳng có gì đáng nghe.", "eng": "The speaker said almost nothing worth listening to."}, {"viet": "Ngân hàng nông nghiệp mở rộng thêm nhiều chi nhánh ra khắp nước.", "eng": "The state bank of agricultural is ramified over the country."}, {"viet": "Câu chuyện về những nỗi đau khổ của họ làm chúng tôi hết sức xúc động.", "eng": "The story of their sufferings moved us deeply."}, {"viet": "Chiếc tàu ngầm lặn xuống nước để tránh tàu địch.", "eng": "The submarine submerged to avoid enemy ships."}, {"viet": "Sự lắc lư của chiếc phà làm ông ta nôn nao.", "eng": "The sway of the ferry made him feel sick."}, {"viet": "Thầy giáo ra lệnh cho nó dốc hết túi ra.", "eng": "The teacher ordered him to turn out his pockets."}, {"viet": "Một ngôi đền nhiều lần ở trong tình trạng cần sửa chữa và đã được xây dựng lại.", "eng": "The temple has many times fallen into disrepair and been rebuilt."}, {"viet": "Những thứ tôi đã thu thập được trong bốn năm qua.", "eng": "The things I had accumulated over the last four years."}, {"viet": "Tổng chi phí lên tới 500 pao.", "eng": "The total cost comes out at 500 pounds."}, {"viet": "Người lang thang mang vật dụng của mình trong một cái gói đeo trên lưng.", "eng": "The tramp carried his belongings in a pack on his back."}, {"viet": "Máy vô tuyến ầm ĩ ở phía sau.", "eng": "The TV set was blaring in the background."}, {"viet": "Hai làng cách nhau một dặm đường, và nhà tôi nằm giữa hai làng.", "eng": "The two villages are a mile apart and my house lies midway between them."}, {"viet": "Việc sử dụng chất kích thích đang mang lại tiếng xấu cho thể thao.", "eng": "The use of drugs is bringing the sport into disrepute."}, {"viet": "Dân làng dẫn đường và cho những người sơ tán từ thành phố bị ném bom ở nhờ.", "eng": "The villagers led and housed the evacuees from the blitzed city."}, {"viet": "Ống dẫn nước bị tắc, hãy cố dội cho nó thông bằng nước nóng.", "eng": "The water pipe is blocked, try flushing it out with hot water."}, {"viet": "Chưa đầy một tiếng đồng hồ cả ngôi nhà đã biến thành tro bụi.", "eng": "The whole house went up in smoke in less than an hour."}, {"viet": "Việc rút bỏ tiếp tế, sự hỗ trợ, rút quân.", "eng": "The withdrawal of supplies, support, troops."}, {"viet": "Hệ thống kinh tế thế giới bóc lột những nước đang phát triển.", "eng": "The world economic system exploits the developing countries."}, {"viet": "Cách ứng xử của họ đối với tôi chứng tỏ họ không ưa tôi.", "eng": "Their behaviour towards me shows that they do not like me."}, {"viet": "Những động cơ của họ chẳng bao lâu sẽ trở nên rõ ràng là hoàn toàn ích kỷ.", "eng": "Their motives, as will soon become apparent, are completely selfish."}, {"viet": "Vậy thì tôi muốn có một giường nằm.", "eng": "Then I'd like a berth."}, {"viet": "Phải khéo tay mới khoá được cái cửa này, mà phải mất một lúc mới thành thạo được.", "eng": "There's a knack to locking this door which takes a while to master."}, {"viet": "Vào thời điểm này trong năm, không có nhu cầu về áo choàng.", "eng": "There's no market for coats at this time of year."}, {"viet": "Nói quá nhiều mà làm thì chẳng được bao nhiêu.", "eng": "There's too much talk and not enough work being done."}, {"viet": "Có những người Mỹ bản địa ở bang Maryland đấy.", "eng": "There are Native Americans in Maryland."}, {"viet": "Trong gia đình có hai người kiếm ra tiền.", "eng": "There are two wage-earners in the family."}, {"viet": "Có nguy cơ là chương trình nhà ở đang xẹp đi.", "eng": "There is a danger of the housing programme running out of steam."}, {"viet": "Từ việc làm đến kết quả còn lắm gian nan.", "eng": "There is many a slip twixt the cup and the lip."}, {"viet": "Không còn nhiều chỗ dành cho hành lý của ông.", "eng": "There isn't much space left for your luggage."}, {"viet": "Trong câu trả lời của ông ta thoáng có chút ác ý.", "eng": "There was a smack of malice in her reply."}, {"viet": "Có đủ loại màu để chọn.", "eng": "There were all sorts of colours to choose from."}, {"viet": "Đây là những vấn đề bạn có thể nêu ra ở uỷ ban.", "eng": "These are matters that you can bring up in committee."}, {"viet": "Những người hang động về sau cao lớn và khỏe mạnh.", "eng": "These later cave men were tall and strong."}, {"viet": "Hai cái bút này của tôi nhưng bạn có thể lấy tất cả những cái còn lại.", "eng": "These two pens are mine but you can have all the others."}, {"viet": "Họ đã đi chơi bằng ô tô.", "eng": "They've gone out for a ride in the car."}, {"viet": "Chúng giống một hình bầu dục dài.", "eng": "They are like a long oval."}, {"viet": "Họ dựng một chỗ ẩn náu thô sơ bằng những thân cây.", "eng": "They built a primitive shelter out of tree trunks."}, {"viet": "Họ quyết định chấm dứt quan hệ.", "eng": "They decided to end their relationship."}, {"viet": "Họ cảm thấy đất rung lên khi quả bom nổ.", "eng": "They felt the ground quake as the bomb exploded."}, {"viet": "Họ là bạn của nhau từ hồi cấp 3.", "eng": "They have been buddies since high school."}, {"viet": "Họ để mặc cho những con đường nổi tiếng dẫn đến Rô-ma trở nên điêu tàn.", "eng": "They let the famous roads that led to Rome fall into decay."}, {"viet": "Họ đề nghị trả tôi 1000 đô la về quyển sách ấy.", "eng": "They offer me 1000 dollars for the book."}, {"viet": "Họ nhận được 4000 đô la của một người tặng giấu tên.", "eng": "They received $ 4000 from an anonymous donor."}, {"viet": "Họ đã thủ tất cả thức ăn ở bữa tiệc trước khi chúng tôi đến đó.", "eng": "They snaffled all the food at the party before we got there."}, {"viet": "Họ đi theo tốc độ 5 km/giờ.", "eng": "They walk at the rate of 5 kilometers an hour."}, {"viet": "Họ đang ăn sáng thì tôi đến.", "eng": "They were having breakfast when I arrived."}, {"viet": "Họ làm việc để thúc đẩy hoà bình thế giới.", "eng": "They worked for the promotion of world peace."}, {"viet": "Cuốn sách này là một kho thông tin bổ ích.", "eng": "This book is a storehouse of useful information."}, {"viet": "Tiền án tiền sự của anh ta làm anh ta không đủ tư cách để đảm nhiệm công việc đó.", "eng": "This criminal record disqualified him for the job."}, {"viet": "Nhà soạn nhạc vĩ đại này sống cách đây hơn 200 năm.", "eng": "This great composer lived more than 200 years ago."}, {"viet": "Đây không phải là kiểu đối xử tôi thường quen.", "eng": "This is not the kind of treatment I am accustomed to."}, {"viet": "Bức thư này gửi tới ông giám đốc.", "eng": "This letter is for the attention of the manager."}, {"viet": "Bức tranh này có một sự hài hoà dễ chịu giữa hình khối và màu sắc.", "eng": "This painting has a pleasing balance of shapes and colours."}, {"viet": "Căn phòng này dường như ngột ngạt-hãy mở cửa sổ ra.", "eng": "This room seems stuffy-open the window."}, {"viet": "Vé này để cho hai người vào xem bóng đá.", "eng": "This ticket admits two people to the football match."}, {"viet": "Những kẻ gọi là bạn của cô ta là những người có ảnh hưởng xấu đối với cô ta.", "eng": "Those so-called friends of hers are a bad influence on her."}, {"viet": "Ngày hôm nay sẽ được chào đón như bước khởi đầu của một kỷ nguyên mới.", "eng": "Today should be saluted as the beginning of a new era."}, {"viet": "Cách đây 25 thế kỷ, cuộc sống ở Trung Quốc rất khó khăn.", "eng": "Twenty five hundred years ago life in China was very hard."}, {"viet": "Sự tăng lương đã làm dịu bớt hậu quá của giá cả ngày càng cao.", "eng": "Wage increases have cushion us from the effects of higher and higher prices."}, {"viet": "Sau đó chúng tôi muốn uống cà phê.", "eng": "We'd like to have some coffee afterwards."}, {"viet": "Chúng tôi đã thuê trước người làm trò ảo thuật cho buổi liên hoan đêm Noel.", "eng": "We're booked a conjuror for our Christmas party."}, {"viet": "Chúng tôi vẫn còn đang tiến hành việc dọn nhà.", "eng": "We're still in the process of moving house."}, {"viet": "Chúng ta đã lỡ tàu, nhưng đừng lo, mười phút nữa có một chuyến khác.", "eng": "We've missed the train, but not to worry, there's another one in ten minutes."}, {"viet": "Chúng tôi đang nhằm làm giảm 20% ảnh hưởng.", "eng": "We are aiming for a 20% reduction across the board."}, {"viet": "Chúng tôi đang làm việc cùng với cảnh sát.", "eng": "We are working in conjunction with the police."}, {"viet": "Chúng ta có thể bắt đầu ở và tiếp đến boong trên.", "eng": "We can begin here and move on to the upper deck."}, {"viet": "Chúng tôi nghe thấy tiếng chân thình thịch của nó trên gác.", "eng": "We could hear him tramping about upstairs."}, {"viet": "Chúng tôi không muốn bất cứ thằng cha căng chú kiết nào sử dụng quán giải khát của câu lạc bộ.", "eng": "We don't want any ( old ) Tom, Dick and Harry using the club bar."}, {"viet": "Thỉnh thoảng chúng tôi đi xem kịch.", "eng": "We go to the theatre from time to time."}, {"viet": "Chúng tôi phải viết ba bài tiểu luận trong kỳ thi môn lịch sử.", "eng": "We had to write three essays in the history exam."}, {"viet": "Chúng tôi có bằng chứng chắc chắn rằng anh ta có tội.", "eng": "We have positive proof that he is guilty."}, {"viet": "Chúng ta chỉ cứ tiếp tục làm thế thôi mà không bao giờ đạt được một tiến bộ nào hết.", "eng": "We just seem to muddle along but never make any real progress."}, {"viet": "Chúng tôi đã tìm cách cắt đuôi được những người theo dõi.", "eng": "We managed to give our pursuers the slip."}, {"viet": "Chúng ta phải lắp một ổ khoá mới vào cửa trước.", "eng": "We must put a new lock on the front door."}, {"viet": "Chúng ta khôn hơn họ và đã tới đó đầu tiên bằng cách đi đường tắt.", "eng": "We outsmarted them and got there first by taking a shorter route."}, {"viet": "Chúng tôi xem phim và sau đó cùng đi bộ về.", "eng": "We saw the film and afterwards walked home together."}, {"viet": "Chúng tôi ở nhà vì thời tiết xấu.", "eng": "We stayed at home on account of the bad weather."}, {"viet": "Chúng tôi đi lòng vòng hàng tiếng đồng hồ tìm ngôi nhà.", "eng": "We wandered around for hours looking for the house."}, {"viet": "Chúng tôi gặp tình cảnh khó khăn khi chúng tôi mất tiền.", "eng": "We were in dire straits when we lost our money."}, {"viet": "Chúng tôi làm việc cùng nhau nhưng cô ấy cũng là một người bạn riêng.", "eng": "We work together, but she is also a personal friend."}, {"viet": "À, tôi đã mua nó 10 đô la.", "eng": "Well, I bought it for ten dollars."}, {"viet": "Nào nào, có phải là Helen đó không.", "eng": "Well, well, if it isn't Helen."}, {"viet": "Anh làm nghề gì?''Tôi là nghệ sĩ múa'.", "eng": "What's your occupation?''I'm a dancer'."}, {"viet": "Tuần này quý vị chiếu phim gì?", "eng": "What are you showing this week?"}, {"viet": "Bà nghĩ nó phải theo học môn gì?", "eng": "What do you think he ought to take up?"}, {"viet": "Cái đúng cho trường hợp này thì cũng đúng cho trường hợp hệt như vậy.", "eng": "What is sauce for the goose is sauce for the gander."}, {"viet": "Môn thể thao quốc gia của nước bạn là môn gì?", "eng": "What is your home country's national sport?"}, {"viet": "Bạn tôn trọng những phẩm chất nào của con người?", "eng": "What qualities do you respect in people?"}, {"viet": "Mục đích của ông trong việc mua toàn bộ các cổ phiếu rẻ là gì?", "eng": "What was his angle in buying up cheap stocks?"}, {"viet": "Khi nào khách sạn cung cấp nước nóng?", "eng": "When do you provide hot water?"}, {"viet": "Khi tôi cố nâng chiếc bình lên, quai bình rời ra ( trong tay tôi ).", "eng": "When I tried to lift the jug, the handle came off ( in my hand )."}, {"viet": "Khi kim phút chỉ mười hai và kim giờ chỉ ba thì đó là ba giờ.", "eng": "When the minute hand points to twelve and the hour hand point to three, it's three o'clock."}, {"viet": "Khi nào bạn rảnh, vui lòng đến thăm tôi nhé?", "eng": "When you are free, can you come and see me?"}, {"viet": "Ở nơi thức ăn khó kiếm, ít có chim muông ở lại suốt năm.", "eng": "Where food is hard to find, few birds remain throughout the year."}, {"viet": "Điều gì thì quan trọng hơn đối với bạn, tiền bạc hay sự hài lòng về công việc?", "eng": "Which is more important to you, money or job satisfaction?"}, {"viet": "Ai đã nghĩ là công việc có thể đến thế?", "eng": "Who'd have thought things would come to this?"}, {"viet": "Ai là người thầu xa lộ mới?", "eng": "Who were the contractors on the new motorway?"}, {"viet": "Tại sao bà không nhuộm tóc màu nâu nhỉ?", "eng": "Why don't you dye your hair brown?"}, {"viet": "Nếu chuông điện thoại reo, anh có trả lời không?", "eng": "Will you answer the telephone if it rings?"}, {"viet": "Mùa đông làm nảy sinh những khó khăn đặc biệt cho người già.", "eng": "Winter poses particular difficulties for the elderly."}, {"viet": "Chức năng sinh học của phụ nữ là đẻ con.", "eng": "Woman's biological function as a bearer of children."}, {"viet": "Xin quý vị vui lòng đi cùng với tôi?", "eng": "Would you come with me, please?"}, {"viet": "Ông có muốn nói chuyện với người nào khác không?", "eng": "Would you like to speak with someone else?"}, {"viet": "Viết một cuốn tiểu thuyết dưới bút danh Colin Kettle.", "eng": "Write a novel under the pseudonym of Colin Kettle."}, {"viet": "Rồi, tôi đã ký tất cả chúng ngay tại chỗ ở văn phòng Montreal ngay khi tôi mua chúng.", "eng": "Yes, I signed all of them in Montreal Office on the spot as soon as they were purchased."}, {"viet": "Tốt nhất là anh nên gạt ý nghĩ cưới vợ ra khỏi đầu mình đi.", "eng": "You'd better put the idea of marriage out of your head."}, {"viet": "Anh sẽ sớm quen với khí hậu ở đây thôi.", "eng": "You'll soon get used to the climate here."}, {"viet": "Anh đã đưa tôi vào một trong những đề tài tôi ưa thích.", "eng": "You've got me onto one of my favourite hobby-horses."}, {"viet": "Anh không thể kết tội anh ta chỉ dựa vào chứng cứ gián tiếp.", "eng": "You can't convict him merely on circumstantial evidence."}, {"viet": "Anh có thể bỏ bớt những chi tiết không quan trọng.", "eng": "You can cut out the unimportant details."}, {"viet": "Bạn không thể làm gì được nếu không có tiền.", "eng": "You can't do anything without money."}, {"viet": "Hầu như không bao giờ bạn đến đây sau 9: 30 ít phút.", "eng": "You hardly ever get here until few minutes after nine thirty."}, {"viet": "Anh biết Lisa thế nào rồi đó, Đôi khi cô ta rất ngớ ngẩn.", "eng": "You know how Lisa is, The elevator doesn't go all the way to the top sometimes."}, {"viet": "Bà phải dành ra ba mét cho một chiếc áo dài tay.", "eng": "You must allow three metres or a long sleeved dress."}, {"viet": "Cậu cần nhiều tiền để kiếm được ma tuý hàng ngày.", "eng": "You need a lot of money to score every day."}, {"viet": "Cần phải mở rộng kinh nghiệm của mình bằng đi đây đó nhiều hơn.", "eng": "You should broaden your experience by travelling more."}, {"viet": "Anh nên đọc cuốn sách này mà xem-buồn cười lắm.", "eng": "You simply must read this book-it's so funny."}, {"viet": "Anh cần phải cho chạy bơm mạnh trong nhiều phút mới đầy được cái bồn chứa.", "eng": "You will need to pump hard for several minutes to fill the tank."}, {"viet": "Con gái anh chẳng giống anh tí nào.", "eng": "Your daughter doesn't take after you at all."}, {"viet": "Câu chuyện của anh chỉ gần đúng với sự thật thôi.", "eng": "Your story only approximates to the real facts."}]