[{"viet": "Một quyển sách dài như quyển Chiến tranh và Hòa bình.", "eng": "A book the length of War and Peace."}, {"viet": "Đứa trẻ có tính ngỗ nghịch.", "eng": "A child with a rebellious temperament."}, {"viet": "Một băng tải liên tục cung cấp những bộ phận cho máy.", "eng": "A continuous belt feeds components into the machine."}, {"viet": "Sự chia rẽ sâu sắc trong nội bộ đảng cầm quyền.", "eng": "A deep cleavage within the ruling party."}, {"viet": "Một chiếc áo đầm không ra hình dạng gì cả.", "eng": "A dress that hasn't go much shape."}, {"viet": "Một cuốn phim do một nữ diễn viên mới người Pháp đóng vai chính.", "eng": "A film that features a new French actress."}, {"viet": "Một kẻ hà tiện hào hiệp là lời mâu thuẫn.", "eng": "A generous miser is a contradiction in terms."}, {"viet": "Đám thiếu niên đang đá bóng ngoài đường phố.", "eng": "A group of boys were playing football in the street."}, {"viet": "Không có ong chúa thì không có tổ ong.", "eng": "A hive cannot exist without a queen."}, {"viet": "Một con dao đã cùn qua nhiều năm sử dụng.", "eng": "A knife blunted by years of use."}, {"viet": "Một bữa ăn trưa nhẹ là đủ cho tôi rồi.", "eng": "A light lunch should suffice me."}, {"viet": "Một toàn cảnh huy hoàng của những đỉnh núi và hồ.", "eng": "A magnificent prospect of mountain peaks and lakes."}, {"viet": "Một quốc vụ khanh tài chánh.", "eng": "A minister of state for finance."}, {"viet": "Một đường nhánh mới cho xa lộ.", "eng": "A new feeder road for the motorway."}, {"viet": "Một đôi thiên nga làm tổ bên bờ sông.", "eng": "A pair of swans nesting by the river."}, {"viet": "Một khúc nhạc của piano được cải biên cho ghi-ta.", "eng": "A piano piece transcribed for the guitar."}, {"viet": "Một lời tái bút được thêm vào cuối.", "eng": "A postscript tagged on at the end."}, {"viet": "Một báo cáo nghiên cứu kém cỏi.", "eng": "A quick-and-dirty research report."}, {"viet": "Một khúc rẽ vuông góc trên con đường đó.", "eng": "A right-angled bend in the road."}, {"viet": "Một khu vườn tách biệt sau những bức tường cao.", "eng": "A secluded garden behind high walls."}, {"viet": "Một tấm lắc đơn sơ ghi dấu nơi người tuẫn giáo chết.", "eng": "A simple plaque marks the spot where the martyr died."}, {"viet": "Một chút ác ý trong lời nhận xét của anh ta.", "eng": "A soupcon of malice in his remark."}, {"viet": "Một chỗ gãy ống xương chân do bị đè.", "eng": "A stress fracture of a bone in the lag."}, {"viet": "Một bức telex vừa từ Hong Kong gởi đến.", "eng": "A telex has just arrived from Hong Kong."}, {"viet": "Một tình trạng mập mờ trong việc giải thích Hiến pháp.", "eng": "A twilight area in the interpretation of the Constitution."}, {"viet": "Một bánh xe quay tròn quanh trục của nó.", "eng": "A wheel revolves round its axis."}, {"viet": "Lạm dụng lòng tin được nơi ai.", "eng": "Abuse the confidence placed in one."}, {"viet": "Sức chịu đựng thích hợp với trọng lượng lớn của chiếc cần cẩu đó.", "eng": "Adequate support for the great weight of the crane."}, {"viet": "Sau khi đả kích chính sách kinh tế của Chính phủ, ông ấy quay sang mô tả cách thức mà Đảng Lao Động sẽ giảm bớt nạn thất nghiệp.", "eng": "After attacking the Government's economic policy, he went on to describe how the Labour Party would reduce unemployment."}, {"viet": "Sau khi phạm tội, lương tâm nàng bị cắn rứt.", "eng": "After she had committed the crime, her conscience was troubled."}, {"viet": "Các quốc gia hiếu chiến đe dọa hòa bình thế giới.", "eng": "Aggressive nations threaten world peace."}, {"viet": "Tất cả những khó khăn của tôi dường như đến cùng một lúc.", "eng": "All my troubles seem to come together."}, {"viet": "Tất cả các chú chó con đang cắn nhau nhặng xị ở trong vườn.", "eng": "All the pubs were having a rough and tumble in the garden."}, {"viet": "Luôn luôn lưỡng lự về những vấn đề quan trọng.", "eng": "Always fudged on the important questions."}, {"viet": "Một chương trình truyền hình đặc biệt suốt đêm về cuộc bầu cử đó.", "eng": "An all night television special on the election."}, {"viet": "Một hình bóng khổng lồ mờ mờ lù lù hiện ra ở đằng xa.", "eng": "An enormous shape looming up in the distance."}, {"viet": "Một tên chỉ điểm đã tố giác anh ta là kẻ khủng bố với cảnh sát.", "eng": "An informer denounced him to the police as a terrorist."}, {"viet": "Một phần không thể tách rời trong hệ thống kinh doanh của chúng tôi.", "eng": "An organic part of our business."}, {"viet": "Và chúng tôi cũng có năm mươi xu, hai mươi xu, hai xu, và một xu tất cả được phát hành ở dạng tiền giấy lẫn tiền kim loại.", "eng": "And we also have fifty-fen, twenty-fen, ten-fen, five-fen, two-fen and one-fen all issued both in notes and in coins."}, {"viet": "Mọi sự đề cập đến chính trị đều bị cấm đoán trong nhà ông ta.", "eng": "Any mention of politics is taboo in his house."}, {"viet": "Công ty ấy tài chính ổn định không?", "eng": "Are the firm's finances sound?"}, {"viet": "Anh có được bảo hiểm đầy đủ về hoả hoạn và trộm cắp hay không?", "eng": "Are you fully covered for fire and theft?"}, {"viet": "Bạn không khen cái mũ mới của tôi à?", "eng": "Aren't you going to admire my new hat?"}, {"viet": "Theo như tôi nhớ được thì anh đã đến muộn.", "eng": "As far as I recollect, you came late."}, {"viet": "Là những công nhân trong một nền công nghiệp sinh lãi, các thợ mỏ đòi hỏi được chia phần lợi nhuận lớn hơn.", "eng": "As workers in a profit making industry, miners are demanding a larger slice of the cake."}, {"viet": "Bạn có thể nhìn thấy những ngôi sao vào buổi tối.", "eng": "At night you can see the stars."}, {"viet": "Quyền hành được trao cho nhân dân.", "eng": "Authority is vested in the people."}, {"viet": "Coi chừng con chó; nó thỉnh thoảng cắn người ta đấy.", "eng": "Be careful of the dog; it sometimes bites people."}, {"viet": "Bảo đảm là mọi thứ được viết rõ ràng.", "eng": "Be sure everything is clearly written."}, {"viet": "Vì không luyện tập nên đội đó đã chơi không đều tay chút nào.", "eng": "Being out of practice the team played very erratically."}, {"viet": "Cầu xin Chúa ban phúc cho những kẻ đói, cô đơn hoặc đau ốm.", "eng": "Bless all those who are hungry, lonely or sick."}, {"viet": "Nhanh chóng chấm dứt một chuyện gì.", "eng": "Bring something to a speedy conclusion."}, {"viet": "Nhưng chúng ta có thể làm cho mọi người nhìn nhận vấn đề này một cách nghiêm túc không?", "eng": "But can we get people to take the problem seriously?"}, {"viet": "Nhưng bà không nói được một chữ tiếng Nhật.", "eng": "But she can't speak any Japanese."}, {"viet": "Bằng cách ngăn dòng nước lại, các kỹ sư đã trừ được nước của nó cho việc tưới tiêu.", "eng": "By damming the stream, the engineers impounded its waters for irrigation."}, {"viet": "Lưu ý ai về việc gì.", "eng": "Call somebody's attention to something."}, {"viet": "Cho con xem một số tin tức nhé?", "eng": "Can I watch some of the news?"}, {"viet": "Anh có thể cho tôi biết thêm những thông tin cần thiết về tình hình tài chánh của công ty đó không?", "eng": "Can you give me more background on the company's financial position?"}, {"viet": "Vui lòng cho tôi biết đường đến nhà bạn?", "eng": "Can you tell me how to get to your house?"}, {"viet": "Trả tiền mặt trước cho thẻ tín dụng.", "eng": "CASH ADVANCE MADE AGAINST CREDIT CARD."}, {"viet": "Trẻ con học nhân và chia.", "eng": "Children learning to multiply and divide."}, {"viet": "Các mục quảng cáo khéo léo chỉ là những vật cám dỗ tiêu tiền.", "eng": "Clever advertisements are just temptations to spend money."}, {"viet": "Lệnh đã được truyền bằng giọng nói chắc nịch.", "eng": "Commands given in a firm tone of voice."}, {"viet": "Gợi lên trong trí những hình ảnh hạnh phúc lứa đôi.", "eng": "Conjure up visions of married bliss."}, {"viet": "Xin bà vui lòng mua một cái áo sơ mi bằng vải bông mới rồi đưa biên lai cho chúng tôi?", "eng": "Could you buy a new cotton shirt and give us the receipt?"}, {"viet": "Anh vui lòng cho chúng tôi biết các anh phục vụ những loại món ăn Trung Quốc khác nhau nào tại nhà hàng này?", "eng": "Could you tell us what different kinds of Chinese food you serve in this restaurant?"}, {"viet": "Cyprus, như bạn biết đấy, là một hòn đảo ở Địa Trung Hải.", "eng": "Cyprus, as you know, is an island in the Mediterranean."}, {"viet": "Những mùi ngon tỏa ra từ nhà bếp.", "eng": "Delicious smells were emanating from the kitchen."}, {"viet": "Làm giảm trị giá của ai.", "eng": "Detract from a worth of something."}, {"viet": "Bạn có chơi trong đội nào của trường không?", "eng": "Did you play on any school teams?"}, {"viet": "Xuyên tạc quan điểm của ai.", "eng": "Distort somebody's point of view."}, {"viet": "Loại giày này có màu đen không?", "eng": "Do these shoes come in black?"}, {"viet": "Anh có thuận thảo với bố mẹ anh không?", "eng": "Do you get on with your parents?"}, {"viet": "Cậu có nhận phiếu khai nhận hành lý chưa?", "eng": "Do you have your baggage claim check?"}, {"viet": "Cô có thấy phiền nếu tôi mở nhạc không?", "eng": "Do you mind if I put some music on?"}, {"viet": "Bạn có nghĩ rằng việc phụ nữ đi làm đang ngày càng trở nên phổ biến hơn không?", "eng": "Do you think that being a career woman is becoming more popular?"}, {"viet": "Chứng cớ bằng văn bản về quyền sở hữu khu đất đó của ông ta.", "eng": "Documentary proof of his ownership of the land."}, {"viet": "Đừng xin việc làm đó-bạn đang gặp nguy hiểm vì với quá cao.", "eng": "Don't apply for that job-you're in danger of overreaching yourself."}, {"viet": "Đừng quên điện cho chúng tôi ngay khi anh chị đến nơi nhé.", "eng": "Don't forget to cable us as soon as you arrive."}, {"viet": "Đừng có lục bừa bãi các tập hồ sơ đó, tôi vừa sắp xếp chúng cho thứ tự đấy.", "eng": "Don't mess files around, I've just put them in order."}, {"viet": "Đừng có nghiêng cái ghế của mày nếu không mày sẽ ngã đấy!", "eng": "Don't tilt your chair or you'll fall over!"}, {"viet": "Vẽ hình biếm họa một chính trị gia.", "eng": "Draw a caricature of a politician."}, {"viet": "Mỗi ngày trôi qua mà chẳng có một tin tức gì cả.", "eng": "Each day passed without any news."}, {"viet": "Các vị trí quân địch đã bị ném bom trước khi bộ binh chúng ta tấn công.", "eng": "Enemy positions were bombarded before our infantry attacked."}, {"viet": "Ngay cả các món tôi mới đề cập cũng không cay lắm.", "eng": "Even the dishes I mentioned just now are not very hot."}, {"viet": "Công việc tốt lắm, Cripps-cố giữ vững nhé!", "eng": "Excellent work, Cripps-keep it up!"}, {"viet": "Biểu lộ một số suy nghĩ ngại ngùng về một lời đề nghị.", "eng": "Express certain mental reservations about an offer."}, {"viet": "Nỗi sợ hãi về những hậu quả đã giày vò tâm trí cô ta.", "eng": "Fear of the consequences preyed on her mind."}, {"viet": "Tìm một chỗ đất phẳng để làm cái bàn cắm trại.", "eng": "Find level ground for the picnic table."}, {"viet": "Ép mỏng bột nhào bằng bàn tay nén.", "eng": "Flatten the dough with a press of the hand."}, {"viet": "Đối với nhiều người, việc lập gia đình vẫn còn là một thông lệ.", "eng": "For most people it is still the done thing to get married."}, {"viet": "Phong trào tự do của các công nhân trong khối Cộng đồng châu Âu.", "eng": "Free movement of workers within the European Community."}, {"viet": "Đưa vào bản báo cáo một quan điểm thiên hữu.", "eng": "Gave the report a right wing slant."}, {"viet": "Anh ta thận trọng mở cái cửa lồng nhốt chuột.", "eng": "Gingerly he opened the door of the rat's cage."}, {"viet": "Nhìn thoáng qua ai giữa các bức rèm kéo nửa chừng.", "eng": "Glimpse someone between the halfdrawn curtains."}, {"viet": "Rời khỏi nhà hàng không phải trả tiền.", "eng": "Got away from the restaurant scot-free."}, {"viet": "Gắng công gắng sức giải quyết một vấn đề khó.", "eng": "Hammer away at a difficult problem."}, {"viet": "Bạn được sự đồng ý của họ chưa?", "eng": "Have they given you their okay?"}, {"viet": "Bạn có bao giờ thử giao dịch với ngân hàng qua internet chưa?", "eng": "Have you ever tried Internet banking?"}, {"viet": "Ông có thị thực cần thiết để vào Việt Nam không?", "eng": "Have you the requisite visa to enter Vietnam?"}, {"viet": "Nó là một chàng trai dễ thương, nhưng hơi chậm hiểu.", "eng": "He's a nice lad, but a bit slow on the draw."}, {"viet": "Nó đã bền bỉ làm bản luận án trong nhiều tháng.", "eng": "He's been pegging away at his thesis for months."}, {"viet": "Anh ta không có ý muốn ( nói ) đùa.", "eng": "He's in no mood for ( telling ) jokes."}, {"viet": "Ông ta giàu đến mức mất 100 pao mà không biết.", "eng": "He's so rich that he wouldn't miss 100 pounds."}, {"viet": "Hắn thậm chí mong tôi trả tiền vé cho hắn.", "eng": "He actually expected me to pay for his ticket."}, {"viet": "Anh ấy đi thăng bằng bấp bênh trên bờ cửa sổ hẹp.", "eng": "He balanced precariously on the narrow window-ledge."}, {"viet": "Anh ta xồng xộc vào phòng.", "eng": "He bulldozed his way into the room."}, {"viet": "Anh ta cười một mình khi đọc báo.", "eng": "He chuckled to himself as he read the newspaper."}, {"viet": "Anh ấy nguyền rủa vận đen của mình.", "eng": "He cursed at his bad luck."}, {"viet": "Anh ta đã chết vì những vết bỏng trong đám cháy.", "eng": "He died of the burns he received in the fire."}, {"viet": "Nó được hoàn toàn tự do làm theo ý muốn.", "eng": "He enjoyed complete freedom to do as he wished."}, {"viet": "Anh ấy nghĩ rằng kế hoạch đó không khôn ngoan.", "eng": "He felt the plan to be unwise."}, {"viet": "Anh ta tặng tôi hoa hồng nhân dịp sinh nhật của tôi.", "eng": "He gave me roses for my birthday."}, {"viet": "Hắn ta miễn cưỡng bỏ ra từng đồng xu mà hắn phải tiêu.", "eng": "He grudges every penny he has to spend."}, {"viet": "Ông ta không chuẩn bị bài phát biểu nhưng ông cũng chắp nối được một lời nhận xét vào cuối cuộc họp.", "eng": "He hadn't prepared a speech but he managed to string together a few remarks at the end of the meeting."}, {"viet": "Nó đã làm việc từ trưa.", "eng": "He has been working since noon."}, {"viet": "Nó đã nói dối chúng tôi hai lần.", "eng": "He has twice lied to us."}, {"viet": "Ông ấy là một người ít ham muốn.", "eng": "He is a man of few wants."}, {"viet": "Ông ta là một trong những nhân vật được quần chúng hâm mộ nhất hiện nay.", "eng": "He is one of the most admired public figures today."}, {"viet": "Nó chỉ cười ồ lên khi nghe câu chuyện đùa đó!", "eng": "He just roared when he heard that joke!"}, {"viet": "Nó luôn muốn có bạn bè.", "eng": "He likes to feel that he's one of the boys."}, {"viet": "Anh ấy thích đi thơ thẩn trong vườn.", "eng": "He loves to potter in the garden."}, {"viet": "Ông ấy hẳn đã xấp xỉ tám mươi tuổi.", "eng": "He must be getting on for eighty."}, {"viet": "Anh ấy nợ tôi 5 bảng Anh nhưng tôi không biết anh ấy có trả hay không.", "eng": "He owes me five pounds but I doubt if he'll ever come across with it."}, {"viet": "Anh ta ấn tay cô ta lên ngực mình.", "eng": "He pressed her hand against his heart."}, {"viet": "Ông ấy quản lý một cửa hàng của người da đỏ ở Nam Dakota.", "eng": "He ran a store for the Indians in South Dakota."}, {"viet": "Ông ta ngả mũ ra tỏ dấu hiệu tôn kính.", "eng": "He removed his hat as a sign of reverence."}, {"viet": "Ông ấy là một người được mọi người mến mộ.", "eng": "He's a hit with everyone."}, {"viet": "Ông ta kiên quyết tìm một công việc mới.", "eng": "He's dead set on getting a new job."}, {"viet": "Anh ta không phải là đối thủ của nàng về quần vợt.", "eng": "He's no match for her in tennis."}, {"viet": "Anh ta nhận thức rất rõ về địa vị cao của mình.", "eng": "He's very aware of his status."}, {"viet": "Hắn nói thức ăn không đủ nóng, anh thử nghĩ mà xem!", "eng": "He says the food isn't hot enough, if you please!"}, {"viet": "Lẽ ra anh phải nghĩ đến hậu quả trước khi hành động chứ, bà ta kết luận ra vẻ thầy đời.", "eng": "He should have thought of the consequences before he acted, she concluded sententiously."}, {"viet": "Anh ta nói tiếng Anh nhưng tiếng mẹ đẻ của anh ta là tiếng Đức.", "eng": "He speaks English, but his native tongue is German."}, {"viet": "Nó sợ chết cứng trước cảnh tượng kinh khủng đó.", "eng": "He stiffened with terror at the horrific sight."}, {"viet": "Nó hơi lắc lư như sắp ngã.", "eng": "He swayed slightly, as if about to fall."}, {"viet": "Suốt dọc đường đi, anh ta kể cho tôi nghe hết mọi chuyện.", "eng": "He told me everything as we went along."}, {"viet": "Nó cố gắng mãi mà vẫn không thành công.", "eng": "He tried and tried but without success."}, {"viet": "Trước đây nó thường hay lui tới các tiệm rượu và các hộp đêm của thành phố.", "eng": "He used to frequent the town's bars and night-clubs."}, {"viet": "Anh ta trông cao ráo, nước da ngăm đen và dĩ nhiên là rất đẹp trai.", "eng": "He was a tall, dark, and undeniably handsome man."}, {"viet": "Anh ta sinh ra vào một ngày thứ Hai.", "eng": "He was born on a Monday."}, {"viet": "Anh ấy ăn mặc rách rưới, theo thói quen của mình.", "eng": "He was dressed in rags, as was his wont."}, {"viet": "Anh ta phật ý bởi những lời nói bóng gió về hành vi sai trái trước đây của mình.", "eng": "He was hurt by any allusion to his previous misconduct."}, {"viet": "Ông ta là một trong những người di cư ti nạn rời nước Pháp sau cuộc Cách mạng Pháp.", "eng": "He was one of the émigrés who left France after the French Revolution."}, {"viet": "Anh ấy sống đơn giản, tính tình mộc mạc và dĩ nhiên rất chân thật.", "eng": "He was simple and unaffected and obviously sincere."}, {"viet": "Ông ta hoàn toàn bị bất lợi trong cuộc tranh luận.", "eng": "He was totally outflanked in the debate."}, {"viet": "Anh ta cứ tiếp tục nói không lưu ý tới sự ngắt lời.", "eng": "He went on speaking without adverting to the interruption."}, {"viet": "Anh ta đội mũ có vạt che tai.", "eng": "He wore a cap with flaps to cover his ears."}, {"viet": "Anh ấy ngừng đập và anh ấy chết ngay sau đó.", "eng": "Heart stopped beating and he died soon afterwards."}, {"viet": "Sự kiêu ngạo của cô ta làm vỡ mộng nhiều người trước đây vẫn ngưỡng mộ cô.", "eng": "Her arrogance has disenchanted many of her former admirers."}, {"viet": "Những đồng nghiệp của bà ta dự tính bà là Thủ tướng tương lai.", "eng": "Her colleagues see her as a future Prime Minister."}, {"viet": "Đôi mắt cô ta đẫm lệ.", "eng": "Her eyes were swimming with tears."}, {"viet": "Công việc siêng năng của bà ta góp phần to lớn vào uy tín của bà ta.", "eng": "Her hard work redounds to her credit."}, {"viet": "Ý tưởng viển vông gần đây nhất của cô ấy là đi cắm trại trong sa mạc Sahara!", "eng": "Her latest flight of fancy is to go camping in the Sahara desert!"}, {"viet": "Thân nhân gần nhất cô ấy đã được thông báo.", "eng": "Her next of skin have been informed."}, {"viet": "Sự tái đắc cử của bà ta cầm chắc trong tay.", "eng": "Her re-election is in the bag."}, {"viet": "Tinh thần bà ấy phấn khởi trở lại khi nghe tin vui.", "eng": "Her spirit rallied on hearing the good news."}, {"viet": "Công trình của bà ấy đã góp thêm phần rất to lớn vào sự hiểu biết của chúng tôi về chủ đề khó khăn này.", "eng": "Her work has contributed enormously to our understanding of this difficult subject."}, {"viet": "Nhà hàng cao cấp không phải cho những loại người như chúng ta.", "eng": "High class restaurant aren't for the likes of us."}, {"viet": "Thái độ của anh ta với công việc có phần hững hờ.", "eng": "His attitude to his job is rather casual."}, {"viet": "Thời anh ta còn nhỏ-cha trong tù, còn bản thân là một cậu bé lao động trong nhà máy-vừa ám ảnh trong tâm trí anh ta vừa làm cho anh ta thêm nghị lực.", "eng": "His childhood-father in prison, factory work as a boy-both haunted and energized him."}, {"viet": "Con chó của ông ta cứ đi theo ông ta khắp nơi.", "eng": "His dog goes everywhere with him."}, {"viet": "Khi Khổng Phu Tử lên ba thì bố ông mất.", "eng": "His father died when Confucius was only three years old."}, {"viet": "Sức khỏe của ông ta yếu đi đều đều.", "eng": "His health is getting steadily worse."}, {"viet": "Trò giải trí mới nhất của anh ta là một máy vi tính cá nhân.", "eng": "His latest toy is personal computer."}, {"viet": "Sự cẩu thả của ông ta đúng là tội ác.", "eng": "His negligence was nothing less than criminal."}, {"viet": "Các đối thủ chính trị của ông ta đã làm phiền toái cho ông ta mới đây.", "eng": "His political opponents have been making things warm for him lately."}, {"viet": "Người ngồi bên cạnh anh ta trên xe là một phụ nữ tóc bạc đeo kính.", "eng": "His seatmate was a gray-haired woman with glasses."}, {"viet": "Sự gợi ý của anh ta đã bị một số phản đối.", "eng": "His suggestion met with some hostility."}, {"viet": "Những lời than vãn không bao giờ dứt của vợ làm cho đời ông thành một nỗi giày vò khốn khổ.", "eng": "His wife never ending complaints made his life a martyrdom."}, {"viet": "Hôliút bao hàm tình cảm lãng mạn và thành công rực rỡ.", "eng": "Hollywood holds connotations of romance and glittering success."}, {"viet": "Lúc 6 giờ trước toà nhà văn phòng của chúng ta được không?", "eng": "How about at 6 o'clock in front of our office building?"}, {"viet": "Làm sao anh lại có thể gạt chính con cái của mình, thật là đồ đê tiện.", "eng": "How could you cheat your own children, you skunk."}, {"viet": "Ông thấy các vở kịch Mỹ như thế nào?", "eng": "How do you like American plays?"}, {"viet": "Công ty ABC đã hoạt động kinh doanh được bao lâu rồi?", "eng": "How long has ABC Corporation been in business?"}, {"viet": "Trong một tuần ở trường có bao nhiêu tiết học?", "eng": "How many lessons are there in the school week?"}, {"viet": "Đến công viên Hyde mất bao nhiêu tiền?", "eng": "How much does it cost to Hyde Park?"}, {"viet": "Họ huấn luyện những con sư tử này thế nào quả là một điều kỳ diệu đối với tôi.", "eng": "How they train the lions is a marvel to me."}, {"viet": "Hydrô hóa hợp với ôxy tạo thành nước.", "eng": "Hydrogen combines with oxygen to form water."}, {"viet": "Tôi muốn nói với anh về ý tưởng của tôi.", "eng": "I'd like to speak with you about my idea."}, {"viet": "Anh sẽ cho hắn một trận để hắn không bao giờ có thể quấy rầy em nữa.", "eng": "I'll fix him so that he never bothers you again."}, {"viet": "Tôi sẽ gọi điện cho taxi, trong thời gian đó anh hãy xếp va li đi.", "eng": "I'll phone for a taxi in the meantime you pack your case."}, {"viet": "Tôi e rằng tôi không uống được cà phê có sữa.", "eng": "I'm afraid I can't drink coffee with milk in."}, {"viet": "Tôi nhận thấy cuốn sách này rất khó hiểu.", "eng": "I'm finding this book very hard going."}, {"viet": "Tôi đói rồi''Gì ạ?''Tôi nói là tôi đói rồi'.", "eng": "I'm hungry''Sorry?''I said I'm hungry'."}, {"viet": "Tôi không rõ tại sao, nhưng tôi cảm thấy hơi ái ngại cho anh ấy.", "eng": "I'm not sure why but, I feel kind of sorry for him."}, {"viet": "Tôi xin lỗi đã đánh vỡ cái tách của anh-hôm nay sao tôi vụng về lóng ngóng quá.", "eng": "I'm sorry I dropped your cup-I'm an fingers and thumbs today."}, {"viet": "Tôi chán ( nghe ) những lời chỉ trích của anh rồi.", "eng": "I'm tired of ( listening to ) your criticisms."}, {"viet": "Tôi đã được mời đến nói chuyện tại hội nghị.", "eng": "I've been invited to give a talk at the conference."}, {"viet": "Tôi có thành kiến với người đàn ông có râu mép.", "eng": "I've got a thing about the men with beards."}, {"viet": "Cháu chưa bao giờ ăn khoai lang này trước đây, nhưng nó có vị rất ngon.", "eng": "I've never eaten this before, but it tastes very good."}, {"viet": "Tôi rất muốn giảm vài pao.", "eng": "I'd definitely like to lose a few pounds."}, {"viet": "Tôi cứ luôn nghĩ đến hình dáng nàng trong chiếc áo đầm đó.", "eng": "I always think of her in that dress."}, {"viet": "Tôi là khách trọ ở phòng 801.", "eng": "I am the guest from 801."}, {"viet": "Xin lỗi-ông nói gì tôi nghe không rõ.", "eng": "I beg your pardon-I didn't hear what you said."}, {"viet": "Tôi đã đến với ý định lưu lại, nhưng giờ thì tôi quyết định rời đi.", "eng": "I came with the intention of staying, but now I've decided to leave."}, {"viet": "Tôi không thể tưởng tượng được ngôi làng mà không có ngôi nhà thờ cổ.", "eng": "I can't picture the village without the old church."}, {"viet": "Tôi thật không thể tin được đây là một học viện quân sự.", "eng": "I can hardly believe it's a military academy."}, {"viet": "Tôi không thể cấm anh gặp lại người đàn ông đó.", "eng": "I can't forbid you that man again."}, {"viet": "Tôi phải thường xuyên nhắc nhở anh ấy về trách nhiệm của anh ta.", "eng": "I continually have to remind him of his responsibilities."}, {"viet": "Chắc tôi phải đi bây giờ.", "eng": "I'd better be going now."}, {"viet": "Tôi đã hết sức cố gắng trong lớp toán.", "eng": "I did my level best in math class."}, {"viet": "Tôi không ưa cô ấy lắm.", "eng": "I do not like her over-much."}, {"viet": "Tôi không biết có nên tin cô ấy hay không?", "eng": "I don't know whether to believe her or not?"}, {"viet": "Tôi nghĩ rằng kế hoạch chẳng có gì đáng khen nhiều lắm.", "eng": "I don't think there's much merit in the plan."}, {"viet": "Mình không tin là có ma đâu.", "eng": "I don't believe in ghosts."}, {"viet": "Tôi đã moi chuyện ông cụ về những kinh nghiêm chiến tranh của ông.", "eng": "I drew the old man out about his war experiences."}, {"viet": "Tôi cảm thấy như tôi sắp bị cảm.", "eng": "I feel like I'm coming down with a cold."}, {"viet": "Tôi thấy một số địa danh hầu như không thể phát âm được.", "eng": "I find some of the place-names barely pronounceable."}, {"viet": "Tôi liếc mắt lên để xem ai đã vào nhà.", "eng": "I glanced up to see who had come in."}, {"viet": "Tôi nảy ra một cảm giác là có điều gì không ổn.", "eng": "I had a gut feeling that something would go wrong."}, {"viet": "Tôi phải về hưu vì lý do sức khoẻ kém.", "eng": "I had to retire on the grounds of ill health."}, {"viet": "Tôi đã uỷ quyền cho anh ta thay mặt tôi khi tôi đi vắng.", "eng": "I have authorized him to act for me while I am away."}, {"viet": "Hôm nay tôi không có việc gì để làm.", "eng": "I have nothing to do today."}, {"viet": "Tôi không kiếm được cái đĩa đó ở đâu hết.", "eng": "I haven't been able to obtain that record anywhere."}, {"viet": "Nghe nói anh thích công việc mới, trái lại tôi thấy nó chán lắm.", "eng": "I hear you are enjoying your new job, on the contrary I find it rather dull."}, {"viet": "Tôi hy vọng thời tiết cứ như thế này.", "eng": "I hope the weather stays this way."}, {"viet": "Tôi chỉ tạt vào để trả cuốn sách này.", "eng": "I just dropped in to return this book."}, {"viet": "Tôi biết năm nay là năm mấy.", "eng": "I know what year it is."}, {"viet": "Tôi muốn mở một bữa tiệc tưng bừng một hai lần trong một năm.", "eng": "I like to throw a bang-up party once or twice a year."}, {"viet": "Trước tiên tôi phải làm xong việc của tôi đã.", "eng": "I'll finish my work first."}, {"viet": "Tôi chấp nhận cuộc với anh chuyện đó.", "eng": "I'll take you up on that."}, {"viet": "Tôi dám chắc là cô ta đã thấy tôi.", "eng": "I'm certain that she saw me."}, {"viet": "Tôi đang tìm mua đôi giày bền khác.", "eng": "I'm looking for some sturdy shoes."}, {"viet": "Tôi nói với anh với tư cách là một ông chủ.", "eng": "I'm speaking as your employer."}, {"viet": "Tôi gặp nàng ở ngoài phố.", "eng": "I met her in the street."}, {"viet": "Tôi phải nhấn mạnh là chúng ta không có nhiều thời gian.", "eng": "I must stress that we haven't much time."}, {"viet": "Tôi chẳng bao giờ lấy cắp số tiền đó, tôi xin thề là không!", "eng": "I never stole the money, so help me I didn't!"}, {"viet": "Tôi gọi điện cho bố mẹ tôi báo cho họ tin đó.", "eng": "I phoned my parents to tell them the news."}, {"viet": "Tôi đã biết được về cô ấy nhờ đọc trong tờ báo hôm nay.", "eng": "I read about her in today's paper."}, {"viet": "Tôi vui mừng nghe tin anh khỏe trở lại.", "eng": "I rejoice to hear that you are well again."}, {"viet": "Tôi trông thấy khẩu súng và chúi nhanh xuống bên dưới cửa sổ.", "eng": "I saw the gun and ducked under the window."}, {"viet": "Tôi sẽ xử lý lời đề nghị ấy với sự khinh khi xứng đáng với nó.", "eng": "I shall treat the suggestion with the contempt it deserves."}, {"viet": "Tôi đã làm đổ một ít nước tương lên đó.", "eng": "I spilled some soy sauce on it."}, {"viet": "Tôi coi sự đe dọa này rất nghiêm trọng.", "eng": "I take this threat very seriously."}, {"viet": "Tôi nghĩ đó là chứng mệt mỏi sau chuyến bay dài.", "eng": "I think it's jet lag."}, {"viet": "Tôi nghĩ tốt nhất anh nên trở lại trường đại học và lấy thêm chứng chỉ.", "eng": "I think your best bet would be to go back to college and get more qualifications."}, {"viet": "Tôi run sợ khi nghĩ về những điều có thể xảy ra.", "eng": "I tremble at the thought of what may happen."}, {"viet": "Tôi thường đi tắt qua công viên trên đường về nhà.", "eng": "I usually cut across the park on my way home."}, {"viet": "Tôi muốn trở thành giáo viên dạy lịch sử khi tôi tốt nghiệp.", "eng": "I want to be a history teacher once I graduate."}, {"viet": "Tôi muốn nói với cô ấy chính xác điều tôi suy nghĩ nhưng tôi đã mất can đảm.", "eng": "I wanted to tell her exactly what I thought, but I lost my nerve."}, {"viet": "Tôi hoàn toàn chờ đợi sẽ mất việc, cho nên sự đề bạt này là một sự ngạc nhiên hết sức.", "eng": "I was fully expecting to lose my job, so this promotion has come as a complete surprise."}, {"viet": "Tôi được chỉ dẫn đến gặp giám đốc.", "eng": "I was referred to the manager."}, {"viet": "Tôi thường không chịu nghe lời cha tôi.", "eng": "I was very disobedient towards my father."}, {"viet": "Tôi sẽ không làm cho anh chán nản về những vấn đề vớ vẩn đâu.", "eng": "I will not labour you with trivial matters."}, {"viet": "Tôi đoạt được giải luận văn rồi lại nhận được học bổng.", "eng": "I won the essay prize, then was offered a scholarship."}, {"viet": "Tôi sẽ giúp bạn tìm chúng, nhưng tôi không biết phải tìm ở đâu.", "eng": "I would help you find them, but I don't know where to look."}, {"viet": "Tôi không bao giờ tự nguyện đi đâu bằng tàu bè cả, đi chơi biển lại càng không.", "eng": "I would never willingly go anywhere by boat, much less go on a cruise."}, {"viet": "Nếu một người đưa đất nước mình vào nguy hiểm bằng cách giúp đỡ kẻ thù, vợ và tài sản của anh ta sẽ bị tịch biên cho nhà vua.", "eng": "If a man put his country in danger by helping the enemy, his wife and possessions were forfeit to the crown."}, {"viet": "Nếu tôi có thể nài xin anh chiều theo ý tôi một lát.", "eng": "If I may crave your indulgence for one moment."}, {"viet": "Nếu tiếng còi báo động cháy nổi lên, tất cả nhân viên phải tập hợp bên ngoài toà nhà.", "eng": "If the fire-alarm goes, staff should assemble outside the building."}, {"viet": "Nếu chúng ta vẫn không tìm được, bà phải báo cho đại sứ quán của bà biết về việc này.", "eng": "If we still can't find it, you must tell your embassy about it."}, {"viet": "Nếu bạn làm hỏng ôtô thì cha của bạn sẽ than phiền nhiều về chuyện đó đấy.", "eng": "If you damage the car, your father will have plenty to say about it."}, {"viet": "Nếu anh cho tôi mượn tiền thì tuần tới tôi sẽ trả lại.", "eng": "If you lend me, I'll repay you next week."}, {"viet": "Nếu anh muốn tham gia thì đóng lệ phí nhập hội là 20 bảng Anh và tiền lệ phí hội viên hàng năm là 10 bảng Anh.", "eng": "If you want to join, there's an entrance fee of £ 20 and an annual membership fee of £ 10."}, {"viet": "Sau một thời gian ngắn, Columbus lại lên đường với 17 chiếc tàu và hơn 1000 thủy thủ.", "eng": "In a short time Columbus was on his way back with 17 ships and over 1,000 men."}, {"viet": "Sự thực, có một vài dân tộc văn minh vẫn ăn thịt người.", "eng": "In fact, some civilized people were cannibals."}, {"viet": "Đã không đạt được một quyết định nào trong cả hai trường hợp.", "eng": "In neither case was a decision reached."}, {"viet": "Ở những giai đoạn đầu, chỉ những giám đốc phụ trách khu vực mới tham gia.", "eng": "In the early stages, only the regional managers are involved."}, {"viet": "Trong trường hợp này, chúng tôi có thể cho các ông hưởng mức chiết khấu 5%.", "eng": "In this case, we can give you 5% discount."}, {"viet": "Thừa hưởng trọng trách của quyền lực tối cao.", "eng": "Inherit the mantle of supreme power."}, {"viet": "Cô có thể cho số phòng hoặc số khu của anh ấy không?", "eng": "Is it possible for you to give me his room or ward number?"}, {"viet": "Bạn có thích một giai đoạn nghệ thuật cụ thể nào không?", "eng": "Is there any particular period of art you prefer?"}, {"viet": "Tóc anh không phải cũng vừa cắt kiểu mới sao?", "eng": "Isn't yours a new cut, too?"}, {"viet": "Nên gọi điện trước để hẹn gặp.", "eng": "It's advisable to ring up first to make an appointment."}, {"viet": "Đó rõ ràng là bộ phim hay nhất tôi xem trong năm nay.", "eng": "It's easily the best film I've seen this year."}, {"viet": "Loại truyện này để đọc chơi khi người ta thấy mệt mỏi hay đang chen lấn trên xe lửa.", "eng": "It's light reading that can be done while you're tired and being jostled on the train."}, {"viet": "Mặc cả vài xu chẳng bõ.", "eng": "It's not worth haggling over a few pence."}, {"viet": "Công việc của nhà thờ là giúp cho mọi người sống tốt hơn.", "eng": "It's the job of the church to help people lead better lives."}, {"viet": "Nó đã reo một lần rồi, và con đã tắt nó, phải không nào?", "eng": "It already rang once, and you stopped it, right?"}, {"viet": "Người ta đã quyết định cuốn sách cần phải được duyệt lại.", "eng": "It has been decided that the book should be revised."}, {"viet": "Phải rồi, nghe nói người trưởng nhóm bồi bàn kiếm một trăm đô một ngày.", "eng": "It is I've heard a top waiter makes a hundred dollar a day here."}, {"viet": "Chính sự kết hợp trí tuệ và sự phân tích chính trị đã làm cho các bài báo của anh ta rất dễ đọc.", "eng": "It is the combination of wit and political analysis that makes his articles so readable."}, {"viet": "Rành rành trước tất cả các anh là nó đã phạm lỗi.", "eng": "It must be evident to all of you that he has made a mistake."}, {"viet": "Vào thời điểm nó nằm trong danh sách sách bán chạy nhất.", "eng": "It's on the best seller's list right now."}, {"viet": "Tôi thấy dường như nó không rộng như tôi tưởng tượng.", "eng": "It seems to me that it isn't so wide as I imagined."}, {"viet": "Khi vợ anh ấy chết đó là cú sốc lớn đối với anh ấy.", "eng": "It was a great shock for him when his wife died."}, {"viet": "Thực khó mà hiểu được tất cả những bước thay đổi tinh vi trong thói quan liêu của họ.", "eng": "It was hard to understand all the minute gradations of their bureaucracy."}, {"viet": "Chính là con chim sơn ca, sứ giả của ban mai.", "eng": "It was the lark, the herald of the morn."}, {"viet": "Một người không chuyên về kinh tế mà lại nói về những chi tiết của chính sách kinh tế là thiếu thận trọng.", "eng": "It would be imprudent for a non-economist to talk about the detail of economic policy."}, {"viet": "Jeff cần nhiều bí quyết kĩ thuật hơn để đảm đương công việc mới của anh ta.", "eng": "Jeff needs more technical know how to do his new job."}, {"viet": "Những xe tải kéo rơ-moóc chạy rầm rầm qua các làng quê.", "eng": "Juggernauts roaring through our country villages."}, {"viet": "Thưa quý bà, quý ông, tôi xin mời quý bà quý ông nâng cốc chúc mừng Hoàng tử, vương hầu xứ Wales.", "eng": "Ladies and gentlemen, I give you his Royal Highness, the Prince of Wales."}, {"viet": "Chúng ta hãy đi xuống đồi đến khu vực lễ hội powwow đi.", "eng": "Let's walk down the hill to the powwow area."}, {"viet": "Lioness là hình thức giống cái của lion.", "eng": "Lioness is the feminine form of lion."}, {"viet": "Nhiều người Ailen đã sang Mỹ trong thời gian có nạn đói.", "eng": "Many of the Irish went over to America during the famine."}, {"viet": "Martin không phải là người vội vàng đi vào hôn nhân.", "eng": "Martin isn't just the type to rush headlong into marriage."}, {"viet": "Mời anh uống thêm cà phê?", "eng": "May I offer you some more coffee?"}, {"viet": "Cô Lưu, tôi xin giới thiệu ông Brown với cô.", "eng": "Miss Liu, I'd like you to meet Mr. Brown."}, {"viet": "Mẹ cùng với em gửi anh những lời chúc mừng tốt đẹp nhất.", "eng": "Mother joins me in sending you our best wishes."}, {"viet": "Dì của tôi đã sống với chúng tôi kể từ khi chồng của bà ấy mất, vì thế bà ấy đã trở nên quen thuộc với chúng tôi.", "eng": "My aunt has been living with us ever since her husband died so she's become part of the furniture."}, {"viet": "Bố tôi là người Anh còn mẹ tôi là người Scotland.", "eng": "My father is English and my mother is Scottish."}, {"viet": "Kí ức của tôi về điều xảy ra không đầy đủ.", "eng": "My memory of what happened is rather sketchy."}, {"viet": "Con trai tôi cũng giống thế.", "eng": "My son looked like that, too."}, {"viet": "Đừng có bao giờ làm cho thói quen hút thuốc của ông ấy bị gián đoạn.", "eng": "Never intermitted his habit of smoking."}, {"viet": "Không, tôi không nghĩ đã gặp, dầu tôi không chắc.", "eng": "No, I don't believe I have although I'm not sure."}, {"viet": "Không ai nghi ngờ năng lực của cô ta với tư cách một giáo viên.", "eng": "No one doubts her competence as a teacher."}, {"viet": "Bây giờ để tôi sắp xếp hành lý nhé.", "eng": "Now let me settle the luggage."}, {"viet": "Tất nhiên là anh có thể làm nó trong nhà bếp của anh.", "eng": "Of course you can make it in your kitchen."}, {"viet": "OK, hãy đến quầy số 15.", "eng": "OK, just go to the Counter No. 15."}, {"viet": "Khi một ngân hàng nâng lãi suất thì tất cả các ngân hàng khác cũng làm theo.", "eng": "Once one bank raised its interest rate, all the others followed suit."}, {"viet": "Một trong những điều thích thú ít ỏi của một công việc có phần nào nhàm chán.", "eng": "One of the few gratifications of an otherwise boring job."}, {"viet": "Các con chúng tôi vừa ra ở riêng, và chúng tôi được hưởng thời gian cho riêng mình.", "eng": "Our children have recently flown the nest, and we're enjoying some time to ourselves."}, {"viet": "Chuyến đi của chúng tôi đã kết thúc không có rủi ro gì thêm.", "eng": "Our journey ended without further mishap."}, {"viet": "Xe tăng của chúng ta đã phá vỡ tuyến phòng thủ của địch.", "eng": "Our tanks have breached the enemy defenses."}, {"viet": "Bậc làm cha mẹ thường phải hi sinh mọi thứ để cho con cái họ được ăn học.", "eng": "Parents often make sacrifices in order to educate their children."}, {"viet": "Công chúng xúm lại xung quanh để nhìn rõ hơn.", "eng": "People crowded round to get a better view."}, {"viet": "Xin cho tôi một lần nữa bày tỏ lời cảm ơn chân thành của chúng tôi đến mọi người có mặt ở đây về tình hữu nghị và lòng hiếu khách của quý vị.", "eng": "Please allow me once again to express our heartfelt thanks to everyone present here for your friendliness and hospitality."}, {"viet": "Những câu thực dụng về các địa điểm đáng quan tâm và phong cảnh ở Trung Quốc.", "eng": "Practical sentences of the places of interest and the landscape in China."}, {"viet": "Này, Mary, sao em không tham gia vào cuộc thi sắc đẹp ở địa phương?", "eng": "Say, Mary, why don't you enter the local beauty contest?"}, {"viet": "Tôi sẽ nói ông ấy gọi điện lại cho ông nhé?", "eng": "Shall I have him call you back?"}, {"viet": "Mụ ta đúng đa dâm-mụ ta có thể làm bất cứ điều gì với bất kỳ ai!", "eng": "She's a real goer-she'll do anything with anyone!"}, {"viet": "Nàng lúc nào cũng nghĩ tới một ngày nghỉ đi cắm trại.", "eng": "She's completely hooked on the idea of a camping holiday."}, {"viet": "Cô ta bỏ công ty đang làm để lập công ty riêng.", "eng": "She's leaving the company to branch out on her own."}, {"viet": "Cô ta vẫn còn đang bực mình vì đã lỡ bữa liên hoan.", "eng": "She's still disgruntled about missing the party."}, {"viet": "Bà ấy khuyến cáo Chính phủ về các hoạt động kinh tế.", "eng": "She advises the Government on economic affairs."}, {"viet": "Cô ta đi qua chạm nhẹ phải anh ấy mà không nói một lời nào.", "eng": "She brushed past him without saying a word."}, {"viet": "Cô ta kêu ca có lý rằng cô bị trả lương thấp.", "eng": "She complained with reason that she had been underpaid."}, {"viet": "Cô ấy kể lại cho tôi biết nó đã xông tới giật lấy cái túi xách của cô ấy như thế nào.", "eng": "She described to me how he ran up to her and grabbed her handbag."}, {"viet": "Bà ta thúc khuỷu, len qua đám khách du lịch.", "eng": "She elbowed her way through the masses of tourists."}, {"viet": "Cô ta thấy thái độ muốn giữ rịt lấy cho mình của người bạn trai của cô là không sao chịu được.", "eng": "She found her boyfriend's possessive behaviour intolerable."}, {"viet": "Cô ấy mất cả bố mẹ.", "eng": "She got lost from her parents."}, {"viet": "Cô ấy phải ngồi không hàng tiếng đồng hồ vì tàu đến chậm quá!", "eng": "She had to kick her heels for hours because the train was so late!"}, {"viet": "Cô ta chẳng hề có ý định lấy nó-cô ta chỉ đánh lừa nó thôi.", "eng": "She has no intention of marrying him-she's just stringing him along."}, {"viet": "Cô ta đặt mình xuống chiếc ghế bành mà bố cô thích nhất.", "eng": "She installed herself in her father's favourite armchair."}, {"viet": "Cô ấy chân thành và hoàn toàn không có thái độ vờ vịt.", "eng": "She is sincere and quite without affectation."}, {"viet": "Bà ấy dời các con với nỗi đau thắt lòng.", "eng": "She left her children with a pang of regret."}, {"viet": "Cô ấy âu yếm vuốt má đứa bé.", "eng": "She lovingly caressed the baby's cheek."}, {"viet": "Cô ta không bao giờ đi ăn cơm thết mà không tô son đánh phấn trang điểm!", "eng": "She never goes out to a party without putting her war-paint on!"}, {"viet": "Bà ta chia số tiền đều nhau cho hai đứa con.", "eng": "She portioned out the money equally between both children."}, {"viet": "Cô ấy làm chúng tôi thích thú với câu chuyện kể về thời đi học của cô.", "eng": "She regaled us with an account of her school-days."}, {"viet": "Cô ấy thông minh nhưng khiêm tốn.", "eng": "She's brilliant but self-effacing."}, {"viet": "Bà ta rất bủn xỉn về tiền bạc.", "eng": "She's tight with her money."}, {"viet": "Dường như cô ấy rất phù hợp với công việc đó.", "eng": "She seems eminently suitable for the job."}, {"viet": "Trong sương mù, cô ta đã đâm sầm chiếc xe mới của mình.", "eng": "She smashed up her new car in the fog."}, {"viet": "Cô ta lèn chặt quần áo vào rồi cố đậy cái nắp lại.", "eng": "She stuffed her clothes in and then tried to close the lid."}, {"viet": "Cô ấy bảo người lái taxi không được suồng sã như vậy.", "eng": "She told the taxi driver not to be so familiar."}, {"viet": "Cô ấy sử dụng nhan sắc của mình để lôi kéo mọi người.", "eng": "She uses her charm to manipulate people."}, {"viet": "Cô bé luôn là một đứa trẻ ham đọc sách.", "eng": "She was always a bookish child."}, {"viet": "Cô ấy mặc toàn màu trắng.", "eng": "She was dressed all in white."}, {"viet": "Cô ta vừa cười lại vừa khóc.", "eng": "She was laughing and crying at the same time."}, {"viet": "Ở nhà hát nhạc kịch, người ta trông thấy cô ấy với người tháp tùng trông bảnh bao lắm.", "eng": "She was seen at the opera with an extremely presentable escort."}, {"viet": "Cô ta đã được đưa lên làm chức giám đốc kinh doanh.", "eng": "She was upgraded to the post of sales director."}, {"viet": "Bà ta đi chợ để bán những gì mình làm ra.", "eng": "She went to the market to sell what she had made."}, {"viet": "Cô ấy làm cho ông chủ mới độc đoán.", "eng": "She works for a tyrannical new boss."}, {"viet": "Nếu có ai gọi điện thoại đến, vui lòng nói với họ là tôi bận.", "eng": "Should anyone phone, please tell them I'm busy."}, {"viet": "Đơn giản hóa những chỉ dẫn để trẻ em có thể hiểu được.", "eng": "Simplify the instructions so that children can understand them."}, {"viet": "Đọc lướt bản danh sách tìm tên của mình.", "eng": "Skim over the list, looking for one's name."}, {"viet": "Cho phép được hút thuốc ở bên phải khoang hành khách một khi đèn hiệu ở khoang trước mặt đã được tắt, và không được hút thuốc bất cứ lúc nào trong phòng vệ sinh nằm ở sau máy bay.", "eng": "Smoking is permit-ted on the right side of the passenger cabin once the signs at the front cabin have been switched off, and at no smoking any time in the tolet which is situated at the rear of the air-craft."}, {"viet": "Thế là sau cùng anh đã đến!", "eng": "So you've come after all!"}, {"viet": "Người La Mã đã xây một số khán đài vòng cung nổi tiếng.", "eng": "Some famous amphitheatres were built by the Romans."}, {"viet": "Một số người có giọng truyền cảm thiên phú trong khi đó những người khác cần phải được luyện tập.", "eng": "Some people have naturally beautiful voices while others need to be trained."}, {"viet": "Có người đã để vòi nước chảy.", "eng": "Someone has left the tap on."}, {"viet": "Những âm thanh nghe êm tai.", "eng": "Sounds that are pleasing to the ear."}, {"viet": "Phục hồi lại một vở hài kịch thời Phục hưng.", "eng": "Stage a revival of a Restoration comedy."}, {"viet": "Giá cả chứng khoán đã giảm xuống sau một thời gian phục hồi ngắn ngủi.", "eng": "Stock prices sagged after a short rally."}, {"viet": "Đi chệch vào đường của một chiếc ôtô đi ngược chiều.", "eng": "Stray into the path of an oncoming car."}, {"viet": "Cách ứng xử như thế mâu thuẫn với những nguyên tắc cao thượng của bà ta.", "eng": "Such behaviour is inconsistent with her high-minded principles."}, {"viet": "Những người trịch thượng cười khẩy vào cái giọng ngoại quốc của bà ta.", "eng": "Superior people who sniggered at her foreign accent."}, {"viet": "Mang xe ôtô đi dưỡng cứ mỗi 3000 dặm.", "eng": "Take a car in for a service every 3000 miles."}, {"viet": "Những cây cao vươn qua sông.", "eng": "Tall trees arched across the river."}, {"viet": "Nói với những người chủ trương bảo vệ môi trường thiên nhiên là cần phải giữ gìn di sản của thiên nhiên thì thật đúng là chở củi về rừng!", "eng": "Telling conversationists that we need to preserve the natural heritage really is preaching to the converted!"}, {"viet": "Nhờ vào những nỗ lực không mệt mỏi của anh vì chúng tôi.", "eng": "Thanks to your tireless efforts on our behalf."}, {"viet": "Chiếc xe ôtô đó đang được lái bởi một người học lái.", "eng": "That car's being driven by a learner."}, {"viet": "Đó là do chỗ này chật ních người.", "eng": "That is because the place was packed."}, {"viet": "Cái áo khoác đó trông quả thật không còn dùng được nữa.", "eng": "That over-coat is looking decidedly past it."}, {"viet": "Nghe có vẻ là một nơi hay đấy chứ?", "eng": "That sounds like a good place?"}, {"viet": "Tinh thần thám hiểm của thế kỷ 16.", "eng": "The 16th-century spirit of exploration."}, {"viet": "Việc thu thập các tác phẩm mỹ thuật cổ, kiến thức, một gia sản.", "eng": "The acquisition of antiques, know-ledge, a fortune."}, {"viet": "Hãng hàng không nỗ lực để đưa ông ấy đến đó đúng giờ.", "eng": "The airline pulled out all the stops to get him there in time."}, {"viet": "Phần trước của một con cá gồm đầu và mang.", "eng": "The anterior part of a fish contains the head and gills."}, {"viet": "Quân đội ở trong tình trạng thái lui toàn bộ.", "eng": "The army was in full retreat."}, {"viet": "Khán giả bày tỏ sự biết thưởng thức của mình bằng những tràng vỗ tay.", "eng": "The audience showed their appreciation with loud cheers."}, {"viet": "Đứa bé sinh ra nặng ba cân.", "eng": "The baby weighted three pound at birth."}, {"viet": "Các nhà băng cho vay tiền với một lãi suất cạnh tranh.", "eng": "The banks are lending money at a competitive rate of interest."}, {"viet": "Nguyên tắc căn bản trong tín ngưỡng của mình.", "eng": "The bedrock of one's beliefs."}, {"viet": "Những khó khăn của một nền dân chủ mới ra đời.", "eng": "The birth pangs of an emergent democracy."}, {"viet": "Quả bom đã được hẹn giờ để 4 tiếng sau sẽ nổ.", "eng": "The bomb had been set with a four-hour fuse."}, {"viet": "Ông chủ hài lòng-đó là một phần thưởng tưởng tượng khác đấy.", "eng": "The boss is pleased-That's another brownie point."}, {"viet": "Các cành cây trĩu xuống cùng với các quả táo chín.", "eng": "The branches were weighed down with ripe apples."}, {"viet": "Phần chủ yếu của công việc đã làm xong.", "eng": "The bulk of the work has already been done."}, {"viet": "Biển lặng yên không hề có dấu hiệu của cơn bão đang đến.", "eng": "The calm sea gave no hint of the storm that was coming."}, {"viet": "Chiếc xe ô-tô phía trước tôi dừng lại bất ngờ nên tôi phải phanh lại.", "eng": "The car in front of me stopped suddenly and I had to brake."}, {"viet": "Phần trang trí chạm khắc quanh lối vào.", "eng": "The carved decoration around the doorway."}, {"viet": "Cái ghế in bóng lên bức tường.", "eng": "The chair casts a shadow on the wall."}, {"viet": "Các phụ tá chính của Tổng thống.", "eng": "The chief aides to the President."}, {"viet": "Đứa bé được đặt tên theo tên cha nó.", "eng": "The child was named after its father."}, {"viet": "Những đứa trẻ trơn trong bụi cây.", "eng": "The children hid in the strawberry shrub."}, {"viet": "Bọn trẻ rất khoái màn kịch câm.", "eng": "The children were very excited by the pantomime."}, {"viet": "Các lớp học được sắp xếp cho buổi tối nay theo thời khóa biểu.", "eng": "The classes timetabled for this evening."}, {"viet": "Bây giờ bờ biển đó chật ních khách du lịch.", "eng": "The coast is terribly touristy now."}, {"viet": "Báo cáo của uỷ ban hoàn toàn tán thành những đề nghị của chính phủ.", "eng": "The committee's report fully endorses the government's proposals."}, {"viet": "Công ty sẽ đưa ra một kiểu xe hơi du lịch gia đình mới trong năm nay.", "eng": "The company is introducing a new family saloon this year."}, {"viet": "Cuộc xung đột có thể lên tới mức độ không thể kiểm soát được.", "eng": "The conflict may grow to unmanageable proportions."}, {"viet": "Phán quyết của quan chức điều tra là'chết do tai nạn bất ngờ'.", "eng": "The coroner's verdict was'death by misadventure'."}, {"viet": "Miền quê rực rỡ với những màu sắc mùa thu.", "eng": "The countryside glowed with autumn colours."}, {"viet": "Tôi nhận mang hộ chiếu giả.", "eng": "The criminal was travelling on a false passport."}, {"viet": "Sự khai thác xảo quyệt các trung tâm quyền lực.", "eng": "The cunning exploitation of loci of power."}, {"viet": "Sự điều hành hàng ngày một cỗ máy.", "eng": "The day-to-day running of a machine."}, {"viet": "Những hình sương giá mỏng manh trên ô cửa kính.", "eng": "The delicate traceries of frost on the window-pane."}, {"viet": "Tập nhật ký đã miêu tả gia đình anh ta là hay cãi cọ và độc ác.", "eng": "The diary portrays his family as quarrelsome and malicious."}, {"viet": "Cuộc tranh chấp được giải quyết bởi trọng tài.", "eng": "The dispute was resolved by arbitration."}, {"viet": "Bác sĩ đã dặn chúng tôi đừng làm cho bệnh nhân quá mệt mỏi.", "eng": "The doctor warned us against overtiring the patient."}, {"viet": "Con chó đang nhai rào rạo một khúc xương.", "eng": "The dog was crunching a bone."}, {"viet": "Người lái xe lùi xe tải vào con đường hẹp.", "eng": "The driver reversed the lorry into the narrow road."}, {"viet": "Nền kinh tế ở trong tình trạng suy sụp hoàn toàn.", "eng": "The economy is in a state of total collapse."}, {"viet": "Vị trí của địch có thể nhìn thấy từ đỉnh tháp này.", "eng": "The enemy positions could be taken in from the tower."}, {"viet": "Của cải ruộng đất là thuộc về quyền thừa kế của người con cả.", "eng": "The estate is the birthright of the oldest son."}, {"viet": "Sự hết hạn của thẻ tín dụng.", "eng": "The expiry of a credit card."}, {"viet": "Gia đình bắt đầu tan rã.", "eng": "The family is starting to disintegrate."}, {"viet": "Một số ít ngôi nhà chúng tôi đã xem đang ở trong tình trạng kinh khủng.", "eng": "The few houses we has seen are in terrible condition."}, {"viet": "Quyết định cuối cùng tuỳ thuộc vào Tổng thống.", "eng": "The final decision rests with the President."}, {"viet": "Hãng đã đền đáp lại sự chăm chỉ trong công việc của cô ấy bằng một khoản tiền thưởng.", "eng": "The firm repaid her hard work with a bonus."}, {"viet": "Tia sáng của chiếc đèn pin rọi vào mọi ngóc ngách của gian phòng.", "eng": "The flashlight's beam scanned every corner of the room."}, {"viet": "Dự báo thời tiết thông báo là có nắng và mưa rào rải rác.", "eng": "The forecast said there would be sunny intervals and showers."}, {"viet": "Những chi tiết đầy đủ của hiệp định chưa được công bố.", "eng": "The full details of the agreement have not yet been made public."}, {"viet": "Cổng không đủ rộng để đánh xe.", "eng": "The gate isn't wide enough to get the car through."}, {"viet": "Sự bóng mượt trên mái tóc của ai.", "eng": "The gloss on somebody's hair."}, {"viet": "Chính phủ tước bỏ các đặc quyền của ông ta.", "eng": "The government curtails him of his privileges."}, {"viet": "Chính phủ giữ giá cao một cách giả tạo.", "eng": "The government keeps prices artificially high."}, {"viet": "Hơn nữa tầng vỏ xám bề ngoài có nhiều nếp nhăn.", "eng": "The gray covering, moreover, is much folded."}, {"viet": "Người khách trọ than phiền về các dịch vụ của khách sạn.", "eng": "The guest complains about hotel services."}, {"viet": "Thầy hiệu trưởng thường làm người làm chứng nhận cho học sinh của mình.", "eng": "The head teacher often acts as a referee for his pupils."}, {"viet": "Một hình thức diễn xuất hết sức cổ truyền trong kịch nghệ Nhật Bản.", "eng": "The highly stylized form of acting in Japanese theatre."}, {"viet": "Miếng kim loại nóng co lại khi nguội đi.", "eng": "The hot metal contracts as it cools."}, {"viet": "Ngôi nhà ở trên núi chỉ có thể đi bộ đến được thôi.", "eng": "The house on the mountain is approachable only on foot."}, {"viet": "Những tư tưởng đó cũng được diễn đạt bởi những nhà thơ không nổi tiếng ở bên lề phong trào.", "eng": "The ideas are also expressed by minor poets on the periphery of the movement."}, {"viet": "Tác động của mặt trăng đối với thuỷ triều.", "eng": "The influence of the moon on the tides."}, {"viet": "Bọn xâm lược đã thắng dân bản xứ.", "eng": "The invaders prevailed over the native population."}, {"viet": "Cuộc hành trình qua phía bên kia đảo bằng đường bộ nhanh hơn đường thủy.", "eng": "The journey to the far side of the island is quicker by land than by sea."}, {"viet": "Bọn trẻ luôn đòi tôi đồ chơi.", "eng": "The kids are always nagging me for toys."}, {"viet": "Ấu trùng nở ra và sinh sống ở dưới đất.", "eng": "The larvae hatch and make their way underground."}, {"viet": "Hợp đồng thuê nhà của tôi chỉ còn giá trị một năm.", "eng": "The lease on my house has only a year to run."}, {"viet": "Màu nhạt sẽ làm cho căn phòng thêm thoáng và rộng rãi hơn.", "eng": "The light color will make the room look more open and larger."}, {"viet": "Đi bộ đường dài đã làm tôi ăn ngon miệng.", "eng": "The long walk has given me a good appetite."}, {"viet": "Nhà ảo thuật làm bọn trẻ con say mê.", "eng": "The magician held the children spellbound."}, {"viet": "Ông giám đốc cố gắng phân phối đều việc cho những người làm công.", "eng": "The manager tried to even out the distribution of work among his employees."}, {"viet": "Bữa ăn này chắc là mỗi chúng ta phải trả 15 pao.", "eng": "The meal is likely to set us back 15 pounds each."}, {"viet": "Những người này đã bị kết tội gây huyên náo.", "eng": "The men were charged with causing an affray."}, {"viet": "Sự mất hy vọng, sự thất bại của kế hoạch, v. v.", "eng": "The miscarriage of one's hopes, schemes, etc."}, {"viet": "Những thành viên nhanh nhẹn hơn trong đoàn đã leo lên đỉnh núi đá.", "eng": "The more agile members of the party climbed to the top of the rock."}, {"viet": "Cuốn phim đó chán đến tột độ.", "eng": "The movie was boring to the max."}, {"viet": "Nhu cầu của một đứa trẻ sơ sinh đơn giản.", "eng": "The needs of very small baby are simple."}, {"viet": "Vị lãnh đạo mới tác động bất ngờ đến tinh thần chúng tôi.", "eng": "The new leader had a galvanic effect on our morale."}, {"viet": "Hệ thống vũ khí mới vẫn trong giai đoạn nghiên cứu.", "eng": "The new weapons system is still in the research phase."}, {"viet": "The nick'là một từ tiếng lóng của nhà tù.", "eng": "The nick'is a slang term for'prison'."}, {"viet": "Con số khách du lịch bắt đầu ít đi vào tháng mười.", "eng": "The number of tourists starts to tail off in October."}, {"viet": "Tiểu sử chính thức của công chúa.", "eng": "The official biography of the princess."}, {"viet": "Những cư dân già nhất của đảo.", "eng": "The oldest inhabitants of the island."}, {"viet": "Lý do nó vắng mặt bề ngoài là ốm nhưng ai cũng biết nó đã đi xem một trận bóng đá.", "eng": "The ostensible reason for his absence was illness, but everyone knew he'd gone to a football match."}, {"viet": "Báo chí đã thực sự đưa tin rất đầy đủ về đám cưới hoàng gia.", "eng": "The papers have really gone to town on the royal wedding."}, {"viet": "Cảnh thương tâm của trẻ em đói khát.", "eng": "The pathetic sight of starving children."}, {"viet": "Nhân dân muốn hòa bình với bất cứ giá nào.", "eng": "The people wanted peace at any price."}, {"viet": "Bức tranh này không thẳng, phải nâng phía trái lên.", "eng": "The picture is not straight, you must move the left side up."}, {"viet": "Kế hoạch này đã bị loại bỏ: không có tiền.", "eng": "The plan is a dead duck: there's no money."}, {"viet": "Vở kịch được nhiều bài phê bình trên báo chí.", "eng": "The play got rave reviews in the papers."}, {"viet": "Cảnh sát đang điều tra một đầu mối quan trọng mới.", "eng": "The police are investigating an important new lead."}, {"viet": "Người báo tin cho cảnh sát đòi được giấu tên.", "eng": "The police informant insisted on anonymity."}, {"viet": "Người cảnh sát bảo đám đông di chuyển lên.", "eng": "The policeman told the crowds to move along."}, {"viet": "Truy tặng huân chương anh dũng.", "eng": "The posthumous award of a medal for bravery."}, {"viet": "Bài nói của Tổng Thống được truyền hình trực tiếp.", "eng": "The President's speech was broadcast live."}, {"viet": "Giá nhà hầu như tăng gấp đôi trong mấy năm qua.", "eng": "The price of houses has virtually doubled over the past few years."}, {"viet": "Tên tù đi tới đi lui trong xà lim.", "eng": "The prisoner paced the floor of his cell."}, {"viet": "Chương trình điểm lại những sự kiện quan trọng nhất của năm 2000.", "eng": "The programme reviews the most important events of 2000."}, {"viet": "Cưỡng bức để có thể tin là một cuộc chiến tranh hạt nhân vẫn có thể sống nổi.", "eng": "The public continues to be brainwashed in to believing that a nuclear war could be survived."}, {"viet": "Nữ hoàng được các nữ tỳ của Người hầu hạ.", "eng": "The Queen was attended by her ladies-in-waiting."}, {"viet": "Loại ban là triệu chứng của bệnh sởi.", "eng": "The rash that is a symptom of measles."}, {"viet": "Những người ty nạn đang được cấp chỗ ở tạm trong trại lính cũ.", "eng": "The refugees are being lodged in an old army camp."}, {"viet": "Cách giải quyết một vấn đề, câu hỏi, khó khăn, nghi ngờ, v. v.", "eng": "The resolution of a problem, question, difficulty, doubt, etc."}, {"viet": "Quyền của mỗi công dân kháng nghị lên toà án cao hơn được công nhận trong hiến pháp.", "eng": "The right of individuals to appeal to a higher court is provided for in the constitution."}, {"viet": "Con đường đã bị chặn lại nên chúng tôi phải đi vòng qua cánh đồng.", "eng": "The road was blocked so we had to come round by the fields."}, {"viet": "Những bông hồng được bày tạo ấn tượng đẹp trong một chiếc bình xanh.", "eng": "The roses were displayed to advantage in a blue vase."}, {"viet": "Lương sẽ tới 40 ngàn đô la một năm.", "eng": "The salary will be up to forty thousand dollars a year."}, {"viet": "Trường này đã đào tạo được một vài học giả cự phách.", "eng": "The school has turned out some first-rate scholars."}, {"viet": "Sự cách ly tù chính trị khỏi thường phạm.", "eng": "The segregation of political from common criminals."}, {"viet": "Chỉ riêng khối lượng tác phẩm âm nhạc đồ sộ của Mozart đã là phi thường.", "eng": "The sheer bulk of Mozart's music is extraordinary."}, {"viet": "Cái áo sơ mi bị hỏng trong quá trình giặt.", "eng": "The shirt was damaged during the washing process."}, {"viet": "Đường ngắm của súng phải trên cùng một đường thẳng với mục tiêu.", "eng": "The sights of the gun must be in alignment with the target."}, {"viet": "Nhánh cây đu đưa chầm chậm trong gió.", "eng": "The slow seesaw of the branch in the wind."}, {"viet": "Những người lính chấp hành lệnh của viên đại uý.", "eng": "The soldiers executed the captains orders."}, {"viet": "Diễn giả cứ lải nhải, không biết đến nỗi ngán ngẩm của người nghe.", "eng": "The speaker ground on, oblivious of his listeners'boredom."}, {"viet": "Kiểu tiêu chuẩn của loại ôtô này.", "eng": "The standard version of this car."}, {"viet": "Cơn bão làm tiêu tan kế hoạch liên hoan ngoài trời của chúng tôi.", "eng": "The storm upset our plans for a party outside."}, {"viet": "Tác dụng buồn tẻ của công việc không bao giờ thay đổi.", "eng": "The stultifying effect of work that never varies."}, {"viet": "Chứng cứ bất ngờ đã tạo lợi thế cho anh ta.", "eng": "The surprise witness was his trump card."}, {"viet": "Cô giáo có tình cảm rất tốt đối với các sinh viên của cô.", "eng": "The teacher has a very good relationship with her students."}, {"viet": "Vô tuyến không xem được, có phải dây nối bị hỏng không?", "eng": "The television is not working, is there a loose connection?"}, {"viet": "Bọn trộm đã phá cửa đột nhập vào toà nhà.", "eng": "The thieves had forced an entry into the building."}, {"viet": "Đỉnh núi bị mây bao phủ.", "eng": "The top of the mountain was covered in cloud."}, {"viet": "Tàu bị chậm do băng đóng trên đường sắt.", "eng": "The train was delayed because of ice on the line."}, {"viet": "Ý nghĩa sâu sắc thực sự về lời dạy của Chúa Giê-su.", "eng": "The true inwardness of Christ's teaching."}, {"viet": "Trong cuộc tranh luận hai bên vẫn khác ý kiến nhau về vấn đề tiền lương.", "eng": "The two sides in the dispute still differ over the question of pay."}, {"viet": "Bộ máy quan liêu rườm rà của nhà nước tập quyền.", "eng": "The unwieldy bureaucracy of centralized government."}, {"viet": "Ngôi làng nằm trong một thung lũng bình yên giữa những ngọn đồi.", "eng": "The village lay in peaceful basin surrounded by hills."}, {"viet": "Hào nước phải nhảy qua là phần khó nhất của cuộc đua.", "eng": "The water-jump is the most difficult part of the race."}, {"viet": "Cả đất nước ở dưới gót giày của quân ngoại bang.", "eng": "The whole country was under the heel of a foreign army."}, {"viet": "Loại chó xù đoạt giải ở cuộc triển lãm chó là một con vật nhỏ.", "eng": "The winning poodle at the dog show was a toy."}, {"viet": "Các hoạt động của Thị trường chứng khoán vượt khỏi phạm vi hiểu biết của nhiều người.", "eng": "The workings of the Stock Exchange are beyond most people's ken."}, {"viet": "Cuộc tình của họ đã không trở thành một mối quan hệ tình cảm lâu bền.", "eng": "Their affair did not develop into a lasting relationship."}, {"viet": "Chuyện tình của họ kết thúc có hậu.", "eng": "Their love affair had a storybook ending."}, {"viet": "Rồi chúng ta đã xem hòa nhạc sau bữa ăn trưa.", "eng": "Then after lunch we had the band concert."}, {"viet": "Có một ao thả vịt ở giữa làng.", "eng": "There's a duck pond in the middle of the village."}, {"viet": "Hành vi của nó chẳng ra thể thống gì.", "eng": "There's neither rhyme nor reason in his behaviour."}, {"viet": "Có vấn đề gì đó với cái máy giặt.", "eng": "There's something the matter with the washing machine."}, {"viet": "Có nhiều loại phó-mát.", "eng": "There are many kinds of cheese."}, {"viet": "Có những lúc tôi phân vân tại sao tôi làm nghề này.", "eng": "There are times when I wonder why I do this job."}, {"viet": "Có số dư 40 đô la Mỹ còn sót trong số tiền gửi của tôi.", "eng": "There is a balance of forty US dollars left in my deposit book."}, {"viet": "Và có một bức tượng khác sau bình phong đó.", "eng": "There is another statue behind that screen."}, {"viet": "Bây giờ ở trong làng không còn hiệu thợ cạo nữa.", "eng": "There isn't a barber in the village anymore."}, {"viet": "Có một sự yên lặng đầy ý nghĩa trước khi cô ấy trả lời câu hỏi của tôi.", "eng": "There was a pregnant pause before she answered my question."}, {"viet": "Không hề có một dấu hiệu nào của sự sống ở nơi đây.", "eng": "There wasn't a sign of life in the place."}, {"viet": "À anh đấy rồi, tôi đã đợi anh hơn một tiếng đồng hồ.", "eng": "There you are, I've been waiting for over an hour."}, {"viet": "Những bản mẫu khai này của chính phủ đầy những chữ rắc rối, tôi không tài nào hiểu hết được.", "eng": "These government forms are full of such mumbo-jumbo, I can't understand them at all."}, {"viet": "Các kiểu này có thể được sửa lại cho hợp với thị hiếu cá nhân.", "eng": "These styles can be adapted to suit individual tastes."}, {"viet": "Họ đang đọc bản rút gọn tiểu thuyết của bà ấy trên radio.", "eng": "They've been reading an abridgement of her novel on the radio."}, {"viet": "Mỗi một đêm và mỗi một ngày dài 12 giờ.", "eng": "They are each 12 hours long."}, {"viet": "Họ đã mua một máy mới để in áp phích.", "eng": "They bought a new machine to print the posters."}, {"viet": "Họ phủ chỗ hổng của tường bằng những phím.", "eng": "They covered the opening in the walls with frets."}, {"viet": "Họ ngỡ là chúng tôi tức giận nhưng chúng tôi đã quyết định giữ bình tĩnh.", "eng": "They expected us to be angry, but we had decided to play it cool."}, {"viet": "Họ phải lội đến đầu gối trong bùn và đống mảnh vụn để đến chỗ các nạn nhân.", "eng": "They had to wade knee-deep through mud and debris to reach the victims."}, {"viet": "Cuối cùng họ không chỉ phải xin lỗi mà còn sẵn sàng trả tiền.", "eng": "They landed up not only having to apologize but also offering to pay."}, {"viet": "Họ phải sửa chữa những cái khách hàng đổi vá bán chúng đi.", "eng": "They must fix up the trade-ins and sell them."}, {"viet": "Họ bán phiếu chi thương nghiệp hôm qua đã có được 50000 đô la.", "eng": "They raised $ 50, 000 yesterday selling commercial paper."}, {"viet": "Họ thúc đẩy anh ta thực hiện tính ích kỉ.", "eng": "They shocked him into realizing his selfishness."}, {"viet": "Ở đây, họ sử dụng đồng hồ 24 giờ.", "eng": "They use the twenty-four hour clock here."}, {"viet": "Họ quyết tâm thúc nhanh vụ kiện của họ lên cấp cao nhất.", "eng": "They were determined to press their case at the highest level."}, {"viet": "Họ đã rút lui những lời phản đối với thái độ vui vẻ nhất mà họ có thể bày tỏ.", "eng": "They withdrew their objections with as good a grace as they could manage."}, {"viet": "Hoá đơn này bao gồm tiền phòng, tiền ăn và thức ăn nhẹ, phí dịch vụ, phí điện tín, phí điện thoại đường dài, tiền thức uống và tiền giặt ủi.", "eng": "This bill covers hotel accommodations, meals and refreshments, service charges, cables, long-distance calls, drinks and laundry."}, {"viet": "Đất nước này khó lòng mà tiến lên được.", "eng": "This country's really going to the dogs."}, {"viet": "Thức ăn này cung cấp mọi chất bổ mà con chó của anh cần.", "eng": "This food provides all the nutrition your dog needs."}, {"viet": "Đây là ông Dodd thuộc hội Tempo Choral.", "eng": "This is Mr. Dodd of the Tempo Choral Society."}, {"viet": "Đảo này là nơi lí tưởng cho những người nghiên cứu về chim.", "eng": "This land is a paradise for bird-watchers."}, {"viet": "Cái bàn Pháp cổ này là một món đồ rất có giá trị.", "eng": "This old French table is a very valuable piece of furniture."}, {"viet": "Việc nghiên cứu này chỉ lặp lại công việc đã làm ở nơi khác.", "eng": "This research merely duplicates work already done elsewhere."}, {"viet": "Loại thuế này được ban hành không thể không làm thiệt hại đến nền kinh tế.", "eng": "This tax cannot be introduced without detriment to the economy."}, {"viet": "Bộ quần áo bà ấy mặc quá trẻ đối với bà ấy.", "eng": "Those clothes she's wearing are much too young for her."}, {"viet": "Ngày nay các đồ vật xinh đẹp mà người Trung Quốc chế tạo ra từ vải lụa, giấy, đồ sứ, đồ đồng, ngọc thạch, và những thứ tương tự đều được bày bán trong các cửa hàng ở nhiều nơi.", "eng": "Today, beautiful things the Chinese have made of silk, paper, porcelain, bronze, jade, and the like are sold in shops in many lands."}, {"viet": "Xe lửa có xu hướng bị trễ khi có sương mù.", "eng": "Trains are subject to delays When there is fog."}, {"viet": "Cách đây rất lâu, tổ tiên chúng ta đã cảm thấy cần phải có các đồ đựng để chứa nước và thực phẩm.", "eng": "Very long ago our ancestors felt the need of containers for water and food."}, {"viet": "Tất cả chúng tôi đã chen chúc nhau kéo vào phòng khách bé nhỏ của Harriet.", "eng": "We'd all crowded into Harriet's small sitting-room."}, {"viet": "Ở trên gác xép này chúng tôi có hơi bị tù túng.", "eng": "We're a bit cramped, for space in this attic."}, {"viet": "Chúng tôi dự kiến thăm nước Pháp mùa hè này.", "eng": "We're planning to visit France this summer."}, {"viet": "Chúng tôi đã có quá đủ những lời nói mĩ miều của anh rồi!", "eng": "We've had enough of your fine speeches!"}, {"viet": "Chúng tôi đi thong thả trên phố nhìn vào các cửa hàng.", "eng": "We ambled along the street looking in shop windows."}, {"viet": "Trước hết chúng tôi sẽ sử dụng chất này theo cách thực nghiệm.", "eng": "We are using the substance experimentally at first."}, {"viet": "Chúng tôi không thể nhận thêm việc được nữa-lúc này chúng tôi đã làm việc cật lực rồi.", "eng": "We can't take on any more work-we're fully stretched at the moment."}, {"viet": "Chúng tôi đóng cửa lúc sáu giờ trừ thứ năm đến tám giờ.", "eng": "We close at six, except for late-night shopping on Thursday."}, {"viet": "Hôm nay chúng tôi sẽ không làm xong công việc nhưng chúng tôi sẽ thực hiện giai đoạn khởi công.", "eng": "We don't finish the job today but we'll have made a start."}, {"viet": "Chúng tôi cúng tiền vào quỹ trùng tu nhà thờ.", "eng": "We gave money to the church restoration fund."}, {"viet": "Chúng tôi đã phải nghe một bài nói dài dòng về cái hại của rượu chè!", "eng": "We had to listen to a peroration on the evils of drink!"}, {"viet": "Chúng tôi không có manh mối gì về việc sau khi rời nhà cô ta đi đâu.", "eng": "We have no clue as to where she went after she left home."}, {"viet": "Chúng tôi có ý định biểu lộ sự không tán thành của chúng tôi đối với đám cưới.", "eng": "We intend to express our disapproval of the marriage."}, {"viet": "Chúng tôi ăn trưa với thịt nguội và rau trộn dầu giấm.", "eng": "We lunched on cold meat and salad."}, {"viet": "Chúng tôi phải chắc chắn rằng họ sẽ gửi tiền cho chúng ta trước tháng sáu.", "eng": "We must make certain that they will send us money before June."}, {"viet": "Chúng ta chỉ kịp có thời gian để đóng gói vài thứ cần thiết.", "eng": "We only had time to pack a few essentials."}, {"viet": "Chúng tôi trở về sớm và bắt quả tang bọn trộm đang lục lọi các tủ.", "eng": "We returned early and surprised the burglars searching through the cupboards."}, {"viet": "Chúng tôi sống một ngày dễ chịu ở nông thôn.", "eng": "We spent a pleasant day in the country."}, {"viet": "Chúng ta phải lên xe lửa ở thềm ga số.", "eng": "We've got to get on board from Platform."}, {"viet": "Chúng ta được khoản đãi do ông chủ bút trả tiền.", "eng": "We were entertained at the editor's expense."}, {"viet": "Chúng tôi sẽ đóng gói hàng trong thùng gỗ lớn có lót bông, gia cố bằng dây đai kim loại và bọc kim loại ở từng góc thùng.", "eng": "We will pack the goods in a padded wooden crate reinforced with metal straps and metal angles at each corner."}, {"viet": "Vậy, đô la Mỹ của bà đây.", "eng": "Well, here are the US dollars."}, {"viet": "Ờ, bây giờ chúng ta không thể làm gì được nữa, cô ấy thở dài.", "eng": "Well, there nothing we can do about it now, she sighed."}, {"viet": "Anh đang dùng cuộn phim có độ nhạy thế nào?", "eng": "What's the speed of the film you're using?"}, {"viet": "Những người kia đang làm gì dưới đó vậy?", "eng": "What are those people doing down there?"}, {"viet": "Ý anh như thế nào khi đưa tôi cái phiếu này?", "eng": "What do you mean by giving me this slip?"}, {"viet": "5 pao tương đương với bao nhiêu đồng franc Pháp?", "eng": "What is 5 pounds equivalent to in French francs?"}, {"viet": "Anh đánh giá tình hình thế nào?", "eng": "What is your assessment of the situation?"}, {"viet": "Cái gì đã gây ra một phản ứng giận dữ như thế?", "eng": "What occasioned such an angry response?"}, {"viet": "Vở kịch của bạn bắt đầu lúc mấy giờ?", "eng": "What time does your play start?"}, {"viet": "Làng này có điện từ bao giờ?", "eng": "When did the village first get electricity?"}, {"viet": "Khi tôi cần khuyên bảo, anh ấy là một người bạn tận tình và thông cảm.", "eng": "When I need advice, he is a helpful and sensitive friend."}, {"viet": "Khi con chó tiến công tôi, tôi đã tự vệ bằng một cái gậy.", "eng": "When the dog attacked me, I defended myself with a stick."}, {"viet": "Khi nào thì người ta trang trí xong nhà tắm?", "eng": "When will they finish the decoration of the bathroom?"}, {"viet": "Thưa ông, ông từ nước nào đến?", "eng": "Where do you come from, sir?"}, {"viet": "Bạn thích xem cái nào hơn?", "eng": "Which do you prefer to see?"}, {"viet": "Trong lúc anh bị nhiễm sốt phát ban này, anh vẫn còn dễ lây sang người khác.", "eng": "While you have this rash you are still infectious."}, {"viet": "Ai thường chăm sóc người lớn tuổi khi họ cần giúp đỡ?", "eng": "Who usually cares for elderly people when they require help?"}, {"viet": "Tại sao bạn không bán chiếc xe của bạn trước đã, thay vì đổi nó cho cửa hang?", "eng": "Why don't you sell your car first instead of trading it in?"}, {"viet": "Liệu đề nghị này của chính phủ có được công chúng chấp nhận không?", "eng": "Will this government proposal commend itself to the public?"}, {"viet": "William Smith, một bàn dành cho hai người vào lúc 8 giờ tối mai.", "eng": "William Smith, a table for two at 8: 00 tomorrow evening."}, {"viet": "Với thuốc đánh bóng này, anh có thể làm cho gỗ rất bóng láng.", "eng": "With this polish you can give a good high gloss to the wood."}, {"viet": "Ông có thể thông báo tên các vị khách khi họ tới không?", "eng": "Would you announce the guests as they come in?"}, {"viet": "Bà có muốn gọi món gì khác không?", "eng": "Would you like to order something else?"}, {"viet": "Không hạ cố chào người đầy tớ ra mở cửa.", "eng": "Wouldn't deign to greet the servant who opened the door."}, {"viet": "Vâng, tôi rất vui được giúp ông.", "eng": "Yes, I'd be happy to help you."}, {"viet": "Anh mà bỏ qua một cơ hội như thế này thì anh là một thằng ngu.", "eng": "You'd be a fool to ignore a chance like that."}, {"viet": "Anh cần phải về số thấp hơn khi lao lên quả đồi này.", "eng": "You'll need to change into a lower gear when going up this hill."}, {"viet": "Theo hồ sơ của chúng tôi, anh đã vào tù sáu lần rồi.", "eng": "You've been in prison six times according to our records."}, {"viet": "Cậu hãy nhúng những quả hạnh này vào nước sôi để bóc vỏ.", "eng": "You blanch almonds to remove their skins."}, {"viet": "Bây giờ đang chạy nhanh hơn, anh có thể cài số cao hơn.", "eng": "You can change into a higher gear now you're going faster."}, {"viet": "Ông có thể đi bộ từ trạm xe buýt đến đó.", "eng": "You can walk there from the bus depot."}, {"viet": "Cậu làm tôi sợ quá, tôi không hề biết rằng cậu ở trong nhà.", "eng": "You gave me a scare, I didn't know you were in the house."}, {"viet": "Bạn chỉ việc xếp hàng và nói cho họ biết bạn muốn dùng gì, và họ sẽ đưa thức ăn cho bạn.", "eng": "You just line up and tell them what you want, and they'll give it to you."}, {"viet": "Ý cô là khi đi cắm trại à?", "eng": "You mean when you're camping?"}, {"viet": "Anh phải cố gắng giữ bình tĩnh-gia đình anh phụ thuộc vào anh.", "eng": "You must try to pull yourself together-your family depend on you."}, {"viet": "Dường như cậu đang có chút bực bội với chiếc xe hơi của cậu-mình có thể giúp được không?", "eng": "You seem to be having a spot of bother with your car-can I help?"}, {"viet": "Anh không nên buộc tội bừa bãi mà không có chứng cớ.", "eng": "You shouldn't make wild accusation without any evidence."}, {"viet": "Chẳng bao lâu nữa ông sẽ có nước nóng.", "eng": "You will have hot water soon."}, {"viet": "Bạn bè của anh là niềm an ủi lớn đối với tôi.", "eng": "Your company has been a great consolation to me."}, {"viet": "Chỗ ngồi của ông ta ở phía trước của máy bay.", "eng": "Your seat's in the fore part of the aircraft."}]