[{"viet": "Một quán rượu cấm quân nhân vào.", "eng": "A bar that is off-limits to troops."}, {"viet": "Một số phần trăm tiền lương của bạn được ông chủ của bạn giữ lại để trả bảo hiểm.", "eng": "A certain percentage of your salary is kept back by your employer as an insurance."}, {"viet": "Một công ty có thành tích kém.", "eng": "A company with a poor track record."}, {"viet": "Một dụng cụ tinh xảo dùng để tách hạt.", "eng": "A cunning device for cracking nuts."}, {"viet": "Một thầy thuốc không thể từ chối chữa một người đang hấp hối.", "eng": "A doctor cannot turn away a dying man."}, {"viet": "Có một số ghế còn trống.", "eng": "A few of the seats were empty."}, {"viet": "Một phương pháp mới để giải quyết khó khăn.", "eng": "A fresh approach to the difficulty."}, {"viet": "Một bộ trong chính phủ do những người vô danh tiểu tốt, điều hành.", "eng": "A government department run by little grey men."}, {"viet": "Một hàng rào khán giả dọc theo lề đường hè phố.", "eng": "A hedge of spectators along the pavement."}, {"viet": "Một ca canh gác sợ hãi trong bóng tối.", "eng": "A jittery vigil in the dark."}, {"viet": "Một chiếc cặp da có rập nổi chữ tắt tên của ai.", "eng": "A leather briefcase embossed with one's initials."}, {"viet": "Nhiều tàu bè trên thế giới đi qua eo biển Măngsơ.", "eng": "A lot of the world's shipping passes through the English Channel."}, {"viet": "Một mê lộ dẫn đến chỗ chết.", "eng": "A maze of narrow alleys leads down to the sea."}, {"viet": "Một nhạc sĩ có kỹ năng chuyên môn điêu luyện nhưng không nhiều truyền cảm.", "eng": "A musician with great technical skill but not much feeling."}, {"viet": "Một số vụ trộm đào ngạch đã xảy ra ở khu vực này gần đây.", "eng": "A number of burglaries have been committed in this area recently."}, {"viet": "Người bị khai là có tội cố tình nói dối trước tòa có thể bị tống giam.", "eng": "A person found guilty of perjury might be sent to prison."}, {"viet": "Một chính sách thối nát tận trong ruột.", "eng": "A policy that is rotten to the core."}, {"viet": "Một đề nghị hợp nhất hai công ty.", "eng": "A proposal for uniting the two companies."}, {"viet": "Một nghị quyết đưa ra là các điều kiện phải được cải thiện.", "eng": "A resolution that conditions should be improved."}, {"viet": "Một thước tỷ lệ một phần triệu.", "eng": "A scale of one to a million."}, {"viet": "Một cửa hàng có bán trái cây, quần áo, đồ điện.", "eng": "A shop that sells fruit, clothes, electrical goods."}, {"viet": "Một nhà xã hội học nghiên cứu cách thức phức tạp mà con người tiếp xúc với nhau ở các bữa tiệc.", "eng": "A sociologist studying the complex way in which people interact with each other at parties."}, {"viet": "Một cẩm nang hướng dẫn từng bước một.", "eng": "A step-by-step instruction manual."}, {"viet": "Một cái bàn dát bằng một lớp đồng.", "eng": "A table covered with a copper overlay."}, {"viet": "Một dịch vụ xe lửa không hoạt động được.", "eng": "A train service that is inoperative."}, {"viet": "Một kho hàng với mặt tiền có đường thủy lưu thông thuận tiện.", "eng": "A warehouse with good river frontage."}, {"viet": "Một thanh niên cứ bám theo tôi trong bữa tiệc mà tôi không cách nào dứt ra khỏi hắn được.", "eng": "A young man attached himself to me at the party and I couldn't get rid of him."}, {"viet": "Những diễn viên phải học thuộc vĩ bạch của họ cũng như phải thuộc lời thoại của họ.", "eng": "Actors have to learn their cues as well as their own lines."}, {"viet": "Sau khi tắm bằng vòi hoa sen, bạn sẽ cảm thấy tỉnh người lại.", "eng": "After a shower bath you will feel refreshed."}, {"viet": "Sau khi bàn nhiều về việc đi nghỉ ở nước ngoài, chúng tôi quyết định đến Cornwall.", "eng": "After much discussion about holidays abroad we ended up in Cornwall."}, {"viet": "Sau ba năm ở đây anh đủ tiêu chuẩn được lên lương.", "eng": "After three years here you'll qualify for a rise."}, {"viet": "Tất cả đồ cắm trại của anh ta được bỏ vào trong túi ba lô này.", "eng": "All his camping gear was packed in the rucksack."}, {"viet": "Tất cả mọi lá cờ đều rủ.", "eng": "All the flags were flying at half-mast."}, {"viet": "Mặc dù ông ta đã được hầu hết các đại biểu hoan hô nhiệt liệt, nhưng những người chất vấn cánh tả và cái máy nhắc từ xa trục trặc đã làm ông ta đôi lúc lo lắng.", "eng": "Although he was cheered loudly by most delegates, leftist hecklers and a faulty teleprompter gave him some anxious moments."}, {"viet": "Một diễn viên phải có khả năng nhớ được những lời thoại của mình.", "eng": "An actor must be able to memorise his lines."}, {"viet": "Một máy phát điện phụ trong trường hợp mất điện.", "eng": "An auxiliary generator in case of power cuts."}, {"viet": "Một đống giày không đồng bộ.", "eng": "An ill-assorted collection of shoes."}, {"viet": "Một cây cổ thụ có chu vi 6 bộ.", "eng": "An old tree that was six feet around."}, {"viet": "Cô ta nói thêm, và đừng có tới muộn.", "eng": "And don't be late, she added."}, {"viet": "Một điều quan trọng khác bạn phải biết qua là mặc dù có nhóm nhà hát chuyên nghiệp thường trực, 20.000 nhóm nhà hát không chuyên, 80 đoàn kịch lớn và 1500 dàn nhạc giao hưởng và ít nhất là một trường múa ba lê trong mọi thành phố.", "eng": "Another important fact you should have some idea of is that although there are 70 resident professional theatre groups, 20,000 nonprofessional theatre groups, 80 major opera companies and 1,500 symphony orchestras and at least one ballet school."}, {"viet": "Sợ rằng hắn sẽ bị đánh.", "eng": "Apprehensive that he would be beaten."}, {"viet": "Bạn có được phép hút thuốc ở nơi làm việc không?", "eng": "Are you allowed to smoke in your workplace?"}, {"viet": "Anh có chắc là vụ làm ăn này là ngay thẳng không?", "eng": "Are you sure this deal is on the level?"}, {"viet": "Là đại lý độc quyền của nhiều thương hiệu thiết bị điện tử nổi tiếng, chúng tôi tin chắc rằng chúng tôi có thể đáp ứng các yêu cầu của quý vị.", "eng": "As a sole agent of many well-known brands of electronic appliances, we are confident that we can satisfy your requirements."}, {"viet": "Khi băng bị đẩy về phía nam thì khí hậu ngày càng lạnh.", "eng": "As the ice pushed southward the climate grew colder and colder."}, {"viet": "Lúc đầu không ai để ý sự mất tích của đứa bé.", "eng": "At first nobody noticed the child's disappearance."}, {"viet": "Tấn công các vị trí tên lửa của địch.", "eng": "Attacking the enemy's missile installation."}, {"viet": "Về cơ bản, tôi muốn biết vấn đề này có phải là vấn đề phổ biến hay không?", "eng": "Basically, I wanted to know whether this problem is a general one or not?"}, {"viet": "Hãy kiên nhẫn, rồi sẽ đến lúc cậu được thăng chức.", "eng": "Be patient, you will be promoted in the course of time."}, {"viet": "Chúng đã chết trước khi hết tuần.", "eng": "Before the week was out, they were dead."}, {"viet": "Thỉnh thoảng Billy bị nôn mửa sau khi uống rượu quá nhiều.", "eng": "Billy sometimes pukes after drinking too much."}, {"viet": "Bánh mì được nướng trong lò.", "eng": "Bread is baked in an oven."}, {"viet": "Va đầu của ai vào trần.", "eng": "Bump one's head on the ceiling."}, {"viet": "Tôi không cần những cuốn sách mang tính tưởng tượng và những cuốn đại loại như thế.", "eng": "But is you mean fancy descriptions and such, I don't need it."}, {"viet": "Nhưng thật sự bạn không cần phải vậy.", "eng": "But you really didn't need to."}, {"viet": "À này, tôi có thể sao chụp tài liệu ở đâu?", "eng": "By the way, where can I copy some material?"}, {"viet": "Tôi có thể tham gia trò chơi chứ?", "eng": "Can I join in the game?"}, {"viet": "Anh vui lòng giải thích lễ hội powwow có ý nghĩa như thế nào đối với người da đỏ hiện đại?", "eng": "Can you explain what powwow means to modern Indians?"}, {"viet": "Bạn có thể xoay sở được đủ tiền để đi nghỉ mát không?", "eng": "Can you scrape up enough money for a holiday?"}, {"viet": "Sự đối chiếu kỹ càng hai kế hoạch cho thấy vài chỗ khác nhau quan trọng.", "eng": "Careful contrast of the two plans shows up some key differences."}, {"viet": "Những tiếng hoan hô chào mừng Hoàng hậu tới nơi.", "eng": "Cheers greeted the arrival of the Queen."}, {"viet": "Bưu điện thành phố nằm ở gần nhà thờ.", "eng": "City's post-office is near by the Church."}, {"viet": "Hãy đến vào lúc 8 giờ trừ phi tôi gọi điện.", "eng": "Come at 8 o'clock unless I phone."}, {"viet": "Cách cư xử không thích hợp với một sĩ quan và một người quí phái.", "eng": "Conduct unbecoming to an officer and a gentleman."}, {"viet": "Bông là một trong những sản phẩm chính của Ai Cập.", "eng": "Cotton is one of Egypt's staples."}, {"viet": "Vui lòng nhắc tôi khi chúng ta đến Liverpool nhé?", "eng": "Could you remind me when we get to Liverpool?"}, {"viet": "Khuy măng-sét chỉ bán từng cặp.", "eng": "Cuff-links are only sold in pairs."}, {"viet": "Quyết định không đổi công việc của mình.", "eng": "Decide against changing one's job."}, {"viet": "Dù nghèo, ông ta vẫn không bán đồ nữ trang của gia đình.", "eng": "Despite his poverty, he refused to part with the family jewels."}, {"viet": "Bạn có khó khăn gì khi tìm nhà của chúng tôi không?", "eng": "Did you have any problems finding our house?"}, {"viet": "Những khám phá đã được các nhà khoa học thế kỉ trước truyền lại cho chúng ta.", "eng": "Discoveries bequeathed to us by scientists of the last century."}, {"viet": "Những nhà công tác xã hội có làm được nhiều điều có lợi không?", "eng": "Do social workers do a lot of good?"}, {"viet": "Bạn có ăn nhiều rau củ không?", "eng": "Do you eat a lot of vegetables?"}, {"viet": "Anh có món gì nhẹ để bắt đầu bữa ăn không?", "eng": "Do you have anything light to start the meal with?"}, {"viet": "Bạn có thích Hoàng Gia không?", "eng": "Do you like the Royal family?"}, {"viet": "Bạn còn tiếp tục học tiếng Tây Ban Nha không?", "eng": "Do you still keep up your Spanish?"}, {"viet": "Anh muốn lấy tiền giấy hay tiền đồng?", "eng": "Do you want the money in notes or coins?"}, {"viet": "Chính phủ nước bạn có cấp bảo hiểm thất nghiệp không?", "eng": "Does your government provide unemployment insurance?"}, {"viet": "Đừng có tự hạ thấp mình bằng những lời dối trá trắng trợn như thế.", "eng": "Don't demean yourself by telling such obvious lies."}, {"viet": "Anh đừng có để bị nó trêu tức!", "eng": "Don't let him get under your skin!"}, {"viet": "Đừng gọi điện lâu như vậy.", "eng": "Don't stay on the phone long."}, {"viet": "Bạn có nhìn thấy chiếc cầu hình chữ chi màu đỏ ở đằng kia không?", "eng": "Don't you see that red zigzag bridge over there?"}, {"viet": "Trong cơn bệnh cô ta đã bị sốt mê sảng.", "eng": "During her illness she had feverish dreams."}, {"viet": "Các đồ điện bán với bản chỉ dẫn cách sử dụng bằng nhiều thứ tiếng.", "eng": "Electrical goods sold with multilingual operating instructions."}, {"viet": "Bà Eva đã cám dỗ ông Adam và ông đã phạm tội.", "eng": "Eve tempted Adam and he fell."}, {"viet": "Mọi việc đồng thời xảy ra dẫn đến một kết quả thành công.", "eng": "Everything concurred to produce a successful result."}, {"viet": "Những vật trưng bày trong viện bảo tàng thường được đặt trong các tủ kính.", "eng": "Exhibits in museums are often displayed in glass cases."}, {"viet": "Chúng tôi có thể nhìn thấy những ánh đèn của thủ đô Luân Đôn xa tít phía dưới máy bay.", "eng": "Far below the plane we could see the lights of London."}, {"viet": "Năm mươi nghìn người đã xem trận đấu đó.", "eng": "Fifty thousand people saw the match."}, {"viet": "Nghề đánh cá vẫn là ngành công nghiệp chính ở đó.", "eng": "Fishing is still the main industry there."}, {"viet": "Bóng đá là một môn say mê đối với Bill.", "eng": "Football is like a religion for Bill."}, {"viet": "Chính sách thuê các công ty khác tiếp nối quy trình sản xuất khiến chúng tôi cho ra được những mặt hàng giá hạ hơn.", "eng": "Forward integration will allow us to produce goods more cheaply."}, {"viet": "Mẹ kiếp! Liệu có một cái máy phát hiện sự hoảng sợ, tựa như máy phát hiện khói, đánh hơi được sự lo lắng trong không khí không?", "eng": "Gadzooks! Is there a panic detector, akin to a smoke detector, that sniffs anxiety in the air?"}, {"viet": "Được một số thư trả lời cho một mục quảng cáo.", "eng": "Get several replies to an advertisement."}, {"viet": "Đánh thật bóng sàn nhà đó.", "eng": "Give the floor a thorough polish."}, {"viet": "Đã qua rồi những ngày mà bạn có thể mua xuất ăn ba món không đến giá 1 bảng Anh.", "eng": "Gone are the days when you could buy a three-course meal for under £ 1."}, {"viet": "Tập cho quen với khí hậu lạnh.", "eng": "Habituate oneself to a cold climate."}, {"viet": "Những lời nói hấp tấp rồi sẽ sớm hối tiếc.", "eng": "Hasty words that are soon regretted."}, {"viet": "Bạn có bao giờ đi lặn có bình khí nén ở dãy đá ngầm Great Barrier chưa?", "eng": "Have you ever gone scuba-diving in the Great Barrier Reef?"}, {"viet": "Anh đã ghi cả địa chỉ của anh lẫn địa chỉ của anh ấy vào rối chứ?", "eng": "Have you put both your address and his?"}, {"viet": "Có thể nó sẽ trả lời không, tuy vậy vẫn cứ nên thử xem.", "eng": "He'll probably say no, though it's worth trying."}, {"viet": "Anh ta cũng thông minh như cô ta: chẳng kém một chút nào.", "eng": "He's as clever as she is: every bit as."}, {"viet": "Anh ta có một quan niệm về tình bạn khá là lạ lùng.", "eng": "He's got a pretty strange conception of friendship."}, {"viet": "Ông ấy chỉ đi vắng trong từng thời gian ngắn-lâu nhất là một tuần thôi.", "eng": "He's only away for short periods-a week at the longest."}, {"viet": "Ông ta rất đúng giờ-bao giờ cũng đến đúng giờ đã định.", "eng": "He's very punctual-always arrives on the dot."}, {"viet": "Ông ấy nộp đơn xin việc qua hệ thống thông thường.", "eng": "He applied for the job through the regular channels."}, {"viet": "Ông ta đã mua cái đó hoàn toàn có tính cách đầu tư.", "eng": "He bought it purely as an investment."}, {"viet": "Anh ấy không biết đọc mà cũng không biết viết.", "eng": "He can't read or write."}, {"viet": "Anh ấy có thể biết cô ấy đang ở trong một tâm trạng bực bội, và cố gắng trêu cho cô ấy cười.", "eng": "He could tell she was in a bad mood, and tried to laugh her out of it."}, {"viet": "Ông ấy không đánh giá cao sự hài hước của tình huống đó.", "eng": "He didn't appreciate the comedy of the situation."}, {"viet": "Anh ấy phát bóng vào chỗ đất gồ ghề.", "eng": "He drives the ball into the rough."}, {"viet": "Anh ta ngã từ trên bờ vách đá.", "eng": "He fell off the edge of the cliff."}, {"viet": "Anh ấy cho tiền những người ăn xin trên đường phố.", "eng": "He gave alms to beggars in the street."}, {"viet": "Hắn vướng vào chuyện rắc rối với cảnh sát khi hắn còn đi học kìa!", "eng": "He got into trouble with the police while he was still at school!"}, {"viet": "Anh ta cầu hôn mà không thành, đã hai lần rồi.", "eng": "He had proposed marriage, unsuccessfully, twice already."}, {"viet": "Hắn có cái thói quen khó chịu là sau mỗi câu nói đều có câu Anh biết chứ?", "eng": "He has an annoying trick of saying You know? after every sentence?"}, {"viet": "Anh ấy đã bắt đầu cuộc hải trình từ Southampton đến New York.", "eng": "He has sailed from Southampton for New York."}, {"viet": "Ông ta giam mình trong một căn phòng nhỏ để khỏi bị quấy rầy trong lúc làm việc.", "eng": "He immured himself in a small room to work undisturbed."}, {"viet": "Quan điểm của ông ta chỉ là một quan điểm của người không chuyên môn về y học.", "eng": "He is just a layman's view of medicine."}, {"viet": "Anh ta chắc chắn là cầu thủ giỏi hơn.", "eng": "He is without dispute the better player."}, {"viet": "Anh ta bỏ đi ngay sau khi anh ta nghe tin ấy.", "eng": "He left as soon as he heard the news."}, {"viet": "Hắn ta trông như thể hắn không có lấy một bữa ăn no trong nhiều tháng trời.", "eng": "He looks as though he hasn't a square meal for months."}, {"viet": "Hắn quyết tâm đấy: nếu chúng ta có ý trốn hắn sẽ bắn ngay.", "eng": "He means business: he really will shoot us if we try to escape."}, {"viet": "Ông ta mua chiếc du thuyền đó chỉ để chứng tỏ mình giàu có-ông ta ghét đi thuyền.", "eng": "He only bought the yacht as a status symbol-he hates sailing."}, {"viet": "Anh ta giữ thăng bằng cây lao trong tay trước khi phóng đi.", "eng": "He poised the javelin in his hand before throwing it."}, {"viet": "Ông ấy nút tai lại vì tiếng ồn quá inh ỏi.", "eng": "He put plugs in his ears because the noise was too loud."}, {"viet": "Ông ta đề cập đến công việc của anh bằng những lời lẽ quá khen ngợi.", "eng": "He referred to your work in terms of high praise."}, {"viet": "Cậu bé chạy nhanh hơn người anh rất nhiều.", "eng": "He runs far faster than his brother."}, {"viet": "Ông ta đòi 80 bảng tiền thuê căn hộ một tháng.", "eng": "He's asking £ 80 a month rent for that flat."}, {"viet": "Anh ta dễ trở nên lười biếng.", "eng": "He's inclined to be lazy."}, {"viet": "Là một người già mà ông cụ sung sức kỳ lạ.", "eng": "He's surprisingly spring for an old man."}, {"viet": "Nó đã liều cả mạng sống để cứu đứa bé đó.", "eng": "He saved the child at considerable risk to himself."}, {"viet": "Cậu ấy ngả người thoải mái xuống ghế sô pha để xem TV.", "eng": "He settled himself on the sofa to watch TV."}, {"viet": "Nó đánh mạnh quả bóng bay vào khán đài.", "eng": "He smote the ball into the grandstand."}, {"viet": "Nó hoàn toàn bối rối nhìn chằm chằm vào các từ.", "eng": "He stared at the words in complete puzzlement."}, {"viet": "Ông ta đã thành công trong việc gợi lên thiện cảm của dân tộc.", "eng": "He succeeded in arousing the nation's sympathy."}, {"viet": "Nó nghĩ nó lừa được tôi nhưng tôi đã biết tỏng nó rồi.", "eng": "He thought, he could fool me but I got wise to him."}, {"viet": "Ông ta đâm ra ham thích làm vườn khi về hưu.", "eng": "He took to gardening in his retirement."}, {"viet": "Anh ta nhăn mặt cười nhe răng ra.", "eng": "He twisted his face into a grin."}, {"viet": "Nó cần có can đảm để nói lên sự thật.", "eng": "He wants the courage to speak the truth."}, {"viet": "Cậu ta hết sức ngạc nhiên khi nghe tin mình đã được nhận vào làm cái việc ấy.", "eng": "He was astonished to hear he had got the job."}, {"viet": "Anh ta hoàn toàn không còn biết xấu hổ là gì nữa.", "eng": "He was dead to all feelings of shame."}, {"viet": "Hắn ta lãnh hai án tù, thi hành đồng thời.", "eng": "He was given two prison sentences, to run concurrently."}, {"viet": "Anh ta bị cảnh sát bắt quả tang đang chạy xe quá tốc độ.", "eng": "He was nabbed by the police for speeding."}, {"viet": "Anh ta chịu trách nhiệm xác nhận những tấm hình.", "eng": "He was responsible for authenticating the photographs."}, {"viet": "Anh ấy là đội trưởng đội bóng đá trong năm năm.", "eng": "He was the captain of the football team for five years."}, {"viet": "Ông ta đeo một chiếc nhẫn ở ngón giữa.", "eng": "He wears a ring on his middle finger."}, {"viet": "Ông ấy muốn biết ông ấy có thể mua ngân phiếu du lịch ở ngân hàng đó không?", "eng": "He wishes to know if he can buy traveler's cheques from the bank?"}, {"viet": "Ông ấy viết từ đó lên bảng và một số sinh viên tự động chép vào vở ghi của họ.", "eng": "He wrote the word on the board and some of the students automatically wrote it down in their notebooks."}, {"viet": "Những hành động và những lời hứa của nàng trái ngược hẳn với nhau.", "eng": "Her actions and her promises contrasted sharply."}, {"viet": "Vẻ khả ái của bà ta đã làm ảnh hưởng các bồi thẩm viên thiên về phía bà ta.", "eng": "Her charms prejudiced the judges in her favour."}, {"viet": "Khuỷu tay của cô ta tì lên bàn.", "eng": "Her elbows rested on the table."}, {"viet": "Sự giàu kinh nghiệm hơn của cô ta đã làm cho cán cân nghiêng về phía mình và cô đã giành được việc làm đó.", "eng": "Her greater experience tipped the balance in her favour and she got the job."}, {"viet": "Hành vi vô trách nhiệm của cô ta đã làm cho bố cô phải nhiều đêm mất ngủ.", "eng": "Her irresponsible behaviour cost her father many sleepless nights."}, {"viet": "Tên của cô ta đã bị gạch bỏ trên bảng đen.", "eng": "Her name had been scored out on the blackboard."}, {"viet": "Những quan điểm chính trị của bà ấy không thái quá.", "eng": "Her political ideas are fairly middle-of-the-road."}, {"viet": "Tài năng biểu diễn nhạc của cô ấy vượt quá sự khen ngợi.", "eng": "Her skill as a musician is beyond praise."}, {"viet": "Nỗi sầu não tột độ của cô ta khi nghe tin dữ.", "eng": "Her utter desolation when she heard the bad news."}, {"viet": "Đây là biên nhận và thẻ ngân hàng của ông.", "eng": "Here's your receipt and your passcard."}, {"viet": "Diện mạo của anh ta không một chút hấp dẫn.", "eng": "His appearance is not at all prepossessing."}, {"viet": "Công việc làm ăn của anh ta thua lỗ, anh ta đã thế chấp tất cả tài sản của mình để cố gắng cứu nó.", "eng": "His business is failing, he's mortaged all his assets to try to save it."}, {"viet": "Cái chết của ông ta đã đánh dấu sự kết thúc của một kỷ nguyên.", "eng": "His dead marked the end of an era."}, {"viet": "Mặt anh ta bừng bừng vì giận.", "eng": "His face was ablaze with anger."}, {"viet": "Những lời phỏng đoán của ông ấy đều trật cả.", "eng": "His guesses were all very wide of the mark."}, {"viet": "Sự phán đoán của ông ta không bị thành kiến cá nhân chi phối.", "eng": "His judgement was uncoloured by personal prejudice."}, {"viet": "Tính tình của anh ta đột nhiên thay đổi và anh ta trở nên trầm tĩnh.", "eng": "His mood suddenly changed and he became calm."}, {"viet": "Màn trình diễn của anh ấy không hề có ai tương đương.", "eng": "His performance has never been paralleled."}, {"viet": "Câu trả lời của anh ta hòa nhã và điềm đạm.", "eng": "His reply was soft and calm."}, {"viet": "Câu chuyện của anh ta là một loạt những điều dối trá.", "eng": "His story is a tissue of lies."}, {"viet": "Những hành động bạo lực của anh ấy không phù hợp với những lời lẽ ôn hoà của anh ta.", "eng": "His violent actions do not accord with his peaceful words."}, {"viet": "Xin hãy cầm máy, tôi sẽ nối máy cho ông ngay ( với cô Jones ).", "eng": "Hold on, I'll just connect you ( with Miss Jones )."}, {"viet": "Sau nhiều giờ đào bới, chúng tôi bắt đầu làm chậm lại một chút.", "eng": "Hours of digging, we began to slacken up a little."}, {"viet": "Chúng ta làm sao tách nó khỏi những đứa bạn của nó được?", "eng": "How can we wean him away from his companions?"}, {"viet": "Truyện tranh của Nhật và truyện tranh của nước bạn khác nhau như thế nào?", "eng": "How do Japanese comics and ones from your country differ?"}, {"viet": "Công việc của ông tiến triển như thế nào?", "eng": "How is your business coming along?"}, {"viet": "Có bao nhiêu nước giáp ranh với Thụy Điển?", "eng": "How many countries borders Switzerland?"}, {"viet": "Những quả táo ở phía sau kia kìa giá bao nhiêu?", "eng": "How much are those apples at the back?"}, {"viet": "Bạn xem tivi thường xuyên không?", "eng": "How often do you watch TV?"}, {"viet": "Hàng trăm người bị đưa vào cảnh thất nghiệp.", "eng": "Hundreds were thrown out of work."}, {"viet": "Tôi muốn mời bạn đến dự tiệc của nhà tôi.", "eng": "I'd like to invite you to a party at my house."}, {"viet": "Tôi sẽ gọi điện để yêu cầu họ gọi điện cho bạn.", "eng": "I'll call and ask them to give you a call."}, {"viet": "Tôi cuộc với anh 5 pao là cô ta sẽ không đến.", "eng": "I'll lay you 5 pounds that she won't come."}, {"viet": "Tôi sẽ viết mấy lời cảm ơn cô ấy về bữa tiệc.", "eng": "I'll write a note to thank her for the party."}, {"viet": "Tôi đang soạn một bản phúc đáp chính thức cho lá thư đó.", "eng": "I'm composing a formal reply to the letter."}, {"viet": "Tôi đang đi đến cửa hàng để mua một ít trái cây.", "eng": "I'm going to the store to buy some fruit."}, {"viet": "Tôi sẽ không đến đó nữa-họ bắt tôi trả một pao một tách cà phê!", "eng": "I'm not going there again-they charged 1 pound for a cup of coffee!"}, {"viet": "Tôi cũng thuộc loại chuyên gia về đồ cổ.", "eng": "I'm something of an expert on antiques."}, {"viet": "Tôi lấy làm ngạc nhiên sao anh ta lại lấy vợ vội vàng như thế-anh ta vốn là người khá thận trọng.", "eng": "I'm surprised he got married in such a hurry-he's usually pretty circumspect."}, {"viet": "Tôi vốn khao khát được đi thăm nước Úc.", "eng": "I've always had a yen to visit Australia."}, {"viet": "Tôi đã làm một số tính toán trung bình để đạt được những số liệu này.", "eng": "I've done some averaging to reach these figures."}, {"viet": "Tôi vừa mới đánh vỡ một trong các đồ trang trí bằng sứ của chị.", "eng": "I've just dropped one of your china ornaments."}, {"viet": "Tôi bỗng nhiên thấy thích đọc truyện trinh thám.", "eng": "I've suddenly taken a fancy to detective stories."}, {"viet": "Tôi luôn luôn đi xưng tội vào những ngày thứ Sáu.", "eng": "I always go to confession on Fridays."}, {"viet": "Tôi đang suy nghĩ xem đáp ứng thế nào đây.", "eng": "I am pondering how to respond."}, {"viet": "Tôi đã yêu cầu bốn giám đốc khu vực thực hiện hai việc.", "eng": "I asked the four regional managers to do two things."}, {"viet": "Lúc đi ra tôi đâm sầm phải hắn.", "eng": "I bumped into him on the way out."}, {"viet": "Tôi đâu có thể đã thấy ma-đó hẳn là do tôi tưởng tượng.", "eng": "I can't have seen the ghost-it must have been imagination."}, {"viet": "Anh cứ lởn vởn quanh tôi thế này tôi không thể làm việc được.", "eng": "I can't work with you hovering over me like that."}, {"viet": "Tôi không thể hiểu nổi sao anh lại có thể ngu ngốc như vậy.", "eng": "I cannot comprehend how you could have been so stupid."}, {"viet": "Tôi đột nhiên nhìn thấy tên cướp chạy ra khỏi nhà băng.", "eng": "I caught sight of the robber running out of the bank."}, {"viet": "Tôi không thể ngủ được vì cháu bé la hét mãi không thôi.", "eng": "I couldn't sleep because the baby wouldn't stop bawling."}, {"viet": "Tôi không dám tới đó vì sợ ông ta trông thấy tôi.", "eng": "I dare not go there for fear of him seeing me."}, {"viet": "Tôi không cố ý bắt bạn phải chờ tôi đâu.", "eng": "I didn't mean to make you wait on me."}, {"viet": "Tôi không biết phải bắt đầu công việc này như thế nào.", "eng": "I don't know how to set about this job."}, {"viet": "Tôi thấy sửa một cái ô tô cũ như thế này chẳng để làm gì cả.", "eng": "I don't see the point of repairing a car as old as this one."}, {"viet": "Tôi không cần những anh chàng trẻ tuổi tham vọng, tôi cần sự khôn ngoan và suy nghĩ.", "eng": "I don't want to hire some young fireball, i need wisdom and thoughtfulness."}, {"viet": "Tôi không nghĩ là tôi sẽ đi làm.", "eng": "I don't think I'll go to work."}, {"viet": "Tôi cảm thấy hơi khó chịu sau bữa ăn tối ngày hôm qua.", "eng": "I feel a little bilious after last night's dinner."}, {"viet": "Tôi cứ nghĩ là anh không đến.", "eng": "I figure that you wouldn't come."}, {"viet": "Tôi đưa cho anh ta một bản tường thuật tóm lược vì không có thì giờ nói mọi điều với anh ta.", "eng": "I gave him an abbreviated account, as there wasn't time to tell him everything."}, {"viet": "Tôi chắc điều đó là khiếm nhã ở đất nước bạn, nhưng ở nước tôi chuyện đó rất là bình thường.", "eng": "I guess it's rude in your country, but it's as natural as breathing in mine."}, {"viet": "Tôi đã có vinh dự được nghe tên ông vài lần ngoài ra, tôi đã đọc tác phẩm của ông viết về Trung Quốc bằng tiếng Anh.", "eng": "I had the honour of hearing your name on several occasions, and besides, I have read your book on Chinese philosophy in English."}, {"viet": "Tôi bị đau ở phía bên trái.", "eng": "I have a pain in my left side."}, {"viet": "Tôi chưa có kế hoạch rõ ràng cho ngày mai.", "eng": "I have no definite plans for tomorrow."}, {"viet": "Tôi phải dọn mọi thứ ra khỏi đây.", "eng": "I have to move everything out of here."}, {"viet": "Tôi đã không gặp anh ta hơn một năm rồi.", "eng": "I haven't seen him for a year or two."}, {"viet": "Tôi hy vọng tôi đã không nói quá dài dòng.", "eng": "I hope I didn't speak too long."}, {"viet": "Tôi yêu cầu ông rút lại ngay lập tức những nhận xét xúc phạm ấy đi.", "eng": "I insist that you withdraw your offensive remarks immediately."}, {"viet": "Tôi biết mình cần phải đến nha sĩ nhưng tôi đang hoãn cái ngày khó chịu ấy càng lâu càng tốt.", "eng": "I know I need to go to the dentist but I've been putting off the evil day as long as possible."}, {"viet": "Tôi thích gặp những người này.", "eng": "I like meeting all these people."}, {"viet": "Hai giờ nữa tôi sẽ gọi điện lại.", "eng": "I'll call back in a couple of hours."}, {"viet": "Tôi sẽ mướn một hộp nhỏ.", "eng": "I'll rent a small one."}, {"viet": "Tôi e rằng tôi không phải là nhà tiên tri thời tiết.", "eng": "I'm afraid I'm not weather prophet."}, {"viet": "Tôi gặp rắc rối khi cài đặt nó.", "eng": "I'm having problems installing it."}, {"viet": "Tôi buồn đến nỗi tôi muốn phát khóc.", "eng": "I'm so unhappy I could weep."}, {"viet": "Tôi đã xoay xở để kiếm được hai vé xem hoà nhạc.", "eng": "I managed to acquire two tickets for the concert."}, {"viet": "Tôi chắc đã hiểu sai ý điều anh muốn nói.", "eng": "I must have mistaken What you meant."}, {"viet": "Tôi vẫn còn cần anh; khoan đi đã.", "eng": "I need you still; don't go yet."}, {"viet": "Lẽ ra tôi bán được xe giá cao hơn nhưng tôi không phải là người thông thạo giá cả.", "eng": "I ought to have to get a better price for the car but I'm not a very good businessman."}, {"viet": "Tôi thắc mắc không biết anh ta có đáng tin cậy không.", "eng": "I query whether he can be trusted."}, {"viet": "Tôi xin giới thiệu vụ làm ăn này nhưng cũng có một số điều hạn chế.", "eng": "I recommend the deal, but with certain caveats."}, {"viet": "Tối hôm qua tôi thức khuya.", "eng": "I sat up late last night."}, {"viet": "Tôi sẽ liên lạc với ông điện thoại.", "eng": "I shall contact you by telephone."}, {"viet": "Tôi đã bán chiếc xe ôtô của mình cho người bạn được 750 bảng Anh.", "eng": "I sold my car to a friend for £ 750."}, {"viet": "Tôi ngờ rằng, à không, còn hơn thế nữa, tôi chắc chắn là nó đã sai.", "eng": "I suspect, nay, I am certain, that he is wrong."}, {"viet": "Tôi nghĩ chắc tôi phải làm cô ấy sửng sất bởi vì cô ấy nhìn quanh như có lỗi khi tôi gọi tên cô ấy.", "eng": "I think I must have caught her unawares because she looked round, guiltily when I called her name."}, {"viet": "Tôi nghĩ cuối cùng chúng tôi đã tìm được một giải pháp có thể được mọi người chấp nhập.", "eng": "I think we've at last found a solution that is acceptable to everyone."}, {"viet": "Tôi đã mắng lũ trẻ vì chúng làm ồn quá.", "eng": "I told the boys off for making so much noise."}, {"viet": "Tôi biết là hãng của cô cũng có vé dành cho cán bộ điều hành nữa.", "eng": "I understand that you have an executive section, too."}, {"viet": "Tôi muốn việc đó được làm càng nhanh càng tốt.", "eng": "I want it done as quickly as possible."}, {"viet": "Tôi muốn đi du lịch tới vài nơi nào khác.", "eng": "I want to take a trip to some place different."}, {"viet": "Ý nghĩ phải xa lìa gia đình đã ngăn cản tôi di cư.", "eng": "I was deterred from emigrating by the thought of leaving my family."}, {"viet": "Tôi sắp bị phá sản, nhưng khoản tiền anh cho vay đã cứu nguy cho tôi.", "eng": "I was nearly bankrupt, but your loan saved my bacon."}, {"viet": "Tôi là cầu thủ ném bóng già nhất vẫn còn chơi đấy.", "eng": "I was the oldest pitcher playing."}, {"viet": "Tôi sẽ đến ngay khi có thể được.", "eng": "I will come as soon as I possibly can."}, {"viet": "Tôi loạng choạng mất một hai bước, rồi sụm xuống.", "eng": "I wobbled uncertainly for a couple of paces, then over I went."}, {"viet": "Tôi làm từ trái sang phải, anh ấy làm ngược lại.", "eng": "I work from left to right, he works contrariwise."}, {"viet": "Tôi muốn gửi những đồ có giá trị của tôi vào trong két sắt.", "eng": "I would like to put my valuables in the safe deposit box."}, {"viet": "Chính tôi đã viết cuốn sách thế mà bây giờ cô ta lại tìm cách xí phần thành công của nó bằng cách bảo rằng cô ta đã gợi ý cho tôi.", "eng": "I wrote the book, and now she's trying to muscle in on its success by saying she gave me the ideas."}, {"viet": "Nếu tôi đã nói điều đó một lần thì tức là tôi đã nói một trăm lần.", "eng": "If I've said it once, I've said it a hundred times."}, {"viet": "Nếu cô ta được nhận vào làm việc đó thì đó là một thất bại lớn đối với Peter: anh ta không còn hy vọng được làm việc đó nữa.", "eng": "If she gets the job, that's one in the eye for Peter: he was desperate to get it."}, {"viet": "Nếu chúng ta đứng ở đầu gió, con mồi sẽ đánh hơi được.", "eng": "If we are upwind of the animal, it may smell our scent."}, {"viet": "Nếu anh không thể cư xử một cách lễ độ thì anh nên đi đi.", "eng": "If you can't behave civilly, you'd better leave."}, {"viet": "Nếu như ông chỉ nghĩ đến người khác một chút thôi, ông đã không nói như vậy.", "eng": "If you had only the least thought for others you would not have spoken out in that way."}, {"viet": "Nếu anh nghĩ thế thì anh nhầm lẫn hoàn toàn rồi.", "eng": "If you think that, you're barking up the wrong tree altogether."}, {"viet": "Những việc quan trọng đáng được ta chú ý.", "eng": "Important matter's claiming one's attention."}, {"viet": "Vì tôn trọng chủ nhà, tôi đã quyết định không tranh cãi những nhận xét có thể còn phải bàn luận của ông ta.", "eng": "In deference to our host I decided not to challenge his controversial remarks."}, {"viet": "Đối với nhiều cuốn sách, các tay sách được đóng lại bằng máy.", "eng": "In many books the signatures are then sewed together on special machines."}, {"viet": "Nếu vậy thì chúng mình ở nhà thôi.", "eng": "In that case let's stay at home."}, {"viet": "Về mùa hè, những du khách lũ lượt kéo đến các nhà bảo tàng và phòng trưng bày tranh tượng mỹ thuật.", "eng": "In the summer, tourists flock to the museums and art galleries."}, {"viet": "Thật ra tôi rất vui mừng được giúp đỡ.", "eng": "Indeed, I am delighted to help."}, {"viet": "Ông ấy có được sinh viên ưa thích không?", "eng": "Is he popular with the students?"}, {"viet": "Đã có phương thuốc nào chữa được bệnh ung thư chưa?", "eng": "Is there a certain cure for cancer yet?"}, {"viet": "Đây là lần đầu tiên ông đến Bắc Kinh phải không, thưa ông Smith?", "eng": "Is this your first time in Beijing, Mr. Smith?"}, {"viet": "Thật sự rắc rối khi đổi tiền mặt đô la Mỹ lúc sân bay đang đông đúc.", "eng": "It's a real problem cashing US dollars when the airport is crowded."}, {"viet": "Đối với phụ nữ, việc ngồi riêng ra là một tục lệ.", "eng": "It's customary for the women to sit apart."}, {"viet": "Biết tình cảm của người khác là điều quan trọng đấy.", "eng": "It's important to know other people's feelings."}, {"viet": "Thật không công bằng khi cô ta là người duy nhất hạnh phúc.", "eng": "It's not fair that she is the only one who's happy."}, {"viet": "Ở vùng quê đây thật yên tĩnh quá.", "eng": "It's so peaceful out here in the country."}, {"viet": "Nóng lắm đấy, vì vậy phải cẩn thận kẻo bị phỏng lưỡi.", "eng": "It's very hot, so be careful not to burn your tongue."}, {"viet": "Hôm nay dường như không đông lắm.", "eng": "It doesn't seem very crowded today."}, {"viet": "Khó mà nắm được ý niệm của không gian vô bờ bến.", "eng": "It is difficult to grasp the concept of infinite space."}, {"viet": "Tuyệt nhiên không thể nào tin được là người ta cho làm những chuyện như thế.", "eng": "It is perfectly monstrous that such a thing should be allowed."}, {"viet": "Anh đi hay ở, điều đó đối với tôi cũng chẳng quan trọng.", "eng": "It makes no odds to me whether you go or stay."}, {"viet": "Nó đúng là thứ tôi cần.", "eng": "It's exactly what I wanted."}, {"viet": "Nỗi đau đớn đó dường như là số phận trong cuộc đời của anh ta.", "eng": "It seemed that suffering was to be his portion in life."}, {"viet": "Phải ba y tá mới giữ được anh ta khi họ tiêm cho anh ta.", "eng": "It took three nurses to hold him down while they gave him the injection."}, {"viet": "Anh không nhận sai lầm là hèn.", "eng": "It was cowardly of you not to admit your mistake."}, {"viet": "Đêm qua trời quả là lạnh-mười độ dưới không.", "eng": "It was really cold last night-ten degrees below zero."}, {"viet": "Cửa hàng sẽ trả một nửa cho chiếc xe mới của tôi.", "eng": "It will pay for half of my new car."}, {"viet": "Jane tính tình hiền dịu, kín đáo.", "eng": "Jane had a gentle retiring disposition."}, {"viet": "Tham gia một cuộc biểu tình, một cuộc diễu hành, đứng vào xếp hàng v. v..", "eng": "Join a demonstration, procession, queue, etc."}, {"viet": "Im mồm thì mày sẽ không sao!", "eng": "Keep quiet and you won't get hurt!"}, {"viet": "Chúng ta hãy liên lạc với tất cả những người liên quan thương vụ này.", "eng": "Let's contact all persons involved in this deal immediately."}, {"viet": "Chúng ta hãy dừng chân uống một ly trên đường đi nhé.", "eng": "Let's stop and get a drink on the way."}, {"viet": "Nhiều nhân tố cản trở sự thành công trong kế hoạch của chúng ta.", "eng": "Many factors militated against the success of our plan."}, {"viet": "Nhiều thanh niên ở Nhật Bản có hai hoặc ba việc làm bán thời gian.", "eng": "Many young people in Japan have two or three part-time jobs."}, {"viet": "Xin cho tôi một ly nước nhé?", "eng": "May I have a glass of water?"}, {"viet": "Có lẽ ông bị mệt sau chuyến đi.", "eng": "Maybe you are tired from the journey."}, {"viet": "Hầu hết sinh viên đang có nhiều tiến bộ nhưng Jeremy dường như là một trường hợp vô vọng.", "eng": "Most of the students are making good progress but Jeremy seems a hopeless case."}, {"viet": "Nhiều chất bổ của thức ăn có thể bị mất trong khi đun nấu.", "eng": "Much of the goodness in food may be lost in cooking."}, {"viet": "Ngón tay tôi tê cóng không cởi được cái nút.", "eng": "My dead fingers could not untie the knot."}, {"viet": "Theo như tin tức của tôi được biết thì tất cả bọn họ đã đi khỏi rồi.", "eng": "My information is that they have all left."}, {"viet": "Cách hiểu của tôi về điều khoản này trong hợp đồng.", "eng": "My reading of this clause in the contract."}, {"viet": "Sự nhiệt tình đầy tinh thần dân tộc trong Giải bóng đá Thế giới.", "eng": "Nationalistic fervour during the World Cup."}, {"viet": "Tuần tới sẽ đặc biệt đáng lo ngại vì chúng ta vừa mất đi người thư ký.", "eng": "Next week will be particularly fraught as we've just lost our secretary."}, {"viet": "Trong giới hạn hai mươi dặm, không được phép đánh cá.", "eng": "No fishing is allowed within a twenty-mile limit."}, {"viet": "Nào, cho tôi vài quả mận khá lớn.", "eng": "Now, let me have some plums that are rather large."}, {"viet": "Những người phản đối kế hoạch làm xa lộ mới.", "eng": "Objectors to the plans for a new motorway."}, {"viet": "Ồ, bạn muốn loại nhà xe lưu động.", "eng": "Oh, you mean a mobile home."}, {"viet": "Cứ theo bề ngoài mà xét, anh ta có thể nói thật, tuy nhiên tôi ngờ rằng anh ta đang giấu điều gì đó.", "eng": "On the face of it, he seems to be telling the truth though I suspect he's hiding something."}, {"viet": "Một trong những điều phàn nàn chính của tôi đối với hội đồng là họ không cho chạy đủ xe buýt.", "eng": "One of my main grouches against the council is that they don't run enough buses."}, {"viet": "Lời kêu gọi giúp đỡ của chúng tôi được đáp lại bằng một sự hưởng ứng lẻ tẻ.", "eng": "Our appeal for help met with a meagre response."}, {"viet": "Hàng của chúng tôi có chất liệu tốt nhất và sự tinh xảo tuyệt vời, còn nói về mẫu mã và độ bền thì không ai sánh bằng.", "eng": "Our goods are of the best materials and excellent workmanship, and are second to none in design and durability."}, {"viet": "Từ năm ngoái, các vấn đề của chúng tôi đã tăng thêm lên.", "eng": "Our problems have multiplied since last year."}, {"viet": "Tràn ngập hạnh phúc, giàu lòng tốt, đầy sự biết ơn, v. v.", "eng": "Overflowing with happiness, kindness, gratitude, etc."}, {"viet": "Số tiền sẽ được trả tương xứng với thời gian bỏ ra để làm công việc đó.", "eng": "Payment will be in proportion to the time spent doing it."}, {"viet": "Có lẽ bạn nên mua một cái mới.", "eng": "Perhaps you should buy a new one."}, {"viet": "Cảnh sát dựng các rào chắn đường trên các tuyến đường dẫn ra ngoài thành phố.", "eng": "Police set up road-blocks on routes leading out of the city."}, {"viet": "Đúng vậy, ký hiệu của đồng là ¥.", "eng": "Right, the symbol for Yuan is ¥."}, {"viet": "Trong lúc xô nhau ra về, nhiều em đã bị đẩy ngã.", "eng": "Several children were pushed over in the rush to leave."}, {"viet": "Bà cụ ấy đã 91 tuổi mà vẫn tráng kiện.", "eng": "She's 91 years old and still going strong."}, {"viet": "Cô ta ngẩn ngơ ( như mất hồn ) suốt ngày-tôi nghĩ là cô ta đang yêu.", "eng": "She's been in a trance all day-I think she's in love."}, {"viet": "Bà ta tán thành sự phá thai theo yêu cầu.", "eng": "She's in favour of abortion on demand."}, {"viet": "Cô ta hoàn toàn không biết ngượng ngập gì về việc ăn mặc hở hang ở nơi làm việc.", "eng": "She's quite shameless about wearing sexy clothes at work."}, {"viet": "Cô ta được phép ở lại đây bất cứ lúc nào cô ta thích.", "eng": "She's welcome to stay here whenever she likes."}, {"viet": "Cô ta tránh né làm việc bằng cách ăn bám những người họ hàng giàu có của mình.", "eng": "She avoided having to work by battening on her rich relatives."}, {"viet": "Bà ta đã chọn khách sạn rẻ tiền nhất.", "eng": "She chose the least expensive of the hotels."}, {"viet": "Cô ta trát đầy son phấn lên mặt.", "eng": "She daubed her face with thick make-up."}, {"viet": "Bà ta không kênh kiệu và không đối xử với chúng tôi như đầy tớ.", "eng": "She doesn't stand on her dignity and treat the rest of us as servants."}, {"viet": "Cô ta tin chắc rằng mình đã làm điều đúng.", "eng": "She felt sure that she had done the right thing."}, {"viet": "Cô ta dạy học tư để có thêm thu nhập.", "eng": "She gives private lessons to supplement her income."}, {"viet": "Bà ta sống một cuộc đời xa hoa và nhiều đặc quyền đặc lợi.", "eng": "She had led a life of luxury and privilege."}, {"viet": "Suốt thời gian tôi bệnh cô ta đã giúp đỡ tôi rất nhiều.", "eng": "She has been very supportive during my illness."}, {"viet": "Cô ta ngập ngừng một chút rồi nói tiếp.", "eng": "She hesitated for a moment, and then went on."}, {"viet": "Cô ấy không những là một ca sĩ nổi tiếng mà còn là một minh tinh màn bạc.", "eng": "She is not only famous singer but also film star."}, {"viet": "Cô ấy hay sừng sộ khi tức giận.", "eng": "She kicks out when she's angry."}, {"viet": "Cô ấy nhìn qua cửa sổ và thấy người đưa thư đang từ con đường đi lên.", "eng": "She looked out of the window and saw the postman coming up the path."}, {"viet": "Bà ta trộn bột mì với nước làm bột nhão.", "eng": "She mixed the flour and water to a paste."}, {"viet": "Cô ấy kiên trì cố gắng để đoạt chức vô địch.", "eng": "She persevered in her efforts to win the championship."}, {"viet": "Cô ta đọc bài thơ nhan đề Cây táo.", "eng": "She read a poem entitled The Apple Tree."}, {"viet": "Cô ta tìm một việc làm trong ngành xuất bản.", "eng": "She's after a job in publishing."}, {"viet": "Cô bé đã qua lứa tuổi chơi búp bê.", "eng": "She's past playing with dolls."}, {"viet": "Cô ấy nói rằng cô sẽ rời khỏi đất nước vĩnh viễn.", "eng": "She says that she's leaving the country for good."}, {"viet": "Cô ấy tránh việc vặt bằng cách nói rằng cô ấy ốm.", "eng": "She shuffled out of the chores by saying she felt ill."}, {"viet": "Cô bé ấy vẫn còn tin vào ông già Nôen và sẽ là tàn nhẫn nếu làm tan vỡ ảo tưởng đó của cô ta.", "eng": "She still believes in Santa Claus and it would be cruel to disillusion her."}, {"viet": "Cô ta có khuynh hướng lảng tránh mọi chuyện bàn luận về chuyện ly hôn của cô ta.", "eng": "She tends to sheer away from any discussion of her divorce."}, {"viet": "Cô ta xoay tay nắm nhưng cửa ra vào vẫn không mở.", "eng": "She turned the handle but the door wouldn't open."}, {"viet": "Cô ta là một kẻ lừa đảo lão luyện và đã lợi dụng bản chất tin người của ông già.", "eng": "She was a practised swindler and took advantage of the old man's confiding nature."}, {"viet": "Cô ấy hoàn toàn chết lặng đi vì cú sốc do cha chết.", "eng": "She was completely numbed by the shock of her father's death."}, {"viet": "Cô ta ở trong trạng thái bị kích động mạnh sau vụ tai nạn.", "eng": "She was in a very overwrought state after the accident."}, {"viet": "Chị ấy bị kiệt sức vì đau buồn sau cái chết của anh ta.", "eng": "She was prostrate with grief after his death."}, {"viet": "Cô ta là trái ngược hẳn ông chồng.", "eng": "She was the perfect antipode to her husband."}, {"viet": "Cô ta ra trường ( Cambridge ) năm 1984.", "eng": "She went down ( from Cambridge ) in 1984."}, {"viet": "Cô ấy đã giành chiến thắng trong cuộc đua và sẽ không ngớt reo mừng ( sự thất bại của các đối thủ ).", "eng": "She won the competition and won't stop crowing ( her rivals'failure )."}, {"viet": "Lấy tay che mắt mình cho khỏi bị chói nắng.", "eng": "Shield one's eyes from the sun with one's hand."}, {"viet": "Các vỉa hè có một lớp tuyết mới phủ rải rác.", "eng": "Sidewalks covered with a dusting of new snow."}, {"viet": "Anh hãy ngồi xuống và kể cho chúng tôi nghe điều gì đã xảy ra.", "eng": "Sit yourself down and tell us what happened."}, {"viet": "Ông Smith đã thắng hai quả giao bóng trong hiệp này.", "eng": "Smith has had two breaks already in this set."}, {"viet": "Nhiều phấn son như vậy vẻ đẹp của cô ta giảm đi.", "eng": "So much make-up takes from her appearance."}, {"viet": "Một vài giống chó chỉ có những cái đuôi phôi thai.", "eng": "Some breeds of dog have only rudimentary tails."}, {"viet": "Một số đã rơi ra khỏi tường.", "eng": "Some of them have fallen off the wall."}, {"viet": "Một người mưu cầu địa vị bằng sự a dua và thái độ quỵ lụy.", "eng": "Some will seek status through renewed acquiescence and Uncle Tomism."}, {"viet": "Xin lỗi, tôi không nghe rõ điều ông nói.", "eng": "Sorry, I didn't quite catch what you said."}, {"viet": "Dùng thìa xúc đường từ gói bỏ vào bát.", "eng": "Spoon sugar from the packet into a bowl."}, {"viet": "Lòng dạ Stephen héo hắt như một bông hoa trên bãi sa mạc cảm thấy cơn gió hanh từ xa đang thổi tới.", "eng": "Stephen's heart had withered up like a flower of the desert that feels the simoom coming from a far."}, {"viet": "Đừng huýt sáo nữa! Bạn đang làm tôi khó chịu!", "eng": "Stop whistling! You're getting on my nerves!"}, {"viet": "Thành công tuỳ thuộc vào việc anh làm việc tích cực như thế nào.", "eng": "Success is dependent on how hard you work."}, {"viet": "Anh biết đấy, đường rất dễ làm béo.", "eng": "Sugar is very fattening, you know."}, {"viet": "Thề trung thành với Đức Vua.", "eng": "Swear an oath of loyalty to the King."}, {"viet": "Đi chiếc taxi đầu trong dãy xe.", "eng": "Take the taxi at the head of the rank."}, {"viet": "Truyền hình phổ biến các chương trình giải trí cho mọi người.", "eng": "Television provides universal entertainment."}, {"viet": "Xin cám ơn về bảng báo giá ngày 11 tháng hai của các ông cho mẫu ví da mới và chúng tôi vui lòng chấp nhận bảng giá của các ông.", "eng": "Thank you for your quotation of February 11 for the new design of leather wallets and we are pleased to accept your offer."}, {"viet": "Vì vậy thỉnh thoảng ông nhận nhiều hơn và thỉnh thoảng ít hơn.", "eng": "That's why sometimes you have more and sometimes less."}, {"viet": "Cô gái sẽ tiến xa, tôi tin chắc như vậy.", "eng": "That girl will go a long way, I'm sure."}, {"viet": "Ông bác giàu có'tưởng tượng mà anh ta khoe khoang.", "eng": "That mythical rich uncle's of whom he boasts."}, {"viet": "Đó là để tôi trả tiền hút thuốc.", "eng": "That's to pay for my cigarettes."}, {"viet": "Đó không phải là một sự lựa chọn từ ngữ rất đắt.", "eng": "That wasn't a very happy choice of words."}, {"viet": "Nhân viên kế toán đã trình bày công việc của anh ta cho bộ phận bán hàng.", "eng": "The accountant described his work to the sales staff."}, {"viet": "Bản hợp đồng ràng buộc cả hai bên.", "eng": "The agreement is binding on both parties."}, {"viet": "Thông báo đó đã dẫn đến những cuộc bạo loạn của dân chúng.", "eng": "The announcement led to violent civil disorders."}, {"viet": "Các đội quân bị sa lầy trong vùng bùn lầy đặc quánh.", "eng": "The armies got bogged down in the thick squelching mud."}, {"viet": "Cuộc tấn công đã xảy ra, không báo trước.", "eng": "The attack occurred without warning."}, {"viet": "Những con chim non ló ra khỏi trứng.", "eng": "The baby birds emerged from their eggs."}, {"viet": "Ngân hàng có thể phát hành một hối phiếu được ký phát ở ngân hang đại lý của họ ở đây tại Thượng Hải.", "eng": "The bank can issue a banker's cheque drawn on their correspondent here in Shanghai."}, {"viet": "Bờ biển đông nghẹt những người dạo chơi ban ngày.", "eng": "The beach was packed with day trippers."}, {"viet": "Sự tích luỹ sinh vật của thuỷ ngân trong cá.", "eng": "The bioaccumulation of mercury in fish."}, {"viet": "Chiếc thuyền đi về phía mấy tảng đá.", "eng": "The boat was heading for some rocks."}, {"viet": "Quyển sách anh đã bỏ mất một ngày tới đây có thể tìm thấy.", "eng": "The book you've lost may turn up one of these days."}, {"viet": "Mấy đứa học sinh chuồn ngay khi chúng thấy vị hiệu trưởng đang đi tới để ngăn chặn sự ồn ào của chúng.", "eng": "The boys made themselves scarce when they saw the principal coming to stop their noise."}, {"viet": "Nhà xây dựng tính 15 giờ công cho việc đó.", "eng": "The builder reckons 15 man-hours for the job."}, {"viet": "Việc buôn bán lụn bại vì làm ăn thua lỗ.", "eng": "The business has been crippled by losses."}, {"viet": "Chiếc xe ô tô dừng hẳn lại ở chỗ đèn giao thông.", "eng": "The car came to a full stop at the traffic lights."}, {"viet": "Chiếc ôtô sẽ không nổ máy sau khi để ở ngoài trời suốt tuần.", "eng": "The car wouldn't start after standing outside all week."}, {"viet": "Những cuộc kỉ niệm làm công chúng không chú ý tới những vấn đề khó khăn của chính phủ.", "eng": "The celebrations distracted public attention from the government's problems."}, {"viet": "Những tàn than của đống lửa trại.", "eng": "The charred remains of the bonfire."}, {"viet": "Đứa trẻ bị vết thương dài và sâu ở đùi vì ngã.", "eng": "The child received a nasty on his leg from a fall."}, {"viet": "Bọn trẻ nằm cuộn tròn lấy nhau trên giường.", "eng": "The children cuddled up to each other in bed."}, {"viet": "Bọn trẻ bị cô lập khi nước thuỷ triều lên.", "eng": "The children were cut off by the incoming tide."}, {"viet": "Thành phố nằm dưới quyền kiểm soát của lực lượng địch.", "eng": "The city is under the control of enemy forces."}, {"viet": "Mây ngưng tụ lại tạo thành tuyết về mùa đông.", "eng": "The clouds precipitate as snow in winter."}, {"viet": "Những lá cờ sặc sỡ làm tăng thêm sự vui mắt cho ngày hội.", "eng": "The colourful flags added to the gaiety of the occasion."}, {"viet": "Công ty đã dành chi phí cho một chiến dịch quảng cáo.", "eng": "The company has committed funds to an advertising campaign."}, {"viet": "Máy vi tính tạo ra những điều kiện giả ở đáy biển.", "eng": "The computer simulates conditions on the sea bed."}, {"viet": "Sự đóng góp tiền cho việc từ thiện.", "eng": "The contribution of money to charity."}, {"viet": "Đất nước có rất nhiều công nhân lành nghề, nhưng lại không đủ việc làm.", "eng": "The country has an abundance of skilled workers, but not enough jobs."}, {"viet": "Vụ đụng xe đó làm đầu xe hơi của tôi bị bẹp.", "eng": "The crash buckled the front of my car."}, {"viet": "Đám đông trở nên cuồng nhiệt vì thích thú.", "eng": "The crowd went wild with delight."}, {"viet": "Con đập không đủ sức ngăn nước lũ.", "eng": "The dam was not strong enough to hold back the flood waters."}, {"viet": "Những người nổi loạn bị thất bại xin cư trú chính trị ở nước khác.", "eng": "The defeated rebels sought political asylum in another country."}, {"viet": "Viên thám tử nấp vào bụi cây.", "eng": "The detective stationed himself among the bushes."}, {"viet": "Nhóm thảo luận họp vào những buổi sáng.", "eng": "The discussion group meets in the mornings."}, {"viet": "Bác sĩ đã ra lệnh cho tôi phải nằm nghỉ.", "eng": "The doctor ordered me to bed."}, {"viet": "Con chó nhảy qua cái vòng một cách tài tình.", "eng": "The dog jumped through the hoop as clean as a whistle."}, {"viet": "Ngăn kéo mở ra đóng vào nhẹ nhàng.", "eng": "The drawers slide in and out easily."}, {"viet": "Trái đất thì gần 25.000 dặm theo chu vi.", "eng": "The earth is almost 25000 miles in circumference."}, {"viet": "Dịch vụ khẩn cấp luôn sẵn sàng giúp đỡ khi cần thiết.", "eng": "The emergency services stand ready to help if necessary."}, {"viet": "Sự tham gia của Mỹ vào nền chính trị thế giới.", "eng": "The entry of the USA into world politics."}, {"viet": "Quyển vở có những trang giấy trắng được xen kẽ với những trang giấy có kẻ hàng.", "eng": "The exercise book has lined pages interleaved with plain ones."}, {"viet": "Các dữ kiện đó có thể được giải thích bằng những cách khác nhau.", "eng": "The facts are susceptible of various interpretations."}, {"viet": "Phong cảnh không có nét phân biệt của thảo nguyên.", "eng": "The featureless landscape of the steppe."}, {"viet": "Phim bắt đầu trở nên rất thô bạo, đúng lúc đó tôi ra về.", "eng": "The film started to get very violent, at which point I left."}, {"viet": "Hãng đó đã đầu tư lớn về thiết bị mới.", "eng": "The firm has made a huge investment in new plant."}, {"viet": "Thứ vải dệt đầu tiên được con người biết cách chế tạo ra có lẽ là vải lanh.", "eng": "The first woven fabric that people learned to make was probably linen."}, {"viet": "Bữa ăn thì ngon và khách khứa cũng tạm được.", "eng": "The food was good and the company tolerable."}, {"viet": "Hai người bạn chia tay nhau Jane về nhà còn Mary thì đi thư viện.", "eng": "The friends parted Jane went home and Mary went to the library."}, {"viet": "Khu vườn đó trải dài đến tận bờ sông.", "eng": "The garden extends to the river bank."}, {"viet": "Cô gái hát một bài khá dài.", "eng": "The girl sang quite a long song."}, {"viet": "Thái độ ngoan cố của chính phủ là một trở ngại cho những cuộc thương lượng tiếp theo.", "eng": "The government's stubborn attitude was a block to further talks."}, {"viet": "Người ta đang chờ chính phủ ra tuyên bố về vụ khủng hoảng.", "eng": "The government is expected to issue a statement about the crisis."}, {"viet": "Những nhịp cong thật là đẹp của chiếc cầu mới.", "eng": "The graceful curves of the new bridge."}, {"viet": "Nhóm người đứng xem chẳng bao lâu đã thành một đám đông.", "eng": "The group of on lookers soon swelled into a crowd."}, {"viet": "Tóc gáy tôi dựng đứng khi tôi nghe thấy tiếng thét đó.", "eng": "The hair on the back of my neck rose when I heard the scream."}, {"viet": "Lúc này những con gà mái đó không đẻ sai lắm.", "eng": "The hens are not laying well at the moment."}, {"viet": "Tối nay những con ngựa bồn chồn, chắc chó sói ở đâu đó.", "eng": "The horses me restive tonight, there must be wolves about."}, {"viet": "Căn nhà trống rỗng không có ai sống ở đó.", "eng": "The house is empty, none is living there."}, {"viet": "Túp lều đã bị lũ cuốn phăng đi.", "eng": "The hut was swept away by the flood."}, {"viet": "Mục lục chỉ cho người đọc tìm những trang về phần bài vở.", "eng": "The index refers the reader to pages in the text."}, {"viet": "Quyền lợi của hai nước đối chọi nhau.", "eng": "The interests of the two countries collide."}, {"viet": "Công việc dường như không thể hoàn tất được trong vòng một năm.", "eng": "The job is unlikely to be finished inside of a year."}, {"viet": "Chỉ phần nhân còn lại, hoặc mảnh hạt.", "eng": "The kernels, or nibs, are left."}, {"viet": "Mảnh đất dốc thoai thoải xuống phía nam.", "eng": "The land dips down gently to the south."}, {"viet": "Vị luật sư đã giải thích những điểm pháp lý cho thân chủ của ông ta.", "eng": "The lawyer explained the legal technicalities to his client."}, {"viet": "Đảng Tự do muốn thay đổi chế độ bầu cử.", "eng": "The Liberals wish to bring about changes in the electoral system."}, {"viet": "Dân địa phương xem loại cua này như một món đặc sản.", "eng": "The local people regard these crabs as a great delicacy."}, {"viet": "Xa lộ 62 và xa lộ 1 nối liền lại với nhau ở phía nam Leeds.", "eng": "The M62 and M1 join up south of Leeds."}, {"viet": "Người đàn ông giận tím mặt.", "eng": "The man's face was puce with rage."}, {"viet": "Vấn đề không cấp thiết lắm, có thể hoãn lại đến cuộc họp sau.", "eng": "The matter can wait until the next meeting, it's not urgent."}, {"viet": "Cuộc họp sẽ khai mạc lúc chín giờ.", "eng": "The meeting will begin at nine."}, {"viet": "Ông bộ trưởng phản công những người phê bình ông bằng một bài diễn văn hùng hồn bệnh vực các chính sách của ông.", "eng": "The minister countered his critics with a strong speech defending his policies."}, {"viet": "Con khỉ đu cành bằng cái đuôi quấn của nó.", "eng": "The monkey was hanging from the branch by its prehensile tail."}, {"viet": "Từ ngôi làng này có thể nhìn thấy rõ những đỉnh núi đó.", "eng": "The mountain tops are plainly visible from the village."}, {"viet": "Quốc hội họp để bàn về cơn khủng hoảng này.", "eng": "The national assembly has met to discuss the crisis."}, {"viet": "Bộ phim mới chiếu ở rạp là bộ phim hài hay, vì thế chúng tôi được một mẻ cười ra trò.", "eng": "The new film being shown at the cinema is a good comedy, so we had a good laugh."}, {"viet": "Người giám đốc bán hàng mới quả là một người đàn bà kinh khủng.", "eng": "The new sale director is quite a formidable lady."}, {"viet": "Báo tường thuật nhận xét của ông ấy, làm phương hại đến cơ may đắc cử của ông ta.", "eng": "The newspaper reported his remarks, to the prejudice of his chances of being elected."}, {"viet": "Cuốn tiểu thuyết được cho là do một máy tính viết.", "eng": "The novel was allegedly written by a computer."}, {"viet": "Cơ quan đang xôn xao đồn đãi lung tung.", "eng": "The office is buzzing with rumours."}, {"viet": "Ông già đang hút cái tẩu của mình.", "eng": "The old man was sucking at his pipe."}, {"viet": "Dàn nhạc đã có kế hoạch biểu diễn vài buổi hoà nhạc.", "eng": "The orchestra has several concert engagements."}, {"viet": "Bức tranh là tác phẩm của một môn đồ của Rembrandt.", "eng": "The painting is the work of a pupil of Rembrandt."}, {"viet": "Buổi liên hoan đó đã được tổ chức mà cô ta không biết gì cả.", "eng": "The party was organized without her knowing anything about it."}, {"viet": "Nhân dân đang bị chế độ quân sự đàn áp và xấu xa áp bức.", "eng": "The people are held down by a vicious and repressive military regime."}, {"viet": "Máy sao chụp bận suốt sáng nay.", "eng": "The photocopier has been busy all morning."}, {"viet": "Nơi đó toả ra ám khí của tội lỗi.", "eng": "The place gave off a strong emanation of evil."}, {"viet": "Những cái cây đó đã sống sót qua mùa đông.", "eng": "The plants have survived the winter."}, {"viet": "Lỗ tháo nước trong bồn rửa bị tắc.", "eng": "The plughole in the washbasin is clogged."}, {"viet": "Cảnh sát đã kiểm duyệt thư tín của tôi.", "eng": "The police had been intercepting my mail."}, {"viet": "Cảnh sát phát hiện ra một âm mưu ăn cắp tiền.", "eng": "The police uncovered a plan to steal some money."}, {"viet": "Cái cổng này không phải là bộ phận của ngôi nhà chính mà là phần thêm vào sau đó như là phần phụ thuộc.", "eng": "The porch wasn't part of the original house but added later as an appendage."}, {"viet": "Trường trung học này sẽ trở thành một trường trung học cấp dưới cho học sinh từ 16 đến 19 tuổi.", "eng": "The present grammar school will become a junior college for pupils aged 16-19."}, {"viet": "Giới báo chí không được phép tham dự cuộc xử án.", "eng": "The press were not allowed to attend the trial."}, {"viet": "Mục tiêu hàng đầu của chính sách là đem lại hòa bình cho khu vực đó.", "eng": "The principal aim of the policy is to bring peace to the area."}, {"viet": "Đám rước đi ngang qua ngay cửa nhà tôi.", "eng": "The procession passed right by my front door."}, {"viet": "Bên khởi tố đã căn cứ vụ kiện của họ trên bằng chứng của hai nhân chứng.", "eng": "The prosecution based then case on the evidence of two witnesses."}, {"viet": "Chất lượng của sản phẩm hoàn toàn phù hộ với mục đích của địa phương.", "eng": "The quality of the product is quite adequate for local purpose."}, {"viet": "Mưa rơi như trút nước suốt buổi chiều.", "eng": "The rain bucketed down all afternoon."}, {"viet": "Phi vụ thám thính là một công việc bình thường.", "eng": "The reconnaissance light was a milk run."}, {"viet": "Bản báo cáo ủng hộ mạnh mẽ việc gia tăng kinh phí cho các bệnh viện.", "eng": "The report makes out a strong case for increased spending on hospitals."}, {"viet": "Bản dịch Kinh Thánh đã được hiệu đính.", "eng": "The Revised Version of the Bible."}, {"viet": "Sau vài thước, con đường quặt sang phải.", "eng": "The road bends to the right after a few yards."}, {"viet": "Căn phòng vang dội tiếng nổ của phát súng.", "eng": "The room reverberated with the noise of the shot."}, {"viet": "Chiếc bao tải bị bục và gạo vãi ra ngoài.", "eng": "The sack split and the rice poured out."}, {"viet": "Phong cảnh này khác tất cả những gì tôi đã thấy trước đây.", "eng": "The scenery was unlike anything I'd seen before."}, {"viet": "Chỗ ngồi rộng rãi hơn so với những hãng hàng không khác.", "eng": "The seats are more spacious compared to the other airlines."}, {"viet": "Sự cắt đứt quan hệ ngoại giao, thông tin liên lạc, ràng buộc gia đình.", "eng": "The severance of diplomatic relations, of communications, of family ties."}, {"viet": "Con tàu thả neo ngang trước cửa cảng.", "eng": "The ship was anchored athwart the harbour mouth."}, {"viet": "Đứa bé ốm mặt đỏ bừng bừng và thở khó khăn.", "eng": "The sick boy had an unhealthy flush and breathed with difficulty."}, {"viet": "Chuyên gia da liễu chữa bệnh ghẻ cho đứa bé.", "eng": "The skin specialist cured the child of scabies."}, {"viet": "Những đảng viên đảng Xã hội chiếm ưu thế trong Quốc hội khoá vừa qua.", "eng": "The Socialists were predominant in the last Parliament."}, {"viet": "Tiếng nhạc khẽ dần ở đàng xa.", "eng": "The sounds of music grew fainter in the distance."}, {"viet": "Bình phương của 7 là 49.", "eng": "The square of 7 is 49."}, {"viet": "Thị trường chứng khoán bây giờ đang được giá hơn.", "eng": "The stock market is stronger now."}, {"viet": "Những sợi dây đàn pianô ngân vang lên khi người ta bấm vào phím.", "eng": "The strings of a piano vibrate when the keys are struck."}, {"viet": "Mặt trời mọc vào lúc 6 giờ sáng và lặn vào lúc 6 giờ chiều.", "eng": "The sun rises at 6 o'clock in the morning and sets at 6 o'clock in the evening."}, {"viet": "Chiếc taxi đã đến vào 8 giờ sáng hôm sau.", "eng": "The taxi came at 8 o'clock the next morning."}, {"viet": "Đội bóng giành lại được vị trí dẫn đầu trong hiệp hai.", "eng": "The team recovered its lead in the second half."}, {"viet": "Lý thuyết tiến hoá không còn là một chiến trường tranh luận nữa.", "eng": "The theory of evolution is no longer a battleground."}, {"viet": "Thời kỳ những người hang động sống thường được gọi là Thời kỳ Đồ đá cũ.", "eng": "The time in which the cave men lived is often called the Old Stone Age."}, {"viet": "Quan điểm truyền thống đầu tiên được phác hoạ ở thế kỉ mười tám.", "eng": "The traditional view first adumbrated in the eighteenth century."}, {"viet": "Thủ thuật là phải nín thở khi nhắm bắn.", "eng": "The trick is to hold your breath while you aim."}, {"viet": "Hai thế lực chính trị chủ yếu cánh tả và hữu.", "eng": "The two main political forces of left and right."}, {"viet": "Công đoàn đang thúc bách cải thiện các điều kiện làm việc.", "eng": "The unions are pressing for improved working conditions."}, {"viet": "Phó tổng thống thừa nhận là ăn của đút.", "eng": "The vice president admitted taking bribes."}, {"viet": "Tường nhà hút cái nóng vào ban ngày.", "eng": "The walls of the house absorb heat during the day."}, {"viet": "Đoàn thuỷ thủ được luyện tập tốt đã cứu được phần lớn hành khách.", "eng": "The well drilled crew managed to rescue most of the passengers."}, {"viet": "Ngọn gió lật ngược cái ô của tôi ra.", "eng": "The wind turned my umbrella inside out."}, {"viet": "Công việc làm kém nên phải làm lại.", "eng": "The work is badly done, I must be done over."}, {"viet": "Thiếu nữ trẻ đó quá tự tin, cô ta tự giới thiệu mình với tất cả các vị khách.", "eng": "The young lady was rather forward, she's introducing herself to all the guests."}, {"viet": "Cuộc đấu tranh khốc liệt từng ngày của họ để sống còn.", "eng": "Their grim day-to-day struggle for survival."}, {"viet": "Những lời chế nhạo của họ khiêu khích anh hành động.", "eng": "Their taunts stung him to action."}, {"viet": "Vậy có thể ông có một lỗ răng sâu cần được trám.", "eng": "Then you probably have a cavity that needs to be filled."}, {"viet": "Sau vụ bán hạ giá tháng Giêng, bao giờ cũng có một thời kỳ buôn bán ế ẩm.", "eng": "There's always a dull period after the January sales."}, {"viet": "Không có gì thú vị trong tờ báo cả.", "eng": "There's nothing interesting in the newspaper."}, {"viet": "Đời sống của mỗi con bướm thường và bướm đêm có 4 giai đoạn.", "eng": "There are four-stages in the life of every moth and butterfly."}, {"viet": "Ở đó có một số áo khoác mùa xuân đến trong đợt bán hàng lớn.", "eng": "There are some new spring coats there for a grand sale."}, {"viet": "Phải có một phần của bản thảo gốc.", "eng": "There has to be part of the original manuscript."}, {"viet": "Có một con cá rất lạ ở đằng kia kìa.", "eng": "There is a strange fish over there."}, {"viet": "Chỉ còn một vấn đề đó là làm sao kiếm được tiền nhiều hơn.", "eng": "There is only one problem, namely how to get more money."}, {"viet": "Đã xảy ra một vụ hoả hoạn trong phòng trưng bày tranh và một số bức đã bị thiêu huỷ.", "eng": "There was a fire in the art gallery and several of the painting were destroyed."}, {"viet": "Không còn lại một cái vé nào, một nửa giờ sau khi buổi trình diễn bắt đầu.", "eng": "There was not a ticket to be had half an hour after booking opened."}, {"viet": "Hôm qua ở bệnh viện có ba ca đẻ.", "eng": "There were three births at the hospital yesterday."}, {"viet": "Những bài văn này của anh làm dở lắm.", "eng": "These essays of yours are very poor effort."}, {"viet": "Những bản nhạc ghi lại này là một sự tưởng niệm tài năng dương cầm của ông ấy.", "eng": "These recordings are a monument to his talent as a pianist."}, {"viet": "Họ chỉ quan tâm kiếm được lời nhanh.", "eng": "They're only interested in a quick profit."}, {"viet": "Họ đã báo cho gia đình biết họ đã hứa hôn.", "eng": "They announced their engagement to the family."}, {"viet": "Họ đến muộn vì tắc xe.", "eng": "They arrived late, owing to the traffic."}, {"viet": "Họ bắt đầu giai đoạn thứ hai của dự án thuỷ nông.", "eng": "They commenced the second phase of the irrigation project."}, {"viet": "Họ lái xe vào đó, sau đó đến chỗ công nhân xi măng.", "eng": "They drive in there, then go where the workers need cement."}, {"viet": "Họ đã tích luỹ được đủ tiền để bắt đầu công việc kinh doanh.", "eng": "They had amassed enough money to start a business."}, {"viet": "Họ làm một cái giường bằng cách kê sát hai đi văng lại với nhau.", "eng": "They improvised a bed for the guest by putting two couches together."}, {"viet": "Họ có thể xây một cái đập lớn để làm một cái hồ nhân tạo.", "eng": "They may build a big dam to make an artificial lake."}, {"viet": "Họ thích loại trà có vị đậm hơn.", "eng": "They prefer a strong tasting tea."}, {"viet": "Họ cố gắng kiếm được đủ tiền để đi nghỉ.", "eng": "They scraped together enough money for a holiday."}, {"viet": "Họ nghĩ rằng tôi không thể thắng, nhưng tôi sẽ chứng tỏ cho họ thấy.", "eng": "They think I can't win, but I'll show them."}, {"viet": "Họ kinh hoàng vì nghe tin vụ nổ máy bay.", "eng": "They were appalled by the news of the crash."}, {"viet": "Họ trò chuyện qua hàng rào vườn.", "eng": "They were talking across the garden fence."}, {"viet": "Quảng cáo này là nhằm làm trẻ em chú ý.", "eng": "This advertisement is calculated to appeal to children."}, {"viet": "Áo ngoài này rất có ích cho tôi vào mùa đông.", "eng": "This coat has stood me in good stead in winter."}, {"viet": "Kiện này làm tiêu tan mọi ý kiến trước đây của tôi.", "eng": "This event shattered all my previous ideas."}, {"viet": "Đây là một cuộc trò chuyện riêng, đừng chen vào!", "eng": "This is a private conversation, don't interrupt!"}, {"viet": "Bài khoá này quá khó đối với họ.", "eng": "This is too difficult a text for them."}, {"viet": "Chiếc xe ôtô mới này là kết quả của nhiều năm nghiên cứu.", "eng": "This new car represents years of research."}, {"viet": "Vấn đề này gắn chặt với nhiều vấn đề khác.", "eng": "This problem is closely involved with many others."}, {"viet": "Bức tượng này là tượng đài kỷ niệm một chính khách lỗi lạc.", "eng": "This statue is a memorial to a great statesman."}, {"viet": "Theo sự đánh giá của chúng tôi, điều này đơn giản sẽ dẫn đến những vấn đề khó khăn tiếp theo.", "eng": "This will simply lead, in our estimation, to further problems."}, {"viet": "Nhân viên quầy bán vé, làm thủ tục cho hành khách có vé, và cung cấp thông tin về thời gian và cổng cho các chuyến bay đến và đi.", "eng": "Ticket counter employees sell tickets, check in passengers having tickets, and provide information about, the times and gates for flight arrivals and departures."}, {"viet": "Tôi e là đối với tôi thì quá cao!", "eng": "Too much for me, I'm afraid!"}, {"viet": "Trừ phi anh đẩy mạnh yêu sách của mình nếu không anh sẽ chẳng được thoả mãn đâu.", "eng": "Unless you push your claim, you will not get satisfaction."}, {"viet": "Washington là một sự phô bày của những toà cao ốc, cỏ cây và những tượng đài.", "eng": "Washington is an extravaganza of great buildings greenery, and monuments."}, {"viet": "Chúng ta dùng sự giúp đỡ bên ngoài trước khi có thể hoàn thành được.", "eng": "We'll need outside help before we can finish."}, {"viet": "Chúng tôi giữ anh lại đây vì sự an toàn cho chính bản thân anh.", "eng": "We're keeping you here for you own safety."}, {"viet": "Tôi đã kiếm được một vài người tình nguyện để giúp tôi dọn dẹp hội trường.", "eng": "We've enlisted a few volunteers to help clean the hall."}, {"viet": "Tất cả chúng tôi đều cảm thấy lo lắng khi đám cháy ở vùng đồng cỏ tới gần thành phố.", "eng": "We all felt anxiety when the prairie fire came close to town."}, {"viet": "Chúng tôi mở cửa đến 12 giờ trưa.", "eng": "We are open until 12 o'clock noon."}, {"viet": "Chúng ta gọi những vùng này là hoang mạc.", "eng": "We call such regions deserts."}, {"viet": "Chúng tôi không thể thừa nhận điều gì trong vụ này.", "eng": "We cannot assume anything in this case."}, {"viet": "Chúng tôi đã trang trí lại ngôi nhà và mua đồ đạc mới.", "eng": "We did the house over and bought new furniture."}, {"viet": "Chúng tôi cảm thấy một sự rộn ràng lây sang người khi xem trượt tuyết.", "eng": "We felt a vicarious thrill by watching people skiing."}, {"viet": "Chúng ta có nhiều vấn đề phải khắc phục trước khi có thể bắt đầu dự án.", "eng": "We had many problems to surmount before we could start the project."}, {"viet": "Chúng ta có đủ dùng cho hai ngày.", "eng": "We have enough to last us for a couple of days."}, {"viet": "Chúng tôi chưa nhận được đơn xin thôi việc của ông ta.", "eng": "We haven't yet received his resignation."}, {"viet": "Chúng ta sẽ có một khoảng thời gian tuyệt vời!", "eng": "We'll have a great time!"}, {"viet": "Chúng ta phải rút quân ra ( khỏi cuộc xung đột ).", "eng": "We must disengage our troops ( from the conflict )."}, {"viet": "Chúng tôi cần mua đồ dùng học tập cho học kỳ mới.", "eng": "We need to buy school supplies for the new semester."}, {"viet": "Chúng tôi thật sự đánh bại họ hoàn toàn trong trận đấu cuối cùng.", "eng": "We really caned them in the last match."}, {"viet": "Chúng tôi rất vui để làm đại diện cho ông nếu các điều kiện phù hợp.", "eng": "We should be very pleased to represent you, if terms and conditions are right."}, {"viet": "Chúng tôi đã cố gọi cho bà ngay khi thẻ tín dụng được tìm thấy.", "eng": "We tried to call you back as soon as the credit card was found."}, {"viet": "Tất cả chúng tôi đều hài lòng với việc bổ nhiệm John làm chủ tịch.", "eng": "We were all pleased about the appointment of John as chairman."}, {"viet": "Chúng tôi bất ngờ bị tống ngay vào xe tắc xi.", "eng": "We were whisked off in a taxi before we knew where we were."}, {"viet": "Các vận động viên nổi tiếng có thể kiếm được những khoản tiền lớn từ các nhà sản xuất nhờ quảng cáo quần áo, thiết bị ( thể thao ) của họ.", "eng": "Well-known sportsmen can earn large sums of money from manufacturers by endorsing clothes and equipments."}, {"viet": "À, thư ông A, năm trăm năm mơi đô la của ông được đổi thành 4762.", "eng": "Well, Mr. A, your five hundred and fifty dollars are changed into ¥ 4,762."}, {"viet": "Ông muốn đổi số lượng bao nhiêu?", "eng": "What's the amount you'd like to exchange?"}, {"viet": "Một số vật lưu niệm tiêu biểu ở nước bạn là gì?", "eng": "What are some typical souvenirs from your country?"}, {"viet": "Tối qua anh làm gì thế Jun?", "eng": "What did you do last night, Jun?"}, {"viet": "Cái gì làm cho anh có ý nghĩ là tôi không ưa anh?", "eng": "What gave you the idea that I didn't like you?"}, {"viet": "Thành phố anh ở tên là gì?", "eng": "What is the name of the town where you live?"}, {"viet": "Tôi có thể mở các loại tài khoản nào ở đây vậy?", "eng": "What kinds of accounts can I open here?"}, {"viet": "Cái gì đã khiến anh ta nảy ra ý nghĩ điên rồ này?", "eng": "What started him off on this crazy idea?"}, {"viet": "Khi một cuốn sách được viết xong, giai đoạn tiếp theo là in.", "eng": "When a book has been written, the next stage is printing."}, {"viet": "Khi bố mẹ cô ấy chia tay, cô ấy rất buồn khổ.", "eng": "When her parents split up she was heartbroken."}, {"viet": "Những khi giận dữ, bà ta thường quát tháo con cái.", "eng": "When she's angry, she often barks at the children."}, {"viet": "Khi họ bị cảnh sát bao vây hoàn toàn, họ biết rằng họ sẽ bị khốn đốn.", "eng": "When they were completely surrounded by police they realized they'd had it."}, {"viet": "Tôi có thể đón xe buýt đến công viên Hyde ở đâu?", "eng": "Where can I catch the bus to Hyde Park?"}, {"viet": "Theo bạn, nước nào có sự bình đẳng nam nữ cao nhất?", "eng": "Which country do you think has the highest equality between men and women?"}, {"viet": "Anh sẽ chọn ra cái nào là cái tốt nhất?", "eng": "Which would you single out as the best?"}, {"viet": "Ai đóng vai chính trong bộ phim này vậy?", "eng": "Who is starring in this movie?"}, {"viet": "Theo bạn tại sao karaoke rất được ưa chuộng ở Nhật Bản?", "eng": "Why do you think karaoke is so popular in Japan?"}, {"viet": "Liệu ( màu của ) thứ vải này có phải không?", "eng": "Will ( the colour in ) this material fade?"}, {"viet": "Xin ông vui lòng chờ một lát nhé?", "eng": "Will you please wait a minute?"}, {"viet": "Với cái tính không dứt khoát của mình, cô ta chính là nguyên nhân những nỗi bất hạnh của bản thân cô ấy.", "eng": "With her indecisiveness, she is her own worst enemy."}, {"viet": "Làm việc ở đây là đủ đẩy bất cứ ai vào cảnh rượu chè.", "eng": "Working here is enough to drive anyone to drink."}, {"viet": "Bạn có muốn trở nên giàu có và nổi tiếng không?", "eng": "Would you like to be rich and famous?"}, {"viet": "Xin cô vui lòng mang chút nước nóng và một cái khăn nữa lên phòng của tôi?", "eng": "Would you please send some hot water and another blanket to my room?"}, {"viet": "Có, nhưng chúng ta đang ở làn đường phải chạy nhanh, ông thấy đấy.", "eng": "Yes, but we're in the fast lane, you see."}, {"viet": "Dạ có, thật ra chúng tôi có vài màu khác nhau.", "eng": "Yes, we have a few different colours, in fact."}, {"viet": "Anh phải được phép của cô ấy rồi mới được làm.", "eng": "You'll have to get permission before you do that."}, {"viet": "Sắc đẹp của em dư sức đoạt giải dễ dàng.", "eng": "You're pretty enough to win it hands down."}, {"viet": "Bà đang ở gần trung tâm khu phố chính.", "eng": "You are near the heart of the downtown area."}, {"viet": "Anh không thể bỏ cả cuộc đời mình theo đuổi các bóng hình.", "eng": "You can't spend your life chasing after shadows."}, {"viet": "Cậu có thể nguyền rủa số tiền phạt nhưng cậu vẫn cứ phải nộp.", "eng": "You can rant and rave at the fine, but you'll still have to pay it."}, {"viet": "Anh có nhận ra được đây là một việc nghiêm trọng không?", "eng": "You do realize this is a serious matter?"}, {"viet": "Muốn xây dựng một ngôi nhà mới anh phải có giấy phép chính thức.", "eng": "You have to get official permission to build a new house."}, {"viet": "Anh có thể nhận được sự ủng hộ của một quỹ tài trợ nghệ thuật.", "eng": "You may be able to get support from an arts foundation."}, {"viet": "Ông phải bảo đảm rằng ông đã ký gửi đủ tiền.", "eng": "You must make sure that you have deposited enough money."}, {"viet": "Anh đẩy ở phía sau còn tôi sẽ kéo ở phía trước.", "eng": "You push from the back and I'll pull at the front."}, {"viet": "Anh phải cho chạy chậm lại trước khi đến ngã tư.", "eng": "You should slow up ( down ) before you reach the crossroad."}, {"viet": "Tối hôm qua anh ăn nói trên TV sắc sảo lắm.", "eng": "You were scintillating on TV last night."}, {"viet": "Mắt cá chân anh sưng to quá, tôi nghĩ rằng cần phải để bác sĩ xem kỹ cho.", "eng": "Your ankle is badly swollen, I think the doctor ought to look at it."}, {"viet": "Ảnh của chị rất đẹp-chị có muốn xem một vài bức ảnh của chúng tôi không?", "eng": "Your photos are lovely-do you want to see some of ours?"}]