[{"viet": "Ban nhạc đạt được sự cổ vũ nhiệt liệt của dân mê nhạc trẻ.", "eng": "A band which goes over big pop fans."}, {"viet": "Một số hành động mang tính chất thù nghịch đã dần dần xuất hiện trong trận đấu.", "eng": "A certain a mount of needle has crept into this game."}, {"viet": "Một công ty dễ bị đưa ra đấu giá để chuyển nhượng.", "eng": "A company vulnerable to takeover bids."}, {"viet": "Vận tốc vừa phải 50 dặm một giờ.", "eng": "A cruising speed of 50 miles per hour."}, {"viet": "Một cuộc bàn cãi về mức lương giữa nam và nữ công nhân.", "eng": "A dispute about the differential between men and women workers."}, {"viet": "Thậm chí một số loài cá-những con cá bong bóng bơi-bị nổ tung ra.", "eng": "A few kinds of fishes-those that have swim bladders-even turn inside out."}, {"viet": "Một cuộc bàn cãi thẳng thắn có thể giúp đánh tan mọi nghi ngờ.", "eng": "A frank discussion can help to clear the air."}, {"viet": "Một kế hoạch in sách giáo khoa rẻ được nhà nước bảo trợ.", "eng": "A government-sponsored cheap textbooks scheme."}, {"viet": "Một cơn mưa lớn đã bắt đầu.", "eng": "A heavy rain began to fall."}, {"viet": "Một khuôn đúc thạch có hình dáng chiếc xe đua.", "eng": "A jelly mould in the shape of a racing car."}, {"viet": "Một tờ báo hàng đầu dành cho giới học thức cao như tờ Thời Đại.", "eng": "A leading quality paper like The Times."}, {"viet": "Có nhiều cuộc vận động trước khi chọn giám đốc mới.", "eng": "A lot of politicking preceded the choice of the new director."}, {"viet": "Một vấn đề tối quan trọng về chính trị.", "eng": "A matter of the utmost political importance."}, {"viet": "Một viện bảo tàng có đầy những đồ cổ xưa thời Hy La.", "eng": "A museum full of Greek and Roman antiquities."}, {"viet": "Một quyển tiểu thuyết viết theo lối văn hời hợt.", "eng": "A novel written in a frothy style."}, {"viet": "Một người có thể bụm đôi bàn tay của mình và múc nước suối lên để uống.", "eng": "A person can cup his hands and dip up water from a stream to drink."}, {"viet": "Một chính sách thiện chí trong các quan hệ quốc tế.", "eng": "A policy of goodwill in international relations."}, {"viet": "Một người nâng đỡ tinh thần và làm khuây khỏa cho cha mẹ của cô trong lúc tuổi của họ đã già.", "eng": "A prop and comfort to her parents in their old age."}, {"viet": "Một bộ sưu tập tượng trưng về các côn trùng ở nước Anh.", "eng": "A representative collection of British insects."}, {"viet": "Một tạp chí châm biếm đả kích các nhân vật nổi tiếng.", "eng": "A satirical magazine tilting at public figures."}, {"viet": "Một áo sơ mi với những nếp xếp ở đằng trước.", "eng": "A shirt with pleats in the front."}, {"viet": "Thời gian cứ trôi đi còn đạo đức xã hội thì thay đổi chậm quá.", "eng": "A society's morals change slowly as time passes."}, {"viet": "Một dịch vụ tàu biển gọi tại Port Said, Aden và tất cả các hải cảng khác về phương Đông.", "eng": "A steamer service calling at Port Said, aden and all points east."}, {"viet": "Một phương pháp đã ăn sâu vào trí óc qua bao thế hệ thì không dễ gì có thể xoá bỏ được bằng sự thay đổi từ đầu.", "eng": "A system that had been ingrained for generations could not be easily undone by change from the top."}, {"viet": "Một đường nước nhầy do con sên hoặc con ốc sên để lại.", "eng": "A trail of mucus left by a snail or slug."}, {"viet": "Một bức tường bị chìm trong nước lũ.", "eng": "A wall submerged by flood water."}, {"viet": "Một lá cờ vàng có một dải đỏ chạy chéo từ đỉnh trái xuống đáy phải.", "eng": "A yellow flag with a red band going crosswise from top left to bottom right."}, {"viet": "Những hành động theo thời cơ hơn là theo nguyên tắc.", "eng": "Actions that was expedient rather than principled."}, {"viet": "Sau một cơn mưa các hạt giống của những cây này nẩy mầm.", "eng": "After a rain the seeds of these plants sprout."}, {"viet": "Sau khi suy nghĩ kỹ, tôi quyết định từ chức.", "eng": "After much cogitation I have decided to resign."}, {"viet": "Sau ba cái xúc là cái hũ đó gần rỗng.", "eng": "After three scoops the jar was nearly empty."}, {"viet": "Tất cả những kế hoạch của cô ta không đi tới đâu.", "eng": "All her plans have come to nothing."}, {"viet": "Tất cả những chứng cứ đều nêu ra tội nó.", "eng": "All the evidence points to his guilt."}, {"viet": "Mặc dù ông ta đã trên 80, đầu óc của ông ta vẫn còn tỉnh táo một cách khác thường.", "eng": "Although he's over eighty his mind is still remarkably alert."}, {"viet": "Một diễn viên ra hiệu cho ông ta biết lúc nào phải lên sân khấu.", "eng": "An actor's call tells him when to go on stage."}, {"viet": "Một ủy ban uy tín của các vị chính khách lão thành.", "eng": "An august body of elder statesmen."}, {"viet": "Một người lý tưởng đã bị tham vọng quyền lực làm lệch lạc.", "eng": "An idealist perverted by the desire for power."}, {"viet": "Một ông già bị bắt về tội phô bày bộ phận sinh dục trước trẻ em.", "eng": "An old man was arrested for exposing himself to young children."}, {"viet": "Và, bà muốn bít tết thế nào?", "eng": "And, how would you like the steak?"}, {"viet": "Một giờ nữa trôi qua và đám đông trở nên bồn chồn.", "eng": "Another hour passed and the crowd became restive."}, {"viet": "Được bổ nhiệm để làm giám sát đội ngũ nhân viên của gian hàng đồ chơi.", "eng": "Appointed to superintend the staff in the toy department."}, {"viet": "Cô sẵn sàng để đi rồi chứ, Kathy?", "eng": "Are you all set to go, Kathy?"}, {"viet": "Ông có chắc chắn là nó không có ở trong phòng của ông không?", "eng": "Are you sure it's not in your room?"}, {"viet": "Thông thường tôi có mặt ở nhà trước 6 giờ.", "eng": "As a rule I'm home by six."}, {"viet": "Khi buổi tối lặng lẽ trôi, bà ấy càng lúc càng trở nên bồn chồn.", "eng": "As the evening wore on, she became more and more nervous."}, {"viet": "Thoạt tiên, anh ta không chịu nhận bất cứ trách nhiệm nào nhưng rồi cuối cùng anh ta cũng phải xin lỗi.", "eng": "At first he refused to accept any responsibility but he ended up apologizing."}, {"viet": "Kèm theo lá thư bạn sẽ thấy.", "eng": "Attached to this letter you will find."}, {"viet": "Bóng chày đúng là sở trường của Jim.", "eng": "Baseball is down Jim's alley."}, {"viet": "Hết thời gian cách ly để kiểm dịch năm ngày.", "eng": "Be out of quarantine after five days."}, {"viet": "Trước khi nhảy vào thương trường cô ta cần phải biết rõ giới cạnh tranh.", "eng": "Before setting up in business, she wanted to get to know the opposition."}, {"viet": "Billy không thích ủi quần áo của mình.", "eng": "Billy doesn't like to iron his clothes."}, {"viet": "Đồng thau là hợp kim của đồng và kẽm.", "eng": "Brass is an alloy of copper and zinc."}, {"viet": "Việc xây dựng những con tàu mẫu là nỗi đam mê luôn ám ảnh ông ta.", "eng": "Building model trains is his consuming passion."}, {"viet": "Nhưng nếu em không muốn đi Đức thì chúng mình đi Tây Ban Nha vậy.", "eng": "But if you don't want to go to Germany, let's go to Spain then."}, {"viet": "Nhưng ông phải quyết định kỳ hạn nào ông muốn để bắt đầu.", "eng": "But you must determine what maturity you want in the beginning."}, {"viet": "À này, \"Cám ơn\" trong tiếng Trung Quốc nói thế nào?", "eng": "By the way, what's the Chinese for \"Thank you\"?"}, {"viet": "Tôi có thể đi nhờ xe của ông đến ga không?", "eng": "Can I hit the lift with you as far as the station?"}, {"viet": "Anh có thể cho biết thêm về những điều anh vừa nói không?", "eng": "Can you enlarge on what has already been said?"}, {"viet": "Anh có thể giới thiệu món đặc sản của các anh cho chúng tôi được không?", "eng": "Can you recommend us your specialty?"}, {"viet": "Đạp xe đạp thục mạng xuôi con đường.", "eng": "Careering down the road on a bicycle."}, {"viet": "Kiểm các món theo danh sách.", "eng": "Check the items against the list."}, {"viet": "Kể ra việc anh ta đã thực hiện để tìm cách giải quyết một vấn đề về nhân công.", "eng": "Cited the service he performed in trouble-shooting an employee problem."}, {"viet": "Đến thăm chúng tôi nếu bạn rỗi rãi.", "eng": "Come and see us if you're at a loose end."}, {"viet": "Rửa một mối hận thù cá nhân dai dẳng đối với một địch thủ ghét cay ghét đắng.", "eng": "Conduct a personal vendetta against a hated rival."}, {"viet": "Sự giải phẫu chỉnh hình cho cái chân dị tật.", "eng": "Corrective surgery for a deformed leg."}, {"viet": "Anh vui lòng giới thiệu thêm một số món ăn không cay hoặc không cay lắm?", "eng": "Could you recommend some dishes which are not hot or which are not very hot?"}, {"viet": "Sự ác độc thì hoàn toàn xa lạ với anh ấy.", "eng": "Cruelty was quite alien to him."}, {"viet": "Tháng mười hai vẫn còn lâu mới tới.", "eng": "December is stall a long way off."}, {"viet": "Bất chấp lời kêu gào của hắn chẳng ai đến phụ giúp hắn cả.", "eng": "Despite his cries no one came to his assistance."}, {"viet": "Bạn có nhờ nhà tạo mẫu vườn chuyên nghiệp thiết kế nó cho bạn không?", "eng": "Did you have a professional landscaper design it for you?"}, {"viet": "Sự bất mãn nảy sinh từ lương thấp và các điều kiện làm việc tồi tệ.", "eng": "Discontent stemming from low pay and poor working conditions."}, {"viet": "Sách báo khiêu dâm có làm đồi trụy độc giả không?", "eng": "Do pornographic books pervert those who read them?"}, {"viet": "Ở trường anh có học môn khoa học không?", "eng": "Do you do science at school?"}, {"viet": "Chị có thừa tí đường nào không?", "eng": "Do you have any sugar to spare?"}, {"viet": "Bạn có thích khu vực bạn đang ở không?", "eng": "Do you like the area where you're living?"}, {"viet": "Thỉnh thoảng bạn có xem phim kinh dị không?", "eng": "Do you sometimes watch horror movies?"}, {"viet": "Con có muốn mẹ xịt keo ngăn nước thấm vào quần áo của con không?", "eng": "Do you want me to spray your clothes with water repellent spray?"}, {"viet": "Nước bạn có sản xuất rượu vang ngon không?", "eng": "Does your country produce fine wine?"}, {"viet": "Đừng làm bẹp cái hộp; có hoa ở trong ấy đấy.", "eng": "Don't crush the box; it has flowers in it."}, {"viet": "Đừng đi đâu cho đến khi tôi đến.", "eng": "Don't leave till I arrive."}, {"viet": "Đừng đứng phất phơ ở đó-có việc phải làm rồi.", "eng": "Don't stand there loafing-there's work to be done."}, {"viet": "Bạn không thích làm nhân viên tiếp tân hay sao?", "eng": "Don't you like being a receptionist?"}, {"viet": "Chấm bánh bích qui vào cà phê của mình.", "eng": "Dunk a biscuit in one's coffee."}, {"viet": "Các nhà chính khách già nua vẫn bám vào những nguyên tắc lỗi thời trong học thuyết của đảng.", "eng": "Elderly politicians still clinging to the outmoded shibboleths of party doctrine."}, {"viet": "Đạo đức học là một ngành của triết học.", "eng": "Ethics is a branch of philosophy."}, {"viet": "Ai cũng tức cười câu chuyện về con chó.", "eng": "Everyone was amused by the story about the dog."}, {"viet": "Người mệt nhoài, hắn ngồi phịch xuống chiếc ghế gần nhất.", "eng": "Exhausted, he flopped down into the nearest chair."}, {"viet": "Những hình ảnh tưởng tượng thay thế cho thực tế chán nản thì hay hơn.", "eng": "Fantasies are more than substitutes for unpleasant reality."}, {"viet": "Phục vụ cho năm mươi người là nhiều đó!", "eng": "Fifty is a lot of people to cater for!"}, {"viet": "Lục tìm chìa khoá trong túi xách.", "eng": "Fishing around in the bag for the keys."}, {"viet": "Nạn côn đồ trong bóng đá bây giờ đã tới mức độ một bệnh dịch.", "eng": "Football hooliganism is now reaching epidemic proportions."}, {"viet": "Fortinbras nói một đoạn kết ngắn trong vở Hamlet của Shakespeare.", "eng": "Fortinbras speaks the epilogue in Shakespeare's Hamlet."}, {"viet": "Các cuộc phát triển trong tương lai sẽ được quan tâm xem xét.", "eng": "Future developments will be viewed with interest."}, {"viet": "Bị bắt vì lái xe trong khi say rượu.", "eng": "Get pinched for driving while drunk."}, {"viet": "Hãy cho con chó cục xương đi-đừng nhử để trêu chọc nó.", "eng": "Give the dog the bone-don't tantalize him."}, {"viet": "Trải qua những cơn sốc của vụ ly dị.", "eng": "Going through the traumas of divorce."}, {"viet": "Những kẻ có súng đều là những kẻ bần cùng của xã hội.", "eng": "Gun owners are the new niggers of society."}, {"viet": "Tiền lương của bạn đã được trả chưa?", "eng": "Has your salary been paid yet?"}, {"viet": "Bạn có bao giờ gian lận trong kì thi chưa?", "eng": "Have you ever cheated on an exam?"}, {"viet": "Anh đã thanh toán tiền sữa tuần này cho người giao sữa chưa?", "eng": "Have you paid the milkman this week?"}, {"viet": "Ông ấy cần sự chăm sóc của bệnh viện suốt ngày đêm.", "eng": "He'll need round-the-clock hospital care."}, {"viet": "Nó là một công nhân không ngăn nắp, nó bỏ dụng cụ vương vãi khắp nơi.", "eng": "He's an untidy worker, he leaves his tools everywhere."}, {"viet": "Ông ta có một tài sản để riêng vào một tài khoản ở ngân hàng Thuỵ Sĩ.", "eng": "He's got a fortune tucked away in a Swiss bank account."}, {"viet": "Nó đang chạy trốn cảnh sát truy kích quân địch.", "eng": "He's on the run from the police have the enemy on the run."}, {"viet": "Anh ấy về muộn quá-tôi rất mong là anh ấy không gặp tai nạn.", "eng": "He's very late-I do hope he hasn't met with an accident."}, {"viet": "Hắn kêu gọi quan tòa khoan dung.", "eng": "He appealed to the judge for clemency."}, {"viet": "Hắn hết sức dũng cảm chịu đựng sự đau đớn.", "eng": "He bore the pain with great fortitude."}, {"viet": "Anh ấy không giữ nổi thăng bằng khi cưỡi chiếc xe đạp.", "eng": "He can't maintain enough equilibrium to ride a bike."}, {"viet": "Ông ấy có thể nhìn thấy ba người xuyên qua sương mù.", "eng": "He could see three people through the mist."}, {"viet": "Nó làm việc dưới sự điều khiển của tôi.", "eng": "He did the work under my direction."}, {"viet": "Ông ta uống nhiều nhưng luôn luôn có vẻ tỉnh táo.", "eng": "He drinks a lot but always seems sober."}, {"viet": "Ông ta ngã bệnh và cuối cùng đã chết.", "eng": "He fell ill and eventually died."}, {"viet": "Ông ta đưa ra một bản tóm lược ngắn gọn về tình hình tài chánh.", "eng": "He gave a neat summary of the financial situation."}, {"viet": "Anh ấy làm thân với đám sinh viên xấu trong trường đại học.", "eng": "He got in with the bad crowd at university."}, {"viet": "Anh ta chỉ vào chơi được 10 phút thì Jones loại anh ta ra.", "eng": "He had only been in for 10 minutes when John bowled him out."}, {"viet": "Anh ta luôn luôn đứng lặng khiếp sợ trước ông bố của mình.", "eng": "He has always stood in dread of his father."}, {"viet": "Hắn ta có một quan điểm khá chua cay về cuộc sống.", "eng": "He has rather a jaundiced view of life."}, {"viet": "Anh ta trở thành một phế nhân ngay lập tức về mặt tâm lý, đau xót đến mức độ muốn điên dại luôn.", "eng": "He immediately becomes a psychological basket case, embittered to the point of craziness."}, {"viet": "Anh ta kết giao với bọn người xấu xa.", "eng": "He is in with the wrong crowd."}, {"viet": "Đến nửa cuộc đua anh ấy vẫn bám kịp các đối thủ hàng đầu.", "eng": "He is well up with the leaders at the half-way stage of the race."}, {"viet": "Anh ta để lại vài dòng nhằm cho người ta biết rằng anh ta sẽ không trở lại.", "eng": "He left a note to the effect that he would not be returning."}, {"viet": "Ông ấy tỏ ra hành động hết sức đúng đắn như một công dân tốt.", "eng": "He looks and acts so proper, like such a good citizen."}, {"viet": "Có lẽ anh ta cần có cái gì hơn ngoại hình hấp dẫn để qua khỏi cơn bĩ cực.", "eng": "He may need more than spiff to get him through the bad patches."}, {"viet": "Anh ta thường làm những điều mà bạn không ngờ là anh ta làm được.", "eng": "He often does things you wouldn't expect him to."}, {"viet": "Nó quẳng đồ tạp hoá và thực phẩm đánh sầm xuống sàn nhà bếp.", "eng": "He plonked the groceries on the kitchen floor."}, {"viet": "Nó đã hạ đối thủ bất tỉnh ở hiệp thứ năm.", "eng": "He put his opponent out in the fifth round."}, {"viet": "Anh ấy tự bù đắp cho những mất mát của mình.", "eng": "He recouped himself for his losses."}, {"viet": "Vì thiếu thận trọng, nó đã làm tiêu tan các triển vọng của nó.", "eng": "He ruined his prospects by carelessness."}, {"viet": "Anh ta là người bạn cũ của tôi.", "eng": "He's an old mate of mine."}, {"viet": "Ông ta kinh doanh xăng dầu.", "eng": "He's in the oil business."}, {"viet": "Anh ta nhút nhát đến độ không thể mở miệng ra mà nói.", "eng": "He's such a nervous chap he couldn't say boo to a goose."}, {"viet": "Anh ta liều thân cứu bạn.", "eng": "He saved he friend at the risk of his own life."}, {"viet": "Anh ta bạnh hàm với vẻ cương quyết.", "eng": "He set his jaw in a determined fashion."}, {"viet": "Anh ta mỉm cười thẹn thùng khi cô ấy nói trông anh dễ thương quá.", "eng": "He smiled bashfully when she said'you look lovely'."}, {"viet": "Anh ta làm cả nhà nồng nặc mùi khói thuốc lá.", "eng": "He stank the whole house out with his tobacco smoke."}, {"viet": "Nó sống chủ yếu bằng rau và trái cây.", "eng": "He subsisted mainly on vegetables and fruit."}, {"viet": "Nó cho rằng Mafia đang đi tìm nó để giết.", "eng": "He thinks the Mafia are out to get him."}, {"viet": "Anh ấy đã tiếp nhận những lời trêu chọc một cách vui vẻ.", "eng": "He took the teasing in good part."}, {"viet": "Anh ấy vật lộn cả đêm với những con số, nhưng vẫn không cân đối tài khoản được.", "eng": "He tussled all night with the figures, but couldn't balance the account."}, {"viet": "Nó muốn có thu nhập đều đặn nhưng lại không muốn làm việc, nó được cái nọ thì mất cái kia chứ!", "eng": "He wants a regular income but doesn't want to work, he can't have his cake and eat it!"}, {"viet": "Ông ấy được yêu cầu rời khỏi cơ quan ngay lập tức.", "eng": "He was asked to leave the premises immediately."}, {"viet": "Anh ta đã bị uỷ ban chỉ trích về việc không báo cáo vụ tai nạn đó.", "eng": "He was criticized by the committee for failing to report the accident."}, {"viet": "Người ta cho anh ấy uống thuốc gây nôn sau khi anh ăn phải quả mọng độc.", "eng": "He was given an emetic after eating poisonous berries."}, {"viet": "Ông ta rất lịch sự với mọi người vừa cười vừa cám ơn họ.", "eng": "He was most gracious to everyone, smiling and thanking them."}, {"viet": "Ông ta đã được yêu cầu báo cáo lại với ủy ban về khiếu nại đó.", "eng": "He was requested to report back to the committee about the complaint."}, {"viet": "Vừa rồi anh ta hết sức cáu giận với tôi.", "eng": "He was terribly ratty with me just now."}, {"viet": "Anh ấy vẫy chúng tôi khi anh ấy thấy chúng tôi.", "eng": "He waved to us when he saw us."}, {"viet": "Nó mong bố mẹ nó có cách nhìn cởi mở hơn về các vấn đề chính trị.", "eng": "He wished his parents were more open-minded on political issues."}, {"viet": "Anh ấy viết thư cám ơn chúng tôi về món quà.", "eng": "He wrote thanking us for the present."}, {"viet": "Màn nhào lộn của cô ấy được vỗ tay tán thưởng nhiệt liệt.", "eng": "Her acrobatics were greeted with loud applause."}, {"viet": "Trong mấy năm nay, tính nết cô ta đã trở nên chín chắn.", "eng": "Her character matured during these years."}, {"viet": "Những nỗ lực của cô ta cuối cùng đã có kết quả và cô ta thi đỗ.", "eng": "Her efforts finally bear fruit and she pass her exam."}, {"viet": "Lòng tử tế của cô ta đối với cha mẹ già.", "eng": "Her goodness to her old parents."}, {"viet": "Mối quan tâm của cô ấy đối với môn quần vợt chỉ tồn tại một thời gian ngắn ngủi.", "eng": "Her interest in tennis was very short-lived."}, {"viet": "Nhạc của cô ta không tìm được khán thính giả trong giới tư sản dốt nát.", "eng": "Her music found no audience among the lumpen bourgeoisie."}, {"viet": "Thơ của bà đầy rẫy những sự ám chỉ văn học tối nghĩa.", "eng": "Her poetry is full of obscure literary allusions."}, {"viet": "Tính thành thật của cô ta chưa bao giờ bị nghi ngờ cả.", "eng": "Her sincerity has never been questioned."}, {"viet": "Sự không đáp ứng của cô ta không làm giảm nhiệt tình của anh ta.", "eng": "Her unresponsiveness failed to cool his ardour."}, {"viet": "Đây là chi phiếu du lịch.", "eng": "Here's the traveler's check."}, {"viet": "Anh ta có vẻ không thể nào nói thật được.", "eng": "His apparent incapacity for telling the truth."}, {"viet": "Do cố gắng suy nghĩ, trán ông ta cau lại.", "eng": "His brow corrugated with the effort of thinking."}, {"viet": "Nhận xét tàn nhẫn của hắn làm nàng rất đau buồn.", "eng": "His cruel remarks cut her deeply."}, {"viet": "Khuôn mặt hắn trắng bệch ra.", "eng": "His face was a ghastly white."}, {"viet": "Sự quen thuộc của anh ta đối với vùng xa xôi hẻo lánh.", "eng": "His great familiarity with life in the backwoods."}, {"viet": "Công việc của anh ấy là tập hợp các sự kiện và đánh giá chúng.", "eng": "His job was to assemble the facts and evaluate them."}, {"viet": "Sự nhầm lẫn của anh ta làm tất cả chúng tôi lỗ vốn.", "eng": "His mistake left us all out of pocket."}, {"viet": "Việc ông ta sắm vai vua Lear là cuộc trình diễn cuối cùng của ông ta trước khi giải nghệ.", "eng": "His performance as King Lear was to be his swan-song before retiring."}, {"viet": "Sự vắng mặt liên tục ở trường của anh ấy thật đáng lo.", "eng": "His repeated absence from school is worrying."}, {"viet": "Bệnh đau dạ dày làm cho anh ấy cảm thấy khốn khổ suốt ngày.", "eng": "His stomachache made him feel wretched all day."}, {"viet": "Quan điểm của ông ta thiếu sự nhất quán: hôm nay ông ta là người bảo thủ, hôm sau ông ta là người tự do.", "eng": "His views lack consistency: one day he's conservative, the next he's liberal."}, {"viet": "Giữ năm con để đánh nước quyết định.", "eng": "Hold five spades to an honour."}, {"viet": "Nhân viên khách sạn đợi đến mùa vãn khách mới đi nghỉ phép.", "eng": "Hotel workers wait until the off-season to take their holidays."}, {"viet": "Làm sao chúng ta có thể theo kịp các nhà cạnh tranh của chúng ta?", "eng": "How can we make up ground on our competitors?"}, {"viet": "Tôi mặc áo đầm này trông như thế nào?", "eng": "How do I look in this dress?"}, {"viet": "Thị trường chứng khoán gần đây như thế nào?", "eng": "How is the stock market recently?"}, {"viet": "Tôi sẽ sang cho bà bao nhiêu tấm hình?", "eng": "How many copies shall I print for you?"}, {"viet": "Các chỗ ở khu ban công bao nhiêu?", "eng": "How much are the balcony seats?"}, {"viet": "Bao lâu bạn sử dụng Internet một lần?", "eng": "How often do you use the Internet?"}, {"viet": "Hàng trăm chiếc thuyền con bám theo chiếc tàu khách tiến vào hải cảng.", "eng": "Hundreds of small craft accompany the liner into harbour."}, {"viet": "Tôi muốn yêu cầu mang một bữa ăn nhẹ đến phòng của tôi.", "eng": "I'd like to have a snack'1'sent up to my room."}, {"viet": "Khi nào công thành danh toại tôi sẽ mua một căn nhà ở miền quê.", "eng": "I'll buy a house in the country when my ship comes in."}, {"viet": "Tôi sẽ giết thằng chó đẻ ấy khi nào tôi tóm được hắn!", "eng": "I'll kill that son of a bitch when I get my hands on him!"}, {"viet": "Tôi dám cuộc với anh bất cứ bao nhiêu tiền anh muốn là anh ấy sẽ không đến.", "eng": "I'll wage you any money you like he won't come."}, {"viet": "Tôi sẽ ra giơ hai tay: đừng bắn.", "eng": "I'm coming out with my hands up: don't shoot."}, {"viet": "Tôi sẽ đi bác sĩ để khám định kì hàng năm của tôi.", "eng": "I'm going to the doctor for my annual overhaul."}, {"viet": "Anh sẽ không bỏ kì nghỉ để chiều em, vì thế dù muốn dù không, em cũng phải chấp nhận thôi!", "eng": "I'm not giving up my holiday to suit you, so you can put that in your pipe and smoke it!"}, {"viet": "Tôi quá mệt, tôi không thể tập trung được ( vào bất cứ cái gì ) hôm nay.", "eng": "I'm so tired I can't focus ( on anything ) to day."}, {"viet": "Tôi chắc là anh không cần đến sự nhắc nhở phải thận trọng.", "eng": "I'm sure you don't want reminding of the need for discretion."}, {"viet": "Tôi luôn thấy cô ta hơi có vẻ bí hiểm.", "eng": "I've always found her rather sphinx-like."}, {"viet": "Tôi đã quyết định sẽ từ chức nhưng tôi mong ông hãy giữ kín điều đó.", "eng": "I've decided to resign but I'd prefer you to keep quiet about it."}, {"viet": "Tôi bị kẹt khoá và không mở cửa được.", "eng": "I've jammed the clock and I can't open the door."}, {"viet": "Tôi đã nói chuyện với anh ấy trong nhiều dịp.", "eng": "I've spoken to him on several occasions."}, {"viet": "Trước khi ra sân khấu bao giờ tôi cũng bồn chồn lo sợ.", "eng": "I always get the jitters before I go to stage."}, {"viet": "Tôi không còn cần biết hắn làm gì.", "eng": "I am past caring what he does."}, {"viet": "Tôi yêu cầu người tài xế xe buýt dừng lại cho tôi xuống xe gần trung tâm thành phố.", "eng": "I asked the bus driver to put me off near the town centre."}, {"viet": "Tôi bẻ thanh sôcôla làm hai nửa-đây là nửa của anh.", "eng": "I broke the chocolate into halves-here's your half."}, {"viet": "Tôi không thể đi vào tất cả các chi tiết của ý nghĩa.", "eng": "I can't go into all the niceties of meaning."}, {"viet": "Tôi không thể lãng phí thời giờ vào những chuyện lông bông như thế.", "eng": "I can't waste time on such frivolities."}, {"viet": "Tôi không thể tin là anh ta có lỗi.", "eng": "I cannot accept that he is to blame."}, {"viet": "Tôi bắt quả tang anh ta đang đọc trộm thư riêng của tôi.", "eng": "I caught him in the act of reading my private letters."}, {"viet": "Tôi không thể thấy rõ gương mặt của họ được trong ánh hoàng hôn.", "eng": "I couldn't see their faces clearly in the twilight."}, {"viet": "Tôi dám đánh cược cuộc sống của mình cho điều đó.", "eng": "I'd stake my life on it."}, {"viet": "Tôi không biết là tôi đã phạm pháp.", "eng": "I didn't know I was breaking the law."}, {"viet": "Tôi không hiểu làm sao cô ta dám mặc cái áo đó.", "eng": "I don't know how she dares wear that dress."}, {"viet": "Tôi không nhớ ra món ăn đặc sản nào của nhà hàng các anh.", "eng": "I don't remember a special dish of your restaurant."}, {"viet": "Tôi không muốn nghe thấy một lời cằn nhằn nào của anh nữa.", "eng": "I don't want to hear another grumble from you."}, {"viet": "Tôi không nghĩ năm nay nó thành công.", "eng": "I don't think he made it this year."}, {"viet": "Tôi cảm thấy hơi kỳ cục, vì tôi chưa quen đi lại trên tàu đang chạy.", "eng": "I feel a bit odd, I haven't got my sea-legs yet."}, {"viet": "Tôi cảm thấy rất ngượng ngập khi phải đứng lên đọc diễn văn.", "eng": "I felt very foolish having to stand up and give a speech."}, {"viet": "Tôi đã liếc qua bài báo của cô ấy.", "eng": "I gave her article a quick look-through."}, {"viet": "Tôi miễn cưỡng phải trả quá nhiều tiền cho những hàng hoá xấu như vậy.", "eng": "I grudge paying so much for such inferior goods."}, {"viet": "Tôi đã đem theo áo khoác và ô để đề phòng trời mưa.", "eng": "I had taken my coat and umbrella in anticipation of rain."}, {"viet": "Tôi có cuộc hẹn lúc 9 giờ với ông ấy.", "eng": "I have a nine o'clock appointment with him."}, {"viet": "Tôi không mang theo tiền mặt-tôi có thể trả bằng séc được không?", "eng": "I have no cash on me-may I pay by cheque?"}, {"viet": "Con phải ủi áo sơ-mi của con.", "eng": "I have to iron my shirt."}, {"viet": "Tôi không có nhiều quyền lựa chọn trong vấn đề này.", "eng": "I haven't much option in the matter."}, {"viet": "Tôi mong rằng tôi không ngăn cản anh làm việc.", "eng": "I hope I'm not keeping you from your work."}, {"viet": "Tôi suy từ hành trang của anh thì biết là anh đi nghỉ.", "eng": "I infer from your luggage that you are going on holiday."}, {"viet": "Tôi biết sẽ trượt kỳ thi này-Tôi có thể linh cảm thấy điều đó.", "eng": "I know I'm going to fail this exam-I can feel it in my bones."}, {"viet": "Tôi thích ăn tôm hùm nhưng nó lại không hợp với tôi.", "eng": "I like lobster but it doesn't like me."}, {"viet": "Tôi sẽ mua một cái nếu gặp dịp.", "eng": "I'll buy one if the occasion arises."}, {"viet": "Trên đường về nhà, tôi sẽ ghé giao các cuốn sách.", "eng": "I'll pop the books in on my way home."}, {"viet": "Tôi e rằng tôi chẳng có chuyện phiếm để mà nói đâu.", "eng": "I'm afraid I have no small talk."}, {"viet": "Tôi vui mừng được phục vụ.", "eng": "I'm happy to be of service."}, {"viet": "Tôi chán ngấy phải chờ đợi loanh quanh như thế này.", "eng": "I'm sick of waiting around like this."}, {"viet": "Tôi làm cái này là chỉ để cho sinh nhật của cô.", "eng": "I make this specially for your birthday."}, {"viet": "Chắc là tôi đã đánh rơi chìa khóa của mình mà không biết.", "eng": "I must have dropped my keys unawares."}, {"viet": "Mẹ cần phải hiểu sự bất hạnh khi con va Sue buồn.", "eng": "I need to understand unhappiness when you and Sue are unhappy."}, {"viet": "Tối qua tôi đã đặt trước một bữa điểm tâm nhẹ lúc 8 giờ sáng nay.", "eng": "I ordered a continental breakfast last night for 8: 00 this morning."}, {"viet": "Con đã để nó trở lại trong ngăn kéo.", "eng": "I put them back in the drawer."}, {"viet": "Tôi nhận ra Peter mặc dù đã 10 năm tôi không gặp anh ta.", "eng": "I recognized Peter although I hadn't seen him for 10 years."}, {"viet": "Tôi ngồi không chờ anh ta sử dụng điện thoại xong.", "eng": "I sat twiddling my thumbs waiting for him to finish using the phone."}, {"viet": "Tôi sẽ có mặt vào giờ đã định.", "eng": "I shall be ready at the appointed time."}, {"viet": "Tôi đã chụp nhanh ảnh cô đang tắm nắng ngoài bãi biển.", "eng": "I snapped you sunbathing on the beach."}, {"viet": "Tôi cho rằng rượu vang cũng có cái ngon của nó nhưng tôi thích bia hơn.", "eng": "I suppose wine has its points, but I prefer beer."}, {"viet": "Em nghĩ chắc mai em bị ốm quá.", "eng": "I think I'm going to be sick tomorrow."}, {"viet": "Tôi nghĩ vải này đẹp hơn vải kia nhiều, phải vậy không?", "eng": "I think this material is much prettier than that, don't you?"}, {"viet": "Tôi khuyên anh ấy nên đi khám bệnh đau ngực.", "eng": "I told him to see a doctor about his chest pains."}, {"viet": "Tôi được biết rằng nó sắp cưới.", "eng": "I understand that he is going to marry."}, {"viet": "Tôi muốn được quyền quyết định trong việc quản lý doanh nghiệp.", "eng": "I want a say in the management of the business."}, {"viet": "Tôi muốn nói với bà ta về chuyện lương bổng của tôi.", "eng": "I want to speak to her in the matter of my salary."}, {"viet": "Tôi bị chói mắt vì đèn trước của xe anh ta.", "eng": "I was dazzled by his headlights."}, {"viet": "Tôi rất hài lòng về kết quả của cuộc họp đó.", "eng": "I was most gratified with the outcome of the meeting."}, {"viet": "Tôi hết sức lo lắng về các con tôi khi chưa thấy chúng đi học về.", "eng": "I was terribly anxious about the children when they didn't come home from school."}, {"viet": "Tôi sẽ gọi điện cho anh khi nào tôi rảnh.", "eng": "I will call you when I'm free."}, {"viet": "Tôi mong anh đừng nói tới những đề tài dơ dáy đó trong bữa ăn.", "eng": "I wish you wouldn't talk about these nasty subjects at the dinner table."}, {"viet": "Tôi làm việc cho một đài phát thanh quảng cáo.", "eng": "I work for a commercial radio station."}, {"viet": "Tôi muốn thanh toán bằng chi phiếu.", "eng": "I would like to pay with a check."}, {"viet": "Tôi đánh vật với mục ô chữ này thật lâu sau cùng mới hiểu.", "eng": "I wrestled with the crossword clue for ages before light finally dawned."}, {"viet": "Nếu bệnh này lan ra, các bác sĩ sợ rằng tỉ lệ tử vong sẽ cao.", "eng": "If his disease spreads, the doctors fear that there'll be high mortality."}, {"viet": "Nếu cô ta không ở trong danh bạ điện thoại thì gọi dịch vụ cung cấp số điện thoại.", "eng": "If she's not in the telephone book, ring directory enquiries."}, {"viet": "Nếu tất cả chúng ta đồng ý, hãy kết thúc cuộc thảo luận ở đây.", "eng": "If we all agree, let's wind up the discussion."}, {"viet": "Nếu cô mua hai đôi, đôi thứ hai cô được giảm 30%.", "eng": "If you buy two pairs, you get the second pair at 30% off."}, {"viet": "Nếu anh cứ uống rượu mãi như thế này thì anh sẽ ốm.", "eng": "If you go on drinking like this you'll make yourself ill."}, {"viet": "Nếu anh cho rằng bị điếc là buồn cười thì anh có một ý thức khôi hài rất không đúng chỗ.", "eng": "If you think deafness is funny, you've got a very misplaced sense of humour."}, {"viet": "Những người nhập cư đồng hoá vào dòng chính của xã hội.", "eng": "Immigrants who were absorbed into the social mainstream."}, {"viet": "Để chứng thực cho câu chuyện của mình, anh ta đã đưa ra bản tuyên bố có ký tên của ông chủ anh ta.", "eng": "In corroboration of his story he produced a signed statement from his employer."}, {"viet": "Chưa đầy mười năm nó đã phát triển từ một hạt giống thành một cây phát triển đầy đủ.", "eng": "In less than ten years, it develops from a seed into a full grown tree."}, {"viet": "Nếu vậy thì chúng tôi sẽ dùng dung dịch có nồng độ nhẹ để không làm hư tóc của bà.", "eng": "In that case, we will use a mild solution that won't damage your hair."}, {"viet": "Trong cuộc vật lộn đã có nhiều cú đấm, đánh.", "eng": "In the struggle several punches were thrown."}, {"viet": "Càng ngày nhân dân càng nhận thấy rõ là những vấn đề cơ bản của chúng ta không phải là những vấn đề kinh tế.", "eng": "Increasingly, people are realizing that our basic problems are not economic ones."}, {"viet": "Ông ấy sắp bình phục chưa?''Mình không biết, chúng ta sẽ phải đợi xem sao'.", "eng": "Is he going to recover?''I don't know, we'll just have to wait and see'."}, {"viet": "Trọng lượng của các túi xách của tôi có nằm trong số cho phép mang theo không?", "eng": "Is the weight of my bags within the free allowance?"}, {"viet": "Ở nước bạn cũng vậy chứ?", "eng": "Is this true for your country, too?"}, {"viet": "Bây giờ là bốn giờ kém mười lăm-tôi sẽ gặp anh lúc bốn giờ mười lăm.", "eng": "It's a quarter to four now-I'll meet you at quarter past."}, {"viet": "Thật là phản tác dụng khi quá cứng rắn, nó chỉ tổ làm cho nhân viên oán giận.", "eng": "It's counter-productive to be too tough, it just makes the staff resentful."}, {"viet": "Trở thành một người có đầu óc giao tế rộng thật là quan trọng.", "eng": "It's important to become an international-minded person."}, {"viet": "Thậm chí chưa đến 8 giờ, nhưng cháu rất buồn ngủ.", "eng": "It's not even eight o'clock yet, but I'm very sleepy."}, {"viet": "Hòn đảo được gọi như vậy vì vào đêm trung thu, cư dân Hàng Châu rất thích đến đây.", "eng": "It's so called because on the night of the Moon Festival the inhabitants of Hangzhou love to come here."}, {"viet": "Thật là khó làm bánh xèo nếu không có chảo chiên không dính.", "eng": "It's very difficult to make pancakes without a nonstick pan."}, {"viet": "Món đó không có cà rốt.", "eng": "It doesn't contain any carrot."}, {"viet": "Thật khó mà nhìn trước được một sự thay đổi như thế.", "eng": "It is difficult to envisage such a change."}, {"viet": "Đây là một phần của hợp đồng qui định giao hàng chậm sẽ bị phạt.", "eng": "It is part of the contract that there is a penalty for late delivery."}, {"viet": "Nó làm cho trái tim của tôi đau khi nhìn thấy nàng đau khổ.", "eng": "It makes my heart ache to see her suffer."}, {"viet": "Đối với tôi có vẻ không tốt lắm.", "eng": "It's doesn't seem so good to me."}, {"viet": "Từ chối lời mời của anh ta hình như bất lịch sự.", "eng": "It seemed churlish to refuse his invitation."}, {"viet": "Cảnh sát đã phải mất nhiều ngày mới tìm ra dấu vết của kẻ bị họ truy nã.", "eng": "It took the police several days to track down their quarry."}, {"viet": "Ông thật là ý tứ đã không chơi đàn piano trong lúc tôi đang ngủ.", "eng": "It was considerate of you not to play the piano while I was asleep."}, {"viet": "Anh quá vô ý đã nhắc tới bà vợ quá cố của ông ta.", "eng": "It was rather insensitive of you to mention his dead wife."}, {"viet": "Cà phê sẽ làm ta thấy khỏe hơn.", "eng": "It will make us feel better."}, {"viet": "Jane và Sarah vốn là bạn nhưng nay họ là những kẻ thù gay gắt của nhau.", "eng": "Jane and Sarah used to be friends but now they are bitter enemies."}, {"viet": "John sẽ nói với anh những nét chính của kế hoạch, sau đó tôi sẽ bổ sung thêm.", "eng": "John will tell you the plan in outline, and then I'll round it out."}, {"viet": "Hãy lùi lại! Toà nhà có thể bị đổ sập vào bất cứ lúc nào.", "eng": "Keep back! The building could collapse at any moment."}, {"viet": "Chúng ta hãy gọi điện cho cảnh sát và mô tả cho họ nghe về cái túi xách của bà.", "eng": "Let's call the police and give the police a description of your handbag."}, {"viet": "Bây giờ để xem nào, tôi đã để túi xách của tôi ở đâu rồi?", "eng": "Let's see now, where did I put my bag?"}, {"viet": "Nhiều chuyện trong cuộc đời chúng ta cứ diễn ra ngược lại.", "eng": "Many events in our lives go by contraries."}, {"viet": "Nhiều người thời Victoria đã sửng sốt về khái niệm là con người đã tiến hoá từ sinh vật cấp thấp.", "eng": "Many Victorians were shocked by the notion that Man had evolved from lower forms of life."}, {"viet": "Cho phép tôi có vài lời khuyên bạn nhé?", "eng": "May I give you some advice?"}, {"viet": "Có lẽ chúng ta sẽ chơi một vài set khi tôi chơi khá hơn.", "eng": "Maybe we can play a couple of sets when I improve."}, {"viet": "Phần lớn các màn kịch được viết bằng thơ, nhưng đôi chỗ viết bằng văn xuôi.", "eng": "Most of the scene is written in verse, but some is in prose."}, {"viet": "Hầu hết công trình của anh ta không được tin bởi vì bây giờ chúng tôi biết anh ta sử dụng thông tin giả.", "eng": "Much of his work has been discredited because we now know that he used false information."}, {"viet": "Con gái tôi phải ngậm cái nẹp răng để đỡ hàm răng nó.", "eng": "My daughter has to wear a brace on her teeth."}, {"viet": "Chồng tôi đi làm về chiều lúc 8 giờ.", "eng": "My husband gets home from work at eight o'clock."}, {"viet": "Trí nhớ của tôi bây giờ không còn được như trước đây.", "eng": "My powers of recall are not what they were."}, {"viet": "Sự nghèo đói của đất nước thêm trầm trọng bởi dân số tăng nhanh.", "eng": "National poverty was aggravated by rapid population growth."}, {"viet": "Kế bên chúng là những cái máy giặt to.", "eng": "Next to them are the big washers."}, {"viet": "Rất có thể là anh ta có ý giúp đỡ nhưng trong thực tế anh ta chỉ gây trở ngại.", "eng": "No doubt he means to help, but in fact he just gets in the way."}, {"viet": "Bây giờ, tôi biết mọi người thích vui đùa với nhau.", "eng": "Now, I know people enjoy one another."}, {"viet": "Béo phì là một vấn đề ở Mỹ.", "eng": "Obesity is a problem in the U. S."}, {"viet": "Ồ, vâng, tôi nhớ là điều đó có thật ở một vài quốc gia khác.", "eng": "Oh, yes, I remember that was true in some other countries."}, {"viet": "Trên bàn có hai quyển sách, một cái bút và một vài thứ khác.", "eng": "On the desk, there were two books, a pen, and some other items."}, {"viet": "Một trong những nét kém hấp dẫn của anh ta là phê bình vợ trước mọi người.", "eng": "One of his less attractive traits is criticizing his wife in public."}, {"viet": "Chương trình nghị sự của chúng tôi đã được thay đổi nhanh chóng sau sự từ chức của ông chủ tịch.", "eng": "Our agenda underwent a rapid change after the chairman's resignation."}, {"viet": "Từ các cửa sổ nhà hàng xóm nhìn xuống được khu vườn của chúng tôi.", "eng": "Our garden is overlooked by our neighbours'windows."}, {"viet": "Các quan điểm đối lập của chúng tôi trước đây đã bắt đầu gặp nhau.", "eng": "Our previously opposed views are beginning to converge."}, {"viet": "Được các đồng nghiệp lâu năm quá kính nể đến phục tùng.", "eng": "Overawed into submission by senior colleagues."}, {"viet": "Sự thanh toán có thể được tiến hành theo những cách sau đây: bằng tiền mặt, bằng séc, hoặc bằng tín phiếu.", "eng": "Payment may be made in any of the following ways: by cash, by cheque, or by credit card."}, {"viet": "Có lẽ là họ cũng liên hệ thành phố này với Trung tâm Thương mại Thế giới, tượng nữ thần Tự do, Đại lộ số Năm, quảng trường Time, Liên Hiệp Quốc và công viên trung tâm ….", "eng": "Perhaps too, they associate the city with the World Trade Centre, the Statue of Liberty, Fifth Avenue, Times Square, the United Nations, and Central Park and so on."}, {"viet": "Cảnh sát truy cứu các hoạt động của nạn nhân vụ giết người.", "eng": "Police retraced the movements of the murder victim."}, {"viet": "Suy nghĩ kỹ về một vấn đề gì trong tâm trí của ai.", "eng": "Revolves something in one's mind."}, {"viet": "Nhiều thí sinh đã được triệu tập để phỏng vấn lần thứ hai.", "eng": "Several candidates were called for a second interview."}, {"viet": "Cô ta không bao giờ thay đổi theo quan điểm của chúng ta đâu.", "eng": "She'll never come round to our way of thinking."}, {"viet": "Bà ta đang có vài chứng bệnh nội tạng.", "eng": "She's been having some internal problems."}, {"viet": "Cô ta ngang tài với ông ta về cờ vua.", "eng": "She's his match when it comes to chess."}, {"viet": "Cô ta đã tham dự vào môn chạy 100 mét và nhảy xa.", "eng": "She's put herself in for the 100 metres and the long jump."}, {"viet": "Cô ấy đến thăm ông chú bị ốm ở bệnh viện.", "eng": "She's visiting her sick uncle in hospital."}, {"viet": "Cô ấy trả thù những kẻ giết cha cô.", "eng": "She avenged herself on her father's killers."}, {"viet": "Chắc chắn là cô ta sẽ không lấy chồng nữa-phải một bận, cạch đến già.", "eng": "She certainly won't marry again once bitten, twice shy."}, {"viet": "Cô ấy tâng tâng đứa trẻ quanh phòng.", "eng": "She danced the little child round the room."}, {"viet": "Cô ấy không thích tóc ngắn vì thế cô ấy để tóc mọc dài.", "eng": "She doesn't like her hair short so she's letting it grow."}, {"viet": "Bà ấy cảm thấy không tội lỗi gì khi đánh tên ăn trộm.", "eng": "She felt no compunction about hitting the burglar."}, {"viet": "Con bé trở nên rất õng ẹo khi có bạn trai ở bên.", "eng": "She gets very skittish when her boy-friend is around."}, {"viet": "Cô ấy đã đi bấm lỗ tai để có thể đeo khuyên được.", "eng": "She had her ears pierced so that she could wear ear-rings."}, {"viet": "Cô ấy có thai đã được ba tháng.", "eng": "She has been pregnant for three months."}, {"viet": "Cô ấy giơ tay ra để nắm lấy sợi dây thừng.", "eng": "She held out her hand to take the rope."}, {"viet": "Bây giờ chị ta ăn mặc hợp thời trang hơn 20 năm trước đây.", "eng": "She is more with it now than she was 20 years ago."}, {"viet": "Cô ta tiếp tục kể cho chúng tôi nghe về ca mổ của cô, hết sức tỉ mỉ sinh động.", "eng": "She kept telling us about her operation, in the most graphic detail."}, {"viet": "Cô ấy ngắm những bức tranh với vẻ mãn nguyện.", "eng": "She looked at the painting with great pleasure."}, {"viet": "Cô ấy rất bực là anh ta đã không đến.", "eng": "She minded very much that he had not come."}, {"viet": "Cô ta làm bài thi rất đáng khen.", "eng": "She performed very creditably in the exam."}, {"viet": "Cô ta huyên thuyên về chuyến đi ở Pháp.", "eng": "She raves about the trip she had had in French."}, {"viet": "Cô ta rất thành công với tất cả các con trai.", "eng": "She's a wow with all the boys."}, {"viet": "Bà ta đã ngoài 80 à? Anh làm tôi ngạc nhiên đấy!", "eng": "She's over 80? You surprised me!"}, {"viet": "Bà nói bà muốn học lắm.", "eng": "She says she'd like to learn."}, {"viet": "Cô ấy tỏ ra ít am hiểu hoặc không thưởng thức được nhạc hay.", "eng": "She shows little or no appreciation of good music."}, {"viet": "Cô ta suốt ngày lên bể bơi, phết đầy dầu vào người.", "eng": "She stayed all day by the swimming pool, basting herself with oil."}, {"viet": "Cô ấy tránh không muốn dính vào chuyện chính trị của cơ quan.", "eng": "She tended to keep herself aloof from office politics."}, {"viet": "Cô ta chuyển sang suy nghĩ tới những đứa con đang làm gì.", "eng": "She turned her thoughts to what the children were doing."}, {"viet": "Cô ấy là nguồn sức mạnh đối với chúng tôi khi tình thế của chúng tôi dường như tuyệt vọng.", "eng": "She was a pillar of strength to us when our situation seemed hopeless."}, {"viet": "Cô ta được công ty bảo hiểm bồi thường cho các thương tích của cô ấy.", "eng": "She was compensated by the insurance company for her injuries."}, {"viet": "Cô ta ở trong trạng thái xúc động mạnh.", "eng": "She was in a state of great agitation."}, {"viet": "Bà ta bị gây sức ép để đồng ý hợp nhất công ty.", "eng": "She was pressurized into agreeing to a merger."}, {"viet": "Cô ta là người phụ nữ đẹp nhất mà anh ta đã từng nhìn thấy.", "eng": "She was the most beautiful woman he had ever gazed upon."}, {"viet": "Mặt cô ta trắng bệch khi cô ta nghe được tin đó.", "eng": "She went as white as a sheet when she heard the news."}, {"viet": "Cô ấy đã giành được sự hoan hô nhiệt liệt về cách cô ấy trình bày lý lẽ của mình.", "eng": "She won plaudits for the way she presented her case."}, {"viet": "Sherlock Holmes đã giải được nhiều vụ giết người.", "eng": "Sherlock Holmes solved many murder cases."}, {"viet": "Các món ăn Tứ Xuyên ngon và rẻ hơn.", "eng": "Sichuan dishes are delicious and cheaper."}, {"viet": "Ngồi suy nghĩ miên man những ký ức xa xưa.", "eng": "Sit musing on memories of the past."}, {"viet": "Về phía tôi mà nói, thì những bàn chân thối dứt khoát là một điều ghê tởm.", "eng": "Smelly feet are definitely a turn-off as far as I'm concerned."}, {"viet": "Vậy ông Kemp sắp tới văn phòng mới.", "eng": "So Mr. Kemp is going to a new office."}, {"viet": "Có một số người da đen dọn đến ở nhà kế bên.", "eng": "Some Blacks moved in the next door."}, {"viet": "Một số sinh viên đến những khoá học mùa hè để học cấp tốc.", "eng": "Some of the students went to summer sessions to accelerate."}, {"viet": "Một số tàu thời chiến vẫn còn đang hoạt động.", "eng": "Some wartime vessels are still in commission."}, {"viet": "Xin lỗi, có phải tôi đã đụng khuỷu tay của anh không?", "eng": "Sorry, did I knock your elbow?"}, {"viet": "Kéo dài hết mức thời gian tiêu tiền của mình cho đến ngày lãnh lương kế tiếp.", "eng": "Spin one's money out until the next pay-day."}, {"viet": "Bước ra khỏi xe lửa xuống sân ga.", "eng": "Step out of the train onto the platform."}, {"viet": "Con đừng có ngoái đầu nhìn người ta nữa.", "eng": "Stop turning your heads round to look at people."}, {"viet": "Sự thành công trong nghề viết văn đòi hỏi sự nỗ lực lớn.", "eng": "Success as a writer demands great application."}, {"viet": "Đường và bột bị phân hủy khi vào đến dạ dày.", "eng": "Sugar and starch are broken down in the stomach."}, {"viet": "Đi lang thang quanh thành phố trong chiếc xe ôtô thể thao mới của mình trong khi lẽ ra cô ấy phải làm việc.", "eng": "Swanning around the town in her new sports car when she should have been at work."}, {"viet": "Đi con đường thứ nhì bên phải sau khi đi qua nhà ga.", "eng": "Take the road on the right after the station."}, {"viet": "Tường thuật vô tuyến truyền hình về cuộc vận động bầu cử.", "eng": "Television coverage of the election campaign."}, {"viet": "Xin cảm ơn đã cho chúng tôi xem bộ sưu tập các họa phẩm của bạn.", "eng": "Thank you for showing us your collection of paintings."}, {"viet": "Bởi vậy cho nên, mẹ cứ luôn bảo con đi ngủ sớm rồi mà.", "eng": "That's why, I'm always telling you to go to sleep early."}, {"viet": "Cái thằng con ngu ngốc của tôi đã làm hỏng chiếc ô tô mới của nó.", "eng": "That fool son of mine has smashed up hic new car."}, {"viet": "Chắc hẳn đó là chiếc áo khoác của ai đó, nó không phải của tôi.", "eng": "That must be somebody else's coat, it isn't mine."}, {"viet": "Đó là chách uống trà ngon nhất đấy.", "eng": "That's the best way to drink it."}, {"viet": "Đây đúng là bữa ăn ngon nhất tôi đã được ăn từ trước đến nay.", "eng": "That was quite the nicest meal I've ever had."}, {"viet": "Bộ phận kế toán đã được trang bị hoàn toàn bằng máy điện toán.", "eng": "The account section has been completely computerized."}, {"viet": "Hợp đồng và các tài liệu đính kèm vào đó.", "eng": "The agreement and the documents appended thereto."}, {"viet": "Ánh sinh động trong đôi mắt cô gái.", "eng": "The animate sparkle of the girl's eyes."}, {"viet": "Cuộc tranh luận được làm sinh động bởi các nhà chính trị.", "eng": "The argument was kept alive by the politicians."}, {"viet": "Quả bom nguyên tử được thả xuống Hiroshima có một sức nổ mạnh 20 kiloton.", "eng": "The atomic bomb dropped on Hiroshima had a yield of 20 kilotons."}, {"viet": "Thằng bé trông thật kháu khỉnh.", "eng": "The babe was a wonder to behold."}, {"viet": "Ngân hàng cho tôi 2.000 bảng Anh.", "eng": "The bank advanced me £ 2,000."}, {"viet": "Thủy triều đã làm sạch bãi biển.", "eng": "The beach had been washed clean by the tide."}, {"viet": "Dự luật được đọc mà không cần qua một cuộc biểu quyết.", "eng": "The Bill was read without a division."}, {"viet": "Chiếc tàu chìm dưới những ngọn sóng.", "eng": "The boat sank beneath the waves."}, {"viet": "Quyển sách này là kết quả của mười năm nghiên cứu chuyên cần.", "eng": "The book was the result of ten years'assiduous research."}, {"viet": "Bọn trẻ không có ý muốn hại ai đâu-chúng chỉ vui đùa liều lĩnh một chút thôi.", "eng": "The boys didn't mean any harm-they were only having a lark."}, {"viet": "Ngân sách đã được thủ tướng phê chuẩn.", "eng": "The budget has been agreed by Prime Minister."}, {"viet": "Khu vực kinh doanh, nhà ở, mua bán.", "eng": "The business, residential, shopping section."}, {"viet": "Chiếc xe đã tăng tốc khi nó vượt qua tôi.", "eng": "The car accelerated as it overtook me."}, {"viet": "Chiếc xe ô-tô đó lạng ra khỏi con đường rồi lao xuống một cái mương.", "eng": "The car went careering off the road into a ditch."}, {"viet": "Những người đào hang tìm ra một hang ngầm rộng.", "eng": "The cavers discovered a vast underground chamber."}, {"viet": "Những nhân vật trong cuốn tiểu thuyết này đã bị thổi phồng.", "eng": "The characters in this novel are overdrawn."}, {"viet": "Đứa bé đọc liến láu bài thơ đã học.", "eng": "The child rattled off the poem he had learnt."}, {"viet": "Bọn trẻ xách cặp đi học.", "eng": "The children carried their bags to school."}, {"viet": "Bọn trẻ đang khá quấy rầy.", "eng": "The children were being rather tiresome."}, {"viet": "Thành phố này nổi tiếng vì những suối nước nóng.", "eng": "The city is celebrated for its hot springs."}, {"viet": "Mây tan và mặt trời chiếu sáng.", "eng": "The clouds parted and the sun shone."}, {"viet": "Phần phụ trương in màu của tờ báo chủ nhật.", "eng": "The colour supplement of the Sunday newspaper."}, {"viet": "Công ty có một tiếng tăm đáng khen vì tính tin cậy.", "eng": "The company has an enviable reputation for reliability."}, {"viet": "Máy vi tính trông rất gọn và đầy đủ chức năng.", "eng": "The computer looks compact and functional."}, {"viet": "Từ trái nghĩa của ướt là khô.", "eng": "The contrary of wet is dry."}, {"viet": "Nước này thu phần lớn lợi nhuận của mình từ ngành kinh doanh du lịch.", "eng": "The country earns most of its income from the tourist trade."}, {"viet": "Đàn bò sẽ được lùa về sớm để vắt sữa.", "eng": "The cows will be in for milking soon."}, {"viet": "Đám đông ồ, à bên cạnh chuồng gấu trúc.", "eng": "The crowd was oohing and aahing beside the panda's enclosure."}, {"viet": "Đập nước bị vỡ tung dưới sức nặng của nước.", "eng": "The dam burst under the weight of water."}, {"viet": "Con nai đứng không nhúc nhích giữa đám cây.", "eng": "The deer stood immobile among the trees."}, {"viet": "Những chi tiết này được cho là bí mật nhưng bằng cách nào đó đã lọt ra ngoài.", "eng": "The details were supposed to the secret but somehow leaked out."}, {"viet": "Việc phát hiện ra rằng chồng cô ta có ngoại tình là một sự bừng tỉnh phũ phàng.", "eng": "The discovery that her husband was unfaithful to her was a rude awakening."}, {"viet": "Vị bác sĩ mổ cái nhọt cho mủ chảy ra.", "eng": "The doctor lanced the boil to let the pus out."}, {"viet": "Con chó là hình bóng của người chủ nó.", "eng": "The dog is his master's shadow."}, {"viet": "Cuộc rút thăm vào vòng hai của giải vô địch châu Âu.", "eng": "The draw for the second round of the European Cup."}, {"viet": "Trái đất quay xung quanh mặt trời mỗi năm một lần.", "eng": "The Earth goes round the sun once a year."}, {"viet": "Thời kỳ Elizabeth là thời đại hoàng kim trong nền kịch nghệ nước Anh.", "eng": "The Elizabethan period was the golden age of English drama."}, {"viet": "Quân đội vào thành phố.", "eng": "The entrance of the army into the city."}, {"viet": "Ban quản trị đã ra quyết định về tương lai của công ty.", "eng": "The executive has been making decisions about the future of the company."}, {"viet": "Các sự kiện chấp nhận những cách giải thích khác nhau.", "eng": "The facts are patient of various interpretations."}, {"viet": "Sự sợ bị nhạo báng là một sự ngăn chặn rất có hiệu quả.", "eng": "The fear of ridicule is a very effective sanction."}, {"viet": "Ngôi sao điện ảnh đó chiêu đãi những người hâm mộ ở tiền sảnh của khách sạn.", "eng": "The film star held court in the hotel lobby."}, {"viet": "Công ty có sản phẩm tốt hơn các đối thủ của nó.", "eng": "The firm has better products than its competitors."}, {"viet": "Hai toa đầu của tàu hỏa đã bị bẹp rúm trong vụ đâm đó.", "eng": "The first two carriages of the train were telescoped in the crash."}, {"viet": "Thức ăn nhạt nhẽo vì thế cô ấy cho thêm chút gia vị để làm cho nó đậm đà hơn.", "eng": "The food tasted rather bland, so she added some spices to pep it up a little."}, {"viet": "Bầu không khí thân hữu bắt đầu tan vỡ.", "eng": "The friendly atmosphere began to crack."}, {"viet": "Cái ghế vườn mở ra thành cái giường xếp.", "eng": "The garden chair unfolds to make a camp-bed."}, {"viet": "Cô gái đó đã tạo được ấn tượng tốt đẹp cho gia đình vị hôn phu của mình bằng sự hoạt bát và hài hước.", "eng": "The girl impressed her fiancé's family with her liveliness and sense of humour."}, {"viet": "Cách giải quyết hiện nay của Chính phủ chỉ dẫn đến tai hoạ mà thôi.", "eng": "The Government's present course will only lead to disaster."}, {"viet": "Chính phủ quyết định giảm bớt các chi phí công cộng.", "eng": "The Government is determined to put a brake on public spending."}, {"viet": "Chiếc áo choàng dài là một vật kết hợp công phu giữa sa tanh và những miếng đính.", "eng": "The gown was a confection of satin and appliqué."}, {"viet": "Nhóm này đã tách ra khỏi hiệp hội chính thức.", "eng": "The group have split away from the official union."}, {"viet": "Họ chiếm một đại đa số phiếu so với đảng kia trong lần bầu cử vừa qua.", "eng": "The had a large majority over the other party at the last election."}, {"viet": "Con gà mái này đẻ ra một quả trứng to màu nâu.", "eng": "The hen laid a large brown egg."}, {"viet": "Ngựa chạy rầm rập trên đường đua.", "eng": "The horses came pounding along the track."}, {"viet": "Ngôi nhà này thuộc thế kỷ 18 và đồ đạc trong nhà cũng cùng thời kỳ đó.", "eng": "The house is 18th century and has furniture of the period."}, {"viet": "Chó Exkimô là vô song về sức chịu đựng và bền bỉ.", "eng": "The husky is unequalled for stamina and endurance."}, {"viet": "Số hàng hoá xa xỉ bán được tăng lên là thước đo sự phồn vinh của một nước.", "eng": "The increasing sale of luxury goods is an index of the country's prosperity."}, {"viet": "Và lãi suất cho tài khoản tiết kiệm có kỳ hạn cao hơn.", "eng": "The interest rate is higher for fixed account."}, {"viet": "Công việc đó đòi hỏi tôi phải sống ở Luân Đôn.", "eng": "The job involved me in London."}, {"viet": "Bồi thẩm đoàn không tin là anh ta vô tội.", "eng": "The jury were unconvinced that he was innocent."}, {"viet": "Ngọn đèn tỏa ra ánh sáng dịu trên bàn giấy.", "eng": "The lamp shed soft light on the desk."}, {"viet": "Luật pháp áp dụng đối với tất cả mọi người không phân biệt sắc tộc, tín ngưỡng hay màu da.", "eng": "The laws apply to everyone irrespective of race, creed or colour."}, {"viet": "Mức thất nghiệp đang giảm xuống.", "eng": "The level of unemployment is down."}, {"viet": "Những nơi vui chơi giải trí ở địa phương đều được đăng trên báo.", "eng": "The local entertainments are listed in the newspaper."}, {"viet": "Kiểu ô tô sang trọng chạy êm hơn.", "eng": "The luxury model gives a smoother ride."}, {"viet": "Trong bản di chúc người cha để lại trang trại cho đứa con trai.", "eng": "The man left his farm to his son in his will."}, {"viet": "Loại vải đó sờ thấy ấm mịn như nhung.", "eng": "The material has a warm, velvety touch."}, {"viet": "Cuộc họp sẽ được tổ chức ở trung tâm cộng đồng.", "eng": "The meeting will be held in the community center."}, {"viet": "Bài diễn văn của ông bộ trưởng được đón tiếp bằng những lời chế nhạo và những tiếng huýt sáo.", "eng": "The Minister's speech was greeted with jeers and catcalls."}, {"viet": "Tiền sẽ được chi để tài trợ một trung tâm mới của cộng đồng.", "eng": "The money will go to finance a new community centre."}, {"viet": "Ngọn núi nổi bật vươn lên trên nền trời xanh.", "eng": "The mountain rose against the blue sky."}, {"viet": "Cả nước rộn ràng với âm nhạc và tuyên cáo, với những sự cuồng nhiệt và những niềm tự hào về đạo đức.", "eng": "The nation pulsed with music and proclamation, with rages and moral pretensions."}, {"viet": "Giá vé mới sẽ là 1 bảng Anh bắt đầu từ tháng tới.", "eng": "The new fare will be £ 1, beginning from next month."}, {"viet": "Quy tắc mới sẽ được áp dụng lần lượt.", "eng": "The new rule will be applied retrospectively."}, {"viet": "Tờ báo đả kích ông ấy về sự bênh vực của ông ấy đối với chính sách khủng bố.", "eng": "The newspaper really went for him over his defence of terrorism."}, {"viet": "Cuốn tiểu thuyết đó được đặt vào bối cảnh thành phố Luân Đôn trước chiến tranh.", "eng": "The novel is set in pre-war London."}, {"viet": "Hàng biếu được nhận mà không phương hại đến các cuộc thương lượng thanh toán hiện hành.", "eng": "The offer was accepted without prejudice to the current pay negotiations."}, {"viet": "Ông lão có vẻ thất vọng và chán nản.", "eng": "The old man seemed dejected and spiritless."}, {"viet": "Nhiệt độ tốt nhất cho sự tăng trưởng của cây trồng.", "eng": "The optimum temperature for the growth of plants."}, {"viet": "Hoạ sĩ dùng ngày nghỉ để sơn nhà của mình.", "eng": "The painter spent a bus man's holiday painting his own house."}, {"viet": "Đảng đó nhận được sự tài trợ bí mật của vài người ủng hộ nước ngoài.", "eng": "The party was given secret financial support by some foreign backers."}, {"viet": "Nhân dân đang đấu tranh giành tự do khỏi ách thống trị ngoại bang.", "eng": "The people are fighting to gain their freedom from foreign control."}, {"viet": "Máy hát, một phát minh được cho là của Thomas Edison.", "eng": "The phonograph, an invention attributed to Thomas Edison."}, {"viet": "Những cơn gió khắc nghiệt của mùa đông Tây Bá Lợi Á.", "eng": "The pitiless winds of a Siberian winter."}, {"viet": "Kế hoạch không được phối hợp khéo léo cho lắm.", "eng": "The plant was not well coordinated."}, {"viet": "Một âm mưu được khám phá kịp thời.", "eng": "The plot was discovered in time."}, {"viet": "Cảnh sát tập hợp lại quanh đám biểu tình.", "eng": "The police grouped round the demonstrators."}, {"viet": "Cảnh sát theo vết của những tên khủng bố đến tận sào huyệt của chúng.", "eng": "The police tracked the terrorists to their hide-out."}, {"viet": "Dân cư các nước Tây Âu.", "eng": "The populations of Western European countries."}, {"viet": "Cuộc khủng hoảng lần này lớn hơn bất kỳ lần nào xảy ra trước đây.", "eng": "The present crisis is more than any that have gone before."}, {"viet": "Khuy bấm trên cổ áo sơ mi dạ hội của ông ấy.", "eng": "The press stud on the collar of his evening shirt."}, {"viet": "Nàng công chúa đã thu phục được nhân tâm của cả nước.", "eng": "The princess captured the hearts of the nation."}, {"viet": "Quá trình biến đổi từ cung quăng sang muỗi.", "eng": "The process by which tad poles are transformed into mosquitoes."}, {"viet": "Việc cấm đoán những tờ báo chỉ trích chính phủ.", "eng": "The proscription of newspaper critical of the government."}, {"viet": "Những đức tính khiến anh ta đạt được những tham vọng của mình.", "eng": "The qualities which enabled him to attain his ambitions."}, {"viet": "Đèn hiệu trên đường ray màu đỏ nên xe lửa dừng lại.", "eng": "The railway signal was on red, so the train stopped."}, {"viet": "Buổi đọc thơ balat, bài tụng thi, v. v..", "eng": "The recitation of a ballad, an ode, etc."}, {"viet": "Bản báo cáo là một sự cô đọng tuyệt vời của mấy năm làm việc.", "eng": "The report is a brilliant condensation of several years'work."}, {"viet": "Ngài mục sư Smith sẽ cử hành cuộc hôn lễ.", "eng": "The Reverend Mr Smith will officiate at the wedding."}, {"viet": "Đường phía trước bị ngập cho nên chúng tôi phải quay trở lại.", "eng": "The road ahead was flooded so we had to double back."}, {"viet": "Căn phòng đó đo được 10 mét bề rộng.", "eng": "The room measure 10 metres across."}, {"viet": "Cá rắn lục có những chiếc răng như gươm.", "eng": "The saber-toothed viper-fish certainly has."}, {"viet": "Cảnh vật đẹp không tả xiết.", "eng": "The scenery was beautiful beyond description."}, {"viet": "Vải phủ mặt ghế được buộc yên vị bằng các dải.", "eng": "The seat covers are held in place by tapes."}, {"viet": "Mặt Trời đang lặn làm bầu trời phía tây đỏ như máu.", "eng": "The setting sun ensanguined the western sky."}, {"viet": "Con tàu mắc cạn ở cách bờ vài mã.", "eng": "The ship touched ground a few yards from the shore."}, {"viet": "Tiếng xuýt của hơi nước thoát ra.", "eng": "The sibilant noise of steam escaping."}, {"viet": "Trong da có nhiều loại tế bào khác nhau.", "eng": "The skin has many different kinds of cells in it."}, {"viet": "Các đảng viên Xã hội chiếm 35% số phiếu.", "eng": "The Socialists got 35% of the vote."}, {"viet": "Tiếng sóng vỗ trên bờ biển.", "eng": "The sound of waves breaking on the beach."}, {"viet": "Phi đội đó bị trở ngại vì sương mù dày đặc.", "eng": "The squadron is weathered in because of dense fog."}, {"viet": "Cuộc khủng hoảng của thị trường chứng khoán đã đánh vào chỗ yếu của nền kinh tế Hoa Kỳ, thí dụ sự thâm hụt mậu dịch.", "eng": "The stock-market crisis struck at the soft underbelly of the US economy."}, {"viet": "Dây buộc gói hàng bị lỏng.", "eng": "The string around the parcel was slack."}, {"viet": "Trời đang nắng nhưng tôi sẽ đem ô đi để đề phòng.", "eng": "The sun is shining, but I'll take an umbrella just in case."}, {"viet": "Chế độ thuế khoá nghiêng hẳn về phía quyền lợi của các tầng lớp trên.", "eng": "The tax structure, which is weighted heavily in favour of the upper classes."}, {"viet": "Đội đó đã nhanh chóng triệt hạ các đấu thủ của họ.", "eng": "The team made short work of their opponents."}, {"viet": "Chủ đề cuộc thảo luận của chúng tôi là'châu Âu thập kỷ 1980'.", "eng": "The theme of our discussion was'Europe in the 1980's'."}, {"viet": "Thời gian trăng tròn này đến trăng tròn sau là khoảng chừng 29 ngày rưỡi.", "eng": "The time from full moon to full moon is about 29 1/2 days."}, {"viet": "Chiếc máy kéo kéo căng dây cáp và lôi chiếc xe moóc ra khỏi bùn.", "eng": "The tractor took up the slack and pulled the trailer out of the mud."}, {"viet": "Việc xét xử được hoãn một tuần lễ cho đến tuần sau.", "eng": "The trial was adjourned for a week until the following week."}, {"viet": "Hai người yêu nhau tụt lại đằng sau để được đi riêng.", "eng": "The two lovers dropped back so as to be alone."}, {"viet": "Công đoàn la ầm lên khi một đoàn viên của họ bị sa thải.", "eng": "The union yelled blue murder when one of its members was sacked."}, {"viet": "Vấn đề nan giải là ai phải bồi thường thiệt hại.", "eng": "The vexed question of who pays for the damage."}, {"viet": "Giấy dán tường trong phòng tắm bị bong ra.", "eng": "The wallpaper in the bathroom is coming off."}, {"viet": "Lợi ích cá nhân gắn liền với lợi ích công cộng.", "eng": "The welfare of the individual is bound up with the welfare of the community."}, {"viet": "Gió thổi giấy tờ tung khắp phòng.", "eng": "The wind scattered the papers all over the room."}, {"viet": "Lực lượng lao động miễn cưỡng đồng ý chấp nhận việc cắt giảm tiền lương.", "eng": "The work force has reluctantly agreed to accept a cut in pay."}, {"viet": "Cô gái chơi viôlông trẻ đã sáng chói hơn tất cả các thí sinh khác.", "eng": "The young girl violinist outshone all the other competitors."}, {"viet": "Đồ đạc của họ mang tính thẩm mỹ nhiều hơn là tính tiện dụng.", "eng": "Their furniture was more aesthetic than practical."}, {"viet": "Thành công của họ vượt quá mọi điều mong đợi.", "eng": "Their success exceeded all expectations."}, {"viet": "Sau đó anh hãy cố thay đổi hoặc học cách tự chấp nhận lấy thực trạng.", "eng": "Then you can try to change your ways, or learn to accept yourself the way you are."}, {"viet": "Trong lớp có nhiều loại năng lực cao thấp khác nhau.", "eng": "There's a wide range of ability in the class."}, {"viet": "Không gì tốt hơn là tắm nước nóng vào buổi sáng.", "eng": "There's nothing better than a hot water in the morning."}, {"viet": "Có năm mươi người được đăng ký tham gia cuộc trưng bày chó.", "eng": "There are fifty entrants for the dog show."}, {"viet": "Có vài bộ quần áo lót sạch trong ngăn kéo đấy.", "eng": "There are some clean underclothes in the drawer."}, {"viet": "Đã có phần giảm xuống trong thương mại xuất khẩu của chúng ta.", "eng": "There has been some shrinkage in our export trade."}, {"viet": "Trên áo khoác này có một vết ố.", "eng": "There is a stain on this jacket."}, {"viet": "Có một cửa hàng trên đường Robson.", "eng": "There is one on Robson St."}, {"viet": "Đêm qua trong quán rượu có một vụ om sòm kinh khủng.", "eng": "There was a dreadful shindy in the pub last night."}, {"viet": "Không có dấu hiệu nào báo có bão xung quanh khu vực biển.", "eng": "There was no storm-signal along coast areas."}, {"viet": "Có những sinh viên đang phát truyền đơn cho các người đi đường.", "eng": "There were students dishing out leaflets to passers-by."}, {"viet": "Những ngăn kéo này đầy cả giấy lộn, đã đến lúc tôi phải làm một cuộc tổng thanh toán mới được.", "eng": "These drawers are full of rubbish, it's time I had a good turn-out."}, {"viet": "Những sản phẩm này không chỉ nhằm mục đích trang trí mà còn có công dụng thực tiễn.", "eng": "These products are not only for ornamental purpose but also for practical use."}, {"viet": "Họ không chuyện trò với nhau sau vụ cãi lộn.", "eng": "They're not on speaking terms after their quarrel."}, {"viet": "Họ luôn làm chúng tôi cảm thấy tự nhiên, thoải mái.", "eng": "They always make us feel very much at home."}, {"viet": "Họ đến công ty điện tín và vô tuyến.", "eng": "They arrive at the Cable and Wireless Company."}, {"viet": "Chúng thuộc nhiều nơi trên thế giới.", "eng": "They come from all parts of the world."}, {"viet": "Họ mò dưới sông tìm xác đứa bé.", "eng": "They dragged the river for the child's body."}, {"viet": "Mặc dù thời tiết xấu, họ đã có một chuyến nghỉ tuyệt vời.", "eng": "They had a wonderful holiday, despite the bad weather."}, {"viet": "Họ đòi tuần làm việc ngắn hơn.", "eng": "They hold out for a shorter working week."}, {"viet": "Chúng nó đã xoay sở được mà không cầu đến sự giúp đỡ bên ngoài.", "eng": "They managed without recourse to outside help."}, {"viet": "Họ cầu nguyện sớm được giải thoát khỏi cảnh bị giam giữ.", "eng": "They prayed for an early deliverance from captivity."}, {"viet": "Họ cười nhạo ý nghĩ là mọi thứ đều có thể thay đổi.", "eng": "They scoffed at the idea that anything could be changed."}, {"viet": "Họ cảm ơn bà chủ, bà Brown.", "eng": "They thanked their hostess, Mrs. Brown."}, {"viet": "Tất cả bọn họ đều rất tồi nhưng anh cư xử tồi nhất.", "eng": "They were all very bad but you behaved worst of all."}, {"viet": "Họ ngạc nhiên về sự thẳng thắn của bà ta khi bà nói về cuộc sống riêng tư của mình.", "eng": "They were surprised by her openness when talking about her private life."}, {"viet": "Lời tố cáo hối lộ này là một sự bôi nhọ đê tiện một công dân đáng kính trọng.", "eng": "This accusation of bribery is a vile smear on an honourable citizen."}, {"viet": "Chiếc đồng hồ treo tường này đã qua nhiều chủ.", "eng": "This clock has outlasted several owners."}, {"viet": "Bài tiểu luận này quá ngắn nên nó chỉ mới lướt sơ qua chủ đề mà thôi.", "eng": "This essay is so short that it can only scratch the surface of the topic."}, {"viet": "Anh đã đẩy chúng tôi vào tình trạng hay ho thế này đây!", "eng": "This is a nice mess you've got us into!"}, {"viet": "Đây là người đàn bà có cậu con trai bị ốm.", "eng": "This is the woman whose little boy was ill."}, {"viet": "Đài tưởng niệm quốc gia này gợi nhớ những người đã chết trong cuộc chiến.", "eng": "This national monument commemorates those who died in the war."}, {"viet": "Món quà này là lời cảm ơn anh đã giúp tôi tuần trước.", "eng": "This present's a thank you for helping me last weekend."}, {"viet": "Tiêu chuẩn của công việc không thể chấp nhận được, làm lại đi.", "eng": "This standard of work is not acceptable, do it again."}, {"viet": "Điều này sẽ là một sự tăng lớn đối với nền kinh tế.", "eng": "This will be a great boost to the economy."}, {"viet": "Ba hồ nước phản chiếu ánh trăng là tên của một hòn đảo lớn nhất có ba ngôi chùa đá ở phía nam.", "eng": "Three Pools Mirroring the Moon is the name of the largest island which has three stone pagodas on the south of it."}, {"viet": "Tối nay bà Cole sẽ tổ chức một buổi tiệc khiêu vũ tại nhà bà ấy và mời bạn đến đó.", "eng": "Tonight Mrs. Cole is going to have a dancing party at her house and asks you to be there."}, {"viet": "Nếu không còn việc gì khác, thì chúng ta có thể kết thúc cuộc họp.", "eng": "Unless there is any other business, we can end the meeting."}, {"viet": "Bột giặt tẩy có thành phần chất diệt sinh.", "eng": "Washing powder that has bioactive ingredient."}, {"viet": "Chúng tôi đảm bảo là mọi thứ đều sẽ sẵn sàng cho các ông.", "eng": "We'll make sure everything is ready for you."}, {"viet": "Chúng tôi đã mời bạn bè đến ăn buổi tối và bây giờ báo hoãn lại thì muộn quá mất rồi.", "eng": "We're invited friends to supper and it's too late to put them off now."}, {"viet": "Chúng ta đã làm xong phần khó khăn của công việc.", "eng": "We've done the difficult part of the job."}, {"viet": "Tất cả chúng tôi đều ( cho rằng ) vận may của chúng tôi sắp hết.", "eng": "We all felt ( that ) our luck was about to turn."}, {"viet": "Chúng tôi là bạn cũ, chúng tôi biết nhau từ khi còn nhỏ.", "eng": "We are old friends we've known each other since we were children."}, {"viet": "Chúng ta gọi nó là lễ giáng sinh.", "eng": "We call it Christmas."}, {"viet": "Chúng ta có thể thắng hội này 2-0 hoặc 2-1.", "eng": "We can win the rubber 2 games to nil or 2-1."}, {"viet": "Chúng tôi đã có một sự thoả thuận với ban giám đốc về giờ làm thêm.", "eng": "We did a deal with the management on overtime."}, {"viet": "Chúng tôi lo ngại sức mạnh quân sự của địch.", "eng": "We fear the military might of the enemy."}, {"viet": "Chúng tôi nhận được lệnh không cho người lạ vào.", "eng": "We had instructions not to admit stranger."}, {"viet": "Chúng tôi có đủ than cho đến hết mùa đông.", "eng": "We have enough coal to see the winter out."}, {"viet": "Chúng tôi chẳng nhận được tin tức gì về anh ấy đã nhiều tuần nay nhưng chúng tôi vẫn hy vọng ( sẽ nhận được thư ).", "eng": "We haven't heard from him for weeks but we're still hoping ( for a letter )."}, {"viet": "Chúng tôi sẽ tính cùng giá cho ông.", "eng": "We'll charge you the same price."}, {"viet": "Chúng ta phải chống lại chủ nghĩa cực đoan trong đảng.", "eng": "We must counteract extremism in the party."}, {"viet": "Chúng tôi cần người thật lịch thiệp để tổ chức bữa tiệc đó.", "eng": "We need someone with lots personality to organize the party."}, {"viet": "Chúng tôi đã đến nơi an toàn ở bờ sông.", "eng": "We reached the safety of the river bank."}, {"viet": "Chúng tôi có thể dọn đến nhà mới tuần tới.", "eng": "We should be able to move in next week."}, {"viet": "Chúng ta đã đối xử với các dân tộc bản xứ một cách dã man, cướp bóc đất đai và tài nguyên của họ.", "eng": "We treated the native peoples barbarically, plundering their land and resources."}, {"viet": "Tất cả chúng tôi đều rất phấn khởi khi chúng tôi nghe thấy tin đó.", "eng": "We were all excited when we heard the news."}, {"viet": "Chúng tôi đang xem cuộc diễu hành trên vô tuyến thì Jess nói Ồ, nhìn kìa, Heldi kìa Tôi thật là ngạc nhiên quá đỗi.", "eng": "We were watching the parade on TV and Jess said Oh look, there's Heldi-I almost died."}, {"viet": "Những tiếng la hét kỳ lạ vọng ra trong bóng đêm.", "eng": "Weird shrieks were heard in the darkness."}, {"viet": "À, để tôi xem có thể giúp gì cho ông không.", "eng": "Well, let me see if I can help you."}, {"viet": "Dù sao thì có gì thú vị về Las Vegas không?", "eng": "What's so interesting about Las Vegas anyway?"}, {"viet": "Một số việc mà người ta có thể thực hiện để ngăn chặn sự phân biệt đối xử là gì?", "eng": "What are some things that people can do to stop discrimination?"}, {"viet": "Những diễn biến đó có ý nghĩa gì đối với họ?", "eng": "What did these developments import to them?"}, {"viet": "Chương trình này có thể làm được các việc gì?", "eng": "What functions can this program perform?"}, {"viet": "Tên của công viên đó là gì?", "eng": "What is the name of that park?"}, {"viet": "Loại rau nào đang mùa vậy?", "eng": "What kind of vegetables are in season?"}, {"viet": "Các môn thể thao nào được chơi phổ biến ở Úc?", "eng": "What sports are popular to play in Australia?"}, {"viet": "Bánh xe làm ô tô, xe tải, xe đạp chuyển động.", "eng": "Wheels make cars, lorries and bicycle move."}, {"viet": "Khi con bà ta về chậm hai tiếng đồng hồ, bà ta đã cuống cuồng lo lắng.", "eng": "When her child was two hours late, she became quite demented."}, {"viet": "Khi bạo loạn nổ ra, cảnh sát buộc phải can thiệp.", "eng": "When rioting broke out, the police were obliged to intervene."}, {"viet": "Khi họ bắt đầu nói về kinh tế học, tôi không thể hiểu chút gì.", "eng": "When they start talking about economics, I'm out of my depth."}, {"viet": "Tôi có thể mua tem ở đâu?", "eng": "Where can I buy some stamps?"}, {"viet": "Thành phố nào có giá sinh hoạt cao nhất trên thế giới?", "eng": "Which city has the highest cost of living in the world?"}, {"viet": "Ông muốn dùng gì cho món tráng miệng, kem hay xi-rô trái cây?", "eng": "Which would you like for dessert, ice cream or sherbet?"}, {"viet": "Ai là nhà thiết kế nổi tiếng nhất Nhật Bản?", "eng": "Who is Japan's most famous designer?"}, {"viet": "Tại sao anh hút thuốc mặc dù anh biết là nguy hiểm?", "eng": "Why do you smoke when you know it's dangerous?"}, {"viet": "Trái cây rừng đã cứu chúng tôi khỏi chết đói.", "eng": "Wild fruit kept us from dying of starvation."}, {"viet": "Vui lòng gửi nó ngay lập tức nhé?", "eng": "Will you please send it straight away?"}, {"viet": "Hai cánh tay cô ta đưa ra trong tư thế quy hàng.", "eng": "With her arms flung out in an attitude of surrender."}, {"viet": "Những người công nhân bị trói buộc vào cuộc sống buồn tẻ.", "eng": "Workers who were chained to a life of dull routine."}, {"viet": "Các ông muốn rượu vang ngọt hay rượu vang nguyên chất ạ?", "eng": "Would you like sweet wine or dry wine?"}, {"viet": "Cô vui lòng mang một tô mì sợi đến phòng của tôi được không?", "eng": "Would you please send a bowl of noodles to my room?"}, {"viet": "Có, nhưng kiến thức của tôi hơi hạn chế.", "eng": "Yes, but my knowledge is rather limited."}, {"viet": "Vâng, chúng tôi có thể chuyển đổi nhân dân tệ chưa sử dụng của bà sang ngoại tệ cho bà.", "eng": "Yes, we can convert your unused Renminbi back into foreign money for you."}, {"viet": "Tôi e rằng anh sẽ phải ăn đứng bữa tối!", "eng": "You'll have to eat your dinner off your knees, I'm afraid!"}, {"viet": "Anh lâm vào thế nguy hiểm khi chỉ trích con gái ông ấy.", "eng": "You're on dangerous ground when you criticize his daughter."}, {"viet": "Anh chịu trách nhiệm phần lớn tai nạn này.", "eng": "You are largely responsible for the accident."}, {"viet": "Anh không thể che chở cho tên tội phạm này khỏi bị khởi tố đâu.", "eng": "You can't shield this criminal from prosecution."}, {"viet": "Anh có thể kéo một chiếc dây thừng nhưng không thể đẩy nó được!", "eng": "You can pull a rope, but you can't push it!"}, {"viet": "Bạn đã không nói cho tôi biết khi nào bạn sẽ đến.", "eng": "You didn't tell me when you arriving."}, {"viet": "Ngày nay các bạn phải có tinh thần tranh đua cao trong lĩnh vực thể thao.", "eng": "You have to be highly competitive to do well in sport nowadays."}, {"viet": "Ông có thể đích thân hoặc gửi thư lấy vé.", "eng": "You may apply for tickets in person or by letter."}, {"viet": "Anh phải chiếu cố cho anh ta vì anh ta bị ốm.", "eng": "You must make allowance for him because he had been ill."}, {"viet": "Anh trả tiền vận chuyển, khi về tôi sẽ hoàn lại anh.", "eng": "You pay for the transport, and i will reimburse you when we get back home."}, {"viet": "Cậu nên tỏ lòng kính trọng hơn đối với bậc cao tuổi và có kinh nghiệm hơn mình.", "eng": "You should show greater respect for your elders and betters."}, {"viet": "Người ta đã nói rõ ràng cho anh biết là không được đụng vào giấy tờ của tôi.", "eng": "You were expressly told not to touch my papers."}, {"viet": "Báo cáo của anh về các sự kiện phù hợp với báo cáo của chị ấy.", "eng": "Your account of events corresponds with hers."}, {"viet": "Bữa tiệc của bạn trùng với một đám cưới mà tôi sắp đi dự.", "eng": "Your party clashes with a wedding I'm going to."}]