[{"viet": "5 bảng thôi là quá đủ cho nhu cầu của tôi.", "eng": "£ 5 will be ample for my needs."}, {"viet": "Một cậu bé được chú ý vì sự đần độn của cậu ta.", "eng": "A boy who is remarkable for his stupidity."}, {"viet": "Một điếu thuốc lá cháy âm ỉ trong cái gạt tàn thuốc.", "eng": "A cigarette smoldering in the ashtray."}, {"viet": "Một hội đồng bô lão cai quản bộ lạc.", "eng": "A council of elders governs the tribe."}, {"viet": "Một điều chứng minh một định luật vật lý.", "eng": "A demonstration of a law of physics."}, {"viet": "Một đám bụi bay qua cánh đồng.", "eng": "A dust-cloud swept across the plain."}, {"viet": "Một buổi độc tấu sáo hay.", "eng": "A fine solo performance on the flute."}, {"viet": "Vành đai xung quanh thành phố.", "eng": "A girdle of greenfields round a town."}, {"viet": "Một khách trọ yêu cầu dọn dẹp phòng của ông ấy.", "eng": "A guest asks for his room to be cleaned."}, {"viet": "Một con ngựa có một đốm trắng ở đầu của nó.", "eng": "A horse with a white mark on its head."}, {"viet": "Một bước ngoặc trong lịch sử nghệ thuật hiện đại.", "eng": "A landmark in the history of modern art."}, {"viet": "Một bản dịch theo sát từng từ một không phải bao giờ cũng sát nghĩa nhất với nguyên bản.", "eng": "A literal translation is not always the closest to the original meaning."}, {"viet": "Một người hư hỏng vì giao du với bạn bè xấu.", "eng": "A man depraved by bad company."}, {"viet": "Một sự hồi tưởng mơ hồ về một giấc mơ.", "eng": "A misty recollection of a dream."}, {"viet": "Một kíp ngựa mới được thắng vào chiếc xe.", "eng": "A new relay of horses was harnessed to the cart."}, {"viet": "Một hình thức phân biệt chủng tộc rất tàn bạo.", "eng": "A particularly virulent form of racism."}, {"viet": "Đồ gốm được nung ngay sau khi nó được tạo dáng.", "eng": "A piece of pottery is fired as soon as it is shaped."}, {"viet": "Cứ nhiều điều tốt là ổn!", "eng": "A precious lot of good that will do!"}, {"viet": "Một mớ hỗn tạp những lý thuyết lạ lùng.", "eng": "A rag-bag of strange theories."}, {"viet": "Một cái áo choàng được thêu chỉ vàng.", "eng": "A robe embroidered with gold thread."}, {"viet": "Một hệ thống xã hội và kinh tế bán phong kiến.", "eng": "A semi-feudal social and economic system."}, {"viet": "Giác quan thứ sáu bảo cô ta biết rằng anh ấy đang chờ cô khi cô về tới nhà.", "eng": "A sixth sense told her that he would be waiting for her when she got home."}, {"viet": "Một giá đặc biệt gồm cả năm bảng Anh bưu phí.", "eng": "A special offer at £ 5 post-free."}, {"viet": "Một studio có dàn điều khiển bằng điện tử.", "eng": "A studio with an array of electronic controls."}, {"viet": "Một bằng chứng về niềm tin của ai.", "eng": "A testament to somebody's beliefs."}, {"viet": "Một nguồn thu nhập hữu ích cho hội từ thiện.", "eng": "A useful source of income for the charity."}, {"viet": "Một khoảng cách lớn giữa người thắng và người thua.", "eng": "A wide margin between the winner and the loser."}, {"viet": "Theo các qui định của chúng tôi, nếu chiều nay bà nghỉ lại trong phòng, chúng tôi sẽ phải tính bà 50% tiền phòng.", "eng": "According to our regulations we'll have to charge you 50% of the price if you rest in the room this afternoon."}, {"viet": "Tuổi thanh niên là một tuổi trung gian vụng về.", "eng": "Adolescence is an awkward, in-between age."}, {"viet": "Sau khi lăng mạ chủ nhà của anh ấy, anh ta đã bị mời ra khỏi cửa.", "eng": "After having insulted his host, he was shown the door."}, {"viet": "Sau tai nạn đó chiếc ôtô hoàn toàn là một đống sắt vụn.", "eng": "After the accident, the car was a complete write-off."}, {"viet": "Không khí, thực phẩm và nước đều không thể thiếu đối với cuộc sống.", "eng": "Air, food and water are indispensable to life."}, {"viet": "Tất cả công việc khó nhọc của chúng tôi mang lại ít hoặc chẳng có kết quả gì.", "eng": "All our hard work produced little or no result."}, {"viet": "Mọi nhu cầu của họ đã được vị chủ nhà đáp ứng.", "eng": "All their wants were provided by their host."}, {"viet": "Liệu tôi đang có ảo giác hay thật sự là Bill ở đằng kia?", "eng": "Am I seeing things or is that Bill over there?"}, {"viet": "Một bản thông cáo được phát đi trên hệ thống loa phóng thanh.", "eng": "An announcement made over the Tannoy."}, {"viet": "Một sự kiện báo hiệu sự thay đổi trong dư luận quần chúng.", "eng": "An event signalling a change in public opinion."}, {"viet": "Một nét đặc trưng của đời sống đô thị.", "eng": "An interesting feature of city life."}, {"viet": "Một câu trả lời không tỏ ra nao núng về một câu hỏi có tính chất rất cá nhân.", "eng": "An unblinking answer to a very personal question."}, {"viet": "Và khi người ta tham chiến, họ thấy sợ hãi.", "eng": "And when people are in a war, they're afraid."}, {"viet": "Bất cứ ai cung cấp tin tức đưa đến việc thu hồi bức tranh cũng sẽ được thưởng công.", "eng": "Anyone providing information which leads to the recovery of the painting will be rewarded."}, {"viet": "Có cột mốc nào trên đường đi không?", "eng": "Are there any landmarks on the way?"}, {"viet": "Bạn sẽ đi xem bóng đá chứ?", "eng": "Are you going to the match?"}, {"viet": "Cướp có vũ trang đang gia tăng khắp nơi.", "eng": "Armed robbery is on the increase everywhere."}, {"viet": "Như tôi đã dự kiến, họ đã giữ lời hứa.", "eng": "As I expected, they kept their word."}, {"viet": "Hãy hỏi cô ta xem cô ta có kinh nghiệm gì.", "eng": "Ask her what experience she has had."}, {"viet": "Ngay lúc đó Tom mở cửa.", "eng": "At that very minute, tom opened the door."}, {"viet": "Cấp cho nạn nhân đó 500 bảng Anh để bồi thường thiệt hại.", "eng": "Award the victim £ 500 in recompense for damages."}, {"viet": "Xin hãy cẩn thận đừng để vấp phải tấm thảm chùi chân.", "eng": "Be careful you don't trip up on the mat."}, {"viet": "Có vẻ giông giống vật gì.", "eng": "Bear a general resemblance to something."}, {"viet": "Dưới vẻ hòa nhã khác thường của ông ta có đôi chút chua chát và cứng rắn đấy.", "eng": "Below his preternatural affability there is some acid and steel."}, {"viet": "Bản nhạc mới của ban Blue Funk đã có vị trí cao trong danh mục có nhiều người yêu cầu.", "eng": "Blue Funk's new hit has had good ratings in the charts."}, {"viet": "Anh quốc có mức thất nghiệp cao, nhưng điều đó cũng xảy ra ở nhiều nước khác.", "eng": "Britain has a high level of unemployment, but the same goes for many countries."}, {"viet": "Nhưng làm sao con lấy chìa khoá ra được trong khi con đang cầm tất cả những cái túi này chứ?", "eng": "But how can I get the key while I'm holding all these bags?"}, {"viet": "Thế nhưng tòa án tối cao đã phán quyết rằng chuyện đó không vi phạm hiến pháp.", "eng": "But the Supreme Court ruled it wasn't unconstitutional."}, {"viet": "Đến khoảng nửa đêm thì hắn đã nốc khoảng hai chai rượu chát.", "eng": "By midnight he had put back nearly two bottles of wine."}, {"viet": "Tôi có thể giúp gì được không, thưa ông?", "eng": "Can I be of any assistance, sir?"}, {"viet": "Những trái phiếu này có đổi thành tiền được trong một thời hạn ngắn không?", "eng": "Can these bonds be realized at short notice?"}, {"viet": "Anh có thể nhảy qua bờ bên kia không?", "eng": "Can you jump over to the opposite bank?"}, {"viet": "Cô có thể cho tôi biết Văn phòng Du lịch nằm ở đâu không?", "eng": "Can you tell me where the Tourist Information Office is located?"}, {"viet": "Tạo được sự cải thiện quan trọng về điều kiện làm việc.", "eng": "Cause a significant improvement in working."}, {"viet": "Bọn trẻ bán các băng giấy kêu gọi đóng góp cho việc nghiên cứu ung thư.", "eng": "Children selling flags for a cancer research appeal."}, {"viet": "Những đám mây tụ lại trên các đỉnh núi.", "eng": "Clouds have settled over the mountain tops."}, {"viet": "Thay cách trả tiền trợ cấp hàng năm thành trả tiền gộp một lần.", "eng": "Commute an annuity into a lump sum."}, {"viet": "Coi việc quản lý nhà nước tồi là một điều chứng minh cho cuộc cách mạng.", "eng": "Considered misgovernment to be a justification for revolution."}, {"viet": "Ông vui lòng điền vào thẻ đăng ký này nhé?", "eng": "Could you fill out the registration card, please?"}, {"viet": "Những quốc gia thù địch với chúng ta.", "eng": "Countries that are inimical to us."}, {"viet": "Ba nó ơi, anh cũng dắt con Mani đi dạo nhé?", "eng": "Daddy, would you also take Mani for a walk?"}, {"viet": "Tính dân chủ chính nó được thử nghiệm khi đất nước chuẩn bị cho các cuộc bầu cử tự do lần đầu tiên.", "eng": "Democracy itself is on trial as the country prepares for its first free elections."}, {"viet": "Các nhà soạn tự điển phải rất giỏi về thuật định nghĩa.", "eng": "Dictionary writers must be skilled in art of definition."}, {"viet": "Bạn đã ở tại một khách sạn trong khu nghỉ mát phải không?", "eng": "Did you stay at a resort hotel?"}, {"viet": "Tất cả các nhân viên đều ngủ ở đây phải không?", "eng": "Do all the men sleep here?"}, {"viet": "Chúng ta vẫn còn kem đánh giày màu nâu phải không?", "eng": "Do we still have brown shoe cream?"}, {"viet": "Bạn có máy vi tính xách tay không?", "eng": "Do you have a laptop computer?"}, {"viet": "Bạn có quen với ai biết nói tiếng Anh không?", "eng": "Do you know anybody who speaks English?"}, {"viet": "Anh có cần giặt hấp cái nào không?", "eng": "Do you need to have anything dry-cleaned?"}, {"viet": "Bạn có nghĩ là giá cả ở các cửa hàng phục vụ 24/24 giờ của Nhật thì phải chăng không?", "eng": "Do you think that the prices in Japanese convenience stores are reasonable?"}, {"viet": "Nó chạy thẳng lên tầng thượng à?", "eng": "Does it go all the way to the top?"}, {"viet": "Đừng bất mãn vì sự bên ngoài thô lỗ của anh ấy, trong thâm tâm anh ấy quả thật là một người rất tử tế.", "eng": "Don't be put off by his gruff exterior, he's really very kind underneath."}, {"viet": "Đừng quấy rầy trong khi tôi đang lái xe.", "eng": "Don't fuss me while I'm driving."}, {"viet": "Đừng rút trội tiền trong tài khoản của anh mà không báo cho tôi biết trước.", "eng": "Don't overdraw your account without telling us in advance."}, {"viet": "Đừng cố làm ra vẻ cầu kỳ điệu bộ như vậy-hãy cư xử theo bản chất tự nhiên của chính anh.", "eng": "Don't try to act sophisticated-just be yourself."}, {"viet": "Mặc quần áo được một nhà thiết kế hàng đầu New York thiết kế.", "eng": "Dressed by a leading New York designer."}, {"viet": "Mỗi siêu cường đều tiếp tục trang bị vũ khí cho nước dựa vào mình.", "eng": "Each superpower continues to arm its client state."}, {"viet": "Ở Nhật Bản, việc dạy tiếng Anh bắt đầu ở trường tiểu học.", "eng": "English education has begun in elementary school in Japan."}, {"viet": "Rốt cuộc họ cũng moi được sự thật từ cô ấy.", "eng": "Eventually they wormed the truth out of her."}, {"viet": "Xin lỗi, chúng tôi bị lạc đường.", "eng": "Excuse me, but we are lost."}, {"viet": "Thời tiết bất thường đối với thời gian trong năm.", "eng": "Extraordinary weather for the time of year."}, {"viet": "Cảm thấy rất gắn bó với gia đình của ai.", "eng": "Feel a strong attachment to one's family."}, {"viet": "Các tòa nhà cổ đẹp đã chịu thử thách qua bao thế kỷ.", "eng": "Fine old buildings that have stood the test of centuries."}, {"viet": "Hoa luôn làm cho căn phòng tươi tắn lên.", "eng": "Flower always cheer a room up."}, {"viet": "Vì lý do nào đó không giải thích được, lá thư đó đã không bao giờ tới nơi.", "eng": "For some unaccountable reason, the letter never arrived."}, {"viet": "Sự cọ xát giữa hai cây que có thể tạo ra lửa.", "eng": "Friction between two sticks can create a fire."}, {"viet": "Nói chung, khách sạn có thể được phân thành bốn loại theo sự thay đổi của nhóm khách.", "eng": "Generally speaking, hotels can be classified into four categories according to the variation of their clientele."}, {"viet": "Tường thuật đúng đắn về những việc đã xảy ra.", "eng": "Give an unvarnished account of what happened."}, {"viet": "Đi vào phòng tắm rửa tay đi.", "eng": "Go and wash your hands in the bathroom."}, {"viet": "Hết chính phủ này đến chính phủ khác nhưng thật sự liệu có gì thay đổi không?", "eng": "Governments come and go but does anything really changed?"}, {"viet": "Treo mũ cậu lên cái móc đó.", "eng": "Hang your coat up on that hook."}, {"viet": "Bạn cũng đã đọc qua mục rao vặt rồi chứ?", "eng": "Have you also been looking through the classified ads?"}, {"viet": "Anh đã chọn ngày làm đám cưới chưa?", "eng": "Have you fixed on a date for the wedding?"}, {"viet": "Ông ta đã mua đứt tất cả cổ phần của những người làm ăn chung nên bây giờ ông ta làm chủ cả một công ty.", "eng": "Having bought out all his partners he now owns the whole company."}, {"viet": "Ông ta đã rũ bỏ mọi trách nhiệm trong vụ này.", "eng": "He's abdicated all responsibility in the affair."}, {"viet": "Anh ta theo Cơ đốc giáo nhưng vợ anh ta theo Thiên chúa giáo.", "eng": "He's chapel but his wife is Roman Catholic."}, {"viet": "Ông ta vừa mới công bố những điều ông đã quan sát được về đời sống của loài chim ở nước Anh.", "eng": "He's just published his observations on British bird life."}, {"viet": "Anh ta bướng bỉnh và cô ta cũng thế nhưng ở mức độ ít hơn.", "eng": "He's stubborn, and so is she, but to a lesser degree."}, {"viet": "Hắn nhắm kỹ rồi bóp cò.", "eng": "He aimed carefully and then let fly."}, {"viet": "Anh ta bị lúng túng trong các điều phức tạp của hệ thống pháp lý.", "eng": "He became ensnared in the complexities of the legal system."}, {"viet": "Nó đã về cuối cùng trong cuộc đua.", "eng": "He came last in the race."}, {"viet": "Anh ấy sống biệt lập với những cuốn sách của mình.", "eng": "He cloistered himself away with his books."}, {"viet": "Anh ấy đập mạnh cái ly xuống đất.", "eng": "He dashed the glass to the ground."}, {"viet": "Ông ta có sáng tác chút ít, nhưng nghề chính của ông ta là giáo viên.", "eng": "He does a bit of writing, but first and foremost he's a teacher."}, {"viet": "Nó thoát được trong gang tấc.", "eng": "He escaped by the skin of his teeth."}, {"viet": "Khi cậu con có liên can thì ông ta khó lòng giữ thái độ vô tư.", "eng": "He finds it difficult to remain objective where his son is concerned."}, {"viet": "Hắn từ bỏ cuộc đấu tranh trong nỗi tuyệt vọng.", "eng": "He gave up the struggle in despair."}, {"viet": "Anh ta có thói quen lạ lùng là gọi vợ bằng bà Smith.", "eng": "He had a strange quirk of addressing his wife as Mrs. Smith."}, {"viet": "Anh ấy có khiếu học ngôn ngữ.", "eng": "He has a good feel for languages."}, {"viet": "Anh ấy hết lòng tin bác sĩ.", "eng": "He has great belief in his doctor."}, {"viet": "Mấy ngày nay nó không được đi dạo.", "eng": "He hasn't gone for a walk in a few days."}, {"viet": "Anh ta luôn sẵn lòng trình bày rõ ràng các quan điểm của mình về vấn đề chính trị.", "eng": "He is always willing to enunciate his opinions on the subject of politics."}, {"viet": "Ông ta là chỉ huy phó trung đoàn đó.", "eng": "He is second in command of the regiment."}, {"viet": "Ông ta để ví tiền ở một túi trong.", "eng": "He kept his wallet in an inside pocket."}, {"viet": "Ông ta đã sống rất thọ.", "eng": "He lived to a great age."}, {"viet": "Anh ta làm như thể sắp đánh cô ấy.", "eng": "He made as if to strike her."}, {"viet": "Anh ta nói nhỏ cái gì đó với cô bán hàng về việc mất ví tiền của mình.", "eng": "He muttered something to the salesgirl about losing his wallet."}, {"viet": "Anh ta chuyển cho tôi tờ 10 đôla.", "eng": "He passed me a ten spot."}, {"viet": "Anh ta tuyên bố không thích nhạc hiện đại.", "eng": "He professes a distaste for modern music."}, {"viet": "Nó chạy lên dốc đến đỉnh đồi.", "eng": "He ran up the slope to the top of the hill."}, {"viet": "Anh ấy đại diện cho công ty trong cuộc họp.", "eng": "He represented his company at the meeting."}, {"viet": "Anh ta đúng là một người khả ái.", "eng": "He's a real heart-throb."}, {"viet": "Ông ta nổi tiếng khắp thế giới.", "eng": "He's famous all over the world."}, {"viet": "Anh ta không phải loại người như tôi.", "eng": "He's not my type of person."}, {"viet": "Ông ta có tài sản trị giá khoảng 10 triệu bảng Anh.", "eng": "He's worth about £ 10 million."}, {"viet": "Anh ta la hét lên là có đám cháy.", "eng": "He screamed that there was a fire."}, {"viet": "Ông ấy tỏ ác cảm rõ rệt đối với người ngoại quốc.", "eng": "He showed a marked antipathy to foreigners."}, {"viet": "Tại đó ông bỏ ra năm năm nghiên cứu thiên văn học, toán học và y học.", "eng": "He spent five years there studying astronomy and mathematics and medicine."}, {"viet": "Nó đứng xa hẳn đám đông.", "eng": "He stood aloof from the crowd."}, {"viet": "Anh ta đu phóng người lên yên ngựa.", "eng": "He swung himself up into the saddle."}, {"viet": "Anh ta kể cho chúng tôi một câu chuyện bịa nào đó về chuyện anh ta đánh mất hết tiền.", "eng": "He told us some cock-and-bull story about having lost all his money."}, {"viet": "Hắn ta tìm cách hôn cô ấy nhưng cô đã chỉnh hắn ngay.", "eng": "He tried to kiss her but she quickly put him in his place."}, {"viet": "Anh ta hoàn toàn cự tuyệt lời đề nghị kết bạn của tôi.", "eng": "He utterly repudiated my offer of friendship."}, {"viet": "Anh ta khát khao được về thăm nhà.", "eng": "He was aching to go home."}, {"viet": "Nó bị mấy đứa lớn hơn bắt nạt ở trường.", "eng": "He was bullied by older boys at school."}, {"viet": "Anh ta mặc áo khoác cát sơ mi thanh lịch.", "eng": "He was elegantly attired in a cashmere coat."}, {"viet": "Anh ta khăng khăng đòi chúng tôi phải uống một chầu.", "eng": "He was insistent that we should have a drink."}, {"viet": "Anh ta đi vắng khi tôi ghé thăm.", "eng": "He was out when I called round to see him."}, {"viet": "Ông ta béo đến nỗi không thể đi qua cái cửa.", "eng": "He was so fat that he couldn't go through the door."}, {"viet": "Công việc của anh ta chẳng thích gì trong nhiều năm nhưng anh ta luôn tránh nói chuyện đó với người chủ.", "eng": "He was unhappy in his job for years but always shy of telling his boss."}, {"viet": "Ông ta đến hiệu may để thử áo khoác.", "eng": "He went to the tailor's to be fitted for a coat."}, {"viet": "Anh ta làm việc hết sức hăm hở dự án nạo vét lòng sông.", "eng": "He worked with missionary zeal on the project to clean up the river."}, {"viet": "Những xe tải nặng đã làm hỏng bờ cỏ ven đường.", "eng": "Heavy lorries have damaged the grass verge."}, {"viet": "Bà ta sẽ sinh em bé vào tháng tới.", "eng": "Her baby's due next month."}, {"viet": "Tiếng la thét của bà ta làm cho hàng xóm chạy đến.", "eng": "Her cries brought the neighbours running."}, {"viet": "Nét mặt của cô ta nghiêm nghị khi kể cho chúng tôi nghe những tin xấu.", "eng": "Her face was serious as she told us the bad news."}, {"viet": "Tim cô ta đập thình thịch với sự kích động.", "eng": "Her heart beat pitapat with excitement."}, {"viet": "Cô ta bỗng khuỵu chân xuống và ngã lăn ra sàn.", "eng": "Her legs suddenly gave way and she fell to the floor."}, {"viet": "Chức danh chính thức của bà ấy là biên tập viên nghiên cứu.", "eng": "Her official designation is Research Editor."}, {"viet": "Những lời nhận xét của cô ta làm cho anh ấy uất ức vì xấu hổ.", "eng": "Her remarks made him writhe with shame."}, {"viet": "Thái độ ương bướng của cô ấy thực sự làm tôi tức giận.", "eng": "Her stubborn attitude really got my dander up."}, {"viet": "Đây là tấm hình của anh ấy chụp với các anh em trai, anh ấy là người đứng giữa.", "eng": "Here's a photo of him with his brothers, he's the one in the middle."}, {"viet": "Các chi phí thuê mướn được tính kể từ ngày giao hàng.", "eng": "Hire charges are reckoned from the date of delivery."}, {"viet": "Hành vi của anh ta có thể giải thích được khi xét đến bệnh tình của anh ta gần đây.", "eng": "His behavior is explicable in the light of his recent illness."}, {"viet": "Các người cộng sự bày tỏ lòng vô cùng ngưỡng mộ ngài chủ tịch mãn nhiệm.", "eng": "His colleagues paid generous tributes to the out-going president."}, {"viet": "Những cố gắng làm giảm nỗi sợ của nàng không mấy thành công.", "eng": "His efforts to allay her fears met with little success."}, {"viet": "Thân hình ông ta hơi giống quả lê.", "eng": "His figure is somewhat pear-shaped."}, {"viet": "Tuần trước bọn trộm đã xông vào nhà ông ấy.", "eng": "His house was broken into by burglars last week."}, {"viet": "Cuộc đời của ông ta đã hết kỳ hạn của nó.", "eng": "His life had reached its natural term."}, {"viet": "Việc bổ nhiệm ông ta làm rạn nứt sự đoàn kết của đảng.", "eng": "His nomination drove a wedge into party unity."}, {"viet": "Việc được thăng cấp của ông ta làm vui lòng nhiều người ngưỡng mộ ông.", "eng": "His preferment pleased his many admirers."}, {"viet": "Cú sút của anh ta trúng mặt dưới của xà ngang.", "eng": "His shot hit the under-side of the bar."}, {"viet": "Các thầy giáo của nó bảo nó phải tập trung sức lực vào, bằng không, chắc chắn nó sẽ thi hỏng.", "eng": "His teachers told him to pull his socks up, or he'd undoubtedly fail his exam."}, {"viet": "Công việc của ông ta thực sự đã là niềm an ủi cho ông.", "eng": "His work has been a real solace to him."}, {"viet": "Trung thực bao giờ cũng là người bạn tốt nhất của anh ta.", "eng": "Honesty has always been his best friend."}, {"viet": "Làm sao tôi thoát khỏi tình trạng bế tắc này được?", "eng": "How am I going to get out of this jam?"}, {"viet": "Anh ta lớn tiếng Sao mày dám nói với tao như thế?", "eng": "How dare you speak to me like that? he thundered?"}, {"viet": "Ở Mỹ, người ta tắm như thế nào?", "eng": "How do you take a bath in the States?"}, {"viet": "Còn bao lâu nữa tới bữa trưa?", "eng": "How long is it to lunch?"}, {"viet": "Bao nhiêu người đi vào Tokyo để làm việc mỗi ngày?", "eng": "How many people commute into Tokyo every day?"}, {"viet": "Phí hội viên hàng tháng là bao nhiêu?", "eng": "How much is the monthly membership fee?"}, {"viet": "Bà muốn nhận số tiền này như thế nào?", "eng": "How would you like the amount?"}, {"viet": "Có lẽ tôi phải làm cho xong chồng bát đĩa này.", "eng": "I'd better go and attack that pile of dishes."}, {"viet": "Tôi muốn cô dùng thịt bò nướng, cô Vương ạ.", "eng": "I'd like you to have some roast beef, Miss Wang."}, {"viet": "Tôi sẽ cho ông một toa để mua vài thứ thuốc.", "eng": "I'll give you a prescription for some medicine."}, {"viet": "Tôi sẽ gặp riêng rẽ từng người trong các anh.", "eng": "I'll see each of you separately."}, {"viet": "Tôi e chúng ta gần như không thể đến đó đúng giờ đâu.", "eng": "I'm afraid it's next door to impossible that we'll be there on time."}, {"viet": "Tôi sẽ đãi một bữa tiệc vào tối thứ bảy tới.", "eng": "I'm giving a party next Saturday night."}, {"viet": "Tôi quan tâm đến con người ở nơi làm việc.", "eng": "I'm interested in people where they work."}, {"viet": "Tôi chỉ bỏ tiền vào kế hoạch này nếu tôi có lợi.", "eng": "I'm only putting money into this scheme if I get a slice of the action."}, {"viet": "Tôi xin lỗi đã làm ngắt dòng suy tưởng của anh, nhưng mà...", "eng": "I'm sorry to interrupt your contemplations, but..."}, {"viet": "Tôi đang cố liên lạc với Paris.", "eng": "I'm trying to put a call through to Paris."}, {"viet": "Tôi được mời chính thức đi dự lễ cưới.", "eng": "I've been officially invited to the wedding."}, {"viet": "Tôi đã bỏ thói quen ăn một bữa điểm tâm nấu chín.", "eng": "I've got out of the habit of having a cooked breakfast."}, {"viet": "Tôi chưa từng thấy một hành vi kinh khủng đến như thế.", "eng": "I've never seen such appalling behaviour."}, {"viet": "Tôi thừa nhận rằng ông ấy già và yếu đuối nhưng dù có thế chăng nữa thì ông ta vẫn là một nhà chính trị giỏi.", "eng": "I accept that he's old and frail, be that as it may, he's still a good politician."}, {"viet": "Tôi khẩn khoản kêu gọi các ngài nhân danh các nạn nhân của vụ đói kém.", "eng": "I am appealing on behalf of the famine victims."}, {"viet": "Tôi hết sức lúng túng về việc giáo dục con trai tôi.", "eng": "I am very much exercised about the education of my son."}, {"viet": "Tôi tin hầu hết câu chuyện của anh ấy, nhưng tôi còn một vài điều dè dặt.", "eng": "I believe most of his stories but I have some reservations."}, {"viet": "Tôi không thể mang cái hộp này, nó cồng kềnh quá.", "eng": "I can't carry that box, it's too bulky."}, {"viet": "Tôi không thể nói ngay lập tức tôi kiếm được bao nhiều tiền.", "eng": "I can't say offhand how much money I earn."}, {"viet": "Tôi không bao giờ có thể đồng ý về một yêu cầu như vậy.", "eng": "I can never assent to such a request."}, {"viet": "Tôi không thể sống mà không có bóng đá.", "eng": "I can't live without football."}, {"viet": "Tôi có thể nghe thấy ông ta gõ búa liên tục ở nhà bên cạnh.", "eng": "I could hear him hammering away in the house next door."}, {"viet": "Tôi muốn một phòng hướng ra biển.", "eng": "I'd like a room facing the ocean."}, {"viet": "Thậm chí tôi không nhận ra những bông hoa đó là giả.", "eng": "I didn't even notice that the flowers were artificial."}, {"viet": "Tôi chẳng quan tâm là ủi chiếc mùi soa-chẳng bõ công.", "eng": "I don't bother to iron handkerchiefs-it's not worth it."}, {"viet": "Tôi không thích đi dự tiệc vì chồng tôi tán tỉnh mọi phụ nữ trong phòng.", "eng": "I don't like going to parties because my husband always flirts with every woman in the room."}, {"viet": "Tôi không nghĩ rằng ông thành thật với tôi.", "eng": "I don't think you're being straight with me."}, {"viet": "Tôi chẳng thấy anh ta hấp dẫn tí nào cả.", "eng": "I don't find him at all attractive."}, {"viet": "Tuần rồi tôi chẳng kiếm được xu nào.", "eng": "I earned damn all last week."}, {"viet": "Tôi cảm thấy ngày nay các bậc cha mẹ người Nhật không dạy con cái họ tính kỷ luật tự giác.", "eng": "I feel these days Japanese parents don't teach their children self-discipline."}, {"viet": "Tôi đã tha thứ cho nàng lâu rồi.", "eng": "I forgave her a long time ago."}, {"viet": "Tôi đã học được nhiều trên máy vi tính.", "eng": "I got a great deal on a computer."}, {"viet": "Tôi có linh tính là nó sẽ không đến.", "eng": "I had a sort of feeling he wouldn't come."}, {"viet": "Tôi chưa làm cơm xong khi mọi người tới.", "eng": "I hadn't finished making dinner when everyone arrived."}, {"viet": "Tôi đem theo ca-ta-lô của chúng tôi đến cho ông đây.", "eng": "I have brought you our catalogue."}, {"viet": "Tôi đã có lợi nhờ lời khuyên của anh.", "eng": "I have profited from your advice."}, {"viet": "Tôi không có thời gian xem bộ phim tối nay, nên tôi sẽ ghi lại nó.", "eng": "I haven't got time to watch the film tonight, but I'm going to video it."}, {"viet": "Tôi nghe điều đó trên đài rađiô.", "eng": "I heard it on the wireless."}, {"viet": "Tôi mong là chúng ta đã không xúc phạm anh ta, nghe qua điện thoại, anh ta có vẻ khó chịu.", "eng": "I hope we haven't offended him, he sounded rather hurt on the phone."}, {"viet": "Tôi chỉ đưa con tôi đến cầu tàu.", "eng": "I just took my kid to the pier."}, {"viet": "Tôi đã học những điểm cơ bản của sơ cứu ở một khoá học cuối tuần.", "eng": "I learned the basics of first aid on a weekend course."}, {"viet": "Tôi sống ở đường Nam Trung Sơn và số điện thoại của tôi là 5148342.", "eng": "I live at Zhong Shan South Road and my phone number is 5148342."}, {"viet": "Tao sẽ bốp cho mày một cái đấy!", "eng": "I'll give you such a whack!"}, {"viet": "Lần này tôi sẽ đãi bạn.", "eng": "I'll treat you this time."}, {"viet": "Tôi đang chờ một cú điện thoại.", "eng": "I'm expecting a phone call."}, {"viet": "Tôi không ăn món quá dở đó đâu!", "eng": "I'm not eating that poison!"}, {"viet": "Tôi ngạc nhiên tại sao ta lại có chỗ.", "eng": "I'm surprised we got seats."}, {"viet": "Tôi đang thắc mắc không biết anh có thích tôi hay không.", "eng": "I mind whether you like me or not."}, {"viet": "Tôi suýt nữa thì đã lao vào chiếc xe buýt khi nó dừng đột ngột ngay trước mặt tôi.", "eng": "I nearly ran into a bus when it stopped suddenly in front of me."}, {"viet": "Bây giờ tôi trân trọng mời ông chủ tịch nói với cuộc họp.", "eng": "I now call upon the chairman to address the meeting."}, {"viet": "Tôi nêu ra những nhược điểm của kế hoạch đó, nhưng anh ta chống chế rằng các chương trình vẫn chưa hoàn tất.", "eng": "I pointed out the shortcomings of the scheme, but he countered that the plans were not yet finished."}, {"viet": "Tôi thực sự thán phục cô ta-cô ấy thật tràn trề sinh lực!", "eng": "I really admire her-she's so full of zap!"}, {"viet": "Tôi nhớ là đã xem một cuốn phim thời sự về các tấm kính cửa sổ đã bị vỡ do những tiếng nổ vượt tường âm thanh của máy bay quân sự siêu nhanh, và một số người than phiền về các cơn đau trong tai họ.", "eng": "I remember seeing a newsreel where window panes had been broken by the sonic booms of military supersonic aircraft, and some people complained of pains in their ears."}, {"viet": "Tôi nói chính phủ không có quyền uỷ trị để đưa ra đạo luật mới này!", "eng": "I say the government does not have a mandate to introduce this new law!"}, {"viet": "Tôi nên gọi điện chúc mừng anh ấy.", "eng": "I should give him a call to congratulate him."}, {"viet": "Tôi vẫn còn xem xét việc đặt chỗ trước.", "eng": "I still have to look into making reservations."}, {"viet": "Tôi nghĩ sự thiếu tự tin là nguyên nhân bị che giấu của cung cách hung hăng của anh ta.", "eng": "I think a lack of confidence underlies his aggressive manner."}, {"viet": "Tôi nghĩ tranh sơn dầu được tạo bởi màu và các nét cọ, trong khi đó tranh truyền thống của Trung Quốc được tạo bởi đường và nét.", "eng": "I think oil paintings are created by colors and brush touches while traditional Chinese paintings are by lines and strokes."}, {"viet": "Tôi tưởng tôi đã nghe thấy tiếng thét.", "eng": "I thought I heard a scream."}, {"viet": "Tôi đã cố gắng tiếp xúc với ông ta nhưng không được.", "eng": "I tried to contact him but was unable to."}, {"viet": "Tôi có biên nhận của nó.", "eng": "I've got a receipt for it."}, {"viet": "Tôi muốn ăn thức ăn Nhật.", "eng": "I want to eat Japanese food."}, {"viet": "Tôi hoàn toàn bị cuốn hút vào câu chuyện của nàng.", "eng": "I was absolutely riveted by her story."}, {"viet": "Tôi thấy toại nguyện là họ đã đánh giá cao những gì tôi đã làm cho họ.", "eng": "I was gratified that they appreciated what I did for them."}, {"viet": "Tôi run rẩy vì trời lạnh mà.", "eng": "I was shaking because of the cold weather."}, {"viet": "Tôi không biết liệu bạn có họp mặt để ăn trưa không.", "eng": "I was wondering if you would like to get together for lunch."}, {"viet": "Tôi mong điều tốt cho anh ấy trong công việc mới của mình.", "eng": "I wish him well in his new job."}, {"viet": "Tôi tự hỏi liệu bà sẽ có thể học được không?", "eng": "I wonder if she'll be able to?"}, {"viet": "Tôi cần một chỗ ngồi ở khu vực không hút thuốc.", "eng": "I would like a seat in the non-smoking section."}, {"viet": "Tôi rất mong tuần sau bạn tới ăn bữa cơm chiều.", "eng": "I would very much like you to come to dinner next week."}, {"viet": "Nếu có ai mó máy vào cánh cửa này thì nó bật còi báo động.", "eng": "If anyone tampers with this door it trips the alarm."}, {"viet": "Nếu tôi vào nhà mà giày dính bùn đất thì cha tôi thế nào cũng mắng.", "eng": "If I walk in with muddy boots, Dad always scolds."}, {"viet": "Nếu giá là 500 pao chẳng hạn thì có quá đắt không?", "eng": "If the price is 500 pounds, let us say, is that too much?"}, {"viet": "Nếu anh lên thành phố tôi giới thiệu khách sạn mới-nó rất tốt.", "eng": "If you're going to the city, I recommend the new hotel-it's very nice."}, {"viet": "Nếu anh không nghe thấy báo lại tôi sẽ gặp anh lúc bảy giờ tối nay.", "eng": "If you don't hear anything to the contrary I'll meet you at seven o'clock tonight."}, {"viet": "Nếu đem pha màu đỏ với màu vàng ta sẽ có màu da cam.", "eng": "If you mix red and yellow, you get orange."}, {"viet": "Nếu được anh đến thăm, anh ta sẽ rất vui thích.", "eng": "If you went to see him, he would be delighted."}, {"viet": "Ở Mỹ, nhiều vở kịch mới được diễn lần đầu ở Broadway.", "eng": "In America, many new plays are presented first on Broadway."}, {"viet": "Nói chung, bạn có cảm thấy là các ông bố Nhật không dành đủ thời gian cho con cái của họ không?", "eng": "In general, do you feel that Japanese fathers don't spend enough time with their children?"}, {"viet": "Ở vào vị trí của quả nặng có một lò xo chính.", "eng": "In place of the weight there was a mainspring."}, {"viet": "Trong lúc hăng say anh ta gọi đồ uống đãi mọi người.", "eng": "In the first flush of success he ordered drinks for everyone."}, {"viet": "Vào thời đó, mỗi quốc gia Châu Âu đều muốn tìm ra một con đường buôn bán ngắn tới Viễn Đông.", "eng": "In those days every nation in Europe wanted to find a short trade route to the Far East."}, {"viet": "Đáng lẽ là Graham, nhưng lại là Peter đã dọn đến.", "eng": "Instead of Graham, it was Peter who moved in."}, {"viet": "Đó có phải là món gà hấp kiểu Vân Nam không ạ?", "eng": "Is it Yunnan style steamed chicken?"}, {"viet": "Có việc gì cho cháu giúp không?", "eng": "Is there anything I can do?"}, {"viet": "Sáng nay hơi lạnh một chút, có phải không?", "eng": "It's a bit fresh this morning, isn't it?"}, {"viet": "Mua giày tốt là một việc làm tiết kiệm, chúng đắt tiền hơn, nhưng dùng được lâu hơn nhiều so với giày rẻ tiền.", "eng": "It's an economy to buy good shoes they cost more, but they last much longer than cheap ones."}, {"viet": "Đổi tiền tại khách sạn đắt lắm.", "eng": "It's expensive to change money at the hotel."}, {"viet": "Tìm được chỗ đỗ xe hơi thật khó khăn.", "eng": "It's murder trying to find a parking place for the car."}, {"viet": "Đó chỉ là một bất đồng nhỏ-đừng bé xé ra to.", "eng": "It's only a small disagreement-let's not make an issue of it."}, {"viet": "Đã đến lúc quên đi những bất hoà giữa chúng ta và hãy lại là bạn của nhau.", "eng": "It's time to bury our differences and be friends again."}, {"viet": "Đã thấy rõ rằng bà ấy sắp chết.", "eng": "It became apparent that she was going to die."}, {"viet": "Đây là một hoà hợp của cacbon với một kim loại.", "eng": "It is a combination of carbon with a metal."}, {"viet": "Không nên dùng quá nhiều đường trong chế độ ăn của anh.", "eng": "It is inadvisable to have too much sugar in your diet."}, {"viet": "Một tổ chức cực đoan như thế rất khó có thể im lìm được lâu.", "eng": "It is unlikely that such an extremist organization will remain quiescent for long."}, {"viet": "Mưa suốt buổi sáng, nhưng sau đó đã đẹp trời.", "eng": "It poured all morning, but turned fine later."}, {"viet": "Nó đang diễn ở rạp hát ABC.", "eng": "It's playing at the ABC Theater."}, {"viet": "Về lý thuyết nghe có vẻ hay đấy, nhưng liệu nó có tác dụng không?", "eng": "It sounds fine in theory, but will it work?"}, {"viet": "Thật là một nỗ lực thực sự để thức xem hết được bộ phim.", "eng": "It was a real effort to stay awake through the film."}, {"viet": "Nghĩ rằng chúng ta có thể xây xong cái nhà trong một tháng là không thực tế.", "eng": "It was impractical to think that we could build the house in one month."}, {"viet": "Đã quá chậm không thể cứu được người đàn bà ốm và bà ta đã chết.", "eng": "It was too late to save the sick woman, and she died."}, {"viet": "Thật là một sự điên rồ hoàn toàn nếu muốn vượt qua Thái Bình Dương mà không có điện đài.", "eng": "It would be sheer lunacy to try to sail across the Pacific alone without a radio."}, {"viet": "Jim à, con có thể, có lí ở điểm đó.", "eng": "Jim, you may have a point there."}, {"viet": "Đây chỉ là một ý nghĩ nảy ra sau thôi-tại sao không hỏi Jim?", "eng": "Just as an afterthought-why not ask Jim?"}, {"viet": "Những công ty điện tử lớn đã phát triển vô tuyến truyền hình, nhưng Baird, bằng thử nghiệm của mình đã vạch ra con đường phát triển.", "eng": "Large electronics companies developed television, but Baird pointed the way with his experiments."}, {"viet": "Để tôi xem xem … bây giờ thì ổn rồi.", "eng": "Let me have a look …, it's all right now."}, {"viet": "Luân Đôn bị ném bom dữ dội trong cuộc chiến tranh thế giới thứ hai.", "eng": "London was heavily bombed during the second world war."}, {"viet": "Nhiều người lo lắng về khả năng xảy ra một tai nạn hạt nhân.", "eng": "Many people are worried by the possibility of a nuclear accident."}, {"viet": "Mary đỏ mặt tía tai vì lúng túng.", "eng": "Mary flushed crimson with embarrassment."}, {"viet": "Xin cho tôi xem thẻ lên máy bay của em?", "eng": "May I see your boarding pass?"}, {"viet": "Quan trọng hơn, chúng ta có thể cùng nhau đẩy mạnh những khát vọng chung của cả nhân loại về phẩm giá, sự tôn trọng, sự tự do, một cuộc sống tươm tất, và sự hưởng thụ những thành quả lao động của mình.", "eng": "More important, together we can promote the common aspirations of all mankind for dignity, self-respect, free-dom, a decent life, and enjoyment of the fruits of one's labor."}, {"viet": "Ông Giang hiện đang ở đâu.", "eng": "Mr. Jiang is on the line now."}, {"viet": "Chiếc ủng của tôi đè lên chỗ giộp ở ngón chân tôi.", "eng": "My boot is pressing against a blister on my toe."}, {"viet": "Cha tôi là người Đức, Anh và xứ Wales.", "eng": "My father was German, English, and Welsh."}, {"viet": "Mẹ tôi thích sự tiện lợi của việc sống gần các cửa hàng.", "eng": "My mother likes the convenience of living close to the shops."}, {"viet": "Răng của tôi nhạy cảm với thức ăn lạnh.", "eng": "My teeth are sensitive to cold food."}, {"viet": "Gọng mới đã làm anh ấy chịu đeo kính.", "eng": "New frames reconciled him to wearing glasses."}, {"viet": "Chưa, tôi chỉ xem quanh thôi.", "eng": "No, I'm just looking around."}, {"viet": "Không có sự thông cảm thực sự giữa vợ và chồng.", "eng": "No real understanding between husband and wife."}, {"viet": "Bây giờ khi đã được đề bạt, cô ta là người ngang hàng với thủ trưởng cũ của mình.", "eng": "Now that she has been promoted she is on equal terms with her ex-boss."}, {"viet": "Ồ, tôi xin lỗi tôi đã không mang nó theo.", "eng": "Oh, I'm sorry I haven't brought it with me."}, {"viet": "Old Faithful, suối nước nóng lớn nhất, thường phun nước sau mỗi 65 phút.", "eng": "Old Faithful, the biggest geyser, usually erupts about once every 65 minutes."}, {"viet": "Cảm tưởng đầu tiên về ông hiệu trưởng mới.", "eng": "One's first impressions of the new headmaster."}, {"viet": "Anh chỉ hít cái thứ này một hít là đủ giết chết anh.", "eng": "One sniff of this stuff is enough to kill you."}, {"viet": "Những lớp học của chúng tôi là con đường đi đến thành công về tiếng Anh.", "eng": "Our courses are the door to success in English."}, {"viet": "Thua lỗ của chúng ta sẽ phải được bù vào bằng các khoản vay thêm.", "eng": "Our losses will have to be made up with more loans."}, {"viet": "Đội chúng tôi đã chiếm ưu thế trong hiệp hai.", "eng": "Our team had the upper hand in the second half."}, {"viet": "Nghị viện là cơ quan chủ yếu của chính quyền.", "eng": "Parliament is the chief organ of government."}, {"viet": "Người ta nói ngôi nhà cổ ấy có ma.", "eng": "People say that the old house is haunted."}, {"viet": "Xin hãy cho tôi tờ đơn xin hoàn lại tiền có liên quan.", "eng": "Please let me have the relevant application form for refund."}, {"viet": "Hãy hứa với em là anh sẽ không quên!", "eng": "Promise me you won't forget!"}, {"viet": "Các nhà khoa học đang chờ đợi một thành tựu lớn.", "eng": "Scientists are hovering on the brink of a major breakthrough."}, {"viet": "Tôi cởi đồng hồ đeo tay của tôi ra nhé?", "eng": "Shall I take off my watch?"}, {"viet": "Cô ta thông minh hơn tôi cả vạn lần.", "eng": "She's a zillion times brainier than I am."}, {"viet": "Bà ta 85 tuổi và đã chịu tang ba đời chồng.", "eng": "She's eighty-five and has buried three husbands."}, {"viet": "Nàng đã quyết định và không gì lay chuyển nàng được.", "eng": "She's made up her mind and nothing can move her."}, {"viet": "Cô ấy ghét thậm tệ những người không làm theo ý của cô ấy.", "eng": "She's terribly down on people who don't do things her way."}, {"viet": "Cô ta luôn luôn giành lấy phần hơn mọi người.", "eng": "She always gets the best out of people."}, {"viet": "Cô ấy đến ngay sau khi cô ấy làm xong việc.", "eng": "She came as soon as she had finished work."}, {"viet": "Cô ta có thể thấy tim mình đập thình thịch khó thở khi cô chạy đua xong.", "eng": "She could feel her heart pounding painfully as she finished the race."}, {"viet": "Cô ấy làm việc nhiều gấp đôi cậu em trai mình.", "eng": "She did twice as much work as her brother."}, {"viet": "Cuối cùng cô ta đã kết hôn với một trong những người cố đeo đuổi bền bỉ nhất.", "eng": "She eventually married the most persistent of her admires."}, {"viet": "Cô phi ngựa không đóng yên xuống con đường dẫn về làng.", "eng": "She galloped bareback down the road towards the village."}, {"viet": "Con bé đã trưởng thành với một ông lão như tôi.", "eng": "She grew up with an old man like me."}, {"viet": "Cô ấy có một cái bánh lớn và cô ấy cho tôi một ít.", "eng": "She has a big piece of cake and she gave me some."}, {"viet": "Cô ấy để dành được một ít tiền, nhưng chẳng bao nhiêu.", "eng": "She has saved a little money, but nothing to speak of."}, {"viet": "Cô ta là một nghệ sĩ piano có tài phi thường.", "eng": "She is a prodigiously talented pianist."}, {"viet": "Cô ấy là kiểu phụ nữ tôi thích.", "eng": "She is the type of girl I like."}, {"viet": "Cô ấy liếm con tem và dán nó vào thư.", "eng": "She lick the stamps and stuck them on to the letter."}, {"viet": "Cô ấy chuẩn bị bữa tiệc một cách công phu nhưng rồi không ai đến.", "eng": "She made elaborate preparation for the party, and then no one came."}, {"viet": "Thỉnh thoảng cô ấy lại đến thăm tôi.", "eng": "She occasionally comes to see me."}, {"viet": "Cô ấy tự tay chuẩn bị bữa ăn tuyệt vời đó.", "eng": "She prepared that wonderful meal all by herself."}, {"viet": "Cô ta đáp lại những điểm tôi nêu một cách có sức thuyết phục đến mức chẳng mấy chốc lý lẽ của tôi đã bị đập tan tành.", "eng": "She replied to my points so convincingly that my argument was soon in tatters."}, {"viet": "Cô ta vào trong thị trấn chơi một lúc.", "eng": "She's gone on a jaunt into town."}, {"viet": "Cô ấy đã làm việc ở đó trong mười năm nay.", "eng": "She's worked there for ten years."}, {"viet": "She sells sea shells là một câu khó nói nhanh và đúng.", "eng": "She sells sea shells is a tongue-twister sentence."}, {"viet": "Bằng cách nào đó chị ấy đã thu xếp được một cuộc gặp mặt với Nữ hoàng.", "eng": "She somehow contrived a meeting with the Queen."}, {"viet": "Bà ta vô cùng đau đớn khi con trai mình bị giết.", "eng": "She suffered terribly when her son was killed."}, {"viet": "Khi được thăng chức, cô ta đảm đương nhiều trách nhiệm hơn.", "eng": "She took on greater responsibilities When she was promoted."}, {"viet": "Cô ta đợi anh ấy mời khiêu vũ vì không muốn tỏ ra quá bạo dạn.", "eng": "She waited for him to invite her to dance, not wishing to seem bold."}, {"viet": "Cô ta đã đến muộn một giờ phải không?: Đó gần như là chuyện cơm bữa đối với cô ta.", "eng": "She was an hour late, wasn't she?: That's about par for the course for her."}, {"viet": "Cô ấy rất phấn khởi về bộ phim cô ấy vừa mới xem.", "eng": "She was enthusing about a film she'd just seen."}, {"viet": "Cô ấy đang làm bánh ngọt và đôi tay dính đầy bột.", "eng": "She was making pastry and her hands floury."}, {"viet": "Sự duyên dáng của nàng tỏa ra một cách tự nhiên.", "eng": "She was simply oozing with charm."}, {"viet": "Cô ấy rất thông cảm khi tôi kể cho cô nghe vấn đề của mình.", "eng": "She was very understanding when iI told her my problem."}, {"viet": "Cô ta thì thầm với tôi để không người nào khác nghe thấy được.", "eng": "She whispered to me so no one else would hear."}, {"viet": "Nàng có lẽ sẽ xuất hiện ở cổng với một vẻ đẹp nghiêm trang.", "eng": "She would appear on the porch in magisterial beauty."}, {"viet": "Liệu bức tranh đó có nên treo ở vị trí đối diện không?", "eng": "Shouldn't that picture be the other way round?"}, {"viet": "Sau khi thất bại, ông ta đã rút lui khỏi hoạt động chính trị.", "eng": "Since his defeat he's dropped out of politics."}, {"viet": "Chém điên cuồng đối thủ của anh ta bằng thanh gươm.", "eng": "Slashing wildly at his opponent with a sword."}, {"viet": "Xén đi một góc miếng vải đó.", "eng": "Snicked off a corner of the material."}, {"viet": "Chính sách chủ nghĩa xã hội ủng hộ việc quốc doanh ngành công nghiệp than.", "eng": "Socialist policy favours public ownership of the coal industry."}, {"viet": "Một vài đấng ông chồng cứ nghĩ là thật chẳng xứng đáng chút nào khi phải lãnh việc đi mua sắm.", "eng": "Some husbands still think it beneath their dignity to do the shopping."}, {"viet": "Một số người nghĩ rằng con số 13 là con số không may.", "eng": "Some people think that 13 is an unlucky number."}, {"viet": "Có ai đó đang búng dây đàn ghi-ta trong phòng bên cạnh.", "eng": "Someone was twanging a guitar in the next room."}, {"viet": "Thanh niên xứ Spartan được huấn luyện thành những chiến sĩ.", "eng": "Spartan youths were bred as warriors."}, {"viet": "Đứng yên khi anh chụp ảnh cho em.", "eng": "Stand still while I take your photograph."}, {"viet": "Đứng lại trên lề đường và nhìn cả hai phía trước khi băng qua đường.", "eng": "Stop at the kerb and look both ways before crossing the road."}, {"viet": "Do bãi công, khách du lịch phải chịu những cuộc trì hoãn tuần này.", "eng": "Strikebound travellers face long delays this week."}, {"viet": "Những nhiệm vụ như thế chỉ một nhà địa chủ với tầm cỡ như ông ta mới mong có được.", "eng": "Such duties as were expected of a landowner of his magnitude."}, {"viet": "Ví thử trời mưa, anh sẽ làm gì?", "eng": "Supposing it rains What should you do?"}, {"viet": "Thích thú vô lý khi làm bố mẹ mình bối rối.", "eng": "Take a perverse pleasure in upsetting one's parents."}, {"viet": "Những luật thuế thiên vị các người có đặc quyền làm hại cho những người thất thế.", "eng": "Tax laws that favoured the privileged at the expense of the disadvantaged."}, {"viet": "Rất có thể anh ta sẽ đến muộn.", "eng": "Ten to one he'll be late."}, {"viet": "Đó là một tư thế ngủ không thoải mái.", "eng": "That's an uncomfortable position to sleep in."}, {"viet": "Đứa trẻ đó khôn trước tuổi nhiều quá!", "eng": "That child is far too precocious!"}, {"viet": "Đó là hướng tư duy hiện tại của chính phủ.", "eng": "That is the present direction of government thinking."}, {"viet": "Khả năng thực hiện đó không thể loại trừ được.", "eng": "That possibility can't be ruled out."}, {"viet": "Người đàn ông cao kia được gọi không thích hợp là ông Lùn!", "eng": "That tall man is misnamed Mr. Short!"}, {"viet": "Các yếu tố vô sinh của môi trường bao gồm ánh sáng, nhiệt độ và các chất khí trong không khí.", "eng": "The abiotic factors of the environment include light, temperature, and atmosphere gases."}, {"viet": "Giọng trầm bổng rõ ràng của diễn viên đó.", "eng": "The actor's clearly modulated tones."}, {"viet": "Quân Đồng minh đã ở trong tư thế sẵn sàng của họ để xâm chiếm Châu Âu.", "eng": "The Allies were poised for their invasion of Europe."}, {"viet": "Sự phi lý rõ ràng của một nhà khoa học có lòng tin đơn giản vào tôn giáo.", "eng": "The apparent incongruity of a scientist having a simple religious faith."}, {"viet": "Mũi tên trúng đích và con chim lăn xuống chết.", "eng": "The arrow reached its mark and the bird fell dead."}, {"viet": "Tính xác thực của bản viết tay là không có gì phải nghi ngờ nữa.", "eng": "The authenticity of the manuscript is beyond doubt."}, {"viet": "Những số liệu về buôn bán thua lỗ là điềm chẳng lành cho tương lai của công ty.", "eng": "The bad trading figures do not bode well for the company's future."}, {"viet": "Sự thỏa thuận với giới chủ mà họ đạt được là giảm bớt yêu cầu đòi tăng lương để đổi lại giờ làm việc trong tuần ít hơn.", "eng": "The bargain they reached with their employers was to reduce their wage claim in return for a shorter working week."}, {"viet": "Chuông ngân vang khắp vùng quê.", "eng": "The bells pealed over the countryside."}, {"viet": "Con sáo đen nằm ấp ở tổ đợi con đực về.", "eng": "The blackbird sat on the nest waiting for the return of her mate."}, {"viet": "Cuốn sách nhằm xác định vai trò của ông ấy trên chính trường thế giới.", "eng": "The book attempts a definition of his role in world politics."}, {"viet": "Dây cung bật ra và mũi tên bay rít lên trong không trung.", "eng": "The bow twanged and the arrow whistled through the air."}, {"viet": "Sự tan vỡ của cuộc hôn nhân của họ không thể cứu vãn được.", "eng": "The breakdown of their marriage was irretrievable."}, {"viet": "Ý chính trong lý lẽ của anh ta là.", "eng": "The burden of his argument was that."}, {"viet": "Sự huỷ bỏ một đơn đặt hàng ( một hiệp ước, một hợp đồng ).", "eng": "The cancellation of order ( an agreement, a contract )."}, {"viet": "Chiếc xe ôtô chạy chầm chậm quanh góc phố.", "eng": "The car nosed carefully round the corner."}, {"viet": "Người thủ quỹ đã chuồn đi cùng với tiền.", "eng": "The cashier had absconded with the money."}, {"viet": "Vị chủ tọa đã đúc kết lại nội dung của cuộc thảo luận.", "eng": "The chairman gathered up the threads of the debate."}, {"viet": "Cha mẹ của đứa trẻ cuống cuồng cả lên khi nó không về nhà đúng giờ.", "eng": "The child's parents were frantic when she did not return home on time."}, {"viet": "Trẻ con rất ích kỷ đối với đồ chơi của nó.", "eng": "The child was very possessive with his toys."}, {"viet": "Các cậu bé đã hoàn toàn tán thành chọn việc đi nghỉ ở gần biển.", "eng": "The children plumped for a holiday by the sea."}, {"viet": "Dàn đồng ca biểu diễn rất hay, nhưng không có ai hay như chàng trai xứ Wales.", "eng": "The choir sang sweetly, and none more so than the Welsh boy."}, {"viet": "Nhân viên khách sạn đã dùng quá nhiều chất tẩy uế.", "eng": "The clerk uses too much disinfectant."}, {"viet": "Tiệm cà phê đó phục vụ nhiều loại đồ uống giải khát như: coca-cola, xô đa, nước khoáng và nước quả, cũng phục vụ cả trà và cà phê.", "eng": "The coffee shop serves many kinds of soft drinks, for instance: cola, soda water, mineral water and juice, tea and coffee is served, too."}, {"viet": "Ủy ban đã quyết định sa thải ông ta.", "eng": "The committee have decided to dismiss him."}, {"viet": "Công ty đã phát một thông cáo báo chí để cố gắng chặn đứng sự đầu cơ các cổ phần.", "eng": "The company issued a press release to try to stop speculation in its shares."}, {"viet": "Sự hi sinh trọn đời cho một mục đích duy nhất.", "eng": "The consecration of a whole life to a single purpose."}, {"viet": "Giá sinh hoạt hình như sắp sửa lại hạ xuống liên tục đến tháng thứ ba.", "eng": "The cost of living seems set to drop for the third month in succession."}, {"viet": "Cuốn sách của khóa học có hai mươi đơn vị bài.", "eng": "The course book has twenty units."}, {"viet": "Các nhà phê bình thật sự phê phán gắt gao cuốn phim mới nhất của ông ta.", "eng": "The critics really went to town on his latest film."}, {"viet": "Nước cuốn các khúc gỗ trôi xuôi dòng sông.", "eng": "The current swept the logs down the river."}, {"viet": "Những ngày trước thảm họa cuối cùng.", "eng": "The days that preceded the final catastrophe."}, {"viet": "Người phụ nữ biểu tình đã tự khoá tay mình vào hàng rào chấn song.", "eng": "The demonstrator had handcuffed herself to the railings."}, {"viet": "Khuynh hướng giáo dục trong văn hoá Việt Nam.", "eng": "The didactic tendency in Vietnamese literature."}, {"viet": "Sự đổi hướng của một dòng nước, các suy nghĩ của ai.", "eng": "The diversion of a stream, one's thoughts."}, {"viet": "Các bác sĩ đã hết hy vọng nhưng bà ta đã hồi phục một cách rõ rệt.", "eng": "The doctors had given her up but she made a remarkable recovery."}, {"viet": "Lông chó màu trắng đốm đen.", "eng": "The dogs coat is white with black patches."}, {"viet": "Ma tuý đã làm ảnh hưởng đến năng lực tập trung tư tưởng của ai.", "eng": "The drug affects one's power of concentration."}, {"viet": "Âm thanh kỳ quái của tiếng cú kêu.", "eng": "The eery sound of an owl hooting."}, {"viet": "Động cơ ấy nổ bành bạch rồi mới khởi động.", "eng": "The engine coughed and spluttered into life."}, {"viet": "Màu đỏ thẫm tràn ngập bầu trời chiều.", "eng": "The evening sky was suffused with crimson."}, {"viet": "Tiếng nổ đó đã phá thủng một lỗ ở bức tường.", "eng": "The explosion tore a hole in the wall."}, {"viet": "Các người hâm mộ ùa vào sân tạo thành một đám hăng say hỗn loạn.", "eng": "The fans rushed onto the pitch in an excited mod."}, {"viet": "Quả vả bán ở quầy kế bên.", "eng": "The figs are venal at the nearest stall."}, {"viet": "Kẻng báo động hỏa hoạn kêu inh ỏi liên tục.", "eng": "The fire-alarm kept jangling away."}, {"viet": "Cuốn sách đầu tiên gồm những trang sách đóng lại và có bìa bọc được làm bằng da thuộc.", "eng": "The first books made of pages bound together in a cover were made of parchment."}, {"viet": "Chuyến bay đó đã bị hoãn lại do sương mù.", "eng": "The flight was delayed as a result of fog."}, {"viet": "Mẫu in sẵn nêu ra Bạn độc thân, đã kết hôn, ly dị, ly thân? Hãy gạch bỏ từ nào không liên quan.", "eng": "The form read Are you single, married, divorced, separated? Strike out whichever does not apply."}, {"viet": "Sự mọc dồi dào của cây cối nhiệt đới.", "eng": "The furious growth of tropical vegetation."}, {"viet": "Viên tướng đã giảng cho binh sĩ về chiến thuật quân sự.", "eng": "The general gave the soldiers a lecture on military tactics."}, {"viet": "Việc đi lại trên con đường gồ ghề này thật là khó khăn.", "eng": "The going is hard over this rough road."}, {"viet": "Chính phủ giao cho cảnh sát nhiệm vụ làm giảm tội ác.", "eng": "The government gave the police a mandate to reduce crime."}, {"viet": "Chính phủ đã làm hỏng kế hoạch vì ngùng trợ cấp cho việc nghiên cứu của họ.", "eng": "The government put the skids under the plan by stopping their research grant."}, {"viet": "Những nhà văn viết văn xuôi vĩ đại của thế kỷ thứ 19.", "eng": "The great prose writers of the 19 th century."}, {"viet": "Người khách trọ muốn tổ chức một buổi tiệc lớn.", "eng": "The guest wants to arrange for a large party."}, {"viet": "Bà hiệu trưởng phát biểu khá dài.", "eng": "The headmistress spoke at some length."}, {"viet": "Địa điểm lịch sử nơi những người hành hương đầu tiên đặt chân lên đất Mỹ.", "eng": "The historic spot on which the first pilgrims landed in America."}, {"viet": "Thức ăn ở khách sạn cực kỳ tồi.", "eng": "The hotel food was absolutely wretched."}, {"viet": "Căn nhà đó trống và có các cửa chớp đóng.", "eng": "The house was empty and shuttered."}, {"viet": "Những chiều sâu thăm thẳm vô cùng của vũ trụ.", "eng": "The immeasurable depths of the universe."}, {"viet": "Người bị thương mất nhiều máu và phải được truyền máu.", "eng": "The injured man had lost a lot of blood and had to be given a transfusion."}, {"viet": "Sự mời mọc đó có nghĩa như là một cử chỉ thân mật.", "eng": "The invitation was meant as a friendly gesture."}, {"viet": "Quan toà đã chú ý tới những sự kiện mới trong trường hợp của anh.", "eng": "The Judge has taken cognizance of the new facts in your case."}, {"viet": "Nhà vua làm lễ đăng quang với tất cả các nghi lễ trang trọng.", "eng": "The King was crowned with all solemnities."}, {"viet": "Điều mà tôi không ngờ hắn ta làm.", "eng": "The last thing I'd expect him to do."}, {"viet": "Người diễn thuyết nói ngập ngừng sau khi đánh rơi bản ghi chép.", "eng": "The lecturer faltered after dropping his notes."}, {"viet": "Ánh chớp được tiếp theo ngay sau đó bằng tiếng sấm lớn.", "eng": "The lightning was quickly followed with heavy thunder."}, {"viet": "Người lái xe tải sang số để lên đồi.", "eng": "The lorry driver changed gear to go up the hill."}, {"viet": "Quy mô rộng lớn của nạn dịch thật đáng sợ.", "eng": "The magnitude of the epidemic was frightening."}, {"viet": "Hãng sản xuất bảo hành đồng hồ trong 3 năm.", "eng": "The manufactures guarantee the watch for three years."}, {"viet": "Thịt này cần phải hầm trong vài giờ.", "eng": "The meat needs to stew for several hours."}, {"viet": "Người mang tin đến lúc 5 giờ.", "eng": "The messenger comes at five o'clock."}, {"viet": "Anh thử nghĩ xem, lá thư lại nằm trong túi hắn ta.", "eng": "The missing letter was in his pocket, if you please."}, {"viet": "Muỗi là vật truyền bệnh.", "eng": "The mosquito is a transmitter of disease."}, {"viet": "Kẻ sát nhân không khi nào lấy lại được sự thanh thản trong tâm hồn.", "eng": "The murderer never recovered his peace of mind."}, {"viet": "Cháu trai của nữ hoàng kế vị bà ta.", "eng": "The nephew of the queen came in her stead."}, {"viet": "Ông tổng giám đốc mới sẽ giữ vai trò tiên phong của chiến dịch này.", "eng": "The new managing director will act as spearhead of the campaign."}, {"viet": "Tin đó đã làm cho chúng tôi khá sửng sốt.", "eng": "The news gave us rather a shock."}, {"viet": "Tiếng ồn ào của lũ trẻ làm tôi tức giận.", "eng": "The noise of the children was irritating me."}, {"viet": "Cô y tá thức suốt đêm với người bệnh.", "eng": "The nurse sat up with the patient all night."}, {"viet": "Chiếc cầu cũ chỉ có thể cho xe cộ loại nhẹ qua lại.", "eng": "The old bridge can only be used by light vehicles."}, {"viet": "Những cái ở phía trước là những máy giặt nhỏ hơn.", "eng": "The ones in front are the smaller washers."}, {"viet": "Kết quả của những cuộc thương lượng về tiền lương này được coi như một trường hợp điển hình để giải quyết cho các cuộc thảo luận về lương bổng trong tương lai.", "eng": "The outcome of these wage talks is seen as a test case for future pay negotiations."}, {"viet": "Bố mẹ thuê luật sư cho trường hợp con trai họ bị tấn công.", "eng": "The parents retained a lawyer for their son's assault case."}, {"viet": "Người bệnh đã trở thành một gánh nặng cho gia đình.", "eng": "The patient has become a load to the family."}, {"viet": "Sự phối hợp hết sức nhịp nhàng của tay và mắt.", "eng": "The perfect coordination of hand and eye."}, {"viet": "Bức ảnh cho thấy một phía của ngôi nhà.", "eng": "The picture shows a side view of the house."}, {"viet": "Máy bay bắt đầu hạ cánh xuống Pari.", "eng": "The plane began its descent into Paris."}, {"viet": "Vở kịch đó chấm dứt lúc 11 giờ tối.", "eng": "The play let out at 11 P. M."}, {"viet": "Cảnh sát có trách nhiệm thực thi pháp luật.", "eng": "The police are responsible for law enforcement."}, {"viet": "Cảnh sát phải có trát để khám nhà.", "eng": "The police must have a search warrant to search a house."}, {"viet": "Cuộc vận động chính trị đó cuối cùng đã bắt đầu tiến hành theo dự kiến.", "eng": "The political campaign finally began to roll."}, {"viet": "10 phút nữa khoai tây sẽ chín.", "eng": "The potatoes will be done in 10 minutes."}, {"viet": "Tổng thống đã theo tập tục lịch sử khi thành lập Nội các.", "eng": "The President followed historical precedent in forming the Cabinet."}, {"viet": "Vị linh mục xức dầu thánh lên trán đứa bé.", "eng": "The priest anointed the baby's forehead."}, {"viet": "Tên tù bị đội xử bắn hành quyết vào lúc bình minh.", "eng": "The prisoner was put to death by firing squad at dawn."}, {"viet": "Dự án đó vẫn còn ở giai đoạn đầu.", "eng": "The project is still at the embryo stage."}, {"viet": "Nhà xuất bản đã in 10000 bản của cuốn sách này.", "eng": "The publisher has printed 10000 copies of the book."}, {"viet": "Vấn đề quan trọng nhất là một trong những quyền ưu tiên xã hội.", "eng": "The question boil down to one of social priorities."}, {"viet": "Sự tác hại của nạn tàn phá rừng trên các ngọn đồi.", "eng": "The ravages of the deforestation on the hills."}, {"viet": "Các qui định cần phải được tuân thủ nghiêm ngặt.", "eng": "The regulations must be stringently observed."}, {"viet": "Toa ăn ở phía trước của xe lửa.", "eng": "The restaurant car is at the front of the train."}, {"viet": "Chiếc nhẫn rất quan trọng đối với nàng vì đó là biểu tượng cho tình yêu của họ.", "eng": "The ring was important to her as an emblem of their love."}, {"viet": "Tiếng ầm ầm của xe cộ đi lại trong thành phố là một sự tấn công thường xuyên vào thần kinh mọi người.", "eng": "The roar of city traffic is a steady assault on one's nerves."}, {"viet": "Hiệp hội bảo vệ điểu cầm Hoàng gia.", "eng": "The Royal Society for the protection of Birds."}, {"viet": "Nhân viên bán hàng đã nói tràng giang đại hải một hồi với chúng tôi về việc tại sao chúng tôi nên mua sản phẩm của anh ta.", "eng": "The salesman gave us a long spiel about why we should buy his product."}, {"viet": "Chuyến đi dã ngoại do trường tổ chức sẽ bị hoãn lại vì trời mưa.", "eng": "The school trip will be postponed because of the rain."}, {"viet": "Vị thượng nghị sĩ không tuyên bố về số phiếu sắp tới.", "eng": "The Senator would not commit herself on the upcoming vote."}, {"viet": "Các kệ nặng trĩu xuống vì một dãy món quà tặng hào nhoáng của những người hâm mộ.", "eng": "The shelves groan with an array of gimcrack gifts from fans."}, {"viet": "Các đại biểu công nhân xúi giục thợ mỏ đình công.", "eng": "The shop-stewards brought out the miners."}, {"viet": "Những hình sẫm của cây cối in trên nền trời buổi tối.", "eng": "The silhouettes of the trees against the evening sky."}, {"viet": "Mùi nấu nướng tỏa khắp căn nhà.", "eng": "The smell of cooking permeates through the flat."}, {"viet": "Binh lính lên xe lửa ngay sau khi họ ra khỏi tàu thuỷ.", "eng": "The soldiers were entrained as soon as they had come off the ship."}, {"viet": "Diễn giả nói với một giọng cảnh báo.", "eng": "The speaker sounded a note of warning."}, {"viet": "Những cuộc tuyển cử trong nước đã đe doạ làm đảo lộn hệ thống quyền lực hiện hữu.", "eng": "The state elections threatened to upset existing power structure."}, {"viet": "Câu chuyện kể rằng bà ta đã đầu độc chồng.", "eng": "The story runs that she poisoned her husband."}, {"viet": "Các tàu ngầm đang đi lùng sục dọc theo bờ biển.", "eng": "The submarines were prowling along the coast."}, {"viet": "Cái áo len đã co lại sau nhiều lần giặt.", "eng": "The sweater had shrunk after repeated washing."}, {"viet": "Thầy giáo đoán trước tất cả chúng tôi sẽ qua được kỳ thi mà quả là như thế.", "eng": "The teacher predicted that we would all pass the examination and we did."}, {"viet": "Ngôi đền được những cột trụ khổng lồ chống đỡ.", "eng": "The temple is supported by massive columns."}, {"viet": "Vấn đề là chúng ta có khả năng đi nghỉ mát không?", "eng": "The things is, can we afford a holiday?"}, {"viet": "Giá chi phí tổng cộng của kì nghỉ, nghĩa là bao gồm khách sạn, thức ăn, đi lại là 500 bảng.", "eng": "The total cost of the holiday, i. e. including hotel, food, and travel, is £ 500."}, {"viet": "Hiệu quả làm dịu của tiếng nhạc dịu dàng.", "eng": "The tranquillizing effect of gentle music."}, {"viet": "Tờ hai mươi đô la tôi để trong giày là để phòng lúc khó khăn.", "eng": "The twenty-dollar bill I keep in my shoe is my ace in the hole."}, {"viet": "Hai cửa sổ cân xứng tuyệt vời.", "eng": "The two windows are in admirable proportion."}, {"viet": "Việc sử dụng vũ lực, khủng bố, tống tiền, v. v.", "eng": "The use of force, terrorism, blackmail, etc."}, {"viet": "Dân làng gặp gỡ nhau ở quán rượu mỗi buổi chiều sau một ngày làm việc vất vả.", "eng": "The villagers met in the tavern every evening, after a hard day's work."}, {"viet": "Áp lực nước ở vòi sen thật tệ.", "eng": "The water pressure in the shower is terrible."}, {"viet": "Toàn bộ phong cảnh trông rất tẻ nhạt.", "eng": "The whole landscape looked as flat as a pancake."}, {"viet": "Sự rút quân khỏi vùng chiến sự.", "eng": "The withdrawal of troops from the war zone."}, {"viet": "Lúc này trên thế giới tràn ngập gạo.", "eng": "The world is awash with rice at the moment."}, {"viet": "Ngày sinh của chúng nó rất gần nhau.", "eng": "Their birthdays are very close together."}, {"viet": "Việc chuyển hướng của họ không ngăn cản được những người khác bỏ vốn đầu tư vào.", "eng": "Their move does not preclude others from investing."}, {"viet": "Bấy giờ tôi nhận nhiệm vụ làm sĩ quan an ninh ở Hồng Kông.", "eng": "Then I had a stint as security officer in Hong Kong."}, {"viet": "Có mái che rộng ở phía trên, bạn thấy không?", "eng": "There's a large roof on the top, you see?"}, {"viet": "Không hay ho gì mà đem tặng những thứ anh thực sự không muốn.", "eng": "There's no merit in giving away what you don't really want."}, {"viet": "Bộ phanh này xộc xệch quá, cần phải siết lại.", "eng": "There's too much travel on the brake, it needs tightening."}, {"viet": "Không có em học sinh nào ở trong lớp cả.", "eng": "There are no children in the classroom."}, {"viet": "Giữa con người với nhau còn nhiều nét tương đồng tiềm ẩn.", "eng": "There are underlying similarities between all human beings."}, {"viet": "Có một sự khác nhau rõ ràng giữa hai chị em.", "eng": "There is a decided difference between the two sisters."}, {"viet": "Có sữa và kem-anh có thích thứ nào không?", "eng": "There is milk and cream-do you have a preference?"}, {"viet": "Còn lâu mới đủ thời gian để học thuộc tất cả những từ đó.", "eng": "There isn't nearly enough time to learn all these words."}, {"viet": "Mọi người đã hoàn toàn đồng tình bỏ phiếu tán thành đề nghị đó.", "eng": "There was a solid vote in favour of the proposal."}, {"viet": "Đã có bốn người trong thang máy, nhưng anh ta cố chen vào.", "eng": "There were already four people in the lift, but he managed to squeeze in."}, {"viet": "Có hàng triệu tế bào trong cơ thể của hầu hết các loài thực vật và động vật.", "eng": "These are millions of cells in the bodies of most plants and animals."}, {"viet": "Những đạo luật này càng làm rõ thêm sự bất công và bóc lột.", "eng": "These laws accentuate inequality and exploitation."}, {"viet": "Hai bức ảnh này gần giống nhau.", "eng": "These two photographs are almost alike."}, {"viet": "Ở hải quan họ có chó đánh hơi ma tuý.", "eng": "They've got dogs at the customs for sniffing out drugs."}, {"viet": "Chúng giống như các đám hơi nhỏ nằm bên trong cái còi của một động cơ hơi nước hoặc giống như hơi thở của con người vào một ngày mùa đông.", "eng": "They are like the little clouds over the whistle of a steam engine, or like those from a person's breath on a winter day."}, {"viet": "Họ xây dựng các nhà thờ lớn để tôn thờ.", "eng": "They built huge cathedrals in which to worship."}, {"viet": "Họ quyết định trong 3 năm thì mỗi năm có 365 ngày.", "eng": "They decided to have 365 days in a year for three years."}, {"viet": "Họ lần đường xuống hành lang tối.", "eng": "They felt their way down the dark passage."}, {"viet": "Họ bị đuổi khỏi quê hương một cách không chính đáng.", "eng": "They have been dispossessed of their country."}, {"viet": "Họ san bằng mảnh đất để chúng tôi có thể chơi bóng đá trên đó.", "eng": "They leveled the piece of ground so that we could play football on it."}, {"viet": "Họ đề nghị trả tiền lương cao hơn để khuyến khích họ ở lại.", "eng": "They offered a higher salary as an inducement to stay."}, {"viet": "Với số vốn đầu tư bỏ ra, họ thu lại không được là bao.", "eng": "They received a poor return on their investment."}, {"viet": "Họ đã nhẹ nhàng phê chuẩn đạo luật thông qua quốc hội.", "eng": "They snapped the bill through congress."}, {"viet": "Họ cùng đi tay nắm tay, các ngón tay cài vào nhau.", "eng": "They walked along holding hands, their fingers interlocked."}, {"viet": "Họ lại đang có những cuộc tranh cãi bất tận về chính trị.", "eng": "They were having one of their endless arguments about politics."}, {"viet": "Họ tập vất vả để điệu nhảy của họ thật hoàn hảo.", "eng": "They worked hard to perfect their dance."}, {"viet": "Quyển sách này nói về sự thay đổi và cách chúng ta thích ứng với nó.", "eng": "This book is about change and how we adapt to it."}, {"viet": "Chữ thập này đánh dấu nơi bà ta chết.", "eng": "This cross marks the spot where she died."}, {"viet": "Vị đại giáo chủ này sinh ở ấn Độ.", "eng": "This great leader was born in India."}, {"viet": "Giờ không phải lúc đưa vấn đề đó ra.", "eng": "This is not the time to bring up that subject."}, {"viet": "Cái đòn bẩy này ắt phải dùng cho một mục đích nào đó.", "eng": "This lever must serve some ulterior purpose."}, {"viet": "Bức tranh này là chép lại, nguyên bản ở Madrid.", "eng": "This painting is a copy, the original is in Madrid."}, {"viet": "Căn phòng này vừa ý ( tôi ) quá, cám ơn anh.", "eng": "This room will do ( me ) nicely, thank you."}, {"viet": "Với vé này, anh không có quyền đi hạng nhất.", "eng": "This ticket doesn't entitle you to travel first class."}, {"viet": "Những bộ quần yếm kinh khủng này ai mặc vào trông cũng lôi thôi lếch thếch.", "eng": "Those terrible overalls would make anyone look slovenly."}, {"viet": "Ngày nay, một ai đó có thể nói rằng thanh gươm của Damocles đang treo trên đầu mình.", "eng": "Today someone may say that the sword of Damocles is hanging over his head."}, {"viet": "Ở các xưởng đóng tàu có hai trăm công nhân được thông báo là dư thừa.", "eng": "Two hundred redundancies were announced in the shipyards."}, {"viet": "Các khoản tăng lương đã làm nhẹ bớt tác động của giá cả tăng đối với chúng tôi.", "eng": "Wage increases have cushioned us from the effects of higher prices."}, {"viet": "Chúng tôi muốn được độc quyền phân phối hàng thể thao của công ty ông ở khu vực của chúng tôi.", "eng": "We'd like to have the right of sole distribution of your sports goods in our area."}, {"viet": "Chúng tôi đã đăng ký cho bạn ở khách sạn Plaza hai đêm.", "eng": "We're booked you in at the Plaza for two nights."}, {"viet": "Chúng tôi vẫn còn liên hệ với nhau sau bao năm tháng.", "eng": "We're still in touch after all these years."}, {"viet": "Chúng tôi không có cà phê, ông dùng trà thay thế nhé?", "eng": "We've no coffee, would you like tea instead?"}, {"viet": "Chúng ta tất cả đều là anh em trong cuộc đấu tranh chống bất công.", "eng": "We are all brothers in the same fight against injustice."}, {"viet": "Chúng ta làm việc với giả định cho rằng tỷ lệ lạm phát sẽ không tăng trong năm tới.", "eng": "We are working on the assumption that the rate of inflation will not increase next year."}, {"viet": "Chúng tôi có thể dựng thang máy lên đến 40 tầng.", "eng": "We can build the elevator up to 40 stories."}, {"viet": "Chúng ta có thể nghe tiếng nức nở của đứa bé ở phòng bên cạnh.", "eng": "We could hear the child sobbing in the other room."}, {"viet": "Chúng tôi không muốn nghe các ý kiến của anh, hãy bám vào các sự kiện.", "eng": "We don't want to hear your opinion, sticks to the facts."}, {"viet": "Chúng tôi chuyện phiếm với nhau và phát hiện ra là chúng tôi đã cùng học ở trường cao đẳng.", "eng": "We got chatting and discovered we'd been at college together."}, {"viet": "Hôm qua ta đã có 12 giờ nắng, trái với dự báo là trời mưa liên tục.", "eng": "We had twelve hours of sunshine eyes yesterday, as against a forecast of continuous rain."}, {"viet": "Chúng tôi có salad khoai tây, salad cà chua và salad trái cây.", "eng": "We have potato salad, tomato salad, and fruit salad."}, {"viet": "Chúng tôi xem ba anh hề, thật chán phát ngấy!", "eng": "We just watched the three stooges, what corn ball!"}, {"viet": "Chúng tôi đã tìm cách thoát khỏi những kẻ đuổi theo trong đêm tối.", "eng": "We managed to lose our pursuers in the darkness."}, {"viet": "Chúng ta cần phải đặt thành vấn đề giá trị của mối liên hệ giữa chúng ta với trường đại học.", "eng": "We must question the value of our link with the university."}, {"viet": "Xe chúng tôi đã chạy quá chỗ rẽ trên đường cao tốc đi Manchester.", "eng": "We overshot the exit for Manchester on the motorway."}, {"viet": "Chúng tôi nhìn thấy ánh đèn của thị trấn đó loé lên ở xa xa.", "eng": "We saw the lights of the little town gleaming in the distance."}, {"viet": "Chúng tôi ở lại nhà bạn tôi hay nói cho đúng hơn ở nhà của bố mẹ bạn tôi.", "eng": "We stayed at my friend's house, or rather at my friend's parents'house."}, {"viet": "Chúng tôi muốn mua một chiếc xe đã xài rồi nhưng còn tốt.", "eng": "We want a good used car."}, {"viet": "Chúng tôi được mời ở lại ăn cơm, nhưng chúng tôi phải xin cáo lỗi.", "eng": "We were invited to stay for dinner, but we had to beg off."}, {"viet": "Chúng tôi làm bài dưới sự giám sát của thầy giáo.", "eng": "We work under the teacher's supervision."}, {"viet": "À, lúc nào bố cũng có thể rút một ít tiền từ tiền tiết kiệm của bố.", "eng": "Well, I can always take some money from my savings."}, {"viet": "À, T/T và D/D có nghĩa là gì vậy?", "eng": "Well, what do T/T, M/T, and D/D mean?"}, {"viet": "Địa vị chính thức của anh trong công ty là gì?", "eng": "What's your official status in the company?"}, {"viet": "Anh nghĩ sẽ làm gì để nghỉ phép năm nay?", "eng": "What are you thinking of doing by way of a holiday this year?"}, {"viet": "Bạn nghĩ gì về việc dạy tiếng Anh ở Nhật bản?", "eng": "What do you think of English education in Japan?"}, {"viet": "Tối nay tivi sẽ phát chương trình gì?", "eng": "What is showing on TV tonight?"}, {"viet": "Đất nước của bạn thế nào?", "eng": "What is your home country like?"}, {"viet": "Những đức tính gì góp phần tạo nên một nhà doanh nghiệp thành đạt?", "eng": "What qualities go to make a successful businessman?"}, {"viet": "Phản ứng của anh ta như thế nào khi anh nói với anh ta?", "eng": "What was his reaction when you told him?"}, {"viet": "Khi nào ông gửi cho chúng tôi các chứng từ gửi hàng?", "eng": "When do you send us shipping documents?"}, {"viet": "Khi tôi vòng qua góc phố, hắn đã biến mất.", "eng": "When I turned the corner of the street he had disappeared."}, {"viet": "Khi nhịp độ công việc quá căng, anh ta chuồn.", "eng": "When the pace got too hot for him, he disappeared."}, {"viet": "Khi bạn trẻ, bạn muốn những điều thuận tiện của thành phố.", "eng": "When you are young you want the amenities of the town."}, {"viet": "Họ định chọn địa điểm nhà máy mới ở đâu?", "eng": "Where have they decided to site the new factory?"}, {"viet": "Cách viết nào đúng hơn: Tokio hay Tokyo?", "eng": "Which is the better spelling: Tokio or Tokyo?"}, {"viet": "Ai là kẻ lên mặt đạo đức giúp đỡ thầy giáo vậy?", "eng": "Who's a little goody-goody then, helping the teacher?"}, {"viet": "Ai sẽ trông nom ông ta nếu vợ ông ta chết?", "eng": "Who will care for him if his wife dies?"}, {"viet": "Tại sao bạn không gián tiếp tìm hiểu?", "eng": "Why don't you find out indirectly?"}, {"viet": "Bạn sẽ có thể đi xem phim thế?", "eng": "Will you be able to go to the movies?"}, {"viet": "Các loại lốp xe dùng cho mùa đông được tăng cường độ bám trên bùn hay tuyết.", "eng": "Winter tires give increased traction in mud or Snow."}, {"viet": "Phụ nữ đã được các nghệ sĩ miêu tả bằng nhiều cách.", "eng": "Woman has been portrayed by artists in many ways."}, {"viet": "Xin ông tính cho chúng tôi một mức giá ưu đãi hơn nữa được không?", "eng": "Would you consider making us a more favorable offer?"}, {"viet": "Anh có muốn san sẻ với tôi một chai không?", "eng": "Would you like to split a bottle with me?"}, {"viet": "Ghi số điện thoại lên một mẩu giấy.", "eng": "Write a phone number on a slip of paper."}, {"viet": "Ngon, tôi ngủ say như chết.", "eng": "Yes, I slept like a log."}, {"viet": "Anh nên đi gặp bác sĩ về chỗ đứt này.", "eng": "You'd better see a doctor about that cut."}, {"viet": "Chắc chắn ông sẽ tìm được thứ vừa ý.", "eng": "You'll surely find something interesting."}, {"viet": "Anh đi đôi tất lạ quá, một chiếc màu xanh da trời còn chiếc kia màu xanh lá cây!", "eng": "You've got odd socks on one's blue and the other is green!"}, {"viet": "Anh ta không thể nhét 20 người vào một căn phòng nhỏ như vậy.", "eng": "You can't crush twenty people into such a small room."}, {"viet": "Anh có thể tin là cô ta chỉ có luôn luôn chăm chút cho bản thân cô mà thôi!", "eng": "You can depend on it that she'll always look after number one!"}, {"viet": "Anh không được đến một số nơi.", "eng": "You can't go some places."}, {"viet": "Hầu như không bao giờ thấy bạn buồn nhưng hôm nay có vẻ như bạn đánh mất người bạn cuối cùng.", "eng": "You hardly ever look sad but today you look like you've lost your last friend."}, {"viet": "Bạn biết là lần trước chúng ta đã nghỉ hè vui vẻ biết bao.", "eng": "You know how much we enjoyed it last time."}, {"viet": "Anh phải trả lời tất cả các câu hỏi không trừ câu nào.", "eng": "You must answer all the questions without exception."}, {"viet": "Muốn làm thầy giáo thì phải có rất nhiều kiên nhẫn.", "eng": "You need a lot of patience to be a teacher."}, {"viet": "Bạn nên đánh răng sau khi ăn xong.", "eng": "You should brush your teeth after every meal."}, {"viet": "Mưa to sấm sét đùng đùng mà anh vẫn ngủ say.", "eng": "You slept right through the thunderstorm."}, {"viet": "Anh cần tìm kiếm lời khuyên nhủ của người chuyên nghiệp về việc khiếu nại bồi thường của anh.", "eng": "You will need to seek professional advice about your claim for compensation."}, {"viet": "Những ngày khổ sở bên bếp lò nóng của bạn đã chấm hết, lò vi sóng ngày nay đang thay thế phần lớn.", "eng": "Your days of slaving over a hot stove are numbered, the microwave is now taking over in a big way."}, {"viet": "Câu chuyện của anh ít giống hoặc không giống với thực tế.", "eng": "Your story shows little or no resemblance to the facts."}]