[{"viet": "10 bảng Anh là đủ tiền xăng cho cuộc hành trình của chúng tôi.", "eng": "10 will cover our petrol for the journey."}, {"viet": "Một lực lượng nòng cốt trung sĩ và hạ sĩ huấn luyện tân binh.", "eng": "A cadre of sergeants and corporals who train recruits."}, {"viet": "Sự bất đồng sâu sắc giữa ngài thủ tướng và lãnh tụ phe đối lập về chi phí quốc phòng.", "eng": "A clash between the Prime Minister and the leader of the Opposition on defense spending."}, {"viet": "Một nước điêu đứng về sự sụp đổ kinh tế.", "eng": "A country in the throes of economic collapse."}, {"viet": "Một đoạn văn miêu tả trong cuốn tiểu thuyết.", "eng": "A descriptive passage in a novel."}, {"viet": "Nhà máy cung cấp các bộ phận cho công nghiệp xe ôtô.", "eng": "A factory supplying components for the car industry."}, {"viet": "Một người kiên quyết ủng hộ giáo lý Công giáo chính thống.", "eng": "A firm supporter of Catholic orthodoxies."}, {"viet": "Có một cốc rượu mà uống thì hết ý.", "eng": "A glass of wine would go down very nicely."}, {"viet": "Một khách trọ bị bệnh cúm.", "eng": "A guest has come down with the flu."}, {"viet": "Một ngôi nhà được xây dựng như một lâu đài Ấn Độ.", "eng": "A house built like an Indian palace."}, {"viet": "Một con vật khổng lồ nổi lên khỏi mặt nước.", "eng": "A large animal emerged from the water."}, {"viet": "Một chút tỏi làm cho nước sốt thêm hương vị.", "eng": "A little garlic lends flavour to a sauce."}, {"viet": "Một người có những khả năng cảm nhận tinh tế và tao nhã.", "eng": "A man of subtle and refined sensibilities."}, {"viet": "Một phân tử nước gồm hai nguyên tử hydro và một nguyên tử oxy.", "eng": "A molecule of water consists of two atoms of hydrogen and one atom of water."}, {"viet": "Sự hợp nhất giữa các dòng khác nhau của nhà thờ.", "eng": "A new unity between different branches of the church."}, {"viet": "Một chiếc xe phóng qua làm bùn bắn tung toé vào tất cả chúng tôi.", "eng": "A passing car dashed mud all over us."}, {"viet": "Một kế hoạch thử nghiệm để chủng ngừa trẻ con chống bệnh ban đỏ.", "eng": "A pilot scheme to vaccinate children against German measles."}, {"viet": "Một chất thuốc để che các vết nám da.", "eng": "A preparation for hiding skin blemishes."}, {"viet": "Một chứng ban nổi khắp lưng của tôi.", "eng": "A rash has erupted all over my back."}, {"viet": "Cần có một mức giới hạn về giá cao nhất để cho khách hàng của chúng tôi hài lòng.", "eng": "A roof on prices is needed to keep our customers happy."}, {"viet": "Một vấn đề tế nhị tương tự như các mối quan hệ chủng tộc.", "eng": "A sensitive issue like race relations."}, {"viet": "Một chiếc váy được xếp nếp ở thắt lưng.", "eng": "A skirt gathered in at the waist."}, {"viet": "Một bài diễn văn sắp xếp theo năm tiêu đề.", "eng": "A speech arranged under five heads."}, {"viet": "Một chất có thể chống rỉ.", "eng": "A substance that will prevent rust."}, {"viet": "Một lý thuyết dựa vào một giả thiết sai lầm.", "eng": "A theory resting on a false assumption."}, {"viet": "Người ăn chay lấy chất đạm không phải từ thịt mà là từ những thứ tương tự của nó.", "eng": "A vegetarian gets protein not from meat but from its analogues."}, {"viet": "Một loại rượu vang được sản xuất bởi hợp tác xã trồng trọt ở địa phương.", "eng": "A wine produced by the local growers co-op."}, {"viet": "Theo bảng dự báo thời tiết, trời sẽ mưa vào ngày mốt.", "eng": "According to the weather report, it's going to rain the day after tomorrow."}, {"viet": "Các quảng cáo nhằm lôi cuốn người ta tới các cửa hàng.", "eng": "Advertisements are designed to entice people into the shops."}, {"viet": "Sau ca mổ của cô ấy, cô ấy bị yếu sức hoàn toàn.", "eng": "After her operation she suffered from general debility."}, {"viet": "Sau khi bông được hái xong, hạt phải được lấy ra.", "eng": "After the cotton has been picked the seeds must be removed."}, {"viet": "Không khí đi qua ống và truyền khắp cơ thể côn trùng.", "eng": "Air travels through the tubes all over the insects's bodies."}, {"viet": "Mọi nhận xét nên đề đạt thẳng với chủ toạ.", "eng": "All remarks should be addressed to the chair."}, {"viet": "Mọi công việc tôi đang làm thêm đã ngốn hết thời gian rảnh rỗi của tôi.", "eng": "All this extra work I'm doing is breaking into my leisure time."}, {"viet": "Các xe cứu thương được in chữ AMBULANCE ngược chiều trên nắp máy xe.", "eng": "Ambulances have AMBULANCE printed in reverse on their bonnets."}, {"viet": "Sự yêu cầu giúp đỡ, thực phẩm, thêm nhân viên.", "eng": "An appeal for help, food, extra staff."}, {"viet": "Một sự trao đổi công hàm giữa các chính phủ.", "eng": "An exchange of notes between governments."}, {"viet": "Một hòm di tích thiêng liêng ở sâu phía dưới bàn thờ không ai xâm phạm được.", "eng": "An inviolable reliquary deep beneath the altar."}, {"viet": "Một người có uy tín không thể nghi ngờ được về môn đó.", "eng": "An undoubted authority on the subject."}, {"viet": "Rồi bạn sẽ thấy thích thú với các môn thể thao.", "eng": "And you'll find some pleasure in sports."}, {"viet": "Có mặt hàng đặc biệt nào ông muốn hỏi không?", "eng": "Anything particular you want to inquire?"}, {"viet": "Có chuyến tham quan nào đi bằng xe buýt không?", "eng": "Are there any sightseeing tours by bus?"}, {"viet": "Chiều mai chị có bận con cái hay không?", "eng": "Are you having the children tomorrow afternoon?"}, {"viet": "Xếp đặt một cuộc hẹn với Bill ở quán rượu vào lúc hai giờ.", "eng": "Arrange a rendezvous with Bill at the pub at two o'clock."}, {"viet": "Rất có thể là sẽ mưa.", "eng": "As likely as not, it will rain."}, {"viet": "Nhờ bà ấy giúp cho anh.", "eng": "Ask that lady to help you."}, {"viet": "Đến khi hết hạn, nó có thể được ký lại cho 28 năm nữa.", "eng": "At the end of that time it may be renewed for another 28 years."}, {"viet": "Các em bé thích nhai một vật gì đó khi chúng bắt đầu mọc răng sữa.", "eng": "Babies like to chew something when they're teething."}, {"viet": "Biết là mình đang bị theo dõi.", "eng": "Be conscious of that one is being watched."}, {"viet": "Hãy đánh ba lòng đỏ trứng.", "eng": "Beat up the yolks of three eggs."}, {"viet": "Dưới mộ bia này thi hài của nhà thơ đó an nghỉ.", "eng": "Beneath this stone repose the poet's mortal remains."}, {"viet": "Các máy bay ném bom cất cánh từ các căn cứ miền Bắc.", "eng": "Bombers operating from bases in the North."}, {"viet": "Nước láng giềng gần Anh nhất là Pháp.", "eng": "Britain's nearest neighbour is France."}, {"viet": "Nhưng tôi có thể gửi chúng cho ông ngày mai.", "eng": "But I can send them to you tomorrow."}, {"viet": "Nhưng sẽ còn nhiều chuyến nữa lần lượt đến.", "eng": "But there will be many coming one after another."}, {"viet": "Thật là may lạ lùng, tôi được trả lương quá cao tháng này.", "eng": "By some freak of chance I was overpaid this month."}, {"viet": "Tôi có thể đổi tiền mặt giấy chứng nhận đó trước ngày đáo hạn không?", "eng": "Can I cash in the certificate before the maturity date?"}, {"viet": "Chúng ta có thể tin chắc được là cô ta ngay thật không?", "eng": "Can we be sure that she's honest?"}, {"viet": "Mày có dám nhìn thẳng vào mắt tao và nói rằng mày đã không làm vỡ cánh cửa sổ không?", "eng": "Can you look me in the eyes and say you didn't break the window?"}, {"viet": "Em xỏ kim dùm cho chị được không?", "eng": "Can you thread this needle for me?"}, {"viet": "Một số thủ tục phải được tiến hành trước khi ta có thể di trú được.", "eng": "Certain formalities have to be gone through before one can emigrate."}, {"viet": "Trẻ con dưới năm tuổi thường được đi xe lửa miễn phí.", "eng": "Children under five usually travel free on trains."}, {"viet": "Thu phục bọn nổi loạn bằng cách cho họ cương vị có quyền hành.", "eng": "Co-opt rebels by giving them position of authority."}, {"viet": "Công nhân của công ty nhận tiền thưởng Giáng Sinh 25 bảng Anh.", "eng": "Company employees received a £ 25 Christmas bonus."}, {"viet": "Sự đam mê các thói quen xấu đã đưa anh ta tới chỗ tàn tạ.", "eng": "Constant indulgence in bad habits brought about his ruin."}, {"viet": "Bạn có thể đưa nó cho tôi không?", "eng": "Could you give it to me?"}, {"viet": "Tường thuật hội nghị hàng năm của Đảng Lao động.", "eng": "Cover the Labour Party's annual conference."}, {"viet": "Nhà ẩm thấp, dơ bẩn là nơi nuôi dưỡng bệnh tật.", "eng": "Damp, dirty houses are a breeding ground for disease."}, {"viet": "Những người biểu tình đã thành công trong việc làm rối loạn được cuộc họp.", "eng": "Demonstrators succeeded in disrupting the meeting."}, {"viet": "Liệu có phải tôi thực sự đã nghe ai đó đi vào nhà, hay đó chỉ là điều tưởng tượng thôi?", "eng": "Did I really hear someone come in, or was it only a fancy?"}, {"viet": "Trường cấp ba của bạn đã có nội qui nghiêm ngặt phải không?", "eng": "Did your senior high school have strict rules?"}, {"viet": "Hãy đánh bóng đôi giày của anh trước khi đi ra đường.", "eng": "Do give your shoes a polish before you go out."}, {"viet": "Bạn có đồng ý với điều ông ấy đang nói không?", "eng": "Do you agree with what he is saying?"}, {"viet": "Nước bạn có một liên đoàn bóng rổ phải không?", "eng": "Do you have a professional basketball league?"}, {"viet": "Bạn biết có bao nhiêu người sống ở Tokyo không?", "eng": "Do you know how many people live in Tokyo?"}, {"viet": "Bạn có tham gia hoạt động cộng đồng nào không?", "eng": "Do you participate in any community activities?"}, {"viet": "Anh có cho là ý nghĩ này có khả năng làm doanh số bán hàng tăng không?", "eng": "Do you think the idea has sales potential?"}, {"viet": "Có phải hy vọng duy nhất của chúng ta để sống còn là việc giải trừ quân bị không?", "eng": "Does our only hope of survival lie in disarmament?"}, {"viet": "Đừng có cố ý bới móc lỗi lầm.", "eng": "Don't be so ready to find fault."}, {"viet": "Đừng làm bẩn cái quần mới của con nhé!", "eng": "Don't get your new trousers dirty!"}, {"viet": "Đừng phà khói vào mặt người khác.", "eng": "Don't puff smoke into people's faces."}, {"viet": "Đừng có mà tìm cách dạy tao làm công việc của tao nhé, thằng lỏi.", "eng": "Don't try to teach me my job, sonny."}, {"viet": "Nghiện rượu là vấn đề đang gia tăng trong giới trẻ.", "eng": "Drink is a growing problem among the young."}, {"viet": "Con người nguyên thủy tỏ ra có một số điểm giống với loài khỉ.", "eng": "Early man shows certain affinities with the ape."}, {"viet": "Quần vợt Anh đang trong tình trạng tồi tệ.", "eng": "English tennis is in a parlous condition."}, {"viet": "Mọi người có học nên đọc quyển sách này.", "eng": "Every literate person should read this book."}, {"viet": "Xin lỗi, vui lòng đổi cho tôi một ít tiền lẻ?", "eng": "Excuse me, could I have some change?"}, {"viet": "Đối phó với một loạt những lời than phiền đầy giận dữ.", "eng": "Face a barrage of angry complaints."}, {"viet": "Cảm thấy càng ngày càng lo lắng về tư cách đạo đức của cô ta.", "eng": "Feel increasingly perturbed about her behaviour."}, {"viet": "Ngọn lửa bùng cháy vào ban đêm.", "eng": "Fire broke out during the night."}, {"viet": "Các bông hoa có sương đêm phớt nhẹ qua.", "eng": "Flowers that were kissed by dew."}, {"viet": "Đối với một bà già thì việc mua tờ báo hàng ngày chẳng mấy nỗi trở nên có ý nghĩa, vì bà ta thực sự chỉ muốn tán gẫu với người chủ tiệm thôi.", "eng": "For the old lady buying the daily newspaper soon became an end in itself, since she really just wanted to chat with the shopkeeper."}, {"viet": "Theo quan điểm của một giáo viên thì quyển từ điển này rất hữu ích.", "eng": "From a teacher's point of view this dictionary will be very useful."}, {"viet": "Những làn sóng lăn tăn trên một bờ biển đầy cát.", "eng": "Gentle wavelets on a sandy shore."}, {"viet": "Cho anh một cốc nước đi-anh đang khát khô cả cổ.", "eng": "Give me a drink-I'm parched."}, {"viet": "Đi một mình trên một đoạn đường dài ở vùng quê.", "eng": "Go for a solitary tramp in the country."}, {"viet": "Cho viên đại sứ nước ngoài một buổi tiếp kiến riêng.", "eng": "Grant a private audience to a foreign ambassador."}, {"viet": "Tôi đã cố vắt óc ra, nhưng không thể nhớ ra tên của nàng.", "eng": "Hard as I cudgelled my brains, I couldn't remember her name."}, {"viet": "Anh có bí quyết nào để kiếm tiền nếu tiền chúng ta hết nhẵn không?", "eng": "Have you any ideas up your sleeve if our money runs out?"}, {"viet": "Thế ông có đề nghị nào khác để thay thế không?", "eng": "Have you got an alternative suggestion?"}, {"viet": "Không có con, họ quyết định nhận một đứa trẻ mồ côi làm con nuôi.", "eng": "Having no children of their own they decided to adopt an orphan."}, {"viet": "Nó xưa nay vẫn khá sỗ sàng nhưng lần này thì nó đã đi quá xa.", "eng": "He's always been rather rude but this time he's gone too far."}, {"viet": "Ông ấy đã chết rồi có mong ông sống lại cũng không ích gì.", "eng": "He's dead and it's no use wishing him alive again."}, {"viet": "Anh ta sống ở Pháp nhiều năm, nhưng lạ thay anh ta lại không nói được từ nào tiếng Pháp.", "eng": "He's lived in France for years, but strangely enough he can't speak a word of French."}, {"viet": "Ông ấy bị rối loạn tâm thần nặng.", "eng": "He's suffering from severe mental disorder."}, {"viet": "Trong thư, anh ta luôn luôn hỏi thăm sức khoẻ của anh.", "eng": "He always asks after you in his letters."}, {"viet": "Anh ta bắt đầu rưng rưng nước mắt khi anh ta hồi tưởng.", "eng": "He becomes teary when he reminisces."}, {"viet": "Anh ta đến miền Nam để tìm một việc làm.", "eng": "He came to the South to look for a job."}, {"viet": "Anh ta vừa ngạo nghễ lại vừa bất tài trong sự đối xử của mình với nhân viên.", "eng": "He combines arrogance and incompetence in his dealings with the staff."}, {"viet": "Nó đã hạ đo ván anh ta với cú đấm đầu tiên.", "eng": "He decked him with his first punch."}, {"viet": "Anh ta không nghĩ rằng trẻ con nên được nuông chiều.", "eng": "He doesn't believe that children should be mollycoddled."}, {"viet": "Anh ấy đã tỏ ra khá dè dặt về việc không đưa đơn xin ly dị.", "eng": "He exercised considerable restraint in not suing for a divorce."}, {"viet": "Anh ta bắn nhanh liên tiếp ba phát đạn.", "eng": "He fired three shots in quick succession."}, {"viet": "Ông ấy chăm chăm nhìn buồn bã trong gương mái tóc đang bạc của mình.", "eng": "He gazed ruefully in the mirror at his greying locks."}, {"viet": "Hắn ta đã lừa gạt nhân viên thu thuế nhưng phải nhiều năm sau hắn mới bị phát hiện.", "eng": "He had been cheating the taxman but it was years before he was found out."}, {"viet": "Hắn ta có một tiền sử về tội ác.", "eng": "He has a history of violent crime."}, {"viet": "Ông ta giữ chức vụ chủ tịch nhiều năm.", "eng": "He has held the office of chairman for many years."}, {"viet": "Ông ta ghét bị chuyển từ nhà của mình ở nông thôn sang một cuộc sống ồn ào náo nhiệt ở thành phố.", "eng": "He hated being transplanted from his home in the country to the noise and bustle of life in the city."}, {"viet": "Nó đang được điều trị ở một bệnh viện tư.", "eng": "He is being treated at a private clinic."}, {"viet": "Anh ấy còn đang hồi phục sau ca phẫu thuật.", "eng": "He is still recuperating from his operation."}, {"viet": "Anh ấy sút ghi điểm một quả phạt đền và hai quả ghi điểm chuyển hoán.", "eng": "He kicked a penalty goal and two conversions."}, {"viet": "Anh ấy sống ở bờ biển phía đông.", "eng": "He lives on the east coast."}, {"viet": "Anh ta có một đề nghị hào hiệp dành cho tôi.", "eng": "He made me a sporting offer."}, {"viet": "Anh ấy cần cưới một người thực tế để lo liệu cuộc sống cho anh ta.", "eng": "He needs to marry a down-to-earth person who will organize his life for him."}, {"viet": "Hắn trả 14 bảng Anh một tuần để ăn cơm tháng và ở trọ.", "eng": "He pays £ 14 a week for board and lodging."}, {"viet": "Anh ấy hứa giúp đỡ nếu có dịp.", "eng": "He promised to help if the occasion arose."}, {"viet": "Ông ta đọc một bản tham luận tại một hội nghị y học về kết quả công trình nghiên cứu của ông.", "eng": "He read a paper at a medical conference on the results of his research."}, {"viet": "Ông ta từ chức trong quân đội để đảm nhận một công việc dân sự.", "eng": "He resigned his commission to take up a civilian job."}, {"viet": "Anh ta là người thật đàng hoàng.", "eng": "He's a thoroughly decent man."}, {"viet": "Anh ấy tràn đầy sinh lực và sẵn sàng khởi sự.", "eng": "He's full of sap and ready to start."}, {"viet": "Hắn không phải là thằng ngốc đến độ như cái vẻ của hắn đâu.", "eng": "He's not such a fool as he looks."}, {"viet": "Anh ta nói anh ta không phạm tội giết người.", "eng": "He said he hadn't committed the murder."}, {"viet": "Ông ta có vẻ bình thản không biết là có chuyện không hay đã xảy ra.", "eng": "He seemed serenely unaware that anything had gone wrong."}, {"viet": "Hắn đã tỏ ra là một kẻ bất lương.", "eng": "He showed himself a dishonest rascal."}, {"viet": "Nó đã bỏ ra mấy phút để suy nghĩ trước khi quyết định.", "eng": "He spent several minutes in thought before deciding."}, {"viet": "Ông ta đứng thở hổn hển ở đầu cầu thang.", "eng": "He stood panting at the top of the stairs."}, {"viet": "Hàng ngày ông ta đem theo bữa ăn trưa đựng trong hộp đến nơi làm việc.", "eng": "He takes a packed lunch to work every day."}, {"viet": "Anh ta hít một hơi sâu vào buồng phổi của anh ta.", "eng": "He took a deep draught of air into his lungs."}, {"viet": "Hắn cố gièm pha kiến thức của cô ta về văn học.", "eng": "He tried to put down her knowledge of literature."}, {"viet": "Nó nhảy xuống nước và cứu được đứa bé sắp chết đuối.", "eng": "He waded in and saved the drowning child."}, {"viet": "Anh ta rất khích động trước thông báo bất ngờ.", "eng": "He was all agog at the surprise announcement."}, {"viet": "Anh ấy được vào đội tuyển Anh quốc 36 lần.", "eng": "He was capped 36 times for England."}, {"viet": "Nó tỏ ra ghen tị với thành công của anh nó.", "eng": "He was envious of his brother's success."}, {"viet": "Anh ta bị bắt cóc sau khi từ chối không chịu rút khỏi chính trị.", "eng": "He was kidnapped after refusing to abstain from politics."}, {"viet": "Anh ta thở hổn hển khi chạy.", "eng": "He was panting heavily as he ran."}, {"viet": "Ông ta yếu sức như vậy nên không thể nào theo kịp ( chúng tôi ).", "eng": "He was so unfit he couldn't keep pace ( with us )."}, {"viet": "Ông ta dùng các công việc làm ăn của anh ta như tấm bình phong che giấu tội ác.", "eng": "He was using his business activities as a screen for crime."}, {"viet": "Anh ta quất roi vào con ngựa làm nó phi nhanh hơn.", "eng": "He whipped the horse to make it run faster."}, {"viet": "Anh ta làm việc ở dây chuyền lắp ráp tại xưởng xe hơi địa phương.", "eng": "He works on the assembly line the local car factory."}, {"viet": "Những người phá đám chặn ngang bài diễn thuyết của bà ta bằng sự giễu cợt.", "eng": "Hecklers interrupted her speech with jeering."}, {"viet": "Sắc đẹp của nàng làm cho ai cũng phải chú ý.", "eng": "Her beauty makes her the focus of attention."}, {"viet": "Các lời chỉ trích của cô ấy hoàn toàn không đúng chỗ.", "eng": "Her criticisms were quite out of place."}, {"viet": "Trong những lúc buồn chán như thế này chính niềm tin đã giúp cô ta giữ vững tinh thần.", "eng": "Her faith upheld her in that tone of sadness."}, {"viet": "Chiều cao của cô ấy sẽ là điều rất bất lợi nếu cô ấy muốn làm diễn viên múa.", "eng": "Her height will be very much to her disadvantage if she wants to be a dancer."}, {"viet": "Cuộc đời cô ta ba chìm bảy nổi.", "eng": "Her life was full of drama."}, {"viet": "Tính lưỡng lự của cô ấy thật là bực mình.", "eng": "Her oscillations in smooth are maddening."}, {"viet": "Bản tường thuật của cô ấy về những gì đã xảy ra chính xác đến từng chi tiết.", "eng": "Her report of what happened was accurate in every detail."}, {"viet": "Thành công của cô ta nhờ may mắn không phải là ít.", "eng": "Her success is in no small measure the result of luck."}, {"viet": "Đây là hộ chiếu, thẻ tín dụng và biên nhận của ông.", "eng": "Here's your passport, credit card and receipt."}, {"viet": "Giọng nói của anh ta để lộ ra rằng anh ấy là người nước ngoài.", "eng": "His accent betrayed the fact that the he was foreign."}, {"viet": "Hành vi của anh ta đã làm tiêu tan các dấu ấn cuối cùng của lòng mến mộ của bà ta đối với anh.", "eng": "His behaviour extinguished the last traces of affection she had for him."}, {"viet": "Lời bình phẩm của anh ta đã gây ra ngay một cuộc cãi nhau giữa họ.", "eng": "His comment sparked off a quarrel between them."}, {"viet": "Sự khích lệ của ông ta là một chỗ dựa tinh thần lớn đối với sự tự tin của cô ta.", "eng": "His encouragement was a great prop to her self-confidence."}, {"viet": "Buổi biểu diễn đầu tiên của anh ấy thất bại hoàn toàn: khán giả đã la ó đòi anh ta rời sân khấu.", "eng": "His first performance was a debacle: the audience booed him off the stage."}, {"viet": "Quan niệm về giáo dục con gái của ông ấy thật là hết sức cổ hủ.", "eng": "His ideas on the education of girls are positively prehistoric."}, {"viet": "Tật khập khiễng của anh ta là hậu quả của một tai nạn.", "eng": "His limp is the result of an accident."}, {"viet": "Nỗi ám ảnh của anh ta về máy tính bắt đầu cách đây sáu tháng.", "eng": "His obsession with computers began six months ago."}, {"viet": "Những hành động riêng tư của ông ta mâu thuẫn hoàn toàn với những ý kiến ông ta phát biểu công khai.", "eng": "His private actions are in direct contradiction to his publicly expressed opinions."}, {"viet": "Tính chân thật của nó khiến cho tôi tin nó.", "eng": "His sincerity inclines me to trust him."}, {"viet": "Sự bảo vệ thành công chức vô địch lần thứ ba của anh ấy.", "eng": "His third successful defense of the title."}, {"viet": "Tác phẩm của ông ta gần như không được biết đến ở đây.", "eng": "His work is practically unknown here."}, {"viet": "Anh yêu, anh làm ơn xếp sách của anh lại đi nhé?", "eng": "Honey, would you organize your books?"}, {"viet": "Hôm nay anh cảm thấy trong người thế nào?''Chỉ đỡ đỡ'.", "eng": "How are you feeling today?''Oh, only so-so'."}, {"viet": "Làm sao mà cô ta nghiện ngập ma túy chứ?", "eng": "How did she get into drugs?"}, {"viet": "Anh ta kiếm sống bằng cách nào?", "eng": "How does he earn his bread and butter?"}, {"viet": "Nếu để trong tủ lạnh thì nó sẽ giữ tươi được bao lâu?", "eng": "How long will it remain fresh in the fridge?"}, {"viet": "Các ông trình diễn vở này bao nhiêu buổi?", "eng": "How many performances of the play are you giving?"}, {"viet": "Phải mất thời gian bao lâu nữa?", "eng": "How much longer will it take?"}, {"viet": "Tuy nhiên, có thể nó hơi có mùi ẩm mốc đấy.", "eng": "However, it might smell a little moldy."}, {"viet": "Tôi không thích anh nghĩ là tôi chỉ trích anh.", "eng": "I'd hate you to think I was criticizing you."}, {"viet": "Tôi thích đi xem trận đấu ngày mai.", "eng": "I'd love to go to the match tomorrow."}, {"viet": "Tôi sẽ cho anh mười bảng Anh để đền bồi thường.", "eng": "I'll give you ten pounds to repair the damage."}, {"viet": "Tôi sẽ mang chúng đến phòng của bà ngay.", "eng": "I'll send them to your room right away."}, {"viet": "Tôi e rằng những quan điểm của tôi về đời sống riêng tư của họ thì không thể in được!", "eng": "I'm afraid that my views on their private life unprintable!"}, {"viet": "Tôi sẽ đi nghỉ nửa tháng.", "eng": "I'm going away for a fortnight's holiday."}, {"viet": "Tôi đang tìm một công việc ổn định.", "eng": "I'm looking for a permanent appointment."}, {"viet": "Lúc này tôi làm việc quá sức-Tôi đã nhận quá nhiều cam kết.", "eng": "I'm overworked at the moment-I've taken on too many commitments."}, {"viet": "Tôi đang nói với tư cách đại diện cho tất cả công nhân trong xí nghiệp.", "eng": "I'm speaking for all the workers in this firm."}, {"viet": "Lúc này công việc ngập đến tận mang tai.", "eng": "I'm up to my ears in work at the moment."}, {"viet": "Tôi đã chơi từ khi tôi học trung học.", "eng": "I've been playing since I was in high school."}, {"viet": "Ngày mai tôi phải đi làm việc bằng xe buýt.", "eng": "I've got to go to work by bus tomorrow."}, {"viet": "Đã lâu rồi tôi không gặp cô ta.", "eng": "I've not seen her for a month of Sundays."}, {"viet": "Tôi kính phục tài năng của anh ta nhưng tôi không thích con người anh ta.", "eng": "I admire his skill but dislike him personally."}, {"viet": "Tôi rất biết ơn chồng tôi đã giúp tôi biên tập cuốn sách.", "eng": "I am deeply indebted to my husband for helping me to edit the book."}, {"viet": "Tôi và Wibur, em trai tôi, cả hai ngã xuống lạch và phải cởi quần áo một lúc cho khô.", "eng": "I and Wibur, that's my brother, both fell in the creek and had to air our pores a while so our pants could dry out."}, {"viet": "Tôi chắc là anh ta tới muộn-anh ta luôn như vậy.", "eng": "I bet he arrives late-he always does."}, {"viet": "Tôi không thể tập trung vào việc học trong khi tiếng ồn ào đó cứ tiếp tục.", "eng": "I can't concentrate on my study with all that noise going on."}, {"viet": "Tôi không hiểu tại sao chúng tôi phải trả nhiều như vậy!", "eng": "I can't see why we have to pay so much!"}, {"viet": "Tôi có thể biếu anh 50 pao chứ không thể nhiều hơn thế được.", "eng": "I can offer you 50 pounds, but I can't go any further than that."}, {"viet": "Tôi không thể đọc được chữ viết tay của anh ta.", "eng": "I can't read his handwriting."}, {"viet": "Tôi có thể nhìn thấy một con ngựa trong sương.", "eng": "I could just discern the shape of a horse in the mist."}, {"viet": "Xin cho em một ít nước.", "eng": "I'd like some water, please."}, {"viet": "Tôi đã không biết rằng anh và cô ta đã có mối thân tình như thế.", "eng": "I didn't know you and she were on such intimate terms."}, {"viet": "Mình không muốn đi xem phim với cậu và Sharon đâu, hai là đủ, ba là thừa.", "eng": "I don't come to the cinema with you and Sharon: two's company, three's a crowd."}, {"viet": "Tôi không thích cách nó biện hộ cho chính sách này.", "eng": "I don't like his advocacy of this policy."}, {"viet": "Tôi không hiểu cái máy kì quặc này chạy thế nào.", "eng": "I don't understand how this contraption works."}, {"viet": "Tôi không có anh chị em nào cả.", "eng": "I don't have any brothers or sisters."}, {"viet": "Tôi kèm theo một phong bì có dán sẵn tem và ghi địa chỉ để cho ông trả lời.", "eng": "I enclose a stamped addressed envelope for your reply."}, {"viet": "Tôi ngã và bị trầy đầu gối.", "eng": "I fell and scraped my knee."}, {"viet": "Tôi quên cái tên mà anh gọi cái vật anh ấy đeo rồi.", "eng": "I forgot what you call the thing he's wearing."}, {"viet": "Tôi lại lãnh thêm một giấy phạt chết tiệt này nữa rồi.", "eng": "I got another doggone traffic ticket."}, {"viet": "Tôi đã ăn điểm tâm rất muộn.", "eng": "I had a very late breakfast."}, {"viet": "Tôi ngẫu nhiên tìm thấy đúng cái tôi đang tìm kiếm.", "eng": "I happened on just the thing I'd been looking for."}, {"viet": "Tôi nghi ngờ không biết anh ta có phải là người tốt nhất để làm công việc đó không.", "eng": "I have doubts about whether he is the best man for the job."}, {"viet": "Tôi đã xem bộ phim đó hai lần.", "eng": "I have seen the film twice."}, {"viet": "Tôi không mấy thành công trong chuyện đi xin việc.", "eng": "I haven't had much success in my applications for jobs."}, {"viet": "Tôi chỉ nghe được lõm bõm những gì người ta nói.", "eng": "I heard only tags and snippets of what was being said."}, {"viet": "Tôi hi vọng khách sạn cô sẽ có thể cải thiện điều kiện vệ sinh.", "eng": "I hope you'll be able to improve the sanitary conditions."}, {"viet": "Tôi cắm các bút vẽ của tôi trong các lọ mứt cũ.", "eng": "I keep my paint-brushes in old jam jars."}, {"viet": "Tôi để nó ở trên bàn này mà.", "eng": "I left it on this desk."}, {"viet": "Tôi sống ở nước ngoài nhiều năm, chủ yếu là nước Ý.", "eng": "I lived abroad for years, chiefly in Italia."}, {"viet": "Tôi sẽ nướng cho anh mấy con cá.", "eng": "I'll grill you some fish."}, {"viet": "Bác sẽ viết cho cháu một toa thuốc.", "eng": "I'll write you a prescription."}, {"viet": "Tôi thích câu cá và săn bắn.", "eng": "I'm fond of fishing and hunting."}, {"viet": "Tôi đâu có giàu lắm, anh biết đấy!", "eng": "I'm not made of money, you know!"}, {"viet": "Tôi sẽ được đổi phiên vào lúc 6 giờ.", "eng": "I'm to be relieved at six."}, {"viet": "Tôi lỡ tàu vì tôi đã tính lầm thời gian tôi phải đi tới ga.", "eng": "I missed the train because in miscalculated the time it would take me to reach the station."}, {"viet": "Tôi cần một quyển từ điển Pháp mới, tôi có thể xin anh góp ý để mua cuốn nào hay nhất không?", "eng": "I need a new French dictionary, can I pick your brains about the best one to buy?"}, {"viet": "Tôi phản đối những lời ám chỉ khó chịu của anh!", "eng": "I object to your unpleasant insinuations!"}, {"viet": "Tôi thích loại này hơn, Old Bushmills.", "eng": "I prefer this one, Old Bushmills."}, {"viet": "Thật sự tôi chưa biết hết đường đi quanh đây.", "eng": "I really don't know my way around yet."}, {"viet": "Tôi trả lời bằng một bức thư ngắn.", "eng": "I replied with a short note."}, {"viet": "Tôi thấy một ngón tay ló ra khỏi cái lỗ trên găng tay của anh.", "eng": "I see a finger poking through a hole in your glove."}, {"viet": "Tôi muốn làm thủ tục hải quan.", "eng": "I should like to get Customs clearance."}, {"viet": "Tôi ngừng chơi bóng vì có công việc làm quan trọng hơn.", "eng": "I stopped playing football because my work had a prior claim on my time."}, {"viet": "Tôi nghĩ là anh ta đã được trả quá cao cho công việc vặt mà anh ta làm.", "eng": "I think he's overpaid for the little he does."}, {"viet": "Tôi nghĩ là cô ấy đang si tình.", "eng": "I think she's in love."}, {"viet": "Tôi nghĩ tôi sẽ gọi điện cho bạn để xem bạn ra sao.", "eng": "I thought I would give you a call and see how you're."}, {"viet": "Tôi thử gọi điện cho cô ấy nhưng đúng lúc tôi gọi thì cô ấy rời khỏi nhà.", "eng": "I tried to phone her but even as I was phoning she was leaving the building."}, {"viet": "Tôi đã nghe nói điều này thật sự hay.", "eng": "I've heard it's really nice."}, {"viet": "Tôi muốn đi từ đây đến vùng Đại Hồ.", "eng": "I want to go from here to the Great Lakes."}, {"viet": "Tôi luôn luôn có phần nào kém toán.", "eng": "I was always a bit of a duffer at maths."}, {"viet": "Tôi đang trông mong một người ủng hộ về tài chính nhưng dự án quá chông chênh.", "eng": "I was hoping for a backer but the project was too chancy."}, {"viet": "Tôi bị ngập đầu vì công việc.", "eng": "I was snowed under with work."}, {"viet": "Tôi không cảm thấy thực sự thoải mái trong bữa tiệc nên tôi chẳng thích chút nào.", "eng": "I wasn't feeling at my best at the party so I didn't enjoy it."}, {"viet": "Ước gì tôi có thể có cơ hội đến thăm nước Mỹ.", "eng": "I wish I could have a chance to visit the U. S. A."}, {"viet": "Tôi không biết cô có nhận chi phiếu du lịch hay không.", "eng": "I wonder if you accept traveler's checks."}, {"viet": "Xin cho em một ít thuốc chống say máy bay.", "eng": "I would like some medicine for airsickness."}, {"viet": "Tôi sẽ không tự làm nhục mình đi xin xỏ điều ấy!", "eng": "I wouldn't demean myself to ask for it!"}, {"viet": "Nếu Billy lừa dối tôi, tôi sẽ bỏ anh ta.", "eng": "If Billy cheats on me, I'll dump him."}, {"viet": "Ở địa vị anh tôi sẽ mua một chiếc ô tô rẻ hơn.", "eng": "If I were you... I'd buy a cheaper car."}, {"viet": "Nếu cái cây đổ theo hướng này nó sẽ phá huỷ ngôi nhà.", "eng": "If the tree falls that way, it will destroy the house."}, {"viet": "Nếu anh không thức dậy trước tám giờ tôi sẽ gõ cửa phòng anh.", "eng": "If you're not up by eight o'clock I'll give you a knock."}, {"viet": "Nếu anh không thu được lợi nhuận, anh sẽ bị phá sản, đó là điều chủ yếu.", "eng": "If you don't make a profit you go out of business, that's the bottom line."}, {"viet": "Nếu anh đỗ xe ở đây cảnh sát có thể kéo nó đi đấy.", "eng": "If you park your car here the police may tow it away."}, {"viet": "Nếu anh muốn được xét để xin việc, anh phải điền vào tờ khai cho họ biết tên, tuổi, kinh nghiệm v. v. và gửi tới công ti.", "eng": "If you wish to be considered for this job, you must fill in a form giving your age, name, experience etc, and send it to the company."}, {"viet": "Vào thời gian xa xưa, Xe ngựa cũng được dùng trong các đám rước.", "eng": "In ancient times chariots were used in processions, too."}, {"viet": "Ở Hammerfest, Na Uy suốt ngày không thấy Mặt Trời mọc.", "eng": "In Hammerfest, Norway, the Sun does not rise at all during the day."}, {"viet": "Những tuần gần đây ngày nào anh cũng đến muộn, đề nghị anh cho biết lý do tại sao.", "eng": "In recent weeks you've been late every day, please explain yourself."}, {"viet": "Trong bóng tối lờ mờ thật khó mà nhìn thấy vật gì rõ ràng.", "eng": "In the gathering gloom it was hard to see anything distinctly."}, {"viet": "Cùng với năm tháng, họ học được cách tráng lên chúng một lớp men không thấm.", "eng": "In time they learned to put on a waterproof glaze."}, {"viet": "Tiền lãi sẽ tăng dần lên nếu bạn gửi tiền vào quĩ tiết kiệm.", "eng": "Interest will accrue if you keep your money in a savings account."}, {"viet": "Nền công nghiệp của nước ta có được bảo vệ chống sự cạnh tranh của nước ngoài không?", "eng": "Is our country's industry sheltered from foreign competitions?"}, {"viet": "Còn có điều gì chúng tôi nên cải thiện không?", "eng": "Is there anything that we should improve?"}, {"viet": "Thật là một tình thế luẩn quẩn-không có kinh nghiệm thì không có được việc làm mà không có việc làm thì không có kinh nghiệm.", "eng": "It's a catch-22 situation-without experience you can't get a job and without a job you can't get experience."}, {"viet": "Nghiên cứu bổng có được cấp cho những mục đích giải trí hay không còn là điều không chắc chắn.", "eng": "It's arguable whether grants should be applied for recreational purposes."}, {"viet": "Trời sắp tối rồi, chúng ta nên đi thôi.", "eng": "It's getting dark, we'd better make a move."}, {"viet": "Tôi có quyền ưu tiên cho nên lẽ ra ông phải dừng lại để tôi đi.", "eng": "It's my right of way, so you should have stopped and let me go."}, {"viet": "Nguồn gốc của nó xa đến nỗi vượt quá mọi ghi chép.", "eng": "It's origin is so remote as to antecede all written records."}, {"viet": "Đã đến lúc chúng ta bắt đầu rửa bát.", "eng": "It's time we got started on the washing up."}, {"viet": "Nó không thể sánh được với xe đua thứ thiệt.", "eng": "It can't compete with pukka racing cars."}, {"viet": "Tôi không thể hiểu nổi bằng cách nào mà nó có thể làm được điều đó.", "eng": "It is a mystery to me how he managed to do it."}, {"viet": "Thời tiết xấu thế này mà đi leo núi thì thật là một sự ngu ngốc cực kỳ.", "eng": "It is madness to climb in such bad weather."}, {"viet": "Đổ lỗi tất cả những điều đã xảy ra đơn giản là do chiến tranh là một điều sai lầm.", "eng": "It is wrong to ascribe all that has happened simply to the war."}, {"viet": "Nó thật sự là một thành phố nhỏ đấy!", "eng": "It really is a small city!"}, {"viet": "Người ta nói rằng ông ta là một thiên tài.", "eng": "It's said that he's a genius."}, {"viet": "Thật khó cho tôi khi phải nhận sự giúp đỡ từ thiện của họ.", "eng": "It sticks in my throat to have to accept charity from them."}, {"viet": "Leo lên ngọn đồi dài dặc đó quả là một sự mệt mỏi khủng khiếp.", "eng": "It was a terrible grind getting up that long hill."}, {"viet": "Thật đúng cái số mình đi xem kịch vào hôm diễn viên ngôi sao bị ốm.", "eng": "It was just my luck to go to the play on the day the star was ill."}, {"viet": "Anh gạt đề nghị của nó đi là dại.", "eng": "It was unwise of you to reject his offer."}, {"viet": "Ăn thịt sẽ là vi phạm đến những nguyên tắc của ông ấy.", "eng": "It would do violence to his principles to eat meat."}, {"viet": "Gian Đa đã bị thiêu ( sống ) trên dàn lửa.", "eng": "Joan of Arc was burnt ( alive ) at the stake."}, {"viet": "Chỉ cần anh nhắm mắt lại và thả trí tưởng tượng.", "eng": "Just close your eyes and let loose your imagination."}, {"viet": "Tuần trước, anh ta đâm bẹp ô tô, rồi anh ta mất việc và bây giờ để kết thúc, vợ anh ta đã bỏ anh ta.", "eng": "Last week he crashed his car, then he lost his job and now to cap it all his wife has left him."}, {"viet": "Để tôi xem … Vâng, ông có thể ở phòng 210.", "eng": "Let me see. Yes, you can have Room 210."}, {"viet": "À này, sao chúng mình không đi Đức?", "eng": "Look, why don't we go to Germany?"}, {"viet": "Nhiều người chết trong nạn đói.", "eng": "Many people die of starvation during famines."}, {"viet": "Mary hát hay hơn bất kỳ ai trong lớp.", "eng": "Mary sings better than anyone else in the class."}, {"viet": "Cho phép tôi đề nghị chúng ta đi ngay lập tức nhé?", "eng": "May I suggest that we go right away?"}, {"viet": "Hầu hết các hãng hàng không đều có các hệ thống vi tính để nhanh chóng in vé và kiểm tra các chỗ trống trên máy bay.", "eng": "Most airlines have computer systems that quickly print tickets and check for vacancies on flights."}, {"viet": "Thưa ông Owen, đây là ngân hàng Trung Quốc, chi nhánh Thượng Hải.", "eng": "Mr. Owen, this is the Bank of China, Shanghai Branch."}, {"viet": "Thủ trưởng đã khiển trách mình vì đi làm việc chậm giờ.", "eng": "My boss rebuked me for coming to work late."}, {"viet": "Cố gắng cuối cùng của tôi để lắp đặt nó đã thành công.", "eng": "My final attempt to fix it was successful."}, {"viet": "Mẹ của tôi sẽ điên tiết với tôi mất khi bà ấy tìm ra tôi đã ở đâu.", "eng": "My mother will kill me when she finds out where I've been."}, {"viet": "Ông bác tôi đã cho tôi tấm phiếu 10 pound nhân sinh nhật của tôi.", "eng": "My uncle gave me a 10 pounds book for my birthday."}, {"viet": "Luật mới ngăn chặn ô nhiễm môi trường.", "eng": "New laws to prevent the pollution of the environment."}, {"viet": "Chưa, em chưa bao giờ đến đó cả.", "eng": "No, I've never been there."}, {"viet": "Không, cám ơn, còn nhiều trong tủ lạnh.", "eng": "No thanks, there's plenty in the fridge."}, {"viet": "Thế nào, còn có ý kiến gì về báo cáo này không?", "eng": "Now then, are there any comments on this report?"}, {"viet": "Ồ, tôi không chê trách điều đó, mất 2 hay 3 ngày từ San Francisco tới Tokyo có vẻ khá tốt.", "eng": "Oh, I have no objection to that, two or three days to Tokyo from San Francisco seems pretty good."}, {"viet": "Người già thường bảo thủ hơn người trẻ.", "eng": "Old people are usually more conservative than young people."}, {"viet": "Không thể đồng nhất hạnh phúc với sự giàu có được.", "eng": "One cannot identify happiness with wealth."}, {"viet": "Có một điều chắc chắn là tôi sẽ không lại đây nữa.", "eng": "One thing is certain, I'm not coming here again."}, {"viet": "Kế hoạch phát triển của chúng tôi được xây dựng trên kết quả của việc nghiên cứu thị trường của chúng tôi.", "eng": "Our development plans are grounded on the results of out market research."}, {"viet": "Cuộc họp ở Tokyo của chúng tôi là hoàn toàn tình cờ.", "eng": "Our meeting in Tokyo was quite by chance."}, {"viet": "Xe lửa của chúng ta ở phía này mà!", "eng": "Our train is on this side!"}, {"viet": "Một bộ phận của thanh hãm xung ở đầu xe đã bị long ra.", "eng": "Part of the car's bumper had come adrift."}, {"viet": "Người đứng dầy thành hai mươi lớp để đón bà ta đi qua.", "eng": "People stood twenty deep to see her go past."}, {"viet": "Xin hãy đọc cẩn thận đoạn ‘ lời khai và hợp đồng'.", "eng": "Please read carefully the paragraph'Statement and Agreement'."}, {"viet": "Ghi nhớ một vấn đề vào trong tiềm thức của ai.", "eng": "Push a problem to the back of one's mind."}, {"viet": "Các nhà khoa học đã tính rằng vào cuối thế kỷ này dân số thế giới sẽ tăng gấp đôi.", "eng": "Scientists have calculated that the world's population will double by the end of the century."}, {"viet": "Chúng ta bắt đầu được chứ, thưa quý vị?", "eng": "Shall we begin, ladies and gentlemen?"}, {"viet": "Cô ấy đã phát hai quả thật hiểm hóc không đỡ nổi trong ván này.", "eng": "She's already served two aces this game."}, {"viet": "Cô ấy là diễn viên tuyệt nhất mà tôi từng thấy.", "eng": "She's far and away the best actress I've seen."}, {"viet": "Cô ta chẳng bao giờ hoà thuận với em của cô ta.", "eng": "She's never really got on with her sister."}, {"viet": "Nàng là con của một nhà khoa học và một nhạc sĩ.", "eng": "She's the offspring of a scientist and a musician."}, {"viet": "Cô ấy luôn luôn giữ một vài miếng ngon để cho con mèo của cô.", "eng": "She always keeps some titbits to give to her cat."}, {"viet": "Cô ta được hưởng thừa kế một gia tài khi ông chú mất.", "eng": "She came into a fortune when her uncle died."}, {"viet": "Nàng không thể hiểu nổi sự thù ghét của anh nàng đối với Bill.", "eng": "She could not understand the animosity felt towards Bill by her older brother."}, {"viet": "Cô ta không có ý định xúc phạm anh, chẳng qua cô ta quá nóng nảy.", "eng": "She didn't mean to offend you, she was overwrought."}, {"viet": "Bà ấy phải đương đầu với hàng đống câu hỏi với những lời phàn nàn.", "eng": "She faced a barrage of queries and complaints."}, {"viet": "Cô ta đẩy mạnh và cửa mở.", "eng": "She gave a hard push, and the door opened."}, {"viet": "Bà ta bị một vết tím bầm rất rõ trên cánh tay.", "eng": "She had a dilly of a bruise on her arm."}, {"viet": "Cô ấy có một vẻ bất mãn, dường như không bao giờ được hưởng đời.", "eng": "She has a discontented look, as if she never enjoys life."}, {"viet": "Cô ta đã nghiên cứu các nền văn hoá của những nước phương Đông.", "eng": "She has studied the cultures of Oriental countries."}, {"viet": "Cô ấy lúc nào cũng vui vẻ cả.", "eng": "She is always in a good mood."}, {"viet": "Cô ấy không biết gì về đất nước của cô ấy cả.", "eng": "She is very ignorant about her own country."}, {"viet": "Cô ấy nán lại vài phút để nói chuyện với Nick.", "eng": "She lingered for a few minutes to talk to Nick."}, {"viet": "Chị ta đã không ngần ngại nói với chồng rằng chị muốn ly hôn.", "eng": "She made no bones about telling her husband she wanted a divorce."}, {"viet": "Cô ấy thường nhớ lại những ngày hạnh phúc thời niên thiếu.", "eng": "She often recalled the halcyon days of her youth."}, {"viet": "Bà ta đều đặn đưa ra những tác phẩm kiếm cơm trong lúc vẫn tiếp tục trau chuốt kiệt tác của bà.", "eng": "She produced regular pot-boilers while also working on her masterpiece."}, {"viet": "Bà ấy từ chức giám đốc và rời bỏ công ty.", "eng": "She resigned her directorship and left the firm."}, {"viet": "Cô ấy hưởng những nét đẹp của cha mình.", "eng": "She's got her father's good look."}, {"viet": "Về yêu cầu của anh, cô ấy chẳng nói gì cả.", "eng": "She said nothing regarding your request."}, {"viet": "Cô ấy đặt sách sang một bên và châm một điếu thuốc.", "eng": "She set aside her book and lit a cigarette."}, {"viet": "Bà ta xin tị nạn chính trị tại Anh.", "eng": "She sought political asylum in Britain."}, {"viet": "Cô ấy kiếm thêm, tiêu vặt bằng cách làm việc ngày thứ bảy.", "eng": "She supplements her pocket-money by working on Saturdays."}, {"viet": "Cô ấy lấy bức thư ra khỏi phong bì và mở nó một cách cẩn thận.", "eng": "She took the letter out of the envelope and unfolded it carefully."}, {"viet": "Cô ta lại gần bàn làm việc và yêu cầu cho gặp giám đốc.", "eng": "She walked up to the desk and asked to see the manager."}, {"viet": "Cô ta bị bắt vì bán lậu hê-rô-in.", "eng": "She was arrested for pushing heroin."}, {"viet": "Cô ta đầy tham vọng thành đạt trong cuộc sống.", "eng": "She was filled with the aspiration to succeed in life."}, {"viet": "Cô ta sợ hãi nhiều hơn là đau đớn.", "eng": "She was more frightened than hurt."}, {"viet": "Cô ta thất vọng tới nỗi muốn tự tử.", "eng": "She was so depressed that she felt like doing herself in."}, {"viet": "Cô ta cảnh giác mọi dấu hiệu hoạt động trong ngôi nhà trống.", "eng": "She was watchful for any signs of activity in the empty house."}, {"viet": "Cô ta sẽ bị xử trước toà án công luận.", "eng": "She will be judged at the bar of public opinion."}, {"viet": "Lẽ ra cô ta đã trở thành một giáo viên xuất sắc.", "eng": "She would have made an excellent teacher."}, {"viet": "Tỏ mối quan tâm không lành mạnh về sự giết người.", "eng": "Show an unhealthy interest in about murder."}, {"viet": "Từ khi gặp anh lần cuối tôi vẫn ốm.", "eng": "Since last seeing you, I have been ill."}, {"viet": "Giấc ngủ thì cần thiết cho sức khỏe của mình.", "eng": "Sleep is necessary for one's health."}, {"viet": "Ngáy khò khò với cái miệng há hốc của anh ta.", "eng": "Snoring noisily with his mouth open."}, {"viet": "Xã hội vẫn còn áp dụng cách đối xử trọng nam khinh nữ.", "eng": "Society still discriminates in favour of men."}, {"viet": "Vài lời nhận xét mở đầu của ông chủ tịch.", "eng": "Some introductory remarks by the chairman."}, {"viet": "Lý do giả dối để biện minh cho sự chậm trễ.", "eng": "Some phoney excuse for the delay."}, {"viet": "Cuộc trình diễn có cái gì đó hết sức không ổn.", "eng": "Something has gone seriously askew with the show."}, {"viet": "Hãy nói về chính bản thân bạn, tôi nghĩ rằng tôi chơi khá hay.", "eng": "Speak for yourself, I think I quite well."}, {"viet": "Các ngôi sao lấp lánh trên bầu trời đầy sương.", "eng": "Stars glittering in the frosty sky."}, {"viet": "Đừng lề mề nữa và nhanh lên nào: chúng ta trễ rồi đó.", "eng": "Stop dawdling and hurry up: we're late."}, {"viet": "Những ngọn gió ngược mạnh khiến cho các con thuyền khó rời cảng.", "eng": "Strong cross breezes make it difficult for boasts to leave harbour."}, {"viet": "Thông tin như vậy đúng là cái họ cần.", "eng": "Such information was just what they needed."}, {"viet": "Được, nhưng tôi không biết nhiều người trong số họ.", "eng": "Sure, but I don't know many of them."}, {"viet": "Hãy lấy tất cả nếu ông muốn.", "eng": "Take all the lot if you want."}, {"viet": "Những chiếc taxi chạy từ từ lòng vòng, hy vọng kiếm được những người khách về muộn.", "eng": "Taxis cruised about, hoping to pick up late fares."}, {"viet": "Sự căng thẳng tăng lên khi cuộc khủng hoảng tiến đến gần.", "eng": "Tension built up as the crisis approached."}, {"viet": "Đó là lời khuyên tuyệt vời, tôi giới thiệu nó với anh.", "eng": "That's excellent advice, I commend it to you."}, {"viet": "Đồng hồ đó chậm năm phút.", "eng": "That clock is five minutes slow."}, {"viet": "Với công việc đó khó có hy vọng được thăng chức vào cuối năm.", "eng": "That job dead-ends at the end of the year."}, {"viet": "Nhà hàng ấy khá là tuyệt diệu.", "eng": "That restaurant is a little gem."}, {"viet": "Những người huấn luyện đó biết cách huấn luyện các con ngựa của mình cho có kết quả.", "eng": "That trainer knows how to get results from his horses."}, {"viet": "Đặc điểm giọng văn của anh ta mang tính hài hước.", "eng": "The accent of humour characterizes his writings."}, {"viet": "Người nữ diễn viên thường quên lời thoại của mình nhưng rất tài nói cương.", "eng": "The actress often forget her lines but very good at ad libbing."}, {"viet": "Vị đại sứ đưa ra những lời kháng nghị mạnh mẽ với Nhà Trắng.", "eng": "The ambassador made forceful representations to the White House."}, {"viet": "Những cây táo bị thui chột vì sương giá.", "eng": "The apple trees were blighted by frost."}, {"viet": "Bài báo đó là một mưu toan bôi nhọ một con người chân chính.", "eng": "The article is an attempt to defame on honest man."}, {"viet": "Tác giả giấu tên của bài báo hóa ra là một ông Stanley Carter nào đó.", "eng": "The author of the anonymous article turned out to be one Stanley Carter."}, {"viet": "Những người bị thương nặng được ưu tiên về chăm sóc y tế hơn những người chỉ bị thương nhẹ.", "eng": "The badly wounded take have priority for medical attention to those only slightly hurt."}, {"viet": "Vị luật sư trình bày trước tòa rằng bị cáo đó bất ổn định về mặt tâm thần.", "eng": "The barrister represented to the court that the defendant was mentally unstable."}, {"viet": "Loại rượu Trung Quốc ngon nhất là Mao Đài, nó đặc biệt được dung trong các buổi tiệc quốc gia.", "eng": "The best Chinese liquor is Maotai, which is special for national banquets."}, {"viet": "Nơi tồi tàn thuộc các khu ổ chuột của khu nội thành.", "eng": "The blight of inner-city slums."}, {"viet": "Quyển sách đó mô tả một hình ảnh sinh động về cuộc sống hàng ngày ở La Mã cổ.", "eng": "The book gives a good picture of everyday life in ancient Rome."}, {"viet": "Người võ sĩ quyền anh gập người lại vì đau đớn.", "eng": "The boxer folded up in agony."}, {"viet": "Những viên gạch dần dần vỡ vụn ra trong mùa lạnh giá kéo dài.", "eng": "The bricks slowly crumbled in the long frost."}, {"viet": "Tên trộm bị tống vào nhà giam địa phương.", "eng": "The burglar was taken to the local nick."}, {"viet": "Các ứng cử viên phải trình bày quan điểm của họ về việc đơn phương giải trừ quân bị.", "eng": "The candidates had to state their position on unilateral disarmament."}, {"viet": "Chiếc xe ôtô lao ra khỏi một con đường rồi lăn xuống một cái mương.", "eng": "The car ran off the road into a ditch."}, {"viet": "Lâu đài này có một vị trí bao quát trên một ngọn đồi dốc.", "eng": "The castle has a commanding position on a steep hill."}, {"viet": "Ông chủ toạ cố gắng làm cho thính giả giữ trật tự.", "eng": "The chairman tried to settle the audience down."}, {"viet": "Đứa trẻ bị phỏng ngón tay trong lúc nghịch diêm.", "eng": "The child burnt his fingers while playing with a match."}, {"viet": "Tranh của trẻ em được dán trên tường.", "eng": "The children's pictures were displayed on the wall."}, {"viet": "Bọn trẻ thật sự thích pháo hoa.", "eng": "The children really like the fireworks."}, {"viet": "Khu Cơ Đốc giáo ở thành phố.", "eng": "The Christian sector of the city."}, {"viet": "Đỉnh cao của sự nghiệp chính trị của ông ta.", "eng": "The climax of his political career."}, {"viet": "Thời tiết lạnh làm họ rời khỏi nước sớm.", "eng": "The cold weather antedated their departure from the country."}, {"viet": "Ủy ban đó đã đề nghị nên soạn thảo bộ luật mới.", "eng": "The committee proposed that new legislation should be drafted."}, {"viet": "Công ty dự tính chuyển vào thành phố Hồ Chí Minh.", "eng": "The company plans to relocate to Ho chi minh city."}, {"viet": "Những phụ âm t, s và f đều vô thanh.", "eng": "The consonants t, s and f are voiceless."}, {"viet": "Phí tổn đã được khấu trừ vào tiền lương của tôi.", "eng": "The cost was stopped out of my wages."}, {"viet": "Khóa học đó nhắm đối tượng là các sinh viên nước ngoài.", "eng": "The course was orientated towards foreign students."}, {"viet": "Những tên lừa đảo đã cao chạy xa bay cuỗm đi gần hết số tiền.", "eng": "The crooks got away with most of the money."}, {"viet": "Mở màn ra để lộ một sân khấu trống không.", "eng": "The curtain opened, disclosing an empty stage."}, {"viet": "Việc thương lượng sẽ được hoàn tất vào ngày mai.", "eng": "The deal should be buttoned up by tomorrow."}, {"viet": "Các người biểu tình phất những biểu ngữ và áp phích với những người qua đường.", "eng": "The demonstrators were waving banners and placards at passers-by."}, {"viet": "Những khó khăn đã không thể dự đoán trước được.", "eng": "The difficulties could not have been foreseen."}, {"viet": "Sự phân li giữa quyền và ý thức hệ.", "eng": "The divorce between power and ideology."}, {"viet": "Các bác sĩ sẽ mổ nếu cần nhưng có lẽ chưa đến nỗi phải thế.", "eng": "The doctors will operate if it proves necessary-but it may not come to that."}, {"viet": "Đồng đô la đã suy yếu trong trao đổi tiền tệ quốc tế.", "eng": "The dollar has weaken in international currency trading."}, {"viet": "Dùng ma tuý rất phổ biến ở một số nhóm sinh viên.", "eng": "The drug use was rife among certain groups of students."}, {"viet": "Các nhà trí thức cấp cao ở trường đại học không biết gì về kinh doanh.", "eng": "The eggheads at the university know nothing about business."}, {"viet": "Động cơ này có một xy-lanh trục trặc nặng.", "eng": "The engine is misfiring badly on one cylinder."}, {"viet": "Các biến cố đã in sâu vào trí nhớ của cô ta.", "eng": "The events printed themselves on her memory."}, {"viet": "Vẻ mặt của cô ấy là một sự thú tội hoàn toàn.", "eng": "The expression on her face was a dead give-away."}, {"viet": "Nông trại đó luôn trong tình trạng bị trưng dụng làm căn cứ cho toán cấp cứu.", "eng": "The farm was in constant requisition as a base for the rescue team."}, {"viet": "Hồ sơ đã bị khoá, tôi không thể nào lấy được.", "eng": "The files are locked up and I can't get at them."}, {"viet": "Ngọn lửa cháy bùng lên khi tôi cho thêm mấy khúc gỗ vào.", "eng": "The fire flared up as I put more logs on it."}, {"viet": "Những đập nước đầu tiên do con người xây dựng được làm bằng đất.", "eng": "The first dams men built were made of earth."}, {"viet": "Sàn nhà gần bếp rất nhớp nháp.", "eng": "The floor's very sticky near the cooker."}, {"viet": "Các cuộc hội đàm sắp tới đưa ra hy vọng về việc cắt giảm vũ khí thực sự.", "eng": "The forthcoming talks hold out the hope of real arms reductions."}, {"viet": "Tương lai là một củ cà rốt cắm trên một chiếc gậy, nó luôn luôn ngoài tầm nắm giữ của ta.", "eng": "The future is a carrot on a stick, always just beyond your grasp."}, {"viet": "Viên tướng từ chối không chịu rút quân.", "eng": "The general refused to withdraw his troops."}, {"viet": "Quy tắc quan trọng phải tuân thủ khi chơi tennit là theo dõi sát quả bóng.", "eng": "The golden rule in playing tennis is to watch the ball closely."}, {"viet": "Chính phủ đã làm dịu bớt vấn đề tiền lương giáo viên.", "eng": "The government has been soft-pedaling the question of teachers'pay."}, {"viet": "Chính Phủ nói là họ đã giảm thuế cá nhân nhưng tôi sẽ còn phải tranh luận về lời tuyên bố này.", "eng": "The government says they have reduced personal taxation, but I would dispute this claim."}, {"viet": "Lợi ích lớn của việc cắm trại là rẻ tiền.", "eng": "The great virtue of camping is its cheapness."}, {"viet": "Người khách trọ muốn yêu cầu mang một bữa ăn nhẹ đến phòng của ông ấy.", "eng": "The guest wants to have a snack sent to his room."}, {"viet": "Tim là một cơ quan rất dễ co lại.", "eng": "The heart is a highly contractile organ."}, {"viet": "Xe cộ lưu thông vào ngày nghỉ làm tắc nghẽn các con đường.", "eng": "The holiday traffic is jamming the road."}, {"viet": "Khách sạn trông có vẻ không ngăn nắp vì thế chúng tôi quyết định không ở đó.", "eng": "The hotel looked rather scruffy so we decided not to stay there."}, {"viet": "Ngôi nhà ở những vị trí thuận lợi tiện cho việc mua sắm và phương tiện giao thông.", "eng": "The house well situated in reach of good shopping and transport facilities."}, {"viet": "Sự tác động của kỹ thuật mới đến nền công nghiệp hiện đại.", "eng": "The impact of new technology on modern industry."}, {"viet": "Vết thương trên lưng cô ta sẽ làm cô ta không đi lại được trong vài tuần lễ.", "eng": "The injury to her back will put her out of action for several weeks."}, {"viet": "Sự xông vào của một nhóm ăn chơi ồn ào.", "eng": "The irruption of a noisy group of revellers."}, {"viet": "Quan toà ra lệnh tù nhân phải được trả lại trại giam để điều tra thêm.", "eng": "The judge ordered that the prisoner should be remanded."}, {"viet": "Nhà bếp là lãnh địa của vợ của tôi, cô ấy không muốn tôi bước vào.", "eng": "The kitchen is my wife's domain, she doesn't like me going in."}, {"viet": "Nỗ lực nhằm đạt kỷ lục thế giới về tốc độ trên đường bộ được thực hiện gần đây nhất.", "eng": "The latest attempt on the world land speed record."}, {"viet": "Gờ nhô ra vài bộ Anh.", "eng": "The ledge overhangs by several feet."}, {"viet": "Đường kẻ bị vẽ lệch hẳn.", "eng": "The line is drawn all askew."}, {"viet": "Chiếc xe tải chạm phải hàng rào, xước một bên xe.", "eng": "The lorry shaved the barrier, scraping its side."}, {"viet": "Những diễn biến chính là như sau: trước tiên là bài phát biểu của chủ tịch, thứ hai là bài đáp của thư ký và thứ ba là tổng kết của chủ toạ.", "eng": "The main events were as follows: first, the president's speech, secondly the secretary's reply and thirdly, the chairman's summing-up."}, {"viet": "Người chạy maratông bắt đầu yếu đi ở cuối cuộc đua.", "eng": "The marathon runner began to falter at the end of the race."}, {"viet": "Quy trình dàn cảnh một vở kịch rất là phức tạp.", "eng": "The mechanics of staging a play are very complicated."}, {"viet": "Phương pháp xác định niên đại của đá, hoá thạch, dụng cụ, tranh.", "eng": "The method of dating rocks, fossils, tools, paintings."}, {"viet": "Hỗn hợp này, được đốt nóng, rất nóng.", "eng": "The mixture is heated very, very hot."}, {"viet": "Giải pháp hợp lý nhất cho vụ tranh chấp.", "eng": "The most equitable solution to the dispute."}, {"viet": "Viện bảo tàng đó có một số bức tranh tiêu biểu cho lối vẽ ban đầu của nhà hội họa.", "eng": "The museum had several paintings representing the artist's early style."}, {"viet": "Chiếc máy bay mới trải qua những cuộc thử nghiệm kĩ càng.", "eng": "The new aircraft underwent intensive tests."}, {"viet": "Mô hình mới là một bằng chứng về tài năng và sự tận tuỵ của toàn thể công nhân nhà máy.", "eng": "The new model is a testament to the skill and dedication of the work-force."}, {"viet": "Bản tin kéo dài nửa giờ.", "eng": "The news lasts half an hour."}, {"viet": "Tiếng động to đến mức cô ấy phải nút mấy miếng bông gòn vào lỗ tai.", "eng": "The noise was so loud that she put wads of cotton wool in her ears."}, {"viet": "Cô y tá đến thăm các bệnh nhân tận nhà.", "eng": "The nurse visited patients in their home."}, {"viet": "Chiếc xe buýt cũ kỹ chạy lọc xọc dọc theo con đường lổn nhổn đá.", "eng": "The old bus rattled along the stony road."}, {"viet": "Manh mối duy nhất để nhận ra kẻ sát nhân là một điếu thuốc hút dở.", "eng": "The only clue to the identity of the murderer was a half-smoked cigarette."}, {"viet": "Toán canh phòng nơi xa xôi được trang bị máy định vị bằng sóng âm có nhiệm vụ phát hiện, khoanh vùng và giao chiến với bất cứ tàu ngầm nào nhăm nhe ngăn chặn tàu.", "eng": "The outlying sonar picket was to detect, localize, and engage any submarine trying to close the convoy."}, {"viet": "Bãi để xe khá rộng nhưng không có nhiều chỗ xoay chuyển.", "eng": "The parking space was big enough, but there wasn't much leeway."}, {"viet": "Bệnh nhân được chuyển đến phòng phẫu thuật.", "eng": "The patient is on his way to the theater."}, {"viet": "Cuộc biểu diễn cũng được nhưng không đặc sắc lắm.", "eng": "The performance was just all right not remarkable."}, {"viet": "Những bức hình vẽ cho chúng ta biết chút ít về việc cơ thể chúng ta được cấu tạo như thế nào.", "eng": "The pictures tell a little bit of the story of how our bodies are built."}, {"viet": "Máy bay đâm vào sườn đồi và cháy bùng.", "eng": "The plane crashed into the hillside and burst into flames."}, {"viet": "Vở kịch thành công do bởi sự diễn xuất tuyệt vời của tất cả diễn viên.", "eng": "The play succeeded thanks to fine acting by all the cast."}, {"viet": "Cảnh sát nhắc nhở những người lái xe về những chậm trễ có thể có.", "eng": "The police are warning motorists of possible delays."}, {"viet": "Cảnh sát chỉ thu hồi được một phần của số tiền bị đánh cắp.", "eng": "The police only recovered part of the stolen money."}, {"viet": "Hệ thống chính trị này sẽ tồn tại lâu hơn hầu hết chúng ta.", "eng": "The political system will outlast most of us."}, {"viet": "Phòng kiểm soát nhà máy phát điện.", "eng": "The power-station's control room."}, {"viet": "Vị tổng thống phải tuyên thệ công khai.", "eng": "The President has to be sworn publicly."}, {"viet": "Linh mục cử hành hai Thánh lễ mỗi ngày.", "eng": "The priest says two Masses each day."}, {"viet": "Những tù nhân cố vượt ngục nhưng thất bại.", "eng": "The prisoners attempted to escape, but failed."}, {"viet": "Dự án đã bị huỷ bỏ khi còn trong thời kỳ trứng nước.", "eng": "The project was cancelled while it was still in its infancy."}, {"viet": "Nhịp đập có thể cảm thấy trong cổ tay của người ta.", "eng": "The pulse can be felt in a person's wrists."}, {"viet": "Vấn đề nhóm thiểu số thuộc về tiểu bang nào sẽ quyết định bởi một cuộc trưng cầu dân ý.", "eng": "The question of which state the minority group should belong to was decided by a plebiscite."}, {"viet": "Người đọc cuốn phần đã đọc bằng một tay và mở phần mới bằng tay kia.", "eng": "The reader rolled up the part he had read with one hand while he unrolled new pages with the other."}, {"viet": "Những điểm tốt tương đối của hai ứng viên.", "eng": "The relative merits of the two candidates."}, {"viet": "Khách sạn chật ních người.", "eng": "The restaurant was crammed."}, {"viet": "Tình hình gia tăng tội phạm là một lý do để lên án xã hội của chúng ta và các giá trị của nó.", "eng": "The rise in delinquency is an indictment of our society and its values."}, {"viet": "Vụ trộm đó có vẻ là một vụ trộm nội bộ.", "eng": "The robbery appeared to have been an inside job."}, {"viet": "Tấm chắn bằng cao su bao quanh đáy chiếc xuồng bay.", "eng": "The rubber skirt round the bottom of a hovercraft."}, {"viet": "Vẫn những tư tưởng cũ rích ấy được trình bày như thể là những tư tưởng mới.", "eng": "The same musty old ideas presented as if they were new."}, {"viet": "Sự tiếp cận của khoa học với đời sống không thực sự thích hợp với những trạng thái đau khổ sâu xa.", "eng": "The scientific approach to life is not really appropriate to states of visceral anguish."}, {"viet": "Cảm giác khoái cảm của nhung mềm chạm vào da thịt.", "eng": "The sensuous feeling of soft velvet on the skin."}, {"viet": "Mũi tàu rẽ xuyên qua sóng.", "eng": "The ship's bows cleaved through the waves."}, {"viet": "Cửa hàng mở cửa hàng ngày trừ chủ nhật.", "eng": "The shop is open everyday, excluding sundays."}, {"viet": "Cô ca sĩ đến thăm trường chúng tôi để nói chuyện về âm nhạc.", "eng": "The singer came to our school to give a talk on music."}, {"viet": "Mùi chất nổ đọng lại trong không gian buổi chiều.", "eng": "The smell of the explosion hung in the afternoon air."}, {"viet": "Tính chất trọng đại của dịp đó, thời điểm, đám rước.", "eng": "The solemnity of the occasion, moment, procession."}, {"viet": "Cái giáo lao theo một đường cong trên không.", "eng": "The spear curved through the air."}, {"viet": "Bảo rằng anh ta có thể ăn năm mươi quả trứng rõ ràng là lời nói phóng đại.", "eng": "The statement that he could eat fifty eggs was definitely an exaggeration."}, {"viet": "Câu chuyện được trình bày nổi bật ngang suốt trang đầu của tờ báo.", "eng": "The story was splashed across the front page of the newspaper."}, {"viet": "Thành công của cuốn tiểu thuyết đầu tay đã hoàn toàn làm anh ta trở nên kiêu ngạo.", "eng": "The success of his first novel completely turned his head."}, {"viet": "Sự đu đưa của quả lắc, sự lúc lắc của cái kim trên mặt cân, sự di động nhịp nhàng của cái kim khâu, v. v.", "eng": "The swing of a pendulum, pointer, needle, etc."}, {"viet": "Thầy giáo cử một người khác dạy thay.", "eng": "The teacher sent another to teach his stead."}, {"viet": "Áo rơ ve hai tay của cầu thủ quần vợt.", "eng": "The tennis player's two-handed backhand."}, {"viet": "Cái ý nghĩ tuần sau tôi đã phải thi làm cho tôi lo lắng.", "eng": "The thought of my exams next week scares me stiff."}, {"viet": "Cuộc đi chơi bao gồm cả việc tham quan Viện bảo tàng Khoa học.", "eng": "The tour included a visit to the Science Museum."}, {"viet": "Sự chuyển tiếp từ thời niên thiếu sang thời trưởng thành.", "eng": "The transition from adolescence to adulthood."}, {"viet": "Hai diễn viên trả lời phỏng vấn ở hậu trường.", "eng": "The two actors gave the reporter a backstage interview."}, {"viet": "Liên Hiệp Quốc là một tổ chức đa văn hoá.", "eng": "The U. N. is a multi-cultural organization."}, {"viet": "Những ăn mừng thường lệ được tổ chức vào năm mới.", "eng": "The usual celebrations were held at New Year time."}, {"viet": "Gánh xiếc đến là một sự hào hứng.", "eng": "The visiting circus was a great excitement."}, {"viet": "Nước hồ chảy ra bên trên một cái thác lớn.", "eng": "The waters of the lake flow out over a large waterfall."}, {"viet": "Toàn thể trường học tập hợp trong hội trường.", "eng": "The whole school was assembled in the main hall."}, {"viet": "Nhân chứng đã được luật sư bào chữa cho đối chứng!", "eng": "The witness was cross-examined by the defending counsel:!"}, {"viet": "Điều tồi tệ nhất là phòng tắm bốc mùi hôi.", "eng": "The worst thing is the bathroom smells."}, {"viet": "Việc họ thay đổi kế hoạch thật lạ lùng nhưng tôi không cho điều đó có ý nghĩa gì.", "eng": "Their change of plan is strange but I don't think it's significant."}, {"viet": "Văn phòng của họ ở trung tâm Luân Đôn, vì vậy tổng chi phí rất cao.", "eng": "Their office is in central London, so their overheads are very high."}, {"viet": "Rồi nó vận chuyển chất thải ra.", "eng": "Then it carries waste material away."}, {"viet": "Leo núi đá rất nguy hiểm.", "eng": "There's a lot of danger in rock climbing."}, {"viet": "Không có gì phải bối rối về chuyện đó, chỉ là một kì thi thôi mà.", "eng": "There's no need to get so het up about it, it's only an examination."}, {"viet": "Liệu có thể lấy được vé cho buổi biểu diễn tối nay không?", "eng": "There any chance of getting tickets for tonight's performance?"}, {"viet": "Không còn tủ gửi hành lí nữa.", "eng": "There are not baggage lockers anymore."}, {"viet": "Có những bức hình rất đẹp về Columbus, George Washington, Napoleon và các danh nhân khác của thời xa xưa.", "eng": "There are wonderful picture of Columbus, George Washington, Napoleon, and other famous men of earlier times."}, {"viet": "Có một hy vọng mong manh là bà ta có thể được chữa khỏi.", "eng": "There is a faint hope that she may be cured."}, {"viet": "Ở Nhật Bản không phân biệt đối xử trong số tiền lương ban đầu.", "eng": "There is no discrimination in beginning salaries in Japan."}, {"viet": "Có thể có đủ tuyết để đi trượt tuyết nhưng tôi chẳng trông mong điều đó.", "eng": "There may be enough snow for skiing, but I wouldn't bank on it."}, {"viet": "Ở dưới cằm nó còn vệt mứt không che giấu vào đâu được.", "eng": "There was a tell-tale spot of jam on his chin."}, {"viet": "Tối qua ở bệnh viện có bốn ca đẻ.", "eng": "There were four births at the hospital last night."}, {"viet": "Những lý lẽ này vô hiệu hoá nhau.", "eng": "These arguments cancel out."}, {"viet": "Những vấn đề này nằm trong phạm vi thụ lí của toà án, thầm quyền.", "eng": "These matters fall within the cognizance of this court."}, {"viet": "Họ xây vườn bằng bê tông.", "eng": "They'd had their garden concreted over."}, {"viet": "Họ mới chuyển từ London về sống ở làng quê.", "eng": "They've recently come down from London to live in the village."}, {"viet": "Bản chất của họ khác nhau mà vì thế không thể so sánh được.", "eng": "They are of different natures and therefore incomparable."}, {"viet": "Người ta kêu gọi những người biểu tình giải tán có trật tự.", "eng": "They called for the peaceful dispersal of the demonstrators."}, {"viet": "Họ thua là đáng, kế hoạch tấn công của họ được hoạch định rất kém.", "eng": "They deserved to lose, their offense was badly planned."}, {"viet": "Họ tuân theo Phật pháp.", "eng": "They follow the teachings of Buddha."}, {"viet": "Người ta cùng nhau ăn tối, ăn món ăn truyền thống-bánh chẻo, đại khái giống như bánh bao và thức khuya xem các chương trình truyền hình đến sáng sớm hôm sau.", "eng": "They have dinner together, eating traditional food-Jiao Zi, something like dumpling and stay up watching TV programs until early the following day."}, {"viet": "Họ sống ở một thôn trang, nơi khỉ ho cò gáy.", "eng": "They live on a farm somewhere in the back of beyond."}, {"viet": "Họ quản lý ba nhà máy và một nhà kho rất lớn.", "eng": "They operate three factories and a huge warehouse."}, {"viet": "Họ vẫn thân mật với nhau sau khi li dị.", "eng": "They remained on amicable terms after the divorce."}, {"viet": "Họ bỏ nhiều thời giờ tranh luận về những bí ẩn của cuộc sống.", "eng": "They spend their time philosophizing about the mysteries of life."}, {"viet": "Họ phải nhớ là họ đang nói với ai chứ!", "eng": "They want to remember who they're speaking to!"}, {"viet": "Họ được phỏng vấn, lưng quay lại camera để giấu tính danh.", "eng": "They were interviewed with their backs to the camera, so as to preserve their anonymity."}, {"viet": "Họ sẽ chọn cái chết hơn cái nhục.", "eng": "They would choose death in preference to dishonour."}, {"viet": "Cuốn sách này lý thuyết quá, tôi cần một cuốn hướng dẫn thực hành.", "eng": "This book is too theoretical, I need a practical guide."}, {"viet": "Sắc lệnh này có quyền lực pháp luật bảo đảm.", "eng": "This decree has the force of law behind it."}, {"viet": "Cái này giúp cho vữa bám vào tường.", "eng": "This helps the plaster to adhere to the wall."}, {"viet": "Đây là công việc của chúng tôi-không ai khiến anh chõ mũi vào!", "eng": "This is our business nobody asked you to stick your oar in!"}, {"viet": "Khúc gỗ này làm bàn ăn cho cuộc pích ních của chúng ta thì thật đẹp.", "eng": "This log will do fine as a table for our picnic."}, {"viet": "Bộ phận này của quá trình lắp ráp nay đã hoàn toàn tự động hoá.", "eng": "This part of the assembly process is now fully automated."}, {"viet": "Món xốt này thường đi cùng với cá.", "eng": "This sauce is often served as an accompaniment to fish."}, {"viet": "Thị xã này là vùng lạnh nhất ở Anh.", "eng": "This town is the coldest place in Britain."}, {"viet": "Những ai chờ đợi cái tệ hại nhất là những người có thể ít bị thất vọng hơn.", "eng": "Those who expect the worst are less likely to be disappointed."}, {"viet": "Ở quán rượu luôn luôn có thẻ mua thuốc lá.", "eng": "Tokens for the cigarette machine are available at the bar."}, {"viet": "Hai đặc điểm trong tính cách Mĩ là lòng hào hào hiệp và nghị lực.", "eng": "Two traits in American character are generosity and energy."}, {"viet": "Chiến tranh không bao giờ xứng đáng với cái giá khủng khiếp về mạng sống của con người.", "eng": "War is never worth the terrible cost in human life."}, {"viet": "Chúng tôi sẽ có thể đến được, nếu chúng tôi trút được gánh nặng lũ trẻ cho bà chị tôi.", "eng": "We'll be able to come if we can off-load the children onto my sister."}, {"viet": "Chúng ta đang nghiên cứu Shakespeare trong văn học Anh.", "eng": "We're doing Shakespeare in English literature."}, {"viet": "Nếu chúng ta ở vào hướng gió thổi bên trên con vật, nó có thể đánh hơi thấy chúng ta.", "eng": "We're upwind of the animal it may smell our scent."}, {"viet": "Chúng tôi đã ngăn đoạn cuối căn bếp làm phòng ăn điểm tâm.", "eng": "We've partitioned off one end of the kitchen to make a breakfast room."}, {"viet": "Chúng tôi là những nhà bán sỉ các mặt hàng da có tầm cỡ và chúng tôi muốn có quan hệ kinh doanh với quý vị.", "eng": "We are big wholesalers of leather products and we would like to enter into business relations with you."}, {"viet": "Chúng tôi đến một cách sang trọng trên một chiếc xe con thuê.", "eng": "We arrived in fine style in a hired limousine."}, {"viet": "Chúng ta có thể vạch ra được rằng, từ derelict có gốc từ tiếng La tinh derilictus.", "eng": "We can derive the word derelict from the Latin derelictus."}, {"viet": "Chúng tôi chỉ có thể nhìn thấy bóng dáng một chiếc máy bay cất cánh trong sương mù.", "eng": "We could just manage to see the form of an aircraft taking off in the fog."}, {"viet": "Chúng ta không có thời gian để xem hết đâu.", "eng": "We don't have time to watch them all."}, {"viet": "Chúng tôi đã tiêu hết cả một đống của cải khi đi nghỉ hè!", "eng": "We got through a fortune while we were on holiday!"}, {"viet": "Chúng tôi có 20 năm kinh nghiệm mua bán, chủ yếu là các mặt hàng đồng hồ điện tử.", "eng": "We have 20 years'experience of dealing, mainly in electronic watches."}, {"viet": "Chúng tôi có vài tập sách hay về New York.", "eng": "We have some interesting brochures about New York."}, {"viet": "Chúng ta biết về các san hô của thời xa xưa bởi vì chúng bỏ lại hàng triệu ngôi nhà đá do chúng xây lên.", "eng": "We know about the corals of long ago because they left behind them millions upon millions of the rock houses they built for themselves."}, {"viet": "Chúng ta có thể còn sống để trông thấy sự tuyệt chủng của cá voi.", "eng": "We may live to see the extinction of the whale."}, {"viet": "Chúng ta phải bày tỏ tình đoàn kết với những người bãi công', những người lãnh đạo sinh viên đã tuyên bố.", "eng": "We must show solidarity with the strikers'declared the student leaders."}, {"viet": "Tôi tỏ lòng kính trọng đối với thiên tài của Shakespeare.", "eng": "We pay homage to the genius of Shakespeare."}, {"viet": "Chúng tôi tìm ở khắp mọi nơi nhưng không thấy nó đâu cả.", "eng": "We searched high and low but we couldn't find it anywhere."}, {"viet": "Ngày nay chúng ta vẫn dùng đất sét để làm ra bát và lọ dùng trong việc nấu nướng và dự trữ thức ăn.", "eng": "We still use clay for making bowls and jars used in cooking and storing food."}, {"viet": "Chúng tôi muốn mời một số bạn, đặc biệt là John và Peter.", "eng": "We want to invite a number of friends, especially John and Peter."}, {"viet": "Chúng tôi đã thua và bị đánh bại suốt chiến dịch mùa đông.", "eng": "We were outmanoeuvered and outfought throughout the winter campaign."}, {"viet": "Chúng tôi sẽ rất vui nếu được các ông gia hạn thanh toán thêm một tuần.", "eng": "We would be glad if you could grant us a week's extension on payment."}, {"viet": "À, tôi tính phải chi cho việc này khoảng 10 $, còn phải tìm hàng giờ ở cửa hàng bán quà tặng nữa.", "eng": "Well, I figured on spending $ 10 to $ 20 on this, and for hours in gift shops."}, {"viet": "À, nếu không phải là vậy thì làm sao con ra đời được.", "eng": "Well, without it there wouldn't have been any you."}, {"viet": "Chỗ này có cảnh quang thật đẹp!", "eng": "What a beautiful scenery it has here!"}, {"viet": "Bạn có những triệu chứng căng thẳng nào?", "eng": "What are your symptoms of stress?"}, {"viet": "Bạn thường làm gì vào ngày Tết?", "eng": "What do you usually do on New Year's Day?"}, {"viet": "Tuổi thọ trung bình ở nước bạn là bao nhiêu?", "eng": "What is the average life expectancy in your country?"}, {"viet": "Bạn có ý kiến gì về những người nước ngoài sinh sống không hợp pháp ở Nhật Bản?", "eng": "What is your opinion of illegal aliens in Japan?"}, {"viet": "CÓ GÌ THÚ VỊ VỀ LAS VEGAS?", "eng": "What's so interesting about Las Vegas?"}, {"viet": "Đồ chơi thời thơ ấu bạn yêu thích là gì?", "eng": "What was your favorite childhood toy?"}, {"viet": "Bao giờ thì kế hoạch này đi vào thực hiện?", "eng": "When does the plan come into operation?"}, {"viet": "Khi tôi còn bé, chúng tôi chỉ gặp những người thợ săn và những người đánh cá.", "eng": "When I was young, we had only hunters and fishermen."}, {"viet": "Khi cảnh sát tìm thấy dấu tay của hắn thì hắn biết là hắn tong rồi.", "eng": "When the police found his fingerprints he knew his goose was cooked."}, {"viet": "Đến ngã ba đường, anh hãy rẽ sang phải.", "eng": "When you get to fork in the road, bear right."}, {"viet": "Ở nước bạn, nơi trượt tuyết lớn nhất là ở đâu?", "eng": "Where is the best place for skiing in your country?"}, {"viet": "Con đường thẳng nhất tới nhà ga là đường nào?", "eng": "Which is the most direct way to the station?"}, {"viet": "Ai sẽ thanh toán hoá đơn của mọi chỗ sửa chữa đó?", "eng": "Who's going to foot the bill for all the repairs?"}, {"viet": "Bạn không muốn bị kẹt trên đảo hoang với ai?", "eng": "Who would you least want to be stranded with on a desert island?"}, {"viet": "Sao bạn không cố bỏ hút thuốc đi?", "eng": "Why don't you try and give it up?"}, {"viet": "Anh có thể gửi hóa đơn sau được không?", "eng": "Will you bill me for them later?"}, {"viet": "Tôi ước mong được là người tự do, nhưng hợp đồng còn trói buộc tôi thêm ba năm nữa.", "eng": "Wish I were a free agent, but my contract binds me for three more years."}, {"viet": "Giới phụ nữ vẫn tiếp tục đấu tranh cho sự bình đẳng thật sự với nam giới.", "eng": "Women are still struggling of true equality with men."}, {"viet": "Cô gọi điện đánh thức chúng tôi dậy lúc 6 giờ 45 sáng mai được không?", "eng": "Would you give us a wake-up call at 6: 45 tomorrow morning?"}, {"viet": "Ông có muốn ngồi ở bàn thường khi ông ngồi không?", "eng": "Would you like your usual table?"}, {"viet": "Anh hãy ghi vào tờ khai là anh đã ở bao nhiêu đêm với giá bao nhiêu tiền một đêm.", "eng": "Write on the form that you stayed so many nights at so much per night."}, {"viet": "Dạ có, tôi đã làm việc 2 năm ở một công ty tư vấn kỹ thuật.", "eng": "Yes, I worked for two years at an engineering consulting firm."}, {"viet": "BẠN SẼ LÀ MỘT GIÁO VIÊN GIỎI.", "eng": "YOU'D MAKE A GOOD TEACHER."}, {"viet": "Nhìn thấy cô thật là vui-tôi tưởng cô đã đi hẳn rồi!", "eng": "You're a sight for sore eyes-I thought you'd gone for good!"}, {"viet": "Anh mặc chiếc áo vệ sinh bị lộn trái rồi.", "eng": "You've got your sweater on wrong side out."}, {"viet": "Anh không thể làm điều đó mà không nói gì với nó, như vậy là không ngay thẳng.", "eng": "You can't do it without telling him, it just isn't cricket."}, {"viet": "Anh có thể viết thư hoặc gọi điện để xin một bản.", "eng": "You can either write or phone to request a copy."}, {"viet": "Anh có thể cho bốn đứa trẻ nữa vào lớp anh.", "eng": "You could accommodate another four children in your class."}, {"viet": "Anh sẽ có lợi khi Tom xin từ chức, thí dụ vì anh có thể thay chân anh ta.", "eng": "You have a vested interest in Tim's resignation."}, {"viet": "Anh biết đấy, vợ tôi lúc nào cũng nhét cho tôi thật nhiều thứ khi tôi đi du lịch.", "eng": "You know my wife always packs in a lot of things for me when I travel."}, {"viet": "Anh mệt lử rồi thì phải-Không hẳn thế đâu.", "eng": "You must be exhausted-That's an understatement."}, {"viet": "Anh cần có trí tuệ mới trở thành giáo sư đại học được.", "eng": "You need brains to become a university professor."}, {"viet": "Anh nên bắt chước điểm mạnh của anh ta chứ không phải điểm yếu.", "eng": "You should copy his good points not his weak points."}, {"viet": "Chắc chắn các bạn đang sống xa hoa, phải vậy không?", "eng": "You sure are living in style, aren't you?"}, {"viet": "Chẳng mấy chốc bạn sẽ hoàn toàn quen thuộc với các thủ tục.", "eng": "You will soon become fully acquainted with the procedures."}, {"viet": "Động cơ của anh sẽ bị kẹt nếu anh không tra thêm ít dầu vào.", "eng": "Your engine will seize up if you don't put some more oil in."}, {"viet": "Buổi nói chuyện của ông đã cho tôi một ý tưởng chung về những ngân hàng chuyên ngành của các ông.", "eng": "Your talk gave me a general idea of your specialized banks."}]