[{"viet": "10 bảng Anh là đủ tiền xăng cho cuộc hành trình của chúng tôi.", "eng": "£ 10 will cover our petrol for the journey."}, {"viet": "Ông chủ phải biết phân công.", "eng": "A boss must know how to delegate."}, {"viet": "Một danh sách xếp theo thứ tự thời gian các kịch tác của Shakespeare.", "eng": "A chronological list of Shakespeare's plays."}, {"viet": "Ông nhận được một bản in vào ngày ông mất.", "eng": "A copy of it reached him on the day he died."}, {"viet": "Văn bằng là cần trước hết cho công việc ở trình độ này.", "eng": "A degree is prerequisite for employment at this level."}, {"viet": "Một loại thuốc có thể được tiêm hoặc uống.", "eng": "A drug that can be injected or taken by mouth."}, {"viet": "Một loại chất nhựa được dùng làm đĩa.", "eng": "A find of plastic stuff is used to make the plates."}, {"viet": "Giọng nói như ma quỷ thì thầm bên tai của ai.", "eng": "A ghostly voice whispering in somebody's ear."}, {"viet": "Một mối bất hòa gia tăng giữa hai phái.", "eng": "A growing rift between the two factions."}, {"viet": "Một kỳ nghỉ có thể làm nàng nguôi ngoai nỗi niềm tâm sự của chính cô ta.", "eng": "A holiday would help to take her out of herself."}, {"viet": "Một cái hồ có dòng nước ngọt chảy vào.", "eng": "A lake fed by a freshwater inflow."}, {"viet": "Phải có một giới hạn nào đó.", "eng": "A line has to be drawn somewhere."}, {"viet": "Một bước quan trọng trong nỗ lực lớn lao chống lại bệnh ung thư.", "eng": "A major step in the war against cancer."}, {"viet": "Một làn bụi nước hoa lửng lơ trong không khí.", "eng": "A mist of perfume hung in the air."}, {"viet": "Một đôi ủng cao su mới màu xanh.", "eng": "A new pair of green wellies."}, {"viet": "Một hàng nhân chứng xuất hiện ở tòa án.", "eng": "A parade of witnesses speared in court."}, {"viet": "Một bức tranh chứng tỏ nét vẽ vững vàng của người họa sĩ.", "eng": "A picture that shows the artist's sureness of touch."}, {"viet": "Một thiết bị có ích với nhiều công dụng khác nhau.", "eng": "A practical device with many different uses."}, {"viet": "Một bài tường thuật sống động về các cuộc mạo hiểm của anh ta.", "eng": "A racy account of his adventures."}, {"viet": "Con sông đầy cứng những khúc gỗ.", "eng": "A river jammed up with logs."}, {"viet": "Một số sôcôla sữa và sôcôla nguyên chất được chọn lựa.", "eng": "A selection of milk and plain chocolates."}, {"viet": "Một buổi ca hát tập thể quanh lửa trại.", "eng": "A singsong round the camp-fire."}, {"viet": "Sự tràn ngập bệnh cúm trong mùa đông.", "eng": "A spate of influenza in the winter."}, {"viet": "Một cơn gió mạnh nổi lên thổi băng con thuyền của chúng tôi vào các tảng đá.", "eng": "A strong wind arose and blew our boat on to the rocks."}, {"viet": "Một sự im lặng căng thẳng đã ngự trị trên đám đông đang chờ đợi.", "eng": "A tense silence had settled over the waiting crowd."}, {"viet": "Một cách sống điển hình kiểu Anh.", "eng": "A typically British style of living."}, {"viet": "Cả một trung đoàn thiết giáp đã hoàn toàn bị các cuộc không kích của quân địch chặn đứng.", "eng": "A whole tank regiment was completely immobilized by enemy air attacks."}, {"viet": "Đã nhận hối lộ để ấn định kết quả của cuộc đua.", "eng": "Accepted some grease to fix the outcome of the race."}, {"viet": "Khâm phục nghệ thuật sử dụng màu sắc của họa sĩ.", "eng": "Admire the artistry of the painter's use of colour."}, {"viet": "Sau năm phút họ đã nói chuyện không ngớt như là những người bạn cũ.", "eng": "After five minutes they were talking away like old friends."}, {"viet": "Sau mười năm bị cầm tù, hắn lại là một người tự do.", "eng": "After ten years in prison, he was a free man again."}, {"viet": "Ha, ha! Vậy ra đó là chỗ cô ta giấu tiền.", "eng": "Aha, so that's where she hides her money!"}, {"viet": "Tất cả sự chống đối đều bị chế độ đó đàn áp tàn nhẫn.", "eng": "All opposition is brutally repressed by the regime."}, {"viet": "Tất cả các tên họ trong danh sách này được đánh dấu đặc biệt để máy vi tính có thể in ra dễ dàng.", "eng": "All the surnames in the list have been specially flagged so that the computer can print them out easily."}, {"viet": "Hãy luôn luôn ủng hộ cho bạn bè của mình.", "eng": "Always stand up for your friends."}, {"viet": "Một tập đoàn Mỹ có một cổ phần quan trọng trong công ty đó.", "eng": "An American conglomerate holds a major share in the company."}, {"viet": "Một lỗi sửa chữa được dễ dàng.", "eng": "An error that is easily rectifiable."}, {"viet": "Một người đàn ông nhỏ con trông có vẻ tầm thường đó hoá ra lại là ông tổng giám đốc.", "eng": "An insignificant-looking man who turned out to be the managing director."}, {"viet": "Một người công khai ủng hộ việc cải tổ bầu cử.", "eng": "An outspoken protagonist of electoral reform."}, {"viet": "Còn \"Tạm biệt\" thì nói thế nào?", "eng": "And what's for \"Good-bye\"?"}, {"viet": "Bất kỳ giáo viên nào có năng lực đều biết điều đó.", "eng": "Any teacher worth his salt knows that."}, {"viet": "Công nhân làm việc theo hệ thống ba ca phải không?", "eng": "Are the workers on a three-shift system?"}, {"viet": "Phải anh định cho hắn biết điều bí mật đó không?", "eng": "Are you going to let him in on the secret?"}, {"viet": "Tranh luận một cách sôi nổi để hỗ trợ chuyện gì.", "eng": "Argue vigorously in support of something."}, {"viet": "Khi anh ta uống nhiều rượu thì cách phát âm của anh ta trở nên tệ hại hơn.", "eng": "As he drank more wine his articulation became worse."}, {"viet": "Biết chắc ai có khả năng đến dự buổi họp.", "eng": "Ascertain who is likely to come to the meeting."}, {"viet": "Lúc hoàng hôn, có một dải màu đỏ nằm vắt ngang bầu trời phía tây.", "eng": "At sunset, there was a bar of red across the western sky."}, {"viet": "Tránh nói bất cứ điều gì liên quan đến chứng bệnh của hắn.", "eng": "Avoid making any reference to his illness."}, {"viet": "Hãy cẩn thận với chiếc áo đầm đó; nó dễ rách lắm đấy.", "eng": "Be careful with that dress; it rips easily."}, {"viet": "Không bị các qui luật và điều lệ ràng buộc.", "eng": "Be unfettered by rules and regulations."}, {"viet": "Sự tin tưởng vào tính chính xác của Kinh Thánh.", "eng": "Belief in the inerrancy of the Scriptures."}, {"viet": "Máu phun ra từ vết thương.", "eng": "Blood spurted out from the wound."}, {"viet": "Anh quốc đã chuyển sang hệ thống tiền tệ thập phân vào năm 1970.", "eng": "Britain changed to a metric system of currency in 1970."}, {"viet": "Nếu không có dây an toàn thì hôm nay tôi không còn sống.", "eng": "But for the safety-belt I wouldn't be alive today."}, {"viet": "Nhưng trận bóng đá bắt đầu từ 2: 00 giờ.", "eng": "But the football game starts at 2: 0."}, {"viet": "Can thiệp vào vụ này, ông đã xen vào phạm vi trách nhiệm của tôi.", "eng": "By interfering in this matter you are poaching on my preserve."}, {"viet": "Ai có thể sắp xếp một thời biểu tốt hơn đây?", "eng": "Can anyone design a better timetable?"}, {"viet": "Liệu thành phố này có thể lấy lại được vẻ huy hoàng trước đây của nó không?", "eng": "Can the city recapture its former splendour?"}, {"viet": "Nào, anh vui lòng đưa cho tôi cái cờ lê đó?", "eng": "Can you hand me the wrench now?"}, {"viet": "Anh có thể cho tôi biết là khi nào người ta thu rác được không?", "eng": "Can you tell me when the garbage is collected?"}, {"viet": "Người Thiên Chúa giáo đi xưng tội để linh hồn sạch tội.", "eng": "Catholics go to confession to purge their souls of sin."}, {"viet": "Trẻ con cần đồ chơi riêng của chúng.", "eng": "Children need toys of their own."}, {"viet": "Kiểm tra kỹ người ta nhận thấy ở bản viết tay có nhiều dòng được viết thêm sau này.", "eng": "Close inspection showed that many lines had been interpolated into the manuscript at a later day."}, {"viet": "Chữ committee được viết với hai chữ t.", "eng": "Committee is spelt with two t's."}, {"viet": "Các nhà bảo thủ hy vọng có việc rút lại sự hậu thuẫn của cánh tả dành cho bộ luật mới đang gây tranh cãi.", "eng": "Conservatives hoped for a rollback of left-wing support for the controversial new legislation."}, {"viet": "Bạn có thể vẽ bản đồ cho cháu được không?", "eng": "Could you draw a map for me?"}, {"viet": "Luật sư bên bị nói rằng ông ta có ý định đưa ra tình trạng điên loạn của bị cáo để biện hộ.", "eng": "Counsel for the accused said that he intended to plead insanity."}, {"viet": "Bố nó ơi, chuyến bay của chúng ta khởi hành lúc mấy giờ vậy?", "eng": "Dad, what time is our flight?"}, {"viet": "Nhu cầu về công nhân lành nghề rất cao; nhưng chẳng ai cần người không có tay nghề cả.", "eng": "Demand for skilled workers is high; but there is no demand for unskilled ones."}, {"viet": "Hiến dâng chính mình cho một sự nghiệp cao cả.", "eng": "Devote oneself to a noble cause."}, {"viet": "Mới đây bạn có xem phim nào không?", "eng": "Did you see any movie lately?"}, {"viet": "Phân chia tiền bạc, thức ăn, phần thưởng.", "eng": "Divide up the money, food, reward."}, {"viet": "Phải cố lịch sự hơn nữa!", "eng": "Do try to be more pleasant!"}, {"viet": "Bạn có điện thoại di động không?", "eng": "Do you have a cellular phone?"}, {"viet": "Anh có biết về việc Jack bị bắt không?", "eng": "Do you know about Jack getting arrested?"}, {"viet": "Phiền cô chụp ảnh cho chúng tôi nhé?", "eng": "Do you mind taking our picture?"}, {"viet": "Bạn có nghĩ là các kì nghỉ của người Nhật thường quá ngắn không?", "eng": "Do you think that Japanese vacations are generally too short?"}, {"viet": "Anh ấy có biết số điện thoại của anh không?", "eng": "Does he know your phone number?"}, {"viet": "Đừng ngại xin giúp đỡ nếu anh cần.", "eng": "Don't be afraid to ask for help if you need it."}, {"viet": "Đừng quên khóa chặt cửa trước khi rời khỏi nhà.", "eng": "Don't forget to lock up before leaving home."}, {"viet": "Đừng quên viết thư cho mẹ cậu đấy.", "eng": "Don't neglect writing to your mother."}, {"viet": "Đừng tin hắn: tôi biết cái thứ người như hắn mà!", "eng": "Don't trust him: I know his kind!"}, {"viet": "Gom lại với nhau những mạch văn tường thuật.", "eng": "Drawing together the strands of narrative."}, {"viet": "Mỗi người trong bọn họ đều gọi điện cảm ơn tôi.", "eng": "Each of them phoned to thank me."}, {"viet": "Nước Anh được ngăn cách với nước Pháp bằng biển Măngsơ.", "eng": "England is separated from France by the Channel."}, {"viet": "Những sự việc kết hợp lại dẫn đến sự suy tàn của ông ta.", "eng": "Events that conspired to bring about his downfall."}, {"viet": "Xin lỗi, ở đây cô có nhận gửi điện tín ra nước ngoài không?", "eng": "Excuse me, but do you take overseas cables here?"}, {"viet": "Diệt chuột để ngăn ngừa bệnh lây lan.", "eng": "Exterminate rats to prevent the spread of disease."}, {"viet": "Tháng Hai là tháng thứ nhì trong năm.", "eng": "February is the second month of the year."}, {"viet": "Tìm sự trung dung giữa nghiêm khắc và độ lượng.", "eng": "Find the medium between severity and leniency."}, {"viet": "Thả một bè gỗ trôi xuôi dòng.", "eng": "Float a raft of logs down the river."}, {"viet": "Vì những lý do riêng, anh ấy đã từ chối tham gia câu lạc bộ.", "eng": "For reasons of his own, he refused to join the club."}, {"viet": "Những bằng chứng mới nhất về việc gian lận trong các vụ giao dịch về tài chính.", "eng": "Fresh evidence of foul play in financial dealings."}, {"viet": "Sự phẫn nộ chung về việc tăng vọt giá vé xe buýt.", "eng": "General indignation at the sudden steep rise in bus fares."}, {"viet": "Cam kết không bao giờ tiết lộ bí mật.", "eng": "Give a pledge never to reveal the secret."}, {"viet": "Tiếp tục những công việc hàng ngày của ai.", "eng": "Go about one's daily routine."}, {"viet": "Những cách kiểm soát của chính phủ về thương mại và công nghiệp.", "eng": "Government controls on trade and industry."}, {"viet": "Chữ viết với nhiều chữ có nét vòng.", "eng": "Handwriting with loops on many of the letters."}, {"viet": "Cứ ăn với uống không khác gì những kẻ thô lỗ, chúng ta đã lao vào các thú vui tầm thường ở đây chưa đủ hay sao?", "eng": "Have we not groveled here long enough, eating and drinking like mere brutes?"}, {"viet": "Bạn có bao giờ mặc áo kimono chưa?", "eng": "Have you ever worn a kimono?"}, {"viet": "Bộ bạn không đeo đồng hồ sao?", "eng": "Haven't you got your watch with you?"}, {"viet": "Nó là tấm gương sáng của một học sinh chăm chỉ.", "eng": "He's a shining example of a hard-working pupil."}, {"viet": "Nó kém cả lớp về tập đọc.", "eng": "He's behind the rest of the class in reading."}, {"viet": "Ông ta bị thu hút vào việc tổ chức một câu lạc bộ mới.", "eng": "He's involved in the organization of a new club."}, {"viet": "Nó sống trong một căn hộ ở West Kensington.", "eng": "He's staying in rooms in West Kensington."}, {"viet": "Anh ấy ưa dùng những lời kiêu căng khoác lác.", "eng": "He affects a pretentious use of language."}, {"viet": "Anh ấy không để tâm oán giận họ.", "eng": "He bears no resentment towards them."}, {"viet": "Cậu bé nhảy tung tăng vào phòng.", "eng": "He came bouncing into the room."}, {"viet": "Nó chuồn ngay khi nó nhìn thấy cảnh sát đến.", "eng": "He cleared off as soon as he saw the policeman coming."}, {"viet": "Anh ta chia ngay cả lát bánh cuối cùng của anh ta cho bạn.", "eng": "He'd share his last crust with you."}, {"viet": "Ông ta không quan tâm tới những kẻ chỉ trích mình vì coi họ là những nhà từ thiện đạo đức giả sợ đối đầu với sự thật.", "eng": "He dismissed his critics as pious do-gooders who were afraid to face the facts."}, {"viet": "Anh ta đã mua vui cho chúng tôi hàng giờ liền bằng những câu chuyện kể và những lời nói đùa.", "eng": "He entertained us for hours with his stories and jokes."}, {"viet": "Cuối cùng anh ta cũng vào được khách sạn bằng cách cho tiền người gác cổng.", "eng": "He finally gained entry to the hotel by giving some money to the doorman."}, {"viet": "Anh ta giật mạnh sợi dây thừng một cái.", "eng": "He gave the rope a yank."}, {"viet": "Nó nhìn bằng con mắt hăm dọa.", "eng": "He had a nasty look in his eye."}, {"viet": "Anh ta có cổ phần trong doanh nghiệp đó.", "eng": "He has a concern in the business."}, {"viet": "Sau nhiều năm nghiên cứu ông ta đã triển khai một lý thuyết mới.", "eng": "He has evolved a new theory after many years of research."}, {"viet": "Lúc nào anh ta cũng hành động vì lợi ích cao nhất của bạn.", "eng": "He has your best interests at heart."}, {"viet": "Người ta cho rằng chính ông ta đầu tiên đưa từ này vào ngôn ngữ.", "eng": "He is accredited with having first introduced this word into the language."}, {"viet": "Ông ta dễ nổi cáu khi người ta bất đồng ý kiến với ông.", "eng": "He is prone to lose his temper when people disagree with him."}, {"viet": "Anh ta cứ nói mãi về các tài năng của mình nghe phát chán.", "eng": "He keeps prosing away about his talents."}, {"viet": "Anh ta say mê nghe nhạc.", "eng": "He listened to the music with rapt attention."}, {"viet": "Anh ta đã đưa ra một quyết định hấp tấp-bây giờ anh ta khổ sở vì nó.", "eng": "He made a rash decision-now he's suffering for it."}, {"viet": "Anh ấy phải cố gắng hơn nữa trong công việc của mình.", "eng": "He must put more effort into his work."}, {"viet": "Ông ta đã trả cho bọn khủng bố một số tiền chuộc đứa con trai bị bắt cóc là 50.000 bảng Anh.", "eng": "He paid the terrorist a ransom of £ 50,000 for his kidnapped son."}, {"viet": "Ông ta lo lắng thăm dò chỗ sưng.", "eng": "He probed the swelling anxiously with his finger."}, {"viet": "Nó khóc chạy về nhà với mẹ.", "eng": "He ran home in tears to his mother."}, {"viet": "Anh ấy trả lời là anh ấy bận.", "eng": "He replied that he was busy."}, {"viet": "Ông ấy là nhân viên tập sự quản lý.", "eng": "He's a new management trainee."}, {"viet": "Anh ta được thuê làm việc trên những giàn khoan dầu.", "eng": "He's employed on the oil rigs."}, {"viet": "Hiện giờ anh ấy đi vắng.", "eng": "He's not at home now."}, {"viet": "Anh ta làm việc gì cũng rất có phương pháp.", "eng": "He's very systematic in everything he does."}, {"viet": "Nó vốc những đồng tiền trong đôi tay.", "eng": "He scooped the coins up in his hands."}, {"viet": "Anh ta hét lên Cút đi hoặc một nhận xét nào đó như vậy.", "eng": "He shouted Go away or some such remark."}, {"viet": "Lúc nào hắn ta cũng vùi đầu vào sòng bạc.", "eng": "He spends all his time gambling in the casino."}, {"viet": "Anh ta lấy của người giầu để cho người nghèo.", "eng": "He stole from the rich to give to the poor."}, {"viet": "Anh ta đảo mắt nhìn theo những hướng khác nhau.", "eng": "He swiveled his eyes in various directions."}, {"viet": "Ông ta bảo các nhiếp ảnh viên thôi đừng quấy rầy ông ta nữa.", "eng": "He told the photographers to stop pestering him."}, {"viet": "Nó cố gắng tìm mọi cách để xoa dịu cô ta.", "eng": "He tried to find ways of mollifying her."}, {"viet": "Anh ta dùng ảo thuật rút một con thỏ ra từ cái mũ.", "eng": "He uses magic to produce a rabbit from his hat."}, {"viet": "Vợ ông ta đi cùng với ông ta trong đoàn thám hiểm.", "eng": "He was accompanied on the expedition by his wife."}, {"viet": "Ông ta rất đau khổ khi người vợ qua đời.", "eng": "He was broken-hearted when his wife died."}, {"viet": "Anh ta sung sướng mê li trước tin con gái mình ra đời.", "eng": "He was ecstatic at the news of his daughter's birth."}, {"viet": "Hắn đã ở tù hai mươi năm.", "eng": "He was in prison for twenty years."}, {"viet": "Anh ấy mổ không đánh thuốc mê.", "eng": "He was operated without an anaesthetic."}, {"viet": "Ông ta nổi giận đến mức không thể nói thành tiếng.", "eng": "He was so angry that he couldn't speak."}, {"viet": "Anh ta không thể nào trở xuống từ chỗ đứng cheo leo trên mỏm đá.", "eng": "He was unable to get down from his precarious position on the rocks."}, {"viet": "Ông ta trải qua nghi thức quen thuộc là nhồi thuốc vào tẩu và châm lửa.", "eng": "He went through the ritual of filling and lighting his pipe."}, {"viet": "Nó làm cho cử toạ hăng hái lên.", "eng": "He worked his audience into enthusiasm."}, {"viet": "Sự can thiệp, lời ca tụng, sự hài hước vụng về.", "eng": "Heavy-handed interference, compliments, humour."}, {"viet": "Mưu toan của cô ta khép Bill vào tội đó đã thất bại.", "eng": "Her attempt to frame Bill for the crime backfired."}, {"viet": "Sự đóng góp của cô ta vào cuộc thảo luận thật to lớn.", "eng": "Her contribution to the discussion was substantial."}, {"viet": "Mặt cô ta bị nhiều vết thâm tím trong vụ đâm xe.", "eng": "Her face was badly bruised in the crash."}, {"viet": "Sức khoẻ của bà ấy suy sụp nhanh và giai đoạn cuối bà ấy không bao giờ bước ra khỏi nhà.", "eng": "Her health declined rapidly and latterly she never left the house."}, {"viet": "Tính lười biếng của cô ta bộc lộ trong các kết quả thi của mình.", "eng": "Her laziness showed in her exam results."}, {"viet": "Những tiểu thuyết bà ta là một tổng hợp kỳ lạ giữa tính dè dặt của người Anh và sự đa cảm của người xứ Gan.", "eng": "Her novels are an odd synthesis of English reserve and Welsh emotionalism."}, {"viet": "Việc cô ta từ chối không chịu giúp đỡ làm cho vấn đề phức tạp thêm.", "eng": "Her refusal to help complicates matters."}, {"viet": "Dàn máy âm thanh nổi của nàng phát ra từng nốt nhạc một cách hoàn hảo.", "eng": "Her stereo system reproduces every note perfectly."}, {"viet": "Tuổi trẻ làm cho cô ấy có ưu thế hơn các đấu thủ chạy đua khác.", "eng": "Her youth gives her an advantage over the other runners."}, {"viet": "Những lý do khoa trương nhằm phủ nhận sự giúp đỡ trực tiếp của liên bang đối với những người thất nghiệp.", "eng": "Highfalutin reasons for denying direct federal assistance to the unemployed."}, {"viet": "Thị lực kém của anh ta khiến anh ta được miễn nghĩa vụ quân sự.", "eng": "His bad eyesight exempted him from military service."}, {"viet": "Áo quần anh ấy đầy bụi đất.", "eng": "His clothes were covered with dirt."}, {"viet": "Tiền kiếm được của ông lên đến 20,000 đô la một năm", "eng": "His earnings comes to $ 20,000 a year"}, {"viet": "Cha anh ta làm cho họ vì thế anh ta kiếm được việc qua cửa hậu.", "eng": "His father works for them so he got in through the backdoor."}, {"viet": "Việc ông ấy giúp đỡ cậu bé là bắt buộc vì bố cậu ta đã làm việc cho ông ấy.", "eng": "His helping the boy was obligatory as the boy's father had worked for him."}, {"viet": "Bức thư của ông ta có giọng điệu hăm doạ.", "eng": "His letter has a threatening undertone."}, {"viet": "Ngôi nhà mới của anh ấy là nỗi thèm khát của tất cả bạn bè.", "eng": "His new house was the envy of an his friends."}, {"viet": "Chân dung ông ta được treo bên trên lò sưởi.", "eng": "His portrait was hung above the fireplace."}, {"viet": "Gương cạo râu của hắn bị hơi nước phủ.", "eng": "His shaving mirror was covered with condensation."}, {"viet": "Thái độ sống sượng của ông ta chứng tỏ ông ta hoàn toàn hiểu sai tình hình.", "eng": "His tactlessness showed that he had completely misread the situation."}, {"viet": "Tiếng nói của ông ta bị chìm ngập trong tiếng sét nổ.", "eng": "His words were drowned in a crash of thunder."}, {"viet": "Những ngôi nhà được xây dựng thích hợp với nhu cầu của những người đứng tuổi.", "eng": "Homes tailored to the needs of the elderly."}, {"viet": "Thế gặp nhau ở cổng rạp chiếu phim lúc 6 giờ 45 nhé?", "eng": "How about meeting at the cinema gate at 6: 45?"}, {"viet": "Sao anh lại xộc vào nhà chúng tôi mà không gõ cửa!", "eng": "How dare you burst in on us without knocking!"}, {"viet": "Anh xếp Karpov vào loại đấu thủ cờ hạng nào?", "eng": "How do you rank Karpov as a chess player?"}, {"viet": "Anh đã làm việc trong ngành máy vi tính bao lâu rồi?", "eng": "How long have you been working with computers?"}, {"viet": "Trước nay đã có bao nhiều trường hợp bổ nhiệm?", "eng": "How many nominations have there been so far?"}, {"viet": "Một vé khứ hồi đi Paris là bao nhiêu?", "eng": "How much is a round-trip ticket to Paris?"}, {"viet": "Bạn thấy các cửa hàng phục vụ 24/24 giờ của Nhật so với các cửa hàng ở nước bạn thì thế nào?", "eng": "How would you compare Japanese convenience stores with the ones in your country?"}, {"viet": "Tôi sẽ rất vui nếu các ông có thể giao hàng sớm hơn một tuần.", "eng": "I'd be glad if you could deliver the goods a week earlier."}, {"viet": "Tôi rất muốn kể cho anh mọi chuyện tôi biết nhưng tôi bị buộc phải kín miệng.", "eng": "I'd like to tell you what I know but my lips are sealed."}, {"viet": "Tôi sẽ tặng một vài bộ cho bạn bè ở nhà để làm phong phú thêm cho bộ sưu tầm của họ.", "eng": "I'll give some of them to my friends at home to enrich their collections."}, {"viet": "Tôi sẽ xem xét lại thủ tục đó một lần nữa.", "eng": "I'll run back over the procedure once again."}, {"viet": "Tôi e rằng tôi có tin chẳng lành cho cô, vì thế cô hãy chuẩn bị tinh thần.", "eng": "I'm afraid I have bad news for you, so steel yourself."}, {"viet": "Tao chán chết mẹ lũ chết tiệt chúng mày rồi!", "eng": "I'm fucking sick of the whole fucking lot of you!"}, {"viet": "Hiện giờ tôi đang bị ông chủ hơi nghĩ xấu về tôi.", "eng": "I'm in rather bad odour with my boss at the moment."}, {"viet": "Lập luận của anh không hoàn toàn thuyết phục tôi.", "eng": "I'm not wholly convinced by your argument."}, {"viet": "Tôi xin lỗi vì đã đến thăm ông mà không có hẹn trước.", "eng": "I'm sorry to call on you without an appointment."}, {"viet": "Em mệt quá không nấu nướng được, tối nay ta đi ăn tiệm nhé.", "eng": "I'm too tired to cook tonight, shall we eat out?"}, {"viet": "Tôi cũng đã mong đợi được gặp ông.", "eng": "I've been looking forward to meeting you, too."}, {"viet": "Tôi bị cúm, nên không được dễ chịu.", "eng": "I've got flu, so I'm not quite up to the mark."}, {"viet": "Tôi chưa từng thấy ai say rượu như vậy trong đời tôi.", "eng": "I've never seen anybody that aced in my life."}, {"viet": "Tôi còn phân vân không biết có nhận công việc này hay không.", "eng": "I'm still doubtful whether I should accept this job."}, {"viet": "Tôi e rằng tôi không thể tán đồng với ý kiến của ông về thành tích của chính phủ.", "eng": "I am afraid I can't endorse your opinion of the government's record."}, {"viet": "Tôi không quen với công việc cực nhọc như thế.", "eng": "I am unaccustomed to such hard work to working so hard."}, {"viet": "Tôi miễn cưỡng đóng từng xu thuế.", "eng": "I begrudge every penny I pay in tax."}, {"viet": "Tôi không thể tin được là nó đã tự ý làm một việc như thế, chắc chắn nó đã bị những đứa lớn hơn xúi giục.", "eng": "I can't believe he'd do a thing like that on his own, he must have been put up to it by some of the older boys."}, {"viet": "Tôi không nhìn rõ được nhiệt kế.", "eng": "I can't read what the thermometer says."}, {"viet": "Tôi chỉ có thể ráp nối được vài từ tiếng Pháp.", "eng": "I can just manage to string a few words of French together."}, {"viet": "Em không thể đến đó chơi đâu!", "eng": "I can't go out there!"}, {"viet": "Tôi khó mà lôi được mấy đứa bé rời bữa tiệc.", "eng": "I could hardly drag the children away from the party."}, {"viet": "Tôi muốn cắt và uốn quăn.", "eng": "I'd like a cut and a perm."}, {"viet": "Tôi đã giải trò ô chữ trong nửa tiếng-thật quá đơn giản.", "eng": "I did the crossword in half an hour-there was nothing to it."}, {"viet": "Tôi không đồng ý với tất cả những gì anh nói, nhưng tôi mặc.", "eng": "I don't agree with all you say, but I'll let it go at that."}, {"viet": "Tôi không thích đứa nào trong bọn chúng cả, song hắn là đứa khá nhất bọn.", "eng": "I don't like any of them much, but he's the best of the bunch."}, {"viet": "Dù sao đi nữa anh nghĩ chúng ta chưa sẵn sang để chuyển nhà ngay bây giờ.", "eng": "I don't think we are ready to move right now anyway."}, {"viet": "Tôi chẳng ganh tị với anh ta về những vấn đề tiền bạc rắc rối của anh ta.", "eng": "I don't envy him his money problems."}, {"viet": "Tôi làm rơi cái xô và nước tràn ra ngoài nó.", "eng": "I dropped the bucket, and water slopped out of it."}, {"viet": "Tôi thực sự cảm thấy khoẻ lại sau kỳ nghỉ.", "eng": "I feel really fresh after my holiday."}, {"viet": "Tôi đọc xong nó trong 2 ngày.", "eng": "I finished it in two days."}, {"viet": "Tôi học ở Trường Trung học Clark.", "eng": "I go to Clark High School."}, {"viet": "Tôi đã cãi nhau với người bạn cùng phòng về chuyện ai sẽ làm việc nhà.", "eng": "I had a quarrel with my classmate about who should do the housework."}, {"viet": "Tôi phải thay thế cho trọng tài, ông ấy bị ốm.", "eng": "I had to sub for the referee, who was sick."}, {"viet": "Tôi đã đợi một tiếng đồng hồ rồi.", "eng": "I have been waiting for it for an hour."}, {"viet": "Tôi chỉ nắm điều cơ bản của môn vật lý.", "eng": "I have only a rudimentary grasp of physics."}, {"viet": "Tôi không có thì giờ để đọc hết.", "eng": "I haven't enough time to read."}, {"viet": "Tôi nghe có tin đồn là ông ta ra đi.", "eng": "I heard a rumour he was leaving."}, {"viet": "Tôi hy vọng làm sớm báo cáo của tôi.", "eng": "I hope to be beforehand with my report."}, {"viet": "Tôi giữ cho mình khỏi ngã.", "eng": "I just managed to keep myself from falling."}, {"viet": "Tôi nằm thức gần như cả đêm.", "eng": "I lay awake much of the night."}, {"viet": "Tôi đã chăm chú lắng nghe điều bà ta cần nói.", "eng": "I listened intently to what she had to say."}, {"viet": "Tôi sẽ gọi điện cho bạn vào sáng thứ ba.", "eng": "I'll give you a call Tuesday morning."}, {"viet": "Tôi sẽ nói cho bạn biết vài từ tiếng Nhật nhé.", "eng": "I'll tell you some Japanese words."}, {"viet": "Tôi ăn kiêng để giữ cho thân hình đẹp.", "eng": "I'm dieting to keep my figure."}, {"viet": "Tôi không phải là người quan tâm tới chính trị.", "eng": "I'm not a political animal."}, {"viet": "Tôi chắc chắn rằng những người hàng xóm theo dõi tôi.", "eng": "I'm sure my neighbours spy on me."}, {"viet": "Tôi thà chết quách cho rồi vì anh chả quan tâm gì đến tôi.", "eng": "I might as well be dead for all he cares."}, {"viet": "Tôi phải học kỹ về Nelson để chuẩn bị cho kỳ thi sử.", "eng": "I mustread up on Nelson for the history exam."}, {"viet": "Tôi thường đi chuyến xe lửa 7 giờ 15 tới Luân Đôn.", "eng": "I normally get the 7.15 train to London."}, {"viet": "Tôi đánh cờ và tôi thích chụp ảnh.", "eng": "I play chess, and I like taking pictures."}, {"viet": "Tôi đã đọc quảng cáo của ông trên báo về việc tuyển nhân sự.", "eng": "I read your ad in the paper about the job opening."}, {"viet": "Tôi nhớ việc anh ta phản đối kế hoạch đó.", "eng": "I remember his objecting to the scheme."}, {"viet": "Tôi đã gặp Tom cách đây ba ngày.", "eng": "I saw Tom three days ago."}, {"viet": "Tôi sẽ sẵn sàng trước 5 giờ.", "eng": "I should be ready by 5 o'clock."}, {"viet": "Tôi giẫm phải cái đinh và chân tôi rất đau.", "eng": "I stepped on a nail, and my foot's very sore."}, {"viet": "Tôi gọi điện đến nhà hàng và nói chuyện với ông chủ nhà hàng.", "eng": "I telephoned the restaurant and spoke to the manager."}, {"viet": "Tôi nghĩ Marry cùng kiểu người với anh ấy, anh không nghĩ vậy à?", "eng": "I think Mary is his type, don't you think?"}, {"viet": "Tôi nghĩ những nhận định của cô ấy rất đúng lúc.", "eng": "I thought her remarks were very apropos."}, {"viet": "Tôi cố gắng không nói nhưng không kìm lòng được.", "eng": "I tried not to say anything, but couldn't help myself."}, {"viet": "Anh ta than tôi đã bị đánh.", "eng": "I've been hit, he groaned."}, {"viet": "Vui lòng cho tôi đổi một ít tiền.", "eng": "I want to change some money, please."}, {"viet": "Tôi định lấy cái bánh cuối cùng nhưng anh ấy đã phỗng tay trên.", "eng": "I was about to take the last cake, but he beat me to it."}, {"viet": "Tôi rất vui khi nhận được đơn đặt hàng của ông đề ngày 13 tháng mười một.", "eng": "I was glad to receive your order sheet of November 13."}, {"viet": "Tôi đang bận đọc cái gì đó thì cô ta gọi điện thoại.", "eng": "I was right in the middle of reading it when she phoned."}, {"viet": "Tôi rất xúc động nhận được lá thư ân cần của ngài.", "eng": "I was very touched to receive your kind letter."}, {"viet": "Tôi sẽ ở lại Thượng Hải trong nhiều tuần mà.", "eng": "I will stay in Shanghai for several weeks."}, {"viet": "Không biết bố có thanh toán được toàn bộ hay không?", "eng": "I wonder if I can pay it all?"}, {"viet": "Tôi cần một bản tường trình tai nạn.", "eng": "I would like a copy of the accident report."}, {"viet": "Thật sự tôi rất thích gặp lại anh ấy.", "eng": "I would really enjoy seeing him again."}, {"viet": "Nếu dầu dính lên lốp xe, nó sẽ làm lốp xe mất tính đàn hồi.", "eng": "If any oil gets on the car tires, it will perish them."}, {"viet": "Nếu tôi nhớ không lầm, bạn học chung trường đại học với anh ấy, đúng không?", "eng": "If I remember correctly, you went to the same college as he did, right?"}, {"viet": "Nếu tin này mà lộ ra thì sẽ rắc rối đấy.", "eng": "If the news gets out there'll be trouble."}, {"viet": "Nếu tất cả các bạn đến dự buổi tiệc ấy, các bạn có thể tính luôn cả tôi đi nữa.", "eng": "If you're all going to the party, you can count me in."}, {"viet": "Nếu anh còn làm như thế nữa, tôi sẽ kiện anh.", "eng": "If you do that again I'll have the law on you."}, {"viet": "Nếu cậu sống ở nước ngoài biết được tiếng nước đó là rất tiện lợi.", "eng": "If you live abroad it helps to know the local lingo."}, {"viet": "Nếu anh muốn phung phí tiền của anh thì mặc anh.", "eng": "If you want to waste your money, that's your own look-out."}, {"viet": "Trong đại số học, ký hiệu x thường biểu thị một lượng không biết.", "eng": "In algebra, the sign x usually denotes an unknown quantity."}, {"viet": "Xưa, thủ cấp của các tù nhân bị xâu vào những cọc nhọn.", "eng": "In former times, prisoners'heads were impaled on pointed stakes."}, {"viet": "Ở những chỗ khác, nó đổ xuống giữa những sườn núi dốc.", "eng": "In other places it rushes between steep cliffs."}, {"viet": "Ở miền Viễn Bắc có những hoang mạc được hình thành ngay tại cả những nơi có khá nhiều nước trong đất.", "eng": "In the Far North there are deserts even where there is much water in the soil."}, {"viet": "Trong bức tranh này, nghệ sĩ chắc chắn đã thả lỏng trí tưởng tượng của mình.", "eng": "In this picture the artist certainly allowed his imagination free rein."}, {"viet": "Bên trong sảnh đường này là một tấm thép có một bản khắc bằng bốn thứ tiếng kể về lịch sử của đạo Lạt Ma.", "eng": "Inside this pavilion is a steel with an inscription in four languages telling the history of La-maism."}, {"viet": "Bây giờ có phải là giờ cao điểm không?", "eng": "Is it the rush hour now?"}, {"viet": "Có ai trong số các anh là bác sĩ không?", "eng": "Is there anyone among you who is a doctor?"}, {"viet": "Nó sẽ vẫn là điều bí mật trừ phi có ai bép xép tiết lộ ra.", "eng": "It'll remain a secret unless someone blabs."}, {"viet": "Anh thì chỉ có giỏi gợi ý ngày nghỉ đi trượt tuyết thôi, còn tôi lại là người phải chi phí cho việc đó.", "eng": "It's all very well to suggest a skiing holiday, but I'm the one who will have to pay for it."}, {"viet": "Thật là dễ dàng coi thường ông ta như là một lão già kỳ cục chán ngắt.", "eng": "It's easy to write him off as just an eccentric old bore."}, {"viet": "Chính là ban giám đốc chứ không phải anh em công nhân đã phạm sai lầm.", "eng": "It's management that's at fault rather than the work-force."}, {"viet": "Nó ở góc đường đối diện với bưu điện.", "eng": "It's on the corner opposite the post office."}, {"viet": "Nó là món thịt xắt lát mỏng được nướng với nhiều loại nước xốt khác nhau.", "eng": "It's thinly sliced meat fried with various sauces."}, {"viet": "Dường như anh đã phạm một sai lầm.", "eng": "It appears that you have made a mistake."}, {"viet": "Một linh mục mà hành động khắc nghiệt là không thích đáng.", "eng": "It ill befits a priest to act uncharitably."}, {"viet": "Không thể nào định rõ được niên đại chính xác của toà nhà này.", "eng": "It is impossible to assign an exact date to this building."}, {"viet": "Đã đến lúc chúng ta phải chú tâm vào mục chính trong chương trình nghị sự.", "eng": "It is time we addressed ourselves to the main item on the agenda."}, {"viet": "Anh ta chợt nảy ra ý đưa bà cô tới ga.", "eng": "It occurred to him that he should take his aunt to the station."}, {"viet": "Chỉ có trong tiểu thuyết, tác giả mới tự do viết lên những điều mình tưởng tượng và sáng tạo ra những hình ảnh tuyệt đẹp mà thôi.", "eng": "It's only in novels that an author is free to use his imagination and create beautiful images."}, {"viet": "Đáng lẽ nên có độ đậm đặc như món xúp đặc.", "eng": "It should have the consistency of thick soup."}, {"viet": "Chúng tôi đến đúng giờ là một điều hết sức kỳ diệu.", "eng": "It was a positive miracle that we arrived on time."}, {"viet": "Điều mà anh đem ra khoe một cách hãnh diện là anh ta chưa bao giờ nghỉ việc một ngày nào vì ốm cả.", "eng": "It was his proud boast that he had never missed a day's work because of illness."}, {"viet": "Để che giấu thiệt hại chỉ cần một chút việc trong khoảnh khắc thôi.", "eng": "It was the work of a few moments to hide the damage."}, {"viet": "Giữ một quan điểm khác có lẽ là sai lầm.", "eng": "It would be perverse to take a different view."}, {"viet": "Đồ nữ trang lấp lánh các màu ngũ sắc.", "eng": "Jewels sparkling with iridescent colours."}, {"viet": "Chỉ có một ít quà và vật dụng cá nhân thôi.", "eng": "Just a few gifts and personal belongings."}, {"viet": "Mặc dù có những khó khăn về ngôn ngữ, chẳng bao lâu anh ấy đã trở nên yêu đất nước và con người ở đây.", "eng": "Language difficulties notwithstanding, he soon grew to love the country and its people."}, {"viet": "Hãy để tôi lấy một tờ giấy bạn cần.", "eng": "Let me get a piece of paper."}, {"viet": "London là trung tâm quốc tế buôn bán chứng khoán và cổ phần.", "eng": "London is an international mart for stocks and shares."}, {"viet": "Nhiều người quan tâm đến tình hình ô nhiễm môi sinh.", "eng": "Many people are concerned about the pollution of the environment."}, {"viet": "Ba đứa con của Mary đều đẹp như những thiên thần-không như các con tôi.", "eng": "Mary's three children are all angels-not like mine."}, {"viet": "Xin phép cho tôi xem giấy chứng minh độ tuổi?", "eng": "May I see some proof of age?"}, {"viet": "Tiền nên được bỏ vào trong hộp quyên góp.", "eng": "Money should be put in the offertory box."}, {"viet": "Ông Brown mời ông Smith đi ăn tối tại Đông Lai Thuận, Vương Phủ Tỉnh vào lúc 7 giờ tối mai.", "eng": "Mr. Brown invites Mr. Smith to dinner at Donglaishun, Wangfujing at 7 p. m. tomorrow."}, {"viet": "Thắt lưng của tôi chặt quá-tôi phải nới lỏng nó ra.", "eng": "My belt is top tight-I shall have to loosen it."}, {"viet": "Ba tôi nói năm tới ông ấy muốn đi Nhật.", "eng": "My father says he wants to go to Japan next year."}, {"viet": "Mẹ tôi làm tất cả công việc trong nhà.", "eng": "My mother does all the jobs about the house."}, {"viet": "Sức lực, mối quan tâm, lòng nhiệt tình v. v. của tôi đang giảm sút.", "eng": "My strength, interest, enthusiasm, etc is flagging."}, {"viet": "Những khu chung cư mới và văn phòng mọc lên như nấm khắp thành phố.", "eng": "New blocks of flats and offices mushrooming all over the city."}, {"viet": "Không, tôi không có gì để kê khai cả.", "eng": "No, I have nothing to declare."}, {"viet": "Không ai có thể phủ nhận rằng những bản giao hưởng của Beethoven là những kiệt tác vĩ đại.", "eng": "No one would deny that Beethoven's symphonies are great masterpieces."}, {"viet": "Nay lão đã 90, lão thấy chuyện đi lại là phải mức sức quá nhiều.", "eng": "Now that I'm 90, I find the exertions of travelling too great."}, {"viet": "Ồ, trời vừa mới bắt đầu mưa à?", "eng": "Oh, did it just start raining?"}, {"viet": "Được, nhưng có tính thêm tiền cho rương đựng hành lý, ông biết rồi đấy.", "eng": "Okay, but there's an extra charge for trunks, you know."}, {"viet": "Khi anh đã quen với cái nóng, anh sẽ không cảm thấy mệt mỏi lắm nữa.", "eng": "Once you acclimatized to the heat you won't feel so tired."}, {"viet": "Người ta không nên tin nhiều những điều được in trên báo.", "eng": "One should discredit a good deal of what is printed in newspaper."}, {"viet": "Công ty chúng tôi tự hào vì có tiếng là làm ăn ngay thẳng.", "eng": "Our company is proud of its reputation for fair dealing."}, {"viet": "Cửa hàng nhỏ của chúng tôi ở góc phố không còn là một doanh nghiệp sinh lợi nữa.", "eng": "Our little corner shop is no longer a paying concern."}, {"viet": "Thầy giáo chúng tôi rất cầu kỳ trong cách chấm câu.", "eng": "Our teacher is very fussy about punctuation."}, {"viet": "Quốc hội lên án các biện pháp đàn áp của cảnh sát.", "eng": "Parliament condemned the repressive measures taken by the police."}, {"viet": "Những người thuộc mọi địa vị trong xã hội Nó có những ý nghĩ vượt lên trên địa vị của nó.", "eng": "People in all stations of life He has ideas above his station."}, {"viet": "Vui lòng cho em một cái túi để mửa khi say máy bay.", "eng": "Please give me an airsickness bag."}, {"viet": "Chương trình có thể lấy ở chỗ bán vé.", "eng": "Programmes may be obtained at the ticket office."}, {"viet": "Học sinh không nên bị nhồi nhét Shakespeare trước khi chúng đủ lớn để thưởng thức được các vở kịch của ông.", "eng": "School children shouldn't be force-fed with Shakespeare before they are old enough to really appreciate his play."}, {"viet": "Tôi mở màn cửa cho ông nhé?", "eng": "Shall I open the drapes for you?"}, {"viet": "Bà ta là một nhà văn rất được hâm mộ, nhưng tôi lại không thích văn phong của bà ta.", "eng": "She's a very popular writer but I just don't like her style."}, {"viet": "Ở trường cô ấy học giỏi, nhưng cô ấy sẽ không bao giờ là bác sĩ phẫu thuật sọ não.", "eng": "She's doing alright at school, but she'll never be a brain surgeon."}, {"viet": "Cô ta đang tìm cơ hội để sút bóng vào khung thành.", "eng": "She's looking for an opportunity to shoot at goal."}, {"viet": "Cô ta đã đi về miền quê để hưởng một kỳ nghỉ cuối tuần yên tĩnh.", "eng": "She's taken herself off to the country for a quiet weekend."}, {"viet": "Bà ấy cũng sắp xếp việc sửa chữa hay bất cứ công việc nào như thế.", "eng": "She also arranges for repairs or any work like that."}, {"viet": "Cô ta lao vào phòng với vẻ sôi động thường ngày và ngay lập tức bắt chuyện với mọi người.", "eng": "She burst into the room with her usual ebullience, and immediately started talking to everyone."}, {"viet": "Cô ấy tiếp tục nhìn họ trong yên lặng.", "eng": "She continued to look at them in silence."}, {"viet": "Chị ấy làm hầu hết mọi việc nhưng mọi danh vọng lại thuộc về anh ta hết.", "eng": "She did most of the work but all the kudos went to him."}, {"viet": "Bà ta được thừa nhận rộng rãi là một chính khách nổi bật.", "eng": "She established herself as a leading politician."}, {"viet": "Cô ta nhận thấy công việc càng ngày càng ít hấp dẫn.", "eng": "She found the job less and less attractive."}, {"viet": "Cô ta ghì lấy tên xông vào cô nhưng hắn đã chạy thoát.", "eng": "She grappled with her assailant but he got away."}, {"viet": "Từ khi lấy chồng, cô ấy không về nhà.", "eng": "She hadn't been home since her marriage."}, {"viet": "Cô ấy chứng tỏ có sức dẻo dai để ganh đua trong cuộc maratông.", "eng": "She has proved that she has the staying power to compete in the marathon."}, {"viet": "Cô ta là một người làm việc khá tốt, nhưng đôi khi cũng cần phải thúc giục.", "eng": "She is a fairly good worker, but she needs prodding occasionally."}, {"viet": "Bà ta rất kiên quyết trong việc bảo vệ các quyền của mình.", "eng": "She is tenacious in defence of her right."}, {"viet": "Cô ta bỏ học, cảm thấy rằng cuộc đời là sự hưởng thụ.", "eng": "She left school feeling that the world was her oyster."}, {"viet": "Cô ta đã biếu một tặng phẩm của riêng cho cá nhân anh sử dụng.", "eng": "She made a personal donation to the fund."}, {"viet": "Cô ta không để ý cái gì trừ cái liên quan với mình.", "eng": "She noticed nothing except what relates to herself."}, {"viet": "Cô ấy tán thành sự tiết kiệm như là một phương tiện tốt nhất để giải quyết vấn đề khủng hoảng.", "eng": "She preached economy as the best means of solving the crisis."}, {"viet": "Cô ta miễn cưỡng đồng ý cho qua vấn đề.", "eng": "She reluctantly agreed to let the matter drop."}, {"viet": "Cô ta hết sức giữ gìn sức khoẻ.", "eng": "She's fanatical about keeping fit."}, {"viet": "Cô ta rất khéo làm lấy mọi việc.", "eng": "She's very keen on to do it yourself."}, {"viet": "Hình như cô ta cố tình làm những cái đó.", "eng": "She seems to do these things on purpose."}, {"viet": "Nghe đến tên anh ấy cô ta cười khẩy.", "eng": "She sneered at the mention of his name."}, {"viet": "Cô ta đột nhiên nhận thấy anh ta hốc hác và xanh quá.", "eng": "She suddenly noticed how pale and drawn he looked."}, {"viet": "Cô ta đã mang theo đồ nghề của mình ra vườn.", "eng": "She took her work with her into the garden."}, {"viet": "Chị ấy thường viết đầy mấy trang khi làm báo cáo.", "eng": "She usually writes several pages when she makes her report."}, {"viet": "Cô ấy luôn luôn gửi những lá đầy tức giận đến các báo.", "eng": "She was always sending angry letters to the newspapers."}, {"viet": "Bà ta được bầu vào một ghế ở thượng viện.", "eng": "She was elected to a seat in the Senate."}, {"viet": "Nàng ta rất giận hắn vì hắn đã thua trận đấu.", "eng": "She was mad at him for losing the match."}, {"viet": "Cô ta đã bị phê bình nghiêm khắc vì xao lãng bổn phận.", "eng": "She was severely criticized for neglect of duty."}, {"viet": "Cô ấy rất nước đôi đối với đề nghị của tôi.", "eng": "She was very non-committal about my suggestion."}, {"viet": "Nàng đạp xe xuống đồi.", "eng": "She wheeled down the hill on her bicycle."}, {"viet": "Cô ấy làm việc nhanh quá tôi không theo kịp.", "eng": "She works so fast I can't keep pace with her."}, {"viet": "Án tử hình có nên bãi bỏ không?", "eng": "Should the death penalty be abolished?"}, {"viet": "Kể từ khi ống ấy thất bại trong cuộc bầu cử ông ấy là một người thất vọng.", "eng": "Since he lost the election, he's a disappointed man."}, {"viet": "Hãy giảm bớt tốc độ khi anh đến gần làng.", "eng": "Slacken off your speed as you approach the village."}, {"viet": "Lén lút đưa người ra khỏi nước.", "eng": "Smuggle people out of the country."}, {"viet": "Sự bất công trong xã hội-một nguyên nhân của các cuộc cách mạng.", "eng": "Social injustice-a breeder of revolutions."}, {"viet": "Một vài loại trái cây không được ướp lạnh kỹ chút nào.", "eng": "Some fruits don't freeze well at all."}, {"viet": "Một số người vẫn cho rằng có quan hệ tình dục trước hôn nhân là trái đạo đức.", "eng": "Some people still think it is immoral to have sex before marriage."}, {"viet": "Kẻ nào đó đã lấy trộm túi xách của người khách trọ.", "eng": "Someone stole the guest's handbag."}, {"viet": "Hãy quan tâm một chút đến những người kém may mắn hơn bạn.", "eng": "Spare a thought for those less fortunate than you."}, {"viet": "Đứng sang một bên để những người này đi qua.", "eng": "Stand aside and let these people pass."}, {"viet": "Cúi xuống để nhặt cái gì lên.", "eng": "Stoop down to pick something up."}, {"viet": "Luật lệ nghiêm ngặt làm tê liệt các hoạt động kinh tế.", "eng": "Strict regulations that paralyse economic activities."}, {"viet": "Xử sự như vậy thì khó mà nâng quyền lợi của anh lên được.", "eng": "Such conduct is unlikely to advance your interests."}, {"viet": "Các cổ động viên đã chen nhau ùa qua các cổng để vào sân vận động.", "eng": "Supporters crowded through the gates into the stadium."}, {"viet": "Thực hiện cú lao đầu xuống hồ bơi.", "eng": "Take a header into the swimming-pool."}, {"viet": "Được giao công tác thiết kế một trung tâm mua bán mới.", "eng": "Tasked with the design of a new shopping centre."}, {"viet": "Mười người bị chết trong vụ đâm tàu.", "eng": "Ten people were killed in the rain crash."}, {"viet": "Quả là một miếng bánh dày quá xá!", "eng": "That's a great thick slice of cake!"}, {"viet": "Cái thằng bé đó dùng lời tục tĩu quá-nó đù này đù kia dù thậm chí không nghĩ là mình đang nói gì nữa.", "eng": "That child has terrible language-he use the f-word without even thinking about it."}, {"viet": "Điều đó giúp đỡ khá nhiều cho chúng tôi.", "eng": "That is some help to us."}, {"viet": "Bức tranh trên tường, tôi thấy hình như treo lệch.", "eng": "That picture on the wall looks cock-eyed to me."}, {"viet": "Nơi trường tồn đó đã trở thành một hình ảnh của nỗi khắc khoải về cuộc sống và cái chết của con người.", "eng": "That stubborn spot has become an image of the agony of human life and death."}, {"viet": "Chuyến tàu hoả xuất phát từ London lúc 9 giờ sáng liên vận với chuyến tàu hoả rời Crewe lúc 12 giờ 05 phút trưa.", "eng": "The 9.00 a. m train from London connects with the 12.05 pm from Crewe."}, {"viet": "Hoạt động của các công ty tín dụng được quy định bởi luật pháp.", "eng": "The activities of credit companies are regulated by law."}, {"viet": "Sự liên kết của Nhật với phương Tây.", "eng": "The alignment of Japan with the West."}, {"viet": "Những nỗi lo lắng của tuần lễ trước đã khiến bà ta kiệt sức.", "eng": "The anxieties of the past week had left her exhausted."}, {"viet": "Sự sắp xếp thời gian và chỗ họp.", "eng": "The arrangement of time and place for the meeting."}, {"viet": "Những người kiểm toán đã chấp nhận các chứng từ thanh toán của công ty.", "eng": "The auditors approved the company's accounts."}, {"viet": "Tin dữ như giội gáo nước lạnh lên cuộc họp.", "eng": "The bad news cast a chill over the gathering."}, {"viet": "Quầy rượu mở cho khách ở ngoài.", "eng": "The bar is open to non-residents."}, {"viet": "Phản ứng của kim loại khi ta đun nóng nó.", "eng": "The behaviour of the metal as we heat it."}, {"viet": "Tiền tệ song phương được hiện hành ở Đức sau đại chiến II.", "eng": "The bizonal currency existing in Germany after World War II."}, {"viet": "Các phiếu khoán được giao cho luật sư làm trung gian bảo đảm.", "eng": "The bonds were held in escrow by the solicitor."}, {"viet": "Thế giới đối với anh ta đã sụp đổ khi vợ anh ấy qua đời.", "eng": "The bottom fell out of his world when his wife died."}, {"viet": "Đội Brazin được xem là không thể bị thua.", "eng": "The Brazilian team is regarded as unbeatable."}, {"viet": "Viên đạn xuyên thẳng qua ngực anh ta.", "eng": "The bullet went straight through his chest."}, {"viet": "Cuộc vận động cần phải có người phối hợp hiệu quả.", "eng": "The campaign needs an effective coordinator."}, {"viet": "Chiếc xe ô tô nhả số.", "eng": "The car is out of gear."}, {"viet": "Vụ kiện đó đã bị huỷ bỏ vì chứng cớ không đầy đủ.", "eng": "The case was dismissed because of insufficient evidence."}, {"viet": "Vị chủ tịch gói gọn phiên họp trong 20 phút.", "eng": "The chairman dispatched the meeting in 20 minutes."}, {"viet": "Mặt của đứa bé nhăn lại và nó bắt đầu òa lên khóc.", "eng": "The child's face puckered up and he began to cry."}, {"viet": "Đứa nhỏ đang ngồi trên bậc thang cuối cùng.", "eng": "The child was sitting on the bottom stair."}, {"viet": "Bọn trẻ ngoan ngoãn làm những công việc được phân.", "eng": "The children obediently performed the tasks'assigned to them."}, {"viet": "Người cha trong gia đình Trung Quốc có uy quyền lớn đối với gia đình mình.", "eng": "The Chinese father has great authority over his family."}, {"viet": "Việc giải toả các khu nhà ổ chuột để tiến hành việc xây dựng nhà mới.", "eng": "The clearance of slum ghettos to make way for new housing developments."}, {"viet": "Chiếc áo khoác vừa khéo, không vừa, chật, rộng, v. v.", "eng": "The coat was a good, bad, tight, loose, etc fit."}, {"viet": "Uỷ ban đã quyết định kết tội Tổng thống.", "eng": "The committee decided to impeach the President."}, {"viet": "Công ty đó đang giảm dần lực lượng bán hàng của mình.", "eng": "The company is running down its sale force."}, {"viet": "Sự kết hợp tay nghề và nghệ thuật trong việc làm đồ kim hoàn.", "eng": "The conjunction of workmanship and artistry in making jewelry."}, {"viet": "Chi phí lên tới 250 bảng Anh.", "eng": "The cost amounted to £ 250."}, {"viet": "Cặp vợ chồng đó cứ liên tục đi quanh khu vực giải trí quốc tế.", "eng": "The couple looped constantly around the international social circuit."}, {"viet": "Những lời chỉ trích đã được làm dịu bớt để không mất lòng bất cứ ai.", "eng": "The criticisms had been watered down so as not to offend anybody."}, {"viet": "Tiếng be be lạ lùng của những con chó biển.", "eng": "The curious baaing sound that young seals make."}, {"viet": "Một ngày tĩnh lặng, không một ngọn gió.", "eng": "The day was very still, without breath of wind."}, {"viet": "Đám biểu tình nổ ra thành vụ náo động.", "eng": "The demonstration broke up in tumult."}, {"viet": "Chuyên chính vô sản là một trong những mục tiêu của Chủ nghĩa Cộng sản.", "eng": "The dictatorship of the proletariat is one of the aims of Communism."}, {"viet": "Phân phát các tập danh mục quảng cáo, mẫu đơn, phần thưởng, v. v.", "eng": "The distribution of catalogues, forms, prizes, etc."}, {"viet": "Hội đồng đạo đức học của các bác sĩ quyết định xem mổ một số trường hợp có đúng về mặt đạo đức không.", "eng": "The doctors'ethical committee decides whether it is morally right to perform certain operation."}, {"viet": "Con chó đang nhay nhay con chuột.", "eng": "The dog was worrying a rat."}, {"viet": "Tài xế sẽ lo cho hành lý của ông.", "eng": "The driver will take care of your luggage."}, {"viet": "Cả biên tập viên lẫn người đọc và sửa bản in thử đều làm việc thêm giờ.", "eng": "The editors as well as the proof readers are working overtime."}, {"viet": "Quân địch buộc phải rút lui.", "eng": "The enemy were forced to retreat."}, {"viet": "Khối cộng đồng Kinh tế Châu âu được biết đến một cách rộng rãi như là Khối thị trường chung.", "eng": "The European Economic community popularly known as the common Market."}, {"viet": "Tiếng nổ đó làm tai tôi lùng bùng.", "eng": "The explosion made my ears sing."}, {"viet": "Chính khách nổi tiếng đó được là người có đặc quyền của thành phố Luân Đôn.", "eng": "The famous politician was made a freeman of the City of London."}, {"viet": "Phần năm của đỉnh gió hú sẽ được truyền hình hôm nay.", "eng": "The fifth episode of Wuthering Heights will be telecast today."}, {"viet": "Những phát giác của báo cáo đã gieo nghi ngờ vào những đòi hỏi của những người kháng nghị.", "eng": "The findings of the report threw discredit on the protesters'claims."}, {"viet": "64 trang đầu của cuốn sách đã in xong.", "eng": "The first 64 pages of the book have been printed."}, {"viet": "Các phi hành đoàn có các câu lạc bộ khác nhau.", "eng": "The flight crews have different lounges."}, {"viet": "Họa sĩ hàng đầu ở thời ông ấy.", "eng": "The foremost painter of his time."}, {"viet": "Chức năng của tim là bơm máu đi khắp cơ thể.", "eng": "The function of the heart is to bump blood through the body."}, {"viet": "Lớp nghệ thuật tổng hợp ở trường đại học bao gồm rất nhiều môn học.", "eng": "The general arts course at the university encompasses a wide range of subjects."}, {"viet": "Thủ môn bắt hụt sít sao quả bóng.", "eng": "The goalkeeper just missed stopping the ball."}, {"viet": "Chính phủ lo sợ cuộc bãi công có thể đưa ra các chuỗi sự kiện bãi công ở các ngành công nghiệp khác.", "eng": "The Government fears that the strike may produce a chain reaction in other industries."}, {"viet": "Chính phủ tặng tiền thưởng cho nông dân để khuyến khích họ khi họ đạt năng suất cao.", "eng": "The government offered a bounty to farmers to encourage them when there is overproduction."}, {"viet": "Vụ sụp đổ tài chính to lớn năm 1929 đã hủy hoại nền mậu dịch quốc tế.", "eng": "The great financial crash in 1929 ruined international trade."}, {"viet": "Cái máy ảnh của người khách trọ bị mất.", "eng": "The guest's camera is missing."}, {"viet": "Ông hiệu trưởng kéo dài kỳ nghỉ của chúng tôi ra bốn ngày.", "eng": "The headmaster extended our holiday by four days."}, {"viet": "Các ngọn đồi dốc nhấp nhô thoai thoải ra biển.", "eng": "The hills fell in gentle undulations to the sea."}, {"viet": "Nước nóng làm co chiếc áo pun của tôi.", "eng": "The hot water shrank my pullover."}, {"viet": "Ngôi nhà nằm trên đường chéo góc ngang qua quảng trường.", "eng": "The house stood cater-cornered across the square."}, {"viet": "Căn bệnh đó phát xuất từ các cơ quan trong cơ thể.", "eng": "The illness is organic in origin."}, {"viet": "Âm h trong chữ hour không đọc bật hơi.", "eng": "The initial h in hour is not aspirated."}, {"viet": "Số nghịch đảo của 2 là 1/2.", "eng": "The inverse of 2 is 1/2."}, {"viet": "Quan tòa đã ra những bản án nặng nề cho bọn phiến loạn.", "eng": "The judge dealt out harsh sentences to the rioters."}, {"viet": "Nhà vua luôn luôn có đầy tớ sẵn sàng tuân lệnh.", "eng": "The King has always had servants at his beck and call."}, {"viet": "Món tiền cuối cùng trong khoản tiết kiệm nhỏ nhoi của ông lão.", "eng": "The last of the old man's exiguous savings."}, {"viet": "Mùa xuân lá trên cây xanh tươi.", "eng": "The leaves on the trees are bright green in spring."}, {"viet": "Loại thức ăn dễ tiêu này tốt hơn cho anh nhiều.", "eng": "The light kind of foods are much better for you."}, {"viet": "Thượng nghị viện đang thảo luận vấn đề đó.", "eng": "The Lords is debating the issue."}, {"viet": "Các quan tòa chuyển hắn ta đến tòa án cao hơn ở Hà Nội.", "eng": "The magistrates committed him for trial in Ha Noi."}, {"viet": "Việc chế tạo ra vật liệu này là một kết quả tự nhiên của ngành công nghiệp vũ trụ.", "eng": "The manufacture of this material is an outgrowth of the space industry."}, {"viet": "Biện pháp đó đã bị đánh bại với chín phiếu chống sáu.", "eng": "The measure was defeated by 9 votes to 6."}, {"viet": "Nhiệt độ đã hạ xuống nhanh vào buổi sáng.", "eng": "The mercury had fallen rapidly by morning."}, {"viet": "Quả tên lửa rơi xuống còn cách ( mục tiêu ) mười dặm.", "eng": "The missile landed ten miles short ( of its target )."}, {"viet": "Giai đoạn đầu của một quốc gia mới.", "eng": "The morning of a new nation."}, {"viet": "Hệ thống vận tải, đổ rác của thành phố.", "eng": "The municipal transport system, rubbish dump."}, {"viet": "Thằng bé hàng xóm đã ghé vào nhà một lát để xem đồ chơi hoả tiễn kiểu mới nhất của Bob.", "eng": "The neighbour boy ran in for a minute to see Bob's newest model rocket."}, {"viet": "Giám đốc mới là một kẻ hoàn toàn vô dụng.", "eng": "The new manager is a complete dud."}, {"viet": "Tin tức đến với tôi là hoàn toàn bất ngờ.", "eng": "The news came on me like a thunderclap."}, {"viet": "Sông Nil là một trong những con sông trọng yếu của Châu Phi.", "eng": "The Nile is one of the principal rivers of Africa."}, {"viet": "Cô y tá bế vào một em bé quấn trong một cái mền ấm.", "eng": "The nurse carried in a baby wrapped in a warm blanket."}, {"viet": "Thuốc mỡ này chỉ dùng bôi ngoài da.", "eng": "The ointment is for external use only."}, {"viet": "Người đàn ông duy nhất và độc nhất cô ta muốn lấy.", "eng": "The one and only person she wanted to marry."}, {"viet": "3 đứa kia vẫn còn đi học.", "eng": "The other three are still in school."}, {"viet": "Gói hàng được trả về cho người gửi vì địa chỉ đề không đúng.", "eng": "The parcel was returned to the sender because the directions were incorrect."}, {"viet": "Bệnh nhân hồi phục sức khoẻ nhanh.", "eng": "The patient bounced back to good health."}, {"viet": "Những người mà nhà của họ bị trộm tuần trước.", "eng": "The people whose house was broken into last week."}, {"viet": "Bức tranh này bán đấu giá phải được 2000 pao.", "eng": "The picture should fetch 2000 pounds at auction."}, {"viet": "Kế hoạch không được phối hợp khéo léo.", "eng": "The plan was not very well co-ordinated."}, {"viet": "Vở kịch dựa theo một cuốn tiểu thuyết ngắn.", "eng": "The play is an adaptation of a short novel."}, {"viet": "Cảnh sát đang tìm thêm manh mối.", "eng": "The police are on the hunt for further clues."}, {"viet": "Cảnh sát bắt anh ta lộn hết túi ra.", "eng": "The police made him empty his pockets."}, {"viet": "Các cảnh sát cưỡi ngựa ô.", "eng": "The policemen were mounted on black horses."}, {"viet": "Thời kỳ phát triển kinh tế hậu chiến.", "eng": "The postwar period of economic expansion."}, {"viet": "Tổng thống dành phần lớn ngân sách cho quốc phòng.", "eng": "The president appropriated most of the national budget for defence."}, {"viet": "Còn về giá cả chúng ta sẽ giữ bí mật.", "eng": "The price will be our secret."}, {"viet": "Người tù đi có cảnh sát áp giải.", "eng": "The prisoner travelled under police escort."}, {"viet": "Dự án đã tiến triển chậm trong nhiều năm vì thiếu tiền.", "eng": "The project had hung fire for several years because of lack of funds."}, {"viet": "Việc cắt khoản chi tiêu công cộng sẽ có nghĩa là cắt bỏ nhiều bệnh viện.", "eng": "The public spending cuts will mean the chop for several hospitals."}, {"viet": "Nữ hoàng đang mặc bộ lễ phục.", "eng": "The Queen was in her robes of state."}, {"viet": "Những lỗ chuột khoét trong kho thóc cũ phải được bít lại.", "eng": "The ratholes in the old barn must be plugged up."}, {"viet": "Khẩu hiệu của trung đoàn là'Vinh quang hay là chết'.", "eng": "The regiment's motto was'Death or Glory'."}, {"viet": "Trách nhiệm công việc làm cho bà ta lo âu.", "eng": "The responsibilities of the job are weighing her down."}, {"viet": "Các quyền của cá nhân đang mất dần đều đều.", "eng": "The rights of the individual are being steadily eroded."}, {"viet": "Không thể đi được vì bị lụt.", "eng": "The roads are impassable because of floods."}, {"viet": "Phần tử hay làm ầm ĩ trong cử toạ ngắt lời diễn giả.", "eng": "The rowdy element in the audience interrupted the speaker."}, {"viet": "Giám đốc phụ trách bán hàng dẫn đầu một đoàn 20 đại biểu.", "eng": "The sales director heads a team of 20 representatives."}, {"viet": "Nhà trường dán quảng cáo ở những nơi công cộng thông báo triển lãm của nhà trường.", "eng": "The school put up posters in public places, announcing the school exhibition."}, {"viet": "Nội dung ngữ nghĩa của một câu.", "eng": "The semantic content of a sentence."}, {"viet": "Các tấm trải giường của tôi đã nhăn nhíu.", "eng": "The sheets on my bed have rucked up."}, {"viet": "Sự phản ứng bất bình của các trường về những khoản cắt giảm trong giáo dục.", "eng": "The shocked reaction of schools to education cuts."}, {"viet": "Việc ký kết một hiệp định như thế sẽ góp phần chủ yếu cho hòa bình thế giới.", "eng": "The signing of such a treaty would be a major contribution towards world peace."}, {"viet": "Những cậu bé nhỏ hơn được chấp trước 10 giây trong cuộc đua.", "eng": "The smaller boys were given a start of 10 seconds in the race."}, {"viet": "Những người lính được thử lửa ở chiến trường đã thể hiện một tính kỷ luật nghiêm minh.", "eng": "The soldiers showed perfect discipline under fire."}, {"viet": "Phát thanh viên thường phải xem bản ghi chép của mình.", "eng": "The speaker often referred to his notes."}, {"viet": "Những món ăn có dấu sao trên thực đơn là thích hợp cho những người ăn chay.", "eng": "The starred dishes on the menu are suitable for vegetarians."}, {"viet": "Câu chuyện được kể bằng lời và hình ảnh.", "eng": "The story is told in words and pictures."}, {"viet": "Chủ đề mà hôm nay chúng ta sẽ thảo luận trong lớp là thuyết Tiến hóa.", "eng": "The subject matter we will be discussing in class today is Evolution."}, {"viet": "Kẻ tình nghi không thể biện minh cho thời gian của anh ta tối hôm đó.", "eng": "The suspect couldn't account for his time that night."}, {"viet": "Thầy giáo thuộc tên tất cả các học sinh của ông.", "eng": "The teacher knows all his students by name."}, {"viet": "Suốt ngày hôm ấy, nhiệt độ luôn luôn ở dưới không độ.", "eng": "The temperature remained below freezing all day."}, {"viet": "Bọn trộm lấy cắp số quần áo trị giá 4000 bảng.", "eng": "The thieves took £ 4000 worth of clothing."}, {"viet": "Ứng cử viên Đảng Bảo thủ chiếm được 8000 phiếu.", "eng": "The Tory candidate polled 8000 votes."}, {"viet": "Việc huấn luyện được tiến hành được chăng hay chớ.", "eng": "The training was carried out in a haphazard fashion."}, {"viet": "Sự chuyển động của Quả Đất khiến cho một số chòm sao hình như đi theo một đường tròn trên bầu trời.", "eng": "The turning of the Earth makes some constellations seem to travel in a circle in the sky."}, {"viet": "Bây giờ hai chất tiếp xúc nhau và một phản ứng hoá học đang xảy ra.", "eng": "The two substances are now in contact, and a chemical reaction is occurring."}, {"viet": "Uỷ ban Phân bổ ngân sách của Thượng viện Mỹ.", "eng": "The US Senate Appropriations Committee."}, {"viet": "Làng bỗng nhiên đầy phóng viên.", "eng": "The village was suddenly awash with reporters."}, {"viet": "Nước ở những con sông ở núi thường sạch.", "eng": "The water in mountain rivers is usually pure."}, {"viet": "Toàn bộ khu vườn được chất đầy gạch.", "eng": "The whole garden was stacked with bricks."}, {"viet": "Cách giải quyết khôn ngoan nhất là lờ nó đi.", "eng": "The wisest course would be to ignore it."}, {"viet": "Hệ thống giao thông công cộng ngầm đầu tiên trên thế giới được xây dựng ở Luân Đôn vào năm 1890.", "eng": "The world's first underground public transportation system was built in London in 1890."}, {"viet": "Cái vẻ tỏ ra tin tưởng của họ không đánh lừa được ai.", "eng": "Their assumption of an air of confidence fooled nobody."}, {"viet": "Đám cưới của họ diễn ra linh đình trước mắt mọi người.", "eng": "Their marriage took place amid a blaze of publicity."}, {"viet": "Vậy thì tôi muốn đổi hai trăm đô la tiền mặt.", "eng": "Then I'd like to cash two hundred dollars."}, {"viet": "Rất cần phải có một quyển sách mới về chủ đề này.", "eng": "There's a great need for a new book on the subject."}, {"viet": "Đêm nay chắc sẽ không có tuyết.", "eng": "There's no expectation of snow tonight."}, {"viet": "Có tiếng chuông báo hiệu tiết học đã hết.", "eng": "There's the bell for the end of the lesson."}, {"viet": "Có nhiều lỗi chính tả, mặc dù vậy đó cũng là một bài tiểu luận tốt.", "eng": "There are many spelling mistakes, even so it's quite a good essay."}, {"viet": "Có hai cái giường lớn, một cái bàn viết dài, một cái bàn tròn, vài cái ghế và đèn.", "eng": "There are two large beds, a long desk, a round table, a number of chairs and lamps."}, {"viet": "Trong hợp đồng có một điều khoản cấm những người thuê không được cho thuê lại.", "eng": "There is a clause in the contract forbidding tenants to sublet."}, {"viet": "Chẳng có lợi ích gì mấy khi mua quyển từ điển nếu anh không đọc được.", "eng": "There is little advantage in buying a dictionary if you can't read."}, {"viet": "Những ngày này người ta không cần những cái như thế nhiều lắm.", "eng": "There isn't much call for such things these days."}, {"viet": "Lúc ấy đang chen lấn nhau và tôi mất chiếc mũ trong đám hỗn độn đó.", "eng": "There was a scuffle and I lost my hat in the mêlée."}, {"viet": "Có một vài chiếc thuyền rực rỡ màu sắc đây đó trên mặt nước.", "eng": "There were a few colourful boats here and there on the water."}, {"viet": "Loài bò sát cổ xưa này đã sống trong một thời gian dài, thật dài gọi là thời đại của loài bò sát.", "eng": "These ancient reptiles lived in the long, long period called the Age of Reptiles."}, {"viet": "Những mục này có thể hoãn lại đến cuộc họp lần sau của chúng ta.", "eng": "These items can lie over till our next meeting."}, {"viet": "Những truyền thống này đã tồn tại qua nhiều thời đại.", "eng": "These traditions have endured throughout the ages."}, {"viet": "Họ đã chọn Ashby làm chủ tịch mới.", "eng": "They've fixed on Ashby as the new chairman."}, {"viet": "Họ thích sưu tầm tiền kim loại và tem.", "eng": "They are interested in collecting coins and stamps."}, {"viet": "Họ đã mang theo nhiều thức ăn.", "eng": "They brought a lot of food with them."}, {"viet": "Họ thách tôi qua một đêm ở nghĩa địa.", "eng": "They dared me to spend a night in the graveyard."}, {"viet": "Họ yêu nhau và chẳng bao lâu sau họ kết hôn với nhau.", "eng": "They fell in love and were soon married."}, {"viet": "Họ ham tiểu thuyết Pháp hơn.", "eng": "They have a preference for French novels."}, {"viet": "Họ bỏ mặc đứa bé ở nhà suốt cả buổi tối.", "eng": "They left the baby at home unattended all evening."}, {"viet": "Họ chưa bao giờ đi xem phim.", "eng": "They never go to the movies."}, {"viet": "Họ đã chịu đựng thời tiết nghiệt ngã với tinh thần khắc kỷ điển hình của người Anh.", "eng": "They reacted to the appalling weather with typical British stoicism."}, {"viet": "Họ bày tỏ lòng cảm kích bằng cách tặng anh ta một chiếc đồng hồ vàng.", "eng": "They showed their appreciation by giving him a gold watch."}, {"viet": "Họ thường thử máu trong suốt thời kì có thai.", "eng": "They usually test your blood type during pregnancy."}, {"viet": "Họ buộc phải đầu hàng không điều kiện.", "eng": "They were forced to make an unconditional surrender."}, {"viet": "Họ không hiểu kẻ thù tấn công tiếp theo ở đâu.", "eng": "They wondered where the enemy would hit next."}, {"viet": "Cuốn sách này nó về từ và ý nghĩa của nó.", "eng": "This book deals with words and meanings."}, {"viet": "Khoá học bao gồm mọi mặt của vấn đề.", "eng": "This course of study embraces every aspect of the subject."}, {"viet": "Chiếc lọ thuỷ tinh này có bọt ở dưới đáy.", "eng": "This glass vase has a bubble in its base."}, {"viet": "Đây là cái áo khoác mới của tôi.", "eng": "This is my new down jacket."}, {"viet": "Cái máy cắt cỏ này hay trục trặc.", "eng": "This lawn-mover is a bit temperamental."}, {"viet": "Điều này quan trọng hơn tất cả các nhận định khác.", "eng": "This outweighs all other considerations."}, {"viet": "Vào cuối tuần thì con đường này lúc nào cũng bị kẹt xe cả.", "eng": "This road is always jam-packed during this weekend."}, {"viet": "Lý thuyết này chỉ có thể diễn đạt bằng ngôn ngữ toán học.", "eng": "This theory can only be expressed in mathematical language."}, {"viet": "Những viên thuốc mới mà anh cho tôi công hiệu như thần.", "eng": "Those new pills you gave me worked like a charm."}, {"viet": "Hôm nay là thứ ba nên ngày mai là thứ tư.", "eng": "Today is Tuesday so tomorrow is Wednesday."}, {"viet": "Rẽ phải tại biển báo dừng lại và đi qua hai dãy nhà.", "eng": "Turn right at the stop sign and go two blocks."}, {"viet": "Đến thăm những nơi đáng quan tâm và địa điểm lịch sử.", "eng": "Visiting places of interest and historical site."}, {"viet": "Chúng tôi muốn uống nước khoáng và một ít đá cục.", "eng": "We'd like some mineral water and some ice cubes."}, {"viet": "Chúng tôi luôn luôn tìm kiếm nhân tài mới.", "eng": "We're always looking for new talent."}, {"viet": "Chúng tôi sẽ biệt phái một nhóm y tá mới đến khu vực bị tổn hại nhiều nhất.", "eng": "We're sending a fresh draft of nurses to the worst hit area."}, {"viet": "Chúng tôi sống ở đây đã ngót một năm.", "eng": "We've lived here for the better part of a year."}, {"viet": "Chúng tôi rất trân trọng đơn đặt hàng lớn mà các ông dành cho chúng tôi, nhưng mức chiết khấu do các ông đề nghị thì vượt quá khả năng của chúng tôi rồi.", "eng": "We appreciate the large order that you would give us, but the discount you suggested is beyond our reach."}, {"viet": "Chúng ta yếu hơn con vật này và chậm hơn con vật kia.", "eng": "We are weaker than some and slower than others."}, {"viet": "Chúng ta có thể cùng ra đi-giả sử ( là ) những người khác không đến muộn.", "eng": "We can all leave together-assuming ( that ) the others aren't late."}, {"viet": "Chúng tôi tiếp tục đi ngựa lên núi.", "eng": "We continued up the mountain on horseback."}, {"viet": "Chúng tôi không rõ sự việc xảy ra ngẫu nhiên hay cố ý.", "eng": "We don't know if it was done by accident or by design."}, {"viet": "Chúng tôi cấp mỗi năm ba học bổng nghiên cứu sinh.", "eng": "We give three research fellowships a year."}, {"viet": "Chúng tôi phải ép sát vào nhau để có chỗ cho những người khác muốn đi thang máy.", "eng": "We had to squash up to make room for the others who wanted to use the lift."}, {"viet": "Chúng ta có bánh yến mạch, bánh bột ngô, bánh lúa mì cắt nhỏ, và bánh gạo xốp.", "eng": "We have oatmeal, cornflakes, shredded wheat, and puffed rice."}, {"viet": "Suốt cả ngày thứ bảy chúng tôi làm rất ít.", "eng": "We just dossed around all day Saturday."}, {"viet": "Chúng tôi sao các đĩa máy tính cho an toàn tránh các rủi ro.", "eng": "We make copies of our computer disks as a safeguard against accidents."}, {"viet": "Chúng ta không thể bỏ qua thực tế là.", "eng": "We must not lose sight of the fact that."}, {"viet": "Chúng tôi chỉ đợi có vài phút mà tưởng như là mấy tiếng đồng hồ.", "eng": "We only waited a few minutes but it seemed like hours."}, {"viet": "Chúng tôi ngồi trên cỏ để ăn ở ngoài trời.", "eng": "We sat on the grass to have our picnic."}, {"viet": "Chúng tôi chẻ gỗ thành những miếng dài và mỏng.", "eng": "We split the wood into long thin pieces."}, {"viet": "Chúng tôi đã đợi ba tiếng đồng hồ, suốt thời gian đó hy vọng có ai đó sẽ đến đón chúng tôi.", "eng": "We waited for three hours, all the while hoping that someone would come and fetch us."}, {"viet": "Chúng tôi được cổ vũ bởi con số thất nghiệp giảm.", "eng": "We were heartened by the fall in the unemployment figures."}, {"viet": "Chúng ta thắng trận mà không bị thương vong gì.", "eng": "We won the battle without any casualties."}, {"viet": "Ủa, Trời ơi! không bao giờ tôi nghĩ là lại được gặp anh.", "eng": "Well, I'm blowed! I never thought I'd see you again."}, {"viet": "À, chúng ta có thể nói chuyện với một số khách hàng mà chúng ta chọn và cho họ xem mẫu hàng.", "eng": "Well, we could talk to some selected customers and show them the prototype."}, {"viet": "Tôi nghe nói cô sắp lấy chồng, chuyện này là thế nào?", "eng": "What's this I hear about your getting married?"}, {"viet": "Ông sẽ chuyển đổi gì, tiền giấy hay ngân phiếu du lịch?", "eng": "What are you going to convert, bank notes or traveler's cheques?"}, {"viet": "Bạn nghĩ gì về việc tặng quà theo thông tục?", "eng": "What do you think about customary gift giving?"}, {"viet": "Con có điều gì muốn nói với cha, hả con?'vị cha cố hỏi.", "eng": "What is it you want to tell me, my son?'asked the priest."}, {"viet": "Môn thể thao Thế Vận Hội bạn yêu thích là môn gì?", "eng": "What is your favorite Olympic sport?"}, {"viet": "Cái gì khiến anh ta hành động như vậy?", "eng": "What possesses him to act in this manner?"}, {"viet": "Bạn thích nhất chương trình tivi nào?", "eng": "What TV programmes do you like most?"}, {"viet": "Cô nghĩ khi nào ông ấy sẽ trở lại?", "eng": "When do you expect him back?"}, {"viet": "Khi tôi thấy ngọn lửa, tôi đã hành động theo bản năng và ném chiếc chăn trùm lên ngọn lửa.", "eng": "When I saw the flames I acted on instinct and threw a blanket over them."}, {"viet": "Khi người gác quay lưng đi, chị ta liền trốn thoát.", "eng": "When the guard's back was turned, she made her escape."}, {"viet": "Khi anh ốm, ý muốn hồi phục sức khoẻ nhiều khi là điều quan trọng nhất.", "eng": "When you're ill, wanting to get well again is often half the battle."}, {"viet": "Chiếc bếp đó nối với ống dẫn hơi đốt ở chỗ nào?", "eng": "Where does the cooker connect with the gas-pipe?"}, {"viet": "Anh nghĩ đây là triệu chứng của căn bệnh gì?", "eng": "Which illness do these symptoms suggest to you?"}, {"viet": "Những bức tường trắng các ngôi nhà được mặt trời ban mai mạ vàng.", "eng": "White walls of houses gilded by the morning sun."}, {"viet": "Cô gái tóc vàng mà tôi trông thấy đi với cậu tối qua là ai vậy?", "eng": "Who was the blonde I saw you with last night?"}, {"viet": "Tại sao bạn không trực tiếp hỏi họ?", "eng": "Why don't you ask them directly?"}, {"viet": "Liệu tất cả chúng ta sẽ sống tới năm 2000 không, đó là một câu hỏi rất khó trả lời.", "eng": "Will we all survive until the year 2000, that's the sixty-four thousand dollar question."}, {"viet": "Đoạt được một huy chương vàng Olympic, tôi cho rằng đó là giờ phút trọng đại nhất cuộc đời tôi.", "eng": "Winning an Olympic gold medal was, I suppose, the supreme moment of my life."}, {"viet": "Không có giáo hội Cơ Đốc thì Thời Kỳ Đen Tối chắc sẽ còn tối tăm hơn.", "eng": "Without the Christain Church the Dark Ages would have been much darker than they were."}, {"viet": "Ông có thích uống một ít rượu vang không?", "eng": "Would you care for some wine?"}, {"viet": "Xin mời ông xem phòng trưng bày của chúng tôi nhé?", "eng": "Would you like to see our showroom?"}, {"viet": "Các mảnh vụn của chiếc máy bay vung vãi khắp trên một vùng rộng.", "eng": "Wreckage of the aircraft was scattered over a wide area."}, {"viet": "Có, tôi thích điệu đó hơn bất kỳ điệu nào khác.", "eng": "Yes, I like it better than anything else."}, {"viet": "Bây giờ em nên đi nếu em muốn mua bánh mì, hôm nay là ngày cửa hàng đóng cửa sớm.", "eng": "You'd better go now if you want some bread, it's an early closing day today."}, {"viet": "Anh sẽ không bao giờ thuyết phục được công nhân về những thay đổi kiểu đó đâu.", "eng": "You'll never sell changes like that to the work-force."}, {"viet": "Anh lại quên ngày sinh của tôi rồi, đồ khỉ!", "eng": "You've forgotten my birthday again, you brute!"}, {"viet": "Để có được sự kích động và nguy hiểm thì không có gì bằng đua xe.", "eng": "You can't beat motor racing for excitement and danger."}, {"viet": "Anh có thể ép buộc sự phục tùng nhưng không thể ép buộc được lòng thương yêu.", "eng": "You can compel obedience, but not affection."}, {"viet": "Chắc chắn anh không thể coi đó là đồng lương công bằng.", "eng": "You cannot in all conscience regard that as fair pay."}, {"viet": "Cậu đến đây thật vừa đúng-tàu sắp chạy rồi.", "eng": "You got here in the nick of time-the train's just leaving."}, {"viet": "Ông biết rồi đấy, đúng là người ta không hiểu người già mà.", "eng": "You know, people just don't understand old men."}, {"viet": "Anh phải nhận những hậu quả về hành động của anh.", "eng": "You must accept the consequences of your action."}, {"viet": "Bà không được mở cửa lò nướng ra trước khi bánh chín.", "eng": "You mustn't open the oven door before the cake is ready."}, {"viet": "Anh phải là một diễn viên mới phải, anh đã theo sai nghề rồi.", "eng": "You should be an actor, you're missed your vocation."}, {"viet": "Ông không nên rút tiền trước ngày đáo hạn.", "eng": "You shouldn't withdraw your funds before maturity date."}, {"viet": "Anh sẽ phải học hành chăm chỉ nếu anh muốn theo đuổi nghề luật sư.", "eng": "You will have to study hard if you intend to follow the law."}, {"viet": "Chữ ký duyệt của ông không nhất quán với chữ ký mẫu.", "eng": "Your countersign is inconsistent with the specimen signature."}, {"viet": "Tuyên bố của anh trái ngược với những bằng chứng còn lại.", "eng": "Your statement is in conflict with the rest of the evidence."}]