[{"viet": "Một quyển sách sẽ cho anh biết tất cả những gì anh cần biết về thuế cá nhân.", "eng": "A book which tell you all you need to know about personal taxation."}, {"viet": "Một bức tượng nhỏ bằng sứ hình cô gái chăn cừu đứng ở trên bàn.", "eng": "A china statuette of a shepherdess stood on the table."}, {"viet": "Một sự cố được xếp đặt để cố ý đánh lạc hướng báo chí.", "eng": "A contrived incident intended to mislead the newspapers."}, {"viet": "Một cảm giác uể oải lan tràn trong các tầng lớp lao động.", "eng": "A deeply-felt malaise among the working classes."}, {"viet": "Một cái áo đầm có cổ xẻ.", "eng": "A dress with a plunging neckline."}, {"viet": "Một phim có nhiều diễn viên nổi tiếng.", "eng": "A film with a distinguished cast."}, {"viet": "Một phong cách nhã nhặn, trầm tĩnh và khiêm tốn.", "eng": "A gentle, quiet and unassuming manner."}, {"viet": "Một nhóm sao được gọi là một chòm sao.", "eng": "A group of stars is called a constellation."}, {"viet": "Một kỳ nghỉ thảnh thơi, không vướng trách nhiệm nào hết.", "eng": "A holiday free from all responsibilities."}, {"viet": "Vì thiếu sự quan tâm của công ty nên chi nhánh đó trở thành đứa con rơi.", "eng": "A lack of corporate interest has made the subsidiary an orphan."}, {"viet": "Một năm ánh sáng vào khoảng sáu triệu triệu dặm.", "eng": "A light year is about six million miles."}, {"viet": "Một tên tội phạm quan trọng đã điều khiển vụ lừa gạt lớn đó.", "eng": "A major criminal masterminded the huge fraud."}, {"viet": "Con tem một-penny còn nguyên vẹn từ thời nữ hoàng Victoria.", "eng": "A mint penny black stamp of Queen Victoria's time."}, {"viet": "Một chính phủ mới được thành lập sau chiến tranh.", "eng": "A new government was set up after the war."}, {"viet": "Một ban giám khảo tại cuộc triển lãm hoa.", "eng": "A panel of judges at the flower show."}, {"viet": "Một cuốn sách hình là quà tặng thích hợp cho một đứa bé.", "eng": "A picture book is a suitable form of gift for a young child."}, {"viet": "Một thứ bột tẩy các vết bẩn.", "eng": "A powder that dissolves stains away."}, {"viet": "Một cá tính đồng bóng, lúc thì lạnh lùng ngang bướng, lúc thì cực kỳ mềm yếu.", "eng": "A quicksilver character, cool and willful at once moment, utterly fragile the next."}, {"viet": "Giá xăng dầu tăng làm giảm sút thị trường xe hơi.", "eng": "A rise in oil prices depresses the car market."}, {"viet": "Một chiếc xe cũ với công-tơ-mét chỉ 20.000 dặm.", "eng": "A second-hand car with 20,000 miles on the clock."}, {"viet": "Một quả táo duy nhất lủng lẳng trên cây.", "eng": "A single apple hanging from the tree."}, {"viet": "Một người gieo mối bất bình trong thiên hạ.", "eng": "A sower of discontent among the people."}, {"viet": "Một cuộc đình công khiến nhiều nhà máy phải đóng cửa.", "eng": "A strike has shut down several car factories."}, {"viet": "Nhiệt độ 10 độ C âm.", "eng": "A temperature of minus ten degrees centigrade."}, {"viet": "Một cú rờ-ve dùng cả hai tay về quần vợt.", "eng": "A two-fisted backhand stroke in tennis."}, {"viet": "Một ổ bánh mì trắng có lớp vỏ vàng bên ngoài.", "eng": "A white loaf, with brown crust."}, {"viet": "Nhận một món quà, một lời khuyên, một lời xin lỗi.", "eng": "Accept a gift, a piece of advice, an apology."}, {"viet": "Điều chỉnh độ kênh của một cái bàn viết.", "eng": "Adjusting the tilt of a writing table."}, {"viet": "Sau nhiều ngày tự vấn lương tâm cuối cùng anh ta đã đi đến quyết định bỏ nhà ra đi.", "eng": "After days of soul-searching he finally came to the decision to leave home."}, {"viet": "Sau sáu tháng luyện tập, toàn đội rất sung sức.", "eng": "After six months training, the whole team is in superb form."}, {"viet": "Những cái tên gọi đã được thống nhất cho nhiều loại cá khác nhau.", "eng": "Agreed denominations for various species of fish."}, {"viet": "Tất cả những người đưa đám tang đều mặc đồ đen.", "eng": "All of the mourners are dressed in black."}, {"viet": "Tất cả những dấu hiệu của một tâm trí đầy lo lắng.", "eng": "All the signs of an unquiet mind."}, {"viet": "Nhớ luôn luôn cất bằng lái xe ở nơi an toàn.", "eng": "Always keep your driving license in a safe place."}, {"viet": "Một kế hoạch đầy tham vọng hết sức phiêu lưu.", "eng": "An ambitious plan of great daring."}, {"viet": "Một người say mê các loại nhạc pop.", "eng": "An enthusiast about all kinds of pop music."}, {"viet": "Một nhược điểm vốn có trong mẫu thiết kế.", "eng": "An inherent weakness in a design."}, {"viet": "Một việc tiêu pha bừa bãi trước dịp lễ Giáng Sinh.", "eng": "An orgy of spending before Christmas."}, {"viet": "Và chúng tôi cũng cần một cái ghế dành cho trẻ em.", "eng": "And we will need a child seat."}, {"viet": "Bất kỳ nhân vật nổi tiếng nào cũng có nguy cơ là mục tiêu chế giễu của báo chí bình dân.", "eng": "Any public figure risks being made on Aunt Sally by the popular press."}, {"viet": "Có phải cảnh sát đang cố ỉm đi một số bằng chứng không?", "eng": "Are the police suppressing some evidence?"}, {"viet": "Anh có về nhà nhân dịp lễ Giáng sinh không?", "eng": "Are you going home for Christmas?"}, {"viet": "Con không thấy ân hận về chuyện con đã làm sao?", "eng": "Aren't you sorry for what you've done?"}, {"viet": "Về khách sạn, nó rất không thoải mái và cách xa biển nhiều dặm.", "eng": "As for the hotel, it was very uncomfortable and miles from the sea."}, {"viet": "Khi anh lớn tuổi hơn nữa, thái độ của anh đối với cái chết sẽ thay đổi.", "eng": "As you get older your attitude towards death changes."}, {"viet": "Ở trường, cô ta đã tạo nên mối quan hệ bạn bè thân thiết với những bạn gái khác.", "eng": "At school she formed a close friendship with several other girls."}, {"viet": "Ngừa thảm họa bằng hành động tức thời.", "eng": "Avert a disaster by prompt action."}, {"viet": "Hãy cẩn thận tuân thủ những phép tắc.", "eng": "Be careful to observe the proprieties."}, {"viet": "Hãy nhớ viết thư và báo tin tức của anh cho tôi nhé.", "eng": "Be sure to write and tell me all your news."}, {"viet": "Vì ít tiền nên tôi đành vui vẻ mà bỏ hút thuốc.", "eng": "Being short of money, I made a virtue of necessity and gave up smoking."}, {"viet": "Những vết sơn lấm chấm trên khắp vải vẽ.", "eng": "Blobs of paint were dotted around the canvas."}, {"viet": "Điều chỉnh vật thể vào đúng tiêu cự nếu bạn muốn có một tấm hình nét.", "eng": "Bring the object into focus if you want a sharp photograph."}, {"viet": "Nhưng bạn có nghĩ mặc cái áo đầm này chói mắt quá không?", "eng": "But do you think it is too loud in this dress?"}, {"viet": "Nhưng dầu sao môn bóng đá cũng thâm nhập vào nước này.", "eng": "But somehow football has caught on in this country."}, {"viet": "Bằng cách bắn vài phát súng chúng tôi có thể bất ngờ làm họ lộ vị trí của mình.", "eng": "By firing a few shots we can surprise them into revealing their positions."}, {"viet": "Sự kêu gọi có hành động cứng rắn do lãnh đạo công đoàn đưa ra.", "eng": "Calling for firm action by the union leadership."}, {"viet": "Người ta có thể thuyết phục được bà ta bán căn nhà đó không?", "eng": "Can she be persuaded to sell the house?"}, {"viet": "Cậu có thể đoán cô ta bao nhiêu tuổi hay không?", "eng": "Can you guess how old she is?"}, {"viet": "Xin cô vui lòng cho tôi biết sơ qua về công ty của cô được không?", "eng": "Can you tell me the background of your company?"}, {"viet": "Thoáng thấy cô ta, hắn phóng chạy.", "eng": "Catching sight of her, he broke into a run."}, {"viet": "Trẻ con làm cho một số người lớn cảm thấy khó chịu.", "eng": "Children make some people feel uncomfortable."}, {"viet": "Bám lấy cái gì như đỉa.", "eng": "Cling to something like a limpet."}, {"viet": "Xét về hiệu quả kinh tế, vở kịch đã thất bại dù các nhà phê bình rất thích nó.", "eng": "Commercially, the play was a failure, though the critics loved it."}, {"viet": "Hiến cuộc đời mình cho việc làm dịu bớt nỗi thống khổ.", "eng": "Consecrate one's life to the relief of suffering."}, {"viet": "Ông có thể đến khoảng 7 giờ được không?", "eng": "Could you come about 7 o'clock?"}, {"viet": "Xin ông vui lòng xếp hàng đợi đến khi có bàn trống?", "eng": "Could you wait in line until a table is free, please?"}, {"viet": "Bố ơi, con muốn ăn bắp rang.", "eng": "Dad, I want to eat popcorn."}, {"viet": "Giao hàng không tính cước phí nếu hàng hóa được trả tiền trước.", "eng": "Delivery is free of charge if goods are paid for in advance."}, {"viet": "Những diễn biến làm thiệt hại đến tương lai của công ty.", "eng": "Developments prejudicial to the company's future."}, {"viet": "Bạn có đọc mục cô ta viết trên tờ báo hôm nay không?", "eng": "Did you read her piece in today's paper?"}, {"viet": "Chia 7 cho 2 thì đáp số là 3 với số dư là 1.", "eng": "Divide 2 into 7, and the answer is 3, with remainder 1."}, {"viet": "Ở New York có bão tuyết không?", "eng": "Do they have snowstorms in New York?"}, {"viet": "Ông có đồng 50 xu không?", "eng": "Do you have a 50p piece?"}, {"viet": "Anh có đồng ý về việc khoả thân trên sân khấu không?", "eng": "Do you hold with nudity on the stage?"}, {"viet": "Chị có phiền không nếu em tống lũ trẻ đến chỗ chị chiều nay?", "eng": "Do you mind if I unload the children onto you this afternoon?"}, {"viet": "Anh có cho rằng trời sắp mưa không?", "eng": "Do you think that it's going to rain?"}, {"viet": "Đạo Cơ Đốc đóng một vai trò quan trọng ở nước bạn phải không?", "eng": "Does Christianity play an important role in your country?"}, {"viet": "Đừng hỏi tôi về vấn đề tiền nong trong gia đình: đó là chuyện vợ tôi lo.", "eng": "Don't ask me about our finances: that's my wife's department."}, {"viet": "Đừng quên ghi ngày tháng trên tấm séc của bạn.", "eng": "Don't forget to date your cheque."}, {"viet": "Đừng hiểu lầm điều tôi đang cố diễn đạt.", "eng": "Don't misunderstand what I'm trying to say."}, {"viet": "Đừng có lấy chân day tàn thuốc vào tấm thảm của tôi!", "eng": "Don't tread your ash into my carpet!"}, {"viet": "Nương tựa được vào gia đình ai.", "eng": "Draw support from one's family."}, {"viet": "Mỗi người chịu trách nhiệm về các cách sắp xếp của chính mình.", "eng": "Each individual person is responsible for his own arrangements."}, {"viet": "Anh và Xcốt-len không có một hệ thống pháp luật thống nhất.", "eng": "England and Scotland do not have a unified legal system."}, {"viet": "Đã 10 năm rồi mà anh vẫn nhớ gương mặt của cô ấy sao!", "eng": "Even though it has been 10 years, you remembered her face!"}, {"viet": "Điều khiển việc đổi tiền nghĩa là điều khiển chính thức việc buôn bán ngoại hối đối của một đất nước.", "eng": "Exchange control means official control in the foreign exchange dealings of a country."}, {"viet": "Việc đuổi học là một hình thức khắt khe.", "eng": "Expulsion from school is a harsh form of punishment."}, {"viet": "Nỗi sợ hãi luôn luôn ám ảnh những người bị bắt làm con tin.", "eng": "Fear was the hostage's constant companion."}, {"viet": "Hãy xem đó là ai và nói với người ấy là tôi sẽ gọi lại.", "eng": "Find out who it is and tell him I'll call back."}, {"viet": "Giới nhà báo rất thích chuyện tai tiếng rùm beng.", "eng": "Fleet Street loves a good scandal."}, {"viet": "Với New York đó là 25.", "eng": "For New York it's 25."}, {"viet": "Những lời rỉ tai thường xuyên hay làm cho quần chúng phẫn nộ vì thần kinh của họ vốn đã bị cực kỳ căng thẳng trong thời buổi hiện nay.", "eng": "Frequent asides that are often exasperating to today's more stressed-out public."}, {"viet": "Trầm ngâm nhìn đăm đăm ra ngoài cửa sổ.", "eng": "Gazing ruminatively out of the window."}, {"viet": "Cho một tội phạm hưởng một án treo.", "eng": "Give a criminal a suspended sentence."}, {"viet": "Dán hai miếng gỗ lại với nhau.", "eng": "Glue two pieces of wood to together."}, {"viet": "Nổi điên lên khi thấy vết lõm đó trên xe ô tô của mình.", "eng": "Got mental when he saw the dent in his car."}, {"viet": "Những trẻ em tàn tật cần sự giúp đỡ của ông-xin ông cho rộng rãi.", "eng": "Handicapped children need your help-please give generously."}, {"viet": "Chúng ta có đủ tách cho mọi người không?", "eng": "Have we enough cups to go round?"}, {"viet": "Bạn có bao giờ đến chỗ bà đồng hay thầy bói chưa?", "eng": "Have you ever visited a psychic or a fortune-teller?"}, {"viet": "Hôm nay bạn có liều ra ngoài chưa?", "eng": "Have you ventured abroad yet today?"}, {"viet": "Nó là một thằng thật sự độc ác, để vợ sống như vậy.", "eng": "He's a real bastard, leaving his wife in that way."}, {"viet": "Nó đã được tạm tha ra khỏi nhà giam theo chế độ quản chế.", "eng": "He's been released from prison on probation."}, {"viet": "Anh ta có thói gọi điện bất kể giờ nào ban ngày hoặc ban đêm.", "eng": "He's inclined to telephone at all hours of the day or night."}, {"viet": "Ông ta là một con người khá bất thường trong đám hàng xóm láng giềng.", "eng": "He's something of an oddity in the neighbourhood."}, {"viet": "Hắn thú nhận đã đánh cắp chiếc xe hơi.", "eng": "He admitted having stolen the car."}, {"viet": "Nó chen ngang lấn lên trước tôi khi xếp hàng.", "eng": "He barged past me in the queue."}, {"viet": "Hắn va đầu vào cái kệ khi đứng dậy.", "eng": "He butted his head against the shelf as he was getting up."}, {"viet": "Hắn khẳng định là vũ khí đã được gài sẵn.", "eng": "He claimed that the weapons had been planted."}, {"viet": "Anh ấy ho ra máu hoài.", "eng": "He'd been coughing up blood."}, {"viet": "Ông ta đã gác điện thoại để khỏi bị làm phiền.", "eng": "He disconnected the phone so as not to be disturbed."}, {"viet": "Nó thích nhạo báng người khác.", "eng": "He enjoys poking fun at others."}, {"viet": "Anh ta cảm thấy mình nhận thức đầy đủ về môi trường của mình.", "eng": "He felt wide awake to his surroundings."}, {"viet": "Ông ấy véo tai thằng bé một cái đau.", "eng": "He gave the boy's ear a painful tweak."}, {"viet": "Anh ấy bị cảm lạnh và bị nghẹt cứng mũi.", "eng": "He had a cold and was very congested."}, {"viet": "Hầu như không bao giờ anh ta đi ngủ trước nửa đêm.", "eng": "He hardly ever goes to bed before midnight."}, {"viet": "Ông ấy đã sống sót qua hai thế chiến.", "eng": "He has come through two world wars."}, {"viet": "Ông ta đã giành được sự công nhận rộng rãi trong lĩnh vực y học ở vùng nhiệt đới.", "eng": "He has won wide recognition in the field of tropical medicine."}, {"viet": "Anh ấy có khả năng là tuyển thủ cho đội tuyển quốc gia.", "eng": "He is a probable for the national team."}, {"viet": "Anh ta bị bại liệt từ thắt lưng trở xuống.", "eng": "He is paralyzed from the waist down."}, {"viet": "Anh ấy cứ thò mặt ra không đúng chỗ chút nào.", "eng": "He keeps bobbing up in the most unlikely places."}, {"viet": "Ông ta thích lên mặt ra vẻ ta đây đối với nhân viên cấp dưới.", "eng": "He likes to lord it over the junior staff."}, {"viet": "Anh ta cúi đầu chào và ra khỏi phòng.", "eng": "He made a bow and left the room."}, {"viet": "Chắc là anh ta khờ lắm mới bị cái trò cũ rích ấy lừa gạt.", "eng": "He must have been pretty gullible to fall for that old trick."}, {"viet": "Anh ấy bước lên bước xuống một cách lơ đãng.", "eng": "He paced up and down distractedly."}, {"viet": "Nó làm ra vẻ mình đã từng trải nhưng thực ra nó còn non nớt lắm.", "eng": "He pretends he's been around but he's really very immature."}, {"viet": "Nó đã bỏ nhà đi từ năm mười ba tuổi.", "eng": "He ran away from home at the age of thirteen."}, {"viet": "Anh ấy kể lại lời khai của cô ta từng chữ một.", "eng": "He repeated her statement word for word."}, {"viet": "Ông ta là người đắn đo trong lời nói.", "eng": "He's a man who measures his words."}, {"viet": "Anh ta làm rất tốt phải không?", "eng": "He's done very well, hasn't he?"}, {"viet": "Ông ta không phải là người có thể xem thường được.", "eng": "He's not a man to be trifled with."}, {"viet": "Anh ta rất khéo chăm sóc con cái.", "eng": "He's very good with children."}, {"viet": "Anh ta ít khi kiếm đủ để nuôi thân và gia đình mình.", "eng": "He scarcely earns enough to keep himself and his family."}, {"viet": "Anh ta hích vai qua một hậu vệ và sút bóng vào gôn.", "eng": "He shouldered off a defender and shot at goal."}, {"viet": "Ông ấy nói tiếng Pháp thành thạo như một người Pháp.", "eng": "He speaks French well enough to pass for a Frenchman."}, {"viet": "Anh ta vẫn mắc một ít lỗi nhưng tôi nghĩ là anh ta đã áp dụng đúng phương pháp.", "eng": "He still makes a few mistakes but I reckon he's got the right idea."}, {"viet": "Anh ấy chuyển từ lạc quan cuồng nhiệt sang tuyệt vọng hoàn toàn.", "eng": "He swings from wild optimism to total despair."}, {"viet": "Anh ta kể với tôi cưỡi ngựa đã làm anh ta có chân vòng kiềng.", "eng": "He told me it was horse-riding that had made him bandy legged."}, {"viet": "Nó tỏ ra bướng bỉnh đương đầu khi cảnh sát hỏi cung nó.", "eng": "He tried to brave it out when the police questioned him."}, {"viet": "Trước đây anh ta thường đi chơi rong đường phố hàng giờ liên tục.", "eng": "He used to roam the streets for hours on end."}, {"viet": "Anh ta có thể phát triển hết khả năng của mình qua âm nhạc.", "eng": "He was able to fulfil himself though music."}, {"viet": "Anh ta bị trói vào ghế và bị bỏ đó.", "eng": "He was bound to a chair and left."}, {"viet": "Máu anh ta chảy giọt trên sàn nhà.", "eng": "He was dripping blood onto the floor."}, {"viet": "Nó bị hôn mê hàng mấy tuần.", "eng": "He was in a coma for several weeks."}, {"viet": "Ông ta là một trong những người hoạch định nòng cốt của cuộc cách mạng.", "eng": "He was one of the principal architects of the revolution."}, {"viet": "Anh ấy ngồi nhìn ra ngoài cửa sổ.", "eng": "He was sitting looking out of the window."}, {"viet": "Anh ta cố làm ra vẻ quan trọng nhưng tất cả chúng tôi đều phản đối.", "eng": "He was trying to be serious, but we all gave him the bird."}, {"viet": "Nó điểm lại trong đầu các sự kiện của ngày hôm đó.", "eng": "He went over the events of the day in his mind."}, {"viet": "Ông ta mặc chiếc áo choàng như là một biểu tượng chức vụ của ông ta.", "eng": "He wore his robes as a token of office."}, {"viet": "Vặn nóng lò nướng lên nhiệt độ 200 độ C.", "eng": "Heat the oven to a temperature of 200 độ C."}, {"viet": "Bài báo của cô ta là lời phản kháng kịch liệt với những người phê bình cô.", "eng": "Her article was a counterblast to her critics."}, {"viet": "Bài luận của cô ta khá hay nhưng không đạt xuất sắc.", "eng": "Her composition is competent but not excellent."}, {"viet": "Mặt nàng sa sầm xuống khi hay tin.", "eng": "Her face fell when she heard the news."}, {"viet": "Mũ cô ta màu đỏ, cũng như các quần áo khác của cô.", "eng": "Her hat was red, like the rest of her clothes."}, {"viet": "Cuốn tiểu thuyết mới nhất của cô ấy được độc giả khen ngợi hết lời.", "eng": "Her latest novel was received with great éclat."}, {"viet": "Quyển tiểu thuyết của bà ta mô tả cuộc sống ở Luân Đôn hiện đại.", "eng": "Her novel depicts life in modern London."}, {"viet": "Sự tiếp nhận bà ta vào dòng tu.", "eng": "Her reception into the religious order."}, {"viet": "Tinh thần cô ấy rất sa sút.", "eng": "Her spirits were at a very low ebb."}, {"viet": "Tác phẩm của bà ta tràn ngập nỗi luyến tiếc thời xa xưa.", "eng": "Her work is pervaded by nostalgia for a past age."}, {"viet": "Gió mạnh tạo ứng suất lớn lên cấu trúc đó.", "eng": "High winds put great stress on the structure."}, {"viet": "Thái độ của anh ta thay đổi đột ngột.", "eng": "His attitude underwent an abrupt transition."}, {"viet": "Con cái của ông ta cho rằng lao động là một điều đáng khinh!", "eng": "His children think that work is a dirty word!"}, {"viet": "Bằng lái xe của ông ta đã bị thu hồi sau vụ đâm xe đó.", "eng": "His driving license was revoked after the crash."}, {"viet": "Cha anh ta cấp cho anh ta một nền giáo dục tốt.", "eng": "His father provided him with a good education."}, {"viet": "Tim hắn ngừng đập khi nghe phán quyết đáng sợ của quan toà.", "eng": "His heart sank as he listened to the judge uttering the fateful words."}, {"viet": "Cuộc nói chuyện của ông ta có kèm theo vài hình ảnh hấp dẫn.", "eng": "His lecture was accompanied by some striking visuals."}, {"viet": "Quyển sách mới của ông ta sẽ xuất bản vào mùa xuân.", "eng": "His new book will be appearing in the spring."}, {"viet": "Những quan điểm chính trị của ông ta đượm vẻ quá khích.", "eng": "His political views have a savour of fanaticism."}, {"viet": "Tính hài hước của cậu ta là một thứ đệm hữu ích khi công việc xấu đi.", "eng": "His sense of humour was a useful buffer when things were going badly for him."}, {"viet": "Khi sự nổi tiếng của anh ta giảm xuống, những người ủng hộ anh ta đã bỏ rơi anh ta.", "eng": "His supporters fell away as his popularity declined."}, {"viet": "Trong chúc thư của mình ông ấy đã đặt ra các khoản uỷ thác dành cho con cái của ông.", "eng": "His will he created trusts for his children."}, {"viet": "Mứt nhà làm thường ngon hơn các loại bạn mua ngoài cửa hàng.", "eng": "Home-made jam is usually better than the kinds you buy in the shops."}, {"viet": "Trong những ngày nghỉ chúng ta sẽ đi sang Pháp chứ?", "eng": "How about going to France for our holidays?"}, {"viet": "Sao cậu có thể thiếu thận trọng đến thế?", "eng": "How could you have been so inconsiderate?"}, {"viet": "Anh muốn uống cà phê thế nào?''Xin cho tôi nửa nọ nửa kia'.", "eng": "How do you like your coffee?''Half-and-half please'."}, {"viet": "Chúng ta đã đi được bao lâu rồi?", "eng": "How long have we been going?"}, {"viet": "Anh có bao nhiêu công nhân đang làm việc ở đây?", "eng": "How many men do you have working here?"}, {"viet": "Một năm công ty kiếm được bao nhiêu?", "eng": "How much does the company make a year?"}, {"viet": "Cô ấy sẽ sinh sống ra sao khi người chồng đã mất?", "eng": "How will she manage with her husband gone?"}, {"viet": "Tiếng cười, tiếng khóc, tiếng gào thét, v. v. cuồng loạn hành vi quá khích.", "eng": "Hysterical laughter, weeping, screaming, etc hysterical behaviour."}, {"viet": "Tôi muốn mua về nhà vài bức tranh vẽ hoa và chim.", "eng": "I'd like to take back home some paintings of flowers and birds."}, {"viet": "Tôi sẽ nói thư kí của tôi gửi thư điện tử cho anh với đầy đủ chi tiết.", "eng": "I'll get my secretary to email you with an the details."}, {"viet": "Bác sẽ đón cháu ở trước cổng trường.", "eng": "I'll pick you up in front of the school gate."}, {"viet": "Tôi e rằng tôi không biết tí gì về việc làm vườn cả.", "eng": "I'm afraid I don't know the first thing about gardening."}, {"viet": "Tôi mới nghĩ sơ sơ đến chuyện kiếm việc làm ở Trung Quốc.", "eng": "I'm flirting with the idea of getting a job in China."}, {"viet": "Tôi đang gặp khó khăn, anh có thể giúp đỡ tôi thoát ra khỏi nó không?", "eng": "I'm in a rather tricky position, can you help me out?"}, {"viet": "Tôi không phải là người cố vấn cách phải làm công việc đó.", "eng": "I'm not the person to recommend how the job should be done."}, {"viet": "Tôi rất tiếc đã xúc phạm đến anh, tôi không cố ý.", "eng": "I'm sorry I offended you, it wasn't my intention."}, {"viet": "Tôi mệt vì những lời than phiền không ngớt của anh.", "eng": "I'm tired of your never-ending complaints."}, {"viet": "Tôi làm việc vất vả trên một cái lò nóng suốt buổi sáng.", "eng": "I've been labouring aways over a hot stove all morning."}, {"viet": "Tôi có tất cả các bản giao hưởng của Beethoven ghi âm.", "eng": "I've got all the Beethoven symphonies on tape."}, {"viet": "Tôi chưa hề nghe chuyện gì vô lý đến thế!", "eng": "I've never heard anything so ridiculous!"}, {"viet": "Tôi e rằng không thể giúp bạn lúc này được tôi bận quá.", "eng": "I'm afraid I can't help you just at present I'm too busy."}, {"viet": "Tôi luôn luôn thăm họ mỗi khi tôi đến thành phố.", "eng": "I always visit them if I go to the city."}, {"viet": "Tôi chán ngấy với các cuộc tranh cãi không ngừng của các anh.", "eng": "I am tired of your eternal arguments."}, {"viet": "Tôi đã bắt đầu đi học lúc năm tuổi.", "eng": "I began school when I was five."}, {"viet": "Với tiền lương của tôi thì không thể có ô tô được.", "eng": "I can't afford to run a car on my salary."}, {"viet": "Tôi không thể hứa, nhưng tôi sẽ làm hết sức mình.", "eng": "I can't promise, but I'll do my best."}, {"viet": "Tôi có thể nghe ông ta đi tới đi lui trong phòng ngủ suốt đêm.", "eng": "I can hear him prowling around in his bedroom all night."}, {"viet": "Tôi thật sửng sốt về mức độ thô lỗ của cô ấy.", "eng": "I can't get over how rude she was."}, {"viet": "Tôi có thể viện dẫn ra nhiều lý do về cách ứng xử lạ kỳ của anh ta.", "eng": "I could adduce several reasons for his strange behaviour."}, {"viet": "Tôi đoán cô ta trạc 30 tuổi.", "eng": "I'd guess her to be about 30."}, {"viet": "Tôi không ngờ sự đối xử không tốt như vậy lại do anh.", "eng": "I did not expect such unkind treatment at your hands."}, {"viet": "Tôi không muốn chê trách lòng chân thành của anh.", "eng": "I do not wish to reflect upon your sincerity."}, {"viet": "Em không biết tại sao nhưng không khí ở đó làm cho nó có vẻ là một nơi nghỉ ngơi thoải mái.", "eng": "I don't know why but the ambiance makes it seem like a relaxing place."}, {"viet": "Tôi cho rằng mối quan hệ thân thích này sẽ không đi tới đâu, vì người này đã làm cho tôi có linh cảm không tốt.", "eng": "I don't think this relationship will work out, this guy has given me bad vibes."}, {"viet": "Tôi chẳng cần giới thượng lưu nghĩ gì.", "eng": "I don't care what the world thinks."}, {"viet": "Tôi đánh rơi chiếc máy ảnh trên vỉa hè làm nó vỡ tan rồi.", "eng": "I dropped my camera on the pavement and bust it."}, {"viet": "Tôi cảm thấy mình rất già khi thấy thế hệ trẻ ứng xử như thế nào.", "eng": "I feel pretty ancient when I see how the younger generation behaves."}, {"viet": "Tôi thấy công việc này quá buồn tẻ.", "eng": "I find the work heavy going."}, {"viet": "Mỗi buổi sáng, tôi đều đi dạo.", "eng": "I go for a walk every morning."}, {"viet": "Tôi chuyện trò khá lâu với cô ta về việc làm của cô ta.", "eng": "I had a long chat with her about her job."}, {"viet": "Tôi phải ngồi nép vào sát tường.", "eng": "I had to sit squeezed up against the wall."}, {"viet": "Tôi được một công việc, đó một cơ hội lớn.", "eng": "I have been offered a job, it's a great opportunity."}, {"viet": "Tôi đã để ý thấy vài nhân viên đi làm muộn một giờ.", "eng": "I have noticed some employees coming to work an hour late."}, {"viet": "Trước đây tôi chưa đến New York và em gái tôi cũng thế.", "eng": "I haven't been to New York before and neither has my sister."}, {"viet": "Tôi nghe thấy vài tiếng cười khúc khích của thính giả khi tôi bắt đầu nói chuyện.", "eng": "I heard a few cackles from the audience when I started my talk."}, {"viet": "Tôi hy vọng tấm séc này không bị hoàn trả lại.", "eng": "I hope this cheque doesn't bounce."}, {"viet": "Tôi vừa mới đấu bóng bàn với Lưu Lý.", "eng": "I just had a table-tennis match with Liu Li."}, {"viet": "Tôi biết anh không ưa anh ấy nhưng cố gắng tử tế với anh ấy.", "eng": "I know you don't like him but try to be nice to him."}, {"viet": "Tôi thích kiểu chữ viết của bạn.", "eng": "I like your style of handwriting."}, {"viet": "Để bác lấy một ít thuốc cho cháu.", "eng": "I'll get some medicine for you."}, {"viet": "Tôi sẽ cho anh ấy biết là cô đang gọi.", "eng": "I'll tell him you're calling."}, {"viet": "Tôi rất vui mừng là anh đã thành công.", "eng": "I'm delighted at that you succeeded."}, {"viet": "Tôi mong đợi dịp đó lắm.", "eng": "I'm looking forward to the occasion."}, {"viet": "Tôi vẫn chưa hiểu rõ là anh muốn gì.", "eng": "I'm still vague about what you want."}, {"viet": "Tôi chỉ mới gặp chú rể một lát thôi.", "eng": "I met the groom only briefly."}, {"viet": "Tôi phải tranh luận với anh về điểm đó.", "eng": "I must take you that point."}, {"viet": "Tôi không bao giờ trông mong sẽ được gặp lại cô ta.", "eng": "I never thought that I'd see her again."}, {"viet": "Tôi thương những người phải làm việc trong điều kiện tồi tệ như vậy.", "eng": "I pity anyone who has to work in such bad conditions."}, {"viet": "Bây giờ tôi đọc ít hơn nhiều so với hồi đi học.", "eng": "I read much less now than I did at school."}, {"viet": "Tôi tin tưởng anh sẽ nêu một gương tốt.", "eng": "I rely on you to set a good example."}, {"viet": "Tôi thấy đám rước đi ngang qua.", "eng": "I saw the procession pass by."}, {"viet": "Tôi sẽ không có khả năng giải quyết được ( công việc ).", "eng": "I shan't be able to manage the job ( without help )."}, {"viet": "Tôi đã làm bẩn cái cà-vạt của tôi trong lúc ăn trưa.", "eng": "I stained my tie while eating lunch."}, {"viet": "Tôi nói tới mức độ bị khản cổ.", "eng": "I talked until I was hoarse."}, {"viet": "Tôi nghĩ đó là may mắn thôi.", "eng": "I think it was a fluke."}, {"viet": "Tôi nghĩ về vấn đề này hàng ngày trời mới sáng ra được.", "eng": "I thought about the problem for days before I began to see daylight."}, {"viet": "Tôi đã gạt John nghĩ rằng hôm nay cậu ấy cũng phải làm việc thường ngày của tôi.", "eng": "I tricked John into thinking he had to do my chores today also."}, {"viet": "Tôi đã lập gia đình hai lần rồi.", "eng": "I've already been married twice."}, {"viet": "Tôi muốn mượn một cái máy sấy tóc.", "eng": "I want to borrow a hair-dryer."}, {"viet": "Tôi báo cho anh biết, tôi đang mất bình tĩnh đấy.", "eng": "I warn you, I'm rapidly losing patience."}, {"viet": "Tôi được cho việc làm với điều kiện tôi học tiếng Anh.", "eng": "I was given the job on condition that I learnt English."}, {"viet": "Tôi đã được nghỉ hưu hưởng đủ lương.", "eng": "I was retired on full pay."}, {"viet": "Tôi rất cảnh giác với anh ta sau khi tôi thấy anh ta nói dối với Jennifer.", "eng": "I was very leery of him after found out he had lied to Jennifer."}, {"viet": "Tôi sẽ nói thế này về anh ta-anh ta không bao giờ bỏ dở một công việc nào.", "eng": "I will say this much for him-he never leaves a piece of work unfinished."}, {"viet": "Tôi không biết anh ấy sẽ có thể ở Hồng Kong bao nhiêu ngày.", "eng": "I wonder how many days he'll be able to stay in Hong Kong."}, {"viet": "Tôi hiểu đó như là một sự từ chối.", "eng": "I would interpret it as a refusal."}, {"viet": "Tôi không muốn chịu chung số phận với anh ấy.", "eng": "I would not want to share his lot."}, {"viet": "Nếu một cuộc chiến tranh xảy ra, nhiều quốc gia khác sẽ bị ảnh hưởng.", "eng": "If a war breaks out, many other countries will be affected."}, {"viet": "Giá như tôi có thể chỉ thêm một từ vào chỗ này.", "eng": "If I might just put in a word here."}, {"viet": "Nếu công nghiệp không áp dụng những biện pháp hiện đại nó sẽ không tồn tại được.", "eng": "If the industry doesn't modernize it will not survive."}, {"viet": "Nếu anh trao công việc đó cho tôi thì tôi đã có thể làm xong ngay rất sớm.", "eng": "If you'd given the job to me I could have done it in half the time."}, {"viet": "Nếu anh không nhận được thư này thì vui lòng viết để báo cho tôi biết.", "eng": "If you do not receive this letter, please write and tell me."}, {"viet": "Nếu bạn thích tôi sẽ cho bạn mượn nó.", "eng": "If you like, I'll lend it to you."}, {"viet": "Nếu muốn làm giàu thì mua rẻ bán đắt.", "eng": "If you want to make money, buy cheap and sell dear."}, {"viet": "Trong một cuộc phỏng vấn truyền hình, cô ấy đã giáng trả mạnh mẽ những người chỉ trích cô ấy.", "eng": "In a TV interview she hit back at her critics."}, {"viet": "Không trả lại tiền là nó đã phụ lòng tin của chúng tôi.", "eng": "In failing to return the money he betrayed our trust."}, {"viet": "Để tăng cường quan hệ hữu nghị giữa hai công ty của chúng ta, chúng tôi sẽ giảm giá xuống 2%.", "eng": "In order to make our ties of friendship between our two corporations stronger, we would reduce our price by 2%."}, {"viet": "Nếu có tai nạn xảy ra hãy gọi số này.", "eng": "In the event of an accident, call this number."}, {"viet": "Trong cuốn từ điển này điều chú trọng là cách sử dụng dễ dàng.", "eng": "In this dictionary the accent is on ease of use."}, {"viet": "Làm hại sức khoẻ của ai do hút thuốc, uống rượu..", "eng": "Injure one's health by smoking, drinking, etc."}, {"viet": "Có thể xem phòng được không?", "eng": "Is it possible to see the room?"}, {"viet": "Liệu có khả năng nào chúng mình sẽ gặp cậu vào ngày nghỉ cuối tuần này không?", "eng": "Is there any possibility that we'll see you this weekend?"}, {"viet": "Tiệc sẽ được tổ chức vào lúc 6 giờ tối ở khách sạn Grand.", "eng": "It'll be held at 6: 00 p. m., the Grand Hotel."}, {"viet": "Phải nỗ lực tối đa-nếu chúng ta không ghi bàn ngay chúng ta sẽ thua trận này đấy.", "eng": "It's all or nothing-if we don't score now we've lost the match."}, {"viet": "Rất dễ lẫn anh ta với anh trai của anh ta.", "eng": "It's easy to mix him up with his brother."}, {"viet": "Trông cứ như là đánh giá một đàn bò ở hội chợ của tỉnh vậy.", "eng": "It's like judgining a bunch of cow at the country fair."}, {"viet": "Rõ ràng họ đã quyết định không tới, không nhất thiết như vậy có thể chỉ vì họ bị lạc.", "eng": "It's obvious they've decided not to come! Not necessarily, they may simply have got lost."}, {"viet": "Chính những điều nhỏ nhặt làm tôi bực mình.", "eng": "It's the little things that aggravate me."}, {"viet": "Tôi thấy khó chịu khi người ta quên nói cám ơn.", "eng": "It annoys me when people forget to say thank you."}, {"viet": "Đã từ lâu nó là một điểm phong cảnh thu hút quan trọng của thế giới nằm trên biên giới giữa Mỹ và Canađa.", "eng": "It has long been a major scenic attraction of the world which located on the border between the U. S. and Canada."}, {"viet": "Điều quan trọng là sinh viên phải dự tất cả các buổi giảng.", "eng": "It is important for student to attend all the lectures."}, {"viet": "Thông lệ ở Anh là xe cộ lái về bên trái đường.", "eng": "It is the practice in Britain to drive on the left."}, {"viet": "Đó ắt hẳn là một quyết định có tính chính trị.", "eng": "It must have been a political decision."}, {"viet": "Nó là một trong những nơi tôi yêu thích nhất.", "eng": "It's one of my favorite places."}, {"viet": "Sẽ được thôi nếu đèn giao thông thuận lợi cho chúng ta.", "eng": "It should be okay if the lights are with us."}, {"viet": "Đề tất cả những phong bì này mất rất nhiều thời gian.", "eng": "It was a marathon fob addressing all those envelops."}, {"viet": "Cái số anh ta là phải chết nơi đất khách quê người.", "eng": "It was his destiny to die in a foreign country."}, {"viet": "Đó là ngày nghỉ hứng thú nhất mà tôi đã từng có.", "eng": "It was the most exciting holiday I've ever had."}, {"viet": "Sẽ thật là thiếu trách nhiệm nếu để thả lỏng một người như thế ra ngoài xã hội.", "eng": "It would be irresponsible to turn such a man loose on society."}, {"viet": "Jenny ở lại Dublin vài ngày, nhưng bây giờ cô ấy sống ở Belfast.", "eng": "Jenny's staying in Dublin for a few days, but she now lives."}, {"viet": "Đảo lộn xộn các từ trong câu để tạo thành một lời vô nghĩa.", "eng": "Jumble up the words in a sentence to produce nonsense."}, {"viet": "Hồ Superior là hồ nước ngọt lớn nhất trên thế giới và sóng vỗ vào bờ của nó như sóng biển vậy.", "eng": "Lake Superior is the largest fresh water lake in the world and the waves which breaks on its shores are like the waves of the sea."}, {"viet": "Để tôi kiểm tra xem anh ấy có rảnh không.", "eng": "Let me check and see if he's available."}, {"viet": "Này, bà cũng không hẳn là hoa hậu tennis Mỹ đâu nhé!", "eng": "Listen, you're not exactly Miss Tennis America!"}, {"viet": "Nhiều người bị thương đã chết trên đường đến bệnh viện.", "eng": "Many of the wounded died on their way to hospital."}, {"viet": "Những tư tưởng của Marx đã sinh ra chủ nghĩa cộng sản.", "eng": "Marx's ideas gave birth to communism."}, {"viet": "Cháu có thể để túi xách của cháu ở đây không?", "eng": "May I put my bags here?"}, {"viet": "Mẹ ơi, chúng ta hãy thay giấy vệ sinh đi, loại giấy hiện đang dùng chùi đau đít quá.", "eng": "Mom, let's change the toilet paper, the current one is too hard on my butt."}, {"viet": "Tình mẫu tử không thích hợp đối với bà ấy, lí ra bà ấy không có con mới phải.", "eng": "Motherhood doesn't suit her, she shouldn't have had children."}, {"viet": "Khả năng giữ thăng bằng của tôi không tốt vì thế tôi không thể đi xe đạp.", "eng": "My balance isn't very good so I can't ride a bicycle."}, {"viet": "Cha tôi bây giờ đã có tuổi và không thể đi nhanh lắm.", "eng": "My father is rather elderly now and can't walk very fast."}, {"viet": "Sứ mệnh của tôi trên đời này là giúp đỡ người nghèo.", "eng": "My mission in life is to help poor people."}, {"viet": "Bài diễn văn của tôi rất trôi chảy cho đến khi sự chen ngang đó làm cho tôi phải ngắc ngứ.", "eng": "My speech went quite well until I was put off my stroke by the interruption."}, {"viet": "Không có cái chuyện xin lỗi, ai sẽ trả giá cho chuyện hư hỏng mà anh đã làm?", "eng": "Never mind saying you're sorry, who's going to pay for the damage you've done?"}, {"viet": "Không, tôi không cảm thấy hoàn toàn khỏe.", "eng": "No, I don't feel quite right."}, {"viet": "Không ai ưa anh ta lắm vì anh ta luôn luôn trưng trổ.", "eng": "No one likes him very much because he is always showing off."}, {"viet": "Bây giờ nói ông ta cúp nguồn điện chính và mở cái nắp ra.", "eng": "Now tell him to switch off the main and open the top."}, {"viet": "Trong số những người được hỏi ý kiến, bảy trong mười người nói rằng họ thích bánh mì nâu hơn.", "eng": "Of these polled, seven out of ten said they preferred brown bread."}, {"viet": "Vâng, vậy để tôi lặp lại những gì ông vừa nói với tôi: một bữa tiệc chào mừng ở Hội trường Hoa Hồng vào lúc 7 giờ 30 tối mai, sáu bàn dành cho 58 người, mỗi bàn 2000 nhân dân tệ, món ăn Quảng Đông, thức uống và trái cây.", "eng": "OK, so let me repeat what you've told me: a welcome banquet in the Rose Hall at 7: 30 tomorrow evening, Six tables for fifty-eight at 2,000 yuan a table, Cantonese dishes, drinks and fruit."}, {"viet": "Một khi cái đó được giải quyết, phần còn lại sẽ thuận buồm xuôi gió.", "eng": "Once that is solved the rest will be plain sailing."}, {"viet": "Một tên trong bọn đã đánh lạc hướng ra ngoài phố trong khi những tên khác cướp ngân hàng.", "eng": "One of the gang created a diversion in the street while the others robbed the bank."}, {"viet": "Những nỗ lực hợp tác của chúng ta chắc chắn sẽ có kết quả và sẽ đóng góp nhiều cho tình hữu nghị của chúng ta.", "eng": "Our co-operative efforts are sure to be productive anh will contribute much to our friendship."}, {"viet": "Mẻ bánh cuối cùng của chúng tôi thành ra khô và cứng.", "eng": "Our last baking of bread turned out dry and hard."}, {"viet": "Thầy giáo của chúng tôi được thăng làm hiệu trưởng.", "eng": "Our teacher has been promoted to headmaster."}, {"viet": "Cha mẹ thay phiên nhau đưa con cái đi học.", "eng": "Parents taking it in turns to convoy children to and from school."}, {"viet": "Người ta đã phải đứng xếp hàng giờ để mua vé.", "eng": "People had to stand in queue for hours to buy a ticket."}, {"viet": "Vui lòng gọi lại cho chúng tôi nếu trong tương lai ông muốn đặt chỗ nhé.", "eng": "Please call us again for any future reservation."}, {"viet": "Người tù được tha sớm vì hạnh kiểm tốt.", "eng": "Prisoner was released early because of good conduct."}, {"viet": "À khoảng 3 hay 4 giờ.", "eng": "Say about three or four o'clock."}, {"viet": "Anh rửa bát giúp em nhé?", "eng": "Shall I help you with the washing up?"}, {"viet": "Cô ấy là ngôi sao còn tôi chỉ là một cô gái múa đệm trong ban đồng ca.", "eng": "She's a star, but I'm just a chorus girl."}, {"viet": "Nàng đã quyết định làm cho xong công việc đó.", "eng": "She's determined to see the job through."}, {"viet": "Cô ta đang sống với một tên nào đó mà cô ta đã làm quen nhân kỳ nghỉ.", "eng": "She's living with some man she picked up on holiday."}, {"viet": "Cô ấy đang học văn học Pháp ở trường Đại học.", "eng": "She's studying French literature at University."}, {"viet": "Cô ta đồng ý không mảy may do dự.", "eng": "She agreed without the slightest hesitation."}, {"viet": "Cô ta va đánh sầm vào bàn hất bát đĩa rơi xuống đất vỡ tan.", "eng": "She bumped against the table and sent the crockery crashing to the ground."}, {"viet": "Bà ấy kết thúc cuộc nói chuyện bằng một câu chuyện khôi hài.", "eng": "She concluded her talk with a funny story."}, {"viet": "Cô ấy đã nghĩ ra một kế hoạch mà nhờ đó họ có thể trốn thoát.", "eng": "She devised a plan whereby they might escape."}, {"viet": "Bà ấy thuê một người phụ tá riêng để làm công việc giấy tờ và trả lời thư.", "eng": "She employed a personal assistant to do her paperwork."}, {"viet": "Cô ta thấy sự ám ảnh của anh ta về tiền bạc thật là đáng ghét.", "eng": "She found his preoccupation with money irritating."}, {"viet": "Cô ấy nhận được tin tức qua trung gian.", "eng": "She got the information only at second hand."}, {"viet": "Bà ta phải sửa lại quần áo sau khi sút cân.", "eng": "She had to take in her clothes after losing weight."}, {"viet": "Bà ta không có đối thủ trong lĩnh vực tiểu thuyết lãng mạn.", "eng": "She has no rival in the field of romantic fiction."}, {"viet": "Chị ấy mời tất cả mọi người đến dự tiệc.", "eng": "She invited all and sundry to her party."}, {"viet": "Cô ta rất có tài cho nên thành công của cô ta chỉ còn là vấn đề thời gian thôi.", "eng": "She is so talented that her success can only be a question of time."}, {"viet": "Cô ấy đã bỏ nhà đi để thoát khỏi sự căng thẳng phải tuân thủ theo lối sống của gia đình mình.", "eng": "She left home to escape from the pressure of her family's way of life."}, {"viet": "Cô ấy quyết tâm tấn công anh ta và đã thành hôn với anh.", "eng": "She made a dead set at him and married him."}, {"viet": "Cô ấy quá chú ý tới từng chi tiết của hoá đơn.", "eng": "She niggled over every detail of the bill."}, {"viet": "Cô ấy đổ xăng vào đống rác rồi châm lửa đốt cháy nó.", "eng": "She poured kerosene over the rubbish and then set it alight."}, {"viet": "Cô ấy viết bài đều đặn cho tạp chí của trường đại học.", "eng": "She regularly contributes to the college magazine."}, {"viet": "Cô ấy tận tụy với gia đình của cô ấy.", "eng": "She's devoted to her family."}, {"viet": "Cô ta có mọi mánh khoé lẩn tránh.", "eng": "She's up to all the dodges."}, {"viet": "Bà ta dường như đành chấp nhận không đi nghỉ năm nay.", "eng": "She seems resigned to not having a holiday this year."}, {"viet": "Cô ta quất roi đen đét lên lưng ngựa.", "eng": "She snapped her whip down one the pony's back."}, {"viet": "Bà ta nói vấp ngay ( một từ lạ ) nhưng rồi lại tiếp tục.", "eng": "She stumbled briefly ( over the unfamiliar word ) but then continued."}, {"viet": "Cô ấy có quan điểm cứng rắn về giải trừ vũ khí hạt nhân.", "eng": "She took a firm stand on nuclear disarmament."}, {"viet": "Bà ta thường cho sinh viên ăn ở trọ trong các học kỳ.", "eng": "She usually boards students during the college term."}, {"viet": "Cô ta luôn luôn kính trọng cha mình.", "eng": "She was always looked up to her father."}, {"viet": "Cô ấy đang lái xe quá tốc độ cho phép nhiều.", "eng": "She was driving at well over the speed limit."}, {"viet": "Bà ấy thấy hiu quạnh khi các con đã đi hết.", "eng": "She was lonesome when her children were gone."}, {"viet": "Cô ta nổi điên lên với những nhận xét của anh ấy.", "eng": "She was seething with rage at his remarks."}, {"viet": "Bà ấy rất mong muốn cho con trai thành công.", "eng": "She was very anxious that her son should succeed."}, {"viet": "Cô ấy đã không ngủ cả ba hôm nay.", "eng": "She went without sleep for three days."}, {"viet": "Cô ấy làm việc chăm chỉ hơn anh ấy.", "eng": "She works harder than he does."}, {"viet": "Tôi có nên đi gặp cô ấy không?", "eng": "Should I go and see her?"}, {"viet": "Vì anh ấy ăn ở tồi tệ như vậy lòng kính trọng của tôi đối với anh ấy đã giảm đi.", "eng": "Since he behaved so badly he's gone down in my esteem."}, {"viet": "Tình cờ ghé qua Pari ngày nghỉ cuối tuần.", "eng": "Skip across to Paris for the weekend."}, {"viet": "Vuốt chiếc váy bên hông của cô ta cho thẳng.", "eng": "Smooth her skirt over her hips."}, {"viet": "Xà phòng không nổi bọt trong nước biển.", "eng": "Soap will not lather in sea-water."}, {"viet": "Một số thức ăn dễ hấp thụ hơn một số khác.", "eng": "Some foods are assimilated more easily than others."}, {"viet": "Có người xem rađiô như một phương tiện truyền thông thấp kém.", "eng": "Some people may regard radio as the poor relation of broadcasting."}, {"viet": "Người nào đó đang ngồi ở chỗ của tôi.", "eng": "Someone is sitting in my seat."}, {"viet": "Khoảng không thật hiếm trong toà nhà này.", "eng": "Space is at a premium in this building."}, {"viet": "Thú sưu tập tem có một sức cuốn hút nhất định đối với tôi.", "eng": "Stamp collecting holds a certain fascination for me."}, {"viet": "Các nhà môi giới chứng khoán lừa gạt khách hàng họ biết bao nhiêu tiền bạc.", "eng": "Stockbrokers who finagle their clients out of fortunes."}, {"viet": "Trọng âm và nhịp điệu là quan trọng trong khi nói tiếng Anh.", "eng": "Stress and rhythm are important in speaking English."}, {"viet": "Một hành vi như thế sẽ làm cho anh mất cảm tình của mọi người.", "eng": "Such behaviour will lose you everyone's sympathy."}, {"viet": "Cung cấp các sự kiện liên quan trực tiếp tới vụ kiện đó.", "eng": "Supply the facts directly relevant to the case."}, {"viet": "Có một quan điểm khách quan về cái gì.", "eng": "Take a detached view of something."}, {"viet": "Gõ những ngón tay của mình theo đúng nhịp nhạc.", "eng": "Tapping one's fingers in time to the music."}, {"viet": "Nhiệt độ sẽ lên tới mức tối thiểu là 50 độ F.", "eng": "Temperatures will reach a minimum of 50 F."}, {"viet": "Đó là một cái thứ kì quặc, nó dùng để làm gì?", "eng": "That's a curious contraption What's it for?"}, {"viet": "Chiếc ô tô đó suýt nữa thì đâm phải tôi, tí nữa thì tôi chết rồi!", "eng": "That car nearly hit me, I might have been killed!"}, {"viet": "Điều đó quả thật là phi thường! Đó thực sự là một điều phi thường!", "eng": "That is indeed remarkable! That is indeed a remarkable thing!"}, {"viet": "Cái gói này đựng đồ thuỷ tinh-đừng đánh rơi.", "eng": "That parcel contains glass-don't let it fall."}, {"viet": "Tiếng đó giống hệt tiếng chị tôi.", "eng": "That sounds like my sister all over."}, {"viet": "Đại hội Ôlimpich lần thứ 21 diễn ra ở Montreal.", "eng": "The 21stOlympiad took place in Montreal."}, {"viet": "Nghề diễn viên, pháp chế, y, v. v.", "eng": "The acting, legal, medical, etc profession."}, {"viet": "Đồng hồ báo thức vẫn chưa reo, đúng không?", "eng": "The alarm clock hasn't gone off yet, right?"}, {"viet": "Nhóm người vận động phản đối vũ khí hạt nhân đang trở nên mạnh mẽ hơn.", "eng": "The anti-nuclear lobby is becoming stronger."}, {"viet": "Quân đội không nhận anh ta vì anh ta quá tuổi.", "eng": "The army wouldn't have him because he was overage."}, {"viet": "Khán giả nổi giận với đề nghị đó là đúng.", "eng": "The audience was rightly outraged at this suggestion."}, {"viet": "Vạt sau áo sơ mi của bạn đã tuột dần ra khỏi quần.", "eng": "The back of your shirt has worked out of your trousers."}, {"viet": "Các nhà băng hoang mang đem bán đồng bảng Anh đi.", "eng": "The banks were panicked into selling sterling."}, {"viet": "Do áp lực bia tuôn ra khỏi thùng.", "eng": "The beer come out of the barrel under pressure."}, {"viet": "Các vị giám mục linh mục và các phó tế lần lượt đi vào trong thánh đường.", "eng": "The bishops, priests and deacons processed in to the cathedral."}, {"viet": "Quả bom đã được định giờ để nổ vào giờ cao điểm.", "eng": "The bomb was timed to explode during the rush-hour."}, {"viet": "Ông chủ để ý từng lỗi lầm trong công việc của cô ta và lập tức phê phán.", "eng": "The boss was quick to pounce on any error in her work."}, {"viet": "Rượu mạnh đã làm hồi phục lại nhiệt huyết trong anh ấy.", "eng": "The brandy renewed his energy."}, {"viet": "Viên đạn được bắn ra từ khẩu súng với tốc độ rất nhanh.", "eng": "The bullet is released from the gun at very high speed."}, {"viet": "Ống kính máy ảnh phải được che không để ánh sáng mặt trời chiếu thẳng vào.", "eng": "The camera lens must be screened from direct sunlight."}, {"viet": "Xe ôtô bán có sẵn đệm bọc màu đen hoặc đỏ.", "eng": "The car is available with back or red trim."}, {"viet": "Vụ kiện được đưa ra trước toà án tuần sau.", "eng": "The case comes before the court next week."}, {"viet": "Cần phải tham khảo ý kiến của ông chủ tịch.", "eng": "The chairman's opinion should be sought."}, {"viet": "Tình cảm của đứa bé bị dồn nén liên tục.", "eng": "The child's affections were kept suffered continual restraint."}, {"viet": "Cậu bé bị cha mẹ hắt hủi.", "eng": "The child was rejected by its parents."}, {"viet": "Các học sinh đứng xếp hàng một cách trật tự.", "eng": "The children lined up in an orderly fashion."}, {"viet": "Tiếng chùm chuông đồng hồ nhà thờ.", "eng": "The chime of church bells of the clock."}, {"viet": "Tiếng lách cách của dao kéo, tiếng lọc cọc của vó ngựa, tiếng lách cách của máy chữ.", "eng": "The clatter of cutlery, horse's hoofs, a typewriter."}, {"viet": "Chiếc áo choàng này có một lớp lót bên trong tháo rời ra được.", "eng": "The coat has a detachable lining inside."}, {"viet": "Ủy ban đã bắt đầu công việc của mình với những dấu hiệu không thuận lợi.", "eng": "The committee began its work under unfavourable auspices."}, {"viet": "Công ty đó đang quyết tâm nắm cho được thị trường Canađa.", "eng": "The company is out to capture the Canadian market."}, {"viet": "Những thị trường tài chính hỗn độn và không có hướng đi.", "eng": "The confused and rudderless financial markets."}, {"viet": "Mục thư tín của tờ Times.", "eng": "The correspondence columns of the Times."}, {"viet": "Sương mù bao phủ khắp vùng quê.", "eng": "The countryside was blanketed with fog."}, {"viet": "Bọn tội phạm nằm phục đợi nạn nhân của chúng.", "eng": "The criminals were lying in wait for their victim."}, {"viet": "Tủ đầy những giấy cũ, đồ chơi bị gãy và những vật vô giá trị khác.", "eng": "The cupboard was full of old papers, broken toys and other rubbish."}, {"viet": "Ngày chúng tôi sẽ phải quyết định đang xích lại gần.", "eng": "The day is nearing when we'll have to decide."}, {"viet": "Những thú vị trong cuộc sống ở nông thôn.", "eng": "The delights of living in the country."}, {"viet": "Nhà độc tài đã thanh trừng tất cả những đối thủ chính trị của mình.", "eng": "The dictator had eliminated all his political opponents."}, {"viet": "Sự tan vỡ một cuộc hôn nhân, một sự cộng tác kinh doanh, sự tan rã của Đế quốc La Mã.", "eng": "The dissolution of a marriage, a business partnership, the Roman Empire."}, {"viet": "Bác sĩ sẽ rảnh trong mười phút nữa, anh có thể đợi lâu chừng đó không?", "eng": "The doctor will be free in ten minutes'time, can you wait that long?"}, {"viet": "Con chó đuổi bắt một con thỏ.", "eng": "The dog was running after a rabbit."}, {"viet": "Người tài xế đang đợi đèn xanh vẫn để máy rồ.", "eng": "The driver waited for the green light, his engine racing."}, {"viet": "Biên tập viên đã gạch bỏ đoạn cuối của bài báo.", "eng": "The editor deleted the last paragraph from the article."}, {"viet": "Sự tiến của quân địch đã bị chặn đứng.", "eng": "The enemy's advance was halted."}, {"viet": "Cặp vợ chồng bất hòa đó đã làm lành với nhau sau một năm.", "eng": "The estranged couple reconciled after a year."}, {"viet": "Lòng hào hiệp của cô ta bị lợi dụng một cách vô liêm sỉ.", "eng": "The exploited her generosity shamelessly."}, {"viet": "Gia đình đó đã bị cháy sạch nhà cửa nên buộc phải rời khỏi khu vực ấy.", "eng": "The family was burnt out of house and home and forced to leave the area."}, {"viet": "Sự bất thường của khí hậu nước Anh.", "eng": "The fickleness of the English climate."}, {"viet": "Cảnh cuối là đỉnh cao của vở kịch.", "eng": "The final scene is the coping-stone of the play."}, {"viet": "Công ty sẽ phá sản trừ phi công việc làm ăn phát triển hơn.", "eng": "The firm will go under unless business improves."}, {"viet": "Căn phòng có bọ chét phải phun thuốc trừ sâu đậm đặc.", "eng": "The flea room had to be sprayed with a strong pesticide."}, {"viet": "Ông bộ trưởng ngoại giao yêu cầu các nước phương Tây sự giúp đỡ rộng lớn về tài chính, kỹ thuật và lương thực thêm nữa.", "eng": "The Foreign Minister asked for large-scale Western financial help, technical assistance and extra food aid."}, {"viet": "Toàn văn bài nói của Thủ tướng.", "eng": "The full text of the Prime Minister's speech."}, {"viet": "Hệ thống bánh răng của máy này không bình thường.", "eng": "The gearing of this machine is unusual."}, {"viet": "Bàn thắng đã chấm dứt cơ may chiến thắng của Brazil.", "eng": "The goal that killed Brazil's chances of winning."}, {"viet": "Chính phủ tiết lộ rằng thêm một nhà ngoại giao nữa đã bị bắt vì hoạt động gián điệp.", "eng": "The Government disclosed that another diplomat has been arrested for spying."}, {"viet": "Chính phủ phải luôn luôn hành động theo hiến pháp.", "eng": "The government must always act constitutionally."}, {"viet": "Thuận lợi lớn của chi phiếu du lịch là nếu chúng bị mất hay bị đánh cắp, ngân hàng hoặc công ty du lịch phát hành chúng sẽ đổi chúng mà không tính thêm chi phí.", "eng": "The great advantage of traveller's checks is that, if they are lost or stolen, the bank or travel company that issued them will replace them with no extra charge."}, {"viet": "Người khách trọ bị cảm nặng và muốn ăn một tô mì sợi.", "eng": "The guest has a bad cold and wants a bowl of noodles."}, {"viet": "Tiếng thầy hiệu trưởng oang oang vọng qua sân chơi.", "eng": "The headmaster's voice boomed out across the playground."}, {"viet": "Những tên không tặc đã đe dọa giết tất cả các hành khách nếu các yêu cầu của chúng không được đáp ứng.", "eng": "The hijackers threatened to kill all the passengers if their demands were not met."}, {"viet": "Sức nóng mặt trời đã làm bìa sách cong lên.", "eng": "The hot sun had warped the cover of the book."}, {"viet": "Ngôi nhà ở hơi xa ( con đường ) một chút.", "eng": "The house stands back a little ( from the rood )."}, {"viet": "Tài liệu nhận dạng gồm có vân tay của người mang nó.", "eng": "The identification ducument contains the bearer's fingerprints."}, {"viet": "Người ta tin rằng chứng phong thấp là do khí hậu ẩm thấp.", "eng": "The inhabitants are predisposed to rheumatism by damp climate."}, {"viet": "Sự phát minh ra máy thu thanh của Marconi.", "eng": "The invention of radio by Marconi."}, {"viet": "Quyết định của quan toà đã bị toà Thượng thẩm bác.", "eng": "The judge's decision was set aside by the Appeal Court."}, {"viet": "Loại phó-mát được xác định dựa vào loại sữa được dùng và việc xử lý sữa đặc.", "eng": "The kind is determined by the kind of milk used and by what is done to the curds."}, {"viet": "Những con khủng long cuối cùng đã biến mất vào khoảng 60 triệu năm trước đây, trước khi có con người trên Trái Đất.", "eng": "The last dinosaurs disappeared about 60 million years ago, long before there were any people on the Earth."}, {"viet": "Mẫu số chung nhỏ nhất của 1/3 và 1/4 là 12.", "eng": "The least common denominator of 1/3 and 1/4 is 12."}, {"viet": "Ngọn đèn trong phòng tắm của tôi quá mờ.", "eng": "The light in my bathroom is too dim."}, {"viet": "Con sông dài nhất châu Phi là sông Nile.", "eng": "The longest river in Africa is the Nile."}, {"viet": "Viên pháp quan cho hắn hưởng án treo một năm.", "eng": "The magistrate bound him over to keep the peace for a year."}, {"viet": "Ông quản đốc bị ốm cho nên tôi thay thế chỗ ông ta.", "eng": "The manager was ill so I went in his place."}, {"viet": "Các bữa ăn ở khách sạn này có giờ nhất định.", "eng": "The meals in this hotel are at set times."}, {"viet": "Những người đàn ông đang đứng quây tròn.", "eng": "The men were standing in a ring."}, {"viet": "Nỗi bất hạnh to lớn của những người mất nhà, mất cửa trong cuộc hoả hoạn.", "eng": "The misery of the people who had lost their homes in the fire."}, {"viet": "Cô ta càng suy nghĩ nhiều về điều đó, cô ta càng trở nên thất vọng.", "eng": "The more she thought about it, the more depressed she became."}, {"viet": "Nghị sĩ đó đề nghị một sự tu chỉnh về dự luật đó.", "eng": "The MP moved an amendment to the Bill."}, {"viet": "Cuộc thương lượng đã đi đến chỗ bế tắc.", "eng": "The negotiations have reached deadlock."}, {"viet": "Chiếc máy mới làm tôi lúng túng cho đến khi Sarah giải thích cho tôi cách dùng nó.", "eng": "The new machine puzzled me until Sarah explained how it worked."}, {"viet": "Trung tâm mua sắm mới được xây dựng là một nơi lý tưởng để mua đồ lưu niệm.", "eng": "The newly-built shopping center is an ideal place for purchasing souvenirs."}, {"viet": "Bầu trời vào ban đêm cũng thay đổi từ giờ này sang giờ khác.", "eng": "The night sky also changes from hour to hour."}, {"viet": "Chứng tê chân của ông chẳng bao lâu sẽ hết.", "eng": "The numbness in your foot will soon pass off."}, {"viet": "Bánh trước bên phải của một chiếc xe ôtô.", "eng": "The offside front wheel of a car."}, {"viet": "Thế vận hội Olympic đúng là có hàng tỷ người trên khắp thế giới theo dõi.", "eng": "The Olympic Games are watched by literally billions of people around the world."}, {"viet": "Chiếc ôtô kia đâm sườn vào chúng tôi.", "eng": "The other car hit us side-on."}, {"viet": "Người nhảy dù được thắt chặt vào dây chằng.", "eng": "The parachutist was buckled into his harness."}, {"viet": "Tim của bệnh nhân đã đập đều đặn trở lại.", "eng": "The patient's heart was beating steadily once more."}, {"viet": "Tại đây, người dân được an toàn hơn.", "eng": "The people were safer there."}, {"viet": "Bức tranh trông đẹp trên nền tường đỏ đó.", "eng": "The picture looks good against that red wall."}, {"viet": "Đối với tôi kế hoạch đó thật là khôi hài.", "eng": "The plan strikes me as ridiculous."}, {"viet": "Vở kịch đó đã diễn khá lâu.", "eng": "The play had a good run."}, {"viet": "Cảnh sát không phải lúc nào cũng thắng trong cuộc chiến chống tội phạm.", "eng": "The police are not always victorious in their fight against crime."}, {"viet": "Cảnh sát đặt những câu hỏi liên tục suốt cuộc thẩm vấn kẻ bị tình nghi.", "eng": "The police kept up a running fire of questions during their interrogation of the suspect."}, {"viet": "Người cảnh sát được hối lộ 600 bảng Anh để im miệng.", "eng": "The policeman was given a bribe of £ 600 to keep his mouth shut."}, {"viet": "Viên bưu tá đến vào 6 giờ 30 sáng, lúc đó tôi thường đang say giấc.", "eng": "The postman comes at 6.30 in the morning, at which time I am usually fast asleep."}, {"viet": "Người ta ngờ rằng bà vợ của Tổng thống mới thực sự là người nắm quyền.", "eng": "The President's wife was suspected of being the real power behind the throne."}, {"viet": "Giá của kỳ nghỉ bao gồm cả ăn.", "eng": "The price of the holiday includes food."}, {"viet": "Người tù hình như bị đánh nhiều.", "eng": "The prisoner seemed to have been knocked about a bit."}, {"viet": "Tiến trình bị chậm lại bởi sự gián đoạn công việc liên tục.", "eng": "The progress was delayed by repeated discontinuations of work."}, {"viet": "Dân chúng không được vào phòng tòa án.", "eng": "The public is not allowed to enter the court room."}, {"viet": "Nữ hoàng hậu được làm lễ đăng quang trong một tu viện cổ.", "eng": "The queen was enthroned in an ancient abbey."}, {"viet": "Tỉ giá phải được điều chỉnh do sự biến động trong thị trường tiền tệ.", "eng": "The rate has to be adjusted owing to the fluctuation in the money market."}, {"viet": "Những người tị nạn đã mất hết nhà cửa, tài sản, và bây giờ là trường hợp nhất sống nhị chết.", "eng": "The refugees had lost their homes and their possessions, and it was now sink or swim."}, {"viet": "Nơi nghỉ mát cung cấp tiện nghi ăn ở hợp với mọi túi tiền.", "eng": "The resort provides accommodation to suit every pocket."}, {"viet": "Quyền tự do không thể bị xoá bỏ.", "eng": "The right to freedom that cannot be annihilated."}, {"viet": "Đường sá lầy lội, nên giày của bố dính đầy bùn.", "eng": "The road was muddy so I got mud all over my shoes."}, {"viet": "Sự hỗn loạn chính trị trong nước.", "eng": "The rough-and-tumble of national politics."}, {"viet": "Giá bán dừa tụt nhanh trong mùa mưa.", "eng": "The sale of king coconuts slumped during the wet weather."}, {"viet": "Trường học nằm kế bên bưu điện.", "eng": "The school is next to the post office."}, {"viet": "Người tự xưng là'Đức Cha'Harper không hề là một giáo sĩ thực thụ.", "eng": "The self-styled'Reverend'Harper is not a real clergyman at all."}, {"viet": "Tính chất hoàn toàn hiểm độc của chuyện ngồi lê đôi mách.", "eng": "The sheer maliciousness of the gossip."}, {"viet": "Điện giật làm tôi bủn rủn cả chân tay.", "eng": "The shock made me go an weak at the knees."}, {"viet": "Bảng đề Bộ Quốc Phòng-Nguy hiểm-Cấm vào!", "eng": "The sign said Ministry of Defense-Danger-Keep Out!"}, {"viet": "Các cậu bé được phép chạy trước 10 mét.", "eng": "The small boys were given a start of ten metres."}, {"viet": "Quân lính núp tránh quân địch trong một khoảng đất hơi trũng.", "eng": "The soldiers hid from the enemy in a slight depression."}, {"viet": "Diễn giả cứ nói loanh quanh ngoài đề.", "eng": "The speaker kept wandering away from the point."}, {"viet": "Ngôi sao của phim này là một diễn viên trước đây chưa có tiếng.", "eng": "The star of the film is a previously unknown actor."}, {"viet": "Chuyện kể rằng bà ta đã đầu độc chồng.", "eng": "The story goes that she poisoned her husband."}, {"viet": "Cách nói của anh ấy thì trái hẳn với cách nói của tôi.", "eng": "The style of his speech is in complete antithesis of mine."}, {"viet": "Cuộc khảo sát đã phát lộ ra một dư luận rộng rãi.", "eng": "The survey revealed a wide spread of opinion."}, {"viet": "Thầy giáo truyền cho học sinh lòng nhiệt tình của mình.", "eng": "The teacher infected his pupils with his enthusiasm."}, {"viet": "Nhiệt độ gần 105 độ trong bóng râm.", "eng": "The temperatiure was nudging 105 degrees in the shade."}, {"viet": "Bọn trộm chắc phải có tay trong nào đó để giúp chúng đột nhập.", "eng": "The thieves must have had someone on the inside to help them break in."}, {"viet": "Chủ đề hôm nay được tập trung vào cuộc khủng hoảng ở vùng viễn Đông.", "eng": "The topic today centers about the crisis in the far East."}, {"viet": "Tất nhiên chuyến tàu phải trễ do tai nạn ấy.", "eng": "The train was sure delayed by the accident."}, {"viet": "Sự thật đôi khi khó mà biết được.", "eng": "The truth is sometimes difficult to get at."}, {"viet": "Hai quảng trường đó khác nhau về màu sắc, không phải về kích thước.", "eng": "The two squares differ in colour but not in size."}, {"viet": "Kết quả cuối cùng của tất cả chuyện đó là ông ta từ chức.", "eng": "The upshot of it all was that he resigned."}, {"viet": "Tên lưu manh trong làng khủng bố dân làng bất lực.", "eng": "The village ruffian terrorised the helpless villagers."}, {"viet": "Khi đổ xuống các tảng đá, nước sủi bọt.", "eng": "The water frothed as it tumbled down the rocks."}, {"viet": "Toàn bộ quận này có vẻ bị bỏ rơi.", "eng": "The whole district had an air of abandonment and neglect."}, {"viet": "Đội chiến thắng được những người ủng hộ hoan hô.", "eng": "The winning team were cheered by their supporters."}, {"viet": "Các công nhân dựa xẻng vào hàng rào rồi đi ăn trưa.", "eng": "The workmen leant their shovels against the fence and went to lunch."}, {"viet": "Những luận điệu của họ đã bị bêu riếu một cách khinh bỉ.", "eng": "Their allegations were simply laughed out of court."}, {"viet": "Cuộc hôn nhân của họ khởi đầu khá lung lay.", "eng": "Their marriage got off to rather a shaky start."}, {"viet": "Rồi ngày bắt đầu thu ngắn lại dần.", "eng": "Then days begin to get shorter."}, {"viet": "Có biển bán nhà bên ngoài ngôi nhà của họ.", "eng": "There's a For Sale sign outside their house."}, {"viet": "Không có thời hạn sử dụng ở hộp đậu này.", "eng": "There's no best before date on these beans."}, {"viet": "Có cái gì trục trặc trong máy.", "eng": "There's something wrong with the works."}, {"viet": "Cũng có nhiều loại mây khác nằm lưng chừng.", "eng": "There are many other in-between clouds, too."}, {"viet": "Có hai mươi vòng và chỉ có mười bốn cái móc rèm.", "eng": "There are twenty rings and only fourteen curtain hooks."}, {"viet": "Có một chi nhánh của Toàn Tụ Đức ở đằng sau tòa nhà này.", "eng": "There is a branch of Quan Ju De behind this building."}, {"viet": "Người ta ngày càng lo rằng có thể họ đã bị giết chết.", "eng": "There is growing concern that they may have been killed."}, {"viet": "Thức ăn còn lại cho gà không đủ.", "eng": "There isn't enough feed left for the hens."}, {"viet": "Có tiếng đĩa hát đang chơi ở phòng bên.", "eng": "There was a record playing in the next room."}, {"viet": "Không có nhiều xe cộ đi lại cho nên chúng tôi đã tới đó rất sớm.", "eng": "There wasn't much traffic so we got there in very good time."}, {"viet": "Đấy, bà lại thế rồi, cứ nhòm ngó vào chuyện của người khác!", "eng": "There you go again, prying into other people's affairs!"}, {"viet": "Những ý nghĩ này đã ăn sâu vào đầu óc anh ấy.", "eng": "These ideas are entrenched in his mind."}, {"viet": "Các giáo viên này làm cho sự chú ý của dư luận tập trung vào giáo dục.", "eng": "These teachers are keeping education in the foreground of public attention."}, {"viet": "Họ đã xây hàng rào xung quanh để ngăn trẻ con rơi xuống.", "eng": "They've built a fence all round to stop the children falling in."}, {"viet": "Chúng là quà cho các bạn của tôi.", "eng": "They are gifts for my friends."}, {"viet": "Họ tẩy chay xe buýt khi giá vé tăng.", "eng": "They boycotted the buses when the fares went up."}, {"viet": "Họ cắt bỏ các cành cây khô.", "eng": "They cut away all the dead branches from the tree."}, {"viet": "Họ moi được một lời thú tội của tên tội phạm.", "eng": "They extracted a confession from the criminal."}, {"viet": "Chúng nộp vũ khí của chúng cho cảnh sát.", "eng": "They handed their weapons over to the police."}, {"viet": "Họ biết được tầm quan trọng của việc luyện tập hàng ngày.", "eng": "They learnt the value of regular exercise."}, {"viet": "Họ cần một ngôi sao có khả năng cho bộ phim.", "eng": "They need a bankable star for the movie."}, {"viet": "Tất cả đều ở trong tủ lạnh, thưa ông.", "eng": "They're all in the fridge, sir."}, {"viet": "Họ tỏ ra có một mức độ tự kiềm chế đáng kể để không cãi nhau công khai trên ti-vi.", "eng": "They showed a remarkable degree of moderation in not quarrelling publicly on television."}, {"viet": "Họ chỉ sử dụng chất màu tự nhiên để nhuộm len.", "eng": "They used only natural pigments to dye the wool."}, {"viet": "Họ đáng ra phải bắt đầu phá huỷ nhà hát cũ hôm nay nhưng phút cuối cùng đã có lệnh hoãn lại.", "eng": "They were due to start demolishing the old theatre today but there's been a last-minute stay of execution."}, {"viet": "Họ đã thắng cuộc tranh luận hoàn toàn chỉ do sức mạnh của số đông.", "eng": "They won the argument by sheer weight of numbers."}, {"viet": "Cái công ty chết tiệt này vẫn đối xử với tao chẳng ra cái gì.", "eng": "This bloody company keeps fucking me about."}, {"viet": "Nước này thiếu một đảng phái giữa có ảnh hưởng.", "eng": "This country lacks an effective party of the centre."}, {"viet": "Anh bạn này của cô ta nghe nói là rất giàu.", "eng": "This friend of hers is said to be very rich."}, {"viet": "Đây là ông Smith ở tòa báo Đông và Tây.", "eng": "This is Mr. Smith of the East and West Newspapers."}, {"viet": "Sự kiện mới nhất này đúng là không giúp gì cho công việc cả.", "eng": "This latest development doesn't exactly help."}, {"viet": "Cái này tốt hơn tất cả các cái khác hợp lại.", "eng": "This one cost more than all the others together."}, {"viet": "Nhà hàng này bán rẻ mà thức ăn rất ngon.", "eng": "This restaurant serves cheap but excellent food."}, {"viet": "Thứ trà này giá cao tới 39 penni một gói.", "eng": "This tea is good value at 39p a packet."}, {"viet": "Những cánh đồng này phải bẻ cỏ ngô tuần này.", "eng": "Those fields have to be detasseled this work."}, {"viet": "Ngày nay tinh thể carborundum được chế tạo ra trong những lò điện tử từ một hỗn hợp cát và than đá.", "eng": "Today carborundum crystals are made in electric furnaces out of a mixture of sand and coke."}, {"viet": "Con Triceratops có ba sừng và một diềm xương quanh cổ.", "eng": "Triceratops had three horns and a frill of bone around its neck."}, {"viet": "Bạo lực là mặt tồi tệ nhất của tội ác.", "eng": "Violence was the worst aspect of the crime."}, {"viet": "Tốt hơn là chúng ta nên kiếm cái gì đó ăn đi, bạn nghĩ sao?", "eng": "We'd better get something to eat, what do you say?"}, {"viet": "Tất cả chúng tôi đều nhất trí: chống lại đề nghị đó.", "eng": "We're all of the same mind: opposed to the proposal."}, {"viet": "Chúng tôi đang chuyển về ngay phía nam của Newcastle.", "eng": "We're relocating just south of Newcastle."}, {"viet": "Chúng tôi đã phải chạy tắt để có được kịp giấy thị thực của anh.", "eng": "We've had to cut a few corners to get your visa ready in time."}, {"viet": "Chúng tôi đã ngừa trước những lời khiếu nại của họ bằng cách viết một bản báo cáo đầy đủ.", "eng": "We anticipated their complaint by writing a full report."}, {"viet": "Chúng tôi rất hân hạnh được thượng nghị sĩ Dobbs đến với chúng tôi sáng nay.", "eng": "We are very privileged to have Senator Dobbs with us this morning."}, {"viet": "Chúng tôi có thể hoàn thành những gì anh có thể hoàn thành và kết quả còn tốt hơn.", "eng": "We can accomplish whatever you can accomplish, and with better results."}, {"viet": "Chúng tôi so sánh cẩn thận giá quý vị chào với giá của một nhà cung cấp khác và thấy rằng các điều khoản của ông ấy thuận lợi hơn.", "eng": "We compared your offer carefully with that of the other supplier and found that his terms are more favorable."}, {"viet": "Chúng tôi không có sẵn màu đó-đây có màu tương tự.", "eng": "We don't have that colour in stock-this is the nearest."}, {"viet": "Thông thường chúng tôi cho đại lý của chúng tôi kinh doanh mặt hàng này khoản tiền hoa hồng là 8%.", "eng": "We generally allow our agents in this line a commission of 8%."}, {"viet": "Chúng tôi phải chen lấn rẽ lấy một lối đi qua đám đông.", "eng": "We had to push our way through the crowd."}, {"viet": "Chúng tôi không có văn bản về việc anh được quyền đi không mất tiền.", "eng": "We have no record of your entitlement to free travel."}, {"viet": "Chúng tôi mời tất cả bạn bè nhưng chỉ một số người đến thôi.", "eng": "We invited all our friends but only some of them came."}, {"viet": "Chúng tôi làm một cố gắng nghiêm chỉnh để thuyết phục cô ấy.", "eng": "We made an earnest endeavour to persuade her."}, {"viet": "Chúng ta không nên dựa vào giả thuyết đơn thuần mà lên án cô ấy.", "eng": "We must not condemn her on pure supposition."}, {"viet": "Chúng tôi chỉ lỡ có năm phút mà không gặp nhau.", "eng": "We only missed each other by five minutes."}, {"viet": "Chúng tôi đã lấy một số người trong công nhân làm mẫu để hỏi ý kiến họ về những thay đổi trong các phương pháp làm việc.", "eng": "We sampled opinion among the workers about changes in working methods."}, {"viet": "Chúng tôi cứ loanh quanh ở nhà.", "eng": "We spent the day slopping about the house."}, {"viet": "Chúng tôi đề nghị picnic nhưng thầy hiệu trưởng bác bỏ ý kiến đó.", "eng": "We voted for a picnic but the headmaster overruled the idea."}, {"viet": "Chúng tôi được giáo hoàng tiếp kiến tại toà thánh Vantican.", "eng": "We were given an audience with the Pole in the Vatican."}, {"viet": "Từ nay trở đi chúng tôi sẽ cố hết sức để cải thiện sự phục vụ của chúng tôi.", "eng": "We will try our best to improve our service from now on."}, {"viet": "Vậy làm thế nào để gọi tờ mười xu?", "eng": "Well, how to say ten-fen'note?"}, {"viet": "À, đây là biển số cho bà.", "eng": "Well, this is the number plate for you."}, {"viet": "Người ta cho rằng ngày mai thời tiết sẽ như thế nào?", "eng": "What's the weather supposed to be like tomorrow?"}, {"viet": "Anh đang làm gì trên gac xét vậy?", "eng": "What are you doing in the attic?"}, {"viet": "Anh nghĩ thế nào về khả năng đến kịp của chúng ta?", "eng": "What do you reckon our chances are of arriving on time?"}, {"viet": "Lễ Giáng Sinh ở Úc như thế nào?", "eng": "What is Christmas like in Australia?"}, {"viet": "Ngày lễ lớn nhất ở nước bạn là ngày nào?", "eng": "What is your country's biggest holiday?"}, {"viet": "Mỗi năm có bao nhiêu phần trăm trẻ em chết vì bệnh tinh hồng nhiệt.", "eng": "What percentage of babies die of scarlet every year."}, {"viet": "Tôi sẽ đến đó lúc mấy giờ?", "eng": "What time should I be there?"}, {"viet": "Ông Mori, ông đến Mĩ khi nào vậy?", "eng": "When did you come to American, Mr Mori?"}, {"viet": "Khi tôi nói tôi đã đánh vỡ cái đó thì cô ta thật sự nổi tam bành lên.", "eng": "When I said I'd broken it, she really went off the deep end."}, {"viet": "Khi cuộc đấu bắt đầu anh ta nghĩ khôn ngoan hơn cả là nên bỏ đi.", "eng": "When the fight began, he thought it politic to leave."}, {"viet": "Khi nào thì anh sử dụng thời gian nghỉ phép hàng năm còn lại của anh?", "eng": "When will you take the balance of your annual leave?"}, {"viet": "Bạn muốn sống ở đâu sau khi nghỉ hưu?", "eng": "Where do you want to live after retirement?"}, {"viet": "Anh ta dự những môn thi nào tại thế vận hội Ôlimpich?", "eng": "Which events is he going in for at the Olympics?"}, {"viet": "Uýt-ski chứa một lượng cồn cao.", "eng": "Whisky contains a large percentage of alcohol."}, {"viet": "Đội nào đã đoạt được Cúp Thế giới năm 1982?", "eng": "Who was it that won the World Cup in 1982?"}, {"viet": "Sao bạn không thử cắm trại ở vài nơi như Wisconsin hay Minnesota?", "eng": "Why don't you try camping in some place like Wisconsin or Minnesota?"}, {"viet": "Cái thứ này có làm tôi say thực sự không?", "eng": "Will this stuff get me seriously activated?"}, {"viet": "Được sự tán thưởng của lãnh đạo.", "eng": "Win the accolade of approval from the leadership."}, {"viet": "Với một phiên dịch như ông thì mọi việc sẽ tốt đẹp thôi.", "eng": "With you acting as interpreter, everything will work out fine."}, {"viet": "Có lẽ anh có tiền lẻ để đổi cho 5 pao được chăng?", "eng": "Would you by any chance have change for 5 pounds?"}, {"viet": "Bạn có thích chơi quần vợt với chúng tôi không?", "eng": "Would you like to play tennis with us?"}, {"viet": "Chà, ở đây yên tĩnh và đẹp quá.", "eng": "Wow, it's so quiet and beautiful here."}, {"viet": "Có, tôi có hẹn trước lúc 3 giờ.", "eng": "Yes, I have one at three o'clock."}, {"viet": "Anh nên đem cái bánh mì cũ này cho vịt ăn.", "eng": "You'd better feed this old bread to the ducks."}, {"viet": "Anh sẽ không bao giờ có thân hình cân đối nếu anh không giảm ăn và tập thể dục nhiều lên.", "eng": "You'll never be in shape until you eat less and take more exercise."}, {"viet": "Anh đã mua đủ sơn để sơn ngôi nhà không chỉ một mà hai lần!", "eng": "You've bought enough paint to paint the house twice over!"}, {"viet": "Anh không thể coi hai từ đó như có cùng một nghĩa được.", "eng": "You can't ascribe the same to both words."}, {"viet": "Bà có thể chọn từ xe đẩy món tráng miệng.", "eng": "You can choose from the dessert trolley."}, {"viet": "Lúc nào anh cũng không thể buông lơi cảnh giác.", "eng": "You cannot afford to relax your vigilance for a moment."}, {"viet": "Anh xuống xe ở trạm dừng kế tiếp, băng qua đường và anh sẽ thấy trạm đón xe không xa phía tay trái của anh.", "eng": "You get off at the next stop, cross the street, and you'll find the stop not far on your left-hand side."}, {"viet": "Anh biết không, cả hai đều là rượu vang Trung Quốc nhưng loại Triều Đại có vị giống rượu châu Âu hơn.", "eng": "You know, both of them are Chinese wine but Dynasty tastes more like European one."}, {"viet": "Anh có thể tìm được một ít thịt còn lại trên phần xương con gà đó.", "eng": "You might find a bit of meat left on the chicken carcass."}, {"viet": "Bà không được đến chậm, ông ấy rất đòi hỏi về điều đó.", "eng": "You mustn't be late, he was most insistent about that."}, {"viet": "Đáng lẽ anh nên nói với tôi là anh sẽ đến muộn.", "eng": "You should've told me that you would be late."}, {"viet": "Anh không nên bán thuốc lá cho thanh thiếu niên chưa đến tuổi trưởng thành.", "eng": "You shouldn't sell cigarettes to teenagers who are under age teenagers."}, {"viet": "Bạn cũng sẽ phải trả tiền thuế.", "eng": "You will have to pay tax also."}, {"viet": "Việc chỉ trích liên tục của anh đã làm giảm bớt nhiệt tình của họ.", "eng": "Your constant criticism has deadened their enthusiasm."}, {"viet": "Thái độ im lặng của anh trước những biến cố gần đây làm tôi ngạc nhiên.", "eng": "Your silence on recent events surprises me."}]