[{"viet": "4 so với 8 bằng 6 so với 12 là một điều nêu lên tỷ lệ thức.", "eng": "4 is to 8 as 6 is to 12 is a statement of proportion."}, {"viet": "Việc xem xét tỉ mỉ các sự kiện.", "eng": "A careful examination of the facts."}, {"viet": "Sự rất ít tương ứng giữa hai bản quảng cáo.", "eng": "A close correspondence between the two accounts."}, {"viet": "Một con cua kẹp ngón chân của tôi khi tôi đang lội nước.", "eng": "A crab nipped my toe while I was paddling."}, {"viet": "Từ điển cho bạn biết các từ có nghĩa gì.", "eng": "A dictionary tells you what words mean."}, {"viet": "Một gia đình ở địa vị cao trong xã hội.", "eng": "A family that ranks high on the social scale."}, {"viet": "Một hồi kèn hùng tráng báo hiệu Nữ hoàng đến.", "eng": "A flourish of trumpets marked the Queen's arrival."}, {"viet": "Một chế độ ăn uống thích hợp mang lại sức khoẻ tốt.", "eng": "A good diet conduces to good health."}, {"viet": "Một khách quen của tiệm cà phê Royal.", "eng": "A habitué of the Café Royal."}, {"viet": "Một ngôi nhà với một trăm mẫu đất tiếp giáp nó.", "eng": "A house with a hundred acres of land adjoining it."}, {"viet": "Một ngọn sóng to làm lật cái thuyền.", "eng": "A large wave upset the boat."}, {"viet": "Một bóng người đơn độc lê bước qua tuyết.", "eng": "A lone figure trudging through the snow."}, {"viet": "Một kẻ loạn trí đã làm lủng vài lỗ trên bức tranh vô giá ấy.", "eng": "A maniac had gouged several holes in the priceless painting."}, {"viet": "Người mẹ tự nhiên cảm thấy muốn che chở con cái.", "eng": "A mother naturally feels protective towards her children."}, {"viet": "Một khoản đóng góp nhỏ nhoi vào ngân quỹ.", "eng": "A niggardly contribution to the fund."}, {"viet": "Một phương pháp trắc nghiệm kiến thức sinh viên được chấp nhận về mặt sư phạm.", "eng": "A pedagogically accepted method of testing students knowledge."}, {"viet": "Một vở kịch được viết riêng cho chương trình phát thanh.", "eng": "A play specially written for radio."}, {"viet": "Một giải thưởng dành cho kiểu mẫu đồ gỗ xuất sắc.", "eng": "A prize for excellence in furniture design."}, {"viet": "Một học thuyết mới nhưng lại xa thực tế hơn nữa.", "eng": "A recent and yet more improbable theory."}, {"viet": "Một điều nhắc nhở đột ngột về mối nguy họ gặp phải.", "eng": "A rude reminder of the danger they were in."}, {"viet": "Một tiểu luận nghiêm túc về các vấn đề xã hội.", "eng": "A serious essay about social problems."}, {"viet": "Một thiểu số nhỏ bỏ phiếu chống kiến nghị đó.", "eng": "A small minority voted against the motion."}, {"viet": "Một đội năm tàu chiến đã xuất phát đêm qua.", "eng": "A squadron of five ships sailed last night."}, {"viet": "Một áo đầm mùa hè có dây đeo vai mỏng.", "eng": "A summer dress with thin shoulder-straps."}, {"viet": "Một đám đông những kẻ ái mộ đứng đợi để nhìn thấy ngôi sao đó.", "eng": "A throng of fans waiting to see the star."}, {"viet": "Một làng cách Leeds 5 dặm về phía bắc.", "eng": "A village 5 miles north of Leeds."}, {"viet": "Một lời khuyên nhủ, cảm thông, cảnh cáo.", "eng": "A word of advice, sympathy, warning."}, {"viet": "Giành được thắng lợi với ít công sức.", "eng": "Achieve success with a modicum of effort."}, {"viet": "Sau một tội phạm, sự tình nghi thường nhắm vào người có động cơ làm điều đó.", "eng": "After a crime, suspicion naturally falls on the person who has a motive for it."}, {"viet": "Sau thắng lợi bầu cử của mình, đảng đó ở vào thời kỳ hưng thịnh nhất.", "eng": "After its election victory, the party was on the crest of a wave."}, {"viet": "Sau trận đấu, ba thanh niên đã bị bắt.", "eng": "After the match three youths were arrested."}, {"viet": "Tất cả tiền giấy của Mỹ đều được in trên giấy trắng cùng cỡ bằng mực màu xanh lá cây.", "eng": "All American paper currency is printed on the same size white paper with green ink."}, {"viet": "Tất cả các nhân viên được xem xét lý lịch có liên hệ với các nhóm cực đoan hay không trước khi được mướn.", "eng": "All staff are vetted for links with extremist groups before being employed."}, {"viet": "Allen đã vào sân thay cho Lineker ngay trước khi hết hiệp thứ nhất.", "eng": "Allen went on in place of Lineker, just before half time."}, {"viet": "Trong số đó có Taurus ( Thiên Ngưu ), Canis Major ( Đại Khuyển ), Pegasus ( Phi Mã ), Draco ( Thiên Long ), Ursa Major ( Đại Hùng Tinh ), Ursa Minor ( Tiểu Hùng Tinh ).", "eng": "Among them are Taurus ( the Bull ), Canis Major ( the Big Dog ), Pegasus ( the Winged Horse ), Draco ( the Dragon ), Ursa Major ( the Big Bear ), and Ursa Minor ( the Little Bear )."}, {"viet": "Một bài báo được in lại toàn bộ trong một bộ sưu tập sau.", "eng": "An article reprinted in extensor in a later collection."}, {"viet": "Một lời giảng được đưa ra ở một trình độ đơn giản để đứa trẻ cũng có thể hiểu được.", "eng": "An explanation pitched at a simple level so that a child could understand it."}, {"viet": "Bạch tuộc có giác mút trên các xúc tu của nó.", "eng": "An octopus has suckers on its tentacles."}, {"viet": "Một phương pháp để giải quyết một vấn đề không hợp lý.", "eng": "An unscientific approach to a problem."}, {"viet": "Những động vật sống ở biển sâu là những sinh vật trông rất kỳ quái.", "eng": "Animals of the deep sea are strange-looking creatures."}, {"viet": "Xuất hiện mỗi tối ở rạp hát địa phương.", "eng": "Appearing nightly at the local theatre."}, {"viet": "Điện, nước, điện thoại có tính luôn trong tiền thuê không?", "eng": "Are utilities included in the rent?"}, {"viet": "Ông không khiêu vũ à, ông D?", "eng": "Are you not dancing, Mr. D?"}, {"viet": "Sức nóng nhân tạo thúc đẩy sự tăng trưởng của cây.", "eng": "Artificial heating hastens the growth of plants."}, {"viet": "Một cuộc hành trình càng êm xuôi càng tốt.", "eng": "As smooth a journey as possible."}, {"viet": "Sắc đẹp như tạc đáng ngạc nhiên của các cô gái hợp xướng.", "eng": "Astonishing plastic beauty of the chorus girls."}, {"viet": "Đồng thời nó có thể cho hàng dặm bờ đắp dùng để tắm và bơi thuyền.", "eng": "At the same time it may provide miles of shore line, with chances for bathing and for boating."}, {"viet": "Thống nhất thành một nhóm để chống lại kẻ thù chung.", "eng": "Band together against a common enemy."}, {"viet": "Bị bất lợi vì thiếu vốn kiến thức.", "eng": "Be handicapped by a lack of education."}, {"viet": "Vì tính cách hoàn toàn trì trệ của cơ chế đó nên nhiều việc cải cách hết sức cần thiết chưa bao giờ được đưa ra.", "eng": "Because of the sheer inertia of the system many badly needed reforms were never introduced."}, {"viet": "Những thứ bán chạy nhất trong tuần này là cà rốt và cải bắp, đó là những thứ đang có nhiều và rẻ.", "eng": "Best buys of the week are carrots and cabbages, which are plentiful and cheap."}, {"viet": "Cả các sĩ quan lẫn hạ sĩ quan đều tham dự.", "eng": "Both commissioned and non-commissioned officers attended."}, {"viet": "Brown đứng ngoài đội tuyển Anh.", "eng": "Brown is out of the England team."}, {"viet": "Nhưng tôi phải làm quen lái xe bên ngược chiều.", "eng": "But I'll have to get used to driving on the wrong side of the road."}, {"viet": "Thế còn chúng tôi thì sao? anh ta xen vào.", "eng": "But what about us? He put in."}, {"viet": "À này, cô có thể thu xếp một bàn nhìn ra sông được không?", "eng": "By the way, can you arrange a table overlooking the river?"}, {"viet": "Xin cho tôi cái túi đựng thức ăn thừa được không?", "eng": "Can I have a doggy bag for the leftovers?"}, {"viet": "Chúng ta có thể bàn đến các kế hoạch về việc đi nghỉ mát được không?", "eng": "Can we speak about plans for the holidays?"}, {"viet": "Bạn có thể chơi bóng chày cuối tuần tới không?", "eng": "Can you play baseball next weekend?"}, {"viet": "Anh không thể bảo được đứa bé đó à?", "eng": "Can't you control that child?"}, {"viet": "Thay đổi kế hoạch của ai vào phút cuối cùng.", "eng": "Change one's plans at the last minute."}, {"viet": "Thái thịt thành từng miếng vuông trước khi rán.", "eng": "Chop the meat into cubes before frying it."}, {"viet": "Ở đây mùa đông lạnh là ngoại lệ chứ không phải là thông lệ.", "eng": "Cold winters here are the exception rather than the rule."}, {"viet": "Làm theo đúng các thủ tục cần thiết.", "eng": "Comply with all the necessary formalities."}, {"viet": "Thông lệ buộc bộ trưởng phải từ chức trong trường hợp như vậy.", "eng": "Convention dictates that a minister should resign in such a situation."}, {"viet": "Anh có thể giữ chỗ xếp hàng của tôi được không?", "eng": "Could you keep my place in the queue for me?"}, {"viet": "Hành động tội phạm hình như là điển hình trong vùng lân cận này.", "eng": "Criminal behavior seems to be the norm in this neighbourhood."}, {"viet": "David nhận thấy rằng nó khó mà kết bạn được với những đứa bé khác.", "eng": "David finds it hard to make friend with other children."}, {"viet": "Quay một vòng tròn bằng cây compa.", "eng": "Describe a circle with a pair of compasses."}, {"viet": "Anh có đưa bức thư nhắn tin của tôi cho bố tôi không?", "eng": "Did you deliver my message to my father?"}, {"viet": "Dilley bắt đầu ném bóng sau bữa trà.", "eng": "Dilley went on to bowl after tea."}, {"viet": "Các công ty Nhật có cung cấp các lợi ích và các khoản tiền thưởng tốt cho nhân viên của họ phải không?", "eng": "Do Japanese companies provide good benefits and incentives to their employees?"}, {"viet": "Anh có thuộc một tổ chức nghề nghiệp nào không?", "eng": "Do you belong to any professional associations?"}, {"viet": "Bà có tài khoản nào ở đây không?", "eng": "Do you have any account here?"}, {"viet": "Bạn có biết thức ăn Nhật nào có nhiều chất sắt không?", "eng": "Do you know what Japanese food is high in iron?"}, {"viet": "Bạn có đọc tạp chí Time hay Newsweek không?", "eng": "Do you read Time Magazine or Newsweek?"}, {"viet": "Bạn có nghĩ bạn được thăng tiến không?", "eng": "Do you think you'll get a promotion?"}, {"viet": "Vết mổ có làm anh bứt rứt lắm không?", "eng": "Does the pain from your operation bother you much?"}, {"viet": "Thôi khỏi phiền-để chút nữa em làm.", "eng": "Don't bother-I'll do it later."}, {"viet": "Đừng ngắt lời cô ta: để cô ta phát biểu quan điểm của mình.", "eng": "Don't interrupt her: let her have her say."}, {"viet": "Đừng có vội đi-tôi chưa xong mà.", "eng": "Don't rush off-I haven't finished."}, {"viet": "Đừng lo lắng, nó được thoả thuận rồi.", "eng": "Don't worry, it's a done deal."}, {"viet": "Ngây người ra trước tấm ảnh của một ngôi sao nhạc Pop.", "eng": "Drooling over a photo of a pop star."}, {"viet": "Những cơn gió lốc nổi lên từ thung lũng.", "eng": "Eddies of mist rose from the valley."}, {"viet": "Nhớ gắn chặt lưới sắt bảo vệ khi máy hoạt động.", "eng": "Ensure that the grille is in place while the machinery is in operation."}, {"viet": "Ngày nào cô ta cũng đến trễ năm phút, không có ngoại lệ.", "eng": "Everyday she arrives, infallibly, five minutes late."}, {"viet": "Xin lỗi, tôi hỏi anh một câu được không?", "eng": "Excuse me, may I ask you a question?"}, {"viet": "Sự mất mùa thường dẫn đến nạn đói kém.", "eng": "Failure of crops often results in famine."}, {"viet": "Ngã ngay chính giữa vũng nước đó.", "eng": "Fell spang in the middle of the puddle."}, {"viet": "Trước tiên, bạn phải làm thẳng tấm trải giường và chăn.", "eng": "First, you should straighten up the sheets and blankets."}, {"viet": "Cứ đi theo đường mòn này thì thế nào anh cũng gặp con đường lớn.", "eng": "Follow the footpath and you'll eventually hit the road."}, {"viet": "Các chính phủ nước ngoài đã được tham khảo ý kiến về quyết định này.", "eng": "Foreign governments have been consulted about this decision."}, {"viet": "Theo như tôi được biết tối qua thì chúng ta sẽ cần một chủ tịch mới.", "eng": "From what I heard last night we're going to need a new chairman."}, {"viet": "Làm cho một đề nghị được uỷ ban chấp thuận.", "eng": "Get a proposal through a committee."}, {"viet": "Thông báo về sự nghỉ hưu của ai.", "eng": "Give notice of one's retirement."}, {"viet": "Hãy đi thẳng xuống lối này, đó là một chỗ ngồi gần cửa sổ ở khoảng giữa lối đi.", "eng": "Go straight down this aisle, it's a window seat about halfway down the aisle."}, {"viet": "Đưa ra những lập luận của mình dựa trên các sự kiện.", "eng": "Ground one's arguments on facts."}, {"viet": "Có bất cứ ai thấy hai con chó của chúng tôi không?", "eng": "Has anybody seen our two dogs?"}, {"viet": "Anh đã dẹp đi mấy cuốn sách trên bàn chưa?", "eng": "Have you cleared away your books from the table?"}, {"viet": "Cô có biết gì về chuyện tình mới nhất của hắn chưa?", "eng": "Have you heard about his latest amour?"}, {"viet": "Anh ta đã nuôi dưỡng mối bất bình với ông chủ.", "eng": "He'd been harbouring a grievance against his boss."}, {"viet": "Anh ta luôn đưa ra những lời nhận xét thô lỗ về chủ của mình.", "eng": "He's always making rude comments about his boss."}, {"viet": "Anh ta đang cảm thấy hơi yếu mệt sau bữa tiệc tối hôm qua.", "eng": "He's feeling a bit fragile after last night's party."}, {"viet": "Anh ta không thạo việc trông trẻ nhỏ.", "eng": "He's not competent to look after young children."}, {"viet": "Anh ta quá ích kỷ không nghĩ đến chuyện cho tôi mượn chiếc xe ôtô của anh ta.", "eng": "He's too selfish to think of lending me his car."}, {"viet": "Hắn luôn luôn chửi thề và báng bổ khi hắn say.", "eng": "He always swears and blasphemes when he's drunk."}, {"viet": "Nó tin vào ma quỷ và bọn phù thủy.", "eng": "He believes on devil and witches."}, {"viet": "Hiện giờ anh ấy không thể đến nghe điện thoại được.", "eng": "He can not get to the phone right now."}, {"viet": "Anh ta tra cứu các biên niên sử của thời đại.", "eng": "He consulted the chronicles of the period."}, {"viet": "Ông ta ủy quyền điều hành khoa cho một viên trợ lý.", "eng": "He deputed the running of the department to an assistant."}, {"viet": "Anh ta không thích nhạc nhưng vợ anh ta lại thích.", "eng": "He doesn't like music but his wife does."}, {"viet": "Anh ta không thể lên tới đỉnh núi được.", "eng": "He failed in his bid to reach the summit."}, {"viet": "Anh ấy chiến đấu hết mình cho đất nước.", "eng": "He fought body and soul for his country."}, {"viet": "Ông ấy hay ra ngoài uống rượu hầu hết các buổi tối.", "eng": "He goes out drinking most evenings."}, {"viet": "Anh ta đã phá ngang và thích việc làm ăn thành công lớn lao chớp nhoáng đó.", "eng": "He had dropped out of school and gone for that big score."}, {"viet": "Ông ấy có một khu nhà đất ở vùng phía Tây.", "eng": "He has a property in the West Country."}, {"viet": "Ông ta chẳng bao giờ thực sự là loại người thích giao tiếp.", "eng": "He has never really been the sociable type."}, {"viet": "Anh ta giúp tôi khỏi lo lắng.", "eng": "He helped us get out from under."}, {"viet": "Anh ta bị lu mờ trước người vợ vừa thông minh vừa vui vẻ hơn mình.", "eng": "He is eclipsed by his wife, who is much cleverer and more amusing than he is."}, {"viet": "Anh ấy nhỏ hơn cô ta ba tuổi.", "eng": "He is three years her junior."}, {"viet": "Nó cứ lầm tưởng rằng mình là một diễn viên giỏi.", "eng": "He labours under the delusion that he's a fine actor."}, {"viet": "Trông ông ta thật kỳ cục trong bộ đồ đó.", "eng": "He looked absurd in that get-up."}, {"viet": "Nó đã đặt thành một thói quen là chẳng bao giờ vay tiền.", "eng": "He makes it a rule never to borrow money."}, {"viet": "Nó chẳng bao giờ ăn nói từ tốn-lúc nào cũng chỉ la hét.", "eng": "He never speaks calmly-just snaps all the time."}, {"viet": "Ông ta vẹo đùa má đứa bé.", "eng": "He pinched the child's cheek playfully."}, {"viet": "Anh ta thức suốt đêm trước kỳ kiểm tra hoá.", "eng": "He pulled an all-nighter before his chemistry test."}, {"viet": "Anh ta nhớ lại cuộc trò chuyện của anh ta với cô ấy từ bao năm trước.", "eng": "He recalled his talk with her aeons ago."}, {"viet": "Ông ta đã trở lại làm việc sau một thời gian nằm bệnh viện.", "eng": "He returned to work after an interval in hospital."}, {"viet": "Ông ta lúc nào cũng lên mặt ông chủ với vợ.", "eng": "He's always bossing his wife."}, {"viet": "Anh ta nhận được vai chính trong bộ phim mới.", "eng": "He's got the star role in the new film."}, {"viet": "Ông ấy kiếm được 50.000 bảng Anh một năm.", "eng": "He's pulling in £ 50,000 a year."}, {"viet": "Ông ta công kích nhân chứng, buộc tội anh ta nói dối.", "eng": "He sailed into the witness, accusing him of lying."}, {"viet": "Nó dường như nhầm dấu cộng với dấu trừ.", "eng": "He seems to have mistaken a plus for a minus."}, {"viet": "Anh ta đóng cửa không cho cô ấy vào.", "eng": "He shut the door on her."}, {"viet": "Anh ta nói với giọng nhiệt tình vốn có của mình.", "eng": "He spoke with characteristic enthusiasm."}, {"viet": "Nó đánh diêm và châm ngòi nổ.", "eng": "He struck a match and ignited the fuse."}, {"viet": "Rằng phải nhẫn nhục chấp nhận số phận cho dù số phận ấy thế nào đi nữa.", "eng": "He taught them that one should accept his meekly, no matter what that fate was."}, {"viet": "Anh ta thấu hiểu ý nghĩa lời nói của cô ấy.", "eng": "He took I the full meaning of her word."}, {"viet": "Nó bước hụt chân và đập đầu vào lan can.", "eng": "He tripped and bashed his head against the railing."}, {"viet": "Hắn dắt con ngựa lên đồi.", "eng": "He walked the horse up the hill."}, {"viet": "Anh ta có tham vọng vượt ra khỏi tầng lớp thường dân.", "eng": "He was ambitious to get out of the ruck."}, {"viet": "Hắn bị lừa tước đoạt hết tài sản thừa kế hợp pháp.", "eng": "He was cheated out of his rightful inheritance."}, {"viet": "Anh ta đã bị ngăn chặn trong mưu toan lừa gạt chúng tôi.", "eng": "He was foiled in his attempt to deceive us."}, {"viet": "Anh ta như một người anh đối với tôi vậy.", "eng": "He was like a brother to me."}, {"viet": "Ông ta bị truy tố vì vượt quá tốc độ giới hạn.", "eng": "He was prosecuted for exceeding the speed limit."}, {"viet": "Anh ta rất đau lòng vì những lời sỉ nhục của họ.", "eng": "He was stung by their insults."}, {"viet": "Anh ta đói lả, nên tôi phải đỡ anh ta.", "eng": "He was weak with hunger, so I had to support him."}, {"viet": "Dứt khoát nó sẽ chết nếu anh không gọi bác sĩ.", "eng": "He will certainly die if you don't call a doctor."}, {"viet": "Cô ta có thói quen tắm hoặc nói chuyện điện thoại hàng giờ liền.", "eng": "He would spend hours in the bathroom or on the telephone."}, {"viet": "Xin chào, cô đang tìm mua loại xe mới nào?", "eng": "Hello, what kind of car are you looking for?"}, {"viet": "Những năm gần đây sách của bà ta viết tệ quá.", "eng": "Her book has gone off in recent years."}, {"viet": "Bàn viết cô ta bừa bộn sách vở và giấy tờ.", "eng": "Her desk was covered in litter of books and papers."}, {"viet": "Những dấu tay của cô ta trên khẩu súng là bằng chứng thuyết phục rằng cô ta có tội.", "eng": "Her fingerprints on the gun were conclusive proof of her guilt."}, {"viet": "Chồng cô ta được đưa đến bệnh viện lúc ban đêm.", "eng": "Her husband was taken to hospital during the night."}, {"viet": "Chồng của cô ấy đã được các ông chủ của anh ta cử ra nước ngoài.", "eng": "Her man's been sent overseas by his employers."}, {"viet": "Cha mẹ cô ta phê bình cô ta về chuyện thi trượt khóa đó.", "eng": "Her parents put her down for failing the course."}, {"viet": "Lương cô ta khoảng 150 pao một tuần.", "eng": "Her salary is of the order of 150 pounds a week."}, {"viet": "Lý thuyết của bà ấy đã được trích dẫn mà không có lấy một lời cám ơn.", "eng": "Her theory quoted without an acknowledgement."}, {"viet": "Anh ấy đây-chỉ một Frank Sinatra duy nhất mà thôi!", "eng": "Here he is-the one and only Frank Sinatra!"}, {"viet": "Địa chỉ của ông ta là 155 phố Smith.", "eng": "His address is 155 Smith Street."}, {"viet": "Quyển sách ông ấy viết không thể hiện tài năng nhiều lắm.", "eng": "His book did not display over-much talent."}, {"viet": "Câu chuyện của anh ta đầy những câu tục tĩu.", "eng": "His conversation was literally larded with obscenities."}, {"viet": "Tính phung phí của nó giải thích tại sao nó luôn luôn nợ nần.", "eng": "His extravagance explains why he is always in debt."}, {"viet": "Ông ta nói hay ngập ngừng làm thính giả chán ngán.", "eng": "His frequent hesitations annoyed the audience."}, {"viet": "Thái độ hờ hững của anh ta càng khích động thêm sự thù ghét của cô ấy.", "eng": "His indifference was a fuel to her hatred."}, {"viet": "Thái độ của hắn quá đột ngột nên trở thành thô lỗ.", "eng": "His manner was abrupt to the point of rudeness."}, {"viet": "Lối làm việc riêng biệt của anh ấy.", "eng": "His own peculiar way of doing things."}, {"viet": "Sự bác bỏ thẳng thừng của anh ta trước đề nghị ấy.", "eng": "His rash dismissal of the offer."}, {"viet": "Bài nói của ông ấy có tác động tới cảm xúc của chúng ta hơn là lí trí.", "eng": "His speech had an effect on our emotions rather than on our reason."}, {"viet": "Sự ra đi, sa thải, cách chức, v. v. thô bạo của hắn.", "eng": "His unceremonious departure, dismissal, removal, etc."}, {"viet": "Các nhà sử học đang liên tục giải thích những sự kiện của quá khứ theo một cách mới.", "eng": "Historians are continually reinterpreting the events of the past."}, {"viet": "Hy vọng có một cuộc sống khá hơn trong một kiếp khác.", "eng": "Hopes for a better life in another incarnation."}, {"viet": "Làm sao Tôi có thể đến công viên Quốc Gia bằng xe điện ngầm?", "eng": "How can I get to the National Park by subway?"}, {"viet": "Tại sao anh biết tôi sẽ nói điều đó? Anh đúng là có thần giao cách cảm.", "eng": "How did you know I was going to say that? You must be telepathic."}, {"viet": "Truyền thống đó có từ lúc nào vậy?", "eng": "How far does the tradition go back?"}, {"viet": "Các ông sẽ sử dụng phòng hội nghị trong bao lâu?", "eng": "How long will you be using the conference room?"}, {"viet": "Mỗi ngày bạn nhai bao nhiêu cây kẹo cao su?", "eng": "How many sticks of gum do you chew every day?"}, {"viet": "Tôi phải trả bao nhiêu cho một bộ?", "eng": "How much should I pay for a set?"}, {"viet": "Vô số chim đã về tụ tập từng đàn ở bên hồ.", "eng": "Huge numbers of birds had flocked together by the lake."}, {"viet": "Tôi muốn một bánh thịt băm phó mát và cho mọi thứ vào.", "eng": "I'd like one double cheese burger, all the way."}, {"viet": "Tôi cho rằng hai đấu thủ này gần như ngang tài ngang sức.", "eng": "I'd say the two players are pretty even."}, {"viet": "Tôi sẽ phải đổi cái phích của máy sấy tóc.", "eng": "I'll have to change the plug on the hair drier."}, {"viet": "Tôi sẽ đưa ông ra tòa trừ khi ông thanh toán nợ sòng phẳng cho tôi ngay lập tức.", "eng": "I'll take you to court unless you pay up immediately."}, {"viet": "Tôi luôn luôn bị buộc phải xì tiền cho những cuộc đi chơi của nhà trường.", "eng": "I'm always being asked to stump up for school outings."}, {"viet": "Tôi sẽ lái xe không về ngay sau khi bốc chỗ khoai này xuống.", "eng": "I'm going to dead head home as soon as I unload these potatoes."}, {"viet": "Tôi không phải là người làm công thường xuyên, tôi làm việc ở đây theo một hợp đồng có kỳ hạn nhất định.", "eng": "I'm not a permanent employee, I'm working here on a fixed-term contract."}, {"viet": "Tối nay tôi sẽ mặc sức uống một chai sâm banh cho đã.", "eng": "I'm really going to indulge myself tonight with a bottle of champagne."}, {"viet": "Tôi chắc chắn rằng anh ta nói điều đó chỉ vì ác ý.", "eng": "I'm sure he only said it out of spite."}, {"viet": "Tôi có tính rất lựa chọn những người cộng tác.", "eng": "I'm very selective about the people, I associate with."}, {"viet": "Tôi đã đeo chiếc túi này đi suốt cả ngày.", "eng": "I've been toting this bag round all day."}, {"viet": "Tôi không có gì ăn kể từ bữa trưa.", "eng": "I've had nothing to eat since lunchtime."}, {"viet": "Tôi đã lục kỹ trong nhà để tìm những giấy tờ đó, nhưng vẫn không thấy.", "eng": "I've ransacked the house for those papers, but I can't find them."}, {"viet": "Tôi đồng ý với anh ở mức độ nào đó.", "eng": "I agree with you up to a certain point."}, {"viet": "Tôi kiên định theo học lớp huấn luyện.", "eng": "I am intent on attending the training classes."}, {"viet": "Tôi đến muộn nhưng may là cuộc họp đã được hoãn lại.", "eng": "I arrived late but luckily the meeting had been, delayed."}, {"viet": "Tôi mua một chiếc thuyền nhỏ, thế là nó chơi trội bằng cách mua một chiếc du thuyền.", "eng": "I bought a small boat, then he went one better and bought a yacht."}, {"viet": "Tôi không thể nào dự tính được kế hoạch sẽ thực hiện như thế nào.", "eng": "I can't envisage the plan working."}, {"viet": "Tôi không thể dồn nhiều nhiệt tình cho đề án.", "eng": "I can't summon up much enthusiasm for the project."}, {"viet": "Tôi còn nhớ như chuyện đó mới xảy ra hôm qua.", "eng": "I can remember it as if it were yesterday."}, {"viet": "Tôi không làm nổ máy chiếc ôtô được.", "eng": "I can't start the car."}, {"viet": "Qua vẻ mặt của nàng tôi có thể đoán rằng có một cái gì kinh khủng đã xảy ra.", "eng": "I could tell by the look on her face that something terrible had happened."}, {"viet": "Xin cho cháu trả tiền phần ăn của mình.", "eng": "I'd like to pay for my meal."}, {"viet": "Tôi đã không nhận ra sự mãnh liệt của các cảm xúc của nhân dân về vấn đề này.", "eng": "I didn't realize the intensity of people's feelings on this issue."}, {"viet": "Dạo này tôi không có ( nhiều ) thì giờ để đọc sách.", "eng": "I don't have ( much ) time to read these days."}, {"viet": "Tôi không thích căn phòng này-chúng ta hãy đòi một căn phòng khác.", "eng": "I don't like this room-let's ask for another."}, {"viet": "Tôi không muốn tất cả mọi người nhìn thấy chúng ta.", "eng": "I don't want the whole world to see us."}, {"viet": "Tôi không thích phải vội vã trong khi ăn.", "eng": "I don't like having to hurry when eating my meal."}, {"viet": "Tôi hy vọng là bằng cách nào đó chúng tôi mầy mò mãi rồi cũng xong!", "eng": "I expect we shall muddle through somehow!"}, {"viet": "Tôi cảm thấy hồ hởi vô cùng và năng động trở lại.", "eng": "I felt exalted and newly alive."}, {"viet": "Tôi thấy kinh nghiệm đó hữu ích cho việc giáo dục nhất.", "eng": "I found the experience most educational."}, {"viet": "Hôm nay tôi đã có kết quả kỳ thi của tôi.", "eng": "I got my exam results today."}, {"viet": "Đêm qua tôi trằn trọc mãi mới ngủ được.", "eng": "I had great difficulty getting off to sleep last night."}, {"viet": "Tôi không thích nhìn thấy anh khổ sở như vậy.", "eng": "I hate to see you so unhappy."}, {"viet": "Tôi chỉ có một thú tiêu khiển-chơi gôn.", "eng": "I have just one-playing golf."}, {"viet": "Tôi hết sức kính trọng ngài.", "eng": "I have the greatest respect for you."}, {"viet": "Trước đây tôi chưa được thấy vườn của anh trong ánh sáng ban ngày.", "eng": "I haven't seen your garden in daylight before."}, {"viet": "Tôi thở phào nhẹ nhõm khi nghe tin anh ấy vô sự.", "eng": "I heaved a sigh of relief when I heard he was safe."}, {"viet": "Tôi hy vọng bạn có ống nhòm!", "eng": "I hope you have some binoculars!"}, {"viet": "Tôi biết kết quả cuộc đua đã được sắp xếp trước.", "eng": "I knew the race were fixed."}, {"viet": "Tôi thích loại bia mạnh và ngon.", "eng": "I like a good strong brew."}, {"viet": "Hai tháng sau tôi sẽ trở về tính từ ngày hôm nay.", "eng": "I'll be back two months from today."}, {"viet": "Tôi sẽ phải đi giải thích chuyện đã xảy ra.", "eng": "I'll just go explain what happened."}, {"viet": "Tôi chỉ có thích bới xáo linh tinh trong vườn.", "eng": "I love just messing about in the garden."}, {"viet": "Tôi đi đây, bà ta sụt sịt nói.", "eng": "I'm going, she said with a sniff."}, {"viet": "Tôi nghĩ rằng anh ấy đúng.", "eng": "I'm of the opinion that he is right."}, {"viet": "Tôi đã hành động một cách ngu ngốc tại buổi họp, đứng lên rồi lại quên mất câu hỏi.", "eng": "I made a real ass of myself at the meeting-standing up and then forgetting the question."}, {"viet": "Tôi phải tham khảo ý kiến những người ủy nhiệm của tôi trước khi thỏa thuận về đề nghị của ông.", "eng": "I must consult my principals before agreeing to your proposal."}, {"viet": "Tôi cần đôi giày mới hợp với cái quần này.", "eng": "I need some new shoes to go with these trousers."}, {"viet": "Tôi chỉ mượn cuốn sách đó, nó không phải của tôi.", "eng": "I only borrowed the book it's not my own."}, {"viet": "Tôi đã hứa gửi cho anh ấy một lá thư, vì vậy bây giờ tôi sẽ viết.", "eng": "I promised to send him a letter, so I'll write it now."}, {"viet": "Tôi nhớ là cô ấy đã đưa cho tôi chìa khóa.", "eng": "I recall her giving me the key."}, {"viet": "Tôi giũ những đồ len ba lần.", "eng": "I rinsed the woollen things three times."}, {"viet": "Hình như tôi đã để thất lạc đâu mất hộ chiếu của tôi-anh có trông thấy không?", "eng": "I seem to have mislaid my passport-have you seen it?"}, {"viet": "Tôi đưa cho ông chủ mới xem một số thí dụ về công việc làm của tôi.", "eng": "I showed my new employer some examples of my work."}, {"viet": "Tôi đề nghị anh tặng cô ta vài bông hoa.", "eng": "I suggest you give her some flowers."}, {"viet": "Bố nghĩ bố sẽ ăn một bánh miếng nhân sô cô la này thôi.", "eng": "I think I'll have a piece of this chocolate pie."}, {"viet": "Tôi nghĩ là quả bom đó được nhắm vào tôi.", "eng": "I think the bomb was intended for me."}, {"viet": "Tôi nghĩ họ sẽ không bao giờ đi-đúng là có vài người không thể nào hiểu được lời gợi ý!", "eng": "I thought they'd never go-some people just can't take a hint!"}, {"viet": "Tôi đã lỡ lời trong cuộc phỏng vấn và đã nói điều gì đó hơi ngớ ngẩn.", "eng": "I tripped up in the interview and said something rather silly."}, {"viet": "Tôi đã xem nó 3 lần.", "eng": "I've seen it three times."}, {"viet": "Tôi muốn để nó sau này mới tính.", "eng": "I want to leave it till later."}, {"viet": "Tôi bị đuổi xuống bếp khi những người lớn nói chuyện ở phòng khách.", "eng": "I was banished to the kitchen while the grow-ups conversed in the lounge."}, {"viet": "Tôi nổi giận vì lời phê bình liên tục của họ.", "eng": "I was infuriated with their constant criticism."}, {"viet": "Tôi sửng sốt vì cái tin của anh ta.", "eng": "I was startled by his news."}, {"viet": "Tôi đã đến đấy may ra có thể gặp anh ta.", "eng": "I went there on the chance of meeting him."}, {"viet": "Tôi muốn nêu ý kiến phản đối về bản kiến nghị.", "eng": "I wish to dissent from the motion."}, {"viet": "Không biết trong vườn bác Black có hoa hồng nào không nhỉ?", "eng": "I wonder whether Mr. Black has any roses in his garden?"}, {"viet": "Tôi muốn đổi cái này lấy cái kia.", "eng": "I would like to exchange this for that."}, {"viet": "Tôi sẽ không sống ở đấy đâu, ồ, nếu như tôi có thể tránh được.", "eng": "I wouldn't live there, well, not if I could help it."}, {"viet": "Nếu ông ta chết mà không có thừa kế, tài sản của ông ta chuyển sang cho nhà nước.", "eng": "If he dies without an heir, his property reverts to the state."}, {"viet": "Nếu nó xa hơn chút nữa thì chúng tôi không thể đến được.", "eng": "If it were any further we wouldn't be able to get there."}, {"viet": "Nếu chúng từ 9 đến 12 tuổi, chúng cần khoảng 2500 ca-lo mỗi ngày.", "eng": "If they are from 9 to 12 years old, they need about 2,500 calories a day."}, {"viet": "Nếu như bạn bị bắt gặp tuồn hàng lậu vào trong nước thì hàng hóa đó có thể sẽ bị tịch thu.", "eng": "If you are caught smuggling goods into the country, they will probably be confiscated."}, {"viet": "Nếu anh không nói tiếng Anh tốt anh sẽ rất bất lợi nếu muốn kiếm việc làm.", "eng": "If you don't speak good English, you'll be at a big disadvantage."}, {"viet": "Nếu anh chạy thật nhanh, anh có thể kịp tàu.", "eng": "If you run like mad, you might catch the train."}, {"viet": "Những yêu sách, giả dụ, nghi ngờ, v. v. vô căn cứ.", "eng": "Ill-founded claims, assumptions, suspicions, etc."}, {"viet": "Ở Anh, xe ôtô chạy bên trái.", "eng": "In Britain cars are driven on the left."}, {"viet": "In hot water là một thành ngữ của tiếng Anh có nghĩa là nhục nhã, hổ thẹn.", "eng": "In hot water is an English idiom which means to be disgraceful, shameful."}, {"viet": "Cách đây rất lâu, tại một vài nơi, chúng sống nhiều đến nỗi vỏ của chúng tạo thành một lớp dầy hàng trăm bộ trên nền đáy biển.", "eng": "In some places long ago they lived in such numbers that their shells made a layer hundreds of feet thick on the floor of the sea."}, {"viet": "Trong hệ thống đo mét, một kilô là đơn vị trọng lượng cơ bản.", "eng": "In the metric system, a kilogram is the basic unit of weight."}, {"viet": "Về mùa đông hầu hết cây cối bị trụi lá.", "eng": "In winter most trees are disrobed of their leaves."}, {"viet": "Sự gây gổ phải chăng là một phần thuộc bản chất của tâm trí con người?", "eng": "Is aggression an essential part of the human psyche?"}, {"viet": "Rạp xine đó có chiếu phim gì hay không?", "eng": "Is that theater showing anything good?"}, {"viet": "Loại sách này có thích hợp cho bọn trẻ đọc không?", "eng": "Is this appropriate for a child to read?"}, {"viet": "Được biết anh an toàn, tôi nhẹ hẳn người đi.", "eng": "It's a great relief to know you're safe."}, {"viet": "Nó nằm trong danh sách bán chạy nhất được 2 tháng rồi.", "eng": "It's been on the best seller's list for two months."}, {"viet": "Gọt khoai tây cho một trăm người quả là công việc vất vả.", "eng": "It's hard graft peeling potatoes for a hundred people."}, {"viet": "Rủ Kim đi chơi với cậu chỉ là vô ích thôi, cô ta chỉ yêu mỗi Mark mà thôi.", "eng": "It's no use asking Kim to go out with you, she only has eyes for Mark."}, {"viet": "Thật là không may anh ta gặp tai nạn trong lúc sắp sửa đi thi.", "eng": "It's rather to tough on him having accident when he prepare to take an examination."}, {"viet": "Không thể chối cãi được rằng anh ấy là người tốt đẹp nhất cho công việc đó.", "eng": "It's undeniable that he is the best person for the job."}, {"viet": "Điều đó tùy thuộc vào số lượng đặt hàng của các ông nữa.", "eng": "It depends on the quantity you would like to order."}, {"viet": "Đi không có vé hợp lệ là phạm lỗi-phạt 8100 pao.", "eng": "It is an offence to travel without a valid ticket-penalty 8100 pounds."}, {"viet": "Cố tìm cách bào chữa cho mình khỏi bị quở trách cũng vô ích.", "eng": "It is no use trying to excuse yourself from blame."}, {"viet": "Có vẻ như vải áo khoác bị mắc kẹt trong cái khoá kéo.", "eng": "It looks as if a piece of your down jacket2'is caught in the zipper."}, {"viet": "Thật sự thì nó là thành phố khá lớn.", "eng": "It's a rather large city actually."}, {"viet": "Bây giờ đã đến giờ ăn rồi.", "eng": "It's time for dinner now."}, {"viet": "Đi từ London đến Glasgow mất khá nhiều thời gian.", "eng": "It takes quite a bit of time to get from London to Glasgow."}, {"viet": "Đó là một công việc dễ dàng, chúng tôi làm nhanh.", "eng": "It was an easy job and we did it quickly."}, {"viet": "Chúng tôi đã sớm nhận ra được sai lầm của mình.", "eng": "It was not long before we realized our mistake."}, {"viet": "Anh đóng sầm cửa vào mặt ông ấy là không thân thiện lắm.", "eng": "It wasn't very friendly of you to slam the door in his face."}, {"viet": "Nó có vô số cành và hình dáng đẹp, hệt như thác nước vậy.", "eng": "Its branches are countless and beautifully shaped, just like waterfall."}, {"viet": "Và Mary ngồi ở hai đầu bàn đối diện nhau.", "eng": "John and Mary sat at opposite ends of the table to each other."}, {"viet": "Đúng là loại tình hình nên tránh, hắn ta vẫn có cái thói đó.", "eng": "Just the type of situation to avoid, he's true to type."}, {"viet": "Học tiếng Anh thì quá dễ.", "eng": "Learning English is a piece of cake."}, {"viet": "Chúng ta hãy thử ăn thức ăn ở nhà hàng đó đi.", "eng": "Let's give that restaurant a try."}, {"viet": "Những chuyện ngồi lê đôi mách có ác ý làm tổn thương nặng nề đến thanh danh của cô ấy.", "eng": "Malicious gossip which seriously injured her reputation."}, {"viet": "Nhiều ngôi sao nhạc pop là những người nổi danh một thời chỉ sau một vài năm.", "eng": "Many pop stars are has-beens after only a few years."}, {"viet": "Những vấn đề được nêu lên từ cuộc họp trước.", "eng": "Matters brought forward from the last meeting."}, {"viet": "Chúc ông sống lâu trăm tuổi.", "eng": "May you live to be a hundred years old."}, {"viet": "Phần lớn các vị khách đều thích bắt đầu bữa ăn của họ bằng món khai vị mặn và có vị đậm đà.", "eng": "Most guests like to begin their meal with appetizers or starters, which are salty and have a strong taste."}, {"viet": "Thưa ông Yamamoto, chữ ký duyệt của ông trên những ngân phiếu này dường như không phù hợp với những chữ ký ở góc trên bên trái.", "eng": "Mr. Yamamoto, your countersigns on these cheques do not seem to be in agreement with the signatures on the upper left corner."}, {"viet": "Chiếc xe hơi của tôi lại nảy ra cái tật là cứ chết máy khi leo đồi dốc.", "eng": "My car has developed a trick of stalling on steep hills."}, {"viet": "Ông hàng xóm ba hoa của tôi đã tiết lộ bí mật.", "eng": "My garrulous neighbour had given away the secret."}, {"viet": "Vật duy nhất để nhớ lại ông ta tôi có được là bản dịch của ông.", "eng": "My only memento of him is his translation."}, {"viet": "Vợ chồng tôi đã cố gắng học một ít tiếng Quảng Đông để nói trong chuyến đi của chúng tôi đến đây, nhưng ngôn ngữ của quý vị phức tạp gần như máy vi tính vậy.", "eng": "My wife and I have been trying to learn some Cantonese for our trip here, but your language is about as complicated as computers."}, {"viet": "Chỉ trong vài phút, tin được nghỉ đã được cả trường biết.", "eng": "News of the holiday was all over the school within minutes."}, {"viet": "Không, họ ngủ ở những chỗ khác nhau.", "eng": "No, they sleep in different places."}, {"viet": "Tiếng ồn của giao thông đã bắt đầu gây ra lo ngại.", "eng": "Noise of traffic is becoming a cause for concern."}, {"viet": "Ngày nay mỡ là dầu ăn.", "eng": "Nowadays, the fat is cooking oil."}, {"viet": "Ồ, không có gì đặc biệt cả, tôi nghĩ vậy.", "eng": "Oh, nothing in particular, I guess."}, {"viet": "Khi đến nơi, ông tổng thống đã duyệt đội quân danh dự.", "eng": "On his arrival the president inspected the guard of honour."}, {"viet": "Một nhóm đã rời trại để kiếm củi.", "eng": "One group left the camp to forage for firewood."}, {"viet": "Chỉ có than hồng của đống lửa đốt rác còn lại.", "eng": "Only the embers of the bonfire remained."}, {"viet": "Số phận của chúng tôi dường như ràng buộc với nhau không tách rời được.", "eng": "Our fates seemed inextricably intertwined."}, {"viet": "Các tên lửa của chúng ta có thể được phóng lên trong giây lát.", "eng": "Our nuclear missiles can be launched at a moment's notice."}, {"viet": "Va-li của chúng ta ở phía bên kia kìa.", "eng": "Ours are on the other side, there."}, {"viet": "Hành khách có xe ôtô phải lên trước.", "eng": "Passengers with cars must embark first."}, {"viet": "Trong khi đâm đầu xông ra, nhiều người đã bị giẫm bẹp.", "eng": "People were trampled in the headlong rush."}, {"viet": "Vui lòng nói với anh ấy là tôi đã gọi, và nhắn anh ấy gọi cho tôi lúc nào đó vào tối nay.", "eng": "Please tell him i've called, and ask him to call me sometime this evening."}, {"viet": "Ngọc bích thật luôn luôn mát lạnh khi sờ vào và sẽ không bị trầy.", "eng": "Real jade is always cool to touch and will resist scratching."}, {"viet": "Cơ quan mật vụ đã khám phá ra một âm mưu nhằm giết Tổng thống.", "eng": "Secret Service smelled out a plot to kill the President."}, {"viet": "Giá cổ phần đã chững lại sau khi tăng vọt ngày hôm qua.", "eng": "Share values have levelled off after yesterday's steep rise."}, {"viet": "Bà ta bao giờ cũng nổi bật vào những thời điểm khủng hoảng.", "eng": "She's always to the fore at moments of crisis."}, {"viet": "Cô ta chuyển sang một loại thuốc lá nhẹ hơn.", "eng": "She's gone over to a milder brand of cigarettes."}, {"viet": "Bây giờ cô ta đã vững vàng trên thương trường với nghề buôn bán sản phẩm mỹ nghệ.", "eng": "She's now firmly established in business as an art dealer."}, {"viet": "Bà ta đang rất giận dữ, đừng nói gì với bà ta cho đến khi bà ấy nguôi một chút.", "eng": "She's very angry, don't speak to her until she's cooled down a bit."}, {"viet": "Bà ta lại gần đám đông đang giận không hề quan tâm đến an toàn của bản thân.", "eng": "She approached the angry crowd with a sublime lack of concern for her own safety."}, {"viet": "Với tiền trợ cấp của ông ta, bà ấy hầu như không thể may mặc được cho con cái.", "eng": "She can hardly dress her children on the allowance he gives her."}, {"viet": "Cô ấy đếm sách có mười bốn quyển.", "eng": "She counted the books-there were fourteen of them."}, {"viet": "Cô ấy bàn kế hoạch của cô ấy với mẹ.", "eng": "She discussed her plans with her mother."}, {"viet": "Cô ấy ngã xe đạp và bị va chạm đau điếng.", "eng": "She fell off her bike and got a nasty knock."}, {"viet": "Cô ta đưa mắt nhìn xoáy vào tôi và hỏi có phải tôi đã nói dối không.", "eng": "She gave me a searching look and asked if I was lying."}, {"viet": "Cô ta luôn luôn mơ ước được đóng cùng với Olivier.", "eng": "She had always dreamed of appearing opposite Olivier."}, {"viet": "Bà ta có số nhân viên 19 người làm việc dưới quyền của mình.", "eng": "She has a staff of 19 working under her."}, {"viet": "Cô ta đã lãng phí tiền vào những cái cô ta không cần.", "eng": "She has wasted her money on things she doesn't need."}, {"viet": "Cô ấy buồn bã về cái chết của con mèo của cô ấy.", "eng": "She is disconsolate over the death of her cat."}, {"viet": "Cô ta ngoáy vội những điều ghi chép, rồi sau đó chép lại vào một quyển vở.", "eng": "She jotted down a few notes, and later transcribed them into an exercise book."}, {"viet": "Cô ấy sống trong một thế giới của tưởng tượng nếu cô ấy nghĩ rằng có thể vào đại học mà không phải học vất vả.", "eng": "She lives in a world of make-believe if she thinks she can get to school with-out working hard."}, {"viet": "Bà ta mãi mới rặn ra được vài lời cảm ơn.", "eng": "She managed to get out a few words of thanks."}, {"viet": "Chị ấy nên trông nom lũ con tốt hơn một chút.", "eng": "She ought to look after her children a bit better."}, {"viet": "Cô ấy chẳng mấy chốc đã sửa được ô tô của tôi-đúng là có phép thần!", "eng": "She put my car right in the next to no time-she's definitely got the healing touch!"}, {"viet": "Đó là một con bé vui vẻ.", "eng": "She's a cheery little soul."}, {"viet": "Cô ta chỉ đang trang điểm thôi.", "eng": "She's just putting on he make up."}, {"viet": "Cô ta thờ ơ đi qua mà chẳng thèm nhìn đến chúng tôi.", "eng": "She sashayed past, not condescending to look at us."}, {"viet": "Cô ấy khoác ba lô lên vai và bắt đầu đi dọc theo con đường.", "eng": "She shouldered her rucksack and set off along the road."}, {"viet": "Bà ta đã nằm bệnh viện cả năm trời.", "eng": "She spent the whole of the year in hospital."}, {"viet": "Bà ta hưởng một phần công trạng lớn về thành công của chúng ta.", "eng": "She takes a large slice of the credit for our success."}, {"viet": "Cô ta toan rời Cửa hàng mà không trả tiền chiếc áo.", "eng": "She tried to leave the shop without paying for dress."}, {"viet": "Cô ta muốn làm công tác xã hội khi cô ta học xong đại học.", "eng": "She wants to do social work when she finished college."}, {"viet": "Không còn nghi ngờ gì nữa, cô ta là nữ nghệ sĩ ba lê giỏi nhất thời cô ấy.", "eng": "She was beyond all doubt the finest ballerina of her day."}, {"viet": "Cô ta được khen ngợi về những việc tôi làm.", "eng": "She was given the credit for what I had done."}, {"viet": "Cô ta chỉ cao có 5 bộ.", "eng": "She was only 5 ft tall."}, {"viet": "Cô ấy hãy còn trong trạng thái phớn phở hàng giờ sau thắng lợi của mình.", "eng": "She was still in a state of euphoria hours after her victory."}, {"viet": "Cô ta đã không kém phần sung sướng vì được sống độc lập.", "eng": "She wasn't any less happy for being on her own."}, {"viet": "Cô ấy sẽ không thể giúp chúng ta được, vì cô còn bao nhiêu là ràng buộc gia đình.", "eng": "She won't be able to help us, with all her family commitments."}, {"viet": "Nàng viết ký sự về thời gian nàng lưu lại ở Pháp.", "eng": "She wrote a memoir of her stay in France."}, {"viet": "Chứng minh những yêu sách của bà ta là sai.", "eng": "Show that her claims are false."}, {"viet": "Vì chúng tôi không có tiền chúng tôi không thể mua nó.", "eng": "Since we have no money, we can't buy it."}, {"viet": "Chậm nhưng chắc chắn con tàu lớn đó chạy êm xuôi xuống nước.", "eng": "Slowly but surely the great ship glided into the water."}, {"viet": "Cho đến nay cuộc tìm kiếm của họ vẫn không có kết quả.", "eng": "So far their search has been fruitless."}, {"viet": "Các binh lính canh gác ở cung điện.", "eng": "Soldiers mounting guard at the palace."}, {"viet": "Một vài lời bình phẩm của anh ta về vẻ ngoài của nàng thật khiếm nhã.", "eng": "Some of his comments about her appearance were a bit close to the bone."}, {"viet": "Vài tên có thành tích bất hảo lảng vảng quanh các sòng bạc.", "eng": "Some sleazy characters hang around casinos."}, {"viet": "Đôi khi tôi lấy tem đã dùng ra từ những bì thư, nhưng chủ yếu là ba tôi mang chúng về làm quà lưu niệm từ những chuyến đi du lịch nước ngoài.", "eng": "Sometimes I take used stamps off letter envelopes, but mostly my dad brings them back from his overseas travels as souvenirs."}, {"viet": "Chuyên về xuất khẩu hàng cô-tông theo tấm của Trung Quốc, chúng tôi bày tỏ mong muốn bày tỏ làm ăn với quý vị về mặt hàng này.", "eng": "Specializing in the export of Chinese Cotton Piece Goods, we express our desire to trade with you in this line."}, {"viet": "Bà ta rít lên Hãy tránh xa tao ra!.", "eng": "Stay away from me! she hissed."}, {"viet": "Đừng có đi lang thang nữa và bắt tay làm việc gì đi!", "eng": "Stop mooning and get on with some work!"}, {"viet": "Việc nghiên cứu tâm lý học giúp cho giáo viên giải quyết với những học sinh khó dạy.", "eng": "Study of psychology helps teachers to deal with difficult students."}, {"viet": "Bỗng nhiên, việc sưu tập đồ cổ lại trở thành mốt thời thượng.", "eng": "Suddenly, collecting antiques is all the fashion."}, {"viet": "Số thực phẩm thừa có thể bán đi lấy tiền mặt.", "eng": "Surpluses of food can be sold for cash."}, {"viet": "Hãy lưu ý với những điều ông ấy nói.", "eng": "Take note of what he says."}, {"viet": "Dạy anh bơi không phải là trách nhiệm của tôi.", "eng": "Teaching you to swim is not my province."}, {"viet": "Thử nghiệm khả năng thương mại của năng lượng mặt trời.", "eng": "Test the commercial viability of solar power."}, {"viet": "Có lẽ là do bóng đèn bị đứt.", "eng": "That's probably because the light bulb is burnt out."}, {"viet": "Cũng còn tùy, xem chừng xe không còn chỗ trống.", "eng": "That depends there might not be room in the car."}, {"viet": "Điều đó sẽ dạy cho con bài học về cờ bạc.", "eng": "That'll teach you to gamble."}, {"viet": "Thật ra đó là một vấn đề rất rộng.", "eng": "That's a very wide question indeed."}, {"viet": "Đó là một chuyện hay nhưng tôi có thể làm tốt hơn.", "eng": "That was a good story but I can go one better."}, {"viet": "Tai nạn đã làm cô ta bị liệt từ hông trở xuống.", "eng": "The accident left her paralyzed from the waist down."}, {"viet": "Những người thích phiêu lưu có thể cắm trại trên bờ sông, nhưng họ bị cấm vào vùng nội địa.", "eng": "The adventurers can camp on the river banks, but they are forbidden to go inland."}, {"viet": "Sự giống nhau giữa tim người và cái bơm.", "eng": "The analogy between the human heart and a pump."}, {"viet": "Những họa đồ của kiến trúc sư cho một nhà hát mới.", "eng": "The architect's plans for the new theatre."}, {"viet": "Người họa sĩ coi bức tranh của anh ta như là một lời phát biểu quan điểm chính trị.", "eng": "The artist regards his painting as a political statement."}, {"viet": "Việc có được máy vi tính và máy in lade giá hợp lý làm cho việc sử dụng máy vi tính nhỏ trở thành một hiện thực.", "eng": "The availability of reasonably-priced computer and laser printers has made the use of desktop publishing packages a reality."}, {"viet": "Trái bóng bật từ tường rơi xuống ao.", "eng": "The ball rebound off the wall into the pond."}, {"viet": "Phòng tắm ở cuối hành lang bên trái.", "eng": "The bathroom is at the end of the passage on the left."}, {"viet": "Thuyết vụ nổ vũ trụ có uy lực hơn những giải thích khác về vũ trụ.", "eng": "The Big Bang theory has the ascendancy over other explanation of the universe."}, {"viet": "Nhạc blu được trình diễn đầu tiên bởi người da đen ở New Orleans.", "eng": "The blues were first performed by the black people of New Orleans."}, {"viet": "Quyển sách này không có bán ở cửa hiệu.", "eng": "The book is out of stock."}, {"viet": "Cậu bé ấy bị phát vào mông một trận nên thân.", "eng": "The boy got a sound spanking."}, {"viet": "Người giữ chức vô địch 800m của Anh.", "eng": "The British 800-metres title-holder."}, {"viet": "Chiếc xe buýt chỉ trong gang tấc là đâm vào người đi xe đạp.", "eng": "The bus missed crashing into the cyclist by a narrow squeak."}, {"viet": "Đội trưởng tuyên bố kết thúc hiệp thi đấu ở tỉ số 395 với 5 đấu thủ bị loại ra sân.", "eng": "The captain declared the innings closed at a score of 395 for 5 wickets."}, {"viet": "Chiếc ôtô quay nhanh trên con đường đóng băng.", "eng": "The car slewed round on the icy road."}, {"viet": "Con mèo đánh nhau ác liệt để bảo vệ con.", "eng": "The cat fought fiercely to defend its young."}, {"viet": "Nhà vô địch đó đã thắng trận đấu dễ dàng.", "eng": "The champion ran away with the match."}, {"viet": "Đứa bé này dán các nhãn hình lên khắp các cuốn sách học của nó.", "eng": "The child had stickers all his schoolbooks."}, {"viet": "Bọn trẻ nóng lòng mong đợi kỳ nghỉ.", "eng": "The children are longing for the holidays."}, {"viet": "Bọn trẻ xô đẩy nhau ngã trên tuyết.", "eng": "The children tumbled each other over in the snow."}, {"viet": "Hộp thuốc lá được khắc tên họ viết tắt của anh ta.", "eng": "The cigarette case was engraved with his initials."}, {"viet": "Đồng hồ chỉ bốn giờ kém mười.", "eng": "The clock stands at ten to four."}, {"viet": "Trường đại học ấy đã chiêu đãi trọng thể chúng ta vào bữa tiệc kỉ niệm 100 năm ngày thành lập.", "eng": "The college did us proud at the centenary dinner."}, {"viet": "Hồ sơ về tài chính nghèo nàn của công ty trong những năm gần đây.", "eng": "The company's poor financial showing in recent years."}, {"viet": "Việc so sánh quả tim với một cái bơm.", "eng": "The comparison of the heart with a pump."}, {"viet": "Hoàn thành sự nghiệp của cuộc đời, tham vọng, qua đêm tân hôn.", "eng": "The consummation of one's life's work, one's ambitions, a marriage."}, {"viet": "Hội đồng sẽ không cho phép anh xây dựng ở đây.", "eng": "The council will not permit you to build here."}, {"viet": "Toà còn phải thông qua bản án về vụ này.", "eng": "The court has still to pass judgement in this case."}, {"viet": "Đám đông lách qua sân bóng đá.", "eng": "The crowd funnelled out the football ground."}, {"viet": "Các khách hàng vội bỏ chạy ra khỏi ngân hàng khi chuông báo động vang lên.", "eng": "The customers fled from the bank when the alarm sounded."}, {"viet": "Thời kỳ suy đồi của nghệ thuật cuối thời Victoria.", "eng": "The decadence of the late Victorian Art."}, {"viet": "Tiền ký quỹ được hoàn lại khi xe được trả lại.", "eng": "The deposit is refunded on return of the vehicle."}, {"viet": "Vị giám đốc hi vọng vẫn còn tại vị thêm vài năm nữa.", "eng": "The director hopes to remain in the saddle for a few more years."}, {"viet": "Bác sĩ không thể bảo đảm chữa khỏi.", "eng": "The doctor cannot guarantee a cure."}, {"viet": "Con chó cắn tôi nhưng không bị trầy da.", "eng": "The dog bit me but didn't break my skin."}, {"viet": "Cánh cửa đóng sầm có vẻ như dưới xung lượng của chính nó.", "eng": "The door slammed seemingly under its own power."}, {"viet": "Người hốt rác lấy rác đi mỗi tuần một lần.", "eng": "The dustmen collect the rubbish once a week."}, {"viet": "Kết quả bầu cử được công bố kèm theo tiếng hoan hô vang dậy.", "eng": "The election results were announced to the accompaniment of loud cheering."}, {"viet": "Đội Anh dẫn đầu ở hiệp một.", "eng": "The English team was leading at half time."}, {"viet": "Kết quả kỳ thi có thể quyết định sự nghiệp của anh.", "eng": "The exam results could determine your career."}, {"viet": "Vải này cần phải nhúng sơ trong nước ấm.", "eng": "The fabric should be dabbled in warm water."}, {"viet": "Những sự hấp dẫn của xiếc là vô tận.", "eng": "The fascinations of the circus are endless."}, {"viet": "Cuốn phim đã bị nhiều lời phê bình chê thậm tệ thế mà công chúng vẫn đi xem đông.", "eng": "The film got terrible reviews but the public are lapping it up."}, {"viet": "Những người lính cứu hoả tỏ ra can đảm lạ thường.", "eng": "The firemen showed exceptional courage."}, {"viet": "Cuộc ghép đầu tiên của hai vệ tinh nhân tạo trong vũ trụ.", "eng": "The first link-up of two satellites in space."}, {"viet": "Những bông hoa nghiêng ngả trong cơn bão tố.", "eng": "The flowers took quite a buffeting in the storm."}, {"viet": "Cáo là loài nổi tiếng về sự lanh lợi và tinh khôn.", "eng": "The fox is known for its cleverness and cunning."}, {"viet": "Bọn tội phạm tẩy rửa tiền ăn cắp được qua hệ thống các hàng ăn của chúng.", "eng": "The gang laundered the stolen money through their chain of restaurants."}, {"viet": "Âm nhạc nhẹ nhàng làm êm tai ông ấy.", "eng": "The gentle music was a balm to his ears."}, {"viet": "Nguyên tắc sống của mình.", "eng": "The gospel according to which one lives."}, {"viet": "Chính phủ đã giảm lưu hành đồng 5 bảng.", "eng": "The government has reduced the number of 5 notes in circulation."}, {"viet": "Chính phủ bị tố giác là đã xuyên tạc có hệ thống vụ kiện của những kẻ chống đối.", "eng": "The Government was accused of having systematically distorted the protesters case."}, {"viet": "Đảng Xanh không có nhiều thành công chính trị ở Anh.", "eng": "The greens haven't had much political success in Britain."}, {"viet": "Những người khách trọ muốn gửi lại hành lý của họ đến khi rời khách sạn.", "eng": "The guests want to leave their bags until they leave the hotel."}, {"viet": "Các vòng chạy loại 200 mét sẽ được tổ chức vào ngày mai.", "eng": "The heats of the the 200 metres will be run off tomorrow."}, {"viet": "Con ngựa bị ngã gãy chân và phải được giết đi.", "eng": "The horse broke a leg in a fall and had to be put down."}, {"viet": "Những khuyết điểm về mặt cấu trúc của căn nhà.", "eng": "The house's structural imperfections."}, {"viet": "Sự hưởng ứng lớn lao về lời kêu gọi của chúng tôi nhấn mạnh tới vấn đề dân chúng thực sự quan tâm tới mức độ nào.", "eng": "The huge response to our appeal underlines how much the public really care."}, {"viet": "Những nhược điểm của cơ chế bầu cử hiện thời.", "eng": "The inadequacies of the present voting system."}, {"viet": "Con côn trùng không động đậy cũng không ăn.", "eng": "The insects does not move about or eat."}, {"viet": "Chiếc áo vét tông được may ôm ở phần eo.", "eng": "The jacket is shaped at the waist."}, {"viet": "Việc xét xử đó đã có lợi cho bị cáo.", "eng": "The judgment was given in favour of the accused."}, {"viet": "Đảng lao Động đã cầm quyền từ năm 1964 đến 1970.", "eng": "The Labour Party was in government from 1964 to 1970."}, {"viet": "Việc hạ thuỷ đã phải hoãn lại vì trục trặc kỹ thuật.", "eng": "The launch was delayed by a technical hitch."}, {"viet": "Lá thư đó đang được chuyển đi.", "eng": "The letter is in the mail."}, {"viet": "Con sư tử cái đã thu mình sẵn sàng tấn công.", "eng": "The lioness crouched ready to strike."}, {"viet": "Tình yêu văn thơ của anh ta được nhen lên do sự dạy dỗ của bà ấy.", "eng": "The love of poetry was kindled excitement in him by her teaching."}, {"viet": "Đa số bác sĩ đồng ý là hút thuốc lá rất có hại cho sức khoẻ.", "eng": "The majority of doctors agree that smoking is extremely harmful to health."}, {"viet": "Chiếc mặt nạ ấy vừa khít khuôn mặt anh ta.", "eng": "The mask fitted tightly over his face."}, {"viet": "Cuộc họp kết thúc và vấn đề tối quan trọng vẫn chưa được nêu ra.", "eng": "The meeting ended and the all-important question remained unasked."}, {"viet": "Sữa bị hơi nóng làm trở chua.", "eng": "The milk turned sour in the heat."}, {"viet": "Ngành nhuyễn thể bao gồm tất cả các động vật thân mềm không có xương sống.", "eng": "The mollusc phylum includes all soft-bodied animals without backbones."}, {"viet": "Bà mẹ ru cho con mình ngủ.", "eng": "The mother sang her baby to sleep."}, {"viet": "Sự thần bí của việc Đức chúa hiển hiện, của Lễ ban thánh thể, v. v.", "eng": "The mystery of the Incarnation, of the Eucharist, etc."}, {"viet": "Luật kiểm duyệt mới sẽ đẩy lùi thời gian lại 50 năm.", "eng": "The new censorship law will put the clock back by 50 years."}, {"viet": "Vở kịch mới đang thu hút một lượng thính giả đông đảo.", "eng": "The new play is pulling in a large audience."}, {"viet": "Tin đó làm cho máu chảy dồn dập trong huyết quản của nó.", "eng": "The news sent the blood pulsing through his veins."}, {"viet": "Tuyến xe phía bắc của xa lộ.", "eng": "The northbound carriageway of a motorway."}, {"viet": "Hành vi ương bướng của một đứa trẻ.", "eng": "The obstinate behaviour of a small child."}, {"viet": "Bà cụ già thấy việc đi mua hàng là rất mệt mỏi.", "eng": "The old lady finds shopping very wearing."}, {"viet": "Việc mở một quán bán hàng ở chợ phải được phép chính thức của toà thị chính.", "eng": "The opening of a marked stall is governed by municipal fiat."}, {"viet": "Những người chủ của công ty e ngại chủ nghĩa bành trướng mạnh mẽ của viên giám đốc.", "eng": "The owners of the firm feared the manager's vigorous expansionism."}, {"viet": "Đảng đó đang thất bại nặng nề trong cuộc điều tra dư luận.", "eng": "The party is trailing badly in the opinion polls."}, {"viet": "Mẫu hình suy thoái kinh tế ở Anh.", "eng": "The pattern of economic decline in Britain."}, {"viet": "Tiếng động rất khó chịu của các máy bay đang bay vào đất liền.", "eng": "The pestilent noise of aeroplanes coming into land."}, {"viet": "Người phi công đang ngồi trước bộ điều khiển.", "eng": "The pilot is at the controls."}, {"viet": "Chiếc máy bay chạy dọc theo đường trải nhựa.", "eng": "The plane taxied along the tarmac."}, {"viet": "Các cầu thủ đều căng thẳng khi bắt đầu trận đấu.", "eng": "The players were tense at the start of the game."}, {"viet": "Cảnh sát tóm cổ hắn khi hắn bước lên thuyền.", "eng": "The police collared him as he was getting on the boat."}, {"viet": "Cảnh sát vẫn nắm quyền kiểm soát tình hình.", "eng": "The police retained control of the situation."}, {"viet": "Một chú chó đáng thương bị bỏ rơi.", "eng": "The poor little puppy had been abandoned."}, {"viet": "Các quyền lực được trao cho một linh mục.", "eng": "The powers vested in a priest."}, {"viet": "Tổng thống trở lại làm việc một thời gian ngắn sau khi mổ.", "eng": "The President returned to work shortly after his operation."}, {"viet": "Bà Thủ tướng công kích tới tấp những người phê bình bà ta.", "eng": "The Prime Minister delivered a broadside at her critics."}, {"viet": "Vấn đề đó không phải là dễ dàng.", "eng": "The problem is anything but easy."}, {"viet": "Bằng chứng không chỉ dựa một mình vào lời khai đó.", "eng": "The proof does not rest alone on that statement."}, {"viet": "Những con chó con chưa mọc đủ lông.", "eng": "The puppies haven't got much fur yet."}, {"viet": "Cuộc đua thật sự đòi hỏi anh ta có kỹ năng của một vận động viên chạy đua.", "eng": "The race really stretched his skill as a runner."}, {"viet": "Lý do là có những lúc không có xe hơi chạy qua ở ngã tư.", "eng": "The reason why is, that there are times when there are no cars going by at the intersection."}, {"viet": "Tiền thuê nhà là 300 pao một tháng.", "eng": "The rent is 300 pounds per calendar month."}, {"viet": "Những kết quả được kiểm tra hàng ngày.", "eng": "The results are checkd on a daily basis."}, {"viet": "Dòng sông đang xói mòn bờ.", "eng": "The river is eating away at the bank."}, {"viet": "Người La Mã nghĩ rằng con số lẻ đem lại may mắn.", "eng": "The Romans thought that odd numbers were lucky."}, {"viet": "Tin đồn về việc thiếu hụt xăng dầu hóa ra là tin đồn nhảm.", "eng": "The rumours of a petrol shortage turned out to be a false alarm."}, {"viet": "Tỷ lệ của bản đồ này là xăng ti mét trên ki lô mét.", "eng": "The scale of this map is one centimetre to the kilometre."}, {"viet": "Những người kém cỏi và những người đần độn-nói cách khác, phần tử ngoài lề.", "eng": "The screw-ups and the space cadets-in other words, the fringe elements."}, {"viet": "Viên thượng sĩ ra lệnh cho lính siết chặt hàng ngũ.", "eng": "The sergeant-major ordered the men to close up."}, {"viet": "Chiếc tàu thủy đó đi theo một hướng nhất định.", "eng": "The ship kept to a steady course."}, {"viet": "Các cửa hiệu ở cách đây vài phút đi bộ.", "eng": "The shops are a few minutes'walk away."}, {"viet": "Vị trí xây đựng đài kỷ niệm được nhượng vĩnh viễn cho Canada.", "eng": "The site of the memorial is granted in perpetuity to Canada."}, {"viet": "Cái lưỡi con rắn phóng ra.", "eng": "The snake's tongue shot out."}, {"viet": "Muội khói và bụi bẩn của một thành phố sản xuất lớn.", "eng": "The soot and the grime of a big manufacturing town."}, {"viet": "Đồng hồ tốc độ lên đến 120 dặm Anh một giờ.", "eng": "The speedometer was touching 120 mph."}, {"viet": "Nước chảy nhỏ giọt liên tục từ một cái vòi rò rỉ.", "eng": "The steady drip of water from a leaky tap."}, {"viet": "Phố xá đều trống vắng trừ lơ thơ vài người qua đường.", "eng": "The streets were empty except for a few stray passers-by."}, {"viet": "Sự oi bức ngột ngạt của một đêm nhiệt đới.", "eng": "The suffocating heat of a tropical night."}, {"viet": "Trên bàn đã bày bánh ngọt và bánh xan uých.", "eng": "The table was spread with cakes and sandwiches."}, {"viet": "Thầy giáo cứng rắn với học sinh.", "eng": "The teacher was firm with the children."}, {"viet": "Sự tàn ác của bọn khủng bố làm dân chúng căm phẫn.", "eng": "The terrorists'ruthlessness shocked the population."}, {"viet": "Ba chủ đề hợp nhất lại ở cuối cuốn sách.", "eng": "The three themes coalesces at the end of the book."}, {"viet": "Từ lần trước tôi ở đây, thành phố đã thay đổi quá nhiều không còn nhận ra được.", "eng": "The town has altered out of all recognition since I was last here."}, {"viet": "Người thủ quỹ biển thủ quỹ của hội.", "eng": "The treasurer misappropriated the society's funds."}, {"viet": "Hai nước ở trong tình trạng chiến tranh đã hai năm rồi.", "eng": "The two countries were at war for two years."}, {"viet": "Cuộc đấu tranh không ngừng giữa thiện và ác.", "eng": "The unending struggle between good and evil."}, {"viet": "Các trách nhiệm khác nhau của chức vụ đó.", "eng": "The various responsibilities of the post."}, {"viet": "Chờ có bàn mất đến hai tiếng đồng hồ đấy.", "eng": "The wait for a table was two hours long."}, {"viet": "Thời tiết trở nên quá xấu nên họ đành phải quay trở lại.", "eng": "The weather became so bad that they had to turn back."}, {"viet": "Toàn thế giới sẽ bị ảnh hưởng của một cuộc chiến tranh hạt nhân.", "eng": "The whole world would be affected by a nuclear war."}, {"viet": "Xe bò kêu cọt kẹt khi nó chạy trên đường.", "eng": "The wooden cart creaked as it moved along the road."}, {"viet": "Giá trị giảm của hàng tồn kho không bán được.", "eng": "The written-down value of the unsold stock."}, {"viet": "Thu nhập của họ tương xứng ( với nhu cầu của họ ).", "eng": "Their earnings are adequate ( to their needs )."}, {"viet": "Nguyên nhân khiến họ làm việc đó vẫn còn là vấn đề khó hiểu đối với tôi.", "eng": "Their reason for doing it is still a puzzle to me."}, {"viet": "Lúc đó sẽ có điều kiện làm việc.", "eng": "Then there are the working conditions."}, {"viet": "Một dự án được tiến hành để sửa sang đường sá.", "eng": "There's a project afoot to improve the roads."}, {"viet": "Trong câu chuyện của nó chẳng có tí sự thật nào.", "eng": "There's not a jot of truth in his story."}, {"viet": "Luôn luôn có những sự kiện buồn trong phần tin tức.", "eng": "There are always unhappy events on the news."}, {"viet": "Có phòng riêng biệt cho sĩ quan cấp cao và sĩ quan cấp thấp.", "eng": "There are separate rooms for senior and junior officers."}, {"viet": "Vậy thì có cách nào ngăn cản quả nặng rơi nhanh khiến cho các bánh xe quay nhanh.", "eng": "There had to be some way of keeping the weight from falling down in the hurry and sending the wheels spinning around very fast."}, {"viet": "Trong caxet có một ô cửa sổ nhỏ để có thể nhìn thấy cuộn băng.", "eng": "There is a little window in the cassette case so that you can see the tape."}, {"viet": "Không có bến đỗ an toàn nào trên bờ biển đó.", "eng": "There is no safe landing on that coast."}, {"viet": "Dường như cuộc thám hiểm này ít có triển vọng thành công.", "eng": "There seems little promise of success for the expedition."}, {"viet": "Có một sự giống nhau lạ lùng giữa hai đứa trẻ.", "eng": "There was an uncommon likeness between the two boys."}, {"viet": "Còn có những Xê-da khác nữa, có người tốt, có người xấu.", "eng": "There were other Caesars, some were good, some were bad."}, {"viet": "Những đoàn lạc đà này di chuyển cả ngày lẫn đêm, cả mùa hè và mùa đông.", "eng": "These camel caravans move day and night, summer and winter."}, {"viet": "Những căn nhà cũ này sắp bị phá huỷ.", "eng": "These old houses are going to be knocked down."}, {"viet": "Tối nào cũng quảng cáo trên TV, chắc họ đang định nhồi nhét để bán cho được quyển sách.", "eng": "They're certainly giving the book the hard sell, with advertisements every night on TV."}, {"viet": "Họ cũng kiếm thức ăn bằng cách săn bắn.", "eng": "They, too, got their food by hunting."}, {"viet": "Chúng vẫn còn hơi xanh, nhưng tôi chắc là chúng ngon đấy.", "eng": "They are still a little green, but I'm sure they are good."}, {"viet": "Họ có thể tập lắng nghe những đề nghị và suy xét cẩn thận, không cần biết ai đưa ra chúng.", "eng": "They can practice listening to suggestions and considering them carefully, no matter who makes them."}, {"viet": "Họ chia nhau tiền thắng cuộc.", "eng": "They divvied up the winning between them."}, {"viet": "Họ đã sa thải anh ta vì đến muộn.", "eng": "They gave him the boot for coming in late."}, {"viet": "Họ cung cấp lối thoát khí trên trần để không khí trong lành vào phòng.", "eng": "They have provided vents in the ceiling for fresh air to center the room."}, {"viet": "Họ đã lạc đường trong sa mạc rồi chết khát.", "eng": "They lost their way in the desert and died of thirst."}, {"viet": "Họ đã mua hầu hết bàn ghế tại cuộc bán đấu giá ở các thị trấn miền quê.", "eng": "They picked up the most of the furniture at auctions in country towns."}, {"viet": "Họ làm xà lan chìm xuống bằng cách đục một lỗ thủng ở đáy.", "eng": "They sank the barge by making a hole in the bottom."}, {"viet": "Họ dừng lại một lát để ngắm phong cảnh.", "eng": "They stopped for a while to admire the scenery."}, {"viet": "Họ họp một cuộc họp bí mật với các cộng sự.", "eng": "They went into a huddle with his colleagues."}, {"viet": "Họ đã bị phạt vì lối chơi quá thô bạo.", "eng": "They were penalized for too much rough play."}, {"viet": "Ban đầu sự việc không suôn sẻ đối với chúng tôi, nhưng bây giờ thì mọi thứ đều tốt đẹp.", "eng": "Things didn't go well for us at first, but everything is fine now."}, {"viet": "Xe ôtô này là kế tiếp chiếc xe kiểu phổ thông có thùng đựng đồ đằng sau.", "eng": "This car is the successor to our popular hatchback model."}, {"viet": "Phát hiện này mở ra những viễn cảnh mới trong nghiên cứu cho các nhà sinh vật học.", "eng": "This discovery opens up new vistas of research for biologists."}, {"viet": "Sự kiện này có thể làm bùng lên ngọn lửa phản loạn.", "eng": "This incident could fan the flame of rebellion."}, {"viet": "Đây là chiếc đồng hồ đắt tiền nhất mà tôi chưa từng có.", "eng": "This is the most expensive watch I've ever owned."}, {"viet": "Việc này thì có thể ảnh hưởng đến tất cả nhân viên của chúng tôi.", "eng": "This matter could affect all of our employees."}, {"viet": "Bức tranh này được cho là đáng giá hơn một triệu pao.", "eng": "This picture is supposedly worth more than a million pounds."}, {"viet": "Chiếc sơ mi này đã giảm giá mạnh ở quầy bán xôn.", "eng": "This shirt was drastically reduced in the sale."}, {"viet": "Chiếc bình này chưa được lau sạch bên trong thật kỹ trước khi đem cất đi.", "eng": "This vase wasn't wiped out properly before it was put away."}, {"viet": "Dù cho họ đã không được chính quyền ủng hộ, họ vẫn tiếp tục đấu tranh.", "eng": "Though they lack official support they continue their struggle."}, {"viet": "Tom nói rằng anh ấy tìm thấy món nữ trang này và biết tôi sẽ thích nó.", "eng": "Tom said he found this piece of jewelry and knew I would love it."}, {"viet": "Trong hoàn cảnh này, anh không được bồi thường gì đâu.", "eng": "Under the circumstances, you have no redress."}, {"viet": "Đó là một người thật anh đã trông thấy hay là ma?", "eng": "Was it a real person you saw or a ghost?"}, {"viet": "Tính đến trước lễ Noel là chúng tôi lấy nhau đã được hai năm.", "eng": "We'll have been married for two years come Christmas."}, {"viet": "Chúng tôi sẽ chơi bóng đá, anh có tham gia không?", "eng": "We're going to play football, do you wanna to join in?"}, {"viet": "Chúng ta leo lên đã được 20 phút rồi.", "eng": "We've been climbing for the past twenty minutes."}, {"viet": "Chúng tôi hân hạnh chỉ định các ông làm đại lý độc quyền của chúng tôi trong thời hạn 2 năm.", "eng": "We're pleased to appoint you as our sole agent for a period of 2 years."}, {"viet": "Chúng ta sẽ giảm bớt số cây bị đốn.", "eng": "We are going to scale down the number of trees being fallen."}, {"viet": "Chúng tôi rất hoà hợp đến mức không cần thiết phải nói.", "eng": "We became so en rapport that speaking was unnecessary."}, {"viet": "Chúng tôi có thể phát hành một giấy chuyển khoản trực tiếp đến ngân hang của mẹ cô.", "eng": "We can issue a bank transfer direct to your mother's bank."}, {"viet": "Chúng tôi coi bà ấy là một trong những người bạn lâu năm nhất của chúng tôi.", "eng": "We count her as one of our oldest friends."}, {"viet": "Chúng tôi gặp phải nhiều vấn đề.", "eng": "We encountered a lot of problems."}, {"viet": "Chúng tôi ăn nhanh để chạy đi cho kịp tàu.", "eng": "We had a quick meal and then ran to catch the train."}, {"viet": "Chúng tôi có liên kết với mấy hội trong tỉnh.", "eng": "We have affiliations with several other societies in the town."}, {"viet": "Chúng tôi phải nuôi 120 vị khách sau lễ cưới.", "eng": "We have to feed 120 guests after the wedding."}, {"viet": "Chúng tôi để xe hơi lại và đi bộ một đoạn.", "eng": "We left the car and walked for a little."}, {"viet": "Chúng ta phải chuyên tâm vào việc tìm ra một giải pháp.", "eng": "We must apply our minds to finding a solution."}, {"viet": "Tất nhiên chúng ta gắn tên của Darwin với học thuyết tiến hoá.", "eng": "We naturally associate the name of Darwin with the doctrine of evolution."}, {"viet": "Chúng tôi đã đặt hệ thống sưởi mới khi dọn đến đây.", "eng": "We put new central heating in when we moved here."}, {"viet": "Từ 12 tháng Năm, chúng tôi sẽ có địa chỉ mới.", "eng": "We shall have a new address as of 12 May."}, {"viet": "Chúng tôi trò chuyện mãi đến nửa đêm mới chia tay.", "eng": "We talked until midnight and then separated."}, {"viet": "Chúng tôi vui mừng được có dịp bày tỏ lòng biết ơn của chúng tôi.", "eng": "We welcome the opportunity to express our gratitude."}, {"viet": "Chỉ có điều là chúng ta đã bị phe đối lập đánh bại dễ dàng.", "eng": "We were simply taken apart by the opposition."}, {"viet": "Chúng tôi thường xuyên viết thư cho nhau nhưng ít khi gặp nhau.", "eng": "We write regularly but seldom meet."}, {"viet": "À, bây giờ tôi phải đi gấp đây.", "eng": "Well, I've got to hurry off now."}, {"viet": "Đi học đại học ở Anh là một sự việc đột xuất đáng mừng.", "eng": "Went to college in England is an happy accident."}, {"viet": "Con gái bà mới dễ thương làm sao!", "eng": "What a sweet little thing your daughter is!"}, {"viet": "Điều trẻ con cần là một chút kỉ luật.", "eng": "What children need is a bit of discipline."}, {"viet": "Nước bạn xuất khẩu những gì sang Nhật Bản?", "eng": "What does your country export to Japan?"}, {"viet": "Sự khác biệt giữa recession và depression là gì?", "eng": "What is the difference between recession and depression?"}, {"viet": "Bạn muốn dùng loại ngũ cốc gì?", "eng": "What kind of cereal would you like to have?"}, {"viet": "Bạn ưa thích chương trình tivi gì?", "eng": "What's your favourite TV program?"}, {"viet": "Bây giờ anh muốn xem gì?", "eng": "What would you like to see now?"}, {"viet": "Khi anh ta không thể giành được cái mà anh ta muốn một cách công khai và đàng hoàng, anh ta dùng đến sự gian xảo hèn hạ.", "eng": "When he couldn't get what he wanted openly and honestly, he resorted to low cunning."}, {"viet": "Đến lúc dọn dẹp sau đó, các cậu con trai bị phát hiện là vắng mặt.", "eng": "When it came to cleaning up afterwards, the boys were conspicuous by their absence."}, {"viet": "Khi nước đạt đến độ cao tối đa, nó có thể giữ mức đó trong khoảng 4 phút, sau đó dần dần giảm xuống.", "eng": "When the water come to its maximum height, it may keep that level for about 4 minutes, then it gradually dies down."}, {"viet": "Hễ khi nào mình nhắc đến việc chơi bóng đá, thì cậu ta lại kêu là quá bận.", "eng": "Whenever I mention playing football, he says he's too busy."}, {"viet": "Chúng ta đi đâu để nghỉ hoàn toàn là vấn đề lý thuyết bởi vì chúng ta không có được một ngày nghỉ gì hết!", "eng": "Where we ought to go for our holiday is a purely academic question because we can't afford a holiday at all!"}, {"viet": "Chuyến tàu Brighton rời đi từ thềm ga nào?", "eng": "Which platform does the Brighton train leave from?"}, {"viet": "Anh chịu trách nhiệm trước ai trong tổ chức?", "eng": "Who are you accountable to in the organization?"}, {"viet": "Tại sao anh lại lục lọi giấy tờ của tôi?", "eng": "Why are you poking about among my paper?"}, {"viet": "Tại sao anh không cứ đợi để xem cái gì xảy ra?", "eng": "Why not just wait and see what happens?"}, {"viet": "Vui lòng đưa nó cho tôi?", "eng": "Will you hand it to me?"}, {"viet": "Với một tiếng thở dài khoan khoái, buồn bã, thích thú.", "eng": "With a sigh of relief, sadness, pleasure, etc."}, {"viet": "Lời nói không thể lúc nào cũng là thước đo cảm xúc của mình.", "eng": "Words cannot always give the measure of one's feelings."}, {"viet": "Ông muốn uống nó có đá hay không có đá ạ?", "eng": "Would you like it with or without ice?"}, {"viet": "Xin ông phân xử cho ai sẽ là người được giải?", "eng": "Would you please adjudicate on who should get the prize?"}, {"viet": "Phải, tối qua mấy người bạn của tôi và tôi đã uống 10 chai rượu.", "eng": "Yeah, my friends and I drank 10 bottles of wine last night."}, {"viet": "Phải, cô ấy lúc nào cũng giữ một vị trí đặc biệt trong lòng tôi.", "eng": "Yes, she's always held a special place in my heart."}, {"viet": "Cậu sẽ cảm thấy khoẻ hơn với một bữa ăn ngon vào người.", "eng": "You'll feel better with a good meal inside you."}, {"viet": "Anh giỏi nghề mộc, thế sao anh không đóng một cái?", "eng": "You're good at carpentry, so why don't you make one?"}, {"viet": "Anh đã hành động khôn ngoan khi anh không chịu nghe theo một lời khuyên sai trái như vậy.", "eng": "You acted wisely in ignoring such bad advice."}, {"viet": "Anh không thể sai lầm với các máy chùi thảm mới của chúng tôi.", "eng": "You can't go wrong with our new carpet cleaner."}, {"viet": "Ông có thể mua cái pianô này với giá 60 pao và tôi sẽ thêm cho ông cả cái ghế đẩu nữa.", "eng": "You can have the piano for 60 pounds, and I'll throw in the stool as well."}, {"viet": "Tốt hơn ông nên đổi nó lấy nhân dân tệ.", "eng": "You'd better exchange it for RMB."}, {"viet": "Tôi hứa với ông rằng hàng hoá sẽ đến đúng hẹn.", "eng": "You have my word for it that the goods will arrive on time."}, {"viet": "Ông sẽ phải đem theo người.", "eng": "You'll have to carry it with you."}, {"viet": "Bạn phải tìm ra trung độ giữa tính thẳng thắn và sự khiếm nhã.", "eng": "You must find a mean between frankness and rudeness."}, {"viet": "Bạn cần tập đánh gôn vào lỗ.", "eng": "You need to practise putting the ball."}, {"viet": "Anh nên đến buồng bệnh nghỉ nếu cảm thấy không khoẻ.", "eng": "You should go to the sick-room if you're not feeling well."}, {"viet": "Anh quẹo phải và cứ tiếp tục đi thẳng.", "eng": "You turn to the right and then carry straight on."}, {"viet": "Anh nên nhớ kỹ lại ai sẽ thanh toán hoá đơn.", "eng": "You would do well to remember who is paying the bill."}, {"viet": "Tất cả hành lý của các vị sẽ được mang xuống lúc 7 giờ.", "eng": "Your luggage will be collected at 7: 00."}]