[{"viet": "200 bảng bỏ ra để mua cái ghế đó thì nhiều đấy.", "eng": "200 pounds is a lot of money to part with for that chair."}, {"viet": "Chiếc ôtô rẽ gắt quanh góc phố.", "eng": "A car swung sharply round the corner."}, {"viet": "Một nhân viên khách sạn dẫn khách đến phòng của họ, họ muốn biết số điện thoại của phòng trọ.", "eng": "A clerk shows the guests to their room and they want to know their room's telephone number."}, {"viet": "Một cặp vợ chồng bị tay trưởng bồi bàn khinh thường.", "eng": "A couple who were snooted by the head waiter."}, {"viet": "Một sơ đồ trình bày có kế hoạch việc tạo ra và tiêu thụ của cải.", "eng": "A diagram that schematizes the creation and consumption of wealth."}, {"viet": "Một gia đình buồn phiền vì mất một đứa con.", "eng": "A family desolated by the loss of a child."}, {"viet": "Một lá cờ phấp phới trên đỉnh cột.", "eng": "A flag fluttering from the mast-head."}, {"viet": "Một diễn viên giỏi phải biết nghệ thuật nói lời thoại cho đúng lúc.", "eng": "A good actor must learn the art of timing."}, {"viet": "Một vị khách muốn uống một chút cà phê.", "eng": "A guest would like some coffee."}, {"viet": "Một căn nhà được định giá thuế mỗi năm là 500 bảng Anh.", "eng": "A house rated at £ 500 per annum."}, {"viet": "Một đám rất đông tụ họp để nghe ông ta giảng đạo.", "eng": "A large multitude had assembled to hear him preach."}, {"viet": "Một cuộc ghi băng trực tiếp tại Covent Garden năm 1962.", "eng": "A live recording made at Covent Garden in 1962."}, {"viet": "Một người có cơ thể cường tráng.", "eng": "A man with a powerful frame."}, {"viet": "Một đài tưởng niệm những người lính những người mà đã hy sinh trong chiến tranh.", "eng": "A monument to the memory of the soldiers who died in the war."}, {"viet": "Hàng tít của tờ báo đã thu hút sự chú ý của anh ta.", "eng": "A newspaper headline caught his attention."}, {"viet": "Một mẫu hình với những vòng tròn và hình vuông xen kẽ lẫn nhau.", "eng": "A pattern of alternate circles and squares."}, {"viet": "Một kế hoạch làm đường vòng qua trung tâm thành phố.", "eng": "A plan to bypass the town centre."}, {"viet": "Một thầy tu đọc thần chú đuổi hồn ma ra khỏi nhà.", "eng": "A priest exorcised the ghost from the house."}, {"viet": "Một niềm an ủi trong thời kỳ khó khăn này.", "eng": "A ray of comfort in these troubled times."}, {"viet": "Một lối nói quanh co về một điều gì.", "eng": "A roundabout way of saying something."}, {"viet": "Một loạt biện pháp nhằm chỉnh đốn lại hệ thống tiền tệ.", "eng": "A series of measures to rejig the monetary system."}, {"viet": "Bộ râu gọn nhỏ cân xứng với mái tóc của anh ta.", "eng": "A small, ruly beard balances his hair."}, {"viet": "Một sự đẩy mạnh nhịp độ sản xuất.", "eng": "A speed-up in the rate of production."}, {"viet": "Một con thú đau đớn là một cảnh tượng làm mủi lòng.", "eng": "A suffering animal is a distressing sight."}, {"viet": "Một ý nghĩ chợt thoáng qua trong đầu của tôi.", "eng": "A thought flitted through my mind."}, {"viet": "Một cách bơi rất lạ lùng.", "eng": "A very unusual style of swimming."}, {"viet": "Một phụ nữ bảo vệ danh tiếng của cô ta một cách đố kỵ.", "eng": "A woman who jealously guarded her reputation."}, {"viet": "Buộc ai tội cờ gian bạc lận.", "eng": "Accuse somebody of cheating at cards."}, {"viet": "Thêm chữ ký của ai vào bản hợp đồng.", "eng": "Affix one's signature to a contract."}, {"viet": "Sau khi ôm con Mani, quần áo của con đã bị dính lông của nó.", "eng": "After I held Mani, I got her hair on my clothes."}, {"viet": "Sau trận đấu võ sĩ quyền Anh bại trận thề sẽ phục thù với đối thủ của mình.", "eng": "After the fight the defeated boxer swore he'd get his own back on his rival."}, {"viet": "Báo động cho các nhân viên biết công ty đang gặp khủng hoảng.", "eng": "Alert staff to the crisis facing the company."}, {"viet": "Được rồi anh đã giải thích xong quan điểm của anh, bây giờ xin im lặng để người khác phát biểu.", "eng": "All right, you've made your point, now keep quiet and let the others say what they think."}, {"viet": "Cô ta đã đợi chờ nhầm chỗ nhiều tiếng đồng hồ mà không biết tí gì.", "eng": "All unknowingly, she had been waiting for hours in the wrong place."}, {"viet": "Dung dịch amoniac, hắc ín và than cốc tất cả đều là những sản phẩm phụ thu được trong quá trình sản xuất khí than đá.", "eng": "Ammonia, coal tar and coke are all by-products obtained in the manufacture of coal gas."}, {"viet": "Một cuộc tranh luận dựa vào logic chặt chẽ.", "eng": "An argument built on sound logic."}, {"viet": "Một kẻ bị lưu đày luyến tiếc quê nhà.", "eng": "An exile who sighs for home."}, {"viet": "Một vấn đề gây chia rẽ trong đảng đó từ trên xuống dưới.", "eng": "An issue which has split the party from top to bottom."}, {"viet": "Một bữa ăn không ngon với cá và khoai rán nguội ngắt.", "eng": "An uninviting meal of cold fish and chips."}, {"viet": "Các thiên thần vẽ trong tranh thường mặc đồ trắng và có cánh.", "eng": "Angels are usually shown in pictures dressed in white, with wings."}, {"viet": "Trừ cái mũi ra thì anh ấy rất đẹp trai.", "eng": "Apart from his nose he's quite good-looking."}, {"viet": "Ở nước bạn có nhiều người ăn chay không?", "eng": "Are there many vegetarians in your country?"}, {"viet": "Bạn có quan tâm đến vật lí hay vật lí ứng dụng không?", "eng": "Are you interested in Physics or Applied Physics?"}, {"viet": "Nhận bừa toàn bộ công lao là của mình.", "eng": "Arrogating all the credit to himself."}, {"viet": "Ở trong nhóm đó anh ta là kẻ vô danh tiểu tốt.", "eng": "As part of the crowd he was anonymous, undistinguished."}, {"viet": "Những nhạc công có tham vọng phải luyện tập nhiều giờ một ngày.", "eng": "Aspiring musicians must practice many hours a day."}, {"viet": "Anh ấy từ chối bỏ phiếu trong kì bầu cử vừa qua.", "eng": "At the last election he abstained from voting."}, {"viet": "Hành lý chất lên máy bay phải được trải đều ra.", "eng": "Baggage loaded onto an aircraft must be evenly distributed."}, {"viet": "Hiến mình cho những mục tiêu xứng đáng.", "eng": "Be engaged in worth-while pursuits."}, {"viet": "Do tình tiết giảm nhẹ tội, tòa án đã tha bổng anh ta.", "eng": "Because of extenuating circumstances, the court acquitted him of the crime."}, {"viet": "Ngoài ra, họ không có xe điện ngầm, vì vậy đi lại không được thuận tiện lắm.", "eng": "Besides, they don't have a subway, so it's not so convenient to get around."}, {"viet": "Sách trước đây được in bằng tay nhưng hầu hết công việc đó bây giờ được làm bằng máy vi tính.", "eng": "Books were previously set by hand but much of the work is now done by computer."}, {"viet": "Các giới chức phát thanh truyền hình thường là các tổ chức nhà nước.", "eng": "Broadcasting authorities are often public corporations."}, {"viet": "Nhưng tớ ghét đánh máy và không chịu nổi việc lưu hồ sơ.", "eng": "But I hate typing and I can't stand filing."}, {"viet": "Nhưng chúng tôi không thích tỏi.", "eng": "But we don't like garlic."}, {"viet": "Khi chúng tôi đến, buổi họp đã kết thúc.", "eng": "By the time we arrived the meeting was over."}, {"viet": "Mình pha nước cho cậu uống nhé?", "eng": "Can I fix you a drink?"}, {"viet": "Chúng ta có thể gộp tất cả những khoản này với nhau thành loại chi tiêu bất thường không?", "eng": "Can we lump all these items together as incidental expenses?"}, {"viet": "Bạn có thể kể tên tất cả các cây trong vườn này không?", "eng": "Can you name all the plants in this garden?"}, {"viet": "Bệnh ung thư giết hàng nghìn người mỗi năm.", "eng": "Cancer kills thousands of people every year."}, {"viet": "Thách thức ai một ván quần vợt.", "eng": "Challenge somebody to a game of tennis."}, {"viet": "Thức ăn Trung Quốc thường được nấu với gạo hoặc mì.", "eng": "Chinese food is often served with rice or noodle."}, {"viet": "Tiền kim loại được gọi là \"tiền lẻ\" hay \"đồng bạc\", mặc dù chúng không được làm bằng bạc nữa.", "eng": "Coins are called \"change\" or \"silver\", though they are not made of silver any more."}, {"viet": "Thu thập các số liệu thống kê cho một bản báo cáo về tai nạn giao thông.", "eng": "Compiling statistics for a report on traffic accidents."}, {"viet": "Sự liên tục trong phim ảnh được bảo đảm bằng cách dùng những khung cảnh giống nhau trong những màn kế tiếp.", "eng": "Continuity is ensured by using the same props in successive scene."}, {"viet": "Bạn có thể cùng với tôi xem nó không?", "eng": "Could you go over it with me?"}, {"viet": "Tín dụng là huyết mạch của một xã hội tiêu thụ.", "eng": "Credit is the life-blood of the consumer society."}, {"viet": "Em yêu, em mặc chiếc áo đầm đó trông thật là mê hồn!", "eng": "Darling, you look simply ravishing in that dress!"}, {"viet": "Tiền gửi với kỳ hạn lâu hơn sẽ có lãi suất cao hơn.", "eng": "Deposit with the longer maturities bears a higher rate."}, {"viet": "Thuốc có hiệu nghiệm gì không?", "eng": "Did the medicine have any effect?"}, {"viet": "Những người khác nhau thích những loại nghỉ mát khác nhau, nhưng hãy dành cho tôi bờ biển khi có dịp.", "eng": "Different people like different sorts of holiday, but give me the seaside every time."}, {"viet": "Tôi có cần ký tên chỗ này không?", "eng": "Do I have to sign here?"}, {"viet": "Anh có tin là có sự hiện hữu của ma hay không?", "eng": "Do you believe in the existence of ghosts?"}, {"viet": "Cô có cái áo vét hợp với cái váy này không?", "eng": "Do you have a vest to match this skirt?"}, {"viet": "Bạn có biết nhà hàng nào ngon gần đây không?", "eng": "Do you know of any good restaurants nearby?"}, {"viet": "Anh thích rađiô hay vô tuyến truyền hình hơn?", "eng": "Do you prefer radio or television?"}, {"viet": "Anh nghĩ anh có thể đưa tôi đến sân bay Kenedy trước 10 giờ 20 được không?", "eng": "Do you think you can get me to Kennedy Airport by 10: 20?"}, {"viet": "Hóa đơn này tính luôn cả phí phục vụ phải không?", "eng": "Does the bill include the service charge?"}, {"viet": "Đừng áy náy vì cá nhân tôi.", "eng": "Don't be uneasy on my behalf."}, {"viet": "Đừng có chõ mũi vào việc của người khác!", "eng": "Don't go poking your nose into other people's business!"}, {"viet": "Đừng có nhấp chân côn hoặc phanh.", "eng": "Don't ride the clutch or the brakes."}, {"viet": "Đừng bắt các nhân viên của anh làm việc cho tới chết.", "eng": "Don't work your employees to death."}, {"viet": "Lái xe sau khi uống rượu là chuốc lấy sự phiền phức.", "eng": "Driving after drinking alcohol is asking for trouble."}, {"viet": "Bạn ăn nổi bao nhiêu thì cứ ăn.", "eng": "Eat as much as you can."}, {"viet": "Gia nhập vào trung đoàn bộ binh tinh nhuệ.", "eng": "Enlist in a crack infantry regiment."}, {"viet": "Mỗi lần tôi đi qua hồ, tôi thấy nhiều người ngồi đó với cần câu trong tay, nhưng tôi chưa bao giờ thấy ai câu được gì cả.", "eng": "Every time I pass the lake, I see many people sitting there with a rod in hand, but I've never seen anyone catch anything."}, {"viet": "Xin lỗi, tôi gặp chuyện rắc rối.", "eng": "Excuse me, I've got a problem."}, {"viet": "Quần Jeans bạc màu cũng vẫn còn thịnh nữa.", "eng": "Faded jeans are still in fashion, too."}, {"viet": "Không biết đích xác phải làm gì.", "eng": "Feel uncertain about what to do."}, {"viet": "Đệ nhất khách sạn là sự dùng từ hoàn toàn sai đối với căn nhà ọp ẹp của nông trại mà chúng tôi đã ở.", "eng": "First-class hotel was a complete misnomer for the tumbledown farmhouse we stayed in."}, {"viet": "Trộn với hai cái lòng trắng trứng đã đánh.", "eng": "Fold in the beaten whites of two eggs."}, {"viet": "Những đề tài bị cấm như tình dục và chính trị.", "eng": "Forbidden subjects such as sex and politics."}, {"viet": "Theo quan điểm của khách hàng.", "eng": "From the standpoint of the customer."}, {"viet": "Lãnh một cú nện ngang gáy.", "eng": "Get a clout across the back of the head."}, {"viet": "Hãy nói cho tôi biết sự thật về việc ly dị của cô ta.", "eng": "Give me the low-down on her divorce."}, {"viet": "Đi ra ngoài và trở về sau khoảng nửa giờ.", "eng": "Go out and return after an interval of half an hour."}, {"viet": "Người ta mong rằng kinh phí cho giáo dục nhiều hơn thì số lượng học sinh sẽ tăng lên.", "eng": "Greater spending on education is expected to lead to a large increase in the number of students."}, {"viet": "Bị quấy nhiễu bởi các phóng viên báo chí muốn có một câu chuyện.", "eng": "Harried by press reporters wanting a story."}, {"viet": "Ông bà đã chụp rất nhiều ảnh phải không?", "eng": "Have you been taking a lot of photos?"}, {"viet": "Anh có tiền đúng để đi xe buýt không?", "eng": "Have you got the right money for the bus?"}, {"viet": "Có những người hàng xóm khó chịu có thể làm cuộc sống của mình hoàn toàn khốn khổ.", "eng": "Having unpleasant neighbours can make one's life an absolute misery."}, {"viet": "Hắn luôn chỉ trích kịch liệt cách tôi làm việc.", "eng": "He's always knocking the way I do things."}, {"viet": "Ông ta lại say rồi, chúng ta nên gọi tắc-xi đưa ông ta về nhà.", "eng": "He's drunk again, we'd better call a taxi and get him home."}, {"viet": "Anh ta không kém cỏi gì mà để rớt xuống sông.", "eng": "He's none the worse for falling into the river."}, {"viet": "Ông ta là hạng người thích được nổi bật trong các cuộc họp quan trọng.", "eng": "He's the sort of man who likes to be very much in evidence at important meetings."}, {"viet": "Hắn cứ bám theo tôi khi gặp tôi ở một buổi liên hoan.", "eng": "He always latches on to me when he sees me at a party."}, {"viet": "Anh ấy xử sự với một sự khiêm tốn thích hợp.", "eng": "He behaved with a becoming modesty."}, {"viet": "Đôi lúc hắn có thể rất thô lỗ.", "eng": "He can be very tactless sometimes."}, {"viet": "Ông ấy điều khiển Dàn Nhạc Giao Hưởng Luân Đôn.", "eng": "He conducts the London Symphony Orchestra."}, {"viet": "Anh ta không nhận là đã biết về những kế hoạch của họ.", "eng": "He denied any knowledge of their plans."}, {"viet": "Anh ta không có khả năng chịu đựng bền bỉ để làm thầy giáo.", "eng": "He doesn't have the stamina to be a teacher."}, {"viet": "Anh ta diễn đạt ý của mình rất hay.", "eng": "He expressed himself with a great felicity."}, {"viet": "Anh ta lao ra khỏi phòng.", "eng": "He flung out of the room."}, {"viet": "Anh ta viết thuê cho một số nhân vật thể thao, những người mang danh nghĩa viết các mục này.", "eng": "He ghosts for a number of sports personalities who write newspaper columns."}, {"viet": "Anh ta đã bị đâm tới chết bằng giáo.", "eng": "He had been speared to death."}, {"viet": "Anh ấy có một trí nhớ chứa đầy những sự kiện.", "eng": "He has a memory well stocked with facts."}, {"viet": "Ông ta mất khả năng nói.", "eng": "He has lost the power of speech."}, {"viet": "Chàng thắm thiết ôm nàng trong vòng tay.", "eng": "He held her in a warm embrace."}, {"viet": "Ông ta rõ ràng là thiên vị thiện ý của chính phủ.", "eng": "He is clearly biased in the government's favour."}, {"viet": "Ông ta làm chủ được tình hình.", "eng": "He is the master of the situation."}, {"viet": "Anh ấy hạ đo ván đối thủ bằng một cú đấm tay trái vũ bão.", "eng": "He knocked down his opponent with a powerful left."}, {"viet": "Anh ấy sẽ nhớ kinh nghiệm đó theo mình trong suốt quãng đời còn lại của anh ấy.", "eng": "He'll carry the memory of the experience with him for the rest of his life."}, {"viet": "Hắn đã phạm sai lầm là đánh giá thấp quyền lực của báo chí.", "eng": "He made the mistake of underestimating the power of the press."}, {"viet": "Ông ấy không bao giờ khắc phục được cú sốc mất vợ.", "eng": "He never got over the shock of losing his wife."}, {"viet": "Hắn đã nghe được một mẩu tin thú vị.", "eng": "He picked up an interesting piece of news."}, {"viet": "Nó hãnh diện đi tản bộ với cô bạn lịch sự trong công viên.", "eng": "He proudly promenaded his elegant companion in the park."}, {"viet": "Anh ta trông thật sự ra dáng trong bộ quân phục mới, lịch sự của mình.", "eng": "He really cuts a dash in his smart new uniform."}, {"viet": "Ông ấy về hưu tháng trước vì ốm.", "eng": "He retired last month because of illness."}, {"viet": "Ông ta già đi nhiều gần đây.", "eng": "He's aged a lot recently."}, {"viet": "Anh ta thật là can đảm!", "eng": "He's got a lot of bottle!"}, {"viet": "Hiện giờ anh ấy đã đi ra ngoài ăn trưa rồi.", "eng": "He's out for lunch right now."}, {"viet": "Anh ta nói rằng tình cảm của anh dành cho cô ta hoàn toàn là tinh thần.", "eng": "He said that his feelings for her were entirely platonic."}, {"viet": "Dường như anh ta cứ liều uống rượu đến chết.", "eng": "He seems hell-bent on drinking himself to death."}, {"viet": "Ông ta chỉ cho chúng tôi con đường chạy trốn trên bản đồ.", "eng": "He showed us our escape route on the map."}, {"viet": "Hắn nói một thôi một hồi nhưng thực sự không hiểu được ý nghĩa lời hắn.", "eng": "He spoke for a long time but his meaning did not really come across."}, {"viet": "Nó vươn cánh tay cầm lấy cuốn sách.", "eng": "He stretched out his arm to take the book."}, {"viet": "Ông ta lấy gậy gõ nhẹ vào cái hộp.", "eng": "He tapped the box with a stick."}, {"viet": "Ông ta làm tình với cô ta trên tràng kỷ.", "eng": "He took her on the sofa."}, {"viet": "Anh ta cố gắng mở khoá nhưng lần nào cũng thất bại.", "eng": "He tried upon the lock but each attempt proved abortive."}, {"viet": "Anh ta bước đi làu bàu giận dữ.", "eng": "He walked off spitting with fury."}, {"viet": "Hắn ta luôn luôn bị bạn bè bóc lột sức lao động.", "eng": "He was always being put upon by his friends."}, {"viet": "Hắn ta bị kết tội sát nhân mức độ nhẹ nhất.", "eng": "He was charged with murder of the first degree."}, {"viet": "Cuối cùng anh ta cũng đã trút được những nỗi lo âu về tài chính.", "eng": "He was finally able to rid himself of all financial worries."}, {"viet": "Sau này người ta phát hiện anh ta là một điệp viên.", "eng": "He was later discovered to have been a spy."}, {"viet": "Ông ấy bị chạm tự ái khi phát hiện là mình không được mời.", "eng": "He was piqued to discover that he hadn't been invited."}, {"viet": "Người ta cử anh ấy đứng ở cửa để lấy vé.", "eng": "He was stationed at the door to take the tickets."}, {"viet": "Anh ta rất hãnh diện về tác phẩm của mình.", "eng": "He was very proud of his work."}, {"viet": "Anh ta sẽ là người thêm vào có giá trị nhất cho ban của chúng tôi.", "eng": "He will be a most valuable addition to our board."}, {"viet": "Nó vẫn cứ tiếp tục kể các câu chuyện kinh khủng đó.", "eng": "He would keep telling those dreadful stories."}, {"viet": "Xin chào, tôi có thể đổi một ít tiền vàng bằng thẻ American Express của tôi được không?", "eng": "Hello, may I change some money with my American Express card?"}, {"viet": "Món quá sinh nhật của cô ấy là một chuyến đi thăm nhà hát.", "eng": "Her birthday treat was a visit to the theatre."}, {"viet": "Quyết định lấy anh ta gây cho cô ấy nhiều rắc rối.", "eng": "Her decision to mary him cost her dear."}, {"viet": "Tình cảm của cô ấy là vừa giận vừa khuây.", "eng": "Her feeling were part anger, part relief."}, {"viet": "Chồng cô ta đã áp dụng rất nhiều sức ép đối với cô ta để cô ấy thành công.", "eng": "Her husband exerted a lot of pressure on her to succeed."}, {"viet": "Tình yêu đã làm nàng mù quáng trước những sai sót của chàng.", "eng": "Her love for him blinded her to his faults."}, {"viet": "Những bức vẽ của cô ấy được đánh giá cao ở nước ngoài.", "eng": "Her paintings me well considered abroad."}, {"viet": "Sự chống lại của bà ta đối với lời đề nghị đã thất bại đột ngột.", "eng": "Her resistance to the proposal has crumpled."}, {"viet": "Đội của cô ấy sẽ lên tiếng ủng hộ.", "eng": "Her team will speak for the affirmative."}, {"viet": "Tiền, sổ tiết kiệm ngân hàng và hộ chiếu của ông đây.", "eng": "Here are the money, your passbook and your passport."}, {"viet": "Hành động của hắn đã phỉ báng danh dự tổ quốc.", "eng": "His action profaned the honour of his country."}, {"viet": "Cuốn phim hay nhất của ông ấy, phim đã chiếm được nhiều giải thưởng, nói về cuộc đời của Gandhi.", "eng": "His best film, which won several awards, was about the life of Gandhi."}, {"viet": "Hành vi của nó tệ hại không sao tả xiết.", "eng": "His conduct is so bad it beggars description."}, {"viet": "Những hành vi quá trớn của anh ta ở các buổi liên hoan thì ai cũng biết.", "eng": "His excesses at parties are well known."}, {"viet": "Tiếng bước chân của anh ta vang lên ( trong hội trường vắng vẻ ).", "eng": "His footsteps echoed ( in the empty hall )."}, {"viet": "Sự đau ốm của anh ta tai hại cho các kế hoạch của chúng tôi.", "eng": "His illness was fatal to our plans."}, {"viet": "Vai chính của anh ta là vai hồn ma, nhưng anh ta còn đóng thêm cả vai Fortinbras nữa.", "eng": "His main part is the ghost, but he doubles as Fortinbras."}, {"viet": "Nước cờ mở đầu của ông ta tại cuộc thảo luận là một đòn trực tiếp giáng vào chính sách của chính phủ.", "eng": "His opening gambit at the debate was a direct attack on Government policy."}, {"viet": "Những biểu lộ đau khổ công khai của ông chẳng qua chỉ là vẻ bề ngoài.", "eng": "His public expressions of grief are nothing but show."}, {"viet": "Con trai ông ta được ký giao kèo học nghề với ông thợ rèn ở địa phương.", "eng": "His son was indentured to the local blacksmith."}, {"viet": "Cách đối xử của ông ấy với vợ là trái đạo đức.", "eng": "His treatment of his wife is outrageous."}, {"viet": "Những nhận xét xúc phạm của nó rõ ràng là đã làm tổn thương tình cảm.", "eng": "His wounding remarks clearly drew blood."}, {"viet": "Sự hy vọng vẫn còn thoáng hiện ra trong trí óc chúng tôi.", "eng": "Hope still glimmered in our minds."}, {"viet": "Tôi có thể làm thế nào thuyết phục anh về lòng trung thực của cô ta?", "eng": "How can I convince you of her honesty?"}, {"viet": "Bạn đã làm bài thi ra sao?", "eng": "How did you do on the exams?"}, {"viet": "Nhạc này hấp dẫn bạn như thế nào?", "eng": "How does this music grab you?"}, {"viet": "Chuyến đi mất bao lâu?, Tôi không biết, còn tuỳ.", "eng": "How long will the journey take?, I don't know, it depends."}, {"viet": "Anh ta đã góp bao nhiêu cổ phần vào cái công ti mới?", "eng": "How many shares did you subscribe for in the new company?"}, {"viet": "Tháng này anh để dành được bao nhiêu tiền?", "eng": "How much money have you saved this month?"}, {"viet": "Không có ôtô anh đến đây bằng cách nào?", "eng": "However did you get here without a car?"}, {"viet": "Tôi muốn được giới thiệu với cô gái mà hôm trước anh nói chuyện với cô ta!", "eng": "I'd like an intro to that girl you were talking to!"}, {"viet": "Tôi thà tiêu tiền của mình còn hơn để nó nằm trong ngân hàng.", "eng": "I'd rather use my money than leave it lying in the bank."}, {"viet": "Tôi chỉ còn lại đúng 10 bảng Anh sau khi trả hết các món nợ.", "eng": "I'll have just £ 10 over when I've paid all my debts."}, {"viet": "Tôi sẽ tham gia, nhưng tôi không muốn chỉ huy.", "eng": "I'll take part, but I won't want to lead."}, {"viet": "Tôi e rằng anh không thể ngồi đó được-các ghế ấy đã được giữ trước rồi.", "eng": "I'm afraid you can't sit there-those seats are spoken for."}, {"viet": "Thật ra là ngày mai tôi mới đi đến đó.", "eng": "I'm going there tomorrow, as a matter of fact."}, {"viet": "Tôi ngỡ ngàng, tôi không thể hiểu nổi sao ông ta làm được điều đó.", "eng": "I'm mystified, I just can't see how he did it."}, {"viet": "Tôi hơi do dự khi phải ký vào cái này.", "eng": "I'm rather hesitant about signing this."}, {"viet": "Tôi đang nghiên cứu cách trẻ con học nói.", "eng": "I'm studying how children learn to speak."}, {"viet": "Tôi rất biết ơn ông vì lòng hiếu khách nồng nhiệt của ông.", "eng": "I'm very grateful to you for your warm hospitality."}, {"viet": "Tôi đang học tiếng Anh thôi, tôi e là khả năng nói của tôi vẫn còn rất tệ.", "eng": "I've been taking lessons, but I'm afraid my speaking ability is still very poor."}, {"viet": "Tôi đã trả 1200 pao về chiếc xe ô tô đó.", "eng": "I've had an offer of 1200 pounds for the car."}, {"viet": "Tôi đã đặt một cái bàn mới nhưng phải tuần tới nó mới đến.", "eng": "I've ordered a new table but it won't arrive until next week."}, {"viet": "Tôi đồng ý việc đó cần phải được làm nhưng không phải một cách gớm ghiếc như vậy.", "eng": "I agree it had to be done, but not in such an offensive manner."}, {"viet": "Tôi rất biết ơn sự giúp đỡ của anh.", "eng": "I am grateful to you for your help."}, {"viet": "Tôi đến lúc chín giờ, dạy cho đến mười hai giờ ba mươi rồi ăn, đó là công việc thường làm buổi sáng của tôi.", "eng": "I arrive at nine o'clock, teach until twelve thirty and then eat a meal, that's my morning routine."}, {"viet": "Tôi hết sức phẫn nộ vì những toan tính can thiệp của bà ta vào công việc của tôi.", "eng": "I bitterly resent her attempts to interfere in my work."}, {"viet": "Tôi không thể lái xe qua đó được-Có một chiếc xe buýt đang cản đường.", "eng": "I can't drive through there-the bus is in the way."}, {"viet": "Tôi không chịu nổi nó hoặc bất cứ kẻ khác nào cùng một loại như nó.", "eng": "I can't stand him, or any others of his ilk."}, {"viet": "Tôi có thể dẫn chứng cho anh vài trường hợp thô lỗ cố ý của bà ta.", "eng": "I can quote you several instances of her being deliberately rude."}, {"viet": "Hình như tôi không thể tìm thấy bột giặt ABC.", "eng": "I can't seem to find ABC detergent."}, {"viet": "Tôi có thể thấy qua vẻ mặt cô ta rằng những lời bình phẩm mỉa mai của anh ta đã đánh trúng đích.", "eng": "I could see from her expression that his sarcastic comments had hit home."}, {"viet": "Tôi muốn uống thêm một chai bia nữa.", "eng": "I'd like to have another beer."}, {"viet": "Hóa ra là tôi không cần đến cái ô.", "eng": "I didn't need my umbrella, as it turned out."}, {"viet": "Tôi không thấy những bé trai có gì hấp dẫn.", "eng": "I don't find small boys very appealing."}, {"viet": "Con không thích tiếng khoan ở phòng nha khoa.", "eng": "I don't like the drilling sound at the dentist office."}, {"viet": "Tôi không muốn tất cả bọn họ giẫm nát các luống hoa của tôi.", "eng": "I don't want all those people trampling about all over my flower beds."}, {"viet": "Tôi cũng không biết mã số vùng.", "eng": "I don't know the area code."}, {"viet": "Tôi van ngài rủ lòng thương.", "eng": "I entreat you to show mercy."}, {"viet": "Tôi cảm thấy tức giận, nhưng nụ cười của cô đã làm tôi hết giận.", "eng": "I felt angry, but her smile disarmed me."}, {"viet": "Tôi thấy khó có thể giữ được tập trung với một sự ồn ào thế này cứ kéo dài mãi.", "eng": "I found it hard to keep my concentration with such a noise going on."}, {"viet": "Tôi kinh hoàng khi nhận thấy cửa đã bị khóa.", "eng": "I got into a panic when I found the door was locked."}, {"viet": "Tôi đã được báo cho biết trước rằng anh ta là một người được phỏng vấn hay gây gổ rằng anh ta cứ tuôn dần ra những câu trả lời thiếu lịch sự về các câu hỏi mà anh ta chán phè.", "eng": "I had been warned that he was a tough interview-that he doled out flip answers to questions he was tired of being asked."}, {"viet": "Tôi ghét bị đèn chiếu vào mặt.", "eng": "I hate lights being shone in my face."}, {"viet": "Tôi phải làm việc để kiếm từng đồng xu một.", "eng": "I have had to work for every single penny I earned."}, {"viet": "Tôi đồng tình phần nào về quan điểm đó.", "eng": "I have some sympathy with that point of view."}, {"viet": "Tôi thật sự không hiểu ý anh muốn nói gì-anh có thể giải thích lại được không?", "eng": "I haven't really latched on to what you mean-could you explain it again?"}, {"viet": "Tôi nghe nói ngày mai rất có khả năng tuyết sẽ rơi đấy.", "eng": "I heard that there is a high chance for snow tomorrow."}, {"viet": "Tôi mong bạn không phiền khi tôi hỏi quá nhiều.", "eng": "I hope you didn't mind me asking so many questions."}, {"viet": "Đến Hồng Kong vào cuối tuần để xem triển lãm công nghệ Paul – Tôi đã biết rằng anh ấy đang dự định sẽ đến đây lúc nào đó trong năm nay, nhưng không nghĩ chuyện này đến sớm như vậy.", "eng": "I knew he was planning to come sometime this year, but didn't expect it so soon,."}, {"viet": "Mình đã cho cậu ta mượn 5 pao trong một lúc thiếu suy nghĩ.", "eng": "I lent him 5 pound in a moment of rashness."}, {"viet": "Tôi sẽ dự bữa tiệc đó.", "eng": "I'll be at the party."}, {"viet": "Tôi sẽ phải tập thể dục để làm tan mỡ bụng.", "eng": "I'll have to exercise to get rid of my spare tire."}, {"viet": "Tôi mất tập trung và suýt nữa thì lái xe đâm vào cầu.", "eng": "I lost my concentration and nearly drove into a bridge."}, {"viet": "Tôi rất mừng là đã tống khứ được anh ta.", "eng": "I'm glad to be rid of him."}, {"viet": "Tôi không nhớ chắc tôi đã gặp cô ta lần cuối lúc nào.", "eng": "I'm not sure when I saw her last."}, {"viet": "Tôi rất lấy làm tiếc khi nghe điều đó.", "eng": "I'm very sorry to hear that."}, {"viet": "Em phải xin anh tha lỗi cho em.", "eng": "I must ask you to excuse me."}, {"viet": "Tôi cần thêm bia trong tủ rượu nhỏ.", "eng": "I need more beer in my mini-bar."}, {"viet": "Tôi thường đi dự các lớp học mùa hè nội trú điều kiện cư trú đối với cử tri.", "eng": "I often go on residential summer courses residential qualifications for voters."}, {"viet": "Tôi thích kế hoạch đầu tiên của anh hơn cái này.", "eng": "I prefer your original plan to this one."}, {"viet": "Tôi thật đã khéo chọn chiếc xe này, nó bị tan luôn.", "eng": "I really pick a winner with this car, it's always breaking down."}, {"viet": "Tôi quyết định học chăm cho tới kỳ thi.", "eng": "I resolved to work hard until the examination."}, {"viet": "Tôi thấy hai thuyết này có mối liên hệ nào đó với nhau.", "eng": "I see these two theories as somehow interconnected."}, {"viet": "Tôi cho là bà ta đã ngoài bốn mươi.", "eng": "I should say she's over forty."}, {"viet": "Tôi thừa nhận rằng lời tố cáo không có bằng chứng.", "eng": "I submit that the charge is not proved."}, {"viet": "Tôi nghĩ sự nói lắp của anh ta là điệu bộ màu mè.", "eng": "I think his stammer is just an affectation."}, {"viet": "Tôi nghĩ rằng những dịp lễ khác thì dành riêng cho các bộ lạc khác nhau tụ họp.", "eng": "I think that others are for different tribes to get together."}, {"viet": "Tôi cho rằng người kéo viôlông thứ ba là người chơi hay nhất-tuy rằng tôi chẳng phải là người sành sỏi gì.", "eng": "I thought that the third violinist was the best player-not that I'm any judge."}, {"viet": "Tôi cố nói với anh ta về điều đó, nhưng anh ta không thèm quan tâm.", "eng": "I tried to tell him about it, but he just wasn't interested."}, {"viet": "Anh chưa bao giờ thấy món tráng miệng nào giống món này.", "eng": "I've never seen anything like this."}, {"viet": "Tôi muốn nghe tất cả tin tức của bạn.", "eng": "I want to hear all your news."}, {"viet": "Tôi được báo tin về quyết định của uỷ ban.", "eng": "I was apprised of the committee's decision."}, {"viet": "Tôi đã đi Honolulu một đôi ngày và dành hết kỳ nghỉ cò lại ở Kauai.", "eng": "I was in Honolulu for a couple of days and spent the rest of my vacation on Kauai."}, {"viet": "Tôi hơi ngạc nhiên khi gặp ông ta.", "eng": "I was somewhat surprised to see him."}, {"viet": "Tôi đi phỏng vấn nhà doanh nghiệp thích làm ăn theo cách riêng của mình.", "eng": "I went along to interview his maverick businessman himself."}, {"viet": "Tôi ước ao có điều gì đó xảy ra để làm giảm đi cái thói tự đắc của bà ta.", "eng": "I wish something would happen to puncture her arrogance."}, {"viet": "Tôi lấy làm lạ là anh đã không bị giết.", "eng": "I wonder that you weren't killed."}, {"viet": "Tôi muốn đổi một số chi phiếu du lịch lấy tiền mặt.", "eng": "I would like to cash some traveler's checks, please."}, {"viet": "Tôi chẳng khi nào bỏ lỡ việc đó cả.", "eng": "I wouldn't have missed it for all the world."}, {"viet": "Nếu nó mới hai mươi lăm tuổi, tôi cứ bé bằng con kiến!", "eng": "If he's only twenty-five, I'm a Dutchman!"}, {"viet": "Nếu không có sự giúp đỡ của anh thì chúng tôi đã chẳng bao giờ hoàn thành được công việc đó.", "eng": "If it hadn't been for your help, we'd never have finished it."}, {"viet": "Nếu có điều gì tôi có thể làm được, hãy cho tôi biết.", "eng": "If there is anything I can do, please let me know."}, {"viet": "Nếu anh làm một lời khai không đúng sự thật với cảnh sát anh có thể bị lôi thôi.", "eng": "If you've made a false statement to the police you could be in trouble."}, {"viet": "Nếu con không mang rác ra trước 8 giờ thì con sẽ bị nhỡ xe chở rác đấy.", "eng": "If you don't take it out by eight, you will miss the garbage truck."}, {"viet": "Nếu bạn có khi nào đến Đài Bắc, hãy đến thăm tôi.", "eng": "If you're ever in Taipei, look me up."}, {"viet": "Nếu mẹ cậu phát hiện điều cậu đã làm thì cậu sẽ thực sự gặp rắc rối đấy!", "eng": "If your Mum finds out what you've done, you'll really be in the soup!"}, {"viet": "Với quả khí cầu, họ bay lên trên không, cao hơn bất kỳ người nào đã từng bay.", "eng": "In balloons they went higher in the air than anyone had ever gone before."}, {"viet": "Theo ý kiến ông ta, đi nghỉ là lãng phí thời gian và tiền của.", "eng": "In his opinion, holidays are a waste of time and money."}, {"viet": "Trong nhảy giao tiếp xã hội hai người nhảy với nhau.", "eng": "In social dancing two people dance together."}, {"viet": "Trong rừng rậm, họ đã buộc phải có những hành động cực đoan để sống được.", "eng": "In the jungle, they were driven to extremes in order to survive."}, {"viet": "Trong thời chiến tất cả các thanh niên đều phải tham gia lực lượng quân đội.", "eng": "In wartime most young men are expected to join the forces."}, {"viet": "Sắt và thép là lĩnh vực kinh doanh của tôi.", "eng": "Iron and steel is my field of business."}, {"viet": "Liệu cành cây có đủ chắc để đỡ anh được không?", "eng": "Is that branch strong enough to hold your weight?"}, {"viet": "Ở đây có cái gì ăn không?", "eng": "Is there something to eat here?"}, {"viet": "Thật may mà anh có đây để giúp đỡ chúng tôi-không có anh chúng tôi đã không thể xoay xở được.", "eng": "It's a good job you were there to help-we couldn't have managed without you."}, {"viet": "Đó là vì trong phòng tắm quá ẩm ướt.", "eng": "It's because it is too damp in the bathroom."}, {"viet": "Thật tốt khi biết anh có bạn để dựa vào.", "eng": "It's good to know you have got friends to lean on."}, {"viet": "Anh biết đấy, làm thầy giáo chẳng dễ dàng gì đâu.", "eng": "It's no doddle being a teacher, you know."}, {"viet": "Phải cố gắng mới nâng được cái hòm nặng này.", "eng": "It's quite an effort to lift this heavy box."}, {"viet": "Làm việc đó bây giờ là quá muộn, hãy để đến ngày mai.", "eng": "It's too late to do it now, let's do it tomorrow."}, {"viet": "Nó vẫn tiếp tục ấn hành, mặc dù không đều, hai tờ tạp chí.", "eng": "It continues to publish, albeit irregularly, two journals."}, {"viet": "Luật pháp từ chối không cho phụ nữ đặc quyền này quả thật là phi lí.", "eng": "It is absurd that the law should deny women this privilege."}, {"viet": "Tôi rất hân hạnh chào mừng ông David Hà đến thăm công ty của chúng tôi.", "eng": "It is my pleasure to welcome Mr. David Ho to our company."}, {"viet": "Nó rơi xuống đúng ngay vào giữa cái thảm.", "eng": "It landed smack in the middle of the carpet."}, {"viet": "Như vậy là hơi quá cân so với chiều cao của tôi.", "eng": "It's a little too much for my height."}, {"viet": "Cái cổng ở đằng kia kìa.", "eng": "It's that gate over there."}, {"viet": "Phải mất một thời gian dài để học một ngôn ngữ mới.", "eng": "It takes a long time to learn a new language."}, {"viet": "Việc đó đã được hoàn thành nhờ kỹ nghệ hiện đại.", "eng": "It was achieved with the benefit of modern technology."}, {"viet": "Đó là một trận ngang ngửa đến vòng cuối cùng.", "eng": "It was nip and tuck until the final round."}, {"viet": "Anh rất chu đáo khi nhớ sinh nhật của tôi.", "eng": "It was very thoughtful of you to remember my birthday."}, {"viet": "Ý liên kết với Đức trong chiến tranh thế giới lần II.", "eng": "Italy allied itself with Germany during World War II."}, {"viet": "John là người tốt nhất để lấp vào chỗ trống này.", "eng": "John's the best person to fill this vacancy."}, {"viet": "Hãy đọc hết lời hướng dẫn, anh sẽ hiểu.", "eng": "Just read through the instructions, you'll get the idea."}, {"viet": "Những người đến muộn sẽ không được vào cho đến giờ giải lao.", "eng": "Latecomers will not be admitted untill the interval."}, {"viet": "Chúng ta hãy trốn học đi hát karaôkê đi.", "eng": "Let's cut class and go to karaoke."}, {"viet": "Duy trì một công việc theo dõi hoạt động của chính quyền địa phương.", "eng": "Maintain a watching brief on local government activity."}, {"viet": "Nhiều người ra biển, họ bị cuốn hút bởi thời tiết đẹp.", "eng": "Many people visited the sea, attracted by the fine weather."}, {"viet": "Số đông công nhân không muốn cuộc bãi công này.", "eng": "Mass of workers do not want this strike."}, {"viet": "Tôi vào phòng vệ sinh của bạn một chút được không-Tôi buồn tiểu đến vỡ bụng ra!", "eng": "May I use your lavatory-I'm bursting!"}, {"viet": "Hầu hết các bác sĩ đều khuyên dùng biện pháp tránh thụ thai.", "eng": "Most doctors give advice on contraception."}, {"viet": "Ông Vương ạ, tôi thành thật xin lỗi, tôi không thể đến vào sáng thứ sáu.", "eng": "Mr. Wang, I'm awfully sorry, but I won't be able to come over Friday morning."}, {"viet": "Cái ôtô của tôi luôn luôn dở chứng-tôi không thể tin tưởng được ở nó.", "eng": "My car's a law unto itself-I can't rely on it."}, {"viet": "Tổ tiên tôi sống ở phía tây Xcôtlen.", "eng": "My forebears lived in the west of Scotland."}, {"viet": "Các cháu tôi cố gắng giúp đỡ công việc trong nhà.", "eng": "My nephews tried to make themselves useful about the house."}, {"viet": "Đồng hồ tôi nhanh, cần phải vặn lùi lại năm phút.", "eng": "My watch is fast, it needs putting back five minutes."}, {"viet": "New York là một nơi hỗn cư lớn của những người có quốc tịch khác nhau.", "eng": "New York is a vast melting-pot of different nationalities."}, {"viet": "No not và either là những từ phủ định.", "eng": "No, not and either are negatives."}, {"viet": "Chẳng có ai biết nhiều về anh ta, anh ta sống ( rất ) tách biệt.", "eng": "Nobody knows much about him, he keeps himself ( very much ) to himself."}, {"viet": "Bây giờ con nên dùng chút nữa thì hơn.", "eng": "Now you'd better get some milk."}, {"viet": "Ồ, nó chỉ cần vài cái đinh thôi.", "eng": "Oh, it only needs a few nails'3'."}, {"viet": "Thay mặt tất cả thành viên của đoàn đại biểu, và nhân danh cá nhân, xin phép cho tôi được bày tỏ lòng cảm ơn chân thành của tôi.", "eng": "On behalf of all the members of the delegation, and on my own behalf, please allow me to express my sincere thanks."}, {"viet": "Một đầu màu xanh, một đầu màu đỏ và hai màu nhập vào nhau ở đoạn giữa.", "eng": "One end is blue, one end is red, and the colours merge in the middle."}, {"viet": "Chỉ những chính sách của đảng chúng ta mới làm đất nước hoàn toàn hồi phục lại.", "eng": "Only our party's policies will put the country on its feet again."}, {"viet": "Sự chịu đựng của chúng tôi đã được thử thách đến mức cao nhất.", "eng": "Our endurance was tested to the utmost."}, {"viet": "Sản phẩm mới của chúng tôi sẽ giữ cho phòng tắm của các vị sạch sẽ và không có mùi.", "eng": "Our new product will keep your bathroom clean and odourless."}, {"viet": "Giờ thăm bệnh của chúng tôi là từ 9 giờ đến 11 giờ sáng và từ 2 giờ đến 4 giờ chiều.", "eng": "Our visiting hours are from nine to eleven o'clock in the morning and two to four o'clock in the afternoon."}, {"viet": "Hành khách phải làm thủ tục chậm nhất là một giờ trước khi bay.", "eng": "Passengers should check in one hour before their flight time at the latest."}, {"viet": "Người ta thường mua bán hàng hóa, đặc biệt là hàng thủ công họ làm.", "eng": "People usually buy and sell things, especially crafts they have made."}, {"viet": "Vui lòng cho chúng tôi xem hàng mẫu khăn tay tơ nhân tạo của chính quý vị.", "eng": "Please show us your own samples of Rayon Handkerchiefs."}, {"viet": "Tối nay có thể mưa nhưng không chắc chắn.", "eng": "Rain is possible but not probable this evening."}, {"viet": "Các đội tìm kiếm đã được phái đi khắp nơi.", "eng": "Search-parties had been sent out to all points of the compass."}, {"viet": "Sáng giá cổ phần đã ổn định lại.", "eng": "Share prices bounced back this morning."}, {"viet": "Bà ta luôn chõ mũi của bà ta vào mọi việc.", "eng": "She's always poking her snout into everything."}, {"viet": "Cô ta ủng hộ ban giám đốc về vấn đề này.", "eng": "She's going along with management on this issue."}, {"viet": "Thật sự cô ấy không quá khổ, chỉ có cao lớn thôi.", "eng": "She's not really outsize-just well-built."}, {"viet": "Cô ta quá cưng con mèo của cô ấy.", "eng": "She's too sentimental about her cat."}, {"viet": "Cô ta và tôi đã có lần cùng nhau đi trên một con tàu đánh cá.", "eng": "She and I were shipmate on a trawler one."}, {"viet": "Bà ta không thể che giấu được những thiếu sót của mình với tính cách một nhà văn.", "eng": "She can't hide her deficiencies as a writer."}, {"viet": "Chị ấy không thể tìm được chỗ nào để ở, mặc dù không phải không có cố gắng.", "eng": "She couldn't find anywhere to live, though not for want of trying."}, {"viet": "Cô ấy đã bị chết vì sốc sau khi phẫu thuật não.", "eng": "She died of shock following an operation on her brain."}, {"viet": "Nàng thấy mình giống hệt Scarlett Ôhara.", "eng": "She feels identification with Scarlet O'Hara."}, {"viet": "Cô ta hôn vội lên má dì.", "eng": "She gave her aunt a quick peck on the cheek."}, {"viet": "Cô ấy thực sự gian nan đau khổ khi cha cô ấy mất.", "eng": "She had a really rough time when her father died."}, {"viet": "Cô ấy có đầu óc sắc sảo và sáng tạo.", "eng": "She has a mind that is sharp and inventive."}, {"viet": "Cô ấy đã hai lần bị kết tội ( lừa gạt ).", "eng": "She has twice been convicted ( of fraud )."}, {"viet": "Cô ấy là người Anh nhưng cũng có bà con họ hàng người Đức.", "eng": "She is British but also has German connections."}, {"viet": "Cô ấy không cao lắm và cô ấy cực kỳ nhẹ cân.", "eng": "She isn't very tall and she is extremely light."}, {"viet": "Trước kia cô ấy sống ở làng, nhưng bây giờ cô ấy sống ở thành phố.", "eng": "She lived in a village then, but now she lives in a town."}, {"viet": "Sau vụ tai nạn cô ấy đã bình phục nhanh.", "eng": "She makes a quick recovery after her accident."}, {"viet": "Cô ta mở cửa cho tôi vào.", "eng": "She opened the door for me to come in."}, {"viet": "Cô ta làm được một việc phi thường là đã được ông tổng thống đồng ý cho phỏng vấn.", "eng": "She pulled off a great coup in getting the president to agree to an interview."}, {"viet": "Cô ấy đánh đôi giày của mình bằng một cái giẻ để làm cho nó bóng lên.", "eng": "She rubbed her shoes with a cloth to make them shine."}, {"viet": "Cô ấy không đủ sức khoẻ để đi du lịch.", "eng": "She's in no condition to travel."}, {"viet": "Cô ta nói những điều khá là bất lợi về anh ta.", "eng": "She said some pretty damning things about him."}, {"viet": "Cô ta cởi áo khoác ngoài khi cô ta vào phòng.", "eng": "She shed her coat when she came into the room."}, {"viet": "Cô ta đã dành trọn một buổi chiều hữu ích trong thư viện.", "eng": "She spent a profitable afternoon in the library."}, {"viet": "Trong khi khiêu vũ, cô ta lắc hông một cách quyến rũ.", "eng": "She swayed her hips seductively as she danced."}, {"viet": "Cô ấy lo sợ khi nghĩ đến điều có thể xảy đến với anh ta.", "eng": "She trembled to think what might have happened to him."}, {"viet": "Cô ấy muốn lấy chống năm 16 tuổi, nhưng cha cô ấy phản đối ý muốn đó.", "eng": "She wanted to get married at 16 but her father opposed her wish."}, {"viet": "Cô ấy được rửa tội lúc một tháng tuổi và khi mười ba tuổi thì được làm lễ thêm sức.", "eng": "She was baptized when she was a month old and confirmed when she was thirteen."}, {"viet": "Cô ấy thật sự kinh hoàng bởi cơn bão.", "eng": "She was genuinely frightened by the storm."}, {"viet": "Số của cô ta thế nào rồi cũng thành công.", "eng": "She was obviously predestined to succeed."}, {"viet": "Cô ta đã nói về chuyện ấy suốt mấy giờ đồng hồ.", "eng": "She was speaking about it for hours."}, {"viet": "Cô ấy vẫn làm việc tốt cho đến khi cơn bệnh làm gián đoạn.", "eng": "She was working well until illness supervened."}, {"viet": "Cô ấy mong quên đi cái đoạn đưa đến cái chết của mẹ cô ấy.", "eng": "She wished to forget the episode that brought about her mother'death."}, {"viet": "Cô ta luồn lách qua đám đông.", "eng": "She wound her way through the crowds."}, {"viet": "Chỉ đường cho anh ta đi đến nhà ga.", "eng": "Show him the way to the station."}, {"viet": "Vì chẳng còn người nào khác trong phòng tôi có thể nằm dang rộng chân tay ra.", "eng": "Since there was no one else in the compartment, I was able to spread oneself."}, {"viet": "Đánh mạnh đối thủ của mình quanh võ đài.", "eng": "Slogging one's opponent all around the ring."}, {"viet": "Vậy, không chậm trễ, xin hãy để tôi giới thiệu các vị khách tối nay.", "eng": "So, without more ado, let me introduce tonight's guests."}, {"viet": "Những người lính bắn qua chướng ngại vật vào quân nổi dậy.", "eng": "Solders fired over the barricaded at the rebels."}, {"viet": "Một số nhạc hiện đại nghe rất chói tai và chẳng ra điệu gì cả.", "eng": "Some modern music sounds harsh and tuneless."}, {"viet": "Một số người nói rằng chủ nghĩa tư bản và chủ nghĩa đế quốc rồi ra cũng giống nhau.", "eng": "Some say that capitalism and imperialism will eventually converge."}, {"viet": "Một điều gì đó mà ông thượng nghị sĩ có thể dùng để chống lại các uỷ viên khác.", "eng": "Something the senator can use to dob in other members."}, {"viet": "Sự giảm giá đặc biệt cho mọi tuyến xe buýt cho người già.", "eng": "Special concession on all bus fares for old people."}, {"viet": "Các tiết lộ về sự tàn bạo của cảnh sát gây sửng sốt.", "eng": "Startling disclosures of police brutality."}, {"viet": "Đừng có dành ăn hết chỗ bánh quy và hãy chuyền vòng quanh.", "eng": "Stop hogging the biscuits and pass them round!"}, {"viet": "Sinh viên phải có quyền sử dụng một thư viện tốt.", "eng": "Students must have access to a good library."}, {"viet": "Những lời nhận xét thiên vị như thế nhằm kích thích sự phản kháng mạnh mẽ.", "eng": "Such tendentious remarks are likely to provoke strong objections."}, {"viet": "Chắc chắn từ chức là một hành động khá vội vã.", "eng": "Surely resigming was a rather rash action."}, {"viet": "Hãy nghe theo lời khuyên của bác sĩ.", "eng": "Take heed of your doctor's advice."}, {"viet": "Thầy giáo thường chữa lỗi bằng mực đỏ.", "eng": "Teachers usually make corrections in red."}, {"viet": "Bọn khủng bố đã tấn công hai chiến sĩ đang làm nhiệm vụ tuần tra.", "eng": "Terrorists attacked two soldiers on patrol."}, {"viet": "Đây không phải là một chuỗi kim cương thật, đó chỉ là đồ giả!", "eng": "That's not a real diamond necklace, it's just a fake!"}, {"viet": "Nước đó rất mạnh về hải quân.", "eng": "That country was a great maritime power."}, {"viet": "Cô bé bị làm hư quá chừng-nó đòi gì bố mẹ nó cũng chiều.", "eng": "That little girl is terribly spoilt-her parents give her everything she asks for."}, {"viet": "Đó là một cách nói hay đấy.", "eng": "That's a good way of putting it."}, {"viet": "Chơi xỏ bạn như thế thật đê tiện quá.", "eng": "That was a contemptible trick to play on a friend."}, {"viet": "Tai nạn xảy ra tại một trong những ga đầu mối xe lửa nhộn nhịp nhất nước.", "eng": "The accident happened at one of the country's busiest railway junctions."}, {"viet": "Chính quyền đã hết sức cố gắng có được chấp thuận của quốc hội.", "eng": "The Administration undertook a full-courted press to secure congressional approval."}, {"viet": "Người Mỹ chọn ông Bush làm tổng thống.", "eng": "The Americans choose Mr. Bush to be president."}, {"viet": "Vòm này có khoảng cách 60 mét.", "eng": "The arch has a span of 60 metres."}, {"viet": "Áo choàng của hoạ sĩ này đầy vết sơn.", "eng": "The artist's smock was covered in paint."}, {"viet": "Các nhà chức trách đã treo giải lấy đầu tên kẻ cướp.", "eng": "The authorities put a price on the outlaw's head."}, {"viet": "Quả bóng nảy bật ra khỏi cột dọc bên trái khung thành.", "eng": "The ball bounced off the left upright of the goal."}, {"viet": "Cái giỏ rất nhẹ, tôi có thể nâng lên dễ dàng.", "eng": "The basket is very light-I can easy pick it up."}, {"viet": "Thứ rượu ngon nhất trên thế gian.", "eng": "The best wine under the sun."}, {"viet": "Cú đánh làm anh ấy bất tỉnh.", "eng": "The blow caused him to lose his consciousness."}, {"viet": "Cuốn sách này về điện và những chủ đề có liên quan.", "eng": "The book is about electricity and related subjects."}, {"viet": "Đứa bé trình diện trước quan toà vì bị buộc tội ăn cắp.", "eng": "The boy appeared before the magistrate on a charge of theft."}, {"viet": "Cầu đã bị phá huỷ, cho nên chúng ta không thể sang sông được.", "eng": "The bridge was destroyed so we couldn't get across the river."}, {"viet": "Người bán vé xe buýt định lừa tôi lấy sáu xu.", "eng": "The bus conductor tried to diddle me out of six pence."}, {"viet": "Tình hình thủ đô yên tĩnh nhưng tin tức cho biết một vài nơi khác vẫn còn tiếp tục hỗn loạn.", "eng": "The capital is calm, but continuing disorder has been reported elsewhere."}, {"viet": "Chiếc ôtô hình như chết máy.", "eng": "The car seems to have given up the ghost."}, {"viet": "Con mèo uốn cong lưng khi nó nhìn thấy con chó.", "eng": "The cat arched its back when it saw the dog."}, {"viet": "Người thách đấu cân nặng 64, 5 kilô.", "eng": "The challenger weighing in at 64, 5 kilos."}, {"viet": "Đứa trẻ biểu lộ óc sáng kiến cao khi đi tìm cảnh sát.", "eng": "The child displayed great initiative in going to fetch the police."}, {"viet": "Lũ trẻ tíu tít giúp đỡ mẹ ở trong vườn.", "eng": "The children are busy as bees, helping their mother in the garden."}, {"viet": "Sự nóng bức khiến các trẻ em chóng uể oải.", "eng": "The children soon began to languish in the heat."}, {"viet": "Khoá lễ nhà thờ để tưởng niệm nhưng người đã hi sinh trong chiến tranh.", "eng": "The church service is a memorial to these killed in wars."}, {"viet": "Những người lên núi đã vượt qua mặt phía đông của ngọn núi một cách dễ dàng.", "eng": "The climbers traversed the east face of the mountain with ease."}, {"viet": "Tuyển tập tác phẩm của Shakespeare.", "eng": "The collected works of Shakespeare."}, {"viet": "Tuyết kết chặt lại trên vỉa hè biến thành băng.", "eng": "The compacted snow on the pavement turned to ice."}, {"viet": "Công ty muốn đặt văn phòng chính của mình ở phía nam.", "eng": "The company wants to situate its headquarters in the south."}, {"viet": "Hiến pháp là nơi gìn giữ những quyền cơ bản của mọi công dân.", "eng": "The constitution enshrines the basic rights of all citizens."}, {"viet": "Hội đồng không chấp thuận kế hoạch của chúng tôi.", "eng": "The council did not smile on our plan."}, {"viet": "Tòa cho ông ta hưởng bồi thường thiệt hại là 50.000 bảng.", "eng": "The court awarded him damages of £ 50,000."}, {"viet": "Đám đông vỗ tay tán thưởng buổi trình diễn suốt năm phút.", "eng": "The crowd applauded the performance for five minutes."}, {"viet": "Tập tục này vẫn còn rớt lại ở một số làng.", "eng": "The custom still lingers in some villages."}, {"viet": "Con số tử vong người ta cho rằng lên tới từ 10 đến 99.", "eng": "The death toll is thought to have reached double figures."}, {"viet": "Phòng này được tổ chức rất tồi cho đến khi bà ta chịu trách nhiệm điều hành nó.", "eng": "The department was badly organized until she took charge of it."}, {"viet": "Phòng ăn thì nhỏ, bởi vậy có hai lượt ăn dành cho bữa trưa.", "eng": "The dining-hall is small, so there are two sittings for lunch."}, {"viet": "Bác sĩ khuyên bà ấy đeo vòng đai sau khi phẫu thuật bụng.", "eng": "The doctor advised her to wear a girdle after abdominal surgery."}, {"viet": "Các tài liệu sẽ được giữ kín trong mười năm nữa.", "eng": "The documents will be kept under wraps for ten more years."}, {"viet": "Cánh cửa bất chấp mọi nỗ lực để mở nó.", "eng": "The door defied all efforts to open it."}, {"viet": "Lông vịt giũ sạch nước ngay.", "eng": "The duck's feathers shed water immediately."}, {"viet": "Sự thất bại trong cuộc bầu cử đặt vị lãnh đạo đảng vào một vị trí bấp bênh.", "eng": "The election defeat puts the party leader in a vulnerable position."}, {"viet": "Vùng quê nước Anh trông đẹp nhất là vào mùa xuân.", "eng": "The English countryside looks at its best in spring."}, {"viet": "Vị cựu tổng thống đang cư trú tại Tây Ban Nha bị buộc tội biến thủ quỹ của công ti.", "eng": "The ex-chairman, now resident in Spain is accused of embezzling company funds."}, {"viet": "Công việc làm thêm đã choán mất thời giờ rỗi của họ.", "eng": "The extra work would encroach on their free time."}, {"viet": "Người nông dân xới lên được một cái sọ người trong lúc đang cày ruộng.", "eng": "The farmer turned up a human skull while ploughing the field."}, {"viet": "Cuốn phim nắm bắt được bầu không khí tin cậy thầm lặng ở bệnh viện.", "eng": "The film captured the mood of quiet confidence at the hospital."}, {"viet": "Người lính cứu hoả phun nước vào toà nhà đang cháy.", "eng": "The fireman sent jets of water into the burning house."}, {"viet": "Lần đầu tiên tôi nghe tin công ty đóng cửa hẳn là khi George kể với tôi.", "eng": "The first I heard about the firm closing down was when George told me."}, {"viet": "Hoa là một cảnh hấp dẫn trong mùa xuân.", "eng": "The flowers are a lovely sight in spring."}, {"viet": "Chuyến bay 4 giờ tới Paris, vào thứ sáu ngày mùng bốn tháng sáu.", "eng": "The four o'clock flight to Paris, on Friday the fourth of June."}, {"viet": "Trận đấu đó là một trận thua đậm 10-0.", "eng": "The game was a 10-0 massacre."}, {"viet": "Không khí ấm áp của các quần đảo Thái Bình Dương.", "eng": "The genial air of the Pacific Islands."}, {"viet": "Số hàng đã được gửi đến cho các ông bằng đường sắt và theo kế hoạch thì lúc này đã phải đến chỗ các ông rồi.", "eng": "The goods were consigned to you by railway and should have arrived by now."}, {"viet": "Chính phủ đã ra thông báo kiên quyết bác bỏ lời đồn đại này.", "eng": "The government has issued a firm denial of this rumour."}, {"viet": "Gần đây chính phủ đã bị báo chí công kích dữ dội.", "eng": "The government taken a lot of stick from the press recently."}, {"viet": "Cậu bé ăn tham đã ăn hết cả một hộp chocolate.", "eng": "The greedy bay the a whole box of chocolates."}, {"viet": "Những người khách đang vào một nhà hàng và một nhân viên phục vụ đang đón tiếp họ.", "eng": "The guests are entering a restaurant and a waiter is receiving them."}, {"viet": "Sự nóng bức của mùa hè và sự lạnh lẽo của mùa đông.", "eng": "The heat of summer and the cold of winter."}, {"viet": "Tiếng kêu của những con ngỗng trời di trú.", "eng": "The honking cry of migrating geese."}, {"viet": "Khách sạn đã hết chỗ nên chúng tôi phải ngủ trong nhà phụ.", "eng": "The hotel was full so we had to sleep in the annexe."}, {"viet": "Những ngôi nhà bị phá huỷ để lấy lối đi cho đường cao tốc.", "eng": "The houses Were knocked down to make room for a motorway."}, {"viet": "Hàng cột đồ sộ bao quanh đền Parthenon.", "eng": "The imposing peristyle of the Parthenon."}, {"viet": "Những đòi hỏi quá đáng của người thu thuế.", "eng": "The inordinate demands of the tax collector."}, {"viet": "Vấn đề này đã làm phân hóa chính phủ.", "eng": "The issue has divided the Government."}, {"viet": "Viên thẩm phán nói với bồi thẩm rằng họ không được phép để tình cảm chi phối.", "eng": "The judge told the jury that they must not allow their feelings to prejudice them."}, {"viet": "Ứng viên đảng Lao động mất tiền ký quỹ tranh cử.", "eng": "The Labour candidate lost his deposit."}, {"viet": "Vòng đàm phán mới nhất về tiền lương đã tan vỡ.", "eng": "The latest round of pay talks has broken down."}, {"viet": "Điểm được lặp đi lặp lại trong bài diễn văn của bà ấy là sự cần thiết phải tiết giảm kinh phí.", "eng": "The leitmotiv of her speech was the need to reduce expenditure."}, {"viet": "Con sư tử tấn công nạn nhân của nó một cách hung dữ.", "eng": "The lion attacked its victim with great ferocity."}, {"viet": "Mất sự ngây thơ trong trắng nguyên thủy của họ.", "eng": "The loss of their primal innocence."}, {"viet": "Điều chủ yếu là phải nhận thêm đơn đặt hàng.", "eng": "The main thing is to get more orders."}, {"viet": "Thị trường tràn ngập với các loại xe hơi đã dùng rồi nhưng vẫn còn tốt.", "eng": "The market is saturated with good used cars."}, {"viet": "Thứ thuốc đó ghê quá, tôi muốn ói ra.", "eng": "The medicine was so horrid I couldn't keep it down."}, {"viet": "Nhóm sĩ quan đảo chính đang bắt người vì sự chống đối chính trị.", "eng": "The military junta is arresting people for political dissidence."}, {"viet": "Lịch sử hiện đại của Ý bắt đầu từ năm 1860 khi đất nước được thống nhất.", "eng": "The modern history of Italy dates from 1860 when the country became united."}, {"viet": "Nét nổi bật nhất trong phong cảnh.", "eng": "The most prominent feature in the landscape."}, {"viet": "Âm nhạc chơi cho các diễn viên múa vào.", "eng": "The music played for the entrance of the dancers."}, {"viet": "Chiếc cầu mới đó là sự thắng lợi của khoa công trình.", "eng": "The new bridge is a triumph of engineering."}, {"viet": "Có nhiều suy đoán quanh kế hoạch mới đó.", "eng": "The new plan is surrounded by much speculation."}, {"viet": "Tin tức về sự bại trận bắt đầu lộ ra.", "eng": "The news of the defeat started to filter through."}, {"viet": "Miền ôn đới Bắc và Nam.", "eng": "The North and South temperate zones."}, {"viet": "Chất dinh dưỡng trong đất là một tác nhân làm cho cây cối phát triển.", "eng": "The nutrient in the soil acts as a stimulus to make the plants grow."}, {"viet": "Đồ đạc cũ phủ đầy bụi.", "eng": "The old furniture was covered in dust."}, {"viet": "Cách duy nhất để sao chép sách vở là chép lại bằng tay.", "eng": "The only way to make a copy of a book was to copy it by hand."}, {"viet": "Ống thoát nước ở bồn tắm bị nghẹt.", "eng": "The overflow from the bath is blocked."}, {"viet": "Bữa tiệc trở nên vui nhộn khi rượu bắt đầu được phục vụ phủ phê.", "eng": "The party became lively when the drink began to flow."}, {"viet": "Người bệnh sau mười ngày mới được phép đứng dậy ra khỏi giường.", "eng": "The patient was allowed up after ten days."}, {"viet": "Người mà thư này gửi đến đã chết ba năm nay rồi.", "eng": "The person to whom this letter was addressed died three years ago."}, {"viet": "Dùng thuốc viên ngừa thai là một biện pháp hạn chế sinh đẻ.", "eng": "The pill is one method of birth-control."}, {"viet": "Máy bay phải thay đổi hướng và bay theo một con đường khác.", "eng": "The plane had to change course and go another way."}, {"viet": "Vở kịch tồi tệ đến mức cả đống người bỏ rạp ra về lúc giải lao.", "eng": "The play was so awful that there was a general exodus from the theatre at the interval."}, {"viet": "Cảnh sát ghi phạt tôi về tội lái xe nhanh.", "eng": "The police booked me for speeding."}, {"viet": "Cảnh sát đã bố trí người theo dõi kẻ bị nghi là tên cướp.", "eng": "The police put a shadow on the suspected robber."}, {"viet": "Sự trưng bày long trọng của lễ khai mạc Nghị viện.", "eng": "The pomp and ceremony of the state opening of Parliament."}, {"viet": "Nhà máy phát điện này được cung cấp nhiên liệu bằng đường bộ.", "eng": "The power station is serviced by road transport."}, {"viet": "Tổng thống có thể dùng đặc quyền của mình để ân xá một tội phạm.", "eng": "The President may use his prerogative to pardon a criminal."}, {"viet": "Những nhận định của thủ tướng hoàn toàn không mang tính chính thức.", "eng": "The Prime minister's remarks were strictly off the record."}, {"viet": "Những tù nhân bị người ta dùng vũ lực tống vào xe cảnh sát.", "eng": "The prisoners were thrown bodily into the police van."}, {"viet": "Sự suy bụng ta ra bụng người.", "eng": "The projection of one's feelings onto others."}, {"viet": "Sự trừng phạt phải xứng với tội ác.", "eng": "The punishment ought to fit the crime."}, {"viet": "Tất cả các con số báo giá đều là giá FOB đã trừ thuế tính bằng đô la Mỹ.", "eng": "The quotations are all in US dollars net FOB."}, {"viet": "Cái cửa sau được gắn bản lề ở trên để mở ngược lên.", "eng": "The rear door is hinged at the top so that is opens upward."}, {"viet": "Đó chỉ là một nhận xét có tính chất bông đùa mà thôi.", "eng": "The remark was only made in play."}, {"viet": "Kết quả thí nghiệm làm hài lòng.", "eng": "The result of the experiment is satisfactory."}, {"viet": "Nghi thức lễ uống trà của người Nhật.", "eng": "The ritual of the Japanese tea ceremony."}, {"viet": "Những hòn đá rơi ầm ầm lên chiếc xe ôtô.", "eng": "The rocks crashed down onto the car."}, {"viet": "Các nhà cầm quyền Tây Ban Nha rất phấn khởi.", "eng": "The rules of Spain were excited."}, {"viet": "Sự hài lòng làm công việc mình yêu thích.", "eng": "The satisfactions of doing work that one loves."}, {"viet": "Điểm được tính là bảy điểm cho mỗi bên ở vòng tứ kết.", "eng": "The score was seven up in the final quarter."}, {"viet": "Người lính gác hô người lạ mặt đứng lại ở cổng.", "eng": "The sentry challenged the stranger at the gates."}, {"viet": "Con tàu biến mất không để lại một dấu vết.", "eng": "The ship had vanished without trace."}, {"viet": "Cửa hàng này tự hào về tính độc đáo của nó.", "eng": "The shop was proud of its exclusivity."}, {"viet": "Sự kiện riêng biệt quan trọng nhất trong lịch sử thế giới.", "eng": "The single most important event in the history of the world."}, {"viet": "Tiếng chạy êm, im lặng của động cơ.", "eng": "The smooth, silent running of the engine."}, {"viet": "Bài hát gợi lại những kỉ niệm của quá khứ.", "eng": "The song brings back memories of the past."}, {"viet": "Bài diễn văn đã được xây dựng cất gây xúc động.", "eng": "The speech was calculated to stir up emotion."}, {"viet": "Bức tượng to gấp đôi người thật.", "eng": "The statue is twice life-size."}, {"viet": "Đường phố đầy xe cộ đi lại từ sáng chí tối.", "eng": "The street is full of traffic from morning till night."}, {"viet": "Sự xôn xao của cả nước về ma tuý và sự lạm dụng ma tuý đã lên tới đỉnh điểm ở Washington.", "eng": "The sudden national uproar over drugs and drug abuse has reached politically criticalness in Washington."}, {"viet": "Hệ thống này hoạt động theo nguyên lý nhiệt năng.", "eng": "The system works on the principle that heat rises."}, {"viet": "Thầy giáo đuổi nó ra khỏi lớp vì nó là đứa quấy rầy các học sinh khác.", "eng": "The teacher told him to leave as he was a disturbance to the other students."}, {"viet": "Lễ kỷ niệm 300 năm thành lập trường.", "eng": "The tercentenary of the school's foundation."}, {"viet": "Sự đe doạ chiến tranh đã đoàn kết đất nước làm hậu thuẫn cho các lãnh tụ của đất nước ấy.", "eng": "The threat of war has united the country behind its leaders."}, {"viet": "Vào các sáng chủ nhật, thành phố bao giờ cũng có vẻ vắng tanh.", "eng": "The town always looks deserted on Sunday mornings."}, {"viet": "Khách du lịch tắm dưới sông.", "eng": "The travellers washed themselves in the river."}, {"viet": "Hai công ty đang coi việc liên doanh là một khả năng.", "eng": "The two companies are considering merger as a possibility."}, {"viet": "Anh nhà quê thô lỗ gây ấn tượng xấu trong một bữa tiệc chính thức ở khách sạn năm sao.", "eng": "The uncouth villager, cut a poor figure, at the formal dinner held in the five star hotel."}, {"viet": "Giá trị đồng tiền của chúng ta đã sụt xuống gần số không.", "eng": "The value of our currency has sunk to almost nothing."}, {"viet": "Những người tình nguyện đã tự tập hợp thành ba nhóm.", "eng": "The volunteers formed themselves into three groups."}, {"viet": "Theo đà tiến triển của mọi việc thì đến cuối năm công ty sẽ bị phá sản.", "eng": "The way things are going the company will be bankrupt by the end of the year."}, {"viet": "Tin ấy làm cả làng nhao nhác.", "eng": "The whole village is atwitter at the news."}, {"viet": "Người ta nhận thấy người phụ nữ đó theo sát anh ta.", "eng": "The woman was observed to follow him closely."}, {"viet": "Tay đô vật đã thành công trong việc quật ngã đối thủ của mình ở hiệp một.", "eng": "The wrestler succeeded in the throwing his opponent in the first round."}, {"viet": "Cô con gái của họ khá mũm mĩm nhưng cậu con trai thì thật là ục ịch.", "eng": "Their daughter is quite plump but their son is positively elephantine."}, {"viet": "Những kế hoạch của họ bị đình đống vì thiếu tiền.", "eng": "Their plan ran aground for lack of money."}, {"viet": "Sau đó để dung dịch sang một bên cho nó nguội.", "eng": "Then put the solution aside to cool."}, {"viet": "Vở Giấc mộng đêm hè của công ty Shakespeare Hoàng gia được trình diễn ở Barbican.", "eng": "There's a new Royal Shakespeare Company production of A Midsummer Night's Dream at the Barbican."}, {"viet": "Không có một phương thần dược nào cho căn bệnh kinh tế của đất nước.", "eng": "There's no single panacea for the country's economics ills."}, {"viet": "Có nhiều người da đỏ sống ở đây.", "eng": "There are a lot of Indians living around here."}, {"viet": "Ngày nay có trên 300 triệu tín đồ của Khổng Phu Tử.", "eng": "There are over 300,000,000 followers of Confucius today."}, {"viet": "Nó cũng không có quả lắc.", "eng": "There could not be a pendulum either."}, {"viet": "Có một chỗ tắm mát-xa cạnh hồ bơi trong nhà.", "eng": "There is a Jacuzzi next to the indoor pool."}, {"viet": "Không đỗ xe từ 9 giờ sáng đến 6 giờ chiều.", "eng": "There is no parking between 9 am and 6 pm."}, {"viet": "Có một chuyến bay của hãng hàng không Pháp lúc 4 giờ.", "eng": "There's an Air France flight at four."}, {"viet": "Một sự yên lặng khó chịu khi không ai biết phải nói gì.", "eng": "There was an awkward silence, when no one knew what to say."}, {"viet": "Có nhiều người Pháp sống ly hương ở Anh sau cuộc Cách mạng.", "eng": "There were many French exiles in England after the Revolution."}, {"viet": "Những sách này thư viện cho mượn.", "eng": "These books are on loan from the library."}, {"viet": "Các biện pháp mới này chỉ rõ một sự thay đổi hoàn toàn trong chính sách của chính phủ.", "eng": "These new measures indicate an about-turn in government policy."}, {"viet": "Tất cả họ đều tình nguyện, làm việc đó chỉ vì thích mà thôi.", "eng": "They're all volunteers, doing it just for the love of the thing."}, {"viet": "Họ đã phản bội chúng ta bằng cách đồng ý đi làm khi đang có đình công.", "eng": "They've sold us out by agreeing to work during the strike."}, {"viet": "Họ thật sự đang sống xa hoa.", "eng": "They are really living in style."}, {"viet": "Họ luôn luôn có thể nghĩ ra điều xin lỗi cho việc tàu đến chậm.", "eng": "They can always dream up some new excuse for the train arriving late."}, {"viet": "Họ ở lại không lâu lắm ( Họ ở lại một lát ).", "eng": "They didn't stay very long ( they only stayed a short time )."}, {"viet": "Họ thấy mình trên một mảnh đất hoang vu.", "eng": "They found themselves on a desert tract."}, {"viet": "Họ nuôi nhiều súc vật cưng, kể cả ba con mèo.", "eng": "They have many pets, including three cats."}, {"viet": "Họ nhìn nhau ngang qua căn phòng.", "eng": "They looked across the room at each other."}, {"viet": "Họ đã đùn đẩy được những vị khách không mời sang nhà hàng xóm.", "eng": "They palmed their unwelcome guests off on the neighbours."}, {"viet": "Họ đã chèo ( thuyền ) qua sông.", "eng": "They rowed ( the boat ) across ( the river )."}, {"viet": "Họ vẫn chưa đáp lại thư của tôi.", "eng": "They still haven't responded to my letter."}, {"viet": "Họ nhìn ánh sáng chập chờn trên mặt nước.", "eng": "They watch the light playing on the water."}, {"viet": "Chúng không lớn bằng những con cá voi khổng lồ của ngày nay, nhưng chúng to hơn rất nhiều so với những con voi của chúng ta.", "eng": "They were not as big as the great whales of today, but they were far bigger than our elephants."}, {"viet": "Bọn trộm đã ăn trộm ngân hàng rồi bỏ trốn mang theo rất nhiều tiền.", "eng": "Thieves raided the bank and got away with a lot of money."}, {"viet": "Chuyến xe buýt này bị hoãn lại do trục trặc máy móc.", "eng": "This bus was delayed by engine trouble."}, {"viet": "Cuốn từ điển này là cuốn mới nhất tôi có được.", "eng": "This dictionary is my latest acquisition."}, {"viet": "Căn nhà này không cần tiền đặt cọc.", "eng": "This house doesn't require a down-payment."}, {"viet": "Đây đúng là căn phòng chúng ta đã ở năm ngoái.", "eng": "This is the identical room we stayed in last year."}, {"viet": "Người ấy dạy học không hợp.", "eng": "This man is not suited for teaching."}, {"viet": "Cái bút này không viết được-anh có thể cho tôi một cái bút khác không?", "eng": "This pen doesn't work-can you give me another one?"}, {"viet": "Phương thức biểu hiện nghệ thuật nhà điêu khắc này thích nhất là đá.", "eng": "This sculptors favourite medium is stone."}, {"viet": "Công đoàn này chẳng có nhiều ảnh hưởng với chính phủ.", "eng": "This union hasn't much clout with the Government."}, {"viet": "Mặc dầu đã muộn, anh ta vẫn tiếp tục làm việc.", "eng": "Though it was late, he went on working."}, {"viet": "Tom đã có những tiến bộ rất lớn về toán trong học kỳ này.", "eng": "Tom has made enormous strides in his maths this term."}, {"viet": "Sự bất ổn về tương lai là nguyên nhân sâu xa của nỗi lo lắng choáng lấy xã hội Anh.", "eng": "Uncertainty about the future is the root cause of the malaise gripping british society."}, {"viet": "Cẩn thận khi đi qua phố đông.", "eng": "Was careful when crossing the busy street."}, {"viet": "Chúng tôi mong bà đến lúc 10 giờ 30 vào thứ sáu.", "eng": "We'll expect you then at 10: 30 on Friday."}, {"viet": "Chúng tôi sẽ đánh đổi cho nhau, anh ta sẽ có xe máy của tôi và tôi sẽ lấy ô tô của anh ta.", "eng": "We're going to do an exchange, he'll have my bike and I'll take the car."}, {"viet": "Về quan điểm chính trị, chúng tôi hoàn toàn khác nhau.", "eng": "We're worlds apart in our political views."}, {"viet": "Chúng tôi đi từ đầu này tới đầu kia nước Anh.", "eng": "We've travelled from one end of Britain to the other."}, {"viet": "Chúng ta đang đứng trước nhiều khó khăn, nhưng rồi cuối cùng chúng ta sẽ thành công.", "eng": "We are faced with a lot of problems but we'll win through in the end."}, {"viet": "Chúng tôi dự buổi ra mắt của phim.", "eng": "We attended the premier show of the new film."}, {"viet": "Chúng ta có thể đi dạo chơi nếu anh thấy thích thế.", "eng": "We can go for a walk, if you feel so inclined."}, {"viet": "Chúng tôi đã không thoả thuận được là khi nào sẽ gặp nhau.", "eng": "We couldn't agree when to meet."}, {"viet": "Suốt dự án này, chúng tôi đã nhờ đến kinh nghiệm của bà ấy.", "eng": "We drew on her experience throughout the project."}, {"viet": "Chúng tôi nhận được một lá thư xin lỗi của xưởng chế tạo.", "eng": "We had a letter of apology from the manufacturer."}, {"viet": "Chúng tôi có một hồ bơi, một phòng tắm hơi, một phòng chơi bô-ling, một phòng chơi bida, một trung tâm y tế và một trung tâm giải trí ở tầng hầm.", "eng": "We have a Swimming Pool, Sauna, Bowling Room, Billiard Room, Health Center and Recreation Center in the basement."}, {"viet": "Chúng tôi có đủ thời gian để đến sân bay.", "eng": "We have time enough to get to the airport."}, {"viet": "Chúng tôi đã cười khi nhìn thấy áo quần kỳ quặc của nó.", "eng": "We laughed at the sight of his strange clothes."}, {"viet": "Có thể chúng ta có báo chí tự do, nhưng điều đó không có nghĩa là mọi thông tin đều là thật và chính xác.", "eng": "We might have a free press, but that doesn't mean all reporting is true and accurate."}, {"viet": "Chúng ta phải tìm cách chống lại xu hướng chống chính phủ hiện nay.", "eng": "We must try to counteract the present current of anti-government feeling."}, {"viet": "Chúng tôi ngồi phịch xuống cạnh lò sưởi.", "eng": "We plonked ourselves by the fire."}, {"viet": "Chúng tôi bắt chúng làm cái việc chặt củi trong vườn.", "eng": "We set them to set them to work chopping wood in the garden."}, {"viet": "Chúng ta đã phải chịu những tổn thất to lớn trong cuộc khủng hoảng tài chính.", "eng": "We suffered huge losses in the financial crisis."}, {"viet": "Chúng tôi muốn mua cái bàn nhưng mặt nó hỏng rồi.", "eng": "We wanted to buy the table but its surface was damaged."}, {"viet": "Chúng tôi rất sợ cô giáo toán-Đúng là bà La Sát.", "eng": "We were really frightened of the math teacher-She was a real dragon."}, {"viet": "Chúng tôi muốn có mẫu các áo jacket da mới nhất của các ông theo các cỡ khác nhau với giá thấp nhất.", "eng": "We would like to have samples of various sizes of your latest leather jackets together with the lowest price."}, {"viet": "Chà! Sắp cưới mà không nói cho chúng tôi biết nhé!", "eng": "Well, I never! Fancy getting married and not telling us!"}, {"viet": "Lần tới chúng tôi sẽ mời thêm bạn bè đến ăn thử món này.", "eng": "Well invite more friends to taste the dish next rime."}, {"viet": "Lại nhặng xị lên với cái chuyện thanh toán hoá đơn rồi!", "eng": "What a palaver there was about paying the bill!"}, {"viet": "Có cái gì có thể bù lại việc mất danh dự?", "eng": "What can compensate of the loss of honour?"}, {"viet": "Chữ viết của cô ta cho anh thấy gì về tính cách của cô ấy?", "eng": "What does her handwriting tell you about her character?"}, {"viet": "Thủ đô của New Zealand là gì?", "eng": "What is the capital city of New Zealand?"}, {"viet": "Hình như tất cả đều quan trọng nhất là tiền.", "eng": "What it all seemed to boil down to was money."}, {"viet": "Đơn vị nhỏ nhất của tiền nhân dân tệ là bao nhiêu?", "eng": "What's the smallest denomination of Yuan currency?"}, {"viet": "Cái gì sẽ xảy ra nếu như loài người bị tiêu diệt.", "eng": "What would happen if the human race should be annihilated."}, {"viet": "Khi ông ta giảng bài ông ta không thực sự quan tâm đến việc học tập của sinh viên.", "eng": "When he's lecturing he's not really bothered about the students learning."}, {"viet": "Mùa mưa ở Los Angeles là khi nào?", "eng": "When is the rainy season in Los Angeles?"}, {"viet": "Khi con tàu chìm, chúng tôi đã phải bơi để tự cứu lấy mình.", "eng": "When the ship sank we had to swim for it."}, {"viet": "Khi nào thì anh mới có thời gian để làm việc đó?", "eng": "Whenever did you have time to do all that work?"}, {"viet": "Bạn thích đến thăm nơi nào ở Nhật Bản?", "eng": "Where is your favorite place to visit in Japan?"}, {"viet": "Trong hai chiếc váy này em thích cái nào hơn?", "eng": "Which of these two dresses do you prefer?"}, {"viet": "Một số nhân vật truyền hình nổi tiếng ở đất nước của bạn là những ai?", "eng": "Who are some famous T. V. personalities in your country?"}, {"viet": "Bất cứ ai mà họ chọn thì đều có quyền.", "eng": "Whosoever they chose will have this right."}, {"viet": "Tại sao anh lại đánh dấu câu này là sai?", "eng": "Why have you marked the sentence wrong?"}, {"viet": "Tôi lấy làm vinh dự nếu ông đến dùng cơm tối với tôi?", "eng": "Will you do me the honour of dining with me?"}, {"viet": "Với một cố gắng lớn, anh ta đẩy cánh cửa, mở cửa ra.", "eng": "With a great effort he pushed open the door."}, {"viet": "Anh không miễn cho tôi khoản nợ cỏn con vậy sao?", "eng": "Won't you forgive me such a small debt?"}, {"viet": "Bạn có muốn dùng thêm không?", "eng": "Would you like a second helping?"}, {"viet": "Anh cảm phiềm đưa những cái đĩa đó lên cho em được không?", "eng": "Would you mind putting up the dishes for me?"}, {"viet": "Viết một cuốn sách là một công việc nhiều khó khăn hơn nó tưởng.", "eng": "Writing a book was a more difficult job than he'd thought."}, {"viet": "Vâng, luật pháp ở cả Hy Lạp lẫn La Mã công nhận ngân hàng và nhiều chức năng ngân hàng.", "eng": "Yes, laws in both Greece and Rome recognized banks and many bank functions."}, {"viet": "Anh sẽ suy sụp nếu anh cứ tiếp tục làm việc quá vất vả.", "eng": "You'll crack up if you go on working so hard."}, {"viet": "Em đẹp hơn những cô gái tham gia cuộc thi nhiều.", "eng": "You're far prettier than girls who have enter so far."}, {"viet": "Cô đã tận tình giúp đỡ để chuyến lưu lại đây của chúng tôi thật thú vị.", "eng": "You've really helped to make our stay here most pleasant."}, {"viet": "Anh không thể lừa gạt được tôi đâu, tôi không dễ bị lừa gạt, anh biết đấy.", "eng": "You can't fool me, I wasn't born yesterday, you know."}, {"viet": "Cô có thể vứt bỏ mọi ý định lấy Tom đi.", "eng": "You can give up any thought of marrying Tom."}, {"viet": "Anh có thể cảm thấy sự đối kháng giữa họ với nhau.", "eng": "You could sense the antagonism between them."}, {"viet": "Bạn có khiếu thẩm mỹ tốt về các ông đấy!", "eng": "You have good taste in men!"}, {"viet": "Ông biết có thể đi máy bay đêm mà.", "eng": "You know you could fly at night."}, {"viet": "Anh cần phải xác định xem những điều ưu tiên của anh là gì.", "eng": "You must decide what your priorities are."}, {"viet": "Anh cần phải để cả sức lực của mình vào công việc này.", "eng": "You need to a devote an your energies to this job."}, {"viet": "Anh nên đi tìm lời khuyên chuyên môn của bác sĩ.", "eng": "You should get some professional advice from your doctor."}, {"viet": "Chỉ đi ngang qua đường cái trong những ngày này, anh cũng có nguy cơ mất mạng đấy!", "eng": "You take your life in your hands simply crossing the road these days!"}, {"viet": "Người kiểu ấy còn lâu mới gặp được.", "eng": "You won't meet his like in a week of Sundays."}, {"viet": "Những hy vọng được đề bạt của anh chỉ là ảo tưởng thôi.", "eng": "Your hopes of promotion are a mere delusion."}, {"viet": "Cái của bạn giống như cái của tôi!", "eng": "Yours is the same at mine!"}]