[{"viet": "1/2, 3/4, 19/20 là những phân số thực sự.", "eng": "1/2, 3/4, 19/20 are proper fractions."}, {"viet": "Một giám đốc bận rộn cần một thư ký thật điềm tĩnh.", "eng": "A busy manager needs a completely unflappable secretary."}, {"viet": "Một thành phố say mê với quá khứ của nó.", "eng": "A city in love with its own past."}, {"viet": "Một quốc gia cạn hết nguồn nhân lực của nó.", "eng": "A country drained of its manpower."}, {"viet": "Một mớ tóc râu quai nón đen rậm rạp viền quanh khuôn mặt của anh ta.", "eng": "A dense mass of black hair framed his face."}, {"viet": "Một khuôn mặt có vết rỗ.", "eng": "A face marked by small pox."}, {"viet": "Vụ cháy ở phòng trưng bày tranh đã gây ra việc kết thúc sớm cuộc triển lãm.", "eng": "A fire in the gallery caused the premature closing of the exhibition."}, {"viet": "Một thiếu nữ có nhiều nét đẹp hấp dẫn.", "eng": "A girl with lots of glamour."}, {"viet": "Một người khách đi vào một nhà hàng Ấn Độ.", "eng": "A guest enters an Indian restaurant."}, {"viet": "Một cục than hồng rơi ra ngoài lò và làm cháy tấm thảm.", "eng": "A hot coal fell out of the fire and burnt the carpet."}, {"viet": "Một phong cảnh với vẻ đẹp không đổi thay theo thời gian.", "eng": "A landscape with a timeless quality."}, {"viet": "Một đứa bé đang chơi đùa với bạn của nó.", "eng": "A little child playing with his friend."}, {"viet": "Một người ở địa vị như anh không thể nói năng như vậy được.", "eng": "A man in your position can't afford to say that."}, {"viet": "Một mô hình đường tàu hỏa bày biện các hình người nhỏ xíu.", "eng": "A model railway layout peopled with lilliputian figures."}, {"viet": "Một hệ thống mới về việc xử lý các mẫu đơn.", "eng": "A new system for processing application forms."}, {"viet": "Một buổi liên hoan đúng là một buổi vui chơi thực sự.", "eng": "A party that was a real ha-ha."}, {"viet": "Một đống phân chó ở trên vỉa hè.", "eng": "A pile of dog shit on the pavement."}, {"viet": "Một đứa trẻ sớm phát triển có thể chơi đàn dương cầm ở tuổi lên ba.", "eng": "A precocious child who could play the piano at the age of three."}, {"viet": "Một dãy lớp kem mùi trái cây trên bánh.", "eng": "A range of fruit-flavoured toppings."}, {"viet": "Sách cuốn hơi giống rèm cửa cuốn.", "eng": "A roll book was a little like a window shade."}, {"viet": "Trước hết phải có óc khôi hài mới hiểu được tác phẩm của bà ấy.", "eng": "A sense of humour is prerequisite to understanding her work."}, {"viet": "Một người ném thiện nghệ có thể cho bu-mê-răng quay nhiều vòng.", "eng": "A skillful thrower can make his boomerang do many stunts."}, {"viet": "Một phương thức giặt máy đặc biệt cho quần áo len.", "eng": "A special wash programme for woolens."}, {"viet": "Một thay đổi về văn phong không cải thiện được chủ đề.", "eng": "A stylistic change will not improve the subject matter."}, {"viet": "Sự bớt lạnh nhạt trong quan hệ Đông-Tây.", "eng": "A thaw in East-West relations."}, {"viet": "Một xe tải có trọng tải 12 tấn.", "eng": "A van with a carrying capacity of 12."}, {"viet": "Một cuộc liên hoan tưng bừng gây hỗn loạn trong căn nhà đó.", "eng": "A wild party that created havoc in the house."}, {"viet": "Theo Kinh Thánh, Thượng đế đã tạo ra con người giống như hình ảnh của ông ta.", "eng": "According to the Bible, God created man in his image."}, {"viet": "Người lớn mà chỉ có khả năng đọc như trẻ em lên tám.", "eng": "Adults with a reading age of eight."}, {"viet": "Sau sự ly dị của bà ta bà ta đã dùng trở lại nhũ danh của bà ấy.", "eng": "After her divorce she reverted to using her maiden name."}, {"viet": "Sau cô dâu và chú rể, ông ấy là vị khách nổi bật nhất.", "eng": "After the bride and groom, he's the most popular guest."}, {"viet": "Không khí là một hỗn hợp các chất khí.", "eng": "Air is a mixture of gases."}, {"viet": "Tất cả mọi thứ đã được đóng xong và sẵn sàng đi chưa?", "eng": "All packed up and ready to go?"}, {"viet": "Tất cả các suối nước nóng này đều phun lên bởi áp lực hơi nước gia tăng dưới lòng đất.", "eng": "All these geysers erupt by the built-up pressure of steam underground."}, {"viet": "Sự hợp nhất là lựa chọn duy nhất thay vì dẫn đến phá sản.", "eng": "Amalgamation was the only alternative to going bankrupt."}, {"viet": "Một căn hộ cho thuê 900 đô la một tháng.", "eng": "An apartment renting for $ 900 a month."}, {"viet": "Một cuộc thi đạt được phân vị thứ 85.", "eng": "An examination score in the 85th percentile."}, {"viet": "Một cuộc phỏng vấn thủ tướng trong chương trình truyền hình tối nay của Panorama.", "eng": "An interview with the prime minister in tonight's edition of Panorama."}, {"viet": "Có một giọng điệu ngầm không bằng lòng qua lời khen của ông ta.", "eng": "An under song of discontent runs through his praise."}, {"viet": "Và tại sao em lại cau mày, Eileen?", "eng": "And why are you frowning, Eileen?"}, {"viet": "Ai có lợi tức hàng năm dưới năm nghìn bảng Anh có thể có đủ tư cách làm đơn xin.", "eng": "Anyone with an annual income of under £ 5,000 may be eligible to apply."}, {"viet": "Có bộ phim bi lụy nào khác không?", "eng": "Are there any other tear-jerker movies?"}, {"viet": "Anh có tài diễn thuyết trước công chúng không?", "eng": "Are you good at speaking in public?"}, {"viet": "Binh lính thường bị cấm kết thân với dân chúng của nước thù địch.", "eng": "Army personnel are often forbidden to fraternize with the civilian population."}, {"viet": "Ngây thơ như đứa trẻ mới sinh.", "eng": "As innocent as a new-born babe."}, {"viet": "Xin ông chủ của mình tăng lương.", "eng": "Ask one's boss for a pay rise."}, {"viet": "Ban đầu, Người ta chỉ nghe một tiếng động lạ.", "eng": "At the beginning, people only hear a strange noise."}, {"viet": "Những tình huống khó xử thường làm anh ta mất bình tĩnh.", "eng": "Awkward situations often found him unready."}, {"viet": "Bạn cần phải chắc chắn là bạn không bị bảo hiểm dưới giá đối với bệnh tật nguy hại.", "eng": "Be certain that you are not underinsured against catastrophic illness."}, {"viet": "Đã đánh đối thủ của anh ta trong trận đấu thực sự thẳng tay.", "eng": "Beat his opponent in the match to a veritable fare-thee-well."}, {"viet": "Bên dưới vẻ tự tin bề ngoài, cô ta hoàn toàn không vững vàng về bản thân.", "eng": "Beneath her self-confident surface, she's quite unsure of herself."}, {"viet": "Bob này, con đến giúp mẹ đi?", "eng": "Bob, would you come and help me?"}, {"viet": "Về mặt phát triển kỹ thuật hiện đại, nước Anh chậm hơn Nhật.", "eng": "Britain is behind Japan in developing modern technology."}, {"viet": "Nhưng anh đánh vần từ này thế nào?", "eng": "But how do you spell this?"}, {"viet": "Nhưng có nhiều thức uống đông lạnh lắm.", "eng": "But there are a lot of frozen drinks."}, {"viet": "Dù cố tưởng tượng đến mấy, anh cũng không thể cho hắn là tham vọng.", "eng": "By no stretch of the imagination could you call him ambitious."}, {"viet": "Tôi có thể mượn ôtô của bạn được không? Dĩ nhiên là được.", "eng": "Can I borrow your car? Surely."}, {"viet": "Liệu chúng ta có thể coi bản báo cáo của anh ta như là bản trung thực không?", "eng": "Can we accept his accounts as the true version?"}, {"viet": "Em cho chị vay 5 bảng Anh được không?", "eng": "Can you lend me £ 5?"}, {"viet": "Vui lòng cho tôi biết Trung tâm Hội nghị và Triển lãm ở đường nào không?", "eng": "Can you tell me which way the Conference and Exhibition Centre is?"}, {"viet": "Ăn mừng sự thành đạt của ai.", "eng": "Celebrate the accomplishment of one's objectives."}, {"viet": "Trẻ con ném những nắm tuyết vào nhau.", "eng": "Children throwing snowballs at each other."}, {"viet": "Ôm chặt đứa bé trong tay của ai.", "eng": "Clutch a baby in one's arms."}, {"viet": "Các công ty luôn luôn tìm kiếm kế hoạch tối ưu để lôi cuốn khách hàng.", "eng": "Companies are always looking for the best tactic to attract customers."}, {"viet": "Sự tiêu dùng vô độ là một điều xúc phạm đối với người có thu nhập thấp.", "eng": "Conspicuous consumption which is an affront to people on low incomes."}, {"viet": "Ngày mai, anh đánh thức tôi dậy lúc 6 giờ được không?", "eng": "Could you get me up at 6.00 tomorrow?"}, {"viet": "Các công trình trong khoá học của sinh viên chiếm tỷ lệ 40% của tổng số điểm.", "eng": "Course-work accounts for 40% of the total marks."}, {"viet": "Daley Thomson đang tới trên lằn trong khúc rẽ.", "eng": "Daley Thomson is coming up on the inside."}, {"viet": "Chứng minh tính xác thực của một lời tuyên bố với ai.", "eng": "Demonstrate a truth of a statement to somebody."}, {"viet": "Đã chuẩn bị mọi mặt công việc cho cuộc phỏng vấn đó.", "eng": "Did extensive prep work for the interview."}, {"viet": "Bạn đã đi du lịch một mình hay đi cùng bạn bè?", "eng": "Did you travel by yourself or with your friends?"}, {"viet": "Hãy đưa vợ anh đến chơi một tối nào đó; chúng tôi thích gặp chị ấy.", "eng": "Do bring your wife round one evening; we'd love to meet her."}, {"viet": "Cô có nhận Đài tệ không?", "eng": "Do you accept New Taiwan dollars?"}, {"viet": "Có tập sách hướng dẫn dành cho khách tham quan không?", "eng": "Do you have a pamphlet for sightseeing?"}, {"viet": "Bạn có biết gì về điều đó không?", "eng": "Do you know anything about that?"}, {"viet": "Bạn có thích công việc của bạn không?", "eng": "Do you often have to work late?"}, {"viet": "Bạn có nghĩ là người Nhật thuộc thế hệ trẻ ít quan tâm đến văn hóa và truyền thống Nhật không?", "eng": "Do you think that the younger generation Japanese are less interested in Japanese culture and tradition?"}, {"viet": "Màu sắc của nó có thành vấn đề không?", "eng": "Does it matter what colour it is?"}, {"viet": "Đừng quá ngờ nghệch mà tin vào mọi điều các nhà chính trị nói với anh.", "eng": "Don't be so innocent as to believe everything the politicians tell you."}, {"viet": "Đừng giao du với anh ta-hắn là kẻ lừa đảo đấy!", "eng": "Don't get mixed up with him-he's a crook!"}, {"viet": "Đừng chồng sách lên quá cao.", "eng": "Don't pile up the books too high."}, {"viet": "Anh đừng có chưa biết đi mà đã đòi chạy.", "eng": "Don't try to run before you can walk."}, {"viet": "Đang làm việc này lại nhảy qua việc kia chẳng có mục đích gì cả.", "eng": "Drift aimlessly from job to job."}, {"viet": "Những nhà thám hiểm ngày xưa có thể khám phá ra châu Mỹ trước Columbus.", "eng": "Earlier explorers probably anticipated Columbus's discovery of America."}, {"viet": "Tiếng Anh hiện nay là ngôn ngữ của thế giới.", "eng": "English is now a world language."}, {"viet": "Đội Everton đã vào được vòng chung kết.", "eng": "Everton have got through to the final."}, {"viet": "Xin lỗi, bạn vui lòng chụp cho chúng tôi một tấm hình được không?", "eng": "Excuse me, but will you take a picture of us?"}, {"viet": "Vui sướng về sự thành công của chị mình.", "eng": "Exult at her sister's success."}, {"viet": "Cảm thấy băn khoăn về vấn đề có nên đi hay không.", "eng": "Feel doubtful about whether to go or not."}, {"viet": "Uống hết trà đi con, ngoan nào.", "eng": "Finish your tea, there's a good boy."}, {"viet": "Những bông hoa bị vùi dập trong mưa gió.", "eng": "Flowers buffeted by the rain and wind."}, {"viet": "Với một tội nghiêm trọng như thế mà hắn ta may mắn chỉ phải nộp một số tiền phạt.", "eng": "For such a serious offence he was lucky to get away with a fine."}, {"viet": "Phung phí tiền của ai vào cuộc đỏ đen.", "eng": "Fritter away one's money on gambling."}, {"viet": "Kỹ thuật về di truyền sẽ có những kết quả mang tính chất cách mạng đối với nhân loại.", "eng": "Genetic engineering will have revolutionary consequences for mankind."}, {"viet": "Chỉ trích gay gắt công việc của anh ấy.", "eng": "Give his work a terrific blasting."}, {"viet": "Đến cửa hàng tạp phẩm mua cho mẹ một ít đường.", "eng": "Go down to the grocer's and get me some sugar."}, {"viet": "Ghép một loại táo lên một loại khác.", "eng": "Graft one variety of apple onto another."}, {"viet": "Gương mặt những đứa trẻ hạnh phúc rạng rỡ.", "eng": "Happy children's faces all aglow."}, {"viet": "Ông có bán áo len chui đầu xám không?", "eng": "Have you any grey pullovers in stock?"}, {"viet": "Gần đây bạn có tìm thấy người đàn ông nào tốt không?", "eng": "Have you found any good men lately?"}, {"viet": "Vì đã lỡ nói dối là tôi vẫn còn tiền, tôi ở trong thế khá khó xử khi họ bảo tôi đưa số tiền đó cho họ.", "eng": "Having lied that I still had the money, I was in rather a corner when they asked me to hand it over."}, {"viet": "Anh ấy đã vạch ra toàn bộ sự nghiệp tương lai của anh ấy.", "eng": "He's already mapped out his whole future career."}, {"viet": "Anh ấy hoàn toàn lãng mạn về người bạn gái mới của anh ấy.", "eng": "He's completely starry-eyed about his new girl-friend."}, {"viet": "Ông ta đưa con trai vào hoạt động trong ngành ngân hàng.", "eng": "He's launching his son on a career in banking."}, {"viet": "Anh ta là người quá ư bình thường, ông không bao giờ nhận ra được anh ta trong đám đông.", "eng": "He's such a nondescript you'd never notice him in a crowd."}, {"viet": "Ông ta đồng ý là tôi có quyền chống án.", "eng": "He allowed that I had the right to appeal."}, {"viet": "Chàng trở nên rất ư là tình tứ ở buổi tiệc cơ quan.", "eng": "He became quite amorous at the office party."}, {"viet": "Anh ta thốt ra một tràng chửi rủa.", "eng": "He came out with a stream of abuse."}, {"viet": "Anh ấy đã tán tỉnh cô ấy để anh đưa cô đi xem phim.", "eng": "He coaxed her into letting him take her to the cinema."}, {"viet": "Ông ta đã quyết định cho mọi thứ mà ông ta có và trở thành một tu sĩ.", "eng": "He decided to give away everything he possessed and become a monk."}, {"viet": "Anh ấy không còn mấy thiết tha với đời.", "eng": "He does not want much from life."}, {"viet": "Ông ta kiểm tra kỹ càng từng món trong cả bộ.", "eng": "He examined every item in the set carefully."}, {"viet": "Anh ta thấy khó mà hòa mình được trong các buổi liên hoan.", "eng": "He finds it hard to mix at parties."}, {"viet": "Hắn cho chúng tôi những phần bánh ngọt nhỏ bé chẳng ra gì.", "eng": "He gave us measly little portions of cake."}, {"viet": "Cậu ấy đã thuộc lòng các câu trả lời.", "eng": "He had all the answers off pat."}, {"viet": "Nó có nhiều trí thông minh bẩm sinh.", "eng": "He has a great deal of native intelligence."}, {"viet": "Ông ta đã trở thành một ông già keo kiệt.", "eng": "He has grown into an old miser."}, {"viet": "Anh ta không ngừng kể một cách hào hứng kỳ nghỉ của mình từ khi anh ấy trở về.", "eng": "He hasn't stopped enthusing about his holiday since he returned."}, {"viet": "Cuối cùng anh ta hãnh diện là người có bằng lái xe.", "eng": "He is at last the proud possessor of a driving-license."}, {"viet": "Ông ta vốn có bản chất có thể chấp nhận chỉ trích mà không tức giận.", "eng": "He is so constituted that he can accept criticism without resentment."}, {"viet": "Ông ta cứ để khách hàng trò chuyện liên tục nhằm bán thêm một thứ gì đó nữa.", "eng": "He kept the customer talking with an eye to selling him something else."}, {"viet": "Anh ta sống ở ngoài bìa rừng.", "eng": "He lives at the edge of the forest."}, {"viet": "Ông ấy đã kiếm được khối tiền trong thời kỳ bùng nổ bất động sản.", "eng": "He made his pile during the property boom."}, {"viet": "Ông ấy cần một sự cấp bách để thúc đẩy ông hành động.", "eng": "He needs a crisis to prod him into action."}, {"viet": "Anh ấy chấm chấm khô mặt bằng khăn lông.", "eng": "He patted his face dry with a towel."}, {"viet": "Anh ta hứa sẽ đến dự nhưng rồi lại cáo lỗi.", "eng": "He promised to attend but then begged off."}, {"viet": "Hắn ta nói dài dòng về công việc của hắn, mà chẳng nhận ra rằng cô ta hết sức chán ngán.", "eng": "He rattled on about his job, not noticing how bored she was."}, {"viet": "Anh đã cứu tôi khỏi một tình thế khó xử.", "eng": "He rescued me from an embarrassing situation."}, {"viet": "Anh ấy là một người làm việc chậm chạp nhưng rất cẩn thận.", "eng": "He's a slow worker but very thorough."}, {"viet": "Anh ta thích chút rượu của mình.", "eng": "He's fond of his dram."}, {"viet": "Thực sự ông ấy không giận-ông ấy chỉ giả đò là ông bố nghiêm khắc vậy thôi.", "eng": "He's not really angry-he's just acting the stern father."}, {"viet": "Anh ta nói 25000 đô la nhưng đó chỉ là con số gần đúng.", "eng": "He said $ 25.000 but it's just a ballpark figure."}, {"viet": "Hình như ông ấy tự cho mình là đại diện của chúng ta.", "eng": "He seem to have constituted himself our representative."}, {"viet": "Anh ấy tỏ ra rất dũng cảm trên chiến trường.", "eng": "He showed great courage in battle."}, {"viet": "Ông ấy dùng thời gian rỗi để làm vườn, bỏ tất cả mọi quan tâm khác.", "eng": "He spent his spare time gardening, to the exclusion of all other interests."}, {"viet": "Anh ta đứng trong khung cửa trên lối vào hội trường.", "eng": "He stood framed in the doorway to the hall."}, {"viet": "Ông ta theo dõi tên gián điệp tới khách sạn của hắn ở.", "eng": "He tailed the spy to his hotel."}, {"viet": "Ông ấy lấy một quyển sách từ trên giá trên cùng xuống.", "eng": "He took a book down from the top shelf."}, {"viet": "Ông ta cố xoa dịu các chủ nợ của mình bằng cách hoàn trả bớt một số tiền.", "eng": "He tried to pacify his creditors by repaying part of the money."}, {"viet": "Nó đánh một quả vô-lê qua sân.", "eng": "He volleyed the ball across the court."}, {"viet": "Hắn bị thôi thúc chỉ vì lòng tham.", "eng": "He was actuated solely by greed."}, {"viet": "Anh ta nóng lòng trả thù cho cái chết của cha mình.", "eng": "He was burning to avenge the death of his father."}, {"viet": "Anh ta bị suy yếu bởi căn bệnh kéo dài.", "eng": "He was enervated by his long time illness."}, {"viet": "Nó đố kỵ với thành công của Tom.", "eng": "He was jealous of Tom's success."}, {"viet": "Trước cảnh tượng huy hoàng vĩ đại ông ấy dường như bị choáng ngợp hoàn toàn.", "eng": "He was overawed by rather grand surroundings."}, {"viet": "Nó nghèo quá phải xin tiền của khách qua đường.", "eng": "He was so poor he had to beg money from passers-by."}, {"viet": "Anh ta bị hất ngã khi anh ta chạy về phía gôn.", "eng": "He was up-ended as he ran towards the goal."}, {"viet": "Anh ta đá mạnh quả bóng vào phía sau lưới.", "eng": "He whammed the ball into the back of the net."}, {"viet": "Anh ấy làm cho một công ty điện lực.", "eng": "He works for an electrical company."}, {"viet": "Biển động báo điềm không hay cho những chiếc thuyền nhỏ.", "eng": "Heavy seas that boded trouble for small Craft."}, {"viet": "Tính nết cáu kỉnh của cô ấy dễ giải thích, cô ấy bị đau dầu suốt ngày.", "eng": "Her bad temper is easily accountable, she has had a headache all day."}, {"viet": "Những lời kêu gọi giúp đỡ của cô ta nhận được phần nào sự đáp ứng.", "eng": "Her cries for help met with some response."}, {"viet": "Nét mặt bà ta lúc nào cũng có vẻ nghiêm nghị.", "eng": "Her face wore a grim, set look."}, {"viet": "Tim cô ta đang đập rất nhanh.", "eng": "Her heart was pumping very fast."}, {"viet": "Cuộc đời của cô ta bây giờ đang đi xuống dốc.", "eng": "Her life is now on the skids."}, {"viet": "Ý kiến của bà ta có giá trị vì kinh nghiệm của bà ta.", "eng": "Her opinion counts because of her experience."}, {"viet": "Nhận xét của cô ấy như thể roi quất vào mông bò: anh ta giận điên lên với cô ấy.", "eng": "Her remarks were like a red rag to a bull: he was furious with her."}, {"viet": "Thành công của cô ta với tư cách một nữ diễn viên nay đã là chắc chắn.", "eng": "Her success as an actress was now assured."}, {"viet": "Rượu đây để hai hàm răng anh khỏi đánh vào nhau nữa.", "eng": "Here's some antifreeze to stop your teeth from chattering."}, {"viet": "Những khả năng của anh ta không đáp ứng với công việc.", "eng": "His abilities are incommensurate to the task."}, {"viet": "Hành vi của anh ta tại bữa tiệc thực là quá trớn.", "eng": "His behaviour at the party was really out-of-bounds."}, {"viet": "Bộ sưu tập tranh của ông ta gây ấn tượng rất sâu sắc.", "eng": "His collection of paintings is most impressive."}, {"viet": "Đứa con trai đầu của ông ta đang học Đại học.", "eng": "His eldest boy is at university."}, {"viet": "Những ngón tay của anh ta lướt nhẹ trên các phím pianô.", "eng": "His fingers swept the keys of the piano."}, {"viet": "Ý tưởng của hắn thật quá lỗi thời!", "eng": "His ideas are positively antediluvian!"}, {"viet": "Cuộc đời ông kéo dài gần như toàn bộ thế kỉ 19.", "eng": "His life spanned almost the whole of the 19th century."}, {"viet": "Những tiểu thuyết của ông ta rất xoàng.", "eng": "His novels are very second-rate."}, {"viet": "Sự nhanh trí của nó đã biến đâu mất.", "eng": "His presence of mind deserted him."}, {"viet": "Tính nhút nhát đã làm việc nói trước công chúng là một cực hình đối với anh ta.", "eng": "His shyness made public speaking a torment to him."}, {"viet": "Đứa con gái lớn 10 tuổi của anh ta hết sức mê trở thành diễn viên.", "eng": "His ten years old daughter is completely stage-struck."}, {"viet": "Tác phẩm của ông ta được các nhà phê bình đánh giá cao.", "eng": "His work is highly thought of by the critics."}, {"viet": "Anh yêu, anh hãy sửa bồn tắm nhé?", "eng": "Honey, could you fix a bath?"}, {"viet": "Gia đình ông đều khỏe cả chứ?", "eng": "How are all of your family?"}, {"viet": "Anh ấy tỏ vẻ thế nào với cái tin về cái chết của cô ấy?", "eng": "How did he take the news of her death?"}, {"viet": "Chị muốn chi trả thế nào?", "eng": "How do you want to pay?"}, {"viet": "Mùa đông ở Sydney kéo dài trong bao lâu?", "eng": "How long is winter in Sydney?"}, {"viet": "Có bao nhiêu người vậy? Có rất nhiều người.", "eng": "How many people were there? There were scores of them."}, {"viet": "Chúng tôi còn phải đợi món xúp của chúng tôi thêm bao lâu nữa?", "eng": "How much longer are we going to wait for our soup?"}, {"viet": "Quý vị muốn món thịt bò nướng như thế nào ạ?", "eng": "How would you like your steaks cooked?"}, {"viet": "Tôi sẽ mua một chiếc ô tô mới nếu tôi có đủ tiền.", "eng": "I'd buy a new car if I had enough money."}, {"viet": "Tôi rất muốn đến, nhưng tôi phải làm việc.", "eng": "I'd love to come, only I have to work."}, {"viet": "Tôi sẽ trả ông 10 bảng Anh cho chiếc xe đạp cũ của ông.", "eng": "I'll give you a tenner for your old bike."}, {"viet": "Tôi sẽ cử người đến lau chùi và tẩy uế nó.", "eng": "I'll send someone to clean and disinfect it."}, {"viet": "Tôi e là đội bóng của chúng ta chơi hơi tệ đấy.", "eng": "I'm afraid our team's doing rather badly."}, {"viet": "Tôi rất mừng là không phải ra ngoài trong đêm mưa gió như thế này.", "eng": "I'm glad I don't have to go out on such a dirty night."}, {"viet": "Tôi lại đến chậm rồi! Này, anh còn hơn chán, ông chủ còn chưa đến kia mà!", "eng": "I'm late again! Well, you're in good company, the boss isn't here yet!"}, {"viet": "Tôi lạc quan đội của chúng tôi sẽ thắng.", "eng": "I'm optimistic that we'll win the game."}, {"viet": "Xin lỗi làm phiền cậu nhưng cậu có thể gửi giùm lá thư này hộ mình được không?", "eng": "I'm sorry to trouble you but could you help me with this letter?"}, {"viet": "Tôi được lệnh nghiêm ngặt không cho bất cứ người lạ nào vào.", "eng": "I'm under strict orders not to let any strangers in."}, {"viet": "Tôi đã phải nghỉ việc nhiều tuần nay vì cái chân gãy.", "eng": "I've been out of action for several weeks with a broken leg."}, {"viet": "Tôi bồn chồn lo lắng về kì thi lái xe của tôi.", "eng": "I've got the jitters about my driving test."}, {"viet": "Trước đây tôi chưa bao giờ thử chơi lướt ván, nhưng tôi cũng thích làm một keo xem sao.", "eng": "I've never tried water-skiing before, but I'd love to have a bash at it."}, {"viet": "Tôi thật sự nghĩ là họ có cùng tông màu da ấy.", "eng": "I actually thought they had the same skin tone."}, {"viet": "Tôi phải nói là tôi không đồng ý với anh về điểm đó.", "eng": "I am bound to say I disagree with you on this point."}, {"viet": "Tôi có trách nhiệm hoàn toàn về sự lầm lẫn đó.", "eng": "I am wholly responsible for the confusion."}, {"viet": "Tôi tin là tất cả các vị đều đã có dịp đọc biên bản của cuộc họp lần trước.", "eng": "I believe you've all had a chance to read the minutes of our last meeting."}, {"viet": "Tôi không thể đến dự cơm tối thứ ba, tôi bận việc khác.", "eng": "I can't come to dinner on Tuesday, I'm otherwise engaged."}, {"viet": "Tôi không thể gặp anh ta bây giờ được, không tiện.", "eng": "I can't see him now, it's not convenient."}, {"viet": "Tôi không thể tìm ra bức thư mà anh nói đến.", "eng": "I can not trace the letter to which you refer."}, {"viet": "Tôi không thể chơi nổi bóng quần một tuần hai lần.", "eng": "I can't play squash twice a week."}, {"viet": "Tôi có thể nghe thấy nhạc đang chơi trên đài phát thanh.", "eng": "I could hear music playing on the radio."}, {"viet": "Tôi muốn món thịt bò của tôi chín vừa.", "eng": "I'd like my steak medium."}, {"viet": "Hôm qua tôi chẳng được tấm thiếp nào nhưng hôm nay được vài chiếc.", "eng": "I didn't get any cards yesterday but today there were a few."}, {"viet": "Tôi không muốn nghe thêm những ý kiến nhố nhăng của cậu nữa đâu.", "eng": "I don't care to hear any more of your airy-fairy ideas."}, {"viet": "Tôi không ưa cái kiểu lên lớp của cô ta khi giải thích mọi thứ.", "eng": "I don't like her didactic way of explaining everything."}, {"viet": "Tôi không hiểu, anh có thể giải thích được không?", "eng": "I don't understand, could you please elucidate?"}, {"viet": "Tao cóc cần quan tâm tới những điều mày nghĩ.", "eng": "I don't give a hoot what you think."}, {"viet": "Tôi đọc sách hoặc xem tivi.", "eng": "I either read or watch TV."}, {"viet": "Tôi cảm thấy lẻ loi một khi không dắt theo con chó của tôi.", "eng": "I feel very lonely without my dog."}, {"viet": "Tôi bỏ quên chìa khóa ở trong phòng của tôi.", "eng": "I forgot my key in my room."}, {"viet": "Trên đường đi tôi bị thủng lốp nên đến muộn.", "eng": "I got a puncture on the way and arrived late."}, {"viet": "Tôi đã hàn chiếc rađiô của anh, nhưng không phục hồi được.", "eng": "I had a tinker at your radio, but I can't mend it."}, {"viet": "Tôi đưa đống quần áo bẩn để giặt là.", "eng": "I handed over the bundle of dirty clothes to be laundered."}, {"viet": "Tôi đã kêu với ông nghị sĩ quốc hội của tôi và thúc giục người cùng ý kiến cũng làm như vậy.", "eng": "I have complained to my MP, and urge all like-minded people to do the same."}, {"viet": "Tôi đã có đọc được hồ sơ về ngân hàng của tôi qua bộ nhớ của máy tính.", "eng": "I have read-only access to my bank files."}, {"viet": "Tôi không có miếng ăn gì suốt sáng nay.", "eng": "I haven't had a bite to eat all morning."}, {"viet": "Tôi nghe tin ông ấy qua đời với sự thương tiếc sâu xa.", "eng": "I heard of his death with profound regret."}, {"viet": "Tôi thành tâm mong anh thành công.", "eng": "I hope with all my heart that you succeed."}, {"viet": "Tôi để một cuốn từ điển sát bên tôi khi chơi ô chữ.", "eng": "I keep a dictionary by me when I'm doing crosswords."}, {"viet": "Tôi đã nhắn lại để chắc chắn tiếp xúc được với cô ta.", "eng": "I left a message so as to be sure of contacting her."}, {"viet": "Tôi sống ở nông thôn khi tôi còn nhỏ.", "eng": "I live in the country when I was small."}, {"viet": "Cuối cùng tôi sẽ đi New York.", "eng": "I'll go to New York eventually."}, {"viet": "Tôi sẽ thử uống vài ly xem nào.", "eng": "I'll try to get some in."}, {"viet": "Hôm nay tôi cảm thấy dễ chịu hơn nhiều.", "eng": "I'm feeling a lot better today."}, {"viet": "Con có thể không kịp giờ.", "eng": "I'm not going to make it on time."}, {"viet": "Tôi đang học đàn piano một lần một tuần.", "eng": "I'm taking piano lessons once a week."}, {"viet": "Anh nhớ tới em mang đến cho anh những tách trà vào buổi sáng.", "eng": "I miss you bringing me cups of tea in the mornings."}, {"viet": "Tôi cần ai giúp tôi một tí để dời đi mấy quyển sách này.", "eng": "I need a little help to move these books."}, {"viet": "Tôi tính vụ đụng đó vào số những kinh nghiệm ghê gớm nhất trong đời tôi.", "eng": "I number that crash among the most frightening experiences of my life."}, {"viet": "Tôi thích phong cảnh hơn là vẽ tĩnh vật.", "eng": "I prefer landscape to still life."}, {"viet": "Em thật sự không thích nấu nướng lắm đâu, nhưng cả nhà phải ăn.", "eng": "I really don't feel much like cooking, but the family must eat."}, {"viet": "Tôi phản đối hắn về sự thô lỗ của hắn.", "eng": "I remonstrated with him about his rudeness."}, {"viet": "Tôi thu hết can đảm của mình để đi đến nha sĩ.", "eng": "I screwed up my courage and went to the dentist."}, {"viet": "Lẽ ra tôi nên mang theo dù.", "eng": "I should have brought my umbrella."}, {"viet": "Tôi đứng giữa một biển đồng lúa.", "eng": "I stood amid a sea corn."}, {"viet": "Tôi nghĩ là anh ta sẽ đến, nhưng tôi không hoàn toàn tin chắc.", "eng": "I think he's coming, but I'm not quite sure."}, {"viet": "Tôi nghĩ rượu uýt-xki Xcốt có xuất xứ từ Xcốt-len.", "eng": "I think Scotch whisky is from Scotland."}, {"viet": "Tôi nghĩ là tôi đã nhận ra cái giọng nói êm tai của cô rồi đó.", "eng": "I thought I recognized your dulcet tones."}, {"viet": "Tôi tìm cách để cô ấy nói về việc ly hôn của mình nhưng cô không chịu nói gì cả.", "eng": "I tried to get her to talk about her divorce but she wasn't having any."}, {"viet": "Tớ phải lưu những báo cáo này nữa.", "eng": "I've got to file these reports."}, {"viet": "Tôi muốn đổi một vài đô la Mỹ lấy nhân dân tệ Trung Quốc.", "eng": "I want to exchange some US dollars for Chinese yuan."}, {"viet": "Tôi đã háo hức chuẩn bị đủ mọi thứ để đi nghỉ, thế mà bây giờ lại bị huỷ bỏ.", "eng": "I was all geared up to go on holiday, and now it's been cancelled."}, {"viet": "Tôi bị một hòn đá rơi trúng người.", "eng": "I was hit by a falling stone."}, {"viet": "Tôi buồn nôn khi thấy xác chết.", "eng": "I was sickened at the sight of the dead body."}, {"viet": "Tôi rửa sạch về thương bằng thuốc khử trùng.", "eng": "I washed out the wound with antiseptic."}, {"viet": "Tôi ước gì tôi có thể may mắn như bạn.", "eng": "I wish I could be as lucky as you are."}, {"viet": "Tôi không biết họ có bán đồ lưu niệm hay không.", "eng": "I wonder if they sell souvenirs."}, {"viet": "Tôi muốn dùng trứng chiên, bánh mì nướng và nước cà chua.", "eng": "I would like fried eggs, toast and tomato juice."}, {"viet": "Tôi sẽ không nhờ tới sự giúp đỡ của anh ta, anh ta là người không đáng tin tưởng.", "eng": "I wouldn't ask him to help, he's very unreliable."}, {"viet": "Nếu có chuyện gì xảy ra với chiếc ô tô, tôi sẽ quy trách nhiệm cho anh.", "eng": "If anything happens to the car, I will hold you accountable."}, {"viet": "Nếu tôi giặt sạch bộ đồ thể thao của anh bây giờ thì sáng mai sẽ khô.", "eng": "If I wash your sports kit out now, it'll be dry by tomorrow morning."}, {"viet": "Nếu cái váy lớn quá, chúng ta có thể thu hẹp vòng eo.", "eng": "If the shirt is too big, we can take in the waist."}, {"viet": "Nếu anh đang tìm một tấm ảnh của Alice, thì ở đây anh sẽ tìm thấy vài tấm.", "eng": "If you're looking for a photograph of Alice you'll find several in here."}, {"viet": "Nếu anh không biết câu trả lời thì hãy hỏi ai đó.", "eng": "If you don't know the answer, ask somebody."}, {"viet": "Nếu ông bà cần bất cứ sự giúp đỡ nào, vui lòng quay số 9 hoặc ấn cái nút ở đằng kia.", "eng": "If you need any help, please dial 9, or press the button over there."}, {"viet": "Nếu bạn sẽ đi nghỉ vào ngày bầu cử thì bạn có thể xin gởi phiếu bầu qua bưu điện.", "eng": "If you will be on holiday on election day, you may apply for a postal vote."}, {"viet": "Trong thời đại ánh sáng, sự tàn bạo như vậy là không thể tha thứ được.", "eng": "In an age of enlightenment such cruelty is unforgivable."}, {"viet": "Trong câu George became ill, động từ became là hệ từ.", "eng": "In George became ill, the verb became is a copula."}, {"viet": "Nhìn nghiêng, cô ta trông rất giống mẹ cô.", "eng": "In profile she is very like her mother."}, {"viet": "Rút cục họ lấy nhau và có nhiều con.", "eng": "In the fullness of time they married and had children."}, {"viet": "Cùng lúc, con người thấy các mùa cứ thế tiếp nối theo nhau theo một trật tự đều đặn.", "eng": "In time, man saw that there were seasons which followed one another in regular."}, {"viet": "Thay vì vậy chúng được chạy bằng điện.", "eng": "Instead they are run by electricity."}, {"viet": "Bệnh sốt rét còn thường thấy trong dân chúng ở đây không?", "eng": "Is malaria still prevalent among the population here?"}, {"viet": "Có cái gì tôi có thể giúp được ở đây không?", "eng": "Is there anything I can usefully do here?"}, {"viet": "Đó là một triển vọng ảm đạm cho ngành công nghiệp than khi số hầm lò đóng cửa tăng lên.", "eng": "It's a bleak look-out for the coal industry as the number of pit closures increases."}, {"viet": "Kết luận hiển nhiên bằng suy luận là cô ta phạm tội.", "eng": "It's an obvious deduction that she is guilty."}, {"viet": "Cấm bán thuốc lá cho trẻ em dưới 16 tuổi.", "eng": "It's forbidden to sell tobacco to children under 16."}, {"viet": "Đây là tuần đầu tôi ở đây nên tôi chưa quen thuộc với hệ thống.", "eng": "It's my first week here so I'm not yet au fait with the system."}, {"viet": "Chỉ có trong tiểu thuyết, tác giả mới tự do viết lên những điều mình tưởng tượng và sáng tạo ra những hình ảnh tuyệt đẹp mà thôi.", "eng": "It's only in novels that an author is free to use his imagitation and create beautiful images."}, {"viet": "Đã đến lúc phải thể hiện tư tưởng của chúng ta thành hành động.", "eng": "It's time to translate our ideas into action."}, {"viet": "Anh nên lịch sự trong mọi hoàn cảnh.", "eng": "It behoves you to be courteous at all times."}, {"viet": "Giúp một người mù đi qua đường là một nghĩa cử.", "eng": "It is a kind act to help a blind man across the street."}, {"viet": "Anh không rèn cặp cho sinh viên đi thi thì thật là thiếu trách nhiệm.", "eng": "It is irresponsible of you not to prepare students for their exams."}, {"viet": "Tiên đoán tương lai một cách chính xác quả là không thể được.", "eng": "It is virtually impossible to predict the future accurately."}, {"viet": "Ở London mưa ít hơn là ở Manchester.", "eng": "It rains less in London than in Manchester."}, {"viet": "Hôm nay trời đang mưa tầm tã.", "eng": "It's raining cats and dogs today."}, {"viet": "Tôi nghe như thể có tiếng vòi nước chảy đâu đây.", "eng": "It sounds to me as if there's a tap running somewhere."}, {"viet": "Khi nhà trường đóng cửa, đó là một ngày buồn đối với tất cả chúng tôi.", "eng": "It was a sad day for us all when the school closed down."}, {"viet": "Anh không mời cô ấy uống nước thì thật là không mến khách.", "eng": "It was inhospitable of you not to offer her a drink."}, {"viet": "Việc tôi không cảm ơn sự giúp đỡ của anh thật là khiếm nhã.", "eng": "It was ungracious of me not to acknowledge your help."}, {"viet": "Chữa lại xe sẽ quá đắt.", "eng": "It would be too costly to repair the car."}, {"viet": "Jim là người có nghị lực mạnh mẽ, anh ta thích hành động hơn là chỉ nói suông.", "eng": "Jim is a rough-and-ready character, he'd rather act than talk things over."}, {"viet": "Ngay trước khi vị khách nước ngoài đến, bạn cần phải đặt trước một phòng ở khách sạn cho ông ấy.", "eng": "Just before the foreign guest arrives, it's necessary for you to reserve a room at the hotel for him."}, {"viet": "Cuối cùng giữa bạn bè với nhau, anh ta được tự do nói lên ý nghĩ của mình.", "eng": "Last, among friends, he was free to speak his mind."}, {"viet": "Để tôi mở cửa cho ông.", "eng": "Let me open the door for you."}, {"viet": "Nhìn xem, mặt trời đang chiếu sáng, bầu trời quang đãng, không có gió chút nào cả.", "eng": "Look, the sun is shining, the sky is clear, there's no wind at all."}, {"viet": "Nhiều người tin tưởng rằng giáo dục tư khuyến khích phát triển giới ưu tú.", "eng": "Many people believe that private education encourages élitism."}, {"viet": "Mary nhiều tuổi hơn tôi nhưng các chị gái khác của tôi đều trẻ hơn.", "eng": "Mary is older than me but my other sisters are younger."}, {"viet": "Tôi có thể nói chuyện với ông Nelson Owen ở phòng số 1228 được không?", "eng": "May I speak to Mr. Nelson Owen of Room No. 1228, please?"}, {"viet": "Hơn nữa, giá có thể giảm hơn nữa nếu ông đặt một số lượng lớn như vậy?", "eng": "Moreover, the price can be cut further if you order such a large amount?"}, {"viet": "Ông Lý là giáo sư đại học, ông ấy là một nhà nghiên cứu có uy tín về triết học Trung Quốc.", "eng": "Mr. Lee is a professor, he is an authority on Chinese philosophy."}, {"viet": "Ông chủ tôi không cho phép tôi dùng điện thoại.", "eng": "My boss doesn't allow me to use the telephone."}, {"viet": "Bộ phim tôi ưa thích có Marilyn Monroe đóng vai chính.", "eng": "My favourite film stars Marilyn Monroe."}, {"viet": "Mẹ tôi nói: “ Ngủ là phương thuốc tốt nhất ”.", "eng": "My mother says, Sleeping is the best medicine."}, {"viet": "Cái quần của tôi chỉ không tụt xuống khi đeo thắt lưng.", "eng": "My trousers only stay up if I wear a belt."}, {"viet": "Những khu chung cư mới mọc lên khắp nơi.", "eng": "New housing estates spawning everywhere."}, {"viet": "Không, tôi nghĩ anh ấy chỉ biểu diễn làm thú tiêu khiển thôi, nhưng người ta nói là anh ấy rất giỏi.", "eng": "No, I think he just does it as a hobby, but they say he is very good."}, {"viet": "Anh ta vừa mới thấy tôi đã đi ra ngay.", "eng": "No sooner had he seen me than he went out."}, {"viet": "Lúc này thi cử xong rồi, tôi đang được hưởng tự do của tôi.", "eng": "Now the exams are over, I'm savouring my freedom."}, {"viet": "Ồ, tôi chẳng tin điều đó.", "eng": "Oh, I don't know about that."}, {"viet": "Những kỉ niệm xưa thức dậy trong tôi khi tôi nhìn tấm ảnh.", "eng": "Old memories awoke in me when I saw the picture."}, {"viet": "Người ta có thể nhận thấy thoáng mùi thơm của chanh.", "eng": "One can faintly discern the flavour of lemon."}, {"viet": "Người ta nghi rằng ông ấy đã bị thải hồi vì lý do chính trị.", "eng": "One suspects he was dismissed for political reasons."}, {"viet": "Quyết định của chúng tôi phụ thuộc vào sự đồng ý của anh.", "eng": "Our decision is subject to your approval."}, {"viet": "Ông giám đốc của chúng tôi đã tránh né vấn đề tiền thưởng trong nhiều tháng.", "eng": "Our manager has been fudging the issue of bonus payments for months."}, {"viet": "Đội bóng của chúng tôi thất bại thảm hại hôm thứ bảy.", "eng": "Our team took a real beating on saturday."}, {"viet": "Nghị viện đã thảo luận điểm sửa đổi vào dự luật.", "eng": "Parliaments debated several amendments to the bill."}, {"viet": "Không nên xem con người là phần phụ trong hệ thống kinh tế.", "eng": "People should not be regarded as subservient to the economic system."}, {"viet": "Ông vui lòng đặt giày bên ngoài cửa phòng.", "eng": "Please place your shoes outside your door."}, {"viet": "Sự trừng phạt đối với một tên trộm là chặt một tay.", "eng": "Punishment for a thief was amputation of a hand."}, {"viet": "Các nhà khoa học mò mẫm tìm các bí mật của nguyên tử.", "eng": "Scientists groping blindly after the secrets of the atom."}, {"viet": "Chúng ta sẽ chấp nhận chúng như đã được viết chứ?", "eng": "Shall we accept them as written?"}, {"viet": "Nó sợ bóng tối, và nó không thích rừng.", "eng": "She's afraid of the dark, and she doesn't like forests."}, {"viet": "Cô ta còn thông minh hơn cả chị của cô ta nữa.", "eng": "She's even more intelligent than her sister."}, {"viet": "Cô ta chỉ thích giành nói huyên thuyên.", "eng": "She's much too fond of the sound of her own voice."}, {"viet": "Xét về trí thông minh thì cô ta ngang với ông anh của cô ta.", "eng": "She's the equal of her brother as far as intelligence is concerned."}, {"viet": "Chị ấy luôn luôn có những vật linh tinh trong túi xách.", "eng": "She always has a lot of bits and pieces in her bag."}, {"viet": "Cô ấy được thứ nhất trong cuộc thi vẽ.", "eng": "She came first in a drawing competition."}, {"viet": "Cô ta không tài nào nói được cho anh ấy nghe cái tin buồn thảm đó.", "eng": "She could not bring herself to tell him the tragic news."}, {"viet": "Khi lấy chồng cô ta vẫn không bỏ việc.", "eng": "She didn't give up her job when she got married."}, {"viet": "Cô ta đi ngay khi nghe tin anh ấy đến.", "eng": "She exited pretty quickly when she heard him arriving."}, {"viet": "Cô ta có một lối diễn xuất tự chủ thật tuyệt vời trong vai Ophelia.", "eng": "She gave a beautifully understated performance as Ophelia."}, {"viet": "Cô ta nuốt nước mắt và cố mỉm cười.", "eng": "She gulped back her tears and tried to smile."}, {"viet": "Cô ấy có màu da sẫm.", "eng": "She has a dark skin color."}, {"viet": "Bà ấy đã tuyệt giao với công ty.", "eng": "She has severed her connection with the firm."}, {"viet": "Cô ấy là người đàn bà rất có văn hoá.", "eng": "She is a woman of considerable culture."}, {"viet": "Bà ta cố gắng không mệt mỏi để giúp đỡ những người không nhà cửa.", "eng": "She is untiring in her efforts to help the homeless."}, {"viet": "Cô ấy thích mọi thứ đâu vào đó trước khi cô bắt đầu công việc.", "eng": "She likes everything to be in place before she starts work."}, {"viet": "Cô ta bắt anh chàng rửa bát để phạt vì tội đã quên ngày sinh nhật của cô ta.", "eng": "She made him do the washing up as a penance for forgetting her birthday."}, {"viet": "Cô ấy đề nghị giúp đỡ mẹ việc mua sắm.", "eng": "She offered to help her mother with the shopping."}, {"viet": "Cô ấy trao giải cho đội thắng.", "eng": "She presented the trophy to the winning team."}, {"viet": "Cô ấy giống mẹ cố ấy ở cách cô ấy vung tay khi nói.", "eng": "She resembles her mother in the way she moves her hands when she talks."}, {"viet": "Cô ta bị nhiễm trùng tai.", "eng": "She's got an ear infection."}, {"viet": "Cô ta nói điều đó một cách có chủ tâm để khiêu khích chúng tôi.", "eng": "She said it deliberately to provoke me."}, {"viet": "Nhiều năm ròng chị ấy gửi tiền giúp đỡ người nghèo.", "eng": "She sent money year after year to help the poor."}, {"viet": "Chẳng bao lâu, cô ấy đã qui phục được cả lớp học.", "eng": "She soon had the class eating out of her hand."}, {"viet": "Bà ấy tóm tắt tình hình trong vài câu súc tích.", "eng": "She summed up the situation in a few choice phrases."}, {"viet": "Cô ấy mang chiếc áo trở lại cửa hàng và đổi lấy cái khác.", "eng": "She took the dress back to the shop and changed it."}, {"viet": "Cô ấy bỏ đi không nhìn về phía tôi.", "eng": "She walked off without a glance in my direction."}, {"viet": "Chị ấy bực mình với thằng bé vì nó quá cẩu thả.", "eng": "She was annoyed with the boy for being so careless."}, {"viet": "Cô ta đã dứt khoát bị cấm không được tham dự.", "eng": "She was explicitly forbidden to attend."}, {"viet": "Bà ta tỏ ra nhân từ đối với các tù nhân.", "eng": "She was merciful to the prisoners."}, {"viet": "Cô ta cười trước những trò hài hước của lũ khỉ.", "eng": "She was smiling at the antics of the monkeys."}, {"viet": "Bà ta bị bỏ phiếu loại khỏi chức vụ.", "eng": "She was voted out of office."}, {"viet": "Cô ta sẽ cố gắng phá kỷ lục thế giới.", "eng": "She will attempt to beat the world record."}, {"viet": "Bà ấy sẽ rất vui khi được gặp cả hai ông bà đấy.", "eng": "She would be very happy to see you both."}, {"viet": "Chứng tỏ một trí nhớ kỳ lạ về những ấn tượng thời thơ ấu.", "eng": "Show an amazing retention of childhood impressions."}, {"viet": "Từ khi tôi đánh rơi cái đồng hồ xuống sàn nhà, nó chạy loạn xà ngầu.", "eng": "Since I dropped it on the floor my watch has gone completely haywire."}, {"viet": "Làm việc cực nhọc trong vườn hàng giờ.", "eng": "Slaving away in the garden for hours."}, {"viet": "Những mảnh vải vụn nằm rải rác khắp sàn nhà.", "eng": "Snips of material scattered over the floor."}, {"viet": "Xã hội có trách nhiệm tập thể bảo đảm cho người già phải được chăm sóc.", "eng": "Society has a collective responsibility to ensure the elderly are cared for."}, {"viet": "Có thể cần sớm tăng thêm giờ làm việc lên một chút ít.", "eng": "Some increase in working hours may soon be needed."}, {"viet": "Một số người nghĩ rằng ngọc lam có những đặc tính về mặt tinh thần.", "eng": "Some people think turquoise has spiritual qualities."}, {"viet": "Người nào có chuyên ngành về điện tử.", "eng": "Someone with a background in electronics."}, {"viet": "Nói tiếng Anh với một giọng ngoại quốc.", "eng": "Speak English with a foreign accent."}, {"viet": "Anh hãy mạnh dạn lên một chút-Đừng có nhu nhược như vậy!", "eng": "Stand up for yourself a bit-don't be such a doormat!"}, {"viet": "Đừng có giở trò nghịch những bao diêm đó kẻo mày lại làm cháy nhà bây giờ.", "eng": "Stop buggering about with those matches or you'll set the house on fire."}, {"viet": "Những chuỗi đèn lồng tạo thành vòng giữa các cành cây.", "eng": "Strings of lanterns looped between the branches of the trees."}, {"viet": "Một công việc tinh vi như thế đòi hỏi phải có một bàn tay vững vàng và một con mắt chăm chú.", "eng": "Such fine work requires a steady hand and a steady eye."}, {"viet": "Quyền lực tối cao thuộc về Tổng thống.", "eng": "Supreme authority resides in the President."}, {"viet": "Có quan niệm thực tế đối với vấn đề đó.", "eng": "Take a realistic view of the problem."}, {"viet": "Thuế là một gánh nặng đối với tất cả chúng ta.", "eng": "Taxation bears heavily on us all."}, {"viet": "Những người thuê nhà được cung cấp nơi ở mới trong thời gian sửa chữa tòa nhà.", "eng": "Tenants rehoused during building repairs."}, {"viet": "Tán gẫu bấy nhiêu đó đủ rồi-trở lại làm việc thôi.", "eng": "That's enough chat-get back to work."}, {"viet": "Đứa trẻ đó đã trở thành người lãnh đạo tài ba.", "eng": "That child was to become a great leader."}, {"viet": "Đúng như vậy đấy, anh đừng có mà cãi lại tôi.", "eng": "That is true, and don't you dare contradict."}, {"viet": "Cái đó gây một ấn tượng khác tới các vật.", "eng": "That puts a different complexion on things."}, {"viet": "Thầy giáo đó quá nhu nhược với lớp học, không còn điều khiển được học sinh nữa.", "eng": "That teacher is too soft with his class, they're out of his control."}, {"viet": "Không có tin tức về tội ác.", "eng": "The absence of information about the crime."}, {"viet": "Những diễn viên bị khán giả la ó đuổi xuống sân khấu.", "eng": "The actors were booed off the stage."}, {"viet": "Cuốn sách thứ hai có thể chọn để học thi là'Chiến tranh và Hoà bình'.", "eng": "The alternative book to study for the examination is'War and Peace'."}, {"viet": "Quỹ hảo tâm đã hoàn thành mục tiêu 20.000 bảng Anh của nó.", "eng": "The appeal fund has reached its target of £ 20,000."}, {"viet": "Nghệ thuật viết thư đang mau chóng mất đi.", "eng": "The art of letter-writing is fast disappearing."}, {"viet": "Tác giả đã trình bày tóm tắt nội dung cuốn sách của mình.", "eng": "The author gave a brief view of his book."}, {"viet": "Thời tiết xấu chỉ làm tăng thêm khó khăn của chúng ta.", "eng": "The bad weather only added to our difficulties."}, {"viet": "Loại kiến trúc baroc thì rất phong phú về cách trang trí.", "eng": "The baroque style is rich in ornament."}, {"viet": "Việc để lại các bức tranh cho một phòng trưng bày.", "eng": "The bequest of one's paintings to a gallery."}, {"viet": "Công ty dứt khoát phải chịu trách nhiệm về tai hoạ này.", "eng": "The blame for the disaster has been laid firmly at the company's door."}, {"viet": "Quyển sách không cho biết là anh ta sinh ở đâu.", "eng": "The book doesn't say where he was born."}, {"viet": "Chiếc ti vi đó đã phát liên tục trong chín giây những lời phát biểu ngắn ngủn làm bực mình.", "eng": "The box has been spitting forth maddening nine-second sound bites."}, {"viet": "Sự thử nồng độ rượu cho thấy anh ta uống quá giới hạn cho phép.", "eng": "The breath test showed him to be over the limit."}, {"viet": "Tên trộm lọt vào nhà qua cửa sổ phòng ngủ.", "eng": "The burglar got into the house through the bedroom window."}, {"viet": "Bài diễn văn của ứng cử viên gây nên những phản ứng mạnh mẽ ở mọi phía.", "eng": "The candidate's speech aroused strong feeling on all sides."}, {"viet": "Chiếc xe ôtô lao xuống vách đá.", "eng": "The car plunged over the cliff."}, {"viet": "Các vai diễn cúi chào khi khán giả vỗ tay.", "eng": "The cast bowed as the audience applauded."}, {"viet": "Vị chủ tịch đưa ra những lí do vững chắc cho việc từ chức của ông ta.", "eng": "The chairman produced cogent reasons for his resignation."}, {"viet": "Tiếng khóc dai dẳng của đứa bé làm tôi điên đầu.", "eng": "The child's continual crying drove me to distraction."}, {"viet": "Mặt lũ trẻ trong ảnh mờ quá.", "eng": "The children's faces were badly out of focus in the photograph."}, {"viet": "Bọn trẻ phản đối khi chúng bị phạt một cách bất công.", "eng": "The children protested when they were punished unfairly."}, {"viet": "Dây cung AC đối diện cung ABC.", "eng": "The chord AC subtends the arc ABC."}, {"viet": "Vách đá dựng đứng ( xuống mặt biển ).", "eng": "The cliff drops sharply ( to the sea )."}, {"viet": "Đồng tiền rơi xuống và lăn đi.", "eng": "The coin fell and rolled away."}, {"viet": "Ủy ban đó đang hoạt động để cho các tù nhân được phóng thích.", "eng": "The committee is working to get the prisoners freed."}, {"viet": "Công ty phải làm điều gì đó nhằm khắc phục việc phục vụ kém cỏi.", "eng": "The company ought to do something about the poor service."}, {"viet": "Ứng viên đảng Bảo thủ đó bị cật vấn liên tục.", "eng": "The conservative candidate was heckled continuously."}, {"viet": "Phí tổn cho vụ xét xử đã ngốn hết tiền tiết kiệm của họ.", "eng": "The cost of the trial swallowed up all their savings."}, {"viet": "Cuộc tranh luận đột nhiên chuyển sang hướng khác.", "eng": "The course of the argument suddenly changed."}, {"viet": "Sự phê bình về những điều ngu xuẩn của bộ máy quan liêu và sự quá câu nệ bằng cấp trong việc tuyển dụng.", "eng": "The critique of bureaucratic follies and of credentialism."}, {"viet": "Những cái móc rèm chạy dọc một đường rãnh trong thanh ngang treo rèm.", "eng": "The curtain hooks run along a slot in the curtain rail."}, {"viet": "Những người phụ nữ trong gia đình các tử sĩ khóc thương họ.", "eng": "The dead soldiers were mourned by their womenfolk."}, {"viet": "Những người biểu tình ít chống cự hoặc không chống cự lại cảnh sát.", "eng": "The demonstrators offered little or no resistance to the police."}, {"viet": "Sự chênh lệch giá chỉ 10 bảng, vì vậy chúng tôi quyết định đi máy bay.", "eng": "The difference in price was only 10, so we decided to take the plane."}, {"viet": "Điểm khác biệt giữa quan niệm và sự kiện.", "eng": "The dividing line between opinion and fact."}, {"viet": "Các bác sĩ nói sự bình phục của cô ta là một điều kỳ diệu.", "eng": "The doctors said her recovery was a miracle."}, {"viet": "Những con chó đó được huấn luyện để phát hiện chỗ có chất nổ.", "eng": "The dogs were trained to detect the presence of explosives."}, {"viet": "Thuốc này không có những tác dụng phụ khó chịu.", "eng": "The drug has no undesirable side-effects."}, {"viet": "Chất thải từ nhà máy khiến cho con sông không an toàn cho việc bơi lội.", "eng": "The effluent from the factory makes the river unsafe for swimming."}, {"viet": "Động cơ phát ra tiếng ken két rồi ngưng luôn.", "eng": "The engine gave forth and grinding noise, then stopped."}, {"viet": "Trong trường hợp ông ấy chết, thì Shella sẽ thừa kế số tiền.", "eng": "The event of his death Sheila will inherit the money."}, {"viet": "Việc kinh doanh xuất khẩu thực ra là tấm màn khói che giấu các hoạt động gián điệp của hắn.", "eng": "The export business was just a smokescreen for his activities as a spy."}, {"viet": "Anh ta được hưởng thừa kế trang trại sau cái chết của ông bố.", "eng": "The farm came to him on his father's death."}, {"viet": "Những hình ngựa ở cận cảnh không cân xứng.", "eng": "The figures of the horses in the foreground are out of proportion."}, {"viet": "Ngọn lửa cháy bừng lên khi anh ta cho thêm pa-ra-fin vào.", "eng": "The fire blazed up when he added paraffin."}, {"viet": "Có lẽ những chiếc bình đất sét đầu tiên được làm khô bằng cách phơi nắng.", "eng": "The first clay vessels were probably dried in the sun."}, {"viet": "Nước ngập sâu quá không thể chạy xe ôtô qua được.", "eng": "The flood was too deep to drive through."}, {"viet": "Sự chọn lựa trước đây thiên về phía người đàn ông đã có gia đình.", "eng": "The former option favours the married man."}, {"viet": "Đồ gỗ bán được 900 pao.", "eng": "The furniture realized 900 pounds at the sale."}, {"viet": "Vị tướng đã tập trung quân của mình cho trận tấn công cuối cùng.", "eng": "The general massed his troops for a final attack."}, {"viet": "Chạy rất khó trên đường đua.", "eng": "The going was heavy at the racecourse."}, {"viet": "Chính phủ đã cấm việc sử dụng vũ khí hoá học.", "eng": "The Government has banned the use of chemical weapons."}, {"viet": "Chính phủ từ chối không thương lượng với quân nổi loạn.", "eng": "The government refuses to treat with the rebels."}, {"viet": "Con tàu lớn đi chầm chập và uy nghi vào cảng.", "eng": "The great ship sailed slowly and majestically into harbour."}, {"viet": "Người khách trọ muốn tìm một phòng hội nghị.", "eng": "The guest wants to find a conference room."}, {"viet": "Thanh tra y tế để 50% thời gian của họ đi thăm tận nhà.", "eng": "The health inspectors spend 50% of their time on domiciliary visits."}, {"viet": "Chiếc tàu chở dầu bị thủng đang tuôn dầu ra.", "eng": "The holed tanker was disgorging oil."}, {"viet": "Khách sạn ở Thụy Điển đắt tiền hơn khách sạn ở Thụy Sĩ, và khách sạn ở Thụy Sĩ cũng sạch sẽ hơn nữa.", "eng": "The hotel in Sweden was more expensive than the one in Switzerland, and the one in Switzerland was cleaner, as well."}, {"viet": "Ngôi nhà khuất sau một bức tường.", "eng": "The house was out of sight behind a wall."}, {"viet": "Những di dân thích ứng dễ dàng và nhanh chóng.", "eng": "The immigrants assimilated easily and quickly."}, {"viet": "Những người bị thương được đưa đi bằng cáng.", "eng": "The injured were carried away on stretchers."}, {"viet": "Những ngón tay thép của máy tỉa hạt bông làm công việc lấy hạt nhanh hơn nhiều.", "eng": "The iron fingers of the gin do the work much faster."}, {"viet": "Quan toà đề xuất ý kiến với toà án.", "eng": "The judge made recommendation to the court."}, {"viet": "Lời yêu cầu của nhà vua có giá trị như một mệnh lệnh.", "eng": "The Kings'request was tantamount to a command."}, {"viet": "Những tàn tích cuối cùng của chế độ thực dân cũ.", "eng": "The last vestiges of the old colonial regime."}, {"viet": "Vị diễn giả đang nói về chính trị nhưng lại nói lạc đề sang tôn giáo vì một câu hỏi từ phía thính giả.", "eng": "The lecturer was discussing politics but got sidetracked by a question from the audience into talking about religion."}, {"viet": "Đèn tắt cả và người ta nghĩ tất cả đã ngủ rồi.", "eng": "The lights were out and all were thought to be abed."}, {"viet": "Chiếc xe tải đã để rơi hàng chất trên xe.", "eng": "The lorry has shed its load."}, {"viet": "Vấn đề chính của cuộc họp này là đòi hỏi của chúng ta về tiền lương.", "eng": "The main business of this meeting is our wages claim."}, {"viet": "Nhiều điều không bình thường trong hệ thống thuế má.", "eng": "The many anomalies in the tax system."}, {"viet": "Người thợ máy tháo hết dầu khỏi động cơ.", "eng": "The mechanic drained all the oil from the engine."}, {"viet": "Kim loại đã bị ăn mòn vì rỉ sét.", "eng": "The metal has corroded away because of rust."}, {"viet": "Lỗi lầm đã rành rành trước tất cả những ai có mặt ở đó.", "eng": "The mistake was obvious to all present."}, {"viet": "Các mệnh giá thường được dùng nhất là: tờ hai mươi, tờ mười, tờ năm, và tờ một đô la.", "eng": "The most commonly used denominations are: twenties, tens, fives, and ones."}, {"viet": "Tiếng rì rầm trở thành tiếng gào la.", "eng": "The murmur swelled into a roar."}, {"viet": "Kết quả cuối cùng của cuộc điều tra kéo dài của cảnh sát là tông tích tên giết người vẫn là điều hoàn toàn bí ẩn.", "eng": "The net result of the long police investigation is that the identity of the killer is still a complete mystery."}, {"viet": "Mẫu mới được đưa ra với một loạt màu sắc hấp dẫn.", "eng": "The new model comes in an exciting range of colours."}, {"viet": "Tin tức thì gần như chắc chắn có thật mặc dù không phải là chính thức.", "eng": "The news is almost certainly true although it is not official."}, {"viet": "Tiếng ồn của xe cộ lưu thông là một điều luôn gây bực bội cho người dân thành phố.", "eng": "The noise of traffic is a constant irritant to city dwellers."}, {"viet": "Người y tá đã cặp nhiệt cho tất cả các bệnh nhân.", "eng": "The nurse took the temperatures of all the patients."}, {"viet": "Toà nhà cũ đó ở tình trạng hoàn toàn mục nát.", "eng": "The old building was in a general state of decay."}, {"viet": "Các củ hành đang bắt đầu nảy chồi.", "eng": "The onions are beginning to sprout."}, {"viet": "Những bức tường bên ngoài ngôi nhà làm bằng gạch.", "eng": "The outer walls of the house are made of bricks."}, {"viet": "Công viên bao gồm toàn bộ đất đai bên kia sông.", "eng": "The park comprehends an the land beyond the river."}, {"viet": "Nữ bệnh nhân vẫn giữ được sức mặc dầu cô ta vẫn còn ốm nặng.", "eng": "The patient is holding her own although she is still very ill."}, {"viet": "Cuộc biểu diễn đã mang lại nét hoàn hảo cho buổi giải trí tối hôm đó.", "eng": "The performance provided the crowning touch to the evening's entertainments."}, {"viet": "Hình vẽ không cho thấy tất cả những bộ phận của bộ máy cơ thể tuyệt diệu của chúng ta.", "eng": "The pictures do not show all the parts of our wonderful body machines."}, {"viet": "Máy bay lên dần cho đến khi nó ra khỏi các tầng mây.", "eng": "The plane climbed until it was clear of the clouds."}, {"viet": "Vở kịch miêu tả nhà vua là một đức vua hiền minh.", "eng": "The play portrays the king as a kindly man."}, {"viet": "Cảnh sát đang rà soát hồ sơ tìm kiếm những vụ tương tự.", "eng": "The police are trawling their files for similar cases."}, {"viet": "Cảnh sát theo dõi người đàn ông đang đi vào ngân hàng.", "eng": "The police observed the man entering the bank."}, {"viet": "Vụ tai tiếng chính trị đó đã làm cho quốc gia này lung lay đến tận gốc rễ.", "eng": "The political scandal shook the nation to its very foundations."}, {"viet": "Bảng là đơn vị tiền tệ ở Anh.", "eng": "The pound is the unit of money in Britain."}, {"viet": "Tổng thống đã vượt quá quyền hạn của mình.", "eng": "The President has exceeded his powers."}, {"viet": "Vị linh mục làm dấu thánh giá trên đầu cô ta.", "eng": "The priest made a cross over her head."}, {"viet": "Tù nhân đó đã được lệnh ân xá vào giây phút cuối cùng.", "eng": "The prisoner won a last-minute reprieve."}, {"viet": "Dự án này phải tiếp tục, không thể quay lui được.", "eng": "The project must go ahead, there can be no turning back."}, {"viet": "Cái áo len này tôi mặc được vài lần đã giãn ra.", "eng": "The pullover stretched after I had worn it a few times."}, {"viet": "Vấn đề là đi Munichhay đi Vienna.", "eng": "The question is whether to go to Munich or Vienna."}, {"viet": "Chúng được gọi là các tia vũ trụ.", "eng": "The rays were named cosmic rays."}, {"viet": "Mối tương quan giữa lượng mưa và sản lượng mùa màng.", "eng": "The relation between rainfall and crop production."}, {"viet": "Nhiều chính khách và nhà báo thường lui tới cửa hàng ăn này.", "eng": "The restaurant is patronized by politicians and journalists."}, {"viet": "Những vụ bạo động đó bị bùng nổ là do một loạt các cuộc bắt bớ của cảnh sát.", "eng": "The riots were triggered by a series of police arrests."}, {"viet": "Tên cướp đó đã được tạm thả nhờ tiền bảo lãnh.", "eng": "The robber was released on bail."}, {"viet": "Đám cưới hoàng gia là một dịp trọng đại.", "eng": "The royal wedding was a magnificent occasion."}, {"viet": "Người bán hàng tìm cách lừa phỉnh tôi bằng những lời lẽ ba hoa về những khoản tiết kiệm lạ lùng đối với các hoá đơn cung cấp hơi đốt.", "eng": "The salesman tried to lead me on with talk of amazing savings on heating bills."}, {"viet": "Chú học trò nhăn mặt làm trò sau lưng thầy giáo.", "eng": "The schoolboy made a face at his teacher's back."}, {"viet": "Ý nghĩ mình không được cần đến có thể gây ra một nỗi lo âu.", "eng": "The sense of not being wanted can set up an angst."}, {"viet": "Ánh lung linh mờ nhạt của chiếc áo dài lụa thanh nhã của cô ta.", "eng": "The shimmering translucence of her fine silk gown."}, {"viet": "Cửa hàng đó phải đóng cửa vì làm ăn không có lãi.", "eng": "The shop closed because it didn't pay."}, {"viet": "Tiếng kêu lanh lảnh của những quả chuông nhỏ.", "eng": "The silvery notes of the little bells."}, {"viet": "Mùi nước hoa của cô ấy lan toả khắp phòng.", "eng": "The smell of her perfume wafted through the room."}, {"viet": "Các chiến sĩ đã được lệnh bồng súng chào.", "eng": "The soldiers were ordered to present arms."}, {"viet": "Diễn giả không mất bình tĩnh trước sự giễu cợt của đám đông.", "eng": "The speaker was not discomposed by the jeers of crowd."}, {"viet": "Tình trạng của nền kinh tế rất đáng ngại.", "eng": "The state of the economy is very worrying."}, {"viet": "Câu chuyện một phần là thực một phần là bịa đặt.", "eng": "The story was partly true and partly made up."}, {"viet": "Tác động phối hợp tinh tế về màu sắc trong các bức hoạ của Monet.", "eng": "The subtle interplay of colours in Monet's painting."}, {"viet": "Người bơi chân bị chuột rút nên cần phải được cứu đưa lên bờ.", "eng": "The swimmer got cramp in his legs and had to be helped out of the water."}, {"viet": "Thầy giáo nhìn thấy anh ta chép bài trong kỳ thi lịch sử.", "eng": "The teacher saw him copying in the history test."}, {"viet": "Mười anh em chúng tôi bị lèn chặt như cá hộp trong thang máy.", "eng": "The ten of us were squashed together like sardines in the lift."}, {"viet": "Gai hồng cào xước bàn tay cô ấy.", "eng": "The thorns on the roses scratched her hands."}, {"viet": "Sự chuyên quyền của người cha trong chế độ gia trưởng.", "eng": "The totalitarianism of the father in their patriarchal house hold."}, {"viet": "Việc chuyển tiền từ nước này sang nước khác.", "eng": "The transfer of currency from one country to another."}, {"viet": "Hai đứa sinh đôi giống nhau đến mức tôi không thể phân biệt đứa nào với đứa nào nữa.", "eng": "The twins the so much alike that I can't tell which is which."}, {"viet": "Sự bạo ngược của chiếc đồng hồ bắt chúng ta phải trở dậy khi chúng ta không muốn.", "eng": "The tyranny of the clock, which makes us get up when we don't want to."}, {"viet": "Việc sử dụng bạo lực chống lại những người tấn công mình.", "eng": "The use of violence against one's attackers."}, {"viet": "Những cơn bão dữ dội đã gây ra mấy lần mất điện.", "eng": "The violent storms caused several power cuts."}, {"viet": "Nước mau bốc hơi trong nắng.", "eng": "The water soon evaporated in the sunshine."}, {"viet": "Toàn bộ đoạn văn đã bị xoá sạch.", "eng": "The whole paragraph has been sponged out."}, {"viet": "Nhân chứng đã được một luật sư cung cấp sự kiện.", "eng": "The witness has been primed by a lawyer."}, {"viet": "Cái khó khăn nhất đã qua rồi-bây giờ tất cả là dễ dàng.", "eng": "The worse is over-it's all downhill from here."}, {"viet": "Được tập luyện nhiều, thân hình họ cứng cáp và gân guốc.", "eng": "Their bodies were hard and muscular after much training."}, {"viet": "Sản phẩm mới của họ đã đẩy tất cả những sản phẩm cạnh tranh ra khỏi thị trường.", "eng": "Their new product has edged all its competitors out of the market."}, {"viet": "Vậy tôi phải cẩn thận với nó.", "eng": "Then I should be careful with it."}, {"viet": "Có một cửa hiệu nho nhỏ bán bánh mì ở góc đường.", "eng": "There's a little shop on the corner that sells bread."}, {"viet": "Không việc gì phải bực bội ( với tôi ) như thế!", "eng": "There's no need to be so tetchy ( with me )!"}, {"viet": "Đấy! Anh lại ( đi ) đánh thức đứa bé dậy!", "eng": "There! You've ( gone and ) woken the baby!"}, {"viet": "Không có phụ đề tiếng Nhật, vì thế tôi không thể theo dõi được bộ phim đó.", "eng": "There are no Japanese subtitles so I can't follow the movie."}, {"viet": "Có nhiều loại cây cổ thụ khác nhau và những loài hoa thú vị.", "eng": "There are various kinds of ancient old trees and enchanting flowers."}, {"viet": "Có một khía cạnh của vấn đề mà chúng ta chưa thảo luận.", "eng": "There is a dimension to the problem that we have not discussed."}, {"viet": "Không có tiêu chuẩn nào tuyệt đối riêng cho cái đẹp.", "eng": "There is no absolute standard for beauty."}, {"viet": "Ở đó, ngay giữa phòng đấy thôi.", "eng": "There it was smack-dab in the middle of the room."}, {"viet": "Có một định mệnh kỳ lạ về chuyện cả hai người cùng mất việc trong một ngày.", "eng": "There was a strange fatality about their both losing their jobs on the same day."}, {"viet": "Có những lối giải thích trái ngược nhau về những gì đã xảy ra.", "eng": "There were contradictory versions of what happened."}, {"viet": "Sau đây là những kết luận chính của bản báo cáo.", "eng": "These are the reports main conclusions."}, {"viet": "Hai cái máy này đều hoạt động theo cùng một nguyên lý.", "eng": "These machines both work on the same principle."}, {"viet": "Những thanh niên này có những bằng chứng ngoại phạm chắc chắn cho thời gian cái chết xảy ra.", "eng": "These youths have solid alibis for the time death took place."}, {"viet": "Họ vừa mới thuê năm người hầu bàn mới.", "eng": "They've just employed five new waiters."}, {"viet": "Chúng đắt hơn nhiều vì tất cả chúng đều là hàng gốc ạ.", "eng": "They are much more expensive as they are all original."}, {"viet": "Chúng cháy âm ỉ trong cơ thể chúng ta, cung cấp nhiệt và năng lượng mà chúng ta cần để duy trì sự sống.", "eng": "They burn slowly in our bodies and furnish the heat and energy we need to keep us alive."}, {"viet": "Họ quyết định gạt các sự bất đồng sang một bên.", "eng": "They decided to put aside their differences."}, {"viet": "Cuối cùng họ cũng tới lúc 11 giờ 30 phút.", "eng": "They finally made their appearance at 11.30."}, {"viet": "Họ đã tuyên bố là đất nước họ là một vùng phi hạt nhân.", "eng": "They have declared their country a nuclear-free zone."}, {"viet": "Họ sống cách thành phố gần nhất 20 dặm.", "eng": "They live 20 miles from the nearest town."}, {"viet": "Họ nói những điều không tử tế như thế về anh cũng chỉ vì lòng ghen tị.", "eng": "They only say such unkind things about you out of envy."}, {"viet": "Họ từ chối không tham gia bất cứ hành vi bạo lực nào.", "eng": "They refused to be party to any violence."}, {"viet": "Họ yêu cầu công ti bồi thường các thiệt hại giá cả.", "eng": "They sought to recover damages, costs, expense, etc."}, {"viet": "Họ đi quanh thành phố một tiếng.", "eng": "They walked round the town for an hour."}, {"viet": "Họ rất sung sướng sau khi đứa bé ra đời.", "eng": "They were in a state of euphoria after the baby was born."}, {"viet": "Họ vạch ra một sự sắp xếp thoả thuận khá tươm tất có thể hài lòng tất cả mọi người.", "eng": "They worked out a tidy arrangement agreeable to all."}, {"viet": "Cuốn sách này không đắt hơn cuốn kia.", "eng": "This book is no more expensive than that one."}, {"viet": "Đập này cao 777 bộ, cao hơn đập Hu-vơ là đập cao nhất của Hoa Kỳ 50 bộ.", "eng": "This dam is 777 feet high, about 50 feet higher than Hoover Dam, which is the highest dam in the United States."}, {"viet": "Điều này không bao giờ được giải thích đầy đủ.", "eng": "This has never been adequately explained."}, {"viet": "Đây là một trong những bài hát trong anbom mới nhất của cô ấy.", "eng": "This is one of the songs from her latest album."}, {"viet": "Danh sách này thiếu vài tên.", "eng": "This list of names has a few omissions."}, {"viet": "Bức hoạ này cho thấy khả năng bố cục tốt.", "eng": "This painting shows a good sense of form."}, {"viet": "Quy tắc này có thể phức tạp, vì khó có thể xác định được ai là người quan trọng hơn.", "eng": "This rule can be complicated, for it may be difficult to determine who is more important."}, {"viet": "Cần phải đem cái lò nướng bánh trả lại cửa hàng-nó chạy không tốt.", "eng": "This toaster is going back to the shop-it doesn't work properly."}, {"viet": "Hai môn đó chơi nhanh hơn, khoáng đại hơn môn bóng đá của Mĩ, tôi nghĩ như vậy.", "eng": "Those two are more open, much faster games than American football, I think."}, {"viet": "Ngày nay chúng ta có máy điện báo, điện thoại và máy thu thanh.", "eng": "Today we have the telegraph, the telephone, and the radio."}, {"viet": "Hai dô kề đã bị hất ngã trong vòng đua thứ hai.", "eng": "Two jockeys were thrown in the second race."}, {"viet": "Chiến tranh, nạn đói và nạn lụt là những thảm hoạ khủng khiếp.", "eng": "War, famine, and flood are terrible evils."}, {"viet": "Chúng tôi muốn anh nhận cuốn sách này để đền đáp lòng tốt của anh.", "eng": "We'd like you to accept this book in payment for your kindness."}, {"viet": "Chúng tôi đang quyên góp tiền cho những trẻ em nghèo.", "eng": "We're collecting money for children in need."}, {"viet": "Năm nay chúng tôi sẽ đi Ý nghỉ bằng máy bay rồi bằng ô tô.", "eng": "We're taking a fly drive holiday to Italy this year."}, {"viet": "Chúng ta chỉ có hai ngày ở đây, chúng ta hãy tận dụng nó.", "eng": "We've only got two days here, let's make the most of them."}, {"viet": "Chúng tôi luôn tìm kiếm nhân tài mới.", "eng": "We are always looking for a new talent."}, {"viet": "Chúng tôi đã tranh cãi với người hầu bàn về giá tiền bữa ăn.", "eng": "We argue with the waiter about the price of the meal."}, {"viet": "Chúng tôi có thể nấu cho ông ít ớt hơn.", "eng": "We can cook for you with less capsicum."}, {"viet": "Chúng tôi có thể nghe thấy những người hàng xóm cãi nhau om xòm.", "eng": "We could hear the neighbours going at each other hammer and tongs."}, {"viet": "Chúng tôi không nhận chi phiếu cá nhân.", "eng": "We don't accept personal checks."}, {"viet": "Chúng tôi bị mưa quá nhiều trong dịp đi nghỉ.", "eng": "We got more than our fair share of rain on holiday."}, {"viet": "Chúng ta đã không gặp nhau kể từ khi học trung học, phải vây không?", "eng": "We hadn't seen one another since high school, had we?"}, {"viet": "Chúng tôi đã thoả thuận là tuần sau chúng tôi sẽ đi.", "eng": "We have settled that we will leave next week."}, {"viet": "Chúng tôi giữ lại tấm ảnh cũ chỉ vì lí do tình cảm.", "eng": "We kept the old photograph for purely sentimental reasons."}, {"viet": "Chúng ta có thể giúp đỡ học phí.", "eng": "We may be able to assist with the tuition fees."}, {"viet": "Chúng ta nên xem các nhà chức trách sẽ phải nói gì.", "eng": "We must see what the authorities have to say."}, {"viet": "Chúng tôi dán giấy lên những chỗ bẩn trên tường.", "eng": "We papered over the stains on the wall."}, {"viet": "Chúng tôi để những đĩa thức ăn rải rác trong phòng trước buổi liên hoan.", "eng": "We scattered plates of food around the room before the party."}, {"viet": "Chúng ta vẫn còn một cơ may chắc chắn để thắng.", "eng": "We still have a strong chance of winning."}, {"viet": "Chúng tôi muốn quảng cáo tìm một kỹ sư.", "eng": "We want to advertise for an engineer."}, {"viet": "Chúng tôi cưới ngày 7 tháng 4 năm 1973 vì thế hàng năm chúng tôi có một bữa tiệc để kỉ niệm ngày cưới.", "eng": "We were married on 7th April 1973, so every year we have a party on our anniversary."}, {"viet": "Chúng tôi lo là mưa to trên cánh đồng cỏ chẳng bao lâu sẽ làm ô tô của chúng tôi sa lầy.", "eng": "We worried that the heavy rain across the prairie would soon bog our car."}, {"viet": "À, tôi thấy không cần tranh cãi với anh về điều này.", "eng": "Well, I don't see any point in arguing about this."}, {"viet": "À, tại sao con không mang theo cái khăn tắm này?", "eng": "Well, why don't you take this towel with you?"}, {"viet": "Bí quyết làm những thứ bánh ngọt tuyệt vời này của cậu là thế nào thế?", "eng": "What's your secret for this wonderful pastry?"}, {"viet": "Những mối quan tâm chính của ông với tư cách một nhà văn là gì?", "eng": "What are your main concerns as a writer?"}, {"viet": "Theo bạn vấn đề lớn nhất đối với xã hội Nhật hiện nay là gì?", "eng": "What do you think the biggest problem with Japanese society is?"}, {"viet": "Kích thước căn buồng này khoảng bao nhiêu?", "eng": "What is the approximate size of this room?"}, {"viet": "Ấn tượng của bạn về nền kinh tế Nhật là gì?", "eng": "What is your impression of the Japanese economy?"}, {"viet": "Anh ấy đeo vật gì quanh cổ vậy?", "eng": "What's he wearing around his neck?"}, {"viet": "Bạn đã gặp điều gì kì lạ nhất ở Nhật Bản?", "eng": "What was the strangest thing you experienced in Japan?"}, {"viet": "Khi nào toa ăn mở cửa để ăn tối?", "eng": "When does the dining car open for dinner?"}, {"viet": "Khi tôi làm Tổng thống, tôi luôn luôn bị mọi người chú ý-không còn có sự riêng tư.", "eng": "When I was President, I was always in the limelight-there was no privacy."}, {"viet": "Khi cảnh sát đến, đám đông bắt đầu chạy tán loạn.", "eng": "When the police arrived, the crowd started running every which way."}, {"viet": "Chẳng hạn khi ăn súp mì Nhật, ông phải làm cho kêu.", "eng": "When you eat Japanese noodle soup, for instance, you have to make noise."}, {"viet": "Mày giấu cuốn sách của tao ở đâu, cái thằng bé tinh nghịch này?", "eng": "Where have you hidden my book, you little mischief?"}, {"viet": "Cổng dành cho chuyến bay chuyển tiếp 707 đi Francisco là cổng nào?", "eng": "Which is the gate for connecting flight 707 to San Francisco?"}, {"viet": "Ai đã đảo ( lung tung ) đường dây điện thế này?", "eng": "Who's been tinkering ( around ) with the wiring?"}, {"viet": "Ai sẽ chăm sóc lũ trẻ khi mẹ chúng nằm bệnh viện?", "eng": "Who will look after the children while their mother is in hospital?"}, {"viet": "Tại sao anh không thuê thêm?", "eng": "Why don't you have more?"}, {"viet": "Thứ hai bạn sẽ trở về chứ?", "eng": "Will you be returning on Monday?"}, {"viet": "Hãy lau nó bằng khăn ướt.", "eng": "Wipe it with a damp cloth."}, {"viet": "Giới phụ nữ đòi hỏi làm việc như nhau thì được trả lương ngang nhau.", "eng": "Women are demanding equal pay for equal work."}, {"viet": "Ông vui lòng điền vào mẫu đơn đăng ký này ạ?", "eng": "Would you fill out this registration form, please?"}, {"viet": "Cậu có thích dùng thử món cá sống không?'.", "eng": "Would you like to try some raw fish?'."}, {"viet": "Anh hãy ghi lại kẻo quên mất.", "eng": "Write it down, otherwise you will forget."}, {"viet": "Bác đã dùng thử món tempura và món sukiyaki.", "eng": "Yes, I've tried tempura and sukiyaki."}, {"viet": "Tốt hơn hết là anh làm dịu bớt đi những nhận xét có tính gây gổ trong bài báo của anh.", "eng": "You'd better tone down the more offensive remarks in your article."}, {"viet": "Bạn là người hay mơ mộng hão huyền, hãy tỉnh mộng đi.", "eng": "You're a daydreamer, wake up and smell the coffee."}, {"viet": "Anh đã dính líu đến vấn đề này-đừng có đổ trách nhiệm cho tôi.", "eng": "You've got to deal with this-don't try and dump it in my lap."}, {"viet": "Bạn không thể cắt bằng sống dao được.", "eng": "You can't cut with the back of the knife."}, {"viet": "Bạn có thể rút tiền ở ngân hàng và đầu tư vào một văn phòng buôn chứng khoán.", "eng": "You can draw money out of a bank and invest it at a stockbroker's office."}, {"viet": "Các anh đổi ngoại tệ có phải không?", "eng": "You change foreign monies, don't you?"}, {"viet": "Cô đã lựa chọn rất kỹ và chúng đều rất mềm mại và bóng!", "eng": "You have a good selection and they are very soft and shiny!"}, {"viet": "Bạn biết tôi luôn làm việc chăm mà.", "eng": "You know I'm always working hard."}, {"viet": "Chắc hẳn bây giờ ông rất mệt.", "eng": "You must be all exhausted now."}, {"viet": "Ông cần một nhà chuyên môn để thu xếp tài chính cho ông.", "eng": "You need a professional to sort out your finances."}, {"viet": "Anh nên kiểm tra lại xe đạp trước khi đi.", "eng": "You should check your bicycle before you ride it."}, {"viet": "Anh có khả năng kiếm được rất nhiều tiền từ vụ kinh doanh này.", "eng": "You stand to make a lot of money from this deal."}, {"viet": "Anh chỉ có thể thi đỗ nếu thật sự chuyên tâm.", "eng": "You will only pass your exams if you really apply yourself."}, {"viet": "Bữa ăn tối của quý khách sẽ được dọn ra trong 5 phút nữa.", "eng": "Your dinners will be ready in five minutes."}, {"viet": "Ý kiến của anh sẽ được cân nhắc kĩ lưỡng.", "eng": "Your suggestion will be carefully considered."}]