[{"viet": "20 bảng Anh là một món tiền lớn đối với một người nghèo.", "eng": "£ 20 means a lot to a poor person."}, {"viet": "Một bó hoa bông vải nở rộ hẳn là đẹp mắt.", "eng": "A bouquet of cotton blossoms would be pretty."}, {"viet": "Một nhà thờ ở trên một ngọn đồi nhỏ.", "eng": "A church situated on a small rise."}, {"viet": "Hành lang chật ních những người và hành lý.", "eng": "A corridor jammed full of people and luggage."}, {"viet": "Cần có một cách đạt thỏa thuận khéo léo và tế nhị để thỏa mãn cả đôi bên.", "eng": "A delicate balancing act is needed in order to satisfy the two sides."}, {"viet": "Một người say rượu không thể được coi là có trách nhiệm đầy đủ về hành vi của anh ta.", "eng": "A drunk man cannot be considered fully responsible for his actions."}, {"viet": "Một ấn bản tốt những vở kịch của Shakespeare.", "eng": "A fine edition of Shakespeare's plays."}, {"viet": "Một cô gái cợt nhả thì không bao giờ làm được việc gì cho nghiêm túc.", "eng": "A giddy girl, who will never settle down to anything serious."}, {"viet": "Một thái độ người lớn đối với công việc.", "eng": "A grown-up attitude toward work."}, {"viet": "Một vụ thuyên chuyển sang một vị trí tương đương đối với một nhân viên.", "eng": "A horizontal transfer for an employee."}, {"viet": "Hồ phản chiếu màu xanh da trời.", "eng": "A lake reflecting the azure of the sky."}, {"viet": "Một dòng thơ không đúng niêm luật.", "eng": "A line that does not scan."}, {"viet": "Một đa số 21 ghế trong thượng viện.", "eng": "A majority of 21 seats in the Senate."}, {"viet": "Một lỗi lầm được làm ra bởi một phóng viên tay mơ.", "eng": "A mistake made by a very raw reporter."}, {"viet": "Một vở kịch mới đã chịu số phận nhục nhã là phải bị dẹp bỏ chỉ sau ba ngày trình diễn.", "eng": "A new play which suffered the inglorious fate of being taken off after only three days."}, {"viet": "Một bưu kiện được gói cẩn thận để khỏi vỡ.", "eng": "A parcel carefully packed to prevent breakage."}, {"viet": "Một làng chài xinh xắn nằm trong vịnh.", "eng": "A picturesque fishing village in the bay."}, {"viet": "Một lời cầu nguyện cho các linh hồn ở luyện ngục.", "eng": "A prayer for the souls in Purgatory."}, {"viet": "Một sự đánh giá lại triệt để việc mậu dịch của chúng ta với Trung Quốc.", "eng": "A radical reappraisal of our trade with China."}, {"viet": "Một chiếc cầu trên đường phải chịu sức nặng nhiều xe cộ chạy qua.", "eng": "A road bridge has to carry a lot of traffic."}, {"viet": "Một người bảo vệ đạo đức xã hội tự phong.", "eng": "A self-appointed guardian of public morality."}, {"viet": "Một cuộc biểu tình ngồi tại văn phòng hội đồng thành phố.", "eng": "A sit-in at the city council offices."}, {"viet": "Một nữ diễn giả đã hoàn chỉnh cách nói của cô ta qua một quá trình thực hành dài.", "eng": "A speaker who honed her delivery by long practice."}, {"viet": "Một bệnh ho dai dẳng đã kéo dài nhiều tuần.", "eng": "A stubborn cough that has lasted for weeks."}, {"viet": "Một cảnh tượng kinh hoàng đập vào mắt của họ khi họ bước vào phòng.", "eng": "A terrible scene met their eyes as they entered the room."}, {"viet": "Bánh xe phình to khi bạn bơm hơi vào.", "eng": "A tyre expands when you pump air into it."}, {"viet": "Một lỗ rất lớn trên mặt đất.", "eng": "A whopping big hole in the ground."}, {"viet": "Đáp ứng những nhu cầu đặc biệt của các nhóm dân tộc thiểu số.", "eng": "Accommodate the special needs of minority groups."}, {"viet": "Sự thu nhận vào trường Đại học Anh Quốc phụ thuộc vào kết quả kỳ thi.", "eng": "Admission to British universities depends on examination results."}, {"viet": "Sau 40 năm làm chính trị ông ấy nghĩ rằng đã đến lúc nên về hưu.", "eng": "After forty years in politics he thinks it's time to call it a day."}, {"viet": "Mười năm sau khi lấy nhau họ đã quyết định sống ly thân.", "eng": "After ten years of marriage they decided to separate."}, {"viet": "A hà, tôi đưa ra một đề nghị được không ạ?", "eng": "Ahem, might I make a suggestion?"}, {"viet": "Tất cả sự phản đối kế hoạch đều thất bại.", "eng": "All opposition to the scheme has collapsed."}, {"viet": "Tất cả cây đã được cưa thành khúc.", "eng": "All the trees have been sawn up into logs."}, {"viet": "Men enzym ngăn cản một phản ứng hoá học.", "eng": "Am enzyme which inhibits a chemical reaction."}, {"viet": "Một thiên sử thi cổ đại ca ngợi những chiến tích anh hùng trong trận chiến.", "eng": "An ancient epic glorifying the hero's deeds in battle."}, {"viet": "Một hệ thống gián điệp có phạm vi hoạt động thật rộng lớn.", "eng": "An espionage network with far-reaching tentacle."}, {"viet": "Một sự trả lời nhanh chóng thư của tôi.", "eng": "An instantaneous reply to my letter."}, {"viet": "Một sự phân tích quá đơn giản các vấn đề mà chúng ta phải đối phó.", "eng": "An oversimplified analysis of the problems we face."}, {"viet": "Ông muốn có bàn vào lúc mấy giờ?", "eng": "And what time do you want it?"}, {"viet": "Bất cứ ai đã chứng kiến vụ tai nạn này nên điện thoại cho cảnh sát.", "eng": "Anybody who saw the accident should phone the police."}, {"viet": "Gần nhà bạn có ngôi nhà nào có ma được nhiều người biết không?", "eng": "Are there any famous haunted houses near your home?"}, {"viet": "Anh sẽ thi đấu hay chỉ xem thôi?", "eng": "Are you going to play or will you just watch?"}, {"viet": "Arithmetic là một từ có bốn âm tiết.", "eng": "Arithmetic is a word of four syllables."}, {"viet": "Khi hắn tiến tới với vẻ đe dọa, cô ta lùi lại tránh hắn.", "eng": "As he moved threateningly forward she shrank back from him."}, {"viet": "Sau vụ hoả hoạn, tất cả sách của cô ta chỉ còn lại là đống tro tàn.", "eng": "Ashes were all that remained of her books after the fire."}, {"viet": "Tới điểm đó ông chủ tịch góp ý kiến quan trọng bảo vệ mạnh mẽ đường lối của công ty.", "eng": "At that point, the chairman weighed in with a strong defense of company policy."}, {"viet": "Tránh kết bạn với những người khác.", "eng": "Avoid the society of other people."}, {"viet": "Coi chừng cái dù đó-anh suýt móc mắt tôi ra rồi đó!", "eng": "Be careful with that umbrella-you nearly jabbed my eye out!"}, {"viet": "Ngay thẳng trong những vụ giao dịch làm ăn của ai.", "eng": "Be upright in one's business dealings."}, {"viet": "Những tín ngưỡng được giữ vững triệt để.", "eng": "Beliefs that were firmly held to."}, {"viet": "Máu còn ứa ra ngoài vết thương.", "eng": "Blood was still oozing from the wound."}, {"viet": "Anh đã thương lượng một hiệp định thương mại với Trung Quốc.", "eng": "Britain concluded a trade agreement with China."}, {"viet": "Nhưng anh ấy có vợ con rồi.", "eng": "But he has a wife and kid."}, {"viet": "Nhưng không phải mọi cuộc hôn nhân đều tồi tệ đâu.", "eng": "But the marriage wasn't all bad."}, {"viet": "Rồi xem, tôi sẽ rời khỏi nơi đây dù có bão tuyết lớn.", "eng": "By jingo, I'm leaving here in spite of the blizzard."}, {"viet": "Ăn cá có thể phù hợp với sự ăn chay không?", "eng": "Can eating fish be reconciled with vegetarianism?"}, {"viet": "Động cơ và hộp số có thể được cung cấp riêng không?", "eng": "Can the engine and the gearbox be supplied separately?"}, {"viet": "Em có nghe thấy lũ chuột kêu chút chít không?", "eng": "Can you hear the mice squeaking?"}, {"viet": "Xin cô cho tôi biết, tôi có thể tìm rau đậu đóng hộp ở đâu?", "eng": "Can you tell me where I can find canned vegetables?"}, {"viet": "Mèo lớn không bao giờ có thể trở lại thành mèo con được.", "eng": "Cats can never change back into kittens."}, {"viet": "Bọn trẻ con vui chơi hàng giờ trong vườn.", "eng": "Children playing for hours in the garden."}, {"viet": "Mặc đồ trắng từ đầu đến chân.", "eng": "Clothed from head to foot in white."}, {"viet": "Muối thông thường là hợp chất của Natri và Clo.", "eng": "Common salt is a compound of sodium and chlorine."}, {"viet": "Xem xét những ưu khuyết điểm của một chế độ.", "eng": "Consider the merits and demerits of a system."}, {"viet": "Ông có thể nhuộm nó màu nâu nhạt được không?", "eng": "Could you dye it light brown?"}, {"viet": "Trong tự điển này các danh từ đếm được được đánh dấu.", "eng": "Count nouns are marked in this dictionary."}, {"viet": "Bố định làm món mì ống kiểu Milan với tôm.", "eng": "Dad is going to fix Milan style pasta with shrimp."}, {"viet": "Đòi hỏi sự đầu hàng của thành phố đó.", "eng": "Demand the surrender of the town."}, {"viet": "Những giọt sương lóng lánh trên cỏ.", "eng": "Dew-drops glistening in the grass."}, {"viet": "Anh có thấy cái thằng cha đó cứ nhìn đắm đuối từng phụ nữ ở bữa tiệc không?", "eng": "Did you see that creep eyeing up every woman at the party?"}, {"viet": "Các phụ nữ ly dị và con cái họ đang trở thành một giai cấp thấp nhất trong xã hội.", "eng": "Divorced women and their children are becoming a new underclass."}, {"viet": "Chúng ta có đủ thức ăn cho mười người không?", "eng": "Do we have sufficient food for ten people?"}, {"viet": "Cô có sẵn một phòng đôi vào ngày 1 tháng năm không?", "eng": "Do you have a double room available for May 1?"}, {"viet": "Anh có biết tất cả mọi nước có thể đi được trong cờ vua không?", "eng": "Do you know all the possible moves in chess?"}, {"viet": "Bạn có cần được giúp một tay chuyển đồ đạc ra khỏi căn hộ của bạn cuối tuần này không?", "eng": "Do you need a hand moving your stuff out of the apartment this weekend?"}, {"viet": "Anh có cho rằng việc giáo dục đa năng sẽ cản trở những đứa trẻ sáng dạ phát triển nhanh không?", "eng": "Do you think that mixed-ability teaching holds the brighter children back?"}, {"viet": "Anh ta có tính kiên nhẫn và cách xử trí khéo léo cần thiết để làm công việc đó không?", "eng": "Does he possess the necessary patience and tact to the job well?"}, {"viet": "Đừng có làm khó dễ nữa; đưa tiền cho chúng tôi mượn đi.", "eng": "Don't be difficult; just lend us the money."}, {"viet": "Đừng quên mang theo quần áo để thay.", "eng": "Don't forget to take a change of clothes."}, {"viet": "Đừng vì bất cứ lý do gì mà để tù nhân không ai canh gác.", "eng": "Don't on any account leave the prisoner unguarded."}, {"viet": "Đừng cố giở trò vớ vẩn gì với tôi!", "eng": "Don't try any funny stuff with me!"}, {"viet": "Bị cuốn hút không cưỡng nổi vào cơn lốc của xã hội, phe đảng chính trị, v. v.", "eng": "Drawn helplessly into the vortex of society, party politics, etc."}, {"viet": "Mỗi trang của cuốn tự điển này có ba cột.", "eng": "Each page of this dictionary has three columns of text."}, {"viet": "Đội Anh ghi tổng số là 436 điểm.", "eng": "England scored a total of 436 runs."}, {"viet": "Các sự kiện diễn biến rất nhanh.", "eng": "Events were proceeding at a gallop."}, {"viet": "Xin lỗi, tôi muốn tham gia câu lạc bộ này.", "eng": "Excuse me, but I'd like to join this club."}, {"viet": "Ca ngợi những lợi ích của các doanh nghiệp nhỏ.", "eng": "Extol the merits of small businesses."}, {"viet": "Cho đứa trẻ ăn táo hầm.", "eng": "Feed the baby some stewed apple."}, {"viet": "Tốt lắm, và tôi cũng thích bức tranh sơn thuỷ đó.", "eng": "Fine, and I also like that painting of mountains and waters."}, {"viet": "Những bầy cừu và đàn gia súc.", "eng": "Flocks of sheep and herds of cattle."}, {"viet": "Để tăng doanh số bán hàng, chúng ta phải hạ giá xuống.", "eng": "For sales to increase, we must lower our prices."}, {"viet": "Dâu tươi bây giờ có rồi nhưng với giá khá đắt đấy!", "eng": "Fresh strawberries are now available-at a price!"}, {"viet": "Tổng quát hoá một kết luận từ một mớ sự kiện.", "eng": "Generalize a conclusion from a set of facts."}, {"viet": "Nhấn mạnh đặc biệt đến một cụm từ.", "eng": "Give a special emphasis to a phrase."}, {"viet": "Đi tìm mua vé nhanh lên.", "eng": "Go and find the tickets and be quick about it."}, {"viet": "Các viên chức chính phủ tuyên thệ không tiết lộ bí mật quốc gia.", "eng": "Government employees swear an oath not to reveal official secrets."}, {"viet": "Lo chuyện đó làm gì, họ đâu có quen biết nhau!", "eng": "Hang it all, they hardly know each other!"}, {"viet": "Tất cả các bạn đều mang áo bơi cả chứ?", "eng": "Have you-all brought swim suits?"}, {"viet": "Em có tính cả chi phí đồ ăn cho ngày nghỉ của chúng ta hay chưa?", "eng": "Have you figured in the cost of food for our holiday?"}, {"viet": "Nói chuyện gẫu vui vẻ với những hàng xóm.", "eng": "Having a good old yack with the neighbours."}, {"viet": "Anh ta là một lái xe tắc xi, vì thế anh ta biết rõ London như lòng bàn tay mình.", "eng": "He's a taxi driver, so he knows London like the back of his hand."}, {"viet": "Ông ta được mọi người ca tụng có phẩm chất của một tổng thống.", "eng": "He's being talked up as presidential timber."}, {"viet": "Ông ấy vừa ở nước ngoài về.", "eng": "He's just arrived back from foreign parts."}, {"viet": "Anh ta còn chếnh choáng vì thuốc gây mê.", "eng": "He's still groggy from the anaesthetic."}, {"viet": "Anh ta làm cho bệnh tình mình trầm trọng hơn vì xuất viện quá sớm.", "eng": "He aggravated his condition by leaving hospital too soon."}, {"viet": "Anh ta hạ những tay đua khác một khoảng cách lớn.", "eng": "He beat the other runners by a wide margin."}, {"viet": "Ông ấy xuất thân từ một gia đình nghèo khó.", "eng": "He came from a poor family."}, {"viet": "Anh ta siết chặt nắm tay của mình cho đến khi các đốt ngón tay trắng ra.", "eng": "He clenched his fist until his knuckles whitened."}, {"viet": "Anh ta đu đứa bé trong tay để dỗ cho nó nín khóc.", "eng": "He dandled the baby to make it stop crying."}, {"viet": "Anh ấy lao từ trên cầu xuống nước để cứu đứa trẻ sắp chết đuối.", "eng": "He dived from the bridge to rescue the drowning child."}, {"viet": "Ông ấy đặt tên quyển sách là Tình yêu hoang dã.", "eng": "He entitled the book Savage Love."}, {"viet": "Cuối cùng cậu ta đã chống lại cách dưỡng dục nghiêm khắc đối với mình.", "eng": "He finally rebelled against his strict upbringing."}, {"viet": "Ông ta đã phải bỏ công việc quảng cáo của ông ta vì ông ta không chịu nổi cường độ công việc.", "eng": "He gave up his job in advertising because he couldn't stand the pace."}, {"viet": "Ông ấy đã cãi nhau với vợ một trận và thế là bỏ bà ấy.", "eng": "He had a row with his wife and just walked out on her."}, {"viet": "Hắn có bộ mặt tôi muốn cho ăn đấm.", "eng": "He has a face I'd like to punch."}, {"viet": "Ông ta chiếm được ưu thế hơn tất cả những đối thủ chính của ông ta.", "eng": "He has gained the ascendancy over all his main rivals."}, {"viet": "Nó không có một chút cơ may nào thi đậu.", "eng": "He hasn't a dog's chance of passing the exam."}, {"viet": "Chàng hứa hôn với công chúa.", "eng": "He is affianced to the princess."}, {"viet": "Anh ta hay có khuynh hướng phóng đại mọi việc.", "eng": "He is rather inclined to put two and two together and make five."}, {"viet": "Chàng giữ một lọn tóc của nàng như là một kỷ vật.", "eng": "He kept a lock of her hair as a memento."}, {"viet": "Anh ta nghe rađiô trong khi lái xe đi làm.", "eng": "He listens to the radio while driving to work."}, {"viet": "Ông ta đưa ra một lời tuyên bố trước Hạ nghị viện.", "eng": "He made a statement before the House of Commons."}, {"viet": "Anh ta rời quân ngũ khi chiến tranh chấm dứt.", "eng": "He mustered out when the war ended."}, {"viet": "Ông ấy đã sơn các cây cột bằng một chất bảo quản.", "eng": "He painted the posts with a preservative liquid."}, {"viet": "Anh ta đưa ra những lý lẽ có sức thuyết phục để thay đổi chính sách.", "eng": "He produced cogent reasons for the change of policy."}, {"viet": "Nó bỏ chạy, lời nhạo báng của chúng vẫn văng vẳng bên tai nó.", "eng": "He ran off, their jeers ringing in his cars."}, {"viet": "Anh ấy thông báo công ty đã kiếm được lợi nhuận.", "eng": "He reported that the company had made a profit."}, {"viet": "Ông ta là một lão già khá khó chịu.", "eng": "He's a rather boring old stick."}, {"viet": "Anh ta đủ khả năng đối phó với tình huống đó.", "eng": "He's equal to the occasion."}, {"viet": "Anh ấy không đủ khả năng làm thầy giáo.", "eng": "He's not cut out to be a teacher."}, {"viet": "Anh ấy rất hung bạo, anh biết đấy, một con ma men mà.", "eng": "He's very violent, it's a demon drink, you know."}, {"viet": "Anh ấy ghi 26 điểm, tất cả đều chạm đường biên.", "eng": "He scored 26 runs all in boundaries."}, {"viet": "Anh ta hét to nhắc người bạn là phải nhớ món rượu.", "eng": "He shouted to his friend to remember the wine."}, {"viet": "Hắn ta tiêu xài như thể hắn là triệu phú.", "eng": "He spends as if he were a millionaire."}, {"viet": "Nó lấy cắp tiền rồi lẻn ra khỏi nhà.", "eng": "He stole the money and sneaked out of the house."}, {"viet": "Ông ấy xoay vòng cái ghế của mình để đối diện với chúng tôi.", "eng": "He swivelled round in his chair to face us."}, {"viet": "Anh ta kể cho họ nghe về công việc làm mà anh ta vừa bỏ.", "eng": "He told them about the job he had left."}, {"viet": "Anh ấy dùng nĩa cố moi thịt ra khỏi hộp.", "eng": "He tried to hoick the meat out of the tin with a fork."}, {"viet": "Ông ta tuyên bố vài điều sáo ngữ về hoà bình và dân chủ.", "eng": "He uttered a few commonplaces about peace and democracy."}, {"viet": "Ông ta bị tố cáo đã biển thủ tiền quỹ của câu lạc bộ.", "eng": "He was accused of appropriating club funds."}, {"viet": "Anh ta bị đưa ra trước quan tòa.", "eng": "He was brought before the judge."}, {"viet": "Nó mười tám tuổi mới bắt đầu đi chơi với các cô gái.", "eng": "He was eighteen before he started going out with girls."}, {"viet": "Nó bị nhốt nhiều năm trong ngục tối của lâu đài.", "eng": "He was incarcerated in the castle dungeon for years."}, {"viet": "Anh ta bị đồng nghiệp tẩy chay vì đã từ chối không ủng hộ cuộc bãi công.", "eng": "He was ostracized by his colleagues for refusing to support the strike."}, {"viet": "Nó tức giận đến nỗi dùng những lời nặng nề với mẹ nó.", "eng": "He was so angry that he swore at his mother."}, {"viet": "Anh ta không thể nhận ra kẻ tấn công mình trong bóng tối.", "eng": "He was unable to recognize his assailant in the dark."}, {"viet": "Anh ta đi kêu ca với bà chủ, nhưng bị đối xử rất thô lỗ: bà ấy bảo anh ta ra ngoài và đừng đến nữa.", "eng": "He went to complain to the boss, but got very short shrift: she told him to get out and stay out."}, {"viet": "Nó làm việc như trâu để cho công việc hoàn thành đúng thời hạn.", "eng": "He worked like hell to get the job done in time."}, {"viet": "Tiếng chân bước nặng nề báo hiệu thầy giáo gần tới.", "eng": "Heavy footsteps signalled the teacher's approach."}, {"viet": "Bà cô Effie của cô ấy là một người kì dị.", "eng": "Her aunt Effie is certainly an original."}, {"viet": "Cách nấu nướng của cô ta thì tuyệt đối không bằng chị.", "eng": "Her cooking is nothing like as good as yours."}, {"viet": "Mặt cô ấy nhăn nhó vì đau đớn.", "eng": "Her face was contorted with pain."}, {"viet": "Sức khoẻ của cô ấy chóng khá lên sau vài ngày nghỉ ngơi.", "eng": "Her health soon picked up after a few days'rest."}, {"viet": "Bài thuyết trình của cô ta chứa quá nhiều câu trích dẫn.", "eng": "Her lecture was overweighted with quotations."}, {"viet": "Tiểu thuyết của bà ấy nhằm chủ đề vào những vấn đề của thanh thiếu niên.", "eng": "Her novels center on the problem of adolescence."}, {"viet": "Sự từ chối của cô ấy hoàn toàn làm anh ta mất nhuệ khí.", "eng": "Her rejection completely dispirited him."}, {"viet": "Những chuyện kể của cô ta bộc lộ một cá tính hài hước phong phú.", "eng": "Her stories revealed a rich vein of humour."}, {"viet": "Đây là tờ chi phiếu 300 đô la và cô cứ giữ tiền thối lại.", "eng": "Here's a check for 300 dollars and you can keep the change."}, {"viet": "Bản thân mình bất hạnh, anh ta hiểu tình cảnh đó.", "eng": "Himself unhappy, he understood the situation."}, {"viet": "Tính tình thô lỗ làm cho anh ta bị quở trách gay gắt.", "eng": "His bad manners earned him a sharp rebuke."}, {"viet": "Quần áo của hắn rách và vấy máu.", "eng": "His clothes were torn and bloody."}, {"viet": "Các chính sách kinh tế của ông ta tạo cơ hội cho việc mở rộng công nghiệp.", "eng": "His economic policies paved the way for industrial expansion."}, {"viet": "Sự sợ hãi của anh ta truyền sang tôi, và tôi cũng thấy sợ ngay thôi.", "eng": "His fear infected me, and I followed as fast as I could."}, {"viet": "Tính trung thực của ông ấy được mọi người rất kính trọng.", "eng": "His honesty earned him great respect."}, {"viet": "Bức thư của anh ta được viết bằng lời lẽ hòa dịu.", "eng": "His letter was couched in conciliatory terms."}, {"viet": "Vở kịch mới của ông ta có một cái gì hay hay.", "eng": "His new play has a certain je ne sais quoi."}, {"viet": "Việc ông chủ tới đã phá giấc ngủ sau bữa cơm của anh ta.", "eng": "His postprandial nap was disturbed by the arrival of the boss."}, {"viet": "Áo sơ mi của anh ta mỏng đến nỗi có thể nhìn thấy áo may-ô của anh ta.", "eng": "His shirt was so thin that his vest showed through."}, {"viet": "Bài nói chuyện của ông ta được đón nhận nồng nhiệt.", "eng": "His talk met with a warm reception."}, {"viet": "Lời nói của anh ta đủ làm cho các cô gái bối rối.", "eng": "His words were sufficient to befuddle the girls."}, {"viet": "Sự phân phối đồng đều hai số đơn theo thống kê.", "eng": "Homogeneity of two statistical populations."}, {"viet": "Vậy còn hoà nhạc cổ điển thì sao?", "eng": "How about the classical concert, then?"}, {"viet": "Sao mày dám bảo tao là béo!", "eng": "How dare you call me fat!"}, {"viet": "Bạn gọi “ máy tẩy lông ” bằng tiếng Nhật thế nào?", "eng": "How do you say hair remover in Japanese?"}, {"viet": "Bạn đã sống ở ngôi nhà hiện thời được bao lâu rồi?", "eng": "How long have you lived in your current home?"}, {"viet": "Con mèo thường có bao nhiêu con?", "eng": "How many offspring does a cat usually have?"}, {"viet": "Sản xuất được bao nhiêu là do chúng ta làm việc tích cực như thế nào.", "eng": "How much is produced depends on how hard we work."}, {"viet": "Bạn thấy các trường đại học ở nước bạn so với các trường đại học ở Nhật Bản như thế nào?", "eng": "How would you compare universities in your country with those of Japan?"}, {"viet": "Tôi sẽ rất biết ơn nếu anh giữ bí mật chuyện đó.", "eng": "I'd be grateful if you would keep it secret."}, {"viet": "Tôi muốn ăn thử sầu riêng, nó được cho là “ Vua của các loại trái cây ”.", "eng": "I'd like to try eating a durian, which is supposed to be The King of fruits."}, {"viet": "Tôi sẽ trả anh 8500 pao cho chiếc ôtô ấy!'.'Xong!'.", "eng": "I'll give you 8500 pounds for the car.''Done!'."}, {"viet": "Tôi sẽ hô như là khẩu hiệu để bạn bắt đầu Một, hai, ba chạy!", "eng": "I'll say One, two, three go! as the signal for you to start!"}, {"viet": "Tôi sợ là tôi phải áp đặt một hệ thống nào đó đối với suy nghĩ của tôi.", "eng": "I'm afraid I need to impose some kind of system on my thinking."}, {"viet": "Tôi sẽ lập gia đình lại nhưng xin anh hãy giữ kín việc đó nhé, được chứ?", "eng": "I'm getting married again, but keep it dark, will you?"}, {"viet": "Tôi hiện nay đang ở trong một tâm trạng không hay để có thể làm nổi một quyết định.", "eng": "I'm in the wrong frame of mind to make a decision now."}, {"viet": "Tôi thân với giám đốc ngân hàng của tôi.", "eng": "I'm on familiar terms with my bank manager."}, {"viet": "Tôi lấy làm tiếc là bắt anh làm thêm nhiều quá''Không sao cả!'.", "eng": "I'm sorry to give you so much extra work.''No sweat!'."}, {"viet": "Tôi cố gắng tìm được một bản của cuốn sách.", "eng": "I'm trying to get ahold of a copy of the book."}, {"viet": "Tôi đã tiến hành tìm hiểu điều đó.", "eng": "I've been making some inquiries about it."}, {"viet": "Tôi có rất nhiều bút tích của các cầu thủ bóng đá nổi tiếng.", "eng": "I've got lots of famous footballers'autographs."}, {"viet": "Tôi chưa bao giờ thấy anh ấy học thi chăm chỉ cả.", "eng": "I've never seen him study hard for any exam."}, {"viet": "Tôi chán nghe anh khuyên răn quá rồi.", "eng": "I'm tired of listening to you preach."}, {"viet": "Tôi rất giận mình vì đã phạm phải một sai lầm ngớ ngẩn như vậy.", "eng": "I am angry with myself for making such a stupid mistake."}, {"viet": "Tôi không xứng đáng với một vinh dự như vậy.", "eng": "I am unworthy of such an honour."}, {"viet": "Tôi tin tưởng vào nhân cách của anh ấy.", "eng": "I believe in his good character."}, {"viet": "Mẹ không thể nào chải đầu cho con được nếu con cứ ngọ nguậy mãi thế!", "eng": "I can't brush your hair if you keep wriggling all the time!"}, {"viet": "Tôi không thể nào nhớ được lần cuối cùng chúng ta phải chịu đựng tuyết rơi nhiều như thế!", "eng": "I can't remember the last time we have had so much snow!"}, {"viet": "Tôi có thể cho anh mượn tiền.", "eng": "I can lend you some money."}, {"viet": "Tôi không thể không chú ý nghe.", "eng": "I can't help having big ears."}, {"viet": "Không cần phải đánh thức tôi lúc 3 giờ sáng.", "eng": "I could have done without being woken up at 3 o'clock in the morning."}, {"viet": "Xin cho tôi một cốc rượu gin có pha nước cam.", "eng": "I'd like a gin and orange please."}, {"viet": "Hôm qua thì có, nhưng bây giờ tôi cảm thấy khỏe hơn.", "eng": "I did yesterday, but I feel much better now."}, {"viet": "Tôi không tiếc tiền chi tiêu cho việc học hành của con cái tôi.", "eng": "I don't begrudge the money spent on my children's education."}, {"viet": "Mình không muốn cứ phải ôm lấy cái bàn ( thí dụ ở một văn phòng ) suốt cả ngày.", "eng": "I don't like being desk-bound ( in an office ) all day."}, {"viet": "Em nghĩ rằng chúng ta không thể giao khoán bọn trẻ lại cho bố mẹ anh khi chúng ta đi vắng được.", "eng": "I don't think we can wish the children on your parents while we're away."}, {"viet": "Thậm chí tôi không nhớ nổi ông ấy nữa.", "eng": "I don't even remember him."}, {"viet": "Tôi đã đánh rơi chìa khoá ở gần đâu đây.", "eng": "I dropped the key somewhere about here."}, {"viet": "Tôi buồn nôn: món cá ấy không hợp với tôi.", "eng": "I feel sick: that fish disagreed with me."}, {"viet": "Tôi gặp ông ta lần đầu cách đây lâu lắm, vào những năm năm mươi.", "eng": "I first met him way back in the fifties."}, {"viet": "Tôi đi mỹ viện cứ 3 tháng 1 lần.", "eng": "I go to the beauty shop once every three months."}, {"viet": "Tôi chợp mắt một chốc trên xe lửa.", "eng": "I had a quick doze on the train."}, {"viet": "Tôi có nhiệm vụ phải nói với họ là họ đã mất việc: tôi luôn luôn phải làm giúp ông chủ công việc khó chịu này.", "eng": "I had to tell them they'd lost their jobs: I always have to do the boss's dirty work."}, {"viet": "Tôi có bia, rượu vang, xô-đa, nước ép trái cây và sữa.", "eng": "I have beer, wine, soda, juice and milk."}, {"viet": "Tôi chỉ nhớ mang máng ngôi nhà ở đâu.", "eng": "I have only a vague idea where the house is."}, {"viet": "Tôi chưa ghi tên và nghề nghiệp của bạn vào sổ.", "eng": "I haven't entered your name and occupation yet."}, {"viet": "Tôi nghe đồn là ông hiệu trưởng sẽ đi nơi khác.", "eng": "I heard a rumour that the headmaster is leaving."}, {"viet": "Tôi hy vọng gặp tất cả họ hàng vào mùa Giáng sinh.", "eng": "I hope to see all of my relatives at Christmastime."}, {"viet": "Tôi vừa thấy anh ta lúc nãy.", "eng": "I just saw him a moment ago."}, {"viet": "Tôi không hề tự cho mình là một chuyên gia kinh tế.", "eng": "I lay no claim to being an expert economist."}, {"viet": "Tôi nghe tất cả lời phê bình của cô ấy trong yên lặng.", "eng": "I listened to all her criticisms in silence."}, {"viet": "Tôi sẽ gọi điện cho anh ngày mai.", "eng": "I'll give you a ring tomorrow."}, {"viet": "Xin ông cứ lo công việc của mình thôi.", "eng": "I'll thank you to mind your business."}, {"viet": "Tôi có bổn phận giúp anh ta.", "eng": "I'm duty bound to help him."}, {"viet": "Tôi không có ý định thừa nhận thất bại.", "eng": "I'm not about to admit defeat."}, {"viet": "Tôi chắc là họ luôn làm ăn phát đạt.", "eng": "I'm sure they always do good business."}, {"viet": "Tôi có thể đi LA tuần tới nếu tôi có thể kiếm được xe cho thuê.", "eng": "I might go to LA next week if I can get a drive away car."}, {"viet": "Tôi sẽ đích thân trao giải thưởng.", "eng": "I myself will present the prizes."}, {"viet": "Tôi nhận thấy giữa chúng nó có một sự lạnh nhạt nào đó.", "eng": "I noticed a certain coolness between them."}, {"viet": "Tôi chơi chỉ để vui thôi.", "eng": "I play just for the fun of it."}, {"viet": "Tôi nhận ra là mình đã nói điều sai trái khi nhìn thấy sự phản ứng của cô ấy.", "eng": "I realized that I had said the wrong thing when I saw her reaction."}, {"viet": "Tôi nhớ lại thầy giáo toán của tôi với lòng căm ghét.", "eng": "I remember my math teacher with loathing."}, {"viet": "Hôm nay tôi đã gặp mẹ bạn ở trên phố.", "eng": "I saw your mother in town today."}, {"viet": "Tôi phải tự nhận ra sự cần thiết phải học tập.", "eng": "I should bethink myself of the need to study."}, {"viet": "Tôi vẫn không thể làm được việc đó.", "eng": "I still can't do it."}, {"viet": "Tôi có khuynh hướng với điều ông ấy đang nói.", "eng": "I tend to disagree with what he is saying."}, {"viet": "Tôi nghĩ hầu hết các nhà chính trị đều không nói hết sự thật.", "eng": "I think most politicians learn to be economical with the truth."}, {"viet": "Tôi nghĩ rằng những lời nói đùa của nó rất lạc điệu.", "eng": "I thought his jokes were in very poor taste."}, {"viet": "Tôi cố sức cho đến khi tôi mệt.", "eng": "I tried till I was tired."}, {"viet": "Tôi có mang theo nó đây.", "eng": "I've brought it along with me."}, {"viet": "Tôi muốn kiểm tra cái túi này đi Tokyo.", "eng": "I want to check this bag through to Tokyo."}, {"viet": "Mình đã vô cùng ghen tỵ khi thấy chiếc xe mới lộng lẫy của cậu ta.", "eng": "I was absolutely green when I saw his splendid new car."}, {"viet": "Tôi định trở thành một kiến trúc sư.", "eng": "I was going to be an architect."}, {"viet": "Tiếng chuông làm tôi thức giấc.", "eng": "I was roused by the sound of a bell."}, {"viet": "Tôi một suýt nữa thì cho nó một quả đấm vào mõm.", "eng": "I was within a hairbreadth of punching him in the mouth."}, {"viet": "Tôi sẽ chà đạp lên mọi chông gai của những điều không thể làm được và san bằng chúng với vẻ duyên dáng và quyết tâm của phụ nữ.", "eng": "I will trample upon all the prickles of the impossibilities and flatten them womanfully."}, {"viet": "Ông ta tự nhủ thầm Không biết mình có bao giờ gặp lại họ nữa không?", "eng": "I wonder if I shall ever see them again?, he mused?"}, {"viet": "Tôi muốn uống thêm một ly.", "eng": "I would like a refill, please."}, {"viet": "Tôi cho là anh ta đúng.", "eng": "I would say he's right."}, {"viet": "Nếu có ai đến muộn, họ sẽ phải đợi bên ngoài.", "eng": "If anyone arrives late they'll have to wait outside."}, {"viet": "Nếu tôi khước từ, ông chủ sẽ chỉ tìm cách gây khó khăn cho tôi.", "eng": "If I say no, the boss will only make trouble for me."}, {"viet": "Nếu bệnh nhân có nôn mửa, lật anh ta lại để đầu của anh ta quay sang một bên.", "eng": "If the patient should vomit, turn him over with his head to the side."}, {"viet": "Nếu bạn bị táo bón, bạn có thể cần một loại thuốc tẩy.", "eng": "If you're constipated you may need a laxative."}, {"viet": "Nếu ông không hoàn thành công việc, tôi sẽ kiện ( đòi bồi thường ).", "eng": "If you don't complete the work, I will sue you ( for damages )."}, {"viet": "Nếu bà làm mất nó, cách duy nhất để mở hộp là khoan mở nó trước mặt hai nhân viên ngân hàng thêm với bà nữa.", "eng": "If you lose the key, the only way to open the box is to drill it open in the presence of two bank officials in addition to yourself."}, {"viet": "Nếu ông báo trước cho tôi biết, tôi sẽ chuẩn bị sẵn món hàng cho ông.", "eng": "If you warn me in advance, I will have your order ready for you."}, {"viet": "Hoàn toàn có khả năng cuộc họp sẽ bị bãi bỏ.", "eng": "In all likelihood the meeting will be cancelled."}, {"viet": "Ở Pháp, loại phó-mát Roquefort được làm bằng sữa cừu.", "eng": "In France, Roquefort is made from sheep's milk."}, {"viet": "Ở các biệt thự nghỉ mát của chúng tôi, các vị sẽ có cả bãi biển lẫn núi ở ngay trước mặt.", "eng": "In our holiday villas you'll have both the beach and the mountains on your doorstep."}, {"viet": "Trong phim bà hoàng hậu nhân từ đã cứu cô khỏi tay kẻ thù độc ác.", "eng": "In the film the good queen saves her from an evil enemy."}, {"viet": "Trong trung tâm mua sắm này, có một siêu thị khổng lồ, một tiệm thuốc tây, một số cửa hàng bách hoá và một nhà hàng.", "eng": "In this shopping center, there is a huge supermarket, a drugstore, some department stores and a restaurant."}, {"viet": "Thay vào đó, một số lượng lớn các trang được in một lần trên một trang giấy khổ lớn.", "eng": "Instead, a great may pages are printed at one time on a large sheet of paper."}, {"viet": "Học sinh trung học làm việc bán thời gian là điều bình thường phải không?", "eng": "Is it usual for high school students to have a part-time job?"}, {"viet": "Trong cái cặp của ông có thứ gì dễ vỡ không ạ?", "eng": "Is there anything breakable in your briefcase?"}, {"viet": "Cô ấy sẽ cần một thời gian dài mới phục hồi được sau khi khỏi bệnh.", "eng": "It'll take time for her to recover from the illness."}, {"viet": "Trời lúc nào cũng nóng vào tháng 6, tháng 7 và tháng 8.", "eng": "It's always hot in June, July and August."}, {"viet": "Thật là khích lệ khi nhận được một báo cáo tán thành công việc mình làm.", "eng": "It's encouraging to receive a favourable report on one's work."}, {"viet": "Đã lâu lắm rồi kể từ khi Núi Vesuvius phun lửa lần cuối cùng.", "eng": "It's many years since Mount Vesuvius last erupted."}, {"viet": "Ở trên tầng sáu-chúng ta hãy đi thang máy.", "eng": "It's on the sixth floor-let's take the lift."}, {"viet": "Đã đến lúc tôi phải rút lui nhường chỗ cho một người trẻ hơn lên làm chủ tịch.", "eng": "It's time for me to step aside and let a younger person become chairman."}, {"viet": "Dường như tôi thấy rằng số mật của ông không đúng.", "eng": "It appears to me that his secret number is not correct."}, {"viet": "Điều làm cho anh ấy phiền muộn là cô ấy đã nghĩ đến điều đó đầu tiên.", "eng": "It irked him that she had thought of it first."}, {"viet": "Không thể nào thoả mãn được tất cả các đòi hỏi của anh.", "eng": "It is impossible to satisfy all your demands."}, {"viet": "Hành động như thế thì không hợp với anh ta.", "eng": "It is unbecoming of him to act in this manner."}, {"viet": "Chỉ mất hai tiếng để kê khai đơn.", "eng": "It only takes two hours to process the application."}, {"viet": "Nó được một người phụ nữ điều khiển.", "eng": "It's operated by a woman."}, {"viet": "Đưa ra những lời tuyên bố kẻ cả mà họ không hề thảo luận trước là tỏ ra khinh miệt công chúng.", "eng": "It shows contempt for the public to make these ex cathedra pronouncements without any previous discussion."}, {"viet": "Đó là một ngày đáng tự hào đối với chúng tôi khi chúng tôi đoạt cúp.", "eng": "It was a proud day for us when we won the trophy."}, {"viet": "Chính nhờ tài ăn nói mà anh ta đã được nhận công việc đó.", "eng": "It was his silver tongue that got him the job."}, {"viet": "Người ta cho rằng phụ nữ trẻ tuổi mà hút thuốc lá là không phải lối.", "eng": "It was thought unbecoming for young ladies to smoke."}, {"viet": "Thật là khôn ngoan khi tiết kiệm được một số tiền.", "eng": "It would be prudent to save some of the money."}, {"viet": "Jill không nhịn được việc giễu cợt cái đầu hói của ông ta.", "eng": "Jill couldn't resist making jokes about his baldness."}, {"viet": "Chỉ một miếng sườn cừu và một chút khoai tây.", "eng": "Just a lamb chop and a few measly potatoes."}, {"viet": "Cách sử dụng một ngôn ngữ vô cùng biến hoá, không thể chỉ qua miêu tả một vài quy luật đơn giản mà được.", "eng": "Language usage is too elastic to be decribed using just a few simple rules."}, {"viet": "Hãy để tôi lấy số máy bạn cần.", "eng": "Let me get the number you want."}, {"viet": "London đầy khách du lịch vào mùa hè.", "eng": "London is full of tourists in the summer."}, {"viet": "Nhiều người mong đợi chính phủ mới sẽ làm giảm bớt nạn thất nghiệp.", "eng": "Many people are looking to the new government to reduce unemployment."}, {"viet": "Mary này, nếu bạn thích, tôi có thể rửa chén đĩa giúp bạn.", "eng": "Mary, if you like, I could do the washing-up."}, {"viet": "Cho tôi xem bảng giá cước được không?", "eng": "May I see the fare chart?"}, {"viet": "Ánh sáng phản chiếu như ánh trăng xuất hiện trên mặt nước quanh ngôi chùa tạo nên một bức tranh huyền hoặc.", "eng": "Moonlike reflections appear on the water around the pagoda creating a magical picture."}, {"viet": "Ông David Vương, chủ tịch của chúng tôi, muốn mời ông cùng dùng bữa ăn tối với họ tối mai.", "eng": "Mr. David Wang, our president, would like you to join them for dinner tomorrow night."}, {"viet": "Ý kiến của tôi là anh không đạt được kết quả nào đâu.", "eng": "My bet is that you've been up to no good."}, {"viet": "Cha tôi liền gửi cho ngân hàng thông báo khoá chi phiếu.", "eng": "My father sent the bank a stop payment right away."}, {"viet": "Mẹ tôi hết sức cáu kỉnh khi bà nhìn thấy chiếc bình vỡ.", "eng": "My mother fumed when she saw the broken vase."}, {"viet": "Đề nghị của tôi đã được tiếp nhận một cách khinh thị.", "eng": "My suggestion was received with disdain."}, {"viet": "Chính sách kinh tế mới nhằm thay thế chính sách thất bại của sự điều hành trước đây.", "eng": "New economic policies intended to replace the failed of a past administration."}, {"viet": "Không, tôi chỉ phải gọi một cú điện thoại thôi.", "eng": "No, I just have to make a phone call."}, {"viet": "Không được đậu xe trong khuôn viên bệnh viện.", "eng": "No parking within the hospital precincts."}, {"viet": "Nay Ned đã biết đọc, cậu ta thấy những sách tranh trước kia của cậu ta quá trẻ con.", "eng": "Now that Ned can read he finds his early picture books too babyish."}, {"viet": "À, trong khách sạn của cô có trung tâm giải trí không?", "eng": "Oh, do you have a recreation center in your hotel?"}, {"viet": "Được, đó là một ý kiến hay, ông Green ạ.", "eng": "Okay, that's a good idea, Mr. Green."}, {"viet": "Một khi bạn biết được những vấn đề chủ yếu bạn có thể bắt đầu thí nghiệm với những phương pháp khác.", "eng": "Once you know the basics, you can start experimenting with different methods."}, {"viet": "Một sai sót nhỏ đã bất ngờ gây ra thảm hoạ.", "eng": "One small error precipitated the disaster."}, {"viet": "Công ty của chúng ta sẽ sở hữu sáu tầng của tòa nhà mới, trong khi các tầng còn lại sẽ được cho các công ty thương mại khác thuê.", "eng": "Our company will be occupying six storeys of the new building, while the remainder will be rented to other commercial firms."}, {"viet": "Cuộc sống của chúng tôi sẽ nghèo nàn hơn rất nhiều nếu như chúng tôi không quen biết người bạn thân thiết của chúng tôi.", "eng": "Our lives would have been greatly impoverished if we had not known our dear friend."}, {"viet": "Thầy giáo thường nhắc đi nhắc lại bản cửu chương để nhồi nhét vào đầu chúng tôi.", "eng": "Our teacher used to drum our multiplication tables into us."}, {"viet": "Nghị viện đã thảo luận nhiều điểm sửa đổi sẽ đưa vào dự luật.", "eng": "Parliament debated several amendments to the bill."}, {"viet": "Những người mặc quần bò bị ngăn cản không cho vào ( câu lạc bộ ).", "eng": "People in jeans were debarred ( from the club )."}, {"viet": "Khi nào đi ra ngoài, ông bà vui lòng gửi chìa khoá cho bàn lễ tân.", "eng": "Please give the key to the Reception Desk when you go out."}, {"viet": "Sự tiến triển của các cuộc đàm phán bị cản trở do thái độ không nhân nhượng của chính phủ.", "eng": "Progress in the talks was blocked by the Government's intransigence."}, {"viet": "Sang năm trợ cấp của nhà trường sẽ phải giảm mạnh.", "eng": "School grants are to be axed next year."}, {"viet": "Ngài có cần tôi phục vụ hay là Ngài tự làm?", "eng": "Shall I serve, or do you want to serve yourself?"}, {"viet": "Cô ấy làm việc tình nguyện tại bệnh viện đó.", "eng": "She's a voluntary worker at the hospital."}, {"viet": "Cô ta mê anh bạn trai mới này như điếu đổ.", "eng": "She's dotty about this latest boyfriend."}, {"viet": "Cô ấy đã làm ăn rất phát tài trên thị trường chứng khoán.", "eng": "She's made a killing on the stock market."}, {"viet": "Cô ta bắt đầu chơi thân với một diễn viên thất nghiệp.", "eng": "She's taken up with an unemployed actor."}, {"viet": "Cô ấy xếp xen kẽ con trai và con gái quanh bàn.", "eng": "She alternated boys and girls round the table."}, {"viet": "Bà ta thúc giục các con đi học.", "eng": "She bustled the children off to school."}, {"viet": "Chị ấy đằng hắng ho để gợi ý cho anh ta nên đi đi.", "eng": "She coughed to give him the hint that he should go."}, {"viet": "Cô ấy tán dương cái chân có dây nịt cuốn quanh của tôi.", "eng": "She did praise my leg being cross-gartered."}, {"viet": "Bà ấy ước tính công việc có lẽ phải mất ba tháng.", "eng": "She estimated that the work would take three months."}, {"viet": "Bà ta là người đã sáng lập ra câu lạc bộ và bây giờ là thành viên cao niên nhất của chúng tôi.", "eng": "She founded the club and is now our doyenne."}, {"viet": "Cô ấy túm lấy dây thừng và đu người lên.", "eng": "She grasped the rope and pulled herself up."}, {"viet": "Cô ấy chưa đọc bức thư nên không biết được nội dung của nó.", "eng": "She hadn't read the letter and so was unaware of its contents."}, {"viet": "Cô ta đã nhận được một lời cảnh cáo viết về hành vi của cô ta.", "eng": "She has received a written warning about her conduct."}, {"viet": "Cô ấy là một diễn viên tốt, song còn cần phải có thời gian để cô ta nhập được vai.", "eng": "She is a good actress, but still needs time to grow into the part she is playing."}, {"viet": "Bà ấy là loại người phụ nữ hay giúp đỡ mọi người.", "eng": "She is the kind of woman who helps people."}, {"viet": "Cô ta chót buột miệng là chưa đóng thuế.", "eng": "She let slip that she had not paid her tax."}, {"viet": "Bà ta đặt cái lệ là mỗi ngày ăn một quả táo.", "eng": "She made a rule of eating an apple a day."}, {"viet": "Bây giờ bà ta có quyền đối với người mà trước đây bà thường nhận lệnh.", "eng": "She now has authority over the people she used to take orders from."}, {"viet": "Cô ta dẫn trước bài diễn văn của mình bằng một lời cảm ơn uỷ ban.", "eng": "She preceded her speech with a vote of thanks to the Committee."}, {"viet": "Cô ta không nhớ được gì ( về anh ấy ) mà chỉ còn nhớ mái tóc của anh ta là đen thôi.", "eng": "She remembered nothing ( about him ) except that his hair was black."}, {"viet": "Hôm nay cô ta cảm thấy khoẻ hơn nhiều.", "eng": "She's feeling so much better today."}, {"viet": "Cô ta rất có thể gọi điện thoại cho tôi tối nay.", "eng": "She's very likely to ring me tonight."}, {"viet": "Cô ấy hình như rất tự tin, nhưng vẻ bên ngoài đôi khi làm cho người ta lầm lẫn.", "eng": "She seems to have plenty of confidence, but appearances are sometimes deceptive."}, {"viet": "Bà ta nức nở kể về cái chết thảm khốc của đứa con trai.", "eng": "She sobbed out the story of her son's violent death."}, {"viet": "Bà ta đã kiện đòi ly dị trên cơ sở cho rằng chồng bà đã lăng nhăng với cô thư ký của ông ta.", "eng": "She sued for divorce on the grounds of her husband's alleged misconduct with his secretary."}, {"viet": "Cô ta đã hoàn toàn cho tôi vào tròng với câu chuyện của cô ta.", "eng": "She took me in completely with her story."}, {"viet": "Cô ấy tự nguyện làm ( các việc ) cho công tác cứu trợ.", "eng": "She volunteered ( her services ) for relief work."}, {"viet": "Nàng ngạc nhiên là hắn vẫn còn sống.", "eng": "She was amazed that he was still alive."}, {"viet": "Cô ta cảm thấy ngượng vì kiểu thích phô trương của anh ấy ở buổi liên hoan.", "eng": "She was embarrassed by his exhibitionism at the party."}, {"viet": "Bà ấy đã được trở thành một hội viên trong hãng đó.", "eng": "She was made a partner in the firm."}, {"viet": "Bà ta hết sức choáng về những hành động của ông ta.", "eng": "She was shocked to the marrow by his actions."}, {"viet": "Cô ta đã rất mau mắn trả lời thư của tôi.", "eng": "She was very prompt in answering my letter."}, {"viet": "Cô ta vụt quay về phía sau đúng lúc hắn sắp tấn công cô ta từ đằng sau.", "eng": "She whipped round just as he was about to attack her from behind."}, {"viet": "Chị ấy làm việc căng thẳng quá đến nỗi mà đôi khi tôi lo lắng cho sức khoẻ của chị ấy.", "eng": "She works so hard that I sometimes get anxious for her health."}, {"viet": "Các kênh đào Suez và Panama có nên được quốc tế hoá không?", "eng": "Should the Suez and Panama canals be internationalized?"}, {"viet": "Từ ngày bị tai nạn cô ấy không còn khả năng làm việc.", "eng": "Since her accident she has been incapable of working."}, {"viet": "Bóp méo câu chuyện để bênh vực vị bộ trưởng.", "eng": "Slant the story to protect the minister."}, {"viet": "Các con ốc sên cứ ăn mãi rau diếp của chúng tôi.", "eng": "Snails have been eating our lettuces."}, {"viet": "Trật tự xã hội và sự phồn vinh, những mục đích liên kết với nhau của chính quyền.", "eng": "Social order and prosperity, the conjoint aims of government."}, {"viet": "Cần phải có sự mặc cả gắt gao.", "eng": "Some hard bargaining is called for."}, {"viet": "Một số người nghĩ rằng anh ta có thể là một nhà vô địch tương lai.", "eng": "Some people think him a possible future champion."}, {"viet": "Ai đó bảo với Marry rằng xe của cô ấy bị đánh cắp và Marry đã tin lời họ.", "eng": "Someone told Mary her car was stolen and Mary believed them."}, {"viet": "Rượu vang trắng sủi tăm là loại sâm banh hạng nhì.", "eng": "Sparkling white wine is the poor man's champagne."}, {"viet": "Nép sang một bên để cho ai đi qua.", "eng": "Stand aside to let somebody pass."}, {"viet": "Đừng rối rít nữa và tiếp tục làm việc đi.", "eng": "Stop all this fuss and get on with your work."}, {"viet": "Đi bằng những bước dài với quyết tâm thường lệ của mình.", "eng": "Striding along with her wonted purposefulness."}, {"viet": "Những hợp đồng như vậy tiếp theo việc bán những dịch vụ bảo trì.", "eng": "Such contracts involve follow-on sales of maintenance services."}, {"viet": "Cứ cho rằng cái tin ấy là đúng, vậy thì sao nào?", "eng": "Suppose that the news is true, what then?"}, {"viet": "Thi lấy bằng cao học về tiếng Anh.", "eng": "Take a Master's degree in English."}, {"viet": "Vị giác và khứu giác có liên quan mật thiết.", "eng": "Taste and smell are closely connected."}, {"viet": "Mười pao đối với một quyển từ điển tốt xem ra cũng phải chăng.", "eng": "Ten pounds for a good dictionary seems reasonable enough."}, {"viet": "Đó là một sự liều lĩnh mà tôi sẵn sàng lao vào.", "eng": "That's a risk I'm prepared to take."}, {"viet": "Đứa bé đó hơi quá hỗn xược!", "eng": "That child is a bit too perky!"}, {"viet": "Đó là nguồn của con sông nhỏ mà chúng ta sắp đến.", "eng": "That is the beginning of the small river we are going to."}, {"viet": "Chồng sách đó trông có vẻ như chỉ đụng thật nhẹ là nó đổ xuống.", "eng": "That pile of books looks as though it will collapse at the slightest touch."}, {"viet": "Theo tôi kiểu kiến trúc đó quá mầu mè.", "eng": "That style of architecture is too ornate for my taste."}, {"viet": "Hiện nay tu viện là một cảnh điêu tàn.", "eng": "The abbey is now a ruin."}, {"viet": "Nam diễn viên đó bước ra sân khấu với trang phục đủ lệ bộ.", "eng": "The actor came on in full costume."}, {"viet": "Các lý lẽ viện ra đều bị bác bỏ thẳng thừng.", "eng": "The allegations were all flatly denied."}, {"viet": "Con khỉ đu quăng người đi từ cành cây này sang cành khác.", "eng": "The ape swung along from branch to branch."}, {"viet": "Người khách đầu tiên đến làm cho cả cửa hiệu lăng xăng.", "eng": "The arrival of the first customer caused a flutter of activity in the shop."}, {"viet": "Thời đại cổ điển của nền văn chương Anh bao gồm các nhà văn Dryden, Swift và Pope.", "eng": "The Augustan age of English literature includes the writers Dryden, Swift, and Pope."}, {"viet": "Tin buồn như phủ một bóng tối lên cuộc họp của chúng tôi.", "eng": "The bad news cast a shadow over our meeting."}, {"viet": "Hàng rào dây thép gai đặt quanh doanh trại làm nản lòng những kẻ đột nhập.", "eng": "The barbed wire fence round the perimeter discouraged intruders."}, {"viet": "Ông thủ tướng đang bị công kích giải thích điều này trước một đám đông tức giận.", "eng": "The beleaguered prime minister explained this to an angry crowd."}, {"viet": "Những phím đen và những phím trắng.", "eng": "The black notes and the white notes."}, {"viet": "Cuốn sách chỉ ở đâu đây thôi nhưng lúc này tôi không thể tìm được.", "eng": "The book's here somewhere, but I can't lay my hands on it just now."}, {"viet": "Bí quyết thành công là làm việc chăm chỉ.", "eng": "The bottom line of success is to work hard."}, {"viet": "Bột nhồi phải nở gấp đôi cỡ ban đầu.", "eng": "The bread dough should rise to double its original size."}, {"viet": "Đi ôtô đường xóc làm chúng tôi hơi bị lắc lư chao đảo.", "eng": "The bumpy car ride shook us around a bit."}, {"viet": "Những người cắm trại đã giẫm bẹp hoa màu.", "eng": "The campers had trampled the corn."}, {"viet": "Chiếc xe ôtô đó đóng thuế đến tháng 7.", "eng": "The car is taxed until July."}, {"viet": "Nội vụ đã được trình bày một cách hợp lý.", "eng": "The case was presented very plausibly for."}, {"viet": "Vị chủ toạ động viên mọi người góp phần vào cuộc thảo luận.", "eng": "The chairman encourages everyone to contribute to the discussion."}, {"viet": "Tóc đứa trẻ mọc thành những nếp gợn sóng đẹp.", "eng": "The child's hair grew in pretty waves."}, {"viet": "Đứa bẻ bám chặt không thể làm di chuyển.", "eng": "The child was stuck tight and couldn't budge."}, {"viet": "Đám trẻ con ồn ào ùa lên chiếc xe buýt.", "eng": "The children pile noisily into the bus."}, {"viet": "Việc chọn cầu thủ cho đội bóng dường như hoàn toàn tuỳ tiện.", "eng": "The choice of players for the team seems completely arbitrary."}, {"viet": "Nhân viên khách sạn đến trải giường.", "eng": "The clerk comes to do the turn down."}, {"viet": "Chiếc áo khoác quá lớn-nó phủ cả người anh ta.", "eng": "The coat was far too big-it completely enveloped him."}, {"viet": "Hội đồng mong đợi đi đến được một quyết định sớm.", "eng": "The committee expects to come to make a decision soon."}, {"viet": "Công ty đang bán một số toà nhà để cố gắng dành tiền.", "eng": "The company is selling off some of its building in an effort to save money."}, {"viet": "Nhà ảo thuật khuơ bàn tay vài lần trên cái mũ.", "eng": "The conjuror made a few passes with his hand over the hat."}, {"viet": "Sự mất thời gian và công sức.", "eng": "The cost in time and labour."}, {"viet": "Cặp vợ chồng đó đã chia tay nhau vì họ không hợp nhau.", "eng": "The couple separated because they were not compatible."}, {"viet": "Các nhà phê bình đang hết lời ca ngợi cuốn sách mới của bà ấy.", "eng": "The critics are singing the praises of her new book."}, {"viet": "Cuộc tranh luận hiện nay về tư nhân hoá có thể sẽ trở nên gay gắt hơn trong những tuần tới.", "eng": "The current debate about privatization is likely to grow hotter in the coming weeks."}, {"viet": "Mùa đông ngày ngắn hơn.", "eng": "The days are shorter in the wintertime."}, {"viet": "Cuộc biểu tình đã được đạo diễn chu đáo để trùng hợp với chuyến đi thăm của Thủ tướng.", "eng": "The demonstration had been carefully stage-managed to coincide with the Prime Minister's visit."}, {"viet": "Quyển từ điển đó đã được xuất bản mười lần.", "eng": "The dictionary has gone through in ten editions."}, {"viet": "Nhà đại lý phân phối đó nắm được hầu hết thị trường.", "eng": "The distributor has a lock most of the market."}, {"viet": "Các bác sĩ không thể chữa khỏi hẳn được.", "eng": "The doctors couldn't bring about a real cure."}, {"viet": "Con chó tỉnh dậy, vươn mình một cái rồi lững thững bỏ đi.", "eng": "The dog woke up, had a good stretch and wandered off."}, {"viet": "Tỷ lệ bỏ học là một lời giải thích đáng trách về hệ thống giáo dục của chúng ta.", "eng": "The dropout rate is a sad commentary on our school system."}, {"viet": "Ban biên tập phải dùng chung một phòng làm việc.", "eng": "The editors have to share an office."}, {"viet": "Quân địch thắng nhờ quân số đông.", "eng": "The enemy won by force of numbers."}, {"viet": "Việc sơ tán hàng ngàn người sau một trận lụt.", "eng": "The evacuation of thousands of people after a flood."}, {"viet": "Vụ nổ làm chúng tôi chạy tứ tung.", "eng": "The explosion sent us running in all directions."}, {"viet": "Sự tâng bốc quá đáng các ngôi sao nhạc pop của đám cuồng si.", "eng": "The fans'adulation of their favourite pop stars."}, {"viet": "Đấu tranh chống nghèo khổ, tội ác, bệnh tật.", "eng": "The fight against po-verty, crime, disease."}, {"viet": "Thời tiết tốt đã cuốn các quí bà ra ngoài vườn.", "eng": "The fine weather allures the ladies into the garden."}, {"viet": "Cuộc đến thăm đầu tiên và tất cả các cuộc đến thăm tiếp theo đều được giữ bí mật.", "eng": "The first and all subsequent visits were kept secret."}, {"viet": "Chuyến bay đã có quá nhiều người đăng ký vé nên chẳng còn một chỗ nào.", "eng": "The flight has been oversubscribed, there are no seats."}, {"viet": "Khu rừng kéo dài theo con sông.", "eng": "The forest spreads as far as the river."}, {"viet": "Vấn đề trung tâm là vấn đề chính trị.", "eng": "The fundamental question is a political one."}, {"viet": "Viên tướng ước đoán quân địch chỉ còn đủ lương thực trong 5 ngày.", "eng": "The general conjectured that the enemy only had about five days supply of food left."}, {"viet": "Trong số đó có dê, lạc đà, tuần lộc, bò, cừu và trâu nước.", "eng": "The goat, camel, llama, reindeer, yak, sheep, and water buffalo are among them."}, {"viet": "Sau cuộc cách mạng chính phủ đã sụp đổ.", "eng": "The government fell after the revolution."}, {"viet": "Chính phủ có kế hoạch xây dựng một cầu qua sông.", "eng": "The government plans to build a bridge over the river."}, {"viet": "Đại đa số người tự cho mình là khoẻ mạnh.", "eng": "The great mass of men consider themselves healthy."}, {"viet": "Người khách trọ cần một cái mở nút chai.", "eng": "The guest wants a bottle opener."}, {"viet": "Thầy hiệu trưởng rầy la đám học sinh nam một trận.", "eng": "The headmaster gave the boys a scolding."}, {"viet": "Những ngọn đồi hầu như không thể nhìn thấy được qua làn sương mù.", "eng": "The hills were barely visible through the mist."}, {"viet": "Gió nóng từ sa mạc làm hoa héo úa.", "eng": "The hot wind from the desert blasted the flowers."}, {"viet": "Ngôi nhà làm cho anh thấy dễ chịu khi vào bên trong.", "eng": "The house strikes you as welcoming when you go in."}, {"viet": "Ánh sáng quá yếu không đủ để làm rõ chi tiết của bức hoạ.", "eng": "The illumination is too weak to show the detail of the painting."}, {"viet": "Mũi thuốc tiêm làm cho anh ta dễ chịu ngay.", "eng": "The injection brought him immediate ease."}, {"viet": "Cuộc điều tra cho thấy là không có sự sai phạm nào.", "eng": "The investigation revealed no impropriety."}, {"viet": "Quan toà xử nó chín tháng tù án treo.", "eng": "The judge gave him a nine-month suspended sentence."}, {"viet": "Nhà vua thường tỏ lòng khoan dung với tù nhân.", "eng": "The king often shows mercy to prisoners."}, {"viet": "Người nói sau cùng đã cho tôi cơ hội tốt tôi đang mong chờ.", "eng": "The last speaker gave me the opening I was waiting for."}, {"viet": "Những chiếc lá trở nên úa vàng vào mùa thu.", "eng": "The leaves turn brown in autumn."}, {"viet": "Ánh sáng tù mù quá không chơi tiếp được.", "eng": "The light was too murky to continue playing."}, {"viet": "Phanh chiếc xe tải hỏng và nó giết chết nhiều người đang xếp hàng lên xe buýt.", "eng": "The lorry's brakes failed, and it mowed down several people in the bus queue."}, {"viet": "Sức quyến rũ của một diễn viên điện ảnh gạo cội.", "eng": "The magnetism of a great cinema performer."}, {"viet": "Tên nhà sản xuất ghi ở phía đáy đĩa.", "eng": "The manufacturer's name is on the bottom of the plate."}, {"viet": "Kích thước của căn phòng là dài 20 bộ và rộng 15 bộ.", "eng": "The measurements of the room are 20 feet by 15 feet."}, {"viet": "Chỉ một tiếng động nhỏ nhất cũng đủ đánh thức ông ta dậy.", "eng": "The merest noise is enough to wake him."}, {"viet": "Những tên lửa được di chuyển có hộ tống.", "eng": "The missiles were moved under convoy."}, {"viet": "Sự chen lấn buổi sáng để lên xe buýt.", "eng": "The morning scrummage to board the bus."}, {"viet": "Việc sát hại bà già là một vấn đề ghê tởm.", "eng": "The murder of the old lady was the sordid affair."}, {"viet": "Lũ trẻ bên hàng xóm muốn học thổi kèn trompet, cầu sao cho chuyện đó không bao giờ xảy ra!", "eng": "The neighbours'children want to learn to play the trumpet, perish the thought!"}, {"viet": "Ông giám đốc mới là người thất bại hoàn toàn.", "eng": "The new manager is a wash-out."}, {"viet": "Tin ấy đã gây ra một sự kinh ngạc lớn lao.", "eng": "The news caused a great sensation."}, {"viet": "Sau cách mạng, bọn quý tộc đã bị tước đoạt hết tài sản.", "eng": "The nobles were dispossessed of their estates after the revolution."}, {"viet": "Cô y tá sờ đầu đứa trẻ xem nó có bị sốt không.", "eng": "The nurse felt the child's forehead to see if he had a fever."}, {"viet": "Loại quý phái Anh kiểu cổ.", "eng": "The old-fashioned type of English gentleman."}, {"viet": "Chỉ nhờ có một đợt cảm xúc trở lại trong ký ức của mình mà nhiều nhà văn thiên tài bước chân vào nghề viết văn.", "eng": "The one wave of recaptured pastiness with which many a gifted writer makes his debut."}, {"viet": "Những nhân chứng khác sẽ xác nhận điều tôi nói.", "eng": "The other witnesses will bear out what I say."}, {"viet": "Những sa mạc khô cằn của Bắc Phi.", "eng": "The parched deserts off N. Africa."}, {"viet": "Người bệnh không đáp ứng được với cách trị liệu đó.", "eng": "The patient did not respond to treatment."}, {"viet": "Số phần trăm những đôi vợ chồng dùng thuốc ngừa thai ở nước này rất cao.", "eng": "The percentage of married couples using contraceptives is very high in this country."}, {"viet": "Trên hình vẽ cho thấy một vài giống chó khác nhau.", "eng": "The picture show dogs of some of the different breeds."}, {"viet": "Kế hoạch này mà xét thật kỹ lưỡng sẽ lòi khuyết điểm ra ngay.", "eng": "The plan won't bear close inspection."}, {"viet": "Vở kịch đó đúng là một chuyện tình.", "eng": "The play is really a love story."}, {"viet": "Cảnh sát đang lùng tìm băng đó.", "eng": "The police are on the track of the gang."}, {"viet": "Hôm qua cảnh sát đã bắt giữ ba vụ.", "eng": "The police made three arrests yesterday."}, {"viet": "Chính sách được thảo ra để ngăn chặn ưu thế của một nhóm đối với nhóm khác.", "eng": "The policy is designed to the predominance of one group over another."}, {"viet": "Khoai tây dễ bị nhiều loại côn trùng làm hại.", "eng": "The potato is vulnerable to several pests."}, {"viet": "Tổng thống bãi nhiệm bộ trường ngoại giao.", "eng": "The President displaced his secretary of state."}, {"viet": "Giá các ông đề nghị thì thấp hơn nhiều so với thị trường đấy.", "eng": "The price you suggested is far lower than that in the general market."}, {"viet": "Tù nhân đó được giải ra trước tòa xét xử.", "eng": "The prisoner was brought to the court for trial."}, {"viet": "Dự án phải bỏ vì thiếu ngân sách.", "eng": "The project had to be abandoned for lack of funds."}, {"viet": "Việc ấn hành cuốn sách của ông ấy thể hiện thành tựu trong ước mơ của đời ông.", "eng": "The publication of his book represented the attainment of his life's ambition."}, {"viet": "Nữ hoàng sẽ tự tay trao tặng phẩm.", "eng": "The Queen will make the presentation herself."}, {"viet": "Phương pháp đánh giá đó đang được sắp xếp lại hoàn toàn.", "eng": "The rating system is undergoing a complete restructuring."}, {"viet": "Trung đoàn giải thể khi chiến tranh kết thúc.", "eng": "The regiment disbanded when the war was over."}, {"viet": "Phần còn lại của cầu là các nhịp liên tục.", "eng": "The rest of the bridge is a continuous span."}, {"viet": "Nghi thức khắt khe của địa vị đó gò bó cô ta.", "eng": "The rigid formality of the place suffocated her."}, {"viet": "Những con đường đó chạy ngang qua nhau ngay bên ngoài ngôi làng.", "eng": "The roads cross just outside the village."}, {"viet": "Vua và hoàng hậu xuất hiện trong những y phục lộng lẫy.", "eng": "The royal couple appeared in splendid array."}, {"viet": "Bộ phận bán hàng của công ty chúng tôi.", "eng": "The sales division of our company."}, {"viet": "Nhà trường tiêu tiền chủ yếu vào sách vở.", "eng": "The school spends money principally on books."}, {"viet": "Thượng nghị sĩ đó chất vấn tính hợp hiến của đạo luật được đề nghị.", "eng": "The senator questioned the constitutionality of the proposed law."}, {"viet": "Giá quá cao nên ở ngoài tầm tay của tôi nhiều.", "eng": "The shelf is so high it is well out of my reach."}, {"viet": "Chỉ riêng đôi giày giá 100 bảng.", "eng": "The shoes alone cost £ 100."}, {"viet": "Biển chỉ đường hướng dẫn đi theo hướng tây.", "eng": "The signpost points in a westerly direction."}, {"viet": "Một sự chệch hướng nhỏ nhất của tên lửa cũng có thể đem lại thảm hoạ.", "eng": "The smallest deflection of the missile could bring disaster."}, {"viet": "Quân lính tấn công ồ ạt vào những chướng ngại vật do đám đông quấy rối dựng nên.", "eng": "The soldiers stormed the barricades erected by the rioting crowd."}, {"viet": "Nữ diễn giả đó ngưng nói một chút để cho các lời của mình ngấm.", "eng": "The speaker paused to let her words soak in."}, {"viet": "Các ngôi sao mà chúng ta nhìn thấy trên bầu trời vào lúc ban đêm không rải đều khắp bầu trời, mà chúng tập hợp thành từng nhóm.", "eng": "The stars we see as we look up at the sky at night are not scattered evenly across the whole sky, instead, they are in groups."}, {"viet": "Câu chuyện đó đã chiếm trang nhất của các tờ báo trong nước.", "eng": "The story made the front page of the national newspapers."}, {"viet": "Vấn đề có thể được đánh giá nhiều cách khác nhau.", "eng": "The subject may be viewed in different ways."}, {"viet": "Kẻ tình nghi bị điều về đồn cảnh sát để thẩm vấn.", "eng": "The suspect was taken to the police station for questioning."}, {"viet": "Thầy giáo để cho các em tự suy nghĩ tìm ra câu trả lời cho bài toán.", "eng": "The teacher left the children to puzzle out the answer to the problem themselves."}, {"viet": "Nhiệt độ ít khi dưới-5oC, dù gió có thể khá mạnh.", "eng": "The temperature seldom goes five degrees below zero centigrade, though the wind can be rather strong."}, {"viet": "Xương đùi được nối với xương hông.", "eng": "The thigh bone is connected to the hip bone."}, {"viet": "Ứng cử viên Đảng Bảo thủ với phù hiệu hình hoa hồng to tướng màu lam.", "eng": "The Tory candidate with his big blue rosette."}, {"viet": "Người ta bắt tên phản bội đứng áp vào tường và bắn.", "eng": "The traitor was stood up against the wall and shot."}, {"viet": "Cuộc tranh luận trên TV là một sự tránh né, nó đã không tìm cách giải quyết bất cứ vấn đề cụ thể nào cả.", "eng": "The TV debate was a cop-out, it didn't tackle any of the real issues."}, {"viet": "Hai hệ thống cùng hợp tác làm việc.", "eng": "The two systems are designed to work in tandem."}, {"viet": "Việc sử dụng thẻ tính dụng tránh được khỏi phải mang theo nhiều tiền.", "eng": "The use of a credit card obviates the need to carry a lot of money."}, {"viet": "Các dân làng bị ép buộc rời khỏi nhà họ.", "eng": "The villagers are terrorized into leaving their home."}, {"viet": "Nước trong đầm lầy giúp nó giữ được tầm vóc to lớn vĩ đại của nó.", "eng": "The water in the swamps helped this giant hold up its great bulk."}, {"viet": "Cả toà nhà rung chuyển ( đu đưa ) khi quả bom nổ.", "eng": "The whole house rocked ( to and fro ) when the bomb exploded."}, {"viet": "Mụ phù thuỷ biến hoàng tử thành con ếch.", "eng": "The witch changed the prince into a frog."}, {"viet": "Ngày hôm đó ở Brighton có cơ man nào là người!", "eng": "The world and his wife were in Brighton that day!"}, {"viet": "Cách hát tình ca êm dịu của họ.", "eng": "Their beautiful singing of the madrigal."}, {"viet": "Cuộc hôn nhân của họ đã tan vỡ từ lâu trước khi họ chia tay.", "eng": "Their marriage was washed up long before they separated."}, {"viet": "Rồi tôi làm như vô tình đổ nước vào anh ta.", "eng": "Then I accidentally-on-purpose spilled water on him."}, {"viet": "Có một căn nhà gỗ ở đằng sau nhà.", "eng": "There's a hut at the back of the house."}, {"viet": "Không có gì bảo đảm rằng bà ta sẽ không từ chối tất cả điều đó.", "eng": "There's no guarantee she won't reject them all."}, {"viet": "Nhiều thịt quá, chắc chắn tôi đã tính sai số lượng.", "eng": "There's too much meat, i must have miscalculated the amount."}, {"viet": "Có sai sót trên hóa đơn.", "eng": "There are mistakes in the bill."}, {"viet": "Ở đây có nhiều hơn hôm qua hai sinh viên.", "eng": "There are two more students here than yesterday."}, {"viet": "Sự tập trung công nghiệp ở miền nam đất nước.", "eng": "There is a concentration of industry in the south of the country."}, {"viet": "Có ít hi vọng khu trú chứng bệnh.", "eng": "There is little chance to localize the disease."}, {"viet": "Không có nhiều kim loại ở thân chiếc xe hơi mới này, nó chủ yếu là chất dẻo.", "eng": "There isn't much metal in the bodywork of this new car, it's mainly plastic."}, {"viet": "Trên đỉnh núi không đủ oxy.", "eng": "There was a shortage of oxygen at the top of the mountain."}, {"viet": "Ngày đầu tiên đã bán được một số bản kha khá.", "eng": "There were a good few copies sold on the first day."}, {"viet": "Đây là cái quần dài của bố con mà.", "eng": "These are daddy's big pants."}, {"viet": "Các khoản này chưa được kiểm kê.", "eng": "These items have not been inventoried yet."}, {"viet": "Cái quần này dài mất hai insơ.", "eng": "These trousers are two inches too long."}, {"viet": "Năm nay họ tăng lương cho chúng tôi khá tồi.", "eng": "They've given us a pretty mouldy pay increase this year."}, {"viet": "Chúng đang học cách làm mũ trùm đầu.", "eng": "They are learning to make head-dresses."}, {"viet": "Họ đã đạt được kết quả đáng kinh ngạc.", "eng": "They brought off an astonishing result."}, {"viet": "Họ lừa cô ấy kí vào giấy đó.", "eng": "They deceived her into signing the papers."}, {"viet": "Chúng nó ngã xuống dòng nước sủi bọt của dòng thác.", "eng": "They fell into the seething waters of the rapids."}, {"viet": "Về nguyên tắc họ đã tán thành đề nghị đó nhưng chúng ta còn phải thương lượng các điều khoản.", "eng": "They have agreed to the proposal in principle but we still have to negotiate the terms."}, {"viet": "Họ rời làng đi nơi khác.", "eng": "They left the village and went elsewhere."}, {"viet": "Họ không hề giao thiệp rộng rãi với kẻ khác.", "eng": "They never mingled much with other people."}, {"viet": "Thật sự họ rất thích nó.", "eng": "They really like it very much."}, {"viet": "Hai người đã uống một chai rượu gìn.", "eng": "They sink a bottle of gin between them."}, {"viet": "Họ đã bỏ phiếu ủng hộ việc cấm hút thuốc ở những nơi công cộng.", "eng": "They voted in favour of the prohibition of smoking in public areas."}, {"viet": "Chúng phạm những hành động tàn ác man rợ.", "eng": "They were guilty of barbarous atrocities."}, {"viet": "Họ làm việc tích cực, nhưng những cố gắng của họ không đạt năng suất cao lắm.", "eng": "They work hard, but their efforts are not very productive."}, {"viet": "Cuốn sách này nằm trong loại sách tra cứu.", "eng": "This book falls into the category of reference books."}, {"viet": "Nơi cư trú ( tự nhiên ) của sinh vật này là rừng rậm.", "eng": "This creature's ( natural ) habitat is the jungle."}, {"viet": "Chính phủ này đã đạt thành tích tốt về vấn đề lạm phát, tôi thừa nhận với anh điều đó, nhưng nó đang làm gì với nạn thất nghiệp?", "eng": "This government has a good record on inflation, I give you that, but what is it doing about unemployment?"}, {"viet": "Đây là vợ tôi, tên Olive, con gái tôi, tên Kate và con trai tôi, tên Peter.", "eng": "This is my wife, Olive, my daughter, Kate, and my son, Peter."}, {"viet": "Lớp đá này chứa nhiều đá lửa.", "eng": "This layer of rock contains a lot of flint."}, {"viet": "Sơn này bị chảy không dùng ở trần nhà được.", "eng": "This paint is too runny to use on the ceiling."}, {"viet": "Phòng này dài gấp đôi phòng kia nhưng hẹp hơn nhiều.", "eng": "This room is twice the length of the other, but much narrower."}, {"viet": "Lý thuyết này là sự phủ định tất cả những tín điều truyền thống.", "eng": "This theory is a negation of all traditional beliefs."}, {"viet": "Những người hàng xóm ồn ào đó là nỗi tai hoạ của đời tôi.", "eng": "Those noisy neighbours are the bane of my life."}, {"viet": "Ngày nay, con người đã từ bỏ ý nghĩ cổ xưa này.", "eng": "Today people have given up that old idea."}, {"viet": "Vô tuyến truyền hình có thể là một sự giải trí dễ chịu sau một ngày làm việc vất vả.", "eng": "TV can be a welcome distraction after a hard day's work."}, {"viet": "Các vụ phun núi lửa tạo nên các hòn núi mới và bứt rời các đỉnh núi cũ.", "eng": "Volcanic eruptions build up new mountains and tear the tops off old ones."}, {"viet": "Chúng tôi muốn nhận hàng trước thứ sáu tới.", "eng": "We'd like the goods to arrive by next Friday."}, {"viet": "Chúng ta hiểu lầm nhau, tôi đang nói về thiên văn học còn anh đang nói về khoa chiêm tinh.", "eng": "We're at cross-purposes, I'm talking about astronomy, you're talking about astrology."}, {"viet": "Chúng tôi hết sức mong đợi được gặp lại ông.", "eng": "We're so much looking forward to seeing you again."}, {"viet": "Chúng tôi mất nhiều khách hàng quen từ khi tăng giá.", "eng": "We've lost a lot of custom since our prices went up."}, {"viet": "Chúng tôi ước chừng khoảng cách là 2 dặm.", "eng": "We approximate the distance as two miles."}, {"viet": "Chúng tôi sẵn sàng cho các ông mức hoa hồng là 5%.", "eng": "We are willing to offer you commission of 5%."}, {"viet": "Chúng tôi có thể khẳng định với các ông là hàng sẽ được giao đúng hẹn.", "eng": "We can assure you the goods will be delivered on time."}, {"viet": "Thậm chí chúng ta có thể xin phép Công ty Điện tử Jones trích dẫn vài số liệu về việc sản xuất cải tiến của họ.", "eng": "We could even ask Jones Electronics for permission to quote some of their improved production figures."}, {"viet": "Chúng tôi không sống ở đây mà chỉ đến chơi thôi.", "eng": "We don't live here, we're just visiting."}, {"viet": "Chúng tôi đi bơi hàng ngày trong thời gian hè.", "eng": "We go swimming every day during the summer."}, {"viet": "Chúng ta phải cắt quỹ du lịch của chúng ta đi rất nhiều.", "eng": "We had to trim a lot off our travel budget."}, {"viet": "Chúng tôi có nước cam vắt, Seven-up, trà và cà phê.", "eng": "We have orange juice, Seven-up, tea and coffee."}, {"viet": "Chúng tôi chỉ tìm cách để đặt thắng lợi.", "eng": "We just managed to win, but it was a close thing."}, {"viet": "Chúng tôi đã tìm được cách đạt được một thứ tạm ước.", "eng": "We managed to achieve a kind of modus vivendi."}, {"viet": "Chúng ta phải gấp rút tiếp tục đồ án không bỏ phí thời gian.", "eng": "We must press on with the project without wasting time."}, {"viet": "Chúng tôi tổ chức nhiều hoạt động xã hội khác nhau, nhưng không phải tất cả các thành viên đều muốn tham gia.", "eng": "We organize various social activities, but not all the members want to be drawn in."}, {"viet": "Chúng tôi mới xem được một ít phong cảnh vì mới tới đây được có hai tiếng đồng hồ.", "eng": "We saw few of the sights as we were only there for two hours."}, {"viet": "Chúng tôi đứng giáp lưng vào nhau xem ai cao hơn.", "eng": "We stand back to back and let's see who is taller."}, {"viet": "Chúng tôi hồi hộp nín thở chờ nghe công bố người thắng cuộc.", "eng": "We waited with bated breath for the winner to be announced."}, {"viet": "Chúng tôi hy vọng một sự cải thiện song sự việc lại ngày càng xấu hơn.", "eng": "We were hoping for an improvement but things have gone from bad to worse."}, {"viet": "Chúng tôi thán phục về tốc độ nó chạy để đến nơi.", "eng": "We wondered at the speed with which it arrived."}, {"viet": "À, tôi không quen dùng thịt bò tái, anh biết đấy.", "eng": "Well, I'm not used to having it rare, you know."}, {"viet": "À, vào buổi sáng, trên đường đến đó chúng tôi đã lái xe qua thung lũng.", "eng": "Well, we drove through the valley on our way there in the morning."}, {"viet": "Anh đánh giá tình hình thế nào?", "eng": "What's your appraisal of the situation?"}, {"viet": "TỐI NAY ANH ĐỊNH LÀM GÌ?", "eng": "WHAT ARE YOU GOING TO DO TONIGHT?"}, {"viet": "Bạn nghĩ gì về dược thảo?", "eng": "What do you think about herbal medicines?"}, {"viet": "Món nào trong thực đơn có vị hơi ít dầu mỡ?", "eng": "What is on the menu that is kind of light tasting?"}, {"viet": "Chương trình truyền hình bạn ưa thích là gì?", "eng": "What is your favorite T. V. program?"}, {"viet": "Ông dự tính mua trong khoảng giá nào?", "eng": "What price range are you thinking of?"}, {"viet": "Bạn nghĩ anh ấy thích kiểu con gái nào?", "eng": "What type of girl do you think he would like?"}, {"viet": "Bạn tìm thời gian đọc sách vào lúc nào?", "eng": "When do you find time to read?"}, {"viet": "Khi tôi nói rằng giá cả của các ông quá cao, tôi không có ý nói rằng chúng chỉ cao có 2%.", "eng": "When I say that your prices are too high, I don't mean that they are high only by 2%."}, {"viet": "Khi nhà vua băng hà, thái tử lên kế vị ( ngôi báu ).", "eng": "When the king died, his eldest son succeeded ( to the throne )."}, {"viet": "Khi xong chương này anh hãy đọc chương tiếp.", "eng": "When you've finished this chapter go on to the next one."}, {"viet": "Dòng sông nhỏ này đổ vào sông Rhine ở chỗ nào?", "eng": "Where does this stream merge into the Rhine?"}, {"viet": "Nơi nào lạnh hơn, Bắc Cực hay Nam Cực?", "eng": "Which is colder, the Arctic or Antarctica?"}, {"viet": "Chính phủ Anh từ chối không xác nhận các tin đồn.", "eng": "Whitehall is refusing to confirm the reports."}, {"viet": "Ai là người đầu tiên chạy một dặm dưới bốn phút?", "eng": "Who was the first man to run a mile in under four minutes?"}, {"viet": "Tại sao bạn không gọi điện cho ông John Smith?", "eng": "Why don't you call John Smith?"}, {"viet": "Bạn có thể chiếu phim cho chúng tôi xem được không?", "eng": "Will you able to project the firm for us?"}, {"viet": "Việc được cấp học bổng đã làm cho cô ta cực kỳ phấn khởi.", "eng": "Winning the scholarship gave her a tremendous lift."}, {"viet": "Họ bất lực khi không có vũ khí trong tay.", "eng": "Without their weapons they were helpless."}, {"viet": "Ông hãy liếc qua những sự tính toán này xem có đúng không?", "eng": "Would you cast your eye over these calculations to check that they are correct?"}, {"viet": "Bạn có muốn định cư ở quê bạn không?", "eng": "Would you like to settle down in your hometown?"}, {"viet": "Đấu vật nằm lấp lửng giữa thể thao và vui chơi giải trí.", "eng": "Wrestling is in a twilight zone between sport and entertainment."}, {"viet": "Vâng, tôi đi với nhóm thuê bao.", "eng": "Yes, I'm with the charter group."}, {"viet": "Tốt hơn là anh nên đi ngay bây giờ nếu anh muốn chắc chắn đến đó đúng giờ.", "eng": "You'd better leave now if you want to make certain of getting there on time."}, {"viet": "Anh sẽ nhìn thấy nhà của chúng tôi ở phía tay trái, ngay trước con đường phân nhánh.", "eng": "You'll see our house on the left just before the road forks."}, {"viet": "Anh đã làm tôi lây cảm lạnh của anh.", "eng": "You've given me your cold."}, {"viet": "Các cậu không thể cả hai cưỡi lên xe đạp cùng một lúc được-phải lần lượt chứ.", "eng": "You can't both use the bike at once-you'll have to take turns."}, {"viet": "Ông có thể tin cậy tôi, thưa ông.", "eng": "You can count on me, sir."}, {"viet": "Anh không thể lấy cớ rằng trên đời này không có điều xấu.", "eng": "You cannot pretend there's no evil in the world."}, {"viet": "Anh hãy tra dầu vào bánh xe cho nó trơn.", "eng": "You grease on a wheel to make it turns more easily."}, {"viet": "Ông biết đấy, đêm nay là đêm giao thừa ở Trung Quốc, năm âm lịch và nó cũng được gọi là Tết.", "eng": "You know, tonight is the Eve of the Chinese New Year, the Chinese Lunar Year and it is also called the Spring Festival."}, {"viet": "Tất cả các người phải mặt tại đây lúc 8 giờ sáng, tôi không thể chấp nhận cho một trường hợp ngoại lệ nào.", "eng": "You must all be here at 8am, I can make no exceptions."}, {"viet": "Anh không được tỏ ra ủng hộ ai trong cuộc tranh luận của họ.", "eng": "You mustn't take sides in their argument."}, {"viet": "Anh nên lấy làm xấu hổ, ở tuổi anh mà nói dối.", "eng": "You should be ashamed of yourself telling lies at your age."}, {"viet": "Anh không đế ý đến tình cảm của ai khác ngoài bản thân mình.", "eng": "You show no consideration for any one but yourself."}, {"viet": "Anh sẽ thích nó khi anh thấy công viên Kim Môn và Cầu tàu Fishermen.", "eng": "You will like it when you see Golden Gate Park and Fishermen's Wharf."}, {"viet": "Chữ ký duyệt của ông phải khớp với chữ ký mẫu.", "eng": "Your countersign must correspond with the specimen signature."}, {"viet": "Truyện của anh gần giống với những sự việc mà chúng tôi đã biết.", "eng": "Your story approximates to the facts we already know."}]